{
  "id": 1683,
  "origin_website": "Cell",
  "title": "Protocol for determining the regulation of lipid kinases and changes in phospholipids in vitro",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPrecipitation of protein from mammalian cells\nTiming: 3 days (depends on optimal transfection day)\nPurify proteins (kinase and/or substrate) using HEK 293T cells. This may be omitted if commercial recombinant proteins are available.\nSeed HEK 293T cells in 140 mm cell culture dishes.\nTransfect cells with plasmid containing gene of interest with tag:\nOne/two days later, wash cells with PBS three times and lyse in ice-cold lysis buffer.\nIncubate lysates on ice for 30 min.\nCentrifugate at 16,100g for 10 min at 4°C.\nIn the meantime, wash magnetic beads three times with wash buffer using a magnet.\nIncubate post-nuclear supernatant with magnetic beads at 4°C on a rotating wheel for 1–2 h (time depends on the manufacturer’s instructions).\nCentrifugate briefly and remove supernatant. Wash the beads three times with wash buffer. Mix by inverting tubes.\nNote: If working with large quantities, proteins may be eluted using a peptide that competes with the bead-protein binding.\nProtein purity should be assessed using Coomassie or Silver stained gels, which can also be used to estimate protein concentrations by adding one or more lanes with defined amounts of a protein of known concentration as described below in c.\nRecommended. Determine protein concentration of the bead-bound protein:\nPrepare a stock solution of BSA (10 mg/mL).\nPrepare 7 dilutions of BSA.\nAdd 2× Laemmli buffer with β-mercaptoethanol to 10 μL of each BSA solution and 10 μL of bead-bound protein. After boiling samples at 100°C for 5 min, run samples on SDS–PAGE at 100 V for 2 h.\nIncubate the gel with Coomassie Blue stain to determine the relative protein amount bound by the beads and ensure that additional bands are not present.\nWash bead-bound protein with buffers as described below.",
    "Critical: If large amounts of protein have been precipitated, aliquot and store at −80°C to avoid freeze and thaw. We suggest using magnetic beads. Agarose resin beads may be used if protein is eluted from the beads. However, we do not suggest using agarose resin-tagged protein for further steps, as the agarose resin cannot be washed off the membrane used in future steps.\nNote: While in this study, we used a precipitated substrate (HA-PIKfyve) and a recombinant commercial kinase (ULK1) without experiencing technical issues, this step may be skipped if both proteins are available as commercial products. Alternatively, both proteins may be purified using HEK 293T cells.\nNote: Since the relative ratio of substrate to kinase may affect the outcome of the kinase activity, we recommend determining the concentration of precipitated substrate and performing a kinase assay with varying concentrations of substrate to determine the optimal conditions.\nIn vitro lipid kinase assay\nTiming: 1 h\nIn this step an in vitro kinase assay was performed assessing whether the ULK1-mediated phosphorylation of PIKfyve leads to an increase in the lipid kinase activity of PIKfyve. Prior to this, we performed a malachite green-based in vitro kinase assay and found that ULK1 phosphorylates PIKfyve. Here, we assess whether ULK1 phosphorylation of PIKfyve leads to an increase in the lipid kinase activity of PIKfyve.\nPrepare phosphoinositides for the kinase assay:\nPrepare a 1:1 solution of methanol and chloroform.\nAdd to glass vial containing PI or PI(5)P lipids for a 1 mM stock. Glass vials will minimize sticking that can occur to plastic tubes.\nAdd PI solution to empty tubes (n tubes depends on the number of reactions) for a final concentration of 100 μM.",
    "Dry off the chloroform using an argon gas flux until all liquid has evaporated and a film is visible at the bottom of the tube.\nReconstitute lipid in lipid buffer.\nSonicate twice for 30 s on ice.\nPrepare kinases:\nWash the precipitated proteins three times with RIPA buffer, twice with buffer A, three times with buffer B, twice with buffer C and twice with assay buffer.\nIncubate lipid kinase, protein kinase (10 nM) and ATP (50 μM) in assay buffer (total volume 50 μL) for 15 min at 37°C in a non-adherent tube.\nNext, add the reaction mix to tube containing PIs (100 μM). Incubate for additional 15 min at 37°C.\nNote: The time points are subject to change depending on the kinase.\nSet up the reactions in Table 2[href=https://www.wicell.org#tbl2]:\nStop the reaction by adding 200 μL 1N HCl. The lipids should be used directly in the next step as phospholipids may be unstable when frozen. If required, we recommend storing lipids in an organic solvent such as chloroform in a tightly sealed glass vial and storing at −20°C.\nCritical: The purified kinases should be as pure as possible. The wash steps will ensure dissociation of interactors. To limit confounding variables, SDS-PAGE may be performed for the precipitated kinases, assessing whether additional bands are visible after a Coomassie Blue stain as mentioned earlier.\nCritical: If inhibitors of the protein kinase and/or the lipid kinase are available, these should be included in the assay as additional controls. Inhibitors and kinases should be incubated prior to initiation of the kinase assay.\nNote: If the phosphorylation sites are known, we suggest using phospho-mutant and phospho-mimic forms of the lipid kinase to further validate the effect of the protein kinase on the lipid kinase.",
    "Note: The SDS and sodium deoxycholate in the RIPA buffer may cause partial denaturation of some proteins. While this was not observed in our study, compromised activity of certain enzymes caused by these detergents in RIPA buffer may necessitate the use of non-ionic detergents instead. The use of negative and positive controls would help ensure that a lack in activity is not caused by buffer compositions.\nNote: EDTA may interfere with the activity of some kinases. If kinase activity is too low, adjust buffers accordingly.\nNote: Some kinases may depend on accessory proteins for activation of their kinase function. Orthogonal tools should be employed to assess the requirement for additional proteins.\ntable:files/protocols_protocol_1143_12.csv\nAn overview of reactions that contain lipid kinases, protein kinases, phosphoinositides (PI) and ATP with appropriate controls.\nLipid extraction\nTiming: 1 h, 20 min\nIf the lipid kinase has become activated in the in vitro kinase assay, this should lead to a generation of phospholipids.\nExtract lipids from the kinase reaction:\nAdd 160 μL 1:1 chloroform:methanol to the tube containing the reaction to create a biphasic system.\nVortex and centrifuge tube at 10,000g for 2 min.\nRemove the upper methanol layer containing the kinases.\nWash the lower chloroform layer twice with 100 μL of 1:1 of methanol:1N HCl.\nUse an argon gas flux to remove excess volume.\nApply the resulting lipid solution left in the tube to a nitrocellulose membrane.\nAccording to the lipid of interest, prepare the following steps:\nDilute lipids in a 2:1:0.8 solution of methanol:chloroform:water in 5–8 serial dilutions starting with 100 μM.\nSpot 5 μL of each dilution on the same nitrocellulose membrane as the lipids extracted from the kinase reactions.\nAir-dry the membrane at room temperature for 1 h.",
    "Note: To prevent the membrane from curling upon spotting with lipids, tape it firmly to a flat surface. Once dry, use a clean razor blade to cut within the edges of the tape to use it for the next steps.\nProtein lipid overlay assay\nTiming: 1 day\nThe objective of this part of the protocol is to assess changes in lipid synthesis as a result of the lipid kinase activation by the protein kinase of interest. This step requires knowing whether the lipid of interest is bound by any given protein (see above). In our study, we used GST-tagged ING2, as this protein is known to bind PI(5)P.\nIncubate the membrane containing lipid spots in blocking buffer for 1 h at room temperature.\nIncubate the membrane overnight at 4°C with 10 nM GST-ING2 protein in blocking buffer in 4°C.\nThe next day, wash the membrane 10 × 5 min with TBS-T.\nIncubate the membrane with a 1:2000 dilution of anti-GST monoclonal antibody in blocking buffer for 1 h at room temperature.\nWash the membrane 10 × 5 min with TBS-T.\nIncubate the membrane with secondary antibody for 1 h to visualize the GST-tagged protein bound to your lipid of interest. We used of DyLight Fluors-conjugated secondary antibody in TBS-T at 1:5000 for 1 h.\nWash the membrane 10 × 5 min with TBS-T and 1 × 5min with TBS.\nVisualize with direct infrared fluorescence detection using LICOR-Odyssey apparatus/Bio-Rad ChemiDoc.\nNote: If the products of the lipid kinase in question have yet to be characterized, this tool allows detection of generated lipids by performing serial dilutions of other phospholipids and repeating the above assay with tools that enable their identification and quantification - e.g., Table 1[href=https://www.wicell.org#tbl1]."
  ],
  "subjectAreas": [
    "Metabolism",
    "Cell Biology",
    "Signal Transduction",
    "Protein Expression And Purification",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}