{
  "id": 7544,
  "origin_website": "Bio",
  "title": "A Novel Standardized Peripheral Nerve Transection Method and a Novel Digital Pressure Sensor Device Construction for Peripheral Nerve Crush Injury",
  "procedures": [
    "For the Stepwise Transection with fibrin Glue (Needs one surgeon and one assistant):  Sanitize the surgical area with 70% ethanol, and organize the packets of autoclaved surgical instruments and surgical drapes in a tray.Anesthetize the mouse with an intraperitoneal injection of ketamine/xylazine mixture (0.1 mL/10 g) in the animal preparation area.Assess the depth of anesthesia by at least one indicator of deep pain recognition (pedal reflex, pinna reflex, etc.) to ensure adequate anesthesia.Apply ophthalmic ointment to both eyes to prevent desiccation.Remove hair in the right or left hind limb, and sterilize the surgical site thrice, by using alcohol prep (saturated with 70% ethanol) and povidone-iodine solution (10%) alternately.Place the mouse under an operating microscope with the hindlimb in semi-flexion posture, using surgical skin tape (Figure 3A).Put on the sterile surgical gloves in an aseptic manner.Cover the mouse with sterile drapes and expose the surgical site (Figure 3B). Unpack the autoclaved surgical instruments on another sterile drape.Make a skin incision along the gluteal fold (about 3 cm), and split the gluteal muscle using scissors and forceps, to expose the sciatic nerve (Figure 3C–D).Do not free the sciatic nerve from the surrounding connective tissue, as this contributes to prevent gap formation after nerve transection.Under an operating microscope, using the fine microscopic scissors cut the nerve incompletely to 80% of its width, to prevent gap formation (Figure 3E).Apply 7–10 µL of fibrinogen firstly, and 7–10 µL of thrombin at the transection site.As soon as possible, cut the remaining nerve completely before complete clotting of the fibrin glue applied (Figure 3F).Close the wound with surgical staples and inject buprenorphine (0.05 mg/kg) subcutaneously.Return the mouse to a clean cage and keep the cage on a heating pad until the mouse wakes up.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4350/bioprotoc-12-05x-4350-g003.jpgFigure 3. Stepwise nerve transection with fibrin glue. A.",
    "Position of the prepped mouse under the operating microscope. B. Position of the right hindlimb surgical site within the window of autoclaved drape sheet. C. Exposure of the sciatic nerve (SN) between the biceps femoris (BF) and the quadriceps femoris (QF) muscles. D. Exposed sciatic nerve and its position before transection. E. Cutting ~80% of the sciatic nerve. E. Cutting the remaining ~20% of the nerve completely.For the Pressure Sensor Device Construction Device assembly All connections are made by soldering. See pinout diagram for connection overview (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4350/bioprotoc-12-05x-4350-g004.jpgFigure 4. Pinout diagram. Schematic representation of PrecisionPinch system containing Arduino UNO (A), Micro SD card adapter (B), force sensitive resister (FSR) FlexiForce A301 (C), and 16x2 LCD screen (D).Connect male pin connectors to PCB shield board (Figure 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4350/bioprotoc-12-05x-4350-g005.jpgFigure 5. PCB shield board and pin connectors. Use pliers to straighten out the pins on the Micro SD TF card adapter reader module, and connect them to board (Figure 6).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4350/bioprotoc-12-05x-4350-g006.jpgFigure 6. Connect Micro SD card adapter. Use 20-gauge solid wire to connect the Micro SD card adapter reader module to the appropriate locations: GND to GND, MISO to D12, MOSI to D11, SCK to D13, CS to D10. Solid wire is easier to solder. Connect a longer wire (~15 cm in length) to VCC. This will later be joined to +5V (Figure 7).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4350/bioprotoc-12-05x-4350-g007.jpgFigure 7. Connect Micro SD card adapter to appropriate locations on board. Connect six lengths of 20-guage wire (~15 cm in length) to the digital output connections of the board at D2–D7. Leave the other end to be attached later (Figure 8).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4350/bioprotoc-12-05x-4350-g008.jpgFigure 8. Connect wire to digital outputs. Connect male pin connectors to LCD display, then solder connectors to board (Figure 9).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4350/bioprotoc-12-05x-4350-g009.jpgFigure 9. Solder in LCD display.",
    "Connect LCD VCC to +5V, then add on 10 KOhm potentiometer by connecting left pin to +5V, middle pin to LCD V0, and right pin to VSS (Figure 10). Refer to pinout diagram for clarification.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4350/bioprotoc-12-05x-4350-g010.jpgFigure 10. Connect potentiometer (red arrow) and power to the LCD display. Connect the 220 Ohm resistor (red arrow) to LCD D15 and +5V (Figure 11). Refer to pinout diagram for clarification.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4350/bioprotoc-12-05x-4350-g011.jpgFigure 11. Connect the 220 Ohm resistor. Connect the 10 KOhm resistor (red arrow) to the board (Figure 12).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4350/bioprotoc-12-05x-4350-g012.jpgFigure 12. Connect 10 KOhm resistor. Connect stranded wire, leaving the desired length for the force sensor resistor. Connect FSR pin 1 to +5V. Connect FSR pin 2 to A0 on board. Connect 10 KOhm resistor to GND and FSR pin 2 (Figure 13).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4350/bioprotoc-12-05x-4350-g013.jpgFigure 13. Connect FSR wires. Wrap the longer wires from steps 3 & 4 around to the LCD and connect as follows: Micro SD card adapter VCC to +5V, board D2 to LCD D7, board D3 to LCD D6, board D4 to LCD D5, board D5 to LCD D4, board D6 to LCD E, and board D7 to LCD RS (Figure 14).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4350/bioprotoc-12-05x-4350-g014.jpgFigure 14. Connect digital outputs to LCD screen. Connect stranded wire to FSR, and reinforce with electrical tape (Figure 15).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4350/bioprotoc-12-05x-4350-g015.jpgFigure 15. Connect FSR. Connect toggle switch to 9V battery clip in series. Connect 9V battery.Insert Micro SD card into Micro SD card adapter.Attach Arduino Uno by fitting the male pins of your device into the female connecters on the Arduino. Plug 9V battery power into the Arduino.Use a computer-aided design (CAD) to make a housing unit for the device. We recommend Tinkercad or Slidworks. Print unit with 3D printer. Our housing design is available at https://github.com/gwandling/PrecisionPinch[href=https://github.com/gwandling/PrecisionPinch]. Device construction is complete (Figure 16).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4350/bioprotoc-12-05x-4350-g016.jpgFigure 16. Completed pressure sensor device with portable housing unit.",
    "Programming and Calibration for the Pressure Sensor Download the open source Arduino software from the company website.Download the PrecisionPinch Software from https://github.com/gwandling/PrecisionPinch[href=https://github.com/gwandling/PrecisionPinch].Plug in Arduino to your computer and upload the PrecisionPinch software to the device.Calibrate the device by plotting the measured resistance against a known pressure by using known weights. We recommend a weight series from 2.5 to 25 lbs. Be sure to use Force = Pressure/Area in consideration of your calculations. Next, convert resistance to conductance. Use the inverse of this plot to formulate a calibration equation. An example calibration file can be found at https://github.com/gwandling/PrecisionPinch[href=https://github.com/gwandling/PrecisionPinch].Correct the calibration equation in the PrecisionPinch software with your own calibration equation.Upload your modified software to the device.The device is now ready for use.Data Retrieval for Pressure Sensor With the use of a computer, data can be retrieved after device use from the micro SD card under the file DATALOG.txt. This file can be uploaded to Microsoft Excel for further analysis. An example is shown in Figure 17.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4350/bioprotoc-12-05x-4350-g017.jpgFigure 17. Example of PrecisionPinch data. A representative tracing showing the time-course for crush injury pressure generated by a forceps and graphed in Excel. Pa, pascals; ms, millisecond."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}