{
  "id": 14122,
  "origin_website": "Jove",
  "title": "Inchworming: A Novel Motor Stereotypy in the BTBR T+ Itpr3tf/J Mouse Model of Autism",
  "procedures": [
    "All procedures were carried out in accordance with the Canadian Animal Care Committee and approved by the University of Calgary Animal Care Committee. \n1. Animal Preparation\nIsolate mice overnight (12 hr) prior to testing. To do this, place all of the BTBR and B6 mice (P35-P40) needed for experimental analysis in cages by themselves, the day before testing.\nPlace the isolated mice in the behavioral analysis room 30 min prior to testing so that animals will habituate to the novel environment.\n2. Equipment Preparation\nPlace the 30 x 30 cm Plexiglas box with a removable lid in the testing room. Place the box on a table and position the video camera to a 45° angle from the bottom; this location of the camera will permit visualization of the entire floor of the enclosure and the mouse. Use an infrared backlight to help minimize glare from the wall of the box.\nUse a video camera that possesses a high zoom function with infrared capabilities to optimize filming in a low lux environment. Focus the camera on the enclosure enlarging the image so that the mice are visualized throughout the entire box.\nCover the entire floor of the box with sawdust bedding (should be approximately 1 inch deep).\n3 Testing Procedure\nPlace an intra-strain pair of mice (BTBR - BTBR or B6-B6) within the testing enclosure.\nTurn the lights off in the testing room.\nStart the video camera to record and exit the room. This will prevent experimenter influence on the behavior of the mice. Record the activity for 11 min.\nOnce the recording is complete, re-enter the testing room and return the mice to their original home cages.",
    "Dispose of the sawdust bedding, wash the entire testing box with 70% ethanol, and place new sawdust bedding in the bottom of the testing enclosure.\nRepeat the entire procedure for the rest of the intra-stain pairs and return the mice to their original home cages.\nNote: To verify the reliability of the inchworming data, the procedure may be repeated on subsequent days with different BTBR-BTBR and B6-B6 pair combinations. This will ensure that the observed behavior is not dependent upon the specific partner in the enclosure, but the inchworming individual.\n4. Data Analysis\nInchworming is defined as the synchronous inward and outward movement of the animal's fore- and hind-feet, with a minimum of one co-occurring inward and then subsequent outward movement that effectively displaces the bedding. Manually watch and score each video twice (once for each mouse) to ascertain the total duration, frequency, and latency to inchworm in the 10 min video. Manual scoring of inchworming duration, frequency and latency should be based on the following definitions:\nInchworming Duration: Is defined as the total time each mouse spends engaged in the inchworming behavior. To score this aspect of inchworming, use a timer that can be started and stopped. Start timing when the mouse begins to inchworm and stop the timer when the mouse stops inchworming. When and if the mouse begins to inchworm again, re-start and re-stop the timer. Repeat the starting and stopping of the timer for the duration of the 10 min observation period each time the mouse inchworms. This will generate an inchworming duration score that is between 0:00 and 10:00 min.",
    "Inchworming Frequency: Is defined as the number of times the mouse engages in the inchworming behavior in the 10 min observation period. A single count is awarded each time the mouse starts and stops inchworming. The inchworming frequency score will be a number between 0 and ∞.\nLatency to Inchworm: Is defined as the time that passes prior to the first onset of inchworming. Start the timer when the video starts, this will be time 0:00, and stop the timer when the mouse inchworms for the first time. If the mouse does not display the inchworming behavior the latency to inchworm will be 10:00. When analyzing latency to inchworm, a score between 0:01 and 10:00 min will be obtained. Mice that fail to inchworm for the duration of the testing period should be removed from the sample population to ensure that the results are pertinent to a population of mice that display the inchworming behavior.\nCalculate the total frequency and duration of inchworming for each mouse in the video. Calculate the time required for the first mouse in the pair to inchworm for the latency to inchworm for that specific pair of mice. These parameters are based on prior methodological work related to repetitive digging behaviors in mice6.\nCalculate the average duration, frequency, and latency to dig for each experimental group in the analysis (i.e. BTBR vs. B6). Use an ANOVA or a t-test to compare data between strains/experimental groups.\n\tNote: When the procedure is completed on a second day, use a repeated measures ANOVA to ensure that there were no subsequent trial effects or pairing effects.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}