{
  "id": 10939,
  "origin_website": "Jove",
  "title": "Assessing the Influence of Personality on Sensitivity to Magnetic Fields in Zebrafish",
  "procedures": [
    "The following protocol has been approved by the Institutional Animal Care and Use Committee of the University of Naples Federico II, Naples, Italy (2015).\n1. Animal Maintenance\nUse tanks of at least 200 L to host a shoal of at least 50 individuals of both sexes in each tank.\nNOTE: The density of the fish in the tank has to be one animal per 2 L or lower. Under these conditions, zebrafish will display normal shoaling behavior.\nSet the maintenance conditions as follow: temperature at 27–28 °C; conductivity at <500 μS; pH 6.5–7.5; NO3 at <0.25 mg/L; and a light:dark photoperiod at 10 h:14 h.\nNOTE: Identical holding conditions must be used for both the mixed population and the separated proactive and reactive populations.\n2. Personality Selection in Zebrafish\nPrepare and place the personality selection tank in a quiet room (Figure 3) with the same water as used in the maintenance tanks.\nPlace a video camera above or at the side of the tank. Connect the camera to a computer with a monitor located in an area where there is no visual contact with the tank.\nSelect nine fish at random from the maintenance tank and transfer them to the dark side of the personality selection tank, using a knotless net.",
    "NOTE: Try to limit the interactions with the tanks and fish to the least amount of time possible. Avoid noise and fast movements. If necessary, transfer the animals in a small volume transporting tank (about 2 L) with water from the holding tank. To avoid air exposure of animals, use a 250 ml beaker and gently induce the animal to enter the beaker. Try to minimize the capture time, avoid collecting multiple fish as it might cause physical damage to the animals and do not hold fish for more than a few seconds in the net as these factors can increase stress. Fish must be fed ad libitum prior to the transfer to the experimental tank. This limits the possibility that different tendencies of food-seeking behavior would affect the behavior of the individuals during the following experiment22. Conduct replicate experiments at the same time of the day. This minimizes variability in the behavior of the experimental groups caused by possible circadian rhythms23.\nAfter 1 h of acclimatization, open the sliding door.\nNOTE: Individuals who exit from the hole, exploring the bright side of the tank within 10 min, are considered proactive21.\nAfter 10 min, gently remove the proactive individuals from the tank and transfer them to the proactive maintenance tank.\nAfter 15 min, collect the fish that remain in the dark box, which are considered reactive21, and transfer them to the reactive maintenance tank.\nNOTE: Discard fish that move to the bright side of the tank after 10 min21. Perform the personality test with nine fish at a time until the desired number of proactive and reactive fish necessary for the tests described in section 5 are collected. Consistency of the proactive and reactive personality can be checked regularly using the same approach.",
    "3. Set up of the Magnetic Field with the One-dimensional Magnetic Field Manipulation27\nSwitch on the Power unit (Figure 2A).\nPlace the coiled tunnel in the location where the rheotactic protocol will be performed (section 5) but keep it disconnected from the swimming apparatus (Figure 2A). Place a magnetic probe connected with a Gauss/Teslameter inside the tunnel and verify which voltage is necessary to obtain the chosen magnetic field value along the major axis of the tunnel.\nNOTE: Because of the magnetic properties of a solenoid, the field is reasonably uniform inside the tunnel; this can be checked by slowly moving the probe both horizontally and vertically.\nDisconnect the probe and connect the flow tunnel to the swimming apparatus.\nStart with the rheotactic protocol (section 5).\n4. Set Up of the Magnetic Field with the Three-dimensional Magnetic Field Manipulation27\nSwitch on the CPU, DAC, and coil drivers (Figure 2B).\nSet the chosen magnetic field on each one of the three axes (x, y, and z).\nPlace the tunnel in the center of the Helmholtz pairs set.\nStart with the rheotactic protocol (section 5).\n5. Test of the Zebrafish Rheotaxis in the Flow Chamber\nTransfer one to five fish to the flow tunnel using a 2 L tank with the sides and the bottom obscured.\nTurn on the pump and set the flow rate in the tunnel to 1.7 cm/s.\nNOTE: This slow-moving water will keep the water in the tunnel oxygenated and it will facilitate animal recovery.\nLet the animals acclimate to the swimming tunnel for 1 h.\nStart the video recording of the behavior of the fish in the tunnel.\nNOTE: We used a camera (e.g., Yi 4K Action) with remote control (e.g., Bluetooth) and saved the video as .mpg (30 frames/s).",
    "Start the stepwise increase of the flow rate according to the chosen experimental protocol (1.3 cm/s in this study; Figure 4).\nNOTE: For this protocol, we used low flow rates which, for zebrafish, range from 0 to 2.8 BL (body lengths)/s. These flow speeds are in the lower range of flow rates that induce continuous oriented swimming in zebrafish (3%–15% of critical swimming speed [Ucrit])24. The use of low flow rates (following Brett’s protocol25) is linked to the speciﬁc behavioral characteristics of this species in the presence of water currents. Zebrafish tend to swim along the major axis of the chamber, turning frequently, even in the presence of water ﬂow, and tend to swim both upstream and downstream24,26. This behavior is affected by the water ﬂow rate, disappearing at relatively high speeds (>8 BL/s)26, when the animals continuously swim facing upstream (full positive rheotactic response). Vertical and transversal displacements are very rare.\nPerform morphometry of the animals (sex and total length [TL], fork length [FL], or BL) on pictures of fish in a morphometric chamber​.\nSelect the appropriate picture.\nOpen the picture in ImageJ.\nTake note of the sex of the animal (male zebrafish are slender and tend to be yellowish, while females are more rounded and tend to have blue and white colorings).\nClick Analyze > Set Scale and set the scale of the image in centimeters, using the whole horizontal length of the tunnel as reference.\nClick Analyze > Measure and record the linear length of the animal.\nCalculate its body weight (BW).\nNOTE: BW is calculated from sex-FL-BW relationships previously built in the lab or from metadata. The whole procedure avoids manipulation stress on the animals.\n6. Video Tracking\nOpen the video file with Tracker 4.84 Video Analysis and Modeling Tool.",
    "NOTE: If necessary, correct any video distortion using perspective and radial distortion ﬁlters.\nClick on Coordinate system in the upper menu and set the length units to centimeters and the time units to seconds.\nClick on File > Import > Video and open one of the videos in Tracker 4.84.\nClick on “Coordinate axes” and set the reference system to track the position of the fish over time, with the x axis along the tunnel. Set the origin at the low corner of the downstream ending wall (at the water outlet).\nClick on Track > New > Point of mass and start tracking one fish at a time. Track the last 5 min of each step that the fish spent at each flow rate.\nAdvance the video manually at five-frame intervals (0.5 s) and mark the time and position of the animal at each upstream-downstream turn (UDt; red dots in Figure 5) and at each downstream-upstream turn (DUt; blue dots in Figure 5).\nNOTE: Use the ﬁsh eye position as a reference for the ﬁsh’s position. Track the animal’s position using a Point mass. Exclude from the tracking any period of non-oriented swimming (i.e., maneuvering time).\nAt the end of each tracking session, select the x-values and time values from the table at the bottom-right corner of the software window. Right-click on the data and click Copy data > Full precision.\nSave the time values and x-values of all turning positions on a template spreadsheet file to calculate the total upstream time (sum of all the intervals between UDts and DUts) and the total downstream time (sum of the intervals between DUts and UDt), as well as the values of the rheotactic index in percentages (RI%) for each flow step (see Figure 5).",
    "NOTE: The rheotactic behavior is quantified by the proportion of the total oriented time that the fish spend facing upstream (swimming or rarely freezing [i.e., they stay still at the bottom of the tunnel]27). This proportion is defined as the RI% (Figure 5).\nimgsrc://cloudfront.jove.com/files/ftp_upload/59229/59229eq1.jpg\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}