{
  "id": 9956,
  "origin_website": "Jove",
  "title": "Highly Sensitive and Rapid Fluorescence Detection with a Portable FRET Analyzer",
  "procedures": [
    "1. Preparation of Biosensor\nConstruct the plasmid pET21a(+)-CFP-MBP-YFP-His6 by following the previously-established protocol2.\nInoculate 5 ml of Luria broth (LB) with a single colony of an Escherichia coli DE3 strain and incubate at 37 °C for 16 hr with shaking.\nTransfer 1 ml of the O/N culture into a 500-ml flask containing 100 ml LB and incubate at 37 °C in a shaking incubator until the optical density at 600 nm (OD600) reaches 0.5 (about 3 hr).\nHarvest the cells in a 50-ml conical tube by centrifugation at 1,000 × g for 20 min at 4 °C.\nResuspend the pellet quickly in each tube with 50 ml ice-cold distilled water (DW) and centrifuge at 1,000 × g for 20 min at 4 °C.\nResuspend the pellet in 50 μl of ice-cold DW with 10% (v/v) glycerol by gently swirling until the solution (electrocompetent cells) reaches an OD600 of 100.\nPlace the mixture of electrocompetent cells (50 μl of the cells at an OD600 of 100) and 10 ng of the plasmid pET21a(+)-CFP-MBP-YFP-His6 in an ice-cold electroporation cuvette in an electroporation device and electroporate the mixture (18 kV/cm, 25 µF).\nQuickly add 1 ml SOC medium to the cuvette and resuspend the cells gently, followed by recovery at 37 °C for 1 hr with gentle shaking in a 15 ml round-bottom tube.\nSpread the cells on an LB plate containing 100 µg/ml ampicillin and incubate at 37 °C for 12 hr.\nIsolate a single colony using a loop and inoculate the colony in 10 ml of LB containing 100 µg/ml ampicillin at 37 °C in a shaker for 12 hr.\nAdd 5 ml of the seed culture to 500 ml of LB containing 100 µg/ml ampicillin and incubate the culture in a 37 °C shaking incubator.",
    "Add 0.5 mM isopropyl β-d-thiogalactoside (IPTG) when the OD600 reaches 0.5 and incubate the culture in a 37 °C shaking incubator for 24 hr.\nCentrifuge the cells at 4,500 × g for 20 min (4 °C) and gently remove supernatant.\nResuspend the pellet in 5 mL binding buffer (20 mM Tris-HCl, pH 8.0, 1 mM PMSF, 0.5 mM EDTA, and 1 mM DTT).\nSonicate the cells on ice with six 10-sec bursts at 200-300 W, following each burst with 10 sec of cooling.\nCentrifuge the lysate at 10,000 × g for 30 min at 4 °C to pellet the cellular debris. Transfer supernatant (soluble protein) into a new collection tube.\nTo achieve affinity purification of the FRET sensor proteins, load 4 ml of the cleared cell lysate onto a Ni-NTA affinity column (5-ml volume) and perform a chromatography assay using fast protein liquid chromatography (FPLC)18.\nWash the column once with five column volumes of wash buffer I (50 mM phosphate buffer, 300 mM sodium chloride, 10 mM imidazole, pH 7.0).\nRepeat the wash step with five column volumes of wash buffer II (50 mM phosphate buffer, 300 mM sodium chloride, 20 mM imidazole, pH 7.0).\nElute the sensor protein with five column volumes of elution buffer (50 mM phosphate buffer, 300 mM sodium chloride, 500 mM imidazole, pH 7.0).\nTo concentrate and desalt the eluted sample, fill concentrator (membrane size of 10,000 MW) with up to 20 ml of sample and centrifuge for 10 min at 3,000 × g. Refill concentrator with 0.8% phosphate-buffered saline (PBS). Repeat this step twice, first filling the concentrator with 20 ml of sample, and then refilling with PBS.\nRecover the concentrated and de-salted sensor protein and store it at -80 °C.\n2. Measurement of Sugar Content using the FRET Analyzer",
    "NOTE: The details of the FRET analyzer construction were described in our previous work7.\nPrepare a detection solution of 0.8% PBS containing 0.2 µM of the sensor proteins.\nTurn on the FRET analyzer. Press the \"UP\" button for 2 sec to calibrate the optimal temperature. Set the temperature to 53 °C using the \"UP\" and \"DOWN\" buttons and press the \"SET\" button.\nFor the calibration, press and hold the \"UP\" and \"DOWN\" buttons simultaneously for 2 sec. Confirm that the LED panel displays \"CALIB\" and press the \"SET\" button.\nPlace a 12.5 × 12.5 × 45 mm (length × width × height) rectangular parallelepiped vessel (cuvette) containing only PBS buffer into a cuvette holder of the analyzer and press the \"SET\" button.\nReplace the cuvette with one containing only the detection solution (see 2.1) without sugar (maltose/sucrose) and press the \"SET\" button to calibrate the baseline.\nReplace the cuvette with one containing the detection solution with 10 mM sugar and press the \"SET\" button.\nTo determine the sugar content of a beverage sample, put 1 ml beverage sample in a 1.5-ml microcentrifuge tube and centrifuge at 16,000 × g for 1 min.",
    "NOTE: FRET sensor-based fluorescence measurement has the advantage of not requiring special pre-treatment of the sample because only 1% (v/v) of the sample is included in the total volume. However, we recommend removing any material that may affect the fluorescence measurement (e.g., cells, insoluble particles, lipid, fat, or any material with autofluorescence). In addition, if a strong acid, strong base, cleaning agent (detergent), or emulsifying agent (emulsifier) is present at a high concentration and may affect the properties of the FRET biological sensor, it should be removed using an organic solvent or a neutralizer. For example, when dairy fat and emulsifiers are eliminated from frozen snacks, the samples are centrifuged in a microfuge tube at 16,000 × g for 30 min, and the liquid between the bottom sediment and the top layer of dairy fat is extracted. An equal amount of hexane is then added, followed by centrifugation at 15,000 × g for 30 min to eliminate lipids.\nRemove the supernatant with a 1-ml syringe and filter it through a syringe filter (pore size 0.2 µm).\nPlace 0.1 ml filtered beverage sample in a 1.5-ml microcentrifuge tube containing 0.9 ml PBS and vortex gently.\n\tNOTE: It is critical to dilute the beverage sample properly. In this case, 1,000-fold dilution was performed so that the sugar concentration would fall within the dynamic range of the device. We recommend estimating the target sugar concentration in advance by referring to the sugar content in the label of the beverage.\nAdd 5 µl of the diluted beverage sample (1%, v/v) to a cuvette containing 0.495 ml of the detection solution.\nPlace the cuvette in a cuvette holder of the FRET analyzer and preheat the sample solution to 53 °C.\nPress the \"SET\" button to measure the sugar content.",
    "Note It is possible to evaluate the FRET measurement using a multilabel plate reader or a fluorescence spectrophotometer equipped with a Peltier device for temperature control by reading the ratio at 488/535 nm7,8. For sucrose detection, follow the steps from 1.1 to 2.12 with a CSY-LH sensor2.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}