{
  "id": 2863,
  "origin_website": "Cell",
  "title": "Simultaneous isolation of CD45 tumor-infiltrating lymphocytes, tumor cells, and associated fibroblasts from murine breast tumor model by MACS",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThe following steps describe how to sort three cell populations: CD45+ cells, CAFs and tumor cells from 4T1 tumors generated in BALB/c mice. The first step is to generate 4T1 tumors in mice, for which tumor cells are injected orthotopically into the mammary gland.\nTumor generation in mice by orthotopic injection of 4T1 cells into BALB/c mice\nTiming: 15 days\nThis step describes the culture of 4T1 cells and the injection of tumor cells to generate a tumor in mice.\nCultivate the 4T1 cells in RPMI 1640 medium with FBS and PSA in T75 flask.\nNote: Their duplication rate is between 12 and 15 h.\nOnce the cells reach a subconfluent condition (50%–60%), rinse them with 5 mL of Hank’s balanced salt solution (HBSS).\nAdd 3 mL of trypsin to the cells.\nIncubate for 5 min at 37°C.\nAdd 5 mL of complete RPMI medium to stop trypsin activity.\nCollect cell suspension and count cells.\nCount live cells with trypan blue.\nNote: In a T75 flask, at 50%–60% confluency, it is expected about 1 × 107 cells. We recommend a cell viability of at least 90%.\nThen, place the cells in RPMI 1640 medium without FBS and PSA.\nAdjust cell suspension to a concentration of 1 × 105 cells/100μL RPMI 1640 medium without FBS and PSA. This cell suspension is then subcutaneously injected into the mammary gland of the mouse (Figures 1[href=https://www.wicell.org#fig1]A and 2[href=https://www.wicell.org#fig2]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2367-Fig1.jpg\nFigure 1. Orthotopic injection of 4T1 cancer cells\n(A) The mouse is shaved beforehand and then anesthetized with isoflurane.\n(B) Subcutaneous injection of 100μL of tumor cells suspension under the teat of the mouse with a 1 mL syringe and 26G needle.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2367-Fig2.jpg\nFigure 2. Dissection of the mouse and recovery of the tumor",
    "(A)The tumor is growing in the mammary gland.\n(B) Dissection of the tumor. Cut skin up to the diaphragm and then detach from the peritoneum and the skin.\n(C and D) Scalpel cutting of the tumor contour.\nNote: These procedures must be performed under sterile conditions.\nMonitoring the tumor growth for about 15 days. Tumors are resected the size reaches a minimum volume of 250 mm3. This is calculated with the following equation:\n    s m a l l  a x i  s 2  × m a j o r  a x i s  2   \nCritical: The size of the tumor would be critical for the number of cells sorted. The maximum volume of the tumor is between 800 and 1000 mm3 because once this limit is reached, the immune infiltrates are less and the necrosis within the tumor is important. If the tumor has a volume < 250 mm3, the number of cells sorted is too low to be analyzed.\nTumor removal and dissociation\nTiming: 2 h 30 min for 8 mice\nThis step allows the removal of the tumor from the mouse and the enzymatic and mechanical digestion of the tumor to obtain a cell suspension. The cells are counted in order to continue the protocol with the labeling steps.\nSample harvest\nTiming: 30 min for 8 mice\nAnesthetize the mouse by inhalation with isoflurane (1.5%) and then cull the animal by cervical dislocation.\nAn incision is made in the abdomen and the skin is cut down to the diaphragm (Figures 2[href=https://www.wicell.org#fig2]A and 2B).\nThe skin of the mouse is gently separated from the peritoneum.\nNote: Ensure to preserve the fibrotic capsule surrounding the tumor (Figure 2[href=https://www.wicell.org#fig2]B).",
    "The tumor is removed from the skin using a scalpel, taking care not to remove the capsule over the tumor (Figures 2[href=https://www.wicell.org#fig2]C and 2D).\nThen, weigh the tumor and to perform cell sorting immediately after collection to avoid a high percentage of cell dead.\nNote: To have a satisfactory number of cells, the adequate tumor size is between 250 and 600 mm3. For these sizes, the buffer volumes below are appropriate.\nTissue digestion\nTiming: 1 h 30 min for 8 mice\nReconstitute the miltenyi « Tumor Kit Dissociation » buffer according to Table 3[href=https://www.wicell.org#tbl3].\nPrepare an enzyme mix for tumor digestion from the miltenyi « Tumor Kit Dissociation ». The mix should be prepared in RPMI medium without FBS and PSA as described in Table 4[href=https://www.wicell.org#tbl4].\ntable:files/protocols_protocol_2367_4.csv\nCritical: Dissociation enzyme mix must be prepared at the last moment and cannot be stored.\nCut the tumor into 1–2 mm pieces in a petri dish using a scalpel (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2367-Fig3.jpg\nFigure 3. Mechanical and enzymatic digestion of the tumor\n(A)The tumor is cut into small pieces into 1–2 mm.\n(B)The tumor pieces are placed in a gentle MACS Ctube and added the enzymatic mix. All the tumor pieces are bathed in the liquid at the side of the cap.\n(C)The C- tubes are placed on the GentleMax.\nTransfer the tumor pieces into C-tubes.\nRinse petri dish with 2.5 mL digestion mix and transfer to C-tube.\nClose the lids of tubes and place them onto the Gentle max. Ensure that the tumor suspension is at the cap (Figure 3[href=https://www.wicell.org#fig3]B).\nTurn on the heater to allow the cell suspension to warm up to 37°C.\nStart the digestion with the program “37C_m_TDK_2”.",
    "Critical: 37C_m_TDK_2 program is suitable for a tumor type with high stiffed tumors such as the 4T1 model. To perform the protocol with other models, their dissociation will have to be adapted according to the product data sheet.\nCell counting\nTiming: 30 min\nCentrifuge the C-tubes for 7 min at 300 × g at room temperature (15°C–25°C).\nResuspend the pellets in 1 mL of RPMI 1640 medium containing 10% FBS 1% PSA.\nPass through a 70 μM Smart Strainers filter on a 50 mL falcon tube.\nRinse the C-tubes with 20 mL of complete RPMI 1640 medium.\nFilter the suspension with the prewashed 70 μM filters.\nCentrifuge the C-tubes for 5 min at 300 × g at room temperature (15°C–25°C).\nResuspend the pellets in 1 mL of complete RPMI 1640 medium.\nCount the cell number in digested tissue sample.\nPrepare cell suspension for counting by mixing 10 μL of cell suspension, 89 μL complete RPMI 1640 medium, and 1 μL DAPI.\nNote: A control without DAPI is performed to determine more precisely the DAPI negative population.\nNote: The complete RPMI 1640 medium must be at room temperature (15°C–25°C).\nAs shown in Figure 4[href=https://www.wicell.org#fig4], flow cytometry analysis gives the estimation of the number of dead and live cells.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2367-Fig4.jpg\nFigure 4. Cell count gating strategy\nAfter removal of debris and doublets, lived cells (DAPI- and FSCint/high) were selected to perform cell counting.\nNote: Ensure to collect enough number of live cells for further analyses.\nNote: The cell count can be done by manual or automatic counting using for example trypan blue.\nCalculate the number of total cells of the tumor cell suspension and divide them into two parts:\n¾ of the tumor cell suspension is used for sorting CD45+ TILs and CAFs (suspension #1).",
    "¼ of the suspension for tumor cell sorting (suspension #2).\nNote: In order to perform the whole sorting protocol, a minimum of 2 × 107 alive cells is required.\nCritical: In order not to overload the multiMACS columns, do not to load more than 20 × 106 cells per column.\nFrom this point in the protocol, a 50 μL sample will be taken from each recovered cell suspension and placed in an annotated Eppendorf (step n°6 of before you begin[href=https://www.wicell.org#before-you-begin] section) and kept at 4°C.\nCollect point will be annotated with a note.\nMagnetic-activated cell sorting of the populations\nTiming: 4 h\nThis part of the protocol describes the different steps of cell labeling to perform cell sorting. The sorting steps will also be described. This step allows to obtain the three cell populations: CD45+ cells, CAFs and tumor cells.\nIsolation of CD45+ cells\nTiming: 45 min\nThis step describes the staining of CD45+ cells and their isolation.\nCell staining\nTake the suspension #1.\nCentrifuge at 300 × g for 5 min at room temperature (15°C–25°C).\nRe-suspend the pellet in 90 μL of autoMACS buffer (https://www.miltenyibiotec.com/FR-en/products/automacs-running-buffer-macs-separation-buffer.html#130-091-221[href=https://www.miltenyibiotec.com/FR-en/products/automacs-running-buffer-macs-separation-buffer.html#130-091-221]).\nAdd 10 μL of CD45 (TIL) Microbeads (https://www.miltenyibiotec.com/FR-en/products/cd45-til-microbeads-mouse.html#130-110-618[href=https://www.miltenyibiotec.com/FR-en/products/cd45-til-microbeads-mouse.html#130-110-618]).\nCritical: this value is given for 1 × 107 alive cells, even if the cell number is fewer than this amount, please keep this value. If there are more cells, the volume of buffer and beads should be adjusted accordingly proportionally.\nMix well and incubate for 15 min at 4°C in dark in the fridge.\nAdd autoMACS buffer to have a final volume of 500 μL (keep this volume for a cell amount up to 5 × 107).\nMagnetic sorting",
    "The separation of the cells will be performed by a magnetic sorting. The CD45+ cells attached to the beads will be collected as a positive fraction. The outgoing fraction will then be used for the sorting for the different populations. This step can be performed on a multiMACS device (Miltenyi Biotech) allowing to perform multiple sorting simultaneously.\nNote: The sorting steps can also be performed with a conventional magnet and a single column LS.\nPlace the Multi-24Column Bloc plate on the multiMACS (Figure 6[href=https://www.wicell.org#fig6]A).\nStart the “POSSEL” program on the multiMACS and follow the instructions.\nEquilibrate the columns with 2 mL of autoMACS buffer.\nLoad the sample mixed with CD45 microbeads.\nNote: Ensure that there is a receptacle below the plate to collect the outgoing fraction. Collect the unlabeled cells that exit the column. This outgoing fraction named as Fraction A (Figure 5[href=https://www.wicell.org#fig5]).\nWash the column three times with 1 mL of MACS buffer (wait until the columns are empty before adding buffer). Collect the outgoing fraction and pool with fraction A and keep at 4°C or on ice.\nCritical: Do not forget to preserve fraction A which would be used for the further sorting of CAFs.\nNote: Collect sample at this point.\nPlace the plate on the upper part of the elution machine (Figure 6[href=https://www.wicell.org#fig6]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2367-Fig5.jpg\nFigure 5. Plan of the different stages of cell sorting\nPositive sorting: the sorting is said to be “positive”, the cells of interest stained with the microbeads have clung to the column. They are collected in the next step by elution. Deplete sorting: the sorting is called “negative”, the cells to be eliminated are stained and cling to the column and the cells of interest are unstained and therefore leave the column (Created with Biorender).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2367-Fig6.jpg\nFigure 6. Positive selection of CD45+cells",
    "(A) The Multi-24Column Bloc plate is placed on the lower part of the device; the A fraction is collected in the collector located below.\n(B) The Multi-24Column Bloc plate is then placed on the upper part of the device which will allow the elution of the cells in the collection tubes located below each column.\n(C) After elution, each tube contains the cells contained in the column.\nLoad 1 mL of autoMACS buffer to elute the positive fraction as CD45+ cells in a fresh tube.\nCentrifuge the CD45+ cells fraction at 300 × g for 10 min at 4°C, resuspend the pellet in 100 μL of complete RPMI medium. These cells should be maintained at 4°C for further flow cytometry analysis. If these cells are used for different applications, for example for biochemical analysis, store them at −80°C.\nNote: Collect sample at this point.\nCAFs isolation (using cancer associated fibroblasts isolation kit)\nTiming: 1 h 30 min\nThis step describes the labeling of “non CAFs” cells and their removal and then the labeling of CAFs and their isolation.\n« non CAFs » cells staining:\nCentrifuge the fraction A at 300 × g for 10 min at 4°C.\nRemove the supernatant with a pipette and then resuspend the pellet in 80 μL of autoMACS buffer.\nAdd 20 μL of the “Non tumor-associated fibroblast” depletion cocktail (https://www.miltenyibiotec.com/FR-en/products/tumor-associated-fibroblast-isolation-kit-mouse.html#130-116-474[href=https://www.miltenyibiotec.com/FR-en/products/tumor-associated-fibroblast-isolation-kit-mouse.html#130-116-474]).\nCritical: this value is indicated for 1 × 107 cells at the beginning before the CD45+ sorting, if there are fewer cells, please keep this value. If there are more cells, the volume of buffer and beads should be adjusted.\nMix well and incubate for 15 min in dark at 4°C in the fridge.",
    "Add buffer up to the final volume of 500 μL (keep this volume for a cell amount up to 5 × 107).\nMagnetic sorting:\nPlace the Multi-24Column Bloc plate on the multiMACS separator.\nStart the “DEPLETE” program on the multiMACS and follow the instructions.\nEquilibrate the columns with 2 mL of MACS buffer.\nEnsure that there is a receptacle below the columns to collect the outgoing fraction.\nLoad samples mixed with non CAFs depletion cocktail to the column.\nCollect the outgoing fraction (Fraction B), CAFs are enriched in this fraction (Figure 5[href=https://www.wicell.org#fig5]).\nWash the column three times with 1 mL of autoMACS buffer (wait until the columns are empty to add buffer). Collect the outgoing fraction and pool with fraction B.\nNote: Collect sample at this point.\nTumor associated fibroblasts staining:\nCentrifuge fraction B at 300 × g for 10 min at 4°C.\nRemove the supernatant and resuspend the pellet in 80 μL of autoMACS buffer.\nAdd 20 μL of CD90.2-labeled beads allowing for labeling of CAFs.\nCritical: this value is indicated for 1 × 107 cells at the beginning, if there are fewer cells, please keep this value. If there are more cells, the volume of buffer and beads should be adjusted.\nMix well and then incubate for 15 min in dark at 4°C in the fridge.\nAdd autoMACS buffer to reach a final volume of 500 μL (keep this volume for a cell amount up to 5 × 107).\nMagnetic sorting:\nPlace the Multi-24Column Bloc plate on the multiMACS separator.\nStart the “POSSEL” program on the multiMACS and follow the instructions.\nEquilibrate the columns with 2 mL of autoMACS buffer.\nEnsure that there is a receptacle below the columns.\nLoad samples mixed with CD90.2 microbeads to the column.",
    "Wash the column three times with 1 mL of MACS buffer.\nTo collect the CAFs fraction, place the plate with the columns on the upper part of the elution machine. Follow the indications of the machine.\nElute the positive fraction with 1 mL of MACS buffer.\nCentrifuge the CAFs cells-rich fraction at 300 × g for 10 min at 4°C.\nResuspend the pellet in 100 μL of complete RPMI medium. Keep at 4°C or on ice until further analysis.\nNote: Collect sample at this point.\nIsolation of tumor cells\nTiming: 45 min\nThis step describes the labeling of “non tumor cells” and their removal.\nNon tumor cell staining:\nCentrifuge cell suspension #2 (step 24b) at 300 × g for 5 min at 4°C.\nAspirate the supernatant and resuspend the cell pellet in 80 μL of buffer.\nAdd 20 μL of the “Non tumor cocktail depletion” (https://www.miltenyibiotec.com/FR-en/products/tumor-cell-isolation-kit-mouse.html#130-110-187[href=https://www.miltenyibiotec.com/FR-en/products/tumor-cell-isolation-kit-mouse.html#130-110-187]).\nCritical: this value is indicated for 1 × 107 cells at the beginning, if there are fewer cells, please keep this value. If there are more cells, the volume of buffer and beads should be adjusted.\nHomogenize the well and incubate 15 min at 4°C in the fridge.\nAdjust the volume to 500 μL with autoMACS buffer (keep this volume for a cell amount up to 5 × 107).\nMagnetic sorting:\nPlace the Multi-24Column Bloc plate on the multiMACS separator.\nStart the “DEPLETE” program on the multiMACS and follow the instructions.\nEquilibrate the columns with 2 mL of MACS buffer.\nEnsure that there is a receptacle below the columns to collect the outgoing fraction.\nLoad samples mixed with non tumor depletion cocktail to the column.\nCollect the outgoing fraction C which contains the tumor cells.\nCritical: Do not forget to preserve this fraction which contains the tumor cells.",
    "Wash the column three times with 1 mL of MACS buffer. Collect the outgoing fraction and pool with fraction C.\nNote: Collect sample at this point.\nElimination of dead cells\nTiming: 45 min\nThis step describes the staining of dead tumor cells and their removal.\nCell staining:\nIn this protocol, we recommend performing a dead cell removal to eliminate dead tumor cells that can be found in large quantities in 4T1 tumor models that tend to necrotize.\nCentrifuge fraction C at 300 × g for 10 min at 4°C.\nRemove the supernatant and resuspend the pellet in 100 μL of Dead Cell Removal Microbeads (https://www.miltenyibiotec.com/FR-en/products/dead-cell-removal-kit.html#130-090-101[href=https://www.miltenyibiotec.com/FR-en/products/dead-cell-removal-kit.html#130-090-101]).\nCritical: this value is indicated for 1 × 107 cells at the beginning, if there are fewer cells, please keep this value. If there are more cells, the volume of buffer and beads should be adjusted.\nHomogenize and incubate 15 min at room temperature (15°C–25°C).\nMagnetic sorting:\nPlace the Multi-24Column Bloc plate on the multiMACS separator.\nStart the “DEPLETE” program on the multiMACS and follow the instructions.\nPrepare 1× Buffer from 20× Binding Buffer Stock containing in the kit “Dead cell removal” with sterile H2O. Store the buffer at 4°C or on ice.\nEquilibrate the column with 2 mL of the previously prepared buffer.\nEnsure that there is a receptacle below the columns to collect the outgoing fraction.\nLoad sample mixed with dead cell removal cocktail to the column.\nCollect the outgoing fraction D which contains the live tumor cells.\nWash the column three times with 1 mL of binding buffer. Collect the outgoing fraction and pool with the fraction D.",
    "Note: It is possible to swap the dead cell removal and non-tumor cell staining steps, but it is recommended to perform these labeling steps in this order to ensure that all dead cells that may be induced during tumor cell sorting are removed.\nNote: Collect sample at this point.\nLabeling of sorted cells for phenotypic validation by flow cytometry\nTiming: 1 h\nThis step describes the staining of tumor cells, CAFs and CD45+ cells by a panel of antibodies and their analysis by flow cytometer. This step will allow to confirm the phenotype of the sorted populations.\nDesign of the flow cytometry panel\nA cytometry panel was used to check the viability and purity of total tumor cell suspension and each purified fraction. This panel is described in Table 5[href=https://www.wicell.org#tbl5].\ntable:files/protocols_protocol_2367_5.csv\nNote: For the use of this panel, it is necessary to ensure that your flow cytometry equipment has the appropriate number of lasers and the configuration.\nThe emission spectra of the fluorochromes used in our flow cytometry panel have been studied and are presented as a spectra analyzer in Figure 7[href=https://www.wicell.org#fig7] Care was taken to use fluorochromes with a high spectrum overlap for non-co-expressed markers. For example, the anti-CD31 and anti-CD140b antibody, two non-co-expressed targets, was combined with two fluorochromes with high overlap, BV785 and APC-vio770 respectively.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2367-Fig7.jpg\nFigure 7. The emission spectra of the fluorochromes\nThis part details how to stain tumor-derived cells for flow cytometry analysis. For optimal analysis of your flow cytometry data, we recommend preparing FMO and unstained controls. All the following steps need to be performed in the dark at room temperature (15°C–25°C).",
    "Centrifuge the samples in the Eppendorf collected at each step (Fraction A, B and C samples) and the samples of the sorted populations: CD45+ TILs, CAFs and tumor cells (fraction D) at 300 × g for 5 min at 4°C.\nDiscard the supernatant and resuspend cells in 150 μL of flow cytometry staining buffer (FSB) then transfer to V-bottom 96-well plate.\nCentrifuge the 96 well plate containing cells at 300 × g for 5 min at room temperature (15°C–25°C).\nDiscard the supernatant and resuspend cells in 100 μL of antibody cocktail contained all antibodies prepared in FSB as indicated in Table 3[href=https://www.wicell.org#tbl3] and incubate the cells at room temperature (15°C–25°C) for 15 min.\nCentrifuge the 96-well plate at 300 × g for 5 min at room temperature (15°C–25°C).\nDiscard supernatant.\nWash with 150 μL of FSB per well.\nCentrifuge the 96-well plate at 300 × g for 5 min at room temperature (15°C–25°C).\nDiscard the supernatant and resuspend cells in 150 μL of FSB, the cells are ready to be analyzed by flow cytometer.\nAcquisition on the flow cytometer\nTiming: 1 h 30 min for sorting and setting samples (17 samples)\nThis part details the acquisition of cellular fractions on the Cytoflex flow cytometer (Beckman Coulter) using CytExpert software.\nFor compensation setting, prepare unstained and single-stained controls for every fluorochrome-dye used in your panel.\ntable:files/protocols_protocol_2367_6.csv\nNote: For anti-CD45, anti-CD31, anti-Podoplanin, anti-CD26 and anti-EpCAM antibodies we recommend to used total tumor cell suspension. Due to the low expression of CD140a, CD140b and FAPA markers by the cells, we recommended to used compensation beads for them. Concerning the mortality dye used a mix of stained and unstained tumor suspension (Table 6[href=https://www.wicell.org#tbl6]).\nOnce controls are ready, go to your flow cytometer and create a new experiment.",
    "Use unstained and single-stained cells or beads to set appropriate PMT voltage or APD gain and prepare compensation matrix.\nNote: CD45+ TILs, CAFs and tumor cells can have different morphological characteristics and consequently can be different in SSC/FSC parameters. FSC/SSC parameters must be checked to correctly identify all cell subsets.\nCreate the gating strategy as shown in the Figure 8[href=https://www.wicell.org#fig8].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2367-Fig8.jpg\nFigure 8. Flow cytometry gating and isolated fraction purity/viability\n(A) Gating strategy for cellular subsets identification. Singlet live cells were obtained by using SSC/Time, FSC/SSC and FSC/mortality dye (LD) parameters.\n(B) To appreciate each fraction purity, dot plot with CD45, CD31, Lin and CD26 (CAFs marker) staining were shown in CD45+ TILs, tumor cells and CAFs in total tumor suspension.\n(C) Proportion of CD45+ TILs, Endothelial cells, Tumor cells and CAFs in tumor cell suspension and purity of each cell subsets in isolated fractions.\nLoad all your sample. For an analysis of CAFs in total tumor suspension recording a minimal of 1 × 106 live singlet cells because these cells are in very low proportion in the total tumor.\nGene expression analysis of sorted fractions\nTiming: 5 h\nThis step describes the extraction of RNA from isolated populations and their reverse transcription into DNA for qPCR. qPCR analysis is performed on the fractions to validate them through the study of genes associated with the sorted subpopulations.\nTransfer the CD45 TILs, CAFs and tumor cell samples to a 1.5 mL Eppendorf and add 500 μL of Trizol® for a minimum of 15 min to destroy the cells.\nPause point: Samples in Trizol® can be frozen at −20°C or −80°C for long-term preservation to continue the experiment later.\nAdd 100 μL of chloroform to the Trizol®, vortex the samples vigorously and then centrifuge at 12000 g for 15 min at 4°C.",
    "Collect 250 μL of the upper phase in a new Eppendorf tube and add 250 μL of isopropanol to allow precipitation of the RNA. The mixture should be homogenized and then allowed to precipitate for 10 min at room temperature (15°C–25°C).\nCentrifuge the RNAs for 15 min at 12,000 × g at 4°C.\nEmpty the tube without losing the RNA pellet then fill it with 1 mL of 70% ethanol and vortex it vigorously.\nCentrifuge for 5 min at 7,500 × g at 4°C.\nRepeat steps 82 and 83 a second time.\nDry the RNAs at room temperature (15°C–25°C) for 1 h until the pellet is completely dry.\nRecover the pellets in 10 μL ultra-pure water. Measure the RNA concentration and purity in each sample with a Nanodrop spectrophotometer.\nNote: During the assay, we checked the absorption spectra, and we validated the different ratio 260/280 and 260/230. The ratio 260/230 must be higher than 2 and the ratio 260/280 must be between 2 and 2.2.\nPause point: RNAs in ultra-pure water can be stored at −20°C or−80°C for a better long-term preservation.\nNote: Avoid multiple thaw/freezing cycles.\nDilute the RNAs to the final concentration of 100 ng/ μL.\nTransform these RNAs into cDNA by reverse transcription with the addition of mix 1 presented in Table 7[href=https://www.wicell.org#tbl7].\ntable:files/protocols_protocol_2367_7.csv\nThese mixes must be prepared at the last moment and cannot be stored.\nIncubate at 65°C for 5 min.\nAdd the mixture 2 presented in Table 7[href=https://www.wicell.org#tbl7] and the following program is launched in the thermocycler:\n10 min at 25°C.\n50 min at 37°C.\n15 min at 70°C.\n∞ at 4°C.\nPause point: cDNA can be stored at 4°C for few weeks or −20°C for long-term.\nDilute the cDNAs by adding 180 μL of ultra-pure water in the Eppendorf tube.",
    "Amplify the cDNA by qPCR through adding the mix presented in Table 8[href=https://www.wicell.org#tbl8] and the primers of the genes of interest presented in the Table 9[href=https://www.wicell.org#tbl9].\ntable:files/protocols_protocol_2367_8.csv\nThis mix must be prepared at the last moment and cannot be stored.\ntable:files/protocols_protocol_2367_9.csv\nPerform the following qPCR program using the QuantStudio™ 3 Real-Time PCR equipment:\n10 min at 95°C.\n15 s at 95°C (40 cycles).\n1 min at 60°C (40 cycles).\nNote: This program can also be run on others equipment such as AriaMx Real-Time PCR (qPCR) Instrument (Agilent) or CFX Opus 96 Real-Time PCR System (BioRad)."
  ],
  "subjectAreas": [
    "Immunology",
    "Cell Isolation",
    "Flow Cytometry",
    "Cancer",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}