{
  "id": 8778,
  "origin_website": "Jove",
  "title": "FM Dye Cycling at the Synapse: Comparing High Potassium Depolarization, Electrical and Channelrhodopsin Stimulation",
  "procedures": [
    "1. Larval Glue Dissection\nThoroughly mix 10 parts of silicone elastomer base with 1 part of silicone elastomer curing agent from the elastomer kit (Table of Materials).\nCoat 22 x 22 mm glass coverslips with the elastomer and cure on a hot plate at 75 ˚C for several hours (until no longer sticky to the touch).\nPlace a single elastomer-coated glass coverslip into the custom-made plexi glass dissection chamber (Figure 1, bottom) in preparation for the larval dissection.\nPrepare the glue pipettes from borosilicate glass capillary using a standard microelectrode puller to obtain the desired taper and tip size.\nGently break off the micropipette tip, and to the other end, attach 2 ft of flexible plastic tube (1/32\" interior diameter, ID; 3/32\" outside diameter, OD; 1/32\" wall; Table of Materials) with mouth fitting (P2 pipette tip).\nFill a small container (0.6 mL Eppendorf tube cap) with a small volume (~20 µL) of glue (Table of Materials) in preparation for the larval dissection.\nFill the chamber with saline (in mM): 128 NaCl, 2 KCl, 4 MgCl2, 1 CaCl2, 70 sucrose, and 5 2-[4-(2-hydroxyethyl)piperazin-1-yl]ethanesulfonic acid (HEPES) pH 7.2.\nAdd anti-horse radish peroxidase (HRP) antibody conjugated to Alexa Fluor 647 (anti-HRP:647; dilute 1:10 from a 1 mg/mL stock) for labeling the NMJ presynaptic terminal during dissection21,22.\nUsing a fine paintbrush (size 2), remove a wandering third instar from the food vial and place onto the elastomer-coated cover glass.\nFill the glass micropipette tip with a small volume of glue using negative air pressure generated by mouth with attachment (step 1.5).\nPosition larva dorsal side up with forceps and glue the head to the elastomer-coated coverslip with a small drop of glue using positive air pressure by mouth.",
    "Repeat this procedure with the posterior end of the larva, making sure that the animal is stretched taut between the two glue attachments.\nUsing scissors (blades 3 mm; Table of Materials), make a horizontal cut (~1 mm) at posterior and a vertical cut all along the dorsal midline.\nUsing fine forceps (#5, Table of Materials), gently remove dorsal trachea, gut, fat body and other internal organs covering the musculature.\nRepeat the gluing procedure for the four body wall flaps, making sure to gently stretch the body wall both horizontally and vertically.\nLift the ventral nerve cord (VNC) using forceps, carefully cut the motor nerves with the scissors, and then completely remove the VNC.\nReplace the dissection saline with Ca2+-free saline (same as the above dissection saline without the CaCl2) to stop SV cycling.\n2. Option 1: High [K+] FM Dye Loading\nFrom a FM1-43 stock solution (4 mM), add 1 µL to 1 mL of 90 mM KCl solution (high [K+] in dissection saline) for a final concentration of 4 µM.\nUsing a pipette, replace the Ca2+-free saline in the imaging chamber with the high [K+] FM dye solution to stimulate SV endocytosis dye uptake.\nImmediately start a digital timer for the pre-determined duration of the high [K+] depolarizing stimulation period (e.g., 5 min; Figure 2).\nTo confirm a healthy larval preparation, note the strong contractions of the musculature for the duration of the high [K+] depolarization period.\nWhen the timer period ends, quickly remove the high [K+] FM dye solution and replace with Ca2+-free saline to stop SV cycling.\nWash in quick succession with the Ca2+-free saline (5x for 1 min) to ensure the high [K+] FM dye solution is completely removed.\nMaintain the larval preparation in fresh Ca2+-free saline for immediate imaging with the confocal microscope.",
    "3. Imaging: Confocal Microscopy\nUse an upright confocal microscope with a 40X water immersion objective to image NMJ dye fluorescence (other microscopes can be used).\nImage muscle 4 NMJ of abdominal segments 2-4 (other NMJs can be imaged) and collect images using appropriate software (Table of Materials).\nUse a HeNe 633 nm laser to excite HRP:647 (with long-pass filter > 635 nm) and an Argon 488 nm laser to excite FM1-43 (with bandpass filter 530-600 nm).\nOperationally determine optimal gain and offset for both channels.\n\tNOTE: These settings will remain constant throughout the rest of the experiment.\nTake a confocal Z-stack through the entire selected NMJ from the HRP-marked top to bottom of the synaptic terminal.\nTake careful note of the NMJ imaged (segment, side and muscle) to ensure excess to the exact same NMJ after FM dye unloading.\n4. High [K+] Stimulation: FM Dye Unloading\nReplace Ca2+-free saline with the high [K+] saline (without FM1-43 dye) to drive depolarization, SV exocytosis and dye release.\nImmediately start a digital timer for the pre-determined duration of the high [K+] stimulation period (e.g., 2 min; Figure 2).\nWhen the timer period ends, immediately remove the high [K+] saline and replace with Ca2+-free saline to stop SV cycling.\nWash in quick succession with Ca2+-free saline (5x for 1 min) to ensure the high [K+] saline is completely removed.\nMaintain the larval preparation in fresh Ca2+-free saline for immediate imaging with the confocal microscope.\nBe certain to image the FM1-43 dye fluorescence at the same NMJ noted above using the same confocal settings.\n5. Option 2: Electrical Stimulation FM Dye Loading\nPrepare a suction pipette using the microelectrode puller (Table of Materials) to obtain the required taper and tip size.",
    "Fire-polish the microelectrode tip with a micro-forge until a single motor nerve can be sucked up with a tight fit.\nSlide suction pipette onto the electrode holder on a micromanipulator and attach to the long flexible plastic tube and a syringe.\nSet stimulator parameters (e.g., 15 V, 20 Hz frequency, 20 ms duration and time of 5 min (Figure 2) or 1 min (Figure 3)).\nReplace the Ca2+-free saline on the larval preparation with above FM1-43 saline (4 µM; 1 mM CaCl2) on the electrophysiology rig.\nPut the preparation on the microscope stage and raise the stage until the larva and suction pipette are in focus (40X water-immersion objective).\nSuck up a loop of cut motor nerve innervating the selected hemisegment with negative air pressure generated by the syringe into the suction electrode.\nTest the suction electrode function with a short burst of stimulation while visually monitoring for the muscle contraction in the selected hemisegment.\nStimulate the motor nerve using selected parameters (step 5.4) to drive SV endocytosis and FM1-43 dye uptake (Figure 2).\nWash in quick succession with Ca2+-free saline (5x for 1 min) to ensure the FM1-43 dye solution is completely removed.\nMaintain the larval preparation in fresh Ca2+-free saline for immediate imaging using the confocal imaging protocol from above.\nTake careful note of the NMJ imaged (segment, side and muscle) to ensure access to the exact same NMJ after FM dye unloading.\n6. Electrical Stimulation: FM Dye Unloading\nReplace the Ca2+-free saline with regular saline (without FM1-43 dye)and place the preparation back on the electrophysiology rig stage.\nSet the stimulator parameters for unloading (e.g., 15 V, 20 Hz frequency, 20 ms duration and time of 2 min (Figure 2) or 20 s (Figure 3)).",
    "Suck the same motor nerve into the same electrode as above, and then stimulate to activate SV exocytosis and FM1-43 dye release.\nWash in quick succession with Ca2+-free saline (5x for 1 min) to ensure the external dye is completely removed.\nMaintain the larval preparation in fresh Ca2+-free saline for immediate imaging with the confocal microscope.\nEnsure to image the FM1-43 dye fluorescence at the same NMJ noted above using the same confocal settings.\n7. Option 3: Channelrhodopsin Stimulation FM Dye Loading\nRaise ChR2-expressing larvae on food containing the ChR2 co-factor all-trans retinal (dissolved in ethanol; 100 µM final concentration).\nPlace the larval preparation in the plexiglass chamber on a dissection microscope stage equipped with a camera port.\nAttach a blue LED (470 nm; Table of Materials) to a programmable stimulator using a coaxial cable and place the LED into the camera port.\nFocus the blue LED light beam onto the dissected larval function using the microscope zoom function.\nReplace the Ca2+-free saline on the larval preparation with above FM1-43 saline (4 µM; 1 mM CaCl2) on the optogenetic stage.\nSet the LED parameters using the stimulator (e.g., 15 V, 20 Hz frequency, 20 ms duration and time of 5 min (Figure 2)).\nStart the light stimulation and track with a timer for the pre-determined duration of the optogenetic stimulation period (e.g., 5 min; Figure 2).\nWhen the timer stops, quickly remove the FM dye solution and replace with Ca2+-free saline to stop the SV cycling.\nWash in quick succession with the Ca2+-free saline (5x for 1 min) to ensure the FM dye solution is completely removed.\nMaintain the larval preparation in fresh Ca2+-free saline for immediate imaging with the confocal microscope using imaging protocol from above.",
    "Take careful note of the NMJ imaged (segment, side and muscle) to ensure access to the exact same NMJ after FM dye unloading.\n8. Channelrhodopsin Stimulation: FM Dye Unloading\nReplace Ca2+-free saline with regular saline (without FM1-43 dye)on the dissection microscope stage with camera port LED focused on the larva.\nSet the stimulator parameters for unloading (e.g., 15 V, 20 Hz frequency, 20 ms duration and time of 2 min (Figure 2)).\nStart the light stimulation and track with a timer for the pre-determined duration of the optogenetic stimulation period (e.g., 2 min; Figure 2).\nWhen the timer period ends, quickly remove the FM dye solution and replace with Ca2+-free saline to stop the SV cycling.\nWash in quick succession with Ca2+-free saline (5x for 1 min) to ensure the external dye is completely removed.\nMaintain the larval preparation in fresh Ca2+-free saline for immediate imaging with the confocal microscope.\nEnsure to image the FM1-43 dye fluorescence at the same NMJ noted above using the same confocal settings.\n9. Fluorescence Quantification\nLoad the image in Image J (NIH open source) and create a maximum intensity projection by clicking Image | Stacks | Z Project.\nUsing the anti-HRP:647 channel, go to Image | Adjust | Threshold and slide the top tool bar until just the NMJ is highlighted.\nUsing the wand tool, click on the NMJ. If the NMJ is discontinuous, hold the Shift button and select all parts.\nChange the image to the FM1-43 dye channel and go to Analyze | Measure to obtain the fluorescence measurement.\nRepeat steps 9.1-9.4 for the \"unloaded\" image from the same NMJ (identified segment, side and muscle).\nTo obtain the percentage of dye that was unloaded, take the ratio of the unloaded/loaded fluorescence intensities.",
    "NOTE: This procedure can be modified to analyze fluorescence on a bouton-per-bouton basis using either the \"oval\" or \"freehand\" selection tools. Background fluorescence can be subtracted by sampling the muscle fluorescence. Agents can also be added to reduce this background.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}