{
  "id": 17511,
  "origin_website": "Jove",
  "title": "Human Subcutaneous Adipose Tissue Sampling Using a Mini-Liposuction Technique",
  "procedures": [
    "NOTE: The University of Stirling NHS, Invasive, or Clinical Research Committee approved the biopsy procedure described below. All research studies using this procedure must be approved by the appropriate independent ethics committee. The biopsy taker must have completed formal training in the described technique in accordance with their institution's requirements. Typically, this involves observing a demonstration of the described adipose tissue biopsy technique by a board-certified physician, followed by supervised practice. Once the trainee has performed 10 practice adipose tissue biopsies on volunteer subjects under supervision, they will be examined by a board-certified physician to ensure good knowledge and practice of the procedure. The board-certified physician then provides the individual with a signed examination form.\n1. Laboratory room preparation\nEnsure that the laboratory has an appropriately private room with clean, wipeable non-porous surfaces and a clean, comfortable (preferably non-porous) bed on which the participant may lie supine. Clean all required surfaces for the biopsy procedure using 70% ethanol spray and clean paper towels. Provide clean pillows or cushions to support the participant if required.\nKeep appropriate sharps disposal bins and biohazard waste bags within easy reach of the area where the biopsy is being performed and within easy reach of the person taking the biopsy.\nPrepare the equipment required for the procedure and set up on a freshly cleaned general medical trolley prior to the participant arriving to the laboratory (Figure 1). For a complete list of consumables required, see the Table of Materials.\n2. Participant preparation",
    "Ensure that all participants provide written informed consent prior to undergoing the procedure in accordance with protocols required by the institution's independent ethics committee. Additionally, ask the participants to complete a written questionnaire to ensure they are not allergic to any materials used in the procedure (namely, nickel, chromium, local anesthetic, iodine, shellfish, and plasters).\nConfirm the identity of the participant. Ensure the participant understands the procedure to be carried out and potential secondary effects, including bruising, pain, and infection (Table 1). Gather verbal consent in addition to previously obtained written informed consent.\nDescribe to the participant how the procedure will be carried out, with emphasis on how the administration of the anesthetic and biopsy itself will feel. Ensure that the participant is comfortable with proceeding.\n\tNOTE: Local subcutaneous anesthetic will produce a stinging sensation, similar to a bee sting of short duration. Many participants report the anesthetic administration as the most uncomfortable part of the technique. Once the anesthetic has taken effect, the participant should feel no more than a slight tugging sensation during the biopsy.\nEnsure that the participant has no allergies to the local anesthetic (specifically from the amino-amide type, if using lidocaine or similar), certain metals (nickel and chromium), and shellfish (if using iodine-based solutions). Additionally, ensure that the participants are not taking any form of anticoagulant medication.\nProvide the participant with an opportunity to go and empty their bladder if required, to ensure they do not have to interrupt the procedure or experience undue discomfort in step 4.1.\n3. Biopsy procedure - instructions for the biopsy taker\nOnce the participant is lying in a supine position, identify the biopsy site approximately 5-10 cm lateral to the umbilicus.",
    "NOTE: If the participant is to undergo multiple biopsies on the same day, identify biopsy sites on opposing sides of the umbilicus for each biopsy. This will ensure maximal distance between each biopsy site.\nWash hands with soap and warm water according to standard medical guidelines4.\nPlace the sterile sheet on the cleaned trolley or work area, taking care to only touch the outer edges of the sheet.\nPut on sterile surgical gloves using proper aseptic technique. Have the assistant open the rest of the equipment in such a way that it drops onto the prepared sterile sheet without touching/contaminating the equipment. Ensure that the assistant takes care not to touch items when removing tools from their sterile wrappings.\nInstruct the assistant to dispense a small amount of iodine-based solution on some sterile gauze (without oversaturating the gauze) on the work surface.\nSterilize approximately 5-10 cm2 around the chosen biopsy site using the sterile gauze and iodine-based solution. Ensure the skin is cleaned in a spiraling motion moving outward from the proposed biopsy site. Repeat the skin cleaning procedure twice. Remove excess liquid (e.g., running off sterile area) by wiping with fresh sterile gauze.\nAlong with the assistant, verbally confirm the content of the local anesthetic vial (2% lidocaine in this protocol) and that this is within its expiry date. Instruct the assistant to hold the opened vial upside down and draw 5 mL of local anesthetic into a syringe, using a 21 G needle. Dispose of the needle into the sharps bin, and ensure the syringe is free of air bubbles.",
    "Apply a 26 G needle to the syringe and expel any air bubbles. Gently pinch the abdominal skin and adipose tissue, moving it away from the abdominal wall. Then, insert the needle horizontally into the subcutaneous tissue at an angle no greater than 10° relative to the surface of the skin.\n\t\nWithdraw the syringe's plunger an additional 0.5 mL (to ensure the needle is not in a blood vessel). If blood appears in the syringe, withdraw and reinsert the needle at a different angle.\nRaise a bleb of 2-4 mm diameter to anesthetize the insertion area.\nAdvance the needle into the subcutaneous tissue and administer ~1 mL of lidocaine in a fan-shaped pattern (Figure 2), taking care to withdraw the plunger each time before injecting the anesthetic.\nRemove and dispose of the 26 G needle, apply a 21 G needle to the syringe, expel any air bubbles, and administer the remaining ~4 mL of lidocaine in a fan-shaped pattern (Figure 2), taking care to withdraw the plunger each time before injecting the anesthetic.\nWait approximately 5 min for the local anesthetic to take effect. Use a sterile scalpel to gently prod the biopsy area to i) ensure the local anesthetic has taken effect and ii) identify the boundaries of the anesthetized area. If necessary, wait an additional minute or two and reassess.\nOnce satisfied that the local anesthetic is working, gently pinch the skin and adipose tissue (as in step 3.8) and use a sterile scalpel to make a small 1-2 mm puncture in the skin.",
    "NOTE: This only needs to be large enough to ease the entry of the 14 G needle and must be small enough that no suture is required to close it. It is common for some bleeding to occur from this point onwards, which can be controlled with a piece of sterile gauze.\nFirst, apply a 14 G needle to a 5 or 10 mL syringe. Then, while gently pinching the skin and adipose tissue, gradually insert the needle through the puncture into the adipose tissue approximately centrally in the anesthetized area and at an angle no greater than 10° relative to the surface of the skin.\n\tNOTE: For all cases of needle advancement in step 3.11, a syringe angle of no greater than 10° must be maintained.\n\t\nApply suction by withdrawing the plunger to approximately the 2.5 mL mark. Take the biopsy by moving the needle in a quick backwards and forwards motion to slice fragments of adipose tissue. After approximately 30 s, twist the needle and syringe through 90° and repeat this procedure to break up the fragments of adipose tissue, which are then aspirated into the syringe by the suction.\n\t\t​NOTE: Other syringe sizes can be used. It is essential that the researcher selects a syringe size that permits both a good grip on the syringe and to comfortably maintain plunger retraction for maintenance of the vacuum. Locking syringes are available that maintain the vacuum, which can improve needle control and reduce perceived difficulty for the biopsy taker 5.\nAfter approximately 45-60 s of step 3.11.1, remove the needle and empty the syringe content onto a layer of gauze covering a weighing boat. Ensure that the lumen of the needle is facing down to avoid potential blood spatter.",
    "Repeat steps 3.11.1 and 3.11.2 for a maximum of 3 times. Check that the participant is content to proceed before each repeat of the above procedure.\nWhilst performing steps 3.11.1 and 3.11.2, instruct the assistant to process and prepare the samples for analysis/storage (see section 5).\n4. Post-biopsy procedure\nOnce a satisfactory sample (i.e., ~200 mg) of adipose tissue has been obtained, place 1-2 layers of sterile gauze over the puncture wound, then place an ice pack over these, and apply firm pressure for approximately 10 min to induce hemostasis.\nWhen hemostasis has occurred, wipe away any iodine-based solution/dried blood with sterile gauze, and apply an adhesive wound dressing with absorbent pad to the site. Check that the participant feels well and provide verbal and written instructions on biopsy site aftercare.\n\t\nEmphasize that the participants will likely exhibit some bruising for the next few days. Inform them that this may be substantial, although it is minimized by the ice pack in step 4.1 and will resolve without lasting effects.\nRecommend that should the participants feel any discomfort/pain once the anesthetic has worn off, they should take analgesics such as paracetamol following the instructions on the packet but refrain from taking analgesics that have anticoagulant activities (e.g., ibuprofen or aspirin).\nExplain that swelling, redness, or discharge from the biopsy site are indications of infection. In the unlikely event that these signs or symptoms occur, instruct the participant to urgently seek medical advice from a doctor or local Accident & Emergency unit. Inform the participant that if they seek medical advice, they must also notify the research team.",
    "NOTE: As research staff, neither the biopsy taker nor the assistant can provide medical advice or treatment; however, it is important that the research team are aware of and record all instances of complications resulting from the biopsy procedure.\nRecommend that participants should avoid swimming or overly strenuous activity for 48 h until the site of incision has closed.\nClear away any used sharps and contaminated materials into designated sharps and/or clinical waste containers.\nClean all surfaces used in the biopsy procedure using 70% ethanol spray and clean paper towels. Place disposable and non-disposable items of bedding in appropriate clinical bags for disposal or cleaning, respectively.\n5. Sample processing - instructions for the assistant\nUse sterile tweezers and 0.9% saline to rinse the adipose tissue sample to remove visible contaminants (i.e., blood, vasculature). Then, weigh the adipose tissue samples using digital scales. Split the tissue into appropriately sized pieces for downstream analysis and place them into appropriate storing tubes using sterile tweezers. Immerse the tubes containing the adipose tissue biopsies in liquid nitrogen at -190 °C to flash-freeze until the samples are stored at -80 °C.\n\tNOTE: The assistant must complete sample processing as quickly as possible, typically within 3 min of sample aspiration, to minimize potential sample degradation.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}