{
  "id": 13229,
  "origin_website": "Jove",
  "title": "Isolation, Culture, and Adipogenic Induction of Neural Crest Original Adipose-Derived Stem Cells from Periaortic Adipose Tissue",
  "procedures": [
    "The animal protocol has been reviewed and approved by the Animal Care Committee of Shanghai Jiao Tong University.\n1. Generation of Wnt-1 Cre+/-;Rosa26RFP/+ Mice\nCross Wnt-1 Cre+/- mice16 with Rosa26RFP/+ mice18 to generate Wnt-1 Cre+/-;Rosa26RFP/+ mice. House mice under a 12 h light/dark cycle in a pathogen-free facility at 25 °C and 45% humidity until they are 4–8 weeks old.\n2. Dissection of the PAAT\nNOTE: See Figure 1.\nSterilize all surgical tools (e.g., surgical scissors, standard forceps, and microsurgical scissors and forceps) by autoclaving at 121 °C for 30 min.\nPrepare the digestion medium (High glucose Dulbecco's Modified Eagle Medium [HDMEM] containing 2 mg/mL collagenase type I). Prepare the culture medium (HDMEM containing 10% fetal bovine serum [FBS] and 1% v/v penicillin-streptomycin [PS]). Sterilize using a 0.22 μm syringe filter before use.\nSterilize the cell culture reagents using UV, ethanol, filtration, or steam, as appropriate.\nPrepare a Petri dish with Hanks' Balanced Saline Solution (HBSS) and a 15 mL conical tube with 10 mL of HBSS supplemented with 1% v/v of PS solution. Keep both on ice.\nAnesthetize the mice15 with isoflurane and sacrifice by cervical dislocation. Immerse the bodies in a beaker filled with 75% alcohol (200 mL) for 5 min to sterilize the skin surface.\nSnip and separate the skin on the abdomen and cut along the ventral midline from the pelvis to the neck. Open the abdomen and move the liver to expose the diaphragm19.\nCut the diaphragm and the ribs on both sides of the midline and expose the heart and lungs by peeling back the ribs.\nRemove the lung and thymus and extract the PAAT along with the aorta and heart.",
    "Cut off the aorta at the aortic root to remove the heart. Make a cut between the aortic arch and descending aorta and carefully separate the adipose tissue surrounding both structures and the left and right common carotid arteries from the posterior chest wall. Transfer the tissue to the ice-cold HBSS buffer in the Petri dish.\nUsing sterile forceps, remove as much of the vasculature (e.g., aorta, common carotid arteries, and other small vasculature) and fascia as possible, and transfer the adipose tissue into the 2 mL Eppendorf tubes contain 0.5 mL ice-cold HBSS buffer on ice.\n3. Isolation of the SVF\nCollect the PAAT of 5-6 mice into one 2 mL microcentrifuge tube containing 1 mL freshly prepared digestion medium and mince the tissue using surgical scissors in an Eppendorf tube at room temperature (RT).\nTransfer the mix into 50 mL tubes containing 9 mL of the digestion medium. Homogenize the tissues by pipetting up and down with a 1 mL pipette 10x.\nIncubate the tubes at 37 °C with constant shaking at 100 rpm for 30–45 min and check every 5–10 min to prevent overdigestion. This is critical to improving cell viability and yield.\n\tNOTE: Good tissue digestion will result in a homogenous, light yellow adipose tissue that is visible to the naked eye upon gently swirling the tube.\nStop the digestion by adding 5 mL of HDMEM containing 10% FBS and 1% v/v PS at RT and mix well by pipetting.\nCentrifuge the cell suspension at 500 x g for 5 min at RT. The SVF will be visible as a brownish pellet. Carefully aspirate the floating adipocytes and decant the remaining supernatant without disturbing the SVF. Dissolve the SVF pellet in 10 mL of culture medium and filter through a 70 µm cell strainer.",
    "Centrifuge the cell suspension at 500 x g for 5 min, remove the supernatant, and gently resuspend the pellet in 5 mL of erythrocyte lysis buffer in a 15 mL conical tube for 10 min at RT.\nStop the reaction by adding 10 mL of 1x PBS containing 1% FBS. Centrifuge the cell suspension at 500 x g for 5 min at 4 °C, remove the supernatant, and resuspend the pellet in 10 mL of 1x PBS containing 1% FBS.\nCentrifuge the cells again at 500 x g for 5 min at 4 °C. Remove the supernatant and resuspend the pellet in 5 mL of culture medium in a 15 mL conical tube at 4 °C.\nAfter a final round of centrifugation (500 x g for 5 min at 4 °C), resuspend the pelleted cells in 5 mL of FACS buffer (PBS containing 10% FBS, 100 units/mL DNA I, and 1% v/v PS) on ice, and count the cells with a hemocytometer.\n4. Isolation of NCADSCs by FACS\nSet up and optimize the cell sorter following the instruction manual. Select the 100 µm nozzle, sterilize the collection tubes, install the required collection device, and set up the side streams20.\nA 561 nm yellow/green laser and optical filter 579/16 are recommended for sorting RFP+ cells. Perform the compensation using the negative control and the single-stained positive controls. See Figure 2A for the gating scheme.\nFilter the cells through a 40 µm strainer, centrifuge at 500 x g for 5 min, and resuspend the cells in 2 mL of FACS buffer at a density of 0.5–1 x 107/mL. Transfer the cells to clearly labeled 5 mL round bottom polystyrene tubes, and load into the sorter.",
    "Run the experimental sample tube at 4 °C, turn on the deflection plates, and sort into a 15 mL conical tube precoated with RPMI containing 1% FBS and 1% v/v PS.\n\tNOTE: Protect the samples from strong light to minimize RFP quenching.\n5. Culture of NCADSCs\nPlate the sorted cells at a density of 5,000 cells/cm2 in a 12 well culture plate in complete culture medium and incubate at 37 °C in a humid atmosphere with 5% CO2 for 20–24 h.\nRemove the culture medium, wash the cells with prewarmed (37 °C) PBS to remove cell debris and add fresh culture medium.\nOnce the cells are 80–90% confluent, digest the monolayer using a 0.25% trypsin EDTA solution at 37 °C in an incubator for 3–5 min, and neutralize with 2 mL of culture medium.\nCentrifuge the harvested cells for 15 min at 250 x g at RT, remove the supernatant, and resuspend the cells in 1 mL of culture medium. Count the cells with a hemocytometer.\nSeed the cells in a 12 well culture plate at the density of 5,000 cells/cm2.\nResuspend the remaining cells in culture medium containing 10% DMSO, freeze, and store in liquid nitrogen.\n6. Adipogenic Induction of NCADSCs\nInduce adipogenic differentiation of the NCADSCs at 80–90% confluency and standard culture conditions21.\nFor brown adipogenic induction, first treat the cultured cells with brown adipogenic induction medium (HDMEM, 10% FBS, 1% v/v PS, 0.5 mM/L IBMX, 0.1μM/L dexamethasone, 1 μM/L rosiglitazone, 10 nmol/L triiodothyronine, and 1 μg/mL insulin) for 2 days. Wash the cells with PBS 2x and replace with fresh medium (HDMEM, 10% FBS, 1% v/v PS, 1 μM/L rosiglitazone, 10 nmol/L triiodothyronine, and 1 μg/mL insulin). Change this medium every 2 days for a total of 3–5x.",
    "For white adipogenic induction, first treat the cells with white adipogenic induction medium (HDMEM, 10% FBS, 1% v/v PS, 0.5 mM/L IBMX, 0.1 μM/L dexamethasone, and 1 μg/mL insulin) for 2 days. Wash the cells with PBS 2x and replace with fresh medium (HDMEM, 10% FBS, 1% v/v PS, and 1 μg/mL insulin). Change this medium every 2 days for a total of 3-5x.\nAnalyze the adipogenic cells as appropriate.\n\tNOTE: Be gentle when washing the cells with PBS. Differentiated adipocytes can easily wash away.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}