{
  "id": 17999,
  "origin_website": "Jove",
  "title": "Acyl-PEGyl Exchange Gel Shift Assay for Quantitative Determination of Palmitoylation of Brain Membrane Proteins",
  "procedures": [
    "All animal procedures followed guidelines set forth by the National Institutes of Health (NIH) and have been approved by the Institutional Animal Care and Use Committee at the University of California, Davis.\n1. Preparation of mouse brain membranes\nDecapitate mouse using a guillotine apparatus and dissect brain out rapidly (in <1 min, if possible, to minimize palmitoylation changes that may occur during dissection procedure). Homogenize immediately in 10 mL of homogenization buffer (Table 1) in a glass homogenizer (~12 strokes) on ice.\nCentrifuge lysates for 15 min at 1,400 x g at 4 °C. Transfer the supernatant to a new tube on ice. Resuspend the pellet (~6 strokes) in an equal volume of homogenization buffer and centrifuge at 710 x g for 10 min at 4 °C.\nCombine the supernatants from step 1.2 and centrifuge at 40,000 x g for 20 min at 4 °C.\nDiscard the supernatant (cytosolic fraction) and resuspend the pelleted membrane (P2) fraction in homogenization buffer.\n\tNOTE: Samples can be flash frozen and stored at -80 °C for later use.\nPerform a bicinchoninic acid (BCA) assay to quantitate protein levels. For the APEGS assay, begin with ~100−200 mg protein (maximum 250 mg) in a volume of 470 µL of buffer A (Table 1) in a 1.5 mL tube. Sonicate and centrifuge at >13,000 x g for 10 min at 25 °C to remove insoluble protein. Transfer solubilized protein to a new 1.5 mL tube.\n2. Acyl-PEGyl exchange gel-shift (APEGS) assay\nDisrupt disulfide bonds and block free cysteines.\n\t\nDisrupt disulfide bonds by incubating in 25 mM tris(2-carboxyethyl)phosphine (TCEP; 25 µL, added from a stock solution; Table 1) for 60 min at 55 °C.\nBlock free cysteines with 50 mM N-ethylmaleimide (NEM; 12.5 µL, added from a stock solution; Table 1) at room temperature for 3 h.",
    "NOTE: The reaction can be extended overnight.\nPerform chloroform methanol (CM) precipitation.\n\t\nTransfer the protein solution from 1.5 mL tube to a polypropylene or glass tube that can be centrifuged in a swinging bucket rotor at modest speed. A 5 mL tube is ideal. Add four volumes (2 mL) of methanol (MeOH) and vortex briefly.\nAdd two volumes (1 mL) of chloroform and vortex briefly.\nAdd three volumes (1.5 mL) of dH2O and vortex briefly.\nCentrifuge the samples at 3,000 x g for 30 min at 25 °C in a swinging bucket rotor.\nCarefully remove and discard the upper phase.\nAdd 3 volumes (1.5 mL) of MeOH and mix gently but thoroughly, being careful not to fragment the opaque protein pancake.\nCentrifuge at 3,000 x g for 10 min at 25 °C in a swinging bucket rotor.\nUsing a glass serological pipet, remove as much of the top phase as possible without disturbing the protein pancake.\nCarefully rinse the pellet with 1 mL of MeOH.\nAir dry the pellet for at least 10 min.\n\t\tNOTE: Dried pellet can be stored at -20 °C.\nPerform cleavage of palmitoyl-thioester linkages with hydroxylamine (NH2OH, HAM).\n\t\nResuspend protein precipitate in 125 µL of buffer A and sonicate briefly. Centrifuge at >13,000 x g for 10 min at 25 °C to remove insoluble material. Transfer solubilized protein to a new 1.5 mL tube.\nAdd 375 µL of buffer H (HAM+; Table 1) or buffer T (HAM-; Table 1) and incubate samples for 60 min at 25 °C.\nRepeat the CM precipitation described in step 2.2.\n\tNOTE: Dried pellet can be stored at -20 °C.\nAdd mPEG to unprotected cysteines.\n\t\nResuspend pellet in 100 µL of buffer A containing 10 mM TCEP. Transfer to a 1.5 mL tube.",
    "NOTE: It is normal for significant loss of protein to have occurred during CM precipitation steps. All subsequent steps will be performed in a 1.5 mL tube, constraining the volume of protein to a maximum of ~120−130 µL. This will reduce protein loss during the final CM precipitation.\nAdd 20 mM mPEG-5k (25 µL, added from a stock solution; Table 1) to protein sample and mix by pipetting. Incubate for 60 min at 25 °C with end-over-end rotation.\nTo remove unincorporated mPEG-5k, perform CM precipitation as described in step 2.2 using these adjusted volumes: 4 volumes of MeOH (500 µL), 2 volumes of chloroform (250 µL), and 3 volumes of dH2O (375 µL). Centrifuge at >13,000 x g for 10 min at 25 °C.\nCarefully remove the upper phase as before, avoiding the thick, flocculent pancake. Add 1 mL of MeOH and mix gently but thoroughly. Centrifuge at >13,000 x g for 10 min at 25 °C.\nCarefully remove the supernatant and rinse the pellet with 1 mL of MeOH. Centrifuge at >13,000 x g for 10 min at 25 °C. Air dry pellet.\n\t\tNOTE: Dried pellet can be stored at -20 °C.\nResuspend the dried pellet in 50 µL of buffer A (without TCEP or any reducing agent). Reserve 5 µL for BCA protein quantitation. After quantitation, add an appropriate amount of 4x Laemmli sample buffer and, depending on the protein of interest, potentially heat the sample to 70−100 °C for 10 min.\n\t\tNOTE: Boiling may cause aggregation of some membrane proteins.\n3. Western blot analysis of PEGylated proteins\nLoad the sample onto an sodium dodecyl sulfate polyacrylamide gel electrophoresis (SDS-PAGE) gel13.\n\tNOTE: In this protocol 10% polyacrylamide was used.\nUse standard separation, transfer and detection protocols for Western blotting14.",
    "Use densitometry14 to determine the relative amounts of PEGylated versus nonPEGylated proteins.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}