{
  "id": 17619,
  "origin_website": "Jove",
  "title": "Simplifying Transcutaneous Intratracheal Drug Delivery in the Newborn Preterm Rabbit",
  "procedures": [
    "For all experiments involving IT injection, permission has been sought from the Animal Ethics Committee of KU Leuven, and all guidelines of animal welfare and care of KU Leuven were adhered to.\n1. Preparation\nCollect all required materials to complete the IT injection (Table 1).\nEnsure that the exhaust of the anesthetic chamber is open and connected to a scavenger to prevent exposing the researcher to Isoflurane.\n2. Delivery of pups\nNOTE: Rabbit pups (New Zealand white-Flemish giant hybrid) were delivered via hysterotomy on day 28 gestation (term 31 days) during the saccular phase of lung development as previously described by our group17. Pups can be placed in either normoxia to study lung development following preterm birth, or hyperoxia to study acute lung injury.\nSedate dam with an intramuscular injection of 1 mL ketamine (100 mg/mL) and 1 mL xylazine (2%) delivered to the quadriceps with a 2 mL syringe and 26 G needle. Once deeply sedated, place the dam in a supine position on the operating table. Adequate anesthesia is confirmed by deep slow respiration, decreased jaw tone, and the lack of response to an ear pinch.\nShave the central abdomen with an electric shaver and sterilize the surgical field with iodine-based solution.\nEuthanize the dam with an intravenous bolus of 1 mL of T61 delivered in the lateral vein of the ear.\nImmediately perform a midline abdominal incision through the skin, muscle sheath, and abdominal muscles into the abdominal cavity.\nExtend the incision to expose the bicornate uterus.\nImmediately make an incision in the uterus using a pair of scissors and deliver each of the pups via the hysterotomy. Rapid delivery of the pups is essential to ensure survival.\nOn delivery, dry each pup using a paper towel, this both dries and stimulates the pup.",
    "Place the dried pup in the warmed (36 °C), humidified (50% relative humidity) incubator.\nAllow 1 h for the recovery and transition to the extra-uterine environment. All the surviving pups are randomized to the predetermined treatment groups.\n3. Anesthesia\nFlood the induction chamber with Isoflurane (2.5%, 2.5 minimum alveolar concentration (MAC), 2 L/min)\nPlace pups in the induction chamber until adequate level of anesthesia is achieved (decreased spontaneous movement, diminished foot reflex to painful stimuli, decreased respiratory rate).\n\t​NOTE: Eyes of the rabbit pup are not open on day 28 gestational age (as in this experiment) and, therefore, no topical eye ointment is required to prevent dryness of the cornea. Should IT injections be performed later in life, topic ointment should be applied to the open eyes.\n4. Positioning for intratracheal injection\nPosition the pup on the mounting stage, supine with neck extended, and nose inserted into the nosecone to provide continued anesthesia.\nRestrain the paws of the pup using non-stretch adhesive tape to tape the paws to the mounting stage.\nIdentify the tracheal and laryngeal cartilage rings, which are visible as dark subcutaneous midline structure in the upper trachea superior to the thoracic inlet.\nSterilize the skin over the trachea with alcohol solution (80% ethanol solution)\nGrasp and stabilize the larynx with Allis forceps with the non-dominant hand of the operator.\n5. Performing the intratracheal injection ( Figure 1)\nPrepare to cannulate the trachea with the 26 G intravenous cannula (best done with the dominant hand) while stabilizing the trachea with the Allis forceps.\n\tNOTE: To ensure sterility of the procedure, use a new sterile cannula for each pup.\nPenetrate the skin with the cannula at a 45° angle to the skin at the level of the thyroid cartilage.",
    "Slowly advance the cannula and stylet until the trachea is cannulated, a subtle \"give\" is felt as the needle penetrates the trachea and enters the airway lumen.\nOnce the cannula with the stylet is in the lumen of the trachea, stop advancing the stylet and advance the plastic cannula over the stylet into the trachea while holding the stylet stationary. Do not advance the plastic cannula >10 mm or selectively intubating either the left or right main bronchus is risked.\nWithdraw the stylet from the cannula leaving the plastic cannula sheath in the trachea.\nConfirm the IT position of the cannula by injecting a small amount of normal saline (0.9% NaCl, 5 µL) into the cannula using a Hamilton syringe and 30 G blunt needle. Once the saline has been injected into the cannula, remove the Hamilton syringe and needle. Observe the air-fluid level within the plastic cannula; movement of the air-water level in the cannula with spontaneous respiration confirms placement of the cannula within the airway.\nDraw up the required amount of substance into the Hamilton syringe using the 30 G blunt tip needle.\nIntroduce the 30 G blunt tipped needle (attached to the Hamilton syringe) into the plastic cannula (in the trachea), and slowly inject the substance into the trachea over 5-10 s.\nRemove the Hamilton syringe needle from the plastic cannula and the plastic cannula from the trachea.\n6. Recovery from procedure\nFree the pup from the mounting stage and stimulate respiration with tactile stimulation of the pup.",
    "Return the pup to a separate cage from the unanesthetized pups cage in the warmed (36 °C), humidified (50% relative humidity) incubator; place in a 30° head up position until sufficiently recovered from anesthesia and able to maintain sternal recumbency. Do not leave the pups unattended until they recover from the anesthetic.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}