{
  "id": 1985,
  "origin_website": "Cell",
  "title": "Protocol for using negative pressure isolator systems to study BSL-2 organisms in gnotobiotic murine models",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTransferring germ-free mice\nTiming: 30 min\nGerm-free mice will need to be transferred from their home isolator into the experimental negative-pressure BSL-2 isolator. Prior to the transfer, Trans-Tainer transfer containers will need to be prepared in a sterilizing cylinder in the isolator the mice are coming from. The receiving negative-pressure containment isolator should be set up with prepared cages prior to the transfer so that the mice can be housed.\nWe recommend testing the sterility of the isolator and supplies with germ-free mice. Three germ-free mice should be transferred in, allowed to acclimate for one week, and monitored for sterility using the methods described in “Check for sterility or defined association of mice.” Once the sterility of the isolator and supplies is confirmed, the experimental mice may be transferred in.\nCritical: The negative pressure should not be turned off if the isolator contains any BSL-2 agents. The protocol below describes the transfer of animals into a newly set up isolator. Negative pressure is turned off when transferring animals in to avoid exerting too much pressure on the inner port cover. If negative pressure is left on and the inner port cover is pulled, unfiltered, unsterilized ambient air and any Clidox®-S vapors in the port can be drawn into the isolator.\nLoading mice to be transferred (Figures 9[href=https://www.wicell.org#fig9]A–9D)\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1467-Fig9.jpg\nFigure 9. Schematic showing the transfer of germ-free mice using Trans-Tainer tubes\n(A) Preparation of Trans-Tainer tube,\n(B–D) loading of mice, and (C) transfer out of home isolator, and (D) move to the experimental isolator.\n(E–G) Turning off negative pressure and spraying transferred mice in Trans-Tainer into the experimental isolator, and (F) fogging to sterilize port prior to (G) pulling mice into the isolator after 15 min of contact time.\nBefore beginning, prepare fresh Clidox®-S sterilant.",
    "Prepare Trans-Tainer tubes by placing one of the filter caps on and adding a small amount of bedding a few pellets of diet.\nUse forceps to hold mice at the base of the tail, gently lift and place in the Trans-Tainer tube(s). One Trans-Tainer tube can hold 3–5 mice depending on size and strain. Do not place mice from different litters in the same Trans-Tainer tube, as they may fight.\nSecurely fasten the end cap to the open end of the tube.\nSet a timer for 20 min. It is important to work quickly to minimize the time the mice are in the tube.\nRemove the band and inner port cover and place the Trans-Tainer tube(s) in the port. Quickly replace the inner port cover and band.\nRemove the outer port cover and remove the Trans-Tainer tube(s).\nThe port can be left without disinfecting with Clidox®-S and closing until after the transfer is complete following the procedure described in “before you begin[href=https://www.wicell.org#before-you-begin]” step 15f to sterilize and close the port.\nPrepare the experimental negative-pressure BSL-2 isolator to receive mice (Figures 9[href=https://www.wicell.org#fig9]E–9G).\nTurn off negative-pressure airflow by closing the valve.\nRemove the outer port cover.\nPlace the Trans-Tainer tube(s) in the port. Thoroughly spray all surfaces of the tube(s) and the port with Clidox®-S. Spray the outer port cover, replace, and fog the port with Clidox®-S as described in “before you begin[href=https://www.wicell.org#before-you-begin]” step 15f.\nIdeally, the physical transfer and closing of the port should take about 5 min.\nSet another timer for 15 min. This is the time needed for the Clidox®-S to sterilize the port and outside of the Trans-Tainer tube(s).\nMonitor the mice for signs of distress.",
    "If you notice the mice display signs of distress (e.g., difficulty breathing, lethargy), remove the Trans-Tainer tube(s) from the port via the outer port cover and remove a filter cap by breaking one of the tabs. These mice are no longer germ-free and cannot be used for gnotobiotic experiments.\nAfter 15 min, remove the inner port cover and pull the mice in. Turn negative pressure airflow back on.\nOpen a prepared cage and one end of the Trans-Tainer tube by breaking a tab. Carefully move the tube to cover the cage and angle the open side down so the mice move into the cage.\nClose the cage and observe them for 1 or 2 min to ensure they are behaving normally.\nDistribute mice to other cages as needed by picking them up by the base of the tail using forceps.\nAlternatives: There are alternative means of transferring germ-free animals into isolators. Trans-Tainer tubes and TransDisks (Class Biologically Clean) allow for the transfer of mice from breeding isolators in a clean room to mice in a negative pressure containment isolator in a room dedicated for BSL-2 work. TransDisks (Class Biologically Clean) have separate compartments and are convenient for transferring both male and female mice or males from different litters. If using germ-free mice from a vendor or other source, mice may be kept in their transport cages and transferred using a Shipper Sleeve (Class Biologically Clean).\nCritical: Once mice are in the isolators, ensure the power supply remains connected. If the power supply is turned off, no air will enter the isolator and the mice will die.\nCheck for sterility or defined association of mice\nTiming: 30 min, 2 days incubation\nMice should be checked for sterility or defined association weekly.\nFecal pellet collection from gnotobiotic mice",
    "Use long forceps to gently lift one mouse from the cage by the base of the tail and place into a tri-corner beaker.\nWait ∼5 min for mouse to produce two fecal pellets.\nWhile waiting, label one microcentrifuge tube with appropriate isolator number/letter and date.\nUpon fecal pellet production, return the mouse to the cage.\nUse forceps to gently remove the pellets from the beaker and place into the snap-cap tube.\nOpen the inner port cover of the isolator and place the sample tube into the transfer port.\nReplace the inner port cover and band.\nOnce the inner port cap is securely fastened, open the outer port cover, and remove the sample tube.\nFollow the procedure described in “before you begin[href=https://www.wicell.org#before-you-begin]” step 15 f to sterilize and close the port.\nPlating\nImmediately homogenize the collected fecal pellet sample in 900μL of pre-reduced 1× PBS with 0.05% cysteine.\nPipette 100 μL of the PBS on a blood agar and a Brucella agar plate and streak evenly across the entire surface of the plates.\nFor each sample, pipette 100 μL of homogenate on one blood agar and one Brucella plate.\nIncubate the sample and PBS blood agar plates aerobically at 37°C and incubate the Brucella plates in the anaerobic chamber at 37°C.\nRead the PBS and sample blood agar plates for growth after 24 h and the Brucella plates for growth after 48 h (Figures 10[href=https://www.wicell.org#fig10]A–10D).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1467-Fig10.jpg\nFigure 10. Plated and Gram-stained gnotobiotic fecal material to check sterility\n(A–D) Plated feces from (A) germ-free, (B) mono-colonized with a commensal, (C) contaminated, and (D) mono-colonized with C. difficile mice.\n(E–G) Gram-stained feces from (E) germ-free, (F) mono-colonized with a commensal Gram-negative bacteria (arrow), and (G) mice contaminated with environmental bacteria. Note the multiple morphologies present in the contaminated sample.",
    "(H) Gram-positive C. difficile vegetative cells (arrow), sporulating cells (arrowhead), and spores (square) cultured from feces from a mouse mono-associated with C. difficile. 1000× magnification, scale bar is 10 μm.\nThe PBS plates and germ-free fecal pellet plates should have no growth.\nEnsure that plated samples from mono-associated mice appear pure.\nGram Staining\nAfter plating, resuspend the fecal homogenate by vortexing briefly.\nPipette 10 μL of the homogenate onto a glass slide and allow to dry.\nHeat-fix the sample by quickly passing the slide over a flame a few times.\nFlood the slide with Gram Crystal Violet and let sit for 1 min.\nRinse gently with water, being careful to avoid the stream hitting the sample directly.\nFlood the slide with Gram Iodine and let sit for 1 min.\nThoroughly rinse the slide with a decolorizing solution consisting of 30% acetone and 70% ethanol until it runs clear.\nRinse with water.\nFlood slide with Gram Safranin and let sit for 30 s.\nThoroughly rinse slide with water and let dry.\nObserve the slide at 400–1000× magnification with a light microscope. Confirm the absence of bacterial or fungal cells from germ-free samples and that mono-associated mice are free from contamination by other bacteria or fungi (Figures 9[href=https://www.wicell.org#fig9]E–9H).\nGavage with commensal bacteria\nTiming: 1 h\nNote: When handling animals in the isolator, wear cotton gloves over the isolator gloves to provide better grip.\nCritical: Separate isolators are needed for different gnotobiotic conditions as microorganisms easily spread throughout the isolator.\nUse freshly prepared Clidox®-S to spray the commensal inoculum Hungate tube and 1 mL syringe with safety needle.\nReplace outer port cover as described in “before you begin[href=https://www.wicell.org#before-you-begin]” step 15 f.\nAllow 30 min of exposure to Clidox®-S before pulling the items into the isolator.",
    "Open the 1 mL syringe and carefully pierce the septum of the Hungate tube to draw up the inoculum.\nSeal needle in the safety cap.\nRemove the capped needle and replace it with the gavage tube.\nPick up a mouse by the base of the tail using the forceps and place on the cage lid.\nRestrain the mouse by holding by the skin at the nape of the neck, hold upright, and place the tail between the 4th and 5th fingers to hold firmly.\nCarefully introduce the gavage tube into the mouth and then into esophagus.\nOnce the tube is placed, carefully inject 200uL of inoculum.\nCarefully remove the tube and return the mouse to its cage.\nObserve mouse for up to 5 min for normal behavior.\nAfter 48 h, collect fecal pellets from the mice and check for defined association with the commensal bacteria as described in “Check for sterility or defined association of mice.”\nC. difficile infection\nTiming: 1 h, 7 days after commensal inoculation\nFollowing the same gavage procedure as described above, administer 200uL of 5 × 103 CFU/mL C. difficile spores to achieve a dose of 1 × 103 CFU.\nMonitoring C. difficile infection\nTiming: 1 h, 2× daily after C. difficile infection\nBody weight measurement\nPlace a tri-corner beaker on the scale weighing tray and tare.\nUse forceps to pick up a mouse and place in the beaker.\nRecord the weight once the mouse is settled and the value stabilizes.\nReturn the mouse to the cage and repeat.\nBody condition scoring\nObserve the mice in their cages for C. difficile infection symptoms and general signs of pain and distress.\nMice must be euthanized if they attain a score of 2-.\ntable:files/protocols_protocol_1467_1.csv",
    "Critical: Evaluate prior recorded weights for a mouse when assigning a body condition score. Loss of 10–15% body weight over 2–3 days or 20% body weight overall contributes to a score of 2- and grounds for euthanasia.\nContainment and decontamination of biohazardous material in isolator\nTiming: 1 h active time, 8 h including disinfection and autoclaving\nCritical: Before starting, ensure all required equipment for BSL-2 waste management.\nBSL-2 wastes and isolator components must be contained and decontaminated at the end of the experiment. Proper decontamination of the isolator, filters, and covers is necessary to prepare them for use in future gnotobiotic experiments.\nContain all materials and instruments in the isolator in double autoclavable biohazard bags.\nUsing freshly prepared Clidox®-S, spray autoclavable biohazard bags and steam integrator strips into the isolator port and replace outer port cover as described in the section “before you begin[href=https://www.wicell.org#before-you-begin]” step 15f. Allow 15 min of contact time before pulling them into the isolator.\nCollect cages, cups, feeding needles, and other instruments in a double biohazard bag with a chemical integrator strip and tie each off. Collect all bedding, diet, and other disposable material in a separate double biohazard bag. Collect scale in a separate double biohazard bag.\nRemove the inner port cover. Remove a rubber stopper from the outer port cover and fog the chamber and materials with Clidox®-S sterilant using the atomizer through the opening. Allow to sit for 5 h for contact sterilization to occur.\nPull bagged waste and materials out of the isolator. Dispose of waste in the appropriate biohazard waste containers.\nSterilize the bagged scale by ethylene oxide sterilization as described in “before you begin[href=https://www.wicell.org#before-you-begin]”. Ensure the dosimeter indicates the cycle has passed before removing the scale from the bag.\nBreak down, contain, and decontaminate isolator components.",
    "Turn off positive and negative pressure air pumps by unplugging power supply.\nDisconnect filters by loosening hose clamps and screws and detach from the isolator. Remove vinyl tape and plastic covers.\nSpray all surfaces of plastic covers with Clidox®-S sterilant.\nAllow 30 min of contact time before wiping.\nPlace filter frames in a double autoclavable biohazard bag. Double knot to close.\nDecontaminate bagged cages, instruments, and filter frames by autoclaving at 129°C and 30 PSI for at least 20 min. Ensure that the steam integrator strips indicate that the cycle passed. If not, the materials will need to be re-autoclaved until they are properly sterilized."
  ],
  "subjectAreas": [
    "Model Organisms",
    "Microscopy",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}