{
  "id": 8740,
  "origin_website": "Jove",
  "title": "A Rat Model of Central Fatigue Using a Modified Multiple Platform Method",
  "procedures": [
    "All the animals were maintained in accordance with the guidelines by the Chinese legislation on the ethical use and care of laboratory animals.\n1. Pre-modeling Preparation\nLaboratory preparation\nRun the UV lamp for at least 30 min before the experiment.\nControl the lab temperature at 25 ± 3 °C, and relative humidity around 30%.\nTurn on the lab light at 6:00 and turn it off at 18:00 to establish a 12 h/12 h light/dark cycle.\nMultiple Platform box construction\nConstruct an opaque plastic tank without a cover of 110 × 60 × 40 cm3.\nFix fifteen circular platforms (h = 8 cm, d = 6.5 cm) on the bottom of the tank, which orderly distribute in three rows and five columns. Leave enough space between each platform, roughly 10 cm between columns and 13 cm between rows.\nSet a water outlet on the lateral side of the tank and install a faucet.\nMake an iron-wire netting cover for the tank with a food box hanging on it.\nGrouping and housing rats\n\tNOTE: Wistar male rats of 8 weeks old, weighing approximately 200 - 210 g, are used in the experiment. The rats live in groups during the modeling process.\n\t\nNumber the rats' tail roots with a marker pen.\nWeigh the rats, exclude the extremely light or heavy ones, and divide the rest randomly into the model and control groups.\nPut the rats gently into the clean cages and allow them to acclimate to the lab for at least 3 days. Provide sufficient water and food supply.\n2. Modeling with MMPM",
    "NOTE: The process starts at 18:00 and ends at 8:00 the next day, for a total of 14 h per day, over 21 days. To avoid interference factors, the same person is required to conduct the entire experiment, while wearing the same lab coat. 10 Wistar rats are used in the experiment.\nPlace the tank on a flat surface, e.g., the floor. Then fill the tank with roughly 7 cm of warm (25 ± 3 °C) water, approximately 1 cm below the platform flat.\nPrepare enough food and drink for all the rats in the tank for 1 day. Put fodder and water into the food box and hang it on the cover.\n\tNOTE: Some smart rats learn to rest on the food box. If so, drive them back into the tank.\nTake the model group rats out of the cage, grab them by the tail, and put them gently into the tank. Launch all the rats in the water instead of the platforms to motivate their fear of water. Make sure that every rat gets a platform to stand on, while rats of the control group stay in their original cages with sufficient food and water.\nCover the tank. Monitor the rats to avoid accidental injury. If a rat stays in water for more than 1 h without climbing onto the platform, pick it out of the tank and remove it from the test.\nAfter 14 h, take the model rats out of the tank and dry their hair with a dryer. Re-mark the rats' tails if it fades. Return the rats to their original cages and provide them with sufficient food and water.\nFlush every corner of the tank. Elevate one side of the tank and open the faucet to outflow the sewage.",
    "Sterilize the tank with a 75% ethanol spray and expose it to the UV light.\n3. Model Assessment: Behavioral Test\nNOTE: All the tests are performed in the behavioral lab. Noise and extra light are not allowed during the test to avoid disturbance. If possible, use the same person(s) to conduct each test. A dark coat and gloves are required for grey scale recognition in image processing. Perform the OFT first as it has the least effect on rat behavior.\nOFT\nCheck the recorder over the Open Field Box to make sure it is properly connected to the workstation and covers every corner of the box. Adjust the lighting to eliminate shadows in the box.\nMove the rats into the behavioral lab in their original cages. Allow them to acclimate for at least 1 h before the test.\nClean and sanitize the box with 75% ethanol to ensure that there is no excrement or smell left from previous experiment.\nRemove a rat from the cage by its back and put it gently into the central area of the box. Quickly retreat arms from the box so as not to block the shot.\nInput the rat's number and start recording. Count and record the frequency of the rat's vertical activities, including rearing and climbing.\nAfter 5 min, stop recording, take the rat out of the box, and return it to the cage.\nRepeat steps 3.1.3 - 3.1.6 until all the rats have finished the test.\nEPM\nPerform the pre-check and acclimation steps as for the OFT (steps 3.1.1 - 3.1.2).\nRemove a rat from the cage by its back and put it gently onto the junction part of the two arms. Land the rat towards the left open arm and leave quickly so as not to block the shot.",
    "Input the rat's number and start recording. Count and record the frequency of different arm entrances. If the rat drops off the maze in the test, pick it up and send it back to the maze. Record detailed information for data analysis.\nAfter 5 min, stop recording, take the rat out, and return it to the cage.\nRemove the excrement and wipe the maze with 75% ethanol to eliminate the former rat's smell.\nRepeat steps 3.2.2 - 3.2.5 until all the rats have finished the test.\nES test\nFill the swimming tank (70 × 30 × 110 cm3) with 80 cm of warm (25 ± 3 °C) water.\n\t\tNOTE: If there is a thermostat in the tank, the water temperature should be set around 37 °C, which is similar to the rat's body temperature. If not, set it to room temperature to keep it constant.\nMake a load for each rat with pin bunches and tie it gently on its tail root. The load weighs 10% of the rat's weight.\nGrab a rat by the tail and throw it into the swimming tank. If the rats huddle or cling to the wall, set them apart and drive them back into water.\nStart timing at the moment when the rat is put into water and stop timing when it's exhausted, which is demonstrated as the failure to struggle out of water with the mouth and nose beneath the water for more than 10 s.\n\t\tNOTE: Sometimes, exhaustion and drowning occur suddenly. Be sure to have enough experimenters to record and save the animal at the same time.\nRemove the exhausted rats out of the water without interrupting others. Dry their hair, re-mark their numbers, and send them back to cage.",
    "Change the water in the tank after one group finishes. After all the rats are done, empty the swimming tank, and clean and sterilize it with ethanol and UV light.\n4. Model Assessment: Central Neurotransmitter Detection\nAnesthetize the rat with intra-peritoneal injection of 10% chloral hydrate (3 mL/kg) until it is unconscious.\nDecapitate the rat.\nMake a longitudinal incision along the post-medial line, open the cranium to both sides, and expose the brain. Turn the cranium over, remove the brain, and put the brain on an ice bag.\nSeparate and remove the hypothalamus, which is the diamond-shaped area in the central part of the base of the brain that has a clear boundary with surrounding tissues. Place it in a sterile tube and freeze it with liquid nitrogen. Store all the samples in a -80 °C refrigerator.\nDetect the content of DA and 5-HT in the hypothalamus using high-performance liquid chromatography (HPLC)8.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}