{
  "id": 10195,
  "origin_website": "Jove",
  "title": "Simultaneous Brightfield, Fluorescence, and Optical Coherence Tomographic Imaging of Contracting Cardiac Trabeculae Ex Vivo",
  "procedures": [
    "The University of Auckland's Animal Ethics Committee approved the handling of rats and the preparation of tissue samples.\n1. Imaging calibration\nBrightfield microscope pixel calibration\n\t\nFill the measurement chamber with distilled water.\nPlace a diffraction grating with known lines per µm into the measurement chamber.\nPress F1 to enable the capture and adjust the Frame Rate [Hz] until the diffraction grating is clearly visible (Figure 4A). Ensure that the diffraction grating runs parallel with the edge of the frame. Press F1 again to stop capture.\nSet the Total Images to Capture? to one, press Ctrl + Shift + S to stream data to disk, and press F1 to capture an image of the diffraction grating.\nOpen ImageJ and import the diffraction grating image (File > Open > Select Calibration image). Holding shift, draw a line that encompasses 20 light and dark bands of the diffraction grating.\nCalibrate the image (Analyze > Set Scale). The length of the line from Step 1.1.5 sets the Distance in Pixels value. Set the Known Distance value to 20 times the lines per µm measurement and the Unit of Length to µm. The inverse of the scale is the number of micrometers represented by a pixel.\nOCT depth resolution calibration\n\t\nMeasure the thickness of a glass microscope slide using Vernier calipers.\nTurn on the OCT laser source.\nCover the galvanometer head and click Get BG to measure the background interference pattern and subtract it from the measurement (Figure 4B).\nClamp the measured glass microscope slide (from Step 1.2.1) in the measurement arm of the OCT.\nClick Live Stream to view the OCT image. Adjust the glass microscope slide until it is visible within the B-scan.\nTo capture the B-scan image, set Range Y (Steps) to one, click Stream B-scan Data?, and click Acquire.",
    "Import the B-scan image into ImageJ (File > Open > Select B-scan). Holding shift, draw a line between the boundaries of the glass microscope slide.\nSet the scale (Analyze > Set Scale). Set Known Distance to the measurement collected in Step 1.2.1.\nTo calculate the depth resolution in air, correct for the refractive index of the microscope slide (nglass = 1.5175)11 by multiplying the measurement per pixel value by nglass.\n\t\tNOTE: The nglass quoted is for borosilicate glass. Microscope slides can be made from different materials. Use the appropriate refractive index for the slide measured.\nTo scale the depth resolution for myocardium, divide the value from Step 1.2.9. by nmyocardium = 1.38 (value reported previously12).\n2. Muscle sample preparation\nPrepare the dissection rig.\n\t\nPour some of the dissection solution (outlined in Table 1) into a small metal bowl and place in the freezer about an hour before heart excision.\nSetup a dissection rig ensuring dissection solution is well-oxygenated (100% oxygen) and has flushed through each of the tubing lines. Fill the dissection chamber with oxygenated dissection solution and loosely tie 3/0 suture around the perfusion catheter.\nExcise the heart.\n\t\nAnesthetize 8-10 weeks old Wistar rat using gaseous isoflurane (< 5% in oxygen). Confirm anesthesia by tail pinching.\nPosition the anesthetized rat in a supine position and inject subcutaneously in the abdominal area with heparin solution (1000 IU/kg). Maintain anesthesia for five more minutes to allow the heparin to circulate.\nRetrieve the metal bowl containing dissection solution from the freezer and place it near the euthanization bench.\n\t\tNOTE: Avoid freezing the dissection solution completely to enable the complete submersion of the dissected heart.\nTransfer the anesthetized rat to the euthanization bench and euthanize by cervical dislocation.",
    "Open the rat chest with scissors, first cutting the body wall along the underside of the ribcage, then the diaphragm, before proceeding along the lateral borders of the ribcage. Lift the chest out of the way.\nGrab the heart with one hand while the other hand uses a pair of curved scissors to cut the connecting vessels (aorta, vena cava, etc.).\nQuickly submerse the heart in the cold dissection solution.\nIsolate a trabecula.\n\t\nIdentify the aorta while the heart is in the metal bowl, then transfer the heart to the dissection chamber. Using two curved forceps, pull the aorta over the perfusion cannula.\nHold the aorta in place with one forceps. Meanwhile, open the tubing line to allow the dissection solution to flow through the perfusion cannula.\n\t\tNOTE: Aim to complete perfusion within the minute following the heart excision.\nOnce the coronary vasculature is cleared of blood and the heart is completely perfused with the dissection solution, halt the perfusion flow, and secure the aorta in place using the suture. Turn the flow back on and perfuse the cannulated heart.\nRotate the cannula so that the left coronary artery is visible on the superior surface. Pin the apex of the heart to the bottom of the dissection chamber (Figure 5A). Cut off both atria (Figure 5B).\nWith a set of spring scissors, cut along the right side of the septum to the apex of the heart (as indicated on Figure 5B). Pin the opened left ventricle to the base of the dissection chamber. Then cut along the left side of the septum, open the right ventricle, and pin it to the base of the dissection chamber, too (Figure 5C).",
    "NOTE: In order to pin the ventricles in an open position, some papillary muscles will have to be cut. Identify a free-running trabecula in the right ventricle (Figure 5D-E).\nUsing the spring scissor and a forceps, cut the wall tissue surrounding the trabecula, then cut the wall tissue in half orthogonally to the direction of the trabecula. Trim the wall tissue until its dimension is appropriate for the mounting configuration used. In this case, approximately half the size of a sesame seed (Figure 5F).\n\t\tNOTE: Trabeculae can be dissected from the right and left ventricles, but those from the left are typically more turbid and less applicable for sarcomere and geometry measurements.\nLeave the excised trabecula in the dissection chamber, continuously superfusing with the dissection solution.\n3. Experimental protocol\nNOTE: The device13 used for this experiment was built in-house and uses custom control code. The necessary considerations for the design of a device built to replicate these data are two independently actuated mounting hooks, a measurement chamber with three optically clear axes (Figure 3), and an external trigger line that synchronizes the brightfield and OCT cameras with the stimulator. The PMT voltage and force signal were collected using analog DAQ cards, the images from the OCT and brightfield microscope were collected using Camera Link frame-grabber cards, and the stimulus signal was collected using a digital I/O card. Data were stored offline using a set of producer consumer loops to maintain temporal alignment.\nPrepare the cardiomyometer.\n\t\nFlush hot (~60 °C) water, distilled water (room temperature), and then superfusate solution through the measurement chamber. Continuously bubble the superfusate solution with carbogen.",
    "Turn on the brightfield microscope illumination source and press F1 to enable capture (Figure 4A). Manually adjust the downstream hook until it is centered in the brightfield image. Click Zero Downstream Axis, then Downstream Disabled to enable the motor (Figure 4C). Move the DS Setpoint [um] slider until the end of the hook aligns with the edge of the default region of interest.\n\t\t\nRe-zero the downstream axis, then move the DS Setpoint [um] slider to 1000. Repeat the process with the upstream hook, but do not move the US Setpoint [um] slider.\nClick Move to Mounting (Figure 4C).\nStart the fluorescence illumination system by toggling the Lamp switch before quickly turning on the controller subsystems by toggling the Main switch.\n\t\tNOTE: Some UV light sources produce large amounts of ozone. If this is the case, connect an ozone extractor to the outlet vent of the light source and ensure it is running prior to turning on the fluorescence illumination source.\nSwitch the operational mode to Turbo-Blanking by pressing the Mode button on the front panel, followed by 2, then 1. Press the On-line button to allow the control code to inform operation.\nMount the trabecula.\n\t\nPause superfusate flow through the measurement chamber. Fill the mounting chamber with the dissection solution.\nUsing a 1 mL syringe, transport the trabecula from the dissection chamber to the mounting chamber (Figure 5G).\nTo transfer the trabecula, place the syringe vertically and in contact with the surface of the mounting chamber solution. Allow the trabecula to descend into the mounting chamber via gravity (Figure 5H).\nLower the fluid level in the mounting chamber so that it is in level with the midsection of the hooks.",
    "Adjust the distance between the hooks to reflect the slack length of the trabecula by moving the DS Setpoint [um] slider.\nUsing a microscope to aid visualization, lightly grip one of the pieces of end tissue with forceps and mount it onto the upstream hook. Mount the other piece of end tissue onto the downstream hook (Figure 5I).\nOnce securely mounted, move the trabecula back into the measurement chamber (Figure 5J) by pressing Move to Chamber (Figure 4C). Resume superfusate flow and fluid extraction.\nSet Stimulus frequency [Hz] to 1, Stimulus duration [ms] to 10, and Stimulus Voltage to 10. Start stimulation by pressing Stimulus On?.\nPrepare the trabecula.\n\t\nAfter about 1 h of acclimatization, gradually decrease the stimulus voltage and stimulus duration in 1 V and 1 ms steps, respectively. A typical set of values is 3 V and 3 ms.\nTurn on the brightfield illumination system. Press F1 and select a region of interest that encloses a striated area on the user interface. Click Compute SL? to calculate the average sarcomere length in the highlighted region. Increase the muscle length until the average sarcomere length is 2.32 µm by increasing the Separation Setpoint [um] slider.\n\t\tNOTE: Compute SL? uses a 2D FFT outlined in Step 4.3. The region of interest used to calculate the average sarcomere length is typically a 100 µm to 150 µm square. Therefore, as the muscle approaches optimal sarcomere length, 43 to 65 sarcomeres are used to calculate the average sarcomere length.\nMove the muscle by adjusting the Centre Setpoint [um] slider on the \"Centre and Separation Control tab (Figure 4C) so that the edge of the downstream hook is just visible within the brightfield image. Collect the fluorescence information for ten twitches.",
    "Increase the Centre Setpoint [um] value by 200 and collect another ten twitches worth of fluorescence information. Repeat this process until the brightfield image contains the upstream hook. Collect the final window's worth of fluorescence information.\nReturn the trabecula to a central position by setting the Centre Setpoint [um] value to 0.\nReduce the stimulus frequency to 0.2 Hz and switch from the KH superfusate to the Fura-2 loading solution (detailed in Table 1).\nMeasure the fluorescence signal every 10 min by clicking Enable Fluorescence Source on the Stim and Data tab. Visualize the fluorescence signal on the PMT Signal tab.\nAfter the 360 nm signal has increased by a factor of 10 or the duration of the loading procedure has exceeded 2 h, return the stimulus frequency to 1 Hz and switch back to the KH superfusate solution.\nCheck the ratio measurement every 10 min until the ratio measurement stabilizes, at which point data collection can begin.\nCollect brightfield- and fluorescence-imaging data.\n\t\nReturn the muscle to the position where the edge of the downstream hook is just present within the brightfield image. Start streaming hardware data by clicking Stream Data to Disk on the Stim and Data tab of the hardware-control user interface. Capture fluorescence information by clicking Enable Fluorescence Source.\nOn the brightfield imaging user interface, set the capture mode to an external trigger, increase the frame rate to 100 Hz, and set the number of images to capture to 100. Press Ctrl + Shift + S followed by F1 to record the brightfield imaging data for this window.\nIncrease Centre Setpoint [um] value by 200 and repeat Step 3.4.2. Continue with the scanning protocol until the imaging data has been collected for the final window from Step 3.3.4.",
    "Return the trabecula to a central position by setting the Centre Setpoint [um] value to 0.\nCollect OCT imaging data.\n\t\nTurn on the OCT laser source by turning the master key to the | symbol, pressing the power button, followed by the SLDs button.\nCover the galvanometer head and click Get BG to measure the background interference pattern and subtract it from the measurement (Figure 4B).\nSet the image capture mode to live-view.\nAdjust the y-position until the B-scan image contains the upstream hook only. Divide the muscle length displayed on the control front panel (Figure 4B) by two and subtract the current y-position. Enter this value into the \"y-offset\" input. Adjust the \"x-offset\" value until the cross-section of the trabecula is centered in the frame.\nWith the trabecula centered, scan along the y-axis by adjusting the y-position to find the positions corresponding to the upstream and downstream hooks. Note these positions down. Set Range Y (steps) to the absolute difference between these values divided by ten.\nSet the image capture mode to Stimulus Triggered?, Range X (steps) to 100, and click the Set Active Parameters button.\nClick Stream B-Scan Data?, then Acquire.\n\t\t​NOTE: The gated imaging protocol requires 200 twitches to capture the entire muscle geometry for a sample 2 mm in length, which corresponds to a capture time of ~3 min 20 s.\n4. Process the brightfield image dataset\nPrepare the images for analysis.\n\t\nImport images into ImageJ (File > Import > Image Sequence > Select image).\nIncrease image contrast (Image > Adjust > Brightness/Contrast > Move minimum and Maximum sliders to centralize the image histogram).\nSharpen the images (Process > Filters > Unsharp Mask > set Radius (Sigma) to 1.0 pixels and Mask Weight (0.1-0.9) to 0.6).",
    "Export the image sequence (Save As > Image Sequence > Set the Format to PNG, Start at to 0 and Digits (1-8) to 4).\nStitch the images, measure the localized displacement, and compute the local sarcomere lengths.\n\t\nOpen \"TrabeculaProcessing.m\" (available on request) and set the FolderPath variable to the main folder containing all of the data, and ImagePath to the folder where the image sequence from Step 4.1.4 was saved. Set sections to the number of imaging windows and frames to the number of frames captured per window.\nRun the code.\n\t\tNOTE: The outputs will be present in the output folder path specified by the user. (By default, the path is set to FolderPath/Output).\nFFT sarcomere length technique\n\t\nUse image-processing software to perform a FFT on a region of the image where sarcomeres are highly visible.\nMultiply the pixels per µm calibration results from Step 1.1.6 by 1.6 µm and 3.0 µm before calculating the inverse to get the range of spatial frequencies of interest.\nFit an exponential to the FFT result, ignoring the frequency information in the frequency range calculated in Step 4.3.2, and subtract it from the transform result to remove the DC term.\nFit a Gaussian curve to the frequency band of interest.\nCalculate the inverse of the peak of the Gaussian curve. This is the average sarcomere length for the region of interest.\n\t\t​NOTE: The FFT calculation and the fitting of the exponential and Gaussian equations were performed using custom LabVIEW code.\n5. Process the fluorescence data\nSubtract the window-dependent autofluorescence from the respective window and compute the quotient of the signals associated with the 340 nm and 380 nm excitation wavelengths.\n6. Process the OCT imaging data\nPrepare the OCT image set for segmentation.",
    "Open ImageJ and import the images (File > Import > Image Sequence). On the file explorer window, this opens, locate the images, select one and click Open.\n\t\tNOTE: If the control code for the OCT does not store the images in a format that is readable by ImageJ, convert them to PNG.\nTo ease visualization, organize the image sequence into a hyperstack (Image > Hyperstacks > Stack to Hyperstack). In the dialogue box that opens, set the number of slices to the number of B-scans per slice and the X to the number of slices along the length of the trabecula.\nDraw a rectangle that encloses the trabecula. Confirm that it encloses the entire volume through time by using the sliders on the hyperstack window. Crop the image to the window (Image > Crop).\nRemove slices that contain images of the mounting hooks (Stacks > Tools > Slice Keeper). Select the range of slices that contains trabecula information only.\nTrain WEKA segmentation.\n\t\nOpen WEKA segmentation (Plugins > Segmentation > Trainable Weka Segmentation).\nSet the selection mode to Freehand.\nClick Settings and adjust the classifier and training settings. (For this model, the following Training features were used: Gaussian blur, Sobel filter, Hessian, Difference of Gaussians, membrane projections, Bilateral, and Lipschitz. Membrane thickness was set to 1, Membrane patch size to 8, Minimum sigma to 1, and Maximum sigma to 32. The classifier was set to FastRandomForest and the classifier options were set to: batchSize 100, maxDepth to 32, numFeatures to 32, numThreads to 0, and numTrees to 200.)\nManually segment images until training results in satisfactory segmentations.\nSave the classifier.\nSegment the processed B-scans\n\t\nLaunch WEKA segmentation following Step 6.2.1.\nLoad the classifier from Step 6.2.5.\nClick Create Result.\nConvert the images to 8-bit (Image > Type > 8-bit).",
    "Convert the images to binary (Process > Binary > Make Binary > Default method and default background).\nSave as image sequence (PNG).\nCalculate the average CSA in the segmented B-scan images.\n\t\nCount the number of white pixels in a binary B-scan image.\nMultiply the pixel area by the calibrated depth resolution (from Step 1.2) and 10 µm (the distance between neighboring A-scans).\nRepeat for all of the B-scans between the hooks and average the measurements.\nConvert segmented image into a mesh.\n\t\nOpen \"OCTmain.m\" (available on request) and set imageDirectory to the folder containing the output from Step 6.3.6. Set outputPath as necessary.\nSet slices to the value of \"Range Y (steps)\" (Step 3.5.5) and frames to the value of \"Repeat X\" (Step 3.5.6), z_dim to the depth resolution (Step 1.2.10), and x_dim & y_dim to the value assigned to 10.\nClick Run."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}