{
  "id": 13291,
  "origin_website": "Jove",
  "title": "Adult Mouse Digit Amputation and Regeneration: A Simple Model to Investigate Mammalian Blastema Formation and Intramembranous Ossification",
  "procedures": [
    "All animal use and techniques were in compliance with the standard operating procedures of the Institutional Animal Care and Use Committee of Texas A&M University.\n1. Adult Mouse Hind Limb Distal P3 Amputation\nAnesthetize an 8 to 12 week-old CD-1 mouse (Table of Materials) using isoflurane gas in oxygen; initially anesthetize at 3% in a chamber, followed by 2% isoflurane supplied by a nosecone over the duration of the surgery. Apply ophthalmic ointment on eyes to prevent dryness while under anesthesia.\nNOTE: The adult P3 amputation studies standardized in our lab are performed on 8 to 12 week-old mice, and the regeneration response is conserved in all tested strains.\nUnder a 10x dissection microscope, sterilize the digits of the hind limb with surgical Povidone-iodine and 70% ethanol. Trim hair away from the surgical site using micro-scissors. Apply 1 µL of topical Bupivacaine locally to anesthetize the surgical site.\nAmputate the distal tip of the terminal phalanx (P3) on digits 2 and 4 of each hind limb using a sterile #10 scalpel (Figure 1A). Amputation must be performed under aseptic conditions, including sterilization of surgical instruments. Under the dissection microscope, gently splay the hind paw to expose the medial digit surface. Hold the scalpel at an angle parallel to the fatpad to perform the amputation shown in Figure 1B. Apply 1 µL of topical Bupivacaine to the amputation site.\nNOTE: Amputation transects the nail organ, dermis, the P3 bone, vasculature, and nerves, but does not transect the marrow cavity or the digit fat pad. If bleeding is observed, apply direct pressure using a sterile cotton tip applicator.\nThe standard P3 distal amputation plane removes approximately 15%–20% of the P3 bone volume21. MicroCT scanning (see below) can be performed to confirm the correct amputation length.",
    "Return the mouse to a clean cage and allow the wound to heal without wound dressing. Monitor the mouse for 3 days to ensure the mouse returns to normal activity.\n2. Digit Collection and Tissue Preparation\nEuthanize the mouse using carbon dioxide (CO2) in a closed chamber, followed by cervical dislocation.\nUse a scalpel to sever the digit mid-way through the adjacent bone segment, the middle phalanx (P2) bone, at approximately the second ventral fat pad indent. Transfer the digit(s) to a 20 mL scintillation vial containing 10 mL fresh buffered zinc formalin fixative, an 18% formaldehyde solution (see Table of Materials). Fixative volume should be at least 20x the volume of the tissue present.\nNOTE: Digits are collected at various timepoints after amputation to investigate the full regeneration response. Generally, for early blastema formation, bone histolysis, and wound closure the collection timepoints are 4–8 days post amputation (DPA). To investigate the early osteogenic blastema the collection timepoints are 9 and 10 DPA, and to visualize continued bone regeneration and mineralization, the collection timepoints are 14, 21, and 28 DPA. Unamputated digits are collected as well.\nFix the digit for 24–48 h at room temperature with gentle mixing on a shaker.\nRemove the fixative and wash the digit 2x for 5 min in 5 mL of 1x phosphate buffered saline (PBS) at room temperature.\nPlace 10 mL of fresh Decalcifier I (see Table of Materials), a 10% formic acid solution, in the scintillation vial and gently mix on a shaker for 2 h at room temperature. After 2 h, replace Decalcifier I with fresh solution and decalcify digit overnight at room temperature with gentle mixing on shaker.\nRemove the Decalcifier I and wash the digit 2x for 5 min in 5 mL of 1x PBS at room temperature.",
    "Process the digit through a graded ethanol series. This process can be performed manually in a 20 mL scintillation vial, using 10 mL of each liquid if less than 40 total digits.\nBegin with 2 immersions in fresh 70% ethanol at room temperature with gentle mixing on a shaker, 1 h each, followed by 2 immersions in fresh 95% ethanol at room temperature with gentle mixing on a shaker, 1 h each.\nComplete the digit dehydration with 2 washes of fresh 100% ethanol at room temperature with gentle mixing on a shaker, 1 h each. The final 100% ethanol wash can be left overnight.\nIn the same scintillation vial, replace the 100% ethanol with 10 mL of fresh xylenes, and place the vial in a chemical fume hood for 1.5 h at room temperature. Repeat with a fresh wash of xylenes in a chemical fume hood for 1.5 h at room temperature for a total of 2 washes.\nReplace the xylenes with liquid paraffin wax melted to 68 °C, and place the vial in an incubator at 68 °C for 2 h, 2 times. After 4 total h of immersion in paraffin wax, embed the digit for paraffin sectioning.\nNOTE: Digit processing for histology can be performed in an automated processor, following these same guidelines.\nSection digits at 4–5 µm thickness using a microtome. Place sectioned samples on adhesive slides, using a 38–41 °C water bath supplemented with a histological adhesive solution to ensure samples adhere to the slide. Place slides on a 37 °C slide warmer to dry.\n3. Immunohistochemical Staining of Adult Mouse Digits to Investigate Blastema Formation and Intramembranous Ossification",
    "Heat sectioned slides at 65 °C for 45 min, followed by heating at 37 °C for no less than 15 min to ensure samples adhere to the slide.\nDeparaffinize and rehydrate slides 2x with 5 min washes of xylenes, a graded ethanol series, and submersion in water. Place slides in a 50–100 mL capacity staining jar and keep immersed in 1x Tris Buffered Saline with Tween 20 (TBST).\nNOTE: Do not allow samples to dry throughout the staining process. At any TBST step, slides can be incubated up to 2 h.\nPrepare a humidifying chamber. A 1-inch deep covered plastic slide box with moistened tissue paper at the base is sufficient.\nPrepare the heat retrieval solution for Runx2, Osterix (OSX), and Proliferating Cell Nuclear Antigen (PCNA). For the antigen retrieval of the early osteoprogenitor marker, Runx2, prepare a 1x solution of Tris-EDTA, pH 8. For the osteoblast marker, OSX, prepare a 1x solution of citrate buffer, pH 6. PCNA immunostaining can be performed in either solution.\nPrepare Proteinase K antigen retrieval solution for the blastema marker CXCR422 and the endothelial cell marker von Willebrand Factor 8 (vWF) by placing 100 μL of Proteinase K solution per slide in a microcentrifuge tube and heating to 37 °C (approximately 5 min).\nNOTE: Antigen retrieval for Runx2, OSX, and PCNA is performed using heat retrieval, and CXCR4 and vWF antigen retrieval is performed via proteinase K treatment.\nFor antibody retrieval requiring heat, immerse slides in a staining jar in the appropriate antigen retrieval solution. Heat slides to 95 °C for 25 min, ensuring boiling does not occur. Remove staining jar from heat source and allow to cool at room temperature for 35 min.",
    "For Proteinase K antigen retrieval, lay slides flat in the humidifying chamber, and place 100 μL of pre-warmed Proteinase K on the slide. Cover the slides with a small strip of parafilm to ensure the slides do not become dry. Incubate slides for 12 min at 37 °C.\nWash slides 3 times for 5 min in 1x TBST in staining jar after antigen retrieval.\nRemove slides from the staining jar and place in humidifying chamber. Place 6–7 drops of blocking solution (Table of Materials) on the slide, and cover the slide with fresh paraffin film to ensure the slide does not become dry. Incubate slides for 1 h at room temperature.\nPrepare the primary antibodies by diluting the antibodies into antibody diluent (Table of Materials). Vortex each primary antibody solution for 3 s. Primary antibodies derived from different host species may be combined.\nNOTE: Immunohistochemical staining for Runx2 (rabbit anti-Runx2 antibody, 1:250 dilution, at a final concentration of 4 μg/mL) combined with PCNA (monoclonal mouse anti-PCNA antibody, 1:2,000 dilution, at a final concentration of 0.5 μg/mL), and OSX (rabbit anti-OSX antibody, 1:400 dilution, at a final concentration of 0.125 μg/mL) combined with PCNA is shown in Figure 2. The mouse anti-PCNA antibody used in this study is highly specific and requires no additional blocking steps beyond those outlined in this protocol. Immunohistochemical staining using CXCR4 (rat anti-CXCR4 antibody, 1:500 dilution at a final concentration of 2 μg/mL) and vWF (rabbit anti-human vWF VIII antibody, 1:800 dilution, at a final concentration of 41.25 μg/mL) is shown in Figure 2. Primary antibodies were optimized and tested by our lab under the conditions in this protocol and are listed in the Table of Materials.",
    "Carefully remove the paraffin film, and gently drain the slide onto tissue paper to remove excess blocking solution. Place 100–200 μL of primary antibody solution on the slide, replace parafilm cover, and return to the humidifying chamber. Incubate the slides in the closed humidifying chamber overnight at 4 °C.\nNOTE: Do not let the slides become dry while draining the blocking solution. This step is performed quickly.\nCarefully remove the parafilm, and gently drain the primary antibody solution from the slide. Place the slide in a staining jar containing fresh 1X TBST. Wash with fresh 1x TBST for 5 min 3 times.\nPrepare the secondary antibodies by combining with antibody diluent (Table of Materials). Vortex the secondary antibody solution for 3 s. Secondary antibodies conjugated to different fluorophores derived from different species may be combined.\nNOTE: Fluorescent secondary antibodies are light sensitive. Alexa Fluor 488-conjugated goat anti-rabbit IgG (H+L) for Runx2, OSX, and vWF, Alexa Fluor 568-conjugated goat anti-rat IgG (H+L) for CXCR4, and Alexa Fluor 647-conjugated goat anti-mouse IgG (H+L) for PCNA, diluted at 1:500 with a final concentration of 4 μg/mL, were used in Figure 2.\nPlace 200 μL of secondary antibody solution on the slide, cover slide with fresh paraffin film, and return to humidifying chamber. Incubate the slides in the closed humidifying chamber for 45 min at room temperature. Ensure the humidifying chamber is closed to avoid light.\nCarefully remove the paraffin film and gently drain the secondary antibody solution from the slide. Place the slide in a staining jar containing fresh 1x TBST. Wash with fresh 1x TBST for 5 min 3x. Avoid light.",
    "Prepare nuclear stain. Add 20 μL of DAPI (stock DAPI solution is 5 mg/mL in H2O) to 200 mL of 1x PBS and shake vigorously to ensure homogeneity. Immerse slides for 5 min in DAPI-PBS solution. Avoid light.\nWash slides in dH2O for 3 min. Decant the water and allow the slides to air-dry or gently aspirate the water from the slide, ensuring that the samples are not disturbed while vacuuming. Avoid light.\nCarefully coverslip dry slides using 100 μL of anti-fade mounting medium (Table of Materials); avoid the formation of air bubbles on the slide during the mounting step. Store the slides flat and allow the mounting medium to dry overnight at room temperature in a light-proof container. After the mounting medium is dry, store slides flat in a light-proof container in 4 °C until ready to view.\nNOTE: If unacceptable levels of air bubbles are present after mounting, the mounted slide can be gently placed in 1x PBS, the coverslip can be removed, and once the slide is rinsed again in water and re-dried, can be re-mounted.\n4. Microscopy and Image Analysis\nNOTE: Imaging and analysis using a fluorescence deconvolution microscope and associated software, equipped with 3 fluorescent filters (to visualize Alexa Fluor 488, 568, and 647 nm signals), plus DAPI (419 nm) is used in this experiment.\nImage the slide at 10x magnification to capture the entire blastema region.",
    "NOTE: Proliferating osteoblast primary antibody detection utilizes secondary antibodies (Alexa Fluor 488 and 647) with non-overlapping emission spectra to minimize incorrect identification of co-labeled cells. Background subtraction of autofluorescent signal can be performed using the 568 nm filter to ensure integrity of the 488 or 647 signals. Blastema primary antibody detection utilizes secondary antibodies (Alexa Fluor 488 or 568). Background subtraction of autofluorescent signal can be performed with the 568 filter if using the 488-conjugated antibody, and 488 filter is using the 568-conjugated antibody. Autofluorescent signal is typically associated with the nail plate and erythrocytes throughout the digit, and is observed in the 488, 568, and 647 filters.\n5. Sequential In Vivo Microcomputed Tomography (μCT)\nRegenerating digits of the same animal scanned at 1 day prior to amputation (unamputated), 1 DPA, and at various time points until complete regeneration at 28 DPA using the vivaCT 40 (Table of Materials) is performed in this experiment and shown in Figure 3A.\nOutfit the μCT with tubing to enable oxygen flow into and out of the μCT animal chamber, ensuring that the out-flowing oxygen is equipped with an activated charcoal filter to trap the isoflurane.\nNOTE: Ensure that the μCT animal chamber is tightly enclosed; in this way, an animal nose-cone is not required for supplying isoflurane to the mouse during the scan.\nPrepare the μCT scanning parameters. Digits are scanned at a voxel size of 10.5 μm, at 55 kVp, 145 uA with 1000 projections per 180° using continuous rotation, and with an integration time of 200 msec, resulting in a maximum of 213 slices per scan. Scans performed in this experiment are approximately 9 min long. A decreased electric current can be compensated with proportionally increased integration time but will result in longer scan times.",
    "Anesthetize the adult mouse using isoflurane; initially anesthetize at 3% in a chamber, followed by 1.5% isoflurane supplied to the µCT animal chamber over the duration of the scan. Gently place the mouse in the µCT animal chamber with the hindlimb digits arranged in close association, flat, ventral side-up with left paw on left side and right paw on right side on the scanning platform, followed by gently securing the digits in place using surgical tape. Apply ophthalmic ointment on eyes to prevent dryness while under anesthesia.\nReturn the mouse to a clean cage and monitor the mouse until awake. Continue scanning the same mouse at bi-weekly to weekly time points to visualize the entire bone regeneration response.\nAfter scanning, allow up to several hours for μCT image reconstruction to occur. Using the software provided with the μCT, convert the files to a series of dicom files; each dicom file will correspond to one slice of the scan, therefore, if 213 slices have been scanned, 213 dicom files will be generated and uploaded to the company’s server.\nDownload the dicom series in a single folder using a batch file downloader in a web browser.\nDownload the BoneJ plugin23 and drag the file into the ImageJ plugin folder. In ImageJ, open the dicom file series as a stack by dragging and dropping the folder to the ImageJ bar. A 16-bit image stack displaying all the gray values will be opened. To display bone only, perform image thresholding (Image > Adjust > Threshold).",
    "NOTE: When viewing ImageJ files, the ImageJ output will correspond to an inverted image of the digits; i.e., digits arranged in the scanning platform ventral side-up, with left paw on left side of platform and right paw on right side of platform, will appear as dorsal side-up, right paw on left side and left paw on right side of the ImageJ image stack.\nOnce the threshold dialog box is opened, slide the bottom bar, corresponding to the upper threshold, to the far right, and adjust the top bar, corresponding to the lower threshold, until only the bone is highlighted red. The lower threshold value will be approximately 10,000–13,000 at a maximum signal intensity of 32,767. Click apply, and in the new dialog box click black background. Click OK.\nAn 8-bit image displaying black and white values will be generated, with white corresponding to bone. Select the P3 bone by drawing a rectangle around it, and duplicate the stack. Generate a 3D image (Plugins > 3D Viewer). To crop any unnecessary bone from the image, click the freehand selection tool, and circle the bone to be deleted. Right click, and select Fill Selection to delete bone.\nNOTE: The steps described above apply to ImageJ 1.52h, Java 8 and may differ slightly when using a different version of ImageJ. For thresholding, we recommend the determination of an optimal value and using that value consistently.\nQuantify bone volume from the 3D rendering by using the BoneJ Volume Fraction Plugin (Plugins > BoneJ > Volume Fraction). A result window will appear, and bone volume (BV) will be displayed in mm3.\nQuantify bone length from the 3D rendering by using the ImageJ multipoint tool.",
    "NOTE: Bone length is dynamic over the course of P3 regeneration; the length decreases between 7-10 DPA associated with osteoclast-mediated bone degradation11, and is followed by a period of distal bone regrowth between 14-28 DPA (Figure 3B). Length is measured from the central base of the P2/P3 joint to the farthest point of mineralization at the distal bone apex, but does not include degraded bone that has been completely detached (Figure 3B). BoneJ allows for the complete 3D assessment of the bone architecture; thus, the angle in which the bone is scanned will not alter the ability to measure length.\nCapture an image of the 3D rendering by clicking View, and take snapshot. Save image as a tif or jpeg file.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}