{
  "id": 12101,
  "origin_website": "Jove",
  "title": "Patient-derived Heterogeneous Xenograft Model of Pancreatic Cancer Using Zebrafish Larvae as Hosts for Comparative Drug Assessment",
  "procedures": [
    "All animal procedures were approved and followed the guidelines of the Animal Ethics Committee at Fudan University and all pancreatic cancer specimens were obtained from Fudan University Shanghai Cancer Center. Ethical approval was obtained from the FUSCC Ethics Committee, and written informed consent was obtained from each patient.\n1. Preparing the Equipment for the Microinjection\nPreparing the injection plate.\nPrepare a 50 mL solution of 1% agarose dissolved in E3 solution (0.6 g/L aquarium salt in double distilled water + 0.01 mg/L methylene blue). Boil the solution until the agarose dissolves.\nPour 50 mL of the agarose solution into a 10 cm Petri dish and then place the zebrafish embryo fixation mold on the surface. Remove the mold when the agarose solution becomes solidified.\nAdd 20 mL of E3 solution to the injection plate and maintain it at 4 °C for long-term storage.\nPreparing the injection needles.\nPull a 10 cm glass capillary with an inner dimension of 0.9 mm into two needles on a needle puller.\nUse forceps to cut the end of the needle to create an opening under the microscope.\n2. Preparing Embryos for Transplantation\nPlace 1 to 2 pairs of adult zebrafish in a mating tank at 7-9 pm and collect the fertilized eggs at around 8 am of the next morning.\nTransfer the fertilized eggs from the mating tank to a Petri dish containing 40 mL of fresh E3 solution and incubate at 28.5 °C.\nAfter 8 h of incubation in E3 solution, add 0.03% 1-phenyl-2-thiourea (PTU) into E3 solution to inhibit pigmentation. Incubate the embryos in E3 solution with 0.03% PTU at 28.5 °C until 48 hpf. This step can be omitted if using in-bred Casper mutant zebrafish.",
    "3. Isolation and Culture of Primary Human Cells from Fresh Surgical Pancreatic Cancer Specimen or Frozen Tissue\nObtain specimens of human pancreatic cancer tissue of the size around 1 cm3 during an abdominal surgery, and immediately transfer the tissue into growth media (DMEM with 10% fetal bovine serum (FBS), 10 μM Y-27632, 100 μg/mL primocin, 10 μg/mL putrescine dihydrochloride, 10 mM nicotinamide and 1% penicillin streptomycin).\nTransfer the pancreatic cancer sample into a Petri dish and remove the surrounding necrotic tissue, adipose tissue and connective tissue.\nRinse the cancer tissue for 5-6 times with phosphate buffer (PBS) and cut the tissue into 1 mm3 pieces using scalpels.\nTransfer the shredded tissues into 5 mL of HBSS in a 50 mL tube and add collagenase type IV, hyaluronidase and DNase I at final concentrations of 200 units/mL, 100 mg/L and 20 mg/L, respectively. Pipette the mixture up and down to mix well.\nIncubate the mixture at 37 °C in a 5% carbon dioxide incubator for 15-20 min. Pipette the mixture up and down a few times every 5 min.\nAdd 7 mL of DMEM to the tube and centrifuge at 110 x g for 5 min at 4 °C when digestion is complete.\nDecant the supernatant and re-suspend the tumor mixture in DMEM.\nPlate the mixture into a 6 cm Petri dish in 3 mL of full growth media (DMEM with 10% FBS, 20 μg/mL insulin, 100 ng/mL bFGF, 10 ng/mL EGF, 10 μM Y-27632, 100 μg/mL primocin, 10 μg/mL putrescine dihydrochloride, 10 mM nicotinamide, 1% penicillin streptomycin). Separate the cells into two groups.",
    "In group I, add 100x inhibitor of pancreatic cancer fibroblasts into the medium after 48 h to remove the overgrown fibroblasts, leaving the cancer cells as the major cell types;. In group II, the fibroblasts will outgrow the cancer cells within a week.\nCulture both cell groups for 1-2 week depending on the cell densities/purities and change the media every three days. The expected cell types in both group I & II can occupy over 98% in proportion in a typic successful experiment.\n4. Labeling the Cells with Lentivirus Expressing Anti-apoptosis Gene BCL2L1 (BCL-XL) and Different Fluorescent Proteins Separately\nLentivirus production\nPlate 3 x 106 HEK 293T cells with complete DMEM medium (DMEM supplied with 10% FBS) in 10 cm dishes and culture overnight at 37 °C in a 5% carbon dioxide incubator. Replace the medium with 6 mL of serum-free media before transfection.\nPrepare solution A: 8 μg of BCL2L1-containing lentiviral vectors (pCDH-EF1α-mKate2-E2A-BCL2L1-WPRE or pCDH-EF1α-eGFP-E2A-BCL2L1-WPRE), 2.4 μg of pVSVG, 4 μg pMDL(Gag/Pol), 1.6 μg of pREV and serum-free DMEM in a total volume of 500 µL. Gently pipet the mixture several times, and place it at room temperature for 5 min.\nPrepare solution B: 40 µL of PEI (polyethyleneimine) in 460 µL serum-free DMEM. Place it at room temperature for 5 min.\nSlowly add solution B into solution A and leave the tube at room temperature for 30 min.\nAdd the final mixture into the HEK 293T cell culture dish prepared in step 4.1.1 and incubate at 37 °C in a 5% carbon dioxide incubator. After 12 h, add an additional 5 mL of the complete DMEM medium. After 48 h, harvest the medium containing the lentivirus.",
    "Filter the supernatant using a 0.45 μm sterile filter, add the supernatant into a concentration column, centrifuge at 6,000 x g for 25-30 min at 4 °C. The lentivirus aliquots of 100 µL per tube are made and stored at -80 °C.\nInfection of the primary cells\nSeed the cells (group I & II) to be infected in a 12-well plate with 30-40% density and culture the cells overnight at 37 °C in a 5% carbon dioxide incubator.\nReplace the medium with 500 µL of serum-free medium containing 8 μg/mL of polybrene for 4 h. Then, add an additional 100 µL of the lentivirus into the medium (eGFP-E2A-BCL2L1 for Group I or mKate2-E2A-BCL2L1 for Group II). After 12 h, replace the medium with 1 mL of complete medium.\nCheck the fluorescence markers after 48 h.\nHarvest the infected cells and mix them at 1:1 ratio with a final concentration of 106/mL.\nCentrifuge the cells at 110 x g for 5 min and re-suspend the cell mixture in 50 µL of injection solution (1640 medium with 10% FBS, 0.05% hyaluronic acid sodium salt, 0.05% methylcellulose).\n5. Injecting Mixed Cell Suspension into the Zebrafish\nAdd 10x tricaine solution into E3 water to anesthetize zebrafish larvae and transfer the larvae (from step 2.3) to the injection plate filled by modified E3 (E3 with 1 g/L glucose and 5 mmol/L L-glutamine).\nFill 25 µL of mixed cell suspension into micro capillaries needle and insert the needle into the micro-injection manipulator.\nSet injection pressure and time. Inject 50-80 cells (~8 nL) into the yolk sac of 48 hpf zebrafish.\n6. Culture of the Xenografted Zebrafish (zPDX Model)\nTransfer the post-xenografted zebrafish larvae into 40 mL of mix solution (E3 solution with 1 g/L glucose and 5 mmol/L L-glutamine) at 32 °C.",
    "7. Drug Administration on the Xenografted Zebrafish and the Assessment of Tumor Cells/Fibroblasts Viabilities\nDetermining the optimal concentration of gemcitabine/navitoclax.\nPlace 10 wildtype zebrafish embryos at 48 hpf into each well of a 12-well plate.\nAdd different concentrations of gemcitabine or navitoclax in each well and incubate at 32 °C for two days.\nAfter 2 days, calculate the maximal tolerance dosage (MTD) of gemcitabine and navitoclax at which the zebrafish larvae do not shown significant malformation and abnormal behavior, and the working concentrations are set below the MTD.\nTreatment of zPDX models with gemcitabine/navitoclax.\nPlace 10 xenografted larvae into each well of a 12 well plate.\nDivide the larvae into four groups, treat the control group in E3 containing 0.1% DMSO, and treat the other groups with 5 μg/mL gemcitabine and/or 50 μM navitoclax, and incubate at 32 °C for two days.\nAssessment of the cell viabilities and cellular composition in zPDX models.\nAnesthetize the xenografted larvae post-treatment and place them in 3% methylcellulose.\nImage the larvae from the lateral view using a fluorescence microscope or confocal microscope.\nQuantify the intensity of red and green fluorescence signals using ImageJ and GraphPad software.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}