{
  "id": 17048,
  "origin_website": "Jove",
  "title": "Immunofluorescent Labeling in Nasal Mucosa Tissue Sections of Allergic Rhinitis Rats via Multicolor Immunoassay",
  "procedures": [
    "The experimental protocol and procedures have received approval from the Administrative and Animal Research Committee of Chengdu University of Traditional Chinese Medicine (Record number: 2022DL-010). Eight-week-old male Sprague Dawley (SD) rats, weighing 180-200 g, were commercially obtained (see Table of Materials) and housed under a natural light/dark cycle with controlled temperature (23 ± 2 °C) and relative humidity (55% ± 10%). Twelve rats were randomly divided into two groups: the control group and the AR group. All rats were acclimated to these conditions and provided with free access to food and water for one week before the trial.\n1. Establishment of a rat model of AR\nPreparing the sensitizing solution: suspend 30 mg of ovalbumin (OVA) and 3 g of Al(OH)3 in 100 mL of saline (see Table of Materials)14,15.\nBasic sensitization: grasp and hold the fully awake rat with its abdomen facing up. Disinfect the abdomen using 75% alcohol-soaked cotton balls. Use a 1.5 mL syringe to inject 1 mL of the sensitizing solution prepared in step 1.1 into the left abdominal cavity of the rats in the AR group. Repeat this injection once every two days for 14 days (Figure 1A).\n\tNOTE: Ensure that the rat's head is positioned lower than its tail to prevent damage to the large and small intestines when inserting the syringe. The injection site is located 1.5 cm from the ventral midline. Rats in the control group should receive intraperitoneal injections of 1 mL of normal saline once every two days for 14 days.\nNasal challenge: Administer 50 µL of 5% OVA via nasal drops using a 100 µL pipette (Figure 1B) on the day following the basal sensitization, repeating this procedure for 7 days (Figure 1C).",
    "​NOTE: Prepare the 5% OVA solution by mixing 5 g of OVA with 100 mL of saline. For the control group, administer drops of the same volume of saline.\n2. Behavioral scoring of rats\nWithin 30 min after completing the final nasal challenge, observe and record the rats using a digital camera to identify symptoms such as nose scratching, sneezing, and a runny nose, based on the scoring criteria outlined in Table 1 (Figure 1D).\n\t​NOTE: The confirmation of successful AR modeling is based on achieving a total score of ≥5 points14.\n3. Acquisition of nasal mucosa samples\nSacrificing rats: sacrifice the rats by exposing them to an overdose of CO2. Afterward, disinfect the rats with 75% ethanol (see Table of Materials). Use a scalpel to make an incision along the two corners of the mouth to expose the muscle tissue (Figure 2A). Next, cut the joints of the zygomatic bone and the mandible on both sides of the skull using tissue scissors (Figure 2B), and remove the mandible (Figure 2C).\nNasal cavity exposure: separate the skin of the maxilla using a hemostat (Figure 2D) to expose the nasal cavity (Figure 2E). Cut the bony connection between the nasal cavity and the maxilla with tissue scissors (Figure 2F). Then, sever the connection between the nasal cavity and the orbital bones on both sides at the infraorbital foramen (Figure 2G) and remove the nasal cavity (Figure 2H).\nFixation: place the extracted nasal cavity in 4% paraformaldehyde for fixation and store it at room temperature for 24-72 h (see Table of Materials).\n\tNOTE: Ensure that the amount of paraformaldehyde fixative used is sufficient to completely cover the sections for proper fixation.\n4. Pre-processing of nasal mucosa samples",
    "Decalcification: begin by fixing the removed tissues from step 3.1. Wash them three times with PBS for 20 min each. Follow this by washing them three times with distilled water, each time for 20 min. Subsequently, decalcify the tissues in a decalcification solution with a volume of 20-30 times that of the tissues at room temperature.\n\t\nThe decalcification solution (see Table of Materials) should maintain a pH of 7.2-7.4. Finally, place the decalcified tissue into a dehydration box.\n\t\tNOTE: The decalcifying solution needs to be changed weekly. The decalcification process can be concluded when the tissue softens (approximately 2 months).\nDehydration and waxing: transfer the dehydration box to a dehydrator (see Table of Materials). Begin with 75% alcohol for 4 h, followed by 85% alcohol for 2 h, 90% alcohol for 2 h, and 95% alcohol for 1 h.\n\t\nSubsequently, immerse the tissue in anhydrous ethanol for 30 min, repeat the process for another 30 min, use xylene for 5-10 min, repeat this step for another 5-10 min, immerse the tissue in wax for 1 h, repeat this step for another hour, and finally, immerse the tissue in wax for an additional 1 h.\nEmbedding: place the melted wax block into the embedding box (see Table of Materials) and store it in a -20 °C freezer. Once the wax solidifies, remove it and trim the wax block.\nSlicing: insert the trimmed wax block into a paraffin microtome (see Table of Materials) and cut it into slices with a thickness of 3 µm. Place the slices in a 40 °C water bath on a slide spreader. Flatten the tissue, then lift it with a glass slide and bake it in a 60 °C oven.",
    "After the water has evaporated, and the wax is properly set, remove the slides and store them at a temperature of 25 °C.\n5. H&E staining of nasal mucosal tissue\nDewaxing and hydration: place the slices in xylene for 20 min, repeat the process for another 20 min, absolute ethanol for 5 min, repeat this step for another 5 min, 75% alcohol for 5 min, and finally, wash for 5 min.\nHematoxylin staining: dispense 100 µL of hematoxylin staining solution (see Table of Materials) for 3-5 min using a 100 µL pipette, rinse for 5-10 s, add 100 µL of 0.5% hydrochloric acid ethanol for 10-30 s, rinse for 5-10 s, add 100 µL of 0.2% ammonia water for 10-30 s, and rinse for 30 s.\n\tNOTE: After hematoxylin staining, differentiation with 0.5% hydrochloric acid ethanol is necessary to remove excessive hematoxylin dye bound to the nucleus and absorbed by the cytoplasm. When eosin staining is performed, the nuclei and cytoplasm will be clearly stained. The slices will appear red or pink after differentiation with 0.5% hydrochloric acid ethanol, so rinse immediately after differentiation to remove the acid from the tissue slices to halt the differentiation. Then, use 0.2% ammonia water to enhance nuclear staining.\nEosin staining: use a 100 µL pipette to dispense 100 µL of eosin staining solution (see Table of Materials) for 5 min and rinse for 30 s.\nDehydration and sealing: immerse the slices in absolute ethanol for 5 min, repeat the process for another 5 min, repeat once more for 5 min, dimethyl for 5 min, and xylene for 5 min. Finally, seal with neutral resin (see Table of Materials).",
    "Placing the stained section on the microscope: position the stained section on the microscope, adjust the microscope's focus until the image is clearly visible, set the magnification to 40x, and capture the image.\n6. Multicolor immunostaining of nasal mucosal tissue\nDewaxing and hydration: follow the same as mentioned in step 5.1.\nCitrate-phosphate buffer treatment: place the citrate-phosphate buffer (pH 6.0) (see Table of Materials) into a microwave-safe container. Heat it until boiling, remove it, and then add the slides to the container. Microwave on medium heat for 8 min until boiling, turn off the heat for 8 min, and then switch to medium-low heat for 7 min.\n\t\nAfter natural cooling, transfer the slices to PBS (pH 7.4), shake, and wash them three times using a decolorizing shaker, each time for 5 min.\n\t\tNOTE: Ensure that the buffer does not evaporate during this process, and prevent the slices from drying out.\nBlocking endogenous peroxidase: dry the slices, draw a circle around the tissue with an immunohistochemical pen (to prevent the antibody from flowing away), and apply 3% hydrogen peroxide solution (hydrogen peroxide: pure water = 1:9).\n\t\nIncubate at room temperature in the dark for 15 min. After natural cooling, place the slices in PBS (pH 7.4) and shake them on a decolorizing shaker for three cycles of 5 min each.\nBlocking: apply 5% goat serum within the circle and incubate for 30 min.\nPrimary antibody addition: gently remove the blocking solution, add FOXP3 (dilution: 1:200, see Table of Materials) to the slice, and place it in a humid chamber. Incubate at 4 °C overnight.\n\tNOTE: Add a small amount of water to the humid chamber to prevent antibody evaporation.",
    "Secondary antibody addition: place the slices in PBS (pH 7.4) and shake them on a decolorizing shaker for three cycles of 5 min each. Gently dry the slices and apply the secondary antibody (Goat Anti-Rabbit IgG H&L, see Table of Materials) within the circle. Incubate at room temperature for 50 min in the dark.\nPreparation of Tyramide dilution solution: combine 100 µL of 3% H2O2 with 100 mL of 1x TBST (see Table of Materials).\nAddition of TSA working solution: Mix 1 mL of Tyramide diluent with 2 µL of CY3-Tyramide to prepare TSA working solution. Apply 100 µL of TSA working solution to each slice and incubate at room temperature in the dark for 10 min. Then, wash the slices with PBS three times, 5 min each time.\n\tNOTE: Prepare and use the TSA working solution immediately, and store it at 4 °C in the dark; it is valid for up to 24 h.\nRepeat Steps 6.2-6.8: switch to a 1:200 dilution of RORγt (FITC fluorescent dye) and then to a 1:200 dilution of TICAM1 (TYP620 dye) (see Table of Materials).\nDAPI counterstained nuclei: shake the slices gently to dry them, apply DAPI staining solution, and incubate at room temperature for 10 min in the dark.\nQuenching autofluorescence: place the slices in PBS (pH 7.4) and shake them on a decolorizing shaker for three cycles of 5 min each. Apply the autofluorescence quencher (see Table of Materials) to the slices, wait for 5 min, and then wash for 10 min.\nBlocking: place the slices in PBS (pH 7.4) and shake them on a decolorizing shaker for three cycles of 5 min each. Gently shake the slices to dry them and seal them with the anti-fluorescence quencher (see Table of Materials).",
    "Microscopy: place the stained section on the microscope, adjust the microscope's focus for clear visibility, set the magnification to 20x and 40x, and capture the image.\n\tNOTE: DAPI has a UV excitation wavelength of 330-380 nm and an emission wavelength of 420 nm (blue light). FITC has an excitation wavelength of 465-495 nm and an emission wavelength of 515-555 nm (green light). CY3 has an excitation wavelength of 510-560 nm and an emission wavelength of 590 nm (red light). TYP-690 has an excitation wavelength of 630 nm and an emission wavelength of 690 nm (pink light).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}