{
  "id": 8764,
  "origin_website": "Jove",
  "title": "A Protocol for Measuring Cue Reactivity in a Rat Model of Cocaine Use Disorder",
  "procedures": [
    "All animal manipulations are carried out in accordance with the Guide for the Care and Use of Laboratory Animals (2011) and with approval from the Institutional Animal Care and Use Committee.\n1. Animals\nAcclimate male Sprague Dawley rats approximately 8-9 weeks of age (250-260 g) for a minimum of seven days in a colony room maintained at 21-23 °C and 45-50% humidity on a 12 h light-dark cycle (lights on 6:00-18:00 h).\nHouse rats two/cage and handle daily throughout the study. Provide food and water ad libitum in the home cage throughout all phases of the study.\n\tNOTE: Food restriction increases the saliency of the cocaine reward48, potentiates cocaine-induced locomotor activity49, and acts as a stressor for reinstatement50 and thus may also impact cue reactivity.\nRandomly assign rats to saline or cocaine treatment groups.\n2. Surgery\nPlace rat under anesthesia using a cocktail containing 8.6 mg/kg of xylazine, 1.5 mg/kg of acepromazine, and 43 mg/kg of ketamine suspended in bacteriostatic saline. Confirm that the rat is sufficiently anesthetized by pinching its toe and monitoring motor reflexes and respiration. Apply ophthalmic ointment directly to eyes to prevent eye dryness.\n\tNOTE: If the rat is not sufficiently anesthetized it will exhibit a motor response to the toe pinch, and the rat's breathing rate may rapidly increase.\n\t\nUsing aseptic technique while the rat is under anesthesia, implant an intravenous catheter into the jugular vein connected to a back mount with a cannula. After surgical implantation, allow rats to recover for 5-7 days 28,36,37,51.\n\t\tNOTE: The intravenous route of cocaine self-administration in humans results in rapid increases in brain cocaine levels52,53. Thus, in one of its most common preclinical variants, rats are trained to self-administer cocaine via an intra-jugular catheter.",
    "Maintain catheter patency with daily flushes using a solution of 0.1 mL of bacteriostatic saline containing heparin sodium (10 U/mL), streptokinase (0.67 mg/mL), and ticarcillin disodium (66.67 mg/mL). Begin catheter flushing the day after surgery and continue each day following self-administration sessions.\n\t\nFill a syringe with the solution and connect the back mount to the syringe via polyethylene tubing to flush.\nVerify proper catheter function periodically throughout the experiment by intravenous administration of 10 mg/kg of methohexital sodium.\n\t\tNOTE: This is a dose sufficient to briefly anesthetize the animal only when administered intravenously.\n3. Self-Administration\nUse software programming to generate 4 separate programs as described below.\n\t\nCode two programs for self-administration on a fixed ratio (FR) 1 schedule, i.e., where one active lever press results in one infusion. For program #1, code the left lever as the active lever; for program #2, code the right lever as the active lever. Construct both programs to be 180-min in length, and deliver the cocaine stimulus and discrete cue complex in the following manner:\n\t\t\nHave one active lever press cause simultaneous illumination of both the house light and the stimulus light above the active lever.\nAfter a 1-s delay, have the infusion pump deliver 0.1 mL of solution over 6-s.\nHave the stimulus light shut off after 7-s (inactivating at the same time as the infusion pump).\nHave the house light shut off after 27-s, with the last 20-s indicating a time-out period during which active lever presses have no scheduled consequences, yet these are still recorded.\nFor data output, collect infusions, active lever presses, inactive lever presses, and latency to first active lever press.",
    "Code two more programs for self-administration on a FR5 schedule, i.e., where five lever presses result in one infusion. Again, make one program with the active lever as left, and one program with the active lever as right. Make both programs 180-min in length, and deliver the reinforcer and discrete cue complex in the following manner:\n\t\t\nHave five active lever presses cause simultaneous illumination of both the house light and the stimulus light above the active lever.\nRepeat Steps 3.1.1.2 through 3.1.1.5.\nSelf-Administration Training\nPrepare the cocaine solution daily in sterile 0.9% NaCl to a dose of 0.75 mg/kg/0.1 mL.\n\t\tNOTE: Over the duration of each 180 min self-administration session, rats administer approximately 4-5 mL of cocaine solution, thus to prepare in excess, anticipate approximately 8 mL/rat daily.\nFill the catheter syringe (10 mL) with at least 8 mL of cocaine or saline solution. After ensuring that the cocaine/saline solution is flowing, insert the syringes into the infusion pump and connect to the polyethylene tubing encased by a metal spring leash at the start of each self-administration session. Carefully adjust the syringe in each infusion pump such that the solution is evenly and completed distributed in the polyethylene tubing prior to attaching to each catheter.\nPlace rats into respective standard operant conditioning chambers housed in ventilated, sound-attenuating cubicles with fans. Consistently place each rat in the same operant chamber, and keep the active lever on the same side throughout all experiments. Counterbalance assignment of rats between left and right active levers.",
    "NOTE: Each chamber is equipped with a pellet receptacle flanked by two retractable response levers, a stimulus light above each response lever, and a house light opposite the levers. Cocaine/saline syringes are connected to a 23g needle (filed to avoid poking tubing) attached to polyethylene tubing encased inside a metal spring leash which connects to each rat's catheter and is operated on a liquid swivel. Syringes are placed into infusion pumps located adjacent to the cubicle.\nTrain rats to lever press for cocaine infusions (0.75 mg/kg/0.1 mL infusion) or saline infusions (0.1 mL) during daily 180-min sessions using established methods28,36,37,51.\n\t\tNOTE: This training is performed simply by placing the rat into the operant chamber and allowing it to lever press; pressing the active lever will result in receipt of the discrete cue complex and cocaine infusion, while pressing the inactive lever bears no scheduled consequences.\n\t\t\nSchedule completions on the active lever result in delivery of a cocaine or saline infusion over a 6-s period paired simultaneously with illumination of the house light and stimulus light above the active lever and activation of the infusion pump (this is the discrete cue complex paired with cocaine delivery); inactive lever presses produce no scheduled consequences. Following reinforcer (cocaine) delivery, the stimulus light as well as the infusion pump are inactivated; the house light remains on for an additional 20-s to indicate a timeout period during which lever presses have no scheduled consequences.\n\t\t\tNOTE: A description of how to set this up is found in Steps 3.1.1.1-3.1.1.4\nUpon completion of the 180-min session, remove each rat from its operant conditioning chamber and flush its catheter (Step 2.2). Carefully clean the chambers between sessions, wiping each surface with a 70% ethanol solution.",
    "NOTE: Rats that receive cocaine during the self-administration session may be difficult to remove from the chamber and are more likely to be aggressive. Use slow, careful motions to disconnect each rat from its tether.\nTrain rats on a FR1 schedule of reinforcement and progress to a FR5 schedule after achieving a criterion of seven infusions/h with less than 10% variability in the total number of infusions per session for three consecutive days. Continue self-administration sessions until rats have reached a total of 14 days of self-administration training.\n\t\tNOTE: This is one variant of operant learning; some protocols prefer to have rats remain at FR1 throughout the entirety of the experiment. Changes in fixed ratio schedule from FR1 to FR5 do not impact the number of infusions an animal self-administers54,55. However, increasing the fixed ratio size helps to ensure stability of responding in the rat, and may increase the saliency of the reward56. Additionally, if a treatment during forced abstinence is desired, rats should be pseudo-randomly assigned to treatment groups upon achieving stability (less than 10% variability in the total number of infusions per session for a minimum of 3 consecutive days) at the FR5 schedule. Additionally, saline rats will not progress from FR1 to FR5, as the saliency of saline is not sufficient to achieve the stability required to progress from FR1 to FR5.\n4. Forced Abstinence\nPlace rats into forced abstinence for 30 days; that is, do not provide rats with the opportunity to self-administer cocaine or saline for a duration of 30 days. Importantly, during this period do not return rats to the operant chambers (the previous context of self-administration). However, remove rats from home cages for daily handling and weighing, as a measure of general health.",
    "NOTE: The duration of forced abstinence can be altered, but it is important to choose a duration that is sufficient to avoid ceiling and floor effects. Factors to be cognizant of when choosing the duration of the forced abstinence period include rodent strain, age, self-administration session length and duration, drug, drug dose and infusion duration, and the sex of the animal.\n5. Cocaine Cue Reactivity\nCode two software programs for the cue reactivity task at a FR1 schedule; one program with the left lever as the active lever, and one with the right lever as the active lever. Construct each program to collect lever pressing data for 60-min and deliver the discrete cue complex as described below.\n\t\nRepeat Steps 3.1.1.1-3.1.1.4\nFor data output, collect cue presentations (previously known as infusions), previously-active lever presses, inactive lever presses, and latency to first lever press.\nCocaine Cue Reactivity Test Session\nAssess cue reactivity on day 30 of forced abstinence in a 60-min operant test session. Stagger start times of rats to facilitate rapid decapitation and brain harvest. Importantly, for the cue reactivity test, do not place the syringe in the infusion pump so that the sound of the infusion pump serves as an auditory cue but no cocaine reinforcement is delivered.\n\t\tNOTE: Cue reactivity can be assessed on days other than day 30 of forced abstinence, however the fact that responsiveness to cocaine-paired cues varies over time34 should be kept in mind when choosing the date for the cue reactivity test.",
    "Place each rat in the self-administration chamber in which it was trained and tether to its cannula as during the daily self-administration sessions. Presses on the lever that previously delivered cocaine or saline are now only reinforced by delivery of the discrete cue complex (i.e., the stimulus light and house are illuminated, and the infusion pump is activated) on a FR1 schedule (i.e., one discrete cue complex is presented per active lever press); count the cue presentations and previously-active lever presses during one 60-min session, and also record the number of inactive lever presses. However, as with self-administration, inactive lever presses produce no scheduled consequences.\n\t\tNOTE: An additional control option is to record previously-active and inactive lever presses in the absence of scheduled consequences (i.e., no discrete cue complex reinforcer).\nUpon completion of the cue reactivity test session, immediately euthanize rats to capture the biochemical effects of re-exposure to the operant conditioning chamber and discrete cue complex.\n6. Data Collection, Organization, and Analysis\nBreak down data into three conventional categories: general health, self-administration, and cue reactivity.\n\t\nMonitor general health (e.g., animal weight, fur condition) throughout the experiment, and provide animals with veterinary care, if necessary, or remove from the study if lever pressing appears affected by health.\nCollect self-administration data during the 14 days of self-administration. Use an unpaired, two-tailed t-test to determine statistical differences between cocaine and saline self-administration groups for total number of infusions, active lever presses, inactive lever presses, and latency to first active lever press.",
    "NOTE: Self-administration data needs to be analyzed prior to forced abstinence if one desires to study the effect of a treatment during forced abstinence on cue reactivity (so that groups can have an equal average number of infusions, as well as active and inactive lever presses). If a two-by-two design is chosen (cocaine ± treatment, saline ± treatment), a two-way ANOVA with appropriate post hoc analysis should be used to analyze this data.\nFor cue reactivity data to collect and analyze for the total number of cue presentations, previously-active lever presses, inactive lever presses, and latency to first lever press. Also analyze this data with an unpaired, two-tailed t-test to determine differences between animals self-administering cocaine and those self-administering saline.\n\t\tNOTE: Again, if a two-by-two design is chosen (cocaine ± treatment, saline ± treatment), a two-way ANOVA with appropriate post hoc analysis should be used to analyze this data.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}