{
  "id": 19048,
  "origin_website": "Jove",
  "title": "Orthotopic Aortic Transplantation in Mice for the Study of Vascular Disease",
  "procedures": [
    "1. Presurgical Preparation\nSurgical procedures, no matter how carefully done, result in significant stress. To minimize the effects of such stress and to maximize reserves, animals should be maintained in the vivarium for at least 72 hr before use10,11.\nSurgical tools, gauze, and swabs must be sterile. It is not necessary to use sterile gloves providing only the tips of the instruments touch suture or the operative field.\nFor hemostasis, it is imperative that clamping pressures are the minimum necessary. Damage to the vessel due to excessive pressure or rough handling will cause thrombosis, resulting in hind-leg paralysis, bowel ischemia, and death within 24 hr. We have found that using clamps with a pressure of no more than 2 gm/cm2 eliminates the problem. These clamps are noted in Table 1. Clamp pressures are indicated in the specifications for clamps made by high quality surgical instrument manufacturers. We have found that inexpensive clamps or disposable clamps universally exert too much pressure.\nThe location of the collateral vessels as well as the relative locations of the abdominal aorta and the inferior vena cava (IVC) are strain dependent. You will also find small variations between individual mice, especially in the location of collateral vessels.\n2. Donor Operation",
    "Mice can be anesthetized with isoflurane (1.5-2.5 % induction, 1.0 % maintenance in air) or with pentobarbital (55-65 mg/kg). Pentobarbital imposes a time limit (up to 1.5 hr), but provides the surgeon with the option of rotating the animal for better access, if desired. Anesthesia time can be extended to up to 2 hr by placing 2-3 drops of the anesthetic when needed onto the intestine or liver during the surgery. Ketamine/xylazine (100 mg/kg body weight for Ketamine and 7 mg/kg for Xylazine, ip) can also be used by well-trained surgeons who can finish the procedure within 1 to 1.5 hr, but it has a narrower safe dose range. In the US, the use of pentobarbital has become more problematic in recent years because of short supplies. It is imperative that the depth of anesthesia be monitored to be certain that it is sufficient. The toe-pinch reflex is the best indicator of adequate depth but one should also note respiration rate and other movements as well.\nAfter anesthesia induction, use a depilatory gel or a shaver to remove hair on the ventral abdomen.\nMount the animal on the operating board using laboratory tape to hold it in a spread-eagled position. A metallic operating board permits the use of a heating pad underneath it to provide temperature support during the surgery. We manually control the temperature of the heating pad, which is a consumer-grade unit for home-use. The temperature is maintained between 35-38°. The metallic operating board is also easy to sterilize between procedures.\nDisinfect the area using a disinfectant like chlorhexidine, followed by an ethanol wash. Repeat this procedure three times, to insure adequate disinfection. This will also remove any residual cut pieces of hair, if present.",
    "Using scissors make an incision through the body wall to expose the abdominal viscera.\nUse a cotton swab, push the viscera off to the side to expose the great vessels of the abdomen. The viscera are placed on a piece of gauze that is wetted with warm saline to keep it moist.\nUsing blunt dissection, very carefully dissect the abdominal aorta away from the surrounding tissue. Be very careful in dissecting the vessel away from the inferior vena cava. There will be one or more branches, such as the lumbar artery, that must be carefully lifted and cauterized. The section of dissected aorta should be below the renal vessels and above the bifurcation of the aorta into the femoral arteries. This section can serve as donor material for as many as two recipients, depending on how many branching vessels exist and the size of the donor animal.\nTie a suture just below the renal arteries and another just above the bifurcation. Using scissors divide the aorta, fully rinse the graft with saline containing 200 U/ml heparin. Very carefully hold one end of the vessel and drip the saline solution so that it runs through the vessel by gravity. Do not let air bubbles run through the vessel. Handle the ends of the vessel as little as possible otherwise the intima can be damaged resulting in thrombosis later. Remove it from the field and immediately place it in a container of ice-cold saline. Allow the donor animal to exsanguinate.\n3. Recipient Operation\nAnesthetize the animal as above and apply a depilatory gel or use a shaver to remove hair on the abdomen. Just prior to the incision we administer a dose of buprenorphine subcutaneously at 0.1 mg/kg to establish analgesia.",
    "Mount the animal on the operating field using laboratory tape. The animal must be mounted on a warm operating stage that will help maintain body temperature during the operation.\nApply gentamycin ophthalmic ointment to the eyes to prevent them from drying out.\nDisinfect the abdomen, followed by an ethanol wash. Repeat this procedure three times, to insure adequate disinfection.\nCheck the adequacy of anesthesia once again before proceeding to the next step.\nMake a midline incision through the skin and the body wall in two stages, being careful not to impinge on the tissues underneath.\nInsert a spreader to hold the abdominal incision open. Point the screw assembly towards the hind end to keep the bulk of the clamp out of the way.\nWet a square of sterile gauze with saline and place it over the intestines. With your finger gently on the gauze, insert a cotton swab under the intestines and gently reflect the intestines over to the side so they are sitting on top of the gauze. Take another piece of gauze, place it on the intestines and wet it with saline.\nRemove any fatty tissue covering the aorta and the inferior vena cava (IVC). Be gentle. The IVC is very fragile.\nGently use forceps to dissect the infrarenal aorta from the IVC. Clear an area large enough to provide room for two clamps with enough vessel between them such that, when divided, there will be enough vessel to which the graft can be sutured. When dissecting, look for vessel branches. If necessary cauterize them with a low temperature cauterizer.\nInsert a vascular clamp just below the renal artery and another one just above the bifurcation.",
    "Cut the aorta. The ends of the aorta will usually retract, leaving a space of about 5 mm. Check for hemostasis. If the clamps are working correctly, only a small amount of blood should escape after the cut. If bleeding continues, check the clamps to be sure nothing is interfering with them. Note that none of the aorta is removed. It is merely divided.\nRinse the cut ends with heparinized saline (200 U/ml) and then remove the extra solution with a swab.\nTack the graft into place using three discontinuous sutures at each end. Just suture one side of the anastomosis at each end, and then fill in the rest with a continuous running suture or more discontinuous sutures. Seven to eight discontinuous sutures is sufficient. If you use a running suture, be sure that the vessel walls remain relaxed and that you do not cause stenosis at the anastomosis.\nCarefully remove the clamp at the cranial end and look for leaks at the suture lines. A small amount of seepage is OK providing it stops within about a minute. If there is more than that, it is possible to use a single stitch to stop the bleeding.\nGently press on the aorta above the anastomosis site with a wetted cotton applicator, and then remove the second clamp. Gently press and release a couple of times and check that the aorta appears patent. The graft will be perfused immediately and a pulse should be visible.\nRemove the gauze covering the intestines and move them back into place. Avoid twisting of the intestine and maintain normal anatomical orientation.\nClose the muscle layer using 5-0 Vicryl.\nClose the skin using 5-0 or 6-0 prolene.\nTreat the mouse subcutaneously with carprophen at 5 mg/kg to augment analgesia before terminating anesthesia.",
    "Give the mouse 0.5-0.8 ml saline subcutaneously.\nPlace the mouse in a heated cage to recover. Monitor it carefully during recovery to be sure that it is recovering normally. 2-3 hr after surgery, the mouse should be behaving relatively normally. At 12 hr post-op, treat the animal with buprenorphine subcutaneously at 2 mg/kg for analgesia. If, at any time, the animal is hunched, making noise or exhibiting a limited range of motion, investigate the problem. If a definitive cause cannot be established and fixed, the animal should be euthanized per institutional protocols. At 24 hr the animal should receive another dose of carprophen subcutaneously at 5 mg/kg. Hind leg paralysis indicates a failed anastomosis or a thrombus. In this situation, the animal should be euthanized.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}