{
  "id": 13208,
  "origin_website": "Jove",
  "title": "Differentiation and Characterization of Neural Progenitors and Neurons from Mouse Embryonic Stem Cells",
  "procedures": [
    "1. mESC culture\nCoat a 10 cm tissue-culture-treated plate with 0.1% gelatin and allow the gelatin to set for at least 15–30 min before aspirating it out.\nSeed γ-irradiated mouse embryonic fibroblasts (MEFs) one day before culturing the mESCs in the pre-warmed mESC medium (Dulbecco’s modified Eagle medium (DMEM) with 15% fetal bovine serum (FBS), non-essential amino acids, β-mercaptoethanol, L-glutamine, penicillin/streptomycin, sodium pyruvate, LIF, PD0325901 (PD), and Chir99021 (CH)).\nAllow the γ-irradiated MEFs to settle and attach to the plate surface before culturing E14 cells.\nThaw E14 ESCs in 37 °C water bath and quickly transfer the cells in a 15 cm conical tube with warm mESC medium. Pellet the cells at 200 x g for 3 min and remove the supernatant.\nResuspend the cells in 10 mL of mESC medium and plate the cells on the culture plate containing the γ-irradiated MEFs seeded earlier. Incubate the cell culture in a 37 °C incubator under 5% CO2.\nFor culture passaging, aspirate e the medium and wash the plate with sterile 1x PBS. Add enough 0.05% trypsin to cover the plate surface and incubate at 37 °C for 3 min.\nNeutralize the trypsin with mESC medium and pipette to generate single-cell suspension. Centrifuge the cells at 200 x g for 3 min and remove the supernatant.\nCount the cells with a hemocytometer or cell counter and seed about 5.0 x 105 cells in a 10 cm culture plate.\nResuspend the cells in 10 mL of mESC medium, plate the cells on the gelatin-coated tissue culture plate and incubate cultures as described earlier.",
    "NOTE: It is recommended that mESCs be passaged every 2 days to prevent the cells from differentiating in their colonies. Phenol red in the medium functions solely as a pH indicator and depending on the cellular density, it can turn yellowish (more acidic), sooner than 2 days. Hence, it may be necessary to change the medium every day. The γ-irradiated MEFs will eventually die off after a couple of passages.\n2. EB, NPC, and neuron differentiation\nPerform culture passaging protocol mentioned earlier and count the cells (steps 1.7–1.10).\nHanging drop method (day 0)\n\t\nFor a 10 cm cell culture plate, count roughly 2.5 x 104 cells where 5.0 x 102 cells will be suspended in 20 µL differentiation medium (DMEM with 15% FBS, non-essential amino acids, β-mercaptoethanol, L-glutamine, penicillin/streptomycin, and sodium pyruvate). Roughly fifty 20 µL droplets containing the cells can be plated on one 10 cm plate.\nAliquot the appropriate number of cells, and then centrifuge the cells at 200 x g for 3 min and remove the supernatant.\nResuspend the cells in the appropriate volume of differentiation medium for a cell density of 5.0 x 102 cells per 20 µL (e.g., 2.5 x 104 cells in 1 mL of differentiation medium).\nUsing a micropipette or a repeater pipette, place 20 µL droplets of the cell suspension onto the lid of the tissue culture plate. Make sure that the droplets are not too close to one another to prevent them from merging.\n\t\tNOTE: The droplets can be plated on either a tissue-culture-treated attachment plate or suspension plate as they will be placed on the lid and not the plate itself. For a more feasible and sterile approach, plate the droplets on an attachment tissue-culture plate and transfer them to a suspension plate as described below.",
    "Fill up the plate with 5–10 mL of 1x PBS and carefully put the lid back on the plate. Incubate the culture in the 37 °C incubator.\n\t\tNOTE: PBS is added to the culture plate to prevent the droplets from drying up.\nOn day 2, use a micropipette to collect the droplets from the lid and place them in a 10 cm cell culture suspension plate filled with 10 mL of differentiation medium. Incubate the culture on an orbital shaker shaking at low speed in the incubator.\nOn day 4, to harvest the EBs, collect the cells, centrifuge at 200 x g for 3 min, and remove the supernatant.\n\tNOTE: The EBs can also be washed with 1x PBS as per the requirements of subsequent experiments.\nTo continue the procedure and induce the EB differentiation into neural progenitor cells (NPCs), prepare the differentiation medium with 5 µM retinoic acid (RA).\nRemove the old medium by pelleting the EBs at 100 x g for 3 min or allow the EBs to settle before aspirating out the old medium. Add 10 mL of the differentiation medium containing 5 µM RA to the culture plate.\nOn day 6, replace at least half of the medium with fresh medium containing 5 µM RA by tilting the plate and pipetting out the medium as described above.\n\tNOTE: It is recommended that at least half of the medium be replaced with fresh RA-containing medium on days 5 and 7. Take note of the phenol red indicator; if it turns yellowish, it is best to replace all of the medium.\nOn day 8, harvest the NPCs by collecting the cells, centrifuging at 200 x g for 3 min, and removing the supernatant.",
    "NOTE: The NPCs can also be washed with 1x PBS according to the needs of subsequent experiments. If needed, NPCs can be frozen down and thawed again for later culture and analysis. If the NPCs are to be cultured, accutase can also be used as an alternative to trypsin.\nTo continue the procedure and to differentiate NPCs into neurons, collect NPCs in a 15 mL conical tube by centrifugation, dissociate them with trypsin and incubate them at 37 °C for 3 min. Pipette the NPCs to ensure that all NPC aggregates are dissociated and neutralize the trypsin with the medium.\nFilter the cells with 40 μm nylon cell strainer and count the cells before plating them at a density of 1.5 x 105/cm2 in N2 medium (DMEM/F12 medium + 3 mg/mL glucose + 3 mg/mL lipid-rich bovine serum albumin (LBSA) + 1:100 N2 supplement + 10 ng/mL bFGF + 50 U/mL pen/strep + 1 mM L-glutamine) on a tissue-culture-treated plate for subsequent PCR and western blot experiments; or on a tissue culture chamber for immunofluorescence experiments.\nOn day 9, replace the old medium with a fresh N2 medium.\nOn day 10, switch the N2 medium with N2/B27 medium (50% DMEM/F12 and 50% neural basal, 3 mg/mL LBA, 1:200 N2 supplement, 1:100 B27 supplement, 50 U/mL pen/strep, and 1 mM L-glutamine).\nOn days 11–12, harvest the neurons as follows. Wash the cells with 1x PBS, add trypsin, and incubate the culture in the 37 °C incubator for 3 min before neutralizing the trypsin with medium and centrifuge at 200 x g for 3 min.\n3. Characterization of mESCs and differentiated cells\nAlkaline phosphatase (AP) assay \nUse a kit to assess alkaline phosphatase activity (see the Table of Materials).",
    "Remove the medium from the culture plate and wash the ESCs with 1x PBS.\nAdd 1 mL of the fix solution (consists of formaldehyde and methanol) provided with the kit to the plate and incubate it at room temperature for 2–5 min.\n\t\tNOTE: Over-incubation in the fix solution can compromise the AP activity.\nRemove the fix solution, wash the ESCs with 1x PBS and leave some amount of PBS in the plate.\n\t\tNOTE: Keep the ESCs moist in PBS to not compromise the AP activity.\nPrepare the AP solution by mixing the A, B, and C substrate solutions at 1:1:1 ratio. Mix A and B solutions first and incubate the mixture at room temperature for 2 min before adding the C solution.\nRemove the 1x PBS and add the AP solution prepared earlier.\nIncubate the ESCs for about 15 min in the dark by wrapping the culture plate with aluminum foil or performing step 3.5 in a dark room.\nMonitor the reaction and remove the reaction solution when the solution turns bright to avoid non-specific staining.\nWash the ESCs twice with 1x PBS.\nPrevent the sample from drying by covering the ESCs with 1x PBS or mounting medium.\n\t\tNOTE: A red or purple stain will appear for AP expression. The plate can be stored in a 4 °C refrigerator.\nRT-qPCR \nCollect cells at various stages by following steps 1.6–1.7 and 2.4 for ESCs and EBs and NPCs, respectively.\nIsolate RNA using RNA, DNA, and protein extraction solution (see Table of Materials).\nGenerate cDNA with a reverse transcriptase kit (see the Table of Materials) and follow the manufacturer’s manual.\nFixation and embedding \nHarvest EBs and NPCs as described above (step 2.6) and fix them with 4% paraformaldehyde (PFA) solution in 1x PBS for 30 min at room temperature.",
    "Remove the PFA and wash the sample with 1x PBS for 5 min.\nPlace the sample in a serial dilution of 1x PBS, 10%-, 20%-, and 30%-sucrose solutions at 25‒28 °C where the sample is transferred to the next solution after 30 min of incubation.\n\t\tNOTE: The sample can be stored in the 30% sucrose solution at 4 °C before continuing with the embedding step.\nWet the pipette tip with sucrose solution before placing the sample (without stacking them) at the center of the cryo-mold and pipette out the excess liquid.\n\t\tNOTE: Filter paper can also be used to remove the excess solution. Wetting the pipette tip with sucrose solution is important to prevent the EBs and NPCs from sticking to the walls of the tip.\nCarefully add optimum cutting temperature (OCT) solution to the mold without resuspending the samples and remove excess bubbles with a pipette.\nPlace the mold with the sample on a laboratory mixer at low speed to mildly agitate the sample for 15 min. This helps to settle the EBs and NPCs to the bottom if they are resuspended in the OCT solution.\nQuickly freeze the sample by placing the mold in liquid nitrogen or on dry ice.\n\t\tNOTE: Samples can be stored in a -70 °C freezer before continuing to the next step.\nCryosectioning \nSet the cryostat to cool down to -20 to -18 °C before transferring the sample to the instrument.\nDetach the frozen OCT block from the mold and secure it on the holder with a little OCT solution placed on the surface of the holder.\nAlign the OCT block so that the EBs and NPCs are closest to the blade to ensure that the sample is not lost during sectioning.",
    "Carefully section 10 μm of the block and pay close attention to the slices that contain the sample.\nQuickly place the OCT slice containing the sample onto the tissue-embedding glass slide and allow the OCT slices to air-dry for 1 h at room temperature.\n\t\tNOTE: The samples can be stored at -70 °C for later use.\nImmunofluorescence (IF) \nBlock OCT sections or culture chambers containing neurons in 10% normal donkey serum/0.1% Triton X-100 in 1x PBS for 1 h at room temperature.\nIncubate the samples in primary antibody diluted in 5% normal donkey serum/0.05% Triton X-100 in 1x PBS overnight at 4 °C.\nWash samples in 1x PBS/0.1% Triton X-100 thrice for 5 min each wash.\nIncubate the samples with secondary antibody diluted in 5% normal donkey serum/0.05% Triton X-100 in 1x PBS for 1 h at room temperature.\nWash samples in 1x PBS/0.1% Triton X-100 thrice for 5 min each wash then incubate the samples in 1 μg/mL DAPI.\nMount the samples with a coverslip and some mounting medium and allow it to dry.\nObserve the samples under a fluorescence microscope.\nRNA-seq analysis \nCollect the cells at various stages and perform RNA extraction (see step 3.2).\nPrepare the cDNA libraries, perform deep sequencing and data analysis according to the protocol described in Wang et al.8.\nPerform the Gene Ontology (GO) analysis using the R package, clusterProfiler.\nFlow cytometry \nCollect ESCs by following the steps 1.6–1.7 and resuspend the cells in medium. Collect the EBs and NPCs by following step 2.4 and resuspend the cells in medium.\nFilter the cell suspension using the 40 μm nylon cell strainer into a new 15 mL conical tube.\nMeasure the GFP signal of the samples using the flow cytometer (performed by the institution’s core facility).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}