{
  "id": 13657,
  "origin_website": "Jove",
  "title": "Culturing Human Pluripotent and Neural Stem Cells in an Enclosed Cell Culture System for Basic and Preclinical Research",
  "procedures": [
    "1. Initial Setup\nSetting Gas and Temperature Concentrations\n\t\nUsing the software, click the \"Guest\" tab located on the upper left corner of the graphical interface. Login to the system using a designated username and password. Make sure each user has their own user name and password.\nClick on a module to adjust (Figure 1). Within the new window displaying the current settings, click on the existing O2 set point value below \"Set point\" and enter the required O2 concentration level for this module. Enter 5% O2 if pluripotent stem cells will be grown or manipulated in this module, and 9% O2 if neural stem cells will be grown or manipulated. Click on the green check mark to confirm the set point.\n\t\tNote: Two modules are not gas-adjustable: the laminar hood, and the microscope chamber. The gas concentrations in the laminar flow hood are atmospheric while those in the microscope chamber are passively maintained by the gas concentrations in the process chamber.\nRepeat this step for CO2. Enter a set point of 5% CO2 for all modules except for the buffer chambers, which are only adjustable for O2. \nMonitor the current gas concentrations, which are labeled as \"process values\", to make sure that they reach the new set points.\nAdjust the gas set points of all modules to the appropriate values. Match the CO2 and O2 levels of chambers that will be exposed to one another. For example, adjust the process chamber to 5% O2 before opening an incubator that grows cells at 5% O2. Also adjust to 5% O2 any buffer chamber that is used to add items to the process chamber during this time.",
    "Set the temperature of the process chamber to 37 °C using the same screen for gas adjustments. Also set the process chamber floor temperature to 37 °C.\nClick on the incubation module banks underneath each incubator. Adjust the temperature of the banks to 37 °C.\nOperation of Buffer Chambers\n\t\nGather all the supplies required for the given task (feeding, splitting, staining, etc.) in the beginning to prevent a delay in the work flow. Liberally spray all materials with 70% ethanol and allow them to dry in the laminar hood. Do not spray flasks or plates of cells - wipe them gently with a sterile gauze sponge saturated with 70% ethanol.\nMake sure both the outer and inner doors of the buffer chamber are securely closed. Then open the outside door, and place the items inside.\nClose the outer door. Within the software, select the buffer module, and click on the dilution factor tab. Enter 1 into the log factor box. Click start.\n\t\tNote: A \"dilution factor\" is defined to mean that the buffer module's atmosphere will be evacuated and replaced 1 time with clean, HEPA-filtered gas.\nOnce the graphical interface has stopped flashing \"dilution factor\", open the buffer chamber's inner door and bring the materials inside the process chamber.\n\t\tCaution: Do not allow the inner and outer doors to ever be open at the same time and do not open the inner door if the buffer chamber has not undergone a dilution factor.\nIn order to remove items from the process chamber, first ensure that the buffer chamber has undergone a dilution factor. Then open the inner door, place the items to be removed inside, and close the inner door. Then open the outer door and remove the items.",
    "Note: A dilution factor does not need to be run before opening the outer door.\n2. Introducing and Feeding Cells\nIncubator Setup\n\t\nPlace 3 Petri dishes in the water pan at the base of each incubator. Fill these dishes with sterile water. Do not directly fill the water pan. Maintain the water level in these dishes, as they are critical for maintaining the relative humidity (RH) set point in the incubators.\nWithin the graphical interface, click on the incubator. Click on the existing value for relative humidity (RH) under set point and enter 85%. Click on the green check mark to accept this value.\nPreparation of the Cell Production Facility for Cells\n\t\nIf not already done so, adjust the buffer chambers, the process chamber, and an incubator to the gas set points required for the type of cell being introduced.\nClean the surface of the process chamber with sterile gauze and a non-flammable disinfectant. Do not use any peracetic acid-based disinfectant, as in a closed system the strong, lingering vapors are toxic to mammalian cells. Instead, use benzalkonium chloride-based products.\nContinue disinfecting. Clean the gloves and surfaces that are commonly touched, such as door handles. Use the disinfectant thoroughly but sparingly, as excess liquid in the process chamber will contribute to humidity, condensation and possible microbial growth.\nClean the surface of the laminar flow hood and buffer chamber with 70% ethanol, and allow it to dry. Place the flask or plate of cells (in our case, PSCs or NSCs) in the hood, and briefly wipe its exterior surface with a sterile gauze sponge saturated with ethanol.\nPut the flask or plate in the buffer chamber, and run a dilution factor (step 1.2.3).",
    "Upon completion of the dilution factor, immediately move the flask or plate to the appropriate incubator. As the incubators are at the back of the process chamber, pull a shelf out into the process chamber for cell placement. Avoid opening the incubator doors unnecessarily or for extended periods of time, as the process chamber's air is very dry compared to that of the incubators, and will result in a significant loss of humidity in the incubator.\nFeeding Cell Cultures\n\t\nGather medium components, serological pipettes, an electronic pipettor, gauze and disinfectant. Also gather a waste container for spent cell culture medium, but do not fill it with bleach. Bring the materials into the process chamber through a buffer chamber as described in Section 1.2. Prepare cell culture medium in the process chamber, as previously described9,10 (also see Materials Table)\nArrange materials in such a manner as to enable an optimal working space. Avoid placing items not being used in the center of the process chamber.\nAllow for the medium to equilibrate with the CO2 and O2 levels present within the system by leaving the media container slightly uncapped. Some PSC medium manufacturers indicate not to warm media at 37 ºC; if this is the case, use a buffer chamber to equilibrate the medium. Allow the medium to equilibrate for 20 min.\nRemove the old medium from wells using an appropriate stereological pipette and an electronic pipettor. For PSCs, remove all but a small remaining amount of the old medium, enough to prevent desiccation during the feeding process. For NSCs, remove half of the old medium. Pipet the waste into the waste container.",
    "Place the used pipette back into its original wrapper and move it to the side of the process chamber, or into a buffer chamber designated for waste removal. With a fresh sterile serological pipette, add fresh medium to cell culture plates and place the plates back into their designated incubator.\nAt the end of feeding, spray gauze with disinfectant and clean the floor and door handles of the process chamber thoroughly. If there are multiple cell lines being grown in the system, sterilize in between feeding each cell line. This helps minimize the risk of cross contamination.\nUpon completion, remove waste or other unneeded items through one of the buffer chambers.\n3. Splitting Cell Cultures\nEnzymatic Passaging of PSCs or NSCs\n\t\nGather all items needed for passaging. This includes media, enzyme or non-enzymatic cell dissociation buffer (the latter is for NSCs only), DPBS, plates or flasks, extracellular matrix (ECM), conical tubes, and serological pipettes. Bring them into the system using a buffer chamber.\nCoat fresh plates or flasks with ECM, as previously described9,10. Some ECMs -such as those derived from mouse sarcoma cell lines - are only liquid between 4 and 15 °C, so use a sterilized cold block or gel ice pack to keep the ECM cold while working in the heated process chamber.\nPipet off the spent medium from the culture and dispose of it in the waste container.\nRinse the well or flask surface using 1 ml of DPBS/ well and dispose of the DPBS.\nAdd 1 - 2 ml of warm enzyme to each well. Only very dense cultures require 2 ml.",
    "Immediately move the culture dish or flask to the microscope chamber, and observe the culture carefully. Watch for signs of individual cells beginning to loosen off the dish. Do not wait until the cells float into suspension before proceeding to the next step.\nReturn the cells to the main process chamber. Using a 5 ml serological pipette, add 4 ml of DPBS for each 1 ml of enzyme, and then forcefully pipet up and down to dislodge the cells from the well surface. If passaging multiple wells within a multiwall plate, add the DPBS to each well before dislodging the cells from the individual wells.\nTransfer the enzyme and PBS cell suspension to an appropriately-sized conical tube.\nIf a centrifuge is not available in the cell production facility, tightly seal the conical tube, place it in a buffer chamber and seal the door closed.\nRemove the conical tube from the buffer chamber from the laminar flow side and spin the cells at 100 x g for 5 min at RT.\nSpray the conical tube with 70% ethanol, and bring it into the process chamber using a buffer chamber and dilution factor.\nPipet off the supernatant, and resuspend the cells in 2 ml of PSC or NSC medium. If passaging PSCs, make sure to include ROCK inhibitor in the medium at a concentration of 10 µM, as previously described9,10.\nCount the cells using a hemocytometer, and determine the number of wells or plates required. Plate PSCs at 5 x 104 - 1 x 105 cells/cm2. Split the NSCs at a 1:2 ratio.\n\t\tNote: NSCs often clump and resist accurate counting in a hemocytometer.",
    "If cryopreservation of the cells is required, follow the appropriate protocol9,10, but ensure that all supplies and freezing media are prepared in advance and placed inside the process chamber. DMSO is very toxic to cells at 37 ºC, so work very quickly. Keep the isopropanol-jacketed freezing container at RT in the laminar flow hood. Once the cryopreservation vials are filled and sealed, immediately remove the vials from the process chamber by passing them through a buffer chamber.\nManual Passaging of PSCs\n\t\nConfirm that the culture needs to be passaged, as previously described8. If so, prepare fresh plates or flasks coated with extracellular matrix. Then change the medium entirely.\nClean the microscope chamber with sterile gauze moistened with a sparing amount non-flammable disinfectant - too much will result in excess fogging in the chamber. Only clean the gloves, floor area, and stage. Bring several 200 µl or 1,000 µl individually wrapped pipet tips into the chamber.\nBring the plate of PSCs into the microscope chamber, remove the lid, and place it face down on the freshly cleaned floor. Leaving the lid up exposes the underside directly to air currents, and to potential contamination.\nUnwrap a pipet tip, and using the microscope to visualize the culture, pick apart colonies that have good morphology using the tip of the pipet.\n\t\tNote: The pipet tip may be attached to a pipet if the individual user finds this more comfortable.\nReplace the lid on the plate, and move the plate back to the process chamber.\nPipet off excess ECM from the new plate, and transfer the media from the old plate (containing the colony pieces in suspension) to the new plate. If the old plate still contains colonies that are not ready to be picked, feed it as well.\n4. Specialized Culture Techniques",
    "Sendai Transduction of Fibroblasts into PSCs\n\t\nWithin the cell production facility, expand human skin fibroblasts1 in fibroblast media containing DMEM/F12, 10% FBS, and 20 ng/ml FGF2, at 5% O2. Use 6-well culture dishes coated with 0.1% gelatin.\nPrepare the cells to be transduced by dissociating them with 1 ml of 0.25% trypsin per well. Inactivate the trypsin with 1 ml fibroblast medium. Spin at 200 x g, resuspend the cells in 1 ml of fibroblast medium, and count them using a hemocytometer.\n\t\t\nResuspend 2.0 x 105 cells in 2 ml fibroblast medium, and add the cell suspension to 1 well of a gelatin-coated 6 well plate (2.1 x 104 cells/cm2). Put the cells back in the incubator.\nAllow 24 hr for the cells to attach to the bottom of the plate.\nPlace fresh fibroblast medium inside the process chamber (1 ml of medium per well of cells to be transduced), and allow it to equilibrate to the gases.\nSterilize a pre-cooled cold block with 70% ethanol and place it in a buffer chamber. Use a gel ice pack with holes cut in it if a commercial cold block is not available.\n\t\tNote: There are 3 - 4 separate Sendai viruses (depending on the version of the transduction kit), which must be thawed quickly, but kept in the cold block once thawed.\nDip the bottom half of the tubes in a 37 °C water bath for 15 sec (do not submerge the tubes), then immediately clean the tube exteriors with 70% ethanol. Place the tubes on the sterilized cold block in the buffer chamber and run a dilution factor.",
    "Working quickly, add the necessary volume of each Sendai reprogramming virus to the equilibrated medium2. This volume is determined by three variables - the number of cells, the titer of each virus, and the desired multiplicity of infection for each virus. Consult the kit manual for recommended MOI. The formula is:\n\t\t[(number of cells being transfected) (multiplicity of infection) (1,000)] / (viral titer) = required µl of virus\n\t\t \nRemove the supernatant from the well(s) of cells to be reprogrammed. For each well, add 1 ml of the medium containing the viruses. Gently rock the plate, being careful not to spill media, and place the plate back in the 5% O2 incubator.\nAfter 2 hr gently rock the plate again and repeat again after another 2 hr.\nAfter 24 hr (day 1 post-transduction), feed the well with 1 ml of pluripotent stem cell medium. Repeat on day 2, but do not remove medium from the well.\nOn days 3 and 4, change half of the medium.\nOn day 5 and beyond, change the entire medium.\nWhen colonies appear, stain the culture using sterile antibodies to confirm that the colonies are indeed pluripotent, as described previously2. As with feeding cells, ensure that the PSC media containing the antibodies has been equilibrated to the gases in the cell production facility.\n\t\tNote: In a successful reprogramming, iPSC colonies should be present approximately two weeks after the transduction1.\nWhen the colonies have grown large enough, use the microscope to mark and mechanically passage them onto an ECM-coated plate, as described in section 3.2.\nExpand the colonies either manually or enzymatically, as previously described9,10.\n5. Cleaning Up After Daily Use",
    "Place all waste materials, including the liquid waste flask, into a sterile buffer chamber. Wipe down the surface of the processing chamber and all the areas that have come in contact by supplies with sterile gauze and non-flammable disinfectant.\nRemove all solid waste materials from the buffer chamber and discard in the appropriate waste container.\nDiscard liquid waste in an appropriate waste container, or simply mix with bleach and pour down the drain. Clean the waste container with soap and a brush. Sterilize the container with 70% ethanol and move it back to the process chamber via a buffer chamber.\n\tNote: It is not recommended to use bleach in the waste container while it is inside the system, as bleach fumes may recirculate and harm cell cultures.\nFor hygiene considerations, wipe down the front plastic surface of the system's processing chamber with 70% ethanol. This helps to clean off sweat and skin oils from the user's forehead.\nIf condensation has built up inside the process chamber, run a dilution factor to clear the condensation. Allow at least 1 hr for this to complete.\n6. Routine Non-daily Tasks\nReplenish the water dishes in the cell culture incubators with sterile, distilled water as needed. Top off the dishes at least once a week. However, the evaporation rate will fluctuate based on how often the incubator doors are opened, the volume of liquid in cultures, and the incubator settings.",
    "Once a month, recalibrate the O2 and CO2 settings in all chambers. This requires the use of SPAN (calibration) gas, which contains known concentrations levels of O2 and CO2 as a standard of reference. Make sure that there is adequate SPAN gas supply before starting calibration. The system uses specific gas sensors, located in each module, to detect gas concentrations; thus, the use of high quality SPAN gases ensures that the sensors reliably yield accurate gas concentrations.\nReplace the gloves in the process chamber and microscope chamber on a regular basis. Replace the gloves every 2 months, regardless of how often the system is utilized. Before installation, sterilize the new gloves with disinfectant. Run a dilution factor on the process chamber after the gloves have been replaced.\n\tNote: When stretched over the cuffs of the system, nitrile gloves have a tendency to develop holes in areas exposed to physical stress and heat. This is normal and unavoidable wear and tear.\nChange out the syringe filters in all chambers every 6 months.\nReplace or wash the prefilter on the laminar flow hood as soon as it begins to appear dirty.\nRefer to the manufacturer's documents regularly for information on the replacement of major parts.\n7. Cleaning of the System\nIn the event of a major contamination event affecting the majority of cell cultures, move any surviving cell cultures out of the system, or (if possible) into an unaffected incubator.\nTurn off the gas control for all chambers except that of unaffected incubators.\nRemove the flexible front panel of the apparatus, and remove the stainless steel shelves from the affected cell culture incubator. Also remove the water pan.",
    "Autoclave the incubator shelves and water pan, and put them back into the incubator. Wipe the interior surfaces of the incubator with 70% ethanol. Allow the ethanol to evaporate, and close the incubator door.\nWipe the surfaces of the process and microscope chamber with 70% ethanol. Replace the front panel of the apparatus.\nWipe the interior surfaces of the apparatus, including that of the affected incubator, with non-flammable disinfectant. Leave the door of the affected incubator open, and run a dilution factor on the process chamber. Make sure the microscope chamber doors are also open.\nFor routine cleaning of the cell culture incubators, ensure that the incubator and process chamber are at the same atmospheric settings. Open the incubator door, and place all cell culture dishes on the surface of the process chamber.\nWipe down the incubator shelves and interior surfaces with non-flammable disinfectant. Allow the disinfectant to evaporate, and move the cell cultures back to the incubator. Work as quickly as possible to avoid dessication of the cell cultures."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}