{
  "id": 11946,
  "origin_website": "Jove",
  "title": "Functional Analysis of Tumor-Infiltrating Myeloid Cells by Flow Cytometry and Adoptive Transfer",
  "procedures": [
    "NOTE: All animal studies complied with the Canadian Council on Animal Care guidelines and were approved by McMaster University's Animal Research Ethics Board.\n1. Tumor harvest and dissociation\nInoculate 6-8-week-old, female, C57BL/6 mice intradermally/subcutaneously with 2 × 105 B16 melanoma cells as described by Nguyen et al.8 Allow tumors to grow for 7 days before harvesting.\nEuthanize the mouse by cervical dislocation while making sure to not disrupt the tumor when doing so. Spray the mouse down with 70% ethanol before harvesting.\nUsing a scalpel and scissors, surgically remove the intradermal/subcutaneous tumor from surrounding tissue (including attached tumor-draining lymph nodes), and place the tumors into a preweighed microfuge tube. Keep on ice.\n\tNOTE: Conduct tumor harvest in an animal-use biosafety cabinet. Use a 15 mL conical tube for larger tumors.\nWeigh the tumors, and add 500 µL of RPMI-1640 medium with 10% fetal bovine serum (FBS) to each tube, using scissors to cut the tumors into small pieces within the tube or in a 6-well plate.\n\tNOTE: The tumor pieces should be small enough to be mixed by an electric pipettor once the digestion medium has been added.\nPrepare the dissociation mix by dissolving collagenase type IV at 0.5 mg/mL and DNase at 0.2 mg/mL in RPMI-1640 medium with 10% FBS and 5 mM calcium chloride.\n\tNOTE: Dissociation mix must be prepared fresh to maximize collagenase activity.\nTransfer the minced tumor suspension to a 15 mL conical tube, and add 10 mL of dissociation mix per 0.25 mg of tumor. Place the tube in a temperature-controlled orbital shaker for 30 min at 37 °C with 200 rpm agitation. Neutralize the collagenase activity by adding two volumes of cold RPMI-1640 medium with 10% FBS and 2 mM ethylenediamine tetraacetic acid (EDTA), and refrigerate for 10 min at 4 °C.",
    "Briefly vortex and pipette the suspension into a 40 µm strainer on a 50 mL conical tube. Use a syringe plunger and neutralizing media to disaggregate the residual tumor tissue, and wash it through the strainer. Centrifuge the suspension for 5 min (500 × g, 4 °C), discard the supernatant, and resuspend the pellet in phosphate-buffered saline (PBS) with 2% FBS and 1 mM EDTA.\n2. TIL enrichment and flow cytometric staining (FACS)\nTo enrich TILs for myeloid cell characterization, use a magnetic cell separation kit designed for biotin-positive selection with biotinylated CD45.2 antibodies according to the manufacturer's instructions (see the Table of Materials).\nResuspend the cells in 200 µL of FACS buffer (PBS with 0.5% w/v bovine serum albumin (BSA)), and transfer them to a 96-well U-bottom plate.\n\tNOTE: Do not exceed a staining concentration of 1 × 108 cells/mL. Adjust the volume, and split samples into multiple wells to compensate for high cell numbers.\nCentrifuge the plate for 5 min (500 × g, 4 °C), and discard the supernatant. Add 50 µL of Fc block solution (1:200 dilution of purified rat anti-mouse CD16/CD32 [see the Table of Materials) in FACS buffer, final concentration of 2.5 µg/mL), and resuspend the cells by pipetting. Incubate for 10 min at 4 °C.\nAdd 50 µL of FACS buffer containing 2x concentration of surface-staining antibody (1:50 dilution of CD45.2, NK1.1, CD11c, F4/80, CD8a, Ly6C, CD11b, CD4, Ly6G) and fixable viability stain (FVS, 1:500 dilution), and mix the cells by pipetting. Incubate for 20 min at 4 °C.\n\tNOTE: Cover the plate with aluminum foil to minimize light exposure. Antibodies should be titrated prior to the experiment to empirically determine the optimal dilution.",
    "Wash the cells twice by adding 200 µL of FACS buffer to each well, centrifuging the suspension (5 min, 500 × g, 4 °C), and discarding the supernatant.\nAdd 100 µL of fixation/permeabilization solution (see the Table of Materials) to each well, mix the cells by pipetting, and incubate for 20 min at 4 °C.\nAdd 100 µL of 1x permeabilization buffer (see the Table of Materials) to each well, centrifuge the plate for 5 min (500 × g, 4 °C), and discard the supernatant.\nWash the cells by adding 200 µL of 1x permeabilization buffer to each well, centrifuging the suspension (5 min, 500 × g, 4 °C), and discarding the supernatant.\n\tNOTE: The experiment can be paused overnight after resuspending the cells in permeabilization buffer. Store the sample at 4 °C and protected from light. Resume after briefly mixing the cells before centrifuging.\nAdd 100 µL of permeabilization buffer containing 1x concentration of intracellular staining antibody (1:100 dilution of nitric oxide synthase 2 (NOS2), arginase 1 (Arg1)), and mix the cells by pipetting. Incubate for 20 min at 4 °C.\n\tNOTE: Cover the plate with aluminum foil to minimize light exposure. Antibodies should be titrated prior to the experiment to empirically determine the optimal dilution.\nAdd 100 µL of 1x permeabilization buffer to each well, centrifuge the plate for 5 min (500 × g, 4 °C), and discard the supernatant.\nWash the cells by adding 200 µL of 1x permeabilization buffer to each well, centrifuging the suspension (5 min, 500 × g, 4 °C), and discarding the supernatant.\nResuspend the cells in 300 µL of FACS buffer. Filter the sample through a 5 mL round-bottom polystyrene tube with 40 µm strainer cap before performing flow cytometry analysis.\n3. Tumor myeloid cell sorting for functional studies",
    "After identifying the desired myeloid cell populations by flow cytometry analysis, pre-enrich bulk myeloid cells for sorting with a magnetic cell separation kit designed for CD11b- or CD11c-positive selection according to the manufacturer's instructions (see the Table of Materials).\nUsing surface-staining antibodies specific for the desired myeloid cell subsets (1:100 dilution of CD11b, Ly6C, Ly6G), stain the pre-enriched cells as described in steps 2.2-2.5.\n\tNOTE: Include fixable viability stain to ensure the sorting of live myeloid cells. Do not exceed a staining concentration of 1 × 108 cells/mL. Adjust the volume, and split the samples into multiple wells to compensate for high cell numbers.\nResuspend the cells in cold sorting buffer (PBS with 1% w/v BSA, 25 mM 4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid (HEPES), and 1 mM EDTA). Filter the sample through a 5 mL round-bottom polypropylene tube with a 40 µm strainer cap. Keep the cells on ice, and cover the tube with aluminum foil.\n\tNOTE: Adjust the concentration of cells/volume to the desired instrument specification for sorting.\nPrepare a sample collection tube with capture medium (5 mL round-bottom polypropylene tube containing PBS with 50% FBS).\n\tNOTE: Coat tubes with 5 mL capture medium overnight prior to sorting. Discard all but 1-2 mL of the capture medium on the next day before running the sample.\nModify the sorter instrument settings to decrease sample pressure and prevent perturbations in droplet formation. Equip the 130 µm nozzle tip, and utilize the 10 psi setting. Run the sample at a low flow rate with periodic sample agitation at 100 rpm, ensuring that the deposition of droplets is in the center of the tube. After the sort, keep the sample on ice.",
    "Incubate the sample for 10 min at 4 °C. Centrifuge the tube for 5 min (500 × g, 4 °C), discard the supernatant, and resuspend the pellet in the desired medium for functional assays or adoptive transfer.\n4. Adoptive transfer of purified tumor myeloid cells\nInoculate 6-8-week-old, female, C57BL/6 mice intradermally with 1 × 106 B16 melanoma tumor cells resuspended in 30 µL of PBS.\n\tNOTE: Inoculate mice in advance such that tumor growth does not exceed 100 mm3 by the time of adoptive transfer.\nResuspend the sorted tumor myeloid cells in PBS with 25 mM HEPES and 1 mM EDTA at a concentration of 2 × 106 cells/mL. Filter the sample through a 5 mL round-bottom polystyrene tube with a 40 µm strainer cap. Keep on ice.\nInduce and maintain mice under anesthesia with 3% isoflurane. Apply ophthalmic ointment to prevent ocular dryness/injury.\nLoad a 31 G syringe with 50 µL of cell suspension. Dislodge air bubbles by gently flicking the syringe. Clean the injection site using an alcohol swab.\nUsing sterile forceps, lift the skin at the base of the tumor. Insert the needle into the subcutaneous space at a slight upward angle to enter the tumor from below the skin. Use the forceps to pinch the skin surrounding the needle, and slowly dispense the syringe volume. Continue to pinch the skin with the forceps while removing the needle slowly, and use a cotton swab to clean potential leakage.\n\tNOTE: Proceed with any additional therapeutic treatments if desired.\nAllow the mice to recover from anesthesia.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}