{
  "id": 18058,
  "origin_website": "Jove",
  "title": "Invasive Hemodynamic Characterization of the Portal-hypertensive Syndrome in Cirrhotic Rats",
  "procedures": [
    "All methods described here have been approved by the ethics committee of the Medical University of Vienna and the Austrian Ministry of Science, Research and Economy (BMWFW). Procedures must be performed in aseptic conditions in an operation room or similar clean working area since the hemodynamic measurements represent surgical interventions. Generally, working in sterile conditions is recommended. When using an inhalation anesthesia, consider adequate ventilation of the surgery room for work safety. A time period of 40–50 min/animal has to be considered in the case all hemodynamic readouts presented in this protocol.\n1. Pre-surgical Preparations\nTurn on and calibrate the electronic multichannel recorder including the pressure transducers according to the manufacturer's instruction.\nConnect the ultrasonic flow probes (1 mm and 2 mm) to the bridge amplifier.\nPrepare a reservoir of sterile physiological saline solution, heated to body temperature, 37 °C, for moistening tissues or gauze compresses.\nRecord the animal body weight to provide weight-adjusted anesthesia and normalization of hemodynamic parameters according to the body weight.\nPrepare all equipment for an inhalation anesthesia.\n\tNOTE: If inhalation anesthesia and/or necessary equipment is not on site or feasible, then injection anesthesia using ketamine and xylazine can be used (80–100 mg/kg ketamine with 5–10 mg/kg xylazine in physiological saline solution, intraperitoneal (i.p.)). A re-dosing of ketamine (reduced dose of 20–30 mg/kg, intramuscular (i.m.)) after 30–45 min is necessary to induce continuous surgical-plane anesthesia.\nPut the animal under short-term isoflurane anesthesia using an induction box for inhalation anesthesia (5 min, 5% v/v isoflurane, 3–4 L O2-flow). Carefully tilt the box and check the depth of anesthesia by the immobility status of the animal.\nIntubate the rat with a suitable self-made endotracheal tube.",
    "NOTE: For personnel who are new to the intubation technique, the analgesia/anesthesia (step 1.10) can be given right after short term inhalation anesthesia to allow extra time for intubation. Another option is an animal-specific facemask for inhalation anesthesia.\n\t\nUse a self-made endotracheal tube from a modified peripheral venous catheter (14 G). Cut off the handling wings and affix an adhesive tape loop for posterior fixation to the rat's cheek to prevent dislocation of the endotracheal tube (Figure 1A).\nUse a self-made guide wire device from a modified arterial cannula as a guide wire holder and a suitable blunt-tipped wire (Figure 1B).\nUse a suitable intubation desk for proper positioning of the animal. Place the animal in the supine position with the head in the angled position.\n\t\tNOTE: If no intubation desk is available, it is possible to place the animal in supine position with the neck carefully stretched over the table's edge. However, this procedure is not recommended due to increased risk of injuries.\nFix a suture behind the incisors on one side of the rat, and gently stretch the animal's neck by tying the suture down on the other side (Figure 1C).\nIlluminate the pre-tracheal ventral collar area by a focused light beam. Especially in albino animals, ensure that the vocal cords are illuminated through the skin to allow for improved visualization and rapid intubation.\n\t\tNOTE: Use an animal-specific laryngoscope for intubation of pigmented animals.\nGrab the tongue and gently pull it by using two fingers.\nUse a cotton bud treated by lidocaine (pump spray) to carefully anesthetize the laryngeal area.\nIntubate the animal by inserting the endotracheal tube between the vocal folds and into the trachea, using the support of the guide wire device (Figure 1D).\nRemove the guide wire device.\nConnect the tube to the ventilator.",
    "Start the ventilator using the appropriate settings for the animal (1 L/min O2-Flow, Auto Flow = 90/min; inspiratory pressure: 18 mmHg; PEEP: 3 mmHg, I/E = 1:2) and check for proper intubation.\n\t\tNOTE: If inflation of the stomach is noted, remove the tube and try again. Additionally, compare the respiratory activity to the ventilator rhythm or place two fingers on the abdomen wall right over the stomach to assess potential inflation of the stomach.\nStart isoflurane anesthesia at 0.5–1.0% v/v and 1 L/min O2-Flow immediately after successful intubation (Figure 2A).\nFix the endotracheal tube by a transbuccal suture through the cheek and the affixed adhesive tape loop of the tube.\nAdminister additional anesthesia and analgesia by two 1 mL syringes, e.g., ketamine (100 mg/kg) i.p. (23 G cannula) [or i.m. by distributing the injected volume (dose) in bilateral injections in the caudal thigh muscle (30 G cannula)] and piritramide (2 mg/kg) by subcutaneous (s.c.) injection (23 G cannula). Note the maximum volume of i.m. injections per injection site (Figure 2B).\nApply eye ointment. Clip the body hair at the abdominal region and both inner thighs. Disinfect the skin.\n\tNOTE: Both inner thighs should be shaved to allow the use the contralateral femoral artery for HR and MAP measurements in case the catheterization of the femoral artery failed on one side. Shaving at a later time point may cause hair to contaminate the surgical field.\nFix the animal in the supine position on a heating pad (38 °C) with adhesive tape (Figure 2C).\nMonitor the body temperature of the animal continuously, e.g., by using a rectal temperature probe (Figure 2D).\nAssess the anesthesia depth by lid closure reflex and toe-pinch-test prior to any intervention or surgery.\n2. Measurement of HR and MAP",
    "Incise the skin on the inner thigh (select one side) above the presumed location of the femoral artery by lifting the skin by tissue forceps and removing a skin area of about 2 cm length by Mayo scissor (Figure 3A).\nExpose and bluntly dissect the artery-vein-nerve complex that includes the femoral artery from connective tissue (adventitia) by repeatedly opening a hemostat along the complex.\nDissect the artery-vein-nerve complex from the surrounding tissue along ~1–1.5 cm (Figure 3B).\nIf necessary, remove subcutaneous/perivascular fat for a better view and dissection.\n\tNOTE: Be careful when removing subcutaneous/perivascular fat by cuticle scissor, since injured blood vessels may cause bleedings. If bleeding is noted, apply pressure on the bleeding area using a small gauze or stop the bleeding by a hemostat.\nSeparate the femoral artery from the femoral vein and nerve with two high precision 45° angle broad point forceps (consider that the femoral vein is the most medial structure and the femoral artery is located more lateral) (Figure 3C-F).\nPlace a ligature on the femoral artery as distal as possible and use a curved clamp on the suture to apply gentle longitudinal traction to the femoral artery.\nPlace a second pre-knotted (but not closed knot) suture on the femoral artery as proximal as possible (Figure 3G).\nPrepare a suitable catheter (PE-50 for rat femoral artery) with a slanted (~45°) cut-off tip flushed with heparinized sterile physiological saline solution (5 mL syringe and 23 G blunt cannula). Ensure no air bubbles are inside the catheter as they hamper the arterial pressure and HR readout (Figure 3H).\nCompress the femoral artery at the proximal end of the exposed section using a micro clamp to temporarily stop the arterial blood flow (Figure 3I).",
    "Perforate the arterial wall at a distal location of the dissected section by using a bent cannula (23 G) while placing a supporting micro metal spatula underneath the femoral artery (Figure 3J).\nCarefully catheterize the femoral artery through the perforation with the slanted tip of the catheter facing upwards. Advance the catheter until the micro clamp is approximated (Figure 3K).\n\tNOTE: In case of unsuccessful catheterization of the femoral artery at first try, a more proximal second attempt can be performed (begin at step 2.8). If the artery ruptures or severe bleeding occurs, ligate or clamp the artery as proximal as possible to prevent further blood loss. If blood loss is minimal, attempt catheterizing the contralateral femoral artery (begin at step 2.1).\nOpen the micro clamp and check for pulsatile arterial blood flow into the catheter (Figure 3L).\nPrevent further influx of blood into the catheter by blocking the outflow of the catheter.\nFix the catheter in its intraluminal location by closing the prepared proximal ligature around the femoral artery and the introduced catheter (Figure 3M).\nRepeatedly rinse and aspirate the catheter in the femoral artery to assess proper intravascular placement. Arterial pulsation in the column of aspirated blood should be easily noticeable.\nFix the catheter position along the vessel using the ends of the distal ligature to prevent dislocation and ensure a longitudinal position of the catheter (Figure 3N).\nAdditionally, tape the catheter close to the animal on the surgical table to secure it and prevent accidental dislocation.\nConnect the catheter filled with physiological saline solution to the pressure transducer while avoiding the formation of air bubbles.\nStart recording the HR and MAP using the digital interface (Figure 3O).\nCover the exposed area on the inner thigh with a small moistened gauze compress (Figure 3P).",
    "Calculate the hyperdynamic (HD) index: HD = MAP/HR.\n\tNOTE: In advanced PHT, the HD index is elevated as compared to non-portal hypertensive animals. However, an increase in HD index during surgery might also indicate bleeding, hypovolemia, or pain. If recorded MAP values are very low but the signal is good and pulsatile flow is detected in the catheter, check for the level of anesthesia and potentially reduce the level of anesthesia. Do not completely stop isoflurane anesthesia, since this may lead to insufficient anesthesia depth according to animal welfare and good scientific practice.\n3. Superior Mesenteric Artery Blood Flow (SMABF)\nPerform a median laparotomy (Figure 4A-C)\nLift the skin layer with tissue forceps 5–6 cm below the xiphoid and remove a thin strip of skin using a Mayo scissor above the linea alba until the xiphoid is reached.\nAt the middle the skin incision, lift the muscular layer by tissue forceps along the linea alba to create distance between the abdominal wall and splanchnic organs.\nOpen the peritoneal cavity by incising the abdominal wall with a scalpel at the linea alba. Extend the opening while lifting the abdominal wall by tissue forceps with a Metzenbaum scissor along the linea alba over the same distance as the skin layer.\nCarefully excavate the intestine using wet cotton buds by starting with the coecum and place it on a large gauze compress soaked in sterile physiological saline solution next to incision (Figure 4D-F).\nWrap the intestine into the gauze compress and make sure it is moistened with sterile physiological saline solution (Figure 4G).\nLocate and expose the superior mesenteric artery.",
    "Dissect the superior mesenteric artery with two self-made blunt 'Schwabl'-Hooks: Lift the artery with the first hook and try to place the second one through the same tissue tunnel. Expose the superior mesenteric artery along a 5 mm distance to ensure the flow probe (1 mm) can be placed around it (Figure 4H-K).\n\tNOTE: If preferred, a precision 45° angle broad point forceps can be used to lift the artery as well. 'Schwabl'-Hooks are prepared from 30 G cannulas with bluntly broken tips bent to a hook shape. If collateral arteries are extensive, the 'Schwabl'-Hooks may be safer as bleedings from collaterals while dissecting the superior mesenteric artery can be avoided. If bleeding occurs while preparing the superior mesenteric artery, place a small gauze compress on the bleeding site for 1–2 min with gentle pressure. Small bleeding will usually stop quickly; always keep in mind to moistening tissue periodically (step 1.12). If the superior mesenteric artery itself is harmed, the hemodynamic assessments must be terminated.\nApply ultrasound gel to the ultrasonic flow probe's sensor and attach it to the splanchnic mesenteric artery. Align it to the natural route of the superior mesenteric artery (Figure 4L-M).\nClose the flow probe (1 mm) and if needed gently apply additional ultrasound gel on the Doppler sensor to improve signal quality. Do so by using a syringe (20 mL) filled with ultrasound gel and a blunt-tipped cannula (18 G) (Figure 4N-O).\n\tNOTE: If the flow probe is not well aligned along the natural course of the vessel, tension may cause vascular constriction and thus, turbulent flow, which reduces the accuracy of the flow measurements. Try to re-align the direction of the flow probe along the natural route of the vessel and then sufficiently fix the flow probe in an appropriate position.",
    "Measure the SMABF and assess the accordance of the pulsatile flow signal to the systolic peaks of the femoral artery recording.\n\tNOTE: If recorded MAP values are very low but the signal is good and pulsatile flow is detected in the catheter, check for the level of anesthesia and potentially reduce the level of anesthesia. Do not completely stop isoflurane anesthesia, since this may lead to insufficient depth of anesthesia according to animal welfare and good scientific practice.\nFind a stable position of the flow probe (1 mm) and fix the cable of the flow probe. Start recording the SMABF without further manipulation of the flow probe (1 mm) (Figure 4P).\n4. PVBF\nLocate and expose the portal vein at the dorsal face of the mesentery that is close to the liver hilum (Figure 5A).\nGently dissect the portal vein from the surrounding tissue using a high precision 45° angle broad point forceps: Isolate the portal vein by gently and repeatedly pushing the forceps under the portal vein to create a tissue tunnel (Figure 5B).\n\tNOTE: If a bleeding occurs from the periportal tissue while preparing the portal vein, apply gentle pressure on the bleeding site for 1-2 min using a cotton bud; this often stops the bleeding.\nEnlarge the tunnel by opening the high precision 45° angle broad point forceps slowly and expose the portal vein along a distance of 5-6 mm to allow the placement of the perivascular flow probe (2 mm) (Figure 5C, D).\nApply ultrasound gel to the ultrasonic flow probe's sensor and attach it to the portal vein aligned with its natural route (Figure 5E).\nClose the flow probe (2 mm) and apply additional ultrasound gel if needed, as previously described (step 3.7) (Figure 5F).",
    "Make sure the flow probe is placed in a non-constrictive way around the portal vein (Figure 5G).\n\tNOTE: If the flow probe is not well aligned along the natural course of the vessel, tension may cause vascular constriction and thus, turbulent flow, which reduces the accuracy of the flow measurements. Try to re-align the direction of the flow probe along the natural route of the vessel and then sufficiently fix the flow probe in an appropriate position.\nFind a stable position of the flow probe (2 mm) and fix the cable of the flow probe. Then, start recording the PVBF (Figure 5H).\n\tNOTE: If recorded MAP values are very low but the signal is good and pulsatile flow is detected in the catheter, check for the level of anesthesia and potentially reduce the level of anesthesia. Do not completely stop isoflurane anesthesia, since this may lead to insufficient depth of anesthesia according to animal welfare and good scientific practice.\n5. PP\nPrepare a catheter (PE-50 for rat mesenteric veins) with a slanted (about 45°) cut-off tip that is flushed with sterile physiological saline solution (5 mL syringe and blunt 23 G cannula). Pay attention that no air bubbles are inside the catheter as they obstruct the PP readout (Figure 6A).\nHandle the intestine with wet gloves and place it scattered across fingers (Figure 6B).\nOptimize the view of the mesenteric vascular bed close to the small intestine (Figure 6C).\nIdentify the main venous mesenteric vessels leading to the portal vein (vena ileocolica - vena mesenterica superior - vena portae).\nFind a suitable junction of the ileocolonic vein that is accessible for catheterization.\nFirst stick the catheter into the mesenteric tissue by perforating the visceral peritoneum of the mesentery close to the vascular junction chosen for catheterization.",
    "Carefully advance the slanted tip of the catheter closer to a junction of the ileocolic vein until a slight impression of the vessel junction is seen (Figure 6D).\nFinally, catheterize the venous system in line with the joining vessel route by perforating the vascular wall at the crossing angle of the vessels. (Figure 6E).\n\tNOTE: If bleeding occurs at the catheterization of the ileocolic vein, using a thumb press with a small gauze compress at the bleeding area. This pressure should be maintained for 1–2 min to stop the bleeding. Afterwards, try to insert the catheter at a more proximal branch of the ileocolic vein.\nAdvance the catheter carefully further along the main venous vessel route to the portal vein without perforating the vein (Figure 6F).\n\tNOTE: Keep the catheter at a sufficient distance to the flow probe placed around the main branch of the portal vein to avoid artifacts in the flow signal and to prevent perforation of the portal vein.\nConnect the catheter filled with physiological saline solution to the pressure transducer while avoiding the formation of air bubbles.\nStart recording the PP.\nRecord all hemodynamic parameters simultaneously under stable conditions for several min (Figure 6G, H). Optionally, the portal venous catheter can be fixed in place using tissue glue and the intestines can be re-located into the abdominal cavity.\n\tNOTE: If recorded MAP values are very low but the signal is good and pulsatile flow is detected in the catheter, check for the level of anesthesia and potentially reduce the level of anesthesia. Do not completely stop isoflurane anesthesia, since this may lead to insufficient depth of anesthesia according to animal welfare and good scientific practice.\n6. IHVR",
    "After sacrificing the animal, measure the liver weight. Calculate the IHVR: IHVR = PVBF/PP. Normalize this PVBF value to the weight of the liver.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}