{
  "id": 11157,
  "origin_website": "Jove",
  "title": "Viral Nanoparticles for In vivo Tumor Imaging",
  "procedures": [
    "1. VNP (CPMV, BMV, PVX, and TMV) Propagation\nSet the indoor plant chamber controls to 15 hr of day (100% light, 25 °C, 65% humidity) and 9 hr of night (0% light, 22 °C, 60% humidity).\nInoculate plants according to the timeline in Table 1.\ntable:\n﻿0,1\nCPMV,\"PVX, TMV, and BMV\"\nDay 0: Plant 3 cowpea seeds/pot.,Day 0: Plant ~30 N. benthamiana seeds/pot. Fertilize once a week with 1 tablespoon fertilizer/5 L water.\nDay 0: Plant 3 cowpea seeds/pot.,Day 14: Re-pot N. benthamiana at 1 plant/pot.\nDay 10: Infect leaves primary leaves with CPMV (5 μg/50 μl/leaf) by mechanical inoculation using a light dusting of carborundum.,\"Day 28: Infect three to five leaves with PVX, TMV, or BMV (5 μg/50 μl/leaf) by mechanical inoculation using a light dusting of carborundum.\"\nDay 20: Harvest leaves and store in -80 °C.,Day 42: Harvest leaves and store in -80 °C.\nTable 1. Timeline for growing, infecting, and harvesting leaves.\nNote: only CPMV propagation is demonstrated as an example.\n2. VNP (CPMV, BMV, PVX, and TMV) Purification\nNote: All steps are carried out on ice or at 4 °C.\nHomogenize 100 g of frozen leaves in a standard blender using 2 volumes of cold buffer (see Table 2). Filter through 2-3 layers of cheesecloth.\nFor PVX, adjust pH to 6.5 using 1 M HCl. Add 0.2% (w/v) ascorbic acid and 0.2% (w/v) sodium sulfite.\nCentrifuge crude plant homogenate at 5,500 x g for 20 min. Collect supernatant.\nFor BMV, layer 25 ml of supernatant over 5 ml of 10% (w/v) sucrose solution. Centrifuge at 9,000 x g for 3 hr and resuspend pellets in 38.5% CsCl solution (w/v). Mix by shaking for 5 hr, then continue with step 2.12.\nExtract plant material by adding 0.7 volumes of 1:1 (v/v) chloroform:1-butanol. Stir mixture for 30-60 min.",
    "Centrifuge solution at 5,500 x g for 20 min. Collect the upper aqueous phase.\nAdd NaCl to 0.2 M and 8% (w/v) PEG (MW 8,000). For TMV, also add 1% (v/v) Triton X-100. Stir for at least 1 hr, then let sit for at least 1 hr.\nCentrifuge solution at 15,000 x g for 15 min. Resuspend pellet in 10 ml of buffer. For PVX, add 0.1% β-mercaptoethanol and urea to 0.5 M.\nCentrifuge at 8,000 x g for 30 min and collect supernatant.\nUltracentrifuge supernatant at 160,000 x g for 3 hr. Resuspend pellet in 5 ml buffer overnight.\nPrepare a 10-40% sucrose gradient using equal volumes of 10%, 20%, 30%, and 40% sucrose in buffer (heaviest first). Allow the gradient to equilibrate overnight at room temperature.\nUltracentrifuge resuspended pellet over sucrose gradient at 100,000 x g for 2 hr (24 hr for BMV).\nCollect light scattering band and dialyze against buffer.\nCharacterize the VNPs (below) and store at 4 °C. For long-term storage, store at -80 °C.\ntable:\n﻿0,1\nCPMV and TMV,0.1 M potassium phosphate buffer (pH 7.0)  38.5 mM KH2PO4  61.5 mM K2HPO4\nPVX,0.5 M borate buffer (pH 7.8)  0.5 M boric acid  Adjust pH with NaOH\nBMV,SAMA buffer (pH 4.5)  250 mM sodium acetate  10 mM MgCl2  2 mM β-mercaptoethanol (add fresh)\nTable 2. Buffers and their recipes for each VNP.\nNote: only CPMV propagation is demonstrated as an example.\n3. VNP (CPMV, BMV, PVX, and TMV) Characterization\nPerform UV/visible spectroscopy to determine the concentration of VNPs.\n\t\nMeasure the absorbance of 2 μl of sample using a NanoDrop spectrophotometer.",
    "Determine the concentration of particles and dyes using the Beer-Lambert law (A=εcl, where A is the absorbance, ε is the extinction coefficient, c is the concentration, and l is the path length). The path length is 0.1 cm for the NanoDrop.\n\t\tThe VNP-specific extinction coefficients are:\nCPMV: 8.1 cm-1mg-1ml (at 260 nm)\nPVX: 2.97 cm-1mg-1ml (at 260 nm)\nTMV: 3.0 cm-1mg-1ml (at 260 nm)\nBMV: 5.15 cm-1mg-1ml (at 260 nm)\nAnalyze particles by size-exclusion fast protein liquid chromatography (FPLC).\n\t\nUsing a Superose 6 size-exclusion column and the ÄKTA Explorer, load 50-100 μg of VNPs in 200 μl of 0.1 M potassium phosphate buffer (pH 7.0).\nSet detectors to 260 nm (nucleic acid), 280 nm (protein), and the excitation wavelength of any dyes attached.\nRun at a flow rate of 0.5 ml/min for 72 min.\nThe elution profile and A260:A280 nm indicates whether the VNP preparation is pure and whether particles are intact and assembled.\n\t\tThe following A260:280 ratios indicate a pure VNP preparation:\nCPMV: 1.8±0.1\nPVX: 1.2±0.1\nTMV: 1.1±0.1\nBMV: 1.7±0.1\nPerform denaturing (pre-cast NuPAGE) Bis-Tris polyacrylamide 4-12% gradient gel electrophoresis to analyze purity of preparation and conjugation to individual coat proteins.\n\t\nAdd 3 ml of 4x LDS sample buffer to 10 μg of the particles in 9 μl of potassium phosphate buffer. Add an additional 1 μl of 4x LDS sample buffer and 3 μl of β-mercaptoethanol to BMV to reduce the high number of disulfide bonds.\nIncubate in heat block for 5 min at 100 °C.\nLoad samples onto an SDS gel.\nRun samples at 200 V for 1 hr in 1x MOPS running buffer.\nDocument the gel under UV light to visualize fluorescent coat proteins.",
    "For non-fluorescent protein, stain with Coomassie blue (0.25% (w/v) Coomassie Brilliant Blue R-250, 30% (v/v) methanol, 10% (v/v) acetic acid) for 1 hr.\nDestain with 30% methanol, 10% acetic acid overnight. Change the solution if required.\nDocument the gel under white light.\nAnalyze integrity of particles by transmission electron microscopy (TEM).\n\t\nDilute samples to 0.1-1 mg/ml in 20 μl of DI water.\nPlace 20 μl drops of the samples on Parafilm.\nCover drops with a TEM grid and let sit for 2 min. Wick off the excess solution on the grid with filter paper.\nWash grid by placing on a drop of DI water then wicking dry.\nStain grid by placing on a 20 μl drop of 2% (w/v) uranyl acetate for 2 min. Wick off the excess stain with filter paper.\nWash grid once more in water.\nObserve grid under a transmission electron microscope.\n4. Chemical Conjugation of VNPs with PEG and Fluorophores, Purification, and Characterization\nFor calculations for the reactions below, the molar mass of the VNPs are:\nCPMV: 5.6 x 106 g/mol\nPVX: 35 x 106 g/mol\nTMV: 41 x 106 g/mol\nBMV: 4.6 x 106 g/mol",
    "Conjugate dyes and PEG to surface lysines of CPMV and PVX using a one-step N-hydroxy succinimide coupling reaction: Add 2,500 molar equivalents (all molar excesses refer to molar excess per VNP) of Alexa Fluor 647 succinimidyl ester and 4,500 equivalents of NHS-PEG (M.W. 5,000) dissolved in DMSO to CPMV in 0.1 M potassium phosphate buffer. When working with PVX, add a 10,000 molar excess of NHS-dye and NHS-PEG. Adjust the buffer and DMSO volumes such that the final concentration of CPMV and PVX is 2 mg/ml and DMSO content is 10% of the total reaction volume. Incubate the reaction mixture overnight at room temperature protected from light. CPMV and PVX have 300 and 1,270 addressable lysines, respectively. (The reader is referred to the following references for further reading on chemical modification of CPMV and PVX: 13-15).\nConjugate dyes and PEG to tyrosines of TMV by diazonium coupling followed by copper(I)-catalyzed azide-alkyne cycloaddition.\n\t\nPrepare diazonium salt (alkyne) by mixing 400 μl of 0.3 M p-toluenesulfonic acid monohydrate, 25 μl of 3.0 M sodium nitrite, and 75 μl of 0.68 M distilled 3-ethynylaniline dissolved in acetonitrile at 4 °C for 1 hr.\nAdd 3.3 ml of borate buffer, pH 8.8, containing 100 mM NaCl to 1.25 ml of TMV (20 mg/ml stock solution).\nReact the TMV with 450 μl of the diazonium salt (alkyne) solution in an ice bath for 3 hr to add an alkyne ligation handle to TMV by diazonium coupling. The solution will turn into a light brown color. TMV has 2,140 available tyrosines for conjugation.\nPurify the final product using a sucrose cushion as described in step 4.4.",
    "Attach azide-functional Alexa Fluor 647 and PEG-azide (M.W. 5,000) using copper(I)-catalyzed azide-alkyne cycloaddition (CuAAC). Add 2 equivalents of dye- and PEG-azide per coat protein and incubate with 1 mM CuSO4, 2 mM AMG, and 2 mM sodium ascorbate at room temperature for 15 min. Adjust the buffer volume such that the final reaction concentration of TMV is 2 mg/ml. (The reader is referred to the following references for further reading on chemical modification of TMV: 16,17).\nConjugate dyes to lysines and PEG to cysteines of BMV cysteine mutant (cBMV):\n\t\nAdd 2,000 molar equivalents of Oregon Green 488 succinimidyl ester dissolved in DMSO to cBMV in 0.1 M TNKM buffer (50 mM Tris base, 50 mM NaCl, 10 mM KCl, 5 mM MgCl2, pH 7.4). Adjust the buffer and DMSO volumes such that the final concentration of BMV is 1 mg/ml and DMSO content is 10% of the total reaction volume. Incubate the reaction mixture overnight at 4 °C protected from light.\nPurify particles using centrifugal filters as described in step 4.4.\nAdd 2,000 molar excess of PEG-maleimide (M.W. 2,000) using the same reaction conditions as before and incubate the reaction mixture for 2 hr at 4 °C. cBMV has 180 reactive lysines and cysteines. (The reader is referred to the following references for further reading on chemical modification of BMV:18).\nPurification: Pass the solution through a 40% (w/v) sucrose cushion at 160,000 x g for 2.5 hr. Re-dissolve the pellet in buffer. Alternatively, dialyze against appropriate buffer using 10 kDa cut-off spin filters.\nCharacterization: PEGylated and fluorescently-labeled VNPs are analyzed using the above-described methods: UV/visible spectroscopy, SDS gel electrophoresis, FPLC, and TEM (not shown, however, refer to Figures 6 and 7) .\n5. Tumor Targeting and Imaging using a Mouse Xenograft Model",
    "Culture HT-29 human colon cancer cells in RPMI medium supplemented with 5% FBS, 1% penicillin-streptomycin, and 1% L-glutamine at 37 °C in 5% CO2 using 175 cm2 cell culture flasks.\nWash cells twice with sterile PBS and harvest by incubating with 5 ml of trypsin-EDTA at 37 °C for 5 min. Inactivate the trypsin with 5 ml of RPMI medium. Collect cells by centrifuging at 500 x g for 5 min. at 4 °C and resuspend in fresh RPMI at 5x106 cells/50 μl medium (determine total cell count using trypan blue and a hemocytometer). Mix with an equal volume of matrigel prior to injection (keep all solutions and reagents sterile).\nProcure six-week old NCR nu/nu mice and maintain them on an alfalfa free diet for 2 weeks. [Note: all animal procedures must be IACUC approved.] Induce tumor xenografts by subcutaneous injection of 5x106 cells/100 μl/tumor in the flanks (2 tumors/mouse) using an 18 1/2 gauge sterile needle. Monitor the animals regularly. Measure the tumor size using calipers and allow the tumors to grow to an average volume of 20 mm3 (within the next 12 days). Assign mice to two different groups randomly: PBS and VNP (n = 3 animals/group/time point). Using a 1 ml 28 gauge insulin syringe, administer by intravenous tail vein injection 100 μl of sterile PBS or 10 mg/kg VNP formulation.\nNote: Tissue culture experiments and studies with live animals will not be demonstrated. Hands-on demonstration will be limited to tissue processing and data acquisition. For a reference on the HT-29 tumor xenograft model, the reader is referred to ref. 19\nThree techniques are used to evaluate tumor homing of VNPs:",
    "Fluorescence imaging using Maestro Imaging System: Sacrifice mice at different time points (2, 24, and 72 hr) using CO2 gas. Dissect the animals and excise all major organs (brain, heart, lungs, spleen, kidneys and liver) along with the tumors on the flanks, place the tissues on parafilm, and analyze with fluorescence imaging instrument using yellow excitation and emission filters (800 ms exposure) to detect the presence of fluorescent signals in the tissues (derived from A647 label conjugated to the VNPs). Save the images and analyze fluorescent intensities using ImageJ 1.44o software (http://imagej.nih.gov/ij[href=http://imagej.nih.gov/ij]). Compare the pattern of uptake of the VNPs in tumors with other major tissues with time.\nAfter imaging, cut each tissue in half and embed one half in OCT compound for cryo-sectioning and confocal analysis. Collect the other half in pre-weighed cryo-vials and immediately freeze them using liquid N2. Store at -80 °C until ready for further processing.\nFluorescence quantification: Record tissues weights. Thaw frozen tissues at room temperature and place them in separate 50 ml Falcon tubes containing 1 ml of PBS. Using a handheld tissue homogenizer, homogenize the tissues for 2-3 min in PBS then transfer the homogenate to microfuge tubes. Centrifuge the homogenates for 10 min at 13,000 x g to remove non-homogenized tissue.\nPipet 100 μl of the supernatant from the tissues from each group (PBS and VNP formulations/time points) into a 384 well black UV plate. Evaluate fluorescence intensity (Ex/Em wavelengths 600/665) using a plate reader. Normalize the obtained fluorescent values by the tissue weights.\nImmunohistochemistry: Prepare cryo-microtome sections (10 μm) and store at -20 °C. Stain tissue sections for cell nuclei (DAPI) and endothelial cell marker (FITC-labeled anti-mouse CD31 antibody). Carry out confocal microscopy analysis to map the vascular and intra-tumoral localization of fluorescently-labeled VNPs.",
    "Note: This procedure will not be demonstrated, representative data are shown in Figure 8. For a reference on immunohistochemistry and the described staining methods, the reader is referred to ref. 19Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}