{
  "id": 10461,
  "origin_website": "Jove",
  "title": "Immobilization of Live Caenorhabditis elegans Individuals Using an Ultra-thin Polydimethylsiloxane Microfluidic Chip with Water Retention",
  "procedures": [
    "1. Strains and maintenance\nSelect a suitable strain of C. elegans and Escherichia coli (food) depending on the purpose of the experiment.\n\tNOTE: In the present paper, wild-type N210C. elegans (Figure 2A) is generally used, and HBR4:goeIs3[pmyo-3::GCamP3.35::unc-54 - 3'utr, unc-119(+)]V11 is only employed for imaging assay. E. coli OP50 was used as food for C. elegans. Some mutants with abnormal body shape, such as the unc-119(e2498) III mutant with a coiled shape (Figure 2B), also can be enclosed in the straight microfluidic channels (Figure 2C).\nMaintain the C. elegans at 20 °C on 6 cm Petri dishes containing 10 mL of nematode growth medium (NGM) spread with overnight-incubated (37 °C) E. coli as described previously10. If possible, synchronize the developmental stages of C. elegans from the embryo stage.\nUse well-fed adult animals, approximately 3-4 days after hatching with a width of about 50-60 µm, which are optimally suited to the size of the microfluidic channels in the worm sheets.\n2. Selection of buffer solution for on-chip immobilization\nFor wettable worm sheets, use any buffer solution depending on the purpose of the experiments.",
    "NOTE: Suitable buffer solutions for on-chip immobilization on PDMS microfluidic chips have been defined previously9 and the following buffer solutions were shown to have no effect on the motility of the animals after immobilization: S basal buffer solution (5.85 g of NaCl, 1 mL of cholesterol (5 mg/mL in ethanol), 50 mL of 1 M pH 6.0 potassium phosphate, H2O to 1 L; sterilized by autoclaving)10 containing a large amount of NaCl, M9 phosphate buffer solution (5 g of NaCl, 3 g of KH2PO4, 6 g of Na2HPO4, 1 mL of 1 M MgSO4, H2O to 1 L; sterilized by autoclaving)10, wash buffer solution (5 mL of 1 M pH 6.0 potassium phosphate, 1 mL of 1 M CaCl2, 1 mL of 1 M MgSO4, 0.5 g pf gelatin, H2O to 1 L; sterilized by autoclaving)12 containing gelatin, and ultrapure water9. In the present paper, wash buffer solution is typically used, and S basal buffer solution is only employed for evaluating on-chip immobilization using different cover films in the section 3.\nFor conventional microfluidic chips without wettability, use a wash buffer solution, which provides the most effective means of maintaining moisture in the microfluidic channels of the chip and thus prevents drying of C. elegans individuals (regardless of the wettability of the microfluidic chips).\n3. Selection of suitable cover film for on-chip immobilization\nPrepare different cover films as follows. Based on the ease of handling, cut the following transparent, biocompatible cover films to a suitable size (i.e., width of 10-15 mm and length of 30-50 mm): 130-170 µm thick cover glass, 125 µm thick polyester (PET) film, and ~130 µm thick polystyrene (PS) film.",
    "Perform 3 h on-chip immobilization using different cover films as follows. Based on steps 4.1-4.6, enclose ≥10 washed adult animals (3.5 days after hatching) in the worm sheet using each cover film, respectively, and leave for 3 h.\nFor comparison purposes, allow 3 h of free movement as follows. Place ≥10 washed adult animals on a 3.5 cm plate containing 3 mL fresh NGM, cover with a lid, and leave for 3 h.\nCollect animals immediately after 3 h of on-chip immobilization according to steps 5.1-5.3. Remove the cover film from the worm sheet and add a drop of buffer solution to each animal. Pick up animals swimming in the droplet using a platina picker and transfer them to a 3.5 cm plate containing 3 mL fresh NGM without food (assay plate).\nCollect animals after 3 h of free movement. Add a drop of buffer solution to each animal. Pick up animals swimming in the droplet on the NGM plate and transfer them to an assay plate using a platina picker.\nEvaluate the effects of cover film on motility (locomotion assay).\n\t\nAt least 5 min after transfer to the assay plate, count 'body bends' (deﬁned as the number of bends in the anterior body region at 20-s intervals) manually under a microscope13.\nCarry out locomotion assays five times independently for each cover film.\n\t\tNOTE: In the experiments shown in the representative results, 10 animals were evaluated for each experiment in which multiple animals were enclosed simultaneously, compared with only five animals counted in the previous study13.",
    "Calculate the average number of body bends for the 10 animals in each group for each experiment. Then average the values from five independent experiments to evaluate the eﬀects of on-chip immobilization. Analyze the data statistically using a one-way analysis of variance (ANOVA) test in a spreadsheet software at significance levels of 0.01 and 0.05.\n\t\tNOTE: Based on these experiments, a PS cover film with high oxygen permeability was deemed suitable (see the representative results). These PS films are included with the worm sheets. PET film, which has low oxygen permeability, was not deemed suitable because the animals tended to suffocate if covered with it during long-term immobilization on the worm sheets. It is also important that the cover film does not break during a series of procedures; glass covers were therefore also unsuitable (see the representative results).\n4. On-chip immobilization\nNOTE: Disposable, sterile gloves should be worn to avoid contaminating the worm sheets.\nPlace a thin transparent sheet such as a PS or glass cover film which has no autofluorescence, for use as a bottom cover film, onto the experimental desk or the microscopic stage. Place a worm sheet gently onto the bottom cover film using flat tweezers.\n\tNOTE: In addition to the worm sheets with 60 µm-wide microfluidic channels (suitable for adults 3-4 days after hatching), sheets with 50 µm-wide channels (suitable for young adults 3 days after hatching and mutants with small body in adult stage) can also be employed. Select a suitable sheet based on the size of the animals to be used.\nTo collect animals, pick up an individual adult C. elegans from the culture plate under a stereomicroscope using a platina picker. Repeat the process if multiple animals are needed.\nWash animals to remove food (bacteria).",
    "Place at least three droplets (5 µL drops) of buffer solution on the surface of a 6 cm non-treated (water-repellent) Petri dish.\nTransfer the animals to a droplet using a platina picker and allow them to remove any food by swimming. Wash them twice in two separate droplets, and then rinse the animals in another droplet.\n\t\tNOTE: It is necessary to practice this procedure to be able to perform it quickly before carrying out any experiments.\nDrop 2-3 µL of buffer solution onto the surface of a worm sheet. Pick up the washed animals from the droplet on the Petri dish and transfer them to the droplet on the worm sheet.\nEnclose animals in microfluidic channels as follow. Place a PS cover film over the worm sheet using flat tweezers and press gently over the channels from one end of the sheet to the other to maintain humidity (as described previously4,9).\n\tNOTE: Animals are randomly enclosed in the channels. Droplets containing animals are spread across the worm sheet by covering the sheet, resulting in droplets being widely extended over several channels. Each animal can be enclosed in any one of these channels. The important point regarding the use of the worm sheet for on-chip immobilization is that multiple channels are available over a wide area.\nImmediately after enclosing the animals in the microfluidic channels, confirm that they are alive by checking for movement of the head under a microscope (e.g., 1x or 2x magnification).\nRecord animal's position, at the same time as carrying out step 4.6 and note the following on a dedicated sheet of paper (Supplementary File 1): number of the channel in which the animal is enclosed; position of each animal in the channel (left/center/right); and direction of the head.",
    "Draw an arrow to mark the position of each animal in the channel, with the direction of the arrow corresponding to the animal's head.\n\tNOTE: The channel numbers (e.g., 1, 5, 10, 15, 20, 25) are engraved on the surface of the worm sheet near the left and right edges of the microfluidic channels (Figure 1B). This information on the dedicated sheet allows animals to be located quickly, making the process more efficient, and also helps to prevent radiation leakage during subsequent steps.\n5. Collection of animals from a worm sheet\nImmediately after immobilization, remove the cover film from the worm sheet using flat tweezers.\nDrop 10-15 µL buffer solution onto the microfluidic channels enclosing the animals and observe the animals starting to swim in the droplets under a stereomicroscope.\n\tNOTE: The animals start swimming in the new droplet on their own without any additional pressure, help, or push. Just dropping some buffer on top of them is enough to make them swim out of the channel. An animal may be unable to swim in a droplet if it has been vitally damaged by irradiation in step 7.9 or by the immobilization process in steps 4.2-4.5, though this is rare. In addition, if the animal remains attached to the cover film when it is removed, add the droplets onto the cover film instead of into the channels.\nPick up the animals swimming in the droplet using a platina picker and place them on an assay plate.\n6. Application of worm sheets for imaging observations",
    "NOTE: Worm sheets can be widely used in microscopic observations. The chip can retain water and does not affect the motility of C. elegans individuals after 3 h of on-chip immobilization9. In addition, the chip itself has no autofluorescence, making it suitable for use in fluorescence imaging assays. A sample application for fluorescence imaging assay is given below.\nSelect a fluorescence microscope and mount a digital camera or digital video camera on the microscope to capture images or videos, respectively (Figure 3A).\n\tNOTE: The working distance (WD) of microscope is more than 0.2 mm depending on objective lens specification (see Figure 3B,C). The specification of the fluorescence microscope system used in this paper is shown in the Table of Materials. However, the specification is not limited to our example because it depends on the purpose of observation or/and users.\nSelect any fluorescent strain of C. elegans and maintain as described in section 1.\n\tNOTE: If it is necessary to observe the body-wall muscular contraction (see representative results), use young adult HBR411C. elegans, in which a reporter gene is used to express the calcium indicator GCaMP3.35 in all body-wall muscle cells. It is important to use young adults (≤3 days after hatching) that are thinner than the width of the microfluidic channels (50 or 60 µm) of the worm sheet. The small degree of clearance means that the animals can bend slightly, making it possible to observe the muscular contraction and extension during crawling, using a calcium-ion indicator.\nCarry out enclosure of animals according to the immobilization procedure in section 4.\nObserve fluorescent spots of animals (e.g., green fluorescent protein-labeled strains) using a fluorescence microscope, and capture images using a digital camera mounted on the microscope.",
    "NOTE: Follow the previously established methods14,15,16, since the microscope observation methods (including fluorescence observation) and the specification of the microscope system depends on the purpose of the observation.\nImage calcium-ion wave propagation using video acquisition to observe dynamic activities, such as the body-wall muscular contraction and extension in the HBR4 worms (Video 1).\n7. Application of worm sheets for microbeam irradiation\nNOTE: The collimating microbeam irradiation system5 can use several heavy-ion particles accelerated from the azimuthally varying field cyclotron installed at the Takasaki Ion Accelerators for Advanced Radiation Application (TIARA) facility of QST-Takasaki (Figure 4A). There is an automatic stage for irradiation under the beam exit (Figure 4B). The procedure for heavy-ion microbeam irradiation of C. elegans using this system is as follows.\nLocate the worm sheet enclosing multiple animals on an aluminum frame custom-made for the microbeam-irradiation facility and set it on the automatic stage for irradiation (Figure 4C).\nRaise the irradiation sample (i.e., animals enclosed in a worm sheet on a frame), to immediately under (~2 mm) the beam exit based on the monitor image from a microscope located under the automatic stage (Figure 4D).\nAfter vertical positioning, locate each animal to target with the microbeam irradiation using the custom-made software for targeted irradiation of animals and cell cultures. To locate each animal enclosed in the microfluidic channel, refer to the dedicated sheet described in step 4.7-4.8 (see Supplementary File 1) and confirm the channel number near the left and right edges of the channels.\nControl the automatic stage in the X and Y directions to position the animals just under the beam exit using a remote-control system and a laser mouse operated with the irradiation software.",
    "Roughly tune the irradiation area by watching the projection from the microscope located under the automatic stage of the sample and moving the cursor to the irradiation position of the animal to be targeted.\nAfter rough positioning, exit and close the irradiation room and move to the adjacent control room to avoid irradiating the operators.\nSet the desired number of ion particles for one irradiation procedure, corresponding to irradiation of a specific region of the animal, using the console linked to an ion-counter system.\n\tNOTE: This consists of a plastic scintillator and a photoelectron multiplier in the collimating microbeam irradiation system.\nFrom the irradiation-control room, fine-tune the position of the animals based on the monitor image from the microscope located under the automatic stage, which is the same image projected on the monitor in the irradiation room (Figure 4E).\nTarget the microbeam irradiation by click the irradiation button of the software for irradiation.\n\tNOTE: In the example shown in Figure 4F, we target the pharynx in the head region and irradiate with the appropriate number of microbeam carbon ions. Because the number of ion particles passing through the sample is counted using an ion-counter system linked to the console and the irradiation software, the irradiation is stopped after delivery of the desired number of ion particles.\nLocate each animal recorded on the dedicated sheet and carry out targeted irradiation to each animal. Repeat steps 7.8 and 7.9 until all animals have been irradiated.\nImmediately after irradiation, enter the irradiation room and lower the automatic irradiation stage. Remove the sample on the custom-made frame located on the automatic stage.\nCollect the animals as described in steps 5.1-5.3.\nCarry out behavioral and/or molecular analyses as required to evaluate the effects of the targeted irradiation, depending on the purpose of the study.",
    "NOTE: The locomotion assay described in step 3.6 is an effective method for evaluating the effects of irradiation on motility4,9.\n8. Treatment of worm sheets for repeated use\nNOTE: Worm sheets can be used repeatedly at least 10 times9 with no adverse effects on the animals if cleaned and sterilized properly after use as follows.\nCleaning\nPlace the used worm sheet on a 6 cm Petri dish and drop about 100 µL of sterilized ultrapure water onto the whole sheet.\nPaddle the water on the surface of the sheet using gloved fingers to wash off dirt such as dust, bacterial food, and any eggs laid in the channels.\nWipe the moisture off the worm sheet thoroughly using disposable wipes.\nSterilization\nInject about 5 mL of 70% ethanol into the Petri dish containing the worm sheet and paddle the surface of the sheet using gloved fingers to wash off the dirt.\nDrying\nRemove the chips from the Petri dish filled with 70% ethanol and allow to dry naturally.\nStorage\nAfter drying, place the worm sheet on a sterile Petri dish and cover it. Sheets can also be stored on a sterile Petri dish filled with 70% ethanol.\n\t\tNOTE: It is better to dispose of the cover films after use, but if they are to be re-used, clean them as done for the worm sheet. However, if folds develop on the cover film after use it will no longer adhere to the chip, resulting in dehydration of the animals, and it should therefore be replaced.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}