{
  "id": 3944,
  "origin_website": "Cell",
  "title": "Rapid and inexpensive preparation of genome-wide nucleosome footprints from model and non-model organisms",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPrepare cross-linked cells\nTiming: [20−30 min]\nIn this step, formaldehyde is used to capture interactions between DNA and nucleosomes. The crosslinking reaction is then quenched by glycine. For yeast, cells are generally crosslinked with formaldehyde to maintain nucleosome positions throughout the subsequent steps, though it has been debated whether these crosslinks can efficiently trap nucleosome positions without introducing artifacts (Henikoff et al., 2011[href=https://www.wicell.org#bib11]; Cole et al., 2012[href=https://www.wicell.org#bib3]). It may be preferable to crosslink cells on the same day as growth, though we have achieved good results with the method below. Due to natural variation in cells, we recommend performing the experiment on three biological replicates.\nMNase-seq of mammalian cells does not require crosslinking. We performed experiments on the cell line PLB-895 (Tucker et al., 1987[href=https://www.wicell.org#bib24]) both with and without crosslinking and there was no noticeable difference in visualization of nucleosome footprints (Figure 6[href=https://www.wicell.org#fig6]), though we recommend doing a side-by-side comparison when working with a new cell type for the first time, if possible.\nThaw MNase digestion buffer on ice; you will need 100 μL per sample plus another 10 μL per 10 samples to dilute the ExoIII.\nResuspend cell pellet in 1 mL of deionized water.\nNote: Crosslinking is optional for mammalian cells; if skipping this step, proceed directly to step 8\nAdd 27 μL of 37% formaldehyde to a final concentration of 1%. Rotate end-over-end for 15 min at 25°C.\nWhile the cells are cross-linking, prepare spheroplast buffer; you will need 1 mL per sample with 2 mg zymolyase per mL.\nTo quench the crosslinking reaction, add 50 μL of 2.5M glycine for a final concentration of 125 mM.\nPellet at 20,000 × g for 1 minute in a microcentrifuge and remove supernatant carefully.",
    "Pause Point: At this point, cells can be flash frozen in liquid nitrogen and stored at −80°C. Samples are stable for at least 2 or 3 months at −80°C; we have not tested longer storage times.\nMake spheroplasts and digest chromatin\nTiming: [3−4 h]\nIn this step, the cell walls of fungi are broken and nuclei are permeabilized to allow micrococcal nuclease (MNase) to access and digest extranucleosomal DNA. Permeabilization is required for fungi but not for mammalian cells, C. elegans, or D. rerio; for non-fungal samples proceed directly to step 8. [Troubleshooting Problem 1:]\nAfter permeabilization, accessible regions of genomic DNA are digested by MNase, and the ends of the resulting nucleosome fragments are trimmed by Exonuclease III to reduce variation in size, which enables consistent, high-resolution identification of the nucleosome dyad at the center of the core particle. [Troubleshooting Problem 2:]\nCellular RNA is removed, formaldehyde crosslinks are reversed, and protein is digested prior to DNA purification. Finally, the residual 3’ phosphates (from MNase cleavage activity) are removed prior to genomic library construction.\nResuspend the pellet of crosslinked cells (fresh or previously frozen) in 1 mL spheroplast buffer plus 2 mg zymolyase to permeabilize the cell walls. Rotate at 25°C for 15 min.\nWhile the sample incubates, dilute ExoIII 1:10 (from 100 U/μL stock) in MNase digestion buffer; you will need 3 μL of diluted ExoIII per sample. Keep on ice.\nThaw MNase (3 μL per sample), RNase (3 μL per sample), and Proteinase K (10 μL per sample) on ice.\nNote: For yeast taken directly from a plate, increase spheroplasting incubation time to 30 min. For purified Q cells, spheroplast for 60 min and increase the amount of zymolyase to 10 mg.\nPulse-pellet (15 seconds at 20,000 × g); carefully remove supernatant.",
    "Add 100 μL digestion buffer + 3 μL MNase (20 U/μL; 60U total) + 3 μL ExoIII (10 U/μL). Incubate at 37°C for 10 min to digest chromatin.\nNote: For yeast from a plate, use 1.5μl MNase. For Q cells, use 0.2μl MNase and incubate for 2–10 min (see troubleshooting 3[href=https://www.wicell.org#sec7.5] for more information on optimizing this protocol for Q cells).\nCritical: Exact timing of digestion across samples is essential for consistency. To achieve an identical start time for digest, we recommend pipetting the MNase into the open lid of the microcentrifuge tube, and then briefly spinning all the tubes down so that the enzyme reaches each sample at precisely the same time.\nStop digestion with 12.5 μL STOP buffer.\nNote: We have eliminated SDS from the STOP buffer and switched the order of the Proteinase K and RNAse A steps in order to streamline the protocol. Traditionally, SDS was included in the STOP buffer and then Proteinase K was added (Rodriguez et al, 2014[href=https://www.wicell.org#bib20]); both of these components are used to break down protein in the sample, but they also inactivate RNAse, necessitating an additional purification step before proceeding to the RNAse step. In our version, EDTA and EGTA are sufficient to halt crosslinking, and no extra purification is needed.\nAdd 3 μL RNase A (10 mg/mL stock). Incubate at 42°C for 30 min.\nAdd 12.5 μL 10% SDS + 10 μL Proteinase K (20 mg/mL stock) to digest protein and reverse crosslinks. Incubate at 65°C for 45 min.\nNote: For uncrosslinked mammalian cells, the incubation time is reduced to 15 min",
    "Add 700 μL Buffer PB (from Qiagen kit). Purify using a single Qiagen MinElute PCR column. Follow protocol instructions, with the exception of the elution step. Elute with 12 μL 1× CutSmart buffer (NEB; diluted from 10× stock)\nNote: For wild mushrooms, after adding Buffer PB centrifuge the sample for 2 min at 20,000 × g to further clear remaining cellular debris. Apply the supernatant to the MinElute column.\nAdd 1 μL Quick CIP. Incubate for 10 min at 37°C.\nAdd 7 μL Orange Loading Dye (NEB) and run the entire sample on a 2% agarose gel.\nCritical: The use of Orange Loading Dye and a 2% gel is required for visualization and separation of the digested bands.\nNote: Using a 7cm × 10cm or 15cm × 10cm TAE-agarose gel in TAE, it takes approximately 40 min at 100V to get proper separation of bands\nCut out the mononucleosome band, gel extract with a Qiagen MinElute column. Follow protocol instructions, with the exception of the elution step. Elute with 12 μL EB.\nQuantify with PicoGreen or other preferred method; store at −80°C. DNA yield typically ranges from 10-50 ng total. This sample is now ready for preparing libraries; we use 5 ng of input with the Ovation Ultralow Library System V2 (from NuGEN), though we have successfully sequenced libraries prepared from as little as 0.5 ng input. There are a variety of options for preparation of libraries, and this protocol can likely feed into whatever pipeline you are currently using. We have not tested how long samples are stable at −80°C, but we usually prepare library samples within a month."
  ],
  "subjectAreas": [
    "Genomics",
    "Molecular Biology",
    "Sequencing",
    "Model Organisms"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}