{
  "id": 5507,
  "origin_website": "Bio",
  "title": "Nuclei Isolation from Nematode <em>Ascaris</em>",
  "procedures": [
    "Isolation of embryos from Ascaris Ascaris embryos dissectionNote that the anterior end of the female worms is thinner. Looking posterior from the anterior end, identify the genial girdle and cut female worms at or just posterior to the genital girdle (see Figure 1A). Males are typically smaller than females and have a strongly curved posterior (see Figure 1B).Gently pull the uteri completely out while holding on the posterior portion of the female until you feel tension. Examine the length of uterus, make cut and collect the proximal ¼ of the uterus into PBS (pH 7.0) in a ~1 L beaker on ice. The length of the proximal region will vary as the overall size of individual female worms can be quite variable (see Figure 1C).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170427/20170427015130_3306.jpgFigure 1. Ascaris embryo dissection. A. Female Ascaris. Light blue arrow indicates the genital girdle; Red arrow is the cutting area. B. Male Ascaris (left) vs. female Ascaris (right), male Ascaris are smaller and have a strong curve in the posterior (black arrow) (Modified from https://en.wikipedia.org/wiki/Ascaris_suum[href=https://en.wikipedia.org/wiki/Ascaris_suum]). C. Illustration of female worm cut at the genital girdle with the uteri pulled out. The proximal ¼ (white arrow) of the uterus is collected into PBS.Dispose of distal 3/4 of uterus.Rinse pooled uteri in a beaker three times with ice-cold PBS, pH 7.0 (hand over end to rinse; measure uterus volume in the beaker) (see Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170427/20170427015336_0035.jpgFigure 2. Rinsed pooled Ascaris uteriTreat uteri with 0.5 N NaOH for ~1 h with gentle stirring at room temperature to keep the material suspended.The ratio of uteri/NaOH is ~50 ml packed uteri/0.6 L of 0.5 N NaOH. Stir to keep all material suspended.Allow ~45 min for solution to settle by gravity.Decant the solution slowly and carefully (as a safety precaution, decanted solution should be autoclaved before discarding).",
    "Note that there is often some white floating material present when you decant that you can pour out. The eggs stay down and when you see them nearing the spout stop decanting.Repeat the 0.5 N NaOH treatment and decant the supernatant.Transfer the egg suspension into 225 ml Falcon bottles. Collect the embryos at 1,250 x g for 10 min at 4 °C.Wash the embryos with ice-cold MilliQ water 3-4 times by spinning at 1,250 x g for 10 min at 4 °C.Wash with ice-cold PBS (pH 2.0) and collect the embryos at 1,250 x g for 10 min at 4 °C, finally resuspend and store the embryos in 5 volumes of ice-cold PBS (pH 2.0).Store at 4 °C (The embryos can be stored at 4 °C for at least 3-5 years) (see Figure 3). Note: Typical embryo yield for proximal uteri is ~20-25 ml/500 worms.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170427/20170427015451_8169.jpgFigure 3. Ascaris embryos. Keep Ascaris embryos in 5 volume of ice-cold PBS, pH 2.0. Store at 4 °C.Ascaris embryonation to prepare developmentally staged embryos for nuclei isolationResuspend embryos and remove a volume of suspension appropriate for the experimental purpose (see Table 2 for the amount of nuclei to be used in different types of experiments).Note: Packed embryo volume will decrease by 60% after removal of the chitinous shell (Coat removal) and washing.Spin down embryos at 1,250 x g for 5 min at room temperature and discard supernatant.Wash embryos with 50 ml of PBS, pH 2.0, spin as above and discard supernatant.Resuspend embryos in ~20 volumes PBS, pH 2.0, and place them in sterile, disposable Erlenmeyer flask with cap on loose to facilitate aeration. Note: Volume of PBS should be no more than 30% of the flask. For example, the maximum volume of PBS should be 75 ml for 250 ml flask.",
    "Incubate embryos in an incubator at 30 °C shaking at 100 rpm for desired time of development (see timing of development Table 1).Table 1. Ascaris embryonation times at 30 °C with shakingtable:",
    "﻿0,1,2\nDevelopment time,Predominant stage,Other notes\n0 h,1 cell,Prior to pronuclear fusion\n24 h,1 cell,Pronuclei are fused\n46 h,2 cell,2-cell (82%)\n62-63 h,2-4 cell,\"2-cell (16%), 4-cell (49%), and 4-cell + (35%)\"\n96 h,10-26 cell,> 90%\n114 h,32-64 cell,",
    "Examine embryos microscopically to ensure that the embryos have developed to the desired stages.Note: Embryos through the 8-cell stage of development can be easily staged via light microscopy, whereas later stages typically require DAPI nuclear staining via fluorescence microscopy to define the cell number and developmental stage (Wang et al., 2014).Chitinous shell (coat) removal of Ascaris embryosPellet embryos (from step A2) in 15 or 50 ml Falcon tubes at 1,250 x g for 5 min at room temperature. Remove supernatant.Resuspend embryos in 15-20x pellet volumes or 50 ml of freshly made 0.4 N KOH/1.4% sodium hypochlorite (solution should be pre-warmed to 30 °C).Transfer suspension back to original Erlenmeyer flask and incubate for 90 min at 30 °C in incubator shaker with shaking at 100 rpm. Pellet embryos in 15 or 50 ml Falcon tubes at 1,250 x g for 5 min at room temperature.Wash embryos 5 times with 15-20x pellet volumes of ice-cold PBS, pH 7.0 by gentle resuspension and centrifugation as in step A1d.Estimate packed embryo volume from pelleted embryos. The volume of final embryos after decoating is typically about 60% of the starting volume (see Figures 4A and 4B).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170427/20170427020151_4331.jpgFigure 4. Ascaris embryos. A. One cell stage Ascaris embryo. There is thick chitinous shell (coat) outside the embryo membrane. B. One cell stage Ascaris embryo after coat removal. Chitinous shell is removed and embryo membrane is still there. C. Ascaris embryos after homogenate.Preparation of Ascaris tissue for nuclei isolationAscaris dissectionAscaris can be collected from a pig slaughterhouse and placed in 30 °C PBS (pH 7.0) while being transported to the lab. It is important to keep the worms at 30 °C to maintain viability. Note: Ascaris can be kept alive in 30 °C PBS, pH 7.0 for at least 2-3 days.",
    "However, it is better to dissect the worms on the same day to get fresh tissues.Rinse worms with warm PBS, pH 7.0.Male Ascaris can be dissected to obtain spermatids, intestine, testis, and the remaining tissue (the carcass, which includes muscle, hypodermis, pharynx, and neurons). Female Ascaris can be dissected to obtain ovary/oviduct, oocytes, uterus, intestine, and carcass. Tissues should be frozen in liquid nitrogen (without PBS), and stored at -80 °C. Note that the reproductive systems can be up to a meter long and different regions can be identified and subdivided for analysis.Nuclei isolationNuclei isolation from Ascaris embryos.Suspend ~900 μl of decoated embryos in 10 ml of nuclei extraction buffer A and centrifuge at 1,200 x g for 5 min at 4 °C. Note that ~10 million embryos can be obtained from ~1 ml packed decoated embryos (~20 mature female Ascaris). The number of nuclei will depend on the developmental stage of the embryos. (See Table 2 for the amount of nuclei necessary for different types of experiments.)Table 2. Protein, RNA, and DNA content as a function of Ascaris nuclei and amounts needed for ChIP experimentstable:",
    "﻿0,1,2,3,4\nExperiments,Nuclear protein (10 μg),Nuclear RNA (10 μg),DNA (10 ng),ChIP/ChIP-seq\nNuclei,~105,~105,~104,~106",
    "Remove supernatant. Resuspend the 900 μl cell pellet in 10 ml of ice-cold nuclei extraction buffer B with 0.5 mM PMSF and cOmpleteTM protease inhibitor cocktail. Transfer the suspension into a 15 ml WHEATON metal dounce homogenizer kept on ice.Homogenize with 10 passes. Note: Examine embryos under a microscope to make sure over 80% are broken. If not, homogenize further (see Figure 4C).Transfer the suspension to 15 ml Falcon tubes and spin at 750 x g for 10 min at 4 °C in Sorvall Legend XT with swinging bucket rotor. Remove supernatant.Notes: Comparison of the number of nuclei in the supernatant to pellet (equivalent volumes) should show very high nuclei enrichment in pellets (some nuclei remain in supernatant).If you want to collect a cytoplasmic extract, retain the supernatant. For cytoplasmic extracts, we typically clarify the supernatant at 21,000 x g at 4 °C for 15 min, transfer aliquouts to pre-cooled microfuge tubes, freeze the tubes in liquid nitrogen, and store at -80 °C. Resuspend nuclear pellets in 10 ml of ice-cold nuclei extraction buffer A, centrifuge at 750 x g for 10 min at 4 °C in Sorvall Legend XT with swinging bucket rotor. Repeat twice and after the 3rd centrifugation step remove as much supernatant as possible from the nuclear pellet.Resuspend pellets in 10 ml of ice cold nuclei extraction buffer C, centrifuge at 2,000 x g for 15 min at 4 °C in Sorvall Legend XT in swinging bucket rotor. Remove supernatant and examine supernatant for nuclei. The majority of nuclei should be in pellet.The isolated nuclei can be used immediately or frozen in storage buffer in liquid nitrogen and stored at -80 °C for future experiments.Note: See isolation of Ascaris embryos, embryonation, and preparation of embryos for nuclei isolation in Procedure C.",
    "Nuclei isolation from Ascaris tissueGrind Ascaris tissue from 3-5 worms (~105-106 nuclei, depends on differences in the tissues) to a fine powder in liquid nitrogen using mortar and pestle. (See Table 2 for amount of nuclei should be used for different purpose of experiments.)Wash Ascaris tissue powder in 10 ml of ice-cold PBS and centrifuge at 1,200 x g for 5 min at 4 °C. Repeat step C2b twice.Isolate nuclei as described above in Procedure A. Note: The volume of buffer at each step should be optimized based on volume of tissue powder, use the same amount of buffer as used for the decoated embryos."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}