{
  "id": 19908,
  "origin_website": "Wiley",
  "title": "Expansion Microscopy for Beginners: Visualizing Microtubules in Expanded Cultured HeLa Cells",
  "procedures": [
    "Key steps involved in the expansion microscopy of fixed and immunostained HeLa cells are shown in Figure 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0001], and step-by-step instructions are provided below. Note that all steps up to the gelation (step 31) are performed on cells cultured on 13-mm-diameter coverslips placed in wells of a 24-well plate. All the measures described below are for one well of a 24-well plate; the measures should be scaled up linearly when handling multiple wells. Because of the time-sensitive nature of the gelation process (steps 29 and 30), we recommend that beginners perform this protocol working with no more than two wells simultaneously. Please refer to the Reagents and Solutions section for details on the preparation of reagents and solutions described in the protocol.\nMaterials\nActively growing culture of HeLa cells (ATCC, cat. no. CCL-2) in cell culture medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-rec-0004]) in T-75 culture flask\nDulbecco's phosphate-buffered saline (DPBS) without calcium and magnesium (Thermo Fisher, cat. no. 14190136; store at room temperature for up to 36 months from the date of manufacture)\nTrypsin-EDTA solution (Thermo Fisher, cat. no. 25300054; store 3-ml aliquots at −20°C for up to 24 months from the date of manufacture)\nCytoskeleton extraction buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-rec-0004])\nMicrotubule fixation solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-rec-0006])\nReduction solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-rec-0009])\nQuenching solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-rec-0008])\nImmunostaining media kit (Active Motif, cat. no. 15251), containing MAXblock blocking medium, MAXbind staining medium, and MAXwash washing medium (store media up to 6 months at 4°C)\nPrimary antibody (rabbit polyclonal antibody to β-tubulin, Abcam, cat. no. ab6046; store per manufacturer's guidelines)\nSecondary antibody (goat anti-rabbit IgG (H+L) highly cross-adsorbed secondary antibody, Alexa Fluor 546 conjugate, Thermo Fisher, cat. no. A11035; store per manufacturer's guidelines)\n6-((Acryloyl)amino)hexanoic acid, succinimidyl ester (AcX) stock solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-rec-0001])\nPhosphate-buffered saline (PBS; Corning, cat. no. 21-040-CV)",
    "Monomer solution (\"Stock X\"; see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-rec-0007] for preparation and storage), pre-chilled on ice before performing step 29\nN,N,N′,N′-Tetramethylethylenediamine (TEMED) stock solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-rec-0010] for preparation and storage), pre-chilled on ice before performing step 29\nAmmonium persulfate (APS) stock solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-rec-0002] for preparation and storage), pre-chilled on ice before performing step 29\nDeionized water\nDigestion buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-rec-0005])\nProteinase K (ProK; NEB, cat. no. P8107S; store per manufacturer's guidelines)\nPoly-L-lysine solution (0.1% (w/v), Sigma Aldrich, cat. no. P8920-100ML; stored up to 6 months at room temperature)\nWater bath, 37°C, for warming cell culture reagents and solutions\nHumidified cell culture incubator, set at 37°C and 5% CO2\nBucket of ice\nBiosafety cabinet\nT-75 cell culture flasks (Corning, cat. no. 430641)\nCell counter (e.g., Invitrogen Countess II automated cell counter) or hemocytometer (e.g., Bulldog Bio, cat. no. DHC-N01)\nVortex mixer\nChemical fume hood, for cell fixation (steps 11-14)\n13-mm-diameter round coverslips (Thermo Fisher, cat. no. 174950)\n24-well cell culture plates (Greiner Bio-one, cat. no. 662160)\nParafilm (VWR, cat. no. 52858-000)\nKimwipes (VWR, cat. no. 21905-026)\nFluorescence microscope\n22 × 22–mm square no. 1.5 coverslips (Brain Research Lab, cat. no. 2222-1.5)\n25 × 75–mm rectangular plain glass slides (VWR, cat. no. 48300-026)\nReverse-action forceps (VWR, cat. no. 89259-942)\nSyringe needles (VWR, cat. no. BD-305196)\nClean, used pipet tip box containing empty pipet tip-holding insert\n37°C incubator, for gelation\nRazor blades (VWR, cat. no. 55411-050)\n100 × 20–mm petri dish (Corning, cat. no. 353003)\nOrbital shaker\nSize 1/2 paintbrush (Utrecht, cat. no. 09311-5012)\n22 × 50–mm rectangular no. 1.5 coverslips (Brain Research Lab, cat. no. 2250-1.5)\nSize 6 paintbrush (Utrecht, cat. no. 09013-1006)\n6-well glass-bottom plate (CellVis, cat. no. P06-1.5H-N)\nDay 1: Cell culture",
    "IMPORTANT NOTE: Perform all cell culture steps in a biosafety cabinet to ensure sterility. Prewarm cell culture medium, trypsin-EDTA solution, and DPBS (without calcium and magnesium) to 37°C before cell culture experiments. The cells need to be passaged or plated when a plate reaches ∼70% confluency. A detailed mammalian cell culture protocol can be found in Phelan (2007[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-bib-0013]).\nThe estimated experimental time on Day 1 is 2 hr.\nPassaging HeLa cells\n1. Aspirate the cell culture medium from a T-75 flask containing growing HeLa cells.\n2. Add 2 ml prewarmed DPBS (without calcium and magnesium) to briefly rinse the cells, then aspirate the DPBS solution to remove all traces of cell culture medium (which contains trypsin inhibitors).\n3. Add 2 ml prewarmed trypsin-EDTA solution to the flask and incubate the flask for 5 min in the 37°C, 5% CO2 incubator, so that the cells detach from the flask surface.\nTo avoid clumping, do not agitate the cells by hitting or shaking the flask while waiting for the cells to detach.\n4. Add 8 ml prewarmed cell culture medium to the flask; gently pipet the solution up and down five times, ∼7 ml volume each time, to resuspend the detached cells in the cell culture medium.\n5. To a fresh T-75 flask, add 2 ml of the cell solution from step 4 and 8 ml prewarmed cell culture medium; gently pipet the solution up and down five times, ∼7 ml volume each time.\n6. Incubate the HeLa cells in the T-75 flask in the 37°C, 5% CO2 incubator until the next passage or plating.\nPlating HeLa cells on coverslips\n7. Detach cells from the T-75 flask by following steps 1-4 of the protocol for passaging HeLa cells.",
    "8. Determine the cell concentration using a cell counter (e.g., Invitrogen Countess II automated cell counter) following the manufacturer's protocol, or a hemocytometer (e.g., Bulldog Bio, cat. no. DHC-N01) following Figure A.3B.1 and related steps in Phelan (2007[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-bib-0013]).\n9. Dilute the cells with prewarmed cell culture medium to a concentration of 50,000 cells/ml.\n10. One day before you plan to begin step 11, insert a 13-mm-diameter coverslip into one well of a 24-well plate and add 1 ml of the diluted cell solution. Incubate the plate in a humidified, 5% CO2 incubator at 37°C.\nThe cells in the 24-well plate will reach ∼70% confluency on Day 2 of the protocol.\nDay 2: Cell fixation, immunostaining, and AcX treatment\nThe following cell fixation and immunostaining steps are optimized for microtubules in HeLa cells and may not be applicable to other samples. See the introduction for references to other protocols for fixation and immunostaining of other types of specimens.\nThe estimated experimental time on Day 2 is 8 hr.\n11. Aspirate the cell culture medium, and then add 500 µl cytoskeleton extraction buffer and incubate 1 min at room temperature.\n12. Aspirate the cytoskeleton extraction buffer, add 1 ml microtubule fixation solution, and incubate 10 min at room temperature.\n13. Aspirate the microtubule fixation solution, add 1 ml reduction solution, and incubate 7 min at room temperature.\n14. Aspirate the reduction solution, add 1 ml quenching solution, and incubate 10 min at room temperature.\n15. Aspirate the quenching solution, add 300 µl blocking medium (MAXblock blocking medium), and incubate 2 hr at room temperature.\n16. Aspirate the blocking medium, add 1 ml washing medium (MAXwash washing medium), and incubate 10 min at room temperature.",
    "During this incubation, prepare the primary antibody solution by diluting 3 µl of primary antibody with 297 µl of staining medium (MAXbind staining medium) in a 1.5-ml microcentrifuge tube (1:100 dilution) and mixing the solution by pipetting up and down five times, ∼300 μl volume each time.\n17. Aspirate the washing medium, add the primary antibody solution, and incubate 2 hr at room temperature.\n18. Aspirate the primary antibody solution, add 1 ml washing medium, and incubate 10 min at room temperature.\n19. Aspirate the washing medium, add 1 ml washing medium, and incubate 10 min at room temperature.\n20. Repeat step 19 for an additional two wash cycles.\n         \nDuring the last period of washing, prepare the secondary antibody solution by diluting 3 µl secondary antibody with 297 µl staining medium in a 1.5-ml microcentrifuge tube (1:100 dilution) and mixing the solution by pipetting up and down five times, ∼300 µl of volume each time.\n21. Aspirate the washing medium, add the diluted secondary antibody solution, and incubate 2 hr at room temperature in the dark (e.g., by wrapping with aluminum foil).\n22. Aspirate the secondary antibody solution, add 1 ml washing medium, and incubate 10 min at room temperature in the dark.\n23. Aspirate the washing medium, add 1 ml fresh washing medium, and incubate 10 min at room temperature in the dark.\n24. Repeat step 23 for an additional two wash cycles.\n         \nBefore proceeding to step 25, check the cell fixation and immunostaining outcome by imaging the sample using a fluorescence microscope. The successfully fixed and immunostained microtubules should show as bright, continuous, but blurry lines with low background fluorescence (an example is shown at the end of the protocol).",
    "25. Aspirate the washing medium, add 1 ml PBS, and incubate 5 min at room temperature in the dark.\n         \nDuring this 5-min incubation, dilute the AcX stock solution in PBS as follows: add 3 µl AcX stock solution to 297 µl PBS for a total volume of 300 µl (1:100 dilution) in a microcentrifuge tube, and mix the solution by pipetting up and down five times, ∼300 µl volume each time.\n26. Aspirate the PBS, add the diluted AcX solution, and incubate overnight (>6 hr) at room temperature in the dark.\nDay 3: Gelation and proteinase K digestion\nThe estimated experimental time on day 3 is 3 hr.\n27. Aspirate the diluted AcX solution from the 24-well plate, add 1 ml PBS, and incubate 5 min at room temperature in the dark.\n28. Aspirate the PBS solution, add 1 ml fresh PBS, and then place the 24-well plate, wrapped with aluminum foil, on ice.\n29. Prepare gelation solution by mixing Stock X, TEMED, and APS stock solutions in a 98:1:1 volumetric ratio.\n         \nAll solutions should be chilled on ice before mixing.\nFor 1 ml gelation solution, mix 980 µl Stock X, 10 µl TEMED, and 10 µl APS stock solutions. APS must be added last.\nMix the solution by vortexing for 10 s, and then immediately place the solution back on ice to avoid premature polymerization. This 1 ml of gelation solution is enough for three wells of cells.",
    "This solution must be used immediately in step 30 after preparation. The final concentrations of chemicals in the gelation solution are 8.6% (w/v) sodium acrylate, 2.5% (w/v) acrylamide, 0.15% (w/v) N,N′-methylenebisacrylamide, 2 M sodium chloride, 0.1% (w/v) TEMED, and 0.1% (w/v) APS, in PBS. Note that the TEMED and APS concentrations are half of those in our standard protocol (Asano et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-bib-0001]), which allows more handling time for beginners, and avoids premature gelation.\n30. Aspirate PBS from the 24-well plate, add 300 µl gelation solution, and incubate the plate for 5 min on ice.\n31. During the 5-min incubation in step 30, prepare one gelation chamber for each well, as shown in Figure 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0002].\n         \nWrap a piece of Parafilm around the glass slide (the “bottom slide”), pressing the piece of Parafilm gently onto the slide so that it wraps tightly around the slide (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0002], part 1).\nPlace a square no. 1.5 coverslip (22 mm × 22 mm; the “spacer”) at each end of the Parafilm-wrapped glass slide (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0002], part 2).\nThe spacers should be placed so that the width of the chamber (the gap between the spacers) is ∼8 mm (smaller than the diameter of the 13-mm cell culture coverslip), as shown in Figure 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0002]. Place a ruler under the bottom slide to help determine the spacing between the two coverslips. The distance between the two spacers should be smaller than the diameter of the coverslip so that the coverslip can rest on top of the two spacer stacks (cells face down) to form the gelation chamber.",
    "Add 2 µl water on top of each spacer (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0002], part 3), and then place another square no. 1.5 coverslip on top of each spacer, so that now on each end of the slide there is a stack of two coverslips.\nThe water helps the two spacers to adhere together to create a thicker spacer stack so that the gel formed will be thicker and easier to handle for beginners.\nGently press the spacer stack so that the entire stack adheres to the surface of the Parafilm, being careful not to press too hard, as the coverslips might break.\nThe top and side profiles of the gelation chamber are shown in Figures 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0001] and 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0002]. The length of the chamber should be ∼8 mm, and the height of the chamber should be ∼0.34 mm—that is, the thickness of a stack of two no. 1.5 coverslips.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/b925c3ab-29b8-429c-b11d-9c5f0da06806/cpns96-fig-0002-m.jpg</p>\nFigure 2\nConstruction of the gelation chamber and humidified tip box (protocol steps 31-37).\n32. After the 5-min incubation in step 30, and the completion of chamber preparation from step 31, use a pair of forceps and a syringe needle with a bent tip to carefully pick up the cell culture coverslip from the 24-well plate (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0002], part 4). Proceed immediately to step 33 so that the cells do not dry out.\nFor example, use a syringe needle with a bent tip to push the coverslip to the edge of the well, and then place the bent needle tip underneath the coverslip, lift the coverslip, and then pick up the coverslip using a pair of forceps. The 24-well plate should be kept on ice during this step.",
    "33. Invert the cell culture coverslip so that the cells face down, towards the Parafilm-coated slide, and gently place it on top of the spacer stacks (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0002], part 5). The edges of the coverslip will rest on the spacer stacks, with the cells suspended over the gap between the spacer stacks (see Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0001] for a profile view).\n34. Use the forceps to gently press the cell culture coverslip down, so that it adheres (through surface tension) to the spacers.\n35. Fill the space between the bottom slide, the spacers, and the inverted cell culture coverslip with 40 µl of gelation solution from the same well from which the cell culture coverslip came.\n         \nCarefully pipet out the gelation solution at the edge of the cell culture coverslip (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0002], part 6), and it will be drawn under the coverslip through capillary force, effectively “filling” the chamber with gelation solution.\n36. Add a layer of water to the bottom of a used, but clean, pipet tip box still containing its empty pipet tip-holding insert. Then, place the chamber on the empty pipet tip-holding insert (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0002], part 7).\n37. Close the tip box and transfer it into a 37°C incubator. Incubate 1 hr at 37°C, during which the gelation solution will polymerize.\nThe gelation chamber is kept in a humidified environment so that the sample will not dry out during polymerization.",
    "38. During the 1-hr polymerization time in step 37, and before removing the gelled chamber from the incubator in step 39, prepare the digestion solution as follows: Mix proteinase K (ProK) with digestion buffer in a 1:100 volumetric ratio at room temperature. For each coverslip to be processed, prepare 10 ml ProK-containing digestion buffer in a petri dish by mixing 10 ml of digestion buffer with 100 µl of ProK.\n39. Remove the tip box from the 37°C incubator and let it cool to room temperature for 2 min. Take the gelation chamber out and set aside the tip box.\n40. Slowly insert a razor blade from the side between the cell culture coverslip (the “top coverslip”) and the spacer stack to pry the cell culture coverslip off (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0003], part 1).\nBecause of the hydrophobicity of the Parafilm on the bottom slide, the gelled sample should be attached to the top coverslip (but if it is not, the gel can still be easily removed—see Figure 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0003], part 1b, and note at the end of step 43).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/0257f8fb-b365-4e04-9950-1d95692d5eb5/cpns96-fig-0003-m.jpg</p>\nFigure 3\nDigestion, expansion, and mounting of the sample (steps 40-54).\n41. Use forceps to carefully flip the coverslip so that the gel is on top. Then, use the forceps to hold the cell culture coverslip by gently pressing it on the glass slide, and use a razor blade to trim the gelled sample on the top coverslip to approximately the asymmetric shape shown in Figure 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0001] and in Figure 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0003], part 1a.\nThe dimensions of the asymmetric shape do not need to be precise, but the shape must be recognizable so that the orientation and spatial location of the cells in the gel can be easily determined.",
    "42. Immerse the gelled sample and the accompanying coverslip, with the gel facing up and the coverslip at the bottom, in the previously prepared petri dish (step 38; Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0003], part 2) containing 10 ml of ProK-containing digestion buffer.\n43. Keep the sample on an orbital shaker at 60 rpm speed at room temperature overnight (>6 hr) in the dark (e.g., by wrapping the dish with aluminum foil).\nRarely, during step 40, the cell culture coverslip might be pried off while the gel remains attached to the Parafilm (Fig, 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0003], part 1b). In such cases, follow the steps below for sample processing.\n         \nPry off and remove the two spacer stacks, and then trim the gel, while on the Parafilm, using a razor blade into an asymmetric shape mirroring that shown in Figure 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0003], part 1a (see Figure 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0003], part 1b, for details).\nUse a razor blade to cut the Parafilm around the gel, and then transfer and immerse the gel together with the attached piece of Parafilm in the petri dish containing the ProK-containing digestion solution, with the gel facing up and the Parafilm at the bottom.\nKeep the sample on an orbital shaker at 60 rpm at room temperature overnight (>6 hr) in the dark (e.g., by wrapping the dish with aluminum foil).\nDay 4: Expansion, mounting, and imaging\nThe estimated experimental time on day 4 is 3 hr.\n44. After the digestion is complete, the cell culture coverslip (or the piece of Parafilm) should be detached from the gel, and the gel should expand ∼1.5 times linearly. Carefully aspirate the digestion buffer from the petri dish using a transfer pipet. Slightly tilt the petri dish under a lamp, if needed, to help locate the gel sample and thus avoid damaging the gel during the aspiration.",
    "45. Carefully remove and discard the cell culture coverslip (or piece of Parafilm), using a pair of forceps.\n46. After removing the digestion buffer and the cell culture coverslip (or piece of Parafilm), add 10 ml water to the dish (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0003], part 3), and place the sample on the orbital shaker at 60 rpm for 10 min at room temperature in the dark (e.g., by wrapping the dish with aluminum foil).\nDuring each water-expansion step, make sure that the gel is fully immersed in water so that the expansion process can proceed homogenously and quickly. If the gel floats on top of the water, use a wetted paintbrush to gently push the gel until submerged in the water.\n47. Carefully aspirate the liquid in the petri dish containing the sample. Add 10 ml water, rewrap the petri dish with aluminum foil, and let the gel expand for 10 min at room temperature on the orbital shaker at 60 rpm.\n48. Carefully aspirate the liquid in the petri dish containing the sample. Again add 10 ml water, rewrap the petri dish with aluminum foil, and let the gel expand for 20 min at room temperature on the orbital shaker at 60 rpm. The gel should now be fully expanded to ∼4.5× its original size.\nThe gel is fully expanded when additional water treatment does not change the gel size. Inspect the shape of the gel after full expansion to determine which side the cells are on (using the asymmetric shape of the gel to ascertain which side was originally nearest to the coverslip, and thus contains the cells). If necessary, invert the gel by the following steps (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0003], part 4).\n         \nCarefully remove most, but not all, of the liquid from the petri dish.",
    "Use one hand to hold and tilt a rectangular no. 1.5 coverslip (22 mm × 50 mm) next to the gel. Use a wetted size 6 paintbrush to push on the side of the gel and slide the gel onto the coverslip (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0003], part 4).\nCarefully tilt the coverslip and flip the gel onto the size 6 paintbrush, and then lower the paintbrush into the remaining liquid in the petri dish, and slide the paintbrush out from under the gel so that the gel is immersed in the liquid again, but inverted in orientation in relation to the petri dish.\n49. During the last water expansion, coat the 6-well glass-bottom plate with poly-L-lysine. Add 2 ml 0.1% (w/v) poly-L-lysine solution to each well, and incubate the plate on the orbital shaker for 10 min at 60 rpm at room temperature.\n50. Aspirate the poly-L-lysine solution, add 2 ml water to each well, and incubate the plate 30 s at room temperature. Aspirate the water, and then dry the plate by blowing clean air or nitrogen over the glass-bottom well surfaces. The plate is dry when there is no observable liquid.\n51. Carefully remove as much liquid as possible from the petri dish containing the expanded gel sample.\n52. Use a clean razor blade to cut the gel to a size smaller than 22 mm × 22 mm, if needed, maintaining an asymmetric shape so that the orientation can be easily assessed. Transfer the gel on to a coverslip by the following steps.\n         \nUse one hand to hold and tilt a rectangular no. 1.5 coverslip (22 mm × 50 mm) next to the gel.\nUse a wetted size 6 paintbrush to push on the side of the gel and slide the gel onto the coverslip (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0003], part 5).",
    "Use a piece of a Kimwipe to wick away excess liquid (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0003], part 6). Start absorbing excess liquid from the sides of the gel, and then carefully use the tip of the Kimwipe to absorb the liquid in between the bottom of the gel and the coverslip.\n53. Slowly slide the gel into one well of the poly-L-lysine-coated 6-well glass bottom plate (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0003], part 7) until the gel just contacts the poly-L-lysine surface, and then horizontally translate the slanted coverglass away from the contact site, to let the gel slide off from the coverslip and attach to the poly-L-lysine surface.\nBe careful not to introduce air bubbles between the bottom of the gel and the glass bottom of the 6-well plate.\n54. Carefully add a few drops of water to the top of the gel to keep it hydrated during imaging.\nThe gel is now mounted and ready for imaging. In the example shown in Figure 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0003], part 7, the cells are closer to the glass bottom of the well, for imaging by an inverted microscope. The successfully expanded samples should show microtubule structures as bright, continuous sharp lines (see Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.96#cpns96-fig-0004] for an example).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/b9d1f5d9-9878-4f33-a817-2e9f6ad3b32c/cpns96-fig-0004-m.jpg</p>\nFigure 4",
    "Imaging of HeLa cells with immunostained microtubules before and after expansion. Imaging was performed on an Andor spinning-disk confocal microscope with a 40×, numerical aperture (NA) 1.15 water-immersion objective. (A) Confocal image of HeLa cells with immunostained microtubules, imaged at a single xy plane at the bottom of the cells. The inset in the upper left zooms in on the small box at the middle right. (B) Confocal image of a ∼4.5× linearly expanded HeLa cell with immunostained microtubules, imaged at a single xy plane at the bottom of the cell. The inset in the upper left zooms in on the small box at the bottom left. Scale bars in (B) indicate post-expansion scales."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}