{
  "id": 13108,
  "origin_website": "Jove",
  "title": "Differentiation of Human Pluripotent Stem Cells Into Pancreatic Beta-Cell Precursors in a 2D Culture System",
  "procedures": [
    "The study has been approved by the appropriate institutional research ethics committee and performed following the ethical standards as laid down in the 1964 Declaration of Helsinki and its later amendments or comparable ethical standards. The protocol was approved by the Institutional Review Board (IRB) of HMC (no. 16260/16) and Qatar Biomedical Research Institute (QBRI) (no. 2016-003). This work is optimized for hESCs such as H1, H9, and HUES8. Blood samples were obtained from healthy individuals from Hamad Medical Corporation (HMC) hospital with full informed consent. The iPSCs are generated from peripheral blood mononuclear cells (PBMCs) of control, healthy individual23.\n1. Preparation of the culture media\nPrepare human pluripotent stem cells (hPSC) culture media\n\t\nPrepare hPSC culture media from the commercially available medium for maintaining and expanding human embryonic stem cells by supplementing 100 units/mL of Penicillin and 100 ug/mL of Streptomycin (see Table of Materials). Aliquot and store the complete media at -20 °C for the long term or 4 °C for immediate use.\nPrepare Stage 1 differentiation media (for Definitive Endoderm (DE)).\n\t\nPrepare Basal media from MCDB 131 media by supplementing with 0.5% of fatty acid-free Bovine serum albumin (FFA-BSA), 1.5 g/L of Sodium bicarbonate (NaHCO3), 10 mM of glucose, 2 mM of Glutamax, 100 units/mL of Penicillin, and 100 µg/mL of Streptomycin (see Table of Materials). Filter the prepared media using a 0.2 µm filter and store at 4 °C.\nPrepare Stage 1 media containing CHIR99021 from the Basal media (prepared in step 1.2.1) by warming the basal media at 37 °C and then supplementing with 2 µM of CHIR99021, 100 ng/mL of Activin A, 10 µM of Rock inhibitor (Y-27632), and 0.25 mM of Vitamin C (see Table of Materials). Mix the supplemented media well and cover it with aluminum foil to protect it from light.",
    "NOTE: This media will be used only on the first day of differentiation.\nPrepare Stage 1 media without CHIR99021 from the Basal media by warming it at 37 °C and supplementing it with 100 ng/mL of Activin A and 0.25 mM of Vitamin C and mix well.\n\t\tNOTE: 5 ng/mL of basic FGF or FGF2 can be optionally added to this media. This media will be used for the remaining days of Stage 1.\nPrepare Stage 2 differentiation media (for Primitive Gut Tube; PGT).\n\t\nPrepare Stage 2 differentiation media containing Rock inhibitor from the Basal media by warming it at 37 °C and supplementing with 50 ng/mL of FGF10, 50 ng/mL of NOGGIN, 0.25 µM of CHIR99021, 10 µM of Y-27632 (Rock inhibitor), and 0.25 mM of Vitamin C.\n\t\tNOTE: This media is used on the day of dissociation of endodermal cells.\nPrepare Stage 2 differentiation media without Rock inhibitor following the same procedure for the Media prepared in step 1.3.1, excluding the Rock inhibitor.\n\t\tNOTE: This media is used on the second day of Stage 2.\nPrepare Stage 3 differentiation media (for Posterior Foregut).\n\t\nPrepare DMEM media containing 4.5 g/L of Glucose, then supplement with 1% of Penicillin-streptomycin and 2 mM of Glutamax and use as basal media for Stages 3 and 4.\nWarm the DMEM media (prepared in step 1.4.1) and supplement with 2 µM of Retinoic acid, 0.25 µM of SANT-1, 50 ng/mL of FGF10, 50 ng/mL of NOGGIN, 0.25 mM of Vitamin C, and 1% B27 supplement without vitamin A (see Table of Materials).\n\t\tNOTE: This media is used for 4 days of Stage 3 for P2-D (Protocol 2, optimized, dissociated) and 2 days of Stage 3 for P1-ND (Protocol 1, non-optimized, non-dissociated).\nPrepare Stage 4 differentiation media (for Pancreatic Progenitors).",
    "Add DMEM containing 4.5 g/L of Glucose with 100 ng/mL of EGF, 10 mM of Nicotinamide, 50 ng/mL of NOGGIN, 0.25 mM of Vitamin C, and 1% of B27 supplement without Vitamin A (see Table of Materials). Use this media for all days of Stage 4.\n\t\tNOTE: Maintain all reagents at appropriate temperatures, and all cytokine and sensitive reagents need to be aliquoted. Thaw the aliquoted reagents and add to the basal media at the time of changing the differentiation media. The compositions of the different differentiation media are provided in Table 1.\n2. Preparation of basement membrane matrix coated dishes\nThaw commercially available basement matrix (see Table of Materials) and aliquot on ice; freeze the aliquots at -20 °C.\nBefore coating the tissue culture dishes, thaw the frozen aliquots on ice. Add appropriate volume of the membrane matrix solution to the chilled KO-DMEM/F-12 media (KnockOut DMEM/F-12) (see Table of Materials) to achieve the desired diluted concentration and mix well. Store the diluted matrix solution at 4 °C for immediate use.\nCover the surface of the tissue culture-treated plates (see Table of Materials) with diluted membrane matrix solution and place the plates at 37 °C for at least 60 min before plating the cells. Use a dilution of 1:50 of the membrane matrix solution in KO-DMEM/F-12 for plating cells for pancreatic differentiation experiment and 1:80 for expansion of undifferentiated hPSCs.\n3. Culture of undifferentiated hPSCs\nPassage the hPSCs when the colonies reach a 70%-80% confluency.\nTo passage, wash the hPSCs once with warm PBS, aspirate using a portable vacuum aspirator inside the tissue culture hood, and add 0.5 mM of EDTA solution in PBS to cover the colony surface. Incubate at 37 °C, 5% CO2 for 1 min or until the colonies' borders detach from the plate surface.",
    "Remove EDTA solution and collect the detaching colonies with hPSC culture medium using a P1000 micropipette. Centrifuge the collected cells at 128 x g for 4 min at room temperature. Discard the supernatant and supplement the cells with hPSC culture media containing 10 µM of Y-27632 (Rock inhibitor)23,24.\n\t​NOTE: Passage the hPSCs in at least a 1:3 ratio on 1:80 membrane matrix-coated dishes. However, for differentiation experiments, plate the hPSCs on 1:50 coated dishes.\n4. Induction of Definitive Endoderm (DE) differentiation in hPSCs (Stage 1)\nWhen the hPSC colonies reach a confluency of 70%-80%, wash them twice with warm PBS and aspirate using a portable vacuum aspirator inside the tissue culture hood to begin Stage 1 differentiation.\nAdd Stage 1 differentiation medium containing CHIR99021 (from step 1.2.2) to the colonies, 2 mL per 6-well plate, and incubate at 37 °C for 24 h.\nThe next day, replace the spent media with Stage 1 differentiation medium without CHIR99021 (step 1.2.3).\nEvery 24 h, aspirate the spent media using a portable vacuum aspirator inside the tissue culture hood and replace it with a fresh Stage 1 differentiation medium without CHIR99021.\n\t​NOTE: Stage 1 can be extended up to 4 days. The length of Stage 1 is dependent on the hPSC line being used and should be optimized accordingly.\n5. Immunofluorescence analysis of hPSC-derived DE (Stage 1)\nFor immunofluorescence, aspirate the spent media using a portable vacuum aspirator inside the tissue culture hood from the wells and wash twice with warm PBS. Swirl the plate to get rid of any cell debris.",
    "Cover the surface of the wells with 4% of paraformaldehyde (PFA) to fix the DE cells; for example, add 250 uL of PFA per well of a 24-well plate. Place the plate on a 2D shaker at 20 x g for 20 min.\nAfter fixation, wash the DE cells with tris-buffered saline with 0.5% of Tween (TBST) (see Table of Materials) and place the plate on the shaker at 20 x g for 10 min. Repeat this step once more.\nPermeabilize the fixed cells by adding a generous volume of phosphate-buffered saline with 0.5% of Triton X-100 (PBST); for example, add 1 mL of PBST per well of a 24-well plate and place the plate back on the shaker at 20 x g for 20 min.\nFreshly prepare 5%-6% of BSA in PBST as blocking buffer and add it to the permeabilized cells. Incubate the plate for at least 1 h in the blocking solution on the shaker.\nDilute the primary antibodies against SOX17 and FOXA2 together (see Table of Materials) in 2%-3% BSA in PBST solution. Add the combined antibodies to blocked cells and place the plate on the shaker at 4 °C overnight at a low speed with gentle shaking.\n\tNOTE: SOX17 and FOXA2 are well-established DE markers25,26.\nThe next day, aspirate the primary antibodies using a portable vacuum filter and wash the wells with TBST three times, each wash for 10 mins on the shaker.\nPrepare 1:500 dilution of Alexa fluor 488- and 568- conjugated secondary antibodies (see Table of Materials) against the species the primary antibodies were raised in.\nAdd the secondary antibody combination to the stained well and cover the plate with aluminum foil to protect from light. Place the plate on the shaker for 1 h at room temperature.",
    "Aspirate the secondary antibody solution using a portable vacuum filter and wash the stained wells with TBST on the shaker for 10 min, covering the plate with foil. Repeat the wash step a total of three times.\nPrepare a 1 µg/mL of Hoechst 33342 dilution in PBS to stain the nuclei. Add the Hoechst solution to the wells and place the plate on the shaker for 2-3 min.\nAspirate the Hoechst solution using a portable vacuum filter and rinse the wells with PBS twice.\nFinally, add PBS to the stained cells and image them using an inverted fluorescence microscope (see Table of Materials) in the dark. Keep the plate covered with foil when not imaging to minimize the fluorophore bleaching.\n\t​NOTE: Alternatively, flow-cytometry can be used to assess DE efficiency as described in step 9.2.\n6. Generation of the primitive gut tube (PGT) from hPSCs (Stage 2)\nNOTE: If the immunofluorescence analysis in step 5.13 is determined to be a SOX17-FOXA2 co-expression of 80% and above, the experiment proceeds to Stage 2. If the efficiency is <80%, extend the duration of Stage 1 to 4 days.\nOn day 1 of Stage 2, dissociate the hPSC-derived endodermal cells using TrypLE or Accutase (see Table of Materials) for the optimized P2-D protocol. Wash the adherent cells with warm PBS and add warm 1 mL of TrypLE or Accutase solution per well of a 6-well plate for 3-5 min at 37 °C, 5% CO2, or until the cells begin to detach from one another.\nDissociate the detached sheets or monolayer of cells in the wells and then collect them together in a 15 mL polypropylene tube using basal Stage 1/2 media without cytokines containing at least 0.5% of either fetal bovine serum (FBS) or KnockOut serum (KOSR) (see Table of Materials).",
    "Spin down the cells at 800 x g for 5 min at 4 °C and discard the supernatant. Add 1 mL of sterile PBS and resuspend the pellet into single cells.\nCount the cells using an automated counter (see Table of Materials) by loading the recommended volume of cells in the chamber slide. Spin the resuspended cells at 800 x g for 5 min at 4 °C and discard the supernatant.\nResuspend the pellet in the appropriate volume of Stage 2 differentiation medium containing Rock inhibitor at a density of 2.5-3.5 x 105 cells/cm2.\n\tNOTE: This count may come down to a 1:2 splitting ratio for most cell lines, dependent on the proliferation rate. The total volume will be 2 mL of media with resuspended cells in 1 a well of 6-well plate.\nPlate the resuspended cells on 1:50 membrane matrix-coated plates (prepared in step 2) and incubate them at 37 °C, 5% CO2 in the incubator.\n24 h later, replace the media with Stage 2 differentiation medium without Rock inhibitor (prepared in step 1.3.2).\n7. Generation of posterior foregut from hPSCs (Stage 3)\nAspirate the spent Stage 2 media using a portable vacuum aspirator inside the tissue culture hood and wash the cells with warm PBS.\nAdd Stage 3 differentiation media from step 1.4 to the cells and incubate at 37 °C, 5% CO2.\nAfter 24 h, replace the spent media with freshly prepared Stage 3 differentiation media. Repeat this for a total of 4 days for P2-D protocol (optimized) and only 2 days for the non-dissociated P1-ND.\n8. Generation of Pancreatic Progenitors from hPSCs (Stage 4)",
    "After 4 days of Stage 3 treatment, wash the cells with warm PBS, gently swirl the plate, and aspirate using a portable vacuum aspirator. Then, add Stage 4 differentiation media from step 1.5 to the cells.\nAfter 24 h, replace the spent media with freshly prepared Stage 4 media. Repeat this for a total of 4 days.\n9. Assessment of differentiation efficiency of generating pancreatic progenitors from hPSCs\nPerform the immunofluorescence analysis of the hPSC-derived pancreatic progenitors (Stage 4) for expression of PDX1 and NKX6.1.\n\tNOTE: PDX1 and NKX6.1 are well-established pancreatic progenitor markers17,18.\n\t\nPerform fixation, permeabilization, blocking, and antibody incubation and washes according to step 5.\nStain the hPSC-derived pancreatic progenitors with a combination of PDX1 and NKX6.1 antibodies (see Table of Materials) diluted in 2%-3% BSA in PBST.\nUse 1:500 dilutions of appropriate Alexa fluor 488- and 568- conjugated secondary antibodies (see Table of Materials).\nPerform flow-cytometry analysis of hPSC-derived pancreatic progenitors for expression of PDX1 and NKX6.1.\n\tNOTE: Flow-cytometry analysis of pancreatic markers in the generated hPSC-derived pancreatic progenitors provides a way to quantify the PDX1 and NKX6.1 co-expressing cells.\n\t\nAt the end of Stage 4, wash the cells twice with warm PBS and add enough TrypLE or Accutase to cover the surface of the wells, for example, 1 mL of TrypLE or Accutase per well of 6-well plate. Place the plate in the incubator for 5-7 min or until the cells detach from the surface.\nDissociate the adherent sheets of cells within the well using a P1000 micropipette before collecting them in a 15 mL polypropylene tube.",
    "Spin down the cells in hPSC-derived pancreatic progenitors at 800 x g for 5 min at 4 °C, then discard the supernatant. Wash the cells with PBS by dissociating them into single cells. Count the cells using an automated counter (see Table of Materials) and note the concentration in the number of cells per mL.\nSpin at 800 x g for 5 min at 4 °C, and discard the supernatant. Add 200 µL of chilled PBS to the pellet and dissociate.\nAdd 2 mL of chilled 80% ethanol dropwise, with the tube on a vortex at low-medium speed (400 x g at room temperature). Close the caps tightly and place the tubes slightly tilted on the shaker at 4 °C overnight.\nSpin down the cells at 800 x g for 5 min at 4 °C, and wash with PBS to dissociate any clumps of fixed cells.\nBlock the fixed cells with 5%-6% BSA solution in PBST for at least 1 h at room temperature or 4 °C overnight on the shaker.\nStain for the pancreatic progenitor markers following the steps below.\n\t\t\nDistribute 2,00,000 cells per condition, including appropriate isotype controls dependent on the IgG subclass of the host species of the primary antibody, unstained and secondary antibody controls in a 96-well V bottom plate or 1.5 mL centrifuge tubes.\nSpin down the plate at 800 x g for 5 min at 4 °C and flip the plate with a swift motion to discard the supernatant without losing the pellets. Prepare primary antibody dilutions in 3% BSA solution (see Table of Materials).\n\t\t\tNOTE: The concentration of primary antibodies can be between 1:50 to 1:200.\nIncubate the stained cells for at least 2 h at room temperature or overnight at 4 °C on a shaker with gentle shaking at low speed.",
    "Wash the stained cells with TBST thrice by pipetting the cells up and down in the wells. Spin and discard the supernatant as in step 9.2.8.2.\nAdd 1:500 dilution of secondary antibodies (Alexa fluor 488- and 647-conjugated antibodies) prepared in PBS (see Table of Materials). Incubate for 30 min at room temperature.\nWash the stained cells with TBST at least twice by pipetting the cells up and down. Spin the plate and discard the supernatant as in step 9.2.8.2.\nCollect the stained cells in at least 100 µL of PBS and transfer them to light-protected FACS tubes (see Table of Materials). Run the samples on a flow-cytometry machine.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}