{
  "id": 18063,
  "origin_website": "Jove",
  "title": "Home-Based Transcranial Direct Current Stimulation Device Development: An Updated Protocol Used at Home in Healthy Subjects and Fibromyalgia Patients",
  "procedures": [
    "This study was approved by the institutional ethics committee at the HCPA and obtained written informed consent from all subjects. Details of the study with a sample of healthy subjects and fibromyalgia patients are in Figure 1.\n1. Participant Recruitment and Screening\nRecruitment\n\t\nPerform a screening questionnaire over the telephone to assess eligibility and request confidential medical information (psychiatric history, regular tobacco use, drug abuse and alcohol use as exclusion criteria).\nConduct a baseline screening to assess the participants' aptitude of home-based tDCS.\nUse the following Inclusion/Exclusion criteria.\n\t\nFor Healthy Subjects (HS): include healthy male and female volunteers who have completed higher education, are right-handed and aged between 18 to 40 years.\nFor Fibromyalgia (FM) patients: include patients with diagnosis of fibromyalgia based on American College of Rheumatology criteria, literate, female and aged between 18 to 60 years.\nExclude contraindication to tDCS use: history of brain surgery, tumor, stroke, implantation of intracranial metal, pregnant or breastfeeding.\nExclude subjects who receive less than 80% of the stipulated sessions.\n2. Proposed Equipment\nNote: The Biomedical Engineering department at the Hospital de Clínicas de Porto Alegre in partnership with the Laboratory of Pain & Neuromodulation developed the home-based tDCS. To solve the difficulty of correct placement of the electrodes without the help of another person, we created a tDCS device and a cap that allows the use of two electrodes in several assemblies.\ntDCS Device\n\tNOTE: The device has dimensions of 110 mm x 75 mm and a weight of 165 g. Consumption while in use is 20 mA and 10 µA on stand-by and can only be programmed by researchers.",
    "Set the device parameters: the fixed number of stimulation sessions, the minimum interval between two consecutive sessions, the intensity of the electric current, duration of stimulation, the rise and descent time of the current, and stimulation mode: active or sham.\nCap/Silicone Probes/Electrodes\n\tNOTE: The cap's material is neoprene, which facilitates contact of the sponges to the scalp, keeping the sponges fixed at the stimulation site. The cap has a Velcro strap attached to the chin ensuring the cap does not move during the stimulation.\n\t\nChoose the correct dimensions of the cap. The cap allows facilitated contact of the sponges to the scalp, keeping the sponges fixed at the stimulation site, and has three sizes: small (38 cm x 55 cm), medium (39 cm x 57.5 cm) and large (40 cm x 59 cm).\nPut the cap on the participant and measure/mark the chosen region.\nRemove the participant's cap and drill the cap at the desired location. Attach the electrodes and connect the silicone cannulas and filled syringes of the saline solution. Form electrodes from 35 cm2 conductive rubber electrodes coated with a vegetable sponge and a metal piece that connects it to the silicone cannulas (Figure 2).\nProtocols\n\t\nDefine a protocol for participants. For healthy subjects, use anodal stimulation over the left primary motor cortex (M1) and cathodal stimulation over the contra-lateral supra-orbital area (Figure 3A), 2 mA for 20 min, in a total of 10 consecutive sessions.",
    "Define a protocol for patients. For fibromyalgia patients, use anodal stimulation over the left dorsolateral prefrontal cortex (DLPFC) (Figure 3B), 2 mA for 30 min, in five consecutive days (Monday to Friday) in a total of 60 sessions. Randomize FM patients to one of two treatments (active or sham tDCS). A researcher not involved in data collection performed the randomization and used the computer program entitled Randomization.com.\n\t\tNOTE: During active stimulation, there is ramp-up time of 20 s for the current to go from zero to 2 mA and a ramp-down time that also takes 20 s for the current to go from 2 mA to zero to end the stimulation. In this way, the participant does not suffer from an abrupt interruption of the current and the visualization of spots or light spots, known as phosphenes, produced from electrical or magnetic stimulation19,20. The sham application has the same ramp-up and ramp-down time, but in three moments: at the beginning, in the middle (at 15 min) and at the end of the session (at 30 min), to convince the participant that they are receiving the stimulation.\n3. Baseline Protocol Visit - tDCS Training\nPrepare the materials for each participant: a case containing a neoprene cap, a tDCS device, a battery charger, 2 electrodes, 2 silicone cannulas attached to the electrodes, 20 syringes with 10 mL of saline and two syringes of additional physiological saline solution, and one bottle of additional physiological saline solution.\nHold a training session with the participant and inform them about the details of the device and the step-by-step process for self-stimulation administration. Participants should also watch an instructional video about the use of tDCS at home.\nTraining Session\n\t\nInspect the skin for any injury or something that contraindicates the tDCS use.",
    "Place the participant in front of a mirror and separate their hair in order to reveal the area to be stimulated, according to the protocol of the study.\nClean the surface of the skin to remove creams, dirt or grease.\nPut the cap on the head with the front seam between the eyebrows. The cap is to be neither tight nor loose but comfortable.\nConnect the electrode cable to the device and turn on the equipment.\nSequence of screens\n\t\nTurn on the device and the first screen will appear: Opening screen (Figure 4A).\nWait a few seconds and the second screen will appear: Battery status (Figure 4B). In the sequence, the third screen will show the date and time (Figure 4C).\nAs the next screen is the command wear the cap, push the central button after making sure the cap is well secured (Figure 4D).\nWait for the command inject saline. Make sure the saline is fed slowly to the electrodes using the already connected syringe, using 6 mL for each electrode. Press the central button after injecting the saline (Figure 4E).\nThe sixth screen is the command to start the session. The participant must press the center button when ready to begin the stimulation (Figure 4F).\nAs the seventh screen shows the beginning of the stimulation, see in the display: session duration, battery charge, and two lines. The upper line shows the intensity (I), and the bottom line shows the resistance (R) (Figure 4G).\n\t\tNOTE: The intensity will gradually increase until reaching 2 mA (or another defined intensity). The resistance should approximately reach the middle of this line (5 kΩ), and the investigator can configure the device to the maximum impedance limit they want.",
    "Wait for the end of the stimulation, and after twenty minutes (or other stipulated time), the tDCS device powers off and stimulation ceases, saving the session data to the device software (Figure 5).\n\t\tNOTE: The device records each session, with the day and time of stimulation, resistance and total duration of stimulation.\nSafety features\n\t\nDefine tolerability. After beginning the stimulation, ask the participant about comfort to the stimulus. If the participant reports discomfort, wet the sponges with saline solution to decrease these effects or reduce current intensity to 1.0 mA (or another defined intensity).\nWatch for high resistance. If resistance is too high (Figure 6A), the device will issue an alarm warning: \"adjust the cap and inject extra saline\" (Figure 6B). At this point, adjust the electrodes on the head and inject some more saline, trying not to exceed 10 mL. High impedance will occur when there is poor contact, a low amount of saline or when the electrical current changes by more than 10%.\nStop the session if necessary. The central button will need to be pressed for a few seconds, followed by pressing the switch for the off button after which a message \"Shut down?\" will appear (Figure 7).\nDo not repeat session in 24 h. If the stimulation session lasted less than 50% of the total time, it is possible to repeat the session on the same day. However, if the session lasted more than 50% of the whole time, it isn't possible to replicate the stimulation on the same day, as the initial session will be considered a valid one.",
    "Charge the battery. The device contains a 9-volt battery, which is rechargeable. When the battery is at 50%, it is necessary to charge it. For this, it is required to disconnect the electrode cable and swap it with the charger cable, because it is not possible to charge the battery during a stimulation session.\n4. Home-based tDCS Sessions\nInstruct the participant to choose a quiet moment in his or her day for the session, to not be interrupted and to avoid having to stop the procedure. The activity of the participant should be oriented according to the study protocol and should be the same for all sessions.\nAdverse effects\n\t\nInstruct the participant to correctly fill the adverse effects diary immediately after the tDCS home session. Patients with FM also were instructed to fill the pre (before the session) and post-estimate pain levels, immediately after the session.\nTeam availability\n\t\nGive participant all the information in written form and a contact phone number. This number must be available 24 h a day because if the participants had doubts or some problem in using the device, they should be able to contact a team member at any time.\nAsk the participant the approximate time of day the session will take place. Thus, a team member should be aware of possible demands.\n\t\tNOTE: After the end of the protocol, the participant should do the final evaluation and give back the tDCS device and adverse effects diary.\nAccess software information",
    "Access the recorded information at the end of the treatment. To do this, use a computer and a cable to extract the information saved in the software. This data shows all the sessions performed and presents the values of the current intensity used and the contact impedance of each session. The participant does not have access to this information (Figure 8)."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}