{
  "id": 5339,
  "origin_website": "Bio",
  "title": "<em>In vitro</em> Floral Induction of <em>Cuscuta reflexa</em>",
  "procedures": [
    "Explant surface sterilizationNodal region (Figure 1A) of the Cuscuta reflexa plant (2-month-old) grown naturally on bougainvillea plant was taken as the starting material.Keep small pieces (around 20 pieces taken here) of Cuscuta reflexa nodal stem explants (1-2 cm length, Figure 1A) inside a beaker. Treat (submerge) the explants in 100 ml of 1% Bavistin solution for 10 min inside a laminar hood to make those free from dust or any other external contaminations.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170113/20170113000757_8015.jpgFigure 1. Floral induction from Cuscuta reflexa nodal explants. A. Nodal explants inoculated in MMS media supplemented with floral induction hormone/hormones. B and C. Shoot regeneration following floral induction in Cuscuta reflexa nodal explants where the MMS media was supplemented with both 2,4-D and NAA. D. Direct floral bud initiation from Cuscuta reflexa nodal explants where the MMS media was supplemented with only 2,4-D.Rinse the explants with autoclaved distilled water inside a laminar hood by brief shaking with hand.Decant the distilled water and pour 100 ml of 0.1% HgCl2 into the same beaker for surface sterilization inside the laminar hood. Surface sterile the explants for 5 min with brief shaking by hand.Inoculation of explants for floral inductionInoculate some of the explants (stuck up to 0.5 cm of 3 to 4 explants into media of one flask, Figure 1A) in the conical flask containing floral induction media-1 and inoculate some explants in floral induction media-2 (method for preparation of floral induction media-1 and -2 is described in Recipes section).Plug all the conical flasks containing the media with the explants air tight to avoid any bacterial and/or fungal contamination.Keep the conical flasks inside a tissue culture room where controlled light (1,000 lux) and temperature condition (28 ± 1 °C, 12 h dark/light period) will be maintained.",
    "Notice the proliferation of nodal region (Figure 1B) and generation of shoots and/or floral buds. It will take around 25 to 30 days to initiate floral buds.Floral induction media-1 (200 µl 2,4-D/L and 200 µl NAA/L supplemented in MS media) results in shoot regeneration following flowering initiation (Figure 1C). But floral induction media-2 (200 µl 2,4-D/L supplemented in MS media) resulted in floral bud initiation without shoot elongation (Figure 1D)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}