{
  "id": 7585,
  "origin_website": "Bio",
  "title": "Low-viscosity Matrix Suspension Culture for Human Colorectal Epithelial Organoids and Tumoroids",
  "procedures": [
    "Processing of human tissue samples Tissues are kept in 4 mL of tissue medium (see Recipes) once collected after surgical resection.Note: Processing of the tissue within 24 h is recommended, although tissues can be stored in tissue medium at 4°C for up to 72 h. Wash normal and tumour tissues in 10 mL of PBS containing 100 μg/mL Primocin and 100 μg/mL Gentamicin at room temperature for 15 min.Note: If tissue medium looks turbid when the tissue arrives, treat the tissue with 10 mL of 0.1% sodium hypochlorite diluted in PBS at room temperature for 5–10 min, as step A2.Centrifuge in a tabletop centrifuge at 200 × g and 4°C for 5 min, and discard the supernatant.Wash tissues another five times, with 10 mL of ice-cold PBS containing 100 U/mL Penicillin, 100 μg/mL Streptomycin, and 50 μg/mL Gentamicin, centrifuging at 200 × g and 4°C for 5 min.Primary culture of organoids from normal colon tissues Incubate tissue samples in 5 mL of EDTA chelation buffer (see Recipes) at room temperature for 30–60 min.Transfer the samples from EDTA chelation buffer to 20 mL of ice-cold PBS.Hold a sample with tweezers and shake it vigorously to release the colon crypts into PBS (Video 1 and Figure 1).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Process of shaking off crypts from resected colon tissue. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4394/bioprotoc-12-08-4394-g001.jpgFigure 1. Representative images of isolated colorectal crypt fragments. Scale bar, 200 µm.Remove the remaining tissue, centrifuge the crypt suspension in a benchtop centrifuge at 500 × g and 4°C for 3 min, and discard the supernatant.Resuspend the isolated colonic crypts in 2 mL of freshly prepared DMEM/F12 containing 0.1 mg/mL Dispase II and 10 µM Y-27632.Incubate at 37°C for 5–10 min, until the crypts are digested into fragments.Note: Monitor crypt digestion using an inverted microscope at four times magnification.",
    "Pipette the suspension 10–30 times with a 1,000 µL-tip, to help generate crypt fragments.Centrifuge the suspension in a tabletop centrifuge at 500 × g and 4°C for 3 min.Discard the supernatant, and resuspend the pellet in 3 mL of DMEM/F12 containing 10 µM Y-27632.Centrifuge the suspension in a tabletop centrifuge at 500 × g and 4°C for 3 min.Discard the supernatant and resuspend the pellet in 0.3–5 mL of DMEM/F12 containing 10 µM Y-27632.Count the number of crypt fragments (~50 µm in size) using a haemocytometer (Figure 2), and calculate the required culture media volume as follows:12,000–24,000 fragments in 3.5 mL/well for a 6-well suspension plate.3,000–6,000 fragments in 1.5 mL/well for a 24-well suspension plate.24,000–50,000 fragments in 5 mL/bioreactor tube, as shown in Figure 3.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4394/bioprotoc-12-08-4394-g002.jpgFigure 2. Counting of crypt fragments with a hemocytometer before plating. Red arrows indicate crypt fragments. Scale bar, 200 µm.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4394/bioprotoc-12-08-4394-g003.jpgFigure 3. Organoid/tumoroid cultures in bioreactor tubes in the tissue culture incubator. Suspend crypt fragments in human IntestiCult organoids growth medium containing 5% Matrigel and 10 µM Y-27632, and transfer to plate wells.Note: Mix fragments and medium containing Matrigel by pipetting approximately 10 times with a 1,000-µL tip, without touching the bottom of the well. If using a bioreactor tube for culture, rinse the bioreactor tube with 10 mL of anti-adherence rinsing solution once and wash with 10 mL of DMEM/F12 three times before adding the crypt fragments. Incubate in a 5% CO2 incubator at 37°C.Replace media with fresh human IntestiCult organoids growth medium containing 10 µM Y-27632 every two days. To change medium, allow the culture plates to settle in a tissue culture hood for 5 min, before removing supernatant. Remove half of the medium (2–3 mL) without disturbing the organoids. Tilt the plate to facilitate removal of medium if necessary.",
    "Add 2–3 mL of fresh medium, and mix by pipetting approximately 10 times with a 1,000-µL tip without touching the bottom of the well, to scramble up organoids. When using bioreactor tubes for culturing, tubes sit on the rack in the incubator. Shake tubes vigorously every 24 h to mix well. Agitating bioreactors with a shaker in the incubator can improve culture conditions with adequate air exchange.Notes:  Y-27632 can be omitted once organoids are established. Always use filter tips that are pre-rinsed with DMEM/F12 + 1% BSA, to avoid loss of organoids from pipetting. Observe cultures every day and scramble cells/organoids with pipettes, if these adhere to the bottom. Medium change can also be performed by transferring cultures into centrifuge tubes, centrifuging in a tabletop centrifuge at 500 × g and 4°C for 5 min, replacing supernatant with fresh medium, and plating back into culture plates. When using bioreactor tubes, centrifuge in a tabletop centrifuge at 500 × g and 4°C for 10 min, so that the organoids settle down at the bottom before removing the supernatant. To minimize the loss of organoids during medium change, centrifuge the collected supernatant in a tabletop centrifuge at 500 × g and 4°C for 5 min, or in a benchtop centrifuge at 6,000 rpm and room temperature for 1 min. Discard the supernatant, resuspend the pellet with 500 µL of fresh medium, and plate them back into the original well. Primary culture of tumoroids from colorectal cancer (CRC) tissues Mince CRC tissue into small pieces in a Petri dish on ice using forceps and scissors.Note: If the tissue is less than 30 mg, mince the tissue, resuspend in 3 mL of ice-cold PBS, and go to step C4. Resuspend the minced tissues in 2 mL of freshly prepared DMEM/F12 containing 0.",
    "1 mg/mL Dispase II, 200 U/mL Collagenase IV and 10 µM Y-27632. Digest at 37°C for 30–60 min, and pipette the digestion mix and tissue pieces with 1,000-µL tips every 10 min, until the tissue pieces can pass through the tips easily.Centrifuge the suspension in a tabletop centrifuge at 500 × g and 4°C for 5 min.Note: Check the supernatant for remaining cells under microscope before discarding. If there are still many cells in the supernatant, centrifuge the supernatant again at 500 × g and 4°C for 5 min. Wash pellet with 10 mL of DMEM/F12 containing 10 µM Y-27632 at 500 × g and 4°C for 5 min.Resuspend the pellets in 0.5 mL of colorectal tumoroid primary culture medium (see Recipes).Count the number of fragments using a haemocytometer, and calculate the media volume as follows:12,000–24,000 fragments in 3.5 mL/well for a 6-well suspension plate.3,000–6,000 fragments in 1.5 mL/well for a 24-well suspension plate.24,000–50,000 fragments in 5 mL/bioreactor tube.Suspend crypt fragments in colorectal tumoroid primary culture medium (see Recipes) containing 5% Matrigel and 10 µM Y-27632. Transfer to plate wells.Note: Mix fragments and medium containing Matrigel by pipetting approximately 10 times with a 1,000-µL tip, without touching the bottom of the well. If using a bioreactor tube for culture, rinse the bioreactor tube with 10 mL of anti-adherence rinsing solution once, and wash with 10 mL of DMEM/F12 three times, before adding crypt fragments. Incubate in a 5 % CO2 incubator at 37°C.Replace media with fresh colorectal tumoroid primary culture medium containing 10 µM Y-27632 every two days. To change medium, allow the culture plates to settle in a tissue culture hood for 5 min, before removing supernatant. Remove half of the medium (2–3 mL) without disturbing the organoids. Tilt the plate to facilitate removal of medium if necessary.",
    "Add 2–3 mL of fresh medium, and mix by pipetting approximately 10 times with a 1,000-µL tip without touching the bottom of the well, to scramble up organoids. When using bioreactor tubes for culturing, tubes sit on the rack in the incubator. Shake tubes vigorously every 24 h to mix well. Agitating bioreactors with a shaker in the incubator can improve culture condition with adequate air exchange.Notes:  Y-27632 can be omitted once organoids are established. Always use filter tips that are pre-rinsed with DMEM/F12 + 1% BSA, to avoid loss of organoids from pipetting. Observe cultures every day, and scramble cells/organoids with pipettes if these adhere to the bottom. Medium change can also be performed by transferring cultures into centrifuge tubes, centrifuging in a tabletop centrifuge at 500 × g and 4°C for 5 min, replacing supernatant with fresh medium, and plating back into culture plates. When using bioreactor tubes, centrifuge in a tabletop centrifuge at 500 × g and 4°C for 10 min, so that the organoids settle down at the bottom before removing the supernatant. To minimize the loss of organoids during medium change, centrifuge the collected supernatant in a tabletop centrifuge at 500 × g and 4°C for 5 min, or in a benchtop centrifuge at 6,000 rpm and room temperature for 1 min. Discard the supernatant, resuspend the pellet with 500 µL of fresh medium, and plate them back to the original well. Passaging Colorectal organoids initially grow in round shapes (1–2 weeks); with longer term culture colorectal organoids to form crypt buds, as detailed in our previous publication (Hirokawa et al., 2021). Organoids/tumoroids with dark cores are ready for passaging (Figure 4). If not passaged, dead cells will start to emerge from the organoids/tumoroids.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4394/bioprotoc-12-08-4394-g004.jpgFigure 4.",
    "Bright-field images of colorectal organoids and tumoroids ready for passaging after 2 weeks in culture. Scale bars, 200 µm.Centrifuge in a tabletop centrifuge at 500 × g and 4°C for 5 min.Discard the supernatant, and resuspend the pellet in 1 mL of PBS.Centrifuge in a benchtop centrifuge at 8,000 rpm and room temperature for 1 min.Resuspend the pellet in 1 mL of TrypLE Express Enzyme, and incubate at 37°C for 10–15 min (depending on the size of the organoids).Centrifuge in a benchtop centrifuge at 6,000 rpm and room temperature for 1 min.Resuspend the pellet in 1 mL of 1 % (m/v) BSA in DMEM/F12.Centrifuge in a benchtop centrifuge at 6,000 rpm and room temperature for 1 min.Resuspend the pellet in 0.5–1 mL of human IntestiCult organoids growth medium or colorectal tumoroid maintenance medium (see Recipes) containing 10 µM Y-27632, pipetting with a 200-µL tip pre-rinsed with 1% BSA in DMEM/F12, to dissociate organoids to single cells or small fragments.Count the number of fragments with a haemocytometer, and calculate the required media volume as follows:100,000–300,000 cells, or 1,000–5,000 fragments in 3.5 mL/well for a 6-well suspension plate.500,000 cells or 10,000 fragments in 17.5 mL in a bioreactor tube.Resuspend single cells and/or fragments in human IntestiCult organoids growth medium or colorectal tumoroid maintenance medium (see Recipes) containing 5% Matrigel and 10 µM Y-27632. Transfer to wells or bioreactor tubes.Incubate in 5% CO2 incubator at 37°C.Replace media with fresh human in human IntestiCult organoids growth medium or colorectal tumoroid maintenance medium containing 10 µM Y-27632 every two days. To change medium, allow the culture plates to settle in a tissue culture hood for 5 min, before removing supernatant. Remove half of the medium (2–3 mL) without disturbing the organoids. Tilt the plate to facilitate removal of medium if necessary.",
    "Add 2–3 mL of fresh medium, and mix by pipetting approximately 10 times with a 1,000-µL tip without touching the bottom of the well, to scramble up organoids. When using bioreactor tubes for culturing, tubes sit on the rack in the incubator. Shake tubes vigorously every 24 h to mix well. Agitating bioreactors with a shaker in the incubator can improve culture condition with adequate air exchange.Notes:  Y-27632 can be omitted once organoids are established. Always use filter tips that are pre-rinsed with DMEM/F12 + 1% BSA, to avoid loss of organoids from pipetting. Observe cultures every day, and scramble cells/organoids with pipettes if these adhere to the bottom. Medium change can also be performed by transferring cultures into centrifuge tubes, centrifuging in a tabletop centrifuge at 500 × g and 4°C for 5 min, replacing supernatant with fresh medium, and plating back into culture plates. When using bioreactor tubes, centrifuge at in a tabletop centrifuge at 500 × g and 4°C for 10 min, so that the organoids settle down at the bottom before removing the supernatant. To minimize the loss of organoids during medium change, centrifuge the collected supernatant in a tabletop centrifuge at 500 × g and 4°C for 5 min, or in a benchtop centrifuge at 6,000 rpm and room temperature for 1 min. Discard the supernatant, resuspend the pellet with 500 µL of fresh medium, and plate them back to the original well. Cryopreservation Collect organoids/tumoroids into centrifuge tubes.Centrifuge in a tabletop centrifuge at 500 × g and 4°C for 5 min.Discard the supernatant, and re-suspend the pellet with 5 mL of PBS.Centrifuge in a tabletop centrifuge at 500 × g and 4°C for 5 min.Discard the supernatant.Notes:  A turbid layer of ECM may be present after centrifugation.",
    "As long as the ECM does not contain organoids, it should be aspirated with pipettes and discarded. For early organoids/tumoroids collected 3–5 days after last passaging, go to step E6 directly. For mature organoids/tumoroids that were cultured for 1–2 weeks, digest with 1 mL of TrypLE Express Enzyme at 37°C for 10–15 min as needed, followed by washing with 1 mL of 1% BSA in DMEM/F12 to terminate the digestion. Suspend pellets in 1 mL of CryoStor® CS10 freezing media per cryotube, to ensure a homogenous suspension.Note: Organoids/tumoroids should be cryopreserved at the density of 10,000 organoids or 2 million viable cells per vial. Cryopreserve organoids/tumoroids at a rate of 1°C/min, using a CoolCell LX Cell Freezing Container. Keep the freezing container in a -80°C freezer for more than 8 h before transferring the cryotubes to liquid nitrogen vapor phase, for long-term storage.Thawing Thaw the frozen organoids/tumoroids in a 37°C water bath.Gently transfer organoid suspension to a centrifuge tube, using a 1,000-µL pipette.Add 9 mL of DMEM/F12 containing 10 µM Y-27632 media.Centrifuge in a tabletop centrifuge at 300–500 × g and 4°C for 3 min.Discard supernatant and re-suspend pellets in 3.5 mL of fresh human IntestiCult organoids growth medium, or colorectal tumoroid maintenance medium, containing 5% Marigel and 10 µM Y-27632. Transfer to 6-well suspension culture plates.Incubate in 5% CO2 humidified incubator at 37°C."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}