{
  "id": 6652,
  "origin_website": "Bio",
  "title": "Differentiation of Mouse Embryonic Stem Cells to Neuronal Cells  Using Hanging Droplets and Retinoic Acid",
  "procedures": [
    "Coating of platesAdd enough 0.1% Gelatin to cover the bottom of a tissue-culture treated flask or plate (for example, 1.5 ml of 0.1% Gelatin for a T25 flask).Incubate for at least 10 min at room temperature or 37 °C.Carefully remove the 0.1% Gelatin and add mouse embryonic stem cell (mESC) medium (see Recipes).Note: Washing plates is not necessary when carefully removing gelatin.Recovery of cells from liquid nitrogenPrepare suitable plate as described above.Collect cryo tube with mESCs from liquid nitrogen and quickly thaw in a water bath at 37 °C.Slowly add culture medium with LIF to cells in cryo tube and transfer to a 15 ml tube with approximately 10 ml of medium with LIF.Note: Slowly adding medium to ESCs prevents damage due to sudden changes in osmotic pressure. Pellet cells for 5 min at 200 x g and remove supernatantResuspend cells in appropriate amount of medium with LIF and add to gelatin-coated plate. Maintaining and splitting mESCsRemove mESC medium from flask or plate and wash cells with PBS.Note: See Figure 1 for example of v6.5 cells ready for splitting.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191030/20191030022003_1787.jpgFigure 1. Confluent v6.5 mESCs. Scale bar = 50 µm.Remove PBS carefully and add enough 0.05% Trypsin (see Recipes) to cover cells (for example, 1 ml of 0.05% trypsin in a T25 flask).Incubate at 37 °C. Usually 3-5 min is enough for all cells to dissociate. Note: Do not leave mESCs in trypsin for too long as it will harm the cells. Transfer the required number of cells to a new flask with the appropriate amount of mESC medium containing LIF. Trypsin can be removed by centrifugation, but this is not necessary for v6.5 cells.Note: Take care when pipetting mESCs with small (non-serological) pipette tips, they can be easily damaged.  Split mESCs every 2-3 days, avoid letting mESCs getting over-confluent.",
    "Note: Avoid culturing mESCs for more than 10 passages.Preparing embryoid bodies (EBs) using hanging droplets (Day 1, see also Video 1 for Steps B5-B7)Trypsinize mESCs as described above, be sure to have single cells. Resuspend in mESC medium without LIF.Carefully count the cells using a hemocytometer or any other preferred method.Adjust concentration to approximately 2 x 104 cells/ml using mESC medium without LIF.Note: Slight deviations from this concentration is not a problem. Using a multichannel pipette, place 20 µl droplets of the cell suspension on the inside of a plastic Petri dish lid (not tissue-culture treated and not gelatin-coated). We aim for approximately 100 droplets on a 90 mm plate but depending on how many EBs are required, the size of the dish can be easily scaled up or down. Note: Avoid touching the surface of the Petri dish with the pipette tip as this tends to make the droplets flatter and more spread out.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Preparation of hanging droplets on Petri dish Add 10 ml of water or PBS to the bottom half of the Petri dish to prevent desiccation.In one smooth movement, turn the lid with the droplets upside down and place on top of the bottom part of the Petri dish containing water or PBS.Place in 37 °C, 5% CO2 incubator for 48 h (Day 3).EB formation can be observed directly using a non-inverted microscope or using an inverted microscope by placing the lid with hanging droplets onto the empty bottom part of a Petri dish followed by carefully inverting the Petri dish. EBs should form within 24 h. See Figure 2 for example of EBs of v6.5 cells 24 h after preparation of hanging droplets.",
    "Note: Differentiation can be confirmed by measuring the downregulation of pluripotency markers such as Nanog, Pou5f1 and Sox2 by quantitative real time PCR or Western blot.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191030/20191030022052_7458.jpgFigure 2. Typical morphology of embryoid body. v6.5 cells were cultured in hanging droplets in mESC medium without LIF for 24 h (left) and 48 h (right).Differentiation of EBs using retinoic acidAfter 48 h in droplets, the EBs are collected by adding PBS to the Petri dish lids and collecting the supernatant containing the EBs. Note: It might require some pipetting up and down to dislodge all the EBs as they tend to stick to the plastic surface. Use serological pipettes as smaller pipettes are likely to damage the EBs. The supernatant containing EBs can be collected in either 15 or 50 ml tubes depending on the volume used. Leave the tubes upright for 5 min or more to allow the EBs to settle on the bottom of the tubes. Remove the supernatant and resuspend the EBs in 10 ml mESC medium without LIF.Add the 10 ml EB suspension to a 90 mm Petri dish (not culture treated and not gelatin-coated) and grow for another 48 h at 37 °C and 5% CO2 (day 5). Note: The resuspension volume and size of the plate can be adjusted to the number of EBs required, we aim for approximately 100 EBs/90 mm dish. After 48 h of incubation, replace the medium with 10 ml of fresh mESC medium without LIF using the method described in Steps E2 and E3 and add Retinoic acid to a final concentration of 250 nM.Note: The concentration of Retinoic acid is likely to be cell line dependent.",
    "Continue to culture for another 7 days (Day 12) whilst replacing the medium with fresh mESC medium without LIF supplemented with 250 nM retinoic acid every 2 days. See Figure 3 for example of EB 7 days after RA treatment. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191030/20191030022121_5119.jpgFigure 3. Embryoid bodies after 7 days of retinoic acid treatment. Scale bar = 500 µm.After these 7 days (on Day 12), the EBs can be collected as described in Steps D2 and D3 and seeded on tissue-cultured treated, gelatin-coated plates or flasks. At this point, EBs will attach and cells will start to migrate from the EBs within 24 h. See Figure 4 for example of EB 24 h after attachment to gelatin-coated plate and Figure 5 for EBs 7 days after attachment, showing considerable migration and growth of cells of neuronal lineage.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191030/20191030022145_5111.jpgFigure 4. Embryoid bodies 24 h after plating on gelatin-coated plates showing migration of differentiated cells from embryoid body. Scale bar = 500 µm.At this point, the cells are differentiated into cells of neuronal lineage and can be directly used for further experiments or frozen down.Note: Differentiation into cell of neuronal lineage can be verified through measuring gene expression of genes such as Neurog2, Gata4, Gata6, Nestin, Sox1 and TuJ1 by quantitative real time PCR or Western blot (Ying et al., 2003; Witteveldt et al., 2019). To ensure a homogeneously differentiated population, lineage selection by cell-sorting based on fluorophore-expression driven by lineage-specific promoters or immune-isolation by lineage-specific extracellular markers (Jüngling et al., 2003; Ladewig et al., 2008) might be necessary. When multiple replicates are required we suggest to differentiate individual replicates.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191030/20191030023020_6082.jpgFigure 5. Embryoid bodies 7 days after plating on gelatin coated plates showing migration and growth of differentiated cells of neuronal lineage with clearly changed morphology. Scale bar = 20 µm."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}