{
  "id": 18324,
  "origin_website": "Jove",
  "title": "Murine Echocardiography of Left Atrium, Aorta, and Pulmonary Artery",
  "procedures": [
    "All animals were cared for in accordance with the guidelines of the National Institutes of Health Guide for the Care and Use of Laboratory Animals at Baylor College of Medicine.\n1. Set-up\nTurn on the echocardiographic system. Start the software by selecting \"Cardiac Measurements\" from the drop down menu displayed and click \"Initialize\".\nTo begin a new study click on the \"New\" button on the upper part of the screen and enter the demographic information of the mouse in study. For example mouse ID, sex, date of birth as well as the name of the operator doing the study.\nTurn on the temperature-controlled EKG board by clicking the \"TEMP ON/OFF\" button. Set it to a temperature of 39 °C using the up and down arrows.\nTo start setting up the anesthesia chamber, first make sure the oxygen and isoflurane levels are appropriate in each of the delivery systems.\nPlace the mouse in the anesthesia chamber and induce with isoflurane and oxygen until recumbent and then transfer it to face mask. Confirm that the mouse is properly anesthetized by pinching its paw and checking for lack of movement. Maintain the isoflurane at the lowest possible level that avoids a positive paw withdrawal response.\nPlace the mouse in a supine position on the temperature-controlled EKG board and tape each paw to the correspondent transducer element on the board. Optionally, use transducer cream to improve the signal.\nApply artificial tears ophthalmic lubricant ointment on the mouse's eyes to prevent dryness.\nOnce the mouse is taped to the EKG board, observe an EKG tracing in the lower part of the monitor. Monitor the heart rate throughout the whole study to ensure best results. A heart rate of 400 beats/min is ideal. Heart rates below this range may suggest isoflurane effects.",
    "Make sure the mouse keeps receiving oxygen and isoflurane by face mask.\nUse an electric razor to shave the body fur from the mouse's anterior thorax and upper abdominal area. Use depilatory cream if necessary to further ensure fur removal.\nPut a generous amount of transducer gel in the chest of the mouse.\n2. Image Acquisition\nLeft Atrium measurement\nLocate the handle beneath the EKG board. Use the handle to adjust the angle of the movable EKG board in which the mouse was placed. Begin by adjusting the EKG board to a 30 - 45° angle along the X axis and 0° angle along the Y axis. Authors refer to it as \"supine\" position. Use this position for all of the Left Atrium measurements acquisition.\nPlace the 25 MHz scan head in the echocardiographic movable arm clamp in a long axis view. Make sure to select the Cardiac Measurement Filter and 2D B-Mode in the echocardiographic system.\nNotice that the echocardiographic set has X and Y axis adjustment torques that can be moved clockwise or counterclockwise. Rotate them to get a long axis view of the heart at the level of the aortic outflow tract and acquire a 5 s movie recording. Acquire the scan by pressing the \"Cine Store\" button on the keyboard of the echocardiographic system. Use this to calculate the Superior-Inferior measurement of the LA.\nAfter the movie acquisition, switch the echocardiographic view to M-Mode by pressing the \"M-Mode\" button on the keyboard of the echocardiographic system.",
    "Observe a sagittal view and a cursor. Place the cursor so that it encompasses the whole LA at the level of the aortic outflow tract. Acquire 3 images of this new view. Acquire the scan by pressing the \"Frame Store\" button on the keyboard of the echocardiographic system. Use this to calculate the Anterior-Posterior measurement of the LA.\nReturn to B-Mode by pressing the \"B-Mode\" button on the keyboard of the echocardiographic system.\nRotate the movable arm clamp of the set 90° clockwise. This will set the scan head in a short axis view.\nUsing the Y axis torque find the intraarticular septum. Make sure to visualize the wall of the atrium. Acquire a 5 s movie recording. Acquire the scan by pressing the \"Cine Store\" button on the keyboard of the echocardiographic system. Use this to calculate the Medio-Lateral measurement of the LA.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55214/55214fig1.jpg\nFigure 1: \"Supine\" Position. Representation of a mouse in the \"Supine\" Position. Approximately 30 - 45° angle along the X axis and 0° angle along the Y axis. This position is used to acquire all of the Left Atrium measurements. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/55214/55214fig1large.jpg]\nGreat Vessels Measurement\nContinue by exchanging the 25 MHz scan head for the 30 MHz scan head. Remove the 25 MHz scan head from the movable arm clamp and place the 30 MHz scan head instead. Make sure to select the Abdominal Measurements Filter and 2D B-Mode in the echocardiographic system.",
    "Locate the handle beneath the EKG board. Use the handle to adjust the angle of the movable EKG board in which the mouse lies. Begin by adjusting the EKG board to a 5° angle along the X axis and 60° angle along the Y axis. Use this podition for the acquisition of the Aorta and Pulmonary Artery measurements. Refer to this as \"standing-up\" position.\nUsing the X and Y axis adjustment torques in the echocardiographic set, get a long axis view of the heart at the level of the aortic outflow tract and acquire a 5 s movie recording. Acquire the scan by pressing the \"Cine Store\" button on the keyboard of the echocardiographic system. Use this to calculate the Aortic Diameter.\nAfter the movie acquisition, rotate the movable arm clamp of the set 90° clockwise. This will set the scan head in a short axis view.\nUsing the Y axis torque locate the Pulmonary Artery at the level of its bifurcation and acquire a 5 s movie recording. Acquire the scan by pressing the \"Cine Store\" button on the keyboard of the echocardiographic system. Use this to calculate the Pulmonary Artery Diameter.\n\t\tNOTE: The researcher may use Doppler imaging as a tool to ensure correct identification of the Pulmonary Artery. If desired, once completing step 2.2.5 press the \"PW\" button on the keyboard of the echocardiographic system to obtain Doppler imaging. If characteristic pulmonary wave tracings are seen, the researcher can be reassured that the correct location was identified.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55214/55214fig2.jpg",
    "Figure 2: \"Standing-up\" Position. Representation of a mouse in the \"Standing-up\" Position. Approximately 5° angle along the X axis and a 60° angle along the Y axis. This position is used to acquire the Aorta and Pulmonary Artery diameters. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/55214/55214fig2large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/55214/55214fig3.jpg\nFigure 3: Pulmonary Artery Doppler. Characteristic Pulmonary Artery Doppler imaging. The researcher may use Doppler imaging as a tool to ensure correct identification of the Pulmonary Artery. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/55214/55214fig3large.jpg]\n3. Post Procedure Animal Recovery\nTo safely remove the mouse from the EKG board, remove the gel from the chest of mouse and remove the tape from the extremities.\nTurn off the anesthesia and oxygen delivery systems. Return the mouse to its cage and do not leave the mouse unattended until it has regained sufficient consciousness to maintain sternal recumbency.\n4. Image Analysis\nImage Transferring\nUse a USB flash drive to transfer the images collected in the echocardiographic system into a computer. Insert the USB flash drive into a USB port in the echocardiographic system.\nSelect the study or studies to transfer by clicking on the study name(s).\nClick on the \"Copy To\" button located on the upper part of the screen. A new window showing files and directories will appear. Select the directory corresponding to the USB flash drive just inserted and click \"OK\".\nRemove the USB flash drive from the echocardiographic system and insert it into a USB port in the computer to be used for analysis.",
    "Launch the echocardiographic software. Click on the \"Copy From\" button located on the upper part of the screen. Observe a new window showing files and directories. Select the studies to be copied from the directory corresponding to the USB flash drive just inserted and click \"OK\".\nAfter copying the files, observe them in the study list. To begin analyzing a study, double click on its name and select the name of the operator analyzing.\nLeft Atrium Analysis\n\tNOTE: For all the following atrial measurements use the EKG as a guide to select the P-wave as the point where the researcher wants to measure the LA. This corresponds to the pre-atrial contraction time when the LA is at its largest capacity.\n\t\nSelect the movie clip corresponding to the Superior-Inferior dimension of the Left Atrium (Step 2.1.3). Determine the pre-atrial contraction time using the EKG as a guide. This way the cavity is measured at its largest capacity.\nFrom the tool bar on the top of the screen, click on \"Tools\" and then \"Measurements\". A new window will appear. Click on the \"Linear distance Measurement Tool\" icon (it corresponds to the first icon on the left upper corner of the window). Measure the cavity at its largest diameter.\nSelect the image corresponding to the Anterior-Posterior dimension of the Left Atrium (Step 2.1.5). Determine the pre-atrial contraction time using the EKG as a guide. This way the cavity is measured at its largest capacity. To measure it repeat step 4.2.2.",
    "Select the image corresponding to the Medio-Lateral dimension of the Left Atrium (Step 2.1.8). Determine the pre-atrial contraction time using the EKG as a guide. This way the cavity is measured at its largest capacity. Measure the cavity from the interatrial septum to the opposing wall in a diagonal fashion. To measure it repeat step 4.2.2.\n\t\tNOTE: Repeat steps 4.2.1 thru 4.2.4 at least 3 times and acquire the average values to minimize error.\nGreat Vessels Analysis\n\tNOTE: For all the following great vessels measurements use the EKG as a guide to select a time after the QRS complex as the point where the researcher wants to measure. This corresponds to the point where the great vessels are at their largest capacity.\n\t\nSelect the movie clip corresponding to the Aorta (Step 2.2.3). Determine a point after the QRS using the EKG. Measure the diameter at a 90° angle using the vessel wall as a reference. To measure it repeat step 4.2.2\nSelect the movie clip corresponding to the Pulmonary Artery (Step 2.2.5). Determine a point after the QRS using the EKG. Measure the diameter at a 90° angle using the vessel wall as a reference. Select a plane above the pulmonary artery bifurcation. To measure it repeat step 4.2.2.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}