{
  "id": 19834,
  "origin_website": "Wiley",
  "title": "Quantitative Proteomic Analysis of the Senescence-Associated Secretory Phenotype by Data-Independent Acquisition",
  "procedures": [
    "The method described here allows for the generation of senescent cells by X-rays (IR) and appropriate control cells. From these two cell populations, the researcher will later generate the SASP-containing and control CM (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0007] and Alternate Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0008]). Cells are seeded at the desired density, cultured overnight, and irradiated the following day. After IR, medium is replaced with fresh complete medium. Then, medium is switched to fresh complete medium every 2 days. Three days before the irradiated cells reach a full senescent state, control cells are seeded and cultured overnight. These control cells are derived from the same stock culture used to seed the irradiated cells and have been cultured in parallel up to this point. The next day, control cells are mock irradiated. This protocol has been optimized for IMR-90 primary human fetal lung fibroblasts and can serve as a guide for the use of other adherent human cells.\nMaterials\nDesired cell type, e.g., human primary fibroblasts strain IMR-90 (ATCC, cat. no. CCL-186), WI-38 (ATCC, cat. no. CCL-75), or BJ (ATCC, cat. no. CRL-2522)\nComplete medium (CM) appropriate for the cell type used, e.g., complete medium composition for IMR-90 fibroblasts: DMEM (Gibco brand, Thermo Fisher Scientific, cat. no. 12430-054) supplemented with 100 U/ml penicillin-streptomycin (Gibco brand, Thermo Fisher Scientific, cat. no. 15070063) and 10% FBS (Gibco brand, Thermo Fisher Scientific, cat. no. 2614079)\nSerum-free, phenol red-free medium, e.g., when culturing IMR-90 fibroblasts, use phenol red-free DMEM (Gibco brand, Thermo Fisher Scientific, cat. no. 21063-029) supplemented with 100 U/ml penicillin-streptomycin (Gibco brand, Thermo Fisher Scientific, cat. no. 15070063) to avoid interference in subsequent protein concentration measurements, such as bicinchoninic acid (BCA) assays\nDulbecco's PBS (Gibco brand, Thermo Fisher Scientific, cat. no. 21600-010)\nTrypsin-EDTA (Corning, cat. no. 25-051-CI)",
    "Incubator set at optimal conditions of temperature and partial pressure of air gases to mimic physiological requirements of the cell type used, e.g., IMR-90 cells are cultured at 37°C, 3% O2, and 10% CO2 in HERA CELL 240i CO2 incubators (Thermo Fisher Scientific, cat. no. 51026331)\nT175 tissue culture flasks (Genesee Scientific, cat. no. 25-211)\nX-ray generator (Polaris 320 kV X-ray Generator Set; X-Ray Associates)\nGenerate senescent cells\n1. Seed three T175 flasks with 2 × 106 fibroblasts each (or other cell type of interest), using complete DMEM (or other medium optimized for the cell type used); culture overnight. These cells will be used to generate SASP-containing CM. Seed (at least) three replicates per condition to ensure that changes observed in the MS data can be statistically analyzed.",
    "The number of cells needed to obtain enough SASP protein for MS analysis may vary depending on the cell type and MS instrumentation available. Ideally, the total amount of secreted protein for each replicate should be >50 μg. If less protein is available, the protocol should be optimized for smaller protein amounts and tested. To estimate the level of protein secretion, conduct a pilot experiment by seeding the desired number of cells, allowing them to recover overnight, then wash them twice with PBS, add serum-free, phenol red-free medium, collect CM 24 hr later, and perform a BCA assay. This quantification will allow an estimation of the number of cells needed to obtain enough SASP protein for MS analysis. Culture medium used during this step must be free of serum and, as much as possible, of protein components and/or contaminants. This way, the protein concentration measured will reflect only the protein secreted by the cells. Also, the CM needs to be phenol red free because this compound interferes with the quantification of proteins using BCA.\n2. Treat fibroblasts the next day with 15 Gy IR to induce senescence and then replace medium with fresh complete medium.\nFibroblasts will develop a full senescent phenotype ∼10 days later. By then, almost all fibroblasts should develop the enlarged, flattened morphology associated with senescence. The replacement of medium should not wash off cells as senescent fibroblasts tend to stick to plates more firmly than their control counterparts. The radiation dose and time needed may vary depending on the cell type.\n3. Replace medium with fresh complete medium every 2 days until day 6 (including on day 6) after IR treatment. On day 8, proceed with Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0007], step 1-2 (or Alternate Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0008]) to prepare cells for subsequent CM collection.\nGenerate control cells",
    "4. Seed flasks with control fibroblasts 7 days after IR treatment of experimental cells (that is, 3 days before the IR-treated fibroblasts reach a full senescent phenotype) and allow them to recover overnight.\nThese cells will be used to generate control CM.\n5. On the next day, mock irradiate control cells by placing them into the X-ray chamber without irradiating them. Leave control cells in the X-ray chamber for the same amount of time that it took to give the irradiated cells their full dose of radiation.\n6. After mock irradiation, proceed to Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0007] (or Alternate Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0008]).",
    "This method allows for the generation of senescent cells upon treatment with the chemotherapeutic drug doxorubicin and appropriate control cells. From these two cell populations, the researcher will later generate the SASP-containing and control CM (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0007] and/or Alternate Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0008]). Cells are seeded at the desired density, cultured overnight, and treated with doxorubicin for 24 hr. Thereafter, cells are washed with PBS, fresh medium is added, and cells are cultured until the development of a full senescent phenotype. Four days before the doxorubicin-treated cells reach full senescence, the control cells are seeded and cultured overnight. These control cells are derived from the same stock culture used to seed the doxorubicin-treated cells and have been cultured in parallel up to this point. The next day, control cells are treated with vehicle, dimethyl sulfoxide (DMSO), for 24 hr. This protocol has been optimized for IMR-90 primary human fetal lung fibroblasts and can serve as a guide for the use of other adherent human cells.\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0001])\nDoxorubicin stock solution (2.5 mM in DMSO; see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-rec-0001])\nDMSO (MilliporeSigma, cat. no. 67-68-5)\nGenerate senescent cells\n1. Seed three T175 flasks with 2 × 106 fibroblasts each (or other cell type) using the appropriate complete medium and culture overnight. These cells will be used to generate SASP-containing CM. Seed (at least) three replicates to ensure changes observed in the MS data can be statistically analyzed.\nThe number of cells needed to obtain enough SASP protein for MS analysis may vary depending on the cell type and MS instrumentation available. To verify that protein concentrations are sufficient for downstream MS analyses, see step 1 comment in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0001].",
    "2. On the next day, dilute doxorubicin stock solution (2.5 mM doxorubicin in DMSO) in complete medium for a final concentration of 250 nM doxorubicin (dilution 1/10,000).\n3. Remove culture medium from the flasks and then switch to doxorubicin-containing medium. Incubate 24 hr to induce senescence.\nFibroblasts will develop a full senescent phenotype 10 days later. By then, almost all fibroblasts should develop the enlarged, flattened morphology associated with senescence. The dose of doxorubicin and time needed may vary depending on the cell type.\n4. After doxorubicin treatment, wash cells twice with 25 ml PBS and add fresh complete medium. Then replace medium every 2 days until day 6 (including on day 6) after the beginning of doxorubicin treatment. On day 8, proceed with Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0007], step 1-2 (or Alternate Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0008]) to prepare the cells for subsequent CM collection.\nGenerate control cells\n5. Seed new flasks with fibroblasts 6 days after doxorubicin treatment (that is, 4 days before the doxorubicin-treated cells reach senescence) and allow cells to recover overnight.\nThese cells will be used to generate quiescent control CM.\n6. On the next day, treat control cells with vehicle (DMSO) for 24 hr.\n7. After treatment with vehicle DMSO, proceed to Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0007] (or Alternate Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0008]) to prepare cells for subsequent CM collection.",
    "The method described here allows for the generation of senescent cells via oncogenic RAS overexpression and appropriate control cells. From these cell populations, the researcher will later generate SASP-containing and control CM (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0007] and/or Alternate Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0008]). Cells transduced with a pLVX-RASV12 vector or green fluorescent protein (GFP) control vector are seeded at the desired density, allowed to recover overnight, then cultured with doxycycline to induce RAS or GFP overexpression. Medium is changed every 2 days with fresh complete medium containing doxycycline. Three days before the RAS-overexpressing cells reach a full senescent phenotype, GFP-overexpressing control cells are re-seeded and cultured overnight. Until then, it is important to passage the control cells when appropriate (after reaching 80%-90% confluency) because these cells keep proliferating. This protocol has been optimized for IMR-90 primary human fetal lung fibroblasts and can serve as a guide for the use of other adherent human cells.\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0001])\nDesired cell type transduced with the inducible vector pLVX (Lenti-X™ Tet On® Advanced Inducible Expression System; Takara Bio, cat. no. 632162) expressing either a constitutively active RASV12 oncogene or GFP (Basisty, Kale, Jeon, et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-bib-0001]), e.g., IMR-90 primary human fetal lung fibroblasts (ATCC, cat. no. CCL-186) transduced with pLVX-RASV12 or pLVX-GFP (Basisty, Kale, Jeon, et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-bib-0001])\nTetracycline-free FBS (tet-free FBS; Takara Bio, cat. no. 631105)\nDoxycycline hyclate (MilliporeSigma, cat. no. D9891-5G)\nGenerate senescent and control cells",
    "1. Seed three T175 flasks with 1.5 × 106 fibroblasts transduced with pLVX-RASV12 (RAS cells) and three T175 flasks with 1.5 × 106 fibroblasts transduced with pLVX-GFP (GFP cells). Use the appropriate complete medium and allow cells to recover overnight. Use medium containing tet-free FBS to ensure that RASV12 or GFP is not expressed until the addition of doxycycline. These cell populations will be used to generate SASP-containing or control CM, respectively. Seed (at least) three replicates for each condition to ensure changes observed in the MS data can be statistically analyzed.\nThe number of cells needed to obtain enough SASP protein for MS analysis may vary depending on the cell type and MS instrumentation available. To verify that protein secretion is sufficient for downstream MS analyses, see step 1 comment in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0001].\n2. The next day, treat the two fibroblast populations with 1 μg/ml doxycycline, which will trigger senescence in RAS cells while serving as a control treatment for GFP cells.\nFibroblasts will develop a full senescent phenotype ∼7 days later. By then, almost all fibroblasts should develop the enlarged, flattened morphology associated with senescence. The time needed may vary depending on the cell type used.\n3. Replace medium for both cell populations with fresh culture medium containing doxycycline every 2 days until day 4 (including on day 4) after the beginning of treatment. On day 5, proceed with Alternate Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0008], step 1-2 (or Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0007], step 1-2) to prepare cells for subsequent CM collection.",
    "Note that RAS cells will undergo a hyperproliferative phase before undergoing growth arrest. Importantly, IMR-90 fibroblasts induced to senescence by oncogenic RAS overexpression are not viable in low serum. Therefore, after completing Alternate Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0003], we suggest using Alternate Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0008] (rather than Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0007]) when using this method of senescence induction in fibroblasts.\nNote that when instructed to feed cells with fresh medium in Alternate Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0008] (or Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0007]), such medium must be supplemented with doxycycline. Only serum-free medium given to both cell populations 24 hr before CM collection (see Collect CM sections in Alternate Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0008] or Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0007]) should be devoid of doxycycline.",
    "The method described here allows for generating senescent cells by mitochondrial dysfunction—mitochondrial dysfunction-associated senescence (MiDAS)—and appropriate control cells. From these cell populations, the researcher will later generate the SASP-containing and control CM (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0007] and/or Alternate Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0008]). Cells are seeded at the desired density, cultured overnight, and treated with either the mitochondrial complex III inhibitor Antimycin A or vehicle DMSO. Medium is replaced every 2 days with fresh complete medium containing either Antimycin A or DMSO. Three days before the Antimycin A-treated cells reach a full senescent phenotype, DMSO treated cells are re-seeded and cultured overnight. Until then, it is important to passage the DMSO-treated cells when appropriate (after reaching 80%-90% confluency) because these cells keep proliferating. This protocol has been optimized for IMR-90 primary human fetal lung fibroblasts and can serve as a guide for other types of adherent human cells.\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0001])\nAntimycin A from Streptomyces species (MilliporeSigma, cat. no. A8674-25MG)\nDMSO (MilliporeSigma, cat. no. 67-68-5)\nGenerate senescent and control cells\n1. Seed six T175 flasks (three for Antimycin A treatment and three for DMSO treatment) with 2 × 106 fibroblasts each using appropriate complete medium and culture overnight. These cells will be used to generate SASP-containing or control CM. Seed (at least) three replicates for each condition to ensure that changes observed in the MS data can be statistically analyzed.\nThe number of cells needed to obtain enough SASP protein for MS analysis may vary depending on the cell type and MS instrumentation available. To verify that protein secretion is sufficient for downstream MS analyses, see step 1 comment in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0001].\n2. The next day, treat fibroblasts with 250 nM Antimycin A or vehicle DMSO.",
    "Cells treated with Antimycin A will become senescent and generate the SASP-containing CM. Cells treated with DMSO will be used as quiescent controls to generate the control CM.\nFibroblasts will develop a full senescent phenotype ∼10 days later. By then, almost all fibroblasts should develop the enlarged, flattened morphology associated with senescence. The concentration of Antimycin A and time needed may vary depending on the cell type used.\n3. Replace medium for both cell populations with fresh culture medium containing Antimycin A or DMSO every 2 days until day 6 (including on day 6) after the beginning of treatment. On day 8, proceed to the Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0007], step 1-2 (or Alternate Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0008], step 1-2) to prepare cells for subsequent CM collection.\nNote that DMSO-treated cells will keep proliferating, so they must be passaged when appropriate (after reaching 80%-90% confluency).\n4. To generate control cells, re-seed proliferating DMSO-treated control cells 7 days after the beginning of vehicle treatment (that is, 3 days before Antimycin A-treated cells reach a full senescent phenotype). By doing so, it will be possible to obtain similar numbers of senescent and control cells when collecting their CM.\n5. Allow control DMSO-treated cells to recover overnight and then, on the next day, proceed to Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0007] (or Alternate Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0008]) to prepare cells for subsequent CM collection.\nNote that when instructed to feed cells with fresh medium in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0007] (or Alternate Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0008]), medium must be supplemented with 250 nM Antimycin A or vehicle DMSO. Only serum-free medium given to both cell populations 24 hr before CM collection (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0007], step 3-5) should be devoid of Antimycin A or DMSO.",
    "The method described here allows for the generation of senescent cells upon treatment with the anti-HIV drugs atazanavir and ritonavir (ATV/r), as well as appropriate control cells. From these cell populations, the researcher can generate SASP-containing and control CM (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0007] and/or Alternate Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0008]). Cells are seeded at the desired density, cultured overnight, and treated with either ATV/r or vehicle (DMSO). Medium is changed every 2 days with fresh complete medium containing either ATV/r or DMSO. Three days before the ATV/r-treated cells reach a full senescent phenotype, DMSO treated cells are re-seeded and cultured overnight. Until then, it is important to passage the DMSO-treated cells when appropriate (after reaching 80%-90% confluency) because these cells keep proliferating. This protocol has been optimized for IMR-90 primary human fetal lung fibroblasts and can serve as a guide for the use of other adherent human cells.\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0001])\nAtazanavir/ritonavir (ATV/r) stock solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-rec-0002])\nDMSO (MilliporeSigma, cat. no. 67-68-5)\nGenerate senescent and control cells\n1. Seed six T175 flasks (three for ATV/r treatment and three for DMSO treatment) with 2 × 106 fibroblasts each using the appropriate complete medium and culture them overnight. These cells will be used to generate SASP-containing or control CM. Seed (at least) three replicates for each condition to ensure that changes observed in the MS data can be statistically analyzed.\nThe number of cells needed to obtain enough SASP protein for MS analysis may vary depending on the cell type and MS instrumentation available. To verify that protein secretion is sufficient for downstream MS analyses, see step 1 comment in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0001].\n2. On the next day, treat fibroblasts with 25 μM ATV/r or vehicle DMSO.",
    "Cells treated with ATV/r will become senescent and generate SASP-containing CM. Cells treated with DMSO will be used as quiescent controls to generate the control CM.\nFibroblasts will develop a full senescent phenotype ∼14 days later. By then, almost all fibroblasts should develop the enlarged, flattened morphology associated with senescence. The concentration of ATV/r and time needed may vary depending on the cell type.\n3. Replace medium for both cell populations with fresh complete medium containing either ATV/r or DMSO every 2 days until day 10 (including on day 10), and on day 12 proceed with Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0007], step 1-2 (or Alternate Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0008], step 1-2) to prepare the cells for subsequent CM collection.\nNote that DMSO-treated cells will keep proliferating, so they will have to be passaged when appropriate (after reaching 80%-90% confluency).\n4. Re-seed proliferating DMSO-treated control cells 11 days after the beginning of vehicle treatment (that is, 3 days before ATV/r-treated cells reach full senescence). By doing so, it will be possible to obtain similar numbers of senescent and control cells when collecting CM.\n5. Allow control DMSO-treated cells to recover overnight and then proceed to Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0007] (or Alternate Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0008]) to prepare cells for subsequent CM collection.\nNote that when instructed to feed cells with fresh medium in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0007] (or Alternate Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0008]), such medium must be supplemented with ATV/r or DMSO for the culture of senescent or control cells, respectively. Only serum-free medium given to both cell populations 24 hr before CM collection (Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0007], step 3-5) will be devoid of ATV/r and DMSO.",
    "This protocol describes multiple assays to verify that the senescence induction performed in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0001] (or Alternate Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0002] through 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0005]) has been successful. Support Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0006] is used to prove that the secreted proteins to be analyzed by MS are produced by senescent cells and therefore part of an SASP. This supporting protocol should be performed when the researcher uses any combination of a senescence inducer (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0001] or Alternate Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0002] through 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0005]) and a desired cell type. These assays are not compatible with the generation of CM described in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0007] (or Alternate Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0008]) because they require fewer cells compared to the number needed to analyze secreted proteins by MS. Therefore, cells should be seeded in the appropriate tissue culture dishes (specified in each of the corresponding assay protocols below) to perform the assays described and then the chosen senescence induction method (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0001] or Alternate Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0002] through 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0005]) is performed. Once senescent and control cells are generated, the steps described below must be performed for each assay. The assays we recommend are used to verify reduced cell proliferation (see step 1-8), upregulation of senescence-associated β-galactosidase (SA-β-gal) activity (see step 9-14), and a gene transcription signature associated with senescence (see step 15-21). We also recommend performing a viability assay (see step 22-30) to verify that both senescent and control cells are healthy before generating CM for MS analysis.\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0001] and Alternate Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0002], 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0003], 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0004], and 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0005])\nApplied Biosystems MultiScribe Reverse Transcriptase Kit (Thermo Fisher Scientific, cat. no. 43-112-35)\nSerum-free medium: for IMR-90 fibroblasts, use DMEM (Gibco brand, Thermo Fisher Scientific, cat. no. 12430-054) supplemented with 100 U/ml penicillin-streptomycin (Gibco brand, Thermo Fisher Scientific, cat. no. 15070063)",
    "Click-iT EdU Kit Alexa Fluor 488 HCS Assay (Thermo Fisher Scientific, cat. no. C10351)\nSenescence Detection Kit (BioVision, cat. no. K320-250)\nX-gal (Life Technologies, cat. no. 15520-018)\nISOLATE II RNA Micro Kit (Bioline, cat. no. BIO-52075)\nSenescence-associated human gene-specific primers (Eurofins): Upregulated genes:\nFor CDKN1A (p21)\n               \nForward: 5′-TCACTGTCTTGTACCCTTGTGC-3′\nReverse: 5′-GGCGTTTGGAGTGGTAGAAA-3′\nFor CDKN2A (p16)\n               \nForward: 5′-GAGCAGCATGGAGCCTTC-3′\nReverse: 5′-CGTAACTATTCGGTGCGTTG-3′\nFor CDKN2B (p15)\n               \nForward: 5′-CTCCCGAAACGGTTGACTC-3′\nReverse: 5′-GCGGGGACTAGTGGAGAAG-3′\nFor CXCL1\n               \nForward: 5′-GCTGAACAGTGACAAATCCAAC-3′\nReverse: 5′-CTTCAGGAACAGCCACCAGT-3′\nFor CXCL10\n               \nForward: 5′-GAAAGCAGTTAGCAAGGAAAGGT-3′\nReverse: 5′-GACATATACTCCATGTAGGGAAGTGA-3′\nFor IL1B\n               \nForward: 5′-CTGTCCTGCGTGTTGAAAGA-3′\nReverse: 5′-TTGGGTAATTTTTGGGATCTACA-3′\nFor IL6\n               \nForward: 5′-GCCCAGCTATGAACTCCTTCT-3′\nReverse: 5′-GAAGGCAGCAGGCAACAC-3′\nFor MMP3\n               \nForward: 5′-CAAAACATATTTCTTTGTAGAGGACAA-3′\nReverse: 5′-TTCAGCTATTTGCTTGGGAAA-3′\nFor SERPINE1\n               \nForward: 5′-CCAGCTGACAACAGGAGGAG-3′\nReverse: 5′-CCCATGAGCTCCTTGTACAGAT-3′\nSenescence-associated human gene-specific primers (Eurofins): Downregulated genes:\nFor LAMNB1\n               \nForward: 5′-TTGGATGCTCTTGGGGTTC-3′\nReverse: 5′-AAGCAGCTGGAGTGGTTGTT-3′\nPropidium iodide (PI) staining solution (eBioscience, cat. no. 00-6990-50)\n8-well chamber slides Lab-Tek II (MilliporeSigma, cat. no. C7057-1CS)\nInverted fluorescence microscope (Olympus, IX70 Fluorescence Microscope)\n6-well cell culture plates (Genesee Scientific, cat. no. 25-105)\nT75 tissue culture flasks (Genesee Scientific, cat. no. 25-211)\nLightCycler® 480 Instrument II (Roche, cat. no. 05015278001)\nFlow cytometer (BD™ LSR II with BD FACS Diva v8.0.2 acquisition software)\nEdU incorporation\n1. Follow steps listed in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0001] (or in one of Alternate Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0002] through 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0005]) to generate senescent and control cells of the chosen cell type. For this immunostaining assay, seed 10,000 fibroblasts per well in 8-well chamber slides for each replicate.\n2. Wash senescent and control cells twice with PBS, then switch them to medium containing 0.2% FBS (instead of 10% FBS) and culture for 48 hr to induce quiescence by serum starvation in control cells while maintaining viability for a few days for both cell populations.\n3. The following day (24 hr after switching to low serum-containing medium), seed cells in new wells using complete medium and allow recovery overnight.",
    "These cells will be used as a positive control for EdU staining (proliferating control cells).\nUse complete medium (containing 10% FBS when using fibroblasts) to keep cells in a proliferative state.\n4. The next day, remove half the volume of medium in each well and replace with fresh medium containing EdU (Click-iT EdU kit) as instructed by the manufacturer's protocol. Use serum-free medium for the senescent and quiescent cells. Use complete medium (10% FBS) for proliferating control cells.\nFor example, if each well of the 8-well chamber slide contains 250 μl of medium, remove 125 μl and add 125 μl of the appropriate medium (serum free or complete medium) containing EdU (see manufacturer's protocol for the EdU concentration).\n5. Incubate for 24 hr.\n6. Twenty-four hours later, follow the instructions (manufacturer's protocol) to fix, permeabilize, detect EdU incorporation, and stain cellular DNA with Hoechst 33342.\nEdU staining is also compatible with DAPI DNA staining.\n7. Remove all liquid from wells, remove well chambers, add mounting medium, and then apply coverslips onto the slides (avoid air bubbles).\n8. Compare DNA staining with EdU staining to confirm that senescent and quiescent control populations have low numbers of EdU positive cells (whereas proliferating control cells should have high numbers of EdU positive cells; see Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-fig-0002]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/c98bc8ea-4bc5-40ef-837e-effaa536d754/cpz132-fig-0002-m.jpg</p>\nFigure 2\nEdU incorporation. (A) Representative images of quiescent control (top), ionizing radiation (IR)-induced senescent (center), and proliferating control IMR-90 cells (bottom). DAPI staining is shown on the left and EdU staining in the middle. Merged images are shown on the right. (B) Quantification of EdU-positive cells for quiescent control, IR-induced senescent, and proliferating control cells. Data shown are means of 3 replicates ± SD.\nSenescence-associated β-galactosidase",
    "9. Follow steps listed in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0001] (or one of the Alternate Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0002] through 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0005]) to generate senescent and control cells of the chosen cell type. For each replicate, seed 80,000 fibroblasts in a well of a 6-well plate.\n10. Wash senescent and control cells twice with PBS, then switch to medium containing 0.2% FBS (instead of 10% FBS) and culture for 48 hr.\nThis will induce quiescence by serum starvation in control cells while maintaining viability for a few days in both cell populations.\n11. After 48 hr, wash cells twice with PBS, then switch to serum-free medium and culture for 24 hr.\n12. Fix and incubate cells with the X-gal staining solution at 37°C overnight (as instructed in the manufacturer's protocol from the Senescence Detection Kit).\nWhen preparing the staining solution as instructed by the manufacturer's protocol, we recommend using X-gal from Life Technologies rather than X-gal provided with the Senescence Detection Kit to optimize staining. Use the suggested solvent and concentration of X-gal described in the Senescence Detection Kit manufacturer's manual.\n13. On the next day, remove staining solution and leave cells in PBS.\nThe staining reaction might require incubations longer than the overnight suggested in the manufacturer's protocol. Cells should be monitored under a microscope before removing the staining solution. If senescent cells appear to be poorly stained, they can remain in the staining solution at 37°C for longer times. Observe the cells under a microscope about every 2 hr until the senescent cells appear clearly stained, while quiescent control cells should remain unstained. However, avoid extended incubation times as the quiescent cells might turn positive. We recommend acquiring images right after removing the staining solution and adding PBS, even though cells can be stored at 4°C for 1-2 days before imaging.",
    "14. Acquire bright-field images using an inverted microscope and confirm that senescent cells have high SA-β-gal staining compared to quiescent control cells (see Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-fig-0003]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/4c1fbc33-bb87-44e1-a71e-29615576d31e/cpz132-fig-0003-m.jpg</p>\nFigure 3\nSenescence-associated β-galactosidase (SA-β-gal) staining. (A) Representative images of quiescent control (top) and ionizing radiation (IR) senescent IMR-90 cells (bottom). (B) Quantification of SA-β-gal positive cells for quiescent control and senescent cells. Data shown are means of 3 replicates ± SD.\nSenescence-associated gene expression analysis by qPCR\n15. Follow steps listed in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0001] (or in one of the Alternate Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0002] through 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0005]) to generate senescent and control cells of the chosen cell type. For each replicate, seed 200,000 fibroblasts in a well of a 6-well plate.\n16. Wash both senescent and control cells twice with PBS, then switch them to medium containing 0.2% FBS (instead of 10% FBS) and culture for 48 hr to induce quiescence by serum starvation in control cells while maintaining viability for a few days in both cell populations.\n17. After 48 hr, wash cells twice with PBS, then switch them to serum-free medium and culture for 24 hr.\n18. Twenty-four hours later, remove medium from the wells and extract total RNA using the ISOLATE II RNA Micro Kit. We recommend adding Lysis Buffer RLY directly to the wells after removing the medium, making sure to detach all cells with the help of a cell scraper.\n19. After RNA extraction, convert RNA samples into cDNA using the Applied Biosystems MultiScribe Reverse Transcriptase Kit.\n20. Use the cDNA to analyze by quantitative polymerase chain reaction (qPCR) mRNA levels of the senescence-associated genes.",
    "See materials list for a list of genes that are significantly upregulated (all genes except LAMNB1) or downregulated (LAMNB1) upon senescence induction (Hernandez-Segura et al., 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-bib-0014]). The primer sequences provided have been tested with the Universal Probe Library System. If using another probe system, the primer sequences listed are not guaranteed to work and primer sequence optimization might be needed.\n21. Analyze qPCR data to compare the relative expression of senescence-associated genes between senescent and quiescent control cells. Confirm that most genes have the same upregulation or downregulation trends shown in Figure 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-fig-0004].\nDifferent cell types may express different complements of SASP factors. The senescence-associated genes listed here are optimized for fibroblasts.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/a8dac4d0-9816-4ff2-89bf-6597432cb413/cpz132-fig-0004-m.jpg</p>\nFigure 4\nGene expression analysis using qPCR. Relative mRNA levels of the indicated genes in senescent cells normalized to quiescent IMR-90 cells. Data shown are means of 3 replicates ± SD.\nPropidium iodide inclusion\n22. Follow steps listed in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0001] (or Alternate Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0002] through 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0005]) to generate senescent and control cells of the chosen cell type. Seed 1 × 106 fibroblasts in a T75 flask for each replicate.\n23. Wash senescent and control cells twice with PBS, then switch to medium containing 0.2% FBS (instead of 10% FBS) and culture for 48 hr.\nThis will induce quiescence by serum starvation in control cells while maintaining viability for a few days in both cell populations.\n24. After 48 hr, wash cells twice with PBS, then switch to serum-free medium and culture them for 24 hr.\n25. Wash cells with PBS and detach them from the substratum by incubation with trypsin/EDTA at 37°C for 5 min.\n26. Resuspend cells in complete medium to inhibit trypsin, then wash cell suspensions twice with PBS.",
    "To perform a PBS wash, pellet cells by centrifugation at 250 × g for 5 min, remove the supernatant, resuspend the pellet in PBS, centrifuge cells again at 250 × g for 5 min, and remove PBS.\n27. Resuspend cell pellets in PBS to a final concentration of 1 × 106 to 1 × 107 cells/μl.\n28. Aliquot 100 μl of each cell suspension in to a flow cytometry tube and add 5 μl PI staining solution.\n29. Mix solution by pipetting and incubate 1 min at room temperature.\n30. Analyze samples for PI staining by flow cytometry. Confirm that the number of PI positive cells is low in both senescent and control cells (see Fig. 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-fig-0005]).\nPI dye is impermeable to cells, so will not stain cells unless their membrane integrity is compromised (that is, the cells are dead or dying).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/01f6a99a-5ce5-4cd3-b23c-061b87fdd77e/cpz132-fig-0005-m.jpg</p>\nFigure 5\nPropidium iodide (PI) staining for cell death. Percentage of PI-positive cells in quiescent control (left) and ionizing radiation (IR)-induced senescent (right) IMR-90 cell populations. Data shown are representative of both cell populations.",
    "With this method, SASP-containing and control CM are generated from senescent and control cells, prepared following Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0001] (or one of the Alternate Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0002] through 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0005]). Both senescent and control cells are cultured in low-serum medium (0.2% FBS) for 48 hr, which allows control cells to become quiescent. Then, cells are cultured in phenol red-free, serum-free medium for 24 hr. CM from senescent and control quiescent cells are collected and the cells are counted, which will allow normalization for proteomic analysis. Protein levels normalized to cell count accounts for changes due to differences in the number of cells and represent a more meaningful measure of “proteins secreted per cell.” This protocol has been optimized for IMR-90 primary human fetal lung fibroblasts and can serve as a guide for the use of other adherent human cells.\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0001])\nSenescent and control cells generated using Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0001] or Alternate Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0002]-4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0005]\nLow-serum medium: for IMR-90 fibroblasts, use DMEM (Gibco brand, Thermo Fisher Scientific, cat. no. 12430-054) supplemented with 100 U/ml penicillin-streptomycin (Gibco brand, Thermo Fisher Scientific, cat. no. 15070063) and 0.2% FBS (Gibco brand, Thermo Fisher Scientific, cat. no. 2614079)\nPhenol red-free, serum-free medium: for IMR-90 fibroblasts, use phenol-red free DMEM (Gibco brand, Thermo Fisher Scientific, cat. no. 21063-029) supplemented only with 100 U/ml penicillin-streptomycin (Gibco brand, Thermo Fisher Scientific, cat. no. 15070063)\nBeckman Coulter Z1 Particle Counter (Beckman, cat. no. 6605698)\nSwing Rotor Centrifuge 5804 (Eppendorf, cat. no. 022622501)\nGenerate CM samples\n1. Aspirate culture medium from senescent and control cells, then wash cells twice by adding PBS and subsequently aspirate it. After washes, switch to low-serum medium for both senescent and control cells and culture for 48 hr.",
    "Using low-serum medium induces quiescence in control cells by serum starvation, while maintaining viability for a few days in both cell populations.\n2. After 48 hr, aspirate culture medium, then wash senescent and quiescent control cells twice by adding PBS and subsequently aspirate it. After washes, switch to serum-free and phenol red-free medium and incubate 24 hr.\nThe collected CM needs to be phenol red free because this compound interferes with quantification of protein using BCA. Also, culture medium used during this step must be free of serum and, as much as possible, of protein components/contaminants. Abundant exogenous protein contamination can limit the identification and quantification of secreted proteins. High concentrations of proteins present in serum and other cell culture supplements interfere with and suppress the ionization of secreted proteins during MS analysis. If for some reason, the culture medium contains protein components, these proteins must be excluded from later proteomic analysis.\nCollect CM\n3. After the 24 hr incubation, collect CM from each replicate and perform cell counts.\nRight after collection, keep the CM on ice to minimize protein degradation during cell counting. To further minimize protein degradation, we recommend moving on to step 4 as soon as cell counting is completed. Cell counts are important to normalize the levels of secreted proteins during proteomic analysis (see Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0009]). Senescent fibroblasts tend to attach more firmly to plates, so a slightly longer incubation (1-2 min) with trypsin-EDTA might be required for the senescent cells to detach.\n4. Centrifuge collected CM at 10,000 × g for 15 min to pellet cell debris and transfer supernatant into a new tube.\n5. Proceed to Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0009] or store the samples at −80°C for later processing.",
    "If after senescence induction the cell type investigated does not remain viable in low-serum medium, then Alternate Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0008] should be used to generate CM for MS analysis. Some indicators of poor viability are loss of cell number and cell detachment. Loss of viability can be quantitatively confirmed by increasing cell death, as measured by cell viability assays (for example, see Support Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0006], step 22-30). In this protocol, CM containing the SASP are collected from senescent cells that are cultured in complete medium up to 24 hr before CM collection. Control cells are still cultured in low serum to induce quiescence. However, when comparing these two conditions, it is difficult to determine whether differences are due to a senescent versus non-senescence state or due to culturing in complete medium versus low-serum medium. This protocol is optimized for primary lung fibroblasts, which remain viable in low serum under control conditions. If the cell type under investigation is not viable under control conditions, we recommend optimization of culture conditions appropriate to the cell type under investigation. A possible alternative approach may be to compare CM collected from senescent cells cultured in complete medium versus CM collected from non-senescent cells cultured in complete medium. However, under these conditions, one cannot distinguish if changes in protein secretion are the result of comparing proliferating cells versus non-proliferating cells, differences in cell density between control and senescent conditions, or differences between senescent and non-senescent cells. Also see Cell cultures in low-serum medium before CM collection section under Critical Parameters and Troubleshooting.\nMaterials\nSee Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0007]\nGenerate CM samples",
    "1. Aspirate culture medium from senescent and quiescent control cells, then wash cells twice by adding PBS, and subsequently aspirate it. After the washes, switch control cells to low-serum medium and add complete medium to senescent cells. Culture both cell populations for 48 hr.\nUsing low-serum medium induces quiescence in control cells by serum starvation, while maintaining viability for a few days.\n2. After 48 hr, remove culture medium by aspiration, then wash senescent and quiescent control cells twice by adding PBS, and subsequently aspirate it. After washes, add serum-free and phenol red-free medium, and incubate 24 hr.\nThe CM needs to be phenol red free because this compound interferes with the quantification of protein using BCA. Also, culture medium used during this step must be free of serum and, as much as possible, of protein components/contaminants. Abundant exogenous protein contamination can limit the identification and quantification of secreted proteins. High concentrations of proteins present in the serum and other cell culture supplements interfere with and suppress the ionization of secreted proteins during MS analysis. If for some reason, the culture medium contains protein components, these proteins must be excluded from later MS data analysis.\nCollect CM\n3. For the collection of CM, follow Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0007], steps 3 through 5.",
    "This protocol describes a comprehensive unbiased MS-based approach to identify and quantify the secreted proteins of cultured cells. CM prepared in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0007] (or Alternate Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0008]) is concentrated, digested, and desalted. The processed samples are analyzed using a liquid chromatography-mass spectrometry (LC-MS) method, specifically a DIA workflow. The protocol illustrates in detail how to use an LC-MS system composed of a nano-LC 2D HPLC coupled to a TripleTOF 6600 high-resolution mass spectrometer. The DIA quantitative proteomics analysis software Spectronaut (Biognosys) is used to perform relative quantification of protein levels and create reports of protein abundance, fold changes, and statistics.\nMaterials\nSenescence-associated secretory phenotype (SASP) conditioned medium (CM) and control CM (CTL CM) generated in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0007] (or Alternate Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0008])\nAmmonium bicarbonate (NH4HCO3; MilliporeSigma, cat. no. A 6141)\nDithiothreitol (DTT; MilliporeSigma, cat. no. D9779)\nIodoacetamide (IAA; MilliporeSigma, cat. no. I1149)\nSequencing grade trypsin (Promega, cat. no. V5113)\nAcetic acid (MilliporeSigma, cat. no. 695092-100ML)\nFormic acid (MilliporeSigma, cat. no. 94318)\nAcetonitrile (ACN; Burdick & Jackson, cat. no. AH015)\nIndexed retention time (iRT) peptide standards (Biognosys, cat. no. Ki-3002)\nBicinchoninic Acid (BCA) Kit (Thermo Fisher Scientific, cat. no. PI23225)\nAmicon® Ultra centrifugal filters with 3 kDa molecular weight cutoff (MilliporeSigma, cat. no. UFC9003)\nLitmus strips (VWR International, cat. no. EM1095350007)\nHeating Shaking Drybath (Thomas Scientific, cat. no. 1199A66)\nBenchtop microcentrifuge (Thermo Fisher Scientific, cat. no. 75002401)\nOasis HLB solid-phase extraction (SPE) cartridges, 10 mg Sorbent per Cartridge, 30 µm (Waters, cat. no. 186006339)\nSpeedVac concentrator (Savant™ SPD131DDA; Thermo Fisher Scientific)\nUltrasonic Bath Sonicator (Thomas Scientific)\nAutosampler vials for HPLC (Agilent Technologies, cat. no. 5190-3155)\nNano-LC 2D HPLC system (Eksigent Ultra Plus; Eksigent)\ncHiPLC system (Eksigent)\n200 µm × 0.4 mm ChromXP C18-CL chip, 3 µm, 120 Å (SCIEX)",
    "75 µm × 15 cm ChromXP C18-CL chip, 3 µm, 120 Å (SCIEX)\nHigh-resolution mass spectrometer TripleTOF 6600 System (SCIEX) or other high-resolution mass spectrometer\nSpectronaut™ software (Biognosys, Schlieren)\nConcentrate CM\n1. Transfer CM to Amicon ultrafilter tubes, without exceeding the maximum volume capacity (see manufacturer instructions).\nIt is likely that the volumes of CM samples are higher than the ultrafilter tubes’ capacity. If so, use multiple centrifugations until the volume of every CM sample has been reduced to <0.5 ml (see next step).\n2. Following manufacturer instructions, buffer exchange protein samples into 50 mM NH4HCO3 buffer. After initially concentrating protein samples in the columns, we recommend performing one buffer exchange with a maximum volume of 50 mM NH4HCO3, followed by a buffer exchange with a maximum volume of 8 M urea in 50 mM NH4HCO3. After the addition of 8 M urea in 50 mM NH4HCO3, centrifuge samples until reaching a final volume <0.5 ml in NH4HCO3 buffer.\n3. Buffer exchanged samples can be stored up to 1 year at −80°C.\nIn-solution proteolytic digestion\n4. Quantify secreted protein concentrations by BCA assay.\nUse at least a 1/3 dilution of sample in milliQ water for the BCA assay. The BCA assay is compatible with urea concentrations up to 3 M.\n5. Aliquot 50 µg of each sample into new 1.5-ml tubes.\nIf sample yields are lower than 50 µg, we recommend aliquoting at least 20 µg of secreted proteins due to sample losses during subsequent steps. Still, sample amounts as low as 10 µg can be used.\n6. Bring all samples to equal volumes with 8 M urea in 50 mM NH4HCO3.\n7. Vortex to mix.",
    "8. Add DTT (1 M in 50 mM NH4HCO3 buffer stock solution) to a final concentration of 20 mM (in 50 mM NH4HCO3 buffer) to each sample to reduce disulfide bridges.\n9. Incubate samples 30 min at 37°C with shaking and/or agitation.\n10. Allow samples to cool to room temperature.\n11. Add IAA (200 mM in 50 mM NH4HCO3 buffer stock solution) to a final concentration of 40 mM IAA (in 50 mM NH4HCO3 buffer) to each sample to alkylate reduced thiols.\nIt is important to use an IAA concentration at least double that of DTT to ensure that all the reduced thiols are alkylated.\n12. Incubate samples in the dark at room temperature for 30 min.\n13. Dilute all samples 1/6 in 50 mM NH4HCO3 to reduce the concentration of urea for trypsin digestion.\n14. Verify that the pH of samples is between 7.0 and 8.5 by pipetting small volumes (<1 µl) onto litmus strips. Adjust pH as needed.\n15. Resuspend lyophilized trypsin in 50 mM acetic acid to a final concentration of 0.1 mg/ml.\nFor example, 20 μg of lyophilized trypsin are resuspended in 200 µl of solution at pH 8, for a final concentration of 0.1 μg/μl trypsin.\n16. Digest protein samples by adding trypsin at a protease-to-substrate protein ratio of 1:50 (w/w). Incubate samples overnight at 37°C on a shaking dry bath.\n17. Quench protein digestion by adding formic acid to a final concentration of 1% by volume from a 10% formic acid (in water) stock.\nStock concentrations of formic acid ≤10% can be pipetted safely with plastic pipet tips. Higher concentrations may dissolve plasticware and should be handled with glass to avoid polymer contamination of samples.",
    "18. Spin sample at 5,000 × g for 15 min at room temperature to pellet insoluble material. The supernatants, which contain peptides, are desalted in the next steps.\nDesalt samples\n19. Desalt samples using commercially available SPE cartridges. The next steps describe a desalting process using Oasis HLB SPE cartridges.\n20. Wet each HLB SPE cartridge twice with 800 µl 50% ACN in 0.2% formic acid in water.\n21. Equilibrate each cartridge three times with 800 µl 0.2% formic acid in water.\n22. Load peptide samples onto HLB SPE cartridges.\n23. Wash each cartridge three times with 800 µl 0.2% formic acid in water.\n24. Elute peptides once with 800 µl 50% ACN in 0.2% formic acid in water and once with 400 µl 50% ACN in 0.2% formic acid in water in the same tube.\n25. Dry samples completely in a SpeedVac concentrator.\nIf desired, one can pause sample processing; dried peptide pellets can be safely stored up to 1 year at −80°C.\n26. Resuspend dry pellets in 0.2% formic acid to a final concentration of 1 µg/µl.\nCalculate the final peptide concentration based on the initial protein sample mass aliquoted for digestion. For example, if the initial aliquot contained 50 μg of protein, the dried pellet will be resuspended in 50 µl of 0.2% formic acid.\n27. Sonicate samples in a water bath sonicator 5 min.\n28. Vortex samples at 4°C for 10 min.\n29. Centrifuge samples at 15,000 × g for 15 min.\n30. Transfer supernatants to autosampler vials.\n31. Add retention time standard peptides to each autosampler vial.\nFor example, use iRT peptide standards at a 1/20 dilution.\n32. Centrifuge samples in autosampler vials at 5,000 × g in a clinical centrifuge for 1 min to remove bubbles.\nMass spectrometry acquisition",
    "The following steps describe in detail the use of a nano-LC 2D HPLC coupled to a TripleTOF 6600. The protocol can be adjusted depending on the available MS instruments or preference.\n33. Transfer autosampler vials into the autosampler tray with cooling set at 4°C.\n34. Create loading, injection, and analytical gradient methods with the following settings:\nLoad a total of 1 µg sample into the autosampler loop.\nAfter injection, transfer peptide mixtures onto a C18 pre-column chip (200 µm × 0.4 mm ChromXP C18-CL chip, 3 µm, 120 Å; or column) and desalt by washing with aqueous mobile phase A at 2 µl/min for 10 min. Then, transfer peptides to an analytical chip (75 µm × 15 cm ChromXP C18-CL chip, 3 µm, 120 Å; or column) and elute at a flow rate of 300 nl/min with a gradient method using mobile phases A (aqueous, composed of 97.9% water, 2% acetonitrile, and 0.1% formic acid) and B (organic, composed of 97.9% acetonitrile, 2% water, and 0.1% formic acid). Apply a linear gradient from 5% mobile phase B to 35% mobile phase B over 120 min.\nRamp the mobile phase B to 80% over 5 min, then hold at 80% B for 8 min before returning to 5% B for a 25 min re-equilibration.\n35. Build a DIA MS instrument method and define the following instrument scan experiments:\nExperiment 1: Perform MS1 precursor ion scan from m/z 400 to 1,250 (accumulation time of 250 ms).\nExperiments 2-65: Perform MS/MS product ion scans for 64 variable window segments with a MS2 scan range from m/z 100 to 1,500 (accumulation time of 45 ms per each of the 64-product ion scans per cycle). Set collision energy spread to CES = 10, then select the “high sensitivity product ion scan mode.”",
    "Use the 64 variable window DIA acquisition strategy as described by Schilling et al. (2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-bib-0023]) for a total cycle time of ∼3.2 s. In this acquisition, a series of variable width isolation windows (5-90 m/z) is used to step over the full mass range (m/z 400-1,250 over 64 SWATH segments, each with a 45-ms accumulation time, yielding a cycle time of 3.2 s, which includes one MS1 scan with a 250-ms accumulation time).\nThe variable window width is adjusted according to the complexity of the typical MS1 ion current observed within a certain m/z range using a variable window calculator algorithm (more narrow windows are chosen in “busy” m/z ranges, wide windows in m/z ranges with few eluting precursor ions). On other MS instrument platforms, other DIA window strategies (isolation schemes) may be implemented.\n36. Create a sample queue/batch for all biological replicate samples.\nTo obtain consistent and reliable data, regular LC-MS system suitability assessments need to be performed before and during the entire SWATH study. Initially, use pre-digested β-galactosidase standards and/or more complex human HeLa cell digests and perform quality control (QC) acquisitions or mass calibration acquisitions typically used in your laboratory or proteomics core. Also, randomize study samples to avoid systematic errors; block randomization of biologically different samples is often applied in proteomics studies.\nAssign file names for each sample.\nSet injection volumes corresponding to 1 μg of sample (for example, 1 μl of a 1 μg/μl sample).\nAssign acquisition method generated above.\n37. Submit samples for MS acquisition.\nMS data analysis\nHere, we describe a workflow using the commercially available software Spectronaut (alternative software packages can also be used). The procedure for entering settings and processing data will vary depending on the analysis software.\n38. To analyze and quantify protein levels, open DIA analysis software Spectronaut.",
    "39. To start the Quantification Analysis, select “Pipeline” tab, click “Set up a DIA Analysis from File,” and open the MS DIA raw files of interest for relative quantification.\n40. Select “Assign Spectral Library” and select “Pan Human Library,” click “load” | “next.”\nThe Pan Human Spectral Library (Rosenberger et al., 2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-bib-0021]) should be used only for human samples (however, other spectral library approaches can also be applied).\n41. Select “BGS Factory Settings” analysis schema. Verify that the peptide FDR settings are set to Q-value <0.01 with sparse identifications and click “next”.\n42. Select the appropriate human database FASTA file (the default UniProt FASTA file assigned to the Pan Human Library) and click “next”.\n43. Define the condition setup (e.g., “senescent” and “non-senescent”).\n44. In the condition setup form, assign to each sample a correction factor that is equal to the inverse of its cell count (1 divided by the cell count) and click “next”.\nIt is critical to assign correction factors based on cell counts to account for differences in protein secretion levels due to differences in the number of cells in each cell culture flask.\n45. Select “goa_human” as the gene annotation (ontology) file and click “next”.\n46. Review the analysis overview (summary of the experiment setup) and select “output directory” to assign an output directory. Click “finish”.\n47. Click “Run Pipeline” to perform label-free quantitative analysis.\n48. Review results in the “output directory.”\nThe Spectronaut DIA Quantitative Analysis Software automatically performs FDR analysis, generates heat maps, and volcano plots (Fig. 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-fig-0006]). It generates lists of identified and quantified peptides and proteins and provides Q-values along with relative fold changes comparing different conditions in a “candidates.tsv” file.",
    "Expected results: The elevation of several SASP factors is expected in a successful proteomic analysis, including GDF15, MMP1, STC1, CXCL1 (these are known “core” SASP factors for fibroblasts). The number of proteins identified in an experiment with five replicates per each condition (five senescent and five controls) is typically ∼1,000 proteins identified in the secretome. The number of significantly changed proteins (SASP proteins) will typically vary depending on the senescence inducer or cell type used. For example, we have previously reported 548 proteins significantly increased in the SASP of irradiated senescent fibroblasts but 332 proteins in the SASP of ATV/r-treated senescent fibroblasts, and 180 proteins in the SASP of irradiated epithelial cells (Basisty, Kale, Jeon, et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-bib-0001]). Significant SASP factors change heterogeneously with senescence induction (and cell type). In senescent fibroblasts, it is typically expected that the majority of significant protein changes are increases in protein secretion. In parallel, it is important to independently verify senescence in the cells using the Support Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.32#cpz132-prot-0006] assays described above.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/3bc4dfbf-f883-4235-baed-0b70d3a81e13/cpz132-fig-0006-m.jpg</p>\nFigure 6\nSenescence-associated secretory phenotype (SASP) proteomic analysis figures generated by the Spectronaut software. (A) Heatmap depicting the abundance of all proteins identified in the conditioned medium of oncogenic RAS-induced senescent (n = 6) and control (n = 6) IMR-90 cells. (B) Volcano plot of the log 2 fold changes in abundance of proteins secreted by senescent versus control cells. Red dots represent fold changes >1.5-fold, and p-values >.05. (C) Line plot showing the abundance of a classical SASP protein, MMP1, in the secretomes of senescent and non-senescent cells."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}