{
  "id": 3665,
  "origin_website": "Cell",
  "title": "Obtaining patient-derived cancer organoid cultures via fine-needle aspiration",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nEx vivo specimen fine-needle aspiration (FNA)\nTiming: 15–30 min\nFine-needle aspiration is a technique commonly used in a clinical setting to obtain cells for cytopathology and genetic testing. Here, we apply it to a research setting to obtain cells and cell clumps that will generate organoid cultures. FNA is advantageous over traditional digestion methods because it is much more gentle, allowing for increased cell survival.\nCritical: The specimen and FNA-setup must be sterile for tissue culture. If performing the FNA on a specimen, obtain the tissue in a sterile fashion from surgery. If obtaining tissue from surgical pathology, ensure that sterile ink is used to mark the margins prior to FNA, as the ink in surgical pathology grossing rooms is often not sterile. If obtaining the specimen from an animal, ensure sterile technique when performing in vivo FNAs or when performing surgery on animals.\nAttach a sterile 25-gauge beveled needle to a sterile 10 mL luer-lock syringe and insert into a syringe holder.\nIf using surgical tissue, transfer specimen to a sterile petri dish within a laminar flow biosafety cabinet. If performing FNA in vivo, perform in a procedure room with sterile technique.\nImmobilize the specimen/nodule with sterile-gloved fingers or sterile forceps and using your other hand, insert the needle with the syringe holder perpendicular to the specimen/nodule.",
    "Apply backward pressure to the syringe using the syringe holder, while rapidly agitating back and forth in a “saw-like” motion within the specimen at a rate of 2–3 strokes per second (Methods Video S1[href=https://www.wicell.org#mmc1]). This motion loosens tumor and other cells from the stromal matrix. One “needle pass” typically involves 10–20 forward strokes (excursions). For optimal tumor sampling, reangle the needle slightly with each excursion so that sampling occurs in a fan shape. The needle should not come out of the specimen/nodule until the 10–20 excursions have been completed and material is visible in the needle hub. The needle should not protrude from the opposite side of the specimen at any point. Troubleshooting 1[href=https://www.wicell.org#sec6.1]\nNote: Traditionally, FNA is performed on patients when the nodule is 1 cm or greater in greatest dimension. However, ex vivo FNA has been successfully performed on specimens as small as 2 mm with adequate yield for organoid culture, including heavily fibrotic tumors.\nCritical: The speed of the agitation/strokes/excursions is critical for cellular yield. If your yield is low, check that your stroke rate is at least 2–3 strokes per second and that needle is not passing through the tissue.\nOnce material is visible in the hub of the needle, release suction and remove the needle from the specimen.\nCritical: Suction should always be released prior to removing the needle from the specimen.\nFollowing this process (a “needle pass”), rinse the needle in 20 mL of sterile, pre-warmed, RPMI or DMEM in a 50 mL conical tube. Expel needle contents into the conical tube and rinse needle 2–3 times.\nNote: Extensive rinsing (more than 3–4 times) will lead to increased cell shearing and lower yields.\nRepeat steps c–f 3–5 times.\nDispose of syringe and needle in appropriate sharps container.",
    "Critical: FNA yield is directly correlated with the experience of the person performing the technique. We recommend extensive practice on fruit or store-bought meat prior to attempting FNA on animals or critical specimens. In addition, different tumors may have different yields. Tumors with extensive necrosis or fibrosis may give lower viable cell yields.\n    Your browser does not support HTML5 video.\n  \nMethods Video S1. Animated video of how to perform an FNA, related to FNA step 1d\nCell growth protocol\nTiming: 1–4 weeks\nOnce you have obtained the cells from the FNA, they can be immediately plated using one of two culture methods. Semi-solid culture is useful for longer culture periods and free movement of cells. Disc culture can be beneficial for more compact organoid growth and allows for generation and propagation of two-dimensional cultures. We recommend using both semi-solid and disc culture methods for new organoid cultures, as the growth needs vary from sample to sample. See Figure 1[href=https://www.wicell.org#fig1]. For a summary of steps used in FNA-based organoid culture.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/352-Fig1.jpg\nFigure 1. Summary of steps for plating cells from FNA\nCollect cells via FNA. After the FNA, half the cells are plated in semi-solid culture in a 24-well ultra-low attachment plate. The other half of the cells are plated in a 6-well plate in the 75% Matrigel disc culture.\nCentrifuge the FNA material in the conical tube at 340 × g for 5 min at 20°C–25°C.\nAspirate the supernatant and resuspend the pellet in Complete Media.\nNote: If using only one plating method, we recommend resuspending the FNA material in 300 μL. If both plating methods are to be used, we recommend resuspending the FNA material in 600 μL and dividing into two 300 μL aliquots.",
    "Cells can be plated in semi-solid culture to obtain organoids, or in disc culture to obtain both organoids and 2D cell cultures.\nSemi-solid culture\nPipet and mix 300 μL of the FNA cell suspension with 5% Matrigel in complete media with an additional 2% FBS.\nPipet 550 μL cell suspension in a 24-well low-attachment plate following a figure 8 motion while gently expelling cell suspension.\nPlace the cells in the incubator.\nReplenish 200 μL per well of fresh complete media, 5% Matrigel, and 2% FBS dropwise weekly.\nPassage cells as needed. Troubleshooting 2[href=https://www.wicell.org#sec6.3].\nCritical: In this type of culture, the low percentage of Matrigel makes the matrix fragile and is more susceptible to media evaporation. Troubleshooting 3[href=https://www.wicell.org#sec6.5].\nDisc culture (Figure 2[href=https://www.wicell.org#fig2])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/352-Fig2.jpg\nFigure 2. Two-dimensional cultures can be derived from disc culture\n(A) Animated figure of disc culture organoids with 2Ds undermining the disc.\n(B) Bright-field image of a patient-derived melanoma organoid 6 days after plating in disc culture with 2Ds undermining the disc culture at 10×. Scale bar, 100 μm.\nPipet and mix 300 μL of the FNA cell suspension with 75% Matrigel and 25% complete media.\nAdd three 50 μL drops (disc) to each well of a pre-warmed 6-well plate. Alternatively, you can plate a single 150–200 μL disc per well of the 6-well plate.\nPlace the plate in a tissue culture incubator for 10 min to allow the Matrigel to solidify.\nCover cells with warmed complete media by slowly pipetting the media down the side of the well until the discs are completely covered (~2.5 mL).\nPlace cells back in the incubator.\nReplace media every 2–3 days by aspirating off the old media and replacing it with pre-warmed complete media following the step 11b.v. Troubleshooting 4[href=https://www.wicell.org#sec6.7]\n2-dimensional (2D) cell culture (Figure 2[href=https://www.wicell.org#fig2])",
    "Follow the disc culture protocol until 2D cells have undermined the disc.\nFreeze the disc down following the freezing cells protocol.\nAdd 2 mL of 20°C–25°C complete media to each well after removing disc. Make sure media is either 4°C or 20°C–25°C, as 37°C media could shock the cells.\nWhile in a 6-well plate, replace media with fresh, pre-warmed media every 2–3 days.\nOnce cells are confluent, passage them from the 6-well plate to a T75 flask following step 2a in the passaging cells protocol.\nIn the T75, replace three-fourths (~11 mL) of complete media with fresh complete media weekly.\nPassage cells as needed.\nNote: If 2D culture is not desired, plate in a low-attachment plate in the semi-solid format. Low-attachment plates prevent the matrix disrupting 2D cells from growing underneath the organoids.\nPassaging cells\nTiming: 15 min\nCells should be passaged when media needs replaced or replenished more often than twice a week or when organoids are harvested for experimental use.\nSemi-solid culture (Figure 3[href=https://www.wicell.org#fig3])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/352-Fig3.jpg\nFigure 3. Passaging of semi-solid cultures\n(A) Once the organoids are centrifuged, resuspend and aliquot (B) the desired amount for replating then use the rest for freeze downs. (C) For a 1:4 passage resuspend in 2,800 μL and pipet 700 μL in a new conical (to replate). The remaining 2,100 μL is sufficient for 3 freeze downs.\nPipet the organoid suspension with a P1000.\nIn order to break up the Matrigel/organoids, draw a small amount of organoid suspension up into the pipet and then expel it slowly while moving the pipet in a circular motion in the plate. Repeat this 2–4 times.\nTransfer the cell suspension to a 50 mL conical tube.\nCentrifuge the cell suspension at 340 × g for 5 min at 20°C–25°C and aspirate off the supernatant.",
    "Resuspend the pelleted cells in complete media.\nPipet out the desired amount of the cell suspension and replate following step 12b in the cell growth protocol.\nEither discard the remaining cell suspension or save for other uses (e.g., freezing, plating for experiments, etc.)\nDisc culture\nRemove media and add 1 mL ice-cold PBS to each well.\nScrape discs gently off of the plate with a cell scraper.\nPipet ice-cold PBS to break apart discs and collect into a 1.5 mL microfuge tube.\nCentrifuge cells at 340 × g for 5 min at 20°C–25°C then remove PBS and Matrigel overlying the pellet.\nWash pellet gently with 1 mL 4°C PBS and centrifuge 340 × g for 5 min at 20°C–25°C.\nRemove PBS and resuspend cell pellet in 3× Matrigel (for a 1:3 split) then plate in pre-warmed 6-well plate.\n2D cell culture\nPassaging from a 6-well to a T75 flask\nAspirate off all the media.\nAdd 1 mL of trypsin to each well.\nIncubate at 37°C for 3 min.\nPipet trypsinized cells from each well into a conical tube with 20 mL of DMEM or RPMI.\nCentrifuge the cell suspension at 340 × g for 5 min at 20°C–25°C and aspirate off the supernatant.\nResuspend cell pellets in 1 mL of complete media then transferred to a T75 containing 14 mL of complete media.\nRock the T75 back and forth until the bottom is covered with cell suspension.\nPlace in the incubator.\nNote: Depending on the number of cells, multiple T75s might be needed.\nFreezing cells\nTiming: 15 min",
    "As these cultures come from ex vivo tissue, they are not easily replaceable or replicable. We recommend freezing down multiple vials of any organoid cultures before beginning experiments, as these cultures can be fragile and do change over time. Freeze downs enable preservation of the cultures should there be a contamination or error in propagation.\nObtaining Cells\nDisc Culture\nAspirate off media.\nPipet 1 mL of 4˚C PBS directly on to the disc in each well.\nUse a cell scraper to gently scrape off any remaining disc.\nPipet cell suspension into a 1.5 mL microfuge tube.\nPipet up and down several times to dissolve the Matrigel.\nSemi-solid Culture\nFollow the relevant steps in the Passaging Cells protocol and save the remaining cell suspension.\n2D culture\nFollow relevant steps in the Passaging Cells protocol and save the remaining cell suspension.\nPipet 20 μL into a hemocytometer to count the number of cells.\nCentrifuge the cell suspension at 340 × g for 5 min.\nAspirate off the supernatant and resuspend in complete DMEM.\nFor disc and semi-solid culture, deposit approximately 2 wells per cryovial.\nFor 2D culture, deposit 300,000–1,000,000 cells per cryovial.\nNote: For disc culture and semi-solid culture, the number of wells per cryovial can vary depending on amount and size of organoids.\nPipet 700 μL of cell suspension into each appropriately labeled cryovial.\nPipet 200 μL of FBS into each cryovial.\nCritical: Complete steps 18 and 19 with all cryovials before moving to step 20 because once DMSO is added, it starts killing cells.\nPipet 100 μL of DMSO into a cryovial.\nScrew the cap on tightly and invert 2–3 times.\nPlace directly into a Mr. Frosty.\nRepeat steps 20–22 until all the cryovials are complete.",
    "Tighten the lid on the Mr. Frosty and place directly into a −80˚ C freezer.\nKeep cells in Mr. Frosty for at least 24 h and then they can be transferred to a box prior to transfer to liquid nitrogen for long-term storage.\nAfter a week in the −80˚C freezer, transfer cells to a liquid nitrogen freezer at or below −130˚ C for longer storage.\nCritical: It is important to complete steps 20–24 as quickly as possible to prevent cell loss.\nPause Point: Cells can be stored in the −80˚ C freezer for up to a week and longer term at or below −130˚ C in a liquid nitrogen freezer.\nThawing cells\nTiming: 15 min\nCultures must be properly thawed to give the cells the best chance of recovery. Growth may not immediately match that of the culture prior to being frozen but should pick up within a week or two after thawing.\nPreheat water bath to 37˚ C.\nPipet 20 mL of media into a 50 mL conical tube warm to ~24˚ C.\nObtain cryovial with cells.\nOptional: If thawing more than one or two cryovials at a time, store the other cryovials on dry ice until ready to thaw.\nPlace cryovial in water bath.\nIncubate for 1 minute then check to see if it has thawed. If not, check in 15–30 s intervals until thawed.\nOnce thawed, pipet contents from cryovial into the media from step 28.\nRinse the cryovial with 1,000 μL of the media from step 32 and pipet it back into the conical tube.\nScrew the conical tube lid tightly and invert to ensure adequate mixing.\nNote: This is to ensure the DMSO is diluted adequately.\nCentrifuge at 340 × g for 5 min.\nAspirate off the supernatant.",
    "Optional: Resuspend in 20 mL of media or PBS, centrifuge at 340 × g for 5 min, and aspirate off the supernatant.\nResuspend and plate as desired following steps in the Cell Growth Protocol."
  ],
  "subjectAreas": [
    "Organoids",
    "Cell Culture",
    "Cell Isolation",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology"
  ]
}