{
  "id": 4733,
  "origin_website": "Bio",
  "title": "Confocal Imaging of Myeloid Cells in the Corneal Stroma of Live Mice",
  "procedures": [
    "Ethical statement: All procedures discussed here are in accordance with and were approved by the University of California, San Francisco Institutional Animal Care and Use Committee. Setup the Confocal Microscope.Turn on the argon laser. Open imaging software Ez-C1 Gold Ver. 3.8.Setup the head-holding adapter (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150702/20150702061006_9638.jpgFigure 2. Head-holding adapter setup. The mouse head is stabilized by fixing the nose and ears in place using the nose piece and ear bars.Setup the eye stabilizer (Figure 3). Attach the no. 5 Dumont forceps to the UST-2 Solid Universal Joint. Cut an 18 mm piece of polyethylene tubing. The polyethylene tubing serves to isolate and stabilize the whole eye. Cover the tips of the forceps with the tubing, creating a loop between the tips.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150702/20150702061018_3206.jpgFigure 3. Eye stabilizer setup. The mouse eye is stabilized by looping and tightening the tubing around the eye.Place the heating pad under the objective. The heating pad is used to maintain body temperature at 37 °C during the procedure.Anesthetize the mouse by injecting 1.2% Avertin solution using a dosage of 0.2 ml/10 grams body weight intraperitoneally with a 25 Gauge needle. It is critical to minimize breathing movements as much as possible so anesthetize the mouse until the breathing is very shallow and not rapid.After the mouse is fully anesthetized, place the mouse’s head in the head-holding adapter (Figure 4). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150702/20150702061032_7350.jpgFigure 4. Placement of mouse in head-holding adapter. The mouse head is fixed in place using the nose piece and ear bars.Place the head holder together with the mouse on a heating pad under the 40x microscope objective. Angle the head so that the cornea selected for imaging is facing upward towards the lens objective (Figure 5). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150702/20150702061043_8578.jpgFigure 5. Rotation of mouse head in head-holding adapter.",
    "The mouse head is rotated so that the central cornea faces towards the ceiling when the eye is proptosed using periorbital pressure. Rotation of the head to an angle is achieved by manual tilting of the head holding adaptor.Apply mild periorbital pressure to proptose the eye (Figure 5). Gently place the polyethylene tubing loop of the eye stabilizer below the corneoscleral junction (Figure 6, Figure 8). Be careful not to interrupt the breathing or blood circulation while holding the mouse. Adjust the forceps to tighten the loop just enough to stabilize the eye and keep it proptosed.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150702/20150702061053_5767.jpgFigure 6. Stabilization of the eye. Polyethylene tubing looped around the eye below the corneoscleral junction and the forceps are tightened to keep the tubing in place. Final positioning of the mouse, head-holding adapter, and universal joint with forceps.Squeeze the tube of GenTeal Gel gently and place a small amount of GenTeal Gel directly from the tube onto the cornea sufficient to use as an immersion liquid between the objective and the cornea (Figure 7). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150707/20150707010257_7201.jpgFigure 7. Application of GenTeal gel. The tube of Genteal Gel is squeezed and the ointment is applied directly onto the entire surface of the eye. A column of Genteal Gel extends from the mouse cornea to the microscope objective.Use brightfield observation to focus on the central cornea (Figure 8).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150702/20150702061119_6599.jpgFigure 8. Central cornea. The transparent cornea is in focus using brightfield illumination, as are the iris tissue and round pupil. The corneoscleral junction is indicated by the arrow.Turn off the brightfield lamp and turn on the epifluorescence lamp. Find the optimal corneal area and depth for imaging using the GFP filter.",
    "Try to image as close as possible to the central cornea because it is flatter than the paracentral cornea and allows for more cells to be in focus within the same plane. Switch the microscope setting from epifluorescence to confocal. Select a filter cube with 488 excitation. Open imaging software Ez-C1 Gold Ver. 3.8. and use the following acquisition settings. The below settings optimize the resolution of the myeloid cells while limiting the amount of photobleaching.Pinhole: large (may use a smaller pinhole if there is enough signal) Beam Splitter: 408/488/581or 488/561/638 Excitation intensity: for 488 = up to 10% Lines per dimension: 512 x 512 Gain: 180-190 (may adjust as needed) Pixel dwell: between 6 and 8 Timelapse-as fast as possiblePerform single scans using the confocal imaging software to optimize imaging settings (Figure 9). Apply the minimum required laser power and scan time necessary for visualization to avoid photodamage and bleaching. Use timelapse acquisition to continuously capture images approximately every 3.22 sec for 20-90 min.  Remove the mouse from the eye stabilizer and head-holding adaptor.  Euthanize the mouse. Analysis of the data is a very complex issue, which cannot be covered here in its entirety. The type of data analysis performed depends on the research question being asked. A recent review highlights the various analyses that can be performed (Weigert et al., 2013). Several software and freeware programs are available to image analysis including Bitplane Imaris, ImageJ, and CellTrack. Figure 10 demonstrates an example track analysis of a single myeloid cell using the Bitplane Imaris software program. Detailed Imaris software instructions are available through the company website (http://www.bitplane.com/imaris[href=http://www.bitplane.com/imaris]). Axial fluctuations manifested by slow changes to specimen focus may occur over the course of time-lapse imaging.",
    "The Imaris software program can help correct for these fluctuations in focus through its drift correction function. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150702/20150702061134_6203.jpgFigure 9. Confocal microscopy. Typical image of myeloid cells (green) in the stroma of un-injured and injured corneas.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150702/20150702061146_6948.jpgFigure 10. Image analysis. Sample motility analysis of a single myeloid cell over 90 minutes using the Bitplane Imaris software program."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}