{
  "id": 19533,
  "origin_website": "Jove",
  "title": "A Stably Established Two-Point Injection of Lysophosphatidylcholine-Induced Focal Demyelination Model in Mice",
  "procedures": [
    "All animal procedures were approved by the Institute of Animal Care Committee of Tongji Medical College, Huazhong University of Science and Technology, China. Adult C57BL/6 male and female mice (wild type, WT; 20-25 g; 8-10 weeks old) were used for the present study. The mice were obtained from commercial sources (see Table of Materials). Mice were housed in a specific pathogen-free (SPF) animal facility with water and food supplied ad libitum. They were kept in an alternating 12 h period of light and dark cycle in the standard conditions of 22 °C temperature and relative humidity of 55%-60%.\n1. LPC solution preparation\nDissolve 25 mg of LPC powder (see Table of Materials) with 250 µL of chloroform and methanol mixed solution (1:1) to make a 10% LPC solution and transfer it to a 500 µL centrifuge tube.\n\tNOTE: If the LPC is not completely dissolved, place the centrifuge tube in an ultrasonic cleaner and ultrasonicate at 40 kHz for ~1 h to obtain a uniform solution.\nDivide the solution into 3 µL/tube and store at −80 °C.\n\tNOTE: The solution can be stored for ~2 years.\nBefore surgery, dilute the solution (step 1.2.) with 27 µL of 0.9% NaCl solution, and keep the solution in a constant temperature water bath at 37 °C.\n\t​NOTE: Prepare the solution just before starting the injection.\n2. Surgical preparation\nUse a 32 G, 2 in needle to connect to a 5 µL syringe (see Table of Materials). Ensure that the microliter syringe is unobstructed. Withdraw 5 µL of LPC solution for preparation of the injection.\nAnesthetize the mouse in an induction chamber connected to an isoflurane vaporizer with 3% isoflurane mixed with 100% oxygen at a rate of about 0.3 L/min.",
    "Confirm the depth of anesthesia by the lack of toe-pinch reflex while the breathing is smooth.\nShave the head of the mouse between the ears using an electric shaver. Apply lubricating eye drops to prevent corneal dryness during the procedure.\nThen, position the mouse in a stereotaxic frame (see Table of Materials) with the dorsal side up, and secure the head with a nose cone and tooth clamp. Maintain anesthesia with 1.2%-1.6% isoflurane through its nose.\n\t​NOTE: Isoflurane concentration can be adjusted according to the respiratory status of the mice.\n3. Surgical procedure\nNOTE: Animals are placed on a heating pad during all procedures.\nFix the mouse to the stereotaxic apparatus with bilateral ear bars. Ensure that the ear bars are level and the head is horizontal and stable.\nDisinfect the skin on the head by wiping several times with iodophor followed by alcohol in circular motion. Then use a scalpel to cut a small incision of about 1.5 cm along the midline of the scalp to expose the skull.\nWipe the skull with a cotton swab dipped in 1% hydrogen peroxide until the bregma, lambda, and posterior fontanelle are exposed. Place the syringe on the stereotaxic apparatus.\n\tNOTE: Use hydrogen peroxide with care and avoid touching the surrounding tissues.\nEnsure horizontal positioning of the animal's head (both front and rear and left and right).\n\t\nAdjust the Z-axis knob of the stereotaxic frame so that the needle tip and the skull just touch without bending, then measure the Z-axis coordinate. Check the Z coordinates of bregma and posterior fontanelle.",
    "Adjust the ear bar so that the difference between the Z coordinates of bregma and posterior fontanelle is no more than 0.02 mm. Then, follow the same method to measure the Z coordinates of the corresponding positions on the left and right sides of the midline. Adjust the ear bar to ensure the left and right are at the same level.\nLocate the corpus callosum. Set the XYZ origin to bregma.\n\tNOTE: The first injection site is 1.0 mm lateral to the bregma, 2.4 mm deep, and 1.1 mm anterior. The second injection site is 1.0 mm lateral to the bregma, 2.1 mm deep, and 0.6 mm anterior. For example, the coordinate of the bregma is (0,0,0). Measure the Z coordinate of the corresponding location marked as (-1, 1.1, X) and (-1, 0.6, Y). It can be determined the first injection site coordinate of the corpus callosum is (-1, 1.1, −[X + 2.4]), and the second injection site is (-1, 0.6, −[Y + 2.1]).\nOnce the injection site is determined, make a mark with a sterile marker on the skull and record the coordinates.\nGently drill the marked site with a skull drill (see Table of Materials). Take care to avoid any bleeding.\nSlowly move the needle to the given coordinates and start the injection. To induce corpus callosum demyelination, inject 2 µL of LPC solution (step 1.) at each injection site (step 3.5.) at a rate of 0.4 µL/min.\nAfter injection, keep the needle in each site for an additional 10 min.\n\t​NOTE: Ensure that the interval of two injections is no more than 20 min.\nSuture the skin with a 4-0 suture and wait for the animal to wake up within 10 min. Administer analgesics postoperatively in accordance with institutional animal care regulations.",
    "NOTE: The recommended time for euthanasia can be determined according to the purpose of the experiment. \n4. Sample extraction for focal demyelination\nNOTE: For details regarding this step, please see the previously published report14.\nDissolve neutral red dye (see Table of Materials) in a 1% solution in phosphate-buffered saline (PBS).\nhours before sacrificing the mice (for details, see previous reference10), inject 500 µL of 1% neutral red dye in PBS by intraperitoneal injection for each mouse.\nPerform cardiac perfusion12 with 30 mL of 0.1% PBS precooled at 4 °C.\nSlice the brain into 1 mm with a brain mold (see Table of Materials).\nVisualize the lesion stained with neutral red under the microscope and dissociate the lesion.\n\t​NOTE: Remove as much surrounding normal tissue as possible to improve the accuracy of subsequent analysis. The lesion tissue can be examined with RT-PCR, electron microscopy, and western blot analyses.\n5. Histological staining and immunofluorescence\nFor histologic staining and immunofluorescence12, after cardiac perfusion (step 4.3.), remove the brain10, fix in 4% PFA overnight (at 4 °C), and completely dehydrate in 30% sucrose.\nCut into 20 mm coronal brain sections using a frozen slicer10 at constant temperature (−20 °C).\nUse the slices for Luxol fast blue (LFB) staining, immunofluorescence, and western blot10.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}