{
  "id": 3632,
  "origin_website": "Cell",
  "title": "Intracellular cholesterol visualization in brain tissue using D4H∗",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nBlocking and D4H∗ incubation step—Day 1\nTiming: 8–9 h\nNote: All staining and incubation steps are performed with free floating sections. Keep the sections in 24-well plates; use 250 μL volume for incubation steps and 2 mL for wash steps.\nNote: The plate with sections is placed on a plate rocker during wash steps and incubations, except when indicated otherwise.\nNote: All steps are performed at RT, unless stated otherwise.\nDuring day 1, an extensive blocking step is performed to reduce non-specific binding. This step is crucial to obtain a distinct signal. A 0.02% saponin solution is used as a permeabilization reagent because it selectively interacts with and removes cholesterol from the plasma membrane (PM), thus permeabilizing the membrane, as opposed to Triton X-100 or Tween-20, which unselectively remove lipids and any proteins bound to it.3[href=https://www.wicell.org#bib3] Therefore, saponin is regarded as a mild permeabilizing agent, while Triton X-100 or Tween-20 is more thorough. In addition, 0.02% saponin is sufficient to permeabilize the PM, but intracellular organelle membranes to a lesser extent, leaving these membranes more intact, leading to improved visualization of these structures with IHC.4[href=https://www.wicell.org#bib4],5[href=https://www.wicell.org#bib5] Lastly, glycine is used in the blocking buffer to remove unreacted aldehyde groups from the PFA used during PFA perfusion and tissue fixation.6[href=https://www.wicell.org#bib6] This results in reduced background signal that can be caused by PFA.\nRinse sections 3 × 5 min with wash buffer.\nRemove wash buffer and add blocking/permeabilization buffer, followed by 90 min incubation at 37°C.\nNote: Place the plate in a clean incubator or benchtop oven; rocking is not needed during this step.\nRinse sections 2 × 5 min with wash buffer.\nRemove wash buffer and incubate with D4H∗-mCherry recombinant protein working solution for 2 h.\nRinse sections 2 × 5 min with wash buffer.",
    "Rinse sections 1 × 5 min with PBS.\nIncubate the sections with 4% PFA for 20 min.\nNote: This step ensures that the D4H∗-mCherry bound to cholesterol is fixed in place by crosslinking the complex with other proteins in close proximity.\nCritical: Perform this step in the chemical hood, and collect the subsequent 3 washes in a separate toxic waste container. The plate does not have to be placed on the rocker during PFA incubation.\nRemove the 4% PFA solution and rinse 2 × 5 min with PBS.\nRemove the PBS and rinse 1 × 5 min with wash buffer.\nAlternatives: Blocking of endogenous avidin and biotin sites at step 10–13 are only needed if a biotin-labeled secondary antibody is used on day 2, step 18. In order to increase signal brightness, the use of a biotin-labeled secondary antibody is recommended, but fluorophore-labeled secondary antibodies can also be used.\nIncubate with avidin solution in antibody diluent for 15 min. Avidin solution is part of the Avidin/Biotin Blocking Kit.\nRinse 1x with wash buffer for 5 min.\nIncubate with biotin solution in antibody diluent for 15 min. Biotin solution is part of the Avidin/Biotin Blocking Kit.\nRinse 2 × 5 min with wash buffer.\nRe-block the sections with blocking/permeabilization buffer for 60 min at RT.\nRinse sections 2 × 5 min with wash buffer.\nIncubate with rabbit anti-Rab5 antibody at 1:1000 in antibody diluent overnight at 4°C.\nAlternatives: Any primary antibody of the desired protein of interest or marker of an organelle of interest can be used at this step.\nSecondary antibody and tyramide-fluorescein—Day 2\nTiming: 5 h",
    "On day 2 of this protocol a biotin-labeled secondary antibody is used to target primary antibody #1 (day 1, step 13). After adding the avidin/biotinylated enzyme complex (ABC)-HRP, tyramide-fluorescein is applied as HRP substrate, resulting in a significant amplification of the signal, and allowing for a highly specific and bright signal of Rab5.\nRinse the sections 3 × 10 min with wash buffer.\nIncubate with a biotin-labeled secondary antibody for 90 min.\nRinse 3 × 10 min with wash buffer.\nDuring this wash step, prepare the Elite ABC-HRP Kit solution, and let it sit at RT for at least 30 min before use.\nRemove the wash buffer and incubate with Elite ABC-HRP Kit solution for 90 min.\nRinse 2 × 5 min with wash buffer.\nRinse 1 × 5 min with PBS.\nPrepare 7.5 μM tyramide-fluorescein from the 1000x stock solution, in 0.0015% H2O2 buffer.\nIncubate the sections with 7.5 μM tyramide-fluorescein for 10 min at RT.\nAlternatives: Other Tyramides with a fluorophore tag can be used, but would require optimization.\nRinse 3 × 10 min with wash buffer.\nIncubate with rabbit-anti mCherry primary antibody at 1:500 in antibody diluent overnight at 4°C.\nAlternatives: During this step, any primary antibodies that will be targeted with a fluorophore-labeled secondary antibody can be included into the primary antibody mix. If using an antibody of the same host, sequential staining must be performed.\nSecondary antibody #2 and quenching—Day 3\nTiming: 8 h",
    "On day 3 of this protocol, the secondary antibody Alexa Fluor 647 anti-Rabbit is applied to target the rabbit anti-mCherry antibody. The tissues are treated with quenching buffer containing glycine to get rid of any remaining aldehyde groups and reduce background fluorescence. Lastly, the TrueBlack reagent is used to quench any lipofuscin autofluorescence. Especially in older brain tissues, lipofuscin can lead to significant background signal in the form of intracellular vesicles. To obtain specific fluorescent signal from the cholesterol puncta and other co-stained structures, it is crucial to apply this quenching dye.\nRinse 3 × 10 min with wash buffer.\nIncubate with Alexa Fluor 647 anti-Rabbit secondary antibody at 1:1000 in antibody diluent for 90 min.\nRinse 1 × 5 min with wash buffer.\nIncubate with 1 μg/mL DAPI solution in PBS for 30 min.\nRinse 3 × 10 min with wash buffer.\nIncubate with quench buffer for 30 min.\nRinse 3 × 5 min with 0.02% saponin.\nTransfer sections to microscope slides and encircle the sections with a Pap pen to create a hydrophobic barrier.\nCritical: Ensure that the sections are always covered with PBS; letting the tissues dry out will affect the fluorescent signal.\nRemove any excess PBS from the tissues by carefully dabbing the microscope slide with a tissue.\nIncubate the tissues with TrueBlack solution for no more than 4 min.\nNote: Exceeding 4 min incubation time may lead to loss of fluorescent signal.\nNote: It is not advised to use Sudan Black instead of TrueBlack, as it is known that Sudan black causes background fluorescence in the 647 nm channel.7[href=https://www.wicell.org#bib7]\nCarefully pour or pipette off the TrueBlack and rinse 2x with 70% ethanol for 1 min.\nRinse with 0.02% saponin solution for 5 min.",
    "Wipe off any excess 0.02% saponin with a tissue so that the microscope slide is dry, but the tissue sections are still moist.\nAdd 50 μL ProLong Glass Antifade Mountant solution and gently place the coverslip on top.\nLet the microscope slides dry at RT in the dark for at least 24 h to allow the mountant to cure hard-set.\nNote: The sections can remain at RT covered with 0.02% saponin while coverslips are placed on the tissues one by one."
  ],
  "subjectAreas": [
    "Microscopy",
    "Molecular/Chemical Probes",
    "Antibody"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}