{
  "id": 17680,
  "origin_website": "Jove",
  "title": "Taking the Next Step: a Neural Coaptation Orthotopic Hind Limb Transplant Model to Maximize Functional Recovery in Rat",
  "procedures": [
    "All experiments were conducted in accordance with the Guide for the Care and Use of Laboratory Animals of the National Institutes of Health (NIH) and were approved by the Northwestern University Animal Care and Use Committee. The specific procedures were performed under protocol IS00001663.\nNOTE: Two strains of rats were used, Lewis rats and August Copenhagen x Irish (ACI) rats. Animals were divided into three treatment groups: allotransplant without immune suppression (ACI to Lewis), allotransplant with conventional immune suppression (ACI to Lewis), and isotransplant (Lewis to Lewis or ACI to ACI). Lewis is an inbred strain, while ACI rats represent an out-bred wild-type, therefore this combination was chosen to model the worse-case rejection response. Conventional immunosuppression was administered subcutaneously either as rapamycin 1 mg/kg from post-operative day (POD) minus 1 to POD 28 or as FK506 3 mg/kg from POD 0 to POD 14, and then once weekly thereafter. Both male and female rats were eligible recipients from 8 to 16 weeks old, weighing between 250 and 400 grams at the time of surgery.\n1. Donor right hind limb harvest\nInduce general anesthesia with 5% isoflurane in pure oxygen through a vaporizer with an appropriate scavenging system.\nConfirm adequate depth of anesthesia with toe pinch, and then use hair clippers to trim the fur off of the right hind limb and right groin surgical site\nDown-titrate the isoflurane through a rodent nose cone to 2-2.5%.\nPosition the rat supine with spread limbs taped out to the sides on an operating board with a heating pad underneath. Disinfect the hairless skin with 70% rubbing alcohol and protect the surgical field with sterile gauze.\nUsing an appropriate microsurgical microscope, microsurgical instruments, and with easy access to bipolar and monopolar electrocautery, begin the dissection.",
    "Use scissors to make a circumferential skin/subcutaneous tissue incision around the right hindlimb. Start in the inguinal crease medially at roughly the same level as the inguinal ligament and extend dorsal-laterally to complete the circumferential incision.\nHaving exposed the muscular layer directly beneath the incision, dissect and cauterize the superficial epigastric vessels that lead from the muscular layer to the proximal skin/subcutaneous flap just created.\nReflect the proximal flap superomedially to the inguinal ligament and the distal skin/subcutaneous flap inferolaterally to the knee.\nUse a wire retractor or rolled gauze to help expose the field.\nObserve that the inguinal anatomy of the rat is similar to humans; from lateral to medial lie the nerve, artery, and vein.\nDissect out the femoral nerve, divide it sharply at the inguinal ligament, proximal to the bifurcation if possible. Retract the divided nerve inferiorly, keeping it safely out of the way, covered beneath moist gauze.\nTurning attention to the femoral artery and vein, use 4 cm 7-0 silk ties to atraumatically retract the vessels instead of handling them directly.\nLigate all branches of the femoral vessels as they arise with 7-0 silk ties; divide the branches between the ties. For very small branches, bipolar cautery may be used instead of ties.\n\tNOTE: Arterial and venous branches which require division include the superficial circumflex iliac and the muscular vessels. The superficial circumflex iliac is usually largest and appears to dive deep as would the profunda femoral in humans, but the profunda is absent in the rat15. More distal branches of the femoral vessels such as the highest genicular and the saphenous branch do not usually require division.\nSystemically inject 500 international units of heparin through the penile vein in a male rat donor. Use the superficial epigastric vein if the donor rat is female.",
    "Allow the heparin to circulate systemically for 2 min before proceeding with the next steps.\nLigate the femoral artery with 7-0 silk ties as proximal to the inguinal ligament as possible and divide between the ties.\nSimilar to the artery, ligate and divide the femoral vein.\nReflect both artery and vein inferiorly, safely out of the way, covered beneath moist gauze together with the femoral nerve covered previously. Dissect the ventral muscle groups, taking care to cauterize any visible vessel that arises. Attention to hemostasis here will minimize recipient blood loss after reperfusion.\nDeep to the ventral muscle groups, identify and sharply divide the sciatic nerve proximal to its branches. Three sciatic branches are usually visible: tibial, peroneal and sural. All three should all be preserved in the donor limb. A fourth cutaneous branch is not typically seen in this dissection15,16.\nFinish dividing the remaining ventral and dorsal muscle groups at mid-thigh level with meticulous hemostasis. It may be necessary to retract the limb medially to complete dividing the muscles.\nTransect the femur bone at midshaft using a hand-held cordless rotary saw.\nHaving removed the limb graft from the donor, cut the silk tied ends from the graft side femoral artery and vein stumps, thereby re-opening the vessels.\nInsert a 24-gauge angiocatheter into the graft artery stump and flush the graft with 250 international units of heparin diluted in 5 mL of ice-cold normal saline, watching it flow out clear through the opened vein.\nSlowly, gently flush the graft for around 3 min. Excess forceful flushing may damage the endothelium.\nPlace the graft in a chilled saline dish nested in an ice bucket until transplantation.\nEuthanize the donor rat with bilateral thoracotomy.\nClean all surgical instruments appropriately.\n2. Recipient native right hind limb amputation",
    "Induce anesthesia with isoflurane at 5%, confirm depth, trim the fur, position the animal, and disinfect the skin with alcohol as described for the donor rat.\nDown-titrate isoflurane to 2-2.5% and inject subcutaneous preoperative analgesia with buprenorphine 1.2 mg/kg, and preoperative prophylaxis with enrofloxacin 7.5 mg/kg.\nSame as for the donor, make a circumferential incision in the inguinal crease, reflect skin flaps assuring hemostasis, and dissect out the femoral nerve, artery and vein, ligating the same branch vessels as above.\nDivide the femoral nerve more distally than for the donor, but proximally to the bifurcation if possible.\nDissect out the femoral artery and vein with enough space to clamp each separately at the level of the inguinal ligament. Clamp the vein and artery with microsurgical bulldog clamps. Once clamped, divide each vessel sharply with scissors.\nDivide the ventral and dorsal muscles of the thigh at mid-thigh level with meticulous hemostasis, retracting the limb medially as necessary.\nIdentify and divide the sciatic nerves proximal to their branch points as above.\nTransect the femur at midshaft using the saw.\nRemove the recipient native right hind limb and dispose appropriately.\nDown-titrate the isoflurane to 1-1.5% through the nose cone.\n3. Donor to recipient limb implantation\nUsing the hand-held power saw, shave off any irregularities from both donor and recipient femur cut ends.\nUsing the saw, cut off the hub end of an 18-gauge needle, which will become the femur intramedullary rod.\nBefore manipulating the bone, apply a small amount of bone wax to the recipient cut end of femur bone to reduce marrow bleeding during the reaming process.\nCoapt the donor and recipient femoral bones using the 18-gauge needle as an intramedullary rod. Some force is necessary, but do not ream either bone so far as to fracture the cortex.",
    "As needed, remove the needle and trim it to an appropriate length so that both bones fit smoothly over the needle with no needle showing in between the bone.\nPlace a small support such as a pad of gauze or a small rock or modelling clay underneath the donor limb to keep it off tension.\nReapproximate the ventral muscle groups with eight to ten simple interrupted 5-0 polyglactin sutures so that the graft does not rotate around the femur needle. This gives the limb stability for the anastomoses.\nPeriodically irrigate the graft and surgical field with ice-cold saline for better visualization and to reduce warm ischemic reperfusion injury.\nAlign the donor and recipient femoral arteries and anastomose them in end to end fashion using simple interrupted 10-0 nylon suture, avoiding both tension and looping. The artery requires an average of six sutures.\nSimilar to the artery, anastomose the donor and recipient femoral veins in end to end fashion. The vein requires six to eight sutures.\n\tNOTE: Generous cold saline irrigation, atraumatic vessel handling technique, and leaving long tails to serve as stay sutures for vessel retraction are important tools for effective microsurgical anastomoses.\nPlace a small amount of hemostatic cellulose powder around both anastomoses, and then remove the proximal microsurgical bulldog clamps on the vein and the artery.\nInspect both anastomoses for good patency and flow. Use cotton swab sticks to gently prod the vein and assure good hemostasis of both anastomoses. Hold pressure over bleeding sites and place more hemostatic cellulose powder if needed. Another suture may be placed through a bleeding hole at the risk of “back-walling\" the needle only as a last resort.\nWhen both anastomoses are confirmed satisfactory, trim any remaining long stay suture tails short to match the others.",
    "Reposition the rat to the left lateral decubitus position, use liberal electrocautery to attain meticulous hemostasis of any reperfusion muscle bleeding.\nTurn attention to the nerve anastomoses once muscle hemostasis is assured. Trim back any nerve cut ends that appear ragged.\nReapproximate the dorsal muscle groups under sciatic nerve with simple interrupted 5-0 polyglactin sutures.\nReapproximate the sciatic nerve. Eight to ten 10-0 nylon neural simple interrupted sutures will usually suffice.\nReapproximate the reminding dorsal muscle groups and then close the dorsal skin with 4-0 polyglactin continuous suture.\nReposition the rat back to supine position and reapproximate the femoral nerve. Two to three 10-0 nylon neural simple interrupted sutures will usually suffice.\nClose the ventral skin with 4-0 polyglactin continuous suture. Avoid excess suture tail, which can be irritating to the rat once awake.\n4. Post-operative care\nRecover animals in their cages with a heating pad under the cage and ready access to food and water, monitoring for early complications daily for the first week.\nProvide post-operative analgesia with subcutaneous meloxicam 1 mg/kg daily injection through POD 2. Provide post-operative antibiotic prophylaxis dilute enrofloxacin spray. Provide disincentive for autotomy (self-mutilation) with Bitter Safe Mist sprayed twice daily to the graft through POD 7.\nMaintain transplanted rats in cages with other rats, to stimulate return to daily activities and rehabilitate the transplanted limb.\n5. Post-operative sensation testing\nApply the Hargreaves testing of thermal sensation protocol, also described elsewhere17,18.\nPlace the rat in the testing container and allowed it to acclimatize for 20 minutes. The apparatus glass is confirmed clean, and the heat source confirmed to be working with the investigator’s finger.\nBefore testing, confirm that the rat is awake and the tested paw is positioned over the infrared motion detector.",
    "Transmit thermal energy at intensity level 90. Time delay in the animal moving its paw away from the heat source is recorded. If no movement occurs within 20 seconds, the test is aborted to prevent injury.\nObtain five trials per tested limb, excluding the highest and lowest value before calculating the mean withdrawal latency time for each animal.\n6. Post-operative motor testing\nUsing a gait analysis treadmill and integrated software analysis platform, select candidates for treadmill testing at four to six weeks post-surgery.\nTrim all rat toenails one or two days before testing.\nAcclimatize animals to the testing room for one hour before testing, and allow for one minute of pre-test petting to calm anxiety.\nPlacing the rat inside the treadmill, run the treadmill at trials of increasing speed, from 10 cm/s, to 14 cm/s, to the goal 18 cm/s. If the rat is reticent and cannot be coaxed to walk, abort the testing that day to avoid negative conditioning. Allow high performers to walk up to 24 cm/s.\nRinse the treadmill apparatus with 70% ethanol in between tested animals.\nGait parameters are output from the analysis platform’s proprietary software.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}