{
  "id": 12153,
  "origin_website": "Jove",
  "title": "Phospho Flow Cytometry with Fluorescent Cell Barcoding for Single Cell Signaling Analysis and Biomarker Discovery",
  "procedures": [
    "Blood samples were received following written informed consent from all donors. The study was approved by the Regional Committee for Medical and Health Research Ethics of South-East Norway and the research on human blood was carried out in accordance with the Declaration of Helsinki8.\nNOTE: Steps 1-3 should be performed under sterile conditions in a tissue culture hood.\n1. Isolation of Peripheral Blood Mononuclear Cells (PBMCs) from CLL Patient Blood Samples\nCAUTION: Human blood should be handled according to regulations for Biosafety Level 2.\nDilute the blood 1:1 with phosphate-buffered saline (PBS: 136.9 mM NaCl, 2.7 mM KCl, 10.1 mM Na2HPO4 x 2H2O, 1.8 mM KH2PO4, pH 7.4) and transfer to 50 mL tubes (30 mL/tube).\nCarefully layer 10 mL of a density gradient medium (e.g., Lymphoprep) to the bottom of the tube using a 10 mL pipette.\nCentrifuge at 800 x g for 20 min at 4 °C. The PBMCs are now visible on top of the density gradient medium layer.\nUse a Pasteur pipette to transfer the cells into two new 50 mL tubes. Wash twice with PBS (fill up the tubes).\nCentrifuge at 350 x g for 15 min. Discard the supernatant and resuspend in 3 mL of PBS.\nCount the cells using a preferred method.\nCentrifuge the cells at 350 x g for 5 min. Discard the supernatant. NOTE: Steps 1.8 to 3.2 are optional. It is possible to proceed directly to step 3.3.\nResuspend the cells in fetal bovine serum (FBS) supplemented with 10% dimethyl sulfoxide (DMSO) and freeze down in suitable aliquots using cryo tubes.\nNOTE: DMSO is toxic to the cells. Work fast once the cells are mixed with FBS/DMSO. Cells can be stored long term in liquid nitrogen.\n2. Thawing of Cells\nQuickly thaw the cells in a 37 °C water bath.",
    "NOTE: DMSO is toxic to the cells. Work fast to limit the exposure to DMSO.\nWash the cells once with 10 mL of cold Roswell Park Memorial Institute medium (RPMI 1640 with supplemental GlutaMAX, see Table of Materials).\nCentrifuge at 300 x g for 5 min. Discard the supernatant.\nResuspend the cells in RPMI 1640 medium supplemented with sodium pyruvate, MEM non-essential amino acids and penicillin/streptomycin (added at 1x dilution according to instructions) and 10% FBS. Transfer the cells to a small cell culture flask and leave in an incubator at 5% CO2, 37 °C for 1 hour to allow the cells to calibrate.\n3. Preparation of Cells\nCount the viable cells using a preferred method.\nTransfer the cells to a 50 mL tube and centrifuge at 300 x g for 5 min. Discard the supernatant.\nResuspend the cells in RPMI 1640 medium (step 2.2) supplemented with 1% FBS to no more than 50 x 106 cells/mL.\nTransfer the required amount of cell suspension to wells in a 96 well V-bottom plate.\nNOTE: Number of wells corresponds to the number of conditions to be tested. Samples for a stimulation time-course are drawn from a single well. Calculate 50 µL sample per time-point + 50 µL of dead volume. Save samples for compensation controls (one unstained sample + one sample per barcoding dye).\nTransfer the 96 well plate to a pre-heated 37 °C water bath. Rest the cells for 10 min.\n4. Stimulation and Fixation of Cells\nNOTE: Perform steps 4-8 on the lab bench (i.e., not sterile).\nCAUTION: The main ingredient of Fix Buffer I is paraformaldehyde, which is toxic (inhalation and skin contact). Handle with care.",
    "Prepare a 96 well V-bottom plate with 60 µL of Fix Buffer I per well per sample. Leave in the 37 °C water bath.\nNOTE: Cells: Fix buffer should be 1:1. In order to allow for evaporation at 37 °C, the Fix buffer is initially in abundance.\nOptionally, treat the cells with drugs before stimulation.\nTransfer a 50 µL control sample to the fix plate. Mix by pipetting up and down.\nOptionally, start the stimulation time-course by adding 10 µg/mL anti-IgM to the cells. Mix by pipetting up and down.\nTransfer a 50 µL sample to the fix plate at each time-point. Mix by pipetting up and down.\nNOTE: Anti-IgM induced signaling is usually initiated early (minutes).\nLeave the fix plate at 37 °C for 10 min after the last sample has been added.\n5. Fluorescent Cell Barcoding (FCB)\nNOTE: See Table 1 for a list of barcoding reagents.\nWash the fixed cells 3x with PBS (fill up the wells).\nCentrifuge at 500 x g for 5 min. Discard the supernatant.\nPrepare a 96 well V-bottom plate with barcoding reagents. Pipet 5 µL of each barcoding reagent per well in the number of combinations required to stain all samples following the staining matrix, e.g., in Figure 1B. Each sample will have a unique combination of different barcoding concentrations.\nResuspend the cells in 190 µL of PBS and transfer to the barcoding plate. Mix thoroughly.\nNOTE: Stain one compensation sample with the highest final concentration used for each barcoding reagent and save one unstained sample.\nLeave the cells for 20 min at room temperature, in the dark.\nWash the stained cells 2x with flow wash (PBS, 1% FBS, 0.09% sodium azide) (fill up the wells).\nCentrifuge at 500 x g for 5 min. Discard the supernatant.",
    "Add 190 µL of flow wash to the cells and combine the barcoded samples in one 15 mL tube. Transfer each compensation control to a separate 1.7 mL tube.\nCentrifuge at 500 x g for 5 min. Discard the supernatant.\n6. Cell Permeabilization for Intracellular Antigen Staining\nCAUTION: The main ingredient of Perm Buffer III is methanol which is toxic (inhalation and skin contact) and flammable. Handle with care.\nTransfer 2 mL of Perm Buffer III to a 15 mL tube. Leave at -20 °C so it is ice-cold upon use.\nNOTE: The Perm Buffer can be left at -20 °C from the start of the experiment.\nAdd 1.5 mL of ice-cold Perm Buffer to the barcoded cell population (in a 15 mL tube) and 100 µL to each compensation control (in 1.7 mL tubes) drop-wise while vortexing to avoid that the cells clump together.\nTransfer the cells directly to -80 °C. Leave for a minimum of 30 min.\nNOTE: It is natural to pause the experiment at this point. Cells in Perm Buffer can be stored long term at -80 °C.\n7. Antibody Staining\nNOTE: See Table of Materials for a list of reported phospho-specific antibodies.\nTransfer the cells from -80 °C to a box of ice.\nWash 3x with flow wash.\nNOTE: It is important to add flow wash in excess to see the cell pellet, e.g., add 3 mL of flow wash to the barcoded cell population and 1 mL to each compensation control.\nCentrifuge at 500 x g for 5 min at 4 °C. Discard the supernatant.\nResuspend the barcoded cell population in a volume of flow wash, which allows 25 µL of cell suspension per phospho-antibody stain. Resuspend the compensation controls in 200 µL of flow wash.",
    "Prepare antibodies for staining in a 96 well V-bottom plate. The final volume will be 50 µL/well. Per well, add phospho-specific antibody diluted in flow wash to a final volume of 10 µL, surface marker diluted in flow wash to a final volume of 15 µL, and 25 µL of cell suspension.\nNOTE: Antibody dilutions should be titrated prior to the experiment. Include isotype control.\nLeave the cells for 30 min at room temperature, in the dark.\nWash the stained cells 2x with flow wash (fill up the wells).\nCentrifuge at 500 x g for 5 min. Discard the supernatant.\nResuspend the cells in 150 µL of flow wash.\n8. Preparation of Compensation Controls\nPrepare compensation controls for the antibody-conjugated fluorochromes in parallel with the antibody staining. Use compensation beads according to the vendor’s instructions.\n9. Flow Cytometry Analysis\nNOTE: The experiment can be run on a flow cytometer with a High Throughput Sampler (HTS).\nOptimize the photomultiplier tube (PMT) voltage with the unstained control.\nRun compensation controls and calculate the compensation matrix.\nRun samples. The event rate should be in accordance with the instrument specifications.\n10. Gating Strategy and Data Analysis\nImport the FCS files from the experiment to a flow cytometry analysis software like FlowJo or Cytobank (https://cellmass.cytobank.org).\nGating strategy\n\t\nSelect lymphocytes by plotting SSC-A versus FSC-A in a density dot plot.\nDisplay the lymphocytes and select the singlets by plotting SSC-A versus FSC -W.\nDisplay the single cells and gate the cell type by plotting SSC-A versus the surface marker.\nDisplay the cell type population in a Pacific Blue versus SSC-A density plot and select the different FCB populations based on their Pacific Blue staining intensity (see Figure 1A).",
    "Plot the phospho antibody channel against the FCB channel, or as a heatmap (see Figure 1A) to display the phosphorylation events.\nCalculate phospho-signals using the inverse hyperbolic sine (arcsinh) of the MFI (median fluorescent intensity) of phospho-signal versus isotype control (basal phosphorylation levels, see Figure 1D), or of stimulated versus unstimulated cell populations (see Figure 1E).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}