{
  "id": 18610,
  "origin_website": "Jove",
  "title": "Preparation of High-Quality Fermented Fish Product",
  "procedures": [
    "1. Sample preparation\nThaw frozen sturgeon meat under flowing water below 20 °C. Then, clean, skin off and cut the fish into cubes (2 cm × 2 cm × 1.5 cm).\n\tNOTE: Raw material could be fresh or frozen sturgeon meat.\nMix fish cubes with 6-12% (w/v) salt solution at a rate of 1:1 (fish cube mass to solution volume), at 10 °C for 1-3 h.\nPut the marinated fish cubes onto a stainless-steel gridding plate and dry fish cubes at 40-60 °C for about 6-10 h by hot air, or dry the fish cubes in vacuum, until the water content decreases to 50-60%.\nMix dried fish cubes with the flavor solution inoculating 0.4-1.6% (w/w, starter culture mass to fish cube mass) S. cerevisiae at a rate of 1:1 (fish cube mass to solution volume). Seal the mixture in a container and ferment at 25-35 °C for 6-10 h.\n\tNOTE: The fermentation must be performed under anaerobic environment.\n\t\nPrepare the flavor solution to include 25% spices liquid, 40% yellow wine, 7% white wine, 25% cane sugar, 2% monosodium glutamate, and 1% vinegar in mass fraction.\nPrepare the spice liquid is as follows. Mix spices including 1.2 units of scallions, 1 unit of ginger, 0.6 units of star anise, 0.6 units of fennel, 0.3 units of green tea and 0.3 units of pepper with 40 units of water and boil for 0.5 h. Collect the filtrate. Mix the residue with another 40 units of water and boil for 0.5 h again. Combine filtrates of the two boils and make up to 100 units using boiled water.\n\t\tNOTE: It is a must to pause the protocol here until the spice liquid has cooled to the room temperature before the addition of starter culture. This pause could avoid inactivation of yeast by heat.",
    "Seal fermented fish cubes in vacuum package with marinating and fermenting solutions at a rate of 11-13:1 (fish cube mass to solution volume). The vacuum strength, sealing time and cooling time are 0.085 MPa, 3.6 s and 5.5 s, respectively.\n\tNOTE: The vacuum package material is polyethylene terephthalate/cast polypropylene (PET/CPP). The package weight is 50-80 g.\nSterilize packed fish cubes before storage and sale. The sterilization F-value should be more than 4.5 min. The sterilization temperature and time are 115-121 °C and 10-20 min, respectively. Maintain pressure constant at 0.12 MPa for cooling after sterilization.\n\tNOTE: When sterilization F-value is 4.5 min and sterilization temperature is set as 121 °C, the sterilization time is 11.4 min in the equipment conditions of this article. Revise the sterilization time when the type of equipment used is different.\n2. Estimation of shelf life of fermented sturgeon meat product\nNOTE: The estimation of shelf life of fermented sturgeon meat product uses accelerated shelf life testing (ASLT) method with Arrhenius model according to the method of Wahyuni et al. with some modifications18.\nStore products at 20 °C, 30 °C, 40 °C.\nPredict the shelf life by the Arrhenius model using rancidity rates. Measure rancidity rates by testing acid values (AV) under different temperatures.\nMeasure AV on the 0th, 14th, 28th, 42nd, 56th, 70th days.\n3. Chemical analysis\nDetermination of salt content\n\tNOTE: We measure salt content according to the method proposed by Zeng et al.19.\n\t\nAccurately weigh 1 g of the sample and add 10 mL of 0.1 M AgNO3 + 10 mL of HNO3.\nHeat the mixture gently on an induction-cooker for 10 min.\nCool the mixture with running water, and add distilled water (50 mL) and ferric alum indicator (5 mL).",
    "Titrate the mixture with standard 0.1 M KSCN until the solution turns permanent brownish-red.\n\t\tNOTE: Calculate and express the results as % NaCl.\nDetermination of moisture content\n\t\nDetermine moisture content according to the method of Zeng et al.19.\nDetermination of pH value\n\tNOTE: We measure pH value according to the method of Zeng et al.6.\n\t\nHomogenize 10 g of the sample with 90 mL of deionized water.\nMeasure the pH value with a digital pH meter.\n4. Headspace solid-phase microextraction followed by gas chromatography-mass spectrometry (SPME-GC/MS) analysis\nNOTE: We measure flavor according to the method of Gao et al. with some modification17.\nExtraction of volatile flavors\n\t\nWeigh 2 g of the sample accurately, and then put it into the sample vial.\nAdd 2.5 mL of saturated sodium chloride solution and 0.5 M 2,4,6-trimethylpyridine into the sample vial with a rotor, and then close the vial cap.\nPut the sample vial on the magnetic stirrer and stir for 10 min to mix the sample homogenously.\nInsert the fiber into the headspace of the sample vial.\nAdsorb at 60 °C for 30 min, and then desorb at 250 °C for 3 min in the injection port.\nAnalysis of flavor by GC-MS\n\t\nRefer to the Table of Materials for details of the instrument used.\nUse Helium (purity > 99.995%) as the carrier gas, and set the flow rate to 0.9 mL/min.\nSet the column temperature to 40 °C for 3 min initially, and then increase to 90 °C at a rate of 5 °C/min. Subsequently, increase to 230 °C at a rate of 10 °C/min.",
    "Run MS in electron ionization (EI)+ mode, and set electron energy as 70 eV. Set scan range from 30 m/z to 500 m/z. Set emission current to 80 μA. Use interface and source temperatures of 250 and 200 °C, respectively.\nIdentify the volatile flavor compounds by NIST2005 and Willey 7 standard libraries. Semi-quantify the retention index (RI) of volatile compounds using an internal standard (2,4,6-trimethylpyridine).\nCalculate the concentration of volatile flavor compounds by comparing the peak area of each flavor compound with that of the internal standard. Express the results as μg/kg.\n5. Texture profile analysis\nNOTE: Analyze texture profile by following a previous study20.\nPerform texture profile analysis (TPA) with a texture analyzer equipped with a cylindrical probe (P/36R).\nApply two consecutive cycles. Deformation degree of TPA is 50% and the trigger force is 5 x g.\nThe speed of cylindrical probe for pre-, in- and pro-test, are 2, 1 and 5 mm/s, respectively. Calculate the texture parameters by its inbuilt software.\n6. Color measurement\nNOTE: Measure color according to the method of Czerner et al. with some modifications21.\nMeasure samples by using colorimeter. Record the lightness value (L*), greenness/redness value (a*) and blueness/yellowness value (b*) of the samples.\nMeasure five replicates for each sample.\n7. Sensory evaluation\nConduct sensory analysis of samples by at least 20 trained panelists (23 panelists as an example, 12 man and 11 women, ages 20-40) using a previously method with some modifications20.\nScore the samples from 0 to 10 for taste, flavor, color and texture. Score 0 represents \"dislike extremely\" and score 10 represents for \"like extremely\".",
    "NOTE: Scoring criteria are shown in Table 1. The overall score is composed of a sum of different contributors (30% taste score + 30% flavor score + 20% color score + 20% texture score). An overall score of 6 is viewed as the borderline of acceptable quality.\ntable:\n﻿0,1,2\nQuality parameter,Description,Score\nTaste,Acceptable sweet and salty; harmonious taste; wine taste; not astringent,8-10\nTaste,Too heavy or light (sweet or salty); harmonious taste; wine taste; not astringent,6-8\nTaste,Too heavy or light (sweet or salty); light wine- and after- taste; astringent,3-6\nTaste,Too light wine- and after- taste; obviously astringent,0-3\nFlavor,Mellow wine flavor; rich fermentation aroma; no weird smell,8-10\nFlavor,Mellow wine flavor; light fermentation aroma; no weird smell,6-8\nFlavor,Light wine flavor; light fermentation aroma; light weird smell,3-6\nFlavor,No wine aroma; light fermentation aroma; obviously weird smell,0-3\nAppearance,Russet color; glossy appearance; bright surface,8-10\nAppearance,Russet color; bright surface,6-8\nAppearance,Yellow color; nonuniform,3-6\nAppearance,Pale color; rough surface,0-3\nTexture,Acceptable chewiness,8-10\nTexture,Hard,6-8\nTexture,Light springiness,3-6\nTexture,Soft texture; coarse mouth-feel,0-3\nTable 1: Scoring criteria for sensory quality of fermented wine-aroma sturgeon meat product.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}