{
  "id": 19335,
  "origin_website": "Jove",
  "title": "Modeling Multiple Sclerosis in the Two Sexes: MOG35-55-Induced Experimental Autoimmune Encephalomyelitis",
  "procedures": [
    "The animal care and handling in the present work was performed according to the European Union Council Directive of 22nd September 2010 (2010/63/UE); all the procedures reported in the present study were approved by the Italian Ministry of Health (407/2018-PR) and by the Ethical Committee of the University of Torino (Project n° 360384). We suggest conforming to the experimental design to the ARRIVE guidelines originally published by Kilkenny et al. in 201020. Before starting, ensure that the necessary materials are available (see Table of Materials). Sterilize all glassware and utensils used for the preparation of the MOG35-55 emulsion in an autoclave. A summary of the experimental procedures is represented in Figure 1.\n1. Preparation of MOG35-55  emulsion\nNOTE: To prepare the emulsion, MOG35-55, incomplete Freud's adjuvant (IFA), Mycobacterium Tuberculosis strain H37Ra (MT), and physiological solution are required (see Table of Materials).\nCAUTION: Heat-killed MT can stimulate the innate immune response. Avoid inhalation, ingestion, and contact with skin and eyes using proper personal protective equipment and weighing MT in a covered precision balance under the hood.\ntable:\n﻿0,1,2\nSolution,Composition,Notes\n2 mg/mL MOG35-55 peptide solution,Lyophilized MOG35-55 peptide diluted in physiological solution at 2 mg/mL concentration,Preserve the already diluted solution at -80 °C.\n5 µg/mL PT solution,Lyophilized PT diluted in physiological solution at 5 µg/mL concentration.,Preserve the already diluted solution at -80 °C.\nEmulsion,The total volume of emulsion needed for each mouse to be immunized is 300 µL divided as follows:,\"To avoid alteraions or contamination, prepare the emulsion the day of the immunization.\"\n,\"200 µg/mouse of MOG35-55 , i.e., 100 µL of MOG35-55 2 mg/mL solution.\",\n,50 µL of physiological solution,\n,150 µL of IFA,\n,\"4 mg/mL MT, i.e., 1.2 mg/mouse\",\nPhysiological solution,Sodium chloride 0.9% diluted in distilled water.,\nTable 1: Composition of the solutions used for the immunization procedure.",
    "Prepare the solution in a glass beaker, adding the liquid component first and finally the MT.\n\tNOTE: The total volume of emulsion needed for each mouse to be immunized is 300 µL, divided as indicated in Table 1. The emulsion is very viscous and thick, so during the preparation and injection procedure, there could be some loss, especially when preparing the solution for a few mice. We suggest calculating the final volume of emulsion needed by overestimating the number of mice to be immunized by at least 1.5-2-fold.\nPlace the beaker in ice and use the glass syringe with an 18 G needle to start emulsifying the solution.\n\tNOTE: The emulsion can also be prepared using other strategies, for example, by connecting the two air-free glass syringes with a three-way stopcock and mixing the solution by pushing the plungers back and forth21,22.\nEmulsify the solution for at least 15 min; generally, 30 min of emulsification is enough. To check the quality of the emulsion, add a drop of emulsion in a transparent container filled with water: if the drop maintains its structure and remains intact, the emulsion is ready.\nPlace the emulsion directly inside the 1 mL syringes that will be used for the immunization and store these at +4 °C until use to preserve the thickness of the emulsion and avoid alterations or contaminations.\n2. Animal selection and immunization\nAnimal selection\nSelect adult C57BL/6J mice of both sexes at 8-10 weeks of age with an optimal body weight of ~20 g. Be sure to select age- and sex-matched mice for different experimental groups because the susceptibility to disease can vary with age and sex.",
    "NOTE: Mice should be of comparable body weight on the day of immunization because the present procedure is optimized for a certain body weight range (17-25 g).\nHouse same-sex animals in groups (n = 4-5/cage) to avoid social isolation in standard conditions in 45 cm x 25 cm x 15 cm polypropylene mouse cages at 22 ± 2 °C, under 12:12 light/dark cycle (lights on at 08:00 AM). Provide food and water ad libitum.\n\t\tNOTE: Eventually, to further limit the potential variability of disease course in the immunized animals, we also suggest forming sufficiently numerous experimental groups. There are also studies8,23 that describe the timing of immunization as a condition that determines variation in EAE outcome. Thus, we suggest performing the immunization approximately at the same hour in all animals, preferably during the light hours of the daily light/dark cycle23. To limit stress, it is preferable to manipulate the animals prior to the day of immunization and to mark them to easily identify them for daily evaluation, for example, ear clipping or tag.\nThe immunization procedure\n\tNOTE: Ensure that the procedure is performed by an experienced investigator to minimize stress for animals and optimize immunization. Before starting the immunization, select the anesthesia method in accordance with the institutional animal care and ethical committee guidelines. Our laboratory uses brief anesthesia with isoflurane.\n\t\nAnesthetize the mouse: 4% isoflurane for anesthesia induction and 1.5-2% isoflurane for anesthesia maintenance. Wait for the anesthesia to be effective and use a back and front foot toe pinch to assess the level of anesthesia. To prevent dryness of the eyes while the mouse is under anesthesia, use a vet-approved eye ointment.",
    "PT intravenous injection in the lateral caudal vein: plug the tail of the mouse gently with an ethanol solution, which acts as a vasodilator, to display the veins. Focus on one of the two lateral veins of the tail, and, using a 0.5 mL syringe fitted with a 30 G needle, inject 500 ng of PT (i.e., 100 µL of PT diluted in physiological solution at the concentration of 5 µg/mL).\nSubcutaneous injection of MOG35-55 emulsion: using the 1 mL syringe with a 26 G needle, perform three subcutaneous injections of the previously prepared emulsion: two under the rostral part of the flanks and one at the base of the tail. The volume of emulsion injected in each site is 100 µL, for a total volume of 300 µL of emulsion injected in each mouse.\n\t\t​NOTE: The day of immunization is recorded as day 0 post immunization (dpi); 48 h later (i.e., at 2 dpi), it is necessary to perform another intravenous injection of PT equal to the one previously performed. It is possible to perform the injection without anesthesia, using a mouse restrainer. The procedure described here aims to induce and maintain anesthetizing of the mice during the immunization procedure to avoid possible discomfort and movements of the animals or risks for both mice and investigators. Thus, there are no surgical procedures. However, to optimize the experimental processes, it is important to maintain appropriate sterile conditions during these steps and to monitor the mouse's condition after these procedures.\nTo verify the mouse has recovered from the injections, place it in a clean cage after the procedures and wait until it has regained sufficient consciousness to maintain sternal recumbency. After the mouse has fully recovered, return it to the home cage with other animals.\n3. EAE follow-up",
    "Body weight and food intake\nMonitor daily the body weight (BW) of the animals, using an electronic precision balance, because the decrease in BW is an indicator of disease progression.\n\t\tNOTE: This decrease should not exceed a certain percentage, according to the institutional and ethical committee's guidelines for animal care. Usually, if an animal loses more than 20% of the initial body weight (i.e., the weight recorded at 0 dpi), it should be sacrificed as the application of the humane endpoint. The euthanasia methods involve deep irreversible anesthesia for inhalation (e.g., 5% isoflurane) followed by decapitation.\nMonitor the food intake (FI)-the food eaten by an animal in a day (g∙day-1∙animal-1), weighing the amount of food in the specific container at least once a week, and dividing the amount of eaten food for the days passed between two sequential measurements and the number of animals present in the cage.\n\t\t​NOTE: This measurement allows the estimation of mean food intake. Because of the appearance and accumulation of clinical disease signs, which involve the paralysis of the limbs, we suggest placing some watered food on the floor of the cage when the animals are not capable of standing firmly on their hind limbs and reaching the food container or the water bottle. To assess the food intake through the follow-up period as precisely as possible, we also measured the dry weight of this food before wetting it for the mice.\nEvaluation of estrous cyclicity during EAE\nCheck the estrous cycle for at least two cycles, evaluating the vaginal cytology smears as described by McLean et al.24. Classify the phase of the estrous cycle based on the presence of three primary cell types-nucleated epithelial cells, cornified squamous epithelial cells, and leukocytes-in the vaginal smear samples, as follows:",
    "Classify as proestrus based on an almost exclusive presence of clusters of round, well-formed nucleated epithelial cells.\nClassify as estrus based on the predominant presence of densely packed clusters of cornified squamous epithelial cells.\nClassify as metestrus based on the predominant presence of small darkly stained leukocytes and the minor presence of cornified squamous epithelial cells.\nClassify as diestrus based on the highly predominant presence of small darkly stained leukocytes and rare cornified squamous epithelial cells along with the possible appearance of nucleated epithelial cells.\n\t\t\tNOTE: When evaluating the disease in both sexes, it is important to check the variability in females due to the estrous cycle. We suggest focusing on the evaluation of the estrous cycle, especially between the first and the second-week post immunization (i.e., during the acute phase of the EAE). It has been previously shown that the immunization procedure causes the most pronounced alterations of the estrous cycle within this phase25. Moreover, it is important to consider that performing the smear when the animal reaches a high clinical score (especially >3) is difficult due to the posterior paresis and the lack of tone in the hindlimbs.\nClinical score\nHave a blinded investigator assess the clinical score of the animals daily. Assign to each animal a score rated from 0 to 5 (see Table 2) to evaluate the disease course26 as described by Racke7.\n\t\tNOTE: Similar to the body weight decrease, a humane endpoint is also necessary for the increase in clinical scores, according to the institutional and ethical committee's guidelines for animal care. Generally, if an animal is no longer able to feed itself autonomously (this usually occurs when an animal reaches at least the score of 4, according to the scale we use), it should be sacrificed as the application of the humane endpoint.",
    "Motor performance evaluation by rotarod test\n\tNOTE: Evaluation of the EAE progression is usually performed by assigning the clinical score daily, which is done by a fully trained blinded investigator. However, it could be useful to flank it with a more quantitative and objective evaluation of the disease's progression. In a previous study26, the rotarod test was used to measure the motor performance of the immunized animals. As described by van den Berg et al.27, to have a more quantitative and precise clinical evaluation of the disease course, the evaluation of the motor performance by the rotarod test can support the clinical score assessment. For a detailed description, see van den Berg et al.27.\n\t\nLet the mice undergo rotarod sessions daily, starting from 1 dpi until the sacrifice (i.e., 28 dpi). Each session consists of a single 300 s session during which the rod speed has to be increased linearly from 4 to 40 rpm.\nRegister the animal's score. When the mouse is not capable of maintaining its balance and falls off the device, it falls on the ground and triggers a sensor, and the time (s) is recorded. Thus, the performance is scored as latency to fall (s).\ntable:\n﻿0,1,2,3,4,5\nGrade,Clinical sign,Clinical sign,Description,Description,Description\n0,Healthy,Healthy,No observed clinical sign. The animal shows a normal tone and moving of the tail. It walks without tripping.,No observed clinical sign. The animal shows a normal tone and moving of the tail. It walks without tripping.,No observed clinical sign. The animal shows a normal tone and moving of the tail. It walks without tripping.\n0.5,Impaired gate,Impaired gate,The animal trips while walking on a grill.,The animal trips while walking on a grill.,The animal trips while walking on a grill.",
    "1,Limp tail,Limp tail,\"When the animal is picked up by the basis of the tail, the tail droops (flabby tail).\",\"When the animal is picked up by the basis of the tail, the tail droops (flabby tail).\",\"When the animal is picked up by the basis of the tail, the tail droops (flabby tail).\"\n1.5,Limp tail and impaired gate,Limp tail and impaired gate,\"The animal shows a flabby tail, and it trips while walking on a grill.\",\"The animal shows a flabby tail, and it trips while walking on a grill.\",\"The animal shows a flabby tail, and it trips while walking on a grill.\"\n2,Ataxia,Ataxia,The animal displays difficulties in standing up once it has been turned on its back.,The animal displays difficulties in standing up once it has been turned on its back.,The animal displays difficulties in standing up once it has been turned on its back.\n2.5,Ataxia and paresis of hindlimb,Ataxia and paresis of hindlimb,\"The animal displays cannot stand up once it has been turned on its back, and it loses the tone of one of its hindlimbs.\",\"The animal displays cannot stand up once it has been turned on its back, and it loses the tone of one of its hindlimbs.\",\"The animal displays cannot stand up once it has been turned on its back, and it loses the tone of one of its hindlimbs.\"\n3,Paralysis of hindlimbs,Paralysis of hindlimbs,The animal loses the tone of both hindlimbs.,The animal loses the tone of both hindlimbs.,The animal loses the tone of both hindlimbs.",
    "3.5,Paralysis of hindlimbs and/or paresis of forelimb,Paralysis of hindlimbs and/or paresis of forelimb,\"The animal loses the tone of both hindlimbs and partially of forelimbs. In fact, it shows a loss of strength in the forelimbs’ grasp.\",\"The animal loses the tone of both hindlimbs and partially of forelimbs. In fact, it shows a loss of strength in the forelimbs’ grasp.\",\"The animal loses the tone of both hindlimbs and partially of forelimbs. In fact, it shows a loss of strength in the forelimbs’ grasp.\"\n4,Tetra paresis,Tetra paresis,The animal completely loses the tone of its limbs.,The animal completely loses the tone of its limbs.,The animal completely loses the tone of its limbs.\n4.5,Tetra paresis and decreased body temperature,Tetra paresis and decreased body temperature,\"The animal completely loses the tone of its limbs, and it shows a decrease in body temperature (it is cold).\",\"The animal completely loses the tone of its limbs, and it shows a decrease in body temperature (it is cold).\",\"The animal completely loses the tone of its limbs, and it shows a decrease in body temperature (it is cold).\"\n5,Dying or dead,Dying or dead,The animal is dying (it does not respond to any stimulus) or dead.,The animal is dying (it does not respond to any stimulus) or dead.,The animal is dying (it does not respond to any stimulus) or dead.\nTable 2: Clinical scoring system used to assess EAE progression.\n4. Evaluation of EAE-induced histopathological signs at the spinal cord level\nNOTE: Here, we briefly report the procedure to sacrifice the animals and collect the spinal cords to perform histopathological analysis; for a detailed description, see these references10,26,28,29.\nFixation and tissue sampling\n\tNOTE: For a detailed description, see these references10,26.\n\t\nSacrifice the animals at 28 dpi during the chronic phase of the disease.",
    "Anesthetize the mice by deep irreversible anesthesia (intraperitoneal injection of Zolazepam and Tiletamine 80 mg/kg / Xylazine 10 mg/kg).\nTranscardially perfuse the mice with a saline solution followed by a 4% paraformaldehyde (PFA) solution.\n\t\t\tNOTE: Pay attention while using PFA: as it is toxic, avoid inhalation, ingestion, and contact with skin and eyes using proper personal protective equipment. Weigh the powder, prepare the solution, and perform the perfusion under the hood.\nRemove the spinal cords from the spinal column30.\nStore the spinal cords in a 4% PFA solution for 24 h.\nPerform several washes in 0.01 M saline phosphate buffer (PBS).\nEmbed the spinal cords in paraffin blocks30.\nHistological procedures\n\tNOTE: For a detailed description, see Montarolo et al.10.\n\t\nUse a microtome to cut 10 µm thick transverse spinal cord sections and collect them on gelatin-coated slides. Orient the plane of sectioning to match the drawings corresponding to the transverse sections of the mouse spinal cord atlas31.\nPerform the deparaffinization of the sections32.\nStain the section with Hematoxylin and Eosin32.\nDehydrate the sections32.\nCover the sections with a mounting medium and let them dry at room temperature under a chemical hood.\n\t\tNOTE: Hematoxylin-Eosin staining allows for the detection of the presence of the perivascular inflammatory infiltrates (PvIIs)26, which is assessed as a sign of the disease28.\nQuantitative analysis of spinal cord sections\nAcquire images of the stained sections with an optical microscope connected to a digital camera with a 20x objective29.\nAnalyze the acquired image to obtain the number of PvIIs, expressed as the number of infiltrates per mm2.",
    "NOTE: For the analysis of the acquired images, it is useful to take advantage of image analysis software. Neuropathological findings presented in this work are quantified in 10 complete cross-sections of the spinal cord per mouse (n = 8/group) representative of whole spinal cord levels.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}