{
  "id": 8242,
  "origin_website": "Bio",
  "title": "<em>In vitro</em> T Cell–DC and T Cell–T Cell Clustering Assays",
  "procedures": [
    "T-APC conjugation assay Notes:    This protocol uses purified OT-I CD8+ T-cells from naive mice, which are transgenic for a TCR recognizing the chicken egg OVA–derived SIINFEKL peptide (SL8) in the context of the MHC class I molecule H2-kb. The same protocol can be used with T cells specific for other antigens. BMDCs (Bone-Marrow derived Dendritic Cells) are used as APCs, but DCs from other origin, or many cell lines, can be used as APCs.   Once cells are labeled, they should stay protected from light as much as possible.       Cell labelling: resuspend BMDCs and purified naive OT-I cells in PBS at a concentration of 10 x 106 cells/ml (usually 20 x 106 cells in 2 ml). Add DDAO at a final concentration of 4 μM on BMDCs, and CFSE at a final concentration of 1 μM on OT-I cells. Incubate for 30 min at 37 °C 5% CO2. Note: CFSE and DDAO can be substituted for other dyes. The advantage using those 2 dyes is that little to no compensation on the flow cytometer is needed.   Wash cells three times with 5 volumes of media (10 ml if you start with 20 x 106 cells) by centrifuging at 300 x g for 5 min at room temperature.   Pulse APCs: resuspend BMDCs in media at a concentration of 10 x 106 cells/ml. Add SL8 at a final concentration ranging from 0-1,000 ng/ml (usually 5 different concentrations are used) and incubate for 60 min at 37 °C 5% CO2.   While APCs are antigen pulsing, resuspend OT-I cells at 4 x 106 cells/ml in media (usually 20 x 106 cells in 5 ml). Add 50 μl of OT-I cells per FACS tube. Leave cells at 37 °C 5% CO2 until APCs are ready.",
    "Wash BMDCs three times with 5 volumes of media by centrifuging at 300 x g for 5 min at room temperature.   Resuspend BMDCs at 4 x 106 cells/ml in media.   Add 50 μl of BMDCs to each FACS tube containing OT-I cells. Immediately spin at 228 x g (1,000 rpm) for 1 min at 20 °C. Immediately place at 37 °C.  Note: In this protocol, the ratio T cell-APC is 1, but you can make it vary. Time of incubation is usually between 0-60 min (0-10-20-30-60 min).   Fix the cells: Once the desired amount of time is completed, add 100 μl per sample of warm (20 °C) 2% PFA. Mix very gently, either by pipetting up and down or quickly vortexing on low. Incubate at room temperature (around 20 °C) for 10 min.   Run on flow cytometer. Assess the percentage of coupling based on double CFSE/DDAO positives (Figure 1).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20131016/20131016193215_9865.jpg Figure 1. T-APC coupling assay-Example. CFSE-labeled OT-I cells are incubated for 30 min at 37 °C with DDAO-labeled BMDCs that were pulsed with 0 (left plot) or 100 ng/ml (right plot) SL8 peptide. Cells debris were first excluded using a SSC/FSC gate (upper panel). Coupled cells are DDAO+ and CFSE+.      T-T clustering assay Notes:    In this protocol, T cells are activated with PMA and Ionomycin, which by-pass the need for an APC and every T cell could be activated this way. However, the same protocol can be used with T cells activated with an APC, anti-CD3 and anti-CD28, etc...   This protocol compares, as an example, the capacity of OT-I cells deficient for the integrin ICAM-1 to form homotypic interactions compared to control OT-I cells.",
    "But the same protocol can be used to investigate the kinetic of T cell clustering, blocking antibodies, etc…      Cell labelling: resuspend purified OT-I cells in PBS at a concentration of 10 x 106 cells/ml (usually 20 x 106 cells in 2 ml). Add CFSE at a final concentration of 1 μM on Control cells, and CMTMR at a final concentration of 4 μM on ICAM-1-/- cells. Incubate for 30 min at 37 °C 5% CO2.   Wash cells three times with 5 volumes of media by centrifuging at 300 x g for 5 min at room temperature.   T cell activation: Resuspend OT-I cells in media at a concentration of 2 x 106 cells/ml. WT and ICAM-1-/- cells are mixed at a ratio 1 and then activate cells by adding 5 ng/ml PMA and 50 ng/ml ionomycin directly in the media. Plate 2 ml cell suspension per well of a 24 well plate.   16 to 24 h after activation, percentage of cells in clustered is analyzed by flow cytometry (step B5) or microscopy (step B6).   Analysis by flow cytometry: Cells are fixed by adding the same volume of 2% PFA for 10 min at 20 °C. Fixed cells are run through a 40 μm strainer into a FACS tube. Cells that went through represent the “non-clustered” fraction. Cells retained on the strainer are washed with 1 ml of PBS 2 mM EDTA (to disrupt cell clusters) and represent the “clustered” fraction. Both fractions are run on flow cytometer (Figure 2).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20131016/20131016194117_7442.jpg Figure 2. T-T clustering assay–Analysis by flow cytometry. CFSE-labeled WT OT-I cells and CMTMR-labeled ICAM-1-/- OT-I cells were ad-mixed and stimulated with PMA and Ionomycin. 24 h after activation, clustered cells were separated from non-clustered cells through a 40 μm strainer and both fractions were analyzed by flow cytometry.",
    "Cell debris was first excluded using a SSC/FSC gate (upper panel). Clustered cells – left panel; non-clustered cells – right panel.  Note that ICAM-1 deficient cells are mainly found in the non-clustered cell fraction compared to WT cells.  Note: Cut the tip of your pipet tip to ensure that cell clusters are not disrupted by pipetting when applying the cell suspension on the strainer.  In vitro activated T cells usually form clusters that are bigger than 40 μm diameter and therefore should be retained on the strainer. However, cells that are going through the strainer can potentially be part of smaller clusters. It is therefore useful to compare the flow cytometry data with microscopy quantification.     Analysis by microscopy: Cells (usually 300 μl of cell suspension) are transferred onto a poly-L-Lysine-coated chamber and incubated for 10 min at 37 °C 5% CO2. Media is then carefully removed and replaced by 200 μl of 2% PFA. After 10 min, PFA is carefully removed, and replaced by 200 μl of PBS. Remove the PBS and let dry for 2 min. Remove the chamber gasket and mount with a drop of Vectashield on a coverslip. Analyze with epifluorescent microscope. Note: Cut the tip of your pipet tip to ensure that cell clusters are not disrupted by pipetting when applying the cell suspension on the chamber."
  ],
  "subjectAreas": [
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}