{
  "id": 15288,
  "origin_website": "Jove",
  "title": "An In-House-Built and Light-Emitting-Diode-Based Photodynamic Therapy Device for Enhancing Verteporfin Cytotoxicity in a 2D Cell Culture Model",
  "procedures": [
    "NOTE: See the Table of Materials for details related to all materials, reagents, and software used in this protocol.\n1. Device construction\nSaw 3 mm thickn medium-density fiberboards (MDF) to obtain pieces with the dimensions shown in Figure 1A.\n\tNOTE: Use the vector file (Supplemental File 1) for computer numerical control (CNC) cutting.\nBuild two boxes with the following dimensions (length x width x height ): 330 mm x 235 mm x 225 mm for the bigger boxes, and 300 mm x 220 mm x 150 m for the smaller boxes (Figure 1B).\nDrill the back of the bigger box to install a barrel jack connector. Drill the top of the bigger box andk the top and bottom of the smaller box to provide a passage for electric cables (Figure 1C).\nPaint all the internal surfaces with black ink to promote homogeneous light incidence (Figure 1D).\nAttach, in parallel, three LED tapes with 10 LEDs each at the upper interior surface of the smaller box (Figure 1E).\nInstall a brightness sensor at the center of the bottom interior surface of the smaller box (Figure 1F).\nPrint the structure of the control unit (Figure 1G) using the 3D printing file (Supplemental File 2).\nInstall all the components (power button, potentiometers, time/start touchpad, LEDs, brightness sensor, LCD, buzzer, and power supply) at the ports of an ESP32 control board mounted at the control unit interior (Figure 2).\nUpload the programming code (Supplemental File 3, Supplemental File 4, and Supplemental File 5) and run a test to check that all the connections are working (Figure 1H).\nAssemble the boxes and fix them together to avoid gaps, and consequently external light interference and emitted light loss. Attach the mounted control unit to the drilled area at the top of the prototype (Figure 1I).",
    "Fix a front door of the same material and 330 mm x 225 mm (length x width) dimensions on the bigger box with two small hinges. Also, attach velcro tapes sideways to the bigger box to reinforce the prototype closure (Figure 1J). Install a handle to manipulate the front door of the equipment.\nAttach four rubber foot pads at the bottom of the prototype to ensure more stability during the operations (Figure 1K).\n2. Cell lines: cultivation, seeding, and treatment\nChemicals\n\t\nDissolve the porphyrin in dimethyl sulfoxide (DMSO) to achieve a concentration of 100 mM.\n\t\tCAUTION: DMSO must be manipulated carefully (handling with the use of personal protective equipment and in a ventilated area). Manipulate both stock and diluted solutions carefully to avoid excessive light exposure.\nCell lines\n\t\nCultivate the HeLa cell line in Dulbecco's Modified Eagle's Medium (DMEM) low-glucose medium supplemented with 10% fetal bovine serum and 1% gentamicin.\nKeep the culture flasks in a 5% CO2 cell culture incubator at 37 °C.\nManage and inspect the cells until they reach 80%-90% confluence.\nSeeding process\n\t\nRemove the culture medium from the flask.\nWash the cell monolayer with PBS.\nDetach the confluent cell culture with trypsin-EDTA (0.5%) 1x for 5 min at 37 °C. Stop the action of trypsin by resuspending the cells with culture medium supplemented with 10% fetal bovine serum and 1% gentamicin.\nCount the resuspended cells with a hemocytometer and seed them into a 96-well plate at 2.0 × 104 cells/well.\nPrepare two plates for dark and light conditions.\nIncubate the plates for 24 h for cell attachment.\nTreatment process\n\t\nRemove the medium from both 96-well plates.\nTreat the cells with 100 µL of increasing concentrations of verteporfin (0.045 to 24 µM, serial dilution).\nIncubate the cells with drug treatment for 24 h to allow verteporfin internalization.",
    "After 24 h, discard the medium containing the drug, wash the monolayer of cells with PBS (100 µL), and add drug-free medium (100 µL).\nCover one microplate with aluminum foil to protect it from light exposure and incubate it for 24 h. This plate will provide control data for PDT results (dark condition). The other microplate will be utilized on the light exposure condition in the device.\n3. Device operation\nPlug the PDT device into the electrical outlet and turn it on by pressing the power button.\nPlace the other microplate (light condition) into the PDT device and close the equipment by fastening the front door with the velcro tapes.\nUse the potentiometers to adjust the RGB configuration (a RGB 255, 255, 255 experiment here) and set the color of light emission.\n\tNOTE: Each RGB combination has a specific emission spectrum, which must be adjusted for experiments with different photosensitizers and, consequently, different absorbance curves.\nPress the (+)/(-) touchpad to adjust the time configuration (a 60 min experiment here) and set the duration of the assay.\n\tNOTE: The time configuration, in association with the irradiance value, will determine the fluence of the process-the light dose applied in the assay.\nCheck the setup information at the display.\nPress the Start button to initiate the assay. Ensure that a one-beep buzzer is heard at the beginning of the assay.\nIn the course of the experiment, observe real-time information on the display, such as irradiance and time left.\nDo not open the front door or change any configuration during the PDT assay.\nAt the end of the assay, wait for a four-beep buzzer and for the electronic system to turn all the LEDs off. Observe a Finished message and the final amount of energy expended-fluence-during the experiment in the display.",
    "NOTE: The fluence final value is calculated using equation (1):\nimgsrc://cloudfront.jove.com/files/ftp_upload/64391/64391eq01.jpg (1)\n\tWhere F equals to J/cm2 and I equals to mW/cm2 or mJ/s·cm2. The irradiance value considers the potency of the LEDs (emitting source) and the uniformly irradiated area of the dark chamber (660 cm2) (equation [2]):\nimgsrc://cloudfront.jove.com/files/ftp_upload/64391/64391eq02.jpg (2)\n\tThe theorical irradiance value is shown on the device display throughout the entire PDT assay. At the end of the operation, use equation (3) to calculate the fluence:\nFluence (F) = irradiance (I, constant value) × operation time (s) (3)\n4. Cell viability assay\nAfter the PDT assay, cover the microplate that was exposed to light and incubate for 24 h.\nAfter the incubation period, remove the culture medium from both plates, wash the monolayer of cells with PBS (100 µL), and add MTT solution (0.5 mg/ml, 100 µL). Incubate both plates-dark and light conditions-for 4 h to allow formazan crystal formation.\nRemove the MTT solution carefully and dissolve the purple crystals with a DMSO/ethanol (1:1) solution.\nAfter complete dissolution of the crystals, carry out the absorbance measurement using a microplate reader at 595 nm.\n\tNOTE: The device can be used in other important experiments such as ROS-mediated cell death triggered by photosensitizers after light exposure by flow cytometry30.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}