{
  "id": 18950,
  "origin_website": "Jove",
  "title": "Permanent Cerebral Vessel Occlusion via Double Ligature and Transection",
  "procedures": [
    "1. Getting Started: Required Surgical Instruments\nSee Figure 4\nDental drill (Kavo Dental Equipment, Model: UMXL-TM), 2-bit drill, and 3-bit drill\nTwo ~30 gauge hypodermic needles\nSerrated tweezers, curved tip optional (can be helpful but not essential)\nTwo fine tip tweezers\nwire cutters\nSuture thread\nMicro scissors\n2. Creating the Surgical Window\nAnesthesia: Procedures are in compliance with NIH guidelines and have been approved by UC Irvine Animal Care and Use Committee. Experimental subjects are 295-400 g male Sprague Dawley rats (Charles River Laboratories, Wilmington, MA, USA) and the following anesthesia procedure should be used:\n\t\nInject rat intraperitoneally with a sodium pentobarbital bolus (55 mg/kg b.w.) followed by an intramuscular injection of atropine (0.05 mg/kg, b.w.) in the hind leg, and administered 3.0 cc of 5% dextrose in water subcutaneously.\nSupplement sodium pentobarbital (27.5 mg/kg, b.w.) injections as necessary. Administer an ophthalmic antibiotic ointment to the eyes to protect the corneas during the following procedures. Administer 5% dextrose (3 ml) and atropine (0.05 mg/kg, b.w.) every six hours decrease respiratory secretions during anesthesia.  Measure body temperature via a rectal probe, and maintain body temperature at 37 °C by a self-regulating thermal blanket.\nLocate the MCA by either:",
    "Thinning a 2 x 2 mm imaging/visualizing window over the somatosensory cortex using a size HP 3 drill bit until the skull is nearly transparent and then thinning to full transparency using a size HP 2 drill bit.  MCA's location can then be seen through this window and its proximal trajectory used to approximate the location of the initial segment. MCA will generally run diagonally across this window in a rostral to caudal/ventral to dorsal direction (for example, left to right/bottom to top when viewing left hemisphere from surgeon's point of view). The surgical window can then be created above where the observer estimates the M1 segment (proximal to cortical branching) to be located based on the distal branches visible through the first window. In order to minimize the amount of skull that is removed in order to gain access to MCA, the imaging/visualizing window should be positioned close to, but separate from the surgical window.\n\t\tOr\nA small surgical window should be positioned approximately 3 mm anterior and 1 mm lateral to the foramen ovale or the mandibular nerve, close to the arch rostrum 30,33,34. In order to effectively access the stem of the MCA (also known as the M1 segment), the temporalis muscle is temporarily reflected away from the skull surface. (Note: In the case of long-term survival surgeries, our lab's experience has been that by allowing the temporalis muscle to remain attached at its anchor, the muscle will re-anneal to the skull surface, allowing for healthy eating behavior and effective maintenance of body weight.\nFollow MCA to the rostral, ventral corner of the imaging window (if using this as a reference) in order to estimate where its initial cortical branch lies.",
    "Create a new thin-skull region (we refer to this as the surgical window) slightly rostral and ventral to the imaging window (if using this as a reference) where the M1 segment (pre-cortical branching) of MCA should be. IMPORTANT NOTE: Leave approximately a 2 mm gap between the imaging window (if using this as a reference) and the surgical window.\nLocate the stem of the MCA (also known as the M1 segment) just before cortical branching of the artery as shown in Figures 1A and 1B.\nUsing a size HP-3 drill bit, thin the skull above the estimated M1 segment location. When the skull becomes somewhat transparent, switch to the more delicate size HP-2 drill bit and thin the skull until it is completely transparent. Confirm visually as surgical window area becomes thin enough to view vasculature, and assess the location of M1 at this point and complete the window such that there is 2-3 mm on either side of the length of the M1 segment (this allows room for insertion and exit of the suture needle on either side of MCA).\nIMPORTANT NOTE: Stop thinning when the thickness of the skull is similar to that of plastic wrap. The vessel will rupture if the drill breaks through the skull and dura. If the skull is not thin enough on the other hand, removing it for the occlusion will be difficult and could result in damage to the cortex or artery.\nTake a 30 gauge (30 G) hypodermic needle and bend the tip of the needle, using serrated tweezers.\nUse the 30 G needle to puncture the skull carefully in an area not directly above an artery. Use this puncture hole to allow tweezers to grasp skull and carefully remove the thinned area of the surgical window.",
    "Take a new 30 G need, bend its tip as in Step 6, and carefully remove the dura.\nNOTE: Cutting the dura will cause it to peel back and MCA will become more prominent, as a result of reduced pressure.\n3. Occluding the MCA\nUse wire cutters to trim a half-curve reverse cutting suture needle (round 3/8, 16 mm suture needle) down to about 3-5 mm.\nThread the trimmed suture needle as shown in the picture in Figure 4E. IMPORTANT NOTE: It is important that the needle is threaded so both ends of the suture thread are of equivalent length. This enables the pulling of both thread ends under M1 at the same time, the needle can then be cut free leaving two lengths of thread to tie the two knots around MCA.\nUse the serrated the tweezers slip the suture needle under M1. Insert with about 0.5-1 mm distance from MCA, staying as shallow as possible so as to minimize damage to the cortex but avoiding too much strain on MCA as well.\nWhen the suture needle comes out the other side such that it is under MCA, use a fine tip tweezer (as shown below) to pull the tip of the suture needle from the opposite side while continuing to feed or pushing the other end of the suture needle with the serrated tip tweezers.\nOnce the suture needle is completely passed under MCA and has been pulled out, continue to pull on the suture needle or thread until the length of the thread is equal on either side of MCA. Pressing down on the thread as it is fed through to minimize strain on MCA can be helpful to prevent rupture as the thread passes under the artery.\nCut the thread close to the suture needle.",
    "Use both fine point tweezers to untangle the two resulting suture threads so that there are two independent threads strung under MCA that are not touching. Ideally the threads will be about 1 mm apart where they pass under MCA.\nUse both fine point tweezers to tie two separate knots (two ligatures) with the threads around MCA attempting to maintain that ~1 mm of space between the knots to allow room for transection.\nNOTE:  If an internal sham control is desired, prepare the occlusion leaving the occlusion knots loose so that they do not constrict MCA at all and collect data prior to tightening the knots and cutting the vessel. Trim the thread to prevent it catching on anything prior to occlusion but leave enough thread to allow tightening of the knots later. This way, any baseline imaging or data collection can be performed with all of the same surgical invasion as the occlusion and the knots tightened at the appropriate time point with little delay.\nOnce the knots have been pulled tight, use the micro scissors to transect M1 in between the two knots.\nIn the case of long-term, survival studies:\n\t\nSuture incised scalp flap back in place with sterile surgical thread or secure the tissue using sterile wound clips.\nAdminister antibiotics locally to the wound area (such as bacitracin ointment) and systemically by prophylactic injection of ampicillin (150 mg/kg IM).\nWhile the subject is still anesthetized administer an ophthalmic antibiotic ointment to the eyes.\nAdminister supplemental atropine (0.05 mg/kg IM) to decrease respiratory secretions during anesthesia. \nInject flunixin meglumine (1.1 mg/kg) subcutaneously at the conclusion of surgery and again the following morning (~12 hr later) for pain control.",
    "Place the animal on a dry, warm, slanted surface such that the animals nose is above its tail on the incline (this facilitates breathing until the animal is awake).\nMonitor the animal until it is awake and moving safely on its own.\nOnce the animal is back in the vivarium, the animal's activity, appearance, vocalization, and feeding and drinking behavior should be monitored daily.\n4. Euthanasia\nAt the conclusion of each experiment, rats should be euthanized with sodium pentobarbital (2-3 ml, intraperitoneally).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}