{
  "id": 10583,
  "origin_website": "Jove",
  "title": "Engineering 'Golden' Fluorescence by Selective Pressure Incorporation of Non-canonical Amino Acids and Protein Analysis by Mass Spectrometry and Fluorescence",
  "procedures": [
    "1. Transformation of Trp-auxotrophic E. coli\nTransform chemically or electrocompetent cells (50 µL) of a Trp-auxotrophic E. coli strain, e.g. ATTC 49980 (WP2, mutant derived from E. coli strain B/R22), with 1 µL of a 1 ng/µL aqueous solution of the pQE-80L His6-ECFP plasmid using heat shock or electroporation, respectively. Please refer to the JoVE Science Education Database23,24 for details.\n\tNOTE: The expression vector pQE-80L His6-ECFP encodes an N-terminally 6x His-tagged ECFP21 driven by a bacterial T5 promoter with lac operator. It further carries an AmpR selection marker and a colE1 origin of replication (the pQE-80L vector backbone sequence can be found on: https://www.qiagen.com/mx/resources/resourcedetail?id=c3b71572-4d82-4671-a79b-96357fe926d1&lang=en&autoSuggest=true). The theoretical molecular weight of the His6-ECFG wild-type protein (after chromophore maturation25) is 28303.92 Da. The translated target protein sequence is as follows (His-tag underlined, vector-derived sequences in bold): MRGSHHHHHHGSMVSKGEELFTGVVPILVELDGDVNGHKFSVSGEGEGDATYGKLTLKFICTTGKLPVPWPTLVTTLTWGVQCFSRYPDHMK\n\tQHDFFKSAMPEGYVQERTIFFKDDGNYKTRAEVKFEGDTLVNRIELKGIDFKEDGNILGHKLEYNYISHNVYITADKQKNGIKANFKIRHNIEDGS\n\tVQLADHYQQNTPIGDGPVLLPDNHYLSTQSALSKDPNEKRDHMVLLEFVTAAGITLGMDELYK.\nPlate transformed cells on LB-agar plates (Table 1) supplemented with 10 g/L glucose, 100 µg/mL ampicillin and incubate the plates at 37 °C overnight.\n2. Recombinant Protein Expression\nOvernight culture of E. coli ATCC 49980 pQE-80L His6-ECFP\nPrepare 5 mL of LB medium (Table 1; supplemented with 10 g/L glucose, 100 µg/mL ampicillin) in a sterile 14 mL polystyrene culture tube for aerobic growth and inoculate with a singly colony from an agar plate using a sterile pipette tip or inoculation loop.\n\t\tNOTE: Using colonies from freshly transformed cells is recommended. The plates with bacterial colonies (from step 1.2.) can be stored at 4 °C for several days.\nIncubate the cells at 37 °C in an orbital shaker at 200-250 rpm overnight.\nExpression of wild-type ECFP",
    "Inoculate 10 mL fresh LB medium (Table 1; supplemented with 10 g/L glucose, 100 µg/mL ampicillin) with 100 µL of the overnight culture in a 100 mL Erlenmeyer flask. Incubate the flask at 37 °C in an orbital shaker at 200 rpm.\n\t\tNOTE: Optionally, this step can be performed in 10 mL NMM19 medium (Table 1) supplemented with 100 µg/L ampicillin and 0.5 mM L-tryptophan (alternatively, indole can be used).\nMeasure the optical density at 600 nm (OD600) every 20 min. Preferentially measure cell density by determining the extinction at 600 nm (OD600) in a spectrophotometer using a cuvette with a path length of 1 cm. Always perform a reference measurement using the corresponding culture medium. Dilute the samples and mix the samples well to obtain a measurement value of 0.1-0.8, then calculate OD600 using the dilution factor. For details, please refer to previous publication 26.\nUpon reaching an OD600 value of 0.5-0.8 (approximately 2-3 h after the inoculation), take sample \"before induction\" for SDS-PAGE (sodium dodecyl sulfate polyacrylamide gel electrophoresis, step 4).\nInduce target protein expression by adjusting the liquid culture to 0.5 mM IPTG (isopropyl β-D-1-thiogalactopyranoside, from 1 M stock solution) and incubate it at 30 °C in an orbital shaker at 200 rpm for 4-8 h.\n\t\tNOTE: Cyan fluorescent proteins are commonly expressed at temperatures below 37 °C27.\nTake sample \"after expression\" for SDS-PAGE (step 4.).\nHarvest the bacterial cells by centrifugation for 10 min at 5,000 x g and 4 °C.\nDiscard the supernatant by decanting and freeze the cell pellets at -20 °C or -80 °C until target protein purification.\nSPI for producing GdFP",
    "Inoculate 10 mL of NMM19 medium (Table 1) supplemented with 100 µg/mL ampicillin, 15 µM tryptophan and 10 µL of overnight culture in a 100 mL Erlenmeyer flask and incubate the culture flask overnight at 30 °C in an orbital shaker at 200 rpm.\n\t\tNOTE: A variety of chemically defined media for cultivation of E. coli and SPI is available. In addition to NMM used herein, MOPS medium28, glucose-mineral salts medium29, Davis minimal medium30, M9 minimal medium31, or GMML32 can be used.\nThe next day, measure OD600 every 30 min until the value only changes by less than 0.05 over 30 min. The plateau value should be approximately 1.\n\t\tNOTE: Deviations by ± 0.3 units are acceptable. Depending on the bacterial strain and medium used, the initial tryptophan concentration (step. 2.3.1) may need adjustment.\nTake sample \"before induction\" for SDS-PAGE (step 4.).\nHarvest the bacterial cells by centrifugation for 10 min at 5,000 x g and 4 °C. Discard the supernatant by decanting.\nResuspend the cells in 10 mL of NMM19 medium with 100 µg/mL ampicillin into a 100 mL Erlenmeyer flask and add 4-amino-indole to a final concentration of 1 mM using 50 mM stock solution. Continue the incubation for 30 min at 30 °C in an orbital shaker at 200 rpm.\n\t\tNOTE: This step is recommended because of the low chemical stability of ampicillin and ensures cellular uptake of 4-amino-indole.\nInduce target protein expression by adding IPTG to a final concentration of 0.5 mM using 1 M stock and incubate the sample overnight at 30 °C in an orbital shaker at 200 rpm.\n\t\tNOTE: Cyan fluorescent proteins are commonly expressed at temperatures below 37 °C27.\nThe next day, measure OD600.\nTake sample \"after expression\" for SDS-PAGE (step 4.).",
    "Harvest the bacterial cells by centrifugation for 10 min at 5,000 x g and 4 °C and discard supernatant by decanting.\nIn case such a vessel was not used for centrifugation, transfer the cell pellet into a 50 mL conical polystyrene tube using a spatula. Freeze the cell pellet at -20 °C or -80 °C until target protein purification.\n3. Target Protein Purification via Immobilized Metal Ion Affinity Chromatography (IMAC)\nBacterial cell lysis\nThaw the cell pellet on ice for 10-20 min.\nResuspend the cell pellet in a 50 mL conical polystyrene tube using 5 mL of ice-cold binding buffer (Table 1) on ice.\nAdd 20 µL of 50 mg/mL lysozyme, 20 µL of 1 mg/mL DNase I, and 20 µL of 1 mg/mL RNase A. Close the tube, mix gently by inverting 5 times, and keep it on ice for 30 min.\n\t\tNOTE: Partial cell disruption occurs as catalyzed by lysozyme.\nLyse the cells by sonification using an ultrasound homogenizer tip using three cycles of 3 min in a 15 mL polystyrene tube cooled by slush ice with 2 s of pulse, 4 s of pause and 45% amplitude.\n\t\tNOTE: Alternatively, high pressure homogenization can be used, e.g., 20 cycles at 14,000 psi. If necessary, dilute using binding buffer to reach the minimal instrument volume. Moreover, protein extraction reagents can be used for cell disruption. See Materials table for examples.\nCentrifuge the sample for 30 min at 15,000-18,000 x g, 4 °C.\nTransfer the supernatant into a fresh tube and note down the liquid volume.\nFilter the solution through a 0.45 µm syringe filter using a 5 mL plastic Luer lock syringe and a polyvinylidene fluoride (PVDF) syringe filter.\nTake sample \"lysate\" for SDS-PAGE (step 4.).\nResuspend cell debris pellet in ddH2O (equal volume as former lysate).",
    "Take sample \"pellet\" for SDS-PAGE (step 4.).\nIMAC purification\nUse a 1 mL prepacked or self-packed IMAC FPLC (fast protein liquid chromatography) column according to manufacturer’s instructions. Use binding buffer (Table 1) for column equilibration as well as for the wash step which follows after the cell lysate has been applied to the column.\nCollect and pool eluate fractions with GdFP which can be identified by visible light golden color.\n\t\tNOTE: Optionally, the target protein can be eluted using a linear imidazole gradient (0-250 mM) using an automated FPLC system.\nDetermine the protein concentration using the literature value for the extinction coefficient at 466 nm (ɛ466 nm = 23,700 M-1 cm-1)33 with elution buffer as reference. For details on the procedure, please refer to previous publication26.\nTake sample \"eluate\" for SDS-PAGE, and use 1-10 µg of protein per lane in case of Coomassie-staining.\n\t\tNOTE: SDS sample amounts can vary depending on the staining method and dye sensitivity.\nDialyze an aliquot of the eluate fractions against dialysis buffer or MS buffer using a membrane with a molecular weight cutoff (MWCO) of 5,000-10,000. Prepare dialysis membrane according to manufacturer's instructions. Dialyze a 1 mL sample three times against 100 mL buffer for at least 2 h. For details on this procedure, please refer to previous publication34.\nFor storage, freeze protein sample in dialysis buffer at -80 °C.\n\t\tNOTE: Aliquots should be stable for at least 6 months.\n4. SDS-PAGE Sample Preparation of E. coli Whole Cell Extract\nTransfer a cell suspension equivalent to 1 mL of OD600 = 1 suspension (e.g. 500 µL of OD600=2) into a 1.5 mL microcentrifuge tube.\nHarvest the cells by centrifugation for 10 min at 5000 x g, room temperature. Discard the supernatant by pipetting.",
    "Add 80 µL of ddH2O and 20 µL of 5x SDS loading dye buffer (Table 1) to the cell pellet and mix by pipetting.\nDenature the cells by heating to 95 °C for 5 min in a water bath or heat block. Subsequently, cool the samples to room temperature.\nUse 10 µL for Coomassie-stained SDS-PAGE according to previous publication35.\n\tNOTE: SDS sample amounts can vary depending on the staining method and dye sensitivity.\n5. Intact Protein Mass Analysis by High-performance Liquid Chromatography (HPLC) Coupled to Electrospray Ionization Time-of-flight Mass Spectrometry (LC-ESI-TOF-MS)\nNOTE: HPLC gradient, settings and buffers may vary depending on the separation column and instrument used. See Materials table for exemplary equipment.\nDetermine the protein concentration from a sample dialyzed against MS buffer as described above (step 3.2.3.) using MS buffer (see Materials table) as reference.\nDilute the protein sample to 0.1 mg/mL using MS buffer for a final volume of 80 µL, mix by careful pipetting, transfer the solution into a MS autosampler vial with glass insert and close it with a cap. Remove air bubbles by flicking the vial.\nFill a second autosampler vial without glass insert (buffer blank) with 1 mL of MS buffer.\nAllow the instrument to warm up. Perform instrument calibration. Make sure that sufficient amounts of liquid chromatography-grade solvents are available (>100 mL).\nProgram a linear 20 min HPLC gradient from 5% to 80% buffer A (0.1 % formic acid in ddH2O), combined with buffer B (0.1 % formic acid in acetonitrile).\nStart HPLC at a flow of 0.3 mL/min and wait until the column pressure is stable.\nSet an autosampler injection volume of 5 µL for the LC-ESI-TOF-MS method, create a worklist for a blank run followed by a sample run and assign the corresponding autosampler vial positions. Run the worklist.",
    "After worklist completion, open the generated sample data file. Select a range in the total ion current (TIC) plot for deconvolution and deconvolute the MS spectrum using the maximum entropy deconvolution algorithm.\n\tNOTE: Depending on experimental conditions, additional species can occur from non-matured FP or buffer ion adducts.\n6. Fluorescence Lifetime Measurements and Decay-associated Spectra (DAS) of GdFP\nNOTE: For the instrumentation of time-resolved fluorescence spectroscopy, please refer to Table of Materials for exemplary equipment. Absorbance as well as fluorescence excitation and emission spectra of fluorescent proteins can also be recorded using laboratory UV/Vis and fluorescence spectrophotometers.\nWavelength-resolved fluorescence lifetime measurement of GdFP\nPrepare 2 mL of a 1 µM solution of GdFP by dilution into PBS buffer (Table 1) at pH 7. Fill the solution into a 1 cm quartz cuvette.\nInstall ps-pulsed 470 nm laser for sample excitation and the 488 nm long-pass emission filter, and adjust 600 L/mm grating of the time- and wavelength-correlated single photon counting36 (TWCSPC) detector for acquisition of the wavelength regime 500-700 nm.\nAcquire fluorescence emission at a count rate of about 200 x 103 photons/s until about 103 counts are accumulated in the acquisition maximum of the fluorescence decay curves with single photon counting software.\nMeasurement of the instrumental response function37 (IRF)\nReplace the sample cuvette with a 1 cm quartz cuvette filled with 1 g/L colloidal silica (~220 m2/g) in PBS buffer at pH 7.\n\t\tNOTE: The silica suspension is prepared using a 400 g/L aqueous suspension.\nRemove 488 nm long-pass emission filter and insert grey filters to adjust the count rate at the TWCSPC detector to below 100 x 103 counts/s.\nAdjust grating for the acquisition of 470 nm photons in channel 8 of the 16-channel TWCSPC detector.",
    "Acquire the IRF until about 10 x 103 counts are accumulated in the emission maximum.\nConvert fluorescence decay curves and IRF to ASCII data files with global fitting38 program.\nConduct Global fit according to a model of a sum of three exponential components with lifetimes as linked parameters.\nPlot decay associated spectra (DAS) as amplitude distributions of individual decay components in dependency of the wavelength with data analysis software."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}