{
  "id": 18972,
  "origin_website": "Jove",
  "title": "Coculture Analysis of Extracellular Protein Interactions Affecting Insulin Secretion by Pancreatic Beta Cells",
  "procedures": [
    "1. Transfection of HEK293 Layer\nPrepare HEK293 cell medium by adding to 500 ml bottles of DMEM (with 4.5 g/ml glucose and phenol red and without glutamine): 50 ml FBS, 5 ml 100X penicillin/streptomycin solution, 5 ml 100x L-glutamine solution and 500 μl amphotericin B.\nPlate out HEK293 cells in a 24-well plate using 0.5 ml of HEK293 media per well. Ensure that the cells are spread evenly across the bottom of the plate.\nWhen HEK293 cells reach 100% confluency, transfect with 0.8 μg of plasmid coding the protein of interest (inserted in a mammalian expression vector) and 2 μl of Lipofectamine 2000 according to the Lipofectamine protocol. We have opted to use the pcDNA 3.3 backbone designed for expression in mammalian cells.\nOptionally, after 6 hr of incubation, exchange the transfection media described in the Lipofectamine protocol with normal HEK293 media.\nTo evaluate expression of the transfected protein, a subset of the transfected tissue culture wells can be used for immunofluorescent detection of the expressed protein or for western blot analysis of protein expression using standard techniques.\n2. Optional Fixation of HEK293 Cells Expressing Transfected Protein\nTransfected HEK293 cells can be gently fixed in order to facilitate coculture in media that might be harmful to living HEK293 cells (e.g. step 3.9 below) or to allow the efficient preparation in advance of plates for several experiments all at once (see also Discussion).\nConduct pilot studies to determine the time course of the expression of the protein in the HEK293 cells.\nAfter transfecting the HEK293 cell layer, aspirate the media from the cells at the post-transfection time point associated with highest level of expression. If this occurs within the first 24 hr, do not aspirate until 24 hr after transfection.",
    "Wash HEK293 cells gently with D-PBS then add 500 μl 4% paraformaldehyde (PFA) and incubate at RT for 30 min. (To make 4% PFA solution, start with 16% solution in 1X PBS and dilute 1:4 with 1X PBS.)\nUsing sterile PBS, gently wash the cells 3 times and incubate in PBS O/N at 4 °C.\nWash cells 3 times with sterile PBS, then add PBS and leave at 4 °C until needed (maximum storage time may vary depending on protein expressed. We store HEK293 cells transfected to express neuroligin isoforms for up to 2 weeks without significant changes in observed effects on insulin secretion).\n3. Co-culturing of INS-1 Beta Cells with HEK293 Cells\nPrepare INS-1 media by adding to 500 ml RPMI 1640 (with glucose and phenol red and without glutamine): 50 ml FBS, 5 ml 100X penicillin/streptomycin, 5 ml 100X L-glutamine solution, 5 ml sodium pyruvate, 500 μl amphotericin B, 500 μl beta-mercaptoethanol (this is nearly identical to the medium typically used for primary islet culture except for the addition of beta-mercaptoethanol).\nUsing Cell-stripper (or another non-enzymatic cell remover), harvest INS-1 cells at approximately 70-80% confluency off the bottom of a T75 culture flask. Each flask will provide roughly enough cells for 48 wells.\nAfter spinning down cells in the centrifuge for 3 min at 1,200 rpm, resuspend in a 50/50 mix of INS-1 and HEK media. For a 70-80% confluent flask of INS-1 cells, resuspend in approximately 25 ml of mixed media.\nIf using HEK293 cells that have been fixed in paraformaldehyde rather than live HEK293 cells, resuspend the INS-1 cells in 100% INS-1 media rather than mixed media.\nUsing a 10 ml pipette, dislodge the cells from the pellet to make a homogenous cell suspension.\nAspirate to remove the media on the HEK293 cells.",
    "Using a p1000 pipette, gently add 500 μl of INS-1 cell suspension onto the HEK cell layer along the sides of the well. After every 6 wells, use a 10 ml pipette to resuspend the INS-1 cells again to ensure a homogenous cell suspension. The overall scheme of the coculture set-up is depicted in Figure 1.\nIncubate the cells for 24-48 hr depending on the experimental protocol.\nIf more than 48 hr coculture period is required, use optional steps in section 2 above to fix the HEK293 cells.\nIf using primary dissociated rodent or human islets [e.g. see prior protocols in JoVE11-15], ensure that an appropriate media such as RPMI with 5 ml pen/strep, 5 ml L-Glut, 0.5 ml amphotericin-B is used instead of INS-1 media. Although one can use dissociated islet cells in a 24 well plate, in practice because of the large number of islets potentially needed, it is recommended that consideration be given to scaling down to a 48 well plate (necessitating fewer islet cells per well). On a 48 well plate, add approximately 100 islets worth of dissociated cells per plate to start. Depending on the efficacy of dissociation and the method used, fewer islets may be required.\n4. Glucose Stimulated Insulin Secretion\nPreincubate cells in 250 μl of 2.5 mM glucose in KRB (Krebs-Ringer bicarbonate buffer) for a minimum of 1 hr. To preincubate, remove coculture medium and immediately replace with KRB. This exchange should be done one well at a time to minimize exposure of INS-1 cells to environmental oxygen. Aspirate with one hand while pipetting the low (2.5 mM) glucose KRB with the other.\nExchange preincubation KRB to 250 μl of either 2.5 mM or 20 mM glucose in KRB buffer one well at a time.",
    "If appropriate for the specific experiment, additional secretagogues such as 100 μM IBMX may be added to produce a more robust stimulated insulin secretory response. Dissociated primary islet beta cells in particular are poorly responsive to increased glucose concentrations alone, so here especially addition of IBMX or other secretagogues should be considered16,17 .\nAfter 1 hr of incubation, transfer media to microfuge tubes and spin 1,500 x g for 5 min.\nRemove 200 μl of the supernatant and use this for analysis by insulin RIA or ELISA.\nTo prepare cell lysate, add 100 μl of RIPA cell lysis buffer (150 mM NaCl, 1.0% IGEPALCA-630 or Nonidet P-40, 0.5% sodium deoxycholate, 0.1% SDS, 50 mM Tris, pH 8.0) with protease inhibitors to the plate immediately after removing media and incubate at 4 °C for 20 min.\nSpin down lysate for 15 min at 10,000 x g and remove 50 μl of supernatant for analysis by insulin RIA or ELISA.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}