{
  "id": 12026,
  "origin_website": "Jove",
  "title": "Integration of Bioinformatics Approaches and Experimental Validations to Understand the Role of Notch Signaling in Ovarian Cancer",
  "procedures": [
    "1. Prediction of Clinical Outcomes from Genomic Profiles (PRECOG)\nNOTE: The PRECOG portal (precog.stanford.edu) accesses publicly available data from 165 cancer expression datasets, including gene expression levels and patient clinical outcomes17. It specifically provides the Meta‒Z analysis, which incorporates large datasets to provide Z‒scores of different genes in 39 cancer types to indicate patient overall survival. Poor and good survival rates are indicated by positive and negative Z‒score values, respectively.\nCreate an account with an academic affiliated email to access this database. Enter the email address and password associated with the account.\nClick on the View Details button located underneath the Meta-Z analysis heading.\nInput the gene of interest into the Search bar.\nUse the scroll bar located on the bottom of the screen to obtain the survival Z-score for the specific cancer type of interest.\n2. CSIOVDB\nNOTE: CSIOVDB (csibio.nus.edu.sg/CSIOVDB/CSIOVDB.html[href=http://csibio.nus.edu.sg/CSIOVDB/CSIOVDB.html]) is a microarray database developed by the Cancer Science Institute of Singapore to study ovarian cancer18. This database contains data of carcinomas from different tumor sites as well as normal ovary tissue data. In addition, CSIOVDB provides Kaplan‒Meier survival plots to assess patient survival with differential gene expression levels. CSIOVDB can be applied to investigate the association between gene expression levels and ovarian cancer stages/grades.\nInput gene of interest, then click the Search button.\nClick on the Disease State tab.\n\tNOTE: This tab provides summary statistics of gene expression of the target gene of interest in ovarian cancer disease states.\nClick on the Histology tab.\n\tNOTE: This tab provides summary statistics of gene expression of the target gene of interest in major ovarian cancer histologies.\nClick on the Clinico-pathological Parameters tab.\n\tNOTE: This tab provides a comparison of the gene expression levels among different ovarian cancer stages, grades, and clinical responses with Mann-Whitney tests.\nClick on the Survival tab.",
    "NOTE: This tab provides Kaplan-Meier plots associated with Overall Survival and Disease-Free Survival. For this database, disease-free survival is considered progression- and recurrence-free survival18. Multivariate analyses for Overall Survival and Disease-Free Survival are also found under this tab. The multivariate analyses compare features that relate to ovarian cancer prognoses (stage, grade, surgical debulking, histology, age) and the gene of interest.\nClick on the Subtype tab.\n\tNOTE: This tab provides summary statistics and Mann-Whitney tests for the expression level of the gene of interest in molecular subtypes of ovarian cancer. This tab also provides Kaplan-Meier plots associated with Overall Survival and Disease-Free Survival of the gene of interest in molecular subtypes of ovarian cancer.\n3. Gene Expression across Normal and Tumor tissue (GENT)\nNOTE: The GENT portal (medical‒genome.kribb.re.kr/GENT) is developed and maintained by the Korea Research Institute of Bioscience and Biotechnology (KRIBB)19. It collects 16,400 (U133A; 241 datasets) and 24,300 (U133plus2; 306 datasets) publicly available samples. After standardization, GENT offers gene expression data across diverse tissues, which are further divided into tumor and normal tissues.\nClick on the Search tab at the top of the screen.\nIn the section labeled 1. Keyword, select the Gene symbol for the Terms from the dropdown menu, input the gene symbol of the gene of interest in the blank area of the Keyword section, and select Tissue for the Type option.\nClick the Search button at the bottom of the 1. Keyword section. It shows the summary graphs of gene expression in normal and tumor tissues of different cancer types based on the U133A and U122Plus2 platforms.\n\tNOTE: It is optional to select the Data Filtering option on the top of the summary graph to single out a particular database to study.",
    "Click the link next to Result Data Download to access the detailed information about the gene expression values, tissue types, and data sources.\n4. Broad Institute Cancer Cell Line Encyclopedia (CCLE)\nNOTE: CCLE (portals.broadinstitute.org/ccle) was created by the Broad Institute and provides genomic profiles and mutations of 947 human cancer cell lines20.\nInput the desired genes into the search bar and then click the Search button.\nIn the section labeled Select Dataset, click the mRNA expression (RNAseq) option from the dropdown menu.\n\tNOTE: Other options include mRNA expression (Affy), Achilles shRNA knockdown, and Copy Number.\nClick on the Toggle All Traces button. Select the tissue type of interest from the gray box on the right. Scroll down to the bottom of the screen and click the Download mRNA expression button.\nOpen the downloaded text document. Copy and paste all the text into Sheet 1. Copy all the text in the Sheet 1.\nClick on the sheet in the spreadsheet software Sheet 2 tab on the bottom of the spreadsheet. Right click on the A column, select Paste Special, and then select the Transpose option in Sheet 2.\nOnce the text is transposed into two columns on Sheet 2, click the dropdown arrow for the Sort & Filter option heading and then select the Filter option. An arrow will appear in the heading area labeled Gene. Click on the arrow and type in the tissue type of interest.\n\tNOTE: This step will filter all the data and only display gene expression levels for the tissue type of interest.\n5. cBioPortal\nNOTE: cBioPortal (www.cioportal.org) was developed at the Memorial Sloan Kettering Cancer Center (MSK), and accesses, analyzes, and visualizes large scale cancer genomic data21,22. Specifically, this portal allows researchers to search for genetic alterations and signaling networks.",
    "Using the query on the landing page, click the organs/tissues of interest under the section labeled Select Studies. Select the particular study of interest, then hit the Query By Gene button.\nIn the section labeled Select Genomic Profiles, select from the three options: Mutations, Putative copy-number alterations from GISTIC, or mRNA Expression. Further select corresponding data from the dropdown menu for Select Patient/Case Set.\nEnter the target gene symbol(s) in the query box of Enter Genes. Click the Submit Query button.\nClick on the Network tab at the top of the page to retrieve the desired gene network.\n\tNOTE: The signaling network is color-coded. The inputted genes are indicated by seed nodes with a thick border. Each gene is represented by a red circle, and the color intensity of the red circle reflects its mutation frequency. Genes are connected by differently colored lines. Brown lines mean \"In Same Component\", indicating the involvement in the same biological component. Blue lines mean \"Reacts With\", indicating gene reactions. Green lines mean \"State Change\", suggesting that one gene might cause a state change of another gene.\nClick on the File tab at the top of the image to choose Save as Image (PNG) for network image downloading.\n6. Dissection of Drosophila with desired genotypes and DAPI staining\nNOTE: Collect the female Drosophila with the desired genotypes, then dissect the fly ovaries to undergo the procedures of DAPI staining for imaging.\nPrepare fly stocks tj-Gal4, Gal80ts/CyO; UAS-NICD-GFP/TM6B, w*; UAS-mam.A; and w[1118] to create flies with NICD-overexpression (tj-Gal4, Gal80ts/+; UAS-NICD-GFP/+) and NICD and mam-overexpression (tj-Gal4, Gal80ts/UAS-mam.A; UAS-NICD-GFP/+) capability.\nApply the temporal and regional gene expression targeting (TARGET) technique to control spatiotemporal gene expression23. Raise flies at 18 °C until adulthood, then shift to 29 °C for 48 h with yeast before dissection.",
    "NOTE: tj-Gal4 can only drive UAS expression under higher temperatures, when the inhibition by Gal80ts is relieved. The addition of yeast prior to dissection enlarges the ovaries for harvesting.\nPlace 3 mL of 1x phosphate-buffered saline (PBS) (137 mM NaCl, 2.7 mM KCl, 10 mM Na2HPO4, 1.8 mM KH2PO4) in an embryo collection dish. Use a CO2 pad to anesthetize the flies.\nChoose a female fly, then carefully grab the lower thorax of the fly using a pair of dissecting forceps and submerge it into the 1x PBS solution in an embryo collection dish. Use a second pair of forceps to pinch the lower abdomen and pull gently to release the internal organs.\nIdentify and detach the pair of ovaries from the fly body. Break the muscular sheath located at the posterior end of the ovaries and separate the ovarioles.\n\tNOTE: Separating the ovarioles and breaking the muscular sheath is required in order to achieve higher quality staining results.\nPlace the ovaries in a 1.5 mL centrifuge tube that contains 500 μL of 1x PBS. The tube should remain on ice until all ovaries are collected.\nRemove the 1x PBS and place 0.5 mL of fix solution (4% formaldehyde) into the tube. Place the tube on the nutator for 10 min.\nRemove the fix solution from the tube and dispose of it in a suitable waste container. Use 1 mL of 1x PBT (1x PBS supplemented with 0.4% Triton™ X-100) to wash the ovaries 3x for 15 min.\nDiscard the final PBT wash and add 1 mL of PBTG (0.2% bovine serum albumin, 5% normal goat serum in 1x PBT) to prevent nonspecific binding.\n\tNOTE: This step could be skipped for DAPI staining, but it is essential for antibody staining. Detailed immunohistochemistry staining can be found in Jia et al.24.",
    "Place 150 μL of DAPI (10 μg/mL) in the tube for 10−15 minutes nutation. Discard the DAPI and wash the ovaries 1x for 10 min using 1 mL of 1x PBT. Remove the PBT and wash 2x for 10 min using 1x PBS.\nRemove excess PBS until approximately 300 μL of PBS remains in the tube with the ovaries. Pipet the ovaries up and down several times using a 200 μL pipette, in order to free the egg chambers.\nGently spin down the tube and carefully remove as much 1x PBS solution as possible without removing the ovaries. Place 120 μL of mounting solution (1 g n-propyl gallate, 5 ml of 10X PBS, 40 ml of glycerol and 5 ml of dH2O) into the tube.\n\tNOTE: Mounting solution is sticky, so it is difficult to transfer exactly 120 μL of mounting solution into a tube. To alleviate this issue, a 1,000 μL pipette tip can be used to add three drops of mounting solution into the tube.\nRemove approximately 0.33 mm from a 200 μL pipette tip and use the newly cut pipette tip to place the mounting solution on a microscope glass slide.\nGently place the coverslip glass on the mounting solution and seal the edges of the cover slip with transparent nail polish.\n\tNOTE: Sealing the edges of the cover glass is needed to prevent the egg chambers from flowing inside of the mounting solution when taking confocal images.\nAcquire images with a confocal microscope using the following settings: objective lens = 10x magnification; numerical aperture = 0.8; DAPI emission wavelength = 410−513 nm.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}