{
  "id": 4371,
  "origin_website": "Bio",
  "title": "Isolation and 3-dimensional Culture of Primary Murine Intestinal Epithelial Cells",
  "procedures": [
    "Part I. Isolation  Before starting: put matrigel on ice in order to thaw it. Note: For the matrigel handling, please follow the manufacturer’s instructions.      Harvesting   The small intestine is harvested from a mouse.   The intestine is placed in a Petri dish containing ice-cold washing solution and then fat and the adjacent tissue are removed. Note: Both tissue and Washing solution should be stored on ice during the whole procedure.   The intestine is opened lengthwise and washed out from the luminal contents using washing solution.   The villi of an intestine are scraped off using a cover glass. Note: From this step the procedure should be continued under sterile conditions. To be on a safe side it is recommended to perform scraping on both sides of an intestine. Detached villi are seen as cloudy solution.   The intestine is washed with washing solution and then cut with sharp-point scissors into 2-4 mm pieces.   The material is transferred into a 50 ml falcon tube containing 10-20 ml of washing solution. Note: Tissue fragments might stick to the pipette. To avoid this, pre-wetting of the pipette is recommended.   The material is pipetted up and down a few times with a 10 ml pipette.   After sedimentation of tissue fragments, the supernatant is removed.      Washing   For the washing, 10-20 ml of washing solution is added. Then, tissue fragments are sedimented. After that, the supernatant is removed.   Step B1 is being repeated until the supernatant is clear (approximately 10 times).   25 ml of 2 mM EDTA is added to the tissue fragments.   The falcon tube that contains tissue fragments and EDTA is placed on a shaker and incubated for 15 min at 4 °C.    Tissue fragments are sedimented followed by the removal of the supernatant.   10-20 ml of washing solution is added. Then, tissue fragments are sedimented.",
    "After that, the supernatant is removed.   The Washing solution is added to the tissue fragments, pipetted up and down 3-5 times and passed through a 70 µm cell strainer.    The flow-through (I fraction) is stored on ice and will be further proceeded in step C3 of Elution. Note: Crypts are present in the supernatant and go through the pores of the cell strainer, whereas the tissue fragments stay on the top of the cell strainer.   Tissue fragments that remained on the cell strainer are proceeded further.   On a pipette tip the tissue fragments are transferred into a 50 ml falcon tube containing 25 ml of 2 mM EDTA.   The falcon tube is placed on a shaker and incubated for 30 min at 4 °C.      Elution   After tissue sedimentation, the supernatant is discarded.   Washing solution is added to the tissue fragments, gently pipetted up and down 3-5 times and passed through a 70 µm cell strainer (II fraction).  Note: This step is repeated; as a result fraction III will be collected (optional). Tissue fragments might stick to the pipette. To avoid that, pre-wetting of the pipette is recommended.   Crypts from certain fractions are observed under the microscope. Presence of finger-like structures (= crypts, see Figure 1) indicates a successful isolation.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140510/20140510091435_5195.jpg Figure 1. A representative of a freshly isolated crypt. Objective 10x, scale bar 100 µm    Crypts are spin down at 600 rpm for 5 min at 4 °C to remove single cells. A 24-well plate is pre-warmed by placing it into the cell culture incubator.   After centrifugation the supernatant is discarded.  Note: If the pellet is not visible, the centrifugation should be repeated.   The pellet is resuspended in 10 ml of ice-cold Basal Medium 2 (BM2; see Table 1). Crypts are counted under the microscope.  Table 1.",
    "Composition of BM2 (50 ml) table:",
    "﻿0,1\nComponent,Volume\n50x B27 100x N2 N-Acetyl-L-cysteine (500 mM),1 ml 0.5 ml 125 µl\nBM1 (see Table 2),To final volume of 50 ml",
    "Stored at 4 °C or -20 °C (avoid repeated freeze thaw cycles)    The crypts are centrifuged at 800 rpm for 5 min at 4 °C.    Crypt pellet is resuspended in matrigel:    Use 100-500 crypts per 50 µl of matrigel   Pipette gently, avoid bubbles     50 µl of matrigel is pipetted per well into the pre-warmed 24-well plate and then the plate is left for 2-3 min at room temperature. Note: Pipette matrigel exactly in the middle of the well, so that as a result matrigel drop is formed (see Figure 2).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140510/20140510092004_4617.jpg Figure 2. Scheme of the organoid culture    The plate is transferred into the cell culture incubator and incubated at 37 °C for 5-10 min (until the matrigel solidifies completely).    0.5 ml of crypt culture medium (CCM; see Table 3) is added per well.   The plate is transferred back to the cell culture incubator.       Part II. Culture   2-3 times per week the medium is removed and 0,5 ml/well of fresh medium (CCM, see Table 3) is added. When organoids are big (see Figure 3C), they should be passed. Usually the passage is performed once a week. Organoids should be splitted in 1:4 ratio.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140510/20140510092133_9746.jpg Figure 3. Isolated small intestinal crypts in 3D culture. A, B, C - 48 h/5 days/12 days in culture, respectively. A and B, passage 0. C, passage 1. Phase contrast, objective 10x, scale bars 100 µm  Passage procedure:    Medium is removed.   0.5 ml of ice-cold Basal medium 1 (see Table 1) well is added.   Plate is incubated on ice for at least 5 min. Note: Starting from this step organoids will be kept on ice for the whole time.   Organoids are pipetted up and down several times (1 ml pipette is used.).",
    "All organoids are transferred into one ice-cold 15 ml falcon tube and fill up with Basal Medium 1 (BM1; see Table 2) to final volume of 15 ml.   Table 2. Composition of BM1 (500 ml) table:",
    "﻿0,1\nComponent,Volume\nAdvanced DMEM/F12 100x GlutaMax 100x Pen/Strep Hepes (1 M),485 ml 5 ml 5 ml 5 ml\n Stored at 4 °C    Organoids are centrifuged for 600 rpm for 5 min at 4 °C. During centrifugation a 24-well plate is pre-warmed at 37 °C.   The supernatant is carefully removed. Note: Remove as much supernatant as possible. Be careful not to remove organoids.   10 ml of ice-cold BM1 is added to the organoid pellet.   The organoids are centrifuged for 800 rpm for 5 min at 4 °C.   The supernatant is carefully removed.  Note: During this step nice pellet should be visible and the supernatant should be removed completely.   The organoids are mixed with matrigel and pipetted up and down. Note: Avoid bubbles during pipetting. Use 4x volume of matrigel used for the first time.   50 µl matrigel/well is pipetted into the pre-warmed 24-well plate. Note: Pipette matrigel exactly in the middle of the well, so that as a result matrigel drop is formed.   The plate is left for 2-3 min at room temperature.   The plate is transferred into the cell culture incubator and incubated at 37 °C for 5-10 min (until the matrigel solidifies completely).    0.5 ml of CCM (see Table 3) is added per well.   The plate is transferred back to the cell culture incubator.  Table 3. Composition of CCM (20 ml) table:\n﻿0,1\nComponent,Volume\nBM2 EGF (50 ng/µl) Noggin (100 ng/µl) R-Spondin-1 (1 µg/µl),20 ml 10 µl 20 µl 10 µl\n Stored short-term at 4 °C or -20 °C (avoid repeated freeze thaw cycles)"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}