{
  "id": 19154,
  "origin_website": "Jove",
  "title": "Expression, Solubilization, and Purification of Eukaryotic Borate Transporters",
  "procedures": [
    "1. Preparation of media and important buffers\nPrepare 500 mL of 40% galactose by adding 200 g of galactose and de-ionized water to a total volume of 500 mL. Use a hot plate or microwave to increase the rate of galactose getting into solution. Sterile filter with a vacuum filtration apparatus consisting of a 0.2 µm filter top attached to a sterile glass bottle.\n\tNOTE: All media solutions are prepared using de-ionized water.\nPrepare 500 mL of 40% glucose by adding 200 g of glucose and water to a total volume of 500 mL. Autoclave to sterilize.\nInto each of the four 2 L flasks, add 0.4 g of complete supplement mixture without histidine (CSM-His), 3.35 g yeast nitrogen base with ammonium sulfate (YNB + nitrogen), and 475 mL water. Autoclave. Add 25 mL of 40% glucose to achieve a final glucose concentration of 2%.\nAdd, to a glass bottle, 50 g peptone and 25 g yeast extract and water to 375 mL. Autoclave. Add 125 mL of 40% galactose to give 5x yeast peptone (YP) solution containing 10% galactose.\nAdd, to a 250 mL flask, 0.04 g CSM-His, 0.335 g YNB + nitrogen, and water to 47.5 mL. Autoclave. Add 2.5 mL of 40% glucose to get 50 mL of CSM-His + YNB + 2% glucose.\nPrepare 1 L of 1M Tris pH 7.0 by mixing 121.14 g of Tris base with 800 mL of water. Add concentrated hydrochloric acid until the pH reaches 7.0. Add water to a final volume of 1 L and pass through a 0.2 µm filter.",
    "Prepare 500 mL of 0.5 M ethylenediaminetetraacetic Acid (EDTA) pH 8.0 by mixing 73.06 g of EDTA with 400 mL water. Add sodium hydroxide pellets until the EDTA has dissolved and the pH reaches 8.0. Add water to a final volume of 500 mL and pass through a 0.2 µm filter.\nPrepare 100 mL of 100 mM phenylmethanesulfonyl fluoride (PMSF) by mixing 1.74 g of PMSF with 200 proof ethanol. Store at -20 °C.\nPrepare 225 mL of 2x bead wash buffer consisting of 50 mM Tris pH 7.0, 1.4 M NaCl, 20% glycerol, and 1 mM EDTA pH 8.0.\nPrepare 100 mL of the size exclusion chromatography buffer (S200 buffer) consisting of 20 mM 4-Morpholinoethanesulfonic acid hydrate (MES) pH 6.5, 100 mM NaCl, 2% glycerol, and 0.03% n-Dodecyl-beta-D-Maltopyranoside (DDM).\nPrepare 100 mL of membrane resuspension buffer consisting of 50 mM Tris pH 7.0, 500 mM NaCl, and 10% glycerol.\nPrepare 10 mL of a 3x SDS-PAGE loading dye by mixing 3 mL 20% sodium dodecyl sulfate (SDS), 3 mL glycerol, 2.4 mL 1M Tris pH 6.8, 0.03 g bromophenol blue, and 1.6 mL 2-mercaptoethanol.\n2. Overexpression of Borate Transporter in S. cerevisiae\nInoculate three transformed yeast colonies in 50 mL of CSM-His + YNB + 2% glucose media and shake overnight at 190 rpm at 30 °C.\nThe following day use a spectrophotometer to determine the optical density at a wavelength of 600 nm (OD600) and inoculate to an OD600 of 0.01 each of four 2 L flasks that each contain 500 mL of CSM-His + YNB + 2% glucose media.\nShake at 190 rpm at 30 °C for 30 h to allow the cells to consume all glucose and grow to a high density.",
    "NOTE: A longer growth time results in larger cell yields, larger harvested membrane yields, and ultimately larger purified protein yields.\nInduce expression by adding 125 mL of 5x YP media supplemented with 10% galactose for a final induction concentration of 2% galactose. Shake at 190 rpm at 30 °C for 16 h.\nHarvest cells by spinning at 4,000 x g for 15 min. Resuspend the cells in 100 mL cold water.\n\tNOTE: At this point cells may be frozen at -80 °C indefinitely, or the prep may continue into cell lysis and membrane harvesting. We typically harvest 40-45 g of cells.\n3. Harvesting of Yeast Membranes\nAdd to the cell resuspension 11.25 mL of 1M Tris pH 7.0, 0.45 mL of 0.5 M EDTA, and 2.25 mL of 100 mM PMSF, the latter two of which act as protease inhibitors. Add water to a final volume of 225 mL, which results in a cell resuspension buffer of 50 mM Tris pH 7.0, 1 mM EDTA, and 1 mM PMSF.\n\tNOTE: If using frozen cells allow cells to thaw thoroughly, about 1 h at room temperature, because if they remain partially frozen, they will resist lysis by bead beating.\nAdd the cell resuspension into a 450 mL metal canister for bead beating. Top off the remaining volume with cold 0.5 mm glass beads.\nAssemble a bead-beating chamber with the rotor and immerse in an ice bath. Perform six 1 min pulses, separated by 2 min rest periods to prevent overheating the lysate.",
    "Assemble a vacuum filtration apparatus by using a plastic disposable bottle top filter screwed into a glass bottle. Remove the filtration membrane, because the remaining plastic device can capture the beads while allowing lysate to pass. Separate the beads from the lysate by pouring the contents of the bead beating chamber onto the assembly while applying the vacuum.\nWash the bead beating chamber with 225 mL of a 2x wash buffer that contains 50 mM Tris pH 7.0, 1 mM EDTA, 1 mM PMSF, 1.4 M NaCl, and 20% glycerol. Empty the contents of the chamber onto the beads to wash them.\n\tNOTE: The wash gives a final volume of ~450 mL lysed cells and significantly increases harvested membrane yields. The final concentrations are 50 mM Tris pH 7.0, 1 mM EDTA, 1 mM PMSF, 10% glycerol, and 700 mM NaCl, and the primary purpose of elevating the salt concentration is to help dissociate peripheral membrane proteins.\nSpin down the cell lysate for 15 min at 15,000 x g. Pour the supernatant into polycarbonate bottles and spin for 1 h at 135,000 x g in an ultracentrifuge to collect membranes.\n\tNOTE: If an ultracentrifuge is not available, membranes may be collected by spinning for 3 h at 53,000 x g, a force that is achievable in floor model centrifuges.\nDiscard the supernatant and weigh the bottles with the membrane pellets. Resuspend the membrane pellets in approximately 35 mL membrane resuspension buffer containing 50 mM Tris pH 7.0, 500 mM NaCl, and 10% glycerol and add to a glass douncer. Weigh the empty centrifuge tubes to determine the mass of membranes harvested.",
    "NOTE: In an efficient membrane harvest, the weight of membranes will be equal to approximately 20% the weight of cells used for that membrane harvest. This protocol gives typical cell yields of 40-45 g, and thus we likewise expect a yield of 8-9 g membranes.\nDounce homogenize the membranes, and aliquot into 50 mL conical tubes that may now be stored indefinitely at -80 °C.\n\tNOTE: For this experiment, typically two aliquots are made, to allow two separate protein purifications to be performed from one original cell preparation.\n4. Solubilization and Purification of Protein\nTo a beaker add a stir bar and 150 mg of n-Dodecyl-β-D-Maltopyranoside (DDM) per g membrane being used. Keep protein on the ice or at 4 °C at all times.\n\tNOTE: DDM is hygroscopic and should be stored in a glass jar with desiccant at -20 °C when not in use. Also, it is typical to use between 4-5 g of membranes in a purification to obtain an appreciable amount of pure protein.\nThaw membranes and bring to a final volume of 15 mL per g membrane in membrane resuspension buffer supplemented with 1 mM PMSF and 20 mM imidazole pH 8.0. Add membranes to the beaker with DDM and stir for 1 h at 4 °C.\n\tNOTE: The DDM concentration will be 1% w/v, but for the solubilization of membrane proteins it is more critical to be aware of the mass of detergent added per g membrane.\nSpin for 25 min at 135,000 x g at 4 °C to pellet non-solubilized material. Filter the supernatant through a 5 µm syringe filter.",
    "Load the sample by the peristaltic pump set to a flow rate of 1 mL/min onto a 1 mL immobilized nickel affinity column equilibrated in 20 mM Tris pH 7.0, 500 mM NaCl, 10% glycerol, 20 mM imidazole pH 8.0, and 0.05% DDM.\n\tNOTE: For lower expressing proteins, improved purity and yields were observed by using a 1 mL instead of 5 mL column, and nickel instead of cobalt ions for affinity chromatography.\nWash the column with 10 column volumes of a wash buffer containing 20 mM Tris pH 7.0, 500 mM NaCl, 10% glycerol, 80 mM imidazole pH 8.0, and 0.05% DDM.\n\tNOTE: The imidazole concentration that can be used during washes for a 10-His-tagged protein is higher than is commonly appreciated and results in improved purity.\nElute the protein in the buffer containing 20 mM Tris pH 7.0, 200 mM NaCl, 10% glycerol, 300 mM imidazole pH 8.0, and 0.05% DDM. Collect the eluate in ten 1 mL fractions and run on a 4-20% Tris-glycine SDS-PAGE gel along with solubilized lysate and wash fractions.\nPool peak fractions, usually about 5-6 mL, and concentrate to 500 µL or less volume in a 50 kDa cutoff concentrator in a benchtop centrifuge refrigerated at 4 °C.\n\tNOTE: 500 µL is a typical maximum volume injected into size exclusion chromatography (SEC) columns. At this point the protein may be stored indefinitely at -80 °C or continue onto SEC.\nFilter the protein through a 0.2 µm spin column filter and inject onto a size exclusion column (e.g., Superdex-200) equilibrated in S200 buffer: 20 mM Mes pH 6.5, 100 mM NaCl, 2% glycerol, and 0.03% DDM.",
    "NOTE: For the subsequent glutaraldehyde cross-linking assay, the buffering agent must not contain a primary amine. SEC is an opportunity to exchange buffers if necessary, as done here when exchanging Tris for Mes.\nRun the peak fractions on a 4-20% Tris-glycine SDS-PAGE gel. Stain the gel, collect pure peak fractions, and concentrate in a 50 kDa-cutoff concentrator at 4 °C.\nDetermine the protein concentration by measuring the absorbance at a wavelength of 280 nm, and store indefinitely at -80 °C.\n5. Glutaraldehyde Cross-linking Assay\nPrepare a 10 µL reaction by mixing 3 µL of 0.5 mg/mL protein in S200 buffer, 5 µL of S200 buffer, 1 µL of either water or 20% sodium dodecyl sulfate (SDS), followed by 1 µL of 1.5% glutaraldehyde.\n\tNOTE: This will give a 1x reaction of 0.15 mg/mL protein and 0.15% glutaraldehyde. Samples containing a pre-treatment of SDS are important negative controls and should be mixed and incubated at room temperature for 5 min before adding glutaraldehyde.\nIncubate the reaction for 30 min at room temperature. Terminate the reaction by adding 5µL of 3x SDS-PAGE gel loading dye, which contains an excess of Tris buffer that quenches the glutaraldehyde.\nLoad all 15 µL onto 4-20% Tris-glycine SDS-PAGE gel, which will load 1.5 µg protein per lane. Run the gel at 200 V for 30 min. Stain and determine the extent of dimer cross-linking by evidence of a band that runs at twice the size of the denatured monomer.\n\tNOTE: A glutaraldehyde titration and time course may be performed first to find the best conditions for a homomeric transporter."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}