{
  "id": 7872,
  "origin_website": "Bio",
  "title": "A New Methodology for the Quantification of Neutrophil Extracellular Traps in Patient Plasma",
  "procedures": [
    "NETs ELISA Coat 96-well ultra-high-binding plates with 50 μL of anti-MPO and anti-CitH3 unlabeled primary antibodies diluted to a concentration of 5 μg/mL each in coating buffer. Cover the plate with the plate sealer. Leave plate overnight at 4 °C.The next morning, wash wells three times with 200 μL of PBS at room temperature.Block plate with 200 μL of blocking buffer for 2 h at room temperature.Wash the plate five times with 200 μL of PBS.Add 50 μL of undiluted plasma sample to each coated well and incubate at room temperature for 2 h. Set up wells for blanks where no plasma samples are added.Carefully wash the plate five times with 200 μL of wash buffer; do not invert plate during washes.Add 50 μL of anti-DNA-POD antibody (from Cell Death Detection ELISA PLUS Anti-DNA POD kit) prepared 1:100 in dilution buffer to each well and incubate at room temperature for 2 h for the detection of NETs.Wash the plate five times with 200 μL of wash buffer.Add 100 μL of TMB (allow to come to room temperature before using) to each well and incubate plate in the dark for 3 min.Add 100 μL of 2 N sulfuric acid stop solution to each well and measure absorbance using a Synergy Neo2 Multi-Mode microplate reader, or any ELISA microplate reader set to a wavelength of 450 nm.Smear assay Draw a circle using a histology liquid repellent pen on a poly-L-Lysine glass slide (2–3 circles per slide).Drop 1 μL of plasma sample to each circle and smear in a circular motion until the volume is equally distributed. Let plasma completely dry.Fix samples with 100 μL of smear fixing buffer (4% formaldehyde) for 10 min.",
    "Carefully tilt the slide to remove the liquid to be collected in the formaldehyde waste container, dab the sides of the slides with a paper towel, and carefully wash each circle three times with 100 μL of PBS.Block the slides with 100 μL of smear blocking buffer (5% BSA/PBS) for 1 h at room temperature.Add 50–100 μL of anti-MPO and anti-CitH3 primary antibodies diluted to smear dilution buffer (1 μg/mL in 0.3% Triton X-100 + 0.1% BSA solution) to each circle and leave overnight in a moist slide chamber.The following morning, wash slides three times with PBS and add 50–100 μL of goat anti-mouse Alexa Fluor 488 and goat anti-rabbit Alexa Fluor 594 secondary antibodies diluted 1:500 in dilution buffer to each circle and incubate in the dark for 1 h.Wash three times with 200 μL of PBS and stain slides with 5 mg/mL of DAPI diluted 1:200 in PBS for 15 min in the dark.In another set of slides for quick nonspecific visualization, after fixing and blocking, NETs can be stained directly with nuclear dyes Sytox Green diluted 1:200 and 5 mg/mL of DAPI diluted 1:200 in PBS for 15 min in the dark.Wash an additional three times with 200 μL of wash buffer after staining. Add a drop of VectaMount AQ mounting medium and secure a glass coverslip onto the slide making sure that there are no bubbles.Allow the slides to dry before imaging on EVOS M7000 imaging system and/or ZEISS Confocal LSM 880.Stain secondary antibody–only controls the similar way, except that no primary antibodies are added."
  ],
  "subjectAreas": [
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}