{
  "id": 5745,
  "origin_website": "Bio",
  "title": "Teratoma Formation Assay for Assessing Pluripotency and  Tumorigenicity of Pluripotent Stem Cells",
  "procedures": [
    "Preparing cells for transplantationMaintain iPSCs according to the previous reports (Takahashi and Yamanaka, 2006; Takahashi et al., 2007; Miyawaki et al., 2016). It is necessary to prepare at least 2 x 106 cells.  Replace with fresh culture medium 1 h before dissociation.Aspirate culture medium and wash twice with PBS.Detach the cells using trypsin-EDTA (1 ml/10 cm dish).Stop the trypsin reaction with 15% fetal bovine serum-containing medium for mouse iPSCs (see Recipe 1) or trypsin inhibitor for NMR and human iPSCs (see Recipe 2). Collect cells in a 15 ml conical tube, and re-suspend cells in 4 ml of PBS.Count cells using a Coulter counter.Centrifuge cells at 200 x g for 5 min at room temperature. Aspirate supernatant and re-suspend iPSCs in an appropriate volume of PBS to yield a final concentration to 5 x 107 cells/ml (equal to 1 x 106 cells/20 μl).Transfer cells into a 1.5 ml tube.Place cells on ice until used for injection.Injection into mice(Optional) Administer ampicillin-containing water (1 g/L) orally to mice from 3 days before until 1 week after surgery.Place NOD/SCID mice on a heating pad and anesthetize with isoflurane.Wash surgical area with 70% ethanol and remove hair from the dorsal region.Make a 1 cm incision above the top of the preputial gland and open the abdomen.Carefully pull out the epididymal fat pad along with the testes (Figure 2A). Fill a Hamilton syringe with 20 µl (1 x 106 cells) of cell suspension.Cut the tunica vaginalis of the testis using a 26-gauge needle (Figure 2B).Use the Hamilton syringe to inject 20 μl of cell suspension (Figure 2C).Slowly remove the needle to avoid backflow of cells.Return the testes to their original location.Suture the wound.Note: Demonstration of the injection procedure can be viewed in Video 1.    <p>imgsrc:https://bio-protocol.org/javascript:;</p>   Video 1. Injection procedure.",
    "The cell suspension is blue stained for demonstration.                                                      Defining pluripotency and tumorigenicityAt 4, 10, 20, or 28 weeks after transplantation, anesthetize and sacrifice the mice in accordance with the Guide for the Care and Use of Laboratory Animals. Thereafter, dissect the tumors and testes (Figures 2D and 2E).Note: Tumors could be observed 4 weeks and 10 weeks after the injection of mouse iPSCs and human iPSCs, respectively.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170814/20170814021205_4313.jpgFigure 2. Injection iPSCs into testis of NOD/SCID mice. Transplant procedure (A-C). Representative photographs of teratoma (D) and testis without tumor formation (E). Arrowhead indicates teratoma formed by mouse iPSCs.After removing moisture within the laboratory wipe, measure the weight of the tumor.Fix the tumors or testes overnight in PBS containing 4% PFA (see Recipe 3) for embedding in paraffin. Stain sections with hematoxylin and eosin (HE), or subject to immunohistochemical analysis, to detect expression of GFP and differentiation markers. The section of tumors and testes in our previous study are shown in Figure 3 (Miyawaki et al., 2016).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170814/20170814021315_9474.jpgFigure 3. Image of HE and immunohistochemical stained section of tumors and testis after transplantation of iPSCs. HE staining section of tumors and testis of mice transplanted with NMR iPSCs 10 weeks after transplantation (A and D), mouse iPSCs 4 weeks after transplantation (B) or human iPSCs 10 weeks after transplantation (C). Immunohistochemical analysis of GFP (E). Arrowheads indicate the transplanted GFP-labeled NMR iPSCs. Scale bar, 200 µm (A-C) and 1 cm (D and E)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}