{
  "id": 18978,
  "origin_website": "Jove",
  "title": "Minimal Erythema Dose (MED) Testing",
  "procedures": [
    "1. Preparing for UV Exposure\nExplain to the participant how MED testing works  (\"I'm going to expose some skin on your arm to UV light over the course of  about 20 min, and tomorrow, we're going to check that section of your skin  in order to determine how sensitive you are to the light. You may experience a  sunburn in the small areas that we expose to UV. If the sunburn is painful or  bothers you, you can treat it like you would any other sunburn.\")\nStaff and participant should wear UV protective  glasses.\nThe participant should be wearing a  short-sleeved shirt or roll her sleeve up.\nHave the participant put on a glove to protect  the skin on her hand. \nRemove the Daavlin patch1 backing on the  left and right sides of the patch, and place it on the inner lower arm just  adjacent to the glove, avoiding any existing skin blemishes.\nCover any additional skin on the arm with the  participant's shirt or other material.\nPlace the arm so that the holes in the patch  will be exposed to the UV light source. No other skin should be exposed to the  UV light.\nTell the participant she will feel warmth but  her arm will not be burning during the test.\n2. Conducting UV Exposure\nPatch holes (e.g. 6) should be exposed to UV at  intervals throughout the exposure period. \nStart with hole 1 open.\nSelect the total duration of the exposure based  on the manufacturer specifications for the light source and the participant's  Fitzpatrick skin type I-VI (very fair to very dark; Fitzpatrick, 1988).2 Fairer skin is  more likely to burn.\nSet a timer for the total duration of exposure  (e.g. 20 min). A second backup timer may also be used. Start the timer(s).",
    "For example, open hole 2 after 2 min, open hole 3 after 4 min, open hole 4 after 8 min, open hole 5 after 12 min, and open hole 6 after 16 min. Thus,  the skin UV exposure times will be 20 min for hole 1, 18 min for hole  2, 16 min for hole 3, 12 min for hole 4, 8 min for hole 5, and 4 min for hole 6.\nIn order to more easily identify the exposed  areas after 24-48 hr, mark the skin exposed on the far edge of the first and  last holes of the patch and ask the participant to not wash off the marks until  after the skin is examined.\nHave the participant remove the glove and patch.\nReiterate to the participant that the skin must  be reexamined in 24-48 hr.\n3. Assessing the MED\nAfter 24-48 hr, examine the exposed areas of  skin. Red or pink skin indicates erythema or burning. Erythemetous skin exposed  to the shortest duration of UV is defined as the minimal erythema dose or MED.\nFuture exposures to UV should be for durations  shorter than the MED to avoid burning.\nIf the areas of exposure are difficult to  identify, you may want to put the patch back on using the marks to align with  the exposed skin. This is also helpful if using a skin color measurement device  such as a spectrophotometer. \nSpectrophotometers provide measures of L*  (darkness) and b* (hue). a* refers to the redness of the skin. A higher a*  value indicates redder skin.\nIf using a skin color measurement device such as  a spectrophotometer, place the spectrophotometer aperture in the center of the  hole to be measured.",
    "Measure each of the 6 exposure areas in  numerical order and one unexposed area near the others for comparison. Try to  measure the center of each hole but not a freckle or mole or other non-UV  discolorations. Label each of the measurements. The measurement from the  unexposed area should be labeled 0 min and be listed next to area 6 (the  shortest exposure area - 4 min).\nIncreases in a* values should correspond with  increases in UV exposure duration. Try re-measuring values that are not in  corresponding order.\nA 2.5 point difference in the a* of unexposed  skin compared to exposed skin indicates a significant difference in redness,  suggesting potential burning.\nAdd 2.5 to the lowest a* value. Anything at or  above this value would be considered potentially burning. The lowest exposure  time above this value is considered the MED.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}