{
  "id": 1894,
  "origin_website": "Cell",
  "title": "Multi-CUT&amp;Tag to simultaneously profile multiple chromatin factors",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nBulk multi-CUT&Tag\nPreparation of concanavalin A beads\nTiming: 15 min\nIn this step, lectin coated magnetic beads are activated. Beads can be prepared 15 min before harvesting the cells.\nResuspend Concanavalin A coated magnetic beads and pipet 10 μL of beads into a 1.5 mL microcentrifuge tube per 100,000 cells to be profiled in all samples. Add 850 μL cold binding buffer.\nPlace the microcentrifuge tube containing concanavalin A beads on a magnetic stand for at least 2 min, until the solution is clear.\nNote: For this and all bead separation steps, let the solution clear completely to avoid loss of beads.\nAfter the solution has completely cleared (about 2 min), remove and discard the supernatant by pipetting without disturbing the beads.\nRemove microcentrifuge tube from magnetic stand and resuspend the concanavalin A beads in 1 mL binding buffer by gently pipetting the solution. Place it on magnetic stand for 2 min.\nAfter the solution has completely cleared, remove and discard supernatant without disturbing beads.\nRepeat steps 4 and 5.\nRemove microcentrifuge tube from magnetic stand and resuspend beads in 10 μL binding buffer.\nBinding of cells to magnetic beads\nTiming: 15 min\nCells are harvested and bound to the prepared concanavalin A-coated beads.\nIf required, trypsinize and resuspend cells to achieve a single cell suspension. Count and add appropriate number of cells to a 1.5 mL microcentrifuge tube in PBS. We typically use 100,000 cells for each multi-CUT&Tag bulk experiment.\nCentrifuge the cells for 5 min at 600 g, 4°C. Discard supernatant.\nAdd 1 mL Wash buffer and resuspend the cell pellet by gentle pipetting.\nCentrifuge the cells for 5 min at 600 g, 4°C. Discard the supernatant.",
    "Resuspend the cell pellet in 0.5 mL Wash buffer and add the activated Concanavalin A coated beads (10 uL, from the previous step).\nIncubate cells/beads for 15 min at 25°C in an end-over-end rotator.\nIncubating permeabilized cells with purified antibody-pA-Tn5 complex(es)\nTiming: 4–12 h\nIn this step, differentially barcoded purified antibody-pA-Tn5 complex is added to permeabilized cells and allowed to bind to the chromatin proteins to be mapped.\nPlace the microcentrifuge tube containing Concanavalin A bead-bound cells on a magnetic stand for 2 min. Then carefully remove all liquid by pipetting.\nResuspend cells in 100 μL cold Dig-wash Buffer containing 2 mM EDTA.\nNote: Gentle pipetting is preferable to vortexing at this step. Take care to prevent the introduction of bubbles during resuspension.\nAdd 6 μL of each of the differentially barcoded purified antibody-pA-Tn5 complex to the cells.\nIncubate on nutating mixer at 4°C for 4 h (or up to 12 h) incubation.\nTagmentation\nTiming: 1.5 h\nIn this step, antibody-tethered pA-Tn5 will insert unique barcodes into the DNA around the site of pA-Tn5 recruitment.\nPlace the microcentrifuge tube on a magnetic stand for at least 2 min, until the solution is clear.\nAfter the solution has completely cleared, remove and discard the supernatant without disturbing the beads.\nRemove microcentrifuge tube from magnetic stand and resuspend the beads in 1 mL Dig-med Buffer by gently pipetting. Incubate on nutating mixer for 5 min and then place it on magnetic stand for 2 min.\nDiscard supernatant without disturbing beads. and repeat step 20.\nAfter discarding the supernatant, resuspend the bead-bound cells in 300 μL Dig-med Buffer containing 10 mM MgCl2 while gently vortexing.\nIncubate bead-bound cells at 37°C for 60 min to allow transposition of adapters into DNA.\nPurification of DNA\nTiming: 2 h or 14 h",
    "In this step, the transposed DNA fragments are purified prior to PCR amplification.\nTo stop tagmentation and solubilize DNA fragments, add 10 μL 0.5 M EDTA, 3 μL 10% SDS and 1 μL of 20 mg/mL Proteinase K to each sample.\nVortex on full speed and incubate for 60 min at 50°C or 12h at 37°C.\nAdd 300 μL of Phenol-Chloroform-Isoamyl alcohol (listed as Phenol:Chloroform +tris buffer in Key Resources) to the tube and mix by full-speed vortexing. Transfer to a phase-lock tube, and centrifuge for 3 min at 16,000 g at 25°C.\nNote: Phenol and Chloroform are chemical hazards and should be handled with caution in a chemical hood.\nAdd 300 μL chloroform to the same phase lock tube (to the aqueous phase), mix by inversion and centrifuge for 5 min at 16,000 g at 25°C.\nRemove the aqueous phase to a new tube, add 0.5 μg/μL glycogen, and mix by vortexing well.\nAdd 750 μL of 100% ethanol and mix by vortexing. Incubate at −20°C for 15 min.\nPause point: Sample can also be stored in −20°C for at least several days.\nCentrifuge for 15 min at 4°C at 16,000 g.\nCarefully remove and discard the supernatant without disturbing the pellet.\nCritical: The pellet is hardly visible, so be careful when removing the supernatant not to disturb the pellet.\nWash the pellet in 1 mL 100% ethanol and carefully remove and discard the supernatant.\nCentrifuge for 1 min at 16,000 × g, 4°C, to spin down any residual ethanol.\nDiscard any residual supernatant by pipet.\nAir dry ∼5 min at 25°C.\nCritical: Do not overdry samples.\nDissolve the pellet in 23 μL of 10 mM Tris-HCl pH8 containing 0.1 mg/mL RNase A.\nIncubate for 10 min at 37°C.\nPCR amplification of the multi-CUT&Tag library\nTiming: 1 h",
    "A low amount of DNA is recovered during the previous step, which needs to be amplified. Full P5/P7 adapter sequences for sequencing are also added during this PCR step.\nNote: When amplifying multi-CUT&Tag DNA, the initial extension prior to melting is needed to fill in the gap left during the transposition and allow productive amplification cycles.\nPrepare PCR mix as below, using universal or barcoded i5 and i7 primers (Buenrostro et al., 2013[href=https://www.wicell.org#bib14]) and mix gently.\ntable:files/protocols_protocol_1374_19.csv\nPCR:\ntable:files/protocols_protocol_1374_20.csv\nCritical: Additional PCR cycles may be needed (dependent on the type of cell, number of cells used, antibody used, etc.), and can be determined by quantitative PCR using KAPA Library Quantification Kits (according to manufacturer’s protocol). Approximately 5–10 ng of library is needed for an Illumina sequencing run.\nCritical: It is essential to keep the number of PCR cycles constant among samples that are to be compared\nPost PCR cleanup\nTiming: 1 h\nThese steps remove the excess primers and isolate the appropriate sizes of DNA fragments for sequencing.\nTo the same tube from the previous step, add 55 μL AMPure XP beads (1.1 volumes) and mix by pipetting. Incubate at 25°C for 10 min.\nPlace on magnet and carefully pipet off the liquid. Without disturbing the beads, wash the beads twice with 200 μL of 80% ethanol.\nPerform a quick (1–2 s) spin in a mini centrifuge, replace tubes on the magnet, carefully remove all remaining liquid, and air dry the beads for 2–3 min.\nAdd 25 μL 10 mM Tris-HCl pH 8 to the beads and vortex on full. Incubate at 25°C for 5 min.\nPlace on magnet for 2 min, transfer the supernatent a fresh 1.5 mL microcentrifuge tube.",
    "Determine the size distribution (by Fragment analyzer) and concentration (by Qubit or KAPA Library Quantification Kit) of the libraries before sequencing.\nSingle cell multi-CUT&Tag\nIncubating permeabilized cells with purified antibody-pA-Tn5 complex(es)\nTiming: 12 h\nThis step allows binding of differentially labeled antibody-pA-Tn5 complexes to the respective chromatin epitopes in the bulk population of cells, prior to single cell isolation and barcoding.\nCells were trypsinized and washed in PBS. After cell counting, 200,000 cells were used as starting material.\nCentrifuge cells at 600 g for 5 min at 4°C.\nRemove the supernatant and resuspend the cells in 1 mL Wash buffer. Transfer the cells to 1.5 mL microcentrifuge tube.\nCentrifuge cells at 600 g for 5 min at 4°C to remove the supernatant. Resuspend cell pellet in 100 μL cold Dig-wash Buffer containing 2  mM EDTA.\nAdd each of the differentially barcoded purified antibody-pA-Tn5 complexes (12 μL) to the cells.\nPlace on nutating mixer at 4°C for ∼12 h incubation to allow antibodies to bind to chromatin.\nTagmentation\nTiming: 1.5 h\nIn this step, antibody-tethered pA-Tn5 will insert unique barcodes into the DNA around the site of pA-Tn5 recruitment.\nCentrifuge cells at 600 g for 5 min at 4°C.\nRemove the supernatant and resuspend the cells in 1 mL Dig-med Buffer by gently pipetting. Incubate on nutating mixer for 5 min.\nRepeat the wash steps 52 and 53 three times (for a total of four washes).\nCount the cells again during the last wash, as some cells can be lost during the wash steps.\nResuspended cells in Dig-med Buffer at 5000 cells/μL and incubate on ice for 5 min.\nTo start tagmentation, add an equal volume of Dig-med Buffer containing 20 mM MgCl2 and incubate samples at 37°C for 60 min.",
    "After 1 h, 2.5 μL of the tagmentation reaction (2500 cells/μL) is used for a targeted cell recovery of 4000 cells. It is mixed into a tube as below:\ntable:files/protocols_protocol_1374_21.csv\nGEM generation & barcoding\nTiming: 1 h\nThis step allows single cell isolation by generation of Gel Beads-in-emulsion (GEMs), using a Chromium Next GEM Single Cell ATAC Library & Gel Bead Kit (10× Genomics) https://assets.ctfassets.net/an68im79xiti/6Be7TWXkltEluNIaWgA0dj/37c815979660f6a718328d525914a5d5/CG000209_Chromium_NextGEM_SingleCell_ATAC_ReagentKits_v1.1_UserGuide_RevF.pdf[href=https://assets.ctfassets.net/an68im79xiti/6Be7TWXkltEluNIaWgA0dj/37c815979660f6a718328d525914a5d5/CG000209_Chromium_NextGEM_SingleCell_ATAC_ReagentKits_v1.1_UserGuide_RevF.pdf]\nPrepare the barcoding master mix, by mixing 61.5 μL of barcoding reagent, 1.5 μL of Reducing Agent B and 2 μL of barcoding enzyme.\nLoad the samples and Gel beads to Chromium Chip E following the 10× Genomics User protocol (step 2 of Chromium Next GEM Single Cell ATAC Reagent Kits v1.1 User Guide, linked above). After GEM generation in the 10× Genomics Chromium Controller, the GEMs are transferred to a PCR tube.\nIncubate the GEMs in a thermocycler with following program:\ntable:files/protocols_protocol_1374_22.csv\nCritical: The use of a single amplification cycle at this step differs from the manufacturer’s recommendations for scATAC-seq (linked above), which recommends >10 cycles of linear amplification to introduce cell-specific barcodes. We found that elimination of all but one amplification cycle at this step was necessary to prevent incorporation of uninserted Tn5 adapters into libraries during PCR.\nPost GEM incubation cleanup (according to manufacturer’s protocol)\nTiming: 2 h\nSilane magnetic beads remove leftover biochemical reagents from the post GEM reaction mixture. AMPure beads eliminate unused barcodes from the sample.\nPost GEM cleanup is performed first using Dynabeads MyOne SILANE beads according to the 10× Genomics’ ATAC seq protocol (step 3 of Chromium Next GEM Single Cell ATAC Reagent Kits v1.1 User Guide).\nAn additional round of cleanup is then performed using AMPure XP beads according to 10× Genomics’ ATAC seq protocol.\nSingle cell multi-CUT&Tag library construction (according to manufacturer’s protocol)",
    "Timing: 2 h\nSingle cell libraries with cell-specific and sample-specific barcodes are generated in this step.\nConstruct libraries using sample indexing primers (Single Index Kit, 10× Genomics), by performing 14 cycles of PCR according to manufacturer’s protocol (step 4 of Chromium Next GEM Single Cell ATAC Reagent Kits v1.1 User Guide).\nPerform a double-sided size selection post sample index PCR using AMPure XP beads according to manufacturer’s protocol.\nDilute 1 μL of the library to determine its concentration using KAPA Library Quantification Kit (According to manufacturer’s protocol). The library size distribution can be determined by Fragment Analyzer (According to manufacturer’s protocol) (Figure 2[href=https://www.wicell.org#fig2]), prior to sequencing.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1374-Fig2.jpg\nFigure 2. Library size distribution by fragment analyzer of triple antibody multi-CUT&Tag for H3K27me3, H3K27ac, and RNAPII S2P\nMulti-CUT&Tag libraries tend to display peaks corresponding to subnucleosomal fragments plus a nucleosome ladder: mononucleosomes, dinucleosomes, etc. Fragment sizes corresponding to each class, plus adapters, are indicated.\nNote: ∼5 ng of library is needed for Illumina sequencing run.\nSequencing of multi-CUT&Tag libraries\nTiming: 24 h\nPaired-end Illumina sequencing of multicell or single cell multi-CUT&Tag libraries is performed using custom sequencing primers.\nPaired-end sequencing is performed on an Illumina NextSeq 500, using a 150 cycle sequencing kit. We used manual mode on the NextSeq 500 for sequencing.\nCustom read primers for library and PhiX Control v3 were mixed together for the run (Table 2[href=https://www.wicell.org#tbl2]). Custom indexing primers were used for indexing run (Table 2[href=https://www.wicell.org#tbl2]).\nThe following sequencing parameters were used for the run: read 1–72 cycles, read 2–72 cycles, index 1–8 cycles, index 2–8 cycles (for bulk multi-CUT&Tag) or 16 cycles (for single cell multi-CUT&Tag).",
    "Note: PhiX Control v3 was added at 20%–30% per reaction, due to the sequence homogeneity of the initial sequencing cycles, which read through adapter sequences that are identical in all reads. Addition of a spike-in library like PhiX Control v3 is a quality control step that offers multiple benefits during cluster generation, sequencing, and read alignment. It is optional but highly recommended."
  ],
  "subjectAreas": [
    "Genomics",
    "Sequence Analysis",
    "Molecular/Chemical Probes",
    "Antibody",
    "Protein Expression And Purification",
    "Single Cell",
    "Molecular Biology",
    "Sequencing",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}