{
  "id": 11845,
  "origin_website": "Jove",
  "title": "Isolation of Stably Transfected Melanoma Cell Clones",
  "procedures": [
    "1. Cell subculture and seeding for drug concentration optimization\nWarm the cell culture medium (in this case, Dulbecco's modified Eagle's medium with a reduced concentration (1.5 g/L) of NaHCO3, 10% (v/v) fetal bovine serum (FBS), 1% (v/v) L-glutamine, and 1% (v/v) antibiotic-antimycotic) and trypsin solution in a water bath to 37 °C.\nAspirate and discard the cell culture medium from the A735 cells growing in a T25 cell culture flask. The cell line is obtained from commercial sources.\nWash out any remaining cell culture medium from the cells by washing the flask with 1 mL of trypsin or PBS solution.\nAspirate and discard the trypsin or PBS solution from the cells.\nAdd 1 mL of trypsin solution to the flask and incubate it at 37 °C. Carefully observe the detachment of the cells using an inverted microscope.\nStop the trypsin activity by adding 3 mL of fresh complete cell culture medium and rinse the cell culture flask with it when cells detach.\nTransfer the cell suspension from the flask to a 15 mL centrifuge tube.\nCentrifuge the cells at 800 x g for 5 min at room temperature (RT).\nAspirate and discard the supernatant.\nResuspend cells in 1 mL of the fresh cell culture medium.\nTo calculate the cell density, count the cells with an automatic cell counter or hemocytometer.\nSeed the appropriate number of cells in a culture dish of the appropriate size.\n\tNOTE: In this experiment, 450,000 cells of the A375 cell line were seeded in 2 mL of the cell culture medium in a 35 mm culture dish.\n2. Optimization of selected drug concentration\nFind the manufacturer's recommended concentration range of the drug to be used to select stable cell clones.",
    "NOTE: A selection gene introduced into a cell by transfection with a genetic vector provides the cell with resistance to the selection drug. Puromycin at a concentration of 1 µg/mL was used as a selection marker to obtain stable expression of the genetic vector and eliminate untransfected cells.\nSeed the cells in the wells of a 96-well plate to reach 50% confluence on the next day. Prepare three wells for each drug concentration and an untreated control. Seed 10,000 cells per well. The cell number depends on the cell line being used and needs to be determined empirically.\nAfter 24 h, prepare 10 dilutions of the drug in the complete medium from the lowest to the highest concentration recommended by the manufacturer and add them to the cells.\n\tNOTE: In this case, puromycin was used. The concentration range was 0-10 µg/mL. Every 3 days, or when many dead cells are observed in the medium, change to fresh medium.\nObserve the cells daily for a week and make notes regarding their confluence, proliferation, and death with respect to the control plate.\n\tNOTE: An appropriate concentration is one at which cells stop proliferating and does not cause cell death immediately but kills all treated cells after 48-120 h. However, for some combinations of cell lines and drugs, there may not be a phase where cells stop proliferating but die. In such a situation, the lowest concentration of drug that kills all cells would be appropriate for selection.\n3. Cell seeding and transfection\nSeed the cells in a well of a six-well plate.",
    "NOTE: The final volume of the cell suspension in the cell culture medium should be 2.5 mL. For this experiment 450,000 cells per well were seeded. The cell number needs to be determined empirically so that their confluence cannot exceed 90% after 48 h of seeding.\nCulture the cells at 37 °C in a humidified atmosphere containing 5% CO2 for 24 h.\n\tNOTE: Cells were cultivated for 24 h before transfection. However, 48 h after seeding, it was observed that the cells were transfected more efficiently.\nAspirate and discard the cell culture medium above the cells.\nReplace the discarded medium with prewarmed antibiotic-free cell culture medium (10% (v/v) FBS, glutamine-supplemented DMEM).\n\tNOTE: The need for changing the cell culture medium is due to the increased cell permeability caused by some transfection reagents, which can cause an increased influx of antibiotics into the cells, resulting in cell death.\nDilute transfection reagents in antibiotic- and serum-free DMEM. Use polyethyleneimine (PEI), lipid-based transfection reagent, or electroporation. For cell transfection, use 2 mg/mL polyethyleneimine solution at a weight ratio of 1:2.175 for 4 µg of DNA.\n\tNOTE: As a DNA solution, a mixture of two plasmids was used in the CRISPR/Cas9(D10A) system with the following gRNA sequences: 5'ccgggccgtgcagcaccgtg3' and 5'atccagctgcacggtaaaga3'.\nIncubate the transfection mixture for 30 min at RT.\nAfter incubation, carefully add the transfection mixture dropwise to the cells growing in the wells of a six-well plate.\nCulture the cells at 37 °C in a humidified atmosphere containing 5% CO2 for 2-6 h.\nChange the medium to the complete cell culture medium.\nCulture the cells at 37 °C in a humidified atmosphere containing 5% CO2 for the next 24 h.\n4. Generation of cell clones",
    "Trypsinize and transfer the transfected cells into a 150 mm diameter culture dish with a 20 mm molded grid according to the instructions in section 1 of the protocol.\n\tNOTE: Due to the merging of the cells with each other in the case of high density, it is recommended that the cells be transferred evenly into two cell culture dishes. The grid on the culture dish helps locate clones and track their migration. On a printed dish plan, one can later mark the location of the clones (Figure 1B). In addition, for cells that do not tolerate removal of the medium and exposure to air (resulting in death/irreversible damage), it would be better to use more dishes with a smaller surface area to isolate fewer colonies from one dish. This could reduce the time of exposure to air during clone isolation and reduce the likelihood of cell dehydration.\nCulture the cells at 37 °C in a humidified atmosphere containing 5% CO2 for 24 h.\nChange the cell culture medium to a medium containing a selective antibiotic.\n\tNOTE: From this point on, it is important to culture the cells in the presence of a selective antibiotic; otherwise, there is a chance of cutting the integrated transgene out of the gene.\nChange the medium every 3 days or when there are many dead cells floating in the medium.",
    "NOTE: In this experiment, the cells were incubated with puromycin at a concentration of 1 µg/mL. The cell clone selection step takes approximately 2 weeks. The formation of clones should be monitored by observing their growth under an inverted microscope, because they should not grow and come into contact with neighboring cell clones. Cells from one colony cannot be prevented from migrating and growing with another colony. Therefore, it is important to observe the plate for cell migration from the clones and note the information about it on the dish plan.\n5. Choosing the clones for isolation\nExamine the cell culture dish for cell clones under an inverted microscope with a 10x or 20x objective.\n\tNOTE: The clones are made up of approximately 500-30,000 cells. However, it depends on the cell line used. A satisfactory colony should be separated from other cell colonies and be of average size as very large and outstanding clones can arise from more than one cell (Figure 1B).\nFind a suitable colony using the inverted microscope by carefully examining the dish and assessing the clones found. Place the marker at the location of the selected clone with the marker on the dish underneath. Simultaneously, mark the colony localization on the printed dish plan (Figure 1B).\n\tNOTE: Approximately 20-30 colonies from the dish should be selected. Sometimes, fewer cell clones are obtained, and all of them should be isolated in such cases.\n6. Preparation of glass cylinders\nBefore isolation of the clones, place the glass cylinders (6.4 mm in diameter and 8 mm in height) (Figure 1C) in the first glass Petri dish and autoclave them.\nAutoclave the second glass Petri dish.",
    "Apply a thin layer of silicone grease to the bottom of the second autoclaved glass Petri dish. Place the dish under a laminar flow cabinet and apply UV light for 30 min to sterilize the silicone grease.\n\tNOTE: Optionally, the silicone grease can be autoclaved.\nImmerse the autoclaved cylinders in a silicone grease-coated Petri dish. Now they are ready to isolate the clones.\nAfter isolating the clones, clean the cylinders in accordance with the rules applicable to the cellular material with which they are handled. In the case of genetic modification, use sodium hypochlorite for sterilization.\nWash the cylinders with xylene overnight to clear them of silicone grease.\nWash the cylinders with deionized water under a chemical hood to remove the xylene solution.\nPut the cylinders on a paper towel and let them dry.\nStore the cylinders in a glass Petri dish.\nPrepare the cylinders before the next use, starting from point 1 of this manual.\n7. Isolation of clones\nPrepare a 24-well plate containing 0.5 mL of prewarmed complete cell culture medium in each well.\nCarefully wash the transfected cells growing on a 150 mm dish three times with 15 mL of warm, sterile PBS. Carefully aspirate and discard the PBS.\nUse sterile tweezers to transfer cylinders that have grease on one side. Press the cylinders on the bottom of a culture dish at the sites of the marked clones to create isolated wells around the growing colonies of single-cell clone origin.\n\tNOTE: The cylinder should stick well to the bottom to prevent leakage of fluids.",
    "Add 50 µL of trypsin solution to each cylinder and incubate for a few minutes. Be careful not to damage the cells enzymatically. Process the colonies one by one. Remember to change the pipette tip for each cylinder so as not to contaminate the colonies with other ones.\n\tNOTE: The incubation time depends on the cell line being used and needs to be determined empirically. The trypsin solution can be pipetted up and down to facilitate cell detachment. Monitor cell detachment carefully using an inverted microscope. Following cell detachment, stop the trypsin activity by adding 50 µL of cell culture medium to each cylinder.\nImmediately transfer 100 µL of the cell suspension into the medium in one well of a 24-well plate.\n\tNOTE: Here, clone growth was continued with a selective antibiotic at a concentration of 0.5 µg/mL.\nMonitor the cell clones' growth in the 24-well plate, and when they reach 90% confluence, transfer them to a six-well plate. Follow the instructions in section 1 of the protocol; change only the volumes of trypsin (0.5 mL) and stopping medium (1.5 mL).\nMonitor the cell clones growing in a six-well plate, and when they reach confluence, transfer them to the T12.5 cell culture flask.\nObserve cell clones in the T12.5 cell culture flask, and when they reach confluence, subculture and count them with a suitable method, such as using an automated cell counter or hemocytometer. Freeze half of the cells in the medium containing 70% complete medium with selective antibiotic, 20% (v/v) FBS, and 10% (v/v) DMSO. Seed the rest of the cells on coverslips (12 mm x 12 mm) for immunostaining and into two wells of a six-well plate for gDNA isolation and lysate preparation.",
    "NOTE: In the case of the A375 cell line, seed 45,000 cells per coverslip and 450,000 cells per well of a six-well plate.\n8. Validation of the generated cell clones\nImmunostaining\n\tNOTE: Perform immunostaining on the cells to determine the level of expression of the protein of interest (POI). It is important to stain wild-type cells or control clones simultaneously as a control to be able to compare the expression levels of the POI (Figure 2A).\n\t\nAspirate and discard the cell culture medium.\nWash the cells growing on the coverslips three times with PBS.\nFix the cells by adding 0.5 mL of 4% formaldehyde solution to each well and incubate them for 20 min at RT.\n\t\tNOTE: Different antibodies can require different fixation methods.\nWash the cells twice with PBS.\nTo permeabilize the cells, incubate the coverslips in 0.1% Triton X-100 in PBS for 5 min at RT.\n\t\tNOTE: Different antibodies can require different permeabilization methods.\nWash the coverslips twice with PBS.\nPlace the coverslips in a staining chamber9.\nIncubate the coverslips in 1% (w/v) BSA in 0.1% (v/v) Triton X-100 in PBS solution for 30 min at RT to avoid unspecific binding of antibodies.\nRemove the solution by placing the coverslip with the edge on a piece of lignin using a needle and tweezers.\nPrepare a staining solution composed of primary antibodies in 1% (w/v) BSA and 0.1% (v/v) Triton X-100 in PBS. Drop 30 µL of solution on each coverslip and incubate them for 24 h at 4 °C in a moist humidity chamber.\n\t\tNOTE: Mouse anti-GSN antibody at 1:200 dilution was used in this experiment.\nRemove the solution by placing the coverslips with the edge on a piece of lignin using a needle and tweezers. Place the coverslips in a 24-well plate.",
    "Wash the coverslips three times with PBS for 5 min at RT.\nPrepare secondary antibodies and dyes in 1% (w/v) BSA and 0.1% (v/v) Triton X-100 in PBS solution. Drop 30 µL of solution on each coverslip and incubate them for 1 h at RT in the dark.\n\t\tNOTE: Use donkey anti-mouse-fluorescent labeled secondary antibodies 488 at 1:200 dilution. To detect F-actin and cell nuclei, we used phalloidin-Alexa Fluor 568 at 1:200 dilution and Hoechst 33342 at 1:1000 dilution.\nRemove the solution by placing the coverslips with the edge on a piece of lignin using a needle and tweezers. Place the coverslips in a 24-well plate.\nWash the coverslips three times with PBS for 5 min at RT in the dark.\nWash the coverslips once with deionized water.\nMount the coverslips using mounting medium on microscope glass.\nVisualize the cell staining using a confocal microscope to establish the level of the POI expressed in derived clones (Figure 2A).\nWestern Blot analysis\n\tNOTE: To confirm the lack, elevated level, or lowered level of POI expression in derived clones, perform the western blot analysis under standard conditions10. Analyze the wild-type cells or control clones simultaneously (Figures 2B,C).\n\t\nWash the cells growing in the well of a six-well plate three times with PBS.\nHarvest the cells using a scraper to a buffer of choice and vortex gently for 20 s. Perform three cycles of freezing (at -80 °C) and thawing (at 4 °C) of the sample.",
    "NOTE: Use either cytoskeletal-bound protein extraction buffer [10 mM Tris-HCl pH 7.4, 100 mM NaCl, 1 mM ethylenediaminetetraacetic acid (EDTA), 1 mM ethylene glycol-bis(2-aminoethyl ether)-N,N,N',N'-tetraacetic acid (EGTA), 1 mM NaF, 20 mM Na4P2O7, 2 mM Na3VO4, 1% (v/v) Triton X-100, 10% (v/v) glycerol, 0.1% (w/v) SDS, 0.5% sodium deoxycholate], or urea buffer [50 mM TRIS-HCl pH 7, 5% (w/v) SDS, 8.6% (w/v) sucrose, 74 mM urea, 1 mM DTT], both with addition of 1:100 protease inhibitor cocktail, 1:100 serine phosphatase inhibitor, and 1:100 tyrosine phosphatase inhibitor.\nCentrifuge the lysates at 12,000 x g for 5 min at 4 °C.\nDetermine the protein concentration in the samples (e.g., by BCA assay).\n\t\tNOTE: The assay depends on the compatibility with the buffer composition.\nTo conduct western blot analysis of the samples, load 30 µg of protein into each well on polyacrylamide gel (7%-15%).\nPerform SDS-PAGE electrophoresis and transfer the proteins to a nitrocellulose membrane.\nVisualize the level of the POI expression by staining the membrane with suitable antibodies (Figures 2B,C).\n\t\tNOTE: Mouse anti-GSN antibodies at 1:2000 dilution and mouse anti-GAPDH antibodies at 1:200 dilution were used. See our papers for details2,11. Exposure time should be long enough for faint signals not to be overlooked (Figure 2C).\ngDNA analysis\n\tNOTE: After estimation of the POI expression level in derived clones by microscopic and western blot techniques, genomic DNA should be analyzed. A comparison of the length of the PCR reaction product obtained on the gDNA template of the obtained clones provides information on whether the sequence of the GOI was edited (Figure 2D).\n\t\nWash the cells growing in the well of a six-well plate three times with PBS.\nHarvest the cells using a scraper in 1 mL of PBS.\nCentrifuge the cells at 5000 x g for 5 min at 4 °C.",
    "Aspirate and discard the supernatants.\n\t\tNOTE: Pellets can be stored for several months at -80 °C.\nIsolate gDNA from pellets of derived clones using a commercially available gDNA extraction kit.\nDesign PCR primers by annealing at least 300 bp upstream and downstream of the gRNA target at the CRISPR/Cas9 gene-editing site.\n\t\tNOTE: The following primers were used: Fwd: 5'gtgcagccaggatgagag3', Rev: 5'ccctgttactggtgcatc3'.\nCarry out PCR reactions using DNA Polymerase Master Mix according to the manufacturer's instructions.\n\t\tNOTE: The composition of the PCR reaction mixture is shown in Table 1, and thermocycler settings for the PCR reaction are presented in Table 2.\nAnalyze PCR products in 1% or 2% (w/v) agarose gel in Tris-acetate-EDTA buffer (40 mM Tris pH 8.0, 20 mM acetic acid, 1 mM EDTA).\nCompare the PCR product amplicon length of GSN KO clones to PCR product length of CTRL KO clones (203 bp; Figure 2D).\ngDNA sequencing\n\t\nDesign PCR primers by annealing to the sequences upstream and downstream from the sequences recognized by the gRNAs coded by CRISPR/Cas9(D10A) plasmids.\n\t\tNOTE: Design primers as follows: Fwd: 5'gatctcgagctcaagcttcgaattctgaacagtgcagacctttg3', Rev: 5'cgcggtaccgtcgactgcagaattcaattcaccagaacaggactaggc3'.\nCarry out PCR using High-Fidelity DNA Polymerase (such an analysis requires high accuracy during DNA amplification) and gDNA as a template.\n\t\tNOTE: The composition of the PCR reaction mixture is shown in Table 3, and thermocycler settings for the PCR reaction are presented in Table 4.\nLinearize the plasmid with a restriction enzyme within multiple cloning sites by incubating for 1 h at 37°C.\n\t\tNOTE: The composition of the restriction digestion reaction mixture is shown in Table 5. It does not matter what plasmid is being used. pACGFP-C1 was linearized with the EcoRI enzyme.\nEstimate the concentration of inserts and cut plasmid by agarose gel electrophoresis.\nPrepare DNA assembly reactions.",
    "NOTE: A traditional cloning method or any other method can be used.\nTransform competent bacteria (e.g., by heat shock procedure)12.\nIsolate plasmids (e.g., from six bacteria colonies per construct according to the manufacturer's instructions or to the protocol cited)13.\nCheck whether the insert has been successfully cloned into the plasmid and that its length is appropriate by restriction digestion and DNA electrophoresis.\n\t\tNOTE: If the selected colonies do not contain a plasmid with an insert, the plasmids should be isolated from subsequent bacterial colonies.\nConfirm gene editing by plasmid sequencing (Figure 3).\n\t\tNOTE: One should obtain at least two different results of DNA sequencing for each derived cell clone because of the existence of two alleles of genes. For multiploid cell lines (greater than 2 n), it is necessary to sequence more plasmids to obtain the sequence of all gene copies in the cell that are obtained. Isolate as many colonies as necessary until plasmids with the cloned sequences of all the copies of the gene are isolated. One can use a commercially available kit to estimate the number of loci for the studied gene.\nCompare the gDNA sequences obtained for the GSN KO and CTRL KO clones using a multiple sequence alignment program (Figure 3).\ntable:\n﻿0,1\nReagents,Volume\nDNA Polymerase Master Mix,7.5 µl\nForward primer (10 μM),1.5 µl\nReverse primer (10 μM),1.5 µl\nSterile water,3.5 µl\ngDNA,1 µl containing 10 ng gDNA\nTable 1. Composition of the PCR reaction mixture.\ntable:\n﻿0,1,2\nSteps,Temperature [°C],Time [minutes: seconds]\n1,95,04:00\n2,95,00:30\n3,57,00:30\n4,72,00:45\n5,\"go to 2, 35x\",X\n6,72,10:00\n7,8,∞\nTable 2. Thermocycler settings for the PCR reaction.\ntable:\n﻿0,1\nReagents,Volume\n5 x High-Fidelity DNA Polymerase Buffer,4 µl\ndNTPs (10 mM),0.4 µl\nForward primer (10 μM),1 µl\nReverse primer (10 μM),1 µl\nSterile water,12.4 µl\ngDNA,1 µl containing 10 ng gDNA",
    "High-Fidelity DNA Polymerase,0.2 µl\nTable 3. Composition of the PCR reaction mixture.\ntable:\n﻿0,1,2\nSteps,Temperature [°C],Time [minutes: seconds]\n1,98,00:30\n2,98,00:30\n3,61,00:30\n4,72,01:00\n5,\"go to step 2, 35 times\",X\n6,72,10:00\n7,8,∞\nTable 4. Thermocycler settings for the PCR reaction.\ntable:\n﻿0,1\nReagents,Amount\n10 x buffer,3 μl\nRestriction enzyme,1 μl\nSterile water,20.7 μl\nPlasmid,5.3 μl containing 5 μg of DNA\nTable 5. Composition of the restriction digestion reaction mixture.\n9. Assess the cell line's phenotypic heterogeneity\nPerform immunostaining of the cells to determine the level of POI expression.\nTake photos without magnification using a 60x oil immersion lens in a confocal microscope.\nTo establish the distribution ratio of cells with different levels, use the \"over- /underexposure\" tool that is usually available in most microscopic image analysis programs. Treat cells that show underexposed areas as producing the POI at a low level. Classify overexposed cells as cells with a high level of POI expression and the remaining cells as expressing POI at a medium level.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}