{
  "id": 3663,
  "origin_website": "Cell",
  "title": "Protocol for generation of lung adenocarcinoma organoids from clinical samples",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nEstablishment of LADC organoids from clinical tissues\nTiming: 2 h\nThis step describes the digestion of human lung adenocarcinoma (LADC) tissues and the derivation of LADC organoids.\nCritical: Some critical preparations should be made before digesting clinical tissues and passing organoids. (1) Cell culture plates should be prewarmed by being incubated in the incubator for at least 2 h before plating cells; (2) Thaw aliquoted Matrigel at 4°C.\nCollect the tissue sample from clinical site, put the sample on ice in 40 mL of ice cold adDMEM/F12+++ containing antibiotic-antimycotic (100 units/mL of penicillin, 100 μg/mL of streptomycin, and 250 ng/mL of Amphotericin B) in a thermocol ice box, and transfer the sample immediately to the laboratory. The patient provided informed consent and this study was approved by the Ethics Committee of the First Affiliated Hospital of Shenzhen University.\nPause Point: Tissue samples can be kept in adDMEM/F12+++ at 4°C for up to 12 h without significant loss of organoid outgrowth.\nWash the tumor sample twice with cold PBS and mince it into <2 mm pieces in a 10 cm tissue culture plate using scissors (Figure 1[href=https://www.wicell.org#fig1]A). Incubate the minced tissue with Digestion Medium I for 1 h at 37°C on a shaking platform (120 rpm). Centrifuge the digested tissues at 200 × g for 5 min at 22°C–25°C, discard the supernatant. (see Troubleshooting 1[href=https://www.wicell.org#sec6.1])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/350-Fig1.jpg\nFigure 1. Establishment of human lung adenocarcinoma organoid cultures\n(A) Photo of minced tumor tissue.\n(B) Images of tumor tissue before and after digestion with Digestion Medium I.\n(C) Photo of Matrigel domes plated in a well of a 6-well culture plate.\n(D) Representative bright-field images of LADC organoids after seeding. Scale bar, 100 μm.",
    "Note: Every 200 mg of minced tissue was placed in 5 mL of Digestion Medium I in a 15-mL falcon tube. The sample should look cloudy to the eye after digestion with Digestion Medium I (Figure 1[href=https://www.wicell.org#fig1]B).\nWash the pellet with 10 mL of adDMEM/F12+++, and centrifuge the tube again at 200 × g for 5 min at 22°C–25°C. Discard the supernatant.\nCritical: Cool down the centrifuge to 4°C after this step.\nIncubate the tissue with 5 mL of TrypLE Express + Y-27632 dihydrochloride (10 μM) for ∼10 min at 37°C on a shaking platform (120 rpm).\nAdd 10 mL of cold adDMEM/F12+++ supplemented with 20% FBS to stop the digestion. Centrifuge the tube at 200 × g for 5 min at 4°C. Discard the supernatant.\nAdd 2 mL of cold adDMEM/F12+++ and dissociate the cells by pipetting up and down for 5–10 times. Centrifuge at 200 × g for 5 min at 4°C. Discard the supernatant.\nNote: The dissociation status can be checked using a light microscope. This solution mainly consist of single cells after this step.\nResuspend the cell pellet in 10 mL of cold adDMEM/F12+++ and filter the cells through a 70-μM cell strainer to remove large undigested tissue clusters.\nCount the cells using a hemocytometer, collect 100,000 cells, and centrifuge at 200 × g for 5 min at 4°C. Discard the supernatant. (see Troubleshooting 1[href=https://www.wicell.org#sec6.1])\nNote: Every 100,000 cells were collected for being embedded in 300 μL of Matrigel and plated into one well of a 6-well culture plate.\nResuspend the cells in 30 μL of cold organoid culture medium first before mixing the cell suspension with Matrigel. Matrigel is viscous and it is difficult to thoroughly resuspend cells directly in Matrigel.",
    "Add 300 μL of Matrigel to the cell suspensions and mix well by gently pipetting up and down for several times.\nCritical: P1000 tips should be pre-wetted and pre-cold by aspirating and expelling cold sterile PBS + 0.1% BSA for several times before aspirating Matrigel to prevent the Matrigel from sticking to the tips.\nCritical: Mix well the cell suspensions with Matrigel slowly on ice, and do not introduce bubbles.\nAlternatives: Matrigel can be substituted with other extracellular matrix substrates such as Cultrex basement membrane extract BME (Trevigen 3432-001-01), Cultrex basement membrane extract BME type II (Trevigen 3532-001-02), or Geltrex basement membrane matrix (Gibco A1413202).\nDispense Matrigel-cell mixture as 50-μL droplets (∼15, 000 cells/drop) into one well of a 6-well plate. Usually, 6 droplets were plated into each well. For a visual guide, refer to Methods Video S1[href=https://www.wicell.org#mmc1] (Plating the Matrigel-cell mixture). The drops were solidified for 1 min right side up and for another 9 min upside down at 37°C and 5% CO2. If Matrigel-cell mixture are plated as smaller droplets, such as 30-μL droplets, the cell culture plate can be put upside down immediately after cell plating, and be placed in incubator for 10 min. Matrigel should form domes (Figure 1[href=https://www.wicell.org#fig1]C).\nCritical: P100 tips should be pre-wetted and pre-cold by aspirating and expelling cold sterile PBS + 0.1% BSA for several times before aspirating Matrigel-cell mixture.\nCritical: Cell culture plates should be prewarmed by incubating in the incubator for at least 2 h before cell plating.\nCritical: Plate the cells as quickly as possible to prevent the Matrigel from solidifying.",
    "Note: To make good use of the expensive culture medium, it is better to plate as more droplets as possible. However, plating more droplets takes more time, the Matrigel may solidify, and plated droplets may flatten out in the well.\nAfter the drops solidified, 2.5 mL of warm LADC organoid medium was added to each well. Fill each unused well with 2 mL of sterile PBS to prevent the evaporation.\nCritical: Do not pipette the culture medium directly onto the Matrigel domes, because this may break up the dome structure. The culture medium should be added gently down the sidewall of each well.\nCritical: The remaining unused wells should be filled with 2 mL of sterile PBS to reduce the evaporation of the medium.\n    Your browser does not support HTML5 video.\n  \nMethods Video S1. Plating the Matrigel-cell mixture, related to establishment of LADC organoids from clinical tissues, step 11\nMaintenance of LADC organoid cultures\nTiming: 2–3 weeks\nThis step describes the culture of LADC organoids until the initial passaging.\nThe medium was replaced every 3 days and fresh medium was constituted every week. Examples of morphology of LADC organoids after several days of culture are shown (Figure 1[href=https://www.wicell.org#fig1]D). (see Troubleshooting 2[href=https://www.wicell.org#sec6.3])\nCritical: Y-27632 dihydrochloride was added in the digestion mediums and culture medium to prevent dissociation-induced anoikis, but should be withdrawn from the organoid medium after the first week of culture.\nPassaging of LADC organoids\nTiming: 1 h\nThis step describes the passaging of LADC organoids using the mechanical dissociation method.\nScrap the Matrigel domes containing organoids (2–3 weeks after the culture) from one well of a 6-well cell culture plate using a P1000 pipette tip and transfer them into a 15 mL tube. Centrifuge at 200 × g for 5 min at 4°C.",
    "Critical: P1000 pipette should be pre-wetted by aspirating and expelling sterile PBS + 0.1% BSA for several times to prevent the cells from sticking to the pipette before use.\nNote: LADC organoids were usually passaged after the initial 2–3 weeks of culture and then passaged every 2–3 weeks at a 1:2–1:3 ratio in future maintenance. The exact timing for the passage of a specific LADC organoids culture is variable and is determined largely by the growth rate of organoids. Organoid cultures in which more than 30% of the organoids are larger than 200 μm in diameter or many organoids are about to connected to each other should be passaged (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/350-Fig2.jpg\nFigure 2. Passaging of LADC organoids\n(A) Representative bright-field images of LADC organoids need passaging.\n(B) Representative bright-field images of organoids after dissociation using the mechanical dissociation method. Scale bar, 100 μm.\nDiscard the supernatant and digest the Matrigel with 2 mL of TrypLE Express + Y-27632 dihydrochloride (10 μM) for ∼5 min at 37°C on a shaking platform (60 rpm).\nStop the trypsinization by the addition of 4 mL of cold adDMEM/F12+++ supplemented with 20% FBS. Centrifuge at 200 × g for 5 min at 4°C.\nDiscard the supernatant and wash the cell pellet with 10 mL of cold adDMEM/F12.\nCentrifuge at 200 × g for 5 min at 4°C and discard the supernatant.\nUse 10 mL Stripette Serological Pipets to dissociate the organoids into smaller clusters of cells through trituration in 10 mL of cold adDMEM/F12+++. Photos of organoids before and after pipette trituration were provided in the Figure 2[href=https://www.wicell.org#fig2].\nCritical: Serological Pipets should be pre-wetted by aspirating and expelling sterile PBS + 0.1% BSA for several times to prevent the cells from sticking to the pipette before being used to dissociate the organoids.",
    "Add 2 mL of cold adDMEM/F12 to rinse the 10 mL pipette to wash down cells stick to the pipette. Gently pipette the cells up and down for several times to further dissociate organoids.\nCentrifuge the tube at 200 × g for 5 min at 4°C and discard the supernatant.\nAdd 30 μL of cold organoid culture medium to the cell pellet and resuspend the cells. Place the tube on ice to cool down the solution.\nAdd 600–900 μL of Matrigel to the tube and performed the cell plating process as above mentioned (step 11).\nFor potential contamination, see Troubleshooting 3[href=https://www.wicell.org#sec6.5] and 4[href=https://www.wicell.org#sec6.7].\nCryopreservation of LADC organoids\nTiming: 30 min\nThis step describes the cryopreservation of LADC organoids\nCollect LADC organoids from one well of a 6-well cell culture plate, dissolve the Matrigel surrounding organoids using TrypLE Express, and dissociate the LADC organoids into smaller cell clusters as described in steps 14–19.\nCentrifuge the tube at 200 × g for 5 min at 4°C and discard the supernatant.\nAdd 2–3 mL of Recovery Cell Culture Freezing Medium, and resuspend the cell pellet. Transfer 1 mL into a 2 mL cryogenic vial, place the vial into a freezing container, and put the freezing container at −80°C.\nCritical: Freezing container should be at room temperature (22°C–25°C) before use.\nAlternatives: Freezing medium contains 90% FBS and 10% DMSO can also be used for the cryopreservation of LADC organoids.\nThe following day, transfer the frozen cryogenic vials to a liquid nitrogen tank for long-term storage.\nPause Point: Cryopreserved organoids can be stored in liquid nitrogen for >2 years.\nRevival of LADC organoids\nTiming: 30 min\nThis step describes the cryopreservation of LADC organoids.\nTransfer frozen cryogenic vials from liquid nitrogen storage to a 37°C water bath. Gently swirling the cryogenic vial.",
    "Transfer 5 mL of prewarmed adDMEM/F12+++ to a 15 mL centrifuge tube, and add thawed cells dropwise to the medium.\nCentrifuge the tube at 200 × g for 5 min and discard the supernatant.\nResuspend the cell pellet in organoid culture medium and performed the organoid culture as described in steps 9–12.\nTissue processing of LADC organoids for histology\nTiming: 2 days\nOrganoids are small cell clusters, miniature versions of tissues. Due to their small sizes, organoids cannot be treated in the conventional tissue processing method. This step describes the way we use to perform the tissue processing of organoids for histology. Briefly, the organoids are embedded in 2% agarose and subjected to dehydration, clearing, wax infiltration, and embedding.\nCollect LADC organoids from 6-well cell culture plates by scraping the Matrigel domes from the cell culture plate using a P1000 pipette tip.\nCentrifuge the tube at 200 × g for 5 min at 4°C and discard the supernatant.\nAdd 5 mL of cold adDMEM/F12+++ to the tube, put the tube on a shaking platform at 4°C for 10 min.\nCentrifuge the tube at 200 × g for 5 min at 4°C and discard the supernatant. Repeat this step for 3 times to dissolve the Matrigel surrounding organoids.\nCritical: Do not digest the Matrigel surrounding the organoids using the TrypLE digestion method, as this will destroy the organoids’ histological structure. It is acceptable to leave a little of Matrigel with the organoids.\nAdd 10 mL of 10% neutral-buffered formalin to fix the organoids for over 2 h at 22°C–25°C.\nPause Point: Organoids can be kept up to 1 week in 10% neutral-buffered formalin without affecting the staining results.\nCentrifuge the tube at 200 × g for 5 min and discard the supernatant.\nResuspend the organoids in 20–50 μL of PBS.",
    "Critical: Resuspend organoids in PBS first and mix the solution with 2% agarose, as 2% agarose is viscous and it is difficult to thoroughly resuspend organoids directly 2% agarose solution.\nMix 0.2 g of agarose with 10 mL of water in a 15-mL Falcon tube, and microwave for 30 s to melt the agarose.\nLet the agarose solution cool down to about 50°C. Gently mix the organoids with 50–100 μL of 2% agarose solution.\nCritical: Cut off the end of a P100 tip and use it to pipette the 2% agarose solution, as the agarose solution is viscous and difficult to pipette.\nAlternatives: Histogel can be used instead of the 2% agarose solution. Other alternatives could include 2% agar: 2.5% gelatin solution, 2% agarose: 2.5% gelatin or pregelatinized starch as embedding medium for small tissues or cell clusters.\nSlowly pipette the mixture of organoids and agarose onto a piece of parafilm. Put the parafilm upside down to let the agarose solution form a dome structure. For a visual guide, refer to Methods Video S2[href=https://www.wicell.org#mmc2] (Embedding the organoids in 2% agarose).\nAlternatives: Pipette the mixture of organoids and agarose onto a piece of parafilm on ice. Agarose will solidify rapidly and it is not necessary to put the parafilm upside down.\nLet the agarose containing the organoids to solidify for 10 min. The agarose dome can be enclosed in a cassette and subjected to the following process in a similar procedure to that of tissue samples (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/350-Fig3.jpg\nFigure 3. Processing of LADC organoids\n(A) Photo of organoids embedded in 2% agarose in an embedding cassette.\n(B) Photo of organoids embedded in wax.\n(C) Bright-field images of microscope slides containing lung adenocarcinoma organoids. Scale bar, 100 μm.\ntable:files/protocols_protocol_350_3.csv",
    "Critical: Xylene is a hazardous solvent and evaporates easily. Perform the steps in a fume hood while handling xylene. Xylene substitutes with reduced health and environment risks can also be used but have not been tested directly by the authors.\nEmbed the organoid sample in wax and cut sections at a thickness of 4–6 μm. Organoids-agarose mixture embed in wax looks like a small tissue (Figure 3[href=https://www.wicell.org#fig3]B).\nCritical: Organoids embed in paraffin are hardly be noticed by the naked eye, so you may need to pick the sections out of the water bath using a microscope slide and confirm the presence of organoids by observing the slides under light microscopy (Figure 3[href=https://www.wicell.org#fig3]C).\nPerform hematoxylin and eosin (H&E) staining and immunofluorescence staining of organoid sections to characterize LADC organoids.\n    Your browser does not support HTML5 video.\n  \nMethods Video S2. Embedding the organoids in 2% agarose, related to tissue processing of LADC organoids for histology, steps 41 and 42\nH&E staining of LADC organoids\nTiming: 1 h\nThis step describes the protocol we use to perform H&E staining of paraffin sections of the organoids.\nPerform H&E staining of paraffin sections in the following procedures.\ntable:files/protocols_protocol_350_4.csv\nNote: The slides should be rinsed with 95% ethanol for 10 s before staining in alcoholic eosin. For aqueous eosin, this step should be eliminated.\nMount with neutral resin and glass coverslips.\nCritical: The slides should not be allowed to dry during the process. Drying out will cause high background staining.\nCapture images under a light microscopy. LADC organoids should retain the histological characteristics of the original tumor (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/350-Fig4.jpg\nFigure 4. LADC organoids preserve the histopathological features of the original tumor tissues",
    "Histological H&E (A) and immunofluorescence images (B) of LADC organoids and the corresponding parental tumor. Paired LADC organoids and tumor tissue were stained for TTF-1, Napsin A, p40, and CK5. Nuclei were stained with DAPI (blue). Scale bar, 50 μm.\nImmunofluorescence staining of LADC organoids\nTiming: 2 days\nThis step describes the protocol we use to perform immunofluorescence staining of paraffin sections of the organoids.\nPerform the Deparaffinization and Rehydration step as described in step 46.\nAntigen retrieval: incubate slides in boiled 1× citrate-EDTA buffer for 20 min. Let the slides in citrate-EDTA buffer cool down to 22°C–25°C. Wash the slides with water for 5 min.\nCritical: This antigen retrieval method works well for the antibodies used in this study. The protocol used for antigen retrieval in other circumstances should be optimized depending on the target antigen, the antibody used, the type of tissue, and the fixation method.\nEncircle the section with a PAP pen. Make sure that the PAP pen dry completely and wash the slides 3 × 5 min in 100 mL PBS with gentle shaking (50 rpm).\nBlocking endogenous peroxidase: add 100 μL of endogenous peroxidase blocker (3% H2O2) to each encircled section, and incubate for 10 min at 22°C–25°C. Wash the slides 3 × 5 min in 100 mL of PBS with gentle shaking (50 rpm).\nBlocking: incubate the encircled sections with 5% BSA in PBS for 1 h at 22°C–25°C with gentle shaking (50 rpm).\nIncubation with primary antibodies: discard blocking buffer, incubate the sections in 100 μL of diluted primary antibodies in 3% BSA in PBS in a humidified chamber for ∼12 h at 4°C with gentle shaking (50 rpm).",
    "Incubation with secondary antibodies: wash the slides 3 × 5 min in 100 mL of PBS with gentle shaking (50 rpm). Incubate the sections in fluorescent-dye conjugated secondary antibodies diluted in 100 mL of PBS for 1 h at 22°C–25°C in the dark with gentle shaking (50 rpm). Wash the slides 3 × 5 min in PBS with gentle shaking (50 rpm).\nNote: Propidium iodide (PI) can be added in this step to stain nucleus.\nMount coverslip with a drop of mounting medium and seal coverslip with nail polish.\nCapture images under a confocal microscopy. LADC organoids should retain the expression profiles of specific markers expressed in the corresponding tumor (Figure 4[href=https://www.wicell.org#fig4]B)."
  ],
  "subjectAreas": [
    "Organoids",
    "Cell Biology",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}