{
  "id": 5353,
  "origin_website": "Bio",
  "title": "Heterochronic Pellet Assay to Test Cell-cell Communication in the Mouse Retina",
  "procedures": [
    "Notes: Pre-warm 0.125% trypsin and REM (see Recipes) to 37 °C prior to the experiment.This protocol was performed without sterile technique, but we took extreme caution to keep the cells and equipment as clean as possible. Dissociating E15.5 mouse retinaEnucleate the eyes from E15.5 CD1 embryos at room temperature (see Note 1 about mice).Place eyes in Petri dish and add cold 1x DPBS to cover (Figure 1A).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170124/20170124191455_2232.jpgFigure 1. Representative images of retina/retinal cells at different time points of the protocol. A. E15.5 eyes after enucleation; B. E15.5 retina after RPE removal; C. E15.5 retina sunk to the bottom of a 15 ml Corning tube; D. Trypsinizing the retinas in 37 °C water bath for 10 min; E. Dissociated retinal cells. F. Heterochronic retinal cell aggregate pelleted on the bottom of the 15 ml Corning tube (arrowhead); G. Cell pellet placed on the membrane (outlined by red dotted line); H. Cell pellet on membrane placed on the surface of REM (side view); I. Section of aggregate labelled with BrdU (red) and amacrine cell marker Pax6 (green). le: lens, re: retina, RPE: retinal pigment epithelium.Remove retinal pigment epithelium (RPE) and lens from eyes using Dumont forceps #55 and #5 (Figure 1B) (see Note 4). To remove RPE, grab a small area of the sclera with Dumont forceps #55, then stab onto the sclera with Dumont forceps #5 to cause incision. Grind the edge of the incision with both forceps, and slowly rip open the incision. Keep opening up the incision until sclera, cornea and optic nerve are removed. RPE should detach from retina along with cornea (Video 1). Keeping the eyes in cold 1x DPBS aids RPE detachment. Detach ciliary margin from the retina using the forceps. This loosens the lens attachment on the retina. Gently pull the lens out (Video 2).",
    "Replace 1x DPBS for every eye dissection to keep Petri dish and buffer cold.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Removing RPE from eye <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Removing lens from eye Transfer retinas into 15 ml Corning tube (with 10 ml of 1x DPBS at room temperature) (Figure 1C). Allow retinas to sink to bottom of the tube. (We recommend collecting ~20 retinas [2 eyes from each of 10 embryos] for this protocol. This will give approximately 8.0 x 106 cells.)Remove as much of the 1x DPBS as possible using a 5 ml pipet. Make sure not to pipet out the retinal tissue.Add 100 μl of 0.125% trypsin (pre-warmed to 37 °C) to retinas, and incubate in 37 °C water bath for 10 min (Figure 1D). Please note that retina will not break apart on its own. Trituration is required to break cell-cell interactions.Add 5 ml of 20% FBS/1x DPBS to stop trypsinization.Homogenize retinal cells completely by pipetting up and down several times (i.e., at least 30 times) using a 5 ml pipet (i.e., triturate; Figure 1E) until no clusters of cells are observed macroscopically. Make sure to triturate gently to avoid any air bubbles as bubbles can damage cells. We recommend using a Pipette pump to make sure trituration is gentle. (Video 3) (see Note 5)<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 3. Triturating trypsinized retinal cells Spin down cells at 520 x g for 5 min, then remove as much solution as possible.Re-suspend cells in 1 ml of REM (pre-warmed to 37 °C).Add 3 µl of 1 mg/ml BrdU into cell resuspension. Vortex gently and briefly to mix.Incubate cell resuspension for 1 h at 37 °C, 5% CO2 in water jacketed incubator.",
    "Dissociating P2 mouse retinaMeanwhile, dissect P2 mouse retinas by enucleating the eyes, and removing RPE and lens as described above (see Note 2 and Note 3 about mice).Transfer retinas into 15 ml Corning tube (with 10 ml of 1x DPBS at room temperature), keeping the two retinas from each mouse together in a separate tube as the genotype of each mouse is different. Allow retinas to sink to tube bottoms.Remove as much 1x DPBS as possible, then add 100 µl of 0.125% trypsin, and incubate in 37 °C water bath for 10 min.Stop the reaction by adding 5 ml of 20% FBS/1x DPBS, and triturate the cells by pipetting gently several times with 5 ml pipet and pipette pump.Spin down at 520 x g for 5 min, and remove solution as much as possible.Re-suspend the cells with 1 ml REM (pre-warmed to 37 °C).Preparation of heterochronic cell pelletRemove E15.5 CD1 dissociated cells from the incubator after 1 h incubation in BrdU.Spin down cells at 520 x g for 5 min, remove media as much as possible, then re-suspend in 1 ml REM. Repeat this step twice more to completely remove any trace of BrdU. Re-suspend the cells in 1 ml REM (pre-warmed to 37 °C).For both E15.5 and P2 cells, take 10 µl of the cell resuspension and mix with 10 µl trypan blue. Calculate the concentration of each cell resuspension using hemacytometer (calculation described in Figure 2). Make sure that the cells are dissociated completely (i.e., no clumps of cells or doublets). If you see any clumps, we recommend to re-dissociate the cells.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170124/20170124191628_3398.jpgFigure 2. Formula for calculating concentration of cell resuspension using hemacytometer. Note that the dilution factor is 2 as cell resuspension is diluted with trypan blue (10 μl + 10 μl).Dilute E15.",
    "5 cell resuspension to 1 x 106 cells/ml in REM. Aliquot 1 x 106 cells (1 ml) into 15 ml Corning tubes as a control. Re-dilute E15.5 cell resuspension to 0.5 x 106 cells/ml.Dilute P2 cell resuspension to 1.0 x 106 cells/ml in REM. Aliquot 1 x 106 cell (1 ml) into 15 ml Corning tubes. Add 100 µl (5.0 x 104 cells) of 0.5 x 106 cells/ml from E15.5 CD1 cell resuspension. Mix thoroughly by pipetting up and down several times with 5 ml pipet with pipette pump.Spin down at 520 x g for 5 min, then at 300 x g for 3 min to pellet the heterochronic cell mixtures (Figure 1F).Culturing (Video 4)Aliquot 1.5 ml REM per well of a 24-well plate.Cut the tip of the extra long transfer pipet with scissors, then flame the cut site to smoothen the surface. This will prevent damaging the pellet, and cells adhering to the pipet surface.After spinning down the heterochronic cell aggregate (from step C6), dislodge the aggregate from the bottom of the tube by taking some liquid off with a P1000 pipetman. Gently dispense liquid back into the tube at the edge of the pellet in order to dislodge the pellet (see Notes 6 and 7).Place dry Nucleopore Track-Etch Membrane on the sterilized Kimwipe sitting on sterile Petri dish lid. Place the tip of the Dumont forceps AA on the edge of the membrane to prevent membrane from rolling when cell pellet is transferred. Transfer cell pellet with extra long transfer pipet onto the centre of a dry Nuclepore Track-Etch Membrane (Figure 1G). Note that it is extremely critical to drop the pellet on the centre of the membrane.",
    "If pellet is dropped on the edge of the membrane, you could lose the cell pellet as it will flow towards Kimwipe and away from the membrane. Kimwipe should absorb the liquid leaving only the pellet on the membrane. Dry the membrane further by placing the membrane on a sterilized Kimwipe. Leave no trace of liquid on the membrane, as it will increase the chance of the membrane sinking in the media, which will result in cell death.Grab edge of the membrane with the cell pellet using Dumont forceps AA and gently place it onto the surface of the REM in one well of the 24-well plate (Figure 1H). Make sure the membrane is floating on the media, and does not sink as cells in the pellet will die if submersed. Incubate cell aggregate at 37 °C, 5% CO2 for 8 days in vitro (DIV). Replace ½ of the media (750 µl) every second day. Note that it is critical that the membrane is never submerged, so extra care is required when transferring plates in and out of the incubator.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 4. Transferring heterochronic cell aggregate onto the membrane Cell collection and analysis Replace REM with 1 ml of 1x DPBS to wash aggregate. Rinse with 1x DPBS two more times to remove trace of REM. Make sure cell pellets are not dislodged from the membrane.Remove as much 1x DPBS as possible, then add 500 µl of 4% PFA. Fix aggregate overnight at 4 °C. Note that a shorter fixation time may be required for certain antibodies.Wash aggregates three times for 10 min with 1x PBS, then immerse into 20% sucrose/1x PBS for cryoprotection overnight at 4 °C.Embed aggregates on membranes into optical cutting temperature compound (OCT) and freeze on dry ice (Figure 3).",
    "The membrane should be embedded perpendicular to the bottom of the mold to give a radial section through the retina. We recommend embedding replicate aggregates into the same block.Section aggregate on a cryostat at 10 µm, and collect sections on Superfrost Plus slides. We usually collect approximately seven sections per slide on up to 50 slides per block. Place the slides into a Standard microscope slide box. Slides can either be immunostained directly or stored. For storage, tape slide box with masking tape to close completely and prevent moisture from entering. Store box in -20 °C freezer.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170124/20170124192427_4634.jpgFigure 3. Orientation of heterochronic cell aggregate on the membrane and in the mold when embedding into OCTImmunostainingBring the slide box to room temperature for 30 min before opening, then remove slides.Place slides in pre-warmed 2 N hydrochloric acid and incubate at 37 °C for 20 min.Rinse slides in distilled H2O several times to remove as much hydrochloric acid as possible.Wash three times for 5 min in 1x PBS to equilibrate the pH of the slides.Remove slides from 1x PBS and apply paper towel on the edge of the slide to remove excess liquid.Apply 400 μl of blocking solution (10% horse serum/1x PBT) per slide and incubate at room temperature for 1 h. Make sure blocking solution is spread thoroughly to cover the entire surface of the slides.Remove as much blocking solution as possible, then apply 200 μl of primary antibodies diluted in blocking solution (see Table 1 for dilution) and place Parafilm to cover entire surface of the slides. Incubate at 4 °C overnight.Wash slides three times for 10 min in 1x PBS.Apply 200 μl of secondary antibodies (see Table 1) and DAPI diluted in 1x PBT (1:500 and 1:500 dilution respectively) and place Parafilm on top to cover solution.",
    "Incubate at room temperature for 1 h. Avoid incubating under light as fluorescence is light-sensitive.Wash slides three times for 10 min in 1x PBS.Apply Aqua-Poly/Mount and mount with coverslip.Take several images (3 or more) of sections of the retinal cell aggregates with upright fluorescence microscope (Figure 1I)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}