{
  "id": 6073,
  "origin_website": "Bio",
  "title": "Cobblestone Area-forming Cell Assay of Mouse Bone Marrow Hematopoietic Stem Cells",
  "procedures": [
    "Isolation and culture of Mouse Bone Marrow Mesenchymal Stromal CellsEuthanize an adult C57BL/6 mouse by CO2 asphyxiation in accordance with Institutional Animal Care and Use Committee (IACUC) protocol. Spray the mouse with 70% ethanol to disinfect. Incise the skin at hind leg portion and expose the muscles. Cut the pelvic joint and remove the hind leg. Cut the knee joint to separate femur from the lower portion of the hind limb. Remove the muscles of the femur and cut the ends of the femur to enable flushing. Transfer the femur into ice-cold wash buffer and flush gently with ice-cold wash buffer using a 1 ml syringe with a 22 G needle until all the cells are removed and the bone appears white. Repeat the same procedure for the other hind limb and combine the cells from both femurs.Spin BM cells in a 15 ml conical tube at 500 x g for 5 min at room temperature.Lyse RBCs using red blood cell lysis buffer. To lyse RBCs, suspend the cells obtained from two femurs in 2 ml wash buffer and add 4 ml of red blood cell lysis buffer. Mix the cells by inverting few times every min for 10 min. Centrifuge the tube at 400 x g for 6 min at room temperature.Discard the supernatant and resuspend the BM cells in 10 ml wash buffer and centrifuge at 400 x g for 10 min to remove the lysed red blood cells. Repeat this process for one more time.Remove the excess wash buffer from the cell pellet and add 10 ml of MSCs media to the cell pellet. Pipet the media gently to evenly mix the cell pellet.Plate 1 x 107 cells in a 100 mm tissue culture dish with 10 ml of MSCs media.",
    "Incubate the cells at 37 °C with 5% CO2 in a standard humidified tissue culture room incubator. Mesenchymal stromal cells start to adhere to the plastic dish while the rest of the BM cells float in the media.Replace the media with fresh MSCs media after three days in culture and culture the cells for 10 to 12days.During the first media change, most of the suspending cells are removed and MSCs start to adhere to the bottom of the dish. Subculture the MSCs from one 100 mm dish into a 35 mm dish using trypsin-EDTA. The cells are devoid of any other types of BM cells by the second passage and are ready for the assay from passage 3 (Figure 1).Since MSCs do not have high dividing potential, split the cells into 1 to 2 ratios each time when sub-cultured to subsequent passages and maintain in 35 mm dishes until assay is performed. MSCs can be passaged up to five passages without losing MSC function.Cells can be subsequently passaged to 96-well flat-bottom plates when ready to perform the assay.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180501/20180501205123_7460.jpgFigure 1. Mouse Bone Marrow Mesenchymal stromal cells. Plastic adhered MSCs were shown in phase contrast image. Scale bar represents 50 µm.Characterization of Mouse Bone Marrow Mesenchymal stromal cellsTo obtain pure MSCs, sub-culture plastic adherent cells for at least three passages. MSCs are multipotent cells and can be induced to differentiate into osteoblasts, adipocytes, and chondrocytes. However, MSCs in culture consist of a mix of osteoblasts, adipocytes, and chondrocytes and express markers unique to them. It is critical to evaluate the functionality of MSCs before performing CAFC since the loss of a gene or exposure to various environments can give rise to differences in differentiation of MSCs.",
    "To identify the multipotential of MSCs, plate cells on chamber slides and stain with antibodies Osteopontin, Fatty acid binding protein 4 (Fabp4), and Collagen II to identify osteoblasts, adipocytes, chondroblasts respectively using the Mouse MSC Functional Identification Kit.Immunofluorescence of MSCs: Rinse MSCs once with 1x DPBS and fix with 4% paraformaldehyde (PFA) diluted in 1x DPBS for 10 min at room temperature. Permeabilize the cells with 0.2% Triton X-100 made in 1x DPBS for 3 min and block with blocking buffer DPBS blocking solution for 30 min. Gently remove the blocking solution and follow overnight incubation at 4 °C with primary antibody. Adipocyte marker: Goat Anti-Mouse FABP4 Antigen-affinity Purified Polyclonal Antibody. Chondrocyte marker: Sheep Anti-Mouse Collagen II Antigen-affinity Purified Polyclonal Antibody. Osteocyte marker: Goat Anti-Mouse Osteopontin Antigen-affinity Purified Polyclonal Antibody. Dilute the primary antibodies to 1:500 in 1x DPBS containing 0.1% BSA. Wash the slides with 1x DPBS containing 0.1% BSA for three times at room temperature with each wash for 10 min. Incubate with secondary antibodies diluted to 1:1,000 in 1x DPBS containing 0.1% BSA for at least 2 h at room temperature. Use Donkey Anti-Goat and Donkey Anti-Sheep IgG secondary antibodies.Wash the slides with 1x DPBS containing 0.1% BSA for three times at room temperature with each wash for 10 min. After the final wash, add the nuclear dye DAPI at 1:2,000 in 1x DPBS for 5 min to evaluate nuclear morphology. Wash further 3 times with 1x DPBS for 5 min each wash.Remove excess DPBS and mount slides with Vectashield mounting media.Acquire images using any immunofluorescence microscope at 20x objective (Figure 2). The ratio of adipocytes:chondrocytes:osteocytes from a wildtype C57BL/6J mice is 60:20:20. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180501/20180501205314_7301.jpgFigure 2.",
    "Representative images of Mouse BM MSCs stained with antibodies Fabp4, Collagen II, and Osteopontin to identify adipocytes, chondroblasts, and osteoblasts lineage cells respectively present in bone marrow derived mesenchymal stromal cells. Scale bar represents 10 µm.Isolation of Mouse Bone Marrow Hematopoietic stem cells (HSCs)Isolate HSCs from Bone marrow mononuclear cells (BMMCs) using flow cytometry after staining with cell surface markers negative for Lineage cocktail and positive for Sca-1, c-Kit (Lineage Negative, Sca-1 Positive, c-Kit Positive, LSK). HSCs are also termed as LSKs. Obtain BM cells from mouse femurs by gently flushing cells out the bones using wash buffer.Wash BM cells twice with wash buffer by centrifugation at 500 x g for 5 min at room temp.Resuspend the cells with 3 ml of wash buffer and gently overlay on 6 ml of Ficoll-Paque PLUS in a 15 ml conical tube. Carefully layer the diluted cell sample onto the Ficoll-Paque PLUS solution and take precautions not to mix the cells and Ficoll.Centrifuge at 400 x g for 30 min at room temperature with slow acceleration and brake turned off.Pipette out upper layer containing plasma and platelets using a sterile pipette, leaving the BMMCs layer undisturbed at the interface.Transfer the layer of BMMCs to a sterile centrifuge tube using a sterile pipette.Wash the BMMCs with wash buffer once.Pellet BMMCs and first stain with a lineage (Lin) cocktail of antibodies (biotinylated anti-mouse antibodies directed against CD3e, CD11b, CD45R/B220, Gr-1, and Ter119). Add 2 μl of each antibody to stain one million BMMCs. Incubate the cells with antibodies at 4 °C for 20 min. Wash the cells with bone marrow wash buffer one time and pellet the cells. Further, add 5 μl of fluorochrome-conjugated Streptavidin to bind to lineage antibodies.Wash BMMCs once with buffer and pellet the cells.",
    "Further, add 2 μl of Sca-1 and c-kit conjugated with fluorochrome to stain one million BMMCs.Wash Triple (Lineage, Sca-1, c-kit) stained BMMCs couple times and suspend one million cells in 1 ml of wash buffer for flow sorting.Flow sort on a BD FACS Aria II with a FACSDiva software.Analyze the Flow cytometric data to check the quality of LSK cells using the FlowJo software as displayed in pseudo color plot (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180501/20180501205513_5086.jpgFigure 3. Gating strategy to identify and isolate Hematopoietic stem cells from Mouse Bone Marrow. Bone Marrow cells flushed from mouse femurs were subjected to Ficoll-Paque PLUS separation to isolate Bone Marrow Mono Nuclear Cells and then stained with HSC cell surface markers to identify and cell-sort using the flow cytometer.Cobble stone area forming cell assayPrior to isolation of LSK cells using flow cytometry, culture MSCs to complete confluence in a 35 mm culture dish or a 6-well plate.MSCs between passages 3 to 6 should be used for plating LSK cells.On the day of assay, sort LSK cells from Bone marrow as described (Procedure C) using flow cytometry.Pellet the isolated LSK cells and resuspend with MSCs media. Replace the media in the culture dish growing MSCs in media suspended with LSK cells. Approximately, plate 2 x 103 LSK cells on confluent MSCs in a 35 mm dish.Co-culture the cells at 37 °C, 5% CO2 in a humidified incubator to allow the precursor cells to form hematopoietic clones under the stromal layers.Cobblestone areas start to appear as early as 5 days and can be predominantly seen by 7 days.Feed the culture two times a week by replacing half of the medium. Image the phase-dark hematopoietic clones using a phase contrast microscope (Figure 4) at 10x objective and installed with software like CellSens software from Olympus.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180501/20180501205657_9673.jpgFigure 4.",
    "Representative image of Cobblestone area forming cell assay. HSCs are cultured on a confluent layer of MSCs to form the cobblestone areas. Yellow arrow–phase dull cells (true stem cells growing under the MSCs layer), Blue arrow–phase bright cells (stem progenitor cells suspended or loosely attached to MSCs), and Red arrow–MSCs (Confluent cell layer adhered to the plastic dish). Scale bar represents 50 µm.CAFC limited dilution assayLimiting dilution assay (LDA) is performed in 96-well flat-bottom plates with confluent MSCs and dilutions of LSK cells (0, 10, 30, 90, 270, and 810) differing with a factor of 3 in each well. Plate MSCs in 10 wells in a flat-bottom 96 well plate per each dilution (Figure 5A). No LSK cells are added to 0 dilution wells and they serve as negative control.Perform three different LDA experiments with independently derived MSCs from bone marrows of mice. Score the well as ‘positive’ if it contains one or more cobblestone areas and ‘negative’ if contains no cobblestone areas. Cobblestone area is at least 6 cells (in proximity to each other) growing underneath the stroma. Although cobblestone-like cells appear as phase dark, these cells appear as nonrefractile in 96-well plates because of the deflection of light. Only dilutions with both negative and positive wells are informative for frequency analysis (Figure 5B).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180501/20180501205824_5734.jpgFigure 5. CAFC Limited dilution assay. A. CAFC assay performed in a 96-well flat-bottom plate. Flow sorted LSK cells were counted and plated on confluent MSCs in a flat-bottom 96-well plate. Each assay was performed in triplicates. Representative images of the cobblestones formed in wells with no LSK cells, 90 and 270 LSK cells. Scale bars represent 100 µm. A portion of the cobblestone area was magnified; Scale bar represents 50 µm.",
    "Phase dull cells were identified in a dotted circle while phase bright cells were identified in a solid circle. Both phase dull and phase bright cells need to be present to call it a true cobblestone area. B. Phase dull cell areas were measured in each well as shown in above panel. Percentage of the well covered with cobblestone areas was counted and plotted against the no of LSK cells plated in each well. Cultures were maintained for two weeks and the areas were counted at the end of each week."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}