{
  "id": 9757,
  "origin_website": "Jove",
  "title": "Dissection of a Mouse Eye for a Whole Mount of the Retinal Pigment Epithelium",
  "procedures": [
    "1. Remove Extraneous tissue from the outside of the eye\nPour 1X PBS into the lid of a 35mm dish. The level should be just below the lip of the lid.\nUsing straight forceps, transfer eye(s) from the storage tube to the 35mm dish. Eyes are submerged in PBS for two reasons: 1. The extraneous tissues will \"float\" away from the eye so you can see and remove them easily, and 2. During dissection, the eye will naturally maintain its spherical shape while in suspension, allowing you to work with this shape rather than against it.\nUsing both pairs of angled forceps (45° and 15°), gently remove as much muscle and connective tissue as possible, pulling the tissue against the grain (i.e. toward the cornea). Some connective tissue will remain. Effort should be made to squeeze the eyeball as little as possible.\nTrade your 15° forceps for spring scissors. While holding the eye steady with 45° forceps, use the spring scissors to cut away remaining muscle and connective tissue, as well as the optic nerve. *Tip: Use the outside edge of the scissors to push the tissue against the grain (toward the corneo-scleral divide) and then trim. Continue until all extraneous tissue has been removed from the eye.\n2. Remove the cornea and lens\nWith the cornea facing up, use the 45° forceps to pinch up a small fold in the center of the cornea.\nUsing the spring scissors, make a small incision at the base of the flap. Let go of the flap.",
    "Holding the eyes still with your forceps, insert the lower scissor blade into and perpendicular to the incision and make a cut toward the corneo-scleral divide. Try to keep your lower blade under the iris so both the cornea and iris are cut. Do not cut all the way to the corneo-scleral divide. Keep scissors inserted in the eye.\nUsing your 45° forceps, carefully rotate the eye so that your scissors are parallel to the corneo-scleral divide and make a small cut. Slowly rotate the eye 360°, making small incisions all the way around. Again, try to keep the lower blade of your spring scissors under the iris so both the iris and cornea are cut. Lift the iris and cornea away from the rest of the eye and discard them.\nTilt the eye on its side and press down gently on the posterior half of the eye, forcing the lens out. Discard the lens. The inside of the remaining eyecup is lined by the neural retina, which should look smooth and opaque.\n3. Quarter the resulting eyecup, resulting in a 4-\"petaled\", flower-like structure\nThe eye should be positioned such that the opening of the eyecup is perpendicular to your body. Use your 45° forceps to steady and position the eyecup.\nHolding your spring scissors in front of you so they are perpendicular to your body, insert the lower blade of your spring scissors into the top edge of the open eye cup. Using your 45° forceps, carefully align the eye cup so that a single, straight cut can be made from the corneo-scleral divide toward the optic nerve head. All cuts should be perpendicular to the corneo-scleral divide and unless specified, should go as close to the optic nerve head as possible without cutting into it.",
    "Rotate the eyecup 180°, maintaining its perpendicularity with your body. Use technique in step 3.2 to make a second perpendicular cut.\nRotate the eyecup and repeat the technique described in 3.2 to make two more cuts. All four cuts should be as close to 90° apart as possible. Keep in mind that the eye is not perfectly spherical so there will be some variability.\n4. Cut each of the four \"petals\" in half, resulting in an eight-petal flower-like structure\nTransfer the quartered eyecup from the 35mm dish to a clean slide. With the eyecup facing up, scoop under it with the 45° forceps. Carefully lift it out of the liquid and place it on a clean slide.\nUsing both pairs of angled forceps, gently open out the eye, with the neural retina facing up. DO NOT REMOVE THE NEURAL RETINA- it helps the eye maintain some of its spherical shape so you are not working against it. It also protects the RPE from being accidently damaged in the following procedures.\nRotate the slide until one of the petals is perpendicular to your body.\nUse your 15° forceps, gently grab the corner of the petal. The corner of the petal should be cornea, not neural retina or RPE. Lift up on the corner gently, allowing it to retain its curvature.\nInsert the bottom blade of your spring scissors between the petal and the slide. Line up your scissors such that a single, straight, perpendicular cut can be made from the corneo-scleral divide toward the optic nerve head. Cut as close to the optic nerve head as possible without cutting into it. Let go of the petal, allowing it to lie on the slide.\nRotate the slide 90°, so that the next petal is perpendicular to your body. Repeat step 4.5.",
    "Repeat steps 4.5 and 4.6 twice more. The resulting structure should look like an eight-petal flower.\n5. Remove the neural retina\nPipette 100-200 μL of 1X PBS onto the specimen. This will prevent the neural retina from sticking as you peel it off of the RPE.\nTypically the neural retina is loosely attached to the RPE. However, it does take practice and skill to remove only the neural retina and not the RPE. Gently grasp a petal of the neural retina with one pair of angled forceps while stabilizing (holding down) the rest of the eye with the other pair of angled forceps. Pull the neural retina away from the rest of the eye. Continue this procedure until the entire neural retina has been removed. *Tip: stick the tip of your 15° forceps into the optic nerve head to anchor the eye. Then use the 45° forceps to sweep up underneath the neural retina and lift it off and away. It is usually best to lift the neural retina from the optic nerve head toward the corneo-scleral divide. Be sure to pull away any loose remnants of the iris. The iris is quite sticky and can otherwise get stuck to the RPE.\nRinse the specimen with 1X PBS. Pipette 100-200 μL of 1X PBS into the specimen and suck it back up. Discard the PBS. Repeat as necessary to remove dust and debris.\n6. Mount you specimen(s) on a slide\nPipette 80-90 μL of 90% glycerol onto a new slide in a rectangular shape. Use the side of the pipette tip to make an even, rectangular smear of glycerol. (This is the procedure for mounting two RPE on one slide.)\nInsert the lower arm of 15° forceps under the specimen. Gently lift the specimen off the dissecting slide.",
    "Slowly lower the specimen into the glycerol. Gently wiggle the forceps as you pull them out from under the specimen.\nRepeat steps 6.1-6.3 for the other specimen.\nRotate the slide so that the long side is perpendicular to your body. Hold your cover glass at a 45° angle to the slide so that it is touching the slide. Move it toward the glycerol smear until they touch. Maintaining contact between the cover glass and slide, slowly move the cover glass away from the smear, toward the edge of the slide. Line up the long sides of the slide and the cover glass so that they are parallel. Hold the corners of the cover glass between your thumb and forefinger.\nPick up the 15° forceps in your other hand. Cradle the upper (free) edge of the cover glass in the crook of the arm. Very slowly, lower the cover glass. When contact is made between the cover glass and the glycerol, stop and wait for the glycerol to migrate. Repeat this lowering and waiting until the RPE whole mounts are fully covered. This is to prevent the highly viscous glycerol from capturing air bubbles. DO NOT PUSH DOWN ON THE COVERGLASS - the glycerol will squeeze out from under it, making adhesion very poor.\nWith clear nail polish, paint around the perimeter where the cover glass and slide meet.\nPlace the slide on top of an empty rack to dry.\n7. Representative Results:\nThe result of this procedure should be a structure that looks like a flower and should be fairly symmetrical.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2563/2563fig1.jpg",
    "Figure 1. Whole mount RPE from a wildtype C67Bl/6J mouse. RPE from black or agouti animals should be dark brown in color and should have a smooth surface. It is normal to notice undulations in the topography of the petals. The pigmentation on any give specimen may be somewhat variable, due to variable density of pigmentation of both the RPE and the underlying choroid. White arrows point to hypopigmented \"channels\"- this is normal and is due to the underlying vasculature of the eye. Blue arrow points to physical damage to both the RPE and the underlying choroid.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2563/2563fig2.jpg\nFigure 2. Whole mount RPE from a dilute mouse. Specimens harvested from dilute animals can range in color from nearly transparent to café au lait and any one specimen is like to have variability within it, indicated in black circles here. In general, RPE harvested from younger animals are lighter and those harvested from older animals are darker. Black arrows indicate some of the underlying vasculature, which appears hypopigmented.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2563/2563fig3.jpg\nFigure 3. Phalloidin staining can be used to detect physical damage to the RPE. Phalloidin staining clearly outlines the cell membranes, showing the hexagonal shape of the epithelium. (A) Example from a black mouse. (B) Example from a dilute mouse.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2563/2563fig4.jpg",
    "Figure 4. A poorly dissected RPE from a dilute mouse. (A) Brackets indicate margins of cornea that are too wide, which can cause buckling and/ or folding. Within the black circle you can see excessive amounts of extraneous tissue that have not been removed from the back of the eye. They are particularly obvious because the sample is from a dilute animal. The petal on the bottom left is partially folded over. (B) This whole mount has the appearance of a pinwheel. Black arrows indicate some of the cuts that were made. Many of the cuts from the corneo-scleral divide toward the optic nerve head are not in line with the diameter. (C) Black arrows indicate how the cuts should have been made, in line with the diameter and perpendicular to the tangent.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}