{
  "id": 17828,
  "origin_website": "Jove",
  "title": "Simultaneous Flow Cytometric Characterization of Multiple Cell Types Retrieved from Mouse Brain/Spinal Cord Through Different Homogenization Methods",
  "procedures": [
    "All methods described here have been approved by the Institutional Animal Care and Use Committee (IACUC) of Dana Farber Cancer Institute (protocol number 16-024).\n1. Preparation of solutions needed for the experiment\nPrepare 1x Hank’s balanced salt solution (HBSS) by diluting 10x HBSS with sterile water. Pre-chill the solution on ice. At least 25 mL of solution are needed for each sample.\nPrepare isotonic Percoll solution (IPS) by mixing 10x sterile HBSS 1:10 with density gradient medium (i.e., Percoll). Pre-chill on ice.\n\tNOTE: IPS can be stored for up to 30 days at 4 °C.\nPrepare flow cytometry (FACS) blocking (BL) solution (1% bovine serum albumin [BSA], 5% fetal bovine serum [FBS] in phosphate-buffered saline [PBS]). Pre-chill on ice.\n2. Animal euthanasia by intracardiac perfusion and tissue dissection\nNOTE: Eight-week-old C57BL/6J mice, either sex, were used in the experiments. Perfusion with PBS solution is performed to eliminate blood contamination from organs, before proceeding with tissue digestion.\nAnesthetize the mouse by using a mixture of ketamine/xylazine (90−200 mg/kg ketamine, 10 mg/kg xylazine). Place the mouse on its back and tape each limb down to the support. Verify adequate depth of anesthesia by checking the withdrawal reflex.\nMake a midline skin incision at the level of the thoracic inlet to expose the sternum. Use forceps to grasp the tip of the sternum, then make one 1 cm incision on each side of the rib cage. Finally cut through the diaphragm and open the sternum widely enough to visualize the heart.\nUse forceps to gently grasp the heart by the right ventricle and lift it to the midline and slightly out of the chest.\nInsert a 23 G butterfly needle into the tip of the left ventricle, towards the aorta and hold firmly.",
    "Start the perfusion with 1x PBS. Pierce through the right auricle using scissors to allow the perfusate to exit the circulation. Set the flow rate of PBS at 3 mL/min. Perfuse with at least 15 mL of 1x PBS to ensure tissues are clear.\n\tNOTE: Blanching of the liver and mesenteric blood vessels are signs of good perfusion. If necessary, the volume of prefusion can be increased up until the fluid exiting the heart is clear of blood, at which point the flush line can be stopped.\nAfter perfusion, sever the brain from the spinal cord and remove the brain from the skull with scissors and forceps. Remove the fur to increase visibility and control during the dissection and to avoid carrying over hair contaminants. Flush the spinal cord out of its column by using a 3 mL syringe filled with PBS.\nTransfer each tissue in a well of a 6-well multi-well plate prefilled with 2 mL of ice-cold 1x HBSS and keep on ice until digestion.\nDivide the brain and the spinal cord into two halves, along the longitudinal line.\n\tNOTE: One half of each tissue is homogenized (see sections below) to allow flow cytometric analyses; the other half can be assigned to different processing for alternative analyses (e.g., dipped in paraformaldehyde fixative solution for histology).\n3. Enzymatic digestion of brain and spinal cord\nNOTE: Volumes described in this section are enough for digestion of one-half brain or spinal cord.\nUse a pair of scissors to mince the tissues into 1−2 mm thick pieces.",
    "Cut the tip of a 1000 µL pipette with a pair of scissors to make it sufficiently large to allow the collection of the tissue pieces. Pre-rinse the pipette tip with 1x HBSS. Then use the pipette to transfer the 2 mL of HBSS solution containing the minced tissue to a 15 mL conical tube.\n\tNOTE: Pre-rinsing of the pipette tip is important to prevent stickiness of the tissue pieces inside the tip.\nWash the well with additional 2 mL of ice-cold 1x HBSS and transfer the solution to the corresponding 15 mL conical tube containing the tissue pieces.\nCentrifuge each sample for 5 min at 250 x g at 4 °C.\nPrepare enzyme mix 1 of the neural tissue dissociation kit (NTDK; Table of Materials) by mixing 50 µL of enzyme P with 1900 µL of buffer X per sample. Warm enzyme mix 1 at 37 °C in a water bath. Incubate enzyme mix 1 at 37 °C for at least 10 min before use in order to allow for the full activation of the enzyme.\nAspirate the supernatant from the 15 mL conical tube and add 1.95 mL of enzyme mix 1 to each sample. Gently vortex to make sure the pellet is resuspended.\nIncubate the samples on a wheel or shaker for 15 min at 37 °C.\nIn the meanwhile, prepare enzyme mix 2 of the NTDK by mixing 10 µL of enzyme A with 20 µL of buffer Y per sample; pre-warm the solution at 37 °C in a water bath.\nAt the end of the incubation with enzyme mix 1, add 30 µL of enzyme mix 2 to each sample.\nGently mix the samples by pipetting up and down with a 1000 µL pipette tip pre-rinsed with 1x HBSS.",
    "Incubate the sample on a wheel or shaker for 15 min at 37 °C.\nAfter incubation, add 10 mL of ice-cold 1x HBSS to each tube to inactivate enzyme mix 1 and enzyme mix 2.\nCentrifuge each sample for 10 min at 320 x g at 4 °C.\nDiscard the supernatant; add ice-cold 1x HBSS to each tube up to a final volume of 7 mL and gently resuspend the pellet by vortexing.\nContinue to section 5 for debris removal.\n4. Mechanical homogenization of brain and spinal cord\nNOTE: Volumes described in this section are enough for homogenization of one-half brain or spinal cord. The protocol described in this section can be used as a method alternative to the one described in section 3, depending on user need as discussed below.\nPre-chill the glass mortar of the Dounce tissue grinder (Table of Materials) set on ice.\nAdd 3 mL of pre-chilled 1x HBSS to the mortar.\nTransfer the tissue (brain or spinal cord) from the well of the 6-well plate into the glass mortar making sure it is dipped in 1x HBSS and sits at the bottom of the mortar.\nGently smash the tissue with 10 strokes of pestle A followed by 10 strokes of pestle B. Transfer the homogenized mix into a new 15 mL conical tube.\nFill the tube to a final volume of 10 mL by using pre-chilled 1x HBSS and centrifuge for 10 min at 320 x g at 4 °C.\nAspirate the supernatant and add ice-cold 1x HBSS to each tube up to a final volume of 7 mL and gently resuspend the pellet by vortexing.\nContinue to section 5 for debris removal.\n5. Debris removal",
    "NOTE: Removal of debris, composed mainly of undigested tissue and myelin sheaths, is a critical step to allow efficient staining of the tissue homogenate for subsequent flow cytometric analyses.\nFilter each sample through a 70 µm cell strainer to remove any undigested tissue chunk. This step is particularly important especially when working with spinal cord tissues since these samples are more likely to contain undigested nerve fragments or meninges that could affect the subsequent steps.\nMake sure that the final volume is 7 mL in each sample tube. If not, fill with ice-cold 1x HBSS up to 7 mL.\nAdd 3 mL of pre-chilled IPS to each sample to make a final volume of 10 mL of a solution containing density gradient medium at 30% final concentration. Gently vortex the samples to make sure they are homogenously mixed.\nCentrifuge samples for 15 min at 700 x g at 18 °C making sure to set the acceleration of the centrifuge to 7 and the brake to 0.\n\tNOTE: Centrifugation should take approximately 30 min.\nDelicately remove the samples from the centrifuge.\n\tNOTE: A whitish disk composed of debris and myelin should be visible floating on the surface of the solution. A pellet (containing the cells of interest) should be visible at the bottom of the tube.\nCarefully aspirate all the whitish disk of debris and then the rest of the supernatant making sure not to dislodge the pellet. Leave about 100 µL of solution on top of the cell pellet to avoid the risk of inadvertently dislodging it.\nAdd 1 mL of FACS BL, resuspend the pellet by pipetting up and down with a 1000 µL pipette tip and transfer samples to 1.5 mL tubes.\nCentrifuge for 5 min at 450 x g at room temperature (RT).",
    "Gently aspirate the supernatant and resuspend the pellet in appropriate buffer compatible with downstream analyses (see section 6 for the protocol used for flow cytometric evaluation of multiple cell types).\n6. Staining for flow cytometric evaluation of multiple cell types\nResuspend the pellet obtained in step 5.9 with 350 µL of FACS BL. Add Fc-block to each sample at a final concentration of 5 µg/mL.\n\tNOTE: At least 100 µL of the sample should be used for one staining, to make sure to process enough cells to allow reliable analyses.\nIncubate the sample for 10 min at 4 °C before proceeding with the staining.\nPrepare an antibody mix according to Table 1.\nAdd antibody mix to each tube, vortex for 5 s and incubate the samples for 15 min at 4 °C in the dark.\nAdd 1 mL of PBS to each tube, vortex and centrifuge for 5 min at 450 x g at RT.\nMeanwhile prepare streptavidin mix according to Table 1.\nDiscard the supernatant and resuspend the pellet in the streptavidin mix prepared in step 6.6. For each sample, use the same volume as the one used for the staining in step 6.4.\nVortex for 5 s and incubate the samples for 10 min at 4 °C in the dark.\nAdd 1 mL of PBS to each tube, vortex and centrifuge for 5 min at 450 x g at RT.\nDiscard the supernatant and resuspend the pellet in FACS BL. Use 300 µL of FACS BL for each 100 µL of sample stained.\nAdd 7-amino-actinomycin D (7-AAD) solution to each sample. Use 5 µL of 7-AAD for each 300 µL of sample prepared in step 6.10.",
    "Store samples at 4 °C in the dark until cytofluorimetric analysis. Perform the analysis within 16 h from sample preparation, to guarantee >60% cell viability.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}