{
  "id": 11718,
  "origin_website": "Jove",
  "title": "Using Electroencephalography Measurements and High-quality Video Recording for Analyzing Visual Perception of Media Content",
  "procedures": [
    "All methods described here have been approved by the Ethics Commission for Research with Animals and Humans (CEEAH) of the Universitat Autònoma de Barcelona.\n1. Creation and Presentation of the Visual Stimuli\nCreate the video stimuli according to the desired goals.\n\t\nDecide which variables are of interest for the video stimuli.\n\t\tNOTE: For example, in the present investigation, the main variable of interest is the editing style.\n\t\t\nDecide the duration, the content, and the style of the video based on the interest of the experiment. To determine all of these variables, consider how many videos the participant is going to watch and how long the participant will be watching the screen, evaluate if the narrative of the video meets the interest, and decide the visual style of the video.\nWrite the script, paying attention to the chosen variables.\nRecord the video with a high-quality video camera, and edit the video as needed. Seek professional help if necessary.\nDesign an appropriate context for the stimuli presentation.\n\t\nDecide where the data acquisition will take place and design a comfortable space to display the stimuli. Participants should feel at ease.\nSelect a high-quality screen for the presentation of the video. The higher the quality of the screen, the better.\nIf there are several video films to be presented, select a method for the randomization of their presentation.\n\t\tNOTE: It is convenient to randomize stimuli presentation across the subjects to avoid inconclusive results due to the order in which the participants perceive a stimulus.\nChoose a software package to present the videos.",
    "NOTE: There are various options that allow the researcher to display different stimuli with inter-trial timers and instructions, or even a randomized presentation. When choosing the software, it is critical to consider its capability for synchronization with data acquisition devices. Since this protocol analyzes participants' eyeblink rate, the synchronization between the visual presentation of the visual stimuli and the EEG device is crucial.\n2. Selection of Participants\nEstablish a criterion for choosing participants. When a specific variable is going to be analyzed, a control group is needed. Write down the criterion and consult with colleagues to improve upon the study design.\nSelect participants and seek approval from an ethics committee that follows relevant guidelines and regulations.\n\tNOTE: Most universities and research centers have an ethics committee. To apply for approval, it will be necessary to inform them of the investigation goals. Common requirements include explaining the research methods, the benefits of the investigation to society, how informed consent will be obtained, whether participants will be recompensed financially, and how data collected from participants will be managed. Take time to design this request. It is very important to get the approval of an ethics committee to share the results with the scientific community. Some documents that can be useful in this respect are the Declaration of Helsinki, the Nuremberg Code, and the Belmont Report.\nDesign an informed consent form for participants, and follow the criteria of the ethics committee.\nExplain the experiment to every potential participant. Let the participant know all the important information, but avoid information that is not important or can affect the results of the experiment.",
    "NOTE: For example, in an eyeblink detection protocol, the participant cannot be told that eyeblinks are going to be detected, as this could modify the natural eyeblink rate. Ask for their approval to participate. Give each participant the document for informed consent and allow them enough time to read it, to understand the text, and, finally, to sign it.\nMake an appointment with each participant to conduct the experiment. Give the participant the following instructions: to arrive rested and with recently washed hair; chemical products such as hairspray, etc., should be avoided because they can affect EEG recordings. Give the participant all the necessary contact information.\n3. Set-up Preparation\nPrepare the experimental session well in advance of the participant's arrival. Rehearse the session with a colleague. In case something incorrect is detected, make the corresponding modifications to the experimental session.\n\t\nPrepare connections between all devices that are going to be used and check their synchronization (visual stimuli presentation and data acquisition).\n\t\tNOTE: The connectivity between hardware and software is critical. It is desirable to perform tests to confirm synchronization. Discuss with the manufacturer or software developer, if needed.\nMake the subjects feel comfortable in the experimental room: welcome the participant, and prepare a space for their things (bags and others).\nExplain the entire protocol to the participant: where the participant will be seated, how many visual stimuli are going to be shown, and the length of the session. Explain that the participant's cooperation is extremely important.\nSince a wireless EEG recording system is going to be used, explain how difficult these recordings are, and that in order to obtain proper electrophysiological signals with low artifacts, the participant should not move unnecessarily.\n4. Data Acquisition",
    "Clean the surface of the skin of the participant to remove any traces of dirt or remnants of hair products.\nMeasure the head of the participant. Measure the distance between the nasion and the inion, and mark the half-way point as a vertex.\nPrepare the electrodes in the EEG cap using the 10-20 system.\nPut the cap on the subject following the mark so that the vertex matches the Central zero (Cz) point of the cap.\nApply conductive gel with the help of a syringe to the electrodes; make sure the cap fits well on the subject's head.\nPlace the reference electrode and the EOG electrode on the subject's head.\nMake sure that the participant is comfortably seated and prepared for the session.\nFocus an HD video camera on the participant's face in close-up. This will be used to manually detect the participants' eyeblinks.\nCheck that all devices are synchronized.\nCheck that the EEG control box is properly connected to the computer registering the data.\nCheck that the signal for each electrode is correct; if not, check for the problematic electrode.\n\tNOTE: Some common reasons for a bad signal from an electrode are a lack of conductive gel on the electrode, a bad position of the electrode on the head, or a bad connection of the electrode cable with its control box.\nWhen everything is ready, start recording the experiment (and playing the video).\n5. Post-experimental Session\nRemove the cap from the participant's head and, if possible, give the participant a questionnaire related to the topics of interest.\nSave all the data to an external hard drive.",
    "NOTE: It is recommendable to back up the data. A good option would be to save the data to two external hard drives and store them in different places. In designing the best procedure, it is important to consider the protocol for data storage approved by the ethics committee.\nClean the electrodes and cap; most electrodes need to be cleaned immediately after use.\n\t\nClean the electrodes and cap with abundant water under a faucet and without chemical product (unless stated otherwise by the device manufacturer). Carefully dry the electrodes to prevent corrosion. If this protocol is insufficient to clean the cap, it can usually be washed in a washing machine (see the manufacturer's instructions).\n6. Data Analysis\nOrganize the eyeblink detection data.\n\t\nImport the EEG file into a suitable software package for data analysis.\nSelect the EEG area of interest based upon the synchronization triggers used with the visual stimuli presentation software. Filter the data and apply an eyeblink filter to see how many and when eyeblinks are generated.\n\t\tNOTE: Most commercial and free software packages have filters to detect eyeblinks in EEG.\nSelect the HD video of participants' faces and manually match eyeblinks with those found in the EEG data.\nCreate a spreadsheet matrix with the final list of each participant's eyeblinks, and compute the rate per minute while the subject was watching the stimuli.\nPerform statistical analysis.\n\t\nImport the matrix into the corresponding software for statistical analysis.\nIn a statistical software program, design the desired analysis to contrast the initial hypotheses and complete them.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}