{
  "id": 2780,
  "origin_website": "Cell",
  "title": "Protocol for Large-Scale Production of Kidney Organoids from Human Pluripotent Stem Cells",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nPassaging hPSCs (Day −2)\nTiming: 20 min\nThis split is performed to achieve 40%–50% confluency at day 0 of the organoid generation protocol. In the original publication of this protocol, we determined the average cell number in a 40%–50% confluent 100 mm culture of MANZ-2–z2 iPSCs to be 6.6E+06 ± 2.3E+05 (Przepiorski et al., 2018[href=https://www.wicell.org#bib15]).\nPassage hPSCs into one or more 100 mm Geltrex-coated culture dishes as described above. Splitting the cultures at 1:4–1:6 usually leads to the desired confluency after 2 (maximum 3) days.\nStarting the Organoid Assay (Day 0)\nTiming: 30 min\nThis step describes how hPSC colonies are prepared for differentiation. Our protocol starts with a 3-day treatment with 8 μM CHIR99021 to induce mesoderm formation in form of spherical embryoid bodies in suspension culture (Figure 2[href=https://www.wicell.org#fig2]A). The volumes given are for one assay that is initiated from one 100 mm culture dish.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/229-Fig2.jpg\nFigure 2. Differentiation of hPSCs into Kidney Organoids\n(A) Schematic of the protocol.\n(B) Bright-field images of ~50% confluent hPSC colonies on day 0.\n(C) High magnification of desired appearance of hPSC colonies after Dispase-treatment (6 min at 37˚C) showing the edge of the colony starting to curl up (white arrowhead).\n(D) Upon overdigestion with Dispase (shown here is 12 min at 37˚C) the colonies are peeling off the growth surface (red arrowheads) and detach (red arrows), leading to increased cell death and low efficiency in organoid formation.\n(E) Fragments of hPSC colonies in suspension after Dispase digest.\n(F and F′) Day 2 embryoid bodies.\n(G) Tilted 6-well plate for day 2 half-medium change.\n(H) Orbital shaker used from day 2 onward.\n(I and I′) Day 3 embryoid bodies.\n(J) A spinning bioreactor can be used for embryoid body / organoid culture from day 3 onward.",
    "(K) Tubule formation is visible on the surface of day 8 organoids (arrows in K′).\n(L) Day 12 kidney organoids.\nScale bars, 1 mm (B, F, and I); 400 μm (C−E, F′, I′, K, and L).\nCheck for 40%–50% confluency of the culture (Figure 2[href=https://www.wicell.org#fig2]B). The colonies should be mostly discrete.\nNote: If the optimal confluency is missed, we recommend splitting the culture and starting organoid differentiation with the subsequent passage.\nPre-warm mBPEL medium to room temperature (15°C–25°C) and thaw an aliquot of Dispase.\nPrepare 18 mL of complete mBPEL medium in a 50 mL centrifuge tube (add 14.4 μL CHIR99021, 6 μL ROCK inhibitor Y-27632 and 32.7 μL 2-Mercaptoethanol to 18 mL mBPEL). Mix well by inverting the tube.\nAliquot 2 mL of complete mBPEL medium into each well of an ultra-low attachment 6-well plate.\nWash hPSCs twice with 10 mL 1× DPBS.\nAspirate DPBS and add 2 mL of Dispase dropwise (ensuring that all colonies are covered) then incubate at 37°C for 6 min. Upon this treatment, the edges of the hPSC colonies should start to curl up but not detach from the dish (Figure 2[href=https://www.wicell.org#fig2]C).\nNote: Depending the type of culture medium used, this timing may need to be adjusted.\nCritical: Overdigestion will lead to detachment of the colonies, decreased cell survival and low yield of embryoid body formation (Figure 2[href=https://www.wicell.org#fig2]D).\nAspirate Dispase, then wash 3× with 10 mL 1× DPBS each.\nCritical: The three washes are crucial to completely remove Dispase. Insufficient washing may lead to cell death or clumping of embryoid bodies.\nAfter the last wash, aspirate DPBS and scrape the colonies off the culture dish using a cell lifter.",
    "Use a 10 mL serological pipette to wash down the colonies with the remaining 6 mL of complete mBPEL. Pipette up and down (3–5×) to break up large colonies into evenly sized fragments of ∼100 μm (Figure 2[href=https://www.wicell.org#fig2]E), then distribute 1 mL to each well of the 6-well plate. Troubleshooting 2[href=https://www.wicell.org#sec6.3] (Figure 4[href=https://www.wicell.org#fig4]B)\nPlace the 6-well plate into a 37°C incubator, move side-to-side for even distribution of the colonies.\nLeave the plate undisturbed for 48 h.\nHalf-Medium Change (Day 2)\nTiming: 10 min\nOn day 2, a half-medium change is performed to supply fresh mBPEL and CHIR99021.\nPre-warm mBPEL to room temperature (15°C–25°C), then prepare 12 mL of complete mBPEL (with 9.6 μL CHIR99021 added).\nCheck the 6-well plate for embryoid body formation. At this stage, the embryoid bodies should be obvious, appearing as spheres of 50 – 150 μm in diameter among floating single cells (Figures 2[href=https://www.wicell.org#fig2]F and 2F′). We use an EVOS™ XL Core inverted Imaging System to monitor embryoid body (and organoid) appearance.\nPlace 6-well plate into the tissue-culture hood and tilt to achieve a ∼45° angle (e.g., place on the edge of a tube rack, Figure 2[href=https://www.wicell.org#fig2]G). Let embryoid bodies sediment on the bottom (3–5 min).\nCritical: Do not leave the embryoid bodies in this position for extended time as clumping will occur (Troubleshooting 3[href=https://www.wicell.org#sec6.5]) (Figure 4[href=https://www.wicell.org#fig4]F).\nCarefully aspirate approximately half of the medium from each 6-well.\nReturn 6-well plate into flat position and add 2 mL of complete mBPEL to each well.\nPlace 6-well plate on an orbital shaker in the incubator (Figure 2[href=https://www.wicell.org#fig2]H).",
    "Critical: We recommend using an orbital shaker that can be set to orbital and reciprocal agitation, as well as vibration. We use the following settings on a Fisherbrand Multi Function 3D Rotator: Orbital rotation at 30 rpm for 10 s; Reciprocal rotation for 10 s including two changes of direction; Vibration for 5 s.\nTransfer to Stage II Medium (Day 3)\nTiming: 20 min\nOn day 3, mBPEL is replaced by Stage II medium. Stage II medium contains 15% KnockOut Serum Replacement in DMEM. This is sufficient to drive renal tubule formation, which becomes apparent by day 7 to day 9 of the protocol.\nPre-warm DMEM and Stage II media to room temperature (15°C–25°C).\nCheck appearance of day 3 embryoid bodies. The embryoid bodies should be spherical, light-golden in color with smooth edges (Figures 2[href=https://www.wicell.org#fig2]I and 2I′). Troubleshooting 4[href=https://www.wicell.org#sec6.7]\nAspirate embryoid bodies from all six wells using a 10 or 25 mL serological pipette and combine in a 50 mL centrifuge tube.\nRinse the six wells with 1 mL DMEM per well to collect remaining embryoid bodies then add these to the 50 mL tube.\nLeave the embryoid bodies to sediment at the bottom of the tube (3–5 min) at room temperature.\nCarefully aspirate the supernatant then wash with 15 mL of DMEM. Repeat step 23.\nCritical: Do not leave the embryoid bodies accumulate at the bottom of the tube for extended time as clumping will occur (Troubleshooting 3[href=https://www.wicell.org#sec6.5]) (Figure 4[href=https://www.wicell.org#fig4]F).\nAliquot 2 mL of Stage II medium into each well of the 6-well plate.\nCarefully aspirate the supernatant from the sedimented embryoid bodies.\nTake up the embryoid bodies in 6 mL of Stage II medium and redistribute into the 6-well plate, 1 mL per well.",
    "Critical: Distribute embryoid bodies evenly as high density of embryoid bodies in a 6-well can affect organoid formation (Troubleshooting 5[href=https://www.wicell.org#sec6.9]).\nReturn plate to the orbital shaker.\nAlternatives: Instead of continuing to culture the embryoid bodies in the 6-well plate format, they can be transferred into a spinning bioreactor, e.g., the Corning spinner flask (Figure 2[href=https://www.wicell.org#fig2]J) from day 3 onward.\na. Take up embryoid bodies in Stage II medium and transfer into a spinner flask, then fill up to 45 mL with Stage II medium.\na. Place on magnetic stirrer (at 90 rpm) in the incubator (Figure 2[href=https://www.wicell.org#fig2]J).\nOptional: Size-Filtration of Embryoid Bodies / Organoids\nTiming: 10 min\nOccasional fusion may lead to abnormally large embryoid bodies and organoids. (Troubleshooting 3[href=https://www.wicell.org#sec6.5]). We have observed that organoids exceeding a diameter of 700 μm display signs of core apoptosis and necrosis, perhaps due to insufficient levels of oxygen and/or nutrients (Przepiorski et al., 2018[href=https://www.wicell.org#bib15]). To eliminate large specimens and achieve a uniformly sized organoid culture, size-filtration can be performed from day 3 onward.\nPlace a 500 μm cell strainer onto a 50 mL centrifugation tube (Figure 4[href=https://www.wicell.org#fig4]E).\nTake up embryoid bodies / organoids with a 10 or 25 mL serological pipette and slowly drop onto the cell strainer then rinse with 5 mL Stage II medium.\nLeave embryoid bodies / organoids in the flow-through to sediment, then redistribute into 6-well plate or transfer into spinner flask.\nMaintaining Embryoid Body Cultures (Day 3 to Day 8)\nTiming: 10 min\nFrom day 3 onward, Stage II medium needs to be changed every 2–3 days.\nPre-warm Stage II medium to room temperature (15°C–25°C).\nRemove spinner flask or 6-well plate from incubator, leave embryoid bodies to sediment (in tilted position for 6-well plates) at room temperature.",
    "Carefully aspirate most of the medium from each 6-well and roughly half of the medium from a spinner flask.\nReplace with 2 - 3 mL fresh Stage II medium per 6-well, or adjust to 45 mL per spinner flask.\nNote: For spinner flasks, it is sufficient to perform medium changes every 3 days. For 6-well plates, the amount of Stage II medium per well can be adjusted to the frequency of medium changes, i.e., add 3 mL when changing every 3 days (e.g., over the weekend), add 2 mL when changing every other day.\nMaintaining Kidney Organoid Cultures (Day 8 to Day 20+)\nTiming: 10 min\nBetween day 7 and day 9, the outlines of the kidney tubules should become visible on the surface of the embryoid bodies (here forth referred to as kidney organoids; Figure 2[href=https://www.wicell.org#fig2]K) when observed by bright-field microscopy. (Troubleshooting 6[href=https://www.wicell.org#sec6.11]).\nKeep changing Stage II medium every 2–3 days as described in steps 32–35.\nThe organoids will reach their optimal state of differentiation by day 12 (Figure 2[href=https://www.wicell.org#fig2]L), when gene expression for specific markers of the renal cell types (i.e., podocytes, proximal tubule cells, distal tubule and collecting duct cells) can be detected by quantitative (q)PCR, and marker proteins are detectable by immunohistochemistry (Figure 3[href=https://www.wicell.org#fig3]; Przepiorski et al., 2018[href=https://www.wicell.org#bib15]). Validated oligonucleotide primers and antibodies recommended for determining optimal organoid maturity are listed in the Key Resources Table[href=https://www.wicell.org#key-resources-table]. The organoids maintain expression of these gene and protein markers through to approximately day 20. We recommend performing assays, such as drug treatments, during this period (Digby et al., 2020[href=https://www.wicell.org#bib2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/229-Fig3.jpg\nFigure 3. Expected Outcomes\n(A) Yield of a single assay. Shown are day 12 organoids distributed into 24 wells.\n(B) Single 24-well of the same assay.\n(C) High efficiency of tubule formation, shown are day 12 organoids.",
    "(D) Confocal images of immunohistological stainings on sections of day 12 organoids (derived from the MANZ-2-2 iPSC line) showing WT1+ podocytes, EPCAM+ or HNF1B+ tubular epithelia, LRP2+ or CUBN+ proximal tubules, and CHD1+ distal tubules and connecting/collecting duct epithelia. Scale bars, 0.5 cm (B); 1 mm (C); 100 μm (D).\nPause Point: For gene expression analysis, wash organoids once in 1× DPBS and then transfer into TRIzol reagent. Store at −80°C until RNA isolation, cDNA synthesis, and qPCR analysis. For detailed protocols and expected results, please refer to our previous publications (Przepiorski et al., 2018[href=https://www.wicell.org#bib15]; Digby et al., 2020[href=https://www.wicell.org#bib2]). For immunohistochemistry, fix whole organoids in 1 mL 4% Paraformaldehyde for 20 min at room temperature (15°C–25°C), then wash once with 1× DPBS and store at 4°C until further processing (for up to 2 weeks).\nParaffin Embedding and Microtome Sectioning\nTiming: 4 days\nFor histological analyses, the organoids need to be embedded into paraffin and sectioned on a microtome. This work can be performed on a regular laboratory work bench. We recommend wearing personal protective equipment including safety glasses, lab coat, and gloves.\nCritical: Xylene is a potential carcinogen, irritant, and allergenic; use in a fume hood only. Xylene waste needs to be collected and disposed of according to institutional regulations.\nNote: A minimum of 20 organoids is advisable for paraffin processing.\nTransfer organoids into a plastic cryomold (using a 1 mL tip-cut pipette or transfer pipette to avoid damaging the organoids) then carefully take off all of the DPBS with a 200 μL pipette.\nMelt agarose/agar embedding medium in the microwave on low power (∼20 s), then slowly fill up the mold with the warm medium, avoiding bubbles.",
    "Leave embedding medium to solidify at room temperature (15°C–25°C) for 10–15 min, then carefully remove the agarose/agar block from the cryomold and transfer into ∼5 mL 70% ethanol in a 15 mL centrifuge tube (or 50 mL tube if using larger cryomolds). Leave at room temperature for 30 min, then transfer to 4°C and leave for 16–20 h.\nMelt paraffin in a 65°C oven (takes several hours depending the size of container). Perform a dehydration series using ∼5 mL (∼10× the volume of the size of the block): 90% ethanol, 95% ethanol, two changes of 100% ethanol, 50% ethanol : 50% xylene, 100% xylene. Leave for 1 h per step on an orbital shaker or rotator at room temperature. Finish with 50% xylene:50% molten paraffin (add liquid paraffin to xylene), incubate in the 65°C oven for 16–20 h.\nReplace with 100% paraffin, then leave to infiltrate for ≥24 h with at least three more paraffin changes (∼10× the volume of the size of the block).\nUse an embedding station to transfer the agarose/agar block into a paraffin-filled mold and attach the block to a tissue embedding cassette. Leave paraffin to solidify for at least 30 min.\nHeat a water bath to 47°C. Remove paraffin block from the mold.\nTrim the block, then cut 6 μm-thin sections on a microtome. Place paraffin ribbons to float (and flatten) on the water bath surface.\nCollect sections on Superfrost Plus microscope slides and leave to dry in a slide rack at room temperature for 16–20 h.\nPause Point: Slides can be stored at 4°C until further processing.",
    "Alternatives: Embedding into Optimal Cutting Temperature (OCT) compound followed by cryosectioning is an option for histology. We prefer paraffin-sectioning over cryosectioning for better morphological preservation of the tissue. We do not observe reduced antigenicity of proteins in paraffin-embedded organoids.\nImmunohistochemistry of Kidney Organoids\nTiming: 2 days\nWe routinely perform fluorescent immunostainings on paraffin sections of the organoids to analyze expression patterns of kidney markers. During the following steps, avoid complete drying of the sections and do not touch them. This work can be performed on a regular laboratory work bench. We recommend wearing personal protective equipment including safety glasses, lab coat, and gloves.\nDe-paraffinize sections in two changes of xylene, for a minimum of 10 min each (or overnight, 16–20 h), then rinse 3× with 1× TBS plus 0.1% Triton X-100 (TBST). This can be done by either immersing the slides into a slide-container (e.g., Coplin staining jar), or by gently pipetting TBST onto slides that are placed horizontally on a rack. Either way, ensure that the sections are covered with TBST for the entire incubation time.\nOptional: Antigen retrieval. Pre-heat water bath to 95°C. Fill a slide jar with Citrate buffer and place into the heating water bath. Once it has reached 95°C, transfer slides into the jar and incubate for 30 min. Following the incubation leave the slide jar to cool on the bench for another 30 min. After this incubation, take out the slides and rinse them 3× with 1× TBST. We perform this type of antigen retrieval by default. However, one should be aware that some antibodies may not be compatible with this procedure.\nPrepare the blocking solution.\nTilt the slides and tap off the TBST onto a tissue.",
    "While sections are still slightly wet, draw circles around them using a PAP pen to create a hydrophobic barrier. This minimizes the use of antibody solutions and allows multiple antibody stainings to be performed on serial sections on the same slide.\nAdd a small droplet (∼50 μL) of blocking solution onto the sections (within the hydrophobic circle) then incubate for ≥ 1 h at room temperature (15°C–25°C) in a humid chamber.\nPrepare primary antibody dilutions (see Key Resources Table[href=https://www.wicell.org#key-resources-table] and Przepiorski et al., 2018[href=https://www.wicell.org#bib15]; Digby et al., 2020[href=https://www.wicell.org#bib2]) in blocking solution.\nTap off blocking solution and add antibody dilutions directly onto the sections (depending the size of the hydrophobic circle, 20–50 μL per section is usually enough). Incubate for 16–20 h at 4°C in a humid chamber.\nWash 3× 15 min with 1× TBST.\nNote: If using primary antibodies or lectins that are conjugated to fluorescent dyes, perform these washes protected from light.\nPrepare fluorescently labeled antibodies in 1× TBST and drop onto the sections. Incubate for 2 h at room temperature in a humid chamber protected from light.\nWash 3× 15 min with 1× TBST, protected from light.\nDilute Hoechst 33258 1:2,000 for a final concentration of 10 μM in 1× TBST. Drop onto the sections and incubate for 5 min, then briefly rinse with 1× TBST.\nMount slides using Prolong Diamond mounting medium then place a coverslip onto the sections, avoiding air bubbles.\nLeave slides to dry for approximately 30 min, then seal with nail polish. Store at 4°C protected from light. Fluorescent signals are stable for at least 2 weeks.\nImage immunolabeled organoid sections by fluorescent microscopy (Figure 3[href=https://www.wicell.org#fig3]D). We use a Zeiss LSM710 confocal microscope."
  ],
  "subjectAreas": [
    "Cell Differentiation",
    "Organoids",
    "Stem Cells"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}