{
  "id": 6253,
  "origin_website": "Bio",
  "title": "Preparation of cDNA Library for dRNA-seq",
  "procedures": [
    "Isolation of high molecular weight RNA (with length > 200 bp) from plant tissue using RNeasy Plant Mini Kit according to manufacturer’s protocol (according to the manufacturer’s protocol, about 60 μg high molecular weight RNA can be obtained from 100 mg tobacco leaf tissue).   Purification of polyA RNA from 10 μg of total RNA using OligodT Dynabeads according to manufacturer’s protocol and elute the polyA RNA in 15 μl RNase free water (a thermal cycler and a magnetic bar are used in this step).   Ligate sRNA 5’ adapter: table:\n﻿0,1\nPurified mRNA,14 μl\nsRNA 5’ adapter (10 μM),2 μl (Illumina sRNA-seq 5’ adapter)\n10x T4 RNA Ligase buffer,\"2 μl (* If ATP is not included, add ATP to 1 mM final)\"\nT4 RNA Ligase I (10 U/μl),1.5 μl\nRNase OUT (40 U/μl),0.5 μl\n 20 °C, 6 h.   Dynabeads purification and elute in 15 μl RNase free water according to manufacturer’s protocol.   RNA fragmentation table:\n﻿0,1\nFragmentation buffer,\"1.6 μl (100 mM ZnCl2, 100 Mm Tris-HCl, pH7.0)\"\nLigated mRNA,14.4 μl\n 70 °C 2.5 min Purify fragmented RNA using RNeasy Micro Kit and elute RNA in 17 μl RNase free water after purification.   Phosphotase treatment to remove 3’ phosphate resulted from fragmentation: table:\n﻿0,1\nFragmented RNA,16 μl\n10x phosphatase buffer,2 μl\nAntarctic phosphatase,1 μl\nRNase OUT (40 U/μl),1 μl\n 37 °C, 30 min 4 °C hold Purify RNA by RNeasy Micro Kit and elute in 15 μl RNase free water.   Ligate sRNA 3’ adaptor table:\n﻿0,1\nPurified RNA from step 6,14.5 μl\n10x RNA Ligase buffer,\"2 μl (* if ATP is not included, add ATP to 1 mM final)\"\nRNA Ligase 1 (10 Uμl),2 μl\nRNase OUT (40 U/μl),1 μl\nRNA adapter 3’ 0.5 μl,\"(10 μM, Illumina sRNA-seq 3’ adapter)\"",
    "20 °C, 4 h   Reverse transcriptation Prepare the following mix, heat at 70 °C for 2 min and place on ice. table:\n﻿0,1\nAdapter ligated RNA,4 μl\nSRA RT primer,0.5 μl (Illumina sRNA-seq RT primer)\n50 mM dNTP,0.5 μl\n Prepare the following mix and add to the above reaction: table:\n﻿0,1\n5x first strand buffer,2 μl\n100 mM DTT,2 μl\nRNase OUT (40 U/μl),0.25 μl\n 48 °C for 3 min then add: SuperScript II RT      0.75 μl 44 °C for 60 min   PCR amplification Prepare the following mix and add to RT reaction: table:\n﻿0,1\nPhusion HF 2x mix,25 μl\nPrimer GX1,1 μl (Illumina sRNA-seq PCR primer)\nPrimer GX2,1 μl (Illumina sRNA-seq PCR primer)\nNuclease-free water,13 μl",
    "Run the following protocol:   98 °C 30 sec   30-35 cycles of: 98 °C 10 sec 60 °C 30 sec 72 °C 15 sec   72 °C 10 min   4 °C hold     Run the PCR product through a 1.5% Agrose gel, cut a smear region between 150 bp and 250 bp and purify by Gel purification kit and elute in 25 μl elution buffer.   Check the library quality by bio-analyzer High sensitivity DNA assay to check the size distribution (one μl sample is used in this step and a smear region centered around 250 bp is expected from the bio-analyzer electrophoresis profile, see Figure 1).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140930/20140930033941_8324.jpg  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140930/20140930034007_5257.jpg Figure 1. Bioanalyzer analysis of dRNA-seq library. The upper part is the electrophoresis graph from the bio-analyzer run and the peak region between the two blue lines represents the purified dRNA constructs. Table below the electrophoresis graph shows the analysis of the peak region by the bio-analyzer 2100 software.    Use Zero Blunt® PCR Cloning Kit to clone the library and sequence of a few clones to verify the presence of inserts derived from plant transcripts.   Sequence the library using small RNA sequencing run on an Illumina GA II sequencing system."
  ],
  "subjectAreas": [
    "Systems Biology",
    "Plant Science",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}