{
  "id": 3828,
  "origin_website": "Cell",
  "title": "Spatial transcriptomics of the nematode Caenorhabditis elegans using RNA tomography",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nProtocol A: Tomo-sequencing including RNA isolation\nPrepare collection tubes\nTiming: 5 min\nNumber 96 0.5 mL microcentrifuge tubes.\nSectioning and collection of frozen animals\nTiming: 45 min per animal\nThe frozen sample is sectioned in a cryostat (ThermoFisher CryoStar NX70) and each slice is collected for further processing. The separate processing of each slice is the critical step in providing spatial information to the resulting sequencing library.\nPrepare freezing equipment (Figure 2[href=https://www.wicell.org#fig2]):\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/550-Fig2.jpg\nFigure 2. Materials required for cutting sample\nFrom left to right: a box with dry ice, containing the base mold containing the sample cryo-block; 96-well plates for slice collection; a forceps and two brushes. Gloves, sealing film and cryo-solution are also required. Note that the 96-well plates are required for protocol B; protocol A uses 96 labeled 0.5 mL tubes.\nDry ice\nTwo small brushes (keep at −20°C)\nForceps (keep at −20°C)\nNumbered 0.5 mL microcentrifuge tubes (keep on dry ice)\nTissue Freezing Medium (keep at RT)\nSample(s) to slice (keep on dry ice)\nApply a generous amount (approximately 2 mL) of Tissue Freezing Medium to a cryostat specimen disc and place it in the cryostat (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/550-Fig3.jpg\nFigure 3. How to prepare sample for cryosectioning\nRemove the sample cryo-block from the base mold and place it on the tissue disc containing cryo-solution, with the anterior facing upwards. Wait until the cryo-solution is completely frozen before starting cryosectioning.\nUsing forceps, position the sample block in the (not yet frozen) Tissue Freezing Medium, so that the anterior of the animal faces up from the specimen disc (Figure 3[href=https://www.wicell.org#fig3]).\nWait until the block is completely frozen and attached to the specimen disc, then place the specimen disc in the sample holder (Figure 3[href=https://www.wicell.org#fig3]).",
    "Note: If necessary, adjust the angle of the sample holder so that it will cut perpendicular to the anteroposterior axis of the worm.\nCut thick slices of 50–100 μm until the first blue bead appears, then switch to desired slice thickness. A 20 μm slice of a young adult hermaphrodite contains an average of 25 cells.\nNote: In our experience, the minimal thickness for sectioning larvae and adult animals is 10 μm. We have sectioned animals at various thicknesses between 10 μm and 20 μm.\nNote: You can use the marks on the block as a rough indication of when to expect the first bead.\nCritical: Trim the cryo-block on the sides to limit the amount of frozen cryo-solution that is collected. Roughly 2 mm space on all four sides of the bead is sufficient to ensure the whole animal is present.\nStart collecting slices using brushes and forceps. When the first bead becomes fainter, place them in the labeled 0.5 mL microcentrifuge tubes: slice 1 in tube 1, slice 2 in tube 2, et cetera, until the posterior bead appears (Methods video S1[href=https://www.wicell.org#mmc5]. Sectioning and collection of frozen animals).\nNote: Individual slices should be transferred to microcentrifuge tubes and placed on dry ice as quickly as possible, to minimize the chance of RNA degradation.\nNote: When the posterior bead appears, write down the total number of slices for later reference.\nNote: Based on the length of the animal and the sectioning width, the number of slices that span the distance between the blue beads can be estimated. If the actual number of slices is significantly lower, this indicates that the bead has moved during the freezing process. If so, discard the sample.\n    Your browser does not support HTML5 video.",
    "Methods video S1. Sectioning and collection of frozen animals, related to steps A7 and B8\nThe frozen sample is sectioned in a cryostat (ThermoFisher CryoStar NX70) and each slice is collected for further processing.\nRNA extraction\nTiming: 2 h + 48 h of incubation time\nThe frozen sections are further processed to isolate the RNA. We add Glycoblue to help visualize the RNA pellets, and ERCC spike-ins as a quality control measure downstream in the protocol.\nAdd 100 μL of the following mixture to each microcentrifuge tube containing a slice, and shake vigorously for 5 s:\ntable:files/protocols_protocol_550_4.csv\nSpin the samples down at 12.000 g and 4°C, for a few seconds.\nAdd 20 μL of chloroform to each microcentrifuge tube and shake vigorously for 5 s.\nSpin the samples down at 12.000 g and 4°C, for 15 min.\nNumber as many 0.5 mL microcentrifuge tubes as you have slices. Add 0.2 μL of Glycoblue (15 mg/mL) to each tube.\nNote: The addition of Glycoblue helps visualization of the pellet.\nTransfer about 60 μL of the upper aqueous layer to the new, numbered 0.5 mL microcentrifuge tubes containing 0.2 μL of Glycoblue, add 60 μL of isopropanol and shake vigorously for 5 s.\nPause Point: Store the samples for at least 48 h at −20°C. The longer the storage time, the higher the final RNA yield.\nSpin the samples down at 12.000 g and 4°C, for 18 min.\nAspirate supernatant carefully.\nNote: Use pipettes with smaller tips to ensure complete removal of the supernatant without disturbing the pellet.\nAdd 180 μL of freshly diluted 75% ethanol (20°C–25°C) to each sample, vortex and spin down at 7.500 g and 4°C, for 10 min.",
    "Aspirate supernatant, add 180 μL of 75% ethanol (20°C–25°C) to each sample, vortex and spin down at 7.500 g and 4°C, for 10 min.\nAspirate the supernatant, and remove as many excess ethanol droplets as possible using a 2 μL pipette.\nAir dry the pellet until completely dry, for a maximum of 10 min.\nCritical: Prolonged drying will result in degradation of the RNA and makes it more difficult to dissolve the pellet. One will need to find the perfect timing at which the pellet is dry, but the drying time is as short as possible. Therefore, removing as many ethanol droplets as possible in step 18 is crucial.\nRNA amplification\nTiming: 15 min\nIn single-cell mRNA sequencing, amplification of RNA is not trivial. Novel methods often rely on the use of an in vitro transcription step (CEL-Seq) (Hashimshony et al., 2012[href=https://www.wicell.org#bib3]), in combination with an unique molecular identifier (UMI) to detect unique reads (Grün et al., 2014[href=https://www.wicell.org#bib2]), referred to as CEL-Seq2 (Hashimshony et al., 2016[href=https://www.wicell.org#bib4]). The principle relies on the use of individual RNA annealing primers that contains a T7 promoter, Illumina 5’ adapter, UMI, cell-specific barcode and poly-T-sequence (Figure 4[href=https://www.wicell.org#fig4]). The UMI (4 bp) and barcode (6 bp) can be traced back from the sequencing data to distinguish reads from individual cells.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/550-Fig4.jpg\nFigure 4. Components of the CelSeq2 primer\nThe CelSeq2 primer contains a T7 promoter element, an Illumina 5’ adapter, a unique molecular identifier (6 bp), a cell-specific barcode (8 bp) and a poly-T stretch.",
    "We make use of an adapted version of the CEL-Seq2 protocol, that will label each detected molecule with a section-specific barcode (8 bp) (Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/550-Mmc1.xlsx]) and UMI (6 bp). By adding unique CEL-Seq2 primers to the samples from consecutive cryo-sections, we are able to trace back reads from corresponding cryo-sections. This is the critical step in providing spatial information to the resulting sequencing library.\nResuspend the RNA pellet in 1 μL of the corresponding CEL-Seq2 primer (7.5 ng/μL) and keep the samples on ice until the next step.\nCritical: Ensure that the CEL-Seq2 primer number used for each sample corresponds to the slice number.\nIncubate the samples for 1 min at 70°C in a heat block.\nNote: When only one heat block is available, change the temperature to 42°C directly after this step. This will speed up the next steps and therefore reduce the chance of RNA degradation.\nImmediately move the samples back to ice and spin them down at 20.000 g for 10 s.\nReverse transcription\nTiming: 90 min\nReverse transcription to cDNA:\nAdd 1 μL of the following mix to each microcentrifuge tube:\ntable:files/protocols_protocol_550_5.csv\nIncubate the samples at 42°C, for 75 min in a heat block. Spin the samples down at 20.000 g for 10 s and move the samples back to ice.\nSecond strand reaction\nTiming: 90 min\nGeneration of double-stranded cDNA:\nAdd 11 μL of the following mix to each microcentrifuge tube:\ntable:files/protocols_protocol_550_6.csv\nNote: As the samples are already barcoded, this step can be performed with the same tip as long as all samples will go into the same IVT reaction.\nGently flick samples and spin them down for a few seconds, then incubate the samples at 16°C for 75 min.\ncDNA cleanup using magnetic beads\nTiming: 1 h",
    "The cDNA is cleaned and eluted in nuclease-free water.\nWarm AMPure XP beads to room temperature (20°C–25°C).\nPool all reactions that will go into the same IVT reaction into one 1.5 mL microcentrifuge tube.\nPrepare bead mix in a 1:7 ratio of beads to bead binding buffer, vortex well and add the bead mix to the sample in a 4:5 ratio (80 μL bead mix for 100 μL cDNA).\nIncubate the sample at room temperature (20°C–25°C) for 15 min.\nPlace the sample on a magnetic stand for at least 5 min, until the liquid is clear.\nRemove and discard the supernatant, add 800 μL of freshly diluted 80% ethanol and incubate minimally 30 s.\nNote: Make sure that the beads are not disturbed while removing supernatant. During this first step, it is best to remove only part of the supernatant.\nRepeat the wash step; then, remove all supernatant without disturbing the beads.\nAir dry the pellet until completely dry, for a maximum of 10 min.\nResuspend the beads in 8 μL nuclease-free water. Pipette up and down 10 times to mix thoroughly.\nIncubate at room temperature (20°C–25°C) for 2 min, then place the sample on the magnetic stand until the liquid is clear.\nCarefully pipette all supernatant into a new 0.5 mL microcentrifuge tube, without disturbing the beads.\nNote: Spinning down the microcentrifuge tube and replacing it on the magnetic stand may be necessary to obtain all supernatant.\nNote: The original CEL-Seq2 protocol (Hashimshony et al., 2016[href=https://www.wicell.org#bib4]) removes the AMPure XP beads after amplified RNA (aRNA) fragmentation (see below). Our alternative method, described here, is to remove the AMPure XP beads directly after cDNA cleanup. We have obtained good results with this approach (Table S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/550-Mmc2.xlsx]) and have not extensively tested the original CEL-Seq2 method.",
    "Pause Point: The sample can be stored at −20°C for one week.\nNote: After cDNA cleanup, continue with the IVT reaction as described in “in vitro transcription[href=https://www.wicell.org#sec3.3.1].”\nProtocol B: Tomo-sequencing without RNA isolation\nPrepare 96-well plate for collecting slices\nTiming: 15 min\nIn single-cell mRNA sequencing, amplification of RNA is not trivial. Novel methods often rely on the use of an in vitro transcription step (CEL-Seq) (Hashimshony et al., 2012[href=https://www.wicell.org#bib3]), in combination with an unique molecular identifier (UMI) to detect unique reads (Grün, Kester and Van Oudenaarden, 2014[href=https://www.wicell.org#bib2]), referred to as CEL-Seq2 (Hashimshony et al., 2016[href=https://www.wicell.org#bib4]). The principle relies on the use of individual RNA annealing primers that contains a T7 promoter, Illumina 5’ adapter, UMI, cell-specific barcode and poly-T-sequence (Figure 4[href=https://www.wicell.org#fig4]). The UMI (4 bp) and barcode (6 bp) can be traced back from the sequencing data to distinguish reads from individual cells.\nWe make use of an adapted version of the CEL-Seq2 protocol, that will label each detected molecule with a section-specific barcode (8 bp) (Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/550-Mmc1.xlsx]) and UMI (6 bp). By adding consecutive CEL-Seq2 primers to the samples from consecutive cryo-sections, we are able to trace back reads from corresponding cryo-sections. This is the critical step in providing spatial information to the resulting sequencing library.\nAdd 25 μL of mineral oil to each well. The oil prevents evaporation of the small reaction volumes.\nAdd 1 μL of individual CEL-Seq2 primer to each well and carefully film the plate.\nCritical: Ensure that the CEL-Seq2 primer number used for each sample corresponds to the slice number.\nPause Point: Store the 96-well plate at −80°C. Storage can be extended to at least 3 months; we have not tested longer storage.\nSectioning and collection of frozen animals\nTiming: 45 min per animal",
    "Animals frozen in blocks earlier are cryo-sectioned in a cryostat (ThermoFisher CryoStar NX70) and slices are collected for further processing. The separate processing of each slice is the critical step in providing spatial information to the resulting sequencing library.\nPrepare freezing equipment (Figure 2[href=https://www.wicell.org#fig2]):\nDry ice\nTwo small brushes (keep at −20°C)\nForceps (keep at −20°C)\nThe prepared 96-well plate (keep on dry ice)\nTissue Freezing Medium (keep at RT)\nSample(s) to slice (keep on dry ice)\nApply a generous amount (approximately 2 mL) of Tissue Freezing Medium to a cryostat specimen disc and place it in the cryostat.\nUsing forceps, position the sample block in the (not yet frozen) Tissue Freezing Medium, so that the anterior of the animal faces up from the specimen disc.\nWait until the block is completely frozen and attached to the specimen disc, then place the specimen disc in the sample holder.\nNote: If necessary, adjust the angle of the sample holder so that it will cut perpendicular to the anteroposterior axis of the animal.\nCut thick slices of about 50–100 μm until the first bead appears, then switch to desired slice thickness.\nNote: In our experience, the minimal thickness for sectioning larvae and adult animals is 10 μm. We have sectioned animals at various thicknesses between 10 μm and 20 μm.\nNote: You can use the marks on the block as a rough indication of when to expect the first bead.\nCritical: Trim the cryo-block on the sides to limit the amount of frozen cryo-solution that is collected. Roughly 2 mm space on all four sides of the bead is sufficient to ensure the whole animal is present. Failure to remove excess cryo-solution will seriously compromise library generation.",
    "Start collecting slices using brushes and forceps. When the first bead becomes fainter, place the sections in the 96-well plate: slice 1 in well A1, slice 2 in well A2, et cetera, until the posterior bead appears (Methods video S1[href=https://www.wicell.org#mmc5]).\nCarefully seal the plate with a 96-well plate sealing film.\nCritical: Sections may stay at the top of their well due to static electricity. For this reason, ensure sealing the plate occurs in one motion. A section may melt onto the sticker when applying, thus repositioning the film after application could cause a section to be lost or transferred to a different position.\nCritical: Do not touch the mineral oil with the forceps, as this might cause contamination between the wells.\nNote: Collecting in small batches is recommended. Make sure to place the 96-well plate back on dry ice as quickly as possible, to minimize degradation of RNA in the slices.\nNote: When the posterior bead appears, note the total number of slices used for reference later.\nNote: Based on the length of the animal and the sectioning width, the number of slices that span the distance between the blue beads can be estimated. If the actual number of slices is significantly lower, this indicates that the bead has moved during the freezing process. If so, discard the sample.\nPause Point: Store the samples at −80°C. We generally continue the protocol within 24 h and have not tested longer storage.\nRNA amplification\nTiming: 15 min\nIncubate the plate for 5 min at 65°C in a thermal cycler.\nMove the plate back to ice and spin it down at 20.000 g for 10 s.\nReverse transcription\nTiming: 90 min\nThe RNA is reverse transcribed to cDNA.\nAdd 1 μL of the following mix to each well:\ntable:files/protocols_protocol_550_7.csv",
    "Note: The reverse transcription reagents can also be dispensed by a robot. We have used the Nanodrop II (GC biotech). If this is the method of choice, add dNTPs (20 μM) and ERCC spike-ins (diluted to 1:50.000.000) to the 96-well plate before the heat lysis step as described in step 9. Continue with step 10 above and add the remaining reagents for step 12. Continue the reverse transcription reaction as described below in step 13.\nIncubate the plate at 42°C, for 75 min in a thermal cycler and move the samples back to ice.\nSecond strand reaction\nTiming: 90 min\nTo produce double-stranded cDNA.\nAdd 11 μL of the following mix to each well:\ntable:files/protocols_protocol_550_8.csv\nNote: As the samples are already barcoded, this step can be performed with the same tip. Only if more than one animal is processed at the same time, do not use the same tip for separate samples.\nNote: We mix the second strand reaction reagents by hand. Alternatively, this could be dispensed by the Nanodrop II (GC biotech) or other 8-channel pipetting robots, but we have not tested this.\nGently flick and tap the plate, spin it down for a few seconds, then incubate at 16°C for 75 min.\ncDNA purification using magnetic beads\nTiming: 1 h\nThe cDNA is cleaned and eluted in nuclease-free water.\nWarm AMPure XP beads to room temperature (20°C–25°C).\nPool all reactions into one tube, spin down for 1 min at 12.000 g and transfer the lower, aqueous phase to a new microcentrifuge tube.\nNote: If more than one animal is processed at the same time, pool all reactions that belong to the same animal.",
    "Note: Pooling can be done in several ways. We have experienced good results by centrifuging the plate upside down at a low speed (1 min at 250 g), thereby collecting all samples into one container. Subsequently, all volume can be transferred to a 5 mL tube and spun down (1 min at 12.000 g) to separate the aqueous phase to transfer to a new 1.5 mL tube. Alternatively, one could pool all reactions into 1.5 mL tubes directly and spin down to separate the aqueous phase. However, due to the total volume exceeding 1.5 mL, multiple tubes will be necessary if more than 35 sections are used.\nNote: There will always be some residual mineral oil left in the transferred aqueous phase. Therefore, the volume will be higher than the number of samples multiplied by 13 μL of cDNA. Moreover, if a full 96-well plate has been used (96 slices), the bead cleanup cannot be performed in one 1.5 mL tube. If this is this case, we recommend splitting the sample, and performing 2 parallel bead cleanups in separate 1.5 mL tubes, up until elution. Since the final elution volume must be 8 μL, we recommend using 8 μL of nuclease-free water to elute the DNA from the beads in one tube, then transfer this water to the other tube to elute the remaining DNA there.\nPrepare bead mix in a 1:7 ratio of beads to bead binding buffer, vortex well and add the bead mix to the sample in a 4:5 ratio (80 μL bead mix for 100 μL cDNA).\nIncubate the sample at room temperature (20°C–25°C) for 15 min.\nPlace the sample on a magnetic stand for at least 5 min, until the liquid is clear.",
    "Remove and discard the supernatant, add 800 μL of fresh 80% ethanol and incubate minimally for 30 s.\nNote: Make sure that the beads are not disturbed while removing supernatant. During this first step, it is best to remove only part of the supernatant.\nRepeat the wash step; then, remove all supernatant without disturbing the beads.\nAir dry the pellet for a maximum of 10 min.\nNote: Residual mineral oil will always be in the sample and therefore, the pellet will never appear dry because of the oil layer. We advise to dry the beads for approximately 6–7 min to avoid over-drying the beads, which will make elution more difficult.\nResuspend the beads in 8 μL nuclease-free water. Pipette up-and-down 10 times to mix thoroughly.\nIncubate at room temperature (20°C–25°C) for 2 min, then place the sample on the magnetic stand until the liquid is clear.\nCarefully pipette all supernatant into a new 0.5 mL microcentrifuge tube, without disturbing the beads.\nNote: Spinning down the microcentrifuge tube and replacing it on the magnetic stand may be necessary to obtain all supernatant.\nPause Point: The sample can be stored at −20°C for one week.\nNote: After cDNA cleanup, continue with the IVT reaction as described in “in vitro transcription[href=https://www.wicell.org#sec3.3.1].”\nContinuation of both Protocol A & B\nThe following sections describe the steps that should be taken to generate a cDNA library for sequencing and mapping. First, we amplify the purified cDNA using linear amplification to aRNA. Next, we reverse transcribe the aRNA to a cDNA library.\nNote: From here, all steps are identical for both tomo-sequencing with and without RNA isolation. The starting point is an 8 μL cDNA sample that has been stored at −20°C for less than one week.",
    "Optional: The next steps – until sequencing – can be automated using a pipetting robot.\nIn vitro transcription\nTiming: 15–20 h\nTo transcribe the amplified cDNA to RNA.\nNote: In vitro transcription and library preparation are performed according to the CEL-Seq2 protocol (Hashimshony et al., 2016[href=https://www.wicell.org#bib4]).\nPrepare the following master mix (using the Ambion MegaScript T7 transcription kit) and add 12 μL to the 8 μL of eluted cDNA:\ntable:files/protocols_protocol_550_9.csv\nIncubate the sample in a thermal cycler at 37°C for 13 h, with the lid set at 70°C. Set the cycler to go to 4°C at the end of the incubation period.\nNote: aRNA is stable for at least 6 h at 4°C, but we have not tested longer storage. aRNA can be stored for one week at −20°C.\nAdd 7.5 μL of EXO-SAP enzyme and incubate at 37°C for 15 min, to remove the CEL-Seq2 primers.\nMix all of the aRNA (27.5 μL) with 6.8 μL fragmentation buffer on ice, incubate at 94°C for 3 min and immediately move the sample to ice.\nCritical: Fragmenting the aRNA for longer than 3 min can significantly decrease the sample quality.\nAdd 3.5 μL fragmentation STOP buffer.\nPrewarm RNAClean XP beads to room temperature (20°C–25°C) and vortex until well dispersed.\nAdd 60 μL beads to the sample and incubate at room temperature (20°C–25°C) for 10 min.\nPlace the sample on a magnetic stand for at least 5 min, until the liquid appears clear.\nRemove and discard about 80 μL of the supernatant.\nAdd 200 μL fresh 70% ethanol, incubate for at least 30 s, then remove and discard the supernatant without disturbing the beads.\nRepeat step 10 (washing) two more times.\nAir dry the beads for a maximum of 10 min, or until they are completely dry.",
    "Resuspend the beads with 7 μL nuclease-free water. Pipette the entire volume up and down ten times to mix thoroughly.\nIncubate at room temperature (20°C–25°C) for 2 min, place on the magnetic stand for 5 min until the liquid appears clear. Then, transfer the supernatant to a new 0.5 mL microcentrifuge tube.\nPause Point: Samples can be kept at −20°C for at least 2 months; we have not tested longer storage.\nOptional: Check the aRNA amount and quality by loading 1 μL of the sample onto a Bioanalyzer RNA pico chip. When the IVT reaction is started with approximately 0.1 ng RNA, the expected yield is 500 to 1000 pg/μL, with the bulk of fragment sizes ranging from 50–1000 nucleotides (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/550-Fig5.jpg\nFigure 5. Example of bioAnalyzer outcomes\nTop: bioAnalyzer aRNA output, for a bad library (left) and a good library (right). Fragment sizes are expected to range from 50–1000 nucleotides.\nBottom: bioAnalyzer cDNA output, for a bad library (left) and a good library (right). The expected peak is a normal distribution between 200–1000 base pairs.\nNote: For very small samples, like 10 μm C. elegans sections, the aRNA content is not always visible on the Bioanalyzer. However, this is not necessarily an indication of failed amplification. Instead, perform the steps for library preparation after resuspending the beads in 5.5 μL instead of 7 μL nuclease-free water (as described in step 13).\nLibrary preparation\nTiming: 3–5 h\nTo prepare a DNA library of the amplified RNA sample.",
    "To 5 μL of aRNA, add 1 μL random hexamer RT primers (20 μM) and 0.5 μL dNTPs (10 μM). We have the random hexRT primers custom-made at Integrated DNA Technologies (IDT) and order 100 μM of 100 nanomole hand-mixed DNA oligo at standard desalting (see key resources table[href=https://www.wicell.org#key-resources-table]). Incubate at 65°C for 5 min and place the sample on ice.\nPrepare the following master mix at room temperature (20°C–25°C):\ntable:files/protocols_protocol_550_10.csv\nAdd 4 μL of this master mix to the sample and incubate for 10 min at 25°C, and subsequently for 1 h at 42°C.\nNote: Incubation at 42°C can be performed in a hybridization oven or, alternatively, in a pre-heated thermal cycler with the lid set at 50°C.\nAdd 40 μL of the following master mix to each sample:\ntable:files/protocols_protocol_550_11.csv\nCritical: ensure that each sample has a uniquely indexed RNA PCR primer, as this is necessary to demultiplex separate samples after sequencing.\nNote: Both the RP1 and the RPIX primers are provided with the Illumina kit (Tables S3[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/550-Mmc3.docx] and S4[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/550-Mmc4.docx]).\nAmplify the cDNA sample in a thermal cycler with the following PCR conditions:\n30 s at 98°C.\n11 cycles of:\n10 s at 98°C.\n30 s at 60°C.\n30 s at 72°C.\n10 min at 72°C.\nHold at 4°C.\nNote: Half of the PCR reaction is usually enough. However, if needed, the remaining 25 μL can be used to repeat the PCR amplification with more cycles.\nNote: If the aRNA concentration was low (see Figure 5[href=https://www.wicell.org#fig5]), up to 15 cycles can be used.\nPause Point: sample can be kept at −20°C.",
    "Prewarm the AMPure XP beads to room temperature (20°C–25°C), vortex until well dispersed, then add 1:1 beads to the PCR reaction (either 50 μL or 25 μL if half the reaction was performed). Mix the entire volume thoroughly by pipetting up and down ten times.\nIncubate the sample at room temperature (20°C–25°C) for 15 min, then place the sample on a magnetic stand for at least 5 min, until the liquid appears clear.\nRemove and discard 95 μL (or 45 μL, in case of the 25 μL PCR reaction) of the supernatant.\nAdd 200 μL fresh 80% ethanol, incubate at least 30 s, then remove and discard the supernatant without disturbing the beads.\nRepeat step 9 (wash) one more time, then air dry the beads for 15 min, or until completely dry.\nResuspend the beads in 25 μL nuclease-free water. Mix the entire volume thoroughly by pipetting up and down ten times.\nIncubate the sample at room temperature (20°C–25°C) for 2 min, then place the sample on a magnetic stand for 5 min, until the liquid appears clear.\nTransfer 25 μL of the supernatant to a new microcentrifuge tube.\nRepeat steps 6–13, with the following adjustments: add 25 μL beads and elute in 10 μL nuclease-free water in the end.\nTransfer the 10 μL sample to a new microcentrifuge tube.\nNote: The microcentrifuge tube now contains the DNA library.\nCheck the concentration of the DNA library (for example using Qubit).\nNote: 1 μL should be enough to measure the concentration. The expected concentration is at least 1 ng/μL.\nRun 1 μL of the sample on a Bioanalyzer using a high-sensitivity DNA chip to see the size distribution of the DNA.\nNote: The expected peak is a normal distribution between 200–1000 base pairs (Figure 5[href=https://www.wicell.org#fig5]).\nSequencing\nTiming: variable.",
    "Note: We have consistently obtained good results using the Illumina NextSeq500 platform. We only have experience with this machine, but equivalent machines may also yield good results.\nDilute or mix samples for one run according to the requirements of your sequencing facility of choice. If you are sequencing a library for the first time, we recommend to use a minimum of 15 million reads in a run.\nSequence the mix of samples on an Illumina NextSeq500 high output platform with the following settings: 1 × 75 bp, divided 1:2 over read 1 and 2. This is sufficient to obtain good sequencing results.\nRead 1: 25nt. This read is mostly important to determine the UMI and CEL-Seq2 barcode sequences and therefore, a shorter read length is required.\nRead 2: 50nt. This read contains gene-specific information and therefore, a higher read length is required.\nNote: In case of the Illumina NextSeq500 platform, sequencing should produce 8 .fastq files containing Read 1 and 2 for each of the 4 sequencing lanes.\nMapping\nTiming: variable.\nPaired-end reads obtained by sequencing may be mapped to a reference transcriptome of C. elegans. In our studies, a reference transcriptome compiled from the WormBase C. elegans reference genome version WS249, supplemented with ERCC spike-ins, was used. This is available in standard format on GitHub: http://bit.ly/Reference_C_elegans[href=http://bit.ly/Reference_C_elegans].\nRead alignment can be performed using the BWA-MEM algorithm (Li and Durbin, 2010[href=https://www.wicell.org#bib5]). We use a custom wrapper of the algorithm, MapAndGo2 (available on GitHub, http://bit.ly/MapAndGo_v2[href=http://bit.ly/MapAndGo_v2])."
  ],
  "subjectAreas": [
    "Rnaseq",
    "Sequence Analysis",
    "Model Organisms"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}