{
  "id": 12260,
  "origin_website": "Jove",
  "title": "Induction and Diagnosis of Tumors in Drosophila Imaginal Disc Epithelia",
  "procedures": [
    "1. Fly Crosses and Clone Induction\nRemove all flies in the vial 12 h before collecting virgin flies.\nAnesthetize the flies in the vial by injecting CO2 gas and place flies onto a CO2 fly pad.\nTransfer 10 - 20 virgin females and 10 males from the CO2 fly pad into a fresh vial and incubate for 1 day at 25 °C.\nTransfer these flies into a fresh vial and incubate for 12 h at 25 °C.\n\tNOTE: Discard the first vial as virgin females do not lay enough eggs in the first day.\nFor enhancer-GAL4 lines, remove the adult flies and incubate the vial at 25 °C until dissection.\nFor induction of mosaic clones by flip-out-GAL4, remove the adult flies and incubate the vial for 2 - 4 days at 25 °C. The incubation time before heat shock is dependent on the experimental purpose. A heat shock 2 days after egg deposition (AED) generates mosaic clones in immature second instar imaginal epithelia. A heat shock after 3 or 4 days AED generates mosaic clones in differentiated early- to mid-third instar imaginal epithelia.\n\tNOTE: It is important to examine the effect of altered heat-shock timing on tumorigenic phenotypes.\nFor induction of mosaic clones by flip-out-GAL4, heat shock the vial by immersion in a 37 °C water bath for 10 - 45 min followed by incubation for 2 - 3 days at 25 °C.\n\tNOTE: Information of heat-shock time, timing, and incubation time in each experiment is shown in the figure legends.\n2. Dissection of Larvae\nCollect wandering third instar larvae with a wooden stick or blunt forceps, genotype them by appropriate fluorescent markers (e.g., EGFP) under a fluorescence stereoscopic microscope and place them in a dissection dish with PBS (phosphate buffered saline).",
    "Wash the larvae in PBS by pipetting with 2 mL plastic transfer pipettes.\nPinch the center of the larva with one forceps and tear the body in half with the other forceps.\nPinch the mouth hook of the anterior half with one forceps and push the mouth towards the body with the other forceps to turn the body inside out.\nRemove unnecessary materials such as salivary glands or fat bodies with forceps.\n3. Fixation and Antibody Staining\nTransfer the dissected anterior half of the larval body (including imaginal wing discs) to a 1.5 mL plastic tube and fix in 1 mL of Fix solution (4% Formaldehyde in PBS) for 10 min at room temperature in the dark with gentle rotation.\n\tCAUTION: Formaldehyde is toxic and has carcinogenic potential. Wear protective gloves and clothing to prevent skin contact.\n\tNOTE: In this part, all steps take place on a nutator at room temperature in the dark unless otherwise noted.\nRemove the Fix solution and discard. Wash the tissues with 1 mL of PBT (0.3% Triton X-100 in PBS) three times for 15 min each.\nRemove the PBT and add 1 mL of PBTG (0.2% bovine serum albumin and 5% normal goat serum in PBT) for blocking and nutate 1 h at room temperature or overnight at 4 °C.\nRemove PBTG and add primary antibody solution appropriately diluted with PBTG (see Materials Table) and nutate overnight at 4 °C.\nRemove the primary antibody solution and wash the tissues with 1 mL PBT three times for 15 min each.\nRemove PBT and add secondary antibody solution appropriately diluted with PBTG (1:400). Nutate for 2 h at room temperature or overnight at 4 °C.\nRemove secondary antibody solution and wash the tissues with 1 mL of PBT two times for 15 min each.",
    "To stain F-actin, remove PBT and add Phalloidin solution appropriately diluted in PBS (1:40). Then nutate for 20 min. Remove the Phalloidin solution and wash the tissues with 1 mL of PBT two times for 15 min each.\nTo counterstain nuclear DNA, remove PBT and add DAPI (4', 6-diamidino-2-phenylindole) solution (0.5 µg/mL of DAPI in PBS). Then nutate 10 min.\n\tCAUTION: DAPI has carcinogenic potential. Wear protective gloves and clothing to prevent skin contact.\nRemove DAPI solution and wash the tissues with 1 mL of PBT two times for 15 min each.\nRinse once in 1 mL of PBS for 10 min at room temperature.\nRemove PBS and add 500 µL of 100 % glycerol as the pre-mounting medium.\n4. Mounting onto Microscope Slides\nPlace the stained tissues on a microscope slide using a 2 mL plastic transfer pipette.\nTransfer the tissues to drops of mounting medium on another microscope slide with forceps.\nHold down the end of dissected tissue with one forceps and pull away brain and eye antennal discs with the other forceps.\n\tNOTE: Keep the dissected brains to place them near the wing imaginal discs. The brains act as a platform preventing the coverslip from crushing the wing imaginal discs.\nTo isolate the wing imaginal discs hold down the end of dissected tissue with one forceps and gently scratch the body wall and tear off the discs with the other forceps.\n\tNOTE: If it is difficult to find wing imaginal discs, peel the trachea from the posterior to the anterior side. Wing imaginal discs stick to the trachea.\nGently cover the imaginal discs with a coverslip and seal with nail polish; store at 4 °C.\n5. Confocal Microscopy",
    "To acquire confocal images using a confocal microscope set image acquisition parameters including range of emission wavelength, laser intensity, gain, offset, scanning speed and image size 24.\n\tNOTE: For detailed procedure of image acquisition settings, refer to the instruction manual supplied by each microscope manufacturer.\nTo capture single confocal sections of an entire wing imaginal disc, use a 20X objective lens.\nAcquire 3-dimensional images by z-stack scanning at step-size of 0.5 - 1.0 µm using 40X or 60X lenses.\n\tNOTE: To analyze cellular phenotypes in high resolution, an image size should be larger than 512 x 512 pixels.\n6. Image Analysis Using ImageJ\nUse Fiji, an open-source ImageJ software focused on biological-image analysis (https://fiji.sc/) 25, to acquire and analyze confocal z-stack images.\nTo acquire vertical sections, open the z-stack images in ImageJ and select the menu item \"Image/Stacks/Reslice.\"\n\tNOTE: Either X-Z axis or Y-Z axis are selectable in the Reslice menu. Vertical section can be obtained also in an arbitrary direction by drawing a straight line or rectangle onto the z-stack image.\n7. Diagnosis of Neoplastic Phenotypes\nOpen the vertical sections (X-Z or Y-Z axis) obtained from one set of z-stack images and analyze morphological phenotypes and antibody staining.\nFor the diagnosis of tumor phenotypes, mainly focus on the following three points: (1) if a cell mass, including knockdown clones, deviates from the main epithelial layer, (2) if the subcellular localization of junctional proteins is altered in this cell mass, and (3) if the diameter of this cell mass is larger than 4 cells.\nCategorize tumor phenotypes according to the flowchart described in Figure 1.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}