{
  "id": 19628,
  "origin_website": "Jove",
  "title": "3D Reconstruction and Analysis of Thin Subcellular Neuronal Structures using Focused-Ion Beam Scanning Electron Microscopy Data",
  "procedures": [
    "1. Image volume data and subcellular object size: considerations and registration\nObtain a quality FIB-SEM image volume of the area of interest containing the subcellular objects of interest.\n\tNOTE: This protocol uses segments of a FIB-SEM image volume from late adolescent ferret primary visual cortex (24.2 x 16.2 x 2.4 µm, 4 nm isotropic voxels), and a freely accessible FIB-SEM volume from adult rat CA1 hippocampus (10.2 x 7.7 x 5.3 µm; 5 nm isotropic voxels) made available by the Knott laboratory (https://www.epfl.ch/labs/cvlab/data/data-em/). It is critical to prepare tissue blocks for FIB-SEM using a protocol that preserves ultrastructural detail and produces high contrast under FIB-SEM imaging conditions23,24. Importantly, the tissue should be imaged such that the resulting FIB-SEM image voxel resolution is <0.5 × the size of the diameter of the smallest subcellular structure of interest. For example, because the sites of spinule protrusion into presynaptic boutons can be as small as 30 nm in diameter, a voxel size of <15 nm would be appropriate to sample these structures above the Nyquist criterion. In addition, it is useful to image tissue at isotropic (equal in all dimensions) resolution (e.g., 5 x 5 x 5 nm voxels) to enable visualization and reconstruction of fine structures that have equal dimensions in all x/y/z planes.\nDownload and install the Fiji distribution of ImageJ25 (https://imagej.net/software/fiji/downloads).\nAlign the image volume.\n\tNOTE: While modern FIB-SEM systems produce roughly aligned image volumes, image to image registration may still suffer from sub-pixel drift.\n\t\nIn Fiji, navigate to Plugins | Registration and choose Register Virtual Stack Slices. Consult the User Manual for assistance (https://imagej.net/Register_Virtual_Stack_Slices). Start with a Rigid registration and then use an Affine technique if required.\nScale the image volume.",
    "Open the aligned image volume in Fiji by clicking on File | Import | Image Sequence and navigating to the folder with the aligned images.\nIn the dialog window, click on Sort names numerically if the images are named in numerical order. Click on Use virtual stack for faster Fiji performance.\nOnce the image is open, click on Image | Properties and insert the physical size of the image volume pixels in micrometers in the pixel height, width, and depth boxes. Type um OR µm in each of the rightmost boxes. Save this aligned image volume as a .tiff file by clicking File | Save As | Tiff.\n\t\t​NOTE: If the image was scaled, the top of the image should now indicate the size of the image in micrometers (e.g., 9.82 x 8.65 µm).\n2. Neurite and synaptic spinule identification\nWhile scrolling through the stack (using the arrow keys or mouse wheel), refer to the neurite identification decision tree (Figure 1) and examples of sectioned neurites (Figure 2) to locate and identify the objects of interest.\n\t\nIdentify synaptic spinules as membrane-bound protrusions from a neurite that becomes fully enveloped within a presynaptic or postsynaptic neurite.\n\t\tNOTE: Positive synaptic spinule identification requires visual evidence of the spinule-projecting object membrane invaginating into the inverted membrane of a presynaptic or postsynaptic structure and the presence of the membrane-bound spinule fully encapsulated by the pre- or postsynaptic structure's membrane in at least one image.\nMaking regions of interest (ROIs) in Fiji\n\t\nClick on an appropriate tool in the Fiji toolbar (e.g., oval tool) and then click and drag on the image to form an ROI. Record this ROI in the ROI Manager by typing the letter \"T.\"\n\t\tNOTE: The ROI Manager should now appear with the image coordinates as its default name.",
    "Rename the ROI as desired by clicking the Rename button in the ROI Manager and typing the desired name in the text box that appears. Rename ROIs based on quantitative criteria (e.g., the 12th presynaptic bouton that is analyzed and has two synapses with postsynaptic spines might be named B12_s,s).\n\t\tNOTE: To associate each ROI with one image \"slice\" (rather than have it present in the entire image stack) and to make ROI names visible on single images, click on these options in the ROI Manager | More | Options window and then click the Show All and Labels check boxes at the bottom of the ROI Manager. Note that this step is crucial when saving ROIs within an image volume because associating ROIs with the entire image volume rather than individual images can lead to double-counting of objects within the volume.\nTo save all the ROIs currently in the ROI manager as a file, first, click the Deselect button in the ROI Manager, click the More button, and scroll down to Save.\n\t\t​NOTE: This saved .zip file can now be opened in Fiji to reload all of these ROIs into the ROI Manager.\n3. Determine the area of interest and transfer image volume to 3D analysis software\nDetermine whether it is desirable to transfer the entire image volume to the 3D reconstruction and analysis software, or if a smaller substack (see 3.3.2) should be created to analyze a smaller number of images and/or region of interest from the original stack.",
    "Run a small 'pilot' study on a relatively small area containing the object(s) of interest to estimate effect size and the number of objects of interest required to obtain the desired power for statistical comparisons. Use a conservative estimate of the size of the image volume required to sample the objects of interest if these subcellular objects are non-uniformly distributed within the image volume.\nTo use a portion of the image volume for 3D analysis, first duplicate the image volume by clicking on Image | Duplicate.\n\t\nTo use a cropped portion of the image for analysis, choose the rectangle tool from the Fiji tool bar and draw the desired region of interest; if this is not desired, continue to the next step.\nGo to Image | Stacks | Tools | Make Substack. Type in the range of images to include within the substack (e.g., include images 1 to 500 by typing 1 - 500) in the text box.\nRefer to the sampling considerations above (note after 1.1) to determine the required z-resolution based on the size of the object(s) of interest. For example, if the image volume has a voxel depth of 5 nm, it is possible to sample the object of interest at 10 nm intervals in the z-dimension so that Fiji retains every other image in the substack. To do this, type the number of the nth image after the range (e.g., to only include every other image in a 1 - 500 image range, type 1 - 500 - 2).\n\t\t​NOTE: Each 3D analysis software package (see Table 1) will have its own file import requirements. This protocol focuses on importing image volumes saved as .tiff files into the image volume software, Reconstruct.\n4. 3D reconstructions and analysis of thin subcellular structures in Reconstruct",
    "NOTE: It is highly advantageous to use a mouse equipped with a wheel while using Reconstruct. In addition, if most or all traces will be performed manually, using a stylus to draw outlines on a computer with a touchscreen can dramatically increase trace efficiency.\nDownload and install Reconstruct (https://synapseweb.clm.utexas.edu/software-0) for use on a computer running Microsoft Windows in a native or virtual environment.\nStart a new reconstruction by creating a new folder for the reconstruction files, clicking on Series | New, and saving this reconstruction (.ser file) with the desired file name in the folder that was just created.\nImport the saved .tiff image volume into Reconstruct.\n\t\nNavigate to Series | Import | Images, click Select in the Import Images window, and locate the image volume file. In the Import Images window, look for the image volume files that appear as a separate line for each image in the volume.\nImportant: Type the correct pixel size in the Pixel Size text box to correspond to the x/y pixel size (in µm) of the image volume. Once this is done, click on the Import button in the Import Images window.\n\t\tNOTE: Once the images have been imported, there should be an image in the middle of the Reconstruct window, and the Import Images list should be empty.\nIf there is an image in the middle of the Reconstruct window and the Import Images list is empty, click on Quit in the Import Images window.\nSet the section thickness (i.e., voxel height or z-dimension) by clicking on Section | List sections, highlighting all of the listed sections, then clicking on Modify | Thickness in the Section List menu and typing the section thickness (in µm) into the text box (e.g., 0.005 for a 5 nm thick section).",
    "NOTE: Recall that if working with a substack from a larger original image volume that only includes every nth section (see step 3.3.3), it is necessary to account for these 'missing' sections in the total section thickness. For example, if the original image volume section thickness (aka voxel height) was 0.005 µm, and the substack only includes every third section (e.g., 1-500-3), the section thickness of this substack is 0.015 µm (i.e., 0.005 µm x 3 sections).\nMake traces of the objects of interest.\n\t\nGo to Series | Options | Names/Colors Tab to give the new object a name. Pick a color for the outline and interior fill of the object's traces, and then click OK.\n\t\tNOTE: Reconstruct will attempt to connect all traces with the same name as one object. Refer to the Reconstruct manual for trace naming conventions (e.g., do not include spaces in names). Trace colors are merely for visualizing traces; the color of this object's 3D reconstruction can be easily altered later.\nOn the Toolbar, select the Draw Freehand tool that looks like a pencil. Hold down the left mouse button and drag the mouse to trace the object's membrane; let go of the left mouse button to autocomplete the trace. Click Page Up / Page Down or use the mouse wheel to advance to the next optical section in the image volume and progressively make traces until the structure is complete.\nTracing synaptic spinules\n\tNOTE: Embedded spinules within presynaptic boutons appear as membrane-bound transparent structures, occasionally with actin-like electron-opaque material and/or membrane-like folds in their interior.\n\t\nAdvance through the image volume and locate the site of spinule invagination into the presynaptic bouton, being careful to differentiate spinules from endoplasmic reticula, vacuoles, endosomes, autophagosomes, and other subcellular organelles.",
    "NOTE: Unlike membrane-bound organelles, ensure that synaptic spinules always project from (i.e., everted membrane) a neurite/glia and are received by (i.e., inverted membrane) a pre- or postsynaptic structure. This visual evidence of spinule invagination should occur in ≥2 images, and a fully encapsulated membrane-bound spinule should be present within the pre- or postsynaptic structure in ≥1 image. Small spinules may be clathrin-coated. To differentiate spinule invagination events from clathrin-coated endocytosis into the pre- or postsynaptic neurite, ensure that positive identification of clathrin-coated spinules requires visual confirmation of the coincident everting membrane from the spinule parent object projecting into the inverting membrane of a pre- or postsynaptic structure within the same image.\nAdvance through the image volume to locate the site of spinule projection/origin from its parent neurite/glia; refer to Figure 1 and Figure 2 to help identify these parent structures.\nBegin the trace of the spinule at the site of membrane protrusion into the receiving structure (e.g., presynaptic bouton) and continue drawing the spinule for as long as it appears as a membrane-bound structure within the encapsulating pre- or postsynaptic neurite.\nContinue holding down the left mouse button (or keep drawing along the spinule membrane with a stylus if using a touch screen computer) while tracing the membrane of the spinule with the mouse pointer.\nWhen the point where the trace started is reached, let go of the left mouse button.\n\t\tNOTE: Letting go of the left mouse button too soon will autocomplete the trace, often with undesirable results. If this happens, simply hit delete while this trace is highlighted in the Trace List.\nRepeat steps 4.5.2-4.5.5 for every section where the spinule appears.",
    "NOTE: Remember to trace the spinule as an encapsulated membrane-bound structure within the bouton when appropriate. Because Reconstruct does not permit the automated subtraction of encapsulated subcellular structures (e.g., spinules, subcellular organelles) from the encapsulating structure's volume, this can be performed post-hoc (e.g., by simply subtracting the spinule volume from the presynaptic bouton's total volume).\nReconstructing objects in 3D in Reconstruct\nNavigate to Series | Options | 3D tab, and ensure the Traces radio button is clicked.\nOpen the Object List by clicking Objects | List objects.\nOnce the names of the traced object(s) load in the window, double-click on the name of the object(s) in the Object List to view them in 3D. Wait for the 3D Scene window to appear.\nEnsure that the start, end, and counts of the traces are correct in the Object List for each object, such that the Count = End - Start. If the Count ≠ End - Start for an object, then one or more traces from this object may have mistakenly been omitted.\nRotate the 3D traces of the object(s) by holding down the left mouse button and moving the mouse and/or holding down the right mouse button and moving the mouse forward and backward to zoom in and out. Ensure that the object's traces are appropriately aligned and that there appears to be a smooth transition between each successive trace.\nIf necessary, retrace individual traces to remove errors that lead to sharp edges and/or transitions between traces.\nPut a tetrahedral mesh skin on the object by navigating to Series | Object | 3D tab and clicking on the Boissonnat surface radio button.\nIn the 3D Scene window, click on Scene | Clear, then double-click on the desired object name in the Object List.",
    "Rotate the object(s) to ensure smooth transitions between traces and redraw traces if necessary.\nTo change object colors and transparency, click on the name of the object in the Object List, and then click on Scene | Color/transparency... in the Object List menu. Double-click on the object name in Object List to view this change in the 3D Scene window.\n\t\tNOTE: Object color, transparency, and smoothing can be altered with a greater degree of control and specificity using Blender (see 5.4-5.6).\nQuantitative analysis of 3D objects\n\t\nNavigate to Series | Options | Lists tab and click on all the desired measurements in the Object List and Trace List sections of this window.\nExport the object measurements by opening the Object List (Object | List objects...) and then clicking on List | Save.\nSave the object measurements as displayed in the Object List as a comma delimited file (.csv).\nImport the .csv file into the data analysis software of choice. To import into a spreadsheet (e.g., Microsoft Excel), simply double-click the file, or open a new blank workbook, click on File | Import | CSV file option, and follow the instructions.\nTo measure the distances between objects in 3D (e.g., to measure the projection distance of a synaptic spinule within a presynaptic bouton), use the Z-trace function in Reconstruct.\nFirst, give the trace a new name by navigating to the Series | Options | Names/Colors tab and typing in a name for the Z-trace.\nNext, click on the Z-trace tool in the toolbar.",
    "To draw the Z-trace of the projection distance of a synaptic spinule, click on the start of the synaptic spinule by clicking on the left mouse button, and then press the Page Up or Page Down buttons to advance through the image volume while clicking on successive points along the synaptic spinule's membrane within each section.\nComplete this Z-trace by clicking on the right mouse button.\nExport Z-trace measurements by clicking on Trace | List traces... to bring up the Trace List and then clicking on List | Save to save the trace list measurements as a .csv file.\nAdding a scale cube\n\t\nNavigate to one of the first or last images in the stack\nGo to Series | Options | Names/Colors tab and type a name for the scale cube.\nIn the toolbar, pick the Draw Rectangle tool and draw a small square (size unimportant) adjacent to the objects but not obscuring them.Go to Series | Options | 3D tab, click on the Box radio button option in the Generate area, and specify the size of the scale cube (in µm) by typing its dimensions in the A:, B:, C: boxes in the Size area (e.g., type 0.5 for A, B, and C to generate a 0.5 µm/side scale cube).\n\t\tNOTE: Before attempting to reconstruct the scale cube in 3D, be sure to have the desired 3D objects already reconstructed in the 3D Scene using the Traces or Boissonnat surface option. Remember to change the Generate option back to Boissonnat surface and the sizes of A, B, and C back to -1 after reconstructing the scale cube (i.e., after step 4.8.5).\nOpen the Object List and double-click on the name of the scale cube; wait for the scale cube to appear in the 3D scene window.",
    "To move the scale cube relative to the other objects, go to the Series | Options | 3D tab and type the number of µm desired to move the scale cube into the X, Y, and/or Z boxes. Click OK to close the window, and then double-click on the name of the scale cube in the Object List.\n\t\t​NOTE: Alternatively, this can be done using Blender (see below).\n5. Importing, recoloring, smoothing, and adding transparency to 3D reconstructions in Blender\nNOTE: For detailed assistance in using Blender, please consult the Blender manual and/or the myriad \"how to\" videos on using each Blender function (simply do a web search for Blender AND Desired Function). What follows is a short primer on how to recolor, smooth, and add transparency to 3D reconstructions.\nDownload and install the latest version of Blender, the free, open-source 3D software suite (www.blender.org).\nIn Reconstruct, save the 3D reconstructions by bringing up the desired object(s) in the 3D scene window and then clicking Scene | Export As | VRML 2.0.\nIn Blender, navigate to File | Import | X3D Extensible 3D (.x3d/.wrl). Click on the VRML 2.0 file that was saved from Reconstruct and then click on the Import X3D/VRML2 button.\nRecolor the reconstructions.\n\t\nIn the Scene Collection window, in the upper right corner, click to deselect/uncheck the eye icon for the default Cube object, and click on the names of the individual objects to highlight each object in the scene. Rename these objects as appropriate.\nClick on the name of the first object to recolor in the Scene Collection window.",
    "Click on the circular Context. Material icon on the bottom of the righthand strip of icons, and then click Add Material. A list of options should appear below. Next, click on the bar next to the Base Color option and choose the desired luminance and hue for the object.\nTo alter the metallic appearance, shininess, and reflective qualities of the object, adjust the Metallic, Specular, Roughness, and Sheen options to produce the desired effect.\n\t\tNOTE: For certain options to appear in the Scene (e.g., transparency, sheen), it may be necessary to be in the Viewport Shading: Look Dev or Viewport Shading: Rendered viewport setting. To change to either viewport setting, hover over the globe icons in the upper right and click on the desired viewport setting.\nTo change the lighting angle, click on the Light object in the Scene Collection window, click on the Show Gizmo icon on the top right, and then drag the light around the scene to achieve the desired lighting effect. Change the light intensity in the Object Data window that appears underneath the Scene Collection window when the Light object is selected.\nTo rotate objects in select axes separately, click on the names of the objects in the Scene Collection window, hit the R key, then click on the letter of the axis of rotation (x, y, or z key), and move the mouse to produce the desired rotation. To grab and move objects, select them in the Scene Collection window, hit the G key, and then use the mouse to move objects around the scene.\nRemesh (i.e., smooth) the reconstructions.\n\t\nClick on the name of the object of interest from the Scene Collection window and then use the gimball and mouse wheel to center and zoom in on the object.",
    "Click on the Context.Modifiers wrench icon on the righthand strip of icons, click Add Modifier, and then Remesh (under the Generate heading). Use the dropdown menu to select Smooth, click on the Smooth Shading button, and change the Octree Depth and Scale to achieve the desired smoothness.\n\t\tNOTE: It is helpful to be in the Viewport Shading: Wireframe window (globe icon option in upper right) while remeshing to view the results directly. Remeshing will create different-sized tetrahedral meshes on the object. While smoothing the object to remove sectioning or tracing artifacts, be careful to retain its original shape and contours. Start at an Octree Depth = 7 and a Scale = 0.95, and then decrease these numbers slowly if necessary. Pay particular attention to small, thin objects, such as spinules and postsynaptic densities, as the small volume of these objects decreases the range of smoothing that can be done without altering their original shape.\nAdd transparency to objects.\n\tNOTE: Making objects transparent is important when it is desirable to show the 3D relationship of one object (e.g., spinules, presynaptic vesicles, mitochondria, endosomes) residing within another object (e.g., a presynaptic bouton).\n\t\nClick on the desired object name in the Scene Collection window. Scroll to the bottom of the Context. Material window (bottom right icon in righthand list), open the Settings section, and use the dropdown menu to change the Blend Mode to Alpha Blend. Next, open the Surface section, scroll up to Alpha, and change the number to a value less than one (1 = fully opaque, 0 = fully transparent).\nExport snapshots of the 3D reconstructions.\n\t\nOnce the optimal coloring, smoothing, and lighting for the 3D reconstructions have been obtained, save the image within the scene by clicking on the menu heading Window, and selecting Save Screenshot.",
    "In the Save Screenshot options on the lower left, choose the file type, color format, and compression desired.\nType the name for the new screenshot in the file name text box above, and then save the screenshot in the desired location.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}