{
  "id": 18788,
  "origin_website": "Jove",
  "title": "Enhancing the Engraftment of Human Induced Pluripotent Stem Cell-derived Cardiomyocytes via a Transient Inhibition of Rho Kinase Activity",
  "procedures": [
    "All animal procedures in this study were approved by the Institutional Animal Care and Use Committee (IACUC) of the University of Alabama at Birmingham and were based on the National Institutes of Health Laboratory Animal Care and Use Guidelines (NIH Publication No 85-23).\n1. Preparation of Culture Media and Culture Plates\nMedium preparation\nFor hiPSC medium, mix 400 mL of human pluripotent stem cell (hPSC) basal medium (Table of Materials 1) and 100 mL of hPSC 5x supplement; store the mixture at 4 °C.\nFor RPMI 1640/B27 minus insulin (RB-) medium, mix 500 mL of RPMI 1640 and 10 mL of B27 supplement minus insulin.\nFor RPMI 1640/B27 (RB+) medium, mix 500 mL of RPMI 1640, 10 mL of B27 supplement, and 5 mL of penicillin-streptomycin (pen-strep) antibiotic.\nFor purification medium16, mix 500 mL of no-glucose RPMI 1640, 10 mL of B27 supplement, 5 mL of pen-strep antibiotic, and 1,000 μL of sodium DL-lactate solution (at a final concentration of 4 mM).\nFor neutralizing solution, mix 200 mL of RPMI 1640, 50 mL of fetal bovine serum (FBS), 2.5 mL of pen-strep antibiotic, and 50 μL of Y-27632 (at a final concentration of 10 μM).\nFor freezing medium, mix 9 mL of FBS, 1 mL of dimethyl sulfoxide (DMSO), and 10 μL of Y-27632 (at a final concentration of 10 μM).\nFor extracellular matrix solution (EMS), thaw concentrated extracellular matrix (Table of Materials 1) at 4 °C until it has reached an evenly consistent liquid state. Precool pipette tips and tubes prior to making matrix aliquots of 350 µL each on ice, and store the aliquots at -20 °C. Before coating the plates, dilute one thawed aliquot into 24 mL of ice-cold DMEM/F12 medium (EMS); keep the EMS in 4 °C for up to 2 weeks.",
    "NOTE: Perform all coating steps on ice to prevent basement membrane matrix solidification.\nFor Tyrode’s solution, take 90% of the final required volume of tissue culture grade water, add the appropriate amount of the following reagents, and stir until dissolved. Then, use 1 N NaOH to adjust the pH to 7.4. Add extra water to a final concentration of 140 mmol/L sodium chloride, 1 mmol/L magnesium chloride, 10 mmol/L HEPES, 5 mmol/L potassium chloride, 10 mmol/L glucose, and 1.8 mmol/L calcium chloride. Sterilize by filtration, using a 0.22 µm membrane.\nCell culture plate coating\nFor hiPSC culture plates, apply 1 mL of EMS to each well of a 6-well plate and incubate the plate for at least 1 h at 37 °C. Aspirate DMEM/F12 solution before seeding cells.\nFor gelatin coating, dissolve 0.2 g of gelatin powder in tissue culture grade water to make a 0.2% (w/v) solution. Sterilize by autoclaving at 121 °C, 15 psi for 30 min. Coat each well of a 6-well plate with 2 mL of the solution and incubate for 1 h at 37 °C. Before passaging the cells, aspirate the solution and allow the plate to dry for at least 1 h at room temperature inside the tissue culture hood.\n2. hiPSC maintenance and Cardiomyocyte Ddifferentiation\nCulture the hiPSCs in hiPSC medium (see step 1.1.1) with a daily medium change until the cells reach 80%–90% confluence per well.\nNOTE: For maintenance purposes, hiPSCs are generally ready for passage every 4 days.\nTo passage hiPSCs, aspirate the medium and wash the well 1x with 1x phosphate-buffered saline (PBS). Add 0.5 mL of stem cell detachment solution (Table of Materials 1) to each well and incubate at 37 °C for 5–7 min.",
    "NOTE: The incubation time depends on the density of the cells and the rate of dissociation, which can be observed under a microscope.\nNeutralize the stem cell detachment solution with 1 mL of hiPSC medium supplemented with 5 μM Y-27632. Collect the mixture in a 15 mL centrifuge tube. Centrifuge the tube for 5 min at 200 x g, aspirate the supernatant without disturbing the cell pellet, and then, resuspend the cells in 1 mL of hiPSC medium containing 5 μM Y-27632.\nSeed the hiPSCs onto a new EMS-coated 6-well plate at a ratio between 1:6 to 1:18. Change the medium to hiPSC medium without Y27632 after 24 h.\nTo freeze the cells, resuspend the dissociated hiPSCs in freezing medium at a concentration of 0.5–1 million/500 μL, place the suspension in cryovials, and store them in a -80 °C freezer. Transfer the frozen vials to liquid nitrogen after 24 h.\nTo differentiate, replace the hiPSC medium with 2 mL of RB- medium supplemented with 10 μM GSK-3β inhibitor CHIR99021 (CHIR) at 80%–90% cell-confluence. Replace the medium with 3 mL of RB- medium after 24 h and incubate for an additional 48 h (day 3).\nOn day 3, change the medium to 3 mL of RB- medium with 10 μM Wnt inhibitor IWR1 for 48 h (day 5), and then replace the medium with 3 mL of RB- medium and maintain for 48 h (day 7).\nOn day 7, replace the medium with 3 mL of RB medium and change the medium every 3 days going forward. Spontaneous beating of hiPSC-CMs should be observed between days 7–10.\n3. hiPSC-CMs Purification and Small Molecule Pre-treatment\nNOTE: Highly purified, recombinant cell-dissociation enzymes (Table of Materials 1) were used to dissociate hiPSC-CMs.",
    "On day 21 after hiPSC-CM differentiation, aspirate the medium and wash the cells 1x with sterile PBS. Incubate the cells with 0.5 mL of cell-dissociation enzymes per well for 5–7 min at 37 °C. Repeatedly pipette the cell suspension using a 1 mL pipette in order to thoroughly dissociate the cells.\nAfter the cells are dissociated, add 1 mL of neutralizing solution to each well, collect the cell mixture into a 15 mL centrifuge tube and centrifuge at 200 x g for 3 min. Discard the supernatant and resuspend the cells in neutralizing solution.\nReplant the cells onto gelatin-coated 6-well plates at a density of 2 million cells per well.\nAfter 24–48 h, replace the culture medium with purification medium for 3–5 days.\nNOTE: Purification is complete when more than 90% of the cells in each microscope view field are beating. To prevent further damage to the cardiomyocytes, do not extend the purification duration beyond 5 days. If the first round does not yield the necessary purity, replace the purification medium with RB+ medium for 1 day, and then complete a second round of purification.\nPrior to transplantation, culture the cells in the treatment group for 12 h in RB+ medium supplemented with 10 μM Y-27632. Similarly, perform verapamil treatment on the cells in the RB+ medium with 1 μM verapamil for 12 h (hiPSC-CMs+VER).",
    "After treatment, wash the hiPSC-CMs 1x with PBS and incubate the cells with 0.5 mL of cell-dissociation enzymes per well for a maximum of 2 min. Repeatedly pipette the cell suspension, using a 1 mL pipette, to thoroughly dissociate the cells. Neutralize the cells with neutralizing solution, collect the cell mixture in a 15 mL centrifuge tube, and centrifuge at 200 x g for 3 min. Resuspend the cells in PBS at a concentration of 0.1 million cells/5 μL in preparation for injection.\n4. Myocardial Infarction and Cell Transplantation\nNOTE: All surgical instruments are presterilized with autoclave and are maintained in aseptic condition during multiple surgeries via a hot bead sterilizer (Table of Materials 2).\nAnesthetize NOD/scid mice (Table of Materials 2) with inhaled isoflurane (1.5%–2%). Monitor the anesthesia levels by the mice’s responses to a toe pinch. Place vet optical ointment onto the eyes to prevent them from drying during surgery.\nSupply 0.1 mg/kg buprenorphine subcutaneously for pain management prior to surgery.\nPosition and secure the mouse in a supine position on a heated operating table, remove the hair from the ventral neck region and the left thorax using a depilatory cream, expose the skin, and disinfect it with 70% alcohol.\nCut a 0.5 cm incision at the center of the neck using surgical scissors, separate the subcutaneous fat with sterile forceps, and expose the trachea. Introduce orally the intubation cannula into the trachea, connect the cannula to a small animal ventilator, and adjust the ventilation settings (set the tidal volume at 100–150 μL and the respiration rate at 100x–150x per min).",
    "After the mouse stabilizes, cut a 0.5 cm incision in the middle of the left chest skin. Use forceps to bluntly separate the muscle layer and make a small incision in the fifth intercostal space to expose the chest cavity. Place the retractor in the incision to open the thoracic cavity and locate the left descending coronary artery (LAD). Under a dissecting surgical microscope, ligate the LAD with an 8-0 nonabsorbable suture.\nImmediately following MI induction, inject 5 μL of hiPSC-CMs-RI, hiPSC-CMs+RI, hiPSC-CMs-VER, hiPSC-CMs+VER, or an equal volume of PBS into the mouse’s myocardium at each site (3 x 105 cells/animal, 1 x 105 cells/site), one in the infarct area and two in the areas around the infarct.\nNOTE: Since 5 μL is very small volume, it is not easy to accurately control the volume by directly sucking it with a syringe. The lid of a sterile Petri dish can be turned over, and 5 μL of the cells can be first deposited on the lid with a pipette. Due to the surface tension, it will not spread but will condense into a small liquid mass. This can be easily absorbed and injected into the mouse’s myocardium.\nEliminate residual air in the thoracic cavity by filling it up with warm isotonic saline solution. Stitch the ribs, muscles, and skin in sequence with a 6-0 absorbable suture. Turn off the isoflurane anesthesia injection. Keep the surgery animals on the heating pad and closely observe them while they regain full consciousness. Then, place the animals in a clean cage. Do not return the animals to the company of other animals until they are fully recovered.",
    "Following surgery, inject the mice intraperitoneally with buprenorphine (0.1 mg/kg) every 12 h for 3 consecutive days and inject them with ibuprofen (5 mg/kg) every 12 h for one day. Perform subsequent analysis studies at specified time points.\nNOTE: Follow your local animal care committee guidelines for analgesia.\n5. Calcium Transient and Contractility Recording\nAutoclave 15 mm-diameter coverslips (Table of Materials 2) and tweezers in a small glass beaker at 121 °C, 15 psi for 15 min. Precool the coverslips and tweezers at 4 °C.\nUsing the tweezers, place the coverslip into a 12-well plate and pipette 300 μL of extracellular matrix onto each coverslip.\nNOTE: Do not let the matrix exceed the edge of the coverslip to prevent reducing the matrix coating amount. Incubate the 12-well plate in a 37 °C cell culture incubator for 1 h.\nAspirate the medium in the gelatin-coated 6-well plate with purified hiPSC-CMs, wash it 1x with PBS, and then digest it with 0.5 mL of cell-dissociation enzymes for 1.5 min. Add 1 mL of neutralizing solution, pipette repeatedly for no more than 5x–10x with a 1 mL pipette, and centrifuge the mixture at 200 x g for 3 min.\nAspirate the coated extracellular matrix from the coverslips. Count the cell number and resuspend the cells in the neutralizing solution to a concentration of 40,000/300 μL, and then add 300 μL of the cell suspension onto each coverslip. Culture the plate in a 37 °C incubator.\nAfter 24 h, gently aspirate the neutralized solution, add 500 μL of RB+ medium to each well of the plate, and continue to culture for 2 days.",
    "Add Y-27632 (10 μM), Rho kinase activator (RA, 100 nM), verapamil (1 μM), or an equal volume of PBS into the culture medium of hiPSC-CMs, 12 h before calcium transient and contractility detection.\nNOTE: In addition to the detection of the cells’ calcium transient and contractility after 12 h of chemical treatment, the detection of these parameters was also tested at 12, 24, 48, and 72 h after chemical withdrawal.\nTake out the plate, discard the medium, and wash the plate 1x with PBS. Change the medium to a phenol-red-free DMEM containing 0.02% (w/v) of surfactant polyol (Table of Materials 1), 5 μM calcium indicator (Table of Materials 1), and the corresponding Y-27632 (10 μM), RA (100 nM), verapamil (1 μM), or an equal volume of PBS, and incubate the plate for 30 min at 37 °C.\nDiscard the supernatant, wash the cells 3x with dye-free DMEM medium, and let the medium rest for 30 min to de-esterify the mapping dye.\nPlace the cell-seeded coverslip in an open bath chamber and insert the chamber into a microincubation system equilibrated to 37 °C with an automatic temperature controller (Table of Materials 2), perfuse it with Tyrode’s solution, and continuously add Rho kinase inhibitor (RI), RA, or PBS to the perfusion solution.\nUse an inverted fluorescence microscope (Table of Materials 2) and a laser scanning head (Table of Materials 2) to record spontaneous calcium transient by employing an x-t line scan, using a 488 nm argon laser for dye excitation and a 515 ± 10 nm barrier filter to collect emission light. Record the spontaneous contraction of hiPSC-CMs using the Differential Interference Contrast functionality of the the confocal microscope (Table of Materials 2).",
    "NOTE: Calcium transient recordings were processed and analyzed using MATLAB R2016A software (Table of Materials 4). Cell contraction change assays were performed using ImageJ software (Table of Materials 4).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}