{
  "id": 17516,
  "origin_website": "Jove",
  "title": "Measurement of Myocardial Lactate Production for Diagnosis of Coronary Microvascular Spasm",
  "procedures": [
    "The measurement of myocardial lactate production during ACh provocation testing to evaluate coronary vasoreactivity was conducted following the ethical principles in the Declaration of Helsinki, and the protocol was approved by the Ethics Committees of Tohoku University (No.2016-1-643). All the patients provided written informed consent before the procedure. In this article, ACh provocation testing was performed following the guidelines of the Japanese Circulation Society9.\n1. Preparation for the procedure\nEnsure that the measurement of myocardial lactate production is performed in patients undergoing ACh provocation testing to diagnose VSA and/or microvascular angina (MVA) due to vasospasm.\nEnsure that the patients discontinue all vasoactive agents for accuracy of those diagnoses, including calcium channel blockers, long-acting nitrates, and nicorandil, at least 48 h before catheterization study9.\nDo shave hair at puncture sites, including both inguinal regions and wrists.\n2. Insertion of catheters before ACh provocation testing\nUse local anesthesia at puncture sites with subcutaneous 1% lidocaine to insert intravenous and radial artery sheaths.\n\tNOTE: The anesthesia effect is confirmed by the loss of pain sensation at the anesthetized area by pricking with a needle.\nPlace two 5 Fr venous sheaths through the right or left femoral vein with ultrasound guidance.\n\tNOTE: One venous sheath is used to insert a temporary pacing electrode in the right ventricle in case of severe bradycardia after intracoronary ACh. The other one is for a CS catheter to obtain blood samples to measure lactate levels in the CS.\nPlace a 5 or 6 Fr arterial sheath through the radial or femoral artery.\nAdminister intravenous heparin (50 to 70 U/kg) to achieve therapeutic anticoagulation (activated clotting time ~250 s) before coronary instrumentation.\nCanulate a 5 Fr or 6 Fr Judkins-left catheter into LCA through the radial or femoral artery.",
    "NOTE: The usual catheter manipulations are performed with the Judkins left catheter.\nAdvance a CS catheter, for often a hydrophilic coating Amplatz-left catheter is used, from a venous sheath placed at the right femoral vein to the right atrium.\nConfirm the configuration of CS and the location of its orifice in the right atrium in advance by detecting the CS image in the venous phase of LCA angiography (Figure 1A).\nCanulate an Amplatz-left catheter into CS by turning the catheter counterclockwise at the right atrium with the left anterior oblique (LAO) view.\nVerify whether the catheter is cannulated into CS and its position in CS is adequate by contrast injection from the end of the catheter (Figure 1B).\n\tNOTE: The venous phase of the LCA angiography confirms whether the catheter is cannulated into CS.\nTake a pair of blood samples from the CS and the ostium of LCA simultaneously to examine myocardial lactate metabolism at baseline. Then, measure lactate levels in those samples using blood gas analysis equipped with automatic lactate measurement function.\n3. Measurement of myocardial lactate production during ACh provocation testing\nPerform the baseline left coronary angiography in an appropriate projection that ensures the best separation of the branches of each coronary artery, and serial angiographies after intracoronary injection of ACh should be performed in the same projection.\n\tNOTE: Since the great coronary sinus drains blood from perfusion regions of the LCA but not from the right coronary artery, evaluation of myocardial lactate production is possible only for the LCA during ACh provocation testing8,10.",
    "Administer ACh into the coronary artery in a cumulative manner (ACh 20, 50, and 100 µg in 10 mL of solution) over 20 s with careful monitoring of blood pressure and 12-lead electrocardiography (ECG). Perform coronary angiography when chest pain or any ECG ST-segment change occurs, or routinely after completing each ACh injection9,11.\nCollect paired samples of 1 mL of blood from the LCA ostium and the CS to measure lactate concentrations at 1 min after each dose of ACh is given to LCA and determine lactate concentrations with a calibrated automatic lactate analyzer.\nCalculate the lactate extraction ratio (LER) by dividing the coronary arteriovenous difference in the lactate concentration by the arterial lactate concentration as follows4,8,10:\n\tLER = (arterial lactate concentration [mmol/L] - coronary venous lactate concentration [mmol/L])/arterial lactate concentration (mmol/L).\n\t​NOTE: Myocardial lactate production defined by negative LER is objective evidence to support the emerging myocardial ischemia4,8,10. Therefore, the occurrence of MVS as myocardial lactate production (negative LFR) becomes recognizable without or before the occurrence of angiographically apparent epicardial coronary spasm during ACh provocation testing3.\nAdminister 5 mg of isosorbide dinitrate into the LCA if epicardial coronary spasms were induced. Promptly, perform coronary angiography while the coronary artery is maximally dilated.\n\t\nSimultaneously, collect blood samples of 1 mL of blood from the LCA ostium and the CS to measure lactate concentrations after the relief of ACh-induced spasm.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}