{
  "id": 6601,
  "origin_website": "Bio",
  "title": "Cryo-transmission Electron Microscopy of Outer-inner Membrane Vesicles  Naturally Secreted by Gram-negative Pathogenic Bacteria",
  "procedures": [
    "Isolation of MVsGrow the bacterial strains.Grow Neisseria gonorrhoeae ATCC 43069 to confluence by spreading 0.1 ml of a 109 cell/ml suspension on the surface of chocolate agar plates using a sterile glass spreader and rotating the plate. Incubate the plates for 65 h, at 37 °C in a 5% CO2 incubator. Seeding 10 to 20 Petri dishes should provide enough MVs.Grow Pseudomonas aeruginosa PAO1 in 2 L flasks with 500 ml of trypticase soy broth at 37 °C for 5 h, and Acinetobacter baumannii AB41 in 2 L flasks with 500 ml of Müeller-Hinton broth at 30 °C for 15 h. Incubate both liquid cultures in an orbital shaker at 100 rpm.Note: This protocol can be applied to MVs produced by any Gram-negative bacteria; therefore, the first step is to establish the growth conditions of the strain under study. The growth temperature, atmosphere, culture media composition, incubation time, and agitation under which MV production is going to be studied should be established. Usually, liquid growth medium is used for strain growth and MV retrieval, but a solid medium could also be employed. This protocol describes the growth conditions in which the new O-IMVs were detected in pathogenic strains. Isolate MVs from Pseudomonas aeruginosa PAO1 and Acinetobacter baumannii AB41 from liquid media culture.Recover broth cultures of A. baumannii AB41 and P. aeruginosa PAO1 in the late logarithmic phase (OD1.8).Place cultures in 250 ml sterile polypropylene centrifuge bottles.Pellet the cells by centrifugation at 10,000 x g for 15 min at 4 °C (Allegra 25R, Beckman Coulter).Discard cells and place the supernatants in a sterile screw neck glass bottle.Filter the supernatant through 0.45-μm-pore-size membrane filters with a vacuum filtration unit to remove remaining bacterial cells.",
    "Place the filtered supernatants in 50 ml sterile polyprolylene centrifuge tubes and centrifuge at 45,000 x g for 1 h at 4 °C (Avanti J-20 centrifuge, Beckman Coulter).Carefully discard the supernatant and save the pellet (normally a very small pellet is obtained). Resuspend the pellet in 50 ml of 50 mM HEPES pH 6.8 and filter it through a 0.22-μm-pore-size disposable filter device using a syringe and saving the filtrate in another 50 ml sterile polyprolylene centrifuge tube.Pellet the vesicles again at 45,000 x g for 1 h at 4 °C and resuspend the pellet in 500 µl of H2O. Measure the concentration of MVs obtained with the Lowry method. For a correct visualization of the MVs by cryo-TEM, a final concentration of 0.1-1 mg/ml of protein is suitable.The final volume used to resuspend the MV pellet can be adjusted depending on the yield of MVs obtained with each particular strain. 20-50 µl should be enough to prepare grids for cryo-TEM observation.Isolate and purify MVs from Neisseria gonorrhoeae ATCC 43069 from confluent solid cultures.Resuspend cells and MVs from each agar plate by adding 15 ml of Ringer ¼ per plate and using a cell scraper. Place all the volumes together in a screw neck glass bottle.Place resuspended cells in 250 ml sterile polypropylene centrifuge bottles.Follow the previously described steps from A2c to A2k.VitrificationSwitch on the Vitrobot by the toggle switch at the back (Figure 3A and Video 1).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Cryo-TEM of bacterial outer membrane vesicles Fill the humidifier with distilled water.Fill the syringe with 60 ml distilled water and inject through the plastic tube located at the bottom (Figure 3A and Video 1). Switch on the chamber light using the “console” page of the Vitrobot User Interface.Change the blotting pads.",
    "Manually pull out the front door of the Vitrobot chamber and remove the plastic rings from the blotting pads, attach new pieces of filter paper to the plastic rings and clip them to the blotting pads (Video 1). Set the conditions using the Vitrobot User Interface.On the “console” page, set the conditions of the chamber to 25 °C and 100% humidity (Figure 3B and Video 1).Go to the “options” page and set the blotting and freezing conditions as follows: blot offset 0, blot total 1, blot time 2.5, wait time 120 s, plunge time 0 and drain time 0 (Figure 3C and Video 1).Also set other user specifics: tick “using footpedal” and “turning off the semi-automatic grid” (Figure 3C and Video 1). Note: Blotting and freezing conditions need to be adjusted to each kind of sample. The conditions described here proved suitable for bacterial MVs of different strains. Prepare the tools.Apply some ethanol to the tip of the forceps as well as nitrogen air at a pressure of 7 bars. Also apply nitrogen air to the metallic and plastic parts that will be in contact with liquid nitrogen to minimize dust contamination. The metallic parts consist of the container for liquid ethane, the support for the grid boxes and the spindle; the plastic parts consist of the grid box and the grid box container (in our case, modified Falcon tubes) (Figure 3D and Video 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190914/20190914055212_8038.jpgFigure 3. Vitrification. A. Vitrification Robot Vitrobot Mark III FEI. The black arrows point the entry pots to the climate chamber, the white arrow points the humidifier and the white arrowhead points the sample injection window. B. Vitrobot settings in “console page”. C. Vitrobot settings in “options page”. D.",
    "Vitrobot accessories: 1, modified Falcon tubes; 2, anticontamination ring; 3, coolant container; 4, Cryo-grid box handling rod; 5, cryo-grid box base; 6, grid-box support; 7, spindle; 8, ethane container; 9, Vitrobot tweezers. E. Vitrobot tweezers secured on the connection groove at the central axis. The black arrow points the grid and the white arrow points the connection groove. F. Vitrobot tweezers inside the climate chamber. The black arrows point the blotting pads. G. Cryo-immobilized grid inside the liquid ethane. The white arrow points the ethane container and the black arrow points the cryo-grid box base.Cool the coolant container.Mount the ethane container, the grid box support, the grid box, the spindle and the anti-contamination ring in the coolant container and fill the outer ring of the container with liquid nitrogen until all the components are cooled. All the components have been cooled when the liquid nitrogen stops boiling (Video 1).Condense the ethane.Position the exit tip of the ethane cylinder inside the ethane container, open the main valve of the gas cylinder and slowly liquefy the ethane. When the bubbles on the surface of the liquid ethane reach the bottom brim of the spindle, close the main valve of the ethane cylinder and remove the spindle (Video 1).Prepare the grids.Place the grids for the experiment on a piece of Parafilm fixed inside a Petri dish plate and bring the grids to the Glow Discharge unit (Figure 4A).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190914/20190914055239_3605.jpgFigure 4. Glow Discharge. A. Glow Discharge unit BALTEC CTA 005. The black arrow indicates the position of the grid inside the chamber. B. Glow Discharge settings.Glow-discharge the grids. Remove the lid of the Petri dish plate and ensure the carbon faces of all the grids are facing upwards.",
    "Manually pull up the chamber door of the Glow Discharge device, place the opened Petri dish plate containing the grids inside and pull down the door (Video 1).Set the timer at 30 s and the current to a value between 2 and 6 mA (Figure 4B).Press the toggle switch at the back and wait for the vacuum chamber to reach about 10-1 mbar (the red LED indicating the pressure on the panel will change to yellow) and press “start” to switch on the UV light (Video 1). Wait for the set time and the UV light will switch off automatically (Video 1).Remove the grids from the Glow Discharge unit.Switch the toggle off and wait for the chamber to be vented (the sound will stop) (Video 1).Manually pull up the door of the chamber, take out the Petri dish plate containing the grids, close the door of the chamber and transfer the grids to the Vitrobot (Video 1). After the glow discharge, liquid samples will spread over the grid surface more easily. Use the grids within one hour after charging, otherwise they will need to be charged again.Press the foot pedal or select “place new grid” in the Vitrobot interface.Mount one grid on the Vitrobot tweezers (Video 1). Place the slider of the Vitrobot forceps in the upper position, carefully attach one of the grids by its edge and lock the slider on the nearest groove of the forceps. Secure the tweezers on the connection groove at the central axis.The sample must be deposited on the carbon side of the grid. When securing the Vitrobot tweezers, the carbon side of the grid should be facing left or right, depending on which side entry port the operator is using to deposit the sample (Figure 3E and Video 1).",
    "Move the tweezers into the climate chamber. Press the foot pedal or select “start process” (Figure 3F and Video 1). Place the coolant container on the platform ring (Video 1).Raise the coolant container towards the climate chamber. Press the foot pedal or select “continue” (Video 1).Lower the Vitrobot forceps to the sample application position. Press the foot pedal or select “continue” (Video 1).Apply the sample to the grid.Open the side port of the climate chamber and apply 3 μl with a micropipette (Video 1).Activate the blotting and the plunge freezing. Press the foot pedal or select “continue” and wait for the coolant container and forceps to be lowered (Video 1).Carefully remove the forceps from the groove of the central axis of the Vitrobot.Transfer the coolant container and the forceps to the bench (Video 1). Be careful to keep the grid below the liquid ethane surface during this step. Wait until the ethane cloud has dispersed and slowly lift the grid through the ethane surface. Once the grid is completely out, quickly insert it in the outer ring containing liquid nitrogen and transfer the grid to a position of the grid box (Figure 3G and Video 1).Repeat Steps B16-B26 until all the samples have been cryo-immobilized.When necessary, thaw the liquid ethane by covering the ethane container with another empty container for a few seconds. Store the grids.When all frozen grids are inside the grid box, cool the handling rod and screw it to the center of the grid box (Video 1).Transfer the grid box to a precooled grid box container under liquid nitrogen and close it (Video 1).Note: If the samples are not going to be observed on the same day, store the grid box container in a Dewar with liquid nitrogen.  Switch off the Vitrobot.",
    "Place the coolant container in the fume hood for the evaporation of the liquid nitrogen and liquid ethane and select “exit” in the Vitrobot User Interface. When the lights are turned off, the central axis is in the parking position and the interface has shut down, turn off the toggle switch at the back of the device.Cryo-TEM observationPrepare the cryo-microscope. Transfer the grids in the Dewar with liquid nitrogen to the cryo-microscope room and cool the anti-contaminator of the microscope for at least 1 h (Video 1).Ensure the valves are closed.Go to the “Set up” tab. If the “Col. valves closed” button is not yellow, click on it (Video 1). Press “Turbo on” (Video 1).Prepare all the accessories (Figure 5A) and cover the desk of the microscope with cold insulating materials (cork plates, bubble wrap…).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190914/20190914055402_4890.jpgFigure 5. Mounting the grid on the Cryo-holder. A. Accessories: 1, lid; 2, funnel; 3, cryo-transfer station; 4, platform; 5, clip-ring tool. B. Upper view of the Cryo-holder GATAN 656 in the cryo-transfer station. The black arrow points the cryo-transfer station and the white arrow points the cryo-holder. C. Detail of the cryo-transfer station. 1, cryo-holder tip; 2, cryo grid box base. The black arrow points the position of the grid at the tip of the cryo-holder. Cool down the cryo-holder. Place the cryo-holder into the transfer station and cool it down by pouring liquid nitrogen into the Dewar of the cryo-holder and into the cryo-holder station. Connect the cable of the control station to the cryo-holder and wait till the temperature is below -165 °C (Video 1).Prepare the cryo-holder tip.Transfer the grid box to its place on the platform of the transfer station and carefully unscrew and remove the rod (Figures 5B and 5C and Video 1).",
    "Open the cryo-shield by sliding back the circular piece at the end of the central axis of the cryo-holder (just behind the Dewar), remove the clip ring with its tool and keep it under liquid nitrogen (Video 1). Note: The clip-ring tool has two tabs at the tip that can be placed oppositely or contiguously by turning the two wheels of the handle. To remove the clip-ring from the cryo-holder tip, put the two tabs together, place them in the groove around the clip-ring, move the wheels to position the tabs oppositely and pull up. Mount the grid in the cryo-holder tip.Cool the tip of the forceps, transfer one of the grids to the slot in the cryo-holder tip, secure it with the clip-ring tool and close the cryo-shield over the sample to prevent ice contamination (Figure 5C and Video 1). To secure the grid with the clip ring, place the clip ring over the grid, press down the clip-ring tool, turn the wheels of the handle until the tabs are contiguous and remove the tool. Disconnect the cable of the control station from the cryo-holder (Video 1).Prepare a polystyrene box under the compustage (Video 1).Press “Pre-pump air lock” (Video 1).Quickly remove the cryo-holder from the cryo-transfer station, and carefully introduce the tip of the cryo-holder through the hole of the microscope as far as it will go (Video 1).Rotate the cryo-holder to the right until its pivot matches the compustage groove. Press the cryo-holder lightly against the microscope and wait until the end of the count-down in the “vacuum overview” (Video 1). Be careful when rotating the cryo-holder to the right to avoid the liquid nitrogen falling onto the polystyrene box prepared in Step C9.Select “Cryo-holder” as the specimen holder.",
    "Once the count-down in the “vacuum overview” has ended, turn the cryo-holder to the left as far as it will go, and introduce it completely into the microscope (Figure 6A and Video 1).Quickly refill the Dewar of the cryo-holder with liquid nitrogen (Video 1).Connect the cable of the control station to the cryo-holder and check the temperature does not exceed -170 °C (Video 1).Click “Col. valves closed” and go to the “LowDose” tab (Video 1).Record images in low dose conditions and spot size 5.Search mode at x7800 and 0.10 e-/Å2s, focus mode at x29000 and 0.80 e-/Å2s and exposure mode at x29000 and 1.00 e-/Å2s (Figure 6B and Video 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190914/20190914055649_1945.jpgFigure 6. Cryo-TEM observation. A. Cryo-electron microscope Tecnai F20 FEI. The black arrow indicates the cryo-holder position. B. Low Dose observation."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}