{
  "id": 10545,
  "origin_website": "Jove",
  "title": "Force System with Vertical V-Bends: A 3D In Vitro Assessment of Elastic and Rigid Rectangular Archwires",
  "procedures": [
    "1. Experimental Setup\nMark the precise position for the placement of molar tubes and incisor brackets on the aluminum pegs of the OWT by using a customized 'jig'.\nBond standard self-ligating brackets with composite material. Light cure for 40 seconds.\nInsert a 0.021 x 0.025-inch stainless steel (SS) 'ovoid' maxillary archwire into the bracket slots.\nPlace the testing apparatus in the glass chamber.\nCheck for any unintended archwire activation. Any activation of the archwire will automatically create a force system, which will be displayed on the computer screen.\nReposition the brackets if any archwire activation is observed. Repeat steps 1.2-1.5.\n2. Fabrication of a Template Archwire (Figure 4)\nPlace an archwire (0.021 x 0.025 SS) in the testing apparatus.\nUse a permanent marker to indicate the following: 1) the midline, 2) a point immediately distal to the incisor bracket (I), and 3) a point immediately mesial to the molar tube (M). Do the same for the contralateral side of the archwire. This is the template arch wire.\nTransfer the archwire with the marked points to a graph paper.\nMake a precise replica of the archwire on the graph paper.\n\tNOTE: This graph paper can be used to determine the position of the V-bend for all archwires of the sample.\nCalculate the perimeter of the arch wire segment (L) from I to M.\nNow, mark 11 points from I to M. Each point is a future V-bend position.\n\t\nLabel each point from a0 to a10.\nMake sure that each bend position is separated from the other by an equal amount.\nObtain a unique number/ratio for each bend position by calculating a/L for each position.\n3. Placement of V-bends\nTake a new archwire from the sample.",
    "Place it on the template archwire/graph paper and transfer one of the eleven bend positions bilaterally to the archwire.\nUse a rectangular archwire plier or a light wire plier to make symmetrical V-bends at both the positions.\nPlace the archwire on a glass slab/flat platform and check the measurement of the angle made by the two ends of the archwire with a protractor.\nAdjust the ends if necessary so that an angle of 150° is created.\nRepeat steps 3.1 to 3.5 for all archwires of the sample.\n4. Measuring the Force System (Figures 5 and 6)\nOpen the software program for data recording (see Table of Materials).\nCreate a new folder for the data to be saved in.\nClick 'run' to start the software. The program will display each of the three forces and three-moment values at each sensor in real-time.\nWait for approximately 10-15 seconds for the fluctuations in data recording software to stop. Ensure that the graph lines on the software for all the components of the force system show a 'flat' line.\n\tNOTE: all six measurements at each sensor will show negligible values (forces < 1 g and moments < 10 g mm).\nGently remove the 'testing apparatus' from the platform. Use a Weingart plier to insert an archwire into the molar tubes.\nOpen the door of the incisor bracket with a periodontal scaler.\nLift the anterior portion of the archwire and insert it into the bracket slot. Make sure that the midline of the archwire coincides with the midline of the testing apparatus.\nReturn the testing apparatus to the platform and close the door of the glass chamber.\nSet the temperature at 37 °C. Wait for one minute for the temperature of the glass chamber to adjust.",
    "Click the 'start saving' button on the software and allow the software to save/transfer data for at least 10 seconds. Click the 'start saving' button again to end data transfer, then click 'stop'.\n\tNOTE: Each measurement cycle generates 100 readings over the 10 second period for each component (Fx, Fy, Fz, Mx, My, and Mz).\nGo to the document containing the saved data, and copy/export the data set to a custom designed data analysis spreadsheet (see Supplementary Table). Choose the correct V-bend position number and the specific wire sample to insert the data.\nRepeat steps 4.3 to 4.11 for the 10 archwires of that specific bend position.\nNow, copy the calculated means and standard deviations for the archwires to a separate spreadsheet to create a graphical representation of the data.\nRepeat steps 4.2 to 4.13 for all bend positions and types of archwires.\n\tNOTE: The archwires include, Stainless-Steel (SS) and Beta-Titanium (ß-Ti), with the following sizes: 0.016 x 0.022 inch, 0.017 x 0.025 inch, and 0.019 x 0.025 inch.\n5. Error Evaluation\nRun the computer/software as described in steps 4.1-4.4\nRemove the 'testing apparatus' from the platform.\nObtain a straight length 0.021 x 0.025-inch SS wire. Using a light wire plier, bend one end of the wire into a small hook. Insert the free end of the archwire into the molar tube from the distal side.\nPlace the testing apparatus back on the platform.\nAttach a known weight (50 g) to the hook. Let it hang freely in the vertical plane by removing any type of interference. Close the door of the glass chamber.\nFollow steps 4.10-4.11.\nRepeat steps 5.1-5.6 for the incisor bracket.\nEnter the Fz values for both the brackets and Mx for the molar tube as 'measured value.'",
    "Now apply the equations of equilibrium (see Supplementary Text) to calculate the 'expected value.'\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}