{
  "id": 10664,
  "origin_website": "Jove",
  "title": "Trapping of Micro Particles in Nanoplasmonic Optical Lattice",
  "procedures": [
    "1. Optical Setup\nNote: The principle of the optical setup is illustrated in Figure 1.\nSet up the optical tweezer kit (see the Table of Materials) and the fluorescence module (see Table of Materials) as per their manuals. Connect a 470 nm blue light emitting diode (LED) light source to the fluorescent module.\nReplace the high numerical aperture (NA) (NA= 1.25, magnification 100x) oil immersion objective by a long working distance (WD) microscope objective (focal length 3.6 mm, WD=10.6 mm, NA=0.5).\nRemove the lens in the beam expansion section of the assembled kit to achieve loose focusing of the laser beam.\nTurn on the power supply and the current for the laser diode of wavelength 980 nm and use the charged coupled device (CCD) camera to make sure the laser beam is aligned properly.\n\tNOTE: If the laser beam is well-aligned, the CCD camera will read a Gaussian spot.\n2. Nanofabrication\nMarker Fabrication.\n\tNOTE: Markers will help to position the nanoplasmonic array during the fabrication process and subsequent trapping experiment. The detailed process is illustrated in Supplementary Figure 1.\n\t\nDeposit 40 nm indium tin oxide (ITO) film on a coverslip of thickness 0.17 mm with sputtering.\n\t\tNOTE: The ITO film will help discharge electrons during the subsequent e-beam lithography process.\nSpin coat an 8 µm layer of positive photoresist with spin speed 4000 rpm and time 30 s with a spin coater.\nSoft bake the sample at 90 °C for 5 min and align the sample with the photomask for marker and expose the sample to UV light for 80 s in the mask aligner.\nSoak the sample in the photoresist developer for 130 s.\nDeposit a 2 nm layer of chromium and a 40 nm layer of gold onto the sample using thermal evaporation.18",
    "Soak the sample in acetone and place it in an ultrasonic cleaner operating at 43 kHz and 150 W for 5 min for lift off.\nFabrication of Nanoplasmonic Array\n\t\nSpin coat a layer of e-beam resist PMMA 120K with spin speed 5000 rpm for 30 s on a spin coater. Bake the sample at 160 °C for 3 min on a hot plate.\nSpin coat another layer of e-beam resist PMMA 960K with spin speed 5000 rpm for 30 s on a spin coater. Bake the sample at 160 °C for 3 min on a hot plate.\nUse e-beam writer to expose the e-beam resist with acceleration voltage 30 kV and dosage 400 C/cm2.\nDeposit a 40 nm layer of gold in a thermal evaporator.\nSoak the sample in acetone and place it in an ultrasonic cleaner for 5 min for lift off.\n3. Sample cooling system and its temperature calibration\nNOTE: The sample cooling stage design is shown in Supplementary Figure 2.\nMaking the driver circuit for sample cooling\n\t\nPlace the resistors, bipolar junction transistors, and power metal oxide field effect transistors on the custom circuit board by following the circuit diagram in Supplementary Figure 3. Solder all these components with soldering iron.\nConnect wires between the control port of the circuit board and the electronic control board. Connect the wires between the output port of the circuit board and thermoelectrical cooling (TEC) element. Place the TEC element on the sample stage with heat sinking.\n\t\t​NOTE: The TEC element has a hole in the center to allow the laser beam to go through.\nConnect wires from the circuit board to 5 V power supply. Use the forward-looking infrared camera to monitor the temperature to check if the thermoelectrical cooling is properly cooling down.",
    "Calibration of measured temperature in the forward-looking infrared camera and resistance temperature detector (RTD) thermometer.\n\t\nPlace the RTD thermometer on a blank coverslip and apply a small amount of thermal paste onto it to ensure proper thermal contact between the RTD thermometer and coverslip.\nChange the output power setting of the electronic control circuit to TEC element by changing the duty cycle of pulse width modulation setting and wait for 3 min to make sure the steady state temperature is reached. Read the temperature using the RTD thermometer.\nTurn on the forward looking infrared camera and monitor the temperature. Repeat this at various output power settings to obtain the temperature calibration curve. A representative temperature calibration curve is shown in Supplementary Figure 4.\n\t\tNOTE: It is crucial to do calibration between RTD thermometer and the forward looking infrared camera because the temperature reading of the forward-looking infrared camera must be accurate to ensure the correct temperature is reached.\n4. Trapping of Microparticles\nDilute micro polystyrene particles of diameter 2 µm in deionized water in a microcentrifugetube with proper volume ratio.\n\tNOTE: The concentration of micro particles can be adjusted according to the objective of the experiment. While lower concentration allows a sample time interval between single particle trapping events, higher concentration will shorten the time for multiple particle trapping. For single particle trapping, a typical concentration is ~0.05% (w/v).\nPut the sample with nanoplasmonic array on the stage and turn on a 470 nm LED as the fluorescence light source and manually set the power to 5 mW for bright field imaging.\nUse the marker to locate the nanoplasmonic array, align the sample, and use the CCD camera to make sure the array is in the center of the region of interest on the computer screen.",
    "Dispense 10 µL of the diluted micro particles of diameter 2 µm on the sample with a micro pipette.\nTurn on the current supply to the laser diode of wavelength 980 nm to excite the plasmonic resonance of the array with a power in the range ~1 mW to 10 mW.\nManually turn on the power supply to the electronic control board to cool down the sample to a steady state temperature ~4 °C.\nIn the viewer software, click the \"record video\" sequence to open the recording dialog. Click the \"record\" button to start the video recording 1.5 of the motion of the micro particles at a frame rate of 10 frames/s over the sample under the influence of laser beam using the CCD camera. Click the \"stop\" button to stop the recording. See Video 1.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}