{
  "id": 7228,
  "origin_website": "Bio",
  "title": "FACS Enrichment of Total Interstitial Cells and Fibroblasts from Adult Mouse Ventricles",
  "procedures": [
    "Before you startSet all centrifuges to 4°C.Set the water bath to 37°C and adjust the water level to cover half of the specimen jar.Place the collagenase type II stock bottle in a desiccator at room temperate (RT) for at least 30 min before opening.Note: Collagenase II is supplied as a lyophilized powder and is very hygroscopic. The hygroscopicity significantly affects the enzymatic activity if the powder is exposed to moisture. Thus, desiccation of the stock bottle helps ensure the long-term storage of the collagenase II stock. The stock bottle should not be opened in a humid environment. Pre-warm the red cell lysis buffer to RT.Note: Perform all steps on ice unless otherwise indicated. A simplified workflow of this protocol is illustrated in Figure 1A-1J. MethodInject the PdgfraGFP/+ mouse with heparin (200 IU/mouse) to prevent microthrombus formation in the coronary circulation.Note: In the original eLife paper (Farbehi et al., 2019), experimental mice were sacrificed by cervical dislocation without heparin administration, and the heart cavity was flushed manually after excision. Here, we present a revised method in which mice are heparinized and the heart removed, allowing flushing of the coronary arteries by ex vivo retrograde perfusion to minimize contamination of blood cells. In this method, euthanasia occurs by exsanguination under anesthesia. Ten minutes after heparin injection, anesthetize the mouse with an intraperitoneal injection of ketamine (100 mg/kg body weight) and xylazine (20 mg/kg body weight).After sedation, check for the lack of pain using the toe-pinch reflex before proceeding to the thoracotomy.Incise the skin along the mid-sternal axis using fine surgical scissors and expose the rib cage. Cut the rib cage and separate the ribs to expose the thoracic cavity. Using fine forceps and surgical scissors, free the heart and ascending aorta from connective tissue.",
    "Cut the aorta 2-3 mm from the aortic valve, freeing the heart from the thoracic cage (Figure 1A).Immediately place the heart in a 100 mm Petri dish containing cold PBS.Trim excess soft tissue from the aorta. Cannulate the aorta and secure with silk suture as previously documented in video form Li et al. (2014) (Figure 1B). Make an incision in the right atrium to permit coronary sinus effluent to flow freely.Attach a 10-ml syringe filled with PBS to the cannula, taking care not to introduce any air bubbles.Initiate perfusion by gently pressing the syringe plunger, maintaining a steady flow rate until the heart is cleared of blood (the fluid should be running clear).Note: Alternative cardiac perfusion methods, e.g., Langendorff perfusion or whole body in situ perfusion, extend the protocol time significantly and may cause additional ischemic stress. After perfusion, remove the cannula and transfer the heart to a new 100 mm Petri dish containing PBS. Remove atria, great vessels, and top one-quarter of ventricles to avoid contaminating the samples with atrioventricular mesenchymal tissue (Figure 1C).Transfer the heart to a 60 mm Petri dish and mince it with a scalpel to obtain ~1-3 mm3 pieces. Cover the tissue in a small volume of collagenase solution (~500 µl) to keep it moist during mincing.Note: This step should be performed within a 5 min timeframe. Small pieces of tissue (~1-3 mm3) should be visible (Figure 1D). Excessive mincing generates a cell slurry which will negatively affect cell viability. Add 5 ml of collagenase solution to the dish and transfer the minced tissue into a 70 ml specimen jar using a plastic transfer pipette. Mix by gently pipetting the sample up and down to break down the clumps.",
    "Incubate the specimen jar at 37°C in a water bath with shaking (60 rpm) for 10 min (Figure 1E). Break down clumps by intermittent pipetting while avoiding bubble formation.After 10 min of incubation, remove the sample from the water bath and let the pieces settle down to the bottom of the specimen jar. Transfer the supernatant (cell suspension) to a 50 ml Falcon tube by filtering through a 40 μm sterile cell strainer to remove cardiomyocytes and undigested debris (size of adult mouse cardiomyocytes ranges 100-200 μm) (Figure 1F).Add fresh 5 ml collagenase solution to the remaining undigested tissue in the specimen jar, mix by gently pipetting up and down, and repeat Steps B12-B13 further two times further. Pool the cell suspension from each heart in the same designated 50 ml Falcon tube. Centrifuge the cell suspension at 300 × g for 5 min and discard the supernatant.Note: At this stage, most of the tissue should be completely digested; however, if larger pieces are visible, the incubation period should be extended to ~15 min, and/or another round of digestion with 5 ml collagenase solution should be done. Resuspend the pellet in 1 ml of red cell lysis buffer and incubate at RT for 1 min (Figure 1G).Centrifuge the tube at 300 × g for 5 min and discard the supernatant.Gently resuspend the pellet in 1 ml of ice-cold FACS buffer and transfer the contents into 1.5 ml Eppendorf tubes. Remove the supernatant carefully by aspiration without disturbing the cell pellet.Centrifuge the tube at 300 × g for 5 min after washing, discard supernatant, and resuspend the pellet in 200 µl of dead cell removal microbeads; mix well and incubate for 15 min at RT (Figure 1H).",
    "During the incubation, prepare 15 ml (per heart) of 1× column binding buffer from the 20× stock solution (included in the dead cell removal kit), place MACS LS columns in the magnetic field of a QuadroMACS Separator, and precondition the column with 3 ml of 1× binding buffer (Figure 1I). Discard the flow-through.Load the cell suspension into the LS column and slowly add the remaining 12 ml of 1× binding buffer to each column, collecting the flow-through into a 15 ml tube placed on ice. The flow-through contains live cells.Centrifuge the tubes at 300 × g for 5 min. After discarding the supernatant, resuspend the pellet in 1 ml of ice-cold FACS buffer and transfer the contents into a 1.5 ml Eppendorf tube.Centrifuge at 300 × g for 5 min and resuspend the pellet in 500 µl of ice-cold FACS buffer.Transfer 100 µl of the cell suspension into a 5 ml FACS tube and dilute with ice-cold FACS buffer to achieve a cell density of approximately 1 million cells per ml. Add DAPI (final concentration: 100 ng/ml) to the cell suspension and proceed to FACS sorting (Figure 1J).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4028/bioprotoc-11-10-4028-g001.jpgFigure 1. Experimental workflow in graphical form Acquire cells on the BD FACS Aria II sorter fitted with a 100 μm nozzle (30 kHz, 20 PSI). Adjust the flow rate to achieve ~1,000 events/second. After establishing the gates (see below), sort TIP cells (Figure 1D) with 4-way purity precision mode in a 1.5 ml Eppendorf tube containing 50 μl FACS buffer. Once the desired number of TIP cells are sorted, sort GFP+ cells (Figure 1E).Gating strategy:Set FSC-A vs SSC-A gate to include TIP cells and exclude the remaining cardiomyocytes, debris, and cell aggregates (Figure 2A).Gate single cells and exclude cell aggregates based on FSC gating (Figure 2B).",
    "Gate single cells and exclude cell aggregates based on SSC gating (Figure 2C).Gate the DAPI- fraction to sort for “Live TIP” cells (Figure 2D).From the “Live TIP” fraction, gate the GFP+ fraction to sort cardiac fibroblasts (Figure 2E) (Chong et al., 2011).Notes: Both unstained and single-stained samples should be prepared from the same cell suspension obtained from wild-type (C57BL/6J) mouse hearts. This will adjust the compensation parameter settings to set background fluorescence levels and establish the gate for GFP+ cells. If PdgfraGFP/+ mice are not available, a cell suspension obtained from wild-type (C57BL/6J) mouse hearts (at Step B22) should be stained with a fluorophore-conjugated anti-PDGFRA antibody (e.g., APC-conjugated anti-PDGFRA (CD140a) antibody) to sort cardiac fibroblasts as the “APC” positive fraction from the “Live TIP” fraction. TIP cells can be sorted as explained above for PdgfraGFP/+ mice (Step B24 and Figures 2A-2D). imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4028/bioprotoc-11-10-4028-g002.jpgFigure 2. FACS gating strategy. (A-C) A typical workflow of sequential gating for doublet exclusion is shown. Total events were gated in a scatter plot (A) and subjected to FSC-based (B) and SSC-based (C) single-cell gating. (D) Live TIP cells were then gated as the DAPI- fraction. (E) Example of gating for GFP+ cells isolated from PdgfraGFP/+ mice."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}