{
  "id": 9597,
  "origin_website": "Jove",
  "title": "Preparation of Parasagittal Slices for the Investigation of Dorsal-ventral Organization of the Rodent Medial Entorhinal Cortex",
  "procedures": [
    "1. Parasagittal Slice Preparation\n1.1 Dissect out cerebral hemispheres\nAll animal experimentation should follow local ethical review and national regulations. In the case of the experiments described here, the work conforms to the United Kingdom Animals (Scientific Procedures) Act 1986. We routinely use cervical dislocation without anesthetic to euthanize the mouse before removing the brain. Alternatively the mouse can be terminally anesthetized, but in this case it may be necessary to determine if the choice of anesthetic influences neuronal properties.\nRemove the brain from the mouse and immediately place in cold (4-8 °C) cutting artificial cerebrospinal fluid (ACSF) (see Table 1 for solution compositions) bubbled to saturation with carbogen (95% O2, 5% CO2).\nAfter a maximum of three minutes, carefully remove the brain from the cutting ACSF using a spatula and gently place it in an upright position (dorsal side facing upwards) onto filter paper that has been moistened with the cutting ACSF (Figure 1A).\nTo facilitate accurate mounting of the hemispheres, use a razor or scalpel to remove as much of the cerebellum as possible without impacting the MEC (located at the caudal extreme of the cerebrum) and remove the rostral third of the cerebrum by sectioning in the coronal plane (Figure 1B).\nHemisect the brain, taking care that the section is exactly along the vertical plane of the midline (Figure 1C).\nReturn the hemispheres to the bubbled cutting ACSF for one and a half minutes.\n1.2 Mount the hemispheres on a vibratome\nBefore mounting, ensure that the cutting edge of the vibratome blade is angled at 20 degrees from horizontal (Figure 1D). On the mounting surface make a shallow strip of superglue parallel to the vibratome blade, approximately the width of a hemisphere and long enough to accommodate the two hemispheres end-to-end.",
    "Taking care to minimize physical impact, remove each hemisphere from the cutting ACSF with a spatula and position so that its medial surface rests on the spatula and its dorsal extent faces towards the microtome blade. Gently slide each hemisphere onto the strip of superglue, taking care to ensure that the medial surface of each hemisphere is parallel to the microtome base. We have found that for best results the dorsal surface of each hemisphere should be parallel to and face the vibratome blade (Figure 1D).\n1.3 Maintenance of the preparation during slicing\nFollowing mounting immediately submerge the hemispheres in cold cutting ACSF (4 - 8 °C). Maintain the temperature and carbogen saturation throughout the slicing procedure. If direct cooling and bubbling of the solution in the cutting chamber is not practical, periodically replenish the cutting ACSF solution in the chamber with fresh chilled and bubbled solution.\n1.4 Cut sections\nUsing a vibratome, remove cortex from both hemispheres in the sagittal plane until you identify the lateral most extent of the MEC (typically ~1mm down from the lateral surface) (Figure 1F).",
    "Between cuts lift the vibratome blade up ~200 μm to avoid dragging the blade back over and damaging the exposed tissue. Simultaneously cut 400 μm parasagittal sections from both hemispheres (if they are lined up as shown in Figure 1D they will both be cut at the same time) until the medial extent of the MEC is reached. This can be identified by the absence of the thick white band around the ventro-caudal curve of the hippocampus (the external capsule), the non-convex shape of its rostral boundary and the angular dorso-caudal 'corner'. Figure 1E illustrates the circular appearance of the hippocampus in the parasagittal plane lateral to the MEC. Figures 1F-G illustrate how sections within the MEC appear at different lateral-medial positions when slicing. Note the progressively more bean-shaped appearance of the hippocampus at more medial positions. Each hemisphere typically yields two or three 400 μm thick slices containing the MEC.\n1.5 Incubate slices\nAfter each cut immediately place the slices in carbogen-saturated standard ACSF maintained in a water bath at 35 °C. Allow slices to incubate at 35 °C for approximately 15 minutes in the ACSF after slicing is complete.\nRemove the slice holder from the water bath and continue bubbling with carbogen at room temperature for at least 45 minutes.\n2. Example Parasagittal Slice Experiment\nA typical experiment using this preparation is to make electrophysiological recordings from stellate cells in layer II of the MEC.\n2.1 Optimize optics\nBefore recording, ensure that the condenser is in focus on the slice plane (Koehler illumination) and is centered under the high magnification (e.g. 40x) objective.\n2.2 Identify cells of interest",
    "Use a low magnification (e.g. 4x) objective to identify an approximate recording region within the MEC (Figure 2A-B). Switch to a high magnification objective to identify viable cells within this region (Figure 2C-D).\nAs an example, putative layer II stellate cells are visually identified by their polygonal or ovoid shape and multiple primary dendrites with similar diameter, and absence of a single large diameter apical dendrite2,13,14. They are reliably identified on the edge of the Layer I/II border, where they are abundant and often appear in small groups2,9 (Figure 2C-D). Other cell types, such as interneurons and pyramidal cells should also be identifiable.\nAt this point experiments can be carried out, for example using whole-cell patch-clamp to record membrane potential or membrane current from identified neurons, and electrical or optogenetic methods to activate synaptic inputs to the recorded neuron. Neuron identity can be verified from the electrophysiological properties of the recorded neuron and by including fluorescent labels within the intracellular solution.\n3. Measure Location Along the Dorso-ventral Axis\n3.1 Image location of interest and surrounding slice",
    "To determine the position of a recorded neuron along the dorsal-ventral axis, first use a low magnification objective to image the MEC region of the slice and surrounding areas. Mark the location of interest by, for example, including the recording electrode in an image (Figure 3A) or by stepping down the field iris diaphragm to leave a bright circle around the location of interest in a duplicate image. To pinpoint the recording location within the image the duplicate can then be superimposed on the initial image of the recording location and its surroundings (Figure 3B). Up to 3 separate low magnification (4x) images may be required to cover the area from a ventral recording location to the dorsal border of the MEC. These images can then be stitched together using image-manipulation software to provide an image that distance measurements can be taken from (Figure 3). Further verification of neuron identity and location can be carried out following recording by including inactive markers such as biocytin or Alexa dyes within the intracellular solution and then using appropriate processing of the tissue following recording2.\n3.2 Establish the dorsal border of MEC\nThe dorsal border of the MEC provides a convenient landmark from which to measure dorsal-ventral position. The ventral border of the MEC is not as well defined.\nFigure 4 illustrates how the MEC cellular landmarks defined in Nissl stained slices at different medial-lateral positions appear under DIC illumination.\nFigure 4 A shows the circular hippocampus (Figure 4 (i)) and lack of a parasubicular protrusion into layer I (Figure 4 (iv)) associated with parasagittal slices containing Lateral Entorhinal Cortex (LEC).",
    "Figure 4 B-C show typical slices that contain the MEC. The dorsal part of the prominent dark dorsal Entorhinal/Parasubicular boundary region in the DIC illuminated slices contains an area of the parasubiculum. The parasubiculum area is clearly revealed by Nissl staining in the corresponding images in column (iii). The dorsal border of the MEC (black arrows in 4B and 4C column (iv)) is ventral to the group of parasubicular cells that protrudes far out into layer I (red arrows in 4B and 4C column (iv)).\nComparison of Figures 4B and 4C columns (ii) and (iii) shows that the dorsal border of the MEC in the Nissl sections corresponds to a location that is ventral to the dorsal edge of the dark Entorhinal/Parasubicular boundary region in the DIC slice (black arrows). The location of the border can be estimated from DIC images and comparison to reference images (see also ref. 14). Future validation of the dorsal MEC border with molecular markers will improve the accuracy of this estimate. We note that stained reference sections, and sections that are processed for morphological identification of labeled neurons, may be subject to considerable shrinkage. Comparison of absolute distances relative to landmarks in DIC and reference sections therefore first requires measurement and correction for shrinkage (see e.g. ref 2).\n3.3 Calibrate and measure distances",
    "To facilitate easy measurement of distance in images, use the same low magnification objective to image a reference grid to establish a pixel:distance conversion ratio. Measure the pixel distance from the dorsal border of the MEC to the location of interest along the contour of the MEC using a graphics program and convert pixel distance to distance in μm (Figure 5A). If neurons are filled with a marker such as biocytin, then location of the recorded neuron can then also be recovered by appropriate processing (see e.g. ref 2).\n4. Representative Results\nFigure 5A shows an example low magnification (4x) composite image of a parasagittal slice after recording, with the locations of recorded neurons and measurement guides superimposed. Recordings from the marked dorsal and ventral stellate cells are shown in Figure 5B. These recordings help to establish the identity of the cells and illustrate how electrical properties of MEC layer II stellate cells differ at dorsal and ventral locations.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3802/3802fig1.jpg",
    "Figure 1. Preparation of parasagittal slices. A  Whole brain resting with dorsal side facing upwards on filter paper moistened with cutting ACSF. B Brain after removal of cerebellum and rostral third of frontal cortex. C Hemisected brain ready for mounting. D mounted hemispheres on glue strip parallel to cutting edge of vibratome blade prior to submersion in cutting ACSF and slicing. E Appearance of section containing LEC during the slicing procedure after the removal of lateral tissue and not yet sufficiently medial for a standard parasagittal MEC slice. F Appearance of 'lateral' part of the MEC after removing a further 400 μm of tissue (the surface is 400 μm medial to that shown in (F)). G Appearance of 'medial' part of the MEC after a 400 μm parasagittal slice has been cut. H-I Schematics of E-F respectively indicating anatomical landmarks, c: cerebellum, L: lateral entorhinal cortex (LEC), m: Medial Entorhinal Cortex (MEC), h: hippocampus, orange: external capsule, blue: corpus callosum, cyan: dentate gyrus, green: CA3 & CA1. The appearance of rostral boundary of the hippocampus in slices that contain LEC is concave (black arrow in H) whereas in slices that contain only MEC, the boundary can be linear (red arrow in I) or concave (red arrow in J). The approximate shapes of colored anatomical landmarks were obtained from the annotations in the Allen Brain Atlas (http://mouse.brain-map.org/atlas/ARA/Sagittal/browser.html[href=http://mouse.brain-map.org/atlas/ARA/Sagittal/browser.html]).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3802/3802fig2.jpg",
    "Figure 2. Identifying MEC layer II cells under DIC illumination. A Example composite image of a parasagittal brain slice at low magnification (4x). Separate images have been aligned and blended to remove distracting edges and vignetting. Important landmark areas h: hippocampus, m: MEC. B Crop from an individual low magnification (4x) image that contains layer II of the MEC, visible as the dark vertical stripe near the right hand edge. C MEC layer II at high magnification (40x) with DIC illumination. The image is an aligned and blended composite of several images. The dense central 'column' of cells is Layer II. D Single high magnification DIC image showing a group of healthy putative stellate cells and interneurons in layer II. As shown here, stellate cells often occur in groups on the border of layer I/II. Pyramidal cells tend to be found closer to the Layer II/III border. The dotted outlines in A-C indicate the extent of B-D respectively. Scale bars: in A and B 500 μm, in C and D 100 μm.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3802/3802fig3.jpg\nFigure 3. Measuring the dorsal-ventral position of locations of interest. A Aligned low magnification (4x) images that include the entire dorso-ventral extent of the MEC between the location of interest (marked by the tip of a recording electrode) and the dark Entorhinal / Parasubicular boundary region landmark (used to establish the dorsal border of the MEC - see Figure 4). B As in A but including a superimposed image with a stopped down field iris diaphragm (overlaid with reduced opacity) instead of a recording electrode to mark the location of interest.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3802/3802fig4.jpg",
    "Figure 4. Estimating the dorsal border of the MEC from DIC images of parasagittal slices. A-C Parasagittal sections (lateral to medial) from the Entorhinal Cortex. DIC and Nissl sections are from different mice. A-C column (i): Whole parasagittal slices (400 μm thick) (aligned and blended composites of low magnification (4x) images). A-C column (ii): Close up of entorhinal cortex with characteristic dark Entorhinal / Parasubicular boundary region in the top area of each image. A-C column (iii) Nissl stained slices (40 μm thick) from a different mouse aligned with images in A-C (ii). The darker, dense layer of cells is layer II. Comparing columns (ii) and (iii) shows how the Nissl stained cells appear in DIC images. A-C column (iv): Detail of Nissl stained slices. B and C column (iv) include cells from the parasubiculum (dorsal part of the dark Entorhinal/Parasubicular boundary region in the DIC images) and cells from dorsal MEC. In B (iv) and C (iv) the large dorsal patch of parasubicular cells that extends deep into layer I is easily visible (red arrows). The ventral edge of these patches corresponds to the dorsal border of the MEC (black arrows). In A (iv) the parasubicular patch is absent, indicating that the slice is too lateral for a standard parasagittal MEC slice preparation. In all panels, black arrows indicate the dorsal border of MEC. Grey arrows indicate the approximate ventral border of the MEC.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3802/3802fig5.jpg",
    "Figure 5. Representative results.  A Blended and cropped portion of the image in Figure 3A. The positions of a dorsal cell and a ventral cell are indicated by blue and green filled circles respectively. The black arrow marks the estimated dorsal border of the MEC and is extended into the deep layers by the white dotted line. The solid white line is a guide showing the contour path along which the pixel measurement of distance from the dorsal border of the MEC to the ventrally located cell was taken. Scale bar: 500 μm. B Electrophysiological traces from the cells indicated in A. From left to right - subthreshold responses to current steps used to calculate input resistance, spiking response to a large positive current step, spike detail.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}