{
  "id": 19980,
  "origin_website": "Wiley",
  "title": "Methods to Detect Small Molecule Inhibition of RING E3 Ligase Activity",
  "procedures": [
    "This protocol is used to identify small molecule inhibitors of TRAF6-Ubc13 interaction. The assay is based on AlphaScreen, which is a bead-based assay for studying biomolecular interactions in a microplate format. Here, Strep-Tactin donor beads bind to StrepII-TRAF6-RZ1 (RZ1 domain; present as dimer) and nickel-chelate acceptor beads bind to Ubc13-FlagHis. Upon interaction of the two protein partners, beads get into close proximity and singlet oxygen is transferred from donor to acceptor beads generating a luminescent signal that can be detected in a suitable microplate reader (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.414#cpz1414-fig-0002]). Small molecule inhibitors interrupting this interaction diminish the AlphaScreen signal. We describe the reaction conditions that were used in a screening campaign to identify small molecule inhibitors of TRAF6-Ubc13 (Brenke et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.414#cpz1414-bib-0002]). Reaction conditions for other E3 RING ligases can be altered accordingly to meet specific requirements. Besides TRAF6-Ubc13, AlphaScreen has also been shown to be suitable to detect, e.g., RNF8-Ubc13 interaction (Weber, Rothenaigner, Brandner, Hadian, & Schorpp, 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.414#cpz1414-bib-0014]).\nMaterials\nRecombinant StrepII-TRAF6-RZ1 protein, only RING-zinc finger1 (RZ1) domain: Wild-type (WT) or D57K mutant (Brenke et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.414#cpz1414-bib-0002])\nRecombinant Ubc13-FlagHis protein\nAlphaScreen buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.414#cpz1414-rec-0001])\nStrep-Tactin Alpha Donor beads (AS106, PerkinElmer)\nAlphaScreen Histidine (Nickel Chelate) Detection Kit containing nickel chelate (Ni-NTA) AlphaScreen Acceptor beads (6760619C, Perkin Elmer)\nSmall molecules in DMSO (specific to the research question)\nDimethyl sulfoxide (DMSO of high purity)\n384-well white OptiPlates (6007290, Perkin Elmer)\nMultiplate Dispenser (e.g., Flexdrop or Multidrop)\nLiquid Handling (e.g., Sciclone G3, PerkinElmer)\nCover foil (to seal plate; DMSO resistant)\nPlate reader (e.g., PerkinElmer Envision)\nNOTE: The TRAF6 D57K mutant does not bind Ubc13 and acts as a control for the low signal. This mutant is a mimic of full compound inhibition.\n1. Purify recombinant proteins in bacterial systems: StrepII-TRAF6-RZ1 (WT or D57K mutant) and Ubc13-FlagHis.",
    "Proteins are expressed in bacterial systems and purified using StrepTagII or HisTag affinity chromatography followed by gel filtration. More detailed protocols for protein purification are published in Brenke et al. (2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.414#cpz1414-bib-0002]).\n2. Prepare protein stocks: (1) StrepII-TRAF6-RZ1 (WT or D57K mutant) at 200 nM in AlphaScreen buffer and (2) Ubc13-FlagHis at 450 nM in AlphaScreen buffer. For master mixes, calculate 30 µl per sample for StrepII-TRAF6-RZ1 (WT or D57K mutant) and 10 µl per sample for Ubc13-FlagHis.\nThe D57K, a binding mutant, will provide the negative control (low) signal. If no binding mutant is available, either TRAF6 alone with both beads or the two beads alone can be used as negative controls. For preparation of AlphaScreen buffer use protease free, fatty acid free, essentially globulin free BSA with purity >98%. In set-up experiments, cross-titrations of TRAF6 and Ubc13 revealed the optimal protein concentrations (robust signal at minimal protein concentration). Such a matrix titration experiment needs to be performed for any other E2-E3 pair. Place the diluted proteins on ice.\n3. Dispense 30 µl StrepII-TRAF6-RZ1 (WT or D57K mutant; 200 nM in AlphaScreen buffer, final concentration: 100 nM) into each well of a 384-well Optiplate.\nWhen pipetting the different solutions into 384-well plates, try to avoid air bubbles. Appropriate assay controls should include wells without both or either of the proteins as well as binding mutant proteins if available. The use of a multiplate dispenser or multi-channel electronic handheld pipet is advisable.\n4. Add 0.3 µl compound (stock concentration: 1 mM; final concentration: 5 µM in 60 µl) to TRAF6-RZ1 protein (WT or D57K mutant) to each well of the 384-well plate using liquid handling and incubate 30 min at room temperature.",
    "The DMSO concentration of dissolved compounds should be kept below 1%; in the case of TRAF6-Ubc13 it should be at 0.5%. This is necessary as DMSO can affect the proteins as well as the StrepII donor beads of the AlphaScreen technology. This incubation step will allow the compounds to bind to StrepII-TRAF6-RZ1.\n5. Dispense 10 µl Ubc13-FlagHis (450 nM in AlphaScreen buffer, final concentration: 75 nM) into each well of the 384-well plate.\nAgain, try to avoid air bubbles.\n6. Seal the 384-well plate with foil and incubate 1 hr at room temperature.\nThis step is needed to avoid liquid evaporation and thus change in overall concentrations. This incubation step will allow Ubc13-FlagHis to bind to StrepII-TRAF6-RZ1.\n7. Prepare working solutions for the AlphaScreen beads (stock is 5 mg/ml). Dilute both beads (Donor and Acceptor) separately to 24 µg/ml in the AlphaScreen buffer.\nCalculate how many samples you will need and prepare a master mix for all samples. Always prepare fresh working dilutions of beads. The Donor beads used in AlphaScreen assays are light sensitive, therefore working with the beads should be done under subdued lighting conditions. AlphaScreen beads mix must be prepared on ice and used immediately to avoid increased background signals.\nThe optimal concentration of Donor and Acceptor beads needs to be determined for any other E2-E3 pair. After cross-titration to determine ideal protein concentration, the next step will be to check different concentrations of beads to choose a concentration that is cost effective but gives enough of a signal-to-noise ratio (minimum of 5 fold of the positive signal over the negative signal).\n8. Dispense 10 µl Donor beads and 10 µl Acceptor beads into each well of the 384-well plate containing the proteins/compound mix.",
    "When designing the plate layout, include the bead only control (10 µl of each of the beads and 40 µl of AlphaScreen buffer). This control, or ideally a mutant control, will give you the background signal.\n9. Seal plate with foil and incubate 1 hr at room temperature.\nThis step is needed to avoid liquid evaporation and thus change in overall concentrations. Working in the dark is very important. This incubation step will allow the AlphaScreen beads to bind to the respective proteins.\n10. Read out the plate with an AlphaScreen-compatible plate reader (settings: laser excitation at 680 nm, emission at 520-620 nm).\nUsually, a 20- to 30-fold signal induction is observed compared to the bead control.\nSample data\nSee Figure 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.414#cpz1414-fig-0003].",
    "This in vitro assay is used to examine the activity of purified E3 ligases to form K63-linked poly-ubiquitin chains after small molecule treatment. This protocol describes how to measure the ability of the E3 ligase TRAF6 in cooperation with the E2 ligase Ubc13 to build free K63-linked ubiquitin chains. Recombinant E1 and E2 enzymes are commercially available. The result of the reaction is checked by western blot analyses using an anti-ubiquitin antibody. This protocol is a low-throughput method that is suitable to validate a shortlisted number of molecules from a screening campaign using, e.g., Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.414#cpz1414-prot-0001].\nMaterials\n10× K63 assay buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.414#cpz1414-rec-0003])\nRecombinant His6-ubiquitin E1 enzyme (UBE1; E-304-050, R&D Systems)\nRecombinant His6-UBE2N(Ubc13)/Uev1a complex (E2-664, R&D Systems)\nRecombinant E3-ubiquitin ligase TRAF6, only RING-zinc finger1 (RZ1) domain (Brenke et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.414#cpz1414-bib-0002])\nRecombinant ubiquitin protein (U-100H-10M, R&D Systems)\n1 mM ZnCl2 in 1× K63 assay buffer\nSmall molecules in DMSO (specific to the research question)\nDimethyl sulfoxide (DMSO of high purity)\n2 mM ATP (MilliporeSigma)\nSDS loading buffer (4×)\n10× SDS buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.414#cpz1414-rec-0004])\n5× separation gel buffer (1.88 M Tris·HCl, pH 8.8)\nSeparation gel (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.414#cpz1414-rec-0005])\n4× stacking gel buffer (0.5 M Tris·HCl, pH 6.8)\nStacking gel (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.414#cpz1414-rec-0006])\nPre-stained Protein Marker (Page Ruler)\nPierce™ Silver Stain Kit\nMethanol\n10× blotting buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.414#cpz1414-rec-0002])\nBlocking buffer: 3% BSA (standard quality) in PBST\nPBST: PBS (Applichem) with 0.1% Tween 20 (Carl Roth)\nAnti-ubiquitin antibody (P4D1, 1:1,000; Santa Cruz)\nSecondary HRP-conjugated anti-mouse antibody (1:7,500; Dianova)\n1.5-ml microcentrifuge tubes\nSDS-PAGE gel chamber\nPVDF membrane\nWhatman paper\nSemi dry blotter\nAmersham Hyperfilm ECL\n1. Purify recombinant proteins in bacterial systems: Untagged TRAF6-RZ1 (WT or D57K mutant).",
    "Untagged TRAF6-RZ1 is expressed and purified as a GST-TRAF6-RZ1 and the GST is cleaved off during the purification procedure. More detailed protocols for protein purification are published in Brenke et al. (2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.414#cpz1414-bib-0002]).\n2. Thaw reagents and place them on ice: His6-ubiquitin E1 enzyme, His6-UBE2N (Ubc13)/Uev1a complex, purified E3-ubiquitin ligase TRAF6-RZ1, ubiquitin, ZnCl2, and ATP. Compounds and DMSO should be placed at room temperature.\nIf no binding mutant is available, TRAF6 WT without ATP can be used as a negative control. Remember to have a control reaction with no compound and DMSO instead. The final concentration of 1% for either DMSO or compound should not be exceeded.\n3. Pre-incubate 0.125 µM TRAF6-RZ1 with the compound (amount dependent on concentration to be tested) or DMSO in 1× K63 assay buffer for 30 min. The total reaction volume is 50 µl.\nRemember to take a 25-µl aliquot of input sample for silver staining. Add SDS loading buffer (4×) to each input sample, vortex to mix, and boil the samples at 95°C for 5 min. Spin down the samples before storing at –20°C.\n4. Prepare master mix of 0.01 μM His6-ubiquitin E1 enzyme, 0.2 μM His6-UBE2N (Ubc13)/Uev1a complex, 4 μM ubiquitin, 1 mM ZnCl2, and 2 mM ATP in 1× K63 reaction buffer. Add 50 µl master mix to start reaction. Incubate reaction 120 min at 37°C.\nThe total reaction mixture is 75 µl. Handle quickly to start parallel samples at similar times.\n5. Stop reaction by adding 25 µl SDS loading buffer (4×), vortex to mix, and boil samples at 95°C for 5 min.\nSpin down and store samples at −20°C until further use.\n6. Load the input samples on a 12.5% acrylamide gel and the ubiquitination samples on a 10% acrylamide gel for SDS-PAGE electrophoretic separation.",
    "Do not forget to load a molecular weight marker as reference. Loading the ubiquitination samples on a 10% acrylamide gel will allow better visualization of the poly-ubiquitination smear. While running the gel electrophoresis, be sure to stop the electrophoresis in time as the molecular weight of mono-ubiquitin is 8.5 kDa.\n7. The input sample gel will be used directly for silver staining, whereas the ubiquitination sample gel will be used for transfer of the separated proteins onto a PVDF membrane via semi-dry blotting.\nSilver staining allows detection of various E3 ligases avoiding the need of E3 ligase specific antibodies. More detailed information for silver staining is available in the manufacturer's protocol for Pierce™ Silver Stain Kit. During semi-dry blotting, try to avoid bubbles as these will prevent protein transfer.\n8. Block the membrane for 60 min in a blocking buffer at room temperature to cover unspecific binding sites and subsequently incubate the ubiquitination sample membrane with an anti-ubiquitin antibody (P4D1) overnight at 4°C.\nUse as much blocking solution as needed to cover the membrane. Dilute the primary antibody 1:1,000 in 1.5% BSA in PBST.\n9. After washing the membrane three times for 10 min with PBST, add the horseradish-peroxidase-conjugated secondary anti-mouse antibody. Incubate 1 hr at room temperature.\nDilute the primary antibody 1:7,500 in 0.75% BSA in PBST.\n10. Wash membrane again three times with PBST and add enhanced chemiluminescence substrate according to manufacturer's instructions. Detect chemiluminescence using X-ray films for various time points and develop the films in a developer machine.\nPoly-ubiquitin chains will appear as smears on the western blot.\nSample data\nSee Figure 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.414#cpz1414-fig-0004]."
  ],
  "subjectAreas": [
    "Protein Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}