{
  "id": 9787,
  "origin_website": "Jove",
  "title": "Combining Transcranial Magnetic Stimulation and fMRI to Examine the Default Mode Network",
  "procedures": [
    "1. Preparation\nTo begin, obtain a baseline anatomical scan of your subject.  This should be done several days before the actual experiment.\nNext, load the scan into your frameless stereotactic software package.\nFinally, locate and target your stimulation coordinates.  In this case, we will be targeting the left inferior parietal lobule.\n2. The Initial Scan\nOn the day of the experiment, your subject will, once again, start in the MRI machine.\nBegin with an anatomical scan.\nNext, conduct three functional experimentation runs.  For this experiment, the task is quite simple: A fixation point is presented in the subject's central field of vision, and he/she is to simply stare at it passively.\n3. TMS Preparation\nBecause the effects of rTMS are transitory, time is of the essence when combining TMS and fMRI.  It is imperative you get the subject back into the scanner as soon as possible after stimulation cessation.  Because of this, you'll want to use a portable TMS device stationed in a room adjacent to or as close as possible to the scanning-bay as possible.  In this case, we're using a portable set-up in an observation suite next door to the scanner.\nLoad your subject's pre-targeted baseline MRI into the stereotactic software package.\nFinally, link and calibrate your stimulating coil with the stereotaxy equipment - in this case, we'll align a set of infrared sensors to register coil centrality.\n4. Determining TMS Parameters\nWhen the subject arrives, sit him/her comfortably in a chair.\nNext, calibrate your subject's head with the sterotaxy equipment.  In this case, we'll use infrared sensors to register several positioning anchors: both ears, the nose, and the nasion.\nDetermine your subject's resting motor threshold.",
    "If we want to excite the subject's cortex, we will set the TMS machine to 20 Hz with a stimulation power of 110% motor threshold.  If we want to inhibit the subject's cortex, we will set the TMS machine to 1 Hz at 110% motor threshold.  Although you'll want to explore both parameters throughout the course of a full study, we will only look at a 20 Hz excitatory rTMS chain in this article.\nFinally, set up a stimulation pattern of 2 second trains with 28 second rest periods.\n5. TMS Stimulation\nPrior to stimulation, prepare the subject to go directly in the scanner following TMS.  This includes removal of metal and ensuring the subject has used the restroom.\nHolding the coil tangential to the scalp, use your stereotaxy equipment to locate and target the subject's stimulation site.\nTurn on the machine's coil cooling system.\nBegin stimulation!  For this protocol, we will conduct 45 total stimulation trains.  At 2 seconds a train with 28 second breaks, we will have a total stim time of 23 minutes.\n6. Back to the Scanner\nOnce stimulation is complete, it is important to get the subject back into the scanner as soon as possible.  To make this transition as seamless as possible, ensure your scanner is prepared and ready to go.  Our advice is to raise the body platform, and reduce the number and duration of localizer scans to a bare minimum.\n7. Final Scan\nBecause the effects of rTMS are transitory, the final scanning session should begin with the functional runs.  Again, we'll conduct three, 6-minute runs of passive fixation.\nAfter the experimental runs are complete, finish with an anatomical scan.\n8. Representative Results",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/2271/2271fig1.jpgFigure 1.The data suggests that 20 Hz rTMS stimulation to the left inferior parietal lobule, although facilitating local excitability, acts to decrease functional connectivity within the default network.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}