{
  "id": 2240,
  "origin_website": "Cell",
  "title": "Localization of T cell clonotypes using the Visium spatial transcriptomics platform",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nAmplification of TCR sequences from Visium cDNA\nTiming: 2 h\nThis protocol begins with Visium cDNA, which contains amplified cDNA of all genes expressed in the target tissue section. In these steps, we use TRBV-specific primers to amplify TCRβ cDNAs from the Visium cDNA pool (Figure 1[href=https://www.wicell.org#fig1]C).\nPrepare TCR cDNA amplification mix by adding the following components in a PCR tube:\ntable:files/protocols_protocol_1711_1.csv\nMix gently by pipetting up and down; centrifuge briefly with a mini centrifuge.\nAmplify TCR cDNA in a thermocycler with the following cycling conditions:\ntable:files/protocols_protocol_1711_2.csv\nBead cleanup\nTiming: 30 min\nThis step uses size selection to purify the TCR-enriched PCR product, removing primers and other reaction components that may interfere with library preparation.\nAfter amplification, bring PCR reaction volume up to 50 μL by adding 35.7 μL of nuclease-free water.\nEnsure the SPRIselect beads are resuspended and mixed well by shaking.\nAdd 0.6× (30 μL) of SPRIselect beads to the PCR product from step 4.\nMix well by pipetting.\nIncubate 5 min at room temperature.\nPlace on separation magnet until solution clears.\nPipette to remove and discard supernatant.\nAdd 200 μL of 80% ethanol to the pellet. Do not mix or remove tube from magnet. Wait 30 s.\nPipette to remove and discard supernatant.\nRepeat steps 11 and 12 once, resulting in two 80% ethanol wash steps.\nEnsure that all 80% ethanol is removed. Air dry for two minutes.\nRemove tube from magnet.\nAdd 40.5 μL Buffer EB to tube. Resuspend beads gently by pipet mixing.\nIncubate 2 min at room temperature.\nPlace on separation magnet until solution clears.\nTransfer 40 μL to a new PCR tube. This is the amplified TCR cDNA.",
    "Pause point: Purified, amplified TCR cDNA may be stored at 4°C for 24 h or frozen at −20°C for longer storage (at least 1 month).\nOptional: Purified, amplified TCR cDNA can be quantified using a Qubit High Sensitivity Assay kit according to manufacturer’s instructions. Our yields ranged from 50–150 ng of total product. Alternatively, product may be analyzed using a Bioanalyzer or similar high-sensitivity electrophoresis platform.\nSample indexing PCR\nTiming: 2 h\nThis step creates sequencer-ready, dual-indexed libraries by adding Illumina P5 and P7 sequences, i5 and i7 indices, and completing the TruSeq Read1 and Read2 sequences on the amplified TCR cDNA (Figure 1[href=https://www.wicell.org#fig1]D).\nPrepare sample indexing PCR reaction for library generation and multiplexed sequencing in a PCR tube as outlined below:\ntable:files/protocols_protocol_1711_3.csv\nRecord the well used from the TT set A primers plate; this will allow for demultiplexing of pooled TCR sequencing libraries.\nAmplify the mixture with the following conditions:\ntable:files/protocols_protocol_1711_4.csv\nPerform cleanup of PCR product as described in “bead cleanup[href=https://www.wicell.org#sec2.2]” section above (steps 4–19). The final product is the spatial TCR library.\nNote: TCRβ cDNA amplified via this method will average around 1 kb in length. We typically achieved total library yields of 1–2 μg. See Figure 2[href=https://www.wicell.org#fig2] for an example Bioanalzyer trace. TCRβ cDNA was diluted 1:10 before Bioanalzyer analysis.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1711-Fig2.jpg\nFigure 2. Bioanalyzer trace of pooled spatial TCR libraries\nLibrary quantification and sequencing\nTiming: About 1 week\nThis step will quantify and sequence the spatial TCR library. As long as different dual-indexing primers are used for each library in step 20, multiple libraries can be sequenced simultaneously.\nRun 1 μL of a 1:10 dilution of the spatial TCR library on a Bioanalyzer or similar high-sensitivity electrophoresis platform.",
    "Sequence libraries according to the manufacturer’s instructions. We performed sequencing on an Illumina MiSeq using a MiSeq Reagent Kit v3 at PE300 with 10% PhiX. Libraries were loaded at 20 pM concentration.\nNote: Spatial TCR libraries are expected to contain low sequence diversity, thus the use of 10% PhiX. Paired end, dual indexed sequencing must be performed to generate TCR sequences (Read 2) and spatial barcode and UMI information (Read 1). Read 1 must be sequenced for at least 28 cycles to obtain full spatial barcode and UMI sequences; we recommend a read length of at least 100 nucleotides for read 2.\nIdentification of TCR clones\nTiming: 1 h\nPaired-end sequencing from step 24 will result in the generation of two FASTQ files. Read 1 contains the spatial barcode and UMI sequences, and read 2 contains the TCR VDJ region sequences (Figure 1[href=https://www.wicell.org#fig1]E). Here, we use MiXCR (Bolotin et al., 2015[href=https://www.wicell.org#bib1]) to call antigen receptor sequences from read 2. We will also export reads supporting each TCR in order to identify paired reads that contain spatial barcode and UMI information. Example code, sample sequencing files, and expected MiXCR output is provided at https://github.com/whhudson/spatialTCR[href=https://github.com/whhudson/spatialTCR].\nFiles needed:\nRead 2 FASTQ file(s) from ”library quantification and sequencing[href=https://www.wicell.org#sec2.4]“ section, above.\nSoftware needed: MiXCR (version 3.0.13 is the latest release as of writing). See key resources table[href=https://www.wicell.org#key-resources-table] for URLs for download.\nUse the mixcr analyze pipeline to call antigen receptor sequences from the read 2 FASTQ file.\nThe following code is provided as an example. path/to/read2.fastq is the file path to the read 2 FASTQ file generated from step 24.\nmixcr analyze shotgun -s hsa --starting-material rna --align \"-OsaveOriginalReads=true\" --assemble \"--write-alignments\" path/to/read2.fastq.gz mixcr_output/clones\nIf performed as written above, output will be stored in the mixcr_output/ folder with file prefix “clones”.",
    "Note: MiXCR analyze parameters used are the following: the “-s” option designates the species of organism; “hsa” indicates Homo sapiens. The “--starting material” option designates the type of nucleic acid from which libraries were made, RNA in this protocol. ‘--align “-OsaveOriginalReads=true”’ forces MiXCR to save the original sequencing reads for use in later steps. ‘--assemble “--write-alignments”’ saves the alignments and clone mapping to a .clns file that is used in step 26.\nExport individual reads supporting each clone with the mixcr exportReadsForClones command.\nThe following code is provided as an example.\nmixcr exportReadsForClones -s mixcr_output/clones.clns mixcr_output/reads/reads.fastq.gz\nIf performed as written above, this will result in fastq.gz files with reads supporting each clone being written into the mixcr_output/reads/ folder as reads_clnN.fastq.gz, where N is the clone number identifier.\nNote: The “-s” parameter in MiXCR exportReadsForClones forces MiXCR to make separate read files for each clone. The mixcr_output/clones.clns file is generated in step 25.\nNote: At this point, TCR clonotypes have been identified from individual sequencing reads. Information about each clone is provided in the mixcr_output/clones.clonotypes.ALL.txt file if the naming convention above has been followed. Additionally, the sequencing read 2 for each clone has been written into the mixcr_output/reads folder.\nLinkage of TCR clones to spatial locations\nSoftware needed: Python 2 (for sample code).\nNow, the UMI and spatial barcode should be extracted from each paired read 1 of TCRs identified in the previous step. This allows mapping of each TCR read to a UMI and spatial location. Duplicate reads with identical UMIs should also be discarded, such that each UMI and spatial barcode combination is only used once in downstream analysis. We provide the example Python 2 script combine_counts.py at https://github.com/whhudson/spatialTCR[href=https://github.com/whhudson/spatialTCR] for performing these tasks.",
    "In the provided combine_counts.py script, specify the directory containing the reads written by MiXCR (path/to/mixcr_output/reads if using file naming as above), the tissue positions list from 10x Genomics Space Ranger output, and the path to the read 1 FASTQ.gz file from the sequencing step above.\nRunning the script will output a tab-delimited text file with each spot/spatial barcode as a row and each clone as a column. The number in each cell indicates the number of UMIs measured in each spatial barcode (row) for a particular clone (column). This tab-delimited text file can then be used for further analysis in R, such as to add metadata to a Seurat spatial object."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Sequence Analysis",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}