{
  "id": 13357,
  "origin_website": "Jove",
  "title": "High Frequency Ultrasound for the Analysis of Fetal and Placental Development In Vivo",
  "procedures": [
    "All methods described here have been approved by the “Landesverwaltungsamt Sachsen Anhalt: 42502-2-1296UniMD.”\n1. Experimental Procedure\nMate 6 to 8-week-old female MC-deficient C57BL/6J-Cpa3Cre/+ (Cpa3Cre/+) mice and MC-sufficient C57BL/6J-Cpa3+/+ (colony controls; Cpa3+/+) with BALB/c males.\nDefine the gestation day (gd) 0 after confirmation of the vaginal plug and treat the females immediately after plug confirmation.\n\tNOTE: A plug is the sperm of the male in the vaginal orifice of the female.\n\t\nInject 250 µL of PBS intraperitoneally in control Cpa3+/+ females.\nInject 250 µL of anti-CD122 (0.25 mg) intraperitoneally in MC-deficient Cpa3Cre/+ females.\n\t\tNote: An injection of 0.25 mg of anti-CD122 depletes peripheral NKs and uNKs in MC-deficient Cpa3Cre/+ females as described previously22.\nWait until gd5.\n\tNOTE: At gd5, there is the earliest possibility for implantation analysis.\n\t\nProceed with steps 2-5 for the ultrasound analysis.\nPerform the ultrasound imaging at gd5, 8, 10, 12, and 14.\n2. Preparation of the Ultrasound System\nTurn on the system (Figure 1A; main power on the back and computer standby at the left site), the heated platform (Figure 1B; at the control pad), and the gel warmer (Figure 1C).\n\tNOTE: Ultrasound gel needs to warm up for approximately 0.5 h.\nEnsure that the isoflurane unit is filling sufficiently (Figure 1D).\nOpen a New Study or New Series in an existing study in the browser. Fill in all the required information (owner, study name, series name, animal data) in the Study Info window. Click Ok.\nAfter clicking Ok, ensure that the B-mode imaging window appears and the imaging in B-mode begins automatically.\n3. Mouse Handling\nAnesthetization of the mouse\n\t\nPlace the mouse in the knockdown box (Figure 1E), close the box, open the isoflurane tube to the knockdown box, and turn on the isoflurane (concentration 3.5%).",
    "When the mouse is anesthetized, lower (to concentration 1.5%) and redirect the isoflurane flow by opening the tube in the direction of the heating platform and close the flow to the knockdown box.\n\t\tNOTE: To reach sufficient anesthesia, wait an additional 10 s after the mouse is no longer moving.\nTransfer the mouse quickly from the knockout box to the heating platform (Figure 1F) in a dorsal position, and gently position its nose in the anesthesia nose tube located on the top of the platform.\nFixation, depilation, and preparation of the mouse for measuring\n\t\nPlace eye protection cream in each eye of the mouse to prevent dry eyes.\nPlace one drop of electrode gel on each of the four copper areas on the heated platform (Figure 1F).\nTap the paws with surgical tape on the electrode gel-coated areas of the heating platform.\nCheck ECG [optimal value = 450-550 beats/min (BPM)] and respiratory physiology at all times.\n\t\tNOTE: By using a rectal probe, body temperature measurement is possible, but not necessary.\nPlace depilatory cream at the abdomen of the mouse, rub the cream with a cotton swab and wait around 1 min. Remove the cream with a water-soaked compress. Repeat this step if not all hairs are gone.\nApply the pre-warmed ultrasound gel on the depilated skin.\n4. Measurements and Acquisition of Images and Videos\nHold the transducer (Figure 1G) in the hand or clamp it in the holding device (Figure 1H; holding device is recommended).\nIdentify the bladder with the transducer and use it as reference point. Move the transducer to the left and right sites of the abdomen to trace implantations.\nB-mode for visualization of anatomical structures in 2D grayscale image",
    "Move the transducer or heating platform table where the mouse is fixated until the first implantation is visible on the screen at its largest size.\n\t\t\nSelect Image Label and enter a name, or Frame Store (storage without name) to store single frames, or Cine Store to store a cineloop for whole implantation measurements.\nMove the transducer or table to bring the placenta to a position where blood flow in the UmA is visible. Store a single frame or cineloop (see step 4.3.1.1) for placental measurements.\n\t\tNOTE: Placental measurements are possible from gd10 onwards.\nContinue with all implantations using the same method.\nColor doppler mode to visualize and determine the direction of blood flow\n\t\nPress the Color button.\nMove the Color Box (in this area, the signal is visible) to the required position by using the trackball. If necessary, change the size of the box by pressing Update and move the trackball (to the right side/upward = bigger; to the left side/downward = smaller). When the box has the right size, press Select.\nStore single frames or cineloops as described in step 4.3.1.1.\nPulse-wave (PW) doppler mode to quantify blood flow through the vessels in the Arteria uterina (uterine artery, UA) and UmA\n\t\nLocate the region of interest in the color doppler acquisition.\n\t\tNOTE: The UA is located caudal to the bladder, and the UmA is located between the fetus and placenta.\nPress PW, and a dashed line will appear. Move this line to the blood vessel of interest and adjust the angle of the line using the “Doppler Angle” knob in line with the blood flow. Press Update.",
    "NOTE: The angle between the direction of the blood flow and the transducer must be consistent in all animals, especially when using angles of greater than 60° (here, 70° for UAs and 45° for UmAs were used).\nStore a cineloop of the appearing doppler lines in the PW doppler acquisition window.\n5. Reviewing and Finishing Data Acquisition and Saving a Series\nTo review data, press Study Management. Scroll to the thumbnail image of interest and double-click Update.\nPress first Study Management then Close in the browser window to finish data acquisition and save a recorded series.\n\tNOTE: After closing a series, it is not possible to store frames or cineloops in this series anymore.\n6. Mouse Handling Following Acquisition of Data\nRemove the gel from the anaesthetized animal with the help of dry compresses.\nRemove the surgical tape carefully from the paws.\nClose the isoflurane tube (concentration 0%).\nProceed with following ultrasound analysis at gd5, 8, 10, and 12.\n\t\nPlace the animal alone in a cage for a minimum of 5 min so it has time to wake up and orientate.\nPlace the mouse back in the original cage.\n\t\tNOTE: Do not turn off the isoflurane before removing the gel and surgical tape, as mice wake up very quickly (around 20 s) after turning off the isoflurane.\nProceed with the following ultrasound analysis at gd14.\n\t\nSacrifice the female before it wakes up by cervical dislocation. Open the animal, remove the uterus, separate the fetuses and placentas, and measure fetal and placental weights.\n7. Copying and Importing the Data\nMark one or more series by clicking Export To and choose the storage space to copy data onto a hard disk.",
    "Open the software at a computer and click Copy From and select the study/series from the hard disk to import a study/series into the software.\nAnalyze the data with the software.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}