{
  "id": 7034,
  "origin_website": "Bio",
  "title": "<em>In vitro</em> Time-lapse Imaging of Primary Cilium in Migrating Neuroblasts",
  "procedures": [
    "Preparation of 35 mm dissection dishAdd KE-106 23 ml, CAT-RG 2.3 ml, and India ink 0.6 ml into a 50 ml tube, and mix them using a stirring rod until the silicone solution becomes homogeneous.Centrifuge the tube at 3,300 x g for 1 min to remove bubbles in the silicone solution.Add an appropriate amount of the silicone solution to a 35 mm dish.Polymerize the silicone solution by incubation at 60 °C for 3 h in an incubator.Dissection of V-SVZ tissues from postnatal day 0-1 (P0-1) mouse brainsA video and detailed procedure for dissection of V-SVZ tissue in the adult brain have been published previously (Mirzadeh et al., 2010). Our method is modified from that of (Mirzadeh et al., 2010) to increase the relative proportion of neuroblasts in the neonatal V-SVZ- tissues. For in vitro time-lapse imaging of migrating V-SVZ-derived neuroblasts, use P0-1 mouse brains. Older brains contain fewer migrating neuroblasts in the V-SVZ.Anesthetize a P0-1 pup by hypothermia (1-2 min) and sacrifice it by cervical dislocation. Use 3-5 pups per experimental group. Tissue dissection (3.-10.) should be performed at 4 °C and within 10 min per pup.Make an incision in both the scalp and skull along the midline of the head using scissors, and remove the dorsal part of the scalp and skull using forceps.Extract the brain into L15 medium (2-3 ml) in a 35 mm dissection dish.Divide the brain into two hemispheres by cutting along the midline under a stereomicroscope with a light source (Figure 1, Step 4).View the brain hemisphere from the dorsal view, and remove the septum and the medial part of the OB (Figure 1, Step 5). This cutting enables one to visualize the anterior lateral wall of the lateral ventricle.",
    "View the lateral wall from the en face view, and remove the cerebral cortex by cutting along the corpus callosum (Figure 1, Step 6).View the brain from the dorsal view, and remove the hippocampus by cutting along the posterior part of the lateral ventricle, which is visualized as a cleft (Figure 1, Step 7).View the lateral wall from the en face view, and remove the thalamus and olfactory bulb (Figure 1, Step 8). As a result, the whole lateral wall of the lateral ventricle can now be visualized.View the brain from the ventral or dorsal view, and collect the V-SVZ tissue by cutting along the border between the V-SVZ and striatum (Figure 1, Step 9). Collected V-SVZ tissue should be semi-transparent. Contamination by a large amount of striatal tissue will decrease the number of neuroblasts migrating out from the cell aggregates embedded in Matrigel.Trim the collected V-SVZ tissue by removing the ventral and posterior V-SVZ (Figure 1, Step 10), to increase the relative proportion of neuroblasts in the V-SVZ tissue (Doetsch and Alvarez-Buylla, 1996).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3823/bioprotoc-10-22-3823-g001.jpgFigure 1. Dissection of V-SVZ tissues from postnatal mouse brains. Illustrations for steps 1-10 correspond to the descriptions in Procedure B Steps 1-10, respectively. Red arrows indicate lines of cutting. A video of the original procedure for dissection of V-SVZ tissues is shown in Mirzadeh et al. (2010).Dissociation of V-SVZ cellsIncubate the V-SVZ tissues with 200 µl of pre-warmed trypsin-EDTA (37 °C) at room temperature (RT) for 3-4 min without pipetting in a 1.5 ml microtube.Briefly centrifuge the tube and remove the trypsin-EDTA.Add 200 µl of 10% FBS/L15 medium (for trypsin inactivation) and 8 µl of 2 mg/ml DNase, and dissociate the V-SVZ tissues into single cells by pipetting using a P200 micropipet.Pass the cell suspension through a 70-µm cell strainer to remove tissue debris.",
    "Add 800 µl of DNase I solution with gentle pipetting.Centrifuge the tube for 1 min at RT, and remove the supernatant.Wash the cells with 800 µl of DNase I solution with gentle pipetting.Centrifuge the tube for 1 min at RT, and remove the supernatant.Proceed to Procedure D (Nucleofection and Matrigel embedding). When using a transgenic mouse line that labels specific cells and/or subcellular organs by fluorescent proteins (e.g., GFP::Cent2 mice), skip the steps for plasmid transduction (Steps D1-D8).Nucleofection and Matrigel embeddingPrepare Mouse Neural Stem Cell Solution (Lonza, see manufacturer’s instructions).Resuspend the cells with 100 µl of Mouse Neural Stem Cell Solution with gentle pipetting.Add ~2.0 µg of plasmid(s) to the cell suspension. If two or more plasmids are introduced, the total amount of those plasmids should be ~2.0 µg.For labeling of the primary cilium, we use a plasmid encoding Arl13b::Venus (Matsumoto et al., 2019). For labeling of the basal body, we use a plasmid encoding dTomato::Cent2 (Matsumoto et al., 2019). A GFP::Cent2 transgenic mouse line (Higginbotham et al., 2004) is also useful for time-lapse imaging because all neuroblasts express GFP::Cent2. For labeling of the microtubule plus-end, we use a plasmid encoding EB3::GFP (Watanabe et al., 2015).Transfer the cell suspension to a cuvet using a dropper (included in the Amaxa Nucleofector Kit).Transduce the plasmid(s) into the cells using Amaxa NucleofectorTM II (program: G-013).Add 400 µl of pre-warmed RPMI-1640 medium (37 °C) to the cuvet.Transfer the cell suspension (a total of 500 µl) to a 1.5 ml microtube and incubate it at 37 °C (water bath) for 15 min to allow the cells to recover.Centrifuge the tube for 1 min at RT, and remove the supernatant.Wash the cells with 200 µl of DNase I solution with gentle pipetting, and transfer the cell suspension to a 0.5 ml PCR tube.",
    "Centrifuge the tube for 2 min at RT.Carefully transfer the cell pellet (while maintaining its shape) from the PCR tube to L-15 medium in a 35 mm dissection dish by gentle pipetting (Figure 2, Step 1).Prepare 500 µm x 500 µm x 500 µm cell aggregates from the cell pellet using an ophthalmic knife and ultrafine forceps (Figure 2, Step 2).Carefully transfer 1-5 cell aggregates into a 1st drop (8 µl) of 60% Matrigel/L15 on a 35 mm dish (4 °C), to replace L-15 medium surrounding the cell aggregates with 60% Matrigel/L15 (Figure 2, Step 3). The percentage of Matrigel will affect the migration behaviors of cultured neuroblasts: individual and chain migration will be observed in 50% and 70-100% Matrigel, respectively. Matrigel concentration less than 50% will result in the failure of gelation (Step D16).Carefully transfer the cell aggregates from the 1st drop into a 2nd drop (8 µl) of 60% Matrigel/L15 on a 35 mm dish (4 °C) (Figure 2, Step 4). Carrying in an excess volume of the 1st drop with the cell aggregates will result in a decrease of the Matrigel concentration in the 2nd drop and the failure of gelation (Step D16).Add 60% Matrigel/L15 containing 2-5 cell aggregates to a 35 mm multiwell glass-bottom dish (Figure 2, Step 5).Incubate the dish for 3 min at 4 °C for sedimentation of cell aggregates within 60% Matrigel/L15, and subsequently for 15 min at 37 °C in the presence of 5% CO2 for Matrigel gelation.Carefully add 200 µl of Neurobasal final medium and culture the cell aggregates for 2 days at 37 °C in a CO2 incubator in the presence of 5% CO2.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3823/bioprotoc-10-22-3823-g002.jpgFigure 2. Preparation of V-SVZ cell aggregates. Illustrations for steps 1-5 correspond to the descriptions in Procedure D Steps 11-15, respectively.",
    "Blue and red arrows in steps 1 and 3-5 indicate the direction of blowing and aspiration, respectively. Red arrows in step 2 indicate lines of cutting. Cell aggregates indicated by asterisks (step 2) should be discarded. These procedures have been used previously (Hirota et al., 2007).In vitro time-lapse imaging of migrating neuroblastsStart up the confocal laser-scanning microscope system and stage-top incubation chamber set at 37 °C. To stabilize the culture environment within the stage-top incubation chamber, incubate the chamber without cells for 1 h at 37 °C in the presence of 5% CO2.Set a 35 mm glass-bottom dish containing cultured neuroblasts in the stage-top incubation chamber, and incubate it for 2 h at 37 °C in the presence of 5% CO2.Choose the appropriate objective lens. To perform time-lapse imaging of the basal body and primary cilium, a 63x oil-immersion objective lens is preferable. Lengths of a neuroblast and its primary cilium are typically 0.5-3.0 µm and 60-80 µm, respectively. Since the primary cilium and its associated structures are tiny subcellular components, confocal or superresolution laser-scanning microscopy is highly recommended for time-lapse imaging to understand their spatiotemporal dynamics in migrating neuroblasts. The optical zoom and resolution setting in the confocal laser-scanning microscope system are also useful to increase the imaging resolution.Set the laser configuration for image acquisition in the confocal laser-scanning microscope system by adjusting the pinhole size, laser intensity, detector gain and offset in all channels. Set the pinhole to 1 Arbitrary Unit for clear image acquisition of the basal body and primary cilium. Excessive laser intensity will induce phototoxicity or photobleaching in targeted neuroblasts and their primary cilium. High-sensitivity GaAsP detectors can be used for brighter time-lapse imaging. Excitation wavelengths used in this study were as follows: 488 nm for GFP/Venus, 561 nm for dTomato.",
    "(Optional) Improve the resolution of time-lapse images by using superresolution methodology. For settings used for superresolution imaging, follow the instructions of the microscope’s supplier. In our EB3::GFP and dTomato::Cent2 imaging, which visualizes microtubule polymerization and centrioles, respectively, we use an  LSM880 with Airyscan  imaging system (Carl Zeiss), and its image acquisition settings are as follows: 63x (NA 1.4) oil-immersion objective lens, S-R mode, Optical zoom 1.8x, 0.043 µm/pixel, and pixel dwell 2.38 µsec (Matsumoto et al., 2019).Set time- and z-intervals, which are determined depending on the experimental purpose. In our experiments (Matsumoto et al., 2019), time-lapse images of primary cilium and microtubule polymerization dynamics in neuroblasts are acquired at 1-2 min and 4-sec intervals, respectively. To monitor the dynamics of the basal body and primary cilium in migrating neuroblasts, z-stack images are acquired at 0.6 µm intervals.Set the imaging period, which is determined depending on the experimental purpose. If photobleaching or phototoxicity is observed, decrease the laser intensity, and/or increase the z-/time-intervals.Start the image acquisition. After finishing image acquisition, save the imaging file in a format specified by the confocal microscope supplier (e.g., .lsm or .czi format for Carl Zeiss). If necessary, save z-stack projection images as well."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}