{
  "id": 17351,
  "origin_website": "Jove",
  "title": "Fertility Sparing Procedure using Carbon Dioxide Fiber Laser Vaporization of Ovarian Endometrioma",
  "procedures": [
    "All the studies were conducted in compliance with the Declaration of Helsinki, as outlined in the International Conference on Harmonization Guidelines for Good Clinical Practice. Written informed consent for data collection and anonymous publication of disease-related information is routinely obtained at the institution during patient interviews preceding surgical treatment. Women participating in the randomized controlled study signed a specific informed consent form. The Institutional Review Board of the institution approved all the studies. A diagram of the studies' protocols is shown in Figure 1.\n1. Patient selection\nOnly include women with primary unilateral or bilateral endometriomas, with the largest cyst diameter between 3-8 cm, of reproductive age, and who have undergone surgery at San Raffaele Scientific Institute for pain or infertility.\nAdditionally, exclude patients aged ≥ 40 years; with previous surgery of the ovaries, unilateral oophorectomy, salpingectomy, or hysterectomy; with endocrine diseases; undergoing hormonal treatment within 3 months of ovarian reserve assessment; or with suspicion of ovarian atypical endometriosis at the pre-operative ultrasound evaluation stage.\n2. Patient characteristics\nIdentify the basal patient characteristics as follows. At baseline (before surgery), perform a detailed medical interview and pelvic ultrasound scan. In particular, collect data regarding age, surgical indication, offspring desire, body mass index (BMI), volume (expressed in cm3) and mean diameter (expressed in cm) of unilateral or bilateral endometrioma, and the volume of each ovary.\nFor ovarian reserve analysis, check the antral follicular count (AFC) and antimullerian hormone (AMH) levels. At baseline (during the first 2-3 days of the menstrual cycle), evaluate the AFC by pelvic ultrasound, and collect blood samples to determine AMH levels. Assess the AFC in both ovaries, before and after surgery, by counting the number of follicles with an average diameter of 2-10 mm.\n3. Surgical technique",
    "NOTE: A team of surgeons with extensive experience in the treatment of endometriosis is required.\nFirst, place the patient on the operating table with their legs placed into stirrups.\nAfter administering general anesthesia, place the patient in the lithotomic position, a variation of the supine position in which the legs are separated from the midline in a 30° to 45° abduction with the hips flexed until the thighs form an angle between 80° and 100°.\nEstablish a sterile field by cleaning the following areas with a sponge soaked in antiseptic solution: the apex of the umbilicus, the abdomen, the perineum, and the top third of the thighs. Then, scrub with a gauze drenched in iodine solution the vulva and, when possible, the vaginal interior up to the cervix and discard it. Repeat this step 3x.\nWith a new sponge drenched in iodine solution, swab the anus twice and discard it. Dry the prepared external areas with a sterile towel and place sterile drapes. Insert a urethral catheter for continuous bladder drainage.\nWhen possible, with the use of an anterior and posterior vaginal retractor, expose the cervix and insert the uterine manipulator into the cervix. Create a pneumoperitoneum by either a Verres needle inserted at an angle of 45° in non-obese patients to 90° in obese patients) or using the open technique (a small, 1 cm incision is made below the umbilicus on the midline). Keep the insufflation pressure between 12 mmHg and 14 mmHg.\nInsert a laparoscope and inspect the upper and lower abdomen. After positioning the patient in a slight Trendelenburg position, place the other laparoscopic access (usually two or three). Perform either CO2 fiber laser ablation or stripping technique as described below.\nOne-step CO2 fiber laser vaporization",
    "Firstly, mobilize both adnexa to restore the normal anatomy of the pelvis. Then, by using an aspiration or irrigation device, drain the cyst content and irrigate and inspect its inner wall. Take a biopsy of the cyst wall using scissors and send it for routine histological examination to confirm the diagnosis of endometriosis.\nSelect the basic operation mode and set the device to fiber laser mode with the continuous wave and constant timed-exposure mode at a power density of 13-15 W13.\nEvert the cyst with grasping forceps in order to expose the inner cystic wall and completely vaporize the inner wall with a CO2 fiber laser in a radial way, starting from the center to the periphery, keeping the tip of the fiber at a distance of at least 1 cm from the cystic surface (see Table of Materials).\nDo not suture the ovary after vaporization. Carefully control any source of bleeding at the end of the procedure using the water test (i.e., washing the bleeding sites to visualize and achieve hemostasis selectively) or by slightly reducing the pneumoperitoneum.\nCystectomy\n\t\nStart with adhesiolysis in order to free the ovaries from the surrounding structures. Make a sharp cortical incision on the thinnest part of the cyst, just enough to identify the correct cleavage plane. Avoid making the incision close to the fallopian tube or fimbriae.\nTake the edges of the incision with two grasping forceps and strip out the cyst from the healthy ovarian parenchyma by delicate traction and counter traction maneuvers.\nAfter removal of the cyst, perform selective hemostasis with bipolar coagulation using the water test, mainly on the edges of the ovary, to reduce the risk of ovarian damage13.",
    "At the end of the surgery, carefully remove the uterine manipulator if positioned. Suture the fascia with a medium absorption rate braided suture size 0 and the skin with a quick absorption rate suture size 3-0. Place patches on all the incisions and remove the urethral catheter the day after the surgical procedure.\n4. Post-operative follow-up and testing\nIdentify the endometriosis stage. Perform endometriosis staging according to the revised American Society for Reproductive Medicine (r-ASRM) classification17. Calculate the lesion score and total score at the end of surgery based on the surgery report, according to the standards of the r-ASRM classification, and report these as the r-ASRM score.\nFollow-up 30 days after the surgical procedure. After surgery, refer the patient to the endometriosis outpatient clinic for follow-up. In the case of patients with no immediate pregnancy intention, prescribe hormonal therapy (progestins or estroprogestins).\nAssess recurrence rate.\n\tNOTE: To assess the recurrence rate, the minimum follow-up duration is 12 months.\n\t\nPerform periodic gynecological examinations at intervals ranging from 3-12 months, according to patients' offspring desire or onset of symptoms (i.e., dysmenorrhea, chronic pelvic pain, dyspareunia).\nAt every follow-up, perform a gynecological examination as well as a transvaginal ultrasound to check for recurrence of the endometriotic cyst. In case of the identification of a cyst with a typical sonographic aspect and a diameter of more than 10 mm arising on the operated ovary, confirmed by transvaginal ultrasound, consider it as cyst recurrence. Assess the symptoms of cyst recurrence by interviewing the patient.\nAssess pregnancy outcomes. Allow patients wishing to conceive to attempt spontaneous conception for a period of 6-9 months in the case of CO2 fiber laser vaporization and for a period of 12 months after cystectomy. If spontaneous conception fails, refer the patients immediately for assisted reproductive techniques (ART).",
    "NOTE: Pregnancy is defined as the evidence of a vital embryo in utero by transvaginal ultrasound at 6 weeks of pregnancy. As suggested by usual clinical practice, in case of the absence of fetal cardiac activity at 6 weeks of pregnancy, wait for at least 7-10 days to diagnose a pregnancy loss. The time taken for spontaneous conception is defined as the interval between surgery and spontaneous conception (or the first IVF when natural conception fails). Do not include patients who become pregnant following oocyte donor-IVF.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}