{
  "id": 3319,
  "origin_website": "Cell",
  "title": "Immunofluorescence protocol for localizing protein targets in brain tissue from diverse model and non-model mammals",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThis protocol is performed in a 6-multiwell plate (Note: the volume to add per well is at least 1 mL). The transfer of the tissue from one well to another is performed with a glass Pasteur pipette with a modified tip (i.e., hook-shaped) (troubleshooting 5[href=https://www.wicell.org#sec6.9]). A brush can also be used, but it is not recommended as it can often tear/damage the tissue. All the incubation steps below (if not differently noted) are performed on a shaker (80 rpm).\nAntigen retrieval\nTiming: 15–30 min\nTissue fixation could mask the protein epitopes to which the primary antibody should bind. Antigen retrieval is highly recommended for the success of the protocol, especially when monoclonal antibodies are used. A change in pH and temperature will lead to the unmasking of the target. Here, we suggest a mild buffer (pH6), and a not-too-high temperature (no more than 100°C). Such parameters have been tested to prevent tissue damages and to allow antigen retrieval (for a wide range of specimens).\nWash the tissue section for few seconds in PBS 1× (to wash it from the anti-freezing solution and to acclimatize it to room temperature).\nHeat the antigen retrieval buffer in a beaker until boiling (with a microwave or a laboratory heating stove). Insert the slice and keep the buffer boiling for 5 min (troubleshooting 4[href=https://www.wicell.org#sec6.7]).\nCritical: Before using the section, let the antigen retrieval buffer cool down for around 30 min at room temperature to avoid a thermal shock.\nIncubate the slice in PBS 1× (to recover the physiological pH).",
    "Note: Processing multiple sections in one immunostaining session is possible (and recommended when comparing multiple specimens). However, it is recommended to process one section at a time for the antigen retrieval. Once you have finished the antigen retrieval for all sections, you can proceed to the next step and treat them in parallel.\nReduction of autofluorescence\nTiming: 40 min\nTiming: 30 min (for step 4)\nTiming: 5 s (for step 5a)\nTiming: 5 s (for step 5b)\nTiming: 4 min (for step 5c)\nOne of the main issues of immunofluorescence on non-perfused or hyper-fixed tissues is the high autofluorescence background, often masking the antibody signal. Incubation in Sudan black allows a significant reduction of the background noise, leading to an increased signal/noise ratio.\nIncubate the section with Sudan Black buffer (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nWash the slice.\nCritical: Sudan Black buffer leaves a strong dark coloration in the well: it is better to transfer the tissue to a new multiwell.\nEthanol 70%.\nEthanol 50%.\nPBS 1× (see troubleshooting 5[href=https://www.wicell.org#sec6.9]).\nPermeabilization and blocking\nTiming: 1 h\nTiming: 1 h (for step 6)\nIncubation with blocking solution will permeabilize the cells (allowing a better penetration of the antibodies) and lower the non-specific binding of the antibodies.\nNote: \"If the antibody's target is localized on the membrane/transmembrane, you can avoid the use of triton in the blocking solution.\nIncubate the slice with blocking solution (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]) at room temperature, on the shaker.\nPrimary antibody labeling\nTiming: overnight\nIn this step, the primary antibody will bind its target.\nNote: Each antibody has its own dilution rate that should be experimentally determined. It is possible to use more than one antibody at the time in the same solution, as long as they are derived from different host-species.",
    "Dilute the blocking solution 1:5 in PBS and add the antibody according to the right dilution (see key resources table[href=https://www.wicell.org#key-resources-table]).\nIncubate overnight on a shaker at 4°C.\nPause point: If necessary, you can incubate the primary antibody for more than one night, up to 3. However, this step is not recommended, because long incubation times on the shaker can damage the tissue.\nSecondary antibody labeling\nTiming: 3 h\nTiming: 10 min each wash (for step 9)\nTiming: 2 h (for step 11)\nTiming: 10 min each wash (for step 12)\nTiming: 1 h (for step 13a)\nTiming: 10 min each (for step 13a i)\nTiming: 20 min (for step 13a ii)\nTiming: 10 min each wash (for step 13a iii)\nTiming: 1 day (for step 13b)\nTiming: 10 min each (for step 13b i)\nTiming: 10 min (for step 13b ii)\nTiming: 1 h (for step 13b iii)\nTiming: 10 min (for step 13b iv)\nTiming: 5 min each (for step 13b v)\nTiming: overnight (for step 13b vi)\nThe sample is now ready to be incubated with the proper secondary antibody conjugated with a fluorophore, for fluorescence detection.\nNote: The dilution of the secondary antibody should be experimentally determined, however it is common to use a dilution rate 1:400–1:1000. To choose the right secondary antibody, see troubleshooting 6[href=https://www.wicell.org#sec6.11]).\nWash the sample in PBS 1× for three times.\nDilute blocking solution 1:5 in PBS and add the right volume of secondary antibody according to the right dilution (see key resources table[href=https://www.wicell.org#key-resources-table]).\nIncubate on the shaker at room temperature.\nCritical: secondary antibodies are light-sensitive, therefore from this step on, it is important to protect the multiwell plate with aluminum foil.\nWash the sample in PBS 1× for two times.\nNuclear staining",
    "Nuclear staining is usually performed using 4,6-diamidino-2-phenylindole (DAPI) or Hoechst. However, these classical intercalants could not work on hyper-fixed tissues (e.g., tissues obtained from brain banks have been usually sitting in fixatives for months or years). A valid substitute is the NeuroTrace (the fluorescent counterpart of Nissl staining, (see key resources table[href=https://www.wicell.org#key-resources-table]). Here, we report both protocols, choose the proper one according to the fixation duration of the tissue. We recommend nuclear staining dilutions, but they need to be experimentally determined depending on the tissue.\nNuclear staining.\nIncubate with DAPI/Hoechst at the dilution of 1:500 in PBS 1×.\nWash the sample with PBS 1× for two times on a shaker.\nDilute DAPI or Hoechst in PBS 1× and incubate with the sample.\nWash the sample in PBS for three times on a shaker.\nIncubate with NeuroTrace at the dilution of 1:20 in PBS 1×.\nWash the sample in PBS 1× for two times on a shaker.\nWash the sample in PBS 1× – 0.3% triton on a shaker\nDilute the NeuroTrace in PBS 1× and incubate on the shaker at room temperature.\nWash the sample in PBS 1× – 0.1% triton on a shaker.\nWash twice in PBS 1× on a shaker.\nIncubate in abundant PBS 1× at 4°C.\nCritical: To avoid damaging the tissue, it is suggested to avoid the shaker at this step.\nMounting and preservation\nTiming: 1 day\nMount carefully the section on a glass-slide using a brush to prevent formation of folding and/or bubbles (troubleshooting 7[href=https://www.wicell.org#sec6.13]).\nSeal the slide using a mounting medium (we used Permount, see materials and equipment[href=https://www.wicell.org#materials-and-equipment], but also other mounting medium can be used, as Mowiol) and let it dry overnight at room temperature.\nCritical: No shaker here.\nStore the slide in a dark box at +4°C, to avoid signal bleaching.",
    "Use a confocal microscope to image the samples for the best signal-to-noise ratio."
  ],
  "subjectAreas": [
    "Evolutionary Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}