{
  "id": 9043,
  "origin_website": "Jove",
  "title": "Spiral Ganglion Neuron Explant Culture and Electrophysiology on Multi Electrode Arrays",
  "procedures": [
    "Animal care and experimentation was performed in accordance with the guidelines of the Swiss local authorities (Amt für Landwirtschaft und Natur des Kantons Bern, Switzerland).\n1. Prepare Solutions for Experiments\nPrepare the extracellular matrix (ECM) coating solution (see Material Table, point 6): Thaw ECM mix on ice. Dilute the ECM mix 1:10 in basic culture medium (without neurotrophic factors or Fetal Bovine Serum (FBS)) and store on ice.\nPrepare the culture medium (see Material Table, point 1): Prepare a stock of Neurobasal medium not containing FBS or Brain Derived Neurotrophic Factor (BDNF). Supplement neurobasal media with fresh FBS (10%) and BDNF (5 ng/ml) just prior to adding to the cell culture.\nPrepare the extracellular solution (see Material Table, point 2).\n2. Washing and Sterilization of MEAs\nNOTE: The MEAs used for the experiments contain 68 electrodes arranged in a rectangular grid (Figure 1E). Each electrode has a size of 40 x 40 µm2 with a spacing of 200 µm from center to center. The electrodes are made of platinum. The electrodes are connected to the corresponding contacts by a circuit made of indium tin oxide. This circuit is insulated by a 5 μm layer of SU-8. See Material table for details on the provider. Other MEA layouts may be suitable for these experiments.\nFor new MEAs: Rinse them by immersing in 70% ethanol for 30 sec and wash with distilled water for 30 sec. Work in a laminar flow hood.\nLet the MEA dry for 30 min in a laminar flow hood.\nPut each MEA into an individual sterile Petri dish (35 mm x 10 mm) and seal with foil. The MEAs can be stored until used.",
    "For used MEAs: Incubate the MEAs in a Petri dish (35 mm x 10 mm) containing 1 ml of enzymatic solution (see Materials Table, point 6) O/N on orbital shaker at RT to remove biological material. Then continue as in step 2.1.\n\tNOTE: Handle the MEAs with care using forceps with rubber-covered tips.\n3. Preparation of MEAs for Culture Experiments\nRemove the sealing foil and leave the MEA in the Petri dish (35 mm x 10 mm) for the whole experiment.\nCoat the MEAs with the solution prepared in 1.1: Use a cold 200 µl pipette tip (stored at -20 °C) to pipet 50 µl of coating solution to each MEA, covering the whole electrode area.\nAllow MEAs to coat for 30 min to 1 hr at RT.\nRemove the coating solution using a pipette. Apply 100 µl of culture medium supplemented with 10% FBS and 5ng/ml BDNF and leave it at RT until plating the tissue.\nPlace 2 Petri dishes containing the coated MEAs into a large petri dish (94 mm x 16 mm) and add a third small petri dish containing 1.5 ml of Phosphate Buffered Saline (PBS) for humidification.\n\tNOTE: Adding a small petri dish (step 3.5) containing PBS is crucial to significantly minimize evaporation of culture medium.\n4. Spiral Ganglion Dissection\nNOTE: Gross dissection can be done outside the laminar flow hood (Step 4.1 to 4.4). For fine dissection sterile conditions (laminar flow hood) are mandatory (from step 4.5).\nEuthanize animals (5-7 day old mice) by decapitation without prior anesthesia.\nSterilize the head by spraying with 70% ethanol.\nBy holding the head, cut the connection between the skin and the skull with a sharp/sharp scissor along the sagittal line.\nCut the skull sagittally and remove the brain using sharp/blunt scissors.",
    "Cut the temporal bones from the skull and place those in a petri dish containing sterile ice cold Hanks' Balanced Salt Solution (HBSS).\nUsing a dissection microscope, dissect the tympanic bulla using fine forceps and isolate the inner ear.\nRemove the bone of the cochlea, using fine forceps.\nRemove the spiral ligament and stria vascularis (SV) together by holding with forceps the basal portion of the spiral ganglion (SG) and the SV and slowly unwinding the SV from base -to-apex\nIsolate the organ of Corti (OC), the SG and the modiolus (Figure 1A-C)\nSeparate the OC from the SG and modiolus by holding with forceps the basal portion of the SG and the OC and slowly unwinding the OC from base-to-apex.\nCut lateral explants (200 to 500 µm in diameter) from the spiral ganglion still attached to the modiolus (Figure 1D) using a forceps and a micro scalpel.\n5. Spiral Ganglion Explant Culture on MEAs\nPlace two spiral ganglion explants next to the electrodes on the MEA previously prepared with 100 µl of culture medium.\nPlace the organ of Corti approximately 5 mm away from the electrode area.\nUse forceps to pin the explants and the organ of Corti onto the MEA while avoiding damaging the tissue.\nPlace the MEAs carefully into the incubator and culture at 37 °C and 5% CO2. The next day, visually inspect that the explants have attached to the MEA.\n\tNOTE: If explants have not attached O/N, they will rarely do so over the next days. The OC is placed adjacent to the culture for trophic/neurotrophic support.\nAdd 100 µl of culture medium containing 10% FBS and BDNF daily for 5 consecutive days.",
    "On day 6 add 2 ml of culture medium containing 10% FBS and 5ng/ml BDNF and culture the tissue for an additional 13 days.\n6. Electrophysiological Recordings to Investigate Spontaneous and Electrode Stimulation Dependent Activity\nWash the MEA culture with extracellular solution prepared in step 1.3, at RT.\nDry the contacts with a tissue and mount the MEA on the MEA setup.\n\tNOTE: To keep the culture humid during the mounting, add a small drop of extracellular solution to the culture.\nAdd 300 µl of extracellular solution and wait for 10 min before recording, to allow the system to stabilize.\nRecord spontaneous activity for 2 min from all electrodes by pressing on the record/acquire button of the software and identify recording electrodes.\nMEA electrode stimulation: Select the amplitude/duration/shape of the stimulus on the appropriate software and apply to several electrodes consecutively as described 13. Select the electrodes based on the ones showing spontaneous activity (as in step 6.4). Record from all of the remaining electrodes.\nTo exclude stimulation artifact, stimulate from the same electrode 10 times. If the culture responds at least 8 out of 10 times, it can be assumed as a positive response upon electrode induced stimulation.\nTo identify background noise, apply Tetrodotoxin (TTX) to the cultureat a concentration of 1 µM, to block voltage-gated sodium channels and record for 2 min. Use this to perform spike detection (7.1 and 7.2).\n7. Data analysis\nNOTE: Data analysis has been previously described in detail in 6 and 5. For specifics on software used in this study see Materials Table, point 7.\nUsing the appropriate software detect spontaneous activity for each electrode employing a detector based on standard deviations and a subsequent discriminator. This procedure is described in 6. Activity appears as fast voltage transients (<5 msec).",
    "Choose a threshold that results in no activity when analyzing the TTX treated samples.Adapt the threshold value for each experiment to discriminate between false positive and false negative detections.\nUsing appropriate software observe the detected neuronal activity of each electrode as a raster plot according to standard procedures (see Figure 2A-C).\nDetermine and display the total network activity by summing up all detected events within a sliding window of 10 msec, shifted by 1 msec steps.\nDetect stimulation-induced activity by displaying the raw data using appropriate analysis software. Identify the single spikes offline manually. Single spikes appear as fast voltage transients, occurring after the stimulation artifact (arrow head in Figure 2E). An example is shown in Figure 2E.\nDepending on the experiment, analyze the number of responding electrodes, the threshold needed to achieve a response, number of action potential per electrodes and other parameters of interest 5.\n8. Tissue Fixation and Immunohistochemistry\nNOTE: The staining process will destroy the MEA. See Material Table (point 4) for reagents.\nDirectly after recording wash the cultures with 37 °C warm PBS three times. Discard the PBS and apply 4% Paraformaldehyde (PFA) (in PBS), preheated to 37 °C for 10 min.\n\tCAUTION: PFA is toxic. Work in a chemical hood with appropriate protection and discard solution according to guidelines.\nWash the cultures three times with PBS and block with 2% Bovine Serum Albumin (BSA) in PBS (0.01% Triton-X100) for 2 hr.\nAdd the first antibody (Anti-βIII Tubulin, TUJ antibody) diluted in PBS (2% BSA and 0.01% Triton-X100) and leave O/N at 4 °C. Wash the culture three times with PBS.\n\tNOTE: From now on keep the sample in the dark as often as possible to minimize bleaching of the secondary fluorescently-labeled antibody.",
    "Add the secondary antibody, diluted in PBS (2% BSA and 0.01% Triton-X100) and incubate for 1 to 2 hr at RT. To stain nuclei add 1:10,000 DAPI (1 mg/ml stock) for 10 min.\nWash three times with PBS and mount the samples backwards to thin cover slips (24 x 50 mm2) using mounting medium (see Materials Table, point 4). Image using a fluorescent microscope with 5X and 20X magnification."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}