{
  "id": 5109,
  "origin_website": "Bio",
  "title": "A Live-imaging, Heat Shock-inducible System to Measure Aux/IAA Degradation Rates in Planta",
  "procedures": [
    "Note: Expression levels of Aux/IAA proteins are typically very low, so we have modified an existing heat-shock-inducible promoter system (Gray et al., 2001) to generate high levels of a fluorescently-tagged Aux/IAA for live cell imaging in root tissues prior to hormone treatment. Generation of transgenic Arabidopsis plantsHeat-shock inducible VENUS-tagged Aux/IAA constructs (HS::VENUS-IAA-NLS) were cloned as previously described (Guseman et al., 2015; Moss et al., 2015) and based on pGREEN vectors containing the soybean heat shock promoter HS6871 (Gray et al., 2001). Arabidopsis plants were transformed with these constructs using the floral dip method (Clough and Bent, 1998). The plants were then selected for two generations on 0.5x LS agar plates containing 50 mg/ml kanamycin, to obtain T2 lines. For the experiments described below, 2-3 independent T2 lines for each construct should be used (see Notes 3-5).Plating and growing seedlingsNote: steps B1-4 below should be carried out in aseptic conditions in a sterile hood. Pour 0.5x LS + 0.8% agar into square Petri plates in a sterile hood. Pour 1 plate for each independent plant line per experiment.  Aliquot ~30 seeds into 1.5 ml tubes and add 300 μl of seed sterilization solution. Set tubes on their sides to ensure all seeds are in contact with solution. Let sit for 15 min and then remove sterilization solution and replace with 95% ethanol. Invert several times to wash. Completely remove 95% ethanol using a pipette and replace with sterile plating agar solution. Be sure to also plate non-fluorescent siblings (or other non-fluorescent line) to use as controls.Use a 1,000 μl pipette tip to gently aspirate seeds and transfer onto 0.5x LS plates. For each independent line, plate into 2 rows of 12 plants per plate (Figure 1A). Seal plates with micropore tape or Parafilm.",
    "Stratify seedlings vertically at 4 °C in the dark (cover with aluminum foil) for 2 days.  Grow vertically in a growth chamber set under 16L:8D light conditions and 20 °C for 7 days. Heat shock induction After 7 days of growth, place plates horizontally on a slide warmer set at 37 °C for 2 h to induce expression of the VENUS-IAA protein (Figures 1B and 2A).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160727/20160727002711_3385.jpgFigure 1. Experimental set-up and analysis for heat-shock degradation assay. A. 7-day old seedlings sown on square, vertically-grown 0.5x LS + 0.8% agar plates. B. Seedling plate undergoing heat shock on a slide warmer. C. Cover slip wrapped with lab tape to fit in a slide holder. D. Disc cut from coverslip media agar using a small Petri dish. E. Trimming edges off of disc so that it will fit evenly on the coverslip. F. Perfume bottle containing 0.5x LS media with ethanol or 5 μM IAA. G. Agar pad with seedlings arranged on top. H. Cover slip placed on top of agar pad and flipped over. I. Coverslip placed in the microscope slide holder. J. Close-up image of agar-plant-coverslip in slide holder.Auxin-induced VENUS-Aux/IAA degradation assayPrepare 0.5x LS Media + 1.2% agar coverslip media. This agar concentration is critical because it is rigid enough to handle, but low enough concentration to reduce background autofluorescence during fluorescence imaging.  Pour 4 plates in a sterile hood, adding IAA to 2 plates and ethanol (mock) to 2 plates. To do this, pour 50 ml of media into a sterile 50 ml tube, add 50 μl of 5 mM IAA or 95% ethanol. Mix by gentle inversions and pour into two square plates.  Prepare a rectangular 24 x 50 mm coverslip to fit within a microscope slide holder.",
    "Wrap lab tape around each end ~3 times in order to add length so that the coverslip will fit snugly in the holder (Figure 1C). These thin coverslips break easily, so be sure to handle gently.  When coverslip media plates are solid, use a 35 mm round Petri dish to cut circles into the agar (Figure 1D). Use a razor blade to further cut the circle so that the agar slice will fit over the coverslip and plants (Figure 1E). While cutting a circle with the small Petri dish is not a necessity, we found the agar slices cut this way were easier to remove from the plate. Alternatively, use a razor blade to cut your slice and carefully lift it from the plate.Prepare 5 μM IAA or mock treatments to be sprayed onto seedlings. Pipet 4 ml liquid 0.5x LS into two clean 5 ml perfume bottles (Figure 1F). Add 4 μl of either 95% ethanol (mock) or 5 mM IAA stock solution into the perfume bottle. Keep perfume bottles clean by washing with ethanol, and then rinsing with water and LS. Save separate, labeled bottles for mock and IAA solutions. Using forceps, transfer 5-6 seedlings from the plate warmer to a separate agar plate (use an extra non-supplemented plant-growth plate). Spray with liquid 0.5x LS containing either 5 μM IAA or vehicle (95% ethanol). Use enough liquid to fully cover the root tips.  Using forceps, quickly arrange these seedlings onto an agar block (prepared in step D4) containing appropriate treatment (mock or 5 μM IAA) (Figure 1G). Place a coverslip over the agar block sandwiching the seedlings (Figure 1H). Be careful to avoid bubbles near the root tips. Flip the agar-plant-coverslip over and place in slide holder to image (Figure 1I-J).",
    "Image plant root tips at 0, 10, 20, 30, 40, and 60 min post-treatment (Figure 2B). It is important to minimize time between sample prep and imaging, as well as to maintain consistency between samples. We used a Leica DMI 3000B microscope fitted with a Leica long working 40x HCX PL FLUOTAR objective (see Note 2), illuminated with a Lumencor SOLA light source, and YFP filter cube. Images were captured using Leica LAS AF version 2.6.0 software and a Leica DFC345 FX camera. It is important to image all plants with the same intensity and gain settings. We used a 1 sec exposure and 3.6 gain. Based on the microscope system and particular fluorophore, it may be necessary for each lab to determine ideal exposure and gain settings. It is important to note that photobleaching may occur. In our experiments, we used controls lines with VENUS alone (i.e., with no fused IAA protein) and also mock-treated VENUS-IAA lines to test and document the extent of photobleaching that occurs over the imaging time course (Guseman et al., 2015; Moss et al., 2015).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160727/20160727003009_0384.jpgFigure 2. Schematic of auxin-induced VENUS-Aux/IAA degradation (A) and representative fluorescent root tip images following auxin or mock treatment (B) Fluorescence quantification and analysisUsing Fiji software, open image files making sure that “autoscale” is not checked at the bottom left of the initial pop-up window. Images will all initially appear black. The images for individual plants should be arranged into a stack of time points (Figure 3A-B). Set all images to the same brightness/contrast by using the Image > Adjust > Brightness/Contrast function for a single image, and then check the “Propagate to all other open images” box. We used a minimum and maximum of 500 and 2,200, respectively (Figure 3C).",
    "Using the box tool, create a box the size of the root tip region of interest (Figure 3D). Rotate the box to fit by using the Edit > Selection > Rotate function, and then move the box over the region of interest (Figure 3D). Measure pixel intensity by pressing the “M” button. Be sure that “Mean gray value” is checked under Analyze > Set Measurements. Save the region of interest box by opening Analyze > Tools > ROI Manager, and repeat measurement with this identical box on all other images in the stack. For the next stack, you may need to rotate the box to fit the new root angle, and you can save this new angled box in the ROI manager as well.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160727/20160727003344_0224.jpgFigure 3. Analysis of heat-shock degradation assay using Fiji software. A. Image file stacks representing each individual plant from a single experiment. B. Each stack contains 6 images representing each of the time points. C. Dialog box showing Brightness/Contrast settings in Fiji. D. ROI box drawn to the width and length of the lateral root image, ROI box rotated to fit over fluorescent portion of root image, and rotated ROI box positioned of the root tip area to be measured.Use non-fluorescent siblings (or other non-fluorescent line) to calculate background levels. Copy pixel intensities from the Measurements box and paste into a spreadsheet file. Label each line, treatment, and time point. This is the raw data.  For each line, compute the average of the background fluorescence from all non-fluorescent plants [there will likely be 2-3 (see Note 3)] at each time point. In a new column, subtract this background fluorescence value from the time point matched fluorescence value of each experimental plant (i.e.",
    ", the averaged background fluorescence for time point T0 will be subtracted from all T0 values for fluorescent plants). Individual plants with T0 values lower than 350 AU were found to be within the range of noise and were removed from the dataset. Plotting the averaged background-subtracted data for each line and replicate (Figure 4A, left panel) illustrates the variability in basal fluorescence observed between lines and replicates.Next, normalize the fluorescence of each time point within each stack/plant by dividing by the initial fluorescence value (i.e., fold-initial normalization). Plotting the averaged normalized data for each line and replicate enables better comparison of lines and replicates (Figure 4A, right). A small number of lines behaved significantly differently from others with the same genotype (e.g., fluorescence was much higher and did not respond to auxin treatment), likely due to position effect or faulty integration of the T-DNA during transformation. These lines were removed from the analysis.Finally, plot the fold-initial fluorescence values averaged for all individuals from all lines and replicates. Example graphs (Figure 4B) show differences in auxin-induced degradation dynamics between VENUS-IAA1 and VENUS-IAA28.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160727/20160727011536_0324.jpgFigure 4. Representative quantification of VENUS-Aux/IAA degradation following auxin or mock treatment. A. Background-subtracted fluorescence measurements for three independent VENUS-IAA1 lines. The data is not normalized in the left panel, and is fold-initial normalized in the right panel. Each data point represents mean fluorescence from 5-6 plants carried out over replicate experiments with error bars representing standard error of the mean. B. Fold-initial normalized data for IAA1-VENUS and IAA28- VENUS, including multiple plants from at least two replicates from 2-3 independent lines. Error bars represent standard error of the mean."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}