{
  "id": 7601,
  "origin_website": "Bio",
  "title": "Protocol to Induce Follicular T Helper Cells, Germinal Centers, and Skin Lesions in Mouse Models for Skin Blistering Diseases",
  "procedures": [
    "Induction of germinal centers and Tfh cells in micePreparation of the injection solution and injections into mice 0.02 mM (20 µM) of the protein should be injected. It is important to quantify the protein by its molar concentration because only a small fraction of the entire protein is immunogenic. The molar concentration versus mass concentration can be calculated by equation 1.Equation 1:[M]=Ci/MWWhere M is the molar concentration (μM), Ci is the mass concentration (μg/mL), and MW is molecular weight (kDa).Here, in this case, the molecular weight of mCOL7c-GST is 49.5 kDa. Thus, the mass concentration would be 0.02 mM × 49.5 kDa = 0.990 µg/µL; simplified = 1 µg/µL. Because this solution will be diluted at 1:2, a sterile stock solution of 2 µg/mL mCOL7c-GST in 1× PBS should be prepared shortly before usage and kept one ice.Pipette the adjuvant TiterMax into a sterile Eppendorf tube. Add an equal volume of the protein solution to get a final concentration of 0.01 mM (in case of mCOL7c-GST 1 µg/µL), in the proportion of 1:2 (for example, 25% 2 µg/µL mCOL7c-GST, 25% PBS 1× and 50% Titermax for the autoimmune group or 50% PBS 1× and 50% TiterMax for the control group).Vortex vigorously for 30–40 min to prepare a protein-TiterMax or PBS 1×-TiterMax emulsion. Keep the emulsions sterile at 4°C.Weigh the animals by putting them into a 600 mL plastic beaker that stands on a digital letter scale. Inject 100 µL anesthetic solution per 20 g body weight intraperitoneally (i.p.). Anesthesia should last 20–30 min. To prevent dryness, cover the eyes of anesthetized animals with Bepanthen.Hold the footpad for injection of the prepared emulsions.",
    "Inject 60 μL into the left and 60 µL right hind footpad subcutaneously slowly and carefully by using the entire footpad for injection (in case of mCOL7c-GST 120 µL (120 µg) per mouse).Sacrifice the mice 2–4 weeks after injection. Carefully open the skin to harvest activated popliteal and inguinal lymph nodes and shock freeze them immediately for immunohistological staining (by (i) quickly placing the sample into liquid nitrogen before (ii) storing it in a -80°C refrigerator) or place lymph nodes in cold PBS 1× on ice for isolation of cells for flow cytometric analysis.Note: GC reaction will induce the production of high affinity autoantibodies directed against mCOL7c-GST. These autoantibodies will bind to type VII collagen in the skin and induce skin wounds, which appear 4–5 weeks after injection. Mice in the control group, which receive only TiterMax, will develop GC reactions in activated lymph nodes but no skin pathology. Determine the place of a skin wound formation by scratchingTo induce skin wounds, scratch mouse ear skin slightly 1 week before wounds would usually appear by the binding of autoantibodies.Note: In our experiment, after injection of mCOL7c-GST, bound mCOL7c-specific autoantibodies and skin wounds can be observed at 4–5 weeks post-injection. Therefore, ear skin was scratched 3 weeks post-injection. Before scratching, mice must be anesthetized as described above (step A4). Attach the round grinding cone to the electrical nail drill machine (Figure 2A and B), switch it on, and adjust it to a rotational at speed of 2,000 rpm. Take the inner side of the ear on top of one of your fingers. Slightly and briefly touch the epidermis with the tip of the round grinding cone. This approach removes the epidermis, whereas the dermis remains intact (Figures 2C–2E).Note: A non-bleeding wound with a standardized size should appear (Figure 2C).",
    "This skin wound will not heal in mice injected with the autoantigen (here: mCOL7c-GST) in contrast to the control group that received vehicle only, in which the healing process becomes visible 14 days after scratching (Figure 3). imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4414/bioprotoc-12-10-4414-g002.jpgFigure 2. Removal of the epidermal layer with an electric nail file. A. Image shows the electric nail drill machine and B. the grinding attachment at a higher magnification. C. The ear skin was briefly and gently touched with the grinding attachment, which removed the epidermal layer at one spot of approximately 1-mm diameter per ear. The dotted white line marks the ear. The black arrow points to the induced wound spot. D-E. Hematoxylin and eosin staining of skin sections show that only the epidermal layer was removed (white arrows in E). Bar 50 µm. Figure adapted from Niebuhr et al. (2020).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4414/bioprotoc-12-10-4414-g003.jpgFigure 3. Chronic wounds appear after removal of the epidermal layer. Representative pictures of ear wounds 7 days and 14 days after scratching are shown. Scratched-induced wounds become chronic in the autoimmune group. In contrast, the wound sizes decline in the control group. Figure adapted from Niebuhr et al. (2020).Sacrifice the mice one week after scratching (4 weeks post-injection of the autoantigen) and remove ears. Carefully isolate wounded skin areas from healthy unscratched skin, place wounded and unwounded skin in separate cryotubes and immediately snap freeze tissues using liquid nitrogen or store it short-term in 1× PBS at 4°C. For long-term storage, transfer cryotubes at -80°C. Extract skin pieces under clean and sterilized conditions.Note: This time point of 1 week was chosen to investigate migrated T eff. To characterize other infiltrating cells, adjust time points accordingly. For example, neutrophils will be found within hours. Visualization of Tfh cells and GCTfh cells localize within the light zone of GC.",
    "To stain GC, T, and B cells for traditional light microscopy, prepare serial sections of the collected lymph nodes on two glass slides. Take the first slide and visualize GC by staining proliferating cells with mouse anti-Ki67 antibody and B cells with anti-mouse B220 antibody. Take the second slide and stain T cells and B cells with a primary biotinylated anti-mouse TCRβ antibody and a primary biotinylated anti-mouse B220 antibody, respectively (Figure 4A).Staining of proliferating cellsEmbed collected frozen lymph nodes in tissue freezing medium and cut until a plain cut-level is present. Cut 12 µm-sections of lymph nodes using a cryomicrotom. Distribute 6–10 adjacent sections onto two glass slides. Mount the 1st, 3rd and 5th, ... section on slide 1 and the 2nd, 4th and 6th, ... sections on slide 2 (Figure 4A). Dry slides at RT for at least 1 h.To fix tissues, incubate glass slide 1 in chloroform for 10 min and acetone for 10 min. Afterwards rinse tissues in TBS-Tween for 15 min and cover lymph node section with 4% PFA and incubate them at 4°C for 45 min.Rinse glass slide in TBS-Tween for 15 min.Draw a circle around tissue sections with the Dako Pen to confine the liquids during staining and incubate sections with the first primary antibody anti-mouse Ki-67 at room temperature overnight (1:100 dilution in antibody solution).Wash unbound antibodies away by incubation with TBS-Tween for 15 min and add the first secondary biotinylated anti-rat IgG antibody (1:500 dilution in PBS 1× with 5% normal mouse serum) for 30 min.Rinse with TBS-Tween for 30 min and cover tissue sections with ExtrAvidin Alkaline Phosphatase (1:100 in TBS-Tween) for 30 min.Rinse with TBS-Tween for 15 min and apply Fast Red staining solution for 25 min.",
    "Staining of B cellsWash glass slide with TBS-Tween for 10 min and add the second primary anti-mouse B220 antibody (1:200 dilution in antibody solution) for 1 h at RT.Rinse slide in TBS-Tween for 15 min to remove unbound antibody and add the second secondary antibody, the biotinylated anti-rat IgG antibody for 30 min.Wash slide in TBS-Tween for 30 min and add 200 µL ExtrAvidin Alkaline Phosphatase 1:100 for 30 min.Wash with TBS-Tween for 15 min and add Fast Blue staining solution for 10 min to visualize B cells.After rinsing in TBS-Tween for 15 min, mount sections using 150 µL of Aquatex and coverslips.Staining for T and B cellsTake glass slide 2 with the mounted and dried lymph node sections (numbers 2, 4 and 6).To fix tissues, incubate glass slide in methanol:acetone (1:2) for 10 min at 20°C. Afterwards rinse tissues in TBS-Tween for 15 min.Incubate sections with the first primary biotinylated anti-mouse TCRβ antibody 1:50 for 1h and rinse glass slides in TBS-Tween for 30 min.Add 200 µL ExtrAvidin Peroxidase (1:100 in TBS-Tween) for 30 min and wash slide in TBS-Tween for 15 min.Incubate sections with Liquid DAB+ Substrate for 5 min to visualize the T cells.Wash slide with TBS-Tween for 15 min.Add the second primary anti-mouse B220 antibody (1:200 in antibody solution) for 1 h and proceed as described above (2b–e).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4414/bioprotoc-12-10-4414-g004.jpgFigure 4. Induction of germinal centers and Tfh cells after injection of antigen in TiterMax. A. Serial cryosections of draining popliteal lymph nodes were distributed on two slides, which were either stained for proliferating cells and B cells (left slide) or T and B cells (right slide). B–E. One example of two adjacent sections is shown. B. GC were visualized by staining the proliferating cells with anti-Ki67 (red) and B cells with anti-B220 (blue). C.",
    "Tfh cells were identified as T cells that locate within the light zone of the GC by staining with anti-TCRβ for T cells (brown) and anti-B220 (blue). Four GC were clearly visible (marked with numbers). D. The magnification shows the dark zone (DZ) and light zone (LZ) of the first GC depicted in B. E. Tfh cells can be identified as within the LZ of the GC (brown-colored cells within the area marked with a white line)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}