{
  "id": 17868,
  "origin_website": "Jove",
  "title": "Murine Myocardial Infarction Model using Permanent Ligation of Left Anterior Descending Coronary Artery",
  "procedures": [
    "Animal experiments described in this protocol were reviewed and approved by Animal Ethics Committee of Canton of Vaud.\nNOTE: For these experiments, we used male C57Bl/6J mice weighing between 25 g and 30 g and an age of 8-12 weeks. Mice were fed chow pellets and water ad libitum and bred under conventional conditions. Surgical equipment was previously sterilized. The experimenter should wear sterile surgical gloves and a surgical mask to limit contamination and post-operative infections.\n1. Anesthesia and tracheal cannulation.\nWeigh the mouse to determine the dosage of anesthetic drugs, post-operative analgesic medication and tidal volume of the ventilator. Pre-warm the heating pad at 37 °C. The surgical setup is depicted in Figure 1.\nInject mouse intraperitoneally with a mix of ketamine and xylazine at a dose of 80 mg/kg and 10 mg/kg respectively.\nQuickly shave the mouse fur on the throat and the left side of the rib cage using an electric razor.\nCheck depth of anesthesia by pinching tail and/or hind feet and settle the animal in a supine position on the heating pad. Place a small gauze compress under the head of the animal to avoid overheating of the eyes. Apply ocular gel to avoid eye dryness.\nSecure the four limbs with adhesive tape on the surface of the heating pad. Pass a loop of 5-0 silk suture under the upper incisors and stick the extremity of the loop with adhesive tape onto the heating pad. This will keep the mouth of the animal open and facilitate cannulation.",
    "Apply hair removal cream on the pre-shaved areas and gently massage with a cotton swab for 1 min. Wipe the excess of fur and cream with a gauze. Use drops of 0.9% saline solution and gauze to clean the incision areas. Apply pieces of sterile gauze to the shaved throat and thorax and soak them in iodopovidone.\n\tNOTE: We recommend application of a local anesthetic drug (lidocaine or bupivacain) to incisions sites.\nSet the ventilator at a tidal volume of 7 mL/kg and ventilation rate of 140 strokes/min.\n\tNOTE: From now on work under a microsurgery stereomicroscope.\nHold the skin on the center of the throat and perform an incision of 0.5 cm following a caudal/cephalic line using small scissors. Separate the lobes of salivary gland, then gently separate fascia of sternohyoid muscle with curved dissecting forceps until larynx and trachea are visible. Secure edges of the opening with retractors attached to elastic bands.\n\tNOTE: Do this step without incision of the muscles. A trained operator will be able to intubate the animal via oral cavity without visualization of the trachea making this step optional.\nHold gently the tongue sideways. With forceps, insert the blunted inner needle of a 16 G cannula into the trachea. Visualize correct insertion into the trachea through the throat incision.\nConnect the cannula to the ventilator and ensure correct ventilation by placing the exhaust tubing into water. The presence of bubbles indicates correct intubation.\n\tNOTE: In order to keep tissues wet during operation place sterile gauze soaked with 0.9% saline solution and iodopovidone on the throat incision. Control moisture during the procedure.\n2. Ligation of LAD coronary artery",
    "Release left anterior paw from duct tape and carefully move the mouse to right side decubitus position. Secure the left anterior limb once animal is in the correct position.\nIdentify the line between left pectoralis minor and major muscles and make an oblique skin incision on 1 cm with scissors following the line. With dissecting blunt micro scissors, separate fascia of pectoralis muscles without incision. Maintain pectoralis muscles separated with retractors attached to elastic bands.\nSet the ventilator with a positive end-expiratory pressure (PEEP) of 3 cm H2O.\nOpen the chest cavity by using blunt forceps at the 3rd intercostal space between 3rd and 4th ribs. Avoid touching internal thoracic artery as there is danger of bleeding. Do not touch heart or lung. Apply two retractors into the ribcage, one on each rib (Figure 2A).\nWith a curved fine forceps, carefully remove the pericardium and pull it apart without harming the heart and lungs.\nLocate left anterior descending (LAD) coronary artery. LAD artery appears as a superficial bright red line running from the edge of the left auricle toward the apex.\nUse a needle holder to pass a 7-0 silk suture under the LAD 2 to 3 mm below left atria. Pull the silk slowly to avoid a tearing of heart tissue. Tie the ligature with three knots. The lower left part of the left ventricle will instantly turn pale upon ligation (Figure 2B-E).\n\tNOTE: It is important to not go too deep into the ventricular cavity or to stay too superficial. For sham-operated animals, pull the suture silk under the LAD and remove it slowly avoiding tissue tearing.\nRelease the rib retractors, hold the 3rd rib with forceps and make two passes with a 6-0 silk suture under the 3rd and 4th ribs.",
    "CAUTION: Do not the perforate heart or lung. Do not tighten knots yet.\nPut three drops of 37 °C 0.9% saline solution onto the opening and shut the expiration exhaust tube for 2 or 3 respiratory cycles to properly inflate lungs. Tighten the suture and secure with two throws.\nRelease retractors holding muscles and help them retrieve their correct place.\nClose thoracic skin with two stitches of 5-0 suture silk and secure with two throws. Close throat skin with one stitch of 5-0 suture silk and secure with two throws.\n3. Post-operative procedures and follow-up.\nRemove adhesive tape bands from limbs. Put a compress on the heating pad on the right side of the animal.\n\tNOTE: The overall procedure from anesthesia to this point should not take longer than 40-45 min. Optionally inject IP 0.2 mL of atipamezole at a concentration of 0.1 mg/mL to speed up the waking up process.\nIntraperitoneally inject 0.3 mL of 5% glucose solution pre-warmed at 37 °C.\nCarefully turn the animal on ventral decubitus onto the compress pad.\nStop ventilator; if the mouse spontaneously breathes, cautiously remove cannula.\nInject subcutaneous (SC) 0.1 mg/kg buprenorphine and put mice in a pre-warmed cage heated at 30 °C and ventilated with a 100% O2 for a minimum of 1 h. Monitor mice for any life-threatening condition such as excessive dyspnea or hemorrhage.\nDuring the two first days following surgery, monitor mouse twice daily. Inject SC 0.1 mg/kg buprenorphine twice daily. Intraperitoneally inject 0.3 mL 0 of 5% glucose solution twice daily. Provide mice with soft diet and water ad libitum. Warm up the animal if necessary.\n\tNOTE: In addition to opioids, animals should be provided with nonsteroidal anti-inflammatory drugs mixed in diet or diluted in drinking water.",
    "From day three, inject SC 0.1 mg/kg buprenorphine twice daily if the animal exhibits any unusual signs concerning general appearance, respiration or behavior. Intraperitoneally inject 0.3 mL of 5% glucose solution twice daily if the animal is still losing weight. Warm the animal if necessary.\n\tNOTE: Strictly apply predefined interruption criteria when necessary to avoid excessive suffering. Usually mice lose weight up to day 3 and 4 and then gain weight. After seven days, mice usually retrieve pre-operation weight."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}