{
  "id": 4913,
  "origin_website": "Bio",
  "title": "Transformation of the Cyanobacterium <em>Leptolyngbya boryana</em> by Electroporation",
  "procedures": [
    "Plasmid for targeted mutagenesis is constructed (Figure 1). Plasmids carry a chimeric DNA fragment consisting of the upstream sequence of the target gene, drug resistance cartridge (Table 1), and downstream sequence of the target gene (Figure 1B). The upstream and downstream sequences should be more than 1 kb each, for stable homologous recombination. If the upstream and downstream fragments are obtained by PCR, their nucleotide sequences in the plasmid should be confirmed by Sanger sequencing to avoid introduction of unintended mutation(s) outside of the target gene via homologous recombination. The vectors are normally pUC18/19 derivatives. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20151220/20151220231151_2166.jpgFigure 1. An example of plasmid construction, homologous recombination and PCR analysis of mutants in L. boryana. A. Gene arrangement of the target gene (the orf84 gene, LBWT_23230, shown in red) in L. boryana (Tsujimoto et al., 2014). The 1.7-kb upstream and 1.5-kb downstream fragments (thick horizontal bars) of the orf84 gene are amplified by PCR to construct plasmid. B. Construction of the plasmid pNK72 to isolate an orf84-disrupted mutant (∆orf84). The two amplified fragments were cloned into a vector. In this case, pUC192 was used as the vector, which was constructed by the insertion of the neo gene (kanamycin resistance gene from pMC19, Fujita et al., 1992) into the BamHI site of pUC19 (dashed line with its multi-cloning sites shown by yellow boxes). The 1.5-kb downstream fragment (digested with SalI-XhoI) was cloned into the SalI sites of pUC192, and subsequently the 1.7-kb upstream fragment (digested with BamHI) was cloned into the BamHI site, yielding the plasmid pNK72. C. Gene arrangement of a single recombinant, in which the plasmid pNK72 is incorporated into the chromosome by a single homologous recombination event. Both wild-type and knock-out copies are present in the chromosome. In this case the single recombination event occurs between the 1.",
    "5-kb downstream fragment of the plasmid and the corresponding chromosomal part. Small horizontal arrows indicate primers for PCR shown in panel E. D. Gene arrangement of the ∆orf84 mutant, in which the orf84 gene was replaced with the neo gene by a double recombination event. The plasmid was previously digested with KpnI and SalI for electroporation to avoid to generate single recombinants. Small horizontal arrows indicate primers for PCR shown in panel F. E. PCR analysis of the single recombinants of orf84. Two DNA fragments were detected. The longer (a filled triangle, 1,799 bp) and shorter (an open triangle, 437 bp) fragments are corresponding to those of knock-out and wild-type copies, respectively, in the three transformants (lanes 3-5). The longer fragment was detected in PCR with the plasmid pNK72 as the template (lane 2). The shorter fragment (the wild-type copy) was detected in the wild-type cells (lane 1). F. PCR analysis of ∆orf84. Only single DNA fragment corresponding to the knock-out copy of orf84 (a filled triangle, 1,799 bp) was detected in the two transformants (lanes 3 and 4). The shorter and longer fragments (lanes 1 and 2) were the same as E. (unpublished results, Kotani and Fujita).The plasmid prepared by a plasmid preparation kit was linearized by restriction enzyme(s) to minimize the probability that the plasmid would integrate into the genome via a single recombination event resulting in a merodiploid that harbors both knock-out and wild-type copies in the genome (Figure 1C). The digestion site(s) can be selected from anywhere in the vector part. It should be careful not to digest the parts of homologous recombination and the drug resistance marker. The digested plasmid was precipitated by ethanol and dissolved in sterilized water to be >2 µg µl–1.L.",
    "boryana is cultivated on an agar plate of BG-11 containing 30 mM glucose under low light conditions (<10 µmol m-2 s-1) at 30°C for 2-7 days (Note 1).All procedures below should be performed under aseptic conditions. Cells on the agar plate are suspended in sterilized water (ca. 2 ml per one agar plate) and the suspension is transferred into a bottle top filter (Figure 2A-C. Notes 2 and 3). In this stage, Hybond N+ filters should be placed onto new BG-11 agar plates for cell recovery after electroporation (step 11).The cells are collected on the surface of the bottle top filter by aspiration (Figure 2D).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20151220/20151220231230_4819.jpgFigure 2. Preparation of L. boryana cells for pulse application Approximately 50 ml of sterilized water, chilled on ice, is added to the filter to suspend the cells. The cells are again collected on the filter by aspiration. This washing procedure is repeated three times (Figure 3C. Notes 4-5). Centrifugation (1,200 x g, 10 min) is another option for washing cells with water. In this case, note that L. boryana cells form very loose pellets even by high-speed centrifugation (for example, 44,000 x g, 30 min) due to long trichomes. The cells on the filter are suspended in a small aliquot (500 µl) of sterilized water (Figure 2D) and the suspension is transferred into a microcentrifuge tube (1.5 ml) to store on ice until pulse application (Note 3).A small aliquot (50 µl) of the suspension used for pulse application is dispensed into another microcentrifuge tube (Note 3) and the concentrated plasmid solution (typically 10 µl of 2 µg µl-1) is added to the tube and mixed well.The mixture is transferred into a cuvette with a gap width of 0.1 cm and chilled on ice (Figure 2E-F, Note 3).A single exponential decay pulse (setting: voltage, 1.",
    "41 kV; capacitance, 50 µF; and resistance, 250 ohms) is applied. The time constant will be approximately 10 ms. The time constant and the actual voltage should be recorded on your note (Notes 5-6).An aliquot (350 µl) of BG-11 liquid medium is added to the cuvette and the cell suspension is recovered with the blue tip of a P-1000 type micropipette dispenser (Figure 3A) to spread onto a Hybond N+ filter overlaid on a BG-11 agar plate without antibiotics (Figure 3B-C).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20151220/20151220231250_9335.jpgFigure 3. Recovery of pulse-applied cells from a cuvette and inoculation on a non-selective plate The agar plate is incubated at 30 °C under low light conditions (<10 µmol m-2 s-1) for 2 days. During this period the antibiotic resistance gene is expressed to confer the cell’s resistance to the specific antibiotic.The Hybond N+ filer is transferred onto a new BG-11 agar plate containing appropriate antibiotics (final concentrations are shown in Table 1). The agar plate is incubated at 30 °C under high light conditions (ca. 100 µmol m-2 s-1). Colonies showing resistance against the antibiotics appear after approximately 10 to 14 days (Figure 4). You can pick them up with toothpicks or tips (for a P-200-type micropipette) that should be previously autoclaved (121 °C, 20 min). Some colonies are single recombinants and some are double recombinants. PCR analysis should be carried out to identify double recombinants (Figure 1E-F; Notes 7 -8).Table 1. List of antibiotics that can be used for transformation of L. boryana imgsrc:https://en-cdn.bio-protocol.org/attached/image/20151221/20151221060205_2207.jpg 1This antibiotic has not yet been used for targeted mutagenesis. However, we confirmed that transformants harboring pJRD215 (with the streptomycin resistance gene) showed resistance to streptomycin (unpublished results)."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}