{
  "id": 13215,
  "origin_website": "Jove",
  "title": "Isolation of Endocardial and Coronary Endothelial Cells from the Ventricular Free Wall of the Rat Heart",
  "procedures": [
    "All animal procedures were approved by the Administrative Panel on Laboratory Animal Care (APLAC31608) at Stanford University.\n1. Preparation of buffers\nPrepare the digestion buffer using the reagents listed in Table 1.\n\t\nPrepare the DNase I stock solution: Dissolve DNase I in RNase-free water for a stock solution of 2,000 units/mL (1 mg/mL). Aliquot and store the stock solution at -20 ˚C.\nPrepare the liberase solution: Dissolve liberase with RNase-free water for a stock solution of 5 mg/mL. Rotate it on a roller bank at 4 ˚C for 30 min. Aliquot and store the stock solution at -20 ˚C.\nPrepare the sorting buffer by diluting 0.5 M ethylenediaminetetraacetic acid (EDTA) and 10% bovine serum albumin (BSA) stock solution with 1x phosphate buffered saline (PBS) for a final concentration of 2 mM of EDTA and 0.5% of BSA.\n2. Heart collection\nNOTE: Six Sprague Dawley rats weighing 50–100 g were used in this protocol. No gender difference was observed.\nEuthanize the rat with CO2 and place it in a supine position on a dissecting platform. Pin the extremities down and sterilize both the abdomen and chest with 70% ethanol.\nOpen the abdomen with scissors and insert a 21 G needle into the portion of the posterior vena cava located behind the intestines. Pull the syringe plunger back, withdrawing the blood from the vein until the liver appears lighter in color and no more blood can be withdrawn, indicating sufficient blood removal.\nUsing scissors, open the chest carefully to avoid damaging the lung and the heart. Lift the aorta arch/atrium with the forceps and cut the aorta, pulmonary artery, pulmonary veins, and vena cava to liberate and remove the heart.\nWash the heart with 50 mL of cold 1x Hanks' balanced salt solution (HBSS) buffer 3x to remove excessive blood.",
    "Under a microdissection microscope, remove the right ventricular free wall into a 5 mL tube containing Dulbecco's modified Eagle medium (DMEM) (Figure 1A,B).\n\t\nLay the heart on its flatter, posterior face to identify the left and right side.\nLocate the pulmonary artery, the most anterior of the veins and arteries branching from the top of the heart and cut through the pulmonary artery down to the right ventricular chamber. On the anterior face of the heart, cut along the septum until reaching the apex. Continue cutting from the apex up the posterior side of the heart along the septum until the pulmonary artery and right ventricular chamber junction point (Figure 1A).\nStarting from the pulmonary artery and right ventricular junction point, cut both the anterior and posterior side of the heart perpendicularly to the previous dissection and away from the septum, until the right ventricular free wall is liberated from the rest of the heart (Figure 1B).\nUnder the microdissection microscope, remove the left ventricular free wall into a 5 mL tube containing DMEM (Figure 1C,D).\n\t\nLocate the aorta, branching from the top of the heart behind the pulmonary artery, and repeat the method described in step 2.5 to cut off the left ventricular free wall.\n3. EEC digestion\nPlace both right and left ventricular free wall tissues in a 60 cm culture dish with the inner surface lying flat, facing down (Figure 2).\n\tNOTE: The inner surface is the interior face of the slightly concave shaped ventricle as shown in Figure 2A,C.\nAdd 0.5–1 mL of digestion buffer to the dish, placing the tip of the pipette directly under the tissue. Continue until only the inner surface is immersed.\nIncubate the dish in a 5% CO2, 37 ˚C incubator for 5 min.",
    "Add EC medium to the culture dish to stop the digestion.\n\tNOTE: Keep the amount of digestion buffer to EC medium as a 1:5 ratio.\nUse a 1 mL pipette to flush the inner surface of the ventricles with EC medium and transfer the runoff into a 50 mL collection tube through a 40 mm strainer (Figure 2E). Keep the collections on ice for downstream purification.\n4. CEC digestion\nCut along the outer surface of the left ventricle without contamination from the inner layer (Figure 2B,D) and place each in a separate 5 mL tube containing 1 mL of the digestion buffer.\n\tNOTE: The left ventricle can be identified as the thicker ventricle, and the outer surface can be determined as the exterior face of the slightly concave ventricle.\nUsing dissection scissors, mince the ventricular wall into small, 1 mm3 pieces.\nIncubate the tube in a 37 ˚C water bath for about 15–20 min. Vortex every 2–3 min.\nPipette 4 mL of EC medium into the 5 mL tube to terminate the digestion.\nTransfer the solution with a 5 mL serological pipette into a 50 mL tube through a 40 mm strainer (Figure 2E). Keep the collections on ice for downstream purification.\n5. Cell collection\nCentrifuge the tubes at 300 x g for 10 min at room temperature (RT) and then aspirate the supernatant.\nIf the pellet appears red, resuspend the pellet in 1–2 mL of 1x red blood cell (RBC) lysing buffer (Figure 2F).\n\tNOTE: If there are no RBCs, proceed to step 6.\nIncubate the tubes in a 37 ˚C water bath for 5 min.\nPipette 10 mL of PBS into the 50 mL tubes to stop the lysis.\nCentrifuge the tubes at 300 x g for 10 min at RT, and then aspirate the supernatant.",
    "6. EC sorting\nAdd 90 μL of sorting buffer and 10 μL of anti-CD31 PE antibody into the 50 mL tubes.\nVortex the tubes and then incubate them for 10 min in a 4 ˚C fridge.\nAdd 10 mL of sorting buffer into the tubes, mix thoroughly, and then centrifuge at 300 x g for 10 min at RT.\nAspirate the supernatant and resuspend the pellet in 80 µL of sorting buffer and 20 µL of anti-PE microbeads.\nVortex the tubes and incubate at 4 ˚C for 15 min.\nWash the cells by adding 10 mL of sorting buffer into the tubes, mix thoroughly, and then centrifuge them at 300 x g for 10 min at RT.\nAspirate the supernatant and resuspend the pellet in 500 μL of sorting buffer.\nPlace a column containing superparamagnetic spheres into a magnetic separator and rinse the column with 3 mL of sorting buffer.\nAfter the column are “flow stop”, pipette 500 μL of the cell suspension into the columns and then wash the columns with sorting buffer. Repeat the wash 3x, each with 3 mL of sorting buffer (Figure 2G).\nRemove the columns from the separator and place them on top of a new 15 mL collection tube.\nWith a pipette, add 5 mL of EC medium to the columns, and propel the solution through using a column plunger.\nCentrifuge the collection tubes at 300 x g for 10 min at RT and then aspirate the supernatant.\nExtract the RNA from the cell pellet of the EEC and CEC samples using a kit, following the manufacturer’s instructions. A minimum of 500 ng of RNA can be obtained.\n\tNOTE: After RNA extraction, the sample can be stored at -80 ˚C.",
    "Reverse transcribe 500 ng of RNA to get cDNA using a random primer and a kit, following the manufacturer’s instructions.\nPerform quantitative PCR for the validation of endocardial and endothelial populations (Figure 2H). Primer sequences are listed in Table 2.\n\t\nAdd 5 μL of EEC or CEC cDNA (1 ng/μL) into the wells of a 384 qPCR plate. Add the EEC or CEC cDNA into enough wells so that there are three wells per number of primers.\nMix 6 μL of 2x qPCR SYBR green buffer with 0.5 μL of each 10 μM primer, including both forward and reverse primers, and add them into a single well corresponding to each candidate gene.\nSeal the plate with plastic film and centrifuge for 1 min at 300 x g at RT.\nPlace the plate into a qPCR machine and then start the program at 95 ˚C for 3 min, followed by 95 ˚C for 15 s, and then 55 ˚C for 60 s. Repeat the subsequent two steps for 45 cycles."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}