{
  "id": 14821,
  "origin_website": "Jove",
  "title": "Single-Copy Gene Locus Chromatin Purification in Saccharomyces cerevisiae",
  "procedures": [
    "See the Table of Materials for details related to all the materials and instruments used in this protocol. See Table 1 for a list of the solutions, buffers, and media used.\n1. Recombinant yeast strain construction\nTo construct a recombination-competent yeast strain, transform SbfI-digested plasmid K238 into a yeast strain with integrated LexA-binding sites and RS recombination sites at the locus of interest13,14.\n\tNOTE: The transformed SbfI restriction fragment contains the required expression cassette for constitutive expression of the LexA-TAP fusion protein and R-recombinase together with homologous sequences of yeast chromosome I for genomic integration of the expression cassette by homologous recombination (Figure 1).\nTo construct a control strain, take an isogenic yeast strain lacking integrated RS and LexA-binding sites, and transform it with SbfI-digested K238 plasmid under the same conditions as used for the recombination-competent strain.\nSelect the competent yeast cells based on the LEU2 selection marker on SCD-LEU agar plates14.\n2. Coupling IgG antibodies to epoxy-activated magnetic beads\nNOTE: Couple IgG antibodies to epoxy-activated magnetic beads according to the following published protocol11.\nSuspend 300 mg of epoxy-activated beads in 10 mL of 50% acetone (300 mg corresponds to ~5.1 × 1010 beads) in a 50 mL conical tube. Shake vigorously on a vortex mixer.\nCentrifuge the tube containing the beads at 820 × g and 4 °C for 2 min. Remove the supernatant.\nWash the beads 3x with 20 mL of 0.1 M sodium phosphate buffer (pH 7.4). Remove the supernatant after each washing step by centrifugation as described in step 2.2.\nSuspend the beads in 16 mL of 0.1 M sodium phosphate buffer (pH 7.4), and rotate gently in a hybridization oven for 5 min at room temperature.\nDissolve the rabbit IgGs (100 mg) in 7 mL of dH2O (final concentration: 14 mg/mL).",
    "Centrifuge the IgG suspension at 13,000 × g and 4 °C for 10 min to clarify the suspension.\nTransfer 3.5 mL of the supernatant (corresponding to 50 mg of rabbit IgGs) to a new 50 mL conical tube.\nDilute the IgG solution with 9.85 mL of 0.1 M sodium phosphate buffer (pH 7.4), followed by the dropwise addition of 6.65 mL of 3 M ammonium sulfate in 0.1 M sodium phosphate (pH 7.4) under gentle mixing.\n\tNOTE: Avoid adding ammonium sulfate quickly to the solution as a high local concentration of the salt will cause the precipitation of the rabbit IgGs.\nCentrifuge the IgG solution at 820 × g and 4 °C for 3 min, and add the resulting supernatant to the magnetic bead suspension.\nIncubate the tube overnight or at least for 18 h at 30 °C with gentle rotation in a hybridization oven.\nRemove the supernatant as described in step 2.2.\nWash the beads with 20 mL of 100 mM glycine-HCl (pH 2.5). Remove the solution rapidly as described in step 2.2 to avoid the denaturation of the IgG polypeptides.\nWash the beads once with 20 mL of 10 mM Tris-HCl (pH 8.8). Aspirate the supernatant as described in step 2.2.\nAdd 20 mL of 0.1M triethylamine solution for 5-10 min under gentle rotation to inactivate the residual reactive epoxy groups. Remove the supernatant as described in step 2.2.\nWash the beads 4x with 20 mL of PBS (pH 7.4) for 5 min with gentle rotation. Remove the supernatant as described in step 2.2 after each washing step.\nWash the beads 2x with 20 mL of PBS (pH 7.4) with 0.5% Triton X-100 (w/v) for 5 min and 15 min each under gentle rotation in a hybridization oven. Remove the supernatant as described in step 2.2.",
    "Suspend the beads in a final volume of 16 mL of PBS (pH 7.4) with 0.02% sodium azide (w/v). Store as 1 mL aliquots at 4 °C until use.\n3. Yeast cell culture and harvesting\nInoculate control and recombination competent yeast strains from YPD plates in 5 mL of YPR medium, and incubate overnight at 30 °C and 200 rpm.\nInoculate 2 mL of this culture into 100 mL of YPR medium, and incubate overnight at 30 °C and 200 rpm.\nFor each strain, dispense 1,800 mL of autoclaved YP medium and 200 mL of autoclaved raffinose solution (20% w/v) into each of two 5 L Erlenmeyer flasks (4 L of culture medium in total for each strain, divided into two flasks).\nInoculate the growing yeast cells at OD600 0.2 in their respective medium, and incubate as described in step 3.1 for approximately 6 h or until the cells reach the desired OD600 of 1.0. To ensure normal growth of the cells, free from any contamination, check the OD at 2 h intervals.\nAdd 200 mL of galactose (20% w/v) to induce site-specific recombination.\nAdd 110 µL (50 ng/mL) of YMFA (at the same time as the galactose, step 3.5) to arrest the cells in the G1 phase, and incubate for 2 h.\n\tNOTE: The addition of YMFA to the cells depends on the experimental conditions and biological question to be addressed. Precisely, for this experiment, the cells are arrested in G1 phase to obtain a homogenous cell population with licensed replication origins; in this process, the pre-replicative complex binds to the origins in the G1 phase prior to the initiation of DNA replication in the S-phase.",
    "Transfer the cell suspension into 1 L centrifuge buckets, and centrifuge at 6,000 × g and 4 °C for 10 min. Discard the supernatant, and resuspend the cell pellets in a total volume of 10-15 mL of dH2O.\nSeal a 25 mL syringe with a Luer plug, and place it inside a 50 mL conical tube filled with water. Transfer the cell suspension to the syringe assembly, and centrifuge at 2,397 × g for 10 min at room temperature. Discard the supernatant.\nRemove the Luer plug from the syringe, and extrude the cells into liquid nitrogen to form cell \"spaghetti\".\n\tNOTE: Using 4 L of culture medium provides a wet weight of final cell pellets of 7-10 g.\nTransfer the frozen cell spaghetti to a 50 mL conical tube, and store at −80 °C until further use.\n4. Chromatin locus purification\nNOTE: See Figure 2 for a schematic overview of the steps involved in this locus-specific chromatin purification protocol.\nCool down a commercial coffee grinder by grinding 30-50 g of dry ice by vigorously shaking the coffee grinder 2x for 30 s each time. Once cooled, discard the dry ice powder.\nMix 3 g of frozen yeast cell spaghetti with ~30-50 g of dry ice in the precooled coffee grinder.\nSeal the junction between the cap and the grinder with parafilm to prevent the loss of yeast cell powder during milling.\nMill the yeast cell-dry ice mix 10x for 30 s each time, with 30 s intervals between each round (total time estimate: ~10 min). To avoid the dry ice and cell powder sticking to the walls of the coffee grinder, tap the sides of the coffee grinder continuously during milling.\nTransfer the resulting yeast cell-dry ice powder to a plastic beaker using a clean and dry spatula.",
    "Keep the beakers at room temperature to evaporate the dry ice.\nOnce the dry ice evaporates, add 2.25 mL of MB buffer with 1x protease and phosphatase inhibitors (750 µL/g of yeast cells) to the yeast cell powder.\nPipette the cell-buffer mixture vigorously to ensure the complete suspension of the cells with the buffer, and transfer to a 15 mL conical tube.\nTake samples for DNA (0.1%) and protein (0.05%) analysis from the resulting cell suspension (crude cell extracts [CCE]). Store at −20 °C until further processing (described in section 7).\nTransfer the cell suspension into low-binding 2 mL reaction tubes, and centrifuge at 21,130 × g for 30 min at 4 °C to separate the cell debris from the crude cell lysate.\nPool the supernatants from all the tubes into one 15 mL conical tube.\nTake samples from the supernatant (input [IN]) for DNA (0.1%) and protein analysis (0.05%). Store at −20 °C until further processing (described in section 7).\nEquilibrate 500 µL of IgG-coupled magnetic bead slurry (for each yeast strain) by washing 2x with 500 µL of cold MB buffer with 1x protease and phosphatase inhibitors for 5 min each at 4 °C on rotation at 20 rpm. Discard the supernatant from the beads using a magnetic rack after each washing step.\nIncubate the IgG-coupled magnetic beads in 500 µL of cold MB buffer with 1x protease and phosphatase inhibitors for 1 h at 4 °C on rotation at 20 rpm. Discard the supernatant from the beads using a magnetic rack.\nMix the equilibrated magnetic bead slurry with the cell lysate, and incubate with rotation at 20 rpm for 2 h at 4 °C.\nTransfer the complete magnetic bead-cell lysate suspension to low-binding reaction tubes.",
    "Separate the magnetic beads, now carrying the chromatin rings of interest, from the cell lysate using a magnetic rack.\nTransfer the remaining flow-through (FT) from each tube to a fresh 15 mL conical tube, and take samples for DNA (0.1%) and protein (0.05%) analysis. Store at −20 °C until further processing (described in section 7).\nSuspend the magnetic beads from each tube in 300 µL of cold MB buffer, and pool the beads into one reaction tube. Wash 5x for 10 min each with 750 µL of cold MB buffer with 1x protease and phosphatase inhibitors at 4 °C on rotation at 20 rpm. Perform the final wash with 750 µL of cold MB buffer without protease and phosphatase inhibitors.\nSuspend the beads in 40 µL of cold MB buffer without protease and phosphatase inhibitors.\n\t​NOTE: The final volume of eluate can be adjusted according to its anticipated downstream application. The TEV elution usually works efficiently within the range of 100-300 µL.\n5. TEV protease-mediated elution\nTo release LexA-CBP chromatin ring complexes from the beads, incubate the beads with 2 µL of 6x His-tagged recombinant TEV protease overnight at 4 °C and 450 rpm in a thermomixer.\nSeparate the beads from the final eluate using a magnetic rack. Transfer the eluate, containing cleaved chromatin rings, to a new 1.5 mL reaction tube.\nKeep the tubes on a magnetic rack again to separate any residual beads from the final eluate.\nResuspend the beads (TB) in 750 µL of cold AC buffer, and take samples for DNA (0.1%) and protein (0.05%) analysis. Store at −20 °C until further processing (described in section 7).\nFrom the final eluate (TE), take samples for DNA (0.5%) and protein (0.25%) analysis. Store at −20 °C until further processing (described in section 7).",
    "​NOTE: Due to the low volume of the final eluate, the percentage of the samples collected for DNA and protein analysis is increased to obtain a better representation of their protein and DNA content during analysis.\n6. Denaturation elution\nWash the beads 2x in 750 µL of cold AC buffer for 20 min each time at 4 °C on rotation at 20 rpm.\nTo extract the remaining bound LexA-chromatin complexes, carry out denaturation elution by adding 500 µL of 0.5M NH4OH to the beads, and incubate for 30 min at room temperature.\nSeparate the beads from the suspension using a magnetic rack, and transfer the eluate to a low-binding reaction tube.\nIncubate the beads again as in step 6.2 to recover the maximum chromatin loci in the eluate.\nSeparate the beads from the suspension using a magnetic rack, and pool the resulting eluate into the same tube containing the eluate from step 6.3.\nResuspend the beads (DB) in 750 µL of dH2O, and take samples for DNA (0.1%) and protein (0.05%) analysis.\nFrom the final eluate (DE), take samples for DNA (0.5%) and protein (0.25%) analysis.\n7. DNA and protein analysis\nDNA analysis\n\t\nSample preparation\n\t\t\nTo the DNA samples, add 100 µL of IRN buffer, and increase the volume with dH2O to a final volume of 200 µL.\nAdd 1 ng of K071 spike-in plasmid DNA.\nAdd 1 µL of RNAse A (10 mg/mL), and incubate at 37 °C for 1 h.\nAdd 5 µL of proteinase K (10 mg/mL) and 10 µL of SDS (20%), and incubate for 1 h at 56 °C.\nAdd 200 µL of phenol/chloroform/isopropyl alcohol (25:24:1), and vortex thoroughly 2x for 10 s each time.\nCentrifuge the samples at 21,130 × g for 7 min to separate the organic and aqueous phases.",
    "Transfer the supernatant to new 1.5 mL tubes containing 1.5 µL of glycogen (5 mg/mL) and 2.5x 100% ethanol.\nIncubate the tubes at −20 °C for a minimum of 2 h and a maximum of overnight to precipitate the DNA.\nCentrifuge at 21,130 × g, 4 °C for 45 min. Discard the supernatant.\nAdd 150 µL of 70% ethanol without resuspending the DNA pellet, and centrifuge again at 21,130 × g at 4 °C for 10 min.\nDry the DNA pellets at room temperature for 10-15 min, and resuspend in 40 µL of dH2O.\nPerform restriction enzyme digestion to linearize the DNA isolated in step 7.1.1.11 with HpaI restriction endonuclease. For a 50 µL reaction mix, incubate 40 µL of isolated DNA + 2 µL of HpaI enzyme + 5 µL of restriction enzyme buffer + 3 µL of dH2O overnight at 37 °C.\nqPCR analysis\n\t\t\nDilute the restriction-digested DNA at a 1:5 ratio (10 µL of the restriction-digested DNA obtained from step 7.1.1.12 in 40 µL of dH2O).\nUse primer pairs designed for the ARS316 region, PDC1, and spike-in plasmid DNA.\nRun qPCR using the program given in Table 2.\nAnalyze the qPCR results by relative quantification using the ARS316 region and spike-in plasmid DNA as targets and PDC1 (or any other gene or genomic region) as the reference locus.\nAssess the ARS316 locus recovery percentage over PDC1 by normalizing the ARS316 and PDC1 primer relative quantification values by the percentage of the fraction volume taken for each sample. For instance, multiply 0.1% for the flow-through by a factor of 1,000 and 0.5% for the TEV eluate by a factor of 200.\nNormalize the ARS316 and PDC1 recovery percentages with the spike-in plasmid DNA relative quantification values.",
    "Assess the enrichment of the ARS316 locus over the total chromatin by evaluating the obtained relative quantification target/reference values using equation (1).\nimgsrc://cloudfront.jove.com/files/ftp_upload/65460/65460eq01v2.jpg     (1)\nSouthern blot analysis\n\t\t\nTo 20 µL of restriction enzyme-digested DNA sample, add 5 µL of gel loading dye.\nRun the samples in a 1% agarose gel at 110 V for ~3 h.\nTransfer the gel to a tray, and soak it in depurination solution with gentle shaking for 20 min.\nRinse the gel with dH2O, and soak it in denaturation solution for 15 min with shaking. Discard the denaturation solution.\nSoak the gel in denaturation solution for 15 min with gentle shaking.\nRinse the gel with dH2O, and wash it 2x for 15 min each time with the transfer buffer with gentle shaking.\nFill up a tray with 1-1.5 L of transfer buffer, and place it on a stable platform.\nCut a long piece of Whatman paper, and place it on the platform in such a way that the two ends of the paper are soaked in the transfer buffer.\nCut one strip of positive nylon membrane and four strips of Whatman paper equal to the size of the gel.\nPlace two pieces of Whatman paper soaked in the transfer buffer on the platform.\nPlace the gel face down on top of the pieces of Whatman paper.\nOn top of the gel, place the positive nylon membrane, followed by the remaining two pieces of Whatman paper soaked in transfer buffer. Make sure to keep the stack wet with the transfer buffer.\nRemove any trapped air bubbles by rolling them off using a glass rod.\nPlace a stack of paper towels on top of the assembled stack, followed by a 0.5 kg object (e.g., a glass bottle).\nLeave the assembly for overnight transfer at room temperature.",
    "After transfer, UV-crosslink the membrane with a total energy output of 1,200 J/cm2.\nFor the detection of the ARS316 locus, perform southern blot hybridization using radioactive probes synthesized using the referenced DNA labeling system.\n\t\t\tNOTE: Perform all the steps hereafter on ice until mentioned otherwise.\nIn a low-binding reaction tube, dilute 25-40 ng of PCR fragment (probe) in 19 µL of dH2O, and incubate at 95 °C for 5 min. Cool immediately on ice.\nAdd 1 µL each of 500 µM dCTP, 500 µM dGTP, and 500 µM dTTP to the tube.\nAdd 20 µL of the buffer containing random nucleotide hexamers provided with the kit.\nAdd 5 µL of the radioactively labeled nucleotide [α-32P] dATP to the tube. Perform all the steps involving radioactively labeled material under a radioactivity-approved protective environment.\nAdd 1 µL of Klenow fragment, and incubate at 37 °C on a thermomixer for 15 min for single-stranded DNA synthesis.\nAdd 5 µL of stop buffer to stop the reaction.\nCentrifuge a size exclusion column for 2 min at 1,500 × g to remove the storage buffer. Discard the flow through, and place the column in a fresh tube.\nPass the probe mixture through the column to remove unincorporated radioactive nucleotides. Centrifuge for 30 s at 1,500 × g to collect the probe.\nAdd 150 µL of salmon sperm DNA (1:100) to block the non-specific binding of the probe to the membrane.\nIncubate the probe mixture at 95 °C for 5 min to denature the double-stranded DNA.\nSnap-freeze on ice for a few seconds, and centrifuge for a few seconds at 500 × g to bring down the water droplets condensed on the lid.\nBriefly wash the southern blot membrane with the hybridization buffer for 5-10 min with rotation.",
    "Pre-hybridize the membrane with the hybridization buffer for 1 h at 55 °C with rotation. Discard the hybridization buffer.\nAdd 15 mL of fresh hybridization buffer (pre-warmed at 55 °C) to the membrane along with the prepared probe. Incubate the membrane overnight at 55 °C with rotation.\nPerform post-hybridization washes 2x for 15 min each with 0.3x SSC, 0.1% SDS at 55 °C with rotation.\nPerform post-hybridization washes 2x for 15 min each with 0.1x SSC, 0.1% SDS at 55 °C with rotation.\nPerform post-hybridization washes 2x for 15 min each with 0.1x SSC, 1.5% SDS at 55 °C with rotation.\nRemove the membrane from the hybridization tube, and expose the membrane to a phosphorimager screen for up to 3 days to obtain the radioactive imprints on the film.\nAcquire images of the film using a phosphorimaging laser scanning system.\nProtein analysis\n\t\nSample preparation\n\t\t\nAdjust all the protein samples to their final volumes (200 µL, 100 µL, 100 µL, 20 µL, and 20 µL for the crude cell extract, input, flow-through, beads, and eluate samples, respectively) by adding 1 µL of β-mercaptoethanol, PAGE LDS sample buffer (1x), and dH2O.\nDenature the samples at 95 °C for 5 min.\nWestern blot analysis\n\t\tNOTE: Perform SDS-PAGE and western blotting using standard protocols15,16.\n\t\t\nLoad 15 µL of each sample into each well of a 1.5 mm SDS-PAGE gel.\nPerform immunostaining of the blot using PAP (1:2,000) and LexA (1:1,000) antibodies with overnight incubation at 4 °C. Dilute in 5% dry milk/PBST solution.\n\t\t\tNOTE: After PAP analysis, the blot can be stripped using a mild stripping protocol17 prior to immunostaining with the second LexA antibody.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}