{
  "id": 18494,
  "origin_website": "Jove",
  "title": "Development of an Alpha-synuclein Based Rat Model for Parkinson's Disease via Stereotactic Injection of a Recombinant Adeno-associated Viral Vector",
  "procedures": [
    "All animal experiments are carried out in accordance with the European Communities Council Directive of 24 November 1986 (86/609/EEC) and approved by the Bioethical Committee of the University of Leuven (Belgium).\n1. Recombinant AAV Production and Purification\nNote: rAAV vector production and purification was performed by the Leuven Viral Vector Core (LVVC) as previously described17.\nBriefly, transfect subconfluent low (<50) passage adherent HEK 293T cells using a 25kD linear polyethylenimine 150 nM NaCl transfection solution and three different plasmids in a ratio of 1:1:1 in DMEM medium 2% foetal bovine serum. After 24 hr of incubation at 37 °C in a 5% CO2, replace the medium with fresh DMEM medium 2% foetal bovine serum.\n\tNote: The plasmids include the constructs for the AAV7 serotype, the AAV transfer plasmid encoding the human A53T mutant α-SYN under the control of the CMVie enhanced synapsin1 promoter and the pAdvDeltaF6 adenoviral helper plasmid17.\nHarvest the medium 5 days after transient transfection and concentrate using tangential flow filtration17.\nPurify the rAAV vector particles from the concentrated medium using an iodixanol step gradient17.\nUse standard techniques of real-time PCR for genomic copy (GC) determination. In this protocol, a vector titer of 3.0 E11 GC/ml was used to develop an α-SYN based rat model for PD17.\n2. Stereotactic injection of rAAV α-SYN Vector in the SN of the Rat (Figure 2)\nHouse eight weeks old female Wistar rats weighing about 200-250 g under a normal 12 hr light/dark cycle with free access to pelleted food and tap water.",
    "Submit the rat to intraperitoneal (i.p.) anesthesia containing a mixture of ketamine (60 mg/kg) and medetomidine (0.4 mg/kg). Once the rat is anesthetized and doesn't react when squeezing the different paws, administer a micro-transponder subcutaneously on the back of the rat for further recognition using a micro-transponder implanter. Check if the micro-transponder is positioned correctly and can be read out by the reading device.\nCut the hair on top of the scalp. Apply a local anesthetic on both the scalp and the ears. Perform the rest of the surgical procedure under a laminar flow using aseptic techniques.\nPlace the rats in a stereotactic head frame using two ear bars, a mouth and a nose bar. Cover the body of the rat with a paper blanket to avoid a drop in body temperature. Apply an ocular lubricant to prevent the eyes from drying.\nDisinfect the scalp with jodium 1% in isopropanol 70% and make a small incision in the midline of the scalp. Gently scrape away the membranes on the skull and rinse with saline. Let the skull dry for several minutes. Observe the cranial sutures and the two reference points: Bregma and Lambda.\nTo inject the rAAV vector into the SN, define the coordinates towards Bregma (anteroposterior: 5.3 mm; mediolateral: 2.0 mm and dorsoventral: 7.2 mm calculated from the dura).\n\tNote: The three dimensional coordinates for each region of interest can be calculated using a stereotaxic atlas of the rat brain, applying Bregma as anatomical reference point.\nFill a 10 µl microinjection syringe (30 gauge 20 mm) with rAAV vector and place it in the stereotaxic instrument connected with a motorized microinjection pump. Control the volume by releasing a drop of vector and eliminate in a polyvalent cleaning detergent pH 9 (e.g. RBS).",
    "Visually check if the head is fixed straight in the head frame and evaluate the left-right axis. Carefully visually define the anteroposterior and mediolateral coordinates for Bregma and Lambda and measure their height using a 30 gauge 20 mm needle in the dorsoventral arm of the stereotactic frame.\n\t\nAllow a maximum of 0.3 mm difference in height between Bregma and Lambda. Place the needle back on Bregma and apply the anteroposterior and mediolateral coordinates by moving the anteroposterior and the mediolateral arm of the stereotactic frame.\nAt the place of injection, measure the height of the skull and ensure that it does not differ more than 0.3 mm from the height of Bregma. Drill a hole in the skull with a diameter of approximately 2 mm. Measure the height of the dura, this will serve as a reference to apply the dorsoventral coordinate. Alternatively subtract a fixed thickness for the skull (0.9 mm).\nPenetrate the dura using a 26 gauge needle and absorb the blood with a sterile tissue. Wait until all bleeding has stopped before proceeding.\nSlowly insert the 10 µl microinjection syringe pre-loaded with vector solution into the brain to the pre-determined depth (dorsoventral coordinate). Wait 1 min with the needle in place. Inject 3 µl of vector solution (3.0 E11 genome copies/ml (medium vector dose) or 1.0 E12 GC/ml (high vector dose) of rAAV2/7 α-SYN or eGFP control vector) using the motorized microinjection pump with a throughput of 0.25 µl/min.\nAfter injection, keep the needle in place for another 5 min before slowly removing it. Stitch the scalp using coated braided polyester 3.0, disinfect with 1% jodium in 70% isopropanol and gently remove the animal from the stereotactic instrument. First loosen the nose and mouth bar, then the two ear bars.",
    "To reverse the anesthesia, inject the rat intraperitoneally with 0.5 mg/kg atipamezole and place the rat in a clean cage on a heating plate of 38 °C until it wakes up. Cover the rat with a paper blanket to prevent a drop in body temperature.\nProvide easy access to food and water for the first hours. Monitor the rat for the first few days. If necessary apply analgesia.\n\tNote: There is no need to remove the stitches from the skull. After 1-2 weeks the skull is completely repaired and the stiches come loose.\n3. Assessment of rAAV2/7 α-SYN Injected Rats Using Non-invasive PET Imaging, Behavioral Tests and Immunohistochemical Analysis\nTo follow up the kinetics of nigrostriatal dopaminergic neurodegeneration non-invasively over time in individual animals, quantify dopamine transporter (DAT) binding using small-animal positron emission tomography (PET) and a tracer of the DA Transporter e.g. [18F]-FECT16.\nTo examine whether the level of dopaminergic neurodegeneration is sufficient to induce motor impairments in the rats, subject the rats to the cylinder test to evaluate spontaneous forelimb use.\n\t\nPlace the rat in a 20 cm wide clear glass cylinder and videotape the behavior during vertical movements along the wall and landing after a rear. Score the number of contacts made by each forepaw for a total of 20 contacts. For detailed description of the scoring criteria see Schallert et al.18 Express the number of impaired forelimb contacts (e.g. left forepaw) as a percentage of total forelimb contacts (left plus right forepaw).\n\t\tNote: Non-lesioned control rats using both paws equally should score around 50% in this test.\nPerform immunohistochemical (IHC) analysis to assess the level of transgene expression and dopaminergic cell loss.",
    "At different end stages, sacrifice the rats with an overdose of sodium pentobarbital (60 mg/kg, i.p.) and perform an intracardial perfusion with cold saline followed by 4% paraformaldehyde in PBS19. Fixate the brains overnight at 4 °C and cut 50 µm thick coronal brain sections using a vibrating microtome.\nPerform IHC staining on free-floating sections using antibodies against α-SYN and tyrosine hydroxylase to analyze α-SYN expression levels and the level of neurodegeneration16.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}