{
  "id": 4278,
  "origin_website": "Bio",
  "title": "Retinal Explant Culture",
  "procedures": [
    "Day of ExperimentPrepare the explant medium (see Recipes for the preparation of the stock solutions)Explant mediumIn a 50 ml tube, add: 45 ml of DMEM5 ml of fetal bovine serum (FBS)500 µl of pen/strep 100x50 µl of Fungizone antimycoticTo equilibrate the medium at the right temperature and pH, put the lid on the 50 ml tube and unscrew ¼ of a turn. Place the tube in the incubator at 37 °C and 5% CO2 until needed.Preparation of the culture platesThe explants are cultured on a Millicell organotypic insert. We typically use 35 mm dish or 6 well plates to put the insert in.Fill the dish (or well) with 1.2 ml of equilibrated explants medium and place the insert gently over it with sterile forceps.Place the dish (or plate) in the incubator at 37 °C and 5% CO2 until needed.Dissection of the retinas Note: The dissection should be carried out under sterile conditions. Spray the working area with 70% ethanol and use a flame. Sterilize all the instruments before use. Prepare two 100 mm dish filled with 10 ml of sterile DPBS, one to transfer the heads and the other to dissect the eyes and two 35 mm dish filled with 2 ml of sterile DPBS to collect the retinas.Collection of the embryosEuthanize the animal in a CO2 chamber. Place the animal on its back and clean the abdomen with 70% ethanol. Pinch the skin with a straight forcep, lift the skin and muscle and make a V shape opening using scissors on both side of the abdomen, starting from the lower abdomen and cutting all the way up on the side of the animal. Lift the skin and muscle upward to reveal the internal organs and uterus. Cut out the uterus and transfer it to a 150 mm dish.",
    "Remove the embryos from the uterus and decapitate the heads with sharp scissors.Transfer the heads to a 100 mm dish filled with DPBS.Dissection of the retinasCarefully remove the skin that covers the eye. Place a curved forcep of both side of the eye and apply a gentle pressure. The eye should pup out. Pinch the back of the eye and pull. Transfer the eye in a 100 mm dish filled with DPBS.With the lens facing downward, secure the eye in position with a fine forceps and remove the optic nerve (Figure 1, steps 1-2). Introduce the tip of another forceps through the optic nerve head and between the choroid and retina to secure the sclera. Now that the sclera is secured, you need to gently tear it open with both forceps from the optic nerve head to the cornea to expose the retina and lens (Figure 1, steps 3-4). Carefully detach the lens and place the retinas in a 35 mm dish filled with DPBS (Figure 1, steps 5-6).From E18-19 onward, it is required to remove the blood vessels covering the retina to avoid endothelial cell contamination in the culture.  The blood vessels form a reddish membrane overlying the inner face of the retina. The membrane is easily removed by pinching and pulling with fine forceps. Transfer the retinas in a 35 mm dish filled with DPBS.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140111/20140111022833_4179.jpgFigure 1. Procedure for retina dissection. Steps 1-5 show the procedure to dissect the retina from the eyeball. Step 6 shows the dissected retina separated from the lens.Preparation of explantsFor retinas older than embryonic day 15, cut small pieces of around 5 mm (Figure 2, steps 1-2). For younger retinas, place the whole retina on the insert. With a razor blade, cut the edge of a P1000 pipette tip to make a lager opening.",
    "Transfer the explants from the 35 mm dish to the insert. It doesn’t matter which side of the explants is facing upward on the insert. Gently lay the explants as flat as possible (Figure 2, step 3). Try not to fold or tear the explants as this could lead to defect in the formation of the layers and make the analysis difficult.Place the dish in the incubator at 37 °C and 5% CO2. The culture should be left until the retina is fully developed (around post natal day 14 in vivo). For explants started at embryonic day 13, this would mean 20 days in culture. For explants started at post-natal day 0, this would mean 14 days in culture.The medium should be changed every 3 days by replacing 80% of the medium with fresh one.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140111/20140111022911_8408.jpgFigure 2. Preparation of the explants. Starting from an entire retina (Step 1), small pieces are cut (Step 2) and placed on the organotypic filter (Step 3).Fixation of the explantsAfter the desired culture period, remove the insert from the dish and aspirate the culture medium. Replace it with freshly made 4% PFA. Place the insert back in the dish. Gently add 1 ml of 4% PFA on top of the insert. The PFA solution needs to be at room temperature to help maintain the explant morphology. Incubate 30 min. Gently rinse 3 times with PBS. Preparation of the explants for cryosectionningReplace the PBS with a solution of 20% sucrose. Make sure that the explants are well covered. Incubate at 4 °C overnight.For cryoprotection, fill a small cryomold with a mixture of 20% sucrose/OCT (1:1).Remove the 20% sucrose solution from the top of the insert, take out the insert from the dish and, using a sharp scapel, cut the membrane around each explant.",
    "Pick the piece of membrane/explant with a fine forceps and place it in the cryomold. Gently push down the explants and lay them at the bottom of the cryomold. Make sure it is covered with enough 20% sucrose/OCT solution. Snap-freeze in liquid nitrogen (do not immerse the cryomold in liquid nitrogen, just touch the surface of the nitrogen with the bottom of the mold) and store at -80 °C until ready to section.The section thickness can vary between 10 and 30 μm depending on the type of analysis needed. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140111/20140111023008_7341.jpgFigure 3. Micrographs of retinal explant cryosections at 10x (A) or 40x magnification after 14 days in culture. The retina was counterstained with Hoechst to visualize the nuclei. The retinal layers are identified, ONL: outer nuclear layer, INL: inner nuclear layer."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}