{
  "id": 17637,
  "origin_website": "Jove",
  "title": "Development and Evaluation of 3D-Printed Cardiovascular Phantoms for Interventional Planning and Training",
  "procedures": [
    "Ethical approval was considered by the ethical committee of the Ludwig-Maximilians-Universität München and was waived given that the radiological datasets used in this study were retrospectively collected and fully anonymized.\nPlease refer to the institute's MRI safety guidelines, especially regarding the used LVAD ventricle and metal components of the flow loop.\n1. Data acquisition\nPrior to creating the anatomical phantoms, select a suitable radiological dataset, preferably from patients in cardiovascular disciplines. The virtual 3D-model can be derived from both, computed tomography (CT) or magnetic resonance imaging (MRI) datasets.\nSelect the pixel size and slice thickness (ST) of the dataset to adapt to the size of the structures intended to be represented in the 3D-model. This experiment used an ST of 0.6 mm with a matrix size of 512 x 512 and a field of view of 500 mm leading to a pixel size of 0.98 mm. Ensure that the value of both pixel size and ST must lie below the size of the smallest feature that should be visible in the images and the 3D model, e.g., <0.3 mm for datasets of infants or representation of coronaries, <0.6 mm for the main cardiovascular structures of an adult patient.\nPerform standard acquisition for CT angiography (CTA) in dual-source spiral technique with a ST of 0.6 mm for adult patients. For adults, inject 80 mL of iodine contrast agent at a speed of 4 mL/s and start acquisition 11 s after bolus tracking in the ascending aorta at a threshold of 100 HU. The tube voltage and tube current are selected automatically by the scanner according to the patient's body type. Perform reconstruction in a soft tissue kernel using a high degree of iterative reconstruction.",
    "​NOTE: CTA acquisition parameters and protocols are highly dependent on the available CT scanner, patient size and patient circumference. The presented parameters are experience-based and should be taken as a starting point for adjustment rather than a fixed requirement.\nFor MR angiography (MRA), perform non contrast-enhanced (non-CE) MRA using an in-house modified sequence that utilizes a fully balanced gradient waveform, using both ECG- and respiratory triggering (TE 3.59, TR 407.40, matrix size 224x224). Achieve accelerated MRI data acquisition by using compressed sensing which combines parallel imaging, sparse sampling, and iterative reconstruction. As an example, acquisition times of about 5 min for the thoracic aorta are possible.\n\tNOTE: Be sure to select a dataset that is free of movement artifacts. To reduce motion artifacts, perform image acquisition using prospective ECG triggering and additional respiratory triggering for non-CE MRA. Furthermore, when selecting a model for general use, ensure that there are no metallic implants as this can improve the quality of the finished model.\nFor the segmentation and 3D-printing of cardiovascular anatomies, use contrast-enhanced datasets. The use of native cardiovascular datasets makes the separation of hollow anatomic structures (e.g., vessels or ventricle) from blood difficult, due to comparable Hounsfield values of roughly 30 HU8.\n\tNOTE: A higher Hounsfield value gradient between blood volume and surrounding soft tissue will allow for an easier separation in the segmentation process. If the gradient is very small, parts of the soft tissue will be displayed as part of the blood volume, resulting in a poor model quality and additional post processing.\nWhen exporting the dataset, make sure to select a reasonably low slice thickness (roughly 0.3 - 0.6 mm for CTA and 0.8 - 1.0 mm for MRA), since the resolution and surface quality of the printed model depends greatly upon this parameter.",
    "​NOTE: If the slice thickness is too thin, the required computing power for modeling will increase substantially, which slows the process accordingly. On the other hand, excessive slice thickness can result in the loss of small details in the patients' anatomy.\n2. 3D-model creation\nNOTE: The creation of a 3D-model from a radiological dataset is called the segmentation process, and a special software is required. The segmentation of medical images bases itself upon Hounsfield units, to form 3-dimensional models9. This study uses a commercial segmentation and 3D-modeling software (see Table of Materials), but similar results can be achieved using available freeware. The following steps will be described for modeling from a contrast-enhanced CT dataset.\nAfter importing the dataset into the segmentation software, crop the dataset to limit the area of interest, i.e., heart and aortic arch. Achieved this by selecting the Crop Images tool and moving the edges of the ROI by clicking and moving the sides of the frame. This can be done in all three orientations. Therefore, a focus on the ROI, together with a decrease of file size is obtained, which enables higher computing speed, leading to reduced overall working time.\nDefine a range of Hounsfield unit values (approx. 200-800 HU) by opening the Threshold tool, resulting in a combined mask of the contrast-enhanced blood volume and bone structures (Figure 1A, e.g., sternum, parts of the ribcage, and spine).\nRemove all bone parts which are undesirable in the final 3D-model by using the Split Mask tool which enables the marking and separation of multiple areas and overall slices, based on Hounsfield values and location.",
    "Following this separation, ensure that a mask containing the contrast-enhanced blood volume remains. This can be done, by scrolling through the coronal and axial planes and matching the created mask with the underlying dataset. From this mask, calculate a rendered 3D polygon surface-model (the so-called STL) (Figure 1B).\n\tNOTE: Tool names might differ in other segmentation programs.\nFor further adaption and manipulation, transfer the 3D-model to a 3D-modeling software (see Table of Materials). To export the 3D-model, click on the Export-Tool and select the 3D-modeling software, or a fitting data format for the exported file. Subsequently, confirm your selection and the export process will be performed.\nUse the Trim tool to crop the blood volume to the specific area of interest (e.g., removing parts of the aorta or some of the heart cavities). Click the tool and draw a contour around the parts that need removal.\n\tNOTE: Depending on the dataset quality and the accuracy of the segmentation, some minor surface repairs and modifications might be required at this point. Further design operations allow the manipulation of patient-specific models according to the purpose of use, e.g., in training. Some examples for engineering, according to the patients' anatomy, include scaling the entire model or single structures, to create or delete connections, combining parts of different models in one. Such features are particularly interesting for training models with congenital abnormalities, as CT and MRI images are rare in pediatrics, where the minimization of radiation and sedation is key. Therefore, the adaptation and modification of existing models is especially helpful for the 3D-printing of congenital heart defect models.\nClick the Local Smoothing tool to adjust the surface of the segmented model manually and locally. Focus on removing rough polygon shapes, single peaks and rough edges created by the previous trimming operations.",
    "To allow the later connection of the model to a flow loop, include tubular parts with defined diameters adjusted to the available hose connectors and tube diameters (Figure 1C). Therefore, place a datum plane parallel to the opening cross-section of the vessels at a distance of roughly 10 mm.\n\t\nTo place the plane, select the tool Create Datum Plane and use the preset 3-Point Plane. Next, click on three equally spaced points on the vessels cross-section to create the plane. Afterwards, input an offset of 10 mm in the command window and confirm the operation.\nSelect the New Sketch tool from the menu and choose the previously created datum plane as location of the sketch. In the sketch, place a circle roughly on the centerline of the vessel and set the radius constraint to match the outer diameter of your hose connector (24 mm for aortic inlet, 8-10 mm for subclavian, carotid, and renal vessels, and 16-20 mm for the distal opening of the vessel).\nFrom the created sketch, use the Extrude tool to create a cylinder with a length of 10 mm. Orient the extrusion to move away from the vessel opening, to create a distance between the cylinder and the vessel cross-section of 10 mm. Then, use the Loft tool, to create a connection between the vessel ending and the geometrically defined cylinder. At this point, ensure a smooth transition between the two cross-sections, thereby avoiding turbulence and low flow areas in the final 3D flow model (Figure 1D).\n\tNOTE: By following these steps, a 3D-model of the blood volume of the aorta and adherent arteries will be created. Furthermore, it will include the connectors required for subsequently connecting it to a flow loop.",
    "To make a hollow blood space, use the Hollow tool in the software. In the command window, input the required wall thickness (in this experiment: 2.5 mm) Furthermore, the direction of the hollowing process has to be set to Outside. Afterwards, confirm selection and the hollowing process will be executed.\n\tNOTE: This step allows the selection of a fixed wall thickness for the entire model. Since \"hollowing\" creates a defined wall thickness on all surfaces, a fully closed model will result. Therefore, the ends of all vessels will need to be trimmed once more using the step described in step 2.6 (Figure 1E). When using flexible 3D-printing materials, this step is essential to define the final bio-mechanic properties of the phantom. By increasing the wall thickness of the model, higher resilience and lower elasticity will logically result. If the mechanical properties of the native tissue and the 3D-printing material are not known, tensile tests must be performed at this point. Since the wall thickness is constant across the entire model, the desired mechanical properties should be recreated in the region of interest of the model.\nSome processing software offer a \"Wizard\" to ensure the printability of the final model, which is highly recommended. This optional processing step will analyze the model's polygon mesh and mark overlaps, defects and small objects, which are not connected to the model. Usually, the wizard offers solutions to remove the found issues, resulting in a printable 3D-model (Figure 1F).\nExport the final model as .stl-file by selecting the Export option in the File tab.",
    "NOTE: To confirm the accuracy of the designed 3D-model, some software enables the overlay of the final STL's contour and the underlying radiological dataset. This allows a visual comparison of the 3D-model to the native anatomy. Furthermore, a printer with a suitable spatial resolution of < 40 µm must be selected, to allow for an accurate print of the digital model.\n3. 3D-printing and flow loop setup\nUpload the .stl-file to a 3D-printer, using the slicing software provided by the manufacturer, to produce a physical phantom of the anatomy. Ideally, one should use a printing layer height of ≤ 0.15 mm to ensure high resolution and good printing quality.\n\tNOTE: There is a wide range of elastic printing materials and suitable 3D-printers available on the market. Different setups can be used to print the previously described digital models. However, resolution, post-processing and mechanical behavior might differ from the presented results.\nAfter uploading the printing file from the slicing software to the 3D-printer, ensure that the amount of printing material and support material in the printer's cartridges is sufficient for the 3D-model and start the print.\nFollowing the printing process, remove the support material from the finished model. First, remove the support material manually by gently squeezing the model, followed by immersion in water or a respective solvent (depending on support material). Dry in an incubator set to 40 °C overnight.",
    "NOTE: The removal of the support material can be a time-consuming step, depending on the complexity of the anatomical model. While the use of tools like spatulas, spoons and medical probes can slightly decrease the post-processing time, it also increases the danger of perforating the model's wall, rendering it useless for fluid testing. When using the Polyjet printing technology, the entire model will be encased by a support material. This is required to keep the uncured model material in place while it is cured using UV-light. In hollow tubular models, this will lead to a much higher demand for support material compared to actual model material. The model presented in Figure 2 uses roughly 200 g of model material and 2,000 g of support material.\nNext, embed the model in 1% agar. This reduces movement artifacts during clinical imaging of the model. Secondly, agar offers a better haptic feedback during sonographic imaging, and a better force feedback during catheterization, as compared to submersion in water.\n\t\nUse a plastic box with at least 2 cm side margins around the model. Drill holes into the walls of the box to allow the tubes to be connected from the vessels to the pump and the reservoir.\nPrepare an agar solution by adding 1% w/v in water and bringing to a boil. After boiling and stirring the mixture, let it cool for 5 min and pour into the box to create a bed of at least 2 cm height, on which the model will be placed.\n\t\tNOTE: If the model is placed directly onto the bottom of the box, the pulsatility of the fluid inside the model will create an asymmetric upward movement.",
    "While the agar bed sets, connect the model to non-compliant PVC tubes, using commercial hose connectors at every opening. A tube diameter of 3/8\" is recommended for large vessels (e.g., aorta) and/or anatomical structures with high blood flow (e.g., ventricles). For smaller vessels a 1/8\" tube is sufficient. Use zip ties to fix the connection between the hose connectors and the 3D-model and ensure there is no fluid leakage.\nGuide the PVC tubes through the drilled holes into the box and then place the model on top of the set agar bed. To prevent agar leaking from these holes, use heat proof modeling clay to seal it. Subsequently, fill the box with agar, covering the model by adding a 2 cm layer on top and leaving for an hour at room temperature for the agar to fully cool and set. This will require more of the agar mixture described in step 3.4.\n\tNOTE: The agar once cured will be usable for about a week, if refrigerated. Once it visibly reduces in volume, it should be replaced by a fresh batch.\nConnect a pulsating pneumatic ventricle pump to the model using the 3/8\" tubing attached to the proximal opening. Connect the other tubes to the reservoir and subsequently, connect the reservoir to the inlet of the ventricle pump to create a closed flow loop. (Figure 2; e.g., ventricular assist device (VAD)-ventricle). The pump should have a stroke volume of 80 - 100 mL to ensure sufficient physiological flow in adult anatomies. For pediatric anatomies, smaller pumping chambers are available.\nThe ventricle should be agitated by a piston pump with a stroke volume of 120 - 150 mL, to account for air compression in the connective tube system.\n4. Clinical imaging",
    "NOTE: To prevent artifacts in clinical imaging, it has to be ensured that there are no air pockets in the fluid circuit.\nCT imaging\n\t\nFor CT imaging, place the entire flow loop within the CT scanner with the drive unit standing close by. Connect the contrast agent pump directly to the reservoir of the flow loop, so the flooding of the model with contrast agent can be simulated during scanning. This is especially useful for visualizing vascular pathologies.\nPerform CT as a dynamic scan over the whole model to visualize contrast agent inflow. Tube voltage is set at 100 kVp, tube current at 400 mAs. Collimation is 1.2 mm. Inject 100 mL of 1:10 diluted iodinated contrast agent into the model's reservoir, at a speed of 4 mL/s. Start the scan using bolus triggering in the leading tube, with a 100 HU threshold and 4 s delay.\nSonography\n\t\nPut a small amount of ultrasonic gel on top of the agar block to reduce artifacts. Start the pump and use the ultrasonic head to locate the anatomical structure of interest for ultrasonic imaging (i.e., heart valves). Use 2D-echo mode to evaluate leaflet movement, as well as opening and closing behavior of the valve. Use color Doppler to evaluate blood flow across the valve and spectral Doppler to quantify the flow velocity following the heart valve.\nCatheterization/Interventions\n\t\nInsert an access port into the PVC tube directly below the 3D-model, to allow for an easier access of the anatomy with a cardiac catheter or guidewire. After starting the flow loop, check for leakage at the port entrance point. If necessary, use a two-component adhesive to seal the opening.",
    "Place the 3D-model on the patient table underneath the C-arm(s) of the X-ray machine. Use X-ray imaging to guide the catheter and guidewires through the anatomic structure. For balloon dilation or stentgraft placement use continuous X-ray mode to visualize the expansion of the device.\n\t\t​NOTE: Catheterization and intervention training on 3D-printed models allows for the interchangeable use of different anatomical and pathological models. This further increases the variety and realism of the training setting.\n4D-MRI\n\t\nUse a 1.5 T scanner for MRI acquisition and ensure that the acquisition protocol consists of a non contrast-enhanced MRA as described above and the 4D-Flow sequence. For 4D-Flow acquire an isotropic dataset with 25 phases and a slice thickness of 1.2 mm (TE 2.300, TR 38.800, FA 7 °, matrix size 298 x 298). Set the velocity encoding at 100 cm/s. The in vitro measurements are performed using simulated ECG- and respiratory triggers.\nFor 4D-Flow analysis the box with the embedded model and the VAD-ventricle are placed in the MRI scanner and covered with an 18-channel body coil. With regard to the magnetic field of the MRI scanner, the pneumatic drive unit has to be placed outside the scanner room; therefore, a longer connective tube system is usually required.\nPerform the 4D-Flow image analysis with a commercially available software. First, import the 4D-MRI dataset by selecting it from the flash drive. Next, perform semi-automated offset correction and correction of aliasing to improve image quality. Subsequently, the centreline of the vessel is automatically traced, and the software extracts the 3D volume.",
    "Finally, perform quantitative analysis of flow parameters by clicking on the individual tabs in the analysis window. Flow visualization, pathline visualization, and flow vector will be visualized without further input. For quantification of pressure and wall shear stress in the respective tab, place two planes by clicking on the button Add Plane. The planes will be automatically placed perpendicular to the vessel's centreline.\nMove the planes to the ROI by dragging them along the centreline, so one plane is placed at the beginning of the ROI and one at the end. In the diagram next to the 3D-model the pressure drop across the ROI and wall shear stress will be visualized and quantified.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}