{
  "id": 2922,
  "origin_website": "Cell",
  "title": "A protocol for measuring the response of Arabidopsis roots to gravity and treatment for simulated microgravity",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nSurface sterilization of Arabidopsis thaliana seeds in the laminar flow hood\nTiming: 60 min\nSurface sterilization of the seeds is critical for the experiment because the seeds need to germinate, and the seedlings grow on sterile ½ MS agar plate solidified with agar.\nSelect the control and candidate mutant genotypes for gravity and simulated gravity response analysis.\nTransfer 100–200 Arabidopsis Col-0 seeds as the control from the seeds stock tube to a sterile 1.5 mL Eppendorf (EP) tube on the clean bench and mark the genotype name on the cover of the tube.\nTransfer 100–200 mutant seeds of lazy2,3,4 triple mutant seeds into two separate sterile 1.5 mL EP tubes on the clean bench and mark their respective names on the tube covers.\nSurface sterilization of the candidate seeds.\nSwitch on the UV lamp in the laminar air flow hood over the clean bench and leave it on for 20 min.\nPipette 1 mL 75% ethanol into each of the three 1.5 mL EP tubes and close the lids immediately.\nShake the EP tubes vigorously for 10 s and then put them flat on the clean bench so that the seeds in the tube could be distributed evenly and completely soaked in the 75% ethanol solution.\nNote: During the 20 min sterilization period, you can repeat shaking the tubes several times. Alternatively, you can put the tubes on a laboratory orbital shaker for 20 min.\nPut the EP tubes containing the seeds into a tube rack and let them stand for 1 min so that the seeds can settle down to the bottom of each tube.\nRemove as much of the 75% ethanol as possible with a 1 mL automatic pipette without aspirating any seeds in the tube.",
    "Note: A small amount of the 75% ethanol remaining in the tube is acceptable.\nPipette 1 mL 3% NaClO into each of the EP tubes and repeat step c above.\nPut the three EP tubes into the tube rack and take them to the laminar air flow clean bench. Before opening the bench, make sure that the UV lamp is turned off.\nCritical: Note that it is difficult to precisely count the number of seeds, but more seeds are better than insufficient seeds and we have a method to recycle any extra seeds. If your mutant is not Col-0 (e.g., Ler-0) background, please use the wild type with the same background (Ler-0) as the control.\nWash seeds with sterilized ddH2O\nTiming: 30 min\nThe goal of this step is to completely remove the remaining ethanol and NaClO and replace them with sterilized ddH2O so that the seeds can germinate normally.\nReplace the 3% NaClO in the EP tube with sterilized ddH2O.\nRemove as much of the 3% NaClO as possible with a 1 mL automatic pipette without aspirating seeds.\nAdd 1 mL sterile ddH2O into the tube, shake the tube and leave it to stand for 1 min until the seeds have completely settled down to the bottom.\nRepeat step b above two more times, adding only 500 μL sterilized ddH2O in the tube at the last rinse.\nWhen the seeds have completely settled, you can proceed to the next step, or store these seeds in the ddH2O at 4°C for up to one week in the dark.",
    "Critical: Make sure that the NaClO and ethanol are removed completely; any traces remaining can affect the seed germination. The final 500 μL aliquot of sterile ddH2O can be replaced with 500 μL 0.1% agar (sterilized) so that the seeds can be suspended and can be easily dispensed onto the grown medium.\nPlant seeds on ½ MS agar plate\nTiming: 30 min\nDifferent researchers have their own methods to sow the tiny Arabidopsis seeds onto a ½ MS agar plate. We have developed a highly efficient method which can save a lot of time.\nAttach a rubber pipette bulb firmly to the top of a 1 mL pipette tip (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2460-Fig1.jpg\nFigure 1. Sowing seeds onto a ½ MS agar plate and recycling of the surface-sterilized Arabidopsis seeds\n(A) Attachment of the rubber pipette bulbs on the 1 mL pipette.\n(B) Recycling of the additional seeds on a filter paper.\n(C) Sowing seeds on a ½ MS agar plate.\nOpen the EP tube containing the surface-sterilized seeds and take up about 200 μL ddH2O with adequate number of seeds in the pipette tip. Hold the pipette tip vertically until the seeds settle down to the narrow opening of the pipette tip.\nOpen the cover of the agar plate containing ½ MS agar and touch the surface of the medium slightly with the pipette tip containing the seeds so that the seeds can be expelled together with the ddH2O onto the medium.\nUse the rubber bulb to balance the force in the vertical direction to control the number of the seeds delivered in each droplet until one droplet only contains one Arabidopsis seed (Figure 1[href=https://www.wicell.org#fig1]C).\nFor gravity response analysis, plant about 20 seeds of Col-0 on one plate and 20 seeds of the mutant on another plate respectively.",
    "For simulated microgravity analysis, sow 6–7 seeds of Col-0, lazy4, and lazy2,3,4 triple mutant respectively on the same plate.\nNote: Two plates are required here (one for simulated microgravity and another for the control).\nLeave the plate with the cover half-off in the laminar air flow clean bench for 20 min until the ddH2O around the seeds has evaporated.\nCover the plates and seal them with micropore.\nStratify the plates at 4°C for 3 days in the dark.\nFor the seeds remaining in the EP tubes, we can absorb the remaining water from the seeds in the pipette tip by dispensing them completely onto a sterile filter paper disk.\nNote: Dry the paper with seeds at room temperature and mark the name of the seeds on the paper with a pencil (Figure 1[href=https://www.wicell.org#fig1]B); these seeds can be stored in this form at 4°C in a sterilized petri dish for 2 months. Alternatively, the seeds can be returned to a sterile EP tube.\nCritical: Step 7 can be challenging for the novice but practice will significantly improve your skill and ability. Remember to change to a new pipette tip when you start dispensing seeds of a new genotype. Make sure that the seeds at 4°C are stored in absolute darkness, otherwise the seeds will germinate sooner. The filter paper with the seeds attached can be stored in a glass petri dish at 4°C after the seeds and paper have completely dried.\n3D clinostat-based simulated microgravity analysis in a plant growth room\nTiming: 5–7 days",
    "All the experiments carried out on Earth’s surface are consistently exposed to the standard gravity Earth 1 g condition. While it is impossible to create a microgravity environment on the Earth, but microgravity can be simulated through continuous changing of the object’s orientation relative to the gravity vector through 3D clinostat. Such simulation can generate effects comparable to true microgravity when the change is faster than the response time of the object to gravity. The 3D clinostat has two independent rotating frames that are set perpendicular to one another. Such a machine can simulate a microgravity environment based on the gravity vector averaging zero by continuously rotating the axis. Simulated microgravity analysis begins from the seed germination stage to 5 days or even more, while gravity response analysis begins when the roots of the seedlings have grown to about 2 cm in length in the light chamber. Here, we use the Col-0 wild type, lazy4, and lazy2,3,4 triple mutant for the simulated microgravity analysis.\nFix the Col-0, lazy4, and lazy2,3,4 triple mutant plates to the 3D clinostat and control equipment, respectively, in the same plant growth room after 3 days of stratification (Figures 2[href=https://www.wicell.org#fig2]A and 2B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2460-Fig2.jpg\nFigure 2. 3D clinostat-based simulated microgravity analysis\n(A) An overview of the 3D clinostat. The two perpendicular axes rotate independently when it is working. Col-0, lazy4, and lazy2,3,4 triple mutant plates were fixed to the 3D clinostat under light.\n(B) The ground 1 g control plates are in the same room with 3D clinostat.\n(C) The control panel of the 3D clinostat. It showed the inner frame of 0.8Rpm and the outer frame of 0.4 Rpm instantaneously.",
    "Start the 3D clinostat program: 16 h light and 8 h dark; the sample stage was three dimensionally rotated by changing the rate and direction of rotation at random from 1 to −1 (reverse direction) rpm every 1 min5[href=https://www.wicell.org#bib5] (Figure 2[href=https://www.wicell.org#fig2]C).\nCheck the growth of the seedlings and take photos on the 3rd, the 5th, or the 7th day.\nCritical: Check on the plates on the 3D clinostat and make sure that the machine is working well every day. Taking pictures of the seedlings on the 3D clinostat should be quick. Make sure to return the plates to the 3D clinostat as soon as possible after finishing the imaging.\nSeed germination and growth in the light chamber for gravity stimulation analysis\nTiming: 3–4 days\nMove the plates from the 4°C refrigerator to a plant growth chamber (21°C, 16 h light and 8 h dark) and incubate them vertically for 3–4 days.\nExchange the position of the plates in the plant growth chamber every day at the same time of day until the roots of the seedlings have grown to about 2 cm to avoid any position effect due to uneven light intensity.\nGravity stimulation experiment\nTiming: 9.5 h\nThe shoot endodermis and root columella are the major gravity-sensing tissues in plants. Their statocyte cells (containing amyloplast-statoliths) function as gravity sensors that play a vital role in both shoot and root gravitropic growth. Changing of the gravity vector can stimulate the plant to adapt to the new vector through gravitropic shoot and root growth. Since the gravity vector is consistent and pointing to the ground direction, we can manually rotate the growth direction of the Arabidopsis roots by 90° relative to the gravity vector to achieve gravity stimulation.",
    "Select 6–7 well-grown seedlings of Col-0 and mutant and carefully transfer them from the original plates to a new plate in the clean bench.\nIncubate the seedlings in the growth chamber for 3 h.\nRotate the new plate to 90° in the chamber without altering the other conditions.\nObserve the root growth and bending conditions by optical microscopy and take photos every 30 min, using the Leica imaging software (Leica Application Suite).\nOpen the Leica imaging software and observe the live condition of the root through the “Acquire” button and adjust the focus and light intensity to obtain a clear image of the root (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2460-Fig3.jpg\nFigure 3. Leica software of the optical microscopy for root imaging\nUse the highest resolution available (e.g., 2592 × 1944) on the “Format” button on your own software to capture the image.\nClick on the button of “Capture Image” and the image will be stored automatically in the designated file.\nNote: The 3–4 day old Arabidopsis root is in the center of the view. Adjust the focus so that the outline of the root is clear enough for observation and capturing image. Remember to use the highest resolution available when capturing image.\nData analysis of the time-course-based root gravity sensing\nTiming: 2 h\nThe Arabidopsis root will bend quickly after sensing the new gravity vector after 90° rotation. Manually measuring the bending angle is not only laborious but also error-prone. ImageJ-based (https://imagej.nih.gov/ij/[href=https://imagej.nih.gov/ij/]) analysis of the bending angle provides a better solution for precisely quantifying the data. Usually, the angle between the root-bending direction and the horizontal line can be defined as the bending angle “α” (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2460-Fig4.jpg\nFigure 4. The definition of the root-bending angle, α",
    "Make a full circle in the columellar region and let the lateral root cap be a tangent to the full circle, and then draw a line linking the center of the circle and the root tip. Alternatively, you can draw two lines that are tangential to the lateral root cap on each side, linking the intersection of the two lines with the root tip to form another line. This line forms an angle “α” with the horizontal line and the angle “α” is the bending angle of the root after gravity stimulation (also see Figure 6[href=https://www.wicell.org#fig6]).\nMeasure the angle of the root growth direction against the horizontal line (the former growth direction) using the ImageJ software.\nOpen the software, “File” → “Open” → choose the root picture (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2460-Fig5.jpg\nFigure 5. ImageJ-based measurement of the root-bending angle\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2460-Fig6.jpg\nFigure 6. Measurement of the bending angle with the auxiliary line\nBar = 100 μm.\nMake the picture full screen and use the “Magnifying glass” button or “Shift” + “+” button to magnify the root tip region for more accurate measurements. Use the “Scrolling tool” to keep the root tip in the central position.\nUse the “oval” tool to make a full circle (press “shift” simultaneously) in the columellar region and let the lateral root cap be a tangent to the full circle.\nDraw a line linking the center of the circle and the root tip.\nNote: This line forms an angle “α” with the horizontal line and the angle “α” is the bending angle of the root after gravity stimulation (Figures 4[href=https://www.wicell.org#fig4] & 6[href=https://www.wicell.org#fig6]). Alternatively, you can draw two lines that are tangential to the lateral root cap on each side, linking the intersection of the two lines with the root tip to form another line.",
    "Use the “Angle tool” to follow the track of horizontal line and the bending direction line and then click “Analyze” on the main menu and then “Measure” in the drop-down menu to measure the angle “α” and keep the record of gravity stimulation for each time-course of both Col-0 and the mutant.\nGraphPad Prism 8-based statistical analysis of the root gravity response.\nOpen the software and choose “Grouped” → “Enter or import data into a new table” → “Enter 6 replicate (usually at least 3 replicates) values in side-by-side subcolumns” → “Create” (Figure 7[href=https://www.wicell.org#fig7]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2460-Fig7.jpg\nFigure 7. Settings of the GraphPad Prism 8 for starting a new analysis\nDefine the “Group A” as “Col-0” and “Group B” as “Mutant”. Define the “Title” as time course from “30 min” to “360 min” with intervals of 30 min (Figure 8[href=https://www.wicell.org#fig8]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2460-Fig8.jpg\nFigure 8. Re-define the group names and title names\nFill in the blank with the data measured by the ImageJ software and then click “Data 1” in the sub-menu of “Graphs” on the left menu (Figure 8[href=https://www.wicell.org#fig8]).\nThe “Change Graph Type” slide then appears a new window (Figure 9[href=https://www.wicell.org#fig9]); choose “Grouped” under “Graph family” option.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2460-Fig9.jpg\nFigure 9. Settings for the graph type\nChoose “Superimposed symbols (at mean or median) with connecting line” under the “Summary data” option.\nAt last, choose “Mean with SD” under “Plot” option and click “OK” when complete.\nThe software will automatically generate a chart of the time-course analysis of the root-bending angle in response to gravity stimulation (Figure 12[href=https://www.wicell.org#fig12]).\nRename the X axis and the Y axis, if necessary. Use “Change Colors” button on the main menu to generate different colors of the samples. Alternatively, “Black and White” will be adopted for the default setting."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Plant Sciences",
    "Model Organisms"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Ecology & Environmental Biology"
  ]
}