{
  "id": 9072,
  "origin_website": "Jove",
  "title": "Optical Clearing of the Mouse Central Nervous System Using Passive CLARITY",
  "procedures": [
    "All experiments were performed in accordance with Institutional Animal Care and Use Committee (IACUC) guidelines. THY1-YFP, PLP-EGFP and PV-TdTomato mice were used for these experiments, but any mice expressing fluorescent proteins can be successfully cleared and imaged.\n1. Tissue Preparation\nCaution: Paraformaldehyde (PFA) and acrylamide are toxic and irritants. Perform experiments utilizing these reagents in a fume hood and with appropriate personal protective equipment (lab coat, gloves, and eye protection).\nSacrifice the animal in euthanasia chamber with ~1 ml of isoflurane until breathing ceases (~2 - 3 min).\nUse a peristaltic pump set to ~5 ml/min to intracardially perfuse the mouse with perfusion solution (Table 1) at 4 °C until the blood is cleared from the tissues (5 - 10 min).\nChange the perfusate to fixative solution (Table 1) at 4 °C until the neck and tail have significantly stiffened (5 - 10 min).\nEnd the perfusion and decapitate the animal. Carefully dissect out the brain from the skull by first removing the connective tissue surrounding the skull and then removing bone from the ventral surface of the skull and lifting the brain out (Figure 1a), as described in 20.\n\tNote: Give special care to the removal of bone surrounding the flocculonodular lobes of the cerebellum and the olfactory bulbs.\n\t\nDissect the spinal cord from the vertebral column by gently inserting the tip of a fine, sharp scissor between the spinal cord and the vertebral column and cutting the individual vertebral column segments away, as described in 21.\nHemisect the brain by placing it in a plastic mouse brain matrix and cutting along the midline with a matrix blade.",
    "Add each hemisphere and spinal cord to separate 50 ml centrifuge tubes with ~40 ml of hydrogel solution (Table 1). From this point forward cover the tubes with aluminum foil to protect the fluorophores during all subsequent steps.\nIncubate the tube containing the sample in hydrogel at 4 °C with gentle shaking (~30 rpm) for 7 days.\n2. Polymerization\nDiscard ~25 ml of hydrogel, preserving the sample and ~25 ml of hydrogel in the centrifuge tube.\nDeoxygenate the sample by removing the cap and placing the centrifuge tube in desiccator jar and connecting the jar to a vacuum. Apply the vacuum for at least 10 min to permit dissolved gases to come out of solution and form bubbles. Gently shake to dislodge the bubbles.\nReplace the vacuum in the desiccator jar with 100% nitrogen gas over 2 - 3 min. Once the pressure equalizes (once the top of the desiccator jar can be opened), quickly cap the tube to prevent the reintroduction of oxygen.\nPolymerize the hydrogel by placing the tube with sample in a 37 °C water bath for 3 hr until polymerization is complete. Polymerized hydrogel will take on a gel-like consistency (Figure 1b). Note: A small amount of unpolymerized hydrogel at the top is acceptable.\nUse a spatula to remove the polymerized sample from the centrifuge tube, then cut away the excess hydrogel from the sample.\nRemove the remaining hydrogel by placing the sample on a lint free wipe and gently rubbing and rolling the tissue on it, leaving behind only a thin layer of polymerized hydrogel on the sample.\n3. Lipid Removal",
    "Note: Lipid-cleared tissue is fragile, handle with care. Use a cell strainer when draining the tube to avoid losing sample. Also, the sample will swell throughout the clearing process, however, swelling can be reversed during the refractive index matching process.\nCaution: Sodium dodecyl sulfate (SDS) and boric acid are irritants. Perform experiments utilizing them in a fume hood and with appropriate personal protective equipment (lab coat, gloves and eye protection).\nTransfer polymerized sample to a clean 50 ml centrifuge tube and add 45 ml of clearing buffer (Table 1). Incubate at 45 °C with gentle shaking (~30 rpm). Change the buffer daily for an initial 7 days by pouring off the used clearing buffer into chemical waste and adding ~45 ml of fresh clearing buffer. Keep the centrifuge tubes containing the samples covered in aluminum foil to protect the fluorophores.\nAfter the initial 7 days, incubate the sample at 40 °C and exchange clearing buffer every 2 - 3 days. Continue clearing until all lipids are solubilized and tissue reaches transparency (Figure 1c). This will be 4 - 6 weeks for a mouse brain hemisphere and 2 - 4 weeks for a spinal cord.\nOnce tissue is cleared, transfer sample to a new 50 ml centrifuge tube and wash 4 times in PBST (Table 1) at 40 °C with gentle shaking (~30 rpm) over 24 hr to remove residual SDS.\n4. Molecular Staining\nCaution: 4',6-Diamidino-2-Phenylindole Dihydrochloride (DAPI) is an irritant and any experiments utilizing it should be performed in a fume hood and with appropriate personal protective equipment (lab coat, gloves, and eye protection).",
    "Transfer the sample to a clean 15 ml centrifuge tube and fill with 1 µg/ml DAPI in 1x PBST, pH 7.5. Incubate at room temperature (RT) for 24 hr. Keep the centrifuge tubes containing the samples covered in aluminum foil to protect the fluorophores.\nWash 3 times in PBST at RT for at least 6 hr/wash.\n5. Refractive Index Matching\nCaution: 2,2′-Thiodiethanol (TDE) is an irritant and any experiments utilizing it should be performed in a fume hood and with appropriate personal protective equipment (lab coat, gloves, and eye protection).\nTransfer the sample to a clean 15 ml centrifuge tube and fill with 30% (v/v) TDE in 1x PBS, pH 7.5. Incubate at 40 °C with gentle shaking (~30 rpm) for 24 hr.\nExchange 30% TDE with 63% (v/v) TDE in 1x PBS, pH 7.5. Incubate at 40 °C with gentle shaking for 24 hr.\n\tNote: The sample will shrink back to approximately original size.\nOn a flat, clean surface roll a piece of reusable adhesive into a cylinder with uniform diameter just slightly greater than the thickness of the sample.\nLay the reusable adhesive cylinder in an open-ended circle (~25 mm inner diameter with a small opening at the top) on a 40 mm glass bottom dish. If corrections need to be made, remove the cylinder from the glass and cut with a razor blade.\nUse a p1000 pipette tip to create a seal between the reusable adhesive and glass by rolling it around the outer rim of the cylinder.\nPlace ~100 µl 63% TDE onto the glass dish and spread around to cover the glass surface within the circle of reusable adhesive.\nUsing a spatula, carefully place the sample in the middle of the circle, taking care not to form bubbles.",
    "Pipette another 100 µl of 63% TDE directly onto the sample, then immediately place a 40 mm circular cover glass over the reusable adhesive.\nUsing the index, middle, and ring finger of both hands, carefully press around the perimeter of the circle until the cover glass has made contact with the sample.\nSlowly bring the glass bottom dish to an upright position resting against a surface, then add 63% TDE with a pipette until the solution reaches the small opening at the top. Use a lint free wipe to dry off the pipette tip so that the solution does not drip on the glass. To avoid bubbles in the chamber, never empty the pipette all the way.\nTo the small opening, add silicon elastomer to enclose the circle and create a closed chamber. Wait 5 min for it to dry before imaging.\n6. Microscopy\nCaution: The lasers used in confocal, single plane illumination and light sheet microscopy are very powerful and can cause blindness. Any experiments utilizing lasers should be performed after extensive training and with great caution and appropriate eye protection.\nPlace the imaging chamber with the sample inside on the stage of a laser scanning confocal microscope.\nOpen the imaging software (see Table of Materials). To turn on the argon excitation laser, click the configuration tab at the top of the program then the laser icon. Check the box next to argon to power the laser and move the slide scale to 30%. Observe the pointer slowly warm up to the selected position.\n\t\nReturn to the acquire tab at the top. In the large box \"Beam Path Settings\" go to the load/save setting box and select the drop down menu to select an appropriate wavelength channel to image YFP (527 nm).",
    "Select appropriate objectives for imaging by locating the red hyperlink labeled \"objective: current object\" under the channel settings box. Clicking on the tab opens all available objectives and a selection will automatically rotate the turret.\n\t\nUse objectives (e.g., 10X) with a large working distance (greater than the thickness of the tissue to be imaged, e.g., 11 mm) and a large numerical aperture (e.g., 0.3) to maximize in-plane image resolution and minimize optical section thickness.\nOn the left column of drop down menus, open the \"XY: resolution\" window to set acquisition matrix, called \"format\", to 1,024 x 1,024 or a value appropriate for the lateral resolution limit of the objective. Set the zoom factor as low as possible (e.g., 1.7).\nIn the same window, set 8 line average and 1 frame average parameters by dropping down the individually labeled menus accordingly. Use large values for a high signal-to-noise ratio and small values for rapid acquisition.\n\tNote: 8 line averages and 1 frame average will acquire high-quality images of a mouse brain hemisphere in approximately 4 hr.\nLocate the sample using the stage controls. Once a representative field is visible, set the gain and offset.\n\tNote: The gain and offset will vary substantially based on the tissue type, fluorophores, and/or anatomical feature being imaged. For YFP, set values from 760 to 780 for the gain and from -1.0 to -1.5 for the offset.\nSelect \"tile scan\" and select the boundaries of the region of interest. Set the upper and lower limits of the z-stack to be acquired. Set the thickness of the optical section based on the objective's optical section resolution limit.",
    "Note: An objective's optical section resolution limit is defined primarily by its numerical aperture. Most microscope control software will automatically calculate a value appropriate for the objective being used. For a 10X objective with a numerical aperture of 0.3 that would be approximately 11 µm.\nStart the acquisition.\n\tNote: This may take multiple hours.\nCollect higher resolution images using higher magnification objectives from specific regions of interest.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}