{
  "id": 9085,
  "origin_website": "Jove",
  "title": "Why Quantification Matters: Characterization of Phenotypes at the Drosophila Larval Neuromuscular Junction",
  "procedures": [
    "1. Experimental Preparation\nNote: Dissections and immuno-histochemistry procedures in sections 2 and 3 are performed according to references3-6, but with modifications.\nPrepare 1x Phosphate-buffered Saline (PBS) and PBS containing 0.1% Triton-X 100 (PBT). Keep them on ice.\nPrepare Bouin's fixative (15 Picric Acid:10 Formaldehyde:1 Glacial Acetic Acid). Make this reagent fresh.\nSelect clean stainless steel minutien pins and fine forceps.\nPrepare dissection plates containing a Sylgard disc in a 5 cm Petri dish.\n2. Dissection of Third-instar Larval NMJs\nPick wandering third-instar larvae from a vial or a bottle with a fine brush and place them into a 2 cm Petri dish containing 4 °C PBS to wash the residual food away.\nPlace one larva on the top of the sylgard surface of the dissection plate and make sure that it is positioned with its dorsal side up so that the two longitudinal tracheal tubes are visible on the top.\nUsing the forceps to hold the pin, pin the larva down at its anterior end, right under the mouth hook. Stretch the larva out as much as possible and pin its posterior end down.\nAdd enough PBS saline to reach the walls of the plate and completely immerse the larva.\nRepeat the procedure from steps 2.1 to 2.3 for other larvae of the same genotype. A single 5 cm Petri dish dissection plate can easily accommodate up to 8 larvae.\nUsing the micro-dissection scissors, slightly lift the dorsal cuticle and make a small horizontal incision at the posterior end near the pin.",
    "Insert scissors into the incision, cut the larva all the way to the anterior end along the midline between the two longitudinal tracts of the trachea. Make sure that the midline cuts are superficial enough to just pass through the cuticle and to avoid cutting through the muscles on the ventral side.\nAt each end, cut two notches on both the left and the right sides.\nOpen the fillet by placing two pins on both sides of the anterior incision. Repeat the same with the posterior end. When placing the pins, make sure to spread the body wall apart.\nClean out the internal organs using forceps and PBS saline. Leave the central nervous system intact. Gently stretch the larva with corner pins until it is completely stretched but make sure that the muscles are not torn during this process.\nRepeat the same dissection procedure for the other larvae on the same dissection plate.\nWash with PBS saline three times to remove all the internal organs.\nReplace the PBS with Bouin's fixative and leave at room temperature for 10 min.\nWash several times with PBT.\nRemove the pins carefully and transfer all the preparations, which are now fairly rigid, into a 1.5 ml micro-centrifuge tube for immuno-staining.\n3. Immuno-histochemical Staining of Drosophila NMJs with Antibodies Specific for Muscles and Myonuclei\nQuickly rinse the larval fillets in PBT.\nBlock the preparations by incubating with 10% normal goat serum (NGS) in PBT for 2 hr under constant agitation.",
    "Incubate a set of dissected NMJs in PBT containing 5% of NGS and a rabbit anti-lamin antibody (at a concentration of 1:500) and with a guinea pig anti-DVAP antibody (at a concentration of 1:500) for 2 hr at room temperature or at 4 ºC overnight. The anti-DVAP antibody stains the striated muscles while the anti-lamin staining detects the contour of myonuclei.\nWash once quickly in PBT to remove the antibodies in excess. Wash in PBT for 2 hr by changing the PBT buffer every 15 min.\nIncubate the samples in PBT containing 5% NGS and fluorescent-labelled secondary antibodies at 1:500 dilution for 2 hr at room temperature. The same samples can be subjected to staining with multiple antibodies at the same time if secondary antibodies conjugated with different chromophores are used.\nRemove secondary antibodies and wash in PBT for 2 hr by changing the PBT buffer every 15 min.\nTo stain the interior of the myonuclei wash the samples three time with PBS and proceed as follows:\n\t\nAdd the nuclear marker TO-PRO-3 at a dilution of 1:1,000 in PBS and incubate for 20 min under constant agitation. This marker is used in this study but any other commercially available nuclear marker can be used as well.\nWash quickly three times in PBS before mounting.\n4. Mounting Samples on the Slides\nPick the samples up with forceps from the 1.5 ml micro-centrifuge tube and lay them down on a processing slide.\nBy using micro-dissection scissors, cut the head and the tail of the fillets and keep their internal surface up.",
    "Prepare the mounting slide by wrapping around three strips of cellulose tape on each side of a clean slide at a distance of about 1 cm from each other. Once the coverslip is positioned on top of the two strips, a gap will be generated that will avoid flattening of the samples. This is crucial if three-dimensional volume renderings of structures are to be made.\nPut a small drop of about 20 µl of the mounting medium in the middle of the mounting slide between the three cellulose tape strips.\nAfter spreading the mounting medium with clean forceps, drag the dissected larvae to the mounting slide into the mounting medium, keeping the internal surface up. Try to mount them in rows of four or five.\nGently drop a cover slip on top of the mounting slide and make sure that no air bubbles are generated. Seal the slide with transparent nail varnish. Let the samples dry for at least 10 min before imaging.\n5. Confocal Settings for Imaging\nNote: Images presented in this study are taken using a Nikon A1R confocal unit integrated onto a Ti:E inverted microscope. However, any confocal microscope with a minimum of 3 laser units available in the wavelength regions of 488 nm, 561 nm and 642 nm and a 3 channel detection system is suitable for this purpose.\nTurn ON the lasers, detector unit, mercury bulb, stage controller, microscope and the PC. Start the control software and secure the slide on the stage holder.\nTo make imaging faster, select and mark all the regions of interest (ROI) on the sample by using a 20X objective.\nCarefully swing the nosepiece to the 60X higher magnification objective lens (60X Plan Apo VC/ NA 1.4 OIL).",
    "Place a drop of immersion oil onto the objective lens and select one of the marked ROI from XYZ overview window on the computer.\nStart imaging by using the following optical settings: Select the first Dichroic Mirror: 405/488/561/640. Select 488 nm laser with emission filter 525/50 nm in channel 1, 561 nm laser with 595/50 emission filter in channel 2 and 642 nm laser with long-pass filter 650 nm in channel 3.\nUse the following scan settings before starting image acquisition: Select Galvano scanner; Scan direction: one way; Scan speed: 0.5 frames per sec.\nSelect Channel series to avoid channel bleed-through.\nAdjust the pin-hole size to 1 airy unit. Scan and adjust the laser power, detection gain and offset appropriately for each channel to avoid pixel saturation and background level.\nAcquire z-stacks by using voxel size 0.2 x 0.2 x 0.5 µm3 for all the ROIs and the slide preparations. If the images will be subjected to deconvolution then set the voxel size to 0.06 x 0.06 x 0.15 µm3.\nSave images in .nd2 file format or .ics format.\n6. Calculation of the Distance Between Nuclei within Striated Muscles by the Method of the Nearest Neighbor Analysis\nFor this analysis, use confocal images displaying larval body-wall muscles stained with DVAP antibodies to visualize the muscles and with lamin antibodies and a nuclear marker to highlight the nuclei.\nTo estimate the nearest distance between nuclei, use Measurement Points within the MeasurementPro module of the image analysis software (e.g., Imaris). Other similar software applications for image analysis can be used for the same purposes.\nOpen the confocal images. To initiate, double click on the software icon. Drag and drop the confocal z-stack images into the Arena.",
    "Double click on the images to automatically open them in the Surpass View, under the menu tool bar icon  imgsrc://cloudfront.jove.com/files/ftp_upload/53821/53821img1.jpg. The Surpass View has three main workspace panels: View Area, Object List and Object Properties Area.\nCreate a volume rendered three channel image by clicking on the menu icon 3D View imgsrc://cloudfront.jove.com/files/ftp_upload/53821/53821img2.jpg.\nClick on the Add New Measurement Points icon imgsrc://cloudfront.jove.com/files/ftp_upload/53821/53821img3.jpg from the Objects toolbar and follow the creation wizard that appears in Object Properties Area.\nFrom the creation wizard select the Edit tab first and then Specific Channel. Select either the nuclear marker or the lamin channel to highlight the nuclei.\nSet the pointer to the Select mode by pressing the Esc tab on the keyboard.\nAdjust the size of the 3D cursor box with the mouse wheel to contain a given nucleus in the image. Add a measurement point by holding the Shift key and left mouse click on the same nucleus.\nAdd the second point on a nearby nucleus on the same muscle by repeating the previous steps. A line is automatically drawn between the two points and the measured distance between the two nuclei is displayed. The distance between the two nuclei is now recorded as a statistical variable in the Object Properties Area under the tab Statistics >Detailed>Distance data.\nRepeat the procedure from steps 6.6 to 6.10 for all nuclei surrounding a given nucleus.\nFrom Statistics > Detailed> Distance data displaying all collected measurement points, select the shortest distance.\nBy clicking on the Export Statistics on Tab Display to File imgsrc://cloudfront.jove.com/files/ftp_upload/53821/53821img4.jpg available under the Object Properties Area, the data will be saved on a spreadsheet.\nRepeat the same procedure for the other surrounding nuclei and for a selected number of muscle fibers per genotype.",
    "Using the data exported to a spreadsheet file, calculate the average shortest distance (Dave) for all the M number of muscles using the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/53821/53821eq1.jpg\n\tDi is the shortest distance to the neighboring nucleus for a given nucleus i where i varies from 0 to N and N is the number of nuclei analyzed per muscle. The summation of values from j = 0 to j = m indicates the M number of analyzed muscles.\nAlternatively, use Spots Creation wizard and Spots to Spots Closest Distance to estimate the average distance to the nearest neighboring nucleus. For this, a Matlab extension module is needed.\n\t\nDouble click on one specific image on the Arena and a 3D-volume image will be displayed in the View Area. Click on the Object Creation icon and Add New Spots imgsrc://cloudfront.jove.com/files/ftp_upload/53821/53821img5.jpg from the Objects toolbar.\nFrom the creation wizard in the Object Properties Area, click on the option Skip Automatic Creation, Edit Manually.\nSelect either the lamin or nuclear marker channel to display the nuclei.\nShift and click left mouse button on all the nuclei of a specific muscle in the image. A spot on every nucleus will appear.\nSelect Spots to Spots Closest Distance listed under the Tools tab in the Object Properties Area. Select Spots Statistics under the Result mode and a Matlab window appears.\nUnder the Statistics tab, select Detailed and then Specific Values. Click on the Distmin and the values of the minimum distances for every nucleus will appear.\nExport the data to a spreadsheet file and calculate the average of these distances per muscle. Repeat the procedure for all muscles of a given genotype.\n7. Determining the Shape of Nuclei within the Body-wall Muscles of Drosophila Larvae",
    "For this analysis, use confocal images of body-wall muscles stained with lamin and a nuclear marker to visualize the nuclei.\nTo evaluate the shape of myonuclei, measure sphericity (defined as the ratio of the surface area of a sphere with the same volume as the given nucleus, to the surface area of the nucleus) or ellipticity (distinguishes between oblate/prolate ellipsoids and spheroids).\nOpen the image as previously described. Click on the Objects toolbar icon Add New Surfaces imgsrc://cloudfront.jove.com/files/ftp_upload/53821/53821img6.jpg.\nIn the creation wizard that appears in the Object Properties Area, select the nuclear marker staining as the Source Channel to display the nuclei.\nSet the option Absolute Intensity as the threshold. Make sure that most of the nuclei show a smooth and not overloaded rendering by changing the value on the threshold curve. At the same time, avoid the presence of holes or incomplete mask to any nucleus using the same curve.\nUse the Filter tool to exclude any noise in the surface rendering. Under the Edit tab of the newly created surface layer, Split or Merge the nuclei surfaces that are incorrectly rendered.\nExport to a spreadsheet file the ellipticity and sphericity values of the surface rendered nuclei that are available under the Statistics tab.\nAlternatively, use ImageJ or Fiji software to measure the circularity of nuclei where the Circularity (C) is defined as Cimgsrc://cloudfront.jove.com/files/ftp_upload/53821/53821eq2.jpg . A value of one represents a perfect circle while a value approaching zero indicates an increasingly elongated shape.\nCreate maximum intensity projections of the z stacks from menu Images>Stacks>Z Project. Set projection type to Max Intensity.\nSplit the channels and Select the nuclear marker channel.\nFrom the main menu, select Image>Adjust>Threshold.",
    "Segment the nuclei by adjusting the intensity threshold. If the nearby nuclei are segmented as a single unit, click on Process>Binary>Watershed tool to disconnect the nuclei.\nFrom the main menu, select Edit>Selection>Create selection.\nAdd all the selected ROIs to the ROI Manager by clicking on menu Analyze>Tools>ROI Manager. In the ROI Manager window click on Add. Within the same window select More >Split.\nSelect Shape Descriptors in Analyze>Set Measurements. In the ROI Manager window click on the tab Measure. This will display a list of circularity values of all the selected nuclei.\nIn addition, to measure the nuclear volume, follow surface creation wizard using the nuclear marker staining channel as described in subsections 7.3-7.7.\n8. 3D Volume Renderings of Selected Nuclei within the Drosophila Larval Body-wall Muscles to Evaluate the Intranuclear Localization of a Specific Protein\nUse confocal images reporting body wall muscles stained with a nuclear marker and with antibodies specific to lamin and DVAP.\nOpen the images by initiating the software and select the specific nucleus to be analyzed. This can be done by selecting the main menu item Edit>Crop 3D.\nFollow surface creation wizard using lamin channel as described in subsection 7.3-7.7.\nOnce the surface is created, click on Edit in the Objects Properties Area and then select Mask All to isolate the signal inside the nucleus. This creates a new window.\nSelect DVAP signal from the Select Channel drop-down menu. Select the DVAP immuno-reactivity signal inside the nucleus by clicking on the option Set Voxels Outside The Surface to zero. A new masked channel is created and is available in the display adjustment window for selection.\nTo visualize the presence of signal inside the nucleus create a contour plane by clicking on the icon Add New Clipping Plane imgsrc://cloudfront.jove.com/files/ftp_upload/53821/53821img7.jpg from the Objects toolbar.",
    "Interactively adjust the angle of the clipping plane and its position to visualize the distribution of the signal inside the nucleus."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}