{
  "id": 19251,
  "origin_website": "Jove",
  "title": "A Real-time Electrical Impedance Based Technique to Measure Invasion of Endothelial Cell Monolayer by Cancer Cells",
  "procedures": [
    "1. Preparation\nAll steps should be performed under sterile conditions in a tissue culture hood.\nThe xCELLigence station is placed in a 37°C incubator in the presence of 5% CO2. \nUse low passage HUVEC cells, preferably no more than passage 6. Also, make sure that the cells are no more than 75% confluent at time of harvest. \nHUVEC cells are grown in EGM-2 media reconstituted with EGM-2 bullet kit (Lonza Biosciences) containing growth factors, supplements and 5% fetal bovine serum. \nAll traces of trypsin should be removed from cell suspensions by spinning cells at 200xg, washing once with PBS, and resuspending them to indicated cell densities. \nCoat xCELLigence E-plate 16 with 0.1% gelatin for 1 hour at 37°C or overnight at 4°C. Wash plate with PBS and add 100μL reconstituted EGM-2 media. Perform a blank reading on the xCELLigence system to measure background impedance in the absence of cells. \n2. Generating HUVEC monolayer \nHarvest a sub-confluent flask of HUVEC cells by trypsinization. Resuspend cells in reconstituted EGM-2 media to a final density of 2.5 x 105 cells/ml. \nTo each well of a background calibrated E-plate containing 100μL EGM-2 media, add 100μL of the HUVEC cell suspension (2.5 x 104 HUVEC cells).\nImmediately install E-Plate in the xCELLigence instrument.\nProgram xCELLigence software to perform impedance readings at 10 minute intervals. \nLet the endothelial cells grow for 18-21 hours until they form a monolayer, as evidenced by a flattening of cell index   (Figure 2).\n3. Addition of invading cells and data normalization.\nOnce a stable HUVEC monolayer has formed, harvest tumor cells by trypsinization and resuspend to a final density of 1 x 105 cells/ml in media used to grow tumor cells (such as RPMI or DMEM media containing 10% FBS)",
    "Pause impedance readings on the xCELLigence software and remove E-Plate from the station. \nRemove EGM-2 media by aspiration. Add 100μL of tumor cell suspension containing 1 x 104 cells. Generally, a 1:2.5 ratio of tumor cells : endothelial cells seeded, works best for the assay. However, the ratio can be optimized for individual cell lines. \nPlace the E-plate on the xCELLigence system in the incubator and continue impedance readings at 10 minute intervals. \nInvasion can be monitored in real-time over the next 6-12 hours as a drop in cell index due to the retraction of endothelial junctions and penetration by invading tumor cells. \nNormalize results to the time of addition of invading tumor cells. The xCELLigence software permits normalization to any time point and results can be directly viewed in the software window.\n4. Representative Results: \nAn example of HUVEC monolayer invasion by metastatic and non-metastatic cells is shown in Figure 3. K7M2 is a metastatic osteosarcoma cell line. These cells express high levels of the cytoskeletal linker protein ezrin, which accounts for the invasive properties of this cell line13,14. When HUVEC cells are challenged with K7M2 cells, there is a drop in electrical resistance within 6 hours. This drop in electrical resistance represents the invasion of HUVEC monolayer by the invading tumor cells. The K12 cell-line, on the other hand, expresses much lower levels of ezrin and is consequently less metastatic13.  Challenging the HUVEC monolayer with K12 cells results in a less steep drop in resistance as the cells are unable to adhere to or invade through the HUVEC monolayer (Figure 3). \nimgsrc://cloudfront.jove.com/files/ftp_upload/2792/2792fig1.jpg",
    "Figure 1. Schematic diagram of work flow process for invasion of endothelial cells by tumor cells. HUVEC cells are plated on gelatin coated E-plates and allowed to form a confluent monolayer. Malignant cells are added once a monolayer has formed and invasion is monitored in real-time as the cell index changes due to invasion of the endothelial monolayer.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2792/2792fig2.jpg\nFigure 2. HUVEC monolayer formation. Changes in cell index as HUVEC cells attach to and spread on gelatin-coated gold electrodes. The formation of a confluent monolayer is represented by a stabilization of cell index after 18 hours. \nimgsrc://cloudfront.jove.com/files/ftp_upload/2792/2792fig3.jpg\nFigure 3.  Invasion of HUVEC cells by K7M2 and K12 osteosarcoma cells. A steep decrease in cell-index occurs within a few hours of the introduction of highly metastatic K7M2 cells. K12 cells, on the other hand, are less metastatic and are unable to penetrate the endothelial monolayer as efficiently as K7M2 cells. This is represented by a less steep decrease in cell index when the HUVEC monolayer is challenged with K12 cells. Control represents impedance of HUVEC monolayer in the absence of cancer cells. Experiments were performed in triplicate."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}