{
  "id": 19768,
  "origin_website": "Wiley",
  "title": "Leveraging AI Advances and Online Tools for Structure-Based Variant Analysis",
  "procedures": [
    "The Basic Protocol is ideal for quickly evaluating standard protein forms precalculated by AlphaFold. The insights gained allow to identify, or rule out, effects linked to protein stability, and, in some cases, catalysis. If this protocol fails to yield conclusive results, we recommend the Alternate Protocols. As case examples for the Basic Protocol, we will analyze two protein variants (Arg799Cys and Arg918Trp) of the AGTPBP1 protein, implicated in infantile-onset neurodegeneration (Shashi et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-bib-0040]).\nNecessary Resources\nHardware\nComputer with internet access\nSoftware\nStandard internet browser\nPreparation\n1. To identify the protein sequence of interest in UniProt, go to the UniProt website (https://www.uniprot.org/[href=https://www.uniprot.org/]) and search for the name of its gene or transcript ID. Click on the entry for the correct species to access the entry website (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0002]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/03f0af4d-bcae-42d2-96ce-22b4445eb66e/cpz1857-fig-0002-m.jpg</p>\nFigure 2\nUniProt start page for Q9UPW5 (AGTPBP1). Sections can be accessed by clicking on their titles in the left-side menu.\n2. In the entry page for your protein, click on “Sequence & Isoforms” in the section menu displayed at top left in the UniProt window (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0003]).\nIf different protein transcript/isoform sequences are available, the easiest approach is to take the sequence identified by UniProt, normally the first one listed, as the “canonical sequence”(Q9UPW5-1 in this example). A more rigorous approach is to take the reference sequence recommended by the MANE initiative (Matched Annotation from NCBI and EMB-EBI; Morales et al., 2022[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-bib-0032]), shown in Figure 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0003]. MANE provides a set of high-confidence transcripts and corresponding proteins to serve as universal standards for variant reporting.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/f2390517-f5c8-4f59-830b-b45034069c4b/cpz1857-fig-0003-m.jpg</p>\nFigure 3",
    "“Sequence & Isoforms” section. Select the isoform sequence and verify that the residues of interest are present with their correct numbers. The red boxes highlight Arg799 and Arg918. Below the sequences are cross-references to the IDs from different databases and their corresponding UniProt isoform IDs. The MANE-Select isoform is highlighted in red.\n3. Verify that the chosen UniProt sequence contains the wild-type residue(s) at the correct position(s).\nIn our example, Q9UPW5-1 correctly contains both arginines in position 799 and 918 (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0003]). If this is not the case, refer to the database and ID that were used to report the variant, for example the GenBank ID (https://www.ncbi.nlm.nih.gov/genbank/[href=https://www.ncbi.nlm.nih.gov/genbank/]). To identify the corresponding UniProt sequence, you can search (using Ctr+F) the transcript ID and see if it is reported in this UniProt entry. If so, it is next to the corresponding UniProt ID (e.g., Q9UPW5-2 or Q9UPW5-3). Click on the UniProt ID to be taken to the amino acid sequence, and search again for your amino acid of interest. If your sequence ID is not located in this entry, search for it in the main UniProt search bar at the very top of the page to find the entry that is associated with it.\n4. Gather general information on the gene from UniProt.\nUniProt contains a wealth of information that can help identify the effects of mutations. In addition to “Sequence & Isoforms,” its left-side menu offers ten other categories, including “Function,” “Disease & Variants,” “PTM/Processing,” and “Interaction.” Here we discuss those categories that are particularly relevant for variant analysis.",
    "The “Function” category provides a brief overview of the protein's functions, including catalytic activity, that may be affected by mutations. Additional information is available through diagrams, gene ontology (GO), and tables providing features such as residues involved in ligand binding or catalysis. In our example, AGTPBP1 has a zinc-binding site involving residues 920, 923, and 1017, and an active site at residue 970 (Fig. 4A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0004]). Note that the mutated Arg918 residue is close to the zinc-binding site, providing a first hint that its mutation to tryptophan may impair zinc binding.\nThe “Disease & Variants” section summarizes diseases associated with previously reported gene variants. It includes information on affected residues and reported phenotypes. If a novel mutation is near known mutations, or in the same domain, its phenotypic consequences may be similar.\nThe “Interaction” section lists protein-protein interactions. Variants can directly or indirectly affect binding sites, for example by destabilizing the protein domain or post-translational modification (PTM) site responsible for the interaction (Fig. 4B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0004]). In our example, an interaction with MYLK is suggested.\nThe “PTM/Processing” category allows you to check whether your residue of interest is affected by or near a PTM site (Fig. 4C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0004]).\nWe will discuss the “Structure” category in the Mapping section below.",
    "To assess the effect of a protein variant, it is important to determine if it is located in a functional 3D domain or a disordered region. Disordered regions are usually less sensitive to mutations. The “Family & Domains” section lists known domains, motifs, and unstructured regions. For an often more complete list and description of domains, visit the InterPro page link provided in the “Family and domain databases” subsection. In our example, the UniProt domain annotation is very rudimentary; however, the InterPro page shows that Arg799 is in the cytosolic carboxypeptidase N-terminal domain and Arg918 is in the zinc carboxypeptidase domain (Fig. 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0005]). An additional “ARM-like” helical N-terminal domain is suggested.\nIt is important to identify whether a variant targets a “Transmembrane Domain” in the corresponding section. Surface mutations may have different effects in transmembrane domains than in cytoplasmic proteins due to their hydrophobic environment. Mutations in transmembrane domains can also affect transport activities or destabilize or delocalize membrane proteins. The free internet tool Phobius (https://phobius.sbc.su.se/[href=https://phobius.sbc.su.se/]) can be used as an alternative approach. AGTPTP1 does not have transmembrane regions.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/10b57925-2659-4288-bac4-e0c16d320f62/cpz1857-fig-0004-m.jpg</p>\nFigure 4\nAdditional sections providing functional information about a protein. (A) The “Features” section lists AGTPBP1 residues involved in catalysis and zinc binding (boxed in red). (B) Known protein-protein interactions are listed in the “Interaction” section. (C) The “PTM/Processing” section lists known phosphoserine sites for AGTPBP1.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/c09e6139-3c1a-41c4-b76f-01360c5b472d/cpz1857-fig-0005-m.jpg</p>\nFigure 5\n“Family & Domains” section. Here you will find lists of domains and motifs annotated by UniProt in the sequence (red box above). Dedicated databases such as InterPro (red box below) can contain additional information (the dashed inset shows InterPro domains).\nMapping",
    "After completing the preparation step, in which you identify the wild-type residue in the protein sequence and gather background information on the protein's function and features, the next step is mapping. In this step you will identify the wild-type residue of your variant in its 3D protein context. Below we describe the simplest way to do this by using pre-calculated AlphaFold structures and web-based visualization tools. Alternatively, you can obtain 3D structures from the PDB or through homology modeling and use other programs for structure visualization. These approaches are described in detail in Alternate Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-prot-0002]-4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-prot-0005].\n5. To access AlphaFold structures on UniProt, scroll to the “Structure” section (Fig. 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0006]). Below the interactive structure viewer, you will find a table with the available 3D structures for your protein.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/746a19fd-9098-47de-bba9-d66f4ac6570b/cpz1857-fig-0006-m.jpg</p>\nFigure 6\nThe “Structure” section shows available 3D protein structures. For AGTPBP1, only an AlphaFold model is available. This structure is shown in the viewer colored by confidence score (pLDDT). Clicking on the “AlphaFold” link (red box) opens the corresponding page in the AlphaFold Protein Structure Database.\n6. Look for the entry with “AlphaFold” in the “SOURCE” column and click on the hyperlink in the “LINKS” column. This will take you to the entry page for this model in the AlphaFold Protein Structure Database (https://alphafold.ebi.ac.uk/[href=https://alphafold.ebi.ac.uk/]).\nThis database contains AlphaFold predictions for the human proteome and 20 other model organisms' proteomes.\n7. Map your residue onto the 3D structure by using the interactive AlphaFold Structure Viewer.\nThe AlphaFold page displays protein information from UniProt at the top and has two interactive features below: The Structure Viewer and the Predicted Aligned Error (PAE) plot.",
    "The Structure Viewer shows the protein sequence and predicted 3D structure (Fig. 7A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0007]). By default, residues in the 3D structure are color-coded according to AlphaFold's predicted local distance difference test (pLDDT). The pLDDT estimates the confidence in the position and conformation of each residue on a scale from 0 to 100. The key to the color bands is shown on the left. Blue tones represent high confidence, with dark blue (pLDDT > 90) indicating correct side chain conformation. Yellow/orange may indicate low confidence in the 3D structure, or, more likely, a flexible/disordered region without a stable 3D structure (Tunyasuvunakool et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-bib-0041]). The model for AGTPBP1 shows that the 3D-structured regions are modelled with confidence (light blue) or high confidence (dark blue). Extensive yellow and orange regions are a central flexible linker (residues 439-623) and C-terminal tail (residues 1142-1226) (Fig. 7B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0007]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/445bb7eb-db85-4399-9749-ace10fd5fd23/cpz1857-fig-0007-m.jpg</p>\nFigure 7\nStructural analysis of the precalculated AlphaFold model for UniProt Q9UPW5-1 (AGTPBP1, isoform 1). (A) Default view, with the protein colored by pLDDT quality score (key on the left). (B) Flexible protein regions that have low pLDDT scores are circled in red. (C-E) Domains manually selected in the PAE plot (gray rectangle with white frame and “x” in top right corner) and highlighted green in structure. C and D represent folded domains, and E the flexible linker between them. The dark green off-diagonal PAE sections (red boxes in E) indicate that the two domains are stably bound to each other, despite the linker between them. (F) Ball-and-stick representation of Arg799 and surrounding residues. (G) Screenshot menu.\n8. Assess the confidence in the relative positioning of residues and domains with the PAE plot.",
    "The PAE plot indicates the confidence in the position of a residue relative to other residues in the structure. Dark green corresponds to low positional error. Residues within well-folded domains form a dark green rectangle on the diagonal of the PAE plot. Two domains that stably associate with each other give rise to a dark green off-diagonal feature. Hence, the PAE can reveal extents of domains and contacts between distant parts of a protein. More information on the PAE plot can be found in the “Predicted aligned error tutorial” copied below each entry of the AlphaFold database, and in Zhang et al. (2022[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-bib-0046]). The PAE plot is interactive and can be used to visualize individual domains in the 3D model by selecting (by a mouse-click and drag) a region of interest. The protein residues corresponding to the selected portion of the PAE will be highlighted in green on the 3D model (Fig. 7C-E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0007]). The PAE plot of AGTPBP1 clearly shows two domains, visible as rectangles along the diagonal covering residues 16-438 and 624-1141 (Fig. 7C and D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0007]). The first domain corresponds to the ARM-like helical domain (see the discussion of “Family & Domains” in step 4). The second rectangle comprises the zinc carboxypeptidase domain and the cytosolic carboxypeptidase N-terminal domain, suggesting that they form one structural unit. The off-diagonal green imprint also strongly suggests that both the N-terminal ARM-like domain and C-terminal catalytic unit stably interact, even though they are separated by a large, flexible linker (residues 439-623; Fig. 7E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0007])\n9. Identify the wild-type residue in the 3D structure.\nHovering your cursor over residues in the protein structure or Sequence Viewer activates an information box in the bottom-right corner. This box displays information such as position, residue type, and pLDDT score (Fig. 7F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0007]).",
    "10. Click on a residue in the AlphaFold Structure or Sequence Viewer to get a zoomed-in view of the amino acid and its intramolecular interactions.\nThe interactive interface allows you to manipulate the view of the protein structure and focus on specific regions using your mouse or touchpad. You can zoom in and out using the scroll wheel and rotate the model by clicking and holding the left mouse button while moving the cursor. A right mouse click allows you to zoom out while keeping the residue atoms displayed, removing the narrow depth cueing.\n11. Capture and save an image of the visualization. In the top right corner of the Structure Viewer, there are three icons representing the following options: Top, to reset the view to the default settings; middle, to capture a screenshot of the current structure view (this can be copied or downloaded as a PNG file, with a transparent or white background; Fig. 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0007]G); and bottom, to enable widescreen mode for a larger view of the model. Mouse over the icons to display their functions.\n12. Assess whether the location of the residues of interest in the 3D model overlaps with a known functional feature.\nThrough this approach, we see that both Arg799 and Arg918 are located close to each other in a folded structure, which we have identified above as the catalytic unit of AGTPBP1.\n13. Download the PDB model for further analysis. The AlphaFold model can be downloaded in the PDB file format to your local computer (“Download” > “PDB file”) and then be visualized with more versatile structure viewers, such as the PDB Mol* viewer (see Alternate Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-prot-0002], step 5) or PyMOL (see Alternate Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-prot-0005]).\nAnalysis\n14. Assess the function of the wild-type residue in its 3D context.",
    "To understand the functional repercussions of a variant, it is necessary to first identify the role of the wild-type residue. Clicking on Arg799 in the Sequence Viewer zooms the structure model on this residue and shows all side chains in its vicinity (Fig. 7F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0007]). The ball-and-stick models use distinct colors for different atom types: nitrogen (blue), oxygen (red), sulfur (yellow), and carbon (gray). Dashed lines indicate hydrogen bonds (blue) and pi stacking interactions (green). Currently the AlphaFold Structure Viewer switches this color scheme to an pLDDT-only color scheme after a region has been selected in the PAE plot. Reloading the website reverts to the atom color view. Hovering the mouse over the residues reveals their identity. Clicking again on the highlighted residue will remove the ball-and-stick representation.\nIn this representation, we can see that the side chain of Arg799 is mostly buried in the 3D fold, which is unusual for charged residues. Arg799 forms hydrogen bonds with the side chain of His847 and the backbones of Gln781 and Ile1118 (Fig. 7F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0007]). The backbone of Arg799 forms another hydrogen bond with Glu661. We can conclude that Arg799 plays an important role in stabilizing this structural part of the protein through hydrogen bonds. We can further infer that the mostly buried Arg799 is unlikely to be directly involved in ligand binding, catalysis, or PTMs.",
    "The side chain of Arg918 remains partly solvent accessible. It engages in hydrogen bonds with the side chain of Ser927 and the main chain of His920 and Pro921. Additional hydrogen bonds to Asn960 and Tyr1016 are formed through the backbone of Arg799. Thus, akin to Arg799, Arg918 plays an important role in stabilizing the catalytic unit. From our Preparation step, we further know that His920 is involved in coordinating a zinc ion, jointly with Glu923 and His1018, which are next to Arg918. Hence, Arg918 may be involved in stabilizing the binding site for a catalytic cofactor.\n15. Assess the effect of the substitution on the 3D structure. The final step in analyzing the effect of a variant is to determine whether the substituting residue can maintain the function of the wild-type residue. Although the AlphaFold Structure Viewer does not allow substitution of the wild-type with the mutant residues in the display, the severity of a substitution can often be estimated by comparing the size and stereochemistry of the wild-type and mutant residues (see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-tbl-0001]).\nIn our example, replacing the large, polar, positively charged, and flexible Arg799 with a small, nonpolar cysteine would eliminate all H-bonds formed by the Arg799 side chain (although backbone hydrogen bonds may be preserved). Additionally, the smaller cysteine would create a large gap in the structural fold. These combined effects are predicted to severely affect the structural integrity of the catalytic domain, destabilizing the protein fold and indirectly hampering catalytic activity.",
    "Substituting Arg918 with a nonpolar tryptophan, which has a large, rigid aromatic side chain, is likely to result in steric clashes with surrounding residues, including the zinc-binding residues His920, Glu923, and His1017. This mutation would perturb the structural integrity near the active site and significantly impair the catalytic function of the zinc carboxypeptidase domain, while introducing structural instability.\nIn conclusion, both variants are predicted to impair catalytic function and overall protein stability through slightly different molecular mechanisms.\nTable 1.\n                Physicochemical Properties of Amino Acids\ntable:\n﻿Side chain,Amino acid,Amino acid.1,Amino acid.2,Size,Other\nNegative,Aspartic acid,Asp,D,Medium large,Charged carboxylic acid group; often caps α-helices\nNegative,Glutamic acid,Glu,E,\"Large, flexible\",\"Charged moiety as in Asp, but longer carbon side chain\"\nPositive,Arginine,Arg,R,\"Large, flexible\",Charged guanidino group; can coordinate phosphate groups\nPositive,Lysine,Lys,K,\"Large, flexible\",PTM of charged amine group is a major signal in epigenetics\nPositive,Histidine,His,H,Large,Aromatic imidazole group is partially protonated at physiological pH\nUncharged polar,Asparagine,Asn,N,Medium large,\"Like Asp, but with polar carboxamide\"\nUncharged polar,Glutamine,Gln,Q,Large,\"Likes Glu, but with polar carboxamide\"\nUncharged polar,Serine,Ser,S,Small,Small; can be phosphorylated\nUncharged polar,Threonine,Thr,T,Medium-small,Like Ser but with additional hydrophobic moiety; can be phosphorylated\nUncharged polar,Tyrosine,Tyr,Y,Large,\"Aromatic, with hydroxy moiety that can be phosphorylated or form H-bond\"\nNonpolar,Alanine,Ala,A,Small,Rigid and small\nNonpolar,Glycine,Gly,G,Tiny,No side chain; flexible; can form sharp turns in backbone\nNonpolar,Valine,Val,V,Medium-small,\"Larger than Ala, but smaller than Ile or Leu\"\nNonpolar,Leucine,Leu,L,Medium,Can often be replaced by Ile\nNonpolar,Isoleucine,Ile,I,Medium,Can often be replaced by Leu\nNonpolar,Proline,Pro,P,Small,Rigidifies backbone; breaks α-helices and β-strands\nNonpolar,Phenylalanine,Phe,F,Large,Aromatic; Tyr without hydroxy substituent\nNonpolar,Methionine,Met,M,Medium,\"Long, thin, and flexible\"\nNonpolar,Tryptophan,Trp,W,Large,Aromatic indole moiety that can also make a H-bond\nNonpolar,Cysteine,Cys,C,Small,Can form disulfide bonds\nNote that all residues except Ile, Leu, and Phe can be subject to PTMs. Only charged residues can form ionic bonds (also called salt bridges); charged and uncharged polar residues can form hydrogen bonds (H-bonds). Of the nonpolar residues, only tryptophan can form an H-bond.",
    "16. Next steps: This Basic Protocol, in conjunction with Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-tbl-0001], provides a straightforward approach to evaluating the structural impact of variants at the molecular level. The AlphaFold Structure Viewer is also useful for creating figures for presentations and publications. However, precalculated AlphaFold models do not include ligands or cofactors. The AlphaFill server (https://alphafill.eu[href=https://alphafill.eu]) attempts to automatically add ligands to precalculated AlphaFold structures based on experimental data. For example, the server correctly identifies the substrate-binding site for AGTPBP1 (Q9UPW5) using 25% identity but incorrectly suggests another ligand. Additionally, many proteins form multimers or are part of macromolecular complexes with other proteins or nucleic acids, which may be important for comprehensive variant analysis. Alternate Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-prot-0002], 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-prot-0003], and 3 provide guidance on accessing this information. Alternate Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-prot-0005] outlines simple steps for using PyMOL as a more versatile alternative to the online AlphaFold Structure Viewer for displaying and analyzing structures.",
    "Precalculated AlphaFold models do not include cofactors or macromolecular binding partners and present only a single conformation, even though many proteins alternate between multiple structural states. If experimentally determined 3D structures of the affected protein are available, they may provide additional information. These experimental structures are freely accessible in the Protein Data Bank (PDB; https://rcsb.org[href=https://rcsb.org]). If no experimental structures have been reported for the gene region of interest, you can try using the SWISS-MODEL service described in Alternate Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-prot-0003].\nAs an example, we will evaluate the mutation Arg1748Cys in the gene SETD1B (Weerts et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-bib-0044]).\nNecessary Resources\nHardware\nComputer with internet access\nSoftware\nStandard internet browser\nPreparation\n1. Go to the UniProt page for the human SETD1B gene (UniProt ID Q9UPS6; https://www.uniprot.org/uniprotkb/Q9UPS6/entry[href=https://www.uniprot.org/uniprotkb/Q9UPS6/entry]).\n2. Scroll down to the “Sequence & Isoform” section and find the correct isoform for your analysis.\nIn this example, we select the canonical isoform (Q9UPS6-1), which has a transcript ID of ENST00000604567.6 and is also the isoform suggested by MANE-Select. The residue Arg1748 is present in this sequence.\n3. Gather functional information on the gene from UniProt.\nLook at the different sections described in the Basic Protocol, step 4. From reviewing the UniProt page, we can gather, among other things, that SETD1B is a histone methyltransferase involved in chromatin remodeling machinery. It is also a component of the SET1B/COMPASS complex, where it participates in many protein-protein interactions. The “Family & Domains” section shows the presence of a WDR5 interaction motif (WIN) in residues 1745-1750, which covers our residue of interest.\nMapping\n4. Click on the “Structure” section in the left-hand menu. In addition to the AlphaFold model, two experimentally solved structures are available for this protein, annotated as “PDB” in the “SOURCE” column of the Table.",
    "Clicking on the row in the table corresponding to each model displays it in the PDB Mol* Structure Viewer. You can see that the two structures are similar and both cover our amino acid of interest (residue 1748; see the “POSITIONS” column). At first sight, the structure predicted by AlphaFold for this protein looks very different than the PDB structures; this is because the PDB structures mostly show another protein (WD-repeat containing protein 5 [WDR5]) that binds to a short region of SETD1B. Mouse over protein regions within the PDB Structure Viewer to identify protein chains and display residue information. For this example, we will select the PDB structure 4ES0, which is based on data with the highest resolution (1.82 Å vs. 2.20 Å for structure 3UVO; Fig. 8A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0008]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/e09c8d65-2b8d-4d6c-a3bd-4ed12440c7c0/cpz1857-fig-0008-m.jpg</p>\nFigure 8\nAccessing experimentally solved structures for SETD1B (UniProt ID Q9UPS6). (A) The SOURCE column in the UniProt “Structure” section lists available experimentally solved structures as “PDB.” The POSITIONS column shows the residues included in a structure (red box). Clicking on “RCSB-PDB” (indicated by black arrow) opens the corresponding entry in the PDB (here 4ES0, shown under IDENTIFIER). (B) The PDB page for 4ES0. The “Global Stoichiometry” (red box, bottom left) shows that this entry is composed of two different protein chains (Hetero 2-mer). Clicking on the “3D view” button (red box, top left) opens the interactive Mol* 3D structure viewer.\n5. Click on the RCSB-PDB link in the “LINKS” column to be taken to the corresponding entry on the PDB website (Fig. 8B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0008]).",
    "Reading the title of the PDB entry and the abstract of any associated publication can provide useful information about the structure. Details about the content and composition of the PDB structure can be found under “Global Stoichiometry” in the left panel, “Biological Assembly” (Fig. 8B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0008]), and in the “Macromolecules” section below. In our example, the structure is a heterodimer composed of two interacting protein molecules: WDR5 (chain A) and SETD1B (chain B).\n6. To interactively visualize the 3D structure with the PDB Mol* viewer, click on the 3D View tab at the top (Fig. 9A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0009]).\nThis viewer operates similarly to the AlphaFold Structure Viewer but offers additional options in the right-hand menu. By default, the structure shows the secondary structural elements, with color-coding for different protein chains. As in the AlphaFold viewer, the atomic view of residues and their interactions can be activated by clicking on the residue in the structure or in the sequence above. Mouse over the structure to obtain a window (bottom right) with residue information. The PDB Mol* viewer can also be accessed directly from the PDB (at https://www.rcsb.org/3d-view[href=https://www.rcsb.org/3d-view] or through the “Visualize” Tab in the top banner at https://www.rcsb.org[href=https://www.rcsb.org]). The “Import” > “Open Files” > “Select files…” button at the top right of the viewer can be used to load locally stored PDB files. Clicking on “Apply” will visualize them.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/cddea570-f868-42ff-b706-a01ef71a317d/cpz1857-fig-0009-m.jpg</p>\nFigure 9\nMol* 3D structure viewer. (A) Interactive window showing the SETD1B sequence in the sequence viewer (red box). (B) Clicking on Arg1748 in the sequence viewer (notice that the numbering differs from that of UniProt) zooms the structure view onto this residue, and shows it and surrounding residues in ball-and-stick representation. Ionic and polar contacts are shown as dashed lines. The structure also contains water atoms (red spheres) that contribute to interactions.",
    "7. Identify the chain for your protein of interest. In the menu on top of the structure viewer, you can select the sequence of this chain to be displayed. For this example, click on “2: Histone-lysine N-methyltransferase SETD1B” to see its amino acid sequence (Fig. 9A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0009]). In our case, this is a very short sequence because only a small fragment of SETD1B is included in the structure. Then identify your residue of interest.\nThe numbering of the amino acids in the structure may not always match that given by UniProt for your chosen isoform, and you may need to identify the residue of interest within its surrounding sequence.\n8. Once you have identified your residue, click on it to zoom in and see it in a ball-and-stick representation along with any nearby residues that may be in contact.\nAnalysis\n9. Assess the function of the wild-type residue in its 3D context, and the effect of the substitution.\nIn our example, we can see that Arg1748 is important for the interaction with WDR5 because it forms multiple intermolecular hydrogen bonds with nearby residues (Fig. 9B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0009]). Substituting it with a smaller cysteine would abolish these bonds. We conclude that Arg1748Cys disrupts the interactions of SETD1B with WDR5.",
    "Homology modeling, a precursor to AI-based modeling, infers the structure of a target protein by projecting its sequence onto the known 3D structure of a similar protein (the “template”). Although the accuracy of AlphaFold and other AI-based programs surpasses that of homology modeling, we found the SWISS-MODEL homology modeling server (Waterhouse et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-bib-0066]) to be useful for identifying ligands, cofactors, protein-protein interactions, and potentially different conformational states of a protein.\nIn this protocol, we will use the AGTPBP1 Arg918Trp variant as an example to illustrate how SWISS-MODEL can be used to provide structural information on substrates, ligands, and protein multimers.\nNecessary Resources\nHardware\nComputer with internet access\nSoftware\nStandard internet browser\nFiles\nAmino acid sequence of your protein in FASTA format\nPreparation\n1. Follow steps 1-4 of the Basic Protocol to identify the consensus sequence to use (Q9UPW5-1) and gather functional information about AGTPBP1 and Arg918.\nMapping\n2. Go to SWISS-MODEL (https://swissmodel.expasy.org[href=https://swissmodel.expasy.org]) and click on the “Start Modelling” button on the left side of the screen.\n3. Obtain the amino acid sequence of your protein and paste it in the corresponding field.\nTo copy the AGTPBP1 sequence in the correct format, go to the “Sequence & Isoforms” section of UniProt entry Q9UPW5 and click on “Copy sequence” for the sequence titled Q9UPW5-1. Paste the amino acid sequence into the “Target Sequence(s)” field in SWISS-MODEL and enter a title for your project in the “Project Title” field.\n4. Click on “Search For Templates” to search for possible template structures.",
    "After a few minutes, the potential template structures will be shown as “Template Results” (Fig. 10[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0010]). Selected templates will be shown in the structure viewer on the right. The viewer has several functionalities that can be accessed in the bottom right panel. Mouse over the structure to get residue information on the top right of the viewer.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/cc330945-bc55-45b7-8300-dd2a3f134774/cpz1857-fig-0010-m.jpg</p>\nFigure 10\nList of potential templates found by SWISS-MODEL. Examine their properties, such as the oligomeric status in the \"Oligo State\" column and the bound ligands in the \"Ligands” column. Select the template(s) for modeling (checkboxes on the left) and click “Build Models.” More details are available by clicking on the red template name (here: 4b6z.1.A; highlighted by the right dashed rectangle with arrowhead).\n5. Explore the templates’ characteristics and quality in the “Template Results” page.\nThe “Template” tab provides information on sequence coverage and identity of the template structures. Templates with <20% sequence identity may not be reliable. Templates are sorted by GMQE score, with the best score preselected and displayed in the structure viewer window (in our example, it is the AlphaFold model with 100% sequence identity and coverage). Clicking on additional templates in the “Sort” column displays their aligned structures and includes their sequence in the “Alignment” tab. The “Quaternary Structure” and “Sequence Similarity” tabs provide an overview of these features for all templates. Clicking on the red structure identification code under the “Coverage” tab opens a window with more information about this structure (Fig. 10[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0010]). For models other than AlphaFold's, the first four characters of the red identification number represent the PDB accession number. You can paste this number into the PDB database to access the PDB entry for this template (see Alternate Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-prot-0002]).",
    "6. To explore the oligomeric state of the templates, sort them by “Identity” and inspect the “Oligo State” column (excluding the AlphaFold model, which is always a monomer).\nIn our example, the top-ranked templates cover the C-terminal carboxypeptidase domain, which includes Arg918. Most of the templates with a sequence identity >20% are monomers. The “Quaternary Structure” tab provides a visual summary that supports the probability of the protein being a monomer (Fig. 10[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0010]). If a homo-multimeric template is chosen, click on the downward-pointing arrow beneath the checkbox to reveal more information about the template, and choose whether you prefer the model to be a homo-multimer or a monomer. The SWISS-MODEL may produce the homology model in this oligomeric state.\n7. To explore small molecule ligands, inspect the “Ligand” column (excluding the AlphaFold model).\nIn our example, most monomeric templates have a bound zinc ion (1 x Zn), a ligand also suggested by UniProt for AGTPBP1. If you select a zinc-containing template (here we chose 4b6z.1.A), SWISS-MODEL will build a model with zinc in the corresponding position.\n8. Click on the “Build Models” field above the structure viewer to make one model for each selected template.\n9. After the model(s) is (are) completed, go to the results section by clicking on the “Models” tab at the top. The QMEANDisCo Local score plot and colored cartoon representation will be shown for your models (Fig. 11A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0011]).\nIn our example, the figures show that the residues surrounding the zinc-binding site have good model confidence (QMEANDisCO > 0.6). Thus, SWISS-MODEL suggests that AGTPBP1 uses zinc as a cofactor for the catalytic domain.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/9c929404-7a2d-49f5-9987-83ffe06ec68d/cpz1857-fig-0011-m.jpg</p>\nFigure 11",
    "Homology model for AGTPBP1, based on PDB template 4B6Z. (A) The “Model Results” page shows the quality scores for the model on the left. The \"QMEANDisCO Local\" plot and the colored cartoon on the right show a good confidence in the area surrounding the binding site, marked by a yellow triangle in the structure and red rectangle in the sequence (QMEANDisCO > 0.6). Clicking on the question marks brings up detailed information about each quality score. Click on the downward arrow next to “Model-Template Alignment” to display the alignment of your sequence to the selected template and per-residue quality scores (B). Clicking on Arg918 in the sequence shows this residue as a ball and sticks model in the structure viewer. The zinc ion appears as a gray sphere.\n10. Click on the downward arrow next to “Model-Template Alignment” to see the alignment of model sequence versus template sequence, with the respective quality scores. If the residue numbers are not showing, you may resize this panel to have a better view of the sequence.\n11. Select your residue of interest in the model sequence to see a closer look of the positioning and structure of this residue in its 3D context (Fig. 11B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0011]).\nFrom this visualization, we can confirm that Arg918 is part of the loop that binds to the zinc molecule. You may have to rotate the model by clicking and dragging with your mouse to get a better view.\nAnalysis\n12. Assess the function of the wild-type residue in its 3D context, and the effect of the substitution.",
    "As observed in the model and discussed in steps 14 and 15 of the Basic Protocol, Arg918 plays an important role in stabilizing the binding site for the zinc cofactor. The replacement of this residue by a large, nonpolar tryptophan is likely to result in steric clashes with the surrounding residues.\n13. For better visualization, you may download the model to your computer by clicking on the “Model 01” button in the “Models” section and selecting “PDB Format.” This file can be then opened in more versatile structure viewers such as PDB Mol* viewer (see Alternate Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-prot-0002], step 5) or PyMOL (see Alternate Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-prot-0005]).",
    "Atypical isoforms, truncations, or protein-protein complexes may not be precalculated by AlphaFold or accessible through the PDB or SWISS-MODEL. In these situations, ColabFold can be used to produce structures of single and multiple protein chains. ColabFold is a free platform that provides accelerated prediction of protein structures and complexes using AlphaFold (Mirdita et al., 2022[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-bib-0030]). It is hosted by Google Colaboratory, making protein folding accessible to researchers who lack the resources to install and use AlphaFold locally.\nAs an example, we will use ColabFold to analyze the Cys206Tyr and Val155Met variants of the STING1 protein in monomeric and dimeric conformations, respectively.\nNecessary Resources\nHardware\nComputer with internet access\nSoftware\nStandard internet browser\nPreparation\n1. Go to the UniProt page for human STING1 (UniProt ID Q86WV6; https://www.uniprot.org/uniprotkb/Q86WV6/entry[href=https://www.uniprot.org/uniprotkb/Q86WV6/entry]). Scroll down to the “Sequence” section.\nThis section shows a single isoform for this protein. The residues Val155 and Cys206 are present in this sequence.\n2. Gather functional information on the gene from UniProt.\nLook at the different sections described in Basic Protocol, step 4. STING1 is a facilitator of innate immune signaling, which acts as a cytosolic viral and bacterial DNA sensor and promotes the production of type I interferon (M. A. Alghamdi et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-bib-0005]). Importantly, STING1 is known to form homodimers (Ouyang et al., 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-bib-0035]), and it has many other binding partners reported by UniProt. It also has a transmembrane domain from residues 18 to 134. Gain-of-function mutations in STING1 have been described to cause an autoinflammatory syndrome termed SAVI (STING-associated vasculopathy with onset in infancy; M. A. Alghamdi et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-bib-0005]). The SAVI phenotype is characterized by widespread chronic inflammation affecting primarily the skin and lungs (Melki et al., 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-bib-0029]).\nMapping\nAccessing ColabFold",
    "3. We recommend accessing ColabFold through its GitHub page (https://github.com/sokrypton/ColabFold[href=https://github.com/sokrypton/ColabFold]) to stay updated on notebook changes and resource additions or modifications (Fig. 12[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0012]). Once on that page, scroll down to the notebooks section and click on the first ColabFold notebook (currently: AlphaFold2_mmseqs2). This will open a Google Colaboratory page in your browser where you can run the code and make predictions.\nA free Google account is required to use Google Colaboratory. This protocol focuses on using the AlphaFold2_mmseqs2 notebook for easy protein structure and complex prediction for single protein chains and homo or heteromeric complexes.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/b83f20cd-8cc3-4e7e-838f-2fdc93001cdb/cpz1857-fig-0012-m.jpg</p>\nFigure 12\nList of notebooks available in the ColabFold GitHub page.\nPerforming predictions in single protein chains\n4. Obtain the sequence for the isoform of interest from the UniProt entry page.\nGo to the sequence identified in step 1, and copy it to the clipboard by clicking on the “Copy sequence” button (Fig. 13A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0013]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/d05d607f-eda7-4fb5-984d-49183faa532a/cpz1857-fig-0013-m.jpg</p>\nFigure 13\nMaking a monomeric model with ColabFold. (A) In the UniProt “Sequence & Isoforms” section, click on “Copy sequence” (red box). (B) Paste the sequence into the ColabFold “query_sequence” field (red box). Provide a title in “jobname” (yellow box), and set the “num_relax” and “template_mode” parameters.\n5. To run ColabFold in default mode, go to the AlphaFold2_mmseqs2 notebook (step 3), and paste the protein sequence into the “query_sequence” field of the first section titled “Input protein sequence(s)…”. Assign a name to your job in the “jobname” field (Fig. 13B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0013], yellow rectangle).\nLeft with the default parameters, the notebook will produce five models without “relaxing” side-chain clashes through molecular dynamic simulation, and without using known structures as templates. This mode provides a quick overview of the tertiary and secondary structure and allows for a general evaluation of AlphaFold's performance on this sequence.",
    "6. In the “Input protein sequence(s)” section, set the “num_relax” parameter to either 1 (only the best-scored model will be relaxed) or 5 (all models will be relaxed). This last option takes considerably longer, but if you want to look at the conformations of amino acids in atomic detail, you should always look at a relaxed model. Changing the “template_mode” from “none” to “pdb100” in the same section may improve performance when sequences lack sufficient known homologues but have a close structure deposited in the PDB.\nColabFold also provides many other “Advanced settings”; however, changing these is normally not required.\n7. To run ColabFold, go to the Menu on the top of the notebook (below the notebook name, AlphaFold2.ipynb), click on “Runtime,” and then click on “Run all.”\n8. Once your job is finished (which can take anywhere from a few minutes to a few hours), scroll down to the “Run prediction” section to evaluate the results (Fig. 14A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0014]).\nFirst check the sequence coverage. Without structural templates (“template_mode”: “none”), AlphaFold usually requires at least 30 homologous sequences in the multiple sequence alignment (MSA) to perform well (Jumper et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-bib-0022]). Individual models will appear in two representations: On the left, color-ramped from N-terminal (blue) to the C-terminal (red) for monomers and colored per chain for multimers, and on the right, colored by confidence (pLDDT). A good prediction should show folded protein regions in blue; flexible regions may appear in yellow or red.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/a2d83faa-bc39-42f1-8af7-53a790550c40/cpz1857-fig-0014-m.jpg</p>\nFigure 14",
    "Evaluating the results of the ColabFold run for the STING1 monomer. (A) Top: Overview of homologous sequences identified. A per-residue sequence coverage (i.e., depth of MSA) of >30 is usually required for confident AlphaFold modeling. Bottom: Calculated 3D model. (B) Interactive 3D visualization of the predicted model in pLDDT coloring with the ColabFold “Display 3D structure” function. Cys206 is shown in orange sticks in the top inset, along with its substitution by Tyr (black sticks). Steric clashes are represented by disks. Vall155 and the substitution by Met are shown in the bottom inset. The inset figures were produced with PyMOL (see Alternate Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-prot-0005]). (C) PAE plots (top) and pLDDT score per residue (bottom right) are shown for the five calculated STING1 models (rank_1 to rank_5). Bottom left: MSA depth.\n9. Assess the produced models with the interactive 3D protein viewer in the “Display 3D structure” section (Fig. 14B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0014]).\nBy default, the best-ranked model is displayed; others can be visualized by changing the “rank_num” to the corresponding model. The “color” option allows you to change from coloring by “lDDT” (which is the same score as pLDDT) to coloring by protein “chain” (useful for multimers) or by “rainbow,” i.e., the same N- to C-terminal coloring as above. In addition to the secondary structure ribbon, side chains or main-chain atoms can be displayed.\n10. Evaluate the quality scores in the “Plots” section. This section displays the PAE plots, sequence coverage, and pLDDT.",
    "The PAE plots use a blue-red color scheme instead of green-white as in the AlphaFold database, but are otherwise the same (see Basic Protocol, step 8). In our example, the PAE for the STING1 model in monomeric conformation is low for positions 1-350 (blue) and high for the rest of the protein (red). Accordingly, the sequence coverage and pLDDT plots are low for the last 50 residues. This indicates that the protein core has been predicted with high confidence, whereas the C-terminal 50 residues are most likely disordered (Fig. 14C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0014]).\nAnalysis\n11. Once the run is finished, a compressed folder containing all of ColabFold's generated files will be automatically downloaded to your computer. You can then analyze the Cys206Tyr and Val155Met variants using the downloaded PDB files with structure viewers such as Mol* (Alternate Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-prot-0002], step 6) or PyMOL (Alternate Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-prot-0005]).\nCys206 is located in an ordered region within the protein structure. Its substitution by Tyr introduces steric clashes that might destabilize the structure of the helical bundle in contact with it (Fig. 14B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0014], top inset). In contrast, the variant Val155Met does not seem to affect the structure of the monomer (Fig. 14B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0014], bottom inset). However, the functional relevance of protein variants depends on their biological context. In the next section, we will see how an amino acid substitution with no prominent effects in a monomeric conformation is potentially damaging for the dimeric configuration.\nPerforming predictions for multimers",
    "ColabFold also allows the analysis of homomultimers (multiple copies of the same protein chain) and heteromultimers (complex of different proteins). The process is similar to single-chain predictions, with slight differences in interpreting the results. As an example, we will model a homodimer of STING1 to analyze the gain-of-function Val155Met variant (Jeremiah et al., 2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-bib-0005]). To do so, we perform the steps above with variations in some steps as described below.\nPreparation\n12. Follow steps 1 and 2 of this protocol to obtain the sequence and functional information for STING1. Open the AlphaFold2_mmseqs2 notebook as described in step 3.\nMapping\n13. To model a homodimer (a protein complex consisting of two identical chains), paste the monomer sequence once into the “query-sequence” field. Then add a colon character “:” and paste the same sequence once again after the colon (Fig. 15A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0015]). Run as described in steps 6-10.\nMore than two chains can be modeled with ColabFold; however, the number of total residues that you will be able to model is dependent on the memory limits of the allocated GPU. On the free version of Colab, this limit is typically 1000-2000 residues.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/52f73648-77e7-4801-a704-e2fec1636be3/cpz1857-fig-0015-m.jpg</p>\nFigure 15\nMaking a multimeric model of STING1 with ColabFold. (A) Configuring a basic run for a homodimer of STING1. (B) Same as Figure 14C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0014] except for the STING1 homodimer. Black lines separate each monomer in the plots. Dark blue off-diagonal sections in the PAE plot indicate confidence in the interactions between protomers (yellow boxes in rank_1 model). (C) Visualization of the dimeric model colored by chain (left) and pLDDT (center). The inset shows the position of Val155 in orange sticks and its 3D context close to the interface with the second subunit (white cartoon). The substitution by Met (black sticks) was done with PyMOL (see Alternate Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-prot-0005]).",
    "14. Assess the quality of the modeled chains and their predicted interactions.\nFor the dimer, the PAE plots will show black lines separating the two chains. The PAE plots show the expected position error at residue “x” when the model and the (theoretical) true structure are aligned at residue “y.” Blue indicates low expected error; red indicates high expected error. There is one PAE plot for each of the five complex models calculated. As in the case of monomeric models, the regions along the diagonal contain the PAE for each monomer, while the off-diagonal regions indicate the PAE for interchain contacts. An off-diagonal field with low PAE (blue) indicates confidence in the relative arrangement of the individual chains. The sequence coverage and pLDDT predictions also show both sequences, concatenated one after the other, with continuous residue numbering. The higher the pLDDT, the better. In this example, the “Sequence coverage” plot shows that the C-terminal portions have good MSA depth and the N-terminal portions have lower depth (Fig. 15B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0015]). This is mostly informative and can help explain why certain regions of the protein are modeled with lower confidence than others.\nAnalysis\n15. As for the monomer, once the run is finished, all of ColabFold's files will be automatically downloaded to your computer in a compressed folder. The variants can be then analyzed from the PDB files with structure viewers such as Mol* (Alternate Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-prot-0002], step 6) or PyMOL (Alternate Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-prot-0005]).",
    "In a dimeric conformation, Val155 lies within the dimerization region of the C-terminal tail domain (CTD), where it is at the center of a hydrophobic network between the two subunits. Val155 is located in a hydrophobic helix (α5) of the CTD domain that forms intermolecular interactions also involving helix α7. As this is a gain-of-function variant, we can hypothesize that the Val155Met substitution is likely to stabilize the network of interactions with the opposing Met271 from the same subunit and Trp161 from the other subunit (inset in Fig. 15C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0015]). This would then mimic the effect of ligand binding by reinforcing the stability of the dimer (Jeremiah et al., 2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-bib-0020]; Melki et al., 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-bib-0029]).\nIn the case of Cys206Tyr, the observed effect in the dimer conformation is similar to the effect in the monomer and is characterized by the presence of clashes distorting the protein 3D structure.",
    "The web-based structure viewers integrated in the AlphaFold or the PDB databases are sufficient for many types of structural analysis. However, specialized stand-alone visualization programs present additional tools for variant analysis and preparation of illustrative figures for presentations or manuscripts. This alternate protocol summarizes useful functions for variant analysis with PyMOL. For more features and alternative approaches, see the PyMOL support and Wiki pages at https://pymol.org/2/support.html[href=https://pymol.org/2/support.html]. As an example for this protocol, we will once again look at the Arg918Trp variant in the AGTPBP1 gene.\nNecessary Resources\nHardware\nComputer with internet access, 3-click mouse\nSoftware\nPyMOL molecular visualization software. See step 3 below for installation instructions\nFiles\nPDB file(s) with the atomic coordinates of your protein(s) of interest\nPreparation\n1. Follow steps 1-4 in the Basic Protocol to identify the consensus sequence to use (Q9UPW5-1) and gather functional information about AGTPBP1 and Arg918.\nMapping\n2. Download the AGTPBP1 model from the AlphaFold database (https://alphafold.ebi.ac.uk/entry/Q4U2V3[href=https://alphafold.ebi.ac.uk/entry/Q4U2V3]).\nInstall PyMOL\n3. There are three ways to install PyMOL on your operating system:\n         \nPurchase and download the pre-compiled program (or installer for Windows) from https://pymol.org/2/#download[href=https://pymol.org/2/#download].\nDownload the “Educational-use-only” PyMOL from https://pymol.org/edu/[href=https://pymol.org/edu/]. This version is freely available to teachers and high school and college students. It is easy to install, but lacks certain features, including those required to create high-quality figures for publications.\nInstall full PyMOL for free under an open-source license (https://pymolwiki.org/index.php?search=install&title=Special%3ASearch&go=Go[href=https://pymolwiki.org/index.php?search=install&title=Special%3ASearch&go=Go]). This requires the use of the command line.\nLoad and display your PDB structure\n4. Launch the PyMOL application and load your PDB file.",
    "Load the protein structure that you downloaded in step 2 into PyMOL by dragging and dropping the model PDB file from your file explorer application into the PyMOL viewer. Alternatively, you can use the menu bar at the top (Fig. 16[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0016], 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0001]), select “File” > “Open,” and locate your PDB file or use the command prompt (Fig. 16[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0016], 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0002]) and type “load /path/to/your/model.pdb”.\nBy default, the structure will appear as a green secondary structure cartoon on a black background. The structure will be named after the PDB file in the Object Control Panel on the right side (Fig. 16[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0016], 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0003]). Clicking on an object in the Objects List will show or hide it. Use the pop-up menus next to an object name to manipulate its display: “A,” Action; “S,” Show; “H,” Hide; “L,” Label; and “C,” Color.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/57678305-f7d7-4cb0-a999-713b56c249c8/cpz1857-fig-0016-m.jpg</p>\nFigure 16\nVisualization and analysis of the AGTPBP1 AlphaFold model in PyMOL. (A) Arg918 and surrounding residues are shown as stick models, overlaid on the secondary structure cartoon representation. The model is colored by atom type, with carbons of Arg918 shown in dark yellow and other carbons shown in light green. Hydrogen bonds are shown as yellow dashed lines. 1, Top screen menu bar; 2, command prompt; 3, Object Control Panel; 4, access to stored scenes.\n5. To change the representation style of the object, click on the “S” menu of the object, to the far right, and choose from options such as lines, sticks, ribbon, cartoon, dots, spheres, mesh, surface, and more.\nSelecting more than one option will show all these representations simultaneously. To hide them, click on the “H” menu, followed by the representation you want to hide.",
    "6. For publication-quality figures, we recommend using a white background. To do so, go to the top menu bar and select “Display” > “Background” > “White.”\n7. To change the color of your object, click on the “C” menu and choose from the available colors. We recommend color-coding the protein by element. Select “C” > “by element” and choose the first option (“HNOS”).\nCarbon atoms will remain in the color of the backbone, nitrogen atoms will be blue, oxygen red, and sulfur yellow.\n8. To color AlphaFold models by their pLDDT score as in the AlphaFold database, type the following commands in the command prompt:\nrun https://raw.githubusercontent.com/cbalbin-bio/pymol-color-alphafold/master/coloraf.py\ncoloraf\n<model_name>\nWithout the model_name argument, all objects currently loaded in the PyMOL session will be colored in that way. Note that files from other sources, e.g., the PDB, cannot be colored in this way because they do not contain pLDDT scores.\n9. If the loaded PDB contain include hydrogen atoms (which is not the case for precalculated AlphaFold structures), we recommend removing them for clarity by going to “A” > “hydrogens” > “remove.”\n10. To manually orient your structure, it is best to use a three-button mouse.\nRotation: Click and drag the left mouse button to rotate the molecule and view it from different angles.\nTranslation: Click and drag the middle mouse button (or scroll wheel) to translate the molecule and move it within the viewport. Alternatively, you can hold down the Command or Option keys and move your cursor.\nZoom: Scroll forward or backward to zoom in or out on the molecule. Alternatively, you can hold the Ctrl key and click and drag the right mouse button to zoom.\n11. Save your session as a PyMOL session (.pse) file by clicking on “File” > “Save Session.”",
    "PyMOL's undo feature (Ctrl+Z) is limited to only some actions, so regularly save any modifications that you want to keep. You can also save all object activity information, all atom-wise visibility, color, representations, and the global frame index of your current view in a scene. To save a scene, type in the command line: “scene name_of_scene, store” (replacing “name_of_scene” with the reference name you want to use for that scene). To retrieve this scene, click on the name of the scene at the bottom left of the structure window (Fig. 16[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0016], 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0004]).\nVisualize the residue of interest\n12. Display the one-letter-code sequence of the residues in the PDB file by clicking on the salmon-colored “S” in the menu on the bottom right of the window (Fig. 17[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0017], 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0001]).\nAlternatively, choose “Display” > “Sequence” in the top menu bar. Activating “Display” > “Sequence Mode” > “Residue Names” displays the sequence in three-letter code.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/66267806-b97a-46d9-bf40-6719b4a05ce1/cpz1857-fig-0017-m.jpg</p>\nFigure 17\nMutagenesis of Arg918 (orange carbons) into Trp (black carbons) in PyMOL. Steric clashes are represented by disks. 1, Functional buttons that allow exploration of different rotamers using arrows and displaying the sequence using \"S\"; 2, mutagenesis tool menu.\n13. Click on the residue of interest in the sequence field (use the gray horizontal scroll bar just below it if needed). After making this selection, a “(sele)” tab will appear in the Object Control Panel.\nMaking another selection will override this object. Therefore, it is good practice to rename the “(sele)” object by clicking on “A” > “rename selection.” It will prompt “Renaming sele to: sele_” at the top left of the PyMOL Viewer. Erase the existing name, type the desired name for your selection (here, “Arg918”), and click Enter.",
    "14. To center and/or zoom on the residue, use the commands “A” > “center” or “zoom” next to the “Arg918” selection object. Show this residue as stick model by selecting (Arg918) “S” > sticks.\n15. For our example, we colored the “AF-Q9UPW5-F1-model_v4” object in pale green (“C” > “greens” > “palegreen”), and “Arg918” in orange (“C” > “orange” > “brightorange”). Color-code the protein by element by selecting “C” > “by element” > “HNOS” next to the “AF-Q9UPW5-F1-model_v4” object (Fig. 16[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0016]).\nShow interactions\n16. To identify residues close to Arg918, click on Arg918 (either in the structure window or the sequence pane). Then rename the new object “(sele)” into “Arg918_contacts” as described above.\n17. For the object “Arg918_contacts,” click on “A” > “modify” > “expand” > “by 6 A, residues” (the range within which we want to identify interacting residues).\n18. Show these contacts as sticks (“Arg918_contacts” > “S” > “sticks”).\n19. To show the H-bonds between the contact residues, go to the “Arg918_contacts” selection, and click on “A” > “find” > “polar contacts” > “within selection.” A new object “Arg918_contacts_polar_conts” will appear showing the H-bonds as yellow dashed lines.\n20. To see the distance in angstroms for the identified contacts, go to “Arg918_contacts_polar_conts” > “S” > “labels.” To hide them, use “H” > “labels.”\n21. You can save the scene as “Arg918_contacts” (in the command line: “scene Arg918_contacts, store”).\nMutate a residue\n22. To perform in silico mutagenesis on a protein, first make sure that you have no active selection by clicking into the empty space next to the structure. Then, go to “Wizard” > “Mutagenesis” > “Protein” in the top menu bar. In the Mutagenesis menu (Fig. 17[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0017], 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0002]), click on “No Mutation” and select the amino acid that you want to mutate to (“TRP” in this example).",
    "23. Click on Arg918 to mutate it into tryptophan. This will create a “mutation” object in the right-side object list.\n24. The mutated side chain can be shown in different rotamers (i.e., preferential conformations) by using the arrows of your keyboard or the left arrow (\"<\") and right arrow (\">\") buttons at the bottom right of the screen.\nThe frequency of each rotamer in other protein structures is given in percent next to the “mutation” object. Different rotamers will show different “strains” in the log window at the top left, with higher strain values indicating more steric clashes. These clashes are visualized as disks, with green indicating atoms very close together or slightly overlapping and red indicating substantial overlap. Other disk colors lie between those extremes. The larger the disk, the greater the extent of overlap between atoms. Yellow dashed lines show remaining H-bonds and distances between atoms.\n25. The “mutation” object can be colored by going to “mutation” > “C.”\n26. Clicking on “Apply” in the “Mutagenesis” menu (right side, lower half of the screen) will substitute the wild-type residue with the mutated residue as shown. However, to illustrate the effect of a variant, we recommend making a figure showing both residues by rendering the view without clicking “Apply” (Fig. 17[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0017]; see steps 30 and 31, below).\nHandle multiple chains\n27. In the sequence pane, if the model has multiple chains, they are displayed one after the other in a horizontal chain sequence. Each chain is identified by a Chain ID, such as “A,” “B,” “C,” “D,” etc., in the format /<Chain_ID>/<Number…> followed by its residue positions. This is not the case for our AGTPBP1 model.",
    "Each chain can be displayed in a distinct color for easier visual differentiation. To manipulate individual chains, go to “Display” > “Sequence Mode” > “Chain identifiers” and click on the desired chain. Rename the “(sele)” object to a reference name of your choice to target and work with a specific chain.\nLoad multiple models\n28. PyMOL allows you to load and analyze multiple protein models in the same display. To load additional models, use the load command followed by the path to the model file, or drag and drop the PDB file into PyMOL (see step 4).\n29. Once you have loaded multiple models, you can align them by clicking on the model you want to align and going to “A” > “align” > “to molecule (*/CA)” and selecting the target model.\nSave images of your render\n30. To emphasize what is in the foreground of your model, you can adjust the “fog.” To do this, hold down the shift key and right mouse button and drag the mouse to the sides to adjust the rear clipping plane. Drag the mouse toward or away from you to adjust the front clipping plane.\n31. Once satisfied with the figure, click on the “Draw/Ray” button at the top right of the window and then choose your preferred figure dimensions. To adjust the ratio between them, uncheck the “Lock aspect ratio” box. Check “Transparent background” if desired. For publication-quality images, click on “Ray (slow)” to start rendering. Once complete, you are prompted to “Save Image to File” (as a .png file) or to “Copy Image to Clipboard.”\nAnalysis\n32. Assess the function of the wild-type residue in its 3D context, and the effect of the substitution.",
    "As discussed in steps 14 and 15 of the Basic Protocol, Arg918 plays an important role in stabilizing the binding site for the zinc cofactor. By mutating this residue to a tryptophan as described in steps 22 and 23, many steric clashes are introduced (Fig. 17[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.857#cpz1857-fig-0017]). These clashes are likely result to in irreparable damage to the structural integrity of the aforementioned binding site."
  ],
  "subjectAreas": [
    "Human Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}