{
  "id": 18715,
  "origin_website": "Jove",
  "title": "A Murine Model of Irreversible and Reversible Unilateral Ureteric Obstruction",
  "procedures": [
    "General Guidance: Animal experiments were performed in accordance with the guidelines and regulations imposed by the Animals (Scientific Procedures) Act 1986. This protocol and the accompanying video protocol are for both a standard UUO and a R-UUO, which can be performed on many mouse strains. In the accompanying video, both procedures are performed on male C57BL/6 mice aged 8 weeks. The data presented in the representative results section were obtained from male FVB/n mice.\nNOTE: This protocol and accompanying video details how to perform a standard UUO and R-UUO utilizing the left ureter, however the same techniques can easily be applied to the right ureter.\n1. Animal Preparation and Laparotomy\nPerform all procedures with sterile (autoclaved) instruments and consumables.\nInject ketamine hydrochloride (70mg/kg) and medetomidine hydrochloride (1mg/kg) intraperitoneally to anesthetize the mouse. Note: The duration of the resulting anesthetic plane is 4 hr and no supplemental anesthesia is required.\nConfirm the depth of anesthesia by loss of reflexes e.g., toe pinch.\nRemove all hair surrounding the incision area and prepare the abdominal skin for surgery via application of a dilute chlorhexidine solution.\nPlace the mouse on a heated surgical pad in a supine position and fix the limbs to the pad using low-tack adhesive tape.\nDuring the procedure, monitor the mouse for signs of thermal burns as a result of the heated surgical pad. If possible use a non-electric heat source.\nAdminister analgesic by a subcutaneous injection of buprenorphine hydrochloride (0.06mg/kg) and apply eye lubricant to prevent corneal drying.\nMake a midline laparotomy and an incision of the avascular linea alba using tissue separating scissors to gain access to the peritoneal cavity.\nDrape the mouse and insert a colibri retractor into the incision.\n2. Unilateral Ureteric Obstruction",
    "Using sterilized cotton buds expose the left ureter by displacing the intestines towards the right side of the abdominal cavity and cover them with moistened drapes.\nUsing angled forceps isolate and lift the left ureter.\nTo create a ureteric obstruction, ligate the left ureter twice with 6/O black braided silk suture anywhere between the bladder and renal pelvis. For long term experiments, use absorbable suture for all abdominal surgeries. Alternatively, a ligating clip can be applied to the ureter.\nTo isolate the bladder from the ureter, divide the ureter between the two sutures.\nCarefully replace the intestines into the peritoneal cavity.\nFollow the steps listed in Section 4 – Post-Operative Recovery and Care to close the incision and reverse the anesthesia.\n3. Preparation for Reversible Unilateral Ureteric Obstruction\nPrepare a mouse for surgery and isolate the left ureter as detailed in Steps 1.1 to 2.2 above.\nTo create a ureteric obstruction that can be reversed, ligate the left ureter twice with 6/O black braided silk suture close to the bladder. Leave one end of the upper suture long as this will be used to anchor the soft walled plastic tubing in place around the ureter.\nMake a longitudinal slit in a 5mm length of soft walled plastic tubing such that it can be splayed open to allow it to be applied to the ureter. Any soft walled silicone plastic tubing, with an internal diameter of 1mm and external diameter of 2mm, can be used.\nPlace the soft walled plastic tubing gently around the ureter. Ensure that the long suture emerges from the center of the slit in the tubing once it is closed around the ureter.",
    "Place a length of 6/O black braided silk suture around the soft walled tubing enclosing the ureter and tie once. Now place the long end of the suture, emerging from the center of the slit in the tubing, longitudinally across the tubing such that it lies on top of the previously tied suture.\nTie the suture located around the tubing twice to anchor the tubing and the long suture end in place around the ureter.\n\tNote: To prevent adhesion formation on the ureter and the soft walled plastic tubing, an adhesion reduction solution can be applied to the area around the tubing.\nCarefully replace the intestines into the peritoneal cavity.\n4. Post-Operative Recovery and Care\nClose the peritoneum with blanket stitch using 5/O black braided silk suture and approximate the skin using metallic skin clips.\nTo minimize the risk of post-operative infection, apply an antiseptic such as iodine/alcohol solution to the abdominal skin.\nPartially reverse anesthesia with atipamezole hydrochloride (2mg/kg) subcutaneously.\nAdminister fluids by a subcutaneous injection of 1 ml warmed saline.\nMonitor the mouse until it has recovered consciousness.\nAllow the mouse to recover in a heated box kept at 29 °C for 24 hr. Moistened food can also be provided to encourage fluid and nutrition intake.\nLeave the mouse to recover to induce a desired level of obstruction, typically 7 days.\nFor long-term recovery experiments, provide ongoing analgesics. If the mouse is to be recovered for longer than 7 days, remove the skin clips 7 days following surgery.\nOnce the desired level of obstruction has been induced, either reverse the UUO, as described below, or euthanize the mouse by cervical dislocation and collect the kidneys for histopathology analysis.\n5. Reversible Unilateral Ureteric Obstruction",
    "To perform a R-UUO prepare a mouse, which has undergone preparation for R-UUO, for surgery as described in steps 1.1 to 1.7.\nIf present, remove the skin clips and divide or remove the sutures in the peritoneum to gain access to the abdominal cavity. Note: If the ureter has been obstructed for a long-term experiment skin clips should have been removed 7 days following application.\nPrepare the mouse and isolate the left ureter as described in steps 1.8 to 2.2.\nUsing angled forceps, free the soft walled plastic tubing from any granulomatous tissue which may have formed.\nCut the suture holding the plastic tubing around the obstructed ureter with a scalpel and remove the tubing.\nConfirm successful UUO by assessing for the presence of hydronephrosis in the left kidney, the kidney should also appear pale.\nDivide the ureter between the sutures.\nPlace the remaining length of ureter, attached to the kidney, on a small piece of sterile gauze. This will be used to collect the urinary sediment and dead cells that will drain from the ureter and renal pelvis once the suture is removed.\nDivide the ureter above, but near, the suture and allow the kidney to drain onto the gauze. Leave the lower suture, closest to the bladder, intact. This is to ensure that no urine will leak from the bladder and into the peritoneal cavity.\nOnce the ureter and renal pelvis have been drained, apply a long 6/O black braided silk suture to the end of the remaining length of ureter. This will be used to aid the ureter to bladder anastomosis performed later.\nFollow the steps below to anastomose the remaining length of ureter into the bladder:\n\t\nTurn the ureter such that it lies anterior to its original position and lies over the kidney.",
    "Place a single 9/O polyamide monofilament tacking suture 2 mm from the end of the ureter such that it emerges in the direction of the bladder. Take care to ensure that the suture remains in the muscular coat and does not enter the ureter lumen. The tacking suture will be used to anchor the ureter in the bladder.\nTo create a channel through the bladder, pass a 21G needle diagonally through the bladder such that it exits towards the frontal (ventral) wall of the bladder.\nRest an eyed needle in the bevel of the 21G needle. Use the 21G needle to guide the eyed needle through the bladder. The eyed needle will be used to take the ureter through the bladder.\nPass the 9/O tacking suture, applied to the ureter in step 5.11.2, through the first incision in the bladder and out through the bladder wall adjacent to the entry point. Once the ureter is passed through the bladder this will be tied to anchor the ureter to the bladder.\nPlace the long 6/O black braided silk suture applied to the end of the ureter in step 5.10 through the eyed needle.\nCarefully withdraw the eyed needle out of the bladder whilst ensuring that the ureter is also pulled through the bladder.\nOnce the ureter emerges from the bladder remove the eyed needle and apply a clamp to the long suture at the end of the ureter to prevent retraction back into the bladder.\nTo anchor the ureter within place in the bladder, tie the 9/O polyamide monofilament tack suture, applied in step 5.11.5.\nApply additional single 9/O polyamide monofilament tie sutures as described in steps 5.11.2 and 5.11.5 at two locations around the entry point to firmly anchor the ureter within the bladder.",
    "Using the back of opened scissors, push the bladder wall back slightly to expose more of the emergent ureter.\nDivide the ureter above the long suture located at the end of the ureter. The ureter should retract into the body of the bladder. It is usual to observe urine flowing out of the opening in the bladder, confirming the open lumen of the ureter.\nClose the exit wound in the bladder with a 9/O polyamide monofilament suture.\nCarefully replace the intestines into the peritoneal cavity.\nProvide post-operative care as detailed in steps 4.1 to 4.8.\nAllow the mouse to recover until the kidney is decompressed, typically 7 days.\nAt the experimental end point, euthanize the mouse by cervical dislocation and collect the kidneys for histopathological analysis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}