{
  "id": 11313,
  "origin_website": "Jove",
  "title": "Decellularization and Recellularization of Whole Livers",
  "procedures": [
    "1.   Liver Decellularization\nHarvest a rat liver with portal vein cannulation using and 18-gauge catheter. Leave the inferior and superior vena cava open. Keep the organ hydrated in phosphate buffered saline (PBS) in a 10-cm petri dish.\nSet up a perfusion system that consists of 8-liter reservoir, peristaltic pump and a bubble trap.\nFill the perfusion system with phosphate buffered saline and keep it running for 10 minutes. Fill PBS into a 10-cm petri dish and reduce the flow rate of phosphate buffered saline to 1  mL/min.\nCarefully transfer the harvested liver to the phosphate buffered saline filled 10-cm petri dish.\nContinue with PBS perfusion overnight.\nStart perfusion with 0.01% (w/v) sodium dodecyl sulfate (SDS) in distilled water for 5 minutes.\nPerfuse with PBS for 1 hour.\nRepeat steps 1.6 and 1.7 three more times increasing the SDS perfusion time to 10, 15 and 20 minutes at each time.\nContinue perfusion with 0.01% (w/v) SDS for 24 hours.\nContinue perfusion with 0.1% (w/v) SDS for 24 hours.\nPerfuse with 0.2% (w/v) SDS for 3 hours.\nPerfuse with 0.5% (w/v) SDS for 3 hours.\nPerfuse with distilled water for 15 minutes.\nPerfuse with 1% (w/v) Triton X-100 in distilled water for 30 minutes to remove any bound nucleic acids.\nTo wash the decellularized liver matrix (DLM), perfuse with PBS for 2 hours.\nOptional: Resect all lobes except the median lobe.\nStore the DLM in a clean and sealed Petri dish soaked in PBS at 4oC until ready to use (Figure 1).",
    "To sterilize the DLM: 1) Flush the DLM with sterile PBS containing 0.1% (v/v) peracetic acid and 4% (v/v) ethanol and incubate for 3 hours at 4oC. 2) Wash with sterile PBS 2 times. 3) Wash with sterile PBS containing 2% penicillin-streptomycin, 10ug/ mL gentamicin, and 2.5 ug/ mL amphotericin B. Store the decellularized liver in the same solution at 4oC until ready to use for recellularization experiments.\n2.   Recellularization of Decellularized Liver Matrix\nSet up a perfusion system that consists of a perfusion chamber, peristaltic pump and a bubble trap under sterile conditions. Fill the perfusion system with 200  mL of culture medium, e.g., high glucose DMEM (Sigma), 10% fetal bovine serum (Hyclone,), 100 U  mL-1 penicillin, and 100 μg  mL-1 streptomycin (Invitrogen).\nPlace the decellularized liver matrix in the perfusion chamber and connect the DLM to the perfusion system through the portal vein cannula while the pump is running at 5  mL/min to avoid formation of any air bubbles.\nAllow perfusion of the medium through the DLM for 30 minutes.\nIsolate primary hepatocytes from an adult rat with at least 90% viability.\nStop the flow in the perfusion system and slowly inject 50 million hepatocytes (in 1-3  mL of culture medium) into perfusion system through the bubble trap.\nStart the flow at 10  mL/min and recirculate the medium for 10 minutes.\nRepeat steps 2.5 and 2.6 until a total of 200 million cells are introduced into the DLM (Figure 2)6.\nOnce all the cells are perfused into the DLM, collect the perfusate into four 50-ml centrifuge tubes and centrifuge at 600 rpm for 10 minutes. Discard the supernatants and collect the pellets into a single tube. Determine the number of cells and viability via trypan blue exclusion to determine the seeding efficiency.",
    "3.   In Vitro Culture of the Recellularized Liver Graft\nSet up a perfusion system that consists of a perfusion chamber, peristaltic pump, oxygenator and a bubble trap under sterile conditions (Figure 3). Fill the perfusion system with 50  mL of culture medium, e.g., Williams' E (Sigma), 5% fetal bovine serum (Hyclone,),0.5 U  mL-1 insulin (Eli Lilly), 20 ng  mL-1 EGF (Invitrogen), 14 ng  mL-1 glucagon(Bedford Laboratories),7.5 μg  mL-1 hydrocortisone (Pharmacia), 100 U  mL-1 penicillin, and 100 μg  mL-1 streptomycin (Invitrogen).\nPlace the recellularized liver graft in the perfusion chamber and connect the DLM to the perfusion system through the portal vein cannula while the pump is running at 5  mL/min to avoid formation of any air bubbles.\nAseptically close the perfusion chamber and seal tightly to avoid any leakage during culture.\nTransfer the perfusion system to an incubator that is 37oC and has 10% CO2 and increase the perfusion flow rate to 15  mL/min.\nConnect the oxygenator to a 95% O2 and 5% CO2 gas mixture tank and set the gas flow rate to 0.5 liters/min. This should achieve an oxygen partial pressure of approximately 400 mmHg.\nThe culture may continue up to 10 days with daily changes of culture medium. The culture medium may be sampled daily for monitoring of liver functions of the graft such as albumin, urea and total bile acid secretion. At the end of the culture period, the recellularized liver graft may be sampled for molecular and histological analysis.\n4.   Representative Results:",
    "The complete decellularization of a rat liver takes about 72 hours using the described protocol. The resulting matrix retains 100% of the fibrillar collagen, 50% of the glycosaminoglycans and only 5% of the DNA of the native liver (Table 1)6. The vascular structure of the matrix is preserved as evidenced by corrosion casting and scanning electron microscopy analysis (Figure 4)6. The presence of the vascular microarchitecture within the DLM facilitates its repopulation with cells with an efficiency of 96% and its subsequent perfusion for in vitro culture. The recellularized liver graft may be cultured up to 10 days in vitro and displays proper liver functions as confirmed via albumin, urea and total bile acid secretion (Figure 5)6.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2394/2394fig1.jpg\nFigure 1. Decellularized liver matrix at the end of the decellularization process. (a) the whole liver (b) the median lobe after resection.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2394/2394fig2.jpg\nFigure 2. Schematic representation of the recellularization of the DLM.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2394/2394fig3.jpg\nFigure 3. Perfusion system setup for in vitro culture of the recellularized liver graft.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2394/2394fig4.jpg\nFigure 4. The microvascular structure is retained in the decellularized liver matrix. Corrosion cast images of a) a normal liver b) a decellularized liver, portal (red) and venous (blue) vasculature. Scanning electron microscopy images of the DLM c) a vessel, d) a section featuring bile duct-like small vessels (arrows), Scale bars (a,b) 5 mm (c,d) 20 μm.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2394/2394fig5.jpg\nFigure 5. Liver specific functions of the recellularized liver graft during the in vitro perfusion culture. a) albumin secretion (p = 0.5249), b) urea production (p = 0.5271) and c) total bile acid secretion (p = 0.0114). Statistical analysis of the difference between the experiment and the control was done over the 10 d culture period by Friedman's test at a = 0.01. Error bars represent s.e.m. (n = 3).\ntable:\n﻿0,1,2,3,4",
    ",Fresh livera,Decellularized liver matrixa,p-values,% of fresh liver\n,n = 4,n = 8,p-values,% of fresh liver\nCollagen,0.07 ± 0.01,0.08 ± 0.03,0.56,114%\n(mg per g liver),0.07 ± 0.01,0.08 ± 0.03,0.56,114%\nGlycosaminoglycans,73.1 ± 6.7,34.2 ± 2.9,0.004,47%\n(mg per g liver),73.1 ± 6.7,34.2 ± 2.9,0.004,47%\nDNA,14.9 ± 5.6,0.44 ± 0.08,3.3 10-5,2.9%\n(mg per g liver),14.9 ± 5.6,0.44 ± 0.08,3.3 10-5,2.9%\nTable 1. The biochemical composition of the decellularized liver matrix compared to the native liver.\naValues are represented as mean ± s.e.m.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}