{
  "id": 12292,
  "origin_website": "Jove",
  "title": "Using RNA-sequencing to Detect Novel Splice Variants Related to Drug Resistance in In Vitro Cancer Models",
  "procedures": [
    "1. Characterization of Drug Resistance Profiles through Cytotoxicity Assays\nLeukemic Cell Line Culture\nMaintain the parental T-cell ALL cell line CCRF-CEM (CEM-WT) as well as its drug resistant sublines, including CEM/R30dm, CEM-R5 and CEM-C3, in 25 cm2 in 10 ml RPMI-1640 medium containing 2.3 µM folic acid supplemented with 10% fetal calf serum and 100 units/ml penicillin G and 100 µg/ml streptomycin.\nCulture the cells in a humidified atmosphere at 37 °C in a 5% CO2 incubator.\nAllow cell growth to concentrations between 2 - 3 x 106 cell/ml.\nSplit the cells twice a week at an initial concentration of 0.3 x 106 cells/ml (e.g., if the cell concentration is 3 x 106 cells/ml, transfer 1 ml cell suspension in a new flask containing 9 ml fresh medium). Discard the culture after 20 consecutive passages.\nPancreatic Carcinoma Cell Line Culture\n\tNOTE: Maintain the human pancreatic carcinoma cell line Panc-1 in 75 cm2 culture flasks in 10 ml DMEM medium with high glucose and L-Glutamine supplemented with 10% fetal bovine serum and 100 units/ml penicillin G and 100 µg/ml streptomycin. The drug resistant variant, Panc-1R, is cultured in the same culture medium containing 1 µM gemcitabine dissolved in sterile water. Further details are provided in 24.\n\t\nCulture the cells at 37 °C in a 5% CO2 incubator.\nSplit the cells every 2 - 3 days at a ratio of 1:5 when cells reach confluence of about 90%.\nTo split the cells, wash the twice with phosphate buffered saline (PBS), add 1 ml of Trypsin/EDTA per 75 cm2 culture flask and incubate at 37 °C for 3 min.\nAdd 9 ml medium and harvest the detached cells in a 15 ml tube. Seed 2 ml cell suspension in a new flask containing 8 ml medium. Discard the culture after 20 consecutive passages.",
    "MTT Assay for Leukemic Cells\nPrepare in advance the MTT solution: dissolve 500 mg of MTT formazan in 10 ml PBS and stir (protected from light) with a magnetic stirrer for approximately 1 hr. Sterilize the solution with a 0.22 µm filter. NOTE: The solution can be stored in 10 ml aliquots at −20 °C. Protect from direct light after thawing.\nPrepare in advance the acidified isopropanol: add 50 ml of 2 M HCl to 2.5 L of isopropanol. NOTE: Store the solution for at least one month at room temperature before use. If the isopropanol is not acidified correctly, it might form precipitates with the medium and compromise the spectrophotometric readout.\nPrepare a separate 96-well flat bottom \"Day 0\" (control) plate to ensure more accurate estimation of growth inhibition: dedicate 3 to 6 wells per cell line, add 30 µl of growth medium and 120 µl of cell suspension (8,000 cells) per each well and 150 µl of growth medium to wells corresponding to blanks (no cells). Proceed from step 1.3.9 to step 1.3.13 of this section to measure the optical density (OD). NOTE: Further details are provided in 4.\nPrepare a 96-well flat bottom experimental plate: dedicate 30 wells to drug concentrations (10 concentrations, each in triplicate), 10 wells to control cells and 10 wells to control medium without cells (blanks) and prepare a drug dilution range of dexamethasone (Dex) using Dimethyl Sulfoxide as a solvent.\n\t\tNOTE: For CEM-WT cells the Dex dilution range is between 2 µM and 0.97 nM. For CEM/R30dm, CEM-R5 and CEM-C3 cells the Dex dilution range is between 640 µM and 0.33 nM.\nAdd 30 µl from each Dex dilution into an appropriate well of the 96-well plate. Make sure to include each concentration in a triplicate.",
    "Add 30 µl of growth medium to wells corresponding to control cells and 150 µl of growth medium to wells corresponding to blanks.\nHarvest exponentially growing cells and resuspend at their optimal seeding concentration.\n\t\tNOTE: In order to determine optimal starting cell concentrations, it is recommended to assess the growth profile of each cell line cell line in a 96-well plate by seeding cells at several concentrations and measuring it daily for at least 4 days. Choose a seeding concentration which prevents overgrowth of cells after 72 hr, as this will influence the experiment by saturating the OD values. For CEM-WT, CEM-C5 and CEM-R5 the optimal seeding concentration is 8,000 cells/well, while for CEM/R30dm it is 5,000 cells/well.\nAdd 120 µl of cell suspension to each well containing either the drug solution or the growth medium (wells corresponding to control cells). Fill the empty outer wells of the plate with 150 µl PBS to ensure good humidity in the plate and incubate the plates for 72 hr at 37 °C with 5% CO2 in a cell culture incubator.\nAdd 15 µl of the MTT solution to each well and shake the plate for 5 min with a plate-shaker up to a maximum of 900 shakes/min.\nPlace the plates back at 37 °C with 5% CO2 in a cell culture incubator and incubate for another 4 - 6 hr.\nAdd 150 µl of the acidified isopropanol to each well and mix well with a multichannel pipette to thoroughly resuspend all the formazan crystals. Start with the blank wells and make sure to rinse the tips well before proceeding to another row of the plate.\nIncubate the plate at room temperature (RT) for 10 min.",
    "Using a microplate reader, determine the OD at 540 and 720 nm to ensure an accurate measurement by correcting for background OD. Then save data in a spreadsheet file and analyze it4.\nSRB Assay for Pancreatic Carcinoma Cells\nDissolve SRB reagent in 1% acetic acid at final concentration of 0.4% (w/v).\nDissolve trichloroacetic acid (TCA) in ultrapure water at final concentration of 50% (w/v).\nDissolve Tris(hydroxymethyl)-aminomethane in ultrapure water at final concentration of 10 mM.\nPrepare a separate 96-well flat bottom \"Day 0\" control plate to ensure more accurate estimation of growth inhibition: seed 6 wells with cells growing in exponential phase in 100 µl medium at appropriate seeding concentration and add 100 µl medium only to wells corresponding to blanks. Incubate overnight at 37 °C with 5% CO2 to ensure proper adhesion of the cells to the plate. Then add 100 µl medium to all the wells and proceed to steps 1.4.8 - 1.4.16 of this section.\nPrepare a 96-well flat bottom experimental plate: seed cells growing in exponential phase in triplicate in 96 wells flat bottom plates at the appropriate density in 100 µl of medium by using a multichannel pipet.\n\t\tNOTE: In order to determine optimal starting cell concentrations, it is recommended to assess the growth profile of each cell line cell line in a 96-well plate by seeding cells at several concentrations and measuring it daily for at least 4 days. Choose a seeding concentration which prevents overgrowth of cells after 72 hr, as this will influence the experiment by saturating the OD values. For Panc-1 and Panc-1R cells, the optimal seeding concentration is 8000 cells/well.\nAdd 100 µl medium to medium-only wells and incubate overnight at 37 °C with 5% CO2 to ensure proper adhesion of the cells to the plate.",
    "Prepare a drug dilution range of gemcitabine between 1 µM and 10 nM for Panc-1 and 1 mM and 100 nM for Panc-1R cells. Add 100 µl from each dilution into an appropriate well of the 96-well plate by using a multichannel pipet. Make sure to have each concentration in triplicate. In addition, add 100 µl medium to the medium-only wells and the control cells. Incubate at 37 °C with 5% CO2 for 72 hr.\nAdd 25 µl cold TCA solution to the wells by using a multichannel pipet and incubate the plates for at least 60 min at 4 °C in order to precipitate and fix the proteins at the bottom of the wells.\nEmpty the plate by removing the medium and dry briefly on a tissue.\nWash 5 times with tap water, then empty the plate and let dry at room temperature.\nAdd 50 µl SRB solution per well by using a repeat-pipet and stain for 15 min at room temperature.\nEmpty the plate by removing the SRB stain.\nWash 4 times with 1% acetic acid, then empty the plate and let it dry at room temperature.\nAdd 150 µl Tris solution per well by using a multichannel pipet and mix for 3 min on a plate-shaker up to a maximum of 900 shakes/min.\nRead the optical density at 540 nm (or 492 nm if the OD values are too high).\nAnalyze the data.\nData Analysis for MTT and SRB Assays\nCalculate the OD values of cells at \"Day 0\" using the following formula: ODDay 0 = ODcontrol cells - Average ODblank wells",
    "Calculate the percentage of surviving cells for each drug concentration according to the following formula: % Treated cells = Average [ODtreated cells - Average ODblank wells - ODDay 0]/[ODcontrol cells - Average ODblank wells - ODDay0]*100\nPlot the dose-response curve (drug concentration vs. growth inhibition in %).\nCalculate the concentration of the drug which inhibits the growth of cells by 50% (IC50) using the dose-response curve.\n2. RNA Isolation and Library Preparation for RNA-sequencing\nSample Collection and RNA Isolation\nFor CEM cells: harvest 106 cells directly from culture medium.\nFor Panc-1 and Panc-1R: remove medium, wash the cells twice with PBS and detach by adding trypsin-EDTA and incubating at 37 °C for 3 min. Add culture medium and harvest 106 cells.\nSpin down samples at 300 x g for 3 min, remove supernatant and extract total mRNA using commercially available silica membrane spin columns, by following the manufacturer`s protocol.\nDetermine the concentration and purity of total RNA by using a UV-Vis spectrophotometer.\n\t\tNOTE: RNA is considered of high purity if the 260 nm / 280 nm absorbance ratio is above 1.8. The samples can be stored at - 80 °C.\nAssess total RNA integrity by electrophoresis of 200 ng of sample on 1% agarose gel stained with ethidium bromide.\n\t\tNOTE: The detection of two intact bands corresponding to mammalian 28S and 18S rRNAs at approximately 2 kb and 1 kb in size is indicative of good total RNA integrity.\nSequencing Library Preparation\nUse 2 µg of total mRNA per each sample. Follow mRNA library preparation protocol according to manufacturer's instructions.\nDetermine quality and concentration of each library by using a bioanalyzer system. Pool the libraries in a single sample up to a final concentration of 10 nmol/L and measure it with the bioanalyzer.",
    "Use high-throughput sequencing system with Single Read 100 bp mode.\n\t\tNOTE: Read length of > 80 bp is necessary for identifying transcriptional isoforms.\n3. Detection of Differential Splicing from Sequencing Reads\nAlignment of Reads to Reference Genome and Quality Check\nCompile a gene annotation (.gtf file) from the NCBI refGene table using UCSC table browser (25,963 genes).\nPerform annotation-aware gapped alignment of sequencing reads to the reference genome (GRCh37) using STAR.\nSort and index the resulting alignment files with picard tools.\nPerform post-mapping quality control by using RSeQC and samtools.\nDifferential Splicing Detection between Sample Groups\nInstall Python and corresponding versions of NumPy and SciPy. Download and install samtools. Download and install bowtie and tophat,\nAdd the Python, bowtie, tophat and samtools directories to the $PATH environment variable. Download pre-built bowtie indexes (hg19). Download rMATS version 3.0.9.\n\t\tNOTE: Further details about rMATS are provided in 19 and 34.\nDetect alternative splicing events by comparing each Dex-resistant cell line to CEM-WT and Panc-1 to Panc-1R in separate MATS runs according to Figure 5A.\nTo detect differential splicing events from previously aligned sequencing reads (.bam files), run MATS using the commands from Figure 5B for CEM-WT vs. CEM- C3, CEM-WT vs. CEM-R5, CEM-WT vs. CEM/R30dm and Panc1 to Panc-1R comparisons.\n\t\tNOTE: MATS will create an output folder with two .txt files with results per type of splicing event analyzed (SE - exon skipping, A5SS - alternative 5' splice site, A3SS - alternative 3' splice site, MEX - mutually exclusive exons and RI - intron retention): one file containing results based on junction counts only and a second file with results based on junction counts and reads on target. Moreover, an additional .txt file with a result overview is generated in the same folder.",
    "For SE, A5SS, A3SS and RI import to spreadsheets the .txt files based on junction counts and reads on target. For MEX import the .txt files based on junction counts only.\n\t\tNOTE: MATS output file is sorted by ascending P-values and contains several parameters: gene ID, gene symbol, chromosome and strand position, genomic coordinates of the alternatively spliced fragments, counts as well as the length of inclusion and skipping forms for both analyzed samples, the length of inclusion and skipping form used for normalization, p-value, false discovery rate (FDR), inclusion level for each sample based on normalized counts and the differential inclusion score (average(IncLevel1) - average(IncLevel2)).\nSelect statistically significant candidate genes with an FDR<10% for further validation (e.g., DDX5 and PKM2).\nVisualize alternative splicing events with Integrative Genomics Viewer (IGV, https://www.broadinstitute.org/igv/), as reported in Figure 5.\n4. Validation of the Results by RT-PCR and qRT-PCR Assays\nPrimer Design\n\tNOTE: In order to provide a reliable validation of results obtained using the bioinformatic pipeline, the mRNA transcripts resulting from alternative splicing events are amplified by using RT-PCR and visualized by agarose gel electrophoresis of the PCR products. Cyanine green dye such as SYBR green qRT-PCR assay is used to quantify specific splice variants relative to a housekeeping gene. Figure 7 depicts the strategy applied to visualize the exon 12 skipping event of the DDX5 gene and to quantify the mutually exclusive exon 9 and exon 10 of the PKM gene.\n\t\nFor RT-PCR assay, design primer pairs which anneal to constitutive exons (exon 10 and exon 13) located upstream and downstream the alternative splicing sites (Figure 7A).",
    "NOTE: The amplicon size should cover between 100 and 800 bp in order to ensure a clear separation of the predicted PCR products on agarose gel. The annealing temperature of the primers should be between 55 and 65 °C and the GC content should not exceed 60%.\nCyanine green assay (Figure 7B).\n\t\t\nCheck the sequence homology of the two mutually exclusive exons and design two primer pairs each of which specifically and exclusively detects only one of the two splice variants.\n\t\t\tNOTE: For PKM, the reverse primer anneals to exon 11 common to both variants, while the forward primers are variant-specific and anneal to exon 9 (PKM1) or exon 10 (PKM2).\nIn order to detect DDX5 full-length gene, anneal the reverse primer within the skipped exon (exon 12).\n\t\t\tNOTE: For the specific detection of the DDX5 ΔEx12 variant, the reverse primer spans the exon11/exon13 boundary. Use the same forward primer which anneals to constitutive exon 10 for both reactions.\n\t\t\tNOTE: The amplicon size should be between 80 and 200 bp.\nFirst strand cDNA Synthesis\nSet up reverse transcription of 1 µg of the isolated RNA to cDNA by using 200 U/µl of Moloney Murine Leukemia Virus (M-MLV) reverse transcriptase in its reaction buffer diluted 1:5 with sterile water. Add DTT 1 µM, 0.05 µg of random hexamers, deoxynucleotide mix (dNTP) 1 mM, and 40 U/µl of ribonuclease inhibitor.\nVortex briefly and incubate the reaction mix at 37 °C for 2 hr.\nIncubate the reaction mix at 70 °C for 5 min to inactivate the reverse transcriptase, transfer the mix on ice and spin down by using a microcentrifuge. Samples can be used immediately or stored at - 20 °C.\nRT-PCR Reaction and Agarose Gel",
    "Set up the PCR reaction in a PCR tube per each sample by mixing 12.5 µl of 2x concentrated PCR mastermix, 1.25 µl of 10 µM forward primer and the same amount for the reverse primer up to a final volume of 25 µl with sterile water.\nAdd 1 µl of cDNA to the mix and place the tubes in the thermocycler. Run the program as follows: initial denaturation: 95 °C for 2 min. Reiterate the following steps for 35 cycles: denaturation at 95 °C for 25 sec; annealing at 52 °C for 35 sec; extension at 72 °C for 1 min. Set final extension at 72 °C for 5 min.\nPrepare 1% agarose gel by dissolving 1 g of agarose in 100 ml 1x TBE buffer. Add 2.5 µl of ethidium bromide to the solution. CAUTION: ethidium bromide is carcinogenic, handle with care by using a chemical fume hood.\nLoad the samples and run the gel in 1x TBE buffer at 100 V for approximately 30 min in an electrophoresis system.\nReveal the gel with a digital UV camera and save the image.\nqRT-PCR and Data Analysis\nSet up the Cyanine green PCR reaction per each sample by mixing 12.5 µl of 2x green PCR Mastermix, 2 µl of 5 µM forward primer and the same amount for the reverse primer up to a final volume of 15 µl with sterile water in a PCR tube. Prepare a mix for each specific splice variant to be detected (PKM1, PKM2, DDX5 full length, DDX5 ΔEx12) and for the housekeeping gene (GUS).\nLoad the mastermix on a white 96-well plate and prepare duplicates per each sample.",
    "Dilute the cDNA 10x in water, add 5 µl to each mix and place the plate in the thermocycler. Run the program as follows: initial denaturation: 95 °C for 5 min. Reiterate the following steps for 45 cycles: denaturation at 95 °C for 10 sec; annealing at 58 °C (for DDX5 and DDX5 ΔEx12 mixes) or 60 °C (for PKM1 and PKM2 mixes) for 20 sec. Set final extension at 72 °C for 20 sec. Set melting curve by applying a gradient from 65 to 97 °C.\nIn order to assess the specificity of the primer sets to their target, check the melting curves and verify that a single peak is formed per each primer set.\nCalculate the second derivative values of the amplification curves and export the cycle threshold values (Ct).\nCalculate the relative expression levels (REL) of the mRNA splice variants compared to the GUS housekeeping (reference) gene in each sample by using the \"delta Ct (ΔCt)\" method. The formula is: REL = 2-ΔCt, where ΔCt = Ct target splice variant - Ct reference gene\nIn order to quantify the relative abundance of splice variants, calculate the REL ratio by using the formula: Ratio REL ratio = RELsplice variant 1/ RELsplice variant 2.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}