{
  "id": 7499,
  "origin_website": "Bio",
  "title": "Transient Middle Cerebral Artery Occlusion with an Intraluminal Suture Enables Reproducible Induction of Ischemic Stroke in Mice",
  "procedures": [
    "Preparation Sterilize all surgical instruments, surgical tray, and materials prior to surgery.Note: Between same-day animal surgeries, soak instruments in 70% ethanol solution and rinse them with sterile water prior to the next surgery. Set and maintain the surgical station warming pad at 37°C.Place a new sterile cage on a slide warmer set to 37°C.Note: As mice are singly-housed post-MCAO, one cage will be needed per mouse. This cage will serve as housing during the occluding event and again upon completion of the procedure. Measure and mark the monofilament at distances of 6.5 mm and 10 mm from the tip of the coated end.Note: This step delineates the acceptable range for insertion length of the silicone rubber-coated monofilament. For visualization, we recommend using a metallic Sharpie to mark the monofilament. Confirm that marks are dry prior to starting the procedure. Weigh and record the baseline (i.e., pre-MCAO) weight of the mouse.Note: Baseline and post-operative weight values can be compared to evaluate post-stroke weight loss (e.g., as a percentage of baseline), as an indicator of mouse recovery. Surgery Place the mouse in the induction chamber. Using the Somnosuite Low-Flow Anesthesia System, deliver a 4-5% mixture of isoflurane in room air at ~500 mL/min to the induction chamber, to anesthetize the mouse. After the mouse has reached anesthetic depth, move the mouse to the nose cone and warming pad. Set the Anesthesia System to deliver a 1-2% mixture of isoflurane in room air at ~250 mL/min to the nose cone for the duration of the procedure.Note: Confirm anesthetic depth of the mouse by testing the toe-pinch reflex. Apply artificial tear ointment to the eyes of the mouse.Place the animal on its left side.",
    "Prepare the area between the right eye and right ear for an incision by cleaning the area with chlorhexidine and parting the hair (Figure 1A).Make an incision in the prepped area for the LDF optic fiber to be placed against the skull (Figure 1B).Note: Do not place the LDF optic fiber against the skull at this step. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220127/20220127200626_2592.jpgFigure 1. Make incision for LDF fiber. A. Prepare area between the right eye and right ear for incision. B. make a small incision in the prepped area. LDF, Laser Doppler Flowmetry.Place mouse in supine position and secure front legs to the warming pad with surgical tape.Shave the ventral neck. Clean the area by alternating with chlorhexidine and 70% ethanol; repeat cleaning sequence for a total of three times.Make a midline incision in the prepped ventral neck area. Blunt dissect to the left of the trachea (i.e., the animal’s right), moving the submandibular glands laterally. Continue the blunt dissection lateral to the sternohyoid and superiomedial to the sternocleidomastoid, until the carotid sheath is just visible (the vessel will be cleaned and exposed at a later step).At the center of the midline incision, thread a suture (6-0 black braided suture with needle) through the right superficial infrahyoid muscles and the adjacent skin overlaying the trachea. Tie two double knots. Pull the loose end of the suture taut and to the right, to increase the surgical field of view. Secure the suture to the warming pad with surgical tape. Repeat this process with the skin and underlying tissue on the left side of the ventral neck incision (Figure 2).Place the LDF optic fiber flat against the skull using the lateral incision made in Step B5 (Figure 2A-2B). Calibrate the LDF system and note the baseline value of cortical blood flow for the mouse.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220127/20220127200643_9760.jpgFigure 2.",
    "Make ventral neck incision and place LDF fiber against the skull. A. Lateral and B. ventral views of the neck incision pulled open with braided sutures, with the LDF fiber placed against the skull. C. Zoomed view of ventral neck incision pulled open. LDF, Laser Doppler Flowmetry.Locate the carotid sheath containing the CCA and vagus nerve (Figure 3A). Using blunt dissection, expose the CCA from within the sheath. Starting at the most proximal portion of the exposed CCA, blunt dissect up the vessel, coursing distally while cleaning structures from its walls. Take care not to injure the vagus nerve.Upon reaching the carotid bifurcation, continue with blunt dissection of the ECA.Branching laterally from the ECA is the occipital artery; leave this vessel intact.Blunt dissect the connective tissue at the lateral edge of the hyoid bone, to better expose the ECA.Branching medially from the ECA is the superior thyroid artery (STA); cauterize this vessel (Figure 3B-3C).Note: This prevents the STA from rupturing when the monofilament is manipulated from the ECA to the ICA. Blunt dissect the superior cervical ganglion from the CCA bifurcation, to fully expose the origin of the ICA (Figure 3D-3E).Note: This is an optional step that can aid in visualization and make it easier to manipulate the monofilament from the ECA to ICA. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220127/20220127214948_3184.jpgFigure 3. Expose CCA, ECA, and ICA.A. View of ventral neck incision before and B. after blunt dissection. C. Cauterize the STA with bipolar forceps. D. Detach the superior cervical ganglion at the carotid body from the carotid arteries. E. View of exposed CCA, ECA, and ICA after dissection. All images are ventral views oriented from rostral to caudal as depicted in panel B.",
    "CCA, common carotid artery; ECA, external carotid artery; ICA, internal carotid artery; STA, superior thyroid artery; SCM, sternocleidomastoid muscle; SH, sternohyoid muscle; CN X, vagus nerve.Slide two 6-0 black braided silk sutures underneath the ECA, such that the sutures are perpendicular to the vessel and parallel to one another. Grasping the more distal of the two sutures, create a loose knot around the ECA and gently slide it up the vessel, as far distal as possible. Tighten the suture knot to permanently ligate the ECA. Tape the ends of this suture to the nose cone, to gently pull the ECA taut (Figure 4A-4C).Using the other 6-0 black braided silk suture, tie a loose knot around the ECA. Slide the suture knot distally up the ECA toward the permanent ligature made in Step B14, but do not tighten; this suture will be further manipulated in Step B17.Place a curved micro clip across both the CCA and ICA, to block CCA blood flow from reaching the bifurcation and prevent backflow from the ICA (Figure 4D).Note: To ensure proper occlusion, confirm the only structures in the micro clip are the CCA and ICA; adjust/replace micro clip as needed. Move the loose suture knot (made in Step B15) proximally toward the origin of the ECA; do not tighten (Figure 4E).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220127/20220127215006_2116.jpgFigure 4. Prepare the carotid arteries for insertion of the monofilament.A. Place two black braided silk sutures under the ECA. B. With one suture, permanently ligate the most distal end of the exposed ECA. C. Tape the ends of the suture to the nose cone, pulling the ECA taut. D. Place a micro clip across both the CCA and ICA, to block blood flow at the carotid bifurcation. E.",
    "Using the remaining suture, tie a loose knot around the proximal end of the ECA near its origin. All images are ventral views oriented from rostral to caudal as depicted in panel B. ECA, external carotid artery; CCA, common carotid artery; ICA, internal carotid artery.Make an incision in the ECA between the two suture knots, approximately 2 mm proximal from the permanent ligation (distal suture knot) (Figure 5A). Insert the silicone rubber-coated tip of the monofilament into the ECA, directed toward the carotid bifurcation (Figure 5B). Position the loose suture knot such that it is around the portion of the ECA containing the coated tip; tighten the knot (Figure 5C).Note: The suture knot needs to be tight enough so that the monofilament won’t be pushed out of the ECA when the vessel is reperfused, but also loose enough so that the monofilament can be progressed through the suture knot at a later step. Remove the micro clip. Without cutting the monofilament, transect the ECA at the incision site, between the two suture knots, creating a proximal ECA stump containing the coated tip of the monofilament (Figure 5D-5E).Advance the monofilament from the ECA into the ICA, via the CCA bifurcation. Once the coated tip of the monofilament progresses through the suture knot, tighten the knot to prevent blood loss. Continue to advance the monofilament into the ICA until the LDF shows a 40-70% decrease in cortical blood flow from baseline, indicating occlusion of the MCA. Once MCA occlusion is confirmed, secure the monofilament in place by further tightening the suture knot around the ECA stump (Figure 5F-5H).Notes:  a. Confirm the monofilament has correctly advanced in the ICA and did not enter the pterygopalatine artery (PPA; branch of the ICA) (Figure 5G). b.",
    "Occlusion of the MCA is achieved when the LDF indicates a 40-70% decrease in cortical blood flow from baseline, typically correlating with an insertion length of 6.5-10 mm (Figure 5H-5I). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220127/20220127215029_8284.jpgFigure 5. Insert the monofilament into the ICA.A. Make a small incision in the ECA and B. insert the coated tip of the monofilament. C. Tighten suture knot around ECA containing the coated tip. D. Remove the micro clip, restoring blood flow to the CCA and ICA, and E. transect the ECA at the monofilament entry site. F-G. Advance the monofilament by way of the CCA bifurcation into the ICA, carefully avoiding the PPA, until the monitored cortical blood flow decreases by 40-70% of baseline, H-I. typically correlating with an insertion length of 6.5-10 mm (distance delineated by gold marks in figure). All images are ventral views oriented from rostral to caudal as depicted in panel C. ECA, external carotid artery; CCA, common carotid artery; ICA, internal carotid artery; PPA, pterygopalatine artery; CN XII, hypoglossal nerve.Trim the end of the monofilament so that it can fit just under the skin, when the ventral neck incision is closed.Note: Once the ventral neck incision is closed, the monofilament will be physically constrained by both the suture knot (made in Step B20) and the skin. If the suture knot loosens during the occlusion period, the additional physical constraint of the skin can help prevent the monofilament from moving out of the ICA/ECA. Close the neck with AutoClips; close the scalp incision with tissue adhesive (Figure 6).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220127/20220127215052_4090.jpgFigure 6. Close neck and scalp incisions.A-B. Temporarily close the ventral neck incision using AutoClips (ventral view). C-D. Close scalp incision with tissue adhesive (lateral view).",
    "Remove the mouse from the nose cone and place in new sterile cage during the ischemic event (either 30, 45, 60, or 90 min of occlusion time).Upon completion of the occlusion period, re-anesthetize the mouse and place it in a supine position at the nose cone.Remove AutoClips from the neck incision.To allow reperfusion of the MCA-territory, begin by grasping one side of the proximal ECA knot (tightened in Step B20) and, using another pair of forceps in the other hand, grasp the monofilament. Slowly retract the monofilament out of the ECA stump, and quickly tighten the suture knot around the ECA stump to prevent blood loss (Figure 7). Trim excess suture length, leaving a few millimeters on both sides of the knot.Notes:  a. Minor blood loss is to be expected upon removing the monofilament. b. When the monofilament is removed, the silicone rubber coating will remain in the proximal ICA. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220127/20220127215108_5352.jpgFigure 7. Remove the monofilament to allow reperfusion of MCA-supplied tissue.Remove the monofilament from the ECA and tighten the proximal ECA suture knot around the ECA stump. The silicone rubber coating from the monofilament tip will remain in the ICA. Image is a ventral view oriented from rostral to caudal as depicted. MCA, middle cerebral artery; ECA, external carotid artery; SRC, silicone rubber coating.Close the ventral neck incision with 6-0 braided absorbable sutures in a single interrupted suture pattern.Subcutaneously inject 0.5-1.0 mL of warm saline into the mouse, to facilitate recovery and account for any blood loss during surgery.Remove the mouse from the nose cone and place it back into the sterile cage. Allow the mouse to recover. Perform a visual neurological assessment.Note: Typical neurological deficits include hemiparesis, weakness, and lethargy. Post-operative Supportive Care Closely monitor the mouse for the first 4 h after surgery.",
    "Maintain mice on supplemented heat (e.g., using a slide warmer with temperature control) throughout the duration of the study.Note: After MCAO, rodents cannot thermoregulate (Barber et al., 2004). Supplemented heat promotes survivability. Provide mice with mash (i.e., wetted food) and hydrogel in Petri dishes on the cage floor, to encourage feeding/fluid intake.Note: Provide mash and hydrogel for at least 7-14 days post-surgery, or until the mouse is able to eat sufficiently from the standard cage feeder. This helps address multiple considerations including blood loss, post-operative weight loss, and consequences of ECA ligation. Change mash and hydrogel daily. If the mouse continues to have difficulty rearing/eating normally, provide mash throughout the duration of the study. Administer warm saline (subcutaneous injection) daily for the first 7 days. Monitor weight daily. If fluid intake is insufficient, or if dehydration is suspected, warm saline injections should continue past the first 7 days.Note: Take care to ensure saline is warm, not hot or cold, prior to injection. Warm saline helps reduce discomfort, factors in thermoregulatory issues, counters blood loss, and prevents dehydration. Dehydration can be assessed by performing a skin turgor test. Continue to closely monitor the mice daily following surgery, for the presence of surgical complications or signs of pain or distress (e.g., no grooming, penile prolapse, penile plugs) until euthanasia."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}