{
  "id": 11315,
  "origin_website": "Jove",
  "title": "A Microfluidic-based Hydrodynamic Trap for Single Particles",
  "procedures": [
    "The hydrodynamic trap consists of a two-layer hybrid (polydimethylsiloxane (PDMS) /glass) microfluidic device for particle confinement. Steps 1-2 describe fabrication of microfluidic devices, and Steps 3-4 discuss device design and operation.\n1. SU-8 Mold Fabrication (not shown in video)\nClean two silicon wafers (3\" diameter) with acetone and isopropyl alcohol (IPA).\nDry wafers with N2 and place them on a hotplate at 65°C for 1 min to remove residual moisture.\nSpin coat wafer #1 with SU-8 2050 photoresist (PR) for 30 sec at 4000 rpm to create a ~40 μm thick mold for the fluidic layer. Spin coat wafer #2 with PR for 30 sec at 1500 rpm to create a ~150 μm thick mold for the control layer.\nSoft bake wafer #1 at 65°C for 3 min and then at 95°C for 6 min. Soft bake wafer #2 at 65°C for 5 min and then at 95°C for 20 min.\nExpose wafers to UV with their respective masks (wafer #1: ports and fluidic channels, wafer #2: port and control layer) and appropriate exposure intensity (~150 mJ/cm2, ~260 mJ/cm2 respectively).\nPost bake wafer #1 at 65°C for 1 min and then at 95°C for 6 min. Post bake wafer #2 at 65°C for 5 min and then at 95°C for 10 min.\nDevelop wafers with propylene glycol methyl ether acetate (PGMEA) until uncured PR is removed. Rinse wafers with IPA and dry with N2.\n2. Microfluidic Device Fabrication\nSilanize the surface of the SU-8 molds by placing the wafers in a desiccator under vacuum for ~10 min with a glass dish containing a few drops of trichlorosilane. Surface silanization assists in peeling the (PDMS) replicas off the SU-8 molds.\nMix and degas PDMS in base:crosslinker ratios of 15:1 and 5:1 for the fluidic and control layers respectively.",
    "Spin coat the 15:1 PDMS mixture onto the fluidic layer mold (wafer #1) for 30 sec at 750 rpm and then place the wafer into a Petri dish. Place the control layer mold into a Petri dish and pour 5:1 PDMS mixture onto the mold to a thickness of ~ 4 mm.\nBake wafers/PDMS for 30 min at 70°C to partially cure the PDMS layers.\nAfter cooling down the wafers/PDMS to room temperature, cut the PDMS replica, which will form the control layer (wafer #2), from the Petri dish with a scalpel and peel it off the SU-8 mold. Hole punch an access port to the microchannel that will act as the on-chip membrane valve with a 21 gauge needle.\nPlace the PDMS replica with the control layer onto the wafer #1 (which has the spin-coated PDMS fluidic layer). Carefully align and seal the control layer to the fluidic layer using a stereo microscope. Make sure to remove all air pockets between the layers and bake at 70°C overnight to fully cure both layers. This baking step will result in a monolithic PDMS slab with two layers.\nAfter cooling to room temperature, cut and peel the PDMS replica containing both the control and the fluidic layers off the SU-8 mold using a scalpel. Remove excess PDMS and separate each device unit with a razor blade. Hole punch access ports to the microchannels in the fluidic layer with a 21 gauge needle.\nBond the PDMS slab to a coverslip to obtain a complete device. First, clean a coverslip (No: 1.5, 24 x 45 mm) with acetone and IPA. Next, treat both the coverslip and the PDMS replica surfaces with oxygen plasma under 500 mTorr for 30 sec, and immediately bring the two surfaces into contact to form an irreversible seal.",
    "Bake the devices overnight to increase bonding between the PDMS layers and the coverslip.\nSteps 3-4 describe implementing the hydrodynamic trap using the microfluidic device described above.\n3. Hydrodynamic Trap Experimental Setup\nPlace the microfluidic device onto the stage of an inverted microscope and secure it with stage clips.\nFill two gas-tight syringes separately with buffer and sample solutions and place them on a Harvard Apparatus Syringe pump (PHD 2000 Programmable). The buffer and the sample solutions are delivered to the microfluidic device through a 1 ml and a 250 μl syringe, respectively. Typically, a 50 mM Tris/Tris HCl buffer solution (pH 8.0) containing 0.02% v/v Triton X-100 is used as the buffer solution. The sample solution consists of a particle suspension (e.g. fluorescent polystyrene beads) in the buffer solution.\nEstablish the fluidic connections between the syringes (delivering the sample and the buffer) and the microfluidic device. Connect the syringes to 1/16\" outer diameter (OD) x 0.020\" inner diameter (ID) perfluoroalkoxy (PFA) tubing using luer-lock adapters. Connect the other end of the PFA tubing to the inlet ports of the microfluidic device with 24 gauge metal tubing. A T-valve can be placed between the sample syringe and the sample port on the microfluidic device to control sample delivery.\nEstablish the fluidic connections for the outlet channels in the microfluidic device. Connect the two outlet channels to PFA tubing (1/16\" OD x 0.020\" ID) by using 24 gauge metal tubing. The PFA tubing for the outlets should be of equal length. Submerge both outlet tubes into a 1.5 mL centrifuge tube filled with buffer solution, which serves to maintain a constant pressure drop between the syringes and the outlet channels.",
    "Fill the on-chip valve with fluorinated carrier oil using a 3 mL luer-lock plastic syringe to prevent air from leaking into the fluidic layer during operation. The air in the valve chamber is pushed through the PDMS membrane into the microchannel in the fluidic layer and later removed from the device with fluid flow through the outlet ports.\nConnect a pressurized inert gas (nitrogen) supply to the port in the control layer for on-chip valve operation. For this purpose, we use a nitrogen tank (2200 psi) and an electronic pressure regulator to supply 0-30 psi to the on-chip valve in the microfluidic device. The nitrogen tank is connected to the pressure regulator using ¼\" OD x 0.170\" ID tubing. The pressure regulator is connected to the microfluidic device through 1/16\" OD x 0.020\" ID PFA tubing with 24 gauge metal tubing at its terminus.\nRinse the fluidic connections and the microfluidic device with 0.5 mL of buffer solution to ensure that all the air bubbles are removed from the system including the outlet channels. Typical flow rates used for clearing bubbles range between 2000-5000 μL/hr. After the air bubbles are rinsed out of the microfluidic channels, reduce the flow rate to 50-100 μL/hr, which is a typical volumetric flow rate for particle trapping.\nAt this point, the fluidic connections are established, the sample and the buffer solutions are delivered to the microfluidic device at a fixed flow rate (50-100 μL/hr), and the device is ready for hydrodynamic trapping.\n4. Hydrodynamic Trapping Procedure\nRun the custom-built LabVIEW code, which automates particle trapping (see Usage Note for LabVIEW code below).",
    "Using the microscope x-y translation stage, position the trapping region (cross-slot) at the center of the camera view. Bring the trapping region into focus of the objective lens and adjust the camera settings to optimize imaging conditions.\nChoose a rectangular region of interest (ROI) within the camera's field of view such that the center of the ROI will be the position of the trap center.\nInitialize the offset pressure applied to the on-chip valve. In one of the outlet channels, a 100-200 μm wide constriction is introduced to provide an offset pressure for the on-chip valve. The constant off-set pressure enables the on-chip valve to adjust the stagnation point position in the vicinity of the center of the channel cross-slot. For most experiments, the offset pressure is set between 0-12 psi depending on the channel dimensions (height and width), the constriction width, and the specifications of the on-chip valve (valve size, membrane thickness, etc.).\nInitiate the feedback controller and adjust the proportional gain to optimize trap response. The feedback controller will adjust the pressure applied to the on-chip valve in order to move the stagnation point position, which minimizes the error or the distance between the particle position and the set point (trap center). Depending on the flow rate and the on-chip valve position, there is an optimal proportional gain value, which increases trap stability and eliminates unwanted particle oscillations.\nTrap a particle. The LabVIEW code will automatically trap one of the particles entering the trapping region. Once a desired particle is trapped, it is possible to shut off the sample flow and isolate the trapped particle in buffer solution, if desired.",
    "Monitor the trapped particle and maintain particle focus within the image plane using manual focus or an automated focus microscope setup. It may be necessary to slightly adjust the proportional gain of the feedback controller in order to ensure trap stability during the course of a long time-scale trapping event (minutes to hours).\nLabVIEW Code: Usage Note for Feedback Controller\nAutomated particle trapping is achieved using a linear feedback control algorithm implemented using a custom LabVIEW code. The LabVIEW code captures images from a CCD camera and transmits an electric potential (voltage) to a pressure regulator, which actively modulates the position (partially open/closed state) of an on-chip dynamic pneumatic valve. As the valve position changes, the hydrodynamic flow rate in one outlet line is adjusted, thereby re-positioning the stagnation point and enabling hydrodynamic trapping. The steps in the feedback loop are sequentially and iteratively executed at the rate of image capturing (10-60 Hz). The LabVIEW code executes the following steps during each feedback loop cycle:\nImage capture. An image is acquired for a \"target\" particle in the trapping region of the microfluidic device using fluorescence microscopy with a 10x objective lens (NA: 0.4) and a CCD camera.\nParticle tracking. Particle centroid position is determined, and the particle tracking algorithm is initiated. Particles are localized by fitting the emission intensity profile of the particle to a point spread function (PSF), from which the centroid position is determined.\nFlow field control. The updated pressure intended for the on-chip dynamic valve is calculated using a feedback control algorithm with a proportional controller. In this way, the action of the valve is to re-position the stagnation point, which exerts a hydrodynamic force on the particle in order to steer the particle toward the trap center.",
    "The LabVIEW code records the following data for every image captured during particle trapping: 1) time elapsed, 2) centroid (x,y) position of the trapped particle, 3) position of the trap center, 4) distance of the particle from the trap center, 5) pressure applied to the on-chip valve. In addition, the code also records a movie of the trapped particle in AVI file format.\n5. Representative Results\nWe trapped fluorescent polystyrene beads of various size (100, 540, 830 nm, and 2.2 μm diameter) using a hydrodynamic trap. Figure 1(a) shows an image of a particle trapped at the cross-slot junction in a microfluidic device. The trajectory of a trapped particle may be determined directly from the centroid position data recorded by the LabVIEW code during a trapping event or by tracking and localizing the trapped particle from the recorded movie file. Figure 1(b) shows the trajectory of a trapped particle (2.2 μm fluorescent polystyrene bead) along the outlet channel direction. The bead is initially trapped (squares) for 3 min and is then released from the trap and escapes along one of the outlet channels (circles). Particle trajectories along the compressional flow axis (inlet channel direction; data not shown) are similar to particle trajectories along the extensional flow axis (outflow direction) as shown in Figure 1(b). A histogram of particle displacement from the trap center for a trapped bead (2.2 μm diameter) along the outlet channel directions is shown in Figure 1(c). Using the feedback control algorithm described in this work, trapped particles are confined to within ±1 μm of the trap center along the inlet and outlet channel directions.",
    "A schematic of the microfluidic device used for hydrodynamic trapping is shown in Figure 2. The integrated microfluidic device consists of a fluidic layer and a control layer and is fabricated using standard multilayer soft lithography as described in this article. The fluidic layer contains the buffer and sample channels, as well as the cross-slot channel geometry to facilitate hydrodynamic trapping. The control layer consists of a pneumatic valve positioned above one of the outlet channels in the fluidic layer, and the control and fluidic layers are separated by a thin elastomeric membrane. During device operation, the valve in the control layer is pressurized with nitrogen gas, which forces the thin membrane into the fluidic layer, thereby inducing a constriction in the outlet channel. The dynamic pneumatic valve constricts the outlet channel by variable amounts by changing the pressure applied to the control layer, which adjusts the relative flow rates in the outlet channels and enables fine-scale control of the stagnation point.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2517/2517fig1.jpgFigure 1: Particle Trapping. (a) Image of a single bead confined in the hydrodynamic trap. In addition to the bead at the trap center, several untrapped beads are shown in the trapping region. (b) Trajectory of a trapped particle along the outlet channels (squares). When the particle is released from the trap (arrow), it escapes along one of the outlet channels (circles). (c) Histogram of displacements of a trapped bead (2.2 μm diameter) from the trap center along the outlet channels.",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/2517/2517fig2.jpgFigure 2: Schematic of microfluidic device for hydrodynamic trapping. The hydrodynamic trap is constructed using a two-layer microfluidic device. The fluidic layer consists of a sample inlet, four buffer inlets, and two waste outlets. The control layer consists of a pneumatic membrane valve situated on top of one of the outlet channels in the fluidic layer. A constriction in the opposing outlet channel provides an offset pressure for the pneumatic valve. Typical channel dimensions range between 100-500 μm. In region (A), sample inlet is flow focused by two buffer inlets. In region (B), opposing inlet streams converge at the cross-slot junction where trapping occurs. The pneumatic valve (C) is positioned on top of one of the outlet channels.  The stagnation point position is modulated by regulating pressure to this valve.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}