{
  "id": 12288,
  "origin_website": "Jove",
  "title": "Basic Methods for the Study of Reproductive Ecology of Fish in Aquaria",
  "procedures": [
    "1. Collecting and Transporting Live Fish\nNOTE: This protocol describes how to collect fish that possess a gas bladder, from a depth of ≥15 m to the surface. Rapid conveyance to the surface will induce expansion of the gas bladder by a change of pressure, which can seriously harm or kill the fish. Caution is warranted, as damage caused to the fish during this first step will negatively effect their survival and later behavior.\nPrior to diving with SCUBA, gather the following materials: a hand net suitable for capturing the targeted species underwater; double polyethylene bags that are large enough for the fish; rubberbands (ø 80 mm x 6 mm); an oxygen cylinder for inflating the collection bags at the surface; the Elbagin, which is an antimicrobial comprises 10% sodium nifurstyrenate; a polystyrene foam box in which to place the collection bags; pipettes; and, if necessary (refer to step 1.4), a rope with a length equivalent to maximum diving depth, as well as a weight of at least 2 kg.\nCollect the targeted fish species using a hand net while diving; while still underwater, place the captured fish in a polyethylene bag and tie the mouth of the bag with a rubberband. If it will take ≥1 day to transport the fish to an aquarium, also preserve water from the natural habitat in other bags, to be used for renewing the fish-keeping water.\n\tNOTE: For safety, the underwater tasks must be worked by at least two people.",
    "Surface from the collecting point with the bags of fish at a speed of no more than 1 m/min: while at a depth of 10 m or more, stop ascending for 1 - 5 min every 2 m; and from a depth of 10 m to the surface stop for 1 - 5 min every 1 m. When the captured fish are unable to maintain their buoyancy in the bag (i.e., if they float up with an expanded gas bladder while still trying to swim toward the bottom), either maintain same depth for 1 - 5 min or descend to 1 - 2 m deeper. Once the fish seem to recover their buoyancy, resume ascent to the surface.\n\tNOTE: If there is a possibility that the air in SCUBA tank will run out while ascending, fasten a rope to the polyethylene bag and attach a ≥2 kg weight; after underwater operator has safely ascended, pull this up to the surface at the same speeds stipulated above.\nAt beach or boat, dissolve 10 ppm Elbagin in the water of each polyethylene bag after surfacing.\n\tNOTE: Although some fish may not be able maintain their buoyancy just after being brought to the surface, most can be expected to recover within one day.\nIf the density of fish in a collecting bag is high, divide the fish among more bags to prevent from them damaging each other by rubbing against each other during transport. If the fish is an aggressive species, divide them individually between bags.\nInflate the collection bag with oxygen and again seal the mouth of the bag using rubberbands. When introducing the oxygen into the bag, lower the nozzle into the bag's water to increase the dissolved oxygen content; the fully expanded bag should be 1/4 full with water.",
    "Keep the collection bags with fish in a polystyrene foam box, to maintain a stable water temperature and decrease the fish's stress under dark conditions.\nIf it will take ≥1 day to transport the fish to an aquarium, once per day exchange 1/4 to 1/3 of the water in each fish-keeping bag, using water retained from the habitat to which has been added 10 ppm Elbagin, and repack each with oxygen. Each day, remove dead fish and excreta on the bottom by hand net or pipette.\n\tNOTE: If airplane transportation is involved, wait at least 1 day to acclimating fish to the air-pressure on surface before transportation because two steps pressure change (from underwater to surface, and surface to upper air) in the short term may be negatively affect the survival of the fish.\n2. Acclimating the Fish to an Aquarium\nFloat the bag containing fish in an aquarium for 30 min to equalize the water temperature.\nOver a 10 min period, incrementally exchange the bag water with aquarium water, to avoid shock caused by a sudden difference in water chemistry (e.g., pH, salinity).\n\tNOTE: A fish that becomes shocked by too great a difference in water chemistry may display an abnormal change in body color and/or behavior. Monitor this carefully during acclimation.\nDissolve 10 ppm Elbagin in the aquarium water.\nThereafter, once a day for 3 days, renew 1/3 of the aquarium water, having added 10 ppm Elbagin to the replacement water.\nFinally, begin to eliminate the Elbagin by exchanging half the aquarium water once a day, until the color fades.\n3. Injecting a Visible Implant Elastomer (VIE) Tag to Identify Individual Fish",
    "NOTE: In this work, individual fish are identified using VIE tags; for examples, refer to Frederick10, Olsen and Vøllestad11, and Leblanc and Noakes12. Also, if the study species is large enough to hold in a hand, the surgical table used in step 3.2 will not be necessary.\nDetermine the injection position and tag color for each individual. The safest option is to choose an injection point in the thick muscular dorsal or caudal part of the body, and to avoid injecting it into the abdomen where internal organs may be pierced.\n\tNOTE: A numbering system is described in Figure 1: if the study species is large enough for injection into 8 possible positions, this system will allow the identification of 154 individuals using a single color. Ten colors of VIE tags are available commercially. Choose the distinguishable color based on the body color of fish.\nFor fish that are smaller than can be held in the hand, prepare a surgical table as follows (refer also to Kinkel et al.13) (Figure 2).\nCut out a soft sponge measuring 5 cm L x 5 cm W, and which is at least 5 - 10 mm lower than the height of a Petri dish.\nCut a groove in the sponge of approximately 5 - 10 mm depth, and adjust its width to that of the approximate body width of the fish. Cut the polyvinyl chloride (PVC) board (0.3 mm thickness) to 5 cm L x 5 cm W, and bend it into a valley-fold (or M-shape).\nSet the grooved PVC board on top of the grooved sponge and then set the sponge into the Petri dish (ø 160 mm, 30 mm depth). Use water from the recovery tank to fill the Petri dish until the PVC board is adequately immersed.",
    "Prepare the VIE tags according to the VIE tagging manual. Mix the elastomer materials and add the mixture to the 3-mL syringe with 29-gauge needle, as contained in the kit.\nPrepare two water tanks to use while performing the tag injections: one for anesthesia and one for recovery; adjust the temperature and salinity concentration of these to match the water in the rearing aquarium. Use an air pump with an air stone to mildly circulate the water in the recovery tank.\nPrepare an anesthesia liquid by mixing 2-methylquinoline with an equal volume of 99.5% ethanol; add this to the anesthesia tank to achieve a concentration of 18 ppm.\n\tNOTE: The optimum concentration of the anesthesia liquid will depend on the species and body size of the individuals. Therefore, examine the optimum concentration for the study species in advance.\nTransfer individual fish to the anesthesia tank and allow them to become anesthetized: that is, wait until fish do not react to being touched or to water vibrations when the outside of the tank is tapped. As the body color changes when it is anesthetized in many fish, also monitor the body color carefully and judge whether fish is anesthetized from its changes. Because there is some possibility that fish may jump out of the anesthesia tank, keep it covered using a transparent acrylic board, at least until the fish begin to move slowly.\n\tNOTE: Fine-tune the time needed to anesthetize and/or adjust the concentration of anesthesia liquid, depending on the study species and its body size. If the operculum movement is ever stopped by the anesthesia, the fish will be at a high risk of death.\nAs fish will weaken if their body is warmed, keep fingers in the relatively cold water while anesthetizing the fish.",
    "Lift a fish from the anesthesia tank and quickly measure it or record the necessary data (total length, sex, etc.). If a fish appears to recover during measurement, immediately transfer it back to the anesthesia tank.\nTransfer the fish to a surgical table. Set the fish ventral side down in the PVC groove. If the body size is very small, use a binocular microscope while making the injection. If the study species is large enough to hold in a hand, inject the VIE tag while it is being held.\nPosition the beveled side of the needle toward the outside and pointed toward the head of the fish. Insert the needle subcutaneously, more or less parallel to the body, and as near to just under the skin as possible. Adjust the insertion depth depending on the fish body size and the easiness to ultimately see the tag.\nInject VIE tag while withdrawing the needle, and stop the injection before the needle bevel reaches the needle entry point (this will be easy to discern if injecting the tag in a relatively wide area).\nOn completing the tag injection, immediately transfer the fish to the recovery tank. If recovery appears too slow, gently circulate the water by hand.\nAfter recovery, return the fish to the rearing aquarium, and continue to add 10 ppm Elbagin to the water for 3 days.\n\tNOTE: Under low-visibility conditions for VIE tags, UVA filtered light will facilitate recognizing the tags.\n4. Counting the Demersal Adhesive Eggs\nTo create an artificial spawning nest to which the fish can deposit adhesive eggs, cut an opaque PVC pipe (ø 5 cm, 6 cm long) in half, perpendicular to the diameter.",
    "NOTE: The above pipe size is suitable for spawning the relatively small goby T. marinae. Thus, adjust the PVC pipe size and form as is appropriate for the study species.\nPrint a 5 mm x 5 mm grid on a waterproof sheet and cut it out to fit the inside area of the PVC pipe.\nFix the waterproof sheet to the inside of the PVC pipe using a rubberband.\n\tNOTE: If it is difficult for females to attach eggs on the waterproof sheet, and eggs fall from the sheet, make the sheet textured with sandpaper.\nCover the aquarium bottom with a layer of sand, 1 - 2 cm thick. Insert approximately one-third of the PVC pipe obliquely into the sand, with the sheet-fixed side down.\nAfter successful spawning by the fish, remove the sheet with the egg mass from the PVC pipe and place it in a Petri dish with aquarium water. Fix a new sheet inside the PVC pipe and place this back on the bottom of the aquarium. Finally, count the eggs by photographing the egg mass.\nAlternatively, if observations of parental egg care are to be undertaken after spawning, be careful not to bring the eggs out of the water. Rather, use a Petri dish to scoop up the eggs and sheet along with aquarium water, photograph the egg mass quickly, and then carefully reaffix the sheet with the egg mass back into the same PVC pipe before returning it all to its original position on the bottom of the aquarium. Finally, count the eggs using the picture.",
    "Count the eggs using ImageJ (Figure 3). These automatic and manual cell counting methods are explained in detail in the following: Basic cell counting (The University of Chicago, Integrated Light Microscopy Core Facility, http://digital.bsd.uchicago.edu/image_j.php); Particle Analysis (http://imagej.net/Particle_Analysis); Cell Counter (https://imagej.net/Cell_Counter).\nOtherwise, if eggs are deposited densely, estimate the number of eggs by calculating the area-density ratio: count eggs in a printed 5 x 5 mm2 grid to calculate the egg density, measure the surface area that is covered with eggs by ImageJ, and estimate the total number of eggs from above density per unit and surface area. The above surface area measurement method by ImageJ is explained in the following: Set scale… (Research Services Branch, https://imagej.nih.gov/ij/docs/menus/analyze.html); it explains how to define the spatial scale of the image; Using ImageJ to Measure Surface Area (Keene State college, Academic Technology, https://dept.keene.edu/at/2011/04/15/by-matthew-ragan/).\n\t\tNOTE: If eggs are transparent, the black waterproof sheet is more suitable for the automatic counting method because ImageJ can recognize the outline of eggs individually.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}