{
  "id": 4411,
  "origin_website": "Bio",
  "title": "Analyses of Plant Leaf Cell Size, Density and Number, as Well as Trichome Number Using Cell Counter Plugin",
  "procedures": [
    "Dissect cotyledons, leaves and petals from plants at the specific stages of study interest.Measure the areas of the dissected cotyledons and leaves (Figure 1a).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140706/20140706164756_4333.jpgFigure 1. The images used for area measuring and trichome number counting. (a). Cotyledons laid out on a white surface are shown, bar = 1 cm. The photo was taken with a digital camera. (b). Trichomes on the adaxial surface of an Arabidopsis leaf are shown. The photo was taken with a digital camera through a stereomicroscope.Label the cotyledons/leaves from the same plant, place the samples on a white surface, and try to keep them flat. Set a 1 cm scale in the middle (if possible) of the surface and take the photo with a digital camera. Measure the area of individual cotyledon or leaf blade using Image J software (Flash 1).    <p>imgsrc:https://bio-protocol.org/javascript:;</p>   Flash 1. The flash showing the steps of measuring areas of cotyledons in Figure 1a using ImageJ  Trichome number and density.Take photos of individual leaf with a scale under a stereomicroscope and make sure the trichomes are clear (Figure 1b). Measure the area of the leaf blade with Image J software (Flash 2) and count the total trichome numbers using Cell Counter plugin in Image J software (Flash 3). The trichome densities are calculated from dividing the total cell number of trichomes by leaf area.    <p>imgsrc:https://bio-protocol.org/javascript:;</p>   Flash 2. The flash showing the steps of measuring an individual leaf using ImageJ      <p>imgsrc:https://bio-protocol.org/javascript:;</p>   Flash 3. The flash showing how to use cell-counter plug-in in ImageJ for counting  Fix the samples by soaking in 70% ethanol overnight; clear off chlorophyll by washing the sample 2~3 times till washing solution (70% ethanol) becomes clear. Each time, soak the sample in the washing solution for 1-2 h.",
    "Note: Handle the sample gently to avoid the destruction of cell structure, no vortexing.Soak the sample in clearing solution-Hoyer’s solution to make the tissue transparent. Change the clearing solution 1-2 times if necessary.Notes: Handle the sample gently to avoid the destruction of cellular structures, no vortexing.The Hoyer’s solution makes the sample transparent and soft. In this method, different layers of tissue could be observed under a DIC microscope without dissection of different layers. For good observation, the tissue sample should be transparent. Softening the sample by Hoyer’s solution is good for sample mounting. Prepare microscope slide: Add a few drops of Hoyer’s solution onto a glass slide; place a piece of sample (treated cotyledon, leaf or petal) flat on the surface of the slide; cover the slide with a coverslip glass carefully and try to avoid the air bubbles.Measurement of petal areas.Take photos of the whole petal under a 4x differential interference contrast (DIC) optics, make sure the edge of the petal is clear. Measure the area of the petal using Image J software.On a DIC microscope, take the images of the center areas in different cell layers of the cotyledon, leaf or petal blade between the mid-vein and the margin. Note: For the cotyledons and leaf blades, three layers could be observed clearly under the DIC optics: The adaxial epidermis layer, the palisade mesophyll layer and the abaxial epidermis layer; for the petals, the cell in the adaxial epidermis and abaxial epidermis could be easily observed under DIC microscope (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140706/20140706164903_9346.jpgFigure 2. Three layers of the Arabidopsis leaf are visible under differential interference contrast (DIC) microscope. Images show adaxial epidermis, palisade mesophyll and abaxial epidermis cells in the second pair of leaves from 25-day-old Wt (row a) and a mutant (row b) lines.",
    "Scale bar: 100 μm (reproduced from Reference 1; Figure 4a in the manuscript: http://onlinelibrary.wiley.com/doi/10.1111/tpj.12228/full[href=http://onlinelibrary.wiley.com/doi/10.1111/tpj.12228/full])Count the numbers of different types of cells and stomata in 1024 x 768 pixel areas using Cell Counter plugin (http://rsbweb.nih.gov/ij/plugins/cell-counter.html) in Image J software (the same as shown in Flash 3).Note: For the epidermis of cotyledon and leaf blade, we can count both the stomatal and pavement cell numbers in the same image. For the pavement cells or stomata located in the margins of the image, if over half of the cell/stomata area is within the microscope viewfield, count it in; otherwise, don’t count it. Use the same standard for the same batch of assay. Measure the actual areas of a 1024 x 768 pixel area of the image in different DIC optics. Calculate cell/stomatal densities and cell size.For the cotyledon and leaf blade, cell/stomatal densities can be calculated from the total number of the cells and stomata in the image divided by the actual area of the image.For the petal, the cell size and cell density can be calculated from the total cell number in the image and the actual area of the image."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}