{
  "id": 3071,
  "origin_website": "Cell",
  "title": "Protocol to develop a synthetic biology toolkit for the non-model bacterium R. palustris",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nStrain handling and construction\nTiming: 1–2 weeks\nThis step outlines incubation and growth conditions of both R. palustris and E. coli cultures. Conditions for long-term storage of strains are detailed here as well. Oligonucleotides used for constructing strains may be purchased from Eurofins Genomics or a similar supplier. All plasmids were initially constructed in 10-beta competent E. coli, and plasmid construction was carried out through either hot fusion or blunt end ligation methods.8[href=https://www.wicell.org#bib8] This section of the protocol also details a method of constructing a Ribosome binding site (RBS) library, which is a collection of different RBS sequences which have different effective translation initiation rates, as well as a method of comparing predicted translation initiation rates with experimentally derived expression levels.\nStrain Storage and Construction.\nRhodopseudomonas palustris (Molisch) van Niel BAA-98, strain designation CGA009 (R. palustris), may be obtained from American Type Culture Collection.\nR. palustris cultures are stored long-term at a final concentration of 20% glycerol.\nR. palustris cultures are grown in 112 Van Niel’s media (VN) or photosynthetic media supplemented with appropriate antibiotics depending on selection markers.\nNote: It is advisable to determine which antibiotics are compatible with the non-model organism of interest by performing growth tests with varying concentrations of several antibiotics individually.\nNEB® 10-beta competent Escherichia coli (E. coli DH10β) was used for plasmid construction.\nE. coli cultures are stored long-term at a final concentration of 15% glycerol.\nE. coli cultures are grown in LB media and supplemented with the appropriate antibiotic.\nEvaluation of PCR Primers.",
    "Note: Before PCR is performed on DNA, or RT-qPCR is performed on RNA samples, it is advisable to first evaluate the primers that will be used for PCR with a Taq master mix with 100ng of DNA. Primer concentrations will need to be first determined through an initial evaluation to avoid fluorescence from non-specific binding of the polymerase (such as from primer dimers).\nMake two sets of GoTaq® PCR Master Mix reactions, one containing DNA template, one without, with differing concentrations of primers as described below.\nUsing a thermal cycler, perform a GoTaq® PCR reaction using the settings below.\nOn a 1× TAE 2% agarose gel, perform electrophoresis on PCR products.\nReactions with primer concentrations that produce a band in reactions containing DNA but fail to produce a band in reactions without DNA may be considered for further RT-qPCR reactions (troubleshooting 1[href=https://www.wicell.org#troubleshooting]).\nE. coli Transformation by Electroporation.\nStreak wild-type E. coli from frozen stock onto a solid LB media plate.\nIncubate at 37°C for 12–24 h.\nAdd 4 mL of LB media to a 14 mL polystyrene round-bottom tube.\nInoculate with DH10β E. coli from frozen glycerol stock.\nIncubate at 37°C and 275 rpm for 8–24 h.\nDilute strains to 1/40th in a separate 14 mL polystyrene round-bottom tube and incubate for 1 h at 30°C and 275 rpm.\nNote: Each tube of diluted E. coli will support 2 total transformations.\nWash the new culture by centrifuging at 3,000 × g for 15 min and resuspend in 4 mL of sterile water.\nCentrifuge again at 3,000 × g for 20 min and resuspend in 4 mL of sterile water.\nCentrifuge at 3,000 × g for 25 min.\nResuspend E. coli pellet in 100 μL of sterile water.",
    "Add 50 μL of E. coli suspension to a 0.2 cm electroporation cuvette and 2 μL of hot fusion8[href=https://www.wicell.org#bib8] or blunt end ligation product.\nInsert the electroporation cuvette into an electroporator and pulse the electroporation cuvette at 2.5 kV.\nImmediately add 450 μL of LB solution to the cuvette.\nImmediately decant cuvette into a sterile 14 mL polystyrene round-bottom tube.\nIncubate for 1 h at 37°C and 275 rpm.\nNote: It is advisable to record the time elapsed for each electroporation. Successful electroporations with ligation mixtures usually have ∼5 ms pulse times. Lower pulse times typically result in reduced transformation efficiency or cause the electroporator to arc, killing cell cultures.\nStreak the electroporated cells onto solid LB media plates supplemented with the appropriate antibiotic.\nIncubate at 37°C for up to 18 h.\nPick single colonies from LB plates containing the transformed E. coli cells by suspension in 4 mL of liquid LB media supplemented with the appropriate antibiotic.\nIncubate at 37°C at 275 rpm for 8–18 h.\nHarvest 0.5 mL (or an appropriate amount depending on the cryogenic vial used) of each transformed E. coli culture and add to a cryogenic vial.\nNote: Take care to leave room for expansion while freezing.\nAdd 0.5 mL of sterile 30% glycerol solution for a final concentration of 15% glycerol.\nMix by inverting tubes several or pipetting up and down.\nStore at −80°C for long-term storage.\nPause point: New E. coli strains can be stored at −80°C for several years, cultures may be restarted from frozen stock to harvest subsequent plasmids.\nUsing a Plasmid Miniprep Kit, harvest plasmids from the remaining culture.\nPause point: Eluted plasmids are typically stable at −20°C for several years.",
    "Submit samples for sequencing to ensure that no mutations have occurred during the transformation process and that the plasmid assembled correctly.\nR. palustris Transformation by Electroporation.\nStreak frozen wild-type R. palustris stock onto a solid PM plate and incubate at 30°C for 5 days or until a sufficient amount of culture appears on the plate.\nAdd 4 mL of sterile VN to a 14 mL polystyrene round-bottom tube.\nInoculate with streaked R. palustris culture plates.\nIncubate at 30°C and 275 rpm for 48 h.\nDilute to OD660 = 0.2 into another tube of 4 mL sterile VN.\nIncubate for 18 h at 30°C and 275 rpm, or until OD660 = 0.6.\nNote: Likewise with E. coli each tube will support 2 total transformations.\nPerform the same washing steps (g – j) as from E. coli Transformation by Electroporation.\nNote: R. palustris cell pellets are not as easily disturbed as E. coli cell pellets, though care should still be taken not to resuspend and remove cells.\nAdd 100ng of the previously miniprepped plasmid of interest assembled in E. coli to the 0.2 cm electroporation cuvette.\nNote: The initial plasmid assembly in E. coli is necessary to construct the plasmid correctly and without mutations.\nElectroporate the cuvette using the same settings as with E. coli electroporation (k).\nPulse the electroporation cuvette, and immediately add 450 μL of VN solution to the cuvette.\nImmediately decant cuvette into a sterile 14 mL polystyrene round-bottom tube and incubate up to 24 h at 30°C and 275 rpm.\nStreak transformed cultures onto solid VN media supplemented with the appropriate antibiotic.\nIncubate plates at 30°C for up to one week after electroporation.\nNote: Colonies may not begin to appear until typically 5 days after electroporation.",
    "Pick single colonies onto a second VN plate supplemented with the appropriate antibiotic.\nIncubate at 30°C for 5 days or until a sufficient amount of culture appears on the plate.\nInoculate from single-colony plates and grow in 4 mL of VN media for 48 h.\nMake frozen stocks of R. palustris by adding 0.5 mL of transformed R. palustris cultures to cryogenic vials (or an appropriate amount depending the cryogenic vial used) and add 0.5 mL of sterile 40% glycerol for a final concentration of 20% glycerol.\nStore at −80°C.\nPause point: New R. palustris strains can be stored at −80°C for several years, cultures may be restarted from frozen stock for later handling.\nHarvest 50 μL of culture into PCR tubes and lyse at 100°C for 30 min.\nNote: Plasmids from R. palustris cultures do not need to be extracted, cell lysate can be used in PCR sequencing reactions.\nPerform PCR with R. palustris cell lysate using sequencing primers.\nSubmit samples for sequencing to ensure a lack of mutation and correct assembly.\nRBS Library Construction.\nNote: An RBS library can be constructed by designing a degenerate oligonucleotide such as the one depicted in Figure 2[href=https://www.wicell.org#fig2]. A primer is first designed matching the sequence immediately before the RBS site. A poly “N” tag is then added onto the end where the RBS sequence is located. The poly “N” tag will allow the RBS to be replaced by all possible RBS sequences. A second primer should be designed matching the reverse complement of the sequence immediately after the RBS to allow for a blunt end ligation assembly.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2645-Fig2.jpg\nFigure 2. Degenerate oligonucleotide construction for saturation mutagenesis",
    "Example of a degenerate oligonucleotide used to replace an RBS. The “N”s in each position for the RBS sequence allow for every possible combination of base sequences to replace the RBS. The poly “N” tag may be attached to either primer, but must be concatenated to them so as to replace the RBS sequence. Individual sequences can be obtained by performing blunt end ligation, transformation in E. coli, miniprep, and transformation in R. palustris. Picking single colonies will ensure that only individual RBS replacement sequences are present in any culture.\nPerform PCR of the plasmid with the degenerate oligonucleotide and its pair.\nTreat PCR product with DpnI enzyme to digest any plasmid that did not undergo PCR.\nPurify PCR product using a PCR purification kit.\nPerform a Blunt-End Ligation of the purified PCR product.\nTransform E. coli with the blunt end ligation product for initial assembly, miniprep, and transform R. palustris using the above protocol.\nPick a number of colonies proportional to the desired size of the RBS library onto separate solid VN media plates supplemented with the appropriate antibiotic.\nNote: Multiple colonies can be picked onto a single plate as long as they are separated from each other.\nNote: Depending on the number of base pairs of the RBS that are being replaced, a number of colonies should be picked. E.g., an RBS containing 6 base pairs that can be changed will result in 4096 unique possibilities. Only a subset should be picked as obtaining all possible sequences can be very difficult.\nRBS Library Screening.\nPick cells from each culture into separate wells of a 48 deep well plate.\nNote: Each well should contain 500 μL of PM supplemented with sodium acetate, sodium bicarbonate, and ammonium sulfate nutrients. Incubate for 5 days at 275 rpm and 30°C.",
    "Transfer 200 μL of each culture to individual wells of a black 96 well plate.\nMeasure fluorescence and absorbance of each culture and calculate expression fold change using the formula found in the fluorescent marker expression test[href=https://www.wicell.org#sec3.2] section below.\nNote: The RBS library at this point can be trimmed by excluding RBS sequences that have similar expression levels. One method of performing this is selecting sequences from discrete ranges of increased expression (e.g., out of 5 possible sequences that provide a fold change increase of 130–160, only 1 needs to be selected).\nMake frozen stocks of selected cultures by adding an equal volume of glycerol directly to each well of the 48 well plate.\nAfter adding glycerol to each well, seal the top of the plate with aluminum foil tops.\nStore at −80°C.\nPause point: RBS library cultures can be stored for several years at −80°C.\nLyse 50 μL of each sample and use lysate for subsequent PCR for determining RBS sequences.\nSubmit samples for sequencing to determine sequences for selected cultures.\nObtain predicted translation rates for each RBS sequence using the Salis RBS Calculator found at https://salislab.net/software/predict_rbs_calculator[href=https://salislab.net/software/predict_rbs_calculator].2[href=https://www.wicell.org#bib2],3[href=https://www.wicell.org#bib3],4[href=https://www.wicell.org#bib4],5[href=https://www.wicell.org#bib5],6[href=https://www.wicell.org#bib6],7[href=https://www.wicell.org#bib7]\nPlot experimentally obtained expression rates vs predicted translation initiation rates for each sequence.\nNote: This plot will determine the efficacy of the calculator in predicting sequences with high translation initiation rates. Statistics such as R2 or the Pearson coefficient can be used to determine the correlation between predicted and experimental values for different RBS sequences.",
    "Note: Figure 3[href=https://www.wicell.org#fig3] from Immethun & Kathol et al.1[href=https://www.wicell.org#bib1] depicts an example of a trimmed RBS library, where a linear gradient of expression level is made by selecting various RBS sequences with differing expression levels from an initial scan. Figure 3[href=https://www.wicell.org#fig3]A shows the initial collection of colonies that were picked from plates, while Figure 3[href=https://www.wicell.org#fig3]B depicts the trimmed RBS library.1[href=https://www.wicell.org#bib1]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2645-Fig3.jpg\nFigure 3. RBS library fluorescence scans\n(A) Total single colonies picked from transformed R. palustris cultures with replaced RBS from Immethun and Kathol et al.1[href=https://www.wicell.org#bib1] Fluorescence of each culture was determined by performing a fluorescence marker expression test and measured using a plate reader.\n(B) Example of a trimmed RBS library. Trimming was performed by selecting several RBS’s which provided the highest fluorescent intensities, then by selecting one RBS for each expression fold change threshold (∼30 fold change).\nGenome Engineering by Double Homologous Recombination.\nA suicide plasmid is constructed by initially determining a plasmid origin of replication that is unable to replicate within R. palustris.\nCritical: It is important to choose a plasmid origin of replication that is compatible with E. coli DH10β, but not with R. palustris CGA009. Colony PCR using R. palustris lysate is used to determine which plasmid origins replicate in R. palustris. The p15A origin was selected for the study in Immethun & Kathol et al.1[href=https://www.wicell.org#bib1] as it does not replicate in R. palustris but does within E. coli DH10β.\nDetermine section of R. palustris genome for integration of the expression cassette.",
    "Note: To ensure that the expression cassette replaces this specific site, the expression cassette is flanked by two homology arms (800–1,000 bp) which consist of the upstream and downstream regions of the open reading frame. These homology arms are designed to consist strictly of the DNA sequence of these regions as depicted in Figure 4[href=https://www.wicell.org#fig4].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2645-Fig4.jpg\nFigure 4. R. palustris double homologous recombination\nAn expression cassette consisting of a fluorescent reporter with its associated regulatory parts and an antibiotic resistance gene is flanked by two homology “arms” which comprise 800–1,000 bp of DNA sequence before and after the specified insertion point. The vector containing the expression cassette and homology arms contains the p15A origin, which has been verified to replicate in E. coli DH10β, but not in R. palustris. This ensures that transformed R. palustris cultures consist of strains that contain the expression cassette at the target site.\nAn expression cassette which includes a selection marker as well as a reporter gene, is added to the suicide plasmid via hot fusion method.8[href=https://www.wicell.org#bib8]\nTransform the suicide plasmid into E. coli using the above protocol.\nTransform R. palustris using the sequence-verified plasmid after construction using E. coli.\nVerify integration into the genome via PCR.",
    "Note: Two sets of primers are designed for this purpose, the first set should be designed to include a roughly 200 bp region before the 5′ homology arm, and the 200 bp region after the 3′ homology arm. The second set should include only the section of the genome that is being replaced. The first PCR reaction should produce a band which should be the added size of the expression cassette, the homology arms, and the ∼200 bp sections before and after the 5′ and 3′ homology arms respectively. The second set of primers should not produce a band.\nAfter verification of integration into the genome, perform a Fluorescent marker expression test to determine the level of expression from the integrated cassette.\nFlow cytometry may be subsequently performed to ensure homogeneity of the transformed culture of R. palustris.\nObserving Plasmid Stability via Fluorescent Markers and Flow Cytometry.\nNote: When transformation is performed on certain bacteria, whether they are model or non-model bacteria, it is possible that cells from picked colonies may not contain plasmids. Plasmids may also be lost over generations in bacterial cultures. Flow cytometry can be used in conjunction with fluorescent markers incorporated in these plasmids to observe their maintenance in bacteria. This protocol describes a method by which the proportion of cell cultures that have not retained the plasmid across generations can be determined.\nStreak R. palustris cultures transformed with plasmids containing a fluorescent marker from frozen stocks onto solid VN plates supplemented with the appropriate antibiotic.\nNote: For each flow cytometry experiment, wild-type R. palustris will be used as a negative control. Also streak an R. palustris culture transformed with a plasmid that is known to be maintained across several generations that also contains a fluorescent marker, this strain will act as a positive control.",
    "Incubate R. palustris cultures at 30°C and 275 rpm for the desired amount of time.\nNote: The desired amount of time is the length of time for which plasmid loss is expected to occur. For R. palustris, plasmid loss can occur over the course of a couple weeks. This can change depending on the strain of bacteria being handled. Several dilutions of the same culture may need to be performed as cultures can reach stationary phase multiple times before plasmid loss can occur.\nPrepare samples for submission to a local flow cytometry core or facility.\nCritical: Bovine Serum Albumin (BSA) is sometimes added to samples of bacteria in order to reduce rejection rate in Flow Cytometry experiments. While it has not been observed for other possible fluorescent markers or other bacteria, the addition of BSA severely reduced the fluorescence of cells in R. palustris cultures with mRFP. As a result, it may be advisable to prepare two sample sets, one containing BSA and one without, to determine if BSA produces a “masking” effect on the fluorescence of various bacteria.\nUsing both the negative and positive controls, determine a threshold fluorescence intensity.\nNote: Cells with fluorescence intensity higher than the threshold can be considered to contain the plasmid, while cells that have intensities lower than the threshold are considered not to contain the plasmid, such as in Figure 5[href=https://www.wicell.org#fig5].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2645-Fig5.jpg\nFigure 5. Flow Cytometry results of R. palustris strains\n(A) An example of a negative control result of wild type R. palustris. This culture contains exclusively untransformed cells.",
    "(B) An example of a result from a positive control strain of R. palustris. This strain is known to have a high plasmid maintenance and has a distinct fluorescence peak which can be distinguished from untransformed cells. The combination of a negative and positive control allows a fluorescence threshold to be determined to differentiate between transformed and untransformed cells.\n(C) An example of an R. palustris culture with reduced plasmid maintenance. A smaller percentage of the culture has retained the plasmid than that of the positive control.\nObtain proportions of cultures that have retained the plasmid.\nFluorescent marker expression test\nTiming: 5 days\nThis procedure describes how the expression level of genes of interest in newly constructed strains of non-model bacteria can be measured. One of the most common methods of doing this is by inserting a fluorescent marker, such as monomeric red fluorescent protein or green fluorescent protein into a plasmid, which is then in turn inserted into bacterial cells. The use of fluorescent proteins is an alternative method to qPCR of determining expression levels, maintenance of plasmids, and strengths of regulatory parts such as promoters and RBS sequences. It is easier as it does not involve the extraction of RNA and subsequent RT-qPCR, which can be time-consuming and more expensive in terms of material costs. This procedure describes how the expression level of various fluorescent proteins is determined in R. palustris.\nFluorescence Expression Test.\nStreak R. palustris cultures transformed with plasmids of interest from frozen stocks onto solid VN plates supplemented with the appropriate antibiotic.\nNote: For each expression test, wild-type R. palustris will be used as a negative control.\nIncubate plates at 30°C and 275 rpm for 5–7 days.",
    "Prepare R. palustris “seed” culture in PM media for each strain of interest containing fluorescent proteins in 250 mL Erlenmeyer flasks.\nNote: 1.5 mL of wild-type R. palustris culture will be needed for triplicate wells of negative controls in each plate.\nIncubate R. palustris seed culture at 30°C and 275 rpm for 5 days.\nPrepare dilutions of desired strains of R. palustris by preparing inoculated R. palustris growth media as described above (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]) for 2 mL.\nNote: Final concentrations of nutrients should remain the same and OD660 = 0.2, with PM used as balance.\nAdd 500 μL of inoculated growth media to 3 wells of a sterile 48 well suspension culture plate.\nCover the plate with a Breathe-Easy® Permeable Membrane to maintain both monoculture and aerobic conditions during incubation and incubate at 30°C and 275 rpm for 72 h. Figure 6[href=https://www.wicell.org#fig6] depicts an example of a prepared plate.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2645-Fig6.jpg\nFigure 6. R. palustris fluorescence test preparation\n(A) Example of a prepared expression plate. Individual wells are prepared in triplicate with 500 μL of inoculated R. palustris media containing transformed strains of R. palustris, as well as a triplicate set of Wild Type R. palustris.\n(B) An expression plate covered with a Breathe-Easy® Permeable Membrane, which provides aerobic conditions while maintaining monoculture conditions.\nNote: Some incubator conditions can lead to evaporation of growth media during incubation, even through the permeable membrane. A beaker of sterile water may be placed in a safe position in the incubator to provide humidity and lessen evaporation effects.\nRemove plate from incubator and add 200 μL of each culture to a black 96-well clear flat bottom plate (troubleshooting 2[href=https://www.wicell.org#troubleshooting]).\nAdd 200 μL of PM media in triplicate to act as a blank.",
    "Measure fluorescence and absorbance of each culture using a plate reader (troubleshooting 3[href=https://www.wicell.org#troubleshooting]).\nNote: Expression tests measuring fluorescence intensity of cultures using a plate reader can be performed by specifying the type of plate used in the measurement, the excitation and emission wavelengths of the fluorescent protein of interest, read area on the plate, as well as the optimal absorption wavelength of the bacteria of interest in the settings of the accompanying program.\nExport expression data to Microsoft Excel or other appropriate data analysis software. Determine expression fold change values for each culture.\nNote: Expression Fold Change can be calculated using the following equation:\nE\nF\nC\n=\n(\n(\nF\nl\nu\no\nr\ne\ns\nc\ne\nn\nc\ne\n−\nM\ne\nd\ni\na\nF\n)\n(\nA\nb\ns\no\nr\nb\na\nn\nc\ne\n−\nM\ne\nd\ni\na\nA\n)\n(\n(\nW\nT\nF\nl\nu\no\nr\ne\ns\nc\ne\nn\nc\ne\n−\nM\ne\nd\ni\na\nF\n)\n(\nW\nT\nA\nb\ns\no\nr\nb\na\nn\nc\ne\n−\nB\nl\na\nn\nk\nA\n)\n)\nA\nv\ng\n)\nA\nv\ng\nWhere,\nEFC = Expression Fold Change;\nFluorescence = Fluorescence of transformed bacterial culture;\nMediaF = Fluorescence of media blank;\nAbsorbance = Absorbance of transformed bacterial culture;\nMediaA = Absorption of media blank;\nWTFluorescence = Fluorescence of Wild Type control culture;\nWTAbsorbance – Absorbance of Wild Type control culture.\nDetermine significance between transformed cultures and wild-type cultures by performing student’s two tailed t-test assuming unequal variances between transformed culture and Wild Type culture EFC values.",
    "Optional: The strength of various terminator sequences can also be determined using this protocol. Termination of transcription does not necessarily end at the stop codon, and so various terminator sequences can be used as controls for terminator regulation. Placing a fluorescent marker on the same strand in series with an antibiotic resistance gene, such as in Figure 7[href=https://www.wicell.org#fig7], can allow for an intergenic region to test terminators. Depending on the strength of the terminator sequence, the fluorescence level of cultures transformed with these plasmids.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2645-Fig7.jpg\nFigure 7. Depiction of a plasmid construct with a terminator between an antibiotic resistance gene and a fluorescent protein\nThe intergenic region allows for the insertion of various terminator sequences to control the amount of transcriptional readthrough that occurs from the antibiotic resistance gene. Various terminator sequences can be tested with the Fluorescence Marker Expression Test of this protocol.\nDetermining expression level through RT-qPCR\nTiming: 3 days\nThese steps in the protocol describe a method by which RNA is extracted from R. palustris and is subsequently analyzed for expression levels using RT-qPCR. This procedure follows very closely from the TRIzol™ extraction procedure, which can be found at https://tools.thermofisher.com/content/sfs/manuals/trizol_reagent.pdf[href=https://tools.thermofisher.com/content/sfs/manuals/trizol_reagent.pdf], with some exceptions. The RNAlater procedure is also used to store samples for later RNA extractions in this protocol. Other methods of preserving cell cultures for later RNA extraction may also be used.\nRNA extraction sample preparation (1 day).\nHarvest cultures upon reaching the mid-exponential phase by transferring to a 50 mL conical tube.\nSamples may be saved at this point for extraction at a later date using the RNAlater protocol found at https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2F7020M.pdf[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2F7020M.pdf].\nCentrifuge cultures at 3,000 × g for 15 min at 4°C.\nResuspend cultures with 50 mL ice-cold PBS.\nCentrifuge at 3,000 × g for 15 min at 4°C.\nRepeat previous two steps.",
    "Resuspend cell cultures in 5–10 volumes of RNAlater solution.\nNote: R. palustris cultures are typically reduced to 1–2 mL of cell pellets at this point before addition of RNAlater, although differing OD660 before centrifugation may change the final volume of cell culture.\nIncubate cell cultures for 24 h in a 4°C room.\nAdd equal volume ice cold PM or 1× PBS and centrifuge cultures at 3,000 × g for 15 min at 4°C. Remove supernatant.\nNote: RNAlater must be removed by addition of another less dense media such as 1× PBS as the density of RNAlater prevents pelleting of cultures.\nStore at −80°C until extraction.\nTRIzol™ extraction protocol (5–10 h, dependent on number of samples).\nCritical: Throughout the extraction procedure, RNaseZap™ should be applied to all tools that are not already specified as RNase-free and all working area surfaces to prevent contamination of RNase into samples. Tools that interact with surfaces that have not been applied with RNase Zap should be reapplied with RNaseZap™. Any contamination of RNase can cause RNA degradation and destroy the usability of samples for subsequent qPCR. A lab coat, appropriate lab gloves (neoprene gloves are suitable), and safety glasses should be worn throughout the procedure.\nStarting from either RNAlater prepped samples or extracting immediately from recently harvested samples, add 1 mL of TRIzol™ reagent to samples in a fume hood and transfer to a 2 mL RNase-free Eppendorf tube.\nPipette up and down to thoroughly mix and vortex each sample for 10 s each.\nIncubate on ice for 5 min.\nAdd 200 μL chloroform.\nCap samples and shake by hand for 15 s.\nIncubate at 21°C for 5 min.\nCentrifuge at 12,000 × g for 15 min at 4°C.",
    "Note: At this point, the sample should separate into three phases, the lower TRIzol-Chloroform layer, an intermediate layer that contains R. palustris DNA, and the upper aqueous layer which contains the RNA.\nExtract approximately 400 μL of the aqueous phase, making sure to not draw out either the interphase or the phenol-chloroform phase.\nNote: It may be advisable to leave 50–100 μL of the aqueous phase with the rest of the sample in order to not disturb either the interphase or the lower phenol-chloroform phase.\nAdd an equal volume of pure Isopropanol and mix by inverting tubes 20 times.\nIncubate at 21°C temperature for 10 min.\nCentrifuge samples at 12,000 × g for 30 min at 4°C.\nNote: R. palustris RNA forms a white pellet as opposed to a transparent pellet for E. coli as depicted in Figure 8[href=https://www.wicell.org#fig8]. Figure 8[href=https://www.wicell.org#fig8]A shows an RNA extract sample before centrifugation with Isopropanol, while Figure 8[href=https://www.wicell.org#fig8]B depicts the same sample after centrifugation, where RNA from R. palustris cultures have precipitated into a white pellet.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2645-Fig8.jpg\nFigure 8. RNA extraction of R. palustris\n(A) 100% Isopropanol is added to aqueous layer extracts from the TRIzol™ extraction process.\n(B) RNA pellet from R. palustris samples is precipitated through centrifugation. RNA from R. palustris samples appeared as a white pellet.\nRemove supernatant, making sure to not draw out the RNA pellet.\nResuspend the RNA pellet in 1 mL of ice-cold 75% ethanol and vortex the sample briefly.\nCentrifuge at 7,500 × g for 10 min at 4°C and remove supernatant.\nAir dry the pellet for 5–10 min or until all of the ethanol has evaporated.\nNote: The RNA should be dried completely, but not overdried as the RNA will lose solubility.",
    "Resuspend the RNA pellet in 44 μL of RNase-free water and mix by pipetting up and down.\nNote: This volume allows for easier calculations of volumes required for subsequent DNA treatment and also provides a sufficient concentration of RNA for reverse transcription to cDNA and qPCR.\nIncubate at 50°C for 15 min.\nRemove samples to ice and measure concentration using a microspectrophotometer.\nStore RNA extracts at −80°C until DNase treatment.\nPause point: Prepared RNA samples are stable at −80°C for 6–12 months.\nPerform a DNase treatment on each sample to remove any DNA contamination from the RNA extraction process.\nCritical: Immediately store samples at −80°C when not in use.\nNote: Depending on the amount of DNA contamination, the DNase treatment may have to be repeated to effectively remove all DNA contamination from samples.\nPerform a PCR test of the DNase treated RNA samples with any set of primers that produces a correct band on a DNA template, but no band without a DNA template.\nNote: If samples produce a correct band on a 2% agarose gel, the DNase treatment (s) must be reperformed.\nMeasure sample RNA concentration with a microspectrophotometer and record to prevent future RNA losses, immediately store at −80°C.\nRNA Degradation Check (2–3 h).\nNote: This procedure is used as a more accessible method which utilizes cheap common biology lab materials such as bleach, agarose gels, and DNA stains to determine degradation of RNA. This protocol is largely adapted from Aranda et al.9[href=https://www.wicell.org#bib9]\nPrepare a bleach gel mixture to final concentrations of 1% agarose (w/v) and 5% or 6% any commercialized bleach (v/v) to a TAE buffer (other concentrations of bleach can be used as long as final concentrations are kept).\nHeat mixture to near boiling for 90 s, let cool until it reaches 21°C.",
    "Add 15 μL of SYBR Safe DNA Gel Stain.\nCritical: Ensure that the stain is added just before the solution starts to solidify. The bleach combined with the raised temperature degrades the stain prematurely. The bleach gel will turn dark purple if the stain is added when the solution is too hot. See Figure 9[href=https://www.wicell.org#fig9] for reference on a viable bleach gel.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2645-Fig9.jpg\nFigure 9. Addition of DNA stain to a bleach gel\n(A) An example where DNA stain was added while the 1× TAE agarose solution was too hot, and the gel turns a dark purple. Exposure to bleach at high temperatures appears to destroy the DNA stain. SYBR™ Safe DNA Gel Stain is used in this case.\n(B) An example of a viable gel mixture. A red hue colors the mixture as with other gels using SYBR™ Safe DNA Gel Stain.\nPour the mixture into an electrophoresis gel mold.\nPerform gel electrophoresis.\nNote: Electrophoresis with the bleach gel can be hotter than electrophoresis with standard gels. Care should be taken to ensure that gel trays do not overheat during the electrophoresis. As a result, lower voltages may be chosen to avoid this problem.\nVisualize Gel using SYBR Safe stain gel visualization protocol.\nAll RNA samples that produce two equally bright bands as seen in well 3 of Figure 10[href=https://www.wicell.org#fig10], can be used for subsequent qPCR (troubleshooting 4[href=https://www.wicell.org#troubleshooting]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2645-Fig10.jpg\nFigure 10. Bleach gel with RNA samples\nWell 1 is a negative control, well 2 contains DNA ladder. Well 3 contains an RNA sample with an RNQ (RNA Quality Number) of 7, which is sufficient for future qPCR. Well 4 contains a nearly completely degraded sample of RNA with an RNQ number of 1.",
    "Note: If the RNA degradation has been sufficiently prevented, each sample should produce two bands as seen in Figure 10[href=https://www.wicell.org#fig10].\nConvert RNA samples to cDNA using a reverse transcriptase, following the reverse transcription protocol.\nPause point: cDNA samples are stable at −20°C for up to one year.\nPrimer Efficiency (up to 4 h).\nNote: Primer efficiency is determined by preparing qPCR reactions with PowerUp™ SYBR™ Green Master Mix, or a similar binding dye, with a 5× dilution series of cDNA consisting of 8 samples (3.2∗10-2 - 500 ng/μL).\nMake a set of master mix reactions as described below.\nCritical: When preparing any RT-qPCR, it is essential that reactions are protected from outside DNA contamination as any contaminant may drastically change Ct values of RT-qPCR reactions. A separate set of negative control reactions can be prepared by adding master mix to a well, and instead of cDNA, DNA free water should be added. These reactions should not fluoresce at all during qPCR.\nUsing a real time thermal cycler, prepare reaction settings for the binding dye used.\nLoad reactions into the real-time thermocycler and perform PCR.\nExport CT values as csv or equivalent data file for performing primer efficiency analysis.\nPlot Ct values vs log10(DNA copies) for each primer reaction set, perform linear regression analysis, and use the ThermoFisher Scientific qPCR calculator to determine the primer efficiency for each primer reaction set based on the slope of the line as in Figure 11[href=https://www.wicell.org#fig11].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2645-Fig11.jpg\nFigure 11. Ct values plotted against log10 of cDNA concentration for one primer set\nThe slope of the line is used to determine the primer efficiency of the primer set using the Thermofisher qPCR Efficiency Calculator. R2 values should ideally be above .98 for confirming primer sets. Error bars represent one standard deviation for n = 3.",
    "Note: The calculator can be found at https://www.thermofisher.com/us/en/home/brands/thermo-scientific/molecular-biology/molecular-biology-learning-center/molecular-biology-resource-library/thermo-scientific-web-tools/qpcr-efficiency-calculator.html[href=https://www.thermofisher.com/us/en/home/brands/thermo-scientific/molecular-biology/molecular-biology-learning-center/molecular-biology-resource-library/thermo-scientific-web-tools/qpcr-efficiency-calculator.html].\nNote: Primer reaction sets that have efficiencies between 90% and 110% can be used to obtain CT values for qPCR reactions for cDNA samples.\nPrimer concentrations with verified primer efficiencies may now be used for subsequent qPCR. All Ct values obtained from qPCR reactions should be within the range of 90%–110% efficiency.\nPerform qPCR for genes of interest and analyze gene expression levels using ΔΔCT, quantitative transcriptomics, or other methods of determining expression level.\nDetermining Plasmid Copy Number Through qPCR (6 h).\nNote: qPCR with gDNA can be performed to determine the copy number of both native and non-native plasmids relative to the chromosome. Most bacteria usually contain one chromosome, but some may be polyploids, where a cell can contain more than one copy of its chromosome. This protocol allows for the indirect measure of stability of non-endogenous plasmids employed in R. palustris, and can feasibly be used in other bacteria. This protocol was largely adapted from Delorenzo et al.10[href=https://www.wicell.org#bib10]\nIncubate R. palustris cultures at 30°C and 275 rpm until cultures reach mid-exponential phase.\nExtract gDNA from cultures using a gDNA extraction kit that extracts both chromosomal and plasmid DNA.\nPause point: gDNA and pDNA extracts are stable at −20°C for several years.\nDesign a set of qPCR primers for a sequence that appears only once in the chromosome, and another set for a sequence that appears only once in the plasmid (ideally the origin of replication).\nNote: These primers should also be verified to amplify only the desired region using the Evaluation of PCR Primers section found in Strain handling and construction.\nPerform GoTaq® PCR of two targeted genes using primers designed for qPCR.\nVerify that the PCR product contains only the desired amplicon through gel electrophoresis.",
    "Purify the remaining PCR product and measure with a microspectrophotometer.\nUsing the following equation, prepare an external standard curve of purified PCR product using the following equation. Initially dilute amplified PCR product to 109.\nA\nm\np\nl\ni\nc\no\nn\nc\no\np\ny\nn\nu\nm\nb\ne\nr\n=\n(\n6.02\n∗\n10\n23\nc\no\np\ni\ne\ns\nm\no\nl\n)\n(\ng\nD\nN\nA\nn\ng\nμ\nL\n)\n(\na\nm\np\nl\ni\nc\no\nn\nl\ne\ng\nn\nt\nh\n(\nb\np\n)\n)\n(\n660\ng\nm\no\nl\n∗\nb\np\n)\nPrepare an external standard curve by making a 5× dilution series initially diluting samples to 107 copies/μL in triplicate.\nPerform qPCR of both the dilution series and gDNA extracts of cultures harvested at mid-exponential.\nCalculate copy number of both the plasmid amplicon and chromosome amplicon by referring to the CT values obtained from the dilution series external standard curve.\nCalculate plasmid copy number using the following equation.\nP\nl\na\ns\nm\ni\nd\nc\no\np\ny\nn\nu\nm\nb\ne\nr\nr\na\nt\ni\no\n=\nC\no\np\ni\ne\ns\no\nf\ng\ne\nn\ne\nf\nr\no\nm\np\nl\na\ns\nm\ni\nd\nC\no\np\ni\ne\ns\no\nf\ng\ne\nn\ne\ntable:files/protocols_protocol_2645_5.csv\ntable:files/protocols_protocol_2645_6.csv\ntable:files/protocols_protocol_2645_7.csv\ntable:files/protocols_protocol_2645_8.csv\ntable:files/protocols_protocol_2645_9.csv"
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Metabolism",
    "Biotechnology And Bioengineering",
    "Microbiology",
    "Genetics",
    "Molecular Biology",
    "Gene Expression"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}