{
  "id": 7174,
  "origin_website": "Bio",
  "title": "A Potent Vaccine Delivery System",
  "procedures": [
    "Vaccine candidate synthesis (see Note 5)Resin swelling: Weight out 339 mg pMBHA•HCl resin (0.2 mmol equivalent) into a peptide synthesis vessel and add 10 ml of DMF and 0.216 ml of DIPEA (see Note 6). Let the resin swell for at least 2.5 h (see Note 7).Resin washing: Drain the solvent using vacuum filtration and wash the resin three times using DMF (~5 ml per wash; see Notes 8-9).Boc deprotection (see Note 9): Drain all of the solvent before adding ~5 ml of neat TFA. Stir the resin gently for 2 min with a stirring rod (see Note 10).Drain the TFA, and repeat Step A3.Resin washing: Drain the solvent using vacuum filtration and wash the resin five times with DMF (~5 ml per wash; see Notes 8-9).Amino acid activation: Weight out each amino acid in scintillation vials. Add 1.6 ml of HATU and 0.181 ml of DIPEA (see Note 11).Amino acid coupling: Drain all of the solvent off before adding the preactivated amino acid to the washed resin and stir gently (see Note 12). Insert the vessel, with temperature probe, into the microwave and heat for 5 min at 70 °C (see Note 13).Resin washing: Drain the solvent using vacuum filtration and wash the resin three times with DMF (~5 ml per wash; see Note 8).Repeat Steps A6-A7 for the second coupling (10 min at 70 °C).Resin washing: Drain the solvent using vacuum filtration and wash the resin five times with DMF (~5 ml per wash; see Note 8).Acetylation: Drain the solvent completely, then add 5 ml of capping solution to the resin. Stir gently, then insert the vessel, with temperature probe, into the microwave and heat the mixture for 10 min at 70 °C (see Note 14).",
    "Resin washing: Drain the solvent using vacuum filtration and wash the resin three times with DMF (~5 ml per wash; see Note 8).Repeat Step A11 for the second acetylation.Resin washing: Drain the solvent using vacuum filtration and wash the resin five times with DMF (~5 ml per wash; see Note 8).Repeat Steps A2-A10 for the following amino acid sequence, until the Peptide 1 (Figure 2) sequence is finished (Table 1, entry 1-42).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210402/20210402020203_7700.jpgFigure 2. Synthesis of the vaccine candidate Peptide 2, which is comprised of (i) GAS J8 B-cell epitope, and (ii) PADRE T-helper cell epitope, branched with (iii) a leucine poly(hydrophobic amino acid) (pHAA) unit via lysine linker Table 1. List of amino acids used for the synthesis of vaccine candidate Peptide 2 table:",
    "﻿0,1,2,3,4,5,6,7\nPADRE,1,Boc-Ala-OH,A,J8 (continue),30.0,Boc-Lys(2Cl-Z)-OH,K\nPADRE,2,Boc-Ala-OH,A,J8 (continue),31.0,Boc-Ala-OH,A\nPADRE,3,Boc-Ala-OH,A,J8 (continue),32.0,Boc-Glu(OcHx)-OH,E\nPADRE,4,Boc-Lys(2Cl-Z)-OH,K,J8 (continue),33.0,Boc-Arg(Tos)-OH,R\nPADRE,5,Boc-Leu-OH H2O,L,J8 (continue),34.0,Boc-Ser(Bzl)-OH,S\nPADRE,6,Boc-Thr(Bzl)-OH,T,J8 (continue),35.0,Boc-Gln-OH,Q\nPADRE,7,Boc-Trp(For)-OH,W,J8 (continue),36.0,Boc-Lys(2Cl-Z)-OH,K\nPADRE,8,Boc-Ala-OH,A,J8 (continue),37.0,Boc-Val-OH,V\nPADRE,9,Boc-Ala-OH,A,J8 (continue),38.0,Boc-Lys(2Cl-Z)-OH,K\nPADRE,10,Boc-Val-OH,V,J8 (continue),39.0,Boc-Asp(OcHx)-OH,D\nPADRE,11,Boc-Phe-OH,F,J8 (continue),40.0,Boc-Glu(OcHx)-OH,E\nPADRE,12,Boc-Lys(2Cl-Z)-OH,K,J8 (continue),41.0,Boc-Ala-OH,A\nPADRE,13,Boc-Ala-OH,A,J8 (continue),42.0,Boc-Gln-OH,Q\nBranching moiety,14,Boc-Lys(Fmoc)-OH,K,Leucine pHAA unit,43.0,Boc-Leu-OH H2O,L\nJ8,15,Boc-Gln-OH,Q,Leucine pHAA unit,44.0,Boc-Leu-OH H2O,L\nJ8,16,Boc-Val-OH,V,Leucine pHAA unit,45.0,Boc-Leu-OH H2O,L\nJ8,17,Boc-Lys(2Cl-Z)-OH,K,Leucine pHAA unit,46.0,Boc-Leu-OH H2O,L\nJ8,18,Boc-Asp(OcHx)-OH,D,Leucine pHAA unit,47.0,Boc-Leu-OH H2O,L\nJ8,19,Boc-Glu(OcHx)-OH,E,Leucine pHAA unit,48.0,Boc-Leu-OH H2O,L\nJ8,20,Boc-Leu-OH H2O,L,Leucine pHAA unit,49.0,Boc-Leu-OH H2O,L\nJ8,21,Boc-Gln-OH,Q,Leucine pHAA unit,50.0,Boc-Leu-OH H2O,L\nJ8,22,Boc-Lys(2Cl-Z)-OH,K,Leucine pHAA unit,51.0,Boc-Leu-OH H2O,L\nJ8,23,Boc-Leu-OH H2O,L,Leucine pHAA unit,52.0,Boc-Leu-OH H2O,L\nJ8,24,Boc-Ala-OH,A,Leucine pHAA unit,53.0,Boc-Leu-OH H2O,L\nJ8,25,Boc-Lys(2Cl-Z)-OH,K,Leucine pHAA unit,54.0,Boc-Leu-OH H2O,L\nJ8,26,Boc-Glu(OcHx)-OH,E,Leucine pHAA unit,55.0,Boc-Leu-OH H2O,L\nJ8,27,Boc-Val-OH,V,Leucine pHAA unit,56.0,Boc-Leu-OH H2O,L\nJ8,28,Boc-Gln-OH,Q,Leucine pHAA unit,57.0,Boc-Leu-OH H2O,L\nJ8,29,Boc-Lys(2Cl-Z)-OH,K,Leucine pHAA unit,,,",
    "After coupling the final amino acid of Peptide 1, repeat Steps A2-A5 (washing and Boc deprotection), then proceed with Steps A11-A14 (Peptide 1 acetylation at the N-terminus; see Note 15).Fmoc group deprotection: Drain all of the solvent, then add 5 ml of piperidine deprotection solution to the resin and stir gently. Insert the vessel and temperature probe into the microwave. Heat to 70 °C for 2 min.Resin washing: Drain the solvent using vacuum filtration, then wash the resin three times with DMF (~5 ml per wash; see Note 8).Repeat Step A16 for the second Fmoc group deprotection (5 min at 70 °C; see Note 16).Resin washing: Drain the solvent using vacuum filtration, then wash the resin five times with DMF (~5 ml per wash; see Note 8).Repeat Steps A6-A10 for the first leucine in the pHAAs.Repeat Steps A2-A10 for the remaining leucine’s, until the Peptide 2 (Figure 2) sequence is complete (Table 1, entry 43-57).After the final amino acid coupling of Peptide 2, repeat Steps A2-A5 (washing and Boc deprotection), then proceed with Steps A11-A14 (Peptide 2 acetylation at the N-terminus; see Note 15).Resin drying: Drain the solvent using vacuum filtration, then wash the resin using ~5 ml of DMF (three times), DCM (three times), then methanol (once). Remove all solvent and leave the resin under vacuum filtration for 5 min.Leave the vessel with the resin in a desiccator under reduced pressure overnight to fully remove the solvents.Measure the finished resin-Peptide 2, then weigh out 500 mg of the resin into a 15 ml Falcon tube (see Note 17).Peptide cleavage: Transfer the 500 mg of resin into a HF reaction vessel, then add 0.25 ml of p-cresol scavenger (0.5 ml/g of resin) and 5 ml of HF (10 ml/g of resin).",
    "Cleave the peptide from the resin following the HF-cleavage protocol (see Note 18 and Jadhav et al., 2020).Reaction work up: Wash the resin with 30 ml of cold diethyl ether:n-hexane (4:1; v/v) twice, then remove the solution through filtration. Dissolve the white precipitate using 50% Solvent A and 50% Solvent B (v/v), then filter the solution (from the resin) into a round-bottom flask. Wash the resin with Solvent B and collect the filtrate into a round-bottom flask. Freeze-dry the filtrate to obtain a yellowish-white powder (crude Peptide 2).Vaccine candidate purificationPurification (see Note 19): Dissolve 30 mg crude Peptide 2 in 2 ml of 50% Solvent A and 50% Solvent B (v/v). Load the solution into a 5 ml syringe and filter the solution through syringe-filter into a scintillation vial. Wash the filter with 2 ml of 50% Solvent A and 50% Solvent B (v/v). Run the filtered crude Peptide 2 using preparative RP-HPLC on a C4 column with solvent B gradients (65-85%) for 25 min, with compound detection at 214 nm.Analyze the fractions of the purified Peptide 2 using ESI-MS and analytical RP-HPLC on a C4 column with a 0-100% gradient of solvent B for 40 min and compound detection at 214 nm (see Note 20).Combine and freeze-dry the fraction based on its purity (as analyzed by ESI-MS and analytical RP-HPLC; Figure 3; Note 21). The final product should be a white solid. Molecular weight: 6521.03. ESI-MS [M + 4H]4+ m/z 1631.8 (calc. 1631.3), [M + 5H]5+ m/z 1305.6 (calc. 1305.2), [M + 6H]6+ m/z 1088.0 (calc. 1087.8), [M + 7H]7+ m/z 932.9 (calc. 932.6), [M + 8H]8+ m/z 816.3 (calc. 816.1), [M + 9H]9+ m/z 725.6 (calc. 725.6). tR = 30.9 min (0 to 100% solvent B; C4 column); purity ≥ 99%.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3973/bioprotoc-11-07-3973-g003.jpgFigure 3.",
    "Analysis of the purified vaccine candidate Peptide 2 by ESI-MS (left) and analytical RP-HPLC (right) Vaccine candidate characterizationMeasure 1.5 mg of pure Peptide 2 into a 2 ml microcentrifuge tube. Add 1 ml of PBS to prepare a 1.5 mg/ml solution (concentration of the vaccine candidate for the in vivo study). Vortex the mixture for 2-30 min (with 1-min intervals) until none of the solid peptide is visible (see Note 22).Size and PDI:Transfer 0.5 ml of self-assembled vaccine candidate (from Step C1) into a new 2 ml microcentrifuge tube, then add 1 ml of PBS to prepare a 0.5 mg/ml solution (1:3 dilution) for DLS analysis.Turn on the Malvern Zetasizer DLS, open the Analyzer software, and connect with the instrument before starting measurements.Fill the disposable cell with diluted solution (~800 µl) and insert the cell into the instrument.Perform measurements (size, PDI) at 25 °C with non-invasive backscatter at a backscattering angle of 173°. Correlation times are based on 10 s per run; at least 10 consecutive runs should be made per measurement. Take at least five measurements per sample, and measure PBS as a blank (negative control).Calculate the mean ± standard deviation for each sample using the five measurements.In general, compounds should self-assemble into a mixture of small nanoparticles (10-30 nm) and larger aggregates with high polydispersity indexes (PDI > 0.3, according to DLS).Morphology:Pipette 5 µl of the 1:3 diluted solution (the same as what was used for DLS) onto a glow-discharged carbon-coated copper grid and leave for 2 min to dry (see Note 23).Gently drain the excess liquid with a piece of filter paper and allow the grid to dry.",
    "Add one drop (~5 µl) of 2% phosphotungstic acid to the dried grid for 20 s to negatively-stain the sample, then drain the excess stain solution off with a piece of filter paper.Air-dry the grid for 5 min before observing it under TEM. Take images at an accelerating voltage of 100 kV (Figure 4).Distinct nanoparticles and chain-like aggregates of nanoparticles (CLAN) should be visible in Peptide 2 when viewed under TEM (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3973/bioprotoc-11-07-3973-g004.jpgFigure 4. Particle image of vaccine candidate Peptide 2 captured by TEM [bar 500 nm; the dark areas are a result of the negative stain (2% phosphotungstic acid)] Secondary structure:Transfer 0.1 ml of the self-assembled vaccine candidate (non-diluted sample from Step C1) into a new 2 ml microcentrifuge tube and add 1.4 ml PBS to prepare 0.1 mg/ml solution (1:15 dilution) for CD analysis (see Note 24).Set up the Spectra Manager software with the following parameters: bandwidth, 5 nm; scan rate, 50 nm/min; response time, 2 s; interval, 1 nm over the wavelength range of 195 to 260 nm.Insert the cell into the instrument and run a quick scan on an empty CD cell to make sure the cell is clean (the flat, horizontal line should be visible without substantial deviation from zero mdeg; see Note 25). Wash the cell if needed (see Note 26).Fill the CD cell with diluted solution (~200 µl) and insert the cell into the instrument. Take at least six accumulations per measurement. Run PBS or water as a blank (negative control). After all measurements, clean the cell with water or methanol, only.Using Spectra Manager, subtract the baseline spectra (PBS blank reading) from the vaccine candidate spectra before converting millidegrees (mdeg) to molar ellipticity ([θ]; degcm2dmol−1).",
    "The conversion is done via the following formula:[θ] = mdeg/(l × c × n) × 1000where:l = path length (0.1 cm),c = peptide concentration (mM), andn = number of amino acids in the peptide.The vaccine candidate Peptide 2 should adopt a helical conformation with a minimum at 222 nm and a lower-intensity minimum at 208 nm (Figure 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3973/bioprotoc-11-07-3973-g005.jpgFigure 5. Circular dichroism (CD) spectra of vaccine candidate Peptide 2"
  ],
  "subjectAreas": [
    "Microbiology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}