{
  "id": 15336,
  "origin_website": "Jove",
  "title": "Comprehensive DNA Methylation Analysis Using a Methyl-CpG-binding Domain Capture-based Method in Chronic Lymphocytic Leukemia Patients",
  "procedures": [
    "The ethical approval for collecting the CLL samples is from 2007-05-21, with the following registration number: EPN Gbg dnr 239/07. All CLL patients were diagnosed according to recently revised criteria8, and the samples were collected at the time of diagnosis. The patients in the study were included from different hematology departments in the western part of Sweden after written consent had been obtained. Only CLL peripheral blood mononuclear cell (PBMC) samples with a tumor percentage of leukemic cells ≥70% were selected in this study.\n1. Preparations\nIsolate PBMCs for DNA extractions from CLL and normal, healthy peripheral blood samples using a commercial isolation kit (see the Materials Table), according to the manufacturer's instructions.\nAutoclave 1.5 mL tubes. Thaw all reagents in the methylated DNA binding kit (see the Materials Table).\nUse DNase-free water to prepare 10 mL of 1x bead wash buffer from the 5x stock wash buffer provided by the kit to wash beads and dilute the MBD protein provided by the kit.\nObtain or prepare the following items in advance: 3 M sodium acetate, absolute ethanol, and 70% ethanol for DNA precipitation (Materials Table).\n2. Genomic DNA Extraction and Sonication\nUse a commercially available DNA extraction kit (Materials Table) to isolate genomic DNA from patient and normal PBMC samples according to the manufacturer's protocol. Quantify the genomic DNA using a spectrophotometer at 260 nm.",
    "NOTE: The DNA extraction column capacity is 5-6 million cells, maximum; hence, it is important to use more than one column for samples with more than 5 million cells. Elute the DNA twice in equal volumes totaling 100 µL of 10 mM Tris EDTA (TE) buffer. The MBD-biotin protein used in the methyl miner kit for MBD sequencing will not bind to single-stranded DNA. Thus, it is very important to keep the eluted DNA either frozen or at 4 °C to preserve its double-stranded nature.\nDilute 5 µg of genomic DNA from each sample to a total of 200 µL using TE buffer (pH 8), giving a final concentration of 25 ng/µL.\nPerform sonication in specially designed tubes using a sonicator (Materials Table) for a total of 30 cycles (30 s on and 30 s off per cycle; after every 5 cycles, briefly spin the tubes to collect the samples to the bottom).\n\tNOTE: This will produce fragmented DNA ranging between 150 bp and 300 bp, which is optimal for this protocol.\nCheck the sonication range for all samples before proceeding to the next step of MBD sequencing by running 1 µL of the fragmented DNA samples and a DNA size ladder on a commercially available, pre-cast 2% agarose gel using DNA electrophoresis imaging equipment. Visualize the DNA using a standard UV transilluminator.\n3. Bead Preparation Prior to Binding with MBD-biotin Protein\nResuspend the magnetic streptavidin beads from the stock tube provided by the kit, gently pipetting up and down to obtain a homogenous suspension. Do not vortex the beads or allow them to dry.",
    "Place 50 µL of beads (for each 5 µg of fragmented DNA sample) in separate, clean, and labelled 1.5 mL tubes. Add 50 µL of 1x bead wash buffer to reach the final volume of 100 µL.\n\tNOTE: When using small 0.5 mL polymerase chain reaction (PCR) stripes for washing beads, around 150-200 µL of wash buffer per tube is used, as mentioned in the kit protocol. However, in the case of 1.5 mL tubes, add at least 250 µL to 300 µL of wash buffer per tube for the bead wash.\nPlace the tubes on a magnetic stand for one minute to allow all the magnetic beads to concentrate on the inner wall of the tube facing the magnet. Remove the liquid, without touching the beads, using a 200 µL pipette.\nRemove the tubes from the magnetic stand, add 250 µL of 1x bead wash buffer, and mix the beads gently with a pipette.\nRepeat steps 3.3 and 3.4 at least 4-5 times for all samples and finally resuspend in 250 µL of 1x bead wash buffer. Keep them on ice.\n4. Binding the MBD-biotin Protein to the Washed Beads\nAdd 35 µL of MBD protein (7 µL for 1 µg of DNA sample) to separate tubes and bring the total volume up to 250 µL using 1x bead wash buffer.\nAdd 250 µL of diluted MBD protein to the 250 µL of washed beads and leave them on end-to-end rotation at room temperature for 1 h.\nAfter mixing the beads and protein for 1 h, wash the MBD protein biotin bound with magnetic streptavidin beads.",
    "Place the tubes on the magnetic stand for 1 min and remove the liquid without touching the beads using a pipette. Add 250 µL of 1x bead wash buffer and place the tubes on a rotation mixer for 5 min at room temperature.\nRepeat step 4.3.1 two more times and finally resuspend the washed MBD-biotin beads in 200 µL of 1x bead wash buffer, making the beads ready for methylated DNA capture.\n\tNOTE: Washing 2-3 times in this manner removes all the background unbound MBD protein beads and improves the efficient binding of MBD protein-coupled beads with fragmented genomic DNA.\n5. Binding MBD-biotin Beads with Fragmented Genomic DNA\nIn a clean 1.5 mL DNase-free tube, add 100 µL of 5x bead wash buffer and 180 µL of the fragmented genomic DNA (step 2.3). Bring the final volume to 500 µL using DNase free water.\nAdd 380 µL of DNase-free water to the remaining 20 µL of the fragmented genomic DNA and freeze them. Use these samples as input DNA controls and precipitate them later along with the final eluted methylated DNA samples (see step 7.1).\nPlace the tubes containing washed MBD-biotin beads (step 4.4) on a magnetic stand for 1 min and remove the liquid without disturbing the beads. Add 500 µL of fragmented genomic DNA diluted in bead wash buffer.\nSeal all the tubes tightly with paraffin film and leave them overnight at 4 °C on an end-to-end rotation stand at 8-10 rpm.\n\tNOTE: The DNA and biotin-bead binding reaction can be done for 1 h at room temperature, but leaving it at 4 °C overnight can improve the recovery of the final methylated DNA.\n6. Removing the Unbound DNA and Eluting the Methylated DNA from the Beads",
    "After the DNA and MBD-bead binding reaction, place the tubes on the magnetic rack for 1 min to concentrate all the beads on the inner wall of the tube.\nRemove the supernatant liquid with a pipette without touching the beads and save this unbound DNA sample fraction on ice.\nAdd 200 µL of 1x bead wash buffer to the beads and place the tubes on the rotating stand for 3 min at room temperature. Place the tubes on the magnetic stand and remove the liquid. Repeat the wash another two times to remove the residual unbound DNA.\nAfter the final wash, add 200 µL of high-salt elution buffer (2,000 mM NaCl), provided in the kit to elute the DNA.\nPlace the tubes on the rotating stand for 15 min at room temperature. Place them on the magnetic stand for 1 min and use a pipette to carefully transfer the supernatant to a new, clean 1.5 mL tube.\nAdd 200 µL of high-salt elution buffer and repeat the elution by rotating the tubes at room temperature for 15 min. Add the second elute to the same tube containing the 200 µL of the first elute.\n\tNOTE: The final 400 µL of total eluted DNA is now ready for ethanol precipitation to extract the purified DNA suitable for next-generation sequencing.\n7. Ethanol Precipitation and the Enrichment of Methylated DNA\nAdd 1 µL of glycogen (20 µg/µL; included in the kit); 40 µL of 3 M sodium acetate, pH 5.2; and 800 µL of ice-cold absolute ethanol to 400 µL of eluted DNA and also to the 400 µL of input DNA samples prepared in step 5.2.\nMix the tubes well by vortexing and incubate them at -80 °C overnight.",
    "Centrifuge the tubes at 12,000 x g (maximum speed) and 4 °C. Discard the supernatant carefully, without disturbing the pellet, add 500 µL of 70% ethanol, and vortex the tubes.\nCentrifuge again at maximum speed for 15 min at 4 °C and remove the supernatant by carefully using a pipette.Centrifuge the tubes at maximum speed for 1 min at room temperature and remove the residual ethanol completely using a pipette tip.\nAir-dry the pellet for 5 min at room temperature. Add 10 µL of DNase-free water to the DNA pellet. Proceed to the methylated DNA quantification (step 7.6), MBD sequencing (step 7.7), and analysis (sections 8 and 9).\nQuantify the final recovered methylated DNA samples using a commercially available fluorometric quantitation kit (see the Materials Table), according the manufacturer's instructions.\nNote: Using this protocol, 30-50 ng of final DNA was recovered from each sample. DNA samples are ready to send on dry ice for downstream library construction and high-throughput MBD sequencing\nPerform DNA library constructionand high-throughput MBD sequencing using a commercial platform (Materials Table), as described in reference9.\n\tNOTE: For the initial quality control of the final methylated DNA, perform library preparations using 50-bp pair-end sequencing for all samples. Process the raw data for post-sequencing quality control, as elaborated in step 8.1, and further process it using bioinformatics approaches and statistical methods, as described below (steps 8.2-9.6).\n8. Bioinformatics Analysis Method 1: Identifying CLL-associated Differentially Methylated Regions (cllDMRs)\nClean the obtained 49-bp reads (FASTQ format) for adaptors using available quality-control tools, such as Trimmomatic10 or Cutadapt. Crosscheck the quality of the trimmed reads using the FastQC toolkit:\n\tjava -jar trimmomatic.jar SE SAMPLE_uncleaned.fastq SAMPLE.fastq ILLUMINACLIP:adapters.fasta:2:30:10\nAlign the cleaned FASTQ files with short-read genome aligner Bowtie against a reference genome11. Specify the parameters as below:",
    "Allow up to two mismatches (Bowtie parameter: -v 2).\nLimit the reporting to the six best alignments per read (Bowtie parameter: -m 6) to control for multi-mapping reads.\nbowtie -v 2 -a -m 6 HG19_INDEX -S SAMPLE.fastq > SAMPLE.sam\n\t\tNOTE: Convert the SAM files generated for individual samples after alignment into BAM using SAMtools.\nsamtools view -bS -o SAMPLE.bam SAMPLE.sam\nUse the model-based analysis of ChIP-Seq (MACS) peak caller on aligned samples (BAM) to predict enriched/methylated regions from the CLL subgroups12.\n\tNOTE: Comparison I: Use the Input sample as the control group and both the Normal and CLL patient samples as treatment groups. This step is to collect all negative peaks (peaks enriched in Input/background). Comparison II: Use the Normal sample group as the control group and the CLL patient sample group as the treatment group. Obtained positive peaks are CLL hyper-methylated regions, and negative peaks are CLL hypomethylated regions over normal or differentially methylated regions (DMRs).\nmacs14 -t SAMPLE_TREATMENT.bam -c SAMPLE_CONTROL.bam --format BAM -g hs\nRemove Comparison I background peaks from differentially methylated regions (DMRs) using BEDtools13.\nbedtools subtract -a <CLL_enriched_regions> -b <Input_enriched_regions>\nPredict the percentage of repeat elements (SINE-Alu, LINE, etc.) enriched in DMRs.\nUse fastacmd to extract the FASTA sequence of DMRs by the chromosomal coordinates from reference genome HG19.\n\t\tfastacmd -d HG19_genome.fa -s Chromosome -L Start,End -l 50000 > DMRs.fasta\nUse the RepeatMasker commandline tool to predict the percentage of repeat elements present in teh FASTA sequence of DMRs.\n\t\tRepeatMasker -gc -gccalc -s -species human -html DMRs.fasta\nAnnotate the predicted DMRs using Homer \"annotatePeaks.pl\" with the available Ensembl [PMC4919035] or Gencode [PMID 22955987] transcript annotation (protein-coding and noncoding transcripts).\nannotatePeaks.pl DMRs.bed <GENOME> -gtf <Ensembl or Gencode GTF>",
    "NOTE: This provides information on the distribution of peaks over different genic regions (i.e., promoter, exon, intron, 3' UTRs, and 5' UTRs) and intergenic regions. Transcripts or genes associated with DMRs are called differentially methylated genes (DMGs).\nUse the enrichment tool with the updated or current functional database to find functions enriched by CLL DMGs (only protein-coding genes)14.\n\tNOTE: Gene Set Clustering based on Functional Annotation (GeneSCF)14 is a real-time-based tool for functional enrichment analysis that uses updated KEGG and Gene Ontology as a reference database.\n9. Bioinformatics Analysis Method 2: Identifying CLL-associated Significantly Differentially Methylated Regions (cll sigDMR's)\nFollow steps 8.1-8.5 from method I (section 8) and use read-count-based differential enrichment analysis by utilizing the available tools, as elaborated in steps 9.2 - 9.6, to add one more level of statistics to the analysis pipeline.\nQuantify the number of reads mapped to individual peaks or DMRs in Normal and CLL patient samples using \"featureCounts\" from the \"Subread\" package15.\n\tsubread/bin/featureCounts -Q 30 -F SAF -a DMRs.SAF -o DMRs_counts.table SAMPLE_TREATMENT.bam SAMPLE_CONTROL.bam\n\tNOTE: A mapping quality filter can be introduced to avoid quantifying bad-quality reads (e.g.,-Q 30). For this step, prepare SAF files for the obtained DMRs. For more information on SAF file format, please use this link http://bioinf.wehi.edu.au/featureCounts/.\nUse a RAW read-count table containing the number of reads for the individual peaks in Normal and CLL patient sample groups in edgeR as the input16.\n\tNOTE: Compare normal versus CLL patient sample groups to find sigDMRs. For differential enrichment analysis, follow the guide from edgeR for detailed step-by-step instructions (https://bioconductor.org/packages/release/bioc/vignettes/edgeR/inst/doc/edgeRUsersGuide.pdf).\nFilter the sigDMRs using the false discovery rate (FDR) and log-fold change predicted by edgeR16.\nAnnotate the predicted sigDMR's using Homer \"annotatePeaks.pl\" with the available Ensembl or Gencode transcript annotation (protein-coding and noncoding transcripts).",
    "annotatePeaks.pl sigDMRs.bed HG19_genome.fa -gtf <Ensembl or Gencode GTF> -CpG\n\tNOTE: This provides information on the distribution of peaks over different genic regions (i.e., promoter, exon, intron, 3' UTRs, and 5' UTRs) and intergenic regions. Transcripts or genes associated with sigDMRs are called sigDMGs.\nUse an enrichment tool with the updated or current functional database to find functions enriched by CLL sigDMGs (only protein-coding genes)14.\n\tNOTE: GeneSCF, one of the real-time tools for functional enrichment analysis, uses KEGG and Gene Ontology as reference databases.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}