{
  "id": 4956,
  "origin_website": "Bio",
  "title": "Stable Isotope Resolved Metabolomics Studies in <em>ex vivo</em> TIssue Slices",
  "procedures": [
    "Tissue procurementAll tissue must be procured under an IRB approved protocol. As live human tissue is handled, all personnel must undergo and maintain biosafety, HIPAA and CITI certifications. An overview of the whole process is given in Scheme 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160205/20160205173142_9785.jpgScheme 1. FlowChart. Preop: Preoperative room; OR: Operating Room. The number of thin slices to be taken depends on the size of the tumor. A piece of tissue is also flash frozen in the OR, and additional tissue is placed in formalin for pathological analysis.Blood samples provide overall information about the metabolic status of the individual subjects, and the buffy coat can be used for extracting DNA or RNA for sequence analysis.A 10 ml sample of blood should be drawn preoperatively into a purple top vacutainer (K2-EDTA) preoperatively. Other anticoagulants such as citrate or heparin should not be used as they interfere with metabolic assays. A blood sample should also be drawn perioperatively after resection. The blood is inverted twice to ensure dissolution of the EDTA, and kept on ice immediately after blood draw. The blood should be separated into packed red cells, buffy coat and plasma within 30 min by centrifuging at 3,500 x g for 15 min at 4 °C in a swing out rotor.Subsequent operations should be carried out in a BSL2+ biosafety cabinet.Note: We use the following color codes for storage: Red = whole blood, yellow = plasma, green = buffy coat, blue = urine.Plasma is aspirated into prechilled sterile 2 ml screw cap vials at 1 ml aliquots and flash frozen in liquid N2. Buffy coat is aspirated using a wide mouth plastic pipette into a 2 ml screwcap vial and flash frozen in liquid N2.",
    "These experiments have been carried out on fresh slices of paired cancerous (CA) and non-cancerous (NC) lung tissues resected from non-small cell lung cancer (Xie et al., 2014) and pancreatic cancer patients. Upon resection, thin slices (0.5-1 mm thick) of tissue are excised from the surface of visually non-necrotic or fibrotic tumor regions using a Weck microtome in the Operating Room (OR), within approximately 5-10 min of resection. Roughly 1 cm2 tissue is targeted (see Figure 1 A). Control non-cancerous tissue from a distant (>10 cm) region is obtained similarly. A pathologist on-site inspects the CA and NC tissue specimens. Highly necrotic tissue is discarded.At the same time, a small piece of bulk CA tissue should be placed in DMEM or other appropriate medium kept room temperature for implantation into a recipient NSG mouse as patient-derived xenograft or PDX. A small piece each of CA and NC tissues is soaked in formalin for pathological examination or flash frozen in liquid N2 for image-based metabolic analysis. Where tissue acquisition in the OR is impractical (such as colorectal or breast cancer resections), the slices can be prepared in the pathology laboratory located close to the OR. For comparison with freshly resected tissue, speed is essential as metabolism is rapidly changing. Whenever feasible, tissue freezing should be performed in the OR.The slices are placed into a drop of sterile PBS on two sterilized weigh boats to prevent sticking and for spreading slices evenly. Each weight boat is pre-numbered for CA or NC slices. The tissues on weight boats are then photographed. Each slice is rinsed briefly with sterile PBS, blotted (twice) and then carefully placed into pre-numbered (using ethanol-resistant marker pen) pre-tared (tare weight recorded) T25-flasks containing 10 ml DMEM (or other relevant medium) with the appropriate tracer (e.g.",
    "10 mM 13C6-glucose or 2 mM 13C5, 15N2-glutamine), 10% dialyzed FBS (as needed), and 1x penicillin + streptomycin. The flasks with slices are brought to the culture room as soon as possible and sprayed with 70% ethanol, and wiped dry before placing them in the Biosafety hood. Pipet 200 μl culture media from each flask into 1.5 ml snap-cap tubes (t0-time zero media samples). Centrifuge for 10 min at 10,000 x g at 4 °C to remove tissue debris. Transfer 100 μl to tared 1.5 μl snap-cap tube for metabolite extraction and weigh the media transferred. Transfer the remaining media to a 1.5 ml screw-cap tube for long-term storage at -80 °C.Weigh flasks in a 2-place balance inside the Biosafety hood and record weight on the flask. Transfer flasks to a CO2 incubator containing a rocker set to low amplitude rocking (sufficient to ensure that the liquid moves over the slices without non-laminar flow) Figure 1B) set to 37 °C and 5% CO2, with oxygen set to the desired level (e.g. 20%, 1%).The flasks are continuously and gently rocked for 24 to 48 h for gas exchange and to maintain constant nutrient supplies at the tissue surface, while avoiding local buildup of waste products such as acids. As needed, the medium can be refreshed every 12 h, and sampled at 0, 6, 12, 24…. h for analysis of nutrient uptake and waste production. The flasks are weighed before and after each medium sampling point and flask weights are recorded on the flasks.Tissue HarvestingAfter 24 h incubation, weigh flasks. Place flasks on ice immediately after removing from the incubator to minimize further metabolism. Up to 6 flasks can be harvested at a time. Keep tissue slices on ice as much as possible during harvest.",
    "Using a transfer pipet, aspirate and transfer the conditioned media into 15-ml conical centrifuge tubes.Centrifuge media for 15 min at 3,500 to 4,690 x g, 4 °C to remove any particulates and debris.Pipet 100 μl T24 media supernatant into 1.5-ml snap-cap tubes for metabolite extraction.Pipet 1 ml media aliquot into 2-ml screw-cap tubes for long-term storage at -80 °C.The remaining medium is stored separately in a 7 ml vial at -80 °C for purposes such as exosome isolation.Invert and tap the flask to move the tissue slices into the cap or neck region of the flask for retrieval. Keep flask inverted on ice.Wash tissue slices 3x consecutively in ice-cold 10 ml cold PBS each in a 50 ml beaker. Blot dry the tissue slices on Kimwipe and photograph the flattened slice on a small weigh boat.Weigh the whole tissue slice on small weigh boats and record the weight. Split a very small piece for preservation in 1 ml buffered formalin in a 1.5 ml snap-cap tube for histology. The remaining tissue slice is split evenly and each piece should weigh no more than 20-30 mg by wet weight to facilitate tissue homogenization and extraction efficiency. Immediately after weighing, each piece is flash-frozen in liq. N2 and placed in a pre-liq. N2 chilled 1.5-ml snap-cap tube for long-term storage at -80 °C. After 6-8 h in formalin, replace the formalin with 70% ethanol for the tissue pieces prepared for histology.Homogenize tissues in cold 60% acetonitrile (v/v) and extract tissue homogenates for metabolite analyses according to standardized protocols (Fan, 2012; Fan, 2010) before analyses using stable isotope-resolving analytical techniques (e.g. NMR and MS) (Fan, 2012) (Figure 1C) (Lane et al., 2008).This Protocol describes the procedure for stable isotope labeling of thin tissue slices.",
    "SIRM analysis involves the quantification of isotopomers (by NMR) and isotopologues (MS) that result from metabolic transformations of source molecules (e.g. 13C glucose or 13C, 15N Glutamine) in cells or tissue (Figure 1C). The techniques of SIRM analysis by NMR and mass spectrometry are described in detail in Sellers et al. (2015); Lane et al. (2008) and Fan et al. (2012)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}