{
  "id": 7549,
  "origin_website": "Bio",
  "title": "Analysis of Heterocyst and Akinete Specific Glycolipids in Cyanobacteria Using Thin-layer Chromatography",
  "procedures": [
    "Cell culture The protocol requires cyanobacterial cultures grown in the presence of NO3- (filaments with vegetative cells only) and without NO3- (filaments containing heterocysts), or the cultures that were induced to form akinetes (Perez et al., 2016).Thin-layer chromatography (TLC) Day 1. Sample preparation Take 3 × 1 mL of each culture and estimate the chlorophyll a concentration as described (Zavřel et al., 2015).Note: To obtain a good visible lipid pattern in the TLC plates, the sample should contain 20–50 µg Chl a. Centrifuge the estimated volume of culture at 3,000 × g and room temperature (RT) for 10 min (the cells were pelleted at equal Chl a amount in each sample).Add 30 mL of methanol:chloroform (1:1) to the pellet and mix well with a vortex mixer. This step will result in the extraction of lipids.Note: Always work under the fume hood when using organic solvents. Centrifuge at 3,000 × g for 10 min and transfer the supernatant to a 50 mL glass flask.Let it evaporate overnight under a fume hood. You may accelerate evaporation by applying a stream of nitrogen vapor. This would be necessary if detailed analysis is intended, such as precise identification and quantification of different glycolipid species by high performance liquid chromatography coupled to mass spectrometry (HPLC-MS).Day 2 Sample collectionAdd 200 µL of chloroform to the dried extract in the glass flask, dissolve the pellet by pipetting, collect the lipids and transfer to 1.5-mL microcentrifuge tubes. Repeat this step one more time to collect all the extract from the flask (This step should be done quickly because the chloroform evaporates very fast).Let the sample dry in the fume hood until a volume of 20–40 µL remains in the tube.Preparation of developing chamberAlways prewash the chamber with methanol before doing an experiment.",
    "Mix the solvents (chloroform:methanol:acetic acid:water) in the chamber, at a ratio of 23:4:2.7:1 (170 mL of chloroform, 30 mL of methanol, 20 mL of acetic acid, and 7.4 mL of MilliQ water).Close the lid and seal the tank with paper tape. Do not move the chamber.Before using the solvent system (solvent mixture), equilibrate the chamber with it for 1 h.Spotting of samples and development of the TLCNote: This can be done while the chamber is being equilibrated. Using a soft pencil, mark the origin line (the line at which you will spot the samples) at 2 cm and the development line at 15 cm (predetermined solvent front height) from the bottom of the TLC plate.Notes:  Always handle the TLC plate with gloves on. Never touch the surface of the plate even with gloves. Mark only the outer edges of the TLC plate, because the pencil may interfere with the samples and solvent. Use a micropipette (P20) to spot 5–10 µL of the samples on the origin line, at a distance of at least 1 cm from each other.After spotting, use a hair drier in low heat mode to dry the spots.Repeat steps b. and c. until the entire sample is used up and dried.Quickly place the TLC plate in the chamber to prevent solvent vapor elusion from the chamber.Let the samples run until they reach the development line (~1.5 h).Take the plate out from the chamber, and let it dry under the fume hood for 10–20 min (do not use a hair drier).Note: Always remove the remainder of the solvent from the chamber and transfer it to the organic waste.",
    "When the plate is completely dry, spray the whole plate with H2SO4 (25%) with a TLC sprayer, from a distance of 5–10 cm under the fume hood (spraying close to the plate can obfuscate the result).Note: Use lab apron, gloves, and surgical mask. Allow the plate to dry under the fume hood for a short time (2–5 min).Place the plate into an oven at 180°C for 60–120 s (until you see the bands).Use a flat-bed scanner to record the result (see Figure 2)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}