{
  "id": 10108,
  "origin_website": "Jove",
  "title": "Engineering Antiviral Agents via Surface Plasmon Resonance",
  "procedures": [
    "For the present study, a CVN-small ubiquitin-like modifier (SUMO) fusion protein has been used in enzyme-linked immunosorbent assays instead of CV-N and is suitable for cell-based assays. Recombinant full-length influenza A virus HA H3 protein is obtained commercially (see Table of Materials) or expressed in mammalian HEK293 cell lines and baculovirus-infected insect cells according to standard protocols12. Wuhan-1 spike protein is expressed in mammalian HEK293 cells. The synthesis of monomannosylated peptide (MM) and dimannosylated peptide (DM) allows the detection of homogeneous ligands to CVN2 and monomannosylated small molecule10.\n1. Creating CV-N constructs\nFor each of the CVN2 variants and CVN2L0 protein (PDB ID 3S3Y), obtain the gene construct with an N-terminal pelB leader sequence and His-tag in pET27b(+) vector from commercial sources (see Table of Materials, Supplementary File 1).\nObtain CVN2L0 and its variants (V2, V3, V4, and V5; Figure 2A,C) in the background of a CVN2L0 template gene consisting of two distinct DNA sequences for each CV-N repeat.\nDissolve the lyophilized plasmid DNA in sterile deionized distilled water (ddH2O) to a final concentration of 100 ng/µL.\n2. Preparation of LB-agar plates with plasmid DNA transformed cells\nPrepare culture medium LB-Lennox by dissolving 10 g/L of peptone, 5 g/L of yeast extract, and 5 g/L of NaCl in ddH2O (see Table of Materials), and adjust the pH to 7.4. Perform the transformation into competent E. coli BL21 (DE3) for each variant (V2-V5) by chemical method following a previously published report10.\nSplit the solution (900 µL and 100 µL), transfer 100 µL on LB-agar plates (50 µg/mL kanamycin), and gently use a sterile cell spreader. Incubate the agar plates overnight at 37 °C.\n3. Cloning\nSubclone the gene for CV-N into the NdeI and BamHI sites of pET11a (see Table of Materials) for transformation (electroporation) into electrocompetent cells following reference27.",
    "4. Site-directed mutagenesis\nTo generate CVN2L029 and mutant CVN-E41A in the background of a CVN2L0 template gene containing two distinguished DNA sequences for each CV-N repeat27.\nMake mutations using a site-directed mutagenesis kit (see Table of Materials) and specific mutagenic primers 5'-gagaaccgtcaacgtttgcgataacagagttcagg-3' and 5'-cctgaactctgttatcgcaaacgttgacggttctc-3' for running the PCR31.\n\t\nStart a series of sample reactions using multiple concentrations of double-stranded DNA (dsDNA) template ranging from 5-50 ng (e.g., 5, 10, 20, and 50 ng of dsDNA template). Keep the primer concentration constant.\n\t\tNOTE: The PCR mix and thermal cycling protocol are generally used as described in the instruction manual for the site-directed mutagenesis kit32.\nAdd the Dpn I restriction enzyme (1 µL, 10 U/µL, see Table of Materials) below the mineral oil overlay. Thoroughly and gently mix reactions, spin down in a table-top microcentrifuge for 1 min, and incubate immediately at 37 °C for 1 h for digesting the parental supercoiled dsDNA.\n5. Transformation of bacterial cells\nThaw the XL1-Blue supercompetent cells (see Table of Materials) gently on ice. To transform each control and sample reaction, aliquot the supercompetent cells (50 µL) to a prechilled polypropylene round-bottom tube (14 mL).\n\t\nTransfer 1 µL of the Dpn I-treated single-stranded DNA (ssDNA) from each control and sample reaction (mutated ssDNA) to separate aliquots of the supercompetent cells, which synthesize the complementary strand. Swirl the transformation reactions carefully to mix and incubate the reactions on ice for 30 min.\n\t\tNOTE: Before transferring the Dpn I-treated DNA to the transformation reaction, it is recommended to remove any remaining mineral oil carefully from the pipette tip. As an optional control, the transformation efficiency of the XL1-Blue supercompetent cells needs to be checked by mixing 0.1 ng/µL of the pUC18 control plasmid (1 µL) with a 50 µL aliquot of the supercompetent cells.",
    "Apply heat pulse to the transformation reactions at 42 °C for 45 s, and then place the reactions on ice for 2 min.\n\tNOTE: The applied heat pulse has already been optimized for the mentioned conditions in polypropylene round-bottom tubes (14 mL).\nAdd 0.5 mL of NZY+ broth (containing per liter: 10 g of NZ amine (casein hydrolysate), 5 g of yeast extract, 5 g of NaCl, 12.5 mL of 1 M MgCl2, 12.5 mL of 1 M MgSO4, 10 mL of 2 M glucose, pH 7.5, and preheated to 42 °C) and incubate the transformation reactions at 37 °C with shaking at 225-250 rpm for 1 h. Plate the correct volume of each transformation reaction (5 µL from control plasmid transformation; 250 µL from sample transformation) on LB-ampicillin agar plates.\n\tNOTE: For the transformation controls and mutagenesis, spread cells on LB-ampicillin agar plates having 5-bromo-4-chloro-3-indolyl-β-D-galactopyranoside (X-gal, 80 µg/mL) and isopropyl-1-thio-β-D-galactopyranoside (IPTG, 20 mM) (see Table of Materials). Inoculate 50 mL of the cell cultures with a single colony of transformed E. coli cells to purify mutated plasmid DNA for analyses. Mutagenesis is confirmed by DNA sequencing at an external facility.\n6. Expression and protein purification\nFor a large-scale culture, inoculate a small amount of LB (containing ampicillin) with a single colony from the transformed plate.\nUsing the overnight culture, inoculate the expression culture with additives, such as 10 mM of MgCl2, 10 mM of MgSO4, and 20 mM of glucose, diluting the seed culture to 1/100.\n\t\nGrow cells with vigorous shaking at 37 °C. Grow cells to an Abs 600 nm between 0.4-0.6 (mid-log phase) before cooling the cells to 20 °C. Induce with 1 mM IPTG and grow overnight.",
    "Then, harvest the cells by centrifuging at 4,000 x g for 15 min at 4 °C, and discard the supernatant with a pipette.\nResuspend the cell pellet in phosphate-buffered saline (PBS) buffer and re-centrifuge at 4,000 x g for 15 min at 4 °C. Then, discard the supernatant with a pipette. Resuspend the remaining pellet in 10 mL of lysis buffer and incubate the suspension for 1 h at 37 °C.\n\tNOTE: Composition of lysis buffer: (50 mM of NaH2PO4, 300 mM of NaCl, 2% Triton-X100, 500 ng/mL of lysozyme, 1 mM of phenylmethylsulfonylfluoride (PMSF), 1 mM of dithiothreitol, 1 mM of MgCl2, pH 8, see Table of Materials).\n\t\nSubject the mixture to two freeze-thaw cycles (-80 °C). Separate soluble and insoluble fractions by centrifugation at 4,000 x g for 15 min at 4 °C and analyze them using polyacrylamide gel electrophoresis (PAGE), in particular, sodium dodecyl sulfate (SDS)-PAGE33(Figure 2B,C).\n\t\tNOTE: Cells can be lysed in several ways, such as freeze-thaw, sonication, homogenization, enzymatic lysis, or a combination of these methods. Purification from inclusion bodies is recommended for collecting high protein yields26.\nPurify proteins using Ni-NTA column chromatography (see Table of Materials). Load the soluble fraction onto a regenerated Ni-NTA bead column (1 mL/min). Wash the system with TBS buffer (50 mM of Tris, 150 mM of sodium chloride, pH 7.5) before starting a gradient (0-100% 500 mM imidazole in TBS over 60 min) and collecting fractions (1 mL/min). Dialyze the purified proteins for biochemical characterization against 100 mM PBS (Figure 2C,D).\nAlternatively, use His-Select Ni2+ affinity gel (see Table of Materials) in 14 mL tubes to bind and re-suspend his-tagged recombinantly expressed CV-N in buffer solutions with 20 mM imidazole and 250 mM imidazole, respectively. Incubate in batch for at least 30 min.",
    "NOTE: Apply these semi-purified proteins to a single-use prepacked column for buffer exchange and cleanup of biological samples, for example, carbohydrates and proteins, which can load 1-1.5 mL eluate from immobilized metal affinity chromatography.\nTransfer the protein solutions to centrifugation tubes with a 10 kDa cut-off filter (see Table of Materials) and concentrate them by centrifuging for 10 min at 4,500 x g and 4 °C. For SPR measurements, exchange the analyte solutions to 10 mM HEPES, 150 mM sodium chloride, 3 mM ethylenediaminetetraacetic acid (EDTA), and 0.05% Tween20, pH 7.4 (HBS-EP(+), see Table of Materials).\n\t\nAdd this SPR running buffer to a dilution factor of 1:10 and centrifuge four times to the initial volume for 10 min at 4,500 x g and 4 °C.\nDetermine the protein concentration at 280 nm using a NanoDrop UV-Vis spectrophotometer (see Table of Materials) based on the calculated extinction coefficient (20,440 M-1 cm-1) for the main protein CVN2L0 showing a size of 23,474 Da34. Use PBS (100 mM, pH 7.0) or SPR buffer as a blank, and measure the protein concentration at three dilution steps (1:1, 1:10, and 1:100).\nimgsrc://cloudfront.jove.com/files/ftp_upload/63541/63541fig02.jpg",
    "Figure 2: CV-N sequences and expression. (A) CVN2 without a linker between each CV-N repeat (101 amino acids each) and four disulfide bridges is expressed in pET11a vector in E. coli. (B) Expressions of two independent colonies for CV-N (monomer) and CVN2 (dimer). (C) Disulfide bond variants are purified and analyzed on SDS-PAGE. A low molecular weight marker (6 µL) is used as a reference. WT = CVN2L0 bearing four disulfide bridges as marked in (A). V2 is a variant with a disulfide bond replacement by polar residues at positions 58 and 73. V3-V5 are variants with two remaining S-S bonds and either polar (C58E-C73R) or non-polar (C58W-C73M) substituting amino acids or a combination of these residue pair substitutions. (D) HPLC chromatograms of purified CVN2L0 are elutated at a flow rate of 1 mL/min with a linear gradient from 5%-65% buffer B in buffer A over 30 min. Buffer A is: 0.1% (v/v) trifluoroacetic acid in ddH2O, buffer B is: 0.08% (v/v) trifluoroacetic acid in acetonitrile. Protein is analyzed on a high-performance silica gel 300-5-C4 (150 x 4.6 mm) column at 214 nm and 280 nm. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63541/63541fig02large.jpg]\n7. SPR spectroscopy\nUse the Dual Channel SPR system (see Table of Materials) with running buffer HBS-EP(+) and 10 mM glycine HCl pH 1.5-1.6 as the regeneration buffer. Turn on the instrument, degasser, auto-sampler, and pump and wash the entire system with ddH20 for 1 h. Place ready-to-use running buffer in a separate bottle.\nDrop emersion oil onto the detector and mount a glass sensor chip (see Table of Materials) coated with a thin gold film and on the upper side functionalized with carboxymethyldextran hydrogel directly onto the detector below the three-port flow cell. Fix the setting by pulling down the handling.",
    "NOTE: C19RBDHC30M 200 nm streptavidin derivatized carboxymethyldextran hydrogel with a medium density of biotinylated severe acute respiratory syndrome coronavirus-2 RBD protein, is a ready-to-use sensorchip with the pre-immobilized ligand.\n8. SPR binding assay for CV-N binding to HA, S protein, and RBD\nImmobilize the proteinaceous ligands to sensor chips following the steps below.\n\t\nOpen a run table by clicking on Form in the menu bar and Run Table Editor in the integrated SPRAutoLink software (see Table of Materials). Choose and click on BASIC_Immobilization from the list of available run tables and follow the steps of the experimental procedure on the computer screen. The respective Sample Editor used is shown in the right upper corner.\nClick on Sample Set Editor in the Form section to fill out the reagents list for two racks placed in the autosampler for further analyses. Click on Autosampler Direct Control as a \"Tool\" in the menu bar to bring the racks forward or back home. Choose 4 °C as the operating temperature.\n\t\tNOTE: The SPR software allows for \"SPR Instrument Direct Control\" and \"Pump Direct Control\" via selecting the corresponding tools, as well as autosampler-handling, and by clicking on Form; also Run Table Editor, Data-Plot, or Post-Processing can be chosen to perform data analysis. Files are directly saved in the default directory and exported as scrubber.files from the Post-Processing window.\nStart the pump to infuse ddH20 by clicking on Tools and Pump Direct Control and record data by clicking on SPR Instrument Direct Control, and each time Start in the newly appearing windows. Put the coupling reagents (step 8.3) in 300 µL vials, put them into the autosampler racks and start the run table by clicking on Run.",
    "NOTE: Chip surfaces are either conditioned with 10 mM glycine buffer pH 9.0 or may have been flushed with 1 M sodium chloride, 0.1 M sodium borate buffer pH 9.0 to condition carboxyl derivatized chip surface for EDC/NHS activation mix30.\nFor this simple protein-protein interaction, use the CMD500D chip (see Table of Materials) to generate a micro-refractive index units (µRIU) = 2500 - 3000 flow cell with immobilized HA and µRIU = 400 flow cell with spike protein. At an infuse flow rate of 15 µL/min, inject an aqueous and equal mixture of 0.4 M N-ethyl-N'-(dimethylaminopropyl) carbodiimide hydrochloride (EDC*HCl) and 0.1 M N-hydroxysuccinimide (NHS) by applying the following sequential steps.\n\t\nRefill pump refill at 25,000 µL/min, perform baseline adjustment for 30 s, inject 90 µL of sample activation solution (EDC/NHS) over 6 min contact time, and then hold for another 5 min.\nRepeat this cycle after baseline running for 1 min at 10 µL/min on only the left flow cell (blue) to inject and immobilize chemically synthesized peptides10, HA, and spike protein at 20 µg/mL, and allow for the subsequent baseline adjustment with ddH2O for 1.5 min before quenching the activated chip surface with 1 M ethanolamine HCl pH 8.5.\nSwitch the tubes from the liquid sampler to the degasser from ddH20 into the bottle with HBS-EP(+) (Supplementary Figure 1).\nAnalyze the SPR sensorgrams.\n\t\nTo perform kinetic studies, use various analyte concentrations (10-5-10-8 M), with a regeneration step after each injection and blank measurements after different analytes. Change the flow rate to 10 µL/min and start injections for 4 min contact time, then 5 min baseline generation, and two regeneration steps of 2 min each with an interval of 30 s.\nInject the buffer solution for blank measurements whose sensorgrams are subtracted from sample runs to normalize different protein concentrations.",
    "Click on Form, scroll down, and change to \"Post-Processing\" by clicking this operation mode. Click on Add to select binding curves generated over time in the Data Plot Form for each flow cell, and export the overlay as a scrubber file (.ovr). Click on File to open the file saving options. Obtain response curves by aligning left and right curves and subtracting signals of the second reference channel from those of the ligand channel.\n\tNOTE: Data is operated in \"Post-Processing\" by defining sensorgrams computationally. It is put into an overlay of sensorgrams from left and right flow cells, or represented as sensorgrams from the difference of both channels.\nClean the entire fluidics with 50-100 mM glycine buffer pH 9.5, water, and 20% ethanol before and after binding measurements to remove traces of salt or any protein contamination, or more stringent, with 0.5% SDS and glycine.\n\tNOTE: To prevent instrument damage, it is recommended to check the mechanical stability of the glass chip before re-inserting the chip cartridge into the instrument if chips have been stored under buffer or at 100% humidity.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}