{
  "id": 5409,
  "origin_website": "Bio",
  "title": "In Gel Kinase Assay",
  "procedures": [
    "Note: Although this protocol was developed for plant tissue protein extracts as well as recombinant proteins, it potentially can also be applied for protein extracts from any other source. Even more, this protocol could also be valid for samples obtained from immunoprecipitation assay (Vlad et al., 2009). Seed sterilization and plant growthPut 5 mg (200-300 seeds) of Arabidopsis seeds into an Eppendorf tube, add 750 μl sterilization solution (Recipe 1) and shake for 20 min at room temperature.Note: In this protocol we tested: pyr/pyl sextuple mutant line (pyr/pyl112458), snrk triple mutant line (snrk2.2/2.3/2.6) and Col-0 as a control line (described in Gonzalez-Guzman et al., 2012). Remove the sterilization solution (by pipetting with sterile tips) in flow hood and wash seeds with 750 μl sterile distilled water (shaking it for 15 min at room temperature). Repeat this step 3 times.Stratify seeds in 750 μl fresh sterile distilled water at 4 °C for 3 days in the dark.Sow seeds on sterile solid MS plates (Recipe 2).Note: Keep a density of approximately one seed per cm2 (crowded plates produce unhealthy seedlings).Close and seal plates with micropore tape. Note: Use only one layer of micropore tape. More than one layer prevents both: gaseous exchange and healthy plant growth.Incubate plates for 12 days in a controlled environment growth chamber at 22 °C under a 16-h light/8-h dark photoperiod at 100 µEm-2 sec-1. Note: Time and growth condition could be variable depending on experimental requirements. Total protein extraction and SDS-PAGEHarvest seedlings from plates (500 mg) and freeze it in liquid N2. Store at -80 °C until use. Note: In our experimental design 100 µM ABA or mock treatment (sprayed - 30 min) was required before freezing. Grind plant tissues into fine powder using mortar and liquid N2.",
    "Transfer 400 mg of the fine powder into a 2 ml Eppendorf tube using a cooled (N2) spatula; add 1 ml of cold extraction buffer (Recipe 3) and mix well by vortexing for 15 sec.Note: Keep tube on ice until centrifugation (proceed with the next sample).Centrifuge for 15 min at 4 °C (maximum speed, 14,000 x g).Transfer supernatant into a new 1.5 ml Eppendorf tube and store at -80 °C until use. Note: Before storing tubes at -80 °C, take a sample of each one (50 µl) for protein quantification. Repeated sample freeze and thaw can decrease enzymatic activity.Proceed with protein quantification.Note: Any protein quantification method should be fine. We choose Bradford Protein Assay from Bio-Rad (follow manufacturers’ protocol)Prepare 10% polyacrylamide gel (for SDS-PAGE) and include before polymerization 800 µg of ∆C-ABF2 peptide (in the resolving gel).Notes: We choose miniprotean III SDS-PAGE system from Bio-Rad and a gel of 1.5 mm width.We use as specific SnRK2.2/2.3/.2.6 kinase substrate the His6-∆C-ABF2 peptide (amino acids 1 to 173; 18.4 KD). ∆C-ABF2 cloning and recombinant protein preparation was described in: Dupeux et al., 2011 and Antoni et al., 2012 (see a brief description of these methods in Notes section).Potentially other recombinant kinase substrates could be used depending on which kinases will be assayed. Even synthetic or commercially available peptides, i.e., MBP (myelin basic protein), should be suitable.For SDS-PAGE preparation follow the BIOPROTOCOL e80 (He, 2011)Prepare loading samples: mix 40 µg of total protein plant extract (obtained in step B5 and thawed on ice) with 50 µl 2x Laemli buffer (Recipe 5) and add sterile deionized H2O to reach 100 µl final volume. Notes: Do not boil the samples. Boiling produces irreversible protein denaturation and loss of enzymatic activity. (Important)Quantity of total protein extract could be variable depending on kinase expression and activity.",
    "For a pilot experiment, we suggest a concentration range from 20 µg to 80 µg of total protein extract.For recombinant protein study, active His-tagged OST1 protein kinase produced in E. coli was used (autophosphorylated OST1/SnRK2.6-6HIS, Vlad et al., 2009; see Notes section for recombinant protein purification). Different recombinant OST1/SnRK2.6-6HIS amounts where tested: 0.01, 0.05, 0.1, 0.5, 1, 5 and 10 µg.Incubate loading samples on ice for 15 min.Load and run SDS-PAGE over-night (10-12 h) at constant 40 V.Notes:  Optionally run SDS-PAGE for 4-5 h at constant 80 V.Run a parallel SDS-PAGE (without ∆C-ABF2 peptide) and load the same sample amount. After running, stain this gel with Coomassie to check protein loaded into gel. This Coomassie stained gel is also useful for densitometric analysis if required. In-gel kinase activity reactionNote: This protocol utilizes radioactive material and operators require experience in personal and environmental radiation protection and in the management of radioactive waste. (Important)Gel washing: wash gel 3 times (30 min each) with 100 ml of washing buffer (Recipe 5) at room temperature and gentle agitation.Protein renaturalization: incubate gel 3 times (first 2 times 30 min each, and the last incubation over-night 10-12 h) with 150 ml of protein renaturalization buffer (Recipe 6) at room temperature. Gentle agitation is required.Pre-reaction incubation: incubate gel 30 min in 40 ml of cold reaction kinase buffer (Recipe 7), at room temperature and with gentle agitation.Kinase reaction activity: incubate gel 1 h in 8 ml of hot reaction kinase buffer (Recipe 8). Gentle agitation and room temperature are required.Note: Prepare the minimum quantity possible of hot reaction kinase buffer to reduce radioactive waste.Kinase STOP reaction: wash gel 6 times (1 h each) with STOP-washing buffer (Recipe 9). Gentle agitation and room temperature are required.",
    "Gel drying: dry gel over a filter paper with a gel vacuum dryer.Radioactivity detection: detect radioactivity using screen and cassette (FUJIFILM) with variable exposure times (from 1 to 72 h) and a phosphorimage detector system (FLA5100; FUJIFILM)."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}