{
  "id": 11864,
  "origin_website": "Jove",
  "title": "Production of High-Titer Recombinant Newcastle Disease Virus from Allantoic Fluid",
  "procedures": [
    "All work involving the use of animals was approved by the University of Guelph Animal Care Committee in accordance with the Canadian Council on Animal Care. All work is performed in a BioSafety Level 2 (BSL2) laboratory in Canada where mesogenic NDV is a Risk Group 2 Pathogen. All steps involved in the amplification and purification of NDV should be performed in a Type IIA biological safety cabinet for safety and sterility purposes.\n1. Amplification of NDV using specified pathogen-free embryonated chicken eggs\nInoculation of SPF embryonated chicken eggs\n\tNOTE: Typically, eight dozen SPF embryonated chicken eggs are used to generate one in vivo-grade batch of NDV. Order one or two dozen extra eggs to account for damage during shipping as well as variability in viability. Embryonated chicken eggs are biological material and should be handled according to institutional guidelines. However, since the embryos are not hatched, institutional Animal Care Committee approval is not required.\n\t\nAfter receiving SPF embryonated chicken eggs, incubate in an egg incubator at 37 °C, 60% humidity for 9 days. Ensure the incubator is set to automatically rock/rotate the eggs every hour.\n\t\tNOTE: Eggs can be stored at room temperature for up to 24 h or 4 °C for up to 72 h; however, this may decrease embryo viability.\nAfter 8-11 days of incubation (ideally on day 9), candle the eggs to determine embryo viability. Look for web-like vasculature (Figure 1A) and embryo movement as indicators of viable embryos. Dispose of eggs lacking these features (Figure 1B).\nOn the viable eggs, mark the interface between the air sac and the embryo in pencil with an 'X' (Figure 1A). Ensure that this injection site would not cause perforation of the vasculature. Return the marked eggs to the incubator while the inoculum is prepared.",
    "Calculate the amount of virus required to inject all the SPF embryonated chicken eggs. Ensure that each egg receives 100 PFU of virus in a volume of 100 µL; dilute the virus in phosphate-buffered saline (PBS) to a concentration of 1 × 103 PFU/mL. Prepare an extra 20% of the inoculum to account for inaccuracies in virus administration.\nUsing an antistatic wipe, clean the tops of the marked eggs with a 10% iodine solution, diluted in 70% ethanol. Wait approximately 1-2 min for the solution to dry.\nCarefully pierce the shell using a pair of sterile sharp tweezers. Sanitize the tweezers in 70% ethanol between eggs.\nUsing a 1 mL syringe and a 25 G needle, inject 100 µL of the inoculum prepared in step 1.1.4 into the chorioallantoic cavity (Figure 1C). Approach with the needle at a nearly 90° angle to the egg. Insert the needle just into the top of the chorioallantoic membrane.\nFollowing inoculation, use nail polish to cover the puncture site and return the eggs to the incubator. Ensure that the rocking setting is ON until 24 h post inoculation.\nCheck egg viability 24 h post inoculation. Discard dead eggs that lack vasculature in the chorioallantoic membrane and embryo movement (Figure 1B).\n\t\tNOTE: These eggs have died due to the inoculation process and not from NDV.\nReturn the eggs to the incubator, with the rocker setting OFF to prevent contamination of the allantoic fluid with egg proteins.\nCheck the eggs every 12-24 h as described in step 1.1.9 to identify dead eggs. Move the eggs that die after 24 h post inoculation to 4°C to minimize autolysis. Harvest the allantoic fluid within 2-12 h of chilling.\nIncubate the eggs for at least 72 h.",
    "NOTE: If propagating a mesogenic strain of NDV, the optimal incubation time is 60-72 h, as prolonged incubation times can impair the purification process due to reduced clarity of the allantoic fluid. This issue is not as important when propagating lentogenic NDV strains as they take much longer to kill the embryo.\nAfter the appropriate incubation period, move the remaining eggs to 4 °C for 2-12 h before harvesting the allantoic fluid.\nHarvesting allantoic fluid containing NDV\n\t\nMove the chilled eggs into the biosafety cabinet. Clean the tops of the eggs with 70% ethanol.\nUse sterile tweezers and surgical scissors to break open the apical side of the egg where the air sac is located.\nRemove the shell to reveal the chorioallantoic membrane (Figure 1D).\nCarefully puncture the membrane and peel it back to expose the allantoic cavity (Figure 1E). Ensure that the yolk sac is not accidentally punctured as well as this will spoil the egg.\nUse blunt forceps to grab the embryo and open the embryonic sac.\n\t\tNOTE: The fluid inside the embryonic sac also contains NDV.\nDepress the embryo with the forceps and collect the allantoic fluid using a 10 mL serological pipette.\nStore the allantoic fluid on ice in 15 mL conical tubes until clarification.\n\t\t​NOTE: If the allantoic fluid is yellow, the yolk sac has been compromised and the allantoic fluid should be discarded.\nCentrifuge the conical tubes containing the allantoic fluid at 1,500 × g for 10 min at 4 °C.",
    "Pause point: Aliquot the clarified allantoic fluid into 50 mL conical tubes and store them at -80 °C for long-term storage (e.g., weeks to months), supplementing the fluid with sucrose to a final concentration of 5% to protect the virus from the harsh effects of freeze-thaw. Alternatively, for short-term storage (e.g., 1-3 days), supplement the allantoic fluid with sucrose (final 5%) or with 3x Mannitol-Lysine (ML) buffer (15% Mannitol, 3% Lysine; see Supplemental Table S1 for buffer recipes) to yield a final concentration of 1x (5% Mannitol, 1% Lysine) prior to storage at 4 °C.\n2. Purification of NDV from allantoic fluid\nDepth filtration of allantoic fluid\n\t\nStore the clarified allantoic fluid at -80 °C and thaw it at 4 °C the night before purifying.\nIn a biological safety cabinet, set up the tubing and peristaltic pump as shown in Figure 2.\nIf not already performed, combine the allantoic fluid with 3x ML buffer to a final concentration of 1x.\nBefore attaching the depth filter, sterilize the tubing by passing 50 mL of 0.5 M NaOH through the system into a waste vessel.\nRinse the tubing by passing 100 mL of sterile, molecular-grade water through the system and into the waste vessel.\n\t\tNOTE: As NaOH will inactivate NDV, it is important that the lines are adequately washed prior to introducing the virus-containing allantoic fluid.\nPrime the system by running 50 mL of PBS through it, stopping the pump when there is approximately 5 mL of PBS left in the tube.\nAttach depth filter with a 1-3 µM retention rating to the tubing and remove the second cap on the apical side of the depth filter to vent the filter. Begin running an additional 50 mL of PBS through the system.",
    "Once PBS begins to flow through the vent at the top of the filter, close the port and continue to flow PBS through the lines.\n\t\tNOTE: Minor air bubbles are acceptable but the presence of large quantities of air will require the filter to be vented again as described in steps 2.1.7 and 2.1.8.\nStop the pump when there is approximately 5 mL of PBS remaining in the tube.\nReplace the waste vessel with a new sterile collection vessel and begin running allantoic fluid through the depth filter.\n\t\tNOTE: The pressure should not exceed 10 psi as this results in shearing of the virus. Pressure can be manipulated by decreasing or increasing the flow rate of the pump. If the pressure begins to exceed 10 psi and the flow rate cannot be decreased any further, a new depth filter should be used. In this case, steps 2.1.6-2.1.8 should be performed prior to resuming the flow of allantoic fluid.\nOnce all the allantoic fluid has passed through the filter, run 50 mL of 1x ML buffer through the lines to maximize virus recovery.\nCollect the liquid until the lines run dry. Store the virus overnight or up to 36 h at 4 °C.\n\t\tNOTE: Once the virus has been depth-filtered, continue the purification process within 36 h of completing depth filtration.\nDisconnect the depth filter and sanitize the tubing by running 100 mL of 0.5 M NaOH, 400 PPM bleach prewarmed to 42 °C through the system prior to storage in 0.5 M NaOH.\nTangential flow filtration for the concentration of NDV\n\t\nAssemble the components of the cassette as depicted in Figure 3A (and as shown previously25) in a biological safety cabinet.",
    "NOTE: The manifold and endplate should be washed in detergent and dried before use. The silicon gaskets are reusable and should be stored in 0.5 M NaOH with the cassette.\nSet-up the Tangential Flow Filtration (TFF) (also known as cross-flow filtration) system in an 'open' conformation (Figure 3B).\n\t\t\nIf using a cassette for the first time, assemble the TFF cassette in the Elution conformation and flush with 100 mL of sterile, molecular-grade water (Figure 3C).\nOnce there is only 5 mL of water remaining in the reservoir tank, pause the pump and change the TFF system setup to a closed conformation (Figure 3D).\nAdd 100 mL of 0.5 M NaOH, 400 PPM bleach prewarmed to 42 °C to the reservoir and cycle through the system for 30-60 min.\nPause the flow and return the TFF system to the elution setup, resuming the flow to elute the cleaning solution.\nWhen there is approximately 5 mL left in the reservoir, pause the pump and add 100 mL of sterile, molecular-grade water to rinse the system.\nWhen there is approximately 5 mL left in the reservoir, pause the pump and place the TFF system in the open conformation (Figure 3B). Continue with step 2.2.3.\nSterilize the cassette and tubing by passing 100 mL of 0.5 M NaOH through the system using the peristaltic pump. Ensure that the pressure does not exceed 30 psi to maintain cassette integrity.\nPause the pump when there is approximately 5 mL of 0.5 M NaOH left in the reservoir.\nAdd 100 mL of sterile, molecular-grade water to the reservoir and resume passing the fluid through the cassette. Swirl the reservoir to wash all NaOH from the sides of the reservoir to prevent inactivation of virus. Repeat the reservoir wash step.",
    "When there is approximately 5 mL of sterile, molecular-grade water left in the reservoir, pause the pump.\nAdd 100 mL of PBS to the reservoir, swirling to ensure the sterile, molecular-grade water is washed from the sides. Resume the flow of liquid through the cassette.\nWhen there is approximately 5 mL left in the reservoir, pause the pump, add depth-filtered allantoic fluid to the reservoir, and resume pump flow.\nMonitor pressure gauge 1 (Figure 3B) to ensure it does not exceed 10 psi to prevent shearing of the virus. Use a combination of the speed of the peristaltic pump and use of C-clamps to increase elution to waste.\n\t\tNOTE: Combining speed of the peristaltic pump and C-clamps will result in increased pressure.\nWhen there is 50-100 mL of allantoic fluid left in the reservoir, pause the pump to perform a buffer exchange by adding 150-200mL of 1x ML buffer.\nResume pump flow, again monitoring pressure gauge 1 (Figure 3B) to ensure it does not exceed 10 psi.\nWhen there is 5-10 mL left in the reservoir, pause the pump.\nUsing two C-clamps, close the two waste lines as shown in Figure 3C.\nUncouple the retentate line feeding the reservoir and insert it into a 50 mL conical tube (Figure 3C).\nResume flow of the pump, pausing when there are a few drops of fluid left in the reservoir tank.\nRemove the C-clamps from the waste lines and reattach the retentate feed line to the reservoir tank (Figure 3B).\nAdd 20-25 mL of 1x ML buffer and resume pump flow until there is approximately 5 mL left in the reservoir tank.\nRepeat steps 2.2.13 to 2.2.16.",
    "NOTE: A 3rd elution can be done by repeating steps 2.2.17 and 2.2.13 to 2.2.16 to increase virus yield. However, most of the virus is present in the first two elutions.\nAfter finishing the elutions, place the virus on ice or at 4 °C.\nTo cleanse the lines, set up the system such that it is a closed loop format (Figure 3D) with the waste lines feeding back into the reservoir as depicted in Figure 3D.\nProceed to clean the system by adding 250 mL of 0.5 M NaOH, 400 PPM bleach prewarmed to 42 °C.\nFlow the cleaning solution through the system overnight.\n\t\tNOTE: While recirculating the cleaning solution, if the pump is run at a speed of 50 mL/min, a pressure of about 5 psi should be observed. If the pressure exceeds this, the cassette is dirty, and the cleaning solution should be replaced, and the process repeated.\nElute the cleaning solution by directing both waste lines and the retentate line into a waste container.\nAdd 400-500 mL of sterile water to the reservoir and flow it through the system and into the waste vessels.\nWhen approximately 5 mL is left in the reservoir, pause the pump and add 100-200 mL of 0.5 M NaOH to the reservoir tank, swirling the solution to wash the reservoir container.\nOnce the reservoir is almost empty, repeat step 2.2.23 an additional two times.\nDisassemble the TFF setup, storing the TFF cassette and gaskets in a small volume of 0.5 M NaOH in a resealable plastic bag at 4 °C.\n\t\tNOTE: Tubing can be stored at room temperature submerged in 0.5 M NaOH.\nIodixanol density gradient ultracentrifugation",
    "Turn the ultracentrifuge on and set it to precool to 4 °C. Precool the desired rotor at 4 °C as well (see the Table of Materials).\n\t\tNOTE: Rotors should be stored at 4 °C.\nUse the stock 60% iodixanol solution (concentration at time of purchase) to generate 40%, 20%, and 10% iodixanol solutions by diluting with PBS and 3x ML Buffer to a 1x final concentration of ML buffer.\nIn a 13.2 mL, open-top, thin-wall ultracentrifuge tube, overlay 0.5 mL, 2.5 mL, and 2.5 mL of the 40%, 20%, and 10% iodixanol solutions, respectively (Figure 4A).\n\t\tNOTE: Tilting the ultracentrifuge tube on its side and slowly expelling the solution will significantly reduce the risk of mixing the two gradient layers. The separation of each layer should be evident, with a \"halo\" visible between each layer of the gradient.\nUse a marker pen to mark the interfaces of the various gradient layers.\nLayer 6-6.5 mL of the eluted virus from the TFF procedure over the density gradient. Add the virus carefully as described in step 2.3.3 to avoid disturbing the density gradient.\nLoad the ultracentrifuge tubes into the inserts for the swinging bucket rotor (see the Table of Materials) using an open-top scale to balance the inserts within 0.01 g of each other. Use PBS or extra virus eluent to account for the weight differences.\nOnce the tubes are balanced, cap the tubes and load them into the rotor.\nCentrifuge for 1.5 h at 125,000 × g at 4 °C.\n\t\tNOTE: This can be performed overnight if an ultracentrifuge with delay-start capability is available.\nFollowing ultracentrifugation, remove the tubes using a pair of sterile forceps. Look for the target band-a large band-between the 10% and 20% gradients (Figure 4B).",
    "Suspend the tube over the top of a beaker using a retort stand.\nAttach an 18 G x 1.5 inch needle to a 5 mL syringe and puncture the side of the ultracentrifuge tube.\n\t\tNOTE: The tube should be punctured slightly below the target band, with the needle on an upward angle and bevel up such that it would travel into the target band.\nSlowly extend the plunger to remove the target band.\n\t\tNOTE: Move the needle around within the target band to maximize the virus extracted. Be careful that other bands or debris do not get mixed with the target band, and avoid taking excess solution as this will lead to the use of more dialysis cassettes.\nOnce the target band has been extracted, remove the needle, and allow the remaining solution to drain into the waste beaker. Dispense the target band into a 50 mL conical tube until all bands from all other ultracentrifuge tubes have been extracted.\nRepeat steps 2.3.10-2.3.13 until all the target bands have been extracted from all the ultracentrifuge tubes.\nAlternative approach to extracting the target bands as described in steps 2.3.10 to 2.3.13\n\t\t\nSlowly remove the liquid overlaying the target band using a pipette. Once at the target band, extract using a pipette and store the virus in a 50 mL conical tube.\n\t\t\tNOTE: This allows for the ultracentrifuge tubes to be reused.\nRemoval of iodixanol from virus solution\n\tNOTE: The NDV-containing band appears at an iodixanol density between 15% and 16%. The concentration of iodixanol in the solution can be determined by measuring the absorbance at 340 nm in reference to a standard curve (Supplemental Figure S1). This step may be omitted as no adverse effects or acute toxicity were observed when iodixanol solutions of this concentration were administered to C57BL/6 mice.",
    "Prewet a 0.5-3 mL 10 kDa molecular weight cut-off dialysis cassette by submerging it in PBS for 1 min.\n\t\tNOTE: The dialysis membrane should change from smooth to having a ruffled or bumpy appearance. If the volume of extracted virus exceeds 10 mL, two 0.5-3 mL dialysis cassettes or a 5-12 mL dialysis cassette should be used.\nAs applicable, use either a 5 or 10 mL syringe and an 18 G x 1.5 inch blunt-fill needle to collect the virus from the 50 mL conical tube.\nUse the syringe to enter the dialysis cassette, being careful not to pierce the membrane, and inject the virus.\n\t\tNOTE: The dialysis cassette can be rotated to manipulate the positioning of the air pocket in the cassette. The air pocket should be removed before removing the needle from the cassette.\nFill a 1 L beaker with sterile 1x PBS, place a stir bar and the dialysis cassette inside, and cover. Incubate at 4 °C with gentle stirring.\n\t\tNOTE: Use extruded polystyrene foam and an elastic band to attach the dialysis cassette so that it will float in the PBS. The cassette may swell slightly due to the ML buffer.\nAfter 1-2 h, replace with fresh 1x PBS and continue to incubate at 4 °C for another 8-10 h with slight stirring.\n\t\tNOTE: This can also be done overnight.\nReplace with fresh 1x PBS once more, incubating at room temperature for 1-2 h.\nConcentration of virus solution\n\t\nRemove the dialysis cassette from the dialysis buffer (Figure 4C) and place it into a small, sealable plastic bag. Add 15-25 mL of 40% 20,000 MW polyethylene glycol so that the dialysis cassette is completely submerged.",
    "Incubate at room temperature with rocking. Check the volume of virus in the cassette periodically using a 5 or 10 mL syringe and an 18 G x 1.5 inch blunt-fill needle.\n\t\tNOTE: The amount of time required to concentrate the virus will vary based on starting volume and desired end volume. Typically, the final desired volume is between 1 and 1.5 mL regardless of the starting volume of allantoic fluid. When checking the volume, be careful not to use the same port as this will compromise port integrity and may result in the mixing of the polyethylene glycol solution and the virus.\nBefore removing the concentrated virus from the dialysis cassette, briefly rinse the cassette in 1x PBS and fill an 18 G x 1.5 inch blunt-fill needle with air.\nInsert the air-filled syringe into the dialysis cassette and depress the plunger. Rotate the apparatus so that the concentrated virus can be removed without removing any of the introduced air.\nDispense the concentrated virus into a 50 mL conical tube, noting the volume dispensed.\nUsing the same syringe and needle, inject an appropriate amount of 60% sucrose into the dialysis cassette so that, when combined with the previously removed virus, it is at a final concentration of 5% sucrose.\nUse gloved fingers to massage the membrane to dislodge residual virus that may have adhered to the membrane, being careful not to damage it. Remove some of the excess air in the dialysis cassette to ease the dislodging process.\nCombine this wash with the virus already in the 50 mL conical tube.",
    "​NOTE: The virus is now in 5% sucrose and ready to be dispensed into 20 µL, 50 µL, 100 µL, or 200 µL aliquots and stored at -80 °C. Alternatively, for long-term storage, NDV can be lyophilized and stored at 4 °C as described in section 2.6.\nLyophilization of NDV\n\t\nLyophilize the virus aliquoted in 1.5 mL centrifuge tubes or 15 mL conical tubes at 44 × 10-3 MBAR and -52 °C for 16 h.\nStore the lyophilized samples at 4 °C without significant reduction in viral titer.\n3. Quality control assays\nViral RNA isolation and reverse-transcription PCR for genome confirmation\n\t\nThaw a 20 µL virus aliquot. Follow the viral RNA isolation protocol provided with the kit.\nImmediately use the isolated RNA as a template for reverse-transcription PCR (RT-PCR) or store it at -80 °C.\nPrepare the reverse-transcription reactions as described in the protocol provided by the manufacturer.\nUse the resulting cDNA as a template for various quality control PCR reactions to confirm the NDV pathotype (Table 1, F protein primer set) and the presence of required gene control elements (Table 1, Transgene primer set).\n\t\tNOTE: Primers should be designed based on the strain of NDV being propagated.\n\t\t\nTo sequence the F protein cleavage site, the major determinant of pathotype, use the F protein primer set (Table 1). Look for a PCR product of 435 base pairs in length.\n\t\t\tNOTE: Here, primers were designed based on the LaSota strain of NDV (Genbank accession AF077761.1). It is well established that optimal transgene expression occurs when a foreign transgene is inserted between the P and M genes24.\nUse the transgene primer set to confirm the integrity of the gene start and gene end elements of the transgene. Sequence the PCR product to confirm gene start and gene end sequence integrity.",
    "Send the PCR products for DNA sequencing and compare them to the template for homology.\nSDS PAGE and Coomassie staining to detect contaminating proteins\n\t\nCast a density gradient SDS PAGE gel by first preparing 6% and 15% polyacrylamide solutions (Supplemental Table S1). Use a 10 mL pipette to draw up 5 mL of the 15% solution, followed by 5 mL of the 6% solution.\nRemove the pipette from the solution and generate an air bubble by briefly drawing up air.\n\t\tNOTE: As the air bubble travels upward, this mixes the solution to create the SDS PAGE gradient.\nDispense the solution into the casting apparatus and allow it to solidify for 30 min.\nIn a final volume of 20 µL, combine an aliquot of virus with 4x reducing buffer (Supplemental Table S1) so that the final concentration is 1x, and boil for 10 min at 95 °C in a thermocycler. Load at least 1 × 107 PFU of the virus.\nSubmerge the SDS PAGE in running buffer (Supplemental Table S1) and load the samples.\nRun the gel at 120 V for 1-1.5 h.\nRemove the gel from the running buffer and transfer it to a smaller container.\nAdd Coomassie staining solution (Supplemental Table S1) to cover the gel. Incubate at room temperature for 4-5 h.\nRemove the staining solution and add destain solution (Supplemental Table S1), incubating for 4-8 h at room temperature with agitation. Change the destain solution three to four times.\n\t\tNOTE: The gel should be clear and its color should be as it was prior to staining.\nImage the gel on a colorimetric setting. See Figure 5 for a representative image of a Coomassie-stained SDS PAGE gel containing samples from allantoic fluid and purified virus.",
    "Quantification of infectious viral titer by median tissue culture infectious dose (TCID50) and immunofluorescence assay\n\tNOTE: Vero cells can be used as an alternative to DF1 cells; however, the cytopathic effect (CPE) is less pronounced in Vero cells. NDV harboring the L289A mutation, which enhances fusogenicity, and expressing GFP between the P and M genes is being used in this assay.\n\t\nSeed a 96-well plate of DF1 cells at 20,000 cells/well in a volume of 80 µL the day before using DMEM supplemented with 2% fetal bovine serum (FBS) and 125 µg/mL trypsin. Incubate the cells at 37 °C and 5% CO2.\nThe next day, thaw a 20 µL aliquot of virus on ice.\nUse 1.5 mL tubes to prepare serial dilutions. Begin by diluting 10 µL of the virus with 990 µL of PBS to prepare a 10-2 dilution. Prepare all other dilutions, up to 10-10 at a minimum, made with 900 µL of PBS and the addition of 100 µL of the previous dilution.\n\t\tNOTE: Use a new pipette tip when moving between dilutions.\nUse 20 µL of each dilution to infect each well of the 96-well plate as shown in Figure 6.\n\t\tNOTE: The final volume in each well will be 100 µL.\nIncubate the plate for at least 48 h at 37 °C and 5% CO2, before examining for the presence of CPE/GFP or performing an indirect immunofluorescence assay (IFA).\n\t\tNOTE: Under these culture conditions, CPE is evident after 10 h (Figure 7A-D), increasing over the next 24 h (Figure 7E-H). The plate can be incubated longer to improve the intensity of CPE if scoring by GFP or CPE.\n\t\t\nIf scoring by CPE or GFP and NOT performing IFA, skip to step 3.3.18.1.\nIf performing IFA, rinse the cells twice with 100 µL of 1x PBS.",
    "Add 100 µL of 4% paraformaldehyde diluted in PBS to each well and incubate for 15 min at room temperature.\nWash the cells 3x 5 min each with 100 µL of 1x PBS, 0.1% Tween 20 (0.1% PBS-T).\nPermeabilize the cells by the addition of 100 µL of 0.1% NP-40 in PBS and incubating them at room temperature for 10 min .\nWash the cells 3x 5 min with 100 µL of 0.1% PBS-T.\nAdd 100 µL of blocking buffer comprised of 5% (V/V) normal goat serum diluted in 0.1% PBS-T for 1 h at room temperature or overnight at 4 °C.\nAdd 100 µL per well of primary mouse anti-NDV ribonucleoprotein antibody diluted in 0.1% PBS-T to 1 µg/mL, incubating for 1 h at room temperature or overnight at 4 °C.\nWash the cells 3x for 5 min in 100 µL of 0.1% PBS-T.\nAdd 100 µL of an AlexaFluor 488 Goat anti-mouse secondary antibody diluted in 0.1% PBS-T to 2 µg/mL. Incubate for 1 h at room temperature.\nWash the cells 3x for 5 min in 100 µL of 0.1% PBS-T.\nAfter the final wash, leave the cells in 100 µL of 0.1% PBS-T.\nImage the wells using an inverted fluorescent microscope.\nWhen performing IFA, look for fluorescence greater than that seen in the negative control wells, indicating that the well is positive for NDV as shown in Figure 8.\n\t\t\nLook for the presence of syncytia and large, rounded cells that characterize NDV CPE. If scoring wells infected with a virus that expresses GFP, look for the presence of GFP.\nEnter the appropriate information into the Spearman-Karber titer calculator26 to determine the PFU/mL of the virus (Table 2). See Figure 6 for an example TCID50 titer plate.\nQuantification of viral titer by quantitative real-time PCR (qRT-PCR)",
    "NOTE: A one-step qRT-PCR kit is recommended to save time and reduce the manipulation of the samples. A probe-based assay is used to increase the specificity of detection for virus sequences.\n\t\nCreate a standard curve of a known quantity of the virus sequences (Supplemental Figure S2A,B).\n\t\tNOTE: This can be done by purchasing a synthetic 500 bp double-stranded DNA fragment of the NDV L gene. The sequence for a 500 bp fragment of the NDV L gene can be seen in Supplemental Figure S2C.\nConvert the amount of the virus DNA fragment (usually provided as nanograms or femtomoles by manufacturers) to the number of molecules or copies of DNA fragment by using Avogadro's number and the moles to molecules formula (Eq (1)).\nimgsrc://cloudfront.jove.com/files/ftp_upload/63817/63817eq01.jpg (1)\nPrepare the standard curve samples by preparing a tenfold dilution series of known virus DNA fragment copies, starting from 1.00 × 1010 copies down to 1.00 × 100 copies.\nTo determine the amount of NDV RNA in unknown samples, extract NDV RNA using an RNA extraction kit. Follow the protocol provided with the kit. Once the RNA is extracted, proceed with the recommended protocol provided in the one-step qRT-PCR kit.\nRun the reactions in a real-time PCR instrument with the following temperature and cycling conditions: 1) one cycle of reverse transcription at 55 °C for 10 min; 2) one cycle of initial denaturation at 95 °C for 1 min; and 3) 40 cycles of denaturation (95 °C for 10 s), extension (60 °C for 30 s) and fluorescent signal acquisition.\nOnce the qRT-PCR assay is completed, generate the standard curve based on the standard curve samples using the real-time PCR instrument software (Supplemental Figure S2A,B).\n\t\tNOTE: The software will also calculate the amount of NDV RNA in unknown samples based on the standard curve.",
    "Safety testing for acute toxicity in mice\n\t\nInject 1 × 108 PFU of virus intravenously via the tail vein into three 8-week-old BALB/C mice to assess acute toxicity.\nMonitor the mice for adverse events such as weight loss (>20%), hunched posture, ruffled coats, lethargy, and changes in respiration. Assess three to four times daily over the first 48 h. As mice should begin to recover after 48 h, monitor them one to two times daily until fully recovered.\n\t\t\nAdminister saline subcutaneously and supportive care as required. For example, supplement with recovery diet gel, peanut butter, or use heat pucks. Euthanize mice that have reached endpoint criteria, as outlined by the animal care institutional guidelines, by isoflurane overdose followed by cervical dislocation.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}