{
  "id": 18597,
  "origin_website": "Jove",
  "title": "Brain Source Imaging in Preclinical Rat Models of Focal Epilepsy using High-Resolution EEG Recordings",
  "procedures": [
    "Ethics statement: All experiments are performed following the policies established by the Institutional Animal Care and Use Committee (IACUC) at Florida International University (IACUC 13-004).\n1. EEG Recordings\nPreparation of the EEG mini-cap\n\t\nImmerse the electrode tips of the EEG mini-cap at least 12 hrs in distilled water with 0.2% chloride. Rinse the EEG mini-cap gently in distilled water. Dry the cap and the electrodes in the air.\nMix EEG electrode paste with 0.9% NaCl solution in the volume proportion of 2 : 1. Add a drop of methylene blue, which will help to visualize the electrode paste inside the electrodes and on the skin. Take the mixed paste in a syringe. Make sure there are no air bubbles in the syringe. Inject the gel into each of the 32 electrodes, filling them without introducing any air bubbles. It is recommended to inject from the bottom rather than the top. This provides better access to each electrode and reduces the possibility of the gel spilling over.\nTurn on EEG and physiological recording system, and open the corresponding recording software on the computer in use.\nAnimal preparation and anesthesia\n\tNOTE: Chronic epilepsy was created using a protocol for FCD8 in Wistar rats. The EEG recording were conducted in adult Wistar rats (8 weeks old, 300 - 400 g).\n\t\nRecord the rat’s weight in an experiment sheet. Use this information to calculate sedative dose (dexdomitor 0.25 mg/kg). Induce anesthesia in the rat with 5% isoflurane and 100% oxygen (1 L/min at 14.7 psi).",
    "After trim the rat’s head, reduce isoflurane to 2% and maintain it during the entire setting of the EEG mini-cap. Check rat reflexes are absent (toe-pinch). Place the rat on a heating pad in the stereotaxic apparatus by fixing the ear canals using ear bars. Make sure anesthesia nose cone is secure.\nApply lubricant ophthalmic ointment to each eye.\nShave the extra hair on the rat head and ears using a razor. Avoid any bleeding during shaving.\n\t\tNOTE: Any hair left on the skin will produce noise in the EEG recordings. Rub the rat’s skin with 90% isopropyl alcohol to stimulate the blood vessels and degrease the skin.\nPlace a saline swab on the scalp and cover it completely to keep good skin conductance until the EEG mini-cap is ready to be placed.\nConnect temperature, respiration, and three lead electrocardiogram probes. Note that the temperature is measured by a rectal probe. Continuously monitor the physiology of the rat during the recording procedures. Ensure that the normal temperature is 37 °C, respiration range is 30 - 60 breaths per minute, and heart rate is around 350 - 450 beats per minute .\nRecording procedures\n\t\nRemove the saline swab on the rat’s scalp and place the prepared EEG mini-cap on its skin. Fix the mini-cap with rubber bands. Place one rubber band on the front side of the scalp, usually in front of the eyes, and another band at the back of the scalp between the ears and neck. Use a plastic protector under the neck to facilitate normal respiration.\nPut a layer of high conductance electrode paste on both the ground and reference electrodes. Place them on the respective ear.\n\t\tNOTE: The reference electrode can be possibly placed in other locations.",
    "Connect the EEG mini-cap to the amplifiers and observe a preview of the workbench for electrode impedance. Check the performance of all electrodes. For a high-quality recording, ensure that the impedance value is in the range of 5 - 30 kΩ. If there are any noisy electrodes, provide better contact with the scalp by either moving them inside the scaffold toward the scalp or gently injecting more gel from the top of the electrode.\nAdminister dexdomitor (0.25 mg/kg) intraperitoneally and immediately reduce isoflurane rate to 0%. If the respiration rate is not within 30 - 60 breaths per minute range, start increasing the isoflurane rate gently. Do not exceed the value of 1% isoflurane. Monitor this step carefully because the mixture of isoflurane and dexdomitor could prompt the animals to a critical condition.\n\t\tNOTE: On the preclinical model of focal epilepsy, isoflurane affects IEDs, whereas dexdomitor does not. Subjects under isoflurane have weaker epileptogenic property, i.e., relatively fewer IEDs can be detected compared to other conditions7,14. The dexdomitor dose is effective for about 2 hrs. Thus, to save the time for its effect, the preparation was carried out under isoflurane.\nConduct EEG recordings. After the recording, mark the positions of the three jutting circles of the EEG mini-cap on top of the skin by inserting a color pen inside them before the EEG mini-cap is removed. Use them as landmarks for MRI co-registration. Take a picture of the rat head with the landmarks. Place the rat back inside the cage and monitor it until complete recovery from dexdomitor’s effect.\n\t\tNOTE: In this experiment, red color (opponent color to green) was used to distinguish from the electrode positions (green). However, it is recommended to use other colors (purple/green) if small bleeding spots are observed in the skin.\nimgsrc://cloudfront.jove.com/files/ftp_upload/52700/52700fig1.jpg",
    "Figure 1. A picture of the EEG mini-cap placed on a particular rat.\nPlease click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/52700/52700fig1highres.jpg]\n2. Brain Source Imaging\nIED classification\n\tNOTE: The IED detection and classification is performed using self-developed codes in MATLAB based on the previous study15. This software will be available by request.\n\t\nDiscard noisy channels by visually inspecting the EEG tracers. Remove EKG artifacts using an automatic method for periodic waveform subtraction, which is based on a template and a correlation analysis.\n\t\tNOTE: Usually, the experimenter who recorded the EEG shares the written experimental sheet for the observed bad channel information based on the impedance values. Software to remove EKG artifacts will be also available by request.\nimgsrc://cloudfront.jove.com/files/ftp_upload/52700/52700fig2.jpg\nFigure 2. An example of the EEG trace showing different types of IEDs. The red box indicates one type of IEDs.\nPlease click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/52700/52700fig2highres.jpg]\n\t\t \nApply a band-pass filter with cutoff frequencies of 3 - 150 Hz and a notch filter to remove the line frequency (60 Hz in general and 50 Hz in some countries) component offline.\nDetect two types of IEDs (spikes and sharp-waves). Spikes and sharp-waves constitute large electrical events of 20 - 70 ms and 70 - 200 ms in duration respectively. Therefore, after applying a respective band-pass filter (cutoff frequencies of 15 - 50 Hz for spikes and 5 - 15 Hz for sharp-waves), the IEDs are detected based on amplitude thresholds15.\n\t\tNOTE: The thresholds are automatically set to 4σ as suggested in the previous study for multiunit activity15. Here, σ is an estimated standard deviation of the bandpass-filtered signal, σ = median{|filtered signal| ⁄ 0.6745}.",
    "Sub-classify spikes and sharp-waves into different clusters. The distinctive features of different spikes and sharp-waves are extracted using wavelet transform15. They are sub-classified into multiple clusters using k-means, and the optimal cluster number k is determined using silhouette.\nAverage the sub-classified signals within the same cluster. The average EEG signals for each IED sub-type will be used for brain source analysis.\nVolume conductor model\n\tNOTE: For the following sections, the open source software, Brainstorm12, will be used with the MRI atlas for Wistar rats9. However, individual rat’s MRI can also be used to generate the volume conductor model if available. The MRI atlas9 can be downloaded at \n\thttp://www.idac.tohoku.ac.jp/bir/en/[href=http://www.idac.tohoku.ac.jp/bir/en/db/rb/101028.html]. This website provides the atlas as NIFTI format under “Wistar Rat MRI Atlas” section, and it can be accessible after registration. The software needed for pre-processing can be also found in this website.\n\t\nInput MRI and brain surface to the software12.\nimgsrc://cloudfront.jove.com/files/ftp_upload/52700/52700vis1.jpg\nPlease click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/52700/52700vis1highres.jpg]\nGenerate head surface with default setting.\nimgsrc://cloudfront.jove.com/files/ftp_upload/52700/52700vis2.jpg\nPlease click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/52700/52700vis2highres.jpg]\nGenerate scalp and inner/outer skull surfaces based on MRI for lead field computation12.\n\t\tNOTE: The resolution of the vertices influences the accuracy of the estimated source, but large number of vertices results in high computational complexity. Recommended number of vertices of each layer is 642 for acceptable accuracy with fair computational complexity. The thickness of the skull can be checked from the MRI, and in the case of the MRI atlas, it is approximately 1 mm. After inserting above values in the software, corresponding triangle face-vertex meshes for each surface will be created.\nimgsrc://cloudfront.jove.com/files/ftp_upload/52700/52700vis3.jpg\nPlease click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/52700/52700vis3highres.jpg]",
    "Check the orientation and location of each surface with respect to the MRI using the visualization option. Modify accordingly, if any surfaces are not co-registered12.\nimgsrc://cloudfront.jove.com/files/ftp_upload/52700/52700vis4.jpg\nPlease click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/52700/52700vis4highres.jpg]\nUsing the rat head picture acquired in 1.3.5. co-register the positions of the 3 landmarks (R1, R2, and R3) in the MRI. Use the grid points of the landmarks as references to generate the electrode positions as the electrodes are fixed on the scaffold (Figure 3B).\nimgsrc://cloudfront.jove.com/files/ftp_upload/52700/52700fig3.jpg\nFigure 3. (A) Rat head picture used to obtain electrode positions and (b) the EEG mini-cap diagram with the coordinate system. Red dots in (A) indicate the landmarks mentioned in 1.3.5. which correspond to the red numbers in (B). Also, the green marks in (A) depict the 32 electrode positions, and they correspond to the blue numbers in (B).\nPlease click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/52700/52700fig3highres.jpg]\n\t\t \nGenerate N × 3 electrode position matrix based on the 3 landmarks. Here, N is the number of channels (N = 32) and the column represents the corresponding x, y, and z coordinate values.\n\t\tNOTE: The EEG mini-cap is a rigid scaffold. Therefore, once the 3 reference grids (R1, R2, and R3) are obtained, the position of the electrodes are automatically set. The user will only need to redefine the Z-values on a way that the mini-cap is appropriately projected on the scalp. The N point grids can be numbered sequentially as depicted in Figure 3B blue numbers. The standard scaffold for the EEG mini-cap is commercially available (Table of Materials). The software for co-registration is also available to the community.\nInput the generated channel file.\nimgsrc://cloudfront.jove.com/files/ftp_upload/52700/52700vis5.jpg\nPlease click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/52700/52700vis5highres.jpg]",
    "Display and confirm the location of all electrodes. Modify any misplaced electrodes12. The final coordinate system for the electrode positions should coincide with the coordinate system used for the above-mentioned surfaces.\n\t\tNOTE: The created surfaces can be visually inspected on an MRI by using the visualization option, “MRI registration\\Check MRI/surface registration.” And then, a selected surface will be displayed as yellow line on the MRI. In addition, the 3 landmarks and the 32 electrode positions can be displayed on the MRI by selecting the toolbox’s option, “Display Sensors\\MRI Viewer.” The locations can be visually inspected by comparing the distributions based on the rat’s eye and ear locations (Figure 4).\nimgsrc://cloudfront.jove.com/files/ftp_upload/52700/52700fig4.jpg\nFigure 4. (A) MRI atlas with co-registered brain surface (yellow line), (B) the created volume conductor model with the aligned 32 electrodes and 3 landmarks (red dots), and (C) MRI atlas with co-registered reference grid R1.\nPlease click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/52700/52700fig4highres.jpg]\nBrain Source Imaging\n\t\nCompute lead field matrix13. Input the conductivity values which satisfy the ratio of skin, skull, and brain as 1 : 1/80 : 1. Obtain the lead field matrix based on the volume conductor model and the electrode positions created in 2.2.\n\t\tNOTE: The toolbox12 offers the interface with the other software to compute BEM10. Therefore, only the conductivity values are required as input.\nimgsrc://cloudfront.jove.com/files/ftp_upload/52700/52700vis6.jpg\nPlease click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/52700/52700vis6highres.jpg]\nInput the average EEG signals for each IED sub-type stored in 2.1.4.\nimgsrc://cloudfront.jove.com/files/ftp_upload/52700/52700vis7.jpg\nPlease click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/52700/52700vis7highres.jpg]\nObtain sLORETA solution13 based on the computed lead field matrix and the input EEG signals. By selecting the source estimation method option, the inverse solution can be obtained12.\nimgsrc://cloudfront.jove.com/files/ftp_upload/52700/52700vis8.jpg\nPlease click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/52700/52700vis8highres.jpg]",
    "Plot the estimated sources."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}