{
  "id": 17327,
  "origin_website": "Jove",
  "title": "Platelet-Rich Plasma Lysate for Treatment of Eye Surface Diseases",
  "procedures": [
    "PRP-L used for the quantitative assessment of growth factors were collected within a wider study on the characterization of PRP products for regenerative purposes, carried out at the AUSL-IRCCS di Reggio Emilia and approved by the Area Vasta Emilia Nord Ethical Committee on 10 January, 2019 (protocol number 2019/0003319). Donors gave their informed consent as per the Declaration of Helsinki. No ethical approval was necessary for collecting the aggregated, anonymous data of the Ocular Surface Disease Index (OSDI) questionnaire, which is routinely used by clinicians to monitor dry eye syndrome symptoms. Figure 1A shows an outline of the protocol followed, while the pictures in Figure 1B depict the main steps of the procedure.\n1. Platelet-rich plasma (PRP) collection\nPRP apheresis\n\t\nFor this protocol, select platelet donors according to Italian laws: platelet donors must be 18-65 years old, with normal pressure and blood count parameters and a platelet count not less than 180 x 109 platelets/L23. Eligible donors cannot take antiplatelet or anticoagulant drugs within 1 week before donation.\nPerform plasma-platelet-apheresis using an automated blood collection system, according to the manufacturers' instructions and national laws23, to obtain 1 unit of single-donor platelet-rich plasma (PRP). Collect PRP in Adenine Citrate Dextrose Solution A (ACD-A) anticoagulant solution.\n\t\tNOTE: Platelet-apheresis is conducted with a continuous procedure; the time of collection is in a range between 40 min and 90 min. The amount of ACD delivered to the donors and the time of the procedures depend on the donor characteristics, e.g., hematocrit and needle gauge.\nPRP units' characteristics\n\tNOTE: The following step is usually performed automatically by the automated blood collection system during the plasma-platelet-apheresis procedure. Please check the manufacturer's manual of instruction.",
    "Resuspend the PRP units collected by apheresis in an adequate amount of preservative solution with the minimum amount of residual plasma, necessary to maintain pH > 6.4 during the whole storage time, to a mean final volume of 180 mL net of the anticoagulant solution (around 40 mL).\n\t\tNOTE: According to Italian law, quality controls have to assess that the platelet (PLTs) count is at least 2.0 x 1011 PLTs/unit, while residual leucocytes have to be less than 1 x 106 cells/unit.\nStore leucodepleted and irradiated PRP for a maximum of 5 days at 22 °C ± 2 °C on a platelet shaker before further manipulation23.\nPRP dilution\n\t\nImmediately before starting PRP dilution, perform a PLT count with a hemocytometer using the sample collected from the main bag through a piercing spike.\n\t\tNOTE: Perform the next steps in sterility under a class II biohazard hood. Wear personal protection equipment (lab coat, gloves, and goggles) during the procedure.\nDilute PRP with an adequate amount of sterile 0.9% NaCl to a final concentration of 0.32 x 109 ± 0.03 x 109 PLTs/mL, which simulates the average PLT concentration in peripheral blood.\nTaking advantage of a piercing spike for blood bags, split the diluted PRP into 300 mL empty collection bags to reach a net volume of 190 mL/bag.\nUse an aliquot of residual diluted PRP (usually 1 mL) to perform quality controls assessing possible microbial contaminations. Perform a sterility assay following the manufacturer's instructions in a microbiology laboratory (see Table of Materials).\n\t\tNOTE: Use culture vials specific for aerobic blood cultures, which are able to perform the qualitative culture and recovery of aerobic microorganisms (mainly bacteria and yeast) from small volume blood specimens.\nStore diluted PRP bags at −80 °C for a maximum of 2 months before thawing.",
    "2. Platelet-rich plasma lysate (PRP-L) preparation\nThawing\n\t\nBefore starting the thawing procedure, ensure that a warm bath is set at 37 °C. Put the PRP bags into the warm bath and wait until completely thawed.\nPRP-L collection\n\t\nCentrifuge the PRP bags at 3000 x g for 30 min at room temperature.\n\t\t​NOTE: The next steps should be performed in sterility under a class II biohazard hood.\nExploiting the piercing spike of the transfer bag, connect the centrifuged bag with an empty sterile 300 mL transfer bag. Carefully, transfer the PRP-L supernatant, while avoiding debris, into the new bag. When possible, use a bag press.\nSeal the connection tube of the PRP-L unit with a bag sealer.\nPRP-L aliquotation\n\tNOTE: A starting unit containing 190 mL PRP (see step 1.3.3.) is sufficient to fill two eye drops kits (for details on the specific medical devices used for the application and preservation of eye drops from blood components, see the Table of Materials). Eye drops kits should be opened under a class II hood with the whole string vials positioned above the pre-connected syringe and the central arrow of the stopcock pointing leftward to exclude the anti-bacterial filter.\n\t\nCollect 30-60 mL of PRP-L with a sterile syringe and link the syringe to the Luer/lock connection on the filling line.\nAccording to the manufacturer's instructions, turn the stopcock by half of a turn to open the line between the PRP-L-containing syringe and the pre-connected syringe. Fill the pre-connected syringe with PRP-L.\nDisconnect the PRP-L syringe, close the tube cap of the luer/lock connection and rotate the stopcock to the original position. Use the eye drops kit syringe to fill the vials with PRP-L.",
    "Repeat the procedure from steps 2.3.1.-2.3.3. until all the applicator vials are filled. Ensure that each applicator is properly filled, then individually seal them with a bag sealer.\nRepeat the procedure with a new eye drops kit.\nUse a small aliquot of residual diluted PRP-L to assess possible microbial contamination (see step 1.3.4.).\n\t\tNOTE: If the liquid accidentally reaches the anti-bacterial filter at the end of the string, the suction syringe may oppose resistance, hindering the filling. To continue the filling cycle, raise the end section of the string for about 5/6 aliquots from the anti-bacterial hydrophobic filter at the end of the string. In this position, use a new sterile syringe (of 30 mL volume) that has already been filled with air. Connect the female luer/lock of the anti-bacterial filter and press hard and repeatedly on the syringe's plunger to remove all residues of blood component and render the membrane of the anti-bacterial filter free of the liquid. Remove the syringe and fill the remaining vials.\nPRP-L storage\n\t\nProperly label each applicator and put them into a plastic bag. Label the plastic bag too, taking care to highlight the donor's blood group.\nStore at −80 °C for a maximum of 24 months before patient assignment, according to the Italian law23 and guidelines24.\n3. PRP-L dispensation\nPerform patient assignment preferably by matching the PRP-L blood group. Deliver PRP-L applicator vials using a cool box and ensure that each applicator vial contains 1.45 mL of PRP-L, which corresponds to approximately 45 drops. Instruct the patient that applicator vials can be stored at the patients' homes for up to 1 month at −15 °C.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}