{
  "id": 19001,
  "origin_website": "Jove",
  "title": "Live Imaging of Drug Responses in the Tumor Microenvironment in Mouse Models of Breast Cancer",
  "procedures": [
    "All procedures described must be performed in accordance with guidelines and regulations for the use of vertebrate animals, including prior approval by the local Institutional Animal Care and Use Committee.\n1. Generating Mouse Mammary Tumors for Imaging (Transgenic or Orthotopic)\nGenerate mammary tumors for imaging using genetically engineered mouse models (e.g. mouse mammary tumor virus long terminal repeat [MMTV]-polyoma middle T antigen [PyMT] or the rat C3(1) promoter driven large T antigen (Tag) of SV40 [C3(1)-Tag] models) or orthotopic transplantation models (syngeneic, allogeneic, or xenogeneic).\nLabel cancer cells by crossing genetically engineered models with transgenic reporter lines (e.g. ACTB-ECFP) or use ex vivo manipulation of primary cancer cells or cell lines (e.g. transduction) followed by transplantation. For a sample protocol for orthotopic transplantation, see 18.\n2. Visualizing Components of the Tumor Microenvironment or Sub-cellular Components\nVisualizing tumor components using transgenic labels. Crossbreed genetically engineered tumor models with transgenic reporter mice (e.g. c-fms-EGFP for myeloid cells or ACTB-H2B-EGFP for nuclei) or use such mice as recipients of transplanted, labeled tissues. This enables visualization of cancer cell-stromal cell interactions in response to therapy or nuclear changes associated with cell death, respectively.\nVisualizing the microenvironment using injectables. A wide variety of agents (e.g. fluorescently labeled antibodies or chemical dyes) can be used to label various components of the tumor. Depending on the half-life of the dye and the response one is interested in tracking, the injectable may be administered prior to the start of imaging or during the imaging session either intravenously (i.v.) or intraperitoneally (i.p., Figure 1).\n3. Microscopes and Imaging Software",
    "Microscope. A variety of microscope systems and software can be used for the imaging of live mice. The most commonly used systems are confocal or multiphoton microscopes. We use a micro-lensed spinning disk confocal microscope (Solamere Technologies, Salt Lake City, UT) with an ICCD camera (XR-Mega-10EX S-30, Stanford Photonics, Palo Alto, CA).\nImaging software. We use the open source software μManager (Vale Lab, University of California, San Francisco [UCSF]).\nImage analysis. We use Imaris (Bitplane), Volocity (PerkinElmer), and ImageJ (National Institute of Health [NIH]) for image analysis.\n4. (Pre)-treatment of Animals for Imaging\nInguinal mammary tumors are optimal for imaging using our protocol when the longest diameter measures approximately 8 mm or less by caliper measurement.\nFor imaging animals treated with a small molecule inhibitor, therapeutic antibody or chemotherapeutic drug, begin treatment prior to or during imaging as required for the experiment. For example, imaging of drug extravasation and distribution requires administration after imaging has been initiated (Movies 1 and 2), while imaging of cell death induced by the chemotherapeutic drug doxorubicin is best captured by starting imaging 24 hr or later after drug treatment (Movies 3 and 4).\n5. Preparation of Saline for Maintaining Hydration and Blood Osmolarity of the Animal during Imaging\nDraw approximately 1 ml of 1x PBS into a 1 ml syringe. Propidium iodide (PI, Invitrogen, 1 mg/ml, diluted 1:15) can be added to this solution that will be periodically administered (i.p.) during the imaging session. This will allow for imaging of the nuclei of dead or dying cells that have permeable cell membranes. PI has a very short half-life in the vasculature and must therefore be re-administered throughout the imaging session.",
    "Attach a winged infusion set (23 gauge, ¾ inch needle, 12 inch tubing) to this syringe and push the solution through the tubing until a drop of saline solution exits the tip of the needle at the end of the tubing.\nRemove the syringe from the infusion set, and refill it with the appropriate saline solution.\nRe-attach the syringe to the infusion set, taking care not to introduce bubbles into the line.\n6. Preparation of the Isoflurane Anesthesia System\nAdd water to the nebulizer and screw it in place. This will humidify the gases delivered to the animal, preventing irritation of the lungs and prolong survival of animals under long-term anesthesia.\nFill the isoflurane tank to the top line. CAUTION: Isoflurane is a potent anesthetic that can also affect the researcher. Appropriate vacuum systems should be in place to ensure that excess gases are removed from the area.\nTurn on both the oxygen tank and the nitrogen tanks and adjust flow. The nitrogen should be at around 1.0 L/min, while the oxygen should be at around 0.2 L/min (~21%).\nTurn on the (in-house) vacuum. The vacuum should be about 1.2 L/min.\nConfirm that the anesthesia line to the induction chamber is open, and the lines to the surgery area and the microscope are closed.\nConfirm that the latex breathing bag attached to the anesthesia system is inflated. If the bag does not inflate, replace it.\nCheck the rubber diaphragm on each of the nose cones delivering anesthesia to the microscope stage and the surgical platform. If the rubber is starting to thin, replace it.\n7. Preparation of Surgical Tools and Surgical Platform\nTurn on a hot bead sterilizer and let it reach >200 °C.",
    "Wash the surgical tools in soap and water (one pair of forceps [preferably with teeth] and scissors for cutting through the skin of the animal, one pair of forceps [preferably serrated] and scissors for further exposure of the tumor).\nSterilize the surgical tools for at least 30 sec using the hot bead sterilizer (alternatively, the surgical tools can be autoclaved in advance).\nLet the surgical tools cool off while making sure to avoid contaminating the sterilized tools.\nCollect the lid to a Styrofoam shipping cooler. This will be your surgical platform.\nPlace a piece of a lab soaker on top of the Styrofoam lid (enough to cover it).\nAffix a nose cone with a line to the anesthesia system to the lab soaker with laboratory tape (1\" tape works best here). Insert an 18 G x1½\" needle through the tape into the Styrofoam lid on either side of the nose cone to keep the nose cone secured in place.\nSet aside betadine, sterile gauze, two 70% isopropanol wipes, a microscope slide, Krazy Glue, and 4 pieces of lab tape (½\" width).\n8. Preparation of Microscope\nTurn on the microscope, the camera, and the computer running the microscope.\nTurn on the heating blanket.\nIf an inverted microscope is to be used, a custom-made stage insert should be designed with imaging ports corresponding to the location of the inguinal mammary glands. Clean the stage insert well with soap and water and dry. Use lab tape (½\" works best) to secure cover glass (#1.5 thickness) over the imaging ports and clean the entire surface with 70% isopropanol. Cover the stage with sterile gauze to protect against contamination. Place the stage insert in the stage and allow it to air dry.",
    "Tear 4 to 6 pieces of lab tape (1\" width), approximately 6 inches in length and attach them to the side of the microscope. These pieces of tape will be used to position the nose cone delivering anesthesia to the animal and fasten it in place.\nTear two more pieces of tape (½ inch width) that are about an inch in length. These will be used to keep the butterfly needle delivering PBS to the mouse and the microscope slide used to expose the tumor in place.\n9. Exposing the Inguinal Mammary Gland for Imaging\nAnesthetize the animal in an induction chamber using 4% isoflurane with 21% oxygen and balance nitrogen (flow rate at about 1.0 L/min) as the carrier gas. This should take 2-4 min.\nTransfer the mouse to the surgical platform once it is breathing deeply and slowly, with the ventral surface facing up. Open the anesthesia line to the surgical platform and then close the anesthesia line to the induction chamber, in this order to avoid too high pressure in the anesthesia system. Reduce the concentration of isoflurane from 4% to 2.5% at this time.\nCheck the pedal withdrawal reflex to confirm that the animal is sufficiently anesthetized for the surgical procedure by performing a footpad pinch. The animal is adequately anesthetized if it does not react (e.g. twitch or curl its tail) to the footpad pinch. If the animal does react to the footpad pinch, increase the concentration of isoflurane.\nSecure the limbs of the mouse to the surgical platform with laboratory tape (½\" tape works best for this).",
    "(Optional) Once the animal is secured to the surgical platform, hair can be removed from the ventral surface using an electronic shaver. If chemical hair removal is preferred, this should be performed 24-48 hr prior to surgery. Removing hair prior to surgery helps to prevent contamination of the imaging site, as stray hairs can induce strong and acute immune responses.\nDisinfect the ventral surface of the animal with 70% isopropanol wipes and betadine.\nUsing the first pair of sterile scissors and forceps (with teeth), make a subcutaneous ventral midline incision that runs from ~3 mm above the urethra to the xiphoid process. Take care to avoid puncturing or cutting through the peritoneum.\nUsing the second pair of sterile scissors and forceps (serrated), gently detach the skin, with the inguinal mammary gland attached, from the peritoneal cavity.\nTake a glass microscope slide and position it against the skin flap generated in the previous step. Position the slide in such a way that the bulk of the tumor will sit flat once the mouse is placed on the stage, and it does not interfere with the mobility of the hind limbs.\nOnce the microscope slide has been properly positioned, attach the slide to the external surface of the skin using superglue (e.g., Krazy Glue).\n10. Positioning the Mouse on the Stage\nRemove the laboratory tape securing the limbs of the animal to the surgical platform.\nOpen the anesthesia line to the microscope stage and close the anesthesia line to the surgical platform, in this order.\nQuickly transfer the animal to the microscope stage.\nOnce the animal has been transferred, position and secure the anesthesia line and nose cone properly (using e.g. lab tape) to ensure that the mouse remains anesthetized and is in a comfortable position.",
    "Expose the tumor so that it is positioned on top and in the center of one of the cover glass-covered imaging ports in the microscope stage.\nUsing the eyepieces, verify that the tumor is correctly positioned, and gently tape down the microscope slide. The slide should be secured loosely so blood flow to the tissue is not obstructed. Taping down the microscope slide helps to minimize imaging artifacts introduced by the animal's breathing.\nInsert the indwelling intraperitoneal line with winged infusion set attached to a 1-ml syringe containing sterile 1x PBS or saline (optionally containing a dye such as PI) prepared under #5. Inject the animal with 100 μl when the i.p. line is inserted. From this time point until the end of the imaging session, inject the animal with 50 μl of saline at 1 hr intervals (or 25 μl of saline with PI every 30 min).\nTo monitor the animal's vital signs, attach an oximeter probe (e.g. MouseOx system by Starr Life Sciences, Inc.)19.\nCover the mouse with a heating blanket to prevent hypothermia.\n11. Acquisition of Images\nThe open source software μManager (Vale Lab, UCSF) is used to acquire time-lapse images. The raw data is compiled in Imaris (Bitplane) software, and can be scored manually by independent observers, or analyzed in either Imaris or other image analysis software (e.g. Volocity [PerkinElmer] or ImageJ [NIH]).\n12. Euthanasia\nAt the end of the image session (1-40 hr, depending on the type of process analyzed), the animal is euthanized.\nThe concentration of isofluorane is increased to 4%.\nThe animal is observed until 30 sec after it seizes breathing and then removed from the stage.\nCervical dislocation is performed to ensure that the animal has been euthanized.\n13. Representative Results",
    "Intravital imaging using this method allows for the direct visualization of various processes, including drug delivery to tumors, extravasation and distribution of the drug once it reaches the tumor, cell death following therapeutic treatment, and tumor-stroma interactions in response to cell death5. To observe the arrival of a drug to the tumor and its distribution following extravasation into tumor tissues, the animal is injected while images are being acquired. Although several classes of chemotherapeutics are weakly fluorescent (such as doxorubicin), many are not. Fluorescently conjugated dextrans can be used as surrogate markers for drug delivery and diffusion into tissues. Figure 2 and Movie 1 show the arrival of a fluorescein-isothiocyanate (FITC)-conjugated 2 MD dextran (Invitrogen, 1 mg/ml 1xPBS) injected i.v. into a tumor of an MMTV-PyMT;ACTB-ECFP mouse.\nFollowing the arrival of the drug into the tumor, extravasation and diffusion through the tissues can be imaged to determine both the intravascular half-life of a drug and drug distribution5. Movie 2 shows the extravasation and distribution of Alexa Fluor-647-conjugated 10 kD dextran (Invitrogen, 1 mg/ml in 1 x PBS) injected i.v. into a C3(1)-Tag;ACTB-ECFP;c-fms-EGFP mouse during imaging. After compilation of time-lapse movies in Imaris (Bitplane), intravascular half-life and drug distribution is quantified. To measure intravascular half-life, the mean fluorescence intensity in tumor blood vessels at each time point is calculated and plotted against time. Drug distribution is quantified as a percent area per total tumor area that is positive for the drug.",
    "In addition to tracking the kinetics of drug delivery to tumors, it is frequently important to determine how tumors are responding to therapy. As anti-cancer therapies are expected to induce cell death, propidium iodide (PI) staining or structural nuclear changes can be used as a marker of drug-induced cell death5. Figure 3 shows the tumor response to the cytotoxic chemotherapeutic doxorubicin in an MMTV-PyMT;ACTB-ECFP;c-fms-EGFP mouse. In this triple transgenic MMTV-PyMT;ACTB-ECFP;c-fms-EGFP animal, ECFP labels breast cancer cells (blue), and EGFP labels myeloid cells (green). The animal imaged during this session was administered doxorubicin 18 hr before imaging began and PI was delivered i.p. throughout the imaging session as described above. Cancer cells (ACTB-ECFP labeling) appear as blue, and dead or dying cells appear as red (PI staining). The time series presented here shows induction of doxorubicin-dependent cell death over time. To quantify the induction of cell death in tumors, the same type of analysis used for determining drug distribution is used, where the quantitative output is percent area per total tumor area that is positive for PI.",
    "Imaging at high magnification can provide information regarding the type of cell death that cancer cells undergo5. Movie 3 shows the results of an imaging experiment to track nuclear changes typical of apoptotic cell death in response to systemic therapy with doxorubicin. To visualize nuclei, the animal imaged during this session harbors the ACTB-H2B-EGFP reporter instead of the c-fms-EGFP reporter, so the nuclei of cancer cells are labeled in green. This MMTV-PyMT;ACTB-ECFP;ACTB-H2B-EGFP animal was administered doxorubicin (8 mg/kg in 1 x PBS) i.p. 24 hr prior to the start of movie, and received hourly injections of 1 x PBS containing PI (Invitrogen, 1 mg/ml solution diluted 1:15). Structural changes in the nuclei of cancer cells can be observed in an apoptotic cell next to cells that have undergone necrosis (PI-positive cells that display minimal changes in nuclear morphology). Nuclei of apoptotic cells eventually becomes red due to the uptake of PI staining (not shown). The number of necrotic and apoptotic events is quantified manually for each time point based on PI-positivity and nuclear morphology.",
    "Chemotherapy-induced cancer cell death frequently results in a reactive recruitment of immune cells into tumors2,4,5. Figure 4 shows an example of this stromal response to acute treatment with doxorubicin. The MMTV-PyMT;ACTB-ECFP;c-fms-EGFP animal imaged here was administered doxorubicin (8 mg/kg in 1 x PBS) i.p. approximately 20 hours prior to the start of imaging, and received hourly PI injections i.p. for the duration of the experiment to visualize cell death. The times indicated represent the number of hours after doxorubicin treatment, and the scale bar represents 100 μm. In this experiment, myeloid cells infiltrate into areas of cell death, as indicated by the white arrows. To quantify myeloid cell infiltration into tumors following doxorubicin administration, the same type of analysis used for determining drug distribution and tumor response to chemotherapy is used, where the quantitative output is percent area per total tumor area that is positive for EGFP.\nIn addition to visualizing the overall stromal response to chemotherapy, specialized stromal responses can also be visualized5. Movie 4 shows the phagocytosis of necrotic cell material by a neighboring cell. The red nuclear material can be seen being ingested by a cell with a large intact green nucleus, which is typical of macrophages. The MMTV-PyMT;ACTB-ECFP;ACTB-H2B-EGFP animal imaged during this session was administered doxorubicin (8 mg/kg in 1 x PBS) i.p. 24 hr prior to the start of the movie. The animal received hourly injections of 1 x PBS containing PI (Invitrogen, 1 mg/ml solution diluted 1:15). Nuclei (ACTB-EGFP labeling) appear as green, but turn red as the cell undergo necrosis.\nimgsrc://cloudfront.jove.com/files/ftp_upload/50088/50088fig1.jpg",
    "Figure 1. Sample labeling of different tumor components using transgenic and injectable labels. This is a triple-transgenic MMTV-PyMT;ACTB-ECFP;c-fms-EGFP animal in which cancer cells are labeled in blue through expression of ECFP and myeloid cells are labeled in green through expression of EGFP from a myeloid-specific promoter. The animal was injected with propidium iodide (PI, red, ~0.07 mg/ml in 1x PBS) during the imaging session to visualize cell death. PI labels DNA but only crosses the cell membranes of dead or dying cells. Scale bar = 100 μm.\nimgsrc://cloudfront.jove.com/files/ftp_upload/50088/50088fig2.jpg\nFigure 2. Drug extravasation and distribution in tumors. This double-transgenic MMTV-PyMT;ACTB-ECFP animal in which cancer cells are labeled in blue through expression of ECFP was injected with FITC-conjugated 2 MD dextran (green) during the imaging session to visualize how drugs reach tumors after i.v. injection (blue). Time after imaging was initiated is indicated. Scale bar = 100 μm.\nimgsrc://cloudfront.jove.com/files/ftp_upload/50088/50088fig3.jpg\nFigure 3. Cancer cell response to systemic therapy. An MMTV-PyMT;ACTB-ECFP;c-fms-EGFP animal treated with the chemotherapeutic drug doxorubicin prior to imaging, and injected with PI (red, ~0.07 mg/ml in 1x PBS) to label cell death. This image series shows the accumulation of PI staining over time (as indicated by white arrows), representing the induction of cell death following doxorubicin treatment. Time indicated is time after doxorubicin treatment. Images are maximum intensity projections of a z-stack containing three images in the z-axis. Scale bar = 100 μm.\nimgsrc://cloudfront.jove.com/files/ftp_upload/50088/50088fig4.jpg",
    "Figure 4. Myeloid cell response to chemotherapy in an MMTV-PyMT;ACTB-ECFP;c-fms-EGFP triple transgenic mouse administered doxorubicin 20 hr prior to imaging. The animal received hourly i.p. injections of PI (red, ~0.07 mg/ml in 1x PBS) to label dead cells. This image series shows the accumulation of EGFP-positive myeloid cells (as indicated by white arrows) over time following doxorubicin treatment. This reactive immune response has been shown to impede therapeutic response to several classes of chemotherapies4,5. Time indicated is time after doxorubicin treatment. Images are maximum intensity projections of a z-stack containing three images in the z-axis. Scale bar = 100 μm.\nMovie 1. Drug delivery into a tumor. This is a double-transgenic MMTV-PyMT;ACTB-ECFP animal in which cancer cells are labeled in blue through expression of ECFP. The animal was injected with a 2 MD FITC-conjugated dextran (green) during the imaging session to visualize how drugs reach tumors after i.v. injection. Scale bar = 100 μm.  Click here to view movie[href=http://www.jove.com/files/ftp_upload/50088/50088movie1.mov].\nMovie 2. Drug infiltration into the tumor tissue. A triple transgenic C3(1)-Tag;ACTB-ECFP;c-fms-EGFP animal in which cancer cells are labeled in blue through expression of ECFP and myeloid cells labeled in green through expression of EGFP was injected i.v. with an Alexa Fluor 647-conjugated 10 kD dextran (red). The field of view is shown immediately after injection with dextran. The dextran initially labels the vasculature, rapidly extravasates into the tumor tissue, and is finally taken up by macrophages. Scale bar = 100 μm.  Click here to view movie[href=http://www.jove.com/files/ftp_upload/50088/50088movie2.mov].",
    "Movie 3. Imaging of nuclear changes after chemotherapy-induced cell death. This triple transgenic MMTV-PyMT;ACTB-ECFP;H2B-EGFP animal was injected with doxorubicin prior to imaging. Nuclear morphology (green), as tracked by expression of an H2B-EGFP fusion protein, allows for direct visualization of chemotherapy-induced nuclear structural changes typical of apoptosis as seen for the cell in the top right corner. The animal received half-hourly i.p. injections of PI (red) for the duration of the imaging session to label dead and dying cells. Time indicated is time after doxorubicin treatment +24 hr. Images were acquired using a high magnification objective lens (40x, NA 1.1, water lens). Scale bar = 15 μm.  Click here to view movie[href=http://www.jove.com/files/ftp_upload/50088/50088movie3.mov].\nMovie 4. Imaging of nuclear changes and uptake of dead cell material after chemotherapy-induced cell death. This triple transgenic MMTV-PyMT;ACTB-ECFP;H2B-EGFP animal was injected with doxorubicin prior to imaging. Nuclear morphology (green), as tracked by expression of an H2B-EGFP fusion protein, allows for direct visualization of chemotherapy-induced nuclear structural changes. The animal received half-hourly i.p. injections of PI (red) for the duration of the imaging session to label dead and dying cells. Images were acquired using a high magnification objective lens (40 x, NA 1.1, water lens). The lack of major structural changes prior to labeling with PI and the change in the nuclear morphology and loss of GFP signal is indicative of necrosis-like cell death. The dead material is seen being taken up by a cell with a large nucleus, which is typical of macrophages. Time indicated is time after doxorubicin treatment +24 hr. Scale bar = 10 μm.  Click here to view movie[href=http://www.jove.com/files/ftp_upload/50088/50088movie4.mov]."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}