{
  "id": 10747,
  "origin_website": "Jove",
  "title": "Mesenchymal Stromal Cell Culture and Delivery in Autologous Conditions: A Smart Approach for Orthopedic Applications",
  "procedures": [
    "The present protocol was developed in accordance with the World Medical Association's Declaration of Helsinki regarding the ethical conduct of research involving humans. It was approved by the Ethical Committee of the Azienda Ospedaliero-Universitaria Pisana.\nNOTE:\nBone marrow was obtained from patients undergoing routine total hip replacement surgery (according to step 1.1)15; plasma for the clot preparation was obtained from autologous peripheral blood13; autologous serum, as a supplement for the culture medium, was collected from an autologous whole-blood apheresis. All the patients received detailed information about the procedure and signed a written consent form.\n1. Collection of the Bone Marrow Sample\nCollect bone marrow from the femoral medullary canal after a total hip replacement surgery (for research studies). Briefly, during the surgical preparation of the medullary canal to house the prosthetic stem, collect the marrow blood that overflows (about 10 - 15 mL, depending on the prosthesis size)15.\n\tOR\nCollect bone marrow aspirate from the iliac crest under local anesthesia, following standard hematologic procedure about 20 - 30 d in advance (for clinical applications)16.\n\tNOTE: In both cases heparinized syringes (to prevent clot formation) must be used for bone marrow recovery.\n2. Preparation of Autologous Plasma\nCollect 20 mL of peripheral blood from the patient in vacuum blood collection tubes containing K3 EDTA (5.4 mg in 3 mL tubes) and centrifuge at 2,400 × g for 15 min.\nAspirate the plasma component in a 15 mL tube and freeze at -20 °C until usage.\n3. Preparation of the Autologous Serum\nTransfer the unit of plasma into a transfer bag using a spike. Disconnect the filled bag by welding and weigh the bag to calculate the volume of plasma (Figure 1A).",
    "Coagulate the autologous plasma by injecting calcium gluconate 100 mg/mL at 10% w/v through the port connector (Figure 1B). After mixing the bag, place it at 4 °C O/N without shaking to facilitate clot formation.\nCentrifuge the bag at 4,900 × g for 15 min at RT. Take the centrifuge bucket out of the centrifuge and remove the bag carefully (follow the manufacturer's guidelines for the preparation of platelet lysate) (Figure 1C).\nIsolate the clot just above the clamp to facilitate filtration. Connect the filtration kit to the transfer bag using a spike placed into the outlet port of the filtration kit.\nHang the bag and open the blue clamp to let the serum flow by gravity. Do not apply pressure to the filter to avoid transfer of fibrin into the bag. After filtration, seal the tubing and remove the bag (follow the manufacturer's guidelines for preparation of platelet lysate).\nConnect a dedicated line to the final bag and transfer serum into 50 mL tubes under a laminar flow bench to avoid microbial contamination.\nTake a sample with a syringe to test the absence of fibrinogen and perform a sterility test for aerobic and anaerobic bacterial cultures17. Label the tubes appropriately and freeze them at - 20 °C until usage.\n4. Preparation of the Expansion Medium\nPrepare 500 mL of complete proliferation medium. To Dulbecco's Modified Eagle Medium - Low Glucose (DMEM-LG), add 10% autologous serum (obtained as described in section 3), 2 mM glutamine, 1% antibiotic solution and 1% antimycotic solution. Sterile-filter the complete proliferation medium.\n5. Isolation of hMSCs from the Bone Marrow",
    "Transfer the bone marrow sample (5 - 10 mL) from the syringe into a 50 mL conical tube and dilute it with sterile saline (ratio 1:4). Vortex the 50 mL tube for 30 s to disaggregate the cell clusters.\nWarm the density gradient (density 1.077 g/L; see Table of Materials) to RT before usage and layer the diluted bone marrow gently (to prevent mixing both layers) onto the density gradient by adding 20 mL of the sample to 15 mL of density gradient for each 50 mL tube (Figure 2A).\nCentrifuge at 400 × g without brake at 25 °C for 30 min, then collect the mononuclear fraction at the liquid-liquid interface and transfer it to a new 50 mL tube using a sterile 5 mL pipette.\nWash the collected mononuclear fraction twice with complete proliferation medium and centrifuge the tubes at 400 × g for 10 min at 25 °C to obtain cell pellets.\nDiscard the supernatant and gently resuspend each cell pellet in 5 mL of complete proliferation medium. Dilute at a 1:100 ratio for cell counting.\nCount the cells using a hemocytometer after a 1:1 dilution with Trypan Blue staining to evaluate cell viability.\n6. Culture of hMSCs in the Presence of Autologous Serum\nFill two or more 75 cm2 tissue culture (TC) flasks with 15 mL of fresh complete proliferation medium and transfer them to a cell culture incubator at 37 °C and 5% CO2 until usage.\nSeed 0.3 - 0.5 x 106 cells/cm2 (37.5 x 106 cells/15 mL of fresh complete proliferation medium) and incubate at 37 °C and 5% CO2 for 48 h.",
    "At the same time, seed 1 x 106 cells in a 25 cm2 TC flask with 5 mL of fresh complete proliferation medium for the Colony Forming Unit - Fibroblast (CFU-F) assay. Culture for 2 weeks (to be continued in section 12).\nDiscard the medium and gently wash the flasks from step 6.2 with complete proliferation medium to remove nonadherent cells and debris. Add fresh medium to the flasks and replace half of it twice a week, until 70 - 80% confluency (primary culture, Passage 0 (P0)) (Figure 2B).\nRecover the cells by using a specific recombinant animal free protease (see Table of Materials; use 3 mL of the solution per flask as recommended by the manufacturer) and incubate at 37 °C and 5% CO2 for 10 min. Add 6 mL of complete proliferation medium per flask and collect in one 50 mL tube. Repeat step 5.6.\nNOTE: IMPORTANT: The use of this protease instead of trypsin allows the recovery of some Mesodermal Progenitors Cells (MPCs) present in the culture, which is trypsin resistant.\nFor further expansion, replate the cell suspension at 2,000 - 3,000 cells/cm2 in new 75 cm2 TC flasks (P1) (Figure 2C).\nUse aliquots of cells to evaluate the differentiation potentials of MSCs towards osteogenic, adipogenic and chondrogenic lineages. Perform differentiation assays following the manufacturer's recommendations (Figure 2D).\nNOTE: Different staining methods can be used to assess multilineage differentiation.\n7. Preparation of an Osteogenic Medium with Pharmaceutical Supplements\nDilute ascorbic acid solution (Solution 1A: ascorbic acid 200 mg/mL (See Table of Materials) 1:10 with DMEM-LG, to obtain a 20 mg/mL solution (Solution 1B, working solution). Stock aliquots of solutions 1A and 1B at -20 °C until usage.",
    "Resuspend 1 g hydrocortisone in 10 mL of sterile water (Solution 2A: hydrocortisone 100 mg/mL (See Table of Materials). Dilute Solution 2A at 1:1,000 with DMEM-LG to obtain a 100 µg/mL solution (Solution 2B, working solution). Stock aliquots of solutions 2A and 2B at -20 °C until usage.\nUpon usage prepare fresh osteogenic medium as follows: add DMEM-LG with 10% autologous serum, 50 µg/mL ascorbic acid and 0.4 µg/mL hydrocortisone. Sterile-filter the osteogenic medium.\n8. Osteogenic Pre-induction and Recovery of hMSCs\nCompletely remove the proliferation medium and add osteogenic medium 96 h before cell harvesting (i.e., 80 - 90% confluence is usually reached in 7 d). Provide an additional osteogenic medium change 24 h before cell harvesting.\nDetach the cells as described in step 6.5 and gently resuspend the pellet adding 2 mL of complete proliferation medium in a 50 mL tube.\nNOTE: Cell viability may be reduced (about 10%) as a result of osteoinduction. Cellular aggregates can be observed.\nAfter counting, wash the cells with complete proliferation medium and centrifuge at 300 × g for 5 min. Resuspend the pellet gently at 1 - 2 x 106 viable cells/2 mL of autologous plasma (see section 2) per 50 mL tube.\n9. Preparation of hMSC/fibrin Clot Constructs\nAdd 150 µl of calcium gluconate at 100 mg/mL to each 50 mL tube obtained from step 8.3. and resuspend the cells under gentle shaking.\nIncubate the cells at 37 °C and 5% CO2 for 15 - 30 min to obtain hMSC/fibrin clot constructs (Figure 3A). Prepare a fibrin clot construct without cells to be used as a control.\nNOTE: IMPORTANT: It is recommendable to prepare this control clot at least 2 h before the cell viability assay, as it takes 30 min or more to crosslink.\n10. Cell Viability Assay",
    "Remove the liquid from the 50 mL tubes and add 1 mL of complete proliferation medium containing 10% v/v cell viability reagent (AB; see Table of Materials), according to the manufacturer's guidelines.\nIncubate the tubes at 37 °C and 5% CO2 for 3 h. Measure the absorbance at 570 nm with a reference wavelength of 600 nm (AB at time 0; t0).\nDiscard the supernatant and add 2 mL of fresh complete proliferation medium. Incubate at 37 °C, 5% CO2 O/N. The next day (AB at time 24 h; t24), repeat steps 10.1 to 10.3 (Figure 3B).\n11. Histologic Evaluation of Cell Viability and Calcium Deposition inside Fibrin Clot Constructs\nFix the hMSC/fibrin clot constructs in 4% w/v neutral buffered formalin O/N at 4 °C. Wash 4x in D-PBS for 15 min and store in 70% ethanol.\nDehydrate the samples at 40 °C in a series of graded ethanol: 80% once for 30 min, 95% twice for 45 min and 3x 100% for 1 h. Clarify twice in xylene for 45 min at 40 °C.\nRinse the samples in liquid paraffin at 60 °C for 2 h and embed them. Cut the paraffin block with a microtome and mount the sections (5 µm) on glass slides.\nStain the deparaffinized sections using the standard Hematoxylin and Eosin (H&E) method (Figure 3C).\nPerform von Kossa staining by treating the sections with 1% silver nitrate for 15 min, 0.5% Pyrogallol for 2 min, and 5% sodium thiosulfate for 2 min. Counterstain the sections with 0.1% nuclear fast red diluted in a solution containing 5 g aluminum sulphate for 5 min and rinse them in tap water for 5 min. Mount the sections with a mounting agent.\nEvaluate the mineral deposition as black granules under light microscope (400X magnification) (Figure 3D).\n12. CFU-F Assay",
    "Wash the 25 cm2 flask (from step 6.3.) with D-PBS. Stain by using the standard May-Grunwald/Giemsa method. Visually quantify hMSC number by scoring individual colonies (Figure 4) under a light microscope.\nNOTE: If the bone marrow is taken as in step 1.2. and the sections 2 - 9 are performed in Good Manufacturing Practice (GMP) with the necessary regulatory approval, the hMSC/fibrin clot constructs can be implanted for orthopedic applications."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}