{
  "id": 17111,
  "origin_website": "Jove",
  "title": "Rotating the Intraocular Lens to Prevent Posterior Capsular Opacification in Cataract Surgeries",
  "procedures": [
    "This study adhered to the tenets of the Declaration of Helsinki. The study protocol was approved by the Institutional Review Board of Peking University Third Hospital. It should be noted that the novel procedure here is the step of rotating the IOL. The inclusion criteria are cataract patients over 50 years of age willing to undergo cataract surgery in Peking University Third Hospital. The exclusion criteria are the presence of eye diseases that may affect the stability of the suspensorium and capsular bag, such as pathologic myopia, glaucoma, pseudoexfoliation syndrome, uveitis, subluxation of the lens including Marfan syndrome, Marchesani syndrome, and homocystinuria.\n1. Surgery preparation\nPatient preparation\n\t\nUse 0.5% levofloxacin eye drops four times per day 3 days before surgery. Administer topical anesthetic eye drops of 0.4% oxybuprocaine hydrochloride three times per 5 min before the surgery (see Table of Materials).\n\t\tNOTE: Patients' pupils become dilated with compound tropicamide eye drops (0.5% tropicamide and 0.5% phenylephrine hydrochloride) 1 h before surgery.\nEquipment settings\n\t\nEnsure the following settings for the phacoemulsification device system (see Table of Materials): 30%-95% torsional nucleus chop, 90 cm bottle height, 260-450 mm Hg vacuum, and 36 cc/min aspiration flow rate.\n2. Rotating using the irrigation and aspiration (I/A) system\nCorneal incision\n\t\nMake a 3.2 mm limbal incision at the steepest meridian using a 3.2 mm slit blade (see Table of Materials). A \"Z\"-shaped multiplanar corneal incision is preferred. First, create a 0.3 mm deep groove perpendicular to the corneal surface and insert the blade into the groove with its tip tangentially directed to the corneal surface, thereby creating a tunnel through the clear cornea into the anterior chamber.\nCreate a 0.8 mm subsidiary incision 90° anti-clockwise using a 20 G side port microvitreoretinal (MVR) knife (see Table of Materials).\nPhacoemulsification",
    "Open the capsule with a continuous curvilinear capsulorhexis using Utrata capsulorhexis forceps (see Table of Materials) under viscoelastic conditions.\nPerform cortical-cleaving hydrodissection by placing a blunt-tipped cannula with balanced salt solution (BSS) under the anterior capsule flap, carefully lifting the capsular, and injecting BSS in a radial direction, to separate the cortex from the posterior capsule.\nPerform hydrodelineation by injecting BSS into the substance of the nucleus to separate the harder nucleus from the peripheral softer nucleus.\nUnder the mode of \"chop\", bury the phaco tip into the center of the nucleus and insert the phaco tip (see Table of Materials) under the anterior capsule flap, cracking the nucleus into two pieces using Sinskey hook (see Table of Materials). Repeat this step to create multiple small wedges of the nucleus for phacoemulsification.\nIrrigation and Aspiration (I/A)\n\t\nModulate the machine in \"cortex\" mode. Use the I/A tip (see Table of Materials) to accomplish cortical cleanup. Remove the soft epinucleus and peripheral cortical material.\nIOL insertion\n\t\nFill the capsule bag and anterior chamber with viscoelastics (see Table of Materials). Load a foldable single-piece IOL (see Table of Materials) into an injector cartridge prefilled with viscoelastic.\nIntroduce the tip of the injector through the incision and insert the IOL by pushing the tail of the injector, with the anterior haptic spreading into the capsular bag. Place the posterior haptic under the anterior capsule using the tip of the injector.\nRotating the IOL and removing the viscoelastic\n\t\nUse the I/A tip to remove the viscoelastic from the anterior chamber. During this procedure, rotate the IOL clockwise at least 360° using the I/A tip with slight posterior pressure.\nAspirate the residual fragments and viscoelastic in the capsular bag by inserting the I/A tip behind the optic part of the IOL.\n3. Rotating using IOL hooks",
    "The steps before insertion of the IOL are the same as the first four steps (2.1-2.4) above. In this method, after the IOL is inserted into the capsular bag, use a Fenzl hook (see Table of Materials) to rotate the IOL clockwise at least 360° and slide the IOL in the capsular bag from side to side, putting slight pressure on the posterior capsule at the same time.\n4. Follow-up procedures\nInstill BSS from the paracentesis incision using a blunt-tipped cannula to reform the anterior chamber.\nInject BSS into both sides of the corneal tunnel incision. If the incision leaks, the wound should be sutured with a 10-0 nylon suture.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}