{
  "id": 12032,
  "origin_website": "Jove",
  "title": "Time-Lapse 2D Imaging of Phagocytic Activity in M1 Macrophage-4T1 Mouse Mammary Carcinoma Cells in Co-cultures",
  "procedures": [
    "NOTE: Sections 1−6 describe the coculture model of 4T1 mouse mammary carcinoma cells and RAW 264.7 mouse macrophages. Section 7 describes the time-lapse assessment of M1 macrophages phagocyted 4T1 cells.\n1. Culturing 4T1 mouse mammary carcinoma cells and RAW 264.7 mouse macrophages\nThaw a vial of cryogenically preserved 4T1 and RAW 264.7 passage 6 cells by gentle agitation in a water bath at 37 °C or the normal growth temperature for the cell lines.\n\tNOTE: Thawing should be done rapidly, approximately within 2 min. To avoid contamination, remove the vial from the water bath and decontaminate it by spraying with 70% ethanol. To avoid genetic drift, especially for the macrophages, use a low passage number (i.e., less than 20).\nDilute the thawed cells in 10 mL of complete DMEM medium in a 15 mL conical tube and centrifuge the cells at 600 x g for 5 min to obtain a cell pellet.\n\tNOTE: Complete DMEM medium supplemented with 10% (v/v) fetal bovine serum (FBS), 200 U/mL penicillin/streptomycin, and 2 mM L-glutamine is used throughout the protocol.\nCarefully aspirate the media, resuspend the cells in 8 mL of complete medium and transfer into a 25 cm2 tissue culture treated flask. Culture both 4T1 and RAW 264.7 cells in complete DMEM medium at 37 °C with 5% CO2.\n\tNOTE: Resuspend the cell pellets gently and add the cell suspension into the culture flask drop by drop to avoid killing the cells.\nAfter 1 week of culturing to allow cell adherence, monitor the flask daily and add 8 mL of complete DMEM medium as needed.\n2. Immunostaining of M1 polarized RAW 264.7 macrophages\nAs the confluency of RAW 264.7 cells reaches 70−80%, discard the culture media and gently rinse 2x with at least 2 mL of PBS.",
    "NOTE: Before seeding RAW 264.7 cells, make sure no cell differentiation has occurred (i.e., dendrite-like phenotype and/or increased cell size). If cell morphology changes are visible, discard the culture and thaw a new cell line from the earlier passage vial.\nPrepare the macrophages for collection by gently dislodging the adherent cells using a cell scraper and transfer them into a 15 mL conical tube.\nCount the cells using a hemocytometer and prepare a cell suspension of 1 x 105 cells/dish using complete DMEM medium.\nSeed 2 mL of the macrophages suspension into two imaging dishes. Incubate the cells 2−3 h at 37 °C with 5% CO2 to allow cell adherence.\nPrepare M1 polarization media by adding 100 ng/mL LPS and 20 ng/mL IFN-γ into complete DMEM medium10,11.\nDiscard the culture supernatant from the macrophages and carefully wash the monolayers in the dish 2x with at least 1 mL of PBS.\nAdd 2 mL of M1 polarization media into one of the imaging dishes, allow the RAW 264.7 cells to induce the M1 macrophage phenotype, and incubate 2–3 h at 37 °C with 5% CO2.\n\tNOTE: Seed RAW 264.7 macrophages in an imaging dish with DMEM supplemented with 10% FBS as a control for the anti-iNOS antibody staining. Label the imaging dishes RAW (control) and M1 macrophages (LPS and IFN-γ polarized), respectively.\nBefore immunostaining, fix the RAW 264.7 and M1 macrophages cells using 2 mL of 4% paraformaldehyde and incubate for 15 min at 37 °C (room temperature, RT).\nRemove the supernatant and wash the cell monolayer with 1 mL of PBS at least 3x.\nQuench with 2 mL of 50 mM ammonium chloride in PBS and incubate for 15 min at RT.\nPermeabilize using 2 mL of 0.3% Triton X-100 in PBS for 15 min at RT.",
    "Remove the supernatant and wash the cell monolayer with 1 mL of PBS at least 3x.\nBlock using 2 mL of 10% FBS in PBS for 30 min at RT.\n\tNOTE: The blocking step in immunostaining is to minimize the non-specific binding of antibody within the cell.\nRemove the supernatant and wash the cell monolayer with 1 mL of PBS at least 3x.\nIncubate with 2 mL of anti-iNOS-FITC in PBS and 1% FBS overnight at 4 °C.\n\tNOTE: Label the cells using the appropriate antibody dilution according to the manufacturer's recommendations. Protect the dishes from light by covering them with aluminum foil from this point on.\nRemove the supernatant and wash the cell monolayer with 1 mL of PBS at least 3x.\nIncubate 1 mL of 300 nM 6-diamidino-2-phenylindole (DAPI) into imaging dishes for 10 min in 37 °C, in the dark by covering with aluminum foil.\nWash cells with 1 mL of PBS at least 3x and add 1 mL of complete DMEM medium into the imaging dishes.\n\tNOTE: The cells are now ready for fluorescence imaging. The microscope setup will need an inverted stage and excitation filters for the chosen stains (in this case, FITC and DAPI).\nTurn on the microscope and load the imaging software. Mount the imaging dish on the microscope and adjust the focus to observe RAW 264.7 and M1 macrophages. Optimize the appearance of phase-contrast FITC and DAPI images by adjusting the transmitted light and exposure times.\n\tNOTE: Begin imaging when all points are in focus and the channels are optimized.\nCapture phase-contrast FITC and DAPI images (Figure 1).\n3. Seeding 4T1 mouse mammary carcinoma cells",
    "As the confluency of 4T1 cells reaches 70−80%, discard the culture media and gently rinse 2x with at least 2 mL of PBS. Add 1 mL of prewarmed trypsin to dissociate the cells and incubate for up to 20 min at 37 °C.\n\tNOTE: Observe the cells under a microscope. Detached cells will be rounded.\nOnce the cells detach, transfer them to a 15 mL conical tube and add 2 mL of prewarmed complete DMEM medium to inactivate the trypsin. Gently disperse the medium by pipetting the cell layer surface to recover the cells. Then, centrifuge at 600 x g for 5 min to obtain a cell pellet.\nRemove the supernatant and resuspend the pellet in 10 mL of prewarmed complete DMEM medium.\nCount the cells using a hemocytometer and seed 1 x 105 4T1 cells in 2 mL of complete DMEM medium in each of two 35 mm glass-bottom imaging dishes treated with tissue culture. Incubate the cells overnight at 37 °C with 5% CO2.\n\tNOTE: Culture 4T1 cells in one of the imaging dishes with M1 polarization media and label 4T1-Inducer (control). This is to ensure normal growth of 4T1 cells when exposed to the inducers.\n4. Labeling living 4T1 mouse mammary carcinoma cells using CFSE staining\nFirst, remove the existing media from the 4T1 cells imaging dishes. Wash the cell monolayer at least 2x with 1 mL of PBS.\nPrepare 5 µM of CFSE staining solution by diluting CFSE in 1 mL of PBS. Add 1 mL of 5 µM CFSE staining solution into each imaging dish and incubate the cells for 20 min at RT or 37 °C, in the dark.",
    "NOTE: Label the cells using appropriate CFSE working concentration according to the manufacturer's recommendations and preliminary experiments to obtain the optimum CFSE staining concentration. Labeling efficiency will be higher if CFSE is diluted in PBS.\nQuench the staining by adding an equal volume of complete DMEM medium containing 10% FBS and staining solution to the cells and incubate for 5 min at RT in the dark.\nDiscard the CFSE-containing solution and wash the cells 1x with an equal volume of culture media.\n\tNOTE: 4T1 cells are now fluorescently labeled.\nReturn the 4T1-CFSE cells to standard culture conditions at RT with 5% CO2.\n5. Seeding RAW 264.7 mouse macrophages and coculture with 4T1\nAs confluency of RAW 264.7 reach 70−80%, discard the culture media and gently rinse 2x with at least 2 mL of PBS.\nPrepare the macrophages for collection by gently dislodging the adherent cells using a cell scraper and transfer them into a 15 mL conical tube.\nCount the cells using a hemocytometer and prepare a cell suspension of 1 x 105 cells/mL by diluting the remaining solution with a complete DMEM medium according to the seeding density.\n\tNOTE: Overly confluent cells in cocultures may severely reduce phagocytosis. In this study, the seeding ratio of macrophages: cancer cells was adjusted to a 1:1 ratio. The ratio can be adjusted depending on the aggressiveness of the tumor cells and the origin of the macrophages.\nBefore coculturing, discard the culture supernatant from the 4T1 cells seeded a day before (step 4.5) and carefully wash the monolayers 2x with at least 1 mL of PBS.",
    "Seed 1 x 105 RAW 264.7 cells per 2 mL of complete DMEM medium into one of the 4T1 imaging dishes. Incubate the cells 2−3 h at 37 °C with 5% CO2 to allow cell adherence. Label the imaging dish 4T1-M1 coculture.\n\tNOTE: The 4T1 (control) cells were not cocultured with macrophages.\n6. M1 polarization of RAW 264.7 macrophages\nPrepare M1 polarization media by adding 100 ng/mL LPS and 20 ng/mL IFN-γ into complete DMEM medium supplemented with 10% (v/v) FBS10,11.\nDiscard the culture supernatant from the macrophages incubated before (step 5.5) and carefully wash the monolayers in the dish 2x with at least 1 mL of PBS.\nThen, add 2 mL of M1 polarization media into the imaging dish and allow the RAW 264.7 cells to induce into the M1 macrophage phenotype by incubating at 37 °C with 5% CO2.\n\tNOTE: M1 macrophage cells may take up 2−3 h of incubation to achieve complete polarization. Preliminary experiments need to be done to ensure the suitable incubation period to allow complete polarization of macrophages.\n7. Live-cell video microscopy of phagocytosis\nNOTE: Many factors need to be considered when performing live-cell imaging to obtain a producible video, including optimization of image exposure, time measurement, and automatic focus correction.\nBefore the experiment, set up the cell culture incubator by turning on thermostat at 37 °C and supplying 5% CO2.\n\tNOTE: The microscope setup requires an inverted stage, a stage top incubator, humidity control (95%), and gas incubation system. This setup is crucial to maintain the cells for long-term live-cell video microscopy assessment.\nTurn on the microscope including the piezo stage and load the microscope imaging software.",
    "Position the seeded coculture cells in a 35 mm glass-bottom imaging dish in the center of the stage and gently screw on the top chamber. Use the joystick to motorize the stage by selecting the position to be imaged.\nTo view the sample, select the phase-contrast filter on the turret. After initially viewing the sample, locate the appropriate fields and bring the sample into focus.\n\tNOTE: Imaging software allows use of fully automated objective selection, Perfect Focus System, time-lapse series, multichannel image acquisition, and multipoint image acquisition.\nTo set up multichannel fluorescence for CFSE labeling and differential interference contrast acquisition, open the imaging software acquisition dialog box and select the [Lambda] tab checkbox (Figure 2).\n\tNOTE: For a 13 h time-lapse imaging, a phase-contrast channel should be used.\nSelect [Lambda] tab | [Optical Configuration] and select [10X DIC] for differential interference contrast and [GFP-R] for the green fluorescence filter checkbox. Under the [Lambda] | [Focus] column, select the [10X DIC] checkbox to set as the focus reference.\nOpen the imaging software acquisition dialog box and click the [XYZ Time …] button and select the [XY] tab.\nMove to the image acquisition point using the joystick on the motorized stage while checking the live image or select a different position through the eyepieces. Then click on the checkbox under the [Point Name] column to set each point in each location for image capture (see Figure 3).\n\tNOTE: The automated stage allows multipoint image acquisition of different XY coordinates to capture multiple fields.\nFine-tune the focus for each sample viewed on the screen. Use the controls on Auto-focus correction.\nUse the software to set up time-lapse image capture. In the imaging software acquisition dialog box, check the [Time] tab (see Figure 4).",
    "Determine the [Interval] (the delay between the beginning of one time point to another time point) and [Duration] (the total length of time of the experiment). Units of time vary and can be selected in milliseconds (ms), seconds (s), minutes (m), or hours (h) from the dropdown menu.\n\tNOTE: The imaging period length for time-lapse imaging of fluorescence and DIC time-lapse multichannel acquisition may vary depending on the fluorescent dye used in this assay. Photobleaching may occur if the labeled cells are exposed for too long.\nCheck the [Save to File] checkbox to save acquired images. Under the [Time schedule] tab click the [Run now] button to acquire multipoint time-series images (see Figure 5).\n\tNOTE: In the imaging software, images are saved in nd2 file format. Each time-lapse can be individually saved in an MP4 file format later.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}