{
  "id": 18316,
  "origin_website": "Jove",
  "title": "Video Movement Analysis Using Smartphones (ViMAS): A Pilot Study",
  "procedures": [
    "This protocol was approved by the Institutional Review Board of Wayne State University.\n1. Experimental Preparation\nPosition cameras to capture the entire 6-m walkway. Use a total of 4 3D motion captures cameras to capture walking over a 6-m walkway.\n\t\nPlace each of the cameras at the 4 corners of the 6 m walkway. Orient each of the cameras at the diagonal ends of the walkway to face each other.\nCollect height, weight and leg length measures of each participant.\n\t\nMeasure mass in kilograms.\nMeasure leg length (in meters) from greater trochanter to medial malleoli of both legs with a measuring tape.\nMeasure the height (in meters), by having the participant stand barefoot next to a measuring tape attached to the wall. Place a ruler on top of the participant's head to read the measurement from the measuring tape attached to the wall.\nMount the smartphone on a tripod with a tripod adapter for a smart phone holder clip. Place the tripod at 2-m or 4-m, perpendicular to the center of the walkway. Randomize the order of this placement if performing a validation study.\nPlace clusters of 3 smart markers on the participant on bilateral anterior superior iliac crests (ASIS), upper 1/3 of thigh, upper 1/3 of calf and dorsum of foot. Place a single smart marker in midline between the right and left posterior superior iliac crests.\n\t\nSecure the smart markers with Velcro straps/double sided sticky tape. Secure thigh and calf markers in the frontal plane.\nPlace stickers indicating bony landmarks over bilateral medial and lateral femoral condyles, medial and lateral malleoli and the webspace between first and second toes for calibration of the 3D motion capture system.\n\tNOTE: The calibration procedure is specific to each laboratory, and 3D motion capture equipment and software.",
    "For the calibration procedure, refer to the instructional manual provided by the manufacturer of the 3D motion capture equipment and/or software that is used to analyze the data. The process used here involves using an instrumented \"Wand\" with smart markers, to register the 3D location of the stickers that were placed.\n2. Experiment\nAdjust the smart phone camera lens height to capture either the participant's lower body only (ASIS as superior border) or upper and lower body (acromion as superior border). Measure the height from the floor to the camera lens in meters.\nGive participants a practice trial. Have one investigator operate the smart phone, and the other operate the computer that controls the 3D motion capture system. Use numbered paper to indicate trial number on the smart phone recording.\nOpen the smart phone application. Press the red \"record\" button on the bottom, center of the screen to begin recording (when in vertical orientation).\n\tNOTE: If the smartphone has already been placed on the tripod, the button appears at the middle, right side of the phone, near the home button of the smartphone.\nInstruct the participant to walk at their normal pace, focused on a marker placed on opposite wall to assist them in walking a straight line. Place the smartphone parallel to the walkway to capture a side profile of the participant. Have the participant cross the first two 3D motion capture cameras placed at the beginning of the walkway on either side, and walk towards another two 3D motion capture cameras placed at the other end of the walkway on either side.\n\t\nFor each trial, give each participant a countdown to start (3, 2, 1, GO) and end the trial (3, 2, 1, STOP).",
    "After the subject finishes walking 6-m distance, select the red \"record\" button once more to finish recording this walking trial.\nCheck all markers for position after each trial. If a marker position was altered, return to step 1.6 to recalibrate the 3D motion capture system to the new marker placements.\nHave participants perform 3 trials at each camera distance in step 2.1.\nMove the tripod with the smart phone to the second distance. Return the participant to stand on the mid-point of the walk way. Follow instructions in protocol steps 2.2 - 2.5.\nSave and verify the 3D motion capture recordings and smartphone recordings before removal of smart markers.\n3. Data Analysis\nFollow software/manufacturer's instructions to compute the knee angle. Manually record the knee angle that is displayed on the screen at heel strike and toe off phase of the gait cycle.\nComplete the analysis of smart phone recordings for heel strike and toe off events captured by a team of two investigators, who have to agree on the moment of heel strike and toe off events and angle measurement land marks. Use a stylus for increased accuracy of landmark placement for knee angle measurements. The steps below are done jointly by the two investigators.\nTo view the trial that was just recorded, select the video square in the bottom left corner of the screen (in vertical orientation).\nUsing the scroll bar at the base of the screen, select the frame in which the subject is closest to heel strike or toe off (whichever is the preferred variable) in the center of the screen.\nTo drop in the angle, tap on the white, outlined pencil icon on the upper right side of the screen.\nSelect the angle option, the second option in the drop down menu.",
    "Choose a preferred color and the angle maker. Please note that only one angle can be measured at one time. The angle measured in this protocol purely consisted of the knee angle in the sagittal plane.\nSlide or tap the stylus anywhere on the screen to drop in the angle.\nPlace the center of the angle on the knee joint (lateral condyle), with the vectors reaching upwards along the femur and downwards towards the lateral malleoli.\nIf needed, \"zoom in\" by placing two fingers close together in the center of the screen and slowly drawing them apart from one another.\n\tNOTE: Once satisfied with the placement of the angle, the tool automatically calculates the knee angle at that given frame.\nTo identify the knee angle at other phases of toe off or heel strike, repeat steps 3.4 - 3.10.\n4. Clinical Protocol\nMeasure and mark off a 6-m walkway using a measuring tape and marker/sticky tape.\nPlace the smartphone on a tripod parallel and close to the center of the 6-meter walkway.\nPlace the tripod 2 m away from the center of the walkway to capture the lower extremity, or 4 m away to capture the trunk and lower extremity. All camera positions allow only capture of sagittal plane kinematics.\nCalculate the height of the smartphone camera lens height from the floor using the following formulae:\n\tNear camera configuration (2 m) for only lower extremity capture\nCamera lens height = (0.87xPatient's reference leg length in meters)- 0.12 \n\tFar camera configuration (4 meters) for both lower extremity and trunk capture\nCamera lens height = Patient's reference leg length in meters - 0.23\nRepeat sections 2 - 3 to record and analyze data using the smart phone app.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}