{
  "id": 8574,
  "origin_website": "Jove",
  "title": "Portable Thermographic Screening for Detection of Acute Wallenberg's Syndrome",
  "procedures": [
    "All methods described here were approved by the Human Research Ethics Committee Institutional Review Board of Kanto Central Hospital.\nNOTE: We used a commercially available portable thermal camera and dedicated software (see the Table of Materials), and have constructed our protocols based on the use of these specific instruments.\n1. Preparation for Measurements\nCharge the thermal camera before use.\nTurn on the camera.\nPush the center button on the camera to display the menu. Select Color from the menu and select Iron or Rainbow color.\nPush the center button on the camera to display the menu. Select Measurement and then Center spot measurement to measure the BST in real time.\n2. Patient Selection\nTest all patients with suspected WS. Patients with dizziness, vertigo, ptosis, hoarseness, dysphagia, anisocoria, or dissociated sensory disturbance may have WS.\nSubjectively determine the laterality of BST by palpating the patient with suspected WS.\n3. Acquisition of Thermographic Images\nInstruct the patient to take off their socks and shoes. Have the patient remove clothing (if consent is granted) to enable examination of the abdominal region.\nAcquire images in an examination room or in the patient's bedroom, as soon as WS is suspected. Ask the patient to assume a supine posture or sitting position during image acquisition. Ask the photographer to stand 50-100 cm from the patient.\nNOTE: Lighting conditions in the room do not influence the results of the thermographic measurements.\nAcquire one image at each of four areas for each patient: 1) frontal face, 2) bilateral palm, 3) abdomen, and 4) bilateral dorsum of the foot (Figure 1). These four areas are uncomplicated locations for image acquisition, even in bedridden patients who cannot move because of dizziness, vertigo, nausea and vomiting.",
    "NOTE: Blankets or drafts caused by air conditioning may influence the BST. If such influence is suspected, cover all extremities and the trunk with blankets, then acquire additional images after an interval of >10 min. Drip infusion therapy at the extremities also may influence the BST. If possible, slow down or stop the infusion, then acquire images after an interval of >10 min.\n4. Assessing the Laterality of BST\nConsider BST to exhibit laterality when the BST between the right and left sides is markedly different macroscopically and the degree of laterality is >0.5 °C18. If the laterality of BST is not obvious or appears to be ≤0.5 °C, perform advanced analysis with dedicated software as described below.\nNOTE: When laterality of BST is observed in multiple locations on the same side of the patient, there is a strong possibility that the patient has WS in the ipsilateral side of the medulla on the warmer side, as determined by BST.\n5. Advanced Assessment of the Laterality of BST\nInitialize the thermal imaging and analysis software.\nSelect and open the acquired image to be analyzed.\nSelect the Ellipse measurement button on the left side tab, and indicate ellipses with diameters of >5 mm at four locations: 1) the nasolabial fold on the face; 2) the palm of the hand; 3) thoracic spine levels 8-10, approximately 5 cm from the umbilicus of the torso; and 4) the center of the dorsum of the foot.\nCheck the average BST from each location and compare it to the BST on the contralateral side of the body.\n6. Confirming WS",
    "Perform a careful neurological examination if the patient exhibits laterality of BST to confirm a diagnosis of WS. In addition to screening by neurological examination, check for the presence of Horner's syndrome including ptosis and constricted pupil, as well as the presence of dissociated sensory disturbance, to determine whether the patient exhibits acute WS.\nConsider hospital admission when WS cannot be ruled out based on the results of thermographic measurement and neurological examination.\nConsider repeated thin-slice brainstem MRI after an interval of a few days to diagnose WS.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}