{
  "id": 7281,
  "origin_website": "Bio",
  "title": "Ethanol-induced Sedative Behavior: An Assay to Investigate Increased Dopamine Signaling in <em>Caenorhabditis elegans</em>",
  "procedures": [
    "Prepare 60-mm NGM plates for the maintenance of C. elegans. Seed the plates with E. coli OP50 (serves as food for C. elegans) under sterile conditions in a bacterial hood and allow to grow overnight at 37°C.Synchronize the C. elegans strains to be analyzed by bleaching. Collect the animals from the NGM plates using 1 ml M9 solution in 2-ml microcentrifuge tubes (MCT). Add 400 µl freshly prepared bleach solution (1:1 ratio of 5 N sodium hydroxide and sodium hypochlorite) to the tubes and vortex at medium speed for 5 min. Spin the MCT at 6,097 × g (4000 rpm) for 60 s and discard the supernatant. Wash the pellet again with fresh M9 and plate on 60-mm NGM plates.To perform the assay, prepare fresh 60-mm (NGM) plates containing 8 ml media one day before the assay and store at 4°C until use.On the day of the assay, dry the plates in the laminar airflow for 3-4 h with the lids open.Spread 400 mM (196 µl) 100% EtOH on the dry 60-mm plates with 8 ml media using a glass spreader. Dry plates without EtOH (– EtOH) are used as control plates.Seal the EtOH assay plates with parafilm to avoid any loss of ethanol and place at 20°C for 2 h to allow the EtOH to equilibrate across the plates.The EtOH assay plates are now ready and can be used for the assay.Transfer 10 animals of the genotype being studied from a seeded plate (+ food) to an unseeded plate (– food) for 15-20 s (to get rid of the food). Next, transfer the animals to the assay plate or control plate and leave undisturbed for 2 h at 20°C.Observe the C. elegans after a 2-h time interval.",
    "Count the number of animals on the plates and make 1-min videos for each animal to observe and analyze the locomotory behavior by counting the number (anterior and posterior) and amplitude of body bends to characterize the behavior.The number of body bends are scored manually using ImageJ while maintaining identical parameters when analyzing anterior and posterior body bends (Figure 1A).Calculate the amplitude of the body bends manually using the NIH ImageJ software, quantitating the anterior and posterior body bends separately. To quantitate the amplitude of the body bends, measure the distance between the deepest angle of the body bend. Draw a tangential line from the tip of the head to the midsection of the body and measure the vertical distance from the line to the body as the amplitude of the anterior body bend (Figure 1B). Correspondingly, from the midsection to the tail of the animal, measurements are obtained for the posterior body bend amplitude (Figure 1B). Normalize the measurements to the length of the animal to derive the measured values in micrometers.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4083/bioprotoc-11-13-4083-g001.jpgFigure 1. Representative image used for the analysis of the amplitude of body bends. A. Image represents the evaluation of anterior and posterior body bends separately. B. Image indicates the amplitude of body bends; a double-sided arrow depicts the amplitude (Amp) in the anterior and posterior regions.Perform timeline-based analysis of behavior. Starting from EtOH exposure, different time points (30, 60, 120, 300 min), including overnight exposure (16 h), are analyzed (Figure 2A).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4083/bioprotoc-11-13-4083-g002.jpgFigure 2. Illustration of the timeline for EtOH treatment of C. elegans to study EIS behavior. A. The timepoints denote different phases of WT animals upon EtOH exposure, as indicated in the timeline. Experiments to test the number and amplitude of body bends are performed at ~2 h. B.",
    "Illustration of EIS behavior, where WT animals recover from EtOH-induced paralysis and show normal sinusoidal movement, while dop-2 mutant animals show EtOH-induced sedative behavior (Pandey et al., 2021).WT animals show normal behavior 2 h after EtOH paralysis (Video 1). While dopaminergic autoreceptor, dop-2, mutant animals show EtOH-induced sedative (EIS) behavior at the same time point (Figure 2B and Video 2).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. A representative video of WT animals showing a single C. elegansthat has recovered from EtOH-induced paralysis. The animal can be seen moving in normal sinusoidal wave-like patterns, with no observable defects in locomotion (Pandey et al., 2021).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. A representative video of the EIS behavior shown by dop-2 mutant C. elegans upon EtOH exposure at the 2-h time point. The animal shows defects in locomotion and moves by dragging its posterior region (Pandey et al., 2021).Recovery from the EIS behavior can be observed upon transferring the mutant animals to normal NGM plates with food after a 2-h exposure to EtOH. Mutants of dop-2 recover from the EIS phenotype 1 h after being transferred."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}