{
  "id": 8942,
  "origin_website": "Jove",
  "title": "Electrophysiological Recording from Drosophila Trichoid Sensilla in Response to Odorants of Low Volatility",
  "procedures": [
    "1. Preparation of the Hardware for at4 Recording\nUse a pipette puller instrument to prepare electrodes with aluminosilicate glass capillaries (O.D 1.0 mm, I.D. 0.64 mm). Blunt the tip of the reference electrode slightly with a pair of fine forceps to facilitate insertion into the clypeus of the fly (i.e. a rounded plate at the front of the fly head, above the mouthparts).\n\tNOTE: 7-day-old WT males (Berlin) were used in this study. Use AHL saline solution14 as the electrolyte for both electrodes.\nPrepare 1 L of AHL by mixing 900 mL of distilled water with 6.312 g of NaCl, 0.373 g of KCl, 0.337 g of NaHCO3, 0.1120 g of NaH2PO4, 1.892 g of Trehalose ּ2H2O, 3.423 g of sucrose, 1.192 g of HEPES, and 8.2 mL of 1M MgCl2. Using distilled water, bring the total volume up to 1 L. Bring the pH to 7.4 using 1 N NaOH and sterilize the solution with a vacuum-driven filter system. For long-term storage, keep the AHL aliquots at 4 °C.\n\tNOTE: Consistent deliveries of palmitoleic acid are contingent upon uniformity between cartridges. It is critical that each cartridge is assembled in a reproducible manner.\nUsing a razor blade, remove 0.9 cm from the tip of a 200 µL pipette tip to create the first cartridge section, measuring 4.1 cm; refer to the dimensions detailed in Figure 1A. Use another 200 µL pipette tip and remove 1.7 cm and 1.5 cm from the tip and the base, respectively, to create the second cartridge section, measuring 1.8 cm (Figure 1A). Use a ruler to ensure reproducibility.\nUse a ⅛\" hole puncher to cut discs from filter paper.",
    "Use forceps to place a filter paper disc at the tip of the second cartridge section. Visually confirm that there is an opening in the cartridge tip through which air can pass.\nAttach the first and second cartridge sections together, as shown in Figure 1A. Angle the second cartridge section downward to facilitate square aiming at the prep (Figure 1B).\nConnect the cartridge with the odor-delivery tube, which is mounted on a micromanipulator.\n\tNOTE: This design allows the cartridge to be swiveled outward to facilitate exchange (Figure 1C).\nSet the constant humidified airflow to 2 L/min in one mass controller and the odorant flow to 500 mL/min in another mass controller.\nUsing the software (see the Table of Materials), program the procedure to administer a 500 ms odor puff.\n2. Preparation of Palmitoleic Acid Odorant Solutions for Delivery\nNOTE: Or47b ORNs respond to both cis- and trans-palmitoleic acid. As palmitoleic acid is unstable at RT, stocks are stored at -20 °C and used within a month upon opening. Ethanol is the solvent of choice for palmitoleic acid.\nUse a vortex mixer to thoroughly mix 10 µL of cis- or trans-palmitoleic acid stocks or dilutions with 90 µL of 100% ethanol for ten-fold serial dilutions in 1.7 mL microtubes. Prepare fresh palmitoleic acid dilutions daily prior to experiments and use within a day.\n\tNOTE: For odorants that are not soluble in ethanol, a glass vial is recommended for preparing odor dilutions with other types of organic solvents.\nUsing a P10 micropipette, apply 5 µL of cis-palmitoleic acid solutions of the desired dilutions to the filter paper in each corresponding cartridge.",
    "NOTE: The highest dosage (10-1) contains 450 µg of the compound. For trans-palmitoleic acid solutions, apply 4.5 µL instead so that the highest dosage (10-1) also contains 450 µg of the compound.\nTo completely evaporate the solvent, place the palmitoleic acid cartridges in a vacuum desiccator for 1 h at RT and 7.59 mmHg of pressure.\n\tNOTE: The cartridges can be used for up to 4 h at RT.\n3. Preparation of Drosophila for Ready Access to the at4 Sensilla for In Vivo  Electrophysiological Recordings\nNOTE: WT flies (Berlin) are reared in standard cornmeal medium at 25°C in a 12:12 light-dark cycle. Upon eclosion, flies are separated by sex into groups of ten, whereby they are group-housed until 7 d of age. Or47b ORNs in both male and female flies respond to palmitoleic acid. For simplicity, only male flies are examined in the current study.\nAssemble a fly-prep slide: on a glass slide, place a glass coverslip (18 x 18 mm2) on a small amount of modeling clay, forming an ~3° angle with the glass slide. Place double-sided tape on the inner edge of the coverslip and on the area of the slide immediately below. Replace with fresh tape for every day of recording (Figure 2A).\nUse a fly aspirator15 to collect the fly of interest in the tubing and then fit a 200-µL pipette tip over the end of the tubing. Simultaneously flick the tube forward while blowing air into the tube to push the fly to the end of the pipette tip. Use a razor blade to cut just below the body of the fly and 2 heads' lengths above the fly.",
    "Tamp the bottom of the pipette tip with modeling clay, pushing the fly upward until both the antennae and the clypeus are exposed (Figure 2B). To avoid killing the fly, add only enough clay to expose the antennae and aristae, as this prevents the fly's abdomen from being crushed. Furthermore, add clay slowly and gently to prevent any sudden constriction. Confirm that the fly is alive by checking for antennal or proboscis movement.\nUse forceps to maneuver the pipette tip that houses the fly. Orient the head so that the clypeus is facing to the right of the observer. Adjust the prep along the coverslip using fine forceps until the lateral side of the antenna lies against the taped coverslip surface (Figure 2B).\nPlace a holding rod on the arista to secure the antenna to the double-sided tape to prevent movement (Figure 2B).\n\tNOTE: The holding rod is pulled from a borosilicate glass capillary with a pipette puller and held in position with modeling clay (Figure 2A).\nPlace the prep on the stage of the rig (Figure 2C). Using the microscope, confirm that the trichoids are visible along the distal-lateral edge of the third segment of the antenna.\n\tNOTE: Ideally, the sensilla should be clearly silhouetted against the background, which simplifies their identification and facilitates recording (Figure 3). In this preparation, the majority of the accessible trichoid sensilla are of the at4 type.\nKeep the prep under constant humidified airflow (2 L/min) delivered via a separate air delivery tube from a distance of about 2 cm from the prep (Figure 4), as described previously2,15.\n4. Recording of at4 Sensillum Activity from Or47b ORNs in the at4 Trichoids in Response to Palmitoleic Acid",
    "Insert the reference electrode into the clypeus (Figure 3A). To avoid tissue damage, ensure that the electrode is inserted just below the surface, where it can contact the hemolymph under the cuticle, with a swift and smooth motion.\nLower the recording electrode slowlyuntil it enters the same plane of view as the target sensillum (Figure 3B). Record under a 50X objective lens.\n\tNOTE: The tough trichoidal cuticle necessitates inserting the recording electrode into the sensillar base, whose wider area provides a larger target that reduces the likelihood that the electrode is deflected away (Figure 3B, inset).\nBefore applying odor stimuli to a sensillum, observe the following selection criteria; any trichoid failing to meet these standards should be rejected and another sensillum chosen instead.\nObserve a high signal-to-noise ratio (see Figure 3C for an example).\nObserve identifiable spikes from at4A and at4C neurons (Figure 3C).\n\t\tNOTE: Of note, the at4B spike amplitude appears very similar to at4A10 and cannot be identified easily without odor stimulation.\nObserve that the basal firing rate of the at4A neurons is around or under 20 Hz.\n\t\tNOTE: This criterion is specific for at4A because the basal firing rate for the neuron is higher than that of the basiconic ORNs2. A much higher basal firing indicates that the neurons may have been damaged during electrode insertion.\nConnect the cartridge to the odorant-delivery tube. Start with the solvent control and then the odorants, from low to high concentrations. Use the micromanipulator to maneuver the cartridge towards the prep while aiming the cartridge squarely at the head of the prep. Visually confirm that the cartridge is pointed directly at the antenna (Figure 4) from a few millimeters away.",
    "NOTE: The goal is to orient the opening of the cartridge directly at the antenna and position it in close proximity to the target tissue.\nEnsure that the odorant cartridge is separated from the recording electrode on its right by 1 - 2 mm and from the fly prep slide below by approximately 1 mm.\n\tNOTE: In the setup described here, the odorant cartridge is closely bordered by the recording electrode, the reference electrode, and the fly-prep slide (Figure 4).\n\tNOTE: Pay attention to the distance between the cartridge and the recording/reference electrodes. A distance of around 4 mm is recommended1. Unintentional contact may terminate the signal and break the tip of the recording electrode, damaging the current neuron and complicating further recordings.\n\tNOTE: Consider the distance separating the cartridge and the fly-prep slide. Touching the coverslip may also dislodge the recording electrode to disrupt the recording.\nPress \"Record\" in the data acquisition software to begin the recording.\n\tNOTE: For each 10 s recording, a single 500 ms odor pulse is delivered directly to the antenna, as described in step 1.9.\nAfter odorant application, carefully retract the cartridge before replacing it with a cartridge of the next-highest concentration. Continue until the entire dosage range is obtained.\n\tNOTE: It is recommended that only one Or47b ORN is recorded from each fly to avoid any possible effects of adaptation.\nThoroughly rinse the recording electrode with distilled water after finishing recording for the day.\nAnalyze and plot the data using commercially available offline analysis software.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}