{
  "id": 13541,
  "origin_website": "Jove",
  "title": "Histological Analyses of Acute Alcoholic Liver Injury in Zebrafish",
  "procedures": [
    "AB WT adult and larval zebrafish were maintained under standard conditions21 in accordance with the Guide for the Care and Use of Laboratory Animals (National Institutes of Health publication 86-23, revised 1985); their use was approved by the Institutional Animal Care and Use Committee at Cincinnati Children's Hospital Medical Center (CCHMC).\n1. Preparation of Solutions\nPrepare egg water.\nPrepare the stock salt solution by dissolving 40 g of commercial sea salt in 1 L of double-distilled water (ddH2O). Stir until all salts have completely dissolved.\nPrepare 0.1% methylene blue solution by adding 0.1 g of powder to 100 mL of ddH2O.\n\t\tCAUTION: Methylene blue is an irritant if it comes in contact with the eyes or skin. Always wear a lab coat and gloves when handling the powder.\nCombine 28.125 mL of stock salt solution and 7 mL of methylene blue solution in a 50 mL conical tube. Mix well. Add this mixture to 15 L of ddH2O. Shake thoroughly and store at RT.\nPrepare 100 mL of 1 M Tris-HCl by adding 12.1 g of Tris powder to 100 mL of ddH2O. Adjust the pH to 9.0 using hydrochloric acid (HCl).\n\tCAUTION: HCl can cause severe burns and mucous membrane irritation if inhaled. Always wear a lab coat and gloves and handle the stock bottle in a chemical hood.\nPrepare 0.4% tricaine (ethyl 3-aminobenzoate methanesulfonate) solution.\nDissolve 2 g of tricaine powder in 489.5 mL of ddH2O. Add 10.5 mL of the Tris-HCl, pH 9 solution. Mix with a stir bar until all of the powder has dissolved. Adjust to pH 7.0.\n\t\tCAUTION: Tricaine powder can be a respiratory irritant. Always wear a dust mask when handling the powder.",
    "Aliquot 45 mL of the tricaine solution into 50 mL conical tubes. Keep the solution at 4 °C for immediate use and at -20 °C for long-term storage.\nPrepare Dietrich's fixative by combining 30 mL of 95% ethanol, 10 mL of 37% formaldehyde, 2 mL of glacial acetic acid, and 58 mL of ddH2O in a glass media bottle. Mix well by swirling and store at RT.\n\tCAUTION: Formaldehyde is a suspected carcinogen, and any solution with formaldehyde should be used in a chemical hood. Glacial acetic acid can cause severe skin burns and eye damage. Always wear a lab coat and gloves and handle the stock solution in a chemical hood. Formaldehyde, glacial acetic acid, and 95% ethanol are all flammable liquids and should be stored in a designated flammable cabinet.\n\tNOTE: Dietrich's fixative is stable at RT for 1 year.\nPrepare 1 L of 10x Phosphate-buffered Saline (PBS) solution by adding 80 g of sodium chloride (NaCl), 2 g of potassium chloride (KCl), 14.4 g of disodium phosphate (Na2HPO4), and 2.4 g of monopotassium phosphate (KH2PO4) to 800 mL of ddH2O. Adjust to pH 7.4 using sodium hydroxide (NaOH) and add ddH2O to a 1 L final volume. Store this solution at RT after autoclaving on a liquid cycle that purges for 1 min and incubates at 121 °C for 20 min.\nMake 1 L of 1x PBS by diluting 100 mL of the 10x PBS solution in 900 mL of ddH2O. Mix well by shaking and store at RT after autoclaving.\nPrepare 3% agarose in a glass media bottle for embryo mounting.\n\t\nAdd 3 g of agarose to 100 mL of ddH2O and mix by swirling. Heat the mixture by microwaving to dissolve the agarose, and watch carefully during heating to ensure that there is minimal boiling.",
    "CAUTION: The bottle will likely be hot when removed from the microwave, despite short heating. Use a protective glove or mitt to remove the bottle from the microwave.\nRemove the bottle from the microwave. While swirling gently, look for any crystals that are not completely dissolved; if there are no crystals, the solution is ready for use. Store the 3% agarose at RT and heat again before use.\nFilter Harris hematoxylin stock solution to remove any solids that have precipitated.\nFold a coffee filter in half so that the filter creates a cone. Open the side panel so that the liquid runs through the filter, allowing any debris to be caught.\nPlace the filter inside a funnel and the funnel into a glass media bottle. Gradually pour the stock hematoxylin through the filter.\n\t\tCAUTION: Hematoxylin is hazardous in case of eye contact, ingestion, and inhalation. Always wear a lab coat and gloves and handle the stock solution in a chemical hood.\nPrepare 0.05% HCl by adding 125 µL of 12 N HCl to 250 mL of ddH2O.\nPrepare eosin Y-phloxine B solution mixture by combining 25 mL of 1% eosin Y (aq), 2.5 mL of 1% phloxine B (aq), 195 mL of 95% ethanol, and 1 mL of glacial acetic acid in a glass bottle. Mix well by swirling and store at RT\n\tCAUTION: Eosin Y is hazardous in the case of eye contact, ingestion, and inhalation. Always wear a lab coat and gloves and handle the stock solution in a chemical hood.\nPrepare 2% ethanol by adding 2 mL of pure ethyl alcohol to 98 mL of egg water.\n\tCAUTION: Ethyl alcohol is an eye irritant. Always wear proper protective equipment when handling ethyl alcohol. It is also flammable and should be handled and stored accordingly.",
    "NOTE: Prepare fresh 2% ethanol each time before conducting the acute ethanol treatment.\n2. Perform Acute Ethanol Treatment in Zebrafish Larvae\nTo generate embryos, set up crosses with one wildtype male and one WT female fish per mating tank. Separate them by inserting a plastic divider in the mating tank.\n\tNOTE: Set up crosses after the final feeding of the day so that the fish are well fed.\n\t\nAt 8 AM the next morning, pull the divider to allow the pair to mate.\nAfter 1 h, return the adult fish to their original tank. Collect the embryos by pouring the water containing the embryos into a strainer. Turn the strainer over in a 100 mm Petri dish and wash the embryos into the dish using a wash bottle containing egg water. Place the dish with the embryos in an incubator at 28 °C.\nWhen embryos reach at least the 4-cell stage (1 hpf), remove any unfertilized embryos and debris in the water with a Pasteur pipette and place the dish with the fertilized embryos in an incubator at 28 °C. Maintain the embryos in the incubator at 28 °C until 96 h post-fertilization.\nAnesthetize the larval fish by adding the tricaine solution to egg water at a 1-10 (volume/volume) ratio.\nSelect up to forty 96 hpf larvae that have an inflated swim bladder using a Pasteur pipette and split them evenly into two new petri dishes.\nTake out as much residual egg water as possible. At a density of one larva per mL, add egg water containing 2% ethanol to one dish. Add the same amount of egg water to the other dish to serve as the control.\nKeep the control and ethanol-treated larvae in the fish room for 24 h.",
    "NOTE: Conducting ethanol treatment in a fish room that has a 14 h light/10 h dark cycle results in more consistent and robust liver injury than conducting the experiment in the dark in an incubator.\nCollect the larvae in a 1.5 mL centrifuge tube with no more than 20 larvae per tube.\nRemove as much liquid as possible from the larvae and add at least 1 mL (10x tissue volume) of Dietrich's fixative in the chemical hood. Allow the fish to fix on a nutator at room temperature for at least 24 h.\n\t\tNOTE: Fish are stable in Dietrich's fixative for several weeks.\n3. Preparation of Tissue Cassettes and Processing\nSet out the necessary number of tissue cassettes and two blue biopsy pads per cassette. Place one biopsy pad at the bottom of each cassette. Label each cassette in pencil, clearly identifying the sample.\n\tNOTE: Do not use pen or marker to label the cassettes, because the labeling will be lost in later steps.\nEmbed the larvae in 3% agarose to ensure the consistent orientation of all samples.\n\t\nRemove the fixative from the tubes in a chemical hood and wash the larvae 3 times for 5 min each with 1 mL of 1x PBS. Place the tubes on a nutator at RT during the washes.\nDuring the washes, heat the prepared 3% agarose in water using a microwave to melt the solid. Heat for 30 s at a time and watch carefully to minimize boiling. Keep the liquid agarose on a hot plate set to 90 °C with gentle stirring.\nUsing a transfer pipette, transfer up to 8 larvae to a plastic histology mold and remove as much PBS as possible. Using a transfer pipette with the tip cut off, completely fill the mold with 3% agarose.",
    "Using an insulin syringe, gather the larvae to the center of the mold and push them to the bottom. For sagittal sections, position the larvae in a line, with the heads towards the top of the mold. To ensure that the livers are oriented in a consistent manner, turn the larvae so that the left side of the body is facing down and flat against the bottom of the mold.\n\t\tNOTE: Because the liver is located on the left side of the body, such positioning minimizes the number of sections that need to be cut before reaching the liver. Keep the larvae as close to each other as possible.\nSet the mold to the side for 4-5 min to allow the agarose to set completely. Remove the agarose block from the mold and use a razor blade to trim the agarose around the larvae. Stand the block on end and cut the thickness in half so that the final block is roughly 2-3 mm thick.\nTransfer the small agarose block to the prepared tissue cassette (step 3.1) and place the second biopsy pad on top of the block. Close the cassette and place the fully assembled cassette into a sealable container with freshly prepared 70% ethanol in ddH2O.\n\t\tNOTE: If the cassettes are not going to be processed immediately, place them in 70% ethanol in a container at 4 °C to avoid a loss of fixation. Cassettes are stable at 4 °C for up to 3 days.\nTissue processing\n\tNOTE: Samples can be submitted to a histology or pathology laboratory equipped with a tissue processor for processing the cassettes in paraffin. Request a standard O/N processing program rather than a short program so that the paraffin can fully penetrate the agarose.",
    "Process the tissue cassettes by transferring them through a dilution series of ethanol, with an increasing amount of alcohol, to dehydrate the tissue, as follows: 70% ethanol 2 times, 45 min each; 80% ethanol, 45 min; 95% ethanol, 2 times, 45 min each; 100% ethanol, 2 times, 45 min each.\nReplace the alcohol with a solvent (100% xylene, 2 times, 45 min each) in order for the paraffin to infiltrate the tissue.\n\t\tCAUTION: Xylene is an irritant and is harmful if inhaled. Be sure to always use a chemical hood. Xylene is flammable and must be stored accordingly.\nIncubate the cassettes in paraffin O/N in an incubator at 60-65 °C. Keep the cassettes warm until embedding.\nEmbed the processed agarose blocks into paraffin.\nTake out one cassette from the warming drawer of the embedding machine and remove the lid of the cassette and the top biopsy pad from the cassette. Fill a histology mold with liquid paraffin and keep it on the warm plate on the embedding machine.\nUsing warm forceps, pick up the agarose block from the cassette and transfer it to the histology mold with paraffin. Make sure that the side of the agarose block with the fish closest to the surface is facing down. Throw away the bottom biopsy pad and transfer the entire histology mold to the cool plate on the embedding machine.",
    "Using forceps, quickly position the agarose block at the center of the mold; place the block at the bottom of the mold. Once the block is properly placed, put the bottom of the cassette on top of the histology mold and fill it halfway with liquid paraffin. Place the mold directly on the 4 °C plate and do not disturb the blocks for at least 10-15 min to allow the paraffin to solidify. While the first block is setting up, repeat this process for the remaining blocks.\nOnce the paraffin is set for all of the blocks, remove the histology mold from the paraffin block by pressing gently on the mold to loosen it. These paraffin blocks can be stored at room temperature indefinitely.\n4. Sectioning of Paraffin Blocks\nThe day before sectioning, face-in the paraffin block using a microtome to remove excess paraffin covering the tissue. Section 5 µm at a time until the tissue is exposed at the surface of the paraffin block. Stop and discard all the sections that are cut. Soak the blocks face down in 1x PBS at 4 °C O/N.\n\tNOTE: The blocks should be soaked for at least 8 h. Start the soaking at the end of the day. If the blocks are left in 1x PBS for too long, the tissue can swell and become distorted.",
    "Remove one block at a time from the 1x PBS and cut 5-µm sections using a microtome. Separate the ribbon of sections from the blade by gently pulling the last section away from the blade using forceps or a brush. Pick up the ribbon by the last section using the forceps and transfer it to a water bath at 42 °C. Allow the ribbons to float on the surface of the water for at least 5 min.\n\tNOTE: When transferring sections, do not let the forceps touch the water while still in contact with the paraffin. Otherwise, the paraffin will melt onto the forceps and make separation very difficult. If necessary, tease apart the sections into smaller groups using clean forceps so that they can easily fit onto the slides. Gently touch the seam between sections to create separation without damage.\nPut a charged slide into the water at a 45-degree angle and carefully position it underneath the group of sections to be collected. Carefully lift the slide from the water and allow the sections to attach to the slide.\nBlot any excess water from the sections using lint-free tissue. Place the slide in a slide holder or box. Continue to section the block until the desired tissue has been collected. Repeat the sectioning process for all blocks.\nBake the slides in a 55 °C incubator or oven for 3-16 h to melt the paraffin. Remove the slides from the oven and allow them to cool before beginning the staining.\n\tNOTE: Paraffin sections can be stored at RT indefinitely, both before and after baking.\n5. Hematoxylin and Eosin Staining of Paraffin Sections\nDeparaffinize the slides by dipping them in 100% xylene for 15 min; change it to fresh 100% xylene for another 15 min.",
    "Rehydrate the slides by dipping them through the following series of graded ethanol until the liquid runs cleanly off the slides. For each solution, dip 8-10 times, 2 s per dip: 100% ethanol, 100% ethanol, 95% ethanol, 95% ethanol, 70% ethanol, 50% ethanol, 30% ethanol, and deionized water.\n\tNOTE: The protocol can be stopped here, and the slides can be left at RT in water for several hours. If necessary, the slides can be stored at 4 °C in water O/N.\nPlace the slides in 100% filtered Harris hematoxylin for 4 min. Immediately transfer them back to the container with deionized water. Run deionized water into the back corner of the container farthest away from the sections. Empty the container periodically until the water is no longer purple.\n\tNOTE: Do not let the water run directly onto the slides, as the sections may come off the slides.\nQuickly check the hematoxylin intensity on a dissecting microscope using gooseneck lights; do not allow the slides to dry. If the stain has reached the desired intensity, continue to the next step. If the color is not dark enough, place the slides in 100% hematoxylin for 1 min and repeat the water washes before checking again.\n\tNOTE: The hematoxylin needs to be dark enough so that the color is not lost during the eosin staining. However, if hematoxylin staining is seen in the cytoplasm, the sections are overstained.\nDip the slides twice in 0.05% HCl and immediately transfer them back to the container with clean deionized water. Empty the water and refill the container with water twice.\nTransfer the slides to 95% ethanol for 30 s and then transfer them to a new container with 95% ethanol for 30 s.",
    "Place the slides into the eosin Y-phloxine B solution for 2 min. Transfer the slides back to the previous 95% ethanol container and quickly check the intensity of the color under the dissecting microscope. If the staining is sufficient, proceed to the next step. If not, return to the eosin solution for 30 s, check again, and repeat as necessary.\n\tNOTE: Sufficient eosin staining is bright pink and appears in distinct contrast to the hematoxylin stain. Be sure to wipe any solution off the back of the slides when checking under the microscope so that no false color is observed. Because eosin is made up of 95% ethanol, prolonged periods of time in 95% ethanol while checking color intensity may leach out some of the color.\nTransfer the slides to 100% isopropanol for 15 s. Replace with fresh 100% isopropanol and place the slides back in the isopropanol for another 15 s. Repeat this process for a total of 6 isopropanol washes.\n\tCAUTION: Isopropanol is an eye and respiratory irritant. Always be sure to wear proper protective equipment and avoid splashing. It is also highly flammable and should be stored and handled accordingly.\n\tNOTE: To save on reagents, discard only the first (pinkest) isopropanol wash. Keep the other five wash solutions in bottles numbered 1 through 5, to be reused for the next staining. When reusing washes, start with the bottle numbered \"1\" and discard after use. Once wash \"2\" has been used, pour it into bottle \"1,\" and so on. The final wash should always be fresh isopropanol.\nPlace the slides in 100% xylenes for 3 min. Remove one slide at a time and place a coverslip.\nAdd sufficient mounting medium to cover the sections and dip them in 100% xylene.",
    "NOTE: This step will smooth the surface of the mounting medium and remove any bubbles.\nApply a coverslip to the bottom of the slide.\n\t\tNOTE: The mounting medium should pull the slide into position. If the coverslip is not straight or completely seated, gently tap it into place.\nBlot any excess mounting medium on a paper towel until only a thin line is seen. Dip a tissue wipe into the xylene and wipe the back of the slide to remove any medium that has dripped. Place the slide flat on a sturdy but mobile surface, like a piece of cardboard. Coverslip all the remaining slides in the same fashion. Allow the xylene to evaporate in the hood for 10 min.\n\t\tNOTE: Any materials contaminated with xylene should be removed and discarded in a sealed container in the hood to prevent any vapors from escaping.\nAllow the mounting medium to harden at RT O/N.\n6. Imaging and Storage of Stained Slides\nImage sections on a compound inverted microscope18.\n\tNOTE: Slides can be kept at room temperature indefinitely.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}