{
  "id": 17292,
  "origin_website": "Jove",
  "title": "Modified Posterior Vertebral Column Resection for Patients with Thoracolumbar Kyphotic Deformity",
  "procedures": [
    "The protocol follows the guidelines of the Ethics Committee of the Third Hospital of Hebei Medical University. Informed consent was obtained from the patients for including them and the data generated as a part of this study.\n1. Pre-operative preparation\nSelect patients according to the following inclusion and exclusion criteria. For the patients undergoing the surgeries, the inclusion criteria are as follows: 1) nerve compression due to thoracolumbar kyphosis, 2) severe low back pain due to kyphosis, 3) patients with Kummell disease, 4) kyphosis deformity left over by a cured infectious disease. The exclusion criteria are as follows: 1) bone destruction due to a spinal tumor, 2) infectious diseases of the spine in the active phase.\nAfter the administration of general anesthesia with endotracheal intubation, place the patient on the operating table in the prone position.\nUse a C-arm to localize the lesioned segment. Mark and label the location to indicate the lesion and the adjacent upper and lower vertebral bodies and make an incision trace. Then, disinfect the surgical area with iodine and alcohol and drape with sterile sheets.\n2. Lesion exposure\nMake a median dorsal incision centered on the diseased vertebra with a scalpel, covering two vertebral bodies above and below. To ensure the pedicle screw can be placed in, keep the length of the incision longer than the two vertebrae adjacent to the lesion on each side.\nUse a scalpel to cut the skin and subcutaneous tissue vertically along the mark. Use bipolar coagulation to stop the bleeding. Then, use an electrocoagulation electrotome to separate the latissimus dorsi and multifidus muscles along the muscle attachment points until the posterior spinous process and vertebral plate are revealed.",
    "Use osteoforceps to remove part of the facet joints of the two vertebrae above and below the lesion until the articular surface is exposed completely. Then, use the positioning needle to confirm the correct position of the pedicle screws under C-arm guidance.\nChoose the entry point 3 mm caudal to the junction of the transverse process in the thoracic vertebra10; the entry point of the lumbar vertebra is the intersection of the horizontal line of the transverse process' midpoint and the vertical line of the superior articular process.\nInsert eight pedicle screws bilaterally in the upper and lower segments using a reaming probe to expand the path. Depending on the disease, insert another pedicle screw on one side of the lesioned segment. If the patient suffers from osteoporosis, use bone cement-injectable cannulated pedicle screws to strengthen the vertebral bodies.\nPlace a temporary fixation rod opposite to the osteotomy side on the pedicle screw caps, and screw and fasten the nuts. Then, use a rongeur to excise the lesioned segment's spinous process.\nNext, use the laminectomy rongeur to remove the lamina adjacent to the spinous process and the inferior articular process on the osteotomy side. Following these procedures, use the rongeur to cut off the transverse process on the same side.\n\t​NOTE: The removal of the rib head is needed for better exposure of the thoracic vertebrae.\n3. Deformity correction\nUse a modified trephine (Figure 1) to perform the osteotomy in the surgery9,11.\n\t\nFirst, insert the pedicle probe into the lesioned vertebra. Then, use a modified trephine to remove the bone by twisting the handle into the vertebra. When the top of the trephine reaches the tip of the probe, the locking instrument will restrict its movement and prevent the serrated top from injuring the anterior tissue.",
    "Hold on to the trephine and probe and slowly pull them out. Collect the cancellous bone in the trephine for later use. Then, repeat the same procedure to remove the bone quickly. Sometimes, the bone may not come out with the trephine; use a nucleus pulposus clamp to remove it.\nBy changing the angle of the probe and making sure the trephine does not injure the nerves, remove the contralateral bone, preserving the vertebral arch and part of the bone.\nAfter the removal of most of the bone roughly, use the laminectomy rongeur and nucleus pulposus clamp to remove the remaining small cancellous bone fragments and discs. Then, use a curette to scrape the upper and lower endplate cartilage. When the space is large enough to implant the titanium mesh, the osteotomy is complete.\nUnder the isolation of the dura by the nerve dissector, use the reverse curette and osteotome to remove the posterior wall of the vertebra. Once the compression to the spinal cord is relieved, gently pull the spinal cord into a position where the titanium cage can be safely implanted. Be careful not to damage the spinal dura mater to avoid cerebrospinal fluid leakage.\nRemove the temporary fixation bar and change it to an orthopedic rod (pre-corrected to the proper curvature), and screw and fasten the nuts on the opposite of the osteotomy.\nFill an appropriately size titanium cage with the amputated autologous bone, and then place it in the correct position to prevent forward flexion of the spine. Implant the autologous fragmented bones peripherally.\nPlace another fixing rod with the same curvature as the rod placed previously on the osteotomy side, and screw and fasten the nuts.\n4. Closing the incision",
    "Use a large amount of saline to flush the operative field and stop active bleeding with bipolar electrocoagulation. Then, use gelatin sponges to fill the void and insert one or two closed suction drains to prevent postoperative hematoma.\nClose the incision layer-by-layer and ensure that each layer is not sutured to the drains. Use interrupted suture to suture the muscle and continuous suture to close the fascia by using absorbable suture material (size 1-0 for muscle and deep fascia, size 2-0 for superficial fascia). Use a skin stapler to suture the skin.\n5. Post-operative care\nMeasure the blood loss through the drain by observing the blood in the drainage bottle each day. The surgeons should also evaluate hidden blood loss to make sure the patients can obtain fast recovery12. Remove the drain when the blood loss is less than 50 mL per day.\nAllow patients to walk with a thoracolumbosacral orthosis if no venous thromboembolism is detected by a deep vein ultrasound scan. The orthosis is usually used for more than 3 months.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}