{
  "id": 13698,
  "origin_website": "Jove",
  "title": "Identification of Critical Conditions for Immunostaining in the Pea Aphid Embryos: Increasing Tissue Permeability and Decreasing Background Staining",
  "procedures": [
    "1. Culture of Aphids\nNOTE: The laboratory strain of the parthenogenetic viviparous pea aphid A. pisum was originally collected in the central Taiwan and has been reared on host plants (the garden pea Pisum sativum or broad bean Vicia faba) under long-day photoperiod for more than 300 generations (one generation: ~10 days).\nGermination of Seeds      \n\t\nSoak the seeds of host plants in tap water for 3-5 days at RT. Refill with fresh water once per day.\n\t\tNOTE: Alternatively, putting seeds of host plants straight into moist soil can induce germination as well.\nGrow 10 germinating seeds in a small pot (9 cm diameter x 7 cm tall) with soil in the growth chamber under photoperiod 16 hr light/8 hr dark at 20 °C.\nAbout 10 days after growth begins, transfer aphids onto plants whose height is more than 8 cm.  \nTransfer of Aphids\n\t\nKeep each pot of plants within a 1 L glass beaker, transfer 8 adult aphids onto plants using a paintbrush, and then seal the beaker with an air-permeable cover such as gauze mesh to prevent aphids from escaping.\nIncubate aphids in a growth chamber under photoperiod 16 hr light/8 hr dark at 20 °C. Water each plant pot of plants once every day.\nFor obtaining the next generation of aphids, reiterate steps 1.1.3-1.2.2 ten days after the primary aphid transfer.\n2. Dissection and Fixation of Ovaries\nFreshly prepare 4% paraformaldehyde (PFA) in 1x phosphate-buffered saline (PBS) as the fixation buffer.\nFill one well of a spot plate with PFA (about 500 µl), place the plate under a stereo microscope at low magnification, and submerge an adult aphid within the PFA for dissection.",
    "Dissect ovaries by holding the head and abdomen with one set of forceps, cutting open the dorsal cuticle of the abdomen, and dragging the ovaries away from the abdominal cavity.\nFix three pairs of ovaries in a 1.5 ml tube containing 1 ml of PFA at RT for 20 min.\nDecant fixation buffer with a transfer pipette (either glass or disposable) and then wash ovaries with 0.2% TritonX-100 in 1x PBS (PBST) 3 times for 10 min each. Mild shaking on a mixer/rotator (rotation angle: 60° (F60)/rotation speed: 8 RPM) is recommended for both fixation and washing.\n3. Treatment with Proteinase K (PK) to Increase the Permeability of Embryonic Tissues\nNOTE: PK treatment is applied to embryos from germ band extension onward (stage 11 of development). For younger embryos, this step is optional.\nSerially dilute the stock solution of PK (10 mg/ml) with 1x PBS to the working concentration 1 µg/ml.\nIncubate ovaries with 1 µg/ml of PK (about 500 µl) for 10 mins with mild shaking.\nDecant PK solution and then wash the ovaries with 700 µl of Glycine (2 mg/ml) 3 times for 5 mins each.\nWash ovaries with 0.2% PBST twice for 10 min each.\nFix ovaries again with fixation buffer for 15 min at RT with mild shaking.\nDiscard supernatant and wash ovaries with 0.2% PBST twice for 10 min each.\n4. Methanol Incubation for Suppressing the Endogenous peroxidase (POD) activity\nNOTE: Methanol incubation is not applied to embryos subjected to Phalloidin staining or antibody epitopes that are methanol sensitive.\nSerially dehydrate ovaries with different percentage of methanol in 0.2% PBST (v/v: 1:3, 1:1, 3:1) by incubating ovaries at each concentration of methanol solution for 10 min with mild agitation.\nDehydrate ovaries with 100% methanol for 1 hr at RT with mild shaking.",
    "NOTE: Satisfactory results of staining could still be obtained from aphid tissues that were stored in 100% methanol at -20 °C for one month.\nSerially rehydrate ovaries with different percentage of methanol in 0.2% PBST (v/v: 3:1, 1:1, 1:3) by incubating ovaries at each concentration of methanol solution for 10 min with mild agitation.\n5. Antibody Staining\nDilute the 10x blocking solution from the DIG-based buffer set (DIG-B) to 1x.\n\tNOTE: The 1x DIG-B blocking solution is more effective for reducing the staining background than the standard blocking reagent composed of 5% (v/v) normal goat serum (NGS) and 0.5% (v/v) bovine serum albumin (BSA) in 0.2% PBST.\nIncubate the ovaries with the 1x DIG-B blocking solution for 2.5 to 4 hr at RT or O/N at 4 °C with mild shaking.\n\tNOTE: For three pairs of ovaries in a 1.5 ml tube, 200 µl is the minimum volume for sample blocking and antibody staining.\nDecant supernatant and replace with fresh 1x DIG-B blocking solution containing primary antibody at appropriate dilution ratio. Stain the ovaries for 4 hr at RT or O/N at 4 °C with mild shaking.\n\tNOTE: For the experiment described here, use the following optimal dilutions of primary antibodies: (1) ApVas1 antibody: 1:500 for chromogenic staining, 1:50 for immunofluorescence staining; (2) anti-α tubulin antibody: 1:500; (3) 4D9 monoclonal antibody: 1:25.\nWash ovaries with 0.2% PBST 4 times for 15 min each.\nIncubate ovaries with 1x DIG-B blocking solution for 1 hr at RT with mild shaking.\nDecant supernatant and replace with fresh 1x DIG-B blocking solution containing secondary antibody at appropriate dilution ratio. Stain the ovaries for 4 hr at RT or O/N at 4 °C with mild shaking.",
    "Use the following dilution ratios of secondary antibodies: (1) For immunofluorescence staining: 1:500 for Alexa Fluor 633 goat anti-rabbit IgG or Alexa Fluor 488 goat anti-mouse IgG; (2) For chromogenic staining: 1:200 for biotinylated goat anti-rabbit IgG.\n\t\tNOTE: The biotinylated secondary antibody is applied for interacting with the avidin-biotin-complex (ABC) in the substrate-based (chromogenic) detection, through which the staining signals are significantly amplified.\nFor immunofluorescence staining, carry out staining in the dark because the secondary antibody is light sensitive.\nWash off secondary antibody with 0.2% PBST 4 times for 10 min each.\n6. Nuclear and F-actin Staining\nNOTE: This is only applied for immunofluorescence staining.\nStain ovaries with 0.2% PBST containing DAPI (2 ng/µl) and Phalloidin-TRITC (100 nM) for 2 hr at RT in dark.\nWash ovaries with 0.2% PBST 4 times for 10 min each.\nIncubate ovaries with the mounting medium O/N at 4 °C with mild shaking.\n7. Signal Development\nNOTE: This is only applied for chromogenic staining.\nPrepare 100 µl of reagent avidin-biotin-complex (ABC) for enhancing the signals by adding 1 µl of Reagent A (avidin) in 98 µl of 0.2% PBST, mixing thoroughly via gentle pipetting, and adding 1 µl of Reagent B (biotin conjugated with horseradish peroxidase), followed by immediate mixing. Incubate the mixture for 30 min at RT with mild shaking.\nIncubate ovaries (including the disassociated egg chambers) in the mixture of reagents A and B for 30 min at RT with mild shaking.\nWash off the mixture of reagents A and B with 0.2% PBST 4 times for 10 min each.\nTransfer ovaries submerged in PBST to a well on the spot plate with a plastic dropper.",
    "Prepare substrate solution of 3,3'-Diaminobenzidine (DAB): dissolve one DAB tablet plus another one containing urea hydrogen peroxide in 1 ml of ddH2O via vigorous vortexing for 1 min.\n\tNOTE: DAB, a precipitating substrate of peroxidase, is a popular chromogen for immunostaining. It produces a brown and insoluble precipitate after being oxidized by the peroxidase. Weak signals can be enhanced by adding nickel chloride to the substrate solution (final concentration 0.05-0.08 %).\nRemove the PBST solution remaining in the well and refill with 100 µl of the DAB substrate solution for signal development.\nMonitor intensity of signals under a stereo microscope at low magnification.\nStop reactions by removing the DAB solution, followed by refilling with 1x PBS immediately. Repeat the wash twice.\nTransfer ovaries back to the 1.5 ml tube and then wash with 1x PBS or PBST twice for 15 min each. \nIncubate ovaries in a glycerol-based mounting medium (70% glycerol) O/N at 4 °C with mild shaking.\n8. Mounting the Aphid Embryos\nNOTE: The thickness of aphid embryos varies between stages of development. Mounting strategies are thus modified to fit early (germaria and stages 0-10), mid (stages 11-18), and late embryos (stages 19-20), which are demonstrated in Figure 2B-D. Embryonic staging followed Miura et al.12\nTransfer ovaries together with mounting medium to the cell tray with a plastic dropper and observe samples under a stereo microscope at low magnification.\nCut the calyces associated with the lateral oviduct using insect pins and then transfer an isolated ovariole to an empty glass well with a dropper. Make up the final volume to 50-100 µl using mounting medium.\nTransfer an ovariole onto the slide with a glass dropper and then dissect egg chambers using insect pins.",
    "NOTE: For embryos older than stage 6 of development, separation of egg chambers is suggested; for germaria and the first two egg chambers younger than stage 6, separation is optional.\nRelocate a dissected egg chamber to a clean slide using a glass dropper.\nPut a coverslip (size: 22 x 22 mm) over the dissected germaria or egg chambers (containing embryos at stages 1-10 of development) slowly to avoid bubbles.\n\t\nMount egg chambers (containing embryos at stages 11-18 of development) on a slide with one-sided coverslip bridge and place another coverslip (size: 18 x 18 mm) on top of the sample.\nMount egg chambers (containing embryos older than stage 19 of development) on a slide with double-sided coverslip bridge and place another coverslip (size: 18 x 18 mm) on top of the sample.\nFill the space beneath the top coverslip with mounting media to avoid drying the sample.\nMildly roll the embryo by sliding the coverslip to obtain the right orientation for observation.\nSeal around the edge of coverslips (including the bridge coverslips) with nail polish.\n9. Imaging Analysis\nPhotograph differential interference contrast (DIC) images of whole-mount embryos with a compound microscope equipped with DIC optics and a dry objective lens (10X, 20X, 40X) connected to a camera. Install the software for image transfer between the camera and computer using manufacturer’s instructions.\nAcquire projections of the fluorescently labeled embryos with a laser-scanning confocal microscope14. Follow the manufacturer's instructions for photographing, z-stacking, and 3D projecting with imaging software.\n\t\nTurn the slide upside down, find the mounted sample with 10X objective, and circle the sample area with a fine oiled-based pen.\n\t\tNOTE: This makes identifying the sample easier when searching for it through objectives of a confocal microscope.",
    "Add a drop of oil on the top of the coverslip area whose opposite side is labeled as described in 9.2.1.\nFind the focal plane at 40X oil-immersion objective then change to a 63X oil-immersion objective. Manually move the fine focus control up and down to capture the best focal plane.\n\tNOTE: For observing structural details of germaria and early embryos, we suggest using 40X objectives or those with higher magnification.\nScan the embryo in different excitation channels and obtain a z-stack image.\n\tNOTE: For pea aphid tissues, reduce thickness of each optical section down to 1.5 µm or less.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}