{
  "id": 10871,
  "origin_website": "Jove",
  "title": "A Label-free Technique for the Spatio-temporal Imaging of Single Cell Secretions",
  "procedures": [
    "1. Nanostructure Fabrication\nChoose 25 mm diameter glass coverslips with an approximate thickness of 170 µm (No. 1.5) as substrates for nanofabrication.\nImmerse the coverslips in piranha solution (3:1 ratio of sulphuric acid and hydrogen peroxide) for at least 6 hr. Wash the piranha soaked coverslip with copious amount of ultrapure 18.2 MΩ deionized distilled water (DDW).\n\tCAUTION: Piranha acid reacts violently with organic materials and must be handled with extreme care.\nDeposit 10 nm chromium thin film on the coverslips by e-beam evaporation to avoid charge effects during the patterning and imaging of nanostructures.\nSpin the first layer of bilayer resist consisting of ethyl lactate methyl methacrylate (MMA_EL6) copolymer at 2,000 rpm for 45 sec and then bake at 150 °C. Spin the second layer of poly-methyl methacrylate (950PMMA_A2) at 3,000 rpm for 45 sec then bake at 180 °C.\nPattern the bilayer resist using the electron beam lithography (EBL) at 25 kV with an area dose of 300 µC/cm2. Develop in isopropyl alcohol (IPA)/methyl isobutyl ketone (MIBK): 2/1 and rinse in IPA.\nDeposit Ti (5 nm) / Au (80 nm) film on the substrate using a e-beam evaporator.\nFollowing the gold deposition, lift off the copolymer bilayer resist by soaking the substrate in acetone for 4 hr.\nInspect the substrate using the scanning electron microscope (SEM) to confirm nanostructure shape and size, remove the remaining chromium from the substrate via wet etch using CR-7 etchant for 60 sec at RT and then rinse in DDW.",
    "Design a center-to-center array spacing of 33 µm to leave room for cell imaging between arrays. Pattern the nanostructures in 20 x 20 pattern for each array with a pitch of 300 nm using an e-beam writer. Each chip contains 300 arrays with a typical nanostructure dimension of 80±2.5 nm height and 70±2.5 nm diameter.\nInspect a subset of arrays using the atomic force microscope (AFM) for the verification of size and uniformity.\nAttach a support ring, typically silicon, to the back of the coverslip using a UV curing epoxy.\n2. Chip Cleaning and Application of Self-assembled Monolayer\nFor cleaning and regenerating the chips, plasma ash at a power of 40 W in a 300 mTorr mixture of 5% hydrogen, 95% argon for 45 sec after cleaning the chamber for 5 min under the same conditions.\nFunctionalize the gold nanostructures immediately after plasma ashing by immersing the chip in a two-component ethanolic thiol solution consisting of a 3:1 ratio of SH-(CH2)8-EG3-OH (SPO) and a component with either an amine or carboxyl functional group, namely, SH-(CH2)11-EG3-NH2 (SPN) or SH-(CH2)11-EG3-COOH (SPC).\nLeave the chip in the thiol solution O/N to form a self-assembled monolayer (SAM).\nRinse the chip with ethanol and dry with nitrogen gas.\nIf needed, store the functionalized chip for up to 2 weeks at 4 °C.\nWhen ready for use react the SPN or SPC component with the ligand using a chemistry depending on the ligand of choice (see below).\n\tNote: The chips can be regenerated and re-functionalized dozens of times. A given chip can be used for periods that range from 6 months to over a year. The spectra measured on a given array are reliably reproduced after repeated regenerations by plasma ashing, followed by biofunctionalization.29\n3. Surface Functionalization and Kinetic Characterization",
    "Note: Use the functionalized chip in the commercial SPR instrument to characterize the kinetic rate constants between the ligand and the analyte, as well as to study the resistance of SAM to non-specific binding. There is a wide range of flow rates and microfluidic designs that allow for efficient surface functionalization. Since we have a commercially available SPR we standardized around its recommended flow rates. We note that these flow rates are typical of all SPR instruments and so are not restrictive. The SPR instrument is not a necessity since all functionalization can be done directly on the LSPR chip, but it did reduce our work load because it is a multiplexed instrument whereas our LSPR microfluidic setup is not.\nFunctionalize a commercial bare gold chip with the SAM as described in Section 2.\nIf using an SPC based SAM, activate the carboxyl group with a 1:1 mixture of 133 mM of 1-ethyl-3-(3-dimethylaminopropyl) carbodiimide (EDC) and 33 mM of N-hydroxysuccinimide (NHS) in DDW for 10 min.\nConjugate the activated carboxyl group with the antibody/ligand of interest for 300 sec using a flow rate of 30 µl/min. Prepare the ligands in pH 6 phosphate buffer, typically, but this can vary depending on the molecule.\nAfter the ligand conjugation, flow 0.1 M ethanolamine in phosphate-buffered saline (PBS) as a deactivator step for 300 sec at a rate of 30 µl/min. Ethanolamine helps in minimizing the non-specific binding.\nIntroduce the analyte of interest at a flow rate of 100 µl/min using a range of concentrations and calculate the kinetic rate constants using a kinetic analysis software.\nIf non-specific binding is problematic, increase the ratio of SPO to SPC or SPN.\n4. LSPR General Settings\nMicroscope settings:",
    "Use a 100 W Halogen lamp to Koehler illuminate the sample. Use a long pass filter (typically 593 nm cutoff) in the light path to eliminate wavelengths that do not contribute to the resonance shift (Figure 2).\nFor the LSPRi data collection, use an inverted microscope with a 40X oil immersion objective (1.4 NA) and a thermoelectrically cooled 16 bit CCD camera.\nPlace a beam splitter at the output port of the microscope to obtain Imagery and spectra simultaneously.\nSet the temperature controlled microscope stage to 37 °C and equilibrate for 4 hr.\nIncorporate an additional incubation assembly on the microscope to regulate the CO2 concentration and humidity at 5% and 95%, respectively.\nChip preparation and mounting:\n\t\nFunctionalize the LSPR chip as described in Section 2 with the optimal two-component SAM ratios determined from the SPR experiments.\nLoad the chip within a custom made microfluidic holder as follows. Place the chip on an aluminum bottom piece. Sandwich the chip between this bottom piece and a silicone gasket and a clear plastic top piece. Use 4 screws to clamp the assembly.\nFor a typical SPC-based thiol application, drop coat 300 µl a 1:1 mixture of 133 mM of EDC and 33 mM of NHS in DDW to activate the carboxyl groups of the SPC thiol component.\nWait for 10 min and manually rinse the surface with 10 mM PBS.\nConjugate the activated carboxyl group with the ligand (typically an antibody or antibody fragment) of interest by drop coating 300 µl of ligand solution.\nWait for 30 min and manually rinse with 10 mM PBS.\nDrop coat 300 µl of 0.1 M ethanolamine in PBS on the chip to minimize nonspecific binding. Wait for 10 min.\nWash the ethanolamine with PBS containing 0.005% Tween 20 (PBS-T20).",
    "Place a quartz piece above the chip to reduce fluctuations in the data related to a changing meniscus.\nKeep the chip wet with PBS-T20 buffer while mounting on microscope.\nPlace the LSPR chip assembly firmly into the heated stage sample holder and attach microfluidic tubing.\nAttach the microfluidics tubing to the assembly and flow buffer (or serum free media for cell studies) until a steady state is reached.\nAllow the assembly and microscope to equilibrate for at least 2 hr.\nAlign the chip using joystick so that the central array is aligned with the fiber optic for spectroscopy. Spectroscopic data is taken using a spectrometer and spectral analysis software.\nKeep arrays in focus throughout the experiment by using software autofocus, Zeiss Definite Focus or equivalent autofocus device.\n5. LSPR Imaging of Anti-c-myc Secretions from 9E10 Hybridoma Cells\nNote: The hybridoma cell line used for this study express anti-c-myc antibody constitutively and hence do not require a chemical trigger\nFunctionalize the nanostructures with c-myc peptide. This has a KD value of 1.77 nM for the anti-c-myc antibodies secreted by clone 9E10 hybridoma cells.\nCulture the hybridoma cells in complete growth medium with 10% fetal bovine serum (FBS) and 1% antibiotic in a T75 flask at 37 °C under 5% CO2. Maintain a cell density of 4 ×105 cells/ml.\nFor the cell secretion studies, pellet cells from the T75 flask by centrifugation, wash twice with RPMI-1640 serum free media (SFM) to remove the secreted antibodies and adjust the cell density to 4 ×106 cells/ml.\nHarvest the cells and test for viability before introducing them on to the LSPR chips.\nIntroduce 50 µl of the cell solution manually onto the LSPR chips with a micropipette. After few minutes 25 to 50 cells adhere to the surface of the LSPR chips.",
    "Wash away the remaining cells in solution with fresh SFM using the microfluidic perfusion system.\nSelect the LSPR arrays for imaging which are close, within 10 μm, but not overlapping with the cells.\nTo ensure that the signal is specific to the secreted anti-c-myc antibodies introduce the cell culture media with and without the antibodies present as well as with the antibodies but with their binding sites blocked by the presence of a saturating concentration of c-myc peptide in the solution.\nCalibrate the sensors at the end of each run with a saturating solution of anti-c-myc antibodies (250 nM). This helps in normalizing the response of the sensors and determine fractional occupancy based on the biofunctionalization profile of each run.\nCorrect the drift in the X and Y direction using image alignment software."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}