{
  "id": 5090,
  "origin_website": "Bio",
  "title": "Indirect Immunofluorescence Assay in <em>Chlamydomonas reinhardtii</em>",
  "procedures": [
    "Chill 100% methanol in a Coplin jar at -20 °C for at least 4 h.Harvest 50 ml of Chlamydomonas cells at the log growth phase by centrifugation at 600 x g for 5 min. This and subsequent steps are performed at room temperature except for step 10.Notes: Chlamydomonas culture media recipes are available at http://www.chlamy.org/media.html[href=http://www.chlamy.org/media.html].50 ml of cultured cells grown to 1-2 x 106 cells ml–1 is adequate. Resuspend the cells in small volumes (1-2 ml) of PBS, count the cell number by hematocytometer, and adjust the cell density at 1x107 cells ml–1 using PBS.Draw three circles on a Poly-L-lysine-treated glass slide with Dako Pen to provide a barrier to liquids such as blocking solution, antibody solution, and washing buffer (Figure 1A). Dry the circles at room temperature.Put 100 µl of Chlamydomonas cell suspension in each circle and let them air-dry for 5 min to fix the cells to the glass.Note: If you let them sit longer, more Chlamydomonas cells will adhere, but the ends of the flagella of cells start to curl up.Permeabllize the cells by immersing the glass slide into a Coplin jar filled with PBS-T for 10 min (Figure 1B).Prepare a clean plastic box with a few damp Kimwipes® paper at the bottom to keep the air humid.Place the glass slide on a cap of plastic tube placed in the plastic box (Figure 1C) and fix the proteins within cells by applying 100 µl of PBS containing 4% (w/v) formaldehyde to the cells for 20 min. Make sure that the solution is within the circles and the entire cells are covered by the PBS solution.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160630/20160630224112_7337.jpgFigure 1. Devices for indirect immunofluorescence assay. A. Example of circles drawn by Dako Pen on a Poly-L-lysine-treated glass slide. B. Immersed glass slide in a Coplin jar filled with PBS-T. C.",
    "Humid plastic box with a few damp Kimwipes® papers and a glass slide on a cap of plastic tube.Wash the cells two times by immersing the glass slide into a Coplin jar filled with PBS for 5 min.Note: You do not need to shake the slides or jars during washing.Fix the cells by immersing the glass slide into a Coplin jar filled with pre-chilled 100% methanol at -20 ˚C for 20 min. Because chlorophyll will be solubilized, the methanol becomes green.Note: Because the temperature of the chilled methanol is important in the fixation, it is recommended to keep the methanol in a freezer at -20 ˚C overnight before use.Rehydrate the cells by immersing the glass slide into a Coplin jar filled with PBS for 5 min.Pour off the PBS and repeat the rehydration step 11 two times. If you perform time-course experiments, you can let the glass slide sit in PBS for several hours until you are ready. Take out the glass slide from the Coplin jar and let it air-dry for 5 min.Block the cells on the glass slide by applying 100 µl of blocking solution for 1 h in the humid plastic box. Wash the cells two times by immersing the glass slide into a Coplin jar filled with PBS for 5 min.Note: You do not need to shake the slides or jars during washing.Take out the glass slide from the Coplin jar and let it air-dry for 5 min.Apply 50 µl of PBS-T containing the primary antibody at the dilution rate of 1:500 and incubate the cells for 1 h in the humid plastic box.Wash the cells six times by immersing the glass slide into a Coplin jar filled with PBS-T for 5 min.",
    "Apply 50 µl of PBS-T containing secondary antibody at the dilution rate of 1:500 and incubate the cells for 1 h in the humid plastic box. Keep in the dark.Wash the cells six times by immersing the glass slide into a Coplin jar filled with PBS-T for 5 min.Apply 15 µl of mounting solution to the cells. Make sure that no air bubbles are formed.Cells are now ready for observation by fluorescent microscopy with a specific filter set (excitation bandpass 480/40 and emission bandpass 527/30) or laser scanning confocal microscopy with a 488 nm laser line. Glass slide can be stored for a week at 4 °C in the dark.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160630/20160630224444_6912.jpgFigure 2. Actual cell images and fluorescence signals of indirect immunofluorescence assay. A. Fixed cells on the glass slide after step 5. Scale bar, 10 µm. B. Fixed cells on the glass slide after step 10. Chlorophyll pigments are extracted and the color of the cells turn transparent. Scale bar, 10 µm. C. Differential interference contrast image of Chlamydomonas cell. Arrowhead indicates the pyrenoid structure where CO2-fixation enzyme Rubisco is enriched. Scale bar, 5 µm. D. Indirect immunofluorescence signals derived from anti LCIB-antibody. LCIB is detected as a ring-like structure around the pyrenoid as shown in the previous report (Yamano et al., 2010). Scale bar, 5 µm."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}