{
  "id": 3637,
  "origin_website": "Cell",
  "title": "Two-parameter single-molecule analysis for measurement of chromatin mobility",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nHalo ligand staining\nTiming: 30 min\nAt this step, cells are incubated with the fluorescent Halo ligand, which penetrates the cells to specifically and covalently bind to the Halo-tag. Janelia Fluorophore 549 (JF549, see Key resources table[href=https://www.wicell.org#key-resources-table]) has been broadly used for single-molecule applications and provides an excellent background/signal ratio. The Halo fusion protein is detected with a laser excitation optimal for JF549 (549 nm).\nIncubate the cells for 15 min with 5 nM of fluorescent Halo ligand.\nRemove the medium containing the fluorophore in excess and replace with fresh medium (free of Phenol Red). Repeat three times.\nLeave the cells in the incubator for 15 min to release unbound fluorophore.\nRemove the medium and replace with fresh medium (free of phenol red).\nCritical: We recommend concealing the sample from the light as much as possible to avoid photobleaching and leaving the light off in the cell culture hood.\nSingle-molecule imaging\nTiming: several hours\nThis is the step of detection of fluorescent single molecules of the Halo-tagged protein of interest, using HILO imaging.\nSet the sample in the observation chamber, ideally allowing the control temperature and CO2 levels. If no CO2 control is possible, we recommend imaging for relatively short times (<1 h), alternating between samples in and out from a cell incubator to avoid impairing cell function.\nUsing a laser compatible with JF549 fluorophore excitation (peak at 549 nm) and starting at a moderate power coupled with a 100 ms exposure, detect the JF549 fluorescence in the sample. Adjust focus and illumination angle for optimal signal.\nTake a single snapshot of the nucleus/nuclei to be acquired. It can be used for further detection of nuclear structures (e.g., nucleoli, condensates, …), as well as for assaying the intensity of fluorescence prior to single-molecule acquisition.",
    "Set the camera exposure time at 10 ms and increase progressively the laser power, until single molecules are visible. Photobleaching the nucleus might be necessary and take several seconds (Methods Video S1[href=https://www.wicell.org#mmc1]).\nAdjust the illumination angle, z-axis and laser power to obtain an optimal molecule density and background-to-signal ratio (see Troubleshooting[href=https://www.wicell.org#troubleshooting] and Methods Videos S1[href=https://www.wicell.org#mmc1] and S2[href=https://www.wicell.org#mmc2]).\n                Your browser does not support HTML5 video.\n              \nMethods video S1. Setting up optimal imaging conditions for single-molecule tracking, related to single-molecule imaging (step 8)\nThe position of the cell nucleus expressing FOXA1-HALO is indicated by a white circle. The acquisition rate is of 100 Hz (10 ms exposure time). A first phase of photobleaching the nucleus is necessary here to visualize single molecules, until obtaining optimal background-to-signal ratio.\n                Your browser does not support HTML5 video.\n              \nMethods video S2. Example of suboptimal background-to-signal ratio, related to single-molecule imaging (step 8)\nThis video displays how changing the illumination angle changes the background-to-signal ratio. Note that the conditions here are suboptimal compared to Video 1, but nevertheless, single-molecule tracking might still be done efficiently in these conditions.\nAs the elevated laser power causes fast photobleaching, start recording the single molecules as soon as possible. Typically, 5,000 frames are recorded (total acquisition duration: 50 s).\nNote: For step 6, we recommend starting with a low laser power. Typically, we use values ranging from 50 to 500 W/cm2 for imaging. If you observe rapid photobleaching, decrease the laser power.",
    "Note: For step 8, the optimal range for acquisition lies between imaging as seen in Methods Videos S1[href=https://www.wicell.org#mmc1] and S2[href=https://www.wicell.org#mmc2]. We recommend acquiring between 20–30 individual nuclei to ensure having enough data for further analysis. Our protocol was established using a 10 ms exposure for single-molecule imaging. Exposure times between 5 and 30 ms should be compatible with this protocol but might lead to differences in the accuracy of the measure of the average displacement and radius of confinement leading to two-dimensional plots different of the examples provided here.\nSingle-molecule tracking analysis I: tracking\nTiming: several hours\nThis is the first step of computational analysis for the single-molecule imaging data. The input is a stack of .tif files generated at the single-molecule imaging step (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/324-Fig1.jpg\nFigure 1. Data pipeline for single-molecule tracking with SLIMfast.m\n(A) Single-molecule imaging .tif stacks are used as inputs for SLIMfast.m.\n(B) Screenshots from SLIMfast.m indicating how to load several .tif stacks as a batch to detect molecules in each consecutive frame, as well as the parameters that can be modified by the user depending on the characteristic of the microsope in use (see Notes of the Single-molecule tracking analysis I: tracking[href=https://www.wicell.org#sec3.3] section for details).\n(C) Screenshot from SLIMfast.m indicating how to load the particle data from the precedent step, for the script to trace single molecule trajectories. An example of the overlay of all detected particles in a nucleus expressing FOXA1-HALO, over the course of 50 s is displayed.",
    "(D) Example of trajectories established by the tracking algorithm in a single nucleus over the course of 50 s. A part of the corresponding .csv files is displayed, as provided after conversion by Csv_converter.m. The consecutive columns indicate #1, iteration; #2, frame of detection of the trajectory first step; #3, time = frame × step duration(0.01 s); #4 and #5, x and y coordinates (μm).\nWe preferentially use tracking software SLIMfast.m (Normanno et al., 2015[href=https://www.wicell.org#bib11]; Teves et al., 2016[href=https://www.wicell.org#bib18]), based on the tracking algorithm Multiple Target Tracing (MTT) (Sergé et al., 2008[href=https://www.wicell.org#bib16]), both publicly available (please also cite these publications whenever referring to our protocol). Alternatively, this protocol is also compatible with tracking files generated by TrackMate (ImageJ), which can be directly used as inputs in the following section.\nFor each .tif stack, this step outputs a .txt tracking data file containing a series of successive spatiotemporal coordinates (x, y, t) for each single molecule trajectory (or motion track) over the time of acquisition. The tracking step here is using the MATLAB-based SLIMfast.m script (Teves et al., 2016[href=https://www.wicell.org#bib18]), a modified version of MTT (Sergé et al., 2008[href=https://www.wicell.org#bib16]), both publicly available. Please cite these publications whenever referring to this protocol.\nStart MATLAB and run SLIMFast.m\nIn SLIMfast, hit Load > Batch, and select the .tif stacks to analyze. Once all the files loaded, adjust the Optics parameters: fluorophore (emission for JF549=580 nm), objective (Numerical Aperture, NA) and camera (Pixel size) used during single-molecule imaging (Figure 1[href=https://www.wicell.org#fig1]B and Methods Video S3[href=https://www.wicell.org#mmc3]).\n            Your browser does not support HTML5 video.\n          \nMethods video S3. Detection of molecules by SLIMfast.m, related to single-molecule tracking analysis I (step 10)\nThis video displays how to add the tracking script package to the path, and how to detect molecules in successive frames of the .tif single-molecule imaging stacks.",
    "Hit START. A progress bar (“localization”) will pop up, representing the progressive detection of particles in the successive frames of each .tif stack (Methods Video S3[href=https://www.wicell.org#mmc3]). Once detection is finished, a signal (“Done!”) pops up. This step produces several output files sharing the name of the initial .tif stack, among which a .mat file.\nIn SLIMfast, Load > Particle data and select an individual .mat file. An overlay of all particles detected over the course of acquisition is displayed (Figure 1[href=https://www.wicell.org#fig1]C and Methods Video S4[href=https://www.wicell.org#mmc4]).\nTo track the molecules frame-by-frame, in the overlay menu, hit OPT > Tracking, and change the Max. expected Diffusion Coefficient to 3 μm2/s.\nHit “GEN TRAJ” in the overlay window. A “Processing Frame” progress bar pops up. Once completed, the output files can be saves in the directory of choice. This step generates a .txt file with the same name than the initial .mat file, which will be converted as .csv and used as an input for the two-parameter mobility analysis (Figure 1[href=https://www.wicell.org#fig1]D).\n            Your browser does not support HTML5 video.\n          \nMethods video S4. Single-molecule tracking by SLIMfast.m, related to single-molecule tracking analysis I (step 12)\nThis video displays how to upload the file containing the successive position of molecules in the .tif stacks, and to run the MTT tracking algorithm to establish trajectories.\nPause Point: Step 11 can be timely and can take up to several hours to complete for large data sets. For example, for 50 cells, using the minimal configuration indicated in the Computing setup section, it can take up to 3–4 h.",
    "Note: For step 10: tracking algorithm MTT performs the detection of single particles by fitting a two-dimensional Gaussian to the Point Spread Function (PSF), over sliding windows of 7 × 7 pixels (Sergé et al., 2008[href=https://www.wicell.org#bib16]). The shape and size of the PSF is function notably of the emission wavelength of the fluorophore in use (580 nm for JF549) and on the Numerical Aperture (NA) of the objective used for imaging (1.45 for the Oni Nanoimager S). In our experiments (Lerner et al., 2020[href=https://www.wicell.org#bib7]), the PSF was approximately of 0.8. To discriminate false and true detected particle, a probability of false alarm (PFA) is set by default at 10 −6 by the tracking algorithm (Sergé et al., 2008[href=https://www.wicell.org#bib16]). The Count/photons value is a technical feature intrinsic to the camera used to estimate the number of detected photons which does not affect the tracking parameters. Please note that all parameters can be freely modified by the user if desired.\nNote: For step 12, the Maximal expected Diffusion Coefficient value reflects the maximal frame-to-frame displacement expected for single particles, and was set as most accurately reflecting the motions of single particles seen in our experimental conditions. If desired, the user can input different values, which might be relevant if using exposure times different than 10 ms (see previous section).\nSingle-molecule tracking analysis II: motion track classification\nTiming: several hours\nThe two-dimensional mobility analysis is only performed on chromatin-interacting molecules. Thus, during the second step of data analysis, free-diffusing molecules are identified and filtered out by classifying trajectories generated by SLIMfast.m on the basis of their mean-squared displacement (or MSD, Figure 2[href=https://www.wicell.org#fig2]A, Ernst and Köhler, 2012[href=https://www.wicell.org#bib5]). The tracking .txt file generated at the previous step are converted to .csv and used as input.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/324-Fig2.jpg\nFigure 2. Mean-squared displacements (MSD) of single-molecule trajectories",
    "(A) Measurement of the MSD for the same single-molecule trajectory, using different delays (tlag=10, 20 or 30 ms), including the mathematical expression of MSD in function of the diffusion coefficient D and the scaling component α. Each black dot represents the successive position of the molecule, with the associated timing of detection.\n(B) .csv tracking files are used as inputs for the script SMT_motion_classifier. An example of T-MSD curves obtained for a single nucleus expressing FOXA1-HALO over 50 s of acquisition at 100 Hz is displayed.\nThe SMT_Motion_classifier.m script performs the following operations:\nThe SMT_Motion_classifier.m script performs the following operations: (1) discarding of trajectories shorter than 5 frames to optimize the classification; (2) computing the T-MSD curve (or MSD=f(tlag), where tlag is the delay in seconds) for each individual trajectory (Figure 2[href=https://www.wicell.org#fig2]B); (3) fitting of each full T-MSD curve with a power law distribution (Michalet and Berglund, 2012[href=https://www.wicell.org#bib20]) the scaling component α (Figure 2[href=https://www.wicell.org#fig2]B and see Ernst and Köhler, 2012[href=https://www.wicell.org#bib5]); (4) α -based classification of trajectories: α≤0.7: confined ; 0.7<α<1: Brownian; α≥1: directed (Figure 3[href=https://www.wicell.org#fig3]A); (5) in parallel, detection of “Butterfly” trajectories with mixed confined and directed/Brownian behaviors (“Butterfly”), on the basis of a displacement step (or jump) at least 1.5 times superior to the average displacement, and of a sum of displacements bigger than 8 times the average frame-by-frame displacement (Figure 3[href=https://www.wicell.org#fig3]B); (6) splitting of Butterfly trajectories into confined and Directed/Brownian segments based on geometrical properties: Brownian/directed segments have at least 30% of its points outside of a polygon (convex hull) formed by the points of previous and posterior segments of the trajectory (Figure 3[href=https://www.wicell.org#fig3]C); (7) classification of confined trajectories (including Butterfly confined segments) based on their average frame-to-frame displacement. Trajectories with average displacement below 100 nm are considered as confined, corresponding to molecules interacting with chromatin (Figure 3[href=https://www.wicell.org#fig3]D).",
    "imgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/324-Fig3.jpg\nFigure 3. Basis of trajectory classification by SMT_motion_classifier.m\n(A) The scaling component αT-MSD curve is used to keep confined trajectories, corresponding to chromatin associated molecules; and discard facilitated and pure diffusion trajectories, corresponding to molecules non-associated with chromatin.\n(B) Composite (“butterfly”) trajectories, presenting confined and diffusing components, are identified on the basis of two criteria: a displacement (d) larger than the average frame-to-frame displacement (), and a sum of displacements (Σd) larger than 8 times .\n(C) “Butterfly” trajectories are segmented into their confined and Brownian/directed parts. Each number represents the successive time of detection of the single molecule. Example of a fragment considered as confined (from time 5 to 6) and directed (from time 6 to 7) are displayed. The Brownian/directed segment must fulfill the condition that a minimum percentage of its points lie outside the polygon (convex hull) formed by the points of previous and posterior segments of the trajectory.\n(D) To discard confined tracks with high displacements, a threshold for a maximal frame-to-frame displacement of 100 nm is set. T-MSD curves are shown here before and after filtration for all confined tracks in a single nucleus expressing FOXA1-HALO. T-MSD curves after filtration (right panel) present a confined aspect only.\nFor each imaged nucleus, seven “msd_results” .mat files are generated as outputs. They correspond to each class of trajectories: All, Brownian, Directed, Confined with high (confined_High_Jump) or Low (confined_Low_Jump) average displacement, Butterfly Confined (segments_confined) and Directed (segments_directed) segments.\nGather the batch of .txt files generated by SLIMfast.m at the previous step (each .txt file corresponds to one initial .tif stack) in a unique folder, which will be made directory for MATLAB (Methods Video S5[href=https://www.wicell.org#mmc5]).",
    "Run csv_converter.m (Methods Video S5[href=https://www.wicell.org#mmc5]), which converts each .txt file into a .csv file containing the following information (column-by-column): iteration (1-n, with n number of rows of the csv table), frame (the frame on which each single molecule was detected), time (t=frame∗exposure), trajectory (Identification number of the trajectory), and x and y coordinates, in μm.\nRun SMT_Motion_Classifier.m. Select the batch of tracking .csv files to analyze. To display additional figures, or change parameters, please refer to the User Manual provided in the MATLAB script package. After execution, the script outputs a new folder starting with “MSD_results” and containing 7 .mat files (starting with “msd_results”).\nPause Point: Step 15 can be timely for large datasets and depending on your computing power, this can be used as a Pause point for an hour or more (see Troubleshooting[href=https://www.wicell.org#troubleshooting]). For example, for 100,000 trajectories, using the minimal configuration indicated in the Computing setup section, the script can take up to 2–3 h.\n        Your browser does not support HTML5 video.\n      \nMethods video S5. Collection and conversion of tracking data, related to single-molecule tracking analysis II (step 14)\nThe tracking data (.txt files) are collected in a single folder and converted to .csv compatible with the scripts used for the protocol.\nNote: Thresholds for detection of butterfly trajectories were set empirically, optimizing the values of thresholds for an optimal classification, as assayed by visual inspection of the confined and directed parts. For a first-time analysis, we recommend using the defaults parameters. Nevertheless, advanced users can freely modify all parameters of the data analysis in lines 25–54 of the SMT_Motion_Classifier.m, to vary the conditions.\nUsers also have the option not to use the Confined segments of the butterfly tracks in the analysis, just by selecting the Confined_low_jump.mat file in the following part.",
    "For step 13, we provide sample .csv files with our MATLAB script package\nSingle-molecule tracking analysis III: measure of the radius of confinement and of the average displacement, and mapping of the data density\nTiming: several hours\nThe third step of single-molecule data analysis consists of assessing the two parameters used for characterizing the mobility of individual molecules. The Two_Parameter_SMT.m script is run on trajectories of nuclear proteins in a chromatin-bound state, defined as the pool of confined trajectories and of the confined segments of the Butterfly trajectories (Figure 3[href=https://www.wicell.org#fig3] and Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/324-Fig4.jpg\nFigure 4. Two parameters of mobility are assessed for confined trajectories\n(A) Confined tracks, corresponding to chromatin-interacting molecules are defined as the pool of confined below the jump threshold (confined_Low_Jump_0.1) and the confined portion of butterfly trajectories (Butterfly_segments_confined).\n(B) The radius of confinement is measured by fitting individual T-MSD curves with a circle confined diffusion model, and estimates the circle encompassing the motion track.\n(C) The average displacement corresponds to the average Euclidean distance between two consecutive positions of the molecule in the motion track.\n(D) Scatter plot of the radius of confinement versus average displacement for n = 80,000 individual trajectories of FOXA1-HALO.\n(E) Visualization of the same plot than D, but displaying data density using scatplot.m.\nTo measure the radius of confinement (RC), the Two_Parameter_SMT.m script fits each T-MSD curves with a circle confined diffusion model (Wieser and Schütz, 2008[href=https://www.wicell.org#bib19]) to provide (1) the corresponding radius of confinement RC; (2) the diffusion coefficient at short time scales D; (3) a constant offset corresponding to the localization precision limit (Figure 4[href=https://www.wicell.org#fig4]B).\nThe average displacement (AVE) is computed by measuring the average Euclidean distance between two consecutive positions of the molecule in each motion track (Figure 4[href=https://www.wicell.org#fig4]C).",
    "The different mobility chromatin domains are arbitrarily defined based on the correlation between the two parameters, and based on the data density: very low (vLMC) and low (LMC) mobility chromatin are seen as two marked deviations from the line of proportionality. Along the correlation line, Intermediate (IMC) and High (HMC) are distinguished based on the bimodality of the distribution of the radius of confinement: IMC presents lower RC than HMC (Figure 5[href=https://www.wicell.org#fig5]A). The limits for radius of confinement (RC) and average displacement (AVE) are set as follows (Figure 5[href=https://www.wicell.org#fig5]A): very Low Mobility Chromatin (vLMC): 0.020 <RC< 0.030 & 0.015 <AVE< 0.029; Low Mobility Chromatin (LMC): 0.035 <RC< 0.05 & 0.020 <AVE< 0.035; Intermediate Mobility Chromatin (IMC): 0.015 <RC< 0.0375 & 0.029 <AVE< 0.036; High Mobility Chromatin (HMC): HMC 0.0375 <RC< 0.055 & 0.0375 <AVE< 0.06; very High Mobility Chromatin (vHMC) 0.055 <RC< 0.3 & 0.06 <AVE< 0.3.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/324-Fig5.jpg\nFigure 5. Comparing the mobility of a protein of interest with a mobility of reference\n(A) Example of a reference mobility plot (H2B-HALO, n = 80,000) and of the mobility plot for a protein of interest (FOXA1-HALO, n = 80,000). The squares represent the boundaries set for each chromatin mobility group. Differences in data density are measured by normalizing the data density in the reference plot by the maximal value in the plot of interest. vL, very low mobility chromatin; L, low mobility chromatin; I, intermediate mobility chromatin; H, high mobility chromatin; vH, very high mobility chromatin.",
    "(B) Density values in the plot of reference and of interest are first normalized by the corresponding maximal density value in the plot (noted max(density)). Then, the Density_differences.m script overlaps the two-dimensional density plots of reference (e.g., histone H2B in red) and of interest (in green), and subtracts the average density values of the 5 nearest points of reference to each density of interest. Density differences are then multiplied by −1 for intuitiveness. Then positive values for density differences indicate increased binding, while negative values indicate decreased binding.\n(C) Data density differences between FOXA1 and H2B in the different mobility groups. Data are represented as means ± SEM. vL, very low mobility chromatin; L, low mobility chromatin; I, intermediary mobility chromatin; H, high mobility chromatin.\nThe outputs generated by the script are (1) trackingdata.csv files, in which each row represents a motion track, with its corresponding RC (column 1), average displacement (column 2) and track duration (column 3); (2) two representations of the radius of confinement versus average displacement assigned to each motion track: a scatter plot (Figure 4[href=https://www.wicell.org#fig4]D), and a density scatter plot (Figure 4[href=https://www.wicell.org#fig4]E) (see Scatplot.m). The scripts also generate a 3D mobility plot with x: radius of confinement, y: average displacement, z: data density as measured by scatplot.m.\nRun Two_Parameter_MSD and hit “add.” Go to the appropriate directory and open Butterfly_segments_confined.mat and confined_Low_jump_0.1.mat for the set of data to analyze. Hit “Done Selecting Files” and wait for the script to execute.\nSave the figures generated by the script under the desired format.",
    "Pause Point: Step 16 can be timely for large datasets and depending on your computing power, this can be used as a Pause point for an hour or more. For example, for 100,000 trajectories, using the minimal configuration indicated in the Computing setup section, the script can take up to 30 min to 1 h.\nNote: In our model, IMC and LMC were distinguished on the basis of the mobility of heterochromatin constituents. In fact, heterochromatin regulators bind preferentially to vLMC and LMC (Lerner et al., 2020[href=https://www.wicell.org#bib7]). IMC is bound by transcription factors and heterochromatin regulators and might be constituted by composite chromatin domains.\nNote: Boundaries in radius of confinement and average displacement chosen for each population were chosen as non-overlapping squares covering the best each mobility populations. The user can modify these limits as desired in the script.\nNote: As representing the circle best encompassing the motion track, rather than encompassing it strictly, the measurement of the radius of confinement is independent of the track duration (Lerner et al., 2020[href=https://www.wicell.org#bib7]).\nNote: For point 14., the user might also use only confined_Low_jump.mat files, in the case no butterfly tracks have been detected.\nSingle-molecule tracking analysis IV: comparison of data density respective to histone H2B\nTiming: several hours\nThis step consists in the quantitative measurement of differences between a reference two-dimensional mobility plot (e.g., histone H2B, wildtype protein, …) and the two-dimensional mobility plot of a protein of interest (e.g., transcription factor, mutant) (Figure 5[href=https://www.wicell.org#fig5]A). The trackingdata.csv files generated at the previous step are used as input for this step.",
    "The Density_Differences.m script performs the following operations: (1) measuring the local density in the different chromatin mobility populations of the two-parameter (RC and AVE) scatter plot with scatplot.m and assigning a density number to each trajectory (each individual point in the scatter plot). (2) Normalizing density values by the maximum density value for each condition (Figures 5[href=https://www.wicell.org#fig5]A and 5B). (3) Computing the density differences between the protein of interest (any Chromatin-Binding Protein) and the reference (Figure 5[href=https://www.wicell.org#fig5]B), by subtracting the average density of the five nearest points to the density of each trajectory of interest (Figure 5[href=https://www.wicell.org#fig5]B). (4) Multiplying the result by −1 for intuitiveness: in each chromatin mobility population, positive and negative values thus mean that the protein of interest is more or less dense than the reference in the considered chromatin mobility domain, respectively (Figure 5[href=https://www.wicell.org#fig5]C).\nThe script generates 3 outputs plots: one individual density plot for the reference and the protein of interest, and a histogram plot displaying the average and standard error in 4 mobility population. The very high mobility population is excluded because the sparsity of the data in that region gives rise to high errors in the measurement.\nOn line 9 of the Density_differences.m script, indicate the number of trajectories to analyze. We recommend running the script on the same number of randomly downsampled data, with n ≥ 10,000.\nRun the Density_differences.m script, and first select the trackingdata.xlsx file corresponding to the reference plot (e.g., histone H2B). Then select the trackindata.xlsx file for the protein of interest.\nSave the figures under the desired format."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Microscopy",
    "Single-Molecule Assays"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}