{
  "id": 2183,
  "origin_website": "Cell",
  "title": "Targeted ablation of Lgr5-expressing intestinal stem cells in diphtheria toxin receptor-based mouse and organoid models",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPart 1: In vivo DT ablations\nIntraperitoneal injection of DT into Lgr5-2A-DTR mice\nTiming: 15 min\nThis step delivers DT into the peritoneal cavity of the mouse, enabling in vivo ablation of Lgr5-positive intestinal cells co-expressing the DT receptor. As the Lgr5-2A-DTR mouse model also allows for ablation of Lgr5-expressing cells in other tissues, we provide a suggested framework for testing and evaluating DT dosing regimens that can be applied to other tissue contexts.\nPrepare fresh DT diluted to the desired concentration in 300 μL sterile PBS per 30 g of mouse weight. Previously published DT dosages and administration regimens are listed in the following table as a starting guide:\ntable:files/protocols_protocol_1660_2.csv\nNote: If evaluating DT ablation in a new tissue of interest for the first time, perform a series of DT titrations in the range of 0.1–2.0 μg per 30 g mouse weight to determine the optimal dose that maximizes ablation efficacy while minimizing toxicity or off-target lethality effects.\nNote: DT solution is kept on ice until use.\nAspirate the DT solution into a 1.0 mL syringe with a 26G needle attached.\nWeigh each mouse prior to injection and adjust the volume of DT injected accordingly based on the mouse weight.\nCarefully restrain the mouse by holding the loose skin on its back (scruffing). Prior to injection, tilt the mouse slightly downwards head-first.\nInsert the needle into the lower right quadrant of the mouse abdomen at a 30°–45° angle.\nNote: The plunger should be drawn up slightly to check for negative pressure within the peritoneal cavity. If urine, blood, or other material is aspirated at this step, the needle may have entered the bladder, blood vessels or abdominal organs and the injection location should be adjusted.",
    "Depress the plunger slowly until the full volume of DT is injected.\nReturn the mouse to its cage and monitor it for the next 3 days [troubleshooting 1[href=https://www.wicell.org#sec7.1]].\nLgr5 expression analysis on ablated tissue\nTiming: 1 day\nThis section of the protocol evaluates the efficiency of DT ablation by comparing Lgr5 transcript levels within ablated and non-ablated intestinal tissues. Intestinal tissue is harvested from treated and untreated Lgr5-2A-DTR mice 6 h after the last round of DT administration, and subsequently processed for RNA extraction, cDNA synthesis, and RT-qPCR to assess endogenous Lgr5 levels. The changes in Lgr5 expression levels following DT ablation compared to wild-type levels provide a quantitative readout for the efficiency of DT ablation. This expression analysis can be adapted for other tissues of interest with appropriate tissue isolation and washing steps prior to RNA extraction.\nSacrifice two Lgr5-2A-DTR mice, one untreated and one having received the DT dosing regimen, by cervical dislocation or CO2 asphyxiation.\nDissect a 3–5 cm piece of duodenum from each mouse and place the tissue into a 10 cm petri dish filled with ice-cold PBS.\nFlush out the contents of the intestine using an oral gavage needle with ice-cold PBS.\nAfter washing, transfer the tissue into a 1.5 mL Eppendorf tube containing 1 mL TRIzol reagent. Pipette the solution up and down several times to thoroughly homogenize the sample.\nAdd 200 μL of chloroform to the TRIzol lysate and vortex the suspension for 10 s.\nCentrifuge the suspension at 13,500 g for 10 min at 4°C to achieve a clear separation of the upper aqueous layer containing RNA and the lower organic layer containing DNA and proteins.\nTransfer the clear aqueous upper layer into a new 1.5 mL Eppendorf tube, while discarding the lower organic layer.",
    "To the aqueous solution, add an equal volume of 70% ethanol to precipitate the RNA, and mix the solution well by pipetting up and down for 10 s.\nPerform RNA extraction according to manufacturer’s instructions from the QIAGEN RNeasy Universal Plus Mini Kit (https://www.qiagen.com/us/resources/resourcedetail?id=a8f31442-95db-4cbd-9f9d-9e6a63b4af58&lang=en[href=https://www.qiagen.com/us/resources/resourcedetail?id=a8f31442-95db-4cbd-9f9d-9e6a63b4af58&lang=en]). Elute the RNA from the column using 30 μL RNase-free water.\nPerform cDNA synthesis using random hexamer primers based on manufacturer’s instructions from the Superscript III kit (https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2FsuperscriptIII_man.pdf[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2FsuperscriptIII_man.pdf]). Add 3 μL of total RNA obtained from the previous step to each cDNA synthesis reaction.\ntable:files/protocols_protocol_1660_3.csv\nRun the Lgr5 RT-qPCR reactions in triplicate with the resulting cDNA preparation using Promega SYBR Green dye and validated Lgr5 primers from Tan et al. (2021)[href=https://www.wicell.org#bib14], following manufacturer’s instructions (https://www.promega.sg/-/media/files/resources/protocols/technical-manuals/101/gotaq-qpcr-master-mix-protocol.pdf?rev=b4a61a4c901142789c009b8d891a82c7&sc_lang=en[href=https://www.promega.sg/-/media/files/resources/protocols/technical-manuals/101/gotaq-qpcr-master-mix-protocol.pdf?rev=b4a61a4c901142789c009b8d891a82c7&sc_lang=en]) on a Quantstudio7 qPCR machine (or similar) [troubleshooting 2[href=https://www.wicell.org#sec7.3]].\ntable:files/protocols_protocol_1660_4.csv\nHistological validation of ablation efficacy\nTiming: 1 week\nThis step describes the procedures for performing standard histological analyses on formalin-fixed paraffin-embedded (FFPE) sections of isolated intestinal tissue. To complement the whole-tissue Lgr5 expression analysis described in the previous step, the effectiveness of the DT ablation strategy can be further verified by Lgr5 RNAscope staining performed on FFPE sections of ablated and non-ablated intestinal tissues isolated from Lgr5-2A-DTR mice, 6 h after administration of the final DT dose. This RNAscope protocol enables a direct evaluation of the prevalence of Lgr5 RNA transcripts within the intestinal stem cell compartment at the crypt base. At the same time, immunohistochemistry (IHC) performed against the apoptotic marker Caspase3 can reveal the presence and location of cell death occurring within the intestinal tissue following DT-mediated ablation of Lgr5-expressing cells. Due to morphological differences between the proximal and distal intestine, both qPCR and RNAscope/IHC analyses should be performed on a similar region of the tissue for a more reliable assessment of DT ablation effectiveness.",
    "Sacrifice an Lgr5-2A-DTR mouse by cervical dislocation or CO2 asphyxiation.\nDissect out the entire intestine and place it in a 10 cm ice-cold PBS-filled petri dish (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1660-Fig1.jpg\nFigure 1. Images depicting small intestine dissection procedure\n(A) Freshly dissected small intestine in ice-cold PBS in a petri dish.\n(B) Small intestine laid out on a paper towel strip after being flushed of its contents.\n(C) Small intestine spread open after being cut longitudinally.\n(D) Final assembly and folding of paper towel over the small intestine tissue just prior to PFA fixation.\nNote: All tools should be cleaned with RNaseZap prior to handling the tissue to eliminate RNases from the environment that can compromise the RNA integrity in the isolated tissue. All reagents used should also be RNase-free.\nFlush out the contents of the intestine using an oral gavage needle with ice-cold PBS.\nLay out the flushed intestine in a straight line on a C-fold towel (Figure 1[href=https://www.wicell.org#fig1]B).\nUsing a pair of dissecting scissors, cut open the intestine longitudinally and spread open the edges to flatten the tissue (Figure 1[href=https://www.wicell.org#fig1]C).\nGently scrape the tissue with a cover slip once longitudinally to remove any excess mucus or remaining contents.\nCarefully fold the C-fold towel over the tissue to flatten the tissue evenly (Figure 1[href=https://www.wicell.org#fig1]D).\nPlace the C-fold cladded intestine in 4% paraformaldehyde (PFA) in PBS and incubate for 16–24 h on the bench at 20°C–25°C.\nFollowing PFA fixation, wash the tissues three times in ice-cold PBS for 10 min each time on a shaker.\nCarefully unfold and separate the C-fold towel from the tissue. Hold one end of the intestine strip in place using a pair of curved forceps, and slowly twist the strip around the forceps to create a “swiss roll” (Figures 2[href=https://www.wicell.org#fig2]A–2C).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1660-Fig2.jpg",
    "Figure 2. Images showing procedure for preparing the small intestine tissue for histological analysis\n(A) Partially rolled tissue, highlighting the flattened strip of tissue following PFA fixation in C-fold towel.\n(B) Fully-rolled tissue in a petri dish.\n(C) Close-up view of the “swiss roll” from the fully-rolled tissue.\nTransfer the rolled-up tissues into tissue cassettes and leave them submerged in 70% ethanol at 4°C for at least 16 h.\nPause point: Cassettes can be left in 70% ethanol for up to a week before dehydration.\nThe next day, dehydrate the tissues by placing the cassettes sequentially in a new 70% ethanol solution, two separate 95% ethanol solutions, and two separate 100% ethanol solutions. Leave the cassettes shaking for 1 h at 4°C in each solution.\nPlace the cassettes in two separate xylene solutions for 1 h at 20°C–25°C each time, before transferring them into paraffin at 65°C for at least 16 h.\nThe following day, transfer the cassettes into a new container of paraffin and keep them submerged for 1 h at 65°C.\nEmbed the tissues in paraffin within plastic molds and leave the paraffin blocks on a cool plate for at least 1 h to fully set.\nPause point: Paraffin tissue blocks can be stored for months (except for RNAscope protocols).\nTrim and section the paraffin blocks to obtain 7 μm tissue sections. Collect the tissue sections on glass slides and leave the slides at 20°C–25°C for at least 5 h to air dry.\nPause point: Slides can be stored for months before staining (except for RNAscope protocols).\nAfter step 34, slides can be used for RNAscope:",
    "Perform the RNAscope 2.5 High-Definition Brown Assay according to manufacturer’s instructions (https://acdbio.com/system/files_force/322310-QKG%20RNAscope%202.5%20HD%20Brown.pdf?download=1[href=https://acdbio.com/system/files_force/322310-QKG%20RNAscope%202.5%20HD%20Brown.pdf?download=1]), using the Mm-Lgr5 probe to detect Lgr5 transcripts, and the Mm-Ppib and DapB RNAscope probes as positive and negative controls respectively [troubleshooting 3[href=https://www.wicell.org#sec7.5]].\nAfter step 34, Caspase3 staining can also be performed in parallel on a separate set of tissue sections following standard immunohistochemistry protocols as described below:\nSlot the slides into a slide rack and leave them baking in an oven set to 60°C for 10 min.\nDeparaffinate the slides by dipping them sequentially in two separate xylene solutions, two separate 100% ethanol solutions, and two separate 70% ethanol solutions for 3 min each time.\nTransfer the slides into a large container filled with running tap water and leave them submerged for 10 min.\nAfter washing, transfer the slides into 80 mL of 1× pH9 Target Retrieval Solution diluted with distilled water at 20°C–25°C, then perform antigen retrieval in a pressure cooker heated to 121°C for 30 min.\nFollowing antigen retrieval, leave the slides to cool to 20°C–25°C within the pressure cooker before placing on ice for 30 min.\nWash the slides by submerging them in running tap water for 10 min followed by PBS on a laboratory platform shaker for 5 min.\nTo block endogenous peroxidase activity, place the slides within a solution of 20 mL hydrogen peroxide diluted in 180 mL PBS and leave them shaking on a laboratory platform shaker for 20 min.\nWash the slides again by submerging them in running tap water for 10 min followed by PBS on a laboratory platform shaker for 5 min.\nRemove each slide from the PBS and flick them strongly several times to remove excess water clinging to the tissue.",
    "Using a liquid blocker wax pen, draw a hydrophobic barrier around the boundary of each tissue section, with care taken to avoid drawing across the tissue.\nImmediately add 2–3 drops of CAS-block to the tissue.\nNote: The entire tissue should be covered in CAS-block; if some areas are exposed, use a pipette tip to gently spread the solution across the exposed areas of the tissue.\nPlace the slides in a dark box for 1.5 h on the bench at 20°C–25°C.\nDuring the incubation with CAS-block, prepare the Caspase3 primary antibody mix by diluting the antibody in 2% BSA at a concentration of 1:200.\nAfter the CAS-block incubation, tap off the CAS-block from each slide and immediately add 2–3 drops of primary antibody mix to each tissue section. As before, all parts of the tissue should be covered with the antibody solution.\nPlace the slides in a dark box at 4°C for 16–24 h.\nThe next day, wash the slides three times in PBS on a laboratory platform shaker for 10 min each time.\nRemove each slide from the PBS and flick them strongly several times to remove excess water clinging to the tissue.\nImmediately add 2–3 drops of rabbit EnVision+ secondary antibody to the tissue. As before, all parts of the tissue should be covered with the antibody solution.\nPlace the slides in a dark box for 1 h on the bench at 20°C–25°C.\nFollowing the secondary antibody incubation, wash the slides three times in PBS on a laboratory platform shaker for 10 min each time.\nAdd 1 drop of DAB+ chromogen to 2 mL of DAB+ substrate buffer and invert the solution several times to mix well.\nNote: DAB is carcinogenic and should be handled with care following standard laboratory safety protocols.",
    "Add 2–3 drops of DAB solution to the tissue for 3 min or until sufficient brown coloration has developed [troubleshooting 4[href=https://www.wicell.org#sec7.7]].\nTap off the DAB solution from the slide to stop the reaction.\nPerform counterstaining by placing the slides in Mayer’s hematoxylin for 5 min, washing in running water for 5 min, then Methylene blue for 5 min, and washing again in running water for 5 min.\nDehydrate the slides by dipping them successively in two separate 70% ethanol solutions, two separate 100% ethanol solutions, and two separate xylene solutions, leaving them for 3 min each time.\nTo complete the IHC protocol, mount the slides with a cover slip and mounting media suitable for brightfield microscopy and leave them to dry in a fume hood for at least 2 h.\nHistological analysis of phenotypic changes in ablated tissue\nTiming: 1 week\nThis step describes methods for evaluating phenotypic changes in the intestinal epithelium following DT-mediated ablation of the Lgr5-expressing stem cell compartment. Hematoxylin and eosin (H&E) staining enables the visualization of large-scale disruptions in tissue architecture following ablation, while IHC performed against proliferation (Ki67) and lineage (Lysozyme, Chromogranin A and Muc2 labeling Paneth, enteroendocrine and goblet cells respectively) markers and RNAscope against Alpi (enterocyte marker) can offer insights into specific changes in the turnover pattern and cellular lineage composition within these ablated intestinal glands. These methods can also generally be adapted to other tissues of interest.\nContinuing from step 34 of the previous section, slides can be used for H&E staining based on the following protocol:\nSlot the slides into a slide rack and leave them baking in an oven set to 60°C for 10 min.",
    "Deparaffinate the slides by dipping them sequentially in two separate xylene solutions, two separate 100% ethanol solutions, and two separate 70% ethanol solutions for 3 min each time.\nTransfer the slides into a large container filled with running tap water and leave them submerged for 10 min.\nPerform the staining by placing the slides in the following solutions:\n  Richard Allan Hematoxylin for 5 min.\n  Running water for 1 min.\n  Acid alcohol for 30 s.\n  Running water for 1 min.\n  Scott’s blue for 3 min.\n  Running water for 1 min.\n  Eosin for 10 s.\n  Running water for 1 min.\nDehydrate the slides by dipping them successively in two separate 70% ethanol solutions, two separate 100% ethanol solutions, and two separate xylene solutions, leaving them for 3 min each time.\nTo complete the H&E protocol, mount the slides with a cover slip and mounting media suitable for brightfield microscopy and leave them to dry in a fume hood for at least 2 h.\nFollowing step 34 of the previous section, slides can be used for IHC against proliferation and lineage markers, with the following changes to the earlier described protocol:\nAt step 39, use the pH6 Target Retrieval Solution for slides to be stained with Ki67 antibody.\nAt step 48, prepare the Ki67, Lysozyme, and Chga antibodies at a dilution of 1:200.\nAt step 53, use the mouse EnVision+ secondary antibody against the mouse anti-ChgA.\nFollowing step 34 of the previous section, slides can also be used for RNAscope against Alpi, following manufacturer’s instructions.\nPart 2: In vitro DT ablations\nEstablishment of Lgr5-2A-DTR murine intestinal organoid cultures\nTiming: 2 h\nThis section of the protocol describes steps taken to generate intestinal epithelial organoids from Lgr5-2A-DTR and wild-type mice.",
    "1 day prior to the start of the experiment, thaw Matrigel on ice in a 4°C fridge for at least 12–16 h.\nSacrifice a Lgr5-2A-DTR and a wild-type mouse by cervical dislocation or CO2 asphyxiation.\nDissect out the duodenum from each mouse and collect the tissues in a 10 cm petri dish containing ice-cold PBS (without Mg2+ and Ca2+).\nFlush out the contents of the duodenum using ice-cold PBS (without Mg2+ and Ca2+) with an oral gavage needle.\nCut the duodenum longitudinally with a pair of dissecting scissors and spread open the tissue on the lid of the petri dish with the lumen side up.\nGently scrape the tissue with a cover slip once longitudinally to remove any excess mucus or remaining contents.\nTransfer the tissue into a 50 mL Falcon tube containing 50 mL ice-cold 2 mM EDTA in PBS (without Mg2+ and Ca2+) and leave shaking on a rolling platform at 4°C for 45 min, to achieve efficient tissue dissociation into epithelial fragments that include crypts housing the intestinal stem cells.\nFollowing incubation, transfer the epithelial fragments into a new 50 mL Falcon tube containing 10 mL PBS (without Mg2+ and Ca2+) and shake the tube vigorously 20 times. This tube is retained as Fraction 1.\nTransfer the remaining tissue to a second 50 mL Falcon tube containing 10 mL PBS (without Mg2+ and Ca2+) and shake it vigorously 20 times. This tube is labeled as Fraction 2.\nPipette 10 μL of crypt suspension from each fraction into a glass slide and assess the quality of each fraction under the microscope. The fraction with a higher number of complete intestinal crypts with intact crypt bases is selected as the higher quality fraction with greater potential for organoid formation (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1660-Fig3.jpg",
    "Figure 3. Examples of intestinal crypt suspension fractions as seen under a 10× objective of a standard brightfield microscope\nWhole crypts present in each fraction are highlighted by the red arrows. Scale bars represent 400 μm.\nFilter the higher quality fraction through a 70 μm cell strainer into a new 50 mL Falcon tube.\nPipette 10 μL of the filtered crypt suspension into a hemocytometer and manually count the number of crypts under a light microscope.\nTransfer an appropriate volume of crypt suspension into 1.5 mL protein LoBind tubes to obtain approximately 150 crypts per well of a 48-well plate. This can be adapted for other plate sizes:\ntable:files/protocols_protocol_1660_5.csv\nSpin the tubes in a microcentrifuge at 350 g for 5 min.\nCarefully remove and discard the supernatant. Resuspend the remaining pellet in an appropriate amount of Matrigel sufficient to form a 50 μL drop per well.\nAdd 50 μL crypt-Matrigel suspension to the center of each well of a pre-warmed 48-well culture plate. Place the plate in a tissue culture incubator set to 37°C, 5% CO2 for at least 5 min for the suspension to set.\nOnce the Matrigel has solidified, add 300 μL of Intesticult Organoid Growth Medium (OGM) to each well and leave the cultures to grow in a tissue culture incubator set to 37°C with 5% CO2.\nDT administration during initiation phase of intestinal organoid establishment\nTiming: 30 min\nThis step ablates Lgr5-expressing intestinal stem cells present in dissociated intestinal crypts at the point of plating, under culture conditions supporting organoid outgrowth. Wild-type intestinal crypts are plated under identical conditions in the presence of DT to account for non-specific effects of the DT toxin on organoid outgrowth. This in vitro ablation strategy allows for an assessment of the requirement of Lgr5-expressing cells during the organoid initiation phase.",
    "Resuspend dissociated Lgr5-2A-DTR or wild-type intestinal crypts with Matrigel at a ratio of 150 crypts per 50 μL Matrigel and plate them into pre-warmed 48-well culture plates, as described in the earlier section.\nOnce the Matrigel suspension has set, add 300 μL of Intesticult OGM only or 300 μL of Intesticult OGM with a final concentration of 0.05 μg/mL DT to each organoid culture well [troubleshooting 5[href=https://www.wicell.org#sec7.9]]. At least three wells per condition are required as technical replicates in each experiment.\nNote: For culture plates of other sizes, the volume of media added can be adjusted as follows:\ntable:files/protocols_protocol_1660_6.csv\nLeave the organoid cultures to grow in a standard tissue culture incubator set to 37°C and 5% CO2.\nAfter 5 days of culture, manually count the number of organoids that have grown out in each well under a light microscope and tabulate the data accordingly (Table 1[href=https://www.wicell.org#tbl1]).\ntable:files/protocols_protocol_1660_7.csv\nDT administration to propagating intestinal organoid cultures\nTiming: 15 min\nThis step ablates Lgr5-expressing intestinal stem cells within propagating intestinal organoids in culture. Dissociated intestinal crypts are initially plated in the absence of DT under culture conditions supporting organoid outgrowth, and DT is subsequently administered to the established organoids. This strategy assesses the requirement of Lgr5-expressing cells for sustaining the propagation of established organoids.\nUsing an established Lgr5-2A-DTR and a wild-type intestinal organoid culture (typically 5 days after plating), manually count the number of organoids present in each well under a light microscope and the data tabulated accordingly (Table 2[href=https://www.wicell.org#tbl2]).\ntable:files/protocols_protocol_1660_8.csv\nRemove the culture media in each well.\nAdd 300 μL of fresh Intesticult OGM only or 300 μL of fresh Intesticult OGM with 0.6 μg/mL DT to each organoid culture well [troubleshooting 5[href=https://www.wicell.org#sec7.9]]. At least three wells per condition are required as technical replicates in each experiment.",
    "Monitor the organoids daily. After 1/2/3 days post-DT administration, manually count the number of organoids in each well under a light microscope and tabulate the results accordingly (Table 2[href=https://www.wicell.org#tbl2]).\nNote: Organoid counts over multiple timepoints can also be tabulated to quantify the dynamics of sustained DT ablation in the intestinal organoid cultures over time."
  ],
  "subjectAreas": [
    "Organoids",
    "Stem Cells"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}