{
  "id": 2461,
  "origin_website": "Cell",
  "title": "Protocol for assessing translational regulation in mammalian cell lines by OP-Puro labeling",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCell plating\nTiming: 2 h\nTranslation is sensitive to cell confluence. Overconfluent cells may have less active cellular translation. Plate cells at least one day before OP-Puro labeling at a density that will reach 80% confluence on the day of OP-Puro labeling. We recommend that you test and determine the optimal plating density for your cell line of interest.\nFor cell cytometry experiments, plate the cells in a 12-well plate at optimal density that will reach 80% confluence on the day of OP-Puro labeling. We recommend a plating density of 2–4 × 105 cells per well for HEK293T cells.\nCritical: Avoid over confluence on the day of labeling, which may inhibit translation.\nCritical: Supply sufficient culture medium. We usually use 2 mL medium supplemented with 10% FBS for a 12-well format. More medium might be required for prolonged culture times or different cell lines for active cell proliferation.\nNote: For confocal microscopy, we plate cells on coverslips in a 12-well plate. Polylysine-coated coverslips can improve the growth and adhesion of some cell lines (e.g., HEK293T).\nNote: Plate three extra wells for controls: 1) no OP-Puro, 2) OP-Puro but no treatment/transfection/infection (positive control), 3) OP-Puro treated with the translation inhibitor CHX-which serves as a negative control. The controls 1) and 2) are required for data normalization (see quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis]) and 3) for internal control.\nOptional: For drug treatment and viral infection, cells are plated at a desired density according to the experiment timelines. For example, for doxycycline-inducible cell lines, we plate the cells at 20% confluence at 24 h before doxycycline induction, and then induce cells with doxycycline for 24 h before OP-Puro labeling.\nOP-Puro labeling\nTiming: 2 h",
    "During the OP-Puro labeling step, cells are treated with sufficient medium supplemented with OP-Puro to label newly synthesized proteins. This step introduces a “clickable” alkynyl group into newly synthesized proteins for azide-conjugated fluorophore labeling by click chemistry reaction.\nNote: The section for the OP-Puro labeling applies to both confocal microscopy and flow cytometry.\nNote: In addition to treatments of interest, we recommend three controls a) no OP-Puro, b) OP-Puro but no treatment/transfection/infection, and c) OP-Puro and the translation inhibitor CHX.\nFor CHX-treated control well c, add CHX to medium at a final concentration of 50 μg/mL (1:1,000 dilution). Incubate for 15 min at 37°C in a tissue culture incubator.\nAspirate media and add 400 μL of pre-warmed cell culture medium (no OP-Puro) to control well a, 400 μL of OP-Puro labeling medium supplemented with 0.4 μL of CHX stock solution (50 μg/mL) to CHX-treated control well c and 400 μL of OP-Puro labeling medium to the remaining wells. Incubate for 1 h at 37°C in a tissue culture incubator. For 12-well plates, the labeling medium is freshly prepared by adding 10 μL of OP-Puro stock solution (20 mM) to 4 mL culture medium.\nNote: Cell culture medium should be pre-warmed at 37°C before adding to cells because temperature changes affect protein expression. One hour of OP-Puro incubation is generally sufficient. However, the optimal incubation time for a specific cell line can be determined empirically (0.5–2 h).\nNote: The range of OP-Puro concentration can be between 2-50 μM. The optimal OP-Puro concentration for a specific cell line should be determined empirically.\nCritical: Cell monolayer should be covered with sufficient labeling medium. We recommend using at least 350 μL for 12-well plate.\nProceed to fixation, permeabilization and click chemistry reaction procedures specific for confocal (steps 4–14) or for flow cytometry (steps 15–23).",
    "Fixation, permeabilization and click chemistry reaction (for confocal microscopy)\nTiming: 2 h\nAfter OP-Puro labeling, the cells on coverslips are fixed and permeabilized, followed by click chemistry reaction with an azide-conjugated fluorophore. These steps are performed in a 12-well plate.\nAspirate medium and wash cells with ice-cold 1× PBS.\nFix cells with 500 μL of 1% formaldehyde in 1× PBS for 15 min on ice.\nNote: Formaldehyde is highly toxic. Always work in a chemical fume hood with proper personal protective equipment and follow safety measures when handling formaldehyde.\nWash cells with 1 mL of 1× PBS.\nPermeabilize cells in 500 μL of Permeabilization buffer for 5 min at room temperature.\nAspirate Permeabilization buffer.\nCritical: The saponin-based permeabilization can be reversible. AVOID washing cells before adding click chemistry reaction solution.\nAdd 500 μL of click chemistry reaction solution. Incubate for 30 min at room temperature in the dark. Apply this step to all the samples, including no OP-Puro and CHX-treated control samples.\nWash cells with 500 μL of Permeabilization buffer three times.\nWash cells with 500 μL of 1× PBS.\nIncubate cells with 500 μL of Hoechst 33342 (10 μg/mL) in 1× PBS for 10 min.\nWash cells with 500 μL of 1× PBS.\nMount coverslips on glass microscope slides using ProLong Gold Anti-Fade Reagent. Slides are cured overnight at room temperature before confocal microscopy analysis.\nAlternatives: Conventional immunofluorescence staining for proteins of interest can be performed after OP-Puro labeling (step 11). Given that cells are permeabilized by saponin, which only permeabilizes the plasma membrane, additional permeabilization with harsher detergent might be required for some purposes.\nFixation, permeabilization and click chemistry reaction (for flow cytometry)\nTiming: 2 h\nAfter OP-Puro labeling, the cells are fixed and permeabilized in microcentrifuge tubes, followed by click chemistry reaction with an azide-conjugated fluorophore.",
    "Note: In this section, cells are centrifuged for 5 min at 1,000 g at 4°C to collect cell pellets.\nAspirate media and wash cells with 1× PBS.\nHarvest cells into 1.5 mL microcentrifuge tubes by trypsinization with trypsin/EDTA solution. Centrifuge and discard the supernatant.\nFor HEK293T cells, trypsinization is not required as the cells are readily detached by pipetting up and down in 1× PBS.\nWash cells with ice-cold 1× PBS. Centrifuge and discard supernatant.\nFix cells with 500 μL of 1% formaldehyde in 1× PBS for 15 min on ice. Centrifuge and discard supernatant.\nNote: Formaldehyde is highly toxic. Always work in a chemical fume hood with proper personal protective equipment and follow safety measures when handling formaldehyde.\nWash cells with 1 mL of 1× PBS. Centrifuge and discard supernatant carefully.\nPermeabilize cells in 500 μL of Permeabilization buffer for 5 min at room temperature. Centrifuge and carefully discard supernatant.\nCritical: The saponin-based permeabilization is reversible. AVOID washing the cells before adding click chemistry reaction solution.\nResuspend cells in 500 μL of click chemistry reaction solution for 30 min at room temperature in the dark. Apply this step to all the samples, including the no OP-Puro and CHX-treated control samples. Centrifuge and carefully discard supernatant.\nWash cells with 500 μL of Permeabilization buffer three times. Centrifuge and carefully discard supernatant.\nResuspend cells in 200 μL of FACS buffer and leave on ice in the dark. The samples are ready for flow cytometry analysis."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Gene Expression",
    "Cell Biology",
    "Molecular/Chemical Probes"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}