{
  "id": 8523,
  "origin_website": "Jove",
  "title": "Anti-RDL and Anti-mGlutR1 Receptors Antibody Testing in Honeybee Brain Sections using CRISPR-Cas9",
  "procedures": [
    "The protocol described here follows the animal care guidelines of Arizona State University.\n1. Total Protein Isolation from Brains of Apis mellifera\nNOTE: Use Apis mellifera New World Carniolan foragers of unknown age for this experiment.\nPlace an aluminum mesh screen over the entrance to the hive to capture forager bees17. Capture each bee in a vial with a small hole in each cap. Place the vials containing the bees in ice to lower their body temperature and immobilize them. Leave the bees in ice for no more than 3 min.\nSecure the immobilized bees into previously prepared metal holders. Ensure that the metal holders are constructed so that the bee can be secured with small pieces of duct tape, but still have its back thorax, wings, and head exposed.\n\tCAUTION: Ensure that the bees are fully immobilized before attempting to place them in the holders.\nFeed the bees with a 1 M sucrose solution using a 5 mL syringe until they are no longer hungry. Place the secured bees in a box with a wet paper towel to ensure a humid environment.\nDissect the bee's brain rapidly by cutting off the head with Barraquer Iris scissors (see Table of Materials) and use the scissors to open the head from the front.\nCut off the brain from the head capsule, take the brain with #5 forceps, and place it in 100 μL of cold (4-8 °C) lysis buffer. The lysis buffer consists of 120 mM Tris-HCl, 2% sodium dodecyl sulfate (SDS), 5% glycerol, 0.2 mM dithiothreitol, 1% Triton X-100, and 1-5 µg/mL of the protease inhibitors PMSF (phenylmethylsulphonylfluoride), aprotinin, benzamidine (pH 6.8) at 4 °C. Homogenize the brain in the lysis solution by turning in a pestle for about 2 min.",
    "Centrifuge the sample at 12,000 x g for 20 min. Aspirate 90 μL of the supernatant and discard the pellet.\nTake 1 μL of the supernatant to quantitate the total protein using a fluorimeter. The approximate concentration of the total protein was between 2-3 mg/mL per bee. Take 10 μL of the supernatant and add 10 μL of the lysis buffer and 10 μL of a 6x Laemmli buffer18. Spin briefly and boil for 3 min, then cool down on ice. Spin for 1 min at 10,000 x g to remove all debris. One tenth of a bee brain contains approximately 25 ng of total protein.\n2. Western Blotting19\nMake 30 mL of 10% running gel containing 12.15 mL of ultrapure distilled water, 7.5 mL of 1.5 M Tris-HCl (pH 8.8), 0.3 mL of 10% SDS, 10 mL of 30% acrylamide-bis acrylamide solution, 0.15 mL of 10% ammonium persulfate (APS), and 20 μL of tetramethylethylenediamine (TEMED).\nCast the gel between two glass plates separated by spacers.\nMake a 20 mL stacking gel containing 12.1 mL of ultrapure distilled water, 5.0 mL of 0.5 M Tris-HCl (pH 6.8), 0.2 mL of 10% SDS, 2.6 mL of acryl-bis acrylamide, 0.1 mL of 10% APS, and 20 μL of TEMED.\nWhen the running gel solidifies pour a stacking gel. Carefully add the plastic separator to cast the loading lane, avoiding bubbles. Wait 15-30 min, until the gel is solidified.",
    "Start loading the gel using 5 μL of protein standards. Load 20 μL of the lysate mixture from step 1.8 per lane, corresponding to ~1/15 of a bee brain or ~16 ng of total protein per lane. Run the samples for 3.5-4 h total at 16 mA in the stacking gel and 32 mA in the running gel. Stop when the dye leaves the gel.\nTransfer the proteins onto nitrocellulose membranes in transfer buffer (25 mM Tris-HCl, 192 mM glycine, 15% methanol) at 0.45 mA for 1 h 30 min at 4 °C.\n\t\nTo evaluate the efficiency of the protein transfer following SDS-PAGE before immunoblotting, add Ponceau S staining solution (add 0.1 g of Ponceau S and 5 mL of acetic acid to water to a final volume of 100 mL). Store at 4 °C for 1 min and rinse rapidly with distilled water.\nLabel each lane with a ballpoint pen, cut the membrane containing two lanes with brain homogenate and one lane with protein marker and place each in a Western blot incubating box. Wash 3x for 5 min each in phosphate buffered saline (PBS) containing 0.1% Tween 20 (PBS-Tw).\nBlock the membrane with 10% NGS (1 mL of normal goat serum to 10 mL of PBS-Tw) in a Western blot incubating box for 1 h. Make an anti-mGlutR1 dilution (5 μL of antibody in 10 mL of 10% NGS). Make anti-RDL1 and anti-RDL2 dilutions (5 μL of antibody in 10 mL of 10% NGS each). Replace the blocking solution in each box with the diluted antibodies and leave overnight (16-24 h) at 4 °C.",
    "Wash the membrane 3x for 5 min each in PBS-Tw. Incubate the membrane with anti-rabbit IgG HRP-conjugated secondary antibodies at 1:10,000 in 10% NGS PBS-Tw for 2 h at room temperature (RT). Wash membranes 3x in PBS-Tw, then 1x in PBS.\nDetect the bands using western chemiluminescent HRP substrate. Mix two substrates 1:1 (v/v) at RT, put all membranes in the same box and cover them with the substrate mix for 2 min (in a dark room with a red light) at RT. Proceed to protein detection using an autoradiography film with several exposure times. Usually one antibody is tested on one membrane containing the same dilution of brain homogenate on two or three lanes and one lane with the weight marker.\n3. Immunocytochemical Procedures\nTo dissect honeybee brains for immunocytochemistry, immobilize the honeybees in ice for 30 s. After the bees are immobilized, decapitate the bee with scissors and place the head in a solution of 4% paraformaldehyde in PBS. Work under the fume hood.\n\tCAUTION: The body must be carefully disposed of because the abdomen can still sting after decapitation.\nCarefully but rapidly remove the antennae, compound eyes, and cut all around the top exoskeleton with Barraquer Iris scissors. Allow the heads to sit in the fixative solution for 10 min. Remove the rest of the exoskeleton of the head and cut all remaining tracheae.\nPlace each brain in a 1.5 mL microcentrifuge tube containing at least 1 mL of 4% paraformaldehyde solution and leave overnight at 4-8 °C.\nMake a 7.6% agarose solution by mixing 3.8 g of agarose and 50 mL of distilled water in an Erlenmeyer flask. Microwave the solution until the agarose liquifies.",
    "NOTE: A small piece of tissue paper can be placed in the opening of the flask in order to prevent the agarose solution from overflowing during heating.\nPlace the fixed honeybee brains (3-4 brains) in a 35 mm Petri dish and remove the excess fixative with tissue paper. Pour the liquid agarose solution over the brains. Orient the brains in the agarose so that the antenna lobes are facing up. Allow the agarose to cool and solidify.\nAfter the agarose has solidified, cut out blocks of agarose each containing a brain.\nFor vibratome sectioning, prepare a 24 well plate with each well containing a basket with a hydrophobic mesh at the bottom. Fill each well with 600 µL of PBS.\nCut each block into 70 µm cross sections using the vibratome machine and place the sections in the basket containing PBS.\n\tNOTE: Ensure that sections from the same brain are placed in the same basket.\nWash the brain sections 6x for 10 min each with PBS-TX to ensure that no fixative remains in the sections. Place the multiwell plate on an orbital shaker and wash the brains at 210 rpm. Before each wash be sure to replace the PBS-TX solution with fresh PBS-TX solution. Block with 1% normal donkey serum during the last wash.\nTo test the anti-mGlutR1 primary antibody, prepare a 1:112 dilution of anti-mGlutR1 antibodies by adding 9 mL of PBS-TX to 80 µL of anti-mGlutR1 antibodies in a 15 mL centrifuge tube. Vortex the tube briefly to mix thoroughly. The working dilution of antibodies was determined in preliminary experiments.",
    "To test the anti-RDL primary antibody, prepare a 1:100 dilution of anti-RDL antibodies by adding 30 µL of anti-RDL peptide 1, 30 µL of anti-RDL peptide 2, and 6 mL of PBS-TX in a 15 mL centrifuge tube. Vortex the tube briefly to mix thoroughly. The working dilution of antibodies was determined in preliminary experiments.\nAdd 800 µL of antibody solution to each well in the plate. Cover the multiwell plate and wrap it in aluminum foil to prevent degradation from light exposure. Place the plate wrapped in aluminum foil on an orbital shaker and shake at 210 rpm for 2 h. Then leave overnight at RT without shaking.\nAfter the brain sections have been left overnight, wash with PBS-TX for 10 min. Repeat the washing step 6x.\nPrepare the secondary antibodies (anti-rabbit from donkey) by making a 1:225 dilution of secondary antibodies by adding 40 µL of secondary antibodies to 9 mL of PBS-TX.\nAdd 800 µL of the secondary antibody dilution to each well. Cover the plate and wrap it in aluminum foil. Place the plate wrapped in aluminum foil on the orbital shaker and shake at 210 rpm for 2 h. Then leave it overnight at RT.\nWash the brain sections 3x for 10 min each with PBS-TX and 3x with regular PBS solution.\nFor embedding the sections in the slides, prepare the mounting media/glycerol embedding solution modified from Rodriguez et al.20. Add 5 g of the mounting medium in 20 mL PBS and stir for 16 h with a magnetic stirrer. Add 10 mL of glycerol and stir for another 16 h with a magnetic stirrer. Centrifuge for 15 min at 4,000 x g, take the liquid homogenous supernatant, and aliquot in 1 mL tubes. Keep at -20 °C",
    "Embed the sections onto the slides with a drop of the mounting medium prepared in step 3.17, making sure that each slide contains sections from one brain.\nPreadsorption control of immunostaining with conjugated peptides\n\t\nFor anti-RDL and conjugated peptides, incubate the working dilution of anti-RDL antibodies with the corresponding peptide conjugate overnight at RT on shaker: condition 1) 500 μg peptide conjugated with Keyhole Limpet Hemocyanin (KLH) via glutaraldehyde; condition 2) without any conjugate.\nCentrifuge each mixture for 10 min at 10,000 x g and collect the supernatant from both conditions (step 3.19.1).\nIncubate the serial sections of honeybee brain with each supernatant and process with the secondary antibodies described above. Serial sections are sections that follow each other during the vibratome sectioning procedures, so the same part of the brain will be exposed to positive and negative controls.\nFor anti-mGlutR1 and conjugated peptide, incubate the working dilution of anti-mGlutR1 antibodies at RT with the KLH conjugated peptide containing the 10-4 M peptide (condition 1) and without any conjugate (condition 2).\nCentrifuge each mixture for 10 min at 10,000 x g and collect the supernatant from both controls.\nIncubate the serial sections of honeybee brain with supernatant from both conditions and process with the secondary antibodies (steps 3.14-3.15).\nEmbed sections from both conditions onto the slide using embedding media (step 3.17).\n4. Test of RDL and mGlutR1 Protein Expression by Immunocytochemistry (section 3) in Honeybee Brain After Injection of the Corresponding CRISPR-Cas9 System\nDesign the guides using an online CRISPR-Cas9 design tool21 using the genomic DNA sequences of AmRdl (XM_006565102.3) and sequences of mGlutR1 (XM_006566244.3) (Table 1). Order as Cas9 crRNA and Cas-9 tracrRNA with the fluorescent dye ATTO550 at the 5' end. Order the Cas9 Nuclease V3 (See Table of Materials).",
    "Prepare the components for the CRISPR-Cas 9 system by making a 100 µM stock of each guide crRNA and tracrRNA using nuclease-free water. Aliquot and store at -20 °C. Prepare the working concentration of Cas-9 solution by adding 2.5 µL of Cas 9 nuclease V3 (10 mg/mL) to 47.5 µL of nucleotide free buffer to obtain a final concentration of 0.5 µg/µL. Make gRNA and RNP for injection.\nPrepare gRNA complex formation for each guide RNA separately (guideRNA:tracrRNAATTO550)\n\t\nLabel a test tube with the name of the gRNA, add 92 µL of nucleotide free buffer, 4 µL of 100 µM CRISPR-Cas9 tracrRNA- 5'ATTO550, and 4 µL of the guide crRNA solution. Mix gently and spin.\n\t\tNOTE: Example of labeling of gRNA tubes for RDL: GRDL1, GRDL2, GRDL3 (corresponding to RDL guides RNA in Table 1). Example of labeling of gRNA tubes for mGlutR1: GMGL1, GMGL2, GMGL3 (Table 1).\nHeat the solution to 95 °C for 5 min to create gRNA. Cool the mixture at RT for 10 min.\nPrepare RNP complex formation (gRNA: S.p Cas9Nuclease), delivery mixtures, and control.\n\t\nLabel a test tube with the name of the RNP, add 6 µL of gRNA solution and 6 µL of 0.5 µg/µL S.p Cas9 Nuclease V3. Mix gently and incubate the solutions at 37 °C for 10 min before injection.\n\t\tNOTE: Example of RNP tube labels: RRDL1, RRDL2, RRDL3.\nMake a RNPRDLmix. To prepare the final mixture used for injections, add 4 µL of each RNP from RDL together. RNP/RDL mix = 4 µL RRDL1 + 4 µL RRDL + 4 µL RRDL3.\nMake a RNPmGlutR1mix. Mix 4 µL of each RNP from mGlutR1 together to prepare the final mixture used for injections (RNPmGlutR1mix) = 4 µL RMG1 + 4 µL RMG2 + 4 µL RMG3.",
    "NOTE: Example of RNP tube labels: RMG1, RMG2, RMG3.\nMake a control noguideRNA solution by mixing 4 µL of tracrRNA, 92 µL of buffer, and 4 µL of water instead of guideRNA (see section 4.3). Mix 6 µL of this noguideRNA solution and 6 µL of 0.5 µg/µL Cas9 Nuclease V3 (step 4.4.1) to produce the control injection solution.\n5. Injection Procedure\nImmobilize each bee as described in step 1.3 and feed them as in step 1.4. Next, prepare two sets of two wooden boxes to release the bees into after injection: a white box (experimental condition) and a black box (control). Each box should contain a small comb and a feeding Petri dish. One side of each box is made of glass to allow for observation.\n\t\nMake feeding Petri dishes. Take the cover of a 35 mm Petri dish, place wax inside of the surface, and place the bottom part of the Petri dish on the wax. Secure the plate into the box.\nUsing a 5 mL syringe, inject 1M sucrose solution between the cover and the bottom part of the dish. Bees can quickly put their proboscises between the two plates and will stay dry for a 48 h incubation period. Put one dish in each box.\nTo prepare the microinjection system, fill the capillaries with mineral oil without any air bubbles. Place the capillaries in the injector holder of the microinjection system. To load the capillary with the desired injection solution, place a hydrophobic film on a flat surface, and pipette the solution onto it. Inject the oil from the capillaries and replace the mixture with the corresponding RNP mix.\nUsing the microinjection system, inject 345 nL of RNP mixture solution directly into each bee's median ocelli.",
    "For RDL-CRISPR-Cas9 injection, inject eight bees with the RNPRDLmix prepared as described in step 4.4.2. Feed them 1M sucrose after the injection. Release them in the white (experimental) box with the small comb and feeding Petri dish for 48 h. Use another eight bees as controls without any injections, feed them, and release them in the black (control) box.\nFor mGlutR1 CRISPR-Cas9, inject nine bees with the RNPmGlutR1mix prepared as described in step 4.4.3. For control inject eight bees with RNA mixture without guide (RNAmix_noguide) prepared as described in step 4.4.4. Feed them 1M sucrose after the injection. Release bees from their holders into the white box (experimental condition) or the black box (control) prepared as described in section 5.1.\nPlace the boxes in a polystyrene container with wet paper inside for humidity. Leave bees for 48 h and observe 2x per day to ensure that they have enough food and good humidity.\nDissect the brain of each bee after 48 h (step 3.1) and process for immunocytochemistry as described in section 3. For anti-mGlutR1 immunostainings use step 3.11 and for anti-RDL immunostainings use step 3.12.\nPerform confocal imaging to evaluate the level of fluorescence in the immune-stained brain sections.\nTo evaluate the reduction of protein in immunolabeled brains, use confocal image collection at the same level of gain for both control and injected brains.\n6. qPCR-based Drop-off Assay to Evaluate the Modified Genomic RDL DNA 48 H After CRISPR Cas9 RNPRDLmix Injection\nDesign the primers, control probe, and drop-off probe to evaluate the amount of DNA modified by CRISPR-Cas9 injection. Each primer is designed so that it flanks at least one CRISPR-Cas 9 guide and the amplicon size is 132 bp. The primers and probes used are given below:\n\tRDL1_For: CTCGGAGTGACCACCGT\n\tRDL1_Rev: CAACGAGGCGAACACCAT\n\tRDL1_control_probe: /5HEX/CGA+C+G+TTT+A+C+CT/3IABkFQ/\n\tRDL1_Drop-off_probe: /56-FAM/CCTA+C+G+T+CA+A+GT/3IABkFQ/",
    "Ensure that the primers correspond to unique sequences that are specific to the area. Ensure that the drop-off probe is designed for the area that overlaps with RDL-CRISPR-Cas9 guide.\nTo test if there is a modification of the gDNA in the guide area, inject 12 bees in the ocelli with the RNP_RDL mix described in step 5.3.1 and use eight uninjected bees as controls.\nDissect out the bee brains without the optic lobes 48 h after the injections and extract the gDNA of each injected and control bee brains (without optic lobes) using the kit following the manufacturer's protocol (see Table of Materials).\nEvaluate the quantity, quality, and purity of the extracted gDNA using a spectrophotometer.\nQuantify the relative expression of modified gDNA of AmRDL using the qPCR-based drop-off protocol and real time PCR cycler.\n\t\nResuspend the oligos to 100 µM, dilute the primers to 10 µM, and the probes to 5 µM.\nSet up the PCR reaction in the 96 well plate as shown here for one sample of gDNA (3 repeats): 10 µL of master mix (see Table of Materials), 1 µL of forward primer, 1 µL of reverse primer, 1 µL of control probe, 1 µL of drop-off probe, 2 µL of gDNA (50 ng), 4 µL of nuclease-free water to bring the final reaction volume to 20 µL.\n\t\tNOTE: Controls are the solution instead of the samples and water instead of the probes.\nSet up the cycling program as follows for a real time PCR cycler: 95 °C for 3 min followed by 40 cycles of 95 °C for 15 s, 60 °C for 1 min.\nEvaluate the relative gene modification using the 2-ΔΔCt method, where\nimgsrc://cloudfront.jove.com/files/ftp_upload/59993/59993eq1.jpg and imgsrc://cloudfront.jove.com/files/ftp_upload/59993/59993eq2.jpg\n7. Relative Quantification of RDL RNA 48 H After RNPRDLmix Injection",
    "To test if there is a reduction of the RDL mRNA, inject 20 bees in the ocelli with RNP_RDL mix as described in step 5.3.1 and use 12 uninjected bees as the controls. Dissect out the bee brains (without optic lobes) 48 h after the injections, extract the total mRNA from each injected bee, and separate using the manufacturer's protocol (see Table of Materials).\nRemove any DNA residue remaining in the sample using a DNA-free kit (see Table of Materials).\nEvaluate the quality and the purity of the extracted RNA using a spectrophotometer.\nQuantify the expression of AmRDL using a commercially available fluorescent green RT-PCR kit (Table of Materials) on a real time PCR cycler using the manufacturer's protocol for a 384 well plate.\n\tNOTE: In this experiment, previously published primers were used. For AmRDL (AmRDL_F GGTCGATGGGCTACTACCTG; AmRDL_R TCGATCGACTTGACGTAGGA)22 and actin primers as a reference gene [AmActin_F TGCCAACACTGTCCTTTCTG; AmActin_R GAATTGACCCACCAATCCA]23. The relative gene expression was calculated using the 2-ΔΔCt method (step 6.6).\n8. qPCR Based drop-off Assay to Evaluate the Modified Genomic DNA 48 H After RNPmGlutR1mix Injection\nDesign the primers, control, and drop-off probes to evaluate the amount of DNA modified by CRISPR-Cas9 injection. Design the primers so that they flank at least one CRISPR-Cas 9 guide and the amplicon size is 96 bp.\n\tmGlutR1_For: GGTGAAACGAACGACGGA\n\tAmGlurR1_Rev: GGAGAGAGGGAGCGAGAA\n\tAmGlurR1_control_probe: /5HEX/CGAGG+G+AAA+CGA+GT/3IABkFQ/\n\tAmGlurR1_Drop-off_probe: /56-FAM/CGA+C+A+C+CG+TC/3IABkFQ/\n\tNOTE: Ensure that primers correspond to unique sequences that are specific to the area that should have been modified. The drop-off probe is designed for the area that overlapped with the CRISPR-Cas9 guide.\nTo test if there is a modification of the gDNA in the guide area, inject 12 bees in the ocelli with RNP_ GlutR1 mix as described in step 5.3.1 and use eight uninjected bees as controls.",
    "Dissect out the bee brains (without optic lobes) 48 h after the injections and extract the gDNA from each injected and control bee brain (without optic lobes) using the manufacturer's protocol (see Table of Materials).\nEvaluate the quantity, quality, and purity of the extracted gDNA using a spectrophotometer.\nQuantify the relative modification of gDNA AmGlutR1 using qPCR drop-off protocol and for real time PCR cycler as described in step 6.5.\nEvaluate the relative gene modification using the 2-ΔΔCt method, where\nimgsrc://cloudfront.jove.com/files/ftp_upload/59993/59993eq3.jpg and imgsrc://cloudfront.jove.com/files/ftp_upload/59993/59993eq4.jpg\n9. Quantification of mGlutR1 RNA 48 h After RNPmGlutR1mix Injection\nTo test if there is a reduction in the mGlutR1 RNA mRNA, inject six bees in the ocelli with the RNP_RDL mix as described in step 5.3.2 and use six uninjected bees as controls. Dissect out the bee brains (without optic lobes) 48 h after the injections, extract the total mRNA from each injected bee, and separate using the manufacturer's protocol for RNA isolation (see Table of Materials).\nRemove any DNA residue remaining in the sample using a DNA-free kit (see Table of Materials).\nEvaluate the quality and the purity of the extracted RNA using a spectrophotometer.\nQuantify the expression of mGlutR1 using a SYBR Green RT-PCR kit (see Table of Materials) on a real time PCR cycler with the protocol provided for the 384 well kit. Use the following primers for mGlutR1 (mGlut_F CCTCCTCAACGTCTCCTTCATA; mGlut_R TGCCGTTGTGTTCCGATTT) and actin primers as reference gene [AmActin_F TGCCAACACTGTCCTTTCTG; AmActin_R GAATTGACCCACCAATCCA]. Calculate the relative gene expression by using the 2-ΔΔCt method (step 8.6)."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}