{
  "id": 7410,
  "origin_website": "Bio",
  "title": "APEX-mediated Proximity Labeling of Proteins in Cells Targeted by Extracellular Vesicles",
  "procedures": [
    "Part I: EV purification Plasmid constructionClone PCR fragments of cyclin D1 and APEX from pcDNA3 APEX-nes into the XPack CMV-XP-MCS-EF1α-Puro Cloning Lentivector.PCR cyclinD1 from the cDNA of mESCs by using the following primers:CyclinD1-F: acgGGATCCCATGGAACACCAGCTCCTGCyclinD1-R: acgGAATTCGATGTCCACATCTCGCACGInsert cyclinD1 PCR fragments into pcDNA3 APEX-nes through BamHI and EcoRI to get pcDNA3 cyclinD1-APEX-nes plasmid.PCR cyclinD1-Flag-APEX from the above vector by using the following primers:acgCTCGAGTATGGAACACCAGCTCCTGacgGGATCCtGATGTCCACATCTCGCACGInsert cyclinD1-Flag-APEX PCR fragments into XPack CMV-XP-MCS-EF1α-Puro through XhoI and BamHI to get XPack CMV-XP-cyclinD1-Flag-APEX -EF1α-Puro plasmid.Confirm vectors by using Sanger DNA sequencing (UC Berkeley DNA sequencing facility).Lentivirus package and transfectionVector transfectionSeed 293T cells at early passage (P1 in our experiments) on 10 cm culture dish and culture to get 60-70% confluency.Mix 6 µg of transfer vector (XPack CMV-XP-cyclinD1-APEX-EF1α-Puro), 3.9 µg of psPAX, and 2.1 µg of pMD2.G in 0.5 ml of OPTI-MEM (total DNA 12 µg).In another tube, mix 36 µl of lipofectamine in 0.5 ml of OPTI-MEM.Mix the DNA and the lipofectamine, and incubate at room temperature for 20 min.Change the culture medium into 5 ml OPTI-MEM.Add the DNA and liposome mixture (1 ml) to the culture dish.After 8 h, remove OPTI-MEM media and discard into 100% bleach.Incubate cells in fresh growth medium (see Recipe 1) for 2 days.Harvest virusCentrifuge the medium at 1,000 × g for 5 min at 4°C.Filter the medium, which has the cyclinD1-APEX lentivirus, slowly through a 0.45 µm filter into a 15 ml falcon tube.Transduce 50% confluency N2A cells with lentivirusAdd 1.5 ml cyclinD1-APEX lentivirus to N2A cells in 35 mm dish and culture for 24 h.Replace medium with growth medium (see Recipe 1) containing 5 µg/ml puromycin.Culture cells in 5 µg/ml puromycin for 4 days to select N2A cells stably expressing cyclinD1-APEX.",
    "Cell culture and differentiationCell cultureCulture cyclinD1-APEX stably expressing N2A cells in four 15 cm dishes in 30 ml cell culture growth medium (see Recipe 1) until cells reach 80% confluency (the cell number is ~3 × 107cells per dish).Note: The surface available for cell growth in these dishes is 151.9 sq. cm. The total volume of cell culture growth medium used for these dishes is 30 ml per plate. Cell differentiationSplit cells in the four 15 cm dishes to a total of fourteen 15 cm dishes, each containing approximately 8 × 106 cells, and incubate in 30 ml of RA (10 µM) containing medium with 1% exosome-depleted FBS (see Recipe 2).Note: The maximum volume of medium that can be processed in the steps below is 420 ml at each time point. Incubate cells for 6 days. Feed the cells with RA-containing medium (see Recipe 2) every 3 days. Collect medium afterward at day 6.Collect conditioned medium and sediment EVsCollect the conditioned medium from the fourteen 15 cm plates into separate containers.Note: Approximately 420 ml of total condition medium should be collected. Centrifuge conditioned medium at 1,000 × g for 15 min at 4°C using Sorvall RC 6+ centrifuge with a fixed rotor of F14S-6X250y FiberLite (or equivalent centrifuge) in 250 ml tube to remove floating cells (Low Spin Speed).Decant the supernatant fraction into a new container immediately after the centrifuge finishes.Note: It is important to remember not to disturb the pellet. Use a Sorvall RC 6+ Centrifuge (with F14S-6X250y FiberLite fixed angle rotor) to centrifuge the supernatant at 10,000 × g for 15 min at 4°C and sediment large EVs and cellular debris (medium speed spin).After the centrifuge stops, immediately but carefully decant the supernatant fraction into a new container.",
    "Note: It is important to remember not to disturb the pellet. Transfer 32 ml of the collected supernatant into one 38.5 ml ultra-clear tube. Keep transferring until twelve 38.5 ml ultra-clear tubes are filled.Use SW-28 and SW32 Ti rotors at ~100,000 × g (28,000 RPM) for 1.5 h at 4°C at maximum acceleration/brake to centrifuge.Gently remove supernatant and resuspend the pellet fraction by pipetting two to three times in 200 µl of phosphate buffered saline (PBS, pH 7.4).Pipette the resuspended pellet fraction into a new 5 ml ultra-clear tube.Note: After combining the pellet fractions from 12 tubes, ~3 ml of resuspend pellet may be collected. Dilute resuspension from the above step with PBS to a total volume of ~4.8 ml.Use SW-55 rotor to centrifuge sample at approximately 150,000 × g (38,500 RPM) for 1 h at 4°C and with maximum acceleration and brake.Gently remove the supernatant. Add 100 µl of PBS into the tube and incubate at room temperature for 30 min.Resuspend pellet by gently pipetting.Add 900 µl of 60% sucrose. Mix thoroughly until a homogenous suspension is made.Note: Sucrose is dissolved in buffer C (see Recipe 3). Use the refractometer to measure the sucrose concentration. The read of the refractometer should be 60. First, carefully add 2 ml of 40% sucrose and then carefully place 1 ml of 20% sucrose on top. Add the sucrose medium very slowly and smoothly to avoid disturbing the layer between the cushion. Three separate layers of the different densities of sucrose should be apparent.Note: This step requires extreme caution. Dispense sucrose slowly to the side of the clear tube, and let it trickle down the wall of the tube.",
    "Use the SW-55 rotor to centrifuge sample at approximately 150,000 × g (38,500 RPM) for 16 h, at 4°C and with minimum acceleration with no brake.Note: It is important to have no brake during deceleration. Having the brake on can cause disruption of the gradient. Once the centrifugation stops, aspirate ~0.8 ml of supernatant from top to bottom. Collect the 20%/40% sucrose interface (Figure 1) (the total volume at this step is ~1 ml) into a new 5 ml ultra-clear tube.Note: Be careful not to disrupt the second gradient of the 40%/60% sucrose interface. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4213/bioprotoc-11-21-4213-g001.jpgFigure 1. EVs at 20%/40% interface after overnight centrifugation Dilute up to ~4.8 ml of PBS in the 5 ml ultra-clear tube.Centrifuge at ~150,000 × g (38,500 RPM) for 1 h in an SW-55 rotator at 4°C and with maximum acceleration and deceleration.Gently decant the supernatant fraction and add 100 µl of PBS into the tube to incubate at room temperature for 30 min.Resuspend the EV pellet by gently pipetting.EV measurement by NTAEstimate EV sizes and quantities using the NanoSight NS300 instrument equipped with a 405-nm laser; analyze the data in the scatter mode.Dilute collected vesicles as described above (D21) at 1,000× with filtered PBS.Introduce samples into the chamber automatically, at a constant flow rate during five repeats of 60-s captures, and at camera level 13 in scatter mode with Nanosight NTA 3.1 software.Estimate the EV size at the detection threshold using the Nanosight NTA 3.1 software, after which export “experiment summary” and “particle data” (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4213/bioprotoc-11-21-4213-g002.jpgFigure 2. Nanoparticle tracking analysis of the size distribution and the number of purified EVs from the 420-ml medium of N2A cells treated with RA for 6 days.",
    "Calculate the particle numbers in each size category from the particle data, and pool, bin, and count “true” particles with track length >3 with Excel.Note: ~5 × 108 to ~2.5 × 109 per 1 µl particle number is normally counted in step D21 EV sample. Part II: APEX biotinylated labeling in EV Incubate biotin-phenol (500 μM) with ~1 × 1010 purified EVs (see Step D21 in Part I) for 30 min at 37°C in a total mixture volume <50 μl in an Eppendorf tube. Prepare two samples at this step.Note: Keep in a small volume to ensure there is less of the biotin-phenol residual after the quencher solution wash. Transfer the mixture into two 13.2 ml ultra-clear tubes.Initiate APEX labeling by adding 1 mM (0.003%) H2O2 in one tube.Note: For the other tube, perform the same treatment as follows, but do not add H2O2. This serves as a negative control. After 1 min, add 12 ml quencher solution (see Recipe 4) immediately.Centrifuge at ~110,000 × g (31,500 RPM) for 1 h in an SW-41 rotor and 4°C with maximum acceleration and brake.Use quencher solution (see Recipe 4) to sediment and wash EVs once. Once stopped, aspirate the supernatant and add 12 ml quencher solution (see Recipe 4).Centrifuge at ~110,000 × g (31,500 RPM) for 1 h in an SW-41 rotor at 4°C and with maximum acceleration and deceleration.Gently decant the supernatant fraction. Add 40 µl of PBS into the tube and incubate at room temperature for 30 min.Resuspend the EV pellet fraction in 40 µl PBS by gently pipetting.Transfer the two EV samples into new Eppendorf tubes.Add 4× SDS-loading buffer (see Recipe 5) to prepare samples for SDS PAGE and streptavidin-HRP blotting.Incubate samples at 95°C for 10 min.",
    "Load 15 µl of samples per lane in a 10% Tris-glycine mini gels.Run gels at a constant voltage of 150 V for 1 h.Transfer proteins from gels onto a PVDF membrane with constant amps of 0.6 A for 1.5 h.Block membrane(s) with 5% BSA in TBST overnight in the cold room (4°C).Incubate membrane(s) with the Streptavidin-HRP (1:10,000) for 1 h at room temperature.Wash three times with TBST for 8 min of each wash.Add the HRP substrate following the manufacturer's specifications. Develop signal using Chemidoc Imaging System.Note: The remaining EVs can be used for the following steps after proving that the APEX biotinylated labeling works well in EVs. Part III: APEX biotinylated labeling in cells APEX reaction in receipt mES cellsPrepare two 35 mm dishes of ES cells at a density of 4 × 104-5 × 104/cm2.Incubate cylinD1-APEX EVs with mESCs in N2B27 medium (see Recipe 6) for 2 days at a concentration of ~5 × 109 EV/ml medium.Pre-warm N2B27 medium (see Recipe 6) at 37°C for 30 min and then add 2 μl of the biotin-phenol stock solution (500 mM) into 2 ml of N2B27 medium to make a 500 μM biotin-phenol solution.Incubate the above solution with cells for 30 min at 37°C.Immediately prior to use, dilute 1 mM (0.003%) H2O2 into the medium for each dish for a 1-min labeling reaction at room temperature. Use the other dish without H2O2 as a negative control.Quench the reaction by immediately washing cells thoroughly with room temperature quencher solution three times (see Recipe 4).Note: Ensure that the washes are performed using the quencher solution instead of purely DPB. Lyse cells in 1 ml RIPA (see Recipe 7) supplemented with 10 mM sodium ascorbate, 1 mM sodium azide, and 1× protease inhibitors.",
    "Sonicate cell lysate in a bath sonicator for 10 min on ice and then centrifuge at 10,000 × g for 10 min at 4°C.Add 40 μl of concentrated streptavidin-agarose beads to the supernatant fraction (800 μl), and then rotate the mixture overnight at 4°C.Note: Wash 40 μl of streptavidin-agarose beads once with 1 ml of RIPA. Centrifuge above sample at 3,000 × g for 10 min at 4°C. Discard the supernatant fraction.Note: Ensure all the following buffers and samples are kept on ice. Add 1 ml of RIPA buffer (see Recipe 7) to streptavidin-agarose beads and rotate the mixture at 4°C for 10 min.Centrifuge above sample at 3,000 × g for 10 min at 4°C. Discard the supernatant fraction.Note: The process from 10 to 11 is named the beads wash in the following steps. Wash beads once again by RIPA buffer (see Recipe 7).Wash beads once with buffer D (see Recipe 8).Elute biotinylated proteins from the beads by heating the sample in a 4× SDS-loading buffer (see Recipe 5) supplemented with 2 mM biotin and 20 mM DTT for 10 min at 95°C.Load 15 μl of sample per lane in 10% Tris-glycine mini gels. Run at a constant voltage of 150 V for 1 h.Ponceau S stain gels at room temperature for 3 min (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4213/bioprotoc-11-21-4213-g003.jpgFigure 3. Streptavidin-HRP blotting after cyclinD1-APEX EV incubation with mESC Note: Treat EV pre-incubation mESC with biotin-phenol with H2O2 (B+H) or not (B). Detect biotinylated protein by blotting with streptavidin-horseradish peroxidase (SA-HRP). Ponceau S staining (left of panel) of the same membrane serves as a loading control. Wash gel three times with ddH2O.Evaluate biotinylated proteins by blotting with streptavidin-HRP (Figure 3).Note: The same procedure in Part II, Step 11 from d to h.",
    "Mass Spectrometry (MS) analysisElectrophorese heated samples from Part III, Step A16 in a 10% Tris-glycine mini gel for ~3 min.Stain the proteins with Coomassie and excise stained bands from the gel with a fresh razor blade.Submit samples to a Spectrometry Facility (we used the Taplin Mass at Harvard Medical School) for in-gel tryptic digestion of proteins followed by liquid chromatography and mass spectrometry analysis according to their standards.MS data analysisAfter raw MS data is acquired, perform peptide identification, quantification, and filtering on the Peaks Studio X+ platform with the default settings via the Proteome Discoverer database.Implement Variance stabilization normalization (Vsn) with the justvsn function from the R/Bioconductor-package Vsn to normalize the quantified protein data.Perform T-test analyses to examine significant changes in protein abundances between two different groups."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology",
    "Stem Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}