{
  "id": 19735,
  "origin_website": "Wiley",
  "title": "A Sensitive and Quantitative mKeima Assay for Mitophagy via FACS",
  "procedures": [
    "Mito-mKeima and YFP-Parkin can be transiently transfected to monitor mitophagy. While this approach appears simple, it is less reproducible. Plasmid DNA quality, variation in transfection efficiency, and gene expression can all lead to uncontrolled alterations in performance. While producing stable cell lines requires more initial labor, they also provides undisputed benefits in terms of long-term affordability and time requirements. Of note, although retrovirus or lentivirus transfer plasmids used here are defective in replication, they are still capable of integration. Therefore, caution should be taken when handling and disposing of the virus and associated materials.\nViral packaging is similar to regular transient transfection of an expression plasmid, with the only noteworthy difference being co-transfection of helper plasmids. Afterwards, the virus can be easily harvested from the culture media and used to infect target cells. Targeted cells can be enriched by FACS sorting, as in this case, or selection (if proper anti-biotic markers are present). For Parkin-independent mitophagy, cells stably expressing only mito-mKeima are required. However, it is recommended to make stable cells expressing both mito-mKeima and YFP-Parkin (or untagged Parkin) so that both Parkin-mediated and Parkin-independent mitophagy can be examined with different mitophagy inducers using the same stable cell line. A brief video of harvesting virus is provided below (Video 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.99#support-information-section]).\nMaterials\n293T cells (ATCC #CRL-3216)\nPolyethylenimine, linear, MW 250000, transfection grade (PEI 25K; see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.99#cpcb99-rec-0001])\nOpti-MEM reduced serum medium (Thermofisher, cat. no. 31985062)\npCMV-VSV-G (Addgene, plasmid #8454)\npUMVC (Addgene, plasmid #8449)\npCHAC-mt-mKeima (Addgene, plasmid #72342)\npBMN-YFP-Parkin (Addgene, plasmid #59416)\npHDM-G (Harvard Medical School, EvNO00061606)\npHDM-HGPM2 (Harvard Medical School, EvNO00061607)\npHDM-tat1B (Harvard Medical School, EvNO00061608)\npRC-CMV-rev1B (Harvard Medical School, EvNO00061616)\npHAGE-mt-mKeima (Addgene, plasmid #131626)",
    "DMEM complete medium: DMEM medium (Thermofisher, cat. no.11960-044 with phenol red or cat. no. 31053-028) supplemented with 1× GlutaMAX (Thermofisher cat. no. 35050-061),1 mM sodium pyruvate (Thermofisher, cat. no. 11360-070), and 10% fetal bovine serum FBS), heat inactivated (Sigma, cat. no. F8317-500 ml)\nNunc Cell Culture Treated 6-well plates (Thermofisher, cat. no. 140675)\n1.5-ml MicroTube flat cap (SARSTEDT #72.690.300), autoclaved\nVortex mixer\nMillex-HV Syringe filter unit, 0.45-µm, PVDF, 33-mm, gamma sterilized (EMDmillipore, cat. no. SLHV033RB), ultra-low protein binding\nMonoject 1-ml tuberculin syringe (Coviden, cat. no. 8881501400)\n15-ml polypropylene centrifuge tube (VitaScientific, cat. no. NSTF40173)\n1. Seed 1–1.2 × 106 293T cells per well in a 6-well plate.\nA variable number of 293T cells can be seeded. The key is to reach 70%-90% confluency and allow the cells to attach well before transfection on the next day. It is ideal to seed the cells in the morning to allow cells to have enough time to attach. 293T cells do not adhere well and use caution when handling the cells to prevent detachment. Exercise close attention on maintaining 293T cells to ensure they remain flat and spread out. Cells normally look “clumpy” 1 day after thawing. If the clumping of the cells persists, passage cells a few more times to achieve the correct appearance. Cells should not be split too thin (less than 1:10 split), as this will promote clumping and will be slow to recover back to a normal morphology.\n2. Perform transfection the next day in the afternoon with PEI 25K as in steps 3-8.\nAny commercial transfection reagents can be used for transfection. PEI 25K is the cheapest and provides high transfection efficiency.\n3. Add 0.5 ml Opti-MEM into a sterile 1.5-ml microcentrifuge tube.\n4. For retrovirus, add 0.5 µg pCMV-VSV-G, 1 µg pUMVC, 1.5 µg pCHAC-mt-mKeima or pBMN-YFP-Parkin.",
    "5. For lentivirus, add 0.5 µg of each helper plasmid: pHDM-G, pHDM-HGPM2, pHDM-tat1B, pRC-CMV-rev1B and 1 µg pHAGE-mt-mKeima.\nOne can use other retrovirus or lentivirus helper plasmids and the ratio between the helper plasmids and the virus transfer plasmid may be altered to achieve the highest titer. The helper plasmids can also be pre-mixed to reduce pipetting steps.\n6. Add 9 µl of PEI 25K. Vortex for 15-30 s. Let sit for 15 to 30 min at room temperature.\n7. Replace the medium from the 6-well plate with 1.5 ml fresh DMEM complete medium.\nAlthough the original PEI transfection protocol requires DMEM medium containing only 1% FBS, we observed that normal DMEM medium containing 10% FBS can be used without affecting transfection efficiency and virus titer.\n8. Add the transfection mix drop wise to the cells. Gently swirl the plate to mix as 293T cells detach easily. Gently swirl while also ensuring a proper mixing.\n9. Change the medium the following day with 1 ml fresh DMEM complete medium.\nWhen changing the medium, caution should also be taken. Add the medium along the side of the well to avoid disturbing the cells.\n10. Harvest the virus 2 days after transfection. Remove the medium containing the virus from the 6-well plate and put into a 1.5-ml sterile microcentrifuge tube.\n11. Quickly spin for 1 min at 1000 × g to pellet any carry-over cells or debris.\n12. Transfer the supernatant into a new sterile 1.5-ml microcentrifuge tube. Virus can be used right away or stored up to 1 month at 4°C and for long-term at −80°C.\nSimply centrifuging the tubes to remove any carry-over of 293T cells is not always complete. The following filtration step is highly recommended to ensure no contamination of 293T cells.",
    "13. To filter the virus, use 0.5-1 ml DMEM complete medium to pre-wet the PVDF Millex-HV filter with a 1-ml syringe, and then filter the medium containing virus (step 10) into a sterile 15-ml centrifuge tube (see Video 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.99#support-information-section]).\nNOTE: All pipette tips, tubes, filters and plates that came in touch with virus should be secured in a sealed bag and then placed in the appropriate biological waste can. Solutions or media containing virus should be put into a bottle with 10% bleach.",
    "Virus transduction/infection is a straightforward method to generate stable cell lines. We recommend omitting the measurement of virus titer since MOI (multiplicity of infection) is not always a good indicator of transduction rate and proper gene expression. Instead, the expression level of the proteins of interest after transduction should be used as the benchmark for virus quality. It normally takes 2 days for genes transduced to be expressed and 3 days for maximal expression. If the fluorescent signal is weak or moderate 2 days after infection, this is the sign that the virus titer used is sufficient. If the signal is still too weak on Day 3, then re-infection can be performed. It is preferred not to infect cells with too much virus since very bright mKeima or YFP signal can be problematic for FACS analysis as the two fluorescent signals could interfere with each other.\nThe binding of virus particles to target cells is the key determining factor for a higher infection rate. This initial binding step was assumed to involve specific interactions between the viral envelope and specific receptors on the cell surface but was later shown to be receptor-independent. Subsequent strong electrostatic repulsion between the negatively charged cells and approaching enveloped virus counteracts the binding of the viral envelope to the cells. Low speed centrifugation or addition of positively-charged polycations such as polybrene, reduces the repulsive forces and greatly enhances the transduction efficiency. The optimal concentration of polybrene can be cell-type specific and certain cells such as neurons are very sensitive to polybrene.\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.99#cpcb99-prot-0001])\nTarget cells\nPolybrene (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.99#cpcb99-rec-0002])\nRetrovirus or lentivirus (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.99#cpcb99-prot-0001])\nFluorescent microscope",
    "1. Seed target cells in a 6-well plate so that cells are at 10%-20% confluency the following day. For HeLa cells, seed 5K-10K cells per well.\nDepending on the virus titer, higher infection rate can be achieved by seeding less cells. Generally, lentivirus produces a higher titer than retrovirus. However, retrovirus tends to produce more uniform gene expression.\n2. In a 15-ml centrifuge tube, add 4 µl Polybrene (500×), 0.5 ml retrovirus or 0.2-0.3 ml lentivirus, culture medium up to 2 ml. Gently mix by pipetting.\nVirus volume should not exceed half of the final infection volume as inhibitory factors can be produced during virus packaging. If frozen virus is used, thaw virus quickly in a 37°C water bath.\n3. Remove the culture medium from the target cells.\n4. Add virus mix to the cells.\n5. Virus can be removed the next day from the cells\nSometimes virus with a higher titer can be toxic and should not be left in the cells for extended periods of time. Check cell behavior the following day after infection. If there are no signs of toxicity, media containing virus can be left for longer.\n6. Check mito-mKeima or YFP-Parkin signal under a fluorescent microscope on Day 2 after infection\nIf the fluorescent signal is faint or moderate on Day 2, it is a good indication that mito-mKeima or YFP-Parkin are expressed at the proper level. Less virus should be used if mKeima or YFP signal is too high.\n7. Mito-mKeima or YFP-Parkin signal should be maxima 3 days after infection and cells are ready for further experiments.\nIf a cell population with even expression of mKeima and YFP is required, cells can be sorted by FACS to enrich for the double-positive cells with the desired expression level.",
    "In their original paper reporting the use of mKeima for autophagy and mitophagy measurement, Katayama et al. described an ratiometric imaging-based approach, which is very limited on the number of cells (30 transfected cells calculated) that could be imaged and analyzed. As shown in Figure 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.99#cpcb99-fig-0001], mito-mKeima puncta, due to its localization in the matrix of mitochondria, appear larger and distinct during mitophagy comparing to mKeima puncta during autophagy. Some researches simply count the number of red-only mito-mKeima puncta or mito-QC and other similar fluorescent reporters for mitophagy measurement. This is clearly not accurate and likely overestimate the extent of mitophagy. Ratiometric imaging of mito-mKeima seems to reflect the overall mitophagy better but is time consuming.\nWe decided to explore the usage of FACS for easier, quantitative and more objective measurement of mitophagy, which turn out to be very successful. Now, 50,000 cells instead of 30 cells can be analyzed. A step-by-step video demo of how to use FlowJo software for FACS analysis covering steps 10-12 is provided below (see Video 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.99#support-information-section]).\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.99#cpcb99-prot-0001])\nAntimycin A (Sigma, cat. no. A8674): Dissolve in 100% ethanol to make 8 mg/ml stock (2000×)\nOligomycin (mixture of A, B, C isomers) (Millipore, cat. no. 495455): Dissolve in dimethyl sulfoxide (DMSO) to make 10 mg/ml stock (1000×)\nQ-VD (ApexBio, cat. no. A1901): Dissolve in DMSO to make 10 mM stock (1000×)\nHanks’ balanced salt solution (HBSS; Thermofisher, cat. no.14175-095)\n0.05% Trypsin-EDTA (1×) (Thermofisher, cat. no.25300-054)\nDAPI (diamidino-2-phenylindole), 1 mg/ml solution (10,000×) (Thermofisher, cat. no.62248)\nCostar 12-well clear TC-treated multiple well plates (Corning, cat. no. 3512)\nBenchtop centrifuge (Eppendorf 5424)\nFalcon 5-ml polystyrene round-bottom tube with cell-strainer cap (Corning, cat. no. 352235)\nMoFlo Astrios cell sorter (Beckman Coulter)\nSummit software (v6.2.6.16198)\nFlowJo software",
    "1. Seed 100K HeLa cells stably expressing YFP-Parkin and mito-mKeima per well in 12-well plates.\nIf a 6-hr time point is needed, seed 150K cells. Seed appropriate number of cells depending on the duration of experimental treatments so that cells do not become overconfluent during the duration of the experiment.\n2. Treat the cells with OAQ (diluted from 1000×−2000× stocks of each chemical) for 6-24 hr at 37°C.\nOligomycin coupled with antimycin A induces mitochondria membrane potential loss and triggers robust Parkin-mediated mitophagy. Q-VD, a potent apoptosis inhibitor, is used to prevent cell death during this process.\n3. Wash the cells with 0.5 ml HBSS buffer\n4. Trypsinize the cells with 0.2-0.3 ml 0.05% trypsin-EDTA. Incubate at 37°C for a couple of minutes until cells dislodge from the plate.\n5. Add 0.5 ml DMEM culture medium to the wells. Mix and transfer the cells into a 1.5-ml microcentrifuge tube.\nAt this step, non-sterile centrifuge tubes can be used.\n6. Centrifuge for 1 min at 300-1000 × g to pellet the cells.\nHigher speed and duration of centrifugation is not recommended as this will cause mechanical sheering of the cells and also make it difficult to resuspend the cells.\n7. Remove the medium and resuspend the pellet in 0.3 ml DMEM culture medium containing 100 ng/ml DAPI (diluted from the 10,000× stock).\nDAPI is used for staining dead cells allowing for gating of live cells only during FACS. It is not necessary but is recommended. Cells should be resuspended well to avoid any clumps that may clog the machine.\n8. Transfer the cells into 5 ml round-bottom tube with cell-strainer cap.\nCell strainer will help to remove cell clumps that could clog the machines during FACS analysis.\n9. Bring the samples to the FACS facility for analysis.",
    "10. With MoFlo Astrios cell sorter, for each sample, 50k-100k events should be collected and first gated for live cells (DAPI-negative) (See Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.99#cpcb99-fig-0002], Video 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.99#support-information-section]):\n         \nY-axis: DAPI height or area log 355_488-59 or log 405_448-59\nX-axis: FSC height or area log 488\nUse gate from control sample containing all 4 populations for all proceeding samples.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/7a0e8d52-94b3-47e0-8f03-2de865ee61f9/cpcb99-fig-0002-m.jpg</p>\nFigure 2\nGating live cells with the aid of DAPI.\n11. Compensate on DAPI-negative cells (See Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.99#cpcb99-fig-0003], Video 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.99#support-information-section]):\n         \nY-axis: mKeima pH 7 488_620-29 area log compensation\nX-axis: YFP 488_513-26 area log compensation\nGate double-positive cells for control sample containing all 4 populations and then use this same gate for all proceeding samples.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/89082a37-8890-4dac-b973-b77c331990fb/cpcb99-fig-0003-m.jpg</p>\nFigure 3\nGating single (mt-mKeima) or double positive (mt-mKeima and YFP-Parkin) cells.\n12. Ratiometric analysis (See Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.99#cpcb99-fig-0004], Video 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.99#support-information-section]):\n         \nY-axis: mKeima pH 4 561_614-20 area log (or height)\nX-axis: mKeima pH 7 488_620-29 area log (or height)\nDraw upper and lower gates using WT and Pink1 KO as positive and negative controls, respectively, then apply the same gates for all proceeding samples.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/2d52f794-8f68-47d8-a295-b3e2ce5f5c7b/cpcb99-fig-0004-m.jpg</p>\nFigure 4\nRatiometric analysis."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}