{
  "id": 5569,
  "origin_website": "Bio",
  "title": "Creating a RAW264.7 CRISPR-Cas9 Genome Wide Library",
  "procedures": [
    "Making hCas9-expressing RAW264.7 cellsD0: Plate 5 x 106 293T cells in a tissue culture (TC) treated 10 cm plate in 10 ml DMEM + 10% FBS, and incubate overnight at 37 °C with 5% CO2. We aim for 30-40% confluency.D1: Create hCas9-expressing retrovirus in 293T cells.Premix plasmids in 150 μl of serum-free DMEMFor a 10 cm dish (retrovirus PMX-hCas9-blasti):1.3 μg △VPR0.87 μg VSV-G0.55 μg p-Advant0.73 μg PMX-hCas9-blasti (For the plasmid map see http://www.addgene.org/52962/[href=http://www.addgene.org/52962/])Add 15 μl of Fugene and let sit at 25 °C for 20 min.During incubation replace 293T media (see Recipes) with 10 ml of fresh 37 °C DMEM + 10% FBS.Add mixture drop by drop on 293T cells and mix by gently rocking plate back and forth.Incubate at 37 °C + 5% CO2 overnight.D2:Gently aspirate media off transfected 293T cells and replace with 6-8 ml of 37 °C DMEM + 10% FBS. The monolayer will be delicate (see Note 1).Plate RAW264.7 cells for transduction with Cas9-expressing virus on D3, at 3 x 105 cells/well in a 6-well plate, 1 well per sample. Additionally, plate 3x RAW264.7 cells at 3 x 105 cells/well in a 6-well plate for assessing viral titer.D3: Harvest virus and transduce RAW cellsHarvest virus in the morning and the evening, from the same well (see Note 2).At each time point, gently remove supernatant from 293T cells that contains virus. For the morning time point, after removing supernatant add 6 ml of 37 °C DMEM + 10% FBS media to the 293T virus-producing cells. Again, be very careful with this monolayer.Filter virus-containing media with 0.45 μm syringe filter to ensure removal of cellular debris.Add protamine sulphate at 8 μg/ml to the filtered virus-containing media.Aspirate media off seeded RAW264.7 cells and add 2-5 ml of supernatant containing viruses (see Note 3).",
    "The control will just be DMEM only (see Note 4).For viral titer, prepare 3 10-fold dilutions of virus in serum-free DMEM and continue with assessing viral titer by plaque assay as previously published (Watanabe et al., 2016).Incubate at 37 °C + 5% CO2 overnight.D4: Aspirate media off RAW264.7 cells and add new 37 °C DMEM + 10% FBS media to transduced RAW cells.D5: Transfer transduced RAW264.7 cells from 6-well plate to TC treated 10 cm dish. This split should yield an ideal 30% confluence for antibiotic selection the next day. At this time, plate non-transduced RAW264.7 cells in 10 cm at a similar confluency as a negative control for your antibiotic selection (~1 x 106 cells per 10 cm dish).Remove media from transduced RAW264.7 cells, replace with 3 ml of fresh 37 °C DMEM + 10% FBS media.Using cell scrapers, scrape adherent cells off of bottom of wells and resuspend in media by pipetting up and down.Replate cells in a TC treated 10 cm dish in 10 ml of fresh 37 °C DMEM + 10% FBS media, aiming for 30% confluency. No cell count is necessary; this split should yield an ideal 30% confluency.Incubate at 37 °C + 5% CO2 overnight.D6: Antibiotic selectionRemoved media from transduced RAW264.7 cells.Add 4 ml of blasticidin selection media (see Recipes) (37 °C DMEM + 10% FBS + 10 μg/ml blasticidin) to transfected RAW264.7 cells and non-transfected RAW264.7 cells for a negative control.Incubate at 37 °C + 5% CO2 for 24-48 h.D7-8:Aspirate media off selected RAW264.7-hCas9 expressing cells and replace with 4 ml of fresh 37 °C DMEM + 10% FBS + 10 μg/ml blasticidin.Incubate at 37 °C + 5% CO2 for 24-48 h to expand cell line. Incubation period will vary, however you are aiming for > 90% cell death in your non-transfected RAW264.",
    "7 cell negative control plate.D8-9: Aspirate media off selected RAW264.7-hCas9 expressing cells and add 10 ml of 37 °C DMEM + 10% FBS. Incubate these cells for 2-4 days to allow RAW264.7 cell recovery from the selection process before replating for experiments or freezing back.When freezing back: Use the cell scrapers, scrape off selected RAW264.7-hCas9 expressing cells and either freeze back cells in tissue culture freezing media (see Recipes) (50% DMEM + 40% FBS + 10% DMSO) or re-plate for future experiments.Amplifying CRISPR gRNA libraryFollow protocol previously published (Koike-Yusa et al., 2014; https://media.addgene.org/data/67/85/9641c46c-8523-11e3-b6c5-000c298a5150.pdf[href=https://media.addgene.org/data/67/85/9641c46c-8523-11e3-b6c5-000c298a5150.pdf]). Use the ‘on-plate culture’ method of amplifying the library, as the ‘liquid culture’ method can lead to exclusion of some of the plasmids in the library (Figure 1).Freeze back amplified CRISPR gRNA plasmid library.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170512/20170512223549_3521.jpgFigure 1. Graphical abstract of Koike-Yusa et al. (2014) amplification protocol of the gRNA libraryCreating CRISPR gRNA lentiviral libraryBefore starting, see Note 5. D0: Plate 1 x 106 293T cells per T-175 in 25 ml of DMEM + 10% FBS.D1: Creating CRISPR gRNA lentiviral library.Premix plasmids in 150 μl of serum-free DMEM.For a T-175 flask:4 μg △VPR2.6 μg VSV-G 1.66 μg p-Advant6.6 μg CRISPR libraryAdd 45 μl of Fugene and let sit at 25 °C for 20 min.During incubation replace 293T media with 25 ml of fresh, 37 °C DMEM + 10% FBS.Add mixture drop by drop on 293T cells and mix with soft horizontal movements.Incubate at 37 °C + 5% CO2 overnight.D2: Gently replace media on transfected 293T cells with 20 ml 37 °C DMEM + 10% FBS (see Note 3). Plate RAW264.7-hCas9 expressing cells for transfection on D3. To calculate needed RAW264.7 cells, see Procedure C. Additionally, plate 3x RAW264.7 cells at 3 x 105 cells/well in a 6-well plate for assessing viral titer.D3: Harvest virus and transduce RAW264.7 cells.",
    "Harvest virus in the AM and PM.Removed supernatant from 293T cells that contains virus.Filter with 0.45 μm syringe filter.Add protamine sulphate at 8 μg/ml.Aspirate media off seeded cells and add X ml of supernatant containing viruses, so that you have 30% transfection efficiency, and add 37 °C DMEM + 10% FBS up to 20 ml per T-175 flask (see Note 5).At this point, you can freeze back your virus to check for viral titer if you haven’t checked the transfection efficiency previously.Incubate at 37 °C + 5% CO2.D4: Plate 5 x 106 RAW264.7-hCas9 expressing cells in a T-175 flask in 25 ml of 37 °C DMEM + 10% FBS for antibiotic selection negative control.D6: Check transfection efficiency using fluorescence microscope and antibiotic selection.BFP is constitutively expressed on the lentiviral CRISPR library plasmid (Koike-Yusa et al., 2014), and you can visualize transfection efficiency by plating an aliquot of transfected cells and calculating the % fluorescence. This will not be a quantitative measure of transfection, but will allow you to be confident that your transfection worked before moving on to the antibiotic selection. Use only the cells that have been selected using antibiotics for future work.For puromycin selection for RAW264.7 transfected cells:Aspirate media off transfected RAW264.7 transfected cells and negative control, and replace with 20 ml of 37 °C DMEM + 10% FBS + 5 μg/ml puromycin.Incubate for 72 h at 37 °C + 5% CO2.D9: Split and expand RAW264.7 cells transfected with the CRISPR gRNA lentiviral library.Aspirate media off puromycin-selected RAW264.7 cells transfected with the CRISPR lentiviral library.Add 10 ml of 37 °C DMEM + 10% FBS + 5 μg/ml puromycin. Scrape adherent RAW264.7 cells off of the T-175 flask into the 10 ml of media.Pool all of selected RAW264.",
    "7 cells transfected with the CRISPR lentiviral library and pellet at 1,000 x g for 5 min. Resuspend the pellet of selected RAW264.7 cells transfected with the CRISPR lentiviral library in 37 °C DMEM + 10% FBS + 5 μg/ml puromycin and plate 1 x 106 cells per T-175 flask. There should be many T-175 flasks.Incubate for 72 h at 37 °C + 5% CO2.D13: Pool and freeze RAW264.7 cells transfected with the CRISPR gRNA lentiviral library.Each T-175 flask should contain many millions of selected RAW264.7 cells transfected with the CRISPR lentiviral library (on average 3-5 x 107). Aspirate media off selected RAW264.7 cells transfected with the CRISPR lentiviral library.Add 10 ml of 37 °C DMEM + 10% FBS.Scrape adherent RAW264.7 cells off of the T-175 flask into the 10 ml of media.Pool all of selected RAW264.7 cells transfected with the CRISPR lentiviral library and pellet at 1,000 x g for 5 min. Resuspend pellet in 50 ml of 37 °C DMEM + 10% FBS and count cells.At this point, freeze back the library at 1.5 x 107 cells per cryovial in 50% DMEM + 40% FBS + 10% DMSO media or use these cells for screening."
  ],
  "subjectAreas": [
    "Immunology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}