{
  "id": 15378,
  "origin_website": "Jove",
  "title": "Peptide-derived Method to Transport Genes and Proteins Across Cellular and Organellar Barriers in Plants",
  "procedures": [
    "1. Preparation of Peptide-Based Formulations\nPrepare stock solutions of each peptide as follows: (KH)9-BP100 (1 mg/ml or 800 nM), Cytcox-(KH)9 (1 mg/ml), BP100 (1 mg/ml) and (BP100)2K8 (70 µM). Weigh the required amount of each peptide in a 1.5 ml microcentrifuge tube and add autoclaved ultrapure water to dissolve the peptide. Mix well by repeated pipetting until a clear solution is obtained.\nAmplify and purify the plasmid DNA (pDNA), double-stranded DNA (dsDNA) and double-stranded RNA (dsRNA) according to standard molecular methodologies. In 1.5 ml microcentrifuge tubes, make stock solutions with a concentration of 1 mg/ml (pDNA and dsDNA) or 400 nM (dsRNA).\nPrepare the protein stock solution with a concentration of 7 µM, by dissolving 1 mg of protein (e.g., alcohol dehydrogenase, ADH) powder in 1 ml of sodium carbonate solution (0.1 M, pH 9). Label the protein with fluorescent probes such as rhodamine B (RhB) according to standard protocols to enable microscopic visualization of the protein delivered into cells.\nCombine the respective components in a 1.5 ml microcentrifuge tube.\n\t\nFor peptide-pDNA formulations targeting the cytoplasm, add 6.4 µl of (KH)9-BP100 (1 mg/ml) to 20 µl of pDNA (1 mg/ml) and mix well by pipetting. Allow the mixture to stabilize for 15 min at 25 °C. Add 773.6 µl of autoclaved ultrapure water to dilute the solution to a final volume of 800 µl. Use the pDNA construct designed for nuclear expression (P35S-RLuc-TNOS, Table 1).",
    "For peptide-pDNA formulations targeting the mitochondria, add 6.6 µl of Cytcox-(KH)9 (1 mg/ml) to 20 µl of pDNA (1 mg/ml) and mix well by pipetting. Allow the mixture to stabilize for 15 min at 25 °C and then add 2.4 µl of BP100 (1 mg/ml). Allow the mixture to stabilize for 15 min at 25 °C for another 15 min. Add 771 µl of autoclaved ultrapure water to dilute the solution to a final volume of 800 µl. Use the pDNA construct designed for mitochondrial expression (pDONR-cox2:rluc, Table 1).\nFor peptide-dsDNA formulations, add 5.1 µl of (KH)9-BP100 (1 mg/ml) to 8 µl of dsDNA (1 mg/ml) and mix well by pipetting. Allow the mixture to stabilize for 15 min at 25 °C. Add 786.9 µl of autoclaved ultrapure water to dilute the solution to a final volume of 800 µl.\nFor peptide-dsRNA formulations, add 50 µl of (KH)9-BP100 (800 nM) to 50 µl of dsRNA (400 nM) and mix well by pipetting. Allow the mixture to stabilize for 15 min at 25 °C. Add 700 µl of RNase-free water to dilute the solution to a final volume of 800 µl.\nFor peptide-protein formulations, add 16 µl of (BP100)2K8 (70 µM) to 16 µl of ADH (7 µM) and mix well by pipetting. Allow the mixture to stabilize for 15 min at 25 °C. Add 768 µl of autoclaved ultrapure water to dilute the solution to a final volume of 800 µl.\nAllow the formulations to stabilize for 15 min at 25 °C.\n2. Characterization of Peptide-Based Formulations",
    "Transfer each solution (800 µl) into a cuvette for dynamic light scattering (DLS) analysis. Determine the hydrodynamic diameter and polydispersity index of formed complexes with a zeta nanosizer, using a 633 nm He-Ne laser at 25 °C with a backscatter detection angle of 173°.\nFollowing size measurements, transfer each solution (800 µl) into a folded capillary cell for zeta potential measurements at default parameters of dielectric constant, refractive index and viscosity of water at 25 °C.\nObserve a small volume of complex solution, used for DLS analysis, by atomic force microscopy (AFM). Deposit 10 µl of complex solution onto the freshly exposed cleaved surface of a mica sheet and leave the mica to air dry overnight in a covered plastic petri dish.\nAcquire an image of the complexes in air at 25 °C using a silicon cantilever with a spring constant of 1.3 N/m in tapping mode27,28.\n3. Infiltration of Plant Leaves\nUse 3 week old soil-grown plants (Arabidopsis thaliana24, Nicotiana benthamiana24 or poplar26). Transfect at least 3 leaves to serve as triplicate for the quantification of gene expression or protein delivery.\nLoad a 1 ml needleless plastic syringe with 100 µl of complex solution for the transfection of one leaf. Position the tip of the syringe on the abaxial surface of the leaf.\nPress the syringe tip against the leaf slightly and depress the syringe plunger slowly while exerting a counter-pressure with the index finger of a latex-gloved hand from the opposite side. Successful infiltration can be observed as the spreading of a water-soaked area in the leaf. Label the infiltrated leaves for ease of identification.",
    "Incubate the transfected leaf for optimized durations following infiltration with peptide-pDNA (12 hr), peptide-dsDNA (12 hr), peptide-dsRNA (9 - 48 hr) and peptide-protein (6 hr) formulations under the following conditions: 16 hr light/8 hr dark at 22 °C for A. thaliana and poplar, or 24 hr constant light at 29 °C for N. benthamiana.\n4. Evaluation of Transfection Efficiency\nExcise the whole transfected leaf of smaller plants (e.g., A. thaliana) or a 1 cm2 section of the infiltrated region for larger plants (e.g., N. benthamiana).\nFor transfection experiments using Renilla luciferase (Rluc) reporter vector, determine the transfection efficiency quantitatively using an Rluc Assay Kit.\n\t\nPlace each excised leaf or leaf section in a 1.5 ml microcentrifuge tube. Add 100 µl of 1× Rluc Assay Lysis Buffer per tube. In the same manner, prepare lysates of non-transfected control leaves (triplicate).\nGrind the leaf using a homogenization pestle and incubate the resultant lysate at 25 °C for 6 - 10 hr.\nCentrifuge the lysate at 12,470 × g in a microcentrifuge for 1 min. Transfer 20 µl of the cleared lysate to a well in a 96-well microplate, and use the remaining volume for quantification of total protein concentration using a BCA Protein Assay Kit according to the manufacturer's protocol.\nAdd 100 µl of 1× Rluc Assay Substrate (diluted using the Rluc Assay Buffer) into the well and mix by slow pipetting. Place the microplate in a multimode microplate reader and initiate measurement.\nSubtract the background luminescence (mean of the non-transfected triplicate) from each experimental sample's luminescence. Calculate the ratio of photoluminescence (relative light units, RLU) to the amount of protein (mg).\nFor transfection experiments using green fluorescent protein (GFP) reporter vector or fluorescently labeled protein (e.g., ADH-RhB), observe the fluorescence using a confocal laser scanning microscope.",
    "Cut the edges of a whole leaf (to aid the removal of air spaces), while a sectioned leaf can be used as is. Remove the plunger from a 10 ml syringe and place each excised leaf or leaf section in the syringe.\nReplace the plunger and push it gently to the bottom of the syringe without crushing the leaf. Draw water into the syringe until it is approximately half filled.\nPoint the syringe upwards and push in the plunger to remove air from the syringe through the tip. Cover the tip of the syringe and pull the plunger down slowly to expel air from the leaf. Repeat this process several times until the leaf appears translucent.\nCover the surface of a microscope slide with adhesive tape. Cut a square area on the tape large enough to accommodate the leaf sample using a blade, and peel the square piece of tape off with forceps to create a specimen chamber. The tape will serve as a spacer between the slide and coverslip.\nPlace the leaf in the chamber with the abaxial surface facing upward and fill the remaining chamber area with water. Seal the leaf within the chamber with a glass coverslip and secure the edges of the coverslip with adhesive tape.\nExamine the leaf sample using the confocal laser scanning microscope under a 40X objective or a 63X water immersion objective. GFP or RhB fluorescence can be visualized at excitation wavelengths of 488 nm or 555 nm, respectively."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}