{
  "id": 12254,
  "origin_website": "Jove",
  "title": "Detection of Rare Mutations in CtDNA Using Next Generation Sequencing",
  "procedures": [
    "Tumor specimens and blood samples were obtained according to a protocol approved by the Ethics Committee of Peking University People's Hospital. Written informed consent was obtained from the patients to use their samples. Participants were screened according to the following criteria: female, advanced Non-Small Cell Lung Cancer, EGFR p.L858R mutation indicated by previous Sanger Sequencing, disease progression following two session of EGFR targeted therapy with Erlotinib, and ER-Seq which was applied to ctDNA to analyze the cause of resistance and find new target drugs.\n1. DNA Extraction from Peripheral Blood for cfDNA and genomic DNA (gDNA)\nCollect 10 mL of peripheral blood in a collection tube, invert gently up and down 6-8 times to mix. Avoid cell shearing. Blood samples can be stored in the collection tube at 6-37 °C for up to 72 hours.\nCentrifuge the collection tube at room temperature for 10 min at 1600 (±150) x g.\nTransfer the supernatant (plasma) from the collection tube to four clean 2 mL appropriately labelled centrifuge tubes using a disposable pipet without disturbing the pellet layer (white blood cells).\nTransfer1 mL of the cells using a clean disposable pipet to a 2 mL appropriately labelled centrifuge tube. The cells can be stored at -20 °C or colder before step 1.8.\nCentrifuge the plasma (from step 1.3) for 10 min at 4 °C, and 16000 (±150) x g.\nTransfer the plasma to clean centrifuge tubes properly labelled as \"plasma\", leave ~0.1 mL of residual volume at the bottom to avoid contamination. Store the plasma at -80 °C until step 1.7.\nUse 3 mL of plasma from step 1.6 to isolate cfDNA (contains ctDNA) using a commercially available kit, following the manufacturer's instructions.",
    "Use 200 µL of white blood cells from step 1.3 to isolate gDNA using a commercially available kit, following the manufacturer's instructions.\n\tNOTE: Both cfDNA and gDNA can be stored at -20 °C before use.\nApply different quality controls for cfDNA and gDNA (Table 2). Perform quality control by a standardized method for the bioanalyzer to determine levels of sample degradation and/or gDNA contamination. Peak analysis of the quality of cfDNA extraction should appear similar to Figure 1.\n\tNOTE: The peak size of cfDNA is around 170 bp. Note that increasing the amount of DNA will result in a higher quality library for the effective detection of rare mutations in cfDNA. We recommend using at least 30 ng cfDNA (30,000 copies).\n2. Library Preparation\nNOTE: Regarding base library construction on fragmented DNA, cfDNA exists in fragments with a peak size ~170 bp and thus does not need to be fragmented.\nFragment the control sample (gDNA) by sonication to obtain 200-250 bp fragments.\n\t\nPrepare 1 µg of gDNA sample in 100 µL of Tris-EDTA buffer in a clean sonication tube.\nSet the sonication program as 30 s on and 30 s off for 12 cycles for a total of 12 min.\nAfter sonication, confirm the product (5 µL) contains 200-250 bp fragments by running an analysis with 2% agarose gel.\nTransfer all fragmentation products to a new 1.5 mL tube and incubate with 150 µL of magnetic beads for 5 min to select the correct fragments.\nRemove the supernatant by putting the tube on a magnetic rack for 30 s.\nWash the beads with 200 µL of 80% ethanol (freshly prepared) with the tube staying on the magnetic rack. Incubate for 30 s before removing the supernatant. Repeat once.",
    "Air dry the beads with the tube lid open while staying on the magnetic rack. Avoid overdried beads to make sure that the DNA target recovers well. Elute DNA fragments from the beads by adding 32 µL of 10 mM Tris-HCl (pH 8) to the beads to resolve the DNA fragments followed by quantification by UV/Vis spectroscopy.\n\t\tNOTE: At least 200 ng is needed for the following experiments.\nEnd Prep Reaction\n\tNOTE: Follow manufacturer's instruction and modify as needed. Use 30 ng of cfDNA; and 1 µg of gDNA as the control.\n\t\nAdd 7 µL of reaction buffer, 3 µL of the enzyme mix, 30 ng of cfDNA in a sterile nuclease-free tube, and add ddH2O to total volume of 60 µL. In a separate tube, add the above components but with 1 µg of gDNA instead of cfDNA.\nMix and incubate the mixture at 20 °C for 30 min followed by 65 °C for 30 min in a thermocycler without the lid heated. Proceed immediately to the next step.\nAdapter Ligation\n\t\nAdd 30 µL of the ligation master mix, 1 µL of the ligation enhancer, and 4 µL of the unique sequencing adapters to the mixture from step 2.2.\nIncubate at 20 °C for 15 min in a thermocycler without the lid heated.\nVortex to resuspend the magnetic beads and leave the beads at room temperature for at least 30 min before the next step.\nAdd 87 µL of the resuspended magnetic beads to the previously mentioned mixture; mix well by pipetting up and down and then incubate at room temperature for 5 min.\nWash and air dry the beads as described in Step 2.1.\nElute the DNA target from the beads by adding 20 µL of 10 mM Tris-HCl (pH 8).\nEnrichment of DNA fragments ligated with adapter",
    "Add 20 µL of adapter ligated DNA fragments, 5 µL of Index Primer/i7 (2.5 µL Primer-P7 (10 pM) and 2.5 µL of Primer-P5 (10 pM), for sequencing purposes), 25µL of library amplification master mix, and ddH2O to a total volume of 50 µL.\nPCR amplify the adapter ligated DNA and thermal cycle as follows: initial denaturation at 98 °C for 45 s, followed by 8 cycles (cfDNA) or 4 cycles (gDNA) of annealing °C for 15 s, 65 °C for 30 s, 72 °C for 30 s), and a final extension at 72 °C for 60 s, then holding the temperature at 4 °C.\nAdd 45 µL of suspended magnetic beads to the PCR-enriched DNA to get acquired fragments.\nElute DNA fragments with adapters in 30 µL of 10 mM Tris-HCl (pH 8).\nLibrary Quality Control\n\t\nFollow the manufacturer's protocol for the commercial kit to measure adapter ligated DNA concentration. Use the bioanalyzer to determine the DNA quality.\n3. Targeted DNA capture\nNOTE: Target enrichment was performed using a custom sequence capture-probe which is specifically designed for a 1021 kb target enrichment region covering known tumor-associated driver mutations from 12 different types of tumors. Modifications to the manufacturer's protocol are detailed in the following steps.\nBlocking\n\t\nAdd 1.5 µg of pooling libraries (maximum number of libraries to pool for cfDNA is 6, gDNA is 20) from step 2, 8 µL of P5 Block(100P), 8 µL of P7 Block(100P), and 5 µL of Cot-1 DNA (1 µg/µL) in a sterile tube. Dry the contents of the tube using a vacuum concentrator set at 60 °C.\nHybridize the DNA capture probes with the library.\n\t\nAdd the following components to the tube from step 3.1: 8.5 µL of 2X Hybridization buffer, 2.7 µL of Hybridization enhancer, and 1.8 µL of nuclease-free ddH2O.",
    "Mix by pipetting up and down and incubate in a thermomixer at 95 °C for 10 min.\nFollowing incubation, immediately add 4 µL of the Custom Probe. Incubate samples in a thermal cycler at 65 °C with lid heated to 75 °C for 4 h.\nDNA fragments capture\n\t\nIncubate the hybridized target DNA with streptavidin beads followed by washing the beads to remove unbound DNA. Use the commercial kit according to manufacturer's instructions to get a final 20 µL of resuspended beads with captured DNA fragments.\nAmplification of the captured DNA fragments\n\t\nPerform PCR using the commercial kit with 2 µM backbone oligonucleotides, according to manufacturer's instructions.\nWhen the PCR reaction is completed, add 45 µL of suspended beads directly to the PCR product and enrich the amplified target DNA fragments bound to the beads by elution with 30 µL of 10 mM Tris-HCl (pH 8).\nQuantify the DNA fragments with the library quantification kit and determine the average fragment length by the Bioanalyzer (Figure 2).\n4. Sequencing\nSequence multiplexed libraries using 75 bp paired-end runs on a benchtop sequencer for 18 h. Total data produced is up to 60 Gigabytes, 15G is required for patient sample cfDNA and 1G for control sample gDNA.\n5. Data analysis workflow\nNOTE: Figure 3 displays the general work flow and data analysis process. Data analysis parameters and commands are shown below.\nFilter low-quality reads and correct for errors and masking of UID using NCfilter.\n\tNCfilter(own)\n\tNCfilter filter -l 5 -q 0.5 -n 0.1 -T 3 -G -1 fastq1 -2 fastq2\n\trealSeq(own)\n\tpython bin/realRealSeq MaskUID -1 fq1 -2 fq2 -o output dir -p prefix -u 4 -s 7 -m 3 -i uidFile -f.",
    "Referencing genome hg19 (human genome 19), locate the sequencing results using BWA (version 0.7.12-r1039) mem and realign with Genome Analysis Toolkit (GATK) (version 3.4-46-gbc02625).\n\tbwa mem -t 3 hg19 fastq1 fastq2\n\tjava -d64 -server -XX:+UseParallelGC -XX:ParallelGCThreads=8 -Xms2g -Xmx10g -\n\tDjava.io.tmpdir=/tmp/ -jar\n\tGenomeAnalysisTK.jar -T RealignerTargetCreator -R hg19 -L targetRegion -known dbsnp —\n\tallowPotentiallyMisencodedQuals -nt 10 -I cancerBam -I normalBam\n\tjava -d64 -server -XX:+UseParallelGC -XX:ParallelGCThreads=8 -Xms2g -Xmx10g —\n\tDjava.io.tmpdir=/tmp/ -jar GenomeAnalysisTK.jar -T IndelRealigner -R hg19 -known dbsnp\n\t-allowPotentiallyMisencodedQuals — targetIntervals intervals -I cancerBam -I normalBam\nCluster the duplicates according to the UID and position of the template fragments, which will correct the error bases introduced by PCR/sequencing and modify the base quality.\n\trealSeq(own)\n\tpython realSeq/bin/realSeq CLUSTER -b unmarkdup_sort_merge.bam -r chipRegion -o output_dir -p\n\tprefix -m 6\nRe-align the clustered duplicates by BWA mem.\n\tbwa mem -t 3 hg19 fastq1 fastq2\nPerform a local realignment followed by a recalibration of base quality score using GATK (version 3.4-46-gbc02625).\n\tLoacal realignment: java -d64 -server -XX:+UseParallelGC -XX:ParallelGCThreads=8 -Xms2g -Xmx10g -Djava.io.tmpdir=/tmp/ -jar GenomeAnalysisTK.jar -T RealignerTargetCreator -R hg19 -L targetRegion -known dbsnp -allowPotentiallyMisencodedQuals -nt 10 -I cancerBam -I normalBam\n\tjava -d64 -server -XX:+UseParallelGC -XX:ParallelGCThreads=8 -Xms2g -Xmx10g -Djava.io.tmpdir=/tmp/ -jar GenomeAnalysisTK.jar -T IndelRealigner -R hg19 -known dbsnp -allowPotentiallyMisencodedQuals -targetIntervals intervals -I cancerBam -I normalBam\n\tbase quality-score recalibration: java -d64 -server -XX:+UseParallelGC -XX:ParallelGCThreads=8 -Xms2g -Xmx10g -Djava.io.tmpdir=/tmp/ -jar GenomeAnalysisTK.jar -T BaseRecalibrator -R hg19 -L targetRegion -knownSites dbsnp -knownSites cosmic -allowPotentiallyMisencodedQuals -nct 10 -I bam -o grp java -d64 -server -XX:+UseParallelGC -XX:ParallelGCThreads=8 -Xms2g -Xmx10g -Djava.io.tmpdir=/tmp/ -jar GenomeAnalysisTK.jar -T PrintReads -I bam -BQSR grp -o outbam -R hg19 -nct 8 -allowPotentiallyMisencodedQuals",
    "For SNV (single-nucleotide variant) and INDEL (small insertions or deletions) calling, the accuracy of the low frequency mutations is further confirmed by GSR (Good Support Reads) with both forward and reverse strand read pairs and filtration through control group (germline mutations) and the baseline database.\n\trealDcaller(own)\n\tpython realDcaller -f hg19 -r chipRegion -C baselineDB -O -L 2 cancerBam normalBam -p 30\nUse baseline samples as a control for CNV (copy number variation) calling.\n\tNCcnv(own)\n\tpython NCcnv -o cnvdir -t tmpdir -r chipRegion cnv --normgt normalBam --tumgt cancerBam --repdb repeatMarsk\nRealigned unmapped, clips and discordant pair reads to call SV (Structural Variations).\n\tNCsv(own)\n\tpython NCsv -t tmpdir -r hg19 -o outputdir -x transcript -w bwapath -n 4 normalBam cancerBam\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}