{
  "id": 18428,
  "origin_website": "Jove",
  "title": "Bioluminescence-Based Tumor Quantification Method for Monitoring Tumor Progression and Treatment Effects in Mouse Lymphoma Models",
  "procedures": [
    "All procedures involving mice complied with European Union guidelines, French regulations for animal experimentation (Ministry of Agriculture Act No. 2001-464, May 2001), and the guidelines of the Institut National de la Santé et de la Recherche Médicale (INSERM) Committee on Animal Research, and were approved by the relevant local committee (the Charles Darwin Ethics Committee for Animal Experiments, Paris, France; Permit Number: p3/2009/004).\n1. Cell Preparation\nGrow mouse B lymphoma cell line A20.IIA-luc2 in RPMI-1640 Glutamax medium supplemented with 10% fetal calf serum, 100 µg/ml penicillin, 100 µg/ml streptomycin, 10 mM sodium pyruvate, 50 µM 2-mercaptoethanol, and 0.50 mg/ml hygromycin B.\nMaintain cell culture at 37 °C, 5% CO2 and change medium every two to three days. Harvest 5 ml of the cell suspension with a pipette one day after changing the medium.\nSpin cells at 300 × g for 10 min and suspend the cells in 3 ml sterile phosphate-buffered saline (PBS). Repeat this step twice to wash the cells.\nMix 15 µl of cell suspension with 30 µl Trypan Blue labeling before loading a Malassez counting chamber. Calculate the cell concentration with the formula: Concentration (cells/ml) = Number of cells in the counting grid * 3 * 1000.\nSpin the cells one more time at 300 x g for 10 min. Remove supernatant with a pipette. With C the concentration calculated at step 1.4), the number of cells is N = C*3.",
    "Calculate the volume of sterile PBS 1x required to obtain cell suspension A at a concentration of 5 x 107 cells/ml with the following formula: PBS Volume (ml) = N / (5 x 107). Suspend the cell pellet (from step 1.5)) in the volume of sterile PBS 1x calculated in the previous sentence. Cell suspension A is to be used in the SCL model (in vivo injected volume is 100 µl: 5 x 106 cells).\nPipette 10 µl of cell suspension A and add 90 µl of sterile PBS in a 1.5 ml tube to obtain 100 µl of cell suspension B at 5 x 106 cells per ml. Cell suspension B is to be used in the PIOL model (in vivo injected volume is 2 µl: 1 x 104 cells).\n2. Luciferin\nDilute 1 g of D-luciferin potassium salt powder in 30 ml of sterile PBS 1x in a 50-ml tube and shake for a few seconds to dissolve the aggregates.\n\tNOTE: Because luciferin is light-sensitive, prepare 500 µl aliquots in dark 1.5-ml microcentrifuge tubes.\nStore the aliquots at -20 °C.\n\tNOTE: The aliquots can be stored for several months.\n\tAfter thawing, the aliquots must not be stored for more than 1 day at + 4 °C. Freezing-thawing cycles are preferable to storage at 4 °C.\nInject 100 µl of D-luciferin potassium salt solution intraperitoneally for each imaging assay.\n\tNOTE: This solution corresponds to 3.3 mg per mouse for a dose of 150 mg/kg.\n3. Anesthetic Mixture and Anesthetization\nPrepare an anesthetic solution by mixing ketamine 120 mg/kg and xylazine 6 mg/kg in sterile PBS 1x.",
    "Inject 60 µl of anesthetic mixture intraperitoneally for each imaging assay with a 25 G needle. For surgery (with the PIOL or SCL model), inject 80 µl of the mixture to obtain a deeper anesthesia. Put the mouse back in its cage.\nWhen the mouse appears immobile, remove it from its cage and gently squeeze the mouse's leg between fingers. If the mouse reacts with an escape reflex, wait several min. Repeat the action until the mouse does not react, which confirms satisfactory anesthetization.\nPlace the mouse on a warming plate or under a warming light.\nApply eye ointment to avoid eye dryness during anesthetization for the imaging assay or for SCL surgery. Apply the eye ointment after surgery for the PIOL model.\n4. Surgery and Cell Inoculation\nNOTE: Perform all surgical procedures on a warming plate or under a warming light, in a type 1 microbiological safety cabinet in an animal biosafety level 2 facility. All surgical tools used in this section were autoclaved before use. \nSubcutaneous Lymphoma Model:\nPrepare 100 µl of the cell suspension obtained in step 1.6 in a 1-ml syringe with a 25 G needle. Gently squeeze the mouse skin on the flank between fingers, at the injection site. Insert the needle exactly into the skin fold. To ensure subcutaneous injection, do not place the needle deep into the tissue.\n\t\t\nInject the cells into the skinfold. Observe whether a little liquid ball appears under the skin to confirm that the injection was performed correctly.\nPIOL model:\n\tNOTE: This procedure requires 2 operators, referred to here as operator 1 and operator 2.\n\t\nRemoval of conjunctiva:\n\t\t\nHave Operator 1 place the mouse under a dissecting microscope. Press gently with the fingers at each side of the eye to clear it. Maintain this position.",
    "Have Operator 2 look through the dissecting microscope. Grip the conjunctiva with a small pair of pliers in one hand; with the other hand, cut the conjunctiva just below the pliers with a small pair of surgical scissors.\nHave Operator 1 release the eye of the mouse pressed at step 4.2.1.1)\nCell injection:\n\t\t\nPrepare a 10-µl blunt precision syringe. Wash it by pumping sterile deionized water through it. Repeat twice or three times to ensure there are no bubbles in the syringe. Then prepare 2 µl of cell suspension for injection.\nHave Operator 2 press gently with the fingers of one hand at each side of the eye to clear it. Maintain this position.\nHave Operator 1 grip the edge of the eye with a small pair of pliers in one hand and pull it gently backwards to stretch the tissue.\nHave Operator 2 look through the dissecting microscope. With the other hand, make a small hole in the inferior eyeball of the mouse with a 32 G needle.\nHave Operator 2 put down the needle and pick up (with the same hand) the precision syringe and insert the needle into the hole made at step 4.2.2.4.\nHave Operator 1 push on the syringe plunger with the other hand.\nHave Operator 2 verify with the dissecting microscope that the cell suspension in the syringe has been correctly injected inside the eyeball (the liquid flow is easily observable).\nHave Operator 2 remove the precision syringe.\nHave Operator 1 release the edge of the animal eye gripped at step 4.2.2.3)\nHave Operator 2 release the sides of the eye pressed at step 4.2.2.2)\nApply the eye ointment immediately.\n\t\t\tNOTE: If all steps were performed correctly, the mouse should not bleed at all during this procedure.\n5. Bioluminescence Imaging – Day 0",
    "NOTE: All products injected into the mouse must be at RT before injection. After the tumor cells have been inoculated, and while the animal is still anesthetized, proceed to these steps for the imaging.\nTurn on the imager and open the acquisition software. Initialize the camera, the stages, and the lenses by clicking on the \"Initialize\" button. The initialization will take 10 to 15 min to be complete.\nInject 100 µl of D-luciferin potassium salt solution intraperitoneally with a 25 G needle. Do not administer it intravenously. If intravenous administration is required for any reason, the D-luciferin sodium salt must be used rather than D-luciferin potassium salt.\n\tNOTE: Luciferin is the excess reactant at this concentration; therefore the bioluminescence signal reaches a plateau after 3 to 7 min and persists for more than 30 min.\n10 min after D-luciferin injection13, place the subject mouse in the imager. Place the mouse in its natural position, its back towards the camera, in as flat a position as possible. This position is natural and easily reproducible.\nTick the auto-exposure feature, and click on Acquire to acquire the back (posterior) image of the animal, with the auto-exposure feature.\n\tNOTE: The auto-exposure feature optimizes exposure time by calculating it from a 1-sec exposure image. If the mouse's bioluminescence signal is negative or very low, the optimal exposure time might be automatically set to more than 20 min. In this case, an exposure time of 8 to 10 min may be a good compromise. Exposure time may be set manually, but the images must not contain saturated pixels.\nTurn the mouse over to expose the front of the mouse to the camera. Try to flatten the mouse and spread its anterior limbs so that they do not block the chest.",
    "Acquire a front image of the animal. Verify that the auto-exposure checkbox is still ticked and click again on the \"Acquire\" button.\n\tNOTE: The front image can be acquired before the back image and vice versa. The exposure time of front and back images can be different depending on the relative intensity of each side of the mouse. It is calculated automatically when using the auto-exposure feature. Quantification uses only the photon flux (photons per sec) and does not depend on exposure time.\nPlace the mouse on a warming plate or under a warming light until it recovers from the anesthetic and then place it back in its cage.\n6. Bioluminescence Imaging – After Day 0\nTurn on the imager, initialize the camera, the stages, and the lenses as in step 5.1).\nAnesthetize the mouse with an intraperitoneal injection of 60 µl of the ketamine (120 mg/kg) / xylazine (6 mg/kg) mixture (see steps 3.1 to 3.5).\n\tNOTE: This method of anesthetization allows imaging every 5 days. To perform daily imaging, a method that uses isoflurane as the anesthetic and a bioluminescence imager suitable for use with this anesthetic is required.\nAcquire front and back images of the animal, using the auto-exposure feature, as in steps 5.5) and 5.6). Handle the mouse as in step 5.7).\n7. Bioluminescence Quantification and Image Analysis\nNOTE: The luminoscore method is based on image analysis. Once the images have been acquired according to the steps above, the quantification can be performed at any time (including immediately after acquisition), to associate a luminoscore to each mouse at each time point.",
    "Display the \"Tool Palette\" by clicking on the \"View\" menu and then click on \"Tool Palette\" if not already displayed. Click on the \"ROI Tool\" tab of the Tool Palette. Choose the \"Contour\" button and then select \"Free draw\".\nManually mark the Region of Interest (ROI) around the mouse by following the edges of the mouse on the front view. Close the contour with a right click on the computer mouse.\nClick on the \"View\" menu and then \"ROI Measurements\". Make sure \"Radiance (Photons)\" is selected in the \"Measurement Types\" scrolling menu on the bottom left of the \"ROI Measurements\" window. If not, select it. Then measure the photon flux (ph/s) by recording the value in the \"Total Flux [p/s]\" box.\n\tNOTE: Do not use Radiance or any other unit that is relative to the ROI surface area.\nRepeat steps 7.2) and 7.3) for the back view.\nSum the two photon flux values obtained from front and back view. The result is the luminoscore.\nCompare the values for each group using an appropriate statistic test (non-parametric two-tailed Mann-Whitney test, for instance)14."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}