{
  "id": 17423,
  "origin_website": "Jove",
  "title": "Subconjunctival Administration of Adeno-associated Virus Vectors in Small Animal Models",
  "procedures": [
    "All animal procedures were performed in accordance with the regulations of the Institutional Animal Care and Use Committee at the University of North Carolina at Chapel Hill. The use of AAV vectors is a Biosafety Level 1 biohazard risk. Wear proper personal protective equipment, including a lab coat, gloves, and goggles when handling AAV. For the experiment described herein, a recombinant AAV vector packaged with the serotype 8 capsid and encoding a generic ubiquitous cytomegalovirus (CMV) promoter controlling the expression of green fluorescence protein (GFP) was utilized.\n1. AAV vector handling and storage\nStore the virus in a -80 °C freezer in 100 µL aliquots in siliconized or low-retention microcentrifuge tubes.\nThaw all vector stock solutions on ice before use.\n\t​NOTE: Dyes such as sodium fluorescein solution (at a final concentration of 0.1-2%) are often mixed with the AAV vectors to visualize the injected solution. Additionally, visualization of injected solutions helps detect air bubbles and monitor AAV distribution and/or leakage after injection.\n2. Subconjunctival (SCJ) injection\nAssemble the injection system.\n\t\nTo assemble the injection system, place a stereomicroscope and a syringe pump in a biosafety cabinet.\n\t\tNOTE: An infusion pump is needed to perform injections with high precision. Herein, a Standard Infuse/Withdraw Programmable Syringe Pump is utilized (see the Table of Materials), which includes a tight grip and a secure syringe clamp for syringes ranging in volume from 0.5 µL to 60 mL. This pump also offers enhanced flow performance with high accuracy and smooth flow rates from 1.28 pl/min to 88.28 ml/min.\nCut the polyethylene tubing to a length of approximately 50 cm (see the Table of Materials).\nInsert the hub end of a 36 G needle into one of the ends of the tubing.",
    "NOTE: Slide the needle hub end into the tube for ~3 mm to ensure that no leakage occurs. The 36 G needle is used for the subsequent SCJ injection. Needles ranging between 32 G and 36 G are the most commonly used sizes for SCJ injections. The use of a hemostat to assist this step is highly recommended to avoid the potential risk of sharps injury.\nFill a disposable 3 mL syringe with sterile water; insert this disposable syringe into the side of the tube opposite the needle and flush the water throughout the tubing/needle. Repeat this step with 70% alcohol.\nRepeat step 2.1.4 three more times, alternating flushes with sterile water and 70% alcohol, to disinfect the tubing and ensure no leaks, clogs, or damage are observed throughout the tubing.\nUse the disposable 3 mL syringe to fill the tubing with sterile water and leave the tubing attached to the disposable syringe.\nPlace a piece of parafilm on the bench surface and add a pool of sterile water to it (~1 mL). Submerge the portion of the tubing connected to the needle into the pool of sterile water. Pull the disposable syringe out from the tube opening at the opposite end to prevent any air from entering the tubing/needle system upon removal of the syringe. Leave the portion of the tubing connected to the needle submerged in the pool of water.\n\t\tNOTE: Perform procedures 2.1.4 to 2.1.7 in a laminar hood.\nFill a 10 µL Hamilton syringe/needle with sterile water and avoid air in the syringe. Connect the Hamilton syringe/needle to the remaining open end of the tubing by submerging the tubing and needle tip of the Hamilton syringe into the pool of sterile water on the parafilm.",
    "Press the fast reverse button on the pump screen to move the pusher block to the approximate length of the syringe. Unscrew the bracket clamping knobs to loosen the retaining brackets on the pusher and the syringe holder blocks. Load the Hamilton syringe onto the syringe holder block and secure the syringe following the manufacturer's instructions.\n\t\tNOTE: To secure the syringe, the syringe barrel clamp should be tight against the syringe barrel; however, do not overtighten, especially when using glass syringes. The syringe plunger should be secured by the pusher block retaining bracket.\nAdjust the parameters in the pump settings screen.\n\t\t\nPress the Force button, and set the force level at 30%. Accept the changes to go back to the settings screen.\nPress the quick start button and select Method | Infuse/withdraw.\nFor the Syringe, select Hamilton 1700, glass, 10 µL. Select the infusion and withdraw rate and the injection volume.\n\t\t\tNOTE: The Force level is set depending on the syringe type/material/capacity/manufacturers; see factory manufacturer instructions for suggested force for each syringe. The injection speed used in this experiment was 200 nL/s. SCJ injections are relatively safe, and there is less of a concern for the induction of elevated intraocular pressure (IOP) resulting from the injection. A slower injection speed is often desirable for certain applications to avoid reflux into the needle and maintain consistency in injections among animals.\nEject the water from the Hamilton syringe but leave the tubing and injection needle full of water. Slightly pull back on the Hamilton syringe by pressing the Reverse button to introduce a small air bubble in the tubing/needle.\n\t\tNOTE: The air bubble will serve as a barrier between the water in the tube and the therapeutic drug (in this case, AAV), ensuring the accuracy of the administered dose.",
    "Withdraw the virus by placing the injection needle into an aliquot of the virus stock. Ensure that a visible air bubble remains between the virus and the water in the tubing.\n\t\tNOTE: AAV vectors can bind to the plastic tubing and metal needle, leading to a loss of virus and/or inaccurate dosing regimens. Thus, to ensure rigor, reproducibility, and an accurate dose of AAV, precoating the surfaces that subsequently come into contact with the AAV is recommended. To coat the tubing/needle system with the virus, draw the viral vector solution into the tubing/needle and incubate it at room temperature for 10 min to allow for saturation of virus binding to the wall of the needle and/or tubing. Discard the virus.\nVirus injection\n\t\nAnesthetize the mouse with inhaled anesthesia (isoflurane) or intraperitoneal injection of ketamine/xylazine/acepromazine. Confirm the surgical plane of anesthesia by a lack of response to firm toe pinches.\n\t\tNOTE: Use female and/or male C57BL/6J or BALB/c mice that are at least 6 weeks old. Ketamine/xylazine/acepromazine doses are as follows: ketamine at 70 mg/kg, xylazine at 7 mg/kg, and acepromazine at 1.5 mg/kg.\nApply topical anesthesia to the eye that will receive the injection.\n\t\tNOTE: Use 0.1% proparacaine hydrochloride and/or tetracaine hydrochloride ophthalmic solution (0.5%) for topical anesthesia.\nApply topical ointment to the other eye that will not receive an injection to prevent dryness and injury.\nPosition the mouse on the microscopic stage and expose the mouse eye under the stereomicroscope.\nPlace two fingers on the eyelid and slightly pull it away from the mouse's eye to expose the conjunctiva, which is the inner membrane connecting the eyelid to the sclera.\nGrab the conjunctiva with forceps.\nRelease the eyelid and hold the needle with the bevel facing upwards using the dominant hand.",
    "Insert the needle into the conjunctiva. Insert the needle until the bevel is completely covered by the conjunctival membrane. Lay the needle against the globe.\n\t\tNOTE: As the conjunctiva is a clear membrane, the needle tip/bevel is easily visible.\nStart the injection by pressing the Start button using the footswitch.\n\t\tNOTE: The movement of the air and the Hamilton plunger are synchronized; any delay indicates excess air in the injecting system or possibly a loose connection between the tubing, needle, and/or syringe components.\nAfter the injection is finished, hold the needle in place for 10 s before withdrawing the needle from the conjunctiva to decrease the chances of backflow.\n\t\tNOTE: It is common for a bleb to appear at the site of the SCJ injection. Such blebs normally resolve completely within a few hours post injection.\nPut a drop of the topical lubricant gel on the mouse's eyes to prevent ocular dryness/injury, and then place the mouse on a heating pad to recover.\nPerform ocular examinations such as tear production, IOP, and slit-lamp examination in conjunction with corneal fluorescein staining to assess ocular abnormities following the injection.\n\t\tNOTE: Tear production is measured by a Phenol Red Thread test, and a tonometer is often used to examine the IOP of the mouse eye. It is reported that some intraocular injections, such as intravitreal injections, might result in a significant increase in IOP; however, IOP changes after SCJ injection are not obvious13,22,23,24.\nAAV biodistribution and transduction efficiency examination following subconjunctival injection\n\t\nTo investigate the viral genome biodistribution and/or transduction profile of AAV vectors delivered via SCJ, euthanize the mice by AVMA approved method.\n\t\tNOTE: In this experiment, the mice were sacrificed 8 weeks post injection.",
    "For biodistribution and transgene expression in targeted ocular compartments, dissect the relevant tissue of interest such as the eyelids, cornea, conjunctiva, eye muscle, retina, and optic nerve. Flash-freeze all tissues and store at -80 °C. To examine whole-body AAV biodistribution, collect organs such as the submandibular lymph nodes and liver, and flash-freeze and store them at -80 °C.\nUsing a DNA/RNA extraction kit, collect gDNA and RNA from the same sample to examine transgene expression and AAV biodistribution, respectively. If only vector biodistribution is desired, use a DNA extraction kit to extract gDNA.\nPerform standard qPCR and RT-qPCR to determine the AAV vector biodistribution and cDNA abundance using vector transgene-specific primers/probes13,25.\nFor histology analysis, fix the eyes, embed them in paraffin, and section them at a thickness of 5 µm. Perform standard immunofluorescence staining to reveal transgene expression26.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}