{
  "id": 13308,
  "origin_website": "Jove",
  "title": "Minimally Invasive Embryo Transfer and Embryo Vitrification at the Optimal Embryo Stage in Rabbit Model",
  "procedures": [
    "All experimental procedures used in this study were performed in accordance with Directive 2010/63/EU EEC for animal experiments and reviewed and approved by the Ethical Committee for Experimentation with Animals of the Universitat Politècnica de València, Spain (research code: 2015/VSC/PEA/00170). XGD, FMJ, MPVC and JSV holds an authorization certificate issued by the Valencian governmental administration to experiment on animals. XGD is authorized to in situ supervise the welfare and care of the animals during the experiment.\n1. Embryo Transfer\nPreparation of recipient females\nUse only sexually mature females (> 4.5 months old).\nOne week before ET, adapt females to a 16 h light/8 h dark regime to initiate follicular growth and enhanced female receptivity.\nSelect the recipient females, observing the turgidity and color of the vulva. If the vulva is turgid and reddish, the female is receptive.\nInduce pseudopregnancy (ovulation) by a single intramuscular injection of 1 µg of buserelin acetate (synthetic analogue of Gonadotropin-releasing hormone) regardless of body weight.\n\t\tNOTE: Normally, 0.8 µg is a suitable dose for ovulation induction in medium-size rabbits (4-5 kg), so 1 µg generally guarantees the ovulation.\nInduce ovulation as many days beforehand as the age of the embryos to be transferred (for example, 70-72 h before fresh morula ET).\nAnesthesia and analgesia\nWeigh the rabbit and load the following anesthetics and analgesics.\n\t\t\nIn a 1 mL syringe with a 30G needle: load xylazine (5mg/kg) and buprenorphine hydrochloride (0.03 mg/kg). In another 1 mL syringe with a 23G pericranial needle, load ketamine hydrochloride (35 mg/kg).\nHold the rabbit and inject the xylazine-buprenorphine mixture intramuscularly.\nInsert the pericranial needle with ketamine in the marginal ear vein, slowly introducing all the syringe contents intravenously.\nFix the needle and leave it inserted throughout the remaining steps to administer more anesthesia if necessary.",
    "Leave the rabbit in the cage (clean and without any other animals) on a warm stage.\nOnce unconscious, apply eye ointment to avoid dryness of the eye and check for the absence of the palpebral freflex.\n\t\tNOTE: This protocol provides a surgical anesthesia plane for a minimum of 30 min. If a longer time is required, inject additional dosages with half of the amount of ketamine hydrochloride described in 1.2.1 after 30 min.\nMonitor the depth of anesthesia by checking the pedal reflex and breathing movement. Changes in the breathing pattern to an irregular and faster rate indicate loss of the proper plane of anesthesia.\nMonitor the color of the mucous membranes (eyes, lips, etc.), respiratory rate (30-60 breaths per minute), heart rate (120-325 beats per minute) and rectal temperature (38-39.6 °C).\nEight hours before transfer, withhold food from animals to avoid the greater gut size and activity until the ET process is finished. Leave free access to water.\nEmbryo preparation\nWarm the embryo manipulation media to 25 °C: Base Medium (BM), consisting of Dulbecco's Phosphate-Buffered Saline (DPBS) supplemented with 0.2% (w/v) of Bovine Serum Albumin.\nWorking under a stereomicroscope, rinse fresh or thawed (Step 2) embryos with BM.\nUsing sterile gloves, attach an appropriately configured 17G epidural catheter to a 1 mL syringe.\nAspirate 1 cm of BM into the catheter, followed by a small air bubble.\nAspirate 5-7embryos in a volume of 10 µL of BM, followed by another small air bubble.\nFinish loading the catheter by aspirating 1 cm of BM.\nEmbryo transfer\nConsider the use of sterile gloves, gown and mask to ensure an aseptic environment.\nSterilize surgical instruments, clean the surfaces where surgery will be performed, and wipe them with 70% ethanol.\nPerform anesthesia as previously detailed (step 1.2), checking for loss of reflexes.",
    "Shave the fur from the ventral abdomen with an electric razor.\nPrepare the ventral abdomen aseptically.\n\t\t\nClean the surgical area and remove any remaining hair. Wash the surgical area with a chlorhexidine gluconate soap. Sanitize the area with chlorhexidine solution and ethanol 96º (3 times).\nPlace the animal on a warm surgical table, in Trendelenburg's position (head down at 45°) to ensure that the stomach and intestines are cranially located. Consider the evacuation of the bladder if it is turgid. If any viscera are damaged in the process, the animal may die. It is therefore important to have them properly located (Figure 1).\nCover the area using a sterile towel, with a hole (fenestration) exposing the shaved area, to separate the surgical site from any potential contaminating areas.\nInsert one endoscopic trocar 5 cm into the abdominal cavity, 2 cm caudal to the xiphoid process, and insufflate through it the peritoneal cavity with a pressure-regulating mechanical insufflator.\n\t\tNOTE: The intra-abdominal pressure should be 8-12 mmHg with CO2 (Figure 1A).\nInsert the endoscope camera through the endoscopic trocar (Figure 1B).\n\t\tNOTE: Identify the reproductive tract, determining the status and position of the infundibulum and ampulla before ET to facilitate the next steps.\nInsert the 17-G epidural needle into the inguinal region between 2-3 cm from the infundibulum (Figure 1B).\nIdentify the entrance of the infundibulum (Figure 2A, 2B).\nInsert the loaded catheter (step 1.3) through the epidural needle into the abdomen (Figure 1C).\nLocate the oviduct and insert 1-2 cm of the epidural catheter through the infundibulum in the ampulla (Figure 2A-2C). Do not progress very far into the oviduct to prevent damage and hemorrhage.",
    "Release the embryos into the oviduct by gently pressing the plunger of the syringe coupled to the catheter (Figure 2D-2F). Both air bubbles must exit the catheter.\nRemove the catheter just after the embryos have been released.\nRinse the catheter, aspirating and releasing manipulating medium to check the absence of the embryos and confirm their successful transfer.\nRepeat steps 1.4.11 to 1.4.16 in the other side of the uterus, if desired.\nRemove the epidural needle and endoscope camera.\nRelease CO2 through the endoscopic trocar. If excess gas remains in the abdomen of the animal, it will have pain and discomfort.\nRemove the endoscopic trocar from the abdominal cavity. Remove the surgical towel.\nDiscontinue anesthesia.\nClean the incision made by the trocar with chlorhexidine solution. Close the incision made by the trocar with a micronized aluminum and a plastic dressing. \nPostoperative care\nTreat the animals with antibiotics: 10 mg/kg of enrofloxacin, subcutaneously, every 24-h for 5 days.\nAdminister analgesics: buprenorphine hydrochloride (0.03 mg/kg), intramuscularly, each 12 hours for 3 days; Meloxicam (0.2 mg/kg), subcutaneously, every 24-h for 3 days.\nMonitor the animals for at least 30 min after surgery (depending on the animal and the dose of anesthesia used) making sure they recover their physiological conditions.\nIdentify the recipient (e.g., ear tattoo) and house animals individually in a clean cage with the appropriate environmental condition.\nimgsrc://cloudfront.jove.com/files/ftp_upload/58055/58055fig1.jpg\nFigure 1: Laparoscopic embryo transfer assisted by laparoscopy (External view). A) Insertion of the endoscopic trocar (one port). B) Insertion of the endoscopic camera and the epidural needle (black arrow). C) Insertion of the embryo transfer catheter (white arrow) through the epidural needle. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/58055/58055fig1large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/58055/58055fig2.jpg",
    "Figure 2: Laparoscopic embryo transfer assisted by laparoscopy (Internal view). A: Insertion of the catheter through the epidural needle into the abdominal zone. Asterisk indicates the infundibulum. B, C, D: The catheter loaded with the embryos is inserted into ampulla region across the infundibulum. E, F: Release of the embryos, confirmed by the visualization of a swollen oviduct. This figure has been adapted from Marco-Jiménez et al.38. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/58055/58055fig2large.jpg]\n2. Embryo Vitrification and Warming\nPerform all the manipulations at room temperature (around 22 °C) to reduce the vitrification solution toxicity at warmer temperatures.\n\tNOTE: Embryos can be moved using 0.1-2 µL automatic pipette in this protocol, but other similar devices to move the embryos dragging the minimum volume can be suitable.\nVitrify the embryos in a two-step addition procedure:\n\t\nPlace the embryos for 2 minutes in equilibrating solution consisting of 10% (v/v) ethylene glycol and 10% (v/v) dimethyl sulfoxide dissolved in BM.\nMove the embryos (from step 2.2.1) for 1 minute into vitrification solution consisting of 20% (v/v) ethylene glycol and 20% (v/v) dimethyl sulfoxide dissolved in BM.\nLoad the embryos into a 125 µL plastic ministraw (which contains one closed end with a cotton plug and one open extreme). The process is schematized in Figure 3.\n\t\nCouple the closed end of 0.125 μL ministraw with the appropriate microdispenser (e.g. Captroll III®). \nAspirate BM until 1/3 of the straw length, following by a small air bubble.\nAspirate the embryos in a volume of 40 µL of vitrification solution, followed by another small air bubble.\nAspirate BM until the first liquid fraction (step 2.3.2) reaches the cotton.\nClose the open end with a straw plug.",
    "Perform step 2.2.2 while step 2.3 is being done to ensure that no more than one-minute elapses, which would be toxic to embryos.\nPlunge the ministraw directly into liquid nitrogen to achieve vitrification.\nStore the ministraw in a dewar for nitrogen for the desired time.\nThaw the embryos in a single step.\n\t\nPlace the ministraw horizontally 10 cm from liquid nitrogen vapour for 20-30 s.\nWhen the crystallization process begins inside the ministraw, immerse the ministraw in a water bath at 25 °C for 10-15 s.\nRemove the ministraw plug and cut the cotton plug.\nWith a coupled microdispenser, expel all the ministraw content into a plate containing 0.33 M sucrose solution at 25 °C in BM for 5 minutes.\n\t\tNOTE: This step must be done quickly in order to reduce embryo exposure to the vitrification solution. \nMove the embryos to a new plate containing BM solution for another 5 min.\nConsider only non-damaged embryos (with intact mucin coat and zona pellucida) to continue with the ET.\n\t\tNOTE: Take into account that in thawed embryos, asynchronous transfers (e.g., 60-62 h in morula transfers) may improve the results by allowing a resynchronization between the embryo and the maternal endometrium.\nimgsrc://cloudfront.jove.com/files/ftp_upload/58055/58055fig3.jpg\nFigure 3: Schematization of correctly loaded straw. A) BM refers to the embryo manipulating media employed during vitrification. Embryos must be loaded in vitrification solution. B) Macroscopic appearance of the loaded straw with a magnified detail of the embryo position. This large-volume device allows us to vitrify large number of embryos, unlike minimum volume devices. Furthermore, the handling of this device is easier compared with minimum volume devices, while the results are similar in rabbits41. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/58055/58055fig3large.jpg]Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}