{
  "id": 13020,
  "origin_website": "Jove",
  "title": "Ex Vivo Placental Explant Flow Culture - Mimicking the Dynamic Conditions In Utero",
  "procedures": [
    "The ethics committee of the Medical University of Graz approved this study (31-019 ex 18/19 version 1.2 and 29-319 ex 16/17). Informed consent was obtained from all subjects involved in the study.\n1. Preparation for the flow experiment\nNOTE: The experiments are conducted in a bioreactor with integrated peristaltic pumps (see Table of Materials). The humidity, temperature and gas level inside the bioreactor can be adjusted.\nTurn on the bioreactor and make all prearrangements (e.g., calibration of the pumps, pre-warming, gas conditions and humidity) for the experiment according to the manual of the bioreactor. Before starting the experiment, the required settings (temperature, gas content, humidity) should be stabilized for a few hours or overnight. To do this, start the bioreactor and the software and then click on Change SetPoints under the menu item \"Incubator\".\nPre-warm PBS and the required medium (Endothelial Cell Growth Medium supplemented with provided supplements hEGF-5, HC-500 as well as 5% exosome-depleted fetal bovine serum, 1% penicillin/streptomycin) (see Table of Materials) to 37 °C.\n\t​\n2. Placental sample dissection\nImmediately after delivery, cut three times 2 cm3 placental samples from the mid-placental region as described in Kupper et al.3 Briefly, keep the samples in PBS. Discard the chorionic plate, the maternal decidua and areas of visible infarcts from the specimen.\nDissect the remaining tissue specimen into villous explants with a cross-sectional diameter of about 0.5 cm (wet weight of about 7.5 mg). Transfer them into a Petri dish with fresh PBS.\nWash the explants in PBS by gently shaking them in the liquid with tweezers to remove blood residues.\n\t​NOTE: Dissect the samples in a Petri dish with PBS to pre-wash and prevent them from drying out and use sterilized/autoclaved tools for processing the tissue.\n3. Flow experiment",
    "Under a sterile hood, connect five chambers in series to the reservoir bottle using the luer locks according to the user manual of the flow chambers (see Table of Materials).\n\tNOTE: Sterilize and/or autoclave all materials before use, according to the respective manual. Use an air filter on the reservoir bottle for sterile gas exchange. To open and close the chambers, gently squeeze in the lugs of the chambers. Step 3.1. may also be prepared earlier.\nTurn the chambers upside down and open them by removing the bottom. Use forceps to transfer the metal plates centrally in the top part of the chambers with the pins pointing upwards.\nFill the chambers with 1 mL of pre-warmed medium (37 °C). Then fill the reservoir with an additional 20 mL. The circuit requires a total of 25 mL, including the volume in each flow chamber, in the tubes, and reservoir bottle. Under the flow, the final volume of the medium in a filled chamber is 2 mL.\nUse forceps and transfer one villous explant after the other between the needles of the metal plate in the chamber. Let the needles slide between the placental villi to avoid puncture of the tissue. Transfer four explants into one chamber. Close the chambers by refitting the bottom carefully. A complete circuit contains a total of 20 explants. The chambers need to remain in an upside-down position.",
    "NOTE: Grasp the explants gently with the forceps; try not to squeeze them. Ensure the chambers and the circuit are completely sealed to prevent leakage. The chambers are always used upside down. The number of explants per chamber and the number of chambers themselves are variable. The procedure for first-trimester tissue is similar to that for third-trimester tissue with a small addition: to fix the villi, bend the needles slightly over the explants after the tissue has been transferred to the metal plate (personal communication Brugger et al.). This fixes the fragile tissue on the metal plate and prevents the samples from slipping off.\nTransfer the flow assembly into the bioreactor.\nConnect the flow circuit to the peristaltic pump within the bioreactor by connecting the pump tubing to the pump. Fix it on the 4th stage (one will hear it click four times).\nIf a static control is required, then also place the well plate into the bioreactor.\n\tNOTE: For static culture, five wells of a six-well plate are filled with 4 mL of medium per well and 4 villous explants per well. The filled well plate is also placed in the bioreactor and cultured in the same atmosphere as the flow culture explants. Further details are described in Kupper et al.3\nSet the pump mode to Manual under the menu item \"Pumps\". Then set the pump speed to 1 mL/min and start pumping the medium into the tubing by clicking on Run. While the circuit is being filled with medium, hold the chambers at an angle so that they are completely filled with medium.\n\tNOTE: See Supplementary Table 1 for the experimental settings for placental villous flow and static culture. Specifications of the flow and static system are provided in Supplementary Table 2.",
    "CAUTION: Carefully tilt the chamber during filling to prevent the specimens from slipping off the needles.\nAfter the fill-up is completed, the chambers remain in their upside-down position. Ensure the chambers are standing securely and upright, and close both lids of the bioreactor.\n\tNOTE: The final volume of the medium in a filled flow chamber is 2 mL. The experimental settings and the specifications of the flow chambers and well plates used in the experiments are described in Kupper et al.3\nIncubate the tissue for the desired time.\n\tNOTE: The temperature, gas level and flow rate can be monitored on the computer without opening the lid of the bioreactor again.\nStop the pump after incubation of the tissue for the desired time by clicking on Abort under the menu item \"Pumps\". Open the two lids of the bioreactor and then one flow chamber at a time. Carefully remove the explants from the metal plate using forceps.\nProcess the tissue and supernatant according to the selected downstream analysis. In this case, immunohistochemical staining and electron microscopy were performed3. See Supplementary Table 3 for the details of the antibodies used for immunohistochemistry and immunofluorescence.\n\tNOTE: After removing the tissue, drain the medium from the circuit by counterclockwise rotation of the pump.\nDisassemble and clean the flow circuit according to the manufacturer's instructions for the flow chambers and tubing."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}