{
  "id": 17203,
  "origin_website": "Jove",
  "title": "Full-Endoscopic Interlaminar Approach for Decompression of Lateral Recess Stenosis",
  "procedures": [
    "The study protocol was approved by the institutional review board of the Istanbul Faculty of Medicine.\n1. Preoperative procedures\nPerform the surgeries under general anesthesia. Set the endoscopic and optic instruments, and C-arm devices in the operation room.\nEnsure that the following tools are available for the procedure: dilator, working sleeve, endoscope with a 20° viewing angle and 177 mm in length with a 9.3 mm diameter oval shaft with a 5.6 mm diameter working channel, Kerrison punch (5.5 mm), rongeur (3-4 mm), punch (3-5.4 mm), tip control radioablator probe that applies the radiofrequency current of 4 MHz, fluid control irrigation and suction pump device, 5.5 mm oval burr with lateral protection, burr round, and the diamond round.\n2. Surgical technique\nPlace the patient in a prone position with thorax and pelvis support pillows. Flex the hip and the knee at the adjustable operation table to provide a wider interlaminar window. While the surgery can be performed by one surgeon, an assistant would ease the procedure.\nObtain an anteroposterior (AP) X-ray view to mark the L4-5 interlaminar window near the midline on the ipsilateral side. Ensure that the entry point is close to the midline to enable lateral access below the zygapophyseal joints.\n\tNOTE: The C-arm is a device that can rotate 360° around the patient and obtain AP and lateral X-ray views intraoperatively.\nMake a 1 cm incision with a #20 blade until the fascia of the paraspinal muscle is passed. Insert the dilator till it touches the facet joint. Acquire AP and lateral X-ray views to confirm the location of the dilator.\n\tNOTE: The dilator is inserted toward the facet joint so that it does not pass through the interlaminar window and injure the neural structures.",
    "Introduce the working sleeve over the dilator with an oblique opening showing the medial side. Acquire the lateral X-ray view again, confirming the position of the working sleeve. Then, remove the dilator.\nIntroduce the endoscope through the working sleeve. Perform the remaining procedure under continuous irrigation with isotonic saline to the operation field.\nAfter access has been achieved, remove the soft tissues-mainly the paraspinal muscles-using the rongeur. Expose the bony structures of the facet and the ligamentum flavum. Remove the superficial layer of the ligamentum flavum with a 5.4 mm punch for total exposure of the descending facet.\nBegin the bone removal from the medial side of the descending facet from its inferior tip, using the 5.5 mm oval burr with lateral protection to expose the ascending facet.\nThen, expose the ascending facet and its superior tip. The synovial joint is disrupted in this stage, and the ascending facet cartilage can be appreciated. Visualize the deeper layer of the ligamentum flavum here, attaching to the medial side of the ascending facet.\nUse the oval burr with lateral protection again for thinning the ascending facet so that the total removal can be achieved by the Kerrison punch. Use the Kerrison punch for further bone removal toward the lateral.\nThe extent of the resection is recommended to reach from the tip of the ascending facet to the middle of the caudal pedicle. Then, resect the ligamentum flavum using the punch from the midline toward the lateral.\nEnsure that the removal of the ligamentum flavum is medial to lateral and cranial to caudal to completely visualize the below lateral recess. Doing this otherwise would risk a dural tear, since the dura is more prominent in the midline.",
    "While resecting the ligamentum flavum, use the long side of the working sleeve to achieve some tension in the ligament. This way, the dura will separate from the ligament, and the ligament resection will be safer.\nRemove the epidural fat tissue with caution, using the rongeur, until adequate exposure to the neural structures is obtained. After caudal removal of the ligamentum flavum, remove the superior border of the caudal lamina using the Kerrison punch.\nHere, we expect to see the axilla of the nerve root. Mobilize the nerve root medially using the dissector to relieve it from any adhesions. If there is a discopathy contributing to the lateral recess stenosis, address it.\nMedialize the nerve root using the dissector, or turn the long side of the working sleeve. If there is a sequestrated or extruded material, remove it using the rongeur directly from an existing annulus defect. If there is a subligamentous protruding material, use the punch to open the posterior longitudinal ligament and the annulus fibrosis. In that case, evacuate the disc space by using the rongeur (Video 1).\nCoagulate the soft tissues using the radioablator. Here, obtain a lateral X-ray view to understand if the end plates are parallel and how deep it has proceeded. Establish the decompression by resecting parts of the medial descending and ascending facet, the cranial and caudal lamina, and the ligamentum flavum.\nSufficient decompression of the neural structures can be appreciated. Achievedecompression by resecting half of the pedicle and the ligamentum flavum at the lateral recess.\nAfter achieving hemostasis using the radioablator, complete the procedure by removing the endoscopic system. Close the wound with a single suture without any drainage.\n3. Postoperative procedures and follow-up\nThe hospital stay is short. Mobilize the patients on the same day as the procedure.",
    "If there are no further complaints, discharge the patients the next day.\n\tNOTE: Postoperative pain is low; thus, no need for extended painkiller use. Nonsteroidal anti-inflammatory drugs are commonly used agents if there is pain at the operation site. Rehabilitation and physical therapy are not necessary.\nRecommend the patients to be admitted to the outpatient clinic in the first and fourth weeks.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}