{
  "id": 1748,
  "origin_website": "Cell",
  "title": "Immunofluorescence microscopy-based detection of ssDNA foci by BrdU in mammalian cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCell culture and BrdU treatment (± IR)\nTiming: 2 days\nDetach T24 cells from maintenance culture flasks (T75 flasks) using Trypsin-EDTA (0.25%) by incubating flasks for a few minutes at 37°C and 5% CO2.\nCritical: Cell culture should be performed under a Class II Biological Safety Cabinet. Pre-warm cell culture medium and Trypsin-EDTA solution to avoid excessive thermal shifts in cells; Before starting any treatments, check whether cell morphology appears normal, and make sure there is no contamination present in any of the wells. To avoid contamination, make sure the forceps and the coverslips are sterilized before using them for cell culture. Do not open cell culture forceps outside the biological safety cabinet and always sterilize with 70% ethanol after use. Coverslip sterilization can be achieved by autoclaving.\nNote: Cell detachment time depends on the cell type and the presence of medium leftovers in the flask. Before proceeding with next steps, ensure that cells are detached from culture flasks.\nAlternatives: Mechanical scraping using sterile scrapers and PBS or PBS-EDTA solution (3 mM EDTA) can be used instead of trypsin-EDTA.\nNeutralize trypsin by adding at least 2 volumes of complete media (McCoy’s 5A Medium with 10% FBS).\nCollect cells into a Falcon tube of appropriate size.\nCentrifuge cells at 900–1,000 × g at 20°C–22°C for 3–4 min.\nGently aspirate media so as not to disturb the cell pellet at the bottom.\nResuspend cell pellets in complete culture medium.\nSeed cells into 6-well plates so they are around 50%–60% confluent the next day. Typically, for T24 cells: 0.4 × 106 cells per well.",
    "Note: Each well in a 6-well plate is a separate condition, so the number of coverslips needed per well depends on how many time points and technical replicates are required for a specific experiment\nCount cells in trypan blue solution (1:1 ratio of cells and trypan blue reagent) using a standard or automated hemocytometer.\nAdd sterilized round cover glasses (9 mm; thickness No.1) to the bottom of the wells with fresh media in it. Gently press down with forceps to make sure that the cover glasses stick to the bottom of the wells. Then, add cell suspension to the wells (total volume to 2 mL).\nThe next day, add 10 μM BrdU to 50%–60% confluent cells and keep on for 24 h.\nNote: When using other chemicals/inhibitors to study their effects on ssDNA generation, add these to the media with BrdU in the last few hours of the 24-h BrdU treatment at a concentration needed according to your specific compound. For example, add HU (500 μM) for 1 h before sample processing.\nAdd 10 μM EdU to cells recovered with the culture media containing BrdU in the last 20 min prior to cell fixation to mark cells in S phase.\nAlternatives: Instead of using EdU and the associated “Click-IT” reaction kit for S-phase staining outlined later in this protocol (step 20), cells can be stained with Cyclin A antibody instead. The staining procedure will be outlined below in step 35.\nRemove media with BrdU/EdU after 20-min EdU treatment, treat cells with DNA damage inducing agents, recover over time or fix immediately.",
    "Critical: The recovery time between radiation/other DNA damaging agents and fixation may influence the amount of ssDNA detectable under the microscope (Kilgas et al., 2021[href=https://www.wicell.org#bib14]). Radiation doses over 2–4 Gy can lead to exhaustion of the ssDNA-binding protein RPA involved in end resection (Toledo et al., 2013[href=https://www.wicell.org#bib18]), and therefore we recommend limiting irradiation dose to no more than 4 Gy for ssDNA microscopy-based assays. Doses as high as 10 Gy will also result in more cell death and consequently fewer cells available for analysis.\nIrradiate cells with 2 Gy IR. Non-irradiated cells can be kept in a separate 6-well plate and used as an internal control. During the recovery period after IR, control and irradiated cells are maintained in an incubator in complete media at 37°C and 5% CO2 for the desired amount of time prior to fixing and processing for IF.\nNote: Irradiation time to achieve 2 Gy total dose depends on the specific dose-rate used and varies between different irradiators.\nAlternatives: Both gamma- and X-ray based irradiators can be used. Alternatively, radiomimetic drugs such as bleomycin or neocarzinostatin can be used.\nPre-extraction and cell fixation\nTiming: Approximately 30 min\nTransfer coverslips into individual wells in a 12-well plate and wash the media off with 1 mL 1× ice-cold PBS.\nAspirate PBS and add 1 mL of ice-cold pre-extraction buffer for 5 min over ice.\nCritical: Cells can become more likely to detach after pre-extraction. Handle coverslips gently and carefully after this step. Add all the buffers from the wall of the culture dish and not directly onto cells to avoid cell detachment. Also, make sure to keep coverslips on ice during pre-extraction, and do not exceed 5 min to preserve cells (see troubleshooting 3[href=https://www.wicell.org#sec7.5]). Prepare a pre-extraction buffer fresh every time.",
    "Aspirate pre-extraction buffer and wash once with 1 mL cold 1× PBS to remove pre-extraction buffer.\nAdd 1 mL of freshly prepared ice-cold 4% paraformaldehyde (PFA) in PBS to each well. Incubate for 10 min at 20°C–22°C.\nCritical: Prepare 4% PFA fixing solution fresh every time (see troubleshooting 1[href=https://www.wicell.org#sec7.1] and 2[href=https://www.wicell.org#sec7.3]).\nWash cells twice with 1 mL 1× PBS at 20°C–22°C for 2–3 min each.\nBlocking and EdU detection for S-phase cell detection\nTiming: Approximately 1 h and 30 min\nAdd 1 mL of 5% BSA in PBS and incubate for 1 h at 20°C–22°C\nPrepare Click-iT reaction mixture according to the manufacturer’s protocol (Thermo Fisher).\nAdd 30 μL droplets of Click-iT reaction solution on a parafilm in a wet chamber.\nLift coverslips from the 12-well plate with forceps, dry extra liquid on a tissue paper and place upside down on the Click-iT reaction buffer.\nIncubate for 30 min in the dark.\nTransfer coverslips back to the 12-well plate before washing the cells.\nWash cells twice for 2–3 min.\nCritical: Make sure to keep coverslips in dark after the Click-IT reaction step, as the fluorescent azide dye is light-sensitive. When washing coverslips in the 12-well plate, cover the plates with aluminum foil during washes.\nPause point: Coverslips can be kept in the blocking solution at 4°C overnight (approximately 16 h) or up to a few days.\nAlternatives: Thermo Fisher Scientific “Click-iT” reaction kits come with a variety of different wavelengths for the fluorescent dye and can be chosen according to the choice of BrdU channel and DAPI channel, to avoid any potential cross-reactivity. Alternatively, “Click-IT” reaction kit can be replaced by staining cells with Cyclin A antibody, which would skip both the EdU labelling step (step 11) as well as the “Click-iT” step outlined in steps 20–25.\nAntibody staining",
    "Timing: 2 h and 30 min (up to 4 h and 30 min when Cyclin A antibody is added instead of EdU labelling)\nDilute primary BrdU antibody in 2.5% BSA/PBS solution (BrdU antibody concentration: 1:300).\nCritical: Ensure the coverslip is fully covered in antibody solution (see troubleshooting 4[href=https://www.wicell.org#sec7.7]).\nAdd 30 μL droplets of antibody solution on parafilm in a wet chamber.\nLift coverslips from the 12-well plate with forceps, dry extra liquid on a tissue paper and place upside down on the antibody droplet. Incubate for 1 h at 20°C–22°C in the dark.\nTransfer the coverslips back to the 12-well plate, fixed cells facing up, and add 1 mL 1× PBS at 20°C–22°C into each well for 5 min, then gently remove PBS by using a vacuum pump. Repeat this step 2 additional times (washing step; a total of 3 washing steps).\nDilute secondary fluorescent antibody (Alexa Fluor 488) in antibody dilution buffer.\nAdd 30 μL droplets of antibody solution on parafilm in a wet chamber.\nLift coverslips from the 12-well plate using forceps as in (3), dry extra liquid and place coverslip upside down on antibody droplets.\nIncubate for 1 h at 20°C–22°C in the dark.\nTransfer the coverslips back to 12-well plate as in (4), and wash with 1 mL 1× PBS at 20°C–22°C for 3 times and 5 min each.\nDilute Cyclin A antibody in 2.5% BSA/PBS solution (Cyclin A antibody concentration: 1:500).\nRepeat steps 27–29.\nDilute secondary fluorescent antibody (Alexa Fluor 594) in antibody dilution buffer.\nRepeat steps 31–34.\nPause point: Coverslips can be kept in primary antibody dilution at 4°C overnight (approximately 16 h) provided they are in a wet chamber so that the antibody solution will not dry out.\nMounting and microscopy image acquisition\nTiming: Approximately 1–3 days",
    "Use ProLong Diamond antifade with DAPI mounting solution to make individual droplets on microscopy slides and mount the coverslips (one droplet for each coverslip).\nCritical: Avoid bubbles when putting the mounting solution on microscopy slides as this will greatly decrease the quality of your imaging. Also, the mounting solution hardens relatively quickly, so make sure to add the mounting droplets just before adding coverslips on them (see troubleshooting 5[href=https://www.wicell.org#sec7.9]).\nAlternatives: Instead of using the Prolong Diamond antifade DAPI mounting solution, cells can be incubated in DAPI (Thermo Fisher Scientific; Cat #D1306) with PBS (1 μg/mL final concentration) for 10 min in the dark and mounted using ProLong Glass Antifade Mountant (Thermo Fisher Scientific; Cat# P36980). After incubation with DAPI, wash cells once for 5 min with 1× PBS (Step 30); As an alternative to DAPI dye, nuclear staining can be done with Hoechst 33342 dye (Sigma-Aldrich; Cat# B2261) in PBS (5 μg/mL final concentration) for 10 min at 20°C–22°C in the dark, followed by mounting with ProLong Glass Antifade Mountant (Thermo Fisher Scientific; Cat# P36980).\nDip coverslips gently in ddH2O to remove salts.\nDry extra liquid on kimwipes.\nCritical: Drying extra liquid should be done superficially and quickly to avoid excessive dilution of the mounting medium. When allowed to completely dry, auto-fluorescence can interfere with sample staining (see troubleshooting 5[href=https://www.wicell.org#sec7.9]).\nPlace coverslips sample-upper side down (fixed cells facing the mounting solution).\nIncubate at 20°C–22°C in the dark for 30 min minimum (up to 24 h at 20°C–22°C to let the mounting medium cure).\nStore at 4°C in the dark.",
    "Pause point: Microscopy slides mounted with ProLong Diamond antifade with DAPI mounting solution can be kept at 4°C in the dark (to avoid photobleaching) for at least a month without losing quality of the images. However, it is recommended to image the slides as soon as possible.\nCapture images using an epifluorescent or confocal microscope using the Use DAPI channel with a 10× lens to locate cells. Then change the magnification to either 40× or 63× oil lens, focus and capture images with DAPI channel (excitation: 359 nm), FITC channel (BrdU antibody; excitation: 488 nm) and TRITC channel (EdU label/Cyclin A antibody; excitation: 555 nm).\nCritical: Adjust laser power and gain without overexposing samples even in the brightest condition (see troubleshooting 6[href=https://www.wicell.org#sec7.11] and 7[href=https://www.wicell.org#sec7.13]). Keep the same settings for each biological condition.\nOptional: The excitation wavelength can be different for BrdU and Edu-labelled cells, depending on which fluorescent antibody and dye you are using. There are several “Click” reaction kits with different wavelength dyes, and BrdU can be alternatively imaged at higher excitation wavelengths.\nSave files as original multichannel/composite images because they contain the original pixels from the microscope. RGB images are good for display purposes as they have consistent appearance but have lost original pixel values, so are not suitable for accurate analysis.\nCritical: Multichannel/composite images may not be readable in some software but can be opened in imageJ/Fiji."
  ],
  "subjectAreas": [
    "Antibody",
    "Microscopy",
    "Cell Biology",
    "Cell-Based Assays",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}