{
  "id": 10063,
  "origin_website": "Jove",
  "title": "A Method to Study the Correlation Between Local Collagen Structure and Mechanical Properties of Atherosclerotic Plaque Fibrous Tissue",
  "procedures": [
    "All methods described in this paper were approved by the Ethical Research Committee at the Erasmus Medical Center in Rotterdam; informed consent was obtained from patients before plaque specimen collection. A workflow chart of the protocol is given in Figure 1.\n1. Tissue collection, micro-computed tomography (µCT) imaging, and test sample preparation\nTissue collection and storage\n\t\nCollect fresh human carotid atherosclerotic plaque specimens from consenting patients who underwent carotid endarterectomy surgery.\n\t\tNOTE: The plaque samples retrieved from this surgery consist of the diseased intima layer of the carotid artery, including the accumulation of fat (the lipid pool) and calcifications22.\nRemove blood remnants using phosphate-buffered saline (1x PBS) and dry the specimen with a gauze pad.\nPlace the specimen in a 15 mL tube using tweezers. Snap-freeze the tissue by placing the tube in liquid nitrogen for 10 min.\nAfter snap-freezing, store the sample in a -80 °C freezer until the day of µCT imaging.\n\t\t​NOTE: Snap-freezing minimizes crystal formation, leading to microstructural damage in the tissue. A previous study on porcine aortic tissue has shown that snap-freezing and storage at -80 °C had no significant influence on the tissue's mechanical properties23.\nμCT imaging\n\t\nOn the day of µCT imaging, take the plaque specimen out of the 15 mL tube. If the tissue sticks to the tube, fill the tube with PBS at room temperature. Leave the tissue in PBS until the sample can be taken out of the tube.\nDry the plaque specimen thoroughly with tissue paper.\nTurn on the µCT system by pressing the green button. Press warm up in the CT software at the bottom of the screen and wait 15 min.\nManually place an X-ray filter of Cu 0.06 mm + Al 0.5 mm in the µCT system.",
    "Select the folder in which the images are to be stored.\nChoose the parameters in the left panel. Use the dropdown lists to select a scanning time of 4 min, a resolution of 172 µm, a voltage of 90 kV, an amperage of 88 mA, a field of view of 86 mm, and a rotation of 360°.\nOpen the door of the device. Pull the platform out manually.\nPut parafilm on the platform and place the sample on the platform (toward the further extreme of the platform).\nManually place the platform into the device and close the door.\nActivate the live mode (eye icon). Move the platform with the arrows in the device to center the sample in the FOV.\nStart imaging (icon in the bottom-middle). Once the imaging is finished, press the door icon at the bottom (under the abort button).\nAfter the µCT scan, snap-freeze the plaque specimen again as described in step 1.1.3. Store it at -80 °C until the day of multiphoton microscopy imaging and mechanical testing.\nOpen the acquired DICOM files of the µCT imaging in the open-source 3D Slicer software24.\nGo to Segment editor. Select create a new segmentation | the volume to be analyzed as a master volume.\nClick on Add to add a segment. Press its name and color to change these parameters.\nTo define the segments, click on effects | threshold in the bottom part of the window. Use this threshold tool to differentiate between calcified (>450 HU) and non-calcified (<450 HU) tissue regions. Once the threshold is selected, press Apply in the bottom part.\nPress Show 3D (just to the right of Add) to visualize the segmentation in the 3D view. If there are areas of the segmentation that are not desired, remove them with the scissors effect.",
    "Change the opacity of segments in the segmentation module by clicking on the name of the desired segmentation.\n\t\t​NOTE: If possible, µCT imaging and reviewing of the µCT images can be performed on the same day as the rest of the protocol. In that case, skip step 1.2.12. However, take into account that the subsequent steps of this protocol are also time-consuming and should be performed on the same day. After some practice, and with the described settings and tissue, µCT imaging should take ~45 min, reviewing of the µCT images ~15 min, test sample preparation of a single test sample ~1 h, microscopy ~4 h, and uniaxial tensile testing ~2 h.\nTest sample preparation\n\t\nOn the day of collagen imaging and mechanical testing, thaw the plaque by submersion in PBS at room temperature for approximately 10 min.\nOpen the 3D construction of the plaque created in steps 1.2.13-1.2.18 in the 3D slicer software.\nUse the natural landmarks of the plaque tissue to identify which parts of the 3D reconstruction correspond to the real plaque sample. Identify which area of the 3D reconstruction does not contain calcifications and visually identify this area in the real plaque.\nCut the plaque open along the longitudinal axis of the artery using surgical scissors and tweezers. If a cut is already present from the surgery, start from this cut for optimal usage of the tissue. If the sample does not have a tubular shape and it is difficult to define the longitudinal direction, exclude the sample from testing.",
    "Cut out rectangular test samples from the plaque specimens. Make sure the test samples are as large as possible while avoiding tissue regions containing tears or calcifications. Be careful during this cutting, as a small tear or crack at the edge of the test specimen can result in crack-propagation from the existing crack during tensile testing.\nMake sure that the test samples have a width-to-length (WL) ratio of <1 in the gauge length once mounted in the tensile tester. If the samples meet this requirement, they are suitable for appropriate tensile tests in terms of boundary conditions25.\n\t\t​NOTE: The range in the sample dimensions can be large. The samples that the authors tested had a gauge length that ranged between 3.4 and 12.9 mm and a width that ranged between 1.6 and 6.4 mm.\n2. Multiphoton microscopy imaging\nPreparations\n\t\nBefore the day of collagen imaging and mechanical testing, divide 40 g of a silicone elastomer base over two 50 mL tubes and add 2 g of the curing agent to each tube (ratio of 1:10) using a Pasteur pipet. Mix the two components with the pipet.\nCentrifuge the tubes for 1 min at 700 × g to remove as many air bubbles as possible.\nFill a Petri dish (10 cm diameter) with a thin layer (approximately 0.5-1 cm) of silicon and either incubate it in the oven at 65 °C for 3 h or place it at room temperature for 48 h.\nTake a plaque test sample and fix both its ends to the silicon by pinning needles in the tissue (Figure 2A). Make sure the luminal side of the sample is facing upward. Insert the needles in the region of the sample that will be in the clamps of the tensile testing device during the mechanical testing.",
    "Put on safety glasses. Use a side cutter to shorten the needles so that they stick out less than a few millimeters above the sample surface, to prevent them from damaging the microscope objective. Fill the Petri dish with PBS until the sample is submerged.\nMicroscopy setup\n\t\nMake sure that a proper objective is mounted on the multiphoton microscope. Use an objective optimized to transmit infrared light, with a magnification of 20x.\nStart up the microscope system. Open the operating software of the microscope.\nWhen asked to initialize the imaging table, make sure the microscope condenser arm is pushed back and the objective is at the lowest position.\nActivate the multiphoton laser.\nPut the Petri dish with the test sample in it underneath the objective, as in Figure 3. Be sure not to place the objective above the sample yet as the laser settings still need to be optimized. Otherwise, the possible high power of the laser light may lead to damage to the tissue.\nMake sure that the objective is slightly immersed in PBS. Use a pipet to add extra PBS if needed.\nSet the light wavelength to 880 nm.\n\t\tNOTE: This wavelength is chosen because the SHG emission filter in the used two-photon system has a center wavelength of approximately 440 nm. For other microscopes, a different wavelength might be more applicable.\nTile scan and selection of imaging locations\n\t\nTurn off the multiphoton laser and activate the brightfield mode of the microscope. Then, turn on the live scan mode.\nPosition the stage such that the objective is located above the sample and bring the sample surface into focus. Turn off the live scan mode.\nUnder the acquisition tab, in the second panel, change the zoom factor to 1 by sliding the intended bar.",
    "NOTE: This zoom factor, together with the magnification factor of the objective (20x), determine the size of the captured image (739 µm x 739 µm).\nUnder the acquisition tab, in the second panel, change the scan speed to 400 Hz, the line average to 1, and the resolution to 128 x 128 pixels per image (pixel size of ~5.8 µm x 5.8 µm) by using the dropdown lists.\nUnder the acquisition tab, in the first panel, click the raster pattern symbol and wait for a tile scan panel to appear.\nTurn on the live scan mode. Move the objective to a corner of the sample using the knobs on the smart panel and click the mark position symbol in the tile scan panel. Repeat this for each corner of the sample. If performed correctly, a grid with all selected tiles for imaging will appear in orange.\nToggle off the auto-stitching function.\nClick start in the bottom-right corner of the screen to create a tile scan of the entire sample surface to obtain an overview of the sample geometry.\n\t\tNOTE: Based on the described settings, tissue, and microscope system, acquiring a tile scan of the entire sample surface takes ~10 min.\nAfter the tile scan, observe the x- and y-coordinates of the upper left corner of each tile in the tile scan panel, shown automatically by the software of the microscopy system. Note these coordinates in a spreadsheet.\nIn the microscope software, in the tile scan panel, observe the number of tiles in the x- and y- directions in the box called scanfield. Note the size of the tile scan in the spreadsheet. Calculate the coordinates of the other tiles by adding/subtracting the size of the tile (739 µm).",
    "NOTE: These coordinates are necessary to identify the exact location of the tiles to be scanned with SHG imaging. If the total imaging time is not a concern, all tiles can be imaged without skipping any tile.\nFrom the tile scan, select the tiles to be imaged with SHG imaging. For this selection, avoid tiles that will be in the clamps and leave one tile between each selected tile in both the longitudinal and the circumferential direction, as shown in Figure 2B.\nVisualizing collagen: SHG imaging\n\t\nTurn off the lights in the room and cover the microscope stage with blackout fabric also that no light from the room reaches the detector.\n\t\tNOTE: Minimizing light reaching the detectors will decrease the noise during image acquisition.\nTurn the multiphoton (MP) laser on.\nSelect the non-descanned detection (NDD) detector that is equipped with a 430-450 nm bandpass filter.\nIdentify the location of the tiles to be imaged by using the information acquired in step 2.3.10. Fill in the coordinates in the designated boxes and click enter, so the objective moves to the right tile. Turn on the live scan mode.\n\t\tNOTE: With other microscopes or newer versions of the operating software, moving to locations within the tile scan can be done automatically. In this case, noting the x- and y- coordinates of each tile (step 2.3.10) and filling in the coordinates in the operating software (step 2.4.4) is not necessary.",
    "Increase the MP laser power by using the slider in the upper panel under beam path settings to get the highest possible laser power without significant bleaching. Then, adjust the detector gain to obtain bright images, but without saturated pixels, by using the knob on the smart panel or by clicking on the name of the detector under beam path settings | additional channels. Typical values for the detector gain are between 500 and 800 V.\nUse the z-position knob on the smart panel to adjust the focus plane.\nMove to the top of the sample and set the positions of the top of the z-stack by clicking on the arrowhead in the z-stack panel (under the acquisition tab | 3rd panel).\nThen, focus on the sample until the SHG signal is no longer detected-this is the end of the stack. Again, click on the arrowhead in the z-stack panel to set this position. When finished, turn off the live scan mode.\n\t\tNOTE: The tissue may not be entirely flat. Therefore, the sample surface of different regions within the tissue may have slightly different positions in the z-direction.\nUnder the acquisition tab, in the second panel, keep the scan speed at 400 Hz, set the line average to 2, and the resolution to 512 x 512 pixels per image (pixel size of ~1.4 µm x 1.4 µm) by using the dropdown lists. Toggle on the bidirectional X scanning button.\nClick on z-step size in the z-stack panel and fill a z-step size of 3 µm in the box. Click start in the bottom-right corner of the screen to create a z-stack. When finished, be sure to save the coordinates of the tile in the file name or give each tile its own number (as in Figure 2B).",
    "​NOTE: Based on the described settings, tissue, and microscope system, the acquirement of a z-stack of a single tile takes ~10-15 min. The preparation steps (steps 2.4.4-2.4.10) are included within this time estimate.\n3. Mechanical testing\nPreparation of uniaxial tensile testing setup\n\t\nMake the horizontal tensile testing setup (Figure 4) ready for usage, following the instructions for the tensile tester (e.g., turn on software, attach clamps, attach load cell).\nTo minimize the slippage of the test sample, attach two-sided foam tape (Figure 4A,B-2) to the inner faces of the clamps of the tensile tester and sandpaper to the inner side of the foam tape. Eventually, the sandpaper will be in contact with the test sample.\nPlace the heating bath (Figure 4A,B-3) in position. Fill the heating bath with PBS up to the level of the bottom face of the clamps, so that it does not reach the sandpaper yet.\nTurn the power source of the heating bath on and set the temperature to around 37 °C.\nMount the high-speed camera above the tensile testing system (Figure 4A-4), for example, by using a laboratory stand, and mount a lens with a focal length of 50 mm on the camera through an extension ring.\nMake sure that the clamps are in focus and that the field of view is large enough to record the sample during the entire stretching procedure (FOV width: ± the sample width; FOV length: ± 2x the sample length).\nMount the lighting system (Figure 4A-5) above the tensile testing system, for example, by using a laboratory stand. Turn the lighting system on and adjust the light intensity and location so that there are no reflections on the PBS surface to be observed on the camera image.",
    "Adjust the exposure time and gain of the camera to obtain clear images.\nSet the image acquisition software to capture at 30 frames/s at a resolution of 5.2 MP.\n\t\tNOTE: This high frame rate is needed to perform the subsequent DIC analysis and study the rupture behavior.\nSet the displacement speed of one of the clamps such that the global engineering strain rate during mechanical testing is similar to the in vivo physiological straining rate of the tissue\n\t\t(5%/s for plaque tissue26).\nGeneration of speckle pattern\n\tNOTE: This speckle pattern protocol is based on previous work by Walsh et al.27.\n\t\nDry the sample by lightly dabbing it with tissue paper.\nPut the black tissue dye in the intended bucket of the airbrush.\nConnect the airbrush to the compressor. Turn the airbrush compressor on and set the pressure to 25 PSI.\nTry creating an optimal speckle pattern on paper before spraying on the tissue. Spray a few times until a black/white ratio of 50:5028 is met. Move the needle of the airbrush back and forth to adjust the roughness of the speckle pattern until the size of a speckle is similar to the size of 3-5 pixels of the high-speed camera29.\n\t\tNOTE: The speckle pattern will be used for two different purposes. First, the displacement of these speckles is measured by comparing high-speed camera images acquired during mechanical testing (DIC, step 4.2). Second, this speckle pattern is used to identify the rupture location on the image of the undeformed state of the sample (step 4.3.1).\nHold the airbrush approximately 30 cm away from the test sample and spray on the luminal surface.\nLet the dye bond to the sample for 1 min at room temperature before submerging the sample in PBS.\nUniaxial tensile testing",
    "Place the sample in the clamps of the tensile tester, with the circumferential direction of the samples aligned with the tensile stretching direction and the luminal side of the sample facing upward. Make sure the initial gauge length is set such that the WL ratio of the strips is <1.\nTighten the screws of the grips by applying a torque of 20 cNm using a torque screwdriver. Do this gradually by applying a small torque to each screw before applying the final torque.\nVisually inspect if the sample contains any tears that could influence the tests.\nIntroduce more PBS into the heating bath until the sample is submerged and wait until the temperature of the PBS has reached 37 °C again.\nAcquire a calibration image with the high-speed camera, in which the test sample and a ruler are included as a reference. Make sure the ruler is at the same distance from the camera objective as the luminal surface of the sample.\nTare the load cell and start recording the global force and displacement measurements from the load cell and the actuator of the tensile tester.\nStraighten the sample by applying a prestretch of 0.05 N to get rid of the slack in the sample. Perform 10 cycles of preconditioning up to 10% strain based on the gauge length measurement by the actuator after the application of prestretch.\nStart the uniaxial tensile testing until complete failure of the sample, while recording a video of the sample deformation with the high-speed camera. After tissue failure, stop recording the global force and displacement measurements.\n\t\tNOTE: Some commercial tensile testers can perform steps 3.3.6-3.3.9 automatically. The current protocol describes the manual steps to be taken if this automatic option is not included in the tensile tester being used.",
    "Remove the test sample from the tensile testing device and discard it appropriately.\nWhen testing the next sample, replace the sandpaper and foam tape on the clamps.\n4. Data analysis\nCollagen organization analysis\n\t\nOpen the z-stacks obtained during MPM with SHG in ImageJ and create maximum intensity projections (MIPs) of each z-stack.\nAnalyze each MIP with the open-source MATLAB-based FOA (Fiber Orientation Analysis) tool30 to measure the orientation angle of the individual collagen fibers present in the tiles. Use the following parameters: Scales: [3 4 5] or [2 4 6], depending on the vessel diameter, and Vesselness threshold: 0.999, 0.9995, or 0.9999, depending on the intensity of the SHG signal.\n\t\tNOTE: More details about how to use this tool can be found in the software's manual31.\nUse another open-source MATLAB-based tool, FibLab32, to fit a Gaussian distribution to the angle distribution histogram.\n\t\tNOTE: More details about how to use this tool can be found in the software's manual32.\nFrom the Gaussian distribution plot obtained using FibLab, extract the following structural parameters from the workspace of MATLAB: the predominant fiber angle (µp), which is the mode of the distribution, the standard deviation (σp) of the fiber angle distribution, and the anisotropic fraction (Pani = 1 − Piso).\n\t\tNOTE: The isotropic fraction is the area under the baseline in the Gaussian distribution, while the anisotropic fraction contains the area of the peak on top of that baseline33. Both σp and Pani provide information about the dispersion of the fibers' orientation in the tile region.\nFor visual inspection, plot µp by using oriented lines and σp and Pani by using color maps.\nDigital image analysis and rupture analysis\n\t\nPerform visual inspection on the camera images to identify the frame in which rupture initiation occurs. On this frame, visually identify the rupture location.",
    "Perform visual inspection on the camera images to identify any eventual crack or tear at the location of rupture at the start of mechanical testing. If such a tear is present, exclude the sample from analysis.\nPerform the DIC analysis with the open-source, MATLAB-based software Ncorr (v1.2)34. Follow the steps in the Ncorr manual35.\n\t\t\nUse the camera images recorded during the tensile test with the high-speed camera for DIC. Select the last frame before the final stretching until failure (after preconditioning) as the reference image. For the current images, select all images from the start of the final stretching until the last frame before the frame in which rupture initiation occurred.\nSelect the sample surface as the region of interest (ROI). Exclude the areas that are near (approximately 1 mm) to the clamps, as the strains in these areas will be highly influenced by the grips.\nPerform DIC analysis by using the following parameters: Subset radius: 30 pixels; Subset spacing: three pixels; Iteration cutoff: 50; Norm of the difference vector cutoff: 10-5; Strain radius: 5; Auto propagation, step#: 5.\nFrom the DIC analysis with Ncorr, obtain the Green-Lagrange (or Eulerian strain) distributions of the ROI. Use these strain distributions to calculate the average Green-Lagrange strain of the entire plaque sample surface at the last frame before rupture. Calculate the Green-Lagrange strain at the rupture location.\nCorrelating structural and mechanical data at the rupture location\n\t\nUsing the natural landmarks in the test sample and the applied speckles on the test sample, identify the rupture location (identified in step 4.2.1) on the reference image (step 4.2.3.1).",
    "Using the natural landmarks in the test sample, make an overlay of the reference image and the tile scan (step 2.3) to identify the rupture location on the tile scan. Identify the MPM-SHG tile where the rupture happened. If the rupture is not in a tile scanned with the MPM-SHG, identify the tile closest to the rupture location. Obtain the structural parameters found at the tile where rupture occurred."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}