{
  "id": 13278,
  "origin_website": "Jove",
  "title": "Isolation, Culture, Characterization, and Differentiation of Human Muscle Progenitor Cells from the Skeletal Muscle Biopsy Procedure",
  "procedures": [
    "This protocol was approved by the Institutional Review Board at Cornell University. All participants were screened for underlying health conditions and gave informed consent.\n1. Obtaining Human Muscle Tissue via the Skeletal Muscle Biopsy\nIdentify the vastus lateralis muscle via palpation, anatomical landmarks, and active contraction of the muscle.\nPalpate the vastus lateralis by having the participant tighten their quadriceps muscle and find the belly of the muscle, about 1/3 of the way from the patella to the hip, and just ventrolateral to the femur.\nUse a paper measuring tape to mark an area with a surgical marker about 4−6 inches from the top of the patella representing the belly of the muscle.\nShave any hair near the marked area and then cleanse with a surgical grade antiseptic that is used before medical procedures (For example: 2% chlorhexidine gluconate (CHG)/ 70% isopropyl alcohol (IPA)) .\nAnesthetize the biopsy site with 1% lidocaine.\nNOTE: Avoid injecting the lidocaine into the skeletal muscle.\nMake a 4−5 mm incision pathway at the marked site.\nAfter the area is anesthetized, push a Bergstrom needle with trocar through the fascia into the belly of the muscle (approximately 2−3 cm).\nDraw muscle tissue into the Bergstrom needle by withdrawing the cutting trocar 2−3 cm while an assistant applies suction by withdrawing an attached 60 mL syringe plunger.\nClose the cutting chamber.\nRotate the base of the biopsy needle a quarter turn and repeat the sequence of opening the needle, applying suction, and closing the needle.",
    "NOTE: Each time the needle is closed, a cut of muscle tissue should be obtained inside the Bergstrom needle. During sample collection, the needle will remain in the thigh in the same vertical position while it is rotated longitudinally through 360° to obtain each sample. This sequence can be repeated 3−4 times.\nExpel the collected biopsy tissue from the needle into a sterile nonadherent dressing pad.\nExamine the tissue and remove any visible adipose and fibrotic tissues using sterile scalpel blades or tweezers.\nPlace a portion (50−100 mg) of tissue into a sterile tube containing CO2-independent nutrient medium (e.g., Hibernate A).\nNOTE: The weight of the tissue is determined as follows. First place the capped tube containing the nutrient medium on a scale and tare. Next place the tissue into the tube, recap the tube, and then weigh the tube containing the tissue in the nutrient medium.\nStore the tube containing the tissue and nutrient medium at 4 °C until processing.\nNOTE: Biopsy tissue should be processed within 48 h of collection.\n2. Isolating Human Muscle Progenitor Cells from Biopsy Tissue\nMince biopsy tissue.\nTransfer the muscle tissue from the nutrient medium into a sterile Petri dish in a biological safety cabinet or similar sterile workplace.\nUse sterile scalpel blades to mince tissue into ~1 mm3 pieces.\nWash minced biopsy tissue to remove residual debris.\nTransfer the muscle tissue into a 15 mL conical tube containing 10 mL of phosphate-buffered saline (PBS) and allow the tissue to settle via gravity.\nAspirate the supernatant being careful not to disturb the muscle tissue.\nAdd 10 mL of PBS to the washed tissue and allow the muscle tissue to resettle via gravity.\nAspirate the supernatant being careful not to disturb the muscle tissue.",
    "Add 10 mL of low glucose Dulbecco's modified Eagle medium (DMEM) and allow the tissue to resettle via gravity.\nAspirate the supernatant being careful not to disturb the muscle tissue.\nIncubate the tissue in digest media.\nResuspend the muscle tissue in 3 mL of digest media (2 mg/mL collagenase D in low glucose DMEM).\n\t\tNOTE: Collagenase D stock solutions can be prepared at 20 mg/mL in low glucose DMEM and stored at -80 °C, then diluted 1:10 in low glucose DMEM at time of use.\nIncubate the tube containing the muscle tissue in a water bath at 37 °C for 30 min.\nTriturate the muscle tissue suspension every 10 min using a 10 mL serological pipette or a wide bore pipette.\nAdd 83 µL of additional digest media and 24 µL of dispase solution (0.76 mM calcium acetate, 1.39 mM sodium acetate, 13.91 mg/mL dispase II in low glucose DMEM). Return the suspension to the 37 °C water bath.\nTriturate the muscle tissue suspension every 5−10 min with a wide bore pipet tip.\nContinue trituration until a uniform slurry is achieved, and for no longer than 1.5 h to prevent over digestion.\nNOTE: Sufficient mincing of the tissue and the enzymatic activity of collagenase and dispase can impact sample digestion. A uniform slurry should be able to pass through a normal pipette tip with minimal occlusion after 1.5 h. If a uniform slurry is not achieved after 1.5 h, double check that the tissue mincing is sufficient, and tissue is minced to the appropriate size (step 2.1.2). Additionally, the activity of the enzymes should be tested as lot to lot variation in enzymatic activity does occur.\nPellet cells and freeze in recovery media.",
    "Add 6 mL of growth media (GM; 79% Ham's F12, 20% fetal bovine serum, 1% penicillin/streptomycin, 5 ng/mL basic fibroblast growth factor [bFGF], pH 7.4, passed through a 0.22 µm filter) to the muscle slurry.\nPipette the suspension through a 70 µm cell strainer into a 50 mL conical tube. Rinse the strainer with an additional 4 mL of GM.\nNOTE: Sample can be transferred back into a 15 mL conical tube for ease of visualizing the pellet. A larger wash volume can be used if subsequent cell yields are low.\nCentrifuge at 300 x g for 5 min at room temperature (RT).\nAspirate the supernatant being sure not to disrupt the pellet. Flick the tube to resuspend the pellet in the remaining media. If cells are not going to be cultured immediately proceed to step 2.4.5 for instructions on long-term storage, otherwise proceed to step 3.1.6.\nNOTE: If immediate culture is desired, GM in cell culture plates should be pre-incubated (steps 3.1.1 and 3.1.2) before biopsy processing begins.\nAdd 1.5 mL of recovery cell culture freezing media (Table of Materials) to the recovered pellet.\nTransfer the slurry into a cryovial. Place the cryovial in an isopropanol-controlled rate chiller overnight at -80 °C. Store cryovial at -80 °C until ready for culture.\nNOTE: Cryovials containing slurry can be kept in liquid nitrogen for long term storage (greater than 1 month). Using an isopropanol-controlled rate chiller allows cells to be reproducibly frozen at a rate of 1 °C/ min resulting in optimal cell recovery rates as evidenced by viability after freeze and increased likelihood of attachment to cell culture vessels9. Alternatively, a beaker containing RT isopropanol, placed in a -80 °C freezer may be used.\n3. Culturing Human Muscle Progenitor Cells\nThaw the muscle slurry.",
    "Prior to thawing and seeding hMPCs, pre-equilibrate cell culture plates in GM. Add 250 µL of GM to 4 wells of a collagen-coated (collagen I), 24-well cell culture plate. Fill the remaining wells with 500 µL of sterile base media (i.e., F12) to prevent evaporation during long-term culture.\nNOTE: For biopsies between 50 g and 100 g, four wells of a 24-well plate are appropriate. If the biopsy tissue is less than 50 g, two wells may be more appropriate. Residual debris and low cell number prevents the use of a cell counting technique at this step; therefore, the exact seeding density is not determined and varies slightly from biopsy to biopsy.\nIncubate cell culture vessels with GM at 37 °C in 5% CO2 for 1 h prior to seeding.\nRemove cryovials from the -80 °C freezer and place in a 37 °C water bath; the liquid in the tube should be completely submerged in water.\nWhen thawing is almost complete (~5 min), transfer the cryovial to a sterile laminar flow hood. Transfer the muscle slurry out of the cryovial tube and add to a 15 mL conical tube containing 6 mL of pre-warmed GM at a rate of 1 mL/min.\nCentrifuge the muscle slurry at 300 x g for 5 min at RT.\nNOTE: A swinging bucket centrifuge can make it easier to visualize small pellets at this step but is not essential.\nAspirate the supernatant being sure not to disrupt the pellet. Flick the tube to resuspend the pellet in the remaining media and resuspend in 1 mL of GM.\nTransfer 250 µL of the resuspended pellet (now considered an hMPC suspension) to each of the 4 wells of the pre-incubated 24-well cell culture plate.\nCulture and passage hMPCs.",
    "Maintain hMPC cultures in GM at 37 °C in 5% CO2.\nNOTE: Stocks of GM without the bFGF (i.e., F12, antibiotics, FBS) are prepared in batches and kept at 4 °C for up to 2 weeks. bFGF is added to GM on the day of use. Media containing bFGF can be stored for 48 h at 4 °C.\nTwenty-four hours after isolation, aspirate the GM, gently wash the culture vessel 2x with pre-warmed GM, and add fresh GM.\nNOTE: 24 h should provide hMPCs adequate time to attach; no hMPCs should be removed after washing. This step will also remove remaining debris that was generated during the cell harvest, making the vessel more amenable to accurate confluence scanning using an imaging cytometer (section 5 below). After this initial media change, GM is changed every 48 h.\nPassage hMPCs when 70% confluence is achieved or when they have remained on the same culture dish for 10 days, whichever occurs first.\nNOTE: 70% confluence is approximately 55,000 cells/cm2.\nTo passage, add 250 µL of pre-warmed trypsin to each well of a 24-well cell culture plate and incubate for ~5 min.\nTap the cell culture vessel on a firm surface to detach hMPCs. A light microscope can be used to verify that the hMPCs have detached.\nTransfer the trypsin/hMPC suspensions to 5 mL of GM in a 15 mL conical tube.\nCentrifuge the hMPC suspension at 300 x g for 5 min at RT.\nRemove hMPC suspensions from the centrifuge and place on ice in the sterile laminar flow hood.\nNOTE: Keeping hMPCs on ice during passing results in less cell aggregation.\nAspirate supernatant from hMPCs and gently resuspend pellet in 1 mL of GM.\nCount cells using a hemocytometer or an automated cell counter.",
    "NOTE: A 1:5 dilution of cell suspension to cell counting buffer is generally appropriate.\nSeed hMPCs onto collagen-coated culture dishes containing pre-warmed GM at a density of 3,500 cells per cm2. A combination of 10 cm plates and 24-well plates is ideal. The 24-well plates can be scanned daily on an imaging cytometer to monitor growth.\nFollow the same procedure (starting at step 3.2.4.) for subsequent passages.\nNOTE: Cell health and purity can be monitored across passages using a marker of cellular senescence (e.g., β-galactosidase) and immunostaining for Pax7.\nCryopreserve the hMPCs.\nCryopreserve excess cells for later use to make the culture volume more manageable.\nFor cryopreservation, follow the trypsinization procedure described in steps 3.2.4.-3.2.9.\nWhile the cell suspension is being centrifuged, prepare a mixture of 20% (e.g., 200 µL) dimethyl sulfoxide (DMSO) and 80% (e.g., 800 µL) GM. Pipette up and down 20x to ensure adequate mixing. Leave the mixture to rest on ice.\nBased on cell count, dilute the hMPC suspension to 2 x 106/mL in GM.\nCombine the hMPC suspension and the 20% sterile DMSO/80% GM mixture 50/50. The final cryopreservation media is a combination of DMSO (10%) and GM (90%) containing 1 x 106 hMPCs/mL.\nPlace 1 mL of the hMPC suspension prepared in step 3.3.5 into as many cryovials as the initial cell count allows. Then place aliquoted hMPCs in an isopropanol-controlled rate chiller in a -80 °C freezer overnight.\nNOTE: At this step, typically between 5 and 15 million cells are obtained, 30−60% of which are identified as hMPCs by FACS.\n4. Isolating Pax7+ Human Muscle Progenitor Cells via Flow Cytometry\nTo prepare hMPCs from live cultures (step 3.2.11), trypsinize enough culture vessels for 1 x 106−2 x 106 total cells. Prepare cell suspensions as described in steps 3.2.4−3.2.9.",
    "Prepare hMPCs from cryopreserved cultures (step 2.4.6 or 3.3.6).\nSelect 1−2 tubes containing ~1 x 106 passage four hMPCs for each donor.\nNOTE: Using passage four hMPCs allows for adequate cell yield while still maintaining proliferative potential until passage six (Figure 2).\nRapidly thaw cells by removing them from the -80 °C freezer and placing them in a 37 °C water bath with the liquid in the tube completely submerged.\nWhen thawing is almost complete (~5 min), transfer hMPCs to a sterile laminar flow hood and transfer the contents of the cell suspension into 6 mL of pre-warmed GM in a 15 mL conical tube at a rate of 1 mL/min.\nPrepare cell suspensions as described in steps 3.2.7−3.2.9.\nResuspend each pellet in 3 mL of FACS buffer (500 mL PBS, 12.5 mL normal goat serum, 2 mL 0.5 M EDTA, pH 7.4, passed through a 0.22 µm filter).\nCentrifuge the cell suspension at 300 x g for 5 min at RT.\nAspirate supernatant from hMPCs and gently resuspend pellet in 250 µL of FACS buffer; place on ice.\nPlace 100 µL of cells in a 1.7 mL microcentrifuge tube and leave on ice to be used as live/dead controls (step 4.5.1).\n\t\tNOTE: The 100 ul of cells to be used for live/dead controls can come from taking a small volume (~20 ul) of resuspended cells from each donor to be sorted or from banked cells.\n\t\tNOTE: It is important to not take more than 20 ul of resuspended cells from a single donor. Bring volume up to 100 ul with FACS buffer if < 100 ul of cells is available.\nStain hMPCs for cell surface markers.",
    "Prepare the following antibody cocktail (amounts shown are for each culture, scale-up appropriately): 5 µL CD56 (neural cell adhesion molecule [NCAM]; PE-Cy7-conjugated) and 5 µL CD29 (β1-integrin; AlexFluor488-conjugated). The final antibody dilution is 1:50.\nAdd 10 µL of the antibody cocktail to each hMPC suspension and incubate on ice for 30 min in the dark.\nAdd 10 mL of FACS buffer to each suspension/antibody cocktail mixture.\nCentrifuge each tube at 300 x g for 5 min at RT.\nResuspend the pellet in 300 µL of FACS buffer and transfer to a 5 mL round bottom polystyrene tube.\nKeep the suspension on ice and protected from light.\nPrepare the compensation beads.\n\tNOTE: Positive controls for each antibody and a negative control (unstained beads) should be prepared using compensation beads. Compensation bead controls should be run on the flow cytometer prior to the samples to be sorted. These controls allow for determination of how much the fluorochrome from each antibody can be detected in the other's channel so that compensation can be applied.\n\t\nVortex compensation beads.\nIn three 1.7 mL microcentrifuge tubes, add one drop (50 µL) of compensation beads.\nAdd 1 µL of each antibody to the appropriate tube, or none to the negative control.\nIncubate in the dark for 15 min.\nAdd 1.5 mL of FACS buffer to each tube and vortex.\nCentrifuge each tube at 300 x g in a benchtop centrifuge for 5 min at RT.\nAspirate supernatant and resuspend the pellet in 200 µL of FACS buffer.\nNOTE: The pellet may be very difficult to visualize; care should be taken when aspirating the supernatant.\nPlace the suspension in a 5 mL round bottom polystyrene tube and then keep the tube on ice and protected from light.\nPrepare live and dead controls.",
    "Divide the 100 µL of hMPCs from step 4.2.8 into two 1.7 mL microcentrifuge tubes (one for the live control and one for the dead control).\nPlace the dead control tube in a heating block pre-warmed to 70 °C for >10 min. During this time, keep the live control on ice.\nCentrifuge each tube at 300 x g in a benchtop centrifuge for 5 min at RT.\nAspirate supernatant and resuspend the pellet in 150 µL of FACS buffer.\nCombine the live/dead controls into a single 5 mL round bottom polystyrene tube.\nPerform viability staining.\nAdd 1 µL of 7-aminoactinomycin D (7-AAD) to all tubes containing cells to be sorted and the live/dead control.\nAdd GM to collagen-coated 24-well (250 µL/well) and 10 cm (8 mL/well) plates and allow to equilibrate in a cell culture incubator at 37 °C in 5% CO2.\nSort hMPCs via flow cytometry.\nSort hMPCs on a flow cytometer with 100 µm nozzle at a pressure of 20 psi. Determine live hMPCS based on side and forward scatter as well as 7-AAD negativity (sorting parameters and a representative sort can be seen in Figure 3).\nCells positive for PE-Cy7 (780/60 nm) and AlexFluor488 (530/30 nm) represent CD56+/CD29+ cells and thus are Pax7 positive cells (hMPCs). Sort double positive cells into collection tubes containing a 300 µL cushion of FACS buffer.\nNOTE: The purity of sorted cultures can be determined by immunostaining for Pax7 followed by downstream flow cytometry analysis (Figure 4).\nDiscard all other cells.\nTransfer the sorted cells to a 15 mL conical tube.\nSpin the hMPC suspension at 300 x g for 5 min at RT.\nCarefully aspirate the supernatant and resuspend in 1 mL of GM.\nCount cells using a hemocytometer or an automated cell counter.",
    "NOTE: While the number of cells may be inferred as the number of events that are positively sorted, this count has been found to overestimate the number of cells by 10−40% compared to traditional cell counting methods.\nSeed the hMPCs as outlined in step 3.2.11.\nNOTE: Verification of the purity of hMPC population may be determined by immunostaining for Pax7 and analysis via flow cytometry.\n5. Characterizing Human Muscle Progenitor Cell (hMPC) Cultures Using an Imaging Cytometer\nUse the imaging cytometer (Table of Materials) to perform confluence scans.\nSelect Create New Scan and then enter/select the Plate Category, Plate Profile and Plate ID. The imaging cytometer can accommodate 96, 24, and 6 well plates.\nUnder Application, select Confluence > Confluence 1.\nSelect a well to view using the navigator on the right of the screen.\nFind a plane of focus where the cells appear white compared to the background and select register manual or allow the imaging cytometer to select the plane of focus by selecting register auto.\nNOTE: For the 96 well plates suggested in the Table of Materials, an approximate position is 4.3 units.\nUse the mouse to highlight all wells that need to be scanned. The entire well area will automatically be scanned. Select Start Scan.\nSelect analysis settings optimal for plate and cell type.\nNOTE: For hMPCs, the following settings are optimal: intensity = 6, saturated intensity = 0, diameter = 8, minimum thickness = 3, min cluster size = 500, and precision = high.\nSelect Start Analysis.",
    "NOTE: Visually inspect images to ensure that the user and imaging cytometer agree regarding the perimeter of cells. If a large discrepancy exists, rescan the plate using a different plane of focus or different analysis settings. Confluence scanning can be used to compare growth between cultures, time the administration of a treatment, or to monitor cells and decide when to initiate differentiation. If differentiation is desired, details are provided in section 6.\nUse the imaging cytometer to count cells.\nPrepare a staining solution containing 12 mL of Ham's F12, 6 µL of Hoechst 33342 and 24 µL of propidium iodide.\nAspirate media and replace with staining solution, incubate at 37 °C for 15 min.\nAspirate staining solution and replace with Ham's F12.\nNOTE: It is important to use a media with low levels of phenol red to obtain clear images. Alternatively, PBS may be used.\nLoad the plate onto the imaging cytometer and under Application, select Cell Viability > Live + Dead + Total. The live channel will be a bright field image, the dead channel will be the propidium Iodide, and the total channel will be the Hoechst 33342.\nSet the Live channel to bright field and click Register Auto under Focus Setup.\nUnder the Total channel, set the channel to blue. Use Find focus to bring the nuclei into focus or use the up and down arrows to manually set the focus. Click Set offset to select the focus.\nUnder the Dead channel, set the channel to red. Use Find focus to bring the dead cells into focus or use the up and down arrows to manually set the focus. Click Set offset to select the focus.\nSelect Start Scan to start the scan.",
    "Select analysis parameters that are appropriate for the plate and cell type. Select Start Analysis to start the analysis. After the analysis is complete, visually verify that the analysis is appropriately counting cells (e.g., for the total channel check that every nucleus is being recognized as a nucleus and that the imaging cytometer is not counting any spots in the background as nuclei). If the scan and analysis are satisfactory, return the plate to the incubator, otherwise rescan or modify analysis parameters.\n6. Differentiating Human Muscle Progenitor Cells (hMPCs) to Myotubes\nDetermine the hMPC confluence using the protocol in section 5.1. To differentiate hMPCs into myotubes, it is ideal for cells to be 80−85% confluent as determined by the confluence function on the imaging cytometer (see section 5). If hMPCs from more than one unique donor are used, confluence scanning allows cells from different donors to begin differentiation at the time they reach confluence.\nNOTE: At 80% confluence, there are approximately 66,000 cells/cm2.\nWash cells 2x with differentiation media (97% Ham's F12, 2% equine serum, 1% penicillin/streptomycin, pH 7.4, passed through a 0.22 µm filter).\nMaintain cells in differentiation media for as long as the experiment dictates while switching media daily.\nDirectly assess myotube formation by immunostaining for embryonic myosin heavy chain, which is typically detectable after 7−10 days of differentiation.\nNOTE: The time required to form myotubes may differ slightly depending on donor and number of cells when differentiation was initiated; therefore, it is recommended that cultures from each donor be monitored individually.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}