{
  "id": 6506,
  "origin_website": "Bio",
  "title": "Visualizing Filamentous Actin in <em>Chlamydomonas reinhardtii</em>",
  "procedures": [
    "Cell culture and experimental setupGrow two inoculating loops of CC-125 mating type + cells, taken from a Tris Acetate Phosphate (TAP) agar plate, in 2 ml of tris acetate phosphate (TAP) liquid media on a roller drum (40 rpm) overnight (~16 h) in growth lighting at room temperature.The next day, set up a parafilm workspace (Figure 2). Use a hydrophobic marker to draw a circle on the coverslip where you will eventually pipette the cells and all future media used in the experiment. Make sure to label coverslips appropriately for each trial, we find it helpful to write “F” in the corner of each coverslip to help denote front from back. Add 200 μl of Poly-L-Lysine at room temperature to the hydrophobic circle and wash after 10 min by quickly dipping in distilled water. The Poly-L-Lysine will immediately fall off the coverslip once it is submerged in water, quickly place coverslip back onto parafilm and use a Kimwipe to remove any excess moisture around the edges of the coverslip. Cover your workspace to shield from debris that might adhere to the Poly-L-Lysine coated coverslips. Unused Poly-L-Lysine coverslips can be stored at room temperature for future use. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190617/20190617195619_5846.jpgFigure 2. Parafilm WorkspaceIt is essential to select healthy cells by centrifuging 1 ml of cell culture at 1,800 rpm (203 x g) for 1.5 min. Discard the supernatant and resuspend cells in 600 μl fresh TAP media. Slowly pipette media up and down a few times then let culture sit. Healthy, swimming cells should migrate to the top of the culture after about 10 min. Then pipette (from the top of the culture) 200 μl of resuspended cells to Poly-L-Lysine-coated coverslips for 5 min and shield samples from light.",
    "The cells are shielded from the light because they phototax and swim upward towards the light, reducing the number of cells that adhere to the coverslip.Cell fixation and permeabilizationAfter 5 min, tilt off liquid from the coverslips and replace with 200 μl 4% fresh paraformaldehyde (PFA) in 7.5 mM HEPES pH 7.4 to the middle of the hydrophobic circle. Allow cells to incubate in fixative for 15 min at room temperature. Note: If non-specific chloroplast or bright pyrenoid signal is present (Figures 3A and 3B), dilute PFA solution fresh. We do not make up PFA from powder, but find by simply diluting fixative to 4% from an unopened ampule of 16% PFA solution improves labeling. We find after 2-3 weeks of PFA use, labeling efficiency decreases and makes pyrenoid signal very prominent. Diluting fixative from a fresh ampule alleviates this issue.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190617/20190617195646_4988.jpgFigure 3. Phalloidin staining using non-optimal conditions. A. If cells incubate too long in staining solution or PFA has expired, cells will show strong pyrenoid signal (yellow arrow) and non-specific cytoplasmic staining. This type of signal can be easily distinguished from Atto 488 signal as there will be no filamentous perinuclear or apical staining, instead a dim hazy signal found throughout the entire cell body as pictured in A and B above. Scale bars = 5 μm. C. A general diagram of a Chlamydomonas cell highlighting filamentous actin in pink, the pyrenoid in blue, and the chloroplast in green. Tilt of PFA solution into a Kimwipe and place coverslips in a Columbia jar containing 1x PBS to wash for 3 min. Use enough PBS so that the coverslip is completely submerged in liquid.",
    "For cell permeabilization, submerge coverslips in a Columbia jar containing 80% pre-cooled acetone (diluted in water and stored at -20 °C) and then incubate for 5 min at -20 °C.Quickly transfer coverslips into a second Columbia jar containing 100% pre-cooled acetone and incubate for another 5 min at -20 °C.Place coverslips back on parafilm and allow them to air dry for a minimum of 2 min or longer if needed.Phalloidin StainRehydrate cells by transferring coverslips to a Columbia jar containing 1x PBS and incubate for 5 min.Place coverslips back on parafilm. Stain coverslips with Atto 488 Phalloidin (Sigma) for 16 min in the dark. This shorter than recommended staining time significantly reduces background and increases the signal to noise ratio.Note: The Atto 488 Phalloidin reagent greatly enhances photostability and brightness compared to Alexa-488, which allows for more uniform and reproducible filament labeling. Due to the photostability, Atto 488-labeled slides can be reimaged. Quickly tilt of staining solution and wash cells by transferring coverslips to a Columbia jar containing 1x PBS. Wash once for 5 min.Remove excess liquid from the coverslip with a Kimwipe, but be careful to not disturb the inside of the hydrophobic circle (where the cells are adhered). Mount coverslips with self-sealing Fluoromount-GTM (Invitrogen) as quickly as possible. This sealant is designed for staining experiments where the final step is aqueous. Image acquisitionCapture 0.3 μm step Z-stacks in brightfield and widefield fluorescence channels (GFP filter set) using a Nikon Eclipse Ti-S equipped with a QiIMAGING QICAM. Deconvolve fluorescence images using Huygens Essential deconvolution software and format in ImageJ."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}