{
  "id": 10804,
  "origin_website": "Jove",
  "title": "Behavioral Approaches to Studying Innate Stress in Zebrafish",
  "procedures": [
    "The protocol has been approved by the Institutional Animal Care and Use Committeeat Florida Atlantic University .\n1. Preparation\nDesignate an isolated room for performing behavioral studies, or close off a section of a room so that it is isolated.\n\tNOTE: The room should be undisturbed and have low traffic to avoid disrupting normal behavior of the fish.\nMove the following materials and equipment into the behavioral room: (i) a camera and lens, (ii) an infrared filter which can be attached to the lens, (iii) a camera stand, (iv) a computer with camera acquisition software, (v) a firm and stable table to perform the assay on, (vi) infrared lights (IR lights; 850 nm or 940 nm), (vii) a white acrylic diffuser, which is longer than the length of the recording tank (viii) 1.8 L trapezoidal plastic assay tank (referred to as the 'novel tank'; the one used here is 12 x 18 inches), and (ix) a bucket of fish system water.\n\tNOTE: For the novel tank, our lab uses commercially available plastic vessels, which are trapezoidal in shape. The dimensions of the tank are roughly 6 in x 9 in (detailed dimensions are provided in Figure 1A). The diffuser board we use is slightly larger than the novel tank (12 in x 18 in). Novel tank experiments have been performed with tanks having differing shapes, such as those which are rectangular or those with different trapezoidal dimensions20,21. Typically, fish behavior is similar in all tanks regardless of their dimensions: for all containers, fish initially prefer the bottom half, yet over time begin exploring top half with greater frequency.",
    "Attach the infrared filter to the camera lens. The wavelengths of the infrared light strips typically range from 850 nm to 940 nm. The filter is a long pass filter that restricts light of wavelengths less than 720 nm from transmitting through to the camera.\nSelect suitable parameters for the camera acquisition software. For most recordings, set the camera acquisition to a rate of 30 frames-per-second, and recording duration to 10-min.\n\tNOTE: These parameters may differ, depending on the experiment. For example, to study habituation in a novel tank22,23, longer recordings may be required.\n2. Setup\nNOTE: The steps in this section describe setting up the novel tank assay. A diagram of the end product is given in Figure 1B.\nPlace the novel tank in the middle of the table.\nPosition the infrared lights behind the tank and place the white acrylic sheet or diffuser screen in between the tank and LED light source.\n\t\nPlace the diffuser so that it maximally spreads the light coming from the LEDs, and the intensity of the light is enough to illuminate the novel tank. The closer the board is to the light source, the brighter the lights will be, yet the less it will diffuse. By contrast, placing the diffuser board away from the light source will reduce light intensity, but spread the light better.\nFill approximately three quarters of the novel tank with fish system water.\n\tNOTE: System water is generated using reverse osmosis of tap water, followed by dosing such that conductivity equals 900 ± 100 µS, that pH is neutral (7.2), and that the temperature is 27 ± 1 °C.",
    "Attach the camera to the camera stand and connect the camera to the computer. Open up the video acquisition software and adjust the camera to face the front of the tank and ensure the entire novel tank can be seen and that there are no obscured areas in the video. Adjust the tank and the infrared lights such that there is sufficient and even illumination throughout the tank when observed through the camera.\n\tNOTE: Before proceeding to experiments, it can often be useful to perform a trial run, in which video of a fish is captured and tracking is performed. This will ensure that the setup is sufficient for experimentation of behavior.\n3. Novel tank test setup\nPrepare a 250 mL beaker pre-filled with fish system water, and at least two holding tanks.\nOn the morning of the test, transfer at least 10 test adult zebrafish to be used for each experimental condition (controls and experimental adults) from fish facility into a holding tank, transfer them to the behavior room, and allow them to acclimate for at least one hour.\n\tNOTE: A power analysis should be performed before experimentation, yet in our hands, an n = 10 is usually sufficient to detect statistical significance. Moreover, the holding tank should contain no more than five individuals per liter of water. An acclimation of one hour is sufficient as zebrafish adults have been shown to habituate within 30 minutes of a new tank22. Also, behavioral rhythms are affected by circadian processes, and thus experimental replicates done on different days should be performed within the same hours. We typically perform all experiments between the hours of 11:00 am and 6:00 pm.\nLabel the tanks such that the condition or genotype of the animals is blind to the experimenter.",
    "NOTE: Experiments can easily be blinded to the experimenter by labeling tanks using a letter or number system (i.e., one tank is labeled 'A', another 'B', etc.). A party not involved in the experiments labels the tanks with such a system, and masks the identities from the experimenter until after post-analysis is complete.\nUsing a net, gently place a single adult in the pre-filled beaker from step 3.1. Allow the adult fish to acclimate in the beaker for 10 minutes.\n\tNOTE: Record the sex of the adult, as it might be important post-analysis to look for sex-specific differences.\nAfter acclimation in the beaker, introduce the fish into the novel tank (set up in section 1) by gently pouring out the water and adult from the beaker.\nAfter introducing the adult into the novel tank, start the camera recording, and move away from the setup to prevent additional distress to the fish.\nAfter the recording has finished, remove the individual from the novel tank and place into a new holding tank.\n\tNOTE: A different holding tank from the one in step 3.2 should be used to prevent repeated testing on the same individuals.\nRepeat steps 3.4 to 3.7 for each adult until all animals have been tested.\n\tNOTE: In addition to blinding conditions or genotypes, randomize trials. Use a random number generator or any tool that allows one to randomize between the trials. This should be done before experimentation so that each trial is determined before the experiments begin.\nAt the end of all tests, return the fish back to the fish facility.\n4. Pretreatment with drug",
    "NOTE: The aim of the following steps is to compare the behavior of an individual before and after the use of drugs. This comparison is achieved by first performing a novel tank test as in step 3.4 to 3.6, followed by drug treatment, and then a second novel tank test (Figure 3A).\nPrepare a stock solution of the drug, including positive and negative controls.\n\tNOTE: If the drug has previously been used in the literature, find an appropriate working dose and use this. For example, for buspirone in the representative results, we make a 100x stock solution and use 0.05 mg/mL as the final concentration, as described in the literature13,20. If suggested dose is unknown, a dose response curve should be performed by examining several concentrations. Set up more beakers with serial dilutions of drug. If the drug is not dissolvable in water, use dimethyl sulfoxide (DMSO) as a solvent.\nDilute drugs to working concentration in 250 mL beakers with system water. For example, if a 100x solution was made, dilute 1:100 in system water. Set up a beaker with only system water as a control.\n\tNOTE: If DMSO was used as a solvent in step 3.1, use an equal volume of DMSO in the control beaker.\nWith the help of another researcher, mask the identities of the drug and control beakers to ensure that the tester is blind to the treatment conditions until post-analysis.\n\tNOTE: A number or letter system may be used.\nPerform a novel tank test by following steps 3.1 to 3.6 to obtain a baseline behavioral stress response.",
    "After the baseline recording, use a net to immediately remove the adult fish from the novel tank and place it in the beaker dosed with drug or vehicle, as described in step 4.2. Allow the adult to stay in the beaker for 10 min.\n\tNOTE: Ensure that the net does not touch the water in the beakers to prevent cross-contamination of drugs. Ensure proper dosage and administration time depending on the drug used. A 10 min treatment time might not work for all drugs.\nAfter treatment, use a net to remove the adult from the beaker in step 4.5 and place it in another beaker filled with fresh system water only. This is the washout period to minimize further dosing during the second novel tank test. Allow the adult to stay in the wash out beaker for an additional 10 min.\n\tNOTE: Separate nets should be used for each drug condition to prevent any unwanted cross treatment with drug. The washout period may be skipped if the experimenter wishes.\nPerform the novel tank diving test a second time by removing that adult from the beaker in previous step, place it in a new novel tank, and follow steps 3.5 to 3.6.\nAfter the second novel tank test, remove the individual into a separate holding tank. Pour away the system water in the second novel tank and fill it with fresh system water for the next test. This step prevents cross-contamination of any drug.\n\tNOTE: Depending on the half-life of the drugs, fresh beakers containing drugs should be made every 3 hours. For buspirone, make fresh solutions every 3 hours. In addition, following the note in step 3.8, the trials should be randomized between controls and drug treatments.\nAt the end of all trials, return individuals back into the fish facility.",
    "NOTE: Depending on type of drug used, the effects of these treatments on individuals can be long lasting. Therefore, do not use these individuals in other experiments.\n5. Video analysis\nAfter all trials, load video files into tracking software of choice.\n\tNOTE: We typically use commercially available tracking software, yet several freely available software packages can be used. The steps to achieve tracking may differ according to the software package used.\nUsing a still frame from the video, define imaginary boundaries around (i) the entire novel tank arena that is filled with water, and boundaries around (ii) the top third, (iii) middle third, and (iv) bottom third of the tank. Use these to establish time that the fish spent in each portion of the novel tank.\nCalculate x-y displacement per frame for each arena defined in step 5.2.\nDefine top, middle, and bottom areas of the tank. Each region should be similar in size. A brief method for determining these regions is to calculate the length of the tank in the y-direction, and divide this by 3.\n\tNOTE: Variations to the general protocol do exist. For example, some labs use halves instead of thirds14.\nDetermine the time spent in each arena, the distance, and the velocity.\n\tNOTE: Most tracking packages will automatically calculate these for the user. However, if the tracking software does not, these can be calculated easily from the x-y displacement values. For example, distance can be determined using the formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/59092/59092eq1.jpg\n\tand velocity can be determined following the formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/59092/59092eq2.jpg\nRepeat steps 5.2 to 5.4 to acquire tracks and measurements for all trials.\n\tNOTE: Variations to this general protocol\n6. Testing for normality\nPerform statistics before proceeding to calculate statistical differences. Check to see if the data is normally distributed using a Shapiro-Wilk test.",
    "If the null hypothesis that the data is normally distributed is rejected (i.e., the data does not follow a Gaussian distribution), perform all tests using non-parametric tests. Conversely, if the data is found to follow a normal distribution, proceed to use parametric tests.\n\tNOTE: We use commercially available software to perform statistics; however, the R programming language can also be used. A Shapiro-Wilk analysis can be performed using R's shapiro.test function.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}