{
  "id": 18739,
  "origin_website": "Jove",
  "title": "Clinical Assessment of Spatiotemporal Gait Parameters in Patients and Older Adults",
  "procedures": [
    "The protocol follows the guidelines of the local human Ethics Committee in Zurich (KEK Zurich).\n1. Hardware Installation (Figure 1)\nUse two 10-m sets of floor-based bars and place them parallel to each other (and to the line of progression) to create a corridor with an inter-set distance of approximately 1 m.\n\tNOTE: This distance can be increased up to 8 m. Each bar has a length of 1 m and consists of 96 light diodes.\nMake a distinction between light-transmitting (T) and light-receiving (R) units for the installation of the bars by placing the light-transmitting (T) units on the right side and the light-receiving (R) units on the left side with respect to the walking direction.\n\tNOTE: The first meter bars (both T and R) have silver drums. The T and R bars disposed on the remaining 9 m are all equal and interchangeable.\nConnect all bars of a row with caps (wireless). Use 2 power supplies: one for each set of bars (T and R).\nConnect the first R bar to the laptop with a USB cable.\nPosition the camera next to the first bar for offline verifications (e.g., starting foot), and connect it to the laptop with a USB cable.\nPut a mark 2 m before and after the beginning and end of the track.\nSwitch on the photoelectric device using the on-off switch of the first R and T bar.\nCheck that the control LEDs located on all R bars are green.\n\tNOTE: If so, the system is correctly positioned and testing can start; however, if one or more of the control LEDs are red the system is not correctly positioned and/or connected. Control all caps by checking that they are completely clicked into place and then turn the system off and on again.\nimgsrc://cloudfront.jove.com/files/ftp_upload/51878/51878fig1.jpg",
    "Figure 1. The photoelectric system consists of light-transmitting (T) and light-receiving (R) units that are placed parallel to each other with a distance of approximately 1 m. The camera is installed close to the start area for control purposes. The laptop is connected with USB cables to the first R bar and to the camera. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/51878/51878fig1highres.jpg]\n2. Software Installation and Preparation of a Test\nLoad the software operating the photoelectric system from www.optogait.com/Support/Downloads. Note: This protocol is described by using the 1.8.1 version.\nIf the software is used for the first time for gait analysis create a new test as follows (otherwise proceed to step 2.3):\n\t\nSelect Test then click on Define / Modify tests. Now click on Gait test and then select Duplicate test. Click on Confirm in the pop-up window so that the test is duplicated.\nDouble click on the duplicated test to modify the name (e.g., Gait Test 10 bars) and select 10 for the number of bars. Use the standard parameters for the gait test, which are presented in Figure 2. Finally, select Save to save all modifications.\nAdd a new patient to the database. Select Patients, click on Insert / Modify patient, and then click on New patient to enter the data. Then Save the data.\nimgsrc://cloudfront.jove.com/files/ftp_upload/51878/51878fig2.jpg\nFigure 2. Standard settings for a gait test with 10 bars, as described in the present protocol. These settings have to be defined when the photoelectric system is used for the first time. In this protocol the starting foot is not defined. The system starts measuring when the patient enters the recording area and stops measuring when the patient leaves the measuring units. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/51878/51878fig2highres.jpg]\n3. Testing Procedures",
    "Always give the same instructions to the patient13.\n\t\nInstruct the patient to walk with flat-soled shoes along the 10-m walkway at two different velocities: normal (“walk at a pace that is comfortable for you”), and faster than normal (“walk at a pace that is faster than you would normally walk”).\nAsk the patient to look straight ahead during the walking trials.\nAsk the patient to initiate the first step with the same foot to better standardize the test conditions.\nAsk the patient to start walking 2 m before the first photoelectric bar and to conclude each trial 2 m after the last bar in order to maintain constant gait velocity13.\nDemonstrate one trial at normal velocity to the patient.\nRequest the patient to perform three familiarization trials followed by one experimental trial at each velocity. Always complete normal velocity trials first.\nTo get ready with the software, click on Test and then Execute to start the measurements with the created test.\n\t\nSelect the patient by clicking on Select, choosing the patient and then clicking on Confirm.\nSelect the test by clicking on Select, and choosing the test e.g., Gait Test 10 bars. Check that only this test is selected for the measurement.\nPlace the camera so that it can record the entire walk. Change the position of the camera while checking the live picture on the screen of your laptop.\nFinally, click on Execute again.\n\t\tNOTE: Now the software is ready to measure. As soon as the patient enters the bars, the system starts to measure and a pop-up window appears asking for the starting foot.\nClick on the appropriate foot so that the gait parameters will be correctly calculated.\n\tNOTE: The camera records automatically once the test is started.\nSave the test.\n4. Data Analysis",
    "Click on Results to display the completed trials. Then click on the arrow next to the test of interest to transfer the test from the Test list to the Test analysis section. Now click on View to display the selected test. Refer to the Results section for all tests performed in this study.\n\tNOTE: A window with all test data appears (Figure 3). On the left side of the window there are some command buttons for activating various functions. The other part of the window presents 4 types of information regarding the current test. Each set of information can be shown/hidden using the configuration commands. From top to bottom the items are the following: video, charts displaying the results, table with numerical data, and photoelectric bars.\nClick on Gait data to display a gait report (Figure 3).\nClick on Print (a window with the report appears) to print out the report.\n\tNOTE: The report can be printed as it is or can be modified. For the different spatiotemporal parameters, the following results are presented in the report: mean values ± standard deviation (SD) of the left and right side, coefficients of variation (CV) expressing gait variability14,15, and percent difference between the left and the right side (asymmetry).\n\t\nIf required, modify the report as follows: open the report as described above (step 4.3). Click on the buttons Show or Hide on the left side of the screen to adapt the presented data and charts of the report.\nTo change the logo and/or the footer on the report, click on the respective button (Change logo or Change footer) to modify these parameters.",
    "To compare two or more tests performed on different occasions, e.g., before and after an intervention, select the different tests in the results section by clicking on the arrow next to the tests and then click on the Compare button.\n\tNOTE: A report with the direct comparison of all parameters of the different tests is displayed.\nimgsrc://cloudfront.jove.com/files/ftp_upload/51878/51878fig3.jpg\nFigure 3. Screenshot of all test data. The command buttons appear on the left side of the window (e.g., by clicking on Print a report is generated, which can be eventually modified). The other part of the window presents the following information regarding the current test, from top to bottom: video, charts displaying the results, table with numerical data, and photoelectric bars. These details can be shown/hidden using the Configure button on the right side. The actual view of the data can be changed by clicking on Gait data or Gait report, respectively. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/51878/51878fig3highres.jpg]Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}