{
  "id": 9065,
  "origin_website": "Jove",
  "title": "Measuring Connectivity in the Primary Visual Pathway in Human Albinism Using Diffusion Tensor Imaging and Tractography",
  "procedures": [
    "Ethics Statement: The current research study has been approved by the Human Participants Review Committee (HPRC) at York University, Toronto. All participants gave informed written consent.\n1. Subject Preparation\nNote: Eleven participants with OCA, aged 36 ± 4 years (6 females) were compared to ten age-matched controls, aged 32 ± 4 years (6 females). Participant history is recorded in Table 1.\nAsk each participant to fill out and sign a consent form that lists MRI safety guidelines and imaging protocol.\nFor each participant, provide earplugs for the ears. Position participant supine and head first in the magnet, and landmark above the eyes at the eyebrow level. Secure participant's head with cushions to reduce head motion. Give the participant a squeeze bulb for patient alert.\n2. Structural MRI Parameters\nNote: All imaging is acquired on a 3T MRI scanner using a 32-channel head coil. During a single session per subject:\nAcquire a high resolution T1-weighted anatomical using a 3D-MPRAGE sequence covering the entire brain with the following parameters: acquisition time 4 min 26 sec, field of view 256 mm, 256 matrix, 192 slices with slice thickness of 1 mm, with a resulting isotropic voxel size of 1.0 mm3, TR = 1900 ms, TE (echo time) = 2.52 ms with an inversion time of 900 ms and flip angle of 9°, 1 average, parallel imaging (iPat GRAPPA, acceleration factor of 2).",
    "Acquire a DTI sequence covering the cortex, with slices in transverse orientation following the anterior commissure/posterior commissure (AC-PC) line, using the following parameters:acquisition time 8 min 5 sec, field of view 192 mm, 128 matrix, voxels 1.5 1.5 mm in-plane, 56 contiguous (no gap) slices with 2 mm thickness, TR = 6900 ms, TE = 86 ms, 64 directions, b-value of 1000 s/mm2 (reference image with low b-value of 0 sec/mm2), 1 average, parallel imaging (iPat GRAPPA) with an acceleration factor of 3.\nAcquire 30-40 PD-weighted images in a coronal orientation, parallel to the brain stem,covering from the anterior extent of the pons to the posterior portion of the inferior colliculus.\n\t\nUse the Turbo spin echo (FAST spin echo) pulse sequence and the following parameters:acquisition time 1 min 29 sec per scan, field of view 192 mm, 256 matrix, 30-40 slices with thickness of 1 mm, resulting voxel size 0.75 0.75 1 mm3, TR = 3,000 msec, TE = 22 msec, turbo factor of 5, refocusing flip angle of 120°, 1 average, parallel imaging (iPat GRAPPA) with an acceleration factor of 2.\n\t\tNote: S12 was scanned using the following parameters: field of view 180 mm, 512 matrix, 30 slices with 1 mm thick slices, resulting voxel size 0.4 x 0.4 x 1.0 mm3. All other parameters remained the same. Acquisition time 2 min 47 sec.\nPre-process all scans by converting raw DICOM to NIfTI format using the program dcm2nii.\n3. LGN Delineation",
    "Note: The LGN is a small subcortical structure located deep in the brain, hence high-resolution PD images are required to determine its anatomical boundaries. In these scans, the LGN appears as an area of high signal intensity relative to the surrounding WM tracts, facilitating its detection21. The identified anatomical LGN is then used as a seed region for tractography.\nWhile blind to group membership, manually trace right and left LGN masks three times each on averaged PD images interpolated to twice the resolution and half the voxel size (original 256 x 256 matrix, 0.75 x 0.75 x 1 mm3 voxel size).\n\t\nTo obtain high resolution PD images use the freely available FLIRT function and other software tools within FMRIB's Software Library (FSL, http://www.fmrib.ox.ac.uk/fsl/). Upsample, concatenate, motion correct and average PD images for each participant as previously described elsewhere22.\nLoad the high resolution PD image in FSLView and click on the Tools tab to select the Single option (or press imgsrc://cloudfront.jove.com/files/ftp_upload/53759/53759symbol1.jpg ) to enlarge the image.\nClick the File tab to select the Create Mask option, and use the toolbar on the top left of the screen to trace the LGN in each slice. If desired, change the contrast of the image by dragging along the min/max in the toolbar to facilitate LGN detection.\nMerge these regions of interest (ROIs) into a median mask using the fslmerge command.\nCombine all raters' median masks into a single median mask using the same command.\n4. V1 Segmentation\nRun \"recon-all\" command in FreeSurfer23 (v5.3.0) on brains in native anatomical space (T1-weighted images) for automated processing.\nConvert the appropriate outputs in the newly created mri folder (orig.mgz, brain.mgz, rawavg.mgz, T1.mgz) to NIfTI using \"mri_convert\".",
    "Use BET brain extraction in the FSL GUI to correct the skull-stripped output brain (brain.nii.gz) in FreeSurfer space if necessary. Choose the Run standard brain extraction using bet2 option (default). Lower the threshold if image is missing brain tissue, or increase if non-brain tissue is captured (default threshold 0.5). Select the Output brain-extracted image and Output binary brain mask image (the latter may be used for manual corrections) in the advanced options.\nConvert output V1 parcellation to a volumetric mask using \"label2surf\" and \"surf2volume\" commands.\n5. Pre-tracking Registrations\nNote: For the next steps, call the FSL GUI to open each of the following tools.\nUse BET brain extraction and select the Bias field & neck cleanup option to skull-strip rawavg.nii.gz, located in the mri folder created by \"recon-all\". Adjust threshold as necessary.\nRun FLIRT linear registration to bring brains in FreeSurfer and native anatomical space to diffusion space.\n\t\nSelect brain.nii.gz, output of recon-all (FreeSurfer space), or a subject's brain extracted T1 (native anatomical space) as the input image, and an Eddy corrected and brain extracted diffusion-weighted image (DWI) as the reference image. Then click \"Go\".\n\t\tNote: This step creates two outputs, the input brain registered to the reference image (.nii.gz) and a transformation matrix (.mat). Apart from registration, the latter file is required for tractography when seed space is not diffusion. Use the output transformation matrices (.mat) created in this step for tractography as explained in 7.4.2.\nSimilar to 5.2, run FLIRT linear registration to bring participants' PD brains to FreeSurfer space and native anatomical space.\nPrepare seed masks for tractography:",
    "Apply FLIRT transformation from Utils in the FLIRT linear registration toolbox. Use the .mat output as the transformation matrix, the original LGN mask as the input and brain.nii.gz (FreeSurfer space) or T1_brain.nii.gz (native anatomical space) (see 5.2) as the reference volume. Select the Nearest Neighbor interpolation method from the advanced options.\nUsing brain.nii.gz files only, prepare target masks for tractography:\n\t\nRegister FreeSurfer brains to native anatomical space and create target masks by applying transformation to V1 masks (see 5.2, 5.4.1) using Tri-Linear interpolation. Click \"Go\".\n6. LGN Normalization \nUse FNIRT non-linear registration as described previously at http://fsl.fmrib.ox.ac.uk/fsl/fslwiki/FNIRT to bring participants’ non-extracted brains in native anatomical space to MNI space, using the Montreal Neurological Institute whole brain template (MNI152).\n\tNote: Non-linear registration of original anatomical images is recommended for this step, as registrations were more accurate when FNIRT was applied to non-extracted T1s compared to FLIRT on extracted brains.\nApply transformation to LGN masks in anatomical space (original LGN previously transformed to native anatomical space in 5.4) using nearest-neighbour interpolation as described in 5.4.1 to bring masks to MNI space.\nAverage all LGN masks in MNI space across both groups using AFNI's \"3dMean\" command.\nUse \"fslmaths -thr\" to apply a threshold to the mean mask in MNI space.\nCalculate the radius of the mean mask in MNI space using V = 4/3πr3 (assume a sphere).\nRecord the centre of mass coordinates of each individual LGN mask in native anatomical space using the command \"fslstats -C\".\nCreate spherical ROIs of identical volumes across participants:\n\t\nUse \"fslmaths\" to create an ROI point with the coordinates of the appropriate individual LGN mask in native anatomical space as recorded in 6.6\nUsing \"fslmaths\", apply the radius of the mean mask in MNI space to create a sphere around the ROI point in native anatomical space.",
    "Use these standardized masks as seeds for tractography.\n7. Probabilistic Tractography (FSL 5.0.4)\nNote: For the next steps, call the Fdt_gui to access each of the following tools.\nCorrect for distortions in DWIs with Eddy current correction. Select the Eddy current correction option from the menu at the top of the Diffusion Toolbox window and upload the DWI as the input, leaving the default reference volume (0).\nBrain extract the images with BET as described in 4.3.\nSelect the DTIFIT Reconstruction diffusion tensors option from the menu. Specify an input directory containing the following files: diffusion weighted data, nodif_brain_mask (output of BET), bvec and bval (must be renamed to bvecs and bvals; text files containing information about diffusion image acquisition parameters, output of DICOM to NIfTI conversion of diffusion data). Click \"Go\" to run dtifit, which fits a diffusion tensor model at each voxel, creating files for post-processing.\nNext, select the BedpostX (estimation of diffusion parameters) option from the menu. Use the same input directory as for DTIFIT. Click 'Go' to generate all files required for tractography.\nFrom the same menu, choose ProbtrackX for probabilistic tracking and run it for each hemisphere separately. Keep default basic options (5,000 samples, 0.2 curvature and loopcheck applied) and select modified Euler for computing probabilistic streamlines from advanced options for increased accuracy.\n\t\nSelect the output of BedpostX containing .merged files as the BEDPOSTX directory.\nSelect single mask as seed space and load the transformed LGN mask (in native anatomical space) as the seed image, T1 (brain in native anatomical space) to diffusion transformation matrix as the seed to diffusion transform, and V1 (in native anatomical space) in \"optional targets\" (all but exclusion masks) as the target.",
    "Use default mesh convention (Caret) and load the brain in native anatomical space (T1 image) as the surface reference image.\nRepeat ProbtrackX for probabilistic tracking using the standard spherical ROIs (created in step 6) as seed regions for tractography as described in 7.5.2. Upload ROIs in the same way transformed LGN (anatomical space) were uploaded in 7.5.2.\nRe-run tractography (7.5), this time with seed (non-normalized) and target masks in FreeSurfer space with the addition of FreeSurfer's contralateral white matter border mask as an exclusion mask, to avoid any crossing over and ensure direct ipsilateral connections. Check the Surface option from the ProbtrackX toolbox and select FreeSurfer as mesh convention.\n\tNote: It is important to emphasize that tractography is always run from diffusion space, but Probtrackx for probabilistic tracking allows the input of seed and target masks in a different space, along with a transformation matrix to diffusion space. In this study, probabilistic tractography was run with masks in both native anatomical and FreeSurfer space (Figure 2).\n8. Deterministic Tractography (DSI Studio)\nOpen Eddy corrected diffusion-weighted images in DSI Studio24 by clicking on Step 1: Open Source Images. Load bvec and bval files onto a b-table window that is automatically opened to create a source (.src) file.\nLoad the generated Source files onto the reconstruction window to modify the default reconstructed brain masks as necessary.\nThen, select DTI as the reconstruction method25 and run it on the source files to produce fiber information files (.fib).\nBring Participants' PD brains to diffusion space using FLIRT linear registration.\nApply transformation to LGN masks using nearest neighbor interpolation as described in 5.4.1.\nOpen .fib files in the program's tracking window.",
    "Run tracking for each hemisphere separately, using LGN in diffusion space as the seed and Region 17 (V1) from Brodmann atlas available from DSI Studio as the terminative region. Load the LGN mask by clicking the Regions tab and Open Region. Select the Seed option under Type in the Region List on the left of the screen. To load the V1 mask from the atlas, click on Atlas from the toolbar in the Region List and select the appropriate atlas.\nIn each run, set the contralateral WM (named left/right-cerebral-white-matter) mask from FreeSurfer segmentation atlas (see Region List box in the tracking window) as a region of avoidance (ROA).\nRepeat tracking (8.7-8.8) using spherical ROIs in diffusion space instead of individual LGN as seed regions for tractography.\n\tNote: The spherical ROIs have the same volume across all subjects and are centered on the center of mass of each LGN.\nRepeat LGN normalization, section 6, only this time registering brains in diffusion space to standard MNI space, and applying transformations to LGN in diffusion space (original LGN previously transformed to diffusion space in 8.4-8.5) to bring masks to standard MNI space. Calculate the volume of the spherical ROI as the mean volume of all LGN across subjects in MNI space.\n\tNote: Tracking parameters can be modified by the user. For most runs, default tracking parameters were applied. For some individuals (A5, A7, S12), anisotropy threshold (default 0.14-0.15) was lowered (0.10-0.12) and angular threshold (default 60) was increased (65-85) for nicer visualization. A schematic of the technique is shown in Figure 3.\n9. Statistical Analysis – TBSS (FSL)",
    "Note: Tract-based spatial statistics is a voxelwise statistical analysis of participants’ FA maps16 obtained with dtifit26. It is extensively used for statistics on diffusion data. This voxelwise approach overcomes potential alignment and smoothing problems seen in VBM-style FA analysis and provides whole brain investigation, unattainable through tractography-based approaches16.\nRun \"tbss_1_preproc\" on the FA data located in a newly created TBSS directory.\nRun \"tbss_2_reg\" – T to apply non-linear registration, bringing each participant's FA data into common space (FMRIB58_FA, target image in TBSS).\nCreate a mean FA skeleton with the centers of all common tracts among participants using \"tbss_3_postreg -S\".\nRun \"tbss_4_prestats 0.2\" to project each participant's aligned FA map onto the mean skeleton of all aligned FA maps.\nCreate design.con and design.mat files, ensuring that the order of the matrix is consistent with the order in which TBSS pre-processed the FA data.\nRun \"randomise\", using the T2 option, which is recommended for TBSS as it acts on a skeleton (a reduced subset of the 3D data), and 5,000 pre-mutations, which gives more accurate p-values.\n10. Statistical Analysis – SPSS \nExtracting FA Values from Deterministic Data\n\tNote: Deterministic-based FA values were derived from DSI Studio output statistics text files. These values represent the mean FA within the generated tracts, which in this case correspond to the region of the OR.\n\t\nRun fiber tracking in DSI studio.\nSave the 'statistics' text files created by DSI Studio for each generated set of tracts and record the 'FA mean' values from them.\nExtracting FA Values from Probabilistic Data\n\tNote: Probabilistic-based FA values are derived from ProbtrackX2 output fdt_paths files. These are 3D tract density images that in this study cover the area corresponding to the OR.\n\t\nUse FLIRT linear registration to bring each participant's fdt_paths files to diffusion space.",
    "Binarize the output masks using \"fslmaths - bin\".\nFor each participant, multiply the mask by their FA map from dtifit using \"fslmaths -mul\".\nRun \"fslmeants\" command to find the mean FA from each tract mask.\nRunning Analyses with SPSS (Using Deterministic and Probabilistic\n\tData)\n\tNote: Statistical analysis is performed using SPSS 20 for Mac. Since hemisphere is a within-subject variable, a generalized linear model (GENLIN) with which the effects in each side of the brain can be looked at separately, is applied. Specifically, the generalized estimating equation (GEE) is used.\n\t\nIn separate tests, set each of mean FA and streamline count (waytotal or percentage generated streamlines, PGSL) as the dependent variable.\n\t\tNote: In this study, streamline count is based on way-total values. Waytotal describes the total number of generated streamlines that have not been rejected by inclusion/exclusion criteria27. The number of generated streamlines (NGSL), which refers to the total number of streamlines sent, is equal to the number of voxels in the seed mask multiplied by the number of samples drawn from each voxel (5,000 in this case). Percentage generated streamlines (PGSL), waytotal divided by NGSL times 100, is a measure of successful connectivity between the seed and the target.\nStudy the influence of group and gender on LGN to V1 connectivity by setting them as independent variables in all tests.\n\t\tNote: Main effects as well as two- and three-way interactions were studied. It is important to note that these individual tests are not conditioned to each other, so the significance of one main effect or interaction is independent of the other.\nUse age as a covariate for all tests. Also, use LGN volume as a covariate for tests with mean FA and waytotal as the dependent variables, but omit it from tests with PGSL as the dependent variable.",
    "Note: Total brain volume was found to be an insignificant covariate and was therefore omitted from stats.\nSelect the Bonferroni correction method to adjust for multiple comparisons28 (level of significance p <0.05).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}