{
  "id": 5715,
  "origin_website": "Bio",
  "title": "Construction and Screening of a Transposon Insertion Library of <em>Yersinia enterocolitica</em>  (YeO3-R1)",
  "procedures": [
    "Transposition complex assembly (Lamberg et al., 2002)Prepare eight standard assembly reactions using Cat-Mu (1250-bp) transposon as a donor DNA. Cat-Mu (or equivalent) is commercially available. Alternatively, custom-made transposons can be constructed in the context of their carrier plasmids, isolated by BglII digestion and purified by anion exchange chromatography as described (Haapa et al., 1999).Mix ddH2O, glycerol, and 5x complex buffer at RT, and transfer the tube on ice. Take appropriate volumes of the reagents according to the chart below.Add your donor DNA.Dilute the MuA transposase in final concentration of 400 ng/μl with cold MuA storage buffer. Dilute only the amount needed. Keep MuA on ice all the time. Pipet MuA up and down before taking an aliquot or adding into the reaction as it is a sticky protein.Add MuA and transfer the tubes directly into 30 °C water bath. Mix thoroughly!table:\n﻿0,1,2\nComponent,Amount (μl),Final\nddH2O,16,Final volume 80 μl\n99.5% glycerol,40,50%\n5x complex buffer,16,1x\nCat-Mu (1.1 pmol/907.5 ng/μl),4,4.4 pmol\nMuA transposase (400 ng/μl),4,\"1,600 ng\"",
    "Incubate at 30 °C for 4 h.Concentrating your complexesFollowing assembly, reactions are pooled, and reaction products are concentrated (~10-fold) and desalted using Centricon YM-100 (100-kDa cut off, Millipore) centrifugal cartridges as described (Pajunen et al., 2005). Pooled assembly reactions are diluted up to 2 ml with TGD buffer, applied on the Centricon, centrifuged 30 min 1,000 x g, washed once with 1 ml of TGD buffer (15 min 1,000 x g), and finally recovered with a reverse spin at 300 x g for 2 min. Typical volumes after Centricon concentrators range from 40 to 70 μl.Alternatively, the concentration step can be done using polyethylene glycol (PEG6000) precipitation as described (Paatero et al., 2008).Pool your 8 x 80 μl assembly reactions = 640 μl.(Optional: take 5 μl sample for transposition complex gel)Add 380 μl filter-sterilized 20% PEG6000 – 2.5 M NaCl. Prepare fresh solution each time you concentrate your complexes.Incubate (precipitate) on ice 60 min.(Optional: take 5 μl sample for gel as above)Centrifuge for 60 min 13,000 rpm at 4 °C in a micro centrifuge.Discard supernatant carefully without disturbing the pellet.Resuspend pellet in 50 μl of TGD buffer. The calculated concentration of the Cat-Mu transposition complex preparation is 580.8 ng/μl.Dissolve the pellet on ice for 60 min or overnight. Tap the tube to help the pellet dissolve.Preparations are frozen in liquid nitrogen and stored at -80 °C. Transposition complexes can be stored at -80 °C for several months even up to 1 year without loosing activity.The assembly and concentration of the transposition complexes can be monitored by agarose/heparin/BSA gels as below (see Figure 1).The transpositional activity of the preparation can be measured by an in vitro transposition assay using plasmid DNA as target and introduction of the reaction products into competent E. coli cells (Haapa et al., 1999).",
    "Recovery of chloramphenicol-resistant colonies is an indication of functional transposition complexes.Transposition complex gelPrepare an agarose/heparin/BSA gel (2% NuSieve 3: 1 in 1x TAE, 87 μg/ml heparin, 87 μg/ml BSA).Measure 1 g of NuSieve 3: 1 agarose in a 250-ml flask.Add 49 ml of ddH2O, and weigh the flask again (should be approx. 49 g).Melt agarose in microwave oven (or equivalent).Weigh the flask again, and add H2O so that final weight is again 49 g.Add 1 ml 50x TAE buffer.When the solution is about 55 °C, add 43.5 μl of heparin 100 mg/ml and 109 μl of BSA 40 mg/ml.Prepare gel samples. For non-concentrated complexes (5 μl samples), add 0.5 μl of heparin 65 mg/ml, and 1 μl of 25% Ficoll PM 400 (w/v). For concentrated complexes, take 0.5–1 μl samples; add ddH2O up to 5 μl volume, and then heparin/Ficoll as above.Run the gel in 1x TAE at 80 V (5 V/cm) for 2 h. Preferably circulate the buffer with a pump.Stain the gel with ethidium bromide 0.5 μg/ml in 1x TAE for 60 min. Staining can be prolonged up to overnight if necessary.(Optional: Destain the gel in 1x TAE or ddH2O for 20 min.)Take a picture (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20120509/20120509091434_1513.jpgFigure 1. A representative transposition complex gel of Em-Mu (1447-bp) complexes (Pajunen et al., 2005). Lane 1, 300 ng of 2-log DNA ladder. Lane 2, 5 μl sample from pooled assembly reaction (250 ng of donor). Lane 3, 10 μl sample from PEG-precipitation before centrifugation (326 ng). Lane 4, 10 μl sample from supernatant. Lane 5, 0.61 μl sample from concentrated complexes dissolved in TGD buffer (410 ng of donor DNA. Lane 6, 1 μl sample from concentrated complexes (665 ng of donor DNA). Lane 7, unassembled control, 410 ng of donor DNA alone. The ca. 3.",
    "5 kb band corrensponds to the complex formation between the ends of a single transposon (C1), see Lamberg et al. (2002) for Cat-Mu complex gel.Preparation of electrocompetent cells (Lamberg et al., 2002)Inoculate a fresh YeO3-R1 colony into 25 ml SOB medium (without magnesium) in 100 ml flask. Grow the cells overnight with vigorous aeration at 37 °C.Dilute 0.5 ml of the overnight culture into 500 ml of SOB in a 3 L flask. Grow for 2-3 h with vigorous aeration at 37 °C until the OD600=0.8.Incubate on ice 30 min.Divide into three 250 ml bottles. Harvest the cells by centrifugation at 5,000 rpm (2,600 x g) in a Sorvall GSA (or equivalent) rotor for 10 min at 4 °C.Wash the cell pellet by resuspending each in 5 ml of sterile ice-cold wash buffer (10% glycerol, 90% distilled water, v/v). Keep the bottles on ice at all times.Combine into two bottles.Add 200 ml ice-cold wash buffer per bottle, and mix by inverting the bottles several times.Centrifuge the cell suspension at 5,000 rpm (2,600 x g) for 15 min at 4 °C and carefully pour off the supernatant as soon as the rotor stops. Cells washed in the Wash buffer do not pellet well. If the supernatant is turbid, increase the centrifugation time.Wash the cell pellet a second time by resuspending in 5 ml of sterile ice-cold wash buffer. Add 200 ml wash buffer, and mix by inverting the bottle several times.Centrifuge the cell suspension at 5,000 rpm for 15 min.Pour off the supernatant and resuspend the cells in the Wash buffer that remains in the centrifuge bottle. Combine into single bottle. Final volume is approximately 2 ml (~1x1011 cells/ml).Incubate on ice at least 30 min, preferably 60 min.Cells can be used immediately or can be frozen in aliquots.",
    "For some strains like YeO3-R1 fresh cells yield better efficiencies.For freezing divide 60 μl (or 120 μl) in sterile cold micro centrifuge tubes. Flash-freeze in liquid nitrogen and store at -80 °C.Preparation transposon insertion library (Pinta et al., 2012)To generate the library, 8 individual electroporations are performed as follows.Take 50 μl of freshly-prepared electrocompetent YeO3-R1 cells. Mix on ice with 1.7 μl (990 ng; preferentially use 800-1,000 ng of complexes for highest efficiency) of Cat-Mu transposition complex preparation.Transfer the mixture to a pre-chilled 0.1-cm electrode spacing cuvette, and carry out electroporation using Genepulser II with the following settings: 200 Ω, 1.8 kV, 25 μF.Add 1 ml of pre-warmed SOC medium, and combine the suspensions from the individual electroporations in a 50-ml flask.Grow bacteria for 50 min at 28 °C with agitation (220 rpm).Add 3.3 ml 50% glycerol to the final concentration of 15% (v/v).Freeze the library as aliquots (e.g. 14 x 0.8-ml) in liquid nitrogen, and store at -80 °C.To estimate the number of individual transposon insertion mutants in the library thaw one aliquot and spread on LA plates with Chloramphenicol (10 μg/ml) (LA-Clm).Incubate 1–2 days at 28 °C (i.e., optimal growth temperature for Y. enterocolitica), and calculate the number of colony forming units (CFU).Isolation of enterocoliticin resistant mutants (Pinta et al., 2012)From the library aliquots prepared above spread a total of 16,000 CFU on LA-Clm plates such that you obtain individual colonies. Typically spread four library aliquots as 50 μl aliquots to 40-50 LA-Clm plates. Incubate 2 days at RT.Pool the Clm-resistant colonies by adding 1 ml PBS / plate and detach the colonies gently by scraping with an L-spreader.With a pipette transfer the PBS-suspension into a 50 ml Falcon tube.Pool the colonies from all other plates and combine them into one 50 ml tube.",
    "Mix the tube gently but thoroughly f. ex. by pulse vortexing.To prepare the pooled transposon library for long-time storage (i.e., the part you don't use immediately) follow steps 8-10.To continue with the isolation of enterocoliticin resistant mutants follow the steps from step 11 forward.Centrifuge the 50 ml tube at 3,000 rpm (2,000 x g) for 15 min at 4 °C and carefully remove most of the supernatant.Resuspend the pellet in 5 ml of 15% glycerol in TSB.Freeze the library as 0.5 ml aliquots and store at -80 °C.Measure the OD600 of the pooled transposon library from a suitable dilution (f.ex. 1:100).Based on the result dilute the cell suspension with PBS to OD600 ~0.2.Mix 10 μl of the OD600 ~0.2 suspension with 10 μl of enterocoliticin (Strauch et al., 2001) (suitable enterocoliticin-dose is determined in section VII) and 80 μl of TSB.Spread the mixture on a LA-Clm plate.Repeat steps 13-14 four times to get altogether 5 plates.Incubate the plates 1-2 days at RT to allow the growth of enterocoliticin-resistant mutants.Pick up single colonies from the plates and spread as pure cultures on new LA-Clm plates. These will constitute the candidate enterocoliticin-resistant mutants.Incubate the plates 1-2 days at RT.The enterocoliticin-resistance of the pure cultures has to be confirmed using a drop-test. Divide an LA-Clm plate into 8-12 sectors and culture the mutants on the sectors as a lawn using inoculation loops. As control, culture known enterocoliticin-sensitive and –resistant bacteria on some sectors.Immediately, apply a 2 μl drop of enterocoliticin in the center of each lawn.Incubate the plate 1-2 days at RT and inspect the sectors.he enterocoliticin-sensitive bacteria have no growth on the spot where enterocoliticin was applied while the enterocoliticin-resistant bacteria grow all over the sector. Continue with the enterocoliticin-resistant mutants to section 8.",
    "Determination of the killing potential of the enterocoliticin solutionUse a fresh colony of YeO3-R1 to inoculate 5 ml of TSB in a 15 ml tube. Grow the cells overnight with aeration at RT.Measure the OD600 of the culture. Dilute the culture in PBS so to OD600 ~0.2.Mix 10 μl of the OD600 ~0.2 suspension with different amounts of the enterocoliticin solution [Strauch et al., 2001] (f. ex. 1, 5, 10, 30 and 50 μl). Fill up the volume of the mixtures to 100 μl with TSB.Plate the different mixtures on separate LA-Clm plates.Incubate the plates 1-2 days at RT.Count the spontaneous resistant colonies. There should be less than ten spontaneous resistant colonies / plate.Identification of the transposon insertion siteThe Cat-Mu transposon insertion sites can be identified by sequencing the transposon-containing genomic fragment that are cloned into pUC19 (Pinta et al., 2012). For the cloning of the transposon insertion fragment, HindIII digested genomic DNA (isolated using a DNA-isolation kit suitable for bacteria) of the mutant is cloned into HindIII digested pUC19 using standard protocols. HindIII does not cleave the Cat-Mu, thus ClmR transformants can be selected.The inserts in the plasmids isolated from the transformants can be sequenced using transposon-specific primers Muc1 and Muc2 (5'-GCTCTCCCCGTGGAGGTAAT-3' and 5'-TTCCGTCACAGGTATTTATTCGGT-3', respectively). The sequences obtained from these allow identification of the Cat-Mu -flanking regions on both sides of the transposon-insertions."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology",
    "Systems Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}