{
  "id": 5411,
  "origin_website": "Bio",
  "title": "Xylem Sap Extraction Method from Hop Plants",
  "procedures": [
    "Preparation of host plantsUse one-year-old potted hop plants multiplied from softwood cuttings of the susceptible cultivar ‘Celeia’ and resistant ‘Wye Target’ and grown in 1 L plastic pots. It is important that plants have strong, thick stems, the diameter of which should be more than 5 mm (Figure 1). Use plants are produced by a professional grower. Grow plants in a greenhouse on mist benches. Water the plants every 2 days and fertilize once per week using foliar fertilizers that contain macro and micro elements (e.g., 0.1% solution of YaraKristalon yellow NPK 13-40-13 + ME). To maintain the appropriate health status, spray the plants once per week against pests and foliar diseases using protective plant protection products.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170313/20170313064230_3382.jpgFigure 1. Example of stems of hop plants, cultivar Celeia. Left – strong, thick stem. Right – weak, thin stem.Inoculum preparationPlace a small piece of fungal mycelium (of the size of a 2 mm ‘ball’) from stock PDA plates in each of four 500 ml Erlenmeyer flasks filled with 250 ml of liquid GFM, supplemented with 100 mg/ml streptomycin sulphate and 100 mg/ml chloramphenicol.Incubate for approximately 5 days at 100 rpm on a rotary shaker at room temperature and in the dark (place the shaker in a dark room) (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170313/20170313064617_4598.jpgFigure 2. A picture of fungal culture grown after 5 days. White fungal mycelium in a sphere shape can be seen. Medium with fungal isolates that produce a lot of spores is duller.Prepare the conidia inoculum (spore size is 5 to 7 μm) by filtration of mycelia and the spore through miracloth (typical pore size is 22-25 µm): place a non-autoclaved piece of Miracloth (20 x 20 cm) on top of a 2 L plastic cup, hand held, and filter each flask separately, one by one. Wash spores and suspend in sterile distilled water.",
    "If the concentration is low, all the filtration material is needed.Use a Thoma counting chamber to determine the spore concentration. Determine the spore concentration four times for one filtrated suspension and calculate an average.Adjust the spore concentration to 5 x 106 conidia/ml with sterile distilled water.The final volume of inoculum with a concentration of 5 x 106 conidia/ml for artificial infection should be 1 L. Use a maximum 12 plants per one volume of inoculum.Artificial infectionUproot one-year-old hop plants that have been grown in 1 L plastic pots. Remove as much soil substrate as possible from the roots by hand.Rinse the roots in sterile water (just gently dip for a few seconds).Then dip the roots for 10 min in 1 L of inoculum that has been poured into a 2 L plastic cup.Inoculate a minimum of 30 plants per treatment.Dispose of the remaining fungal inoculum after autoclaving.Treat the control plants similarly, but dip their roots in sterile distilled water.Pot the plants in new pots of size 2 L.Grow the plants as a single bine in a growth chamber (RK-13300, Kambič) under a 12-h photoperiod of fluorescent light (L 58 W/77; Fluora, Osram) at a temperature of 22 °C and relative humidity of 65% during the light period and 20 °C and 70% during the dark period. During growth in the chamber, water the plants twice a week and fertilize once per week using foliar fertilizer containing a higher quantity of nitrogen (e.g., 0.2% solution of YaraKristalon special NPK 18-18-18 + ME).Xylem sap extractionSample the plants 30 days post inoculation (± 3 days).Uproot the hop plants. Carefully remove the soil from roots but do not wash them in water.Cut the plants 5-10 cm above ground with a scalpel or blade (Figure 3).",
    "Use the lower part of the plant (root side with 5-10 cm of stem) for xylem sap extraction and discard the upper part of the plant (containing the rest of the stem and leaves). Wash the cut surface with sterile distilled water (drip a few drops of water onto the surface using a 100 µl pipette and soak the water up with filter paper).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170313/20170313064912_3647.jpgFigure 3. Plants are cut 5-10 cm above ground with a scalpel or bladePlace the root in a plastic bag (Figure 4), sealed with tape against the base of the stem. The plastic bag does not have to be sealed very well because it is used only to protect the Scholander pressure cylinder from getting dirty. Insert the stem through the metal cover of the Scholander pressure cylinder (Figure 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170313/20170313065006_2285.jpgFigure 4. The root is placed in a plastic bagimgsrc:https://en-cdn.bio-protocol.org/attached/image/20170313/20170313065112_0416.jpgFigure 5. Metal cover of Scholander pressure cylinder with cut plant stem. The plant stem is placed through the upper part of the Scholander pressure cylinder.Place the root side in the Scholander pressure chamber (Scholander et al., 1965) and make an installation from sterile pipette tips for leading the xylem sap to a microtube, which is placed on ice (Figure 6).  Any other installation (e.g., silicone tubing, plastic tubing, glass tubing, etc.) can be used for leading the xylem sap to the microtube.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170313/20170313065331_5349.jpgFigure 6. Xylem sap extraction with Scholander pressure chamber. Left: Installation from pipette tips for leading xylem sap to microtube; right: Extraction of xylem sap using Scholander pressure chamber. The microtube is placed on ice, applying a pressure of 2-2.5 bar.Apply a pressure of 2-2.5 bar to extract xylem fluid.Blot the first drops of exuding fluid with filter paper to avoid phloem contamination.",
    "Then collect the xylem sap (Figure 7) for up to 3 h in microtubes (they must be placed on ice!) containing up to 20 µl 1x protease inhibitor cocktail.Store samples of xylem sap at -80 °C until analysis.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170313/20170313065443_6419.jpgFigure 7. The stream of xylem sap. Xylem fluid is seen in the installation from pipette tips.Use the root side for mycological re-isolation of the pathogen to confirm the presence of the pathogen in the inoculated plants. Perform re-isolation in a laminar. Spray the stems with 96% ethanol and place them very briefly on an open flame in order to sterilise the surface. Harvest the xylem sections from inoculated plants and place them on PDA + A plates. The xylem section is actually the whole inner part of the stem, which should be cut into 1-2 cm long pieces. Place three to six pieces from each plant on PDA + A plates. Fungal outgrowth can be detected after the plates have been incubated for 3-5 days in the dark at room temperature (Figure 8). Examine the emerging mycelium (if any) by light microscopy.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170313/20170313065545_4587.jpgFigure 8. Fungal outgrowth from xylem sections after 3-5 days. White and fluffy mycelium is typical of V. nonalfalfae. Fungal mycelia prefer to grow on the plant material (xylem sections are completely overgrown by mycelium) and not on the PDA medium."
  ],
  "subjectAreas": [
    "Microbiology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}