{
  "id": 6976,
  "origin_website": "Bio",
  "title": "Evaluation of Viable Cells in <em>Pseudomonas aeruginosa</em> Biofilms by Colony Count and Live/Dead Staining",
  "procedures": [
    "The steps of biofilm formation and biofilm evaluation are summarized in Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200914/20200914200342_6319.jpgFigure 1. Schematic diagram of the experimental procedure Biofilm formationPipet 10 ml of LB medium in sterile 125 ml Erlenmeyer flasks. Then pick, using an inoculation loop, PAO1 colonies from an LB media plate, and shake the loop until the fragment is visibly floating in the liquid LB medium. Grow overnight at 37 °C with shaking (200 rpm) in an incubator shaker. Keep the Bunsen burner on during the entire procedure. Work slowly, carefully, and at all times within this sterile area created by the Bunsen burner.Dilute this overnight culture (desired OD650 2.5-3) in 12 ml of fresh LB medium in a new sterile 125 ml Erlenmeyer flask to achieve a final OD650 of about 0.01. Keep the Bunsen burner on during the entire procedure. Work slowly, carefully, and at all times within this sterile area created by the Bunsen burner.Pipet 10 ml of these suspensions in sterile100 ml glass beakers. By using a sterile stainless steel dissecting tweezer, place a sterile glass coupon horizontally at the bottom of each beaker to allow biofilm formation on it. Cap the beaker with a cotton plug (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200914/20200914200255_3907.jpg Figure 2. Biofilm formation devicePlace the glass beakers in a tupper carrying 1 cm high of tap water and cover them with aluminum foil to create a humid chamber.Incubate at 37 °C in an incubation stove for 24 h without shaking.Note: Immediately before placing the coupons into the beakers, they must be sterilized by dipping into a flask with 96% ethanol and flaming on fire. Repeat this procedure between coupons.Biofilm evaluationCounting of colony forming units (cfu) Prepare fresh LB agar plates by placing 25 ml of solid LB medium in 80 mm Petri dishes.",
    "After solidification, allow them to dry open and upside down in a stove for at least 30 min at 55 °C.Remove the coupons from the beakers with a sterile stainless steel dissecting tweezer.Wash the coupons carefully by letting sterile distilled water (about 10 ml) drop down gently on them to remove unattached cells.Hold the coupons vertically with the tweezer and scrap for 1 min the bacterial biomass from them with a sterile spatula in a 40 mm Petri plates containing 1 ml of saline solution (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200914/20200914200328_8095.jpg Figure 3. Coupon scrapingWash the coupons by pipetting the saline solution in the small Petri dish to remove all attached bacteria.Place the bacterial suspensions in 1.5 ml sterile Eppendorf tubes.Homogenize by 1 min of vigorous vortexing (2,400 rpm).Make serial dilutions of the suspensions. To do this, add 0.5 ml of the initial sample to a sterile borosilicate glass tube carrying 4.5 ml of saline solution and mix by vortexing (10-1 dilution). Then, take 0.5 ml of 10-1 dilution and pass it to a new tube carrying 4.5 ml of saline solution to make the next dilution (10-2 dilution) and so on until 10-5 dilution.Spread 50 µl of each dilution in a sterile dried LB plate by using a sterile rake shaped spreader.Incubate the plates at 37 °C for 24 h in an incubation stove.Count the colonies formed onto the LB agar in the Petri plates. Only plates containing about 20-200 colonies must be taken into account.Determine the number of the viable cells in cfu cm-2. First, the total cfu in a coupon is calculated according the following formula: no. of colonies count in the plate x dilution factor x total volume of biofilm biomass (1 ml)/volume plated (0.05 ml).",
    "This value must be divided by the total surface of the coupon to obtain the number of cfu per cm2. At least three coupons are needed for statistical analysis.Note: The stainless steel dissecting tweezer and the rake shaped glass spreader must be sterilized by dipping into a flask with 96% ethanol and flaming on fire between each use. Spatulas are immersed in 96% ethanol and dried in an oven before used.Membrane integrity evaluation Remove the coupons by taking them with a pair of stainless steel dissecting tweezer as for cfu counting procedure.Wash the coupons carefully by letting sterile distilled water (about 10 ml) drop down gently on them to remove unattached cells.Immerse each coupon in 1 ml of a solution containing 3.5 μM SYTO 9 and 20 μM PI in distilled water placed in a small Petri plate. This procedure must be performed in dark conditions.Incubate for 15 min at room temperature in the dark.Wash the coupons with sterile distilled water to remove the staining solution. To do this, dip the coupon in a 100 ml glass beaker carrying 20 ml of distilled water for a few seconds and then let dry at room temperature on a paper towel. This procedure must be performed in dark conditions.Observe the coupon under an epifluorescence microscope with 100x objective lens and immersion oil.Take at least 6 representative photographs per slide.Use the ImageJ Program (ImageJ software [Rasband, 1997]) to calculate the percentage of red areas in the images:Open the image with the ImageJ Program.Select the red areas using any of the drawing/selection tools (i.e., rectangle, circle, polygon or freeform).Then, from the Analyze menu, select Set measurements and look of the area value.Repeat the procedure with all the red areas.Calculate the percentage of red areas based on the total area of the image.",
    "Notes: After washing the slides, the stained biofilms could be stored under dark conditions at room temperature for at least 24 h to observe them by epifluorescence microscopy. Avoid all contact with SYTO9 and PI; they need to be handled carefully and with gloves. The generation of waste should be avoided or minimized whenever possible. All waste must be discarded as “special waste” under the safety standards of hazardous waste. The staining and microscope procedures do not need to maintain sterility."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}