{
  "id": 10339,
  "origin_website": "Jove",
  "title": "Process Optimization using High Throughput Automated Micro-Bioreactors in Chinese Hamster Ovary Cell Cultivation",
  "procedures": [
    "1. Preculture Procedure\nNOTE: Recombinant CHO DG44 cells with a viable cell concentration of 1 x 107 cells/mL are used for this protocol.\nThaw the vial containing 1.2 mL of cells to room temperature and immediately transfer the cell suspension to a 15 mL conical centrifuge tube containing 10 mL of cold seed medium.\nCentrifuge the conical centrifuge tube for 5 minutes at 190 x g and room temperature and discard the supernatant.\nPre-heat 150 mL of the seed medium in a 500 mL shake flask to 36.8 °C.\nGently resuspend the cell pellet in 10 mL of pre-warmed seed medium and transfer the cells into the shake flask.\nUse 1 mL of the sample from the flask to measure the initial VCC and viability using a cell counter.\nNOTE: The viability should be above 70% after thawing for successful cultivation.\nIncubate the shake flask in an orbital shaker (shaker diameter of 19 mm) at 36.8 °C and 7.5% CO2 with a shaking rate of 120 rpm.\nNOTE: These conditions vary depending on the cell strain and medium.\nThree days after passaging the cells, remove the shake flask from the shaker and place it under the laminar flow cabinet. Take 1 mL of sample to measure the final cell concentration. Calculate the volume to be transferred to fresh pre-warmed seed medium such that the initial cell concentration in the new passage is 2 x 105 cells/mL.\nPassage the cells 5 times in total before transferring to the bioreactor for the main cultivation.\n2. Main Cultivation\nMeasure the final cell concentration of the preculture. Calculate the volume to be transferred to the bioreactor such that the initial cell concentration in the reactor is 3 x 105 cells/mL.",
    "Fill the reactor with production medium a day before the inoculation to equilibrate the reactor and set the process parameters such as temperature, pH and DO.\nNOTE: The cultivation conditions are 36.8 °C and 60% dissolved oxygen concentration (DO). We tested stirrer speeds of 1050 rpm and 1300 rpm along with pHs of 6.9, 7.1, and 7.3. The total duration of the cultivation is 12 days until the cells are harvested. The batch process runs for 72 hours after which the feed medium is added every 24 h. The protocol to be used for the cultivation is listed in detail in the next segment.\n3. Writing the Recipe in the Automated Micro-bioreactor Software\nNOTE: There are two ways of writing a recipe in the AMBR cell culture software: it is created either by using a wizard or by adding each step manually. For the purpose of this protocol, steps using the wizard are shown.\nCreating a new experiment\nOpen the AMBR cell culture software and in the Introduction tab click on Create New Experiment.\nLoading the recipe\nIn the New Experiment tab, enter the name of the experiment along with the date on which it is to be conducted.\n\t\t\nActivate the check point for the culture station and the vessels to be used during the cultivation. The Auto Add DOE Tags will also be activated for an easy transition during the programming of the DOE experiment. Click on Next to switch to the next tab.\nSet information about addition of media into the vessel along with antifoam, inoculum, feed and glucose.\n\t\t\nActivate the Add Media Plate check point. Define the Plate type, name and location of the plate containing the medium.",
    "CAUTION: Depending on the type of plate and if the plate contains a lid, activate the check on Is Lidded to ensure smooth functioning of the liquid handler\nClick on Add Media To Vessels. Enter the volume of the media to be added into the vessels. Define the mapping of the transfer of the media from the plate to the vessels. Click on Next to switch to the next tab.\nSet the cultivation conditions in the reactor.\n\t\t\nAfter the media information has been fed into the software, assign the cultivation conditions. Click on Condition Media and fill in the temperature, target DO, upper pH limit and stirring RPM (Up stirring or Down stirring).\nSet addition of inoculums into the vessels.\n\t\t\nActivate Add Cell Plate. Define the plate type, name and location of the plate containing the medium.\nClick on Add Cells To Vessels. Enter the time of inoculation and the volume of the media to be added to the vessels.\nDefine the path travelled by the liquid handler to the transfer of the cell from the plate to the vessels. Click on Next to switch to the next tab.\nNOTE: Ensure Reuse Pipette Tips is deactivated to avoid cross-contamination and incorrect initial viable cell concentration.\nSet addition of feed, glucose and antifoam.\nNOTE: The procedure for addition of feed, glucose and antifoam is similar to each other. For the sake of this protocol the procedure is listed for “Feed”. This can be replicated for glucose and antifoam.\n\t\t\nActivate the Add Feed Plate and define the plate type, name and location. Click on Add Feed To Vessels and enter the volume of the feed to be added to the vessels. Define the mapping of the transfer of the feed from the plate to the vessels.",
    "Depending on the cultivation, add the number of feed addition. For this cultivation, the reactor is fed after 72 hours for every 24 hours.\nManually add the time delay between the feeding by entering the data into Delay from cells added. The first day of feeding is after 72 hours of inoculation and the next one is after 96 hours and so on.\nNOTE: Antifoam addition is programmed to be added every day to avoid foaming during the cultivation.\nSet sampling during the cultivation.\n\t\t\nActivate the Add Sample Plate and define the plate type, name and location.\nCheck on Take Sample from Vessels and enter the volume of the sample to be removed from the vessels. Define the mapping of the transfer of the sample from the vessels to the plate. Ensure that the volume does not decrease below 10 mL during the entire course of cultivation.\nAdd the number of samples to be taken during the cultivation. Similar to feeding, add the time of the sample being removed from the vessel for each input sample point.\nSave the process. It is now ready for execution.\nNOTE: To ensure the smooth running of the protocol, switch to the Process Steps tab in the AMBR cell culture software and select Process Step view to visualize the flow of the recipe.\nDesign of experiment in the automated micro bioreactor\nIn order to run the DOE software of the bioreactor, ensure that the recipe in the main software is saved and ready to use.\nOpen the AMBR 15 DOE software and click on Investigation and select New.\n\t\t\nEnter the name of the new DOE investigation in the Create Investigation dialog box.",
    "In order to assign an experiment to the DOE investigation, open the recipe created to study the different parameters. Click on Browse and select the respective experiment.\nDefine the DOE factor.\n\t\t\nThe vessel tags are already enlisted in the column. To define the desired DOE factor, select the parameter and click on the column labeled DOE factor. Select New and add the units, abbreviation, lower and upper limit of the factors (e.g., temperature, DO, pH).\nDefine the response factor.\n\t\t\nOnce the DOE factors have been defined, define the response based on which the experimental analysis would be structured.\nIn the Responses tab, define the values to be considered for the analysis of the data.\nClick on Edit DOE Responses and define the name of the response, abbreviation, units, minimum and maximum limits (e.g., titer, viable cell concentration).\nOnce the responses are defined, select the AMBR variable for each response and define the variable. A response can be automatically associated with a micro-bioreactor variable, Choose the required variable from the drop-down list.\nChange the equation for each of the response depending on the requirement. The choice is between the minimum, maximum, first, last and average data.\nCreate a design.\n\t\t\nUse the Start Design Wizard in order to select the type of experimental design, to add or remove the number of replicates and center points.\nSelect the objective, which determines the choice of designs and models:\n\t\t\tScreening: Uses linear and interaction models to find the important factors\n\t\t\tOptimization (RSM), Uses quadratic and cubic models for detailed modeling and optimization\n\t\t\tSplit objective: Models for formulation and process factors can be chosen separately\nOnce the objective is decided upon, select the model and the design along with the number of center points and replicates.\nClick on Finish and switch to the next tab.",
    "Define the experiment.\nNOTE: The DOE factors are listed in the right column of the software. On selecting the desired factors, the vessels running that experiment with the desired parameter would be highlighted. The vessels within the culture station can be moved around by right clicking on the vessel and moving it to the desired location.\n\t\t\nCreate work packets that can be imported in the AMBR cell culture software. Depending on the number of experiments the different work packets are created and stored for further implementation\nExecution of the experiment in the work packets created on the AMBR control laptop\nIn the Experiment tab, click on Create DOE Experiment and browse for the work packet created using the DOE software.\nInitialize the process by clicking Start.\nAnalysis of experimental results\nOnce the experiment has been executed, export the data using Export DOE Results. The Export DOE Results window opens and the rows indicating the culture vessel and station are listed in the table.\nSelect the desired rows and click on Exported Selected Rows or Export Experimental data to store all the results and save the file for further analysis.\nImport the data into the AMBR DOE module by switching to the Results tab and selecting Import Results.\nBrowse for the desired data file and click the Analysis Results.\nAnalyze the results further in MODDE.\n4. Execution of Cultivation in the Automated Micro-bioreactor\nNOTE: The following steps are executed by the user with the help of the protocol written in the aforementioned software. The steps are carried out by the user unless mentioned otherwise.\nLoading the vessels\nOpen the gamma sterilized culture vessels under a laminar flow cabinet and orient in the culture station as depicted in Figure 2.",
    "Clean the clamp plate with 70% ethanol and double distilled water. Then, autoclave the plate and place on top of the vessel.\nMount the clamp plate with a stirrer plate, ensuring each pin is fixed firmly.\nTighten both the stirrer plate and clamp plate onto the stirring assembly.\nRunning the micro-bioreactor software\nUse the program written in Section 3 to run the cultivation.\nVisualize the process steps scheduled or completed in the Process tab. Alter the cultivation steps during the process run as needed by first pausing the liquid handler and then editing the process recipe.\nAdd antifoam to the vessels before the stirrer is started to ensure there is no excessive foaming during the cultivation. The antifoam will be added regularly, and the foam detected visually.\nAddition of media into the vessel\nFill the 24 well plate provided with the micro-bioreactors manually with sterile media and place in the designated deck of the system. Ensure the plate is placed in the deck designated by the written program (section 3). The filling of the vessel will take place as designed in section 3.2.2.\nNOTE: The temperature and stirrer start immediately after the addition of the media and the antifoam. The sensor reader is activated 1 hour after the vessel is filled (Start Monitor step). Gassing to each vessel commences once the reader has been activated. Media is left to equilibrate for a minimum of 6 hours before pH recalibration and inoculation. The process parameters can be altered in the software as mentioned in section 3.2.3.\nInoculation\nMeasure the viable cell concentration after the 5th passage. Calculate the number of cells to be transferred to the vessels to ensure that the initial cell concentration in all the vessels is 3 x 105 cells/mL.",
    "Transfer the cells to a 24 deep well plate such that the volume of the suspension is at least 1.6 times the required volume. For a required volume of 2 mL of the inoculum, transfer 3.2 mL of cell suspension into each well in the plate.\nPlace the 24 well plate in the designated deck. The vessels will be inoculated as in section 3.2.4.\nDaily sampling and analytics\nRemove a 460 μL sample from the vessels every day using the liquid handler. Dilute 200 µL of the sample with 800 µL of filtered 1x PBS buffer (5x dilution), and then place in the cell counter.\nCentrifuge the remaining sample for 5 min at 190 x g and room temperature and store the supernatant for further analysis (glucose, lactate, glutamine and glutamate).\nFreeze 100 µL of the supernatant at -20 °C until the end of the cultivation for protein quantification.\nEnd of cultivation\nWhen the process parameter control (i.e., temperature, agitation, pH and DO) has terminated, stop the monitoring of the process.\nUnscrew the stirrer plate and clamp plate.\nRemove the culture vessels and clean the culture stations. Place the drying plates on the culture stations and screw them in.\nMeanwhile, clean the clamp plates thoroughly with 70% ethanol and double distilled water.\nClick on Stop in the bioreactor software once the drying cycle is completed.\nCell culture harvest\nHarvest cells on Day 12 of the cultivation by manually removing the content of the vessels into 50 mL centrifuge tubes. Centrifuge the cell broth at 190 x g for 30 min.\nDiscard the cell pellet and store the supernatant at -20 °C.\n5. Measuring mAb Concentration\nUse a 1.7 mL Protein A column for the quantification of the protein during the cultivation run.",
    "Prepare the equilibration and elution buffer before thawing the samples.\nUse a solution of 0.5 M Na2HPO4 containing 0.5 M NaCl with a pH of 7.9 as the equilibration buffer and a solution of 100 mM glycine containing 0.5 M NaCl with a pH of 2 as the elution buffer.\nFilter both buffers through a 0.2 µm membrane and degas before being placed for the analysis.\nPurge the high-performance liquid chromatography system (HPLC) with freshly prepared equilibration buffer.\nLoad the protein A column on to the HPLC system.\nCarry out chromatography with a flow rate of 1 mL/min. Set the column oven temperature at 30 °C and autosampler temperature at 10 °C\nThaw the frozen samples at room temperature and filter 225 µL of each sample through a 0.22 µm PVDF membrane. Dilute the samples with higher concentration of the desired protein are in a 1:20 ratio with equilibration buffer and filter through the membrane before placing in the autosampler.\nPlace the samples in the autosampler. Load the method and sequence in the software and start the sequence.\nNOTE: The method is comprised of three phases (see Figure 1): injection of the sample into the column for the first two minutes; followed by elution buffer for 8 min and column regeneration with equilibration buffer for 10 min.\nimgsrc://cloudfront.jove.com/files/ftp_upload/60577/60577fig01.jpg\nFigure 1: Protein A chromatogram, representing the different phases during a single run. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/60577/60577fig01large.jpg]Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}