{
  "id": 4025,
  "origin_website": "Cell",
  "title": "Protocol for Efficient CRISPR/Cas9/AAV-Mediated Homologous Recombination in Mouse Hematopoietic Stem and Progenitor Cells",
  "procedures": [
    "Step-by-Step Method Details\nStep-by-Step Method Details\nAAV Production\nTiming: 5 days\nTransfect, harvest and lyse transfected HEK293T cells for AAV production.\nMaintain HEK293T cells in a 150-mm cell culture dish containing DMEM+/+ (DMEM with high glucose and sodium pyruvate) supplied with 10% FBS (HEK293T medium) below 80% confluence and harvest at around 80% confluence.\nDay 0: Wash cells with PBS and trypsinize with Trypsin-EDTA for 5 min at 37°C. Collect cells by adding 10 mL of fresh HEK293T medium and pipetting up and down 10 times. Centrifuge at 290 × g for 5 min at 4°C and discard the supernatant. Resuspend the cell pellet in 20 mL HEK293T medium and count cell number using a hemocytometer. Plate 1 × 107 cells in a 150-mm dish in 20 mL HEK293T medium. For each AAV donor vector, prepare eight 150-mm dishes.\nDay 1: 2 h before transfection, aspirate the old medium and add 15 mL of fresh HEK293T medium containing 25 mM HEPES (add 12.5 mL of 1 M HEPES per 500 mL HEK293T medium) to each 150-mm dish containing the HEK293T cells.\nPer 150-mm dish, prepare a transfection mixture as follows: 2 mL 22°C–24°C Opti-MEM + 10 μg pAAV genome + 10 μg pCap/Rep-DJ + 20 μg pAAV-helper plasmids. Gently mix by vortexing and slowly add 120 μL PEI (1 mg/mL) to the transfection mixture at a 3:1 ratio of PEI (μg): DNA (μg). Vortex briefly and incubate at 22°C–24°C for 10 min.\nAdd the transfection mixture dropwise to each 150-mm dish. Mix gently and transfer the dishes to a cell incubator. Culture the transfected cells at 37°C, 5% CO2.\nDay 2: Aspirate the old medium and add 25 mL of fresh HEK293T medium to each transfected 150-mm dish. Culture the transfected cells until day 4 for AAV collection.",
    "Day 4: Collect the transfected cells using a cell scraper. Transfer medium and cells from two of the transfected 150-mm dishes to a 50 mL collection tube using a serological 25 mL pipette. Centrifuge at 2900 × g for 5 min at 4°C and discard the supernatant. Resuspend the cell pellet in 3 mL PBS and transfer to a 15 mL collection tube.\nCritical: The transfection efficiency of three plasmids should be regularly assessed with a pAAV-CMV-GFP-reporter genome plasmid as a standard.\nNote: To avoid bacterial contamination after transfection, we recommend adding Gentamicin to a final concentration of 10 μg/mL in HEK293T medium used on day 2.\nPause Point: The cell suspension can be frozen and stored at -80°C for later AAV purification.\nPrepare a dry ice/ethanol mixture in a foam box and heat up the water bath to 37°C.\nUse three freeze-thaw cycles (10 min in the dry ice/ethanol mixture, then move to 37°C water bath for 10 min) to lyse the cells and release the AAV particles. Vortex the cell suspension thoroughly after each freeze-thaw cycle.\nAfter the third freeze-thaw cycle, add Benzonase enzyme to a final concentration of 100 U/mL and incubate for 1 h at 37°C to degrade residual DNA plasmids in the cell lysate. Mix by inverting occasionally.\nAdd sodium deoxycholate (10% stock solution) to a final concentration of 0.5%. Add 5 M NaCl to a final concentration of 1 M. Incubate for 30 min at 37°C.\nCentrifuge at 2900 × g for 30 min at 4°C. Transfer the viral supernatant to a 15 mL collection tube.\nFilter the AAV supernatant through a 0.45 μm PES syringe filter.\nFinally, pool all the filtered AAV supernatants into a 50 mL collection tube (~15 mL in total).",
    "Critical: Ensure that the cell suspension is completely frozen and thawed after each step.\nPause Point: The AAV supernatant can be stored at 4°C for 15–18 h and the ultra-centrifugation performed the next day.\nAAV Purification\nTiming: 4 h\nPrepare iodixanol-containing gradient, ultra-centrifuge and extract AAV particles.\nPrepare two multi-layered, discontinuous density gradients per AAV donor vector by underlaying iodixanol solutions of different concentrations (15%, 25%, 40%, and 60% (see Materials and Equipment[href=https://www.wicell.org#materials-and-equipments])) in a 29.9 mL Beckman Opti-Seal ultra-centrifuge tube as depicted in Figure 1[href=https://www.wicell.org#fig1] (Cabanes-Creus et al., 2019[href=https://www.wicell.org#bib1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/74-Fig1.jpg\nFigure 1. Discontinuous, Multilayered Iodixanol Density Gradients for AAV Isolation\n15%, 20% 40% and 60% iodixanol solutions are underlaying in an ultra-centrifuge tube and should look as depicted in the photograph.\nFirst, add 6 mL of the 15% iodixanol solution to the bottom of the Beckman tube using a 10 mL syringe and a long 14-gauge metal needle.\nSubsequently, underlay 6 mL of the 25% iodixanol solution, by placing the syringe needle into the bottom of the Beckman tube and gently elute the solution. Do not puncture the bottom of the tube.\nContinue the same way with 5 mL of the 40% iodixanol solution and 5 mL of the 60% iodixanol solution, respectively.\nCritical: Air bubbles inside the syringe will reach the tube and disrupt the gradient. We recommend tapping the syringe, releasing the iodixanol solutions slowly and planning for enough dead volume.\nNote: ~15 mL of the AAV supernatant (step 12 above) can be split and loaded equally onto 2 gradient tubes. Fill up the Beckman tube with balancing buffer to the top of the tubes (Figure 2[href=https://www.wicell.org#fig2]C) and balance to within 0.01 g difference.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/74-Fig2.jpg\nFigure 2. Loading Cell Lysate onto Density Gradients for Ultra-centrifugation",
    "(A and B) (A) Cell lysate is loaded on the ultra-centrifuge tube by establishing a flow on the tube wall. Face the bevel up, hold it close to the tube wall and (B) slowly load the cell lysate along the tube wall.\n(C) Balance the tubes with balancing buffer and seal it with the black cap.\nPause Point: Gradients can be prepared in advance and stored at 4°C for 15–18 h.\nUse a 20-gauge needle to add the cell lysate to the iodixanol gradient tube by dripping slowly onto the top layer of the gradient (Figure 2[href=https://www.wicell.org#fig2]A). To avoid disrupting the gradient, establish a flow along the tube wall as depicted in Figure 2[href=https://www.wicell.org#fig2]B. Position the bevel of the needle upwards next to the cap of the tube.\nCentrifuge at 345,322 × g in a Beckman Type 70Ti rotor for 2 h 10 min at 18°C.\nCarefully carry the rotor to a sterile hood and remove the tubes with sterilized forceps.\nPrepare a 10 mL syringe with an 18-gauge needle for extracting the AAV-containing 40% iodixanol layer.\nCarefully clean the tubes with ethanol and a Kimwipe tissue before puncturing the Opti-Seal tube.\nNote: After ultra-centrifugation, different fractions of the cell lysate are separated in different iodixanol gradient layers. Proteins and cell debris accumulate in 25%-40% interface. The 40% iodixanol layer contains the AAV particles (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/74-Fig3.jpg\nFigure 3. Extraction of the AAV-Containing Layer from the Ultra-centrifuge Tube\n(A) Appearance of the different iodixanol gradient after ultracentrifugation.\n(B) Insertion of the needle (bevel face up) 1–2 mm above the 60% iodixanol layer.\n(C) The remaining volume of the layer is extracted with the bevel face down to prevent contamination with the protein-rich layer.\n(D) Endpoint of extraction (right) compared to before extraction (right).",
    "Carefully insert the needle with the bevel up approximately 1–2 mm above the 60% gradient layer to collect the 40% gradient layer containing AAV particles (Figure 3[href=https://www.wicell.org#fig3]B).\nRemove the black cap before extracting the AAV layer.\nGradually withdraw 3–5 mL of the AAV-containing layer. After collecting half of the layer, turn the needle with bevel down to collect the remaining layer (Figure 3[href=https://www.wicell.org#fig3]C).\nCritical: Be careful during handling and avoid disrupting the gradient layers. Do not collect the protein-rich interface white band at the interface of 25% and 40% layers. To avoid contamination with cell debris or proteins or iodixanol of the 60% iodixanol layer, the 40% AAV-containing layer should not be collected entirely (Figure 3[href=https://www.wicell.org#fig3]D).\nPause Point: The AAV fraction can be stored at 4°C for several days, if necessary. For longer storage, store the AAV fraction at -80°C.\nDialysis of AAV-Containing Iodixanol Solution and AAV Concentration\nTiming: 2 days\nDialyze the AAV solution to remove remaining iodixanol and concentrate AAV particles.\nNote: All centrifuge steps are carried out at 2,900 × g.\nPrime a 10 k MWCO dialysis cassette by placing the cassette into a container containing 2 L of dialysis/concentration buffer for 1 minute.\nPool AAV extractions from two gradient tubes (~10 mL in total) and filter the AAV solution through a 0.45 μm PES membrane filter directly into the primed MWCO dialysis cassette (step 22 above) as depicted in Figure 4[href=https://www.wicell.org#fig4]A. Before dialysis, the AAV supernatant has a light pink color (Figure 4[href=https://www.wicell.org#fig4]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/74-Fig4.jpg\nFigure 4. Dialysis of the Extracted AAV-Containing Iodixanol Layer\n(A) Injection of the extracted AAV solution from ultra-centrifuge tubes.\n(B) The loaded viral solution appears in a light pink color.",
    "(C) The loaded cassette is incubated for 18 h in cold dialysis buffer and magnetically stirred at 200–300 rpm to exchange iodixanol with dialysis buffer.\n(D) Extraction of the cleared AAV-containing solution from the cassette: Hold the cassette vertical to extract the remaining solution from the corner of the dialysis cassette.\n(E) The extracted solution is transferred to a new 50 mL falcon and should appear transparent.\nTransfer the AAV-loaded dialysis cassette to the dialysis container and dialyze at 4°C for 15–18 h with gentle magnetic stirring at 250–300 rpm (Figure 4[href=https://www.wicell.org#fig4] C).\nUse a 20 mL syringe with a 20-gauge needle to collect the AAV solution in the dialysis cassette and transfer it to a 50 mL collection tube (Figures 4[href=https://www.wicell.org#fig4]D and 4E). Now, the extract from the dialysis cassette should appear transparent (Figure 4[href=https://www.wicell.org#fig4]E).\nCritical: Be careful handling the dialysis cassette and avoid destroying the dialysis membrane.\nNote: If you observe debris in the dialyzed AAV solution, filter again through a 0.45 μm PES syringe filter before starting concentration steps. The maximum capacity of the dialysis cassette is 12 mL.\nPause Point: After filtration, the dialyzed AAV solution can be stored at 4°C for concentration on the next day.\nPrime a 100 K Amicon Ultra-4 centrifuge filter by adding 15 mL of dialysis/concentration buffer to the filter and centrifuge for 5–10 min. Discard the flow-through.\nLoad up to 15 mL of the dialyzed AAV supernatant to dialysis/concentration buffer-primed 100 K Amicon Ultra-4 centrifuge filter and centrifuge for 10–15 min. Discard the flow-through and load the remaining AAV supernatant onto the same Amicon Ultra-4 filter, fill up to 15 mL with dialysis/concentration buffer and centrifuge for 10–15 min. Discard the flow-through.",
    "Wash the AAV particles on the membrane of the Amicon Ultra-4 filter with 15 mL of dialysis/concentration buffer and centrifuge for 10–15 min. Discard the flow-through and repeat the washing step two more times.\nUse a 1000 μL pipette to collect the remaining AAV solution (~200–500 μL) in the concentrating filter. Pipette up and down several times and transfer the AAV solution to a 1.5 mL Eppendorf tube.\nAliquot the AAV solution in smaller volumes (50–100 μL) and store it at -80°C for long-term storage. Take a 5 μL AAV aliquot for titration using real-time PCR.\nNote: To collect remaining AAV particles, we recommend adding 500–1000 μL fresh dialysis/concentration buffer to the concentrating filter, pipette up and down and transfer the AAV solution to the AAV collection tube (step 29 above).\nPause Point: The 5 μL aliquoted AAV can be frozen at -80°C before performing real-time PCR.\nTitration of AAV Particles by Real-Time PCR with TaqMan Probes\nTiming: 3–4 h\nPrepare standard curve using AAV genome plasmid and titrate AAV particles by TaqMan real-time PCR.\nPrepare a standard curve using your plasmid stock and adjust it to 2 × 109 molecules/μL\nExample calculation:\nWe assume that the average molecular weight for a DNA base pair is 650 Da.\nPlasmid Size (pAAV-Lmnb1-T2A-mCherry): 7216 bp\nPlasmid Concentration: 1 μg/μL\nPlasmid Molecular Weight: 7216 bp × 650 Da/bp (g/mol) = 4.69 × 106 g/mol\nPlasmid (mol/μL): 1 (μg/μL) × 1 (g)/1 × 106 (μg) × 1/4.69 × 106 (g/mol) = 2.13 × 1 × 10−13 (mol/μL)\nPlasmid (molecules/μL): 2.13 × 1 × 10−13 mol/μL × (Avogadro constant) 6.022145 × 1 1023 (molecules/mol) = 1.28 × 1011 molecules/μL\nPrepare 100 μL of plasmid with 2 × 109 molecules/μL:\nDilution factor: 1.28 × 1011 (molecules/μL)/2 × 109 (molecules/μL) = 64.2X dilution",
    "Thus, dilute 1.56 μL plasmid stock with 98.4 μL water (100 μL/64.2=1.56 μL).\nPrepare a serial 10-fold-stock dilution for the plasmid: 2 × 108, 2 × 107, 2 × 10 6, 2 × 105, 2 × 104 molecules/μL to create a standard curve by real-time PCR.\nPrepare DNase I working solution by adding 550 μL of water to 1 stock vial of DNase I.\nPrepare a mixture as follows: 10 μL RDD buffer + 2.5 μL DNase I + 5 μL of AAV and fill up with water up to 100 μL total volume. Incubate at 37°C for 30 min. This will be a 1/20 dilution of the AAV.\nSerially dilute the AAV 5-fold with water for real-time PCR: 1/100, 1/500, 1/2500 and 1/12500.\nPrepare a TaqMan real-time PCR reaction as depicted in Table 1[href=https://www.wicell.org#tbl1].\ntable:files/protocols_protocol_74_13.csv\nRun the PCR reaction following Table 2[href=https://www.wicell.org#tbl2].\ntable:files/protocols_protocol_74_14.csv\nAAV titers are calculated as viral genome copies per μL as described in section QUANTIFICATION AND STATISTICAL ANALYSIS[href=https://www.wicell.org#quantification-and-statistical-analysis].\nCritical: The standard curve is essential for accurate calculation of AAV titer. Be careful preparing serial dilution of the AAV genome plasmid.\nNote: Treatment of the AAV stock with DNase I is necessary to degrade residual DNA plasmids in the AAV solution. Run your samples and standard at least in duplicates and include non-template controls (master mix without templates or water).\nIsolation and Culture of Mouse HSPCs\nTiming: 3–5 h\nIsolate, enrich Sca1+ cells from mouse bone marrow using MACS separation and culture isolated HSPCs in vitro.\nNote: All centrifuge steps are carried out at 400 × g for 7 min at 4°C.",
    "To isolate Sca1+ cells from mouse bone marrow (BM), dissect left and right femurs and tibias from 8–12 weeks old mice. Remove muscles and connective tissue and transfer femurs and tibias to a well of 6-well plate containing 3 mL of FACS buffer.\nUse a 1 mL syringe and a 25-gauge needle to flush out the BM from the end of femurs and tibias, repeat this step several times until the bones become white. Transfer the BM cell suspension to a 15 mL collection tube and wash the well one time with 5 mL of FACS buffer. Centrifuge the BM cell suspension.\nDiscard supernatant and resuspend the BM cell pellet with 2 mL of red blood cell lysis buffer. Pipette up and down 10 times.\nIncubate on ice for 5 min, subsequently add 10 mL of FACS buffer and centrifuge the BM cell suspension.\nDiscard supernatant, resuspend the BM cell pellet with 2 mL FACS buffer and mix well by pipetting up and down 10 times. Count total BM cell number using a hemocytometer before magnetic cell separation (MACS).\nNote: We routinely obtain ~4 × 107 total BM cells from 2 femurs and tibias per mouse. The following steps of MACS Sca1+ enrichment are described for a maximum 4 × 107 total BM cells; if working with larger cell number, scale up all reagents accordingly. Try to keep cells and solutions on ice.\nPause Point: the BM cell suspension can be kept on ice for 1–2 h before proceeding MACS enrichment.\nCentrifuge the BM cells and discard the supernatant.\nResuspend the BM cell pellet in 382 μL FACS buffer, add 10 μL Fc blocking antibody (α-mouse CD16/32) to the BM cell suspension, and incubate for 10 min on ice.",
    "Add 8 μL α-mouse Sca1-FITC antibody to the BM cell suspension and mix well by pipetting up and down 10 times. Incubate the Sca1-FITC-labeled BM cells for 10 min in the dark on ice.\nWash the Sca1-FITC-labeled BM cells one time by adding 10 mL of FACS buffer and centrifuge.\nDiscard supernatant, resuspend the Sca1-FITC-labeled BM cells in 320 μL FACS buffer and add 80 μL α-FITC MicroBeads to the cell suspension. Mix well by pipetting up and down several times and incubate for 15 min at 4°C in the refrigerator. Mix the cell suspension every 5 min during incubation by brief vortexing.\nWash cells by adding 10 mL of FACS buffer and centrifuge. Discard the supernatant and resuspend the BM cell pellet in 500 μL of FACS buffer.\nInsert a LS separation column with the column wings to the front into a MACS separator, insert a 50 μm sterile BD cup-type filcon on top of the LS column. Rinse the LS column by applying 3 mL of FACS buffer through the BD cup filcon to the LS column and let FACS buffer run through. Load 500 μL of the BM cell suspension through the BD cup filcon into the prepared LS column and then wash the BD cup filcon two times with 500 μL FACS buffer. Collect the total effluent (which corresponds to the unlabeled (Sca1−) cell fraction) into a 15 mL falcon tube and set aside for determining the purity of MACS separation later.\nRemove the BD cup filcon and wash the LS column 3 times by adding 3 mL FACS buffer each time once the LS column reservoir is empty.",
    "Remove the LS column from the MACS separator and place it on a 15 mL collection tube. Pipette 5 mL FACS buffer onto the LS column and immediately flush out the magnetically labeled cells (Sca1+) by firmly applying the plunger which is supplied with the column.\nCount the cells with a hemocytometer.\nDetermine the purity of Sca1 + cell fraction. Stain the BM cells before MACS as well as the Sca1− and Sca1+ cell fractions with α-mouse lineage antibody cocktail, c-Kit and Sca1 antibodies for 15 min at 4°C. Wash the stained cells with FACS buffer and analyze them using FACS analyzer and FlowJo software (Figures 5[href=https://www.wicell.org#fig5]A and 5B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/74-Fig5.jpg\nFigure 5. FACS Plots Showing Lin−Sca1+c-Kit+ (LSK) Cell Fractions after MACS Purification and 2 Days of Culture\nBone marrow cells were stained with α-mouse lineage cocktail, Sca1, and c-Kit antibodies.\n(A) The negative fraction of the LS column should be almost completely depleted of Sca1+ cells.\n(B) The positive fraction eluted from the LS or MS separation column is enriched in LSK cells and progenitor cells, which all express Sca1. The LSK population should comprise 6 to 8% of the Sca1+ cell fraction. Lymphoid progenitor cells require IL-7 to survive and will be depleted upon culturing with 50 ng/mL mTPO, mSCF, mFLT-3, and hIL-11.\n(C) Purified LSK cell fraction after 2 days of culture in HSPC medium.\nCentrifuge the Sca1+ cells and discard the supernatant. Resuspend the Sca1+ cell pellet in serum-free HPSC medium (StemSpanTM SFEM II medium supplemented with mouse SCF (50 ng/mL), mouse TPO (50 ng/mL), mouse Flt3-L (50 ng/mL) and human IL-11 (50 ng/mL)) at a density of 2 × 105 cells/mL. Culture 4 × 105 Sca1+ cells in a well of 6-well plate in total volume of 2 mL.",
    "The next morning, passage the Sca1+ cells by transferring a half of the volume (1 mL) to a well of 6-well plate and add 1 mL HSPC medium to reach 2 mL per well.\nDetermination of the proliferation rates of cultured HSPCs (optional)\nWash 1 × 106 Sca1+ cells (step 53 above) two more times by adding 10 mL of PBS and centrifuge. Resuspend the cell pellet in 1 mL of PBS, add CellTrace violet to a final concentration of 5 μM and pipette up and down 10 times. Label these cells at 37°C for 15 min in the dark.\nWash the labeled cells by adding 10 mL of serum-free StemSpanTM SFEM II medium and centrifuge.\nFollow steps 55 to 56 above for culturing and passaging mouse HSPCs in HSPC medium.\nAfter 48 h of CellTrace labeling, the proliferative activity of the cultured HSPCs is determined by flow cytometry.\nCritical: It is important to maintain mouse HSPCs at low density (≤ 2 × 105/mL) to obtain high HR efficiency and high survival rates.\nNote: In order to increase the efficiency of Sca1+ MACS enrichment, we recommend repeating the magnetic separation procedure from steps 49 to 52 with a new column. Depending on cell yield, the eluted fraction from step 52 should be further enriched over a MS (smaller capacity) or a LS column (larger capacity).\nPause Point: After passaging, the cultured HSPCs are placed back into cell incubator for further 24 h.\nCRISPR/Cas9/AAV-Mediated HR in Mouse HSPCs\nTiming: 2–3 h\nInsert the coding sequences of the self-cleavage peptide T2A coupled to the fluorescent marker mCherry (T2A-mCherry) in-frame into the last exon of the mouse Lamin B1 (Lmnb1) gene in mouse HSPCs.\nNote: All centrifuge steps are carried out at 400 × g for 5 min at 22°C–24°C.",
    "Collect the activated HSPCs by pipetting up and down 10 times and transfer to a 15 mL collection tube after 48 h of culture. Determine the cell concentration using a hemocytometer and centrifuge the activated HSPCs. Discard the supernatant and wash the activated HSPCs one time with 22°C–24°C PBS by resuspending in 10 mL PBS and centrifuge. Remove the supernatant and resuspend the cell pellet in Amaxa electroporation buffer at a density of 2–3 × 105 HSPCs per 20 μL. Follow step 59 for HSPCs isolated from Cas9 transgenic mice or step 60 for isolated from C57BL/6 mice.\nGene editing in Cas9 transgenic-derived HSPCs: due to constitutive Cas9 expression, only the delivery of sgRNA is required for gene targeting.\nTransfer 20 μL cell suspension in Amaxa electroporation buffer (total 2–3 × 105 cells) in step 1 to a 1.5 mL Eppendorf tube.\nAdd 100 pmol sgRNA to the cell solution. Mix well by pipetting up and down 10 times and continue with step 61 below.\nGene editing in C57BL/6-derived HSPCs: sgRNA/Cas9 ribonucleoprotein (RNP) complexes are required for gene editing.\nPer reaction/electroporation, mix 50 pmol wild-type SpCas9 protein (from IDT or produced in-house) with 100 pmol sgRNA (Synthego or IDT), and incubate 10 min at 22°C–24°C.\nTransfer 20 μL cell suspension in Amaxa electroporation buffer (total 2–3 × 105 cells) in step 1 to a 1.5 mL Eppendorf tube.\nAdd CRISPR/Cas9 RNP complexes to the cell suspension. Mix well by pipetting up and down 10 times and continue with step 61 below.\nTransfer 20 μL electroporation mixture to a well of a 16-well Nucleocuvette strip.\nElectroporate the cassette in the Amaxa™ 4D-Nucleofector™ with the “mouse B cell program” provided by the manufacturer.",
    "Add 80 μL of pre-warmed HSPC medium to the well of the electroporation cassette to collect electroporated HSPCs. Transfer the electroporated HPSCs to a well of a 12-well plate containing 1 mL pre-warmed HSPC medium.\nTransfer 104 electroporated HSPCs to a well of a 48-well plate containing 500 μL HSPC medium. 30 min later, infect the electroporated HSPCs with AAV-DJ carrying the donor template at a MOI of 5 × 106 genome copies per cell. Place AAV-infected HSPCs back into the incubator.\nTwo days post editing, collect the targeted HSPCs by pipetting up and down, pool together into a 15 mL collection tube and count cell number with a hemocytometer. 20% of total targeted HSPCs are saved for analyzing HR efficiency by flow cytometry (continue step 66 below) or PCR amplification and sequencing (continue step 67 below). The remaining cells can be used for transplantation to assess engraftment efficiency of the targeted HSPCs in vivo.\nCritical: To minimize cell death due to electroporation, do not use expired electroporation buffer. The AAV volume should not exceed 20% of the total volume.\nNote: Depending on the experimental set up, the number of the electroporated HSPCs infected with AAV donor vectors can be scaled up accordingly.\nNote: After 48 h of culture in HSPC medium, mouse HSPCs should have increased in size and formed cell clusters indicating proliferation. During establishing gene knockin experiments in mouse HSPCs, try to use different AAV MOI numbers in order to optimize HR efficiency. Include the following controls for testing HR efficiency: 1) only electroporated, 2) only infected with AAV-DJ, and 3) only sgRNA-electroporated cells without AAV-DJ.",
    "Pause Point: For quantification of HR and NHEJ events by PCR amplification and sequencing, 20% of the total targeted HSPCs are collected by centrifuging and the cell pellet can be stored at -20°C for several days before extracting genomic DNA.\nEvaluation of HR Efficiency\nTiming: 2–48 h\nDetermine HR efficiency by flow cytometry (mCherry+ cells) or quantify of HR and NHEJ events in the targeted Lmnb1 locus by PCR amplification and sequencing.\nNote: All centrifuge steps are carried out at 400 × g for 5 min at 4°C.\nDetermination of HR efficiency by flow cytometry:\n20% of the total targeted HSPCs (step 65 above) are transferred to a FACS tube and centrifuged.\nDiscard the supernatant, wash the targeted HSPCs with 1 mL PBS and centrifuge. Discard the supernatant, resuspend the HSPCs in 100 μL FACS buffer containing Fc blocking antibody (α-mouse CD16/32, diluted 1:250) and incubate at 4°C–8°C for 10 min.\nAdd the stem cell antibody staining cocktail (α-mouse lineage-cocktail, c-Kit, Sca1, CD48 and CD150) to the FACS tube and incubate at 4°C–8°C for 15 min.\nAdd 1 mL FACS buffer to the FACS tube and centrifuge. Discard the supernatant and wash the cells by adding 1 mL FACS buffer to the FACS tube. Centrifuge the cells and discard the supernatant. Finally, resuspend the stained HSPCs in 200–300 μL FACS buffer containing 1 μg/mL DAPI for flow cytometric analysis.\nThe stained HSPCs are analyzed in a BD Fortessa analyzer with the flow rate setting in slow mode.\nExport and analyze the raw data using FlowJo software. Frequencies of mCherry + cells are determined in all cell fractions (Lineage (Lin)− Sca1+c-Kit+ (LSK), HSC/multipotent progenitor (MPP)1, MPP2, MPP3/4).\nQuantification of HR and NHEJ events by PCR amplification and sequencing:",
    "20% of the total targeted HSPCs (step 65 above) are transferred to a 1.5 mL Eppendorf tube and centrifuged.\nDiscard the supernatant and wash the cells by adding 1 mL PBS to the collection tube. Centrifuge the cells and discard the supernatant. Resuspend the cell pellet in QuickExtractTM DNA Extraction Solution at a density of 104 cells/10 μL.\nMix well and briefly vortex to completely lyse cells. Transfer a maximum of 100 μL lysed cells into a PCR tube.\nDenature genomic DNA by following thermal cycle: 65°C for 15 min, 68°C for 15 min, 95°C for 15 min and 4°C using a PCR machine. The denatured genomic DNA is ready for PCR amplification.\nPerform PCR amplification using primer sets binding outside of the HAs (see step 3 in section Before You Begin[href=https://www.wicell.org#before-you-begin]) and LongAmp PCR master mix or alternative DNA polymerases (KOD hot start DNA polymerase) for long-range PCR.\nRun PCR products on 1%–2% agarose gel and take a photograph. HR bands are larger than the NHEJ or wild-type (WT) bands which have similar size.\nBand quantification can be performed using the free ImageJ software (Schneider et al., 2012[href=https://www.wicell.org#bib6]). HR efficiency is estimated on the basis of band intensity.\nHR and NHEJ/WT bands are extracted from the gel and cloned into pJET plasmids using the CloneJET PCR cloning kit. PCR colonies are sequenced by Sanger sequencing. Basing on the nucleotide sequences of the targeted loci, the relative frequencies of HR, NHEJ and WT events are determined."
  ],
  "subjectAreas": [
    "Stem Cells",
    "Crispr"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}