{
  "id": 10064,
  "origin_website": "Jove",
  "title": "Subretinal Implantation of RPE on a Carrier in Minipigs: Guidelines for Preoperative Preparations, Surgical Techniques, and Postoperative Care",
  "procedures": [
    "This study adheres to the tenets of the Guidelines of the Declaration of Helsinki and ethical principles for medical research involving human subjects. All experiments were carried out according to the Guidelines for the Care and Use of Laboratory Animals and according to the Association for Research in Vision and Ophthalmology (ARVO) for the use of animals in ophthalmic and visual research. The study protocol was approved by the Resort Professional Commission of the CAS for Approval of Projects of Experiments on Animals at the Institute of Animal Physiology and Genetics of the Czech Academy of Sciences (Liběchov, Czech Republic) (Approved protocol No. 60/2016 and No. 64/2019).\n1. Considerations during the subretinal transplantation of cells on a carrier into minipigs\nAnimal selection\n\t\nObtain and use Liběchov minipigs that are 12-36 months old, either sex, and around 40-80 kg of body weight (BW).\nKeep the minipigs indoors in an air-conditioned animal house with temperatures between 18-22 °C, exposure to an artificial 13 h/11 h light/dark cycle, standardized individual pens, free access to water, and twice daily feeding.\nPreparation prior to the surgery\n\t\nCheck for the surgical orientation of the eye and draw the fundus schemes. To do so, schematically divide the retina of the minipigs on the fundus drawing using a pen with a vertical line into the temporal (from the optic disc toward the ear), nasal (from the optic disc toward the pig's snout), and central (between the major retinal vessels on the nasal side) regions (Figure 1A, B).\nSelect only healthy animals without any behavioral and neurological pathology and with normal quality of the skin, body orifices, feces, and food consumption. Have a skilled veterinarian perform the clinical observation and select the animals.\nInject intramuscularly 3 mg/kg BW of ceftiofur hydrochloride (1 mL/kg) on the day of surgery.",
    "Preoperative immunosuppression\n\t\nPrepare tacrolimus-eluting polymer microspheres as described in Wang et al. and Sevc et al. 32,33 with modification.\nEnsure that the concentration of tacrolimus in the polymer microspheres is 51.3 mg/g as determined by HPLC (Table of Materials).\nPerform a subcutaneous injection of tacrolimus-loaded polymer microspheres at a dose of 0.25 mg/kg BW 6 days before the eye surgery to impede cell graft rejection. This is done to ensure the survival of the human RPE donor cells during xenogeneic transplantation into the minipig eyes.\nInject the animals intramuscularly on the day of the surgery with 80 mg of depo-medrol and benzylpenicillin at 1 mL/10 kg according to the body weight.\nAnesthesia\n\t\nInduce general anesthesia with an intramuscular injection of a mixture of tiletamine (2 mg/kg), zolazepam (2 mg/kg), ketamine (2 mg/kg), and xylazine (0.4 mg/kg)-TKX34,35 prior to the surgery. Check the depth of anesthesia by a state of unconsciousness and by checking the pedal reflex (a pinch of the interdigital skin of the hind leg), the corneal reflex (a slight touch of the cornea), the pupillary reflex (reaction to the light), and the palpebral reflex (a touch to the eyelid). Ensure that the animal does not blink. Confirm the heart and respiration rate regularity.\nAfter the induction of anesthesia, transport the sedated animal to the operating room on a lift trolley (Figure 2A).\nPlace the animal on the operating table on its left side to enable surgery on the right eye (Figure 2B).\nPerform the adjustment of the animal's head using styrofoam pads to achieve the most suitable position of the central retina for implantation (i.e., horizontal and parallel to the floor) (Figure 2C).\nPlace eyedrops of 0.5% proparacaine hydrochloride ophthalmic solution into the conjunctival sac three times 1 min apart to induce local anesthesia.",
    "Insert a vein cannula and intubate the animal with an endotracheal tube for the inhalation maintenance of anesthesia (1.5% isoflurane) using an anesthesia machine equipped with a patient monitor (Figure 2A, B).\nAdminister an intramuscular injection of 1 mL of Eficur per 16 kg BW and 20 mg of Depo-Medrol 1 approximately 15 min before the beginning of the eye surgery (Table of Materials).\nMaintain the physiological body temperature by covering the animal with isothermal foil and perform the surgery as described in section 3.\nDuring the surgery, monitor the animal's temperature along with the heart rate and blood oxygen saturation using an ear clip and patient monitor. Avoid the lowering of the body temperature below 38 °C during the procedures, which is considered a safe limit36. Maintain the oxygen saturation (>96%) and pulse rate (70-90 beats per minute) during the whole experiment.\nWhen the surgery is complete, turn off the flow of isoflurane and extubate the animal.\nAfter spontaneous breathing and awakening, transfer the animals to their pens.\nOperating room setup\n\t\nArrange the operating room according to the needs of the surgery on the eyes of the large-eye animal model (Figure 3A, B). Adjust the height of the surgeon's chairs, as well as the height of the microscope, to achieve a comfortable position for the surgeons with regard to the position of the pig's snout.\nimgsrc://cloudfront.jove.com/files/ftp_upload/63505/63505fig01.jpg",
    "Figure 1: Schematic drawing of the retinal zones in minipigs. (A) Schematic drawing of the retinal zones in relation to the minipig's head; the yellow ellipse depicts the desired area of subretinal implantation, T refers to the temporal retinal area, and N refers to the nasal retinal area. (B) Example of the fundus scheme after subretinal implantation of the cell carrier (yellow) through retinotomy (red). Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63505/63505fig01large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/63505/63505fig02.jpg\nFigure 2: Transportation and placement of the animal. (A) Transportation of the sedated animal to the operating room. (B) Placement of the animal during intubation. (C) Adjustment of the head of the animal for optimal access to the central retina during the surgery (red arrow). Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63505/63505fig02large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/63505/63505fig03.jpg\nFigure 3: The standard operating room setup. (A) Schematic depiction of the surgeons' position (S = surgeon, A = assistant) in relation to the position of the operating table with the minipig, the operating microscope (OM), the vitrectomy machine (VM), the instrumental table (IT), and the anesthesiology machine (AM). There are two possible positions of the vitrectomy machine (yellow and gray). (B) Real-life setting in the operating room. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63505/63505fig03large.jpg]\n2. Cell carrier, cultivated cells cultures, and implantation injector\nCell carrier\n\t\nCut the 30 µm wide oval frame with outer dimensions of 1.7 mm x 4.8 mm, equipped with triangular protrusions asymmetrically located on the frame (Figure 4A), from a bi-axially oriented 36 µm thick poly-ethylene-terephthalate (PET) foil using a femtosecond laser.\nPrepare poly(L-lactide-co-DL-lactide) (LLA/DLLA 90/10, MW 868, 270 g/mol) polymer solution in pyridine at a concentration of 11 wt% with the addition of 2.2 µL of formic acid per 1 g of solution.",
    "Prepare the nanofibrous membrane with an embedded supporting frame (Figure 4B) by the electrospinning of the polymer solution in three steps8: (1) deposit the first layer of nanofibers on a silicon substrate, (2) place the frame on the layer, and (3) deposit the second layer of nanofibers.\n\t\tNOTE: Deposit every layer for 7 min to reach a total membrane thickness of 3.7 µm. Use the following parameters to obtain a membrane composed of 380 nm thick fibers and with an average pore size of 0.4 µm and a porosity of about 70%37: a 20 G all steel needle, a voltage of 7.1 kV, a gap of 10 cm, a flow rate of 250 µL/min, and a temperature of 25.0 °C ± 0.5 °C.\nCarefully remove the membrane with the embedded frame from the silicon substrate and fix it to the body of a commercial 12 well cell culture insert devoid of the original membrane to facilitate the seeding and growth of cells.\nTreat the nanofibrous membrane before cell seeding in air-plasma for 30 s at a power of 70 W in a plasma cleaner.\nCell cultures used for cultivation on the cell carrier\n\tNOTE: The following cell carriers could be used: 1) nanofibrous cell carriers without any cells; 2) nanofibrous cell carriers with primary human RPEs (hRPEs); 3) nanofibrous cell carriers with human iPSC-derived RPE cells.\n\t\nCulturing primary hRPEs\nIsolate primary hRPE cells from human donor eyes according to a previously reported technique38.\nObtain the cells by enzymatic treatment of the retina for 30 min. Then, cultivate the primary hRPE cells (passage 0) for up to 2 weeks in DMEM/F12 supplemented with 10% fetal bovine serum (FBS).\nOnce the cell cultures reach confluency, change the medium to 1% FBS and culture for an additional 30 days.",
    "Seed the primary hRPEs onto trans-well plates and onto a laminin coated nanofibrous cell carrier at a density of ﻿ 2,000 cells/mm2. Following a further 30 days of incubation in 1% FBS, use the cell carriers with primary hRPEs for subretinal implantation into minipigs.\nHuman iPSC-derived RPEs\n\t\nUse hiPSCs derived from MERTK associated retinitis pigmentosa patient-derived fibroblasts39 that are gene-corrected in two alleles using the CRISPR/Cas9 system (RP1-FiPS4F1-GC2)40, as well as hiPSCs derived from the fibroblasts of a healthy subject (Ctrl2-FiPS5F2)41 that are used as a control.\nGenerate and subsequently differentiate both hiPSCs cell lines toward RPE cells (hiPSC-RPE) as reported previously42.\nPlate the hiPSC-RPEs at 200,000 cells/cm2 on laminin-coated cell culture inserts with nanofibrous membranes of poly(L-lactide-co-DL-lactide) with oval implantation frames in RPE medium containing knockout DMEM, 20% knockout serum, 0.1 mM non-essential amino acids, 0.23 mM β-mercaptoethanol, 100 U/mL penicillin, 0.1 mg/mL streptomycin, and 10 mM nicotinamide.\nChange the medium every other day, and culture the hiPSC-RPE for 2 months prior to implantation to encourage polarized growth.\nImplantation injector\n\t\nPrepare a plastic capillary with a rectangular cross-section of 2.8 mm x 0.8 mm by blow molding from a plastic tube of OD 1.75 mm/ID 1.10 mm.\nCut a loading window of 4 mm x 2.2 mm in the plastic capillary 6 mm from the end.\nAssemble the injector from the plastic capillary, a silicone handle, a steel blade plunger, and a piston (Figure 5A).\nLoad the carrier into the injector through a loading window and later eject it into the subretinal space by a push of the plunger, as described in step 3.5.2 (Figure 5B).\nPreparation of the nanofibrous carrier and loading of the injector",
    "Fill a small plastic Petri dish with 2 mL of phosphate-buffered saline (PBS). Take out an insert with the prepared cell layer, place it on a semi-soft polystyrene dish, and center it under a light microscope. Use a custom-modified punch to cut out the carrier along the oval frame using a microscope. The carrier dimensions should be 2 mm x 5 mm.\nUse a custom-made injector with flat transparent tubing for loading the carrier; 6 mm from the distal end of the capillary, there is a window for loading the carrier. Fill the injector's window with PBS.\nUsing the forceps, release the sample from the bottom of the dish, lift it from the liquid, and transport it to the window of the injector while checking the side orientation marks on the frame first in order to detect the top side of the carrier with adherent cells. An oval frame facilitates manipulation with the carrier.\nUsing a dental probe (a stainless steel dental instrument with a sharp ending), position the carrier in the window of the injector. Use the plunger to push the carrier into the closed and safe upper part of the injector. Then, prepare the carrier for surgery.\nCheck the side orientation of the carrier at each step. Unload the nanofibrous carrier from the injector by pushing the metal plunger.\nimgsrc://cloudfront.jove.com/files/ftp_upload/63505/63505fig04.jpg\nFigure 4: Nanofibrous carrier with an embedded supporting PET frame. (A) Three visible marks on the frame allow control of the side orientation of the carrier (white arrows). (B) Enlargement view of the PET frame fragment embedded in the nanofibrous membrane (white arrows) of the cell carrier. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63505/63505fig04large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/63505/63505fig05.jpg",
    "Figure 5: Implantation injector. (A) Parts of the injector. (B) Nanofibrous cell carrier with embedded supporting PET frame loaded to the plastic rectangular capillary of the implantation injector. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63505/63505fig05large.jpg]\n3. Surgical procedure\nSurgical equipment\n\t\nUse the following surgical equipment: an ophthalmic surgical microscope, an operating system for surgeries on the anterior and posterior eye segments, a non-contact vitreoretinal surgical system, a laser photocoagulation device, and a digital camera.\n\t\tNOTE: The standard parameters used in vitrectomy, exo- and endo-cautery, and laser photocoagulation equipment are depicted in Table 1.\nSurgical instruments\n\t\nSterilize the reusable surgical instruments with a mobile autoclave steam sterilizer or similar according to a standard protocol. The single-use surgical instruments and materials required during the surgery are listed in the Table of Materials.\nPreparation for the surgical steps\n\t\nAfter anesthetizing the animal as described in step 1.4.1, apply 1% tropicamide solution eye drops and 10% phenylephrine hydrochloride solution in the conjunctival sac 15 min before the procedure to provoke drug-induced mydriasis.\nApproach the operating table with the surgeon in the upper position and the assistant in the side position (Figure 3).\nShave the area around the eye using a single-use shaving razor and remove the rough dirt.\nDisinfect the conjunctival sac with 5% povidone-iodine solution for 5 min.\nDisinfect the periorbital area with cotton swabs by scrubbing from the eyelids to the periphery. Repeat the process three times using a 10% povidone-iodine solution and leave on for 5 min.\nCover the operating field with the eye in the middle using a standard sterile ophthalmic drape with sticky transparent foil. Move the eyelashes away from the eye globe. Avoid cutting the eyelashes to reduce the risk of postoperative endophthalmitis.",
    "Insert the lid speculum (Liberman-type or Cook eye speculum). Optionally, fix the nictitating membrane to the skin with 8-0 polyglactin suture.\nOpen the conjunctiva on the nasal side 2 mm to 3 mm from the limbus in order to expose the sclera for the sclerotomies using surgical forceps and Westcott conjunctival scissors.\nInsert the three-valved 25 G trocars 2.5-3 mm from the limbus in the area of the pars plana (place them at 7 o'clock, 10 o'clock, and 11 o'clock). Use rotating movements during the insertion in a slightly oblique manner (100°-110°) toward the posterior retina and hold the trocar with the forceps (Figure 6).\nKeep the cornea wet or coat it with methylcellulose during the whole surgery to prevent osmotic corneal edema.\nPars plana vitrectomy (PPV)\n\t\nRemove the middle portion of the vitreous body with the standard three-port pars plana vitrectomy approach. Carefully remove the vitreous behind the lens in the area of the future large sclerotomy.\nUse an intravitreal 2-4 mg of triamcinolone acetonide (TA) injection (50-100 µL) to stain the posterior vitreous, which usually remains adherent to the retina, in order to perform a controlled posterior vitreous detachment.\nAfter that, slowly perform a subretinal injection of 0.05-0.1 mL of BSS with a 41 G cannula more centrally, avoiding the formation of a bleb toward the periphery.\nReduce the intraocular pressure settings with the irrigation system down to 15 mmHg during the subretinal injection in order to prevent a transient retinal vascular occlusion.\nPerform a linear large endodiathermy of the retina with a 27 G endodiathermy probe 3 mm near the nasal bleb base.",
    "Afterward, make a 3 mm large retinotomy with a 25 G MVR blade or vertical scissors with an elevated intraocular pressure (IOP) setting of the irrigation system up to 60 mmHg for 3 min to 5 min. Ensure that there is no bleeding from the retinotomy, and then reduce the IOP to 25 mmHg.\nCarry out an exodiathermy of the episcleral vessels between the two nasal trocars 2.5-3 mm from the limbus with a 27 G endodiathermy probe by applying a gentle touch onto the surface of the sclera.\nCheck the fluid level of the infusion bottle before enlarging the sclerotomy, as after sclerotomy enlargement, fluid consumption is temporarily high.\nMake a 3.0 mm large sclerotomy, 3 mm from the limbus, using a 2.75 mm phaco knife.\nPay attention to possible bleeding from the scleral vessels and ciliary body inside the large sclerotomy. In the case of bleeding, use a 27 G endodiathermy probe to coagulate the damaged vessels. Enlarge the sclerotomy to 3.0 mm with a satin knife to accommodate the tip of the injector (0.8 mm x 2.8 mm).\nRemove the prolapsed vitreous body on the site of the large sclerotomy with a vitrector. Maintain the infusion of BSS at the level of 25-30 mmHg with the vitrectomy system to avoid globe collapse.\nImplantation of the cell carrier\n\t\nGently insert the injector with the dominant hand into the vitreous cavity through the large sclerotomy. In case of resistance, enlarge the size of the sclerotomy.\nImplant the cell carrier through the retinotomy into the subretinal space. If necessary, use a bimanual technique with additional sclerotomy and chandelier light in order to improve the control of the implantation.",
    "Withdraw the injector from the eye and close the large sclerotomy with an 8-0 polyglactin suture to avoid complications associated with intraocular hypotony.\nPerform a complete fluid-air exchange (FAX) and drainage of the subretinal fluid with a silicone-tipped cannula.\nAfter that, inject silicone oil (1,000 cSt) into the vitreous cavity using the vitrectomy system and tubing system for silicone oil injection until the IOP is normal.\nIntraoperative imaging and documentation\n\t\nPerform a video recording during the entire surgery with photo documentation of the key steps of implantation using a video recording system.\nComplete the fundus drawing by documenting the location of the sclerotomies, retinotomy, subretinal implant, and any complications that occurred using fundus drawing schemas.\nPost-surgery steps\n\t\nAt the end of the surgery, remove the trocars and close the three sclerotomies and the conjunctiva with 8-0 polyglactin sutures.\nRinse the conjunctival sac with 5% povidone-iodine solution.\nPerform a 0.3 mL subconjunctival injection of 20 mg of gentamicin, 2 mg of dexamethasone, and 2% xylocaine.\nCheck the condition of the fundus and lens using a microscopic view.\nRemove the suture(s) from the nictitating membrane using surgical forceps and Westcott conjunctival scissors (optional).\nApply neomycin ointment or ofloxacin ophthalmic ointment into the conjunctival sac.\nimgsrc://cloudfront.jove.com/files/ftp_upload/63505/63505fig06.jpg",
    "Figure 6: Insertion of the trocars in the eye of a minipig. (A) Schematic depiction of the trocars, which are inserted perpendicularly into the sclera toward the center of the vitreous cavity in the human eye (gray color) and in an oblique manner toward the posterior retina in the minipig eye (blue color) to avoid damage to the lens. The lens of the minipig (blue colored) is larger than that in humans and relative to the vitreous cavity size. (B) Intraoperative view of the inserted trocars in a three-port PPV. The cornea is covered with methylcellulose to prevent drying and swelling. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63505/63505fig06large.jpg]\n4. Postoperative care\nApply topical bacitracin zinc/hydrocortisone acetate/neomycin sulfate or 0.3% ofloxacin into the conjunctival sac of the animals five times per day.\nPostoperatively, check the following eye parameters: turgor of the soft tissues of the eye using palpation, inflammatory reaction on the eye surface, and squinting as a protective reaction of the eyelids using a hand-held slit lamp or indirect ophthalmoscope.\nFor systemic postoperative care, use the following antibiotics:\n\t\nInject intramuscularly ceftiofur hydrochloride at the dose of 3 mg/kg BW (1 mL/kg) on the second and third day of stability.\nInject tulathromycin (1 mL/40 kg BW) after 72 h post-surgery for the prevention of secondary bacterial infection.\nPerform an intramuscular injection of flunixin (2 mL/45 kg of live weight) and tramadol hydrochloride (100 mg) every 24 h for 3 days after surgery to prevent pain.\nKeep the minipigs in a specialized air-conditioned facility with a temperature range of 18-22 °C and an artificial 13 h/11 h light/dark regime.\nEnsure they have free access to water and standard feeding (twice per day).\n5. Postoperative procedures\nPostoperative ophthalmic examinations",
    "In the postoperative period, inspect the eyes with an indirect ophthalmoscope for the presence of inflammation (i.e., redness, tissue swelling, or mucus congestion in the conjunctival sac). Measure the intraocular pressure in the operated eye using the palpation method.\nPostoperative imaging\n\t\nInduce sedation in the minipig by the intramuscular injection of a TKX mixture before fundus photography and OCT examination. Instill 1% tropicamide and 10% phenylephrine hydrochloride eye drops into the conjunctival sac of the minipig in order to induce mydriasis.\nEmploy a lid speculum to maintain open eyes. For moisturizing the eye surface and for obtaining a clear OCT image, wash the cornea of the animal with saline solution (0.9% NaCl) every 30-60 s.\nPosition the minipig on the operating table in the same manner as during the operation (Figure 2B,C, Figure 3A). The main requirement is to place the head on the side and perpendicular to the scanning piece of the OCT device. Use styrofoam pads under the animal's snout to stabilize the head, bringing the eye surface into a horizontal position.\nCollect color fundus images with a color non-mydriatic fundus camera, as this allows for documenting the anterior segment, retina, and optic disc. Additionally, take a red-free image of the retina with the non-mydriatic fundus camera.\nPerform optical coherence tomography imaging using the spectral-domain OCT system. During the OCT or fundus imaging, tilt the minipig's head manually toward the OCT lenses or fundus camera lenses to optimize the view of the posterior retina and the area of implantation (Figure 2C). For optimal imaging of the implanted carrier on the fundus, apply the infrared reflectance light of the OCT device to focus on the implant (Figure 2C). Use the OCT crossline and retina map scanning modes.",
    "Apply ofloxacin ophthalmic ointment at the end of the examination under the lid of the animal's eye.\nMove the minipig to the indoor facility and observe for its general condition until the end of sedation (approximately 2 h to 5 h).\n6. Enucleation of the eye post mortem after euthanasia\nSedate the minipigs with an intramuscular injection of the TKX mixture followed by an intravenous (through a 22-G ear cannula) bolus application of 1% propofol (20 mL/animal) followed by exsanguination. Do not use general fixatives.\nSacrifice the animals by exsanguination during deep general anesthesia 7 days, 14 days, 28 days, and 42 days after cell graft implantation.\nUse forceps and scissors to remove the upper and lower eye lids. Rremove the third eye lid and cut through the conjunctiva. Cut the eye muscles and the optic nerve.\nEnucleate the eyes post mortem using surgical scissors and surgical forceps. Ensure that the procedure is performed by an experienced person."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}