{
  "id": 9225,
  "origin_website": "Jove",
  "title": "Environmental Modulations of the Number of Midbrain Dopamine Neurons in Adult Mice",
  "procedures": [
    "NOTE: All experimental procedures on animals were approved by the Florey Institute of Neuroscience & Mental Health Animal Ethics Committee and conform to Australia’s National Health and Medical Research Council published code of practice for the care and use of animals for scientific purposes (7th edition, 2004).\n1. Environmental Manipulations\nGender Pairing\n\t\nUse sexually mature (>8 week old), age-matched male and female mice.\n\t\tNOTE: We typically use C57BL/6 mice, but have had the same outcomes using Swiss mice in this protocol. We typically use n = 8 males and n = 8 females for each experiment, divided into n = 2 male-male pairs (n = 4 males), n = 2 female-female pairs (n = 4 females), and n = 4 male-female pairs (n = 4 males and n = 4 females).\nUpon arrival into the animal holding facility, group-house the mice by gender for >3 days to acclimatize. Here and throughout the gender pairing, keep extraneous environmental stimuli (e.g. ambient temperature, light:dark cycle, food, water, handling and cleaning) constant or distribute equally to all mice.\nRandomly assign each mouse to a male-male pair, a female-female pair, or a male-female pair. Place each pair into a clean cage in isolation (2 mice/cage) with ad libitum access to food and water, and simply house them in this way continuously for 7 days.\n\t\tNOTE: Routine animal husbandry is OK during this period but must be distributed equally to all mice. Take care to avoid pairing of male and female littermates.\nEnvironmental Enrichment\n\t\nUse sexually mature (>8 week old), age-matched male or female mice.\n\t\tNOTE: We typically use n = 18 mice for each experiment, divided into n = 6/treatment group.",
    "Upon arrival into the animal holding facility keep them group-housed in identical standard housed (SH) (e.g. see below) conditions at this stage for >3 days to acclimatize. Here and throughout the experiment, keep extraneous environmental stimuli (e.g. ambient temperature, light:dark cycle, food, water, handling and cleaning) constant or distribute equally to all mice.\nTo begin environmental enrichment, randomly assign each mouse to one of 3 groups: SH; running wheel (RW), or environment enriched (EE) and place each group of mice together into an identical clean cage with ad libitum access to food and water.\n\t\tNOTE: Here, larger rat-holding cages for all groups, measuring 27 cm wide, 42 cm long, and 16 cm deep were used.\n\t\t\nIn addition, provide the following environmental conditions to each group: SH comprising only litter (paper pellets or sawdust) on the floor; RW comprising SH plus 2 running wheels; EE comprising RW plus toys (ropes, ladders, tunnels, and objects such as empty paper towel rolls and pieces of tissue paper) with which to explore, play, climb, hide, and nest.\nHouse them in this way continuously for 14 days.\n\t\t\tNOTE: Routine animal husbandry is OK during this period but must be distributed equally to all mice.\nSubject EE mice to additional ‘super-enrichment’ (SE) by placing them together into a larger cage containing novel toys for 1hour/day (same hour each day), 5days/week.\n\t\tNOTE: Here, a 46 cm wide, 69 cm long, and 40 cm deep plastic tub was used.\n\t\t\nMaintain novelty by presenting a different set of toys each session. Clean toys that are to be re-presented to mice with soapy water and 80% ethanol to remove scents.",
    "Following each SE session, return the mice to their EE cage. Handle SH and RW mice the same as SE mice (except for SE itself) throughout this period (e.g. remove and return each SH and RW mouse from and to its cage).\n2. Osmotic Pump and Brain Infusion Cannula Implants for Drug Infusion\nPreparation\n\t\nUse sterile osmotic pumps and brain infusion kits, which are available commercially. The day before implantation, using aseptic technique, prime the implants by filling each pump, connecting tube and cannula with sterile drug or vehicle solution (as described in the instructions supplied with the pumps). Connect them together and incubate in sterile saline overnight at 37 °C. Incubate drug- and vehicle-filled implants separately to avoid cross-contamination.\nSurgery.\n\tNOTE: Depending on the country of the experimenter, special animal experimentation permits or allowances are required to pursue such types of surgery and post-operative experiments.\n\t\nSterilize all surgical equipment and employ aseptic technique throughout. Anesthetize a mouse (e.g. using 1-2% isofluorane in air) and place it in a stereotaxic headframe. Check the depth of anesthesia throughout the procedure and administer further anesthetic as necessary (e.g. absence of limb withdrawal to noxious paw pinch is indicative of adequate anesthesia). Ensure the eyes are protected from desiccation by lubricant eye ointment, and that the mouse’s body temperature remains normal throughout the procedure.",
    "Make a midline incision through the skin starting from between the eyes and finishing 2 cm posterior to the back edge of the skull. Blunt dissect the skin away from the underlying fascia down the back of the mouse to create a subcutaneous ‘pocket’ large enough to comfortably fit the pump and connecting tube once the cannula is implanted (the connecting tube should not be bent upon completion). Scrape clear the fascia from over the dorsal aspect of the skull.\nUsing an approximately 1.5 mm diameter dental burr, drill down into the skull at the appropriate stereotaxic coordinates until a thin, flexible layer of bone remains. Peel this layer away using fine forceps (this avoids damaging the underlying dura mater and brain with the dental burr). Ensure the skull is cleaned of any blood and bone fragments, and that there is no further bleeding.\nWith the cannula held by a cannula holder, place the pump and connecting tube into the subcutaneous ‘pocket’ overlying the mouse’s back. Next, position the tip of the cannula at the appropriate stereotaxic coordinates and on the surface of the brain. Carefully lower the cannula into the brain but stop approximately 1 mm short of the required depth.\n\t\tNOTE: The remaining depth will be negotiated following application of the first layer of dental acrylic.\nEnsure again the surface of the skull is clean and dry, then prepare a small volume of dental acrylic and use a toothpick to smooth it over the entire exposed area of skull, including into the burr-hole through the skull around the cannula. Before the acrylic hardens, lower the cannula tip the remaining depth into the target.",
    "Prepare another small volume of dental acrylic and layer this over the first, as well as over the white plastic support for the cannula, to fix the cannula in place. Repeat with additional layers of acrylic as necessary.\nOnce the acrylic has hardened, carefully remove the cannula holder and cut off the white plastic removable cannula tab using a scalpel blade heated with a butane flame. Lastly, suture the skin closed over the entire implant.\nPost-surgical Treatment of Animals\n\t\nApply antiseptic ointment to the skin margins, and administer an anti-inflammatory to the mouse (e.g. Meloxicam, 3 mg/kg s.c.). Remove the mouse from the frame, place it under a heat lamp, and observe until it regains consciousness. Do not return a mouse that has undergone surgery to the company of other animals until fully recovered.\n\t\tNOTE: Experimental manipulations such as gender pairing and environment enrichment can be initiated or resumed the day following surgery at the earliest.\nMonitor their body weight, general behavior and appearance daily. Treat signs of infection (e.g. swelling, redness, pus) around surgical incisions with topical antiseptic ointment. Treat any signs sickness, pain, stress or discomfort (e.g. loss of >10% body weight, social withdrawal, lack of grooming, “fluffing”, movement dysfunction, seizures) with systemic analgesics and/or antibiotics as necessary.\nEuthanize mice if >15% weight loss or symptoms of sickness, pain, stress or discomfort are non-recoverable within 1 week of remedial treatment.\n3. Brain Tissue Preparation, Immunohistochemical Processing, and Stereology\nPerfusion\n\t\nImmediately following environmental/drug manipulations, prepare the brain for study.\n\t\tNOTE: In the experiments reported here the number of SNc TH+ neurons were measured and compared in each of the different treatment groups.",
    "First administer an overdose of anesthetic to kill the mice (e.g. 100 mg/kg i.p. sodium pentobarbitone). Once anesthetized but before the heart stops beating, lay the mouse on its back and tie or pin down both forelimbs.\nUsing a scalpel cut away the skin overlying the thorax then incise through the muscle just below the rib cage into the abdominal cavity. Place a clamp on the xiphoid process of the ribcage and lift the ribcage up and away from the liver exposing the diaphragm.\nCut through the diaphragm and through the ribs laterally on both sides using large scissors until the ribcage can be folded back over the head to expose the lungs and heart. Using fine scissors make a small incision in the right atrium as an exit point for blood and perfused solutions, then cut through the base of the left ventricle and place a cannula up through the left ventricle, the left atrium, and into the aorta.\nClamp the cannula in place then pump warm (37 °C) heparinized and 0.1 M phosphate buffered physiological saline (PBS) through the vasculature until the solution exiting the right atrium is entirely free of blood. Next, pump cold (4 °C) fixative solution (such as 4% paraformaldehyde in PBS) through the vasculature until the entire mouse is well fixed. Remove the brain and place in PBS with 30% sucrose for 2-3 days until the brain sinks.\n\t\tNOTE: Other types of tissue preparation might be applied depending on the expertise in the corresponding laboratory.\nPreparation of Free-floating Cryosections\n\t\nCut serial sections through the brain regions of interest and collect these in PBS.\n\t\tNOTE: We cut 40 µm thick sections using a cryostat. Other types of tissue sectioning might be applied depending on the expertise in the corresponding laboratory.\nImmunohistochemistry",
    "Perform standard immunohistochemistry for proteins of interest. Incubate sections in 5% normal goat serum and 0.3% triton X-100 in PBS at room temperature for 30 min, then immunoreact with polyclonal rabbit anti-TH (1:400) at 4 °C for 48 hr, then polyclonal biotinylated goat anti-rabbit (1:1,000) at room temperature for 2 hr.\nNext, incubate in avidin-peroxidase (1:500) at room temperature for 1hr, then in cobalt- and nickel-intensified diamino-benzidine (0.5 mg/ml) at room temperature for 18-20 min; for the last 3-5 min of the diamino-benzidine incubation add hydrogen peroxide (0.01%) to catalyze chromagen precipitation. Wash sections three times for 10min each in PBS before, after, and between each of the above steps.\nMount the sections on gelatinized microscope slides, air dry them, then Nissl stain (neutral red), dehydrate in alcohol, clear (X-3B), and coverslip.\nStereology\n\t\nEstimate the total number of TH+ and TH- SNc (and VTA and LC) neurons using unbiased stereological methods. Ensure that the stereologist is blind to the treatment received. Exclude glia on the basis of soma diameter <5 µm and count only those cells with a visible nucleus.\nIdentify the SNc (and VTA and LC) by the spatial locations of TH+ cells and anatomical landmarks/boundaries according to the brain atlas of Paxinos and Watson7. Count TH+ cells within a counting frame (55 x 55 µm = 3025 µm2) at regular pre-determined intervals (x = 140 µm, y = 140 µm for SNc; x = 100 µm, y = 100 µm for VTA and LC) throughout each nucleus in every fourth section.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}