{
  "id": 11862,
  "origin_website": "Jove",
  "title": "Industrialized, Artificial Intelligence-guided Laser Microdissection for Microscaled Proteomic Analysis of the Tumor Microenvironment",
  "procedures": [
    "All study protocols were approved for use under a Western IRB-approved protocol \"An Integrated Molecular Analysis of Endometrial and Ovarian Cancer to Identify and Validate Clinically Informative Biomarkers\" deemed exempt under US Federal regulation 45 CFR 46.102(f). All experimental protocols involving human data in this study were in accordance with the Declaration of Helsinki. Informed consent was obtained from all subjects involved in the study.\nCAUTION: The following reagents used throughout the protocol are known or suspected carcinogens and/or contain hazardous materials: ethanol, DEPC water, Mayer's Hematoxylin solution, Eosin Y solution, methanol, acetonitrile, and formic acid. Proper handling, as described in the respective safety data sheets (SDS), and use of appropriate personal protective equipment (PPE) is mandatory.\n1. Generating the default shape list data (.sld) file containing calibrator fiducials\nNOTE: The protocol steps described in this section are specific to use with an inverted laser microscope and the associated software (see the Table of Materials). Creation of a default .sld file is only necessary once per laser microscope. The resultant file can be used for cutting fiducials into all PEN slides used thereafter. Approximate time: 5 min (once only).\nOpen the LMD software and load the polyethylene naphthalate (PEN) membrane slide onto the LMD stage face down, with the label nearest to the user. Unselect the Close line(s) box on the right side of the program window.",
    "Use the PtoP (point to point) function under high magnification (63x) to draw three \"V\" arrows to serve as calibration fiducials. Starting at one external point on the V, draw a line to the mid-point of the V and single click. Then, draw a second line from the central point of the V to the end of the second external V point, and double-click to create a single, unclosed V shape from the two lines.\n\tNOTE: These calibration fiducials should be placed in three corners of the slide: front right, rear right, rear left.\nSelect the AF (autofocus) before cut option. Cut the slide in position 1, move it into each of the remaining slide positions, and trace precisely over the calibration cuts.\nSave the .sld file and select the Save without calibration option from the pop-up dialog box to avoid cutting the calibration fiducials into the membrane.\n\t​NOTE: A representative .sld file containing standard calibrator fiducials for four slide positions is provided in Supplemental File 1.\n2. LMD slide(s) preparation\nNOTE: The protocol steps described in this section are specific to use with an inverted laser microscope and the associated software (see the Table of Materials). Approximate time: 5 min.\nEnsure that the slide is completely dry before cutting the reference calibration fiducials. Open the LMD software and open the default calibration .sld file under the Import shapes option.\nSelect the AF (autofocus) before cut option. Load the slide(s) with the tissue facing down and the label slide nearer to the operator into the slide holder on the LMD stage.\nUsing the laser microscope and default calibration .sld file, cut calibration fiducials into the PEN membrane.",
    "OPTIONAL: Cut the calibration fiducials into the PEN membrane either before or after the tissue section(s) is/are placed on the slide. If the calibration fiducials are cut prior to tissue placement, ensure that the tissue and/or fixative does not overlap with the calibrators when the tissue is placed on the slide in Step 2.5. If calibration fiducials are cut after tissue placement, stop after the completion of Step 2.4 and proceed to section 3.\nReview all calibrators individually to ensure that each cut is complete and visible.\n\tNOTE: Use the Move and Cut feature to manually direct the laser over any calibration fiducials that did not fully cut through the PEN membrane.\nPlace the frozen or formalin-fixed, paraffin-embedded (FFPE) tissue section onto the slide containing the calibration fiducials.\n3. Tissue staining\nNOTE: Approximate time: 30 min.\nFix the frozen LMD tissue slides in 70% ethanol (EtOH) containing phosphatase inhibitor cocktail reagents for 5 min.\nWash the slides in diethyl pyrocarbomate (DEPC) water containing phosphatase inhibitor cocktail reagents for 1 min.\nWash the slides in DEPC water for 1 min.\nIncubate the slides in Mayer's Hematoxylin solution for 3 min.\nRinse the slides in DEPC water for 3 min.\nRinse the slides in a fresh exchange of DEPC water for 1 min.\nIncubate the slides in aqueous Eosin Y solution for 1 s.\nRinse the slides 2 x 5 s in 95% EtOH.\nRinse the slides 3 x 10 s in 100% EtOH.\nWipe the excess EtOH from the back of the slides and allow the slides to air-dry.\nStore the slides at -80 °C if LMD is not to be performed immediately.\n4. Slide imaging",
    "NOTE: The protocol steps described in this section are specific for slides scanned (see the Table of Materials) and the resultant images saved as .svs files. Use any scanner and its associated software that generate image files in a format that the image analysis software (see the Table of Materials) can open. File types using pyramidal tiffs that are supported include JPG, TIF, MRXS, QPTIFF, component TIFF, SVS, AFI, SCN, LIF, DCM, OME.TIFF, ND2, VSI, NDPI, NDPIS, CZI, BIF, KFB, and ISYNTAX. Approximate time: 5 min.\nTurn on the scanner and open the slide scanner software. Load the slide with the tissue facing up onto the single slide stage in the scanner. Ensure the slide is completely dry and gently place a coverslip over the tissue. Do not use ethanol or immersion oil under the coverslip.\nCapture the micrograph image using settings calibrated to adjust for the PEN membrane instead of glass background and to ignore background membrane staining, per manufacturer's instructions.\nAdjust the imaging area by dragging and resizing the inner green perimeter to capture the entire PEN membrane area, as needed. Add four focus points onto the tissue by double-clicking onto the snapshot overview image, and three focus points on the membrane near the calibration fiducials (one focus point per each of the three calibration fiducials).\n\tNOTE: The four focus points can be placed nearly anywhere on the tissue section, though placing onto tissue that is too darkly stained and appears black may cause the scan to fail.\nUnder the View menu, select Video Monitor. Manually adjust the focus using the fine and/or macro focus slider, as needed, for each point around the LMD tissue. Capture the image scan under high magnification (20x). Confirm that all calibration fiducials are visible and clear in the saved image.",
    "5. Automated feature selection using image analysis software\nFor whole tumor collections (approximate time: 5 min; case-dependent):\n\t\nOpen the image analysis software (see the Table of Materials). Select Open Images and from the pop-up window, select the .svs image file generated from scanning the slide on the AT2 scanner.\n\t\tNOTE: A representative .svs image file is provided in Supplemental File 2.\nNavigate to the Annotations tab. Select the Pen tool on the Annotation toolbar and draw a shape around the tissue.\nSelect the shape and right-click on the image. From the Advanced dropdown menu, select Partitioning (Tiled). Set the Tile Size and Space Between to 500 and 40, respectively, and select OK to generate the tiles. Select and delete the perimeter shape used to generate the tiles in step 5.1.2.\nSelect the Layer Actions dropdown menu | Export to save the tiled annotations as a .annotation file.\n\t\tNOTE: A representative .annotation file for a whole tumor tissue collection is provided in Supplemental File 3.\nCreate a folder for the session or project, and save the .annotation file inside a subfolder labeled with the unique identifier for the slide.\nNavigate to the Annotations tab. Select the Layer Actions dropdown | Delete All Layers to remove all annotations from the image. Select the pen tool and draw a short line from the inner tip of the arrowhead for each calibration fiducial. Draw the lines from the marks in the following order: top left, top right, bottom right.\nSelect the Layer Actions dropdown menu | Export to save the line annotations as a .annotation file. Add _calib to the filename and place the file in the subfolder that contains the coordinates for the tiled shapes.\n\t\tNOTE: A representative _calib.annotation file is provided in Supplemental File 4.",
    "Copy the address for the main project or session folder. Open the XML import generating script, \"Malleator\" (available via https://github.com/GYNCOE/Mitchell.et.al.2022), using the IDLE integrated development environment and paste the project folder address between the quotes at the bottom of the script.\nSelect the Run dropdown menu | Run Module to execute the script.\n\t\tNOTE: The .xml LMD import file will be generated inside the subfolder created for the image/slide. A representative .xml file is provided in Supplemental File 5.\nFor LMD-enriched collections only (approximate time: 15 min; case-dependent):\n\t\nOpen the image analysis software (see the Table of Materials). Select Open Images and from the pop-up window, select the .svs image file generated from scanning the slide.\nNavigate to the Annotations tab. Select and use the Rectangle annotation tool to draw a box around the tissue.\nSelect the box annotation and right-click on the image. Select the Advanced dropdown menu | Partitioning (Tiled) option. Set the Tile Size and Space Between to 500 and 40, respectively, and select OK to generate the tiles. Select and delete the perimeter box annotation used to generate the tiles in step 5.2.2.\nSelect the Layer Actions dropdown menu | Export to save the tiled annotations as a .annotation file.\nPlace a saved copy of the Python \"Dapọ\" (available via https://github.com/GYNCOE/Mitchell.et.al.2022) algorithm, developed to merge the AI-classified annotation layers, into the same folder as the tiled annotations file.\nCopy the name of the tiled annotation file. Open the Python program using the IDLE integrated development environment and paste the name of the tiled annotation file between the quotations at the bottom of the program.\nSelect the Run dropdown menu | Run Module. Wait for a new file to be generated that will have all the tiled annotations merged under a single layer.",
    "Open the image analysis software and navigate to the Annotations tab. Select the Layer Actions dropdown menu | Delete All Layers to remove all annotations from the image.\nSelect the Layer Actions dropdown menu | Import Local Annotation File. In the pop-up window, select the merged .annotation file that was generated by the script. Ensure that all imported tiles are under the same annotation layer.\nNavigate to the Classifier tab and follow the manufacturer's instructions to generate shapes for the ROIs. Before running the classifier, select the desired annotation layer(s) (i.e., the tumor or stroma layer) by checking the ROI box or boxes on the Annotations tab, under the Advanced Classifier Options. Use the Annotation Layer option from the Classifier Actions menu to run the classifier.\nOnce the Classifier analysis is complete, navigate to the Annotations tab and select the annotation layer generated from the analysis. Select the Layer Actions dropdown menu | Delete All Layers But Current to remove all other annotation layers from the image.\nSelect the Layer Actions dropdown menu | Export to save the annotations as a .annotation file. Create a folder for the session or project and save the .annotation file inside a subfolder labeled with the unique identifier for the slide.\n\t\tNOTE: A representative .annotation file for a classified LMD enriched tissue collection is provided in Supplemental File 6.\nNavigate to the Annotations tab, select the Layer Actions dropdown | Delete All Layers to remove all annotations from the image. Select the pen tool and draw a short line from each calibration fiducial. Draw lines from the marks in the following order: top left, top right, bottom right.",
    "Select the Layer Actions dropdown menu | Export to save the line annotations as a .annotation file. Add _calib to the filename and place the file in the subfolder that contains the coordinates for the tiled shapes.\nCopy the address for the main project or session folder. Open the XML import generating script, \"Malleator\" (available via https://github.com/GYNCOE/Mitchell.et.al.2022), using the IDLE integrated development environment, then paste the project folder address between the quotes at the bottom of the script.\nSelect the Run dropdown menu | Run Module to execute the script.\n\t\t​NOTE: The .xml LMD import file will generate inside of the subfolder created for the image/slide.\n6. Laser microdissection\nNOTE: The protocol steps described in this section are specific to use with an inverted laser microscope and the associated software (see the Table of Materials). Approximate time: 2 h; case dependent.\nLoad the marked membrane slide (containing calibration fiducials) with the tissue facing down and the label side nearer to the operator into the slide holder on the laser microscope stage.\nSelect Import Shapes from the File dropdown menu. Select the .xml LMD import file generated for the slide. Select No in the pop-up window to avoid loading reference points from file and No in the second pop-up window to avoid using any previously stored reference points for calibration.",
    "Follow the prompts from the LMD application and align the calibration cross to each of the three calibration fiducials on the slide. Look for calibration fiducials that appear in the top left, top right, and bottom right of the slide image in the image analysis software that will correspond to reference points in the front right, rear right, and rear left corners, respectively, of the inverted LMD slide on the microscope stage. Switch between using the 5x objective lens to locate and the 63x objective to align each calibration fiducial. Select No on the pop-up window to avoid saving the reference points to file and OK in the second pop-up window to confirm that the slide is inserted.\nMove the 5x objective lens into position and select Yes in the pop-up window to use the actual magnification. Once the imported shapes appear, focus the camera onto the tissue.\nHighlight and select all the shapes in the Shapes List window, drag them into place using one or two annotations within the field of view as references, and align the vertical z-axis for cutting with the laser.\nReview the imported shapes and assign them to the appropriate tube position for collection. Press Start Cut to start the laser.\n\t​NOTE: Imported shapes in the .xml file will be automatically assigned to the \"no cap\" position in the Shapes List window. To harvest tissue, the imported shapes must be reassigned to a position containing a loaded tube.\n7. Protein digestion by pressure-cycle technology (PCT)\nNOTE: Approximate time: 4 h (3 h without vacuum centrifuge drying time).",
    "Place 0.5 mL tubes containing the capped PCT MicroTubes containing LMD harvested tissue in 20 μL of 100 mM TEAB/10% acetonitrile into a thermocycler and heat at 99 °C for 30 min, then cool to 50 °C for 10 min.\nSpin the tubes for 30 s at 4,000 × g and then remove the MicroTubes from the 0.5 mL tubes. Using the MicroCap tool, remove and discard the MicroCaps from the PCT MicroTubes. Add trypsin (see the Table of Materials) at a ratio of 1 μg per 30 mm2 tissue and insert a MicroPestle into the MicroTube using the MicroCap tool.\nTransfer the MicroTubes into a barocycler cartridge and assemble the complete cartridge. Place the cartridge into the barocycler pressure chamber and secure the lid. Barocycle at 45,000 psi for 50 s and atmospheric pressure for 10 s at 50 °C for 60 cycles.\nOnce barocycling is complete, transfer the microtubes to a 0.5 mL microcentrifuge tube and centrifuge for 2 min at 4,000 × g.\nRemove the MicroTube from the 0.5 mL microcentrifuge tube using the cap tool. Carefully remove the pestle using the cap tool and rinse the bottom half of the pestle with 20 μL of liquid chromatography-mass spectrometry (LC-MS)-grade water and collect the wash into a clean 0.5 mL microcentrifuge tube.\nGently tap the MicroTube on the bench top to move the liquid to the bottom and transfer all of the solution from the MicroTube into the 0.5 mL microcentrifuge tube.\nAdd 20 μL of LC-MS-grade water to the MicroTube and tap it gently on the bench top. Transfer the wash solution to the 0.5 mL tube and repeat this wash step once more.\nVacuum centrifuge to dry down the samples to ~2 μL and add 100 μL of 100 mM TEAB, pH 8.0.",
    "Determine the peptide concentration using a colorimetric assay (bicinchoninic acid (BCA) assay; see the Table of Materials) according to the manufacturer's protocol.\n8. Tandem-mass tag (TMT) labeling and EasyPep cleanup\nNOTE: Approximate time: 7 h 20 min (2 h 20 min without vacuum centrifuge drying time).\nBring the isobaric TMT labeling reagents to ambient temperature before opening. Add 500 μL of 100% acetonitrile to each TMT vial (5 mg). Incubate for 10 min with occasional vortexing.\nDissolve 5 μg of the peptide sample in 100 μL of 100 mM TEAB, pH 8.0, and add 10 μL of a given TMT reagent. Construct and include reference pools representing each individual sample in the experiment in each TMT multiplex set of samples to facilitate quantification of samples across multiple TMT multiplexes9. Incubate reactions for 1 h at ambient temperature with occasional shaking/tapping.\nQuench the TMT labeling reaction by adding 10 μL of 5% hydroxylamine and incubate for 30 min at ambient temperature with occasional tapping. After quenching, combine the TMT-labeled samples into one tube and dry to approximately 200 μL.\nAdd 1,800 μL of 0.1% formic acid. Check the pH with pH paper: if pH ~3, add 1 mL of 0.1% formic acid; if pH >3, add 10-20 μL of 5% formic acid until pH ~3. Add 0.1% formic acid to bring to a final volume of 3 mL.\nRemove the tab at the bottom of the Peptide Clean-up Column, remove the cap, and place it in a 15 mL conical tube. Transfer the TMT-labeled sample to the column and proceed with cleanup as per the manufacturer's protocol.\nVacuum centrifuge to dry down the eluted peptides to ~20 µL, transfer to an LC vial using 25 mM ammonium bicarbonate for a final volume of 80 µL, and proceed to offline fractionation.",
    "9. TMT multiplex sample fractionation and pooling\nNOTE: Approximate time: 3 h 30 min (1 h 30 min without vacuum centrifuge drying time).\nFractionate the TMT-labeled peptide multiplexes by basic reversed-phase chromatography into 96 fractions by developing an increasing linear gradient (0.69% min-1) of mobile phase B (acetonitrile) into mobile phase A (10 mM NH4HCO3, pH 8.0).\nGenerate 36 concatenated fractions by pooling sample wells. Vacuum centrifuge to dry fractions to ~2 μL and resuspend in 25 mM ammonium bicarbonate (final concentration 1.5 μg/10 μL), centrifuge at 15,000 × g for 10-15 min, and transfer to LC vials for MS analysis.\n10. Liquid chromatography tandem mass spectrometry (LC-MS/MS)\nNOTE: Approximate time: Instrument method and experimental design dependent.\nCalibrate the mass spectrometer according to the manufacturer's instructions/protocols.\nPrepare fresh mobile phases and standards and perform appropriate LC pre-run preparations (including but not limited to purge solvents, flush air, and leak test scripts for the referenced instrument [see the Table of Materials]). Equilibrate pre- and analytical columns and sample loop prior to starting analyses.\nPrior to and in between serial TMT multiplex analyses, validate that the LC-MS system meets previously benchmarked performance metrics using quality assurance/quality control (QA/QC) TMT-labeled peptide digests and (e.g., MSPE (see the Table of Materials), HeLa).\nLoad autosampler vials in the appropriate positions in the LC autosampler. Analyze individual fractions with an appropriate gradient/MS method. Intersperse a \"wash\" run with peptide standard (e.g., peptide retention time calibration [PRTC]) approximately once daily to evaluate chromatographic and mass spectral performance. Following the analysis of each TMT multiplex sample fraction series, run QA/QC TMT benchmark standards to evaluate system performance.\nRun mass spectrometer evaluation routines after QA/QC TMT benchmark standards to assess post-sample performance and then calibrate system as in step 10.1 for next sample set.\n11. Bioinformatic data analysis",
    "NOTE: Approximate time: Experimental design dependent.\nTransfer all sample data (e.g., .raw files) to an appropriate network storage/computer drive.\nSearch all fractions together using the desired data analysis application (e.g., Proteome Discover, Mascot) using appropriate parameters9 against a species-specific protein reference database to generate peptide spectral matches (PSMs) and extract TMT reporter ion signal intensities. Filter PSMs based on appropriate quality control metrics, and aggregate normalized, median log2-transformed TMT reporter ion ratio abundances into global protein level abundances, as previously described3,9.\nCompare protein alterations in conditions of interest using desired differential analysis software."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}