{
  "id": 9263,
  "origin_website": "Jove",
  "title": "Methods for Cell-attached Capacitance Measurements in Mouse Adrenal Chromaffin Cell",
  "procedures": [
    "NOTE: The entire procedure was conducted in accordance with the guidelines of the National Institutes of Health, as approved by the Animal Care and Use Committee of the University of Illinois at Chicago.\n1. Solutions and Culture Media Preparations\nKeep all the solutions at -20 °C for up to six months. Keep the culture media at 4 °C for up to 3 months.\nPrepare 100 ml of culture media by mixing 1 ml of pen-strep solution and 1 ml of ITSX (Insulin-Transferrin-Selenium-Supplementation) to 100 ml with DMEM.\nPrepare enzyme solution by mixing 250 ml of DMEM, 2.5 ml of 100 mM CaCl2, and 2.5 ml of 50 mM EDTA.\nPrepare inactivation solution by mixing 225 ml of DMEM, 25 ml of FBS, 625 mg of albumin, and 625 mg trypsin inhibitor.\nPrepare a Locke’s Solution of 154 mM NaCl, 5.6 mM KCl, 5.0 mM HEPES, 3.6 mM NaHCO3, 5.6 mM glucose. Adjust the pH to 7.3 with NaOH.\nPrepare a poly-d-lysine (PDL) solution of 50 mg/ml. Use a final concentration of 1 mg/ml to coat coverslips.\nPrepare an extracellular solution of 140 mM NaCl, 5 mM KCl, 2 mM CaCl2, 1 mM MgCl2, 10 mM HEPES-NaOH, and 10 mM glucose. Adjust the pH to 7.3 with NaOH with an osmolarity of ~310 nmol/kg.\nPrepare a pipette solution of 50 mM NaCl, 100 mM TEACl, 5 mM KCl, 2 mM CaCl2, 1 mM MgCl2, and 10 mM HEPES. Adjust pH to 7.3 with NaOH with an osmolarity of ~290 nmol/kg.\n2. Adrenal Gland Isolation\nAutoclave a pair of large and small dissection scissors and two pairs of forceps. Wear gloves during the whole process and place the dissecting tray on an ice bucket.\nUse mice taken at Day 0-3. Euthanize animals with a pressurized CO2 tank followed by decapitation.",
    "Utilize the smaller set of scissors to cut down the back of the pup following the spine from cervical to caudal region. Be sure to cut superficially under the skin and not pierce into the body cavity.\nNext, peel skin away from spine so that musculature is exposed to have a clear view of the spinal column. From here, make a transectional cut at the cervical spinal cord and then make two parallel cuts along the sides of the spine.\nWith one pair of forceps holding the main body of the animal, use the other pair of forceps to grab spinal column and peel back spine till kidneys are exposed.\nAt this moment, visualize the adrenal glands on the top of the kidneys. Then carefully place the two glands from each animal into a conical tube filled with Locke’s solution.\n\tNOTE: Sometimes the glands will stick to the forceps. If this is the case, gently use another pair of forceps to aid in the removal of the glands from the forceps and into the Locke’s solution. The glands can be kept in this condition for up to 2 hr.\n3. Tissue Digestion\nIn the meantime, bubble the enzyme solution with 5% CO2 + 95% O2 for 15 min prior to use. Ensure that the equilibrated solution turns from a bright pink color into pinkish/orange color.\nAdd the papain to the freshly bubbled enzyme solution at a final concentration of 20-25 unit/ml. Incubate each pair of glands from each animal for 40-60 min at 37 °C in the enzyme solution with papain.\nAdd 75% of inactivation solution to each tube and incubate at 37 °C for another 10 min. This incubation inactivates the enzyme activity of papain.",
    "After the 10 min incubation with the inactivation solution, gently transfer the glands into a newly labeled tube and then wash the glands 3x with culture media.\n4. Cell Dissociation and Plating\nAfter washing, place the two glands into 200 µl of the culture media and then gently titrate the glands up and down through the pipette tip with a 200 µl pipette until there is no longer a large piece of tissue in the solution.\n\tNOTE: When titrating, maintain glands at the bottom of the tube with a downward force from the 200 µl pipette tip and engage the tissue gently and slowly. Be certain to use slow, continuous strokes, never pipetting fast or abrupt.\nAdd an additional 250 µl culture media to bring the total volume of culture media up to 450 µl.\nPlate 60 µl of this cell-containing solution onto each of seven 12 mm PDL-pre-coated coverslips, which are placed in a 60 x 15 mm culture dish.\nOnce plated, place the dish into the incubator that is set to 37 °C and maintained with a steady flow/supply of 5% CO2 for 30 min to ensure an environment for cell viability. After incubation, gently add 5 ml of pre-warmed culture media into the culture dish and return the dish back into the incubator for 24 hr prior to cell-attached recordings.\n\tNOTE: Typically, the cells can be used for electrophysiological recordings for up to 4 days.\n5. Cell Identification and Gigaohm Seal Formation\nPlace the 12 mm coverslip into extracellular solution. Since the whole adrenal glands are used for cell preparation, mix the chromaffin cells (typically very bright with a brownish/beige coloring and a near perfect circular form (Figure 1) in culture with cortical cells (smaller and dimmer than chromaffin cells).",
    "Pull the patch pipettes in four stages using a programmable P-97 puller. Dip the pipette tip into a melted wax, which will help to reduce the capacitance of the glass and then fire polish the tip to “blow-away” this wax from inside of the pipette tip.\n\tNOTE: When filled with patch pipette solution, patch pipettes typically have a resistance of ~2 MΩ.\nApproach the patch pipette close to the cell within several microns. To achieve a cell-attached configuration, look for any slight cell deformation during the approach of the patch pipette closer to the cell. Apply gentle suction until a GΩ seal is achieved.\n6. Cell-Attached Capacitance Recordings\nOnce a GΩ seal is revealed, make cell-attached recordings through the use of an EPC-7 plus patch-clamp amplifier and a two-phase analog lock-in amplifier (see attached table of equipment). Apply a sinewave with amplitude of 50 mV (r.m.s.) and frequency of 20 kHz from the lock-in amplifier.\nSet the output filter of the lock-in amplifier at 1 msec time constant and 24 db. Set the phase of the lock-in amplifier such that transient capacitance changes produced by gentle suction pulses appear only in the patch capacitance (Im) trace with no projection into the patch conductance (Re) trace (Figure 2).\n\tNOTE: Please see the details for the calibration of the system in reference 19.\nIdentify typical capacitance changes by “downward” steps (Figure 3).\n\tNOTE: A solid recording will be viewed as a “staircase” type resemblance with many downward steps, which indicates internalizing single vesicles. The patching process serves as a mechanical stimulation since action current can be typically recorded from most cells.\nName files as individual folders including date: mm/dd/year and each cell-attached recording as its own individual numbering (xx) within that file.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}