{
  "id": 17773,
  "origin_website": "Jove",
  "title": "International Expert Consensus and Recommendations for Neonatal Pneumothorax Ultrasound Diagnosis and Ultrasound-guided Thoracentesis Procedure",
  "procedures": [
    "This work was approved by the Research Ethics Committee of Beijing Chaoyang District Maternal and Child Healthcare Hospital & Beijing Chaoyang District Bureau of Science, Technology and Information. The study protocol follows the guidelines of the hospital's human research ethics committee.\n1. Ultrasound Exam Preparation\nProbe selection\n\t\nSelect a high-frequency linear probe (≥10.0 MHz) to scan the lungs.\nProbe disinfection\n\t\nSterilize the transducer before and after each examination.\nPreset selection\n\t\nSelect the LUS preset.\nOptimize imaging settings for examination when no LUS preset is available.\n\t\t\nSelect one of the Small Parts presets.\nAdjust depth to 4–5 cm using the Depth button.\nAdjust the Focus Zone button to have 1 or 2 focuses.\nAdjust the focus close to the pleural line.\nTurn on the SRI (Speckle Reduction Imaging) by clicking the button and selecting a level of 2–3 to reduce the speckle noise.\nTurn on the CRI button (Crossbeam) and select a level of 2 to improve the contrast resolution.\nSelect Fundamental Imaging for sharper A-lines or B-lines.\nUsing an ultrasound gel\n\t\nApply the appropriate volume of warm gel on the transducer to keep it in good contact with the skin surface.\n2. Place the Infant in a Suitable Position\nKeep the infant quiet. Use a pacifier when necessary.\nKeep the infant in a supine, prone, or side position for examination.\n3. Partitioning the Lungs\nSix regions: Divide each side of the lung into three regions along the anterior axillary and posterior axillary line. These are the anterior, lateral, and posterior areas. Thus, both lungs are divided into six regions.\nTwelve regions: Divide each lung into upper and lower lung fields by the nipple connection line. Now there should be 12 regions on both lungs.\n4. Procedure for LUS Imaging\nB-mode scanning",
    "Press the 2D button or B key to start B-mode scanning.\nPlace the transducer perpendicular to the ribs to start perpendicular scanning. Identify the presence of the pleural line, A-line, and B-lines.\nOn real-time US observe whether there is lung sliding or lung point.\nRotate the probe 90° to start parallel scanning.\n\t\tNOTE: 1) The exam must cover the entire bilateral lung fields. Start at the highest part of the thorax, especially in emergency situations. Because newborns are usually placed in a supine position, this zone is usually located on both sides of the sternum; 2) Bilateral perpendicular scanning is the most important scanning method, while parallel scanning is helpful for diagnosing mild-to-moderate PTX.\nM-mode scanning\n\t\nPress the M-button to start M-mode scanning. Look for the presence of the stratosphere sign or lung point that indicate PTX.\n\t\tNOTE: Experienced sonographers can detect PTX using only B-mode. M-mode scanning can be used to confirm the B-mode findings if an examiner is less experienced.\n5. Identifying the Presence of PTX\nObserve if the pleural line, A-lines, and B-lines exist on B-mode.\nObserve if lung sliding and lung point exist on real-time US.\nObserve if the stratosphere sign is present on M-mode.\n6. Identifying the Degree of PTX\nIdentify the degree of PTX according to the LUS findings.\n7. LUS-guided Thoracentesis\nIdentify a suitable puncture point.\n\tNOTE: When identifying a suitable puncture point, keep the following in mind: 1) Intercostal space where the pleural line and A-lines exist on B-mode; 2) Intercostal space that presents with a stratosphere sign in M-mode; 3) Intercostal space where lung sliding disappears on real-time US.\nSelect an appropriate puncture needle (18-20 G needle or an angiocatheter connected to a 20 mL syringe and a three-way stopcock).\nBody positioning",
    "Keep the infant in a quiet state. Assure adequate pain control according to the local unit policy.\nPlace the infant in the supine, prone, or side position before thoracentesis, allowing the air on the affected side to rise.\nPut on a pair of sterile gloves. Disinfect the puncture area.\nThoracentesis\n\t\nKeep the infant in a stable position.\nEvacuate the pleural air by needle aspiration at the selected puncture point. Alternatively, a chest tube may be placed immediately.\n\t\tNOTE: In general, thoracentesis achieves good results. Adequate pain control is strongly recommended (a local 1% lidocaine injection in the dose of 0.5–1.0 mg/kg or enteral pain control as per unit policy). The use of a pacifier is also encouraged. Larger or tension-PTX is at increased risk of having an underlying bronchopulmonary fistula. It may need a prolonged period of continuous chest tube drainage. Postprocedural LUS evaluation of the affected side is recommended. Cover the insertion site with petroleum gauze once thoracentesis is completed."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}