{
  "id": 5362,
  "origin_website": "Bio",
  "title": "Determination of the <em>in vitro</em> Sporulation Frequency of <em>Clostridium difficile</em>",
  "procedures": [
    "Inoculate 10 ml BHIS medium supplemented with 0.1% taurocholate and 0.2% fructose with a single C. difficile colony from a plate and incubate overnight at 37 °C. Include selective antibiotics, if necessary for plasmid maintenance.Note: For additional details on basic C. difficile cultivation, including propagation from frozen glycerol stocks, see Edwards et al., 2013. Taurocholate is a germinant that will promote germination of any spores present in the C. difficile colony. Fructose is an additional carbon source that prevents sporulation and reduces the accumulation of spores in the overnight culture. To ensure that the cultures are in logarithmic growth phase in the morning, an additional overnight culture of each strain may be made by back diluting the original culture 1:200-1:1,000 after inoculation into the same medium conditions.In the morning, ensure that cultures are actively growing in mid-exponential phase, e.g., the OD600 is ≤ 0.9. If cultures are past an OD600 = 0.9, and thus, entering transition or stationary phase, it may be necessary to back dilute cultures into fresh BHIS to an OD600 < 0.5 to allow the cultures to outgrow and re-enter logarithmic growth before initiating the experiment (approximately 30-90 min, depending on the original density of the overnight culture). If cultures are below OD600 < 0.9, indicating that the cells are in logarithmic growth, continue with step 3.Allow cultures to grow, or back dilute late exponential phase cultures (OD600 < 0.9) using fresh BHIS, to a final OD600 = 0.5. Apply 250 µl of culture onto the surface of fresh, pre-reduced 70:30 sporulation agar and gently spread evenly over the surface with a sterile inoculating loop. Mark the time as H0 and incubate plates for 24 h at 37 °C.",
    "Immediately perform H0 ethanol resistance sporulation assays as a control to ensure no spores are present in the exponential phase cultures. Add 0.5 ml of the back diluted (OD600 = 0.5) culture to a microcentrifuge tube containing 0.3 ml 95% ethanol and 0.2 ml dH2O. Vortex well and incubate for 15 min. Evenly spread 100 µl of each H0 control onto pre-reduced BHIS supplemented with 0.1% taurocholate agar plates and incubate at 37 °C for at least 24 h. Note: This control ensures that there are not a significant number of spores carried over from the overnight culture or previous passages and confirms that sporulation is not already occurring at the beginning of the sporulation assay, potentially misrepresenting the final sporulation frequencies.At H24, perform ethanol resistance sporulation assays:Enumerate vegetative cells Scrape C. difficile from the surface of the plate (approximately 1/8 of the plate, depending on the density of the cells on the plate surface) with a sterile inoculating loop and suspend cells in approximately 5 ml BHIS to an OD600 = approximately 1.0. Perform serial dilutions of suspended cells in pre-reduced BHIS liquid medium to enumerate the total number of vegetative cells. Evenly spread 100 µl onto pre-reduced BHIS agar. Typically, plating 100 µl each of 10-4 and 10-5 dilutions will yield countable colonies. Enumerate spores Aliquot 0.5 ml of culture from step 5a.i to a tube containing 0.2 ml dH2O and 0.3 ml 95% ethanol (final concentration = 28.5% ethanol). Vortex well and incubate for 15 min.Note: This step may be performed anaerobically or aerobically as spores are fully resistant to oxygen exposure.Serially dilute the ethanol and spore mixture from step 5b.i in 1x PBS + 0.1% taurocholate and spread 100 µl onto pre-reduced BHIS supplemented with 0.1% taurocholate plates (e.g.",
    ", 100 µl of a 10-4 dilution for 630Δerm typically yields approximately 150-200 CFU). Plate as many serial dilutions as necessary to ensure countable colonies (approximately 30-400 colonies per plate). Note: As a control, plate 100 µl of the undiluted non-sporulating C. difficile strain after ethanol treatment (step 5b.i). This plate should yield no colony forming units (CFU), as all vegetative cells are eliminated in the presence of 28.5% ethanol. Additionally, 0.1% taurocholate must be included in the diluent and in the medium to efficiently recover all viable spores, as taurocholate serves as a germinant for C. difficile (Sorg and Sonenshein, 2008).Calculate sporulation frequencyEnumerate CFU on all plates after > 24 h incubation at 37 °C. Separately calculate the total number of vegetative cells and spores, accounting for both the serial dilution and the plate dilution in the calculation. Note: Remember to multiply the ethanol resistant spores by a factor of 2 to account for the one-half dilution that occurs during ethanol exposure. In addition, there should be few (> 100) to no CFU on the H0 plates, and no CFU present on the spo0A mutant control plate. If more than 500 CFU are recovered at H0, this may impact the final sporulation frequency, and caution is warranted when interpreting the results. Finally, this step can be performed aerobically and with a digital colony counter to facilitate enumeration. Calculate sporulation frequency according to equation below.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170124/20170124215542_3737.jpg"
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}