{
  "id": 12146,
  "origin_website": "Jove",
  "title": "Unraveling Key Players of Humoral Immunity: Advanced and Optimized Lymphocyte Isolation Protocol from Murine Peyer's Patches",
  "procedures": [
    "All studies and experiments described in this protocol were conducted under guidelines according to Institutional Animal Care and Use Committee (IACUC) of Beth Israel Deaconess Medical Center.\n1. Designing Experimental Set-up and Mouse Groups\n(Optional) Co-house the experimental mice to facilitate horizontal transmission of gut microbiota between experimental mice and to reduce non-specific variability within PP lymphocytes. Additionally, use littermate controls of the same gender to minimize variability.\n2. Surgical Excision and Tissue Preparation Steps:\nSurgical removal of the Small Intestine (SI)\n\t\nEuthanize mice using CO2 asphyxiation or any equivalent method approved by the institutional animal ethics committee.\nTransfer the mouse to a dedicated area for surgical excision. Place backside down and sanitize the abdomen with 70% ethanol. Perform a laparotomy by cutting the abdominal skin and peritoneum along the midline from pubis to the rib cage thus opening the peritoneal cavity.\n\t\tNOTE: Perform the first incision on a relatively small area of the skin to avoid penetrating the peritoneal cavity and damaging intestinal tissue. Continue the excision until desired anatomical border.\nIdentify the caecum, which is an ideal landmark for the detection of the terminal ileum, which constitutes the distal segment of the small intestine.\n\t\tNOTE: Caecum is usually located on the lower left side of the mouse abdomen.\nPinpoint ileocaecal junction and make a cut at this level as distal as possible to separate the small intestine from the caecum. Throughout the next steps, avoid excessive physical contact with the intestinal wall because fragile PPs collapse easily upon touch.\nGently remove the entire small intestine until the pyloric sphincter by cutting the mesentery using scissors. Identify the junction between pylorus and duodenum, and snip the duodenum at this level, which will lead to complete detachment of small intestine from the abdominal cavity.",
    "NOTE: (i) Avoid hyperextension as this might cause the rupture of the intestinal wall. (ii) If LP lymphocyte isolation is desired in addition to PP lymphocytes, complete removal of the mesenteric fat is necessary. However, for PP isolation only, remaining mesenteric fat could provide some benefits during the further isolation steps; therefore, it should be preserved.\nPlace detached small intestines in a 6-well plate filled with cold RPMI + 10% fetal bovine serum (FBS) and gently agitate the tissues manually until all intestinal segments are submerged in the cold media. Maintain the tissues on ice throughout the next steps.\nAfter dissecting the desired number of mouse small intestines, proceed to PP excision from collected small intestines.\nSurgical Excision of PPs and Preparation of Single Cell Suspension:\n\t\nGently transfer the small intestine on a paper towel by gripping the mesenteric fat using forceps and place the mesenteric side facing the paper towel. Moisten the entire intestinal segment with cold RPMI + 10% FBS to avoid tissue dehydration and stickiness.\n\t\tNOTE: Remaining mesenteric fat can be helpful at this stage because fat tissue segments on the mesenteric site of SI will stick to the paper towel keeping the anti-mesenteric site facing up.\nIdentify the PPs, which appear as white multi-lobulated aggregates in a “cauliflower-like” shape on the anti-mesenteric side of the intestinal wall.\n\t\tNOTE: Flushing out the luminal content is not recommended until all PPs are excised. Emptying the luminal content might cause the collapse of the PPs and will prevent the color contrast between PPs and the intestinal wall, which is very helpful for visual identification of PPs.\nAfter identifying PPs on the anti-mesenteric side, place the surgical curved-end scissor on PPs (curve should face up) restraining the PP from its distal and proximal border.",
    "Optional: Push the PP gently toward the blades of scissor using a fingertip. This maneuver will lead to the better exclusion of surrounding non-PP tissue. Excise the PPs gently, excluding the surrounding intestinal tissue.\n\t\tNOTE: (i) This step is crucial to obtain maximal PP cell yield while minimizing the cell contamination from neighboring intestinal compartments such as LP and intestinal epithelium, which are also rich in T cells. (ii) From one SI excised from C57BL/6 mouse, 5-10 PPs (average size, multi-lobulated) can be collected. By aiming even smaller PPs (not multi-lobulated), collection of up to 12-13 PPs per mouse (C57BL/6) is possible using this protocol.\nTransfer the excised PPs to a 12-well tissue culture plate filled with ice-cold RPMI + 10% FBS and maintained on ice using forceps or curved surgical scissors.\n\t\tNOTE: (i) Immediately after excision of PPs, mucus and intestinal content on the PP surface can be cleaned by rubbing the tissue gently on a paper towel. This step will help improve the viability of PP lymphocytes. (ii) Instead of transferring the PPs to a plate, transferring to separated tubes can also be considered depending on total sample number.\nOptional: When PP excision and subsequent placement into the well plate are completed, the number and size of PPs collected from different experimental/mouse groups can be documented by taking a picture of the tissue culture plate containing PPs.",
    "Prepare a set of 50 mL conical tubes filled with 25 mL of RPMI + 10% FBS (pre-warmed at 37 °C). Using a pair of scissors, cut the edge of a 1,000 µL tip from the distance that will allow the aspiration of the PPs with 1 mL pipette. Aspirate the PPs with 1 mL pipette and transfer them from the 12-well tissue culture plate to the prepared 50 mL conical tubes.\n\t\tNOTE: Use a new tip for each mouse sample to avoid cross-contamination among the samples.\nSecure the lid and place the tubes vertically in an orbital shaker at 37 °C, with continuous agitation at 125–150 rpm for 10 min. Meanwhile, prepare a new set of 50 mL tubes and place a 40 µm cell strainer on the top of each tube, through which single cell suspension will be prepared.\n\t\tNOTE: (i) The agitation step will remove the remaining intestinal content, mucus and cell debris, which decrease the cell viability and recovery of PP lymphocytes if not removed. (ii) Do not apply any kind of digestive enzymes on PP tissue because the digestion process causes a dramatic loss of CXCR5 expression from the cell surface.\nAfter the agitation, transfer the PPs to the 40 µm cell strainer placed on the top of the newly prepared conical 50 mL tubes. Using the rounded side of a 10 mL syringe plunger, gently disrupt the PPs through the cell strainer to generate single cell suspension. Rinse the strainer with 15–20 mL of cold RPMI + 10 % FBS.\n\t\tNOTE: (i) Before filtering, shake the tubes containing the PPs horizontally. This short shake will facilitate the transfer of PPs into cell strainers. (ii) Using a 70 µm cell strainer for the isolation of non-lymphoid immune cells (e.g., monocytes, macrophages, DCs) is recommended.",
    "Centrifuge the single cell suspensions at 350–400 x g for 10 min at 4 °C.\nCarefully discard the supernatant and resuspend the cells at a concentration of 10 x 106 cells/mL. Count the cells using a hemocytometer.\n\t\tNOTE: (i) Prior to cell counting, the total cell number for each mouse PP group can be approximately estimated using the following formula: “0.5-1 x 106 cells x (number of PPs) = total cell count”. Further dilutions with trypan blue for cell counting might be necessary. (ii) As an alternative to manual counting, automated cell counters can be used.\nTransfer 2-2.5 x 106 cells in appropriate volume (e.g., 200 µL) into a 96-well round-bottom plate.\n\t\tNOTE: For single color and negative control samples, 0.5-1 x 106 cells might be sufficient.\nCentrifuge the plate at 350 x g for 5 min at 4 °C. Flick the plate.\nWash the cells in 200 µL of Staining Buffer.\n3. Surface Antibody Staining\nViability Staining:\n\t\nAfter the final wash, resuspend the cells in 100 μL of fixable viability dye diluted in PBS (1:1,000). Incubate for 30 min on ice or at 4 °C in the dark.\n\t\tNOTE: (i) Intracellular staining for the detection of key transcription factors such as Foxp3 or Bcl-6 requires fixation of the cells. In that case, non-fixable viability dyes (e.g., 7-AAD, DAPI) cannot be used. (ii) To dilute fixable viability dye, do not use any staining buffer that contains protein. The media used in this step must be protein-free. (iii) Exclusion of dead cells by using viability staining is crucial because dead cells can cause serious technical difficulties in flow cytometry analysis by emitting autofluorescence and by binding surface antibodies nonspecifically, which might lead to false positive results.",
    "Wash the cells twice with staining buffer. Centrifuge at 350 x g for 5 min at 4 °C. Flick the plate.\nFc Block and Surface -Layer I:\n\t\nPrepare the Fc-block solution by diluting anti-CD16/32 antibody (1:200) in staining buffer.\nResuspend the cells in 20 μL of prepared Fc-block solution. Incubate for 15 min on ice.\nWithout washing, add 80 μL of surface antibody cocktail (see Table 1 for the antibody summary) prepared at appropriate dilutions. Incubate on ice for at least 30 min.\nWash twice by adding excessive staining buffer. Centrifuge at 350 x g for 5 min at 4 °C. Flick the plate.\nSurface -Layer II:\n\t\nPrepare Streptavidin staining solution by diluting fluorochrome-conjugated Streptavidin in staining buffer.\nAfter the final wash, resuspend the cells with 100 μL of pre-diluted Streptavidin (1:100) staining solution. Incubate for at least 15 min on ice in the dark.\nWash twice with staining buffer. Centrifuge at 350 x g for 5 min at 4°C. Flick the plate.\n\t\tOptional: If intracellular staining for follicular regulatory T cell detection is not desired, after the last wash, resuspend the cells in 200 μL of staining buffer and transfer into appropriate tubes to acquire data in flow cytometer. When the samples are not fixed, acquisition of data by flow cytometry should be performed within 3–4 h to obtain accurate results.\n4. Cell Fixation\nPrepare fixation/permeabilization (Fix/Perm) working solution using the reagents from Foxp3/Transcription Factor Staining Buffer Set. Mix one-part of fixation/permeabilization concentrate with three parts of fixation/permeabilization diluent to the desired final volume.\nAfter the final wash, resuspend the cells in 200 μL of Fix/Perm working solution.\nIncubate the plate on ice or at 4 °C for 20 min. Do not exceed 20 min for this step. Longer incubation time might severely decrease the cell recovery.",
    "Centrifuge at 350 x g for 5 min at 4 °C. Flick the plate. (Optional) After this step, fixed cells can be stored for several days at 4 °C in staining buffer containing bovine serum albumin (BSA) or FBS until subsequent intracellular staining or flow cytometry acquisition.\nResuspend the cells in 200 μL of permeabilization Buffer (x1) freshly pre-diluted in purified deionized water.\nCentrifuge at 350 x g for 5 min at room temperature (RT).\nWash once with 200 μL of permeabilization buffer and centrifuge at 350 x g for 5 min at RT.\n5. Intracellular Staining\nPrepare the Fc-block solution by diluting anti-CD16/32 antibody (1:200) in permeabilization buffer.\n\tNOTE: After the fixation step, the cells must be maintained in permeabilization buffer until the end of the intracellular staining process.\nAfter the final wash, resuspend the cells in 20 μL of Fc-block solution. Incubate for 10–15 min at RT in the dark.\nWithout washing, add 80 μL of intracellular antibody cocktail (100 μL final volume) pre-diluted in permeabilization buffer. Incubate for 30 min at RT.\nAdd 100 μL of Perm Buffer, and centrifuge at 350 x g for 5 min at RT.\nWash once with 200 μL of permeabilization buffer, centrifuge at 350 x g for 5 min at RT.\nAfter the final wash, resuspend the cells in 200 μL of staining buffer and transfer the cells into appropriate tubes (final volume of 400 μL in staining buffer) and acquire data by flow cytometry. Samples stained in 96-well plate may also be run without transferring into tubes if a flow cytometer with plate reader option is available. This step minimizes cell loss during cell transferring.",
    "Acquire a minimum of 5 x 105 total cells on the flow cytometer to be able to perform reproducible analysis of TFH, TFR as well as GC B cells.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}