{
  "id": 17529,
  "origin_website": "Jove",
  "title": "Use of a Percutaneous Ventricular Assist Device/Left Atrium to Femoral Artery Bypass System for Cardiogenic Shock",
  "procedures": [
    "This procedure and protocol have been approved by the institutional review board and the United States Food and Drug Administration (FDA).\n1. Patient criteria\nInclude patients with CS stage B and above as defined by the SCAI consensus statement1.\nInclude as bridge to transplant or durable left ventricular assist system in stage D heart failure.\nInclude as bridge to recovery in AMI complicated by CS.\nExclude contra-indication to systemic anticoagulation.\nExclude life-expectancy <6 months (active malignancy).\nExclude if there is the presence of LA thrombus.\nExclude if patients have peripheral vascular disease (PVD) with small arteries that cannot accommodate the large cannulas.\nExclude if patients have an irreversible neurological injury/coma.\nExclude if patients have severe aortic insufficiency (AI).\nExclude if patients have a ventricular septal defect (VSD).\n\tNOTE: The placement of the LAFAB device includes three separate processes: 1) setting up the controller and the pump; 2) placement of arterial and venous cannulas and transeptal access under transesophageal echocardiogram (TEE) or intracardiac echocardiogram (ICE); and 3) connecting the system to the circuit.\n2. Placement of the left atrium to femoral artery bypass device\nSetting up the controller\n\tNOTE: This step can be performed as the patient is being transported to the lab and the table is being set up for the procedure. Usually, the device representative and perfusionist team is present to assist with the process.\n\t\nOpen the box and initiate the controller setup with the following steps.\nPrior to powering on the controller, place 2 batteries in the controller by opening the battery door. Insert each battery by placing the logo facing away from the controller screen. The groove on the battery should align with the key battery housing. Make sure that the batteries are well seated.\nInstall the other 2 batteries in the dock following the same process.",
    "Attach the controller to the dock, verify it is fully seated on the dock and connect the power cord to the power outlet and plug it in to the wall socket for AC power. The controller can operate in the dock connected to AC power or when separated from the dock, it can operate using battery power.\nMount the dock and controller on an intravenous pole using the clamp.\nTurn on the controller using the buttons on the side.\nSetting up the pump – Priming the system\n\tNOTE: Pump priming requires two people — the primary operator is scrubbed (sterile operator) and stays in the sterile field. The secondary operator (non-sterile operator) handles the controller in the non-sterile field. Pump de-airing is a crucial step and needs to be performed very carefully.\n\t\nHave the secondary operator open the package and present the priming tray to the primary operator. Have the primary operator then open the sterile drape and lay out the components of the priming tray on the sterile table. The pump, oxygenator and green oxygen tubing are included in the tray.\nHave the primary operator hand the pump driveline to the secondary operator who then plugs it to the controller.\nHave the sterile operator remove the protective caps on the tubing and inserts the ends to the basin. The blue tubing is the inflow tubing which goes into the blue port. The red tubing is the outflow tubing which goes into the red port of the basin.\nPlace the basin in the fill ready position tilted back and away from the blue port.\nHave the secondary operator fill the basin with 4 liters of saline.\nHave the primary operator lift the basin and tilt it back to prime ready position to gravity prime the pump.",
    "Make sure that all the air has been removed from the tubing and the pump. Gently tap the tubing and the pump to remove any small air bubbles. This is a crucial step.\nThen turn on the pump from the non-sterile end.\nRemove any tiny air bubbles in the oxygenator by gently tapping the oxygenator and positioning the outflow tubing at a higher level (12 o’clock position) for the air bubbles to rise above and escape out.\nStop the pump once all the air bubbles are removed.\nClamp the inflow and outflow tubing. Remove the inflow and outflow tubing from the basin and then attach the green oxygen supply tubing to the gas in port on the oxygenator. The circuit is now ready.\nTransseptal access10,32  \n\t\nPrepare and drape the patient in a sterile manner.\nPerform the procedure under general anesthesia with the anesthesia team.\nOnce the patient is intubated and sedated adequately, pass the TEE probe into the esophagus and obtain the basic images. If using ICE, then obtain the images after venous access.\nIdentify the ideal spot for septostomy on the inter-atrial septum (IAS) using TEE or ICE. Use the bicaval view on TEE showing the membranous part of the IAS at the region of the fossa ovalis to expose the IAS better.\nConfirm the absence of any thrombus in the LA where the inflow cannula will be positioned using TEE or ICE.\nObtain femoral venous access via ultrasound guidance with modified Seldinger technique and insert an 0.035” guidewire",
    "Advance the guidewire to the inferior vena cava (IVC) – right atrial junction and then direct it towards the IAS under fluoroscopic and TEE or ICE guidance. Using multiple angiographic projections (Right or Left Anterior Oblique), identify the optimal site for transeptal puncture. Ideally, it should be done in the region of the foramen ovale to minimize complications.  In patients with thick or aneurysmal septa or an IAS which has been previously patched or instrumented surgically or closed percutaneously, one may consider use of an energized or radiofrequency transseptal needle to insure precise puncture without needle deflection.\nAnticoagulate the patient (ACT more than 250 seconds). Perform transseptal puncture using a transseptal needle, insert guidewire to the LA.\nDilate the venous access and the IAS with a 2-stage dilator. Insert the transseptal cannula and advance it into LA, remove introducer and guidewire, wait for back-bleed, and clamp. Secure cannula to the patient.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62140/62140fig2v2.jpg\nFigure 2: TEE with biplane in the bicaval view showing the SVC to the right, the interatrial septum horizontal in the middle with the left atrium above and the right atrium below, and the IVC towards the left. (A) - Guidewire passing into the SVC. (B) - Sheath passing over the wire into the SVC. (C) - Transseptal needle passing through the sheath. (D) - Transseptal needle tenting the interatrial septum. (E) - Sheath passing through the interatrial septum into the left atrium, after the needle has been withdrawn. Picture courtesy47 \nSVC – Superior Vena Cava, IVC – Inferior Vena Cava, RA – Right Atrium, LA – Left Atrium \nimgsrc://cloudfront.jove.com/files/ftp_upload/62140/62140fig3v2.jpg",
    "Figure 3: ICE for transeptal access ICE guided trans septal access showing inter-atrial septum and fossa ovalis (FO) in (A), septal tenting as the needle engages in (B), loss of tenting as the needle crosses in (C), transseptal sheath in the left atrium in D. Picture courtesy48 .\nRA – Right Atrium, LA – Left Atrium, FO – Foramen Ovale\nArterial access\nObtain femoral arterial access via the modified Seldinger technique using ultrasound and angiographic guidance at the level of the femoral head. Insert an 0.035” guidewire.\nConsider use of “pre-closure” technique using the variously commercially available vascular access closure devices prior to upsizing arterial access.\nSerially dilate the arterial access site appropriate to the size of the arterial cannula selected. Insert the arterial cannula, remove the introducer and guidewire, wait for back-bleed, and then clamp. Secure the cannula to the patient using the holders.\nConnecting the components \nMake wet-to-wet connections to the cannulas to avoid introduction of any air bubbles in the circuit. This is a crucial step.\nUse saline immersion or constant infusion of saline (“waterfall”) over the two ends of the cannulas as they are being connected.\nConnect the transseptal cannula (venous) to the pump inlet which is marked in blue and the arterial cannula to the pump outlet which is marked in red.\nFirst, remove the venous clamps and start the pump (from the controller box). Then release the other clamps sequentially, constantly checking for any air, releasing the arterial clamp last.\nAdjust pump speed (by adjusting the RPMs) to optimize flow. Confirm the position of the cannula under fluoroscopy and TEE or ICE and secure the circuit to patient.",
    "Maintain therapeutic anticoagulation (activated clotting time ACT at 180–220s or activated partial thromboplastin time aPTT at 65–80s) for as long as the pump is in place to prevent pump thrombosis and stroke. This is a crucial step.\n3. Right Atrium to Pulmonary Artery Bypass (RAPAB) system placement\nInitiate the controller, prime the lower chamber of the pump and check for any air bubbles - same steps described as above.\nPrime the upper chamber of the pump, check for any air and clamp it - same steps described as above.\nPatient procedure\n\t\nObtain venous access at the right internal jugular (RIJ) vein via modified Seldinger technique under ultrasound guidance.\nInsert a Pulmonary Artery (PA) Catheter with a 0.035\" lumen and advance it to the main PA just before the bifurcation. Insert a stiff-bodied 0.035\" guidewire and remove the PA Catheter.\nAnticoagulate the patient (ACT > 250 s).\nDilate the venous access site sequentially using the stepwise dilators provided in the package until the desired size is reached (29 French or 31 French).\nInsert the venous cannula (e.g., ProtekDuo) over the guidewire.\nRemove the guidewire, wait for back-bleed, and then clamp the distal port which is marked as \"Distal.\"\nRemove the hemostasis cap, wait for back-bleed, and clamp the proximal port which is marked as \"Proximal.\" Secure the cannula to patient via sutures.\nVerify the cannulas and make wet-to-wet connections from the pump to the cannula.\nConnect the proximal cannula to the pump inlet which is marked in blue and the distal cannula to the pump outlet which is marked in red. Turn on the pump (from the controller).\nRelease clamps sequentially, constantly checking for any air bubbles. Adjust pump speed (by controlling the RPMs) to optimize flow.",
    "Confirm cannula position under fluoroscopy (may use TEE guidance to confirm position in the main PA) and secure the circuit to patient. Maintain therapeutic anticoagulation (ACT at 180-220 s; aPTT at 65-80 s).\n4. Device removal\nNOTE: Once the patient's end organ function has improved and hemodynamics have stayed stable with either LV recovery or advanced therapies such as durable LVAD placement/transplant, the device can be removed.\nBefore removing the device, slowly turn down the speed by 0.5 L/min in a stepwise manner, carefully observing the hemodynamics to make sure there is adequate CO and normal filling pressures with less support (also known as the ramp down or turn down study).\nTurn off the pump once the turndown study is successful.\nMake sure the ACT is < 150 seconds before removing the arterial cannula. Tighten the previously placed intravascular suture to occlude the arteriotomy site or manual pressure can be held for at least 40 minutes to ensure hemostasis.\nWithdraw the transseptal cannula into the IVC and remove it slowly from the femoral vein. Apply a figure of 8 suture to the venous site and additionally, hold manual pressure over the site to achieve hemostasis.\n\tNOTE: The atrial septal defect (ASD) is usually small and is not closed routinely.\nPost procedure, perform continuous monitoring of patient's hemodynamics and end organ function to ensure stability.\nRemoval of RAPAB.\n\t\nSimilar to the LAFAB removal, when the patient's end-organ function has stabilized with recovery or advanced therapies, slowly turn down the pump by 0.5 L/min, carefully observing the hemodynamics.\nTurn off the pump when turn-down study is successful.",
    "Once ACT is < 150 seconds, remove the venous cannula from the neck and place a figure of 8 suture to secure the puncture site. Hold manual pressure in addition to the suture to achieve complete hemostasis.\nPost removal, closely monitor patient's hemodynamics and end-organ function to ensure stability.\ntable:\n﻿0,1,2,3,4\nComplication,Risk factors,Timing of occurrence,Precaution,Management\nCardiac perforation and tamponade,Inadvertent advancement of needle or dilator or sheath along the posterior free wall of left atrium.,\"During transseptal puncture, placement of inflow cannula\",Accurate assessment of inter-atrial septum on TEE or ICE and optimizing the site and angle of transseptal puncture via angiography and echo.,Immediate pericardiocentesis to relieve tamponade. May need surgical intervention.\nAcute limb ischemia distal to arterial cannulation,\"Small caliber vessels housing large cannulas, pre-existing peripheral arterial disease\",Immediately post procedure,Peripheral angiogram prior to cannulation.,\"Placement of distal perfusion catheter, vascular surgery assistance in severe cases.\"\n\"Hemolysis, retroperitoneal bleeding, vascular complications such as pseudoaneurysm formation.\",\"Higher pump speeds, pump thrombosis, DIC, anticoagulation\",Anytime on the pump,Optimize pump speed for every patient individually. Avoid supratherapeutic anticoagulation.,\"Reducing pump speed, maintaining therapeutic range of anticoagulation.\"\n\"Hemolysis, retroperitoneal bleeding, vascular complications such as pseudoaneurysm formation.\",\"Higher pump speeds, pump thrombosis, DIC, anticoagulation\",Anytime on the pump,Optimal site of arterial access at the femoral head in the common femoral artery.,\"Reducing pump speed, maintaining therapeutic range of anticoagulation.\"\nResidual atrial septal defect,Multiple attempts for transseptal access,After decannulation,,Hemodynamically significant defects can be closed percutaneously.\nTable 1: Complications of LAFAB device33.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}