{
  "id": 10733,
  "origin_website": "Jove",
  "title": "Design and Implementation of an Automated Illuminating, Culturing, and Sampling System for Microbial Optogenetic Applications",
  "procedures": [
    "imgsrc://cloudfront.jove.com/files/ftp_upload/54894/54894fig1.jpg\nFigure 1: The continuous culturing apparatus. This simplified diagram shows how the apparatus should be assembled when it is used to culture, illuminate, and measure optical properties of the microbes. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/54894/54894fig1large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/54894/54894fig2.jpg\nFigure 2: Overview of the protocol. The steps in the shaded region must be repeated every time the protocol is used. Closed loop control is possible34, but is not implemented in this protocol.\n1. Assemble the Thermometer to the Circuit Board\nimgsrc://cloudfront.jove.com/files/ftp_upload/54894/54894fig3.jpg\nFigure 3: Connections to read thermometer values. This diagram shows how the digital thermometer should be connected to the PCB so that the microcontroller can get feedback to control the temperature of the culture. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/54894/54894fig3large.jpg]\nSolder the Ground, Data, and positive Voltage lines of the digital thermometer to their respective through-holes marked \"G D +V.\"\nClip off one pin from a female 3-pin header and trim the remaining 2 pins with wire clippers, such that it can fit into the two through-holes labelled \"R2\" and not obstruct the microcontroller. Solder this in place. Connect the two soldered pins by inserting a 4.7 kΩ resistor in the pin header.\n2. Connect the Power Control Components to the Circuit Board\nimgsrc://cloudfront.jove.com/files/ftp_upload/54894/54894fig4.jpg\nFigure 4: Connections to control power to the heating pad. This diagram shows how the PCB and accessory parts should be assembled in order to control power to the heating pad. The parts to control the peristaltic pumps are connected in a similar manner. Note that the components for the thermometer have been removed for clarity. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/54894/54894fig4large.jpg]",
    "Trim off 1 cm from the pins of five female 3-pin headers. Solder these to the positions on the printed circuit board (PCB) marked as \"#1,\" \"#2,\" \"#3,\" \"#4,\" and \"C B E.\"\nTrim off 1 cm from the pins of a female 6-pin and 8-pin header. Solder these side by side to the column of through-holes labeled K1 through K14.\nConnect the heating pad to the circuit board.\nInsert the ends of a 100 kΩ resistor in the through-holes labeled K1 and K2 on the PCB. Insert a metal-oxide-semiconductor field-effect transistor (MOSFET) into the position marked #1 on the PCB, with the label of the MOSFET facing towards the K1 through K14 through-holes so that the source pin is closest to the \"#\" label, and the drain pin is furthest from the \"#\" label.\nCut the ground line of the 5 V direct current (DC) power supply cable and connect it to J2. Connect the ground line of the heating pad to J1. Connect K3 to pin 3 with a 1 kΩ resistor. Current should now only flow from J1 to J2 when pin 3 is set to +5V.z\n\t\tNOTE: The resistor/MOSFET set functions as a switch that allows current to flow from pin J1 to J2 when pin 3 of the microcontroller is set to +5 V.\nConnect the slow peristaltic pump.\nInsert the ends of a 100 kΩ resistor in the through-holes labeled K4 and K5 on the PCB. Insert a MOSFET into the position marked #2 on the PCB, with the label of the MOSFET facing towards the K1 through K14 through-holes so that the source pin is closest to the \"#\" label, and the drain pin is furthest from the \"#\" label.",
    "Cut the ground line of the 12 V DC power supply cable of the slow peristaltic pump. Connect the peristaltic pump facing end to J3 and the wall wart facing end to J4. Connect K6 to pin 4 with a 1 kΩ resistor. Current should now only flow from J3 to J4 when pin 4 is set to +5 V.\nConnect the fast peristaltic pump\nInsert the ends of a 100 kΩ resistor in the through-holes labeled K7 and K9 on the PCB. Insert a MOSFET into the position marked #3 on the PCB, with the label of the MOSFET facing towards the K1 through K14 through-holes so that the source pin is closest to the \"#\" label, and the drain pin is furthest from the \"#\" label.\nCut the ground line of the 12 V DC power supply cable of the fast peristaltic pump. Connect the peristaltic pump facing end to J5 and the wall wart facing end to J6. Connect K9 to pin 5 with a 1 kΩ resistor. Current should now only flow from J5 to J6 when pin 5 is set to +5 V.\n3. Connect the LED Matrix to the Circuit Board\nimgsrc://cloudfront.jove.com/files/ftp_upload/54894/54894fig5.jpg\nFigure 5: Connections to control the LED matrix. This diagram shows how the LED matrix should be connected to the PCB. It also shows that the PCB can be stacked on the microcontroller. Note that the components for the thermometer and for controlling DC power to other devices have been removed for clarity. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/54894/54894fig5large.jpg]\nSolder the 6-pin, 10-pin, and the two 8-pin female pin headers into the through-holes on the sides of the PCB such that it can be stacked on top of the microcontroller.",
    "Solder the 100 nF and the 10 µF capacitors to their marked positions on the PCB, noting that the negative terminal of the 10 µF capacitor (shorter lead) should be connected to the through-hole marked with a negative sign.\nSolder the LED driver to the 2 by 12 set of through-holes, with the indentation on the driver far from the through-holes reserved for the LED matrix.\nSolder 2 columns of male pin headers to the through-holes marked for the LED matrix, and trim the ends of these underneath the breadboard such that they will not obstruct the microcontroller. Connect these to two 8-wire strips of female/female jumper wires. Connect a second set of male pin headers to the other end of the jumper wires.\nInsert the LED matrix over the median of the breadboard, and then insert the second set of pin headers to the columns on either side of the matrix. Ensure that the electrical connections are the same as if the LED matrix had been directly connected to the PCB with the labeled side of the matrix corresponding to the labeled column of through-holes.\nClip off one pin from a female 3-pin header and trim the remaining 2 pins with wire clippers, such that it can fit into the two through-holes labelled \"R1\" and not obstruct the microcontroller. Solder this. Connect the two soldered pins by inserting a 1 kΩ resistor in the pin header.\n\tNote: The culturing vessel will be stacked over the LED matrix. If the wire ribbons obstruct the vessel, offset them from the matrix. Then, use solid core wire to bridge the gap between the matrix pins and the wire ribbon pins, such that the electrical connections do not change.\n4. Install Software and Connect to Hardware\nStack the PCB on the microcontroller.",
    "Follow the links in the materials list to download the Integrated Development Environment (IDE) and custom code for the microcontroller.\nConnect the microcontroller to the microscope computer via an A-B universal serial bus (USB) cable. Compile and upload the custom code to the microcontroller.\nDownload Micro-Manager21,22 and FIJI23. Configure Micro-Manager as a FIJI plugin by copying all \".dll\" files, the \"mmplugins\" directory, and the \"mmautofocus\" directory from the directory where Micro-Manager was downloaded into the \"Fiji.app\" directory. Also, copy the \"plugins/Micro-Manager\" directory into the \"Fiji.app/plugins\" directory.\nDownload the \"BioreactorController.jar\" file into the \"Fiji.app/mmplugins\" directory.\nOpen Micro-Manager from FIJI> Plugins> Micro-Manager> Micro-Manager Studio. Use the Hardware Configuration Wizard to configure the software to control the microscope. Include the \"FreeSerialPort\" device in the Wizard with the label of the port to which the A-B USB cable is connected.\n5. Make and Characterize the Light-proof Enclosure for the Culturing Vessel\nStack three 8 pin IC sockets as building blocks on the breadboard at each corner of the LED matrix such that the culturing vessel can rest on them above the matrix.\nFasten a portion of diffusion paper under the top layer of the sockets, such that the light striking the culturing vessel from the LED matrix is diffuse.\nCut out three 8\" by 6\" portions of black foam. Cut out a portion that is the same size as the electronic breadboard (2.3\" x 3.5\") from the inside of the first two and a portion that is the size of the rectangle made by the IC sockets (0.9\" x 1.8\") from the inside of the third. Stack these layers over the LED matrix such that the final layer containing the 0.9\" x 1.8\" aperture lies even with the top of the IC sockets, and surrounds the LED matrix.",
    "Cut an additional sheet of black foam in half to make a 6\" by 24\" rectangle. Roll this into a hollow column of black foam that the culturing vessel can fit into with room for tubes and wires, such that it will thermally and optically insulate the culturing vessel.\nCenter the hollow column of black foam over the LED matrix, and mark the boundary of the column on the layer of black foam under it. This boundary will mark where it should be centered in the future.\nCut out a 3\" x 3\" portion of black foam. Use this later as a lid that can be taped to the top of the column to block external light.\nAttach the photodiode power sensor to the culturing vessel's cap with tape, attach the cap, and insert the culturing vessel in the enclosure.\nIn Micro-Manager, go to Plugins> Bioreactor Controller. Set the matrix to illuminate at a subset of the range of possible intensities at 30 s intervals.\nRecord the light intensities as displayed on the power meter console connected to the power sensor. These measurements will enable the actual intensity of light to be known when the number of LEDs that are lit and the pulse-width-modulated (PWM) current to those LEDs is set.\n6. Prepare the Culturing Vessel\nimgsrc://cloudfront.jove.com/files/ftp_upload/54894/54894fig6.jpg\nFigure 6: Vessel connections. This diagram shows how the vessel and tubing of the apparatus should be connected prior to being autoclaved. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/54894/54894fig6large.jpg]",
    "Mark the height corresponding to every 2 mL increment of liquid in the range of 10 mL to 30 mL in the culturing vessel. Insert 10 mL of sterile deionized water, mark the water level, add 2 mL, mark the water level, and repeat until the 30 mL level is marked. Cover the markings with clear tape so that they are not easily removed, and dispose of the liquid.\nPlace the long end of the aluminum port through the silicone gasket, into the culturing vessel. Screw on the cap.\nCover one short aluminum port outlet with 1/16\" ID silicon tubing. Plug the distal end by inserting a female luer lock and then connecting a male luer lock plug. This outlet is supplementary, and will not be used (tube 6 in Figure 6).\nConnect two short segments of 1/16\" ID silicone tubing with male and female luer locks. Connect one end to a short aluminum port outlet and plug the distal end with a male luer and female luer lock plug. The vessel will be inoculated through this tube (tube 7/7.1 in Figure 6).\nConnect two 1/16\" ID tubes to the ends of the 1/16\" ID peristaltic tubing and connectors. Connect one end to a short aluminum port and plug the other (tube 4 in Figure 6). Later, this will be connected to the media flask.\n7. Prepare the Media Flask\nConnect a 1/16\" inner diameter (ID) silicone tube to the longest aluminum port. The tube should be long enough to reach the media flask. Connect a 1/8\" ID male luer lock to a short segment of 1/16\" ID tubing, connect this to the preceding tube,, and then insert this short segment into the rubber stopper on the media flask (tube 3 in Figure 6).",
    "Clamp the tube. This connection allows air to flow from the media flask to the culture vessel. When the media flask is later pumped with air and this tube is unclamped, the culture will be mixed, aerated, and kept at a positive pressure by the incoming bubbles.\nInsert a 1/16\" ID tube long enough to reach the bottom of the flask into the stopper, through which media will be transferred. Connect another 1/16\" ID tube to this one, and then a 3/16\" ID tube to that. Plug this with a 3/16\" ID female luer lock and a male luer lock plug (tube 1/1.1 in Figure 6).\nThe third hole in the stopper should be filled with a short segment of 1/16\" ID tubing, connected to two other segments of medium diameter tubing and plugged at the distal end (tube 2/2.1 in Figure 6). This will be connected to a vacuum pump and later to an aquarium pump.\n\tNOTE: If the tubing cannot easily fit through the holes in the rubber stopper, cut the ends of the tubing at a slant. Then, the slanted end which is pushed through the hole can be used to pull the rest through.\n8. Prepare the Effluent Flask\nInsert a male luer lock into a segment of 1/16\" ID silicone tubing, and then firmly insert 0.022\" ID polytetrafluoroethylene (PTFE) tubing. Separately, attach a female luer lock to a 1/16\" ID tube. Then, thread one end along the PTFE tube to connect the locks and the other to a short aluminum port (tube 5 in Figure 6).",
    "Connect the exposed 1/50\" ID silicone tube to the 1/50\" ID peristaltic tube and connectors. To this, connect three segments of 1/50\" ID tubing and two segments of 0.022\" ID PTFE tubing, alternating them. Connect this to the effluent flask via 1/16\" ID tubing (tube 5 in Figure 6).\nConnect one end of a 1/16\" ID silicone tube to the second longest tube of the aluminum port and the other end to the effluent flask. This aluminum tube sets the culture volume, and excess culture overflows into the effluent container (tube 8 in Figure 6).\nAutoclave the culturing assembly at 121 °C and 15 psi (general sterilization) for 30 min.\n\tNote: The tubes through which the media flask is filled, through which the media flask is vacuumed, and through which the culturing vessel is inoculated have multiple segments of tubing so that if the distal segment is contaminated, it can be removed to reveal a sterile segment.\n9. Prepare the Microfluidic Channel\nMix polydimethylsiloxane (PDMS) and curing agent in a 9:1 ratio. Degas and pour onto the silicon master mold.\nCure the PDMS for 2 h at 65 °C and then cut it from the mask with a razor blade. Cut around the PDMS until it releases from the mold. Avoid pushing down and breaking the fragile wafer.\nUse a 1.2 mm ID biopsy hole puncher to punch holes at both ends of the channel.\nPlasma bond the PDMS to the cover glass24.\nTape the long ends of the cover glass to the supporting aluminum frame such that the PDMS channel is centered on the aluminum frame, and then bake the PDMS again for 2 h at 65 °C.\n10. Fill the Media Flask\nimgsrc://cloudfront.jove.com/files/ftp_upload/54894/54894fig7.jpg",
    "Figure 7: Adding media. This diagram shows how media should be vacuum filtered into the media flask. It ensures that the media remains sterile. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/54894/54894fig7large.jpg]\nMake appropriate media. If the continuous culturing system will be operated as a chemostat, use media limited for a specific nutrient.\n\tNOTE: Examples of standard media composition for studies with S. cerevisiae have been previously published25,26,27,28,29.\nAttach the vacuum filter to a 100 ml bottle, remove the nipple cover, then remove the white plug from the nipple of the vacuum filter with sterile tweezers.\nConnect the 3/16\" ID silicone tube to the nipple, the media flask's other free tube to a vacuum pump (tubes 1 and 2 in Figure 7, respectively), and ensure that the tube connecting the media flask to the culturing vessel is clamped shut (tube 3 in Figure 7).\nFill the filter with media, turn on the vacuum pump, and then filter the rest of the media. Clamp the 1/16\" ID silicone tubing connected to the vacuum (tube 2 in Figure 7) and turn off the vacuum pump.\nRemove the leurs from the intermediate segment of 1/16\" ID tubing connected to the vacuum pump so that an uncontaminated end of the tube is accessible. Insert the blue end of a sterile syringe air filter into this tube.\nClamp the 3/16\" ID silicone tubing (tube 1 in Figure 7) and disconnect the male luer from it. Disconnect the plug from the female luer of the culturing vessel's media inlet tube. Connect these male and female luers to enable media to be pumped into the culturing vessel.\nRemove the vacuum filter and cap the 100 mL bottle of media which was attached to the vacuum filter.",
    "A day before the culturing vessel will be inoculated, inoculate a single colony of the optogenetic microbe in a test tube with 4 mL of the media collected in the previous step, and let it grow overnight at 30 °C or the culture's optimal temperature growth temperature with agitation.\n11. Assemble the Apparatus Around the Microscope\nSet the continuous culturing assembly near the microscope with the media flask higher than the culturing vessel and the effluent flask lower than the culturing vessel, such that the tube composed of segments of 0.022\" ID PTFE tubing (tube 5 in Figure 6) can reach the microscope stage. Securely tape down the rubber stoppers on the media flask and effluent container.\nUnplug the ends of the 0.022\" ID PTFE tubing from the 1/50\" ID silicone tube connecting them (tube 5 in Figure 6), and plug these ends into the inlet and outlet of the microfluidic device.\nConnect the white end of the syringe air filter to the aquarium pump. The air pressure will push media into the culturing vessel.\nWhen the media reaches the level of the effluent port, wrap the 1/16\" ID media inlet tubing and connectors around the slow peristaltic pump (tube 4 in Figure 6) and the 1/50\" ID sample outlet tubing and connectors around the fast peristaltic pump (tube 5 in Figure 6).\nAerate the media by unclamping the air tube between the media flask and culturing vessel.\nTape the heating pad and thermometer to the culturing vessel so that its temperature can be controlled. Coil the media tubing around the culturing vessel so the entering media will be at the same temperature as the vessel.",
    "NOTE: The PWM current to the heating pad is regulated by the microcontroller which uses inputs from the thermometer to keep the culturing vessel at its setpoint temperature.\nInsert the culturing vessel into the black foam enclosure over the LED matrix, and ensure that the tubes are not pinched.\nIn Micro-Manager, go to Plugins> Bioreactor Controller. Set the \"Media pump ratio on\" field to 0.1 and the \"Sample pump ratio on\" field to 0. The flow rate will be very low, but greater than the rate of evaporation.\nClamp the incoming air tube between the media flask and culturing vessel. Remove the plug from the inoculation tube (tube 7 in Figure 6), and inoculate the culturing vessel with 1 mL of starter culture via a serological pipette. Clamp and plug the distal end of this tube to ensure that contaminants do not enter the culturing vessel, then unclamp the incoming air tube.\nCover the enclosure so that no light enters, and let the culture grow overnight.\n12. Calibrate the Pumping Rates\nIn Micro-Manager, go to Plugins> Bioreactor Controller. Set the \"Media pump ratio on\" field to 0.5 and the \"Sample pump ratio on\" field to 0.\nDisconnect the overflow tube from the effluent flask (tube 8 in Figure 6) and the sampling tube from the effluent flask (tube 8 in Figure 6) and collect effluent in separate vessels. Collect effluent for 1 hr, beginning after the pumps have been on for 15 min.\nCalculate the flow rate of media into the culturing vessel from the volume collected in the vessel as:\nimgsrc://cloudfront.jove.com/files/ftp_upload/54894/54894eq1.jpg\nAdjust the value of the \"Media pump ratio on\" field by this linear estimate:\nimgsrc://cloudfront.jove.com/files/ftp_upload/54894/54894eq2.jpg\n\twhere\nimgsrc://cloudfront.jove.com/files/ftp_upload/54894/54894eq3.jpg",
    "Iterate through this calibration procedure until the difference between the desired flow rate and the measured flow rate is < 0.2 mL/h, where the flow rate is averaged over a 1 h period.\nIncrease the value of the \"sample ratio on\" field and calibrate it in a similar manner until roughly 4/5th of the volume leaving the culturing vessel is pumped out by the sampling pump and roughly 1/5th of the volume is leaving through the overflow port.\nLet the culture density in the continuous culturing apparatus equilibrate under these conditions overnight.\n\tNOTE: If the target flow rates cannot be reached, change the peristaltic pump tubing. Liquid is pumped at a higher rate when larger diameter tubing is used. Follow step 14 and then return to step 8.4.\n13. Collect Microscope Images of Cultured Microbes\nFill the Stage Position List in Micro-Manager with a set of non-overlapping positions at which images of cells pumped into the microfluidic channel will be in the focal plane.\nOpen the \"Bioreactor Controller\" plugin. Select the desired LED matrix time course, imaging channels, and other experimental settings from the prompts. Collect and analyze images.\nWhile the experiment runs, ensure that the media in the media flask remains clear. If it is cloudy, then it has been contaminated.\n14. Post-experiment\nDispose of media, excess cell culture and effluent.\nRefill the media flask with 200 mL of 20% EtOH mixed with deionized water. Run the chemostat as it had previously been run during the experiment to wash out cell debris and media.\nWhen the alcohol solution has drained from the media flask, disassemble the chemostat fully.\nWash glassware and tubes with warm water and mild detergent, and rinse thoroughly with deionized water. Leave to dry.",
    "Open the \"microcontrollerRecords.csv\" file to review the temperature and LED matrix status over the course of the experiment, the \"Summary.csv\" file to review the summary data from each set of images and the \"Results<n>.csv\" files to review data summarizing each ROI from each time period, where n is the nth data set.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}