{
  "id": 6108,
  "origin_website": "Bio",
  "title": "Polysome Preparation, RNA Isolation and Analysis",
  "procedures": [
    "Prepare neuroblastoma cell line SKN-SH cells 2.5-5 x 107/group, normally 2 to 3 150 cm2 flasks with 50 ml of RPMI-1640 medium.Before harvest, cells are incubated in complete RPMI-1640 medium (RPMI-1640 medium with FBS, Pen/Strep and Glutamine) containing a final concentration of 100 μg/ml CHX for 10 min at 37 °C.Discard medium andrinse cells twice with cold 10 ml 1x PBS containing 100 μg/ml CHX.Harvest cells, briefly add 7 ml of trypsin into each flask, incubate at 37 °C for 3 min, then collect cells with 10 ml PBS containing 100 μg/ml CHX (this step is not needed for suspension cells).After centrifugation, resuspend cells in 1 ml of 1x PBS, then transfer them into 1.7 ml micro centrifuge tube.Lyse cells with 1 ml PEB Buffer containing 1% Triton-X100, vortex 15 sec and keep on ice for 30 min.Centrifuge at 14,000 rpm for 30 min at 4 °C and collect supernatants that are ready to be loaded on sucrose gradients of 10%-50% consistency.Make sucrose solutions according to the recipe step.Make 10 ml gradient by adding 2.0 ml of each solution (50% on bottom, 10% on top) and load into ultracentrifuge tube.Add 1 ml of cell extract to the top of each gradient. Cover each tube with parafilm, put it in a SW41 rotor andspin samples at 38,000 rpm for 120 min at 4 °C.Collect 13 fractions from the top to the bottom of the tube using BR-188 density gradient fractionation system. Machine setting options: fraction collection time: 1 min and 15 sec/fraction; pump speed, 0.75 ml/min; chart speed, 60 cm/h).Keep all fractions at -80 °C, it’s good for extraction of RNA in 1 month.For RNA extraction, thaw all samples on ice.Pick 0.5 ml of each sample into a new 2 ml-microcentrifuge tube, keep on ice.",
    "Mix the water saturation Phenol/chloroform/isoamyl alcohol (25:24:1) completely.Add 500 μl of the mixed Phenol/chloroform/isoamyl alcohol into each tube, when pipetting keep shaking with hand to avoid water separating out.Vortex for 30 sec and then keep rotating at 4 °C for 5 min. Centrifuge at 14,000 rpm for 10 min at 4 °C, at the same time prepare new 2 ml-microcentrifuge tube for each sample, add 3 M Sodium Acetate (pH 5.2) 50 μl/tube.Very carefully pipet out all the aqueous phase and put it into the prepared fresh 2 ml-microcentrifuge tube.Then add 1.5 ml (3 volumes) of 100% ethanol, vortex 30 sec.Keep the samples at -80 °C for 3 h.Centrifuge at 14,000 rpm for 30 min at 4 °C.Wash pellet with cold 70% RNase free ethanol by rotating for 5 min.Centrifuge pellet at 14,000 rpm for 5 min at 4 °C.Discard supernatants and remain the pellet in the tubes.Put tubes on ice to let all the liquid evaporated.Add 30-50 μl of DNase/RNase free H2O and subjected to quantitated RT-PCR.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140926/20140926232848_6037.jpgFigure 1. MDM2 regulates MYCN translation. A. Representative polysomal profiles from control vector- and MDM2/166A-transfected SK-N-SH cells. The 254-nm traces obtained during collection of fractions are shown. B. Relative distributions of MYCN and GAPDH mRNA in SK-N-SH cells transfected either with vehicle or MDM2/166A."
  ],
  "subjectAreas": [
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}