{
  "id": 16021,
  "origin_website": "Jove",
  "title": "Förster Resonance Energy Transfer Mapping: A New Methodology to Elucidate Global Structural Features",
  "procedures": [
    "1. Selection of labeling sites\nIdentify at least three potential labeling sites to triangulate the putative binding site on the existing protein structures. In this case, SecA, SecYEG, and preprotein attached to SecA through genetic fusion were identified2.\n\t\nChoose labeling sites within 25-75 Å of the putative binding site and in relatively static regions of the protein, the distance will determine the specific FRET dye pair to be used36. Locate the labeling sites in protein regions that are relatively distinct from each other, so the sites describe the vertices of a triangle with the putative binding site located in the center (Figure 1A-D).\nIntroduce or identify cysteine (Cys) residues at labeling sites of interest in a protein that has no other Cys residues, to improve the labeling efficiency of the specific site37,38.\nIntroduce unnatural amino acids, e.g., p-azidophenylalanine for labeling with click chemistry, in order to effectively label one protein at two distinct positions with different dyes39,40.\nTest the Cys mutants for loss of function. Verify the activity of the Cys-less mutant and the unnatural amino acid mutant using an appropriate activity assay. In this case, activity was verified with a growth assay followed by an in vitro malachite green ATPase assay32,41,42\n2. Labeling the protein\nPurify the protein or proteins of interest to at least 95% purity for accurate labeling. Purify SecA and SecYEG proteins following protocols detailed in reference3. Ensure that you have at least 5 μg of purified protein for this step, as some protein will be lost during the labeling process.",
    "Choose two dyes for FRET measurements depending on their R0 value and the predicted distances between labeled sites. Estimate R0 values and observe donor emission and acceptor absorbance overlap using the information from the fluorescent protein database, which also gives spectra for commonly used dyes (https://www.fpbase.org/spectra/)36.\n\tNOTE: R0 is defined as the distance at which the transfer efficiency is 50% for a given dye pair. For mapping experiments, predicted distances should be close to the R0 value of the dye pair to ensure that distances can be measured accurately.\nLabel the positions identified in step 1.1.1. with the donor-acceptor dye pair.\n\t\nLabel the protein according to the manufacturer's instructions with particular attention paid to parameters such as optimal protein concentration, temperature, pH, length of time, and buffer for the specific dyes used43,44.\nPrepare the protein at a concentration of 1-2 mg/mL or approximately 10 μM in a 25 mM Tris-HCl (pH 7.5), 25 mM KCl, 1 mM EDTA (TKE) buffer. Dissolve dye in dimethylformamide (DMF) or dimethylsulfoxide (DMSO) to a final concentration of 1 mM. Add the dye dropwise to the solution while stirring to reach a dye: protein molar ratio of 5:1 (50 μM dye: 10 μM protein).\nAllow the reaction to proceed for 4 h at room temperature (RT) in a glass vial with gentle rocking or overnight at 4 °C. Stop the reaction by adding β-mercaptoethanol.\n\t\tNOTE: If protein is not compatible with Tris buffer, phosphate or HEPES buffers can be used. Maintain pH in the 7.0-7.5 range. If the protein has disulfide bonds, add a reducing agent such as DTT or TCEP prior to labeling. Remove DTT by dialysis or gel filtration before adding dye.",
    "For accurate FRET measurements remove the free dye with a centrifugal concentrator with an appropriate molecular weight cut-off (MWCO) to let the free dye flow through while retaining the labeled protein.\n\t\nPrepare the concentrator membrane by placing ~ 1 mL of water in the upper part of a 3 mL concentrator and then centrifuge the water through the membrane (at least 10 min at 4,300 x g).\nRemove free dye by centrifuging labeled sample in concentrator (20 min at 4,300 x g). Repeat 3-4 times and dispose of flow through.\nCheck labeling efficiency of the labeled protein using UV-Vis absorption spectroscopy.\n\t\tNOTE: FRET measurements require labeling efficiencies of 50% or greater. Lower labeling efficiencies reduce the FRET signal and can lead to inaccuracies in measurement.\nObtain a UV-Vis spectrum of the labeled protein with a range from 250-700 nm to observe both the protein absorption band and the dye maximum absorption band. Measure the absorbance at the absorption peak of dye and at 280 nm for protein.\nDetermine the concentration of protein and correct for any contributions from the dye using the correction factor, CF, and the following equations45,46:\nimgsrc://cloudfront.jove.com/files/ftp_upload/63433/63433eq01.jpg\n\t\twhere C is the concentration of the protein (M), A280 is the sample absorbance at 280 nm, Amax is the absorbance at the dye absorption maximum, ε protein is the extinction coefficient for the protein at 280 nm and CF is the correction factor, A'280/A'max, where A'280 is the absorbance at 280 nm and A'max is the absorbance at the peak maximum for the dye only.\nDetermine labeling efficiency using the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/63433/63433eq02.jpg",
    "where εdye is the molar extinction coefficient of the dye, C is the concentration of the protein as determined in step 2.4.5, and E is the labeling efficiency. Repeat step 2.4.2 until the labeling efficiency value has plateaued and is less than 100%.\n3. Determine the R 0 values\nMeasure the R0 values in situ. Prepare two protein samples at the same concentration of total protein, 4 μM, one with the protein labeled with the donor dye only and one with the protein labeled with the acceptor dye only. For SecA, a protein concentration of 4 μM SecA monomer works well for these measurements.\n\t\nPrepare sample volumes of 2.5 mL for a 1 cm x 1 cm cuvette, 600 μL for a 5 mm x 5 mm cuvette or 200 μL for a 3 mm x 3 mm cuvette.\nTurn on the fluorometer and open the spectral acquisition and analysis program in the fluorescence software if using a spectrofluorometer. Click on the red M to connect the computer to the instrument (Figure 2A) and choose Emission Spectra.\n\t\nEnter scan parameters such as excitation wavelength, the range for emission scan, temperature, and sample changer position using the Collect Experiment menu item (Figure 2B).\nClick on RTC and optimize instrument settings (e.g., spectral slits) by monitoring the fluorescence emission at the peak using an excitation wavelength set at the dye's absorption maximum. For SecA, set the following settings: bandpass as 1 nm; excitation and emission slits as 1 and 1.5 mm respectively, with the temperature at 25 °C and stirring speed at 250 rpm.\n\t\tNOTE: Do not exceed the counts per second (cps) capacity of the instrument (typically 2 x 106 cps).",
    "Place the donor labeled protein sample in the sample holder and click Run to generate an emission scan of the protein labeled with the donor dye only (donor only protein) by exciting the sample at the dye absorption maximum (e.g., 488 nm for AF488) and scanning over the emission peak (505-750 nm for donor only SecA protein labeled with AF488).\nEstablish a baseline for the scan by extending the scan 25-50 nm past the end of the peak. Measure the quantum yield of the donor-only protein, by performing absorption and fluorescence measurements on samples of different concentrations as described47. Maintain the same slit settings for these measurements.\n\t\nUse free donor dye as the reference for the quantum yield. Obtain at least four measurements of the donor-only protein and the free dye at different concentrations for an accurate determination.\nPlot the fluorescence intensity or integrated area versus the absorbance for the donor-only protein and the free dye or reference. Determine the slopes for the donor-only protein (SlopeD) and the reference (SlopeR).\nQuantum yield (Φ) is calculated using the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/63433/63433eq03.jpg\n\t\there ΦD is the quantum yield of the donor only protein, ΦR is the quantum yield of the free dye (this can usually be obtained from the manufacturer), SlopeD and SlopeR are the slopes determined in step 3.4.2 for the donor only protein and reference, respectively and ηD and ηR represent the index of refraction of the donor-only protein and the reference-free dye solutions, respectively 47.\nObtain an absorption spectrum of your acceptor-only protein using a 1 cm pathlength cell. Generate an extinction coefficient spectrum of your acceptor-only protein by dividing the absorption spectrum by the dye concentration.",
    "Generate the spectral overlap integral, J (λ) using a graphical analysis program. A standard worksheet program (e.g., spreadsheet) can also be used for this process.\n\t\nMultiply the fluorescence emission spectrum of the donor-only protein (step 3.4) by the extinction coefficient spectrum of the acceptor-only protein to generate the overlap spectrum.\nMultiply the resultant overlap spectrum by λ4.\nDetermine the area under the curve by integration of the overlap region. The overlap region is defined as the area where the donor emission spectrum multiplied by the acceptor extinction coefficient spectrum yields positive values. The spectral overlap integral is defined as:\nimgsrc://cloudfront.jove.com/files/ftp_upload/63433/63433eq04v2.jpg\n\t\twhere FD (λ) is the emission spectrum of the donor-only protein (obtained in step 3.4) and εA(λ) is the extinction coefficient spectrum of the acceptor-only protein and has units of M-1cm-1 (obtained in step 3.5). The resulting spectral overlap integral should have units of M-1cm-1nm4.\nNormalize the spectral overlap integral. Divide the overlap integral by the integrated area of the donor only protein spectrum over the same spectral range:\nimgsrc://cloudfront.jove.com/files/ftp_upload/63433/63433eq05.jpg\nCalculate the R0 value in Å using the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/63433/63433eq06.jpg\n\t\twhere κ2 is the orientation factor, typically taken as 2/3 for freely rotating dyes, η is the index of refraction and can be approximated as 1.33 for dilute aqueous solutions, QD is the quantum yield of the donor (step 3.4) and J(λ) is the spectral overlap integral as determined in step 3.6.35. NOTE: If the dyes are not freely rotating, corrections can be introduced as described by Ivanov 48 and implemented by Auclair49 and Zhang2,3.\n4. Perform FRET spectral measurements",
    "Prepare donor-only protein, acceptor-only protein, and donor-acceptor protein samples at the same concentration; a concentration of 4 μM is recommended. Use 200 μL of solution, if using a 3 mm x 3 mm cuvette, 600 μL if using a 5 mm x 5 mm cuvette, or 2.5 mL if using a 1 cm x 1 cm cuvette.\n\t\nPrepare the donor-acceptor protein sample by using equal molar amounts of the donor only and acceptor only protein.\nMaintain the same amount of labeled sample in control donor only and acceptor only protein samples through the introduction of unlabeled protein in equal molar amount to either the donor only or acceptor only samples. For example, for solutions of the same concentration, each donor-only FRET sample would contain 100 μL of donor-only protein and 100 μL of unlabeled protein for a 200 μL volume.\nGenerate fluorescence emission spectra of the donor only, acceptor only, and donor-acceptor samples. Optimize the signal as described in step 3.2. Once optimized maintain the same settings for all of the samples.\n\t\nObtain the donor-only scan as described in step 3.3. Excite the solution at the donor dye absorption maximum and scan over the donor and (expected) acceptor emission peaks.\nEither exchange the sample to the acceptor-only protein or change the sample changer position to the cuvette containing the acceptor-only protein.\nObtain an emission scan of the protein labeled with acceptor dye only (acceptor only protein) using the same settings as in step 4.2.1. Excite the sample at the donor excitation wavelength.\n\t\tNOTE: This spectrum provides a correction for the amount of acceptor excited at the donor wavelength (FA in step 5.1.2)\nExchange the sample to the donor-acceptor protein sample or change the sample changer position to the cuvette containing the donor-acceptor labeled protein.",
    "Obtain an emission scan of the donor-acceptor protein sample using the same settings as in steps 4.2.1 and 4.2.3.\nFor all spectra, correct for background fluorescence by subtracting the background counts measured at the end of the scan.\nMeasure the donor lifetimes of the donor only and donor-acceptor samples prepared as described in step 4.1.2. Use a time-correlated single-photon counting fluorescence instrument capable of measuring and resolving fluorescent decays in the nanosecond (10-9 s) time range.\n\tNOTE: For FRET dye pairs, match the excitation light source to the absorption maximum of the donor dye.\n\t\nTurn on the instrument. Open the acquisition software, use the instrument control software for data acquisition with the fluorescence spectrometer.\nFor acquisition, select TCSPC Decay, with a time range of 55 ns, a gain of 1 and 4096 channels.\nObtain an instrument response function (IRF) using a solution of non-dairy creamer or commercial scattering solution and monitor the scattering at 490 nm. Adjust the slit setting and use neutral density filters as needed to maintain a low enough count rate to avoid pulse pile-up5. Click Accept and then Start. This will start the acquisition.\n\t\tNOTE: A maximum count rate of 4000 cps is used for a 180 kHz repetition rate.\nCollect the IRF at 490 nm until the peak channel has a maximum of 20,000 counts. Collect an IRF before and after measuring each fluorescence decay.\nObtain the fluorescence decays of the donor only and donor-acceptor samples by monitoring the fluorescence emission at the donor emission wavelength, 520 nm.\nAdjust slit settings for a maximum count rate of 4000 cps or less. Slit settings are typically 15-20 nm bandpass for protein samples. Collect the decay until 20,000 counts are obtained in the peak channel.",
    "Analyze the decay or the fluorescence intensity (I) as a function of time (t) for the fluorescence lifetime (τ). Fit the decay to a sum of exponentials with the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/63433/63433eq07.jpg\n\twhere αI is the preexponential factor of the ith component and τI is the lifetime. The fit is reconvolved with the IRF to match the fluorescence decay. Judge the quality of the fit from the reduced Χ2 parameters.\n5. Analysis of FRET data\nCalculate FRET efficiency from the decrease in donor intensity of the donor-acceptor sample relative to the donor only with the following equation.\nimgsrc://cloudfront.jove.com/files/ftp_upload/63433/63433eq08.jpg\n\twhere FDA is the fluorescence intensity of the donor-acceptor sample and FD is the fluorescence intensity of the donor only sample at the peak of the donor fluorescence. Use the integrated areas of the peaks if the data is noisy.\n\t\nCorrect for any differences in labeling between the donor only and donor-acceptor samples. Calculate corrections based on the donor degree of labeling as follows.\nimgsrc://cloudfront.jove.com/files/ftp_upload/63433/63433eq09.jpg\n\t\twhere fDA is the donor labeling efficiency in the donor-acceptor sample and fD is the labeling efficiency in the donor-only sample.\nCorrect for any contributions of the acceptor fluorescence to the donor-excited spectrum through subtraction of the acceptor-only protein spectrum (step 4.2) from the donor-acceptor protein spectrum.\nimgsrc://cloudfront.jove.com/files/ftp_upload/63433/63433eq14.jpg\nCorrect for the differences in labeling efficiency of the acceptor only protein relative to the donor-acceptor protein sample yielding the following equation for calculating efficiency:\nimgsrc://cloudfront.jove.com/files/ftp_upload/63433/63433eq10.jpg\n\t\twhere fA denotes the fractional amount of acceptor labeling. This equation includes all corrections due to dye labeling and acceptor fluorescence.\nCalculate FRET distances from the efficiencies using the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/63433/63433eq11.jpg\n\t\tusing the R0 value obtained in step 3.6.5.\nCalculate FRET efficiency using fluorescence lifetimes of the donor only and donor-acceptor samples measured in step 4.3.3-4.3.5:\nimgsrc://cloudfront.jove.com/files/ftp_upload/63433/63433eq12.jpg",
    "Use the amplitude-weighted lifetime to calculate FRET efficiencies and compare with steady-state results5.\nimgsrc://cloudfront.jove.com/files/ftp_upload/63433/63433eq13.jpg\nCalculate the distance as in step 5.1.4 from the efficiencies determined by fluorescence lifetime. Compare steady-state and time-resolved values for FRET efficiencies and distances and ensure that they are within error of each other.\n6. Mapping the distances\nUse the calculated distances to map the binding site on the three-dimensional structure. Calculate the distances and errors for all of the dye pairs and locations examined using the equation given in step 5.1.4 and R0 values obtained in step 3.6.5 for each FRET pair.\n\t\nUse a 3-D graphical viewing program such as PyMOL50 to map the distances onto the structure (script given in Supplementary File). Commands from the script can be directly entered into the command window with the appropriate distance information.\nGenerate a shell for each distance measured and the associated error (Figure 3, Figure 4, Supplementary Figures 1-3).\nMap the position through the intersection of the different shells (Supplementary Figures 1-3). The signal peptide binding site was mapped through the three different locations on SecA and SecYEG and four different locations on the signal peptide (Figure 1).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}