{
  "id": 6269,
  "origin_website": "Bio",
  "title": "Isolation of Chromatin-bound Proteins from Subcellular Fractions for Biochemical Analysis",
  "procedures": [
    "Notes: As guidance for cell density, neural stem cells Cor3-1 were seeded at 1.5 x 106 in 10 cm dishes and P19 cells were seeded at 1.0 x 106 in 10 cm dishes to reach 70%-80% confluency.Before starting, make sure the centrifuge is chilled at 4 °C.Wash cells once with room temperature PBS.Collect cells with a cell scraper in 1 ml ice-cold PBS and transfer into a 1.5 ml microcentrifuge tube.Pellet cells at 130 x g in a refrigerated centrifuge at 4 °C for 3 min.Lyse cell pellet with 5 volumes of ice-cold E1 buffer for 1 volume of cell pellet.Pipet gently up and down (5 times) before centrifugation at 1,100 x g at 4 °C for 2 min.Collect the supernatant in a fresh tube (cytoplasm fraction).Resuspend the pellet by gentle pipetting with the same volume of E1 buffer used for the previous step (Step 4). Centrifuge immediately at 1,100 x g at 4 °C for 2 min.Discard the supernatant and resuspend the pellet by gentle pipetting with the same volume of E1 buffer used for the previous step (Step 4). Leave the tube for 10 min on ice.Centrifuge at 1,100 x g at 4 °C for 2 min.Discard the supernatant.Resuspend the pellet by gentle pipetting in 2 volumes of ice-cold E2 buffer for 1 volume of cell pellet.Centrifuge at 1,100 x g at 4 °C for 2 min.Collect the supernatant in a fresh tube (nucleus fraction).Resuspend the pellet with the same volume of E2 buffer used for the previous step (Step 13).Centrifuge immediately at 1,100 x g at 4 °C for 2 min.Note: The pellet should now start to be more difficult to dissolve by pipetting; using wide bore tips might be required. Resuspend the pellet keeping the same volume of E2 used for the previous step (Step 13).",
    "Leave the tube for 10 min on ice.Centrifuge at 1,100 x g at 4 °C for 2 min.Discard the supernatant.For Western blot analysis: Resuspend the pellet by pipetting in ice-cold E3 buffer (same volume as used for E1 in Step 4).Note: The pellet is very sticky at this stage and precaution should be taken not to lose it. Sonicate in a water bath sonicator with ice for 5 min, 30 sec ON/30 sec OFF on maximum power (i.e., setting H on Bioruptor).Note: Ice should be replenished if necessary to keep a constant layer of crushed ice on top of the water bath. Centrifuge all the fractions (i.e., cytoplasm, nuclear and chromatin) at 16,000 x g at 4 °C for 10 min.Transfer each supernatant into fresh microcentrifuge tubes.Measure protein concentration (e.g., Pierce BCA Protein Assay kit, Thermo Fisher Scientific, using a NanoDrop) and proceed to Western blot analysis.Note: The protein concentration of the nuclear fraction might be low, and it could be necessary to precipitate proteins using, for example, Trichloroacetic acid method (see Paredes-Osses and Hardie, 2013). For pull-down assays: Resuspend the pellet in ice-cold E3 (benzonase) buffer (same volume as used for E1 in Step 4).Flick the tube to detach the pellet.Add benzonase at a 1:1,000 dilution.Place the tube on a rotating platform and leave to rotate at 15 rpm for 20 min at room temperature.Note: Incubation up to 30 min might be required to digest nucleic acids. NP-40 can be replaced with 0.1% SDS to enhance the reaction but the presence of SDS may interfere with downstream applications. Centrifuge all the fractions at 16,000 x g at 4 °C for 10 min.Transfer each supernatant into fresh microcentrifuge tubes.Measure protein concentration and proceed to required pull-down assay (e.g., immuno-precipitation or resin pull-down)."
  ],
  "subjectAreas": [
    "Stem Cell",
    "Biochemistry",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}