{
  "id": 1789,
  "origin_website": "Cell",
  "title": "Using Chromatin Accessibility to Delineate Therapeutic Subtypes in Pancreatic Cancer Patient-Derived Cell Lines",
  "procedures": [
    "Step-by-Step Method Details\nStep-by-Step Method Details\nCell Preparation\nTiming: 10–20 min\nCells are trypsinized, counted, and lysed with ATAC-seq lysis buffer.\nNote: This protocol is a modification of a previous protocol by Buenrostro et al. (2015).\nNote: Optimizing the cell number to transposase enzyme ratio is crucial to obtain DNA libraries of sufficient complexity. For example, over-transposition of chromatin results when too few cells are used and produces a library composed of mainly small DNA fragments (<500 bp). Under-transposition results when too many cells are used and generates mainly large difficult to sequence DNA fragments (>1,000 bp).\nHarvest PDCLs using trypsin and count cells\nTypically, 100,000 cells worked well for most PDCLs tested. To optimize this for different cell types a range of cell numbers should be tested first to establish optimal cell: transposase ratio.\nPipette cells using a 200 μL pipette tip to produce homogenous single cell suspension.\nCentrifuge 100,000 cells for 5 min at 600 × g, 4°C.\nRemove and discard supernatant.\nAdd 50 μL ice-cold PBS to wash pellet, do not disturb pellet, and centrifuge for 5 min at 600 × g, 4°C.\nRemove and discard supernatant.\nAdd 50 μL ice-cold ATAC-seq lysis buffer to pellet. Very gently dislodge the pellet. Centrifuge immediately for 10 min at 600 × g, 4°C.\nCritical: It is crucial to treat the cell pellet gently during the lysis step to prevent over-lysis and preserve the native chromatin configuration to be analyzed.\nCritical: To proceed as quickly as possible to the transposition reaction, make the transposition master mix (described in step 9) while the pellet is spinning for 10 min at 600 × g, 4°C (step 6)\nDiscard the supernatant and immediately continue to the transposition reaction.\nTransposition Reaction and Purification\nTiming: ∼45 min",
    "Cells are incubated with the Tn5 transposase enzyme to insert oligonucleotide tags within open regions of DNA.\nMake sure the cell pellet is placed on ice.\nTo make the transposition reaction mix, combine the following: 25 μL TD (2× reaction buffer from Nextera kit) 4.7 μL TDE1 (Nextera Tn5 Transposase from Nextera kit) 22.3 μL nuclease-free H2O\nResuspend nuclei pellet in the transposition reaction mix.\nIncubate the transposition reaction at 37°C for 30 min at 400 rpm on an Eppendorf mixer.\nImmediately following transposition, purify the DNA using the Qiagen MiniElute PCR purification kit.\nElute transposed DNA in 10 μL DNase-free water.\nPause Point: Purified DNA can be stored at −20°C for up to 72 h.\nPCR Amplification\nTiming: 30–60 min\nTransposed DNA fragments are amplified by PCR using custom primers which contain the designated index (barcode) for each library.\nNote: Each library must contain a unique index to enable sample identification once the libraries have been pooled for sequencing.\nTo amplify transposed DNA fragments, combine the following in a 0.2 mL PCR tube: 10 μL transposed DNA 10 μL nuclease-free H2O 2.5 μL 25 μM PCR Primer 1 2.5 μL 25 μM Barcoded PCR primer 2 25 μL NEBNext High-Fidelity 2× PCR master mix\nPerform initial amplification as follows:\ntable:files/protocols_protocol_124_2.csv\nCritical: To allow extension of both ends of the primer after transposition the first 5 min extension at 72°C is required.\nNote: The final number of PCR cycles is determined using qPCR to allow library amplification to be stopped prior to saturation. This helps to reduce GC and size biases.",
    "To run a qPCR side reaction, combine the following qPCR compatible consumables: 5 μL of previously PCR-amplified DNA 4.2 μL H2O 0.4 μL 25 μM primer 1 0.4 μL 25 μM primer 2 5 μL 2× SYBR Select master Mix\nCritical: Use white qPCR plates to run the qPCR reaction. White plates help increase sensitivity and reduce variability in the qPCR assay.\nUsing a qPCR instrument, cycle as follows:\ntable:files/protocols_protocol_124_3.csv\nTo calculate the additional number of cycles required, plot linear Rn versus cycle and determine the additional number that corresponds to one-third of the maximin florescent intensity (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/124-Fig1.jpg\nFigure 1. Calculating the Number of Additional PCR Cycles Required for Library Amplification\nTo calculate the additional number of cycles required, plot linear Rn versus cycle and determine the additional number that corresponds to one-third of the maximum fluorescent intensity. For example, as shown for sample A replicate 1, the “end point” RFU value after 20 cycles is 3,900 which is divided by 3 to give “one third” RFU value of 1,300. A line is then drawn at 1,300 on the y-axis until it meets the amplification curve of that sample. This point is then joined to the x-axis to establish the number of additional cycles required for the library amplification. Take forward replicate libraries which require the minimum number of cycles for library amplification.\nRun the remaining 45 μL PCR reaction to the cycle number determined by qPCR.\ntable:files/protocols_protocol_124_4.csv\nPurify the amplified library using Qiagen Minielute PCR purification kit.\nElute in 20 μL EB buffer.\nDouble Size Selection\nTiming: 30–60 min",
    "The first objective is to remove large DNA fragments which are >1,000 bp. Large fragments are difficult to accurately quantify and result in reduced clustering efficiencies when sequencing. The second objective is to remove smaller DNA fragments which are <100 bp. Smaller fragments are preferentially sequenced and consequently could become over-represented in the sequencing result. This step will also remove excess adapter sequenced.\nNote: This protocol is adapted from the SPRI Based Size Selection manual\nCritical: Vortex magnetic beads and bring beads and DNA to room temperature before starting size selection assay.\ntable:files/protocols_protocol_124_5.csv\nNote: Steps 22–27 are for Large Size Selection (>1,000 bp)\nVortex beads and bring beads and DNA to RT.\nMake all samples up to 50 μL using resuspension buffer (DNase-free water).\nTo select for fragments <1,000 bp use 0.55× SPRIselect ratio.\nFor example: 50 μL sample × 0.55× ratio = 27.5 μL of SPRIselect to add to library.\nAdd beads to sample and pipette 10 times and incubate for 5 min at RT.\nCritical: Insufficient mixing of samples and SPRIselect will lead to inconsistent size selection results.\nNote: The yields of ATAC-seq libraries are typically lower as compared to other library protocols, e.g., RNA-seq or WGS. To ensure that all of the desired DNA fragments are bound to the beads the incubation time can be extended. However, extending the time of DNA and bead incubation can increase binding of unwanted size fragments.\nAdd samples to an appropriate magnetic rack or plate such as DynaMag-2 Magnet. Wait for the beads to attached to the magnet and for the sample to go clear. Bead attachment times can vary depending on the initial sample size, the volume of beads added, and the strength of the magnet.",
    "Take the supernatant and keep - the large unwanted fragments are attached to the beads.\nCritical: Be careful not to pipette any of the beads when removing the supernatant as this will contaminate the library prep with large DNA fragments.\nNote: Steps 28–32 are for Small Size Selection (>100 bp)\nNote: Increasing the ratio of SPRIselect volume to sample volume will decrease the efficiency of binding larger fragments.\nTo select for DNA fragments that are 100 bp and above use a final volume of 1.8× SPRIselect based on the initial reaction volume. The second SPRIselect volume is determined after accounting for the first volume of 0.55× SPRIselect added.\nFor example: 50 μL sample × (1.8× ratio − 0.55× ratio) = 62.5 μL SPRIselect.\nAdd SPRIselect to sample, mix well, and incubate for 5 min at RT.\nAdd sample to magnetic rack.\nMake fresh 80% ethanol.\nOnce beads have attached to the magnet and the sample has gone clear, remove, and discard the supernatant. The library is now attached to the beads.\nCritical: Be careful not to remove beads during this step because the desired library is now associated with the beads. Significant bead loss will result in reduced yield.\nWith the reaction vessel still on the magnet, add 500 μL of 80% ethanol and incubate at RT for 1 min. Remove and discard the ethanol supernatant.\nCritical: Take care not to remove any beads during this step.\nCarefully remove residual ethanol with a pipette and dry for 5 min at RT.\nCritical: Allow all ethanol to evaporate but DO NOT let the beads dry out.\nThe bead supernatant will begin to crack if allowed to dry out completely – avoid this.\nRemove sample from magnetic rack and resuspend beads in 23 μL nuclease-free H2O. Mix well.",
    "Note: Elution volume should be large enough so that the liquid level is high enough for the beads to settle to the magnet.\nLeave samples to stand off the magnetic rack for 1 min.\nAdd samples back to the magnetic rack and allow beads to attach to the magnet.\nOnce clear, take 20 μL of eluted DNA and store in a DNA-low binding Eppendorf at 4°C.\nEstimate of Library Yield Using the Qubit dsDNA HS Assay Kits\nTiming: 15 min\nTo accurately quantify the ATAC-seq library we recommend using Agilent Bioanalyzer high sensitivity DNA chips. These chips are extremely sensitive and work best when 1 ng/μL library is loaded. To establish the ATAC-seq library concentration for loading onto the bioanalyzer chip, first use the Qubit dsDNA HS Assay Kits to obtain a rough estimate of library yield.\nThe Qubit dsDNA HS (High sensitivity) Assay Kits include concentrated assay reagent, dilution buffer and prediluted DNA standards. The assay is accurate for sample concentrations from 10 pg/μL to 100 ng/μL. This assay is prepared at room temperature (RT) and is stable for 3 h.\nNote: See life technologies cat# Q32851, Q32854 for Qubit dsDNA HS Assay Kits user manual.\nSet up the required number of 0.5 mL tubes for standards and samples. The Qubit dsDNA HS assay requires 2 standards.\nCritical: Use only thin-wall, clear 0.5 mL PCR tubes. Acceptable tubes include Qubit assay tubes (cat #Q32856) or Axygen PCR-05-C tubes (cat # 10011-830).\nLabel the tube lid.\nCritical: Do not label the side of the tube as this could interfere with the sample read.\nPrepare Qubit working solution by diluting the dsDNA HS reagent 1:200 in dsDNA HS buffer.",
    "Note: The final volume in each tube must be 200 μL. Each standard tube contains 190 μL of Qubit working solution, and each sample tube requires somewhere between 180 μL to 199 μL (depending on the concentration or your prepared library).\nFor the standards, add 10 μL standard to 190 μL Qubit working solution.\nFor samples, add 2 μL sample to 198 μL Qubit working solution.\nNote: Typically, 2 μL of the library prep provides a sufficient volume to give an accurate Qubit reading which fell in between the range of detection, i.e., between the two standards. However, test samples can be anywhere from 1–20 μL. Add corresponding volume of Qubit working solution to each tube: anywhere from 180–199 μL.\nMix all samples by vortexing then spin briefly.\nIncubate at RT for 2 min\nRead samples on Qubit 3.0 Fluorometer by pressing the DNA option, then select dsDNA High Sensitivity as the assay type.\nPress Read Standards to proceed\nInsert tube containing Standard #1. Read standard and once complete, read standard #2.\nPress Run samples.\nOn the assay screen select sample volume and units: Sample volume from 1–20 μL Select the units for the output sample concentration, i.e., ng/μL\nRead all samples.\nLibrary Quantification and Molarity Calculation Using the Bioanalyzer\nTiming: 2 h\nThe Bioanalyzer high sensitivity DNA kits can quantify libraries from just a few amplification cycles thereby reducing the amplification bias of shorter DNA fragments and improving the quality of sequencing data. The kit also offers improved sensitivity for checking the size and quantity of DNA samples of limited abundance.\nNote: See protocol brochure for detailed step-by-step procedure: Manual Part Number: G2938-09321 Rev.B\nCritical: Exactly 1μL of sample must be loaded. A mximum of 11 samples can be run per chip.",
    "The chip can detect DNA fragments in the range of 50–7,000 bp. This sizing range is optimal for analyzing the full spectrum of DNA fragments generated in ATAC-seq libraries.\nQuantitative range is 5–500 pg/μL\nMake sure gel matrix reagents are at RT for at least 30 min before adding to chip.\nTypically, 500 pg/μL loaded onto the chip gives an accurate quantification.\nRun HS DNA chip on Bioanalyzer and quantify library molarity using the bioanalyzer software: 2100 Expert Software (Figures 2[href=https://www.wicell.org#fig2] and 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/124-Fig2.jpg\nFigure 2. Calculating the ATA-Seq Library Molarity Using the Agilent Bioanalyzer\n(A) Run 0.5 ng/μL of ATAC-seq library on the Bioanalyzer.\n(B) Select “Manual Integration” to enable removal of integrated peaks.\n(C) Delete integrated peaks.\n(D) Now “Add Peaks” to incorporate all distinct peaks in the library. Add the molarity values for the selected peaks to establish the library molarity.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/124-Fig3.jpg\nFigure 3. Example of How to Pool the ATAC-Seq Library for Sequencing\nNote: Download for free from: https://www.agilent.com/en/product/automated-electrophoresis/bioanalyzer-systems/bioanalyzer-software/2100-expert-software-228259[href=https://www.agilent.com/en/product/automated-electrophoresis/bioanalyzer-systems/bioanalyzer-software/2100-expert-software-228259]\nPause Point: Libraries can be stored individually at −20°C.\nCritical: To prevent index hopping, libraries should be pooled just before sequencing. For further details please refer to https://emea.illumina.com/content/dam/illumina-marketing/documents/products/whitepapers/index-hopping-white-paper-770-2017-004.pdf[href=https://emea.illumina.com/content/dam/illumina-marketing/documents/products/whitepapers/index-hopping-white-paper-770-2017-004.pdf]."
  ],
  "subjectAreas": [
    "Bioinformatics",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioinformatics & Computational Biology"
  ]
}