{
  "id": 13248,
  "origin_website": "Jove",
  "title": "Laser Capture Microdissection of Mouse Embryonic Cartilage and Bone for Gene Expression Analysis",
  "procedures": [
    "Tissues from mice were obtained in accordance with the National Institutes of Health Guide for the Care and Use of Laboratory Animals, and study protocols were approved by the Institutional Animal Care and Use Committee at the Icahn School of Medicine at Mount Sinai.\n1. Preparation of Fresh Frozen Specimen\nDissect the embryo or tissue of interest. Embed the sample in a disposable embedding mold with optimal cutting temperature (OCT) compound. Adjust the orientation of the specimen with a tip or needle.\nRapidly freeze the samples in a dry ice/methyl-2-butane bath. Continue to the next step or store at -80 °C.\nNOTE: The protocol can be paused here.\n2. Cryosectioning for Laser Capture Microdissection\nDefrost the cryostat and clean internal surfaces with 70% ethanol. Treat the anti-roll plate and a pair of forceps with RNase decontamination agent. Set the cryostat to the desired cutting temperature (-18 to -22 °C). Prepare a lidded container with dry ice, placing a sheet of aluminum foil on the dry ice for temporary storage of the sectioned sample slides during cryosectioning.\nCAUTION: Dry ice is extremely cold. Always handle dry ice with care and wear insulated gloves whenever handling it.\nTransfer the fresh frozen specimen into a bucket of dry ice. Place a layer of OCT compound onto a cryostat specimen holder and immediately place the specimen on top of the OCT with gentle pressure. When OCT is completely frozen, fasten the holder with the specimen into the cryostat cutting arm.\nLeave the sample in the cryostat for 15 min to equilibrate to the cutting temperature.",
    "Section the tissue and collect the slices on polyethylene naphthalate (PEN) membrane slides at a thickness of 12 μm. Align consecutive sections on the membrane. Once one slide is completed, allow sections to dry for a few minutes and transfer the slide onto the foil in the dry ice container until all the required slides are collected.\nStore the slides at -80 °C in a slide box.\nNOTE:Section thickness is chosen to maximize the amount of tissue collected while allowing efficient cutting of the tissue, and may vary depending on tissue of interest. The protocol can be paused here. Keep slides free from RNase contamination. Avoid temperature changes. Although the RINs of RNA from slides stored for up to 6 months may still indicate high quality of the RNA, we recommend using slides as soon as possible.\n3. Sample Preparation for Laser Capture Microdissection\nPrepare solutions for staining and dehydration.\n\t\nPlace 45 mL of 80% ethanol in each of three 50 mL centrifuge tubes on ice. Label them as #1, #2, and #3. Dilute ethanol with RNase/DNase free water.\nPlace 45 mL of 95% ethanol in a 50 mL centrifuge tube on ice.\nPlace 45 mL of 100% ethanol in a 50 mL centrifuge tube on ice.\nPlace 45 mL of xylene in a 50 mL centrifuge tube at room temperature.\nCAUTION: Xylene should be used in a fume hood.\nThaw a PEN membrane slide briefly by placing it against a gloved hand, then wash twice for 30 s each in 45 mL of 80% ethanol (#1 and #2) with agitation in 50 mL centrifuge tubes to remove the OCT.",
    "NOTE: It is important to remove OCT before staining, to prevent OCT loosened during staining from obscuring the sections. Forceps can be used to facilitate removal of OCT that is not washed off by agitation.\nLay slide on a sheet of aluminum foil. Pipette 0.8 mL of 0.1% cresyl violet in 50% ethanol onto the slide and stain for 30 s. Wash the slide in 45 mL of 80% ethanol (#3) for 30 s, and then dehydrate by passage for 30 s each through 45 mL of 95% ethanol, 100% ethanol, and xylene in 50 mL centrifuge tubes.\nStand slides on a delicate task wiper for 5 min to drain xylene and dry sections.\nNOTE: Slides must be dried completely before LCM.\n4. Laser Capture Microdissection\nNOTE: Wear powder free nitrile gloves while performing LCM.\nTurn on the LCM microscope, laser, and computer. Log on to computer and start the software. Turn the key to the \"On\" position to start up the laser. When the green light (Laser) is on, press the red button to activate the laser, and then the light (Laser) turns red indicating laser is ready to use.\nNOTE: The Laser needs approximately 10 min to warm up.\nSet up the collection tubes.\n\t\nInsert the cap of a 0.5 mL polymerase chain reaction (PCR) tube into the collector.\nNOTE: Choose the matching collector for the desired PCR tubes (0.2 or 0.5 mL).\nPipette 50 µL of extraction buffer (provided by RNA isolation kit listed in the Table of Materials) into the cap of the 0.5 mL collection tube.\nInsert the collection device into the microscope.",
    "In the Change Collector Device window, click on the Move to Reference Point button to move the collector to the reference point (RP). Adjust the focus to clearly view the RP. Click the arrows to move the RP to the center of the view.\nLoad specimen slides.\n\t\nClick the left Unload button in the toolbar to lower the slide holder.\nPlace the slide into the holder, with the tissue section facing downwards.\nNOTE: This orientation ensures that the captured tissue sections fall into the cap of the collection tube by gravity.\nInsert the holder back into the stage.\nSet up the laser parameters.\n\t\nSelect the Control option of the Laser menu or click on the Laser icon.\nAdjust these parameters as desired: Power, the power of the laser; Aperture, the width of the laser; and Speed, the speed of cutting in Draw and Cut mode.\nNOTE: Test the laser in an area out of interest. Higher power or larger aperture makes it easier to cut but causes more damage to cells. Adjust the combination of power, aperture, and speed to obtain efficient cutting and minimal damage of the tissue. For example, Power = 40, Aperture = 5, and Speed = 7 for cartilage tissue on a 12 μm section.\nSelect and cut areas of interest.\n\t\nStart with 5x objective and find the areas of interest, and then switch to the objective (5x, 10x, or 40x) that best shows the area of interest.\nNOTE: After cresyl violet staining, cartilages are stained magenta and mineralized tissues appear brown or black, distinguishable from other tissues. Images can be saved using Save Image As from the File menu.\nChoose the tube for collection (A, B, C, D) by clicking the mark at the collector.",
    "Choose Move and Cut or Draw and Cut. In Move and Cut mode, the specimen is cut manually, using the mouse or the touch-screen pen to draw shapes freehand. In Draw and Cut mode, shapes may be drawn freehand with the mouse or touch-screen pen for subsequent cutting. Click the Start Cut button to initiate laser cutting.\nOnce the cut is completed, the target tissue with PEN membrane falls into the cap of the collection tube by gravity. Repeat 4.5 to pool multiple areas of interest if needed.\nNOTE: Repeating cuts or increasing Power or Aperture may be necessary if the tissue does not drop into the cap of the collection tube due to incomplete cutting. Mineralized bone (brown or black) cannot be cut directly by laser.\nUnload the collector and carefully close the PCR tube. Place the microdissected tissues in dry ice. Continue to the next step or store at -80 °C.\nNOTE: The protocol can be paused here. Repeat 4.2 to 4.6 for the next sample.\n5. Lysis of Microdissected Tissues and RNA Isolation\nThaw the microdissected tissues at room temperature. Centrifuge briefly and incubate the samples for 30 min at 42 °C.\nAfter incubation, spin the lysis buffer down into the 0.5 mL PCR tube. Perform DNase treatment and RNA extraction using an RNA isolation kit (see the Table of Materials) following the manufacturer's instructions.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}