{
  "id": 19406,
  "origin_website": "Jove",
  "title": "In Vivo Fiber-Coupled Pre-Clinical Confocal Laser-scanning Endomicroscopy (pCLE) of Hippocampal Capillaries in Awake Mice",
  "procedures": [
    "The protocol follows the NIH Guidelines for the Care and Use of Laboratory Animals. All procedures were approved by the Barrow Neurological Institute’s Institutional Animal Care and Use Committee.\n1. Stereotaxic positioning for craniotomy\nWeigh and then anesthetize the mouse with a ketamine-xylazine (100 mg/kg–10 mg/kg i.p.) cocktail. Ensure that the animal is fully anesthetized by observing its lack of reaction to tail and/or toe pinch.\nPlace a heating pad under the mouse and use a rectal thermometer to continuously monitor its body temperature during the initial anesthetized implantation surgery (Figure 2A).\nApply ophthalmic ointment to prevent eye dryness.\nStabilize the head of the animal in a rodent stereotaxic frame, outfitted with a mouse adapter. To properly orient the mouse in the stereotaxic frame, place the animal’s teeth inside the hole of the bite-bar (Figure 2A and Figure 3A, item g). Tighten the nose-clamp until it is snug (Figure 2A,B and Figure 3A, item h). The mouse’s body positioning should be as straight as possible (as in Figure 2A).\n\t\nFurther secure the animal’s head using mouse ear-bars with jaw holder cuffs (Figure 2A and Figure 3A, item i), to firmly clamp the zygomatic processes of the skull.\n\t\tNOTE: Once secured, the mouse’s head should have no range of horizontal motion.\nOnce the mouse is adjusted to the stereotaxic frame (Figure 3B, item j), clean and sterilize the scalp by wiping it with chlor-hexedine scrub 2-3 times, each time followed by an alcohol rinse. Then, apply topical lidocaine on top of the head.",
    "Make an incision along the midline from posterior to anterior (start incision at the base of skull and complete it between the eyes; 12-15 mm) along the sagittal midline of the skull, using either fine scissors or a blade. Retract the borders of the scalp with four 28 mm bulldog serrefine clamps to expose the skull and maximize the working area (Figure 2B and Figure 3C).\nUse a scalpel or microspatula (Figure 3C) to scrape the periosteum to the incision’s edges. Use tissue-separating scissor or forceps (Figure 3C) to carefully retract the muscles at the back of the neck (Figure 2B).\nDry the top of the skull with a cotton-tipped applicator, moistened with alcohol or 30% hydrogen peroxide, to optimize visualization of the cranial sutures. Apply saline to the skull once the connective tissue has been removed.\nOnce the mouse’s head is stabilized in the stereotaxic apparatus, place a syringe needle tip (21 G) in the electrode holder (Figure 3B, item l), and attach the electrode holder to the stereotaxic micromanipulator, lowering the needle tip to the level of the skull (Figure 2D).\nAdjust the medial-lateral direction of the skull by measuring the height of the skull at any distance posterior to bregma (i.e., -2.0 mm), and two equal distances lateral from the midline on either side of the skull (i.e., ± 1.5 mm) (Figure 2D). Aim for a height difference across locations that is less than 0.05 mm in the dorsal-ventral direction.\n\t\nIf greater than 0.05 mm, rotate the mouse’s skull using the bite bar, or reposition the mouse’s head by loosening the ear-bars carefully, laterally shifting the head and ear-bars as needed, and then retightening the ear-bars.",
    "Once the skull is positioned in the stereotaxic device, determine and record the stereotactic coordinates of the bregma and lambda skull sutures along the anteroposterior (AP), medial lateral (ML), and dorsal ventral (DV) axes.\nIdentify the target point (right hippocampus) with the aid of a stereotaxic atlas. Then, find on the skull the target point coordinates relative to bregma (AP: -2.7 mm, ML: -2.7 mm) (Figure 2E).\nUsing a surgical marker, mark four corners of a 1.4 mm x 2 mm imaging window on the skull with dots, centered around the target point directly above the hippocampus (Figure 2F), for subsequent craniotomy.\nUse the surgical marker to draw two additional dots: one over the top-left parietal bone (Figure 2G) and another over the right frontal bone (Figure 2H), to indicate the future placement of two bone screws (Figure 3A, item b) that will anchor the head-cap (Figure 3B, item m) to the skull.\nUse the surgical marker to draw three more dots indicating where the epidural EEG recording electrodes will be inserted: one dot positioned 1 mm to either side of the midline, and one additional dot on the midline positioned 1 mm behind Lambda (Figure 2E, Figure 4A and Figure 5B).\n2. Head-Cap installation\nUsing a 0.7 mm diameter burr (Figure 3C), carefully drill two small holes in the skull, at the dot positions indicating the bone screws placement (see step 1.15 above). Then, take two bone screws (stainless steel-slotted, length: 4 mm; diameter: 0.85 mm) previously disinfected with ethanol 70-80%, and screw them to the skull for additional head-cap stability (Figure 2I-J and Figure 3A, item b).",
    "Ensure that the screw tips do not protrude beyond the bottom of the bone into the skull cavity, risking damage to the brain. Note that one of the two bone screws will be anterior to the two head-cap screws, and the other posterior to them (Figure 2G-J).\nSquirt saline over the skull to cool it down and clean it. Then dry the skull completely and apply a thin layer of cyanoacrylate around the screws.\nUse a custom alignment piece (Figure 3A, item c) clamped to the microdrive mounted to the stereotaxic device (Figure 2F-J and Figure 3A, item d), so that the position of the head-cap is aligned along the midline, with the anterior ridge overlying bregma. This custom stainless-steel piece is L-shaped (angled at 90°), with two holes separated by 4 mm (Figure 2F-J and Figure 3A, item c).\n\t\nUse the stereotaxic manipulator to position the L-shaped alignment piece, with two Fillister Head Slotted drive screws attached (M1.6 x 0.35 Metric Coarse, 12 mm Length; Figure 3A, item a) over the bregma, until the base of the screws lies flat on the skull, being careful to not exert pressure on the skull (Figure 2I-J).\nApply cyanoacrylate followed by dental cement to attach the base of the screws to the skull. Be careful to not obstruct the imaging window reference marks over the hippocampus (Figure 2K).\n3. Imaging window craniotomy surgery\nAt each of the positions of the craniotomy reference marks that indicate the corners of the imaging window (see step 1.14 above), drill a 0.7 mm diameter burr hole, followed by gently delineating the periphery of the 1.4 mm x 2 mm craniotomy window with the drill, with iteratively deeper cuts (Figure 2L).",
    "Take care to not to drill too deeply or with too much force on the skull, which is thin and fragile, having a thickness of approximately 300 µm. Once the bone flap is complete, pry the loose flap up with the tip of a scalpel, being mindful to not damage the underlying dura mater.\nCover the open window with bone wax (Figure 2M).\nUsing a 0.9 mm diameter burr, drill three holes for future placement of the epidural EEG electrodes (see step 1.15 above) taking care to not to cut through the dura mater (Figure 2E,L).\nCover the three holes with bone wax.\nGently apply cyanoacrylate around the edges of the bone-wax covered imaging window and EEG holes, being careful to not seal the craniotomies (Figure 2L).\nBuild a wall of dental cement that encompasses the imaging window and EEG holes and binds it to the previously cemented head-cap (Figure 2M and Figure 3B, item m).\nLet the cement dry for at least 10 minutes.\nClose any loose wound margins with simple interrupted sutures, using 4-0 or 5-0 black braided silk (Figure 2N and Figure 3C).\n4. Post-surgery\nUse a cotton-tipped applicator to apply lidocaine ointment around the exposed skin to deaden sensation around the wound’s edge.\nUse a sterile cotton-tipped applicator to apply Neosporin to the exposed skin.\nRemove the animal from the stereotaxic frame (Figure 2N).\nInject ketoprofen (5 mg/kg) IP or IM for post-surgical analgesia.\nObserve the animal until it is alert and moving (this will usually occur within minutes).\nPlace the animal in a warm cage and continue to monitor its recovery until it drinks or eats and is ready to transfer to animal housing.",
    "Check on the animal at least once daily for approximately one week after the surgery, watching for any signs of listless behavior and/or inadequate eating/drinking (Figure 2O).\n5. Dye injection and EEG recording\nWait a minimum of one day after the head-cap implantation surgery to initiate the recordings.\nPlace the mouse in a foam-restraining device molded to its body, within the stereotaxic frame (Figure 3B, items n & j).\nSecure the head-cap (Figure 3B-I, item m) to a custom mounting bar which is attached to the stereotaxic frame (Figure 3A,B, items e & j, and Figure 4A). The long section of item e (Figure 3A,B) should have a length between 9.4 – 13 mm. Fix item f (a mounting plate with dimensions 1.5 cm x 0.5 cm, with two holes separated 4 mm from center to center) to item e (Figure 3A,B, items e, f and k). This alignment system will position the awake mouse securely to the stereotaxic frame throughout the imaging sessions (Figure 4).\nInsert the epidural EEG recording electrodes (Figure 5A), placing the ground electrodes (white wires) within the posterior central hole, and the recording electrodes (red wires) in the anterior left and right holes (Figure 2E, Figure 4E and Figure 5E). Position each of the wires at an L-shape between the skull and the dura mater (Figure 5C) to optimize electrical contact.\nInject the tail vein with green fluorescein lysine-fixable dextran (0.2 mL/25 g body wt. of Fluorescein 5% w/w), to visualize blood flow within the hippocampus.",
    "To enhance dilation of the central vein of the mouse’s tail previous to injection, use one or more of the following strategies: a) Apply 70% ethanol to the central vein using a cotton-tipped applicator; b) Dip the tail into warm water (35-40 °C) for 1-3 minutes; c) Expose the tail to a heating lamp for a few minutes.\nSecure the mouse’s tail with two fingers and locate the central vein, which lies immediately below the skin. Insert the needle (ultrafine insulin syringe with integrated needle 30G), with the bevel up, into the vein, approximately halfway to two thirds from the base of the tail. Keep the needle parallel to the tail during the injection.\nInject the dye slowly and steadily, taking care to avoid any changes in the position of the needle or tail.\n\t\tNOTE: There should be no resistance upon depressing the syringe plunger.\nAfter completing the injection, withdraw the needle and apply gentle pressure to the puncture site to seal the vessel.\nAllow clotting to occur.\n6. In vivo fiber-optic-bundle-coupled pre-clinical confocal laser-scanning endomicroscopy (pCLE)\nDirectly following the tail vein injection (step 5.5.3 above), clamp the 300 µm beveled fiber-optic bundle (containing 5000–7000 3 µm fibers in each bundle) in the downward orientation to the mobile arm of the robotic stereotaxic drive.\nRemove the bone wax from the craniotomy.\nRemove the dura, using the bent tip of a syringe needle.\nUsing the robotic positioning system, first move the fiber objective to the appropriate anterior-posterior and left-right stereotaxic location, with the tip zeroed in the z-axis on the surface of the cortex.\nInitiate the EEG recording (Figure 5D).",
    "Initiate confocal laser-scanning of the back plane of the fiber-objective, followed directly by descending the objective slowly in the z-axis using the robotic microdrive’s z-controls, until it reaches the target depth within the brain (Figure 4C). View the imaging results in the microscopic software while descending.\n\t\nIf the fiber tip is within the target X-Y-Z recording region, and two or more vessels enter the imaging window’s FOV, stop the descent and initiate video recordings. Obtain live full-field time-lapse movies of the blood flow at 11.7 Hz using Cellvizio Lab’s imaging software. (Higher speeds may be obtained with a smaller FOV). Recordings may take place for 4-5 hours at a time, in consecutive days if needed.\nUsing a 10 mL syringe with beveled silicon tubing fixed to the tip of the needle, feed the animal during the recordings by periodically providing paste made with mice pellets ground with water.\nAt the end of the imaging session, terminate the recordings.\nGently remove the EEG leads and clean them with Tergazyme.\nSlowly remove the fiber-optic bundle from the animal’s brain by reversing the fiber along the z-axis of entry.\nRelease the animal from the head post and body restraints.\nIf appropriate, follow the necessary euthanasia and tissue processing protocols to visualize blood vessels and to perform immunohistochemistry.\nIf planning to record from the same animal in a future session, cover the imaging window with bone wax or silastic.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}