{
  "id": 4426,
  "origin_website": "Bio",
  "title": "Macrophage Inflammatory Assay",
  "procedures": [
    "Preparation of macrophage cultures   Expand the J774A.1 mouse macrophages in macrophage medium on a 15 cm petri dish. Notes:   A detailed method for culture of mouse macrophages can be found in references below.   Macrophage medium should be changed every 2-3 days.   The use of petri dishes allows the macrophages to be harvested for the assay without dissociating enzymes and without the requirement of a cell scraper that can be damaging to the cells.     Upon reaching 70-80% confluence, aspirate the culture medium from the dish and add 10 ml of fresh macrophage medium.   Harvest the macrophages by washing them from the petri dish with the macrophage medium using a pipette-aid and 10 ml serological pipette. Note: Spray the medium over the macrophages multiple times to dislodge the cells from the dish.   Transfer the macrophage suspension from the plate to a 50 ml conical tube. Add an additional 10 ml macrophage medium to the plate and repeat wash step.   Pellet the cells by centrifugation at 200-250 x g for 5-7 min.   Suspend the macrophages in macrophage medium and count the cells. Notes:    A 15 cm petri dish containing macrophages at 70% confluence should yield approximately 15 million macrophages.   The macrophages will consistently have high viability when cultured and harvested as described. Therefore, the use of a viability dye such as trypan blue for distinguishing live versus dead cells is not mandatory.     Prepare a suspension of the macrophages in macrophage medium at a density of 200,000 cells per ml.      Preparation of assay plates (Figure 1)   Determine the number of 12-well cell culture plates necessary to assay samples of interest in triplicate.   Transfer the test compound(s) of interest in triplicate to the appropriate wells of a 12-well plate.",
    "Note: We have routinely tested the effects of mesenchymal stem cell conditioned medium, prostaglandins such as PGE2, various pharmacological compounds, neutralizing antibodies and recombinant proteins.   Add macrophage medium to all wells containing a test reagent to a final volume of 500 µl. Note: If the volume of the test compound employed is minute, it is advantageous to first add the macrophage medium to the wells and then transfer the test compound of interest (from step B9) to the appropriate wells. The final volume in each well should remain 500 µl.   Add 500 µl macrophage medium to 6 additional wells not containing a test reagent. Note: These wells will provide controls for the assay.   Transfer 500 µl of the macrophage cell suspension (100,000 cells) to each of 3 wells containing 500 µl of macrophage medium only (without a test reagent).  Note: These wells will serve as unstimulated macrophage controls (Mac controls, Figure 1).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140716/20140716185501_1783.jpg Figure 1. Sample plate layout for the macrophage assay. To prepare the 12-well assay plate, the test reagents of interest are first added to the appropriate wells in triplicate (shown here in columns 3 and 4). Macrophage (Mac) medium is then added to every well to a final volume of 500 μl followed by addition of 500 μl of the Mac cell suspension to each well in the first column (unstimulated Mac control). 500 μl of the LPS-stimulated macrophages (LPS-Mac) are transferred to each of the remaining 9 wells (columns 2, 3, and 4). Note that three of these wells do not contain a test reagent (shown here in column 2) and therefore serve as the LPS-stimulated macrophage control (LPS-Mac control). The final volume per well is 1.0 ml. For simplicity, wells containing a vehicle control for the test reagents have been omitted.",
    "Macrophage stimulation with LPS   Stimulate the macrophages by adding a 1:500 dilution of the 0.1 mg/ml solution of LPS to the remainder of the macrophage suspension. To distribute the LPS, immediately mix the cell suspension by pipetting up and down 10-15 times.   Place the cap on the 50 ml tube containing the LPS-stimulated macrophages and incubate the cells in the 50 ml tube for 5 min at room temperature.   Mix the cells again then transfer 500 µl (100,000 cells) to the appropriate wells containing the test samples. Also, add 500 µl of the macrophage suspension to the three remaining wells containing 500 µl macrophage medium only (LPS-stimulated macrophage controls) (Figure 1).   Rock the plate 3 times to distribute the macrophages evenly across the well and incubate at 37 °C for up to 24 h. Each well for the assay finally contains 100,000 macrophages in 1.0 ml macrophage medium and 100 ng/ml LPS (except the three unstimulated control wells). Note: We routinely incubate the macrophages with LPS for approximately 16-18 h. However, an abundance of macrophage-derived cytokines can be detected in the conditioned medium as early as 4-6 h after LPS stimulation.      Collection of conditioned medium for assays of cytokine production   Prior to collecting the medium conditioned by the macrophages, observe the cultures to verify the cells were properly activated (Figure 2). Note: J774A.1 macrophages stimulated with LPS appear larger, flatter, and more granular than un-stimulated macrophages.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140716/20140716185527_2304.jpg Figure 2. Changes in macrophage morphology in response to LPS. Brightfield images of unsimlulated macrophages (left) and macrophages stimulated with LPS for 18 h (right). Scale bar = 50 µm    Collect the medium conditioned by the macrophages and place it into 1.5 ml microcentrifuge tubes.   Centrifuge the samples for 5 min at 500 x g, room temperature.   Transfer the supernatant to new 1.",
    "5 ml tubes. Notes:   Although a cell pellet should not be visible, avoid touching the bottom of the tube when removing the supernatant.   The samples can be used immediately for ELISA assay or aliquoted and stored at -80 °C.     Vortex the medium samples prior to their use in TNF-alpha and IL-10 ELISA assays. Follow instructions provided by the manufacturer of the ELISA kits. The absorbance of the wells can be read on a microplate reader with a wavelength of 450 nm and background wavelength correction set at 540 nm or 570 nm. Representative amounts of TNF-alpha and IL-10 produced by macrophages in response to LPS and a test compound (PGE2) are shown in the graphs below (Figure 3).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140716/20140716185607_9621.jpg Figure 3. Effects of LPS and PGE2 on TNF-alpha and IL-10 production by macrophages. Macrophages were stimulated for 18 h with 100 ng/ml LPS alone or LPS in combination with 1 ng/ml of the immune modulatory factor prostaglandin E2 (PGE2). LPS increases levels of the pro-inflammatory cytokine TNF-alpha produced by the macrophages. PGE2 attenuates macrophage production of TNF-alpha elicited by LPS stimulation but enhances levels of the anti-inflammatory cytokine IL-10. Values are mean +/- SD, n=3 per group."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}