{
  "id": 4986,
  "origin_website": "Bio",
  "title": "EdU Based DNA Synthesis and Cell Proliferation Assay in Maize Infected by the Smut Fungus <em>Ustilago maydis</em>",
  "procedures": [
    "Preparation of stock solutionsAllow all the vials to warm to room temperature.Add 2 ml DMSO or an aqueous solution to EdU (Molar mass 252.23 g mol-1) to make a 10 mM EdU stock solution. This stock is generally stable for one year when stored at -20 °C.Prepare 10x Click-iT EdU reaction buffer by adding 3.6 ml of deionized water to Click iT EdU reaction buffer. Stored at 2-8 °C.Prepare Alexa Fluor azide solution by adding 70 μl DMSO to Alexa Fluor 488 Azide. Mix and store well at -20 °C.Prepare 10x Click-iT EdU buffer additive by adding 2 ml deionized water to Click iT EdU buffer additive and mix. Stored at -20 °C.Labeling cells with EdU and fixationNote: Ustilago maydis infections are done in the desired maize organ as described previously (Redkar and Doehlemann, 2016). For seedling samplesThe U. maydis seedling or tassel infections are carried out by the syringe inoculation method by injecting the inoculum into the desired maize organ (Redkar and Doehlemann, 2016).The EdU labeling is done at the time-point for which DNA synthesis is to be measured. In case of a U. maydis infected seedling the 4 days post infection (dpi) time-point was chosen. In the U. maydis infected seedling the third infected leaf where the first infection symptoms appear is used for the EdU labeling assay. This leaf is incubated for 5 h with 10 µM EdU in small chambers (details of which have been previously mentioned) designed for labeling physiologically active leaves, taking care that the 2 cm area below the infection mark which is actively colonized is well immersed (Figure 1A). The labeling is done in the temperature controlled greenhouse to ensure the active imbibition of EdU into the leaf cells.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160315/20160315182830_7385.jpgFigure 1. EdU labelling to detect DNA synthesis in U. maydis infected maize seedlings.",
    "A. Labeling of EdU in a maize seedling to detect S phase cells in infected leaves. B. An image of the EdU labeling chamber with the lid (Left), The lid of the chamber removed for insertion of the seedling sample (Right). C. Cell division events observed in a maize seedling infected by U. maydis wild-type strain SG200 at 4 dpi. (Left) EdU incorporation into a cell will result in equally labeled contiguous daughter cells after cell division as indicated by yellow arrows. (Right) The mitotic events are nicely preserved by this EdU method of labeling (scale bars = 25 µm).After 5 h of labeling, the 2 cm area below the syringe mark on the leaves is detached and fixed in 100% (v/v) ethanol. The material is collected in 15 ml Falcon tubes. This area of the maize leaf shows maximum colonization with U. maydis as it shows chlorosis to small tumorous symptoms at 4dpi.For tassel samplesU. maydis tassel infections are performed by a syringe inoculation method by delivering 1 ml of sporidial inoculum as previously described (Walbot and Skibbe, 2010).For the tassel tissues, the EdU labeling assay is done at 3 dpi, to capture the mitotically active anthers before they switch to meiosis. At 3 dpi the immature infected tassel (anther size approx. 1-1.5 mm; Figure 2) is bathed with 1 ml of 20 µM EdU after delivery.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160321/20160321052125_2301.jpgFigure 2. Immature maize tassel at time point of EdU treatmentThe injected EdU enters through the small air spaces between the external organs of the spikelets and reaches anthers over the labeling time of 5 h.",
    "After the labeling procedure, the tassel is dissected out and around 150 anthers from different parts of the tassel were collected to ensure random sampling with equal probability of labeled anthers and fixed in 100% (v/v) ethanol 5 h after labeling.Permeabilization and staining of labeled EdUThe EdU staining procedure is done as described by implementation of a modified protocol (Kelliher and Walbot, 2011). For seedling samples, approx. 1 cm pieces of the collected tissues which are fixed in ethanol are used. For tassel samples, around 100 individual anthers from different parts of the tassel are used. The labeling procedure is done in 2 ml microcentrifuge tubes for seedling and anther samples.The fixed samples in ethanol are washed once with fresh 100% (v/v) ethanol followed by two washes in PBS (pH 7.4) + 2% (w/v) BSA. More washes with the PBS buffer are helpful for complete removal of chlorophyll from the seedling samples.The samples are then transferred to permeabilization solution [PBS +1% (v/v) Triton X-100] at room temperature for 20 min with rocking for 50-60 rotations per minute (rpm)/min. This step can also be done on a regular shaker with the same rpm. Triton treatment results in active nuclear staining and is compatible with EdU co-staining. It is known to prevent cell shrinkage and quick penetration of the fixative to allow better preservation of mitotic stages (Kotogany et al., 2010). The image representation of a cell stained with EdU and showing the well preserved mitotic event is shown in Figure 1B.The samples are washed twice in PBS + 2% (w/v) BSA then directly incubated for 30 min at room temperature with EdU Click-IT cocktail for detection. E.g., for approx. 2.5 ml EdU cocktail the following components were added (Click iT EdU reaction buffer - 2.",
    "2 ml; CuSO4 -100 µl; Alexa Fluor azide - 6 µl; Reaction buffer additive - 250 µl). For the seedling samples, 500 µl of this cocktail solution was used in each transparent microcentrifuge tube where as for anthers this corresponded to 100 µl.The EdU reaction cocktail is also supplemented with 20 μg/ml Propidium iodide (PI). This is mainly to co-stain the fungal hyphae and the non-dividing host cell nuclei. This EdU reaction cocktail is then incubated at room temperature for 50 min and then vacuum infiltrated at 250 millibar 3 times for 5 min each along with a regular interval of 5 min with atmospheric pressure.After the infiltration, the samples are washed twice in PBS (pH 7.4) + 2% (w/v) BSA, transferred to new PBS (pH 7.4), and can be kept at 4 °C in the dark (up to several days) before imaging.Microscopy of the EdU labeled leaves and anthersAll confocal analysis may be performed on a TCS SP5 confocal laser scanning microscope, or a comparable device. The laser channels used for confocal fluorescence analysis of excitation and detection wavelengths are summarized in Table 1. Tabel 1. Lasers used and the excitation and detection wavelengthtable:",
    "﻿0,1,2,3\nDetection,Excitation wavelength,Detection wavelength,Pinhole used\nEdU coupled to WGA AF488,488 nm,490-540 nm,~ 90 µm\nPropidium iodide,561 nm,570-640 nm,~ 90 µm\nAll the images taken by the Leica TCS SP5 Confocal microscope were processed and analyzed by the Leica Imaging Software."
  ],
  "subjectAreas": [
    "Microbiology",
    "Plant Science",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}