{
  "id": 9276,
  "origin_website": "Jove",
  "title": "Isolation of Distinct Cell Populations from the Developing Cerebellum by Microdissection",
  "procedures": [
    "Use of animals in this protocol has been performed in accordance with procedures approved by the Fox Chase Cancer Center Animal Care and Use Committee.\n1. Preparation of Instruments, Solutions, and Coverslips\nClean two sets of #5 fine forceps, one set of #7 fine curved forceps, one large surgical scissor, one microdissecting scissor, one spatula and one perforated spoon. Place the instruments in a self-sealing sterilization pouch and autoclave. Keep instruments in pouch until ready for use.\nPrepare a 3% low melting temperature agarose solution.\n\t\nAdd 1.5 g agarose into 50 ml of sterile Dulbecco′s Phosphate Buffered Saline (DPBS) then place in microwave and heat until bubbles appear. Swirl flask and reheat until all agarose has dissolved. Mix solution with a stir bar prior to heating if clumps appear.\nStore solution in a 37 °C water bath until needed.\nFor long-term storage, store the agarose solution for future use at room temperature or at 4 °C for months. Reheat in microwave to liquefy. For repeated heating of the agarose solution, weigh the flask before heating to maintain its initial weight with warm sterile distilled water.\nPrepare the following solutions for papain-based cell dissociation as previously described2:\n\t\nA papain solution with papain (100 U/ml), cysteine (0.2 mg/ml) and DNase (250 U/ml) in sterile phenol red-containing DPBS.\nAn ovomucoid solution with bovine serum albumin (BSA; 8 mg/ml), soybean trypsin inhibitor (8 mg/ml)) and DNase (250 U/ml) in sterile phenol red-containing DPBS.\n\t\tFilter sterilize both solutions and adjust pH to return original color of phenol red-containing DPBS.\nPrepare cell culture media (NB/B27): supplement basal media with 1 mM sodium pyruvate, 2 mM L-glutamine, 1% penicillin-streptomycin (P/S) and B27 supplement. Filter sterilize and protect from light. Equilibrate media at 37 °C and 5% CO2 before use.",
    "Prepare FACS buffer: 5% fetal bovine serum (FBS) in DPBS. Add 2.5 ml FBS to 47.5 ml DPBS.\nPrepare poly-D-lysine (PDL)-coated coverslips.\n\t\nAutoclave new glass coverslips.\nCoat the coverslips with PDL (100 μg/ml in sterile distilled water) and incubate for 2 hr at 37 °C or room temperature overnight.\nWash coverslips with sterile distilled water. Wash once with NB/B27 media. Let coverslips dry completely in tissue culture hood prior to use.\n2. Dissection and Preparation of Tissue Slices\nOn the day of dissection, wipe down the dissection area with 70% ethanol and cover with an absorbent pad.\nRemove dissection tools from the sterilization pouch. Add ice cold, sterile DPBS/1% P/S to a small Petri dish and place on ice.\nDecapitate P4 Math1-GFP/Nestin-CFP mouse pups with large surgical scissors then hold the head down with fine curved forceps. Remove the skin and gently peel away the skull with #5 fine forceps then scoop out the brain from the skull using a spatula and transfer it to the Petri dish containing DPBS/1% P/S.\n\t\nUsing #5 fine forceps, carefully separate the cerebellum from the rest of the brain. Be sure to dissect one pup at a time as quickly as possible.\nCollect a minimum of 8 cerebella in order to obtain enough NEPs for molecular and functional analyses.\nFill an embedding mold measuring 2 x 2 x 2 cm with 3% low melting temperature agarose solution. Ensure that the temperature of agarose is no more than 37 °C.\nRemove excess liquid from cerebellum by dabbing gently on a laboratory tissue. Place cerebellum into mold in a vertical position. Place the mold on ice to allow it to solidify quickly. Use ~4 cerebella per block.",
    "Obtain living tissue sections with a vibrating blade vibratome. Trim cerebella-containing agarose block with a razor blade. Glue the agarose block to the vibratome plate with cerebella oriented in a vertical position.\nFill the tray of the vibratome with ice-cold sterile DPBS/1% P/S and place ice underneath.\n\t\nCut 600 μm sections through the whole length of cerebellum. Collect sections from the ice tray using a perforated spoon. Place sections in a Petri dish filled with DPBS/1% P/S on ice.\n3. Microdissection and Cell Dissociation\nPlace the Petri dish containing tissue slices under a fluorescent dissecting microscope.\n\t\nCarefully separate the EGL from the rest of the cerebellar section using fine forceps by dissecting in between the CFP+ molecular layer and the GFP+ EGL (refer to dotted line in Figure 1). Be careful to not include any part of the molecular layer, which will result in contamination of Nestin-expressing Bergmann glia.\nComplete this step as quickly as possible and keep the tissue on ice to avoid cell death.\nRemove the agarose surrounding the tissue before proceeding to the next step.\nDigest the microdissected EGL tissue using a papain-based protocol as previously described2 to obtain a single cell suspension.\n\t\nRe-suspend cells in FACS buffer for collection of CFP-positive cells via FACS.\n4. Cell Sorting and Plating\nSort cells for CFP fluorescence using a sterile, high speed flow cytometer containing an appropriate CFP filter and collect cells in FACS buffer on ice. Obtain approximately 100,000 NEPs from each P4 cerebellum.\nCentrifuge cells at 300 x g for 5 min. Use cells immediately for molecular analysis or culture for further experimentation.\nTo culture cells, re-suspend the cells in pre-warmed NB/B27 media and plate on PDL-coated coverslips as previously described2.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}