{
  "id": 2845,
  "origin_website": "Cell",
  "title": "Protocol to analyze and validate transcriptomic changes in PDGFRβ-KO mesenchymal stem cell osteogenic potential in the mouse embryo",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCell preparation\nTiming: 4 h\nMouse (Mus musculus) embryos at day 11 of development (E11; 42–45 somite pairs), from wild type (WT, PDGRFβ+/+) and knockout (KO, PDGRFβ−/−) strains obtained by breeding heterozygous PDGRFβ+/− adults in a C57BL/6J background were used.5[href=https://www.wicell.org#bib5]\nEmbryo dissection.\nPrepare a 2.5% w/v collagenase type 1 stock solution by adding 1 g of collagenase type 1–40 mL of sterile PBS and filter using a large syringe with a 0.45 μm filter.\nNote: Aliquots of the collagenase type I stock solution can be stored in Eppendorf tubes at −20°C at long-term and thawed at room temperature (20°C–22°C) or for few minutes in a water bath at 37°C on the day of the experiment.\nCull pregnant dams and harvest the embryos on ice, in cold filtered PBS buffer solution enriched with 10% fetal calf serum (FCS), and 1% penicillin/streptomycin (PS), henceforth referred to as PBS/FCS/PS.\nNote: PBS/FCS/PS working solution should be stored at 4°C and used within 1 week.\nDissect the embryos right after in a petri-dish with PBS/FCS/PS under a stereoscope using a pair of scissors and tweezers as previously described.14[href=https://www.wicell.org#bib14]\nNote: The time to dissect can vary between scientists and thus all embryos should be kept on ice prior dissection.\nEnsure that the embryos used are at the desired stage of development by counting the somite pairs.\nTransfer a piece of tissue from each embryo (usually the yolk sac or the head) in an empty labeled 1.5 mL Eppendorf tube and proceed with genotyping immediately (protocol described in steps 3 and 4 below).",
    "Note: These tubes can be frozen at −20°C if not used on the same day. If cells are used for scRNA-seq, genotyping should be done immediately, in parallel with tissue dissection and thus, this may require 2 scientists. If AGM cells are used to derive MSCs, genotyping can be done after cells are seeded the same day or after.\nEmbryonic cell dissociation.\nDissect single AGMs and transfer them in 1.5 mL Eppendorf tubes (1 AGM/tube), containing 190 μL of PBS/FCS/PS.\nAdd 10 μL of collagenase type I from the stock solution (1:20, final 0.125% w/v) to each Eppendorf and incubate in a water bath at 37°C for 45 min.\nCritical: Do not leave the tissue for longer than 45 min since it may be detrimental to cell viability.\nAt room temperature (20°C–22°C), mechanically disrupt the remaining tissue by gently pipetting up and down using a P200 pipette. Repeat until the tissue is not visible anymore.\nWash the cells by adding 1 mL of cold PBS/FCS/PS in each tube.\nCentrifuge for 10 min, at 2,000 rpm and 4°C (pre-cooled).\nDiscard the supernatant and resuspend the cell pellet in either PBS/FCS/PS for library preparation or MSC media for culture.\nDNA extraction.\nAdd 100 μL of Extraction Solution and 25 μL of Tissue Preparation Solution to each sample.\nIncubate and shake all samples in a pre-heated shaker at 55°C for 10 min.\nProceed to DNA denaturation by transferring tubes, without lid, to a pre-heated heating block at 95°C for 3 min.\nRemove tubes from the heating block and add 100 μL of Neutralization Solution B, then vortex for a few seconds.",
    "Store genomic DNA on ice for a few minutes while preparing the Polymerase Chain Reaction (PCR) mix. Alternatively, genomic DNA can be stored for the next day at 4°C or for up to a month at −20°C.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2349-Fig1.jpg\nFigure 1. PDGFRβ-KO genotyping example\nThe upper band represents the ko allele (320 bp), while the lower band represents the wt allele (114 bp). Samples 1, 2, 3, 4, 6, 7 and 10 are PDGFRβ +/- (heterozygous), 5 and 11 are PDGFRβ +/+ (WT) and 9 is PDGFRβ −/− (KO).\nPCR and electrophoresis.\nPrepare a PCR master mix. For one sample, add 13.9 μL of autoclaved dH2O, then 2 μL of Coral Load Buffer 10×, 1 μL of 25 mM MgCl2, 1 μL of 10 mM dNTPs, 0.1 μL of each of the 3 following primers: Forward ACA ATT CCG TGC CGA GTG ACA G, WT Reverse AAA AGT ACC AGT GAA ACC TCG CTG and KO Reverse ATC AGC CTC GAC TGT GCC TTC TAG, and 0.3 μL of HotStarTaqPlus DNA polymerase (5 U/μL).\nNote: Reagents such as the Coral Load Buffer, MgCl2 solution and DNA polymerase are included in the Hot Start Taq Plus kit. All other reagents should be ordered separately.\nDispense 18 μL of the mix to a 0.2 mL PCR tube and add 2 μL of the genomic DNA sample for a total volume of 20 μL by a short spin down.",
    "Add the PCR reaction tubes to a thermocycler and run the following program (it takes approx. 120 min): 1 cycle at 95°C for 5 min for initial DNA denaturation, 35 cycles of denaturation at 95°C for 1 min, primer annealing at 58°C for 1 min, extension at 72°C for 1 min, followed by 1 cycle for 10 min at 72°C for the final extension and hold at 10°C until stop instruction.\nPrepare 1.5% agarose gel in 1× TAE Buffer with SYBR®Safe DNA gel stain at 1:10 dilution.\nLet gel polymerize in the chemical hood at room temperature (20°C–22°C) for at least 20 min.\nSet up the polymerized gel in an electrophoresis tank, previously filled with fresh 1× TAE, and load a DNA molecular weight marker (20 μL of EasyLadder I).\nLoad the samples and run the gel at 115 V and 400 mA, for 90 min.\nAnalyze gel with a UV transilluminator and read the bands for WT at 114 bp and the KO at 320 bp (Figure 1[href=https://www.wicell.org#fig1]).\nNote: The details described above are optimized for this PDGRFβ mouse strain and may differ from other murine strains.\nSingle-cell RNA-sequencing data analysis\nTiming: days to weeks\nThis major step describes an end-to-end analysis of scRNA-seq data, to understand the changes occurring in mesenchymal stem/stromal cells (MSCs) in the PDGFRβ-KO AGM at a single-cell resolution. The analysis steps broadly correspond with the OSCA Bioconductor workflow, based on the scran10[href=https://www.wicell.org#bib10] and scater8[href=https://www.wicell.org#bib8] Bioconductor packages15[href=https://www.wicell.org#bib15]; similar steps may be carried out via the Seurat Bioconductor package.16[href=https://www.wicell.org#bib16] Code examples generally refer to a single sample (which we refer to as ‘sce_wt’); the analysis steps are almost identical for both WT and KO samples.\nLibrary preparation for single-cell analysis.",
    "Prepare dissociated AGMs in a single-cell suspension as mentioned above to be processed for sample loading and library preparation as described in the protocol “Chromium Next GEM Single Cell 3′ Reagent Kits User Guide (v3.1 Chemistry[href=https://www.10xgenomics.com/support/single-cell-gene-expression/documentation/steps/library-prep/chromium-single-cell-3-reagent-kits-user-guide-v-3-1-chemistry])” by 10x Genomics.\nLoad 7 × 103 cells in the Chromium Next Gem Chip G, viable cells are counted in a 1:1 trypan blue ratio (cell range set for 8–11 μm) to calculate the volume of cell suspension required.\nNote: A table is provided in the 10x Genomics protocol to cross cell stock concentration (cell/μL) and the desired targeted cell recovery (for example 7 × 103 cells).\nSingle-cell libraries are to be obtained according to the manufacturer’s protocol which consist of barcoding, amplifying cDNA, gel-emulsion droplets (GEM) generation and cDNA amplification and quantification, detailed here: “Chromium Next GEM Single Cell 3′ Reagent Kits User Guide (v3.1 Chemistry[href=https://www.10xgenomics.com/support/single-cell-gene-expression/documentation/steps/library-prep/chromium-single-cell-3-reagent-kits-user-guide-v-3-1-chemistry])”.\nQuantify RNA concentration and the quality of the libraries.\nSend your libraries to sequencing.\nGenerating single-cell count matrices.\nTransfer your sequencing data from the sequencing facility to the computer where the data will be processed.\nNote: The exact steps for data transfer will vary, depending on your sequencing provider and your local compute infrastructure.\nAt the command line, use 10x Genomics Cell Ranger to generate single cell feature counts for each sample separately, running “cellranger count” with the reference dataset previously downloaded.\nNote: Here, we used 10x Genomics reference mm10/GRCm38–3.0.0. The ‘id’ parameter can be specified to label the sample (eg.: as WT or KO).\n$ cellranger count --id=SAMPLE_ID\n          --transcriptome=/path/to/reference/refdata-cellranger-mm10-3.0.0\n          --fastqs=/path/to/sample/fastqs\nImport and filter single-cell data.\nDownload the ‘raw_feature_bc_matrix’ directory output from cellranger count for each sample: this will contain three files: barcodes.tsv.gz, features.tsv.gz and matrix.mtx.gz.\nIn R, use read10xCounts() from the DropletUtils Bioconductor package7[href=https://www.wicell.org#bib7] to import the Cell Ranger output into R in the SingleCellExperiment format.",
    "#import cell ranger output and assign to ‘sce_wt’ object\n> sce_wt <- read10xCounts(\"/path/to/raw_feature_bc_matrix\", col.names=T)\nGenerate barcode rank plots (Figure 2[href=https://www.wicell.org#fig2]) to monitor the distribution of barcode counts, then run emptyDrops() to identify empty droplets. Remove cells predicted to contain only ambient RNA, using the default false discovery rate (FDR) of 0.1%.\n#generate barcode rank plot for ‘sce_wt’ object\n> bcrank_wt <- barcodeRanks(counts(sce_wt))\n> uniq_wt <- !duplicated(bcrank_wt$rank)\n> plot(bcrank_wt$rank[uniq_wt],bcrank_wt$total[uniq_wt],\n    log=\"xy\",xlab=\"Rank\",ylab=\"Total UMI count\",\n    cex.lab=1.2)\n> abline(h=metadata(bcrank_wt)$inflection,\n      col=\"darkgreen\",lty=2)\n> abline(h=metadata(bcrank_wt)$knee,\n      col=\"dodgerblue\",lty=2)\n> legend(\"bottomleft\",legend=c(\"Inflection\",\"Knee\"),\ncol=c(\"darkgreen\",\"dodgerblue\"),lty=2,cex=1.2)\n#remove cells with only ambient RNA via emptydrops\n> e.out_wt <- emptyDrops(counts(sce_wt))\n> sce_wt <- sce_wt[,which(e.out_wt$FDR<=0.001)]\nNote: As of v3, Cell Ranger implements a version of the EmptyDrops algorithm that provides similarly filtered barcode matrices, in the ‘filtered_feature_bc_matrix’ directory.\nAnnotate and perform quality control on single-cell data.\nIdentify mitochondrial genes by annotating each sample using Bioconductor’s AnnotationHub service with an appropriate reference.\nNote: Here, we used Ensembl mm38.93 for annotation, to match that used in the creation of the 10x Genomics reference.\n#import ensembl annotation\n> ensdb_mm38.93 <- AnnotationHub()[[\"AH64461\"]]\n> chr_loc <- mapIds(ensdb_mm38.93, keys=rownames(sce_wt),\n            keytype=\"GENEID\", column=\"SEQNAME\")\n> is.mito <- which(chr_loc==\"MT\")\nCalculate the library size, number of expressed features and percentage of mitochondrial reads for each cell using perCellQCMetrics() from the scuttle Bioconductor package: (Figure 3[href=https://www.wicell.org#fig3]).\nUsing the median absolute deviation (MAD) definition of outliers and perCellQCFilters(), remove cells with any quality metric more extreme than 3 MADs from the median.\nFinally, remove any cells with detectable PDGFRβ expression from the KO sample.\n#compute QC metrics for ‘sce_wt’\n> df <- perCellQCMetrics(sce_wt, subsets=list(Mito=is.mito))\n> qc <- perCellQCFilters(df,\n              sub.fields=c(\"subsets_Mito_percent\"))\n#filter out low quality cells\n> sce_wt <- sce_wt[,!qc$discard]\n#remove cells with Pdgfrb expression from KO sample only:\n> sce_ko <- sce_ko[,(counts(sce_ko)[rowData(sce_ko)$Symbol==\"Pdgfrb\",]==0)]\nNormalization and feature selection.",
    "Prepare for normalizing the expression data for each sample by running scran’s quickCluster algorithm. This is intended to quickly estimate clusters of cells with distinct expression profiles.\nUse the resultant clusters as input to computeSumFactors(), which implements a deconvolution method10[href=https://www.wicell.org#bib10] for scaling normalization of sparse count data.\nNote: We specify ‘min.mean = 0.1’ in the call to computeSumFactors(), to define the minimum (library size-adjusted) average count of genes to be used for normalization. Setting this parameter avoids using very low-abundance genes for the sum factor computation: if too many genes have consistently low counts across all cells, the computed size factors may be close to zero.\nRun the normalization using the computed size factors with logNormCounts().\nModel the variance of the log-expression profile for each gene using scran’s modelGeneVarByPoisson() function. This function decomposes log-expression into technical and biological components based on a mean-variance trend corresponding to Poisson noise and utilizes the size factors computed earlier.\nFinally, define highly variable genes (HVGs) for each sample using getTopHVGs().\n#quickly estimate clusters of cells and compute sum factors\n> wt_clusters <- quickCluster(sce_wt, use.ranks=F,\n                BSPARAM=IrlbaParam())\n> sce_wt <- computeSumFactors(sce_wt, min.mean=0.1,\n                cluster=wt_clusters)\n#run the normalization\n> sce_wt <- logNormCounts(sce_wt)\n#modelling gene variation:\n> dec_pois_wt <- modelGeneVarByPoisson(sce_wt)\n#define highly variable genes:\n> hvg_pois_wt <- getTopHVGs(dec_pois_wt)\nNote: modelGeneVar() performs a similar function to modelGeneVarByPoisson(), but tends to understate biological variation in heterogeneous datasets, such as whole unfractionated AGM, as we analyze here.\nDimensionality reduction and visualization.\nUse denoisePCA() to perform dimensionality reduction via principal components analysis (PCA) to eliminate random technical noise in the data. This function utilizes both the model of gene variance and the HVGs defined previously.",
    "Note: In Sá da Bandeira et al., we explicitly set the number of principal components (PCs) to retain using the min.rank and max.rank parameters as shown in this code example. These parameter settings were chosen based on an exploratory PCA, followed by analysis of the resulting scree plots (example in Figure 4[href=https://www.wicell.org#fig4]). The scree plot illustrates the proportion of variance explained by each PC: the number of PCs to retain is often chosen by identifying an ‘elbow’ on the plot, beyond which retaining additional PCs explains little additional variance.\n#run PCA\n> sce_wt <- denoisePCA(sce_wt,\n              technical=dec_pois_wt,\n              subset.row=hvg_pois_wt,\n              min.rank=10, max.rank=10)\nCritical: The same number of PCs must be retained in all samples to subsequently integrate the samples downstream (step 13), since Batchelor’s correctExperiments() function combines the dimensional reduction matrices for each sample and these are required to be the same size. Subsequently, we are required to choose a number of PCs which explain sufficient variation in all samples.\nEach sample may be visualized as t-SNE or UMAP plots via scater’s runTSNE() and runUMAP() functions; both utilize the PCA reduction just computed.\n#run TSNE, UMAP\n> sce_wt <- runTSNE(sce_wt, use_dimred=\"PCA\")\n> sce_wt <- runUMAP(sce_wt, use_dimred=\"PCA\")\n#plot (example for TSNE)\n> plotReducedDim(sce_wt, \"TSNE\")\nNote: It is often useful to compare t-SNE reductions of different perplexities17[href=https://www.wicell.org#bib17] side-by-side. Rather than using runTSNE(), it may be advantageous to run the Rtsne() function underlying runTSNE() directly, specifying the desired perplexity and storing the resulting matrix in the reducedDims slot of the SingleCellExperiment object with an appropriate name (eg “TSNE30” rather than “TSNE”).\n#manually run, store TSNE reductions of different perplexity #here, for example, perplexity=30\n> t30 <- Rtsne(reducedDim(sce_wt,\"PCA\"), pca=FALSE,\n        perplexity=30)\n> reducedDims(sce_wt)$TSNE30 <- t30$Y\nClustering.\nConstruct a shared nearest-neighbor (SNN) graph for each sample, using scran’s buildSNNGraph() function.",
    "Compute an initial clustering for each sample (Figure 5[href=https://www.wicell.org#fig5]), by using the SNN graph as input to the Walktrap community finding algorithm, using the cluster_walktrap() function from the igraph R package.\n#construct SNN graph\n> g_wt <- buildSNNGraph(sce_wt, use.dimred = \"PCA\")\n#compute initial clustering\n> clust_wt <- igraph::cluster_walktrap(g_wt)$membership\n> sce_wt$initial_clusters <- factor(clust_wt)\nNote: In Sá da Bandeira, et al. we use the Walktrap algorithm, but the igraph package allows for the use of other community-finding algorithms, such as Louvain.1[href=https://www.wicell.org#bib1] It may be worthwhile experimenting with different algorithms to explore the robustness of any cell clusters.\nApply doublet detection to each sample, for example via scDblFinder’s computeDoubletDensity() function, which simulates random artificial doublets from real cells and tries to identify cells whose neighborhood has a high local density of artificial doublets.\n#doublet detection\n> dbl_den_wt <- computeDoubletDensity(sce_wt,\n                        subset.row=hvg_pois_wt))\n> sce_wt$doubletScore <- log1p(dbl_den_wt)\nNote: It is important to make sure that doublet detection is carried out on individual samples, prior to any merging or integrating processes; by definition, doublet cells can only arise from a single library. Clusters principally driven by a population of cells with high predicted doublet scores may be discarded; otherwise, we recommend keeping all cells, retaining their doublet score metadata for examination downstream if required.\nCell type annotation. In Sá da Bandeira et al., we combined marker data computed on the clusters defined above (using scran’s scoreMarkers() function) with literature-based markers for cell type annotation.1[href=https://www.wicell.org#bib1] Cell type annotations were assigned either based on the clustering computed above, or by the expression of known markers, as in the following code example:\n#annotation based on cluster number\n#1: annotating cells from a single cluster\n> sce_wt$cell_type[sce_wt$initial_clusters==0] <- \"Cell_type_A\"\n#2: annotating cells from multiple clusters\n> sce_wt$cell_type[sce_wt$initial_clusters %in% c(1,2)] <- \"Cell_type_B\"\n#annotation based on positive expression of \"Gene\"",
    "> sce_wt$cell_type[logcounts(sce_wt)[rowData(sce_wt)$Symbol==\"Gene\",]>0] <- \"Cell_type_C\"\nFollowing annotation, cells can be grouped and visualized by cell type (Figure 6[href=https://www.wicell.org#fig6]), rather than by the automated clusters defined previously (Figure 5[href=https://www.wicell.org#fig5]).\nFirst define non-perivascular cell types:\nPtprc (CD45)+: Macrophage/Macrophage Progenitor (MP) clusters are identified by strong expression of Adgre1 (F4/80) and Ptprc (CD45).\nPecam1 (CD31)+: EC/HEC/IAHC further separated by additional markers; intra-aortic hematopoietic clusters (IAHCs) are Kit+, and endothelial cells/hemogenic endothelial cells (EC/HECs) are Kit- Ptprc (CD45)- Runx1- and Runx1+ respectively.\nA cluster of cells enriched in Pf4 (also expressed by some MPs), but not expressing CD45, are annotated as Other Blood Cells (OBCs), likely platelets.\nErythroid cells and their progenitors (Ery/EryP) are marked by expression of Gypa.\nCell clusters deriving from the sympathetic nervous system (SNS) and skeletal muscle progenitors (SkMP) are enriched in Ngfr and Myod1, respectively.\nDefine perivascular cell types.\nPerivascular cell types were defined as Cspg4+ and/or Pdgfrb+ if they had positive log-expression of these genes. These are defined as pericytes/vascular smooth muscle cells (PC/vSMCs), also named double positive cells (DP, NG2+PDGFRβ+), and are surrounded by PDGFRβ-single (PDGFRβ-S, NG2-PDGFRβ+) and double negative cells (DN, NG2-PDGFRβ-).1[href=https://www.wicell.org#bib1]\nNG2-single cells (NG2-S, NG2+PDGFRβ-) were found around the notochord.1[href=https://www.wicell.org#bib1]\nNote: Cell types present (especially rare cell types) may be found in different proportions, based on the specific samples sequenced. Cell types may also be combined or split based on the research question. During the annotation process, it is helpful to visualize the expression of literature-based markers, at both the cluster level and at a sample level using violin and t-SNE plots.\nMerging samples.",
    "Merge the WT and KO samples using correctExperiments() from the batchelor Bioconductor package9[href=https://www.wicell.org#bib9]; this function applies a batch correction while combining the assay data and column metadata for downstream analysis. correctExperiments() retains batch information in the batch slot and we update this to a more useful label.\n#merging WT and KO samples\n> merged <- correctExperiments(sce_wt_filt, sce_ko_filt,\n                  PARAM=FastMnnParam())\n> merged$batch <- factor(merged$batch)\n> levels(merged$batch) <- c(\"WT\",\"KO\")\nApply dimensional reduction and clustering to the merged dataset, as described above (steps 10 and 11).\nt-SNE visualization of the merged dataset in conjunction with the cell type annotations defined above (step 12) should confirm a clustering of cells by cell type, rather than genotype.\nDifferential expression analysis.\nUse scran’s pairwiseWilcox() function to perform differential expression analysis between groups of cells in the merged SingleCellExperiment object. The function requires a vector of group assignments for the ‘group’ parameter, which is most easily specified as a combination of batch and cell type. The desired comparison can be made by specifying a vector of the relevant groups for the ‘restrict’ parameter.\n#generate batch + cell type labels\n> merged$batch_celltype <- paste(merged$batch,\n                    merged$cell_type, sep=\"_\")\n#differential expression analysis\n> pww <- pairwiseWilcox(logcounts(merged),\n              groups=merged$batch_celltype,\n              restrict=c(\"WT_Cell_type_A\",\n                    \"KO_Cell_type_A\"),\n              gene.names=rowData(merged)$Symbol,\n              direction=\"up\")\nThe output from pairwiseWilcox() is a list of two elements: ‘statistics’ and ‘pairs’: ‘statistics’ (itself a list of DataFrames) contains the differential expression statistics, including the AUCs (the effect size), p-values and false discovery rate (FDR) values for each gene.\n#example pairwiseWilcox() output\n> head(pww$statistics[[1]])\nDataFrame with 6 rows and 3 columns\n            AUC       p.value             FDR\n      <numeric>      <numeric>      <numeric>\nGene1   0.606633   4.685919e-86   8.225655e-85\nGene2   0.603982   6.134690e-82   1.039850e-80\nGene3   0.600158   3.521710e-76   5.637097e-75\nGene4   0.599188   9.388226e-75   1.485138e-73\nGene5   0.594001   2.326035e-67   3.460966e-66\nGene6   0.591236   1.402869e-63   2.013091e-62",
    "Note: Other statistical tests may be used (eg t-tests via the pairwiseTTests() function). Here, we used Wilcoxon rank sum tests since they are considered more robust to outliers and insensitive to non-normality in comparison to t-tests. We note, however, that the disadvantages of Wilcoxon rank sum tests compared to t-tests include their longer running time, and the reported effect sizes of Wilcoxon rank sum tests are less interpretable.10[href=https://www.wicell.org#bib10]\nFunctional analysis. Associate significantly differentially expressed genes (DEGs) with Gene Ontology (GO) terms:\nDefine DEGs as genes with FDR<0.05 and use their gene symbols as input to the PANTHER web resource [http://pantherdb.org/[href=http://pantherdb.org/]].18[href=https://www.wicell.org#bib18]\nSelect ‘Mus musculus’ as the organism and ‘Statistical overrepresentation test’ as the analysis, with ‘GO biological process complete’ as the annotation set.\nNote: By default, PANTHER returns only significant (FDR<0.05) biological processes.\nManually curate the significantly overrepresented GO terms for terms relating to osteogenesis.\nSearch GO terms of interest in the AmiGO web resource [http://amigo.geneontology.org/amigo[href=http://amigo.geneontology.org/amigo]], which lists genes associated with a given GO term.\nDownload the associated genes for any GO terms of interest and cross-reference these with the DEGs to find genes which contributed most strongly to these GO terms (either by significance, or by the AUC (effect size) computed by the Wilcoxon rank sum test) (Figure 7[href=https://www.wicell.org#fig7]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2349-Fig2.jpg\nFigure 2. Barcode rank plots for WT and KO samples",
    "Barcode rank plots show the distribution of barcode counts and which barcodes were inferred to be associated with cells. The inflection and knee points correspond to transitions in the distribution of barcode counts, reflecting the difference between good quality droplets with many associated barcodes, and poor quality droplets, or those containing only ambient RNA. The plots should show a clear separation of these two groups of droplets, with a population of good quality droplets with high UMI counts above the knee point, followed by a sharp decrease in the number of UMIs associated with droplets.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2349-Fig3.jpg\nFigure 3. Cell-based quality control metrics\nHistograms illustrating three cell-based quality control metrics. Dashed lines indicate computed thresholds 3 MADs away from the median: any cell with any quality metric more extreme than 3 MADs away from the median is removed from downstream analysis.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2349-Fig4.jpg\nFigure 4. PCA scree plot\nPCA scree plot illustrating the proportion of variance explained by each principal component. The red line indicates an ‘elbow’ point beyond which retaining additional principal components for downstream analysis provides little additional information.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2349-Fig5.jpg\nFigure 5. Initial WT cell clustering\nAn initial cell clustering for the WT sample is computed by the Walktrap algorithm and used as a basis for cell type annotation.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2349-Fig6.jpg\nFigure 6. Final WT cell type annotations\nFollowing cell type annotation, the number of cell clusters is reduced and mapped to biologically relevant cell types.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2349-Fig7.jpg\nFigure 7. Scatterplot of effect size (reported as area under the ROC curve, AUC) vs significance, for genes associated with the GO term ‘Regulation of osteoblast differentiation’ (GO:0045667)\nThis GO term is significantly overrepresented in genes significantly downregulated in the PDGFRβ-KO niche.1[href=https://www.wicell.org#bib1] Significantly downregulated genes are plotted in red and selected genes are labeled.\nMesenchymal stem/stromal cell (MSC) derivation and culture",
    "Timing: days to weeks\nWe developed a mesenchymal cell culture to investigate whether the osteogenic developmental potential of PDGFRβ−/− AGM-derived MSCs is impaired as suggested by our scRNA-seq data analysis in vivo. We first tested whether mesenchymal stem/stromal cell lines can be derived from single WT AGMs then whether MSCs can be derived in the absence of PDGFRβ. The specific steps are as follows:\nPrepare MSC medium.\nHeat-inactivate the FCS for 30 min in a 56°C water bath.\nMix all medium components (See table in “reagents and materials” section) in a steritop filter, connected to a stericup by a vacuum pump by adding the largest volumes first.\nFilter and label the solution.\nNote: This media has been previously described4[href=https://www.wicell.org#bib4] and should be stored at 4°C for 1 month.\nSeeding of AGM cells.\nPre-coat a 6-well plate with 2 mL of sterile 0.1% cold gelatin for at least 1 h at room temperature (20°C–22°C) or 10 min at 4°C.\nGently aspirate out the remaining gelatin and proceed without washing.\nResuspend cell pellets obtained from a single AGM in 3 mL of MSC medium. A number of 21.2 +/- 6.2 × 104 cells are expected to be obtained from single E11 AGMs.14[href=https://www.wicell.org#bib14]\nSeed each single suspension in one well in a pre-coated 6-well plate (=passage 0).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2349-Fig8.jpg\nFigure 8. Phase-contrast images of PDGFRβ+/+ (WT, left) and PDGFRβ−/− (KO, right) single AGM-derived MSCs taken with Evos Digital Inverted Microscope\nScale: 100 μm.\nNote: After 24 h, the cells should be completely adherent to the bottom of the well.\nMaintenance and expansion of AGM-derived MSCs.\nIn the first week, refresh the stromal medium only once, approx. 2–3 days after cells were first seeded.",
    "When the wells are >90% confluent (approx. 4–6 days), passage the cells from one well of a 6-well plate to one gelatin pre-coated T25 flask (=passage 1) using pre-warmed Trypsin + EDTA (0.25%) to detach the adherent cells.\nFrom here on, refresh the medium bi-weekly.\nWhen the T25 flasks are >90% confluent (approx. 1 week), passage the cells from one T25 flask to one gelatin pre-coated T75 flasks (=passage 2) using 0.25% Trypsin + EDTA to detach the adherent cells for approx. 12–15 min.\nWhen the T75 flasks are >90% confluent (approx. 1 week), expand the culture at a 1:3 ratio (from one T75 to three T75 flasks and so on) for the following weeks and passages.\nNote: When we initiate the culture with freshly harvested cells (passage 0), some MSC primary lines require 2–3 extra days to expand. This is a relatively short time and does not influence their growth or their differential potential at later stages. We were able to expand these cells and freeze/thaw them regularly for about 12 passages, independently of their genotype. However, their osteogenic potential was only tested between passage 3 and passage 6 while their hematopoiesis support was tested up to passage 12.1[href=https://www.wicell.org#bib1]\nCritical: Cells need to be kept in the incubator at 37°C and 5% CO2 at all times.\nAfter expansion, a fraction can be used for experiments and the remaining cells can be frozen and stored in liquid N2 or passaged.",
    "Note: To freeze MSCs, use around 0.5–1 × 106 cells per cryovial with 90% cold FCS and 10% dimethyl sulphoxide (DMSO). To thaw cells, first prepare a 50 mL falcon tube containing 30 mL of PBS/FCS/PS. Keep the cryovial in the water bath at 37°C for a few seconds until the frozen block starts to detach, then rapidly transfer the frozen block to the 50 mL falcon tube in the tissue culture hood. Centrifuge cells at 4°C and 2,000 rpm for 5 min. Discard the supernatant, resuspend the pelleted cells with MSC medium and transfer to a gelatin pre-coated T75 flask, then incubate them at 37°C. After 24 h, renew the medium to discard the floating cells. Proceed as normal.\nBoth WT and KO stromal cells should show a fibroblast-like morphology and resemble MSCs (Figure 8[href=https://www.wicell.org#fig8]).\nFunctional validation: Osteogenesis assay\nTiming: 3–4 weeks\nMesenchymal stem/stromal cells are multipotent and therefore they are able to differentiate into bone, adipose tissue, and cartilage.19[href=https://www.wicell.org#bib19] Since we found a significant downregulation in osteogenic gene expression (step 14), and mesenchymal and osteogenic differentiation biological processes were significantly affected (steps 15 and 16), we performed an osteogenic assay using our expanded WT and KO-derived single AGM stromal cell cultures (steps 17–19)1[href=https://www.wicell.org#bib1] to validate the functional changes. To reveal calcium deposits, we used an alizarin red solution.\nPrepare solutions.\nIn a 100 mL flask prepare the osteogenic medium.\nMix thoroughly and filter.\nNote: This media should be stored at 4°C for no longer than 1 month.\nIn a 100 mL flask prepare the control osteogenic medium.\nMix thoroughly and filter.\nNote: This media should be stored at 4°C for no longer than 1 month.",
    "In a medium Schott flask, prepare the Alizarin red solution. The pH of this solution needs to be adjusted to 4.1–4.3. Do this by adding HCl or NH4OH as needed.\nNote: This media should be stored at room temperature (20°C–22°C), for 1 month while protected from light covered with aluminium foil.\nCell differentiation assay.\nSeed 4 × 104 MSCs per well in a 24-well plate with MSC medium.\nAfter 24 h of culture, remove the medium gently, and replace with 500 μL of either osteogenic or control media.\nNote: The plates are uncoated to avoid autofluorescence upon staining. Cells need to be at least 80%–90% confluent otherwise more time is needed to have a good cell coverage. The osteogenic medium will trigger the cells to differentiate towards the osteogenic lineage only if cells have this potential, while the control medium will not.\nIncubate the plate at 37°C and 5% CO2 for 21 days.\nRefresh the media three times every week.\nAlizarin red staining to allow detection of calcium deposition.\nOn day 21, discard the osteogenic and control media.\nWash the wells gently with Milli-Q water to remove any media left.\nFix cells by incubating the wells with 4% PFA for 10 min at room temperature (20°C–22°C).\nRemove the PFA and wash twice with Milli-Q water.\nAdd 500 μL of alizarin red solution to each well, including both differentiated and control wells, for 15 min at room temperature (20°C–22°C) and in the dark.\nNote: It is important to be careful with this alizarin red solution since it easily leaves a stain mark on clothes, surfaces etc.\nCarefully remove alizarin red solution and wash twice with Milli-Q water.\nPerform a third wash with Milli-Q water but do not discard.\nImage the full wells with a brightfield microscope.",
    "Note: Stained wells can be carefully washed several times if the water is still red. Stained plates can be imaged right after the staining or kept at 4°C for several days prior imaging. In this protocol, a Zeiss Axio Observer was used and images were analyzed with Fiji/ImageJ software (v. 1.52p).\nBrightfield image analysis.\nIn the ZEN 2.3 Pro software, upon image acquisition, select the tiling and stitching options to generate high-resolution pictures of your full wells.\nExport stitched tiled images in the .czi format.\nIn Fiji/ImageJ software, import .czi images to adjust the brightness using the same settings for all wells.\nExport the final image in .tiff format.\nPerform a qualitative observation of which MSC lines are osteogenic, if you detect alizarin red staining or low/no osteogenic, if you detect low to no staining.\nNote: A quantitative measure can be done in these samples by reading the plate on a spectrophotometer at a wavelength of 450 nm."
  ],
  "subjectAreas": [
    "Rnaseq",
    "Bioinformatics",
    "Stem Cells",
    "Cell Biology",
    "Developmental Biology",
    "Cell Differentiation",
    "Gene Expression",
    "Molecular Biology",
    "Single Cell"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology"
  ]
}