{
  "id": 13092,
  "origin_website": "Jove",
  "title": "Establishing Organoids from Human Tooth as a Powerful Tool Toward Mechanistic Research and Regenerative Therapy",
  "procedures": [
    "All methods described here have been approved by the Ethics Committee Research UZ/KU Leuven (13/0104U). Extracted third molars (wisdom teeth) were obtained after patients' informed consent.\n1. Preparations\nPrewarm a 48-well culture plate for 15-20 h in a 1.9% CO2 incubator at 37 °C.\nLiquefy a Matrigel aliquot (growth factor-reduced; phenol red-free; further referred to as basement membrane matrix; BMM) on ice (4 °C) for a minimum of 2 h prior to step 2.1.\n\tNOTE: Avoid freeze/thaw cycles of the BMM. Liquefy the BMM for 15-20 h on ice and aliquot at 1 mL in microcentrifuge tubes and store at -20 °C.\nCool the centrifuge to 4 °C.\nPrepare media and filter the solution through a 0.22 µm filter. The following volumes are based on the collection of the DFs from all four third molars typically simultaneously extracted.\n\t\nPrepare 20 mL of DF collection medium (Table 1): minimum essential medium eagle (αMEM) containing 10% fetal bovine serum (FBS), 0.5% Amphotericin B and 1% penicillin-streptomycin. Transfer 4 mL of DF collection medium to a 15 mL tube and transfer the tubes on ice.\n\t\tNOTE: One 15 mL tube is sufficient per patient for sample collection (i.e., for four third molars).\nMake 20 mL of tooth organoid medium (further referred to as TOM; Table 2) using serum-free defined medium (SFDM; Table 3). Store TOM at 4 °C for a maximum of 2 weeks.\nPrepare 8 mL of dissociation medium (Table 4), i.e., phosphate-buffered saline (PBS) containing collagenase VI (3 mg/mL ) and dispase II (4 mg/mL). Prewarm the dissociation medium in a 37 °C water bath for at least 10 min before use and transfer it to two 15 mL tubes (4 mL per tube) to dissociate four DF tissues.",
    "Prepare a washing plate (12-well) containing: three wells with 70% EtOH, three wells with PBS, and three wells with DF collection medium.\nMake 15 mL of medium A per sample (i.e., 5 mL per two DFs per patient; Table 5).\n\t\t​NOTE: The following steps should be performed under sterile conditions.\n2. Dental follicle dissociation\nOnce the third molars with associated DFs are collected in the collection medium (on ice), transfer the content of the tubes to a Petri dish.\nHold the tooth with a tweezer and carefully isolate the DF using a surgical blade.\n\tNOTE: This step requires practice; be careful with the blade.\nTo wash the remaining blood off the DFs, place the DF tissues briefly in the first well of 70% EtOH (washing plate) for 20 s, and then transfer to the next EtOH well for 20 s, and further to the third EtOH well (maximum 1 min in 70% EtOH in total; longer incubation time will result in reduced cell viability).\nNext, continue rinsing in the three PBS wells (maximum 2 min in total).\nRinse the DFs in the three remaining DF collection medium wells (up to a maximum of 20 min in total).\nTransfer the rinsed DFs to a new Petri dish.\nCut a small piece of one of the DFs (~5 mm2) for paraformaldehyde (PFA) fixation (see section 7) and store it on ice (for a maximum of 6 h) in a microcentrifuge tube containing 500 µL of DF collection medium until PFA fixation.\nMince the rest of the DFs in small pieces (~1 mm2).",
    "NOTE: It is advised to immediately process the freshly isolated DF tissues for the optimal organoid formation and growth efficiency, rather than to start from cryopreserved tissue, which results in lower efficiency. Nevertheless, it is possible to cryopreserve primary DF tissue at this step (see cryopreservation medium and protocol at section 5).\nTransfer the minced DFs to a 15 mL tube containing 4 mL of prewarmed dissociation medium and incubate in a 37 °C water bath for 2 h.\n\tNOTE: Add two DFs per 4 mL prewarmed dissociation medium (one tube) to assure optimal dissociation.\nEvery 15 min, pipet the DF-dissociation medium mix up and down using a glass Pasteur pipet to speed up the tissue disintegration. When DF pieces are no longer observed (usually after 1 h), proceed with DF dissociation using a narrowed fire-polished Pasteur pipet.\n\tNOTE: For optimal DF dissociation, switch to a Pasteur pipet narrowed by fire-polishing no later than 1 h of DF isolation.\n\t\nIn the meantime, prepare 10 mL of medium A containing 50 µL of DNase (0.2 mg/mL; Table 5).\nAdd 5 mL of medium A (containing the DNase) to each tube with dissociated DF, and incubate for 1 min at room temperature (RT).\nFilter the cell suspension (containing single cells and small cell clumps) through a 40 µm cell strainer to remove the remaining large fragments and (most of) the fibrous tissue.\n\t\nCombine the several tubes with dissociated DF from one patient at this step.\nRinse the filter with 1 mL of medium A. Centrifuge the filtered cell suspension at 200 x g for 10 min at 4 °C.\nRemove the supernatant, resuspend the pellet in 1 mL of SFDM (Table 3), and transfer the cell suspension to a 1.5 mL microcentrifuge tube.",
    "Calculate the cell concentration using an automated cell counter. Neglect the cell clumps that remain.\nCentrifuge at 200 x g for 5 min at 4 °C.\n3. Establishment of tooth organoid culture (Figure 1A and Figure 2A)\nBased on the obtained cell number, calculate the number of wells that can be seeded. One 20 µL droplet should contain 20,000 cells. The final mix is composed of cell suspension and BMM at a ratio of 30:70.\nRemove the appropriate amount of supernatant and resuspend in ice-cold BMM to obtain a 70:30 ratio of BMM: cell suspension for plating. For example, when 200,000 cells are obtained, plate 10 droplets of 20 µL. Thus, remove the supernatant until 60 µL of the cell suspension is left, add 140 µL of ice-cold BMM and resuspend.\n\t\nResuspend slowly to avoid air bubble formation. Once resuspended in BMM, keep the microcentrifuge tube on ice.\n\t\tNOTE: Keeping the microcentrifuge tube on ice is crucial to avoid BMM solidification.\nPipet the 20 µL BMM droplets in the center of the wells of the preheated 48-well culture plate.\nFlip the plate upside down, put it in a 1.9% CO2 incubator (% CO2 according to SFDM buffer), and let it solidify for at least 20 min at 37 °C.\nAdd ROCK inhibitor (RI; 10 µM) and Amphotericin B (0.1%) to TOM and prewarm the medium in a 37 °C water bath.\n\tNOTE: Amphotericin B is light-sensitive.\nTake the 48-well plate from the incubator, place upright and add 250 µL of the prepared prewarmed medium to each well with BMM droplet/cells and return the plate to the 1.9% CO2 incubator.",
    "To refresh the medium (preferably every 2-3 days), tilt the 48-well plate at a 45° angle, gently remove the previous medium while avoiding touching the BMM droplet, and add 250 µL of new prewarmed TOM medium.\n\tNOTE: It is recommended to refresh at least three times a week to avoid depletion of key nutrients and growth factors. RI only needs to be added to TOM at initial seeding and the first days of each passaging (see section 4) to prevent cell death by anoikis and enhance organoid outgrowth. Amphotericin B is only added to the medium during passage 0 (P0) to block possible fungal contamination.\n4. Amplification and passaging of tooth organoid culture (Figure 1B and Figure 2B)\nPassage the organoids between 10 and 14 days of culture.\n\tNOTE: Avoid culturing for a longer period as prolonged culture may limit organoid regrowth and passageability. Only at initial development (P0) organoids may be cultured for up to 20 days depending on their growth rate (till maximum ±200 µm in diameter is reached).\nRemove the medium from the wells with organoids that need to be passaged. Within one culture condition, pool up to four confluent wells (see Figure 2C).\nTo collect the organoids, add 400 µL of ice-cold SFDM per well directly onto the BMM droplet and repeatedly pipet the medium up and down until the entire BMM droplet is dislodged.\n\t\nIn case wells are being pooled, transfer the 400 µL from the first well to the next (and so on) to dislodge the organoid-containing BMM droplets of all wells that need to be pooled.\nTransfer the dislodged BMM-organoid assembly to a 1.5 mL microcentrifuge tube and repeat step 4.3 again until all the organoid structures are collected from the wells.\nCentrifuge at 200 x g for 5 min at 4 °C.",
    "Prewarm an aliquot of TrypLE Express (supplemented with RI at 5 µM) in a 37 °C water bath. Per microcentrifuge tube of organoids, a volume of 400 µL TrypLE Express is needed.\nAfter centrifugation, remove the supernatant and resuspend the pellet in 400 µL of TrypLE. Incubate the suspension in a 37 °C water bath for 12 min.\nAdd 400 µL of ice-cold SFDM to inactivate the enzyme and centrifuge at 200 x g for 5 min at 4 °C. Remove the supernatant.\nPre-coat a tip (for volume see below) with ice-cold SFDM and resuspend the organoid pellet.\n\t\nTo avoid organoid loss, re-use the same (pre-coated) tip as much as possible without jeopardizing sterility.\n\t\tNOTE: The volume of SFDM required for resuspending the pellet depends on the number of organoid structures obtained and the current passage number.\nAs a rule of thumb, for passages, P0 to P2-3 (generally still growing a low number of organoids) use a volume of 200 µL SFDM. From passages, P3-4 or higher (generally yielding a larger number of organoids) use a volume of 700 µL of SFDM.\n\t\tNOTE: Both the procedures are referred to as 'low passage' and 'higher passage' methods, respectively (see steps 4.10 and 4.11). Correctly applying the distinct methods is crucial for efficient passaging of the organoids. With the higher passage method, organoids are more easily lost and should not be applied to low numbers of organoids (i.e., at P0 to P2-3). However, the higher passage method is needed to efficiently dissociate larger quantities of organoids.",
    "Low passage method: Resuspend the pellet in 200 µL of ice-cold SFDM. Push the completely emptied pipet tip against the bottom of the microcentrifuge tube to reduce its diameter. Check whether the diameter is small enough (slower aspiration, flow is skewed but not blocked). Pipet up and down for 5 min to mechanically disrupt the organoids.\nHigher passage method: Resuspend the pellet in 700 µL of ice-cold SFDM with a P1000 tip. Add a P200 tip (no filter) on top of this P1000 tip and pre-coat with ice-cold SFDM. Prevent air bubble formation by adjusting the pipet's volume setting in order to aspire at least 90% of the medium volume (with organoids). Pipet up and down for 5 min to mechanically disrupt the organoids.\nCheck under the light microscope (at 4x magnification) if mainly single cells with (only) a few undispersed structures are obtained.\nAdd 500 µL of ice-cold SFDM to the microcentrifuge tube and gently mix the dissociated cell mixture with the fresh SFDM by pipetting.\nLet large undispersed structures sediment for 10 min by vertically placing the microcentrifuge tube on ice.\n\tNOTE: It is necessary to remove the undispersed structures because they negatively influence organoid passageability. For organoid initiation (P0), this sedimentation step is not needed.\nCollect the supernatant (~500-1,000 µL depending on the passaging method) containing single cells and small cell clusters; transfer into a new microcentrifuge tube, and centrifuge at 190 x g for 10 min at 4 °C.\nCalculate the cell concentration using an automated cell counter. Neglect the cell clumps that remain.\nCount how many wells can be seeded and calculate the appropriate cell suspension/BMM ratio as described above (section 3).\nAdd 70% of BMM to the cell pellet and maintain the microcentrifuge tube on ice.",
    "NOTE: It is crucial to keep the microcentrifuge tube on ice to avoid BMM solidification.\nProceed with step 3.3 until 3.7 and passage again between day 10 and day 14 of culture.\n5. Cryopreservation of tooth organoids\nCollect and dissociate the organoids as mentioned above for passaging (step 4). Centrifuge the cell suspension at 200 x g for 5 min at 4 °C.\nDiscard the supernatant and resuspend the pellet in 1 mL of cryopreservation medium containing SFDM (70%), FBS (20%), and DMSO (10%).\nTransfer the suspension into a cryovial and put it on ice. Place the cryovials in a cryo box and transfer to -80 °C (for at least 4 h).\nWithin 1 month, transfer the frozen samples to liquid nitrogen for long-term (>12 months) storage.\n6. Thawing of cryopreserved tooth organoids\nBefore starting the thawing procedure, place one 15 mL tube per cryovial on ice containing 10 mL of SFDM with 20% FBS.\nRemove the cryovial from the liquid nitrogen and put it on ice.\n\tNOTE: Perform the following steps as rapidly as possible and avoid too long thawing time (>5 min) as well as too long intervals between the steps (>5 min), as such prolongation will decrease cell survival.\nPlace the cryovial in a warm water bath (37 °C) until thawed (~1-2 min).\nImmediately transfer the content of the cryovial to the ice-cold 15 mL tube and centrifuge at 200 x g for 5 min at 4 °C.\nRemove 9 mL of the supernatant and centrifuge the remaining 1 mL at 200 x g for 5 min at 4 °C. Remove the supernatant and wash the pellet with 1 mL ice-cold SFDM.\nTransfer cell suspension to a 1.5 mL microcentrifuge tube and count the cells using an automated cell counter.",
    "Count how many wells can be seeded and calculate the appropriate cell suspension/BMM ratio as described above (section 3).\nCentrifuge at 200 x g for 5 min at 4 °C. Resuspend the pellet in a 70:30 ratio of BMM:TOM and keep on ice.\nProceed with step 3.3 until 3.7 and passage between day 10 and day 14 of culture.\n7. Fixation and paraffin-embedding of tooth organoids\nNOTE: This procedure (including sections 8 and 9) can also be applied to the primary DF tissue.\nFixation of tooth organoids in PFA\n\t\nRemove the medium from each well as in step 4.2.\nCollect the organoids by dislodging the BMM droplet (step 4.3). Transfer the BMM-organoid mixture to a 1.5 mL microcentrifuge tube.\nCentrifuge at 200 x g for 5 min at 4 °C.\nRemove the supernatant and add 500 µL of 4% PFA and incubate for a minimum of 30 min (maximum 1 h) at RT with gentle mixing on an orbital shaker.\n\t\tCAUTION: Use the chemical hood when working with PFA.\nCentrifuge at 200 x g for 5 min at 4 °C. Remove the supernatant and rinse the organoid pellet with PBS for 10 min at RT with gentle shaking.\nWash the organoid pellet (step 7.1.5) an additional two times. Spin the fixed organoids down at 200 x g for 5 min at 4 °C.\nResuspend the pellet in 500 µL of 70% EtOH (in deionized water). Store the organoids for up to 1 month in 70% EtOH at 4 °C.\nAgarose- and paraffin-embedding of tooth organoids\n\tNOTE: To efficiently embed organoids in paraffin, an additional step of embedding in agarose is needed.\n\t\nCentrifuge the PFA-fixed organoids in 70% EtOH at 200 x g for 5 min at 4 °C. Remove the supernatant.",
    "Prepare a 2% agarose solution in 30 mL of PBS in a glass bottle. Warm up the agarose-PBS mixture in a microwave until a gel-like structure is observed (approximately 2.5 min at 600 W).\nIn parallel, add 30 mL of PBS to another glass bottle and warm up in the microwave (approximately 2.5 min at 600 W). Let the agarose solution cool down for 1 min.\nCut the end of a P200 tip to allow working with the agarose solution precisely and to avoid air bubbles.\nPrewarm the P200 tip in the warm PBS by pipetting up and down a few times.\nAdd 150 µL of prewarmed agarose solution to the organoid pellet and gently pipet up the organoid-agarose mixture (with minimal resuspension) while avoiding air bubbles.\n\t\tNOTE: The minimal resuspension will allow better locating the organoids in the agarose gel at microtome sectioning since the organoids are then closer to each other.\nImmediately transfer the organoid-agarose mixture to the same microcentrifuge tube cap, put the tube horizontally, and let the agarose solidify (~20 min at RT). In the meantime, label the cassettes.\nOnce solidified, remove the agarose gel from the microcentrifuge cap using a tweezer and transfer it to a labeled cassette.\nTransfer the agarose-containing cassette to a beaker containing 50% EtOH in deionized water. Cover the beaker with parafilm to avoid evaporation of the EtOH.\n\t\tNOTE: The volume of the beaker depends on the number of cassettes.\nProcess the samples in a tissue processor overnight.\n\t\tNOTE: As paraffin solidifies at RT, the following steps must be performed rapidly.\nPrewarm a heating block in the embedding workstation for 15 min.",
    "Remove the organoid-containing agarose gel enclosed in the cassette and place it in the prewarmed heating block. Remove the cap from the cassette and put it aside for later use.\nFill the remaining heating block with paraffin.\n\t\tNOTE: Check with a tweezer whether the organoid-containing agarose gel is still located at the bottom of the heating block. Due to its lightweight, it might start floating, resulting in sample loss.\nPlace the cassette cap on top of the heating block. Let it solidify for 30 min on a cold plate. Remove the heating block and store the paraffin blocks at 4 °C.\n8. Microtome sectioning and staining of tooth organoids (Figure 2B and Figure 3A-C)\nMicrotome sectioning of organoid-containing paraffin blocks\n\t\nSlice 5 µm sections of the tooth organoids in the paraffin blocks using a microtome.\nPlace the paraffin slices on top of a microscope glass slide. Place the microscope glass slide on a warm plate at 37 °C and cover it with deionized water using a Pasteur pipet.\nLet the microscope glass slide dry overnight.\nStaining of tooth organoid sections\n\t\nDeparaffinize the organoid sections (on the microscope glass slide) in an oven for 1 h at 58 °C.\nRehydrate the organoid sections (on the microscope glass slide) in decreasing EtOH series inside the chemical hood in the following order:\n\t\tXylene 2x for 3 min each\n\t\t100% EtOH 2x for 3 min each\n\t\t95% EtOH 2x for 3 min each\n\t\t90% EtOH 2x for 3 min each\n\t\t70% EtOH 3x for 3 min each\n\t\tCAUTION: Use the chemical hood when working with Xylene.\nRinse the microscope glass slide in tap water for 5 min at RT. Then, rinse it in PBS for 5 min at RT.",
    "Perform antigen retrieval by placing the organoid sections (on the microscope glass slide) in prewarmed citrate buffer (10 mM of citric acid in deionized water with pH 6; in a plastic container; prewarmed for 10 min in a 95 °C water bath) for 30 min in a 95 °C water bath.\nLet the microscope glass slide cool down for 20 min at RT. Rinse the microscope glass slide in PBS for 5 min at RT, and then in PBS containing 0.1% Triton-X (PBT) for 5 min at RT.\nUse a marking pen to create a hydrophobic barrier at the borders of each slide.\nBlock for a minimum of 1 h at RT in blocking buffer (containing 1.5 mg/mL glycine, 2 mg/mL albumin bovine serum (BSA) dissolved in PBT) plus 10% donkey serum.\n\t\tNOTE: Typically, 300 µL of blocking buffer plus 10% donkey serum is needed per microscope glass slide.\nPlace the microscope glass slide in a humid chamber. Use an airtight box where all slides fit and wet a few paper tissues with water to place at the bottom of the box. This will prevent the slides from drying out during the subsequent staining steps.\nRemove the blocking buffer, add the primary antibody (Table 6) prepared in blocking buffer plus 1% donkey serum and incubate the slide covered with antibody solution overnight in the humid chamber at 4 °C. Redo the marking pen border if needed.\nWash the microscope glass slide three times in PBT at RT for 10 min with gentle mixing on an orbital shaker (75-150 rpm).\nAdd the secondary antibody (Table 6), prepared in blocking buffer plus 1% donkey serum, and incubate for 1 h in the humid chamber at RT.",
    "Remove the blocking buffer and wash the microscope glass slide three times in PBT at RT for 10 min with gentle mixing on an orbital shaker.\nAdd antifade mounting medium with DAPI (1 to 3 droplets) on a glass coverslip and mount this on top of the organoid sections (on the microscope glass slide). Proceed with imaging; store slides for a maximum of 1 week at 4 °C.\n9. RNA Extraction and RT-qPCR of tooth organoids (Figure 2B and Figure 3D)\nRNA extraction of tooth organoids\n\t\nRemove the medium from each well (step 4.2).\nCollect the organoids by dislodging the BMM droplet (step 4.3), transfer the BMM-organoid mixture to a 1.5 mL microcentrifuge tube, and centrifuge at 200 x g for 5 min at 4 °C.\nRemove the supernatant, resuspend vigorously in 350 µL of 1% β-mercaptoethanol dissolved in lysis buffer (Table of Materials), and put on ice.\n\t\tCAUTION: Perform all the steps with β-mercaptoethanol in a chemical hood.\n\t\tNOTE: Samples can be stored at this step for up to 1 month at -80 °C. Thaw the samples on ice before proceeding with step 9.1.4.\nVortex the samples until no organoid structures are observed anymore.\nProceed with RNA extraction using the RNA extraction kit (Table of Materials) according to the manufacturer's instructions.\nRT-qPCR of tooth organoids (Table 7)\n\t\nReverse-transcribe (RT) the RNA19 using the reverse transcription kit (Table of Materials) according to the manufacturer's instructions.\nAnalyze the resulting cDNA samples with SYBR Green-based quantitative PCR (qPCR)19 using a Real-Time PCR System (Table of Materials).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}