{
  "id": 3305,
  "origin_website": "Cell",
  "title": "Protocol for establishing a coculture with fibroblasts and colorectal cancer organoids",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCulturing patient-derived organoids\nTiming: ∼ 5 h/week\nPatient derived organoids were formed and maintained according to already published protocols.1[href=https://www.wicell.org#bib1],2[href=https://www.wicell.org#bib2],3[href=https://www.wicell.org#bib3] For detailed step-by-step protocol see Pleguezuelos-Manzano et al.4[href=https://www.wicell.org#bib4] and Schuhmacher et al.5[href=https://www.wicell.org#bib5] This section details the maintenance of long-term organoid culture by weekly passaging.\nCulture organoids in 15 μL domes consisting of 75% Matrigel and 25% tumor organoid (TORG) medium in 48 well plate and overlay with 300 μL TORG medium. Check organoids daily (Monday to Friday) and change medium or split organoids when necessary.\nCritical: Use BSA coated low protein binding tubes and pipet tips whenever possible to prevent organoids from sticking to the surfaces. Matrigel should always be kept and thawed on ice. Only thaw amount of Matrigel that will be used that day.\nPassage organoid cultures every 3–7 days, depending on growth and maintenance of Matrigel domes. Split the cells depending on density, usually in the ratio of 1:2 to 1:4.\nCritical: Pre-warm 48 well plates in the incubator at 37°C. Do not remove the medium of all wells at once to prevent organoids from getting too dry or cold. Start with 1–6 wells.\nCarefully remove and discard the medium in the wells without disrupting the Matrigel domes.\nAdd 1 mL ice-cold PBS into 1 well.\nUse a fresh pipette tip and transfer 10% BSA solution from a low-binding tube into a new low protein binding tube (now the empty tube and the pipette tip are BSA coated) and use the same pipette tip to pool the organoids in the next steps.\nUse the pipette tip (now BSA coated) and resuspend Matrigel dome with organoids with PBS added in step 2b.\nPool maximum of 6 wells and transfer into the BSA coated low protein binding tube (prepared in step c.).",
    "Use a fresh pipette tip and wash wells with 500 μL ice cold PBS and add to the organoid suspension.\nCentrifuge the tube at 2,370 g at 23°C for 50 s.\nCarefully discard the supernatant with the dissolved Matrigel without disrupting the cell pellet.\nAdd 1 mL ice cold PBS to the tube and resuspend the cell pellet with a BSA coated pipette tip.\nCentrifuge at 2,370 g at 23°C for 50 s and discard the supernatant.\nResuspend the cell pellet in 100 μL TrypLe with a Pipette 10–100 to enzymatically and mechanically digest organoids.\nIncubate the cell pellet at 37°C roughly 5 min with resuspension by pipetting up and down every 1–2 min.\nNote: Mechanical disruption works best using a 10–100 μL pipette due to the narrow tip.\nCritical: Some organoids may need more than 5 min to split up due to donor-to-donor variabilities. They might be incubated up to 30 min without damage. Be careful to resuspend and check regularly to stop the splitting as early as possible. As an alternative use a Thermo Shaker at 1 g at 37°C and check the state of dissociation every 3 min.\nMonitor disruption microscopically and stop the “digestion” when organoids break up into small cell clumps.\nAdd 1 mL advanced DMEM to stop digestion and mix gently.\nStore organoids on ice for 15 min without moving the tube in order to get rid of debris accumulating at the top.\nCarefully remove 100 μL–300 μL of the supernatant without discarding organoids.\nCritical: The volume of medium that is removed can be adjusted depending on state and amount of cells.\nSpin down organoids at 2,370 g for 50 s and discard the supernatant.\nNote: Depending on the doubling time and amount of organoids, splitting ratio can vary between 1:2–1:4.",
    "For each well 10 μL Matrigel are necessary. For the TORG medium volume, calculate 1/3 of the Matrigel volume (e.g., 10 wells would need 100 μL of Matrigel and 33.3 μL of TORG medium). Calculate:\nMatrigel volume:\n10\nμ\nL\n∗\nw\ne\nl\nl\nn\nu\nm\nb\ne\nr\nTORG medium volume:\nM\na\nt\nr\ni\ng\ne\nl\nv\no\nl\nu\nm\ne\n∗\n1\n3\nAdd the cold TORG medium to the organoids. Store the organoids on ice and resuspend carefully. Add the Matrigel and mix again carefully avoiding bubbles.\nCritical: Avoid bubbles in the Matrigel mixture. Make sure to work on ice.\nDispense a 15 μL dome in the middle of each well (use 48 well plates prewarmed at 37°C).\nIncubate the Matrigel domes containing the organoids upside down for 15 min in the incubator at 37°C.\nOverlay each dome with 300 μL TORG medium.\nCulturing fibroblast cell line CCD-18Co\nTiming: ∼ 1 h/week\nThis section details the maintenance of long-term CCD-18Co cell culture by weekly passaging.\nFibroblasts are cultured in T75 flasks with 15 mL fibroblast medium. Medium is changed every 3–5 days.\nCritical: The utilized CCD-18Co fibroblasts are not sensitive in growing too dense, but are sensitive if too sparsely seeded.\nSplit fibroblast when they are 100% confluent, usually at a ratio of 1:2.\nAspirate the medium and wash fibroblasts with 10 mL warm PBS.\nAspirate the PBS and add 1 mL 0.25% trypsin. Move flask gently to cover all fibroblasts with trypsin.\nIncubate the fibroblasts in the incubator for 5–10 min.\nCheck fibroblasts under microscope. If the cells detach, resuspend the cells with 10 mL fibroblast medium. Use a pipet boy to mix gently and transfer into a 15 mL polypropylene tube.",
    "Centrifuge for 5 min at 180 g at 23°C and discard the supernatant.\nResuspend the cell pellet in 10 mL fibroblast medium and transfer 5 mL cell suspension to each T75 flask. Top up to 15 mL by adding 10 mL fibroblast medium to each T75 flask.\nMove flasks gently to distribute the cells evenly and let the cells attach in the incubator at 37°C.\nCoculture of fibroblast cell line CCD-18Co with PDOs\nTiming: ∼ 5 h/week\nHere we describe the procedure of coculturing the fibroblast cell line CCD-18Co with patient-derived organoids. We describe two coculture setups depending on the readout - in the first protocol, viability of cells can be analyzed separately using FACS while in the second approach the coculture will be analyzed using CellTiter Glo® (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2894-Fig1.jpg\nFigure 1. Timeline of fibroblast - organoid coculture\nDepending on the readout - either FACS analysis or CellTiter Glo – fibroblasts and organoids are seeded in 6 well plates or 384 well plates, respectively. On day 0, fibroblasts are seeded and organoids are split. After 3 days, organoids are seeded on top of fibroblasts. After 1 day of coculture, cells can be treated for 2 days and analyzed using either FACS or CellTiter Glo.\nAssessment of viability using FACS.\nSeeding fibroblasts.\nHarvest fibroblasts in step 4a–4e and resuspend in 10 mL fibroblast medium.\nCount viable cells in a Neubauer counting chamber. Therefore, mix 20 μL cell suspension with 20 μL trypan blue. Count 4 large corner squares and calculate the cell number:\nc\ne\nl\nl\nn\nu\nm\nb\ne\nr\nn\nu\nm\nb\ne\nr\no\nf\nc\no\nu\nn\nt\ne\nd\nc\no\nr\nn\ne\nr\ns\nq\nu\na\nr\ne\ns\n(\nh\ne\nr\ne\n4\n)\n∗\n2",
    "(\na\n)\n∗\n10,000\n(\nb\n)\n=\nc\ne\nl\nl\nn\nu\nm\nb\ne\nr\nm\nL\n        (a) dilution factor of trypan blue.\n        (b) correction factor converting counting chamber volume into.\nCalculate 100,000 fibroblasts per well.\nResuspend fibroblasts in 3 mL fibroblast medium and 15 μL TGF-ß1 (stock 2 μg/mL) per 100,000 fibroblasts.\nSeed the cells in a 6 well plate.\nCultivate for 3 days before conducting the next step.\nSeeding organoids.\nHarvest organoids as described in step 2.\nDiscard the supernatant and resuspend the pellet in 1 mL fibroblast medium using BSA coated low-binding tips.\nTransfer 20 μL cell suspension to the Fuchs-Rosenthal cell counting chamber and count the squares. Calculate the cell number:\nc\ne\nl\nl\nn\nu\nm\nb\ne\nr\nc\no\nu\nn\nt\ni\nn\ng\nc\nh\na\nm\nb\ne\nr\nv\no\nl\nu\nm\ne\n(\nh\ne\nr\ne\n3.2\nμ\nL\n)\n=\nc\ne\nl\nl\nn\nu\nm\nb\ne\nr\np\ne\nr\nμ\nL\nCalculate 10,000 organoids per well.\nResuspend organoids in 3 mL fibroblast medium per 10,000 organoids.\nNote: Always use BSA pre-coated 15 mL Falcons when working with organoids.\nAspirate the medium from the fibroblasts in the 6 wells.\nAdd 3 mL organoid cell suspension with 10,000 organoids per well.\nCultivate for one day.\nAdd treatment (optional).\nIncubate for 2 days in the incubator until day 6.\nHarvest and stain for FACS.\nFACS staining.\nPrepare falcon® round-bottom polystyrene tubes:\n        Label falcon® round-bottom polystyrene tubes and coat tubes with BSA.\nTo ensure that cells loosely connected to the well will be analyzed as well, harvest supernatant.\nCentrifuge for 5 min at 180 g at 23°C.\nDiscard the supernatant and store the tubes with the cell pellets on ice.",
    "Wash the wells with PBS and aspirate PBS.\nAdd 300 μL 0.25% trypsin to each well.\nCheck cells microscopically and resuspend every 5 min until cells detach.\nNote: Be sure to dissociate organoids into a single cell suspension.\nAdd 1 mL fibroblast medium and transfer into the falcon® round-bottom polystyrene tubes where the cells are mixed with the pellet from the supernatant (Step 5c.).\nCentrifuge for 5 min at 180 g at 4°C and discard the supernatant.\nAdd 1 mL 1× Annexin Binding Buffer (ABB) and centrifuge again for 5 min at 180 g at 4°C.\nDiscard the supernatant.\nPrepare the EpCAM – bv421 staining solution:\n        For each sample calculate 2 μL of EpCAM – bv421 antibody and 98 μL of 1× ABB.\nAdd 100 μL of the staining solution to the tubes.\nVortex and incubate on ice in the refrigerator for 30 min.\nAdd 1 mL 1× ABB, vortex and centrifuge for 5 min at 180 g at 4°C and discard the supernatant.\nPrepare the Annexin/Propidium Iodide (Annexin/PI) staining solution.\n        For each sample prepare 300 μL staining solution with 1:200 AnnexinV-APC and 1:40 PI in 1× ABB. For one sample e.g., 1.5 μL AnnexinV-APC, 7.5 μL PI and 291 μL 1× ABB are mixed.\nS\na\nm\np\nl\ne\nv\no\nl\nu\nm\ne\n:\nV\nS\na\nm\np\nl\ne\n=\nS\na\nm\np\nl\ne\nn\nu\nm\nb\ne\nr\n∗\n300\nμ\nL\nA\nn\nn\ne\nx\ni\nn\nV\n−\nA\nP\nC\nv\no\nl\nu\nm\ne\n:\nV\nA\nn\nn\ne\nx\ni\nn\n=\nS\na\nm\np\nl\ne\nv\no\nl\nu\nm\ne\n200\nP\nI\nv\no\nl\nu\nm\ne\n:\nV\nP\nI\n=\nS\na\nm\np",
    "l\ne\nv\no\nl\nu\nm\ne\n40\nA\nB\nB\nv\no\nl\nu\nm\ne\n:\nV\nA\nB\nB\n=\nV\nS\na\nm\np\nl\ne\n−\nV\nA\nn\nn\ne\nx\ni\nn\n−\nV\nP\nI\nAdd 300 μL to each sample and incubate for 10 min on ice.\nMeasure cell viability using a flow cytometer.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2894-Fig2.jpg\nFigure 2. Gating strategy analyzing viability of EpCAM positive organoids and EpCAM negative fibroblasts\nA single cell suspension was stained with EpCAM – bv421, AnnexinV – APC and Propidium Iodide. Debris was removed by their scatter properties (FSC x SSC) and EpCAM positive (organoids) and EpCAM negative (fibroblasts) were analyzed on the Annexin V – APC versus PI scatter for live (bottom left), early (bottom right) and late apoptosis (upper right).\nNote: See Figure 2[href=https://www.wicell.org#fig2] for an example FACS gating strategy. Prepare the appropriate FACS compensation controls of unstained cells and single stained cells.\nAssessment of viability using CellTiter-Glo.\nSeeding fibroblasts.\nHarvest and count fibroblasts as described in Steps 5a.\nCalculate 2,000 fibroblasts per well.\nResuspend 8 μL fibroblast medium with 10 ng/mL TGF-ß1 per 2,000 fibroblasts.\nNote: Prepare at least 10 wells additionally to make sure there is enough cell suspension. For example 80 wells (plus 10 wells backup): calculate 190,000 fibroblasts in 720 μL fibroblast medium with 3.6 μL TGF-ß1 (2 ng/μL).\nDispense 8 μL with 2,000 fibroblasts in each well of a 384 clear bottom plate.\nNote: Make sure to fill the outer row of the plate with water to prevent the wells from drying out.\nIncubate in the incubator at 37°C for three days.\nAdd organoids on day 4.\nSeeding organoids.\nHarvest and count organoids as described in Steps 5b.\nCalculate 200 organoids per well.",
    "Resuspend in 32 μL fibroblast medium per 200 organoids.\nNote: Make sure to calculate more wells than needed to have enough cell suspension.\nSeed organoids on top of the fibroblasts and incubate 1 day at 37°C.\nAdd treatment in a volume of 20 μL (optional, otherwise add 20 μL of fibroblast medium).\nIncubate for 2 days in the incubator until day 6.\nCellTiter Glo®.\nThaw CellTiter Glo® reagent and incubate 30 min in waterbath at 37°C.\nAdd 1:1 (v/v) CellTiter Glo® reagent to each well.\nIncubate plate for 30 min in the incubator at 37°C.\nMeasure luminescence.\nCritical: Be sure to exclude wells with bubbles or other inconsistencies.\nCalculate viability of treated coculture relative to control."
  ],
  "subjectAreas": [
    "Organoids",
    "Cell Culture",
    "Cell Biology",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}