{
  "id": 1814,
  "origin_website": "Cell",
  "title": "A simple and effective cryopreservation protocol for the industrially important and model organism, Euglena gracilis",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nE. gracilis growth\nTiming: 10–12 days\nThis section describes the growth and culturing of E. gracilis cells from stock in preparation for harvesting. Unless otherwise indicated all culturing, harvesting and subsequent sections should be carried out under sterile conditions.\nStreak out fresh E. gracilis strain Z on glucose supplemented growth media + Agar (1.5%) using a sterile loop in a biosafety cabinet (or equivalent aseptic technique) and grow in the dark for 5–7 days (28°C) (Figures 1[href=https://www.wicell.org#fig1]A–1C).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1293-Fig1.jpg\nFigure 1. E. gracilis cell growth and monitoring\n(A and B) E. gracilis cells grown on an agar slant (A) or plate (B) take on a pale-yellow appearance.\n(C) Healthy colonies contain 10–90 round, pulsating cells (10× magnification, phase-contrast);\n(D) Cells grown in 200 mL glucose supplemented growth media;\n(E) Cell density determination (Countess II FL Automated cell counter);\n(F) OD measurement (Spectrophotometer);\n(G) Glucose measurement (YSI);\n(H) Morphology monitoring of E. gracilis cells.\nInoculate 200 mL of fresh glucose supplemented growth media (Figure 1[href=https://www.wicell.org#fig1]D) with E. gracilis cells (≅3.5 × 106 cells/mL) from step 1 using a sterile loop and grow heterotrophically in the dark (28°C, 120 rpm) until the glucose concentration is measured below 1 g/L (Figure 1[href=https://www.wicell.org#fig1]G; ≅3 days). This equates to the late log or early stationary growth phase whereby cell count measures ≅ 12 × 106 cells/mL (Figure 1[href=https://www.wicell.org#fig1]E) or at OD600 measures ≅ 4.8 (Figure 1[href=https://www.wicell.org#fig1]F).\nGrowth of cultures can be monitored using a spectrophotometer and/or a cell counter, and glucose can be monitored using a YSI Biochemistry Analyzer 2950 D or equivalent technique (Figure 1[href=https://www.wicell.org#fig1]). We recommend monitoring cell morphology using a compound microscope equipped with a camera (Figure 1[href=https://www.wicell.org#fig1]H).\nCell harvesting\nTiming: 1–2 h\nThis section describes the harvesting of cells for cryopreservation.",
    "Transfer 10 mL of the 200 mL culture to a 15 mL conical tube in a biosafety cabinet (or equivalent aseptic technique) using a 10 mL serological pipette.\nCritical: 1 mL of sample should be used to assess cell viability. See: post-cryopreservation culturing and cell viability assays[href=https://www.wicell.org#sec3.8] step 21.\nPellet cells by centrifugation at 500 g for 5 min at 19°C–22°C (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1293-Fig2.jpg\nFigure 2. E. gracilis cell harvesting and incubation.\n(A) Cell harvesting by centrifugation;\n(B) Cell incubation for cell recovery.\nAfter centrifugation, discard the supernatant and resuspend cells by gently pipetting in fresh, sterile glucose supplemented growth media to a final cell concentration of ≅ 10 × 106 cells/mL.\nTransfer the cell suspension to a sterile conical tube and let rest undisturbed at 19°C–22°C for a 30 min recovery period (Figure 2[href=https://www.wicell.org#fig2]B).\nCritical: 30 min cell recovery at 19°C–22°C is critical after centrifugation.\nPerform cryopreservation treatment according to the CPA treatment below.\nPreparation of the cryoprotective agent (CPA)\nTiming: 15 min\nThese steps describe the preparation of the cryoprotectant agent under sterile conditions.\nAdd 2 mL of reagent grade methanol (MeOH) to 8 mL of sterile glucose supplemented growth media to make 10 mL of 20% (v/v) cryoprotective agent (CPA).\nFilter-sterilize CPA into a 50 mL sterile conical tube using a 0.2 μm filter equipped with a 50 mL syringe (Figure 3[href=https://www.wicell.org#fig3]) and keep at 19°C–22°C until use.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1293-Fig3.jpg\nFigure 3. Preparation of CPA solution\nFilter sterilization of CPA including glucose supplemented growth media.\nCritical: CPA should be prepared fresh on the day of use. If CPA is stored for long periods or exposed to strong light, it can lose efficiency.\nTreatment of cells with CPA\nTiming: 30 min\nThese steps describe the treatment of cells with CPA.",
    "Transfer 10 mL of E. gracilis cells (≅ 10 × 106 cells/mL) from step 6 into a universal glass vial and add 10 mL of CPA to make a final 20 mL solution containing 10% MeOH (v/v) (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1293-Fig4.jpg\nFigure 4. Treatment of E. gracilis cells with CPA (MeOH) solution\nSeal vial(s) with parafilm and mix by gently inverting twice.\nNote: You can customize the volume at step 10 if the ratio remains 1-CPA:1-cells (v/v). We make extra CPA in case of spillage or when additional aliquots are desired.\nTransferring of cultures to cryovial and equilibration\nTiming: 30 min\nThis section describes the aliquoting of CPA treated cells.\nAliquot 0.5 mL of CPA treated E. gracilis cells into sterile, 2.0 mL plastic screw cap vials.\nRepeat for a total of 18 vials - the capacity of the Mr. Frosty cooling container.\nSeal cryo-vials with parafilm and incubate for 15 min at 19°C–22°C (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1293-Fig5.jpg\nFigure 5. E. gracilis cells transferred to cryo-vials and equilibration\nCooling and cryopreservation of E. gracilis cells\nTiming: 2 h\nThis section describes the transfer of CPA treated cells, the preparation protocol for use of the Mr. Frosty and long-term storage of Euglena cells.\nNote: For cooling and cryopreservation of cells it is recommended to use the Mr. Frosty cooling device or a similar device like the Cool Cell™ which facilitate gradual cooling of cells. We tested an alternative cooling protocol by placing CPA treated cells directly at −80°C followed by LN2 but cells did not survive.\nCooling Phase\nAfter incubation (step 13), immediately transfer cryo-vials containing CPA treated E. gracilis cells to the Mr. Frosty passive freezing system.",
    "Critical: Step 14 should only proceed after the Mr. Frosty unit has been pre-treated with 250 mL of isopropanol and undergone overnight equilibration at 4°C. See: Before You Begin, step 3.\nPlace the Mr. Frosty unit at -80°C and allow cells to rest for 1.5 h.\nThe cooling rate during this step equates to −1 °C/min, and the temperature of the vial contents after 1.5 h is below −50°C (Figure 6[href=https://www.wicell.org#fig6]).\nCryopreservation phase\nTake the pre-chilled cryopreservation vials containing the pre-chilled E. gracilis cells and quickly transfer them from the Mr. Frosty cooling unit into the pre-chilled (−196°C) cryo-box and cryo-rack for long term storage in LN2 (Figure 7[href=https://www.wicell.org#fig7]).\nMonitor LN2 levels bi-weekly to ensure samples remain submerged in LN2.\nPause point: Store cryopreserved cells for the desired time ensuring LN2 levels are maintained.\nCritical: Ensure samples remain submerged in LN2 for the duration of storage.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1293-Fig6.jpg\nFigure 6. Cooling of E. gracilis cells in Mr. Frosty placed in a −80°C freezer\n(A) Cryovials organized in Mr. Frosty;\n(B) Mr. Frosty inside a −80°C freezer.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1293-Fig7.jpg\nFigure 7. Placement of cryo-vials in LN2 filled dewar\n(A) Transferred cryo-vials from Mr. Frosty;\n(B) Cryo-box transfer to cryo-rack;\n(C) Cryo-rack to LN2 filled dewar;\n(D) E. gracilis cells cryopreserved in LN2 filled dewar.\nThawing and recovery of E. gracilis cells after 1 year of cryopreservation\nTiming: 1–2 h\nThis section outlines the steps required for preparation of cryopreserved cells for reanimation.\nAfter the cryopreservation period (i.e., 1 year), remove the cryo-rack from LN2 and transfer the cryo-vials directly to a pre-warmed water bath (35°C, 1–2 min).",
    "Critical: Immerse cryovials to cover vial contents. This step should be done carefully to avoid agitation, and vial contents should be left immersed until cells are completely thawed (1–2 min) (Figure 8[href=https://www.wicell.org#fig8]). The optimal temperature for thawing is 35°C (check with an analog thermometer).\nAfter thawing, immediately remove cryo-vials from the water bath and sterilize the outer surface with 70% (v/v) ethanol. Rapidly transfer vials to a class II biosafety cabinet.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1293-Fig8.jpg\nFigure 8. Thawing and recovery of E. gracilis cells after Cryopreservation\n(A) Cryo-vials transferred from LN2 filled dewar for thawing;\n(B) Thawing of cells in water bath;\n(C) Centrifugation and washing of cells to remove CPA.\nTo increase osmolarity and the total volume to 1.0 mL, carefully add 0.5 mL of fresh glucose supplemented growth media to the cell suspension and mix by gently pipetting.\nImmediately pellet cells by gentle centrifugation (400 g for 3 min at 19°C–22°C) and discard the supernatant. Resuspend the pellet in 1 mL of fresh glucose supplemented growth media by gently pipetting, and incubate for 10 min at 19°C–22°C.\nRepeat step 19 once to remove remaining CPA.\nNote: We have successfully recovered cells after 1 week, 3 months, 6 months and 1 year of cryopreservation.\nPost-cryopreservation culturing and cell viability assays\nTiming: 8–10 days\nThis section outlines the cultivation and assessment of cell viability for cells that have been reanimated following cryopreservation and storage. As in previous sections steps should be carried out under sterile conditions.",
    "Note: For culture vessels we recommend using T-25 flasks for post-cryopreservation culturing (step 20). T-25 flasks are advantageous as they can be placed directly under a microscope allowing for routine cell observation. Alternatively, one can use small, vented conical flasks but their use risks contamination as observing cells under the microscope requires opening the vessel to remove samples.\nPost-cryopreservation culturing\nTransfer 1 mL of washed E. gracilis cells to a culture vessel (T-25 flasks) containing 19 mL of fresh glucose supplemented growth media and grow cells on a rotary shaker at 80 rpm for 72–96 h at 28°C, under dark, heterotrophic conditions (Figure 9[href=https://www.wicell.org#fig9]).\nCritical: Take 1 mL of sample to assess cell viability. See: post-cryopreservation culturing and cell viability assays[href=https://www.wicell.org#sec3.8], step 21.\nAfter 72–96 h of growth (cell count ≅ 4.5 × 106 cells/mL), transfer 20 mL of culture to 200 mL of fresh glucose supplemented growth media in a 1 L conical flask. Continue to grow culture under the same conditions but with a modified rotation speed, which should be changed to 120 rpm (Figure 9[href=https://www.wicell.org#fig9]).\nMonitor cell density (cells/mL) and optical density (OD600) during post-cryopreservation culturing. Make morphological observations using a microscope to determine the health and viability of the culture (Figure 1[href=https://www.wicell.org#fig1]).\nCell Viability Assays\nNote: To evaluate cryopreservation success, if resources permit, we recommend testing the success of the cryopreservation protocol at different time intervals (i.e., bi-weekly, monthly, quarterly, yearly) using the indicated cell viability assay.\nThe viability of E. gracilis cells should be assessed using Trypan Blue (TB) and microscopy. This is done three times: (1) Before cryopreservation (step 3 of cell harvesting[href=https://www.wicell.org#sec3.2]), (2) immediately after thawing (step 20a) and (3) immediately after the post-cryopreservation culturing period (step 20b).",
    "TB stains dead E. gracilis cells, which acquire a dark blue appearance. Living (viable) cells maintain their natural color. The following outlines the TB staining procedure (Figure 10[href=https://www.wicell.org#fig10]).\nNote: When working with Trypan Blue follow all safety protocols as indicated by the manufacturer, wear appropriate PPE and discard waste in appropriate vessels.\nAdd 1 mL of E. gracilis cell culture to a 2 mL tube and centrifuge at 2400 g for 5 min at 19°C–22°C and discard the supernatant.\nAdd 1 mL of 0.4% TB solution to the cell pellet, mix by gently pipetting, and incubate at 19°C–22°C for 10 min.\nAfter incubation, centrifuge the sample at 2400 g for 5 min at 19°C–22°C, remove 900 μL of supernatant and replace with 900 μL of distilled water.\nMix sample gently by pipetting and centrifuge at 2400 g for 5 min at 19°C–22°C to remove supernatant.\nResuspend cells in 1 mL of distilled water and repeat the washing step three times.\nA minimum of 50 cells should be counted under the microscope (or microscope photo) to calculate viable and dead E. gracilis cells (Figure 1[href=https://www.wicell.org#fig1]).\nCell viability (%) is calculated using the following formula: (number of living cells/ number of total cells) × 100%. To avoid underestimating cell viability due to the presence of dead cells in the original cultures (step 3, cell harvesting), the viability of initial cultures should be calculated for comparison.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1293-Fig9.jpg\nFigure 9. Post-cryopreservation culture and scale-up of E. gracilis culture\n(A) E. gracilis cells transferred to T-25 flasks and grown inside a shaker incubator;\n(B) Culture scale-up in 200 mL for further use.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1293-Fig10.jpg\nFigure 10. Cell viability assay using Trypan Blue\n(A) Before Cryopreservation (60×; 50 μm scale bar);\n(B) Before Cryopreservation (20×; 200 μm scale bar);",
    "(C) Immediately after thawing (20×; 200 μm scale bar);\n(D) Post cryopreserved and recovered culture (20×; 200 μm scale bar). Dark-blue cells are considered dead/inactive cells; Non stained cells are considered living/active cells."
  ],
  "subjectAreas": [
    "Model Organisms",
    "Cell Biology",
    "Biotechnology And Bioengineering",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}