{
  "id": 3960,
  "origin_website": "Cell",
  "title": "A phenotypically supervised single-cell analysis protocol to study within-cell-type heterogeneity of cultured mammalian cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThe protocol below describes the specific steps for interrogating heterogeneous collective migration phenotypes of MDA-MB-231 cells in a 3D collagen matrix. However, this protocol can be used with other cell lines and other culture platforms and is easily adaptable to other biological contexts that can be visually defined.\nThe experimental workflow and timing of the procedures is shown in Figure 1[href=https://www.wicell.org#fig1], which depicts the different stages of the Procedure. In broad terms, the Procedure consists of five main sections, which are detailed below.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/680-Fig1.jpg\nFigure 1. Protocol flowchart\nThe major components of the protocol are: transduction of cells with a photoconvertible construct, 3D culture of cells, photoconversion, gel digestion and FACS, and downstream analyses. Time needed to complete these steps is shown on the left.\nNote: It is important to verify that the biological heterogeneity being studied is not altered through expression of the photoconvertible protein or the photoconversion process. Cells expressing the photoconvertible protein should be compared to wild-type cells to ensure the same modes of heterogeneity exist and at similar frequencies. In addition, to confirm that the photoconversion process does not significantly alter gene expression, a non-labeled population can be compared to the sorted populations through gene expression assays to demonstrate minimal difference. In particular, genes associated with responses to light should not be significantly differentially expressed between labeled and unlabeled populations.",
    "Note: Proper controls must also be used to ensure collection of purified photoconverted populations. A non-photoconverted sample exhibiting equivalent biological heterogeneity should be used to gate the baseline fluorescence of the photoconverted channel. To ensure purity of the sample, a strict gate should be applied where all cells collected express higher fluorescence in the photoconverted channel compared to the negative control. Users can adjust the strictness of this gate to their application based on the demands for the purity of their enriched population.\nViral transduction of Dendra2 into MDA-MB-231\nTiming: 4-5 days\nCritical: Choice of cell line- Successful transduction of a photoconvertible protein into the experimental cell line is a foundation of this technique. Thus, selection of a cell line amenable to transduction is critical. While we present a method of lentiviral transduction to induce expression of Dendra2 in our protocol, other methods of induced gene expression and other photoconvertible proteins may be used as well.\nCulture MDA-MB-231 cells in a 6-well plate until 70%–80% confluency. We recommend working with cells below 20 passages.\nAspirate the media, wash the cells once with PBS, and replace with new growth media.\nAdd 75 μL of collected lenti-Dendra2 dropwise to the well. Gently swirl to mix.\nMonitor transduction efficiency through fluorescent microscopy. It may take 2-3 days before cells start to fluoresce.\nSee troubleshooting problem 1[href=https://www.wicell.org#sec6.1]\nPassage cells into larger flasks to prepare for purification through FACS. Using a wild-type control, gate for the cells expressing above background levels of green fluorescence. You may choose to collect only the cells that have the highest fluorescence for ease of identification for downstream experiments.\n3D culture of MDA-MB-231 Dendra2 (MDA-Dendra)\nTiming: 1 week",
    "Culturing platform: This protocol separates cells undergoing distinct collective migration behaviors within 3D culture, specifically in 3D type I collagen (COLI). For the end user, the biophysical properties of the environment, including choice of material, should be adapted according to the type of heterogeneity being studied. Tissue specific studies, for instance, may need to be matched with particular extracellular matrix proteins at specific densities and stiffnesses to ensure biological relevance. Separation of the photoconverted cell population in our system requires the use of collagenase and trypsin, which may destroy surface markers. If surface proteins need to be preserved for downstream applications, enzymes with less disruptive mechanisms can be used. An alternative approach would be the use of culture systems that enable non-enzymatic cell retrieval strategies, such as Matrigel or engineered synthetic hydrogels.\nThaw out RB, NaOH on ice.\nPlace a 48-well plate in the incubator to preheat to 37°C .\nPassage MDA-Dendra and count the cells using a hemocytometer. Keep cells on ice.\nCalculate the amount of reagents required to make the 3D collagen hydrogel. Table 3[href=https://www.wicell.org#tbl3] displays sample calculations for making a 2.5 mg/mL collagen + 10 mg/mL PEG hydrogel, with 50,000 cells/mL embedded. Adjust calculations as necessary.\ntable:files/protocols_protocol_680_6.csv\nTotal desired volume of gel: 200 μL. Make 250 μL to account for reagent loss during pipetting.\nCritical: The following steps must be performed quickly and carefully. Carefully mix the solutions at every step and do not introduce bubbles into the solution. If bubbles form, start over as the architecture of the hydrogel will not be homogenous. Steps must be performed quickly, and reagents kept as cold as possible to prevent polymerization before the gel solution is incubated at 37°C .\nPlace the collagen, media, and an empty 1.5 mL microcentrifuge tube on ice.",
    "Add the reagents in the empty microcentrifuge tube in the following order: cells, media, PEG, RB, Collagen, NaOH. In between each addition, pipette mix the components at least 10×.\nImmediately pipet the gel solution into the preheated well plate and incubate at 37°C for 30 min.\nAfter 30 min, perform 3 washes of 1× PBS for 5 min each. The amount of PBS to pipette on top of the gel is the same as the gel volume.\nAfter the last wash, aspirate the PBS and add growth media on top of the gel. The amount of growth media to pipette on top of the gel is the same as the gel volume.\nIncubate the 3D culture for a week, changing media every 2-3 days to keep the cells viable (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/680-Fig2.jpg\nFigure 2. MDA-MB-231 after 1 week of culture in 3D collagen\nRepresentative bright field image (15×) of MDA-MB-231 cells grown in 3D collagen for 7 days to illustrate appropriate cellular density and morphologies. Scale bar, 100 μm.\nTagging of collective cell phenotypes by photoconversion\nTiming: 2–3 h\nThe choice of imaging strategy is not limited to the specific microscopes and settings presented in this protocol. However, the imaging setup presented is specifically designed to achieve high throughput photoconversion, and as such consists of a widefield microscope. The imaging system must be equipped with a laser line of wavelength suitable for photoconversion, a galvanometric scanner, and climate control (temperature, humidity, and CO2). The choice of lenses should be optimized to focus the laser light as much as possible to minimize off-target photoconversion, while also taking into consideration the physical size of the attributes used to determine the modes of heterogeneity being studied and maximizing throughput (subpopulation photoconversion).",
    "Transfer the collagen gel to a glass-bottom dish. Add enough media to keep the gel hydrated, but not so much that the gel will float in solution or move around in the dish.\nTransfer the glass-bottom dish to a fluorescent microscope stage.\nIn the Bruker miniscanner panel, set the dwell time to 300 us and the 405 nm laser power to 25%.\nCalibrate the galvanometric scanner.\nUsing a 20× lens, identify the cells you would like to photoconvert.\nVerify that other cells are not within 10 μm in x-y and not within 200 μm in z.\nDraw an ROI around the cells you would like to photoconvert. Right-click and select to use ROI as a Stimulation ROI.\nIn the Bruker miniscanner panel, click Stimulate.\nRepeat steps 20–23 until all cells of interest within the hydrogel have been photoconverted (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/680-Fig3.jpg\nFigure 3. MDA-MB-231 before and after photoconversion\nRepresentative fluorescent images of MDA-MB-231 cells grown in 3D collagen to illustrate appropriate fluorescence levels to indicate successful photoconversion. After photoconversion, red fluorescence should be abundant in the photoconverted cells (bottom). Scale bar, 50 μm.\nSee troubleshooting problem 2[href=https://www.wicell.org#sec6.3]\nGel extraction and FACS sorting of photoconverted cells\nTiming: 1-2 h",
    "Proper digestion and preparation of cells into a single cell suspension is crucial for the efficient collection of the fluorescently tagged population. We have minimized the processing time to preserve the transcriptional signature as much as possible. In our case, since we culture our cells in a COLI hydrogel, we chose to use collagenase as our matrix digestion enzyme. 3D cultures using other materials should use their respective appropriate depolymerization strategy and be optimized for a short processing time while minimizing adverse effects on the cells. Since we study collective phenotypes, we also had an incubation phase with trypsin followed by straining to further dissociate the cells. This may not be necessary in other cases where cells are less adherent to each other after gel digestion. We describe a standard buffer for FACS that was amenable to the survival of our cells. Cells that cannot survive in this basic flow sorting buffer may require other supplements or growth media while sorting.\nThe flow cytometer to be used must have the proper lasers and filters to detect the emission spectrum of the photoconvertible protein, in its native and photoconverted state. The equipment we use allows for stringent gating to ensure the collection of a phenotypically pure population. Users can adjust the gate depending on the stringency of their experiment. The flow sorter we use comes equipped with liquid chilling to help preserve our sample, although this may not be necessary in all cases.\nTransfer the collagen gel to a 1.5 mL microcentrifuge tube.\nAdd 50 μL of 10 mg/mL collagenase to the gel.\nUse a P1000 pipette tip to gently mash and mechanically disrupt the gel.\nIncubate the gel in the water bath at 37°C for 5 min.",
    "Mix the solution further with the P1000 pipet tip. The entire solution should be pipetted up and down within the pipette tip. Minimize the introduction of bubbles as much as possible.\nIncubate the gel in the water bath at 37°C for 5 min.\nMix the solution with a P200 pipette tip. The entire solution should be pipetted up and down within the pipette tip. Minimize the introduction of bubbles as much as possible.\nIncubate the gel in the water bath at 37°C for 5 min.\nCentrifuge the solution at 400 × g for 4 min.\nDiscard the supernatant, add 50 μL of 0.25% trypsin, and resuspend the pellet.\nIncubate in the water bath at 37°C for 5 min.\nMix the solution with a P200 pipette tip.\nIncubate in the water bath at 37°C for 5 min.\nCentrifuge the solution at 400 × g for 4 min.\nRemove the supernatant and resuspend the pellet with an ice-cold FACS buffer.\nStrain the cells prior to FACS.\nUse forward and side scatter density plots to exclude debris.\nUse un-photoconverted controls to set gates for red-fluorescence.\nCollect cells expressing red-fluorescence higher than gate (Chen et al., 2020[href=https://www.wicell.org#bib6]).\nSee troubleshooting problem 3[href=https://www.wicell.org#sec6.5]\nTranscriptomic sequencing\nTiming: 2 days - 1 week\nWe use the 10× 3’ v3 Gene Expression kit to prepare our samples for scRNAseq. However, users can choose to use other platforms depending on sample size and specific needs for sequencing coverage. Sequencing was performed on a Hiseq4000 to achieve a depth of at least 25,000 reads/cell. However, sequencing depth can be adjusted depending on the user’s needs and budget.\nPrepare cell samples for scRNAseq using the 10× 3’ v3 Gene Expression kit.\nPerform quality control on libraries using TapeStation.\nSequence the libraries using an Illumina Hiseq 4000.",
    "Use the 10× genomics Cell Ranger pipeline to align reads to the appropriate reference genome. Here we use GRCh38.\nCheck the outputs to ensure that the sequencing depth was at least 20,000 reads per cell. Sequence the libraries more if needed.\nscRNAseq processing\nTiming: varies depending on computational resources and dataset sizes, ∼1-2 h on the GenePattern server\nWe perform differential expression analysis using Seurat v3.1.1 using standard pre-processing protocols as listed on their documentation. Depending on the type of biological heterogeneity being studied, gene expression data may need to be further filtered or normalized.\nImport dataset into Seurat (Stuart et al., 2019[href=https://www.wicell.org#bib19]).\nSee troubleshooting problem 4[href=https://www.wicell.org#sec6.7]\nFilter the counts matrix to remove genes expressed in fewer than 3 cells. This parameter can be increased if desired.\nDiscard cells expressing too few or too many genes. Too few genes may indicate that the cell membrane has been breached and contents leaked. Too many may indicate cell doublets or other artifacts. These parameters must be adjusted to the specific dataset. Here we remove cells expressing fewer than 2000 genes or more than 6000 genes.\nDiscard cells that have over 20% of reads aligned to mitochondrial genes. This parameter can be decreased for more stringent filtering.\nNormalize the counts matrix. We normalized to the default scale factor of 10,000.\nIdentify the top variable genes to be used for downstream analysis. Here we selected the default of 2000 genes.\nApply a linear transformation on the count matrix to scale and center expression of each gene.\nAssign cell cycle scores to each cell based on its expression of G2/M and S phase markers and apply a linear model to regress out effects of cell cycle heterogeneity. The same approach could also be used for batch effect removal if simultaneously analyzing multiple datasets.",
    "Perform linear dimensionality reduction (PCA) on the scaled data using the most variable genes.\nPerform a graph-based clustering approach by first determining the nearest neighbors of each cell in the PCA space. Use the top principal components that explain the most variance in the dataset. We used the first 20 principal components.\nThen cluster cells by applying a modularity optimization algorithm that iteratively groups cells together. A resolution parameter determines the number of clusters obtained. We specified a resolution of 0.05 to obtain 2 clusters based on our expectation that two phenotypes exist within our isogenic photolabeled cells. A higher resolution can be set up to achieve more clusters.\nUse UMAP, a non-linear dimensionality reduction technique, to visualize the clusters where similar cells are placed together in low-dimensional space (Becht et al., 2018[href=https://www.wicell.org#bib1]).\nApply Fisher’s Exact test to evaluate the enrichment or depletion of cell cycle phases in each cluster or phenotype. An odds ratio (OR)>1 indicates enrichment while an OR<1 indicates depletion.\nDifferential expression analysis\nTiming: ∼1 h on the GenePattern server\nIdentify positive and negative markers of each cluster or phenotype by applying the DESeq2 algorithm, which uses a negative binomial distribution (Love et al., 2014[href=https://www.wicell.org#bib15]).\nPerform multiple testing corrections using the Benjamini & Hochberg method to control the false discovery rate. Select differentially expressed genes for each cluster with adjusted p-value lower than 0.05.\nGenerate an expression heatmap to visualize the differential expression of these genes across clusters.\nGene Ontology (GO) term over-representation analysis\nTiming: ∼30 min\nDetermine GO terms that are over-represented in the positive markers for each cluster by inputting the list of genes to the PANTHER classification system (http://www.pantherdb.org[href=http://www.pantherdb.org]) (Mi et al., 2019[href=https://www.wicell.org#bib16]), and choosing Homo sapiens as reference organism and GO biological process complete annotation data set.",
    "Choose Fisher’s Exact test as the statistical test and allow for multiple testing correction via the Benjamini & Hochberg method to control for False Discovery Rate (FDR). Only select significant terms with FDR<0.05.\nGene set statistics (p-values, gene set sizes and overlapping gene counts) can be exported from PANTHER and imported into Python to investigate processes of interest and generate visual summaries such as a bar plot where gene sets are ranked based on p-values.\nPseudotime trajectory analysis\nTiming: ∼1 h on the GenePattern server\nConvert the processed Seurat object to a Monocle3 (Cao et al., 2019[href=https://www.wicell.org#bib4]) object.\nLearn the trajectory graph by fitting a principal graph within each partition.\nChoose the roots of the trajectory representing the beginning of the biological process to order the cells according to their progress along the trajectory.\nPlot the progress through pseudotime trajectory on UMAP plots colored by cell cycle phase, pseudotime, clusters, or expression of marker genes.\nGene expression pattern analysis\nTiming: ∼3–4 h on the GenePattern server\nExtract the expression data for the top variable genes from the processed Seurat object as a matrix.\nApply Coordinated Gene Association in Pattern Sets (CoGAPS) (Fertig et al., 2010[href=https://www.wicell.org#bib8]), a Nonnegative Matrix Factorization algorithm, on the matrix dataset with default parameters.\nSee troubleshooting problem 5[href=https://www.wicell.org#sec6.9]\nExtract the matrix of sample weights for each pattern learned by CoGAPS.\nVisualize the patterns on UMAP plots using sample weights to evaluate associations with a particular cluster or phenotype.\nAnalyze the significance of the association using a Kruskal-Wallis rank-sum test.\nGenerate a sample weights by cells heatmap to visualize the patterns to further evaluate associations with a particular cluster or phenotype."
  ],
  "subjectAreas": [
    "Rnaseq",
    "Bioinformatics",
    "Cell Isolation",
    "Microscopy",
    "Flow Cytometry",
    "Cell Culture",
    "Cell-Based Assays",
    "Molecular Biology",
    "Single Cell",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology"
  ]
}