{
  "id": 2031,
  "origin_website": "Cell",
  "title": "PDMS hydrogel-coated tissue culture plates for studying the impact of substrate stiffness on dendritic cell function",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparing hydrogel plates\nTiming: 13 h\nThe sequence of steps below details how to prepare PDMS hydrogel coated plates with elastic modulus of 2 kPa, 50 kPa, and 100 kPa. Special care is taken to uniformly mix the hydrogel components to ensure consistent gel stiffness.\nCalculate the amounts of reagents needed to prepare the hydrogel according to the proportions indicated below (calculations have been given for a total of 10 g gel as an example). (Table 2[href=https://www.wicell.org#tbl2])\ntable:files/protocols_protocol_1514_8.csv\nWeigh part A and part B of gel into a 50 mL conical tube. Mix thoroughly.\nCritical: Ensure that the A:B mixture is uniformly mixed by inverting the conical tube repeatedly for at least 3 min. Using this strategy, a homogeneous mixture is created with consistent gel stiffness.\nNote: Prepare 10 g of hydrogel mix for a single 24-well plate and 12 g for a single 6-well plate. Prepare hydrogel mix according to the number of plates required.\nCoat the wells of the plate using a 10 mL serological pipette. Ensure that the hydrogel solution fully covers the bottom of the plate. We estimate a minimum of 0.4 mL of gel to coat one single well in a 24-well plate, and 2 mL for one well in a 6-well plate.\nAllow the hydrogel coated plate(s) to cure overnight (8–10 h) at 60°C in an incubator.\nCritical: Maintaining a consistent temperature during incubation is important to avoid any disturbance in the polymerization process.\nSterilize the hydrogel coated plates by ultraviolet irradiation for at least 15 min using a UV Stratalinker. The plates can be stored at room temperature (20°C–22°C) for up to two months.",
    "On the day of assay, coat the hydrogel plates with the desired extracellular matrix proteins (e.g.,1 μg/mL fibronectin in PBS). Allow the proteins to adhere for 4 h at 37°C followed by two-washes with PBS.\nCritical: Once the hydrogel plates are coated with extracellular matrix proteins, it should always remain hydrated with PBS after washing prior to seeding with cells.\nThe plates are ready to be seeded with cells upon removal of PBS.\nStiffness measurement using AFM probe\nTiming: 5 h\nThe following series of steps are taken to validate the elastic moduli of the prepared hydrogels via nanoindentation on a JPK NanoWizard II (JPK Instruments) atomic force microscope (AFM). AFM tips are first modified to facilitate the nanoindentation measurement on very soft gels. This process occurs once (3–4 h), and a successfully modified tip can be reused for future measurements. All nanoindentations are taken in ten replicates for each hydrogel, once, to confirm the stiffness (1 h). The hydrogels are prepared following a specific protocol, and stiffness measurements need not be repeated.\nAlter the tip shape of a silicon nitride probe (0.06–0.10 N/m) with a titanium dioxide-based tip modifier solution.\nSpread the coating on a clean glass slide and create tiny streaks in a crisscross pattern.\nLoad the tip in the AFM and, without submerging the tip, dab it in a streak of coating.\nCure the coated AFM tip under UV-C (254 nm) at 120 mJ/cm2 for 5 min utilizing a UV crosslinker (Spectrolinker XL-1000, Spectronics Corporation).\nProp up the tip on its side under a microscope and image to estimate the radius of curvature of the indenter. (Figure 1[href=https://www.wicell.org#fig1]A: Modified AFM tip)\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1514-Fig1.jpg\nFigure 1. Stiffness measurement using AFM probe",
    "(A) A silicon nitride AFM probe modified with a spherical indenter made from a UV-cured titanium dioxide-based hydrophobic coating material.\n(B) The AFM modified probe in contact with the uncoated 50 kPa gel surface.\n(C) The Hertzian model fit (green) on a measured gel force curve (red).\nPerform ten nanoindentations per PDMS gel sample (fibronectin-coated) in a phosphate buffer saline solution using the modified AFM tip in contact mode. (Figure 1[href=https://www.wicell.org#fig1]B: Probe touching the 50 kPa gel surface). Follow the standard nanoindentation operating procedure described in the instrument manual.\nSet the applied force to 20 nN for measurements on both gels, achieving indentation depths ranging from 100-1500 nm.\nFit the force curves using the Hertzian model for a spherical indenter to obtain the stiffness values. (Figure 1[href=https://www.wicell.org#fig1]C: Force curve on 50 kPa gel)\nTip modifier solution preparation\nTiming: 2 days\nThe following are steps to prepare a viscous, hydrophobic, and UV crosslink sensitive TiO2 nano solution for ideal AFM indenter modification. This method needs only be completed once to prepare a series of modified tips.\nPrepare the TiO2 nano solution.\nMix 1 mL of TTIP with 20 mL IPA to form a clear solution.\nSlowly add the solution to 50 mL of aqueous HCl (pH 1.2), under vigorous stirring.\nTransfer the solution to a 100 mL Teflon-lined hydrothermal reactor and heat at 160°C for 24 h.\nCentrifuge the solution (15,000×g, 1 min) and clean the precipitate with 20 mL of absolute ethanol, followed by drying at 70°C for 2 h.\nDisperse the powder in 10 mL of deionized water to complete the TiO2 nano solution.\nMaking a surface functionalized TiO2/SiO2 hybrid (MFTS).",
    "Mix TEOS (4 mL), MSMA (1 mL), 13F (0.4 mL), TiO2 nano solution (from step 12, 1 mL), IPA (1 mL), and aqueous HCl (2 mL, pH 1.2) and vigorously stir for 24 h to form a homogenous solution.\nTip modifier solution preparation.\nMix MFTS (from step 13), DPHA, and HMPP (a photo-initiator) with the following weight ratio to form the final, clear solution: 110/1.67/0.21 (MFTS/DPHA/HMPP).\nIsolation of splenic CD11c+ cells\nTiming: 2–3 h\nThe goal of the following steps is to digest mouse spleens and isolate the splenic DCs.\nObtain a single cell suspension via collagenase digestion of the spleen.\nPlace the spleen in a 5 cm plastic dish.\nMince the spleen into 1 mm pieces using curved scissors.\nTransfer the minced tissue into a 1.5 mL microcentrifuge and add Collagenase 1-containing DMEM to a final volume of 500 μL at a final concentration of 45 U/mL.\nAllow digestion to take place at 37°C for 45 min under continuous agitation (50 rpm).\nAfter digestion, vortex the sample for 20 s and use repeated pipetting to thoroughly homogenize the tissue.\nPass the homogenized sample through a 40 μm cell strainer placed over a 50 mL conical tube. Rinse off the strainer with additional volumes of cell culture medium. Proceed with centrifugation at 400 g for 5 min to pellet the single cell suspension.\nNote: Pre wet the cell strainer with 1 mL cell culture medium before adding the samples. If large pieces of the spleen are visible in the strainer, then use the plunger of a 1 mL syringe to mash it and then add 10 mL of cell culture medium to wash the cell strainer.\nPerform red blood cell lysis.\nResuspend cells with 3 mL of ACK lysis buffer and allow lysis to occur on ice for 3 min.",
    "Stop lysis by adding > 5 volumes of PBS and centrifuge the cells at 400×g for 5 min. Aspirate supernatant and resuspend the cells in 2 mL appropriate buffer for cell isolation.\nMagnetic enrichment of CD11c+ cells. Please refer to the manufacturer’s protocol (https://www.miltenyibiotec.com/DE-en/shop/comMiltenyiDatasheet/product?productId=54985[href=https://www.miltenyibiotec.com/DE-en/shop/comMiltenyiDatasheet/product?productId=54985]).\nSeeding and culturing CD11c+ cells on a 24-well hydrogel plate\nTiming: 2 days\nThe goal of these steps is to seed and culture isolated CD11c+ cells on PDMS hydrogel coated plates for further downstream analyses.\nEnumerate the magnetically isolated CD11c+ cells.\nSeed cells at a density of 1.3 × 106 cells/mL in supplemented RPM-I cell culture medium into fibronectin/hydrogel-coated plates.\nCulture the CD11c+ cells with stimuli of interest for appropriate lengths of time.\nAt end of culture, collect culture supernatant and harvest cells from the well with a cell scraper for the 50 kPa conditions for downstream applications [see (Chakraborty et al., 2021[href=https://www.wicell.org#bib2])].\nNote: Do not scrape the surface of the 2 kPa hydrogel plates as they are fragile. Instead, use repeated gentle pipetting to dislodge the cells from the 2 kPa hydrogel plates.\nMetabolic profiling of CD11c+ cells\nTiming: 1 day\nThe following steps describe assays that can be used to assess the metabolic activity of isolated CD11c+ cells.\nAfter conditioning the magnetically isolated CD11c+ cells on PDMS hydrogels, a number of downstream assays can be performed to metabolically profile these cells. Some examples are described in (Tsai et al., 2018[href=https://www.wicell.org#bib15]; Chakraborty et al., 2021[href=https://www.wicell.org#bib2]), including Agilent Seahorse extracellular flux analysis, metabolic pathway gene and protein expression profiling, and nutrient uptake assays.\nMetabolic pathways altered by PDMS hydrogel stiffness can be validated by co-culturing CD11c+ cells on PDMS hydrogels in the presence of specific metabolic agonists or antagonists, as described in (Chakraborty et al., 2021[href=https://www.wicell.org#bib2]).",
    "Additional valuable insights can be gained from analyzing the cell culture supernatants for nutrient depletion and metabolite production, using approaches such as metabolomic footprinting assay.\nNote: Since the hydrogel conditioned CD11c+ cells will come in contact with different surface tension during isolation and assay preparation, we recommend working quickly, avoiding prolonged storage, and keeping all conditions consistent to minimize potential confounding effects."
  ],
  "subjectAreas": [
    "Cell Culture",
    "Cell Biology",
    "Immunology",
    "Biophysics"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}