{
  "id": 18766,
  "origin_website": "Jove",
  "title": "A Next-generation Tissue Microarray (ngTMA) Protocol for Biomarker Studies",
  "procedures": [
    "NOTE: This study has been approved by the local ethics committee of the Insel Hospital, Bern, Switzerland (07-10-13). Tissues were obtained from the Tumor bank Bern, Institute of Pathology, University of Bern.\n1. Planning and Design (Consulting)\nThink about the research question to be answered. Decide on the tissue types to be included in the project. Determine what histological structures are important to answer the question.\nAscertain the most useful core diameter and the number of cores per patient for the project. Decide on the number of copies of the next-generation Tissue Micro Array (ngTMA) based on the amount of biomarkers to be investigated.\nConsider statistical aspects such as sample size and analysis after the tissue microarray (TMA) is constructed. Determine the number of patients for inclusion in the study and establish control tissues for the array.\nRetrieve the histological (or diagnostic) Haematoxylin and Eosin (H&E) slides of each patient. Briefly review the slides and identify the ones containing relevant information and histology for the project.\n\tNOTE: Make new sections of the paraffin blocks, if special stain or immunohistochemistry slide is desired for slide scanning and annotation, instead of H&E slides\n2. Slide Scanning\nTurn on PC and slide scanner and open scanning software. Select “automatic mode” for bright field scanning from the preview screen.\nClick on “scan options” to adjust slide quality parameters. At this time, select whether slides are to be directly scanned to the digital platform accessible by web or to a local drive (or external drive) and set the types of scanning and number of focus points.\nClick on “Server Parameters” to scan to the “Case center”. At this step, add more magazines, label all slides and set the folder in Case Center where the slides should be stored. Each magazine holds up to 25 slides.",
    "Check quality/cleanliness of actual histological slides for scanning. If necessary, clean slides with 70% ethanol.\nLoad up to 25 slides per magazine with the labels pointing inward (Figure 3A)\nPlace the magazine in the scanner. For more than one magazine, place them on top of each other.\nStart scanning slide by clicking on the green arrow (Figure 3B). When all slides are scanned, unload the magazines and shut off the program, PC and slide scanner.\n3. Digital Slide Annotation\nEnter the browser address for digital slide management center and download the free digital slide viewer software.\nOpen the digital slide viewer software and select the folder containing the digital slides (Figure 4A).\nAdd notes, reorder and manage the digital slide folder or assign user rights to colleagues or add attachments to the folder.\nClick on desired digital slide which appears in the digital slide viewer.\nUsing the magnification tool, evaluate the slide and find the areas of interest for integration into the ngTMA.\nUsing the ‘TMA annotation tool’, select the size of the desired core and the color of the annotation. Place the annotation on the digital slide by clicking on it (Figure 4B).\nMove the annotation to the desired histological structures for incorporation into the ngTMA (Figure 4C).\nRepeat this process of annotation again by using the annotation tool, selecting a core size and a desired annotation color. Repeat the slide viewing and annotation on all slides in the folder.\nAlternatively, place tissue cores for PCR into 0.2 ml tubes rather than integration into the TMA. Annotate slides using a different color to identify these spots for further molecular analysis.\nCreate a list of all cases with their corresponding annotations and colors.\n4. Tissue Microarray Construction",
    "Retrieve the corresponding paraffin tissue blocks for all annotated digital slides, Sort blocks in the desired order for tissue microarraying.\nEnsure that the tissue blocks have a minimum of 4 mm thickness. If not, reembedding of tissue is necessary.\nTurn the PC “ON” and automated tissue microarrayer instrument. Open the tissue microarrayer software and provide a name to the project\nPerform a “Tool Change” and select the required tool diameter for the project (i.e., 0.6, 1.0, 1.5, or 2.0 mm).\nLoad up to 12 ‘recipient’ TMA blocks into the machine. Give an ID to each of the 12 blocks\nCreate a TMA layout for each recipient block. Observe a TMA design with number of rows, columns, and empty lines as well as distance between cores. Create a new layout for each recipient block or use the same layout repeatedly.\nPlace the cursor on the recipient block layout to take the first core.\nNext, load up to 60 donor blocks into the tissue microarrayer (Figure 5A). Place ten blocks in each row A to F. Give each block a donor ID. Observe images of each donor block on the computer screen acquired automatically by the tissue microarrayer.\nStarting with the first block, click on “Slide”. Observe the annotated digital slide stored in the digital slide management center (or on the external drive) using the digital slide viewer. View the image of the donor block and the digital slide side-by-side.\nSelect reference points on the block image to superimpose the donor block image with the digital slide\nAfter clicking “Next”, observe the annotations on a larger image of the block. (Figure 5B). Click on top of the annotations to confirm and click “Start”.",
    "NOTE: This prompts the tissue microarrayer to start drilling a hole of 0.6 mm in diameter in the recipient block at the selected starting point. Then in a second step, using the punching tool, the instrument punches hole in the tissue from the selected donor block at the exact annotated and confirmed region. Cores are then transferred from the donor to the recipient block.\nAfter approximately 500 cores, clean the drill and punching tool using a swab of xylene.\nIf tissue cores are desired (rather than punches into an ngTMA), click on the “PCR” tool for the block, confirm up to 4 annotations and hit “Start”. This will punch and transfer the cores into a 0.2 ml tube.\nRepeat point 4.9 to 4.11 with the second donor block, and so on.\nAfter using all the donor blocks, enter a second round of donor blocks (61-120) into the tissue microarrayer and continue steps 4.8 to 4.11.\nRefresh donor and recipient block images while the project progress while drilling and punching is occurring (Figure 5C).\nPerform an “Export” after the project is complete. Locate the .xslx file with the donor and recipient block IDs, the localization of all punches within the TMA as well as the TMA layout/design, in the exported folder. Save all donor block images with all superimposed annotation as jpg images in the exported folder (Figure 5D). The final TMA block is then ready."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}