{
  "id": 6002,
  "origin_website": "Bio",
  "title": "Synthetic Genetic Interaction (CRISPR-SGI) Profiling in <em>Caenorhabditis elegans</em>",
  "procedures": [
    "Creation of double mutants The generation of single mutants using CRISPR/Cas9 has been covered elsewhere (Norris et al., 2015). This protocol begins with two single mutant worms in which the genes of interest have been deleted and replaced by compatible heterologous fluorescent reporters. In this example, the reporters are myo-2::GFP (expressed in pharyngeal muscles) and myo-3::GFP (expressed in body wall muscles).   To create a male strain necessary for crossing, there are two options:   Cross ~5 wild-type (N2) male worms (available from CGC) with ~5 hermaphrodites of mutant strain #1 to create male progeny that are heterozygous for the mutation (verify by ensuring the males are fluorescent).   Obtain homozygous males of mutant strain #1 according to standard protocols (He, 2011a).    Cross males from mutant strain #1 with hermaphrodites from mutant strain #2 (see Figure 1).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180228/20180228005630_6786.jpg Figure 1. Crossing strategy to create double mutant worms from individual single mutant strains. GFP is used to distinguish homozygous mutants (P0 and F2 panels, brighter fluorescence) from heterozygous mutants (F1 panel, dimmer fluorescence).    Pick a single cross-progeny hermaphrodite containing both GFP markers (both myo-2::GFP and myo-3::GFP) onto a new plate. These worms correspond to double heterozygotes (i.e., mutant1/+; mutant2/+). Allow these hermaphrodites to self-fertilize.   To obtain double-homozygous strains, pick worms with brighter GFP expression coming from both promoters. On a good-quality fluorescence dissection scope, you should be able to tell a difference in brightness between a strain with one copy (heterozygous mutant) and two copies (homozygous mutant) of the GFP transgene (see Figure 2). Note: Alternatively, pick a larger number of worms to individual plates and determine double homozygotes as worms with progeny that are 100% fluorescent for both transgenes.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180228/20180228005728_7010.jpg Figure 2. Fluorescent brightness reveals mutant genotypes.",
    "Worms imaged in situ on NGM plates demonstrating that homozygous mutants (left) are noticeably brighter than heterozygous mutants (right).     Competitive fitness assay The competitive fitness assay (Figure 3A) provides a simple and relatively high-throughput method for assessing phenotypes of large numbers of mutants and can be performed immediately after strain generation.   Pick equal numbers of wild-type (N2) and mutant worms onto one seeded NGM plate (see Recipes).  Note: We find that 4 staged L4s of each genotype (i.e., 4 wild-type L4s and 4 mutant L4s) on a 6 cm plate works best to support 2 generations of growth without starving out the plate.   Incubate plate at 25 °C for 5 days.   Under a fluorescent stereomicroscope count the number of fluorescent (mutant) worms versus non-fluorescent (wild-type) worms. We prefer to count from pre-defined locations on each plate (e.g., 50 worms from the middle of the plate, 50 from the periphery, and 50 from in between).  Notes:    We recommend counting all hatched worms regardless of stage.   For ease of counting, worms can be treated with anesthetic or cooled at 4 °C for an hour or longer.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180228/20180228005938_6817.jpg Figure 3. The competitive fitness assay. A. Schematic overview of competitive fitness assays; B. Representative visualization of synthetic effect (ɛ) calculation for a genetic interaction between the genes exc-7 and mbl-1."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Systems Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}