{
  "id": 3915,
  "origin_website": "Cell",
  "title": "In-gel proteasome assay to determine the activity, amount, and composition of proteasome complexes from mammalian cells or tissues",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nNative page gel electrophoresis\nTiming: 4–5 h\nNative protein extracts are loaded onto native page gels for separation into doubly/singly capped proteasome (30S/26S) and 20S proteasome complexes. 20S Proteasome complexes are usually a mixture of free 20S and 20S capped with one or two proteasome activators (PA28α/β, PA28γ, PA200) depending on the sample.\nTo obtain consistent results between experiments, use NuPAGE 3%–8% Tris-Acetate gel (NOVEX Life Technologies, EA0378BOX). Use 1.5 mm thick gels to increase the amount of loading volume, if necessary.\nPrepare the samples so that each sample contains exactly 15 μg protein diluted in ddH2O with 1× Native Gel Loading Buffer on ice.\nCritical: Total volume of sample mix should not exceed 20 μL. Increasing the total volume might cause leakage from one gel-loading pocket into the neighboring pocket upon loading.\nOnce the samples are ready, prepare Native Gel Running Buffer.\nPlace the gels into the tank and fill up the gasket with Native Gel Running Buffer (see recipe below) and load samples carefully into the wells.\nNote: Do not forget to remove the white strip from the purchased gels before placing it into the tank.\ntable:files/protocols_protocol_639_6.csv\nCritical: Running Buffer always needs to be prepared freshly and used only once. Do not store Native Gel Running Buffer and do not use it again.\nAfter all the samples are loaded, carefully pour the remaining Native Gel Running Buffer into the tank but avoid filling it into the gel pockets. Run the gel at 150 V for 4 h at 4°C (cold room or fridge).",
    "Critical: From our experience, the first and last pockets of the gels show different resolution and activity of proteasome complexes in the purchased gels. For this reason, we always use dummy samples (DS), which we load into the first and the last wells of the gel as a balance and avoid leaving empty pockets in the gel. We prepare the dummy samples from cell pellets where we can have a large amount of proteins either using TSDG or OK lysis buffer. For these dummy samples the cell type does not matter. The important part of the dummy sample is that it must contain the same amount of protein, water and native gel loading buffer as the samples to analyze within the same final volume. Since normally we load 15 μg of protein in a pocket with 20-μL final volume, we generally stock dummy samples in PCR tubes which contains 30 μg of protein in 32 μL of water and freeze at −20°C until further use. When we need the dummy samples, we defrost dummy samples and add the 5× native gel loading buffer (8 μL). We then load 20 μL of dummy sample to the both ends of the gel. If you have 15 well gel, but only have 10 samples (S), load dummy samples to the remaining 5 wells. An example of loading is given below. Troubleshooting 4[href=https://www.wicell.org#sec7.7]\ntable:files/protocols_protocol_639_7.csv\nIn-gel proteasome activity assay\nTiming: 45 min\nThe activity of different proteasome complexes can be measured via in-gel proteasome activity assay. Our protocol is optimized for the analysis of the chymotrypsin-like activity of the proteasome.\nDefrost 2 mM Suc-LLVY-AMC stock solution one hour prior to the end of running of the gel. Keep it at 20°C – 23°C and in the dark.\nPrepare Reaction Buffer once the running is finished.",
    "table:files/protocols_protocol_639_8.csv\nCritical: Reaction buffer always needs to be prepared freshly and used only once. Do not store reaction buffer and do not use it again.\nPlace the Reaction Buffer in a black box to shield it from light and transfer the gel (which has been removed from plates) into the box. Make sure that the Reaction Buffer covers the gel.\nIncubate the gel for 30 min with the Reaction Buffer at 37°C in the dark box.\nAfter incubation, transfer the gel to the plastic holder of the imaging system (e.g., Gel Doc EZ (Bio-Rad) or iBright™ CL1500 Imaging System (Invitrogen)) and image at an excitation wavelength of 380 nm and emission wavelength of 460 nm.\nNote: After imaging, transfer the gel immediately back into the box which contains Reaction Buffer. Be careful to not let the gel dry out!\nImmunoblotting\nTiming: 2 days\nImmunoblotting and staining with specific antibodies directed against proteasome subunits or regulators can be used to quantify the amount of active proteasome complexes. Thereby, the composition of the proteasome complexes can be specified regarding regulators attached or catalytic subunits (such as standard or immunoproteasome) incorporated.\nAfter measuring the proteasome activity, remove the Reaction Buffer and soak the gel in Solubilization Buffer for 10–15 min at 20°C–23°C.\ntable:files/protocols_protocol_639_9.csv\nCritical: Prepare Solubilization Buffer as a stock solution containing only the first two ingredients, i.e., SDS and Na2CO3 and store at 20°C–23°C. Add β-Mercaptoethanol (1.5% (v/v)) always freshly once you need the Solubilization Buffer for the experiment. Solubilization Buffer can be used 2–3 times, but we recommend preparing fresh Solubilization Buffer each time. The Solubilization Buffer is important to denature the proteins in the gel. Troubleshooting 5[href=https://www.wicell.org#sec7.9]\nPrepare 1 L of Transfer Buffer (1× transfer buffer, 10% methanol (v/v)).",
    "Activate polyvinylidene fluoride (PVDF) membrane (Bio-Rad) in pure methanol for 2 min.\nCut off the wells and use the lower thick part of the gel to transfer it to the membrane for immunoblotting using the traditional wet electroblotting method at a constant current of 250 mA for 90 min or 40 mA for 16 hours.\nBlock unspecific binding sites of the PVDF membrane with Roti®-Block solution (Carl Roth) at least for one hour.\nAdd primary antibody diluted in Roti-Block solution either 16–24 h at 4°C or for 1–2 h at 20°C–23°C.\nNote: The latter needs fresh primary antibody dilutions.\nAfter incubation with primary antibody, wash the membrane three times with PBST (1× Phosphate-Buffered Saline, 1% Tween 20 v/v) for 10 min at 20°C–23°C.\nIncubate with horseradish peroxidase conjugated secondary antibody diluted to a range of 1:20 000 - 1:40 000 in PBST for 60 min at 20°C–23°C on a shaker.\nNote: The dilution for secondary antibody can be adjusted according to primary antibody.\nAfter incubation with horseradish peroxidase conjugated secondary antibody, wash the membrane three times with PBST for approximately 30 min at 20°C–23°C.\nDetect the proteins using LuminataTM Classico or Forte reagent (Merck Millipore) according to manufacturer’s instructions (https://www.merckmillipore.com/[href=https://www.merckmillipore.com/]) at 20°C–23°C.",
    "Critical: If you have enough protein lysate, we encourage you to incubate each membrane with only one antibody. However, note that the membrane can be stripped, blocked and re-incubated with another antibody. Since there is no separation regarding to the size of the subunits, you will possibly detect two different proteins in the same location on the gel corresponding to their integration into 30S, 26S or 20S proteasome complexes. For this reason, make sure that the stripping works. First, strip the membrane and block the unspecific bindings. If your primary antibodies have been generated in the same species (e.g., rabbit-rabbit), incubate your membrane with the secondary antibody directed against this species (e.g., anti-rabbit) after blocking and image the blot (steps 18–20). If you do not get any signal, the stripping of the blot has worked, and you can proceed with adding the other primary antibody (Figure 2[href=https://www.wicell.org#fig2]). If your primary antibodies are generated in different species (i.e., mouse-rabbit) you can directly proceed to step 20 after stripping/blocking the membrane. If no bands appear, you can add the other primary antibody. If you detect some signals after stripping/blocking procedures, do not use this membrane again for staining with another primary antibody.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/639-Fig2.jpg\nFigure 2. Re-using same membrane for probing with two different primary antibodies",
    "A549 cells were treated with IFNγ+TNFα (10 ng/mL and 20 ng/mL, respectively, for 24 h). The first lane (1) contains native lysates from control cells, the second lane (2) contains lysates prepared from A549 cells treated with inflammatory cytokines. After the in-gel proteasome activity assay (left panel), the gel was immunoblotted and incubated with anti-MECL-1 antibody (middle panel). The same membrane was used for detection of LMP2, a second catalytic subunit of the immunoproteasome (right panel). Since both antibodies were from the same species (rabbit) the membrane was incubated with the secondary antibody after stripping/blocking and imaged. The anti-LMP2 antibody was added to the membrane upon confirmation that MECL-1 was not detectable anymore."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Cell Biology",
    "Protein Biochemistry",
    "Antibody"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}