{
  "id": 7877,
  "origin_website": "Bio",
  "title": "Qualitative and Quantitative Methods to Measure Antibacterial Activity Resulting from Bacterial Competition",
  "procedures": [
    "A schematic diagram depicting the whole experimental procedure is shown in Figure 2.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4706/bioprotoc-13-13-4706-g002.jpgFigure 2. Lysis-associated β-galactosidase assay (LAGA) and survivors growth kinetics (SGK) protocols at a glance. Attacker/predator and recipient/reporter/prey are cultured (A). Cell culture ODs are adjusted, and attacker and recipient mixed at the appropriate ratio (B). Cell mixtures are spotted on agar plates (C). Cell spots are either treated with chlorophenol-red β-D-galactopyranoside (CPRG) (D, LAGA assay) or resuspended and serially diluted into selective medium (E, SGK assay). After aliquoting into a 96-well plate (F), cell growth is spectrophotometrically monitored (G) and growth curves are plotted and compared to standard curves to measure the time of emergence (H).LAGA protocol Preparation of attacker (predator) and recipient (prey) cultures Isolate the attacker(s) and the recipient(s) on specific medium agar plates, with any appropriate antibiotics if necessary.Grow the strains in the adequate medium until the stationary phase.Note: It is recommended to grow three independent colonies, for triplicate experiments. Dilute the precultures in fresh medium to an optical density (A600) of 0.05–0.1 and incubate with shaking to the desired A600 (Figure 7A).Notes:  To increase the expression of the lacZ gene, the recipient cell culture can be supplemented with 0.1 mM of IPTG. lacZ expression could be significantly different depending on the recipient strain, growth medium, and growth conditions. We recommend using the same recipient culture with the different attackers for comparison. Preparation of the attacker:recipient suspension and cell–cell contact Prepare attacker and recipient cell suspensions at equal OD and mix them to the appropriate ratio (Figure 2B).Note: For each attacker/recipient combination, the OD of the cell suspension and the attacker:recipient ratio should be optimized. Resuspension at 1–10 OD and 1:1–1:20 attacker:recipient ratio are typically used.",
    "Spot 10 μL of the attacker:recipient cell suspension onto appropriate solid growth medium (medium allowing the growth of both attacker and recipient strains) and let dry (Figure 2C).Notes:  It is recommended to spot each suspension three or four times for technical replicates (if three independent cultures and attacker:recipient have been made, this represents 9–12 spots for each attacker:recipient combination). Control experiments should be performed by spotting the attacker only and the recipient only. In some cases of predation that require flagellar motility (e.g., Bdellovibrio), the attacker:recipient cell mixture should be incubated in liquid medium. For easy recovery of cells or in the case of sticky cells, the mixtures can be spotted on 0.45 μm membrane filters. Incubate at the desired temperature for the optimized time.Note: The optimal temperature depends on the attacker:recipient combination. The incubation time (usually between 1 and 24 h of contact) should be optimized. CPRG hydrolysis and antibacterial activity evaluation Add 10 μL of 1 mM of CPRG on top of the bacterial spot. Spot staining usually occurs in 10 min to 2 h (Figure 2D).Note: CPRG hydrolysis could be measured with the supernatant. In this case, scrape the cells and resuspend the bacterial spot into 1 mL of PBS, centrifuge at 2,400× g for 5 min at 20 °C to pellet cells, and add 10 μL of 1 mM of CPRG into the supernatant. Measure the absorbance at λ = 572 and/or fluorescence (excitation at λ = 580 nm and emission at λ = 620 nm) after 10 min to 2 h. β-galactosidase activity could also be calculated by the slope obtained by measuring absorbance at λ = 572 every minute during 10 min, and expressed in μM/min using ϵM(CPR) = 45,000 M-1cm-1.",
    "SGK protocol Attacker and recipient cultures, preparation of attacker:recipient suspensions, and cell–cell contact Follow sections A and B of LAGA protocol.Serial dilutions and growth measures Aliquot 100 μL of selective medium in the adequate number of wells of a 96-well microplate. Fill in extra wells with 200 μL of medium for blank measurements.After incubation, scrape and resuspend the bacterial competition spots in 1 mL of selective medium in a 2 mL tube and vortex vigorously (Figure 2E).Prepare serial dilutions of the suspensions (usually 1/2, 1/5, or 1/10 serial dilutions) (Figure 2E). At the same time, prepare 10-1 to 10-6 serial dilutions for the recipient alone to obtain standard curves.Note: Serial dilutions to be done depend on the level of antibacterial activity and need to be optimized. Add 100 μL of each serial dilution to the 96-well plates (Figure 2F).Run a Tecan microplate reader program for measuring bacterial cell growth (A600) for 15 h with 5 min intervals at the optimal temperature with shaking (Figure 2G).Note: To calculate a correlation between the initial number of surviving cells and the Te, plate 100 μL of recipient standard dilutions on selective agar plates. After incubation, count the number of colonies. Plot the growth of the recipient standards and attacker:recipient suspensions over time and calculate the Te (Figure 2H). The Te could be represented on a graph alone (see Figures 6C and 7B) or with the standard curve (see Figure 5C)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}