{
  "id": 3541,
  "origin_website": "Cell",
  "title": "A pipeline for STED super-resolution imaging and Imaris analysis of nanoscale synapse organization in mouse cortical brain slices",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nImaging\nTiming: ∼30 min to 1 h/image\nOur experimental design utilizes genetic labeling of L2/3 pyramidal cells with the fluorescent protein GFP to study neuronal morphology (Question 1). In our protocol, confocal imaging of the GFP fill is necessary to determine the localization and nanoscale organization of various proteins in dendritic structures.\nNote: The user should know that in this case GFP's natural fluorescence response is not conducive to super-resolution imaging due to its relatively broad emission spectrum and susceptibility to photobleaching.32[href=https://www.wicell.org#bib32] Once ROIs and Z stacks are selected according to the dendrite of choice, STED parameters may be optimized for the resulting puncta clusters in each channel of interest (in our case GluR1 and LAMP1, please see the “optimizing confocal imaging parameters guide[href=https://www.wicell.org#sec1.8]” section above).\nNote: Excitation power should be initially set so that averaging of the signal results in adequate visualization of dendritic spines for accurate morphological reconstructions. This will result in an image most suitable for Imaris digital reconstruction. Excitation and STED power should be set so that averaging of the signal results in bright low background images without danger of bleaching. Before beginning an experiment, the user should determine empirically optimized imaging parameters of each dye or fluorescent protein. Please see “optimizing confocal imaging parameters guide[href=https://www.wicell.org#sec1.8]” for more information.\nCritical: To reduce optical aberrations, the user should image superficial dendrites, preferably within the first 10–15 μm of the tissue. Additionally, the user should image horizontally aligned dendrites, where most of the dendritic shaft is contained within a few optical sections.",
    "Note: Imaging the morphology of dendritic structures with nanoresolution can be accomplished by using secondary antibodies that are conjugated with STED compatible fluorophores (described later). However, in our protocol, because of the limited availability of channels, this is not compatible with protein cluster colocalization experiments.\nNote: For imaging, we use an inverted laser scanning confocal microscope with 60 × 1.4 NA oil immersion objective (Nikon, Tokyo) outfitted with an Abberior Facility Line STED system controlled with the Abberior Imspector software platform.\nTo begin imaging, select 485 nm (for GFP IUE cell fill), 561 nm (Abberior STAR Orange for GluR1), and 640 nm (Abberior STAR Red for LAMP1) pulsed excitation lasers lines.\nSelect 775 nm STED depletion laser (Abberior STAR Orange, Abberior STAR Red) line.\nSelect ROIs localized to L1 apical dendritic tufts from L2/3 pyramidal cells in the mPFC. To find the best ROI:\nNote: Maintain a strict selection criterion when imaging the morphology and density of dendritic spines in the cerebral cortex. In our experience, we have observed significant variability in spine density between apical and basal dendrites and dendritic spine segments of different dendritic branch orders4[href=https://www.wicell.org#bib4],10[href=https://www.wicell.org#bib10],33[href=https://www.wicell.org#bib33] and in how genetic manipulations affect specific dendritic types.4[href=https://www.wicell.org#bib4] It should be noted that L1 apical tufts are mostly within the first 50 μm below the pia.34[href=https://www.wicell.org#bib34]\nSelect a region that is away from the dendritic tuft end or the branching region.\nNote: This step will reduce spine density variability within individual dendritic shaft segments.\nUse the cell fill channel in the eye-port of the microscope to find a dendritic shaft segment that measures at least 30 μm, parallel to the horizontal plane, as much as possible, so that much of the segments is located within a few Z-steps.",
    "Note: This will reduce the spine density variability within dendritic shaft segments, decrease imaging time and homogenize artifacts from optical aberrations within the ROI.\nChoose dendritic segments that are isolated from other cells.\nNote: “Busy” images with several dendrites around and across the dendrite of interest will make reconstruction much more difficult. The user can increase the sparseness of transfected cells in L2/3 by optimizing IUE plasmid concentration or the parameters of the voltage pulses applied during the IUE.5[href=https://www.wicell.org#bib5]\nNote: If the user is experimenting with Cre-dependent constructs to obtain sparse expression, they can optimize the ratio of the plasmids containing Cre recombinase and the Cre-dependent construct.35[href=https://www.wicell.org#bib35]\nOnce a dendrite is chosen, set the Z stack according to the cell fill channel, adding a few sections of space above and below the dendrite to image its entirety without question.\nNote: In our protocol, this is accomplished by acquiring images from dendritic shafts and synaptic markers localized to apical dendritic tufts in L1 as stacks of approximately 20–60 optical sections (Z-step = 0.2 μm) with an X/Y resolution of 40 px/μm.\nNote: When imaging both the dendrite and puncta, excitation and STED laser power for each channel should be set to levels in which the readout of the signal intensity after a single scan is bright but does not result in photobleaching.",
    "Critical: If the system utilizes a photon-counting detector mode, the excitation and STED laser power should be set so that it does not result in a nonlinear relationship between photon counts and excitation. In the case of the Abberior Imspector software, the excitation should be brought up so that the “counts” readout is not much more than 100 for a single scan (see Note below). We recommend determining which confocal excitation power setting for a channel result in approximately 100 or so counts (a confocal test).\nCritical: If one is using a system with a different readout of signal intensity, we recommend determining a confocal excitation power setting that results in a signal that is midway between too dim to see and oversaturated after a signal scan, so that signal averaging or set scan accumulations may be set without photobleaching the sample (please see “optimizing confocal imaging parameters guide[href=https://www.wicell.org#sec1.8]” section for detailed instructions and imaging tips).\nWhen using the Abberior STED Facility line system, the period during which photons are counted in response to each excitation pulse is approximately 27 ns. Avalanche photodiodes can only detect a single photon during that period as they need to be electronically reset to detect a second one. This necessitates measures to ensure that the probability of missing photons is very low. Therefore, we suggest that about half of the intervals are blank. Considering these 27 ns periods are repeated for 5 μs, we recommend keeping the photon counts to approximately 100 for the 5 μs period as a rule of thumb. Higher counts will not affect the location of the labeled proteins but will affect the relative brightness. Therefore, a linear range of counts should be implemented if quantification of fluorescence is desired. To do this",
    "Double the above confocal excitation power value for the STED excitation.\nSet the STED depletion laser power setting at a level that does not detract from the counts given by the confocal test, i.e., addition of the STED depletion laser should not result in lower signal intensity than the confocal test and does not degrade the image (based on the confocal test).\nNote: We recommend determining the STED depletion laser power via trial and error with practice areas that won’t be used for analysis.\nNote: Accumulations/averaging of the signal should be set to provide the brightest image without bleaching the fluorophores. To do this, the user should test excitation/averaging combinations on practice areas that will not be used for analysis.\nSTED dendrite imaging\nTiming: ∼1 h/image\nThis step describes the strategy for super-resolution STED imaging and analysis of the dendrite for the determination of neuronal morphology (Figure 3[href=https://www.wicell.org#fig3]) (Question 1).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3111-Fig3.jpg\nFigure 3. Dendrite imaged with STED then reconstructed in Imaris (Question 1)\n(A) GFP-positive dendrite from a transfected L2/3 neuron in the mPFC stained with anti-GFP primary and Abberior STAR Orange secondary, then imaged with STED.\n(B) Reconstructed dendritic spines in Imaris with semi-automatic filament reconstruction (described in the protocol). For both images, scale bar = 0.7 μm.\nTo select and image a dendritic ROI, follow the steps in the previous “imaging[href=https://www.wicell.org#sec4.1]” section.\nNote: Using the IHC protocol described above, we stain transfected GFP-positive cells and processes with an anti-GFP primary (1:500) and corresponding Abberior STAR Orange or STAR Red secondary (1:300 STAR Orange, 1:1000 STAR Red). This approach allows the cell fill signal to be compatible with STED imaging.",
    "Note: Considering the size and shape of dendritic structures to be imaged with STED, one must be cognizant of the power to counts ratio for resolving small structures such as necks without bleaching the sample. The user should remember that the spine necks will be dimmer relative to spine heads (Figures 3[href=https://www.wicell.org#fig3]A and 3B).4[href=https://www.wicell.org#bib4],10[href=https://www.wicell.org#bib10],36[href=https://www.wicell.org#bib36]\nNote: Optical aberrations can be further reduced by combining STED with hollow Bessel beams, or adaptive optics described elsewhere.37[href=https://www.wicell.org#bib37],38[href=https://www.wicell.org#bib38],39[href=https://www.wicell.org#bib39]"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience",
    "Microscopy"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}