{
  "id": 17640,
  "origin_website": "Jove",
  "title": "Location, Dissection, and Analysis of the Murine Stellate Ganglion",
  "procedures": [
    "All procedures involving animals were approved by the Animal Care and Use Committee of the State of Hamburg (ORG870, 959) and the North Rhine-Westphalian State Agency for Nature, Environment and Consumer Protection (LANUV, 07/11) and conform to the National Institutes of Health's Guide for the Care and Use of Laboratory Animals (2011). Studies were performed using male and female (aged 10-24 weeks) C57BL/6 mice (stock number 000664, Jackson Laboratories) and mice homozygous (db/db) or heterozygous (db/het; control) for the diabetes spontaneous mutation (Leprdb; BKS.Cg-Dock7m+/+ Leprdb /J, stock number 000642, Jackson Laboratories). The authors have used the protocols at hand without variations for mice aged up to 60 weeks.\n1. Location and dissection of murine stellate ganglia\nNOTE: Even though descriptions and drawings are mostly available in bigger species, some publications have previously described the location of the SG in rats24 and mice25 using anatomical methods and fluorescent reporter lines, respectively.\nPrepare 50 mL of ice-cold (3-4 °C) heparinized (20 units/mL, see Table of Materials) phosphate-buffered saline (PBS). Perform dissection of the SG at room temperature (RT).\nDeeply anesthetize mouse by inhalation of 3%-5% isoflurane according to the institutional and local guidelines. Verify adequate anesthesia by loss of pedal withdrawal reflex. Decapitate mice or perform cervical dislocation.\n\tNOTE: Incorrect cervical dislocation can result in breakage of the spine and damage of thoracic vessels leading to bleeding which hinders the preparation or severing of the sympathetic chain, so that SG are not in their correct position. Therefore, it is critical to have experienced personnel perform cervical dislocation or decapitate animals in deep sedation.\nSpray the skin with ethanol and open the thorax with two incisions along the anterior axillary lines using Mayo scissors and narrow pattern forceps. Cut the diaphragm and remove the front of the ribcage.",
    "Remove the heart-lung package by gripping the aorta and vena cava right above the diaphragm using London forceps and cutting all vessels and connective tissue close to the spine below with the Strabismus scissors.\nFlush the thorax thoroughly with heparinized PBS using a plastic disposable pipette until all traces of blood are removed.\nPlace the torso under stereomicroscope preparation binoculars and ensure good lighting in the thorax with external light sources.\nLocate the first rib and the longus colli muscles.\n\tNOTE: The SG are located bilaterally, parallel to the spine at the branch between the first rib and the spine, in a groove lateral to the longus colli muscles24. The flat side of the SG is located adjacent to the longus colli muscles. Depending on the preparation, parts of the sympathetic chain might already be visible as white, oblique fibers parallel to the spine. These can be traced along to the SG.\nGently use the tip of the Dumont #5/45 forceps to expose the connective tissue lateral to the longus colli muscle.\nTurn the forceps around by 180° and use the flat side to grip the SG and pull it out with minimal pressure.\nRepeat with the second SG.\nPlace both SG in a dish (6 cm diameter) filled with cold PBS and inspect with the appropriate magnification. If necessary, remove excess vessels, fat tissue, and larger nerves.\n\tNOTE: Autonomic ganglia are surrounded by a connective tissue capsule consisting of collagen fibers and fibroblasts26,27.The permeability of these capsules seems to vary among species, different kind of ganglia26 and age28. Remove as much connective tissue as possible using Dumont #5/45 forceps and, if necessary, spring scissors.\nDepending on the goal of the experiment, proceed with section 2, 3, or 5 of this protocol.\n2. Whole mount immunohistochemistry protocol",
    "NOTE: This protocol is adapted from cardiac whole mount stainings4,29. Perform incubation steps for every single SG in one well of a 96-well plate and use 100 μL (for antibody-containing solutions) to 200 μL (for all other solutions) of the solution to ensure complete coverage. Regularly check the coverage and correct immersion of the SG with binoculars. Remove liquids manually with a 200 μL pipette with an additional 10 μL tip on top of the 200 μL tip. This will prevent aspiration of the SG in the pipette tip. Use freshly prepared solutions and sterile liquids to prevent bacterial growth.\nFix SG for histology for 2 h at RT in 4% methanol-free paraformaldehyde (PFA)/PBS.\nProcess SG as quickly as possible, but they can be stored for 2-4 weeks at 4-6 °C in PBS with 0.02% (w/v) sodium azide at this point.\nPrepare Sudan black stock solution (1% Sudan black w/v in 100% ethanol) for reduction of autofluorescence and improvement of signal to background ratio30. Dissolve for 2-3 h on a magnetic stirrer at RT.\n\tNOTE: Use the stock solution for a maximum of 6-8 weeks, discard earlier when sedimentation appears.\nPrepare Sudan black working solution by centrifuging the stock solution for 30 min at full speed (13,000 x g) to remove debris and diluting the stock in 70% ethanol to a final concentration of 0.25% Sudan black.\nTreat SG with Dent's bleach to improve antibody permeabilization31. Freshly prepare Dent's bleach by mixing methanol (MeOH), hydrogen peroxide solution 30% (w/w) in H2O and dimethyl sulfoxide (DMSO) in a ratio of 4:1:1. Add 200 μL per SG and place the plate on an orbital shaker for 1 h at RT.",
    "Perform a descending MeOH series for rehydration by incubating for 10 min each on an orbital shaker: 100% MeOH, 75% MeOH/PBS, 50% MeOH/PBS, 25% MeOH/PBS.\nPerform permeabilization by incubating SG twice for 60 min each in PBS/1% Triton-X-100 at RT.\nRemove permeabilization solution from the SG and add Sudan black working solution. Incubate for 2 h at RT on an orbital shaker.\nIn the meantime, prepare a blocking solution by adding 5% receptor grade bovine serum albumin (BSA) and 0.1% Triton-X-100 in PBS a 15 mL vessel and let it dissolve on a roller shaker for approximately 5-10 min. Decant through a pre-pleated paper filter to remove debris.\nRemove Sudan black very carefully by tilting the plate and carefully pipetting from the upright side.\n\tNOTE: It is not possible to see the SG in Sudan black. Use a strong light source and work slowly. From this step on, SG are stained black, enhancing visibility. If any additional connective tissue is seen surrounding SG at this point, remove it using Dumont #5/45 forceps and spring scissors.\nAdd 200 μL of PBS/0.1% Triton-X-100 (PBS-T) and wash for 5 min at RT on an orbital shaker.\nRemove PBS-T by aspirating it with a pipette and repeat 2 times.\nRemove PBS; add 200 μL of blocking solution and incubate at 4 °C overnight on an orbital shaker.\nOn the next day, prepare solutions by adding primary antibodies in the blocking solution. Adapt antibody concentrations from established protocols.\n\tNOTE: Include one SG as antibody control without primary antibody (incubated with antigen-preabsorbed antibody or IgG, if available, or blocking buffer).\nPerform primary antibody incubation for 36-48 h at 4 °C on an orbital shaker. For cell size measurements and staining of sympathetic neurons, use antibodies against tyrosine hydroxylase (see Table of Materials for antibody recommendations).",
    "NOTE: Place the 96-well plate in a wet chamber (e.g., plastic box lined with ddH2O-wetted paper towels) to prevent evaporation at this point.\nRemove antibody solution carefully and add 200 μL of PBS-T. Place the plate on an orbital shaker for 30 min.\nRemove PBS-T and repeat the washing step 5 additional times.\nPrepare the secondary antibody working solution by centrifuging fluorescent Alexa-labeled secondary antibodies for 1 min at full speed (13,000 x g) before usage. Dilute the appropriate secondary antibodies according to the primary antibodies 1:500 in the blocking solution and add to SG. Add 1 μg/mL of bisbenzimide H33342 trihydrochloride (Hoechst staining) if nuclear staining is desired. Incubate for 12-24 h at 4 °C on an orbital shaker.\nRemove the antibody solution carefully and add 200 μL of PBS-T. Place the plate on an orbital shaker for 30 min.\nRemove PBS-T and repeat the washing step 5 additional times. For the last step, use PBS without Triton.\nFor embedding, spread 50-100 μL of fluorescent mounting medium (see Table of Materials) on a glass slide and place under preparation binoculars. Use Dumont #5/45 forceps to pick up SG from the 96-well plate and remove excess liquid by dipping one end on a filter paper (e.g., Whatman drying pad) and place it on the drop.\nUse Dumont #5/45 forceps to correct positioning with the appropriate magnification.\nGently place a glass coverslip (20 mm x 20 mm) next to the SG and slowly descend.\n\tNOTE: Using too much mounting medium will result in movement of the SG or tangling of nerves. If that happens, quickly remove the coverslip and repeat steps 2.9-2.21.\nLet the slides dry in the dark overnight at RT. Storage of the stained specimen is possible for at least 4-6 weeks at 4 °C.",
    "3. Whole mount in situ hybridization\nNOTE: Whole-mount in situ-hybridization of the SG is adapted from the organ of corti32 and the commercial RNA fluorescence in situ protocol (see Table of Materials). Obtain probes for the genes of interest and buffers and solutions from the supplier. All incubation steps are performed at RT, if not mentioned otherwise. Use sterile PBS. If interested in staining several SG in one well, use at least 150 μL of buffers and solutions.\nPerform dissection of the SG as described in steps 1.1-1.13.\nFixate SG for 1 h in 200 μL of 4% MeOH-free PFA/PBS in one well of a 96-well plate placed on an orbital shaker.\nWash SG three times for 30 min each in 0.1% Tween-20/PBS on an orbital shaker.\nDehydrate SG in MeOH/PBS series by subsequent incubation in 50% MeOH/PBS, 70% MeOH/PBS, and 100% MeOH for 10 min each on an orbital shaker.\nStore SG at -20 °C in 100% MeOH overnight.\nThe next day, pre-warm the incubator to 40 °C. Check the temperature with a thermometer.\nRehydrate SG in reverse MeOH/PBS series (100% MeOH, 70% MeOH/PBS, 50% MeOH/PBS) for 10 min each.\nWash SG three times for 5 min each in PBS.\nIn the meantime, start pre-warming the probes by incubation at 40 °C for 10 min, followed by cooling for 10 min.\nIncubate SG in 200 μL of Protease III for 15 min.\nOptional: Perform Sudan black treatment to quench autofluorescence according to sections 2.3, 2.4, and 2.8 of this protocol if subsequent immunofluorescence staining is planned.\nWash SG in 200 μL of 0.1% Tween-20/PBS 3x for 5 min each on an orbital shaker.\nOptional: If co-staining with several probes is desired, dilute Channel-2 (50x) and Channel-3 probe (50x) in Channel-1 probe (1x).",
    "Cover SG with 100 μL of probe for the gene of interest and incubate overnight at 40 °C with slight agitation. Place the 96-well plate in a wet chamber at 40 °C for all incubation steps.\n\tNOTE: Include one SG as negative control, using a probe against a bacterial gene (e.g., dihydro-dipicolinate reductase, Dapb) to check for non-specific binding of amplification reagents in later steps.\nWash SG in supplied washing buffer 3x for 15 min each on an orbital shaker.\nPre-warm Amp1-3, HRP-C1, and HRP-Blocker to RT. If co-staining with Channel-2 and/or Channel-2 probe is desired, pre-warm HRP-C2 and HRP-C3.\nRe-fix SG for 10 min at RT in 4% PFA/PBS on an orbital shaker.\nWash SG in 200 μL of supplied washing buffer 3x for 5 min each on an orbital shaker at RT.\nFor amplification, incubate SG with 100 μL of Amp1 for 35 min at 40 °C on an orbital shaker.\nCarefully remove any liquid and wash SG in 200 μL of supplied washing buffer 3x for 5 min each at RT on an orbital shaker.\nIncubate SG with 100 μL of Amp2 for 35 min at 40 °C on an orbital shaker.\nRepeat step 3.18.\nIncubate SG with 100 μL of Amp3 for 20 min at 40 °C on an orbital shaker.\nRepeat step 3.18.\nIncubate SG with 100 μL of supplied Multiplex FL v2 HRP-C1 for 20 min at 40 °C on an orbital shaker.\nRepeat step 3.18.\nPrepare Opal-conjugated secondary antibody 1:1,000 in 200 μL of supplied TSA-buffer and incubate SG for 35 min at 40 °C on an orbital shaker. Protect from light during incubation and from this step on.\nRepeat step 3.18.\nIncubate SG in 100 μL of supplied Multiplex FL v2 HRP-blocker for 15 min at 40 °C on an orbital shaker.",
    "Repeat step 3.18.\nOptional: For co-staining with Channel-2 probe, repeat steps 3.25-3.30 with supplied Multiplex FL v2 HRP-C2.\nOptional: For co-staining with Channel-3 probe, repeat steps 3.25-3.30 with supplied Multiplex FL v2 HRP-C3.\nIn case of subsequent immunofluorescent staining, perform steps 2.13-2.25 of this protocol.\nIncubate in 1% BSA/PBS for 30 min on an orbital shaker.\nIncubate SG for 30 min in 1 μg/mL of bisbenzimide H33342 trihydrochloride (Hoechst staining) in 1% BSA/PBS if nuclear staining is desired and/or add Alexa-coupled wheat germ agglutinin (WGA, 1:500) on an orbital shaker.\nRepeat step 3.18.\nEmbed as described in steps 2.19-2.22.\n4. Imaging and analyses of murine stellate ganglia\nPerform confocal microscopy of embedded SG in the local imaging facility.\nIf cell size measurements are required, image SG stained for tyrosine hydroxylase (see Table of Materials) at 200x magnification and take 4-6 random images from every SG.\nAnalyze images using ImageJ33 software to estimate cell size (e.g., with a pen table, see Table of Materials). Use Free Hand Selection, circle each cell and click on Analyze | Measure to obtain cell area. Be careful to include only intact, fully visible cells that are located well within the SG.\nUsing this method, perform measurement of approximately 100 cells per SG.\nHave a blinded investigator perform steps 4.2-4.3 if you want to compare SG from different mice. Use a frequency distribution in statistical software to visualize size differences between groups34.\n5. Molecular analyses of murine stellate ganglia\nNOTE: Include controls depending on your experimental design. This could be SG with different genotypes and disease background and/or other autonomic ganglia, such as the sympathetic superior cervical ganglion (located in the neck area, see detailed description in Ziegler et al.35) or parasympathetic ganglia (such as intracardiac ganglia, see Jungen et al.4).",
    "Prepare a 2 mL tube with 500 μL of phenol/guanidine thiocyanate solution (e.g., Qiazol) per animal and have liquid nitrogen ready for shock-frosting or consider commercial solutions for protection of RNA (optional, see Table of Materials)36. Work quickly for RNA isolation.\nPerform dissection of the SG as described in steps 1.1-1.13.\nImmediately immerse both SG directly in one tube with phenol/guanidine thiocyanate solution and shock-frost tube in liquid nitrogen.\nStore at -80 °C until further processing.\nFor tissue lysis, let tubes with SG thaw until phenol/guanidine thiocyanate solution is liquified and add two 7 mm stainless steel beads. Cool down the metal parts of tissue homogenizer (ball or mixer mill, e.g., Tissue Lyser II) on dry ice and centrifuge at 4 °C.\nCentrifuge tubes at 500 x g for 1 min at 4 °C so that SG are at the bottom of the tube.\nPut tubes into the metal parts of the Tissue Lyser and lyse for 1 min at 20 Hz.\nRepeat steps 5.6 and 5.7 up to 5 times until no intact tissue is detectable.\nTransfer the liquid into a fresh 1.5 mL tube.\nPerform RNA isolation with a column-based RNA isolation kit (e.g., miRNeasy mini kit) according to the manufacturer's instructions.\nElute RNA in 20 μL of RNase-free water and measure concentration using a spectrophotometer.\n\tNOTE: To exclude contamination of the purified RNA with genomic DNA, we propose performing a polymerase chain reaction with genomic primers and 1 μL of RNA as template, instead minus reverse transcriptase control. This will save a significant amount of RNA. If RNA is contaminated, use exon-intron boundary primers or intron flanking primers for subsequent quantitative real-time polymerase chain reaction.",
    "Use 250 ng SG RNA to perform cDNA synthesis and use established protocols. Here, a high-capacity cDNA reverse transcription kit was used according to the manufacturer's instructions.\nDilute to a final concentration of 2.5 ng/μL of cDNA and perform quantitative real-time polymerase chain reaction with the appropriate probes according to the established protocols. Here, TaqMan Assay (see Table of Materials) was performed using 10 ng cDNA per reaction.\n\tNOTE: Perform no-template control for every gene to exclude false positive results.\nNormalize gene expression of your gene of interest on a house keeping gene (e.g., Cdkn1b) to compare relative gene expression between different groups of SG.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}