{
  "id": 18462,
  "origin_website": "Jove",
  "title": "The Monoiodoacetate Model of Osteoarthritis Pain in the Mouse",
  "procedures": [
    "Procedures involving animal subjects have been approved by the Ethical Committee at King's College London and are in accordance with UK Home Office Regulations (Animals Scientific Procedures Act 1986).\n1. Intra-articular Injection of Monoiodoacetate in the Knee\nHouse 8 - 10 week-old mice in groups of 5 under a 12 hr light/dark cycle (lights on at 7:00 AM) with food and water ad libitum. Let the mice acclimatize for 1 week prior to starting the experiment.\nRandomize and cage mice in groups of 5. Use animal numbers as codes to blind the experimenter to treatments. Use body weights as parameters for randomization.\nOn the day of injection, freshly prepare the solution of monoiodoacetate in sterile saline (0.9% NaCl) at the desired concentrations. Use sterile saline for injections in a separate group of control mice. The highest recommend dose of MIA is 1 mg in 10 µl.\n\tCaution: Monoiodoacetate is very toxic. Therefore, it is recommended that gloves and mask are worn when handling the powder and preparing the solution. The solution should be sterile filtered with a 0.22 μm filter. \nAnesthetize mice using an anesthetic trolley by first placing them in a chamber delivering 2% isoflurane in O2 mixture (flow rate 1.5 L/min) and then transfer mice to the nose cone section, which also delivers the 2% isoflurane-O2 mixture, and as such, maintains anesthesia during injection. Place vet ointment on the eyes to avoid their drying out while under anesthesia. Wear surgical gown, gloves, and mask while performing injection procedure.\nConfirm anesthesia by checking the animal's lack of response to a pinch stimulus on the hind paws.",
    "Once the animal is under anesthesia, place it on its back. Trim and wipe the area surrounding the knee joint with alcohol. Povidone iodine or chlorhexidine can be used as well for disinfection. The patellar tendon (white line bellow the patella) will become visible.\nIn order to stabilize the injection site, keep the knee still, in a bent position, by placing the index finger beneath the knee joint and the thumb above the anterior surface of the ankle joint. Joint preference is not required.\nTo find the precise site of injection, run a 26 G needle attached to a syringe horizontally along the knee (so as not to pierce the skin with the tip) until it finds the gap beneath the patella. Apply gentle pressure to mark the area and then lift the needle and syringe vertically for the injection. Insert the needle in the marked area, through the patellar tendon, perpendicular to the tibia. No resistance should be felt.\n\t\nUse thumb as a guide and inject superficial to the site of entry. After injection, massage the knee to ensure even distribution of the solution. Discard the needle immediately in the sharps bin.\nPlace mice back into a clean home cage on a heated mat and allow them to recover. Keep constant vigilance on the animals until they regain suitable consciousness, which is measured by them regaining sternal recumbency. Once animals are recovered, return to their cage.\n\t\tNote: It is suggested for best practice and training purposes that a dye is used and immediate post-mortem dissection performed to confirm correct localization of injection.\n2. Measurement of Mechanical Hypersensitivity (Allodynia)\nNote: Static mechanical withdrawal thresholds are assessed by applying von Frey hairs to the plantar surface of the hind paw.",
    "Bring mice to the behavioral room and let unrestrained animals acclimatize in acrylic cubicles (8 cm x 5 cm x 10 cm) atop a wire mesh grid.\n\t\nTrain mice by handling and 2 hr habituation to the cubicles for two days prior to von Frey hair application in order to limit stress and ambulation during application of von Frey hairs. On test days, habituate animals to the cubicles for up to 60 min prior to testing. Wear gowns, gloves, and masks during all behavioral experiments.\nApply calibrated von Frey hairs (flexible nylon fibers of increasing diameter that exert defined levels of force as calibrated by the manufacturing company and expressed as grams (g)) to the plantar surface of the hind paw until the fiber bends. Use 0.008, 0.02, 0.04, 0.07, 0.16, 0.4, 0.6, and 1.0 g fibers during testing.\n\t\nHold each hair in place for 3 sec or until the paw is withdrawn, the latter defining a positive response. Starting with a stimulus strength of 0.07 g, apply hairs according to the \"up-down method\"21: mark as X a withdrawal response and O an absence of response. Apply in ascending order of force, up to 1 g (cut-off force), until a response is detected.\nRe-test the paw by repeating step 2.2.1, starting with the filament that exerts a force below the one that produced a withdrawal.\nThen, apply the remaining filaments sequentially, by descending force, until no withdrawal occurs. Re-apply filaments in ascending order until a response is observed. Continue until a sequence of six responses is obtained (e.g., OXOXOX), in order to obtain the 'k' value by referring to tabular values 21.",
    "Express paw withdrawal values as 50% paw withdrawal thresholds in grams. Use the formula (10[Xr + Kδ])/10,000 where Xr = value of last von Frey filament used in the sequence (in log units), k = tabular value, and δ = mean difference in forces between fibers. Where no response is detected, use the maximal response of 1 g 21,22.\nFollowing the procedure described above (2.2.1-2.2.4), assess mechanical thresholds of both hind paws before MIA injection as baseline values. After injection, assess thresholds of the ipsilateral and contralateral paws at regular day intervals for several weeks after MIA to ascertain the development of mechanical allodynia.\n\tNote: For example, we report thresholds measured 0, 3, 5, 7, 10, 14, 21, and 28 days after MIA injection. Animals are considered allodynic when they display a response to 0.1 g or less. Normal responses fall within 0.6 - 1 g range.\n3. Measurement of Weight Bearing Deficit\nNote: Changes in weight bearing are measured using a weight incapacitance tester.\nTrain each mouse to walk into a Plexiglass chamber on the apparatus and sit in the holding box. Place the mouse in front of the holding box, lift the entrance up 45°, and allow the mouse to walk in and close the box. Allow the animals to move freely until they adopt a sitting posture. This training takes at least two days and guarantees that the animal is still and not leaning on either side of the chamber. Calibrate the instrument before use with a 100 g check weight (or according to equipment instruction).\n\t\nMake sure that each hind paw is placed on the appropriate recording pad 11. The duration of each measurement takes 1 sec, as per the manufacturer's instructions.",
    "Collect three measurements of the weight borne on each hind paw from the recording pad for each recording session and use the mean value to calculate the difference in weight borne by ipsilateral and contralateral paws. Express values as the difference between contralateral and ipsilateral paws in grams.\nAssess weight bearing changes before MIA injection as baseline values. Then, repeat assessments at regular intervals over several weeks to ascertain the development of gate changes. For example, we report thresholds measured on 0, 3, 5, 7, 10, 14, 21, and 28 days after MIA injection.\n\tNote: A normal weight bearing value of 50% represents an equal weight distribution across ipsilateral and contralateral hindlimb. Animals considered hypersensitive display a weight bearing change of approximately 45%. Measurements of mechanical thresholds and weight bearing deficits can be performed in the same mice, as neither end point affects the other. For pharmacological assessment, each group of animals should be tested at set times after dosing in line with the pharmacokinetic profile of the compound used."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}