{
  "id": 15254,
  "origin_website": "Jove",
  "title": "Canalostomy As a Surgical Approach to Local Drug Delivery into the Inner Ears of Adult and Neonatal Mice",
  "procedures": [
    "All procedures and animal surgeries were conducted according to the guidelines of the Animal Care and Use Committee of the Capital Medical University of China.\n1. Device Preparations\nTo make the injection cannula (Figure 1A), connect polyimide tubing (inner diameter 114.3 µm, outer diameter 139.7 µm, length ~3 cm) to polyethylene tubing (inner diameter 280 µm, outer diameter 640 µm, length ~40 cm). Using superglue, seal the connection with at least three applications. Sterilize the injection cannula with ethylene oxide.\n\tNOTE: When sealing the tubing, prevent the superglue from entering the polyimide tubing, which can result in a blockage of the cannula. Seal the tubing at least three times, because gas sterilization may cause leakage at the connection.\nUsing a 30 G needle, connect the end of the polyethylene tubing to a 1 cc syringe containing normal saline. Fill the cannula with normal saline by injection with the 1-cc syringe to check for any leakage or blockage at the connection between the polyimide tubing and polyethylene tubing.\n\tNOTE: If there is a leakage or a blockage of the connection, the cannula cannot be used in the following procedures.\nEvacuate a 10 µL micro-syringe with normal saline and connect it to the aforementioned 30 G needle with the injection cannula. Install the micro-syringe on a microinjection pump (Figure 1B). Set the injection speed to 0.5 µL/min and the volume to 1 µL for fast-green dye and AAV8-GFP, or 2 µL for streptomycin.\n\tNOTE: The recommended range of injection speed is 0.1−0.5 µL/min, and the recommended range of injection volume is 0.5−2 µL.\nPull back the micro-syringe to 1 µL and extract the injection reagent. An air gap will form between the normal saline and the injected reagent (Figure 1C).",
    "Optionally label the position of the gas-fluid border on the polyethylene tubing using a marker pen. This can be used to monitor reagent flow during injection.\n2. Canalostomy in Adult Mice\nAnesthetize an adult mouse (female, FVB/N, 5 to 6-week old) by intraperitoneal injection of ketamine HCl (120 mg/kg) and xylazine HCl (7 mg/kg). Wait for 5−10 min until the animal exhibits no response to painful stimuli (the toe-pinch reflex). Place the animal on a preheated electric pad after anesthesia. An analgesic, Meloxicam (1 mg/kg), was applied subcutaneously before surgery.\nCover the animal's eyes with eye ointment. Shave the left post-auricular region with an electric animal clipper and disinfect the skin three times with 75% ethanol.\nPlace the animal on a preheated electric pad. Set the temperature of the electric pad to ~37°C. Place the animal in the right lateral position to facilitate surgery on the left ear.\nMake a 1-1.5-cm post-auricular incision ~3 mm from the left retroauricular groove (Figure 2A).\nPositioning the posterior semicircular canal (PSC) and lateral semicircular canal (LSC): When the root of the pinna (bold dot in Figure 2B) is defined as the origin and the plane parallel to the calvarium as 3 to 9 o'clock, the PSC and the LSC are typically located ~3 mm from the root of the pinna between 2 and 3 o'clock (Figure 2B).",
    "Bluntly dissect the muscle covering the temporal bone with micro-forceps to expose the PSC and LSC, whose margins are clearly visible as dark stripes in the temporal bone (Figure 2C). The LSC is at an approximately 30° angle from the plane parallel to the calvarium, and the PSC is vertical to the LSC (Figure 2C). Collect a small piece of muscle with micro-forceps and let it dry. In the following step, this muscle will be used to seal the hole.\n\tNOTE: Avoid excessive tearing of the tissues to minimize injury to muscles. Avoid damaging the adjacent vessel when exposing the PSC (Figure 2D).\nMake a small hole in the middle portion of the PSC using a 26 G needle (Figure 2D). Fluid leakage through the hole indicates successful penetration of the bony wall of the PSC. Enlarge the hole to an appropriate size, slightly larger than the diameter of the polyimide tubing.\n\tNOTE: Drill and enlarge the hole gently and gradually to avoid fracture of the PSC.\nClean the effusion surrounding the hole of the PSC using a cotton pellet.\nInsert the tip of the polyimide tubing gently into the PSC toward the crus commune to a depth of 1−2 mm (Figure 2E). Start the injection by pressing the 'run' button on the pump.\nAfter the injection, wait ~2 min to allow the reagent to spread. Trim the small piece of muscle collected in step 2.6 with micro-scissors. Next, remove the injection cannula and immediately place the muscle into the hole in the PSC.\n\tNOTE: Check for any liquid leaking from the hole after plugging to ensure that the hole is completely sealed.\nReturn the separated muscles and subcutaneous tissues. Suture the incision using a 5-0 suture. Disinfect the incision region with povidone iodine.",
    "NOTE: All the above surgical procedures take about 25 min.\nPosition the animal on an electric pad preheated to ~37 °C. Place the animal in the right lateral position for recovery.\nPerform auditory brainstem response (ABR) measurements and swimming tests one week after the surgery18.\nIf required, perform repeated injections in a different area of the PSC or LSC.\n3. Canalostomy in Neonatal Mice\nUse hypothermia to induce and maintain sedation in neonatal mice (FVB/N) at postnatal days 1 to 2 (P1-2). Place the pup on a plastic-wrap-covered bed of crushed ice for ~4 min. Next, lay the pup on an ice-filled platform. Disinfect the surgical field three times with 75% ethanol.\n\tNOTE: Ensure that the head of the pup is out of the ice. Perform the entire surgery with the pup on an ice-filled platform.\nThe following steps differ in the neonate compared to the adult mice.\n\t\nMake a ~3-mm postauricular incision from ~2 mm posterior to the auricular crease (Figure 3A - B).\nGently make an opening in the soft PSC using a 26 G needle. Insert the cannula into the PSC without enlarging the opening (Figure 3C - E).\nAfter injection, use a piece of muscle to cover, rather than plug, the opening as the latter can lead to a fracture of the soft PSC (Figure 3F).\nClose the skin using a 6-0 suture.\nPerform ABR measurements and swimming tests at P3030.\nParental cannibalism is a common problem after neonatal surgery. The following steps reduce the likelihood of parental cannibalism.\n\t\nClean up the blood surrounding the incision with alcohol wipes after surgery.\nEnsure that the neonate can move freely before returning it to the dam.\nSmear neonates with soiled bedding from the mother's cage, and place the neonates back in the middle of the litter.",
    "Any that do not undergo surgery should receive a similar postauricular incision and suture.\nSeparate the male from the breeding cage.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}