{
  "id": 8795,
  "origin_website": "Jove",
  "title": "Neurovascular Network Explorer 2.0: A Simple Tool for Exploring and Sharing a Database of Optogenetically-evoked Vasomotion in Mouse Cortex In Vivo",
  "procedures": [
    "1. Installation of NNE 2.0\nGo to UCSD Neurovascular Imaging Laboratory website1 and left-click at ‘NNE 2.0 HDbase v1.0’ to download the zipped program files to the desired location on your PC.\n\tNOTE: NNE 2.0 requires a Windows-operating system of versions 7-10, at least 2.8 GB of free space to download the zipped file and 6.9 GB to install the program.\nUnzip ‘NNE2_HDbase_v1.0.zip’.\n\tNOTE: The unzipped folder NNE2 contains 10 files: ‘hana_refs.tar.gz’, ‘hana_stk.tar.gz’, ‘maps.tgz’, ‘MCRInstaller.exe’, ‘NNE2.exe’, ’NNE2.zip’,  ‘NNE2_README.txt’, ’source.zip’, ’users_guide.pdf’ and ‘vdb.mat’.\nInstall NNE 2.0 by following instructions in ‘NNE2_README.txt’.\n2. Running NNE 2.0\nStart the NNE 2.0 with 'NNE2.exe'.\nPanel 1 (Main Panel): Select a subset of data (Figure 1). Images in the left column of the Main Panel show graphs of time-courses and parameters of all entries to the 'vdb.mat' (Figure 1).\n\t\nSelect the range for Cortical Depth in the right column of the panel. Type in the range of depth in the format [dmin dmax], where dmin is the minimum depth and dmax is the maximum depth.\n\t\tNOTE: The data was measured at depth from 30-560 µm.\nSelect Branching Order in the right column of the panel. Left-click on the arrow and choose one of the options from the list (Surface | Diving Trunk | First Order Branches | Higher Order Branches).\nSelect the range of Baseline Diameter in the right column of the panel. Type it in the format [diamin diamax], where diamin is the minimum diameter and diamax is the maximum diameter.\nSelect subjects (animals according to the date of acquisition) in the right column of the panel. Left-click on the arrow and choose from the available options. Alternatively, choose data from all subjects by left-clicking All in the blue rectangle.\nPress SUBMIT to display and explore the selected data in Panel 2.",
    "Panel 2: Explore the selected subset of data and continue further data refinement (Figure 2).\n\t\nSelect the type for group-averaging of the data by left-clicking the appropriate button in the right column on the top. Select: Avg By Cortical Depth or Avg By Branching Order.\n\t\tNOTE: The actual choice is highlighted in green below (Figure 2).\nSelect data based on vessel morphology or subject. Left-click Select all data for tree (a single diving arteriole and its branches) or Select all data for Subj (animal subject).\nLeft-click Submit to display selected data on the left in graphs of (1) individual time-courses (2) group-averaged time-courses and scatter plots of (3) onset times (4) time-to-peaks (5) peak amplitudes and (6) baseline diameters\nLeft-click on a trace in the graph of Individual timecourses in the left column to select a time-course.\n\t\tNOTE: The selected time-course gets highlighted in the graph (magenta) and its onset time, time-to-peak, peak amplitude and baseline diameter will be marked by red circles in the graphs below. Red points in the scatter plots are average values.\nNote the identifiers of the subject (Subject ID) and tree (Tree ID) for the selected time-course in the right column at the bottom.\nIf desired, change the type of group-averaging by left-clicking the appropriate choice on the top of the right column followed by the Submit button and repeat steps from 2.3.4.\nRight-click anywhere in Panel 2 with a cross cursor to view and explore all traces for the selected subject (Subject ID) or tree (Tree ID) in Panel 3.\nPanel 3: Explore the final subset of data and export them (Figure 3).",
    "Select a time-course in the top graph of the left column by left-clicking on a trace: the selected trace will be highlighted in the graph (magenta) and descriptive parameters of the database entry will be displayed on top of the graph.\n\t\tNOTE: The average time-course is displayed in thick black (Figure 3).\nNote corresponding onset time, time-to-peak, peak amplitude and baseline diameter in the graphs below.\nLeft-click the EXPORT SET button in the right column to save traces displayed in the top graph into the folder where NNE 2.0 is running from.\n\t\tNOTE: This action saves three files: 'vdb_subset.xls', 'vdb_subset.csv' and 'vdb_subset.mat' containing vectors of diameter change and time vectors; 'vdb_subset.mat' contains also descriptive parameters and information from 'vdb.mat'.\nTo inspect all data for 'subject' instead of 'tree' close Panel 3 by pressing [x], restart NNE 2.0, repeat the selection of categories in Panel 1 (steps 2.2.1-2.2.5) and select all data for subject in Panel 2 (step 2.3.2).\nRight click anywhere in Panel 3 with a cross cursor to go to Panel 4 to explore reference images and 3D stacks for all traces in the top graph of Panel 3.\n\t\tNOTE: Panel 4 will open if option all data for 'tree' was selected in Panel 2. If all data for 'subject' were selected instead, the user will be prompted to change his selection and directed to Panel 1.\nPanel 4: Localize the functional measurement within a reference image and within a 3D image stack of vasculature (Figure 4).\n\t\nSelect a time-course by left-clicking on it in the graph on top of the left column.\n\t\tNOTE: The selected trace will be highlighted in the graph (magenta) and its descriptive information from metadata will be displayed on top.",
    "Explore the corresponding reference image which is loaded automatically from 'hana_refs' folder at the bottom right of the left column.\nExplore the corresponding 3D image stack loaded automatically from 'hana_stk' folder at the bottom left of the left column. Scroll through stack using the arrows or slider below the figure.\n\t\tNOTE: When the stack image reaches the level of the reference image – i.e. the diameter measurement level ('Stack index' = 'Ref'), the stack image is highlighted and indicated as 'Frame level'.\nClick EXPORT SET in the right column to export the highlighted time-course into a file 'ref_stacks_trace.xls' which is saved to the folder where NNE 2.0 is running from.\n\t\tNOTE: The file contains the time vector, diameter change vector, subject ID, entry index, location of reference image, location of 3D stack and the stack image number for the frame level.\nClose Panel 4 by [x] to go back to Panel 1.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}