{
  "id": 5955,
  "origin_website": "Bio",
  "title": "FRET-based Stoichiometry Measurements of Protein Complexes <em>in vitro</em>",
  "procedures": [
    "Fluorescence labeling of the histone-binding proteinIn a minimum reaction volume of 400 µl, mix 10 µM of histone-binding protein with 10 µM of Atto647N maleimide dye, in PD-10 buffer. Rotate gently at 4 °C for 1 h. Protect the reaction from light. Quench the reaction with a final concentration of 10 mM DTT (see Recipes). Dilute the sample to 2 ml and apply it to a PD-10 column. Elute with 3.5 ml of PD-10 buffer (see Recipes). This step removes unconjugated dye from the solution.Concentrate the labeled protein to ~20 µM using Amicon Ultra (spinning at 3,500 x g at 4 °C) and store at 4 °C. Use within 2 days and freshly label a new aliquot for subsequent repeats of the assay. Protein function should always be validated after labeling with fluorescence dyes. This includes confirming that the labeled protein still binds to its partner with the same affinity.Assay designReactions are set up in duplicateEach well contains a 40 µl reaction.Always include unlabeled controls as specified in Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180131/20180131003922_8753.jpgFigure 1. Experimental setup. See also Supplemental file 1[href=https://os.bio-protocol.org/attached/file/20180122/Supplemental file 1 jobplot setup worksheet.xlsx].Supplementary file 1[href=https://os.bio-protocol.org/attached/file/20180122/Supplemental file 1 jobplot setup worksheet.xlsx] contains the worksheet for sample preparation. The total protein concentration in each well should remain constant, and should be at least 10 times higher than the binding constant (Kd) of the interaction between the two components. The relative molar ratio between the two components varies continuously.In the example in Supplementary file 1[href=https://os.bio-protocol.org/attached/file/20180122/Supplemental file 1 jobplot setup worksheet.xlsx]: the Kd is ~1 nM, hence we keep the total protein concentration in each tube at 150 nM.This means that in column 2, we have 150 nM Protein1 (i.e., Histone-binding protein), and in column 14 we have 150 nM Protein2 (i.e., H3-H4), while in column 8 we have 75 nM Protein1 (i.e.",
    ", Histone-binding protein) and 75 nM Protein2 (i.e., H3-H4).Assay preparationPrepare 1 µM stock of each protein, labeled and unlabeled.Use the worksheet attached to prepare the stock solutions. These are prepared at twice the protein concentration required in the well reactions.Final well reactions are prepared by mixing 20 µl of Protein1 solution with 20 µl of Protein2 solution, leading to the desired final protein concentration, as they are diluted two-fold in this step.Mix well by pipetting, but avoid forming bubbles.Spin down the plate at 100 x g (RCF: relative centrifugal force) for 1 min.Data collectionThe fluorescence intensity is measured in a CLARIOstar machine (BMG labtech) using the following settings:Measure acceptor fluorescence: Excitation wavelength-bandwidth: 625-30 nm; Emission wavelength-bandwidth: 680-30 nm; Dichroic: automatic;Gain settings for this channel are adjusted automatically using the sample in wells B2, with highest acceptor dye concentration and no donor dye present. Measure FRET: Excitation wavelength-bandwidth: 488-15 nm; Emission wavelength-bandwidth: 680-30 nm; Dichroic: automatic;Gain settings for this channel are not adjusted at first, when an average value is used to gauge the region of highest FRET. Further measurements are repeated at different gain settings to confirm the sample with highest FRET and then this sample (in our example well C8) is used for the final automatic adjustment and measurement.Measure donor fluorescence: Excitation wavelength-bandwidth: 488-15 nm; Emission wavelength-bandwidth: 535-30 nm; Dichroic: automatic;Gain settings for this channel are adjusted automatically using the sample in wells A14, with highest donor dye concentration and no acceptor dye present. The plate-reader software will output the raw data in Excel format."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}