{
  "id": 6155,
  "origin_website": "Bio",
  "title": "An Optimized CTAB Method for Genomic DNA Extraction from Freshly-picked Pinnae of Fern, <em>Adiantum capillus-veneris</em> L.",
  "procedures": [
    "Sample PreparationHere, we describe two methods for sample preparation: One is liquid nitrogen method, and the other is steel beads method. Both of them require the pinnae from plants growing under a proper condition. Moreover, the amount of sample is also a critical factor. The steel beads method is suitable for high-throughput gDNA extraction.Notes: The condition of pinnae is critical for gDNA yield rate. Pinnae from a plant growing under suitable environment are required for this method (temperature: 25 °C, humidity: 65 %, 16-h white light and 8-h dark treatment; The soil condition is not a critical factor in this protocol. For reference, we usually mix nutrient soil with vermiculite (about 10:1) as the culture medium. Avoid using too much sample for gDNA isolation. The amount of sample is critical for the performance. For 500 μl CTAB solution, 10-20 mg pinnae is the suggested mass. Figure 1 provides a reference size of pinnae in different phases. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180701/20180701230901_6689.jpgFigure 1. Different phases of Ac pinnae to show available samples for gDNA extraction. A-B. Juvenile pinnae; C-D. Pinnae with green and premature sporangia; E-F. Pinnae with brown and mature sporangia; G. Pinna with dehiscent sporangia. Liquid nitrogen method Cool stainless steel spoon, mortar and pestle in liquid nitrogen. Harvest 2-3 freshly picked pinnae (total wet mass: 10-20 mg) and grind in liquid nitrogen to fine powder using the thoroughly cooled mortar and pestle. And then transfer the powder into a tube.Note: All equipment should be fully cooled in liquid nitrogen during this procedure. Be careful not to let the liquid nitrogen dry while grinding, and the grinded tissue must remain frozen prior to extraction with CTAB solution. Accidental thawing may result in DNA degradation. Add 500 μl 2% CTAB solution (see Recipes) to the tube.",
    "Mix by flicking the bottom of the tube until the sample is thoroughly suspended.Note: Make sure adding BME and PVP to the 2% CTAB solution and the final concentration is 2% BME and 0.2% PVP. Steel beads methodAdd 2-3 steel beads in a new clean tube. Add 500 μl 2% CTAB solution (see Recipes) to the tube.Note: Make sure adding BME and PVP to the 2% CTAB solution and the final concentration is 2% BME and 0.2% PVP.Harvest 2-3 freshly picked pinnae (total mass: 10-20 mg) and transfer into the tube. Grind the material with the tissue grinder at room temperature (25.0 hz, 5 min).Briefly centrifuge for 3-5 sec to avoid the samples sticking to the lid of the tube. Let stand in a 65 °C water bath for 10 min to soften the tissue and make it easier to break. Cool them at room temperature for about 2 min.Grind the material again with the tissue grinder (25.0 hz, 10 min). See if the pinnae are fully grinded. If so, then continue with the following steps. If not, repeat Steps 3 and 4. The sample before and after grinding is shown in Figure 2.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180701/20180701232807_4927.pngFigure 2. The material before the grinding process (Before) and the fully grinded material (After)  DNA extractionBriefly centrifuge the CTAB treated samples for 3-5 sec. Incubate in a 65 °C water bath for 1 h. Mix by inverting the tube for 3-4 times during incubation in the water bath. Take out the samples and cool at room temperature for 1 min.Note: The samples can be cooled on ice or at RT. You can do the cooling step while preparing the reagents and materials and there is no need to get ice for this step.Add 500 μl phenol:chloroform:isoamyl alcohol (25:24:1) to the tube. Shake vigorously to mix thoroughly.",
    "Centrifuge the samples at 12,000 x g for 15 min.Transfer the supernatant to a new clean tube with pipettes. Be careful not to transfer the white protein in the middle layer.Add to the aqueous phase an equal volume of chloroform. Mix by shaking and inverting. Centrifuge the sample at 12,000 x g for 15 min.Transfer the supernatant to a new clean tube with pipettes. Be careful not to transfer the white protein in the middle layer. Add to the aqueous phase an equal volume of isopropyl alcohol. Mix by gently inverting the tube and let it stand at -20 °C for at least 1 h. Centrifuge the sample at 12,000 x g for 15 min.Decant the supernatant and be careful not to lose the pellet.Note: Pellet may be difficult to see. Add 700 μl 75% ethanol to the tube. Centrifuge the sample at 12,000 x g for 5 min. Decant the supernatant carefully. Briefly centrifuge for 3-5 sec to collect the residual liquid and remove it with a pipette. Open the lid of the tube, lay it down horizontally and let stand overnight to air-dry the pellet.Add 30 μl ultrapure water or TE to the tube and let it stand for 10 min to dissolve the gDNA sample. Note: Dissolve the sample in ultrapure water for subsequent DNA sequencing. For long long-term storage, dissolve the sample in 30 μl TE. Add 1 μl 10% RNaseI to the tube and incubate at 37 °C for 1 h.Store gDNA sample at -20 °C."
  ],
  "subjectAreas": [
    "Plant Science",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}