{
  "id": 13223,
  "origin_website": "Jove",
  "title": "High-Frequency Ultrasound Echocardiography to Assess Zebrafish Cardiac Function",
  "procedures": [
    "All procedures involving zebrafish were approved by our Institutional Animal Care and Use Committee and are in compliance with the USDA Animal Welfare Act.\n1. Experimental set-up\nSetting up the platform for image acquisition\nUsing small scissors or a scalpel make an incision on a sponge at the 12 o'clock position to hold the fish during scanning. Place the sponge in a glass container (Figure 2A).\n\t\tNOTE: The position of the incision should allow enough room to move transducer and also to keep the fish bellow the water line when the platform is tilted for scanning (Figure 2). The incision can vary depending on the size of the fish; however, for a standard size and weight, the incision should be approximately 2.5 cm x 0.7 cm x 0.5 cm (length, width, and depth, respectively). The glass container should be at least 6 cm deep to avoid water leakage while imaging the fish.\nAffix the glass box containing the sponge on the ultrasound platform, for instance using double-sided tape. Ensure the glass box is at the center of the platform and firmly attached (Figure 2B).\nTilt the platform forward about 30° using the knob on the left side of the platform holder (Figure 2B). Fill the glass square with 200-250 mL of fish system water containing 0.2 mg/mL tricaine methanesulfonate (MS222).\n\t\tNOTE: Tricaine can be prepared as a 4 mg/mL stock solution in Tris 40 mM pH 7 and further diluted to the desired concentration in fish system water; 0.2 mg/mL was found to be the best concentration16. The 4 mg/mL tricaine stock solution can be stored for a long period of time at -20 °C or at 4 °C for one month.",
    "Insert the transducer within the micromanipulator holder on the working rail station, turning the notch of the transducer towards the operator. Keep the array parallel to the ground with the working side longitudinal with respect to the stage (see Figure 2B). Leave enough room (10 cm on both sides) for the now connected transducer-rail system to move along the x- and y-axes.\nLog in to the control software and choose Mouse (Small) Vascular. Create a new study as well as a new series for each animal included in the study. Find the new study button located on the bottom left side of the screen on the browser page (the view starts in B-mode).\n2. Handling the Fish\nNOTE: Zebrafish used in this study were adult, 11-month-old males of the wild-type strain AB/Tuebingen (AB/TU). Zebrafish were maintained in a stand-alone flow-through aquarium system at 28 °C in a constant light cycle set as 14 h light/10 h dark. Zebrafish were fed twice daily with brine shrimp (Artemia nauplii) and dry food flakes.\nUsing a fish net, transfer the fish into a small tank containing system water with 0.2 mg/mL tricaine. Wait until the fish is fully anesthetized (no movement and no response to touch).\nUsing a plastic teaspoon, gently and quickly transfer the fish into the glass box containing the sponge into the previously made incision with ventral side of the fish facing up.\n\tNOTE: Make sure the head of the fish is positioned towards the operator (same direction as the notch of the transducer) and at a slightly higher level compared to the rest of the body to achieve better heart visualization.",
    "Gently lower the transducer (keeping its original position) using the handle on the rail system, placing it longitudinally and close to the ventral side of the fish with the notch of the transducer facing the operator. Leave 2-3 mm (no more than 1 cm) clearance from the fish. Adjust the platform in respect to the transducer using the micromanipulator in all 3 axes until the fish heart is visualized and then start image acquisition. The angle of the transducer should not be changed during the entire image acquisition (Figure 2C).\n\tNOTE: As long as there is enough proximity (up to 1 cm), the water on top of the fish will provide a contact surface via liquid surface tension that allows transmission of the ultrasound waves between the probe and the fish. Therefore, there is no need to push the transducer against the fish. Try to complete this step and finish the scan in less than 3 minutes to prevent fish death or a decrease of the heart rate during image acquisition. If needed, use a timer. The heart can be found on the upper side of the screen towards the left side of the eye, which can be easily visualized if moving the x-axis all the way to the right. If there is continued difficulty in finding the heart while in B-Mode, switch to color Doppler mode, which will allow for tracking blood flow (red indicates blood flowing towards the operator) and locating the heart.\n3. Image acquisition\nNOTE: See Table of Materials for imaging system and image analysis software.\nLongitudinal View B-Mode",
    "After localizing the heart, select or stay in B-Mode (found at the bottom left side of the touchscreen after having initiated a new series) and reduce the field in order to zoom in and have a closer look at the heart for easier tracing during analysis.\nIn order to have a closer and clearer view of the heart in B-Mode image acquisition, reduce the field by zooming in. Use the touchscreen to manually narrow the field on both the x- and y-axes.\nIf needed, enhance the quality/contrast of the image by setting the dynamic range to 45-50 dB. Go to the B-mode controls in the More Controls option and subsequently save the change to Mode Presets. Tap Mode Presets to select the optimized image acquisition setting every time before starting to image a new series.\nTake as many images as desired in the long axis plane by selecting Save Image.\n\t\tNOTE: More detailed information and training resources on image acquisition can be found at https://www.visualsonics.com/product/software/vevo-lab[href=https://www.visualsonics.com/product/software/vevo-lab] and https://www.visualsonics.com/Learning-hub-online-video-training-our-users[href=https://www.visualsonics.com/Learning-hub-online-video-training-our-users]\nLongitudinal View Pulse Wave\nSwitch to Color Doppler for blood flow detection (select Color button) and acquisition (found at the bottom left side of the touchscreen after having initiated a new series).\nUsing the touch screen position the quadrant on top of the atrioventricular valve and localize the inflow, which will be distinguished by the red color signal (Figure 3A). Reduce the quadrant area as much as possible to increase the frame rate.\n\t\tNOTE: Lower the Color pulse-repetition-frequency (Color PRF) (velocity range) to ensure yellow color can be seen in the velocity profile of the Color Doppler image. This will increase the range of velocities that can be seen and will help to create a mosaic of color that will allow to visualize more clearly the peak velocities.",
    "Activate pulse wave (select PW) Doppler Mode to sample ventricular blood inflow velocity. Position the sample volume gate at the center of the atrioventricular valve (where the red color signal becomes more yellowish) to detect the maximum flow velocity. Adjust the PW angle on the screen using your fingers so it aligns with the direction of the blood inflow. Press start or update to start sampling the velocity of blood flowing into the ventricle.\n\t\tNOTE: Make sure the angle correct line is parallel to the blood flow in order to provide consistent and reproducible results. Placing the angle correct line so it matches the direction of blood flow will ensure that velocities are accurately captured.\nRepeat step 3.2.3 to determine the outflow velocity by placing the Color Doppler quadrant at the junction between the ventricle and the bulbus (bulbuventricular valve) and localize the flow, which will be distinguished by a blue color signal (Figure 3B). Position the sample volume gate right before the ventricle-bulbus junction and adjust the angle correction line to match the direction of the blood flow.\n\t\tNOTE: As mentioned before, to achieve accurate velocity values, make sure the PW angle is aligned with the blood flow.\nAdjust the baseline (bar), lowering or raising it in the flow velocity panel, in order to detect and trace completely the signal peaks (Figure 3C,D). Identify the inflow peaks in the upper/positive quadrant (signal going towards the probe) and the outflow peaks in the lower/negative quadrant (signal going away from the probe).\n4. Fish recovery\nAs soon as image acquisition is complete, using a teaspoon, transfer the fish into regular system aerated water free of tricaine and let the fish recover (usually takes 30 s to 2 min to resume gill movement and swimming).",
    "To help recovery, squirt water repeatedly over the gills using a transfer pipette to promote aeration of the water and oxygen transfer.\n5. Image analysis\nOpen the image analysis software.\nSelect an image and click on the image processing icon (Figure 4). Using the available scale (Figure 4), adjust brightness and contrast of the image to allow clear visualization of ventricular walls or blood flow pattern.\nUsing the B-mode image, open the drop-down list from the PSLAX (parasternal long axis) option on the cardiac package/measurements (Figure 4). Select LV trace and trace the ventricular inner wall at systole and diastole to obtain the ventricular area (VA) in systole (VAs) and diastole (VAd), end diastolic volume (EDV), and end systolic volume (ESV) (Figure 5A,B).\n\tNOTE: Volume values are extrapolated from 2D image tracings and might deviate from the 3D entity. For all measurements, average at least 3 representative cardiac cycles per animal.\nNote the stroke volume and ejection fraction that will be automatically calculated and displayed by the software.\n\tNOTE: Stroke volume, and ejection fraction can also be manually calculated using the formulas\n\tSV = EDV-ESV\n\tEF = (EDV-ESV)/EDV\n\twhere SV is stroke volume, EDV is end diastolic volume, ESV is end systolic volume, and EF is ejection fraction\nCalculate fractional area change using the formula\n\tFAC = (VAd - VAs)/ VAd\n\twhere FAC is fractional area change, VAd is ventricular area in diastole, and VAs is ventricular area in systole.\nCalculate the cardiac output using the formula\n\tCO = HR x SV\n\twhere CO is cardiac output, HR is heart rate, and SV is stroke volume",
    "Using the Pulsed Wave Doppler Mode image, measure the inflow blood velocity by selecting the MV Flow option under the cardiac package (Figure 4). Select E or A for early diastole and late diastole, respectively, and determine the peak-velocities on the graph (Figure 3C).\nMeasure the outflow blood velocity by selecting AoV Flow and determine the peaks on the tracing (Figure 3D).\nMeasure the heart rate using 2 different methodologies for a more reliable assessment:\n\t\nWhen the heart is visualized on the screen during image acquisition, count the beats within 10 s and multiply it by 6.\nUsing the Pulse Wave Doppler image on the Vevo LAB software, choose the heart rate button and trace intervals between 3 consecutive aortic ﬂow peaks (Figure 4 and Figure 6).\nTo export data to a spreadsheet after having traced the LV and the peaks of the blood flow, click on report | export | save as | excel.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}