{
  "id": 11257,
  "origin_website": "Jove",
  "title": "Quantitatively Measuring In situ Flows using a Self-Contained Underwater Velocimetry Apparatus (SCUVA)",
  "procedures": [
    "To begin this procedure, we ensure that all SCUVA components have sufficient battery power, recording tape (for the high-definition or HD video camera), and function properly. Depending on the flows to be measured, select video camera resolution and frame rates that yield best results for digital particle image velocimetry (DPIV).1,2\nPrepare the laser and camera housings for use by cleaning the o-ring grooves and o-rings with a clean towel or wipe. Spread manufacturer provided o-ring grease evenly on the o-rings and replace them in the housing grooves. In addition, clean the laser and camera housing apertures to prevent laser sheet deformation and marks on the camera housing lens.\nCheck the o-ring seals by placing both empty housings in a tub full of water. Weighted objects will need to be placed on top of the housings to submerge them since the housings float when empty. After 5 to 10 minutes, remove the housings from the tub and towel dry the outside. Check whether there is any moisture inside the housings. Also consider using disposable, paper moisture strips during the pressure test to indicate whether there is moisture in the housings after the test.\nAfter the housings pass the pressure test, place SCUVA components inside the housings. \nAttach high-intensity discharge (HID) light pods to the camera housing. Ensure that the lights are oriented in such a way that they illuminate the area directly ahead of the camera and operator, and do not interfere with maintaining grip on handles and operation of camera controls.",
    "In a low light environment, ensure that the laser beam is properly aligned relative to the optical lens installed in the laser housing. When properly aligned, the laser/lens combination will create a vertical sheet of light that is oriented perpendicular to the camera housing. For safety, use a temperature-sensitive sheet of paper to determine laser sheet orientation.\nUsing SCUVA attachments and the rigid, extendable arm, connect the laser housing and the camera housing to each other. Ensure that the housings are firmly attached and that the housings cannot rotate with respect to each other. It is critical that the laser sheet remains oriented perpendicular to the camera’s field of view throughout the measurement.\nDue to the current capabilities of SCUVA, measurement dives can only be conducted in low-light locations or at nighttime to prevent natural light interference with the laser sheet. Therefore, we recommend waiting until dusk or later before entering the water.\nTurn on the camera housing before entering the water. The camera housing has a built-in electronic moisture sensor that provides visual warnings (flashing LED lights) in case of moisture in the camera housing. The sensor only works when the camera housing is on.\nImmerse SCUVA in water and attach the apparatus to yourself using a line. Once attached to the apparatus, release SCUVA to determine the buoyancy characteristics of the device. Depending on the buoyancy characteristics, attach buoyancy foam or lead weights to one or both housings to ensure neutral buoyancy and prevent rotation of the apparatus in water.",
    "Next, switch on the laser and hold the apparatus stationary. Position the laser using the extendable arm sufficiently far from the diver to minimize measurement of diver-induced flows. Any measurements of diver-induced flows near the target introduce error and are not used for subsequent analysis. Adjust the camera zoom until the field of view frames the target and surrounding fluid.\nWhile keeping the apparatus stationary, focus the video camera on the laser sheet until particles appear sharp and in focus. Once the laser sheet plane is in focus, switch the camera to the manual focus mode. This will prevent the camera from refocusing on any objects that appear in the field of view during measurement,resulting in blurred particles in the laser sheet.\nTo calibrate SCUVA, place an object with known dimensions in the laser sheet within the video camera's field of view. Record for several seconds. After the dive, an image will be extracted from this video sequence to determine a calibration constant that converts the field of view size from units of pixels to cm. If at any time the operator adjusts the field of view size be re-position the extendable arm or changing the camera zoom during the dive, steps 12 and 13 will need to be repeated.",
    "Begin the dive by descending to the working depth. Upon finding a target, the environmental bulk flow properties need to be determined. If present, the current direction will dictate apparatus and diver positioning relative to the target during measurements. The direction of bulk flow surrounding the target can be inferred by observing bubbles exhaled from the diver and noting their lateral motion. In addition to bubbles, a small quantity of fluorescent dye (i.e., fluorescein) can be released to determine the current direction. Since diver-generated flow can be a source of DPIV measurement error, the diver should not be located upstream of the target. In addition, the laser sheet should be positioned parallel to the direction of current so as to maximize particle residence time within the laser sheet, thereby minimizing DPIV errors. However, if no current or bulk flow is present, diver and SCUVA positioning relative to the target are unrestricted. \nPosition SCUVA to illuminate and record the fluid motion surrounding a target. If attempting to record the flow surrounding a moving target first predict the location of the target, and then position SCUVA to the predicted location while remaining motionless. As the target moves through the camera’s field of view, begin recording. If the target is motionless, frame the target and surrounding fluid in the video camera’s field of view and begin recording while remaining motionless. The operator should refrain from rotational and out-of-plane motions during video recording since these motions result in erroneous DPIV results. Therefore, measurements collected during rotational and out-of-plane diver motions will not be used for further data analysis.",
    "Once video collection is complete, turn off all components of SCUVA and restore the laser arm to its retracted position. Remove SCUVA from the water and detach the camera and laser housings from the arm. Rinse or soak the apparatus in fresh water before drying to prevent rusting of the apparatus. Once the housings are dried, remove components from the housings, and recharge and replace batteries if needed for another dive. \nConnect the video camera to a computer and extract video from the HD tape by using a HD video software package (i.e., Adobe Premiere Pro or iMovie). After the video is extracted, determine the range of video to be converted into a series of images for DPIV analysis. Ensure that the pixel aspect ratios and extracted image sizes match the HD video settings. \nThese images are imported to a DPIV processing program (i.e., DaVis or MatPIV). After proper selection of calibration constant and image capture parameters, which are prompted from the DPIV software package, velocity fields can be generated from consecutive particle images. Additional post-processing steps, depending on the quality and types of measurements, can also be applied.3\nRepresentative Results:\nWhen the protocol is done correctly, the particle images surrounding the target will be sharp and easy to distinguish. Using the particle fields captured in situ by SCUVA’s video camera (Figure 1A) and a DPIV processing software package, velocity fields of flow surrounding the target (Figure 1B) will be revealed. Vectors in the velocity field indicate magnitude and direction of the local flow velocity. If sufficient video is collected to provide a time series of images, a time series of velocity fields can also be determined.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2615/2615fig1.jpgFigure 1\n Measured in situ particle fields (A) surrounding Aurelia labiata. Corresponding velocity field (B) with yellow vectors indicating flow direction and magnitude.",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/2615/2615fig2.jpgFigure 2 In situ particle fields surrounding Mastigias sp. and Solmissus sp. (A and B, respectively). Red arrow in A indicates a region of high reflectivity, which results in saturation of the image, making it difficult to distinguish between particles and the target. Red arrow in B indicates a region of streaking that results when the flow rate is not sampled at a high enough frequency."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}