{
  "id": 13999,
  "origin_website": "Jove",
  "title": "A Procedure to Observe Context-induced Renewal of Pavlovian-conditioned Alcohol-seeking Behavior in Rats",
  "procedures": [
    "All procedures are approved by the Animal Research Ethics Committee at Concordia University and concur with recommendations from the Canadian Council on Animal Care.\n1. Animals\nObtain male Long-Evans rats (220 – 240 g on arrival).\nMaintain rats in a temperature (21 °C) and humidity (44%) controlled animal care facility, on a 12 hr light-dark cycle with lights on at 7:00 am.\nPair-house rats upon arrival. After 3 days, house rats individually in plastic shoebox cages with beta-chip bedding, a nylon bone, and free access to standard rat chow and water. Use cage lids that have double grommets to allow for the subsequent placement of a second bottle, in addition to the water bottle. NOTE: Rats may be individually housed as soon as they arrive in the animal care facility.\nBegin to handle rats daily. NOTE: As a guide, one week of handling is usually sufficient to acclimate them to being picked up and handled by the experimenter.\n2. Intermittent Ethanol Access in the Home Cage\nNOTE: Conduct intermittent ethanol access in the home cage to ensure that rats will drink physiologically relevant quantities of ethanol before the behavioral training phase of the experiment begins 17-19. Initiate this procedure during the light phase, although it could be initiated at any time during the light or dark cycle.\nPrepare two bottles for each rat.\n\t\nUse a 100 ml plastic graduated cylinder as the ethanol bottle and a 473 ml standard plastic water bottle. Use a relatively small capacity ethanol bottle, filled almost to maximum volume capacity, to minimize loss of ethanol due to leakage and evaporation.\nFill one bottle with 15% ethanol, made by diluting 95% ethanol in tap water. NOTE: Other ethanol concentrations, such as 10% or 20%, may be used in place of 15% ethanol.",
    "Fill the second bottle with tap water.\nInsert a rubber stopper, with a sipper tube that contains a ball bearing to minimize leakage, into each bottle.\nSet up two control cages, treated identically to the home cages with the exception that the control cages do not contain rats or bedding.\n\t\nPrepare ethanol and water bottles for the control cages as specified in steps 2.1.1 – 2.1.4.\nUse the measures obtained from the control cages to control for spillage and/or evaporation that may occur over the course of the ethanol access session (as described in steps 2.8.1 – 2.8.2).\nWeigh all the ethanol and water bottles. Record all weights.\nWeigh all the rats. Record all weights.\nPlace the ethanol bottle and the water bottle on each home cage and control cage at the same time. Leave both bottles on the cages for 24 hr.\nAt the end of the 24 hr period, remove both bottles from the cages at the same time.\nWeigh all the ethanol and water bottles. Record all weights.\nTo determine how much ethanol and water was consumed during the 24 hr period, subtract the weight of each bottle when it was removed from the home cage from the weight of the bottle when it was placed on the home cage 24 hr earlier for each rat.\n\t\nDo the same for the two control cages, and then calculate the average amount of spillage for each fluid.\nSubtract the average amount of ethanol and water spillage, respectively, from the corresponding ethanol and water consumption measures for each rat.\nUse these spillage controlled difference measures to calculate ethanol consumption in g/kg, consumption of water, and ethanol preference.",
    "To calculate ethanol consumption (g/kg), first convert the weight (g) of ethanol solution consumed into volume (ml) based on the density of the total solution (ethanol + water components), according to the formula Volume (ml) = Weight (g)/Density (g/ml). NOTE: The density of the solution will vary as a function of ethanol concentration.\n\t\nNext, multiply the volume (ml) of ethanol solution consumed by the density (g/ml) of ethanol scaled for the specific percentage solution used, to yield the weight (g) of ethanol consumed.\nDivide the weight (g) of ethanol consumed by the rat weight (kg) to obtain the g/kg measure of ethanol consumption.\nTo calculate ethanol preference, express ethanol intake (ml) as a percentage of total fluid (ethanol + water, ml) intake.\nReturn the water bottle only back to the rat’s home cage. For the next 24 hr, give the rats access to water but not ethanol. Instead of an ethanol bottle, place a pre-weighed second water bottle on the home cage.\nAt the end of the 24 hr period, remove both water bottles from the cage at the same time.\nWeigh both sets of water bottles. Record all weights.\nSubtract the weight of each bottle when it was removed from the home cage from the weight of the bottle when it was placed on the home cage 24 hr earlier, subtracting out the average spillage measure obtained from control cages as described in steps 2.8.1 – 2.8.2.\nUse these spillage-controlled difference measures to calculate consumption of water.\nBegin the cycle again by providing both ethanol and water bottles to rats, as described in steps 2.1 through 2.14.\n\t\nRepeat this cycle for multiple (about 12) sessions to induce high and stable levels of ethanol consumption. See Figure 1 for representative results of ethanol consumption (g/kg) in the home cage.",
    "Alternate the spatial position of the ethanol and water bottle on the cage lid across sessions to prevent the development of a side preference.\nMake a fresh ethanol solution once per week to ensure accurate and stable ethanol concentration across sessions. Minimize the impact of evaporation of ethanol over prolonged periods of time using this approach.\n3. Apparatus\nHouse each conditioning chamber inside a ventilated, sound-attenuating cubicle.\nConstruct each conditioning chamber of a stainless steel metal rod floor, a clear polycarbonate ceiling, clear polycarbonate back wall and front door, and aluminum metal panel sidewalls.\n\t\nInstall a fluid port centrally near the base of the right metal sidewall. Equip the entrance to the fluid port with an infrared photocell to detect entries into the port.\nConnect polyethylene tubing from the back of the fluid port to a 20 ml syringe containing ethanol using a blunt-tipped needle. Place the syringe into a syringe pump located outside the sound-attenuating cubicle. For Pavlovian discrimination training sessions, load ethanol into the syringe before placing it into the pump. Prime the tubing by manually advancing the pump, and then wipe away excess ethanol from the fluid port. \nOn the left sidewall, install a white houselight centrally near the ceiling of the chamber.\nInstall a clicker (2 Hz cycle) and a white noise generator with speaker in the upper left corner of the left sidewall.\nOutfit each conditioning chamber with a specific configuration of visual, olfactory, and tactile stimuli to create a distinctive context.\n\t\nUse two different contexts, designated Context 1 and Context 2. Configure half of the conditioning chambers as Context 1 and the other half as Context 2.",
    "To create Context 1, place black cardboard panels over the ceiling and front and back walls of the chamber, spray lemon odor (10% v/v, made by diluting lemon oil in tap water) into a Petri dish and place it in the center of a metal waste tray under the floor of the chamber, and insert a clear polycarbonate floor panel over the metal rod floor. Line the waste tray with absorbent paper towel or bench liner.\nTo create Context 2, leave the ceiling and front and back walls of the chamber uncovered, so that they are clear, spray almond odor (10% v/v, made by diluting benzaldehyde in tap water) into a Petri dish and place it centrally in a metal waste tray under the floor of the chamber, and insert a perforated metal floor panel over the metal rod floor. Line the waste tray with absorbent paper towel or bench liner.\n4. Habituation\nHabituate rats to the behavioral training room and each of the two contexts within conditioning chambers. For this phase of the experiment, do not load ethanol into the 20 ml syringes.\nHabituate rats to the process of being transported from the animal care facility to the behavioral training room in the laboratory in two short habituation sessions.\n\t\nIn the first session, load the rats in their home cages onto a wheeled cart in the animal care facility, and transport them to the behavioral training room in the laboratory. Illuminate the room lights, turn on the fans in each sound attenuating cubicle, exit the room, close the door, and let the rats adjust to this new environment for 20 min, while remaining in their home cages on the cart. At the end of this 20 min period, return the rats to the animal care facility.",
    "In the second session, bring the rats to the behavioral training room in the laboratory. As before, leave the lights and cubicle fans on in the room. Remain in the room, with the door closed to minimize distractions, and handle and weigh each rat in the behavioral training room. Record the weights, and then return the rats to the animal care facility.\nHabituate rats to the conditioning chambers in two short habituation sessions.\n\t\nTransport the rats to the behavioral training room, record each rat’s weight, and load each rat into its designated conditioning chamber.\nIn the first habituation session set up half the chambers as Context 1 and the remainder as Context 2.\nIn the second habituation session set up each chamber with the context that was not used in the previous session.\nConduct habituation sessions in a counterbalanced fashion, such that half of the rats are first exposed to Context 1, followed by Context 2, and the other half are first exposed to Context 2, followed by Context 1. Ideally, conduct both habituation sessions in the same day, although they could be spread across two days if necessary.\nFor habituation sessions, use a computer program to illuminate the houselight 1 min after the program has been issued. Record the total number of fluid port entries made during a 20 min session. At the end of the session, program the houselight to turn off. Do not present any ethanol or cues during habituation sessions.\nRemove rats from the chambers, return them to their home cages, and transport them back to the animal care facility.\nClean the equipment (e.g., floor panels, waste trays, Petri dishes). See step 5.7 for further details.\n5. Pavlovian Discrimination Training (PDT)",
    "Train rats to behaviorally discriminate between one auditory cue that is paired with ethanol and a second auditory cue that is not. For this phase of the experiment, fill the 20 ml syringes with 15% ethanol.\nOutfit each conditioning chamber with a specific configuration of visual, olfactory, and tactile stimuli to create a distinctive context, as described in steps 3.3.2 and 3.3.3\n\t\nAssign half of the rats to Context 1 and the other half to Context 2 in a counterbalanced fashion, based on ethanol consumption and preference averaged across the last 2 sessions of the home cage ethanol access procedure. Refer to the context used during PDT as Context A. NOTE: Each rat should only experience one context in this phase of training.\nMake sure that the olfactory stimulus is the last contextual stimulus to be added to each conditioning chamber. Close the doors of the chamber and the sound-attenuating cubicle to contain the olfactory stimulus and minimize the comingling of different odors.\nBring the rats into the behavioral training room, record each rat’s weight, and load each rat into its designated conditioning chamber.\nInitiate the computer program that controls the following sequence of events during each PDT session.\n\t\nAt 5 min after the program has been issued, illuminate the houselight.\nPresent the white noise stimulus and the clicker stimulus 16 times each. Designate one of these auditory stimuli to be the CS+ and the other to be the CS-, in a counterbalanced fashion across both contexts.\nMake each CS+ and CS- trial last 10 sec.\nDeliver 0.2 ml ethanol into the fluid port during the last 6 sec of the CS+. Do not deliver any ethanol during the CS-.",
    "Make each PDT session last 58 min on average. Present the CS+ and the CS- each on a variable time 67 sec schedule.\nRecord fluid port entries during the 10 sec CS interval (the 10 sec during CS presentation), the 10 sec pre-CS interval (the 10 sec immediately prior to CS onset), and the 10 sec post-CS interval (the 10 sec immediately following CS offset) for both CS+ and CS- presentations, as well as total fluid port entries for the entire session. Also record the duration of each port entry made during these intervals.\nAt the end of the session, turn the houselight off.\nRemove rats from the chambers, return them to their home cages, and transport them back to the animal care facility.\nCheck the fluid ports to ensure that rats consumed the 3.2 ml of ethanol delivered in each PDT session.\nFlush the ethanol out of the polyethylene tubing with a 60 ml syringe containing a small amount of water. Then, pass 60 ml of air through the tubing using a second, empty syringe, to make sure it is dry.\nClean the equipment. For daily cleaning, wash the floor panels, waste trays, and Petri dishes. Once a week, clean the entire conditioning chamber. Do not use scented cleaning products to avoid introducing unwanted odors into the experimental apparatus.\nContinue PDT sessions daily until rats show stable discrimination in their port entry responses to the CS+ vs. CS-. NOTE: Port entries made in response to the CS+ should increase over sessions, whereas port entries made in response to the CS- should remain low. The exact number of PDT sessions necessary to achieve discriminated conditioned responding can vary, but, as a guide, plan on approximately 20 sessions.\n6. Extinction",
    "Outfit each conditioning chamber with visual, olfactory, and tactile stimuli to create a context that is distinct from the one the rats experienced during PDT sessions. For example, if Context 1 was used in PDT, configure the chamber as Context 2 for extinction sessions. Refer to the context used during extinction as Context B.\nConduct extinction sessions identically to PDT sessions, but do not deliver any ethanol during the CS+.\n\t\nUse the same computer program that was used during PDT to present the CS+ and CS-.\nTo maintain consistency across phases of the experiment, load an empty syringe into the syringe pump, and leave the pump turned on. Make sure the polyethylene tubing does not contain ethanol before extinction sessions.\nContinue extinction sessions daily until rats no longer show discriminated responding between the CS+ and CS-. NOTE: Port entries made in response to the CS+ should gradually decline across extinction sessions, until there is no difference between port entries made in response to the CS+ and port entries made in response to the CS-. The exact number of extinction sessions necessary to extinguish conditioned responding can vary, but as a guide, plan on approximately 8 sessions.\nClean the equipment at the end of each session, as described in step 5.7.\n7. Context-induced Renewal Test\nEquip each conditioning chamber with the visual, olfactory, and tactile stimuli to create the context that was experienced during PDT sessions. For example, if a given rat experienced Context 1 in PDT sessions, configure his chamber as Context 1 in the test session. Refer to the context used during the renewal test as Context A.\nConduct the context-induced renewal test identically to PDT sessions, but do not deliver any ethanol during the renewal test. Present the",
    "CS+ and CS- as before during PDT sessions, but withhold the ethanol.\n\t\nUse the same computer program that was used during PDT to present the CS+ and CS-.\nTo maintain consistency across phases, load an empty syringe into the syringe pump, and leave the pump turned on. Make sure the polyethylene tubing does not contain ethanol before the test session.\nObserve context-induced renewal of Pavlovian-conditioned alcohol-seeking behavior. NOTE: This renewal effect will be evident by a selective increase in the number of port entries made in response to the CS+, with no change in port entry behavior made in response to the CS-, relative to CS+ and CS- responding observed at the end of extinction training.\nClean the equipment at the end of the session, as described in step 5.7."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}