{
  "id": 10919,
  "origin_website": "Jove",
  "title": "Design and Construction of Artificial Extracellular Matrix (aECM) Proteins from Escherichia coli for Skin Tissue Engineering",
  "procedures": [
    "1. Cloning of Recombinant Plasmids Encoding for aECM Proteins\nDesign the amino acid sequence of the functional domain (e.g., cell-binding domain and elastin-like repeats). Design restriction sites flanking the ends of the functional domains to facilitate sub-cloning using free software according to software instructions (e.g., http://biologylabs.utah.edu/jorgensen/wayned/ape/). Here, select unique restriction sites that are not present in the functional domain to confine digestion to the intended sites. Choose restriction sites that appear in the multiple cloning site (MCS) of the host vector (e.g., pET22b(+)) for sub-cloning.\nReverse translate the amino acid sequence into the nucleotide sequence using free websites according to software instructions. (e.g., http://www.bioinformatics.org/sms2/rev_trans.html). Ensure codons are optimized for E. coli hosts.\nGene of interest can be purchased commercially as single stranded oligonucleotides (i.e., if the oligonucleotides < 100 base pairs (bp)) and perform DNA annealing (see step 1.4) to reduce the cost. Otherwise, for genes larger than 100 bp, they could be purchased through commercial companies.\nDNA annealing of the oligonucleotides\n\t\nAnneal the DNA oligomers to obtain the desired gene sequence. Dissolve DNA oligonucleotides in a DNA oligomer buffer (10 mM Tris: 2-amino-2-(hydroxymethyl)-propan-1,3-diol, pH 8.0, filtered) to a final concentration of 1 µg/µl.\nAdd 4 µl of each oligomer to 32 µl of DNA annealing buffer (10 mM Tris, 100 mM NaCl and 100 nM MgCl2) to achieve a total 40 µl mixture.\nBoil a beaker of water using a hotplate and immerse the mixture for 5 min, 95 °C. Remove the beaker and gradually cool the entire set up in a Styrofoam box O/N. The oligomers have been annealed and are ready for digestion.",
    "Add the corresponding restriction enzymes to digest the annealed oligomers (i.e., referred to as insert) and host vector (i.e., pET22b(+)) separately. Use the following recipe (1-2 µg of DNA, 2 µl of each restriction enzyme, 5 µl of 10x restriction enzyme buffer, and water up to a total 50 µl mixture) for 3-4 hr at 37 °C.\n\tNOTE: The pET22b(+) plasmid vector is ampicillin antibiotic-resistant and contains a 6x-His tag at the C-terminus. The 6x-His tag present in pET22b(+) allows us to use His-tagged antibodies to identify the target protein via western blotting in step 7.\nAdd 6x loading dye to each digestion mixture. Run the digestion mixtures separately including a DNA ladder on 1.2% DNA agarose gels containing a UV-fluorescent DNA stain for 1 hr at 100 V. Visualize the 1.2% DNA agarose gel with a UV light illuminator.\nSlice the gel to extract digested DNA products using commercial gel purification kits. Elute using the minimum volume for the column to achieve a minimum DNA concentration of 50-100 ng/µl.\nCombine the gene of interest sequentially by ligating the digested DNA insert (i.e., elastin repeats or cell binding domains obtained by DNA annealing) into the plasmid vector using T4 ligase using the following recipe: (2 µl of vector, 1 µl of T4 ligase, 1.5 µl of T4 ligation buffer, x µl of insert, 10.5-x µl water for a total 15 µl mixture). Incubate the ligation mixture at RT for 2 hr.\n\tNOTE: Molar concentration of vector to insert should be varied to optimize ligation efficiency. Volume of insert described as x in the recipe depends on the eluted DNA concentration from step 1.7.\nThaw E. coli DH5α chemically competent cells (or any cloning strain) on ice. Warm 2xYT agar plates (Table 1) containing ampicillin (25 µg/ml) to 37 °C.",
    "Transform the cells using heat shock:\n\t\nAliquot 50 µl of competent cells into clean, pre-chilled micro-centrifuge tubes. Pipette 5 µl (between 100 pg to 100 ng) of the ligation mixture into the cells, pipetting gently up and down to mix. Leave the mixture on ice for 20 min.\nImmerse the micro-centrifuge tube containing the cell mixture in a 42 °C water bath for 2 min and returned to on ice for 2 min. Time the immersion duration to minimize heat damage to the cells.\nAdd 500 µl of SOC media (Table 1) into the micro-centrifuge tube and incubate at 37 °C with shaking for 1 hr.\nSpread 50 500 µl of the cell/ligation mixture onto a 2xYT agar plate that has been pre-warmed to RT, containing ampicillin (25 µg/ml) and incubate plates upside-down at 37 °C O/N (12-16 hr).\nThe next day, pick DNA colonies from the agar plate using clean pipette tips. Grow the colonies in 5 ml of 2YT media (Table 1) containing ampicillin (25 µg/ml) O/N at 37 °C O/N (12-16 hr) with shaking (225 rpm).\nThe following day, use a plasmid isolation kit to extract the DNA plasmids for each colony picked according to manufacturer’s protocol. Elute the DNA with 50 µl of water.\nPerform a test digest with restriction enzymes using the following recipe: (5 µl DNA, 0.2 µl of each restriction enzyme, 1 µl 10x restriction enzyme buffer and top up water for a total 10 µl mixture), incubate for 2 hr at 37 °C to screen for colonies that likely contain the insert and run on 1.2% DNA agarose gel as in step 1.6.\n\tNOTE: Upon digestion, a successful ligation should results in two bands, one each for vector and insert which correspond to their respective molecular weight (Figure 1).",
    "Send the likely colonies for DNA sequencing using T7 promoter forward and reverse primers to commercial sequencers.\n2. Transformation of Recombinant Plasmid into Bacterial Expression Host\nFrom the sequencing result, select a colony that has been successfully ligated and use the DNA plasmid for transformation into an E. coli expression host.\nThaw E. coli expression strain (BL21(DE3)pLysS) on ice. Meanwhile, warm agar plates containing ampicillin (25 µg/ml) and chloramphenicol (34 µg/ml) to RT. \n\tNOTE: The pLysS plasmid present in bacteria strain BL21(DE3)pLysS contains a chloramphenicol resistance gene. The pLysS plasmid contains a T7 repressor gene which is constitutively expressed to limit leaky expression of the aECM protein. Chloramphenicol is necessary to select for bacteria cells that contains pLysS during culture.\nRepeat step 1.10 to obtain transformed E. coli cells that are ready to express the artificial proteins. Wrap agar plates in Parafilm and store upside-down in 4 °C for up to one month.\n3. Bacterial Expression of aECM Proteins\nRefer to Figure 2, pick a colony from the transformed agar plate with a pipette tip and inoculate into 10 ml of sterile Terrific Broth (TB) media (Table 1) containing both ampicillin and chloramphenicol antibiotics in a test tube. Incubate this starter culture at 37 °C O/N (12-16 hr) with shaking at 225 rpm.\nTransfer 10 ml of the starter culture into 1 L fresh and sterile TB media supplemented with the same antibiotics in a 3 L Erlenmeyer flask. Incubate the culture at 37 °C with shaking at 225 rpm for 2-3 hr and observe the optical density of the culture (OD600) reached 0.6-0.8 by pipetting 1 ml of culture into an empty cuvette for reading. Save 1 ml of culture prior to induction for SDS-PAGE characterization.",
    "To measure OD600 of the cell culture, prepare 1 vial of TB media in a cuvette for a blank measurement. Separately, transfer 1 ml of culture from the culture flask into a new empty cuvette. Measure the optical density of the culture using a spectrophotometer against the blank control at an absorbance of 600 nm.\nSave the sample (for subsequent SDS-PAGE analysis) by transferring the 1 ml of culture sample into a 1.5 ml microcentrifuge tube, centrifuge at 12,000 x g for 2 min, and decant supernatant.\nInduce the culture with isopropyl β-D-1-thiogalactopyranoside (IPTG) to a final concentration of 1 mM and incubate at 37 °C with shaking at 225 rpm for another 4 hr. Save 1 ml of culture at the end of induction at 4 hr for SDS-PAGE characterization.\nHarvest the cells by transferring the culture to 1 L centrifuge bottles and centrifuge at 12,000 x g for 30 min at 4 °C. Discard the supernatant, weigh the cell pellets and resuspend in TEN buffer (1 M Tris, 0.01 M EDTA, 0.1 M NaCl, pH = 8.0) at 0.5 g/ml.\n4. Lysis of Bacterial Cultures\nFreeze the re-suspended cell culture at -80 °C O/N. Thaw the frozen cell culture in a water bath at RT or on ice to lyse the cells. Add 10 μg/ml Deoxyribonuclease I (DNase I), 10 μg/ml Ribonuclease A (RNase I), and 50 μg/ml phenylmethylsulfonyl fluoride (PMSF) while thawing and homogenize the solution with slow stirring.\nAfter all resuspended cells are thawed, adjust the solution to pH 9.0 to increase the protein solubility in water12. Add 6 N NaOH drop wise with stirring on ice to achieve a homogenous consistency. Lyse by ultrasonic disruption for 20 min on ice using a 2 mm diameter flat tip, 5 sec pulse.",
    "Centrifuge the cell solution at 12,000 x g for 30 min at 4 °C. Transfer the supernatant to a clean, empty bottle and store at 4 °C for purification later.\nMeanwhile, resuspend the cell pellet again with TEN buffer and re-freeze at -80 °C. To complete cell lysis, repeat freeze/thaw and sonication process up to three times. Save 20 µl cell lysate for SDS-PAGE characterization.\n5. Purification of aECM Proteins Using Inverse Transition Cycling\nCollate the cell lysate from step 4.3 and proceed to purify the aECM proteins using ITC, similar to that used for purification of elastin-based proteins21. Cycles will be done with the different temperatures which are 4 °C (referred to as “cold”) and 37 °C (referred to as “warm”) cycles respectively.\nSplit the cell lysate into 50 ml centrifuge bottles, and centrifuge at 40,000 x g for 2 hr at 4 °C. The appearance of the cell pellet should be dark brown and look runny.\nRemove the supernatant by pipetting to get a clean separation from the pellet. Collect the supernatant in clean centrifuge bottles and add NaCl to a final concentration of 1 M (to a maximum of 3 M). Warm the solution to 37 °C for 2 hr with shaking at 225 rpm.\n\tNOTE: Addition of NaCl will trigger the transition of the elastin component of the aECM causing aggregation. The supernatant will turn turbid. If the protein concentration is high enough, white foamy protein can be seen at the sides of the centrifuge bottle.",
    "Centrifuge the supernatant from step 5.3 at 40,000 x g for 2 hr at 37 °C. Decant the supernatant. Crush the pellet using a metal spatula and resuspend the pellet bits in ice-cold autoclaved distilled water (50 mg/ml) with vigorous stirring O/N at 4 °C using a magnetic stir bar and plate. The pellet should be completely dissolved.\nRepeat steps 5.2 to 5.4 for another three to five times to obtain a higher purity of the protein.\nAfter the final cycle of purification, desalt the protein solution by dialyzing it against distilled water at 4 °C. Dialyze protein solution against water for 2-3 days with changes in water every 4 hr or 8 hr for O/N. Save 20 µl of the purified protein for SDS-PAGE and lyophilize the rest of the purified protein and store at -80 °C until further use.\n6. Characterization of aECM Proteins Using SDS-PAGE Electrophoresis\nPrepare a 12% SDS-PAGE gel (if the molecular weight is large, use 8% SDS-PAGE gels for better separation). Add 2x SDS loading buffer to each sample, heat the samples for 10 min at 100 °C and run samples on the gel for 1 hr at 100 V or until the protein ladder corresponding to the molecular weight of the aECM protein reaches the middle of the gel.\nRetrieve the gel from the SDS-PAGE set up and add Coomassie Brilliant Blue stain (Table 2) with a volume to submerge the gel for 1 hr in a Petri dish. Rinse gel in a destaining solution (Table 2) for 5 min on a rocker. Change the destaining solution, and continue to destain the gel with rocking until the background of the gel becomes clear. Protein bands should be clearly visible.",
    "Compare the position of the target protein against the protein ladder to determine the molecular weight of the target protein.\nTo further confirm the presence of the target protein, perform western blotting as in step 7.\n7. Characterization of aECM Proteins Using Western Blotting\nRun the samples on a 12% SDS-PAGE gel as in section 6 with no staining.\nCut nitrocellulose membrane to a size slightly larger than the SDS-PAGE gel. Cut 4 pieces of filter paper to the same size.\nWet one piece of filter paper with Western Transfer Buffer (20% v/v methanol, 25 mM Tris, 190 mM Glycine, pH 8.3), place the SDS-PAGE gel on top of the filter paper, followed by another piece of filter paper, then the nitrocellulose membrane and a final other two pieces of filter paper. Ensure the whole set-up is submerged with sufficient western transfer buffer.\n\tNOTE: The gel and membrane should not be in contact at this point of time as proteins could bind to the membrane upon contact.\nTransfer the proteins onto the nitrocellulose membrane by placing two filter papers into a western semi-dry transfer unit, followed by the nitrocellulose membrane, and carefully place the SDS-PAGE gel within and on the membrane, lastly place the last two wet filter paper on the SDS-PAGE gel. Run the western transfer at 45 mA, 30 min. Add buffer if voltage is higher than 30 V.\n\tNOTE: Preferably place the SDS-PAGE gel on the membrane with one attempt and avoid shifting the gel unnecessarily on the membrane as proteins could bind to the membrane upon contact.\nRetrieve and block the nitrocellulose membrane with blocking solution (5% non-fat milk in PBS pH 7.4, filtered with filter paper) for 2 hr at RT. Dispose of blocking buffer and add PBS to rinse.",
    "NOTE: Change to new gloves to avoid contaminating the membrane with unwanted proteins.\nIncubate primary anti-His antibody with dilution in PBS at 1:1,000 at RT for 1 hr with rocking. Prepare a mixture in a volume which could submerge the whole membrane, for example, with dilution ratio 1:1,000, add 1 µl of antibody (stock concentration: 1 mg/ml) to 999 µl PBS for a 1 ml total mixture.\nRinse the membrane with 5 ml of PBST (PBS with 0.1% Tween20).\nIncubate with secondary antibody conjugated to horse-radish peroxidase (HRP) with dilution in PBS at 1:5,000 at RT for 1 hr with rocking. Prepare a mixture in a volume which could submerge the whole membrane, for example, with dilution ratio 1:5,000, add 1 µl of antibody (stock concentration: 1 mg/ml) to 4,999 µl PBS for a 5 ml total mixture.\nWash the membrane with 5 ml of PBST and repeat twice.\nApply the chemiluminescent substrate to the membrane with a volume to cover the membrane and incubate by following the instructions for the substrate used.\n\tNOTE: The substrate’s sensitivity to protein detection may vary, we recommend a substrate with maximum sensitivity for very low signals in the event increasing antibody concentration does not increase signals.\nCapture the chemiluminescent signals using a CCD camera based imager. Adjust the primary and secondary antibody dilution ratio if signals are weak and non-specific. Incubate longer in blocking solution if background signal is high.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}