{
  "id": 10523,
  "origin_website": "Jove",
  "title": "Manufacturing Abdominal Aorta Hydrogel Tissue-Mimicking Phantoms for Ultrasound Elastography Validation",
  "procedures": [
    "1. Download STL Models from the NIH 3D Print Exchange\nNavigate to the NIH 3D Print Exchange (3dprint.nih.gov) and in the Search entry type Simulated Aneurysmal Aortic Phantom Mold and hit the enter key.\nIn the subsequent list returned from the search, find the model \" 3DPX-009210\" and click that entry.\nClick the download button and subsequently click the Simulated Aneurysmal Aortic Phantom Mold.zip file from the drop-down list to download this file.\nDouble click the downloaded file to unzip it and store the resulting files (InnerDistSTL.stl, InnerProxSTL.stl, OuterAntSTL.stl, OuterPostSTL.stl, BackgroundMoldSTL.stl and SampleMoldSTL.stl) to the computer used for 3D printing in Steps 2.1-2.7.\n\tNOTE: One may alternatively download each of the files listed in Step 1.4 separately.\n2. 3D Printing of Molds\nOpen the 3D printer interface software and use the Connect button to connect to the printer.\nImport the downloaded STL file OuterAntSTL.stl (Figure 1a, blue) into the 3D printing software. In the 3D printing software, select the Edit button and orient the mold part by clicking the Rotate menu and then clicking the X, Y, or Z buttons to align the long axis parallel to the print bed with the outside of the mold facing the print bed. Click the Save button and then click the Print button and print the mold part using polylactic acid (PLA) plastic filament on a single extruder.\nimgsrc://cloudfront.jove.com/files/ftp_upload/57984/57984fig1.jpg\nFigure 1: CAD Representation of Phantom, Background and Sample Molds. (a) - (b) 3D CAD images of vessel mold and orientation of parts for assembly. Registration spacers (i), pins (ii), holes (iii) and the fill hole are shown. (c) Drawing of inner lumen highlighting the inner vessel dimensions. (d) CAD rendering of the sample molds. (e) CAD rendering of the background phantom mold. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/57984/57984fig1large.jpg]",
    "Repeat Step 2.2 for the OuterPostSTL.stl file (Figure 1a, red).\nFollowing the same process from Step 2.2, import the STL file InnerDistSTL.stl (Figure 1a, white) into the 3D printing software and select the \"Edit\" button and in the Rotate menu click the X, Y, or Z buttons to align the long axis perpendicular to the print bed and such that the registration pin (i) is in contact with the print bed. Click the Save button and then click the Print button and print the mold part using PLA plastic filament on a single extruder.\n\tNOTE: Do not print this part with the support structure. Do not use more than 30% infill for this printed part.\nImport the STL file SampleMoldSTL.stl (Figure 1d) into the 3D printing software. Select the Edit button and in the Rotate menu click the X, Y, or Z buttons to align the part such that the inside of the mold is facing up from the print bed. Click the Save button and then click the Print button and print the mold part using PLA plastic filament on a single extruder.\n\tNOTE: Do not print this part with the support structure. Print 3 or more sample molds.\nImport the STL file BackgroundMoldSTL.stl (Figure 1e) into the 3D printing software. Select the \"Edit\" button and in the Rotate menu click the X, Y, or Z buttons to align the part such that the bottom of the mold (i.e., the closed end of the cylinder) is facing the print bed. Click the Save button and then click the Print button and print the mold part using PLA plastic filament on a single extruder.\n\tNOTE: Do not print this part with the support structure.",
    "Import the STL file InnerDistSTL.stl (Figure 1a, yellow) into the 3D printing software. Select the \"Edit\" button and in the Rotate menu click the X, Y, or Z buttons to align the part such that the long axis is perpendicular to the print bed and bifurcation registration pins (i) are facing the print bed. Click the Save button and then click the Print button and print the mold part using polyvinyl acid (PVA) plastic filament on a single extruder.\nRemove any support material from the 3D printed parts of Steps 2.1-2.7 (Figure 2a).\n\tNOTE: It is not necessary to remove the support structure from the outer mold parts if they do not interfere with the mold assembly.\nimgsrc://cloudfront.jove.com/files/ftp_upload/57984/57984fig2.jpg\nFigure 2: Vessel Phantom Mold Assembly and Final Vessel Phantom. (a) The final printed mold of inner and outer lumen molds. The distal end of the inner lumen printed in a dissolvable PVA plastic and is attached to the proximal end of the inner lumen mold using deformable wax. (b) Tubing attached to the injection port of the outer lumen mold and the syringe stopper. (c) The inner lumen mold after spray coating of flexible sealant. (d) Assembly of bulge side of the outer lumen mold and inner lumen mold with PVA-c (dyed red) added for stiff aneurysm phantoms. (e) Full vessel mold assembled and clamped. (f) Deformable wax applied to the seams of the outer lumen mold to prevent PVA-c from leaking from the mold. (g) Final PVA-c phantom after 5 freeze/thaw cycles and removal from the mold. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/57984/57984fig2large.jpg]\n3. Hydrogel Preparation",
    "Mix 22.2 g of PVA-c powder in 200 mL of tap water (10% by mass) in a glass beaker. Microwave the solution to a boil and stir. Repeat this step until all of the PVA powder is dissolved and the solution appears translucent.\nSuspend 0.4 g of calcium carbonate powder (0.2% by mass) in 10 mL of water and add to the solution from Step 2.1 to act as ultrasound scatterers. Mix Thoroughly. Cover the solution and allow it to cool to the room temperature (RT).\n\tNOTE: For homogeneous phantoms skip to Step 3.5\nMix 17.6 g of PVA-c powder in 100 mL of tap water (15% by mass or as desired) in a separate glass beaker. Microwave the solution to a boil and stir. Repeat this step until all the PVA powder is dissolved and the solution appears translucent.\nSuspend 0.4 g of calcium carbonate powder (0.2% by mass) in 5 mL of water and add to the solution from Step 2.3. Mix Thoroughly. Cover the solution and allow it to cool to the RT.\nMix 183.7 g of PVA-c powder in 3.5 L of tap water (5% by mass) in a separate large pot. Bring the solution to a boil and stir. Remove the pot from the heat once the PVA powder is dissolved and the solution appears translucent.\nSuspend 7.4 g of calcium carbonate powder (0.2% by mass) in 10 mL of water and add to the solution from Step 2.5. Mix Thoroughly. Cover the solution and allow it to cool to the RT.\n4. Assembly of Molds\nAttach approximately 100 mm of the flexible tubing to the injection port of the outer lumen mold. To the opposite end of the tubing, attach a stopcock with syringe connections (Figure 2b).",
    "Align the registration pins of the inner lumen mold and, using deformable wax, adhere the bulging vessel part of the inner lumen mold to the straight vessel part of the inner lumen mold.\nIn a well-ventilated area, apply a spray-on flexible rubber coating to the aneurysmal end of the inner lumen mold to prevent the hydrogel from dissolving the PVA mold part during the molding process (Figure 2c).\n\tNOTE: For homogeneous phantoms skip to Step 4.6.\nWith the larger side of the aneurysmal part of the outer mold facing down, fill the bulge with 15 mL of the solution created in Steps 3.3-3.4 (Figure 2b,). Place the assembled inner mold parts in the front outer mold part (Figure 2d). Use rubber bands to hold the inner lumen part in place.\n\tNOTE: In Figure 2, PVA-c is dyed red for visibility.\nFreeze the mold assembly in a -20 °C freezer for 12 h and remove from the freezer. Move on to Step 4.6 without letting the solution in the mold assembly thaw.\nWhile waiting for the mold to freeze (Step 4.4), apply a generous amount of deformable wax to the Back surface of a printed sample mold and clamp it to a flat plastic sheet cut to the minimum size of approximately 100 mm by 60 mm by 10 mm (Figure 3a). Fill the space between the mold and the plastic sheet with the same PVA solution used in Step 4.3. Freeze the sample mold in the same freezer (-20 °C) as the vessel mold in Step 4.4.\nimgsrc://cloudfront.jove.com/files/ftp_upload/57984/57984fig3.jpg",
    "Figure 3: Sample mold and Final Sample and Background Phantoms. (a) Clamped sample mold and clear plastic sheet. PVA-c is poured into the sample mold and air bubbles are allowed to surface. (b) PVA-c sample after final freeze/thaw cycle. (c) Experimental US imaging setup of phantom attached to simulator pump and placed in the background PVA-c phantom. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/57984/57984fig3large.jpg]\nAssemble and clamp together the entire vessel mold in the orientation shown in Figure 1a and 1b (Figure 2e). Line the seams of the outer lumen molds using a deformable wax to ensure that the hydrogel does not leak during injection (Figure 2f).\nFill a 60 mL syringe with the PVA-c solution made in Steps 3.1 and 3.2. With the bifurcation end of the mold up inject the PVA-c solution into the mold assembly avoiding air bubbles in the injected solution.\n\tNOTE: If any leaks occur during the injection, pause injection and patch leaky areas with deformable wax. Repeat syringe injections until the PVA-c solution fills the mold.\nAllow the mold to sit for 30 min, tapping the mold gently every 10 min to allow any air bubbles to rise to the top of the mold. Repeat the syringe injection if needed to top off the mold. Freeze the entire mold assembly for 12 h and remove from the freezer. Allow the mold assembly to thaw at RT for 12 h.",
    "While waiting for the mold to freeze (Step 4.8), assemble and clamp another sample mold and flat plastic sheet cut as described in Step 4.5 (Figure 3a). Fill the space between the mold and the plastic sheet with the same PVA solution used in Step 4.7. Freeze and thaw the sample mold in the same freezer (-20 °C) and at the same time as the vessel mold in Step 4.8 and the sample mold of Step 4.5.\nFreeze and thaw the vessel mold and both the sample molds from Steps 4.5, 4.8 and 4.9 four more times, for a total five 24 -h freeze/thaw cycles. After the 5th freeze/thaw cycle, remove the PVA-c testing samples from their molds (Figure 3b). Trim any excess cryogel from the samples and store them in a sealed container of a 5% by volume bleach/water solution at RT.\nRemove the PVA-c vessel from the outer lumen mold. Carefully separate the straight vessel part of the inner lumen mold from the aneurysmal part and remove from the PVA-c vessel. Cut the registration spacers from the bifurcated end of the aneurysmal part of the inner lumen mold to expose the printed PVA filament. Place in a water bath at RT to dissolve the PVA aneurysmal part.\n\tNOTE: This may take 24 h or more, however, adding warm water to the bath may speed the dissolving process.\nAfter dissolving and removing the PVA printed part from inside of the vessel phantom, store the phantom in a sealed container of a 5% by volume bleach/water solution at RT.",
    "Fill the background mold with approximately 3.3 L of the PVA-c solution made in Steps 3.5 and 3.6. Freeze (-20 °C) the background mold for 12 h and remove from the freezer. Allow the mold to thaw at RT for 12 h and repeat for a total of 2 freeze/thaw cycles.\nAt the same time as Step 4.13, fill a sample mold assembly with the same PVA-c solution used in Step 4.13 and put it through the same freeze/thaw samples as the background mold.\nAfter the 2nd thaw, remove the background sample and background phantom from their molds and store them in a sealed container of a 5% by volume bleach/water solution at RT.\n5. Phantom and Sample Testing\nPlace the vessel phantom and background phantom into a large water bath. Attach the larger vessel end to the output of the hemodynamic water pump42,43 using tubing clamps (Figure 3c). Place the vessel phantom in the background phantom and then attach the bifurcated ends of the phantom to the inlet to the hemodynamic pump using tubing clamps.\nPlace a solid-state pressure sensor catheter in the system of the vessel and pump near the inlet of the hemodynamic pump. Run the hemodynamic pump such that the pressures of the wall deformations are between a minimum of 0 kPa and a maximum 7.5 kPa (Figure 4a).\nimgsrc://cloudfront.jove.com/files/ftp_upload/57984/57984fig4.jpg\nFigure 4: Imaging Protocol. (a) Pressure profile measured during the phantom imaging setup. (b) A representative B-mode image of the phantom at the minimum pressure. (c) B-mode at maximum pressure. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/57984/57984fig4large.jpg]",
    "Use an ultrasound (US) system and a convex transducer with a center frequency of approximately 5 MHz to collect US Images of the background and vessel phantoms in cross-section at the location of the maximum vessel diameter (Figure 4b and 4c). Record the pressure data using a digital acquisition system (Figure 4a).\n\tNOTE: Details for performing the image acquisition in this step can be found in Mix et al44.\nObtain the displacement estimations by using a non-rigid image registration-based technique as described in Mix et al.44. From the measurements of the two-dimensional (2D) displacement field (ui(x)), calculate the 2D strain tensor field (εij(x)) by evaluating the symmetric part of the gradient of the displacement field:\nimgsrc://cloudfront.jove.com/files/ftp_upload/57984/57984eq1.jpg\nThen, calculate the maximum principal strain (εp) as the maximum principal component of the strain tensor field using the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/57984/57984eq2.jpg\nLastly, determine the frame of the principal strain at the peak pressure and divide this strain tensor field by difference in the maximum and minimum catheter measured pressures (Figure 4a), or the pulse pressure (PP), to spatially resolved pressure normalized principle strain (εp/PP).\nimgsrc://cloudfront.jove.com/files/ftp_upload/57984/57984fig5.jpg\nFigure 5: Pressure Normalized Strain Images. Representative images of the pressure normalized strain (εp/PP) in%/kPa measured within the vessel for the homogeneous 10% by mass vessel phantom (a) and the heterogeneous phantoms with a 15% by mass (b), 20% by mass and 25% by mass anterior aneurysmal section (top of vessel). This figure has been modified from Mix et al.44. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/57984/57984fig5large.jpg]"
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}