{
  "id": 9164,
  "origin_website": "Jove",
  "title": "Custom-made Microdialysis Probe Design",
  "procedures": [
    "1. Preparing PTFE-tubing\nShorten PTFE-tubing into 2.5 cm piece. Use a scale paper to estimate physical dimensions. (see Figure 3a)\nCut one ending at an angle to facilitate connecting of outlet tubing. (see Figure 3a)\nRoughen PTFE-tubing by use of sandpaper to allow adhering of the epoxy glue.\n2. Preparing Fused Silica\nShorten fused silica into 2.25 cm piece. (see Figure 3a)\n3. Inserting the Fused Silica into the PTFE-tubing\nInsert a 30 G cannula into the hollow PTFE fiber to pierce it at a distance of 1 cm from the flat end. Bend the PTFE-tubing to simplify the process. (see Figure 3b)\nInsert the fused silica into the PTFE-tubing using the cannula as guidance. (see Figure 3c)\nGently remove the cannula and secure the fused silica. (see Figure 3d)\nThe fused silica is supposed to project 5 mm at the flat end. (see Figure 3e)\nGlue the fused silica in place at the puncture site by cyanoacrylate glue and allow it to harden over night. (see Figure 3e)\n4. Preparing Epoxy Glue (Two Component Glue)\nAdd 30 parts of yellow hardener to 70 parts of black epoxy glue by help of a fine needle and mix it gently. It is directly ready to use.\n5. Applying the Membrane (All Further Steps Must Be Performed Under the Microscope and a Scale Paper is Used to Estimate Physical Dimensions)\nPull the polysulfone membrane carefully over the fused silica, then pull the membrane into the PTFE-tubing and adjust the membrane to 5.5 mm using a sharp scalpel. (see Figure 3f)\nSet a marking point on the membrane with a fine pen to define the exchange length of 2 mm from the end of the membrane.",
    "Apply a small amount of epoxy glue to cover the tip of the membrane with the help of a fine needle. (see Figure 3g)\nClose off the joint between dialysis membrane and PTFE fiber by help of the same fine needle used in step 5.3) with the epoxy glue. (see Figure 3g)\nAdd enough epoxy glue on the membrane up to the marking point to ensure an exchange length of 2 mm. Allow it to harden over night. (see Figure 3g) Before determination of the exchange length, the membrane is 5.5 mm. After applying the epoxy glue on the membrane, only 2 mm of the membrane is available for diffusion.\n6. Applying the Metal Sleeve\nCut a 25 G needle into 1 cm metal sleeve pieces by help of a bending pliers.\nPull the 1 cm metal sleeve (25 G) onto the remaining part of the fused silica. The metal sleeve later enables the connection of the inlet tubing with the microdialysis probe. (see Figure 3h)\nSeal joint between metal sleeve and PTFE-tubing with the remaining epoxy glue. Allow it to harden for at least 24 hr. (see Figure 3i)\nApplying hot glue around the bifurcation of the probe for additional fixation and stabilization.\n\tNOTE: The inlet internal volume of the probe is 0.045 µl and the outlet internal volume is 2.5 µl. Therefore, with a flow rate of 1 µl/min, it takes approximately 2.5 min after connecting the inlet tube to start the collection of the dialysate. With the present protocol, the probe assembly procedure yields microdialysis probes that are 95 % reliable.\n7. Performance of In Vitro Recovery Experiments",
    "Dip the probe with a cut-off of 30 kDa and an exchange length of 2 mm into a stock solution composed of aCSF containing 1 mM glucose and 1 mM lactate and, in a separate experiment, into a CSF containing 100 nM ATP and 100 nM acetylcholine.\nPerfuse the probes with aCSF. Set flow rate to 1 µl/min and carry out experiments at room temperature (22 °C). Allow the probes to equilibrate for 1 hr in the stock solution, and collect the samples every 30 min afterwards and store at -80 °C until measurement.\nFor the calculation of in vitro recoveries, compare the concentrations of analytes in the dialysates with the known analyte concentrations in the stock solution. Express results as percentages of substance concentration in dialysate vs. stock solution.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}