{
  "id": 9446,
  "origin_website": "Jove",
  "title": "A Caenorhabditis elegans Model System for Amylopathy Study",
  "procedures": [
    "1. Construction of Transgenic Worms\nTransformation.\n\t\nPrepare injection pads. Place a drop of hot, 2% agarose dissolved in water, onto a glass coverslip. Quickly place a second coverslip on the drop and lightly tap it. After the agarose is solidified, slide coverslips apart, and bake the coverslip-pad in a vacuum oven at 80 °C O/N.\nPull pipettes. We use a Sutter P-97 puller to pull 1/0.5 mm O.D./I.D. borosilicate capillaries with filament. Pipettes are forged with closed tip which is broken open at a later stage.\nPrepare injection mix. Make the injection mixture containing the DNA of interest (20 ng/μl per construct) plus empty plasmid DNA to a final concentration of 150 ng/μl. Centrifuge the injection mixture to remove any contaminant. This step is crucial because contaminants reduce transformation efficiency. Transfer the top 5 μl (debris and other contaminants collect in the bottom) to a fresh tube to be used in injection.\nLoad injection mix by capillarity. The bottom of the pipette is immersed in the injection mix. Typically 0.5 μl are sufficient to inject 100 worms.\nLoad injection pipette. Insert the pipette onto the holder of the micromanipulator and break it open by rubbing its tip against the edge of a cover slip mounted on a glass slide or alternatively against debris on the agarose pad. This is a crucial step as too large tips damage the worm and too small tips are easily clogged. The quality of the broken tip can be judged by the shape and most importantly by the flow rate. The flow rate can be assessed by the size of the bubbles flowing from the open tip immersed in a drop of halocarbon 700 oil in response to an injection pressure.",
    "Transfer worms to injection pad. Place a drop of 700 halocarbon oil on an injection pad and transfer several (1 or 2 for beginners) worms to the oil. Use a worm pick to push the worms down onto the pad until they adhere to the agarose. Worms should be oriented in rows with ventral sides facing the same direction. Avoid touching worm's head. If after several attempts the worms fail to adhere to the pad, replace with a fresh pad or increase agarose thickness and/or concentration.\nInsert the pipette into the worm. By moving the stage, position the worm under the pipette. Position the pipette in the central core of the gonad because its cytoplasm is shared by many germ cell nuclei. This increases the likelihood to deliver injected DNA to many progeny. The pipette should lie almost parallel to the worm (~15°-25° angle). Push vertically the tip of the pipette down the worm's body until the skin is depressed. Then gently tap on the manipulator to induce tip's insertion. For best results inject both gonads.\nInject the DNA solution. Apply pressure to the pipette until the gonad swells. Stop the flow and pull the worm off the pipette. Test the needle for flow and then move to the next worm and repeat injection steps.\nRecover the worms: Add a drop (~10 μl) of recovery buffer on the worms and incubate until the worms begin swimming. Add an equal volume of M9, wait until worms resume swimming and repeat several times until the solution is mostly M9. Individually transfer worms to seeded plates.\nIntegration.\n\t\nPlace 40 healthy, well-fed, L4 worms into a fresh plate",
    "Irradiate with γ-ray with 4,000 rads for 40 min. Transfer irradiated worms (P0) in fresh, OP50 seeded plates (4 worms/plate). Worms can alternatively be irradiated with a dose of 300 J/m2 UVs.\nTransfer 10-20 F1 transformants from each plate to individual plates, label the plates with the corresponding P0 origin.\nSingle out 2-4 F2 transformants for each F1 to separate plates. Check the F3 progeny for 100% transmission of the transformation marker. Typically, 1-3% of progeny from an irradiated worm will have an integration event.\nMake stocks of three or more independent transformant lines.\n2. Behavioral Assays\nAge-synchronization.\n\t\nGrow worms in standard 10 cm NGM plates + OP50 E. coli until a large population of gravid adults is reached (3-5 days).\nCollect the worms in 50 ml Falcon tubes by suspending them in 1 ml M9 buffer.\nAdd 5 ml M9 buffer and centrifuge at 450 x g for 3 min. Discard supernatant. Repeat 3-4x.\nAt the end of the last centrifugation, remove the supernatant and add 10 volumes of basic hypochlorite solution (0.5 M NaOH, 1% hypochlorite freshly mixed) to the pelleted worms. Incubate at RT for ~10 min. The lysis reaction can be monitored by placing a drop of the lysis reaction on a coverslip and examining the worms under a microscope. When roughly 80% of worms are broken the reaction should be stopped.\nStop the lysis reaction by adding the same volume of sterile egg buffer.\nCollect the eggs (and carcasses) by centrifugation at 450 x g for 5 min.\nWash the eggs with sterile egg buffer 2-3x.\nIncubate the eggs O/N in M9 buffer and seed them on standard NGM plates.\nChemotaxis assay.",
    "Prepare several pieces of agar roughly 0.5x0.5x0.5 cm. We deposit the agar in a 10-cm plate and we cut the agar chunks from there.\nSoak the agar chunk in a solution containing the desired attractant (at saturating, near-saturating concentrations) for 2 hr. Typical attractants are lysine (0.5 M), biotin (0.2 M).\nDeposit an agar chunk in a 10 cm test plate in which the location of a test spot and a control spot have been marked (Figure 1A). Allow equilibration and formation of a gradient O/N (Figure 1B). Prepare 5 plates for a single experiment.\nPrior the experiment add 10 μl of 20 mM NaN3 (anesthetic) to each spot.\nPlace 20 age-synchronized worms in the center of the plate. Place the plate in the incubator at 20 °C.\nAfter 1 hr, count the animals on the test/control spots and calculate the chemotaxis index, (C.I.) as follow: imgsrc://cloudfront.jove.com/files/ftp_upload/50435/50435eq1.jpg where N, Ntest and NCnt., indicate the total number of animals, the number of animals in the test spot and the number of animals in the control spot.\n3. Primary Embryonic Cell Culture\nLyse worms as described in age-synchronization.\nStop the lysis reaction by adding the same volume of sterile egg buffer and centrifuge at 450 x g for 5 min. Gently discard supernatant being careful to not lose pelleted eggs. Repeat 2-3x or until supernatant is clear.\nResuspend pelleted eggs (and carcasses) in 2 ml sterile egg buffer and add 2 ml of sterile 60% sucrose in egg buffer. Mix this solution until eggs are completely resuspended (as they tend to form clumps under centrifugation) by hand or by vortexing.\nCentrifuge at 450 x g for 15 min.\nCarefully transfer supernatant (containing the eggs) to a sterile tube. Discard pellet which contains carcasses and other by-products of lysis.",
    "Remove residual sucrose by resuspending the eggs in egg buffer and centrifuging at 450 x g for 5 min. Gently collect and discard the supernatant. Repeat 3x.\nUnder a laminar hood resuspend pelleted eggs in sterile egg buffer containing 1 U/ml chitinase at RT to digest the eggshells. After 30 min start to monitor the reaction (under an inverted cell culture microscope). Each batch of chitinase has a slightly different activity. Typically digestion is completed in 1 hr.\nWhen roughly 70-80% eggshells are digested by chitinase add CM-15 (L-15 cell culture medium containing 10% fetal bovine serum, 50 U/ml penicillin, and 50 μg/ml streptomycin). Dissociate cells using a syringe with a 27 gauge. Filter the cell suspension with a 5.0 μm filter to remove intact embryos, clumps of cells and larvae.\nPellet the dissociated cell suspension by centrifugation at 450 x g for 15 min. Remove the supernatant and resuspend the pellet in CM-15 cell culture medium.\nPlate dissociated cells on glass cover slips previously coated with peanut lectin (0.1 mg/ml) dissolved in water. Note: cells must adhere to the substrate in order to differentiate.\nCells can be maintained at RT (16-20 °C) in air for more than 2 weeks.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}