{
  "id": 13775,
  "origin_website": "Jove",
  "title": "A Time Differential Staining Technique Coupled with Full Bilateral Gill Denervation to Study Ionocytes in Fish",
  "procedures": [
    "Both protocols conformed to the guidelines of the Canadian Council of Animal Care (CCAC) and were carried out with the approval of the University of Ottawa Animal Care Committee (Protocol BL-226).\n1. Time Differential Staining Technique: Mitochondrion-rich Dye Bath\nPrepare 1 mM MitoTracker Red stock solution by dissolving 50 µg in 94.0 µl of dimethyl sulfoxide (100% DMSO). Keep stock solution in the dark at -20 °C when not in use. Avoid freeze/thaw cycles.\nPrepare dark boxes (3 - 6 boxes) with a maximum volume of 600 ml. Fill the boxes with 400 ml of system water (water the fish are normally held in) and place an air stone in each box to provide a source of O2. Obtain goldfish (30 - 40 g) and place them in the boxes with 400 ml of water and an air stone. After 30 min, add the viable mitochondrion-rich dye to yield final concentrations of 0.1 µM and 0.01% DMSO. Bathe the fish for 4 hr.\n\t\nIf these are control fish (i.e., no denervation), turn on water flow to the boxes, allow the dye to flush out and recover the fish for the period of time allotted in the protocol. Fish are typically recovered for 3 - 5 days.\nAfter the recovery period proceed to Section 3: Time Differential Staining Technique: Immunohistochemistry. If these fish are to be denervated proceed to Section 2: Full Bilateral Denervation Procedure.\n2. Full Bilateral Denervation Procedure\nObtain 1 pair of student Vannas spring scissors (curved), 1 pair of standard pattern forceps-straight, 1 pair of standard pattern forceps-curved, 2 pairs of No. 5 forceps, 1 pair of tissue retractors, small cotton balls (1 - 2 mm in diameter), and cotton swabs (Q Tips or equivalent).",
    "Prepare the anaesthetic water bath. First, dissolve 10 g of benzocaine to a final volume of 100 ml of 99% ethanol to prepare a stock solution. To prepare the anaesthetic water bath, dissolve 15 ml of the stock benzocaine solution into 30 L of aerated system water at the required temperature. Aerate the water by placing an air-stone connected to an air pump or a central air-line into the water tank.\n\t\nPlace fish into the anaesthetic water bath (Figure 1A).\nOnce breathing has ceased, place the fish on a surgery table and intubate it as shown in Figure 1B. Do this by inserting a tube in its buccal cavity to irrigate the gills with aerated anaesthetic solution. Irrigation of the gills ensures that the fish is supplied with a sufficient amount of O2 and anaesthetic during the denervation procedure. Position the fish so that the head is tilted slightly downward. This allows for better access to the area behind the fourth gill arch.\nGently lift the operculum with the straight standard pattern forceps and place the tissue retractors between the operculum and the inside of the head. Carefully open the tissue retractors to keep the operculum away from the head and keep the gills exposed.\nMake sure that the anaesthetic solution is irrigating the gills during this procedure. Rest the retractor handles next to the head which provides access to all four gill arches.",
    "Place the curved standard pattern forceps between the fourth gill arch and the back of the head and gently open them to create tension in the ligament attaching the fourth gill arch to the head. With a pair of No. 5 forceps create a small opening (2 - 3 mm) by piercing the epithelium connecting the dorsal end of the gill arches to the opercular cavity. Be careful not to go in too deep because there is the risk of damaging a major blood vessel.\nWith a small cotton ball held with No. 5 forceps slowly and carefully expand the incision to expose the IX (glossopharyngeal) and X (vagus) nerves. Free the nerves from any connective tissue by using the No. 5 forceps, again taking care not to damage blood vessels.\n\tNOTE: The branchial IX and X nerves of the goldfish rest deep behind the fourth gill arch and are in proximity to major blood vessels feeding into the gill arches.\nOnce nerves have been identified use the curved spring scissors to carefully cut the nerves while holding the incision open with the curved standard shape forceps. After severing the nerves, gently retract the curved forceps. There is no need to close the incision with sutures because the epithelium is very thin and the incision usually closes on its own within 24 - 48 hr. Remove tissue retractor.\nRepeat the same procedure on the other side of the head.\nSwitch the irrigation of the gills from anaesthetic to fresh aerated water to recover the fish from anaesthesia. Once opercular movements have resumed move the fish into experimental tanks to recuperate for at least 24 hr.",
    "Perform a “sham” procedure on a separate set of fish. The “sham” procedure involves piercing the epithelium behind the fourth gill arch without severing the nerves.\n3. Time Differential Staining Technique: Immunohistochemistry\nFirst, prepare 4% paraformaldehyde (PFA) in 1x phosphate buffered saline (PBS; 4 g PFA in 96 ml of PBS). PFA does not dissolve easily in PBS at RT. Heat solution in a water bath to dissolve PFA. Perform this in a fume hood. Once PFA is in solution let cool before use. Store at 4 °C for up to 2 weeks.\nBefore euthanizing the fish and extracting the gill tissue, place 3 - 4 ml of 4% PFA into a scintillation vial for a total of 8 scintillation vials (1 vial per gill arch). In addition, take a small weigh boat and fill it with 1x PBS. This will be used to wash the tissue after it has been excised. Keep all solutions on ice.\nAfter the viable mitochondrion-rich dye exposure experiment has finished, euthanize the goldfish by placing it in a water bath with an overdose of benzocaine.\nUse blunt forceps to lift the operculum on one side of the head and curved scissors to sever each end of the branchial gill basket. Carefully pick up the gills by the rakers using blunt forceps and lift them out of the opercular cavity. Immediately wash the gills in ice cold 1x PBS to remove excess benzocaine and blood.\nPlace the excised gills in separate vials (a vial for each gill arch) filled with 4% PFA and fix O/N at 4 °C.",
    "After fixation, wash the excess PFA in 1X PBS and place the tissue in a 2 ml bullet tube filled with 1.5 ml of 1% Triton-X on a shaker for 6 hr at RT or O/N at 4 °C. This step permeabilizes the tissue. If the whole gill is too big to place into a 2 ml tube then cut the tissue into sections small enough to fit the tube taking care not to damage the filaments.\n\t\nPrepare the primary antibody dilutions by mixing 4 µl of the stock solution of each primary antibody (total of 8 µl) into 992 µl of 1x PBS. Make sure that the NKA (labels NKA-rich cells) and zn-12 (labels neurons) primary antibodies have been raised in the same host. This is important if the researchers decide to identify specific IC subtypes at the same time for which they will have to use primary and secondary antibodies raised in a different host species.\nRemove the Triton-X solution and without washing the tissue add a 1:250 dilution (dilute in 1x PBS) of a NKA monoclonal antibody (α-5) to detect NKA-rich cells and a zebrafish specific neuronal antibody (zn-12) to detect nerve fibers (primary antibodies) and incubate on a shaker for 6 hr at RT or O/N at 4 °C.\nWash the primary antibody 3 times for 3 min each using 1x PBS. To do this, remove the primary antibody solution from the tube by suctioning it out using a pipette.\nPrepare the secondary antibody at a 1:200 dilution by mixing 5 µl of stock secondary antibody into 995 µl of 1x PBS. Apply secondary antibody (Alexa Fluor 488) and incubate for 6 hr at RT or O/N at 4 °C on a shaker.",
    "NOTE: MitoTracker Red is excited at a ~594 nm wavelength and will fluoresce red. A secondary antibody that is excited at a ~488 nm wavelength and fluoresces green must be used to label NKA and zn-12 primary antibodies.\nRemove excess secondary antibody by washing the tissue 3 times for 5 min each (as described in step 3.7).\n4. Imaging\nAfter the washes, mount the tissue on a concave slide for whole mount confocal imaging of cells and nerve fibers. To mount the tissue, first place it in a drop (200 µl) of 1x PBS on a flat microscope slide. This ensures that the tissue does not desiccate.\nSeparate the gill hemibranchs with the curved micro-scissors. Place a drop of 1x PBS and a drop of mounting media into a concave slide.\nPlace the separated hemibranchs into the concave slide with the leading edge of the filament facing upward and cover with a cover slip. Dab the edges of the cover slip with nail polish in order to prevent the cover slip from moving around and displacing the tissue. Allow the tissue to settle to the bottom of the concave slide for 10 - 15 min before imaging.\nFor each gill arch, select six gill filaments at random for imaging, producing six images per gill arch. Use conventional confocal microscopy to image the tissue by taking 1 - 3 µm optical slices.\n\tNOTE: Any pre-existing cells will be labelled with MitoTracker Red and positive for NKA will appear yellow only. Cells that appear red only are pre-existing ICs that do not contain NKA. Any newly proliferated cell will only be positive for NKA and will appear green only. Nerve fibers will also appear green.\n5. Image Analysis for Ionocyte Quantification",
    "For each gill filament that has been imaged, quantify the ICs and associated innervation by scrolling through the sections of the Z stack and counting the number of lamellar and filamental ICs present and whether or not they are newly differentiated, pre-existing, and/or innervated.\nQuantify the ICs per filament or per area (mm2) of filament. Do this by using the drawing tools associated with the software used to acquire the images to outline the lamellae of the filament encompassing the area of the filament in which the ICs were quantified. Most confocal imaging software programs have the option to calculate the area of an outlined region on the image. Use the option in the imaging software which allows you to do this to acquire the area.\nDivide the counted ICs by the area calculated by the software to obtain a measure of ICs per unit area (e.g., per mm2)."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}