{
  "id": 18568,
  "origin_website": "Jove",
  "title": "Minimally Invasive Thumb-sized Pterional Craniotomy for Surgical Clip Ligation of Unruptured Anterior Circulation Aneurysms",
  "procedures": [
    "NOTE: Prior to performing this procedure, obtain all required institutional approval and patient consent.\n1. Surgical Technique\nInduce patient with general anesthesia.\nPlace radial arterial line for blood pressure monitoring.\nPlace patient in the supine position on the operating room table.\nAfter the head is clamped into the Mayfield Head holder using standard techniques for a pterional craniotomy, position the head 30°-45° with the ipsilateral side up towards the ceiling, except for anterior-communicating artery aneurysms in which the head is placed at 60º to allow for better visualization across the interhemispheric fissure.\nPosition the neck midline and translate anteriorly to maximize jugular venous drainage to prevent cerebral edema and then extend the head to position the ipsilateral zygoma at the highest point—this allows for frontal lobe relaxation and elevation from the orbital roof during dissection without the use of retractors.\nClip the hair in preparation for standard pterional scalp incision; use about a one to two inch strip behind the hairline.\nSterilely prep the skin and drape the surgical area according to standard of care.\nPerform a standard curved scalp incision for a pterional approach extending from the midline of the scalp behind the hairline with a gentle curve posteriorly and inferiorly towards the tragus ending it about 3 mm anterior to the tragus and at the level of the superior edge of the zygoma. Perform this incision down to the skull above the superior temporal line and to the muscle fascia at the level of the temporalis muscle.\nUse electrocautery for scalp hemostasis with the bipolar device.\nCut the temporalis muscle down to the skull using the bovie monopolar electrocautery device.",
    "Raise a myocutaneous flap keeping the temporalis muscle attached to the undersurface of the scalp for now. Fish-hooks are used to evert the flap after the temporalis muscle is elevated from the skull using a combination of monopolar electrocautery and a periosteal elevator.\nPerform an inverse subfascial dissection in the avascular plane from the undersurface of the myocutaneous flap using Metzenbaum scissors, keeping the fascia and subfacsial fat pad with the scalp to avoid injury to the facial nerve.\nSecure the temporalis muscle posteriorly and inferiorly to expose the pterional region with “star” fishhooks.\nKeep all components of the myocutaneous flap moist with wetted gauze.\nDrill a single temporal 5 mm burr-hole at the posterior-most aspect of the planned craniotomy with a 2 mm cutting burr so that the foot plate of the side-cutting drill can be inserted into this hole and then use a side-cutting drill with a foot plate to remove the thumb-sized (approximately 3 x 4 cm) kidney-shaped craniotomy centered anteriorly around the pterion.\nUsing a No. 1 Penfield, separate the dura on all sides of the pterion and have an assistant gently retract the dura away from the bone surface that is being drilled to minimize risk of penetrating the dura and causing cortical injury.",
    "Remove the pterion with a drill: anteriorly, until the superior and lateral aspects of the orbital roof are smooth and flattened down to the outer cortical table of bone, without entering the orbit, to maximize subfrontal exposure; medially, drill until the superior orbital fissure dura is exposed and remove any small pieces of bone that would interfere with medial exposure using either a drill bit or hand-held Lempert bone cutting device. Ensure that excellent hemostasis of all soft-tissue and bone surfaces has been obtained to avoid blood dripping into the intradural space during brain dissection and aneurysm exposure, using electrocaurtery and bone wax as needed, before opening the dura.\nGently elevate the dura and use a No. 11 scalpel to penetrate the dura and then use dural scissors to create a “C-shaped” opening in the dura with the base at the pterion. Secure the dura flat against the outer cortical bone of the orbit without having redundant dural leaflets that would otherwise obscure visualization of the proximal Sylvian Fissure and subfrontal region. This can be performed by using 4-0 Surgilons sutures to tack the dura to the scalp.\n2. Brain Relaxation\nGive 25-50 g of Mannitol at the time of bone flap removal to relax the brain if anesthesia agrees that the blood pressure will tolerate diuresis.\n\tNOTE: This will allow time for the diuresis to occur and ultimately will relax the brain to help maximize gravity dependent brain retraction during dissection.\nKeep End-Tidal pCO2 between 30-35 mm Hg to achieve slight hypercapnea. NOTE: This will safely allow for brain relaxation and maximize gravity dependent brain retraction during dissection.",
    "Evacuate cerebrospinal fluid (CSF) to promote brain relaxation by opening the arachnoid cisterns in the interoptic, carotid-optic, and carotid-oculomotor cisterns and patiently suction CSF until the desired brain relaxation has been achieved.\n\tNOTE: This typically takes about 1 min; no lumbar drain is needed with this technique and it dramatically opens the surgical corridors.\n3. Sylvian Fissure Dissection\nBring the intra-operative microscope with the mouthpiece into the field using sterile techniques. Also bring surgical chairs with arm support into the field sterilely to maximize bimanual dexterity and to prevent surgeon arm and hand fatigue.\n\tNOTE: The mouthpiece should be adjusted before draping so that the surgeon can move the microscope with the mouth while simultaneously looking through the ocular pieces.\nPerform dissection.\n\tNOTE: For anterior communicating artery aneurysms, no Sylvian Fissure dissection is required and minimal (2-3 mm in extreme cases only, but this is a rare occurrence) to no gyrus rectus resection is needed using only subfrontal dissection; all other supraclinoid anterior circulation aneurysm locations (including posterior communicating artery) require <1 cm proximal Sylivan Fissure dissection to expose the supraclinoid internal carotid artery, its branches (posterior communicating and anterior choroidal arteries), the internal carotid artery terminus, the A1 and M1 origins, and the proximal A2 and M2 segments distal to their respective bifurcations. Total Sylvian Fissure exposure was dime-size (1 cm x 1 cm) and no brain retractors were used for any of the cases reported. Gravity dependent brain relaxation was sufficient for excellent exposure of the soft tissue structures and vasculature needed to perform surgical clip ligation in the areas discussed above.\nUsing bimanual manipulation with surgical microinstruments gently open the arachnoid corridors, holding the brain tissue aside with the edge of the instrument handles or suction device as needed through this exposure.",
    "NOTE: The senior author's preference is to use a 4-French Fukishima suction tip in the non-dominant hand and in the dominant hand bipolar bayonettes for blunt dissection or microscissors for sharp dissection. Moistened Telfa strips are placed on the brain surface at the site of manipulation to prevent cortical injury. Cottonoids often stick to the brain surface and can’t be easily advanced deeper as the dissection progresses, without causing mild cortical injury.\nUse the mouthpiece on the operating microscope frequently to adjust the scope and focus length as needed while keeping both hands in the field.\nSecure the aneurysm in standard fashion, using the suction most often in the non-dominant hand to maintain the surgical corridor and visualization free of CSF.\nAfter clip placement, perform intra-operative Doppler of the aneurysm dome to confirm cessation of flow as well as the inflow and outflow vessels to confirm flow and carefully examine the aneurysm neck and parent vessels. We reserve intra-operative digital subtraction angiography (DSA) for anterior communicating artery aneurysms and those clipped aneurysms where inflow, outflow, or aneurysm neck cannot be visualized completely or there is a concern with intra-operative Doppler. Intra-operative DSA is preferred over indocyanine green (ICG) angiography because when multiple aneurysm clips are used to reconstruct the aneurysm neck, the clip can obstruct visualization. NOTE: Once the aneurysm has been securely clipped, the microscope is removed from the field and the brain irrigated with normal saline solution to minimize the amount of pneumocephalus after closure.\nAfter inspecting the clip for aneurysm occlusion with the Doppler, the aneurysm dome is perforated with a 22 G needle attached to intravenous tubing and a 10 ml syringe and manually suction aspirated to confirm aneurysm occlusion.",
    "Reapproximate the native dura with 4-0 surgilon and cover with a synthetic dural substitute if a watertight closure is not able to be obtained properly.\nSecure bone plates with a metal plating system per standard of care.\nSecure the frontal edge of the bone flap flush against the native bone to avoid space between the two which would not be cosmetically pleasing after the tissues heal.\nReapproximate the temporalis muscle fascia with interrupted 2-0 Vicryl sutures. Secure the top of the temporalis muscle with a 2-0 Vicryl stitch to the frontal metal plate to reapproximate it to the superior temporal line.\nReapproximate the galea using 3-0 Vicryl sutures and close the scalp in a standard fashion using either staples, nylon, or prolene. Dress with sterile bandages per surgeon preference.\n4. Post-treatment Care\nAdmit patient to the intensive care unit after treatment and mobilize with the nursing staff as soon as sedation or general anesthesia has worn off enough to do so, typically within 6 hr of extubation.\nOrder physical and occupational therapy to begin post-operative day one in order to assess the patient for safe discharge to home if there were any concerns by the nursing staff.\nDischarge the patient when criteria are met: pain controlled with only oral medications, voiding independently, ambulating independently, and tolerating oral food intake.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}