{
  "id": 4707,
  "origin_website": "Bio",
  "title": "Extraction and Identification of T Cell Stimulatory Self-lipid Antigens",
  "procedures": [
    "Lipid extraction and fractionationThe following lipid extraction and fractionation procedure is adapted from (Facciotti et al., 2012; Folch et al., 1957) and it is optimized for 109 cells. For different numbers of cells, adjust the volumes accordingly. This protocol was used to extract lipids from mouse thymocytes or THP-1 cells (ATCC TIB-202TM). For other types of cells the protocol may require optimization.Lipid extractionPellet the cells by centrifugation at room temperature for 5 min at 300 x g, resuspend them in 10 ml PBS and transfer them in a glass tube.After this step use glass tubes exclusively. Wash cells 2x with 10 ml PBS by centrifugation (5 min at 300 x g) and completely remove the PBS by aspiration with a glass Pasteur pipette. Resuspend the pellet in 8 ml of a mixture of water/methanol/chloroform (1:1:2 vol/vol/vol).Sonicate 2 x 30 sec (5 Hz). Incubate 3 h at room temperature in a rotating wheel. Centrifuge 5 min at 3,100 x g at room temperature.Collect the organic layer (bottom layer) with a glass pipet avoiding contamination with the aqueous phase (upper layer) and store at -20 °C.Add 4 ml of methanol/chloroform (1:2 vol/vol) to the remaining aqueous phase.Vortex 2 min and incubate 1 h at room temperature in rotation.Centrifuge 5 min at 3,100 x g. Collect the organic (bottom) layer with a glass pipet avoiding contamination with the aqueous phase (upper layer) and store at -20 °C until use.Repeat steps A8-11 one additional time.Pool the collected organic phases and dry for ~2 h under nitrogen flow delivered as a gas stream (~3 bars) through a Pasteur pipette connected to a N2 source. Dissolve in 2 ml methanol/chloroform (1:2 vol/vol) and store at -20 °C.",
    "We refer to this extraction as “apolar” because it contains most of the cellular lipids with exception of the highly polar ones. Measure the volume of the remaining aqueous phase and add 1 vol of water-saturated butanol (see Recipes).Vortex 2 min and incubate 1 h at room temperature in a rotating wheel.Centrifuge for 5 min at 3,100 x g.Collect the upper layer (butanol phase), dry under nitrogen flow, dissolve in 2 ml methanol and store at -20 °C. As this extraction contains highly polar lipids poorly soluble in methanol/chloroform we call it “polar”.Lipid fractionationThe following fractionation procedure allows the separation of both apolar and polar lipid extractions in 10 individual fractions of different polarity using aminopropyl cartridges. Apply the same procedure described here to both the lipid extractions separately using two different cartridges. Equilibrate the cartridge with 6 ml hexane.Load the cartridge with the total volume of extracted lipids (2 ml, Figure 1 A).Sequentially apply the indicated volumes of the eluents (see Recipes) and collect the fractions individually eluted by gravity in glass conical tubes (Figure 1B; each letter represents an eluent and it also identifies individual fractions, e.g. the fraction eluted with solution “a” is called “a”, etc.):4 ml4 ml3 ml11 ml9 ml3 ml4.5 ml6 ml4 ml4 mlDry eluted fractions under nitrogen flow and dissolve each fraction in the solutions and volumes indicated below:280 µl methanol/chloroform (1:2 vol/vol)280 µl methanol/chloroform (1:1 vol/vol)280 µl methanol/chloroform (1:1 vol/vol)280 µl methanol/chloroform (1:1 vol/vol)280 µl methanol/chloroform (1:1 vol/vol)280 µl methanol/chloroform (9:1 vol/vol)280 µl methanol/chloroform (9:1 vol/vol)280 µl methanol/chloroform (9:1 vol/vol)280 µl methanol/chloroform (9:1 vol/vol)500 µl methanol/chloroform (9:1 vol/vol)Store each resuspended fraction at -20 °C.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150604/20150604020429_4722.jpgFigure 1. Scheme illustrating the lipid fractionation procedure. A. Loading of apolar and polar extracted lipids on two separate amino (NH2) cartridges. B.",
    "Sequential elution of lipid fractions from the amino cartridges. Letters indicate eluents and corresponding fractions. Numbers indicate the temporal order of elution and fraction collection.T cell activation assayIn this section we describe how to evaluate the T cell stimulatory capacity of lipid preparations. To maximize assay sensitivity, a series of essential points have to be considered.Autoreactive T cell clones recognizing the cells from which the lipids are extracted, should be highly responsive.APCs should express high levels of the restriction molecules for optimal antigen presentation.APCs should be chosen for their poorly stimulatory capacity in the absence of exogenously added antigen, in order to minimize the levels of background stimulation of autoreactive T cells in the absence of tumor-derived lipids.As the T cell clones we have used in the experiments were CD1c-restricted, we chose freshly purified circulating B cells from healthy donors as APCs. These cells display high levels of cell surface CD1c and weakly stimulated T cell clones in the absence of added antigens (De Libero et al., 2005). Isolation of B cells was achieved by sorting using magnetic MicroBeads coupled to anti-human CD19 mAbs according to the manufacturer protocol. In another set of experiments we used low numbers of fixed THP-1 cells (105/well) transfected with CD1c gene (De Libero et al., 2005). We observed that fixation for 20 sec with 0.05% glutaraldehyde significantly reduced the CD1c-dependent T cell clone stimulatory capacity of THP-1-CD1c cells, thus making detection of lipid-specific T cell stimulation possible after addition of active lipid fractions. The use of fixed APCs, however, has an important limitation. Fixed cells are metabolically inactive and are unable to process antigens. Thus, if the unknown lipid antigen(s) require(s) processing steps, the use of fixed APCs will not reveal the T cell stimulatory activity of lipid fractions containing unprocessed antigens.",
    "Note that all the above issues (choice of T cells and APCs, fixation of APCs, etc.) need to be optimized in preliminary experiments according to individual experimental settings and objectives.Plate 1-5 x 105 APCs/well in 96 wells flat bottom plates in 45 µl of complete medium. Prepare at least 3 dilutions of each lipid fraction. Tested dilutions should be in the range 1:10-1:1,000 of the original preparation. As the fractions are dissolved in organic solvents, which are toxic for cells (volumes and type of solvents are indicated in the step B4 of the paragraph “Lipid fractionation”), they need to be dried (under nitrogen, to avoid oxygen-induced lipid alterations) and offered to the cells in a solution, which is compatible with cell viability. Generally, 20 µl of each fraction are transferred into a new glass conical tube, dried, dissolved in 20 µl of PBS 20% methanol (vol/vol, vehicle) and sonicated. Dissolved fractions are then used to pulse APCs at various dilutions. Add fractions to plated APCs. As example, 5 µl of each dissolved fraction (undiluted or previously diluted 1:10 or 1:100 using PBS 20% methanol) are added to the wells containing APCs in 45 µl of complete medium. In this way each lipid fraction will be finally diluted 1:10, 1:100 or 1:1000, respectively in the culture wells. Importantly, the methanol contained in the vehicle in which the fractions are dissolved will also be diluted to a final concentration of 2%, which is compatible with APC viability and T cell activation. Include control wells in which only the vehicle (5 µl of PBS 20% methanol) is added to the 45 µl of APCs. Perform triplicate replicas of each experimental condition.Incubate 4 h at 37 °C in humidified CO2 incubator.Add 5 x 105 T cells/well in 50 µl of complete medium.",
    "Incubate 24-48 h at 37 °C in humidified CO2 incubator. Collect supernatants and measure cytokine release by standard sandwich ELISA (according to the manufacturing protocols; see Materials and Reagents). We measured release of GM-CSF (after 24 h) and IFN-γ (after 48 h) as read out of T cell activation. However, it is important to note that the choice of the cytokine needs to be done according to the cytokines more abundantly released by tested T cells and excluding those released by the APCs, which should be determined in preliminary experiments. In general, GM-CSF release represents a very sensitive and relatively fast read out for in vitro T cell clone activation. Measuring at least two different cytokines is recommendable to avoid false positive results. Lipid fractions are considered positive if they induce dose-dependent T cell cytokine release. Results are expressed as fold change over background (cytokine release in the presence of APCs incubated with lipid/cytokine release with APCs incubated with vehicle). Fold change ≥ 2 is considered relevant.The activity of stimulatory fraction(s) has to be confirmed in a second set of experiments, in which blocking antibodies specific for the CD1 isoform that restricts the response of the T cells used are included. Blocking antibodies and appropriate isotype control antibodies are used at a final concentration of 20 µg/ml and are added to APCs incubated with active lipid fractions at least 30 min before T cells.Sub-fractionation of active lipid fractionsOnce one or more T cell stimulatory lipid fractions are identified a second fractionation step is made to further purify the antigenic lipid molecules. The procedure described in this section uses reverse-phase HPLC performed with a Nucleodur C18 Pyramid end-capped column (3-μm particle size, 3-mm ID) and two mobile phases: Mobile phase A: methanol/water/formic acid (74:25:1, vol/vol/vol) (pH 4.",
    "0) Mobile phase B: methanol/formic acid (99:1, vol/vol) (pH 4.0)The following gradient was used to isolate polar lipids:B 20% from time 0 to min 1B from 20% to 50% from min 1 to min 2 B 50% from min 2 to min 4 B from 50% to 100% to min 4 to min 34B 100% from min 34 to min 54B from 100% to 20% from min 54 to min 55B 20% from min 55 to min 60The flow rate was 0.5 ml/min.Inject the active lipid fraction in the HPLC system.Collect individual sub-fractions every 30 sec using an automated collector connected to the HPLC system.Dry the sub-fractions under nitrogen flow and resuspend fractionated lipids in 10 µl methanol. Perform T cell activation assay as described above by testing all individual sub-fractions at various dilutions. Store the rest of the sub-fractions at -20 °C for further analyses.After identification of T cell stimulatory lipid fractions, structural analyses need to be performed to characterize the active lipid molecule(s). Liquid chromatography-tandem MS, high-resolution mass spectrometry and NMR are the techniques of choice (De Libero et al., 2005; Lepore et al., 2014)."
  ],
  "subjectAreas": [
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}