{
  "id": 4716,
  "origin_website": "Bio",
  "title": "Generating Isogenic Deletions (Knockouts) in <em>Francisella tularensis</em>, a Highly-infectious and Fastidious Gram-negative Bacterium",
  "procedures": [
    "Primer design Primer design is one of the most important steps for generating a KO. First, find your gene of interest in the associated strain genome and copy the DNA sequence containing approximately 1 kb upstream of your gene of interest, your gene of interest, and 1 kb downstream of your gene of interest. To demonstrate this procedure, FTL_1839-a Francisella tularensis subsp. holarctica LVS lipase/acyltransferase-will be targeted for primer design and KO in this protocol (Figure 2A). To generate a KO construct, two primers (named “A” and “B”) will be needed to amplify the upstream flanking region and two primers (named “C” and “D”) will be needed to amplify the downstream flanking region. Note that primers B and C must be located immediately upstream and downstream, respectively, from your gene of interest as any sequences between primers B and C will be deleted (Figure 2A). However, the locations of primers A and D are much more flexible. Whereas traditional bacterial KO constructs have contained 1 kb flanking regions, we have found that 500 bp flanking regions are sufficient to initiate homologous recombination and gene deletion in F. tularensis. The major advantage of 500 bp flanking regions is that they are shorter than 1 kb flanking regions and, thus, there is less chance for mutations during sequential PCR amplification steps (described below). Primer lengths and locations in upstream and downstream flanking regions are fairly flexible but we have found that the optimum melting temperature (Tm) for each primer should be between 50 °C and 60 °C. For the demonstration FTL_1839 KO construct, the Tm for each primer is between 55 and 56 °C (Figure 2B-C). Melting temperature calculations only should be based on primer regions homologous to the genomic sequence and should exclude engineered restriction sites and other primer modifications.",
    "When the four primer regions have been selected, Primers A and D should be modified by adding Apa I restriction sites (GGGCCC; indicated by orange nucleotides in Figure 2C) immediately 5’ of the genomic sequence and a six random nucleotide extension should be added to the 5’ end of each primer to facilitate restriction digest efficiency (indicated by grey nucleotides in Figure 2C). The 5’ ends of Primers B and C should be modified to include sequences from the 5’ and 3’ ends of the FLP recombination target (FRT)-flanked Pfn-kanamycin resistance cassette (FRT-Pfn-kan-FRT) from pLG66a (Gallagher et al., 2008; indicated by purple nucleotides in Figure 2C). Two additional primers, Kan5’ and Kan3’ (Figure 2D), are needed to amplify the FRT-Pfn-kan-FRT cassette from pLG66a (see step 2). Given the relatively short length of the above noted primers and small amount of each primer needed for PCR amplification, we typically order 25 nM scale oligonucleotides with standard desalting. Although difficult to predict, it may be necessary to retain the 5’ or 3’ ends of your gene of interest to avoid polar effects on upstream or downstream genes. A promoter prediction tool, such as PePPER (http://pepper.molgenrug.nl/index.php/prokaryote-promoters[href=http://pepper.molgenrug.nl/index.php/prokaryote-promoters]), should be used to analyze your gene of interest for cryptic promoters. If a putative promoter is found in your gene of interest, the location of Primers B and/or C may need to be shifted so that the putative promoter is retained following gene deletion.   First-round PCR: Amplification of upstream and downstream flanking regions and the kanamycin resistance cassette   Primers A, B, C, D, Kan5’, and Kan3’ should be suspended in dH2O to a stock concentration of 40 µM.    F. tularensis genomic DNA should be prepared using Trizol reagent, following the manufacturer’s instructions, and suspended in dH2O.",
    "We have tested other genomic DNA extraction techniques and kits but, in our experience, Trizol reagent yields the highest quality DNA (260 nm / 280 nm ratio between 1.8 and 2.0).   PCR amplifications should be performed using a high-fidelity Taq polymerase, such as Platinum Taq DNA Polymerase High Fidelity (Life Technologies).PCR reactions typically contain 0.2 µM of each primer and 100 to 250 ng of F. tularensis DNA.   In the first round of PCR amplifications, three reactions are performed:    Primers A and B are used to amplify the upstream flanking region from F. tularensis DNA (Figure 3A);    Primers C and D are used to amplify the downstream flanking region from F. tularensis DNA (Figure 3A);    Primers Kan5’ and Kan3’ are used to amplify the FRT-Pfn-kan-FRT cassette from pLG66a (plasmid purified using the QIAprep Spin Miniprep Kit and eluted using provided EB buffer; Gallagher et al., 2008; Figure 3A).  PCR amplification should be performed following the manufacturer’s instructions.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150621/20150621021219_3260.jpg Figure 2. Primer design for generating a FTL_1839 KO construct. A. The genomic organization of flanking genes and FTL_1839 (gene to be deleted) are represented by large arrows. The direction of each large arrow indicates the open reading frame orientation. Small black arrows with associated letters A, B, C, and D indicate approximate locations of Primers A, B, C, and D needed to generate the upstream and downstream flanking regions. B. F. tularensis subsp. holarctica LVS genomic sequence flanking the FTL_1839 gene. The upstream gene, FTL_1838, is indicated by green nucleotide letters. The gene to be deleted, FTL_1839, is indicated by red nucleotide letters. The downstream gene, FTL_1840, is indicated by blue nucleotide letters. Regions selected for Primers A, B, C, and D are indicated by bolded and underlined nucleotides. C.",
    "Following primer location selection, Primers A and D should be modified to aid in cloning and primers B and C should be modified for inclusion of a kanamycin resistance gene between the upstream and downstream regions. For all primers, the F. tularensis subsp. holarctica LVS genomic sequence is indicated by bolded and underlined nucleotides. For Primers A and D, random nucleotide extensions on the 5’ ends of each primer are indicated by grey nucleotide letters and Apa I restriction sites (GGGCCC) are indicated by orange nucleotide letters. For Primers B and C, the 5’ and 3’ ends, respectively, of the kanamycin resistance gene (nucleotides in purple) have been added to the 5’ ends of each primer for subsequent inclusion of the kanamycin resistance gene between the two flanking regions (described in step 4). D. Primers Kan5’ and Kan3’ for amplification of the kanamycin cassette, FRT-Pfn-kan-FRT, from pLG66a.      Correct length products should be purified using the QIAquick PCR Purification Kit. For PCR amplifications that result in multiple bands, the correct length product should be excised from the agarose gel and purified using the QIAquick Gel Extraction Kit. Alternatively, PCR amplification conditions can be optimized by adjusting the annealing temperature 1 to 5 °C to improve PCR product quality and quantity.   Correct length products should be purified using the QIAquick PCR Purification Kit. For PCR amplifications that result in multiple bands, the correct length product should be excised from the agarose gel and purified using the QIAquick Gel Extraction Kit. Alternatively, PCR amplification conditions can be optimized by adjusting the annealing temperature 1 to 5 °C to improve PCR product quality and quantity.     Second-round PCR: Splicing-Overlap Extension (SOE) PCR SOE PCR (Horton et al.",
    ", 2013) is used to fuse the A-B upstream flanking region, the FRT-Pfn-kan-FRT cassette, and the C-D downstream flanking region into one large amplicon, termed a “tripod” (Figure 3B).    As noted above, this PCR amplification should be performed using a high-fidelity Taq polymerase, such as Platinum Taq DNA Polymerase High Fidelity. In addition, rapid temperature ramping (> 3 °C/sec) is necessary for SOE PCR due to length of the tripod (approx. 2.5 kb) and difficulty annealing three DNA fragments into one tripod template.    For the SOE PCR reaction, we typically add 25 ng/500 bp of each first-round PCR product to the reaction and 0.2 µM of Primer A and D. Based on previous results, SOE PCR reactions require 30 to 40% more Taq polymerase to yield sufficient PCR product for subsequent cloning.   Recommended SOE PCR amplification conditions: 1. 94 °C 2 min -------------------------------- 2. 94 °C 30 sec 3. 40 – 42 °C 45 sec 4. 68 °C 3 min 30 sec  Repeat steps 2 to 4 6× -------------------------------- 5. 94 °C 30 sec 6. 42 – 48 °C 45 sec 7. 68 °C 3 min 30 sec Repeat steps 5 to 7 24× -------------------------------- 8. 68 °C 10 min 9. 4 °C hold  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150621/20150621021249_9801.jpg Figure 3. Tripod PCR amplication and cloning into pTP163. A. First-round PCR amplification of A-B upstream and C-D downstream flanking regions from F. tularensis genomic DNA and the FRT-Pfn-kan-FRT cassette from pLG66a. B. Second-round SOE PCR amplification to fuse the A-B upstream flanking region, FRT-Pfn-kan-FRT cassette, and C-D downstream flanking region into a tripod. C. Apa I restriction digestion of the tripod and suicide plasmid pTP163, Antarctic Phosphatase treatment of pTP163, and ligation to generate the KO plasmid.",
    "Following SOE PCR amplification, verify tripod length and purity by separating a portion of the SOE PCR reaction on agarose gels containing ethidium bromide. For the demonstration FTL_1839 KO construct, the expected tripod length is 2,484 bp. Correct length products should be purified using the QIAquick PCR Purification Kit. SOE PCR amplifications often result in multiple bands, thus the correctly sized product should be excised from the agarose gel and purified using the QIAquick Gel Extraction Kit. Troubleshooting notes:    Based on the overall tripod length (approx. 2.5 kb), the extension times in PCR Step 4 theoretically could be 2 min to 2 min 30 sec. However, we have found that longer extension times (3 min 30 sec) increase the tripod yield and reduce the amount of non-specific amplicons in the final PCR product.    We also have found that a suboptimal (2 to 6 °C lower than the Tm) annealing temperature in PCR Step 3, followed by an optimal annealing temperature in PCR Step 6 increases tripod yield and reduces the amount of non-specific amplicons in the final PCR product. We presume that less stringent assembly and replication of the tripod are necessary during the initial rounds of SOE PCR (PCR steps 2-4; Figure 3B) but that more stringent conditions are needed during the final SOE amplification steps (PCR steps 5-7; Figure 3B) for efficient and specific tripod generation. Annealing temperatures in PCR steps 3-6 need to be carefully optimized for each SOE PCR reaction.       Purify the suicide plasmid, pTP163   While completing steps 1 through 3 above, the suicide plasmid pTP163 (contains a hygromycin resistance gene and the sacB sucrose sensitivity gene (Robertson et al., 2013)) should be purified for cloning. pTP163 can be transformed and replicated in any standard E. coli cloning strain, such as DH5α.",
    "Bacterial stocks should be made in LB broth containing 15% glycerol and stored at -80 °C until use.    Plate a small scraping from the freezer stock onto LB agar plates containing 200 mg/L hygromycin (LB-hyg plates), incubate overnight at 37 °C, pick a single colony, inoculate into 5 ml LB broth containing 200 mg/L hygromycin, incubate overnight (O/N) with shaking, and purify pTP163 using the QIAprep Spin Miniprep Kit.     Apa I restriction digest of the tripod and pTP163 In this step, both the tripod (from step 3) and pTP163 (from step 4) are digested with Apa I for cloning (Figure 3C). To obtain enough product after restriction digestion, 2 µg of tripod and 2 µg of pTP163 should be added to each reaction. Restriction digest conditions are as follows: 2 µg DNA (pTP163 or tripod) 5 µl 10x CutSmart Buffer 0.5 µl Apa I (New England Biolabs, 50,000 units/ml, 25 units) Add molecular grade water to 50 µl total Incubate at 25 °C for 30 min Following the 30 min incubation at 25 °C, only the tripod digestion should be purified using the QIAquick PCR Purification Kit. Immediately proceed to step 6 with the Apa I-digested pTP163.   Antarctic Phosphatase treatment of pTP163   Immediately following 30 min of incubation at 25 °C, the Apa I digest of pTP163 should be heat-inactivated at 65 °C for 20 min. We have found that, following Apa I restriction digestion, heat inactivation of Apa I is needed to reduce pTP163 degradation.    Following heat-inactivation, pTP163 should be treated with Antarctic Phosphatase to avoid self-ligation (Figure 3C). Add the following Antarctic Phosphatase components to the heat-inactivated pTP163 tube as follows: 1 µl Antarctic phosphatase (5,000 units/ml, 5 units) 5.",
    "5 µl 10x Antarctic phosphatase reaction buffer Incubate at 37 °C for 1 h   Following Antarctic phosphatase treatment, purify pTP163 using the QIAquick PCR Purification Kit.     Ligate tripod and pTP163 To ensure successful ligation of the tripod and pTP163 (Figure 3C), we typically perform three separate ligations at the same time, with different ratios of tripod to pTP163 (e.g., 3:1, 2:1, and 1:1). Ligation conditions are as follows: 9 µl tripod (from step 5) and pTP163 (from step 6) mixture 1 µl 10x T4 DNA ligase reaction buffer 0.4 µl T4 DNA ligase (400,000 units/ml, 160 units) Incubate at 22 °C for 1 h   Transform KO construct into standard E. coli cloning strain Each ligation product should be transformed into an aliquot of a standard cloning strain of E. coli. We typically use NEB 10-beta competent E. coli. Transformation procedures are as follows:   Add 10 µl of each ligation product to 20 µl of competent E. coli.   Gently mix the cells and incubate on ice for 30 min.   Heat shock at 42 °C for 30 sec.   Place cells back on ice and immediately add 1 ml SOC medium (included in NEB 10-beta competent E. coli package).   Incubate the transformed cells at 37 °C with vigorous shaking for 1 h to recover.   Plate 500 µl of transformation onto a LB agar plate containing 30 mg/L kanamycin (LB-kan30 plate) and incubate O/N at 37 °C.     KO plasmid purification for diagnostic PCR and restriction digest   After overnight incubation, select up to five single colonies (depending on the number of colonies that grew on the plate) for plasmid purification and diagnostic screening.    Inoculate each colony into 5 ml of LB broth containing 30 mg/L kanamycin, incubate O/N with shaking at 37 °C and purify plasmids using the QIAprep Spin Miniprep Kit.",
    "We typically use GoTaq Green for diagnostic PCR. To confirm that kanamycin-resistant colonies contain A-B upstream flanking regions or C-D downstream flanking regions, diagnostic PCR is performed as follows (in this example, only the A-B upstream flanking region is amplified): 1 µl of 4 µM Primer A (0.2 µM final) 1 µl of 4 µM Primer B (0.2 µM final) 0.5 µl purified plasmid (100-150 ng) 10 µl 2x GoTaq Green Master Mix Add molecular grade water to 20 µl total PCR amplification should be performed following the manufacturer’s instructions.   To further validate that the kanamycin-resistant colony contains a full-length tripod, we typically perform diagnostic digestions of purified plasmids. Diagnostic restriction digest conditions are as follows: 500 ng purified plasmid 2 µl 10x CutSmart Buffer 0.5 µl Apa I  Add molecular grade water to 20 µl total Incubate at 25 °C for 30 min to 1 h   Diagnostic PCR and restriction digests should be verified by separating products on agarose gels containing ethidium bromide.     DNA sequencing to verify KO construct integrity Plasmids from Step 9 that are positive by diagnostic PCR and restriction digest should be sent for DNA sequencing to confirm integrity of the upstream and downstream sequences. This is critical to ensure that no mutations have been introduced into either upstream or downstream flanking regions. Given the relatively short length of A-B and C-D flanking regions, we typically perform DNA sequencing with pTP163-5’ and pTP163-3’ primers (Figure 4). Primer pTP163-5’ binds 117 bp upstream of the Apa I restriction site and primer pTP163-3’ binds 64 bp downstream of the Apa I restriction site.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150620/20150620200658_5843.jpg Figure 4. Sequencing primers used to verify KO construct integrity. Primers pTP163-5’ and pTP163-3’ are used to confirm the sequence integrity of the KO constructs.    Transform KO construct into E. coli strain S17-1 E.",
    "coli strain S17-1 is a donor strain for conjugative DNA transfer to Francisella strains. We prepare chemically-competent E. coli S17-1 as follows:   Plate a small scraping from the S17-1 freezer stock onto a plain LB agar plate (no antibiotics) and incubate O/N at 37 °C.   Pick a single colony, inoculate into 5 ml plain LB broth (no antibiotics) and incubate O/N with shaking at 37 °C.   Pellet the bacteria at 2,500 x g for 10 min at 4 °C.   Suspend the bacterial pellet in 8 ml of ice-cold 0.1 M CaCl2 and incubate on ice for 30 min.   Pellet the bacteria at 2,500 x g for 10 min at 4 °C.   Suspend the bacterial pellet in 800 µl of an ice-cold solution containing 0.1 M CaCl2 and 10% glycerol.   Prepare 50 µl aliquots and store at -80 °C until use. To transform chemically-competent E. coli S17-1, mix 20 µl of chemically-competent S17-1 bacteria with 1 µl of purified KO plasmid (approx. 250 ng; from step 9) and follow the same transformation protocol as outlined in step 8. Following the 1 h recovery, plate 100 µl of transformed E. coli S17-1 bacteria onto a LB-kan30 plate and incubate O/N at 37 °C. The next day, pick a single colony, inoculate into 5 ml of LB broth containing 30 mg/L kanamycin, and incubate O/N with shaking at 37 °C. The following day, a portion of the O/N growth should be stored at -80 °C in 15% glycerol while 500 µl of the O/N growth should be saved for conjugation (step 12).     Conjugation   F. tularensis preparation. At least 18 to 20 h before conjugation, plate F. tularensis onto a supplemented Mueller Hinton agar (sMHA) plate (Huntley et al., 2007) and incubate at 37 °C with 5% CO2.",
    "The day of conjugation, scrape all the F. tularensis growth from the sMHA plate and transfer to a 1.5 ml centrifuge tube containing 500 µl of sterile PBS. Using a P1000 (or equivalent) micropipettor, evenly suspend the bacteria in PBS.   E. coli strain S17-1 preparation. Using freshly grown overnight cultures of E. coli S17-1 bacteria from step 11, pellet 500 µl at 1,000 x g for 10 min at 4 °C and remove the supernatant. If your E. coli S17-1 needs to be grown from freezer stocks, we have found that it is best to first streak the bacteria onto LB-kan30 plates, then pick a single colony for O/N growth in LB broth containing 30 mg/L kanamycin. In our experience, E. coli S17-1 freezer stocks inoculated directly into O/N LB broth result in poor conjugation efficiencies.   Membrane filter placement. Using sterile forceps, place a 0.025 µM membrane filter in the center of a sMHA plate. Gently tap the membrane onto the agar surface to ensure contact.   Mixing F. tularensis and S17-1. Transfer 50 µl of the F. tularensis suspension from step 12a into the tube containing the E. coli S17-1 pellet from Step 12b. Using a P100 (or equivalent) micropipettor, gently pipet up and down 5 to 10 times to suspend the E. coli S17-1 bacteria and prepare a homogenous suspension with F. tularensis. Based on previous experience and bacterial enumeration studies, the ideal ratio of F. tularensis to E. coli S17-1 is approximately 10:1.   Conjugation incubation. Transfer the bacterial mixture from step 12d onto the center of the membrane filter from step 12c. Incubate the sMHA plate, membrane side up, at 30 °C with 5% CO2 for 16 to 24 h. The lower incubation temperature is necessary so that E. coli S17-1 will not overgrow F.",
    "tularensis during the incubation.     Conjugation recovery and selection for KO construct integration   Following 16 to 24 h of incubation at 30 °C, use sterile forceps to transfer the membrane filter to a 50 ml conical tube, and wash the bacteria off the membrane filter using 800 µl of sterile PBS.    Transfer the entire wash volume onto a chocolate agar plate containing 200 mg/L hygromycin and 100 mg/L polymyxin B and evenly spread the inoculum over the plate surface.    Incubate the chocolate agar plate upside down at 37 °C with 5% CO2 for 3 to 4 days, or until colonies begin to appear. The purpose of this step is to select against  E. coli S17-1 and select for F. tularensis colonies (F. tularensis is relatively resistant to polymyxin B) that have integrated the KO construct.     Kanamycin selection for colonies containing the KO construct When colonies are visible on the chocolate agar plate, pick individual colonies and streak onto separate quadrants of sMHA plates containing 10 mg/L kanamycin (sMHA-kan10). We typically pick up to 8 colonies for kanamycin selection. Incubate at 37 °C with 5% CO2 for 24 h. The purpose of this step is to select for colonies that have incorporated the suicide plasmid pTP163, including the KO construct, into the genome (1st recombination step).   Kanamycin and sucrose selection for colonies containing the KO construct   After 24 h of incubation, individual colonies are rarely visible. Bacterial growth from the sMHA-kan10 plates are transferred to sMHA plates containing both 10 mg/L kanamycin and 8% sucrose (sMHA-kan10-suc).    Better results are obtained when bacterial growth from the sMHA-kan10 plates is heavily streaked onto quadrants of sMHA-kan10-suc plates because this selection step is stringent and may kill many bacteria.    Single colonies likely will appear in 2 to 4 days on sMHA-kan10-suc plates.",
    "The purpose of this step is to force the release the suicide plasmid from the genome (2nd recombination step), resulting in either the deletion of the kanamycin resistance cassette (undesirable result) or your gene of interest (preferred result).    Only colonies that retain the suicide plasmid, and thus the sacB sucrose sensitivity gene, will be sucrose sensitive.     Replica plating to select for hygromycin-sensitive and kanamycin-resistant colonies After 2 to 4 days of incubation on sMHA-kan10-suc plates, colonies that are resistant to both kanamycin and sucrose are picked using toothpicks and replica plated onto two separate plates in the following order:   sMHA containing 200 mg/L hygromycin (sMHA-hyg; to ensure colonies are hygromycin sensitive)   sMHA-kan10; to ensure colonies are kanamycin resistant) Heavily streak individual colonies onto pre-labeled quadrants of each plate and incubate at 37 °C with 5% CO2 for 2 to 3 days. Sterile toothpicks are used in this step because the colonies are too small to be picked with inoculation loops. Only colonies that are kanamycin-resistant and hygromycin-sensitive should be considered as potential KOs. These colonies should be re-streaked onto fresh sMHA-kan10 plates, incubated for 1 day, suspended in sMHB, and stored at -80 °C until use. Troubleshooting note: Sucrose-resistant colonies (from step 15) that remain hygromycin-resistant (from step 16) do commonly occur and are the result of a suppressor mutation which confers sucrose resistance. Hygromycin-resistant colonies should not be further screened as they still contain the unresolved suicide plasmid. If all colonies are hygromycin-resistant following step 16, more single colonies should be selected from the sMHA-kan10-suc plates in step 15 and replica plated onto sMHA-hyg and sMHA-kan10, as described in step 16. If kanamycin-resistant and hygromycin-sensitive colonies still cannot be obtained following Step 16, we suggest starting over with conjugation (step 12).",
    "In our experience, conjugation can be repeated up to three times to increase the chances of selecting a KO. However, if kanamycin-resistant and hygromycin-sensitive colonies cannot be obtained after three conjugations, this likely indicates that your gene is essential.     Diagnostic PCR to confirm KOs   Diagnostic PCR should be performed to confirm that kanamycin-resistant and hygromycin-sensitive colonies from Step 16 are genuine KOs.    Genomic DNA should be prepared by placing a kanamycin-resistant colony in 50 µl of 50 mM NaOH, boiling the solution for 10 min, briefly centrifuging to pellet insoluble material, and transferring the supernatant to a new microfuge tube.    We typically perform 3 separate PCR reactions to verify that the kanamycin-resistant colonies are actual KOs (Figure 5).    Diagnostic PCR reactions are performed as described in step 9, typically contain 0.5 µl of genomic DNA, and include the following primer pairs: Primers A and D Primers A and Kan3’ Primers Kan5’ and D If your gene of interest has been deleted from the potential KO colony, all three primer pairs should amplify specific-sized targets from genomic DNA. However, if primer pair A and D are the only primers to amplify targets from the potential KO colony, then this colony is unlikely to be a KO. In our experience, it is unlikely that potential KO colonies (kanamycin-resistant, sucrose-resistant, hygromycin-sensitive) will be negative by all three primer pairs. However, PCR conditions do need to be carefully optimized to obtain amplicons with all three primer pairs.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150620/20150620200718_5367.jpg Figure 5. Diagnostic PCR to confirm KO candidates. Three pairs of PCR primers are used to confirm that your gene of interest has been replaced by a kanamycin resistance cassette: primer pairs A-D, A - Kan3’, and Kan5’ - D."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}