{
  "id": 11894,
  "origin_website": "Jove",
  "title": "Live-3D-Cell Immunocytochemistry Assays of Pediatric Diffuse Midline Glioma",
  "procedures": [
    "This protocol follows the guidelines of the institutions' human research ethics committees.\nNOTE: This study was performed using Incucyte S3 and/or SX5 Live-Cell Analysis Instrument (referenced as live cell analysis instrument).\n1. Generation of reproducibly sized tumor spheroids\nNOTE: The protocol (section 1) described by Vinci et al. 20157,12, was used as reported below, with some modifications:\nCollect the DMG H3K27M-mutant neurospheres (NS) and centrifuge at 170 x g for 10 minutes (min) at room temperature (RT).\nIncubate the NS with 500 µL of the accutase solution for 3 min at 37 °C to break them up.\nNeutralize the accutase solution with tumor stem cell (TSM) medium7 and centrifuge the cell suspension at 355 x g for 5 min at RT.\nResuspend the cell pellet in 1 mL of TSM medium and then count the cells using a cell counting chamber.\nDilute the cell suspension to obtain 2.5-5 x 103cells/mL and seed 100 µL/well into ultra-low attachment (ULA) 96-well round-bottom plates (see Table of Materials). Use a proper cell density to obtain individual NS of ~300 µm diameter, 4 days after cell seeding (250-500 cells/well for highly aggressive glioma cells).\nVisually confirm the NS formation by using an inverted microscope 4 days after cell seeding.\n2. Preparation of the ALR/antibody complex and setup for the invasion assay\nNOTE: For the antibody labeling procedure, the antibody labeling dyes protocol10 for live-cell Immunocytochemistry is used with some modifications, as reported below. For the invasion assay, the protocol previously described by Vinci et al. 201512 is followed.\nConsider the number of wells (e.g., 60 wells) to analyze and calculate the volume needed for each reagent. Also include the wells for the negative control (samples with ALR but without antibody).",
    "Add 100 µL of sterile water to the ALR to rehydrate the reagent (final concentration = 0.5 mg/mL). Pipette to mix the solution.\n\tNOTE: The reagent is light-sensitive; therefore, keep in the dark. Aliquot the leftover reagent and store at -80 °C (avoid freezing and thawing).\nMix the antibody with the ALR in the TSM medium (or appropriate cell growth media for the cell line of choice) in a round bottom multi-well plate or in an amber tube and protect from light.\nPrepare enough quantity of the medium to dispense 25 µL/well at 3x final assay concentration. Incubate at RT for 15 min.\n\tNOTE: A 1:3 molar ratio of antibody to ALR is recommended, with a final (1x) concentration of the test antibody <1.5 µg/mL. For the experiments in this protocol an anti-human CD44 mouse antibody is used (starting concentration 86 µg/mL) at a final concentration of 0.1 µg/mL (3x concentration = 0.3 µg/mL).Add the reagents in the following order: i) antibody; ii) ALR; iii) TSM medium. Mix by pipetting.\nDilute the background suppressor reagent (BSR) in TSM medium (or appropriate cell growth media for cell line of choice) at 1.5 mM (3x) to obtain at the end of the assay a final concentration of 0.5 mM.\nPerform the invasion assay directly in the ULA 96-well round-bottom plate where cells were initially seeded. Check the NS visually using an inverted microscope before starting.\nGently and slowly remove 75 µL/well of the medium, avoiding touching the bottom of the well where the NS sits. Check the presence of the NS visually.\nGently add 25 µL of the BSR to each well.\nGently add 25 µL of the ALR/antibody complex to each well. Wait 2 or 3 min to let the ALR/antibody complex mix with the medium.",
    "Check visually using an inverted microscope to ensure that each NS is centrally located at the bottom of the well. Avoid the formation of bubbles. If any bubble is present, remove it by using a needle.\nPlace the plate on ice and wait 5 min to let the bottom of the plate become cold.\nWith a pre-cooled p200 tip, dispense 75 µL/well of basal membrane matrix (BMM), placing the pipette tip on the internal wall of the well and avoiding touching the bottom of the well. Avoid the formation of bubbles and remove with a sterile needle the existing ones.\n\tNOTE: Make sure to have thawed the BMM at 4 °C from the night before.\nLeave the plate on ice for 5 min to let the BMM mix with the medium. Check visually using an inverted microscope the presence of the NS and that they are centrally located in the well. If not, centrifuge the plate at 4 °C at 180 x g for 5 min.\nTransfer the plate in the live-cell analysis instrument (Table of Materials) placed within the incubator at 37 °C, 5% CO2, 95% humidity.\n3. Preparation of the ALR/antibody complex and setup for the migration assay\nNOTE: For the antibody labeling procedure, the Labeling Dyes protocol10 for Live-Cell Immunocytochemistry is used.\nConsider the number of wells to analyze and calculate the volume needed for each reagent. Include also the wells needed for the negative controls. Check the NS visually using an inverted microscope before starting.\nUse flat-bottom 96-well plates. Perform the coating procedure as described by Vinci et al., 201314. For this study, the BMM is used as a thin coating.",
    "Once the coating is ready, remove the excess of BMM coating with a p200 tip placing the tip in the edge of the well and avoiding touching the bottom. If working with multiple wells, use a multichannel pipette.\nCut a p200 tip, take 50 µL of the cell medium + NS from each selected well, and transfer it to a coated flat bottom well. Check the presence and the position of the NS in each well visually.\n\tNOTE: Each NS must be centrally located in the well. Avoid leaning on the tip on the edge of the well during the transfer but drop the medium centrally in the well without touching the bottom. For highly migratory cells, consider a higher number of replicates than the standard three replicates. This is because when NS sits too close to the edge of the well, the migrating cells may cover a smaller area of the well.\nRehydrate the ALR as described above (steps 2.2-2.3).\n\tNOTE: Reagent is light sensitive. See above for good handling procedures.\nMix the antibody with ALR in the appropriate complete cell growth media in a round bottom multi-well plate or in an amber tube and protect from light. Prepare enough quantity to dispense 50 µL/well at 3x final assay concentration. Incubate at RT for 15 min.\n\tNOTE: Add the reagents in the order as indicated above (step 2.4).\nFollow the same procedure as reported in step 2.5.\nGently add 50 µL of the BSR to each well.\nGently add 50 µL of the ALR/antibody to each well. Wait 2 or 3 min to let the reagents mix and check visually using an inverted microscope to ensure that most of the replicate NS are centrally located in the well.",
    "Avoid the formation of bubbles and remove any existing ones by using a needle. Gently transfer the plate in the live-cell analysis instrument placed within the incubator at 37 °C, 5% CO2, 95% humidity.\n4. Live-cell analysis instrument setting for image acquisition\nScan the plates using the live-cell analysis instrument (for specifications, see Table of Materials) with scanning intervals starting from time point zero (t0) of the invasion and migration assays set up, respectively, after step 2.14. and 3.10. up to 96 h.\n\tNOTE: Ensure to be able to dispose of the live-cell analysis instrument immediately after the starting of the invasion and migration assay. Depending on the tumor type, cells can start to invade or migrate from the NS already within 1 h from the assay setup.\nOn the live-cell analysis instrument software, select the option Schedule to Acquire. Click on the + tab and select the option Scan on Schedule.\nOn the software window Create or Restore Vessel, click on the option New.\nSelect the specific application in the live-cell analysis instrument for the invasion and migration acquisition. Select Spheroid scan type, 4x objective, Phase+Brightfield and Green image channels for the invasion assay. Select Dilution Cloning scan type, 4x objective and Phase and Green for the migration assay.\nSelect the plate type and define the wells to be scanned by highlighting them on the plate map.\nSet up the scanning frequency (for the experiments in this protocol scanning frequency was 15 min for invasion and 30 min for migration).\nClick on Add to Schedule and start the scan.\n5. Live-cell analysis instrument setting for image analysis\nSelect the tab Create New Analysis Definition.\nSelect Spheroid Invasion or Basic Analyzer application for invasion and migration, respectively, on the tab.",
    "Select the invasion and migration appropriate channels (for Invasion: Phase+Brightfield-Green; for Migration: Phase-Green) in the image channel.\nSelect few representative images from 3-4 wells for previewing and refining the analysis setting.\nFor the invasion assay, in the Analysis Definition tab, adjust the application settings in the Brightfield and Green channels with the following setting to generate a precise segmentation between the Whole Spheroid and Invading Cells (see Figure 5; blue mask):\n\tBrightfield Segmentation: Whole Spheroid sensitivity = 50; Invading Cell sensitivity = 100; Clean Up = default.\n\tWhole Spheroid Filters: set all parameters as default.\n\tInvading Cells Filters: set all parameters as default.\n\tGreen Segmentation: Radius = 900.\nFor migration assay, adjust the application settings in the Phase and Green channels to generate a precise segmentation between the Confluence and Green Cells (see Figure 5, yellow and pink masks) with the following setting:\n\tPhase: set all parameters as default.\n\tGreen Segmentation: Radius = 300; Threshold = 1000\n\tCleanup: Hole Fill = 400; Filters = default.\n\tWhole Well: set all parameters as default.\nCheck that the analysis settings are correct for the NS by clicking randomly on several wells. The segmentation must outline the spheroid. If not, adjust the setting accordingly.\nSelect the wells and time points to analyze.\nSave the Analysis Definition and click on Finish.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}