{
  "id": 17362,
  "origin_website": "Jove",
  "title": "Transcorporal Artificial Urinary Sphincter Cuff Placement in a Case Requiring Revision for Urethral Atrophy",
  "procedures": [
    "The study was approved by the local Medical Ethics Committee of Shanghai Ninth People's Hospital in China. All of the studies were conducted in accordance with the World Medical Association Declaration of Helsinki. Written consent was obtained from the patient.\n1. Preparations\nMonitor the patient for the development of urethral injury or stricture under the long-term pressure of the original cuff through a flexible cystoscopy.\nEnsure that the device was determined to still function and that the recurrence of incontinence was caused by urethral atrophy according to physical examination, ultrasonography, and magnetic resonance imaging (MRI).\nAsk the patient to shower and wash the skin of the surgical region every day.\nEnsure that the urinary infection has been controlled before the operation twice through urine culture.\nEnsure that the preoperative anesthesia risk assessment of the patient has been performed by an anesthesiologist.\nAdminister an intravenous antibiotic preoperatively 30 min before the operation using 1.5 g of cefuroxime sodium with 100 mL of 0.9% sodium chloride solution.\nTo reduce the risk of infection, prepare 0.5 g of vancomycin in 500 mL of 0.9% sodium chloride solution for intraoperative antibiotic solution immersion and irrigation of AUS components.\nAfter general anesthesia, place the patient in the lithotomy position for good exposure to the surgical area.\nFor adequate disinfection of the surgical area, continuously disinfect the skin of the surgical area with iodophor for 15 min.\n2. Procedures\nRemoving the original AUS\n\t\nMake a 5 cm longitudinal incision on the middle line of the lower scrotum where the original cuff was placed, and expose the urethra and the components of the AUS.\nCut one side of the cuff using scissors and then remove it from the urethra.",
    "NOTE: The wound should be irrigated by 0.5 g of vancomycin in 500 mL of 0.9% sodium chloride solution.\nReimplantation of the new AUS\n\t\nSelect the new cuff site 2-3 cm distal to the original cuff site (Figure 1A). Subsequently, extend the incision distally, and expose the urethra and adjacent corporal bodies.\nDissect the urethra containing the bulbospongiosus muscle from the tunica albuginea of the corpora cavernosa and measure the urethral circumference. The circumference was much smaller than 4 cm.\nMake 2 cm longitudinal incisions on the tunica albuginea of the corpora cavernosa bilaterally 2 mm lateral to the urethra and deepen only until corporal spongy tissue is visible (Figure 1B, C).\nCreate a tunnel between the two corporotomies by blunt dissection, and measure the urethral circumference containing the tunica albuginea and bulbospongiosus muscle (Figure 1D).\nRemove the pump and water reservoir along the connecting tubes.\nPrepare the AUS components and make sure to expel air from the components thoroughly. Then, immerse all the components in the solution mixed by 0.5 g of vancomycin and 500 mL of 0.9% sodium chloride.\nPosition a new 4 cm cuff containing the tunica albuginea, bulbospongiosus muscle, and urethra.\nPlace the pump in the original scrotal disc space.\nOpen the external inguinal ring and create a retropubic prevesical space by blunt dissection using the index finger. Then, place the water reservoir into this space using sponge forceps.\nAfter filling with 22 mL of 0.9% sodium chloride solution, connect the whole device in the usual manner.\nSqueeze and release the pump bulb two to three times quickly and determine that all fluid has been removed from the cuff. After system testing, keep pressing the the metal buttom on the pump for several seconds to deactivate the device. Finally, place a 10 Fr catheter.",
    "Layer off each incision with 3-0 absorbable polyglactin sutures and dress the operative region with appropriate pressure.\n\t\t​NOTE: The tubes should be protected well by the mosquito hemostat jaws with the silicone tubing provided in the Accessory Kit. When using the hemostats, clamp jaws together only to the first click to prevent excessive pressure on tubes. When these tubes are being connected, each end should be washed with 0.9% sodium chloride solution to avoid antibiotic mixing.\n3. Postoperative care\nPostoperatively, administer an intravenous antibiotic to prevent infection: Mix 1.5 g of cefuroxime sodium in 100 mL of 0.9% sodium chloride solution, q 12 h, for 3 days and mix 1.0 g of ornidazole in 100 mL of 0.9% sodium chloride solution, q 24 h, for 3 days.\nRecommend a cold compress with ice bag to relieve the swelling pain of the wound in the first 6 h.\nRemove the catheter 24 h postoperatively.\nActivate the device at 6 weeks postoperatively. Meanwhile, do not allow the patient to use pads and recommend temporarily using a penis clamp for urinary continence.\n\tNOTE: Catheterization should be performed again with a 10 Fr catheter once the urine retention is observed after catheter removal.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}