{
  "id": 13553,
  "origin_website": "Jove",
  "title": "Structure-function Studies in Mouse Embryonic Stem Cells Using Recombinase-mediated Cassette Exchange",
  "procedures": [
    "All experiments on mice were conducted according to institutional, national, and European animal regulations.\n1. Isolation of RMCE-compatible KO mESCs\nBreed heterozygous KO mice with RMCE-compatible mice, such as ROSALUC mice10 or ROSA26-iPSC mice21. Both RMCE-compatible mice were maintained on a mixed 129/C57BL6/Swiss background.\n\tNOTE: Crossing with heterozygous KO mice is advised to overcome embryonic lethality in homozygous KO mice.\nUse PCR to select heterozygous KO mice containing an RMCE cassette in the R26 locus12.\nBreed RMCE-compatible, heterozygous KO mice with heterozygous KO mice and isolate RMCE-compatible, homozygous KO blastocysts.\n\t\nSet up time matings in the evening and check for copulation plugs the next morning.\n\t\tNOTE: Plugs are made of coagulated secretions from the coagulating and vesicular glands of the male. These plugs fill the vagina of the female and persist for 8 - 24 h after breeding. Plugged females are considered to be carrying 0.5 dpc (days post coitum) embryos.\n\t\t\nTo check for plugs, lift the female by the base of her tail and by examine her vaginal opening for a whitish mass. Spread the lips of the vulva slightly with an angled probe when the plug is difficult to see. Separate plugged females from their male.\nCollect blastocysts at 3.5 dpc.\n\t\t\nEuthanize pregnant females by the approved method (e.g., cervical dislocation). Make a midventral incision and dissect the uterus and oviduct (still attached to each other) using fine scissor and forceps.\nBend a 26-gauge needle into a 45° angle. Attach a 1-mL syringe filled with M2 medium to this bent needle and use it to flush the blastocysts from the uterus into the lid of a 10-cm dish.",
    "Insert the needle into the end of the uterus that is closest to the oviduct. Hold the needle in place with fine forceps while pushing the plunger; swelling of the uterus indicates a successful flushing.\nUse a mouth pipette (with a diameter of 100 - 200 µm) to collect all embryos and wash them twice in a drop of fresh M2 medium. Immediately after washing them, transfer the blastocysts to the culture plates (see below).\n\t\t\tNOTE: The dissection and handling of blastocysts of should be done in laminar air flow.\nIsolate RMCE-compatible KO mESCs\n\t\nPrepare a 12-well plate with mitomycin-C-treated DR4 MEFs (see the Table of Materials) one day before the blastocyst isolation.\n\t\tNOTE: These MEFs were isolated from Tg(DR4)1Jae/J mice that contain four drug-selectable genes and confer resistance to neomycin, puromycin, hygromycin, and 6-thioguanine22.\n\t\t\nCoat all culture plates with 0.1% gelatin. Add 0.1% gelatin to the culture plates, incubate for 5 min at 37 °C in 5% CO2, and aspirate the gelatin solution. Seed one quarter of a vial of P2 MEFs in a 12-well plate and grow them in 2 mL of MEF medium (see Table 1, the Table of Materials) to a confluent monolayer19.\nInactivate them with mitomycin-C (10 µg/mL) for 3 h and wash them twice with phosphate-buffered saline (PBS)19.\nUsing a mouth pipette, plate the blastocysts onto gelatinized 12-well plates (1 well/embryo), with the mitomycin-C-treated MEFs in SR-ES cell medium (2 mL/well) supplemented with either 2 µM pluripotin or with 2i (1 µM Erk inhibitor PD0325901 and 3 µM Gsk3 inhibitor CHIR99021). Incubate at 37 °C in 5% CO2.\nRefresh the SR-ES cell medium (supplemented with pluripotin or 2i) every 2 - 3 days.\nExamine each blastocyst under a stereomicroscope at 4.0X magnification and check for hatching and attachment to the MEF layer.",
    "NOTE: When blastocysts hatch, they lose the zona pellucida that encapsulates them. Wells with unattached blastocysts need to be refreshed using the mouth pipetting.\nPick individual ICM outgrowths (using a stereomicroscope) after 10 - 12 days of culture using a P10 pipette with disposable tips. Transfer the outgrowth in approximately 10 µL of medium to a V-shaped, 96-well plate containing 30 µL/well of PBS (at room temperature).\nAdd 50 µL of 0.25% trypsin to each well using a multichannel pipette and incubate for 3 min at 37 °C in 5% CO2.\nAdd 100 µL of FBS-containing mESC medium; dissociate the ICM outgrowths into single cells by pipetting 10-15 times; and transfer the dissociated cells to mitomycin-C-treated, 96-well MEF plates that were prepared one day before the ICM colonies are picked.\nFrom this step onwards, omit pluripotin or 2i from the mESC medium. On the next day, change the medium from FBS- to SR-containing mESC medium (100 µL/well).\nExpand the established mESC lines from 96- to 24-well format19.\n\t\t\nWash the cells with 200 µL of PBS, add 50 µL of trypsin, and incubate for 5 min at 37 °C in 5% CO. Add 100 µL of FBS-based mESC medium; dissociate by pipetting 10 - 15 times using a multichannel pipette; and transfer the dissociated cells to mitomycin-C-treated, 24-well MEF plates.\nChange to SR-based medium on the next day. Expand the mESCs in a similar fashion from 24- to 6-well format. Make 3 - 4 freezings from a confluent 6-well plate19.\nIdentify RMCE-compatible, homozygous KO mESCs using PCR primers for the R26 locus23 and KO allele of choice (in this case, p120ctn; PCRs for p120ctn null and floxed alleles were described before12).\nimgsrc://cloudfront.jove.com/files/ftp_upload/55575/55575table1.jpg",
    "Table 1. Culture Media. All media were stored at 4 °C and warmed to 37 °C 30 min before use.\n2. Generation of an RMCE-compatible Targeting Vector Using Recombination Cloning\nClone the rescue constructs into recombination-compatible vectors using restriction enzyme (RE)-based or PCR-based24 cloning techniques. Make sure that the cDNAs contain a stop codon.\n\t\nDesign AttB-tagged primers24. Ensure that the forward primer contains the following elements: a GGGG stretch, an AttB1 site, a linker, a Kozak sequence, and about 25 nucleotides of rescue cDNA (starting with its ATG). Make sure that the reverse primer has a similar composition: a GGGG stretch, an AttB2 site, a linker, and about 25 nucleotides of rescue cDNA (reverse complement).\nAmplify the rescue cDNA via PCR to obtain AttB-flanked cDNA.\nPerform a 10-µL BP reaction with 100 ng of AttB-flanked cDNA and 150 ng of recombination-compatible donor vector, which contains a kanamycin-resistance gene.\nTransform 5 µL of the BP mixtures in heat-shock-competent MC1061 Escherichia coli (E. coli) bacteria (similar to those described in step 2.3).\nIdentify colonies containing the correct rescue cDNA-containing vectors (similar to those described in step 2.4)\nPerform a 10-µL LR reaction using 100 ng of rescue cDNA-containing vector; 150 ng of Cre-excised pRMCE-DV1 vector11 (LMBP 8195); and 2 µL of recombinase mix, which contains a phage-encoded integrase and excisionase and a bacterial integration host factor. Incubate for 2 h at 25 °C.\n\tNOTE: An LR reaction is a recombination reaction in which an entry clone containing attL sites and a destination vector containing attR sites are recombined by the LR clonase enzyme mix. This results in an expression clone containing attB sites flanking the gene of interest.\nTransform 5 µL of the LR mixtures in heat-shock-competent MC1061 E. coli bacteria.",
    "Add 5 µL of LR mixtures to a ribbed, skirted, 2-mL screw-cap tube with 40 µL of heat-shock-competent E. coli bacteria and incubate for 20 min on ice. Incubate for 5 min at 37 °C.\nAdd 1 mL of Luria broth (LB) medium and incubate for 1 h at 37 °C. Plate 50 µL on ampicillin (Amp; 100 µg/mL)-containing agar plates and grow overnight at 37 °C.\nIdentify the colonies with the correct targeting vector.\n\t\nPick 5 colonies randomly using a p200 tip. Transfer the tip to a glass test tube containing 2 - 5 mL of LB medium and grow overnight at 37 °C.\nExtract the plasmid DNA from the bacterial cultures using commercially available kits.\nValidate them using RE digests and sequencing. Cut 0.5 - 2 µg of plasmid using 0.2 µL of RE (20 U/µL) and 1 µL of the corresponding 10x buffer in a 10-µL reaction. Incubate for at least 1 h at 37 °C and separate on a 1% agarose gel. Select for colonies with the predicted pattern of DNA fragments.\n\t\t\nAnalyze the confirmed vectors (50 ng/µL) with Tlox F (ATC ATG TCT GGA TCC CCA TC) and IRES R (GGG GCG GAA TTC GAT ATC AAG) primers (5 pmol/µL) using Sanger sequencing.\n3. RMCE-mediated mESC Targeting of Rescue Constructs to the R26 Locus\nStart a culture of RMCE-compatible KO mESCs and passage them at least twice on MEFs in FBS-based mESC medium. Split the mESCs on a gelatinized 6-well plate.\nOn the next day, refresh the cells, at about 50% confluency, with 1.5 mL of FBS-based mESC medium and transfect the mESCs with a Cre-excised pRMCE-DV1 targeting vector containing rescue cDNA.\n\t\nMake a DNA mix. Add 1 µg of targeting vector and 1 µg of FLPe-expression plasmid25 to 250 µL of pure DMEM medium.",
    "Make a lipofection mix. Add 7 µL of lipofection-based transfection reagent (e.g., Lipofectamine 2000) to 250 µL of pure DMEM medium and incubate for 5 min at room temperature (RT).\n\t\tNOTE: Similar RMCE targeting efficiencies were obtained using other lipofection-based reagents (e.g., Lipofectamine LTX and Effectene).\nMix the DNA mix with the lipofection mix and incubate for 20 min at RT. Pipette the transfection mixture onto the refreshed mESCs. Swirl gently and leave overnight.\nOne day after transfection, split all mESCs from the 6-well plate to a 10-cm culture dish with a confluent layer of DR4 MEFs and 10 mL of FBS-based mESC medium.\nTwo days after transfection, select mESC clones with the correct FLPe-mediated cassette exchange by adding 0.2 mg/mL G418 (100x) to the medium.\n\tNOTE: Make a kill curve for each batch of G418 to identify the lowest concentration of G418 that kills all mESCs.\nRefresh the mESCs daily with G418-containing mESC medium. Colonies should appear after 7 - 10 days, so pick and expand these as per step 1.4.\nConfirm the correct clones via PCR11.\n4. Differentiation of mESCs in Embryoid Bodies (EBs)\nStart a culture of KO mESCs with R26-driven rescue constructs and passage them at least twice on MEFs in FBS-based mESC medium. Passage the mESCs once on gelatinized 6-well plates to get rid of the MEFs.\nWash with PBS and trypsinize the nearly-confluent mESC cultures. Plate dissociated mESCs in different dilutions (1/20 and 1/40) onto non-adherent, bacterial-grade petri-dishes in differentiation medium.\nAllow EBs to form in these dishes for 30 days. Refresh the medium every 2 - 3 days using the following procedure: transfer the EB suspension to a 50-mL tube, let the EBs settle by gravity, remove the supernatant, add fresh medium, and transfer the EB suspension back to a bacterial-grade dish.",
    "Analyze the targeted mESCs and EBs by immunofluorescence and transmission electron microscopy using protocols that were described previously12.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}