{
  "id": 2656,
  "origin_website": "Cell",
  "title": "Protocol to Fabricate Engineered Illumination Devices for Optogenetic Control of Cellular Signaling Dynamics",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nStep 1: Solder LEDs onto PCB-1 Using Reflow Soldering\nTiming: 1 h\nIn this step, you will attach all of the LEDs onto PCB-1 via reflow soldering. Reflow soldering is a fast and simple way to attach surface-mount components to a circuit board. In brief, reflow solder paste is applied to the copper pads on PCB-1. The LEDs are placed on top of the paste and the board is heated on a hot plate to melt and solidify the solder. We recommend the following guide as a reference: https://www.build-electronic-circuits.com/reflow-soldering/[href=https://www.build-electronic-circuits.com/reflow-soldering/].\nUsing the soldering mask, apply reflow solder paste only to the grid pattern of the copper pads on PCB-1 (Figure 2[href=https://www.wicell.org#fig2]A). Make sure paste application is clean and there is no runoff connecting any pads. Clean up overflow with a paper towel if necessary.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/215-Fig2.jpg\nFigure 2. Workflow to Reflow Solder LEDs onto PCB-1 for the 24-Well LAVA Board Format\n(A) Representative image of soldering paste application to PCB-1.\n(B) Representative image of LED placement onto PCB-1.\n(C) Example of correct CLM1B Cree LED placement. Anode marking must face top left. For 24-well LAVA board, each well is illuminated with a cluster of five LEDs connected in series. Single LED circled in red.\n(D) Schematic of a single LED denoting proper orientation.\n(E) Schematic of solder pad placement on PCB-1. All dimensions are in inches.\nWith tweezers, place surface-mount LEDs onto the pads in the correct orientation (angled notch indicating anode must be on top left) (Figures 2[href=https://www.wicell.org#fig2]B−2D).",
    "Place PCB-1 onto the hot plate and heat on maximum temperature for 2–5 min. Inspect LED alignment and adjust with tweezers if necessary. Once you notice the solder paste turn a metallic color, wait an additional 1–2 min. Carefully and safely remove board from the hot plate and let cool at room temperature for 5–10 min.\nClean the solder mask with a paper towel and save for future use.\nCritical: Make sure to place the LEDs onto the pads in the correct orientation (anode left, cathode right).\nNote: If using LEDs other than the blue-light LEDs specified in the Key Resources Table[href=https://www.wicell.org#key-resources-table], they must be package PLCC-4 or PLCC-2. Note that the notch indicator standards may vary between manufacturers, so be sure to place the LED onto the pads in the correct orientation. We highly recommend testing a single LED prior to soldering the entire PCB-1 to ensure proper orientation.\nStep 2: Solder Through-Hole Components Using Standard Soldering\nTiming: 1 h\nIn this step, you will attach all of the through-hole components to PCB-1 and PCB-2 via standard soldering techniques. The placement for all remaining through-hole components is marked on PCB-1 and PCB-2. The component outline indicates the side (PCB top vs. bottom) onto which the component should be physically placed. The leads of the component pass through the matching holes, and the component is soldered on the opposite side from that on which it is physically placed. While soldering, make sure that each component is flush with the PCB.\nIf a component is accidentally soldered in the wrong orientation, it should be removed with de-soldering braid or a solder sucker and re-soldered correctly. We recommend this Sparkfun guide as a reference for soldering techniques: https://learn.sparkfun.com/tutorials/how-to-solder-through-hole-soldering/all[href=https://learn.sparkfun.com/tutorials/how-to-solder-through-hole-soldering/all]\nSolder the following electrical components onto PCB-1, ensuring proper orientation:\nFan terminal blocks (×3).",
    "Solder with the wire opening facing outward (as indicated in Figures 3[href=https://www.wicell.org#fig3]A and 3B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/215-Fig3.jpg\nFigure 3. Representative Images for the Step-by-Step Attachment of Each Electrical Component to PCB-1 via Standard Soldering Techniques\n(A and B) (A) Fan terminal block insertion and (B) orientation.\n(C) Female headers cut to the insert dimensions and every 4th pin removed.\n(D) Male headers with every 4th pin removed and inserted into female headers.\n(E−G) (E) LED Driver orientation with (F) top soldering, and (G) bottom soldering.\n(H) Male power and data transfer header orientation.\nLED driver (TLC5947).\nFirst, solder female headers onto PCB-1. You will need ×4 15-pin headers and ×1 6-pin header. To match the hole pattern, you will need to gently pull out every 4th pin from the headers with plyers (Figure 3[href=https://www.wicell.org#fig3]C).\nNext, prepare the male headers with every 4th pin similarly removed (Figure 3[href=https://www.wicell.org#fig3]D). Insert male headers (side with longer pins) into female header (Figure 3[href=https://www.wicell.org#fig3]E).\nPlace the TLC5947 LED driver through these male headers. Take care to ensure proper orientation of TLC4957 chip (Figure 3[href=https://www.wicell.org#fig3]E). Solder the headers (Figure 3[href=https://www.wicell.org#fig3]F).\nFlip PCB-1 and solder the bottom leads (Figure 3[href=https://www.wicell.org#fig3]G). Be sure not to short any of the connections.\nPower and data transfer headers (×2 4-pin male headers). Ensure correct placement of these headers and solder (Figure 3[href=https://www.wicell.org#fig3]H).\nSolder the following electrical components onto PCB-2, ensuring proper orientation:\nPower and data transfer headers (×2 4-pin female headers, as indicated in Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/215-Fig4.jpg\nFigure 4. Representative Images for the Step-by-Step Attachment of Each Electrical Component to PCB-2 via Standard Soldering Techniques\n(A) Female power and data transfer headers.\n(B and C) (B) DC barrel plug connector orientation and (C) attachment.\n(D) TRACO TSR 1-2450 power voltage regulator.\n(E) TRACO TSR 1-24120 power voltage regulator.",
    "(F) Female header orientation on bottom of PCB-2.\n(G) Raspberry Pi Zero W orientation at bottom of PCB-2 and attached via male headers.\nDC barrel plug connector (Figures 4[href=https://www.wicell.org#fig4]B and 4C).\n5V and 12V voltage regulators (TRACO power). Ensure polarity indicator (dot) lines up with indicator dot on PCB-2 (Figures 4[href=https://www.wicell.org#fig4]D and 4E).\nSPDT power switch (location marked on PCB-2).\nRaspberry Pi Zero W\nFirst, solder female headers onto PCB-2 (×2 20-pin female headers, as indicated in Figure 4[href=https://www.wicell.org#fig4]F).\nThen, place male headers into the soldered female headers. Place Raspberry Pi Zero W through these male headers (ensure proper orientation, as indicated in Figure 4[href=https://www.wicell.org#fig4]G) and solder the leads.\nLastly, secure the Raspberry Pi to PCB-2, and secure PCB-2 to PCB-1, using the hexagonal plastic standoffs (×8) and 2–56 screws (×16). Ensure that the corresponding headers mate together between PCB-1 and PCB-2.\nCritical: Ensure the correct orientation of each component before soldering. Take care not to short any connections while soldering leads with close proximity.\nStep 3: Attach Heat Sink to PCB-1\nTiming: 1–1.5 h\nIn this step, you will attach a heat sink to bottom of PCB-1. The heat sink acts to draw away and disseminate the heat generated by the LEDs. This is necessary for long-term use, to prevent overheating and increase device lifespan.\nAttach heat sink to the bottom of PCB-1 using Arctic Silver thermal epoxy.\nMix the two epoxy components together (1:1) and quickly apply a thin layer to heat sink (Figure 5[href=https://www.wicell.org#fig5]A) and bare copper region of PCB-1 (Figure 5[href=https://www.wicell.org#fig5]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/215-Fig5.jpg\nFigure 5. Representative Images to Attach Heat Sink to PCB-1\n(A and B) Activated epoxy addition to (A) heat block and (B) copper region of PCB-1.\n(C) Depiction of attachment orientation\nSandwich the head sink and PCB-1 surfaces (Figure 5[href=https://www.wicell.org#fig5]C).",
    "Make sure heat sink is centered and wait 1 h or more to solidify.\nCritical: Ensure no epoxy seeps through the vias onto the top surface of PCB-1. If it does, gently wipe away before epoxy solidifies.\nStep 4: Assemble Laser-Cut and 3D-Printed Components\nTiming: 1 h\nIn this step, you will begin to assemble the non-electrical components of the LAVA board. A schematic of the laser-cut base (Figure 1[href=https://www.wicell.org#fig1], part 9) is represented in Figure 6[href=https://www.wicell.org#fig6]A. Note that this part is not symmetric, and the square orientation indicator marks the left side of the base, as viewed by looking at the top of the LAVA device. A schematic of the laser-cut fan holder (Figure 1[href=https://www.wicell.org#fig1], part 15) is depicted in Figure 6[href=https://www.wicell.org#fig6]B. These custom laser-cut components are designed to compactly and efficiently house the electrical components and heat block.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/215-Fig6.jpg\nFigure 6. Schematics of Laser-Cut Components for LAVA Board Base Structure\n(A) Schematic of laser-cut base with color-coded depiction of each hole component.\n(B) Schematic of laser-cut fan holder with color-coded depiction of each hole component.\nAssemble LAVA board base\nOrient base (Figure 1[href=https://www.wicell.org#fig1], part 9) so that the indicator square faces left. Insert rubber foot pegs (×4) into base from the bottom, through the four larger holes (Figures 7[href=https://www.wicell.org#fig7]A and 7B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/215-Fig7.jpg\nFigure 7. Representative Images for Step-by-Step Assembly of LAVA Board Base Components\n(A and B) Rubber foot peg (A) part and (B) orientation from the bottom.\n(C) Vibration-damping mount orientation.\n(D) 8-32 set screw orientation.\n(E) Round metal standoff orientation.\n(F) Attachment of fans to laser-cut holder.\n(G) Fan orientation, arrow corresponding to air flow.\n(H) Attachment of fan block to base.\n(I) Fan block and base orientation with optimal wire cut length and exposure.",
    "Screw vibration-damping mounts (×4) onto the base (part 9) using 8–32 screws, through the four smaller holes (Figure 7[href=https://www.wicell.org#fig7]C). Then, screw round metal standoffs (×4, Figure 1[href=https://www.wicell.org#fig1], part 10) into each vibration-damping mount with an 8–32 setscrew (Figures 7[href=https://www.wicell.org#fig7]D and 7E).\nAssemble and attach fan components\nScrew the individual fans (×3, Figure 1[href=https://www.wicell.org#fig1], part 16) into the laser-cut fan holder (Figure 1[href=https://www.wicell.org#fig1], part 15) using 6–32 screws and nuts (Figure 7[href=https://www.wicell.org#fig7]F). Make sure the fan airflow arrow points in the correct direction and that wires face upwards (Figure 7[href=https://www.wicell.org#fig7]G).\nTrim fan wires to ~ 0.5” (1.5 cm) in length and use right-angle brackets and 8–32 screws and nut to attach fan holder (Figure 1[href=https://www.wicell.org#fig1], part 15) onto the base (Figure 1[href=https://www.wicell.org#fig1], part 9). With wire strippers, strip the end (~ 3 mm) of each fan wire (Figure 7[href=https://www.wicell.org#fig7]I).\nAssemble the walls of the LED driver cover (Figure 1[href=https://www.wicell.org#fig1], part 17) using superglue. The cover will be placed on top of the LED driver to prevent accidental shortage.\nCut the 80˚ LSD diffuser sheet to match the 3D-printed light guides. Cut one diffuser to fit between the two light guides (Figure 1[href=https://www.wicell.org#fig1], part 4, 4.5 × 3.0 inch) and one for the top light guide (Figure 1[href=https://www.wicell.org#fig1], part 2, 4.8 × 3.3 inch).\nStep 5: Attach the LAVA Electronics to the Remaining Hardware Components\nTiming: 0.5 h\nIn this step, you will attach all of the remaining electrical components to the LAVA board base and complete the hardware fabrication portion of the design.\nAttach PCB-1 and light guide to LAVA board base.\nPlace PCB-1 onto the ×4 metal standoffs (Figure 1[href=https://www.wicell.org#fig1], part 10).\nPlace bottom light guide (Figure 1[href=https://www.wicell.org#fig1], part 5) onto PCB-1, taking care to center it on the wells.",
    "Place ×4 8-32 screws through the light guide screw holes and screw into standoff, thereby sandwiching PCB-1 in between.\nInsert fan wires into the corresponding terminal block, ensuring correct orientation, and tighten set screw with small flathead screwdriver.\nAdd the intermediate diffuser (Figure 1[href=https://www.wicell.org#fig1], part 4) on top of the bottom light guide (Figure 1[href=https://www.wicell.org#fig1], part 5) and sandwich between the top light guide (Figure 1[href=https://www.wicell.org#fig1], part 3). Place the final diffuser (Figure 1[href=https://www.wicell.org#fig1], part 2) onto the top light guide. 3D-printed light guides should click together, though you may need to apply some force.\nPause Point: At this point, the LAVA board hardware components should all be assembled, and the hardware components of the device are complete. Step 6 can be completed at any time after device fabrication.\nStep 6: Software Control of LAVA Board\nTiming: 1.0–2.0 h\nIn this step, you will upload the device operating software to the LAVA board, calibrate the LED output, and configure the provided GUI for spatiotemporal control of blue-light stimulation. We have provided the general software to initialize the LAVA boards and communicate between the GUI and Pi to upload patterns of continuous light, light pulses, or light functions. If you wish to customize the light presentation further, you may need to design your own code/GUI to control the LEDs and Pi. There are many resources available for Raspberry Pi programming; however, we anticipate that the provided software and GUI to satisfy most user needs.\nFlash the operating software (OS) image to micro SD card.\nDownload the provided disk image (raspberrypi.dmg, 7.95GB file size) from https://github.com/LAVAboard/LAVA[href=https://github.com/LAVAboard/LAVA]\nInsert a blank 8 GB micro SD card into your computer.\nDownload a flash software. We recommend Etcher. https://www.balena.io/etcher/[href=https://www.balena.io/etcher/]",
    "Run Etcher and follow instructions to flash the OS disk image to the SD card. Be sure to select the correct target drive that corresponds to the SD card.\nInsert the micro SD into the Raspberry Pi. Power LAVA board and wait 1 min for the Pi to turn on. The LED light sequence will change (ex. B01 blinks), and you will see APPLE_PI WiFi network appear. If not, the SD card flash was not successful.\nNote: Alternatively, you can use the command line to flash the disk image to the SD card. You will need to unmount the SD card and reformat as FAT32. This may take some time. Once complete, eject the card and insert into the Raspberry Pi micro SD slot.\nLED light output calibration\nIn the following steps, the calibration script LED_calibration.py is run on the Raspberry Pi to calibrate the LED output. PWM values are sent to each well (starting with well A1, A2, etc.) and decrease sequentially from 4095 (maximum intensity) to 0 (off): 4095, 4000, 3800, 3600, 3400, 3200, 3000, 2800, 2600, 2400, 2200, 2000, 1800, 1600, 1400, 1200, 1000, 800, 600, 400, 200, 0. For each PWM value and each well, the illumination intensity should be recorded with a power meter. The script is configured to allow the user 20 s to align the power meter and 5 s to record each PWM measurement. These settings can be changed as desired by opening the LED_calibration.py and changing sleep() values.\nPower the LAVA device and connect to APPLE_PI WiFi network (password: raspberry)\nWirelessly SSH into the Pi. In Mac use Terminal, or in Windows download a BASH terminal (we recommend ubuntu, https://ubuntu.com/[href=https://ubuntu.com/]). Enter the following into the command line:\nssh pi@192.168.4.1[href=https://www.wicell.orgmailto:pi@192.168.4.1]\npassword = raspberry",
    "Stop the LED driver process on the Pi. Enter the following into the command line:\nhtop.\nrecord the PID corresponding to the LED driver (see “Command’ column”). Execute the following command, and substitute ‘PID’ with the recorded number.\nsudo kill PID.\nNow run the following python script. Run the internal python calibration code by entering.\npython LED_calibration.py\nTo view or modify this file, enter nano LED_calibration.py\nRecord the light intensity data for each PWM with a power meter. In the terminal, you should see the 12-bit PWM currently being executed.\nGenerate the calibration curve where the X-axis is PWM (0-4095) and Y-axis is measured light intensity (μW/mm2). Convert the light intensity recorded into μW/mm2 (depending on the area of the measurement probe). An example calibration data is depicted in Figures 8[href=https://www.wicell.org#fig8]A and 8B.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/215-Fig8.jpg\nFigure 8. Example CLM1B Blue LED Calibration Curve\n(A) Calibration curve for 24-well LAVA board with two different light guide thicknesses.\n(B) Calibration curve for a 96-well LAVA board. Light intensity recorded using a PM100D compact power and energy meter console (Thorlabs) with a standard photodiode power sensor (S120C, Thorlabs). Curve slope and y-intercept used in software design to designate individual well intensity.\nApply a linear trend and record the slope (m) and y-intercept (b) for later use.\nCritical: The calibration values (m,b) need to re-measured each time the hardware layout of the LAVA board is modified. For example, if LEDs of different colors or manufacturers are used or the light guide thickness or diffuser type is changed, the devices need to be re-calibrated.\nOptional: Change the name of the WiFi network (default is APPLE_PI).\nPower the LED board and connect to APPLE_PI WiFi network (password = raspberry).\nWirelessly SSH into Pi (see step 6.16c).\nConfigure the access point host software (hostapd) by entering\nsudo nano/etc/hostapd/hostapd.conf",
    "Change the ssid to desired WiFi name. Do not modify any other lines.\nUse the keyboard combination ctrl-O then “enter” to save the file, then ctrl-X to exit the nano text editor.\nReboot the Pi and you will see the new Wifi name appear. Enter\nsudo reboot\nNote: At this point, the LAVA device fabrication is complete. LAVA device illumination accuracy should be monitored every 3–6 months with a power meter. Re-calibrate if necessary (step 6.16)\nStep 7: Optogenetic Cellular Experiments with LAVA Boards\nTiming: variable, user defined\nThe LAVA boards are versatile, user-friendly devices that are useful for numerous optogenetic experiments in 24- and 96-well plate formats. The provided GUI (JarJarBlinks) offers precise control of LED light intensity and timing over the entire length of an experiment. LAVA boards can be placed directly in any standard incubator and can run for any duration of experiment. Typical LAVA boards last at least 6 months in an incubator environment and are easy to replace. In this step we will outline the GUI control of LAVA boards and generic protocols for continuous, pulsed, and dynamic optogenetic experiments.\nGUI control and pattern upload\nTurn on LAVA board and wait ~1 min for boot to complete.\nConnect to the LAVA board WiFi network (default = APPLE PI) and set up the wireless SSH connection at least once (see step 6.16c).\nYou can connect to the LAVA board just by selecting the Pi WiFi network (password = raspberry) from this point forward, no need to SSH.\nDownload JarJarBlinks.jar here https://github.com/LAVAboard/LAVA[href=https://github.com/LAVAboard/LAVA]\nOpen the JarJarBlinks application, choose the correct plate format, and enter the slope (m) and y-intercept (b) from the LED calibration (step 19b). Be sure to use the calibration values for the corresponding LAVA board format and light guide thickness.",
    "Configure the pattern to be uploaded.\nContinuous illumination: Choose the “Const” designation for each well of interest. Enter the light intensity I in the open column (default device rang from 0.0 – 20.0 μW/mm2).\nNote: continuous intensity above 2.0 μW/mm2 may exhibit cellular toxicity.\nPulsed illumination: Choose the “Blink” designation for each well of interest. Enter the Imin (typically 0.0) and Imax (experiment dependent). Enter the duty cycle (percentage of time “on” per period) and period (in seconds).\nNote: for CRY2 applications, the signal can be pulsed every 10 min, corresponding to the twice the half-life of cluster dissociation. If using another optogenetic system, make sure to characterize the association kinetics for your system to determine the minimum period necessary for your application. In comparison to continuous illumination, higher Imax intensities can be used for pulsed illumination while avoiding phototoxicity.\nComplex illumination patterns: Choose the “Func” designation for each well of interest. Enter the linear or sinusoidal function parameters of interest and for desired time interval. When complete, select “add” function. Multiple functions can be combined to generate complex temporal light patterns.\nUpload experiment pattern to LAVA board device by selecting the “Submit and Upload” button at the bottom of the screen.\nIf successful, the pattern should upload and appear within 5 s.\nBegin cellular experiment with optogenetic pattern. After seeding the cells on the recommended imaging plates (Key Resources Table[href=https://www.wicell.org#key-resources-table]), place the plate directly on the LAVA board when you want to begin illumination and place the device in the incubator for long-term culture.\nAfter illumination, end-point analysis, such as immunostaining, flow cytometry, or transcriptomics analysis, can be performed.",
    "Note: Java 8 or above must be installed on your computer to open the JarJarBlinks application. Additionally, we recommend storing the LAVA board outside of the incubator when not in use, although continuous storage inside the incubator is also possible."
  ],
  "subjectAreas": [
    "Biotechnology And Bioengineering",
    "Microscopy",
    "Cell Culture",
    "Cell Biology",
    "Signal Transduction",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}