{
  "id": 18050,
  "origin_website": "Jove",
  "title": "The Perinatal Asphyxiated Lamb Model: A Model for Newborn Resuscitation",
  "procedures": [
    "All protocols have been approved by the Institutional Animal Care and Use Committee (IACUC) by the State University of New York Buffalo. An illustration of the methodology depicting invasive and non-invasive monitoring is shown in Figure 1.\n1. Animals\nUse time-dated, Q-fever seronegative, pregnant ewes (mixed-breed, Suffolk-Dorset-Katahdin breed) with fetal lambs at 127–143 days gestation.\n\tNOTE: Sheep term gestation is 145 days and 127 gestation lambs behave like extreme premature infants.\n2. Pre-surgical Preparation\nWithhold food from the ewe 12 h prior to the surgery.\nSedate the ewe with intravenous (IV) diazepam (0.25–1.5 mg/kg) and ketamine (4 mg/kg).\nGuide the ewe into lateral recumbency on to a lift cart.\nMove the ewe to dorsal recumbency onto a V-top surgical table.\n3. Anesthesia\nNOTE: Prior to the caesarean section, the ewe is sedated with diazepam and ketamine and intubated followed by continuous inhalation of isoflurane (1–4%). Adequacy of anesthesia is monitored by evaluation of muscle tone and eye reflexes along with continuous monitoring of blood oxygen level with a pulse oximeter and the heart rate. During the instrumentation, lambs will be under the influence of maternal anesthesia and will also receive local anesthetic to sites of instrumentation.\nIntubate the ewe with a 10.0 mm cuffed endotracheal tube (ETT). Advance the ETT through the vocal cords 1–2 cm beyond the cuff. Inflate the ETT cuff and tie the ETT around the ewe's jaw to secure it in place.\nWhen the palpebral response is absent, adjust the isoflurane (2–3% is usually sufficient).\nProvide artificial breaths by conventional mechanical ventilation (CMV) with a fraction of inspired oxygen (FIO2) of 0.21. Set the ventilator to provide tidal volumes of 10–15 mL/kg.\nMonitor the oxyhemoglobin saturation continuously by a pulse oximeter placed on the ewe's tongue.\nMeasure the end-tidal carbon dioxide (EtCO2) with a capnograph.",
    "Adjust the FIO2 and CMV to maintain oxyhemoglobin saturation between 90 - 97% and exhaled CO2 between 35–45 mm Hg, respectively.\nSecure the ewe's limbs to the surgical table with surgical tie-downs.\nAdjust the surgical table to reverse Trendelenburg position to relieve pressure on the fetus.\nPlace an orogastric tube to decompress and drain gastric contents.\nSupplement IV fluid (normal saline or Lactated Ringers solution) at 10 mL/kg/h.\nPlace a rectal temperature probe to obtain continuous core temperature.\n4. Surgery\nNOTE: The cesarean section and fetal procedures are considered acute surgeries in which the animals are euthanized by administering sodium pentobarbital 100 mg/kg IV. Ewes are euthanized following the delivery of the lambs and the lambs are euthanized after the completion of the experiments. Euthanasia is confirmed by asystole. A secondary method of bilateral thoracotomy or exsanguination is also employed. In this case, the aseptic technique is not practiced during the surgery. Personnel still need to wear protective attire during animal contact.\nShave the wool from the ventral abdomen.\nUse the cautery to make a 15–18 cm abdominal skin-deep incision over the linea alba to expose the fascia.\nCreate a small opening into the abdomen using pressure with a blunt tipped hemostat.\nMaintain this opening while sliding a blunt tipped scissor into the abdominal wall.\nUse the scissors to complete the incision of the linea alba.\nLocate and exteriorize the fetal head within the uterus from the abdomen.\nHold the fetal head with one hand and use the cautery to make a 10 cm incision through the uterine wall (over the lamb's forehead). Ensure to avoid any cotyledons.\nUse Babcock forceps to clamp the layers of the uterus and placenta together at four opposing corners.\nExpose the lamb's head through the uterus and outside of the ewe's abdomen.",
    "Leave the Babcock forceps laying outside of the abdomen during the fetal surgery.\n5. Fetal Airway\nIntubate the partially exposed fetal lamb with a 3.5–4.5 mm cuffed ETT. Advance the ETT through the vocal cords 1 cm beyond the cuff.\nInflate the cuff and secure the ETT by tying an umbilical tape around the tube and then around the head.\nAllow excess fetal lung fluid in the ETT to drain passively by tilting the head to the side. This simulates egress of lung liquid during labor.\nOcclude the ETT to prevent gas exchange during gasping in the asphyxial period.\n6. Neck Vessel Instrumentation\nShave the wool and infiltrate 1–2 mL of subcutaneous bupivacaine hydrochloride (0.25%) at all incision sites.\nMake two 3 cm skin incisions on each side of the neck (approximately 6 cm distal to the head) adjacent to the trachea. The incisions should transverse the neck.\nPerform the incision using the cautery while tenting the skin, to avoid lacerating the deep tissue.\nSeparate the fascia using curved Kelly or mosquito forceps.\nIsolate the right internal jugular vein and right common carotid artery.\nPlace two 20 cm, 0 silk sutures under both vessels.\nAllow a (proximal to distal) space of 1 cm between the silk sutures.\nGently lift each suture that is around the vessel, superficially, to restrict blood flow and make a 1–2 mm transverse cut into the vessel using Iris surgical scissors.\nFor the carotid artery, insert one pre-flushed catheter (15–17 G) in the right carotid artery caudally towards the aortic arch for blood pressure monitoring and blood sampling.\nUse the proximal tie to ligate the artery completely.\nRepeat steps 6.3.2 - 6.3.3.\nInsert the pre-flushed carotid arterial catheter and use the distal silk suture to tie around both the artery and catheter with 3 knots.",
    "Use a similar technique, to insert one pre-flushed catheter (14–16 G) into the jugular vein, repeat steps 6.3.2–6.3.3, advance 7–10 cm caudally to rest within the thoracic inlet (towards the right atrium). This is used for fluid and medication administration as well as venous pressure measurements.\n\t\nCheck the catheter for patency with heparinized saline and then complete the suture tie around the vessel and catheter (with the proximal suture only) using 2–3 knots.\nInsert the second catheter (14–16 G) approximately 5 cm rostrally to collect blood from the cerebral circulation. Use the same cut for the placement of both catheters.\nRepeat step 6.5.1 as it pertains to the distal suture and catheter and then tie the silk sutures around the opposing catheter lines to secure them in place to prevent twisting.\nExtend the previously made incision into a T-shape (1–2 cm) on the left side.\nElevate the left carotid artery using opened curved hemostats.\nPlace a 2 mm perivascular flow-probe around the vessel to measure the blood flow.\nCover the flow-probe with a 1-cm flexible polymer sleeve to stabilize the probe in position.\nPlace the flow-probe cable line into the T-shaped incision, allowing the cable to run parallel with the vessel.\nClose the skin incision. Tie around the cable, and around a loop of the cable, to avoid restricting the flow if pulled.\n7. Great Vessel Instrumentation\nExtract the fetal lamb to expose the chest, and cover the exposed skin with polyethylene wrap to prevent heat loss.\nPlace the lamb in right lateral recumbency.\nPosition the left forelimb around the neck to expose the surgical site.\nInfiltrate 3 mL of bupivacaine hydrochloride (0.25%) along the 4th intercostal space and make a 6 cm skin incision using the cautery.",
    "Carefully pierce the intercostal muscle with blunt curved forceps, circle under the 3rd rib, and come out between the next intercostal space. Make sure not to injure the lung or the heart.\nOpen the clamp for a pre-cut piece of 0 silk and bring it through to encircle the rib.\nRepeat steps 7.4.1–7.4.2 to secure the suture under the 4th rib.\nClamp the ties around each rib. Gently pull up and insert a cotton-tipped applicator into the chest under the 4th intercostal space.\nUse the applicator stick to protect the chest contents while using the cautery to open the intercostal space in 1 cm for a final opening of 6 - 8 cm. Ensure that the lung is not caught in the rib ties.\nPlace a rib spreader into the chest-opening. Opening the chest will reveal the left upper lobes of the lung, the main pulmonary artery (PA) and the ductus arteriosus.\nUse 2 x 2 inch gauzes to envelop the lung and gently push any exposed tissue away from the surgical area.\nUse a small manual retractor to improve the field of view (if necessary).\nPlace an umbilical tape (1/4 inch width, 6 inches length) pre-soaked in amnion around the great vessels. Soaking the umbilical tape decreases friction (and injury) onto the vessel walls.\nUsing forceps, lift the pericardium and cut along the main pulmonary artery, taking care not to cut the vagal nerve. Use an applicator stick to keep the right atrium from interfering with a lateral cut of the pericardium along the vagal nerve.",
    "Using Gemini forceps, move the forceps slowly from the ductal/PA notch around and behind the left PA to \"encircle\" and emerge on the other side of the left PA. Many delicate tissues run under this area and proceed only if there is no resistance.\nWhen the tip of the forceps is observed, open only far enough to grab one end of the pre-moistened umbilical tape. Clamp with only 1 position clicked in place. It is possible that surrounding tissue could be caught in the forceps too, and if tightly clamped that tissue might be caught with the umbilical tape resulting in vessel injury.\nGently back out the forceps to pull the tape into position. This serves to open a space for the flow probe and helps to direct the insertion of the flow probes (Figure 2). Care to protect the notch portion of any vessel is imperative as this is the most fragile part of the tissue.\nPlace a 4–6 mm perivascular flow-probe by gently lifting the umbilical tape and guiding the (L-bracket) metal portion of the probe around the vessel along the established opening.\nDirect the tape toward the back of the probe to help seat the vessel in place and to visualize the end of the L-bracket thus allowing the sliding closure to be secured.\nMake sure the vessel is > 75% of the probe size to ensure a tight fit and accurate flow measurements.\nCarefully cut the end of the umbilical tape close to the probe and gently pull the other end to remove the tape from the vessel. The tape will interfere with measurements if not removed.\nApply ultrasound gel and adjust the probe and cable position to improve signal intensity and quality.",
    "Repeat steps 7.6–7.7.4 as it pertains to the placement of a 6 - 8 mm perivascular flow-probe around the ductus arteriosus.\nRemove any protective 2 x 2 gauze from the chest and allow the lung to re-position.\nPlace a new 2 x 2 gauze around each metal bracket of the flow probe to protect the lung.\nClose the chest in layers using a tapered needle and 2.0 synthetic monofilament suture. Secure the cables of the flow-probes to the outer skin with a loop using a cutting needle and 2.0 silk suture.\n8. Non-invasive Measurement\nAttach EKG leads at the right axilla, left axilla, and right inguinal area (three-lead EKG). Pre- and post-ductal arterial oxyhemoglobin saturation (SpO2) is monitored with a pulse oximeter placed on the right forelimb and either hindlimb, respectively. Secure a near-infrared spectroscope (NIRS) monitor over the forehead with sutures and an opaque dressing.\n9. Data Collection\nCollect and record data using a data acquisition software. Figure 1 illustrates invasive and non-invasive parameters including: arterial and central venous blood pressure, left common carotid, left pulmonary and ductal arterial blood flow, EKG, SpO2, NIRS, ETCO2.\n\tNOTE: The software and equipment set-up for data collection can vary and is beyond the scope of this article.\n10. Experimental Protocol\nOcclude and cut the umbilical cord, and move the lamb from the maternal abdomen to a radiant warmer.\nDuring the asphyxial period, insert an umbilical venous catheter for epinephrine administration (0.01–0.03 mg/kg IV, per NRP recommendations).\nInsert an umbilical arterial catheter to collect post-ductal arterial blood gases.\nMonitor the lamb for impending asystole, which can be defined as the absence of detected carotid flow and pressure.",
    "Ensure that adequate personnel is available and dedicate each person to the following tasks: (1) manage ventilation and the airway, (2) perform chest compressions, (3) administer medication, (4) draw blood samples, (5) lead the code.\nBegin resuscitation by providing positive pressure ventilation (PPV) with a T-piece resuscitator at pressures of 35/5 cm H2O. Initiate the 20 min timer for experimental resuscitation protocol.\nAfter 30 s of ventilation, begin chest compressions by placing the thumb and fingers of one hand on opposite sides of the chest.\nProvide chest compressions by squeezing the fingers and thumb together to a depth of approximately 1/3.\nAdminister epinephrine at 3-min intervals.\nContinue resuscitation efforts until return of spontaneous circulation or up to 20 min.\nAt return of spontaneous circulation, continuous IV fluids (5 cc/kg/hr) and fentanyl (0.5-2.0 mcg/kg/hr; titrated to effect), are given through the previously established jugular venous catheter. Following the 20 min resuscitation period, the animal is euthanized. If lambs do not achieve ROSC by 20 min, proceed with euthanasia. \nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}