{
  "id": 4625,
  "origin_website": "Bio",
  "title": "An Efficient Procedure for Protoplast Isolation from Mesophyll Cells  and Nuclear Fractionation in Rice ",
  "procedures": [
    "Prepare protoplast   Weigh 1 g cut leaves, removing the petiole (see Figure 1A).    On the flat glass, chop leaves into 0.5-1 mm strips with fresh razor blades or with flamed scissors without shredding.  Note: Strips don’t need to be very small to avoid the accumulation of excessive cell debris on the filter. Leaves can be easily cut using a plate surface like a petri dish.   Using a forceps, transfer immediately the plant material to a deep petri dish filled with washing solution WS1 (enough to cover the strips) and after gentle shaking (1-3 min by hand) remove all liquid by pipetting.    Add freshly prepared enzyme solution (ES). 5 ml of ES is generally used per 1 g of cut leaf material. Incubate 4-5 h in the dark, at room temperature, with gentle shaking (60-80 rpm) in the rotator.      Harvesting protoplasts    After the enzymatic digestion, transfer the digestion mixture to a 50 ml Falcon tube, add an equal volume of WS2 solution and shake vigorously by hand for 10 sec.    Release the protoplasts from undigested leaf tissue by filtering the mixture through 120 µm nylon mesh sieves on glass funnel into a round bottom tubes. Two sequential filtering steps, first using CX-60 (120 µm) and then CX-400 (38 µm), are sufficient for protoplasts being isolated from leaf tissue.  Note: We usually go through a 3 step filtration procedure when working with suspension culture material since the sieves clog quickly. The sieves are used in the order CX-60, CX-150 (104 µm) and finally CX-400.    Wash the protoplasts 3-5 times using 2 ml WS2 solution.    Spin, after each washing, the tube for 10 min at 50 x g. Discard supernatant and wash protoplasts again with 2 ml WS2 solution.",
    "After washing, collect the pellets by centrifugation at 50 x g for 3 min with a swinging bucket rotor and re-suspend in MMG solution for counting or in NIB solution for the Isolation of nuclei.      Evaluating the quality (viability) and counting the protoplasts   Evaluating the quality The protoplast isolation procedure often damages or kills a percentage of cells. To determine the viability of the cells, we used fluorescein diacetate (FDA) staining to estimate the percentage of viable protoplast (green protoplast) in a preparation.    Mix 0.25 ml of 0.05% fluoriscin diacetate (dissolved in acetone) with 20 ml of the appropriate isolation medium to make the ‘’stain’’ solution.    Pipete 0.25 ml of the protoplast suspension into 1.0 ml of the stain solution.    Swirl gently to mix and mount some of the protoplasts on a glass slide. First, look at the protoplasts using a 10 or 20 x objectives lens. Now view the protoplasts using the UV source (420- to 490 mn excitation). In the rice green tissue protoplasts, the chloroplasts could be easily identified by their typical chlorophyll autofluorescence under a confocal microscope, while they could not be clearly observed in etiolated protoplasts.   Observe at least 50 protoplasts and calculate the percentage of living cells. Multiply the estimate of number of protoplasts by this percentage to obtain an estimate of the number of living protoplasts.  Example: 5 x 105 protoplasts per milliliter multiplied by 0.95 viable protoplasts, equals 4.75 x 105 living protoplasts per milliliter. A good isolation will yield between 90 and 95 % viable protoplasts.    Counting protoplasts    Place a cover glass over the hemocytometer counting chambers.    Gently mix the protoplast sample thoroughly to insure a uniform distribution of the cells and withdraw a sample with a Pasteur pipet.",
    "Note: Dilute the sample if the cell count is greater than 107 cells/ml.   Examine at the appropriate magnification (100 x should work for the protoplasts) and count the number of protoplasts in four, appropriately-sized grids in each chamber.  Note: Include all cells touching the middle line along the left or top margin of a square, but not the right or bottom. At 100 x, a 1 mm3 square will fill the field.    Count a total of 16 grids from 4 chambers   Record the data in table 1 & 2 and calculate the number of cells per ml using the following equation (to be significant at the 5% level of confidence, the 8 counts cannot deviate more than 7% from the mean [Klein and Klein (1970)]): Cells/ml = Cells/square x 1 square/volume (mm3) x 1000 mm3/ ml x dilution factor  Table 1: Hemocytometer data table:",
    "﻿0,1\nGrid size counted,0.1 mm x _____ mm x _____mm\nvolume of grid counted (mm3),\nDilution (if any),\n  Table 2: Protoplast density in a partially purified suspension of Red cabbage protoplasts measured with a hemocytometer table:\n﻿0,1,2\nGrid,protoplasts grid-1,protoplasts ml-1\n1,,\n2,,\n3,,\n4,,\n5,,\n6,,\n7,,\n8,,\n9,,\n10,,\n11,,\n12,,\n13,,\n14,,\n15,,\n16,,\nmean +/- std,,\n      Isolation of nuclei    Re-suspend pellet at 106/ml of cold NIB in 2 ml eppendorf tube or bigger tubes.   Put on ice for 7 min.   Fill a large syringes with protoplasts and pass it 4 times through a 25G5/8 gauge needle.   Filter the lysate through 20 µm filter into a new tube. Centrifuge at 400 x g for 10 min.    Discard supernatant   Re-suspend in NIB + glycerol or SDS solution for SDS gel electrophoresis."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}