{
  "id": 18760,
  "origin_website": "Jove",
  "title": "The Rabbit Blood-shunt Model for the Study of Acute and Late Sequelae of Subarachnoid Hemorrhage: Technical Aspects",
  "procedures": [
    "Three month old female New Zealand rabbits weighing 2.5 – 3.5 kg were used for this procedure. The study was performed in accordance with the National Institutes of Health guidelines for the care and use of experimental animals and with the approval of the Animal Care Committee of the Canton of Bern, Switzerland (approval #105/13). All surgical procedures were performed under sterile conditions at the Experimental Surgical Institute of the Department of Clinical Research at Bern University Hospital in Bern, Switzerland. A veterinary anesthesiologist monitored the animals during surgery and throughout recovery.\n1. Animal Preparation, Positioning and Subclavian Artery Cannulation\nInduce general anesthesia in the rabbit with intramuscular injection of ketamine (30 mg/kg; Ketalar, 50 mg/ml) and xylazine (6 mg/kg; Xylapan 20 mg/ml) and control depth of anesthesia by checking the rabbit’s response to noxious stimulation (e.g., toe pinch). See 1.7 in case of positive response.\nPull down the lower lids of both eyes and apply a small amount of ointment to the eyelids to prevent dryness and further irritation.\nCatheterize the lateral ear vein with a 20 Gbutterfly venflon (20 G vascular catheter), fix with adhesive tape, and connect to a gravity bag containing 0.9% sodium chloride (500 ml/24 hr) and ketamine (40 mg/kg/hr) / xylazine (4 mg/kg/hr) for continuous intravenous (i.v.) anesthesia. Administer additional analgesics every 15 min i.v. (Fentanyl, 1 mcg/kg). Note: Avoid volatile gas anesthetics, which is associated with decreased CPP, increasing CBF, and decreasing cerebral metabolic rate for oxygen.11 Intravenous anesthetics provide more ideal characteristics for neuroanesthesia by preserving CBF and cerebral vasoconstriction,12 which is of uppermost importance when studying cerebral vasospasm. In addition, although mortality is increased in spontaneously breathing animals, it may better mimic the human situation of acute SAH.",
    "Provide oxygen (1 - 2 L/min) via a respiratory mask that allows end-tidal carbon dioxide (EtCO2) monitoring.\nInstall a 3 channel electrocardiogram (ECG).Place three subcutaneous electrodes in a triangular arrangement on the ventral side of the rabbit; specifically, place one electrode over the right midthoracic region (with distance to the sterile shaved field for the subclavian artery cannulation) and two electrodes in the lower abdomen distributed over both limbs.\nMonitor the depth of anesthesia every 15 min during surgery by following respiratory rate, heart rate (HR) monitored from the ECG signal, and reaction to noxious stimulation.\nIn case of positive response to noxious stimulation (toe pinch), adapt the depth of anesthesia by ketamine bolus (6 mg/kg) i.v. and xylazine bolus (0.05 mg/kg) i.v. and/or an additional analgesia bolus with Fentanyl (1 mcg/kg) i.v.\nFix the rabbit in a supine position on a body warming plate, tilting the head 20° down and turning it slightly contralaterally to the side on which the subclavian artery will be exposed.\napply eye ointment and prepare the area for surgery by shaving the hair over the right pectoral muscle around the middle third of the clavicle, and over the frontal-, parietal- and occipital skull, the neck, and over the right common femoral artery.\nDisinfect the skin for 3 min with a broad spectrum antiseptic, e.g., Povidone-iodine.\nCover the rabbit with sterile sheets. Perform all further procedures under sterile conditions and frequently apply 4% papaverin HCl and antibiotic solution (neomycin sulfate 5 mg/ml) topically to prevent arterial vasospasm by vessel manipulation and local infections.",
    "Infiltrate the pectoral muscle with local anesthetics (Lidocaine 1% maximal 6 mg/kg). Make a parasternal skin incision and prepare the pectoral muscle. Using the microscope, dissect the subclavian artery and secure with a proximal and distal ligature (4-0 polyfilament sutures) around the exposed end. Keep one ligature close to the proximal control in place to secure the catheter and ligate the vessel distally.\nPerform an arteriotomy in the wall of the subclavian artery by incising the artery with a curved microscissor and cannulate the subclavian artery retrogradely with a small intravasal 3-way stopcock. Secure the catheter by double knot ligature towards the distal ligature in order to prevent arterial twisting or bending of the proximal part of the artery and to avoid slippage or massive bleeding.\n2. Blood Pressure and Arterial Blood Gas Monitoring\nConnect the 3-way stop cock to i) the intravasal cannula for arterial blood gas (ABG) analyses, pH, PaCO2, PaO2, bicarbonate, base excess, and SO2, ii) the invasive arterial blood pressure measurement device, and iii) the shunt device.\nCollect blood samples for ABG status (PaCO2, PaO2) and continuously monitor standard cardiovascular and respiratory parameters (blood pressure, HR, ECG, respiratory rate and end-tidal CO2) and transfer data via the analog output interface to an analog–digital converter/data logger and store.\n\tNOTE: The pressures will be zeroed at heart levels before and after each session, and pressure calibration of the analog/digital-converter and data-logging system will be done once before the series starts.\n3. Baseline Digital Subtraction Angiography\nPlace an external sizing device (small sphere) over both mandible angles in order to calibrate the angiogram.\n\tNOTE: This allows exact comparison of post hoc measurements of baseline and follow up vessel diameter.",
    "Perform digital subtraction angiography (DSA) by retrograde intra-arterial bolus injection of non-ionic Iopamidol (0.6 ml/kg, 5 ml/sec for 2 sec) through the cannulated artery and flush the cannula immediately after bolus injection with saline in order to prevent occlusion of the latter.\nObtain images (7 images in 14 sec) of the vertebrobasilar system using a rapid sequential angiography recording in a 5° left-anterior oblique position.\nInfiltrate the area around the right common femoral artery with local anesthetics (Lidocaine 1%, maximal 6 mg/kg). Make a small inguinal skin incision. Using the microscope for visualization, dissect the common femoral artery and secure with a proximal and distal ligature (4-0 polyfilament sutures) around the exposed end.\nAfter arteriotomy, cannulate the femoral artery with a 5-F sheath. Flush the side port of the sheath with saline.\nAdvance a 5-F catheter into the brachiocephalic artery through the sheath under fluoroscopy. Create a road map, then advance a guide wire to the vertebrobasilar system. Inject a bolus of non-ionic Iopamidol (0.6 ml/kg, 5 ml/sec in 2 sec) for DSA as described in step 3.2.\n4. Rotation to Prone Position\nFollowing baseline DSA, reposition the rabbit from supine to prone position. Be careful not to manipulate or relocate the position of the intra-arterial catheters.\nPosition the head in a head-holder at a 30° angle, oriented head down.\n5. Cisterna Magna Puncture\nDisinfect the skin over the head and neck with Povidone-iodine 3 times for 1 min each, and cover the surgical area with sterile sheets.\nInsert a 22 G x 40 mm pediatric spinal access needle transcutaneously into the cisterna magna without any prior skin incision or muscle displacement.",
    "Confirm that the animal is fully anesthetized by ensuring a lack of toe-pinch response before sliding the needle down along the bony external occipital protuberance until a gap is detected; do not push the needle any further.\nConfirm the correct positioning of the needle by observing spontaneous dripping of cerebrospinal fluid with the rabbit’s head tilted down at a 20° angle for a few min.\n6. Installation of Intracranial Pressure and Cerebral Blood Flow Monitoring\nAfter midline skin and galea incision, insert a small surgical retractor.\nMake three round osteotomies (2 mm diameter) using a high-speed microdrill in the frontal part of the skull according to the outer skull landmarks (Figure 1)9, i.e., over the olfactory bulb and bilateral frontal for placement of a neuromonitoring device if necessary. Use a millimeter scale ruler to determine the coordinates for burr hole placement as follows: Intracranial pressure (ICP) monitoring in the midpupillary line, one to two mm from the midsagittal line; intraparenchymal laser-Doppler probes four to five mm anterior and lateral to the bregma (Figure 1).\nVisualize the dura, and perform meticulous hemostasis: use bone wax for bone hemostasis by virtue of its tamponade action and perform local hemostasis using bipolar coagulation of the dura.\nPlace the intraparenchymal intracranial pressure (ICP) monitor tip into the right olfactory bulb to a depth of 2 mm and then calibrate.\nPlace the two laser-Doppler flowmetry fine needle probes using an external clamp system and insert them into the corresponding burr holes in both the right and left frontal hemispheres lateral to the ventricular system, i.e., in the midline to avoid interference with cerebrospinal fluid. Place needle probes to a depth of 2.5 mm.",
    "After placement of the neuromonitoring probes, seal all burr holes with a thick plug of bone wax in order to keep the cranium fluid-tight.\nMeasure baseline parameters of mean arterial blood pressure (MAP), ICP and cerebral blood flow (CBF)using a multiparameter monitor and four channel laser-Doppler tissue blood perfusion monitor.\n7. Shunt Induction\nConnect the spinal access needle in the cisterna magna to the previously catheterized subclavian artery via blood-filled pressure monitoring tubing. Use the 3-way stopcock for blood pressure measurement and as blood sampling port.\n\tNOTE: The severity of SAH depends on the amount of blood, and can be roughly estimated by the extensiveness of subarachnoid clots at the time of brain harvest5,11.\nContinuously monitor MAP, HR, ECG, respiratory rate and end-tidal CO2 at a sampling rate of 1 Hz from 6 min before until at least 20 min after SAH.\nConfirm that the animal is fully anesthetized by ensuring a lack of toe pinch response before opening the shunt connection between the subclavian artery and the cisterna magna to induce SAH by the pressure gradient.\n\tNOTE: A controlled SAH can be achieved by closing the shunt at any time point (e.g., at a desired level of ICP).\nRecord steady state values during a time period of approximately 15 min.\nAfter ICP reaches its peak, keep the spinal access needle in place until ICP returns to a steady state close to baseline values. If the ICP plateau is maintained for more than 10 sec or if ICP decreases spontaneously, close the shunt.\nRemove CBF fine-needle probes and ICP probe, plug burr holes with bone wax, remove all catheters (including subclavian catheter, since catheter manipulation with consecutive bleeding is associated with high morbidity and mortality, and increases infection rate), perform rigorous wound irrigation with Neomycin sulfate and suture the skin.",
    "8. Postoperative Management\nThe procedure lasts for about 2 hr. Due to the half-lives of ketamine and xylazine, the recovery time of the animal is quite short -- approximately 1 hr. The animals are kept under a heating lamp during recovery. Additional fluids are not provided. During this initial postoperative recovery phase, apply buprenorphine 0.02 mg/kg s.c. every 8 hr for 24 hr.\nApply transdermal fentanyl matrix patches releasing 12.5 μg/hr in the shaved neck region of the animals for effective analgesia over the next 72 hr.\nDo not leave an animal unattended until it has regained sufficient consciousness to maintain sternal recumbency.\nDo not return an animal that has undergone surgery in the company of other animals until fully recovered.\n9. Follow up Digital Subtraction Angiography to Assess DCVS at Day 3\nPerform Steps 1.1 to 3.6 as described above.\nEuthanize the animals by intraarterial bolus injection of sodium thiopenthal (40 mg/kg) (Pentothal, Ospedalia AG, Hünenberg, Switzerland). In cases where histology and immunohistochemistry is needed, perform an intracardiac perfusion-fixation at RT at a perfusion pressure of 100 cm H2O.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}