{
  "id": 8565,
  "origin_website": "Jove",
  "title": "Surface Electromyographic Biofeedback as a Rehabilitation Tool for Patients with Global Brachial Plexus Injury Receiving Bionic Reconstruction",
  "procedures": [
    "The clinical implementation of this rehabilitation protocol was approved by the ethics committee of the Medical University of Vienna (ethical vote number: 1009/2014), Austria and carried out in accordance with the standards set by the Declaration of Helsinki. All patients provided written informed consent to participating in this study.\nNOTE: Previous publications by Aszmann et al.7 and Hruby et al.8,13 are available describing the concept, treatment algorithm, and psychosocial prerequisites regarding bionic reconstruction in great detail. Table of Materials references all materials and equipment used in the proposed rehabilitation protocol.\n1. Patient assessment upon initial consultation\nFor all steps of patient assessment, rehabilitation and training, find an office or examination room, where the patient is alone in a quiet atmosphere without disturbances. Make sure to have enough space to examine the patient and to set up the sEMG biofeedback system.\nObtain a detailed case history from the patient including injury mechanism and first care, reports on previous nerve repair surgeries, and subjective disability in day-to-day life.\nConsider only patients for bionic reconstruction with failed biological treatment alternatives (i.e., nerve repair, nerve transfers, secondary reconstructions resulting in futile upper limb function). Exclude patients with simultaneous damage to the central nervous system, unstable fractures of the affected limb, untreated and/or resilient mental health problems, drug addiction, lack of compliance and commitment to adhere to a long-lasting rehabilitation program.\nPerform a detailed clinical examination focusing on the current upper limb function. Clinically assess the function of all major muscles in the affected arm and hand using the BMRC grading scale.\nAssess in a multidisciplinary team consisting of reconstructive surgeons, orthopaedic surgeons, physiatrists, psychologists and physiotherapists whether biological treatment alternatives are possible. Explain to the patient that the functionality of a myoelectric prosthesis can by no means compare with that of a biological hand.",
    "Ask the patient about his/her motifs and perspectives on bionic reconstruction (see a previous publication13 including the structured interview with a psychologist to assess whether a patient is psychosocially fit to go through the process of bionic reconstruction).\nAssess whether Tinel signs can be elicited along the neural axis of the major peripheral nerves indicating the presence of viable axons suitable for nerve transfer surgery.\nApart from the patient assessment, also vaguely outline a possible timeline of the whole process, which depends on the availability of detectable EMG signals. If other interventions, such as psychological support, posture training, and/or strengthening of the remaining muscles are indicated, start them as soon as possible.\n2. Identification of sEMG signals\nSet up a system for sEMG biofeedback on a table in a quiet room. This can be a stand-alone device, or one connected to a computer. If a computer is used, connect the EMG device with the computer by plugging in all cables and start the appropriate software on the computer.\nTo reduce impedance, prepare the patient’s skin by carefully shaving the respective body part and/or by gently removing dead skin cells with a peeling gel or a wet paper towel.\nShortly explain the functionality of the EMG device and associated computer software to the patient.\nPosition the patient in front of the computer screen.\nAsk the patient to think of hand movements and simultaneously attempt to contract the muscles intended to perform a specific action (such as extending the wrist, making a fist, flexing the thumb, etc.), even if this will not result in real movement of his functionless hand. Palpate his/her forearm for (weak) muscle contraction.",
    "Place a sEMG electrode on the exact skin position, where muscle contraction can be palpated with the finger, e.g., on the dorsal extensor compartment 5 cm distal to the elbow joint when asking the patient to think of extending his/her wrist and fingers.\n\tNOTE: While sEMG activity may be detected with wet and dry electrodes, dry electrodes are prepared for testing as these can be easily moved on the skin to check for optimal positions.\nRepeat the motor command used before (i.e., extension of wrist and fingers) to elicit contraction of the muscle.\n\t\nObserve the EMG signal on the computer screen and see if the amplitude consistently increases when the patient attempts to contract the muscle intended to perform a specific action (i.e., extending the wrist and fingers).\nIf the amplitude is not high enough (less than 2−3 times of the background noise12) or the signal is inconsistent, try other motor commands with the same electrode position and see if higher amplitudes can be obtained.\nRepeat the procedure for a different muscle or muscle group. For example, move the sEMG electrode to the volar aspect of the forearm, placing it on the pronator teres muscle, and ask the patient to attempt pronating his/her forearm. Observe the signal on the computer screen and see if the amplitude repeatedly increases when the patient thinks of this movement.\n\tNOTE: In some patients, no muscle activity is palpable. Here, three or more sEMG electrodes should be placed on the volar, dorsal and radial aspect of the forearm and various motor commands should be attempted, closely observing all signals for amplitude changes even with the slightest changes in electrode positioning (see Figure 1).\nimgsrc://cloudfront.jove.com/files/ftp_upload/59839/59839fig01.jpg\nFigure 1: Screenshot of EMG signals on a computer screen.",
    "To identify EMG activity, two or more electrodes can be placed on a patient's forearm asking him/her to attempt various movements. In this specific case, the electrode on the volar aspect of the forearm senses EMG activity as reflected by the first, red wave displayed on the computer screen, when the patient attempts to close his/her hand. Signal separation in this patient is satisfying, since the blue signal, which corresponds to the second electrode placed on the dorsal aspect of the forearm, does not reach the threshold. When the patient thinks of opening the hand, the amplitude of the blue signal exceeds the threshold, while the red signal remains almost inactive. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/59839/59839fig01large.jpg]\nAlso try motor commands and electrode positions that differ from the \"normal\" anatomy as aberrant re-innervation and extra-anatomical reconstructions as in nerve transfers have altered the neural input to the partially denervated muscles.\nIf no muscle activity is found in the forearm, repeat the procedure on the upper arm and shoulder girdle.\n\tNOTE: In some patients, no sEMG signals are found. In these, nerve and muscle transfers need to be performed to establish new EMG signal sites (the detailed surgical concept may be found elsewhere7), delaying signal training for 6−9 months. For dexterous prosthetic hand control at least two separable EMG signals are needed.\n3. sEMG-guided signal training\nNOTE: The training sessions for sEMG-guided signal training should not exceed 30 min as this leads to muscle fatigue, which is hindering successful motor learning. The described steps need to be repeated over an extended period of time to ensure good neuromuscular coordination as needed later for reliable prosthetic control.",
    "As soon as two or more EMG signals have been identified, encourage the patient to activate them alternately (see Figure 2A). To reliably drive a prosthesis, the independent EMG signals need to be controlled without interference.\n\t\nAdjust the voltage gain of each signal independently to achieve a similar amplitude threshold for all signals during training, which will make signal separation and comprehension easier for the patient.\nRepeat and explain to the patient the mechanics of a prosthetic hand: slight muscle contraction will ultimately lead to improved signal separation and must be preferred over muscle strength, i.e., a signal’s amplitude.\nimgsrc://cloudfront.jove.com/files/ftp_upload/59839/59839fig02.jpg\nFigure 2: sEMG-guided rehabilitation for patients with bionic hand reconstruction.\n(A) With direct visualization of muscle activity, various motor commands may be attempted to identify the highest EMG amplitude over a specific target muscle and different signal positions can be compared. (B) Using a table top prosthesis, the EMG activity in a patient’s arm is directly translated into prosthetic function. (C) The fitting of a hybrid prosthetic hand allows the patient to visualize and comprehend future prosthetic hand use. (D) After prosthetic reconstruction, EMG signals can be trained and optimized either with sEMG biofeedback or with the prosthetic hand itself. This figure has been modified from Sturma et al.12 and reproduced with permission from Frontiers in Neuroscience. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/59839/59839fig02large.jpg]\nObserve the EMG signals on the computer screen and make the patient aware whether the two signals are co-activated when attempting a specific movement. Explain to the patient that two signals should not be co-activated during the attempt of one specific action, as each EMG signal is linked to a specific prosthetic action. Co-activated signals will therefore not result in the action desired by the patient.",
    "Instruct the patient to try different (slight) movements and observe which precise movement patterns are the best ones in regard to signal separation. Encourage the patient to train these movements.\nLet the patient know that perfect signal separation is unlikely at the beginning of the training but will improve with a high number of repetitions.\n\tCAUTION: Allow phases of relaxation as muscle strength may decrease faster in patients with complex nerve injuries and faint myoactivity.\nWith improved signal consistency, instruct the patient to generate a higher signal amplitude to further strengthen the muscle and its signal.\nWith consistent EMG signal separation and solid control, install a table top prosthesis connected to the corresponding EMG software and the electrodes placed on the patient's forearm/arm. This will directly translate EMG activity into mechanical prosthetic function (see Figure 2B and Figure 3).\nimgsrc://cloudfront.jove.com/files/ftp_upload/59839/59839fig03.jpg\nFigure 3: Patient in front of a table top prosthesis and screenshot of his two signals on a computer screen.\nOn the patient's forearm, two electrodes sense EMG activity. These two signals are displayed as color-coded graphs on the computer screen (red and blue) and are simultaneously translated into prosthetic movement, allowing the patient to comprehend the relationship between signal quality and prosthetic control. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/59839/59839fig03large.jpg]\nEducate the patient that myoelectric prostheses with direct control use the input of one electrode (i.e., the muscular activity detected from one electrode) to control one prosthetic movement.\nMake the patient aware of the correlation between the signal's appearance (mostly amplitude height) on the computer screen and the speed/strength of the prosthetic movement, in case a device with proportional control of movement speed is chosen.",
    "NOTE: Depending on the number of available EMG signals and the degrees of freedom of the final prosthetic device, it might be necessary to use methods for switching between these degrees of freedom. One frequently used method of switching between degrees of freedom (e.g., hand open/close to pronation/supination) is via the simultaneous contraction of two muscles, also known as co-contraction14.\nTrain co-contraction. Let the patient observe the EMG signals on the computer screen and the prosthesis. If the prosthetic device does not move, i.e., open/close during co-contraction, the patient is doing it correctly.\n4. Hybrid hand fitting and prosthetic training\nMark the electrode positions on the patient’s skin, which have been defined as optimal for reliable prosthetic control and let an orthopedic technician manufacture a preliminary prosthetic socket designed with these exact electrode positions.\nMount a hybrid prosthetic hand with the individually tailored socket onto or below the functionless \"plexus\" hand (see Figure 2C).\nSimultaneously run the EMG software program to make the patient aware of his/her actions.\nAlternately train different prosthetic movements. Electrodes may also be placed on adjoining muscles along the upper arm and shoulder girdle to avoid unconscious co-contractions, which will lead to fatigue in the whole upper limb with increased wearing times.\n\t\nStart with simple prosthetic movements (only open/close the hand without any co-contraction) with the weight of the prosthetic device being supported.\nMove on to simple prosthetic movements in different arm positions, such as the elbow being extended or flexed alternately. Make the patient aware of signal discrepancies when adjusting the various arm positions and train signal consistency in all positions.",
    "NOTE: After spontaneous nerve regeneration unintended co-activation of different muscle or muscle groups often occurs due to aberrant re-innervation, which may hamper coordinated movements and disable adequate muscle activities15. Faint unintended muscle contraction often occurs when moving the arm, which is sensed by sEMG sensors and translated into prosthetic movement. This may result in poor prosthetic control, if not adequately addressed during rehabilitation using EMG training and muscle strengthening as described below.\nIn case of cumbersome prosthetic control in different arm positions, thoroughly observe the EMG signals on the computer screen and point out to the patient, in what arm position unintended contraction of one or more muscles leads to signal excursion. Train precise activation of EMG signals in positions that the patient can still handle and slowly change the arm position over time.\nPerform strength training for elbow flexors (and shoulder muscles, if applicable), if co-activation of the muscles used for prosthetic control is observed while lifting the arm. Explain to the patient that a stronger muscle (i.e., a muscle that does not work with its maximum voluntary force during simple lifting tasks) usually also contributes to a better separation of the signals. Also perform strength training, if the upper limb muscles are too weak to move the prosthetic device in three-dimensional space and/or stabilize the shoulder while doing so.\nContinue with simple grasping tasks, such as picking up little boxes and manipulating small objects (see Figure 2C).\nFinally, train simple tasks of daily living like opening a door, folding a towel or opening a bottle.",
    "NOTE: Many tasks might be restricted due to the fact that the paralyzed hand gets in the way, and the device might feel rather heavy as the patient has to lift the weight of his/her own hand in addition to the hybrid prosthetic hand.\nIf the signal quality is insufficient, it might be beneficial to go back to signal training on the computer screen. In all tasks specifically look for co-activation of signals on the computer screen and further improve signal independency.\nAssess upper limb function using the hybrid prosthetic hand and record video of the test results. Additionally, use the same assessments for the paralyzed hand in order to document the functional benefit expected from prosthetic replacement of the functionless hand.\n5. Elective amputation and prosthetic hand replacement\nPrecisely plan the level of amputation depending on the site of the various EMG signals (transradial, transhumeral or, in rare cases, glenohumeral) in the multidisciplinary team consisting of the patient’s physiotherapist/EMG trainer, the surgeon responsible for the amputation and the psychologist familiar with the patient’s expectations.\nAsk the patient if he/she has any unresolved questions regarding the planned amputation and clearly communicate that it is possible at any time prior to amputation to revoke this decision, which will otherwise result in an irreversible and life-altering surgery.\nPerform the standardized assessment of upper limb function using the functionless hand and video-tape the results\nPerform the standardized assessment of upper limb function using the hybrid prosthetic hand and video-tape the results to document the benefits of a future prosthetic fitting.\nPerform the elective amputation of the functionless limb as described previously7,8.",
    "Allow post-operative wound healing and let the patient train adjacent joints for improved upper limb mobility. After 4−6 weeks, train the EMG signals as described above and define the best hotspots for electrode positions.\n\tNOTE: These electrode positions and motor commands might differ slightly from the ones found before amputation.\nLet an orthopedic technician design the final prosthetic socket using the previously defined EMG electrode positions (see Figure 4, illustrating a possible socket design in one of the included patients).\n\tNOTE: While there is no specific socket design recommended, the exact position of the electrodes and their adhesion to the stump’s skin are of utmost importance as brachial plexus patients have a largely reduced neuro-muscular interface.\nimgsrc://cloudfront.jove.com/files/ftp_upload/59839/59839fig04.jpg\nFigure 4: Example of a possible prosthesis and socket design.\n(A) This patient's prosthesis consists of an outer sheath made of carbon. (B) Instead of a prosthetic hand, the patient prefers to use a hook, which opens and closes, as a grasping tool. (C,D) The two electrodes are integrated in the prosthesis. The patient wears a silicone liner with two holes in it, allowing direct skin contact with the two electrodes (not shown). Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/59839/59839fig04large.jpg]\nStart the prosthetic training.\n\t\nAgain, start with simple prosthetic movements (only open/close the hand without any co-contraction) with the weight of the prosthetic device being supported.\nMove on to simple prosthetic movements in different arm positions, such as the elbow being extended or flexed alternately.\nContinue with simple grasping tasks such as picking up little boxes and manipulating small objects (see Figure 2D).\nFinally, train activities of daily living, again starting with rather simple tasks (as opening a door) and slowly add complexity and tasks that the patient considers relevant for his/her specific life situation.",
    "Three months after prosthetic fitting, repeat the standardized assessment of upper limb function using the prosthetic hand and record a video of the results."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}