{
  "id": 12843,
  "origin_website": "Jove",
  "title": "Utilizing Electroencephalography Measurements for Comparison of Task-Specific Neural Efficiencies: Spatial Intelligence Tasks",
  "procedures": [
    "Ethical Statement Regarding Use of Human Participants\nProcedures involved in this work have been approved by the Institutional Review Board (IRB) at Utah State University for the study of human subjects. It is recommended that any similar work should also be approved by the relevant IRB. Participants are allowed to stop or withdraw from the study at any time during the experiment.\n1. Selection of Participants\nSelect participants on a voluntary basis from students currently enrolled in a Statics course. Ensure that the participants have been previously exposed to the Statics content they will see while in the study.\n\tNote: Ideally participants should have exposure to the material via lecture at least four weeks prior to participation in the study so that there is time for consolidation of concepts and development of differential performance levels.\nConduct recruitment following all IRB protocols. Explain all procedures and restrictions to potential participants in detail. Describe the scope of future contact and how the results of the study may be published and/or made available to the participants. Define any compensation for participation in the study. If a volunteer chooses to enroll in the study, provide him or her with a double-coded identification code only known to and controlled by the principal investigator.\n\tNote: Specific population recruitment will require statistical analysis to verify the statistical power of the sample and number of required participants to analyze individual differences in the brainwave data. If the researcher desires to conduct a comparative study between populations, then a power analysis should be conducted to develop appropriate participant group sizes for both populations.\nSelect activities or problems that are representative of the experiences desired for the participants.",
    "Note: In this protocol, sophomore-level engineering students enrolled in a Statics course were selected. The activities deemed relevant were problems from introductory Statics content as well as two commonly used spatial ability instruments: the Mental Cutting Plane Test (MCT) and the Purdue Spatial Visualization Test (PSVT-R). Each instrument tests different constructs of spatial ability and the level of spatial development in this selected student population.\nEstablish a calendar to organize the laboratory sessions for the participants.\n2. Preparation of Instruments\nSet up the EEG headsets (aka caps) per manufacturer instructions. Complete this preparation before the participant arrives for the study. To reiterate, this procedure is specific to general mobile headsets such as Emotiv, as opposed to medical grade EEG setups.\n\t\nCharge the EEG headsets — ideally at least a 1-hr charge per session. For a regularly used laboratory, have at least two headsets charging at all times.\nPlace all required liquids in an accessible area, including the liquid for dampening the EEG electrodes (e.g., water) and an abrasive cleaner for ensuring good contact for the EEG reference nodes.\nInsert the felts into each casing (ensuring the gold contact is seated securely in each casing). Saturate the felts with the dampening liquid using a syringe. Allow dampened electrodes to rest.\nSet up any required video cameras to measure participant behavior. For the current protocol, use two video cameras per participant. Re-adjust cameras once the participant is in place. Be sure that the video is time-stamped.\n\t\nFocus one camera on the participant's face if aiming to record facial expressions and obtain high quality audio.",
    "Focus the other camera on the area in front of the participant to capture hand movement, including handwriting actions (if handwriting is expected, make sure to use a writing instrument that is dark and/or thick enough to be captured by the camera), and enough of the computer monitor to provide insight as to which task is being solved at which time.\nTurn on the computer and verify that the software is on to record brainwave data. Verify that all software and data collection devices are interfacing sufficiently for data collection.\n3. Preparation of Study Participants and Session Commencement\nVerify the receipt of documented consent from participants per the IRB agreement discussed above. Answer any questions the participants have prior to beginning the study. Remind the participants that data collected will be referenced by ID code and there will be no identifying information that ties the data to the participant, and that they may withdraw at any time.\nAsk each participant to fill out a demographics survey prior to participation in the study. This survey may ask about gender, age, previous experience that may impact their abilities in the study (e.g., past engineering or spatially intensive courses, spatial ability enhancing hobbies, and questions regarding exclusion criteria such as traumatic brain injuries they may have suffered, which hand they use).\n\t\nExclude participants from the volunteer group for the EEG analysis if any of the following conditions exist: (a) the participant is left handed or ambidextrous, in order to control for brain laterality confounds; (b); the individual cannot participate in the lab sessions due to a physical disability; or (c) the individual has suffered serious brain injury. Notify potential participants of these limitations during the recruitment process, or as early as possible to avoid spending unnecessary time and resources.",
    "Upon arrival, ensure the participant is comfortable and resolve any remaining questions or concerns.\n\t\nDemonstrate the syringe used to saturate the node and explain that it will only be used to keep the EEG felts damp. If the participant has an extreme fear of needles, consider implementing other precautions (e.g., keeping the syringe out of their focal plane when re-wetting the felts).\nAsk the participant to remove any electronics from their person.\nPlace the EEG headset on the participant.\n\t\nCheck the felts for dampness and place the felt/casing combinations into the EEG headset.\nClean the reference points (e.g., mastoid process) of the participant with the abrasive cleanser. Wipe away any residue.\nPlace the headset on the participant with the reference nodes appropriately aligned with the reference points. Do not excessively bend the arms of the headset. Leave a gap between the reference node and the back of the ear so as to not cause discomfort, and align and space the headset appropriately with the participant's head.\n4. Software Execution within the Session\nStart the EEG-logging software. Ensure that good connectivity exists between the logging device (e.g., personal computer) and EEG headset by checking that all of the channels are displayed on the logging device. Check that all channels initially display similar behavior with low amplitude oscillations. Check the EEG to ensure good connectivity with the participant — re-wetting and adjusting the felts so as to achieve consistent patterns on the logging device — immediately preceding the rest periods and before the start of each new problem type.\n\tNote: The EEG operates at 128 Hz. Electrooculography was not used to record eye movement, and linked-ear reference was not used.\nInstruct the participant to remain as still and quiet as possible during the task exercises.\nInitiate the task-presentation software.",
    "Note: During data collection, all pre-planned visual communication with the participant occurs via the computer monitor. In this case, a series of spatial and engineering problems will appear on the computer screen, and participants will be asked to solve them. Correct answers were not provided to the participants during data collection. The problem images advanced based on user input, so timing was based on problem-solving duration.\n\t\nDisplay spatial problem type 1 (e.g., PSVT:R — a multiple choice test, or true-false rotation problems — see Figure 1)13. Note: The duration of these problems (e.g., 30 sec) will be used as the time range for the data analysis. Five problems were included in this set.\nDisplay spatial problem type 2 (e.g., MCT — a multiple choice test, or true-false mental cutting problems — see Figure 2)12. Note: The duration of these problems (e.g., 30 sec) will be used as the time range for the data analysis. Five problems were included in this set.\nDisplay engineering problem type17 (e.g., Statics problems — broken down to focus on specific principles of engineering Statics, or any other applied problem type hypothesized to have spatial components — see Figure 3). Note: These problems take significantly more time to solve than the spatial problems. The number of problems shown to participants varied from four to ten.\nAssign rest periods at the beginning and the end of data collection — used for obtaining baseline data. Ensure that each of these have the same duration (e.g., 120 sec).",
    "If desired, conduct an exit interview with the participant. This may include their thoughts on the experimental presentation, wearing the EEG headset, the communication process used throughout recruitment and participant preparation, and/or any protocol requiring verbal answers mentioned above. A validated user questionnaire may be provided to the participants instead of conducting an interview.\nTurn off the task-presentation software, the EEG-logging software, remove the EEG headset, and turn off the video-recording equipment.\n5. Conclusion of the Session\nDismiss the study participant. Thank the participant and provide them an overview of any future contact (e.g., for follow-up interviews or subsequent sessions of the study), explain how the results of the study may be published and/or made available to the participants, and provide any refreshments or payment (or an explanation of how the payment will be provided) agreed upon as part of the compensation for participation in the study.\nTransfer data logs to any required long-term or transfer storage devices. Store the signed consent form appropriately and as designated by IRB protocol.\nClean up the instruments and laboratory space.\n\t\nRemove the felts from the headset and sanitize or dispose of them.\nReturn the EEG electrode casings and headset to the proper storage location.\nDispose of used syringes and trash appropriately.\nReturn liquids to appropriate storage locations.\nSecure the lab if not being used by other researchers.\n6. Data Analysis",
    "Identify and extract the raw data for each channel and the marker data from the EEG data logs. Use ASCII bit markers to identify the beginning and end of data collection, as well as the transitions between different phases of data collection (e.g., problem types) and individual problems. Ensure that each phase type has a different marker value so as to enable differentiation during analysis. Name the data in a manner that references the participant ID code as the source.\n\tNote: EEGLAB commands are defined herein, but EEGLAB requires MATLAB for this execution.\n\t\nClick File > Import Data > Using EEGLAB functions and plugins > From EDF/EDF + GDF files (BIOSIG toolbox)\nSelect the appropriate data file. Click Open to load the data.\nSelect the Channel List. Click Ok to accept.\nProvide a Dataset Name. Specify a descriptive name for the data that reflects the source and date of collection. In this case, PSF1448 indicates data from Participant ID 48 in the Fall of 2014.\nMap the extracted data to the montage (i.e., the layout of the EEG nodes) by selecting the montage provided by the EEG headset vendor (e.g., a 10 - 20 system). Ensure the montage being used for the analysis matches the layout of the EEG headset utilized during the session. This is manufacturer-specific.\n\t\nEdit channel locations by clicking Edit > Channel Locations.\nSelect Montage. In this case the default montage is appropriate, so simply click Ok to accept.\nSelect Channel Information Specification. In this case the default is appropriate, so simply click Ok to accept.\nReduce the EEG channel data to that which is most representative of brain activity, as defined below.",
    "Apply an initial filter to the data. Typically, apply a high-pass, low-pass filter (with 0.1 Hz as the lower bound of the high-pass filter and 59 Hz as the upper bound of the low-pass filter). Applying a low-pass filter less than 60 Hz removes the noise from the U.S. electrical grid. Save the dataset with a new name as a restore point.\n\t\t\nClick Tools > Basic FIR Filter (new, default).\nSet Basic Filter Parameters. Set Lower edge to 0.1 Hz, Higher edge to 59 Hz, do not plot the frequency response, and click Ok to accept.\nSpecify a new name for the filtered data (by appending \"_filtered\" to the existing dataset name). Check the box to save the data as a file, and use the same name for the filename. Click Ok to accept.\nRemove any data that lie before the first EEG marker or after the last EEG marker — keeping in mind any latency in recording the EEG markers. Record the latency (time) of the marker indicating the initiation of data recording and the latency of the marker indicating the end of the data. Save the dataset with a new name as a restore point.\n\t\t\nThe latency values can be found in the \"Edit event values - pop_editeventvals()\" screen; press the \">>\" button to go to the final marker signifying the end of the EEG data. No change needs to accepted, so click Cancel once the values have been recorded.\nClick Edit > Select data.\nEnter the beginning and end latency (time) values, separated by a space, in the \"Time range [min max] (s)\" field, and click Ok to accept.",
    "Specify a new name for the cropped data (by appending \"_cropped\" to the existing dataset name). Check the box to save the data as a file, and use the same name for the filename. Click Ok to accept.\nReject sections of data with large artifacts. The steps included below describe how to do this manually while visually inspecting the data. Note: the removal of data will also cause artifacts34,35.\n\t\t\nNormalize the data in each channel (remove the mean and put each channel on the same scale). Also remove the DC offset (this alters the data, but not the visualization).\n\t\t\t\nClick Plot > Channel data (scroll).\nClick Settings > Time range to display.\nSpecify the time range (e.g., 30 sec) to be shown in the plot in the \"New window length (s):\" field. The time range is based on the time between markers for problems within a given phase (or within the two spatial problem phases). The time range can be based on the maximum, minimum, or average time between markers.\nClick the \"Norm\" button to normalize the data in the plot (this is cosmetic only and does not alter the underlying data).\nClick Display > Remove DC offset to remove the DC offset in the plot (this is cosmetic only and does not alter the underlying data).\nRemove large artifacts that are not repeated regularly over time.\n\t\t\t\nMark all of the abnormal looking artifact data. Once all artifact data have been marked, click the Reject button.",
    "Note: These can appear as abnormally high or broad peaks in the data — in single or multiple channels — or as long trends that appear in a small number of channels. Data are suspect if data from separate channels appear to cross one another in the plot. These represent artifacts that are not part of the brainwave spectrum and most likely represent muscle movement by the participant or a node(s) with poor connectivity. Anything resembling a square wave is not representative of human brain activity.\nSave the dataset with a new name as a restore point.\n\t\t\t\nClick File > Save current dataset as.\nSpecify a new name for the cropped data (by appending \"_manRej\" to the existing dataset name). Click Save to accept.\nIf a particular channel appears to be faulty, remove the data from it individually. This represents a big loss in data, so do so with great caution. Look at the data from the channel over a long time period, as it often settles over time and provides useful data.\nRun an Independent Component Analysis (ICA) and select the best representations of brainwave activity.\n\t\tNote: This aids in the removal of sets of repetitive artifacts in the data. These sets contain artifacts that will appear multiple times at roughly regular intervals with a repeated shape. Typically they are a result of biological functions such as blinking or pulse — each of which will have its own set.",
    "Map the ICA-separated data to a representation of the cranium based on the montage. Reject results associated with blinking, pulse, or muscle tension — which will often appear in the ICA results as areas of emphasis above the eyes, near the temples, or over the ears, respectively. Reject any component that shows the entire cranium as being engaged since it not representative of brain activity (see Figure 4).35 Accept other results (see Figures 5 - 6).\n\t\t\t\nClick Tools > Run ICA.\nSelect the default (runica) ICA algorithm. Click Ok to accept.\nClick Plot > Component properties.\nSelect the component indices (the 14 EEG electrode channels loaded into memory) and the spectral options. As before, the lower edge is 0.1 Hz, and the higher edge is 59 Hz. Click Ok to accept entries.\nWithin the Accept/Reject window, click on the Accept button to change status to Reject (and click it again to change it back to Accept). Click Ok to log the Accept/Reject labeling.\nPlot the ICA-separated data in a 2-D color plot. Reject results that appear streaky, blank, or peppered with discontinuities, then save the dataset with a new name as a restore point (see Figures 5 - 6).\n\t\t\t\nWithin the Accept/Reject window, click on the Accept button to change status to Reject (and click it again to change it back to Accept). Click Ok to log the Accept/Reject labeling.\nClick Tools > Remove Components — to actually remove the data marked for rejection previously.\nClick ok to continue. The indices of components logged for rejection are shown in the \"Remove components\" window.\nClick Accept in the \"Confirmation\" window to continue with the pruning of the data.",
    "Specify a new name for the pruned data (by appending \"_manRejPruned\" to the existing dataset name). Check the box to save the data as a file, and use the same name for the filename. Click Ok to accept.\n\t\t\t\tNote: Streaks that last longer than 0.5 sec are considered reasonable for rejection. Relative \"goodness\" may need to be utilized here, depending on how good other data sets appear to be — it is desirable to keep at least half of the components. Good results are often represented by continuous gradations on a 2-D Continuous Data color plot34.\nRemove the boundary values left in the data. Save the dataset with a new name as a restore point.\n\t\nClick Edit > Event values.\nScroll through the events and click the Delete event button when the event type is a boundary. When all have been removed, click Ok.\nSpecify a new name for the deleted-boundary data (by appending \"_deleteBoundaries\" to the existing dataset name). Click Save to accept. Use same menu item selection as before to get to this screen (see step 6.3.3.3.1).\nCalculate absolute power metrics for each exercise type. This is a power-based logarithmic transform based on the microvolt measurement and the time — calculated for each frequency band (Delta, Theta, Alpha, Beta, and Gamma).22\nChunk the data into blocks, using markers to indicate the beginning and end of each task.\n\t\t\nClick Edit > Select data using events.",
    "Utilize appropriate timeframes for each task type. Define the timeframe for the rest periods by the duration of a rest period. For the spatial problems (which are roughly similar in duration), use either the average duration of all spatial tasks or the maximum duration of all spatial tasks. For the applied (e.g., engineering Statics) problems, identify the average duration for each problem. Save the dataset with a new name as a restore point.\n\t\t\t\nEnter the marker type in the \"Event type(s) ([]=all)\" field, (e.g., marker type 50 was used to mark rest events). Rest events had a duration of 120 sec in this case, so enter \"1 120\" for the time limits array. Click Ok to accept.\nSpecify a new name for the event data (by appending \"_rest\" to the existing dataset name in this case). Check the box to save the data as a file, and use the same name for the filename. Click Ok to accept.\n\t\t\t\tNote: If the applied portions can be reduced so they take roughly the same amount of time as the spatial tasks, then use the same timeframe size as the spatial tasks. Since EEG is a time-sensitive measure, the more accurate the time epochs are for each condition, the less confounded the data are in the end (i.e., the number of samples collected for each condition will be more consistent).\nCompare results for final analysis.\n\t\nCalculate the percentage for each chunk relative to the baseline rest measurements. See the Supplemental Code File, and Tables 1 - 8.\n\t\t\nOpen the Absolutepower Script in MATLAB and click the Run button to run the script on the data loaded in the workspace during step 6.6 (e.g., the rest data).\nSelect absolutepowermatrix data in the MATLAB Workspace for transfer to a spreadsheet program (e.g., MS Excel).",
    "Repeat steps 6.5 - 6.6.1.2 for every exercise/marker type.\nCompare results with similar timeframes (e.g., spatial tasks) to one another for insight into relative difficulty.\nCompare results across participants to identify higher relative performers versus lower performers in the skills being assessed. Note: High performers may show very little increase in the beta activation relative to the baseline, while low performers may show an increase on the order of 70%21-26.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}