{
  "id": 7566,
  "origin_website": "Bio",
  "title": "Quantitative and Anatomical Imaging of Human Skin by Noninvasive Photoacoustic Dermoscopy",
  "procedures": [
    "This protocol is adapted fromWang et al. (2022b), and provides the detailed procedures for PAD construction, including component selection, equipment setup, and system calibration. A step-by-step guide for human skin imaging is provided as an example application.System setupUse a 532-nm pulsed laser as the laser illumination source. Set the repetition rate of the laser to 10 kHz, the output energy to 80%, and the trigger setting to external trigger using a LabVIEW program (Figure 2A).Note: The laser is a class IV laser. Wear laser protection goggles during operation. Fix the FiberPort directly in front of the laser beam exit port (Figure 2B).Couple the laser beam to the single-mode fiber (SMF) by a FiberPort (FP) (Figure 2B).Note: Keep the lens of the FiberPort and fiber end face clean. Use a fiber collimator to collimate the laser beam at the output of the single-mode fiber (Figure 2C).Use the objective lens to focus the collimated laser beam (Figure 2D).Fix the ultrasonic transducer under the objective lens (Figure 2E).Pass the focused laser beam through the center hole of the ultrasonic transducer (Figure 2F).Fix the coupling cup under the ultrasonic transducer (Figure 2G). Note: Use a housing to fix the collimator, objective lens, ultrasonic transducer, and coupler coaxially up and down one by one, as shown in Figure 1A.  Fix the housing in the center of the X-Y translation stage.Connect the ultrasonic transducer to the input port of the amplifier (Figure 2H).Use a coaxial cable to connect the output port of the amplifier to the input port of the data acquisition card.Set the DC power supply to 15 V, to power the amplifier.Use a coaxial cable with SMA connector to connect the output port of the motor driver to the I/O port1 of the FPGA (Figure 2I).",
    "Use a coaxial cable with SMA connector to connect the I/O port2 of the FPGA to the external trigger of the pulsed laser (Figure 2I).Use a coaxial cable with SMA connector to connect the I/O port3 of the FPGA to the external trigger of the data acquisition card, to input the synchronous signals (Figure 2J). Note: Timing diagram of I/O ports are shown in Figure 1B.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4372/bioprotoc-12-07-4372-g001.jpgFigure 1. Photoacoustic dermoscopy system setup. A. Schematic diagram of the PAD system. B. Timing diagram of scanning and acquisition. T1, T2, T3: trigger; Col: collimator; OL: objective lens; UT: ultrasonic transducer; CC: coupling cup; SMF: single-mode fiber; DAQ: data acquisition card; AMP: amplifier; FPGA: field programmable gate array.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4372/bioprotoc-12-07-4372-g002.jpgFigure 2. System alignment pictures. A. LabVIEW program for laser. B. Laser and fiberPort. C. Fiber collimator. D. Objective lens. E. Housing and ultrasonic transducer. F. Coupling cup. G. Ultrasonic transducer. H. Signal from ultrasonic transducer to amplifier. I. Trigger connections on FPGA. J. Trigger and signal connections on data acquisition card.System alignmentUse a polyethylene membrane to seal the bottom of the coupling cup, and add deionized water to the coupling cup (Figure 3A).Add deionized water below the ultrasonic transducer (Figure 3B).Adjust the bottom of the ultrasonic transducer into the deionized water (Figure 3C).Note: Avoid bubbles in the bottom part of the ultrasonic transducer. Open the laser switch. Select the laser control program. Preheat for fifteen minutes.Note: The laser is a class IV laser. Wear laser protection goggles during operation. Press the “ON” button for the pumping switch. Set the external trigger for the pulsed laser.Carefully check the laser pulse energy and the pulse repetition rate.Use the laser power meter to measure the light energy, to ensure a safety threshold (20 mJ/cm2).Place a blade on the bottom of the polyethylene membrane.",
    "Note: Apply ultrasound gel between the blade and the membrane, and avoid bubbles. Select the A-Line LabVIEW program. Press the “Start” button to capture the fixed-point signal and display the amplitude and the spectrum of the current A-Line signal.Adjust the X-Y position of the ultrasonic transducer to avoid signal oscillation, and make sure the optical and acoustic foci are confocal.Adjust the height of the coupling cup, to maximize the amplitude of the A-Line signal (Figure 3C).Remove the blade and wipe the ultrasound gel on the polyethylene membrane.Add the ultrasound gel on the skin of the volunteer and apply it evenly.Place the integrated imaging probe close to the skin of the volunteer and capture the A-Line signal of the human skin in vivo.Adjust the height of the coupling cup slightly, to maximize the amplitude of the skin signal. Note: The normal PA signal is shown in Figure 2D.  Stop the A-Line LabVIEW program.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4372/bioprotoc-12-07-4372-g003.jpgFigure 3. System alignment and acquisition of skin signals. A. Add deionized water to the coupling cup. B. Add deionized water below the ultrasonic transducer. C. Adjust the relative height of the coupling cup and the ultrasonic transducer. D. A-Line PA signal of human skin.Human skin imaging (Video 1)Before human skin imaging, oral and written informed consent were obtained from all participants.Participants need to wear laser goggles.Open the laser switch. Select the laser control program. Preheat for fifteen minutes.Note: The laser is a class IV laser. Wear laser protection goggles during operation. Press the “ON” button for the pumping switch. Set the external trigger for the pulsed laser.Carefully check the laser pulse energy and the pulse repetition rate.Select the imaging region and apply ultrasound gel or deionized water (Figure 4A).Press the polyethylene membrane of the coupling cup fully in contact with the skin imaging area (Figure 4B).",
    "Open the LabVIEW program. Name the newly created folder to save the data.Select the scanning speed, the size of the scanning area, the scanning step, and the acquisition depth. For example, set the scanning parameter at “10 mm/s” in the “Speed” tab, “5 mm*5 mm” in the “Area” tab, “500” in the “acquisition depth” tab, and “10” in the “Step” tab.Click the “Collect” button to start scanning.Keep the volunteer still and avoid physical movement.Click the “Stop” button to end scanning after completing scanning. Click the “Return to Zero” to make the X-Y translation stage return to zero.Press the \"OFF\" button to turn off the laser.Click the “Exit” button to exit the LabVIEW program.Remove the polyethylene membrane and pour out the deionized water in the coupling cup.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Human skin imaging imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4372/bioprotoc-12-07-4372-g004.jpgFigure 4. System alignment and acquisition of skin signals. A. Apply ultrasound gel or deionized water to the target region before imaging. B. Keep the coupling cup fullly in contact with the skin.Troubleshooting proceduresLarger laser spot or inhomogeneous illumination: First, make sure that the fiber collimator is correctly connected to the output end of the single-mode fiber. Second, make sure that there are no air bubbles under the ultrasonic transducer.No PA signals: First, make sure that the Data acquisition card can collect signals normally. If the Data acquisition card does not work, please check whether the external trigger signal is normal. Second, make sure that the pulsed laser is set to external trigger. Third, make sure that the amplifier is powered, and that all coaxial cables are functioning properly and connected correctly.Strong external noise in the PA signal: First, use the digital multimeter to ensure that the ground wires of the motor driver, amplifier, and ultrasonic transducer are connected to the ground wire of the power supply.",
    "Second, use copper foil tape to connect the amplifier to the housing. Third, fix the buckle-type magnetic ring on the SMA connector of the amplifier and the coaxial signal cable.Strong motion artifact in the PA image: First, make sure that the robot arm is fixed and stable. Second, make sure that the X-Y translation stage and housing are rigidly connected."
  ],
  "subjectAreas": [
    "Biophysics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}