{
  "id": 10091,
  "origin_website": "Jove",
  "title": "Ensemble Force Spectroscopy by Shear Forces",
  "procedures": [
    "NOTE: All the buffers and the chemical reagents used in this protocol are listed in the Table Materials.\n1. Preparation of the shear force microscope\nNOTE: The shear force microscope contains two parts, a reaction unit (homogenizer) and a detection unit (fluorescence microscope). The magnification of the eyepiece is 10x, and the magnification of the objective lens (air) is 4x.\nAssemble the homogenizer and the microscope on a mounting table. Wear goggles and turn on the fluorescence microscope, and then adjust the homogenizer to make sure that the excitation light beam of an appropriate wavelength (here, 488 nm was used) passes through the center of the dispersing tip of the homogenizer.\nPrepare a flat-bottomed reaction chamber that is 5 cm in height and 1.5 cm2 x 1.5 cm2 in cross-section. To reduce the background, ensure that the selected chamber material does not fluoresce, such as glasses (some plastics have fluorescence).\nChoose an appropriate homogenizer dispersing tip that can provide the desired shear force.\n\tNOTE: The shear rate is dependent on the distance between the rotor and stator at a fixed rotating speed11 according to the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/63741/63741eq01.jpg\n\twhere µ is the dynamic viscosity of water at 20 °C; D is the inner diameter of the stator; d is the outer diameter of the rotor, and V is the shear speed (rpm/s).\nClamp the reaction chamber on the sample stage of the fluorescence microscope, and then adjust the chamber to hold the dispersing tip of the homogenizer (Figure 1). Make sure the dispersing tip is slightly above (~1 mm) the bottom surface of the reaction chamber.",
    "Adjust the vertical position of the homogenizer and the chamber together to ensure the focus of the microscope is on the surface of the dispersing tip. Then, adjust the horizontal position of the dispersing tip to ensure that the detection area (field of view) is set between the rotor and stator (Figure 1).\nSwitch on the fluorescence channels according to the fluorescent dye used in the experiment.\nBefore the high-speed shearing experiment, use deionized (DI) water to test the shearing with a low shearing speed (e.g., 2,000 rpm) to ensure the dispersing tip can work appropriately without touching the reaction chamber.\n2. Unfolding i-motifs with and without ligands\nPrepare a human telomeric i-motif DNA (Table of Materials) labeled with a dye and a quencher at its two ends, respectively, in DI water, as described in Hu et al.11.\n\tNOTE: i-motif containing sequence: 5'-TAA CCC TAA CCC TAA CCC TAA CCC TAA.\nDilute the DNA to 5 µM in the 30 mM MES buffer at pH 5.5 or pH 7.4. To the DNA solution, add ligand L2H2-4OTD, which was synthesized according to Abraham Punnoose et al.13, in a concentration range of 0-60 µM. Mix the solution gently for 10 min to fold the i-motif structures without light.\nCheck and minimize the background fluorescence intensity of the reaction chamber that is filled with deionized DI water using the fluorescent microscope without shearing. An easy way to minimize the background fluorescence is to wash the reaction chamber with DI water. The background fluorescence value needs to be subtracted in the data analyses later.\n\tNOTE: Stray light should be avoided from this step onwards.",
    "Set the parameters of the CCD camera using the software. The recommended parameters are as follows: exposure time = 0.5 s, CCD sensitivity = 1600, and recording time = 20 min.\nUsing a long pipet, add the DNA solution into the empty and clean reaction chamber. Cover the reaction chamber with a black box. Then, start the homogenizer to perform shearing at a selected shear rate ranging from 9,724 s−1 to 97,245 s−1 (selected using the software associated with the homogenizer) for 20 min with the CCD camera turned on to record the data.\nAfter the experiment, remove the chamber and wash it with DI water.\n3. Shear force-actuated click reaction\nPrepare i-motif DNA in DI water. Incubate 10 µM i-motif DNA in 300 µL of 30 mM Tris buffer (pH 7.4) supplemented with 150 µM CuCl and 300 µM ascorbic acid for 10 min to fold the i-motif structures (all concentrations are final concentrations in the solution).\n\tNOTE: CuCl is the catalyst of the click reaction. Ascorbic acid will prevent copper (I) oxidization.\nUltra-filtrate the solution with an ultrafiltration device at a centrifugal force of 14,300 x g. Replenish the solution to ~500 µL with 30 mM Tris buffer (pH 7.4) supplemented with 300 µM ascorbic acid after each filtration.\nRepeat the filtration 3x.\nCollect the residual solution and make a final volume of 300 µL by adding 30 mM Tris (pH 7.4) supplemented with 300 µM ascorbic acid along with 20 µM Calfluor 488 azide, 20 µM HPG, and 10 µM TBTA. Once the reagents are added, move the solution to the darkroom.\n\tNOTE: Light should be avoided after this step.",
    "Check and minimize the background fluorescence intensity of the reaction chamber filled with DI water using the microscope before the shearing experiments. An easy way to minimize the background fluorescence is to wash the reaction chamber with DI water.\nAdd the DNA solution into the empty reaction chamber with a long pipet, and then start the homogenizer shearing at a shear rate of 63,209 s−1 for 20 min with the CCD camera turned on.\nAfter the experiment, remove the chamber and wash it with DI water.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}