{
  "id": 148,
  "origin_website": "Nature",
  "title": "Total Phospholipids and Phospholipid Subclasses Determination",
  "procedures": [
    "I. Total PL assay\n1. Check the automatic pipette before sample pipetting. Add 100 µL lymph/bile/serum with automatic pipette into a 16x100 mm PTFE capped test tube, wash the pipette tip with 100 µL D.I. water, and add 4 mL of CM mixture with 5 mL dispenser. \n  \n2. Vortex the tube vigorously. Wait at least 1 h for proteins in the sample to denature. There will be white stuff emerging gradually.\n  \n3. Add 800 µL D.I. water into the tube. Shake the tube upside down 3 times. Wait until there are two clear layers. Siphon off the upper layer with the negative water pressure instrument.\n  \n4. Evaporate the tube under a gentle stream of N2 at 40 C.\n  \n5. Add 400 µL chloroform to the tube. Cap tightly. Vortex the tube with Vortex-Genie gently 3 times at #3.\n  \n6. Add 100 µL chromagenic solution and shake the tube 3 times with fingers.\n  \n7. Cap the tube tightly. Otherwise the chloroform will evaporate and the absorbance will be very high. Boil the tube in the boiling water bath for 1 min 10 sec. Wait 5 min for the tube to cool down to room temperature.\n  \n8. Add 4 mL of chloroform gently into the tube and shake the tube 3 times with fingers. \\(Crucial point\\!\\!\\!)\n  \n9. Allow the tube to stand for 30 min at room temperature.\n  \n10. Take the lower solution quickly with a pasteur pipette.\n  \n11. Determine the absorbance at 710 nm. Use chloroform as the blank.\n  \nII. PL subclasses assay\n1. Prepare a set of 16x100 mm tubes.\n  \n2. Use 100 µL autopipette to add 100 µL of lymph/bile/serum. Wash the pipette tip with 100 µL of fresh D.I. water.\n  \n3. Add 5 mL of CM \\(2:1) mixture to the tube. Vortex vigorously.",
    "4. Use multiple automatic pipette to add 25 µL of concentrated HCl to lower PH.\n  Lower PH to separate phospholipids from proteins and deactive proteins. Optimum amount of concentrated HCl needs to be determined in the future studies.\n5. After overnight deproteinization, cotton-like residue will appear. \n  \n6. Add 1 mL of fresh D.I. water \\(20%). Shake gently upside down. \n  Don’t vortex vigorously to break the protein residue to make sure easy separation of the residue.\n7. Wait until two clear layers appear.\n  \n8. Siphon off the upper water layer. \n  \n9. Wait 30 min to let the leftover clear, then some white residue will appear on the surface, siphon off the residue again.\n  \n10. Evaporate the lower CM mixture layer.\n  Check the temperature of the evaporator before using.\n11. After drying, add 500 µL of inject solvent to dissolve the lipids.\n  Methanol causes a negative peak close to PE peak. Acetonitrile causes a negative peak close to chloroform peak.\nToo much chloroform is detrimental to the column and cause big solvent peaks. Small amount of chloroform is needed to dissolve the PI and PS.\nTo the best knowledge of this lab, acetonitrile \\(10):chloroform \\(1) \\(v/v) is considered the most suitable inject solvent.\n12. Pour the final mixture into the autosampler vials for HPLC running.\n  \nThe following document  contains information on:\n- Setting up external standard curves \\(ESTD)\n- Method parameters\n- Composition of the mobile phase\n<a href=\"http://bit.ly/qnj7sE\">HPLC methods</a>"
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}