{
  "id": 17812,
  "origin_website": "Jove",
  "title": "Updated Technique for Reliable, Easy, and Tolerated Transcranial Electrical Stimulation Including Transcranial Direct Current Stimulation",
  "procedures": [
    "The City College of New York, CUNY Institutional Review Board (IRB) approved this protocol.\n1. Materials\nPrior to the tDCS session, make sure that all necessary materials are available. While some materials will depend on the specific protocol of the study/treatment, there are basic items that are general across modern tDCS application as shown here (Table 1, Figure 3).\n\t\nPrepare a tDCS device: A battery-driven tDCS device that functions as a constant current stimulator with a maximum output in the milliamp range. A tES device with a tDCS setting may be used (e.g., Soterix Medical 1x1 tES device).\nPrepare single-use snap sponge electrodes (e.g., Soterix Medical 5x5 cm snap electrodes).\nPrepare saline solution and applicator, to be used if the electrode becomes dehydrated during the session. Since pre-assembled electrodes are already soaked with a volume of saline solution pre-determined to be sufficient, a minimal amount of saline, if any, might be added. Be careful not to oversoak the sponge and avoid leakage and dripping by gradually and carefully adding saline only if needed.\nPrepare fixed-position headgear. Here, two models of snap-headgear are used (M1-SO and bifrontal).\nPrepare connecting cables. The snap-headgear already includes the necessary cables, which one end configured to connect to the stimulation (male banana) and the other end configured to accept the snap pad (female snap). This may differ according to the fixed-position headgear chosen.\nPrepare relevant forms (e.g. consent form, pre- and post-questionnaires, screening forms, data collection forms) and other intervention-specific materials as applicable.\n2. Relevant forms\nWhen the subject arrives, first greet the subject, and then have him or her sit comfortably in an upright position in a chair.",
    "For research trials, before the study, have the subject give consent to participate in the study. The consent form includes details about the research protocol, risks, and benefits of the study. This form is intended to disclose appropriate information to subjects so that they may make a voluntary choice to accept or refuse treatment. It originates from legal and ethical rights. A subject must be aware of what happens to his or her body, and the ethical responsibilities of a researcher to get the participant involved in his or her physical and mental well-being.\nFor research trials, collect a written consent from the participants before any study procedures are performed. Show the consent form to the subject. An experiment can only continue if the subject chooses to sign the consent form.\nScreen the subject according to the inclusion and exclusion criteria outlined in the study's protocol.\nIf no contraindications are present and the subject still agrees to participate, ask subject to fill out any other necessary forms (i.e., demographics form, relevant pre-questionnaires, etc.)\nIf subject fully understands and consents to the procedure to follow and has filled out the necessary forms, go on to the next step.\n3. Measurements\nBegin setup by first measuring the subject's head circumference to determine the appropriate size of headgear to be used. To measure the subject's head circumference, start from the most prominent part of the forehead around the widest part of the back of the head, going over the hair and above the ears. Fixed-position head bands require significantly less measurements than the conventional methods of electrode placement for tDCS15 and moreover only require measurement at the first visit when the head-gear is selected.",
    "NOTE: Different headgears may vary in the range of sizes offered as well as in the circumference measurements corresponding to each size. For the headgear used in this demonstration, the sizes available are small (52–55.5 cm), medium (55.5–58.5 cm), large (58.5–62 cm), and extra-large (62–65 cm).\nWith the subject sitting comfortably in a chair, proceed to measure the head circumference to determine the appropriate size of the headgear.\nConsult the specific headgear manual to select the appropriate headgear size (e.g., small, medium, large) based on the desired electrode montage and the subject's head circumference. For most electrode montages, there may be different sized of headgear depending on the subject head size.\n4. Skin preparation\nInspect the skin where the electrode is expected to be placed. In this protocol, place electrodes following either the M1-SO or the bifrontal montage. If any lesions are observed, do not administer tDCS.\nEnsure the area is free of signs of lotion, dirt, etc.\nIn traditional approaches where re-usable electrodes are used, inspect the rubber inserts and sponges for wear at every session. Here, in modern approach with single-use electrodes, this step is not strictly required. None the less, inspect new electrodes for integrity and saturation.\n5. Electrode placement\nRemove two pre-saturated 5 cm x 5 cm snap electrodes from their packets.\nSnap the single-use snap electrodes onto the snap-headgear according to the fixed locations on the headgear. These locations are montage-specific and based on the headgear selected. The montage used is study-specific.\nOptionally, gently expose the scalp by parting the subject's hair with fingers to assure that the saline seeps through the hair into the scalp, enhancing contact quality between the electrode and the scalp.\nMaking sure that the sponge is secured to the strap, position the headgear on the subject's head.",
    "In the M1SO snap-headgear montage with \"anodal\" stimulation of M1, position the anode near the motor cortex and the cathode over the supraorbital area. To accurately position the electrodes onto their designated scalp positions, first position the nasion-representing ring of the strap, located at the bottom portion of the strap, over the nasion. The nasion is the point anterior to the brain, located between the forehead and the nose. Adjust the top portion of the strap so that it is perpendicular to the bottom portion of the strap. The top portion of the strap is intended to sit approximately above the ear, symmetrically positioned on both sides of the head. Then, position the posterior elastic portion of the strap over the inion. The anode/cathode polarity may be reversed depending in application.\nIn the bifrontal (F3/F4) snap-headgear montage with \"anodal\" stimulation of the left DLPFC, position the anode near the left dorsal lateral prefrontal cortex and the cathode near the right dorsal lateral pre-frontal cortex. The anode/cathode polarity may be reversed depending in application.\nIn some subjects with long hair, ask the subject to tie their hair back or secure the hair tightly while the headgear is being placed. This will allow for a more consistent electrode setup and decrease the risk of discomfort caused by accidental tugging of the subject's hair.\n\tNOTE: Long hair may also present a barrier for fluid from the electrode to saturate to the scalp, and can be gently parted under the electrode.\nEnsure that the headgear is snug, but not uncomfortably tight. Select the correct size of headgear that does not cause discomfort to the subject while ensuring the sponge electrodes are held reliably to the scalp.",
    "Connect the black cable (cathode) and red cable (anode) to the tES device. Consult the operating manual for the stimulator in order to establish whether the stimulator is powered on before or after connecting positioned electrodes to the stimulator.\n\t\nWhile the stimulator is active, ensure that the electrodes are connected when current flow has been initiated.\nFor the snap-headgear, connect the black cathode cable into the corresponding input black driver of the tDCS device and repeat this for the red anode cable for its respective location on the tDCS device. Ensure the connection polarity is correct as the effects of tDCS are polarity specific.\n\tNOTE: When using a tDCS device, the anode electrode is the positive terminal where positive current enters the body, and the cathode electrode is negative terminal where positive current exits the body. When using a tACS device, anode and cathode are not considered as positive or negative, as both terminals will act anode and cathode alternatively. Conventionally, red indicates the anode electrode, and black or blue indicates the cathode electrode (ensure that the same applies for the device being used).\n6. Start tDCS\nBefore initiating the tDCS session, make sure that the subject is comfortable and awake.\nConfirm that the device is turned on, the cables are properly connected, and the headgear and electrode properly situated. The impedance meter is a secondary method to ensure good contact, but it does not replace the need to make sure all protocol steps are adhered to.\nCheck the impedance meter for contact quality. The device used in this demonstration displays impedance information in real time. This may be device-specific, so become familiar with the impedance meter on the device used.",
    "If the subject's overall contact quality is abnormally low, this may indicate improper electrode setup, resulting in high impedance. If the contact quality continues to be low after adjusting the headgear and/or judiciously supplementing saline, press \"pre-stim tickle\" (if available on the device being used) to achieve a better contact quality.\nCheck if the device has enough battery. Devices designed for tDCS trials have a readily visible low-battery warning - for the device used here directly above the on/off switch there is a low-battery alert indicator.\nProgram the tDCS session duration, intensity or (if applicable to device being used) sham condition setting (for studies with operatory blinding regarding the sham vs real tDCS condition, the setting will be programmed by independent personnel or pre-coded into the device28). Note that some stimulators are recommended to be switched on before the contact between the electrodes and the skin is made.\n\t\nIf the tDCS session is being administered using a tES device, select the tDCS waveform setting.\nWhen applying a tES waveform other than tDCS, such as tACS or tPCS, make sure that the device is properly programmed including waveform and frequency.\nInitiate the tDCS by pressing the Start button. In order to reduce any adverse effects, devices include automatic current ramp up at the initiation of stimulation, along with an automatic ramp down at the end. At the beginning of stimulation, subjects will often perceive an itching and/or tingling sensation underneath the electrodes, which then fades out in most cases.\nAs some subjects may experience discomfort during the first few minutes of tDCS, moderately decrease the current by using the Relax knob temporarily as the subject adjusts. Then, gradually increase the current back up to the desired level. This feature may depend on the device being used and protocol.",
    "Ensure that the subject does not touch the device, headgear, and/or electrodes during the stimulation session. Ensure that any required adjustments to these are handled by the operator only.\nFor some subjects, sudden changes in current intensity may produce dizziness or vertigo as well as retinal phosphines if the current is suddenly increased or decreased. To avoid these adverse sensations, make sure to allow a ramp-up and ramp-down time for the stimulation. As previously mentioned, tDCS devices offer an automatic ramp-up/down period. Check the device for specific details.\nEnsure that the subject remains comfortable and avoids unnecessary movement.\nIf the electrodes become dehydrated, as may be indicated by a decrease in contact quality, use a syringe to gradually add a measured amount of saline to the electrodes. There may be experimental plans where tDCS electrodes are positioned on the head well in advance of stimulation such that when stimulation is scheduled to start the electrodes have been on the head for some time and may become dehydrated.\n\tNOTE: Electrodes designed for tDCS, such as snap electrodes have been developed by the manufacturer to maintain saturation during the course of a tDCS session (e.g., tens of minutes). However, certain environments (such as exceptionally dry atmosphere of air conditioning) may accelerated electrode dehydration. Snap electrodes are pre-saturated, so the need for additional saline is minimized.\n\t\nTo avoid saline drip due to gravity, ensure graded application to the top edge of the sponges.\nTo minimize dehydration, avoid an extensive long time between tDCS setup and start of tDCS or if unavoidable (a long task that must be conducted after headgear application but before tDCS application), add checks to confirm sponge saturation and impedance.",
    "Avoid touching the electrodes during stimulation. If addition of saline does not improve the contact quality, confirm skin sensation from the subject. Every trial and device will have explicitly specific criteria for any headgear or electrode adjustment steps before or during tDCS including when stimulation is aborted based on impedance and/or subject sensation.\nAt the end of the stimulation session, the device will ramp down from the treatment intensity to 0 mA. Do not allow subject to remove headgear themselves. Do not remove headgear before the device indicates stimulation is complete with a current of zero. As the current ramps down, some subjects may report increased sensations such as tingling. These minor sensations stop after the current intensity returns to zero.\nWhen the device has finished ramping down and the current is zero, turn off the device.\n7. After the procedure\nRemove headgear loaded with the electrodes from subject's scalp.\nDisconnect the snap electrodes from the strap. Dispose of the snap electrodes (as they are single use).\nInspect the skin under the electrodes. Mild to moderate redness is expected during tDCS5,11,29, most of it simply from pressure30.\nAdminister a questionnaire of adverse events to assess possible side-effects. Adverse event questionnaires can include any adverse effects typically associated with tDCS, such as tingling, itching and burning sensations, headache and discomfort. Examples for such a questionnaire can be found in Brunoni et al. (2011)31.\nThough tDCS is consider safe when following standard protocols5, perform an adverse-event monitoring procedure during the development of any study's protocol. Especially in some patient populations, serious adverse event may occur unrelated to tDCS. Adverse-event monitoring procedures include a course of action to be followed if the subject reports unexpected or serious side-effects during or after the session. Follow the adverse-event monitoring procedures closely and carefully."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}