{
  "id": 6214,
  "origin_website": "Bio",
  "title": "Pollen Germination and Pollen Tube Growth of <em>Arabidopsis thaliana</em>: <em>In vitro</em> and Semi <em>in vivo</em> Methods",
  "procedures": [
    "Setting up in vitro germinationThe first requirement for this system is to set up a simple storage box for the agar pad slides that you will make. To store multiple slides, we use microscope slide boxes that seal well. To maintain a humid atmosphere, we insert a small water-moistened wad of tissue paper at one end of the box, away from where the slides will be positioned. These wads are retained by a clean slide (see Figure 1). Be careful not to saturate the paper with water, otherwise the water will run out and ruin the slides.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180814/20180814023040_7858.jpgFigure 1. Humid chamber made from a slide box, in which slides can be stored in the fridge and also used as an incubation chamber for pollen germination and tube growthThe second requirement is to generate a simple incubation chamber for the slides (see Figures 1 and 6). This can be achieved by taking a sealable plastic container, or even a Petri dish, placing a layer of water-saturated tissue paper on the bottom, then placing in parallel arrays glass pipettes (or glass stirring rods) to generate a support for the slides (to elevate them just above the tissue paper) (Figure 6). Equally, the same arrangement as in the slide storage container can be used (Figure 1). Prior to the experiment, we keep this at 24 °C in the incubator oven.To generate the slides, we first use a PAP pen to draw an enclosure on the glass slide surface, around 1.5 x 2 cm (Figure 2). The slight ridge provided by the PAP pen wax mark ensures that when molten agar is added to the glass surface, it forms a neat pad rather than flowing over the slide.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180814/20180814023100_6418.jpgFigure 2.",
    "The surface of a glass slide showing the enclosure drawn on using a PAP pen, allowing containment of molten agarose medium Set a dry heat block or water bath at 60-65 °C. Using sharp surgical scissors, cut rectangles from the cellophane membrane of c. 1.2 x 1.7 cm, so that they will just fit in to the area of the agarose pad.The recipe of the medium used for an optimum trade-off between pollen germination rates and pollen tube growth is described in the Recipes section. Other media combinations (other than the standard solution described) that can modify the percentage of pollen germination and the pollen tube growth can be found in Rodriguez-Enriquez et al. (2013), these can be used depending on specific needs.To prepare the medium, all the stock solutions–excluding myo-inositol, spermidine and GABA–were combined with water in a Falcon tube and mixed thoroughly. Next, agarose was added to a final concentration of 0.05% (25 mg for 5 ml), the Falcon tube with a very loose cap was placed in a small Pyrex glass beaker, then heated gently in a microwave at low-medium power for short periods (e.g., 10-30 sec bursts). To dissolve the agarose, the cap was tightened and the tube inverted several times to mix. This is repeated several times until the solution is almost boiling and the agarose has dissolved and distributed evenly. This can also be achieved by using a very small Pyrex glass beaker, and stirring using a glass rod, which is especially useful for volumes over 5 ml. Take care not to boil over the agarose and be careful when removing and manipulating hot liquids directly from the microwave. Wearing suitable eye protection and other protective equipment is essential.Immediately place the Falcon tube in the heat block or water bath.",
    "After it has cooled to the block/bath temperature, add the myo-inositol, spermidine and GABA from the stock solutions. Invert several times to mix. Finally, use the pH indicator strips to determine the pH by dipping the strip into the hot solution. We found that the pH optima for the media differed depending on the ecotype. For Col ecotype, we adjust the pH to 8.0 whilst for Ler ecotype we adjust to pH 7.0. This adjustment is achieved using a dilute KOH solution. Several indicator tests and small additions of diluted KOH solution may be required to obtain the correct pH level. Ensure that, after addition of KOH, the solution is mixed well before testing the pH as the solution is relatively viscous. As the volume of KOH solution added is small, the medium composition is not significantly altered.Retain the Falcon tube in the heat block or water bath, to ensure that the agarose does not set. Place the slides on a very flat surface with the PAP pen marked side upwards. Using a 1 ml pipette, pipette enough of the molten agar solution contained in the Falcon tube into the enclosure to fill it up and make a pad (Figure 3). The agarose will rapidly cool and set, and they can either be used immediately or stored for later use (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180814/20180814023119_9895.jpgFigure 3. Pipetting of molten agarose medium into the enclosure (A), which results in an agarose pad after it has set (B)If stored for later use, quickly place in the storage slide box (Figure 1) and thoroughly seal the outside of the box with clingfilm. In a fridge at 4 °C, these slides can be used for up to 7 days after preparation.",
    "We recommend writing the date of preparation on the box of slides or on the slides themselves.Be sure not to use old slides, as microbial growth (especially fungal contamination) will severely interfere with pollen growth. When using stored slides for inoculations (Steps A10-A12 below), ensure that the box(es) of slides are removed from the fridge at least 1 h before use, to allow equilibration with room temperature. For quicker equilibration, slides can be placed in a humid chamber, rested on glass or pipettes over tissue paper wetted with warm water (40-50 °C), for a period of 15 min.If using the slides immediately, the rectangle of cellophane needs to be placed on the surface of the agarose pad to form the cellulosic contact surface for the pollen. Grasp the cellophane between two pairs of tweezers, holding it at the edges, and gently make contact with the agarose surface and then release (Figure 4). Even adhesion can be troublesome to achieve from dry cellophane rectangles as they can curl up. This can be mitigated by keeping the cellophane in a humid chamber for a couple of minutes before use. Ensure that the cellophane lies flat on the surface without any air bubbles underneath it. Any air bubbles that form can be gently squeezed out by delicately pressing with the edge of the tweezers.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180814/20180814023141_0226.jpgFigure 4. Placement of the cut cellophane membrane onto the surface of the agarose pad It is important to inoculate the surface of the cellophane with pollen grains without delay. To do this, use flowers that are just starting to open (c. day 1 to day 2 stage, Boavida and McCormick, 2007). It is important to choose opening flowers where the anthers are just starting to liberate pollen as the yield of grains is far greater.",
    "We found that it is consistently better to use flowers for inoculations in the morning. Holding them by the pedicel (stalk) with forceps, dab and streak them several times in one general location onto the cellophane surface (Figure 5). It is also possible to transfer pollen from the flower to a very fine paintbrush, and to use this to deposit the pollen on the surface (If using a paintbrush, ensure that it is thoroughly washed in distilled water and completely dried after use to clean the bristles of any remnant pollen grains.) It is important to develop a technique of movement in depositing the pollen that ensures that the pollen is not highly clumped but instead is distributed in a relatively evenly spaced monolayer (Naturally, this varies from individual experimenter to individual experimenter. To do this effectively, we encourage a few tests with different techniques and check with a microscope on the pollen distribution). For a single pad, we take flowers and systematically distribute their pollen across the surface (c. 12 flowers, in 3 x 4 rows, is usually sufficient per slide).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180814/20180814023202_0420.jpgFigure 5. Brushing and dabbing of the flower, using forceps to hold the pedicel, to deposit pollen on the cellophane surface Remove the slides to the humid chamber and place on the raised support or in the slide box. Ensure that the slides do not roll off and fall onto the wet surface when sealing the lid back on and placing in the incubator at 24 °C.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180814/20180814023225_6778.jpgFigure 6. Set-up for incubation of a single slide in a Petri dish as a humid chamberWithin 1 h, the initiation of pollen germination should be visible (Figure 7). Slides can be removed from the humid chamber and rapidly examined and photographed under a microscope at intervals.",
    "Be sure to minimize the time outside of the humid chamber as the slides will dehydrate rapidly. For example, we carry the slides within a humid chamber (see Figure 6) to the microscope to minimize stress to the pollen.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180814/20180814023246_2414.jpgFigure 7. Pollen germination and tube growth after 1 h (A) and after 6 h (B). Scale bars = 100 µm.If required for downstream analysis (e.g., protein, DNA or RNA extraction; fixation for microscopy), germinating pollen can be easily washed from the surface of the membrane. This is best achieved by removing the membrane and immersion into a small Petri dish containing a few milliliters of the basic growth medium that has been made up without the addition of agarose. The pollen is easily dislodged and can be further concentrated from the liquid medium, for example with a short and very gentle centrifugation at 500 x g for 30 sec.Setting up semi in vivo growthIt is essential for this procedure to emasculate flower buds before anther dehiscence. This allows simultaneous deposition of the desired pollen on the stigmatic surface. Using fine forceps, remove the six anthers from the late unopened flower bud with great care, avoiding any damage to the female reproductive parts. Where the anthers release pollen or the stigma becomes damaged, discard the flower. Remove and discard any other open or opening flowers on this plant and place back in the greenhouse, isolated from other A. thaliana plants with flowers shedding pollen to ensure contamination of the stigmatic surface with other pollen does not take place. If possible, leave overnight for the stigma to further mature. Any damaged stigmas will wither during this time. However, for success we advise not leaving the stigma for an extended time (over 24 h) before pollination.",
    "Pollinate the stigmatic surfaces of emasculated flowers with the desired pollen. As pollen germination and penetration into stigmatic tissue takes at least 1 h (Cheung et al., 2010), it is necessary to leave it on the pollinated stigmas for at least this period of time. This reduces the probability of pollen grains becoming disorientated when the stigmatic surface contacts the medium, thus reducing the number of pollen tubes growing onto the medium without penetration of the style.Follow the procedure outlined in Steps A1-A10, to make slides. Preparation of slides in advance is advised.Whilst gently supporting the tissue with a pair of tweezers, use a clean, sharp scalpel blade to cut the style at the junction to the ovary. Using fresh, sharp blades really assist in success. Without crushing the tissue, place them horizontally onto the cellophane (Figure 8). This transfer from plant to medium has to be performed as quickly as possible as these are delicate tissues that will dehydrate very quickly.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180814/20180814023302_9859.jpgFigure 8. Positioning of the pollinated, excised stigma/style material on the surface of the cellophane overlying the agarose padFinally, follow Step A12 as rapidly as possible.Pollen tubes will take several hours (up to 12 h) to emerge from the cut end of the stigma (Figure 9), and the material should be checked periodically after being placed on the medium.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180814/20180814023326_8370.jpgFigure 9. Pollen tubes in the semi in vivo system after overnight development. Extensive pollen tube growth from the cut ends of the styles is readily visible."
  ],
  "subjectAreas": [
    "Developmental Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}