{
  "id": 2556,
  "origin_website": "Cell",
  "title": "Protocol for the Generation of Definitive Hematopoietic Progenitors from Human Pluripotent Stem Cells",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nThis protocol mainly consists of three major Stages, which are defined by the combination of growth factors used in the mediaum. Stage 1 (days 0–4) involves the setup of the spin Embryoid Bodies (EBs), after a feeder-depletion step. A critical step of this protocol is addition of SB and CHIR at day 1.7, which patterns the mesoderm toward the definitive program. During Stage 2 (days 4–8), SB and CHIR are removed from the cultures and the hematopoietic mesoderm within the EBs develops to endothelium. Stage 3 marks the start of the adherent culture, which results in the growth of stroma and hemogenic endothelium and the subsequent generation of hematopoietic progenitor cells from day 14 onwards. Harvesting of hematopoietic progenitors can be carried out at different time points from day 16 up until day 28, depending on the cell fractions of interest. A comprehensive overview of the protocol is shown as the graphical abstract.\nDepletion of Feeder Cells from hPSC Cultures\nTiming: 30 min (+ at least 2 h of incubation)\nThe concentration of mouse feeder cells needs to be reduced in the hPSC cultures, which have been cultured on feeders in T75 flasks, before starting the differentiation protocol. Passaging hPSCs onto feeder medium-coated flasks is performed at least 2 h before the differentiation start point. This step also ensures that all the hPSCs used for the differentiation are growing and healthy, as dying cells will not survive the dissociation. This helps to synchronize differentiation kinetics of the cells.\nHarvest hPSCs using TrypLETM Select for hESCs and EDTA based dissociation medium for hiPSCs, adding a sufficient volume of the reagent to cover the flask surface (usually 0.5 mL per T25 flask and 1.5 mL per T75 flask).",
    "Before plating the cells, remove feeder medium from the pre-coated T75 flask (or flask of the same surface area, pre-coated with feeder medium for at least 8 h), rinse with PBS, and add 15 mL of hESC or hiPSC media.\nPellet cells and re-plate at a 1:1 ratio.\nIncubate in low O2 conditions. Allow at least 2 h for the cells to re-attach.\nNote: Cells from a confluent (95%–100%) T75 flask are used to set up ten 96-well plates with 60 EBs/plate, which corresponds to approximately 5,000–6,000 input cells/well. Scale the number of 96-well plates depending on the size of the starting cell culture flask. Using this guide avoids the need for cell counting, which increases the speed of the differentiation setup. We find that this yields a higher proportion of viable cells per EB (Troubleshooting 1[href=https://www.wicell.org#sec6.1]).\nStage 1 (Day 0): Setup of the Spin Embryoid Bodies (EBs)\nTiming: 1 h\nThis step describes the generation of EBs using a spin-based method. Briefly, undifferentiated hPSCs (following feeder depletion) are aggregated by centrifugation onto round-bottom, low attachment 96-well plates, resulting in the formation of one EB per well (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/206-Fig1.jpg\nFigure 1. Generation of Intra-embryonic Hematopoietic Progenitors from hPSCs Using a Spin-EB Method",
    "The timeline of the protocol is shown at the top of the figure. In order to set up the spin-EB culture, single-cell dissociated hPSCs are plated in non-adherent round-bottom 96-well plates and are aggregated at the bottom of the wells by centrifugation, yielding 60 EBs/plate. EBs are cultured in Stage 1 medium for 4 days. At day 1.7, EBs are treated with an Activin inhibitor (SB) and WNT-agonist (CHIR) to pattern the mesoderm toward the intra-embryonic, HOXA-positive hematopoietic program, also inhibiting the generation of extra-embryonic blood progenitors. At day 4, medium containing SB/CHIR is removed using a multichannel pipette, placed in an angle to not disturb the non-adherent EBs present at the bottom of the wells. EBs are subsequently cultured in Stage 2 growth factors that promote endothelial development until day 8, when EBs are transferred to adherent wells in Stage 3 media to allow the outgrowth of stromal and endothelial cells. EB cultures generate CD34+ RUNC1C+ blood progenitors that arise from cell clusters located within arterial structures of SOX17+ hemogenic endothelium. Hematopoietic progenitors detach from the endothelium and continue maturing in suspension. To avoid removal of blood progenitors in suspension, half medium changes are performed from day 14, by tilting the pipette and removing only the upper 2 mL of medium and then adding 2 mL of fresh medium. Blood progenitors and EBs can be harvested at different stages of the differentiation and subjected to a range of analyses, including gene and protein expression, chromatin accessibility and immunoprecipitation, and growth and differentiation assays.\nUsing a multichannel pipette, add 70 μL sterile distilled water to the outer 30 wells of ten 96-well plates. This step reduces evaporation of medium from the inner 60 wells that will contain the EBs.\nPrepare 50 mL Stage 1 differentiation media with BVSAF cytokines.",
    "Harvest cells from the T75 flask (95%–100% confluent) using Accutase® solution, by 3-min incubation at 37°C.\nCritical: The use of Accutase® instead of TrypLETM Select reduces cell death during the harvesting step, and therefore yields better EB formation and overall differentiation.\nTransfer the cell pellet into the 50 mL Stage 1 differentiation media. Rinse out the tube with differentiation medium to collect all the cells.\nMix gently and transfer to a sterile reagent reservoir.\nUsing a multichannel pipette, aliquot 80 μL per well of the cell-medium mixture, using only the inner 60 wells of the ten low attachment 96-well plates previously prepared.\nAggregate the cells at the bottom of each well by centrifugation (2 min at 4°C at 400 × g). After centrifugation, the cell aggregate should be visible at the bottom of each well.\nPlace the plates into a 5% CO2 incubator under normoxic conditions at 37°C.\nNote: Note when the plates are placed to the incubator as the differentiation initiation time. This is required for subsequent steps.\nOn day 1 of differentiation, evaluate EB formation under the microscope: ideally, the single cells have aggregated and condensed within the wells to form spheres with an “edge” or “rind,” with little associated cell death at their periphery (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/206-Fig2.jpg\nFigure 2. Non-adherent EBs at Day 1 of Differentiation\nEBs are formed 1 day after the spin-EB setup and appear as dense spheres with a clearly visible border around them. EBs should present with very little associated cell death, observed as debris surrounding the EB. Scale bars represent 100 μm.\nStage 1 (Day 1.7): Addition of SB/CHIR\nTiming: 30 min",
    "This step describes the addition of an Activin inhibitor (SB431542) (Kennedy et al., 2012[href=https://www.wicell.org#bib1]) and WNT agonist (CHIR99021) (Sturgeon et al., 2014[href=https://www.wicell.org#bib7]), which, together, pattern the mesoderm toward the definitive hematopoietic program (Ng et al., 2016[href=https://www.wicell.org#bib6]). These two small molecules are added approximately 6 h before reaching the 48 h time point from the spin EB plate setup (approximately day 1.7 of differentiation).\nPrepare a mixture of STAPEL medium with added SB and CHIR to make the following final concentrations per well: SB431542 at 3.5 μM and CHIR99021 at 3 μM (see materials and methods for calculations).\nPlace this mixture in a sterile reagent reservoir.\nUsing a multichannel pipette, add 20 μL of the STAPEL + SB/CHIR mixture into each well of the spin-EBs plates, giving a final volume of 100 μL/well.\nPlace the plates back into the incubator.\nCritical: The timing of SB/CHIR may vary slightly with the rate of differentiation of the cell line used. Adding it too early may inhibit mesoderm formation, too late may not adequately suppress extra-embryonic, yolk sac-type hematopoiesis. With the cell lines used in this manuscript, the optimal time of SB/CHIR addition was approximately 42 h after the onset of differentiation. This protocol works for both unmodified and genetically modified hPSCs, but the timing of SB/CHIR might need to be optimized within a 4–6 h window around this time of addition.\nStage 2 (Day 4): Removal of SB/CHIR\nTiming: 1 h\nAt day 4 of the differentiation, the inhibitors are removed from the EB plates and replaced with media containing a mix of growth factors to support development of the hematopoietic mesoderm to endothelium.\nCheck under the microscope that EBs appear round with defined sharp edges (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/206-Fig3.jpg\nFigure 3. Non-adherent EBs at Day 4 of Differentiation",
    "At day 4, after a 2-day treatment with SB431542 and CHIR9902, EBs appear homogeneous, they have increased in size and display a very clearly defined edge. Scale bars represent 100 μm.\nPrepare Stage 2 differentiation mixture, consisting of STAPEL media with BVSIF cytokines. Approximately, 6 mL of medium will be needed per plate.\nUsing a multichannel pipette, remove as much Stage 1 medium as possible (70–80 μL) from each well, without disturbing the EBs. For that, tilt the tips so the tips do not touch the bottom of the well and pipette up media slowly (Figure 1[href=https://www.wicell.org#fig1], day 4).\nNote: Place the removed medium in a sterile reservoir, do not discard immediately. Change pipette tips if doing more than ten plates and/or different cell lines, to avoid contamination.\nHolding the plates against the light, check that no EBs are missing. Any removed EBs might be in the medium discarded in the sterile reservoir and can be placed back to their respective wells.\nPlace the Stage 2 medium into a clean sterile reagent reservoir and, using a multichannel pipette, add 100 μL medium per well.\nPlace the plates back into the incubator and leave until day 7 of differentiation.\nStage 2 (Day 7): Flow Cytometry Checkpoint\nTiming: 1 h\nAt day 7 of differentiation, mesoderm patterning and differentiation kinetics are evaluated by flow cytometric analysis, before starting the adherent phase of cell culture. This step is important to ensure that the CD34+ endothelium has formed and that the extra-embryonic program has been successfully inhibited.\nCheck under the microscope that EBs display a sharp edge without notable amount of cell growth around them. They may display a small number of protruding cells, as the EB tries to attach to the bottom of the well (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/206-Fig4.jpg",
    "Figure 4. Example of Non-adherent EBs at Day 7 of Differentiation\nAt day 7, EBs should appear round and dense and the edge should be very well defined. Some EBs might display a small number of protruding cells, as the EB tries to attach to the surface of the well. Scale bars represent 100 μm.\nCheck cell surface marker expression using flow cytometry in a sample of the EBs:\nCollect 10–20 EBs in a tube and let them settle by gravity. This usually takes approximately 2 min. Alternatively, pellet the EBs by centrifugation at 400 × g for 2 min.\nCarefully remove the supernatant and incubate the EBs in 1 mL TrypLETM Select for 30 min in a water bath at 37°C.\nDissociate the EBs by passing them through a 23G needle 10 times, or until no clumps remain in the suspension. The EBs should break up readily if the incubation period with TrypLETM Select has been sufficient.\nFilter the cell suspensions through a 50 μm strainer filter for sample preparations into a 5-mL round-bottom tube used for flow cytometry.\nWash the cells with FACS buffer (phosphate buffered saline (PBS) with 2% FBS) and pellet by centrifugation.\nRemove the supernatant and resuspend the cell pellet in 60 μL FACS buffer. Transfer 10 μL into a fresh tube to use as an unstained or isotype control and stain 50 μL with the following antibodies and dilutions: CD90-APC (1:100), CD34-PeCy7 (1:100), CD43-BV (1:50).\nIncubate for 15 min at 4°C in a covered ice bucket or in the fridge.\nTo remove unbound antibodies, wash the tubes twice by adding 2 mL of FACS buffer and pelleting by centrifugation.\nResuspend in 300 μL PBS prior to analysis in the flow cytometer.",
    "Expected outcome: At this time point, almost all the cells (>90%) should express CD90, around 20%–40% of the cells should express CD34 and very few of the cells (<3%–5%) should display CD43. The presence of cells that express the earliest blood cell marker, CD43, suggests that the extra-embryonic hematopoietic program has not been adequately suppressed (Troubleshooting 2[href=https://www.wicell.org#sec6.1]).\nOn day 7, coat tissue culture treated 6-well plates with 2 mL of Matrigel Solution and place into a 5% CO2 incubator under normoxic conditions at 37°C overnight (12–18 h) or for a minimum of 60 min. The EBs attach better when this step is done on the day prior to plating. At least three 6-well plates will be required: approximately 20–30 EBs will be plated per well next day, depending on experimental design; EBs are plated at a higher density if they are to be harvested at earlier time points.\nNote: Tissue culture 10 cm plates might also be suitable (with 70–90 EBs/plate) and appear to yield an increased number of progenitors as compared to differentiations using 6-well plates. However, larger plates do not allow as many experimental variables to be tested, they require greater volumes of medium, they are more difficult to handle and there is a higher risk of contamination.\nStage 3 (Days 8 and 9): Setup of the Adherent Culture\nTiming: 1 h on day 8 and 30 min on day 9\nAt day 8, the EBs are transferred onto tissue culture treated plates to establish the adherent stage of the differentiation culture. Next day, once the EBs have attached, the medium is replaced by Stage 3 medium.\nAt day 8, transfer the EBs from the 96-well plates into the Matrigel pre-coated plates using a multichannel pipette:\nAspirate the Matrigel solution from all wells.",
    "Set the multichannel pipette at 100 μL and use only four pipette tips, as they will fit a single well of a 6-well plate.\nTransfer 20–30 EBs per well, depending at what time they are to be harvested for analysis; for harvesting at earlier time points (days 18–20) plate around 30 EBs/well. Do not change the medium the EBs are currently in.\nCarefully place plates in the incubator, to allow the EBs to attach overnight (12–18 h). Do not move the plates during the first 24 h, as it might disturb the adhering EBs.\nNote: A proportionally larger number of 70–90 EBs are plated when using 10-cm plates.\nCritical: There appears to be an optimum density of EBs at this stage that promotes efficient hematopoietic development. Some trial and error may be required to determine this, but we have found that EBs from cell lines that will proliferate readily and rapidly produce blood progenitors, might prefer to be plated at a lower density.\nNext day (day 9), check under brightfield microscopy that EBs have successfully attached to the surface of the well and that growth of adherent endothelial and stromal cells around the EB is commencing (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/206-Fig5.jpg\nFigure 5. EBs after Transferring to Adherent Culture\nAt day 9, EBs are attached to the surface of the tissue culture wells and endothelial and stromal cell outgrowth have commenced. Scale bars represent 100 μm.\nGently remove the medium without disturbing the EBs and add 2 mL of Stage 3 medium (see materials section). Use 2 mL per well for 6-well plates or 10 mL for 10-cm plates.\nAt day 11, top up the wells with 1 mL of Stage 3 medium (top up with 3–5 mL if using 10-cm plates).",
    "Critical: Be very gentle when changing the medium at day 9, as EBs might not be firmly attached to the well. To add the medium, place the pipette on the wall of the dish to avoid directing the medium stream onto the EBs. Leave any EBs that might detach in the well, as they may re-adhere over the following days.\nStage 3 (Days 13/15): The Onset of Hematopoietic Progenitor Formation\nTiming: 15 min every 2 days\nThis step describes a full medium change to one that more specifically promotes the proliferation and differentiation of the desired hematopoietic lineage. This medium is used once blood progenitor cells start to appear in culture, usually around days 13–15.\nUnder brightfield microscopy, check that blood progenitors are being generated from endothelium around the edges of the adhered EBs, but they remain attached and are not yet floating in suspension (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/206-Fig6.jpg\nFigure 6. Emergence of Hematopoietic Progenitors in Culture\nAround day 14, the endothelial and stromal cells fully cover the well surface and the first hematopoietic progenitors start to emerge from the EBs. Images show EBs in adherent culture at day 14 of differentiation. Stromal and endothelial cells appear as flat elongated cells and immature progenitors appear as bright aggregates of small round cells, which are not yet in suspension. Scale bar represents 100 μm.\nAspirate Stage 3 medium from the wells and add 2 mL per well of Stage 3 Specific medium.\nNote: Add 10 mL of Stage 3 Specific medium when using 10-cm plates.\nPlace plates back into the incubator.\nTwo days later, top up the wells with 2–3 mL of fresh Stage 3 Specific medium.",
    "From then on, perform half medium changes every 2 days, as each well of a 6-well plate can hold a total volume of 4–5 mL. Carefully remove 2 mL from the surface of the medium, tilting the plates and aspirating from the edge, as most progenitors will remain in suspension close to the bottom of the well (Figure 1[href=https://www.wicell.org#fig1], +day 18). Add the 2 mL of fresh medium slowly, without disturbing the cultures.\nNote: When using 10-cm plates, top up with 5 mL of fresh medium every 3–4 days, as they can hold up to 25 mL of medium. By using this method, cultures on 10-cm plates would not require half medium changes for harvestings performed up to days 20–22, therefore minimizing the loss of blood progenitors as compared to when performing half medium changes on 6-well plates. However, the risk of contamination is higher than when using smaller wells.\nAlternatives: If there is concern over losing hematopoietic cells during the medium change, 2 mL medium from the culture can be transferred to a 10 mL conical polystyrene tube, centrifuged at 400 × g for 3 min and the supernatant can be discarded. Resuspend the pelleted hematopoietic cells with 2 mL of fresh medium and re-add this to the culture well.\nHarvesting of Hematopoietic Cultures\nTiming: 2 h",
    "This step describes the harvest of the different cell fractions for subsequent analysis of the adherent hematopoietic cultures. It is important to first consider what cell fraction(s) is/are of interest for your experimental design and analyses. The majority of CD34+ blood progenitors will be in suspension in the cultures. However, many progenitor cells, often immature in phenotype, remain attached to the endothelium or are trapped within the EBs. The day of harvest may vary depending on the cells of interest. The first immature hematopoietic stem and progenitor cells are found immediately after the endothelial to hematopoietic transition, generally from days 13–15 of differentiation, and mostly remain adherent to the endothelium or within the EBs. These progenitors detach from the endothelium and appear in suspension in the medium from around days 16–20 and will progressively differentiate thereafter. The highest number of hematopoietic progenitors in suspension usually coincides with days 18–22 of the differentiation, with presence of both immature progenitors and more differentiated lineages. Cell sorting (Fluorescence-activated or magnetic-activated) can be performed immediately after harvesting to collect specific cell populations or to enrich for more immature cell fractions.\nFor harvesting the progenitors in the supernatant fraction:\nCollect supernatants containing “floating” blood cells in a 50 mL tube and place them on ice. Cells from multiple wells may be pooled at this stage.\nRinse the wells gently with 1 mL PBS – to collect the remaining suspension and loosely attached blood cells – and combine into the main tube.\nPellet the cells by centrifugation at 4°C.\nKeep tubes on ice until the other cell fractions are harvested or use directly for downstream analyses.\nTo collect the remaining adherent cells (hematopoietic cells, stromal cells and endothelium):\nAdd 500 μL of TrypLETM and incubate at 37°C for 5 min.",
    "Detach the EBs only, using a 1 mL pipette; the EBs are quite sticky so they will raft together.\nTransfer the EBs into a sterile tube containing 1 mL of 2 mg/mL collagenase Type 4 diluted in IMDM.\nIncubate for 30–45 min in a 37°C water bath.\nMeanwhile, detach the remaining stromal-endothelial layer by pipetting up and down or by using a cell scraper, pellet cells by centrifugation, and keep on ice.\nAfter the collagenase incubation, dissociate the EBs by passing the suspension through a range of increasing needle gauges; from 18G, 21G, 23G and finally a 25G needle (Troubleshooting 3[href=https://www.wicell.org#sec6.5]). The cells should dissociate readily if the incubation period with collagenase has been of sufficient duration.\nPellet the cells to remove residual collagenase reagent and resuspend in PBS.\nNote: The distinct suspension and adherent cell fractions can be pooled or analyzed separately.\nFilter the cell suspensions through a 70 μm sterile strainer cap sitting on a 50 mL tube to remove remaining cell aggregates.\nCollect any remaining cells in the tube by rinsing with PBS and pass through the 70 μm filter.\nPellet the filtered suspension for subsequent analysis, such as clonogenic assays and flow cytometry analysis or sorting based on hematopoietic cell surface markers (examples of conjugated antibodies to evaluate hematopoietic outcome are listed in Key Resources Table[href=https://www.wicell.org#key-resources-table] and include conjugated human CD34, CD45, CD90, CD38, and CD16)."
  ],
  "subjectAreas": [
    "Cell Differentiation",
    "Cell Culture",
    "Molecular Biology",
    "Stem Cells"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}