{
  "id": 2921,
  "origin_website": "Cell",
  "title": "Protocol for quantitative evaluation of the impact of paracrine senescence on cellular reprogramming in cultured cells and mouse models",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPART I: In vitro reprogramming using senescence conditioned medium\nSenescent cells generation via oncogene overexpression: Oncogene-induced senescence (OIS)\nTiming: 9 days\nThis section describes how to generate senescent cells via the OIS method.\nDay 1:\nSeed HEK293T cells at 5 × 106 cells/P100 plate in MEF medium overnight.\nPrepare the plasmid cocktails:\n4 μg of pBabe-ras + 4 μg of pCLEco.\n4 μg of pBabe-PURO-EGFP (PIG) + 4 μg of pCLEco.\nFor each plasmid cocktail, prepare a mix of 24 μL of Fugene6 and 576 μL of DMEM (600 μL total volume), and incubate at room temperature (RT, 20°C–25°C) for 5 min.\nAdd the plasmid cocktail into the DMEM + Fugene6 mix and incubate for 45 min at RT.\nAdd the DNA/Fugene6 mix to the HEK293T cells.\nNote: Do not remove the medium from the culture plate, simply add the Fugene6/DNA mix to the medium dropwise with the P1000 pipette, distributing it around the plate.\nThe same day, thaw one vial of the primary MEFs, and plate all of them onto one P100 plate.\nDay 2:\nReplace the HEK293T cells medium with 10 mL of fresh MEF medium.\nSeed MEFs at 5 × 105 cells/P100 plate for infection in MEF medium.\nDay 3:\nCollect the medium from transfected HEK293T cells and replace with 10 mL of fresh MEF medium.\nCentrifuge each medium separately at 2,000 g for 5 min at RT to remove cell debris.\nFilter the supernatants with 0.45 μm filters separately.\nAdd Polybrene (8 μg/mL final concentration).\nRepeat the infection one more time after 8–10 h.\nDay 4: Remove the medium, and refresh with 10 mL MEF medium.\nDay 5:",
    "Trypsinize the cells from each plate and reseed them at the 5 × 105 cells/P100 plate with MEF medium containing Puromycin (1 μg/mL).\nPlate non-infected WT MEFs at the same condition as the negative control for Puromycin selection.\nDay 7: Refresh the medium with MEF medium containing 1 μg/mL Puromycin.\nDay 9: When there is no MEFs visible from the negative control plate (usually after 96 h), remove the medium and replace with fresh conditioned MEF medium without Puromycin for conditioned medium collection.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2459-Fig1.jpg\nFigure 1. Senescent MEFs and in vitro reprogramming\n(A) SA-β-Gal staining of MEFs. Left: Control PIG infected MEFs. Right: oncogene (ras) induced senescent (OIS) MEFs.\n(B) Pictures of representative images of reprogrammable MEFs upon Doxycycline treatment (1 mg/mL). Left: pre-iPSC foci characterized by converging cells with bright edges (D4). Middle: Emerging iPSC colony characterized by bright spherical cells in the center (D8). Right: Full iPSC colonies characterized by a clear-reflective edge separation from the surrounding non-reprogrammed cells.\n(C) iPSCs colonies stained by the Alkaline phosphatase staining kit (Sigma, AB0300[href=https://www.sigmaaldrich.com/FR/en/product/sigma/ab0300]). Left: CM: non-senescent WT MEFs. Right: CM: IR-senescent WT MEFs.\nNote: At this point, if you perform the SA-β-gal assay, OIS-senescent MEFs will be stained in blue while non-senescent MEFs will not (Figure 1[href=https://www.wicell.org#fig1]A).\nCollection of senescent conditioned medium\nTiming: 6 days\nThis section describes how to collect the conditioned medium from senescent cells.\nAfter two days in conditioned MEF medium, collect the culture medium from both conditions, and replenish fresh conditioned MEF medium for next rounds of collection.\nNote: Senescent conditioned medium can be collected three times (48 h interval).\nNote: Make sure to collect the conditioned medium from the non-senescent counterpart (PIG-infected plate), which should be used as the control for senescent conditioned medium.",
    "For the collected culture medium, centrifuge for 5 min at 500 g at RT.\nFilter the supernatant with a 0.20 μm sterile filter, and store the filtered medium in several aliquots at −20°C.\nPause point: Filtered conditional medium can be stored at −20°C for up to 1 month.\nCritical: Repeated freeze/thaw cycles could greatly diminish the effects of the conditional medium. Therefore, we recommend to aliquot conditional media in proper aliquoted volumes depending on the experimental requirements to avoid repeated freeze/thaw cycles.\nIf separation of the exosomes from the soluble fraction is desired:\nCentrifuge the conditioned medium at 12,000 g for 30 min at 4°C, and retain the supernatant and discard the pellet.\nUltracentrifuge the supernatant at 100,000 g for 3 h at 4°C, and separate the supernatant from the pellet.\nNote: The supernatant contains the soluble fraction, and the pellet contains the exosomes.\nStore the soluble fraction at −20°C in aliquoted volumes.\nWash once by resuspending the exosomes in 1 mL PBS.\nUltracentrifuge at 100,000 g for 3 h at 4°C, discard the supernatant, and keep the pellet.\nResuspend the pellet in 20–50 μL PBS and store it at −20°C.\nPause point: Exosomes in PBS can be stored for up to 1 month at −20°C, or alternatively for up to 1 year at −80°C, avoiding repeated freeze/thaw cycles.\nInduction of reprogramming via senescent conditioned medium\nTiming: 10–14 days\nThis section describes how to induce reprogramming in i4F MEFs using senescent conditioned medium.\nSeed i4F MEFs at a density of 5.2 × 102 cells/cm2 (that is, 5.0 × 103 cells per well of a 6-well plate) in MEF medium.\nNote: The seeding density of the i4F MEFs is highly dependent on their reprogramming capacity. Therefore, we recommend testing the reprogramming efficiency of individual i4F MEF before this experiment.",
    "The following day, remove MEF medium, and replace it with conditioned iPSC medium freshly supplemented with DOX (1 μg/mL).\nCritical: DOX must be added freshly to iPSC medium because its stability rapidly decreases at 37°C. We recommend changing iPSC medium supplemented with DOX every two days maximum.\nChange the conditioned iPSC medium supplemented with DOX (1 μg/mL) every day.\nAfter 3 days, change the conditioned iPSC medium to normal iPSC medium freshly supplemented with DOX (1 μg/mL).\nRenew the medium every 2 days.\nNote: It takes approximately 10–14 days to generate iPSC colonies using a reprogrammable MEFs system. The experimental length and period of conditioned iPSC medium treatment may vary depending on the reprogramming system implemented. DOX concentration may also be an important factor in reprogramming efficiency for different cell types; thus, we recommend testing different DOX concentrations.\nOnce iPSC colonies become visible (Figure 1[href=https://www.wicell.org#fig1]B), stain the plates with Alkaline Phosphatase staining kit following manufacturer’s recommendations[href=https://www.sigmaaldrich.com/FR/en/product/sigma/ab0300].\nBring both BCIP and NBT solutions at RT.\nIn the meantime, remove the medium. Wash the plate once with PBS at RT.\nFix cells with 4% PFA for 15 min at RT.\nWash cells three times with PBS at RT, 5 min/wash.\nMix equal volumes of the two component solutions (BCIP and NBT). The mixture should be used within 1 h.\nAdd the mixed staining solution sufficient to cover the plate, such as 0.5 mL for one well of 6-well plate.\nPlace the plates on a shaker at RT protected from light and agitate mildly to ensure that the staining solution covers the plate.\nNote: A bluish-purple staining will form within 15–30 min (Figure 1[href=https://www.wicell.org#fig1]C).\nPART II: In vivo identification of senescent and pluripotent cells: IHC Co-staining with SA-β-gal staining\nTissue collection and procession\nTiming: 1 day",
    "This section describes how to generate cryosections from injured murine skeletal muscle.\n10 days prior of the sample collection, inject cardiotoxin (CTX) into tibialis anterior (TA) muscle of mice of both sex (2-month-old, C57/B6) to injury muscle as previously described.6[href=https://www.wicell.org#bib6]\nNote: Make sure to inject PBS in the TA of the same mouse as non-injured negative control.\nCollect TAs at 10 days post-injury:\nPlace a small amount of tragacanth gum on a slice of cork.\nExtract both TA muscles as previously described.7[href=https://www.wicell.org#bib7]\nTo ensure the transverse sections, insert the distal tendon of the TA muscle (1/4 part) into the tragacanth gum and freeze directly in liquid nitrogen cooled isopentane for 40 s as previously described.7[href=https://www.wicell.org#bib7]\nNote: Make sure the TA muscle is in a perpendicular position and in the center of the cork.\nPause point: The samples can be stored at −80°C up to 2 years.\nGenerate 10 μm cryosections as previously described.7[href=https://www.wicell.org#bib7]\nSenescence-associated β-galactosidase staining\nTiming: 48 h\nThis section describes how to perform the SA-β-Gal assay on muscle cryosections.\nAllow evaporation of tissue freezing medium for 30 min at room temperature (RT, 20°C–25°C).\nTo separate the control and save the antibody (for the immunostaining step), before placing the slides in solution, circle the section with a hydrophobic DAKO pen for IHC staining (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2459-Fig2.jpg\nFigure 2. The co-staining of SA-β-Gal and Nanog (IHC)\n(A) Circle the sections and SA-β-Gal staining.\n(B) Incubation in the dark box.\n(C and D) Representative of the co-staining. Blue dot is SA-β-Gal positive cell and brown color stained the Nanog (C) and F4/80 (D) positive cell.\nFix the sections for 15 min in SA-β-Gal staining fixation buffer at RT.\nCritical: SA-β-Gal staining fixation buffer cannot be replaced by 4% PFA, and cannot be longer than 15 min.",
    "Quickly wash (<1 min/wash) the slides three times with PBS.\nIncubate the slides in the SA-β-Gal staining buffer at 37°C protected from light for 48 h.\nNote: Cover the container with Aluminum foil to prevent evaporation.\nNote: For quantitative comparisons, all sections must be stained with the same batch of SA-β-Gal staining buffer to avoid inter-assay variation.\nCritical: pH level is critical for the staining solution (pH = 5.5).\nRefresh the staining solution after 24 h.\nCheck the slices using an inverted cell culture microscope (OLYMPUS CKX41). Once the blue color is visible (Figure 2[href=https://www.wicell.org#fig2]A), quickly wash the slices three times with PBS.\nNote: The staining duration is tissue section dependent (tissue origin and section thickness). It needs to be optimized first and should be kept consistent for the samples from the same experiment. For example, for the muscle samples, we incubate 10 μm sections for 48 h. For other tissues, the staining need to be optimized further. In general, thicker sections need shorter incubation time than thinner sections. For example, sections from kidney and lung need shorter incubation time than muscle.\nImmunohistochemistry staining (IHC)\nTiming: 24 h\nThis section describes how to perform IHC staining targeting Nanog (or F4/80) on muscle cryosections. These procedures are performed following SA-β-Gal staining.\nQuickly wash the slices three times with PBS and put the slides in 4% PFA in PBS for post-fixation for 15 min at RT.\nCritical: Post-fixation cannot be longer than 15 min.\nQuickly wash the slides three times with PBS and place them in a humid dark chamber (Figure 2[href=https://www.wicell.org#fig2]B).\nAdd 200 μL blocking buffer in every circle (labeled at step 21) for at least 30 min at RT. Prepare Nanog 1st antibody at 1:200 in blocking buffer.\nNote: The dilution of 1st antibody depends on different antibody.",
    "Remove the blocking buffer carefully. Add 200 μL 1st antibody to every circle of all the slides. For the control sections, add 200 μL blocking buffer.\nIncubate the slides overnight at 4°C in a humid dark chamber.\nPut the humid dark chamber at RT for 20–30 min and quickly wash with PBST (PBS +0.3% Triton X-100) three times.\nAdd 3% H2O2 in PBS for 20 min at RT.\nAdd 2nd antibody (Dako, ready for use, K4003) directly for 90 min at RT in the humid dark chamber.\nNote: The duration of the 2nd antibody incubation depends on different antibody.\nPrepare the DAB solution (add 20 μL substrate in 1 mL buffer according to manufacturer’s instructions[href=https://www.agilent.com/cs/library/packageinsert/public/108007002.PDF]).\nNote: protect the DAB solution from the light.\nWash three times with PBST (PBS + 0.3% Triton X-100), 5 min/wash.\nDevelop with DAB for 1 min at RT, quickly wash the slides in Milli-Q water three times.\nCounterstain with Fast-red for 10 min at RT.\nWash in tap water for 10 min.\nDehydrate in 95% ethanol for 10 min, followed by 100% ethanol baths twice, 5 min each.\nMount with Eukitt following manufacturer’s recommendations[href=https://www.sigmaaldrich.com/FR/en/product/sial/03989].\nEvaporate in the hood overnight and scan the slides using a scanning microscope OLYMPUS vs120.\nCritical: All the primary antibodies dilution and the duration of DAB staining needs to be optimized first.\nNote: This protocol can be used for other antibodies, such as F4/80.\nPART III: Semi-automatic quantification of senescent cells based on SA-β-Gal staining.\nThe entire procedure is explained in Methods video S1[href=https://www.wicell.org#mmc1] (or on YouTube with subtitles: https://www.youtube.com/watch?v=BHaThFfpkRY[href=https://www.youtube.com/watch?v=BHaThFfpkRY]) to guide you in running Showblue.\n    Your browser does not support HTML5 video.\n  \n      Methods video S1. How to run Showblue, related to all the steps in PART III\n    \nA YouTube video containing subtitles is also available following that link: https://www.youtube.com/watch?v=BHaThFfpkRY[href=https://www.youtube.com/watch?v=BHaThFfpkRY].",
    "Installation of Showblue and its dependencies\nTiming: 30 min\nThis section describes how to install Anaconda, Pycharm, Library cv2 and numpy packages, and Showblue on your computer (macOS or Windows).\nInstall these two programs on your computer:\nAnaconda[href=https://www.anaconda.com/products/distribution].\nPyCharm[href=https://www.jetbrains.com/fr-fr/pycharm/] (community version, optional).\nNote: Anaconda allows the installation of Python and the libraries required to implement the Showblue code. PyCharm allows to edit the Showblue code.\nInstall dependencies by typing these two lines of code in the Terminal (macOS) or in Anaconda Prompt (Windows).\npip install opencv-python.\nconda install numpy.\nNote: Several Python libraries are required to support Showblue: Library cv2 (4.4.0.44) and numpy (1.18.5) (compatible with the newest version).\nDownload Showblue at https://github.com/CroixJeremy2/Showblue[href=https://github.com/CroixJeremy2/Showblue] (or at https://zenodo.org/record/7528943[href=https://zenodo.org/record/7528943]) and decompress the .zip folder.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2459-Fig3.jpg\nFigure 3. Quantification folder for SA-β-Gal staining\n(A) Folder content.\n(B) Folder (cfg_fig6) for reference picture.\n(C) List of sample pictures.\nNote: The decompressed folder named “Showblue-main” (or “CroixJeremy2-Showblue-23b35b8” if downloaded via Zenodo) contains all the files displayed in Figures 3[href=https://www.wicell.org#fig3]A–3C.\nNote: on Windows, the content of “start_environment.bat” must be modified as “%windir%\\System32\\cmd.exe \"/K\" [the path of anaconda folder]\\Scripts\\activate.bat [the path of anaconda folder]”. For example, if the path to Anaconda is “D:\\programs\\anaconda”, then the content of “start_environment.bat” must be modified as “%windir%\\System32\\cmd.exe\"/K\" D:\\programs\\anaconda\\Scripts\\activate.bat D:\\programs\\anaconda”.\nPreparation of test sample images\nTiming: 30 min\nThis section describes how to prepare the test sample images in order to set up Showblue parameters.\nChoose one representative image from your samples (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2459-Fig4.jpg\nFigure 4. Setting up the reference picture\n(A) Selected picture.\n(B) Selected part of the picture.\n(C) file1_bk for labeling the blank part of the picture.\n(D) file2_inside for labeling the inside part of the picture.\n(E) t1_pt for pointing out the positive cells.\n(F) Zoom in for (E).",
    "Crop a part of the image next to the edge (Figure 4[href=https://www.wicell.org#fig4]B), and save three copies named “file1.jpg”, “file2.jpg”, and “t1.jpg” respectively in the folder named “cfg_fig6” (Figure 3[href=https://www.wicell.org#fig3]B).\nLabel the “blank area” by drawing black scribbles outside of the muscle section via an image editor software (e.g., Fiji, Paint, or Paint X) on “file1.jpg” and save the resulting image as “file1_bk.jpg” in the “cfg_fig6” folder (Figure 4[href=https://www.wicell.org#fig4]C).\nLabel the “inside area” by drawing black scribbles inside the muscle section on “file2.jpg” and save it as “file2_inside.jpg” (Figure 4[href=https://www.wicell.org#fig4]D).\nLabel SA-β-Gal+ cells by drawing white dots on top of them on “t1.jpg” and save it as “t1_pt.jpg” (Figures 4[href=https://www.wicell.org#fig4]E and 4F).\nNote: For samples from different experiments or with different colors, it is necessary to reset the references. A representative image should be selected as a reference. Pre-run the program to set up all preferences following steps 51–53. If there are few false positive or false negative detections, the program quantifies all pictures with the same preferences. Otherwise, the preferences must be adjusted manually, or the reference picture should be changed.\nPre-run Showblue to set up automatically the parameters, or manually set up the parameters.\nTiming: 10 min–45 min\nThis section describes how to pre-run Showblue on test sample images (prepared in steps 46–50) to set up automatically Showblue parameters. In addition, this section describes how to adjust manually the parameters if automatic settings are not satisfactory.\nPre-run Showblue with the annotated test sample images:\nOn macOS, right-click on the “showblue-main” folder and select “new terminal at folder”. The Terminal will appear, drag the file named show_all_fig_para.sh into the Terminal, and press enter.\nOn Windows, double click on the start_envrionment.bat file. A window will open, drag into it the file named show_all_windows_fig_para.bat, and press enter.",
    "Note: Showblue will quantify the images automatically. When the quantification is finished, a new file named “data.txt” and a new folder named “process” will be generated in the “showblue-main” folder.\nNote: Showblue will also set up all text parameters (cfg_bk.txt, cfg_in.txt, and cfg_pt.txt) in the “cfg” folder automatically according to the labeled images in the “cfg_fig6” folder. If the results are not satisfactory, the text parameters can be further adjusted manually (step 53).\nCheck the quantification results in the “process” folder (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2459-Fig5.jpg\nFigure 5. Quantification results\n(A) Files labeled “blue” display the number of SA-β-Gal+ cells (top left) and the total surface area (top right).\n(B) Zoom in of (A).\n(C) Files labeled “bound” display the edge detection of the muscle section.\n(D) Files labeled hull display the surface area that is quantified by Showblue.\nNote: The image labeled “blue” displays the number of detected SA-β-Gal+ cells (top left) and the pixels2[href=https://www.wicell.org#bib2] surface area of the muscle section (top right) (Figures 5[href=https://www.wicell.org#fig5]A and 5B). The image labeled “bound” displays the muscle section boundaries that are excluded from the analysis (Figure 5[href=https://www.wicell.org#fig5]C). And the image labeled “hull” displays the area that is analyzed (Figure 5[href=https://www.wicell.org#fig5]D).\nConfigure the Showblue settings manually if automatic settings are not satisfactory, or if you want to further optimize the detection. The text parameters are located in the folder named “cfg”:\ncfg_alpha.txt: the “alpha value” is used to adjust the sensitivity of tissue boundary detection. By default, the alpha value is set to 1. The larger the alpha value, the higher the sensitivity.\ncfg_bk.txt: it describes the “mean color value ± the standard deviations (SD)” of the points outside the tissue boundary (background).\ncfg_in.txt: it describes the “mean color value ± SD” of all the points inside the tissue boundary.",
    "cfg_pt.txt: it describes the “mean color value ± SD” of the points of interest inside the tissue boundary.\nNote: The color value is defined using an RGB color model. Each of the primary additive colors of red, green, and blue is assigned a value in the range of 0–255.\ncfg_shape.txt: the “shape value” is to remove colored cells whose shape is not of interest. The value is set ranging from 0–1. If the value is 0, all colored items are counted as cells, including dye contaminations. When the value approaches 1, the selected cells are closer to the round shape and the counting sensitivity is low.\nNote: Usually, “cfg_alpha.txt” and “cfg_shape.txt” are the two main parameters that need to be adjusted according to the detection results after running Showblue.\nRun Showblue to quantify all images at the same time\nTiming: depends on the computer power, and on the numbers and size of the images\nThis section describes how to run Showblue on a batch of images.\nCopy and paste all the images that need to be quantified into the “showblue-main” folder.\nRun Showblue:\nOn macOS, right-click on the “showblue-main” folder and select “new terminal at folder”. The Terminal will appear, drag the file named show_all_fig_para.sh in the Terminal, press enter, and let the computer work automatically.\nOn Windows, double click on the start_envrionment.bat file. A window will open, drag into it the file named show_all_windows_para.bat, press enter, and let the computer work automatically.\nNote: depending on the computer power, and the number and size of images that need to be quantified, this step can vary considerably over time.\nCheck all the quantification results in the “process” folder as described in step_52 (Figures 5[href=https://www.wicell.org#fig5]A–5D).\nImport the “data.txt” file into a spreadsheet (e.g., Microsoft Excel) for further analysis.",
    "Note: Lines in the data.txt are formatted in the following order: [image name]: [counted points]: [pixel area]: [x-pixel]: [y-pixel]: [ratio of the size of the tissue to the image]: [ratio of painted area to the cell].\nNote: [pixel area] = [x-pixel] × [y-pixel]\nCalculate the results with this equation:\nS\nA\n−\nβ\n−\nG\na\nl\n+\nc\ne\nl\nl\ns\n/\nu\nn\ni\nt\na\nr\ne\na\n=\n[\nc\no\nu\nn\nt\ne\nd\np\no\ni\nn\nt\ns\n]\n/\n[\np\ni\nx\ne\nl\na\nr\ne\na\n]\n×\n10\n6"
  ],
  "subjectAreas": [
    "Stem Cells",
    "Microscopy",
    "Cell Culture",
    "Cell Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}