{
  "id": 1884,
  "origin_website": "Cell",
  "title": "A clearing-free protocol for imaging intact whole adipose tissue innervation in mice",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nExcising intact subcutaneous adipose tissue from mice\nTiming: Dissection, 10 min; Fixation, 8–16 h\nIn this step you will remove intact axillary and inguinal subcutaneous white adipose tissues from mice for immunostaining. For a demonstration of an axillary and inguinal subcutaneous white adipose tissue (scWAT) dissection see Methods video S1[href=https://www.wicell.org#mmc1].\nEuthanize mouse\nFollow general euthanasia protocol (i.e., CO2 euthanasia followed by cervical dislocation.\nNote: This protocol is performed without perfusion. Any potential benefits or drawbacks of perfusion with this protocol have not been tested thoroughly at this time.\nCritical: Maintain inguinal scWAT orientation for all future steps, up to and including mounting. Most importantly, make note of whether the tissue was taken from mouse-left or mouse-right as the tissue will always curve towards the body when placed medial side up (congruent to tissue positioning during dissection, Figure 1[href=https://www.wicell.org#fig1]). Additionally, the axillary end of the tissue will be wider than the posterior end. With these notes in mind, if it is known which side of the mouse the depot was excised from, it can always be returned to appropriate orientation when needed.\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Subcutaneous white adipose tissue dissection, related to step 2 and 3\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1364-Fig1.jpg\nFigure 1. Excising intact subcutaneous white adipose tissue (scWAT) depots from mice\nA male C57BL/6J mouse had skin pinned back to display inguinal and axillary scWAT depots before and after excision. White dashed lines are used to accentuate tissue boundaries. Tissues were kept medial side up (as in the intact scWAT image) and directionality was maintained; anterior (A, towards head) and posterior (P, towards tail).",
    "Critical: Maintain axillary scWAT orientation for all future steps, up to and including mounting. The Axillary depot is more difficult to orientate than the inguinal depot as there are no obvious features for orientation. The most important step is to excise the tissue and place it medial side up into a well noting mouse-left or mouse-right. The axillary end of each tissue will have characteristic browning (in most cases) which can help orientate further, but this will be obscured with the addition of autofluorescence quenching stains described later.\nExcise inguinal scWAT depot.\nPlace mouse ventral side up, spray with 70% EtOH.\nMake a central incision from the base of the tail extending to the top of the sternum, being sure not to penetrate the underlying peritoneal cavity.\nGently use forceps and thumbs to pull ventral skin away from both flanks, pulling slowly with even pressure, making sure not to damage the underlying adipose tissue. The skin can be pinned back (as demonstrated in Methods video S1[href=https://www.wicell.org#mmc1]) to better expose the adipose depots.\nIdentify the inguinal scWAT depot against the skin besides each hip (Figure 1[href=https://www.wicell.org#fig1] – boundaries of each depot). Use scissors to cut the large vasculature leading to the depot and then trace the edges of the tissue, cutting along the way.\nUse forceps to gently roll the adipose away from the skin – cutting the anchoring connective tissue as you go. Continue until the entire depot is free from the skin.\nWeigh the depot and place it into a 6-well plate with 3–5 mL ice-cold 2% PFA and fix at 4°C. Fix the tissue without agitation to prevent the tissue from folding onto itself during the fixation process.\n≤0.08g ; fix for 8 h.\n>0.08g ; fix for 16–24 h.",
    "Note: Once tissues are adequately fixed without agitation, they are unlikely to fold during incubations performed on an orbital shaker as utilized in later steps.\nExcise axillary scWAT depot.\nIdentify axillary depot underneath both forelimbs (Figure 1[href=https://www.wicell.org#fig1]).\nUse forceps to pull away a thin muscle layer enveloping the dorsolateral portion of each axillary depot.\nUse scissors to trace the edges of the tissue, cutting along the way.\nUse forceps to gently roll the adipose tissue away from the skin – cutting the anchoring connective tissue as you go. Continue until the entire depot is free from the skin.\nWeigh the depot and place it into a 6-well plate with 3–5 mL ice-cold 2% PFA to fix at 4°C. Fix the tissue without agitation.\n≤0.08g; fix for 8 h.\n>0.08g; fix for 16–24 h.\nReducing tissue thickness and autofluorescence\nTiming: Z-depth reduction, 1 h 30 min; permeabilization, 12 h; autofluorescence quenching, 4 h-1 day\nAdipose tissue is notoriously difficult to image due to its size and inherent autofluorescence. In this step we will be using a combination of Z-depth reduction and various autofluorescence quenching techniques to greatly reduce tissue background autofluorescence. It should be noted that hypertrophic adipocytes, and human adipocytes, may be more prone to cell lysis on the surface of the tissue with this technique. In some instances, whole tissue imaging is not required, and instead smaller representative tissue pieces can be used. We have also outlined this alternative approach as an optional step below.\nNote: All washes and incubations are performed on an orbital shaker.\nZ-depth Reduction.",
    "Following fixation, aspirate PFA from each well of the 6-well plate and add 1× PBS w/heparin. Wash tissues for an hour at 4°C, replacing 1× PBS w/heparin after 30 min. Heparin is used here to help remove highly autofluorescent blood cells from the vasculature.\nPause point: The conclusion of any series of 1× PBS washes throughout this protocol marks a good pause point if desired (e.g. washes following fixation, autofluorescence quenching, or antibody staining.) Tissues can remain in 1× PBS for several days with no observed detriment to staining outcome. It is prudent to do antibody incubations immediately prior to imaging, for best results.\nUse forceps to take the tissue out of PBS and lay it flat onto the center of a large (75 × 51 mm) glass slide.\nUse a transfer pipette to add 2–3 drops of PBS onto the tissue to prevent the tissue from drying out.\nTake a second large glass slide and place it on top of the tissue; sandwiching the tissue betwixt.\nTake two large (5 cm wide) binder clips and clamp them onto the slides (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1364-Fig2.jpg\nFigure 2. Z-depth reduction of whole scWAT\nInguinal scWAT depot placed between two large glass slides held together with binder clips. Shown at two angles.\nAllow tissues to remain compressed for 1 h 30 min at 4°C.\nRemove binder clips and gently separate the two slides without damaging the tissue. See Figure 3[href=https://www.wicell.org#fig3] for an example of what tissues should look like after Z-depth reduction.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1364-Fig3.jpg\nFigure 3. Quenching scWAT autofluorescence\n(A and B) Intact axillary and inguinal scWAT depots immediately following Z-depth reduction (A) and subsequent autofluorescence quenching with typogen black (B).",
    "Optional: To entirely avoid compressing tissues, Z-depth reduction can be removed from this protocol by cutting each adipose tissue into 4–5 smaller pieces and following through with the remaining steps until mounting. Mount each piece of tissue onto a concave slide (0.8–1.9 mm deep, depending on tissue thickness). We do not recommend this alternative approach unless it is determined that tissue compression must be completely avoided. Only the most superficial structures will be visible. See Willows et al. (2021)[href=https://www.wicell.org#bib4] for a comparison of both appropaches.\nBlocking and Permeabilization.\nOnce the slides are separated place the tissue back into a 6-well plate with 3–5 mL blocking buffer at 4°C for 16–24 h to reduce non-specific binding of antibodies.\nNote: Here, bovine serum albumin is used as the blocking agent with great effect. Alternatively, using secondary-matched sera as a blocking agent is common with many other immunostaining protocols, but has not yet been thoroughly evaluated for use with this protocol.\nNote: For larger tissues (>0.30 g) extend the blocking & permeabilization period to 3 days. Exchange fresh blocking buffer daily.\nAutofluorescence Quenching.\nThere are four approaches (used separately) that can be taken to mitigate tissue autofluorescence, each with their own pros and cons summarized here and in greater detail in Willows et al. (2021)[href=https://www.wicell.org#bib4].\nOption 1 – typogen black: Incubate tissues in 0.1% typogen black for 20 min at ∼20°C followed by washing the tissue in 1× PBS for 4 h at ∼20°C , replacing PBS every 1 h. See Figure 3[href=https://www.wicell.org#fig3] for an example of what tissues should look like after incubation in typogen black.\nPro – a good balance between blocking autofluorescence and maintaining fluorophore signal intensity.\nCon – typogen black staining fluoresces with far-red (647 nm) excitation.",
    "Option 2 – TrueBlack: incubate tissues in 1× (0.1%) TrueBlack® Lipofuscin Autofluorescence Quencher for 10 min at ∼20°C followed by washing the tissue in 1× PBS for 4 h at 4°C, replacing PBS every 1 h.\nPro – does not fluoresce in far-red wavelength.\nCon – can diminish endogenous and immuno-fluorescence intensity by overly masking areas in black haze. This can hide low-intensity structures such as small neurites.\nOption 3 – H2O2 Bleaching: stepwise dehydration in MeOH diluted in 1× PBS (50% MeOH, 1 h; 80% MeOH, 1 h; 100% MeOH, 2 h, replaced fresh after 1 h) at ∼20°C Bleach in 5% H2O2 in 20% DMSO/MeOH (recipe in materials and equipment) for 16–24 h at 4°C. This is then followed by rehydration (100% MeOH, 2 h, replaced fresh after 1 h; 20% DMSO/MeOH (recipe in materials and equipment), 1 h; 80% MeOH, 1 h; 50% MeOH, 1 h; 1× PBS, 2 h, replaced fresh after 1 h) at ∼20°C. Adapted from Renier et al. (2014)[href=https://www.wicell.org#bib3].\nPro – reduces autofluorescence without affecting fluorophore intensity.\nCon – de/rehydration steps add several hours, and bleaching adds an additional day to the protocol. MeOH preparation has been demonstrated not to be compatible with some antibodies as it can denature epitopes (Renier et al., 2014[href=https://www.wicell.org#bib3]) and should be tested and validated on a case by case basis.\nOption 4 – Room Temperature: doing all future steps at ∼20°C (even when recommended at 4°C) will reduce tissue autofluorescence, but only slightly.\nPro – shortens protocol by at least 4 h while still offering some level of autofluorescence reduction.\nCon – the least effective means of reducing autofluorescence and performing all future steps at ∼20°C can result in increased non-specific binding of antibodies.",
    "Optional: Washes following autofluorescence quenching techniques can be performed in 1× PBS w/ heparin to further reduce vascular autofluorescence. Additionally, sodium azide can be added to PBS at a concentration of 0.02% for all future washes to prevent microbial growth.\nCritical: The addition of non-ionic detergents (Triton X-100, Tween 20) into wash buffers is common to many immunostaining protocols, but if using typogen black or TrueBlack autofluorescence quenching, avoid the addition of these detergents as they can wash out these stains from the tissue, greatly reducing their quenching potential. The use of detergents has not been tested with the other quenching techniques.\nFluorescent labeling\nTiming: 1–7 days\nThe following steps outline how to fluorescently label Z-depth reduced adipose tissues or tissue blocks with primary antibodies, secondary antibodies, isolectin-IB4, and DAPI. It is important that, to reduce non-specific binding and cross reactivity, co-staining follows the order outlined below.\nNote: All washes and incubations are performed on an orbital shaker.\nUsing a Direct Reporter with Endogenous Fluorescence\nFor mouse reporters with high signal intensity you can proceed directly to step 12 or if co-labeling is desired, proceed to step 8.\nFor mouse reporters with low signal intensity it is recommended to boost the endogenous signal with a fluorophore conjugated antibody raised against the fluorescent protein of interest (i.e., anti-GFP conjugated Alexa488). This should be conducted immediately after step 9 is completed.\nPrimary Antibodies.",
    "To make primary antibody solution, you will dilute desired primary antibody in 1× PBS. Dilutions are antibody specific but typically range from 1:100 to 1:500. For antibodies not validated in this protocol, we recommend performing an antibody titration to find what works best. When titrating antibodies for this protocol, it is best to start with what works well for thin sections as this can provide decent enough staining. However, concentrating this further by two-fold typically results in the best outcomes. Concentrations for antibodies that we have validated with this protocol can be found in the key resources table[href=https://www.wicell.org#key-resources-table].\nCritical: Non-ionic detergents are commonly added to antibody solutions to increase antibody permeation and reduce non-specific binding, however, as mentioned previously, detergents can reduce the effectiveness of typogen black and TrueBlack, and has not been tested with the other quenching techniques.\nYou will need 3–5 mL of antibody solution per tissue, 3 mL being the absolute minimum if using a 6-well plate (see “troubleshooting[href=https://www.wicell.org#troubleshooting]”.)\nIncubate tissues in primary antibody solution for 2 days at 4°C.\nAfter incubation, wash tissues in 1× PBS for 4 h at 4°C, replacing PBS every 1 h.\nNote: Perform sequential staining of antibodies when co-staining.\nNote: Only validated antibodies, tested in a Western Blot for specificity, and ideally with knock-out tissues and proper tissue controls, should be used for this procedure.\nSecondary Antibodies\nIf not using a directly conjugated primary antibody, dilute the desired secondary antibody in 1× PBS. Again, dilutions will be antibody and fluorophore specific, and should be optimized by titration. Secondary antibody concentrations tend to be identical to that used for immunostaining thin sections as recommended by the vendor. Only Alexa Fluor conjugated antibodies have been validated for this protocol. See validated secondary antibody concentrations in the key resources table[href=https://www.wicell.org#key-resources-table].",
    "Incubate tissues in secondary antibody solution for 16–24 h at 4°C.\nAfter, wash tissues in 1× PBS for 4 h at 4°C, replacing PBS every 1 h.\nIf co-staining with additional primary antibodies go back to step 8. If not, continue to step 10.\nCritical: We recommend avoiding the use of anti-mouse secondary antibodies. In most cases, non-specific binding has been unavoidable even with mouse-on-mouse blocking solutions. We recommend using antibodies raised in mice that are directly conjugated to a fluorophore, or preferably, using primary antibodies raised in alternative species such as rabbits.\nIsolectin-IB4 Vascular Staining\nIf desired, label tissue vasculature using an Isolectin GS-IB4 Alexa Fluor conjugate. See validated conjugates in the key resources table[href=https://www.wicell.org#key-resources-table].\nStart by making Isolectin-IB4 working solution. This can be made up in advance and frozen until time of use. Recipe described in materials and equipment.\nAllow Isolectin-IB4 working solution to warm to ∼20°C if not already. Add 3–5 mL to each tissue and incubate 16–24 h at ∼20°C.\nWash tissues in 1× PBS for 2 h at ∼20°C, replacing PBS every 1 h.\nOptional: 5 μg/mL Isolectin-IB4 working solution can be further diluted to 1 μg/mL to save on reagents with only a slight decrease in fluorescence intensity.\nDAPI Nuclear Staining\nIf nuclear labeling is desired, start by making DAPI working solution from stock (described in materials and equipment[href=https://www.wicell.org#materials-and-equipment]), to be used fresh.\nIncubate tissues in 3–5 mL DAPI working solution for 1 h at ∼20°C.\nWash in 1× PBS for 2 h at ∼20°C, replacing PBS after 1 h.\nMounting tissues\nTiming: 3 days\nA benefit of our protocol is the ability to permanently mount entire subcutaneous adipose tissues onto glass slides. Below we outline the steps for mounting.\nMounting tissues.",
    "Label the top of a large glass slide with mouse and tissue identifying information.\nRemove tissue from 6-well plate and place it at the center of the large glass slide.\nAdd a generous amount (4–6 drops) of glycerol based mounting fluid to the tissue and place a large (48 × 60 mm) glass coverslip over the tissue.\nNote: Glycerol-based mountants are more compatible with lipid laden tissue, and the added viscosity aids in adhering the coverslip to the slide. Incomplete coverslip adherence will result in tissues drying out, tissue oxidation, and decreased fluorophore lifespan.\nApply gentle pressure to the coverslip to help it adhere to the tissue and slide. This is required for the next step to prevent the coverslip from sliding off the tissue.\nPlace the coverslipped slides underneath uniform weight (15–20 kg) for 3 days. Ten textbooks placed over a series of slides works very well.\nAfter 3 days, remove the slide from underneath the textbooks and seal the edges with nail polish (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1364-Fig4.jpg\nFigure 4. Mounting whole scWAT onto glass slides\nWhole axillary and inguinal scWAT depots were fully mounted and sealed following immunostaining. Anatomical orientation was maintained by placing the tissues medial side up with the anterior portion of the tissue closest to the label.\nLet dry for 5 min and proceed to imaging.\nNote: For best outcome we recommend imaging within a week after mounting is complete. However, tissues are typically viable for imaging up to several weeks after mounting, and in some cases even several months.\nImaging\nTiming: 1 min-40 h\nUnique to this tissue processing approach is the ability to image whole adipose tissues effectively on standard widefield epifluorescence microscopes as well as confocal microscopes. Below are descriptions for best utilizing both methods of imaging.\nWidefield Epifluorescence Microscopy\nApplication:",
    "Suitable for single channel imaging, most qualitative analysis, and answering ‘yes or no’ questions through representative images. Fast time to image with only minutes needed to set up and capture several images.\nMagnifications:\nImages of adipose tissue can be captured on widefield microscopes easily using up to 40× objectives. Higher magnifications are possible but the associated decrease in working distance will make it a challenge to capture an in-focus image of large tissues.\nExtended Depth of Field (EDF):\nAfter Z-depth reduction, tissue thickness will still range 40–200 μm. It can be difficult to capture images with the entire field of view in focus. A widefield microscope equipped with software capable of EDF can generate images with more of the field of view in focus. However, if EDF is pushed passed reasonable limits it can create artefact in your image.\nBackground Autofluorescence:\nEven with autofluorescence quenching, background will still be present on epifluorescence microscopes (see “troubleshooting[href=https://www.wicell.org#troubleshooting]”). Strong staining and bright fluorophores can help overcome this, but confocal microscopy will further help to reduce background.\nConfocal Microscopy\nApplication:\nSuitable for quantification, demonstrating colocalization, and generating 3D images of specific regions or entire tissues to capture total neurovascular structure.\nMagnifications:\nConfocal microscopy is capable of imaging whole adipose tissues with up to 63× objectives without difficulty – further increased with confocal zoom. We have not tried higher objective magnifications at this time.\nTiled Z-stacks:",
    "Entire adipose depots can be imaged in a series of Z-stacks extending through the entire tissue thickness. These can be tiled together to create one large 3D image. These can then be maximum intensity projected to create a 2D representation of the 3D data. These tiled z-stacks of whole tissues can be very time consuming to capture; taking anywhere from 8 to 40 h depending on the size of the tissue, number of fluorophores being captured, and the desired XY and Z resolutions."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Metabolism",
    "Microscopy",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}