{
  "id": 13299,
  "origin_website": "Jove",
  "title": "A Mouse Model of Subchronic and Mild Social Defeat Stress for Understanding Stress-induced Behavioral and Physiological Deficits",
  "procedures": [
    "The animal studies were approved by and met the guidelines of both the Animal Care and Use Committee of Ibaraki University and the Ministry of Education Culture, Sports, Science, and Technology (MEXT), Japan (Notification No.71). A complete overview of the protocol is shown in Figure 1.\n1. Apparatus\nPrepare two kinds of cages: a single cage (width [W] × depth [D] × height [H] = 143 mm × 293 mm × 148 mm), and a “social defeat (SD)” cage (W × D × H = 220 mm × 320 mm × 135 mm).\nAs shown in Figure 2, divide the SD cage into two compartments with an acrylic transparent board divider (5-mm thick) with 15 circular holes (3 × 5 matrix: 8 mm in diameter).\nObtain wood-shaving chips made from spruce trees, purified-diet food pellets, and a drinking water bottle. In addition, obtain paper towels, a mask, and latex gloves.\nFor the social interaction test, prepare an open-field arena (W × D × H = 40 cm × 40 cm × 40 cm) made of gray polyvinylchloride, a weight made of steel (190 g), and a plastic interaction box (W × D × H = 10 cm × 10 cm × 13 cm; 100 g) with three wire-mesh windows (W × D = 5 cm × 5 cm) (Figure 3).\nPlace a CCD camera (2.8–12 mm; F = 1:1.4; 1/3 inch CCD) and an automated tracking system in the behavioral testing room in the animal facility. Place an appropriate shelf for the mouse cages in the behavioral testing room to habituate the mice to the environment of the testing room for at least 30 min.\n2. Habituation to the Environment",
    "Use male C57BL/6JJmsSlc (B6) mice that are 7 weeks old and male Slc:ICR (ICR) mice that are over 5 months old and deliver to the facility from an animal breeding company.\nIndependently move two groups of B6 mice (n = 12 in each group) to the facility; use one group (screener B6 mice) for screening aggressive ICR mice and another group (subject B6 mice) for developing the sCSDS model.\nIntroduce ICR mice (n = 12) to the facility in order to screen their aggressive behaviors.\nHouse the mice individually in single cages for 1 week under a 12-hr light-dark cycle (around 100 lux fluorescent light, lights on at 08:00) with constant temperature (around 23 °C) and humidity levels (around 40%) in order to habituate them to the environment. Partition each cage by placing white-colored plastic boards between the cages so that the mice are not affected by the behaviors of neighboring mice.\nMake purified-diet food pellets and reverse osmosis water available ad libitum. Use AIN-93G chow because the ingredients of other non-purified diet pellets may vary.\nMeasure body weight, food intake (FI), and water intake (WI) of the mice every day. Calculate the body weight gain (BWG) from the initial day.\n3. Screening of Aggressive ICR Mice\nAfter habituation for 1 week as mentioned above, screen the ICR mice (resident) using resident-intruder tests for a 3 min trial with screener B6 mice (intruder; 8 weeks of age) in the afternoon (14:00-17:00) under lighting of around 300 lux in the housing room.",
    "Specifically, test each ICR mouse for three trials per day for 5 consecutive days (15 trials in total) toward many different B6 mice as possible to find which ICR mice show high aggression toward the intruders. During the tests, record the attack latency and duration of the aggressive behavior (rapid motions with attack biting).\nIdentify hyper-aggressive ICR mice by checking the damage wounds on B6 intruder mice after each trial.\nCalculate the ratio of trials in which the attack latency is less than 30 sec as a first index of the aggression score.\nCalculate the ratio of trials in which the attack latency is less than 3 min as a second index of the aggression score.\nEvaluate the aggression scores from the first index. Use the second index when the first index is equal.\nSelect the ICR mice that had high aggression scores without hyper-aggressive behaviors as aggressive ICR mice. Use the aggressive ICR mice repeatedly throughout the next set of experiments until approximately 12 months of age; however, perform the screening process for aggressive ICR mice as described above before every experiment to confirm the aggressiveness of ICR mice.\nAfter each session of the screening, record the degree of injury of the screener B6 mice.  If a mouse is wounded, isolate the mouse in a single cage and observe the progress by checking its body weight gain, food intake, and water intake. In the case of severe wounds which affect physiology and behavior in mice,  euthanize them according to local IACUC guidelines.\n4. sCSDS\nIntroduce subject B6 mice 7 days before (day -6) the day of the initial stress exposure (day 1) and house the mice individually in single cages to habituate them to the environment.",
    "Three days before day 1 (on day -2), move the aggressive ICR mice into a compartment of each SD cage, which is divided by an acrylic divider to let the mice establish their territories in the SD cages (the same number of subject B6 mice).\nDivide the SD cages by using white-colored partitioning boards, as in the single-cage condition described above.\nFor non-stressed control B6 mice, prepare SD cages (half the number of mice) to keep the mice in pairs; place two mice into each compartment divided by the divider in an SD cage for 10 days.\nAfter the daily BWG, FI, and WI measurements on day 1, place subject B6 mice into one of the compartments of the SD cages (resident’s home-cage) in the afternoon (14:00–16:00) under lighting of around 300 lux in the housing room and measure the physical contact time from the first attack bite to complete the resident-intruder test.\nOn day 1, set the physical contact time to 5 min from the first attack bite and have observers count the number of attack bites by ICR mice that are directed preferentially at the back or flanks of the opponent as described by Miczek et al.20 to determine the degree of physical stress to B6 mice.\nAfter the physical contact time, rescue subject B6 mice, and check and record their fur status and wounds. Then, place the B6 mice into another compartment next to the ICR mice in the SD cages until exposure to physical stress the next day.\nBecause the acrylic divider in the SD cage is transparent and contains holes, expose subject B6 mice to various emotional stresses, including visual, auditory, and olfactory stimuli, from the ICR mice in the neighboring compartment of the SD cage for 24 hr every day.",
    "Measure the BWG, FI, and WI of control B6 mice daily and then place them into each compartment in the SD cages for 1 day.\nOn day 2, after the daily measurements of BWG, FI, and WI, introduce subject B6 mice into the territories of other ICR mice to expose them to physical stress.\nSet the duration of physical contact at 4.5 min from the first attack bite on day 2, and count the number of attack bites.\nMove control B6 mice into different compartments and change the pair combinations in order to shuffle the placement and partner of the pairs every day.\nDecrease the duration of physical contact by 0.5 min per day, so that the duration on day 10 is set to 0.5 min from the first attack bite.\nOn day 7, replace approximately half of the wood shavings in all of the compartments in the SD cages.\nAfter exposure to the last physical stress on day 10, move subject B6 mice into single cages. Similar to the subject B6 mice, move control B6 mice into single cages on day 10.\nIf an ICR mouse does not show any attack bites until 5 min in each trial on days 1 to 10, terminate the trial. Replace the ICR mouse with spare aggressive ICR mice and conduct an alternative trial for the subject B6 mouse.\nIf a mouse is wounded, isolate the mouse in a single cage and observe the progress by checking its body weight gain, food intake, and water intake. Follow your IACUC guidelines for analgesia.  In the case of severe wounds which affect physiology and behavior in mice, euthanize them according to local IACUC guidelines.\n5. Social Avoidance Test (Social Interaction Test)\nPerform behavioral tests for social avoidance in the morning (09:00–12:00) on day 11.",
    "Thirty minutes before the test, transfer the cages of control and subject B6 mice onto a shelf (dim light of less than 1 lux) in the behavioral testing room under lighting of less than 20 lux to allow them to habituate to the environment.\nTo reduce order-effects, alternately test control and subject B6 mice.\nClean an open-field arena (illuminated with a light of 20 lux at the center of the field) and a plastic interaction box using paper towels soaked with 70% ethanol before the behavioral test for each mouse to remove feces, urine, and any odors.\nPlace an unfamiliar ICR mouse (not used as an aggressor) from a single cage near the open-field apparatus.\nPlace a B6 mouse into the open field of the vacant interaction box as shown in Figure 4. Monitor and analyze its behavior for 2.5 min using the automatic analysis system (described in step 5.10).\nAfter the first trial, remove the B6 mouse from the field and place it into its home cage.\nFollowing this, place the unfamiliar male ICR mouse (social target) into the interaction box and then introduce the B6 mouse into the open field and monitor its behavior for 2.5 min.\nAfter the second trial, return both the B6 and ICR mice to their home cages, and clean the field and the interaction box as mentioned above.\nRepeat these steps for each B6 mouse to test its social behavior. During each trial, record top-view movies using a CCD camera.\n\t\nAfter the behavioral tests, calculate the time spent in the interaction zone (in seconds) and in the corner zone (in seconds) for each trial as shown in Goto et al.13. Judge the position of the mouse based on the center of the mouse.",
    "Calculate the social interaction scores as 100 × (interaction time, with target)/(interaction time, without target), following the methods published in Krishnan et al.21.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}