{
  "id": 19835,
  "origin_website": "Wiley",
  "title": "Programmable Gene Knockdown in Diverse Bacteria Using Mobile-CRISPRi",
  "procedures": [
    "This protocol describes how to design an exhaustive list of 20-nucleotide sgRNA spacers using a command-line interpreter. The process is streamlined and should be modified by changing the environment variable “ACC_NO” to specify a chromosomal accession number. Steps 1 and 2 are only required in the first setup and should be omitted afterwards.\nMaterials\nLinux- or Unix-compatible computer with Internet access and the following software:\n               \nConda (https://docs.conda.io/projects/conda/en/latest/[href=https://docs.conda.io/projects/conda/en/latest/])\nGitHub (https://github.com/[href=https://github.com/])\nExcel or other spreadsheet management software\nDownload dependencies for sgRNA design script\n1. Prepare a conda environment, “sgrna_design”, to host the sgRNA design scripts. It is only necessary to perform environment creation once.\n         \nconda create -n sgrna_design -c bioconda `bowtie=1.2.3' biopython pysam entrez-direct git `python>3'\n2. Retrieve the “sgrna_design” project from GitHub, then move into the newly created directory. It is only necessary to perform project download once.\n         \ngit clone https://github.com/ryandward/sgrna_design.git && cd sgrna_design\nActivate Conda environment\n3. Activate the environment to load script dependencies This is required every time a new terminal window is opened.\n         \nconda activate sgrna_design\nObtain genome sequence data from NCBI using the accession number\n4. If not known, consult the NCBI Nucleotide Database (see Internet Resources) to locate the accession number corresponding to the chromosome of interest, and adjust the environment variable “ACC_NO” accordingly. This example uses the E. coli MG1655 chromosome “U00096.3”; this number will serve as the template for the names of all other files.\n         \nACC_NO=\"U00096.3\"\n5. Retrieve and save the GenBank chromosome file (.gb file)—here automatically named U00096.3.gb. This command also issues a warning if NCBI returns an empty response and may be run multiple times as needed.\n         \nefetch -db nuccore -format gb -id $ACC_NO > ${ACC_NO}.gb && file ${ACC_NO}.gb | grep -iq ascii && echo \"File contains data, continue.\" || echo \"Empty file, retry this step.\"\nRun sgRNA design script",
    "6. Run the main python script, producing a tab-separated variable file corresponding to the accession number followed by \"_sgrna\". Upon successful completion, this command also confirms the name of the results file—here \"U00096.3_sgrna.tsv\".\n         \n./build_sgrna_library.py --input_genbank_genome_name ${ACC_NO}.gb --tsv_output_file ${ACC_NO}_sgrna.tsv && echo \"Output saved as ${ACC_NO}_sgrna.tsv\"\nThese results can be accessed by navigating to the present working directory and viewed using a spreadsheet utility, text editor, or command-line interpreter tool (e.g., cat).\nAdditional documentation is available at the GitHub repository sgrna_design (see Internet Resources at end of article).",
    "This protocol describes the construction of Mobile-CRISPRi vectors encoding an sgRNA spacer targeting a gene of interest. Two oligonucleotides are designed such that when annealed, they form the desired sgRNA spacer sequence with overhangs enabling ligation into a BsaI-digested Mobile-CRISPRi plasmid (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-fig-0002]). The resulting plasmid, which contains the entire Mobile-CRISPRi system encoding the sgRNA, dCas9, and antibiotic resistance marker between Tn7 transposon ends, can be used as a donor for transposition of the system into the recipient attTn7 site.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/6b4448d8-b4f1-44a7-8fd8-c62e59812b65/cpmc130-fig-0002-m.jpg</p>\nFigure 2\nsgRNA spacer cloning. Shown here is the sgRNA module from the Mobile-CRISPRi plasmid pJMP1339. Annealed oligos with BsaI-compatible sticky ends are ligated into the BsaI-cut vector (BsaI recognition sites are lost in the cloning process). This figure depicts a spacer targeting mRFP, but 20-nt spacer sequences targeting any gene of interest can be cloned using this protocol.\nMaterials\nMobile-CRISPRi plasmid DNA (see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-tbl-0001])\nBsaI-HF-v2 restriction enzyme and 10× CutSmart buffer (NEB R3733)\nDNA spin-purification kit (e.g., NEB T1030 or Zymo Research D4003)\nCustom oligonucleotides (Top and Bottom, each 100 µM; see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-prot-0002], Strategic Planning, and Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-fig-0002])\nT4 DNA ligase with 10× buffer (e.g., NEB M0202)\n1 mM ATP (e.g., Thermo R0441, diluted 100×)\n100 mM dithiothreitol (DTT; see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-rec-0003])\nElectrocompetent E. coli cells (pir+ strain, BW25141; Support Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-prot-0007])\nLB agar with 100 µg/ml ampicillin agar plates\nLiquid LB medium with 100 µg/ml ampicillin\nPlasmid DNA miniprep kit (e.g., Thermo GeneJet kit K0502)\nTable 1.\n                Mobile-CRISPRi Plasmids\ntable:\n﻿JMP no.,Addgene no.,Rep.,Antibiotic res.a[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-tbl1-note-0001_55],sgRNA prom.,sgRNA,dCas9 prom.,dCas9,Comment\nICEBs1 system,,,,,,,,\npJMP1333,119268.0,mRFP,\"ampR, kanR\",Pveg,mRFP (NT1),Pxyl/tet,Spy::3Xmyc,mRFP “test” (– sgRNA)\npJMP1335,119269.0,mRFP,\"ampR, kanR\",,,Pxyl/tet,Spy::3Xmyc,mRFP “test” (+ sgRNA)\npJMP1337,119270.0,,\"ampR, kanR\",Pveg,None (BsaI),Pxyl/tet,Spy::3Xmyc,For cloning new sgRNAs\nTn7 system,,,,,,,,\npJMP1039,119239.0,,\"ampR, N/A\",,,,,Expresses Tn7 transposase\npJMP1183,119254.0,mRFP,\"ampR, kanR\",PLlacO1,mRFP (NT1),PLlacO1,Spy::3Xmyc,mRFP “test” (+ sgRNA)\npJMP1185,119255.0,mRFP,\"ampR, kanR\",,,PLlacO1,Spy::3Xmyc,mRFP “test” (– sgRNA)\npJMP1187,119256.0,mRFP,\"ampR, kanR\",PLlacO1,mRFP (NT1),PLlacO1,HSA Spy::3Xmyc,mRFP “test” (+ sgRNA)\npJMP1189,119257.0,mRFP,\"ampR, kanR\",,,PLlacO1,HSA Spy::3Xmyc,mRFP “test” (– sgRNA)",
    "pJMP1339,119271.0,,\"ampR, kanR\",PLlacO1,None (BsaI),PLlacO1,HSA Spy::3Xmyc,For cloning new sgRNAs\npJMP1354,119275.0,,\"ampR, tmpR\",PLlacO1,None (BsaI),PLlacO1,HSA Spy::3Xmyc,For cloning new sgRNAs\npJMP1356,119276.0,,\"ampR, cmR\",PLlacO1,None (BsaI),PLlacO1,HSA Spy::3Xmyc,For cloning new sgRNAs\npJMP1358,119277.0,,\"ampR, spcR\",PLlacO1,None (BsaI),PLlacO1,HSA Spy::3Xmyc,For cloning new sgRNAs\npJMP1360,119278.0,,\"ampR, gentR\",PLlacO1,None (BsaI),PLlacO1,HSA Spy::3Xmyc,For cloning new sgRNAs\npJMP2754,160666.0,sfGFP,\"ampR, gentR\",PLlacO1,None (BsaI),PLlacO1,Spy::3Xmyc,sfGFP “test” (– sgRNA)\npJMP2774,160667.0,sfGFP,\"ampR, gentR\",PLlacO1,Gmc6 (sfgfp),PLlacO1,Spy::3Xmyc,sfGFP “test” (+ sgRNA)\npJMP2782,160668.0,,\"ampR, gentR\",PLlacO1,None (BsaI),PLlacO1,Spy::3Xmyc,For cloning new sgRNAs\npJMP2820,160669.0,sfGFP,\"ampR, cmR\",PLlacO1,None (BsaI),PLlacO1,Spy::3Xmyc,sfGFP “test” (– sgRNA)\npJMP2822,160670.0,sfGFP,\"ampR, kanR\",PLlacO1,None (BsaI),PLlacO1,Spy::3Xmyc,sfGFP “test” (– sgRNA)\npJMP2824,160671.0,sfGFP,\"ampR, spcR\",PLlacO1,None (BsaI),PLlacO1,Spy::3Xmyc,sfGFP “test” (– sgRNA)\npJMP2832,160672.0,sfGFP,\"ampR, cmR\",PLlacO1,Gmc6 (sfgfp),PLlacO1,Spy::3Xmyc,sfGFP “test” (+ sgRNA)\npJMP2834,160673.0,sfGFP,\"ampR, kanR\",PLlacO1,Gmc6 (sfgfp),PLlacO1,Spy::3Xmyc,sfGFP “test” (+ sgRNA)\npJMP2836,160674.0,sfGFP,\"ampR, spcR\",PLlacO1,Gmc6 (sfgfp),PLlacO1,Spy::3Xmyc,sfGFP “test” (+ sgRNA)\npJMP2844,160675.0,,\"ampR, cmR\",PLlacO1,None (BsaI),PLlacO1,Spy::3Xmyc,For cloning new sgRNAs\npJMP2846,160676.0,,\"ampR, kanR\",PLlacO1,None (BsaI),PLlacO1,Spy::3Xmyc,For cloning new sgRNAs\npJMP2849,160677.0,,\"ampR, spcR\",PLlacO1,None (BsaI),PLlacO1,Spy::3Xmyc,For cloning new sgRNAs\na Resistance(s) of recipient E. coli. ampR, ampicillin resistance; cmR, chloramphenicol resistance; gentR, gentamycin resistance; kanR, kanamycin resistance; spcR, spectinomycin resistance; tmpR, trimethoprim resistance.\nRep., reporter; prom., promoter. All plasmids have the R6K ori (replicate only in pir+ strains); gmc6 encodes sfGFP sgRNA (CATCTAATTCAACAAGAATT); mRFP (NT1) encodes mRFP sgRNA (AACTTTCAGTTTAGCGGTCT); HSA Spy::3Xmyc dCas9 is human codon optimized, “None (BsaI)” sgRNA has a BsaI cloning site for insertion of new sgRNA encoding DNA; PLlacO1 promoters are regulated by lacIq; and Pxyl/tet promoter is regulated by TetR.\nPrepare BsaI-digested Mobile-CRISPRi plasmid\n1. Digest 1 µg plasmid DNA by setting up the following reaction mixture:\n         \ntable:\n﻿Component,Volume\n10× CutSmart buffer (NEB),5 µl\nPlasmid DNA (100 ng/µl),10 µl\nBsaI-HF-v2 (NEB),1 µl\nDeionized H2O,34 µl\nTotal,50 µl.\nAdjust DNA and water volume as necessary according to DNA concentration. Scale reaction as necessary to ensure that plasmid DNA concentration does not exceed 25% of reaction and according to the total amount of digested plasmid needed for planned ligations (∼50 ng digested plasmid/ligation).\n2. Incubate 2-8 hr at 37°C to digest.\n3. Incubate 20 min at 80°C to heat inactivate.",
    "4. Purify the digested plasmid using a DNA spin-purification kit according to the manufacturer's protocol. Elute in 10 µl.\nUse a kit that allows elution in low volumes. Heating the elution buffer to 50°C may increase yield.\nAnneal oligonucleotides\n5. Set up each oligonucleotide annealing reaction:\n         \ntable:\n﻿Component,Volume\n10× CutSmart Buffer (NEB),5 µl\nOligonucleotide-Top (100 µM),1 µl\nOligonucleotide-Bottom (100 µM),1 µl\ndH2O,43 µl\nTotal,50 µl.\n6. Incubate 5 min at 95°C to denature DNA.\n7. Cool ∼15 min to room temperature to anneal oligonucleotides.\n8. Dilute 1:40 in deionized water.\nLigate BsaI-digested plasmid and annealed oligonucleotides\n9. Set up each ligation:\n         \ntable:\n﻿Component,Volume\n10× T4 DNA ligase buffer,1 µl\n1 mM ATP,1 µl\n100 mM DTT,1 µl\nT4 DNA ligase,0.5 µl\n1:40 diluted annealed oligonucleotides (step 8),2 µl\n50 ng BsaI-digested plasmid (step 4),X µl\nDeionized water,X µl\nTotal,10 µl.\nAdjust volumes of water and plasmid as needed depending on concentration of plasmid so that the total reaction volume equals 10 µl. For increased efficiency and accuracy, set up a premix for multiple reactions that includes all components except annealed oligonucleotides, and then transfer aliquots of premix into to tubes and add annealed oligonucleotides.\nAlways include a plasmid vector only/no annealed oligonucleotide ligation as a negative control to ensure complete digestion of plasmid DNA. A positive control reaction can be set up if desired using the mRFP targeting oligos shown in Figure 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-fig-0002].\n10. Incubate 1-2 hr at room temperature to ligate.\n11. Incubate 15 min at 65°C to heat inactivate.\nTransformation\n12. Follow Support Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-prot-0007] to transform 1 µl of ligation mix into E. coli BW25141 and select on LB-ampicillin agar plates.",
    "Compare the transformants from the ligations that had annealed oligos to the digested plasmid only negative control. The negative control should have few or no colonies (<10% the amount for the other ligations). If there is a high background on the negative control plate, digest the plasmid again and repeat the ligation and transformation.\nExtract plasmid DNA and confirm sequence\n13. Pick an isolated colony into 5 ml LB + ampicillin medium in a culture tube and incubate cultures ∼16 hr at 37°C, shaking at 250 rpm or on a roller drum.\n14. Pellet cells from entire 5-ml culture and extract plasmid DNA using a kit following the manufacturer's instructions.\nThe Mobile-CRISPRi plasmids are fairly large (∼10-12 kb) and low copy. Extracting the entire 5-ml culture and eluting in ∼40 µl typically yields ∼100 ng/µl plasmid DNA. Warming the elution buffer to 50°C and waiting ∼2 min after applying the buffer to the column before spinning may increase yield.\n15. Sequence the region of the plasmid near the insertion site to confirm the insertion and the fidelity of the cloning.",
    "This protocol transfers the Tn7-based Mobile-CRISPRi system into the chromosome of a Gram-negative bacterium of interest. E. coli donor strains have a chromosomal copy of the RP4 transfer machinery to mobilize the Tn7 plasmids. A plasmid with a Tn7 transposon carrying CRISPRi components and a second plasmid encoding Tn7 transposition genes are transferred to recipient bacteria by triparental mating. In the recipient, transposition proteins integrate the CRISPRi system into the recipient genome downstream of the glmS gene. Selection on plates lacking DAP eliminates the DAP-dependent E. coli donors, whereas R6K ori plasmids are lost because they cannot replicate in recipient cells that lack the pir gene. Antibiotic selection results in retention of only the recipients with an integrated CRISPRi system. Once integrated into the chromosome, the Mobile-CRISPRi system is stable without further antibiotic selection in all organisms tested so far. This method has been used with a variety of recipient γ-Proteobacteria, including Acinetobacter, Enterobacter, Escherichia, Klebsiella, Proteus, Pseudomonas, Salmonella, Shewanella, and Vibrio, as well as the α-Proteobacterium Zymomonas, and is likely to be adaptable to a wider range of bacteria.\nMaterials\nPlasmid DNA: Mobile-CRISPRi-encoding plasmids (Tn7 version; Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-tbl-0002])\nLB medium, with additions of diaminopimelic acid (DAP) and/or ampicillin, as appropriate\nLB agar plates, with appropriate additions, prewarmed to 37°C\nCulture medium and agar plates suitable for growth of the recipient bacterium (with addition of antibiotics, as appropriate, depending on Mobile-CRISPRi-encoded resistance)\n1× phosphate-buffered saline (PBS; e.g., Fisher BP399500, diluted 1:10)\nCellulose filters (e.g., MF-Millipore HAWG01300)\nTweezers, sterilized in ethanol\nTable 2.\n                Strains for Mobile-CRISPRi (Tn7 version)\ntable:\n﻿Strain,JMP no.,Genotype,Selection,Comment,Ref.\nE. coli BW25141,sJMP146,\"∆(araD-araB)567, ∆lacZ4787(::rrnB-3), ∆(phoB-phoR)580, λ-, galU95, ∆uidA3::pir+, recA1, endA9(Δins)::FRT, rph-1, ∆(rhaD-rhaB)568, hsdR514\",LB,E. coli pir+ “cloning strain”,Datsenko & Wanner (2000[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-bib-0009])",
    "E.coli WM6026,sJMP424,\"lacIq, rrnB3, DElacZ4787, hsdR514, DE(araBAD)567, DE(rhaBAD)568, rph-1 att-lambda::pAE12-del (oriR6K/cat::frt5), Δ4229(dapA)::frt(DAP–), Δ(endA)::frt, uidA(ΔMluI)::pir(wt), attHK::pJK1006::Δ1/2(ΔoriR6K-cat::frt5, ΔtrfA::frt)\",LB + DAP,E. coli pir+ “mating strain”,Blodgett et al. (2007[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-bib-0003])\nPrepare Mobile-CRISPRi donor strains for Tn7 transposition\n1. To make E. coli donor strains, transfer Mobile-CRISPRi-encoding plasmids (Tn7 version) to E. coli mating strain (WM6026) following Support Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-prot-0007] or 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-prot-0008]. Select on LB + 300 µM DAP + 100 µg/ml ampicillin.\nAll Mobile-CRISPRi plasmids have ampR encoded on their backbone, so ampicillin can be used for selection during culture of the plasmid-containing strain. When selecting for Tn7 transposition in your recipient (step 10 below), select instead for the transposon-encoded antibiotic resistance.\nTransformation by electroporation (Support Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-prot-0007]) is faster for a small number of plasmids, but transformation of CaCl2-competent cells (Support Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-prot-0008]) may be more suitable for high-throughput strain construction.\n2. Prepare stock strains in medium + 15% glycerol and store at −80°C.\nTn7 transposition of Mobile-CRISPRi\n3. Streak strains onto agar plates from −80°C stocks to obtain isolated colonies. For E. coli donor strains, use LB + 300 µM DAP + 100 µg/ml ampicillin agar plates and incubate ∼14-18 hr at 37°C. For recipient strain, use appropriate medium and culture conditions.\nObtain biosafety approval before transferring Mobile-CRISPRi to plant or animal pathogens, and perform all steps with appropriate biological containment for recipient strains.",
    "4. Inoculate liquid cultures from a single colony and grow to saturation. For E. coli donor strains, use 5 ml LB + 300 µM DAP + 100 µg/ml ampicillin medium in a culture tube and incubate ∼14-18 hr at 37°C with aeration (shaking at 250 rpm or on drum roller). For recipient strain, use appropriate medium, culture conditions, and culture volume to obtain between 1- and 10-fold the number of recipient cells compared to the E. coli donor cultures (i.e., equivalent or excess recipient cells).\nFor A. baumannii and possibly other bacteria, an additional donor expressing RP4 transfer machinery (i.e., pRK2013 or pEVS104) is also required to obtain transconjugants; the reason for this requirement is unclear.\n5. Add 700 µl LB (or recipient-appropriate medium) to a microcentrifuge tube. Add 100 µl of each of the three cultures for a total volume of 1 ml. Centrifuge 2 min at 7000 × g, room temperature.\nRatios of transposon donor, transposase donor, and recipient cells may need to be altered for optimal transposition efficiency. If necessary, the recipient cells can be pelleted and resuspended in less medium to increase the density of cells in 100 µl. In this example, recipient and donor strains are all grow in LB to around the same density.\nUse the optimal recipient growth medium to combine and wash cultures unless this would be harmful to E. coli, in which case a compromise medium that is not harmful to either should be used. In that case, cells can be pelleted by centrifugation first and resuspended in the appropriate medium before proceeding with this step.",
    "Centrifugation at low speeds results in a looser pellet that may make it less likely that pili required for conjugation are damaged during pipetting. Prewarming the medium to the growth temperature of the recipients may also increase efficiency.\n6. Remove supernatant by pipetting and resuspend pellet in 1 ml of LB (or recipient-appropriate medium). Centrifuge 2 min at 7000 × g.\n7. Repeat the above wash step.\n8. Remove supernatant and resuspend pellet in 30 µl LB (or recipient-appropriate medium). Pipet the cells onto a cellulose filter placed on a prewarmed LB + 300 µM DAP plate (or recipient-appropriate/compromise medium). Incubate for ∼2-24 hr at 37°C (or recipient appropriate temperature).\nUse of the filter is optional but it makes recovery of the cells in the step 9 easier. If no filters are available, spot culture directly on the plate.\nUse a plate with the optimal recipient growth medium to incubate the filters unless this would be harmful to E. coli, in which case a compromise medium that is not harmful to either should be used.\nIncubate at a temperature that is appropriate for both E. coli and the recipient organism.\nIncubation time for the conjugation will need to be optimized for each recipient. Testing and comparing the efficiencies of several incubation times is recommended.\nUse of DAP in the plate is optional here. If DAP is included, the donor E. coli strains will be able to grow. If the recipient strain has a much slower growth rate, it may be advantageous to omit or reduce the DAP to prevent overgrowth of the donors.\n9. Using ethanol-sterilized tweezers, transfer the filter to a microcentrifuge tube containing 200 µl 1× PBS. Vortex ∼15 s to dislodge cells from the filter and resuspend in the buffer.",
    "If a filter was not used in step 8, recover cells by scraping off the plate with a sterile P1000 pipet tip or sterile wooden stick.\n10. Plate cells on agar medium that selects for the Mobile-CRISPRi transposon-encoded antibiotic resistance gene and recipient (e.g., LB + kanamycin) without DAP. Initially, plate several volumes to determine optimal amount of your recipient organism to plate to obtain isolated colonies.\nSpreading cells evenly across the plate is important here. Areas of high density may have enough DAP from dead cells to support background growth of DAP-dependent donor cells.\nFor recipients with high efficiency of transposition, dilution in 1× PBS or medium will be necessary to obtain isolated colonies and reduce background of residual DAP-dependent cells. If colony density is high, restreak colonies for isolation on a new' plate.\n11. Stock strains in medium + 15% glycerol and store at −80°C.\n12. Once recipient strains have been generated, CRISPRi knockdown can be tested by targeting fluorescent proteins (Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-prot-0005]) or by observing reduced plating efficiency upon targeting of essential genes (Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-prot-0006]).",
    "This protocol describes how to integrate the Mobile-CRISPRi system into the chromosome of a bacterium of interest using the B. subtilis integrative and conjugative element (ICEBs1, or conjugative transposon; Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-tbl-0003]). This protocol has been used with members of the Bacillales Firmicutes (e.g., Bacillus subtilis, Staphylococcus aureus, Listeria monocytogenes, and Enterococcus faecalis).\nTable 3.\n                Strains for Mobile-CRISPRi (ICEBs1 version)\ntable:\n﻿Strain,sJMP no.,Antibiotic res.a[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-tbl3-note-0001_68],Selectionb[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-tbl3-note-0002_69],Description/reference\nB. subtilis with ICE,sJMP251,\"cmR, spcR strS\",LB with 6 µg/ml chloramphenicol,B. subtilis ICE-containing (cmR) donor strain\nB. subtilis with Mobile-CRISPRi containing ICE,NAc[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-tbl3-note-0003_70],\"kanR, strS\",LB with 7.5 µg/ml kanamycin,B. subtilis mating strain with Mobile CRISPRi (kanR) in ICE element\nB. subtilis with Mobile-CRISPRi-containing ICE,sJMP274,\"kanR, strS\",LB with 7.5 µg/ml kanamycin,\"B. subtilis mating strain with “test” Mobile CRISPRi (kanR), mRFP, +sgRNA in ICE element\"\nB. subtilis with Mobile-CRISPRi-containing ICE,sJMP275,\"kanR, strS\",LB with 7.5 µg/ml kanamycin,\"B. subtilis mating strain with “test” Mobile CRISPRi (kanR), mRFP, -sgRNA in ICE element\"\nBacillus subtilis CAL89,sJMP210,\"kanS, strR\",LB with 100 µg/ml streptomycin,Recipient strain (select for ICE(kan) on LB + 7.5 µg/ml kanamycin + 100 µg/ml streptomycin)\nEnterococcus faecalis,sJMP382,\"kanS, strR\",BHI with 100 µg/ml streptomycin,Recipient strain (select for ICE(kan) on BHI agar + 100 µg/ml kanamycin + 100 µg/ml streptomycin)\nListeria monocytogenes,sJMP17,\"kanS, strR\",BHI with 100 µg/ml streptomycin,Recipient strain (select for ICE(kan) on BHI agar + 50 µg/ml kanamycin + 100 µg/ml streptomycin)\nStaphylococcus aureus,sJMP18,\"kanS, strR\",TSB with 100 µg/ml streptomycin,Recipient strain (select for ICE(kan) on TSB agar + 50 µg/ml kanamycin + 100 µg/ml streptomycin)\na Resistance (s) of recipient E. coli. cmR, chloramphenicol resistance; kanR, kanamycin resistance; spcR, spectinomycin resistance; strR, streptomycin resistance.\nb See Reagents and Solutions for LB, BHI, and TSB medium and stock solution recipes.",
    "c To be created with a Mobile-CRISPRi plasmid (ICE version) expressing an sgRNA targeting your gene of interest using Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-prot-0003]. The B. subtilis strains are being made available through the Bacillus Genetic Stock Center (http://www.bgsc.org/[href=http://www.bgsc.org/]); other strains are available from the ATCC.\nMaterials\nMC medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-rec-0012]) with 6 µg/ml chloramphenicol\nB. subtilis containing a chloramphenicol-marked ICEBs1 element and IPTG-inducible rapI (sJMP251; Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-tbl-0003])\nBMK (competence) medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-rec-0001]) + 6 µg/ml chloramphenicol\nPlasmid DNA (Mobile-CRISPRi-encoding plasmids; ICE version)\nLB, BHI, and/or TSB medium (see recipes[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-rec-0007])\nAgar plates with strain-specific medium (LB, BHI, or TSB) and antibiotic (chloramphenicol, kanamycin, and/or streptomycin; see Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-tbl-0003] for appropriate concentration)\n50% (v/v) glycerol\n1 M IPTG\nSpizizen's medium and agar plates (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-rec-0016])\n125-ml flask\n1-ml deep 96-well plates, sterile (e.g., USA Scientific 1896-1000)\nAeraSeal sterile breathable film (Sigma A9224)\nMicroplate orbital shaker (e.g., GeneMate MP4)\nAnalytical filter funnels (100 ml) with cellulose nitrate (CN) filters (47 mm, 0.2 µm, sterile; e.g., Nalgene 145-0020) and vacuum source.\nCreate ICE donor strains by integrating Mobile-CRISPRi (ICEBs1 version) into the Bacillus subtilis chromosomal ICEBs1 by natural competence\n1. Inoculate 3 ml MC medium + 6 µg/ml chloramphenicol in a sterile culture tube with a single colony of B. subtilis containing a chloramphenicol-marked ICEBs1 element and IPTG-inducible rapI (sJMP251), and incubate ∼12-16 hr at 37°C with aeration (shaking at 250 rpm or on a roller drum).\nChloramphenicol selection retains the ICEBs1 element that could otherwise be lost.\n2. Dilute the overnight culture to OD600 = 0.1 in 30 ml BMK (competence) medium + 6 µg/ml chloramphenicol in a 125-ml flask and incubate at 37°C with shaking (250 rpm) until OD600 ∼1.5.\nIt is very important not to overgrow cultures at this step, asovergrown cells are substantially less competent.",
    "3. Mix 120 μl culture with ≥100 ng (∼1-5 μl) plasmid DNA in a deep 96-well plate, cover with breathable film, and incubate 10 min at 37°C without shaking, then 2 hr with shaking (900 rpm) on a microplate shaker.\n4. Plate cells on LB agar + 7.5 µg/ml kanamycin and incubate 16-24 hr at 37°C. Plate several amount to obtain isolated colonies and/or restreak for isolation on a new selection plate.\nDo not select for chloramphenicol resistance at this step; the kanamycin marked Mobile-CRISPRi cassette has replaced the existing ICEBs1 marker.\n5. Prepare stock strains in LB + 7.5 µg/ml kanamycin +15% glycerol at −80°C.\nDo not store B. subtilis plates at 4°C, as B. subtilis loses viability at this temperature.\nICEBs1 transfer of Mobile-CRISPRi from B. subtilis donor to recipient strains\n6. Inoculate 3 ml LB + 3.75 µg/ml kanamycin with a single colony of B. subtilis ICEBs1-CRISPRi donor strain and 3 ml LB (or strain-specific rich medium) with a single colony of the recipient strain, and incubate until exponential phase (∼2 hr) at 37°C with aeration (shaking at 250 rpm or rotating on a drum roller).\nAdjust the medium and growth temperature of the recipient strain as necessary in this and subsequent steps.\nAdjust start time of recipient cultures if growth rate is significantly different from that of the donor strain. See Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-tbl-0003] for strain-specific media and antibiotic concentrations.\nUse half the regular kanamycin concentration (3.75 µg/ml) for B. subtilis donor strains grown in liquid medium.\n7. Dilute the starter cultures to OD600 = 0.02 in 5 ml LB + 3.75 µg/ml kanamycin for donors or 15 ml LB (or recipient-specific rich medium) for recipients, and incubate until OD600 ∼0.2 (∼1 hr) at 37°C with aeration.",
    "Adjust volume of recipient culture depending on number of donor cultures (start ∼15 ml culture for each 4 donors).\n8. Add 5 µl 1 M IPTG to 5 ml donor cultures (1 mM IPTG) to induce rapI expression and continue to incubate all cultures 1 hr at 37°C with aeration.\nExpression of the ICEBs1 anti-repressor RapI induces conjugation genes found on the ICE element and promotes excision of ICEBs1 from the chromosome.\n9. Adjust OD600 of cultures to 0.9. For each mating, add 2.5 ml each of donor and recipient cultures to 5 ml Spizizen's medium in a 50-ml conical tube and vortex to mix.\nAlso set up control matings with no recipient (donor only) or no donor (recipient only).\n10. Vacuum cell suspension through an analytical filter funnel to collect the cells on a CN filter, add 5 ml Spizizen's medium, and vacuum again to wash the filter.\n11. Using flame-sterilized forceps, transfer the filter to a Spizizen's medium agar plate and incubate at 37°C for 3 hr.\nAdjust mating time if necessary, depending on recipient.\n12. Transfer each filter to a 50-ml conical tube containing 5 ml Spizizen's medium, and vortex to resuspend cells.\n13. Plate on LB + kanamycin (7.5 µg/ml or strain-specific medium and kanamycin concentration) + streptomycin (100 µg/ml) agar plates to select for transconjugants. Adjust volume plated to obtain isolated colonies and/or restreak for isolation on a new selection plate.\nTo determine efficiency, also plate dilutions (∼100 µl of 10-4 and 10-5) on LB + kanamycin (to quantify donor cells) and on LB + streptomycin (to quantify recipient cells).\n14. Stock strains in LB + 15% glycerol at −80°C.",
    "15. Once recipient strains have been generated, CRISPRi knockdown can be tested by targeting fluorescent proteins (Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-prot-0005]) or by observing reduced plating efficiency upon targeting essential genes (Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-prot-0006]).",
    "This protocol describes how to quantitatively test the function of the CRISPRi system. A fluorescent protein (e.g., mRFP or sfGFP) expression cassette is incorporated into a Mobile-CRISPRi construct expressing either an sgRNA targeting the fluorescent protein gene or a nontargeting control. Strains with these Mobile-CRISPRi constructs are grown with inducer, fluorescence is measured on a fluorometer, and fold repression can be calculated. This protocol is useful when initially testing and optimizing Mobile-CRISPRi in a new bacterium. (Reference publications for example data for this procedure: Banta et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-bib-0001]; Peters et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-bib-0025].)\nMaterials\nLB medium and plates (or medium appropriate for your bacterium)\nIPTG (CRISPRi-Tn7 version) or anhydrotetracycline (aTc; CRISPRi-ICEBs1 version)\n1× PBS (e.g., Fisher BP399500, diluted 1:10)\n1-ml deep 96-well plates (e.g., USA Scientific 1896-1000) or culture tubes, sterile\nMultichannel pipets (e.g., Rainin Pipet-lite multi 17013810 and 17013807)\nAeraSeal sterile breathable film (Sigma A9224)\nMicroplate orbital shaker (e.g., GeneMate MP4)\nCentrifuge capable of spinning 96-well plates or culture tubes (e.g., Eppendorf 5920R)\n96-well clear-bottom black microplates (e.g., Corning C3631)\nMicroplate fluorometer (e.g., Tecan Infinite 200 PRO Mplex)\nConstruct strains with a fluorescent reporter to test CRISPRi knockdown\n1. Transfer CRISPRi system with fluorescent reporter (see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-tbl-0001]) to recipient strain according to Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-prot-0004] (Tn7 transfer to Gram-negative bacteria) or 4 (ICEBs1 transfer to Bacillales).\nYou will need at least three strains: one encoding the fluorescent protein and an sgRNA targeting the fluorescent protein encoding gene, another encoding the fluorescent protein and a nontargeting sgRNA, and a third, nonfluorescent strain.\nGrow strains to test function of CRISPRi system",
    "2. Add 300 µl LB (or appropriate medium) to wells of a deep 96-well plate. Inoculate wells with a single colony. Test three or four isolates per strain. Cover plate with sterile breathable film and incubate ∼16 hr at 37°C (or appropriate temperature for the cells) shaking at 900 rpm on a microplate shaker.\nAs an alternative, cultures can instead be grown in sterile culture tubes. Adjust medium and growth conditions for your organism if necessary.\n3. Serially dilute cultures 1:10,000 into 300 µl medium using a multichannel pipet as follows: dilute cultures 1:100 into LB (or appropriate medium), then dilute 1:100 again into LB (or appropriate medium) containing 0 or 1 mM IPTG (for CRISPRi-Tn7 version) or 0 or 0.1 µg/ml aTc (for CRISPRi-ICEBs1 version). Cover plate with sterile breathable film and incubate for ∼10 doublings at 37°C (or appropriate temperature) shaking at 900 rpm on a microplate shaker.\nAdditional cultures can be started in extra wells in the plate to monitor cell growth over time by measuring OD600. Under these conditions, growth time for E. coli with a ∼40-min doubling time would be ∼7 hr. Vary medium and incubation temperature and time according to your organism. Cell growth can instead be performed in culture tubes. The concentration of IPTG or aTc can also be varied to determine the induction of the CRISPRi system over a range of inducer concentrations. Substantial culture dilutions are required to accurately quantify the CRISPRi effect due to accumulation of mRFP or sfGFP in overnight cultures.\nMeasure fluorescence to determine efficacy of CRISPRi system\n4. Spin down cultures in plates for 10 min at 4000 × g, room temperature. Decant medium, and resuspend pellet in an equal volume of 1× PBS (∼300 µl) by pipetting up and down ∼10 times.",
    "Cells can be centrifuged at between 3000 and 4500 × g. Adjust time to ensure pellet formation.\n5. Transfer 200 µl cells into a 96-well clear black-bottom microplate. In a fluorescence microplate reader, measure cell density (OD600) and fluorescence (excitation 485 nm, emission 510 nm for sfGFP; excitation 584 nm, emission 607 nm for mRFP).\n6. Analyze knockdown efficacy by first calculating fluorescence/OD600 and then calculating a ratio of value of strains with and without the targeting sgRNA.\nBe sure to subtract uninoculated medium background measurement from OD600 measurement and nonfluorescent strain background measurement from fluorescent strain measurements.",
    "This protocol describes how to test for gene essentiality using CRISPRi. Serial dilutions of strains with Mobile-CRISPRi-encoding sgRNAs targeting genes of interest are spotted on agar plates with various concentrations of inducer. This protocol is useful when initially determining essentiality and for optimizing level of induction of Mobile-CRISPRi needed for partial knockdown for subsequent experiments.\nMaterials\nLB medium and agar plates (or medium appropriate for your bacterium), with additions of DAP, IPTG, and/or other additives as appropriate\nIPTG (CRISPRi-Tn7 version) or anhydrotetracycline (aTc; CRISPRi-ICE version)\n1-ml deep 96-well plates (e.g., USA Scientific 1896-1000) or culture tubes, sterile\nAeraSeal sterile breathable film (Sigma A9224)\nSterile 96-well V-bottom microplates (e.g., Corning 3896)\nMicroplate orbital shaker (e.g., GeneMate MP4)\nMultichannel pipets (e.g., Rainin Pipet-lite multi 17013810 and 17013807)\n150 × 15-mm Petri plates (e.g., Falcon 1351058)\n1. Construct strains with targeting and nontargeting (control) sgRNAs according to Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-prot-0003] followed by either Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-prot-0004] or 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.130#cpmc130-prot-0005].\n2. Add 300 µl LB (or appropriate medium) to wells in a row of a deep 96-well plate. Inoculate wells with a single colony. Cover plate with sterile breathable film and incubate ∼16 hr at 37°C (or appropriate temperature), shaking at 900 rpm on a microplate shaker.\nAs an alternative, cultures can instead be grown in sterile culture tubes. Throughout this protocol, adjust medium, inducer concentration, temperature, and incubation time for your organism if necessary.\nUse of biological replicates (two cultures of the same strain), redundant sgRNAs (multiple strains with different sgRNAs targeting the same gene), and/or technical replicates (spotting the same dish of cultures onto multiple plates twice) is recommended.",
    "3. Using a multichannel pipet, add 90 µl LB medium to all wells of a sterile V-bottom 96-well microplate. Add 10 µl of each culture to the wells in row A, mix by pipetting 10 times, and serially dilute (10 µl culture + 90 µl LB medium) into rows B-H, mixing each time.\n4. Prepare 150 × 15-mm petri plates with LB agar + 0, 10, 100, and 1000 µM IPTG (CRISPRi-Tn7 version) or LB + 0, 0.0001, 0.001, and 0.1 µg/ml aTc (CRISPRi-ICE version). Prewarm plates and ensure that the plate surface is not wet.\n5. Using a multichannel pipet, spot 3 µl of each dilution onto the plate. When spot has soaked in, invert plates and incubate ∼16 hr at 37°C.\nTo spot the cultures, hold the pipet a few millimeter above the surface of the plate. Depress the plunger to the first stop to expel the drop; it should transfer to the plate (do not push past the first stop or “blow out”; this could contaminate adjacent areas of the plate). Dry the surface of the plate either in a laminar-flow cabinet or by leaving it slightly cracked in an incubator. Using larger petri plates will allow spotting of an entire 96-well plate.\n6. Image and analyze culture growth on plates. Reduced growth compared to the control (nontargeting sgRNA) will indicate reduced fitness of strains in which CRISPRi targets essential genes. Using plates with a range of IPTG concentrations may aid in selecting an inducer concentration appropriate for partial or complete knockdown.",
    "This protocol details the preparation of electrocompetent E. coli cells for transformation as well as the electroporation procedure. While either electrocompetent or chemically competent cells can be used for the protocols detailed here, electroporation is generally of higher efficiency and faster for small-scale experiments, but requires specialized equipment and is salt sensitive. In this protocol, electroporation is appropriate for transforming ligations into a cloning strain.\nMaterials\nE. coli strains to be transformed\nLB medium and agar plates (with selective antibiotics as necessary)\n5% and 15% glycerol, autoclaved\nSOC medium\n2-L baffled flask, sterile\nSpectrophotometer capable of measuring OD600 (e.g., Thermo Genesys 30)\nCentrifuge able to spin 250-ml bottles and 1-ml conical tubes at 4°C (e.g., Eppendorf 5920R)\nDisposable cuvettes (e.g., Fisher 14-955-127)\n250-ml polypropylene centrifuge bottles (e.g., Nalgene 3120-0250)\n15-ml conical centrifuge tubes, sterile\n1.5-ml microcentrifuge tubes, sterile\nElectroporation cuvettes, 0.1-cm gap (e.g., Fisher FB101)\nElectroporator (e.g., Bio-Rad Gene Pulser Xcell or Bio-Rad Micropulser)\nPreparation of electrocompetent E. coli cells\n1. Streak strains onto LB agar plates from −80°C stocks to obtain isolated colonies. Incubate ∼14-18 hr at 37°C.\nInclude 300 µM DAP in plates and liquid medium if growing a DAP-dependent strain.\n2. Place 5 ml LB medium in a culture tube, inoculate with a single colony, and incubate ∼14-18 hr at 37°C with aeration (shaking at 250 rpm or on a drum roller).\n3. Place 500 ml LB medium in a 2-L baffled flask, inoculate with the 5 ml culture (starting OD600 ∼0.03), and incubate until mid-exponential phase (OD600 ∼0.3-0.4, ∼2 hr) at 37°C shaking at 250 rpm.\nDo not overgrow culture. While culture is growing, prechill centrifuge and rotor, and label and prechill centrifuge bottles, tubes, and solutions. Perform remaining steps quickly and keeping cells chilled/on ice.",
    "4. Swirl flask in a pan with an ice/water slurry for ∼5 min to quickly cool the culture.\n5. Pellet the cells in 250-ml polypropylene bottles by centrifuging 10 min at 4000 × g, 4°C.\nIn this and subsequent steps, cells can be centrifuged between 3000 and 6500 × g depending on centrifuge. Adjust time to minimize centrifugation time but ensure pellet formation.\n6. Pour off supernatant and, while holding bottle in ice, resuspend cells in 2 ml 5% glycerol and then add 250 ml 5% glycerol, mix gently by inversion, and pellet the cells by centrifuging 10 min at 4000 × g, 4°C.\n7. Pour off supernatant, resuspend cells in 2 ml 5% glycerol and then add 125 ml 5% glycerol, mix gently by inversion, and pellet the cells by centrifuging 10 min at 4000 × g, 4°C.\n8. Pour off supernatant, resuspend cells in 5 ml 15% glycerol, transfer all 10 ml to a single 15-ml centrifuge tube, and pellet the cells by centrifuging 10 min at 4000 × g, 4°C.\n9. Pipet off supernatant, resuspend cells in 2.5 ml 15% glycerol, and, on ice, transfer 210-µl aliquots of cells to each tube (∼13-14 tubes, about four 50-µl transformations/tube) and freeze at −80°C.\nFinal resuspension volume can be adjusted from ∼1-5 ml/500 ml starting culture based on the number of cells needed per 50-µl volume per electroporation.\nDistribute into single-use aliquots. Do not refreeze unused cells once thawed, but rather adjust aliquot size based on projected needs.\nTransformation of E. coli by electroporation\n10. Thaw electrocompetent E. coli cells ∼5 min on ice.\n11. Prewarm two or three selective plates (i.e., LB agar + appropriate antibiotics and additives) for each transformation to 37°C.\n12. Transfers 50-µl aliquots of cells to 1.5-ml microcentrifuge tubes on ice.",
    "13. Add up to 1 µl ligation or purified plasmid DNA to cells and transfer to a 0.1-cm-gap electroporation cuvette on ice.\nAvoid introducing air bubbles into the suspension, which can result in an electrical discharge that reduces cell viability. It can be effective to set your pipet for several microliters less than the actual volume when transferring. If a bubble may have been introduced, tap cuvette on the counter several times. Ligation reactions contain salt, which may cause arcing if >1 µl of unpurified ligation is electroporated.\n14. Set electroporator to exponential decay pulse, 25 µF, 200 Ω, 1.8 kV (i.e., “Bacterial 1” preset on Bio-Rad Gene Pulser Xcell or “EC1” on Bio-Rad Micropulser).\nFollow the manufacturer's instructions for electroporation of E. coli for your electroporator.\n15. Wipe cuvette dry with a Kimwipe, place in the holder, and then push the pulse button.\n16. After completion of pulse, remove cuvette from the holder, add 800 µl SOC medium to the cuvette, mix by pipetting, and transfer cells and medium to a culture tube.\nLB medium can also be used for outgrowth but may reduce transformation efficiency. Prewarming medium to 37°C and/or adding medium to cells as quickly as possible after the pulse may increase efficiency of transformation.\n17. Incubate cultures 1 hr at 37°C shaking at 250 rpm or on a roller drum.\n18. Plate transformation on two or three prewarmed selective plates to obtain isolated colonies. Incubate plates ∼16 hr at 37°C before proceeding with the rest of your experiment.",
    "The amount to plate will depend on the competency of the cells. If the transformation efficiency is not known, plate several amounts (e.g., 200, 20, and 2 µl). If isolated colonies are not obtained, restreak for isolation on new plates. Alternatively, plate 80 µl of the transformation and then pellet the remaining cells (∼2 min at ∼6000 × g), spot on a plate, and then streak from that spot to obtain isolated colonies.",
    "This protocol details the preparation of CaCl2-competent E. coli cells for transformation as well as the heat-shock procedure for transforming these cells. This method requires less specialized equipment than transformation by electroporation and is of lower efficiency but can easily be adapted to be higher throughput when many strains need to be constructed at once, such as when transferring intact plasmids to a mating strain.\nMaterials\nE. coli strains to be transformed\nLB medium and agar plates (with selective antibiotics as necessary)\n50 mM CaCl2 with 10 mM Tris, pH 7.5\n50 mM CaCl2 with 10 mM Tris, pH 7.5, and 15% glycerol\nSOC medium\nSpectrophotometer capable of measuring OD600 (e.g., Thermo Genesys 30)\nDisposable cuvettes (e.g., Fisher 14-955-127)\n500-ml baffled flask, sterile\n50-ml conical centrifuge tubes, sterile\nCentrifuge able to spin 50-ml conical tubes at 4°C (e.g., Eppendorf 5920R)\n15-ml conical centrifuge tubes, sterile\nSterile 96-well V-bottom microplates (e.g., Corning 3896)\n1.5-ml microcentrifuge tubes, sterile\n0.2-ml PCR strip tubes or 96-well PCR plates, sterile (for higher throughput transformation)\nAeraSeal sterile breathable film (Sigma A9224)\nHeat block or thermal cycler (for transformation in strip tubes or 96-well plates) or water bath (for transformation in microcentrifuge tubes)\nFoil seals (e.g., Microseal “F” Foil Bio-Rad MSF1001)\nMultichannel pipets (e.g., Rainin Pipet-lite multi 17013810 and 17013807)\nMicroplate orbital shaker (e.g., GeneMate MP4)\nPreparation of chemically competent E. coli cells\n1. Streak strains onto LB agar plates from −80°C stocks to obtain isolated colonies. Incubate ∼14-18 hr at 37°C.\n2. Place 5 ml LB medium in a sterile culture tube, inoculate with a single colony, and incubate ∼14-18 hr at 37°C with aeration (shaking at 250 rpm or on a drum roller).",
    "3. Place 100 ml LB in a sterile 500-ml baffled flask, inoculate with 1 ml culture (starting OD600 ∼0.03), and incubate until mid-exponential phase (OD600 ∼0.3-0.4, ∼2 hr) at 37°C shaking at 250 rpm.\nAdjust size of culture as needed. 100 ml culture will prepare enough competent cells for two 96-well plates with 35 µl cells/well.\nDo not overgrow culture. While culture is growing, prechill centrifuge and rotor, and label and prechill centrifuge bottles, tubes, and solutions.\n4. Swirl flask in a pan with an ice/water slurry ∼5 min to quickly cool the culture.\n5. Pellet the cells in sterile 50-ml conical centrifuge tubes by centrifuging 10 min at 4000 × g, 4°C.\nIn this and subsequent steps, cells can be centrifuged between 3000 and 6500 × g depending on the centrifuge. Adjust time to minimize centrifugation time but ensure pellet formation.\n6. Pour off supernatant and, while holding tubes in ice, resuspend cells in 25 ml 50 mM CaCl2/10 mM Tris, pH 7.5. Mix gently by inversion and place on ice for 15 min.\n7. Pellet the cells by centrifuging 10 min at 4000 × g, 4°C.\n8. Pour off supernatant and, while holding tubes in ice, resuspend cells from each tube in 3.3 ml 50 mM CaCl2/10 mM Tris, pH 7.5/15% glycerol, combine resuspended cells into one tube, and place on ice for 30 min.\n9. For high-throughput transformations, transfer 35 µl per well to wells of two sterile 96-well PCR plates on ice, cover with a foil seal, and freeze at −80°C. Alternatively, transfer 650 µl cells per tube to 1.5-ml tubes (∼10-11, tubes each enough for ∼16 transformations [35 µl]) and freeze at −80°C.\nDistribute into single-use aliquots. Do not refreeze unused cells once thawed, but rather adjust aliquot size based on projected needs.",
    "Transformation of chemically competent E. coli\n10. Thaw CaCl2 competent E. coli cells on ice ∼5 min and transfer 35-µl aliquots to sterile 0.2-ml PCR strip tubes or a 96-well PCR plate.\nThis protocol details performing the transformation in microtiter format to ease handing of a large number of samples, but it can also be performed in individual microcentrifuge and culture tubes.\n11. Add 1-2 µl plasmid DNA (>10 ng) to cells and gently pipet to mix. Close strip caps or cover 96-well plate with adhesive foil.\n12. Hold on ice for 30 min, incubate for exactly 2 min in a 42°C heat block, and then hold on ice for 5 min.\nAlternatively, a thermal cycler can be programmed to cycle through these temperatures, substituting the hold on ice with incubation at 4°C.\n13. Add 100 µl SOC medium to a sterile 96-well microplate. Using a multichannel pipet, transfer cells into plate with SOC and gently pipet to mix. Cover with breathable membrane and incubate 1 hr at 37°C, shaking at 900 rpm on a microplate shaker.\n14. Spot transformation onto a prewarmed selective plate and streak out to obtain isolated colonies. Incubate plates ∼16 hr at 37°C before proceeding with the rest of your experiment.\nAlternatively, for high-throughput transformations, 30 µl of the transformation can be transferred to a 96-well microplate containing 100 µl SOC medium plus selective antibiotic(s), incubated ∼12-16 hr at 37°C with shaking at 900 rpm on a microplate shaker, and then pinned onto selective agar plates using a 96-well pin tool or pinning robot."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}