{
  "id": 10973,
  "origin_website": "Jove",
  "title": "In vivo and In vitro Rearing of Entomopathogenic Nematodes (Steinernematidae and Heterorhabditidae)",
  "procedures": [
    "1. In vivo Rearing of Entomopathogenic Nematodes with their Symboitic Bacteria\nInvert a 100 x 15 mm plastic Petri dish and place two discs of filter paper (90 mm) in the lid of the dish.\nEvenly distribute 1 ml of the IJ (infective juveniles) water suspension (at a concentration of 1,000-2,000 IJ/ml) on the filter paper.\n\tNOTE: IJs do not need to be surface-sterilized.\nAdd 10 last instar larvae of the greater waxmoth Galleria mellonella to the dish. The goal is to provide approximately 100-200 IJs/larva.\nCover the lid with the bottom of the Petri dish (Figure 1) and label the Petri dish. Mention the following information: nematode species name (if known); isolate code/designation; date infection trap was set.\nPlace the dish inside a loosely sealed plastic bag (to conserve moisture) and keep it in the dark at either room temperature or in an incubator between 20-25 °C. Check dishes daily\n\tNOTE: Darkness facilitates nematode infection, as it mimics natural infection conditions in the soil.\nAfter 3-5 days, remove cadavers with signs of nematode infection to a modified White trap7.\n\tNOTE: If the cadavers smell putrid, this may be an indication that the culturing was not successful and/or there was contamination. Set a new infection chamber with a new batch of nematodes and insects.\n2. In vitro Rearing of Entomopathogenic Nematodes with their Symbiotic Bacteria\nLiver-kidney Agar Method9,19\nChop liver and kidney into small pieces (2 cm3 or smaller) and place into a blender with NaCl, agar and 300 ml of water and blend until the meat becomes a liquid pulp, thick paste or puree. Then, transfer mixture to a 1 L Erlenmeyer flask.",
    "Add the final 200 ml of water to the blender vessel and decant any remaining media into the Erlenmeyer flask. Autoclave for 15 min at 121 °C. After autoclaving allow agar to cool to touch before pouring.\n\t\tNOTE: Pipetting of medium is not recommended because this medium tends to have chunks of meat.\nPour ~20 ml of agar onto 5 (or 6) cm Petri dishes while hand stirring or swirling the Erlenmeyer flask between pours for a more homogenous media. Allow agar to solidify and store dishes at 4 °C until needed\n\t\tNOTE: Use a flame-sterilized metal spatula to break up any large chunks of meat poured into the Petri dish.\nLipid Agar Method9,19\nPrepare lipid agar medium by mixing together nutrient broth, agar and yeast extract and pour mix into a 2 L Erlenmeyer flask. Add distilled H2O and MgCl2•6H2O and autoclave for 15 min at 121 °C.\nAdd sterile mix of corn oil and corn syrup mix and stir or swirl vigorously and often to disperse oil droplets evenly.\n\t\tNOTE: Sterilize corn oil and syrup by placing the needed volume in a UV cross-linker. The oil will not dissolve into the liquid, but make sure it is in tiny droplets.\nPour ~20 ml agar onto a 5 (or 6) cm Petri dishes and allow agar to solidify and store dishes at 4 °C until needed.\nStreak the desired symbiotic bacteria onto the lipid agar plate and incubate plates at 28 °C for 24-48 hr.\n\t\tNOTE: Spread 100-200 µl of overnight (12-16 hr) LB subculture.\nThe day after, add approximately 0.4 ml of surface sterilized nematode suspension (eggs or infective juveniles) and incubate plates at room temperature in the dark or in an incubator at 22 ±3 °C.",
    "NOTE: Do not add more than 0.4 ml of nematode suspension as it can create an excessively wet environment that is unfavorable to nematode growth.\nMonitor cultures daily. Cultures should produce a new generation of IJs in about 12 days (Figure 2).\nTransfer bottom dish with agar when nematodes are seen crawling the sides of the dish (Figure 3A) to a modified White trap (see Orozco et al.12) to harvest IJs (Figure 3B). Perform this step under a laminar flow hood to reduce contamination of the media.\nCollect IJs from the modified White trap upon emergence and rinse IJ suspension to remove any medium debris. Store IJ in sterilized distilled water at 10 °C (in a cold-temperature incubator or cold room) or use immediately if needed.\n\t\tNOTE: Depending on the goal of the study, seed the plates with either symbiont-colonized or aposymbiotic nematodes.\n3. In vitro Rearing of Aposymbiotic (Symbiont-free) Entomopathogenic Nematodes\nInfect 10-20 G. mellonella larvae with IJs of the desired nematode species (see section 1). After 3 or 4 days (at this time IJs should have matured to first generation adults) collect cadavers.\n\tNOTE: Time to maturity and number of females needed to obtain an adequate number of eggs will vary by species. Infect more G. mellonella larvae if necessary and start dissections as early as the 48 hr post-infection to assess whether they are in the right developmental stage.\nPlace each cadaver individually in a Petri dish with saline solution (M9 buffer18). Dissect a cadaver by pulling its head with a fine tip forceps.\nCollect at least 20 gravid (with eggs inside) females with a fine needle (L-shape preferably) and place them in a watch glass containing 10 ml of M9 buffer (Figure 4A).",
    "Prepare an axenizing solution by considering the following ingredients: 6.75 ml distilled water, 1.25 ml 5 N NaOH, and 2.25 ml commercially available bleach solution diluted to 3% hypochlorite.\n\tNOTE: NaOH is a basic solution—gloves, goggles and other appropriate protective clothing should be worn.\n\tNOTE: Prepare fresh axenizing solution each time, as bleach degrades in light. Prepare several batches of axenizing solution and perform the surface sterilization and harvesting of eggs in multiple watch glasses.\nRinse females at least three times with M9 buffer filling watch glass with buffer solution and sucking up buffer with a pipette. Make sure the females remain in the watch glass. Repeat this step two more times.\nImmediately add the axenizing solution and allow the females to remain in this solution for no more than 10–15 min. Observe the nematode tissues beginning to disintegrate while the eggs (which are resistant to the axenizing solution) remain intact.\nManually disrupt female bodies to speed up the process, by cutting them with a needle or a scalpel (Figure 4B, C). Remove eggs by pipetting them into 1.5 ml microcentrifuge tubes, avoiding adding any undissolved tissue.\n\tNOTE: Use as many microcentrifuge tubes as necessary to gather eggs and work quickly, as the viability of the eggs will decrease over a prolonged period of exposure to axenizing solution.\nVortex tubes for 15 sec using the “high speed setting” to further remove nematode tissues attached to the eggs. Alternatively, if a vortex is unavailable, pipet up and down the solution several times.\nPellet eggs by centrifugation at approximately 18,000 g for 2 min. Increase speed if eggs do not sufficiently pellet. Remove axenizing solution and rinse twice by filling the microcentrifuge tube with sterile distilled water and centrifuge one more time at 900 x g for 1 min.",
    "After the last wash, resuspend eggs in 300–500 µl of sterile distilled water and place them in a sterile 3 cm Petri dish or sterilized watch glass. Remember that eggs are now surface-sterilized, so use sterile pipettes and/or pippetter tips and water to maintain cleanness of the eggs.\nExamine eggs under a dissecting microscope (30-50X magnification) to confirm they are intact (Figure 4D) and transfer them to a 5 cm plate with liver-kidney agar (see section 2.1)\n\tNOTE: Do not add more than 400 µl of the egg suspension on the plates as it will make the agar excessively wet.\nLabel plates with appropriate information and store them upright in the dark at 28 °C. Hatching of eggs should be evident overnight.\n\tNOTE: Water may condense on the lid of the dish but it will evaporate after 1 or 2 days. At this time, place the dish in plastic bag to retain moisture of the agar and avoid its drying.\nObserve dishes periodically and discard any dishes that show signs of fungal or bacterial contamination. Once IJs are seen migrating up the wall of the Petri dish, remove the lid and transfer the bottom dish with agar to a modified White trap12. Consider sterile conditions when transferring the dish into the modified White trap to avoid contamination of the exposed media.\nContinue monitoring the White Traps and harvest IJ as needed.\n\tNOTE: Aposymbiotic nematodes will continue to migrate into the water of the White trap for many days and even weeks.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}