{
  "id": 4288,
  "origin_website": "Bio",
  "title": "Optical Clearing Using SeeDB",
  "procedures": [
    "Part I. Choice of protocolsStandard SeeDB and SeeDB37: brain slice, mouse embryo, young mouse whole-brain, and adult mouse hemi-brainSeeDBp: embryonic and neonatal mouse brainSeeDB37ht: large samples, such as adult mouse whole-brainimgsrc:https://en-cdn.bio-protocol.org/attached/image/20140126/20140126232422_2518.jpgFigure 3. Timing of SeeDB protocolsSeeDB (standard)Fix the sample in 4% PFA at 4 °C with gentle shaking overnight.Wash the sample in PBS three times (10 min each).(Optional step for fragile samples) Embed the sample in 1% low melting point agarose gel in PBS with desired orientation and then trim away extra portion to minimize the sample size. The surface of the sample should be close to the surface of agarose gel, because the working distance of commercially available objective lens is limited. Agarose embedding should not be used for large tissues, because agarose embedding reduces the penetration of SeeDB into the samples.Incubate the sample in ~20 ml of 20% (w/v) fructose solution in 50 ml conical tube, and then place the conical tube on a tube rotator (~4 rpm) or a seesaw shaker (~17 rpm) for 4-8 h, respectively. A small piece of sample (e.g., slices) requires less time for optical clearing. Incubation should be performed at 25-37 °C.Incubate the sample in 40% (w/v) fructose for 4-8 h as above.Incubate the sample in 60% (w/v) fructose for 4-8 h. (Samples may no longer sink in 60% or higher concentrations of fructose.)Incubate the sample in 80% (w/v) fructose for 12 h. Incubate the sample in 100% (w/v) fructose for 12 h.Incubate the sample in ~20 ml SeeDB for 24 h. The incubation time can be extended up to 48 h.The transparency can be evaluated by eye at this stage (Figure 4). If the sample is successfully cleared, the adult brain sample should look amber under a light source.",
    "If the clarity is still not enough, incubate the sample further in ~20 ml SeeDB37 solution at 37 °C (in an air incubator) with gentle rotation for 24 h. We recommend this step for adult brain samples.SeeDBpIncubation schedule for SeeDBp is the same as the standard SeeDB protocol. To prevent sample expansion, 20% ,40%, 60%, and 80% fructose solutions are made in 0.1x PBS instead of distilled water.SeeDB37htNote: Fluorescent proteins may be partially quenched. Some sample expansion may occur. Fix the sample in 4% PFA at 4 °C with gentle shaking overnight.Wash the sample in PBS three times (10 min each).Incubate the sample in 20% (w/v) fructose at 50 °C for 2-4 h. To prevent sample expansion, the incubation time should not exceed 4 h.Incubate the sample in 40% (w/v) fructose at 50 °C for 2-4 h.Incubate the sample in 60% (w/v) fructose at 50 °C for 2-4 h.Incubate the sample in 80% (w/v) fructose at 50 °C for 2-4 h.Incubate the sample in 100% (w/v) fructose at 50 °C for 12 h.Incubate the sample in SeeDB at 50 °C for 24 h.Incubate the sample in SeeDB37 at 50 °C for 24 h. Transfer the sample to 37 °C for imaging. Extension of incubation at 50 °C is not recommended.Part II. Choice of objective lenses and imaging Because refractive index of SeeDB is 1.49, it is important to choose appropriate objective lenses to minimize spherical aberration. In the two-photon microscopy, index-matched and long working distance customized objective lens is most ideal to obtain high-resolution images at millimeter-scale. We used custom-made objective lens from Olympus (it will be commercialized from Olympus). Commercial water or Scale immersion objective lens can be used for imaging up to 2-4 mm depth. In the confocal microscopy, a water-immersion objective lens (refractive index 1.",
    "33) works better than an air-immersion objective lens (refractive index 1.0) (Figure 5). Glycerol/Oil immersion lenses are also suitable. Customized objective lens is not necessary for confocal imaging; we did not see obvious differences in resolution within 1 mm depth. When using an air or water-immersion lens, the imaging depth should be calibrated because an apparent axial scale is shortened in the SeeDB solution due to its high refractive index (refractive index 1.49).Imaging with upright microscopesPrepare an appropriate imaging chamber (Figure 2B-C) for your microscope.Fill in the imaging chamber with SeeDB or SeeDB37. To prevent subtle index mismatch between media and sample, we recommend using SeeDB or SeeDB37 that was equilibrated with the sample, rather than freshly prepared solutions.Put the sample into the imaging chamber and then place a handmade glass bottom Petri dish (or a coverslip) carefully above the chamber. Air bubble should not remain in the chamber. When samples are cleared by SeeDB37, the chamber should be placed on a heat pad to keep the temperature at 37 °C.(Optional for an upright microscope) Pour immersion solution onto the handmade glass bottom Petri dish. SeeDB should not be used for immersion; its viscosity causes an uneven refraction index distribution due to evaporation of water from the surface of SeeDB during imaging and can impair image quality.Imaging with inverted microscopesTransfer the sample and SeeDB to a custom-made imaging chamber (Figure 2A) or a commercial glass-bottomed dish/chamber (35 mm diameter)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}