{
  "id": 18626,
  "origin_website": "Jove",
  "title": "Minimal Invasive Surgical Procedure of Inducing Myocardial Infarction in Mice",
  "procedures": [
    "NOTE: Experiments presented in this paper are performed accordingly to the German low and to the European animal care guidelines. The animals are bred in the Animal facility of Institute for Laboratory Animal Science, Universiy hospital Aachen, Germany, under supervision of Prof. Dr. R. Tolba and Dr. A. Teubner (animal welfare officer).\n1. Animal Care\nKeep the mice in a specialized care unit, assuring proper access to food and specialized veterinary control and treatment. If the animals are moved or purchased from outside, please assure one-week accommodation before undergoing the procedure.\n2. Intubation\nAnesthetize 8-10 weeks old male C57Bl/6 wild type mice, 25-27 g using intraperitoneal injection of 100 mg/kg ketamine and 10 mg/kg xylazine. Monitor the level of anesthesia by toe pinch reflexes. Place vet ointment on the eyes to prevent dryness during the procedure.\nManage pain therapy with buprenophine 0.1 mg/kg body weight subcutaneously before starting the surgical procedure, following the animal care guidelines of your institution.\nAssure the maintenance of sterile conditions to avoid infections during surgery by using sterile materials and instruments.\nPlace the anesthetized mouse in a supine position on a heated surgery table. Remove the hair from both ventral neck area and left half of the thorax using a small razor and disinfect with 70% alcohol prior to incision.\n\t\nPerform a small median incision of 0.5 cm using surgery scissors in the center of the neck. Under the skin, go through the 2 fatty bodies with sterile curved forceps and visualize the trachea under stereomicroscope through the transparence of the covering muscle.\nIntroduce orally the intubation cannula into the trachea under view by using the stereomicroscope (Figure 1A). Distinguish the metal cannula through the transparent tissue. And check, the position and location during the operation at any moment (Figure 1B).",
    "Connect the cannula to the small animal ventilator and adjust ventilation settings according manufactures guidelines (tidal volume between 100-150 µl and a respiration rate between 100-150 per min).\n3. Myocardial Infarction Induction\nPerform a skin incision less than 0.5 cm in the middle of a line between xyphoid and left axila. Use forceps to separate the muscle layer from the underlying ribs.\nPerform a small incision between ribs by using a small scissor until the thoracic cavity is opened17. For chronic infarction, perform the incision in the 5th intercostal space (Figure 1C) and/or for the ischemia/reperfusion model, in the 4th intercostal space (Figure 1D): for an easier approach number from below the 2th and the 3th intercostal space, respectively).\nPlace the retractors into the incision to open thoracic cavity and to visualize the heart.\nCarefully remove the pericardium to prevent excessive fibrotic processes.\nVisualize the left descending coronary artery (LAD) as a deep positioned light red vessel. If the LAD cannot be visualized, consider some reference points to increase the reproducibility.\n\t\nFor chronic infarction model, place the ligature in the middle of the ventral side of the heart (between the auricle and apex), having as reference the vein as shown in Figure 1C. Bind both branches of the artery using 0/7 silk suture to obtain a transmural anterior and posterior infarction. The gray color indicates the position of the ligature and can be repeated if needed (Figure 1C).",
    "For ischemia/reperfusion model, place the ligature under the auricle, over the main body of LAD (Figure 1D). The ligature is located over a silicon tube to protect the integrity of the vessel. The gray color indicates the infarcted area and should appear in the entire heart (Figure 1D). Place temporal sutures on the ribs during the ischemia period and moisten using a compress to avoid tissue drying. After ischemia, remove the silicon tube and cut the suture with small scissors to visualize the reperfusion.\nBeside the anesthetics and analgesics used at the beginning of procedure (steps 2.1 and 2.2), use 0.5% isoflurane during surgery to ensure the proper comfort of the animal, or follow the animal care guidelines of your institution.\n4. Suture and Recovery\nEliminate the residual air from thorax by filling with warm isotonic salt solution.\nClose the thorax with 3 sutures 0/6 (as shown in Figure 2A and 2B). Position the medial sutures at an angle of 90°, to assure a sealed closure of the ribs, as shown in Figure 2 (Figure 2A, B).\nClose the muscle layer with 2 sutures (Figure 2C) and the skin with 3-4 sutures 0/6 (Figure 2D). Perform these sutures separately to obtain a proper window for further echocardiographic measurement.\nDisconnect the intubation cannula from the ventilator and allow spontaneous breath. For later identification, mark the mouse using the local system (ask the animal welfare officer from your institution).\nLay down the mouse on the left side under the red lamp until it wakes up. Do not leave an animal unattended until it has regained sufficient consciousness. Do not allow an animal that has undergone surgery to be in the company of other animals until fully recovered.",
    "Manage pain therapy with buprenophine 0.1 mg/kg body weight, subcutaneously for the next 3 days, following the animal care guidelines of your institution.\n5. Analysis of the Myocardial Infarction\nRegularly monitor the heart function by means of echocardiography (Figure 3A): the ejection fraction, fractional shortening, cardiac output and heart dimensions.\nAnesthetize the animals using intraperitoneal injection of 100 mg/kg ketamine and 10 mg/kg xylazine. Confirm proper anesthetization prior to surgery by the lack of reflexes.\nOpen the thoracic cavity and excise the heart, placing it in sterile PBS solution washing extensively the remaining blood.\nIf needed, collect the blood directly from the heart by avoiding the injury of the infracted regions, or after removal of the heart, from the thoracic cavity.\nAfter washing, stop the heart in diastola in saturated KCl solution (steril filtered 3M KCl in PBS). For histological analysis fix the heart in 10% formalin and proceed with Step 5.7.\nIf necessary, measure the viability of the cardiac cells by Evans-Blue/ Triphenyl tetrazolium chloride (TTC) staining. After rebuilding the ligature at the initial place, perfuse the heart with 200 µl 1% Evans Blue Solution using an aortic cannula and freeze the heart in a small plastic bag at -20 °C, without washing.\n\t\nAfter 2 hr, perform 5 transversally slides using a sharp scalpel and incubate them for 10-15 min in TTC solution at 37 °C, as described by manufactured. Fix the slides for 10 min in 10% formalin and put them between the microscopic slides for further analysis.",
    "Embed the heart tissue in paraffin, by positioning the heart on the tip, to perform transversal sectioning. Perform serial section of 5 µm. Collect the first 20 sections and discard the next 300 µm. Continue the section protocol until the mitral valve level has been reached (Figure 3A, B). Serial sections, 400 µm apart along the entire heart are collected and can be stained for the qualitative and quantitative analysis.\nMeasure the infarction size using Gomori's one-step staining6-8.\nAnalyze angiogenesis, collagen content or inflammatory cells recruitment in serial section using usual immunohistological staining."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}