{
  "id": 19505,
  "origin_website": "Jove",
  "title": "Aversive Associative Learning and Memory Formation by Pairing Two Chemicals in Caenorhabditis elegans",
  "procedures": [
    "1. Recipes\nNGM agar plates (step 2.1.)\n\t\nTo prepare 6 cm NGM plates, dissolve 2.5 g of peptone, 3 g of NaCl, and 17 g of agar in 850 mL of doubly deionized H2O (ddH2O). Bring the total volume to 972 mL with ddH2O.\nAfter autoclaving, cool down to ~65 °C and add 1 mL of 5 mg/mL cholesterol dissolved in ethanol, 1 mL each of 1 M CaCl2 and 1 M MgSO4, and 25 mL of 1 M potassium phosphate (pH 6.0). After mixing well, dispense 8 mL each to 6 cm (in diameter) Petri dishes.\nKeep the plates with lids on a bench at room temperature (RT) for 1 day, and then keep them in plasticware in a cold room until use.\nPrepare Luria-Bertani (LB) medium (step 2.1.) by dissolving 10 g of tryptone, 5 g of yeast extract, and 10 g of NaCl in 1 L of ddH2O. Adjust the pH to 7.0 with 5 N NaOH (several drops) and sterilize by autoclaving.\n\t\nPrepare LB plates by adding 15 g of agar to LB medium. After autoclaving, cool down to ~60 °C and dispense 12 mL each to 9 cm (in diameter) Petri dishes. Keep plates in plasticware in a cold room until use.\nTo make an animal collector (step 2.4.), attach nylon mesh (30 µm mesh size) to the bottom of a clear acrylic cylindrical pipe (3.5 cm in length, 3 cm in external diameter, 2 mm in wall thickness) with glue.\nTo make 0.25% aqueous gelatin solution (step 2.4.), dissolve 0.25 g of gelatin in 100 mL of ddH2O. Sterilize by autoclaving.\nChemotaxis assay plates (step 5.1.)\n\t\nTo make agar plates for chemotaxis assay, dissolve 15 g of agar in 993 mL of ddH2O by autoclaving, and cool down the solution to ~65 °C.",
    "Then, add 5 mL of autoclaved 1 M potassium phosphate (pH 6.0), 1 mL of 1 M CaCl2, and 1 mL of 1 M MgSO4 to the agar solution. All of these solutions are separately sterilized by autoclaving.\nDispense 10 mL of the mixed solution to a 6 cm Petri dish. Place these plates with lids on a bench at RT for two days, and then put them on wet paper towels in plasticware at RT until use. These plates can be used for up to 10 days.\nTo make chemotaxis assay buffer (step 5.4.), mix 5 mL of 1 M potassium phosphate (pH 6.0), 1 mL of 1 M CaCl2, 1 mL of 1 M MgSO4, and 993 mL of ddH2O. Separately sterilize all these solutions by autoclaving.\nTo make a 40 mL CS/US mixture solution (1% aqueous 1-propanol and HCl [pH 4.0]) (step 3.1. and step 4.1.), add 0.4 mL of absolute 1-propanol and 4 µL of 5 M HCl (0.1 mM at final concentration) to 39.6 mL of ddH2O. Keep the solution at RT.\nTo make ddH2O, treat tap water 2x with water purification systems (refer to Table of Materials).\nPrepare a liquid culture (OD600 = ~0.7) of Escherichia coli OP50 by inoculating a fresh colony with a toothpick into 10 mL of LB medium and incubating at 37 °C for 7-8 h. Bacteria cultivated for a longer period can affect the outcome of conditioning, perhaps due to secondary metabolites.\n2. Preparation of synchronized  C.  elegans\nUsing standard methods26, cultivate animals on 6 cm NGM plates (step 1.1.). NGM plates are prepared by spreading 0.2 mL of an E. coli OP50 liquid culture in LB medium (see step 1.9.) and incubating at RT for no more than 24 h (old bacteria can affect the outcome of conditioning).",
    "NOTE: C. elegans learning and memory are extremely sensitive to mechanical, chemical, and temperature stresses. Therefore, it is highly recommended to cultivate animals, maintain all reagents including water, and perform all assays at RT between 17 °C and 20 °C. Physical and mechanical stimulation such as vortexing, rough pipetting, and centrifugation must be avoided. Fresh 1-propanol should be used every 3 months at the longest for an unknown reason. Importantly, animals must be cultivated with plenty of food as starvation can seriously affect the outcome of conditioning.\nOn day 1, pick and place five well-fed gravid animals (put more mutant animals that lay eggs slowly) on each of the four 6 cm NGM plates with a platinum worm picker, and let them lay ~50 eggs for 3 h at RT to obtain a synchronized population of adult animals. Stop egg laying by removing parent animals from the plates with a platinum worm picker.\n\tNOTE: Seeded plates should be kept at RT to minimize stress to the animals.\nCultivate the animals at RT for about 5 days, which is the time it takes for animals to reach their mature adult stage, not the young adult stage.\n\tNOTE: The cultivation period between 4.5 days and 5.5 days should be adjusted depending on the conditions since younger adult animals are more sensitive to the chemicals used for conditioning than mature adult animals (Supplemental Figure 1). After conditioning, younger adult animals may show lower chemotaxis index (C.I.) values.\nCollect ~200 adult animals in an animal collector (see step 1.4.) by washing each plate with 1 mL of 0.25% aqueous gelatin (step 1.4.) This aqueous gelatin prevents adhesion of the animals to the surface of plastics such as pipette tips.",
    "Wash the animals in the collector with ddH2O (step 1.8.) by very gently moving the collector up and down 2x in ~10 mL of ddH2O. Repeat this process 2x more (3x in total) with ~10 mL of ddH2O each to prevent bacterial contamination.\n\t​NOTE: Bacterial contamination seriously affects the chemotaxis of animals.\n3. Mass training for short-term associative learning and memory\nNOTE: See Figure 1 for the massed training workflow.\nGently immerse the animal collector containing ~200 animals in 40 mL of a mixture of 1% 1-propanol and HCl (pH 4.0 after mixing with 1-propanol; see step 1.7.) in a crystallizing dish for ~1 s.\n\tNOTE: For the control animals, do the same but dip only in 1% aqueous 1-propanol. It would be better to treat animals with HCl (pH 4.0) only as another control.\nWash the animals in the collector by very gently immersing the collector 1x in 10 mL of ddH2O in a well of a 6-well tissue culture plate.\n\tNOTE: This washing step must be very gentle and only be done 1x as extensive washing may prevent learning.\nRepeat steps 3.1. and 3.2. 10x without interruption (inter-trial interval [ITI], 0 min).\n\t​NOTE: Use fresh ddH2O each time at RT.\nPlace the collector on an E. coli OP50 lawn on a 6 cm NGM plate for 10 min at RT in order for the animals to rest.\nWash the animals in the collector with ddH2O by very gently moving the collector up and down 2x in ~10 mL of ddH2O. Repeat this process 2x more (3x in total) with ~10 mL of ddH2O each to prevent bacterial contamination.\nProceed to chemotaxis assay as described below (step 5).\n4. Spaced training for long-term associative learning and memory\nNOTE: See Figure 2 for spaced training workflow.",
    "Gently immerse an animal collector containing ~200 animals in 40 mL of a mixture of 1% 1-propanol and HCl (pH 4.0 after mixing with 1-propanol; see step 1.7.) in a crystallizing dish for ~1.0 s.\n\tNOTE: Do the same with 1% aqueous 1-propanol only as a control. It would be better to treat animals with HCl (pH 4.0) only as another control.\nWash the animals in the collector by very briefly immersing the collector 1x in 10 mL of ddH2O in a well of a 6-well tissue culture plate.\n\tNOTE: This washing must be very brief as extensive washing may prevent learning.\nPlace the collector on an E. coli OP50 lawn on an NGM agar plate in a 6 cm (in diameter) Petri dish for 10 min at RT in order for the animals to rest.\n\tNOTE: This resting for 10 min as ITI is crucial for the animals to consolidate memories for the formation of LTM.\nRepeat steps 4.1.-4.3. 10x.\nWash the animals in the collector with ddH2O by very gently moving the collector up and down 2x in ~10 mL of ddH2O, which is kept at RT. Repeat this process 2x more (3x in total) with ~10 mL of ddH2O each to prevent bacterial contamination.\nProceed to chemotaxis assay as described below (step 5.).\n5. Chemotaxis assay\nPrepare agar plates for chemotaxis assay in 6 cm plastic Petri dishes (see step 1.5.).\nTransfer animals in the collector (step 2.5.), which is placed on a flat surface of a plastic Petri dish lid, to a 2 mL microcentrifuge tube with 1 mL of 0.25% aqueous gelatin using a sawed-off pipette tip with a >1 mm (inner diameter) opening.\n\tNOTE: It is important to use a sawed-off pipette tip to minimize shear stress on animals.",
    "Remove the supernatant from the tube after the animals settle at the bottom of the tube by gravity for ~1 min (do not centrifuge).\nGently resuspend the animals in 1 mL of chemotaxis assay buffer (see step 1.6.) and let them settle down by gravity to the bottom of the tube for ~1 min (do not centrifuge). Remove as much supernatant as possible by pipetting.\nMeantime, diagonally spot 4 µL each of 5% aqueous 1-propanol at two places and spot 4 µL each of ddH2O at two other places in the same way, as shown in Figure 3A. For chemotaxis assay of mutants that have lower sensitivity to 1-propanol, spot higher concentrations of aqueous 1-propanol that result in ~0.6 chemotaxis index (C.I.) values of naïve mutants, as shown in Supplemental Table 1.\n\tNOTE: It is important to complete the spotting procedures as quickly as possible. Spot 5% aqueous 1-propanol since 1% aqueous 1-propanol is too weak to attract animals in the chemotaxis assay. In contrast, use 1% aqueous 1-propanol for conditioning since animals treated with higher concentrations of aqueous 1-propanol than 1% show lower C.I. values.\nSpot 6 µL portions of the animal suspension in chemotaxis assay buffer (step 5.4.) containing ~60 animals at the center of three plates for chemotaxis assay using a sawed-off pipette tip with a ~1.0 mm (inner diameter) opening. Remove liquid as much as possible with a laboratory tissue wick without touching the animals and place a lid on the plate.\n\tNOTE: It is important to complete these procedures as quickly as possible.",
    "Allow the animals to move freely on the plate for 10 min at RT, and then transfer the plate into a glass Petri dish on ice for 3 min to stop chemotaxis. Then, keep the plate in a refrigerator until counting the number of animals on the plate.\nCount the number of animals in four sections, except for those in the center circle, under a stereomicroscope and calculate the chemotaxis index (C.I.) using the equation shown in Figure 3B. From the C.I. values, calculate learning index (L.I.) values as the difference between the C.I. value of the reference animals and the C.I. value of the conditioned animals (L.I. = C.I.reference- C.I.conditioned).\n\tNOTE: The C.I. value of the reference animals (C.I.reference) is the mean value of the C.I. values of animals conditioned with 1% aqueous 1-propanol only."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}