{
  "id": 18718,
  "origin_website": "Jove",
  "title": "Neural Stem Cell Transplantation in Experimental Contusive Model of Spinal Cord Injury",
  "procedures": [
    "NOTE: All the procedures were approved by the Review Committee of the University of Milan and met the Italian Guidelines for Laboratory Animals in compliance with European Communities Directive dated November 1986 (86/609/EEC).\n1. Preparation of Cells for Transplantation\nNOTE : Use neural stem cells between the 5th and the 9th passage in culture for these experiments; test the cultures for proliferation and differentiation ability before being labeled for transplantation. Determine the extent of differentiation by immunocytochemistry 12.\nResuspend cells to a concentration of 1 x 106 cells/150 μl (transplant 1 x 106 cells per mouse). Prepare at least 1.2 x 106 cells per mouse because an excess of cells is required for syringe loading purposes.\nWash cells 3 times using neural stem cell medium 13 in a 10 ml conical vial. In each washing step, precipitate cells by centrifugation (500 x g for 5 min, RT).\nCount the cells before the final spin.\nCentrifuge the cells (500 x g for 5 min), and then aspirate the supernatant, being careful not to remove any cells but leaving no more than 25 μl of supernatant.\nPrepare a 2x cell suspension by adding 1 ml of Diluent C to the cell pellet and resuspend with gentle pipetting.\nImmediately before staining, prepare a 2x Dye Solution (4 x 10–6 M) in Diluent C by adding 4 µl of the PKH26 ethanol dye solution to 1 ml of Diluent C in a tube and mix well to disperse.\nRapidly add the 1 ml of 2x cell suspension to 1 ml of 2x Dye Solution and immediately mix the sample by pipetting (final cell density will be 1.2 x 107 cells/ml and 2 x 10–6 M PKH26).\nIncubate the cell/dye suspension for 1-5 min.",
    "Stop the staining by adding an equal volume (2 ml) of 1% BSA solution in HBSS and incubate for 1 min.\nCentrifuge cells (500 x g for 10 min) and carefully remove the supernatant.\nResuspend cell pellet in 10 ml of HBSS and centrifuge (500 x g for 5 min).\nWash the cell pellet 2 more times with 10 ml of complete medium to ensure removal of unbound dye.\nResuspend the cell pellet in 10 ml of complete medium for assessment of cell recovery, cell viability and fluorescence intensity. If cells are needed for transplantation, wash and resuspend them in a sterile physiological solution at a concentration of 3.3 x 105 cells/50 μl.\n2. Preparation for Surgery\nClean and sterilize surgery equipment.\nPrepare the surgery area by wiping with an aseptic agent. Set up the IH Impactor device.\nPrepare the anesthesia equipment: the Active Gas Scavenger with VetScav Filter Weighing Device, continuous flow Induction Chamber, Oxygen Generator, Low Flow O2 Meter for Mice. Clean the induction chamber and the mask used during surgery.\nAnesthetize animals with 2.5% (v/v) isoflurane in oxygen (1 L/min), and wait 5 min after the flow induction for the drug to take effect. Check if the whiskers are twitching or if there is slow hind limb withdrawal in response to pinching the footpad. During the surgery, reduce the isoflurane concentration to 2.0% (v/v) isoflurane in oxygen (1 L/min).\n3. Preparation of Mice for Surgery and Transplantation\nKeep the male adult CD1 mice (25–30 g) for at least 3 days before the experiments in standard conditions (22 ± 2 °C, 65% humidity, and artificial light between 08:00 a.m. to 08:00 p.m.).\n\tNOTE: The entire procedure from surgical preparation to suturing will take about 40 min.",
    "To identify the animal, mark the tail by means of water resistant colored ink.\nUse an electric clipper to cut the dorsal hair of the mouse from the neck, about at T2 level, to the lumbar area.\nSterilize the prepared area with an iodide solution and ethanol (70% in sterile water).\nTreat the animal with a sub cutaneous (s.c.) injection of 200 μl gentamycin (1 mg/ml in sterile saline solution).\nApply ophthalmic lubricant to both animal eyes to prevent desiccation and inject buprenorphine (subcutaneously, 0.03 mg/kg) to alleviate pain.\n4. Laminectomy\nPlace the mouse on a slide warmer to avoid the problem of hypothermia during the surgery. Position the animal with the dorsal side up.\nMake a vertical incision with a scalpel over the region of interest, from T7 to T12.\nHold the skin and superficial fat pad by using standard forceps (usually found in the space between the 5th and 6th thoracic dorsal processes).\nCount the process under the vessel as T6 then move to T7.\nPlace a little bearing under the ventral side of the mouse to increase the curvature of the spine. Immobilize the spinal cord by blocking it with the Graefe forceps.\nCut the paravertebral muscles bilaterally from T7 and T10 vertebral level by using the scalpel until the dorsal surface of the lamina contacts the scalpel tip.\nUse the scalpel to tick off the junction from T7 until T10. Stop in the space between T8 and T9 spiny protrusions. Cut the tissues between T8-T9 and T9-T10 with the micro scissors.\n\t\nUse the Rongeur to remove the T9 process. Expose the junction by carefully scraping away the muscle layer with the micro scissors. Continue until bone is exposed.",
    "Use the forceps to remove muscles from the lamina and open a small space between the vertebrae. Gently insert the micro scissors under the bone, cut the lamina on both sides and remove this part with forceps.\nRemove the lamina with the forceps to expose the cord. Be sure not to leave any free or jagged bone fragments behind; remove them with the Rongeur.\nUse the small tip forceps to remove the periosteum as well as any bone fragments or muscles that may be near the incision.\nRemove the top half of the T9 dorsal process and proceed to the IH Impactor device protocol.\n5. IH Impactor Device Protocol (Contusion)\nPlace the mouse in the middle of the stabilization platform of the IH Impactor device.\nBlock the animal with the two teeth forceps connected with the stabilization platform by two joint positioning arms (left arm for the thoracic vertebra, right arm for cervical vertebra).\nUse the rostral arm to grasp the lateral edge of the rostral vertebral body (T8).\nManipulate the caudal arm in the same manner to grasp the T10 vertebral body.\nPlace the stabilization platform in the device and lower the tip (diameter 0.75 mm) as close to the cord as possible without touching it.\nLift the tip three complete turns before initiating the impact.\nPerform the contusion with the impactor set to deliver a force of 60 kdyn at 100 mm/sec.\n6. Sutures and Post-care\nSuture the incision with a 4/0 absorbable suture thread. Cover the exposed spinal cord at the site of removed lamina; suture the tissue at the extremities of the cut by means of a small needle. Put the two stitches immediately above and under the site of spinal cord exposure.",
    "Close the skin using two or three Reflex clips without pinching off the underlying muscles.\nHydrate the mouse post-surgery with 2 ml of saline solution subcutaneously injected in the lower back.\nPlace the mouse back in a pre-warmed cage to avoid hypothermia during surgical recovery. Place cages on heating pads.\nMonitor the mice during the acute phase post-injury by checking the size bladder, the suture and the animal weight twice a day. Gently squeeze bladder (twice a day for 7 days) to avoid urinary tract’s infections (urine could be cloudy, bloody or containing any precipitates).\nTreat mice once a day with a saline solution injection (2 ml for two days post-surgery s.c. injection) and antibiotic (gentamycin 0.2 ml; s.c. injection) for five days post injury.\nTreat mice for post-operative analgesia with buprenorphine (0.1 mg/kg; twice a day) for 3 days post injury.\n7. Tail Vein Injection of Cells\nNOTE: In the following step the procedure for injecting the cells into the tail vein is demonstrated. Cells could be also administered with an intraspinal transplant by using a stereotaxic frame 15-16, or into the cisterna magna 17. It is important to consider that other cell types could be transplanted with this method, such as mesenchymal stromal cells (e.g., bone marrow mesenchymal stem cells, adipose derived stem cells, amniotic fluid cells). Furthermore, other treatment options such as nanoparticles can be injected via the tail vein after the spinal cord injury.\nUse 70% ethanol and PBS to clean the needle before use. Handle the needle and the syringe only with sterile gloves.\nResuspend the cells in the test tube and load 75 μl of cells into a 0.3 ml syringe (29 G needle and 0.33 cc syringe).",
    "Make sure that no bubbles are present within the cell suspension. Keep the syringe in a horizontal position to avoid cell sedimentation.\nPlace the mouse underneath the heat lamp to dilate the tail veins.\nGrab the mouse and gently pull it into the mouse restrainer to visualize the lateral tail vein as a narrow blue line.\nClean the tail with an alcohol swab. Once the vein is visualized, grab the tail vein between the middle finger and thumb of the left hand.\nBring the needle to the surface at a 15° angle from the horizon and make sure the bevel is up.\nInject 50 μl of cells at a rate of .33 μl/sec. After the injection, delay the retraction of the needle by 10 sec. Retract the needle slowly and pay attention to the possible efflux of cell suspension.\nClean the syringe as in step 7.1 between loads.\n8. Behavioral Tests and Hind Limb Function\nPlace the mouse in the open field.\nEvaluate locomotor function and hind limb recovery after contusion with the open field test according to the Basso mouse scale (BMS) 18 .\n\tNOTE: Neurological function must be evaluated periodically, from day 3 after injury for 4 weeks 18.\n9. Perfusion\nAt the end of the experimental period, anesthetize animals by an intraperitoneal injection of sodium pentobarbital (65 mg/kg). Use toe pinches to evaluate the anesthesia level and proceed only after mouse is unresponsive to the noxious stimuli.\nRestrain the animal in a supine position on a surgery plane.\nCut through the integument and abdominal wall just beneath the rib cage. Separate the diaphragm from the liver.\nUse the scissors to cut the diaphragm to expose the pleural cavity.\nCut the sides of the rib cage until the collar bones.",
    "Use the hemostats to clamp the xiphoid cartilage and place the hemostat over the head.\nHold the bottom third of the heart on a transversal plane with the forceps. Insert the needle into the left ventricle.\nUse a hemostat to clamp the heart. This secures the needle and prevents leakage.\nUse the scissors to cut the right atrium.\nAllow the PBS to pump (18 ml/min) through the animal. Maintain this pressure throughout the buffer infusion period (3-4 min; corresponding to about 70 ml PBS). Continue until the heart is clean.\nSwitch the stopcock to allow the fixative (4% Paraformaldehyde in distilled water, 4%PFA) through the pump. Allow the 4% PFA to pump through the animal for approximately 8-10 min (300 ml). Gradually increase the pressure to reach a maximum of 30 ml/min. A hardened liver is the best indication of a successful perfusion.\n10. Tissue Collection and Processing, Histology and Iimmunohistochemistry\nDissect spinal cords from T5 to L1. Then post-fix the tissue in 6 ml in 4% PFA (O/N at 4 °C).\nPut the same tissue in a solution with 30% sucrose for 72 hr at 4 °C in order to cryo protect it and to prevent the formation of crystals during freezing.\nQuick freeze the cord using dry ice and store it at -80 °C.\nSection by means of a cryostat with 15 µm thickness and collect sections onto glass slides and continue for immunocytochemistry.\nRinse sections with 200 μl of PBS for each slide (3 times; 5 min each, RT).\nPermeabilize each slide with 200 μl of 10% NGS and 0.2% Triton X-100 in PBS for 1 hr at RT.\nRinse sections with 200 μl of PBS for each slide (3 times; 5 min each, RT).",
    "Block non-specific sites with 200 μl of blocking solution for slide (5% NGS; 0.1% Triton X-100 in PBS) for 30 min (RT).\nIncubate each slide with 200 μl of primary antibodies O/N at 4 °C (dilute antibody in 5% NGS; 0.1% Triton X-100 in PBS).\nWash sections with 200 μl of PBS for each slide (3 times; 5 min each; RT).\nIncubate with appropriate secondary antibodies for 2 hr at RT.\nWash sections with 200 μl of PBS for each slide (3 times; 5 min each; RT).\nStain nuclei with 200 μl of 4',6-diamidin-2-phenilindole (DAPI) (1 µg/ml final concentration, 10 min at RT).\nMount by using the FluorSave Reagent and analyse by confocal microscopy.\n\tNOTE: In control determinations, primary antibodies must be omitted and replaced with equivalent concentrations of unrelated IgG of the same subclass. Microtubule-Associated Protein 2 primary antibody was used.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}