{
  "id": 5125,
  "origin_website": "Bio",
  "title": "Determination of Recombinant Mannitol-1-phosphatase Activity from <em>Ectocarpus</em> sp.",
  "procedures": [
    "The standard reaction mixture contains 100 mM Tris-HCl (pH 7.5), 1 mM M1P, 5 mM MgCl2 and 6 to 78 µg of purified recombinant enzyme quantified by NanoDrop (based on the extinction coefficient of 18,700 M-1 cm-1 calculated for the protein of interest), in a final volume of 450 µl. Inactive boiled purified recombinant enzyme is used as a negative control (Table 1).Table 1. Composition of negative control and reaction mixture for determination of M1Pase activityimgsrc:https://en-cdn.bio-protocol.org/attached/image/20160812/20160812001053_0742.jpg The mix is prepared with water, Tris-HCl, MgCl2 and enzyme, then the reaction is started by adding the substrate, and incubation is conducted for 12 min, at 30 °C, with sampling every 3 min. For this, the volume of the reaction mixture is 450 μl, and 80 μl reaction mixture is sampled at t0, t3min, t6min, t9min and t12min. Each condition is tested in three replicates (Figure 2A).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160811/20160811222554_5933.jpgFigure 2. Measurement of absorbance at 620 nm as a function of time (min) in the presence of 1 mM M1P. A. The curves represent two series of triplicates containing 24 µg of purified M1Pase and 24 µg of boiled purified M1Pase, respectively. Abs 620 nm at t0 is taken just after the addition of M1P in the reaction mix. B. The table contains values of absorbance measured under both conditions tested and at different times of experiment.In each sample, reaction is stopped by adding 20 μl of malachite green reagent for subsequent determination of the quantity of phosphate released. To this aim, absorbance in each sample is read at 620 nm in a Safire2 UV spectrophotometer microplate reader after 20 min of incubation at room temperature (Figure 2B). Values are then compared with a standard curve of free phosphate prepared according to the malachite green phosphate assay kit manufacturer’s instructions (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160811/20160811222748_0679.jpgFigure 3.",
    "Use of the malachite green phosphate assay kit to determine free phosphate concentrations. A. Color formation was observed after 20 min of incubation at room temperature for different concentrations of phosphate (from well 1 to 8, 2 wells for each concentration): 0 μM, 4 μM, 8 μM, 12 μM, 16 μM, 24 μM, 32 μM and 40 μM (buffer only, 100 mM Tris-HCl pH 7.5, 5 mM MgCl2, final concentrations). B. Standard curve representing absorbance monitored at 620 nm as a function of variable quantities of free phosphate (Pi). In this example, the linear regression curve was Abs 620 nm = [0.0001 x (pmol Pi in 100 μl)] -0.0085, and R2 = 0.9985. C. Table corresponding to values of absorbance measured for different quantities of free phosphate.Phosphatase activities, based on production of free phosphate, are calculated using the linear regression curve determined as in Figure 3:[(ΔA620 nm test - ΔA620 nm negative control) + 0.0085]/(0.0001*t)WhereΔA620 nm = variation of absorbance during the duration of incubationt = time of incubation (min)One unit (U) of activity corresponds to 1 nmol of Pi released per min.To calculate specific activities, divide the value obtained in the equation above by the quantity of proteins present in the sample. Perform three replicates for each assay, and determine the average ± standard error (S.E.) of these three replicates. From values given in Figure 2, specific activity of M1Pase was 11.30 U/mg in presence of 1 mM M1P.To determine substrate specificity, test M1Pase activity in the presence of each substrate listed in the “Materials and Reagents” section, using concentration ranging from 0.05 mM to 1 mM, at room temperature.",
    "To determine the optimal temperature, incubate the reaction mixtures used in step 1 at temperatures ranging, for instance, from 10 °C to 50 °C, with incremental of 5 or 10 °C. The experiments described below were performed at the optimal temperature of 30 °C.The effect of pH on the enzymatic activity of purified M1Pase is determined by using 100 mM Tris/HCl buffer whose pH ranged from 5.8 to 9, in presence of 5 mM MgCl2.To examine the influence of NaCl, add NaCl in the reaction mixture described in step 1 to obtain final concentrations ranging from 0 to 1 M.To estimate the kinetic parameters of the enzyme for a selected substrate S, run individual enzyme reactions in the presence of at least five different concentrations of this substrate (for example: 0.08 mM, 0.12 mM, 0.18 mM, 0.27 mM, 0.4 mM, and 0.6 mM). Determine the initial reaction rate for each reaction and plot 1/V versus 1/[S] to obtain a Lineweaver-Burk plot, from which Km and Vm for S can be calculated (Figure 4). This calculation can be done using the Hyper32 software.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160811/20160811223359_6137.jpgFigure 4. Lineweaver-Burk plot used to determine the Km (0.67 mM) and Vm (25.25 U/mg) of M1Pase for M1P. [S] is the M1P concentration (in mM) and V is the reaction rate (in U/mg of protein). Three replicates were performed for each assay."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}