{
  "id": 2248,
  "origin_website": "Cell",
  "title": "Tandem immuno-purification of affinity-tagged proteins from mouse testis extracts for MS analysis",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPart 1: Preparation of testis extracts\nStarting materials\nTiming: 3–4 h for collection of testes, homogenization of testis and extraction of cytosolic proteins\nTiming: 2–3 h for preparation of testis nuclear extracts\nSince expression levels and stage specificities are different among the proteins of your interest, the number of testes required for a tandem immunoprecipitation experiment should be empirically estimated. In our case, the expression pattern and the expression level of the protein of interest can be roughly estimated by immunostaining of 3xFLAG-HA tagged protein in the seminiferous tubule section of the knock-in mouse. We often collect numerous testes (40–100 testes from 20–50 juvenile mice) of different stages, and store frozen testes until sufficient number of testes are acquired for one immunoprecipitation experiment. Collected testes can be stored at −80°C until preparation of extracts. For storage in a freezer, it is favorable to detunicate the testes in PBS every time after collection, remove PBS as much as possible, and store them in a tube. The following procedure for the preparation of testis extracts is also applicable to conventional immunoprecipitation.\nCollection of testes, homogenization of testis and extraction of cytosolic proteins.\nTo prepare testis extracts, remove testes from 20 juvenile male (postnatal day 10–21, spermatocytes are in the first wave of spermatogenesis) of mock control mice and 3xFLAG-HA-tagged knock-in mice, detunicate with fine tweezers in PBS (Figure 2[href=https://www.wicell.org#fig2]A). Collect detunicated testes into a new 15 mL tube.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1719-Fig2.jpg\nFigure 2. Extraction and IP of 3xFLAG-HA fusion protein from mouse testis\n(A)Testes are detunicated with tweezers.\n(B) When the seminiferous tubules are passed through the syringe, whitish interstitial cells come out (white arrow). Take the clumps of seminiferous tubules (yellow arrow) into a new tube.\n(C) Homogenization of the testes with Potter-type tissue grinder.",
    "(D) Insoluble debris is removed by cell strainer.\n(E) Ultra-centrifuge rotor.\n(F) Testis extracts are transferred into ultra-centrifuge tubes (upper). After ultra-centrifugation, testis extract is separated into upper clear supernatant and pellet indicated by yellow arrow (lower). Green arrow indicates floating lipid on the top of tube. Take the supernatant into a new tube at 4°C. This is mainly the chromatin-unbound fraction.\n(G) Pellet that is going to be resuspended in buffer B (left). Pellet is briefly sonicated (right).\n(H) Gel pieces for MS analysis. The intensely bule-stained lines indicate the front of the migrating dye. The gel slices are cut into approximately 1–1.5 mm sized cubes.\n(I) Shown are examples of silver-stained immunoprecipitates of 3xFLAG-HA fusion protein. STRA8-3xFLAG-HA immunoprecipitates from the chromatin-bound fraction of Stra8-3xFLAG-HA-p2A-GFP knock-in testes. WT indicates mock purification from non-tagged control mouse testes.\n(J) The destained gel slices.\nOptional: Snap freeze the collected testes in liquid nitrogen, and store at −80°C until the preparation of extracts as described in step2.\nResuspend the testes in 10 mL of buffer A at 4°C. The volume of buffer A should be proportionally scaled up according to the number of testes used. Testes from wild type non-tagged mice should be used for negative control.\nIf you use frozen testes, resuspend the frozen testes directly in buffer A at 4°C, and leave for 5 min.\nNote: The volume of buffer A for one testis should be empirically determined depending on the expression level of the protein of your interest and the size of the testis (the number of spermatocytes/testis). We suggest starting from 40 testes/10 mL.",
    "Optional: Pass the seminiferous tubules through 1 mm syringe to remove interstitial cells of the testis (Figure 2[href=https://www.wicell.org#fig2]B). Collect the clumps of seminiferous tubules with forceps and place them in a new 10 mL of buffer A at 4°C.\nHomogenize the testes with Potter-type tissue grinder pestle and tube (30 mL) by 5–10 strokes at 4°C. (Figure 2[href=https://www.wicell.org#fig2]C, Methods video S1[href=https://www.wicell.org#mmc1]). Take 10 μL of homogenate on a slide glass to confirm the cells are disrupted.\nHold a cell strainer (100 μm) on the top of a 50 mL tube. Take homogenized testis extract by pipet and filtrate it through the cell strainer to remove debris (Figure 2[href=https://www.wicell.org#fig2]D, Methods video S1[href=https://www.wicell.org#mmc1]). If the cell strainer is stuck, change it with a new one.\nTransfer homogenized testis extracts to Open-Top Thickwall Polycarbonate ultra-centrifuge tubes. Centrifuge testis extracts by ultra-centrifugation at 100,000 g for 30 min at 4°C with TLA100.3 Fixed-Angle Titanium Rotor (Figures 2[href=https://www.wicell.org#fig2]E and 2F).\nTake the supernatant into a new tube at 4°C. This is the extract mainly containing the cytosol. Protein concentration should be around the range of 3–5 mg/mL by Bradford assay.\nNote: Keep 40 μL (0.4% of the starting volume) of cytosolic extract as the input sample of immunoprecipitation, if you need to check it later by western blot.\nOptional: The insoluble pellet can be stored at −80°C until the preparation of nuclear extracts.\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Homogenization of testes, filtration through cell strainer, and sonication of insoluble pellet, related to steps 3, 4, and 7\nPreparation of testis nuclear extracts\nResuspend the insoluble pellet with 5 mL of buffer B at 4°C, and then transfer into a new tube.",
    "Sonicate the pellet briefly (Duty cycle: constant, output control: 1), and incubate at 4°C for 30 min. For sonication, use sonifier 250 with 1/8″ Tapered Microtip (Branson) or equivalent sonicator (Figure 2[href=https://www.wicell.org#fig2]G, Methods video S1[href=https://www.wicell.org#mmc1]).\nNote: The volume of buffer B for one testis should be empirically determined depending on the expression level of the protein of your interest and the size of the testis (the number of spermatocytes/testis). Described here is 5 mL for insoluble pellet from 40 testes. But if you need higher protein concentration, less than 5 mL (within a range of 2 ∼ 5 mL) can be used.\nTransfer homogenized testis extracts to Open-Top Thickwall Polycarbonate ultra-centrifuge tubes. Centrifuge the solubilized extracts by ultra-centrifugation at 100,000 g for 30 min at 4°C.\nTake supernatant (total 5 mL) into a new tube at 4°C. This is the nuclear extract solubilized by high salt. Protein concentration will be around the range of 1–3 mg/mL by Bradford assay depending on the age of the starting materials.\nNote: Keep a small amount (20 μL: 0.4% of the starting volume) of nuclear extract at −80°C as the input sample of immunoprecipitation, if you need to check it later by western blot.\nPart 2: Tandem immuno-affinity precipitation of the tagged proteins from testis extracts\nThe following protocol describes immunoprecipitation of the cytosolic proteins and the nuclear proteins. For immunoprecipitation of the cytosolic proteins obtained at step 5, use buffer A, and follow the procedure as described below.",
    "For immunoprecipitation of the nuclear proteins obtained at step 8, dilute the extract with equal amount of buffer C (5 mL) to bring the salt concentration down to 200 mM KCl, then use buffer D and follow the same procedure as described below. For immunoprecipitation of the nuclear proteins at high salt condition, go to immunoprecipitation procedure without dilution, use buffer B and follow the same procedure as described below. Under this stringent condition, while the hydrophobic interaction is retained, the electrostatic protein-protein interactions are lost causing certain dissociation of interacting proteins. Thus, the salt condition should be empirically optimized for the protein of your interest.\nAnti-FLAG immuno-affinity purification\nTiming: 2–4 h\nEquilibrate 100 μL of anti-FLAG M2 magnetic beads with buffer A by taking 100 μL of anti-FLAG M2 magnetic beads into a tube, place it on a magnetic stand, remove the supernatant, and suspend the anti-FLAG M2 magnetic beads in 1 mL of buffer A. Repeat the wash twice. After the final wash, suspend the magnetic beads in 100 μL of buffer A.\nNote: You may use commercially available anti-FLAG M2 agarose beads.\nAdd 100 μL of anti-FLAG M2 magnetic beads suspension to the 10 mL extract.\nIncubate for 1–3 h at 4°C with rotation.\nCollect 1.5 mL of the mixture of the extract and anti-FLAG M2 magnetic beads into a new 1.5 mL tube. Place on a magnetic stand and remove the unbound supernatant. Repeat for the whole mixture of the extract and anti-FLAG M2 magnetic beads by collecting 1.5 mL each time into the same tube.\nNote: Keep the unbound supernatant into a different tube for later confirmation.",
    "Wash anti-FLAG M2 magnetic beads with 1 mL of buffer A for 4 times on a magnetic stand. Leave the tubes on the magnetic stand for 1 min at each wash. After the final wash, keep the tubes on the magnetic stand.\nRemove the washing buffer and suspend the magnetic beads in 200 μL of buffer A containing 3xFLAG peptide (final 100 μg/mL) at 4°C. Elute bead-bound immunoprecipitates with 200 μL of buffer A containing 3xFLAG peptide at 4°C with rotation for 5 min.\nPlace the tube on a magnetic stand. Transfer the supernatant into a new tube.\nNote: For later verification, store 20 μL of the eluted samples at −80°C.\nNote: Repeat elution with another 200 μL of buffer A containing 3xFLAG peptide and combine the eluates. This additional elution increases the yield of anti-FLAG IP products.\nAnti-HA immuno-affinity purification\nTiming: 2–4 h\nEquilibrate 100 μL of anti-HA magnetic beads with buffer A by taking 100 μL of anti-HA magnetic beads into a tube, place it on a magnetic stand, remove the supernatant and suspend the anti-HA magnetic beads in 1 mL of buffer A. Repeat the wash twice. After the final wash, suspend the magnetic beads in 100 μL of buffer A.\nNote: You may use commercially available anti-HA agarose beads.\nAdd 50 μL of anti-HA magnetic beads suspension to the FLAG-purified immunoprecipitates from mock control and 3xFLAG-HA-tagged knock-in mice.\nIncubate for 1–3 h at 4°C with rotation.\nWash anti-HA magnetic beads with buffer A for 4 times on a magnetic stand. After the final wash, keep the tubes on the magnetic stand.\nNote: Keep the unbound supernatant into a different tube for later confirmation.",
    "Remove the supernatant and suspend the magnetic beads in 40 μL of acid elution buffer. Elute bead-bound immunoprecipitates with 40 μL of acid elution buffer by gently tapping the tube for 2 min at 20°C–25°C (room temperature).\nPlace the tube on a magnetic stand. Remove the supernatant and transfer it into a new tube, and neutralize with 4 μL of 1 M Tris-HCl (pH 8.0).\nCritical: Final elution of beads-bound immunoprecipitates should be done with acid elution buffer rather than boiling. In our experience, boiling the beads-bound immunoprecipitates in SDS-sample buffer causes significant dissociation of IgG from the beads, which leads to relatively higher detection of peptides derived from IgG in MS analyses, impeding the detection of peptides from the immunoprecipitates.\nNo avoid inclusion of IgG, elution with HA peptide can also be applied instead of acid elution.\nPause point: The immunoprecipitated samples can be stored at −80°C until the following MS analysis.\nOptional: Run SDS-PAGE using 4 μL of the final immunoprecipitates together with the input samples. Western blotting with anti-FLAG or anti-HA antibody should be performed to examine whether 3xFLAG-HA-tagged proteins are immunoprecipitated (Figure 1[href=https://www.wicell.org#fig1]B).\nPart 3: MS shotgun analysis of the immunoprecipitates",
    "Proteins in the immunoprecipitates will be identified by LC-MS/MS analysis. For shotgun screening of interacting proteins to the protein of your interest, whole immunoprecipitates in the gel are digested by trypsin, and the derived peptides are analyzed by LC-MS/MS according to previously established method (Shevchenko et al., 2006[href=https://www.wicell.org#bib11]). For desalting purpose, the immunoprecipitates first should be run on a gel by 0.5–1 cm from the well. The immunoprecipitated samples contained in the excised gel pieces undergo reduction of S-S bonds and alkylation, followed by trypsin digestion in the gel. The eluted peptides from the gel are subjected to LC-MS/MS analysis. For LC-MS/MS analysis at better resolution, the immunoprecipitates are fully separated on a gel, and stained with Coomassie-blue or silver. Then, the gel pieces containing particular protein bands of your interest can be excised.\nAlternatively, whole immunoprecipitates after acid elution can be directly digested in solution for MS shotgun analysis. However, please note that residual detergents derived from the IP buffer could raise significant noises at the base line in the later MS spectrum. For In-liquid digestion, buffer B without detergents should be used at the final washing step (step 20).\nSample preparation for MS shotgun analysis\nTiming: 2–3 days\nBoil the immunoprecipitated samples in NuPAGE LDS Sample Buffer containing Sample Reducing Agent at 90°C for 5 min. Run the samples on NuPAGE 4%–12% Bis-Tris gel in MOPS-SDS buffer with antioxidant at 200 V for 3–5 min. The front of blue dye should migrate by 0.5–1 cm from the top. In this way, proteins ranged from high to low molecular weight are stacked in a narrow space of the gel.\nImmerse the gel in pure water for 10 min with rotation. Stain the gel in Simply Blue solution for > 2 h.",
    "Pause point: The Simply Blue stained gel can be stored overnight at room temperature or at 4°C.\nDiscard Simply Blue solution and wash the gel in pure water.\nExcise the gel by approximately 0.8 cm × 0.5 cm immediately below the wells (Figure 2[href=https://www.wicell.org#fig2]H). Then cut the gel slices into approximately 1–1.5 mm sized cubes for efficient in-gel trypsin digestion, and transfer them into a 1.5 mL Protein LoBind micro-tube (Figure 2[href=https://www.wicell.org#fig2]H, right).\nOptional: For identification of a protein of a particular band size rather than shotgun analysis, run the immunoprecipitated samples through NuPAGE 4%–12% Bis-Tris gel, and stain with Silver Quest according to manufacturer’s instruction. The gel pieces containing silver-stained bands at the size of your interest can be cut out for MS analysis (Figure 2[href=https://www.wicell.org#fig2]I).\nDestain the protein bands in gel pieces with 300 μL of 25 mM ammonium bicarbonate, 50% acetonitrile for 10–15 min by shaking the micro-tubes at room temperature in the Maximizer MBR-022UP at the speed of 900 rpm.\nNote: Unless otherwise specified, all the steps of in-gel digestion are performed by shaking at 900 rpm in the Maximizer MBR-022UP.\nRemove the supernatant and discard.\nDestain the protein bands in gel pieces with 300 μL of 40 mM ammonium bicarbonate, 20% acetonitrile for 10–15 min.\nRemove the supernatant and discard.\nRepeat 28–31 once more (Figure 2[href=https://www.wicell.org#fig2]J).\nDehydrate the gel pieces with 150 μL of acetonitrile for 10 min. Remove the supernatant, and discard.\nFinally, dehydrate the gel pieces with a centrifugal evaporator for 15 min.\nAfter dehydration, reduce the proteins in the gel pieces (cubes) with 200 μL of 10 mM DTT in 25 mM ammonium bicarbonate for 1 h at 56°C. Remove the supernatant and discard.",
    "Wash the gel pieces (cubes) with 100–150 μL of 25 mM ammonium bicarbonate for 10 min. Remove the supernatant and discard.\nAlkylate proteins in the gel pieces (cubes) with 100–150 μL of 55 mM iodoacetamide in 25 mM ammonium bicarbonate for 45 min with protection from light. Remove the supernatant and discard.\nWash the gel pieces with 100–150 μL of 25 mM ammonium bicarbonate for 10 min. Remove the supernatant and discard.\nDehydrate the gel pieces with 300 μL of 25 mM ammonium bicarbonate, 50% acetonitrile for 10 min. Remove the supernatant and discard.\nRepeat 39 once more.\nFinally, dehydrate the gel pieces with a centrifugal evaporator for 15 min.\nAfter dehydration, digest the proteins in the gel pieces (cubes) with 20 ng/μL trypsin and lysyl endopeptidase in a buffer containing 40 mM ammonium bicarbonate, pH 8.0, overnight at 37°C, by shaking at the speed of 650 rpm.\nNote: Wait until the gel pieces (cubes) expand with the solution of trypsin/ lysyl endopeptidase on ice for about 1 hr. Then cover the gel pieces (cubes) with 40 mM ammonium bicarbonate.\nExtract the digested peptides from the gel pieces (cubes) with 50–100 μL of 50% acetonitrile, 0.1% formic acid for 30–60 min at room temperature in the Maximizer at the shaking speed of 1,300 rpm. Remove the supernatant and transfer it into a fresh micro-tube.\nRe-extract the digested peptides from the gel pieces (cubes) with 50–100 μL of 70% acetonitrile, 0.1% formic acid for 30–60 min at room temperature in the Maximizer at the shaking speed of 1,300 rpm. Remove the supernatant, transfer, and combine into the micro-tube of step 42.\nConcentrate the combined supernatant to 15 μL with a centrifugal evaporator.\nPause point: Until LC-MS/MS analysis, the concentrated samples can be stored at −20°C for 2–3 days.",
    "Mass spectrometry shotgun analysis\nTiming: 2–4 days\nFor LC-MS/MS analysis on Advance UHPLC system coupled to Q Exactive mass spectrometer, it is required before the analysis to perform mass calibration for positive ion mode by automatic calibration procedure with LTQ Velos ESI Positive Ion Calibration Solution.\nNote: The following procedure is the condition optimized for the above equipment. If you are using other equipment, please optimize accordingly.\nSettings for MS and MS/MS acquisitions:\nMS range is set to m/z 350–2,000, resolution 70,000, positive ion mode.\nMS/MS spectra are acquired by the following settings: Top-10 DDA (data-dependent acquisition), resolution 17,500, high-energy collision dissociation value 27.\nESI spray: Advance Captive Spray Ionization probe (AMR/Bruker), 1,400 V, 250°C, 500 nL/min.\nSetting for Advance UHPLC system and autosampler (PAL HTS-xt, AMR/CLC Analytic AG):\nThe sample in autosampler is injected into a pre-column though the multi-valve. The injected sample is trapped in the pre-column (L-column 2 ODS, 5 μm, 0.3 × 5 mm, cartridge trap column, CERI), then desalted and concentrated.\nNote: The solvent for equilibration and desalting consists of 2% acetonitrile and 0.1% trifluoroacetic acid. Therefore, the samples are diluted 2-fold with the solvent of 2% acetonitrile, 0.1% trifluoroacetic acid.\nAfter the sample is desalted and concentrated, change the position of the multi-valve to connect it to the line of separation column.\nSeparation column (analytical column): micro-ODS column (L-column 2 ODS, 3 μm, 0.1 × 150 mm, CERI), at 40°C with flow rate 500 nL/min. Mobile phase A (LCMS grade water, 0.1% formic acid), mobile phase B (LCMS grade acetonitrile, 0.1% formic acid).\nNote: The gradient should be chosen according to the sample. We tested several gradient conditions: For example, 5%–45%B/0–20 min, 5%–45%B/0–40 min, 5%–45%B/0–60 min, and so on. In particular samples described above, we suggest the following condition: 5%–45%B/0–60 min, 45%–95%B/60–70 min.",
    "Perform continuous injection with the auto-sampler controlled by Xcalibur/Tune (Thermo Fisher Scientific).\nAnalyze the raw LC-MS/MS data against the UniprotKB (Swissprot + TrEMBL) and NCBI non-redundant protein/translated nucleotide database restricted to Mus musculus using Proteome Discoverer version 1.4 (Thermo Fisher) with the Mascot search engine version 2.7 (Matrix Science).\nSet the parameters for the analysis as follows:\nFixed modification: carbamidomethylation of Cys.\nVariable modification: oxidation of Met, deamidation of Asn, and deamidation of Gln.\nNote: Whether addition of deamidation of Asn and deamidation of Gln is optional.\nPrecursor mass tolerance:10 ppm.\nFragment ion mass tolerance: 0.02 Da.\nEstimate the false discovery rate (FDR) with a decoy database comprised of either randomized or reversed sequences from the target database. Evaluate false positives by Percolator algorithm. Filter the search results with 1% global FDR for high confidence level."
  ],
  "subjectAreas": [
    "Protein Expression And Purification",
    "Mass Spectrometry",
    "Cell Biology",
    "Molecular Biology",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}