{
  "id": 7427,
  "origin_website": "Bio",
  "title": "Live Imaging of Apoptotic Extrusion and Quantification of Apical Extrusion in Epithelial Cells",
  "procedures": [
    "Cell preparationGeneration of epithelial cells lines expressing fluorescently tagged junctional proteins can be achieved by virus transduction, transient transfection of a plasmid encoding fluoro-tagged proteins of interest, or by tagging a gene of interest using CRISPR/Cas9 genome editing. The below protocol describes steps needed to generate mixed cultures of unlabelled and fluorescently labelled cells (Figure 1A).Note: For simplicity, a fluorescently tagged cell line will be referred to as “GFP-positive line”. However, GFP may be replaced with any bright fluorophore from the green-red spectra. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4232/bioprotoc-11-22-4232-g001.jpgFigure 1. Target of laser injury. Cartoon (A) and a sample image (B) of a cell of interest (yellow asterisk). The target of laser-injury should be composed of one or two unlabelled cells (yellow asterisk) surrounded by fluorophore-positive neighbouring cells. Here, neighbouring cells express MRLC-GFP. Mixing of wild-type and fluorescently-labelled cells prevents optical interference, which is caused by apoptotic cells as they are physically expelled from the monolayer and move out of focus for imaging. Scale bar: 15 µm.Day 1 Harvest approximately 80-90% confluent T75 flasks of GFP-positive and wild-type (WT) cell lines by trypsinisation, spin them down (1,500 rpm, 3 min), and resuspend in 10 ml of fresh full media (see Recipes). Pass the cell suspensions through separate cell strainers.Combine the GFP-positive and WT cells in a 20:1 ratio by gently pipetting up and down to ensure that cells are thoroughly mixed.Seed mixed cells on glass bottom dishes at 30% confluency (Caco-2 cells: 3 × 105 cells resuspended in 2 ml of growth medium) or 50% confluency (MCF-7 cells: 5 × 105 cells resuspended in 2 ml of growth medium). Seeding confluency should be adjusted depending on how individual cell lines behave, to allow at least 48 h between seeding and reaching 100% confluency so that mature junctions form between cells.",
    "Day 2 If knock-down of a protein of choice is required for experiments, transfect cells with siRNA according to established procedure or follow siRNA transfection protocol using Lipofectamine RNAiMAX (Appendix I[href=https://os.bio-protocol.org/attached/file/20211110/4232%20Appendix%201%20and%202.docx]). Note: If cells are resistant to transfection using Lipofectamine RNAiMAX, use lentiviral transduction to knock-down proteins of choice [for a protocol, see Priya and Gomez (2013)] or use CRISPR/Cas9 gene knock-out lines (for generation of these, see Ran et al., 2013).  Day 3 Continue to culture cells in a cell incubator.Day 4 Confirm that cells are fully confluent using a bright field microscope.Warm up 1.5 ml of imaging medium to 37°C.Directly before imaging, add 3 µl of Annexin V, Alexa FluorTM 647 conjugate to the imaging medium. Gently remove the growth medium using a 100-1,000 µl pipette (Gilson PIPETMAN® or an equivalent), and replace it with 1.5 ml of the imaging medium.Notes:   As Annexin V, Alexa FluorTM 647 conjugate is photosensitive, aliquot the original tube into one-use aluminium-foil wrapped tubes. Store aliquots at 4°C up to the expiration date.  To confirm the knock down of a protein of interest, straight after imagining is completed, lyse the cells and extract protein for a western blot. Image acquisition – laser injury and acquisition of apoptotic extrusionNote: The following protocol is based on the Zeiss LSM 710 Meta Confocal Scanner (equipped with a fully tunable Mai Tai eHP DeepSee 760-1,040 nm laser, 2.4 W average laser power), but it may be optimised for use with other comparable systems [e.g., Michael et al. (2016) successfully used a Zeiss LSM 510 Meta Confocal microscope equipped with a tunable 700-1,100 nm Chameleon Laser, >2W power]. Set up the imaging to detect GFP, Alexa FluorTM 647 and Differential Interference Contrast (DIC).",
    "Note: As AnnexinV Alexa FluorTM 647 does not mark living cells, adjust the channel gain to see the unbound Alexa FluorTM 647 positive residue in the imaging media (Figure 3A, yellow arrowheads).  In the acquisition panel, activate the following options: “Z-Stack”, “Time Series”, “Bleaching”, and “Regions” (Figure 2A).Note: We use the ‘Bleaching’ tool in the ZEN software to irradiate a region of interest and induce apoptosis in the target cell. Similar tools are available for other commercial microscopes like Leica and Olympus, although they may be named differently. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4232/bioprotoc-11-22-4232-g002.jpgFigure 2. Snapshot of the ZEISS software including settings optimised for induction of apoptosis using the 790 nm wavelength of the MAI TAI laser.Expand the “Bleaching” window by selecting “Show All”. Activate “Start Bleaching after #scans” and enter “1”. Enter “5” in “Iterations” and select “Different Z Position (µm)”. Choose 790 nm wavelength and 50% transmission (transmission may be further adjusted to approximately 60% if apoptosis of the irradiated cells is not efficiently induced, see Step B7) (Figure 2B).Identify target cells by finding a single or double WT, GFP-negative cell(s) surrounded by GFP-positive cells (Figure 1).Set up approximately 30 1 µm Z-stacks, where the middle stack is focused on the junctional marker.Using the DIC channel, go to a Z-stack where the nucleus of targeted cell is in focus (Figure 3C, 3D) and choose this Z-stack for bleaching, by updating the position in “Different Z Position (µm), Mark Z” in the “Bleaching” options (Figure 2B). Select a circular tool from “Regions” (Figure 2C) and draw a circle over a nucleolus of the selected cell(s) (Figure 3D, 3E).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4232/bioprotoc-11-22-4232-g003.jpgFigure 3. Optimisation of laser-injury setup. A. No apoptotic cells are present before laser injury; yellow arrowheads point at background residue of unbound Annexin V, Alexa FluorTM 647 conjugate in the cell media; B.",
    "Positive Annexin V staining of two cells following laser-induced apoptosis. Alexa FluorTM 647 conjugate was added to the imagining media at 1:500 dilution; C-D. Representative image of the DIC view focused on cell nuclei. For reference, cell nuclei are marked with orange dashed lines, and examples of nuclear condensations (nucleoli) are marked with yellow arrowheads. E-F. DIC view of laser injury. The approximate area of targeted cells is marked with a magenta dashed line, and circular regions of laser injury (E) are marked with red circles. Note the morphology of targeted cells before laser injury (E) and approximately 1 min after laser injury (F). Scale bars: 15 µm. Note: Both Alexa FluorTM 647 images (A, B) were captured using the same laser settings. To ensure that positive AnnexinV staining will be visible, ensure that the unbound residue of AnnexinV is visible before laser injury (A).  Start the imaging using the above settings. Between acquisition of the first and second frames, the MAI TAI laser will be automatically turned on and irradiate the selected region with high-power infrared light multiple times, thus injuring the targeted cell(s). Note: Use the DIC channel to observe the morphological changes happening in the targeted cell(s) – nuclear/cytoplasmic condensation should be visible within 1-2 min after the injury (Figure 3E, 3F). If no morphological changes/AnnexinV staining are visible within 5 min after the injury (Figure 3B), adjust the transmission settings of the MAI TAI laser (Step B3) until apoptosis successfully occurs.  Set up suitable time intervals for imaging – if the goal of the experiment is to capture the behaviour of the neighbouring cells, the interval should be frequent (20-30 s); if the aim is to quantify extrusion, time intervals may be less frequent (5-10 min).",
    "Acquire time-lapse images until extrusion is completed (20-30 min) or for 1 h if extrusion is not progressing. See below for assessment of apical apoptotic extrusion.Quantification of apoptotic extrusionOpen an acquired time-lapse image in ImageJ software, choose “colorized” as a colour mode.Use the attached macro (Attachment 1: Max projection and Orthogonal View.ijm[href=https://os.bio-protocol.org/attached/file/20210901/Attachment%201%20Max%20projection%20and%20Orthogonal%20View.zip]) to generate orthogonal views and a maximum projection of the time lapse image.Note: Alternatively, follow the step-by-step protocol (Appendix 2[href=https://os.bio-protocol.org/attached/file/20211110/4232%20Appendix%201%20and%202.docx]) to generate the orthogonal views and maximum projection of the time lapse images. Attachment 1: Macro generating orthogonal views and a maximum projection from time laps images. Orthogonal views:  using the bottom slider, select a last frame of the time-lapse; position the Z-view-marking lines according to Figure 4A: the lines should cross at the point where neighbouring cells merged underneath the apoptotic cell (Figure 4A, middle panels), or in the centre of the apoptotic cell, if extrusion failed (Figure 4A, right panels). Go back to the first frame of the movie to confirm that the GFP-tagged junctional protein is clearly visible in the Z-views (Figure 4A, left panels).Note: Rotate the image and slightly adjust the position of the Z-views to clearly capture both the junctional protein and the AnnexinV-tagged apoptotic cell. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4232/bioprotoc-11-22-4232-g004.jpgFigure 4. Assessment of apoptotic apical extrusion. A. A cartoon (top) and a sample example (bottom; magenta – AnnexinV staining, green – AHPH RhoA biosensor expressed in the neighbouring cells) of orthogonal views. Left panels: views before laser injury, middle panels: after completion of apical extrusion (blue arrowheads – accumulation of a junctional maker of the neighbouring cells underneath the apoptotic cell), right panels: failed extrusion (an apoptotic cell is retained in a monolayer 60 min after laser injury). Orange asterisks mark apoptotic cells (middle and right) or a targeted cell before the laser injury (left). B.",
    "A cartoon (left) and an example (right) of a successful apical extrusion, during which the epithelial monolayer maintained its integrity. C. A cartoon (left) and an example (right) of failed apical extrusion, during which the epithelial monolayer did not maintain its integrity – an apoptotic cell (orange asterisk) detaches from the neighbouring cells, leading to the formation of empty gaps (yellow arrowheads) between the dying cell and its neighbours. Blue arrowheads point at “detachment fibres”. Scale bars: 15 µm.Asses apical extrusion of apoptotic cells by noting whether the junctional-GFP signal from the neighbouring cells came together underneath the AnnexinV-positive apoptotic cell. If the apoptotic cell was still present between the junctional marker 60 min after the laser-injury, classify extrusion as failed (Figure 4A). If the neighbouring cells came together underneath the apoptotic cell, move on to the next step.Maximum projection: Asses the integrity of the monolayer at the site of apoptosis – in a successful extrusion, the integrity of the monolayer should be maintained (the apoptotic cell should not detach from the neighbouring cells before extrusion is completed) (Figure 4B). If an empty space is present between the neighbouring cells and the apoptotic cells, classify extrusion as failed (Figure 4C). Classify extrusion as successful if the integrity of the monolayer was not perturbed during the extrusion process (the apoptotic cell did not detach from the neighbouring cells at any point while extrusion was progressing) and the apoptotic cell was expelled in an apical direction (see Step C4). Note: If the apoptotic cell detaches from the neighbouring cells, you may observe characteristic “detachment fibres” (Figure 4C, blue arrowheads).  Score the extrusion for all of the remaining time-lapse images (n ≥ 5 apoptotic cells per condition per experiment). Calculate the percentage of successfully extruded cells/all of the apoptotic cells in the condition.",
    "Enter the obtained numbers acquired from at least three independent experiments into a Prism Column Graph. If comparing various conditions, calculate significance and generate a graph.Note: A raw file of a sample time-lapse imaging of induction of apoptosis and subsequent apoptotic extrusion is attached (Attachment 2[href=https://os.bio-protocol.org/doc/upprotocol/p4144/Abstract20_0/Sample%20raw%20timelapse.czi.zip]).Attachment 2: A sample raw file of a sample time-lapse imaging of induction of apoptosis and subsequent apoptotic extrusion. Neighbouring cells express a RhoA biosensor (AHPH-GFP, green channel), apoptosis of two GFP-negative cells was induced using laser microirradiation according to the protocol presented here. Apoptosis of the injured cells was confirmed by Annexin-V staining (magenta channel)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}