{
  "id": 2877,
  "origin_website": "Cell",
  "title": "Optimized protocols for chromatin immunoprecipitation of exogenously expressed epitope-tagged proteins",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPrepare plasmid with shRNA resistant gene\nTiming: about 4 days\nWe mutated specific sites (2124 A to T, 2127 A to T, 2131 A to T, 2136 A to T; numbers denote base position from the first letter) in the coding region of ZHX2 where shRNA #45 targeting using pcDNA3.1-ZHX2wt as template to generate pcDNA3.1-ZHX2res (Figure 1[href=https://www.wicell.org#fig1]A). Site-directed mutagenesis was performed using the Quick Change XL Site-Directed Mutagenesis Kit according to manufacturer’s instruction.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2381-Fig1.jpg\nFigure 1. Flowchart of construction of cell lines expressing exogenous epitope-tagged proteins\n(A) Prepare shRNA resistant gene by site-directed mutagenesis.\n(B) Selection of desired mutation by Dpn I digestion, transformation, and antibiotic selection.\n(C) Construction of pENTER223-ZHX2mut by KOD PCR and BP reaction.\n(D) Construction of Gateway-HA-ZHX2mut by LR reaction.\n(E) Steps of lentivirus production.\n(F) Construction of cell lines stably exprressing exogenously HA-ZHX2mut protein and depletion of the endogenous ZHX2 protein.\nMutant strand synthesis reaction. Prepare the mutagenesis PCR reaction(s) on the ice as indicated below:\ntable:files/protocols_protocol_2381_9.csv\nThen add 1 μL of PfuUltra HF DNA polymerase (2.5 U/μL) to the above reactions. Cycle each reaction using the following cycling parameters:\ntable:files/protocols_protocol_2381_10.csv\nNote: Use a plasmid with small size backbone such as pcDNA will increase the success rate of the site-directed mutagenesis.\nDpn I digestion of the amplification products. Add 1 μL Dpn I restriction enzyme (10 U/μL) directly to each amplification reaction and mix thoroughly. Incubate the reactions at 37°C for 1 h to digest the nonmutated supercoiled dsDNA (Figure 1[href=https://www.wicell.org#fig1]B).",
    "Note: Dpn I is a Type IIM restriction enzyme which digests methylated DNA. pcDNA3.1-ZHX2wt was prepared from E. coli dam+ strain and had GmATC sequence which could be cleaved by Dpn I. The new synthetic pcDNA3.1-ZHX2res did not have GmATC sequence and could not be cleaved by Dpn I.\nTransformation of XL10-Gold ultracompetent cells. Add 2 μL β-Mercaptoethanol to 45 μL XL10-Gold ultracompetent cells and mix for 10 min on ice. Add 2 μL of the Dpn I-treated DNA to the ultracompetent cells and mix 30 min on ice. Then heat in 42°C water bath for 30 s and quickly back on ice for 2 min. Add 0.5 mL LB solution, and incubate the tubes at 37°C for 1 h with shaking at 225–250 rpm.\nSelection of targeted plasmid. Spread cells on LB–ampicillin agar plates, and incubate the transformation plates at 37°C for about 16 h.\nPurify plasmid and confirm sequence. Transfer desired single clone to LB–ampicillin buffer, and incubate at 37°C for more than 16 h with shaking at 225–250 rpm. Collected the products and extracted plasmid with Qiagen plasmid DNA purification kits. Sequencing the plasmid after mutation to confirm the DNA sequence. Here generated the pcDNA3.1-ZHX2res plasmid from the above steps.\nPrepare plasmid for virus production\nTiming: about 1 week\nThis part is to generate a lentivirus-based expression plasmid from the pcDNA3.1-ZHX2res using the GATEWAY cloning technique. Based on the GATEWAY cloning protocol,7[href=https://www.wicell.org#bib7] we first perform a KOD hot start polymerase reaction using the attB-primers to generate an attB-flanked PCR product. Here we used the above generated pcDNA3.1-ZHX2res plasmid as a template to generate attB-ZHX2res (Figure 1[href=https://www.wicell.org#fig1]C).\nKOD hot start polymerase reaction. Standard reaction setup\ntable:files/protocols_protocol_2381_11.csv\nCycle each reaction using the following cycling parameters:\ntable:files/protocols_protocol_2381_12.csv",
    "Purify attB-PCR product. Separate the attB-PCR product by 1% agarose DNA gel electrophoresis, and confirm the location of attB-PCR product by using Safe Imager 2.0 Blue Light Transilluminator. The brightest band at ∼ 2.5 kb was the desired product of attB-ZHX2res (Figure 2[href=https://www.wicell.org#fig2]). Cut off the targeted product and purified it by a QIAquick Gel Extraction Kit.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2381-Fig2.jpg\nFigure 2. Separate the PCR product by 1% agarose DNA gel electrophoresis\nPerform BP recombination reaction between attB-PCR product (attB-ZHX2res) and a donor vector pDONR223 by using Gateway BP Clonase II Enzyme mix (see key resources table[href=https://www.wicell.org#key-resources-table]) to generate an entry clone8[href=https://www.wicell.org#bib8] (Figure 1[href=https://www.wicell.org#fig1]C).\nAdd the following components to a 1.5 mL microcentrifuge tube at room temperature (21°C–22°C) and mix:\ntable:files/protocols_protocol_2381_13.csv\nMix above reaction well by vertexing followed by centrifuge briefly. Incubate reaction at 25°C for 1 h. Add 2 μL of 2 μg/μL Proteinase K solution and incubate at 37°C for 10 min.\nTransformation. Transform 1 μL of each BP reaction into 15 μL of DH5α. Incubate tube on ice for 30 min. Heat-shock cells by incubating at 42°C for 30 s and quickly put the tube back on ice for 2 min. Add 500 μL of LB broth medium and incubate at 37°C for 1 h with shaking. Plate 50 μL of each transformation onto LB–spectinomycin agar plates.\nTransfer desired single clone to LB–spectinomycin buffer, and incubate at 37°C for more than 16 h with shaking at 225–250 rpm.\nCollect bacteria and extracted plasmid (pENTR223-ZHX2res) with Qiagen plasmid DNA purification kits. Sequencing the plasmid to confirm the DNA sequence.\nPerform an LR recombination reaction between pENTR223-ZHX2res and Gateway-HA-Vec (plenti-UBC-HA-gate-pGK-HYG) by using Gateway LR Clonase Enzyme mix (see key resources table[href=https://www.wicell.org#key-resources-table]) to generate an expression clone (Gateway-HA-ZHX2res) (Figure 1[href=https://www.wicell.org#fig1]D).",
    "Add the following components to a 1.5 mL tube at room temperature (21°C–22°C) and mix:\ntable:files/protocols_protocol_2381_14.csv\nMix above reaction well by vertexing followed by centrifuge briefly. Incubate reactions at 25°C for 1 h. Add 1 μL of the Proteinase K solution to each sample to terminate the reaction. Vortex briefly. Incubate samples at 37°C for 10 min.\nTransformation. Transform 1 μL of each LR reaction into 15 μL of DH5α. Incubate on ice for 30 min. Heat-shock cells by incubating at 42°C for 30 s. Add 500 μL of LB broth medium and incubate at 37°C for 1 h with shaking. Plate 50 μL of each transformation onto LB–kanamycin agar plates.\nTransfer desired single clone to LB–kanamycin buffer, and incubate at 37°C for more than 16 h with shaking at 225–250 rpm.\nCollect bacteria and extracted plasmid (Gateway-HA-ZHX2res) with Qiagen plasmid DNA purification kits. Sequencing the plasmid to confirm the DNA sequence.\nConstruct cell lines expressed exogenous HA-tagged proteins\nTiming: about 1 month\nVirus production.\nGateway-HA-ZHX2res plasmid was constructed as described above. Lentiviral ZHX2 shRNA (pLKO-ZHX2 shRNA #45) was obtained from Broad Institute TRC shRNA library (Clone ID: TRCN0000017745). HEK293T packaging cell lines were used for lentiviral amplification. Lentiviral infection was carried out as previously described.9[href=https://www.wicell.org#bib9],10[href=https://www.wicell.org#bib10] Briefly, viruses were collected at 48 h and 72 h post-transfection. Viruses were purified by passing through 0.45 μm filters (Figure 1[href=https://www.wicell.org#fig1]E).\nAlternatives: Here we used Lipofectamine 3000 reagent to assemble plasmid mixture and package the virus, other transfection reagents could be used as a substitute.\nConstruct stable cell lines.",
    "The triple-negative breast cancer cell line MDA-MB-231 were firstly infected with lentivirus encoding Gateway-HA-ZHX2res for 48 h in the presence of 8 μg/mL polybrene. Then the cells were selected by hygromycin (50 μg/mL) for at least 72 h. Afterward, MDA-MB-231 were infected with lentivirus encoding ZHX2 sh45 using the same virus infection condition for 48 h and selected by puromycin (2 μg/mL) for at least 72 h (Figure 1[href=https://www.wicell.org#fig1]F).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2381-Fig3.jpg\nFigure 3. Immunoblot of cell lysates of MDA-MB-231 infected with lentivirus encoding shRNA #45-resistant ZHX2 (ZHX2res) or control vector (EV), then followed by ZHX2 shRNA #45 or Ctrl lentivirus infection\nNote: 1. The order of two lentivirus infection could be switched depending on the essentiality of gene of interest (see troubleshooting 3[href=https://www.wicell.org#sec7.5]). 2. Confirmation of the expression of exogenous protein and depletion of endogenous protein should be performed to ensure the desired cell line. Here we used western blot to confirm the expression of exogenous/endogenous ZHX2 (Figure 3[href=https://www.wicell.org#fig3]). 3. We suggest to using validated shRNA/sgRNA sequence to eliminate potential off-target effect. In our case, previous studies have validated the function and absence of off-target effect of exogenous ZHX2 by phenotypic rescue experiments.1[href=https://www.wicell.org#bib1],3[href=https://www.wicell.org#bib3]\nCritical: It is highly recommended to set up a control group when performing antibiotic selections and the selection time depends on 100% death of the parental cell after selection. We observe 72 h of selection is sufficient to kill MDA-MB-231. Different cell line needs different antibiotic concentrations; therefore, an antibiotic kill curve should be performed.\nPause point: Optional stop step. The constructed MDA-MB-231 could be resuspended in cryoprotectant and frozen at −80°C.\nCell expansion for ChIP assay.\nCells were passaged several rounds and proliferated to ∼1 × 10ˆ8 cells (about 20 × 15 cm dishes for MDA-MB-231) to get enough starting materials for ChIP assay.\nCrosslink cells",
    "Timing: about 1 h\nCrosslink cells for 10 min with 1% paraformaldehyde in media (add 1 mL 16% paraformaldehyde per 15 mL DMEM media to each 15 cm dish) at room temperature (21°C–22°C);\nAdd 800 μL 2.5 M glycine to the media (finally concentration: 125 μM) in order to quench unreacted paraformaldehyde with glycine, then rotate 5 min at 50 rpm by Digital Waving Rotator at room temperature (21°C–22°C);\nRemove supernatant and wash cells with 15 mL cold 1 × PBS one time;\nResuspend cells with 5 mL cold PBS + protease inhibitors. Scrape cells and transfer to a new 15 mL tube. Centrifuge cells at 225 g for 5 min. Wash cells for one time by using 5 mL cold PBS + protease inhibitor;\nPellet cells by centrifugation at 225 g for 5 min;\nCritical: 1. Crosslink 10 min (max. 20 min) at room temperature (21°C–22°C), shake to mix at 50 rpm by using a Digital Waving Rotator. Long crosslink may hurt the sonication effect. 2. Add protease inhibitors to PBS just before use.\nPause point: Optional stop step, cell pellets can be stored at −80°C.\nLysis and sonication\nTiming: 3 h\nResuspend cells in 10 mL LB1 + protease inhibitor, rotating 10 min at 50 rpm using a Digital Waving Rotator at 4°C, then centrifuge in 1,350 g for 5 min at 4°C;\nResuspend cells in 10 mL LB2 + protease inhibitor, rotating 10 min at 50 rpm using a Digital Waving Rotator at 4°C, then centrifuge in 1,350 g for 5 min at 4°C;\nResuspend cells in 6 mL LB3 + protease inhibitors, pass through a syringe with 27 gauge needle three times to break up cell clumps;",
    "Split into aliquots evenly for sonication (1.5 mL per 15 mL conical tube), add 10 μL of 100 mM PMSF/Isopropanol to eliminate foams;\nSonicate 30 s, stop 30 s, 90 cycles by Bioruptor UCD-200, high power, cooled by circulating water system;\nAlternatives: Other sonication systems with similar levels of function are acceptable.\nCentrifuge 18,000 g for 15 min at 4°C;\nSave 30 μL sonication supernatant as sonication check samples in −80°C; save 30 μL sonication supernatant as ChIP input in −80°C; save residual sonication supernatant for IP chromatin;\nNote: Stop 5 min every 15 cycles of sonication.\nPause point: Optional stop step, cell lysate can store at −80°C.\nCheck the effect of sonication\nTiming: 5 h\nAdd 170 μL elution buffer and 2 μL 500 μg/mL RNase A to above 30 μL sonication check sample, do reverse crosslink at 37°C for 1 h (keep vortex at 300 rpm by ThermoMixer F2.0);\nAdd 2 μL of 20 mg/mL Protease K to digest protein for 2 h at 55°C (vortex at 300 rpm by ThermoMixer F2.0);\nSpin down 1 min for 16,000 g at room temperature (21°C–22°C);\nTransfer 200 μL supernatant to new Eppendorf tube;\nRecover DNA by Qiagen PCR purification kit;\nMonitor DNA shearing effect by 1.5% agarose DNA gel electrophoresis;\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2381-Fig4.jpg\nFigure 4. Monitor DNA shearing effect by 1.5% agarose DNA gel electrophoresis\nNote: The optimal size range of chromatin for ChIP-Seq analysis should be between 150 and 300 bp. DNA fragments within this size range, which are equivalent to mono- and di-nucleosomal chromatin fragments, provide high resolution of binding sites, and they work well for next generation sequencing platforms. In our case, which showed in Figure 4[href=https://www.wicell.org#fig4], the distribution of DNA in 1.5% DNA gel electrophoresis is between 150–900 kb, but most fragments located in 150–300 kb range.",
    "Critical: It is important to handle all the samples with the same sonication treatment. Make sure the fragmented chromatin size at the same level for all samples to avoid potential ChIP bias by loss/gain of chromatin sites by unequal shearing.\nIP chromatin\nTiming: 24 h\nWash 100 μL Dynabeads Protein G with 1 mL block solution three times, gently mix, collect beads by a magnetic stand, remove supernatant, resuspend beads in 500 μL block solution;\nAdd 10 μL HA antibody to 500 μL resuspended beads, rotate 30 rpm at 4°C for 2 h using a Digital Waving Rotator to form HA antibody-beads conjugates (Dynabeads coupled to HA antibodies), wash three times with 1 mL block solution, collect HA antibody-beads conjugates by magnetic stand, remove supernatant, and resuspend in 100 μL block solution;\nAdd 100 μL resuspended beads to sonication supernatant (6 mL);\nRotate overnight (about 16 h) by Digital Waving Rotator 30 rpm at 4°C;\nWash the DNA-HA-beads complex with 1 mL RIPA wash buffer 8 times on magnetic stand;\nWash the beads with 1 mL TE buffer (1 mL TE buffer + 50 mM NaCl), spin 3 min at 960 g in 4°C, and carefully remove residual TE buffer with a pipet.\nNote: 1. Transfer materials to a new clean Eppendorf tube during rinsing process; 2. Use centrifuge to collect DNA-HA-beads complex after washing by TE buffer.\nElute, reverse crosslinks, and digest RNA and protein\nTiming: 3 h\nAdd 210 μL elution buffer and 2 μL 500 μg/mL RNase A to HA beads; Do reverse crosslink on ThermoMixer F2.0 at 37°C for 1 h (keep rotation at 300 rpm);\nAdd 2 μL of 20 mg/mL Protease K to digest protein 2 h on ThermoMixer F2.0 at 55°C (keep rotation at 300 rpm);",
    "Spin down 1 min at 16,000 g in room temperature (21°C–22°C);\nTransfer 200 μL supernatant to a new 1.5 mL Eppendorf tube;\nRecover DNA by Qiagen PCR purification kit according to the handbook except the last step. At the last step, elute DNA with 100 μL ddH2O rather than the EB buffer provided in the kit;\nDetermine the concentration of purified DNA by Qubit dsDNA HS kits and Qubit 2.0 Fluorometer11[href=https://www.wicell.org#bib11];\nTake 5 μL of ChIPed, purified DNA for real-time PCR analysis. Store remaining 95 μL at −20°C.\nNote: Elute DNA with 100 μL ddH2O at the last step of purification by Qiagen PCR purification kit.\nPause point: Optional stop step, the eluted DNA products can store at −20°C.\nChIP-PCR analysis\nTiming: 3 h\nChIP-PCR is commonly used to analyze protein binding to a known subset of target loci in the genome. In ChIP-PCR, enriched DNA fragments are identified and quantified using common qPCR reagents and protocols according to manufacturer’s instructions. We diluted ChIP Input and ChIP sample in 1:100 separately, and made PCR reaction master mix as follow:\ntable:files/protocols_protocol_2381_15.csv\nReal time PCR was done by the QuantStudio Dx Real-Time PCR Instrument. PCR cycling conditions as follow:\ntable:files/protocols_protocol_2381_16.csv"
  ],
  "subjectAreas": [
    "Genomics",
    "Rnaseq",
    "Molecular Biology",
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}