{
  "id": 4927,
  "origin_website": "Bio",
  "title": "Isolation and Purification of Murine Microglial Cells for Flow Cytometry",
  "procedures": [
    "Stage 1: Animal preparation and perfusion   Anesthetize mice via an i.p. injection of a ketamine hydrochloride and xylazine mixture (10 ml and 1 ml respectively).   Flush deeply anesthetized mice with ice-cold sterile DPBS (perfuse transcardially with cold dPBS using peristaltic pump or a 10 ml syringe connect with 22G needle. Many well describe protocols are available online but for good examples see References Video 1 and Video 2.      Stage 2: Brain extraction and Isolation of microglial cells   Extract one brain and put the brain tissues into a tissue grinder containing 2 ml of ice-cold DPBS without Ca2+/Mg2+.   After homogenization, transfer homogenates into 15 ml centrifugation tubes (homogenize the tissues completely by doing up and down with the grinder bar).    Rinse three times the plunger with 2 ml of ice-cold DPBS. Keep on ice.   Centrifuge homogenates at 300 x g for 10 min at 4 °C.   Aspirate supernatants and gently resuspend pellets in 3 ml of Digestion medium.   Incubate homogenates at 37 °C for 40 min and shake tubes every 10 min.   After digestion, complete volumes to 10 ml with ice-cold FACS buffer.   Transfer homogenates into new 50 ml centrifugation tubes by filtering cell suspensions through 70 µm nylon filters.   Wash cells by rinsing the 15 ml centrifugation tube with 10 ml of ice-cold FACS buffer and transfer into the 50 ml centrifugation tube through the same 70 µm-filter.   Centrifuge homogenates at 300 x g for 10 min at 4 °C.   Aspirate supernatants and wash cells by adding 20 ml of ice-cold FACS buffer.   Centrifuge homogenates once again at 300 x g for 10 min at 4 °C.   During the centrifugations, prepare the isotonic Percoll solution by diluting Percoll 10:1 in 10x HBSS.",
    "Prepare needed volumes of 30% and 80% Percoll solutions by diluting the Percoll isotonic solution with the Percoll dilution medium. Note: Keep Percoll solutions at room temperature.   Resuspend cell pellets in 8 ml of 30% Percoll solution.   Transfer 4 ml into a 15 ml centrifugation tube.   Using a serological pipette, carefully transfer 3 ml of 80% Percoll solution below the cell containing 4 ml of 30% Percoll solution. Note: Take 4-5 ml in the serological pipette and use gravity to underlay the 80% Percoll solution to avoid the mixture of the upper and lower layers, which could affect the efficiency and yield of microglia isolation.   Add the remaining cell containing 30% Percoll solution to the upper phase.   Centrifuge at 1,050 x g with no brakes and low acceleration for 40 min at room temperature.   Aspirate the fat containing layer at the top of the liquid.   Using a P1000 micropipette, carefully collect isolated microglial cells (~2 ml) into a new 15 ml centrifugation tube containing 10 ml of ice-cold FACS buffer. Note: Microglial cells are within the cell ring at the interface between the pink top layer (30% Percoll) and the colorless bottom layer (80% Percoll).   Centrifuge isolated microglial cells at 300 x g for 10 min at room temperature.   Aspirate supernatants and resuspend pelleted cells into 250 µl of ice-cold FACS Buffer.   imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160103/20160103233914_0509.jpg Figure 1. Schematic diagram of the gradient preparation        Stage 3: Microglia cell markers staining and flow cytometry   Transfer all cell suspensions (250 µl) into 96 v-shaped well plate.   Centrifuge cells at 300 x g for 3 min at 4 °C and remove supernatants by inverting the plate.    Resuspend cells into 200 µl of ice-cold FACS buffer containing purified rat anti-mouse CD16/CD32 (1:100) for Fc receptors blocking.   Incubate on ice for 20 min.",
    "Centrifuge cells at 300 x g for 3 min at 4 °C and remove supernatants.    Resuspend cells into 50 µl of ice-cold FACS buffer containing rat anti-mouse CD45 PEG/Cy5 (1:50), rat anti-mouse CD11b Alexa 700 (1:50) and Live/Dead Blue fluorescent reactive dye (1:50).   Incubate on ice for 45 min.   Add 200 µl of ice-cold FACS buffer. Note: At this step, it is possible to fix cells for a subsequent analysis on the flow cytometer by adding 50 µl of 4% (w/v) paraformaldehyde (PFA) solution at pH = 7.4. Incubate at room temperature for 15 min and wash cells with ice-cold FACS buffer prior to their storage at 4 °C in the dark, for up to 4 days.   Centrifuges cells at 300 x g for 3 min at 4 °C.   Resuspend cells into 250 µl of ice-cold FACS buffer and transfer into 5 ml polystyrene tubes for flow cytometry.   Analyze samples by using a two-laser, six-colors FACS Canto II flow cytometer and data acquisition with BD FACSDiva software (version 6.1.2)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}