{
  "id": 16988,
  "origin_website": "Jove",
  "title": "Robotic Vagus-Sparing Total Gastrectomy for CDH1 Gene Mutation Treatment",
  "procedures": [
    "The patient provided informed consent for the publication of de-identified information, images, and video documentation. Associate Professor Dr. Michael Talbot (co-author) is an upper gastrointestinal surgeon accredited to perform gastrectomy at his institution. Due to the negligible risk of this case report and protocol, it was exempt from an ethics review as per the local institutional review board guidelines. Ethics application for case reports are exempted as per the local institutional review board guidelines.\n1. Patient positioning\nPlace the patient in the reverse Trendelenburg position after general anesthesia has been given.\nSecure the patient in position with a foot plate, a body strap placed above the knees, and ankle straps. Abduct (<90째) the arms, and crepe bandage them to the arm boards. Place a Nathanson liver retractor bracket on the operating table, cranial to the left arm board.\n2. Port placement (Figure 1)\nMake a 12 mm skin incision via the surgeon's preferred approach in the right midclavicular position at or below the level of the umbilicus. Perform an optical entry with an 8 mm, 0째 laparoscope scope and with a 12 mm port through this incision. Note, the camera port should be 10-20 cm from the target anatomy.\nExchange the port for a 12 mm robotic (stapling) port with a 12-8 mm reducer, and swap the laparoscope with an 8 mm, 30째 laparoscope. Establish 15 mmHg CO2 pneumoperitoneum with 45 mmHg flow.\nMake three additional 8 mm skin incisions in the transumbilical plane, and place three 8 mm robotic ports. Place one of the robotic ports at the umbilicus and the other two robotic ports lateral to it on the left side. Ensure there is a >8 cm distance between the ports and a 10-20 cm distance between the ports and the target anatomy.",
    "Place another 12 mm assistant port (port A) in the upper-right quadrant. Insert a Nathanson retractor into the epigastrium through a 5 mm incision, and retract the left lobe of the liver.\nPlace the robotic patient cart over the patient from the patient's right side, taking care to avoid collision with the liver retractor. Dock the camera arm first using the laser-guided port placement. Perform an incisura targeting the stomach with an 8 mm, 30째 robotic scope using port 3.\nDock and burp the remaining robotics ports to the instrument arms, and then insert a force bipolar 8 mm instrument (port 1), a vessel sealer extend (port 2), and a tip-up fenestrated grasper (pot 4). Set the monopolar and bipolar auto-cut and forced coagulation at effect 3, and check the system setup.\nimgsrc://cloudfront.jove.com/files/ftp_upload/65303/65303fig01.jpg\nFigure 1: Robotic port placement. The Nathanson retractor handle is seen in the epigastrium. There is a 12 mm assistant port in the upper-right quadrant. The remaining ports from the left to the right of the image are the 12 mm robotic port with reducer, the 8 mm camera port, and two additional 8 mm robotic ports. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/65303/65303fig01large.jpg]\n3. Vagus-preserving dissection\nMobilize the greater curve of the stomach through the gastrocolic ligament from the antrum to the cardia and divide into five to seven short gastric vessels lateral to the arcade vessel sealer extend to include the N1 nodes. Then, mobilize the left side of the esophageal hiatus.",
    "Enter the phrenoesophageal ligament and mobilize the left side of the distal esophagus. Perform distal dissection with the vessel sealer and continue down to the mobilization of the first part of the duodenum. Follow the supraduodenal window through the pars flaccida to complete the right-sided esophageal mobilization, with the plane of dissection abutting the esophagus.\nTransect the first part of the duodenum with the robotic stapler using a 60 mm x 4.3 mm green reload with a buttress reinforcement. Divide the left gastric vessels close to the wall of the stomach using the vessel sealer. This is to ensure that the posterior vagus is left undivided in the mesentery around the left gastric pedicle.\nRetract the esophagus and stomach in the superolateral direction and identify the posterior vagus nerve. Sweep the nerve posteriorly and preserve it.\n4. Suture of the esophagojejunostomy with a jejunal pouch\nPhrenoesophageal ligament reconstruction\n\t\nPerform the phrenoesophageal ligament reconstruction in a continuous anticlockwise direction from the 5 o'clock to 9 o'clock position using a 2-0 nonabsorbable barbed suture on a 26 mm 1/2 circle taper point needle. Transect the intraabdominal esophagus with the robotic stapler using a 60 mm x 4.3 mm green reload. Move the detached stomach to the upper-right quadrant.\nEsophagojejunal anastomosis\n\t\nRaise the greater omentum cranially to identify the duodenojejunal flexure and bring a jejunal loop of 50 cm (creating a 40-60 cm biliopancreatic limb after the jejunal pouch formation) to the esophagus.",
    "Suture a 23 cm long 3-0 absorbable barbed suture on a 26 mm 1/2 circle taper point needle as a 3 o'clock lateral esophagojejunal pexy. Retract the uncut suture laterally. Create an esophagostomy anterior to the staple line using a monopolar diathermy hook with an 18Fr nasogastric tube guide. Create a jejunostomy of an equal or slightly smaller size as done for esophagostomy.\nSuture the posterior wall of the esophagojejunostomy with the barbed suture in a continuous, clockwise fashion from the 3 o'clock to 9 o'clock position, incorporating the staple line. Suture the anterior portion using another of the same suture to complete the full-thickness single-layered suture for the esophagojejunal anastomosis. Place a few medial sutures beyond the anastomosis as a medial pexy.\nJejunal pouch\n\t\nTransect the proximal jejunal loop at 10 cm from the anastomosis with a robotic stapler using a 60 mm x 2.5 mm white reload. Create antimesenteric enterostomies 10 cm proximal and distal to the esophagojejunal anastomosis.\nPerform two firings of the robotic stapler using 60 mm x 2.5 mm white reloads to create the jejunal pouch. Ensure the second firing does not go all the way to meet the esophagojejunal anastomosis in order to preserve the blood supply to the anastomoses. Close the jejunal enterotomy in a continuous fashion with a 3-0 absorbable barbed suture.\n5. Stapled jejunojejunostomy\nMeasure a 70 cm alimentary limb and place a 2-0 silk interrupted suture at this point and the distal biliopancreatic limb for both marking and retraction.\nForm the jejunojejunostomy using a staple-only technique, as described in the triple-stapling technique for laparoscopic gastric bypass10,11. Use a 60 mm x 2.5 mm white reload to form the anastomosis and close the enterotomy.",
    "Close both the jejunal and retro-Roux mesenteric defects using 2-0 nonabsorbable barbed sutures to reduce the risk of complications due to internal herniation.\n6. Specimen extraction and closure\nRemove the instruments, Nathanson retractor, and ports under robotic vision. Undock the robotic patient cart from the patient.\nCreate a 5 cm mini-laparotomy through the extension of the umbilical port. Deliver the specimen through a small O-ring wound protector retractor. Close the laparotomy in the usual fashion using muscle sparing sutures with continuous fascial closure and with a 1:4 suture to wound length ratio.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}