{
  "id": 3124,
  "origin_website": "Cell",
  "title": "Protocol for preparation of a photo-triggering double cross-linked adhesive, antibacterial, and biocompatible hydrogel for wound healing",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation of GelNB\nTiming: 7–8 days\nThis section is about the detailed method for GelNB fabrication and subsequent purification. Moreover, the modification of NB group onto gelatin molecule is exhibited in Figure 1[href=https://www.wicell.org#fig1].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2696-Fig1.jpg\nFigure 1. Schematic illustration of the fabrication of GelNB\nDissolving the gelatin.\nPut 10 g gelatin into a 250 mL beaker containing 90 mL deionized water.\nStir the gelatin solution at 60°C for 1 h until it is clear.\nKeep the homogeneous gelatin solution at 37°C.\nNote: Gelatin solution solidifies below 30°C and it re-liquefies when reheated.\nPreparation of NB/EDC/NHS/DMSO solution.\nDissolve 60 mg NB in 1 mL DMSO in darkness.\nAdd 12 mg EDC and 12 mg NHS into NB/DMSO and oscillate it.\nReaction of gelatin with NB.\nDrop NB/EDC/NHS/DMSO into homogeneous gelatin solution very slowly and stir it at 45°C for 4 h.\nDialysis and freezing-drying.\nPour the reacted solution into the dialysis bag and clamp it. It is dialyzed against deionized water at 40°C for 3 days.\nNote: Deionized water needs to be replaced every 12 h during dialysis process.\nAliquot dialysate solution into 50 mL centrifuge tubes with a volume of 30 mL and store in −80°C for 24 h.\nLyophilize the frozen precursor with a freeze dryer and keep it away from sunshine and damp.\nSynthesis of CSMA\nTiming: 7–8 days\nThis section describes the process of CSMA synthesis and purification (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2696-Fig2.jpg\nFigure 2. Schematic illustration of the fabrication of CSMA\nDissolution of chitosan.\nDissolve 5 mL pure acetic acid in 100 mL deionized water.\nAdd 1 g chitosan into diluted acid solution and stir it intensely for 2 h to form a homogeneous solution.\nChitosan modification.",
    "Add 0.77 mL MA into chitosan solution drip by drip and stir the mixture at 60°C for 6 h.6[href=https://www.wicell.org#bib6]\nNote: The synthetic process must be conducted in the fume cupboard owing to the high toxicity of MA.\nDialysis and freezing-drying.\nThe reacted mixture is neutralized with 10 wt% NaHCO3 in a ratio of 1:10.\nPour the solution into the dialysis bags and clamp the bags. It is dialyzed against deionized water for 3 days.\nAliquot dialysate solution into 50 mL centrifuge tubes with a volume of 30 mL and store it in −80°C for 24 h.\nLyophilize the frozen precursor by a freeze dryer and store it at 4°C.\nPreparation of CM/GN composite hydrogel\nTiming: 4 h\nThis section is about the components of CM/GN composite hydrogel and the process of photocuring.\nProcess of CM/GN hydrogels fabrication.\nPut 40 mg CSMA and required quality of GelNB into 2 mL deionized water and heat it at 55°C for 3 h.\nAdd photo-initiator (LAP) in obtained yellowish precursor at a final concentration of 0.5 wt%.\nTransfer the mixture into a custom-made PDMS mode (Ф10 mm × 2 mm).\nIrradiate the precursor with UV light (365 nm, 30 mW/cm2) for 5–20 s to generate the hydrogels (Table 1[href=https://www.wicell.org#tbl1]).\ntable:files/protocols_protocol_2696_3.csv\nPlace the solid hydrogels in petri dishes at 4°C for next experiments.\nMechanical characterization\nTiming: 2 h\nThis section introduces the way to measure mechanical property of the hydrogels.\nThe procedures of mechanical characterization.\nDrop prepared CM2/GN0, CM2/GN5, CM2/GN7.5, CM2/GN10 hydrogel precursor in the custom-made PDMS mode and irradiate them with 365 nm UV to form Ф10 mm × 2 mm disks.\nPerform compressive tests under an electronic testing machine (MTS C41) with a 50 N load cell.\nPlace the hydrogels in the center of the base.",
    "Move the load cell down to just touch the top of the hydrogels.\nSet the compressive rate as 1 mm/min.\nCalculate compressive modulus from the linear region of the stress-strain curve.\nLap shear test\nTiming: 2 h\nThe section describes the method of lap shear test to evaluate the adhesion.\nThe steps of lap shear test.\nMeasure the lap shear of CM/GN hydrogels under a modified ASTM standard (F2255-05).\nCover glass slides with collagen sausage casing to prepare the substrates.\nPipette 100 μL CM/GN precursor between two substrates (overlapped area is 25 × 10 mm) and irradiate it with 365 nm UV.\nLoad the substrates to breakage using a testing machine (MTS C41) at a speed of 5 mm/min.\nTest of water content\nTiming: 5 h\nThis section presents the details of water content measurement.\nThe steps of water content test.\nLyophilize prepared hydrogels (Ф10 mm × 2 mm) and record the weights as W0.\nImmerse freezing-dried hydrogels in 10 mL deionized water until the masses keep constant. Record the weights as Wd.\nCalculate water content (Wc) as follows:\n(Equation 1)\nW\nc\n=\n(\nW\nd\n−\nW\n0\n)\nW\n0\nSwelling and deswelling kinetic studies\nTiming: 6 h\nWe exhibit the details of swelling and deswelling kinetic studies in this section.\nSwelling kinetic studies.\nImmerse a slice of freezing-dried hydrogel (Ф10 mm × 2 mm) (m0) in 10 mL deionized water at room temperature (25°C).\nTake out the hydrogels and wipe with filter paper at 5, 15, 30, 60, 120, 180, 360, 720 min. Record the weights as mt.\nDefine swelling ratio as Equation 2[href=https://www.wicell.org#fd2].\n(Equation 2)\nS\nw\ne\nl\nl\ni\nn\ng\nr\na\nt\ni\no\n=\nm\nt\nm\n0\nDeswelling kinetic studies.",
    "Expose the fully swollen hydrogels (me) to air at room temperature (25°C) and measure the weights (mt) at pre-determined time (5, 15, 30, 60, 120, 180, 360, 720 min).\nCalculate deswelling ratio as Equation 3[href=https://www.wicell.org#fd3].\n(Equation 3)\nD\ne\ns\nw\ne\nl\nl\ni\nn\ng\nr\na\nt\ni\no\n=\nm\nt\nm\ne\nAntibacterial performance\nTiming: 24 h\nThis section describes the way to evaluate the antibacterial performance of the composite hydrogels.\nSteps of antibacterial test.\nAdd 50 μL Escherichia coli (E. coli) stored in glycerin at −80°C in 25 mL LB culture and stir it at 37°C for bacteria activation.\nSpread 100 μL activated E. coli evenly over the LB nutrient agar plate (Ф90 mm) and locate prepared hydrogels (Ф10 mm × 2 mm) on the plate carefully.\nIncubate E. coli seeded on LB nutrient agar plates at 37°C for 12 h and evaluate the antibacterial effect by the area of inhibition zone.\nNote: The hydrogels are prohibited from dragging on the LB nutrient agar plates inoculated with E. coli to prevent trace of drag.\nCell viability and proliferation\nTiming: 8 days\nThis section supports the experiment details to estimate the biocompatibility in vitro.\nBiocompatible evaluation through CCK-8 straining for BMSC (passage 2 to passage 5) (a common cell type for biocompatibility experiments).\nSterilize designed precursor solution with 0.22 μm filters and irradiate it at 365 nm in a sterile environment.\nImmerse the prepared hydrogels in culture media for 12 h to make hydrogel extract.\nDilute rat bone marrow mesenchymal stem cells (BMSCs) to 10ˆ4 mL−1 and drop 100 μL cell suspension in 30 wells of a 96-well plate.\nEvery 6 wells are for group control, CM2/GN0, CM2/GN5, CM2/GN7.5, CM2/GN10, respectively.\nPrepare three such 96-well plates for next experiment.",
    "Culture BMSCs for 12 h and replace the cell culture medium with 100 μL hydrogel extract as above grouping.\nRemove BMSCs culture medium.\nAdd 300 μL CCK-8 in 2.7 mL DMEM in dark for CCK-8/DMEM regent.\nDrop 100 μL CCK-8/DMEM reagent in every well and incubate BMSCs at 37°C and 5% CO2 for 30 min. The color of culture changes from pink to yellowish.\nEstimate the values of optical density by a microplate reader.\nConduct the CCK-8 straining on day 1, 4, 7.\nNote: The cell culture medium is refreshed every 2 days.\nCytotoxicity of CM/GN hydrogels\nTiming: 5 days\nWe conduct cell Live/Dead staining experiments for cytotoxicity evaluation in this section.\nAnalysis of cytotoxicity through Live/Dead assay.\nDrop 1 mL BMSCs (10ˆ5 mL−1) in a 12-well plate and seed the cells at 37°C and 5% CO2 for 12 h. Prepare two such 12-well plates for next experiments.\nReplace cell culture medium with hydrogel extract. Groups control, CM2/GN0, CM2/GN5, CM2/GN7.5, CM2/GN10 are marked. Repeat twice in each group.\nApply Calcein/PI Cell Viability/Cytotoxicity Assay Kit to analyze the toxicity of the hydrogels.\nMix 5 μL calcein acetoxymerthyl ester (Calcein AM) (1000X) and 5 μL propidium iodide (PI) (1000X) in 5 mL buffer (1X) in dark.\nRemove the culture of BMSCs and wash it with PBS.\nAdd 500 μL Calcein AM/PI in every well and incubate the cells at 37°C, 5% CO2 for 30 min in dark.\nExhibit the Live/Dead assay by a fluorescence microscope. Green fluorescence is for Calcein AM (494–517 nm) and red fluorescence is for PI (535–617 nm).\nConduct the experiment on day 1 and 4.\nNote: The cell culture medium is refreshed every 2 days.\nIn vivo skin defects model\nTiming: 14 days",
    "This section describes a step-by-step approach for the application of hydrogels in Sprague Dawley rats skin defect.\nThirty healthy male Sprague Dawley rats are provided by Hangzhou Qizhen Laboratory Animal Technology, weighing about 200–300 g and aged about 6–8 weeks. All animals are treated according to the standard guidelines approved by the Zhejiang University Ethics Committee (ZJU20210204).\nAcclimatize all rats for 7 days before surgery.\nDivide thirty rats randomly into two groups: control group and hydrogel group.\nAfter weighing, inject the rats of sodium pentobarbital (40–50 mg/kg body weight) with intraperitoneal injection for anesthesia.\nPlace the rats in prone position on the operating table and shave the dorsal region of hair.\nUnder aseptic condition, create full thickness skin round wounds (10 mm in diameter) by a needle biopsy on the shaved dorsal region of rats above the tail but below the back.\nInject hydrogel group with hydrogel wound dressing irradiated with UV light (365 nm) for 20 s (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2696-Fig3.jpg\nFigure 3. In vivo wound healing treated by CM/GN hydrogels\n(A) Schematic of full-thickness skin defects repair using CM/GN hydrogels.\n(B) Photographs of wounds on 3rd, 7th and 14th day for hydrogel and control group. Scale unit: 1 mm.\n(C) Quantitative analysis of the wound area percentage in all groups (n = 5, ∗p < 0.05, ∗∗∗p < 0.001).\n(D) Histological evaluation of wound regeneration for hydrogel and control groups on 3rd, 7th, and 14th day. Granulation tissue thickness for hydrogel and control group on 14th day (granulation tissue: blue arrows). Scale bar: 400 μm.\n(E) Granulation tissue thickness of hydrogel and control groups on 14th day. (n = 5, ∗∗∗p < 0.001).\nTreat the control group with 40 μL of PBS.\nBandage wound with a clean dressing (HN-001, Hainuo Bio-Engineering Co., Ltd).",
    "Put the rats into cages separately after the operation for recovering by themselves.\nAllow the rats to move freely in the cages in the following days. Record photos of the wound area every day (Figure 3[href=https://www.wicell.org#fig3]B).\nHistological analysis\nTiming: 14 days\nThis section introduces the steps of tissue simple paraffin embedding and Hematoxylin-Eosin (H&E) straining to estimate the therapeutic effect.\nDehydration and paraffin embedding of the tissue samples.\nOn the 3rd, 7th and 14th day after surgery, 5 rats in each group are sacrificed with excessive anesthesia.\nUse tissue scissors to free the skin tissues of the control group and the hydrogel wound site and the surrounding healthy parts, and trim them to the size of 0.5cm∗0.5cm.\nWash the samples with PBS 3 times and fix them in 4% (v/v) paraformaldehyde for 1 h.\nTake out the tissue samples and place them in the marked pathological specimen holder and wash them in running water for 24 h.\nTake the pathological specimen clips out for gradient dehydration, followed by 30%, 50%, 70%, 80%, 90%, 95% and 100% alcohol.\nConduct in 30%, 50% and 70% alcohol for 3 h, respectively.\nConduct in 80%, 90% and 95% alcohol for 2 h, respectively.\nConduct in 100% alcohol for 10 min.\nRepeat above dehydration twice.\nSubject the specimens successively to the same volume of dimethyl benzene ethanol and xylene for 1 h each.\nImmerse the transparent tissue blocks in xylene liquid paraffin for 1–2 h, then in pure paraffin for 2 h.\nPlace the tissue blocks in paraffin to complete the embedding.\nThe paraffin blocks embedded with the tissue are cut into sections with a thickness of 4 μm by a microtome.\nParaffin sections stained by Hematoxylin-Eosin (H&E).\nHydrate the sections and dip in xylene for 10 min twice.",
    "Wash them with 100%, 95%, 90%, 70%, 50% alcohol and running water for 5 min, respectively.\nAdd drops of hematoxylin dye to the paraffin sections for 10–15 min.\nDifferentiate them with 1% salted ethanol solution for 15 s, followed by 0.5% eosin for 2–3 min.\nDehydrate the paraffin sections with 50%, 70%, 90% alcohol for 5 min and 95%, 100% alcohol for 5 min twice.\nAdd xylene transparent for 2 min, repeat twice, and finally add 1 drop of gum in the center of the stained area of the slide and cover the cover glass.\nAll slides are scanned and analyzed by a Digital Slide Scanner (KFBIO, Ningbo).\nThe regenerated skins from the wound site are also excised for immunofluorescence (IF) staining with Anti-VEGFA antibody (proteintech) and TNFA Ab (proteintech), respectively.\nUse CoraLite488-conjugated Affinipure Goat Anti-Mouse IgG (H + L) (proteintech) and CoraLite594-conjugated Goat Anti-Rabbit IgG (H + L) (proteintech) as the secondary antibody to reveal VEGFA and TNFA expression.\nStain the nuclei with 4′,6-diamidino-2-phenylindole (5 μg/mL). Observe slides under an upright fluorescence microscope (BX53, Olympus)."
  ],
  "subjectAreas": [
    "Chemistry",
    "Health Sciences",
    "Biotechnology And Bioengineering",
    "Model Organisms",
    "Biophysics"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}