{
  "id": 19259,
  "origin_website": "Jove",
  "title": "Myo-mechanical Analysis of Isolated Skeletal Muscle",
  "procedures": [
    "The protocol is performed with the approval of the UCSF Institutional Animal Care and Use Committee (IACUC).\n1.  Dissection of the Mouse Extensor Digitorum Longus (EDL) Muscle\nPerform all animal procedures in accordance with institutional guidelines.\nEuthanize animal with 200 mg/kg intraperitoneal pentobarbital/cervical dislocation just prior to muscle harvest 10. The dissection should be well practiced so that the muscle can be harvested and mounted in the tension transducer within 15 minutes of euthanasia.\nArrange carcass supine on dissection tray and pin leg to tray.\nUnder dissection microscope, open skin, carefully open fascia (Fig.1A), and peel tibialis from the ankle upwards to expose EDL (Fig.1B). Use drops of lactated Ringer's solution to keep the muscle moist and buffered during the harvest.\nRemove EDL, preserving as much tendon as possible on each end, and put into a Petri dish containing lactated Ringer's solution. Tie suture to each of the muscle tendons (Fig.1C). It is essential that the muscle fibers not be touched or disturbed during the dissection.\n2.  Mounting of the Mouse EDL in the Muscle Strip Myograph",
    "For these studies, a tissue bath is needed that secures the muscle while allowing it to bathe in physiological solution at constant temperature with continuous oxygenation. The bath is coupled with a force transducer for the measurement of muscle tension. We employ an integrated muscle strip myograph bath from Danish Myo Technology (DMT Model 820MS) for this purpose. In addition, a square pulse electrical stimulator (Grass Model S48) and data acquisition platform (ADInstruments PowerLab Data Acquisition System and LabChart software) are needed to elicit, record and analyze myo-mechanical responses, respectively. The DMT 820MS has platinum electrodes integrated into the chamber cover that are positioned on either side of the muscle, in the mid-portion of the muscle strip. Other myographs may require specific attention to electrode placement.\nFill myograph bath with 5  mL Krebs Henseleit solution 11. Warm to 25°C. Bubble O2/CO2 (95%/5%) through bath for 15 minutes prior to use.\nUse sutures to extend EDL between clamps of myograph and secure the tendons of the EDL muscle (Fig.1D,E) between the clamps. Be careful not to clamp the muscle itself.\nMaintain myograph bath at 25°C.\n3.  Myo-mechanical Analysis\nA. Twitch tension\nSet initial length in the bath so that there is no muscle laxity.\nDetermine maximal stimulus (duration 0.5 ms) by adjusting voltage in order to obtain maximal twitch tension, then set stimulus at 20% above maximal (to achieve supramaximal stimulus). In our studies, the supramaximal stimulus is usually achieved at an output of 40 volts.\nVerify output from the stimulator using an oscilloscope.\nDetermine optimal length by gradually stretching the muscle until there is no further increase in twitch tension.\nAllow muscle to equilibrate for 3 min.\nDeliver supramaximal square stimulus (0.5 ms) at optimal length using Grass S44 electronic stimulator, and record output.",
    "Record: twitch tension curve (Pt vs time; Fig.2A).\nB. Tetanus tension\nAllow muscle to rest for 3 minutes.\nApply a train of supramaximal stimuli for 300msec at 150 Hz at optimal length using Grass S44 electronic stimulator, and record output.\nRecord: tetanus tension curve (Po vs time; Fig.2B).\nC. Force-frequency\nAllow muscle to rest for 3 minutes.\nForce-frequency: apply trains of supramaximal stimuli at 30, 60, 100, 140, and 160 Hz with 3 minutes rest between each stimulus (Fig.3). Alternatively, trains may be applied 15, 25, 35, 45, 55, 65, 75, 100, 140 and 160 Hz for better resolution at lower frequencies, where force changes substantially.\nPlot: force-frequency relationship (% maximal force vs stimulation frequency).\nD. Fatigue\nApply train of short tetani: 60 Hz for 300 ms (or frequency adjusted to produce 50% of peak force), every 3 seconds for 10 minutes. By 10 minutes, the tetanic force should decline to a plateau level of ~15% of the initial value (Fig.4).\nPlot: low frequency fatigue (% maximal force vs time).\nE. Additional data collection at end of protocol\nBefore unmounting the muscle from the myograph, set the muscle at optimal length as determined in step III.A.4 and measure its diameter using either an ocular on the microscope or with calipers. Calculate cross-sectional area (μm2).\nMeasure muscle mass (mg) by removing sutures and weighing muscle.\nWeigh mouse to assess body mass (gm).\n4.  Calculations\nMuscle:body mass ratio =\n\tmuscle mass/body mass\nTwitch tension, Pt (mN) =\n\tmaximum tension generated during twitch\nSpecific twitch tension (N/cm2) =\n\ttwitch tension (mN)/cross-sectional area (μm2) x 105 N/mN•μm2/cm2\nTime to peak tension (ms) =\n\ttime from onset of contraction to maximum tension\nHalf-relaxation time (ms) =\n\ttime from peak tension to 50% of peak tension\nTetanic tension, PO (mN) =\n\tmaximum tension generated during tetanus",
    "Specific tetanic tension (N/cm2) =\n\ttetanic tension (mN)/cross-sectional area (μm2) x 105 N/mN•μm2/cm2\nMaximal rate of rise of tetanus (N/s) =\n\tmaximum rate of increase in tension during the tension rise in tetanus, i.e., the maximum slope of the tetanic tension curve (or, dPO/dt)\nHalf-relaxation tetanic tension (ms) =\n\ttime from cessation of stimulation to 50% of the tension at termination of stimulation\nTwitch tension-to-tetanic tension ratio, Pt/PO =\n\tmaximum twitch tension/maximum tetanic tension\nFatigue index=\n\tratio of tension after two minutes of low frequency fatigue to maximal isometric tension\n5.  Representative Results\nimgsrc://cloudfront.jove.com/files/ftp_upload/2582/2582fig1.jpg\nFigure 1. Dissection of EDL muscle. A, Exposure of hindlimb muscles.TA, tibialis anterior. B, Exposure of EDL (extensor digitorum longus) muscle.C, Attachment of sutures to EDL tendons.D, Tension transducer bath (view from side). E, EDL mounted in bath (view from above). The muscle in incompletely immersed in the buffer for illustrative purposes; in practice, the muscle should be completely immersed to prevent from drying out.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2582/2582fig2.jpg\nFigure 2. Example of tension curves. A, Example of twitch tension curve illustrating maximal twitch tension (Pt), contraction time (CT) and half-relaxation time (HRT).Bar, 1s. B, Example of tetanic tension curve showing maximal tetanic tension (Po) and half-relaxation tetanic tension (HRTT). Bar, 1s.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2582/2582fig3.jpg\nFigure 3. Example of force-frequency relationship analysis. A, Tensions generated by incremental stimulation frequencies.B, Example of pulse train at 30MHz. Bar, 80ms. C, Example of pulse train at 140MHz. Bar, 80ms. D, Example of force-frequency curve derived from data shown in A. The shape of the force-frequency curve is characteristic of muscle strength, and can be compared between muscles from different animals.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2582/2582fig4.jpg",
    "Figure 4. Example of low frequency fatigue analysis. A, Decremental tensions generated over period of low frequency stimulation.Examples of pulse trains at indicated time points (B,C,D) are shown below. E, Example of low frequency fatigue curve derived from data shown in A. The shape of the low frequency fatigue curve is characteristic of muscle strength, and can be compared between muscles from different animals."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}