{
  "id": 13793,
  "origin_website": "Jove",
  "title": "Manipulation and In Vitro Maturation of Xenopus laevis Oocytes, Followed by Intracytoplasmic Sperm Injection, to Study Embryonic Development",
  "procedures": [
    "NOTE: All experimentation with frogs was carried out following requirements of the UK Home Office.\n1. Preparation of Xenopus laevis Oocytes\nApproximately a week before the oocyte collection, inject female frogs with 150 U of Pregnant Mare Serum Gonadotropin (PMSG) for pre-priming by using 1 ml sterile syringe with a 27 G needle. Injection is done subcutaneously into dorsal lymph sac.\n\tNOTE: It is optimal to use frogs that did not lay eggs for a long time (at least more than half year) or that have never laid eggs before.\nStore pre-primed frogs in a water tank set at 18 °C in light controlled room (7 am–7 pm: on, 7 pm–7 am: off).\nOn the day of oocyte collection, prepare 1 L of 1x Modified Barth’s Solution (MBS) from 10x MBS stock by diluting with double distilled water (ddH2O),and add penicillin and streptomycin at the final concentration of 10 μg/ml each (MBS+P.S.). 10x MBS stock consists of 880 mM NaCl, 10 mM KCl, 24 mM NaHCO3, 8.2 mM MgSO4.7H2O, 3.3 mM Ca(NO3)2.4H2O, 4.1 mM CaCl2.6H2O, 100 mM HEPES, pH 7.5.\nAnesthetize a pre-primed frog by subcutaneous injection of 120 mg (in 400 μl) of Tricaine methanesulfonate (MS222). Keep the injected frog in a small tank with water.\nAfter 10 min, check the anesthetized frog by turning it over since successfully anesthetized frogs do not respond to this. If anesthesia is incomplete, add ice into the tank and wait for another 10 min.\nPick up the frog from the small tank and place in dorsal recumbency on a damp wipe.\nUsing forceps and a small surgical scissors, pinch the skin and make a small incision (2 cm) in the lower part of the abdomen, lateral to the midline. Make another incision at the other side.",
    "After cutting the skin, lift the muscle layer with forceps and make the incision in the muscle layer.\nObserve the ovary after the muscle layer is cut and pull the ovary out from the incisions using forceps.\nTransfer extracted ovary to a 50 ml tube with MBS solution.\n\tNOTE: Try to collect as much ovary as possible from both incisions.\nSlaughter the female frog by exsanguination, followed by freezing for subsequent appropriate disposal.\nRinse the extracted ovary a few times with MBS+P.S. until blood is washed away. Then, transfer the ovary to a 9 cm Petri dish containing MBS+P.S.\n\tNOTE: Check the quality of oocytes under a dissecting microscope at this point. If oocytes are apparently bad quality, such as oocytes with uneven pigmentation in the animal half (Figure 1A), do not process further and instead obtain a new ovary. Ideally, oocytes should have equally pigmented animal hemispheres and be approximately equally sized.\nTease the ovary into small pieces (1-2 cm2) and collect 5 ml of oocytes in a new 50 ml tube.\nRinse 5 ml of the torn ovary a few times with MBS+P.S. and add MBS+P.S. to 15 ml.\nAdd 7 units of the enzyme for defolliculation to the ovary suspension (see Materials List).\n\tNOTE: Reconstitute lyophilized enzyme with 10 ml of ddH2O (28 units/ml). Place the vial for 30 min on ice with occasional gentle swirling. Aliquot 250 μl and store at -80 °C until use.\nIncubate the ovary piece with the enzyme for 1 hr with gentle shaking on the shaker (speed at 15 REV/min, equivalent to approximately 0.014 x g).\n\tNOTE: For almost complete removal of follicle cells, 2 hr to 2 hr 15 min incubation with the enzyme is normally needed. Longer incubation is needed for oocyte nuclear transfer experiment16.",
    "After 1 hr incubation, pick up a small number of treated oocytes (10-20 oocytes) and transfer to a 6 cm Petri dish containing MBS+P.S. Check the extent of defolliculation under a dissecting microscope. If oocytes are separated from each other and at least partially defolliculated (Figure 1B), immediately proceed to the next stop reaction (step 18). If oocytes are still heavily surrounded by follicle cells, incubate for an extra 15 min at maximum.\nAdd plenty of MBS+P.S. to stop the reaction and discard the supernatant. Repeat the washing for 10 times.\n\tNOTE: Add MBS+P.S. by pouring to the wall of a 50 ml tube, but not directly to oocytes. After suspension in MBS+P.S., small immature oocytes tend to float at the top of washing buffer and discard such small floating oocytes.\nAfter the washes, transfer to a 9 cm Petri dish containing MBS+P.S.\n\tNOTE: From this step onwards, keep oocytes at 16-18 °C as much as possible. This can be done by keeping the oocytes-containing dish on a temperature-controlled stage.\nSelect stage VI oocytes according to Dumont’s classification for subsequent uses and transfer to a new 9 cm Petri dish containing MBS+P.S. Oocyte transfer can be done by using a glass pipette with an appropriate tip size (bigger than the oocyte size).\n\tNOTE: Good quality oocytes should have an evenly pigmented animal hemisphere with clear contrast between the animal hemisphere and the vegetal hemisphere, and be approximately equally sized (Figure 1C). Stage VI oocytes represent fully grown oocytes that can respond to progesterone (oocyte diameter is about 1.2-1.4 mm).\n2. Injection of Antisense Oligonucleotides or mRNA into Oocytes\nNOTE: All steps in this section should be done at 16-18 °C on a microscope stage equipped with temperature-controlled circulating water or on a plastic box filled with ice.",
    "Transfer 200-300 selected oocytes into a new 9 cm Petri dish filled with MBS+P.S., in which microinjection will be performed.\n\tNOTE: In each condition, 200-300 oocytes are normally used. In total, approximately 1,000 oocytes are used in one experiment.\nFor preparing injection of antisense oligos or mRNA, eject the metal plunger of a microinjector.\nFill a glass capillary with mineral oil using syringe and insert the glass capillary filled with oil to the metal plunger of microinjector.\n\tNOTE: A glass capillary is pulled by micropipette puller. These needles are kept in a box without damaging tips.\nCut the tip of the needle using small surgical scissors under a microscope by aiming as small diameter tip for injection as possible.\n\tNOTE: The needle tip can be sharpened by using a micro forge or micropipette beveler. To bevel the needle at an angle of 25° improves the capacity of penetrating the oocyte wall.\nPlace a small strip of Parafilm on the stage of a dissecting microscope and dispense a 3 μl drop of the antisense oligo or mRNA solution.\nMove the tip of the injection needle into the small droplet of solution and fill the needle with the solution to be injected.\n\tNOTE: If the tip of the injection needle is too small, air bubbles should appear at the tip of the metal plunger. Then, make a bigger tip on the injection needle until this does not happen.\nMark the injection needle approximately 0.5 mm away from the tip. This mark is used as an indicator of injection depth.",
    "Insert the tip of the needle into an oocyte along the equatorial boundary by aiming to the center point of the oocyte (underneath the germinal vesicle) while gently holding the opposite side of the oocyte to the injection point with forceps for preventing undesirable oocyte movement during injection.\n\tNOTE: Find the area free of follicle cells (Figure 1B) and insert the needle from that spot since even a fine needle cannot often penetrate a layer of follicle cells.\nEject 4.6 ng/4.6 nl or 9.2 ng/9.2 nl of antisense oligos, or an appropriate volume of mRNA (250 pg to 13.8 ng) by using the foot switch. Details of antisense oligo preparation are described in 7.\nTransfer the injected oocytes into a 6 cm Petri dish filled with MBS+P.S. supplemented with 0.1% BSA (Oocyte incubation medium; sterilize the solution using a 0.45 μm pore filter).\nIncubate the oocytes at 16 °C or 18 °C for 1-2 days.\n\tNOTE: Injected oocytes can be subjected to in vitro maturation several hours after injection, in which case the injection of 4.6 ng antisense oligos is preferable. A general rule is that the shorter the incubation period is, the better the subsequent embryonic development.\n3. In Vitro Maturation (IVM) of Oocytes\nOn the evening of the oocyte maturation experiment, fetch progesterone stock solution (30 mM in ethanol) from -80 °C freezer and dissolve precipitates at room temperature with occasional vortex.\n\tNOTE: The progesterone stock is normally left at room temperature for 30 min to 1 hr.\nAdd 5 μl of the progesterone stock in 50 ml of MBS+P.S. (Maturation medium; the final concentration of progesterone at 3 μM) and shake on the shaker for 30 min to distribute progesterone in the solution equally.\nPrepare agarose-coated 6 cm dishes for in vitro maturation treatment.",
    "Add 1 g of agarose to 50 ml of 1x MBS without magnesium and calcium.\nDissolve agarose by heating in a microwave.\nPour a small volume of the agarose solution to 6 cm dishes to cover the bottom of dishes.\nWait at least for 30 min until solidification.\n\tNOTE: Agarose coating prevents sticking of oocytes to dishes. Once in vitro matured oocytes are tightly attached to dishes, it is most likely that oocytes will be activated by the stimuli that they receive during the detachment from dishes.\nPour 5-8 ml of Maturation medium to agarose-coated dishes and transfer 200-300 oocytes into each 6 cm dishes.\n\tNOTE: Try to transfer oocytes with a minimal amount of oocyte incubation medium.\nIncubate for 16 hr at 16 °C.\n\tNOTE: For example, start the treatment at 5 pm and finish at 9 am on the next day.\n4. Intracytoplasmic Sperm Injection (ICSI)\nFrozen sperm stock preparation\n\tNOTE: The following sperm preparation should be done before starting the oocyte maturation experiment, and frozen sperm stocks are kept at -80 °C for ICSI.\n\t\nCollect the testes from a male frog by following steps 1.4 to 1.11, except for pulling fat and testes out from the incisions using forceps and removing testes from the fat.\nWash testes in 1x Marc’s Modified Ringers (MMR, 100 mM NaCl, 2 mM KCl, 1 mM MgSO4, 2 mM CaCl2, 5 mM HEPES, pH 7.4).\nRemove fat and blood vessels by rolling the washed testes on a clean tissue paper and then by removing remaining blood vessels using forceps.\nPlace each testis in a 3.5 cm Petri dish containing 1 ml of 1x MMR.\nCut longitudinally with fine scissors, and tear into small pieces with forceps until no big pieces remain.",
    "Pipette up and down using 1 ml plastic tip whose end is cut, and load 1 ml of the crushed testis solution into a glass homogenizer.\nHomogenize them by 2-3 strokes and then pour the solution onto a 50 μm pore filter attached to the top of a 15 ml centrifuge tube. Allow the solution to go through the filter.\nRepeat step 4.1.7 by resuspending the remaining cut testis in 1 ml of 1x MMR. Finally, wash the homogenizer a couple of times with 1x MMR and pass it through the filter.\nRepeat steps 4.1.5 to 4.1.8 for the other testis and pool two testes into one 15 ml centrifuge tube.\nSpin the cells at 800 x g at 4 °C for 20 min.\nDiscard the supernatant and resuspend the pelleted cells in 2 ml of 1x MMR. Then, transfer into a new tube.\n\t\tNOTE: Make sure that no visible blood cells are present.\nPrepare a step gradient in a 14 ml ultra-clear centrifuge tube. Bottom layer: 4 ml of 30% iodixanol. Second bottom layer: 1 ml of 20% iodixanol. Third bottom layer: 5 ml of 12% iodixanol. Top layer: testis cells in 2 ml of 1x MMR. Overlay the gradients very gently with a 1 ml pipette tip (overlay slowly not to disturb the bottom phase).\n\t\tNOTE: Just one layer of 30% iodixanol should also work for isolating sperm only.\nSpin in the SW40 rotor using ultracentrifuge at 10,000 x g at 4 °C for 15 min (deceleration without a break).\nGently remove the tube from the ultracentrifuge. Confirm an interface between each layer of the gradient and the pellet at the bottom.\nCollect the sperm fraction from the pellet.",
    "Resuspend the sperm pellet in 1x MMR for washing out iodixanol. Spin at 800 x g at 4 °C for 20 min.\n\t\tNOTE: If a lot of sperm still remain in the suspension after the spin, re-spin the supernatant at 3,220 x g at 4 °C for 20 min and pool the pelleted sperm.\nDiscard the supernatant and resuspend the sperm pellet in 1 ml of 1x Nuclear Preparation Buffer (NPB; 250 mM Sucrose, 0.5 mM Spermidine trihydrochloride, 0.2 mM Spermine tetrahydrochloride, 1 mM EDTA, 15 mM HEPES, pH 7.7)13. Then, transfer to an Eppendorf tube.\nAdd 50 μl of 10 mg/ml Digitonin solution in 1x NPB (Resuspend Digitonin powder in DMSO at 50 mg/ml and freeze aliquots at -80 °C. Before use, dilute the 50 mg/ml aliquot to 10 mg/ml with 1x NPB. Unused 10 mg/ml Digitonin can be frozen and stored at -20 °C and re-used) to 1 ml of the sperm solution.\nIncubate for 5 min at room temperature.\nCheck a permeabilization rate by DAPI staining (0.3 µg/ml DAPI as a final concentration). If less than 95% of cells are permeabilized, incubate a bit longer.\n\t\tNOTE: Sometimes if too many sperm cells are incubated at the same time (especially when sperm are collected from multiple testes), it is difficult to permeabilize, in which case it may be necessary to add an additional small amount of Digitonin; for example if 20% of sperm are not permeabilized, an additional 20 μl of Digitonin is added.\nStop permeabilization by adding 10% BSA to 3% final concentration.\nSpin the cells at 4 °C.\n\t\tNOTE: Try as little centrifugation speed as possible by starting with 100 x g for 5 min. If not sufficient, increase the speed and/or time.",
    "Wash the cells with 0.3% BSA in 1x NPB and centrifuge at the same speed as step 4.1.22. Meantime, prepare the Sperm Storage Buffer (SSB; 2 ml of 2x NPB, 120 μl of 10% BSA, 1.2 ml autoclaved Glycerol, 680 μl of H2O).\nAdd 500 μl of SSB to the sperm pellet. Pipette several times up and down to resuspend with a cut tip in order not to damage the cells.\nAllow to equilibrate overnight at 4 °C.\nPipette the cells up and down several times with a cut tip.\nDilute a couple of microliters 10 times in 1x MMR or in 1x PBS to count the cells using hemocytometer.\nFreeze as aliquots at 30,000 sperm/μl (or higher) directly at -80 °C and store at -80 °C in a single use aliquots.\nICSI to in vitro matured oocytes\n\tNOTE: All processes involving oocytes should be done at 16-18 °C.\n\t\nPrepare a glass pipette for transferring matured oocytes.\n\t\tNOTE: The glass pipette has to be wide enough to accommodate oocytes without squeezing.\nSixteen hours after moving oocytes to the progesterone-containing medium, transfer matured oocytes into a 6 cm agarose-coated dish filled with MBS+P.S. for washing.\n\t\tNOTE: Importantly, matured oocytes have to be treated extremely carefully. Rough treatment of oocytes may induce spontaneous activation before sperm injection.\nCount matured oocytes by confirming the appearance of white spots, which implies the germinal vesicle breakdown (Figure 2). If the maturation rate is less than 80%, it is unlikely to obtain the enough number of surviving embryos for further analyses.\n\t\tNOTE: Remaining follicle cells are peeled off after oocyte maturation (Figure 2).",
    "Transfer oocytes from MBS washing to a new agarose-coated 6 cm dish filled with injection medium (Prepare 500 ml: 30 g of Ficoll (6%), 20 ml of 10x MMR and 500 μl of 1,000x P.S. stock).\nIncubate at least for 30 min before starting ICSI.\nSet up the microinjector as described in steps 2.2-2.4.\n\t\tNOTE: The tip size of the injection needle is kept as small as possible by following the procedure described in step 2.6. The diameter of the needle is 20-40 μm. To bevel the needle tip as described in step 2.4 might allow efficient injection.\nFetch the sperm aliquot and dilute the sperm suspension in Sperm Dilution Buffer (SDB; 250 mM Sucrose, 75 mM KCl, 0.5 mM Spermidine, 0.2 mM Spermine, 200 μM HEPES pH 7.5).\n\t\tNOTE: Dilution can be varied depending on a needle size and so on. Dilute 120 times of the 30,000 sperm/μl stock as an initial try and adjust further if needed.\nPlace a small strip of Parafilm on the stage of a dissecting microscope. Mix sperm injection solution by pipetting and dispense a few μl drop of the sperm solution.\nSuck the diluted sperm suspension into the needle, inject 4.6 nl into 10 successive drops containing 0.3 µg/ml DAPI on a microscope slide, and quickly count the number of sperm delivered per injection on a fluorescent microscope.\n\t\tNOTE: Aim 1-2 sperm per injection. If necessary, dilute the sperm injection solution more and check the number of sperm per injection again until achieving a desired concentration.\nEject the test injection solution and fill a new sperm injection solution with a proper concentration.\nInject 4.6 nl of sperm solution to 100 matured oocytes.",
    "NOTE: It is important to continuously inject the solution. First determine the time required for ejecting 4.6 nl (normally 1-2 sec). Repeat the following process; inject in an oocyte, wait for a few seconds, remove a needle and mock-injection in injection solution, wait for a few seconds, inject in an oocyte. This continuous injection also prevents blocking of the needle tip. Alternatively, the method using a pump might be used13.\nAfter approximately 100 injections, eject the remaining sperm solution and re-fill the sperm solution (use the same sperm solution, but pipette up and down before dispensing).\n\t\tNOTE: If the needle does not suck sperm solution well, cut the tip of the needle. If this does not improve the situation, prepare a new needle.\nRepeat the injection process until all oocytes are injected.\n\t\tNOTE: If the oocyte quality is good and the injection is successful, contraction of injected oocytes is seen within 20 min of the injection time.\nMove the injected dishes to 16 °C or 18 °C incubator.\n4-5 hr after the injection, check the cleavage rate of ICSI embryos.\n\t\tNOTE: Cleavage furrows of those embryos may not be as clear as those of normal fertilized embryos. Some embryos also show abnormal cleavages, which might be caused by multiple sperm injection.\nTransfer cleaved embryos including abnormally cleaved embryos to incubation medium (Prepare 500 ml: 20 g of Ficoll (4%), 5 ml of 10x MMR and 500 μl of 1,000x P.S. stock).\nIncubate embryos either in 16 °C or 18 °C incubator overnight.\nNext morning, transfer embryos to 0.1x MMR and count surviving embryos.\nOn average, approximately 10% of sperm-injected oocytes can develop to the swimming tadpole stage (Figure 3A)."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}