{
  "id": 7376,
  "origin_website": "Bio",
  "title": "A High-throughput Pipeline to Determine DNA and Nucleosome Conformations  by AFM Imaging",
  "procedures": [
    "Surface deposition of the sampleNote: Contamination can affect the quality of the imaging surface and thus imaging quality in general. It is therefore important that all instruments are kept clean throughout the process. Clean the workbench with ethanol and kimwipes thoroughly. Flush the tip of the self-closing tweezers with ethanol and blow-dry the tweezers with N2 gas. Place the tweezers on a kimwipe such that the tip does not get contaminated and does not touch the bench (Figure 1A).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4180/bioprotoc-11-19-4180-g001.jpgFigure 1. Surface deposition steps. A. Overview of materials required for the surface deposition of the sample as described in Materials and Reagents. B. A mica disc is placed under marking tape. C. Tearing off the tape removes a layer of the mica plate and leaves behind a flat and clean surface for the subsequent sample deposition. D. Poly-L-lysine and sample solutions are pipetted on the center of the mica plate and incubated for 30 s each, with washing and drying steps E and F directly after each incubation. E. After 30 s of incubation, the surface is rinsed by gently dropping 50/20 ml Milli-Q H2O of the syringes on the surface and letting it flow off by rotating the mica plate. F. After rinsing, the surface is dried by perpendicularly pointing a nozzle with a gentle stream of N2 gas onto the surface.Place two stripes of the marking tape next to each other on the bench with a small overlap (Figure 1A) such that they are wide enough to completely cover the mica disc. Tear off part of the marking tape and put the mica disc underneath. Apply pressure such that the tape fully attaches to the surface of the mica (Figure 1B). Tear off the tape with a quick movement to cleave the mica (Figure 1C).",
    "It is important that a full layer of the mica is removed. If only part of a layer was removed or if there are small cracks on the remaining surface, repeat this step until a whole layer is removed. Store the cleaved mica disc in a Petri dish while preparing the next steps.Remove two sterile syringes from their packing and remove the plunger. Make sure that the front of the plunger and the syringe barrel do not make contact anywhere to avoid contamination. Seal the syringe barrels with the clean side of parafilm and fill with Milli-Q water. Place the plunger back in the barrel and press down the plunger such that the parafilm tears and water flows out of the syringes. Remove the parafilm and adjust the plunger such that one syringe holds 50 ml and the other syringe holds 20 ml of Milli-Q water. Filling the syringes directly from the storage bottle from the back, as opposed to drawing up fluid with the plunger, helps to avoid contaminations.Prepare a 20 µl aliquot of the 0.01% poly-L-lysine (see Materials and Reagents), shortly vortex it, and briefly spin down the content of the Eppendorf tube in a centrifuge (~2 s at 700 rcf). Keep the aliquot on ice.Pipette the 20 µl poly-L-lysine solution onto the center of the freshly cleaved mica (step 2) and incubate for 30 s (Figure 1D). Make sure not to touch the surface with the pipette. During the 30 s incubation, pick up the mica plate with the self-closing tweezers and pick up the 50 ml syringe and move to a sink or a waste container to be able to start flushing after exactly 30 s.",
    "It is important to keep the mica surface horizontal and as still as possible during the movements to ensure a high quality of the surface deposition. Flush the surface by dropping droplets from the syringe on the edge of the mica plate (not in the center where the poly-L-lysine was placed) and periodically tilting the mica plate such that the water flows off (Figure 1E). After flushing with 50 ml, make sure to leave some water on the surface to avoid unintentional drying.With the surface still covered in water, start drying the mica surface with a gentle stream of N2 gas by quickly tilting the mica surface to a vertical position and targeting the center of the mica with the stream perpendicularly, at about 2 cm distance (Figure 1F). Once the center of the surface is dry, move the stream to the edges until the mica is completely dry.Dilute the sample solution with buffer (in our case, 200 mM NaCl + 10 mM Tris) to achieve the desired concentration for surface deposition and incubate on ice for 60 s. Nucleosome samples and buffer are stored at 4°C and put on ice before starting the surface deposition. A total volume of at least 25 µl is required for surface deposition. We typically dilute 1 µl nucleosome/DNA sample solution (containing roughly 30 ng/µl 486 bp DNA and 10 ng/µl histones, corresponding to ~120 nM nucleosomes; prepared as described in         Krietenstein et al., 2012) with 40 µl buffer solution resulted in a good surface density for AFM imaging (i.e., dense enough to have many molecules in one field of view but not too dense to have too many molecules overlap with each other).",
    "After 60 s of incubation on ice, pipette 25 µl of the buffered sample solution on the center of the poly-L-lysine coated mica plate and incubate for 30 s. Again, proceed as in steps 5 and 6, rinsing – this time with a 20 ml volume of Milli-Q water – and subsequently drying the surface.Store the mica disc in the Petri dish at room temperature until starting the AFM measurement. The AFM surface should always be prepared on the measurement day.AFM imaging of nucleosomes and DNANote: The imaging is performed on a Nanowizard Ultraspeed 2 system, and the steps presented here will slightly vary for other instruments. The steps to start the measurement are only briefly described since they can be found in the user manual of the respective AFM system in detail. The focus of this section lies on tips and tricks on how to tune AFM imaging and what to look out for to achieve the highest image quality for large datasets of DNA and nucleosomes. To prepare the final imaging surface, place three double-sided adhesive discs on a glass slide while leaving an area in the center free (Figure 2A). Place the sample mica plate on the adhesive region such that the central area of the mica aligns with the adhesive-free region of the glass slide and apply gentle pressure on the mica above the three adhesive discs, i.e., not in the center where the sample was placed, with the tweezers to fixate the mica more strongly.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4180/bioprotoc-11-19-4180-g002.jpgFigure 2. Mounting the sample in the AFM. A. The mica plate with the deposited sample is fixated on a glass slide with three double-sided adhesive discs. The glass side is then placed on the AFM stage. B.",
    "The AFM cantilever is mounted onto the glass block that was delivered with the AFM system (Ultra-Speed Glassblock, JPK, catalog number: 22229-E-01). C. Subsequently, the glass block is placed in the designated spot at the bottom of the AFM scanner head. D. To finalize the setup, the scanner head is placed on the AFM stage.Install the glass slide with the mica plate on the sample holder of the AFM (Figure 2A).Place the cantilever in the cantilever holder glass block (Figure 2B) and mount the glass block in the AFM scanner head (Figure 2C). Afterwards, place the AFM head on the stage (Figure 2D).Start the JPK SPM Desktop software and select AC Mode Fast Imaging (Figure 3A).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4180/bioprotoc-11-19-4180-g003.jpgFigure 3. AFM software and settings for imaging. A. The JPK SPM Desktop (7.0.128) software has several imaging modes available. The desired mode for this experiment is AC Mode Fast Imaging. B. Via an optical microscope, a view of the AFM cantilever allows to place the cantilever centrally within the scanner head (green cross). C. Laser alignment onto the tip of the cantilever to maximize the amount of signal reflected towards the detector. D. Alignment of the detector such that the maximum of the signal is in the center of the quadrant detector. E. Cantilever calibration based on the thermal noise spectrum yields an estimated spring constant of 19.7 N/m. F. AC Feedback Mode Wizard to select the drive frequency and the drive amplitude of the AFM cantilever. G. Typical imaging settings used for our DNA and nucleosome images. H. System status after successful approach of the cantilever towards the surface. I. Scanning of the first lines of a 6 µm × 6 µm field of view displaying both image trace (left) and retrace (right).",
    "Go to the “Setup Experiment” tab and focus the green crosshair on the AFM cantilever tip as seen in the camera view (Figure 3B).Align the laser on the cantilever tip using the screws indicated by the green arrows in Figure 3C to maximize the signal that is collected by the detector. The sum of the collected signal is represented by the blue bar (Figure 3C). For FASTSCAN-A cantilevers, a sum signal between 1.3 and 1.5 is typical. Other cantilevers yield different sum signals based on the reflection achieved by the back of the cantilever tip.Align the detector such that the maximum of the signal is in the center of the quadrant detector using the screws marked by the green arrows in Figure 3D. In case that proper alignment of the laser is not possible, adjust the mirror that reflects the laser signal towards the detector first (red arrow Figure 3D), and then do alignment fine-tuning with the screws afterwards.To calibrate the cantilever, select the room temperature and press on “calibrate” (Figure 3E). The calibration uses the thermal noise spectrum (Mullin and Hobbs, 2014) of the cantilever and determines the spring constant and the inverse lever sensitivity, which is used to convert the measured cantilever deflection from V to nm. The spring constant should lie within the specifications of the cantilevers used (for FASTSCAN-A cantilevers typically between 17-19 N/m but may vary for different batches).Go to the “Acquire data” tab and scan the cantilever for its resonance frequency in the AC Feedback Mode Wizard (Figure 3F). For FASTSCAN-A cantilevers, it should be around 1.2-1.4 MHz. Select the driving frequency for the measurement by placing the horizontal dashed line (Figure 3F) slightly left of the peak.",
    "Place the horizontal dashed line accordingly to reach a setpoint of 85-90% at a target amplitude of 12 nm.Start approaching the surface by pressing the “Approach” button (Figure 3G). It is recommended to coarse approach the surface with the head internal Z scanner as it covers a larger Z range and switch to the smaller but faster “Fast HG” scanner before starting to scan (this can be done in the Z Scanner Selection menu). Our typical imaging parameters are shown under Force Control and Scan Control (Figure 3G). After the approach succeeded, the z-position and the Laser Align should be in green color (Figure 3H).Once approached to the surface, verify the resonance peak again in the AC Feedback Mode Wizard window, as the cantilever resonance can change under the influence of a nearby surface.Start imaging (Figure 3I).Notes: Choose image size, scan speed, and pixels once and keep the settings constant. In our experience, the best results were obtained at a resolution of 1.46 nm/pixel either scanning 2,048 × 2,048 pixels in a 3 µm × 3 µm field of view or scanning 4,096 × 4,096 pixels in a 6 µm × 6 µm field of view. Scanning is then performed at 3 or 1.5 lines per second, respectively. The image size represents a compromise between the number of molecules imaged and the imaging time required. The field of view should not be smaller than 3 µm × 3 µm since it is important to have enough molecules (>100 DNA and nucleosomes) for good statistics in the subsequent analysis. Conversely, when scanning even larger areas (e.g., 12 µm × 12 µm), the time required for recording one image at scanning speeds low enough to enable excellent resolution starts to exceed 1 h, such that cantilever wear and drift become problematic.",
    "In addition, very large images are computationally cumbersome to process. Scanning speed matters! When scanning too fast, the molecules will appear less “sharp” and thus image quality will overall be worse. However, scanning too slowly will increase the effect of drift on the image. The scanning speed chosen should thus be as high as possible while maintaining the sharp imaging of molecules. For this purpose, we usually measure the diameter of DNA on the surface as it appears in the AFM image. Due to tip convolution, the DNA does not have a visible diameter of 2 nm, as expected from its crystal structure. A 6-8 nm DNA apparent full width at half maximum is a good value to target for ongoing AFM imaging making sure that the molecular resolution is high enough for quantitative assessment of the structural parameters. Sometimes, achieving a stable 6-8 nm DNA diameter can be difficult and requires tuning of the imaging parameters (i.e., adapting the drive frequency, the drive amplitude, the setpoint, and feedback gain) or exchanging the cantilever.  For the large images with hundreds of molecules imaged here, nonlinear behavior and hysteresis of the piezos can cause artifacts and distortions that affect the structural parameters of DNA and nucleosomes. As an example, when imaging 3 µm × 3 µm images on a MultiMode8 AFM (Bruker), DNA molecules appear shorter in the beginning (bottom) of the scan than at the end (top of the image, Figure 4A). This shortening effect is strongest for the first scans but still occurs at reduced intensity in subsequent scans. In contrast, scanning even larger 6 µm × 6 µm images on the Nanowizard Ultraspeed 2 does not show these nonlinear effects (Figure 4B).",
    "Typically, while continuously imaging, these nonlinear effects and drift tend to decrease over time once the system stabilizes after warming up.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4180/bioprotoc-11-19-4180-g004.jpgFigure 4. DNA length as a quality control parameter to detect AFM scanning artifacts. A. Example DNA strand at the bottom of an AFM image acquired on a MultiMode 8 AFM system. B. Example DNA strand at the top of an AFM image acquired on a MultiMode 8 AFM system. The traced DNA contour is indicated by the yellow line in A and B. C. AFM image with a field of view of 3 µm × 3 µm imaged at 2,048 × 2,048 pixels acquired on a MultiMode 8 AFM system. The DNA molecules shown in detail in panels A and B are indicated by the boxes in the image. D. Distribution of DNA lengths measured at different y-positions (bottom to top) from a total of 10 AFM images on a MultiMode 8 AFM equipped with a tube scanner. Nonlinear effects in the AFM system, likely piezo creep, cause the DNA strands in the bottom of the image to appear to have different lengths than the DNA strands elsewhere in the image. E. Distribution of DNA lengths measured at different y-positions (bottom to top) for the JPK Nanowizard Ultraspeed 2. For this instrument, the drift effects due to piezo creep are significantly reduced, likely due to its linearized scanner design. All AFM cantilevers are different, and important properties such as tip radius, resonance frequency, and spring constant can vary significantly between batches. Even cantilevers that are within the specifications of the respective model can show significant variations in obtainable image quality. On the Nanowizard Ultraspeed 2 AFM setup, we had the best imaging results with FASTSCAN-A cantilevers (Bruker).",
    "On a MultiMode 8 AFM system that was used in the past, we had the best imaging results using AC160TS cantilevers (Olympus). However, due to the lower resonance frequency of the AC160TS cantilevers compared to FASTSCAN-A cantilevers and due to the smaller maximum image size of the MultiMode 8 (20482 pixels), both the scanning speed (1 Hz) and the field of view (3 µm × 3 µm to keep the pixel size constant) are generally smaller and make the system more prone to drift and limited statistics when analyzing the image. Still, it was possible to take data sets of similar quality – despite the imaging taking longer on the MultiMode 8 – on both instruments.  AFM image analysis Note: We have developed an analysis pipeline written in Python to analyze the AFM images, which has been described in detail previously (Konrad et al., 2021). A detailed guide on how to set up the Python analysis pipeline can be found via https://github.com/SKonrad-Science/AFM_nucleoprotein_readout[href=https://github.com/SKonrad-Science/AFM_nucleoprotein_readout]. Therefore, the image analysis pipeline is described only briefly here, and the focus will lie on tips and tricks on how to test image quality from the structural parameters obtained from the image readout. In addition, we discuss possible further analyses to obtain additional parameters such as DNA persistence length and states of nucleosome wrapping. To preprocess the raw AFM images, apply either a plane fit or an average profile fit to the surface and subsequently apply a line-wise leveling to remove observable steps between subsequent scan lines due to noise in the scanner system. The plane correction can be performed using either the image analysis software supplied by the AFM manufacturer (JPK Data Processing from JPK in our case, Figure 5A-C) or using the commercially available software SPIP (Image Metrology, Figure 5D-E).",
    "Save the leveled AFM image as an ASCII file for further processing.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4180/bioprotoc-11-19-4180-g005.jpgFigure 5. Plane correction of the raw AFM image. A. Raw AFM image displayed in the JPK Data Processing software (version 7.0.128). B. AFM image after applying a plane fit of first order. C. AFM image after consecutively applying line leveling. D. Plane correction parameters best used when plane correcting the raw AFM image using SPIP (Parameters: Mode, Custom; Global Correction, Average Profile Fit; Estimation Volume, Entire Image; Line-wise Correction, Histogram Alignment; and Z Offset Method, Set Mean to Zero). E. The same raw image as shown in panel A (left) and after applying the plane correction in SPIP (right).Open the custom Python code as described in the installation guide (Konrad et al., 2021) and select the desired analysis parameters. See Figure 6A for example analysis parameters used for analyzing the DNA and nucleosomes in our images. Depending on the background noise level, parameter tuning might be needed to maximize molecule detection. If the value of the background threshold chosen is too small, the molecules cannot be separated properly from the background, and if the value chosen is too high, the molecules might become fractured. Still, thresholding does not affect the final nucleosome parameters such as volume, opening angle, or height.Run the code and select the image you want to analyze from the file dialogue (Figure 6B). DNA and nucleosomes are then detected, and their structural parameters are analyzed automatically (Figure 6C). The results are saved to an Excel worksheet. As described in the user manual, you can also choose to manually help to categorize molecules that cannot be categorized automatically (such as two slightly overlapping DNA strands) by setting the manual filtering parameter (Figure 6A) to True.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4180/bioprotoc-11-19-4180-g006.jpgFigure 6. Image analysis post-processing software. A.",
    "Example input parameter settings for automated readout of the AFM images. B. File dialogue to select the desired AFM image for automated readout. C. Output of the analysis software during processing. The number of molecules detected in one example AFM image.Repeat the image analysis for all images of the data set to have all DNA and nucleosomes of the imaging run analyzed.The structural parameters stored in the Excel worksheet can be used to gain a broad understanding of the DNA and nucleosomes in the images and serve as an input for further analysis, for example, by principal component analyses or clustering. For an example, data set of wild-type nucleosomes reconstituted on a DNA segment of 486 bp, possible further analysis and plots are shown in Figure 7A-7G.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4180/bioprotoc-11-19-4180-g007.jpgFigure 7. Example analysis of DNA and nucleosome conformations for a dataset obtained with the protocol presented here. A. Distribution of bare DNA lengths. The solid line is a Gaussian fit centered at 151 ± 3 nm (mean ± STD). B. The DNA length is determined by tracing its contour with segments of 5 nm length, and the relative orientation of consecutive segments yields DNA bend angles. The solid line is a fit with a folded Gaussian, as described previously (van             Noort et al., 1999), to obtain the DNA persistence length (lp = 52.7 nm). C. Distribution of DNA length wrapped around nucleosomes. The solid line is a double Gaussian fit to the data. The peaks are centered at 120 ± 14 bp and 168 ± 12 bp (mean ± STD). D. Distribution of nucleosome opening angles. E. Example image and tracing of a fully wrapped nucleosome. F. Example of an analyzed partially unwrapped nucleosome. G. 2D kernel density profile (bandwidth = 2.5°, 2.5 bp) of nucleosome opening angles and wrapped lengths.",
    "The cartoons in the insets depict the qualitative shape of fully and partially wrapped nucleosomes.Notes: We typically deposit both bare DNA and nucleosomes on each surface for imaging since the average length of the bare DNA is used to estimate the amount of wrapped DNA of a nucleosome by subtracting the length of the two arms from the average bare DNA length. Using the DNA length determined from co-deposited molecules is more accurate than using an average DNA length from separate imaging runs since even if the tip geometry does not change while measuring, the bare DNA length might differ slightly between images due to changes in drift.  Looking at the average values of structural parameters such as the average length of bare DNA and the average nucleosome volume provides insights into the change in data quality for a specific dataset. As a rule of thumb, for a well-imaged high-quality dataset, the average bare DNA length should not differ by more than 2 nm over multiple images. Similarly, constant average nucleosome volume (exhibiting no more than 5-10% difference for images of the same dataset) is a good measure for image quality, and an increase or, in general, variation of nucleosome volume during a measurement run indicates changes in the tip geometry and will affect the structural parameters in general (Figure 8).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4180/bioprotoc-11-19-4180-g008.jpgFigure 8. DNA length and nucleosome volume as quality control parameters for AFM imaging. A. Average DNA length in subsequent images (mean and standard deviation over ~200 DNA strands per image). B. Average nucleosome volumes in subsequent images (mean over ~400 nucleosomes per image). Shown are two data sets obtained on a Nanowizard Ultraspeed 2, each comprising multiple 6 × 6 µm2 images. All images in one data set were obtained using the same AFM tip.",
    "Data set 1 consists of 7 AFM images, and data set 2 consists of 9 AFM images that were analyzed with respect to DNA and nucleosome structural parameters such as DNA length and nucleosome volume. For data set 1, the system stabilized during the first three images as indicated by almost constant DNA lengths and nucleosome volumes after image 3. In contrast, in data set 2, the volume parameter still shows fluctuations after several hours of imaging (~45 min per image), indicating that the system is less stable. Overall, in data set 2, the DNA lengths and the volumes are larger than for data set 1, indicating that the AFM cantilever has a less sharp tip. A detailed description of how to extract 5 bp unwrapping populations from the data obtained using this protocol can be found in our previous publication (Konrad et al., 2021).  Typically, datasets of ~1,000 nucleosomes or more are required to allow for a detailed analysis of the unwrapping landscape. Additional parameters that are stored in the output Excel sheet, such as radius of gyration, end-to-end distance, or length of the individual nucleosome arms, allow for many different analyses. As an example, the 2D distribution of arm lengths and opening angles can be used to test for anti-cooperative unwrapping, or the ratio of arm lengths can be used to assess nucleosome positioning along the DNA strand."
  ],
  "subjectAreas": [
    "Biophysics",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}