{
  "id": 17278,
  "origin_website": "Jove",
  "title": "Using Hyperbaric Oxygen to Improve the Radiosensitivity of Human U251 Glioma Cells",
  "procedures": [
    "All study methods were approved by the Institutional Review Board and Ethics Committee of the Second Hospital Affiliated with Lanzhou University and were performed in accordance with relevant guidelines and regulations.\n1. Treatment of glioma cells\nNOTE: The U251 glioma cell line was used in this experiment.\nU251 cell culture\n\t\nSeed U251 cells in multiple dishes with DMEM containing 10% fetal bovine serum (FBS) and culture them at 37 °C with 5% CO2.\nUpon reaching 50%-60% confluency, dissociate the cells using trypsin-EDTA solution (0.25%, without phenol red) and then allow them to grow to 80% confluency.\nX-ray irradiation\n\t\nCover the culture plates or flasks with an equivalent tissue compensator of up to 1 cm thickness. Then, expose the cells to X-ray irradiation delivered from a 6 MV linear accelerator with a source-cell distance of 100 cm, adjusted by clicking the rotate button on the remote control board.\nHave a physicist measure the radiation dose and correct for attenuation. As a control, place flasks containing media in a detector before the X-ray irradiation.\nHyperbaric oxygen (HBO)\n\t\nDisinfect the HBO chamber by turning on the ultraviolet light for 15 min and then flood it with 0.02 MPa of pure oxygen for 5 min.\nAfter placing the cells in plates or culture flasks in the chamber, click on the pressure regulator button on the control board outside the chamber to increase the HBO pressure in the chamber to 0.2 MPa (2.0 ATA) within 30 min of irradiation.\nThirty minutes later, click on the pressure regulator button to decrease the HBO pressure to the previous pressure level (0.1 MPpa). Then, treat the culture bottles or plates with HBO 1x per day for 3 consecutive days.\n2. U251 glioma cells in different groups",
    "Set a control group, X-ray (2 Gy) group, and HBO combined with X-ray (2 Gy) group for calculating the cell growth curves.\nPrepare single-cell suspensions from the glioma U251 cells showing the maximum growth rates (see step 1.1.2). Adjust the cell density to 1 × 106/mL by counting the cells using a hemocytometer slide. Subsequently, add 1 mL of the cell suspension to a culture bottle (cell density: 1 × 106/bottle) with three separate bottles for each group.\nAssess cell morphology at 100x magnification with a brightfield microscope to enumerate the adherent cells at 24 h, 48 h, and 72 h of culture.\n3. Radiosensitivity of U251 glioma cells (clone formation assay) within 30 min after HBO\nSeed the U251 single-cell suspension throughout the wells at 5 × 102 cells/mL in 6-well plates and then expose them to the indicated dose of X-ray irradiation (0 Gy, 2 Gy, 4 Gy, 6 Gy, and 8 Gy), with three parallel samples being examined for each X-ray dose.\nFor the HBO combined with X-ray (2 Gy) group, expose the cells to X-ray irradiation within 30 min of HBO treatment. After treatment, culture the cells at 37 °C with 5% CO2 for 14 days.\nAfter the clones are visible, remove the medium and wash the clones 2x with PBS.\nFix the cells in 1 mL of 10% methanol for 15 min before staining with 1 mL of 0.1% crystal violet for 20 min.\nAfter staining, wash the cells with 6 mL of distilled water using a pipette, and then aspirate the crystal violet solution. Allow the cells to air dry.\nCount the clones with a diameter between 0.3 mm and 1.0 mm under a microscope to ensure that there are >50 cells per clone.\nCalculate the survival fraction (SF) using equation (1):",
    "SF = imgsrc://cloudfront.jove.com/files/ftp_upload/62769/62769eq01.jpg × 100%    (1)\nUsing statistical software, generate a radiation dose-survival curve based on the single-hit multitarget (SHMT) model using equation (2):\n\tS = 1 - (1 - imgsrc://cloudfront.jove.com/files/ftp_upload/62769/62769eq02.jpg)N    (2)\n\tWhere S = the probability of survival; k = the mean lethal dose (the dose causing a mean of one hit per cell); x = the number of hits per cell; N = the number of targets (the number of hits for cell death).\nCalculate the radiobiological parameters, including the mean lethal dose (D0), quasi-threshold dose (Dq), extrapolation number (N), survival fraction at an irradiation dose of 2 Gy (SF2), sensitization enhancement ratio (D0) (SER = D0 in the control group/D0 in the experimental group), and SER (Dq) (SER = Dq in the control group/Dq in the experimental group) to evaluate the effect of HBO on the radiosensitivity of U251 glioma cells.\n\tWhere D0 = the reciprocal value of the slope of the linear portion of the survival curve (the dose reducing the survival rate by 63%)\n\tN = the value of the intersection point formed by extrapolating the linear portion to meet the ordinate (reflecting the cellular ability to repair the radiation-caused damage)\n\tDq = the value of the intersection-projective point on the abscissa and the intersection formed by drawing a line through 1.0 at the ordinate and parallel to the abscissa to meet the extrapolation line.\n4. Cell counting assay to assess U251 glioma cell proliferation\nSet a control group, an HBO group, and groups treated with X-ray (0 Gy, 2 Gy, 4 Gy, 6 Gy, 8 Gy) alone or combined with HBO.\nAdjust the cell density to 1 × 104 cells/mL using U251 cells in single-cell suspensions.",
    "Seed the cell suspensions (100 µL, density: 1 × 103/well) in 96-well plates (five wells per group). Perform the cell counting assay (see the Table of Materials), and then determine the optical density (OD) at 450 nm using a microplate reader after 48 h of culture with the reagent.\nCalculate the cell proliferation inhibition rate (IR) according to equation (3):\n\tIR = imgsrc://cloudfront.jove.com/files/ftp_upload/62769/62769eq03.jpg × 100%    (3)\n5. Detection of apoptosis of U251 glioma cells\nSet control, HBO, X-ray (2 Gy), and HBO combined with X-ray (2 Gy) groups.\nRemove the medium after culture and wash the cells with 1x PBS.\nDetach the cells with trypsin and then deactivate the trypsin by adding DMEM when a rounded cell morphology is observed under a microscope.\nTransfer the cells to a centrifuge tube and centrifuge for 5 min at 200 × g.\nDiscard the supernatant, add 3 mL of 1x PBS to the pellet, and gently pipette to resuspend the cells.\nCentrifuge the cells again at 200 × g for 5 min. Then, aspirate the supernatant PBS and wash the cells 2x before resuspending them with gentle pipetting in 50 µL of Binding Buffer.\nAdd 5 µL of annexin V-FITC to the cells at 4 °C and incubate the cells in the dark at 4 °C for 15 min before adding 400 µL of Binding Buffer. Transfer the mixture to a flow cytometry tube containing 5 µL of propidium iodide (PI) Dye Solution (10 mg/mL). Detect apoptotic cells 5 min later by flow cytometry11.\nRecord red fluorescence at the 488 nm excitation wave, input them into a computer to analyze the percentage of each cell cycle in 5,000 cells, and then print the peaks of apoptotic cells.",
    "Collect red and green fluorescence by annexin V and PI double-labeling, input them into the computer to analyze, and then print the dot plot.\n6. Detection of U251 glioma cell cycle distribution\nWash the above-mentioned cells 2x with 1 mL of PBS before treating them with trypsin.\nWhen a rounded cell morphology is detected by light microscopy, add DMEM containing 10% FBS.\nCentrifuge the cells for 5 min at 200 × g at room temperature.\nRemove the supernatant and resuspend these cells in 1 mL of PBS before adding precooled 75% ethanol solution.\nIncubate the mixture for at least 4 h or overnight at −20 °C.\nWash the cells 2x with ice-cold PBS and 180 µL of EDTA (0.1 mM, 3.7 mg of EDTA + 100 mL of PBS), 20 µL of RNase A (10 mg/mL), 35 µL of Triton X-100 (2%, 2 mL of Triton + 98 mL of FBS),and 96.5 µL of PBS. Then, add 17.5 µL of PI solution (1 mg/mL).\nIncubate the mixture at 4 °C in the dark for 10 min.\nWash the cells in 200 µL of PBS, and then place them in a flow cytometer to assess the cell cycle distribution, as previously described12.\nOperate the flow cytometer in dual-laser, three-dimensional space, excitation mode with a 22 µm x 66 µm and 13 µm x 66 µm spot size. Use a flow room of 430 µm x 180 µm, 300-1,100 nm spectrum, ≤100 MESF detectability, and CV <2% resolution. Then, expose the cells to 488 nm excitation light and detect and measure the fluorescence signals with instrument software to determine the cell cycle distribution13.\nDetermine the DNA content, and then according to the DNA content, analyze the cell cycle.\n7. Statistical analysis\nPerform statistical analyses.\nPresent the data as mean ± standard deviation.",
    "Use a Student's t-test to compare the groups, with statistical significance set as P < 0.05.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}