{
  "id": 16998,
  "origin_website": "Jove",
  "title": "Concept Development and Use of an Automated Food Intake and Eating Behavior Assessment Method",
  "procedures": [
    "This pilot study was approved by the METC of Wageningen University prior to starting the project.\nCAUTION: All the participants contributing to this project provided an informed consent, including the approval of video images showing visible and recognizable faces.\n1. Sample preparation and participant consent\nPrepare a juice (glass or cup), fruit yoghurt (bowl), and fruit pieces (plate).\n\tNOTE: These foods are selected for demonstration purposes only (Figure 2).\nRecruit a participant or a volunteer who agrees to participate in the study.\nExclude the participants wearing glasses (who cannot use contact lenses) and/or having facial hair (beard or mustache) to avoid measurement errors.\nInform the participants about the study and the data collection (data storage, accessibility). Obtain separate permissions in case of non-anonymous video recordings. Get the signature of the participant on the informed consent before collecting data.\n2. Device and measurement location set-up\nNOTE: This protocol is suited for data collection in a controlled (eating laboratory) setting.\nMake sure that the light in the room is evenly distributed-avoid shadows on participants' faces.\nAvoid the background noise on the video recordings due to the presence of individuals other than the participant.\nSeat the participant on a chair before a table; with tabletop located just below the participant's chest.\nConnect the wireless receiver of the tray and the webcam to a laptop.\nStart up the laptop. Ensure that the laptop has the following specifications: CPU i7-10750H, SSD M.2 512 GB, Memory 1x 16 GB, DDR4 2933 MHz non-ECC-memory, Operating system 64 bit.\nSwitch on the tray and ensure that there is charge in the tray (green light).\nOpen the connector program (dos), the receiver, and the processor software program together with the dashboard, respectively.\nCheck the incoming image quality in the processor program (Figure 3).",
    "NOTE: To detect the eating behavior, the image quality should be within the last quarter of the task bar (green); as close to 100% green as possible. Shadow forming may lead to low image quality.\nMake sure the image frame is correct to prevent poor image quality. Ensure that the participant's head (above the cranium) till chest, including arms and shoulders are clearly visible.\n3. Weighing system and data transport\nValidate the measures prior to the use of the mEETr for the first time.\n\tNOTE: The mEETr device consists of a regular commercially available dining tray (fiber enforced epoxy dinner tray) with three built-in weighing stations (Figure 2).\nTo validate the set-up, ensure that the tray continuously measures the weight of a plate, bowl, and drinking glass.\n\tNOTE: The precision of the weighing scale across the whole range should be 0.3%.\nDo not place too much weight on each weighing platform. The maximum weight for the largest platform (dinner plate) is 1.5 kg. The maximum weight of the two smaller weighing platforms (bowl and glass) is 800 g. The minimum weight that can be accurately measured is 1 g for each weighing station.\nMake sure that the plate, the cup, and the bowl are not resting on the platform or the surrounding tray. Make use of the center ring to avoid this.\n\tNOTE: Each weighing station consists of three triangle positioned force sensors that act together as one scale. A triangle position was chosen to balance weight.\nMake sure to keep the tray dry. The tray includes a 50 mm thin base panel (central circuit board) below the tray that contains the electronics.\nFor data transfer, make sure that the tray connects to a wireless receiver.",
    "NOTE: Transfer the weighing data at a 1 s interval via a short-range radio signal (about 1 m distance). Connect the receiver to a personal computer (PC) via an USB port.\nThe three force sensors measure the forces (or weights), sum them up, and convert them to a calibrated weight value.\nRecharge the tray after each use.\n\tNOTE: The tray is powered by an internal battery pack and can be charged with a USB charger. An on/off slide switch is located near to the USB socket. A full battery charge provides for about 20 h of use.\nDo not clean the tray in a dishwasher; the tray is not dishwasher proof. Clean the tray using a cleaning spray. Ensure that the tray is kept clean and dry. Leak channels along the platforms drain liquid spills.\n4. Participant explanations and start of observation\nPlace the mEETr in front of the participant.\nInstruct the participant to 1) eat as much or as little as he/she wants, 2) look straight into the webcam while eating, and 3) do not put hands in front of the face while eating.\nStart a new observation in the receiver software. Log the date, participant number, participant's gender, age, and anthropometric data, such as weight and height. Include additional information such as the study condition and the study visit in the observation name.\nPress Record in the receiver software to record the observation.\nActivate the dashboard in order to check the video recordings and the incoming data during data collection (Figure 4).\nPrior to the recording, ask the participant to 1) raise the card with the participant number, and 2) raise their hand at the start and end of the meal.",
    "End the observation when the participant finishes eating. It takes 2 min to transfer all the data to a spreadsheet.\nThis is the end of the session for the participant.\nDisconnect the webcam and the tray-receiver from the laptop and clean it with a cleaning tissue or cleaning spray.\n5. Evaluation and transfer of data\nOpen the last observation in the receiver software. Automated measures of eating behavior are stored under the heading Data. Click on Export Data to extract the raw data. The subsequent output file contains data on the participant number, real time, relative (to start) time, and eating behavior variables (number of bites, number of chews, chewing duration) per test participant.\n\tNOTE: All behaviors are time stamped. In the receiver software, additional external data of the tray can be extracted, for example, the data on the weight of each of the three trays. The data is recorded 10 times per second and transferred. The tray data collection time is synchronized with the eating behavior recordings.\nSummarize and visualize the results in different bar charts within the program itself. Export the results as raw data in log files (.xsl) (Figure 5).\nExport the log files to a spreadsheet and perform the data analysis using the statistical program of preference.\nClean the data before data analysis.\n\t​NOTE: Due to the distortions of pressing with cutlery on the plates (causing an increase in weight), weighing data of the tray needs to be cleaned to a Kaplan Meier curve with step size indicating bite size, the step length indicating time between bites. The beginning of the curve indicates start-weight, the last step indicates end-weight) as follows.\n\t\nSmoothen over the timepoints to measurements per second to filter out extreme values.",
    "Set 5 g boundary, detect weight plateaus (i.e., no change within +/- 5 g), and weight changes (changes over time larger than 5 g) to indicate bite sizes and portion changes.\nExclude weight increase due to cutlery remaining on the plate.\n\t\tNOTE: The output is the total weight changes per weight station begin and end of meal (= meal size), average bite size, and bites per min.\nTo determine eating rate (g/sec) and bite size (g/bite) changes over the course of the meal, manually integrate the tray weight data and the eating behavior (Figure 6, Figure 7, Figure 8, Figure 9, Figure 10).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}