{
  "id": 6718,
  "origin_website": "Bio",
  "title": "Studying Protein Aggregation in the Context of Liquid-liquid Phase Separation Using Fluorescence and Atomic Force Microscopy, Fluorescence and Turbidity Assays, and FRAP",
  "procedures": [
    "Note (Introduction to Procedure A): Wild type and single-cysteine mutant proteins were expressed and purified as described in detail previously (Babinchak et al., 2019). In brief, this involves a two-step purification using nickel nitrilotriacetic acid affinity chromatography under denaturing conditions followed by C4 reverse phase HPLC. Purified protein is flash-frozen and lyophilized. Procedure A is designed to pick up after lyophilization and to remove any potential aggregates that may have formed. Procedure A is crucial to ensuring that experiments are formed with highly soluble, non-aggregated protein. In addition to the TDP-43 LCD, this protocol may be used to study other proteins that may phase separate and aggregate; however, users may need to amend Procedures A and D based on the specific purification protocol for their protein of interest. Protein preparationSuspend lyophilized protein in ~200-250 μl of Milli-Q H2O. Briefly vortex.Pass soluble protein solution through 0.5 ml 100 kDa NMWL Amicon® centrifugal filter via centrifugation at > 21,000 x g for 7 min.Collect “flow-through solution” that passes through the filter.Measure “flow-through solution” absorbance at 280 nm (A280) to determine stock molar concentration using appropriate extinction coefficient [17,990 M-1·cm-1 for LCD protein used in Babinchak et al. (2019)] and the Beer-Lambert law.Note (Introduction to Procedure B): Because induction of phase separation results in the scattering of light, the process can be quantified using turbidity measurements. These types of measurements provide a method for comparing a variety of conditions that promote varying degrees of phase separation. For the TDP-43 LCD, LLPS is regulated by both NaCl concentration and pH. Therefore, recipes to prepare solutions with different buffer conditions are provided (see Recipes).",
    "Induction of phase separation and turbidity measurementsCalculations and dilutions from stocks in order to study phase separation by altering pH and NaCl concentration: Using a known protein stock concentration (see Procedure A), calculate the volume of 100 mM buffer (Recipe 1), 5 M NaCl, Milli-Q H2O, and protein stock solution necessary to create a final solution containing 10 mM buffer, the desired salt concentration (0-300 mM NaCl), and the desired protein concentration. To allow for technical replicates, we recommend a total volume of 300 μl that can be evenly distributed into 3 wells of the 96-well plate.Experimental Solutions: Mix by pipetting reagents in the following order, mixing thoroughly at each step: (1) Milli-Q H2O, (2) buffer, (3) additional reagents (e.g., NaCl, polyethylene glycol, 1,6-hexanediol). Protein will be added last and just before taking measurements.Blank Solutions: As in Steps B1-B2, calculate and prepare “blank” solutions using the same conditions but in the absence of protein (which will be replaced by water). Three technical replicates may also be used.Add protein to experimental solutions. Mix thoroughly. Immediately add solutions to 96-well plate and measure absorbance at 600 nm (A600).For experiments at 37 °C, prepare solutions as described in Steps B1-B3. Pre-heat plate reader to 37 °C. Pre-heat all solutions, remaining stocks, and materials (i.e., 96-well plate, pipette tips) using a 37 °C incubator for 15 min to minimize cooling during sample preparation. Once warmed, add protein to reaction buffer and measure A600. To minimize additional cooling effects during sample preparation, incubate the plate (with samples) for 5-10 min in the pre-heated plate reader before measuring A600.Note (Introduction to Procedure C): Thioflavin-T has been used as a fluorescent probe to monitor amyloid formation for a number of proteins as well as to detect amyloids in histopathology samples from patient brains (Nielsen et al.",
    ", 2001). Upon binding to amyloids, the intensity of fluorescence emission increases substantially, allowing for Thioflavin-T to be used to monitor the in vitro polymerization reaction. We found that the molecule itself does not appear to alter conditions under which phase separation is observed and its fluorescence intensity is not greatly altered by the presence of droplets, allowing us to assess amyloid formation within the context of phase separation. We typically monitor polymerization for 48-72 h, though the time to reaction completion is likely to be different for each protein. Thioflavin-T (ThT) measurements to monitor aggregationPre-set plate reader temperature to 25 °C or 37 °C, depending on the temperature at which the user would like to study aggregation. This will be kept constant throughout the entirety of the experiment. Set up experimental parameters for Thioflavin-T aggregation kinetics in Tecan i-control software (Table 1).Prepare solutions as described in Steps B1-B3 with the addition of 15 μM ThT (from 1.5 mM ThT stock; Recipe 2) that is added just before protein. Mix thoroughly.Immediately add solutions to a 96-well plate and cover with advanced polyolefin sealing tape to prevent evaporation during time course of experiment.Initiate protocol to measure fluorescence intensity every 10 min at a constant temperature. Tecan i-control 1.10 (for infinite reader) software will populate in real-time a Microsoft Excel file containing raw fluorescence intensity data as measurements are taken.Table 1. Experimental parameters for Thioflavin-T aggregation kineticsimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200109/20200109054947_0428.jpgNote (Introduction to Procedure D): The use of a fluorescently-labeled molecule is critical to performing fluorescence microscopy. The exact choice of dye (i.e., Alexa FluorTM 488, Alexa FluorTM 594, etc.) is up to the user. Fluorescent labeling of single-cysteine mutant proteinPerform Alexa FluorTM 488 (AF488) labeling using Alexa Fluor 488TM C5 maleimide according to manufacturer’s protocol in the presence of Labeling Buffer (Recipe 3).",
    "Remove excess fluorescent label by passing protein through 7 kDa molecular weight cut-off (MWCO) Zeba spin desalting column (2 ml) equilibrated with Equilibration Buffer (Recipe 4). Follow manufacturer’s protocol guidelines for centrifugation and volumetric parameters.Determine the concentration of AF488-labeled protein by measuring A280 and correcting for contribution of AF488 to absorbance (instructions provided in the manufacturer’s online manuals).Note (Introduction to Procedure E): When performing microscopy imaging of droplets, we recommend the technique of “doping” unlabeled protein with a small amount of fluorescently-labeled protein, which can help to minimize costs by saving labeled protein. Which microscope is used depends on user preference and access provided by the laboratory; however, it is crucial to use a microscope with the capability of exciting and detecting emission of the user’s choice fluorophore (i.e., a GFP filter cube for AF488-labeled protein). Imaging technique: Fluorescence microscopy of dropletsPrepare sample utilizing unlabeled protein from Procedure A and labeled protein from Procedure D with a ratio of 1:200-1:500 AF488-labeled to unlabeled protein. Steps in Procedure B should be used to design conditions. Pre-mix labeled and unlabeled protein before adding to remaining solution components. Mix thoroughly.Add ~15 μl of protein solution to the surface of FluoroDish and cover with coverslip.Image sample on BZ-X710 via bright field and with GFP filter cube. Use of 100x oil immersion objective can provide optimal resolution of droplets with diameters ranging from 1-5 μm on the BZ-X710, though other microscopes may provide adequate imaging at lower magnification. Imaging can be performed at the surface of the dish where droplets will sediment or in the solution above the dish surface. Imaging should not be performed near the edges of the coverslip, as evaporation of solution may cause artifacts.",
    "Droplets may be imaged immediately or over a long duration of time (for example, through use of time-lapse imaging). Typically, droplets will undergo growth, sedimentation, and fusion to eventually reach an equilibrium. Therefore, the timing of imaging should be consistent across conditions if a comparison is being performed.Note (Introduction to Procedure F): Atomic force microscopy can provide more detailed insight into morphological differences between phase-separated and aggregated species. This is most clearly evident when fibrillar species can be identified within or surrounding droplets–a level of detail that is difficult to observe using fluorescence microscopy but is more easily seen with AFM. Importantly, AFM can therefore distinguish between droplets with and without fibrils; however, an inherent shortcoming should be noted wherein the provided protocol images species that are dried on mica. Whether artifacts may be introduced during this drying process is unclear. Therefore, it is helpful to perform both complementary atomic force microscopy and fluorescent microscopy imaging. Additionally, liquid-like character of droplets cannot be assessed by AFM in this manner (see Procedure G for more information on how to do this). Imaging technique: Atomic force microscopy of aggregates and dropletsPrepare fibrils or droplets as described in Procedures A-C.Attach a single mica disc to the surface of an AFM specimen disc using an adhesive tab. Use ScotchTM tape to strip mica surface (adhere tape to the surface of mica and press down firmly. Smoothly remove the tape from the surface of mica). Strip mica until the surface is smooth.Add ~10 μl of sample to mica surface. Cover sample to prevent dust particles from entering. Incubate sample at ambient temperature for 5 min.Rinse mica surface with 100 μl of Milli-Q H2O 4-5 times.Dry mica surface for ~1 min using a gentle stream of nitrogen gas.",
    "Image sample on multimode atomic force microscope using ScanAsyst in Air mode (with SCANASYST-AIR silicon tip on nitride lever).Recommended parameters for imaging: 0.977-1.95 Hz scan rate; 512 samples/line; feedback gain: 5.289; 0.1 V peak force set point; ScanAsyst autocontrol: ON.Note (Introduction to Procedure G): While fluorescence microscopy and AFM imaging can help to distinguish fibrillar from droplet-like species, maturation or aggregation within liquid droplets might occur before fibrils can be observed via imaging. Therefore, fluorescence recovery after photobleaching (FRAP) is ideal for assessing the dynamicity of phase-separated protein during this intermediary time period. This procedure provides a general approach to photobleaching liquid droplets to ascertain their dynamic nature. A number of works have utilized this approach but include slight variations in methodology and analysis. We recommend the following reference for users who might be interested in learning more (Taylor et al., 2019). Fluorescence recovery after photobleaching (FRAP) to monitor droplet maturationTurn on Leica HyVolution SP8 confocal microscope according to manufacturer’s guidelines. Allow 488 nm argon laser to warm up ~30 min.Prepare a sample in a solution condition under which phase separation is observed. Liquid droplets are necessary to perform a FRAP experiment. Add sample to FluoroDish as described in Steps E1-E2.Initial sample imaging and post-bleach frames should be collected using a laser intensity that does not bleach the sample. The absence of bleaching can be ascertained by recording 3-5 pre-bleach frames at the beginning of each FRAP experiment.Identify droplets that sediment on the bottom of the microscope dish as these will move minimally and allow for ease in data analysis.Using a consistent region of interest (ROI) diameter, bleach sample (2.4 mW or similar laser intensity) for 10 consecutive frames. Minimize time in between each bleach frame.",
    "Changes in ROI size may influence observed recovery and therefore should be kept consistent across samples.Monitor recovery over 300 s (1 frame per 5 s) or over sufficient time to observe recovery."
  ],
  "subjectAreas": [
    "Biophysics",
    "Biochemistry",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}