{
  "id": 9807,
  "origin_website": "Jove",
  "title": "Automated Sholl Analysis of Digitized Neuronal Morphology at Multiple Scales",
  "procedures": [
    "1. Before You Begin:\n1) E18 rat dissection:\nStandard dissection methods of E18 hippocampal neurons have previously been described13. In order to use the Bonfire program to analyze the morphological characteristics of the neurites, 8 bit .tif images of individual neurons must be obtained.  This can be accomplished in a number of ways depending on the experimental protocol you are following.  Neurons can be plated at a low enough density so that single neurons appear in the microscope field.  Alternatively, to image individual neurons that are grown in a dense culture, neurons can be transfected using a variety of transfection methods with a plasmid encoding a fluorescent protein.\n2) Software Requirements and Installation:\nThe NeuronJ plugin for the ImageJ software from NIH and NeuronStudio must both be installed in order to run the Bonfire program.  The software packs can be found at the following websites:\n\tImageJ - http://rsbweb.nih.gov/ij/[href=http://rsbweb.nih.gov/ij/]\n\tNeuronJ - http://www.imagescience.org/meijering/software/neuronj/[href=http://www.imagescience.org/meijering/software/neuronj/]\n\tNeuronStudio - http://research.mssm.edu/cnic/tools-ns.html[href=http://research.mssm.edu/cnic/tools-ns.html]\nThe Bonfire program can be found at http://lifesci.rutgers.edu/~firestein.  The Bonfire user manual is also available at this website.  Additionally, the initial description of Bonfire can be found in Langhammer et al, Cytometry 2010.  All of our data have been analyzed using a Windows operating system.\n3) Image Resolution Adjustment: \nYou will need to adjust the Bonfire program based on the image resolution of the images that you wish to analyze.  In the bonfire_parameters portion of the Bonfire program, replace the current value for the variable pix_conv with the value of the image resolution (μm/pixel) of your images.\n2. File Structure:\nIn order for Bonfire to analyze your data, the files must be organized in this specific structure (Figure 2).  You will have:\nA master folder\nSub-folders (containing each of your different conditions)\nCell image files (filename.tif files) contained in the different condition folders",
    "A Bonfire folder containing the Bonfire Matlab mfiles (also contained in the master folder)\n3. Tracing Neurons in NeuronJ:\nPrepare the image for tracing\nOpen the image by selecting the 'Open' button on the NeuronJ toolbar and selecting the image you would like to trace.\nResize the image by selecting the 'maximize' button.\nAdjust the brightness and contrast of the image so that you can visualize all of the neurites by selecting 'Image' on the NeuronJ toolbar then selecting 'Adjust brightness/contrast'.\nTrace the cell body in NeuronJ and identify the trace as being 'Type 06'\nSelect the 'Add Traces' button on the NeuronJ toolbar.\nTrace around the perimeter of the cell body.\nSelect the 'Label Tracings' button on the NeuronJ toolbar.\nSelect 'N1' from the 'Tracing ID' dropdown menu.\nSelect 'Type 06' in the NeuronJ: Attributes window and select 'OK'.\nTrace the neurites in NeuronJ\nSelect the 'Add Traces' button on the NeuronJ toolbar.\nAdd a trace along each neurite branch. You can select only the dendrites or the axon, depending on your experiment.\nWe suggest that the segments you draw stop at each branch point, with each daughter branch point starting at that point as a new trace.\nSelect the 'Save Tracings' button on the NeuronJ toolbar.\nSave the tracing you have just created in the same folder as the original image file.\nExport the trace files and the trace identifier file from NeuronJ\nTwo types of files must be exported from NeuronJ and saved into the appropriate condition folders along with the .tif and .ndf files.\nSelect the 'Export Trace' button on the NeuronJ toolbar.\nSelect the \"Tab-deliminated text-files: separate file for each tracing' option on the 'NeuronJ: Export' dialogue box and select 'OK'.\nAllow NeuronJ to choose the names of the files and the save location.",
    "Select the 'Measure Tracings' button on the NeuronJ toolbar.\nSelect the 'Display tracing measurements' option on the 'NeuronJ: Measurements' window and select 'Run'.\nSelect 'File' in the 'NeuronJ: Tracings' window.\nSelect 'Save As' and save the file as filename_info. 'filename' must exactly match the name of the original image file (including capitalization) followed by _info and should not contain a 3-letter file-extension.  For example, for original image name Cell20.tif, this file would be named 'Cell20_info'.  Check that your computer does not automatically add a .xls file extension.  If it does, the file extension must be manually deleted.\n4. Use Bonfire to Build Preliminary .swc Files from NeuronJ Data:\nReorganize folders using 'bonfire_load'\nOpen Matlab by double clicking on the icon.\nClick on the ' ' button in the upper right of the command window.\nSelect the 'Bonfire' folder in your master folder in the 'Browse For Folder' window.\nType 'bonfire_load' into the Matlab command window and press enter.\nSelect the condition folder that you wish to analyze in the 'Browse For Folder' window and select 'OK'.\nThis will reorganize the folder structure by creating cell sub-folders containing all of the data for each individual cell.\nCreate filename_prelim.swc files using 'bonfire_ndf2swc'\nType 'bonfire_ndf2swc' into the command window and press enter.\nSelect the same condition folder you just reorganized with 'bonfire_load' in the 'Browse For Folder' window and select 'OK'.\nThis will create a .swc file in each cell folder for the chosen condition.  Each cell folder will now contain 5 files; the original .tif image, the .ndf file, the _info trace identifier file, a .txt file and a .swc file.\n5. Use NeuronStudio to Finalize .swc Files:\nOpen and calibrate neuron images in NeuronStudio\nOpen the NeuronStudio program.\nSelect File→Open on the NeuronStudio toolbar.",
    "Find the .tif image of the neuron you want to edit and open it.\nSelect Run→Settings and enter '1' into each of the 3 (X,Y,Z) boxes in the 'Voxel Size' window.\nSelect File→Import SWC.  Select the appropriate .swc file.  The image file will now be overlaid with a trace image.  The cell soma should be overlaid with a red circle.\nUse NeuronStudio to link neurites\nUse the tools in NeuronStudio to correctly identify branch points and end points (we recommend that you become acquainted with NeuronStudio's features and shortcuts before analyzing your data).\nSpecifically, use the 'neurite tool' to join nodes so that:\nEach branch point (yellow nodes) can only create two branches\nAll traces are continuous with the soma (only one red node)\nExport data from NeuronStudio\nSelect File→Save Neurites (save as the default name).\nCheck for errors in .swc files using 'bonfire_trace_check'\nType 'bonfire_trace_check' into the Mathlab command window and press enter.\nSelect the condition folder containing the data you have just processed in the 'Browse For Folder' window and select 'OK'.\nIf there are any errors in any of the images in the folder the program will output images displaying where the error is located.\nFixing errors in NeuronStudio\nOpen the image file you saved in the exporting step.\nLocate and fix the problem(s).\nClick File→Save Neurites.\nRepeat for other images that need to be fixed.\nRerun 'bonfire_trace_check' (5.4).\n6. Use 'bonfire' to Extract Morphological Data from .swc Files:\nType 'bonfire' into the command window and press enter.\nSelect the condition folder that contains the data you want to analyze in the 'Browse For Folder' window and select 'OK'.",
    "The Bonfire analysis will generate a window for each of the neurons being analyzed, in which it graphs the neuronal morphology along with the Sholl rings used in the analysis. Additionally, the 'bonfire' command will generate the .mat file that contains all of the morphological information that has been taken from the analysis.\n7. Use 'bonfire_results' to View the Data:\nType 'bonfire_results' into the Matlab command window.\nSelect the condition folder for the condition you would like to view in the 'Browse For Folder' window and select 'OK'.\nThe 'Browse for Folder' window will close temporarily and re-open, allowing you to select additional conditions you would like to view.\nWhen you are finished selecting condition folders, select 'Cancel' to exit the selection process.\n'Bonfire_results' will return summary charts including the data from the condition folders you selected.\n8. Use 'bonfire_export' to Export Data to Excel:\nType 'bonfire_export' into the command window.\nSelect the condition folder containing the data you would like to export in the 'Browse For Folder' window and select 'OK'.  Bonfire_export will create Excel files of the morphological data and will place them in the condition folder that was selected.\n9. Representative Results:",
    "An example of the data generated by the Bonfire program on a data set containing two conditions is shown in Figure 3.  In this example, Condition 1 neurons contain more neurites distal to the cell body.  This phenomenon can be observed in the example images (Figure 3B) as well as in the Sholl curve of the total dendritic arbor (Figure 3A) and in the graph of the number of terminal points (Figure 3C).  Additionally, because the Bonfire program also performs Sholl analysis on subregions of the images, we are able to identify more specifically the identity of the neurites that have increased.  Both the total number of intersections of 3rd order or greater neurites (Figure 3F) and the total number of both intermediary and terminal neurites (Figure 3G) are increased distal to the cell body.  These trends can also be observed in Figures 3D and 3E.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2354/2354fig1.jpg\nFigure 1: Flow chart of the Bonfire program.  Neurons are traced using ImageJ.  The data are then exported and converted by the Bonfire program into preliminary .swc files.  NeuronStudio is used to define the connectivity of the neurites.  Bonfire checks for errors and then calculates Sholl curves, the number of primary, secondary, and higher order neurites, and the number of branch points and neurite tips.  Finally, the data are exported to Excel for statistical analysis.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2354/2354fig2.jpg\nFigure 2: File structure required for Bonfire analysis.  The file structure must match this or the program will not run correctly.  The names of the folders and files and the quantity of the folders and files can be changed.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2354/2354fig3.jpg",
    "Figure 3: Example output data from Bonfire program. A) Total Sholl curves. B) Example inverted images of both conditions. C) Average number of branch points and terminal points/cell. D) Average number of processes/cell for primary, secondary, and tertiary or greater neurites. E) Average number of processes/cell for root, intermediate, and terminal neurites. F) Segment identity-specific Sholl analysis curves.  Segments are grouped as primary, secondary, or tertiary or greater.  G) Segment identity-specific Sholl analysis curves.  Segments are grouped as root segments, intermediate segments, or terminal segments.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}