{
  "id": 15347,
  "origin_website": "Jove",
  "title": "Mapping RNA-RNA Interactions Globally Using Biotinylated Psoralen",
  "procedures": [
    "1. Treatment of HeLa Cells with Biotinylated Psoralen and RNA Extraction\nCulture HeLa cells in Dulbecco's modified Eagle medium (DMEM) supplemented with 10% fetal bovine serum (FBS) and 1% penicillin streptomycin (PS) in a 10 cm plate.\nWash the HeLa cells twice with 5 mL of 1x PBS. Drain excess PBS completely from the dish by placing the dish vertically for 1 min.\nAdd 1 mL of PBS containing 200 µM of biotinylated psoralen and 0.01% w/v digitonin, to the cells uniformly and incubate at 37 °C for 5 min. While biotinylated psoralen can enter the cell, its permeability is much higher when the cells are exposed to low amounts of digitonin (0.01%) for 5 min\nRemove the lid of the 10 cm plate containing the treated HeLa cells and place the dish flat on ice. Irradiate the dish containing the cells with 365 nm UV for 20 min on ice, at a distance of 3 cm from the UV bulbs, using the UV crosslinker.\nIsolate total RNA from HeLa cells by guanidinium thiocyanate-phenol-chloroform extraction following the manufacturer's protocol. Add 1:1 volume of isopropanol to precipitate the RNA at room temperature for 30 min.\n\tPause Point: RNA can be stored at -20 °C in isopropanol indefinitely. A dot blot can be performed at this step to check that biotinylated psoralen has successfully entered the cells and has crosslinked RNAs in vivo (Figure 2).\nCentrifuge the precipitated RNA at 20,000 x g for 30 min at 4 °C to recover the RNA. Remove the supernatant and add 1 mL of 70% cold ethanol to the RNA pellet to wash the RNA.\nCentrifuge the samples at 20,000 x g for 15 min at 4 °C. Remove the supernatant and air dry the pellet for 5 min at room temperature.",
    "Add nuclease free water to the RNA pellet and quantify the concentration of RNA using UV spectrometer.\n\tPause Point: RNA can be stored at -80 °C after flash freezing in liquid nitrogen.\n2. RNA Fragmentation\nPreheat 15 µL of 2x RNA fragmentation buffer and 10 µL of the RNA sample (1 µg/µL) individually in 0.2 mL PCR tubes, at 95 °C for 1 min. Mix 10 µL of the heated 2x RNA fragmentation buffer with 10 µL RNA sample by pipetting up and down. Incubate the sample at 95 °C for 5 min. Stop the reaction by snap cooling the reaction on ice.\nTransfer and pool the 2 fragmentation reactions to a 1.5 mL microfuge tube. Add 40 µL of nuclease free water to the reaction, 10 µL of 3 M sodium acetate, 1 µL of glycogen and 300 µL of 100% ethanol to the fragmentation reaction. Incubate the RNA at -20 °C for at least 1 h to precipitate the RNA.\nCentrifuge the precipitated RNA at 20,000 x g for 30 min, remove the supernatant and wash the RNA using 1 mL of 70% ethanol.\nCentrifuge the RNA at 20,000 x g for 15 min, remove the supernatant and dissolve the RNA in 20 µL of nuclease free water.\n3. RNA Size Selection and Elution\nAdd 20 µL of RNA loading dye to the recovered RNA in the microfuge tube. Heat the RNA with the RNA loading dye at 95 °C for 3 min and place it on ice for 2 min.\nAdd 3 µL of RNA loading dye to 0.25 µL of 10 nt DNA ladder in a microfuge tube. Heat the ladder at 95 °C for 3 min and place it on ice for 2 min.",
    "Load the denatured ladder and samples onto an 8.6 cm x 6.8 cm 6% TBE urea gel and size fractionate by electrophoresis for 40 min at 180 V. Stain the gel in 10 mL of TBE buffer containing 1:10,000 of nucleic acid gel stain for 5 min in the dark.\nPuncture a clean 0.6 mL microfuge tube at the bottom using a 24 G needle and place it in a 2 mL microfuge tube.\nVisualize the bands on the post-stained gel using a transilluminator and cut a gel slice corresponding to 90-110 nt. Transfer the gel slice into the punctured 0.6 mL microfuge tube in the 2 mL microfuge tube. This size selection is performed to allow the chimeric fragments to have a minimum length to map to the transcriptome and to distinguish between proximity ligated products versus unligated products in downstream size selection steps.\nCentrifuge the gel slices at 12,000 x g at room temperature for 2 min to shred the gel slice and collect it in the 2 mL microfuge tube. Discard the empty 0.6 mL microfuge tube. Add 700 µL of elution buffer to the shredded gel slice in the 2 mL microfuge tube and incubate at 4 °C overnight with constant rotation, to allow diffusion of the samples into the buffer.\nTransfer the gel slices and the elution buffer to a centrifuge tube filter and centrifuge at 20,000 x g for 2 min. The gel slices will be trapped at the top compartment of the filter. Discard the gel slices and the top compartment.\nAdd 1 µL of glycogen and 700 µL of 100% isopropanol to the filtrate in the microfuge tube and precipitate the RNA at -20 °C for at least 1 h or overnight.",
    "Pause Point: RNA can be precipitated in isopropanol indefinitely at -20 °C.\nCentrifuge the precipitated RNA at 20,000 x g for 30 min at 4 °C to recover the RNA. Remove the supernatant and add 1 mL of 70% cold ethanol to wash the RNA pellet. Centrifuge the washed pellet at 20,000 x g for 15 min at 4 °C.\nRemove the wash buffer and add 20 µL of nuclease free water to resuspend the RNA. Quantitate the concentration of RNA using an UV spectrometer.\n\tPause Point: RNA can be stored at -80 °C after flash freezing in liquid nitrogen.\n4. Enrichment of RNA Crosslinking Regions\nVortex streptavidin coated magnetic beads vigorously to resuspend the beads homogenously in the tube. Transfer 100 µL of beads to a 1.5 mL microfuge tube and place it on a magnetic stand for 1 min to allow the beads to stick to the magnetic side of the tube. Remove the storage buffer from the beads carefully and take the tube out of the magnet stand.\nAdd 1 mL Lysis Buffer to the beads in the microfuge tube and pipette up and down. Place the microfuge containing beads on the magnetic stand for 1 min to separate the beads from the wash buffer. Repeat this for a total of 3 washes.\nRemove the wash buffer from the beads by placing the microfuge containing beads on the magnetic stand for 1 min. Add RNase inhibitor (1:200) to the lysis buffer and add 100 µL of lysis buffer to the washed beads in the microfuge tube.\nAdd 2 mL of freshly prepared Hybridization Buffer, 1 mL of supplemented lysis buffer, 1.5 µg of size fractionated RNA and 100 µL of resuspended beads to a 15 mL conical centrifuge tube. Vortex the tube gently.",
    "Incubate the 15 mL conical centrifuge tube at 37 °C for 30 min with end to end rotation. Pre-warm the wash buffer at 37 °C.\nPlace the 15 mL conical centrifuge tubes on a magnetic stand for 15 mL tubes for 2 min to separate the beads from the buffer. Pipette the buffer carefully out of the tube and discard it.\nAdd 1 mL of pre-warmed wash buffer to the beads, pipette up and down and transfer the beads to a 1.5 mL microfuge tube. Incubate at the beads at 37 °C for 5 min, with end to end rotation.\nBriefly centrifuge down the contents of the microfuge tube. Place the 1.5 mL washed beads in microfuge tubes on a magnetic stand for 2 mL tubes for 1 min, to separate the beads from the wash buffer. Remove the buffer from the beads by gently pipetting the buffer out of the microfuge tube.\nAdd 1 mL of pre-warmed wash buffer to the beads and pipette up and down to repeat the wash. Perform a total of 5 washes. At the end of the 5th wash, remove the wash buffer by placing the microfuge containing beads on the magnet stand for 1 min.\n5. Proximity Ligation\nAdd 1 mL of cold T4 polynucleotide kinase (PNK) buffer to the washed beads and incubate the beads for 5 min at 4 °C, with end to end rotation. Place the microfuge tube containing the beads on the magnetic strip for 1 min and gently remove the T4 PNK buffer. Repeat this step for a total of 2 washes and remove the T4 PNK buffer after the last wash.",
    "Add buffers to the beads, according to Table 1. To enable the 3' ends of the RNA fragment to be ligated to 3' adapters below, incubate the beads in the buffer at 37 °C for 4 h with constant agitation to convert the 3' cyclic phosphate group at the end of the RNA to 3' OH.\nAdd buffers to the previous reaction, according to Table 2. To enable the 5' end of the RNA fragments to be ligation competent, incubate the reaction at 37 °C for 1 h with constant agitation in the presence of ATP, to convert 5' OH on the RNA to 5' phosphate.\nAdd buffer to the previous reaction to perform proximity ligation, according to Table 3. Incubate the reaction at 16 °C for 16 h, with constant agitation,\nPlace the microfuge containing the ligated RNA onto a magnet stand for 1 min. Remove the supernatant carefully and add 1 mL of room temperature wash buffer to the beads. Resuspend by pipetting up and down.\nPlace the microfuge tube onto the magnet stand for 1 min and remove the wash buffer carefully. Perform a total of 2 washes, and remove the wash buffer from the beads at the end of the second wash.\nAdd 100 µL of RNA PK Buffer to the beads and resuspend by pipetting up and down. Heat the samples at 95 °C for 10 min on a heat block.\nChill the sample on ice for 1 min and add 500 µL of guanidinium thiocyanate-phenol-chloroform to the sample. Mix by vortexing vigorously for 10 s. Incubate the mixture at room temperature for 10 min.\n\tPause Point: RNA can be stored in guanidinium thiocyanate-phenol-chloroform at -80 °C for a couple of months.",
    "Add 100 µL of chloroform to the guanidinium thiocyanate-phenol-chloroform extracted samples. Vortex vigorously for 10 s. Centrifuge the samples at 20,000 x g for 15 min at 4 °C.\nTransfer 400 µL of the aqueous layer to a new 1.5 mL microfuge tube. Add 800 µL (2 volumes) of 100% ethanol and mix by pipetting up and down.\nTransfer the RNA solution to RNA cleanup columns and recover the RNA following manufacturer's instructions, ensuring that even small RNAs are retained. Elute the RNA in 100 µL of nuclease-free water.\n\tPause Point: RNA can be stored at -80 °C after flash freezing in liquid nitrogen.\n6. Reverse Crosslinking of Biotinylated Psoralen\nTransfer the 100 µL of the eluted samples into a well of a 24 well plate. Remove the cover and irradiate the sample under UV 254 nm, for 5 min on ice.\nTransfer the reverse crosslinked sample to a clean microfuge tube. Add 10 µL of sodium acetate, 1 µL of glycogen and 300 µL of 100% ethanol and precipitate the RNA at -20 °C for at least 1 h or overnight.\n\tPause Point: RNA can be precipitated in ethanol indefinitely at -20 °C.\nCentrifuge the precipitated RNA at 20,000 x g for 30 min at 4 °C to recover the RNA. Remove the supernatant and add 1 mL of 70% cold ethanol to wash the RNA pellet.\nCentrifuge the washed pellet at 20,000 x g for 15 min at 4 °C. Remove the wash buffer and add 4.25 µL of nuclease free water to resuspend the RNA. Transfer the RNA to a 0.2 mL PCR tube.\n\tPause Point: RNA can be stored at -80 °C after flash freezing in liquid nitrogen.\n7. Reverse Transcription and cDNA Circularization",
    "Add 0.75 µL of RNA linker (0.5 µg/µL) to the resuspended sample in PCR tube and heat at 80 °C for 90 s. Place the sample on ice for 2 min.\nAdd the buffers to the denatured sample for 3' adapter ligation, according to Table 4. Incubate the reaction at 25 °C for 2.5 h.\nTransfer the reaction to a 1.5 mL microfuge tube. Add 90 µL of nuclease free water to the reaction, followed by 10 µL of sodium acetate, 1 µL of glycogen and 300 µL of 100% ethanol. Precipitate the RNA at -20 °C for at least 1 h or overnight.\n\tPause Point: RNA can be precipitated in ethanol indefinitely at -20 °C.\nCentrifuge the precipitated RNA at 20,000 x g for 30 min at 4 °C to recover the RNA. Remove the supernatant and add 1 mL of 70% cold ethanol to wash the RNA pellet.\nCentrifuge the washed pellet at 20,000 g for 15 min at 4 °C. Remove the wash buffer resuspend the pellet in 5 µL of nuclease free water.\nAdd 5 µL of RNA loading dye to the recovered RNA in the microfuge tube. Heat the RNA with the RNA loading dye at 95 °C for 3 min and place it on ice for 2 min.\nAdd 3 µL of RNA loading dye to 0.25 µL of 10 nt DNA ladder in a microfuge tube. Heat the ladder at 95 °C for 3 min and place it on ice for 2 min.\nPerform size fractionation using 8.6 cm x 6.8 cm 6% TBE urea gel as in steps 3.3 and 3.4.",
    "Visualize the gel stained with nucleic acid stain using the transilluminator and cut a gel slice corresponding to 110-140 nt on the ladder. Transfer the gel slice into the punctured 0.6 mL microfuge tube in the 2 mL microfuge tube and follow the protocol from steps 3.6- 3.9.\nAdd 5 µL of nuclease free water to resuspend the RNA pellet. Transfer the RNA to a 0.2 mL PCR tube.\n\tPause Point: RNA can be stored at -80 °C after flash freezing in liquid nitrogen.\nAdd 1 µL of RT primer at 1.25 µM to the RNA in PCR tube and heat at 80 °C for 2 min. Place the sample on ice for 2 min.\nAdd the buffers for reverse transcription according to Table 5. Incubate the reaction at 50 °C for 30 min.\nAdd 1.1 µL of 1 N NaOH to the reaction and heat at 98 °C for 20 min. Place the reaction on ice.\nTransfer the reaction to a 1.5 mL microfuge tube. Add 90 µL of nuclease free water to the reaction, followed by 10 µL of sodium acetate, 1 µL of glycogen and 300 µL of 100% ethanol. Precipitate the DNA at -20 °C for at least 1 h or overnight.\n\tPause Point: DNA can be precipitated in ethanol indefinitely at -20 °C.\nCentrifuge the precipitated DNA at 20,000 g for 30 min at 4 °C to recover the DNA. Remove the supernatant and add 1 mL of 70% cold ethanol to wash the DNA pellet. Centrifuge the washed pellet at 20,000 x g for 15 min at 4 °C. Remove the wash buffer resuspend the pellet in 5 µL of nuclease free water.\nPerform size fractionation using 8.6 cm x 6.8 cm 6% TBE urea gel as in steps 3.3 and 3.4.",
    "Visualize the post-stained gel using the transilluminator and cut a gel slice corresponding to 200-240 nt on the ladder. The reverse transcribed cDNA is now 96 bases longer than the RNA fragment due to the addition of the 96 base RT primer. Transfer the gel slice into the punctured 0.6 mL microfuge tube in the 2 mL microfuge tube.\nCentrifuge the gel slices at 12,000 x g at room temperature for 2 min to shred the gel slice and collect it in the 2 mL microfuge tube. Discard the empty 0.6 mL microfuge tube.\nAdd 700 µL of elution buffer to the shredded gel slice in the 2 mL microfuge tube and incubate at 37 °C for 2 h with constant rotation. Follow the protocol as described in steps 3.7- 3.8.\nAdd 6 µL of nuclease free water to resuspend the DNA pellet. Transfer the DNA to a 0.2 mL PCR tube.\n\tPause Point: DNA can be stored at -80 °C after flash freezing in liquid nitrogen.\nAdd the buffers to the reaction for cDNA circularization, according to Table 6. Incubate the reaction at 60 °C for 1 h and heat at 80 °C for 10 min to inactivate the reaction.\nTransfer the reaction to a 1.5 mL microfuge tube. Purify the circularized cDNA using a DNA cleanup column following the manufacturer's instructions. Add 20 µL of nuclease free water to the column to elute the purified cDNA.\n\tPause Point: DNA can be stored at -20 °C for a couple of months.\n8. PCR Amplification (Small Scale PCR)\nAdd the buffers to the reaction according to Table 7 for PCR amplification to test the minimal number of cycles need for library amplification.",
    "Set up the PCR cycling conditions according to Table 8. Pause the reaction and transfer 5 µL of the PCR reaction at 10, 15 and 20 cycles, into separate 1.5 mL microfuge tubes.\nAdd 1 µL of 6x DNA gel loading dye to each of the 5 µL PCR reaction at the different cycles. Perform gel electrophoresis on a 3% agarose gel, at 120 V, for 1 h to visualize the PCR products.\nUse the lowest number of PCR cycles (Y) that show amplification at around 250 bases (In Figure 3, there is a strong band at 15 cycles of amplification and a faint band at 10 cycles. 12 cycles of large scale PCR amplification is likely to generate enough material for deep sequencing as the amount of cDNA used is 10 times that of small scale PCR amplification).\n9. PCR Amplification (Large Scale PCR) and Purification\nAdd the buffers to the reaction according to Table 9 for PCR amplification for large scale PCR.\nSet up the PCR cycling conditions according to Table 10.\nAdd 5 µL of 6x DNA gel loading dye to the 25 µL of PCR reaction and load into a well of a 3% agarose gel. Load 1 kb plus DNA ladder into a separate well. Perform gel electrophoresis at 100 V, for 1.5 h.\nVisualize the completed gel using a UV Transilluminator.\nSize extract a gel slice containing PCR products from 200- 300 bases and transfer the gel to a clean 2 mL microfuge tube.\nAdd 1 mL of gel solubility buffer, from a DNA gel extraction kit, to the gel slice and incubate at room temperature for 30 min, or until the gel dissolves, with constant agitation.",
    "Add 200 µL of isopropanol to the dissolved gel and mix well by pipetting. Transfer 700 µL of the sample to a DNA gel extraction cleanup column and centrifuge at 13,000 x g for 30 s. Keep transferring the dissolved sample to the column until all of the sample has been loaded onto the column.\nAdd 500 µL gel solubility buffer, followed by 700 µL of column wash buffer, to the column, according to the manufacturer's protocol. Add 12 µL of nuclease-free water to the center of the column to elude the DNA. Pause Point: DNA can be stored at -20 °C.\nQuantitate the concentration of the DNA using fluorometric quantification. If multiple libraries are constructed and pooled together for sequencing, add equal amount of each sample to the pool, for high throughput sequencing.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}