{
  "id": 17562,
  "origin_website": "Jove",
  "title": "Characterization of a Novel Human Organotypic Retinal Culture Technique",
  "procedures": [
    "Human donor eye cups were obtained from the New Zealand National Eye Bank following corneal excision for transplantation and as approved by the Northern B Health and Disability Ethics Committee (NTX/06/19/CPD/AM07).\nNOTE: The culture should be done in a Class II biosafety cabinet to ensure sterile tissue culture conditions. The tissues must be cultured within 24 h post-mortem to avoid significant retinal integrity loss.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62046/62046fig02.jpg",
    "Figure 2: Images showing the procedure for collecting the sandwich retinal explants. For explant preparation, use dissecting scissors with one sharp tip and one blunt end, with the blunt end facing the inside of the globe to reduce tissue damage during incision. Also use forceps with blunt ends to avoid scratching the intraocular tissues during handling. Using surgical scissors, with the blunt end facing the inside, cut along the limbus to remove the iris and lens (A-C). The ONH can be located if looking straight into the opened eyecup (D). Using forceps with blunt tips, hold the sclera to stabilize the globe (E). Divide the globe vertically into two halves by making two deep incisions towards the ONH but do not cut through the ONH. Repeat this along the horizontal meridian (G). Apply blunt forceps at the sclera and gently open the globe to a clover shape (H-K). Use forceps to carefully manipulate the vitreous to smoothen the folded retina, as the vitreous tugs onto the retina, but do not touch the retina directly (I). Remove the vitreous if it is causing retinal detachment or folding (not shown in Figure 2 as the transparent vitreous is not well captured on photos). Locate areas where the retina is flat and extract retinal explants using a surgical trephine (L). Applying forceps at the sclera, carefully transfer the retinal explants into the pre-prepared culture medium (M,N). The entire sandwich explant should sink to the bottom of the well due to its weight, therefore each explant is submersed in the medium (O). Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62046/62046fig02large.jpg]\n1. Extraction of the sandwich retinal explants from the eyecup\nRemove the iris and lens.",
    "Place the eye cup inside a Petri dish, with the iris and lens facing upwards and the optic nerve head (ONH) contacting the Petri dish (Figure 2A).\nHold the eye cup steady at the limbus using forceps (Figure 2B).\nDetach the iris and lens by making small cuts circumferentially along the outer edge of the limbus (Figure 2A).\nRemove the iris and lens carefully. Avoid disturbing the retina during manipulation (Figure 2C).\n\t\tNOTE: The lens will not fall into the eye cup as it is attached, via zonule fibers, to the ciliary body.\nFlatten the eye cup.\n\t\nWith the eye cup still sitting upright, identify the ONH. This is easier with a bright white light source (Figure 2D).\nIncise at the four quadrants towards the ONH (Figure 2E). The Petri dish can be rotated for easier handling. Do NOT cut the ONH.\nSpread and flatten the eye cup carefully (Figure 2E).\nApply the forceps on the sclera instead of the retina to avoid disrupting retinal integrity.\n\t\tNOTE: Peripheral retinal detachment and folding is unavoidable, as the weight of the overflowing vitreous will pull on the retina. In these areas, remove the vitreous to prevent further retinal folding. Remember to leave residual vitreous to stabilize the retina on top of the RPE-choroid and sclera.\nCollect sandwich retinal explants.\n\t\nPlace a surgical trephine on the retina in a region without retinal folds (Figure 2F).\nPress hard to penetrate the sclera, which should generate a cracking sound.\nTwist the trephine by 180° to ensure the sclera has been penetrated fully such that the retinal explant is now separated from the remaining tissue.\nApply the forceps at the sclera and transfer the sandwich retinal explant to the culture medium (Figure 2G-I).\nObtain 2-3 sandwich retinal explants from the peripheral retina of each quadrant.",
    "NOTE: The sandwich retinal explant can sometimes be trapped in the opening of the trephine. Using forceps, gently tease out a small section of the base of the sclera. This occurs more often when the blade is blunt and can cause loss of the retina (Figure 3A-C).\nUse a new trephine after cutting out 1-2 retinal explants as the blade becomes blunt easily (Figure 3Cimgsrc://cloudfront.jove.com/files/ftp_upload/62046/62046fig03.jpg\nFigure 3: Troubleshooting. During the extraction process, the retinal explant may be trapped at the opening of the surgical trephine (A). Gently tease out the tissue from the base of the sclera without touching the retina (B). This can happen more often if the surgical trephine is used for extracting more than two retinal explants, as the blade can easily become blunt (C). Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62046/62046fig03large.jpg]\nCulture the retinal explants.\n\t\nPrepare the culture medium containing Dulbecco's Modified Eagle Medium nutrient mixture F-12 (DMEM-F12) and a 1x antibiotics and antimycotics mixture (AA, 100x stock).\nPrior to explant extraction, place 500 µL of medium in the wells of a 24-well plate and equilibrate in the incubator. This is important as adding the medium afterwards can dislodge the retina.\nCulture the sandwich retinal explants at 37 °C for up to 72 h in a humidified 5% CO2 incubator in medium prepared in step 1.4.2.\nTo induce DR-like changes, culture retinal explants in medium containing DMEM-F12 with a combination of 32.5 mM HG with Cyt, TNF-α (10 ng/mL) and IL-1β (10 ng/mL).\n2. Paraffin-embedding of the sandwich retinal explants\nFix the sandwich retinal explants.\n\t\nImmerse the sandwich retinal explants in 10% formalin for at least 24 h.\nRemove the formalin solution and transfer the sandwich retinal explants gently into tissue pads and cassettes.",
    "Soak the sandwich retinal explants in 70% ethanol for at least 24 h.\nParaffin-embed retinal explants into blocks.\nCut paraffin-embedded retinal tissues into 5 µm thick sections using a microtome and mount onto glass slides. Store at room temperature until imaging.\nDeparaffinize sections.\n\t\nImmerse the sections in 70% xylene for 5 min.\nImmerse the sections in 100% xylene for 5 min.\nRehydrate the sections in 70% ethanol for 5 min.\nRehydrate the sections in 100% ethanol for 5 min.\nWash the sections under running tap water for 10 min.\n3. Characterization using H&E, IHC and a Magnetic Luminex assay\nH&E staining protocol\n\t\nDeparaffinize the sections using step 2.2.\nHydrate the sections in tap water for 5 min.\nStain the sections in Gill's 2 hematoxylin solution for 5 min.\nWash the sections thoroughly under running tap water to remove excess stain.\nDifferentiate by dipping the sections twice in 1% acid alcohol.\nWash the sections quickly under running tap water.\nStain the sections blue by dipping six times in 1% lithium carbonate (10 mg/mL).\nWash the sections thoroughly under running tap water for 5 min to remove excess blue stain.\nDip the sections in 1% eosin 10 times.\nWash the sections quickly under tap water to remove excess stain.\nDehydrate the sections by dipping them 10 times in 100% ethanol. Do this twice.\nDip the sections in 70% xylene 10 times.\nDip the sections in 100% xylene 10 times.\nMount with a coverslip using dibutylphthalate polystyrene xylene (DPX) mounting medium.\nTake images using a light microscope.\nIHC labeling protocol'\n\t\nDeparaffinize the sections using step 2.2.\nPlace the slides into a solution containing 10 mM sodium citrate buffer with 0.05% Tween 20 at pH 6.0 and run an antigen retrieval in a pressure cooker automated at 121 °C for 2 min.",
    "Wash sections in phosphate buffered saline (PBS) for 5 min. Do this 3 times.\nBlock the sections with PBS containing 0.1% Triton X-100 and 10% normal goat serum for 1 h at room temperature.\nIncubate sections overnight at 4 °C with primary antibodies conjugated to secondary antibodies (Table of Materials).\nWash sections in PBS for 5 min. Do this 3 times.\nStain nuclei using 4′,6-diamidino-2-phenylindole (DAPI) for 2 min.\nWash and mount sections using an anti-fade reagent.\nSeal coverslips with nail polish.\nTake images using a confocal laser scanning microscope.\nMagnetic Luminex assay\n\t\nTransfer 75 µL of media from each well to a 96-well-u-bottom plate at 24 and 72 h.\nAnalyze the cell supernatant for IL-18, IL-6, IL-8 and vascular endothelial growth factor (VEGF) after 24 and 72 h using Luminex cytokine assay. Follow the manufacturer's instructions to conduct the assay16.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}