{
  "id": 4250,
  "origin_website": "Bio",
  "title": "Isolation of Neutralizing Antibody",
  "procedures": [
    "Note: Every centrifugation step is performed at room temperature.    Preparation of SPYMEG cells (SPYMEG cells, that are almost confluent in a T-75 flask, are needed per 10 ml blood sample)   SPYMEG cells stored in freezed condition are thawed.   Cells are transferred to a 15-ml tube and 10 ml DMEM-FBS are added.   The cell suspension is centrifuged at 1,000 rpm for 5 min.    The supernatants are aspirated and the cells in the precipitate are suspended with 20 ml DMEM-FBS.   They are transferred to a T-75 flask.   The cells are incubated in the CO2 incubator until the cells become confluent.   Fresh 10 ml DMEM-FBS are added to the flask a day ahead of fusion.   The cultured medium is aspirated and 10 ml DMEM is added in the flask.   The cells are detached by tapping the flask strongly.   The cells are transferred to a 50-ml tube.   Tube is centrifuged at 1,000 rpm for 5 min.   The supernatants are removed.   The cell pellets are suspended with 10 ml DMEM.    Tube is centrifuged at 1,000 rpm for 5 min.   The supernatants are aspirated.   The cell pellets are suspended with10 ml DMEM.      Isolation of peripheral blood mononuclear cells (PBMCs)   Fresh 10 ml blood is drawn from vaccinated donors or patients.   Blood is collected in 15-ml tube including 1 drop of heparin.   Blood is centrifuged at 1,000 rpm for 5 min.   Plasma layer is removed.   PBS is added up to 10 ml in the total volume.   3 ml undiluted HetaSep is added.   The blood cells are mixed gently and stood for 1 h at room temperature.   The upper layer is collected carefully and overlaid on 5 ml undiluted Ficoll in a 15-ml tube.   Tube is centrifuged at 1,700 rpm for 1 h. (The brake is off).",
    "The upper layer is removed and the turbid intermediate layer is transferred to a new 50-ml tube.   DMEM is added up to 20 ml in the total volume.   The cells are mixed gently and centrifuged at 1,700 rpm for 5 min.   The supernatants are removed.   20 ml DMEM is added.   The cells are mixed gently and centrifuged at 1,700 rpm for 5 min.   The supernatants are removed.   10 ml DMEM is added and the cells are mixed gently.      Fusion   10 ml SPYMEG cells prepared in A16 and 10 ml PBMCs solution prepared in B17 are mixed gently in a 50-ml tube.   The mixed cell suspension is centrifuged at 1,400 rpm for 5 min.   The supernatants are removed.   The 0.6 ml undiluted PEG is added gradually to the cell pellet and the cells are stirred gently (It should take 4 min).   10 ml DMEM is added gradually and the mixture is stirred gently (It should take 2 min).   10 ml DMEM-FBS is added (not need to mix).   The tube is centrifuged at 1,400 rpm for 5 min.   The supernatants are removed.   10 ml DMEM-FBS is added and the cells are mixed gently.   Tube is centrifuged at 1,000 rpm for 5 min.   The supernatants are removed.   10 ml DMEM-HAT is added and the cells are mixed gently.   The cell solution is divided into 2 tubes.   45 ml DMEM-HAT is added to each of tube.   100 ml cell solution is seeded to 500 wells in 96-well plates (200 μl cell suspension per well).   Plates are incubated in the CO2 incubator.   100 μl culture medium is changed to new DMEM-HAT every 3 to 4 days until fused cells grow up.      Screening for the hybridoma producing antigen-specific antibody   The infected MDCK cells are prepared for screening.",
    "MDCK cells are passaged in 2 x 104 cells per well (100 μl per well) in 96-well plates using MEM including 10% FBS a day ahead of infection.   MDCK cells are washed with 100 μl PBS once. After aspiration of PBS, MDCK cells are adsorbed 50 μl influenza B virus propagated with MDCK cells at an MOI of 0.1 for 1 h in the CO2 incubator.   100 μl MEM is added to the wells.   The plates are incubated in the CO2 incubator for 12 h.   The medium is removed.   The cells are washed with 100 μl PBS once and fixed with 200 μl absolute ethanol for 2 min at room temperature.   The plates are air-dried and stored at -20°C until screening.     The fixed MDCK cells prepared in D1 are adsorbed with the 75 μl cultured medium of fused cells prepared in C16 at 37 °C for 40 min.   They are washed with 100 μl PBS three times with agitation for 5 min each.   The plates are adsorbed with 75 μl FITC-conjugated anti-human IgG (1:500) and stood at 37 °C for 50 min.   They are washed with 100 μl PBS three times with agitation for 5 min each.   The fluorescent positive cells are observed under fluorescent microscope.   The wells of hybridoma whose culture medium yield fluorescently positive cells are processed to cell cloning.      Cloning of the hybridoma   Each of wells including fluorescent positive cells in D7 is pipetted until the cells are detached.   Cell number is counted using counting chamber.   The cell suspension is adjusted to 1 cell per well in 96-well plate with DMEM-HT (200 μl per well).   They are seeded to a 96-well plate and incubated in the CO2 incubator.",
    "100 μl medium is changed to new DMEM-HT every 3 to 4 days until the cells grow up (Cell proliferation is checked using light microscope).   Screening is performed again to select the antigen-specific hybridoma clone as described in D1 to D7.   The hybridoma clones producing antigen-specific antibody are passaged to the larger-well plates (96-, 48-, 24-, 12- and 6-well plates and 6-cm culture dish) and ultimately grown up in 10-cm culture dish.      Purification of human monoclonal antibody   Ten 10-cm dishes including confluent hybridoma in DMEM-HT are prepared.   The medium is changed to Hybridoma SFM.   The cells are incubated in the CO2 incubator until the half of hybridoma cells die.   The cultured medium are collected and centrifuged at 5,000 rpm for 30 min.   The monoclonal antibody is purified by IgG-affinity column (HiTrap Protein G HP) according to the manufacturer’s instructions using Peristaltic pump.   The purified antibody is filled in the syringe with needle.   The antibody is injected to the dialysis cassette.   The cassette with a floater is immersed in a beaker filled with 1,000 ml PBS and stirred at 4 °C for 2 h.   1,000 ml PBS is changed and the cassette is stirred again at 4 °C for 2 h.    1,000 ml PBS is changed and the cassette is stirred again at 4 °C overnight.   The antibody in the cassette is collected and filtrated with a 0.45 μm filter.   The concentration of the antibody is measured.       Viral neutralization assay   MDCK cells are prepared in a 96-well plate a day ahead of viral neutralization assay as described in D1.   The antibody at a concentration of 100 μg/ml is serially 4-fold diluted with MEM.   30 μl diluted antibodies or MEM as a control are incubated with 30 μl 200 focus-forming units of virus in the CO2 incubator for 1 h.",
    "MDCK cells are washed with 100 μl PBS and adsorbed with 30 μl mixture prepared in VII-3 in the CO2 incubator for 1 h.   MDCK cells are washed with 100 μl PBS three times and added 100 μl MEM.   They are incubated in the CO2 incubator for 12 h.   The cells are washed with 100 μl PBS and fixed with 200 μl absolute ethanol for 2 min at room temperature.   The cells are air-dried.   The fixed MDCK cells are adsorbed with 75 μl 1st antibody (mouse serum infected with influenza B virus, 1:500) for detecting viral antigen and incubated at 37 °C for 30 min.   They are washed with 100 μl PBS three times.    They are adsorbed with 75 μl FITC-conjugated antibody for IgG of the 1st antibody and incubated at 37 °C for 45 min.   They are washed with 100 μl PBS three times.   The antigen positive cells are counted in each of wells under observation by fluorescent microscope (Figure 1).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20131215/20131215030402_8419.jpg Figure 1. Fluorescent positive or negative cells observed by fluorescent microscope    When the cell number is lower in the wells treated with antibody than in control (treated with PBS), the antibody is regarded as neutralizing monoclonal antibody. The lowest concentration of MAb that shows positive cell number to 50% compared with control is designated the VN50 titer. Low VN50 titer means that the MAb has strong neutralizing activity."
  ],
  "subjectAreas": [
    "Microbiology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}