{
  "id": 5615,
  "origin_website": "Bio",
  "title": "Active Cdk5 Immunoprecipitation and Kinase Assay",
  "procedures": [
    "Notes: Steps A1-A4 should be performed as quickly as possible to avoid loss of cellular proteins during washes.This protocol is designed to preserve the Cdk5/activator complex while still maintaining enough stringency to reasonably lyse the cells and remove non-specific proteins from the immunoprecipitated complex.Once [γ-32P]ATP has been added in step D3b, ALL discarded solutions MUST be disposed of according to the radiation safety protocols at your institution for the remainder of this protocol.Generating cellular lysatesCell cultures should be grown to confluence with the appropriate treatment and control groups.Aspirate the media from the plate(s) and rinse the cell cultures very gently with PBS (see Recipes) twice. Remove the PBS from the last wash.Detach the cells from the culture plates using a cell lifter. Collect the detached cells by rinsing the plate with an appropriate volume of PBS (1 ml for 60 mm plates, 3 ml for 100 mm plates, etc.).Transfer the cell suspension to a 15 ml conical tube.Centrifuge the cell suspension at 3,500 x g for 5 min at 4 °C.Repeat steps A3-A5 if needed.Resuspend the cell pellets in lysis buffer (see Recipes) at 15% w/v.Incubate lysates on ice for 10 min with periodic agitation.Confirm lysis by mixing a 10 µl sample of the lysate 1:1 with trypan blue. Pipette 10 µl of this mixture onto a microscope slide and place a coverslip onto the 10 µl droplet. Good lysis will appear as many intact nuclei that are no longer contained within cells. Unlysed cells will appear as spheres with blue outlines. If the nuclei lyse, many brown fibers will be present, which can negatively impact the purity of your immunoprecipitation. Example images of unlysed cells and good lysis are presented in Figure 1.",
    "Reserve 10% of the lysate as ‘Input’, add 5x Laemmli buffer (see Recipes) to Input to a final concentration of 1x, and store samples on ice until step D9.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170626/20170626030233_4276.jpgFigure 1. Lysis confirmation. Left, example image of unlysed cells stained with trypan blue. Note the blue outline and slight halo around each cell. Right, example image of intact nuclei from lysed cells.Preparing sample for immunoprecipitationCentrifuge the lysate at 10,000 x g for 10 min at 4 °C.Transfer the supernatant to a fresh tube.Add 50 µl of 50% slurry of Protein A beads (or whichever type of beads you will use for the immunoprecipitation) to the lysate.Rotate or rock the mixture of beads and lysate at 4 °C for 30 min to pre-clear the lysate of proteins that non-specifically bind to the beads.Centrifuge the mixture at 3,000 x g for 2 min at 4 °C.Transfer the supernatant to a fresh tube.Quantify the concentration of protein in the lysate using standard protein quantification methods (Bradford or BCA kits, for example)Generate a standard curve of 1 mg/ml, 0.5 mg/ml, 0.25 mg/ml, 0.125 mg/ml, and 0 mg/ml bovine serum albumin (BSA) by diluting it using sterile water.Dilute the lysate (between 1:2 to 1:10 for cell lysate) so that the sample protein concentration will fall within the range of the BSA standard curve.Follow the manufacturer’s instructions to record the concentration of protein in the lysate. Take note of the R2 value as it indicates the accuracy of the protein concentration quantification (0.9 and above is desired).Take the average of three readings.Immunoprecipitating the Cdk5/activator complexPrepare two fresh 1.5 ml tubes with 1 mg of total protein from the lysate.",
    "Note: If one of your samples contains insufficient protein concentration, equalize the total protein amount in all samples to match the protein amounts possible from the sample with the lowest protein concentration.Add lysis buffer to bring the total volume in each tube to 500 µl.Add 10 µl (2 µg) Santa Cruz anti-Cdk5 antibody (C-8) to one of the 1.5 ml tubes prepared for each of your samples.Add 2 µg of IgG antibody to the other 1.5 ml tubes prepared for each of your samples.Rotate or rock the mixture of beads and lysate at 4 °C for 3 h.Add 50 µl of 50% slurry of Protein A beads to each tube.Rotate or rock the mixture of beads and lysate at 4 °C for 2 h.Centrifuge the tubes at 3,000 x g for 2 min at 4 °C.Remove and discard the supernatant.Add 500 µl of lysis buffer containing 0.1% NP-40.Rotate or rock the mixture of beads and lysate at 4 °C for 10 min.Repeat steps C8-C11 twice more.Centrifuge the tubes at 3,000 x g for 2 min at 4 °C.Remove and discard the supernatant.Add 500 µl of kinase buffer (see Recipes) without ATP or histone H1.Rotate or rock the mixture of beads and lysate at 4 °C for 10 min.Repeat steps C13-C16 once more (general scheme of immunoprecipitation in Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170626/20170626030602_2824.jpgFigure 2. Scheme for immunoprecipitation of active Cdk5 complexesCdk5 kinase assayResuspend beads in 25 µl kinase buffer (with 100 ng/µl H1 and 25 µM ATP).Prepare a reaction with recombinant Cdk5/p25 for a positive control (general scheme for Cdk5 kinase assay and controls in Figure 3).Add 14.6 µl MOPS dilution buffer (see Recipes) to 1 µl Cdk5/p25 activated complex (Upstate/Millipore).Add 5 µl 5x reaction buffer (see Recipes) to a fresh 1.5 ml tube.Add 2.5 µl of histone H1 (final 100 ng/µl).Add 2.",
    "5 µl of diluted Cdk5 from step D2a to the 1.5 ml tube. Add 5 µl of sterile water.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170626/20170626030822_4991.jpgFigure 3. Scheme for Cdk5 kinase assay, SDS-PAGE, and detectionPrepare a working solution of [γ-32P]ATPPrepare 47 µl of 25 mM magnesium acetate (see Recipes).Add [γ-32P]ATP (final concentration 0.1 µCi/µl).Add 10 mM ATP to bring the total volume to 50 µl.Add 10 µl of the 32P mix from step D3 to the positive control reaction prepared in step D2.Add 2 µl of 32P mix from step D3 to each IP reaction from step D1.Mix 25 µl of kinase buffer with 2 µl of 32P mix from step D3 as a negative control.Incubate all reactions at 30 °C for 30 min.Add 5 µl of 5x Laemmli buffer to each reaction.OPTIONAL: Store reactions at -20 °C.Resolve immediately by 12.5% SDS-PAGE.DO NOT allow the dye front to exit the bottom of the gel. This will minimize radioactive contamination of the running buffer or equipment.After resolving reactions, cut off dye at bottom (contains free 32P) and stacking gel.Transfer the resolved proteins to nitrocellulose or PVDF membrane.Expose the membrane to film or phosphorscreen at -80 °C (see example in Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170626/20170626031033_3240.jpgFigure 4. Detection of Cdk5 kinase activity and protein levels in immunoprecipitates. Results of Cdk5 immunoprecipitation and kinase assay performed from cells transfected with control siRNA with empty vector (Ctrlsi + pc), p39 siRNA with empty vector (p39si + pc), p39 siRNA with p39-FLAG (p39si + p39F). Kinase buffer alone was included as a negative control. In this figure, the exogenously expressed p39-FLAG reversed the effect on Cdk5 activity caused by siRNA-mediated knockdown of endogenous p39. This research was originally published in Journal of Biological Chemistry. Bankston AN, Li W, Zhang H, Ku L, Liu G, Papa F, Zhao L, Bibb JA, Cambi F, Tiwari-Woodruff SK, Feng Y.",
    "p39, the primary activator for cyclin-dependent kinase 5 (Cdk5) in oligodendroglia, is essential for oligodendroglia differentiation and myelin repair. J Biol Chem. 2013; 288(25):18047-57. © the American Society for Biochemistry and Molecular Biology.Performing Western blot to assess immunoprecipitationIncubate the membrane for one hour with 10% non-fat milk in PBS-T (see Recipes).Discard 10% milk solution. Incubate the membrane with 2% non-fat milk in PBS-T containing a 1:1,000 dilution of anti-Cdk5 antibody (Cell Signaling Technology) at 4 °C overnight.Discard the 2% milk solution containing anti-Cdk5 antibody.Wash the membrane by incubating it in PBS-T for 10 min.Discard the PBS-T wash solution.Repeat steps E5-E6 twice more.Incubate the membrane with 2% non-fat milk in PBS-T containing a 1:5,000 dilution of HRP-conjugated anti-rabbit IgG antibody (Jackson ImmunoResearch) at room temperature for one hour.Wash the membrane by incubating it in PBS-T for 10 min.Discard the PBS-T wash solution.Incubate the membrane with an enhanced chemiluminescence solution according to the manufacturer’s protocol.Expose the membrane to film (see example in Figure 4)."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}