{
  "id": 9556,
  "origin_website": "Jove",
  "title": "Ex vivo Culturing of Whole, Developing Drosophila Brains",
  "procedures": [
    "A. Preparation of Media\nPrepare complete media by filter-sterilizing Schneider's Drosophila Media supplemented with 10% Fetal Bovine Serum and 1% penicillin/streptomycin.\nMedia should be prepared fresh each time. Alternatively, a fresh aliquot of pre-frozen media can be thawed before each use.\nPrior to culturing, add 10 μg/ml insulin and 2 μg/ml ecdysone to the media. Drugs were prepared as concentrated stocks and frozen in small aliquots. Thawed aliquots were not refrozen.\nAll working solutions should be maintained at 25 °C.\nCulturing of Larval Brains\n1. Selection and Dissection of Larval Brains\nAdd 500 μl of media to a 12 mm Millicell cell culture insert. The dissected brains will be placed in these inserts to facilitate easy immunostaining.\nAdd a small amount of prepared media to a dissection watch glass.\nUsing a small spatula, pick up wandering third instar larvae and place them in the watch glass. (We presume that the ex vivo culture method would apply equally well to first or second instar larvae, but we have not tested this.)\nHolding the posterior end of the larva with a pair of forceps, carefully open up the anterior end with a second pair of #5 forceps.\nQuickly dissect out the brain, keeping the ventral nerve cord intact.\n2. Ex vivo culturing of Dissected Larval Brains\nUsing pre-wet pipette tips, transfer the brain carefully into the cell culture inserts, pre-filled with media.\nTransfer brains, in media, to an incubator at 25 °C till the desired time-point is reached. This method works efficiently for up to 48 hr in culture.\nReplace the media at 8 hours. Beyond that, replace half of the media every 5-6 hours.\n3. Pharmacological Manipulation of Larval Brains\nThis method of ex vivo culturing can be used to pharmacologically corroborate genetic interactions previously demonstrated in our lab 1.",
    "Add 100 μM roscovitine and 100 μM olomoucine to prepared media.\nTransfer dissected brains to this media.\nCulture brains at 25 °C for 24 hours.\nReplace the media at 8 hours. Beyond that, replace half of the media (with drugs) every 5-6 hours.\nCulturing of Pupal Brains\n1. Selection of Pupae for Dissection\nMark white pupae on bottles/vials.\nOnly choose pupae that are completely white. Pupae with any sort of coloration should not be included.\nThis stage is 0 hours After Puparium Formation (APF).\nThese pupae will be ready for dissection 1.5 hours after marking. This step is crucial to ensure that developmental pruning occurs in ex vivo culture.\n2. Dissection of Pupae\nAdd 500 μl of media to a 12 mm Millicell cell culture insert. (The dissected brains will be placed in these inserts to facilitate easy immunostaining).\nOnce the desired time-point has been reached, add a small amount of prepared media to a dissection watch glass.\nUsing a small, wet spatula, pick up pupae previously marked for dissection and place them in the watch glass.\nHolding the posterior end of the pupae with a pair of forceps, carefully open the anterior end of the pupa case with a second pair of #5 forceps.\nQuickly dissect out the brain, keeping the ventral nerve cord intact and attached.\n3. Ex vivo Culturing of Dissected Pupal Brains\nTransfer the brain carefully into the cell culture inserts, pre-filled with media.\nTransfer brains, in media, to an incubator at 25 °C till the desired time-point is reached. We used this method for up to 10 hours in culture for the experiment shown, but it can be extended to longer periods of observation and treatment, if needed.\nFor time-points longer than 8 hours APF, replace media every 5-6 hours.",
    "From this step on, the protocol remains unchanged for both larvae and pupae.\nB. Fixing Dissected Brains\nOnce the desired time-point is reached, remove media and add 500 μl of 4% formaldehyde in 1x PBS with 0.5% Triton X-100 (PBST) for 30 minutes, replacing with fresh formaldehyde after 15 minutes.\nMake sure not to allow brains to dry while replacing media with fixative.\nWash off formaldehyde with four 10 minute washes of 1x PBS with 0.5% TritonX-100 (PBST).\nC. Staining Fixed Brains\nAfter formaldehyde has been washed off, block brains for 1 hour in a blocking solution of 1x PBS with 1% Normal Goat Serum and 1% Bovine Serum Albumin.\nAdd primary antibodies made up in blocking solution.\nIncubate brains overnight at 4 °C.\nThe next morning, wash off primary antibodies with four 10 minute washes of PBST.\nAdd secondary antibodies made up in blocking solution.\nLeave at room temperature for 4 hours.\nWash off secondary antibodies with four 10 minute washes of PBST.\nD. Mounting Fixed and Stained Brains for Microscopy\nEquilibrate brains in Vectashield mounting media for 1 hour.\nMount brains on glass slides using the Vectashield mounting media.\nPlace glass chips on either side of the brains before mounting the cover slip. This prevents the brains from being squashed, while keeping sample thin enough to scan all focal planes with a confocal microscope. Brains were roughly oriented upon mounting to facilitate viewing the features of interest. When necessary, brain images were rotated with Imaris software to provide an optimal view for documentation and measurement.\nSeal cover slips with clear nail polish.\nStore slides away from light.\nE. Representative Results",
    "Figure 1 shows a panel of third-instar larval brains of (A) wild-type flies and (B) flies that express a dominant-negative derivative of Cdk5 (Cdk5DN) (Connell-Crowley et al., 2000). Both express actin-GFP (green) in MB gamma neurons. As described previously (Trunova et al., 2011), there is a region in the proximal axons of wild-type gamma neurons that fails to accumulate actin-GFP, thus showing up as a \"clear zone\" (A, bracket), and fasciclin 2 protein (red) accumulates in the axons only up to the ventral border of this zone (white horizontal line). The dotted line in the third panel of Figure 1(A) indicates the position of the MB, highlighting the actin \"clear zone\" and its ventral border. In flies expressing Cdk5DN, the actin clear zone is absent (B) and Fasciclin 2 (FasII) immunoreactivity spreads dorsally through that region. (Note that variable numbers of FasII-positive axons project horizontally across the MB; these are not relevant to the phenotype). Scale bar represents 20 μm.\nUsing our method of ex vivo culturing, we treated wild-type flies with a combination of roscovitine and olomoucine, pharmacological inhibitors of Cdk5 activity. Figure 2 shows a panel of third-instar larval brains of control (A) and drug-treated (B) wild-type flies. Similar to flies expressing a dominant negative Cdk5 construct, brains treated with Cdk5 inhibitors for 24 hours, show the characteristic loss of actin clear zone and shift in FasII boundary (square brackets). White lines show position of wild-type FasII boundary. Scale bar represents 20 μm.",
    "Figure 3 shows a representative series of Drosophila mushroom bodies from 0-10 hours APF, labeled with membrane-targeted mCD8-GFP (green). Brackets indicate the calyx, that is, the dendritic projections of the MB. Prior to metamorphosis, one can see MB axons coursing dorso-ventrally in thick bundles, as well as a 'haze' of fluorescent signal arising from the dense dendritic arbor (bracket). Panel A shows brains dissected at the time indicated. Note the pruning of dendrites in the region indicated by the brackets, such that by 6-8 hrs APF, the haze of dendritic signal is gone (though the axonal signal is unaffected). Brains in panel B were dissected at 0 hours APF, before the internal ecdysone spike (Truman and Riddiford, 2002), and cultured ex vivo as indicated. These show no developmental pruning of dendrites; rather the dendritic signal persists at 10 hrs APF. To circumvent this, pupae are marked at 0 hours APF, but dissected at 1.5 hours APF and cultured. Panel C shows a representative series of these Drosophila mushroom bodies from 0-10 hours APF. As in the non-cultured samples, dendritic signal is undetectable by 8 hr APF. Scale bar represents 20 μm.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}