{
  "id": 9070,
  "origin_website": "Jove",
  "title": "HSV-Mediated Transgene Expression of Chimeric Constructs to Study Behavioral Function of GPCR Heteromers in Mice",
  "procedures": [
    "NOTE: All procedures for animal breeding and cares were conducted according to the Institutional Animal Care and Use Committee (IACUC) regulation of Icahn School of Medicine at Mount Sinai. Be sure to use sterile gloves throughout the procedure. \n1. Drug and Virus Preparation\nDrug Preparation\nPrepare 15.0 ml ketamine/xylazine anesthetic by dissolving 1.35 ml of 100 mg/ml Ketamine and 0.75 ml of 20 mg/ml xylazine in 12.9 ml of 0.9% Saline solution. Thoroughly mix solution.\nVirus Preparation\nClone the mGlu2 and mGlu2ΔTM4N constructs into a bicistronic herpes simplex virus (HSV) vector following standard protocols previously described6. Package the viral particles as previously described6,13,14. Substitution of residues Ala-6774.40, Ala-6814.44 and Ala6854.48 in mGlu2 for Ser6864.40, Phe6904.44 and Gly-6944.48 in mGlu3 (HA-mGlu2ΔTM4N) have been described previously6.\n\t\tNOTE: It was previously demonstrated that the chimeric construct HA-mGlu2ΔTM4N is expressed at the plasma membrane with intact G protein-dependent signaling6.\nStore viral vectors in -80 °C when not in use. Thaw viral vector on ice, and then aliquot into 10 μl aliquots. For the surgical procedure, keep on ice.\n2. Surgery\nSurgery Preparation\nWeigh mouse and inject mouse with appropriate dose of ketamine/xylazine cocktail (for details, see 1.1.1).\nCheck mouse to see if properly anesthetized, squeeze foot and tail for pain response, if unable to elicit a response, the mouse is properly anesthetized.\nShave mouse head from the base of the skull to the tip of the nose using clippers. Apply ophthalmic gel to the mouse afterward to prevent blindness of the mouse.\nLoad each syringe onto the stereotaxic frame. Then tilt perpendicular portion of each arm of the stereotaxic frame so that they are 10 degrees away from the normal. Ensure that the arms are tilted, such that the needles are facing each other.",
    "Clean each syringe by filling the needle with 70% ethanol. Fill the needle at least three times to ensure that the syringe is clean.\nOnce the needle has been cleaned, flush the needle by filling the needle with double distilled H2O. Once flushed, fill each needle with 1.3 µl of double distilled H2O. Twist the plunger of the syringe to release 0.3 µl of double distilled H2O. If water beads at the tip of the needle, carefully wipe away water. If nothing comes out of the syringe, push the plunger completely down and then repeat cleaning of syringe.\nAfter filling with water, then pull up the syringe filling the syringe with 0.5 µl of air.\nOnce the air and water are in the syringe, carefully fill the syringe with 1.3 µl of virus solution. At this point ensure that the total volume in the syringe is 2.8 µl. Again twist the tip of the syringe to release 0.3 µl of virus. If liquid beads at the tip of the needle, carefully wipe away liquid. If nothing comes out of the syringe, push the plunger completely down and then repeat cleaning of syringe.\nSurgery\nAttach the mouse to the stereotaxic frame, making sure to adjust the stereotaxic frame so that the skull is level and flat. Apply povodine-iodine to the exposed scalp. Using a scalpel, make a sagittal incision along the midline of the skull within the exposed shaved area. Then attach the buret clamps to the skin at the incision site to make sure that the skull remains exposed.\nUse H2O2 to dissolve away the periosteum to expose the sutures of the skull. Now that the bregma and sutures are visible, be sure to adjust the stereotaxic frame to make sure that the skull is level.",
    "Align the needle tips of the syringes with the bregma and record the coordinates of the bregma. Calculate the coordinates of the where the needles are going to be inserted.\n\t\t\nFor the Rostral-Cauldal (R-C) plane, add 1.6 mm to the recorded R-C bregma coordinates (+1.6 from Bregma). For the Dorsal-Ventral (D-V) plane, subtract 2.4 mm from the recorded D-V bregma coordinates (-2.4 from Bregma).\nFinally, for the Medial Lateral (M-L) plane, add 2.6 mm to the recorded M-L bregma coordinates (+2.6 from Bregma). For all coordinates be sure to record both left and right coordinates, as this is a bilateral injection.\nBring the needles to the desired coordinates. Mark the places of where the needles are going to be inserted and with a drill, drill the marked areas.\nWith a cotton tip applicator wipe away any excess blood or bone fragment.\nBring the needles to the skull where the tips of the needles are touching the surface of the brain. Then lower the needles to the desired coordinates slowly lowering them.\nOnce the needles are at the desired coordinates, slowly inject the contents of the syringe by twisting the plunger of the needle 0.1 µl per minute over the course of 5 min (in total 0.5 µl).\nOnce the injection has been made leave the syringe in cortex for another 5 min.\nClosing Up/Care\nRemove the needles from the mouse cortex steadily and slowly. Then remove the mouse from the stereotaxic frame.\nApply cyanoacrylate (dermal adhesive) to the base flaps of skin from the incision and then with forceps grab the flaps of skin and place them together.",
    "Allow the cyanoacrylate to dry. Place the mouse in cage over a heating pad (heating pad is optional if the surgical suite is kept under RT of 37 °C - otherwise not necessary). Be sure to place the mouse on a paper towel to make sure that bedding does not adhere to surgical site.\nDepending on the length of the surgical procedure, ensure that the mice is out of anesthesia within 30 - 60 min after procedure. Following surgery, the animal is placed in its own cage and monitored until it becomes conscious before returning to its room to recover. No analgesics are used post-operatively, because they may alter the results of our experiments by modifying some of the brain biochemical pathways. However, animals are monitored until they recover from anesthesia on the day of surgery, and daily post-operation for signs of infection and evaluation of pain/distress.\n3. Head Twitch Response Experiment\nSet-up\nCarry out all behavioral testing between 10:00 AM and 2:00 PM, 2 - 3 days after stereotactic injection of viral particles.\nDissolve (±)-1-(2,5-dimethoxy-4-iodophenyl)-2-aminopropane hydrochloride (DOI) into a 0.9% saline solution to 2.0 mg/kg. Also prepare a 0.9% saline solution.\nPrepare a home cage (28 x 18 x 15 cm) without any bedding and using a tri-pod, adjust a camera so that the view of the video camera is directly above the home cage.\nHabituate the mice to the room for at least 4 hr prior to the beginning of the experiment.\nSet up a camcorder to record the head twitch.\nExperiment\nPosition the camera so that it is directly over a home cage. Calibrate the camera so that the entire home cage is in the field of view.",
    "Weigh mouse and inject mouse intraperitoneally with appropriate dose of either 0.9% saline or DOI (0.01 ml/g). NOTE: If a mouse weighs 25 grams, administer dose to a total volume of 0.25 ml.\nPlace each mouse back in their home cage for 10 min. After 10 min, place mouse into the center of the empty home cage and validate that there are no blind spots in the field of view of the camera. Press record on the camcorder. Leave the room.\n\t\tNOTE: Mouse movements and various behavioral responses therein (head twitch, ear scratch, etc. Please refer to supplemental data table 1 of Gonzalez-Maeso et al. 2007 for full list of behavioral responses induced by DOI.)3, will be recorded for 30 min. Therefore, it is important there are no blind spots in the field of view recorded.\nAfter 30 min stop recording on the camcorder and place mouse back in original home cage. Repeat this process for each mouse.\nReview\nHave each referee review the tapes blind to the experimental conditions of mouse (i.e., drugs used during head twitch experiment or virus used during intracranial injection)). Manually record every head twitch throughout the video.\n\t\tNOTE: Head-twitch is defined as a rapid shaking head movement conducted by a mouse (supplemental video).\nFor each mouse, average the final HTR response from the three totals of the blind referees. Then group these values by experimental condition and carry out statistical analysis (i.e., t-test or ANOVA).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}