{
  "id": 4832,
  "origin_website": "Bio",
  "title": "Density Gradient Centrifugation for Enrichment and Identification of GFP-tagged Chitosomal Microvesicles of Filamentous Fungi",
  "procedures": [
    "Homogenate (lysate) preparationInoculate 400 ml Vogel’s Complete Medium (Vogel, 1956) with Neurospora crassa conidia (1 x 106 conidia/ml) in a 1 L flask. Incubate for 14-20 h at 30 °C, 200 rpm.Harvest mycelium by vacuum filtration through Whatman filter paper number 1. Wash twice with 200 ml cold sterile distilled H2O to eliminate remnant culture media and then twice with 50 ml cold 33 mM phosphate buffer (pH 8.2) to equilibrate mycelium for the next step.Mix 10 g wet mycelium and 10 ml 5% (w/v) sucrose in 33 mM phosphate buffer (pH 8.2), supplemented with a protease inhibitor cocktail (1 tablet/50 ml) into a Braun bottle and add 20 g of glass beads (500 μm; 2 g/g mycelium). Keep all solutions, tubes and bottles at 4 °C to prevent protein degradation. Homogenize in a Braun homogenizer 4 x 30 sec in presence of a CO2 stream directed to the Braun bottle so that a temperature increase during homogenization is prevented. The CO2 line must be firmly attached to the metallic arm of the Braun homogenizer so that the CO2 stream can be directed to the bottle. After homogenization, verify the broken cells by observing the sample in a bright field microscope. Transfer homogenate into a 50 ml tube (on ice) and centrifuge at 1,000 x g (Rav), 10 min, 4 °C. Save the supernatant at 4 °C using a glass pipette to avoid the lipid layer formed on top. This will be the homogenate or lysate, which would contain mitochondria, microvesicles, ribosomes, and soluble proteins. Discard pellet containing whole cells, cell walls, and nuclei.Density gradient centrifugationConstruct a 10-65% sucrose linear gradient (10% and 65% sucrose stock solutions must be prepared in final 33 mM phosphate buffer, pH 8.",
    "2) in a quick-seal centrifuge tube using a linear gradient maker and a peristaltic pump set up to obtain a flow rate of 3.5 ml/min (Figure 1). Gently layer the N. crassa homogenate (supernatant saved in step A6) on top of the 10-65% sucrose gradient by using a Pasteur pipette via single drops close to the surface of the sucrose gradient. Grease the centrifuge inlet to seal and cap the centrifuge tube. Centrifuge at 184,000 x g (Rav), for 4 h and 4 °C in a pre-cooled Beckman rotor 70Ti. Fractionate the gradient from the top with an ISCO fractionation system using 70% (w/v) sucrose as chase at a flow rate of 6 ml/min. Make sure no air bubbles form in the tube system that conducts the chase sucrose to the gradient or else they will break it. Collect 2 ml fractions (3 fractions/min) into ice-cold tubes and keep at 4 °C.Characterize each fraction by measuring absorbance at 280 nm, refraction index (to infer the density) and, ideally, an enzyme activity associated with intracellular particles or vesicles (Figure 2A). Refractometers output the refractive index, which can be converted to density (g/ml) using this table: http://homepages.gac.edu/~cellab/chpts/chpt3/table3-2.html.[href=http://homepages.gac.edu/~cellab/chpts/chpt3/table3-2.html] Mix 50 to 100 μl of each fraction with Laemmli buffer (2x), boil for 5 min and store at -20 °C until analysis by Western blot (Figure 2B).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150928/20150928190221_0369.jpgFigure 1. Preparation and fractionation of sucrose density gradients. A. To prepare the density gradients, sucrose stock solutions are independently poured into each column of the gradient maker (keep locked the Teflon valve that connects one column to the other).",
    "A magnetic stir bar is placed in the 10% sucrose solution column, from which a silicon tube (purged of any bubble) exits towards the peristaltic pump and, via a capillary tube attached to the tip of the silicon one, is introduced into the quick-seal centrifuge tube down to the bottom. After turning the peristaltic pump on, the Teflon valve is opened to allow the sucrose solutions mixing. Then, increasing concentration sucrose flows to the quick-seal tube. Lower concentration sucrose arrives first to the tube, which is pushed up by higher concentration sucrose (the capillary tip is always touching the quick-seal tube bottom). Immediately before the transfer of total volume of the sucrose gradient to the quick-seal tube, turn off the peristaltic pump and take out the capillary tube very gently to avoid breaking the gradient. The remaining volume of the quick-seal tube is filled up with the mycelial lysate. B. After centrifugation and isopycnic separation of mycelial homogenates, the gradient is carefully fractionated using a 70% sucrose solution as chase. This solution is injected into the quick-seal tube from the bottom so that the gradient is integrally pushed up toward the exit tubing and the fraction collector. Before fractionation, it is critical to purge any bubble from the syringe that contains the chase solution and the tubing that conducts it to the bottom of the quick-seal tube; otherwise, the gradient could be broken. Collected fractions are subsequently characterized (enzyme activity, refractive index, absorbance, etc.) and stored at 4 °C.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150928/20150928190449_8612.jpgFigure 2. Density gradient centrifugation of homogenates of N. crassa expressing CHS-6 chitin synthase co-translationally fused to GFP (Riquelme et al., 2007). A. Density (inferred from the refractive index), total protein (Abs 280 nm) and chitin synthase activity were estimated for each fraction of the density gradient collected.",
    "Chitin synthase activity sedimented at 1.13 g/ml, the buoyant density of chitosomes. B. Western blot analysis demonstrated the presence of CHS-6-GFP around fraction 13 (1.13 g/ml). C. Live imaging of a N. crassa hyphae by confocal microscopy showed that CHS-6-GFP localizes at the tip mainly at the core of the Spitzenkörper (an apical body that directs the growth of the hypha), where microvesicles (chitosomes) accumulate, as confirmed by transmission electron microscopy (Riquelme et al., 2002). Scale bar, 5 μm"
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}