{
  "id": 19605,
  "origin_website": "Jove",
  "title": "Analyses of Actin Dynamics, Clutch Coupling and Traction Force for Growth Cone Advance",
  "procedures": [
    "All experiments using laboratory animals were performed with the Institutional Animal Care and Use Committee of Nara Institute of Science and Technology. Investigators should follow established guidelines by their institutional and national animal regulatory committees for the care and use of laboratory animals.\n1. Preparation of solutions and media\nPrepare the solutions and culture media as summarized in Supplemental File 1\n2. Preparation of poly-D-lysine (PDL)/laminin-coated substrates\nCoat 14 mm-diameter glass-bottom dishes with 100 µg/mL PDL, dissolved in phosphate-buffered saline (PBS, pH 7.4), and incubate for overnight in a humidified incubator at 37 °C.\n\tNOTE: Do not dry up the glass surfaces after this step\nRemove the PDL solution and pipette 1 mL of PBS on the glass for 10 s three times.\nCoat the dishes with 5 µg/mL laminin, dissolved in PBS, and incubate for overnight in a humidified incubator at 37 °C.\nRemove the laminin solution and pipette 1 mL of PBS on the glass for 10 s three times.\nRemove the PBS and place 0.5 mL of the neurobasal medium on the glass surfaces. Store the dishes in a humidified incubator at 37 °C.\n\t​NOTE: PDL/laminin-coated dishes can be stored for 2-3 days in a humidified incubator at 37 °C.\n3. Dissection and dissociation of the hippocampus\nEuthanize a pregnant mouse by cervical dislocation.\n\tNOTE: The present study uses commercially available mice (see Table of Materials). Investigators should use mice that are bred and humanely treated in a sterilized environment.\nDissect out embryonic day-16 (E16) mouse embryos, and place them on ice.\nIn a laminar flow hood, dissect out the brains with scissors and place them on a sterile 10 cm dish containing 10 mL of ice-cold dissection solution.",
    "With a dissection stereo microscope, carefully peel away the meninges of the cerebral hemispheres and then dissect out the hippocampi using forceps.\nTransfer the hippocampi into 5 mL of ice-cold digestion solution in a 15 mL tube. Incubate the hippocampi in a water bath for 20 min at 37 °C.\nRemove the digestion solution and add 3 mL of dissection solution.\nGently pipette the hippocampi four times with a Pasteur pipette.\nIncubate the hippocampi in a water bath for 20 min at 37 °C.\nTransfer the cell suspension into a 50 mL centrifuge tube. Add 3 mL of new dissection solution to the undissociated tissue.\nRepeat Steps 3.7-3.9 until the hippocampi are completely dissociated.\nRemove the floating aggregates of DNA from the cell suspension by swirling and aspirating with a Pasteur pipette. Centrifuge the cell suspension at 180 x g for 20 min at 4 °C.\n\tNOTE: DNA derived from damaged cells will disturb the centrifugation process. If neurons remain in the supernatant, centrifuge the cell suspension again after carefully removing the DNA.\nEquilibrate neurobasal medium containing 10% fetal bovine serum (FBS), penicillin (100 U/mL), and streptomycin (100 µg/mL) in a humidified incubator at 37 °C with 5% CO2.\n4. Transfection and culturing neurons\nRemove the supernatant and add 5 mL of ice-cold PBS into the 50 mL tube. Resuspend the cell pellet by gentle pipetting.\nTransfer 10 µL of the cell suspension into a microcentrifuge tube, add 10 µL of 0.5% trypan blue solution, and then count the number of cells with a hemocytometer.\nCentrifuge the cell suspension in the 50 mL tube at 180 x g for 20 min at 4 °C.\nIn the meantime, aliquot for transfection, 1 µg of pFN21A-HaloTag-actin and 3 µg of pmNeonGreen-N1-Lifeact per 1 x 106 cells, into a microcentrifuge tube.",
    "Following centrifugation, remove the supernatant and add 100 µL of electroporation medium (provided by transfection kit) into the 50 mL tube. Resuspend the cell pellet by pipetting.\nMix the cell suspension with the aliquoted DNA solution and transfer the mixture to a cuvette (provided by the transfection kit).\n\tNOTE: Since air bubbles disturb electroporation, remove them from the cell suspension.\nInsert the cuvette into the electroporation apparatus (Table of Materials), and perform electroporation using program O-005.\nImmediately add 1 mL of the pre-warmed and equilibrated neurobasal medium containing 10% FBS, penicillin (100 U/mL), and streptomycin (100 µg/mL) to the cuvette.\nTransfer the cell suspension to a 15 mL centrifuge tube using a plastic pipette (provided by the transfection kit).\nTransfer 10 µL of the cell suspension into a microtube, add 10 µL of 0.5% trypan blue solution, and then count the number of cells with a hemocytometer.\nTake out PDL/laminin-coated glass-bottom dishes from the incubator and remove the neurobasal medium.\nPipette 0.5 mL of the cell suspension containing 2.0 x 105 cells per dish and incubate in a humidified incubator at 37 °C with 5% CO2 for 3 h.\nReplace the medium with 0.5 mL of neurobasal medium containing 2% B-27 supplement, glutamine (1 mM), penicillin (100 U/mL), and streptomycin (100 µg/mL). Culture the neurons in a humidified incubator for 3 days at 37 °C with 5% CO2.\n5. Single speckle imaging at neuronal growth cones\nOn day in vitro (DIV) 3, treat the neurons with tetramethyl-rhodamine (TMR) ligand at a dilution of 1:2000 dilution in culture medium. Maintain the neurons for 1 h at 37 °C with 5% CO2.\nWash the TMR ligand three times with pre-warmed PBS.",
    "Remove the PBS and pipette 0.5 mL of warmed Leibovitz's L-15 medium containing 2% B-27 supplement, glutamine (1 mM), penicillin (100 U/mL), and streptomycin (100 µg/mL).\nMaintain neurons for 1 h at 37 °C.\nTurn on an epifluorescence microscope and set the stage-top incubator to 37 °C.\n\tNOTE: The present protocol uses an epifluorescence microscope equipped with a complementary metal-oxide semiconductor camera, a 100x/1.40 NA oil immersion objective lens, a mercury lamp and an image acquisition software (see Table of Materials). Other epifluorescence microscopes with equivalent specifications may also be used for this analysis.\nPlace the TMR ligand-treated neurons in the glass-bottom dish on the warmed stage-top incubator.\nSet the image acquisition parameters as follows: exposure time, 500 ms for Lifeact and HaloTag-actin fluorescent channels; binning, 1 x 1 (0.065 µm × 0.065 µm per pixel); time interval, 3 s; duration, 50 frames.\nSelect a growth cone that strongly expresses Lifeact and weakly expresses HaloTag-actin.\n\tNOTE: Lifeact expression should be strong enough to visualize growth cone morphology. HaloTag-actin expression should be weak insufficient to be detected (Figure 2A). The levels of fluorescent protein expressions can be adjusted by varying the amount of DNA for transfection.\nClose the field of the diaphragm to illuminate a minimum area that includes the growth cone (Figure 2B).\n\tNOTE: The illumination of a minimum area reduces the background signal and increases the fluorescence signal to noise (S/N) ratio, enabling the detection of actin speckles (Figure 2B). To further increase the S/N ratio, illuminating the growth cone without reducing the light by neutral density filters is recommended.\nAcquire time-lapse images (Supplemental File 2). Save as a multichannel time-lapse stack image (tiff format).\n6. Quantifications of F-actin flow velocity and polymerization rate using an image processing and analysis software Fiji",
    "NOTE: Refer to Supplemental File 3 for practice data for quantifying F-actin flow velocity and the actin polymerization rate.\nOpen the multichannel time-lapse stack image on Fiji.\nSelect Analyze > Set Scale, and set the pixel size of the images.\nFind an actin speckle that flows retrogradely for a minimum of five time-frames within an F-actin bundle in filopodia or lamellipodia.\nSelect Image > Transform > Rotate, and adjust the angle of the images so that the F-actin bundle points upward (Figure 3A).\nClick on Rectangle on the toolbar, and draw a box that includes actin speckles and the tip of the F-actin bundle (Figure 3B, 1 and 2).\n\tNOTE: The signals of HaloTag-actin speckles are weak. In addition, Lifeact signals at the distal tips of the growth cone are weak and faint (Figure 2B) because the distal tips of the growth cone is thin compared to the proximal part. Investigators should enhance the signals to optimize the quantifications of F-actin flow velocity and polymerization rate (Figure 3B). Although the Lifeact signal at the proximal growth cone becomes saturated, this will not disturb the determination of the distal end of F-actins (Figure 3E, yellow line).\nSelect Image > Duplicate and input the five time-frames (Figure 3B, 3-5).\nSelect Image > Stacks > Make Montage, and input the parameters: Columns, 5; Rows, 1; Scale factor, 1.\nClick on OK. The image montage will appear on the screen.\nSelect Image > Color > Split Channels. This separates the two fluorescent channels.\nQuantification of F-actin flow velocity.\n\t\nSelect Analyze > Set Measurements, and choose Area and Bounding Rectangle.\nClick on Oval on the toolbar, and draw a circle on an actin speckle (Figure 3C, 1 and 2).",
    "Select Image > Overlay > Add Selection. The circle is overlaid on the image montage (Figure 3C, 3, and 4).\n\t\tNOTE: The color of the overlay can be changed at Edit > Options > Colors.\nRepeat the overlaying of circles for the remaining speckles (Figure 3C, 5).\n\t\tNOTE: To accurately determine the centers of actin speckle, investigators should overlay circles on the speckles.\nClick on Straight on the toolbar, and draw a line that links the centers of the circles (Figure 3D, 1 and 2).\nSelect Analyze > Measure. The result will appear on the screen (Figure 3D, 3).\n\t\tNOTE: Height displayed in the result indicates the translocation distance of the actin speckle during the observation (Figure 3D, 3).\nCalculate the F-actin flow velocity by dividing the translocation distance by the observation time.\nQuantification of the F-actin polymerization rate.\n\t\nDraw a line that links the tips of the F-actin bundle (Figure 3E, 1).\nSelect Analyze > Measure. The result will appear on the screen (Figure 3E, 2).\n\t\tNOTE: Height in the result indicates the extension length of the F-actin bundle during the observation (Figure 3E, 2).\nCalculate the F-actin extension rate by dividing the extension length by the observation time.\nCalculate the F-actin polymerization rate as the sum of the F-actin flow velocity and the extension rate (Figure 3F).\n7. Preparation of a PAA gel for traction force microscopy and neuron cultures\nPreparation of PAA gels required for traction force microscopy (Figure 4)\n\t\nPipette 0.5 mL of NaOH (100 mM), dissolved in distilled H2O, on 27 mm-diameter glass-bottom dishes, and incubate for 15 min at room temperature (RT).\nAdd 50 µL of 3-aminopropyltrimethyoxysilane (APTMS) into NaOH solution on the dishes and mix the solutions by gentle pipetting, and incubate for 15 min at RT.",
    "Wash the glass-bottom dishes with distilled H2O, and dry.\nPipette 0.5 mL of 0.5% glutaraldehyde solution, dissolved in PBS, on the APTMS-treated glass-bottom dish, and incubate for 30 min at RT.\nWash the glass-bottom dishes with distilled H2O and dry.\nPrepare a solution containing distilled H2O (412 µL), 30% (w/v) acrylamide solution (63 µL), 2.5% (w/v) bis-acrylamide solution (6 µL) and carboxylate-modified microsphere (fluorescent bead) solution (20 µL).\n\t\tNOTE: Vortex the fluorescent bead solution to dissociate aggregated beads before adding to the acrylamide solution.\nDegas the solution in a vacuum chamber for 30 min at RT.\nTo this solution, add 1 µL of 10% (w/v) ammonium persulphate (APS), dissolved in distilled H2O, and 1 µL of N,N,N',N'-tetramethylethylenediamine (TEMED), and mix by gentle pipetting.\nPlace a glass coverslip (18 mm diameter) on the cap of a 15 mL centrifuge tube.\nImmediately add 25 µL of the solution to the coverslip, and then gently place an inverted glass-bottom dish on the coverslip. Allow the acrylamide to polymerize for 1 h at RT.\nApply distilled H2O to the coverslip and peel it away from the gel using a syringe needle with a bent tip.\nRemove the H2O and add sulfo-SANPAH (1 mM), dissolved in PBS, to the gel.\nUnder sterile conditions, expose the gels to ultraviolet light for 5 min. Wash the gel three times with PBS for 15 min per wash.\nDetermination of gel rigidity with a microsphere indentation method (Figure 5A)44.\n\t\nTransfer a microsphere which is specified for the diameter and density, to the gel and then place it on the specimen stage of a laser scanning confocal microscope.\nFocus on the gel surface and record the z-position (Figure 5B).\nSimilarly, focus on the bottom of the microsphere, and record the z-position (Figure 5C).",
    "Calculate the indentation depth as determined by the difference between the z-positions of the gel surface and the bottom of the microsphere.\nCalculate Young's modulus E of the gel by:\nimgsrc://cloudfront.jove.com/files/ftp_upload/63227/63227eq01.jpg\n\t\twhere f is the buoyancy-corrected weight of the microsphere, d is the indentation depth of the gel, r is the radius of the microsphere, and v is the Poisson's ratio (whose value is 0.3, as determined previously46).\nCoat the gels with PDL and laminin as described in section 2.\nAs described in sections 3 and 4, dissect out E16 mouse embryos, dissociate hippocampi, and transfect with 5 µg of pEGFP-C1 per 1.0 x 106 cells. Seed 2.0 x 105 cells on PDL/laminin-coated gels.\n\t​NOTE: For traction force analysis, microscopic imaging of fluorescently-labeled cells is necessary for determining the growth cone area.\n8. Traction force microscopy at neuronal growth cones\nOn DIV3, replace the culture medium with 0.5 mL of warmed Leibovitz's L-15 medium containing 2% B-27 supplement, glutamine (1 mM), penicillin (100 U/mL), and streptomycin (100 µg/mL). Maintain the neurons for 1 h at 37 °C.\nTurn on a laser scanning confocal microscope and set the stage-top incubator to 37 °C.\n\tNOTE: The present study uses a laser scanning confocal microscope equipped with a 63x/1.2 NA water immersion objective lens and an image acquisition and analysis software (see Table of Materials).\nPlace the neurons in the glass-bottom dish on the pre-warmed stage-top incubator.\nSet the image acquisition parameters as follows: scan size, 512 × 512 pixels; scan area, 1.5-3x zoom; scan speed, ~1 s per frame; laser wavelength, 561 nm (the excitation wavelength for the fluorescent beads) and 488 nm (the excitation wavelength for enhanced green fluorescent protein (EGFP)); time interval, 3 s; duration, 50 frames.",
    "To visualize the growth cone morphology, select a growth cone that strongly expresses EGFP.\nFocus on the gel surface and acquire time-lapse images (Figure 6A and Supplemental File 4).\n\tNOTE: For traction analysis, use two fluorescent channels (for fluorescent beads and EGFP) and a bright-field channel (capturing differential interference contrast (DIC) or phase-contrast images is recommended).\nUse an image processing software (e.g., Fiji) to produce single-channel time-lapse RGB image stacks and save these images as tiff files.\n\tNOTE: It is critical that investigators also save the raw data.\nApply 100 µL of 10% (w/v) sodium dodecyl sulfate (SDS), dissolved in distilled H2O, to the glass-bottom dish to relax the gel substrate by releasing neurons from the substrate. Incubate the dish for 5 min at 37°C to stabilize the temperature.\n\tNOTE: The image of the beads in an unstrained substrate is used to reference the original bead positions during traction force analysis (Figure 6C). Application of SDS solution alters the xyz-positions due to thermal change in the incubator and relaxation of the cell-induced deformation. Investigators, therefore, need to correct the focal plane and x-y position.\nFocus on the gel surface, and acquire an image of the beads in the unstrained substrate (Figure 6B).\nProduce a single-channel RGB image of the beads in the unstrained substrate, and save this image as a tiff file.\nCorrection of the x-y position of the bead image in the unstrained substrate using Fiji\n\t\nIn Fiji, open the bead image in the unstrained substrate and the time-lapse stack image of fluorescent beads.\nSelect Image > Stacks > Tools > Concatenate. A dialogue box will appear on the screen (Figure 7A, 1).\nSelect the bead image in the unstrained substrate and the time-lapse stack image of fluorescent beads in Image1 and Image2, respectively (Figure 7A, 2).",
    "Click on OK. The bead image in the unstrained substrate is added to the time-lapse stack image (Figure 7A, 3).\nUsing the scroll bar (Figure 7B, 1, red frame), display the second frame of the stack image (red arrow).\nSelect Plugins > StackReg (Figure 7B, 2). A dialogue box will appear on the screen (Figure 7B, 3).\nSelect Rigid Body from the drop-down list (Figure 7B, 3, red frame) and click on OK. The correction of the x-y position then begins.\nUse the scroll bar to display the first frame of the x-y position-corrected stack image.\nSelect Image > Duplicate (Figure 7C, 1). A dialogue box will appear on the screen (Figure 7B, 2).\nInput 1 in the Range, deselect Duplicate Stack (Figure 7C, 2), and click OK. The x-y position-corrected bead image in the unstrained substrate will appear on the screen (Figure 7C, 3). Save this image as a tiff file.\nQuantification of traction force\n\tNOTE: The method described here for traction force analysis uses MATLAB and two MATLAB toolboxes, 'Image Processing Toolbox' and 'Parallel Computing Toolbox'. Investigators will need to install them prior to the analysis. The traction force analysis code was developed based on MATLAB version 2018a. Therefore, MATLAB version 2018a (or later) must be used for the analysis. The algorithms used for traction force analysis were described previously22.\n\t\nDownload the traction force analysis code TFM2021 from Supplemental File 5. Open TFM 2021 in MATLAB\nOpen main.m in TFM2021 and run it. A graphical user interface (GUI) will appear on the screen (Figure 8A).\nClick on Load unstrained substrate image and select the x-y position-corrected bead image in unstrained substrate.\nClick on Load fluorescent bead images and select the time-lapse stack image of beads.\nClick on Load bright-field images and select the time-lapse stack image of bright-field.",
    "Click on Load GFP Images and select the time-lapse stack image of EGFP.\nSelect GFP from the drop-down list on the GUI (Figure 8A, red box).\nClick on ROI to specify the rectangle region of interest (ROI), including the growth cone, by clicking two points on the cell image displayed on the GUI (Figure 8B).\nClick on the Save button on the GUI (Figure 8A, red arrow). The selected stack images, together with the ROI, will be saved in a .mat file (MATLAB format file).\nClick on Spot detect. A dialogue box will appear on the screen.\nInput a value (usually 50-150) on the dialogue box to determine a threshold for bead detection. Clicking OK starts the calculation.\nAfter finishing the calculation, click on Plot track to enlarge the region selected at step 8.12.8 and display the detected beads as white dots (Figure 8C, 1).\n\t\tNOTE: Confirm whether bead detection (white dots) overlaps with the fluorescent beads. Bead detection may also detect background noise. To reduce this external interference, change the threshold value at Spot detect. In addition, manually select the correct dots at step 8.12.13.\nClick on Select beads, and demarcate a polygonal region that includes the correct dots under the growth cone. Press Enter on the keyboard. The white dots within the polygonal region will change into a red color (Figure 8C, 2).\nClick on Estimate force on the GUI. Then, input values for the following parameters: pixel size, µm/pixel; Young's modulus, the value calculated at Step 7.2.5; Poisson's ratio, 0.3.\nExecute Estimate force to initiate the calculation. The software will save the calculation results in a spreadsheet format file automatically.\n\t\tNOTE: The spreadsheet shows the x-component, y-component, and force magnitude at every time-frame (Figure 8D). Refer to Supplemental File 6 for practice data for quantifying traction force."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}