{
  "id": 9534,
  "origin_website": "Jove",
  "title": "A Galvanotaxis Assay for Analysis of Neural Precursor Cell Migration Kinetics in an Externally Applied Direct Current Electric Field",
  "procedures": [
    "All procedures involving animal handling were approved by the University of Toronto Animal Care Committee in accordance with institutional guidelines (protocol no. 20009387). The following methods should be performed using sterile tools and techniques, in a laminar flow hood where applicable.\nIn the protocol text below, the phrase \"EFH-SFM\" refers to serum free media supplemented with epidermal growth factor, basic fibroblast growth factor and heparin. EFH-SFM is used when investigating the galvanotaxis of undifferentiated NPCs because these mitogens maintain NPCs in their undifferentiated state4. When investigating the galvanotaxis of NPCs induced to differentiate into mature cell types, \"FBS-SFM\" refers to serum free media supplemented with 1% fetal bovine serum. FBS promotes the differentiation of NPCs into mature neural phenotypes5.\n1. Isolation and Culture of Neural Precursors (Not shown in video)\nAnaesthetize a CD1 mouse (6-8 weeks old) with isofluorane and sacrifice via cervical dislocation.\nDouse the head in 70% ethanol and decapitate the animal with sharp dissection scissors.\nWhile holding the head with surgical forceps, remove the skin on the dorsal surface to expose the skull.\nUsing a scalpel and no. 11 blade, score the skull at the frontal sinus along the mediolateral axis, and also along the sagittal suture in the rostrocaudal direction.\nPeel the parietal bones away from the head with no. 7 curved forceps, taking care not to pierce the brain tissue.\nInsert a thin spatula underneath the brain starting from beneath the cerebellum and advancing toward the olfactory bulbs. While holding the skull in place with forceps, gently pull the brain from the skull and immediately place it in ice-cold artificial cerebrospinal fluid (see recipes below).\nUnder a dissection microscope, using sterile dissection scissors and forceps cut the brain in half along the midline. Rotate each hemisphere so that the medial (cut) surface faces upwards.",
    "Select a hemisphere, and with the medial surface facing upward, locate the splenium of the corpus callosum (posterior region of the corpus callosum).\nMake an incision from the surface of the cortex to the splenium of the corpus callosum along the dorsoventral axis.\nPeel the incised cortex toward the olfactory bulb to expose the medial and lateral walls of the lateral ventricle.\nRotate the hemisphere so that the dorsal surface faces upwards, and use curved microscissors to cut out and collect the exposed medial and lateral walls, which contain the periventricular region where NPCs reside6.\nRepeat steps 1.8-1.11 for the other hemisphere.\nPipette the isolated tissue into 7 ml of trypsin solution (see recipe below) in a 15 cc tube, and place the tube on a rocker in a 37 °C incubator for 25 min.\nCentrifuge the tube at 1,500 rpm for 5 min, aspirate the supernatant, and resuspend the tissue in 2 ml of trypsin inhibitor solution (see recipe below).\nGently triturate the tissue with a small borehole Pasteur pipette 30-50 times carefully to avoid air bubbles.\nCentrifuge the tube at 1,500 rpm for 5 min, aspirate the supernatant, and resuspend in 1-2 ml of SFM (see recipe below) by triturating the pellet 3-5 times.\nCentrifuge the tube at 1,500 rpm for 3 min, aspirate the supernatant and resuspend in 1 ml of SFM + EFH.\nCount live cell density with a haemocytometer and plate the cells in a T25 culture flask at a density of 10 cells per μl in SFM + EFH.\nAllow the culture to grow for 7 days undisturbed to yield free-floating primary neurospheres comprised of NPCs.\n2. Galvanotaxis Chamber Preparation\nPlace 3 square glass no. 1 cover slips (22 x 22 x 0.17 mm) in a bottle of 6N hydrochloric acid overnight.",
    "The next day, use a diamond-tip glass-cutter to cut 6 rectangular strips (22 x 5 x 0.17 mm) of glass from square no. 1 cover slips.\nTransfer the acid-washed square slips and rectangular slips into a laminar flow hood. Wash the rectangular and square strips first with 70% ethanol, then with tissue culture-grade autoclaved water, and allow to dry on a Kim Wipe (for added sterility, the glass may be allowed to air dry).\nApply vacuum grease to the perimeter of one surface of the square glass slides, and seal them to the base of 60 mm plastic Petri dishes.\nApply vacuum grease along the long axis of one surface of the rectangular glass strips, and seal them to opposite edges of the square glass slides (such that they are parallel to each other) in order to create a central trough.\nUV-sterilize the chambers for at least 15 min in the laminar flow hood.\nPipette 250-300 μl of poly-L-lysine onto the central trough of the chambers and incubate at room temperature for 2 hr.\nApproximately 15 min prior to the end of the incubation period, prepare the Matrigel solution (see recipe below).\nAspirate the poly-L-lysine, wash the central troughs with 1 ml of autoclaved water, and pipette 250-300 μl of Matrigel solution onto the central troughs.\nIncubate the chambers at 37 °C for 1 hr.\nAspirate the Matrigel solution and gently wash the central troughs with 1-2 ml of SFM.\nPipette 100 μl of EFH-SFM or FBS-SFM onto the central troughs and transfer the galvanotaxis chambers onto the stage of a counting microscope.\nPipette 3-4 ml of the neurosphere-containing culture into a 60 mm Petri dish and transfer the Petri dish to the stage of the counting microscope.",
    "At a viewing objective of 5x, use a P10 pipette to transfer 5-8 whole neurospheres (up to four at a time) onto the central trough of each galvanotaxis chamber without dissociating them, and carefully spread the neurospheres around the central trough without disrupting the Matrigel substrate.\nAdd an additional 150-200 μl of EFH-SFM or FBS-SFM onto the central troughs.\nTransfer the galvanotaxis chambers into a 37 °C, 5% CO2, 100% humidified incubator for 17-20 hr (if analyzing undifferentiated NPCs) to allow the neurospheres to adhere to the Matrigel substrate and dissociate into single cells as shown in Figure 1. If analyzing differentiated NPCs, the incubation period should be extended to 69-72 hr to allow the differentiation of the cells.\n3. Live Cell Time-Lapse Imaging\nAllow the live cell imaging system to equilibrate at 37 °C, 5% CO2 for a minimum of 30 min prior to initiation of the time-lapse recording.\nCut two 12 cm pieces of 1 mm diameter Silver wire, coil them from one end, and place them in Clorox bleach for 20 min to form Ag/AgCl electrodes.\nTransfer the galvanotaxis chambers onto the stage of a counting microscope and select which chamber will be used for live-cell imaging migration analysis based on the following criteria: i) the neurospheres should be almost completely dissociated into single cells and ii) the cells should possess round morphologies with little-to-no processes extending from the cell bodies.\nTransfer the selected galvanotaxis chamber into a laminar flow hood, along with a separate square no. 1 glass cover slip and vacuum grease.\nWash the cover slip first with 70% ethanol, then with autoclaved water, and apply a strip of vacuum grease on two parallel edges of the cover slip.",
    "Aspirate the culture media from the central trough of the chamber, then quickly place the cover slip (grease-side facing down) onto the chamber such that the grease strips rest on the two parallel rectangular glass strips, effectively creating a roof to the chamber.\nPipette 100 μl of fresh EFH-SFM or FBS-SFM into the central trough via capillary action.\nUse vacuum grease to create borders for pools of culture media on each end of the central trough, as shown in Figure 2.\nCut two 15 cm pieces of PVC tubing, and use a 10 cc syringe with an 18 gauge needle to carefully inject agarose solution into the tubing, ensuring no bubbles form in the tubes, and allow the gel to solidify for 5 min.\nTransfer the galvanotaxis chamber to the live cell imaging system, along with the agarose gel tubes, Ag/AgCl electrodes, and a pair of empty 60 mm Petri dishes that will be used as culture media reservoirs and will contain the Ag/AgCl electrodes. Allow the galvanotaxis chamber to rest within the 37 °C, 5% CO2 environment for 20-30 min.\nDuring this time, prepare the lids of the 2 empty Petri dishes and the lid of the galvanotaxis chamber's Petri dish by drilling holes into them with a Dremel or similar tool as shown in Figure 3.\nPipette 1-1.5 ml of EFH-SFM or FBS-SFM onto either side of the central trough, and 7-8 ml of SFM into each empty Petri dish. Place one Petri dish on each side of the galvanotaxis chamber's central trough and place one Ag/AgCl electrode into each dish. Bridge the gap between the galvanotaxis chamber and the Petri dishes to establish electrical continuity with the agarose gel bridges, as shown in Figure 4.",
    "Connect the Ag/AgCl electrodes to an external power supply, with an ammeter in series to measure electrical current, and turn on the power supply. Use a voltmeter to measure the strength of the electric field directly across the central trough, and adjust the output of the power supply until the desired electric field strength is achieved (the assays performed in this lab utilize a dcEF strength of 250 mV/mm with electrical current between 1 and 1.5 mA).\nInitiate the time-lapse module on the live cell imaging system, and allow the experiment to run for the desired amount of time. After completion of the assay, fix the cells in 4% paraformaldehyde for standard immunostaining analysis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}