{
  "id": 15338,
  "origin_website": "Jove",
  "title": "Bidirectional Retroviral Integration Site PCR Methodology and Quantitative Data Analysis Workflow",
  "procedures": [
    "1. Generating Upstream (left)- and Downstream (right)-junction Sequence Libraries\nDNA linker preparation:\nPrepare a 10 µL linker DNA solution by adding 2 µL of 100 µM LINKER_A oligos (final: 20 µM), 2 µL of 100 µM LINKER_B oligos (final: 20 µM), 2 µL of 5 M NaCl (final: 1M), and 4 µL of nuclease-free water in a PCR tube. See Table 1 for the linker sequences.\nIncubate the linker DNA solution at 95 °C for 5 min in a PCR instrument, stop the run program, and turn the PCR instrument power off. Leave the linker solution in the instrument for 30 min to slowly cool down the linker DNA. The linker DNA solution can be stored at 4 °C.\nLTR-specific biotin-primer extension:\nUse a UV-Vis spectrophotometer to determine the DNA concentration and 260/280 nm values of the genomic DNA from in vivo or in vitro experiments. Dilute 1-2 µg of sample genomic DNA to a final volume of 170 µL of genomic DNA solution using nuclease-free water.\nPrepare a 200 µL PCR reaction by mixing 2.5 µL each of 10 µM HIV-1-specific biotin primers (L-BPs and R-BPs in Table 1: total of 10 µL for four lentivirus-specific primers), 20 µL of 10X thermostable DNA polymerase buffer, 4 µL of 10 mM dNTPs (final: 200 µM of each dNTP), 3 µL of 2.5 U/µL thermostable DNA polymerase, and 163 µL of genomic DNA.\n\t\tNOTE: For gammaretroviral vectors (pMX vectors), use 5 µL each of two 10 µM pMX-specific biotin primers (L-BP and R-BP: total of 10 µL) instead of the four HIV-1-specific biotin primers above.",
    "Divide the solution into four PCR tubes (each 50 µL) and carry out a single extension cycle under the following condition: 94 °C for 5 min, 56 °C for 3 min, 72 °C for 5 min, and 4 °C for storage.\nPool all four PCR reactions into a 2 mL microcentrifuge tube and follow the PCR purification procedure of the PCR purification kit. Elute with 50 µL of elution buffer (5-fold water-diluted elution buffer provided in the kit). Immediately proceed with step 1.3.1 or store the eluted DNA at -20 °C.\nRsaI and CviQI digestion\nPrepare a 100 µL digestion reaction by adding 50 µL of DNA (from step 1.2.4), 10 µL of 10x buffer A, and 2 µL (20 U) of RsaI enzyme. Incubate at 37 °C for 1 h in a PCR instrument.\nAdd 1 µL (10 U) of CviQI enzyme to the reaction and incubate at 25 °C for 30 min in a PCR instrument. Immediately proceed with step 1.4.1\nBlunt ending:\nPrepare a 4.5-µL mixture containing 2.5 µL of DNA Polymerase I large (klenow) fragment and 2 µL of 10 mM dNTPs. Transfer 1 µL of the mixture to the DNA sample from step 1.3.2. The total volume will be 102 µL. Mix well by vortexing and incubate at 25 °C for 1 h in a PCR instrument. Immediately proceed with step 1.6.1.\nPreparation of streptavidin beads:\nBriefly vortex the streptavidin bead solution and transfer 50 µL to a new 2 mL microcentrifuge tube. Remove the supernatant using the magnetic stand and wash the beads with 200 µL of binding solution.\nResuspend the beads in 100 µL of binding solution and place the tube away from the magnetic stand. Immediately proceed with step 1.6.1.\nStreptavidin bead binding:",
    "Transfer 100 µL of sample DNA (step 1.4.1) to the 100 µL re-suspended bead solution (step 1.5.2) and mix carefully by pipetting to avoid any foaming of the solution. Incubate the tube at room temperature for 3 h on a rotating wheel or a roller.\nUse the magnetic stand to capture the beads and discard the supernatant. Wash the beads twice in 400 µL of washing solution and twice in 400 µL of 1x T4 DNA ligase buffer (diluted from 10X solution using nuclease-free water).\nResuspend the beads in 200 µL of 1x T4 DNA ligase buffer (diluted from 10X solution using nuclease-free water) and place it away from the magnetic stand. Immediately proceed with step 1.7.1.\nLinker ligation:\nPrepare a 400 µL ligation reaction solution in a 2 mL microcentrifuge tube by mixing 0.5 µL of the DNA linker (step 1.1.2), 10 µL of 10x T4 DNA ligase buffer, 20 µL of 5X T4 DNA ligase buffer (containing 25% polyethylene glycol), 5 µL of T4 DNA ligase, 164.5 µL of nuclease-free water, and 200 µL of the re-suspended beads (step 1.6.3). Place the reaction tube on the rotating wheel and incubate at RT (22 °C) for 3 h (or 16 °C O/N).\nWash the beads twice with the washing solution and twice with 1X thermostable DNA polymerase buffer (diluted from 10x solution using nuclease-free water) using the magnetic stand.\nResuspend the beads in 50 µL of 1x thermostable DNA polymerase PCR buffer and place it away from the magnetic stand. Immediately proceed with step 1.8.1 or store at 4 °C for up to one day.\nPre-amplification of both the left and right junction DNA:",
    "Prepare a 200 µL PCR reaction by adding 10 µL of 10 µM 1L-primer, 10 µL of 10 µM 1R-primer, 20 µL of 10 µM primer Link1 (Table 1), 10 µL of 10X thermostable DNA polymerase buffer, 4 µL of 10 mM dNTPs (final: 200 µM of each dNTP), 8 µL (20 U) thermostable DNA polymerase, and 88 µL of nuclease-free water to the re-suspended beads (50 µL) from step 1.7.3.\nAliquot the reaction mixture into 4 PCR tubes (each 50 µL) and carry out PCR with the following condition: 94 °C incubation for 2 min; 25 cycles of 94 °C for 20 s, 56 °C for 25 s, and 72 °C for 2 min; and a final extension at 72 °C for 5 min.\nPool all 4 PCR reactions into a 2 mL microcentrifuge tube and follow the PCR purification procedure of the PCR purification kit. Elute with 50 µL of elution buffer.\nDetermine the DNA concentration and 260/280-nm values using a UV-Vis spectrophotometer; the DNA can be stored at -20 °C until ready for the next step. Proceed with steps 1.9.1/1.10.1 (optional) or directly with steps 1.11.1/1.12.1.\nRemoving the left-side internal DNA amplicon (optional):\nTransfer up to 100 ng of PCR DNA product from step 1.8.4 to a 2 mL microcentrifuge tube and adjust the volume to 10 µL using nuclease-free water.\nPrepare a restriction enzyme reaction specifically targeting the left-side internal DNA amplicon.\n\t\tNOTE: The reaction condition may differ depending on the choice of enzyme. For example, when removing the left-side internal DNA from NL4.3-based lentiviral vectors, add 1 µL of pvuII, 2 µL of buffer B, and 7 µL of nuclease-free water. Incubate at 37 °C for 1 h in a PCR instrument. Immediately proceed with step 1.11.1 or store at -20 °C.",
    "Removing the right-side internal DNA amplicon (optional):\nProceed the same as in step 1.9.1.\nPrepare a restriction enzyme reaction specifically targeting the right-side internal DNA amplicon.\n\t\tNOTE: For example, when removing the right-side internal DNA from NL4.3-based lentiviral vectors, add 1 µL of sfoI, 2 µL of buffer B, and 7 µL of nuclease-free water. Incubate at 37 °C for 1 h in a PCR instrument. Immediately proceed with step 1.12.1 or store at -20 °C.\nLeft-junction-specific amplification:\nPrepare a 50 µL PCR reaction by mixing 5 µL of DNA from step 1.8.4 (or from the optional step 1.9.2), 5 µL of 10 µM 2L-primer (final: 1 µM), 5 µL of 10 µM primer Link2 (final: 1 µM), 5 µL of 10x thermostable DNA polymerase buffer, 1 µL of 10 mM dNTPs (final: 200 µM of each dNTP), 2 µL (5 U) of thermostable DNA polymerase, and 27 µL of nuclease-free water.\nCarry out the PCR with the following condition: 94 °C incubation for 3 min; 8-15 cycles of 94 °C for 20 s, 56 °C for 25 s, and 72 °C for 2 min; and a final extension at 72 °C for 5 min.\n\t\tNOTE: Amplified DNA may be stored at -20 °C. *Cycle number optimization is suggested.\nFollow the PCR purification procedure of the PCR purification kit. Elute with 50 µL of elution buffer. Determine the DNA concentration and 260/280 nm values.\nRight-junction-specific amplification:\nAll procedures are identical to \"Left-junction-specific amplification\" (steps 1.11.1-1.11.3), except for the use of different primers; use the right-junction-specific primer (2R-primer, see Table 1) in this step.\nPCR amplicon length variation test:\nAnalyze the PCR amplicon length variations by performing 2% agarose gel electrophoresis or capillary electrophoresis (Figure 2).",
    "NOTE: This is an essential step to confirm the completion of the assay procedures and to make a rough assessment of IS patterns based on the PCR band patterns. The purified PCR amplicon from steps 1.11.3 and 1.12.3 can be used for various DNA sequencing platforms. Proceed with the appropriate sample preparation procedures for classical chain-termination (Sanger) sequencing or next-generation sequencing. The DNA may be stored at -20 °C.\n2. Computational IS Sequence Analysis\nPreparation of data files:\nPrepare three input data files: a fasta format sequence data file (Test_data.fa in supplemental data), a tsv file for the search motifs for vector and linker sequences (Demultiplexing_Trimming_blunt_GTAC.tsv in supplemental data), and a tsv file for restriction enzyme information (Enzyme.tsv in supplemental data).\n\t\tNOTE: These files are required for demultiplexing, trimming vector and linker sequences, and removing internal vector sequences (Figure 3A). Detailed step-by-step instructions for implementing the computational workflow are provided in the README.txt file in the supplemental data.\nComputational analysis:\nRun demultiplexing and trimming scripts.\n\t\tNOTE: The raw sequence will be processed for demultiplexing and for the trimming of the vector, linker, and primer sequences (see STEP-1 in the supplemental README.txt file).\nRun the mapping command (see STEP-2 in the README.txt file) to map the processed sequences onto the reference genome using a BLAST-like alignment tool (BLAT; www.genome.ucsc.edu).\nRun the quantitative IS analysis script (see STEP-3 in the README.txt file).\n\t\tNOTE: Two output files (Initial_count_without_homopolymer_correction.txt and Final_count.txt) will be generated. More details on mapping and sequence enumeration strategies can be found in the \"README.txt file in the supplemental data and in previous publications2,15.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}