{
  "id": 8849,
  "origin_website": "Jove",
  "title": "In Vivo Multimodal Imaging and Analysis of Mouse Laser-Induced Choroidal Neovascularization Model",
  "procedures": [
    "All animals were treated in accordance with the ARVO Statement for the Use of Animals in Ophthalmic and Vision Research and the EC Directive 86/609/EEC for animal experiments, using protocols approved and monitored by the Animal Experiment Board of Finland.\n1. Laser-induced mouse CNV model 5\nInspect the eyes of the animal macroscopically for any abnormalities.\nWeigh the mouse.\nCalculate and prepare an appropriate amount of anesthetics to use, based on the weight of the animal, e.g. a mixture of medetomidine (1 mg/kg), ketamine (75 mg/kg), and distilled water (0.9% NaCl solution) at a ratio of 1:1.5:2.5, or ketamine (40-75 mg/kg), xylazine (5 mg/kg), and distilled water (0.9% NaCl solution) at a ratio of 1:2.5:1; for a 20 g mouse, inject 0.1 mL of mixture.\nInject anesthetic intraperitoneally.\nPlace mouse back into the cage and wait until animal is anesthetized. Confirm the mouse is properly anesthetized by lack of a pedal reflex.\nEnsure the use of laser safety personal protective equipment.\nTurn on a slit lamp and a 532 nm diode laser.\nRemove the mouse from the cage and place on the heating pad.\nApply one drop of Tropicamide for pupillary dilation. Wait for 3-5 min for full (3 mm) pupillary dilation.\nPlace the mouse on the stage of the slit lamp.\nPlace one drop of opthalmic liquid gel on a coverslip to applanate the cornea.\nOrient the mouse eye with the optic nerve head in the center.\nSet the laser power to 100 mW, the duration to 100 ms, and the spot size to 50 µm.\nFocus the laser beam on the retinal pigment epithelium (RPE).",
    "Make three laser shots into one eye by avoiding retinal blood vessels ideally at the 4, 8, and 12 o'clock positions around the optic nerve, respectively. Inspect the fundus of the eye after all laser shots for absence of retinal bleeding. The contralateral eye serves as a non-lasered control.\nDiscard the coverslip and place mouse back on the heating pad.\nApply one drop of PEG gel drops on both eyes.\n2. SD-OCT 6,7\nPlace the mouse into the rodent alignment stage, and immobilize the head.\nAlign the lens of the SD-OCT system (e.g., Bioptigen/Leica Envisu R2200) to face the eye for in vivo imaging using X- and Y-stage controllers.\nPerform SD-OCT scans to verify breaks of Bruch's membrane: once the SD-OCT scans the whole eye, manually move the reference line on the lasered sites. Breaks of Bruch's membrane should be clearly visible in lasered areas (see Figure 1).\n3. Fluorescein angiography 7,8,9\nRemove mouse with the holder, and place it on the FA system (e.g., Heidelberg Spectralis HRA2).\nFocus at laser burn areas of the fundus of the eye using infrared reflectance mode with the head of the optic nerve in the middle of the viewing window.\nInject 0.1 mL of 5% fluorescein sodium salt for a 20 g mouse subcutaneously or intraperitoneally.\nFocus on the choroidal level.\nTake an image from the choroidal focus level.\nRe-focus at the retinal level and take an image.\nWait for 30 s and repeat steps 3.4-3.6.\nRemove the mouse from the holder and place it on the heating pad.\nReverse anesthesia by α2-antagonist for medetomidine, atipamezole (0.5 mg/kg, i.p.), or wait for animal recovery from anesthesia.\nRepeat in vivo SD-OCT and FA imaging in anesthetized animals on the follow-up days 5, 10, and 14.\n4. CNV Grading",
    "Grade the damage of Bruch's membrane from OCT images and choroidal FA images taken immediately after the lasering on day 0 as following:\n\t0 - Bruch's membrane was not damaged\n\t1 - successful damage of Bruch's membrane\nGrade the presence of CNV from lasered spots that had leakage as observed by comparing dynamics of fluorescein signal in a series of retinal FA images as following:\n\t0 - normal appearance of retina\n\t0.5 - faint staining of leakage\n\t1.0 - leaky CNV areas\n\tNote: Use the OCT imaging for additional confirmation of CNV or in questionable FA where the presence of intraretinal fluid in OCT images would suggest CNV grading.\n5. Retinal Thickness Measurements\nUse an automated segmentation software for retinal thickness measurements. Ensure that the total retinal thickness is considered, as the thickness of all layers from nerve fiber layer to RPE (healthy measurement sites), or to an imaginary line connecting RPE around the site of damage (lasered sites) (see also Figure 7).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}