{
  "id": 20001,
  "origin_website": "Wiley",
  "title": "Cryogel-based Injectable 3D Microcarrier Co-culture for Support of Hematopoietic Progenitor Niches",
  "procedures": [
    "To isolate hematopoietic stem and progenitor cells from mice, the long bones are extracted and thoroughly cleaned of all soft tissue. The bones are crushed with a mortar and pestle to release the hematopoietic cells, and the cell suspension is filtered to remove debris. Red blood cells (RBCs) are lysed, and the remaining cells are stained with antibodies for HSPC isolation based on fluorescence-activated cell sorting (FACS). The cells are sorted into medium based on surface marker expression and stored on ice. Typically, one mouse will yield 60,000 cKit+ Sca-1+ Lin– (i.e., KLS+) HSPCs.\nMaterials\nEndogenously labeled mice (see Strategic Planning)\nWild-type control mouse\nPhosphate-buffered saline (PBS)\nFACS buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-rec-0005])\n1× RBC lysis buffer (BioLegend, 420301), ice cold\nLineage depletion kit (BD Pharmingen, 558451), including lineage cocktail and magnetic bead suspension\nBlocking solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-rec-0002])\nAnti-streptavidin-PO (Invitrogen, S32365)\nAnti-cKit PE-Cy7 (BioLegend, 105814)\nAnti-Sca-1 APC (BioLegend, 108112)\nDAPI (Applichem, A4099.005)\nHematopoietic culture medium (HCM; see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-rec-0006])\nMortar and pestle\n10-ml pipette\n70-µm cell strainers (Corning, cat. no. CLS431751)\n15- and 50-ml Falcon tubes\n0.2-µm strainer\nCell counter or hemocytometer\nAutoMACS magnetic cell separator (Miltenyi Biotec)\n1.5-ml microcentrifuge tubes\n0.85-μm mesh strainers\nFACS machine (e.g., Aria Fusion)\nAdditional reagents and equipment for euthanasia and bone removal\nNOTE: If an AutoMACS instrument is not available, depletion can be performed using manual midi LD columns (Miltenyi Biotec) according to manufacturer's recommendations.\nPrepare hematopoietic cell suspension\n1. Isolate all tibiae, femurs, and pelvic bones from two to three endogenously labeled (DsRed) mice and remove soft tissue using sterile lab tissues.\nTypically, two to three adult male DsRed+ mice aged 8-12 weeks are needed to collect ∼200,000 KLS+ cells in suspension.\n2. Place bones from all mice in a single tube containing PBS on ice.",
    "3. Shake tube to rinse the bones and further remove any soft tissue. Repeat.\n4. Crush bones with a mortar and pestle in a small amount of FACS buffer (enough to cover the bones).\nAdd FACS buffer slowly to prevent foam formation (due to FBS), which will make it difficult to collect the cells.\n5. Using a 10-ml pipette, filter the suspension through a 70-µm cell strainer into a 50-ml Falcon tube.\n6. Rinse the bone pieces with FACS buffer (2 ml) and continue to crush them and filter the suspension, repeating until no large bone chunks are visible and the crushed bone debris is white.\n7. Centrifuge the suspension 10 min at 300 × g, 4°C.\n8. Carefully discard the supernatant and gently resuspend the pellet in 5 ml ice-cold RBC lysis buffer per mouse for 30 s.\nPrepare RBC lysis buffer from 10× stock solution and filter through a 0.2-µm strainer prior to use.\n9. Stop lysis by adding 20 ml FACS buffer and centrifuging 5 min at 300 × g, 4°C.\n10. Discard supernatant and resuspend in 1 ml FACS buffer.\nIf there is a sticky membrane pellet after this process, filter again or remove this debris with a pipette tip.\n11. Count cells for yield calculations in case of low output.\nStain and sort cells\n12. Add 50 µl lineage antibody cocktail per mouse and incubate for 20 min on ice.\n13. Wash by adding 20 ml FACS buffer and centrifuging 5 min at 300 × g, 4°C.\n14. Carefully discard the supernatant, resuspend the pellet in 1 ml FACS buffer, and keep on ice.\n15. Take a 50 µl WT sample for a Lin+ single-color control (SCC), add 50 µl FACS buffer, and keep on ice.",
    "16. Add 50 µl magnetic bead suspension per mouse to the WT (control) and DsRed (labeled cells of interest) samples. Incubate 15 min on ice.\n17. Start AutoMACS instrument and run the Rinse program.\n18. Wash each suspension with 20 ml FACS buffer and centrifuge 5 min at 300 × g, 4°C.\n19. Discard supernatant and resuspend suspension in 3 ml FACS buffer.\n20. Pass through a 70-µm cell strainer into a 15-ml Falcon tube and bring to the AutoMACS along with collection tubes (i.e., 15-ml Falcon tubes) for positive and negative fractions.\n21. Run Deplete + QRinse on the AutoMACS.\n22. Take the Lin– fractions and centrifuge 5 min at 300 × g, 4°C. Count cells.\nSave the Lin+ fraction in case the yield is low and another round of AutoMACs sorting is needed.\n23. Discard supernatant and resuspend the Lin– fraction as the purified DsRed sample in 100 µl blocking solution and the WT sample in 400 µl blocking solution. Also add 100 µl blocking solution to Lin+ SCC. Incubate for 15 min on ice.\n24. Divide the WT sample into four 1.5-ml microcentrifuge tubes on ice (100 µl suspension each). Add 100 µl FACS buffer to each tube. Keep two on ice for SCC samples, one unstained and one DAPI-stained.\n25. Stain the DsRed tube with KLS antibody cocktail using the following final concentrations, and stain the WT tubes using each single-color control. Incubate these solutions 1 hr on ice.\n         \n1:200 streptavidin-PO\n1:200 cKit PE-Cy7\n1:100 Sca-1 APC\n26. Wash each microcentrifuge tube with 1 ml FACS buffer and centrifuge 5 min at 300 × g, 4°C.\n27. Resuspend the DsRed Lin– samples in 1.5 ml FACS buffer. For optimal sorting, count cells and dilute, if necessary, to a maximum of 1–2 × 107 cells/ml.",
    "28. Resuspend the DAPI-SCC sample in 200 µl DAPI (1:5000) and the WT SCC samples in 200 µl FACS buffer.\n29. Filter all samples through 85-µm mesh strainers into 15-ml Falcon tubes containing 2 ml HCM. Invert tubes prior to sorting to ensure that walls are wet with HCM.\nThis increases the viability of sorted droplets that may touch the tube walls.\n30. Once the sort is completed, perform a purity control by mixing the sorting tube three times by inversion, then mixing 10 μl of the final solution with 90 μl HCM and reanalyzing the total volume of the suspension in the sorter.\nA total of 500-1000 events should be detected within the KLS gate at >90% purity, where purity is 100 times the number of events in KLS gate divided by the total number of events in the DAPI-FSC/SSC live cell gate. An example of KLS gating during the sort and associated back-gating is shown in Figure 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-fig-0002].\nSorted KLS+ cells can be kept on ice for up to 3 hr until co-seeding with scaffolds and BMSCs (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-prot-0002]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/7835ff55-d226-4de0-a915-32de2e5792b7/cpz1275-fig-0002-m.jpg</p>\nFigure 2",
    "Flow cytometry gating scheme. (A,B) Gating strategy for cKit+ Sca-1+ Lin– (KLS+) DAPI– tdTomato+ HSPCs. The KLS gate is generously set to sort for progenitor cells. A more restrictive gate set on Sca-1 bright can be set if interested in enriching for more primitive progenitors and stem cells, potentially in combination with CD48, CD150, and CD34 as in Wilson et al. (2008[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-bib-0029]). Nearly all live cells should be Lin–, because Lin+ cells have been magnetically depleted. Note that, in a raw total bone marrow sample, the Lin– fraction makes up ∼12% to 17% and that the Lin gate can be easily set based on the back-gating of KLS cells in the Lin gate. (C) From cell isolation to in vitro flow cytometric analysis logic. Microcarrier 3D co-cultures performed in the absence (conditioned medium and serum only) or presence of a cytokine cocktail consisting of 100 ng/ml SCF, 100 ng/ml FLT3L, 50 ng/ml TPO, 10 μg/ml LDL (Stem Cell Technologies, cat. nos. 78062.1, 78009.1, 78210, and 02698). (D-F) Gating strategy of in vitro expanded HSPCs. Plots are from the cytokine condition. (D) BrightCount beads (beads gate) allow for an absolute cell count. Live cells are gated on PI–, of which 99.9% are tdTomato+ GFP–. The majority of cells recovered are CD45+ Ter119– hematopoietic cells. (E) The mature lineage antibody panel reveals a minority Ter119+ erythroid cells and B220+ B lymphoid cells, and a majority of B220– Gr1+ CD11b+ myeloid cells. (F) The CD45+ Ter119– population is gated to indicate cKit+ Lin– cells, which are enriched in CXCR4, as expected for HSPCs. (G) Example of cell numbers generated from 3D niches with and without exogenous cytokines. (H) Maintenance of CXCR4 expression on cKit+ progenitors isolated from 3D co-cultures. *P < 0.05, **P < 0.01 by Student's t test.",
    "Freshly sorted HSPCs and trypsinized OP9 cells are counted and the appropriate ratio of cells is mixed. The CCM scaffolds are dried as a small clump in a 70-µm cell strainer on a SteriCup 500-ml media filtration device, and then carefully placed in an ultra-low-adhesion 6-well plate. The cell suspension is then seeded onto the CCM scaffolds, which are rehydrated through this process. The plate is placed in the incubator for 1 hr, after which additional medium is added and the plate is returned to the incubator.\nOP9 BMSCs were donated by the Daley laboratory (McKinney-Freeman, Naveiras, & Daley, 2008[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-bib-0017]), who received them from the Nakano laboratory (Nakano, Kodama, & Honjo, 1994[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-bib-0020]) and lentivirally transduced them for GFP expression as described in Tavakol et al. (2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-bib-0025]). Both the parental and GFP+ lines were authenticated by the ATCC on June 24, 2021, by short tandem repeat (STR) analysis, indicating an exact match of the ATCC reference OP9 cell line (CRL-2749). OP9 cells are available from the ATCC (CRL-2749), but this source has not been tested for hematopoietic support in our laboratory.\nFor preparation of stock 13.5 mg/ml collagen-coated CCM scaffolds, see Tavakol et al. (2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-bib-0025]). This procedure is described for 370 µl (5 mg) of CCM scaffolds.\nMaterials\nOP9 BMSCs (see protocol introduction)\nBMSC medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-rec-0003])\nPhosphate-buffered saline (PBS)\n0.05% (w/v) trypsin-EDTA (Life Technologies, 25300054)\nTrypan blue\n13.5 mg/ml collagen-coated CCM scaffolds in PBS (Tavakol et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-bib-0025]), stored at 4°C\nSorted KLS+ HSPCs (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-prot-0001])\nCo-culture medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-rec-0004])\nIncubator at 37°C, 5% CO2\nT150 cell culture flasks (Corning, CLS430825)\n10-ml serological pipettes\n15-ml Falcon tubes\nCell counter slide\n70-µm cell strainers (Corning, CLS431751)\nSteriCup filtration systems (Millipore, C3240)\n6-well ultra-low-adhesion plate (Corning, CLS347)\nPrepare OP9 BMSCs",
    "1. Expand OP9 BMSCs in BMSC medium in T150 flasks at 70%-80% confluency, typically using 1:3 passages every 3-4 days for 1-2 weeks.\nSubconfluency (plating at 30%-50% confluency and splitting 1:3 or 1:4 when 70%-80% confluency is reached) is critical to maintaining an undifferentiated BMSC culture with predictable hematopoietic support and differentiation capacities. We recommend creating stringent parental/stock and working cell cryobanks such that thawed cell batches are never expanded for more than 4-6 weeks in vitro prior to plating at confluency for a co-culture experiment. After thawing, always plan at least one “recovery” passage prior to co-culture experiments. The experiments described use OP9-GFP cells at passage 12. The same principle can be applied to other marrow stromal cell lines or primary cells from bone marrow.\n2. Identify a flask of 70%-80% confluent BMSCs for co-seeding. Remove BMSC medium and wash once with PBS.\n3. Remove PBS and trypsinize with 3 ml of 0.05% trypsin-EDTA for 2-3 min at 37°C, 5% CO2.\n4. Tap the flask firmly in the tissue culture hood and stop trypsinization by adding 4 ml BMSC medium.\n5. Gently wash the bottom of the flask with BMSC medium using a 10-ml pipette to remove loosely attached cells. Transfer suspension to a 15-ml Falcon tube.\n6. Centrifuge 5 min at 300 × g, 4°C.\n7. Carefully discard supernatant, resuspend pellet in 500 µl BMSC medium, and count viable cells using trypan blue and a cell counter.\n8. Adjust concentration to 5 × 106 cells/ml.\nPrepare and seed CCM scaffolds\n9. Dry 370 µl collagen-coated CCM scaffolds in a 70-µm cell strainer in the top chamber of a SteriCup filtration system.",
    "The CCM scaffolds can be transferred to a cell strainer to facilitate recovery and avoid excessive loss of material. The cell strainer must touch the SteriCup filter directly for the CCMs to dry sufficiently.\nCollagen-coated CCM scaffolds may stick to the pipette wall, leading to a significant loss of scaffolds during transfer. To avoid this, rinse the pipette briefly by pipetting 1 ml PBS up and down before proceeding to the next step.\n10. With scaffolds still in the strainer, wash sequentially with 1 ml PBS and then 1 ml medium. Dry scaffolds carefully each time.\nThe scaffolds should be as dry as possible to achieve a homogenous and optimal cell seeding in step 12.\n11. Using a 2-ml serological pipette or a cell scraper, scratch the CCM off the strainer and place in a single well of a 6-well ultra-low-adhesion plate, forming a viscous cluster or “bubble” in the center of the well. Repeat for the desired number of wells.\n12. Confirm cell counts for BMSCs and sorted KLS+ HSPCs. Prepare mixed suspensions at 1:10 and 1:100 ratios of HSPCs to BMSCs. For optimal seeding, prepare mixtures in a total volume of ∼100 µl in co-culture medium.\nIn this case, we used 45,000 HSPCs and 450,000 BMSCs for a 1:10 ratio and 4,500 HSPCs to 450,000 BMSCs for a 1:100 ratio.",
    "The volume used to resuspend the mixed suspension is of particular importance: it should not exceed 50% of the initial volume of the scaffold stock (13.5 mg/ml). On the one hand, excessive dilution of the cell suspension will lead to a significant loss of cells, as excess fluid will leak out of the CCM scaffolds. On the other hand, a cell suspension that is too concentrated leads to a highly heterogenous seeding and may result in a loss of cell viability during incubation in the next step.\n13. Add 100 μl mixed cell suspension to each dried CCM scaffold bubble in the 6-well plate and incubate for 1 hr at 37°C, 5% CO2.\n14. Add 3 ml co-culture medium and incubate overnight at 37°C, 5% CO2.\nCytokines may be added to culture medium to increase hematopoietic progenitor expansion and/or differentiation (for example, see Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-fig-0002]).",
    "As many CCMs are in each well, it is easy to collect a small sample (e.g., a few scaffolds) for serial imaging over time. Hoechst stain, traditionally a live nuclear stain, also stains the scaffolds. Combined with the endogenous cell labels (GFP for BMSCs and DsRed for HSPCs), this makes imaging useful for looking at proliferation of cells over time. End-point imaging with additional markers via fluorescent antibody staining was not performed, though it could be performed if the cell populations are not endogenously labeled prior to the start of the experiment.\nMaterials\nSilicone glue\nCo-seeded scaffolds (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-prot-0002])\nCo-culture medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-rec-0004])\n0.1 μg/ml Hoechst 33258\nFACS buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-rec-0005])\n2.5-mm-thick polypropylene sheet\nLaser cutter\nCoverslips\nIncubator at 37°C, 5% CO2\n200-μl pipette tips with tip cut off\nZeiss LSM 700 Inverted Confocal Microscope\nFiji/ImageJ software (NIH)\nFabricate custom observation chambers\n1. Cut pieces of 2.5-mm-thick polypropylene sheet with the following dimensions using a laser cutter:\n         \n75 × 25 mm for the slide\n40 × 14 mm for the central chamber\n2. Adhere a coverslip to one side using silicone glue to form the bottom of the chamber (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-fig-0003]).\nAlternatively, chambers can be 3D printed using the 3D printing map provided (see Supplementary Information) or deep-cavity glass microscope slides can be used.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/183d13e0-40a8-4998-b91c-3728f384842e/cpz1275-fig-0003-m.jpg</p>\nFigure 3\nCustom chamber for real-time 3D confocal imaging. Left: Chamber cut from polypropylene sheet. One coverslip forms the bottom of the chamber and a second is placed on top over the sample. Right: PLA 3D-printed chamber.\nMaintain and image co-cultures\n3. Maintain co-seeded scaffolds in co-culture medium for 2 weeks at 37°C, 5% CO2. Add 3 ml medium at 1 week post-seeding.\nIf keeping in culture longer, we recommend half-medium changes to prevent aspiration of any detached HSPCs.",
    "4. On days 1, 4, 7, and 11, take a small volume of suspended CCMs (∼100 µl) and transfer to an observation chamber.\nTo avoid loss of viability due to handling, use a 200-µl tip with the tip cut off using sterile scissors.\n5. Supplement this volume with 100 µl of 1:1000 Hoechst 33258 (if staining the scaffold) or 100 µl FACS buffer. For Hoechst staining, incubate 15-20 min and wash with PBS just before imaging.\nIf cells are not endogenously labeled, it would be advantageous to label them (e.g., transient labeling with cell painters) prior to use in in vitro studies.\n6. Image co-seeded scaffolds within 1 hr of transferring to the chamber. When ready to image, apply a coverslip on top of the sample, being careful to avoid air bubbles.\nAnalyze images\n7. Using Fiji/ImageJ analysis tools, for each image, separate each fluorescent channel and create a compiled volume-rendered image for each cell type (HSPCs and BMSCs).\nImages used for quantification are composed of a 25-z-stacked, volume-rendered image.\n8. Threshold each channel using the Li algorithm (“image > threshold > Li algorithm”). If necessary, convert the image to 8-bit.\nIn order to ensure reproducible thresholding, the rendering should closely overlap with the signal from the original channel. Therefore, a comparison before and after thresholding is often required.\nWhen necessary, the rendering is manually and slightly adapted. To this end, the original channel is selected. In the thresholding window, the Li algorithm is selected and a first thresholding is performed by clicking the “Auto” button. Then, using the “Dark background” option (check the corresponding box), the upper cursor is used to fine-tune the rendering.",
    "Most often, a more realistic rendering may be achieved for low-contrast images by sliding the upper cursor to the left in order to increase the thresholding area. In contrast, highly exposed images usually require sliding the upper cursor to the right to decrease the background signal.\nFor quantitative analysis (e.g., time-course analysis or comparisons of two or more simultaneous conditions), do not adjust thresholding manually. Find the most representative settings and acquire all conditions using the same settings.\n9. Analyze the fluorescent area corresponding to each channel using “Analyze > Analyze Particle area” and the following parameters:\n         \nSize range: 4 to infinity (to remove nonspecific fluorescence background)\nCircularity: 0-1 (default)\nDisplay result: checked\nExclude on edges checked\nIf necessary, use the option “Includes holes” for scaffold area quantification to increase the accuracy of the measurements. Scaffold areas can also be quantified manually using the “Freehand selections” tool.\n10. Calculate the fluorescent “total area” for each label (i.e., GFP and DsRed for HSPCs and BMSCs) as well as the “total scaffold area” for each image by summing all the “Area” values in Excel.\n11. Calculate the percentage of the total particle fluorescent area for each fluorescent label (HSPCs or BMSCs):\n         \n% total particle fluorescent area = (HSPC or BMSC “total area”)/(“total scaffold area”) × 100\n12. Calculate this value for each label and create a ratio for HSPC to BMSC relative fluorescent areas for each image over time.",
    "To assess hematopoietic expansion, cells are isolated from the co-culture and prepared for flow cytometric analysis as a single-cell suspension. In parallel, to assess hematopoietic progenitor function, cells are seeded for hematopoietic colony-forming unit (CFU) assays in semi-solid methylcellulose-based medium. After 1 week, CFUs are counted and categorized according to size and complexity. Colony assays to specifically assay long-term hematopoietic stem cell activity (LT-HSC) are described elsewhere (Kerenyi, 2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-bib-0015]).\nThe protocol below uses MethoCult methylcellulose-based medium from Stemcell Technologies and their STEMvision colony-counting instrument. Alternatively, counting can be performed using a brightfield microscope equipped with 4× and 10× objectives and manual scoring according to manufacturer's instructions (https://cdn.stemcell.com/media/files/manual/MA28405-Mouse_Colony_Forming_Unit_Assays_Using_MethoCult.pdf[href=https://cdn.stemcell.com/media/files/manual/MA28405-Mouse_Colony_Forming_Unit_Assays_Using_MethoCult.pdf]).\nMaterials\nCo-seeded scaffolds (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-prot-0002])\nSerum-free medium: HCM (see recipe) without FBS\n0.04% (w/v) collagenase I (Thermo Fisher Scientific, 17100-017) in Hanks' balanced salt solution (HBSS)\nCo-culture medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-rec-0004])\nFACS buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-rec-0005])\nBlocking solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-rec-0002])\nLineage cocktail from lineage depletion kit (BD Pharmingen, 558451)\nFlow cytometry antibody cocktail (see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-tbl-0001])\nBrightCount beads (1000 beads/µl, Invitrogen, C36950)\nDAPI (Applichem, A4099.005)\nMethoCult medium (Stemcell Technologies, M3434)\nPenicillin/Streptavidin (Thermo Fisher Scientific, 15140122)\nTable 1.\n                Example Flow Cytometry Panels for Bulk Hematopoietic Progenitor Quantification (CD45+ cKit+ Sca-1± Lin–)a[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-tbl1-note-0001_54]\ntable:\n﻿Panel,Antibody,Clone,Isotype,Conjugation,Dilution,\"Supplier, cat. no.\"\nHSPC sorting,cKit (CD117),2B8,Rat IgG2b,PE-Cy7,1:100,\"BioLegend, 105814\"\n,Sca-1 (Ly-6A/E),E13-161.7,,APC,1:50,\"BioLegend, 122508\"\n,Lineage cocktail,,,Biotin,1:20,\"BD Biosciences, 51-9000794\"\n,Streptavidin,,,Pacific Orange,1:100,\"Life Technologies, S32365\"\n,DAPI,,,UV,1:5000,\"Axon Lab, A4099.0005\"\nHSPC panel,cKit (CD117),2B8,Rat IgG2b,PE-Cy7,1:100,\"BioLegend, 105814\"\n,Sca-1 (Ly-6A/E),E13-161.7,,APC,1:50,\"BioLegend, 122508\"\n,Lineage cocktail,,,Biotin,1:20,\"BD Biosciences, 51-9000794\"\n,Streptavidin,,,Pacific Orange,1:100,\"Life Technologies, S32365\"\n,CD184 (CXCR4),2B11,,PerCP-eFluor710,1:25,\"Invitrogen, 46-9991-82\"\n,PI,,,,1:5000,\nMature lineage panel,pan-CD45,30-F11,Rat IgG2b,Alexa Fluor 700,1:50,\"BioLegend, 1013128\"\n,Ter119,TER-119,Rat,BUV395,1:200,\"BD Biosciences, 563827\"\n,B220 (CD45R),RA3-6B2,,PE-Cy5,1:25,\"BioLegend, 103210\"\n,Gr1 (Ly-6G/Ly-6C),RB6-8C5,,APC,1:250,\"BioLegend, 108412\"\n,CD11b,M1/70,,APCeFluor 780,1:500,\"Invitrogen, 47-0112-82\"\n,PI,,,UV,1:5000,\na Exploration of murine lineage commitment can be determined with alternative combinations of surface markers including CD45 pan-hematopoietic marker for better separation from stromal components (e.g., granulocytic: Gr1; monocytic: CD11b; erythroid: Ter119/CD71; lymphoid: B220/CD3).\n2- or 5-ml serological pipettes",
    "70-µm cell strainer (Corning, CLS431751)\n50-ml Falcon tubes\n1.5-ml microcentrifuge tubes\n85-μm mesh filter\nFlow cytometer (e.g., BD Biosciences LSR II SORP or Beckman Coulter CytoFLEX LX)\n16-G blunt-end needles and 3-cc syringes (Stemcell Technologies, 28110 and 28240)\n6-well meniscus-free plates (e.g., Stemcell Technologies SmartDish, 27371)\nHumidifying chamber\nIncubator at 37°C, 5% CO2\nSTEMvision colony counter (Stemcell Technologies)\nDigest scaffolds\n1. Carefully collect most of the medium from the co-culture wells and set aside on ice as the non-adherent fraction.\n2. Gently wash CCM particles twice with serum-free medium.\n3. Remove excess medium and add 2 ml of 0.04% collagenase I per well of the 6-well plate. Incubate 25 min at 37°C, 5% CO2.\n4. Inactivate collagenase by adding 4 ml co-culture medium using a 2- or 5-ml serological pipette and pipetting up and down for 1-2 min.\n5. Pass through a 70-µm cell strainer into a 50-ml Falcon to isolate cells from particles.\n6. Repeat steps 4-5 twice more, then discard strainer and residual CCM particles.\n7. Pipette sample up and down to obtain a single-cell suspension (the collagenase-digested adherent fraction).\n8. Centrifuge non-adherent and adherent fractions for 10 min at 300 × g , 4°C.\n9. Resuspend pellets for a total of 500 µl cell suspension in FACS buffer.\n10. Split each fraction to two microcentrifuge tubes for CFU and flow cytometry analysis.\nCFU and flow cytometry allocations should be optimized for each experimental setup. It is safe to split the samples ∼1:10 for CFU and flow cytometry, respectively. Suspension (nonadherent) fractions can contain a highly variable number of HSPCs depending of time of culture, so a lower allocation or a set of dilutions may be appropriate.\nStain for flow cytometry",
    "11. Centrifuge cytometry aliquots (50 μl at a 1:10 allocation) at 300 × g and resuspend pellets (∼20 µl) with 75 µl blocking solution. Transfer to fresh microcentrifuge tubes and incubate 10 min at room temperature.\n12. Add 5 µl lineage cocktail and incubate 20 min on ice.\n13. Wash with 1 ml FACS buffer and pass through a 85-µm mesh filter.\n14. Centrifuge 10 min at 300 × g, 4°C, and aspirate supernatant.\n15. Incubate with the antibody cocktail in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-tbl-0001] for 45 min on ice. To count cell numbers, include 10 µl BrightCount beads.\n16. Add 200 µl DAPI and incubate ∼10 min before acquiring using a flow cytometer.\nAn example of analysis and gating is shown in Figure 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-fig-0002].\nPerform CFU assay\n17. Thaw a 100-ml bottle of MethoCult medium the day prior to use and add 1% penicillin/streptomycin directly to the bottle. Shake vigorously, let sit to allow bubbles to settle, and dispense 2.3-ml aliquots in 15-ml Falcon tubes.\nThis can be prepared in advance and stored short-term (several hours) at 4°C or long-term (months) at –20°C.\n18. To each MethoCult aliquot, add the appropriate volume of cell suspension to give ∼100 KLS+ cells per 6-well plate.\nPlating conditions should be optimized for an ideal output of 60 colonies/plate. The assay is not linear with more than 100 colonies/plate, and discrimination of separate colonies becomes impossible with more than ∼150 colonies/plate (see manufacturer's recommendations at https://cdn.stemcell.com/media/files/manual/MA28405-Mouse_Colony_Forming_Unit_Assays_Using_MethoCult.pdf[href=https://cdn.stemcell.com/media/files/manual/MA28405-Mouse_Colony_Forming_Unit_Assays_Using_MethoCult.pdf]).\nWe back-calculated the actual number of seeded cells based on fractions of culture that were left for CFU analysis. It is highly recommended to optimize CFU cell density prior to experimentation. Alternatively, serial 5-10× dilutions can be performed for CFU assays when the concentration of progenitors is unknown.",
    "19. Mix cells and MethoCult using a 16-G blunt-end needle and let sit for 5 min to allow bubbles to rise to the surface.\n20. Slowly collect cell/methylcellulose suspension from below the bubbles and carefully add 1.1 ml to each well of a meniscus-free 6-well plate.\n21. Place each plate in a humidifying chamber and leave in an incubator for 7 and 14 days without manipulation.\n22. Image colonies using the STEMvision instrument (or score live using a brightfield microscope) according to manufacturer's protocols for imaging and analysis.",
    "To perform in vivo experiments, co-culture scaffolds are injected subcutaneously in anesthetized mice. Prior to injection, the scaffolds must be gently packed (concentrated). To achieve this, a controlled-pressure, cell-protecting drying device was developed (Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-fig-0004]). The scaffold suspension is loaded into the column of the drying device and controlled capillary action is used to gently pack the scaffolds. The steps below describe drying of the scaffolds and injection into mice. For preparation of the drying device, see the Support Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-prot-0006] that follows. Video 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-fig-0004a] demonstrates the process of loading scaffolds on the column for delicate drying, loading the syringe with scaffolds in the transfer tip, and performing the subcutaneous injection. In our experiments, injected scaffolds were maintained for up to 12 weeks in vivo.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/5372bb65-318c-4c18-b137-0a4b539666bf/cpz1275-fig-0004-m.jpg</p>\nFigure 4\nDrying device to protect cells and scaffolds during implantation. (A) Overview of drying scheme from cell suspension (2) to collection of particles (3) to insertion on syringe (4). (B) Drying device using repurposed 1000-μl pipette tip box. (C) Metrics for determining pressure drop for cells and scaffolds. By equilibrating the CCM and medium to a predefined hydrostatic pressure (ΔP, typically on the order of 0.2 kPa or ∼2 cm water column), CCM scaffolds can be dehydrated to help pack the scaffolds prior to injection. For more information, see Support Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-prot-0006]. (D) Loading column and transfer tip dimensions. (E) Scaffold polymer concentration increases according to the negative pressure applied by the device. Figure adapted in part from Tavakol et al. (2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-bib-0025]) with permission.\nThis video cannot be streamed at this time, please download the video instead.[href=https://currentprotocols.onlinelibrary.wiley.com/cms/asset/dadee7b1-5ed3-4c18-b05f-b439ffb21a5e/cpz1275-vid-0001.mp4]\nVideo",
    "NSG mice are used for this protocol because OP9 BMSCs are derived from a mixed background (Nakano et al., 1994[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-bib-0020]). All experimental procedures were approved by the Animal Care and Use Committee of the Canton of Vaud (ACUC, Vaud, Switzerland, license VD3629). All animals were hosted in the EPFL or UNIL-CLE Conventional Animal Facilities (Epalinges, Switzerland) and were kept under a controlled 12-hr light/dark cycle at constant room temperature 22° ± 2°C.\nMaterials\n8- to 16-week-old NOD SCID-γ immunodeficient female mice (NSG 5557, Jackson Laboratories)\nIsoflurane USP-PPC (Animalcare) and compatibile gas-air mixer\nBetadine (Mundipharma Medical)\nCarprofen (Rimadyl, Pfizer)\nOphthalmic liquid gel (Viscotears, Alcon)\nCo-cultured CCM scaffolds (see Basic Protocols 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-prot-0002]-3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-prot-0003])\nPhosphate-buffered saline (PBS)\nAntibiotic drinking solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-rec-0001])\nAnimal scale\nHeating pad\nHair shaver\n15-ml Falcon tube\nCustom drying device (see Support Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-prot-0006]; Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-fig-0004])\n1-ml syringe\n20-G flexible catheter (BD Biosciences, 381703)\nTools for euthanizing mice and isolating implants\nAdditional reagents and equipment for paraffin embedding, staining, and other analyses\nPrepare for transplantation\n1. Autoclave all supplies for implantation, including the drying device.\n2. Weigh mouse for post-surgery monitoring, then induce anesthesia with 4.0% isoflurane.\n3. Place mouse on a warm heating pad and maintain anesthesia at 1.5%-2% isoflurane.\n4. Shave the back of the mouse and apply Betadine at the injection sites to keep them as sterile as possible.\nTwo injections should be made in each mouse to provide a scaffold injection and a contralateral control.\n5. Administer pre-operative carprofen (5 mg/ml) as an analgesic.\n6. Apply ophthalmic liquid solution to both eyes.\nPack scaffolds on drying device (see Video 1)\n7. Prepare scaffolds in a 15-ml conical tube from in vitro culture.",
    "Typically, for each condition, a total of ∼3-6 ml seeded scaffolds and associated medium are loaded into the column for drying. Although the video shows scaffolds being applied directly from the 6-well plate, it is best to transfer them to a tube before transporting them to the animal facility.\nIf two people are performing surgery, this procedure can be done while the mouse is being anesthetized.\n8. Add PBS to the capillary conductors of the drying device to moisturize the device prior to use.\n9. Transfer scaffolds (in solution) to the loading column of the drying device and allow to settle in the transfer tip. Collect ∼50 µl seeded scaffolds per injection.\nIt may take 1-2 min for the scaffolds to settle. During this process, the column should be stabilized as much as possible to prevent scaffold loss during preparation.\nPerform subcutaneous injection (see Video 1)\n10. Load a sterile 1-ml syringe with 0.1 ml coated scaffold without cells and follow with 0.1 ml air to help injection fluidity.\n11. Insert a 20-G flexible catheter (with needle) into the mouse's skin so the needle is ∼2 cm deep (subcutaneous), then remove the needle, keeping the catheter on place.\nCatheters that are not equipped with needles can also be used for this procedure. To do so, first make a hole in the mouse's skin using an 18-G needle and insert the needle ∼2 cm deep. Then insert the catheter and proceed to the next step.\n12. Connect the scaffold-filled transfer tip (step 9) to the syringe (step 10).\n13. Slowly push the scaffolds into the subcutaneous implantation site. After implantation, slowly remove the catheter.",
    "This step must be performed gently to make sure all particles remain inside the subcutaneous pocket and do not leave the injection site. No sutures are required because CCM particles covalently interlock during the high-density injection procedure. An organized, malleable CCM “bubble” should become apparent immediately after injection (Fig. 3E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-fig-0003]).\nThe transfer tip should not be reused for a second injection.\n14. Return animal to its cage as it starts to wake up.\nThe entire injection procedure takes ∼20 min for two injections on the same mouse.\n15. Provide animal with antibiotic drinking solution for the duration of the study.\nSacrifice and sample harvest\n16. At the end point (in our case, 12 weeks), euthanize mouse and shave its back to better visualize the implantation site (Fig. 5A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-fig-0005]-C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-fig-0005]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/093a1f05-6274-4163-ac0d-a507ac193684/cpz1275-fig-0005-m.jpg</p>\nFigure 5\nSubcutaneous injection of co-cultured CCM scaffolds. (A-C) Gross images of implant site on day of implant and 12 weeks post-injection, showing outside the skin (B) and underneath the skin with visible vasculature integration (C). (D-K) Hematoxylin and eosin (H&E) staining and immunohistochemistry (IHC) of scaffolds at 1.5 and 12 weeks post-implantation with visible maintenance of tdTomato/DsRed+ hematopoietic cells (D,F,H) and GFP+ stromal cells (J), as well as integration of CD31+ endothelial cells at both time points in the OP9/KLS+ co-culture groups (E,G,I). Dotted line indicates boundary between implanted scaffold and subcutaneous tissue.\n17. Isolate implants (which should be visible by eye) and surrounding tissue. Fix overnight in 4% paraformaldehyde.\nTo minimize damage to the implant, we recommend isolating and fixing the implant with surrounding skin and only then, if desired, carefully dissecting the fixed implant prior to embedding.\n18. Perform paraffin embedding or other tissue processing as desired, including any immunohistological staining or analysis (see examples in Fig. 5D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-fig-0005]-K[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-fig-0005]).",
    "Instructions are provided here for constructing the device from common laboratory materials. The assembled device can be seen in Figure 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-fig-0004] and Video 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-fig-0004a]. Alternatively, the device can be assembled from 3D-printed parts made using the 3D printing maps provided (see Supplementary Information).\nAll plastic consumables used should be made from polypropylene, as this allows assembly using a standard crafting hot glue gun and soldering iron. Additionally, it makes the device and columns suitable for sterilization by autoclaving.\nMaterials\n15- and 50-ml Falcon tubes\nMetal saw or sharp knife\n1000-µl pipette tip (Axygen, 7.9 cm)\n20-µl barrier pipette tip (MultiGuard, Sorenson BioScience)\n5-ml syringe (BD Biosciences)\n1000-µl pipette tip box (Axygen Scientific)\nSoldering iron\nHot glue gun (traditionally with ethylene vinyl acetate polymer glue)\nCommercial or craft felt material, autoclavable (e.g., 82% viscose, 18% polypropylene, Coop, Switzerland)\nFabricate loading column\n1. Cut a 15-ml Falcon tube in three parts by cutting at the 3-ml and 12-ml lines using a saw or a sharp knife. Discard the middle section.\n2. Assemble the bottom and top pieces by melting the rim of both pieces with a hot glue gun and rapidly pressing them together.\nThe two pieces should be assembled tightly to prevent any leaks. The tightness can be tested by filling the column with water. If any air bubbles appear, discard the column and begin again.\n3. Cut off the very bottom conical part of the tube so that the diameter of the hole is the same as the top of a 1000-μl pipette tip (typically, 1.9 cm o.d.).\n4. Attach a 1000-μl tip to the column by melting the rim of both pieces with the hot glue gun and pressing together tightly.\nTightness can be checked as above.",
    "5. Cut off the bottom of the tip to remove 1.2-1.5 cm (0.4 cm o.d.).\nThe average total height of the loading column is 11.5 cm.\nFabricate transfer tip\n6. Cut the top section of a 20-µl barrier pipette tip at 1.2 cm from the top (larger opening).\n7. Cut off the bottom section (the narrowest part) at 2.3 cm from the tip, below the filter. Attach the two pieces using the hot glue gun to make the transfer tip.\nFabricate column holder\n8. Cut a 5-ml syringe at 2 cm from the top and keep the top section (the part with handles).\n9. Attach one handle of the syringe to the top part of a 1000-µl tip.\n10. Repeat steps 8 and 9 up to four times on the same tip to allow multiple dried scaffolds to be prepared at once.\nA holder can also be made from the top shelf of an empty 1000-µl tip box by simply assembling four 1000-µl tips at each corner of the shelf. Each hole can then be used as a holder for the columns.\nAdapt the height of the holder by stacking several 1000-µl tips together.\nFabricate drying box\n11. Cut a 50-ml Falcon tube at 6 cm from the tip and keep the bottom piece to serve as the waste reservoir (recipient; Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-fig-0004]).\n12. In the top shelf of an empty 1000-µl pipette tip box, make a hole with same diameter as the 50-ml Falcon tube.\n13. Insert the recipient in the hole and attach by melting with a soldering iron.\n14. Make a hole in the Falcon tube 2 cm from the top (Fig. 4B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-fig-0004],C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-fig-0004]).",
    "This will define the hydrostatic pressure at 200 Pa (1 cmH2O = 98.07 Pa), which is suitable for cell viability and gives adequate consistency of CCM scaffolds for injection.\n15. Cut a cleaning cloth or felt material into an 8 × 7–cm rectangle with a protruding tail of at least 6 cm on one side to serve as the capillary conductor (Fig. 4A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-fig-0004],C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-fig-0004]).\n16. Assemble pieces as shown in Figure 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-fig-0004] and test for leakage.\n17. Autoclave and use under the hood as described (see Basic Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.275#cpz1275-prot-0005])."
  ],
  "subjectAreas": [
    "Stem Cell Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}