{
  "id": 6553,
  "origin_website": "Bio",
  "title": "QUEEN-based Spatiotemporal ATP Imaging in Budding and Fission Yeast",
  "procedures": [
    "Cell preparationStreak yeast cells from a frozen stock using a pipette tip on a YPD (for S. cerevisiae) or YELA (for S. pombe) agar plate, and incubate at 30 °C for 1-2 days.Preparation of the preculture: For budding yeast, inoculate 2 ml of SC-H with a loopful of cells in a 16-ml culture tube using a sterilized toothpick, and culture at 30 °C overnight with rotation at approximately 40 rpm using a rotator.For fission yeast, inoculate 2 ml of EMM with a loopful of cells in a 16-ml culture tube using a sterilized toothpick, and culture at 30 °C overnight with shaking at 150 rpm using a rotary shaker.Preparation of the main culture:For budding yeast, dilute 0.15 ml of the overnight culture with 2.85 ml SC-H (1:20) in a 16-ml culture tube, and culture at 30 °C with rotation at approximately 40 rpm.For fission yeast, dilute 0.5 ml of the overnight culture with 9.5 ml EMM in a 50-ml flask (1:20), and culture at 30 °C with shaking at 150 rpm. Grow yeast cells to the mid-log phase. Approximately 3 h is needed for budding yeast and approximately 5 h for fission yeast under the experimental conditions described herein. The dilution ratio and incubation time may be optimized according to individual culture systems.Dilute the cell culture with the same medium by 10-fold and place 100 µl of cells onto a 35-mm glass-bottomed dish coated by concanavalin A for S. cerevisiae or soybean lectin for S. pombe (see Recipes).Wait for 5 min, remove most of the medium with gentle aspiration, and wash cells immobilized on the glass surface with 300 µl of fresh medium three times.Observe the yeast cells immobilized on the glass-bottomed dish with a 40x objective lens using an inverted routine microscope to check cell density.",
    "Repeat Steps A2-A3 if cells are too sparse.Fill the dish with 4-5 ml of medium and incubate the dish in a room for fluorescent microscopy (maintained at 25 °C) for at least 30 min before microscopic observations.Optional: To deplete intracellular ATP, replace the medium with 300 µl of 2DG medium three times. Acquire images of QUEEN fluorescence within 10 min.Note: The dish is filled with an excess amount of medium relative to the cell volume in order to minimize changes in the chemical composition of the medium by the consumption of nutrients or by secretory components during observations. It is important to maintain the medium in a dish at a constant and stable temperature because the affinity of QUEEN for ATP depends on temperature (Yaginuma et al., 2014): higher temperatures result in lower QUEEN ratios, while lower temperatures lead to higher QUEEN ratios.Image acquisitionPower on the fluorescent microscope system at least 1 h before imaging to reach a stable and constant temperature of approximately 25 °C.Observe the yeast cells immobilized on the glass-bottomed dish with a 100x objective lens using an inverted fluorescence microscope by bright-field imaging and focus the cells.Take a bright-field image and two fluorescence images of QUEEN using FITC (ex480 image) and Ex409 (ex409 image) filter sets from a single z-plane.Regarding time-lapse imaging, reduce the intensity of the excitation light and exposure times (see Table 1 for details) to prevent the photobleaching of QUEEN fluorescence and minimize damage to cells.Save the combined images (bright-field and QUEEN) as an nd2 file.Note: The bright-field image is dispensable for calculating the QUEEN ratio, but is useful for examinations of cell viability or cell boundaries. Red fluorescence (emission wavelength > 620 nm) is compatible with QUEEN fluorescence.",
    "In single time-point imaging, collect images of cells from several fields of view for each experimental condition, giving a sufficient sample size for a quantitative analysis. Observations of 3-5 fields yields n > 100 cells in total are appropriate. The parameters used for the fluorescence microscopy of QUEEN are summarized in Table 1.Table 1. Parameters for the fluorescence microscopy of QUEENimgsrc:https://en-cdn.bio-protocol.org/attached/image/20190804/20190804230754_4588.jpg*Exposure time for the acquisition of images of QUEEN expressed in budding/fission yeast."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}