{
  "id": 5335,
  "origin_website": "Bio",
  "title": "<em>In vivo</em> Efficacy Studies in Cell Line and Patient-derived Xenograft Mouse Models",
  "procedures": [
    "Preparing cells for transplantationGrow and expand cells according to recommended conditions. If cells were thawed from cryogenic storage, make sure to passage cells at least two times before harvesting for transplantation.Harvest cells while in exponential growth phase (approximately 80-90% confluence) using trypsin or appropriate enzymes for the specific cell line. Suspend cells in medium plus serum. Count cells.Spin cells at 225 x g at 4 °C for 5 min. Resuspend cells in HBSS to a concentration of 0.5-2 million cells/200 µl. Place cells on ice and transport to vivarium.Notes: Not all cell lines will grow in vivo. It is highly recommended that a pilot study is performed to determine the optimal concentration of cells needed to develop tumors that grow to 100 mm3 within 2-5 weeks from injection.Cells should be tested to ensure that they are not contaminated with viruses that are harmful to immunodeficient mice. This can be done using a traditional murine antibody production (MAP) test or one of the more sensitive PCR-based tests, such as the Research Animal Diagnostic Laboratory (RADIL) infectious microbe PCR amplification test (IMPACT) (IDEXX BioResearch).Subcutaneous injection or mammary fat pad injection of cellsNote: Please view video for additional information on procedure (Video 1).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Preparation for xenograft procedures If using immunodeficient mice with hair, shaving with electric clippers may be necessary.For subcutaneous injections, shave the right, dorsal flank of the mouse from the hindlimb to the forelimb.For mammary fat pad injections, locate the fourth mammary fat pad (on the ventral side) and shave the fur over the fourth mammary fat pad and up around the dorsal side of the mouse.Fill 25 gauge needle with appropriate volume (typically 0.1-0.2 ml), carefully expelling any bubbles that may enter the syringe.",
    "Injecting the cells:For subcutaneous injections, restrain the animal in an upright position by grasping the skin over the shoulders with the thumb and index finger so that the fore legs are extended out to the side, keeping the front feet from pushing the syringe away.Gently insert the needle, bevel up, into the skin on the dorsal flank. Proceed to insert the needle slightly deeper than the skin to reach the subcutaneous pocket (deeper than the skin but avoid the underlying muscle layer).Take care to direct the needle away from the fingers that are restraining the mouse.Gently expel the contents of the syringe. The contents of the syringe should inject easily without resistance.  Resistance will indicate improper placement of the syringe, in either the muscle or skin. If in the muscle, a droplet of blood might be observed following the withdrawal of the syringe. If in the skin, the skin will expand and a whitish bleb (raised surface) will appear.For mammary fat pad injections, restrain the animal in an upright position by grasping the skin over the shoulders with the thumb and middle finger so that the fore legs are extended out to the side.Gently insert the needle into the 4th mammary fat pad. The needle should be inserted proximal to the nipple, bevel up, and 2-4 mm under the skin. In athymic nude mice you will be able to observe whether the needle is in the fat pad.Gently expel the contents of the syringe. The contents of the syringe should inject easily without resistance.  Resistance will indicate improper placement of the syringe, in either the muscle or skin.  At this point, the mouse may be placed back in the cage.",
    "Note: To practice proper placement, dyes such as trypan blue can be injected into the subcutaneous pocket or the mammary fat pad. It is important to avoid injecting into the inguinal lymph node in the 4th mammary fat pad. Preparing primary tumor tissue for transplantationIt is recommended that primary and serial tumor transplantation be performed with tumor fragments as opposed to single cell preparations in order to maintain the molecular and histological heterogeneity. When receiving patient samples, always keep them on ice until the tissue is processed.Using a dedicated tissue culture hood for human tissues, take the tissue sample and put it onto a sterile 100 mm tissue culture dish. Pipette 1 ml PBS with 1% penicillin-streptomycin onto the tissue to keep it moist. This also helps to prevent the tissue from sticking to your instruments while processing.Cut the tumor into implantable pieces (approximately 3 x 3 x 3 mm) using sterile scissors and forceps. Place the tumor pieces in ice-cold PBS with 1% penicillin-streptomycin in either an Eppendorf tube or 15 ml conical tube depending on the volume of tumor pieces and put on ice.If needed, snap freeze the remaining tumor in liquid nitrogen for future analysis.Spray all instruments with 70% ethanol, then wash with surgical cleaner, and sterilize by autoclaving.Follow the surgical procedures below once the tumor pieces have been transported to the vivarium.Note: Patient samples are not routinely tested for bloodborne pathogens. Proper technique and safety protocols should be followed when handling human tissue. Preparing cryopreserved tumor tissue for transplantationThaw the tumor in the cryogenic vial in a 37 °C water bath for approximately 2 min.Using a dedicated tissue culture hood for human tissues, take out the tumor from the cryogenic vial with sterile forceps and place in a sterile 100 mm tissue culture plate.",
    "If the tumor tissue is larger than 27 mm3, cut the tumor into implantable size chunks (approximately 3 x 3 x 3 mm) using sterile scissors. Place the tumor pieces in ice-cold PBS with 1% penicillin-streptomycin in either an Eppendorf tube or 15 ml conical tube depending on the volume of tumor pieces and put on ice.Follow the surgical procedure below once the tumor pieces have been transported to the vivarium.Harvesting patient-derived xenografts for serial transplantationNote: Please view video for additional information on procedure (Video 2).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Harvesting patient-derived xenografts for serial transplantation  For serial transplantation or transplantation for drug studies, it is often possible to obtain 20-50 transplantable pieces from a single tumorgraft. It is critical that necrotic regions of the tumor are avoided.Euthanize the mouse carrying the patient-derived tumor according to your institutional IACUC protocol. Ideally euthanasia should be performed in the same room as the tumor implantation surgery.Immediately following euthanasia, remove the PDX tumor using aseptic technique as follows:Place the mouse on an absorbent underpad and spray the entire mouse down with 70% ethanol, concentrating on the tumor area.Set up two sets of sterile forceps and scissors and lay them in 100 mm culture dishes to avoid surface contamination.Remove the tumor using the two separate sets of forceps and scissors. The first set is used to cut into the skin (dirty side). The second set should be used for internal dissection (clean side) of the tumor. Be careful not to let the tumor touch the outside skin of the mouse or any other sites of potential contamination. Place the tumor in a new sterile 100 mm tissue culture dish.Rinse the tumor with ice-cold PBS with 1% penicillin-streptomycin (approximately 1 ml per tumor is sufficient).",
    "Cut and process any tissue needed for cryopreservation, histology, or snap freezing before cutting pieces for transplant.Cut the tumor into as many implantable pieces as needed (approximately 3 x 3 x 3 mm), working as quickly as possible.Place the pieces in ice-cold PBS with 1% penicillin-streptomycin in a new sterile culture dish on ice.Proceed to transplanting the tumor pieces into new mice as described in Procedure F.Dispose of the donor mouse carcass.Mammary fat pad or subcutaneous transplantation of tumorgraftsNote: Please view video for additional information on procedure (Video 3).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 3. Mammary fat pad transplantation of tumorgrafts Tape a sterile absorbent underpad to the benchtop (30 x 15 cm) for surgical procedures.Anesthetize the mice for transplant in batches of five or as a cage group to minimize the length of time they are under anesthesia. Described below is the procedure for using the isoflurane as an anesthesia at our institution.Tape the isoflurane nosecone to the left edge of the absorbent underpad.Check the waste gas scavenging system on the anesthesia machine before work begins. Open the valve to the house vacuum to allow negative pressure to be maintained in the gas scavenging interface device. Check the position of the valve leading to the nose cone to make sure it is in the ‘off’ position. Failure to monitor the position of the valves when beginning work and throughout the procedure may allow excess gas to escape into the lab space and cause a health danger to personnel in lab area. Open the valves to the oxygen tank. Adjust the pressure to between 10-15 psi and the flow to 1 L per minute. Note that the flow may need to be increased, depending on the number of mice that are being anesthetized.Open the anesthesia chamber and place the mouse inside.",
    "Close the lid to the chamber before starting the anesthesia. Adjust the vaporizer to 3 percent isoflurane in oxygen. Monitor the animal. When cessation of movement occurs, close the valve to the chamber and open the valve to the nose cone. If more than one mouse is being anesthetized, maintain the anesthesia flow to the chamber. While mice are being anesthetized, set up the rest of the surgery station keeping everything as aseptic as possible (open sterile scissors, forceps, and a trocar syringe and set on the inside of the sterilization pouch or into a sterile 100 mm tissue culture dish, open the betadine swabs, set out sterile alcohol pads, and load staples into the surgical stapler).Remove one mouse from the isoflurane chamber after it has reached surgical anesthesia level.Pull up the skin at the base of the mouse’s neck and inject 100 µl of 5 mg/kg ketoprofen (or equivalent analgesic) subcutaneously with a 28 gauge needle. For mammary fat pad transplantation:Open valve to nose cone and place the mouse’s nose in the nosecone with the dorsal side of the mouse facing down toward the absorbent underpad. Locate the fourth mammary fat pad and shave the fur over the fourth mammary fat pad and up around the dorsal side of the mouse using electric clippers.Swab the shaved skin with betadine.Wipe off the betadine with sterile alcohol prep pads.  Pull up the skin right above the nipple with forceps and cut a small incision using scissors (4-5 mm) horizontally across the fourth mammary fat pad.Use the trocar syringe to make a vertical guide path underneath the skin for the tumor, following the fat pad around to the back of the mouse.Remove the trocar and place a tumor piece into the tip of the syringe with forceps.",
    "Transplant the tumor piece into the fourth mammary fat pad by inserting the trocar back into the incision and pushing it around to the back of the mouse through the guide path, expelling the tumor.Note: The farther the tumor engrafts away from the nipple or groin area of the mouse, the easier it will be to measure with calipers. Alternatively, a pair of small, curved forceps may be used in place of a trocar to make a guide path under the skin for the tumor. Gently insert the forceps into the fourth mammary fat pad and move around in a small circular motion to create a pocket for the tumor. These same forceps will then place the tumor into the fourth mammary fat pad.Slowly and gently remove the trocar, ensuring that the tumor remains deep within the fourth mammary fat pad.For subcutaneous transplantation:Open valve to nose cone and place the mouse’s nose in the nosecone with the ventral side of the mouse facing down toward the absorbent underpad. Shave the right, dorsal flank of the mouse from the hindlimb to the forelimb.Swab the shaved skin with betadine.Wipe off the betadine with sterile alcohol prep pads.  Pull up the skin right on the dorsal flank with forceps and cut a small incision using scissors (4-5 mm) horizontally.Use the sterile scissors or forceps to make a small pocket under the skin and place a tumor fragment under the skin. Make sure to place the tumor fragment at least 3 mm from the opening.Grasp both ends of the initial surgical opening with forceps, pull up, and adjust your hands and the forceps so that you are grasping the edges of the incision with one forcep. While still pulling up the skin, staple the incision shut.",
    "Avoid stapling into the body cavity of the mouse.Transfer the mouse to a temporary, clean cage on a 37 °C warmer. Monitor the animal closely until it regains consciousness.Proceed with the tumor implants on the remaining four mice, transferring each to the warming cage after surgery. When all mice have regained consciousness and are moving normally, they can be transferred to their standard housing cage.  When surgery has been completed on the fifth mouse, you may transfer five additional mice to the isoflurane chamber to anesthetize.When finished, turn off the isoflurane machine and spray all surfaces with 70% ethanol and wipe down, followed by antiseptic, such as Clidox.Clean all instruments by rinsing in water, then washing with surgical instrument cleaner. Autoclave to sterilize.Remove staples after 7-14 days.Implantation of estrogen pelletsNote: Please view video for additional information on procedure (Video 4).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 4. Subcutaneous transplantation of tumorgrafts If using breast cancer cells or a patient-derived breast cancer tumor that is estrogen dependent, it is necessary to supplement tumor growth with estrogen. Estrogen pellets that consistently release over 60-90 days are recommended.This procedure requires anesthesia and may be performed before or after tumorgraft implantation or cell inoculation. Anesthetize the mouse with isoflurane according to your institutional IACUC protocol. Shave the hair off the dorsal side of the neck above the shoulder blades. The use of depilatory cream is not recommended with immunodeficient models with a SCID background.Swab the exposed skin with a betadine swab and wipe off with sterile alcohol pad.Make an incision equal in diameter to that of the pellet. Pull up the skin on one side of the incision using forceps and make a pocket horizontally with a pair of forceps or scissors about 1 cm beyond the incision site.Insert the estrogen pellet into the pocket using forceps.",
    "Staple or glue the incision shut (some mice will not tolerate a staple in their neck and will scratch it out, leading to loss of the estrogen pellet).Remove staple after 7-14 days.Cryopreservation of tumor tissuePrepare freezing medium: Media + 10% FBS + sterile 10% DMSO.Place aseptically harvested tumor tissue into a sterile culture dish and rinse with approximately 5 ml of sterile PBS containing 1% penicillin-streptomycin.Visibly examine the tissue to carefully remove and discard any necrotic and non-tumor tissue from the tumor specimen.Using forceps and scalpel, dissect the tumor tissue into 3 x 3 x 3 mm fragments; depending on the tumor type, some tissue may be more easily dissected by teasing apart with forceps rather than by cutting with a scalpel.Label cryogenic vials with tumor tissue ID and date harvested and add 1 ml freezing medium.Place a single tumor fragment into a cryogenic vial, tighten cap and place in the slow-rate freezing apparatus.Replace lid on freezing apparatus and place into -80 °C freezer overnight. The tumor tissue will freeze at a rate of 0.5 °C/min to -20 °C and 1 °C/min to -80 °C.Following overnight freezing, store cryogenic vials in a liquid nitrogen freezer and record location and date of cryostorage.Tumor measurement and drug treatment (oral gavage and intraperitoneal injection)Tumor growth should be measured 2 to 3 times weekly using calipers (length, width, and height). Gently restrain the mouse in a manner that allows access to the tumor.Bring the calipers to the longest side of the tumor to measure the length. Gently squeeze the calipers together until the borders of the tumor are within the caliper jaws.Bring the calipers to the narrower side of the tumor to measure the width.The height measurement may be taken by trying to use the calipers to gauge the height of the tumor.",
    "Alternatively, a plastic ruler may be placed flush with the base of the tumor and the height of the tumor read.Record length, width, and height measurements appropriately. Note: For most consistent results, the same person should measure tumors for the duration of the study. Otherwise, variability may be observed since each person may squeeze the tumors differently during measurement.Tumor volume can be calculated by an ellipsoid volume formula (π/6 x L x W x H) or the volume formula (L x W x H) (Tomayko and Reynolds, 1989).The tumor volume at which drug treatment begins is dependent on the goal of the experiment, but in general the tumor should be at least 100 mm3 to ensure established tumor growth. If the goal of the experiment is to test ‘prevention’ of tumor growth, the drug treatment timeline should be adjusted.For experiments conducted on established tumors, an approximate tumor volume average of 150 mm3 is used as the drug treatment starting size. When a cohort of animals has an average tumor size of 150 mm3, the mice are randomized into treatment groups. Animals with tumors less than 115 mm3 are not included in the first cohort and will be randomized into a second cohort of mice and enrolled on study at a later date.Note: The rate and uniformity of tumor growth is entirely dependent on the properties of the tumor cell line or tumorgraft. In some experiments, all the transplanted mice will be able to start treatment at the same time and in some experiments, it may be necessary to divide the animals into several cohorts that are enrolled on study with at various dates.After randomization the mice are treated with vehicle or drug depending on their assigned treatment group.The dosage, dosing schedule (weekly, daily, twice daily, etc.",
    "), and vehicle is determined by the chemical compound. This information is often available in the published literature or from the pharmaceutical company that provides the compound.Oral gavage dosing.Weigh the animals to determine the average weight and dose/volume needed. The maximum volume that can be gavaged in a mouse is 200 µl.   Prepare the 22 gauge gavage needle by attaching to a 1 cc syringe.Restrain the animal in an upright position by grasping the skin over the shoulders with the thumb and index finger so that the fore legs are extended out to the side, keeping the front feet from pushing the gavage tube away. Hold the animal’s head in place by gently extending the head back (this extension of the head creates a straight line through the neck and esophagus).The gavage needle is used to measure the distance from the mouth to the last rib (stomach) of the mouse. This is approximately how far the gavage needle must be inserted to ensure an effective procedure.Insert the bulb of the needle into the corner of the mouth. Reposition the bulb toward the center and run it along the roof of the mouth.Using the needle as a lever, gently push back (upright) the head and the nose of the mouse. (The restraining hand is kept upright, not bent back.) Slowly feed the gavage needle down the esophagus to the pre-measured distance. If resistance is felt, do not advance the needle any further. If necessary, retract the needle until the bulb is at the front of the mouth (but not out) and reinsert. Do not attempt insertion more than 3 times. If insertion fails after 3 attempts the animal must be allowed to rest for 2 h. After the rest period, the insertion may be attempted an additional 3 times.",
    "If the second round fails, the attending veterinarian should be consulted before continuing any oral gavage.Advance the needle, extending the head and the nose further back or upright. Make sure the needle is fully inserted into the pre-measured target point prior to pushing the plunger.Push the plunger to release the contents into the animal’s stomach.Note: Gavage needles may be used on multiple animals within a study. However, needles should be changed between treatments.Intraperitoneal (IP) injectionTo locate the point of entry for the needle draw an imaginary line across the abdomen just above the knees. The needle will be inserted along this line on the animal’s right side and close to the midline. In female animals, the point of entry is cranial to and slightly medial of the last nipple. Inserting the needle on the mouse’s right side avoids the cecum. To restrain the mouse: grasp the skin over the shoulders with the thumb and index finger. Tilt the head so that it is facing downward and the abdomen is exposed. To perform an IP injection, the mouse must be well restrained so that it cannot move during the procedure. This avoids traumatizing the organs once the needle has entered the abdomen.Insert the 27 gauge needle into the abdomen at about a 30-degree angle. The shaft of the needle should enter to a depth of about half a centimeter.Prior to injection, aspirate to be sure that the needle has not penetrated a blood vessel, the intestines, or the urinary bladder.Greenish brown aspirate indicates needle penetration into intestines.Yellow aspirate indicates needle penetration into the bladder.If any fluid is aspirated, your solution is contaminated and must be discarded and the procedure repeated with a new syringe and needle.If no fluid is aspirated, you may inject.",
    "Withdraw the needle and return the mouse to its cage."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}