{
  "id": 19363,
  "origin_website": "Jove",
  "title": "Adipose-Derived Mesenchymal Stromal Cells Co-Cultured with Primary Mixed Glia to Reduce Prion-Induced Inflammation",
  "procedures": [
    "Mice were bred and maintained at Colorado State's Lab Animal Resources, accredited by the Association for Assessment and Accreditation of Lab Animal Care International, in accordance with protocol #1138, approved by the Institutional Animal Care and Use Committee at Colorado State University.\n1. Isolating and infecting primary cortical mixed glia with prions\nTo isolate primary mixed glia containing both astrocytes and microglia, obtain C57Bl/6 mouse pups aged zero to two days old.\n\tNOTE: This protocol is adapted from previous protocols 15,16.\nEuthanize pups one at a time by decapitation and extract their brain, separating and discarding the cerebellum and brain stem.\n\t\nPlace the brain in a 3 cm Petri dish containing cold MEM/EBSS with 2x Penicillin/streptomycin/neomycin (PSN). Under a dissecting scope, separate brain hemispheres and remove and discard the midbrain. Remove and discard the hippocampus and meninges from the cortex.\nPlace both cortical hemispheres in a 50 mL conical tube containing 5 mL of MEM/EBSS + 2x PSN and place on ice.\nIn a tissue culture hood, remove the media from the 50 mL conical tube by gently aspirating with a pipet, leaving the cortical tissue pieces at the bottom of the tube. With a coated glass pipet, add 10 mL of prewarmed dissociation media and triturate the tissue with the glass pipet 10-20x.\nTransfer the suspension to a 50 mL beaker containing a small stir bar and place on a stir plate at the lowest setting, approximately 30 rpm, for 10 min. Remove the beaker from the stir plate and set it at a 30° angle for 3 min to allow the tissue to settle at the bottom. Remove the cell suspension (supernatant) and transfer to a new 50 mL conical tube on ice.",
    "Add DNase-I (4,000 U/mL) to 10 mL of dissociation media and resuspend the tissue and stir for an additional 10 min. Repeat by adding fresh dissociation media (without DNase-I) 2-4 additional times (one time for every two mouse pups used), and transferring the cell suspension to the 50 mL conical tube on ice, until only fibrous tissue remains in the bottom of the beaker.\nCentrifuge the cell suspension in the conical tube for 10 min at 1,000 × g at 4 °C. Aspirate the supernatant and replace with glial growth medium. Count the cells with a hemocytometer and plate the cells at a density of 106 in 10 cm cell-culture treated dishes. Place in an incubator at 37 °C with 5% CO2.\nAfter 24 h, remove the media and replace it with fresh glial media. Let the cells reach 100% confluence within 2 weeks; then, split and plate them for experimentation.\nFor in vitro prion infection, plate glia at 100,000 cells per well in 6-well plates and allow to reach 80%-100% confluence. Expose brain homogenates, both prion and normal, diluted to 20% in PBS to UV light for 30 min prior to adding to cell culture. Aspirate media off glia to be infected, and to each well, add 1.5-2 mL of glial growth media containing a final volume of 0.1% normal or prion brain homogenate.\nAfter 72 h, aspirate off the media and wash the cells with PBS to remove any residual brain homogenate. Replace with fresh glial growth media (containing no brain homogenates).",
    "To isolate AdMSCs cells, use a serological pipet and gently aspirate the adipose tissue along with ~1 mL of HBSS/Trypsin solution. Transfer to a 4 cm Petri dish containing 2 mL of DMEM/F12 media with 200 U/mL DNase-I and 400 U/mL collagenase/Dispase mixture. With small scissors, cut the chunks of adipose tissue into small pieces (less than 5 mm in size) and incubate at 37 °C for 1.5 h.\nTransfer the contents of the Petri dish to a 50 mL conical tube with a serological pipet and triturate the mixture ~10x with the pipet. Make sure the tissue breaks apart easily and forms a relatively homogeneous mixture. Centrifuge the mixture at 4 °C for 5 min at 1,000 × g to pellet the stromal vascular fraction, which will appear red.\nAspirate the supernatant carefully and wash the pellet with 5 mL of prewarmed sterile PBS and centrifuge at 4 °C at 1,000 × g for 3 min. Aspirate the supernatant and resuspend the pellet in 1 mL of AdMSC media (low glucose DMEM containing L-glutamine and supplemented with 15% heat-inactivated fetal bovine serum (hiFBS), 1% amino acids, 1% non-essential amino acids, and 1% PSN).\nPlace a 40 µm cell strainer on top of a fresh sterile 50 mL conical tube and pipet the cell suspension through the strainer to remove any non-dissociated tissue. Add 9 mL of AdMSC media to a 10 cm cell culture-treated dish and pipet the strained cell suspension into the dish. Place in an incubator at 37 °C with 5% CO2.\nRemove and replace with fresh AdMSC media the following day. Wait for the cells to become 80-90% confluent when they will be ready to be passaged between 72 h and 96 h.",
    "Isolate AdMSCs as described above and passage twice to obtain a consistent homogeneous population 14. Wash cells twice with sterile PBS and pipet 2 mL of prewarmed trypsin (0.25%) onto each plate. Incubate cells at 37 °C for 5 min or until they become fully dislodged from the plate. Add 8 mL of prewarmed AdMSC media to each plate, pipet to mix the cell suspension, transfer to the conical tube, and centrifuge at 1,000 × g at 4 °C to pellet.\nResuspend AdMSCs in 3-10 mL of media (depending on the number of plates used) and count cells using a hemocytometer. Plate 100,000 cells/well in 6-well plates containing AdMSC media. Place in an incubator at 37 °C with 5% CO2 overnight.\nThe following day, stimulate cells with either cytokines or brain homogenate.\n\t\nFor cytokine-stimulated cells, make AdMSC media containing either 10 ng/mL TNFα or 200 ng/mL IFNγ. Use fresh media for control wells.\nFor prion-infected brain homogenate treatments, obtain 20% brain homogenate (in PBS) from terminally infected prion mice (22L or RML strains). Make AdMSC mediawith a final concentration of 0.1% prion-infected or normal brain homogenate for controls.\nAspirate media off the wells and pipet 1.5 mL of cytokine- or brain homogenate-containing media to corresponding wells. Perform in triplicate. Return plates to the incubator.",
    "Remove the media, wash cells 2x with prewarmed PBS, isolate RNA by adding 350 mL of lysis buffer containing 1% βME to each well, and use a cell lifter to remove cell lysates. Perform RNA isolation following the mini kit manufacturer's protocol, including a DNase digestion step. For RT-qPCR, reverse-transcribe 25 ng of RNA per sample and amplify cDNA with SYBR Green and primers for each gene at 10 mM. Analyze mRNA expression using the 2-ΔΔCT method and normalize to the expression of reference gene β-actin 17.\n\tNOTE: All RT-PCR was done following MIQE guidelines.\nPlate BV2 microglia at 50,000 cells per well, or primary mixed glia at 100,000 cells per well in a 6-well plate. Treat BV2 cells the following day with media containing 0.1% prion-infected or normal brain homogenate. For mixed glia, wait until cells are 80-90% confluent to infect with brain homogenate.\nIncubate cells in media containing brain homogenate for 72 h. Wash cells 2x with PBS to remove remaining brain homogenate and add fresh media and return to incubator.\nUse AdMSCs at passage 3 for co-culture. If stimulating AdMSCs, use media containing 10 ng/mL TNFα and treat for 24 h prior to co-culturing with BV2 or mixed glia. Wash stimulated AdMSCs 3x with PBS to remove any remaining TNFα.\nTrypsinize AdMSCs as described in step 1.15 and resuspend in AdMSC media.\nSpin AdMSC suspension at 1,000 × g at 4 °C for 5 min. During this time, replace media on BV2 cells or mixed glia with 2 mL per well of AdMSC media and place inserts for 6-well plates with a pore size of 0.4 micrometers into half of the wells. Add 2 mL of AdMSC media to each insert and an additional 2 mL of media to wells that do not receive inserts.",
    "When finished pelleting AdMSCs, resuspend the pellet in AdMSC media. Count AdMSCs with a hemocytometer and add 50,000-100,000 cells to each insert.\nFor BV2 cells, incubate co-cultures for 24 h. For mixed glia, incubate for as few as 24 h and as many as 7 days.\nAfter incubation with AdMSCs for the desired time, remove the inserts and discard, or place them in a new 6-well plate, wash inserts 2x with PBS, add buffer provided by RNA isolation kit to the mixed glia or BV2 cells, and scrape inserts to analyze AdMSC RNA.\nTreat AdMSCs at passage 2 with media containing 10 ng/mL TNFα. The following day, wash cells with prewarmed sterile PBS 3x and incubate in serum-free AdMSC media for 4 h.\nTo perform migratory cell assay, add 25,000 AdMSCs per insert and incubate cells for 24 h at 37 °C. During this time, migratory cells will move from the top chamber of the insert and adhere to the underside of the insert. Carefully aspirate the contents of both the well and inserts and wash 2x with PBS, leaving 1 mL of PBS in each well to ensure that the inserts remain damp on each side.\nOne at a time, using forceps, remove the inserts and gently but thoroughly wipe the top chamber with a cotton swab to remove any cells that have not migrated. Aspirate the remaining PBS and pipet 500 μL of crystal violet solution to both the well and top chamber of the insert, ensuring that the insert membrane is fully submerged.\nIncubate inserts for 1 h in crystal violet solution at room temperature. To best retain color, perform the next steps quickly, with only one insert at a time.",
    "Aspirate crystal violet solution from the well and top chamber of the insert and wash 3x with PBS. Wipe the top chamber again with a cotton swab.\nPlace the insert in a well in a new 24-well plate containing 1 mL of PBS. Place the plate above an inverted microscope with a camera attached. Using the 10x objective, take images of four random areas toward the center of the insert, focusing only on the bottom side of the insert.\nAfter performing this with each well, upload images to the image processing software of choice, and adjust the background to enhance the contrast with the purple-stained cells. Count the cells manually with a cell counter.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}