{
  "id": 3596,
  "origin_website": "Cell",
  "title": "Protocol for generating mutant zebrafish using CRISPR-Cas9 followed by quantitative evaluation of vascular formation",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nSelection of the specific CRISPR-Cas9 target sequence\nTiming: 1 h\nIn this section, we show the detailed steps for identifying the gene of interest and designing the target site on the exon.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3163-Fig1.jpg\nFigure 1. Design the CRISPR targeting sequence\n(A) Snapshot of the ZFIN browser website showing how to obtain a DNA sequence of interest.\n(B) Screenshot of the CHOPCHOP web application used to design sgRNAs.\nChose the specific target sequence in the zebrafish genome, and search the zebrafish DNA sequence in The Zebrafish Information Network (https://zfin.org/[href=https://zfin.org/]).\nSelect: Gene/Transcript.\nSearch for a specific gene of interest (e.g., cgasa gene).\nChoose Genome Resources for Ensembl (GRCz11): ENSDARG00000021572 (Figure 1[href=https://www.wicell.org#fig1]A).\nSelect “Transcript ID” and “Exons” from the “Sequence” menu in the upper left corner.\nNote: The target sites should cover all transcriptional variants for nonallele mutations in most situations unless a specific transcriptional variant is of interest.\nDownload and save the exon sequence of interest.\nNote: In this protocol, we mainly investigate the roles of the zebrafish cgasa gene. However, any other specific zebrafish gene should be potentially applicable for this strategy.\nGenotyping PCR design\nTiming: 30 min\nThis section is the detailed protocol for designing a pair of primers containing CRISPR target sequence.\nDesign PCR primers for the specific sgRNA target site.\nCHOPCHOP (http://chopchop.cbu.uib.no/[href=http://chopchop.cbu.uib.no/]) has the option to design PCR primers of the specific sgRNA target site. Click on the specific sgRNA of interest in the window to design PCR primers.\nIn the listed primer set, select a suitable primer set based on Tm, the percentage of GC, and amplicon size (350–700 bp).\nNote: The distance difference from the primers to the sgRNA sequences should be more than 50 bp.",
    "Perform DNA sequencing of PCR amplicons to confirm the gRNA target sequence in case of SNP.\nDesign of single guide RNA oligos\nTiming: 1–2 h\nEffective sgRNAs, which are responsible for recruiting Cas9 to specific genomic loci, are critical for successful CRISPR-Cas9 gene editing. Generally, the CRISPR targeting sequences, located in the adjacent motif of the protospacer adjacent motif (PAM) site, include a single guide (usually 20 base pairs in length), which can be specifically recognized and cleaved by Cas9. In addition, when using T7 or SP6 to synthesize sgRNA, target sequences must start with GG (T7) or GA (SP6). We recommend selecting the GG targets if possible, as T7 polymerase is more efficient than SP6 for RNA synthesis. There are many web-based sgRNA design tools that have different features and advantages.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3163-Fig2.jpg\nFigure 2. Synthesis of sgRNA and Cas9 mRNA in vitro\n(A) Schematic of sgRNA synthesis. sgRNAs are synthesized by annealing two oligos. In this schematic, the T7 promoter sequence is depicted in yellow, the 20-bp target sequence in gray‒green (the NGG PAM site is not included in this sequence) and the remaining sgRNA sequence in orange.\n(B) Oligo assembly of sgRNA oligos. Target-specific oligos are annealed and extended with the generic sgRNA oligo, and the assembled products are run on a 1% agarose gel; Lane M: marker (1 kb). Lanes 1–3, assembled products.\n(C) The assembled oligos were used as templates for an in vitro transcription reaction. The purified sgRNA was run on a 2% DNA agarose gel. Lane M, marker; Lanes 1–3: synthesized sgRNAs.\n(D) Structure of the circular pXT7-hCas9 plasmid. Gray green, human codon-optimized Cas9; orange, UTRs; blue, T7 promoter sequence; yellow, NLS sequence.",
    "(E) In vitro transcription of Cas9 mRNA on a 1% DNA agarose gel after purification and DNase treatment. Lane M, marker (10 kb ladder); Lane 1, circular DNA template; Lane 2, digested linear DNA template; Lane 3, purified Cas9 mRNA.\nUtilize the web tool CHOPCHOP to design sgRNAs.\nSearch RefSeq/ENSEMBL/gene ID/genomic coordinates or retrieve the desired target sequence from a database and subsequently choose a genome assembly, such as danRer10 or danRer11.\nSelect: Find Target Sites.\nShow the sequences on a new web page, according to the sgRNA design setting (Figure 1[href=https://www.wicell.org#fig1]B).\nThe GC content of the designed sgRNA sequence should be 40%–60%, which might be more effective.6[href=https://www.wicell.org#bib6]\nConsidering secondary structure (self-complementarity), we choose a self-complementarity of 0, which does not form a secondary structure.\nConsidering off-target effects (MM0, MM1, MM2, MM3), select MM0 = 1 and MM1, MM2 and MM3 = 0 (MM represents mismatch), indicating that there is no similar target with 1, 2, or 3 base mismatches, so that the possibility of off-target effects is relatively low.\nCritical: To effectively generate a genomic deletion in the target region of interest, the most efficient guide will be separately identified from 3 potential candidates and selected for the following experiment.\nAnalyze the off-target events using the web-based application CCTop (https://cctop.cos.uni-heidelberg.de:8043/[href=https://cctop.cos.uni-heidelberg.de:8043/]).\nInput the sgRNA sequence and the corresponding species genome. The website will display the coordinates of off-target sites and gene IDs.\nVerify these off-target sites by PCR, T7EI and sequencing.",
    "Note: In our experiment, by analyzing the sequence of the zebrafish cgasa gene at http://chopchop.cbu.uib.no/[href=http://chopchop.cbu.uib.no/], we selected a sgRNA (sgcgasa) to target the cgasa sequence. In the process of sgRNA synthesis, a cloning-free, oligo-based method was employed (Figure 2[href=https://www.wicell.org#fig2]A). The procedure necessitates the utilization of a DNA oligonucleotide that is specific to the target (referred to as the top-strand oligo) with a length ranging from 55 to 57 nucleotides. Additionally, a \"generic\" DNA oligonucleotide is required for sgRNA (known as the bottom strand Ultramer) with a length of 82 nucleotides.\nNote: Target sequences should start with GG when T7 is utilized to synthesize sgRNA.\nIn vitro synthesis of sgRNA using cloning-free methods\nTiming: 2 days\nCritical: In this step, ensure the concentration of sgRNA is > 100 ng/μL after purification to avoid the low concentrations of transcription products.\nAnneal the top-strand oligo and bottom strand Ultramer and extend with TransStart FastPfu DNA Polymerase.\nPrepare 10 μM top- and bottom-strand oligos.\nNote: The top-strand oligo contains a 17-nt-long T7 promoter (5′ TAATACGACTCACTATA 3′), 5′ GG of the 20-nt target sequence (5′ GGAGCAAGTCTGAAGAAAAGCA 3′) and finally a 20-nt sequence complementary to the guide RNA: 5′ TAATACGACTCACTATAGGAGCAAGTCTGAAGAAAAGCAGTTTTAGAGCTAGAAATAGC 3’. The bottom strand Ultramer: 5′ AAAAGCACCGACTCGGTGCCACTTTTTCAAGTTGATAACGGACTAGCCTTATTTTAACTTGCTATTTCTAGCTCTAAAAC 3’.\nPerform the oligo assembly reaction to synthesize the double-stranded DNA template (Figure 2[href=https://www.wicell.org#fig2]A).\ntable:files/protocols_protocol_3163_7.csv\nPCR conditions.\ntable:files/protocols_protocol_3163_8.csv\nRun agarose gel electrophoresis.\nNote: The expected size of the assembled oligo should be approximately 100 bp (Figure 2[href=https://www.wicell.org#fig2]B) (troubleshooting 1[href=https://www.wicell.org#sec6.1]).\nPurify the PCR products from step 5 using a QIAquick PCR Purification kit according to the manufacturer’s instructions[href=https://www.qiagen.com/us/products/discovery-and-translational-research/dna-rna-purification/dna-purification/dna-clean-up/qiaquick-pcr-purification-kit].\nSet up sgRNA synthesis reaction at 20°C–24°C with MAXIscript T7 Transcription Kit, and then incubate the mixed solution at 37°C for 1 h.\ntable:files/protocols_protocol_3163_9.csv\nDetermine the reaction by agarose gel electrophoresis.\nAdd 1 μL DNase and incubate at 37°C for 20 min.",
    "Purify the synthesized sgRNA with lithium chloride solution provided by the mMessage mMachine T7 Transcription Kit.\nAdd 50 μL of the lithium chloride precipitation solution into the reaction mixture. The samples were mixed well and incubated at −20°C for 30 min.\nCentrifuge the samples at 4°C for 15 min at 14,000 × g and discard the supernatant.\nWash the pellet with 1 mL of 70% ethanol and centrifuge the mixture for 10 min at 14,000 ×.\nRemove the supernatant completely.\nAir-dry the pellet until it became transparent. Resuspend the pellet in 20 μL nuclease-free water.\nDetermine the reaction by agarose gel electrophoresis (Figure 2[href=https://www.wicell.org#fig2]C) and measure the RNA concentration using a spectrophotometer.\nNote: The concentration of sgRNA should be > 100 ng/μL, with an A260/280 ratio range of 2.0–2.3 (troubleshooting 2[href=https://www.wicell.org#sec6.3]).\nPause point: Store sgRNA in aliquots at −80°C for several months.\nIn vitro transcription and purification of Cas9 mRNA\nTiming: 1 day\nFor the transcription and purification of Cas9 mRNA, it is very critical to prevent RNA degradation.\nDigest 5 μg of circular pXT7-hCas9 plasmid (Figure 2[href=https://www.wicell.org#fig2]D) with XbaI endonuclease in 50 μL of total volume at 37°C for 3 h.\nDetermine the digestion product by agarose gel electrophoresis.\nNote: Generally, the circular plasmid should be fully digested after 3-h incubation. As a rule, the circular plasmid is supercoiled, so the molecular weight of the linearized plasmid will be slightly larger than that of the circular plasmid. In addition, incomplete digestion usually results in additional bands above the expected bands on a gel.\nPurify the linearized plasmid with a Tiangen DNA Purification Kit.\nQuantify the concentration of the digested DNA with a NanoDrop spectrophotometer.\nNote: The concentration of digested DNA should be > 150 ng/μL, with an A260/280 ratio between 1.7 and 1.9 (troubleshooting 2[href=https://www.wicell.org#sec6.3]).",
    "Perform the in vitro transcription reaction with the mMESSAGE mMACHINE T7 Transcription Kit according to the reagent manual[href=https://www.thermofisher.cn/document-connect/document-connect.html?url=https:/assets.thermofisher.cn/TFS-Assets%2FLSG%2Fmanuals%2Fcms_055516.pdf] and then incubate at 37°C for 3 h.\ntable:files/protocols_protocol_3163_10.csv\nDetermine the reaction by agarose gel electrophoresis.\nAdd 1 μL DNase and incubate the mixture at 37°C for 20 min.\nPerform the extraction and purification of Cas9 mRNA by the lithium chloride precipitation method.\nDetermine the agarose gel electrophoresis (Figure 2[href=https://www.wicell.org#fig2]E).\nNote: Store Cas9 mRNA in aliquots at −80°C for several months (troubleshooting 2[href=https://www.wicell.org#sec6.3]). Multiple freeze‒thaw cycles might result in the degradation of Cas9 mRNA.\nMicroinjection\nTiming: 2–3 h\nCritical: Make sure the developmental stage of the embryos for injecting the mixture of Cas9 mRNA and sgRNA is one-cell developmental stage.\nBreed zebrafish adults to obtain embryos for microinjection.\nSelect three pairs of healthy male/female adult fish in a breeding tank with a divider the night before microinjections.\nThe next morning, remove the divider from the breeding tank. The female/male fish come into contact and generally started mating and spawning in approximately 10 min.\nNote: Collect the one-cell stage zebrafish embryos immediately after spawning for microinjection.\nPlace fertilized embryos in a 100-mm Petri dish with E3 medium to remove impurities.\nMicroinjection preparation.\nPrepare the microinjection needles using a needle puller.\nNote: The needles for injection are prepared by 1-mm glass capillaries with the following parameters: heater level, 75.9; magnet main-level, 31.9; magnet sublevel, 64.0.\nPrepare the microinjection mold. Pour 2% agarose into a 100-mm dish with a flat surface. Place the plastic mold in the liquid agarose so that the liquid agarose covers the mold and tap to remove air bubbles.\nPrepare 10 μL mixed solutions on ice containing Cas9 mRNA, sgRNAs, and Phenol Red.\ntable:files/protocols_protocol_3163_11.csv",
    "Critical: Each one-cell stage embryo can be microinjected with 300 pg Cas9 mRNA and 25 pg sgRNA for a single target.7[href=https://www.wicell.org#bib7] The total injected amount of mRNA should be no more than 500 pg for individual embryos to avoid developmental toxicity.\nPlace the one-cell stage embryos in the microinjection mold under a stereomicroscope (n = 200 per plate).\nLoad the mixed solutions into a microinjection needle and inject 1.4 nL solutions into the yolk of each embryo at the one-cell stage.\nNote: For embryonic injection control, the same amount of 0.5% phenol red solution was injected into the embryos.\nNote: Generally, the injection pressure was 15–25 psi, and the pulse time of injection was 40–50 ms during microinjection.\nCritical: The volume of the injection solution should be less than 1.8 nL to avoid physical injury to the embryos. The volume size of the injected sample can be calculated by the droplet diameter of the spherical mineral oil in the preliminarily injected embryos.\nCollect the injected embryos and maintain in E3 medium at 28°C.\nRemove the unfertilized embryos at 3–6 h post fertilization (hpf).\nRemove the dead and deformed embryos at 10 and 24 hpf.\nNote: Remove any embryos that appear to be dead or malformed and then replace them with fresh E3 medium. Typically, more than 50% of the embryos in the injected group should exhibit a normal developmental phenotype.\nEstimation of sgRNA-induced somatic mutations\nTiming: 3–5 days\nThis section aim to evaluate the efficiency of sgRNA-induced somatic mutations, and subsequently select a more effective sgRNA for gene knockout in the following experiments.\nRandomly select the injected and wild-type control embryos (n = 15 for each group) and place in 1.5 mL tubes at 24 hpf.\nDNA extraction was performed as described below.",
    "Anesthetize all embryos in E3 medium containing 160 μg/mL tricaine methane sulfonate solution.\nAspirate the solution, and then add 100 μL of tissue lysis buffer and 1 μL of proteinase K.\nIncubate at 55°C in a thermostatic water bath for 1 h.\nCritical: Close the lid and vortex every 15 min.\nAfter complete cell lysis, add 150 μL chloroform and centrifuge at 10,000 × g for 4 min.\nAdd 80 μL of isopropyl alcohol into the new centrifuge tube.\nAbsorb 80 μL supernatant into isopropyl alcohol and centrifuge at 10,000 × g for 4 min.\nDiscard the supernatant, add 300 μL of 75% ethanol, and centrifuge at 10,000 × g for 4 min.\nRemove all the liquid before adding 20–30 μL RNase-free water to dissolve the DNA product.\nPerform PCR using the extracted DNA template with primers flanking the region targeted by the sgRNAs (see genotyping PCR design[href=https://www.wicell.org#sec3.2] section).\nSet up genotyping PCR reaction using the TransFast Taq DNA Polymerase Kit as follows.\ntable:files/protocols_protocol_3163_12.csv\nPerform the PCR.\ntable:files/protocols_protocol_3163_13.csv\nDetermine the PCR products with agarose gel electrophoresis.\nIncubate 8.5 μL of PCR product from step 29 for annealing.\nRun the annealing reaction in a PCR apparatus. Incubate PCR product at 95°C for 5 min, ramp down at 0.1°C/s from 95°C to 16°C.\nAdd 0.5 μL of T7EI and 1 μL of buffer into the annealing product at 37°C for 15–30 min.\nNote: T7 endonuclease I (T7EI) is an enzyme with substrate structure selectivity. The enzyme acts on different DNA substrates with different activities. When cutting specific substrates, the amount of enzyme and reaction time must be controlled. When the reaction temperature exceeds 42°C, the nonspecific nuclease activity will increase. Avoid reaction temperatures above 55°C, which will lead to reduced enzyme activity.",
    "Determine all the T7EI-treated products from the wild-type control (Figure 3[href=https://www.wicell.org#fig3]A; Lanes 1 and 2) and the injected (Figure 3[href=https://www.wicell.org#fig3]A; Lanes 3 and 4) groups with agarose gel electrophoresis.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3163-Fig3.jpg\nFigure 3. Genotyping PCR assays\n(A) Representative image of agarose gel results of the T7EI assay from two repeated experiments. Lanes 1 and 2 are from the control group (wild-type embryos) after T7EI digestion, whereas Lanes 3 and 4 are from the injected group after T7EI digestion. As denoted by the broken line, unrelated outcomes on the gel were excluded from the retained results on the gel.\n(B) Representative image of an agarose gel resulting from the identification of positive colonies (n = 20). The samples with stronger signals (n = 13; marked in red) will be analyzed by the following T7EI assay. M, Marker; con, control group.\n(C) Representative image of the T7EI assay in (B). The samples with stronger signals (n = 4; marked in red), which indicate potential positive mutations, will be analyzed by DNA sequencing. Lanes 1–13 are from the identified samples in (B), and Lane 14 is from the control (wild-type embryos).\n(D) The alignment between the mutant sequence of the cgasa gene from the individual selected colony and the wild-type sequence of the cgasa gene in zebrafish. Red, the CRISPR target sequences; green, PAM; yellow, mutations.\nEstimate the efficiency of somatic mutations induced by sgRNA by comparing the relative intensities between the cleaved and uncleaved bands of the T7EI product in the injected embryos.\nNote: The wild-type control group only exhibits the uncleaved bands of the T7EI product.\nInsert the PCR product from step 29 into the pMD 19-T vector.",
    "Transform the recombinant pMD 19-T vector using competent E. coli DH5α bacteria and culture on LB agar plates (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]) at 37°C for 12–14 h.\nPerform a colony PCR reaction with step 29 conditions.\nLoad 3 μL of PCR products for agarose gel electrophoresis. The 450 bp bands indicate a successful subclone (Figure 3[href=https://www.wicell.org#fig3]B, marked in red).\nPerform T7EI assay by using PCR products from step 36 with step 31 condition, and then run agarose gel electrophoresis (Figure 3[href=https://www.wicell.org#fig3]C, marked in red).\nInoculate each single bacterial solution corresponding to a positive T7EI result into 5 mL of liquid LB medium at 220 rpm in a shaker incubator for 16 h.\nExtract the plasmid with the Tiangen Plasmid Mini-Extraction Kit.\nDetermine the mutant sequence of the cgasa gene from the individual colony was determined by DNA sequencing and then align to the wild-type sequence of the cgasa gene in zebrafish (Figure 3[href=https://www.wicell.org#fig3]D).\nOptional: To evaluate the efficiency of somatic mutation, DNA sequencing for 20 randomly selected colonies can be performed and calculated with the following formula:\nsomatic\nmutation\nrate\n=\nnumber\nof\nclones\nwith\nindel\nmutations\n/\nnumber\nof\nclones\nwith\nPCR\ninsert\nNote: Generally, the CRISPR-Cas9-introduced indel mutation rate of the specific locus is approximately 60%–100% (troubleshooting 3[href=https://www.wicell.org#sec6.5]).\nGeneration of the specific gene knockout homozygous mutation in zebrafish\nTiming: approximately 7–8 months",
    "After injection, although most mutagenesis is degraded during gastrulation, some mutagenesis survives the gastrula stage and has a likelihood of affecting somatic and germline cells in a mosaic way.8[href=https://www.wicell.org#bib8] Mutagenesis is heritable only if it occurs in the germ cells, and these initial individuals are termed founders (F0). To isolate mutations, the injected embryos are raised to adulthood. We usually perform PCR on genomic DNA obtained from caudal fin clips to screen F0 fish for germline mutations. Every F0 individual is mated with a wild-type fish, and subsequently, their offspring from each mating pair are examined for mutations in the resulting F1 generation. Due to potential variations in the recovered mutations at the sequence level, it is necessary to perform genotyping and sequencing to identify F1-positive fish lines. In the context of CRISPR-Cas9, the mechanism induces double-strand breaks (DSBs) at predetermined cleavage sites, which are subsequently repaired through the nonhomologous end-joining pathway (NHEJ).9[href=https://www.wicell.org#bib9] NHEJ is a system characterized by its propensity for errors, which can lead to the deletion or insertion of a small number of base pairs. This phenomenon, referred to as \"indel\" formation, introduces a level of randomness in each individual mutagenesis event.10[href=https://www.wicell.org#bib10] In F1 generations from such positive parents, approximately 20% of embryos inherit mutagenesis. F1-positive individuals will produce 50% F2-positive embryos. The F2 generation generated after F1 generation self-crossing has a homozygous probability of approximately 25%.7[href=https://www.wicell.org#bib7],11[href=https://www.wicell.org#bib11],12[href=https://www.wicell.org#bib12]\nScreening and phenotyping of F0 founder fish (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3163-Fig4.jpg\nFigure 4. Pipeline from microinjection to generating a zebrafish mutant line\nRaise the injected embryos to adulthood (2–3 months of age) and screen for positive F0 by performing PCR with genomic DNA extracted from caudal fin clips.\nFish were anesthetized with system water containing 160 μg/mL tricaine methane sulfonate solution and transferred to a 100-mm Petri dish.",
    "Carefully excise a small section of fish tail using a sterile blade.\nTransfer the excised portion into a 1.5 mL tube on ice.\nPlace the fish in a tank with the system water of the recirculating system and give it time to recuperate from the effects of anesthesia.\nKeep the fish in an individual marked tank in a recirculating system and conduct regular health assessments over a duration of one week.\nExtract genomic DNA from the excised samples from fish tails (as described in step 28).\nPerform genotyping PCR and T7EI assays (as described in steps 24–28) to screen positive F0 founder fish.\nSet up mating pairs between positive F0 adults and wild-type zebrafish, collect their F1 offspring, and maintain them in E3 medium.\nIdentify the mutation in the F1 generation (see estimation of sgRNA-induced somatic mutations section) (Figure 4[href=https://www.wicell.org#fig4]B).\nCritical: Positive mutation of tail clipping does not confirm that the offspring of F0 are positive mutation, since the F0 generation is a mosaic phenotype. Therefore, it is necessary to screen the embryos of the F1 generation to determine whether the adult mutation of the F0 generation is heritable.\nNote: F1-positive generation embryos may have multiple mutant genotypes, and we recommend selecting 1–2 typical mutant strains for the following experiment.\nRaise the F1 embryos to 2 months of age, and extract genomic DNA from caudal fin clips.\nPerform PCR (as described in steps 29–30) and DNA sequencing to confirm the genotype of F1 adults.\nIn-cross the F1 adults that harbor the same deletion to obtain a stable F2 homozygous mutant.\nIdentify F2 homozygotes using tail clipping, T7E1 assay, and DNA sequencing.\nGenerating fluorescence-labeled vasculature in the transgenic zebrafish line\nTiming: approximately 3–4 months",
    "The fluorescence-labeled Tg(fli1a:eGFP) transgenic fish line provides a powerful tool for evaluating vascular formation in vivo through stably expressing eGFP in vascular endothelial cells in zebrafish.4[href=https://www.wicell.org#bib4],13[href=https://www.wicell.org#bib13] Therefore, impaired vasculature formation can be directly detected by visualizing blood vessel morphology with fluorescence microscopy in transgenic zebrafish embryos.\nOut-cross cgas KO F2 and Tg(fli1a:eGFP) homozygotes to generate a Tg(fli1a:eGFP);cgasa−/+ heterozygous zebrafish line (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3163-Fig5.jpg\nFigure 5. Strategy map for screening the Tg(fli1a:eGFP);cgasa−/− homozygous zebrafish line\nGenerating the Tg(fli1a:eGFP);cgasa−/− homozygote fish line.\nIn-crossing the adult Tg(fli1a:eGFP);cgasa−/+ heterozygous line (troubleshooting 4[href=https://www.wicell.org#sec6.7]).\nDetermine the fluorescence intensity of the 3 dpf offspring of the Tg(fli1a:eGFP);cgasa−/+ heterozygous line, and select eGFP-positive embryos with higher fluorescence intensity under a fluorescence microscope.\nNote: The Tg(fli1a:eGFP) homozygote exhibits much higher eGFP fluorescence intensity than the Tg(fli1a:eGFP) heterozygous embryos, which can be easily identified by observing fluorescence intensity at 3 dpf.\nRaise the selected eGFP-positive homozygote to adulthood.\nIdentify Tg(fli1a:eGFP);cgasa−/− homozygote fish using tail clipping, PCR assay, and DNA sequencing.\nIn vivo quantitative analyses of vasculature in transgenic zebrafish\nTiming: 2–3 h (depending on the data)\nVascular-specific transgenic zebrafish with fluorescence-labeled blood vessels can dynamically visualize vascular formation in vivo. AngioTool enables the measurement of vascular networks in microscopy images in a rapid, hands-off, and reproducible manner.14[href=https://www.wicell.org#bib14],15[href=https://www.wicell.org#bib15] AngioTool can evaluate numerous morphological and spatial metrics, such as the areas of the vascular network, the number of vessels, vessel length, vascular density, and lacunarity, as well as an assessment of a specimen’s sprouting activity.\nEnsure that the Java version is JDK7 and confirm that the computer is running the appropriate Java version according to the step-by-step wizard and instructions at https://ccrod.cancer.gov/confluence/display/ROB2/Quick+Guide[href=https://ccrod.cancer.gov/confluence/display/ROB2/Quick+Guide].\nDownload AngioTool from https://ccrod.cancer.gov/confluence/display/ROB2/Downloads[href=https://ccrod.cancer.gov/confluence/display/ROB2/Downloads] (troubleshooting 5[href=https://www.wicell.org#sec6.9]).",
    "The graphical user interface (GUI) of AngioTool contains two tabs, which can be controlled to analyze and customize the numeric or graphical result (Figure 6[href=https://www.wicell.org#fig6]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3163-Fig6.jpg\nFigure 6. AngioTool was used to analyze vasculature formation in transgenic zebrafish in vivo\n(A) Software parameter analysis of AngioTool.\n(B) Representation of the logical analysis flow performed by AngioTool.\n(C) Representative image and quantification of the retinal vasculature in 1-month-old Tg(fli1a:eGFP) fish. Scale bars, 100 μm. Yellow, outline of the vasculature; red, skeleton of the vasculature; blue, branching points.\n(D) Representative image and quantification of trunk vasculature in 1-month-old Tg(fli1a:eGFP) fish. Scale bars, 100 μm. Yellow, outline of the vasculature; red, skeleton of the vasculature; blue, branching points.\nAfter opening an image, AngioTool can automatically detect and analyze vessel profiles according to its default parameters. (troubleshooting 6[href=https://www.wicell.org#sec6.11]).\nNote: The image format is suggested as JPEG or PNG file.\nIdentify, demarcate, and visually outline the vessels of the displayed image by using the controls from the “Analysis” tab (Figure 6[href=https://www.wicell.org#fig6]B).\nThe “Vessel diameter” control allows the user to select vessels according to the diameter of vessels. The adjustment of a higher diameter will only select thicker vessels. The selected vessels are shown as red ticks (Figures 6[href=https://www.wicell.org#fig6]C and 6D).\nTo identify vessels with lower fluorescence intensities, adjust the lower thumb to decrease the numerical values.\nTo exclude nonspecific pixels with higher intensity, decrease the threshold value.\nAdjust the vessel with two additional control selections.\nRemove background particles by clicking \"Remove small particles\" control.\nAdjust the “Fill holes” control to fill unselected regions inside vessels.\nCritical: The \"Hide Overlay\" button allows for the toggling of the overlay, which may be helpful for the continuous assessment of the selection's accuracy throughout the analysis process.",
    "Once the outline overlay matches the vessels of the image, start the analysis by clicking the “Run analysis” button.\nNote: AngioTool provides several controls in the settings tab, which allows the user to customize the analysis or output image.\nThe result will exhibit an overlay image that contains the region of all vessels, the skeleton of the vascular network, and the branching points.\nSave the resulting image by clicking the \"Save result image\" checkbox.\nSave the analysis data by clicking the Excel icon of the “Saving Preferences” panel (Figures 6[href=https://www.wicell.org#fig6]A and 6B)."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}