{
  "id": 15073,
  "origin_website": "Jove",
  "title": "Use of Frozen Tissue in the Comet Assay for the Evaluation of DNA Damage",
  "procedures": [
    "Tissues were harvested during the conduct of studies performed at AAALAC-accredited facilities at NTP contract laboratories in accordance with Good Laboratory Practice regulations (21 CFR Part 58) and animal use protocols approved by the Institutional Animal Care and Use Committee (IACUC) at each laboratory.\n1. Tissue Harvest and Processing\nNOTE: It is useful to prepare duplicate sample tubes (e.g., liver) or transfer approximately half of a sample to another storage tube (e.g., duodenum, stomach) to enable reanalysis, if necessary. To minimize potential sample-to-sample variability for intestinal tract tissues, it is recommended that care be taken to sample the same region of tissue relative to the stomach for each animal, and a sample be divided to generate duplicate samples. Plastic forceps are recommended for transferring sticky tissues such as brain. As an option, minced, scraped or homogenized tissue preparations may be filtered to achieve homogeneous single cell suspensions using a 40 µm cell strainer attached to a conical tube.\nRemove any attached connecting tissue, organs, and debris from organ(s) of interest. Immediately following removal, swish the organ vigorously in a medium-sized weigh boat containing ~7 mL of cold freshly prepared mincing solution (Mg++, Ca++ and phenol red-free Hank’s Balanced Salt Solution, 10% v/v DMSO, and 20 mM EDTA pH 7.5) to remove residual blood and debris.\nTransfer each organ to another clean weigh boat containing sufficient (~7 mL) cold mincing solution to maintain the tissue submerged, on ice, until further processing.\nRemove a section of each organ of interest and place it in an embedding cassette. Fix in 10% neutral buffered formalin, trim, and paraffin embed according to the laboratory’s standard procedures for possible future histopathology evaluation.",
    "For the liver, cut a 5 mm longitudinal section of the left lobe and gently swish in ~7 mL of cold mincing solution. Place the strip of tissue into a clean medium-sized weigh boat containing ~7 mL of cold mincing solution and maintain on ice until ready to process further (step 1.8 or 1.11).\nFor the duodenum, cut a 10 mm portion of the duodenum proximal to the stomach. Using a 21–25 G needle, flush to remove debris and bacteria. \nInsert needle into one end of the duodenum and flush with 1 mL of cold mincing solution.\nFlush the other direction by flipping the duodenum over and repeating with another 1 mL of mincing solution. Discard the needle.\nSlice the duodenum open and rinse it in ~7 mL of mincing solution before putting it into a medium-sized weigh boat containing ~7 mL of clean mincing solution; maintain on ice until ready to process further (step 1.8 or 1.11).\nFor the brain, it may be useful to first divide the brain into two hemispheres; one hemisphere can be saved for possible histopathology (see step 1.2).\nDissect the brain region(s) of interest and gently swish in ~7 mL of cold mincing solution.\nTransfer tissue(s) to a clean medium-sized weigh boat containing ~7 mL of cold mincing solution and maintain on ice until ready to process further (step 1.8 or 1.11; note that small regions such as the cerebellum and hippocampus may not require any further trimming).\nFor the stomach\nRemove and discard the forestomach. Cut open the glandular stomach and wash free from food using ~7 mL of cold mincing buffer in a medium-sized weigh boat.\nRemove a 5 mm strip of glandular stomach proximal to the duodenum for fixation for possible histopathology evaluation (see step 1.2).",
    "Place the remaining stomach into ~7 mL of cold mincing buffer in a medium-sized weigh boat and incubate on ice for 15–30 min.\nNOTE: This incubation step may not be necessary; this step was included in the JaCVAM validation protocol, but is not mentioned in the OECD test guideline8,9.\nTransfer the stomach to a clean piece of paraffin (or Petri dish or weigh boat) and gently scrape the surface epithelium two or more times using a scalpel blade or a polytetrafluoroethene (PTFE) scraper to remove debris. Pick up the gastric mucosa with forceps and rinse with 1 mL of cold mincing buffer using a pipet. Transfer the stomach tissue to a clean surface or dish.\nCarefully scrape the stomach epithelium 4–5 times (more, if necessary) in mincing solution (typically 250 µL/mouse or 500-1,000 µL/rat) with the back of a scalpel blade or PTFE scraper to release the cells. Optionally, rinse tissue with an approximately equal volume of mincing solution to recover more cells. Collect the mincing solution containing released cells using a pipet and transfer to a microcentrifuge tube on ice.\nFor mincing tissue samples, cut a 3–4 mm section of liver or brain tissue or ~5 mm of duodenum and transfer to a labeled 1.5 or 2.0 mL microcentrifuge tube containing 1 mL of cold mincing solution. Rapidly mince (≤30 s) with mincing scissors until finely dispersed, while keeping the sample cold. The sample should look slightly cloudy; however, it is common for some pieces to remain that will settle to the bottom of the tube.\nTo use the tissue fresh, maintain tubes containing minced tissue or scraped epithelial cells on ice; use the tissue to prepare comet slides within approximately 1 h of harvest (outlined in section 2).",
    "For freezing the tissue samples, immediately following mincing or collection of scraped epithelial cells\nSecure the tube lid and drop tube into a Dewar flask containing liquid nitrogen; tubes may be maintained in liquid nitrogen for the duration of necropsy (≤3 h).\nRetrieve tubes using a ladle and place on dry ice to sort. Transfer tubes to a freezer box on dry ice and store box in a -80 °C freezer.\nFor preparing frozen cubes of tissue, cut several small pieces of tissue (≤4 mm in diameter and ~6 mm in length; Figure 1).\nIndividually drop them directly into a medium-sized weigh boat or other suitable vessel containing liquid nitrogen.\nWait a few seconds for the pieces to freeze completely and transfer individual frozen tissue cubes to a labeled microcentrifuge tube or cryotube maintained on dry ice; do not allow the pieces to clump together during the freezing process.\nTransfer tubes to a freezer box on dry ice and store box in a -80 °C freezer.\n2. Slide Preparation\nFor minced/scraped tissue\nMaintain tubes containing fresh tissues on wet ice.\nPlace tubes of frozen tissue into a room temperature water bath until the samples are completely thawed, while ensuring they are kept cold. Immediately transfer the tubes onto ice.\nImmediately prior to withdrawing cells for transfer to agarose (step 2.3), mix each cell suspension gently; for non-filtered samples, allow large chunks to settle to the bottom of the tube. Maintain all tubes on ice until slides have been prepared for all samples.\nFor cubed tissue\nRetrieve tubes containing tissue cubes from the 80 °C freezer and maintain on dry ice until slide preparation.",
    "Aliquot 1 mL of Merchant’s medium (0.14 M NaCl, 1.47 mM KH2PO4, 2.7 mM KCl, 8.1 mM Na2HPO4, 10 mM NaEDTA, pH 7.4) or mincing solution into a labeled 1.7 mL microcentrifuge tube for each sample and maintain on ice.\nWorking rapidly to avoid tissue thawing, place a cube of tissue into the open end of a room temperature tissue mincing device (Figure 1). Multiple tissue pieces may be used; if necessary, the frozen tissue may be cut or cracked into smaller pieces using a cold mortar and pestle to reduce the cube size to fit into the device.\nQuickly insert a size-matched syringe plunger into the device to push the tissue to the mesh end which should then be placed into the microcentrifuge tube containing cold mincing solution; avoid forcing the liquid to overflow the tube. Immerse the mesh end of the device for approximately 5–10 s in the cold mincing solution to allow the tissue to thaw completely.\nCompletely depress the plunger until cells are seen extruding through the mesh pores. Then pull the plunger up approximately 2.5 cm and press down again completely; repeat the process several times until the mincing solution becomes turbid.\nIf necessary, the sample may be concentrated to increase cell density by refrigerated centrifugation for 5 min at 1100 rpm and removal of a portion of the supernatant.\nRepeat the process for all samples using a clean tissue mincing device for each sample.\nTransfer 50 µL of cell suspension to a tube containing 450 µL of 0.5% low melting point agarose at 37 °C.\nNOTE: Volumes may be adjusted, but the amount of agarose should be ≤1%.\nPrepare and score slides as described previously10,11.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}