{
  "id": 6714,
  "origin_website": "Bio",
  "title": "Protocol for Measuring Free (Low-stress) Exploration in Rats",
  "procedures": [
    "The experiment comprises seven habituation trials followed by three trials involving experimental manipulation (see Videos 1 and 2). Experimental manipulation is achieved by introducing novelty, which takes place between trials 7 and 8. Three subsequent trials are conducted in the chamber with this new arrangement (see Video 2). Each trial lasts 7 min and is administered for each animal once a day.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Example of habituation trial. (Experimenters are advised to comply with the local ethical requirements regarding animal experimentation.)<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Example of test trial. (Experimenters are advised to comply with the local ethical requirements regarding animal experimentation.)PreparationFamiliarize the animals with human contact before the experiment.Note: Since the whole procedure is supposed to ensure the lowest possible stress level, systematic animal handling by the experimenter is strongly recommended. A typical procedure would consist of 3 sessions of 5-15 min per week involving holding, tickling, talking to the animals, etc. Mark the rats’ tails with a waterproof marking pen to quickly identify animals in the cage and avoid high stress levels before testing.Arrange the experimental setup as shown in Figure 3.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200108/20200108042536_6420.jpgFigure 3. Lateral view of the experimental settingArrange the object in the experimental chamber in accordance with the experimental protocol (see Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200108/20200108042605_8673.jpgFigure 4. Test arena arrangement during habituation and test trials. An example of a basic experimental plan used previously in Pisula et al., 2019.Reduce background noise to a minimum (alternatively, ‘white noise’ can be used).Ensure complete darkness in the test arena.Make sure that the whole test arena (both the horizontal and the vertical plane) is clearly visible in VR and the IR lamp is placed correctly and sheds light evenly on the entire horizontal surface through the transparent top cover of the chamber.",
    "Make sure that the whole test area has been cleaned with the cleaning agent before the experiment and after each experimental trial (see ‘Materials and Reagents’ above).Run the tests at the same time each day.Experimental procedureTake the animal out of the home cage and gently place it in the transporter.Lock the transporter.Place the transporter in the initial position attached to the test arena (see Figure 3).Leave the animal undisturbed for 15-20 s for adaptation.Open the transporter gate. Allow the animal to leave the transporter or stay in it.Note: The gate should be left open during the whole trial. Leave the experimental room.After a 7-min recording session, enter the experimental room and gently take the animal out of the test arena (it is important not to associate aversive stimulation with any element of the study procedure) and place it in a temporary home cage.Note: Due to the possible confounding effect of animal interactions, the ‘after trial’ temporary cage should be placed in another room. This should prevent interaction between the animals waiting for the measurement and the individuals that have already completed the test. Clean the test arena and the transporter thoroughly.Ensure that the objects inside the chamber are placed correctly, that is, in accordance with the experimental protocol for a given trial (see Figure 4).Repeat the procedure every day for a period of 10 days.Note: After the 7th habituation trial, change the arrangement of the objects in one of the chamber zones in accordance with the experimental protocol for a given trial (see Figure 4)."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}