{
  "id": 2861,
  "origin_website": "Cell",
  "title": "Protocol for optical clearing and imaging of fluorescently labeled ex vivo rat brain slices",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nAcute brain slices preparation\nTiming: 1 h\nAs this protocol is designed to prepare acute brain slices for culturing, it is important to autoclave all surgical instruments and materials before use. Wearing protective gloves, safety goggles, protective clothing, and a face mask is required.\nSetting up the cutting station.\nTo reduce contamination, use water and then 70% ethanol to clean all surfaces including benchtop, vibratome, buffer tray, and tubing system used for diffusing the carbogen. Submerge the razor blade in 70% ethanol and let it dry for 5 min.\nVibratome set up.\nInsert the razor blade into the blade holder and turn the vibratome on.\nCheck the blade’s position using the VibroCheck (see Leica VT1200 S user manual, pages 34–39).\nInstall the double-walled buffer tray (Leica VT1200 S user manual, pages 34–35) and use a silicone tube to connect a gas diffuser to the cylinder of compressed carbogen. The gas diffuser can be either a small micro-filter-candle or an aquarium air curtain.\nTurn on the cooling unit connected to the buffer tray and set it up to 3°C at least 10 min before starting the preparation.\nFill the buffer tray with 300 mL of pre-chilled NMDG-HEPES aCSF solution and maintain it with low carbogen bubbling to maintain minimal turbulence inside the buffer tray during the cutting.\nPlace the vibratome’s specimen plate, a straight forceps, a Moria perforated spoon, a glass petri dish, a single Whatman round filter paper, the liquid super glue, and one razor blade on the benchtop next to the vibratome (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2365-Fig1.jpg\nFigure 1. Brain slicing",
    "(A) Material for preparing the tissue block. Paintbrush n°2 (1), micro-filter candle (2), liquid super glue (3), razor blade (4), single Whatman round filter paper (5), glass petri dish (6), vibratome’s specimen plate (7), straight forceps (8), and Moria perforated spoon (9).\n(B) Surgical instruments for brain dissection. Straight bone cutter (1), straight sharp-blunt scissors (2), Mayo-Noble scissors (3), and long-round tip spatula (4).\n(C) Vibratome sectioning. Silicone tube (1) is connected to an aquarium air curtain (2) surrounding the buffer tray (3). Connection of the cooling unit to the buffer tray (4). Vibratome’s specimen plate submerged into the chilled NMDG-HEPES aCSF solution holding the brain tissue block (5).\nBrain dissection and vibratome sectioning.\nBefore starting the brain dissection.\nPrepare straight sharp-blunt scissors, Mayo-Noble scissors, straight bone cutter and long-round tip spatula (Figure 1[href=https://www.wicell.org#fig1]B).\nAdd 80 mL of pre-chilled NMDG-HEPES aCSF solution into a 100 mL beaker, keep it inside a bucket with ice and continue carbogen bubbling using a small micro-filter-candle.\nPrepare 50 mL of wash buffer and keep it in continuous carbogen bubbling using a micro-filter-candle.\nSurgery.\nDecapitation of the animal is performed with a rodent guillotine following depth anesthesia using an intraperitoneal injection with pentobarbital sodium (30–50 mg/kg).\nTake the animal's head and remove the skin of the scalp using straight sharp-blunt scissors.\nUsing straight sharp-blunt scissors, make a 1 cm lateral/ventral incision cutting both sides of basioccipital bone through the foramen magnum at the occipital bone.\nInsert the scissors again into the foramen magnum and cut dorsally alone the middle line of the interparietal, parietal, and frontal bones until it reaches the nasal bone. The cutting must be superficial and carefully performed to avoid damaging the underlying brain. Take Mayo-Noble scissors and cut the nasal bone transversally at the level of the premaxilla.",
    "Use the straight bone cutter to remove the nasal, frontal, parietal, and interparietal bones on both sides, starting from the rostral towards the caudal direction, to expose the brain.\nRinse the brain with 10 mL of pre-chilled NMDG-HEPES aCSF saturated with carbogen and then take a long-round tip spatula to gently scoop out the intact brain into the beaker prepared in step 2a.\nBrain slicing.\nTake the brain with a Moria perforated spoon and place it on a Whatman round filter paper in a 100 × 15 mm glass petri dish to prepare a tissue block. The tissue block can be prepared by cutting the brains at different angles depending on the region of interest. To prepare cortical coronal slices, the olfactory bulb and the cerebellum were removed, and the brain glued up vertically.\nLift the brain tissue block with straight forceps and fix it on the specimen plate with enough liquid super glue. Immediately, transfer the specimen plate into the buffer tray filled with chilled NMDG-HEPES aCSF continuously saturated with carbogen.\nUse the vibratome’s control panel to set up the desired speed, amplitude of the vibration, and thickness of the slices which can be from 250 to 300 μm. The following parameters were used in this protocol: 0.14 mm/s speed, 1.10 mm amplitude and 275 μm slice thickness. The sectioning started from ventral towards dorsal part of the brain (Figure 1[href=https://www.wicell.org#fig1]C).\nCritical: all animal procedures must follow the policies and guidelines established in your organization (university or company).\nCritical: Wear safety goggles to avoid accidents with the bone shards during the brain dissection.\nCritical: The tissue block preparation cannot take more than 30 sec; otherwise, it will affect the quality of the slices.\nBrain slice culturing\nTiming: 30–45 min",
    "After brain slicing, transfer the brain slices from the vibratome’s buffer tray to a 100 × 15 mm petri dish containing oxygenated pre-chilled wash buffer using a paintbrush n°6 and take them into a laminar flow hood.\nPreparation of equipment and buffers for brain slice culture.\nEnsure that the following necessary equipment is organized for quick access: 6-well culture plate, Millicell culture inserts, autoclaved cover glass forceps and a paintbrush n°6 for transferring the brain slices.\nClean the brush with 70% ethanol, let it dry for 5 min and rinse with deionized water thoroughly.\nAdd 1 mL of brain slice culture medium to each well of a 6-well culture plate.\nPlace a Millicell culture insert into each well using flat cover glass forceps and add an additional 0.5 mL of slice culture media on top of each insert.\nPlace the 6-well culture plate in the incubator at 37°C with 5% CO2 for at least 30 min to ensure that the culture medium is pre-warmed before brain slices are plated.\nBrain slice culture preparation.\nPlace the petri dish containing the brain slices in wash buffer in the laminar flow hood and rinse the brain slices twice with fresh wash buffer equilibrated at physiological temperature (37°C).\nManually transfer individual brain slices to each culture insert in 6-well culture plate using the paintbrush n°6. Perform this step carefully to avoid damaging the tissue (Figure 2[href=https://www.wicell.org#fig2], Methods video S1[href=https://www.wicell.org#mmc1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2365-Fig2.jpg\nFigure 2. Brain slice culturing\n(A) Graphical illustration of the steps for starting brain slice culture.\n(B) Photograph of Millicell culture inserts placed in a 6-well culture plate. On the back, a petri dish containing 3 brain slices in wash buffer.\n(C) Photograph of brain slices positioned on top of Millicell culture insert and immersed in culture medium.",
    "Return the 6-well culture plate now containing the brain slices in culture medium to the 37°C incubator with 5% CO2.\nCritical: Make sure that no areas of the brain slices are folded or wrinkled.\nNote: Brain slices submerged with media do not attach to the membrane of the Millicell culture insert and remain free-floating.\nBrain slice culture maintenance.\nEvery second day, remove ∼ 1 mL of culture medium from the bottom of each well and the excess medium that collects in the Millicell culture insert without disturbing the brain slice.\nAdd 1 mL of fresh and pre-warmed culture medium to the bottom of each well and an additional 0.3 mL inside the Millicell culture insert to submerge the brain slice.\nMaintain brain slices in culture as long as required by the experimental plan.\nCritical: The culture medium needs to equilibrate at 37°C with 5% CO2 for 30 min before transferring the brain slices and before every medium change. Maintain the brain slices in culture under sterile conditions.",
    "Note: (1) Transfer an entire rat coronal brain slice per Millicell culture insert or 1–2 coronal brain slice-separated hemispheres depending on your unique experimental conditions. If more than 1 brain slice is plated, avoid slice overlap and ensure that slices do not contact the sides of the insert. (2) In our experience, brain slices from 275 μm thickness are not disturbed by using a paintbrush to transfer them. Alternatively, an inverted glass Pasteur pipette can be used to position individual slices in each Millicell culture insert although this will transfer wash buffer to the culture plate. Excess wash buffer can be removed by replacing the culture media with fresh and pre-warned culture media immediately after transferring. It is important to avoid prolonged exposure to the wash buffer in culture since it can affect brain slice health.\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Video showing how to use a paintbrush to transfer brain slices from petri dish to 6-well culture plate containing Millicell culture inserts, related to “Brain slice culturing” step 4b\nImmunostaining of brain slice cultures\nTiming: 5 days\nTiming: 45 min (for step 6)\nTiming: 16 h (for step 7)\nTiming: 3–4 days (for step 8)\nFixation of brain slices.\nRemove the culture medium and add 1 mL of 4% paraformaldehyde (PFA) solution pH 7.4 into the well and an additional 1 mL on top of the brain slice and fix for 20 min at room temperature (20°C–23°C).\nGently transfer each fixed brain slice from the Millicell culture insert to a glass vial with lid containing 1 mL KPBS using a paintbrush. This will ensure compatibility with clearing reagents that will be used in the next steps.",
    "Wash the slice 2 × 5 min with KPBS at room temperature (20°C–23°C) by adding 1 mL of KPBS per vial.\nNote: Ensure that the volume of fixative is sufficient to fully immerse the brain slice.\nCritical: Do not fix brain slices longer than recommended. Immunostaining can otherwise be compromised due to excessive cross-linking of proteins. PFA is hazardous (see safety information and chemical handling[href=https://www.wicell.org#sec2.1]) and needs to be always handled under a fume hood and with protective measures.\nPause point: The fixed and washed brain slices can be stored at 4°C in bacteriostatic preservative (0.01% sodium azide in KPBS). Samples are stable for a few weeks.\nPermeabilization and blocking of brain slices.\nRemove the KPBS.\nPermeabilize and block the brain slice by adding 1 mL of blocking solution in each vial.\nIncubate overnight at room temperature (20°C–23°C), or at 4°C for two days.\nAntibody staining of brain slice.\nPrepare the primary antibody solution diluted (for this experiment rabbit anti-Iba1, 1:1000) in 1 mL of blocking solution.\nRemove the blocking solution from the glass vial containing the brain slice.\nAdd 1 mL of primary antibody solution.\nIncubate for 48–72 h at room temperature (20°C–23°C).\nRemove the primary antibody solution.\nWash the sample 3 × 20 min with KPBS at room temperature on a shaking platform at mild speed (100 RPM).\nPrepare the secondary antibody solution diluted 1:200 in 1 mL of blocking solution and add DAPI (1:1000) for nuclear stain.\nNote: Keep the secondary antibody solution protected from light. For example, by covering the tube and glass vial containing the antibody solution with aluminum foil.\nRemove the KPBS from the glass vial containing the brain slice.\nAdd 1 mL of secondary antibody solution.\nIncubate for 24–48 h at room temperature (20°C–23°C).\nRemove the secondary antibody solution.",
    "Wash the sample 3 × 20 min with KPBS at room temperature on a shaking platform at mild speed (100 RPM).\nPause point: The immunostained and washed brain slices can be stored at 4°C in bacteriostatic preservative (0.01% sodium azide in KPBS) while protected from light for up to two weeks. However, we recommend continuing with clearing and imaging right after staining because the fluorescence decreases over time.\nCritical: Throughout the entire staining procedure, be careful not to disrupt the brain slices when removing and adding solutions. Avoid drying out the brain slices. Perform each step on a mildly shaking platform (100 RPM) for homogeneous permeabilization and staining of the tissue. Seal the glass vial during incubation using a lid or parafilm to avoid excess evaporation.\nClearing of immunolabelled brain slices\nTiming: 1 day\nAfter staining, the sample is ready to be cleared for imaging of the entire brain slice. The steps in this process are intended to remove water and lipids from the tissue and match the refractive index throughout the tissue.\nDehydrate brain slices in methanol.\nPrepare the methanol series (20%, 40%, 60%, 80%, 100%).\nRemove the KPBS from the glass vial containing the brain slice.\nAdd 1 mL of 20% methanol and incubate 10 min at room temperature (20°C–23°C) on a shaking platform at mild speed (100 RPM).\nRemove the methanol solution and add 1 mL 40% methanol. Incubate for 10 min at room temperature (20°C–23°C) on a shaking platform at mild speed (100 RPM).\nRemove the methanol solution and add 1 mL 60% methanol. Incubate for 10 min at room temperature (20°C–23°C) on a shaking platform at mild speed (100 RPM).",
    "Remove the methanol solution and add 1 mL 80% methanol. Incubate for 10 min at room temperature (20°C–23°C) on a shaking platform at mild speed (100 RPM).\nRemove the methanol solution and add 1 mL 100% methanol. Incubate for 10 min at room temperature (20°C–23°C) on a shaking platform at mild speed (100 RPM).\nCritical: Methanol is hazardous (see safety information and chemical handling[href=https://www.wicell.org#sec2.1]) and needs to be always handled under a fume hood and with protective measures. Close the glass vials with the lid before positioning them on the shaking platform outside the fume hood.\nRemoval of lipids using DCM treatment.\nRemove the methanol solution.\nAdd 1 mL of DCM/methanol mixture solution. Incubate for 1 h at room temperature (20°C–23°C) on a shaking platform at mild speed (100 RPM).\nRemove the DCM/methanol mixture solution.\nAdd 1 mL of DCM. Incubate for 10 min at room temperature (20°C–23°C) on a shaking platform at mild speed (100 RPM).\nRemove the DCM.\nAdd 1 mL of DCM. Incubate for 10 min at room temperature (20°C–23°C) on a shaking platform at mild speed (100 RPM).\nCritical: DCM is hazardous (see safety information and chemical handling[href=https://www.wicell.org#sec2.1]) and needs to be always handled under a fume hood and with protective measures. Close the glass vials with the lid before positioning them on the shaking platform outside the fume hood.\nClear the tissue using ethyl cinnamate.\nAdd 500 μL of ethyl cinnamate per well in the black Ibidi μ-Plate 24 well plate with flat and clear bottom for high throughput microscopy.\nRemove the DCM from the glass vial containing the brain slice.\nAdd 500 μL of ethyl cinnamate to avoid DCM carry-over.\nGently transfer the cleared brain slice from the glass vial to the Ibidi μ-Plate 24 well plate containing ethyl cinnamate using a paintbrush.",
    "Incubate overnight at 4°C protected from light.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2365-Fig3.jpg\nFigure 3. Brain slice clearing\n(A) Image of a brain slice in KPBS after immunostaining.\n(B) Image of an immunostained brain slice after dehydration and clearing in ethyl cinnamate. Tissue is almost fully transparent with faint colorization.\nNote: The tissue becomes transparent after adding ethyl cinnamate (Figures 3[href=https://www.wicell.org#fig3]A and 3B).\nNote: The No.1.5 polymer coverslip bottom of the Ibidi μ-Plate 24 well plate has the highest optical quality and is resistant ethyl cinnamate treatment.\nPause point: The cleared brain slices can be stored at 4°C in ethyl cinnamate for weeks. However, we recommend imaging the samples the day after clearing because the fluorescence decreases over time.\nCritical: Be very careful not to dry the sample when changing solutions or transferring the tissue.\nConfocal imaging of cleared brain slices\nTiming: 5–30 min per slice\nWe used Leica TCS SP8 point laser scanning confocal microscope with a 10x objective, but the prepared samples can be imaged with any inverted laser scanning confocal microscope equipped with appropriate objectives and filter sets and the imaging parameters would vary depending on the performed immunostaining and experimental goals. Here we used anti-Iba1 primary antibody in combination with Alexa Fluor 647 secondary antibody to visualize microglia in striatal slices. Leica dynamic filter was used for imaging. Imaging the sample using air objective or immersion objective with RI different from ethyl cinnamate (RI = 1.56) results in refractive index mismatch. Geometric distortion along the z-axis caused by RI mismatch can be correct via the formula provided below.\nFlatten the immunostained and cleared brain slice.\nReduce the volume of ethyl cinnamate so it just covers the brain slice.\nPlace a round glass coverslip in the well on top of the brain slice.",
    "Place 3–4 metal nuts on top of the coverslip amounting to 7–10 g of weight in total to mechanically flatten the brain slice.\nImage the brain slice by taking a z-stack throughout the thickness of the sample.\nObjective: 10x NA 0.3.\nZ-step 10 μm.\nResolution: 1024 × 1024 px (pixel size = 1.52 μm).\nScan speed: 400 MHz.\nCorrect for RI mismatch using the following formula.\n   Z  c o r r e c t e d   =  Z  u n c o r r e c t e d    1.56   R I   o b j e c t i v e  i m m e r s i o n     \nNote: Z(corrected) is the actual height while Z(uncorrected) is the perceived height.\nRender 3D view in Vision 4D or similar software (Figures 4[href=https://www.wicell.org#fig4]A and 4B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2365-Fig4.jpg\nFigure 4. Flattening of cleared brain slices\n(A) 3D reconstruction of an image stack displaying a section of a cleared brain slice before (left) and after flattening (right). Flattening is an important step because distortions in brain slice geometry that occur during cutting and clearing (due to variable shrinkage rates of different brain tissue areas) lead to difficulties and limitations during image acquisition.\n(B) Images show an Iba1-immunostained microglial cells within the brain slice before (left) and after (right) clearing procedure was performed. Orthogonal view demonstrates how much information is lost in non-cleared tissue. Clearing allows imaging of the entire thickness of the brain slice. Methods video S1[href=https://www.wicell.org#mmc1]: Video showing how to use a paintbrush to transfer brain slices from petri dish to 6-well culture plate containing Millicell culture inserts. Related to “Brain slice culturing” step 4b.",
    "Critical: Metal nuts might reflect light and therefore impede imaging if a spinning disk confocal or a widefield microscopes are used. In this case, remove the nuts before imaging. In our experience, brain slices remain flattened if imaged right after the removal of the weight.\nNote: Care should be taken in handling the plates as the sample could move in the wells. We have not experienced brain slices moving during imaging."
  ],
  "subjectAreas": [
    "Microscopy",
    "Cell Culture",
    "Cell Biology",
    "Neuroscience",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}