{
  "id": 6723,
  "origin_website": "Bio",
  "title": "Bone-in-culture Array to Model Bone Metastasis in <em>ex vivo</em> Condition",
  "procedures": [
    "Intrailliac artery injection (IIA)Cell preparationDepending on research purposes, IIA injection can be performed with different cancer cell lines of variable origins and cancer types. We typically use Firefly luciferase tagged cancer cells, whose progression can be monitored by bioluminescence signal. The preparation of luciferase-tagged cancer cells was described in our previous study (Wang et al., 2017). Briefly, replace the GFP domain of pwpt-GFP (Addgene #12255) with Fluc-GFP fusion gene. Transfect 293T cells with 5 µg pwpt-Fluc-GFP vector, along with 1.75 µg pMD2.G (Addgene #12259) and 3 µg psPAX2 (Addgene #12260) in a 10 cm cell culture dish to package lentivirus. After 48 h, filter the supernatant through 0.45 µm polyethersulfone membranes (VWR), which will serve as lentiviral stocks. Treat the cancer cells with Fluc-GFP lentivirus and 4 mg/ml polybrene for 8 h. After a 72 h culture period, isolate the GFP-positive cells by FACS. Cells are maintained by following their corresponding culture protocols.Upon harvesting, trypsinize (with Trypsin 0.25% Solution), wash and resuspend cancer cells to a concentration of 5 x 106 cells/ml in ice-cold, sterilized saline (Teknova).Keep cell suspensions on ice.Mice preparationChoose mice in the appropriate gender and ages based on the purpose of the conducted research. Of note, the immune rejection between different species (e.g., human and mice) or stains will not be preserved in ex vivo culture. Therefore, researcher may have more permissive choice in determining the mice strains to use.The anesthesia and aseptic procedure should follow the standard operation procedure approved by IACUC in the researcher’s institute.IIA injection procedureIn this step, we selectively inject cancer cells via the external iliac artery and thereby loading the cancer cells into the hind limb of mice. Here we briefly introduce the major steps of IIA as the basic work for BICA samples preparation.",
    "The details of this procedure are elaborately described in our previous publications (Wang et al., 2015; Yu et al., 2016), which is out of the main scope of this study.Restrain the anesthetized mice on a diaper or plastic board.Make a skin incision of 1.5 cm between the 4th and 5th nipples in the lower right abdomen.Perform blunt dissection to separate muscles and expose the common iliac artery under the dissection microscope.Inject 0.1 ml cell suspension into the iliac artery using 31 G needles.Stop bleeding by pressing injected artery with cotton tips (in about 10 min). This step may take 5-10 min.Leave the mouse on a warm heating pad under anesthesia and aseptic condition for 30 min, allowing the cancer cells homing to the favorable niches.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200112/20200112101122_9415.jpgFigure 1. Schematic of IIA injection. Luciferase-tagged cancer cells are inoculated into the external iliac artery of mouse, which can be tracked by bioluminescence imaging.Preparation of BICA samplesIn order to reduce the chance of microbio-contamination, this step should be performed within the aseptic environment such as a laminar flow cabinet.Bone collectionThirty minutes after receiving intra-iliac injection, euthanize the mice with the standard operation procedure approved by IACUC in the researcher’s institute.Spray the mice body, especially the leg receiving IIA injection with 70% ethanol for sterilization.Extend the incision made for IIA injection, and stripe the skin of the hind limb.Remove the muscles and tendons carefully with scissor.Wipe bone with sterilized gauzes to clear the residual non-bone tissues, thereby fully exposing the femur and tibia bones.Bone trimmingIn a sterilized 6 cm cell culture dish, cut down the distal epiphysis and metaphysis of the femurs, and the proximal epiphysis and metaphysis of the tibias. These parts are bone tissues mostly enriching colonized cancer cells.Crush the bone tissues with a sterilized bone plier (F.S.T.",
    "), trim the bone fragments with dissecting scissor (Roboz) to an even size (0.5-1.5 mm in diameter).Note: Due to the tight interaction already formed between cancer cell and bone matrix, cancer cells are confined within bone fragments during this time. However, do not leave the samples exposed in the air for longer than 5 min.Quickly transfer the bone fragments to low-attachment 96-well plates preloaded with 200 µl culture media (one piece per well). If necessary, randomize bone fragments from multiple mice in different group settings.(Optional) Observation of the baseline intensity by bioluminescence imagingResearchers in lack of experience may create large deviation on fragment size and cancer loads correspondingly. In this scenario, the bioluminescence intensity data observed later can be divided over the Day 0 (or Day 1) signal intensity of the same piece to yield normalized values, which will help to reduce the intragroup deviation.Bioluminescence imagingUse multi-pipette to add 10x luciferase substrate D-Luciferin into sample wells.Image the plate with an IVIS Lumina II machine. Field of view = D; bining = Medium; F/Stop = Exposure time could be adjusted (increased or reduced) upon the bioluminescence intensity of the cancer cells.Replace the media containing D-luciferinThe residual substrate may exhaust the luciferase expressed by cancer cells, therefore interfere in the future measurements. Therefore, every time after imaging, we need to change the media to remove the residual substrate.Use multi-pipette to remove the medium along the wall of wells. Avoid fragment aspiration.Rinse each well with 200 µl sterilized PBS.Use multi-pipette to remove the PBS along the wall of wells. Avoid fragment aspiration.Add 200 µl fresh culture media into each well.Ex vivo culturing and imagingThe duration of culturing and imaging frequency depends on the characteristics of the cells loaded in BICA samples.",
    "Usually, murine cancer cells progress faster than human cells; Breast cancer cells progress faster than prostate cancer cells; both of which are in agreement with their growth kinetics in vivo.BICA CultureCulture the BICA samples in a 37 °C incubator with 5% CO2 supply. In studies monitoring cancer biology in low oxygen conditions, a hypoxia chamber can be used in place of the cell culture incubator.Change the media every 3-4 days, or when media turns orange-yellow.Measure the BICA plate at least once a week by bioluminescence imaging.The traits of bone residual cells can be maintained for as long as 2 months.Bioluminescence imagingThe bone-colonized cancer cells are usually tightly anchored into the bone matrix. Floating cancer cells are very rare, which won’t interrupt the measurement of bioluminescence intensity.Use multi-pipette to add 10x luciferase substrate D-Luciferin into sample wells.Image the plate with IVIS Lumina II machine. Field of view = D; bining = Medium; F/Stop = 1. Exposure time could be adjusted (increased or reduced) upon the bioluminescence intensity of the cancer cells.Replace the media containing D-luciferin:Use multi-pipette to remove the medium along the wall of wells. Avoid fragment aspiration.Rinse each well with 200 µl sterilized PBS.Use multi-pipette to remove the PBS along the wall of wells. Avoid fragment aspiration.Add 200 µl fresh culture media into each well.Immunohistochemistry (IHC) and immunofluorescence (IF) imagingThe IHC/IF staining is one of the extensional applications of BICA. If needed, fix the BICA tissues with 4% Paraformaldehyde overnight and decalcify them with 14% EDTA for five days. Paraffin-embed the samples for micro-sectioning. ALP and CTSK can serve as markers for osteoblast and osteoclast individually. More details can be found in our previous studies (Wang et al., 2015, 2017 and 2018)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}