{
  "id": 15263,
  "origin_website": "Jove",
  "title": "Retrospective MicroRNA Sequencing: Complementary DNA Library Preparation Protocol Using Formalin-fixed Paraffin-embedded RNA Specimens",
  "procedures": [
    "1. Preparation of All Reagents and Primers\nOrder all primers and adapters as described in Figure 1.\nPrepare the calibrator cocktail stock, which will be spiked in each individual ligation.\nResuspend the carrier oligonucleotide (Figure 1) to 0.5 µM with RNase-free water. Resuspend the 10 calibrator oligonucleotides (Figure 1) to 100 µM using the 0.5 µM carrier oligonucleotide solution.\nCombine 10 µL of each of the 10 calibrators in a siliconized microcentrifuge to obtain a 100 µM cocktail calibrator stock, and prepare a 0.026 nM solution to store at -20 °C.\nDilute the 20 unique, lyophilized, adenylated 3' adapters with RNase-free water to a final concentration of 50 µM (Figure 1).\n\tNOTE: It is recommended to prepare 2.5 µL aliquots from each adapter in individual siliconized tubes and store them at -80 °C for up to 2 years.\nResuspend the desalted 19 nt-3' adapter and 24 nt-3' adapter size marker oligonucleotides to 250 ng/mL (Figure 1).\nResuspend the HPLC purified 5' adapter to 100 µM with RNAse-free water. Resuspend the 5' and 3' PCR primers to 100 µM using RNase-free water (Figure 1).\n\tNOTE: Aliquot all oligonucleotides in amounts necessary for 1–2 experiments and store at -80 °C.\nPrepare the polyacrylamide denaturing (PAA) gel loading dye by combining 98.8% formamide, 1% (v/v) 0.5 M Na2H2 EDTA, pH 8.0, and 0.2% bromophenol blue, and set 1 mL aliquots at -80 °C.\nPrepare the 0.5 M Na2H2 EDTA solution by adding 18.6 g of Na2H2 EDTA powder to 50 mL of nuclease-free water. Add NaOH pellets to reach pH 8.0. Adjust the volume to 100 mL to obtain a 0.5 M Na2H2 EDTA, pH 8.0 stock solution.",
    "Weigh 15 mg of bromophenol blue in a separate 15 mL tube. Add 600 µL of nuclease-free water. Add 14.25 mL of de-ionized formamide. Add 150 µL of the 0.5 M Na2H2 EDTA, pH 8.0 solution.\nAliquot the PAA final solution of 15 mL in 1 mL aliquots at -80 °C.\nPrepare the 5x agarose gel loading dye by combining 0.2% bromophenol blue, 0.2% xylene cyanol FF, 50 mM Na2H2 EDTA, pH 8.0, and 20% Ficoll Type-400.\nResuspend 1.86 g of Na2H2-EDTA in 50 mL of nuclease-free water in a 400-mL beaker on a magnetic stirrer at room temperature (RT). Add NaOH pellets to reach a pH 8.0. Add nuclease-free water to reach 100 mL to obtain a 50 mM Na2H2 EDTA solution.\nWeigh 20 mg of bromophenol blue powder, 20 mg of xylene cyanol FF powder, and 2 g of Ficoll Type-400 powder, and resuspend in 5 mL of 50 mM Na2H2 EDTA.\nVortex the tube containing the three dyes and add 5 mL of 50 mM Na2H2 EDTA. Mix the 5x agarose gel loading dye, prepare 1 mL aliquots, and store at -80 °C.\n2. Set Up the 3' Barcoded Adapter Ligations with 18 Individual RNA Samples\nIdentify 18 individual RNA specimens (pre-aliquoted at 100 ng in 9.5 µL of nuclease-free water in 1.5 mL siliconized microcentrifuge tubes), and set the tubes on ice to defrost for 10 min.\nPrepare the 10x RNA Ligase Buffer (without ATP) fresh.",
    "In a 1.5 mL siliconized microcentrifuge tube, combine 343 µL of RNase-free water, 500 µL of Tris 1 M pH 7.5, 100 µL of 1 M MgCl2, 50 µL of 20 mg/mL bovine serum albumin, and 7 µL of 14 M 2-mercaptoethanol. Mix by flicking the tube, centrifuge for 2 s at 2,000 x g and RT, and set on ice.\n\t\tNOTE: All steps in this protocol that indicate \"centrifuge for 2 s\" are performed in a benchtop microcentrifuge at RT and a top speed of 2,000 x g to collect solutions to the bottom of the tubes.\nPrepare 50% aqueous DMSO stock by adding 1 mL of RNase-free water to 1 mL of DMSO in a 2 mL siliconized microcentrifuge tube, wrap the tube in aluminum foil, and store at RT.\nDefrost the 0.026 nM calibrator cocktail on ice for 10 min. Prepare the Ligation Master Mix by combining in the following order in a 1.5 mL siliconized microcentrifuge tube: 40 µL of 10x RNA Ligase Buffer and 120 µL of 50% aqueous DMSO using a 200 mL pipette, and add 10 µL of 0.026 nM calibrator cocktail using a 10 µL pipette. Flick the 1.5 mL tube to mix, centrifuge for 2 s, and set it on ice.\nAdd 8.5 µL of Ligation Master Mix to each of the 18 individually aliquoted FFPE RNA samples, gently flick the tubes, centrifuge for 2 s, and store on ice.\nDefrost 2.5 µL aliquots from each of the 18, 3' barcoded adapters and place them on ice to defrost for 20 min.\nUse a 3-µL pipette to transfer 1 µL of each adapter to the corresponding FFPE RNA samples containing RNA and Ligation Master Mix (i.e., 9.5 µL + 8.5 µL).",
    "Do not pipette up and down, simply dispense into the liquid and pull the tip out. Make sure to change tips between FFPE RNA samples. Close each tube, flick to mix, centrifuge for 2 s, and set on ice.\nDenature the reactions by placing the 18 tubes on a heat block at 90 °C for 1 min and then immediately place on ice.\nPrepare the ligation enzyme solution by diluting 10 µL of Truncated K227Q T4 RNA Ligase 2 with 10 µL of RNase-free water into a fresh 1.5 mL siliconized microcentrifuge tube.\nUse a 3 µL pipette to transfer 1 µL of the diluted ligation enzyme into each of the 18 RNA samples (do not pipette up and down, and change tips between each tube). Set the 18 ligations on ice and place in a 4 °C cold room for an overnight incubation of 18 h.\n3. Purification of the Ligated Small RNAs\nDeactivate the ligation reactions by placing the 18 tubes for 1 min on a heat block at 90 °C, and then return to ice for at least 2 min to cool down.\nPrepare the Precipitation Master Mix by adding 1 µL of blue dye covalently linked to glycogen to 26 µL of 5 M RNase-free NaCl into a fresh siliconized microcentrifuge tube.\nTransfer 1.2 µL of the Precipitation Master Mix into each of the 18 tubes. Add 63 µL of 100% ethanol to each of the 18 tubes. Close each tube, flick to mix, centrifuge for 2 s, and place the tubes on ice. Combine the contents of all 18 tubes into a single 1.5 mL siliconized tube.\nClose the tube, invert three times to mix, centrifuge for 2 s, and place on ice for 60 min to precipitate.",
    "Prepare a large (16 x 20 cm2) 15% polyacrylamide gel for PAGE.\nCast two siliconized glass plates (treated with a safe alternative to silane coatings) with 0.1 cm spacers.\nCombine 9 mL of system diluent, 18 mL of system concentrate, 3 mL of system buffer, 240 µL of APS (9%), and 12 µL of TEMED in a 50 mL tube.\nTransfer the PAGE gel solution in between glass plates using a 30-mL pipette, insert a 14-well comb (0.1 cm thick), and let the gel solidify at RT for 30 min.\nCentrifuge the 1.5-mL tube with the pooled ligations at 16,000 x g and 4 °C for 60 min.\nRemove the comb. Clean the wells abundantly with RNase-free water using a squirt bottle with a 200 µL tip at its end to reach inside the wells and force un-polymerized acrylamide out (one well at a time) above a sink. Set the 15% PAGE on a gel apparatus, fill the reservoirs with 0.5x Tris-Borate EDTA (TBE) solution, and pre-run the gel for 30 min at 450 V.\nRecover the tube with pooled ligations from the centrifuge and carefully dry the RNA pellet.\nRemove the supernatant with a 1-mL pipette tip but leave some liquid at the bottom. Tilt the tube and use a 20 mL pipette to remove the remaining supernatant without touching the pellet. Vacuum suction the tube using a Pasteur pipette with a 10-µL tip on its end, without touching the pellet.\nResuspend the RNA pellet in 20 µL of RNase-free water by flicking the tube. Add 20 µL of PAA gel loading solution to resuspend the RNA, flick to mix, centrifuge for 2 sat RT, and set the tube at 90 ºC for 1 min and then immediately place on ice.",
    "Replace the 0.5x TBE of the gel apparatus with fresh 0.5x TBE, and load the ladder, size markers, and ligated miRNAs in the center of the gel, leaving 2-empty wells on both sides (Figure 2).\nRun the gel at 450 V (35 mA) for 60 min, pause the run for 10 min to cool down, and run again at 520 V (25 mA) for another 60 min. Uncast the 15% PAGE by removing one of the glass plates.\nLightly spray the gel sitting on the glass plate with fluorescent dye solution (10 µL) in 25 mL of 0.5x TBE, and let it sit flat for 5 min in the dark.\nLay the glass with the gel on a blue light transilluminator, and align both 19 nt and 24 nt size markers with a ruler to direct the excision of the ligated small RNAs (Figure 2). Excise the gel.\nPlace the excised gel in a 0.5 mL tube, designed to fragment gel slices, securely positioned into a 1.5-mL siliconized microcentrifuge tube. Centrifuge at 16,000 x g for 3 min at RT. Resuspend the fragmented gel with 300 µL of 400 mM NaCl solution, close the tube, and seal it with the paraffin film.\nSet the tube on agitation on a thermomixer at 1,100 rpm in a 4 °C cold room for an overnight incubation (16-17 h).\n4. Ligation of the 5' Adapter\nTransfer the solution and fragmented gel to a 5 µm filter tube sitting in a 1.5 mL siliconized tube, seal with paraffin film, and centrifuge for 5 min at 2,300 x g and RT.\nAdd 950 µL of 100% ethanol to the filtered solution, close the tube, invert to mix, centrifuge for 2 s, seal the tube with paraffin film, and set on ice for 1 h.",
    "Prepare a 12% PAGE gel as described in step 3.3, but combine 12.6 mL of diluent, 14.4 mL of concentrate, 3 mL of buffer, 240 µL APS, and 12 µL of TEMED into a 50 mL tube. Pre-run the 12% PAGE gel for 30 min at 450 V (~ 35 mA) in 0.5x TBE.\nCentrifuge the purified small RNA solution at 16,000 x g for 60 min at 4 °C.\nCarefully pipette out the supernatant using a 1 mL pipette to remove the bulk of the solution and use a 200-mL pipette to remove the remaining solution, without touching the pellet.\nUsing a Pasteur pipette with a 10 mL tip at its end connected to a vacuum flask, carefully dry the pellet without touching it.\nResuspend the pellet in 9 µL of RNase-free water without pipetting up and down, but by lightly flicking the tube, centrifuge for 2 s, and set the tube on ice.\nPrepare the 10x RNA Ligase Buffer (with ATP) fresh by combining 500 µL of 1 M Tris pH 7.5, 100 µL of 1 M MgCl2, 50 µL of 20 mg/mL acetylated BSA, 200 µL of 10 mM ATP, 7 µL of 2-mercaptoethanol 14 M, and 143 µL of RNase-free water.\nMix the 10x RNA Ligase Buffer (with ATP) by flicking the tube, and centrifuge for 2 s to collect the solution at the bottom of the tube.\nSet up the 5' adapter ligation by adding 2 µL of 10x RNA Ligase Buffer (with ATP), 1 µL of 100 µM 5' adapter, and 6 µL 50% aqueous DMSO to the 9 µL, 3' barcoded small RNA solution.",
    "Flick the tube lightly to mix, centrifuge for 2 s to collect the solution, place the tube on a heat block at 90 °C for 1 min, and back on ice for at least 2 min.\nAdd 2 µL of T4 RNA Ligase 1 into the solution (do not pipette up and down), flick the tube, centrifuge for 2 s, and sit the tube in floating rack in a 37 °C water bath for 60 min.\nSimultaneously, set up two ligations between the 19 nt-3' adapter and the 5' adapter, and two ligations between the 24 nt-3' adapter and the 5' adapter.\nCombine 2 µL of the 19nt-3' adapter (250 ng/µL) or 24 nt-3' adapter (250 ng/µL) with: 2 µL of the 5' adapter (100 µM), 2 µL of 10x RNA Ligase Buffer (with ATP), 6 µL of 50% aqueous DMSO, 6 µL of RNase-free water, and 2 µL of T4 RNA Ligase 1 in a 1.5 mL siliconized microcentrifuge tube.\nFlick the tubes to mix, centrifuge for 2 s, and set the tubes at 37 °C for 60 min.\nAdd 20 µL of PAA Denaturing Buffer to all ligations (purified small RNAs, 2 ligations with 19nt-3' adapter, and 2 ligations with 24nt-3' adapter).\nMix by flicking the tubes, centrifuge for 2 s, and incubate the tubes on a heat block at 90 °C for 1 min. Transfer all tubes to ice, and prepare a ladder (3 mL of ladder with 20 µL of PAA).\nEmpty the upper reservoir of the gel apparatus with the pre-run 12% PAGE gel, and add fresh 0.5x TBE solution below the level of the wells (wells are emptied with a long, thin tip pipette).\nLoad the samples with a thin pipette tip, as described in Figure 3.",
    "Use fresh 0.5x TBE to fill individual wells to the top of the gel.\nAdd fresh 0.5x TBE to the reservoir above the wells and start the electrophoresis of the 12% PAGE for 60 min at 450 V (~35 mA).\nPause the run by switching off the generator for 10 min to cool the gel down. Restart the generator and run the gel for 60 min at 520 V (~25 mA).\nStop the generator, empty the reservoirs by inverting the apparatus above a sink, and uncast the 12% PAGE by removing one of the glass plates.\nSit the glass with the gel flat, spray the gel with 10 µL of the fluorescent dye in 25 mL 0.5x TBE, and incubate in the dark for 5 min. Lay the glass with the gel on a blue light transilluminator, and align both the 19 nt and both the 24 nt size markers with a ruler to direct the excision of the ligated small RNAs (Figure 3).\nExcise the gel and transfer the excised gel piece into a 0.5 mL gel breaker tube. Close the cap of the gel breaker tube, set into a 1.5 mL siliconized microcentrifuge tube, and secure with paraffin film. Remove the gel breaker tube, add 300 µL of 300 mM NaCl, and 1 µL of 100 µM 3' PCR primer to the crushed gel pieces in a 1.5 mL tube.\nSeal the tube with paraffin film on agitation on a thermomixer at 1,100 rpm at 4 °C, overnight (17–18 h) in a cold room.\n5. Reverse Transcription of the 5' Ligated and 3' Barcoded Purified Small RNAs\nRetrieve the tube from the thermomixer and filter purify the solution with a 5 µM filter tube.",
    "Use a 1 mL pipette to transfer the solution onto a 5 µM filter tube inserted into a 1.5 mL siliconized RNase-free collection tube. Centrifuge the tube for 3 min at 2,300 x g and RT.\nDiscard the filter tube and add 950 µL of 100% ethanol to the 1.5 mL microcentrifuge collection tube containing the filtered solution. Invert the tube to mix, centrifuge for 2 s, and place on ice for 60 min. Precipitate the RNA pellet by centrifuging the tube at 16,000 x g and 4 °C for 1 h.\nDry the RNA pellet.\nOpen the cap and carefully remove the supernatant with a 1-mL pipette, leaving some liquid at the bottom.\nUse a 20 µL pipette to remove all the remaining supernatant without touching the pellet. Tilt the tube to allow any solution to sit on the opposite side of the pellet.\nUse a Pasteur pipette with a 10 mL unfiltered pipette tip to aspirate the supernatant and dry the pellet using a vacuum.\nResuspend the RNA pellet in 5.6 µL of RNase-free water.\nDefrost the reverse transcription reagents on the ice for 15 min. Set up a reverse transcription reaction by adding 3 µL of 5x Buffer, 4.2 µL of 10x deoxynucleotide triphosphate (dNTPs) (each 2 mM), and 1.5 µL of dithiothreitol (DTT) to the 5.6 µL of RNase-free resuspended pellet.\nGently flick the tube to mix the reaction, and centrifuge for 2 s to collect the solution. Set up the reaction on a heat block at 90 °C for exactly 30 s and then transfer directly onto a thermomixer at 50 °C.",
    "Leave the tube on the thermomixer for 2 min so that the temperature equalizes. Add 0.75 µL of the reverse transcription enzyme directly into the solution, flick gently to mix, and set the tube back on the thermomixer at 50 °C for 30 min immediately.\nAfter 30 min, transfer the tube to a heat block at 95 °C for 1 min to stop reverse transcription. Add 95 µL of RNase-free water directly to the reverse transcription, flick the tube to mix, and set it directly on ice for 2 min.\nLabel the tube with the cDNA Stock Library and library ID.\n6. Pilot PCR and Large-scale PCR Amplification\nPrepare fresh 10x PCR buffer by adding 304 µL of RNase-free water, 125 µL of 2 M KCl, 50 µL of 1 M Tris pH 8.0, 10 µL of 1 M MgCl2, 5 µL of 1% Triton X-100, and 6 µL of 1 M 2-mercaptoethanol in a siliconized microcentrifuge tube, and keep at RT.\nAssemble the Pilot PCR reaction by combining 67 µL of RNase-free water, 10 µL of 10x PCR Buffer, 10 µL of 10x dNTPs, 0.5 µL of 100 µM 5' PCR primer, 0.5 µL of 100 µM 3' PCR primer, 10 µL of cDNA Stock Library, and 2 µL of 50x Taq Polymerase.\nSet up two PCR cycles on a thermocycler as follows: File 1: 94 °C for 45 s, 50 °C for 85 s, and 72 °C for 60 s for 10 cycles, hold at 4 °C; File 2: 94 °C for 45 s, 50 °C for 85 s, and 72 °C for 60 s for 2 cycles, hold at 4 °C. Set up the Pilot PCR reaction in the thermocycler and start File 1.",
    "At the end of File 1, open the PCR tube, and using a 20 µL pipette, transfer 12 µL from the Pilot PCR reaction into a 1.5 mL microcentrifuge tube containing 3 µL of 5x gel loading dye, mix by pipetting up and down, close the tube, and label it \"10 cycles\".\nClose the Pilot PCR tube and start File 2 on a thermocycler. At the end of File 2, open PCR tube and use a 20 mL pipette to transfer 12 µL of solution into 1.5-mL microcentrifuge tube with 3 µL of 5x gel Loading dye, and label it \"12 cycles\".\nRepeat the steps described in steps 6.2.2 and 6.2.3 to collect 12 µL PCR products from the Pilot PCR reaction at PCR cycles 14, 16, 18, and 20. Add 3 µL of 5x gel loading dye to each of the 12 µL PCR aliquots, and to the 20 nt ladder containing 3 µL of ladder and 9 µL of RNase-free water.\nPrepare a 2.5% agarose gel with 0.5x TBE.\nWeigh 2.5 g of agarose in a clean beaker and add 100 mL of 0.5x TBE. Heat up the solution in a microwave until it boils. Remove the solution from the microwave, swirl the bottle to mix the agarose, add 4 μL of ethidium bromide (10 mg/mL), and transfer the solution to a 7 x 10 cm2 electrophoresis tray, closed on both ends with tape.\nSet an 8-well comb and let the agarose gel solidify at RT. Transfer the solidified agarose gel into an electrophoresis apparatus filled with 0.5x TBE.\nLoad the ladder and PCR samples on the agarose gel, and run it for 30 min at 120 V.\nEvaluate the gel on a UV box to identify the optimal PCR cycle (Figure 4A).",
    "NOTE: The size of the anticipated PCR bands is shown in Figure 4B.\n\t\nObserve the two PCR bands in each of the different wells (upper band: DNA library, lower band: primer dimers).\nIdentify the adequate PCR cycle for the cDNA amplification by selecting the cycle where the cDNA library is visible, but the primer dimers are barely observable.\n\t\tNOTE: Generally, the adequate PCR cycle is selected between 12–16 cycles. On Figure 4A, the adequate PCR cycle for this library is 14.\nSet up the large-scale PCR reactions (6x 100 µL) for agarose gel library purification.\nPrepare a fresh tube of 10x PCR Buffer following step 6.1.\nPrepare the large-scale PCR Master Mix in a 1.5 mL tube by combining 435.5 µL of RNase-Free water, 65 µL of 10x PCR buffer, 65 µL of 10x dNTPs, 3.25 µL of 5' PCR primer, 3.25 µL of 3' PCR primer, and pipetting up and down to mix.\nTransfer 88 µL of the PCR Master Mix into six 0.5 mL PCR tubes. Transfer 10 µL of cDNA Stock Library (stored on ice), add 2 µL of 50x Taq polymerase into each of the 6 PCR tubes, and pipette to mix.\nPrepare a negative PCR reaction tube by combining 77 µL of RNase-free water, 10 µL of 10x PCR buffer, 10 µL of 10x dNTPs, 0.5 µL of 5' PCR primer, 0.5 µL of 3' PCR primer, and 2 µL of 50x Taq polymerase, and pipette to mix.\nPlace the PCR tubes in the thermocycler using the PCR cycle described in step 6.2.1 and set the optimal number of amplification cycles. Prepare a 2.5% agarose gel using 0.5x TBE, as described in step 6.3.",
    "After PCR amplification, transfer 9 µL from each PCR tube into six 1.5 mL microcentrifuge tubes containing 3 µL of 5x gel loading dye.\nPrepare 20 nt ladder by combining 3 mL of ladder into 9 µL of RNase-free water and adding 3 µL gel loading dye into a 1.5 mL tube.\nLoad the ladder, negative PCR control, and 6 PCR products onto the agarose gel, and run the gel for 30 min at 120 V.\nVerify the uniformity of the PCR amplifications between lanes on a UV box (take an image).\nCombine 3 PCR reactions into two 1.5 mL siliconized microcentrifuge tube (3x 91 µL), add 27 µL of 5 M NaCl and 950 µL of 100% ethanol. Invert the tubes to mix and set them at -20 °C overnight to precipitate the PCR products.\n7. cDNA Library Purification and Evaluation\nCentrifuge both tubes with the PCR reactions at 16,000 x g for 60 min at 4 °C.\nRemove the supernatant with a 1 mL pipette, then tilt the tube with the pellet on the upper side and liquid on the lower side, and use a Pasteur pipette connected to a vacuum flask with a tub and aspirate liquid with a 10 mL tip at the end of the Pasteur pipette.\nSet up the PmeI digest.\nResuspend one of the PCR pellets with 17.5 µL of nuclease-free water, and transfer the resuspended pellet to the second PCR pellet. Add 2 µL of 10x Buffer and 0.5 µL of PmeI enzyme, and set the digest in a water bath for 2 h at 37 °C.",
    "Prepare a 2.5% agarose gel using 0.5x TBE (step 6.3). Add 6 µL of 5x gel loading dye to the digest. Transfer 13 µL of each digest into two adjacent wells of the agarose gel, load the 20 nt size ladder at the end wells, and run the gel for 90 min at 150 V (Figure 4D).\nExcise the upper PCR bands from the gel on the UV box, transfer the gel pieces into a freshly weighed 1.5 mL microcentrifuge tube, and weigh the gel pieces on a scale.\nPurify the excised PCR amplified cDNA library using a gel extraction kit following the manufacturer's instructions. Quantify the cDNA library using a DNA quantification assay and instrument, following the manufacturer's instructions.\nEvaluate the size and purity of the cDNA library with a high-sensitivity DNA chip on a Bioanalyzer (Figure 5). Sequence the cDNA library using a high-throughput system. Transfer the FASTQ data file to the RNAworld pipeline for adapter trimming and alignment to the human genome to identify the miRNA sequences.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}