{
  "id": 11934,
  "origin_website": "Jove",
  "title": "Medium-Throughput Drug- and Radiotherapy Screening Assay using Patient-Derived Organoids",
  "procedures": [
    "NOTE: Before using this protocol, please ensure that the guidelines of the institution's human research ethics committee are followed. Collection of patient tissue and data described in this protocol has been performed following EUREC guidelines and following European, national and local law. All organoids were derived from consenting patients, and consent can be withdrawn at any time.\n1. Prior to screening\nConfirm the identity of newly established models (e.g., by histology and/or DNA sequencing1,2,3,4,5,6,7,8,9,10,11) to exclude the possibility of normal cell overgrowth, and ensure that the drug screen is performed on tumor organoid cultures (see example in Figure 2D).\nDesign the experimental plate setup, making use of the general recommendations given in the discussion section (see example in Supplemental Figure S1).\nCalculate the required number of organoids, and prepare enough organoids ready-to-split at day 0 (use Table 1 as a reference).\n\tNOTE: Depending on the GR of the organoid type and model, approximately 1-2 full 6-well plates are required for each full 384-well screening plate. As a guideline, one full well of a 6-well plate contains ±20,000 cystic organoids or up to 50,000 dense/grapelike organoids.\nCheck if the cell dispenser is calibrated using a reporter dye, and calibrate according to the manufacturer's protocol if needed.\n2. Reagent preparation\nPrepare the base medium: advanced DMEM/F12+++ (aDF+++). Add 5 mL each of 1x L-glutamine substitute (v/v), 1 M 4-(2-hydroxyethyl)-1-piperazine ethanesulfonic acid (HEPES), and 100 U/mL penicillin/streptomycin to a 500 mL bottle of advanced DMEM/F12. Keep aDF+++ at 4 °C for up to 1 month.\nPrepare the appropriate organoid expansion (i.e., growth) medium for the type of organoid in use9,10.",
    "Prepare the screening medium, which could be different from the expansion medium depending on the experimental setup. To aid recovery after dispensing the organoids, add 5 µM of Rho kinase (ROCK) inhibitor (Y-27632) to the screening medium.\nPrepare a 100 mg/mL solution of Dispase II in aDF+++.\n\t​NOTE: A 100x solution of the dispase is stable at -20 °C for 2 months.\n3. Day 0: Preparation of organoids\nNOTE: Volumes indicated below start from a full well-grown 6-well plate of organoids, equivalent to 1200 µL of organoids/ECM (200 µL organoids/ECM per well).\nInspect organoids using a brightfield microscope for possible infection, density, and general appearance; take images of all models for reference before passaging.\nPassage the organoids and seed according to the following steps. Perform these steps at room temperature to reduce organoid temperature fluctuations. Whenever handling organoid suspensions, use low-retention tips or pre-wetted pipets and plastics to prevent loss of organoids.\n\t\nWhen using larger volumes of ECM/organoids (>1200 µL of ECM), consider ECM digestion with dispase as follows to aid organoid removal from the ECM.\n\t\tNOTE: Dispase disintegrates the ECM, but does not affect the organoids.\n\t\t\nOptional: Add 1 mg/mL dispase to each well, and incubate the organoids in a 37 °C incubator for 30 min before passaging as usual.\n\t\t\tNOTE: As the dispase does not get inactivated by medium components, wash it away (using aDF+++) with at least 20x the volume of the dispase added.",
    "Collect the organoids in three 15 mL tubes (up to 400 µL of ECM per tube). Top up to 12 mL with aDF+++, and centrifuge for 5 min at RT at 85 × g. If properly pelleted, aspirate the supernatant. If the organoids have not clearly pelleted, centrifuge at a higher speed (up to 450 × g; depending on organoid type and size) for additional 5 min. Resuspend the pellet and repeat the wash.\n\t\tNOTE: A glass-like layer above the pellet indicates the presence of ECM. Check that no organoids are trapped in the ECM using a brightfield microscope (low number of trapped organoids may be acceptable), and carefully remove the remaining ECM with a p1000 pipet. If (too) many organoids are present in the ECM, repeat the dispase dissociation step, or wash the pellet and spin at a higher speed (maximum 450 × g).\nFor each 15 mL tube, resuspend the organoid pellet in 1 mL of aDF+++, and carefully dissociate the organoids until they have reached the right size. Use the dissociation method that is used for regular splitting, depending on the type/morphology (Table 1).\n\t\t\nIn the case of cystic and grapelike organoids, mechanically disrupt them, shearing them to small fragments (<100 µm) by pipetting up and down with a p1000 with a p2-tip on top, or with a pre-wetted glass plugged Pasteur pipet of which the tip has been narrowed in a flame.\n\t\t\tNOTE: Confirm organoid disruption using a brightfield microscope after pipetting up and down every 5 times, aiming to have the organoids be less than or within the size range of the screen (Table 1).",
    "For dense organoids, add 1 mL of 50% v/v solution of TrypLE in aDF+++ to resuspend the cell pellet, and incubate for a minimum of 2 min at 37 °C. Following this, shake the tube vigorously up and down and check under a brightfield microscope. Using the same approach as above, mechanically disrupt organoids with a pipet, checking under the microscope constantly throughout the process. For HNSCC organoids, incubate in 100% solution of the TrypLE for 5 min.\n\t\t\tNOTE: Depending on the type of culture, aim for ending up with small groups of cells (e.g., CRC organoids, >20 µm) or single cells (e.g., HNSCC organoids). Ensure that the proteolytic incubation does not exceed 15 min as this may affect organoid viability.\nWash the organoids with 10 mL of aDF+++. Spin the organoids at 85 × g for 5 min; aspirate the supernatant if properly pelleted. Alternatively, if the organoids are hard to pellet, centrifuge up to 450 × g for 5 min.\nSeed organoids at a high density in 50% expansion medium/50% ECM (allowing easy removal from ECM in section 4). Aim for approximately double density compared to a regular split, often resulting in a 1:1 split (see examples in Figure 1). Seed organoids in 10 µL droplets (a total of 200 µL per well) of a pre-warmed 6-well plate.\n\t\tNOTE: Keep pre-warmed plates in an incubator at 37 °C overnight or in a 60°C oven for at least 1 h to ensure quick solidification of the ECM, preventing ECM spreading and thus ensuring proper hemisphere dome formation.\nInvert the plate and return it to a 37 °C incubator for 30 min to allow the ECM to set. After 30-60 min, gently add the expansion medium (room temperature) to the wells.",
    "4. Day 2 (range: days 1 - 3): Organoid dispensing\nNOTE: Depending on the organoid GR, this can also occur at day 1 or 3. Throughout the drug screen, organoids are kept in suspension. For this purpose, they are dispensed in a low concentration of ECM (5-10%) at which organoid growth is maintained, but where no solidification of the ECM occurs. This allows for automated dispensing, optimal organoid-compound interaction, and reproducible cell-lysis, but also limits the opportunity to change the medium.\nCalculate the concentration and amount of organoid suspension required for the drug screen.\n\t\nDepending on the cell dispenser being used, consider the dead volume during calculation.\n\t\t​NOTE: When dispensing 40 µL of organoid suspension per well, one 384-plate requires a total volume of 15.4 mL. On average, each Multidrop cell dispensing tube has a dead volume of ~1 mL, resulting in 8 mL of dead volume when using all nozzles. This results in a total of 23.4 mL for each organoid model for an entire 384-well plate. Preparing 25 mL of organoid suspension therefore ensures sufficient organoids for dispensing plus for optional follow-up (single-nucleotide polymorphism, SNP) analysis (see 4.4.7).\nPreparation for organoid collection\n\t\nTo prepare the wash buffer, add ROCK inhibitor (Y-27632) to aDF+++ to a final concentration of 10 µM. (±100 mL is required for each organoid culture that will be screened).\nInspect the organoids in all wells using a brightfield microscope to assess organoid recovery after passaging and to exclude potential infections. Check if the organoids are of the correct size by taking a microscopic image and measuring the organoids using a digital scale bar (Table 1).",
    "NOTE: If the organoids are not of the correct size (too big or too small), they will be lost in the filtering process, and there may not be enough material to undertake the drug screen. If this is the case, it is advised to postpone the drug screen.\nAdd 1 mg/mL dispase to each well, and incubate in a 37 °C in incubator for 30-60 min (up to 120 min maximum) to digest the ECM. Check the progress of ECM dissociation under the microscope to see if the drops of ECM are floating. If not, pipet the contents of the well over the droplets of ECM, which should come off with ease when the digestion is complete.\nPrepare the organoids for dispensing into a 384-well plate according to the following steps. Perform these steps at room temperature (including centrifugation) to reduce organoid temperature fluctuations.\n\t\nCollect the organoid suspension from the culture plate using a p1000 pipet.\nDepending on the filter steps required (depending on the organoid type, see Table 1), follow the corresponding step.\n\t\tNOTE: Pre-wetting filters with wash buffer is essential to prevent the organoids from adhering to the filter.\n\t\t\nCarry out single-filtering when including all small fragments and single cells, e.g., for HNSCC tumor organoids, filter for organoids < 70 µm. Collect the harvested organoids in a 15 mL tube and wash them twice with 12 mL of wash buffer. Filter the organoids over a pre-wetted 70 µm filter into a 50 mL tube, wash the filter with 3 x 4 mL of aDF+++, and transfer them to a 15 mL tube. If volume is too high, spin at 85 × g for 5 min, and transfer the pellet in 12 mL of aDF+++ to a 15 mL tube; proceed to 4.3.3.",
    "Carry out double-filtering for removing debris and large organoids, e.g., for CRC tumor organoids, filter out >100 µm and <20 µm organoids. Immediately filter the harvested organoids over a pre-wetted 100/70/40 µm filter (Table 1) into a 50 mL tube, and wash the filter with 2 x 10 mL of wash buffer. Use one pre-wetted 20 µm filter per three wells from a 6-well plate of organoids. Filter the <100 µm organoids over the 20 µm filters, and wash the filter with 2 x 10 mL of wash buffer. Recover the organoids from the filter by inverting it on top of a clean 50 mL tube and washing with 3 x 4 mL of aDF+++. Transfer the organoid suspension to a 15 mL tube; if volume is >15 mL (as more filter washing may be required), spin at 85 × g for 5 min, and transfer the pellet in 12 mL aDF+++ to a 15 mL tube.\n\t\t\tNOTE: Organoids that get trapped in the filter can be recovered for later use (passaging); organoids < 100 µm are used in the next step. Cells and debris that went through the filter will be discarded, organoids caught in the filter (>20 µm, <100 µm) are used for screening.\nCentrifuge at 450 × g for 3 min, and carefully aspirate the supernatant. Resuspend the pellet carefully in 1 mL of screening medium, top up with another 1-9 mL medium (depending on the pellet size; aim to have ~75-150 organoids/10 µL), and resuspend by pipetting up and down with a pre-wetted serological pipet.\n\t\tNOTE: Adding 5 µM of ROCK inhibitor to the screening medium is recommended.",
    "Thoroughly mix the organoid suspension by pipetting up and down with a pre-wetted serological pipet 5x, and count the number of organoids in 10 µL of the suspension by pipetting a line in a Petri dish and counting them under the microscope. For smaller organoids (<70 µm), add 10 µL of the organoid suspension to a 10-chambered slide with a hemocytometer grid, and count the number of organoids. Calculate the number of organoids/mL following the manufacturer's instructions.\nPrepare the required amount of dispensing medium by adding 5% (v/v) ECM to ice-cold screening medium (e.g., for 25 mL of dispensing medium, add 1.25 mL of ECM to 23.75 mL of ice-cold screening medium). Only add ECM to ice-cold medium to prevent the ECM from solidifying. When screening multiple organoid models, prepare dispensing medium in bulk to ensure consistency of the % of ECM across all models.\nAdd the required number of organoids (see Table 1 for guidelines and discussion for notes) to a new 15 mL tube, and centrifuge at 450 × g for 3 min. Aspirate carefully without disturbing the pellet, and thoroughly resuspend the pellet in 100 µL of screening medium with a p200 pipet. Make sure the pellet is homogeneous and resuspended completely without any organoid clumps. Subsequently top up the suspension with the required amount of ice-cold dispensing medium, and keep the organoid suspension on ice henceforth.\nDispense the organoids into 384-well plates using a cell-dispenser (e.g., Multidrop).\n\t\nSet up the cell dispenser to dispense 40 µL of cell suspension per well.\n\t\t\nMain menu | select plate type | OK | 384 standard | OK\nCassette type standard tube cassette (right-hand side) | select volume using up and down arrows (40 µL).\nSelect Full plate or Columns, depending on the plate layout.",
    "Wash the tubing with 70% ethanol (EtOH), followed by sterile phosphate-buffered saline (PBS); use >15 mL per wash. Allow some air in between each fluid to visualize the start and ending of each wash. Check if all dispense heads are dispensing 'straight', and wash again when this is not the case.\nIn the Settings menu, select pre-dispense, and set to 60 µL to pre-dispense the organoid suspension after the prime and before dispensing.\nPrime the dispenser with the organoid suspension while keeping the suspension on ice. Resuspend by continuously pipetting with a p1000 pipet. Be careful to avoid the generation of air bubbles in the solution. Once primed and the plate is in position, dispense the organoids by pressing Start.\n\t\tNOTE: This step is easier done with two people: one person resuspending and the other operating the dispenser.\nIf required, for each organoid model included in the screen, dispense at least 5 more wells in an extra screening plate.\n\t\tNOTE: This will allow a T=0 reading later this day (see section 7 and discussion). This dispensing can also be done manually if preferred.\nReplace the lid on the plate immediately to avoid contamination of the wells. Confirm under the microscope that all wells were correctly filled, and if the organoids are equally distributed throughout the plate.\nIf required, once plating is finished, recover the organoid suspension from the tubing (click on Empty), and spin the remaining organoids down. Transfer to a 1.5 mL tube, and snap-freeze for later SNP analysis.\n\t\t​NOTE: If air entered the tubing during dispensing, and some wells were not filled correctly, fill the wells manually by adding 40 µL per well.\nIf multiple organoid models are dispensed, rinse the tubing with PBS, EtOH, and PBS, and repeat steps 4.4.4-4.4.8 for each model.",
    "Transfer the plates to a 5% CO2 atmosphere in a 37 °C incubator until ready for drug dispensing. To eliminate differences in air exchange between different plates, avoid stacking the plates in the incubator.\nClean the tubing as soon as possible with PBS and then EtOH. Be sure to completely dry the tubing by running air through the system.\n5. Day 2 (range: days 1 - 3): Drug Dispensing using a drug dispenser (e.g ., D300e)\nNOTE: .Depending on the research question, drug printing can also be done one day after seeding.\nSet up the drug dispenser\n\t\nStart the dispenser software, and select the desired plate format used for screen by highlighting Plate 1 and selecting the pencil tool to bring up the plate editor.\nSelect the plate type and set additional volume of each well (volume of liquid (organoid suspension) already in the plate). For 384-well format, use 40 µL/well.\nIn the left-hand bar, use the + symbol to add each drug solution that will be used in the screen.\nEdit each fluid by selecting the pencil tool. Edit the drug name, the drug class (e.g., DMSO-based or aqueous (e.g., water, PBS)), and the stock concentration of the drug.\n\t\tNOTE: Do not exceed 10 mM stock concentration of each drug. Ideally, the maximum concentration of solvent should be 0.8% for DMSO and 3% for PBS/0.3% detergent (e.g., Tween) (see normalization below and discussion).\nOnce all the drugs have been added in the program, select the wells for addition of the drugs by highlighting a well on the plate layout and dragging it across. Right-click on the selected wells, and add the concentration.\n\t\t\nSet the value to define the desired concentration of each drug (µM).",
    "For titration, define the desired highest and lowest concentration of each drug (µM), the distribution (logarithmic or linear), replicates per level (e.g., 3), and the titration pattern.\nFor targeted titration, define the highest and lowest concentration of each drug, the distribution (logarithmic or linear), target concentration (µM), target region (levels), target range (log), replicates per level (e.g., 3), and the titration pattern.\nNormalize all drug wells to their appropriate solvent (e.g., DMSO or aqueous + Tween-20). For drugs dissolved in aqueous solutions, add Tween-20 (final concentration 0.3% in drug stock) to ensure appropriate surface tension of drug solution for dispensing using the D300e (see 5.2.6). Select all the wells, including those without drug (negative controls), right-click, select Normalization, then Normalize. Select the appropriate solvent, and select Normalize to highest class volume to normalize to the highest concentration of drug selected.\n\t\tNOTE: Black triangles now appear in the bottom left corner of each well to confirm normalization. Aim to have a minimum of 6 (ideally >9) negative control wells for each drug solvent used.\nSelect a minimum of 3 wells (ideally >6) to use known cytotoxic reagents such as staurosporine as positive controls (1-5 µM) depending on the cultures. If the cytotoxic concentration of the positive control is unknown, opt for a high concentration to kill all organoids in the positive control wells.\n\t\tNOTE: Alternatively, Navitoclax (20 µM) can be used to ensure organoid death during the drug screen.\nOnce the plate layout is complete, select Run (if the machine is switched on) in the top left-hand corner. Save the protocol to continue.",
    "NOTE: The program has now calculated the required volume of each drug for dispensing. As this includes pipetting error, this is the exact amount of drug needed for the entire protocol. Optional: Selecting Simulate will simulate the entire protocol (without adding drugs) to observe how the protocol will run. In both Run and Simulation modes, a report is generated that will document the time, order, and volumes of drugs added to each well. This can be useful to ensure the protocol is correct and to determine the exact volume and number of cassettes that will be required before proceeding with the experiment.\nPrepare and print drugs\n\t\nAdd 0.3% (v/v) Tween-20 to aqueous (e.g., water or PBS) drug stocks to ensure appropriate surface tension of the drug solution for dispensing using the D300e. Ensure the Tween-20 concentration does not exceed 3% PBS/0.3% Tween-20 (v/v), and keep the final concentration of Tween-20 below 0.01%.\n\t\tNOTE: Only add Tween-20 to drug stocks right before adding it to the drug printer cassette, as the high concentration of Tween-20 in the stock potentially inactivates (protein-based) drugs (e.g., antibody-based drugs). This step is not required for drugs dissolved in DMSO; however, make sure that the final percentage of DMSO in each well does not exceed 0.8-1%.\nHave both D8+ low-volume and D4+ high-volume cassettes ready. Check Use high-volume cassettes in the program when using high volumes of normalization fluid.\nRun the protocol to begin dispensing the drugs.\n\t\tNOTE: The program will run the protocol stepwise and indicate when and how much of each compound needs to be added. Use filter tips for handling high concentrations of drugs. Be careful to dispose chemical waste and used tips following biosafety guidelines.",
    "Once the protocol has finished, use adhesive air-and liquid-permeable seals (e.g., polyurethane medical-grade plate seals; Table of Materials) to cover the plates, and return the plates to 37 °C, 5% CO2.\n\t\tNOTE: Using these seals prevents \"edge-effect\" evaporation (see discussion). If not using the seals, ensure that the outer edges of the plate are not used in the drug screen. Do not stack plates on top of each other, and ensure the plates are kept towards the back of the incubator, or use an incubator that is not opened (frequently) to avoid temperature fluctuations.\nIf radiotherapy is combined with printed drugs, proceed to section 6. If not, leave the plates in the incubator for 5 days.\n\t\t​NOTE: Depending on the organoid type and the drug type, some experiments may take longer than 5 days. For experiments lasting >7 days, carefully change the medium and compounds half-way through the experimental procedure (e.g., by replacing 50% of the medium with fresh screening medium) to avoid extensive cell death in the negative control wells.\n6. Day 2 (range: days 2 - 4): Treatment of organoids using photon beam radiation",
    "NOTE: The following steps describe irradiation of organoids. To assess the radio-sensitizing effects of drug compounds, irradiation is done 24 h after the organoids are exposed to chemotherapy. The same protocol is used for assessing the effects of irradiation alone, wherein organoids are seeded and irradiated 24 h after seeding. This may require some optimization depending on the hypothesis and the organoid cultures. The following steps describe the process used to irradiate organoids using specifically generated 6 MV photon beams (Table of Materials). This machine is optimized for clinical applications and therefore reflects real clinical practice. Different machines may require a different setup and may also require optimization of dosing as efficient dose may differ from that which is selected.\nRemove the plates from the 37 °C incubator, and return lids to each plate on top of the seals; do not remove the seals. Take the 0 Gy plate along in this process to ensure that the control plate has been subjected to identical conditions.\nTransport the organoids to the irradiator. Set up the irradiation device by filling a plastic box with lukewarm tap water, and fix in the plate holder to prevent the plate from floating.\nImmerse the plate in water so that the water is level with the upper surface of the plate. Fix the plate in position using an apparatus that does not allow the plate to float (as shown in the video). Leave the room, and irradiate the plates at increasing dosages (e.g., 1, 2, 4, 6, 8, and 10 Gy). Irradiate only one plate at a time, as a stack of plates does not allow for an even dispersion of radiation.\n\tNOTE: Ensure appropriate irradiation doses are chosen to achieve a dose-response curve.",
    "Dry the plates thoroughly after irradiation with tissues, and replace the hard lid. Transport the plates back to the culture room. Remove the hard lid, and wipe the exterior of each plate with lightly sprayed EtOH tissues. Do not remove the breathable seals.\nPlace the plates in the back of the incubator to avoid temperature fluctuations due to opening of the door; do not stack the plates.\n7. Day 2. Optional: CellTiter-Glo 3D Cell Viability Assay (CTG) measurement plate T=0 (required for GR analysis)\nIf aiming to calculate GR metrics (see 11.3.5 and discussion), measure CTG values in the T=0 plate by following steps 9.1-10.4.\n8. One day before drug screening readout: preparation\nCalculate the total volume of CTG required. For a 384-well plate, use 40 µL of CTG per well (add CTG 1:1 according to the manufacturer's recommendation). Take the dead volume for multidrop dispensing (1 mL per tube) into account. Thaw CTG overnight at 4 °C, protected from light.\nTest if the dispenser requires calibration.\n9. Day 7 (range: days 7 - 14): Drug screening readout: CTG Assay\nAllow CTG to reach room temperature. Visually inspect all wells of the 384-well plate before the readout, record if any infections have occurred.\nImage the relevant wells under a brightfield microscope. Include positive controls (staurosporine), negative controls (normalization wells), and the highest concentration of each drug.\nWash and prime the multidrop machine according to steps described in section 4.4. Dispense 40 µL of CTG to each well, according to the plate setup. Shake using the plate shaker of the multidrop dispenser (Shake) for 5 min, and incubate at room temperature, protected from light for 25 min.",
    "​NOTE: The CTG reaction is an enzymatic reaction and is thus affected by temperature and incubation time. The signal is supposedly stable for 30-60 min; however, using the same incubation time for all plates, especially when calculating GR metrics, increases accuracy.\n10. CTG bioluminescence measurements\nTurn on the bioluminescence plate reader with 384-well capacity and the computer. Here, a Spark plate reader was used.\nOpen the Spark method editor software (see the Table of Materials). Select the plate format: COS384fb-Corning 384 flat black | no lid | no humidity cassette; select the wells that need to be measured.\nIn the bottom left-hand menu, select Detection | Luminescence, and drag underneath the plate. Type: attenuation, second menu: none. Set the integration time [ms]: 500.\nPlace the plate, select it, and run the method by clicking on Start. Save the exported spreadsheet.\n11. Data analysis\nCalculate the Z-factor (Z') to evaluate the screen quality.\n\t\nCalculate the average (Av) and standard deviations (SDs) of both negative (Ctrlneg, e.g., DMSO) and positive (Ctrlpos, e.g., Staurosporine) controls.\nCalculate the Z-factor = 1 - (3 × SD[Ctnlneg] + 3 × SD[Ctrlpos]/mean[Ctrlneg] -mean[Ctrlpos]).\n\t\tNOTE: Z' expresses the variation within and the ratiometric space between the positive and negative controls and therefore is a measure for the dynamic range of the assay13. Exclude drug screen results with a Z' lower than 0.3; using data with a Z' > 0.5 is recommended. Average Z' generally varies between 0.5 and 0.7 (depending on the organoid models used). For the Z' to be informative, all the organoids in the positive control wells should have died.\nCalculate the relative organoid viability for each well by setting Ctrlneg to 100% and Ctrlpos to 0% viability.\n\t\nUse this formula to calculate organoid viability.",
    "​Organoid viability = 100% × (experimental well value - Av Ctrlpos) / (Av Ctrlneg - Av Ctrlpos)\n\t\t\nFor irradiated organoids, calculate the percentage value.\n\t\t\t​Percent organoid viability = 100% × (experimental well value of x GY) / (Av Ctrlneg well value of 0 GY)\nVisualize the data in a data analysis software program by copying the viability data into an xy-table, selecting the appropriate number of replicate values per concentration.\nFor logarithmic drug concentrations, transform the drug concentrations, and copy these values into the first column of the table.\nTo format the graph, select the graph-type (XY), select the standard error of the mean (SEM), and set the origin to the lower left.\nDetermine relative IC50, area under the curve (AUC), and GR metrics.\n\t\nFor nonlinear regression, in the Analyze tab, select fit a curve with nonlinear regression. Choose the option log (inhibitor) vs. normalized response - variable slope to create a kill curve.\nClick on the Results tab to display the relative IC50 for each drug.\n\t\tNOTE: This is the concentration of drug that gives a response halfway between the bottom and top of the curve. The bottom and top are plateaus in the units of the y-axis.\nFor area under the curve (AUC), under the Analyze tab, select Area Under Curve, use the predefined settings, and select OK.\nClick on the Results tab to display the AUC (total area) for each drug.\n\t\tNOTE: The AUC is an integrated measurement of a measurable effect, which is used as the cumulative measurement of a drug effect. With some molecules, such as antibodies, the dose-response curve is not sigmoidal shaped, and IC50 values are difficult to interpret. In such a situation, AUC values may provide more information as a metric to compare differences between organoid lines.",
    "Alternatively, if CTG measurements are taken at day 2 (optional steps 4.4.5 and section 7), calculate the GR metrics. Analyze the GR metrics using an online GR calculator14, taking into account the differences in proliferation rate between organoid models throughout a drug screen to ensure more reproducible and sensitive measurements.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}