{
  "id": 5263,
  "origin_website": "Bio",
  "title": "Ionization Properties of Phospholipids Determined by Zeta Potential Measurements",
  "procedures": [
    "Liposome preparationAliquot the desired lipid volumes into Kimble Corex tubes using a gas-tight syringe. For the illustrated protocol, add 200 μl of 25 mg/ml POPG chloroform stock into the tube. (Notes 2 and 3)The lipids are dried under a gentle N2 steam in a fume hood for approximately 30 min (Note 4).To remove residual chloroform, the lipids are further dried overnight under a vacuum in the desiccator.The dried lipids are hydrated and resuspended by vigorous vortexing in 1 ml of respective phosphate citrate buffer (pH 2.0 to 8.0) or AMPD buffer (pH 8.0 to 10.0) (see Recipes) and incubated for an additional 30 min (Note 5).The hydrated lipids are extruded each set 19 times through a 0.4 μm membrane maintained at proper temperature (Note 6).Quality control and liposome sizingThe resulting liposomes are analyzed by dynamic light scattering in a Zetasizer Nano S90 to confirm the homogeneity and the accurate size of the samples prepared as shown in Figure 3A.Size measurements are performed using 90° scattering optics with the following measurement parameters. Temperature: 25 ± 1 °C; Dispersant: phosphate buffered saline; Refractive index: 1.332; Viscosity: 0.9128 cP; Equilibration time: 1 min; Measurement: automatic; Analysis model: general purpose (normal resolution). Instrument calibration is conducted using NanosphereTM size standards.60 μl of each sample is placed in a quartz cuvette and measured with three successive runs at 1 min intervals.The scattering data are analyzed by Zetasizer software as shown in Figures 3B and 3C.The pH of the liposomes after extrusion is verified by using a pH paper as shown in Figure 3D.Measurement of the lipid concentration of vesicle samples is conducted using established colorimetric assay that measures the phospholipid-ammonium ferrothiocyanate complex (Marom and Abdussalam, 2013).Calibration curves are produced as follows:Add 40 μl POPG (25 mg/ml) to 9.",
    "96 ml of chloroform in a glass tube to prepare a stock solution of 0.1 mg/ml POPG. Make 11 samples of POPG in a glass tube as shown in Table 1.Vortex the samples for 1 min each after the addition of ammonium ferrothiocyanate and chloroform.Two separate phases will become evident. Using a Pasteur pipette, carefully remove the upper phase and discard it.Transfer the lower phase to a suitable cuvette and measure the absorbance at 488 nm using a spectrophotometer. The sample without POPG is used as blank.The graph of absorbance at 488 nm versus lipid concentration (mg/ml) serves as the calibration curve (Figure 3E).Table 1. The reaction mixture for plotting the calibration curveimgsrc:https://en-cdn.bio-protocol.org/attached/image/20161114/20161114193334_0028.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20161114/20161114193404_5944.jpgFigure 3. Liposome characterization. A. Representative intensity distribution trace for liposomes prepared from 100 mol% POPG by dynamic light scattering indicating a homogenous population. B. Mean diameters (Z-average values) of 100 mol% POPG liposomes. C. Polydispersity indices of 100 mol% POPG liposomes. D. The respective pH of liposomes after hydration and extrusion in various pH buffers verified using a pH paper. E. Representative phospholipid calibration curve.The lipid concentration of liposome samples is measured as follows:Add 10 μl of prepared liposomes into a glass tube. Add 2 ml ammonium ferrothiocyanate and vortex for 1 min.Add 1.99 ml of chloroform and vortex for 1 min.The lower phase is taken and the absorbance is measured at 488 nm.The respective lipid concentration is calculated by using the calibration curve, making sure to multiply the measured concentration by 200 to get the final concentration (1:200 dilution).Liposomes are diluted to a concentration of 1 mg/ml in the respective buffer. Zeta potential measurements are conducted using a ZetaPlus Zeta Potential Analyzer (see Reference 10)Add 1.6 ml of 1 mg/ml liposomes sample in 4 ml-semi micro cuvettes.",
    "Open the ZetaPlus software and change the appropriate conditions in the ‘Parameters’ Dialogue box. The measurement parameters are as follows. Electric field: 14.86 V/cm; Current 21.37 mA; Conductance: 3936 μS; Viscosity: 0.890 cP; Refractive index: 1.330; Dielectric constant: 78.54; Temperature: 25 °C. The electrodes used are ZetaPlus, SR-516 type electrode (Note 7).The measurements are made for three runs with ten cycles (Note 8)."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}