{
  "id": 4409,
  "origin_website": "Bio",
  "title": "Phagolysosomal Trafficking Assay ",
  "procedures": [
    "Infection of macrophagesNotes: All work with live Mtb to setup infection (steps A1 and A3-11 below) should be done in bio-safety level 3 (BSL3) facility.BCG and Msmeg cultures should be handled outside BSL3 facility but in biosafety class II cabinets or as per institutional standards of practice. Centrifugation of Mtb and BCG cultures (steps A4-6 below) and infected samples (step A9 below) should be done using suitable aerosol canisters and multiwell plate cover or as per institutional standards of practice. These canisters and multiwell plate carriers with covers should be opened for loading and unloading of Mtb/BCG culture containing falcons or infected plates in the bio-safety class II cabinets during centrifugation. Starting with frozen bacterial stocks (prepared from mid-log phase culture i.e. culture with OD600 between 0.5 to 1.0 units frozen in 18% glycerol at -80 °C) inoculate liquid cultures of mycobacteria in 10 ml of 7H9 complete media in 30 ml square media bottles. Include antibiotics as appropriate (for example, to select plasmids containing GFP with kanamycin as the selection marker, include kanamycin at 5 µg/ml). Incubate at 37 °C with shaking at 90-110 rpm in aerosol containment units. Mtb and BCG double approximately every 20 h in 7H9 complete media at 37 °C so the cultures will take few (~4-5) days to reach mid-log phase. The cultures maybe diluted if required into fresh media (e.g. if antibiotic used is prone to degradation during culture) at appropriate intervals. Msmeg doubles approximately every 3 h and so dilute an overnight grown culture in the morning to reach mid-log phase during the day to use for infection. The timing will depend upon the particular strain, conditions, and starting inoculum.Plating of macrophages should be done one day prior to infection in bio-safety class II cabinet in the tissue culture lab.",
    "Plate the cells in 250 µl of either DMEM or DMEM/L929 complete media per well in 8 well chamber slide. BMDMs can be plated at a density of 1 x 105 per well. If RAW264.6 macrophage cell line is used, it can be seeded with a density of 6 x 104 per well in DMEM complete media. Incubate the cells in 37 °C incubator with 5% CO2 atmosphere. On the day of Mtb infection, transfer the slides to the 37 °C incubator with 5% CO2 atmosphere in the BSL3 facility before proceeding further.Of note, coverslips placed in 24 well plate can also be used for plating the macrophages for infection. However, 8 well chamber slide and cover glass offer sterile and RNase free plating conditions with minimal use of reagents. In addition, multiple conditions can be tested with minimal well to well variation like different host markers can be knocked down prior to infection to see the role of host protein in phagolysosomal trafficking or multiple bacterial strains can be infected in different wells of the same slide.Measure the OD600 of 1ml of the culture in cuvette using spectrophotometer. Dilute the culture if required so as to have the OD600 of the culture between 0.5 to 1.0 OD600 on the day of infection of macrophages.Transfer culture into 15 ml falcon tube and spin at 1,500 x g for 5 min at room temperature. Remove the supernatant and resuspend the pellet in 5 ml of PBS and again spin at 1,500 x g for 5 min at room temperature. Repeat it once more to remove carried over Tween 80 from 7H9 complete media.Resuspend the pellet in 5 ml of DMEM complete media for RAW 264.7 macrophages and DMEM/L929 complete media for BMDM and transfer it to 50 ml falcon.",
    "Spin at low speed of 450 x g for 5 min at room temperature to remove bacterial clumps by pelleting. Transfer the supernatant carefully avoiding the pellet to a fresh 15 ml falcon tube. The supernatant is devoid of mycobacterial clumps with substantial single cell population and is therefore used to infect macrophages.  Note: It is not unusual to remove ~ 90% of the mycobacteria by pelleting in this step. For example, if at step A3, the OD600 of a 10 ml culture of Mtb is 0.5 then expect the supernatant after low speed spin to have an OD600 ~ 0.05 to 0.1 depending on the degree of clumping. Determine the OD600 of the supernatant harvested in step A6. Convert the OD600 to number of bacteria. This value will vary depending upon the shape, size and internal light absorbing components of the bacteria and may be distinct for different strains of the same species. One should predetermine the conversion factor. For example, a conversion factor such as OD600 of 1.0 = 500 x 106 colony forming units (CFU)/ml can be determined as below: a.A starting culture of “x” OD600 is serially diluted and a volume of each dilution is plated to give CFUs.The dilution which give colonies in countable range and the number of colonies for that dilution are used to calculate “y” CFU/ ml using the formula:CFU/ml = (# colonies) * (dilution factor)/ (volume plated in ml). This gives x OD600 = y CFU/ml. Now OD600 of 1 = y/x CFU/ml.Calculate the volume of the bacterial suspension prepared in step A6 that is required to infect macrophages at a multiplicity of infection (MOI) of ~ 1-10. Add this volume to each the well.",
    "If necessary, make a dilution so that at least 10-50 µl is added to each well in a total volume of 200 µl. Several MOIs should be tested and the optimal MOI will depend upon details of the experimental conditions. Spin the slide at 50 x g for 2 min at room temperature to synchronize the infection using multiwell plate carriers with covers in the swing bucket rotor. Incubate in 37 °C incubator with 5% CO2 atmosphere for 3 h. Different strains may differ in infectivity of the macrophages.After 3 h, remove uninternalized bacteria by washing three times with 300 µl pre-warmed PBS. Add 300 µl of DMEM or DMEM/L929 (for RAW cells or BMDMs, respectively) and incubate in 37 °C incubator with 5% CO2 atmosphere. It is possible to perform this step after a shorter time period, although bacterial uptake will be lower.At desired time points [such as 3 h post-infection (hpi), 12 hpi, and 24 hpi], remove the media. Fix in 1% PFA/PBS at 4 °C overnight for Mtb infected samples or as per institutes bio-safety guidelines before removing them from the BSL3. Fix in 4% PFA/PBS at room temperature, 15 min, for Msmeg and BCG infected samples. Notes: As per biosafety rules, Mtb infected slides should be sterilized before taking them out of BSL3 for immunostaining and imaging (Schwebach et al., 2001). This can be achieved by long fixation method; fixing in 1% PFA/PBS, overnight (minimum of 12 h) at 4 °C or as per institutional’s standards of practice. For alternate fixatives, like methanol or acetone, the dishes for plating macrophages and infection should be compatible with organic solvents.",
    "Staining for immunofluorescence microscopyFor immunofluorescence (IF) microscopy, one has to pre-optimize the conditions for immunostaining which includes fixatives (see step A11, notes a-b), detergent to permeablize the cells (triton X-100, saponin or tween-20), blocking and dilution for each primary antibody before performing co-localization experiments (Goldenthal et al., 1985). During standardization, the specificity of immunostaining can be confirmed by silencing the host marker by RNA interference (RNAi). It is important to include controls that would help in setting acquisition exposures and also serve as a control for non-specific staining during fluorescence microscopy as explained further in step C21. For Mtb infected samples, primary antibodies for a specific host marker should be screened for recognition of specific epitopes for optimal sensitivity in macrophages which have been fixed for long to sterilize Mtb which is in contrast to BCG and Msmeg infected samples which are fixed for short (as described in step A11 of the protocol).Wash out the fixative well with 300 µl of PBS three times. Blocking: Incubate in blocking buffer for 1 h at room temperature. For example, blocking buffer can be 2% BSA in PBS containing 0.1% detergent optimized for the primary antibody. The detergent permeablizes the plasma membrane so that the antibody can enter the cell, and BSA blocks to prevent non-specific staining.For the commercially available primary antibodies mentioned in materials and reagents, transferrin receptor (TfR) and LAMP1, add 200 µl of 2% BSA in PBS-0.1% triton X-100 and 2% BSA in PBS-0.1% saponin, respectively, to the corresponding wells to block.Primary antibody: Add 150 µl of the diluted primary antibody to the well and incubate overnight at 4 °C. Dilute the primary antibody in the 2% BSA in PBS-0.1% detergent as standardized.",
    "For the primary antibodies mentioned in materials and methods, dilute TfR (1: 250 v/v) and LAMP1 (1: 1,000 v/v) in 2% BSA in PBS-0.1% triton X-100 and 2% BSA in PBS-0.1% saponin, respectively. Wash with PBS-0.1% detergent three times, each time for 5 min at room temperature to remove excess and non-specifically bound antibody e.g. use PBS -0.1 % triton X-100 for transferrin receptor and PBS -0.1 % saponin for LAMP1 antibodies used in step B14.Secondary antibody: Depending on species in which primary antibody was raised, use the appropriate anti-species (mouse or rabbit) secondary antibody labeled with appropriate fluorophore. Add 150 µl of the diluted secondary antibody and incubate for 1 h at room temperature in the dark to prevent bleaching of the fluorophore. Dilute the secondary antibody 1: 250 in 2% BSA in PBS-0.1% detergent e.g. use anti-mouse Alexa 594 in 2% BSA in PBS-0.1% triton X-100 to detect anti-TfR and dilute anti-rabbit Alexa 594 in 2% BSA in PBS-0.1% saponin to detect anti-LAMP1.Repeat step B15. Protect from light to prevent photo-bleaching of the secondary antibody.Remove the chambers from the top of the slide by gentle upward pressure and peel off the rubber gasket (see Figure 1).Put ~2 µl of anti-fade in the center of each of the eight well on the slide. Mount a clean rectangular coverslip and seal the sides of the coverslip with nail polish.Although not described in detail here, alternatively, it is also possible to do live cell staining of lysosomes using lysotracker dyes or loading them with fluorescent dextran (e.g. TexasRed-dextran). The kinetics of live staining has mainly two variables, concentration and time and depending on the desired goals one may best design the experiment to couple it with infection.",
    "A brief understanding towards it usage is provided: Lysotracker is a cell permeable, acidotrophic stain that can be used to label lysosomes in macrophages without the need for fixation. Staining conditions vary and users may standardize concentration of the dye and time of staining (30 min to 2 h) depending on the actual experiment. Plate the macrophages and infect them as described in section A. At the last 30 min of the desired time point post-infection of macrophages, remove media from well, add 150 µl of 200 nM lysotracker per well and incubate at 37 °C. Protect the samples from light hereafter to prevent photobleaching. Turn off the light in the biosafety cabinet while working with the stained sample to prevent photo-bleaching.Wash the well three times with PBS to remove excess of the lysotracker.   Add PBS and quickly proceed for image acquisition with the fluorescence microscope. Further incubation in dye free media often leads to fading of the signal and cell blebbing. Note: Msmeg and BCG infected macrophage samples can be directly taken for live image acquisition and so macrophages in this case should be plated on 8 well chamber cover glass instead of the slide so that the chambers do not have to be removed. In case of Mtb infected macrophages, after live labeling with lysotracker, the samples should be fixed as per institutes bio-safety guidelines before taking them out of BSL3 for imaging. They can then be washed with PBS to remove fixative and mounted with the anti-fade. TexasRed-dextran (10 kD) is freely permeable to the endocytic and lysosomal vesicular network of the cell and so can be used to label lysosomes before infection by pre-loading the macrophages: Plate the macrophages as in step A2.",
    "Remove the plating media from the well and treat with 150 µl of 1 mg/ml solution of dextran (diluted in PBS) for 1h at 37 °C for cellular uptake by fluid phase endocytosis.Wash with pre-warm complete DMEM or DMEM/L929 complete media (as required) twice, observe under the microscope and if required wash more with pre-warmed PBS twice. Add back warm complete DMEM or DMEM/L929 complete media (as required) and incubate for 4 h in 37 °C incubator with 5% CO2 to chase the TexasRed-dextran to lysosomes. This chase period can be done overnight followed by infection the next day.Infect the macrophages and fix the samples at the desired time points post-infection.Image acquisitionNote: Appropriate training should be acquired before operating any fluorescence or confocal microscope for image acquisition as per individual or core facility guidelines.  For image acquisition (see Reference 8 for more details), it is important to have these controls: Fixed but unstained as a control for background autofluoresence of the cells and bacteria.Secondary alone control to check for non-specific staining.Single color controls in case of multi-color labeling experiment e.g. when doing dual immunolabeling of two different markers with compatible staining procedures in the same well. This is essential to collect images for each single color in all channels at exactly same settings as being used to acquire image of the multi-color sample. It helps to correct for the crosstalk (excitation for one dye with incident light indented for the other dye) and bleed-through (emission of one dye into detector for other dye). If single color controls indicate bleed through, it is best to do immunolabeling of only one marker in each well.Images are acquired using the instructions specific to the fluorescence or confocal microscope at high magnification e.g. with 60x 1.",
    "4 NA oil immersion objective using Nikon Eclipse TiE/B microscope. Set optimal exposure levels for differential interference contrast (DIC) and required color channel (DAPI, GFP and/or TxRed) without saturating the pixel intensity. Using the auto exposure tool with single color controls is useful in estimating an exposure level to prevent cross-talk.  After phagocytosis, mycobacteria with slender rod like morphology is mainly localized in vesicular structures/phagosomes in the cytoplasm of the cell up to 48 h (van der Wel et al., 2007). Mycobacteria is 0.2 to 0.5 µM in width with average width of 0.35 µM and so appropriate z-stacks should be obtained. A minimum of three fields with 10 to 15 macrophages per field should generally be acquired per well to generate a minimum of 100 regions of interest (ROI) per condition to use for calculation of statistical significance. Note: When using the autofluorescence of Mtb in DAPI channel to visualize bacteria, it is advised to keep the exposure of the sample to exciting incident light at 405 nm to minimum since it quickly bleaches the autofluorescence of Mtb. Deconvolute the images if required as in case of acquisition with Nikon Eclipse TiE/B epifluorescence microscope and correct for background on all images before analysis. Image analysisEndosomal/lysosomal markers localize around the phagosomal cargo (Fratti et al., 2001; Hava et al., 2008; Delaby et al., 2012; Mottola et al., 2014). In the illustrated example in Figure 2A, the host marker, transferrin receptor (TfR) is shown in grey and the phagosomal cargo, Mtb is in green. Here the degree of co-localization of the host markers and bacteria/bacterial clusters is variable between phagosomes (see phagosomes 1, 2, 3 and 4 in Figure 2A).",
    "Qualitative analysis done visually suggests phagosomes, 2 and 3 have high and phagosomes, 1 and 4 have low TfR staining around bacteria. For quantification of the host vacuolar staining around bacteria/bacterial clusters, I describe automated analysis done using NIS-Elements AR version 3.2 using Figure 2 as an example. Create a binary image in the color channel of the bacteria (green). In binary images, the background will have 0 pixel intensity and the selected object (bacteria) will have a pixel intensity of 1. In the given example, Figure 2B, this can be achieved by “Thresholding” the intensity in the color channel of the bacteria. Additionally, in NIS Elements Advanced Research software, the “Autodetect all” tool can be used which works by detecting the intensity of the pixels under the cursor and so the cursor movement helps to mark all the bacteria in a given field.Using the binary image of the bacteria, “Dilate” three times to enlarge the marked bacteria in the active window. Copy this image with dilated bacteria to clipboard which is a reference binary image to be used later (Figure 2C). Now using the active window of the dilated bacterial image, “Erode” three times to shrink the enlarged area in step D26. This creates a current binary image to be used later (Figure 2D). Use the command “eXclusive OR” (XOR) function on the two images (Figure 2E), the reference and current binary from steps D26-27, respectively to generate a processed result binary image where “rings” are marked around bacteria/bacterial clusters (Figure 2F).In the active result binary image, converting the rings to regions of interest (ROIs) (see ROI IDs: 1-4 in Figure 2G). Open the image of the vacuolar marker (e.g.",
    "TfR) and measure the ROI in that channel to obtain the mean fluorescence intensity (MFI) for the ROIs (see Figure 2H).Notes:  Validation of the analysis: The visual scoring of high co-localization on phagosomes 2 and 3 and less on phagosome 1 and 4 in Figure 2A correlates with automated quantification in Figure 2H with ROI ID: 2 having maximum mean intensity and ROI ID: 1 has the least mean intensity of fluorescence.The count number of three for dilation and erosion should be optimally determined for each phagosomal cargo by individual user on set of images to best capture the signal intensity of the vacuolar marker. Plot the MFI for all the ROI on the Y-axis for each well. Graph display, statistical calculations and P values can be determined using Graph Pad Prism software.Notes: Morphology operators (dilate, erode) and Boolean logic operations are integrated as processing tools in many image analysis softwares for easy use. However, they are based on complex mathematical theories and so I refer to literature (Serra, 1987; Dougherty and Lotufo, 2003) to be careful with the interpretations of these processing parameters. Individual user should optimize automated analysis of co-localization of different host markers with phagosomal cargoes and tally the results with visual scoring to validate the analysis as described above in section D of the protocol. The results of automated analysis of a trafficking experiment (for example, co-localization of Mtb with TfR and LAMP1 at 3 and 24 hpi in Mtb infected macrophages) should be consistent with visual scoring done manually by a blinded observer. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140706/20140706181623_5938.jpgFigure 1.",
    "Illustration showing detachment of the top chambers from the 8 well chamber slide Remove the washing buffer from the wells (A) and insert blade as shown (B) and put gentle upward pressure which will detach the top plastic chamber (C) revealing a rubber gasket underneath (D). Peel off the rubber gasket gently (E).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180107/20180107185059_9037.jpgFigure 2.  Automated analysis of co-localization of host markers with mycobacterial phagosome. A. Immunostained image of Mtb infected RAW 264.7 macrophage at 24 hpi. A: Host marker (TfR) in grey and Mtb in green co-localize on phagosomes 1, 2, 3, 4 (pointed by blue arrows) to various degrees. Images have been pseudo-colored for illustration. B-H: Binary image processing to quantify co-localization as described in steps 25 to 30 of the section D of the protocol: Here, black, grey and yellow circles are symbolic representation of images C, D and F respectively. E shows pictorial representation of the effect of Boolean (XOR) operator on the images C and D image to yield F. H gives the quantification of mean fluorescence intensity (MFI) of TfR in the different ROIs with ID from 1 to 4."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}