{
  "id": 5740,
  "origin_website": "Bio",
  "title": "A Co-culture Assay to Determine Efficacy of TNF-α Suppression by Biomechanically  Induced Human Bone Marrow Mesenchymal Stem Cells",
  "procedures": [
    "Seeding the MSCsPrescreened human bone marrow (BM) MSC frozen stock at 2 million per cryo-vial, are thawed and seeded in a Falcon T225 cm2 flask with vented seal cap at 37 °C with 5% CO2. Ideal passage is between 1-5. After 2 to 3 days, 80% adherent cell confluency should be achieved for experimental use.Remove media completely and add 5 ml of room temperature sterile DPBS to rinse the cell monolayer. Aspirate out completely.Add 5 ml of Tryp-LE Express dissociation reagent. Allow volume to spread throughout monolayer and place the flask inside the tissue culture incubator for 5-8 min.Collect the cell suspension by adding 5 ml of MSC media (see Recipes) to curtail the Tryp-LE effects. Add contents into a clean 15 ml conical centrifuge tube.Re-rinse the flask with 2-3 ml of MSC media to collect remnant cells.Add contents into the same 15 ml centrifuge tube.Place the centrifuge tube into a swing bucket tabletop centrifuge (Hettich Rotofix 32A) and spin down suspension at 617 x g (2,000 rpm) for 5 min.Aspirate out the media mix using a vacuum suction, without disturbing the cell pellet.Gently tap with fingers the conical end of the 15 ml centrifuge tube, to aid in pellet disbursal. Re-suspend the cell pellet with 2 ml of MSC media by gently mixing with a 5 ml serological pipette.Once mixed, quickly take a 10 μl aliquot of cell suspension for cell counting, and place it into a fresh 1.5 ml microcentrifuge tube. Add to the suspension, 10 μl of trypan blue. Mix by pipetting 5-8 times.Take a final 10 μl aliquot of this solution and place into a hemocytometer (Hausser Scientific) with cover glass (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170813/20170813215922_1789.jpgFigure 1. Cell counting profile for MSCs. Example of one of the four quadrants at 200 μm.Count the four outer quadrants.",
    "Cell numbers should be close to and not fewer than approximately 30 cells per quadrant (Figure 1).Calculate the cell concentration (number of cells per ml) by the sum of 4 quadrant counts multiplied by the dilution factor of 2 and multiplied by the factor 2,500. This will equal cells per ml.Once the cell number per ml is calculated, take the required aliquot of cell suspension needed to obtain a 2 x 105 cells per ml.The slides utilized are IBIDI VI0.4 six channel slides with a channel volume of 30 μl. Add 32 μl of your cell suspension into each channel using a P200 pipettor and tip. Insert the pipette tip into the slide reservoir and inject cells directly into the channel (Figure 2A).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170813/20170813220039_7576.jpgFigure 2. Seeding method for the IBIDI VI0.4 slide. A. Pipet in cell suspension directly into the slide channel inside reservoir; B. All channels filled; C. Humidified chamber setup.If there are bubbles that have formed after adding the cells, pick up the IBIDI slide and gently tap the edge to allow the bubbles to move toward the reservoirs of the channel. Place the slide cover over the IBIDI slide (Figure 2B). Place the slide into a 15 cm Petri dish, containing a 35 mm Petri dish filled ~3 ml of DPBS (Figure 2C). Place the lid back on the 15 cm dish with the lid. Note: This setup provides a ‘humidified chamber’ for the IBIDI slide, preventing media evaporation while inside a tissue culture incubator.Place the dish inside a 37 °C incubator and allow the cells to attach for 30 min.After 30 min, take the slide out and fill the individual channel by pipet dispensing ~2 drops between each channel reservoir until the full 125 μl of MSC media is dispensed.",
    "Note: This alternating drop-wise dispensing of media for each channel helps to minimize flow disruption, which allows non-attached MSCs to attach uniformly through the channel.Leave the slide overnight at 37 °C.Setting up IBIDI slides for WSSPrior to the WSS, the media must be replenished in each channel of the IBIDI slide. Duplicate channels for each treatment group (static, WSS, and other conditions) are required to obtain sufficient media for analysis in subsequent ELISA assays. Each channel has a reservoir port. From one end, draw out 125 μl of the old media without drawing out the 30 μl volume in the channel (see Video 1, start to 1:21 min).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Demonstration of steps 1-5 for setting up IBIDI slide for WSS  To the opposite reservoir port, add 125 μl of fresh MSC media. Repeat this one more time to ensure complete change of media.Wait for one hour prior to start of WSS. During that time, set up the REGLO peristaltic pump along with the 3-stop tubing, slide elbow connectors and round bottom 14 ml centrifuge tube, prefilled with 6 ml of MSC media. This is the flow reservoir that will supply individual channels of the IBIDI slide for recirculation. Each channel is provided with a separate 6 ml reservoir for WSS. The static sample does not receive recirculating medium, unless a low flow is desired or needed to maintain the health of the cells.Prefill the 3-stop tubing with media, up to the elbow connector end by adjusting the analog rate on the peristaltic pump between 25-35. Turn off the peristaltic pump when media nears the end of the elbow connector orifice. Set and press the elbow connector to the first reservoir port of the slide.",
    "The elbow connector with tubing that runs on the opposite side, connects to the reservoir port for the corresponding channel. The end of this tubing goes into the centrifuge tube. Repeat for the subsequent slide reservoir ports. Fully assembled, the slide should resemble that in Video 1 and Figure 3.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170813/20170813220258_3915.jpgFigure 3. WSS setup of the IBIDI slide: Schematic and the actual tubing/pump breakdown for one single channel of the IBIDI slideSet the REGLO peristaltic pump setting to 85, which is equivalent to 8.5 ml/min. Note: Dyne is a unit of measure of force required to accelerate one gram of mass at a rate of 1 cm/sec2. In microfluidics this force is called shear stress, or at a distance of zero from the wall of the channel, wall shear stress (WSS). This flow rate on the IBIDI VI0.4 channel generates ~10.8 dyne/cm2 of WSS on the MSC cell monolayer, assuming η = 0.0075, where dynamical viscosity(η) is a function of the viscosity and temperature of the media. (See IBIDI link below)http://ibidi.com/img/cms/support/AN/AN11_Shear_stress.pdf[href=http://ibidi.com/img/cms/support/AN/AN11_Shear_stress.pdf]Place the whole assembly into the incubator and start the pump after the one hour incubation period.Secure the incubator door and set timer for 3 h. Note: There is an alternative method of WSS utilizing syringe pumps, which can minimize flow pulsatility (Li et al., 2014).Harvesting splenocytesAt 1.25 h prior to the end of the WSS, proceed with harvesting the spleen from a male C57BL/6 mouse. Recommended age is between 2-4 months old. After removing the spleen, immerse the tissue in 10 ml of chilled PBS. Transport to the lab.Pour out PBS. Prepare a 70-μm strainer (blue rimmed) in a 50 ml conical tube. Drop the spleen on the strainer. Using a 1 cc tuberculin syringe plunger, completely pulverize the tissue through the strainer.",
    "Using a serological pipet, flush the top of the strainer, using chilled 2% FBS in PBS. Flush at most 10 to 15 ml of buffer. From the bottom of the strainer, using a 1,000 μl pipette tip on pipettor, withdraw any residual suspension of cell-buffer mix and add to the cell suspension.Spin down for 5 min at 640 x g at 4 °C. After centrifugation, note that the supernatant is turbid, but there is a ‘red’ pellet at the bottom. Pour out the supernatant, without disturbing the pellet.Add 6 ml of RBC lysis buffer and break up the pellet with the buffer using a 5 ml serological pipet. Then let the mixture sit on an ice bath for EXACTLY 7 min of incubation time. Note: If splenocyte cell mixture is left too long in the RBC lysis buffer, it may affect the cell performance.Setup the 40 μm strainer with a fresh 50 ml conical. To the cell suspension add 20 to 30 ml of 2% FBS in PBS buffer to help quench the RBC lysis buffer. Draw up the suspension using a 10 ml serological pipet and run it through the 40 μm strainer.Change serological pipet and withdraw 10 ml of FBS-PBS buffer. Rinse the original 50 ml conical tube for the RBC lysis then transfer the suspension through the same 40 μm strainer.Again using a 1,000 μl pipet tip, collect any residual cell suspension under the strainer and transfer to the cell suspension.Spin down at 650 x g for 10 min at 4 °C.Carefully pour out the supernatant and add 10 ml of the MSC media. Re-suspend the pellet and perform a cell count.",
    "There are potentially 40-60 million splenocytes extracted from one mouse spleen, so it is advisable to dilute an aliquot 1:10 in MSC media prior to taking a 10 μl sample for counting.Combine 10 μl of the 1:10 aliquot of suspension and 10 μl of trypan blue. Transfer 10 μl of the stained cells and place into a hemocytometer with cover glass.Count the four outer quadrants. As before, approximately 30 cells per quadrant will provide an accurate estimate of cell concentration (cell number per ml).Once the cells per ml is calculated, take the required aliquot of cell suspension needed to obtain 6 x 106 cells per ml. Adjust volume to 1 ml if needed.Preparing the co-cultureThe recommended ratio of MSCs to splenocytes is 1:30. After WSS exposure time is finished, disassemble the REGLO pump and channel reservoirs. Detach the elbow connectors from the IBIDI slides.Using a P200 pipettor and tip, remove the media from one end of the slide reservoir, down to the point that only the channel contains media (both reservoirs should be empty). Add 125 μl of fresh media at the opposite end of the slide reservoir, to rinse the channel. Repeat one more time.Again remove the media from the slide reservoir, but not the volume of the channel. Using a light vacuum and a glass Pasteur pipette, with a P200 pipet tip fixed at the end, carefully aspirate out all media in the channel, leaving only the MSCs. Work quickly.Using a P200 pipettor, gently mix the splenocyte suspension. Take 30 μl of this and inject into the IBIDI channel, directly into the channel as opposed to simply filling the reservoir. Repeat for all channels: static, WSS, other treatments, etc. Note: Always be sure to mix the splenocyte suspension prior to drawing for consistent cell numbers per channel.",
    "Place the slide with the co-culture into the 15 cm Petri dish used as a humidified chamber. Set the slides into the incubator for 30 min. This time is important for MSC-splenocyte interactions.You will need a splenocyte only culture used as a control for LPS treatment and non-treatment. Use a fresh IBIDI VI0.4 slide and fill four channels with 30 μl of splenocytes.Allow to incubate for 30 min with the co-cultured slides.After 30 min, fill the channel reservoirs by gently dispensing 45 μl of MSC media.Prepare a 2x concentration of lipopolysaccharide (LPS) at 2 μg/ml. The stock solution is 1 mg/ml and the final concentration in the channel will be 1 μg/ml.There will be 75 μl of media volume in the slide channels. Add 75 μl of the 2x LPS, alternating ~2 drops between each channel reservoir port until the 75 μl is dispensed for the one channel. After all channels on the slide are filled, gently pick up the slide with thumb and index finger and carefully rock it up to 10 ten times from reservoir port side to side to allow the media to flow and mix. Do not allow the media to overflow above the reservoir port rim, which causes media loss. This rocking motion allows for proper mixing of the LPS with the co-cultured cells and duplicate splenocyte only treatment group. The other duplicate splenocyte set remains untreated, with only MSC media. Place the slide cover on top of the slide and place in the humidified chamber.Place in the incubator for up to 18 h.mTNFα ELISA assayThe mTNFα ELISA kit (R&D Systems) must be taken out of the refrigerator and allowed to equilibrate to room temperature for at least 30 min.",
    "The TNFα control and the TNFα standard should be each reconstituted with 1 ml of double deionized water. The 25x wash buffer should also be thawed.After incubation of the co-cultured cells and the splenocyte only control conditions (LPS treated and non-treated), collect the media from duplicate channels, combining together the two channels for each treatment group into individually marked 1.5 ml microcentrifuge tubes. A volume of two duplicate channels will be approximately 300 μl. Place the microcentrifuge tubes on ice.Transfer the tubes into a refrigerated table top centrifuge and spin down at 650 x g for 5 min at 4 °C. This step is required to remove any cell debris and splenocytes.After centrifugation, transfer the media supernatant into a fresh pre-labeled tube. Discard the first tube with the debris pellet.Follow the link to pages 5 and 6 of the TNFα standard preparation and assay procedure. Use the appropriate diluents for each and proceed. https://resources.rndsystems.com/pdfs/datasheets/mta00b.pdf[href=https://resources.rndsystems.com/pdfs/datasheets/mta00b.pdf]. Note: The R&D ELISA assay procedure on page 6, steps 3 and 4, suggest to dilute you media sample 1:1 with the RD1-63 diluent into the pretreated well, in duplicates. This should be done for the TNF-α standards and control. For the actual sample, our experience has shown that undiluted sample into the well, allows for consistent pg/ml TNF-α values compared with an RD1-63 diluted sample, which can at times be inconsistent, possibly due to interfering contents in the media. We use straight 100 μl of media sample in duplicate wells for each condition, including the splenocyte only samples, both treated (with LPS) and untreated. After obtaining the values in pg/ml, final sample values calculated are reduced by multiplying to a factor of 0.5, to normalize to the diluted standard and control values, which initially are diluted.",
    "Continuing on the R&D assay procedure link from page 6, step 9, after adding the 100 μl of ‘Stop Solution’, wipe the bottom well plate surface using a paper towel to absorb any moisture from the washes and immediately take optical density readings using the Spectra MAX M2 microplate reader set at 450 nm wavelength. Wavelength correction, although recommended is not required due to the very minute difference in optical density differences related to bottom well surface imperfections. The concentration (pg/ml) for the standard and control mTNFα are factored by 1, since they were diluted by half with the RD1-63 diluent. For calculation of the actual media sample concentrations, you must include a multiplication factor of 0.5 to normalize to the standard and control."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}