{
  "id": 9306,
  "origin_website": "Jove",
  "title": "Promotion of Survival and Differentiation of Neural Stem Cells with Fibrin and Growth Factor Cocktails after Severe Spinal Cord Injury",
  "procedures": [
    "All animal protocols are approved by VA-San Diego Institutional Animal Care and Use Committee (IACUC). NIH guidelines for laboratory animal care and safety are strictly followed. Animals have free access to food and water throughout the study and are adequately treated for minimizing pain and discomfort.\n1. Preparation of Fibrin Components Containing Growth Factor Cocktails\nDissolve 25 mg rat fibrinogen in 0.5 ml PBS to obtain 50 mg/ml 2x stock solution (see Materials table). Fibrinogen is difficult to dissolve and should be placed into a 37 °C incubator or waterbath and shaken every 5-10 min for 1-2 hr.\nDissolve 100 UN rat thrombin in 2 ml of 10 mM sterile CaCl2 to obtain 50 U/ml 2x stock solution.\nDissolve growth factors in PBS at the following concentrations to obtain 100 μl stock solution: 1 mg/ml: BDNF; NT-3 (high stock concentration as intrathecal infusion in vivo19); 200 μg/ml: GDNF; IGF; bFGF; EGF; PDGF; aFGF; HGF (about 1,000x higher than used for cell culture).\nDissolve 25 mg MDL28170 (calpain inhibitor) in 1.3 ml DMSO to obtain 50 mM DMSO stock solution, and then dilute 50x in PBS to obtain 1 mM stock solution.\nMix 100 μl of each growth factor component and 100 μl of MDL28170 (1 mM stock solution) to produce 1,000 μl growth factor cocktail solution (Figure 1).\nMix 500 μl fibrinogen 2x stock solution with 500 μl growth factor cocktail to obtain 25 mg/ml fibrinogen working solution containing growth factors and aliquot into 10 or 20 μl for storage at -70 °C. The solution is stable for up to 12 months at -70 °C.",
    "Similarly, mix 500 μl thrombin 2x stock solution with 500 μl growth factor cocktail to obtain 25 U/ml thrombin working solution containing growth factors and aliquot into similar 10 or 20 μl volumes for storage at -70 °C for up to 12 months.\nOn the day of grafting, place fibrinogen- and thrombin-containing growth factor cocktails on ice until mixed with cells.\n2. T3 Spinal Cord Transection\nAnesthetize adult female Fischer 344 rats or athymic nude rats using acceptable methods. Subjects are deeply anesthetized, when responsiveness to tail and paw pinch are completely absent. Note: We typically use 150-200 g Fischer rats or 180-220 g athymic rats, and an anesthesia cocktail (2 ml/kg) of ketamine (25 mg/ml), xylazine (1.3 mg/ml) and acepromazine (0.25 mg/ml).\nApply eye ointment to prevent dryness or injury of eyes while the animals are under anesthesia.\nShave the upper thoracic area and clean the skin with Betadine.\nCut the skin and muscle using #15 blade, expose T3 vertebra using a surgical retractor, and perform a laminectomy at T3 vertebra to expose T3/4 spinal cord using a rongeur.\nMake a longitudinal midline incision in the dura of approximately 2 mm length using a #11 blade.\nPlace iridectomy scissors underneath the dura to cut the right lateral entire spinal cord. Make another cut on the same side 1.5 mm more cadually.\nAspirate spinal cord tissue between the two cut segments with a blunt 23 G needle connected to moderate intensity vacuum. Use visual verification to ensure complete transection ventrally and laterally. This will complete a lateral hemisection.",
    "To extend the lesion to a full-width spinal cord transection, place mirror incisions into the left hemicord. Attempt to leave the dura intact, other than the first cut, to retain the firm graft/fibrin matrix in the lesion site when grafted two weeks later.\nSuture the muscle, apply antibiotic powder and staple the skin.\nInject lactated Ringer's (3 ml), Bannamine (2.5-5 mg/kg) and Ampicillin (80-100 mg/kg) (see Materials table) immediately after surgery and maintain rats in a warm incubator until thermoregulation is re-established.\nEmpty the bladder and inject the Ringer's and Ampicillin solution twice a day for about two weeks until the establishment of reflex bladder emptying (Figure 1B).\n3. Preparation of Freshly Dissociated Embryonic Day 14 Spinal Cord Neural Stem Cells\nObtain inbreed transgenic GFP F344 rats (F344-Tg(UBC-EGFP)F455Rrrc) from Rat Resource and Research Center, University of Missouri.\nInject 40 μg des-Gly10, [D-Ala6]-Leuteinizing Hormone Releasing Hormone Ethylamide (LHRH) diluted in PBS at a concentration of 200 μg/ml intraperitoneally (IP) per mature female rat (8 weeks or older) after 2-3 hr light induction for synchronization of embryo collection.\nMate with a mature GFP homozygous or heterozygous male rat overnight 4 days after injection.\nCollect embryos at days 13.5-14.5 postcoitus (p.c.) in cold HBSS buffer, examine GFP expression under a \"NightSea\" flashlight and filter glasses (BLS1 - BlueStar Flashlight and Model VG1 barrier filter) or a fluorescent microscope.\nDissect spinal cord out aseptically from each GFP-positive fetus and remove overlying meninges and attached spinal ganglia with iridectomy scissors and fine jewelers forceps.\nCollect the dissected spinal cords into 2 ml cold HBSS buffer in a 15 ml cornical tube and keep on ice.\nFollow reference #20 to dissociate dissected spinal cords:",
    "Briefly, add 2 ml of 0.25% Trypsin-EDTA to the tube containing dissected spinal cords (several cords can be digested together, 1 cord can generate enough cells for graft of one subject) and digest at 37 °C for 10-12 min.\nStop the trypsin reaction by adding 10 ml of DMEM containing 10% FBS to the tube and centrifuge the tissue at 2,500 rpm for 2 min.\nResuspend tissue in 2 ml NeuroBasal medium containing 2% B27, and triturate the spinal cord tissue using progressively smaller fire-polished Pasteur pipets.\nCentrifuge the cells at 2,500 rpm for 2 min, resuspend in 2 ml of NeuroBasal medium containing B27, and filter cells with a 40 μm cell filter strainer.\nCount the cells with a hemocytometer and divide the cells equally into two Eppendorf tubes.\nCentrifuge the cells and completely remove supernatant (1-2 min are required to withdraw all supernatant with a low vacuum tip) so the growth factor cocktails will not be diluted by remaining supernatant after cell re-suspension.\nResuspend each half of the cells in the fibrinogen or thrombin working solution containing growth factors, respectively, at a concentration of 250,000 cells/μl (cell pellet counts for about ⅓ final volume) and place them on ice prior transplantation (Figure 1A). Note that fibrinogen may spontaneously gel when mixed with cells before combining with thrombin at the lesion/graft site; to avoid premature gellation, mix cells in fibrinogen immediately before cell grafting in vivo.\n4. Transplantation\nReexpose the lesioned T3/4 spinal cord two weeks after spinal cord transection.\n5 μl fibrinogen-cells and 5 μl thrombin-cells could be directly injected into nine points of the lesion site through sealed scar tissue and intact dura without re-opening the lesion site.",
    "Use a 27 G needle to create 9 holes on the surface of the scar tissue and intact dura 1-2 weeks post lesion: 3 in center (one in middle point and two in laterals, and spaced 0.5 mm apart) and 3 in both rostral and 3 in caudal interface (about 0.5 mm rostral or caudal to the center of the lesion).\nThen inject half volume of fibrinogen cell solution into three central points of the lesion site and a quarter volume into 3 points of the rostral interface and a quarter volume into 3 points of the caudal interface.\nThen, immediately inject throbmbin cells into the same spots. The mixture of fibrinogen cells and thrombin cells inside the lesion site will form fibrin gel to hold cells into lesion site and the growth factor cocktails will support the survival of cells. Cells are injected using pulled glass pipettes connected to a PicoSpritzer (General Valve, Inc.).\nTransplant cultured human NSCs21 in the same procedure described above, and use fibrin and growth factor cocktails made from human reagents.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}