{
  "id": 3051,
  "origin_website": "Cell",
  "title": "Optimized protocol for assay for transposase-accessible chromatin by sequencing (ATAC-seq) from Drosophila melanogaster brain tissue",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nSample preparation/nuclei isolation\nTiming: 40 min\n      The foremost requirement of the assay is obtaining chromatin fragments\n      using transposase while preserving the nuclei integrity during sample\n      processing. Hence, ATAC-seq from tissue samples remains challenging since\n      flash freezing the samples interferes with the library quality,14[href=https://www.wicell.org#bib14]\n      optimization of the assay will vary with respect to the type of tissue and\n      often mechanical agitation is required for tissue rupture. Relatively few\n      ATAC-seq examinations have been conducted in\n      Drosophila melanogaster, and primarily focus to attain the\n      regulatory information from embryos and larvae. Sorted neurons from\n      Drosophila brains have been subjected to the transposase assay\n      employing genetic labeling with UAS-Gal4 system.13[href=https://www.wicell.org#bib13]\n      Some ATAC-Seq studies have used as low as 500 nuclei,9[href=https://www.wicell.org#bib9]\n      majorly 50000 nuclei have been posited in mammalian ATAC-seq assays.\n      However, Drosophila genome (∼180 megabase) is markedly smaller than\n      the mammalian genome. Considering, a Drosophila brain comprises of\n      ∼100000 neurons,15[href=https://www.wicell.org#bib15] bulk volume adding to the library\n      complexity and some loss during sample preparation, 35 flies of each\n      genotype were used for brain dissection. The current protocol follows the\n      basis of Omni-ATAC method (addition of digitonin and Tween-20; inclusion\n      of a wash step). With minor modifications in lysis buffer composition used\n      previously,10[href=https://www.wicell.org#bib10] the lysis was optimized for the brain\n      tissue. The steps outlined below were used to obtain intact nuclei:\n    \n        Dissect brains from 35 flies in pre-chilled (4°C) 1× DPBS and add,\n        separately for each genotype, in 1.5 mL DNA LoBind Eppendorf® tubes.\n      \nCentrifuge the tissue sample at 500 × g, 4°C for 5 min.\n        Remove the supernatant and resuspend the tissue in 250 μL pre-chilled\n        lysis buffer.\n      \n        Briefly vortex (15 s) the samples and incubate on ice for 10 min with\n        intermittent pipetting with 200 μL tips to rupture the tissue and lyse\n        the cells simultaneously.",
    "Note: Using Dounce homogenizer with the\n      present buffer compositions resulted in nuclear lysis. To use Dounce\n      homogenizer or automated homogenizers, it is recommended to slightly\n      reduce surfactant concentration (0.1% NP-40 and no Tween20) and increase\n      the total amount of sample and volume of lysis buffer (650 μL).\n    \nAdd 250 μL of wash buffer and gently tap the tubes.\n        Examine that the cell membrane has been lysed for more than 90% of\n        cells, as described earlier.16[href=https://www.wicell.org#bib16]\n            Briefly, aliquot 5 μL of thoroughly mixed cell suspension in a fresh\n            tube.\n          \nIn equal parts (i.e., 1:1/5 μL), add 0.4% trypan blue.\n            Mix gently and incubate at RT for 3 min before examining for cell\n            viability.\n          \n            Confirm that the cell membrane has lysed for a minimum 90% cells.\n          \n        Pass the suspension through cell strainer (40 μm) in a new 1.5 mL DNA\n        LoBind Eppendorf® tube to remove large fragments of tissue debris.\n      \n        Centrifuge at 500 × g for 10 min at 4°C in a fixed angle\n        microcentrifuge.\n      \nDiscard the supernatant (cytoplasm) and keep the pellet (nuclei).\nExamination of nuclei integrity\nTiming: 15 min\n      All chromatin examination techniques, ranging from ChIP, conformation\n      assays, ATAC-seq, Hi-ChIP etc require the preserved integrity of chromatin\n      architecture during sample preparation. In this case, we have ascertained\n      that the isolated nuclei are intact by examining that the nuclei are\n      spherical and do not exhibit any leaking of DNA.\n    \n        Gently but thoroughly mix each sample to attain a uniform suspension and\n        then aliquot 10 μL into respective fresh tubes.\n      \n        Add 5μL of DAPI (0.2 ng/μL) in 1×PBS to 10μL of nuclei suspension and\n        incubate for 15 min at RT.\n      \n        Mount 10μL of DAPI treated suspension on micro glass slide and determine\n        the percentage of intact nuclei (Figures 2[href=https://www.wicell.org#fig2]A and 2B).\n        \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2594-Fig2.jpg\n              Figure 2. Examination of nuclei integrity from an aliquot of",
    "isolated nuclei\n            \n              (A and B) DAPI treated nuclei suspension under 20× and 60×\n              respectively.\n            \nAscertain that more than 90%–95% of the nuclei are intact.\nTransposition\nTiming: 35 min\n      The advantageous nature of ATAC-seq over other related traditional\n      techniques emerges from the use of Tn5 transposase for the tagmentation\n      based library preparation. The two Tn5 transposase monomers dimerize and\n      form a synaptic complex. The complex then transfers the transposon onto\n      the target DNA using oxygen molecules from the water for nucleophilic\n      action, facilitated by divalent metal ions.17[href=https://www.wicell.org#bib17] Herein,\n      the process involves transposase-based fragmentation and simultaneous\n      tagging of the DNA with adapter sequences. The two main parameters\n      crucial before proceeding for the transposition reaction are\n      (i) nuclei/transposase ratio (ii) genome size. Importantly, it is strongly\n      recommended to keep the nuclei to transposase ratio same between samples,\n      to compare their enrichment levels. We generated the libraries using 75000\n      nuclei, keeping transposase concentration similar to the mammalian\n      ATAC-assays.\n    \nNote: Change in the number of nuclei would\n      require optimization of transposition reaction. With 50,000 nuclei, we\n      observed over-tagmentation. This can further result in increased noise. On\n      the other hand, under-tagmentation can result in larger molecular weight\n      fragments. However, if starting material is limited (eg a subset of\n      neurons or segregation of neurons and glial cells is required), then it is\n      recommended to reduce Tn5 Transposase concentration and optimize\n      transposition reaction.\n    \n        Add the freshly prepared transposition reaction mix to the nuclear\n        pellet, followed by gentle pipetting (5–8 times, in 10 s).\n      \nPlace the samples in thermomixer at 37°C for 30 min at 1,000 rpm.\nPurification of DNA fragments\nTiming: 15 min\n      After transposition, the samples were immediately proceeded for DNA\n      purification using Ampure XP beads (2.5×).\n    \nKeep AMPure XP beads at RT, for 30 min before use.",
    "Vortex the the AMPure XP beads for 30 s to make sure that the beads are\n        evenly distributed.\n      \n        Resuspend and incubate the samples in 2.5× (125 μL) Ampure beads for\n        5 min at RT.\n      \n        Place the tubes on magnetic stand, until it clears. Carefully remove and\n        discard the clear supernatant without disturbing the beads.\n      \n        Give two washes with 200–300 μL of 80% ethanol, while the beads are\n        adhered towards the magnet. For proper washing, make sure that the beads\n        are completely immersed in ethanol.\n      \n        Carefully remove the leftover ethanol from each sample tube. With the\n        sample tube on the magnetic stand, air-dry the beads for 1 min. Do not\n        over-dry the beads.\n      \n        Elute with 22.5 μL of 10 mM Tris pH 8.0 by leaving beads in Tris for\n        approximately 2 min.\n      \n        Place the tubes on the magnetic stand for 5 min or until the supernatant\n        is clear and carefully transfer 21 μL of the supernatant to a new tube.\n      \n        Using 1 μL of sample, take the qubit reading to ascertain the\n        concentration and quality of the purified DNA.\n      \nPause point: Purified transposed\n      DNA can be stored at −20°C, until further processing, for ∼ 15 days.\n    \nPCR amplification and generation of libraries\nTiming: 2 h 15 min\n    \n        PCR reaction was followed as previously described9[href=https://www.wicell.org#bib9]\n        with minor modification, namely, increased volume of purified transposed\n        DNA to increase the yield. PCR for each sample comprised of the\n        following:\n      \ntable:files/protocols_protocol_2594_4.csv\nNote: CD index is unique for each sample.\n    \nSamples were amplified using the following PCR program\ntable:files/protocols_protocol_2594_5.csv\n        Conduct a q-PCR with 5 μL of the library obtained from previous step.\n      \nNote: The q-PCR step allows monitoring of\n      the amplification (of 5 cycles from PCR) in order to avoid\n      over-amplification/saturation and variation among samples. In this step we",
    "used KAPA library quant kit for Illumina (Roche) with minor modifications,\n      as listed below.\n    \ntable:files/protocols_protocol_2594_6.csv\nNote: CD index is unique per sample and\n      the same index should be used as used in the previous step (PCR\n      amplification and generation of libraries step 25).\n    \nPlot linear Rn vs. Cycle.\n        Calculate the number of cycles corresponding to 1/3 of maximum intensity\n        (Figure 3[href=https://www.wicell.org#fig3]).\n        \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2594-Fig3.jpg\n              Figure 3. Examination of amplification plot to determine the\n              additional number of cycles required\n            \n        Continue PCR for each sample/library for respective number of cycles\n      \ntable:files/protocols_protocol_2594_7.csv\nLibrary assessment and size selection\nTiming: 45 min\n      It is recommended to assess the DNA concentrations in each library, both,\n      pre and post size selection/cleanup.\n    \n        In this step (pre size selection), we used Qubit™ dsDNA HS kit,\n        following manufacturer’s protocol for assessing DNA concentration using\n        1 μL of the sample.\n      \nNote: Pre-size selection assessment of DNA\n      concentration provides a better estimate of volume of sample to be used\n      for further processing to obtain more concentrated samples.\n    \n        Carry out size selection using double-sided bead purification to\n        eliminate adapter dimers (<150 bp) and larger molecular weight\n        fragments (> 1,000 bp).\n      \n        To each sample, added in a fresh 0.5 mL/1.5 mL tube, add 0.5 × AMPure XP\n        beads. To comment precisely, here from second PCR we have 45 μL. Hence,\n        22.5 μL of the AMPure XP beads will be added.\n      \nMix thoroughly with gentle pipetting.\nIncubate at RT for 10 min.\n        Place against magnetic stand until the solution is completely\n        transparent and all bead particles are adhered towards the magnet\n        (usually 3–5 min).\n      \nNote: Here, fragments more than 1,000 bp\n      in size are adhered to the beads and hence removed.\n    \n        Transfer the supernatant to a new tube and add 1.3 × (of 45 μL PCR\n        product – i.e., 58.5 μL) AMPure XP beads.",
    "Mix thoroughly with gentle pipetting and incubate for 5 min at RT.\n      \n        Place the tubes on magnetic stand, until it clears. Carefully remove and\n        discard the clear supernatant without disturbing the beads.\n      \n        With the tubes on the magnetic stand, wash the beads by adding\n        200–300 μL of freshly prepared 80% ethanol to each sample tube. Incubate\n        for 30 s. Carefully remove and discard the supernatant.\n      \n        Repeat the above step for a total of two washes and carefully remove the\n        leftover ethanol from each sample tube.\n      \n        With the sample tube on the magnetic stand, air-dry the beads for 1 min.\n        Do not over-dry the beads.\n      \n        Remove the tubes from magnetic stand and resuspend the beads in 22.5 μL\n        of 10 mM Tris-HCl pH 8.0 and incubate for 2 min at RT.\n      \n        Place the tubes on the magnetic stand for 5 min or until the supernatant\n        is clear and carefully transfer 20 μL of the supernatant to a new tube.\n      \nPause point: Libraries can be\n      stored at −20°C for up to 3 months or −80°C for long-term storage (The\n      prepared library can be stored for long but should not be subjected to\n      freeze thawing).\n    \nPost size selection library assessment:\nNote: As mentioned earlier, we used Qubit™\n      dsDNA HS kit, following manufacturer’s protocol for assessing DNA\n      concentration. More importantly, to determine the quality, size and\n      integrity of the library, we used Agilent 4200 TapeStation system.\n      Furthermore, the pre-sequencing assessment of the library provides the\n      elucidation of the nucleosomal periodicity.\n    \nCritical: It is recommended to examine\n      the fragment size distribution at this step (Figure 4[href=https://www.wicell.org#fig4]).\n    \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2594-Fig4.jpg\n          Figure 4. Bioanalyzer profile of a CS library depicting fragment size\n          distribution (base pair) with upper and lower size markers\n        \nSequencing of the libraries\nTiming: 24–26 h\n        Pool the libraries at equimolar quantities and subject to high depth",
    "sequencing. We sequenced 8.5 pM of the denatured pooled library.\n      \n        Sequence the libraries, keeping the sequencing depth ∼ 20–50 million\n        reads.\n      \nNote: Suggested total number of read pairs\n      per sample for examining chromatin accessibility is 20–50 million\n      depending on the genome size. The depth of sequencing in the present study\n      was 40 million. However, for examining nucleosome occupancy and footprint\n      analysis, it is essential to further increase the depth. The scope of this\n      protocol caters to only examination of chromatin accessibility.\n    \nNote: In the current protocol, 2 × 100\n      base pair read length was used for sequencing with Illumina HiSeq 2500.\n      Previously, even 36 base pair read length has been utilized successfully14[href=https://www.wicell.org#bib14]).\n    \nCritical: (1) Only paired-end\n      sequencing should be carried out for ATAC assay since it is essential to\n      cover each nick (on either strand) introduced by the enzyme. (2) It is\n      recommended to carry out a low depth sequencing first and conduct a\n      quality check with respect to TSS enrichment, uniform coverage of the\n      genome, mapping to the genome, percentage of mitochondrial reads and\n      nucleosomal periodicity.\n    \nATAC-seq data analysis\nTiming: 4–5 h\n      Even though ATAC-seq has become the ‘method of choice’, there has been a\n      limited advancement in developing specific bioinformatic tools and\n      pipelines for ATAC-seq. Owing to the similarity of the nature of data\n      between ATAC-seq and ChIP-seq, a wide variety of bioinformatic tools\n      available for the latter, have been utilized in ATAC-seq analysis.\n      Recently ATACseqQC has been developed for specific quality checks for\n      ATAC-seq data.18[href=https://www.wicell.org#bib18] Here, in the second part of the\n      protocol (ATAC-seq data analysis), we present the pipeline followed in the\n      current examination for quality check, alignment, and peak calling\n      utilizing available tools and guidelines.18[href=https://www.wicell.org#bib18],19[href=https://www.wicell.org#bib19],20[href=https://www.wicell.org#bib20] The scope of the present protocol does not\n      provide further downstream integrated analyses with RNA-seq, ChIP-seq etc.",
    "Figure 5[href=https://www.wicell.org#fig5] displays the detailed schematic followed\n      along with some of the alternative tools available and\n      Figure 6[href=https://www.wicell.org#fig6] presents the ATAC-seq quality check,\n      annotation and ATAC-seq peaks profile [Figure 6[href=https://www.wicell.org#fig6]: (a)\n      Estimation of library complexity using ATACseqQC in CS (b) Fragment size\n      distribution in ATAC-seq library in CS generated using ATACseqQC (c)\n      Genome coverage plot of reads using ChIPseeker (d) Enrichment plot using\n      ChIPseeker showing enrichment at TSS (e) Tag plot showing reads mapping at\n      TSS (+/- 3,000 bp), generated using ChIPseeker (f) Plot showing annotation\n      of ATAC peaks, generated using ChIPpeakAnno (g)Heatmap showing ATAC peaks\n      in two CS replicates, generated using plotHeatmap of deepTools 3.5].\n    \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2594-Fig5.jpg\n          Figure 5. Schematic for ATAC-seq analysis followed, along with some of\n          the alternative tools available\n        \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2594-Fig6.jpg\n          Figure 6. ATAC-seq quality check, annotations and plot profiling\n        \n(A) Estimation of library complexity using ATACseqQC in CS.\n          (B) Fragment size distribution in ATAC-seq library in CS generated\n          using ATACseqQC.\n        \n(C) Genome coverage plot of reads using ChIPseeker.\n(D) Enrichment plot using ChIPseeker showing enrichment at TSS.\n          (E) Tag plot showing reads mapping at TSS (+/- 3,000 bp), generated\n          using ChIPseeker.\n        \n          (F) Plot showing annotation of ATAC peaks, generated using\n          ChIPpeakAnno.\n        \n          (G) Heatmap showing ATAC peaks in two CS replicates, generated using\n          plotHeatmap of deepTools 3.5.\n        \n      Demultiplexing of raw sequence files was carried out using\n      bcl2fastq(v1.8). Thereafter, the following pipeline was used and was found\n      to perform robustly well.\n    \nQuality check: FASTQC.\nAdapter removal: Cutadapt.\nAlignment: Bowtie-2.\nRemove duplicates and mitochondrial reads:\nPost-alignment quality check: ATACseqQC.\nPeak calling: MACS2.\nPeak analysis and annotation: ChIPseeker and ChIPpeakAnno.\n      Commands/script used for the above-mentioned analysis tools and suites\n    \n>save.image(\"STAR Protocols.Rdata\")\n>fastqc \"sample1.fastq\" \"sample2.fastq\"\n>cutadapt -a \"adapter sequence found in fastqc html\n          file\" -o \"sample1trimmed.fastq\"\n          \"sample1.fastq\"\nbowtie2 to build reference genome and mapping/alignment\n>bowtie2-build \"reference genome.fasta\" \"index\n          genome\"",
    ">bowtie2 --very-sensitive -x \"index genome\"\n          \"sample1trimmed.fastq\" > \"sample1_mapped.sam\"\nConvert sam file to bam file\n>samtools sort\n          \"sample1_mapped.sam\" > \"sample1.bam\"\nRemove PCR duplicates\n>samtools rmdup -s \"sample1.bam\"\n          \"uniquesample1.bam\"\nRemove mitochondrial reads\n>samtools view \"uniquesample1.bam\" egrep -v chrM\n          samtools view -bT \"dm6.fa\" -o\n          \"uniquesample1_rmmt.bam\"\nPeakcalling\n>macs2 callpeak -t \"uniquesample1_rmmt.bam\" -f BAM -g dm\n          --outdir \"MACS2_Output\" -B --SPMR - q 0.05\nGenerating bigwig files for visualization of peaks and generating\n            heatmaps using bamCoverage and deepTools respectively\n>bamCoverage -b \"uniquesample1_rmmt.bam\" -o\n          \"sample1.bw\" -bs 5 --smoothLength 20\n>computeMatrix reference-point -S \"sample1.bw\"\n          \"sample2.bw\" -R \"NApeak.bed\" --referencePoint\n          center -a 2500 -b 2500 --skipZeros -o \"sample1sample2matrix\"\n          --missingDataAsZero --skipZeros\n>plotHeatmap --matrixFile \"sample1sample2matrix\"\n          --outFileName \"sample1sample2_heatmap\"\nNote: sample names have been italicized.\n    \n      dm6.fa constitutes the reference fasta file of Drosophila genome.\n      NApeak.bed file comprises of the bed file generated from MACS2 output\n      files combined for both the samples. Alternatively, BED (browser\n      extensible data) file for Drosophila genes can be downloaded from\n      UCSC/Ensembl browser. Workflow for bioconductor packages, namely,\n      ATACseqQC,18[href=https://www.wicell.org#bib18] ChIPseeker21[href=https://www.wicell.org#bib21] and\n      ChIPpeakAnno22[href=https://www.wicell.org#bib22] is followed as previously described."
  ],
  "subjectAreas": [
    "Genomics",
    "Sequence Analysis",
    "Crispr",
    "Molecular Biology",
    "Sequencing",
    "Model Organisms"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}