{
  "id": 17696,
  "origin_website": "Jove",
  "title": "A Saline/Bipolar Radiofrequency Energy Device As an Adjunct for Hemostasis in Solid Organ Injury/Trauma",
  "procedures": [
    "Procedures involving animal subjects have been approved by the Animal Care Committee at the University of Calgary and follow the guidelines set by the Canadian Council of Animal Care. The committee ensures the study is ethical and that the animals are treated humanely.\n1. Model Preparation\nHouse the 50 kg adult male pig in an animal care facility for 1 week prior to the surgery to acclimatize the animal to the housing conditions and the handlers. Fast the model for a minimum of 6 h prior to the initiation of anesthesia.\nAnesthetize the model using an intramuscular injection of ketamine (33 mg/kg), atropine (0.04 mg/kg), and buprenorphine (0.05 mg/kg) as well as inhaled isoflurane (5%)9.\nMove the model into the supine position and spray the vocal cords with lidocaine (1%) in order to prevent laryngospasm. Perform direct endotracheal intubation using a 6.5 Fr cuffed endotracheal tube. Confirm the correct position of the endotracheal tube using capnography.\nInsert an 18G IV in the marginal ear vein and begin an infusion of Ringer's lactate at a rate of 200 mL/h. Apply a bland ointment to the model's eyes to prevent dryness while under general anesthesia.\nMonitor the model's heart rate and oxygen saturation using a pulse oximeter applied to the model's tail. Ventilate the model between 14 - 16 breaths/min using a mechanical ventilator and a tidal volume of 5 - 10 mL/kg. Maintain an adequate anesthesia by targeting a minimal alveolar concentration (MAC) of isoflurane between 2 to 2.5.\nPrior to the initiation of surgery, confirm the adequate depth of anesthesia by testing pain reflexes with a hind leg toe pinch. Reevaluate pain reflexes at regular intervals throughout the surgery.\n2. Device Preparation\nPrepare the ignited saline/bipolar radiofrequency (SBRF; Figure 1) device as per the manufacturer's specifications.",
    "Open the handpiece (6.0 bipolar sealing tip) and connect it to the generator.\nSet the saline flow rate setting to Low. Use 0.9% saline for a maximal energy conduction.\nSet the radiofrequency power setting to 160 W.\n3. Surgery: Laparotomy\nPerform a long open midline laparotomy incision using a #10 scalpel extending from the xiphisternum to the pubis and passing through all layers of the abdominal wall.\nEstablish an adequate exposure of the solid organs of interest (e.g., liver, spleen, kidney), mobilize other structures, and insert a retractor as necessary.\n\tNOTE: For simplicity, the liver will be referred to as the solid organ of interest for the remainder of this protocol. This protocol will also include creating injuries of similar grade within the kidney and spleen.\n4. Surgery: Simulated Solid Organ Injury\nNOTE: The injuries described below represent a worsening hierarchy of injuries. The injuries are created by an expert trauma surgeon and hemostasis will be obtained by another surgeon.\nUsing a #10 scalpel blade, apply an abrasive (back and forth) force to the liver capsule in order to induce capsular bleeding. The injury should be superficial (i.e., 1 - 2 mm) and 2 cm2 in size. The size of the injury can then be increased in increments of 1 cm2 at the operator's discretion.\nCreate solid organ lacerations of increasing severity using the direct application of a scalpel. The length of the laceration can extend from 5 cm to the entire length of the organ. The depth of the laceration should be 1 cm and then increased in increments of 1 cm at the operator's discretion.",
    "Create penetrating injuries with a blunt device such as a Kelly clamp using a stabbing motion. These can be of a partial thickness (i.e., 50% of the organ) or of full thickness (i.e., passing completely through the organ).\n5. Hemostasis\nDepress the handpiece's button, initiating the simultaneous flow of saline and the delivery of bipolar radiofrequency energy. The saline will boil at the site of application.\nApply the device's tip directly onto the liver's raw surface, to superficial areas of bleeding, or within defects in the liver itself. Do not stab the organ with the end effector.\nApply concurrent suctioning from a standard surgical sucker as needed in order to deliver the heated saline and energy directly to the areas of ongoing hemorrhage. This also helps visualize the precise location of the ongoing hemorrhage.\nHeat the tissues to approximately 100 °C (thermal coagulation without significant charring) using a gentle back and forth motion. An auditory 'pop' will occur after 3 - 5 s and signifies that the burn is complete. The user may then move the instrument in an organized manner to the next targeted site.\nIf necessary, apply precisely directed high-voltage electrocautery in conjunction with the application of the SBRF and suction devices in order to obtain hemostasis. This may be required for the largest and most vigorous hemorrhage.\n6. Sealing Small to Medium Bile Ducts\nUsing the same method as described above, apply the instrument tip across the cut/injured edge of the liver parenchyma to seal small to medium bile ducts.\n7. Model Euthanasia\nAt the completion of the experiment, euthanize the anesthetized model via exsanguination according to the institution's Animal Care Guidelines.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}