{
  "id": 9960,
  "origin_website": "Jove",
  "title": "High-throughput Screening of Carbohydrate-degrading Enzymes Using Novel Insoluble Chromogenic Substrate Assay Kits",
  "procedures": [
    "1. Chromogenic Assay with CPH Substrates in a 96-well Plate Format\nActivation of the assay kit plate\nActivate the 96-well filter (containing blue CPH-xylan) assay kit plate (List of Materials) by adding 200 µl activation solution (obtained with the kit) into each well, followed by 10 min incubation at room temperature without agitation.\nApply vacuum using a vacuum manifold (with the spacer block inside and any standard, transparent 96-well plate as a collection plate) to remove extant activation solution. It is also possible to use a centrifuge at 2,700 x g for 10 min for this step instead of the vacuum manifold.\nWash the CPH substrates by adding 100 µl sterile water and apply vacuum (or centrifugal force) to remove the stabilizer. Repeat this step two more times and the plates are now ready to use.\nEnzyme reaction\n\tNOTE: Always include buffer alone as a negative control and if possible previously characterized enzymes as positive controls. Use a statistically appropriate number of replicates. The CPH substrates are stable between pH 3.0 to 10.0 and the total volume of buffer end enzyme solution in each well should not exceed 180 µl. Plant extract or culture broth can also be used instead of purified enzyme solution.\n\t\nAdd 150 µl 100 mM sodium acetate buffer, pH 4.5 and 5 µl endo-cellulase solution (to a final concentration of 1 U/ml) to each well of the assay kit plate.\nPut the product plate (a clear-well plate compatible with the microtiter-plate reader) underneath the assay kit plate to collect any potential leakage from the reaction plate during shaking.\nIncubate the assay kit plate at 25 °C for 30 min in a horizontal shaker at 150 rpm.",
    "NOTE: Mixing the reaction in the assay kit plate during the incubation is crucial for achieving a consistent and reproducible result. CPH substrates are stable up to 90 °C. The incubation time should be increased up to 24 hr when testing culture broths containing unknown enzyme concentrations with CPH substrates. Note that appropriate incubation times depend on the activity of the enzyme(s), but in general if there is no detectable activity within 24 hr, it is likely that the enzyme will not degrade the tested substrate. An active enzyme is degrading the insoluble chromogenic polysaccharides of the CPH substrate into soluble chromogenic oligosaccharides, which are visible as colored supernatant.\nPlace the clean product plate inside the vacuum manifold with the spacer block inside.\nPlace the assay kit plate on top and apply vacuum (maximum negative pressure of -60 kPa). It is also possible to use a centrifuge at 2,700 x g for 10 min.\n\t\tNOTE: The filtrate containing the colored oligosaccharides as reaction product is now in the product plate for further analysis8.\nDetection and Quantification\nCheck that the volume of liquid in each well of the product plate is approximately the same by visual inspection.\nRead the absorbance of the collection plate at 595 nm for blue CPH-xylan using a plate reader.\nWhen doing data analysis, subtract the buffer-only negative control values from the values from the wells where an enzyme was added. Calculate the mean value and the standard error of means (SEM) from the replicate wells8.\n2. Chromogenic Assay with ICB Substrates in a 96-well Format\nEnzyme reaction\nAdd the 150 µl 100 mM sodium acetate buffer, pH 4.5 and 5 µl 31 U/ml endo-xylanase solution to each well of the assay kit plate containing red ICB-wheat straw (final enzyme concentration in the well: 1 U/ml).",
    "NOTE: The assay kit plates (96-well filter plates containing ICB substrates) are manufactured as described in literature (see List of Materials). The ICB substrates are stable in buffers with a pH range between pH 3.0 to 10.0. Always include buffer alone as a negative control, commercial enzymes as a positive control and use a statistically appropriate number of replicas.\n\t\t\nDo not activate the ICB substrates like the CPH substrate plate, but remove the stabilizer by washing three times with 100 µl water followed by vacuum filtration or centrifugation.\nPut the product plate underneath the substrate plate to collect any potential leakage from the substrate plate during shaking.\nIncubate the reaction at 25 °C shaking at 150 rpm for 2 hr.\n\t\tNOTE: An active enzyme is degrading the insoluble chromogenic polysaccharides in the ICB substrate into soluble oligosaccharides, which are visible as colored supernatant. ICB substrates are stable up to 90 °C. The incubation time should be increased up to 24 hr if non-purified enzymes such as culture broths are used.\nPlace the product plate inside the vacuum manifold with the spacer block inside.\nPlace the assay kit plate on top and apply vacuum (maximum negative pressure of -60 kPa) or use a centrifuge to filtrate the product from the assay kit plate into the well of the product plate.\n\t\tNOTE: The filtrate containing the colored oligosaccharides as reaction product is now in the collection plate for further analysis8.\nDetection and quantification\nCheck that the volume of liquid in each well of the collection plate is approximately the same by visual inspection.\nRead the absorbance of the collection plate at 517 nm for red ICB-wheat straw using a plate reader.",
    "When doing data analysis — subtract the buffer — only negative control values from the values from the wells where an enzyme was added. Calculate the mean value and the standard error of means (SEM) from the replicate wells8.\n\t\tNOTE: In case of screening unknown enzymes, we suggest making a dilution series in order to obtain more detailed data about the dynamic range of enzyme's activity."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}