{
  "id": 1653,
  "origin_website": "Cell",
  "title": "Mass production of human airway-like neutrophils via transmigration in an organotypic model of human airways",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation of air-liquid interface (ALI) cultures\nTiming: 2 weeks\nH441 cells (2.5 ∗ 105 cells) are seeded on an Alvetex scaffold to achieve ALI as observed in the lung. The porosity of the Alvetex scaffold was chosen to utilize neutrophils for transmigration assays with optimum yield (Forrest et al., 2018[href=https://www.wicell.org#bib2]). This scaffold does not constrain transmigrating neutrophils in prefabricated channels unlike conventional Transwells / Snapwells. Instead, transmigrating neutrophils gather under the epithelium and transmigrate en masse while allowing the epithelial to reseal, as evidenced by a temporary increase in dextran permeability (Forrest et al., 2018[href=https://www.wicell.org#bib2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1116-Fig1.jpg\nFigure 1. Preparation of Alvetex filters for use in the organotypic model of human airways\n(A) In order to fit into the 12-well plate, the scaffolds need to have the outermost tabs of plastic removed. They are already perforated. Be careful not to crack the scaffold.\n(B) 70% ethanol is added dropwise to filters to rehydrate them and allow for them to be coated with rat tail collagen Type I. The filter will be white if not enough ethanol was added, and very shiny, with a visible pool of ethanol if it is too wet. When the ring of ethanol is barely visible the filters are ready for coating.\n(C) Uneven coating of collagen on the filters may result in holes on the filters that cells cannot grow on. Make sure that the collagen is evenly distributed across the entire filter.\n(D) Too much acidity in the media may lower the pH too far leading to non-optimal conditions for cell growth. Make sure the media is pink before growing cells on the scaffolds.",
    "The USG is used to obtain long-term, confluent, and polarized H441 cultures at ALI. USG-treated cultures develop as monolayers with apical microvilli and exclude any basally added medium from their surface. Exposure to air is a major physiological constraint faced by the pulmonary epithelium. These conditions lead to extensive differentiation of H441 cells with morphological and electrophysiological properties comparable to human small airway epithelial cells.\nGrow H441 cells in T-75 flasks or equivalent using DMEM-F12 + 10% FBS at 37°C + 5% CO2.\nH441 cells grow slowly when first thawed and should be passaged at least twice before use in the model. Discard cells after passage 21.\nH441 cells should not be allowed to grow more than 90% confluent. Typically, we split our cells every 2–3 days.\nLeave collagen at 25°C for ∼20 min before use (Day -1; Table 1[href=https://www.wicell.org#tbl1]).\ntable:files/protocols_protocol_1116_1.csv\nRemove the Alvetex inserts from the package and gently snap off the outermost tab such that the scaffolds fit into a non-tissue-culture-treated 12 well-plate (Figure 1[href=https://www.wicell.org#fig1]A).\nMake sure to only snap off the outermost tab. If the inner plastic is broken, then the filter and scaffold will not sit flat in the 12-well plate (See troubleshooting 1[href=https://www.wicell.org#sec6.1]).\nUse 2–3 drops of 70% sterile filtered ethanol to render the Alvetex membrane hydrophilic. Dry until the filter is only slightly opaque (if becomes white again it is too dry, add more ethanol) (Figure 1[href=https://www.wicell.org#fig1]B).\nIf the filter is too dry, the collagen will be unable to bind (See troubleshooting 2[href=https://www.wicell.org#sec6.3]).\nCoat the Alvetex membranes with 200 μL Rat Tail Collagen I (at 3 mg/mL). Spread evenly over filter as it is dispensed from tip (without touching the filter) (Figure 1[href=https://www.wicell.org#fig1]C).",
    "We have found that using a P1000 tip and utilizing reverse-pipetting techniques is sufficient for handling the viscous collagen, particularly at room temperature (See troubleshooting 2[href=https://www.wicell.org#sec6.3]).\nWe have found that there may be brand-to-brand variability in the quality of collagen. We highly recommend using the collagen from Sigma-Aldrich (See key resources table[href=https://www.wicell.org#key-resources-table]).\nStore at 37°C + 5% CO2 between 3-24 h.\nAt least 3 h is needed for the collagen to adhere to the hydrophilic membrane. Any longer than a day and the filter may dry out. Within this timeframe we have not noticed any differences in quality of the filter or subsequent ALI cultures.\nAdd 2 mL of trypsin to the 90% confluent T-75 flask that contains H441 cells (Day 0; Table 1[href=https://www.wicell.org#tbl1]).\nIncubate at 37°C + 5% CO2 with gentle agitation for 5 min or until cells have completely detached from the bottom of the flask.\nNeutralize trypsin by adding 8 mL of DMEM-F12 + 10% FBS to the flask.\nTransfer trypsinized-cells to a 15 mL conical tube, remove a 10 μL aliquot, and spin the conical tube at 800 × g for 10 min to pellet the H441 cells.\nWhile the cells are centrifuging mix the 10 μL aliquot of cells with 10 μL of EB/AO live/dead stain and quantify the number of cells using a hemacytometer or similar cell-counting method.",
    "Calculate the total number of cells in the pellet by the following calculation:  # c e l l s ∗ 2 ∗  10 4  ∗ 10 = t o t a l  c e l l s  Where #cells is the average number of cells counted in each quadrant of the hemacytometer, “2” is the dilution factor, 104 is the distance to volume conversion for a hemacytometer and “10” is the total volume of cells that were originally centrifuged (10 mL). Adjust the dilution factor to have an adequate number of cells to count.\nWhen the cells are done centrifuging, discard the supernatant and resuspend the cells in X mL of DMEM-F12 + 10% FBS such that the cells are at a final concentration of 2.5 ∗ 105 cells/mL.\nCalculate the volume (X) to resuspend the pellet in by the following calculation:\n    t o t a l  c e l l s   X  m L   = 2.5 ∗   10 5  c e l l s / m L  \nAdd 1.5 mL of DMEM-F12 + 10% FBS basally to the bottom of the well.\nCollagen is dissolved in a sodium acetate buffer that is around pH 5.5. Since phenol red turns yellow below pH 6.8, if there is too much residual collagen the media will change color (Figure 1[href=https://www.wicell.org#fig1]D). If this occurs, rinse the bottom of the filter with additional DMEM-F12 + 10% FBS or RPMI until the media remains pink.\nGently, add 1 mL of resuspended H441 cells (2.5 ∗ 105 cells/mL) apically (top of the filter).",
    "Being too rough at this stage will result in cells overflowing the filter and seeding the bottom of the well (not the filter) leading to a variable number of cells on the filter. Inevitably, some cells will be found on the bottom of the culture dish, but this should be minimized by slowly dispensing the cells on top of the filter.\nGrow at 37°C + 5% CO2 for 24 h.\nThe next day (Day 1; Table 1[href=https://www.wicell.org#tbl1]), aspirate all media from both the basal and apical sides and replace with 1.5 mL of AIM + USG basally (bottom of the filter). Leave the apical side exposed to air.\nChange the media basally on a Monday/Wednesday/Friday schedule by aspirating the media from the opening between the wall of the well and the filter without removing the filter from the well.\nIt is important to use freshly prepared AIM + USG for each media change as USG is unstable in solution at 4°C.\nAvoid bubbles under the filter, as it will prevent even distribution of nutrients.\nOn Day 3 or 4 (Table 1[href=https://www.wicell.org#tbl1]) transfer the filters to a clean 12-well plate. Over time, the cells that were washed off the filter during the initial seeding of cells on the filter (step 14) would start to consume nutrients from the media.\nAfter 2 weeks (Day 14; Table 1[href=https://www.wicell.org#tbl1]) from the seeding date (Day 0) the filters are ready to be flipped and used. For best results, use the plate no later than Day 19 from seeding.\nPurification of neutrophils\nTiming: 2 h",
    "This step describes a method for the purification of primary neutrophils from human blood using a gradient density centrifugation. Refer to the manufacturer’s instructions for complete details (https://www.proteogenix.science/product/polymorphprep/[href=https://www.proteogenix.science/product/polymorphprep/]). Other methods can be used, but cell activation and death need to be assessed prior to use for downstream assays. These neutrophils will be used to transmigrate across the epithelium grown at ALI to induce acquisition of an airway-like phenotype. The purification of neutrophils should be conducted on the day that the filters are to be used (Day 14–19; Table 1[href=https://www.wicell.org#tbl1]). We have also used this model to transmigrate and induce an airway-like phenotype in primary human blood monocytes (Ford et al., 2021[href=https://www.wicell.org#bib1]).\nCollect blood in an EDTA tube (final concentration 1.5–2.0 mM) in the clinic or appropriate location for phlebotomy (step 19 is excluded in the total time of the protocol to prepare the airway supernatant due to the variability of patient visits and the time it takes to go from clinic to lab.)\nAnonymize all relevant donor details as described in your IRB or Medical Ethics protocol.\nProcess blood as soon as possible, typically within 2–3 h.\nCritical: Make sure to strictly adhere to all relevant safety procedures when working with human samples.\nAdd 6 mL of Polymorphprep™ (PMP) to a 15 mL conical tube.\nSlowly layer 6 mL of whole blood on top of the PMP solution.\nCentrifuge at 400 × g for 42 min at room temperature with slow acceleration and minimal brake.\nFor density gradient centrifugations a swinging-bucket style centrifuge is best.\nRemove the plasma and top mononuclear cell band (upper band) (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1116-Fig2.jpg\nFigure 2. Density gradient separation of human blood neutrophils and flipping of the filters",
    "(A) Blood is loaded on top of the Polymorphprep (PMP) solution and then centrifuged at 400 × g for 42 min with minimal brake. The neutrophils of some donors sediment with a large number of red blood cells, while others have very few red blood cells observed with the neutrophil band (3). For the blood from donor 1 it would be advisable to find an alternative protocol to PMP purification of neutrophils. Donor 2 may be usable but would require a more extensive hypotonic lysis (See troubleshooting 3[href=https://www.wicell.org#sec6.5]). The peripheral blood mononuclear (PBMCs) cells make up the top band, while the bottom band contains the granulocytes, which are overwhelmingly comprised of neutrophils.\n(B) The Alvetex scaffolds consist of two plastic parts: Components 1 & 2. The filter is sandwiched between the two components.\n(C) In order to flip the membrane to have the correct orientation of the epithelium for transmigration of neutrophils, components 1 & 2 must be separated and the filter flipped. Upon separation of the components, the filter can end up in one of two locations. If the filter is attached to component 1, Methods video S1[href=https://www.wicell.org#mmc1] – Flipping Component 1 shows how to flip the filter. If the filter is attached to component 2, Methods video S2[href=https://www.wicell.org#mmc2] – Flipping Component 2 shows how to flip the filter. After flipping, the components are pieced back together and put into a 12-well plate containing transmigration media such as CFASN or LTB4. When placing the filter into the well, tile the plate to avoid the introduction of air bubbles.\nCollect the neutrophil band (lower band) using a Pasteur pipette and transfer to a clean 15- or 50-mL conical tube depending upon volume.",
    "We have observed that some donors have a large amount of red blood cells that sediment with the blood neutrophils. We define large amount roughly as RBC contamination that is ∼3+ times thicker than the neutrophil band (Figure 2[href=https://www.wicell.org#fig2]A). These donors should generally be avoided (See troubleshooting 3[href=https://www.wicell.org#sec6.5]). Make a note of donors whose blood separates adequately or not on PMP for future reference in case of repeat visits. For donors with blood that does not cleanly separate out the neutrophils use an alternative protocol such as EasySep (https://www.stemcell.com/easysep-direct-human-neutrophil-isolation-kit.html[href=https://www.stemcell.com/easysep-direct-human-neutrophil-isolation-kit.html]).\nAdd 1 volume of 0.45% w/v NaCl to the neutrophils. Gently mix by inverting the tube 3–4 times.\nCentrifuge at 800 × g for 5–10 min until the solution is clean and all cells are pelleted. Use maximum acceleration and braking for this step and all subsequent steps.\nWe have found that 800 × g for 5–10 min is a good compromise for efficient pelleting of the neutrophils while still avoiding cell death.\nAfter the centrifugation step is complete, cool the centrifuge to 4°C.\nDiscard the supernatant.\nTo avoid unwanted activation or cell death of the neutrophils keep neutrophils on ice at all times from this step forward.\nQuickly resuspend the pellet in 5 mL of ice-cold, sterile cell-culture water. Incubate on ice for 30 s.\nThis step lyses red blood cells that may be contaminating the neutrophils. They will be clearly visible. There is donor to donor variation (as well as variation on a day-to-day basis) for the amount of red blood cells that may copurify with the neutrophils.\nDo not allow this incubation to go past 45 s to avoid undesired cell death of the neutrophils.",
    "We have not tried other lysis solutions such as ACK lysis buffer, but these may be acceptable. As always, when working with neutrophils make sure to determine that your protocol does not result in errant activation of the cells as a result of your purification protocol.\nQuickly restore osmolarity by adding 5 mL of ice-cold 1.8% NaCl to the tube. Gently mix by inverting the tube 3–4 times.\nOther solutions such as 2× HEPES may also be used.\nCentrifuge at 800 × g for 5 min at 4°C.\nRepeat the red blood cell lysis for a total of 2–3 times until no red is visible in the cell pellet. More than three lysis steps should be avoided to prevent activation of the neutrophils.\nResuspend the neutrophils in cold RPMI at a concentration of 1∗107 cells/1 mL and keep on ice until needed. Remove a small aliquot to quantify the number of cells and take note of live and dead cells.\nViability should be greater than 95%. Refer to troubleshooting 4[href=https://www.wicell.org#sec6.7] for details if low viability is observed.\nUse the neutrophils within 1.5 h from purification.\nFlipping of filters\nTiming: ∼20 min (about 45 seconds/filter) + 5 minutes of preparation time\nThis step reverses the orientation of the H441 epithelial cells grown at ALI on Alvetex filters and allows purified blood neutrophils to be added on top (basal aspect of the epithelium) and transmigrated towards the fluid bathing the apical aspect of the epithelium. Transmigrated neutrophils will take on an airway-like phenotype that changes based on the media they are transmigrated towards.",
    "This step should be conducted immediately after the neutrophils are purified. It may be helpful to have one person process the blood and purify the neutrophils. Then, when the hypotonic lysis starts (step 28), the second person can begin preparing the transmigration media and flipping of the filters. There are two plastic components to the filters, which we have termed Component 1 (Larger) and Component 2 (Smaller) in addition to the filter (Figure 2[href=https://www.wicell.org#fig2]B).\nDilute CFASN 1:3 (6.67 mL of CFASN + 13.33 mL RPMI) for a 12-well plate.\nAliquot 2 mL of diluted CFASN into each well of a non-tissue culture treated plate.\nA non-tissue culture treated plate should be used as tissue-culture plates may activate the neutrophils (Nathan, 1987[href=https://www.wicell.org#bib8]).\nSeparate components 1 and 2 to allow flipping of the membrane. The membrane will remain attached to either of the components. Different steps must be taken in either scenario to ensure correct inversion of the membrane for the epithelium to be facing the apical compartment. Take care not to drop or fling the filter by applying too much force (Figure 2[href=https://www.wicell.org#fig2]C; Methods video S1[href=https://www.wicell.org#mmc1] and S2[href=https://www.wicell.org#mmc2]; troubleshooting 5[href=https://www.wicell.org#sec6.9]).\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Flipping component 1, related to step 2C\n    Your browser does not support HTML5 video.\n  \nMethods video S2. Flipping component 2, related to step 2C\nScenario 1 – The membrane sticks to component 1 (Larger piece) – Methods video S1[href=https://www.wicell.org#mmc1]\nThis is usually the easier scenario to correctly flip the membrane.\nAfter separating components 1 and 2, place both components upside down in the sterile packaging that contained the new plate to use for the transmigration assay.",
    "Using forceps, gently nudge the filter then pick up the opposite end, invert it, and place it back on the center of the bottom side of component 1.\nAlign the clips of component 2 with the tabs on component 1. Gently press component 2 back onto component 1 so that all the clips click into place.\nTake care not to touch the filter when doing this.\nRevert the reconstructed filter apparatus and place it into the appropriate well containing the transmigration fluid.\nTo avoid the introduction of air bubbles, slightly tilt the plate when adding the filter to the well. See troubleshooting 6[href=https://www.wicell.org#sec6.11] for steps to take to deal with air bubbles.\nScenario 2 – The membrane sticks to component 2 (Smaller piece) – Methods video S2[href=https://www.wicell.org#mmc2]\nIn this case removal of the membrane is usually more difficult, but it will not be physically inverted before being placed back into the filter apparatus.\nAfter separating components 1 and 2, place component 1 upside down in the sterile packaging and use the forceps to pick up the filter by aligning the curve of the forceps with the curve of the membrane.\nPick up the membrane and place it back down in the center of the bottom side of component 1 without inversion.\nAlign the clips of component 2 with the tabs on component 1. Gently press component 2 back onto component 1 so that all the clips click into place.\nTake care not to touch the filter when doing this.\nPlace the reconstructed filter apparatus into the appropriate well containing the transmigration fluid.\nTo avoid the introduction of air bubbles, slightly tilt the plate when adding the filter to the well. See troubleshooting 6[href=https://www.wicell.org#sec6.11] for steps to take to deal with air bubbles.",
    "Once all of the filters are placed into the appropriate wells containing the transmigration fluid proceed to step 45, which details the application of the purified neutrophils to the flipped filters.\nSteps 44 to 45 should be done as quickly as possible. Having a person prepare and flip the filters while another person is preparing the neutrophils may help with the transition between steps.\nTransmigration of neutrophils\nTiming: 1 h–1 day depending upon transmigration time\nThese steps describe the addition of neutrophils to the epithelialized Alvetex filter and subsequent collection of airway-like neutrophils that have transmigrated across it. The time for transmigration is a balance between maintaining viability of the neutrophils and obtaining the desired phenotype. See these papers for details (Forrest et al., 2018[href=https://www.wicell.org#bib2]; Grunwell et al., 2019[href=https://www.wicell.org#bib4]; Margaroli et al., 2021[href=https://www.wicell.org#bib7]). Again, note that we have also successfully used this model to transmigrate and induce an airway-like phenotype in primary human blood monocytes (Ford et al., 2021[href=https://www.wicell.org#bib1]).\nAdd 100 μL of purified blood neutrophils (1∗107 cells/1 mL from step 32) to the top of the filter.\nTake care not to touch the filter or pierce it with the pipette tip (troubleshooting 7[href=https://www.wicell.org#sec6.13]).\nMake sure that the plate is flat and that neutrophils are evenly dispersed across the filter.\nGently move the plate into the incubator at 37°C + 5% CO2. Allow the transmigration to occur for the desired amount of time.\nWe typically use a 4-h transmigration time to study “early” emigrated neutrophils and 10–18 h (overnight) for late-stage phenotypes. However, a time-course may also be used to study the induction of a particular phenotype (Margaroli et al., 2021[href=https://www.wicell.org#bib7]).\nRemove the filters.",
    "We have found that epithelial cells and neutrophils that did not transmigrate can be released from the Alvetex filter using Accutase. Using trypsin is also possible, but we observed dramatically reduced viability of neutrophils that did not transmigrate.\nGently pipette up and down 2 times with a P1000 to resuspend the transmigrated neutrophils and transfer to a 2 mL tube. Spin cells at 800 × g for 5 min at room temperature to pellet.\nDiscard or save the supernatant for other assays.\nComparison of the components of the fluid prior to, and after, transmigration may give insight into the function of both the epithelial cells and transmigrating leukocytes.\nWash the pellet by adding 1 mL of 1× PBS + 2.5 mM EDTA to the cells and spinning at 800 × g for 5 min. Discard the supernatant.\nResuspend the neutrophils 250 μL RPMI and make a 10 μL aliquot to quickly count the cells using a hemacytometer.\nThe counting of transmigrated cells should be done quickly and efficiently so that the transmigrated neutrophils do not alter their phenotype or lose their phenotype.\nAdjust the concentration of neutrophils to 1.2∗105 cells/120 μL for the bacteria-killing assay.\nOther assays may require the cell concentration to be different.\nWith a transmigration efficiency of 60% (6∗105 cells; the low-end of what we typically observe), at least 5 bacteria-killing reactions can be conducted. This may be helpful for replicates or when multiple conditions (drugs added, strains used, etc.) are needed.\nBacteria-killing assay\nTiming: 2 days\nThis step describes the use of P. aeruginosa (PA01), although other strains and bacteria can be used, to be combined with transmigrated neutrophils in a bacteria-killing assay. It may be helpful to have one person begin preparing the bacteria and subculturing while another handles transmigrated cells.",
    "The day before the transmigration, inoculate P. aeruginosa (PA01) in 3 mL of LB media.\nIf doing an 18-h transmigration the cells can be grown on the day that the transmigration is initiated.\nGrow overnight at 37°C at 200 rpm.\nTo make sure that there is no contamination in the LB media it may be prudent to also have a mock inoculated tube.\nAbout 1.5 h before the finish of the transmigration, subculture the bacteria by pipetting 10 μL of overnight growth in 3 mL of fresh LB media. Grow at 37°C with shaking until OD600 = 0.4–0.6.\nUse the standard curve generated from the original preparation of the bacteria to convert the OD600 to a concentration of cells (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1116-Fig3.jpg\nFigure 3. Use of P. aeruginosa (PA01) in a bacteria-killing assay with neutrophils\n(A) In order to grow bacteria to the correct density, a standard curve must be generated to relate the OD600 to the colony forming units (CFU).\n(B) When the bacteria and neutrophils are mixed together, they must be rotated end over end to prevent settling of the cells during this assay. The rotator is placed in a 37°C + 5% CO2 incubator.\n(C) PA01 grown at 37°C forms mucoid colonies that have poorly defined edges and are difficult to count. Grow the bacteria at a lower temperature, such as 30°C, to have better defined colonies.\n(D) Neutrophils that were transmigrated towards LTB4, a control chemoattractant, had a higher bacteria-killing capacity than neutrophils that were transmigrated towards the airway supernatant from the sputum of patients with CF (CFASN). Statistics were calculated with a Mann-Whitney U test. Plotted is the median with interquartile range.\nCentrifuge 2∗108 CFU at 16,000 × g for 2 min at 25°C.",
    "Resuspend the bacteria pellet in 500 μL of warm RPMI + 10% FBS.\nIncubate at 37°C + 5% CO2 on a rotator end-over-end for 30 min.\nIn our experience around the time that the 30-min incubation is over, the neutrophils have been counted and are ready for the bacteria-killing assay. Try to synchronize the end of this 30-min incubation with the completion of the post-transmigration neutrophil count (step 51).\nThe bacteria are opsonized and are also allowed to equilibrate to a medium that is more similar to that of the killing assay.\nDilute 15 μL of bacteria in 3 mL of RPMI + 10% FBS warmed to 37°C (1.2 ∗ 105 CFU/60 μL).\nAdd 60 μL of bacteria (1.2∗105 CFU to 120 μL of neutrophils, equivalent to 1.2∗105 cells) for a multiplicity of infection of 1.\nFor different MOIs, adjust the ratio of bacteria and/or cells.\nAs a control, make bacteria only (without neutrophils) tube. Add 60 μL of bacteria to 120 μL of RPMI.\nThe use of standard 1.7 mL snap-cap tubes is appropriate for this. Make sure that the tubes will fit into the rotator and will not open during the incubation period.\nRotate end-over-end at 37°C + 5% CO2 for 1 h (Figure 3[href=https://www.wicell.org#fig3]B).\nWhile the incubation is proceeding, prepare a 96-well plate for serial dilutions.\nPipette 10 μL of 1% w/v Triton X-100 (1 g/100 mL) into Row A.\nThe Triton X-100 will be at a final concentration of 0.1% w/v and will be used to lyse the neutrophils, but P. aeruginosa is resistant. Other bacteria or conditions may require different lysing conditions.\nPipette 180 μL of 1× PBS into rows B through G.\nLabel LB agar plates.",
    "Pipette 90 μL from the bacteria-killing reaction into a well of row A. Pipette up and down to mix and lyse the neutrophils to release intracellular bacteria.\nOptional: (1) To quantify the number of bacteria in the extracellular fluid compared to bacteria that are now intracellular spin the cells at 100 × g for 7 min to pellet the neutrophils, but not the bacteria.\nOptional: (2) After centrifuging, to quantify the number of bacteria that are only associated with the neutrophils but not intracellular, incubate the pelleted neutrophils (from optional 1) in 100 μL of Accutase and incubate at 37°C + 5% CO2 for 5 min. Neutralize by adding 400 μL of DMEM + 10% FBS. Spin at 100 × g for 7 min to pellet the neutrophils, but not the bacteria. We have observed that using trypsin results in significant neutrophil cell death.\nUsing a multichannel pipette transfer 20 μL of sample from Row A into Row B. Mix up and down to evenly distribute the bacteria. Repeat 10× serial dilutions.\nWe have found that using an electronic pipette that can automate some of the serial dilutions or multiple pipetting steps reduces hand strain and increases efficiency.\nUsing a multichannel pipette, spot 5 μL of each dilution onto a LB plate.\nWe have observed that 5–6 replicates of 6 dilutions can fit on an entire 10 cm LB plate (Figure 3[href=https://www.wicell.org#fig3]C).\nFor more information on spotting of bacteria for quantification, refer to (Thomas et al., 2015[href=https://www.wicell.org#bib9]).\nLeave the plates exposed to air, but covered or in a sterile hood, for 10 min to allow the spots to dry. Make sure the plates are flat so that multiple spots do not mix.\nIt may be helpful to first dry the plates in an oven to further minimize the spreading.",
    "Place the lid on the plates and grow inverted at 30°C for 12–16 h.\nWe have observed odd colony morphology when growing PA01 at 37°C. The lower temperature for growth seems to give a more defined morphology that is easier to count (See troubleshooting 8[href=https://www.wicell.org#sec6.15]).\nWhen colonies are easily observable, but are not overgrown, count and record the number of colony-forming units (CFUs) in each spot. Refer to quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis] for how to quantify the total number of bacteria as well as calculate bacteria killing efficiency (Figure 3[href=https://www.wicell.org#fig3]D)."
  ],
  "subjectAreas": [
    "Cell Culture",
    "Cell-Based Assays",
    "Cell Isolation",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology"
  ]
}