{
  "id": 17253,
  "origin_website": "Jove",
  "title": "Investigating the Protective Effects of Platycodin D on Non-Alcoholic Fatty Liver Disease in a Palmitic Acid-Induced In Vitro Model",
  "procedures": [
    "AML-12 cells (a normal mouse hepatocyte cell line) are used for the cell-based studies. The cells are obtained from a commercial source (see Table of Materials).\n1. Pretreatment of the AML-12 cells to model NAFLD  in vitro\nMaintain the cells in normal cell culture media (DMEM plus Ham's F12 [1:1] containing 0.005 mg/mL insulin, 5 ng/mL selenium, 0.005 mg/mL transferrin, 40 ng/mL dexamethasone, and 10% fetal bovine serum [FBS], see Table of Materials) at 37 °C in a humidified atmosphere with 5% CO2.\nSeed the cells in 12-well plates (1 mL/well) with a density of 2.8 x 105 cells/well.\n\tNOTE: All the cell digestion and medium exchange operations are performed in a biosafety cabinet to avoid contaminating the cells.\nRemove the culture medium of the cells after the overnight incubation (~10 h), and then wash the cells two times with 1 mL of serum-free media (per well).\nDivide the 12-well cell plate into four different treatment groups from left to right, including (1) the control group, (2) the PD-treated group, (3) the PA-treated group, and (4) the PA + PD-treated group.\n\tNOTE: Three replicates of each experimental treatment group are arranged from top to bottom on the same 12-well cell plate.\nAdd the normal cell culture media (1 mL/well) to the control group and the PD-treated group, and add the normal cell culture media (1 mL/well) supplemented with 300 µM of PA to the PA-treated and PA + PD-treated group.\nRemove the culture medium of the cells after 24 h of incubation, and then wash the cells with 1 mL of serum-free media (per well) two times.",
    "Add normal cell culture media (1 mL/well) supplemented with a vehicle (dimethyl sulfoxide, DMSO, 0.1% v/v) to the control group; add normal cell culture media (1 mL/well) supplemented with 1 µM PD to the PD-treated group; add normal cell culture media (1 mL/well) supplemented with 300 µM PA to the PA-treated group; add normal cell culture media (1 mL/well) supplemented with 300 µM PA and 1 µM PD to the PA + PD-treated group.\nAfter incubation for an additional 24 h, investigate the protective effects of PD on cells using 2′,7′-dichloro-dihydro-fluorescein diacetate (DCFH-DA) staining (step 2), JC-1 staining (step 3), and western blotting (step 4).\n\t​NOTE: All the incubation operations are done at 37 °C in a humidified atmosphere with 5% CO2.\n2. Measurement of the change in ROS production\nNOTE: The intracellular ROS levels in the cells are assessed based on the DCFH-DA staining assay.\nAt the end of the treatment period (step 1.8), wash the cells with 1 mL of phosphate-buffered saline per well (1x PBS, pH 7.4) three times, and then stain the cells with 100 µL of 10 µM DCFH-DA per well (see Table of Materials). Incubate the cells in the dark for 30 min.\n\tNOTE: If no obvious green fluorescence is observed after 30 min of incubation, the incubation time of the probe and cells can be appropriately increased (30-60 min). If overexposure of the green fluorescence value is observed after 30 min of incubation, the incubation time of the probe and cells can be appropriately reduced (15-30 min).\nWash the cells with 1x PBS (1 mL/well) three times. Add 1 mL of 1x PBS to each well.\nPlace the 12-well plate on the microscope stage (see Table of Materials), and then use a 20x objective to observe the morphology of the cells (magnification: 200x).",
    "Capture three representative fluorescence images (magnification: 200x) for each well on the fluorescence microscope using the green fluorescent channel with an excitation wavelength of 480 nm and an emission wavelength of 530 nm.\n\tNOTE: The green fluorescent channel with an excitation wavelength of 480 nm and an emission wavelength of 530 nm is recommended to detect the DCFH-DA. Additionally, DCFH-DA can be detected with the parameter settings for GFP and FITC in the fluorescence microscope35,36.\nFinally, process the images with image-acquisition software (see Table of Materials), and then use ImageJ software to calculate the mean fluorescence intensity of each group or the ratios of the different groups.\n\t​NOTE: The technical details of the fluorescence microscope and Image J software used for the imaging work have been described previously37,38.\n3. Measurement of the change in mitochondrial membrane potential\nNOTE: The changes in mitochondrial membrane potential are monitored by the JC-1 staining assay.\nAt the end of the treatment period (step 1.8), wash the cells with 1 mL of 1x PBS per well three times, and then stain the cells with 100 µL of 5 µg/mL JC-1 working solution (see Table of Materials) for 30 min at 37 °C in the dark.\n\tNOTE: If no obvious green fluorescence is observed after 30 min of incubation, the incubation time of the probe and cells can be appropriately increased (30-60 min). If overexposure of the green fluorescence value is observed after 30 min of incubation, the incubation time of the probe and cells can be appropriately reduced (15-30 min).\nWash the cells with 1x PBS (1 mL/well) three times. Add 1 mL of 1x PBS to each well.\nPlace the 12-well plate on the microscope stage, and then use a 20x objective to observe the morphology of the cells (magnification: 200x).",
    "Capture three representative fluorescence images (magnification: 200x) for each well on the fluorescence microscope using the green fluorescent channel with excitation and emission wavelengths of 485 nm and 535 nm, respectively, and the red fluorescent channel with excitation and emission wavelengths of 550 nm and 600 nm, respectively.\n\tNOTE: The green fluorescent channel with an excitation wavelength of 485 nm and an emission wavelength of 535 nm is used to detect the JC-1 monomer, which is treated as depolarized mitochondria39,40,41, and the red fluorescent channel with an excitation wavelength of 550 nm and an emission wavelength of 600 nm is used to detect the JC-1 dimer, which is treated as polarized mitochondria39,40,41.\nFinally, process the images with image-acquisition software, and then use Image J software to calculate the mean fluorescence intensity of each group or the ratios of the different groups.\n\t​NOTE: The technical details of the fluorescence microscope and Image J software used for the imaging work have been described previously37,38.\n4. Measurement of the protein expression levels of LC3-II/LC3-I and p62/SQSTM1\nAfter treatment (step 1.8), wash the cells three times with 1x PBS (1 mL/well) that has been precooled at 4 °C.\nAdd RIPA lysis buffer (100 µL/well) supplemented with protease and a phosphatase inhibitor cocktail (1x) (see Table of Materials) to the 12-well plate, and lyse on ice for 5 min.\nCollect the cell lysate into 1.5 mL microcentrifuge tubes, and centrifuge at 12,000 x g for 20 min at 4 °C. Determine the protein concentration of the supernatants by the BCA method following the standard procedures42.\nAdd SDS-PAGE sample loading buffer (5x, see Table of Materials) to the cell lysate supernatants (volume ratio = 1:4).",
    "Mix by vortexing (at high speed for ~15 s), and heat the mixed samples at 100 °C for 5 min to denature the protein.\nPut the 12-well-prepared 12% SDS-PAGE gel into the electrophoresis tank, and then add the SDS up-sample buffer (1x) diluted with ultra-pure water to the height limit position.\n\tNOTE: The SDS-PAGE gel is prepared using a commercial kit (see Table of Materials) according to the manufacturer's instructions.\nAdd the protein marker (5 µL/well) and samples (20 µg/well) into different wells of the SDS-PAGE gel.\nSet the stable voltage mode at 100 V, and perform the electrophoresis for 80 min.\nAfter the SDS-PAGE electrophoresis, carry out the electrotransfer of the proteins to a polyvinylidene fluoride (PVDF) membrane (0.45 µM, see Table of Materials) following previously published reports43,44.\nAfter the electrotransfer of the proteins, wash the PVDF membrane with 10 mL of TBST (1x TBS, 0.1% Tween 20) two times (5 min/time) in a shaker at room temperature.\nBlock the PVDF membrane with 5 mL of bovine serum albumin (BSA, 5%) in a shaker at room temperature for 1 h.\nWash the PVDF membrane with 10 mL of TBST three times (10 min/time). Then, incubate the PVDF membrane in 5 mL of the specific primary antibodies diluted in blocking buffer for LC3 (mouse mAb, 1:2,000), p62/SQSTM1 (hereafter referred to as p62, mouse mAb, 1:2,000), and β-actin (mouse mAb, 1:2,000) (see Table of Materials) overnight at 4 °C.\nWash the PVDF membrane with 10 mL of TBST three times (10 min/time) at room temperature. Then, incubate the PVDF membrane with rabbit anti-mouse IgG (HRP) secondary antibody diluted in blocking buffer (1:10,000) (see Table of Materials) at room temperature and sheltered from light for 2 h.",
    "Wash the PVDF membrane with 10 mL of TBST three times (10 min/time) at room temperature. Then, place the PVDF membrane on the plastic wrap, add an appropriate amount of ECL working solution (200 µL/membrane) (see Table of Materials), and incubate for 2 min.\nAfter incubation, remove the ECL working solution, and expose the PVDF membrane in the imaging system for image development. Finally, use the Image J software to analyze the gray values of each band.\n\t​NOTE: The technical details of the western blotting and Image J software used for the imaging work have been described previously45,46.\n5. Statistical analysis\nPresent the data from the experiments as the mean ± standard deviation (SD).\nPerform the analysis of significance with the statistical software tool described previously47.\nCalculate the statistical differences between the two groups using a t-test. A P-value below 0.05 is considered statistically significant: *P < 0.05, **P < 0.01, ***P < 0.005.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}