{
  "id": 7672,
  "origin_website": "Bio",
  "title": "Preparation of a Single-cell Suspension from <em>Drosophila</em> Wing Imaginal Discs",
  "procedures": [
    "Dissection Prepare 1,000 µL of S2 medium for each 1.5 mL low retention microcentrifuge tube. Keep the tubes on ice.Transfer wandering third instar larvae from the inside wall of fly culturing bottles into a 60 mm Petri dish with #3 forceps, and wash them five times with 5 mL of 1× PBS, until all residual food is removed.Using #3 forceps, transfer ~10–20 clean larvae into one depression plate spot filled with 1.5 mL of fresh cold 1× PBS.Use a pair of #5 forceps to dissect out the imaginal discs (wing and haltere discs) from the larvae in cold 1× PBS.Note: Video- or image-based descriptions of imaginal disc dissection procedures can be found elsewhere (Morimoto and Tamori, 2017; Purves and Brachmann, 2007; Witte et al., 2021). Use #5 forceps to gently transfer the dissected discs into another well of the same depression plate filled with cold 1× PBS.Each time, collect ~10 pairs of dissected imaginal discs in the depression plate before continuing to the next step.Cut a P20 micropipette tip with scissors, and then coat it by pipetting the remaining carcasses several times up and down.Wash the coated tip by pipetting fresh cold 1× PBS several times up and down before usage.Use the coated P20 micropipette tip to transfer the dissected imaginal discs from the depression plate into the 1.5 mL low retention microcentrifuge tube with cold S2 medium. Discard the remaining carcasses.Notes:  The coating procedure is critical to prevent sticking and loss of dissected tissue during transfer. The use of a P20 micropipette minimizes the transfer of excess 1× PBS into S2 medium, limiting unwanted dilution. Imaginal discs can be kept in ice-cold S2 medium for up to 4 h before tissue dissociation begins. In total, collect ~100–200 pairs of discs in each 1.",
    "5 mL low retention microcentrifuge tube before tissue dissociation. Cell Dissociation Allow the imaginal discs to settle to the bottom of the microcentrifuge tube by gravity, and then remove the S2 medium using a P1000 pipette.Add 1,000 μL of non-enzymatic cell dissociation solution, and gently wash the imaginal discs by inverting the microcentrifuge tube.Allow the imaginal discs to settle to the bottom of the microcentrifuge tube, and then remove the non-enzymatic cell dissociation solution using a P1000 pipette.Repeat Steps B2 and B3, and wash the imaginal discs three times. In the final round of washing, remove as much solution as possible.Add 1,000 μL of elastase cell dissociation solution into the microcentrifuge tube.Add a clean magnetic micro stir bar into the microcentrifuge tube. Close the cap and invert the tube, to allow the stir bar to sink to the cap.Place the inverted microcentrifuge tube in the center of a magnetic stirrer. Increase the stirring speed slowly to avoid spinout.Incubate the imaginal discs with elastase cell dissociation solution in the magnetic stirrer at room temperature for 20–30 min.While waiting, pre-wash P1250 micropipette tips and 3 mL syringes with 21G and 25G needles, by passing S2 medium through the tips or needles ten times.Add 500 μL of S2 medium to the elastase cell dissociation solution and, using a pre-washed P1250 tip, gently pipette the solution up and down twenty times.Gently pass the solution through the pre-washed 21G needle ten times, then through the 25G needle another ten times. Avoid creating bubbles when passing the solution through the needles.Pre-wet a 35 µm cell strainer cap and its attached falcon tube with 500 µL of S2 medium. Discard the S2 medium flow-through.",
    "Transfer the total 1,500 μL solution containing dissociated cells with a pre-washed P1250 tip and filter the solution through the wet cell strainer cap into the falcon tube. Continue tapping the tube until all of the solution goes through the strainer cap.Wash the microcentrifuge tube with 500 μL of S2 medium and filter the solution through the cell strainer cap into the same falcon tube (total 2,000 μL).Add the desired fluorescent dye (e.g., propidium iodide) and keep the tube on ice until FACS.Note: ~100–200 pairs of imaginal discs (wing and haltere discs) can yield 5 × 106–10 × 106 dissociated cells at a concentration of 2 × 106–5 × 106 per mL, with a viability of ~90%. Figure 1 shows representative images of dissociated imaginal disc cells before and after cell sorting. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220818/20220818180515_1308.jpgFigure 1. Images of dissociated imaginal disc cells before and after cell sorting. Dissociated wing disc cells from late third instar larvae carrying ptc-gal4 and UAS-mCD8GFP. (A) GFP positive and negative cells before FACS. (B) GFP-positive cells after FACS. (C) Zoomed view of post-FACS sorted GFP positive cells. Hoechst 33342 (blue) is used to visualize the entire cell population. Scale bars: 50 μm."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}