{
  "id": 3191,
  "origin_website": "Cell",
  "title": "RNA extraction protocol from low-biomass bacterial Nitrosomonas europaea and Nitrobacter winogradskyi cultures for whole transcriptome studies",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nSample harvesting\nNote: Each title refers to a step in the graphical abstract\nTiming: 10 min\nThe purpose of this step is to remove the growth medium and maximally gather the bacterial biomass in a pellet for further treatment.\nTransfer your sample volume to a 15 mL conical tube on ice and pellet cells by centrifugation at 11,000 g for 5 min at 4°C. Remove the supernatant by pipetting while avoiding disturbing the pellet.\nCritical: Keep your samples on ice in between centrifugation steps and before proceeding to step 2.\nNote: The volume from which biomass is collected depends on the amount of RNA required and the volume that is available. For optimization of this protocol, 5 mL of bacterial culture grown in synthetic urine salts solution (SUSS) medium (defined in Verbeelen et al., 20221[href=https://www.wicell.org#bib1]) yielded on average 65.89 ± 241.66 ng (OD600 = 0.037, 3.54 ± 0.50 ng × 10-6 cells) and 330 ± 60 ng (OD600 = 0.037, 1.01 ± 0.27 ng × 10-6 cells) for N. europaea and N. winogradskyi, respectively.1[href=https://www.wicell.org#bib1]\nNote: Pelleting low-biomass samples can be difficult in larger conical tubes since pellets will not always be visible or are more stretched out, complicating downstream resuspension of the pellet. A potential solution is to harvest cells in a stepwise manner by centrifuging a smaller volume in an RNase-free 1.5 mL Eppendorf tube and removing the supernatant. Repeat this step until the total desired sample volume has been harvested. Keep the Eppendorf tubes on ice in between steps. Using this method, your sample collection step timing will increase to 45 min.\nCell lysis\nTiming: 20 min\nThis step describes the treatment of the bacterial cell pellet with a lysozyme solution to ensure optimal cell lysis before initiating RNA extraction.",
    "Resuspend the cell pellets in 200 μL of the 1 mg/mL lysozyme solution.\nResuspend the pellet by rigorous vortexing.\nIncubate the resuspended samples at 37°C for 15 min on a heat block.\nRNA extraction\nTiming: 1 h 30 min\nThis step describes the RNA extraction from lysed cells in which cell debris, proteins, DNA and other contaminants are removed and pure RNA is retained. The commercial NucleoSpin RNA XS extraction kit is used with modifications to the manufacturer’s instructions[href=https://www.mn-net.com/media/pdf/d3/17/17/Flyer-NucleoSpin-RNA-Plus-XS-EN.pdf].\nAdd 200 μL of RA1 buffer with 4 μL TCEP to the sample, mix by vortexing.\nCritical: Do not work on ice during this step. The lysis buffer RA1 tends to increase in viscosity at cold temperatures, which could have (though unconfirmed) a negative effect on the yield or quality of your RNA sample.\nNote: This step differs from the procedure described in the manufacturer's instructions[href=https://www.mn-net.com/media/pdf/d3/17/17/Flyer-NucleoSpin-RNA-Plus-XS-EN.pdf].\nNote: The subsequent step of the addition of 5 μL RNA carrier working solution as described in the manufacturer's instructions[href=https://www.mn-net.com/media/pdf/d3/17/17/Flyer-NucleoSpin-RNA-Plus-XS-EN.pdf] should be skipped if samples will be used for downstream RNA-Seq (this is also noted in the manufacturer's instructions[href=https://www.mn-net.com/media/pdf/d3/17/17/Flyer-NucleoSpin-RNA-Plus-XS-EN.pdf]).\nPlace a NucleoSpin Filter (violet ring) in a collection tube and add the sample to the column, centrifuge for 30 s at 11,000 g.\nAdd 200 μL of a 70% ethanol solution to the sample, mix by pipetting up and down.\nLoad the sample on a NucleoSpin RNA XS column and centrifuge for 30 s at 11,000 g.\nPlace the column on a new collection tube.\nAdd 100 μL MDB and centrifuge for 30 s at 11,000 g.\nrDNase treatment\nPrepare rDNase master mix: Add 27 μL of reaction buffer and 3 μL of rDNase per sample to an RNase-free Eppendorf tube. Mix the solution by flicking the tube.",
    "Apply 25 μL of the rDNase master mix directly on the center of the column and incubate for 15 min at 20°C–25°C.\nWash & dry silica membrane\nAdd 100 μL of RA2 buffer to the column, incubate for 2 min at 20°C–25°C. Centrifuge for 30 s at 11,000 g.\nPlace column in a new collection tube.\nAdd 400 μL of RA3 buffer to the column and centrifuge for 30 s at 11,000 g, discard flowthrough in the tube.\nAdd 200 μL of RA3 buffer to the column and centrifuge for 2 min at 11,000 g.\nNote: After this step, the column should be dry. If any residual fluid is observed at the top of the column, centrifuge the sample until all liquid has passed through the column and the column is dry.\nElution of RNA.\nPlace the column in an RNase-free Eppendorf tube.\nElute the column with 15 μL RNase-free H2O and centrifuge for 30 s at 11,000 g at 4°C.\nCritical: Keep samples on ice beyond this point. RNA in solution is prone to deterioration, mainly due to the presence of contaminating RNases. RNase activity is minimized by low temperatures.\nRepeat the previous step.\nNote: Elution volume and amount of elution steps may vary. Multiple elution steps typically maximize the amount of RNA that can be eluted from the column. More than 30 μL of RNase-free H2O could be used if a less concentrated RNA sample is required. Vice versa, using less than 30 μL of RNase-free H2O for elution will result in a more concentrated sample The recommended volume range according to the manufacturer's instructions[href=https://www.mn-net.com/media/pdf/d3/17/17/Flyer-NucleoSpin-RNA-Plus-XS-EN.pdf] is 5–30 μL.\nRNA integrity evaluation\nTiming: 1 h",
    "The quality of your RNA samples needs to be evaluated before they are used for any downstream applications such as RNA-Seq. The quality of the data will be affected by degraded RNA samples.\nDetermine RNA quality and concentration using an Agilent BioAnalyzer and the Agilent RNA 6000 Nano Kit, following the manufacturer’s instructions[href=https://www.mn-net.com/media/pdf/d3/17/17/Flyer-NucleoSpin-RNA-Plus-XS-EN.pdf], 1 μL of RNA sample will be sacrificed.\nNote: An RNA Integrity Number (RIN) value is provided by the Agilent BioAnalyzer software based on the electrophoresis patterns it has detected from analyzed RNA samples. The software determines a RIN-value between 1 and 10, where 1 signifies highly degraded RNA and 10 indicates completely intact RNA. Agilent BioAnalyzer establishes this score based on the 16S/23S rRNA peak ratio. When RNA is degraded, these peaks will be less pronounced compared to the other RNA signals. These RNA signals are also generally higher and represent shorter RNA strands generated by the breakdown of RNA molecules. Typically, an RNA sample with a RIN score ≥ 8 is suitable for RNA-Seq.2[href=https://www.wicell.org#bib2],3[href=https://www.wicell.org#bib3],4[href=https://www.wicell.org#bib4],5[href=https://www.wicell.org#bib5]\nStore RNA samples at −80°C."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Rnaseq",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}