{
  "id": 8293,
  "origin_website": "Bio",
  "title": "Chitinase Assay from Cultured Bone Marrow Derived Macrophages",
  "procedures": [
    "Cells to be analyzed.  We have used Bone Marrow-derived macrophages from C57BL/6 mice.   In brief, bone marrow is flushed from tibias and femurs of 6-8 week old mice with 10 ml complete DMEM/F12 supplemented with 20% L-cell supernatant (day 0).     Bone marrow cells are plated in non tissue culture treated 10 cm petri dishes ~10 ml cells per dish.  After 4 days, add 10 ml additional media.     Cells are harvested by gentle scraping on day 7.     Macrophages are plated at 50,000 cells/well in 96 well plates in cDMEM/F12 in 10% L-cell supernatant and allowed to rest for 3 days.   On day 10, media is changed to cDMEM/F12 without L-cell supernatant and rested overnight.     Cells are ready for use on day 11.     Aspirate media in each well from the culture plates, and add lysis buffer to each (50 μl for 96 well plate, and 200 μl for a 24 well plate).  Place the plate on the rocker for 15 min at room temperature.   Dilute an aliquot of 4-Methylumbelliferyl substrate stock solution 40-fold in assay buffer, such that the final concentration of the substrate is 0.5 mg/ml.  This will be termed the “working solution”.   Approximately 100 μl of working solution will be needed per sample.  Allow solution to equilibrate in 37 °C water bath.   For each form of chitinase being tested there is a unique substrate. Separate assay plates will needed for each substrate.     Prepare Methylumbelliferone standards by diluting the top Methylumbelliferone standard 1:100 (500 μg/ml), 1:1,000 (50 μg/ml), and 1:10,000 (5 μg/ml) in stop buffer.   For best resolution, add 2 μl top Methylumbelliferone standard to 198 μl of stop buffer for the 1:100 dilution, followed by a 1:10 dilution series.",
    "Samples will be diluted further in the assay plate to yield 1,000 ng, 500 ng, 100 ng, and 10 ng (Figure 1).     Load the standard wells in triplicate to the flat bottom black 96-well plate as demonstrated in Figure 1.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20131129/20131129020432_4580.jpg Figure 1. Plate set-up for chitinase assay.  Red wells indicate 4-Methylumbelliferone standards, Purple indicates the sample blank (Working Solution), Green represents the positive control, and blue wells indicate sample wells.   Dilute the chitinase positive control 1:200 in PBS to yield a final concentration of 1 μg/ml and load positive control wells with 10 μl chitinase and 90 μl working solution   Use 100 μl working solution as the sample blank    Add 90-99 μl working solution to each sample well in triplicate followed by 1-10 μl of each sample (samples are in lysis buffer)   The amount of sample used for this assay will need to be optimized.  Some samples may contain so much chitinase activity that the fluorescence will be saturated.  This will vary considerably depending on the amount of cells plated and the chitinase activity of those cells.     Wrap plate in foil and incubate at 37 °C for 30 min   Incubation time may also need to be optimized. Cell lysates with high chitinase activity can be incubated for as little as 15 min. Alternatively, samples may be incubated for up to 1 h.     Add 200 μl of stop buffer to each well to stop the reaction.   Fluorescence can be measured on a plate reader at an excitation of 360 nm and emission of 450 nm within 30 min.   Chitinase activity is calculated from the standard curve.  Alternatively, chitinase activity may be calculated  using the following equation: Units/mL= (Fluoresencesample – Fluoresenceblank) x 1.9 x 0.3 x Dilution Factor Fluoresence100 ng standard  x reaction time x sample Volume"
  ],
  "subjectAreas": [
    "Immunology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}