{
  "id": 9394,
  "origin_website": "Jove",
  "title": "Electrophysiological Recording in the Brain of Intact Adult Zebrafish",
  "procedures": [
    "All experimental procedures were conducted in strict accordance with the National Institutes of Health Guide for the Care and Use of Laboratory Animals and followed protocol #A2011 09-003, which was reviewed, approved, and overseen by the University of Georgia Institutional Animal Care and Use Committee.\n1. Equipment Setup\nPerfusion system for craniotomy\n\tImmobilization of the adult necessitates an intubation system to deliver dissolved oxygen to the fish.  A variety of systems can be utilized, but a simple gravity system consisting of a 60 ml syringe is used. Elevate the pressure head to a height that consistently yields a flow rate of ~1 ml/min. This syringe can be placed in series with the syringes that are then used for the electrophysiological perfusion system.\n\t\nObtain a single 60 ml Luer lock syringe tube and remove the plunger.\nSuspend the syringe approximately 8 in above the base of a ring-stand using a clamp.\nConnect a one-way stopcock to the end of the syringe. To the opposite end of the stopcock, connect a piece of tubing, 2 mm in diameter, which is long enough to extend to the intubation base.\nPerfusion system for electrophysiology\n\tFor electrophysiological experiments, it is often necessary to introduce a variety of compounds during the course of an experiment. A variety of systems are available, but a gravity system consisting of 60 ml syringes in series can be used. This setup allows for simple, serial introduction of solutions to be carried out by opening the corresponding stopcock.\n\t\nObtain two or more 60 ml Luer lock syringes and remove the plungers from each. One syringe is required to administer habitat water to the fish while each subsequent tube can be used to administer a variety of pharmacological compounds to the fish.",
    "Connect each syringe to a 3-way stopcock with a Luer connection.\nUse ⅛ in outer diameter (O.D.) tubing to connect the syringes in series with a male Luer lock on one end.\nSecure the device such that the pressure head is elevated to a height of 27 in above the base, or a height that consistently yields a flow rate of ~1 ml/min.\nIntubation cannula\n\tThe intubation cannula facilitates the introduction of fluid to the fish. This setup provides both flexibility and firmness to best position the cannula within the animal's mouth.\n\t\nUsing any general pair of scissors (e.g. Fiskars) or a razor blade, remove a 1.5 cm section from the wide end of a P-200 pipette tip.\nInsert a 6 cm x 1 mm piece of tubing into a reducing valve with a female Luer lock cap and silicone ferrule, i.e. a Tuohy Borst adapter, and insert this cannula into the modified pipette tip. Hold the pipette tip in position with the Luer lock using a short portion of ⅛ in diameter tubing.imgsrc://cloudfront.jove.com/files/ftp_upload/51065/51065fig1.jpg\nFigure 1\nIntubation base\n\tThis dish is used to hold the immobilized animal in a stable, upright position and to facilitate the removal of the fluid entering the animal through intubation. If this is not established correctly, pooling can occur, leading to intrusive vibrational signals in the electrophysiological recording.\n\t\nObtain the base dish of a 100 mm x 15 mm plastic Petri dish.\nUsing a soldering tool, melt a hole, 6 mm in diameter and 7.5 mm below the lip of the rim, into the side of the dish. Using the same tool, melt a hole, 10 mm in diameter and 11 mm below the lip of the dish ~74° counter-clockwise from the smaller hole. This hole will serve as the drainage hole.",
    "Insert a tube,1 cm in diameter, into the hole with the end lifted such that the end cannot be blocked. Then insert a P-200 Pipetteman tip into the small hole; this will serve as a dummy cannula.\nWith the Petri dish slightly elevated on the side of the larger hole, pour melted canning wax into the dish such that the cannula hole is just covered. The region will serve as a stop, allowing the cannula to be inserted ~3 mm into the mouth of the fish. This set up should be allowed to solidify.\nUsing a flame-heated metal edge, carve a channel to hold the fish so that the channel begins from the tip of the cannula and extends approximately 1-2 in.\n\t\t\nCaution must be taken to ensure that a continuous downward angle from the cannula area to the drainage port is formed. imgsrc://cloudfront.jove.com/files/ftp_upload/51065/51065fig2.jpg\nFigure 2\nPerfusion setup\nBefore beginning, flush the perfusion set-ups with habitat water, ensuring that all air bubbles are removed.\nAdd ~30 ml of 0.016% (630 μM) tricaine solution to the craniotomy perfusion setup and allow ~2 ml to run through tubing to ensure that tricaine will be delivered to the animal upon perfusion initiation. See step 2.2 for dilution.\nTo the main perfusion setup, add ~50 ml of habitat water to the first tube. Add any desired experimental compounds to each of the remaining tubes.\nPlace the cannula setup into the small hole of the intubation base.\nTwist a 1 in wide strip of 42 cm Kimwipe into a tight spiral and insert it into the drainage tube such that the Kimwipe extends on both ends. This tissue will serve as a wick to remove the perfused liquid and to prevent fluid buildup within the intubation base, which could interfere with electrophysiological recording.",
    "Insert one end of the tubing into the large hole of the Petri dish, allowing the lower end to extend into an inert dish that is large enough to collect all perfusion waste. This dish will serve as the outflow reservoir for the setup. Position the tissue so that one end will lie near the animal's abdomen region and the lower extension can drip into the dish.\nPlace this completed intubation base near the dissecting microscope. Connect the Luer lock of the cannula to the tricaine perfusion tubing.\nCapillary needle and electrodes\nObtain a primary electrode consisting of 2.5 in of 0.010 in silver wire and a secondary electrode which should be made up of 15 in of the same wire to ground the setup. For the secondary electrode, use a 15 in section of 0.010 in silver wire with a soldered tip, which allows it to fit in back of a head-stage.\n\t\t\nElectroplate the tips of both the primary and secondary silver wires with chloride ions.\nUsing a micropipette puller, pull a thin-walled, borosilicate capillary needle with a resistance of <15 mΩ.\n\t\t\t\nFill the capillary needle with 2-3 μl of 2 M potassium chloride, or enough to partially cover the chloride-coated tip of the silver wire.\nInsert the primary electrode into the capillary head and mount it in the electrode holder.\nMount the head-stage into a micromanipulator and then mount the secondary electrode into a second micromanipulator. With the setup, first position each electrode and then fit the soldered tip of the secondary electrode into the back of the head-stage.\n2. Preparation of Solutions, Perfusion System, and Electrophysiological Recording Equipment\nObtain 1 L of habitat water from aquarium of fish.\n0.016% T]tricaine methanesulfonate (tricaine) (50 ml of 630 μM)24.\n\t\nThaw an aliquot of 0.4% Tris-buffered tricaine, pH 7.2.",
    "Add 2.1 ml of 0.4% Tris-buffered tricaine to 47.9 ml of habitat water and mix.\nThaw stock concentration of desired water-soluble experimental compound (e.g. 300 mM pentylenetetrazol, a common chemoconvulsant).\nThaw out an aliquot of 1 μg/μl pancuronium bromide in Ringer's solution.\nFill both anesthetizing and experimental intubation systems with habitat water and drain at least enough to remove all bubbles from tubes. This must be done because bubbles obstruct fluid flow, leading to asphyxiation of the animal.\n\t\nCompletely drain the perfusion tubes that will hold drugs without allowing air into the connecting tubing.\nFill the anesthetizing tube with 0.016% (630 μM) tricaine solution and place any experimental compound(s) in additional tube(s) on experimental perfusion system.\n\t\t\nThe first tube of experimental perfusion should contain only habitat water.\nMoisten the small pore sponge with habitat water and place in an empty 60 mm x 15 mm Petri dish. This dish will be used to hold the fish while the anesthetic is injected.\n3. Craniotomy\nAdd enough of the 630 μM tricaine solution to a 15 x 60 mm petri dish to fill it about three-quarters of the way. Weigh the filled dish. This will be used to immobilize the animal so that further anesthesia can be injected intraperitoneally.\nImmerse the animal into the dish containing tricaine and weigh the dish again.\n\t\nSubtract the difference between the weights from steps 1 and 2 to obtain the weight of the fish.\nAllow the animal to remain in the tricaine solution until calm and most movement has ceased.\nUsing a pair of broad forceps, transfer the fish to the premoistened sponge and position it laterally. Transferring the fish by the tail works well for this process.\n\t\nPlace the sponge and fish under the dissecting microscope.",
    "With a Nanofil syringe containing a 34 G needle, measure out enough pancuronium bromide such that there is 1 μg/g of fish weight.\nUsing a popsicle stick along the dorsal side of the fish to hold it steady, administer the pancuronium bromide intraperitoneally using the Nanofil syringe.\nUsing the fine forceps, grab the fish by the lower jaw and quickly transfer the animal to the intubation base.\nPosition the animal so that it is dorsal-up on the wax form and such that the 1 mm cannula can be inserted into the mouth. Use the fine forceps to maneuver the fish and open the mouth around the cannula. Due to the makeup of the intubation tray, a stop was engineered into the base, allowing the cannula to be inserted 3 mm into the mouth of the fish.\n\t\nOnce in position, turn on the gravity-fed perfusion tube containing tricaine.\nCut a 3 cm2 section of Kimqipe tissue and wet it with habitat water.\n\t\nPlace the tissue over the animal to prevent desiccation. The Kimwipe section can also be positioned to aid in holding the animal dorsal-up.\nUnder the dissection microscope, use vanna spring scissors to remove ~2 mm2 section of the cranium covering the optic tectum. This area looks like a dark, bony plate that sits behind the eye.\n\timgsrc://cloudfront.jove.com/files/ftp_upload/51065/51065fig3.jpg\nFigure 3\nInsert one blade of the vanna scissors at the edge of the plate and push with enough force to penetrate the bone, without piercing the brain. Close the scissors to snip the bone.\nRemove the piece of bone.\nIf any blood is present, remove using the edge of a Kimwipe. Bleeding generally stops shortly after carrying out the craniotomy.\n4. Electrophysiology\nShut off the intubation stop-cock and quickly disconnect the Luer lock connecting the intubation base to the tricaine drip.",
    "Move the intact intubation setup to the electrophysiology microscope and connect to the perfusion system.\nTurn on the habitat water and perfuse at a rate of 1 ml/min for ~1 hr, in order to wash out the tricaine.\nUsing a micromanipulator under visual control, position the secondary electrode so that the electrode tip can be inserted into the animal's nostril or into the dip behind the upper jaw.\nInsert the primary electrode needle into the craniotomy opening. Insert the needle into the tissue, such that the tip is positioned fairly superficial within the optic tectum.\n\t\nIf the electrode is too deep, the electrical signal may be small.\nCollect and analyze the electrical difference recorded between the primary and secondary reference electrodes. This process will allow for extracellular recordings to be obtained.\n\t\nCollect the data in Gap-free mode at a 5 kHz sample rate, with a low pass filter of 0.1 kHz and a high pass filter of 1 Hz.\nDo not begin recording electrophysiological activity until habitat water has perfused for a minimum of 45 min.\nRecord a baseline of native activity for at least 15 min prior to the addition of experimental drugs. Begin perfusion with experimental drugs of choice and record for the desired amount of time. In healthy preparations, it is possible to record the neurological activity for 2-3 hr.\n5. Clean Up\nAt the end of the experiment, remove the electrodes from the cranium and nostril and remove the intubation setup.\n\t\nEuthanize the animal by drug overdose using tricaine in accordance with the accepted practices, as outlined by the American Veterinary Medical Association (AVMA) Guidelines for the Euthanasia of Animals (2013).",
    "Zebrafish to be euthanized should be placed in a tricaine solution at 200-500 mg/L. Fish are to be left in the solution for a minimum of 10 min after cessation of rhythmic opercular activity, after which they are subjected to a physical means of euthanasia (cervical transection) to ensure death.\nDisconnect the Luer lock connecting the intubation base to the perfusion setup. Collect any remaining liquid in the perfusion system for appropriate disposal.\n\t\nRun DI water through all tubes and collect for appropriate disposal, if hazardous.\nTo sanitize the perfusion system, run 70% ethanol through all tubes and collect for appropriate disposal.\n\t\nLeave the stopcocks for each tube in the open position to facilitate air drying.\nSoak the electrodes in 70% ethanol and allow to air dry.\nDispose of the capillary needle used for the primary electrode in a sharps container.\nDismantle the intubation setup and rinse all pieces with water.\n\t\nClean each piece with 70% ethanol and allow to air dry.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}