{
  "id": 7120,
  "origin_website": "Bio",
  "title": "Ecdysone Quantification from Whole Body Samples of <em>Drosophila melanogaster</em> Larvae",
  "procedures": [
    "Collecting developmentally synchronized larvaeCross approximately 200 parental virgin female Drosophila melanogaster and 150 parental males and maintain them on a fly medium sprinkled with instant dry yeast for 2 d at 25 °C.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3915/bioprotoc-11-03-3915-g001.jpgFigure 1. Schemes for precise staging. A. Morphological differences between late L2 and early L3 larvae. Comparing to L2 larvae, L3 larvae show 1) larger mouth hooks, 2) branched “finger-like” anterior spiracles, 3) thicker tracheae, and 4) larger orange-color posterior spiracles. In contrast, L2 larvae show 1) smaller mouth hooks, 2) “closed” anterior spiracles, 3) thinner tracheae, and yellow-color posterior spiracles. We mainly rely on the anterior spiracle morphology. B. Scheme of staging. At pre-staging, we collect only L2 larvae on new fly medium plates (pre-staging). Two hours later, we collect third instar larvae in food vials and put the rest of the L2 larvae in a new food plate for the next staging. If required, the larvae can be separated by sex, using either sex-specific genetic markers, such as paternally-inherited X or Y chromosome with a ubiquitous GFP marker that will only be expressed in males (for example see Testa et al., 2013), or using a transgenic sex lethal promoter to drive the expression of GFP in females only, or by assessing the presence or absence of visible gonad (the developing testes, Perry et al., 2014).To establish the larval cultures, allow the females to lay eggs for 2-4 h on 60 mm tissue culture plates filled with a cornmeal/molasses standard fly medium without any additional yeast at 25 °C. Standardize embryo density to 200 larvae/plate. Excess embryos can be either removed or transferred onto new larval culture plates with a small piece of fly medium to avoid damaging embryos.",
    "Due to the high numbers of larvae required for these assays, we recommend establishing a minimum of 4 larval culture plates (approximately 800 larvae) for every time point to be sampled.Incubate the larval cultures in an incubator at 25 °C and 60% relative humidity under constant light. Constant light conditions are preferred because ecdysone secretion is circadian gated.Once larvae develop to the end of the second instar (L2; in wildtype, generally 70-72 h after embryo collection), pour 20% sucrose solution (weight/volume) into the larval culture plates. This causes the larvae to float to the surface. We used the morphology of the anterior spiracles to distinguish between second and third instar larvae (Bodenstein, 1950, see also Figure 1A). Remove all third instar larvae and transfer second instar larvae onto a new larval culture plate using either Dumont #3 forceps or entomology forceps. We usually remove all L3 larvae from sucrose solution and transfer L2 larvae by double-checking one by one. This is necessary for pre-staging. (Figure 1B, see also Park et al., 2002, for details of morphological changes during ecdysis in D. melanogaster).Two hours after transferring second instar larvae, collect all newly-molted L3 larvae into vials and transfer L2 larvae onto another new plate. Raise these newly-molted L3 larvae in a standard plastic fly vial with a normal cornmeal/molasses medium (usually up to 30 larvae/vial) without any additional yeast until the desired developmental time. The time transferred on a new fly medium is set as 0 h after L3 ecdysis (AL3E, see also Figure 1B). If required, newly molted larvae can be separated by sex either by examining the larvae for the presence of visible gonad (the developing testes) or by using genetic markers like paternally-inherited X or Y chromosome that express GFP (only in males, as in Testa et al.",
    ", 2013) or a transgenic line that uses the sex lethal promoter to drive GFP expression (only in females, Perry et al., 2014).Repeat this process every two hours until enough larvae have been collected for your experiment. We flood each larval culture plate a maximum of five times, to avoid excess handling of the larvae.Standard preparation for ecdysone quantification (see also Figure 2)imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3915/bioprotoc-11-03-3915-g002.jpgFigure 2. A schematic procedure of standard (Procedure B) and sample (Procedure C) preparations Prepare a 10 µg/µl 20E stock solution in molecular biology or HPLC grade absolute ethanol.To check the accuracy of the stock solution concentration, dilute the stock solution to 1:200 in absolute ethanol, and measure optical density at 240 nm in a crystal cuvette. The extinction coefficient of 20E in absolute ethanol is 12,656.52 and the molecular weight of 20E is 480.6. Therefore, the formula will be:20E concentration (μg/μl) = (OD240) × (Dilution ratio; it will be 200 in this case) × 480.6/12,676.52Dilute the stock solution to be 1,000 pg/μl, and make a dilution series: 1,000, 500, 250, 125, 62.5, 31.25, 15.625, and 7.8125 pg/μl for the standard curve using absolute ethanol.Prepare standard solutions by taking 80 µl of the dilution series from Step B3, such that you obtain 80,000, 40,000, 20,000, 10,000, 5,000, 2,500, 1,250, 625 pg/tube respectively. We prepare two replicate tubes for each concentration (see Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3915/bioprotoc-11-03-3915-g003.jpgFigure 3. Standard curve for ecdysone quantification. Using this curve, we calculated ecdysone concentration as: Ecdysone (pg) = 68,473.88209 × e^(-70.40127 × OD405). R2 = 0.92.Evaporate ethanol completely using a Speedvac at room temperature simultaneously with Step C9. This typically takes 1-2 h. An additional 10 min may be necessary to completely remove all of the ethanol from the tubes. Pellets are usually invisible.",
    "Sample preparation for ecdysone quantification (see also Figure 2)At the desired time points, recover staged larvae from the fly medium using a 20% sucrose solution.Wash collected larvae twice in double-distilled water to remove any fly medium residuals and wash out sucrose solution. Exclude larvae that appear noticeably smaller or larger for their cohort at this step, as it is likely that these larvae have not been correctly staged.After drying larvae briefly on a small piece of paper towel for about a minute, weigh a group of larvae for one biological replicate together on an ultra-micro balance.Usually, 20-30 mg of larvae (50-60 larvae for the onset of the L3 and 35-40 larvae for 24 h after the molt to the L3) is sufficient for accurate ecdysone quantification.Place all weighed larvae in a 1.5 ml microcentrifuge tube, add three times the volume of absolute methanol (30 μl methanol for 10 mg larvae), and freeze them immediately on dry ice.Keep all samples at -80 °C until you are ready for ecdysone quantification (Parvy et al., 2005).When you are ready to begin ecdysone quantification, place all tubes on dry ice and homogenize frozen larvae carefully using disposable pestles and a cordless hand-pestle motor (VWR International).Centrifuge tubes at 4 °C at maximum speed for 5 min.Carefully transfer supernatant into new 1.5 ml microcentrifuge tubes. Repeat Steps C7 and C8 1-2 times until there is no visible precipitate.Evaporate methanol completely using a Speedvac at room temperature for 1-2 h. An additional 10 min of evaporation may be necessary for complete removal of methanol from all tubes. A small precipitate with lipid from the larval fat body should be visible.Ecdysone quantification by an enzyme immunoassay (EIA)Redissolve the pellets in 100 µl of EIA buffer.",
    "Use only 50 µl of these sample solutions for the assay, saving the remaining 50 µl of this solution. In case the ecdysone concentration of the sample is too high, this sample can be diluted between 2- and 10-fold to be in a range of standard curve.Set up a plate as outlined in the ecdysone EIA manufacturer’s instructions (Porcheron et al., 1989;  501390 [href=https://www.caymanchem.com/pdfs/<a class=] .pdf\">https://www.caymanchem.com/pdfs/ 501390  .pdf).Cover the plate with a piece of parafilm and incubate overnight at 4 °C with gentle agitation.Reconstitute Ellman’s reagent shortly before use.Empty the plate by turning it over. Rinse each well with 300 μl wash buffer. Repeat four more times.After the 5th wash, blot the plate on a few layers of clean paper towel to ensure any liquid will be removed completely.Add 200 μl of Ellman’s reagent to each 96 well. Make sure the plate is sealed with a piece of parafilm and covered by a piece of aluminum foil, as the Ellman’s reagent is light sensitive. Incubate the plate at room temperature with gentle agitation.Clean the bottom of the plate with 70% ethanol using paper towels.Read the plate at a wavelength of 405 nm. Read the plate several times (approximately every 10 min until 60 min have passed post-incubation) to ensure that you capture ideal color development, meaning all standard samples from Step B4 show yellowish color but the color is not yet fully saturated. Multiple readings are necessary because color development continues with time until eventually the color of all samples becomes saturated."
  ],
  "subjectAreas": [
    "Developmental Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}