{
  "id": 3808,
  "origin_website": "Cell",
  "title": "An RNA in situ hybridization protocol optimized for monocot tissue",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTissue preparation\nTiming: 5 days\nIn this section plant samples are harvested and prepared for sectioning. The goal of this step is to create fixed, cleared samples that are embedded in Paraplast.\nHarvesting and fixation\nNote: Perform the steps under a fume hood.\nAdd roughly 10 mL of PFA-Triton-X into a glass scintillation vial and keep on ice.\nAlternatives: Any other small container which allows the tissue to lie flat can be used.\nCut a piece of the leaf tissue from a healthy plant and directly after cutting, place it into the fixative.\nThe size of the segment is relevant for penetration of the fixative and clearing agents.\nOne dimension of the tissue has to be less than 1 mm which is the leaf thickness in this case. We recommend a size of (LxWxH) 1 cm x 1 cm x 1 mm.\nEach vial can carry up to 4 pieces of leaf tissue.\nPlace the scintillation vial on ice under a vacuum bell and pull a vacuum for 10 min.\nCarefully release the vacuum. Repeat the step two to five times until sinking of the tissue is observed.\nReplace with fresh fixative. Leave 12 to 14 h at 4°C.\nPause Point: The tissue may be stored in 70% or 100% ethanol for longer periods of time at 4°C.\nDehydration\nNote: Perform the steps on a rocker at 30 rpm.\nIncubate in 1× PBS for 1 h on ice.\nIncubate in 1× PBS for 1 h on ice.\nIncubate in 15% ethanol for 1 h on ice.\nIncubate in 30% ethanol for 1 h on ice.\nIncubate in 50% ethanol for 1 h on ice.\nIncubate in 70% ethanol for 1 h on ice.\nIncubate in 80% ethanol for 1.5 h on ice.",
    "Incubate in 90% ethanol for 1.5 h on ice.\nIncubate in 100% ethanol for 1.5 h on ice.\nIncubate in 100% ethanol for 12 to 14 h at 4°C.\nNote: The tissue should slowly de-stain and chlorophyll should be visible in the ethanol.\nPause Point: Dehydrated tissue may be stored in 100% ethanol at 4°C for 1 to 3 days.\nClearing\nNote: Perform the steps on a rocker under a fume hood. Details to Histo-Clear can be found in key resource table[href=https://www.wicell.org#key-resources-table].\nIncubate in 100% ethanol for 2 h at 22°C ± 2°C.\nIncubate in 25% Histo-Clear/75% EtOH for 1 h at 22°C ± 2°C .\nIncubate in 50% Histo-Clear/50% EtOH for 1 h at 22°C ± 2°C .\nIncubate in 75% Histo-Clear/25% EtOH for 1 h at 22°C ± 2°C .\nIncubate in 100% Histo-Clear for 1 h at 22°C ± 2°C .\nIncubate in 100% Histo-Clear for 1 h at 22°C ± 2°C .\nIncubate in 100% Histo-Clear for 1 h at 22°C ± 2°C .\nEmbedding and plate pouring\nCritical: Paraplast consists of paraffin wax (see key resource table[href=https://www.wicell.org#key-resources-table]), plastic polymers and DMSO. Paraplast solidifies between 56°C–57°C but can degrade above 62°C (Costa, 2018[href=https://www.wicell.org#bib2]). Be careful to not heat Paraplast higher than 60°C and avoid re-melting, if possible (Jackson, 1991[href=https://www.wicell.org#bib3]).\nAdd Paraplast chips by half of the vial and fill it up with Histo-Clear. Leave it 12 to 14 h at 60°C.\nAlso, place a 500 mL bottle fully filled with Paraplast chips to 60°C and leave it 12 to 14 h to melt.\nFor three days in a row replace the vial content with freshly molten Paraplast in the morning and evening and leave at 60°C in between.\nQuickly pour the complete contents of the scintillation vial into a plastic petri dish.",
    "The wax will solidify before the samples can be arranged. Move the dish to a hot plate (<60°C) and let the Paraplast melt completely.\nUsing preheated forceps, gently remove any air bubbles from above and underneath the plant tissue.\nArrange the sections in the petri dish with maximum distance between them (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/530-Fig1.jpg\nFigure 1. Sample mounting and sectioning\n(A) Embedded tissue in liquid Paraplast is poured into a petri dish, where a wax block is cut out after arranging and solidifying and mounted on a sample cartridge with fresh Paraplast as support structure.\n(B) The mounted wax block is trimmed into a trapezoidal prism shape using a razor blade.\n(C) Ribbons are produced by microtome sectioning the wax block, which is arranged with the long side touching the blade first. A good-looking ribbon is transferred to the surface of a water bath by detaching it from the blade also with a paint brush.\n(D) Three ribbons with the length of the slide height are aligned close to each other to fill as much of the slide as possible.\nRemove the dish from the hot plate and let the Paraplast solidify at 22°C ± 2°C for ∼1 h.\nNote: Solidified Paraplast easily breaks in an uncontrolled manner. Mark predetermined breaking points at the surface by scoring it with a razor blade (Figure 1[href=https://www.wicell.org#fig1]A).\nSectioning\nTiming: 2 days\nSample mounting\nNote: We prefer to mount the sample in two steps to make selecting the correct orientation of the final sections easier. The orientation is highly dependent on the experiment and should be considered carefully.\nWarp the petri dish to carefully loosen the solidified plate of wax out of the plastic. The sides can be separated from the dish by a razor blade.",
    "Cut out one single plant tissue as a wax block in a rectangular shape (Figure 1[href=https://www.wicell.org#fig1]A).\nIt is important not to cut directly at the tissue but to keep a surrounding wax layer of 2–5 mm.\nIn a separate dish, melt Paraplast on the hot plate (<60°C).\nNote: Molten Paraplast can be handled with disposable transfer pipets.\nPlace the wax block in the desired orientation on a sectioning cartridge and add molten Paraplast to the sample holder and onto the sample sides building surrounding support structure. The mount will be stronger if Paraplast is added to the back of the cartridge as well (Figure 1[href=https://www.wicell.org#fig1]A). The sample can also be poured into a mold, but we find it is easier to obtain the correct orientation with this method.\nLet the mounted sample harden at 22°C ± 2°C for ∼1 h.\nPause Point: Embedded tissue in petri dishes or on sample holders may be stored at 22°C ± 2°C for several years.\nMicrotome sectioning\nNote: Paraffin sectioning takes time and patience to learn. To prepare high quality sections, a calm state of mental clarity is essential.\nHeat the slide dryer and water bath to 37°C–42°C.\nPlace the mounted sample on ice until use.\nUse a razor blade to trim the sample before securing it to the microtome sample holder. A trapezoidal prism shape is best, with the long side striking the blade first; this will facilitate the formation of a continuous ribbon of sections for easy handling (Figure 1[href=https://www.wicell.org#fig1]B).\nUse the handwheel to bring the sample to the same height as the blade. Carefully position the blade as close as possible to the sample and fix the blade position.\nOrient the sample parallel to the blade with the setscrews (Figure 1[href=https://www.wicell.org#fig1]C).",
    "To remove the first layer of paraffin without any sample and to generate an even sample surface, trim it by choosing a cutting thickness of ∼60 μm.\nThick sections such as these will form rolls of Paraplast.\nTrimming can be stopped when the paraffin rolls have a uniform width at both sides.\nChange the operating mode from trimming to sectioning.\nSet a sectioning of 10 μm.\nCut Paraplast ribbons of your sample (Figure 1[href=https://www.wicell.org#fig1]C). Troubleshooting 1[href=https://www.wicell.org#sec6.1]\nThe ribbon should have the length of the slide width.\nThe number of sections per ribbon therefore depends on the single section thickness and changes with every sample (Figure 1[href=https://www.wicell.org#fig1]D).\nLoosen the ribbon from the blade by carefully detaching it with a paint brush (Figure 1[href=https://www.wicell.org#fig1]C).\nUse the paint brush to transfer the ribbon to the water surface. Troubleshooting 1[href=https://www.wicell.org#sec6.1].\nThis will flatten the section.\nIf the paraffin sticks to the brush, a graphite pencil tip can help to detach.\nNote: Use ProbeOn Plus slides if possible (see key resource table[href=https://www.wicell.org#key-resources-table]).\nHold the slide at the labeling end with one hand and dip it at an angle into the water bath. The slide should be nearly completely under water.\nUse the other hand to bring one section by the other to the slide with a paint brush. Arrange it with the brush on the water surface over the slide in the desired orientation and carefully lift the slide to fix there.\nContinue with all remaining ribbons.\nTry to move as many ribbons onto the slide as possible for maximal space usage (Figure 1[href=https://www.wicell.org#fig1]D).\nDrain off excess water with a Kim wipe from underneath the slide and place them on the slide dryer for 12 to 14 h.",
    "Pause Point: If slides are not immediately needed, they may be stored in a slide box for several weeks at 4°C.\nProbe preparation\nTiming: 7–10 days\nDepending on the probe design, probes are generated from either gDNA or cDNA. In general probes can be cloned from gDNA, which can be prepared using standard DNA extraction protocols. If probes target cDNA regions spanning introns or if specific probes targeting isoforms of a gene are necessary, it is recommended to clone probes from cDNA. In this section leaf RNA is extracted and reverse transcribed into cDNA. RNA sense and antisense probes are designed and produced. Here, this protocol differs from other protocols in that we recommend you generate several unique and specific probes for each gene.\nProbe design\nNote: For each gene two to three probes will be designed to cover different regions of the gene. The specification of those as antisense and sense probe will occur later during transcription.\nWe recommend designing three independent probes of approximately 100 bp each in the 5′-UTR, 3′-UTR, and in at least one other location (Figures 2[href=https://www.wicell.org#fig2]B and 2C).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/530-Fig2.jpg\nFigure 2. Probe design, cloning, and generation\n(A) Ligation of the gene of interest into the pJET1.2 vector using the CloneJet PCR cloning kit.\n(B) Schematic design of SP6-tagged probe template primers.\n(C) Schematic design of hybridization probes from three different regions of interest. One region is located in the 5′-UTR, one in the middle and one in the 3′-UTR.\n(D) Assembly of small and big probe template PCRs and their product purification from an agarose gel after agarose gel electrophoresis. GeneRuler 1 kb serves as DNA ladder.",
    "(E) After SP6 transcription over night the products of sense and antisense probes can be differentiated by their location of the tag. The removement of the remaining DNA from the DNA template is supervised by two agarose gel electrophoreses containing DNase un- and treated transcription product. GeneRuler 1 kb serves as DNA ladder.\n(F) The 5′-UTR, coding region, and 3′-UTR RNA probes can be mixed in equal amounts to generate sense and antisense probe mixes.\nAs a general point, it is important to consider whether there are multiple isoforms of your gene of interest, which should be aligned first to ensure that the probe binds to all transcripts, unless the purpose of the experiment is to target a specific isoform of a gene.\nIf there are many genes with high sequence homology to your gene of interest, the probe template regions must be carefully selected to avoid designing a non-specific probe, and this may limit the number of probes per gene if three unique 100 bp regions are not available.\nWe recommend using one sense probe for each antisense probe as a negative control, as these have identical GC content and length to the antisense probes, and may be required by journal editors or reviewers for publication. Alternatively, one could generate random sequence controls.\nRNA extraction for probe production\nAlternatives: The procedures for performing RNA extraction are included for completeness. We recommend this protocol, however, any established RNA extraction protocol can be used.\nCritical: Maintain RNAse-free conditions.\nCritical: Phenol and chloroform are toxic. Work under a fume hood and wear a lab coat, safety goggles and appropriate gloves.\nPrepare RNA buffer with 100 mM sodium acetate, 1 mM sodium-EDTA and 4% (w/v) SDS.",
    "Prepare acid (pH 4.7) phenol:chloroform:isoamylalcohol 25:24:1. This mixture must sit until fully cleared, which can take up to an hour.\nMix RNA buffer with phenol:chloroform:isoamylalcohol in 1:1 (v/v) ratio to prepare the RNA extraction solution.\nPlace a bottle of 8M LiCl and bottle of 80% ethanol at −20°C.\nCritical: Plant tissue must remain frozen. Pre-cool spatulas, mortar and pestles, and tubes with liquid nitrogen.\nCritical: Working with liquid nitrogen has to be performed carefully while wearing a lab coat, safety goggles and appropriate gloves.\nHomogenize plant tissue using mortar and pestle in liquid nitrogen. Transfer about 300 mg of powder to a pre-cooled 2 mL tube.\nAliquot 1.5 mL RNA extraction solution, add ground tissue powder, and vortex immediately.\nIncubate at 58°C (< 60°C) and vortex every few minutes during the 30 min incubation time.\nCritical: During the incubation chloroform evaporation may cause the tube to explode if heated above 58°C: handle with care and wear PPE.\nCentrifuge samples for 10 min at 14.000 × g and 22°C ± 2°C.\nTransfer the top phase to a new tube and add 950 μL phenol:chloroform:isoamylalcohol (pH 4.7). Vortex under a fume hood.\nCentrifuge samples for 5 min at 14.000 × g and 22°C ± 2°C.\nTransfer the top phase to a new tube and add 950 μL phenol:chloroform:isoamylalcohol (pH 4.7). Vortex under a fume hood.\nCentrifuge samples for 5 min at 14.000 × g and 22°C ± 2°C.\nCarefully transfer the top phase into a new 2 mL tube.\nCentrifuge samples for 5 min at 14.000 × g and 22°C ± 2°C.\nCarefully transfer the top phase into a new 2 mL tube and add 0.5 volumes of ice-cold 8M LiCl.\nLeave RNA at −20°C to precipitate for at least 2 h; 12 to 14 h results in better yield.",
    "Centrifuge samples for 15 min at 14.000 × g and 4°C.\nRemove the supernatant.\nAdd 1 mL of ice-cold 80% ethanol to the tube and invert; pellet becomes opaque.\nCentrifuge samples for 2 min at 14.000 × g and 22°C ± 2°C.\nRemove the supernatant.\nAdd 1 mL of ice-cold 80% ethanol to the tube and invert.\nCentrifuge samples for 2 min at 14.000 × g and 22°C ± 2°C.\nCarefully remove as much ethanol as possible and air dry the pellet under a sterile bench until the pellet edges become clear, but no longer than 5 min.\nDissolve the pellet in 20–40 μL RNA elution buffer.\nEither store RNA at −80°C, leave at 4°C for analysis or keep on ice for cDNA synthesis.\ncDNA synthesis and cloning\nSynthesize cDNA from your isolated RNA using the QuantiTect Reverse Transcription kit and its enclosed random hexamers primer mix (see key resource table[href=https://www.wicell.org#key-resources-table]).\nAmplify the gene of interest from cDNA with Takara PrimeSTAR GXL DNA Polymerase.\nLigate the PCR product into pJET1.2 following instructions of CloneJet PCR cloning kit (Figure 2[href=https://www.wicell.org#fig2]A).\nTransform chemically competent TOP10 cells with the ligation product and plate on carbenicillin selection plates.\nPerform a colony PCR with a standard Taq polymerase on at least 5 colonies.\nIsolate plasmids containing the gene of interest with the NucleoSpin Plasmid kit.\nSequence the pJET plasmids containing your gene of interest and continue with the protocol if results match expectations.\nTemplate PCR\nAmplify the regions of interest you selected using PrimeSTAR GXL DNA polymerase to generate a DNA template for RNA probe synthesis.\nPerform one small test probe template PCR (preliminary PCR) (1× 25 μL) in advance to verify that PCR settings are successful, and the reaction is specific (Figure 2[href=https://www.wicell.org#fig2]D).",
    "Perform two large (we recommend 5× 50 μL) probe template PCR reactions for each region of interest, one for the antisense and the other for the sense probe:\nFor the antisense probe: Perform a PCR with corresponding SP6-tagged primers on the reverse primer (Figure 2[href=https://www.wicell.org#fig2]B).\nFor the sense probe: Perform a PCR with corresponding SP6-tagged primers on the forward primer (Figure 2[href=https://www.wicell.org#fig2]B).\nIf several DNA fragments visible in the preliminary PCR:\nLoad total PCR product (5× 50 μL) onto a 1% agarose gel prepared with 1× TAE buffer. Separate DNA fragments at 100 V and 400 mA for 40 min (Figure 2[href=https://www.wicell.org#fig2]D).\nExcise the fragment of interest and purify with a dedicated NucleoSpin Gel and PCR Clean-up kit for RNAse-sensitive experiments.\nUse preheated (70˚C) RNAse-free water to elute and maintain RNAse free environment from this step forward.\nIf one DNA fragment visible in the preliminary PCR:\nPurify total PCR product (5× 50 μL) with NucleoSpin Gel and PCR Clean-up kit.\nUse preheated RNAse-free water to elute and maintain RNAse free environment from this step forward.\nSP6 transcription\nEstimate the dsDNA concentration of the purified probe template using a spectrophotometer.\nCalculate the final volume needed to reach a concentration of 500 ng/μL.\nPlace the open tube under a sterile bench and evaporate until the desired volume and concentration is reached. This can take up to several hours, depending on the initial concentration.\nPerform a transcription reaction using the concentrated probe template as described in the manual of the MEGAscript SP6 transcription kit, using DIG RNA Labeling Mix (1:3) with kit-supplied rNTPs (see key resource table[href=https://www.wicell.org#key-resources-table]). This reaction is performed 12 to 14 h at 37°C (Figure 2[href=https://www.wicell.org#fig2]E).",
    "Note: Do not use a heat block for this reaction, as the small reaction volume may result in complete evaporation and condensation on the lid within a 1 mL tube. Place the entire tube in a 37°C oven or chamber.\nProbe purification\nSave 0.2 μL in a separate tube to visualize on an agarose gel, then add 1 μL TURBO DNase (included in the MEGAscript SP6 transcription kit) to the remaining transcription RNA probe.\nIncubate for 20 min at 37°C.\nTo stop the DNA digestion, add 24.6 μL RNAse-free water and 0.4 μL 0.5 M EDTA. Incubate for 10 min at 75°C.\nAgain, save 0.2 μL of TURBO DNAsetreated RNA probe for agarose gel imaging.\nPerform a quick agarose gel electrophoresis with both samples: 1% agarose gel, 5 min, 100 V and 400 mA (Figure 2[href=https://www.wicell.org#fig2]E).\nFragments should appear as discrete bands of the expected size in both gels: if so, continue with purification. If not, repeat SP6 transcription. To purify, treat your sample with the following solutions:\n2 μL 2 mg/ml glycogen\n4 μL 10% acetic acid\n4 μL 3 M NaOAc\n96 μL 100% ethanol\nNote: It is possible that the RNA forms secondary and tertiary structures, preventing efficient migration through the gel. This is typically visualized by multiple bands or a smear above the expected discrete band.\nCentrifuge the reaction tube for 30 min at 20.000 × g and 4°C.\nCarefully remove the supernatant and wash the pellet with 70% ethanol in RNAse-free water at 22°C ± 2°C.\nDecant and dry pellet for 5 min under sterile hood.\nCritical: Handle formamide in a fume hood.\nResuspend the pellet in 25 μL RNAse-free 10 mM TE buffer pH 8 and 25 μL formamide.\nStore RNAse safe at −20°C.\nIn situ hybridization\nTiming: min 2 days",
    "In this step, your sectioned tissue is first pretreated to make it accessible for the RNA probes. Then the hybridization is performed and the detection process will be initiated. At the end of this step your sample will be ready to image.\nNote: It is paramount to maintain an RNAse-free environment. We recommend cleaning the bench, pipettes, tip boxes etc. with Rnase-ExitusPlus or other similar treatment. Wear gloves and change them frequently. Wear a dedicated lab coat that is only for RNA in situ hybridization. The solutions used in this step should be exclusively for RNA in situ hybridization. Most can be reused several times, except for the 100% ethanol, PFA, proteinase K buffer, PBS and Histoclear.\nNote: To treat the sections on the slides we recommend placing 18 or any other even number of the slides into the slide rack (see key resource table[href=https://www.wicell.org#key-resources-table]). Use empty, clean 1000 μL tip boxes, which fit the slide rack. Move the rack from box to box. Use a volume of solution that covers the slides completely: we recommend 300 mL. Incubations can be performed on an orbital shaker. The given incubation times are minimums, except for the proteinase K, which should not incubate longer than 10 min. Perform all steps at 22°C ± 2°C unless otherwise stated.\nDeparaffinization and rehydration\nIncubate in Histo-Clear for 10 min.\nIncubate in Histo-Clear for 10 min.\nIncubate in 100% ethanol for 30 s.\nIncubate in 100% ethanol for 30 s.\nIncubate in 90% ethanol for 30 s.\nIncubate in 80% ethanol for 30 s.\nIncubate in 70% ethanol for 30 s.\nIncubate in 50% ethanol for 30 s.\nIncubate in 30% ethanol for 30 s.\nIncubate in H2O for 30 s.\nIncubate in 1× PBS for 2 min.\nPermeabilization",
    "Add 30 μL proteinase K (20 mg/mL) to 300 mL pre-warmed proteinase K buffer.\nIncubate slides for 10 min in the proteinase K-containing buffer at 37˚C.\nIncubate in 0.2% glycine solution for 2 min.\nIncubate in 1× PBS for 2 min.\nRefixation\nIncubate in 4% PFA for 10 min.\nIncubate in 1× PBS for 2 min.\nAcetylation\nCritical: This is a unique but critical step for this in situ hybridization protocol. Acetylation reduces non-specific binding of the probe to the tissue and reduces background.\nIncubate in 0.1 M triethanolamine while dribbling 1.5 mL acetic anhydride over the slides.\nIf possible, suspend the slide rack above a stir bar and place its container on a stirring plate, so that the solutions can be constantly mixed.\nIncubate for 10 min.\nIncubate in 1× PBS for 2 min.\nDehydration\nIncubate in 30% ethanol for 30 s.\nIncubate in 50% ethanol for 30 s.\nIncubate in 70% ethanol for 30 s.\nIncubate in 80% ethanol for 30 s.\nIncubate in 90% ethanol for 30 s.\nIncubate in 100% ethanol for 1 min.\nIncubate in 100% ethanol for 2 min.\nPause Point: At this point it is possible to store the slides at 4°C for up to several days. Therefore, keep the slide rack in the tip box filled with a small amount of ethanol to cover the bottom and seal the box with Parafilm.\nHybridization\nNote: Decide on the probe concentration for the hybridization solution. For new probe, use multiple concentrations ranging from 0.5× to 2×.\nThaw the hybridization solution at 22°C ± 2°C, set an oven to 55°C, and a heat block to 98°C.\nCritical: Handle formamide in a fume hood.",
    "Thaw all RNA sense and antisense probes on ice and fill hybridization chamber (see key resource table[href=https://www.wicell.org#key-resources-table]) with 100 mL formamide and 100 mL H2O.\nRemove slides from ethanol by arranging them on a fresh paper towel. Place slide pairs next to each other, whereby a slide pair is considered to be two slides that will be treated with the same probe. If you have an uneven number of slides, use a HybriSlip Hybridization coverslip for the final slide. If you are not using ProbeOn Plus slides with which you can make ‘slide sandwiches’ because of the raised tabs, you will treat each slide individually and use flexible coverslips, instead.\nCritical: Handle formamide in a fume hood.\nWhen the probes are thawed, dilute the hybridization probes with formamide.\nMix equal volumes of the different probes for a given gene of interest (i.e., 5′-UTR antisense probe + central antisense probe +3′ antisense probe; Figure 2[href=https://www.wicell.org#fig2]F).\nFor a 1× concentrated probe mix: Add 1 μL of RNA probe mix to 50 μL 50% formamide in RNAse-free water for 1 slide pair.\nDenature the diluted probes for 3 min at 98°C. Immediately, place them on ice. Further dilute hybridization probes with hybridization solution.\nFor 1 slide pair: Add 200 μL of hybridization solution.\nPipette 220 μL of prepared hybridization probe on one slide of a slide pair\nLay one slide onto the other, sections facing each other, and make sure that no bubbles remain. Place the slide sandwich on the rubber-lined risers in the hybridization chamber. Avoid touching the slides, which could cause cross-contamination. It is also recommended to change the gloves between samples with different probes.",
    "Alternatives: If slide sandwiches are not feasible, add 200 μL of hybridization probe on a SuperFrost Ultra Plus GOLD Adhesion slide and cover it with a HybriSlip Hybridization coverslip.\nClose the lid of the hybridization chamber and seal with parafilm.\nCarefully place the chamber in the oven at 55°C.\nPlace a beaker filled with 500 mL H2O in the oven for 12 to 14 h to maintain humidity, as well as the prepared 0.2× SSC to pre-warm it.\nWashing\nSet incubator to 55°C.\n0.2× SSC can be microwaved to reach 55°C if not pre-warmed.\nCarefully, remove hybridization chamber from the oven.\nSeparate the slide pairs by dipping them into pre-warmed 0.2× SSC solution.\nAlternatives: If slide sandwiches are not feasible, remove the coverslip by dipping the slide into pre-warmed 0.2× SSC solution.\nPlace separated slides into the slide rack.\nPlace the slide rack into the slide container and fill it with pre-warmed 0.2× SSC solution.\nNote: Be careful not to pour SSC directly on the sections, but on the labeling end of the slide. Alternatively, remove the slides, add the SSC and replace the slides.\nPlace the slide container in the incubator and gently shake at 55°C for 1 h.\nReplace 0.2× SSC solution and incubate gently shaking at 55°C for 1 h.\nAgain, replace 0.2× SSC solution and incubate gently shaking at 55°C for 1 h.\nBlocking\nWash slides in 1× PBS on an orbital shaker for 5 min at 22°C ± 2°C.\nMove slides into a plastic box, where slides can be arranged facing up.\nIncubate slides with 50 mL block solution 1 on an orbital shaker for 45 min at 22°C ± 2°C.\nEnsure that the slides do not slide over each other to avoid damaging the sections.",
    "Remove block solution 1 from the slides using a serological pipette.\nIncubate slides with 50 mL BSA block solution 2 on an orbital shaker for 45 min at 22°C ± 2°C.\nAntibody\nPrepare the antibody solution before the incubation time is over. Dilute anti-Dig alkaline phosphatase conjugated antibody (see key resource table[href=https://www.wicell.org#key-resources-table]) 1:1250 in BSA block solution 2. Mix 4 μL antibody with 5 mL BSA block solution 2.\nRemove slides from the plastic box by arranging them on a fresh paper towel.\nPlace the slide pairs next to each other and fill the hybridization chamber with 200 mL H2O.\nPour the antibody dilution into a weigh boat and treat slides with antibody dilution (Figure 3[href=https://www.wicell.org#fig3]):\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/530-Fig3.jpg\nFigure 3. Handling of slide sandwiches\nMove the bottoms of two slides in the treatment solution against each other. Carefully bring the rest of the slides together until the tops are touching. The sections will be protected by spacers on ProbeOn Plus slides. The treatment solution will be wicked away by capillary forces.\nMake slide sandwiches with respective slide pairs with sections facing towards each other.\nPlace the short edge of the slide sandwich on a stack of paper towels to wick out any solution.\nIf all liquid is wicked away, dip the slide sandwich edge into the antibody solution to wick it away until all sections are covered.\nPress the slide sandwich edge to the paper towels to wick away the antibody dilution, and then dip slide sandwich edge into the antibody solution again, until all sections are covered and avoid bubbles.\nDry the outside of the slide sandwich with a paper towel and place it in the hybridization chamber.\nClose the lid and seal it with Parafilm.\nIncubate for 2 h at 22°C ± 2°C.",
    "Alternatives: If slide sandwiches are not feasible, add 200 μL of antibody dilution on a SuperFrost Ultra Plus GOLD Adhesion slide and cover it with a HybriSlip Hybridization coverslip.\nWashing\nMove the slides out of the hybridization chamber and separate them carefully.\nPlace single slides back into the plastic box to lay them tissue facing up. Place the box on an orbital shaker.\nWash slides with 50 mL BSA blocking solution 2 for 15 min at 22°C ± 2°C.\nWash slides with 50 mL BSA blocking solution 2 for 15 min at 22°C ± 2°C.\nWash slides with 50 mL BSA blocking solution 2 for 15 min at 22°C ± 2°C.\nWash slides with 50 mL BSA blocking solution 2 for 15 min at 22°C ± 2°C.\nWash slides with 50 mL buffer C for 15 min at 22°C ± 2°C.\nDetection\nNote: Though there are several possible detection methods for in situ hybridization, we find that the reaction of alkaline phosphatase with BCIP/NBT (see key resource table[href=https://www.wicell.org#key-resources-table]) gives a reproducible result for various genes on maize leaf sections. The detection reagent BCIP is hydrolyzed by alkaline phosphatase conjugated to the secondary antibody to form an intermediate leucoindigo compound, which is oxidized by NBT to form 5, 5′-dibromo-4,4′-dichloro indigo (BCI). NBT is reduced to insoluble purple diformazan (DF) and forms NBT-DF. The combination of NBT-DF and BCI results in a dark purple colored precipitate. The color of the stain may vary from blue to purple to brown.\nRemove slides from the plastic box. Arrange pairs next to each other on a fresh paper towel.\nFill the hybridization chamber with 200 mL H2O.\nAdd 50 μL NBT and 37.5 μL BCIP to 10 mL buffer C.\nPour the solution into a weigh boat and keep protected from bright light.",
    "Wick NBT-BCIP detection solution into the slide sandwiches as described for antibody treatment (Figure 3[href=https://www.wicell.org#fig3]).\nPlace them in the hybridization chamber, close the lid and seal it with Parafilm.\nIncubate slides with detection solution for several hours to 3 days.\nThe duration depends on several factors such as abundance of mRNA and probe quality, but the staining process can be checked periodically.\nTypically, in situ hybridization results are detectable as a purple precipitate after one night.\nAfter checking the staining progress of one slide, apply fresh detection solution if staining has not reached the desired intensity or after 24 h of staining.\nStop further incubation when purple precipitate can be observed but background noise is still low.\nNote: The detection step is light sensitive. Keep light exposure times as short as possible.\nNote: To stop the detection, an ethanol series is performed to reduce background staining. Notice that the stain is also slightly ethanol soluble and longer incubation periods will reduce the intensity of staining. This is particularly important for very faint signals, as the signal can be washed away by the ethanol steps.\nStop detection\nSeparate slide sandwiches by carefully placing them in water, allowing them to fall apart.\nPlace separated slides into the slide rack.\nIncubate in water for 3 min.\nIncubate in 30% ethanol for 30 s.\nIncubate in 50% ethanol for 30 s.\nIncubate in 70% ethanol for 30 s.\nIncubate in 80% ethanol for 30 s.\nIncubate in 90% ethanol for 30 s.\nIncubate in 100% ethanol for 30 s.\nIncubate in 100% ethanol for 30 s.\nIncubate in Histo-Clear for 5 min.\nIncubate in Histo-Clear for 5 min.\nCritical: To mount the slides, work under a fume hood and let your slides dry there, as well.\nMounting",
    "Move slides on a fresh paper towel. Troubleshooting 5[href=https://www.wicell.org#sec6.9]\nAdd a line of 120 μL Eukitt on the slide and cover it with a coverslip. Avoid bubbles.\nLet the mounting medium solidify for 12 to 14 h.\nImaging\nTiming: 1 h\nIn this section the slides will be observed under a light microscope. Purple precipitate will locate the mRNA of the gene of interest.\nMicroscopy\nObserve sections on a standard bright-field microscope. Troubleshooting 2[href=https://www.wicell.org#sec6.3], 3[href=https://www.wicell.org#sec6.5], and 4[href=https://www.wicell.org#sec6.7]\nFor bundle sheath cells of maize plants, a 20× magnification is optimal."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Sciences",
    "In Situ Hybridization"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Ecology & Environmental Biology"
  ]
}