{
  "id": 14975,
  "origin_website": "Jove",
  "title": "A Protocol to Evaluate and Quantify Retinal Pigmented Epithelium Pathologies in Mouse Models of Age-Related Macular Degeneration",
  "procedures": [
    "All procedures involving animal subjects have been approved by the Institutional Animal Care and Use Committee at the University of Wisconsin-Madison, and are in adherence with the Association for Research in Vision and Ophthalmology (ARVO) Statement for the Use of Animals in Ophthalmic and Vision Research.\n1. Evaluation of mouse RPE by light microscopy\nMake a fixative buffer that has a final concentration of 2% paraformaldehyde and 2% glutaraldehyde at room temperature (RT) in a glass bottle.\n\tNOTE: This protocol requires, at most, 14 mL of fixative buffer per mouse.\n\tCAUTION: Paraformaldehyde and glutaraldehyde are hazardous substances. Please follow the standard operating procedures when working with these substances.\nPrepare a gravity-feed perfusion system on an absorbent underpad for cardiac perfusion in a fume hood (Supplementary Figure 1A).\n\t\nPlace 40 mL of the fixative buffer into the syringe barrel of the perfusion system (Supplementary Figure 1B).\nTurn the valve until it is parallel with the tubing line to allow the buffer to flow through the tubing line (Supplementary Figure 1C). Flush the line with buffer until all air bubbles are removed from the line.\nTurn the valve until it is perpendicular to the tubing line to stop the buffer from flowing into the tubing line (Supplementary Figure 1D).\n\t\tNOTE: The perfusion system is now ready for use.\nEuthanize the mouse by placing it into a carbon dioxide (CO2) chamber and allow CO2 to flow into the chamber at a flow rate of 30% of the chamber volume per minute. Once the mouse stops breathing, allow CO2 to flow into the chamber for at least 1 min. Verify the mouse is dead before moving forward to the next step.\n\tNOTE: Euthanasia through injection of pharmacological agents can be used in this protocol as an alternative to CO2 inhalation.",
    "Perform cardiac perfusion on the euthanized mouse.\n\t\nTransfer the mouse to a shallow tray near the perfusion system with its abdomen facing up. Spray the abdomen with 70% ethanol (EtOH).\nMake four incisions to expose the abdominal cavity (Supplementary Figure 2A).\n\t\t\nCreate a 5 cm inferior cut using curved scissors and forceps through the skin and abdominal wall on the furthest left side of the mouse that is directly below the rib cage.\nProceed to make a 3 cm medial cut through the skin and abdominal wall of the mouse that begins at the top of the inferior cut.\nMake another 5 cm inferior cut at the end of the medial cut through the skin and abdominal wall on the furthest right side of the mouse directly below the rib cage.\nMake another 3 cm medial incision to remove the abdominal skin flap with curved forceps.\nCut through the diaphragm and sternum to expose the heart (Supplementary Figure 2B).\n\t\tNOTE: Be careful to avoid nicking the heart, arteries, and veins. Nicking these will lead to an inefficient cardiac perfusion.\nInsert the gauge needle into the left ventricle of the heart. Turn the valve until it is parallel with the tubing line. Cut the right atrium with curved scissors to allow blood and fixative to exit the heart (Supplementary Figure 2C).\nAllow 10 mL of fixative buffer to penetrate the mouse for at least 1-2 min, or until the liver becomes pale in color and no blood flows out of the right atrium. Once perfusion is complete, turn the valve until it is perpendicular to the tubing line to stop the flow of the buffer.\nEnucleate the eyes from the mouse after cardiac perfusion.",
    "Remove the mouse from the shallow tray and place the mouse on the absorbent underpad in a fume hood. Orient the head of the mouse such that the left eye is facing the experimenter and the right eye is out of view. Annotate the superior side of the eye with a tissue marking dye.\nGently push down with the thumb and index finger around the eye socket to cause protrusion of the eye from the eye socket (Supplementary Figure 3A).\nTake curved scissors and hold it with the blade at a 30° angle from the eye socket. Proceed to cut around the eye with the curved scissors at a 30° angle (Supplementary Figure 3B).\n\t\tNOTE: It is okay to cut excess tissue from the eye socket to preserve the integrity of the eyeball.\nRemove the eyeball from the head with curved forceps and place it on an absorbent underpad. Nick the cornea with a number 11 scalpel blade and place the eye with curved forceps into a 2 mL microtube with 2 mL of fixative buffer. Label the 2 mL microtube with mouse identification and 'left' to indicate the left eye.\n\t\tNOTE: The nick in the cornea allows for the fixative to readily penetrate the eye to better preserve it.\nRepeat steps 1.5.1-1.5.4 for right eye.\nAllow the eyes to incubate in fixative buffer overnight on a shaker in a 4 °Celsius (C) room, at a speed of 75 rotations per minute (rpm).\nReplace the fixative buffer with 2 mL of 1x phosphate buffer saline (PBS). Incubate the eyes in 1x PBS for 10 min on a shaker at RT and 75 rpm. Repeat this step twice.\nClean and dissect the eyes to generate posterior segments.",
    "NOTE: The posterior segment is the mouse eyeball with the neural retina, RPE, choroid, and sclera sans the cornea, iris, and lens.\n\t\nPlace eye into a Petri dish filled with 1x PBS under a dissecting microscope (Supplementary Figure 4A).\nGently lift any fat and muscle away from the eyeball with fine-tipped forceps. Carefully trim the fat and muscle with micro-dissecting scissors in a parallel direction to the eyeball until the eyeball has a uniform bluish-black color (Supplementary Figure 4B).\n\t\tNOTE: Do not cut in a perpendicular direction, as this damages the eyeball. Also, if the tissue marking dye comes off during processing, reannotate the superior side of the eyeball immediately.\nPlace fine-tipped forceps at the corneal puncture site. Cut around the perimeter of the cornea, beginning at the puncture site, with micro-dissecting scissors, to remove the cornea and iris from the eyeball (Supplementary Figure 4C).\nTake fine-tipped forceps and gently remove the lens from the eyeball to yield the posterior segment (Supplementary Figure 4D).\nPlace the posterior segment back into a 2 mL microtube with 2 mL of 1x PBS. Store the posterior segment in a 4 °C refrigerator.\n\t\tNOTE: Posterior segments can remain in 1x PBS at 4 °C for many weeks before further processing.\nRepeat steps 1.3-1.8 to prepare the eyes from other mice in the study.\nProcess and embed one of the posterior segments from each mouse in paraffin for sectioning. Make sure the superior side of the posterior segment is on top.\n\tNOTE: The authors rely on the University of Wisconsin-Madison (UW) Translational Research Initiatives in Pathology (TRIP) laboratory to perform these tasks. Here are published protocols using a similar paraffin processing and embedding method23,24.",
    "Trim and section each paraffin block to obtain a 5 µm thick retinal section that includes the optic nerve head, as well as four additional 5 µm thick retinal sections that are 250 µm apart from each other. Label the slides with mouse identification and the serial section number (i.e., 1, 2, 3, 4, or 5). Store the slides in a slide box.\n\tNOTE: The authors rely on the UW TRIP laboratory for their services in paraffin sectioning. Here are published protocols using similar paraffin sectioning method25,26.\nStain the slides containing retinal sections with hematoxylin and eosin (H&E). A protocol of H&E staining can be found in Supplementary Figure 5.\n\tNOTE: All steps of the H&E staining procedure must be completed in a fume hood.\nCollect stitched images of H&E-stained retinal sections with a scale bar using a light microscope at 20x magnification.\nQuantify the RPE thickness in the retinal images containing the optic nerve head for each sample.\n\t\nDownload and open the Fiji ImageJ program. Drag all the stitched retinal images containing the optic nerve head into the Fiji ImageJ taskbar. Verify the image scale is calibrated in µm and not pixels.\n\t\tNOTE: The image scale is located in the upper left-hand corner of the window containing a retinal image in the Fiji ImageJ program. If the scale is set in pixels, please refer to the instruction manual of the Fiji ImageJ program to convert pixels to µm.",
    "Mark every 300 µm interval in each image from the edge of the optic nerve head to the end of the retina (ora serrata). Click on the Straight icon in the Fiji ImageJ taskbar. Click and drag a line from the edge of the optic nerve head toward the ora serrata that is 300 µm in length. Click on the Paintbrush tool in the Fiji ImageJ taskbar and click the end of the 300 µm line to mark it.\nMeasure the RPE thickness at each marked interval. Click on the Straight icon in the Fiji ImageJ taskbar. Click and drag a line from the top to the bottom of the RPE (Supplementary Figure 6). Click on Analyze > Measure in the Fiji ImageJ menu bar to obtain the RPE thickness.\nTransfer the RPE thickness measurements to a spreadsheet and label the column containing measurements with mouse identification. Label an additional column with 'Marked Interval' and enter the distance away from optic nerve values (i.e., 300, 600, 900, etc.)\n\t\tNOTE: The first measured interval corresponds to 300 µm away from the optic nerve, the second measured interval corresponds to 600 µm away, and so on.\nQuantify RPE pathology incidence rates based on the retinal images for each sample.\n\t\nOpen the Fiji ImageJ program.\nOpen the Cell Counter application within the Fiji ImageJ program. Click on Plugins > Analyze > Cell Counter in the Fiji ImageJ menu bar. Drag a retinal image into the Fiji ImageJ taskbar and click on Initialize in the Cell Counter window.",
    "Count the number of RPE pathologies per retinal section using the Cell Counter application. Click on Type 1 under Counters and then click on all microvacuolization events in the image. Click on Type 2 under Counters and then click on all macrovacuolization events in the image. Click on Type 3 under Counters and then click on all individual migration events in the image.\nTransfer the numbers of the RPE pathologies to a spreadsheet. Label the rows with either microvacuolization, macrovacuolization, or migration, and the column with mouse identification.\nRepeat steps 1.15.2-1.15.4 for other images of the sample. Average the number of RPE pathologies per sample and divide by five to calculate the incidence rate of each RPE pathology for the sample in the spreadsheet.\nPerform statistical analysis on the RPE thicknesses at each interval and the RPE pathology incidence rates to determine if there are significant differences between groups in the study.\n2. Evaluation of mouse RPE by transmission electron microscopy\nCut the other posterior segments yielded after steps 1.5-1.9 in half through the superior mark into two sections with a razor blade. Reannotate the superior side of the sectioned posterior segments with tissue marking dye. Separate the sectioned posterior segments into new 2 mL microtubes containing 2 mL of 1x PBS and mouse identification.\n\tNOTE: The mouse posterior segment is too large to process in one piece and must be cut in half for transmission electron microscopy processing.\nRinse the tissues with 2 mL of 0.1 M cacodylate buffer, pH 7.2. Incubate for 10 min at RT on the benchtop. Repeat this step two more times.\nReplace the 0.1 M cacodylate buffer with 2 mL of 2% osmium tetroxide (OsO4) diluted in 0.1 M cacodylate buffer. Incubate for 1.5 h at RT in the fume hood.",
    "CAUTION: OsO4 is a poisonous substance. Please follow standard operating procedures when working with OsO4.\nRinse the tissues with 2 mL of 0.1 M cacodylate buffer for 10 min at RT in the fume hood. Repeat this step once.\nDehydrate the tissues with graduated EtOH dilutions ranging from 50% to 100% at RT in the fume hood. A protocol for the dehydration procedure can be found in Supplementary Figure 7.\nRemove 100% EtOH from the tissues and add 2 mL of propylene oxide to tissues. Incubate at RT in the fume hood for 15 min. Remove the propylene oxide from the tissues and add 2 mL of fresh propylene oxide to the tissues. Incubate at RT in the fume hood for 15 min.\n\tCAUTION: Propylene oxide is a toxic substance. Please follow standard operating procedures when working with propylene oxide.\nRemove propylene oxide from the tissues and add 2 mL of a 1:1 mixture of propylene oxide and resin to the tissues. Leave overnight under a vacuum in the fume hood at RT.\n\tCAUTION: Resin is a hazardous substance to humans. Please follow the laboratory's standard operating procedures when working with resin.\nReplace the 1:1 mixture of propylene oxide and resin from tissues with 2 mL of pure resin. Leave overnight under a vacuum in the fume hood at RT .\nEmbed the tissues in resin. Place a label with mouse identification in pencil and a drop of resin into the mold . Position the tissue on the drop of resin. Fill the mold with resin and place under a vacuum for 1 h at RT in the fume hood.",
    "Reposition the labels and specimens with fine-tipped forceps, with the posterior side of the posterior eyecup section on top. Leave the mold overnight at 65 °C in an oven in the fume hood.\nRemove the molds from oven. Allow the molds to cool to RT on the benchtop. Remove the blocks from the molds.\n\tNOTE: The blocks are now ready for trimming.\nShape the resin blocks with a razor blade to form a trapezoid. Trim the resin blocks using a microtome until the optic nerve head is visible. Proceed to use a diamond knife to cut semithin sections from the resin blocks with a thickness of 0.5 µm.\n\tNOTE: Here is a published protocol on microtome sectioning27. If desired, 0.5 µm thick semithin sections from the resin blocks can be collected and stained to evaluate the integrity of the sample.\nCut a 70 nm thick ultrathin section from each trimmed block using an ultramicrotome. Collect a 70 nm thick ultrathin section on a 400-mesh thin-bar copper grid. Place the grid into a grid storage box and label the slot with mouse identification.\n\tNOTE: Here is a published protocol on ultramicrotome sectioning28.\nStain the grids with 2% uranyl acetate for 5 min and then with 3.5% lead citrate solution for 5 min at RT in the fume hood.\n\tCAUTION: Uranyl acetate and lead citrate are hazardous substances. Please follow standard operating procedures when working with these substances.\nObtain images for each sample using a transmission electron microscope at a magnification of 15,000x, where the grid lines of the copper grid intersect the RPE and BrM.\n\tNOTE: There should be at least 20 to 35 images per section and 40 to 70 images per sample.\nQuantify BLamD heights in the images for the samples in the study.",
    "Open the Fiji ImageJ program. Drag all images from the sample section into the Fiji ImageJ taskbar. Verify that the images are calibrated in μm and not pixels.\nMeasure the BLamD height in the images. Click the Straight icon in the Fiji ImageJ taskbar. Click and drag a line from the elastic lamina of BrM to the top of the tallest deposit in the image (Supplementary Figure 8). Click Analyze > Measure in the Fiji ImageJ menu bar to obtain the BLamD height in the image.\n\t\tNOTE: If there are no BLamDs in the image, then draw a line from the elastic lamina of BrM to the basal lamina of the RPE.\nTransfer the BLamD heights to a spreadsheet and label with mouse identification.\nCalculate the cumulative frequencies of BLamD heights per genotype and averages of BLamD heights per mouse in the spreadsheet. Perform statistical analysis on the averages of BLamD heights to determine if there are significant differences between groups in the study.\n3. Evaluation of mouse RPE through confocal microscopy\nCollect eyes from the mice. Euthanize the mice according to the procedure described in step 1.3. Enucleate the eyes using step 1.5. Place the eyes using curved forceps into a 2 mL microtube with 2 mL of 1x PBS and mouse identification.\n\tNOTE: Do not dark-adapt the mice, as the interdigitization of the photoreceptors and RPE apical processes allows for better visualization of the RPE through confocal microscopy.\nClean and dissect the mouse eyes immediately to generate mouse posterior eyecups.\n\tNOTE: The posterior eyecup is different from the posterior segment because it does not contain the neural retina.\n\t\nTransfer the eye to a Petri dish containing 1x PBS under a dissecting microscope (Supplementary Figure 9A).",
    "Remove fat and muscle from the eyeball, as described in step 1.8.2 (Supplementary Figure 9B).\nNick the cornea of the eyeball with a number 11 scalpel blade. Remove the cornea and iris, as detailed in step 1.8.3 (Supplementary Figure 9C).\nPull out the lens with fine-tipped forceps. Take two fine-tipped forceps and gently separate the neural retina from the posterior segment.\nCarefully cut the neural retina at the optic nerve head for removal from the posterior eyecup (Supplementary Figure 9D).\nPlace the posterior eyecup into a new 2 mL microtube containing 500 µL of 1x PBS with mouse identification.\nFix the posterior eyecups with methanol (MeOH) (Supplementary Figure 10).\n\tNOTE: Step 3.3 takes about 2 h and 40 min to complete.\n\t\nAdd 500 µL of MeOH to tissues. Incubate on a shaker at 75 rpm for 5 min at RT.\nRemove the 500 µL of solution from the tissues and add 500 µL of MeOH. Incubate for 5 min on a shaker at 75 rpm for 5 min at RT. Repeat this step one more time.\nRemove the entire solution from the tissues and add 500 µL of MeOH. Incubate on a shaker at 75 rpm for at least 2 h at RT.\n\t\tNOTE: As an alternative to step 3.3.3, the posterior eyecup can be incubated overnight in MeOH on a shaker at 75 rpm in a 4 °C room.\nAdd 500 µL of 1x PBS to the tissues. Incubate on a shaker at 75 rpm for 5 min at RT.\nRemove the 500 µL of solution from the tissues and add 500 µL of 1x PBS. Incubate on a shaker at 75 rpm for 5 min at RT. Repeat this step one more time.",
    "Remove the entire solution from the tissues and replace it with 500 µL of 1x PBS.\n\t\tNOTE: The tissues are fully fixed by the MeOH and can be kept in a 4 °C refrigerator for at least 1 month.\nPerform immunofluorescence staining of the posterior eyecups to visualize tight junctions and nuclei of the RPE (Supplementary Figure 11).\n\t\nRemove the 500 µL of 1x PBS from samples and add 100 µL of diluted 10% normal donkey serum in 1x PBS solution. Incubate on a shaker at 75 rpm for 30 min at RT.\nRemove the diluted 10% normal donkey serum solution from the samples and add 100 µL of a 1:50 dilution of a rabbit polyclonal anti-Zonula Occludens-1 (ZO-1) antibody in 1x PBS. Transfer the samples to a 4 °C room and incubate overnight on a shaker at 75 rpm.\nRemove the antibody dilution from the samples and add 2 mL of 1x PBS. Incubate on a shaker at 75 rpm for 10 min at RT. Repeat this step two more times.\nRemove the 1x PBS from samples. Add 100 µL of a 1:250 dilution of a donkey anti-rabbit IgG antibody with a 488 fluorophore-conjugated tag and a 1:250 dilution of 4',6-Diamidine-2'-phenylindole dihydrochloride (DAPI) in 1x PBS to the samples. Cover the samples with aluminum foil and incubate on a shaker at 75 rpm for 2 h at RT.\n\t\tNOTE: The samples must be completely covered with aluminum foil to prevent photobleaching.\nRemove the antibody and DAPI dilutions from the samples. Add 2 mL of 1x PBS to the samples, re-cover with aluminum foil, and incubate on a shaker at 75 rpm for 10 min at RT. Repeat this step three more times.\n\t\tNOTE: The tight junctions and nuclei of the RPE are now fully labeled and stained, respectively.",
    "Mount the posterior eyecups onto microscope slides.\n\t\nLabel a microscope slide with mouse identification. Transfer the posterior eyecup onto a microscope slide under a dissecting microscope with the choroidal side facing down. Add a drop of 1x PBS to the posterior eyecup to prevent it from drying out (Supplementary Figure 12).\nCut the posterior eyecup using a number 11 scalpel blade at four spots that will yield four quadrants corresponding to the cardinal directions (i.e., north, east, south, and west). Dab excess 1x PBS with tissue from the perimeter of the posterior eyecup. Gently flatten the posterior eyecup with a camel hairbrush and fine-tipped forceps (Supplementary Figure 12).\n\t\tNOTE: The resulting product is now known as an RPE flat mount.\nAdd a drop of mounting medium to the RPE flat mount and place a coverslip on top of it. Apply clear fingernail polish to seal the coverslip and allow it to dry for at least 30 min at RT in a closed drawer. Place the slides in a slide carrier box and keep the box in a 4 °C refrigerator.\n\t\tNOTE: Be careful to avoid introducing bubbles on the RPE flat mount. RPE flat mounts can be imaged within a 2 week time frame.\nObtain an image of each of the four quadrants surrounding the optic nerve of the RPE flat mount on a confocal microscope at 20x magnification for each sample. An example of an RPE flat mount image can be found in Supplementary Figure 13A.\n\tNOTE: It may be necessary to perform z-stack imaging of the RPE flat mounts where multiple images are taken and stacked to compensate for dimensional differences of the RPE flat mount.",
    "Trace the tight junctions of the RPE cells within each RPE flat mount image. An example of a traced RPE flat mount image can be found in Supplementary Figure 13B.\n\t\nOpen the Fiji ImageJ program. Drag an RPE flat mount image into the Fiji ImageJ taskbar. Verify the image is calibrated in micrometers and not pixels.\nDouble-click on the Overlay Brush Tool icon in the Fiji ImageJ taskbar to set the brush width to 3, transparency to 0, and color to red. Click the Close button in the Overlay Brush Tool window.\nClick on the Overlay Brush Tool icon. Click and drag on the tight junctions of all RPE cells that are completely within the image.\n\t\tNOTE: In case a tracing mistake is made, double-click on the Overlay Brush Tool icon and click the Undo box in the Overlay Brush Tool window to remove the tracing mistake from the image.\nClick the Rectangle icon in the Fiji ImageJ taskbar. Click on the image and drag around the perimeter of the image. Click Edit > Clear on the Fiji ImageJ menu bar to keep the traced lines and remove any blue and green colors from the image.\nSave the trace image in an appropriate location with mouse identification, quadrant location (i.e., north, south, east, or west), and a CP suffix label.\n\t\tNOTE: Do not save the RPE trace image prior to completing step 3.7.4.\nCalculate the RPE cell areas for each sample.\n\t\nDesignate a location to save the files from RPE area analysis by creating a folder on the computer desktop screen. Generate subfolders for each RPE trace image and label the subfolders with mouse identification as well as quadrant location (i.e., north, south, east, or west).",
    "Install and open the Cell Profiler program29. Download the Ikeda_RPE Area Calculator.cpproj (Supplementary Coding File 1) project file. Open the Ikeda_RPE Area Calculator.cpproj file by clicking File > Open Project in the Cell Profiler program menu bar.\nDrag one RPE trace image into Image > Drop Files and Folders Here box in the Cell Profiler program window.\nInput the location of the folder into the Cell Profiler program that corresponds to the RPE trace image. Click on the Output Settings button in the bottom left-hand corner of the Cell Profiler program window and enter the location of the folder in the Default Input Folder and Default Output Folder text boxes.\nClick on the Analyze Images button in the bottom left corner of the Cell Profiler program window. After the analysis is complete, an Analysis Complete window will appear on the screen. Click on the OK button in the Analysis Complete window.\n\t\tNOTE: This action will generate a csv file and jpeg image. The csv file will contain the areas for the RPE cells within the trace image. The jpeg image will correspond to the RPE trace image, where each RPE cell will be labeled with a number (Supplementary Figure 13C).\nTransfer the RPE areas from the csv file to a spreadsheet. Label the spreadsheet with mouse identification.\nPerform a quality control survey of the data by confirming that each RPE area in the csv file links to a fully-traced RPE cell in a jpeg image. Remove any values from the spreadsheet that do not correspond to fully traced RPE cells.\nReturn to the Cell Profiler program. Right-click on the RPE trace image name in the Drop Files and Folders Here box and select Clear the List to remove the image from the Cell Profiler program.",
    "Repeat steps 3.8.3-3.8.8 to calculate the RPE sizes for the remaining three RPE trace images of the sample.\nQuantify the RPE cell size averages for each sample in the spreadsheet.\nQuantify the RPE cell densities for each sample in the spreadsheet. To calculate the RPE cell density, divide the total number of RPE cells per quadrant by the total area of RPE cells per quadrant that was detected by the Cell Profiler program. Determine the average of the RPE cell densities from the four quadrants per sample.\nQuantify the number of multinucleated RPE cells per RPE flat mount for each sample. Use the Cell Counter application within the Fiji ImageJ program, as described in steps 1.15.1-1.15.3, to count the number of RPE cells with more than three nuclei in four quadrants of the sample.\nPerform statistical analysis on the RPE cell size and density averages, as well as the number of multinucleated RPE cells to determine if there are significant differences between groups in the study.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}