{
  "id": 17439,
  "origin_website": "Jove",
  "title": "In vitro Assessment of Cardiac Reprogramming by Measuring Cardiac Specific Calcium Flux with a GCaMP3 Reporter",
  "procedures": [
    "All experimental procedures and practices involving animals were approved by Institutional Animal Care & Use Committee at the University of Michigan. All experimental procedures and practices involving cell culture must be performed BSL2 Biological Safety Cabinet under sterile conditions. For the procedures and practices involving viruses, the guideline of the proper disposal of transfected cells, pipette tips, and tubes to avoid the risk of environmental and health hazards was followed.\n1. Establishment of a Tg(Myh6-cre)1Jmk/J /Gt(ROSA)26Sortm38(CAG-GCaMP3)Hze /J (referred to as Myh6-Cre/Rosa26A-Flox-Stop-Flox-GCaMP3) mouse strain (Figure 1)\nPrepare Tg(Myh6-cre)1Jmk/J mouse strain (Jackson lab stock 009074, referred to as Myh6-Cre) and Gt(ROSA)26Sortm38(CAG-GCaMP3)Hze/J mouse strain (Jackson lab stock 014538, referred to as Rosa26A-Flox-Stop-Flox-GCaMP3), respectively.\nBreed each strain upto 8 weeks old to obtain adult Myh6-Cre and Rosa26A-Flox-Stop-Flox-GCaMP3 mice, respectively.\nCrossbreed the adult Myh6-Cre and the Rosa26A-Flox-Stop-Flox-GCaMP3 mice.\n\t​NOTE: Set up Myh6-Cre male/ Rosa26A-Flox-Stop-Flox-GCaMP3 female or vice versa. There is no significant difference between their descendants. Typically, the female mice will give birth to 8-10 pups 19-21 days after the crossbreeding.\n2. Isolation and selection of neonatal Myh6-Cre/Rosa26A-Flox-Stop-Flox-GCaMP3 mice hearts.\nObtain P0-P2 pups. Ensure that 8-10 pups are present to isolate 10 million NCFs with this protocol.\nDeeply anesthetized the pups by hypothermia. Place pups in a latex glove and immerse up to the neck in crushed ice and water (2°C - 3°C).\nBriefly sanitize the pups with 75% ethanol.\nSacrifice the pups by decapitation with sterile scissors.\nMake a horizontal incision near the heart, squeeze the heart, and then isolate it by separating at the root of the aorta with scissors.\nObserve the heart beating under a fluorescence microscope. Ensure the hearts with Myh6-Cre/Rosa26A-Flox-Stop-Flox-GCaMP3 genotype shows Ca2+ flux indicated by GCaMP3 with heart beating. The other genotypes do not show fluorescence (Figure 2, Video 1, and Video 2).",
    "3. Isolation of neonatal cardiac fibroblasts (NCFs)\nNOTE: For this part, protocol from Dr. Li Qian's Lab14 was adopted with minor optimizations when applicable to this study.\nAfter isolation of the αMHC-Cre/Rosa26A-Flox-Stop-Flox-GCaMP3 hearts, cut them into four pieces that are loosely connected. Wash them in ice-cold DPBS in a 6 cm plate thoroughly several times to limit the blood cell pollution in the isolated cells.\nTransfer the hearts to a 15 mL conical tube.\nDigest the hearts with 8 mL of warm 0.25% Trypsin-EDTA at 37 °C for 10 min.\nDiscard the trypsin supernatant and add 5 mL of warm type-II collagenase (0.5 mg/mL) in HBSS.\nVortex the mixture thoroughly, and incubate at 37 °C for 5 min.\nAfter the incubation, vortex thoroughly and let the undigested tissue settle down by gravity.\nCollect the supernatant in a 15 mL conical tube with 5 mL cold fibroblast (FB) medium (IMDM with 20% FBS and 1% penicillin/streptomycin).\nRepeat steps 3.4-3.7 for the undigested tissue 4-5 times.\nCollect all the supernatant together and filter the supernatant with a 40 µm strainer.\nCentrifuge at 200 x g for 5 min at 4 °C and discard the supernatant.\nResuspend the cells in 10 mL of Magnetic-activated cell sorting buffer (MACS buffer; 1x PBS with 2 mM EDTA and 0.5% BSA).\nDetermine the viable cell number by trypan blue staining.\n\t\nTake 10 µL of cells out from 10 mL of cell suspension in step 3.11.\nMix with 10 µL of 0.4% trypan blue solution and incubate for 5 min at room temperature.\nAdd the mixture to a hemocytometer and determine the viable cell number. The dead cells are stained in blue, while the viable cells are unstained.\nCentrifuge the cells at 200 x g for 5 min at 4 °C and discard the supernatant.",
    "Resuspend the cells with 10 µL of Thy1.2 microbeads in 90 µL of chilled MACS buffer for less than 10 million viable cells. Add more beads proportionally if there are more than 10 million viable cells. Pipette the mixture well and incubate at 4 °C for 30-60 min.\nAdd 10 mL of MACS buffer and mix well.\nCentrifuge at 200 x g for 5 min, discard the supernatant.\nRepeat steps 3.15-3.16 once.\nResuspend the cells and beads with 2 mL of MACS buffer.\nSet up a MACS separator in the hood. Insert an LS column to the separator and equilibrate the column with 3 mL of MACS buffer.\nWhen the LS column is equilibrated, pass the cells through the column.\nWash the LS column with 2 mL of MACS buffer three times.\nTake the column off the separator, elute it with 2 mL of MACS buffer three times, and then collect the elution to a 50 mL tube.\nCentrifuge at 200 x g for 5 min and discard the supernatant.\nResuspend the cells with 5 mL of FB media.\nDetermine the cell number with a hemocytometer.\nDilute the cells with FB media and seed the cells to dishes or plates as desired. Ensure that the cell seeding density is around 2-2.5 x 104 cells/cm2 (optimize the density based on individual experiments). Ensure that the attached fibroblasts have an oval to round shape on the second day after seeding (Figure 3).\n4. Production of retrovirus encoding polycistronic MGT vector for cardiac reprogramming\nMaintain Plat-E with Plat-E culture media (DMEM supplemented with 10% FBS, 1 µg/mL of puromycin and 10 µg/mL of blasticidin) at 37 °C with 5% CO2.\nOn day 1, split Plat-E to a 6-well plate at approximately 4-5 x 105 cells/well density.",
    "On day 2, Plat-E typically reaches 80% confluency. Transfect the cells with the following procedures. Adjust the volume and quantity of each element present here based on each well in a 6-well plate.\n\t\nDilute 2 µg of pMX-puro-MGT polycistronic retrovirus expression plasmid vector (Addgene 111809) to 500 ng/µL with TE buffer.\nPrepare the transfection mixture by mixing 10 µL of Lipofectamine with 150 µL of reduced serum medium. Carefully pipette to mix well and incubate at room temperature for 5 min. Be careful to avoid bubbles when pipetting.\nMeanwhile, prepare a plasmid mixture by mixing the plasmid with 150 µL of reduced serum medium. Carefully pipette to mix well and incubate at room temperature for 5 min. Be careful to avoid bubbles when pipetting.\nCarefully mix the two mixtures and incubate at room temperature for 5 min. The solution may appear cloudy.\nAdd the mixture drop by drop to the cells to be transfected.\nIncubate the cells at 37 °C overnight.\nOn day 3, change the medium to a fresh complete cell culture medium lacking puromycin and blasticidin.\nOn day 4, 48 h after the transfection, collect the supernatant that contains retrovirus and store it in 4 °C.\nOn day 5, 72 h after the transfection, collect the supernatant that contains retrovirus.\nFilter both the 48 h and 72 h supernatant with a 0.45 µm filter, precipitate overnight at 4 °C by adding 1/5 volume of 40% Poly (ethylene glycol) (PEG) solution to make a final concentration of 8% PEG.\nCentrifuge at 4,000 x g for 30 min to precipitate the virus.\n\tNOTE: PEG8000-virus forms small white precipitation.\nResuspend the virus with iCM medium containing 8 µg/mL polybrene as desired. Use the retrovirus immediately.\n5. Reprogramming NCFs to iCMs with MGT encoding retrovirus infection",
    "Grow or passage NCFs before virus infection.\n\tNOTE: Usually, NCF can be passaged twice.\nOn day 0, seed NCF to the density around 1-2 x 104 cells/cm2 in FB medium.\nOn day 1, replace the culture medium with a virus-containing medium for each well as desired. Use the virus from one well Plat-E in a 6-well plate to infect two wells in a 24-well plate. Titer the virus to determine the optimal virus concentration.\n\tNOTE: Viruses containing other reprogramming factors of interest could be introduced along with MGT retrovirus.\nIncubate at 37 °C overnight.\nOn day 2, 24 h after the virus infection, replace the virus-containing medium to a regular iCM medium.\nTo monitor the GCaMP3 expression, plate it under an inverted fluorescence microscope. Under 10x at GFP channel, observe the mild basal GCaMP3 fluorescence of a portion of cells as early as day 5.\nReplace the medium every 2-3 days during the reprogramming. If necessary, perform a positive selection for MGT retrovirus infected cells by adding 2 µg/mL of puromycin to the culture medium for 3 days and maintaining it at 1 µg/mL.\n\tNOTE: Introduce chemicals of interest (e.g., IGF-1, MM589, A83-01, and PTC-209, referred to as IMAP as we previously reported15) along with medium change.\nAfter 14 days of infection, replace the medium with B27 medium to further induce iCM maturation.\n6. Evaluation of iCM functional maturation and reprogramming efficiency by Ca2+ flux\nNOTE: Add 1 µM isoproterenol to the cells to be evaluated before assessment, if necessary.\nAssess the Ca2+ flux with an inverted fluorescence microscope at room temperature.\nIn GFP channel, observe the GCaMP3+ cells under 10x objective. Ensure that it shows spontaneous cell beating in the bright field channel.",
    "Randomly select three fields under 20x and record the Ca2+ flux of the iCMs for 3 min for each field.\n\tNOTE: Here, the Ca2+ flux was synchronized with spontaneous cell beating (Figure 4, Figure 5, and Video 3, Video 4, Video 5, Video 6, Video 7, Video 8).\nManually quantify the cells with Ca2+ flux.\n7. Statistical analysis and data presentation\nAnalyze the differences among groups one-way analysis of variance (ANOVA) and perform the Student-Newman-Keuls multiple comparison tests.\n\tNOTE: Results are as mean ± S.E with p < 0.05 regarded as statistically significant. Each experiment was performed at least three times.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}