{
  "id": 18006,
  "origin_website": "Jove",
  "title": "Lentiviral Vector-mediated Gene Therapy of Hepatocytes Ex Vivo for Autologous Transplantation in Swine",
  "procedures": [
    "All animal procedures were performed in accordance with institutional guidelines and were reviewed and approved by the Institutional Animal Care and Use Committee (IACUC) prior to study conduct. Procedures described here were performed on male and female large white farm pigs (50% Landrace/50% Large White genetic background) up to 3 months of age that are deemed healthy and suitable for surgery.  Animals are socially housed unless considered incompatible by institutional veterinary care staff.  Animals are fed appropriate levels of chow twice daily and observed for clinical signs by care staff at least once daily.\n1. Preparation for Surgery\nAdminister 5 mg/kg telazol and 2 mg/kg xylazine intramuscularly to induce sedation. Administer buprenorphine SR subcutaneously at a dose of 0.18 mg/kg for post-operative analgesia (anticipated analgesia from this dose will be up to 72 h). Manually check the animal for responses to verify sedation.\nOnce sedated, insert an intravenous catheter into a peripheral ear vein for pharmacologic access.\nAdminister intravenous 25 mg/kg cefazolin and intramuscular 5 mg/kg of ceftiofur pre-operatively.\n\t\nAdminister normal saline intravenously to keep blood pressure and heart rate within normal physiologic limits throughout the procedure.\nPlace an orogastric tube to decompress the stomach. Perform endotracheal intubation with an appropriately sized endotracheal tube, verify proper placement by compressing the chest manually to detect exhalation, and then mechanically ventilate the animal with 1–3% isoflurane.\nPlace electrocardiogram (ECG) leads, blood pressure cuff, temperature probe, and pulse-oximeter to monitor and record vital signs. Place the animal in a supine position, scrub the abdomen from rib cage to pelvis with betadine, and drape sterilely.",
    "Ventilate subject with 1-3% isoflurane during the procedure to maintain a surgical plane of anesthesia. Continue to monitor vital signs for changes and adjust isoflurane accordingly to maintain heart rate at pre-incision levels If blood pressure drops dramatically, reduce isoflurane and initiate institutionally-approved agents to restore vitality, such as intravenous epinephrine.\n\t\nRecord heart rate, respiration rate, blood pressure, and body temperature on a surgical procedure record to track and maintain animal welfare as per institution-specific policy to ensure compliance with large animal welfare standards.\n2. Laparoscopic Partial Hepatectomy\nPerform initial port site entry using an open Hassen technique cephalad to the umbilicus. When peritoneum is visualized, safely introduce a 12 mm trocar into the abdominal cavity. Pass a 5 mm, 30°, scope through this port.\nInsufflate the abdomen with CO2 to 15 mmHg. Under direct visualization with the laparoscopic camera, place two additional 5 mm ports triangulating on the left lateral lobe of the liver. Exact placement of the ports will depend on size and anatomy of the animal.\n\t\nAt this point, place the laparoscope in one of the 5 mm ports.\nIdentify the left lateral segment of the liver at the point of the major fissure of left lobe. This fissure separates the medical and left lateral segments. Secure the portal structures along with the hepatic vein along this fissure using a surgical stapler (see Table of Materials). Transect the parenchyma through this fissure using sequential firings from the stapler using 60, 45, or 30 mm long vascular loads.\n\t\nWhen parenchymal resection is complete, assess the remnant liver to ensure adequate hemostasis. Control any bleeding from the parenchyma with cautery or suture.\nRetrieve the liver section using endoscopic graspers and an endoscopic tissue retrieval bag.",
    "Remove the ports and close the 12 mm port incision in three layers with interrupted size 0 suture for the midline fascia, a running 2-0 suture for the deep dermal layer and a running 4-0 suture for the subcuticular layer. The 5 mm ports may be closed in one layer with 2-0.\nPlace a sterile dressing on the incisions (see Table of Materials).\nWhen cells will be ready in less than 4 hours, maintain the animals under general anesthesia post-operatively until the time of autotransplantation.\nAlternatively, if cell manipulations require longer periods (such as to allow formation of hepatocyte spheroids or longer transduction/selection periods based on individual applications of this method) allow the animal to recover from anesthesia and repeat the anesthetic induction steps prior to autotransplantation when the cells are ready.\n3. Hepatocyte Isolation\nConnect a peristaltic pump with perfusion set to deliver warm dispersion solutions (maintained in 43 °C water bath)  to catheters to be placed in the large exposed vessels of the liver section, such that solution temperature is 38 °C upon introduction to the tissue. All tubing, equipment, and solutions must be maintained sterile to ensure the cells are suitable for transplantation.\n\t\nPrime the pump and tubing with Per II up to a stopcock positioned to switch between Per I and Per II delivery to the tissue. Switch the stopcock to the Per I position and prime the rest of the tubing set, filling an in-line bubble trap completely to prevent introducing air bubbles into the tissue.\nPrepare a clean transverse cut perpendicular to the hepatic circulation to reveal cross sections of portal vein branches and hepatic veins for catheterization.",
    "Catheterize the available exposed veins with a snug-fitting catheter to avoid leakage of the perfusate. Cannulate at least 1 portal and 1 hepatic vein to ensure adequate perfusion of the tissue.\n\t\nEnsure that the catheter(s) are primed/free of air before placing the catheter into a vein.\nPerfuse with warm Per I at 100 mL/min, moving the outlet tube from vein to vein every 30 seconds to 1 min. Cycle through all available veins for 15–20 min. During Per I infusion, set an evacuation tube to empty the procedure tray into a waste container under vacuum.\nSwitch to Per II at 100 mL/min, cycling through the veins as with Per I, for a total of 30 min. During Per II, use a return pump to recycle Per II back to the reservoir for re-administration to conserve preparation of the active enzyme. Set the return pump to less than the outflow pump (i.e., 94 mL/min), being careful not to return excessive air to the source bottle.\n\t\nIf the liver capsule breaks, this time can be reduced.\nIf the liver is not fully digested (does not remain dimpled with gentle focal pressure) an additional 5 min of perfusion can be performed.\nOccasionally (approximately every 5 minutes) document surface temperature of the bubble trap and/or liver to ensure the hepatocytes are not getting cold. If the liver is getting cold (<35 °C) increase the heat of the water bath to restore the liver temperature closer to 38 °C. The liver should blanche as the perfusion proceeds.\nRemove liver to sterile plate or Petri dish for transport to cell culture hood. Cover sterile field with a sterile drape to maintain integrity during the hepatocyte processing.",
    "Expose the liver section from sterile drape and submerge the liver with cold hepatocyte wash media (HWM). Disrupt the capsule by dragging scissors across the top. Wearing sterile gloves, gently massage the liver to release the hepatocytes into the medium.\nFilter the HWM containing hepatocytes through sterile gauze into large (~200 mL) centrifuge bottles. Wash the hepatocytes through the following procedure in triplicate, combining the cell pellet from the multiple bottles after the first resuspension (as applicable):\n\t\nCentrifuge at 50 x g, 5 min, 4 °C.\nAspirate and resuspend in 150 mL of HWM.\nLeave the pellet in HWM after the 3rd wash.\nCount cell concentration using a hemocytometer or other device, as available. These cells are now ready for ex vivo manipulation of interest, including gene therapy, cell sorting, or other specialization prior to autotransplantation. Final volume of HWM can be adjusted to target a specific concentration (cells/mL).\n4. Hepatocyte Transduction\nResuspend hepatocytes in media (Dulbecco’s modified eagle medium [DMEM], 10% fetal bovine serum [FBS], Penicillin-Streptomycin, 4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid [HEPES], dexamethasone, epidermal growth factor [EGF], and NTBC) at 1–2 million cells per mL in a conical tube on ice.\nThaw lentiviral vector at room temperature and add to conical tube on ice at target 20 multiplicity of infection (MOI) to bind the cells. Rotate cells at 4 °C at 10 rpm for 90 min to bind the viral vector to the cell surface.\nTransfer tubes to 37 °C for 30–40 min. Invert to mix every 5 minutes to facilitate the vector transducing the bound cells.\nCentrifuge cells at 50 x g at 4 °C for 4 min. Resuspend cell pellet in saline at desired concentration on ice. Repeat this wash to ensure removal of any unbound vector from the preparation.",
    "If possible, plate sufficient aliquots of cells (i.e., 500,000 cells per well in a 6 well cell culture plate) to check for viability, adhesion, transduction efficiency, etc.\n\tNOTE: It is often not possible to assess these parameters prior to autotransplantation, especially for same-day procedures. For example, the procedure described herein employed an untagged Fah cDNA under the control of the alpha-1 antitrypsin liver-specific promoter, which was not readily assayable in the hepatocytes prior to transplantation. However, these plated cells can be assayed subsequent to the autotransplantation as an indicator of the success of transduction (i.e., via Western blotting) or a predictor of the general success of the procedure.\n5. Hepatocyte Transplantation\nIdentify the portal vein via ultrasound using a 2 to 5 MHz transducer. Direct an 18 G, 5 inch needle towards the main portal vein proximal to its bifurcation.\nBegin slow manual infusion of up 1 x 109 hepatocytes (approximately 10 g) using a syringe. Monitor portal pressures during transplantation using an infusion catheter.\n\t\nIf portal pressures increase more than 8 mmHg above baseline, pause infusion and allow the pressure to return to baseline levels.\nIf portal pressures do not return to baseline after pausing infusion for five minutes, discontinue the infusion.\nAfter transplantation and catheter removal, use the ultrasound to evaluate for the presence of thrombotic events and forward flow in the portal vein.\n6. Postoperative Recovery and Maintenance\nMove subject to a proper recovery area and observe until the animal is fully ambulatory, monitoring heart rate, oxygen saturation and body temperature every 15–30 min. Maintain body temperature with warm blankets or an air-heated wrap, as needed.\nAdminister 1 mg/kg omeprazole by mouth daily (through the end of the study) to reduce the chances of gastric ulceration that can occur with bouts of inappetence.",
    "Postoperatively, the animal is monitored closely by lab and veterinary staff and typically does not require additional pain medication separate from the pre-operative buprenorphine dose.  If signs of distress/pain are observed by qualified veterinary care staff (incision guarding, inappetence, lethargy), anti-inflammatory agents (i.e., Carprofen) may be administered.\n7. Recipes\nSee Table 1 for recipes used in this protocol.\ntable:\n﻿0,1,2,3,4\nReagent,HWM,Reagent,Per I (10x),Per II (10x)\nWilliams’-E Powder (g/L),10.8,NaCl (g/L),83,39\nNaHCO3 (g/L),2.2,KCl (g/L),5,5\nHEPES (g/L),2.6,HEPES (g/L),24,240\n\"Pen/Strep (100x, mL/L)\",10,EGTA (g/L),9.5,-\nFetal Bovine Serum (mL/L),100,N-acetyl-L-cysteine,8,8\npH,7.3,\"(N-A-C, g/L)\",8,8\n,,Nitroglycerin (mL/L),5,5\n,,CaCl2 2H2O (g/L),-,7\n,,Collagenase D (mg/mL),-,0.2\n,,pH,7.4,7.6\nTable 1: Recipes for Solutions Used in Hepatocyte Isolation from Liver Sections.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}