{
  "id": 1582,
  "origin_website": "Cell",
  "title": "A protocol for efficient CRISPR-Cas9-mediated knock-in in colorectal cancer patient-derived organoids",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThis protocol describes the knock-in of the marker cassette into the OLFM4 locus, which we identified as stem cell markers of PDOs established from CRC (Okamoto et al., 2021[href=https://www.wicell.org#bib2]). However, we have also successfully used this protocol to visualize and evaluate their progeny. Thus, the main steps of the protocol can be widely adapted for analyzing various types of cells.\nCRISPR/Cas9 (clustered regularly interspaced short palindromic repeats (CRISPR)-associated protein 9) technology has been widely used to manipulate the genome of mammalian cells. To visualize stem cells, in-frame insertion of a marker gene into a gene of interest has been widely used. However, this modification inevitably disrupts the expression of genes of interest. Additionally, we have experienced a lack of expression of inserts, most likely due to epigenomic modification (Schuijers et al., 2014[href=https://www.wicell.org#bib4]). Based on these observations, we inserted IRES marker gene cassettes into the 3′ UTR of the target gene.\nThe transfection efficiency varies among PDOs, and we adopted the method of transposon-based integration with electroporation developed by Fujii et al., which allows drug selection of transfected cells using the PiggyBac system(Fujii et al., 2015[href=https://www.wicell.org#bib1]). We used the homology-independent targeted integration method (HITI) (Suzuki et al., 2016[href=https://www.wicell.org#bib6]) because it allowed highly efficient knock-in of donor DNA at the target sites. Generally, 5%–10% of clones harbored the expected genome editing.\nsgRNA design and preparation\nTiming: 1 week\nsgRNA are designed using online tools, including CHOPCHOP (http://chopchop.cbu.uib.no[href=http://chopchop.cbu.uib.no]), CRISPOR (http://crispor.tefor.net[href=http://crispor.tefor.net]) and CRISPick (https://portals.broadinstitute.org/gppx/crispick/public[href=https://portals.broadinstitute.org/gppx/crispick/public]).\nCritical: It is important to confirm whether the crRNA recognition sequences of PDOs contain mutations or SNVs. We recommend exome sequencing because it also provides information about chromosome aneuploidy. Sanger sequencing of the PCR amplicon is an alternative choice for verification.",
    "To prepare the sgRNA oligonucleotides for vector insertion, the sense and antisense oligonucleotides are mixed in a 0.2 mL tube following volumes.\ntable:files/protocols_protocol_1020_3.csv\nThe tube is placed in a thermocycler, incubated at 95°C for 5 min, and left at RT for 1 h.\nThe annealed oligos are diluted into 250 μL ddH2O.\nThe plasmid, pX330, is digested with Age I by mixing the reaction following reagents and volumes. Incubated at 37°C for 2 h.\ntable:files/protocols_protocol_1020_4.csv\nDigested plasmid is purified by phenol/chloroform extraction, followed by ethanol precipitation.\nThe annealed sgRNA oligonucleotide and digested plasmid are ligated and incubated at 16°C for 30 min according to the manufacturer’s instructions (DNA Ligation Kit Ver. 1).\ntable:files/protocols_protocol_1020_5.csv\n10 μL of ligation product is transferred into 100 μL of a competent Stbl3 strain, incubated for 30 min, heat-shocked at 42°C for 60 s and incubated on ice for 3 min. Next, 500 μL of SOC medium is added and incubated at 37°C for 30 min, and 100 μL of suspension is spread onto an LB plate containing 100 μg/mL ampicillin. The plate is incubated at 37°C for 16 h.\nColonies are picked and cultured in 3 mL LB medium, and the plasmid is purified using a QIA prep Spin Miniprep Kit.\nPlasmids are verified by using the T7sgRNA-R primer for sequencing and further prepared using a QIA prep MAXI column.\nCritical: Endotoxin-free plasmids are necessary for transfer into organoids.\nPreparing donor plasmids\nTiming: 1 week",
    "The plasmids pCMMP-MCS-IRES-EGFP (Addgene #36953) and pCMMP-MCS-IRES-mRFP (Addgene #36972) are two useful resources to visualize stem cells with EGFP and RFP, respectively. We generated an EGFP-inducible Caspase9 fusion gene cassette, pCMMP-MCS-IRES-EGFP-P2A-inducible Caspase9, which allows the ablation of target cells by exposing genome-edited PDOs to AP20187 , a chemical compound that homodimerizes Caspase9 and induces apoptosis (Figure 2[href=https://www.wicell.org#fig2]). All these constructs have AgeI and NotI sites at the 5′ region and PacI and NheI sites at the 3′ region, which allows the directional cloning of target sequences of sgRNA.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1020-Fig2.jpg\nFigure 2. Donor plasmid construction\n(A) Schematic representation of a donor fragment using the pCMMP-MCS-IRES-eGFP-P2A-iCas9 plasmid. Two annealed oligonucleotides were inserted into the AgeI/NotI site at the 5′ end and the PcaI/NheI site at the 3′ end.\n(B) Nucleotide sequences of 5′- and 3′-insertion sites in pCMMP-MCS-IRES-eGFP-P2A-iCas9.\nTop and bottom oligonucleotides are prepared as shown in Figure 2[href=https://www.wicell.org#fig2]B. Note that the top and bottom oligonucleotides are to be inserted into the 5′ cloning sites of the donor vector contain AgeI and NotI cloning sites, and those to be inserted into the 3′ cloning sites contain PacI and NheI sites.\nAnneal oligonucleotides used for insertion at the 5′ cloning site as described in steps 2–4.\nThe pCMM-MCS-IRES-eGFP-iCas9 plasmid is digested with AgeI, and the fragment was purified as described in steps 5–6.\nDissolve the digested plasmid in 90 μL of ddH2O.\nThe purified AgeI-digested plasmid is digested with NotI as described in step 5.\nThe AgeI/NotI double-digested plasmid is purified by nucleospin gel and PCR clean-up kits. The plasmid can be eluted twice with 20 μL of ddH2O, and the final volume of the digested plasmid should be 40 μL.\nDNA concentration is determined using spectrophotometer.",
    "The annealed sgRNA oligonucleotide and digested plasmid are mixed according to the manufacturer’s instructions (DNA ligation kit Ver. 1, Takara) and incubated at 16°C for 30 min. We recommend to use 25 pmol of sgRNA oligonucleotide and 100 fmol of digested plasmid for efficient ligation.\nCompetent DH5alpha is transformed with the ligated product, and the plasmid is prepared as described in steps 8–10.\nThe annealed oligonucleotide used for insertion at the 3′ cloning site has appealed and is as described in step 12.\nDigest pCMM-MCS-IRES-eGFP-iCas9 in which double-stranded oligonucleotide cloned in the 5′ cloning site with PacI and purify as described in step 13–15.\nThe fragment is digested from step 22 with NheI and purified as described in steps 16 and 17.\nThe annealed oligonucleotide from step 21 and PacI/NheI double-digested plasmid are described in step 18.\nThe competent Stbl3 strain is transformed, and the plasmid is prepared as described in step 20.\nCritical: Stbl3 is recommended because the donor plasmid used for HITI contains insertions of identical sequences at 5′ and 3′ cloning sites.\nPDOs electroporation\nTiming: 2 hours\nWe used a NEPA21 electroporator (Nepa Gene) to transfer plasmid DNA to PDOs. The electroporation protocol was originally developed for NHEJ-mediated gene disruption and for HDR-mediated gene modification (Fujii et al., 2015[href=https://www.wicell.org#bib1]). We have modified this protocol to optimize HITI-mediated knock-in of the marker cassette. For complete details of the organoid electroporation, please refer to the original protocol (Fujii et al., 2015[href=https://www.wicell.org#bib1]).\nPassage PDOs 3 days before electroporation.\nCritical: The population of OLFM4-expressing cells increases during the 3–4 days after passage and then decreases thereafter.\nNote: Typically, 1 to 2×10ˆ5 cells were collected from 1-well of PDOs, and 6 wells of PDOs were sufficient for each electroporation.",
    "The medium is removed, and 500 μL of TrypLE solution supplemented with 10 μM Y-27632 is added to each well. PDO Matrigel is collected into a 15 mL centrifuge tube using a 1000 μL pipette.\nCells are incubated in 37°C water bath for 15–30 min until Matrigel is properly dissolved in TrypLE solution.\nBasal medium is added up to 10 mL, and the mixture is pipetted and filtered through 40 μm cell strainer.\nThe PDOs at R.T. are spun at 500 ×g for 5 min, remove the supernatant.\nOne milliliter of opti-MEM is added. Pipette with 1000 μL pipette well and count the cell number.\nPDOs are washed at R.T. at 500 ×g for 5 min, and the supernatant is removed.\nCells are resuspended at 2×10ˆ6/mL in Opti-MEM.\nTransfection components are prepared, following reagents and volumes.\ntable:files/protocols_protocol_1020_6.csv\nNinety microliters of cell suspension from step 33 are added to the electroporation cuvette.\nCells are electroporated with the following settings.\ntable:files/protocols_protocol_1020_7.csv\nNext, 400 μL of opti-MEM supplemented with 10 μM Y-27632 is added to the electroporation cuvette, and the cells are transferred into a 15 mL centrifuge tube using the plastic pipette provided with the cuvette.\nThe cells are left at R.T. for 30 min.\nA centrifuge tube at R.T. at 500 ×g for 5 min.\nRemove the supernatant and suspend the pellet in 200 μL of Matrigel.\nPlate cells in 25 μL of Matrigel onto each well of a prewarmed 48-well plate.\nThe plate is incubated at 37°C for 10 min to solidify the Matrigel.\nENR medium supplemented with 10 μM of Y-27632 is added.\nNote: The stock solution of Y-27632 (10mM) is stored at −20°C for 6 months and is added to the medium just prior to use.",
    "The cells are incubated at 37°C for 24 h, and the medium is replaced with 250 μL of ENR medium.\nThe medium is changed every 3 days.\nSelection of drug resistant clones\nTiming: 3 weeks\nTo select the transfected cells, we used puromycin at a concentration of 2 μg/mL when using PB-CMV-MCS-EF1a-Puro. Alternatively, neomycin can be used at a concentration of 800 μg/mL when using PB-EF1a-MCS-IRES-NEO.\nThe selection is started by adding a selective agent to the medium starting from day 5 after electroporation.\nThe medium is supplemented with a selective agent every 3–4 days.\nTypically, 2–3 resistant clones appear in each well. The expression of fluorescent proteins can be detected under a stereomicroscope when the expression level of the target gene is high. (Figure 2[href=https://www.wicell.org#fig2]A)\nIsolate the organoids by gentle pipetting using 200 μL of pipette and transfer onto a 100-mm dish. Single organoids were picked up and transferred to each well of a 96-well U-bottom plate (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1020-Fig3.jpg\nFigure 3. Picking up the PDOs\n(A) The organoids were pipetted into 48-well plates, placed on 100-mm dishes, and observed under a stereomicroscope equipped with fluorescent light.\n(B) Using a 200 μL pipette, the EGFP-positive clone was picked up and transferred to a 96-well U-bottom plate.\nAdd 10 μL of Matrigel and incubate the plate in a 37°C incubator for 10 min to solidify the Matrigel.\nAdd 100 μL of ENR medium supplemented with a selective agent.\nEach organoid is cultured in ENR medium supplemented with a selective agent.\nFor passaging, modified PDOs are transferred into 15 mL centrifuge tubes, centrifuged at R.T. for 5 min, and carefully removed the supernatant with a 1 mL pipette.",
    "Then, 50 μL of Matrigel is added to each well, and a 25 μL droplet is placed in each well of a 48-well plate after pipetting well.\nNext, 250 μL of ENR medium is added, and the medium is changed every 3 days.\nTo cryopreserve the PDOs, they are collected using a 1 mL pipette into 15 mL centrifuge cells.\nCritical: PDOs are collected three to four days after passage, during vigorous growth. Overgrowth of PDOs significantly reduces the recovery efficiency.\nThe centrifuge tube is spun R.T. at 500 ×g for 5 min, and the supernatant is carefully removed.\nOne milliliter of Recovery Cell Culture Freezing Medium is added and transferred to 2 mL cryovials.\nThe tubes are stored at −80°C for up to 1 week.\nThe frozen cryovials are transferred to a liquid N2 tank.\nCritical: Longer storage at −80°C significantly reduces the recovery efficiency.\nIsolation of genomic DNA to screen PDO clones\nTiming: 6 hours\nThe clonal populations of PDOs are used for identification of genome editing. Each clone is expanded from single well in 96 well plate to multiple wells of 48 well plate. Typically, six to eight wells of a 48-well plate yield 20–40 μg of genomic DNA, which is sufficient to identify genome-edited clones.\nTo isolate genomic DNA from organoids, the medium is removed from each well.\nAdd 500 μL of cell recovery solution to each well, collect the organoids into a 15 mL centrifuge tube and leave on ice for 30 min with occasional pipetting.\nThe PDOs are spun at R.T. at 500 ×g for 5 min to remove the supernatant.\nOne milliliter of PBS is added, and the PDOs are transferred to a 1.5 mL centrifuge tube.",
    "The PDOs are spun at 4°C for 5 min, and the supernatant is carefully removed using a 1 mL pipette.\nThe PDO pellet is frozen in liquid N2. Frozen samples can be preserved at −80°C until use.\nGenomic DNA is extracted using a QIAamp DNA mini kit following the manufacturer’s instructions.\nSouthern blotting\nGenetic modification can be identified by PCR-based screening. However, HITI-mediated knock-in often causes unintended modification, such as tandem duplicated integration. Southern blotting validates the structure of the targeted alleles and integrations of the donor vectors.\nFor complete details on Southern blotting, please refer to Southern (Southern, 2006[href=https://www.wicell.org#bib5]).\nNext, 30 μL of 10× restriction enzyme buffer is added to 14 μg of DNA in 270 μL of TE.\nGenomic DNA was digested by mixing the reaction following reagents and volumes. Incubated at 37°C overnight.\ntable:files/protocols_protocol_1020_8.csv\nNext, 1 μL of restriction enzyme is added and incubated for an additional 2 h.\n30 μL of 3 M sodium acetate (pH 7.0) and 750 μL of ethanol are added.\nDNA is spun down at 4°C at 15,000 ×g for 30 min, and the supernatant is discarded.\nAdd 700 μL of 70% ethanol, spin DNA down at 4°C at 15,000 × g for 30 min, and carefully discard the supernatant.\nAir dry the pellet by leaving the tube open on the bench for 15 min.\nDissolve the pellet in 10 μL of TE and add 2 μL of 6× loading dye.\nFor a 15 cm × 15 cm gel, 150 mL of 0.7% agarose is prepared in boiling 1× TBE and cooled.\nThe gel is placed in the tank and covered with 1× TBE, and the comb is removed to load the sample.\nRun overnight at 20 V.",
    "The gel is imaged on a UV trans illuminator after staining the gel by adding 6 μL of 10 mg/mL in a 300 mL TBE for 30 min.\nThe gel is transferred to a tray for 15 min with 500 mL of 0.5 N NaOH/1.5 M NaCl, and a second 30 min wash is performed.\nThe gel is rinsed three times with distilled water.\nThe gel is transferred to a tray for 30 min with 500 mL of 1.5 M NaCl/0.5 M Tris-HCl (pH 7.5), and repeat a second 15 min wash.\nThe transfer apparatus is assembled by placing a piece of blotting paper on a glass plate and putting the support inside a large baking dish.\nThe dish is filled with 10× SSC.\nThe Hybond-N+ membrane is soaked in 10× SSC for 5 min.\nThe gel from step 82 is removed and inverted so that it underside is uppermost.\nThe membrane is placed on top of the gel and any bubbles removed.\nTwo thick blotting papers are placed on top of the membrane.\nPaper towels are placed on the blotting papers.\nA glass plate is placed on the top of the stack and weighed to 500 g.\nAllow the transfer of DNA overnight.\nThe paper towels and the blotting paper are removed, the position of the gel slots on the membrane is marked, and the gel is peeled from the membrane.\nthe membrane is soaked in 6× SSC for 5 min and air dried, and DNA is fixed to membrane by UV irradiation (0.12 J/cm2).\nDetection of target allele and inserted fragment",
    "Digoxigenin (DIG)-labeled probes are sensitive enough to detect wild-type and mutant alleles of PDOs. A segment corresponding to the genomic sequence of OLFM4 (hOLFM4 probe) is employed to validate the insertion into the expected site, and that corresponding to the EGFP sequence (EGFP probe) is used to validate the copy number of the donor vector (Figure 4[href=https://www.wicell.org#fig4]). We generally validate the insertion of the donor vector into the OLFM4 locus first and then evaluate the copy number of EGFP after reprobing the first probe.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1020-Fig4.jpg\nFigure 4. Southern blot analysis of HITI-mediated genome editing\n(A) Schematic representation of knock-in of the IRES-EGFP-P2A-iCas9 cassette into the 3′ UTR of the OLFM4 gene. The hOLFM4 probe detected 11.8 kb and 5.1 kb fragments of wild-type and KI alleles, respectively. The EGFP probe identified a 9.4 kb fragment of KI-allele.\n(B) Analysis of 16 puromycin-resistant clones. Five clones contained monoallelic mutation (shown by yellow numbers), and five clones harbored biallelic mutations (shown by red numbers).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1020-Fig5.jpg\nFigure 5. PDOs harboring the IRES-EGFP-P2A-iCas9 fragment in the 3′ UTR of the OLFM4 gene\n(A) Organoids released from Matrigel were incubated with Hoechst 33342 and examined under confocal laser microscopy.\n(B and C) Time-lapse imaging of PDO. PDOs were embedded into Matrigel on glass-bottom plates and cultured for three days with (B) or without AP20147 (C). Note that EGFP expression of PDOs was decreased (B), because OLFM4-postive stem cells reduced their self-replication potential late after passage (Okamoto et al., 2021[href=https://www.wicell.org#bib2]).\nThe DIG-labeled probe is prepared using a PCR DIG Probe Synthesis kit (Roche) following conditions. pCR2.1-hOLFM4 and pCMMP-MCS-IRES-EGFP are used as templates for OLFM4 and EGFP probes, respectively. Probes can be stored at −20°C for at least two months.\ntable:files/protocols_protocol_1020_9.csv",
    "The hybridization buffer (6× SSC, 5× Denhardt’s solution, 100 μg/mL salmon testis DNA, 0.5% SDS, 50% formamide) is prepared and preheated at 42°C.\nMembrane is placed in a plastic bag, into which 250 mL of preheated-hybridization buffer is poured. The bag is sealed and incubated for 1 h.\nTwenty microliters of DIG-labeled probe is placed in a 1.5 mL tube, and 30 μL of ddH2O is added.\nThe probe is denatured by placing it in a heat block heated at 100°C for 5 min and immediately placing on ice for 3 min.\nProbe solution is added into 10 mL of hybridization buffer preheated at 42°C.\nThe prehybridization buffer is replaced with hybridization buffer containing a DIG-labeled probe, the bag is sealed, and hybridization is conducted at 42°C overnight.\nThe membrane is removed and put into a clean plastic tray with a lid.\nThe membrane is washed for 5 min with 0.1% SDS, 2× SSC at R.T. twice.\nThe membrane is washed for 30 min with 0.1% SDS and 2× SSC at 65°C once.\nThe membrane is washed for 5 min with 0.1% SDS, 0.2 × SSC at R.T. once.\nThe probe is detected using a DIG Luminescent Detection Kit (Roche) according to the manufacturer’s instructions.\nTo visualize the signal, the membrane is placed with the DNA facing up on Saran wrap. We use a ChemiDoc XRC plus system (Bio-Rad) for visualization, setting the first image to 30, the last image to 120 and the number of images to 4.\nTo strip the membrane, it is washed with alkaline buffer (0.2 M NaOH, 0.1% SDS) twice for 5 min at R.T., followed by washing with 2× SSC twice.\nThe process from step 94 is repeated to hybridize with the EGFP probe and detect the signal."
  ],
  "subjectAreas": [
    "Organoids",
    "Crispr",
    "Stem Cells",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}