{
  "id": 1038,
  "origin_website": "Nature",
  "title": "Beginner's Guide to THUNDER",
  "procedures": [
    "**JSON Parameter File Preparation**\nThe JSON parameter file contains the parameter of THUNDER, where  typical JSON parameter file is shown as Figure 2. It follows JSON file standard. The meaning of each attribute of the JSON parameter file is listed below.\n _Number of Threads Per Process_\nIt stands the number of threads used in each MPI process. Usually, THUNDER hosts one process in each node, for the purpose of minimizing the usage of memory by sharing memory property of threading. As only one process hosted in each node, occupying all cores of CPU\\(s) in each node is accomplished by threads. This value should be set to the number of cores in each node, in this circumstance.\n_2D or 3D Mode_\nIt stands for whether THUNDER acts in 2D or 3D. This attributes only takes string 2D or 3D, for setting THUNDER in 2D mode or 3D mode, respectively. If the user desires to perform 2D classification, this attribute should be set to 2D. On the other hand, if the user aims to perform 3D refinement or 3D classification, this attribute should be set to 3D.\n \n_Global Search_\nIt stands for whether THUNDER performs global search or not.\n_Local Search_\nIt stands for whether THUNDER performs local search or not.\n_CTF Search_\nIt stands for whether THUNDER refines defocus of each single particle or not.\n_Number of Classes_\nIt stands for the number of classes the user desires that the dataset classified into. For refinement, this attribute is set to 1.\n_Pixel Size \\(Angstrom)_\nIt stands for the size of each pixel in Angstrom.\n_Radius of Mask on Images \\(Angstrom)_\nIt stands for the radius of mask, which will be masked on each single particle image. This attribute should be set to slightly larger than the radius of the targeted macromolecule.",
    "_Estimated Translation \\(Pixel)_\nIt stands for the standard deviation of in-plane translation of single particle images. As the translation is unknown before running THUNDER, this attribute is estimated by the user. Larger this attribute is, the wider THUNDER will search in in-plane translation, the longer computing time will be.\n_Initial Resolution \\(Angstrom)_\nIt stands for the resolution THUNDER starts its iteration. If the user aims to eliminate the bias of initial model, he or she should set this attribute to a low resolution.\n_Perform Global Search Under \\(Angstrom)_\nIt stands for the resolution threshold where search type switches from global search to local search.\n_Symmetry_\nIt stands for symmetry type of the macromolecule. For example, C5 stands for 5-fold rotation symmetry along Z axis; D7 stands for 7-fold rotation symmetry along Z axis and 2-fold rotation symmetry along X axis; T stands for tetrahedral symmetry; O stands of octahedral symmetry; I stands for icosahedral symmetry. If the macromolecule is asymmetrical, it should be set to C1.\n_Initial Mode_\nIt stands for the path where THUNDER reads in the initial model.\n_.thu File Storing Paths and CTFs of Images_\nIt stands for the path where THUNDER reads in the .thu File. If THUNDER starts from global search, the path and CTF information of each single particle image will be read in. If THUNDER starts from local search or CTF search, besides path and CTF information, the rotation and translation information of each single particle image will be read in as well.\n_Prefix of Particles_\nIt stands for a prefix added before the path of each single particle image, in order to help THUNDER find the correct path of image.\n_Prefix of Destination_\nIt stands for a prefix added before the path of output file. It helps THUNDER redirects the output files.",
    "_Calculate FSC Using Core Region_\nIt stands for whether THUNDER calculates FSC of the reference\\(s) masked by a sphere or not.\n_Calculate FSC Using Masked Region_\nIt stands for whether THUNDER calculates FSC of the masked region of the reference\\(s), where the mask is provided by the user.\n_Particle Grading_\nIt stands for whether THUNDER uses particle grading to weight the contribution of each single particle image during reconstruction.\nThe JSON parameter file also contains more parameters. However, those parameters are designed for professional users, as beginners can just use default values. Users can find a full description of parameters in JSON parameter file in THUNDER's website.\n**.thu File Format**\nTHUNDER uses .thu file for inputing and output information of each image, including CTF parameters, classification, rotation, translation, defocus adjustment and grading weight.\n    \n .thu file is a simple space-separate plain text file with .thu as suffix. Each column of it stands for an attribute, as listed below.\n    \n1. voltage of the electron microscope \\(in volt)\n   2. first defocus value defined in CTFFind<sup>1</sup>\n3. second defocus value defined in CTFFind\n  4. theta of defocus defined in CTFFind\n  5. spherical aberration in Angstrom\n  6.amplitude constrast\n7. phase shift in radian\n  8. path of the single particle image\n  9. path of the micrograph which the single particle image belong to\n  10. coordinate X in micrograph\n  11. coordinate Y in micrograph\n  12. group ID\n  13. class ID\n  14. 1st element of the unit quaternion for rotation\n  15. 2nd element of the unit quaternion for rotation\n  16. 3rd element of the unit quaternion for rotation\n  17. 4th element of the unit quaternion for rotation\n  18. 1st standard deviation of rotation\n  19. 2nd standard deviation of rotation\n  20. 3rd standard deviation of rotation\n  21. translation in X\n  22. translation in Y",
    "23. standard deviation of translation in X\n  24. standard deviation of translation in Y\n  25. defocus factor to adjust defocus\n  26. standard deviation of defocus factor\n  27. particle grading score\n  \n**Running THUNDER**\nThe only file THUNDER directly reads in is the JSON parameter file. By parsing it, THUNDER will fetch .thu file for information of each particle and read in the initial model. Further, THUNDER will try to obtain each image by the path described in .thu file. Those files should should be prepared before running THUNDER.\nTHUNDER is a multiple-process software, where at least 3 processes should be assigned for it. Typically, one process should be hosted on each node. Threading is used for occupying all cores in each node.\n    \nMultiple processes should be governed by MPI environment. Users are able to use _mpirun_ or _mpiexec_ tool run MPI jobs of THUNDER. If a job scheduler is available on the cluster, users can entrust it with THUNDER MPI jobs."
  ],
  "subjectAreas": [
    "Structural Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}