{
  "id": 7070,
  "origin_website": "Bio",
  "title": "Analysis of Isotopically-labeled Monogalactosyldiacylglycerol Molecular Species from [<sup>14</sup>C]Acetate-Labeled Tobacco Leaves",
  "procedures": [
    "Sample preparationIsolate MGDG from the leaf lipid extract via normal phase HPLC method using a time based fraction collection method, as disclosed in Zhou et al. (2020), or by thin layer chromatography (Karki et al., 2019).Dry collected MGDG fractions under a gentle N2 stream.Dissolve the isolated MGDG into a small volume (e.g., 25 µl) HPLC grade methanol for analysis via Radio-HPLC. The volume of injection solvent for the sample analysis illustrated in Figure 1 is 10 μl and the total radioactivity per injection is approximately 17,500 Disintegrations Per Minute (DPM). For the analysis of MGDG molecular species, it is ideal to have at least 5,000 DPM of total MGDG radioactivity per injection of a minimal volume of solvent into the HPLC.Transfer the MGDG in methanol to an autosampler vial with a small volume insert for HPLC analysis. Spring bottom inserts are ideal for small volumes (10-100 µl) where nearly the entire sample may be injected.Reverse phase Radio HPLC-14C MGDG molecular species analysisPower on the HPLC modules; pump, autosampler, multi column compartment, Ultra Violet Diode-Array Detector (UV-DAD), and flow radio detector.The HPLC parameters and the online liquid scintillation counter are both controlled by the LabLogic Laura software.Set up the sequence in Laura with a blank methanol as the first sample in the sequence. Allow the column to equilibrate for 20 min prior to the start of analysis. Since the method uses isocratic conditions, column equilibration is not necessary between each sample.Once the sequence is saved, the method for the analysis will be loaded. The method conditions for the HPLC analysis are as described below:Quaternary Pump: Solvent A: Methanol and Solvent B: Water. The method uses Isocratic elution with mobile phase–95%A/5%B. The flow is set at 0.35 ml/min and the run time is 35 min.",
    "Autosampler: Autosampler temperature is set at 20 °C. Sample Injection solvent: Methanol. Set the injector settings in the method to as follows: Needle Draw Speed–200 μl/min, Needle eject Speed–400 μl/min, Wait Time after draw–1.2 s.Multi Column Compartment: The temperature of the column compartment is set at 35 °C. The mobile phase is allowed to pass through a Quick-Connect Heat Exchanger prior to entering the column. A short 10 mm guard column containing same material as that of the stationary phase is installed immediately prior to the analytical column.UV-DAD: Direct the flow of eluate from the column to UV-DAD. UV absorption at 210 nm will provide retention times of the molecular species containing unsaturated acyl chains with significant mass abundance in the sample as illustrated in Figure 1A and the original research paper (Zhou et al., 2020), Supplementary Figure S4A.β-Ram 6 Radio Detector: Direct the eluate from UV-DAD to the radio detector. Set the type of analysis to Non-Stop Radio HPLC. The radio detector is equipped with a 500 μl adjustable volume flow cell that facilitates the radio counting process. Set the flow cell volume to 300 μl. Prior to entering the flow cell, the eluate from the UV-DAD is mixed with the scintillation cocktail whose flow is controlled by a scintillant pump. Set the scintillant flow to 1.05 ml/min (a 1:3 for eluate:scintillation cocktail ratio). The resulting residence time in the flow cell for these flow settings is 12.9 s. The recommended residence time for flow counting is above 5 s. The eluate mixed with scintillant from the radio detector is directed to the properly labeled radioactive HPLC waste container secured in a secondary waste container.",
    "In the method, adjust the detector settings of Radio 1 channel as follows: Measurement units–CPM, Dwell Time–1 s, Shift Time–0 s, Lower Limit–200, Upper Limit–9000.After the HPLC data acquisition is completed, proceed to data analysis.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3864/bioprotoc-10-24-3864-g001.jpgFigure 1. HPLC Analysis-MGDG molecular species from wild type tobacco leaves continuously labeled with [14C]acetate for 2 h. A. UV chromatogram at 210 nm. B. radioactivity in counts per minute (CPM). Identities of individual molecular species from B are as follows: 1-18:3/16:3, 2-18:3/16:2>18:2/16:3, 3-18:3/18:3, 4-18:2/16:2>18:3/16:1, 5-18:3/18:2, 6-18:2/16:1, 7-18:3/16:0>18:2:18:2, 8-18:3/18:1, 9-18:2/18:1, 10-18:2/16:0, 11-18:1/16:0. Figure reproduced from Zhou, X. R., Bhandari, S., Johnson, B. S., Kotapati, H. K., Allen, D. K., Vanhercke, T. and Bates, P. D. (2020). Reorganization of acyl flux through the lipid metabolic network in oil-accumulating tobacco leaves.[href=https://www.ncbi.nlm.nih.gov/pubmed/31792147]Plant Physiol 182(2): 739-755. www.plantphysiol.org[href=http://www.plantphysiol.org]. “Copyright American Society of Plant Biologists”."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}