{
  "id": 7548,
  "origin_website": "Bio",
  "title": "CD8 T Cell Virus Inhibition Assay Protocol",
  "procedures": [
    "Note: All procedures were performed in a BSL2+ space under a BSC sterile environment.  Day 0: Thaw PBMCs for CD4+ T cell targets  Make up 25 units/mL Benzonase in R-10+ and warm this solution in a 37°C incubator. Prepare ~10 mL per vial (1 mL) of frozen PBMCs, to wash off the DMSO.Rapidly thaw PBMCs in a 37°C water bath, then transfer cell contents into prewarmed R10+ with benzonase (25 unit/mL) (1 vial into 10 mL), wash three times with R-10+ by spinning at for at 500 × g and room temperature (RT) for 5 min, and count. Resuspend at 2 × 106 cells/mL in R-20+ and place in a 37°C humidified CO2 incubator overnight. See Figure 1 for the procedure on day 0, and see Table 1 for PBMC requirements.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4354/bioprotoc-12-06-4354-g001.jpgFigure 1. Procedure for Day 0 Table 1. PBMC estimates for VIAa table:\n﻿0,1,2\nVIA PBMC requirements b,1 timepoint,4 timepointsc\nTargets,107,3–4 ×107\nEffectors (2:1),107,107/timepoint",
    "aEstimates based on JRCSF infection ranging 1–10% and PBMC viability >85%, Using 0.1 × 106 CD4+ T cells per replicate, total 4–6 replicates.bAssume 6 CD4-HIV and 6 CD4-HIV:CD8 co-cultures and 1 uninfected control.cOne set of CD4-HIV-only and 1 uninfected CD4 control will be used for calculations of percentage of inhibition across multiple timepoints.Notes:  Benzonase decreases cell clumping, improving cell recovery. Negative Isolation of CD4+ T cells produced lower non-specific virus inhibition in HIV-negative donors than assays performed with CD8-depleted PBMC.  Day 1: Isolate CD4+ T cell targets  Negatively isolate CD4+ T cells from thawed PBMCs using MACS beads as per manufacturer’s instructions. A typical isolation provides >96% CD4+ T cell purity.Count and suspend cells at 2 × 106/mL in R-10+ media containing IL-2 (20 IU/mL), IL-7 (5 ng/mL), and either 5 μg/mL PHA (PLWH ± ART) or 3 μg/mL (HIV seronegative donor). See Figure 2 for the procedure on day 1.Plate the cells as listed, and culture for 72 ± 3 h in a 37°C incubator with 5% CO2:5 × 106 cells/well in 6-well plate (in 2.5–3.0 mL/well)3 × 106 cells/well in 12-well plate (in 1.5–2.0 mL/well)<1.5 × 106 cells/well in 24- or 48-well plates (in 1.0–1.5 mL/well)imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4354/bioprotoc-12-06-4354-g002.jpgFigure 2. Procedure for Day 1 Notes:   VIA assays using CD8-depleted PBMC result in higher infectivity (%p24+ cells) in our hands. However, CD4+ T cells are recommended over CD8-depleted PBMCs because of improved assay reproducibility, possibly due to the exclusion of CD56+ NK cells, and more consistent CD4:CD8 T cell ratios.   IL-2+IL-7 results in higher %p24+ infection, possibly due to IL-7-mediated increase of CCR5 expression on CD4+ T cells (Llano et al., 2001).   Final CD4+ T cell concentrations can be 1–2 × 106 depending on volume capacity in each well.",
    "Generally, the cell recovery after 72 h (Day 4) stimulation ranges between 70–120% of the input cells, and viability ranges between 70–90%.  Different PHA concentrations are used because PHA >3 μg/mL in seronegative donors results in significant cell loss. Cell loss following >3 μg/mL PHA stimulation is also observed in HIV+ donors, but the 5 μg /mL stimulation improves HIV %infection.  Day 3: Thaw PBMCs for CD8+ T cell effectors  Make 25 unit/mL Benzonase in R-10+ and warm in a 37°C incubator.Rapidly thaw PBMCs in a 37°C water bath, then transfer cell contents to prewarmed R-10+ with benzonase (25 unit/mL), wash three times with R-10+ by spinning at 500 × g and RT for 5 min, and count. Resuspend in 2 × 106/mL in R-20+ and place in a 37°C, humidified CO2 incubator overnight. See Table 1 for PBMC needs. Day 4: HIV infection of target CD4+ T cells  After 72 ± 3 h stimulation with PHA, harvest mitogen activated CD4+ targets from wells using a sterile disposable pipette, and wash three times with >10 mL of R-10+ to remove PHA in culture.Count cells and resuspend to 107 cells/mL in a 15 mL Falcon tube in R-10+ supplemented with IL-2 at 20 IU/mL.Note: Generally, the cell recovery after 72 h (Day 4) stimulation ranged between 70–120% of the input cells, and viability ranged between 70–90%. Transfer 105 cells to a flow cytometry tube for use as uninfected control.Infect the remaining CD4+ T cells with HIV-1JRCSF (final MOI of 0.03).Supplement R-10+ with IL-2 at 20 IU/mL and Polybrene at 8 μg /mL.Dilute the virus stock in Polybrene/IL-2/R-10+ media to a 2× final concentration.Add an equal volume of 2× virus to CD4+ targets, resulting in a final cell concentration of 5 × 106/mL.",
    "Do not exceed more than 2 × 106 cells per 15 mL Falcon tube (0.4 mL).Spin-oculate at 1,200 × g and 27°C for 2 h with brake.Following spin-oculation, wash three times with R-10+ to remove residual virus and polybrene.Count and resuspend cells at 1 × 106/ mL, by adding R-10+ supplemented with IL-2 at 20 IU/mL.Notes:   Counting accuracy is critical in this step, for ensuring the correct ratio of CD4+ targets to CD8+ effectors. Counting in triplicates is recommended with a coefficient of variance (CV) <10%.  Addition of polybrene increases JRCSF infection by up to three fold, but does not improve NL4.3 infection.  Day 4: Prepare CD8+ T cells effectors  While CD4+ T cells are spin-oculating, isolate CD8+ T cells from rested overnight PBMCs using CD8+ MACs microbeads (positive selection), following the manufacturer’s instructions.Count and resuspend isolated CD8+ T cells at 2 × 106/mL in R-10+ with IL-2 at 20 IU/mL. Note: Again, counting accuracy is critical in this step for ensuring correct ratio of CD4+ targets to CD8+ effectors. Counting in triplicates and a CV <10% is recommended.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4354/bioprotoc-12-06-4354-g003.jpgFigure 3. Procedure for Day 4 Day 4: Effector: Target co-cultures Cell numbers permitting, set up the following labeled flow cytometry tubes:6 tubes containing 105 CD4+ targets (100 μL) + 100 μL R-10+6 tube containing 105 CD4+ targets (100 μL) + 2 × 105 (100 μL) CD8+ T cell effectors1 tube containing 105 uninfected CD4+ cells (100 μL) + 100 μL R-10+Place co-cultures in a 37°C, humidified CO2 incubator 3 days. See Figure 3 for the procedure on day 4.Notes:   To minimize the variation, CD8+ and CD4+ T cells were first combined 2:1, and then divided across flow cytometry tubes in a total volume of 200 µL/tube, containing 3 × 105 cells.",
    "This is day 0 of HIV-1 JRCSF super-infection and effector target co-culture. Peak of infection (p24%) is at day 3. If using different E:T ratios, adjust accordingly. We recommend ensuring the final culture volume across all tubes is kept consistent.  Sterile flow cytometry tubes are recommended over 48- and 96-well plates for cultures containing 1–3 × 105 cells because of better infectivity, less cell loss, and time savings.  Day 7: Intracellular HIV-specific p24 staining protocol Notes:   Peak %p24+ cells are observed 3 days post-infection (data not shown).  Cell cultures are directly stained in the same flow cytometry tubes. We recommend using printed labels for flow tubes (not handwritten). Table 2. Samples/controls for p24 staining table:",
    "﻿Tube,Detail,Replicates\nLive Dead control,\"Heat-kill cells in a 70°C water bath, for 10 min\",1\nControls,CD4 FMO recommended as infection decreases CD4 expression,1\n,Non-stained control,1\nTest Samples,Uninfected control CD4-onlya,1\n,Infected CD4+ targets,6b\n,Co-culture: Infected CD4+ targets + Effector CD8+,6b",
    "a Used to define p24+ gate; in PLWH, this control is also critical to examine endogenous viral replication. In untreated HIV infection, replicates should be considered.b See main manuscript text (Xu et al., 2021; DOI: 10.3389/fimmu.2021.666991[href=https://doi.org/10.3389/fimmu.2021.666991]) for further details on calculation of replicate number.Spin cells down at 500 × g and RT for 5 min.Wash cells with 2 mL of PBS, spin cells down at 500 × g and RT for 5 min, and resuspend cells in 100 μL of PBS.Add 0.2 μL of Zombie NIRTM. Wrap the tube with foil and incubate for 20–30 min at RT.During this incubationBring lysolecithin fixative to RT.Prepare an ice bucket.Bring centrifuge temperature to 4°C.Add 2 mL of PBS per tube and centrifuge at 500 × g and RT for 5 min. Decant excess supernatant onto a paper towel.Fix cells by adding 1 mL of 20 μg/mL lysolecithin in 4% paraformaldehyde.Vortex. Incubate for 2 min at RT.Centrifuge at 500 × g and 4°C for 5 min. Decant or aspirate supernatant. Vortex.Add 1 mL of cold 50% methanol (-10 to -20°C).Vortex. Incubate on ice for 15 min.Centrifuge at 500 × g and 4°C for 5 min. Decant or aspirate supernatant. Vortex.Add 1 mL of 0.1% NP-40 (2–8°C).Vortex vigorously. Incubate on ice for 5 min.Centrifuge at 500 × g and 4°C for 5 min. Decant or aspirate supernatant. Vortex.Make up an antibody mastermix. Per tube, add 2 μL each of p24 (5 μg/mL), CD3 (2 μg/mL), CD4 (2 μg/mL), and CD8 (2 μg/mL) antibodies.Add antibody mastermix to tubes and vortex. Incubate at RT for 15 min .Add 2 mL of PBS. Centrifuge at 500 × g and RT for 5 min. Decant or aspirate supernatant. Vortex.Prepare compensation controls for each fluorochrome.Acquire on a flow cytometer within 6 h. See Figure 4 For the gating scheme.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4354/bioprotoc-12-06-4354-g004.",
    "jpgFigure 4. Gating Scheme. The frequency of infected CD4+ T cells was defined as the percentage of HIV-1 p24+ cells among live single CD3+ CD8- lymphocytes, using the uninfected CD4+ cell culture that had a p24+ frequency <0.1 across all assays.Notes:  An acquisition rate <1,000 events/sec is recommended, given the low frequency of events.  Set CD4+ >20,000 events or %p24 >500 events in CD4+ target alone as criteria (Xu et al., 2021)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}