{
  "id": 7537,
  "origin_website": "Bio",
  "title": "Labeling Endogenous Proteins Using CRISPR-mediated Insertion of Exon (CRISPIE)",
  "procedures": [
    "Cas9 sgRNA design using CRISPickThe first CRISPIE plasmid needed is a Cas9 expression plasmid that also expresses the target-specific sgRNA. This allows the targeted genomic location to be specifically cut by Cas9. After designing the sgRNA in silico, it will be incorporated into the blank Cas9-sgRNA expression vector pX330 (Addgene #42230).To select an sgRNA targeting sequence, we use Broad Institute CRISPick (https://portals.broadinstitute.org/gppx/crispick/public[href=https://portals.broadinstitute.org/gppx/crispick/public]; note that other sgRNA design websites/software may also work).On the starting page, select the desired reference genome, CRISPR mechanism, and origin species of the Cas9 enzyme (Figure 1).Note: In our protocol, we use the ‘’Human GRCh38’ reference genome, CRISPRko, and SpyoCas9.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4343/bioprotoc-12-05-4343-g001.jpgFigure 1. Specifying CRISPick parameters used in CRISPIE. Click ‘bulk mode’ and paste the target sequence into the ‘Target(s)’ box, or reference the target using the accepted target formats listed on the website.Bulk mode allows one to paste in large/multiple target sequences (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4343/bioprotoc-12-05-4343-g002.jpgFigure 2. Pasting target sequence (FASTA format) into the bulk mode input box. We recommend creating SnapGene files containing the target sequence with annotated sgRNA binding sites. This is especially useful when designing multiple sgRNAs to screen, and when analyzing the final insertion sequences.Include an additional ~200 bp of sequence to both the 5’ and 3’ end of the target sequence, to ensure all sgRNA options are considered.A target sequence needs to be located within the intron of a gene. The inherent advantage of CRISPIE is that INDELs at the insertion junction within the intronic region are spliced out, which is not possible when the INDELs are located within an exon. When targeting introns of a gene, it is important to choose an intron that won’t disrupt the structure of a protein after a donor module is introduced. N- and C-terminal labels are incorporated into the first or last intron of a gene, respectively.",
    "If a large stretch of coding sequence is present in the first exon of a gene, CRISPIE would have difficulty tagging its N terminus. Targeting within the gene or at the C terminus can be used as alternatives. In addition, in order to label a gene of interest at the very C-terminus, the coding sequence of the last exon of a gene needs to be included in the donor module. These are the constraints that need to be considered using CRISPIE. However, the sequence that needs to be included for CRISPIE is typically much shorter than those for HDR-based insertions.Select the desired ‘CRISPick Quota’.Note: If one wishes to manually select the desired sgRNAs from the output, skip this step. Otherwise, this tool uses an algorithm to recommend the top sgRNAs based on the standard criteria, such as off target effects, cut positions, etc.Check the box ‘report unpicked sequences?’ (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4343/bioprotoc-12-05-4343-g003.jpgFigure 3. Specifying the number of potential sgRNA sites by setting the CRISPick Quota. Check “Report unpicked sequences” in order to have a file of all potential sgRNAs and their characteristics (as determined by the CRISPick algorithm).After the output is displayed, download the desired files:‘Picking Results’ displays the best sgRNAs according to the ‘CRISPick Quota’ algorithm.‘Picking Summary’ provides a comprehensive list of possible sgRNAs in a table format with relevant sgRNA information.‘Input Target Sequence’ contains the input file you used, for your records.Note that if the selected sequence will be incorporated into the donor plasmid (for excising the module so it can be inserted into the targeted genomic region), it may be desirable to include the ‘context sequence’ (also listed in the Picking Results). The context sequence is the set of sequences surrounding the sgRNA-targeted sequence that may affect Cas9 binding and the endonuclease activity at the target sequence (Figure 4).",
    "imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4343/bioprotoc-12-05-4343-g004.jpgFigure 4. An example sgRNA target sequence including its context sequence. We have empirically found that the specific context sequences shown in the figure give high Azimuth scores based on CRISPick.Using a DNA design software (we use SnapGene), create a file with the desired gene of interest to be edited using CRISPIE. Annotate the target sites in the target gene.In silico construction of Cas9-containing plasmidSelect the sgRNA sequence chosen from CRISPick (or other sgRNA design software).To incorporate the sgRNA into the pX330 plasmid via the built-in BbsI site, add the 4 bp sequence: CACC to the 5’ end of the Forward oligo and AAAC to the 5’ end of the Reverse oligo.This is necessary to create compatible overhangs for directional cloning of the oligos into the BbsI-digested pX330 vector.Additionally, if the sgRNA does not start with a G, add a G at the 5’ end of the sgRNA, which is required for transcription initiation by the U6 promotor. An example is provided below for clarity (Figure 5B).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4343/bioprotoc-12-05-4343-g005.jpgFigure 5. In silico design of sgRNAs. (A) Schematic of the human β-actin gene with exons numbered 1–6. The red bar indicates the approximate targeting site of the CRISPIE sgRNA. The coding sequence of ACTB is highlighted in orange. (B) shows both the forward and reverse primer sequences for cloning the sgRNA plasmid targeting intron 1 of human ACTB. The sgRNA sequences (black, lower-case letters), adjacent sequences for ligating into the target vector (blue capitalized letters), and the transcription initiating G (magenta) are differentially highlighted. The lower panel shows the annealed primers, which will be ligated into the pX330 vector.Cloning the sgRNA sequence into pX330Digestion, dephosphorylation, and purification of the vectorDigest pX330 (Addgene #42230) in a 25 μL reaction at 37°C for 3 h or overnight:table:",
    "﻿0,1\npX330,~3 μg\n10× NEB Cut Smart buffer,2.5 μL\nBbsI-HF,1 μL (20 units)\nMolecular-grade water,Bring to 25 μL\nAfter digestion, add 0.6 μL of calf intestinal phosphatase (CIP) and incubate at 37°C for 30 min.Purify the digested plasmid. We typically use the Qiaquick purification kit.Note: We recommend the HF version of BbsI. The non-HF version may lose potency over time if stored at -20°C. Phosphorylation and annealing of sgRNA oligosSet up the following reaction in a PCR tube, so the polynucleotide kinase (PNK) reaction and annealing can both be performed in one step in a thermocycler:table:\n﻿0,1\nForward sgRNA Oligo (100 µM stock),1 μL\nReverse sgRNA Oligo (100 µM stock),1 μL\n10× T4 DNA Ligase Buffer,2 μL\nMolecular-grade water,15.5 μL\nPNK,0.6 μL\nTotal,20 μL\nCarry out the following reaction protocol:table:\n﻿Cycle,Notes\n37°C for 30 min,PNK reaction\n95°C for 5.5 min,Inactivate PNK and denature oligos\n-1°C every 30 s for 70 cycles,Anneal oligos\nHold at 4°C,\nDilute 2 μL of the annealing reaction in 198 μL of molecular-grade water for use in the ligation.Ligation of annealed oligos into the digested pX330 vectorUsing the NEB Quick Ligation kit, create the following reactions and incubate at room temperature for 25 min:table:\n﻿0,1,2\n,Vector + Ligase Control,Insert + Vector\nNEB 2× Quick Ligase Buffer,5.5 μL,5.5 μL\n\"Digested, dephosphorylated pX330\",1.2 μL,1.2 μL\n1:100 diluted annealing reaction,–,3.8 µL\nMolecular-grade water,3.8 µL,–\nNEB Quick Ligase,0.5 μL,0.5 μL",
    "Transformation and amplification of DH5α cells with ligated plasmid using standard protocols.We use home-made DH5α competent cells. With all tubes pre-chilled on ice, add 1–2 μL of ligation reaction (above) to 30 μL of DH5α cells. Leave on ice 20–30 min. Incubate tubes in a water bath at 42°C for exactly 1 min, then immediately place on ice for 5 min. Add 300 μL of SOC medium and incubate the tubes at 37°C shaking at 250 rpm for 1 h. Plate ~200 μL of the transformation reaction on LB agar plates (50 μg/mL Carbenicillin) and spread with glass beads. Incubate overnight at 37°C.Select colonies to be amplified using the desired miniprep technique (e.g., Qiagen Miniprep Kit).Sequence the miniprepped plasmid to check for the proper insertion of the sgRNA. Our lab uses Azenta Life Sciences (previously Genewiz) sanger sequencing services.Selecting CRISPIE Donor Plasmid and Transfection MarkerThe choice of which CRISPIE donor to select from the Addgene repository depends on the translational reading frame of the exons flanking the targeted intron. RNA splicing can occur both between and within individual codons of a gene. Exons have splice sites that can be located before the first, second, or third base of a codon (notated as 0, 1, and 2, respectively; Figure 6).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4343/bioprotoc-12-05-4343-g006.jpgFigure 6. Reading frame of exons. The three possible splice junctions in terms of translational phases between two exons are shown. Each triplet codon is underlined, with the dotted underline representing a codon spanning across an intron.It is important to select a donor module that matches the reading frame of the inserted intron. Depending on the target site, one would need either a 0-0, 1-1, or 2-2 translational phase donor exon. In the case of ACTB, the start codon resides on exon 2 in the first (0) reading frame.",
    "Therefore, the 0-0 donor module is the desired plasmid for intron 1 of ACTB.Addgene #172848 (Donor B7) contains a mEGFP with 0-0 translational phaseAddgene #172849 (Donor B8) contains a mEGFP with 1-1 translational phaseAddgene #172850 (Donor B9) contains a mEGFP with 2-2 translational phaseThe donor plasmids listed above are self-excising plasmids: they express a designed sgRNA whose target site flanks the donor module within the same plasmid. However, we have empirically found that a donor module flanked by sgRNA sites identical to the genomic editing site, but positioned in an inverse orientation, gives a ~50–100% higher labeling efficiency compared to the generic donors. Presumably, this is in part because the target-specific sequence, when positioned in an inverse direction, can facilitate the insertion of donor in the forward direction, thus increasing the rate of successful editing (Figure 7).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4343/bioprotoc-12-05-4343-g007.jpgFigure 7. Opposite orientations of the sgRNA target site at the genomic locus and the donor facilitate the donor insertion in the forward orientation. After Cas9 creates a double-stranded break in genomic locus, the donor module can be inserted in either the forward or reverse orientation. Since the sgRNA sites flanking the donor module are in the opposite orientation relative to the sgRNA site at the genomic locus, forward insertion of the donor module destroys both sgRNA sites flanking the donor, resulting in a stable insertion. Inserting the donor in the reverse orientation creates functional sgRNA sites that can be subjected to further Cas9 cleavage, thus creating an unstable insertion (unless INDELs have occurred at the insertion junctions). The sgRNA binding sites are shown in purple, with the Cas9 cut site represented as the thin white line between the purple rectangle and triangle. The white arrow within the donor module represents the orientation of the donor module.",
    "Addgene #172842 is a mEGFP donor specific for the first exon of ACTB for the sgRNA shown in Figure 2.The original donor plasmids were generated by gene synthesis (using Azenta Life Sciences, formerly Genewiz).Other target-specific donor modules can be generated by replacing the current sgRNA targeting site of a donor plasmid with the appropriate target specific sgRNA sequence, including PAM and context sequences, using the available restriction enzyme sites. In this way, researchers can target intronic locations of other genes. Donors with different tags, such as different fluorescent proteins (FPs), can be generated by replacing the FP from existing donors.The donor sequence include the tag-encoding exon flanked by important adjacent sequences needed for splicing and donor excision from the plasmid (Figure 8).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4343/bioprotoc-12-05-4343-g008.jpgFigure 8. The 5’ to 3’ sequence of a representative CRISPIE donor module. Sequence of Donor B1 (Addgene#172842; phase 0-0) is shown. Capitalized case letters: exonic sequence; lower case letters: intronic sequence; yellow: intronic sequence from the intron 17 of mouse CaMKIIα (Camk2a); underlined: exonic sequence adjacent to Camk2a intron 17; purple: sgRNA targeting site; green: EGFP. Note, only the exonic sequence will be integrated into the final mRNA.We also use an mRuby expression vector (Addgene #172854) as the transfection marker. Other transfection markers should be characterized and optimized before incorporation into the CRISPIE procedure.U-2 OS Lipofectamine 2000 TransfectionCulture U-2 OS cells in McCoy’s 5A medium (10% FBS). Set the incubator to 37°C and 5% CO2. The cells should be passaged every 2-3 days, when they are at ~90% confluency.Twenty-four hours prior to transfection, seed ~1.25 × 105 cells in a 35 mm culture dish containing 2 mL of McCoy’s 5A medium (10% FBS) and let attach overnight. Swirl cells clockwise five times, anti-clockwise five times, up and down five times, and left and right five times.",
    "This ensures an even coating of cells on the bottom of the dish. We do not use antibiotics, although we have not tested whether antibiotics may affect cell growth or labeling efficiency.Before beginning transfection, ensure that the cells are 30–50% confluent. Growth outside this range could reduce transfection efficiency.For each transfection reaction, combine 5 µL of Lipofectamine 2000 with 145 µL of Opti-MEM medium. Mix thoroughly by vortexing. Incubate the mixture at room temperature for 5 min.Note: Create a master mix when performing multiple transfections. According to the manufacture’s protocol, the incubation time for this lipofectamine 2000/Opti-MEM master mix can be up to 20 min.For each transfection reaction, combine 0.2 μg of the transfection marker (mRuby3; acquired from Addgene), 1.0 μg of the sgRNA/Cas9 plasmid (created in Procedure A–C above), and 1.0 μg of the donor module-containing plasmid (acquired from Addgene) in 150 µL of Opti-MEM into a separate tube. Negative controls can be made by excluding either the sgRNA/Cas9 plasmid or the donor module-containing plasmid from the reaction.Note: It is important to only use trace amounts (0.2 μg) of the transfection marker to prevent masking of the fluorescence from the GFP-labeled cells by the transfection marker. Most red fluorescent proteins, including mRuby3, have bleed-through in the green channels, in part due to the bifurcating maturation of the fluorophore. At the same time, fluorescent signals of endogenously labeled proteins are often dim, and therefore can be easily obscured by the bleed-throughs from highly expressed red fluorescent proteins. After the 5 min lipofectamine/Opti-MEM incubation is complete, combine this mix with the DNA/Opti-MEM mixture, then thoroughly pipette up and down and vortex to mix. Incubate at room temperature for 20 min. Thorough mixing is important for optimal transfection efficiency.",
    "Allocate each transfection mixture (300 µL) to a 35 mm dish containing U-2 OS cells that were passaged 24 h prior.Five and a half hours post-transfection, carefully aspirate off the transfection medium and add 2 mL of warmed McCoy’s 5A medium (10% FBS) to each dish. Incubate at 37°C an 5.0% CO2 for 30 min.Note: Pay attention to suction and add medium from the side of the dish to minimize perturbation of the cells at the bottom of the dish. Suction off media, add 2 mL of pre-warmed McCoy’s 5A medium (10% FBS) to the cells, and place them in the incubator set at 37°C and 5.0% CO2.Note: These washing steps are essential because prolonged exposure to lipofectamine 2000 impairs U-2 OS cell health. Protein expression can be assessed at 72 h post-transfection.U-2 OS cell counting used to determine transfection efficiency.Using a brightfield view at 100× magnification (a 10× air objective [0.3 NA] and 10× eyepieces), pick a region of cells that have regular, evenly spread growth.Once the field of view (FOV) is found, zero the X and Y directions and switch to 400× magnification (40× water immersion objective [0.8 NA] and 10× eyepieces).Switch to the red FP (RFP) filter and count any cells expressing mRuby. While still in the same FOV, switch to the GFP filter. Count the cells expressing GFP.Note: We use an Olympus BW51XI upright microscope. However, most standard fluorescence microscopes with GFP and RFP filtersets (e.g., Chroma ET49002 and ET49005) should work. It is important to only count cells that have GFP labeling of the desired protein. In the case of actin, filaments of GFP-actin should be clearly visible (see Figure 9); avoid counting cells that have non-specific GFP fluorescence (e.g.",
    ", fluorescence permeating the whole cell), which occasionally happens, possibly due to finite specificity of the Cas9 editing. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4343/bioprotoc-12-05-4343-g009.jpgFigure 9. Example of successfully labeled U-2 OS cell. Note the GFP-labeled actin filaments and the absence of GFP in the nuclei. Only count cells that have GFP fluorescence in accordance with the characteristic morphological distribution of the labeled protein.Repeat this counting method for 12 FOV, using a pre-determined, raster pattern that is consistent across all samples. To reduce variations, we omit any FOV with <10 mRuby positive cells, and replace it with additional, pre-determined FOVs.These cells can be imaged live or fixed, using available epi, confocal, or two-photon fluorescence microscopes.Labeling efficiency is calculated by the number of successfully labeled cells (in the example, green) divided by the total number of transfected cells (red) in an FOV.If determination of the labeling efficiency of each gene locus is needed, it can be derived from the labeling efficiency and the copy of target sites per cell using the equation below, assuming that the editing of each locus is an independent event.Cell labeling efficiency = 1 – (1 – allele labeling efficiency)copy number Assessment of the accuracy of CRISPIE editing in the genome can be achieved through multiple avenues. We typically use next generation sequencing (NGS). The genomic DNA and mRNA of GFP-positive cells are enriched by Fluorescence-Activated Cell Sorting (FACS) and subjected to RT-PCR and PCR, respectively, using the appropriate primers to detect the insertion junctions. Where needed, nested PCR can be used to increase specificity. The PCR amplicons are then sent for NGS (we uses Azenta Life Sciences, formerly known as Genewiz). As shown in the original publication (Zhong et al, 2021), the typical result is that INDELs are abundantly present in genomic DNA sequences, but are largely absent in mRNA sequences.",
    "The primer pairs should straddle a span of ~2–300 bp at both the 5’ and 3’ insertion junctions of the donor module. This ensures that the PCR will detect relatively large insertions and deletions.Our lab uses custom MATLAB codes to align sequences and identify editing outcomes. However, this can be done by using available software packages, or by collaborating with NGS experts."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}