{
  "id": 13389,
  "origin_website": "Jove",
  "title": "Caenorhabditis Sieve: A Low-tech Instrument and Methodology for Sorting Small Multicellular Organisms",
  "procedures": [
    "1. Caenorhabditis Sieve Construction and Use\nConstruction protocol\nAcquire 2 lids from 50 mL conical tubes (Figure 1A).\nRemove the center area inside the inner lip of the lids (when viewed from the bottom, Figure 1B) using a Bunsen burner and a hot metal probe or a soldering iron or stepped drill bit.\n\t\tNOTE: Using heat to cut the plastic lid is preferable to a blade because there is less risk of injury.\nClean and sand the cut edges and top the surface with a curved file or a rotary grinding tool (e.g., Dremel). See Figure 1C.\nCut the circle of the monofilament mesh to the appropriate diameter (Figure 1D). For this, trace a lid onto a monofilament nylon mesh sheet and cut just inside the line drawn.\nCut grooves/slashes into the top surface of the lids to enhance the adhesion of the two lids when glue is applied to the plastic (Figure 1E).\nClean the lids with ethanol and let them dry.\nApply cyanoacrylate glue to the top surface of both lids, keeping to the outer edge.\n\t\tNOTE: A little glue goes a long way.\nLay the monofilament mesh, according to Table 1, on one glued lid (Figure 1F). Place the second lid inverted on top of the mesh; both lids must have their tops together. Press firmly together (Figure 1G). Ensure that the mesh is taut.\n\t\tNOTE: As a safety measure, use tweezers to place the mesh on the lids.\nOnce the initial layer of glue has dried, apply a ring of cyanoacrylate glue around the outer gap between the lids. Be generous as this adds integrity and prevents any peeling apart or leaking.\nLabel the filter with the mesh pore size of the monofilament mesh.\n\t\tNOTE: Here, we use two mesh pore sizes—20 µm and 50 µm.",
    "Use protocol\nPre-wet the sieve.\n\t\t\nPipette a saline solution, such as M9 [5 g of NaCl, 6 g of Na2HPO4, 3 g of KH2PO4, 1 L of ultrapure H2O, and 1 mL of MgSO4 (1 M)]17, through the center of the sieve until a droplet forms, condenses, and drips off the center of the filter bottom (Figure 2A). Optionally, apply a lint-free wipe (e.g., Kimwipe) to the bottom to shape or spread a moisture droplet on the mesh.\nPlace the sieve over a 50 mL conical tube. Label the tube as 'Waste tube' (Figure 2B).\nWash a population of C. elegans off an agar plate.\n\t\t\nWash the plate with the M9 buffer and place the worm-containing medium on the topside of the monofilament mesh 1 mL at a time (Figure 2C). Make sure to operate in the center of the mesh. Wash all worms from the plate.\n\t\t\tNOTE: Typically, 3 mL of M9 for a 60 mm plate is sufficient.\nTo minimize the number of worms lost in pipetting, use a glass Pasteur pipette to move the worms off the plate and onto the mesh center (repeat as needed).\nRinse the filter with the M9 buffer from the top. Again, make sure to operate in the center of the mesh and rinse all worms in that area. Wash as many times as necessary to ensure that all the bacteria and smaller worms have passed through the mesh.\nHarvest the size-matched animals from the sieve.\n\t\t\nAttach a new 50 mL conical tube to the top of the sieve, with the adult worms from step 1.2.2.3 facing the inside of the new collection tube (Figure 2D).\nRemove the first tube (waste tube) and quickly flip over the sieve and new tube to keep the droplet from migrating (Figure 2E).",
    "NOTE: If sterility is not required, use a lint-free wipe (e.g., Kimwipe) to wick fluid from bottom of the mesh prior to flipping.\nRinse the mesh with M9 into the new 50 mL tube from the new topside (Figure 2F). Again, operate in the mesh center and maintain a droplet on the underside of the mesh.\nAllow the worms to settle or gently spin them down (e.g., <16 x g) for approximately 1 min (Figure 2G).\nAspirate the buffer solution from the pellet of worms, ideally down to >0.5 mL, or remove as much fluid as possible without disturbing the pellet.\nPipette the worms using a glass Pasteur pipette onto an NGM plate and let them dry. Space multiple droplets out on a new plate so they dry faster (Figure 2H).\nClean the sieve.\n\t\t\nRinse the sieve gently and thoroughly with ethanol and reverse-osmosis water. Let it dry.\nStore it in a clean container for indefinite future use.\nDiscard it when the mesh develops a \"sag\" appearance.\n2. Validation of Caenorhabditis Sieve Sorting Method\nGeneral maintenance\nFor all experiments, culture worms on a standard Nematode Growth Media17 (1 L of NGM consists of 2.5 g of peptone, 17 g of agar, 3 g of NaCl, 975 mL of double-distilled water, 1 mL of 5 mg/mL cholesterol, 1 mL of 1 M CaCl2, 1 mL of 1 M MgSO4, 25 mL of 1 M KHPO4, and 0.5 mL of 100 mg/mL streptomycin) at 25 °C.\nExperimental treatment administration\nCompare the three treatment groups: pick, fluorodeoxyuridine (FUDR), and Caenorhabditis Sieve.\n\t\t\nFor the FUDR treatment group, add 100 mg/mL FUDR to the NGM media to a final concentration of 100 μM to prevent any progeny production, and transfer the worms every other day to a fresh NGM plate to avoid food depletion.",
    "For the pick group, select and transfer the worms manually using a platinum loop.\nFor the Caenorhabditis Sieve treatment group, follow step 1.2 and pipette the worms onto an NGM plate.\nCaenorhabditis Sieve percentage yield\nTo quantify how effective the sieve is at sorting C. elegans, grow age-synchronous N2 animals to day 1 of adulthood at 25 °C (i.e., 48 h after egg laying) and then transfer them by picking them to fresh NGM plates (totaling N = 50 or N = 100 animals per treatment group).\nAfter 24 h of recovery, transfer the population to new NGM plates with the Caenorhabditis Sieve following the above protocol (see step 1.2) and count the number of successfully transferred animals.\nCalculate the percentage yield as the ratio of the number of animals transferred in comparison to the starting number at the beginning of the transfer multiplied by 100 (%).\nHealthspan assays\n\tNOTE: Score healthspan parameters of the motility class, the pharyngeal pump rate, and both the anterior and the posterior gentle touch response on days 2, 4, 6, and 8 of adulthood for age-synchronized N2 animals maintained at 25 °C.\n\t\nMotility tracking\n\t\t\nAssign motility scores based on a class-based system (classes A, B, and C) following the methods of Herndon et al.18. Compare the effects of the three experimental groups using an ordinal logistic statistics model in statistical analysis software.\n\t\t\tNOTE: Class A individuals move spontaneously in a normal, sinusoidal pattern. Class B individuals move in markedly non-sinusoidal movements and may require prodding to encourage movement. Class C individuals move their head and/or tail in response to prodding but are unable to move across the agar.\nPharyngeal pump rate\n\t\t\nCount the grinder movement of the animal’s terminal pharyngeal bulb visually under a stereomicroscope at a 600X final magnification for 1 min.",
    "Conduct a statistical analysis with a one-way ANOVA with α = 0.05 and Bonferroni post-tests with α = 0.05.\nTouch response\n\t\t\nRecord a gentle touch response and compare between the three treatment groups. Perform the assays based on the methods described by Calixto et al.19.\nRecord the anterior and posterior touch response by gently stroking an eyelash pick perpendicularly across the tail or the head (5x each, alternating head and tail) of the animals.\nScore any movement in the opposite direction of the stroke as 1 point on a scale of 0 to 5 for both the anterior and the posterior response.\nConduct statistical analysis with a one-way ANOVA with α = 0.05 and Bonferroni post-tests with α = 0.05.\nFecundity assay\nTo determine the use of the Caenorhabditis Sieve's impact on reproduction, grow age-synchronous N2 animals to day 2 of adulthood at 25 °C.\n60 h after egg lay, transfer animals to new NGM plates with either a platinum pick or the Caenorhabditis Sieve and give them 4 h to recover (dry the sieved plates for 20–30 min).\nAfter recovery, individually plate the animals via an eyelash pick to NGM plates, give them 24 h to lay eggs, and remove the animals. Allow the progeny on each plate to develop under normal conditions at 25 °C for another 24 h.\n\t\tNOTE: An eyelash pick is a human eyelash secured to the end of a Pasteur pipette with nail polish and sterilized with ethanol.\nCount the number of viable F1 generation individuals. Perform a statistical analysis using a T-test with α = 0.05.\n\t\tNote: Viable offspring are considered to be eggs that successfully hatch and begin their development through the regular larval cycles.\nFluorescent reporter stress response assays",
    "Perform three commonly used fluorescent reporter assays to detect potential markers of stress: a DAF-16::GFP translocation into the nuclei of cells in a strain [TJ356- zIs356 (pDAF-16::DAF-16-GFP;rol-6)]20; an hsp-16.2 expression [TJ375- gpIs1 (hsp-16.2p::GFP)]21; and a sod-3 expression [CF1553-muIs84([pAD76]sod-3p::GFP+rol-6[su1006])]22.\nFor each assay, culture age-synchronous animals from the three treatment groups at 20 °C and examine them at day 3 of adulthood: use a negative control (on a daily basis, transfer a group of animals manually with a platinum pick), a positive control (on a daily basis, transfer a group of animals manually with a platinum pick plus an established stressor), and the Caenorhabditis Sieve (pass the animals through the sieve and allow them to recover for 30 min on NGM just before imaging).\nIn the DAF-16::GFP assay, heat shock the positive control animals at 37 °C for 30 min before imaging20. For the hsp-16.2 assay, heat shock the positive control animals for 90 min, 20 h before imaging21. For the sod-3 assay, treat the positive control animals with 100 mM paraquat for 4 h before imaging22.\nHarvest the worms immediately with an eyelash pick and mount them to a coverslip with 1 μL of a 36% poloxamer 407 surfactant solution to immobilize the worms.\nSandwich the mounted worms with another coverslip. Mount the two coverslips to a standard glass microscopy slide and image the worms using an 8X magnification on an inverted fluorescent microscope (for an overall magnification of 80X) and a constant exposure with a FITC filter.\nTo detect any differences between the three groups in the DAF-16::GFP assay, categorize the animals based on the location of the DAF-16::GFP reporter (nuclear if the reporter translocated to nuclei, cytosolic if the reporter located in cytosol, and intermediate if the reporter located in both nuclei and cytosol).",
    "Compare the results using an ordinal logistics statistical model in statistical analysis software. For the hsp-16.2 and the sod-3 expression assays, use a one-way ANOVA with α = 0.05 and Tukey's post hoc tests with α = 0.05 to compare the total fluorescence of the head region.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}