{
  "id": 5901,
  "origin_website": "Bio",
  "title": "Preparation, Stimulation and Other Uses of Adult Rat Brain Synaptosomes",
  "procedures": [
    "Isolation of synaptosomes (Figure 1) (Wu et al., 1973; Wu, 1982)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171213/20171213223528_9941.jpgFigure 1. Schematic diagram for protocolAdd HEPES buffered sucrose solution (4 ml/g, see Recipe 1; use freshly prepared sucrose solution, and it should be cooled on ice to 4 °C before use) to freshly collected adult rat brain. Discard the cerebellum and meninges. A rat brain is approximately 4 g. Note: All steps are performed on ice (4 °C) unless otherwise specified.Homogenize thoroughly: Using con-torque homogenizer and glass tubes the mixture is subjected to vigorous manual homogenization (15 strokes) (Figure 1). Centrifuge at 1,000-1,500 x g for 10 min to remove the nuclear debris (use Avanti J-25 centrifuge and centrifuge tubes [round bottom]).The resulting supernatant (S1) is transferred to a new tube while the pellet (P1) is further homogenized with an equal volume of sucrose buffer (Recipe 1) and re-centrifuged under the same conditioned to yield supernatant (S1’) and pellet (P1’).The supernatants S1 and S1’ are combined and centrifuged at 20,000 x g for 30 min (Use Avanti J-25 centrifuge and centrifuge tubes [round bottom]).The resulting pellet (P2) is crude synaptosome fraction (Figure 1). Discard S2 and note the discarded volume. The pellet (P2) is washing by gently swirling it in fresh sucrose buffer whose volume is equivalent to the discarded supernatant (S2). Note: Don’t pipette up and down, but only gently swirl the tube to resuspend P2. The solution is then centrifuged again at 20,000 x g for 30 min to yield the wash crude synaptosomes (P2’). From one rat brain, it is about 1 ml. Use Avanti J-25 centrifuge and centrifuge tubes (round bottom).Note: Store the P2’ at -80 °C if you don’t use it immediately; always keep it on ice if you carry on for further steps.",
    "Uses of isolated synaptosomes Synaptosomal preparations can be used for investigation of neurotransmitter release (Figure 1) (neuronal depolarization) upon stimulation with high potassium as well for analysis of mechanisms of neurotransmitter release from a presynaptic neuron which can be calcium dependent or calcium independent (Wu et al., 1973; Wu, 1982; Bao et al., 1995). Furthermore, synaptic vesicles may be prepared from synaptosomes for analysis of GABA uptake into vesicles as well as analysis of the GAD complex interacting with the vesicular membrane (Jin et al., 2003; Wu et al., 2007; Buddhala et al., 2012). Modification of GAD function can be investigated in terms of regulation of GAD cleavage and regulation of GAD interaction with synaptic vesicles (Sha et al., 2005; Buddhala et al., 2012). Different uses of synaptosomes are outlined below.Synaptosomal stimulation with high K+    Freshly prepared, washed crude synaptosomes(P2’) are re-suspended in 15 ml Falcon tubes in an equal volume of 2x stimulation buffer (freshly prepared cold Kreb’s ringer phosphate (KRP) buffer, see Recipe 2).Divide the synaptosomes into 5 equal fractions–Unstimulated, stimulated (Stim) 5’, Stim 10’, Stim 30’ and Stim 60’ (use 15 ml Falcone tubes).Aliquots of the synaptosomes in KRP buffer are stimulated by the addition of KCl at either 10, 50 or 100 millimolar and incubated for 37 °C at 45 min.A non-stimulated sample serves as the control (maintained at 4 °C or on ice). Further study of synaptosomal lysate for immuno-blotting or radioactive GAD activity assays, the synaptosomes in each aliquot are lysed in 1 ml of brain lysis buffer (see Recipe 3).The lysates are then rocked at 4 °C for 30 min and are centrifuged at 25,000 x g for 30 min (using Avanti J-25 centrifuge).",
    "After this step, the supernatant is collected and stored at -80 °C or else, for immediate preparation of synaptic vesicles, the supernatant is kept on ice or at 4 °C. The supernatant is collected and the protein concentrations are normalized to serve as the samples for subsequent steps.Release of neurotransmitters is calcium dependent (Wu et al., 1973; Fon and Edwards, 2001)Neurotransmitter discharged from a presynaptic neuron in response to increased neural activity diffuses across the synaptic cleft and transduces the physiological signal by attaching to postsynaptic receptors. The receptors therefore define the nature of the physiological signal. Classical neurotransmitters such as γ-aminobutyric acid (GABA), glutamate, and acetylcholine (ACh) activate ion channels and thus facilitate quick synaptic transmission. In comparison, neuromodulators, such as monoamines and peptides (as well as GABA, glutamate, and ACh), activate G-protein–coupled receptors, which stimulate second messengers and act on an extended time scale. The neurotransmitter cycle comprises transmitter biosynthesis, storage, reuptake, and degradation. The synaptic vesicle cycle includes targeting vesicles to the nerve terminal where docking, fusion, endocytosis, and recycling take place. High rates of exocytosis involve the well-organized packaging of neurotransmitter into SVs (vesicular neurotransmitter transporters) as well as fast recycling of SVs at the nerve terminal, either straight from the plasma membrane or through an endosomal intermediate. The local recycling comprises sorting of SV proteins from plasma membrane proteins, clathrin-mediated endocytosis, on top of docking of SVs at the plasma membrane. Regulated fusion follows in response to locally elevated Ca2+ arriving at the nerve terminal through voltage-gated Ca2+ channels, which cluster near the site of vesicle fusion.Preparation of synaptic vesicles (Figure 1) (Jin et al.",
    ", 2003)Synaptosomes (P2’) are rapidly osmolysed in 10 volumes of ice cold Nano pure water containing a 1:100 dilution of mammalian protease inhibitor (MPI) cocktail and phosphatase inhibitors (PhI) (use centrifuge tubes with round bottom).The diluted synaptosomal lysate is homogenized as described above and incubated on ice for 45 min.Centrifuge at 47,000 x g for 15 min (use Optima L-90 K centrifuge and centrifuge tubes (round bottom)) to remove large membrane fractions and mitochondria.Collect the supernatants (S3) without disturbing the pellet and centrifuge at 200,000 x g for 2 h (use Optima L-90 K centrifuge and centrifuge tubes (round bottom)). The pellet obtained in this way is crude synaptic vesicles (P4).Add 500 μl of standard GAD buffer (see Recipe 4) to each fraction to remove any contaminating diluting cytosolic fractions (S3) and tight pellet (P4) are washed three times. The pellets are to be used for the steps which are listed below in the details of GABA uptake assay. GABA uptake method (Jin et al., 2003)Crude SVs are purified as described above and mixed with anti-GAD65 IgG-coupled oxirane acrylic beads (Sigma O9754) for purification of GABAergic specific SVs. AntiGAD65 antibody -SV beads (2 mg of protein per ml) are incubated in 100 microliters total volume with 4 mg/ml of SV (final concentration: 2 mg/ml), 120 µg/ml pyruvate kinase (final concentration: 60 µg/ml in GPBS buffer (see Recipe 5)]. Incubate SV mixture at 32 °C for 2 min.Add the equal volume of ATP mixture (the concentration of SV mixture with ATP mixture at 1:1 of ratio) (2 mg/ml; see Recipe 6) and pipette to combine. The combination is further incubated at 32 °C, and an aliquot of 30 µl of the reaction mixture is removed and vacuum-filtered through nitrocellulose membrane at 1-, 5-, 10-, 15-, and 20-min intervals.",
    "The membranes are washed two times with 5 ml of ice-cold GPBS buffer.After the membrane is air dried, put the membrane in scintillation vial, add scintillation cocktail, vortex the vial and leave it overnight.The radioactivity persisting on the membrane is calculated based on scintillation counter measurements (dpm). The count in Disintegrations Per Minute (dpm) is measured using equipment Tri-Carb 2900TR Liquid Scintillation Analyzer (PerkinElmer, MA, USA)For experiments involving the GAD inhibitor, hydrazine, or aminooxyacetate, the inhibitor is first preincubated with SV mixture for 10 min before the addition of ATP mixture. For uptake assays involving both [3H] Glu and [14C] GABA, the conditions are the same as explained above (Steps E1 to E4) except that both [3H] Glu and [14C] GABA are included in the reaction mixture.Complex with GAD on the vesicular membrane (Jin et al., 2003; Buddhala et al., 2012; Modi et al., 2015)GAD65 is attached to SVs by creating a protein complex (first with Heat Shock Cognate: HSC70) that was discovered through the attachment to proteins on SVs, e.g., CSP, VGAT, and (anti-calmodulin-dependent kinase II) CaMKII. This protein complex functions as a machine to verify that GABA biosynthesis and packaging into the SV is exactly coupled. This illustrates a functional and structural coupling of GABA synthesis, regulation, and packaging into SVs.The physiological events initiated by neuronal stimulation through activation of SV-associated GAD and the subsequent packaging of GABA into the SV can be explained as below. GABA is distributed by exocytosis after the onset of an action potential. The SV is recycled by a process involving clathrin-coated pits. The clathrin coat is then separated from the vesicles through interaction with HSC70. Vesicles are then returned to the resting state of SVs, where the proton gradient is returned by V-ATPase.",
    "GAD65 is stimulated through protein phosphorylation by a proton gradient dependent protein kinase. One of the candidates for the protein kinase is CaMKII. GABA that has been newly synthesized by GAD65 is then carried into SVs by VGAT. These refilled GABA-containing SVs are prepared to be released upon onset of a new action potential. SGAD is activated by calcineurin-mediated dephosphorylation and inhibited by protein kinase A-mediated protein phosphorylation. When GABA neurons are excited, the influx of Ca2+ into the terminal results in dephosphorylation and activation of SGAD/GAD67 (L-glutamic acid decarboxylase with molecular weight of 67 kDa). GABA synthesized by SGAD/GAD67 in the cytosol may also be transferred into SVs, although it represents a minor pathway. Cytosolic GABA may also be metabolized to create ATP through the GABA shunt pathway, which may be utilized to preserve the electrochemical proton gradient for GABA transport. GAD65 is mainly responsible for the synthesis of GABA to be utilized as a neurotransmitter, whereas GAD67 is employed for GABA to be used for other functions such as serving as a signaling molecule in growth, a source of increased cell viability, and a source of GABA released via nonvesicular mechanism.Regulation of GABA synthesis through control of GAD activity (Bao et al., 1995; Sha et al., 2005; Wei and Wu, 2005; Sha et al., 2008; Buddhala et al., 2012; Modi et al., 2014; Chou et al., 2017)The stimulation of the glutamic acid decarboxylase (GAD) enzymes GAD65 and GAD67 switches GABA neurotransmission at the pre-synaptic site. Transcription or mRNA splicing controls concentrations of GAD65 and GAD67. Post-translational modifications include proteolytic cleavage, phosphorylation and palmitoylation, that regulate the activities of these key enzymes (Wei et al., 2004).",
    "A truncated form of GAD65 (tGAD65) is more dynamic than full-length GAD65 (fGAD65) although, by comparison, truncated GAD67 (tGAD67) is less active than full-length GAD67 (fGAD67). The protein mu-calpain is responsible for cleaving of fGAD65 and fGAD67. GABA neurotransmission is dependent on whether GAD is associated with synaptic vesicles (SV) and calpain carries out a critical function by producing the highly active tGAD65 causing in increased GABA synthesis and packaging uptake into SV. It is known that reversible protein phosphorylation is a key mechanism responsible for the regulation of protein functions. Neurotransmitter systems regulated by phosphorylation of their synthesizing enzymes has also been demonstrated. Protein phosphorylation and dephosphorylation play a vital role in the regulation of GAD activity in the brain. Soluble GAD (sGAD) is inactivated upon phosphorylation, most likely by protein kinase A (PKA), and stimulated upon dephosphorylation by protein phosphatase 2B (PP2B, calcineurin). By the contrast, membrane-bound GAD (mGAD) is activated by phosphorylation and disabled by dephosphorylation. The kinase responsible for the phosphorylation of mGAD is not yet known. Although it is commonly assumed that GAD65 is in mGAD preparations and that GAD67 is principally present in sGAD preparation, GAD65 and GAD67 have been shown to exist in both soluble and membrane fractions of the brain preparations.PKCε regulates GAD65 phosphorylation while GAD67 is inhibited through phosphorylation by PKA. Cysteine residues 455 and 446 in GAD67 and GAD65 alone are vital for full-length GAD regulation.T91 was shown to be a key phosphorylation site for GAD67 and T95 in hGAD65 was shown to be phosphorylated by kinase C ε (PKCε) by analysis using matrix-assisted laser desorption/ionization-time of flight (MALDI-TOF) mass spectrometry. Cooperation with the cofactor PLP at these respective targets controls the switch between PLP-bound active holoGAD and an unbound active apo GAD form.",
    "Temporary switching to the PLP bound active holoGAD is vital to GABA neurotransmission. Specific to GAD65 but not GAD67 is palmitoylation by (Huntingtin-interacting protein) HIP14 which accelerates GAD65 anchoring to SV and increases the input of vesicular GABA to neurotransmission."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}