{
  "id": 18378,
  "origin_website": "Jove",
  "title": "A Battery of Motor Tests in a Neonatal Mouse Model of Cerebral Palsy",
  "procedures": [
    "NOTE: All animal surgeries were performed in accordance with Temple University's ULAR department and IACUC policies and procedures. C57BL/6 dams and sires were purchased from Charles River Laboratories and were housed in breeding cages with a 12 hr light/dark cycle (light on 7:00 - 19:00) with free access to food and water. Breeding pairs produced litter sizes between 5 - 10 pups.\n1. Cerebral Palsy Induction Surgery\nNOTE: Cerebral palsy was induced using post-natal day (PND) 6 mouse pups, as previously described8,9 (http://www.jove.com/video/1951/mouse-models-of-periventricular-leukomalacia).\nPlace a pup in a glass bowl on ice with a laboratory wipe to protect the pup's skin. Check for appropriate anesthetic plane by foot pinch and lack of movement. Move the pup to a padded ice pack for surgery.\nSterilize the skin of the pup using 70% ethanol. When dry, use a # 11 sterile surgical blade and make a 1 cm incision in the neck.\nUsing a stereoscopic surgical microscope, isolate the right common carotid artery with a small hook and cauterize using a portable hand-held cauterizer. Visually confirm that the artery is occluded. Sham surgery includes visualization and isolation of the common carotid artery without cauterization.\nRealign the skin and close using suture glue (n-butyl cyanoacrylate).\nPlace the pup on a 34 oC heating pad for 30 min to monitor for spontaneous breathing and normal movement.\nReturn the pup(s) to dam for 30 min.\nPlace the pups on a heating pad or other warming device set at 34 oC inside a hypoxia chamber set at 6% oxygen for 35 min. Oxygen is replaced by nitrogen. Closely monitor the chamber oxygen level and temperature for consistent injury results.\nRemove the pups from the hypoxia chamber and return them to the heating pad.",
    "Intraperitoneally inject lipopolysaccharide diluted in sterile saline at 1 µg/kg and return the pup to the dam. Sham injections are injections of saline only.\n2. Neonatal Motor Tests\nNOTE: On PND 8, 48 hr after CP induction, mouse pups are tested for neurobehavioral development. Pups are tested within a 4 hr block before noon in order to eliminate time of day differences in behavior. Pups are removed from the dam for no more than 15 min at a time to prevent rapid loss of body heat and hunger/separation issues. In addition, pups are allowed to rest in between tests so that maximal efforts will be elicited on each test. The basis of the neonatal motor tests is adapted using Fox's battery of tests 10,11 and Wahlsten's adaption of Fox's tests 12, as well as Treat-NMD and other behavior publications (as noted in the text for each test). Fox's battery of tests are appropriate for PND 2 - 21. Of Fox's tests, the battery present here includes: righting reflex, grasping reflex, negative geotaxis (called vertical screen test in Fox's battery) and four limb grip strength (modified from Fox and Wahlsten's screen climbing tests). Here, ambulation, front-limb strength, and hindlimb strength are also tested to distinguish reflexive motor behavior between sham and CP mouse pups. To eliminate improvements on testing due to learning, tests were limited to a maximum of 3 trials where noted. All other tests had only one trial per animal.\nAmbulation (Figure 1) (adapted from a rat protocol 13):",
    "NOTE: Crawling is a behavior developed early in the mouse pup between PND 0 - 5, at which point mice begin to transition to walking, from 5 - 10 days old 14. At PND 8, the ambulation test takes advantage of this transitional time course. Ambulation can, however, be scored throughout the lifetime of a mouse and can be determined at any age. As there is no potential for learning, the ambulation test can be repeated as many times as needed through the course of the experiment.\n\t\nPlace mice in a clear enclosure where mice are visible from the top as well as the side. Use gentle prodding by touching the pup's tail to motivate the pup to walk.\nScore ambulation for 3 min using the following scale: 0 = no movement, 1 = crawling with asymmetric limb movement, 2 = slow crawling but symmetric limb movement, and 3 = fast crawling/walking.\n\t\tNOTE: Here, symmetric limb movement is described where hindpaws meet frontpaws during each step, and each step smoothly transitions to the next step. A mouse displaying asymmetric limb movement has erratic paw placement and transitions from one step to the next are not smooth.\nimgsrc://cloudfront.jove.com/files/ftp_upload/53569/53569fig1.jpg",
    "Figure 1. The Transition From Crawling to Walking can be Distinguished by Observing the Hindpaw, as well as the Head and Tail. (A) During crawling, the entire back paw, from the toes to the heel, touches the ground when ambulating, as denoted by (*). An adult walking pattern is seen when only the toes and front part of the hindpaw touch the ground (the heel is elevated, deonoted by [**]). (B) The head and tail of a crawling mouse is low to the ground. The head begins to rise during the transition from crawling to walking. The transition is complete when both the head and tail are elevated and only the front of the hindpaw touches the ground. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/53569/53569fig1large.jpg]\nHindlimb Foot Angle (Figure 2)\n\tNOTE: There is an apparent developmental change in the hindlimb posture as the mouse matures from crawling to walking, where the hindlimbs are positioned under the body when walking and the angle between the hindlimbs is less than the angle seen in crawling. Even though the hindlimb foot angle changes over time, mouse pups of the same age with different injury or diseases can be compared. Similar to the ambulation test (3.1), there is no potential for learning. Thus, the hindlimb foot angle test can be repeated as many times as needed through the course of the experiment.\n\t\nEither in a clear open field box or an enclosed area, mount a video camera from below or above, respectively, to record the pup as it moves around the field. Use gentle prodding by touching the pup's tail to motivate the pup to walk. Record for two mins.",
    "Using the video recordings, measure the foot angle of the pups by drawing a line from the end of the heel/shin to the tip of the longest (middle) toe. Only take the measurement when the pup is performing a full stride in a straight line and both feet are flat on the ground. Do not take measurements while the pup is stationary or while the pup is turning.\nMeasure three to five sets of foot angles and calculate the average angle for each pup tested.\nimgsrc://cloudfront.jove.com/files/ftp_upload/53569/53569fig2.jpg\nFigure 2. Hindlimb Foot Angle can be Used to Determine Gait Abnormalities. The foot angle can be measured by drawing a line from the mid-heel through the middle (longest) digit. Injured animals have a greater foot angle when compared to normal (see Representative Results, Foot Angle). Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/53569/53569fig2large.jpg]\nSurface Righting (Figure 3):\n\tNOTE: The righting reflex is the motor ability for a mouse pup to be able to flip onto its feet from a supine position. The average age for the righting reflex to appear in rodents is PND 5 with a range from PND 1 - 10 15. As this test is a reflex, there is no learning component and it can be repeated throughout the experimentation period.\n\t\nPlace pups on their backs on a cotton sheet or bench pad and hold in position for 5 sec.\nRelease the pups and record the time it takes the pup to return to prone position, as well as the direction of righting (left or right). A total of one min is given for each trial, if needed.\nRepeat for a total of three trials.\nimgsrc://cloudfront.jove.com/files/ftp_upload/53569/53569fig3.jpg",
    "Figure 3. Surface Righting. This test requires trunk control and may test for postural imbalances. Human CP patients may have deficits in their core. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/53569/53569fig3large.jpg]\nNegative Geotaxis (Figure 4)\n\tNOTE: The average age for negative geotaxis reflex to appear in rodents is PND 7 with a range from PND 3 - 15 15. The negative geotaxis test assesses motor coordination in young mice. Mice are placed facing down a slope and, due to vestibular cues of gravity, pups turn to face up the slope. The response to stimulus, or taxis, is an innate behavior.\n\t\nPlace the pup with its head pointing downward on a 45o incline and hold it for 5 sec.\nRelease the pup and record the time and direction the pup turns to face upward. Total testing time is 2 min.\nRepeat for a total of three trials. Mice that fall down the incline or fail to turn can be either re-tested, eliminated, or given a zero score.\n\t\tNOTE: This decision is left to the examiner, as occasionally pups will roll down the incline due to sleepiness rather than weakness. Once the decision is made on how to score pups that fall down the incline, it should be noted in the methods and should be consistent throughout the testing of all subjects.\nimgsrc://cloudfront.jove.com/files/ftp_upload/53569/53569fig4.jpg\nFigure 4. Negative Geotaxis. Motor and vestibular input is required for the mouse to recognize its orientation on a slope and turn around. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/53569/53569fig4large.jpg]\nFront-limb Suspension (Figure 5) 16; adapted from 17,18 :",
    "NOTE: Front-limb suspension tests the forelimb strength of pups, including arm and paw strength. This test is not recommended for pups younger than PND 10 15. Pups are allowed to grasp a wire strung across a stable object and hang onto the wire with both forepaws. The testing area is over a padded drop zone. The test can detect right/left side strength differences. Learning and the absence of negative reinforcement can lead to increased non-participation. Mice falling immediately when released or failure to grasp when placed on the wire are indicative of non-participation.\n\t\nHold the pups firmly by the body and enable them to grasp the wire with both forepaws.\nRelease the pup. Using a timer or stopwatch, record the total time to fall, as well as paw weakness.\n\t\tNOTE: Paw weakness is determined if a pup consistently falls from the wire with one paw before the other rather than releasing from the wire with both paws at the same time.\nRepeat test for a total of three times.\nimgsrc://cloudfront.jove.com/files/ftp_upload/53569/53569fig5.jpg\nFigure 5. Front-Limb Suspension. This suspension test causes tension in the forelimbs until muscle fatigue. With this approach, baseline strength in the forelimbs are established. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/53569/53569fig5large.jpg]\nHindlimb Suspension (Figure 6):",
    "NOTE: This suspension test determines hindlimb strength. It is a test designed specifically for neonates and was initially used on animals between PND 2 - 12 19,20, but can be adapted for mice up to PND 14. This test can detect right/left hindlimb strength differences as well as neuromuscular function. A standard 50 ml conical is used, padded with laboratory wipes. Similar to the front-limb suspension test, this test can be learned, especially since there is no negative consequence to falling. Thus, increased non-participation, as seen by mice falling as soon as released or failure to stay when placed on the edge of the tube, may be noted.\n\t\nUsing a 50 ml conical, place pup gently face down into the tube with its hind legs hung over the rim.\nRelease the pup. Observe the hindlimb posture.\nScore posture according to the following criteria.\n\t\tNOTE: Score of 4 indicates normal hindlimb separation with tail raised; score of 3 means weakness is apparent and hindlimbs are closer together but they seldom touch each other; score of 2 indicates hindlimbs are close to each other and often touching; score of 1 shows a weakness is apparent and the hindlimbs are almost always in a clasped position with the tail raised; a score of 0 indicates constant clasping of the hindlimbs with the tail lowered or failure to hold onto the tube for any period of time.\nCount pulls if necessary. A pull is qualified when the pup attempts to lift its body using its hindlimbs while suspended on the side of the conical tube.\nUsing a timer or stopwatch, record the latency to fall.\nRepeat the entire test in triplicate.\nimgsrc://cloudfront.jove.com/files/ftp_upload/53569/53569fig6.jpg",
    "Figure 6. Hindlimb Suspension. (A). This suspension test causes tension in the hindlimbs until muscle fatigue. Baseline strength and posture in the hindlimbs are established. (B). Scoring. Note the numbers above the representative mice demonstrating the possible posture score. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/53569/53569fig6large.jpg]\nGrip Strength (Figure 7):\n\tNOTE: This test will examine the paw strength of all four paws at the same time. A 16 x 18 fiberglass screen wire is used. The average age for a rodent to be able to grasp a horizontal screen is PND 8 with a range from PND 5 - 15 15. Fox used the four limb horizontal screen test from PND 2 - 21 10. This test is modified from the standard horizontal screen test; here the screen is rotated slowly from a horizontal to vertical position, to challenge the grasping of all four limbs 21; adapted from Corti S 16. If the mouse holds on to the mesh screen when inverted to 180°, record the latency to fall. Also, note the body weight. A hanging impulse can be calculated as [weight (g) x latency to fall (sec)] reflecting the force needed to resist gravity.\n\t\nUsing a piece of wire mesh, place the pup on the screen. Allow the pup to adjust to this environment for approximately 5 secs.\nInvert the screen slowly to 180 degrees. Record the approximate angle of the screen when the pup falls off.\nRepeat for a total of three trials and average the trials.\nimgsrc://cloudfront.jove.com/files/ftp_upload/53569/53569fig7.jpg\nFigure 7. Grip Strength. Mice are required to sustain muscle tension in all four limbs as gravitational force increases. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/53569/53569fig7large.jpg]\nGrasping Reflex (Figure 8)",
    "NOTE: The grasping reflex usually appears in rodents at PND 7 with a range from PND 3 - 15 15. Each paw is tested individually, thus the test can reveal front- or hindlimb issues, as well as sidedness issues. As it is a reflex, this test can be repeated until the reflex appears. It is not prone to learning. As an important caveat, this test does not distinguish grasping strength, only ability, and must be tested prior to 15 days of age when juvenile mice begin to grasp due to fear response.\n\t\nHold the mouse by the scruff of its neck, similar to the way a mouse pup is carried by the dam. This hold causes the pup to become instinctively immobile and relaxed, allowing for ease of testing.\nStroke each paw of the pup with the blunt, rounded side of a razor blade.\nTest each paw individually and record the presence or absence of grasping and score 1 point per paw with which the mouse grasps.\n\t\tNOTE: The scoring for right paw preference is 100% for right paw preference, - - -100% for left paw preference, 50% for both paws grasping, and 0% for no paws grasping. The equation to determine these numbers is [(right paw - left paw)/(right paw + left paw + both paws)] x 100%.\nimgsrc://cloudfront.jove.com/files/ftp_upload/53569/53569fig8.jpg\nFigure 8. Grasping Reflex. Because neonatal mice do not have a strong fear response, this test strictly determines the plantar/palmar reflex. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/53569/53569fig8large.jpg]\nCliff Aversion (Figure 9):",
    "NOTE: Cliff aversion tests labyrinth reflexes, as well as strength and coordination and can be used to test pups from PND 1-14 22. A pre-scented box (a box where a minimum of 5 mice have been allowed to freely roam) with a flat elevated ledge is used and the pup is placed with the digits only of their forepaws and their snout positioned over the edge. Scoring is performed by counting the total time it takes the pup to turn away from the cliff and move its paws and snout away from the edge. If no response is seen after 30 sec, the test is terminated. If the pup falls off the edge, a single additional trial can be performed.\n\t\nUsing a side view, place the pup on the edge of the pre-scented box, making sure that the forepaws, digits and snout are the only parts over the edge.\nRelease pup and start timer.\nOnce both the snout and paws have been removed from the edge, stop the timer and record time.\nRepeat test for a total of 3 trials. If the pup does not move away from cliff within 30 sec, no score is given.\n\t\tNOTE: The determination whether the pup is a non-participator versus impaired is left up to the discretion of the examiner. The height of the cliff may be adjusted for the age of the pup to assure the pup’s safety. A smaller height can be used with a black “floor” to emulate a greater height.\nimgsrc://cloudfront.jove.com/files/ftp_upload/53569/53569fig9.jpg\nFigure 9. Cliff Aversion. Vestibular imbalances are measured using the cliff aversion test. Here, the pup's eyes are still closed so fear is not the driving factor to turn away from the cliff's edge. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/53569/53569fig9large.jpg]\n3. Statistical Significance",
    "Using a statistical software analyze the results. Express the data as mean ± standard error of the mean (SEM). Tests are parametric and thus, examine the data using t-test analyses.\n\tNOTE: Experiments were not designed to test for gender differences. Differences are considered to be statistically significant when p < 0.05."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}