{
  "id": 15370,
  "origin_website": "Jove",
  "title": "Detection of Inter-chromosomal Stable Aberrations by Multiple Fluorescence In Situ Hybridization (mFISH) and Spectral Karyotyping (SKY) in Irradiated Mice",
  "procedures": [
    "All animal studies were carried out in strict accordance with the recommendations in the Guide for the Care and Use of Laboratory Animals of the National Institutes of Health. The animal protocol was approved by the Institutional Animal Care and Use Committee of the University of Arkansas for Medical Sciences. All animals were housed under standard air-conditioned animal facility at 20 ± 2 °C with 10 - 15 hourly cycles of fresh air and free access to standard rodent food and water. Upon arrival, the mice were held in quarantine for 1 week and provided certified rodent chow.\n1.Radiation Exposure and In Vivo Arrest of Metaphase Cells\nExpose un-anesthetized mice to 2 Gy whole-body radiation in an irradiation chamber. During irradiation, place mice in a well-ventilated holding chamber to make sure they do not move freely and receive a uniform dose.\nInject 100 µL of 0.05% colchicine solution (colchicine powder dissolved in calcium and magnesium free PBS) intraperitoneally using a 25 G needle attached with 1 mL disposable syringe. Avoid injection directly into any organ.\nLeave the animal in the cage for 2 h before bone marrow cell harvest. Observe the animal for any signs of pain or distress.\n2. Bone Marrow Cell Harvest and Isolation of Bone Marrow Mononuclear Cells by Density Gradient Centrifugation\nEuthanize the mouse by CO2 asphyxiation.\nSpray 70% ethanol on the dorsal and ventral side.\nMake a 2 cm incision on the abdominal skin with sharp scissors. Grasp the skin on either side of the incision with blunt tweezers and gently pull open the abdominal muscles.\nCut off both the hind legs with scissors and immediately place them in pre-chilled PBS with 4% FBS.\nCarefully clean all the muscles attached to the hind limb with a sharp razorblade and cotton gauze bandage.",
    "Separate the tibia from the femur. Trim both tips of each bone with a razorblade.\nFlush the contents of the bone marrow with 3 mL PBS (with 4% FBS) using a 23 G needle attached to a 3 mL syringe and collect the content in a 15 mL centrifuge tube. Pass the cell suspension at least 10 times through the needle to make a single cell suspension.\nCarefully overlay the cell suspension on an equal volume of lymphocyte separation medium (3 mL) without disturbing the interface between the cell suspension and lymphocyte separation medium. Centrifuge at 400 x g for 30 min at room temperature.\nCollect the buffy coat carefully without disturbing the other layers and transfer in a new 15 mL centrifuge tube.\n3. Preparation of Metaphase Cell Spreads\nAdd 10 mL PBS to the tube containing the buffy coat.\nCentrifuge at 400 x g for 5 min at room temperature.\nCarefully remove the supernatant. Then break up the cell pellet with gentle tapping and add 10 mL PBS.\nCentrifuge at 400 x g for 5 min at room temperature.\nRemove the supernatant without disturbing the cell pellet, break up the pellet, and add 4 mL of pre-warmed hypotonic 0.075 M potassium chloride solution. Add hypotonic solution drop by drop with gentle constant shaking.\nIncubate cells for 20 min at 37 °C in a water bath.\nAfter hypotonic treatment, add an equal volume (4 mL) of fixative (methanol: glacial acetic acid, 3:1 v/v) in the 15 mL tube and mix gently by inverting the tube.\nCentrifuge at 400 x g for 5 min at room temperature and discard the supernatant.\nBreak up the cell pellet with tapping followed by gentle vortex for a few seconds and add 3 mL of fixative solution drop by drop with constant shaking.",
    "Incubate for 30 min at room temperature and then centrifuge at 400 x g for 5 min.\nRemove the supernatant, break up the cell pellet with gentle tapping, and add 3 mL fresh fixative.\nCentrifuge at 400 x g for 5 min at room temperature, and remove the supernatant. Break up the cell pellet with gentle tapping, and add fresh 3 mL fixative.\nRepeat step 3.12 twice more.\nCentrifuge at 400 x g for 5 min at room temperature, and remove supernatant without disturbing the cell pellet. Then add 400 to 600 µL fixative and mix thoroughly with pipetting.\nDrop 30 µL fixed cells onto pre-cleaned and wet slides tilted at a 45° angle and allow the slides to air dry completely overnight.\n4. Mouse Chromosome Painting by mFISH\nChromosome Denaturation\n\t\nPlace the slide containing metaphase cell spreads in 2x SSC for 2 min at room temperature.\nDehydrate the slide by serial ethanol washing for 2 min each in 70%, 80%, and 100%. Incubate for 60 min at 65 °C.\nPreheat 40 mL denaturation solution (70% formamide/2x SSC; pH 7.0) to 70 °C (± 2 °C) in a glass Coplin jar for 30 min. Denature chromosomes by incubating the slide in pre-warmed denaturation solution for 1 - 1.5 min.\nQuench slide immediately in ice-cold 70% ethanol for 2 min to stop the denaturation process as well as to prevent the denatured chromosomes from re-annealing. Then dehydrate by washing with 80% ethanol for 2 min. Repeat the ethanol wash with 100% ethanol for 2 min. Completely dry the slide at room temperature.\nDenaturation and Hybridization of Probe Mixture",
    "Briefly centrifuge the probe mixture supplied by the manufacturer, transfer 10 µL of probe mixture into a 500 µL snap cap centrifuge tube, and denature by incubation at 80 °C (± 2 °C) in a water bath for 7 min.\nPlace the centrifuge tube with probe mixture in a water bath at 37 °C for 10 min.\nApply the denatured probe mixture onto the slide with denatured chromosomes.\nCarefully cover the area with an 18 mm x 18 mm glass cover slip and eliminate any visible air bubbles by very gently pressing the cover slip to slide. Seal all four sides of the cover slip with rubber cement and incubate for 12 h to 16 h in the dark at 37 °C in a humidified chamber for hybridization.\nPost Hybridization Washing and Detection\n\t\nCarefully remove the rubber cement and the cover slip.\nPlace slide in pre-warmed 0.4x SSC at 74 °C (± 2 °C) for 5 min.\nWash slide in washing solution II (4x SSC/0.1% Tween-20) for 2 min.\nPlace 20 µL of anti-fade mounting medium with DAPI counterstain (1.5 µg/mL) and cover with a glass coverslip. Press gently on coverslip with lab tissue to remove air bubbles and excess mounting solution. Seal the edges of coverslip with nail polish.\nView slides using a fluorescent microscope equipped with appropriate filters.\n5. Spectral Karyotyping (SKY) of Mouse Chromosomes\nChromosome and Probe Denaturation\n\t\nEquilibrate slide in 2x SSC at room temperature for 2 min, without shaking.\nDehydrate slide in an ethanol series (70%, 80%, and 100% ethanol) for 2 min each at room temperature. Air-dry the slide to remove the ethanol completely.\nWarm 40 mL denaturation solution (70% formamide/2x SSC; pH 7.0) in a glass Coplin jar for 30 min.\nIncubate slide in pre-warmed denaturation solution for 1 to 1.5 min.",
    "Immediately immerse the slide into ice-cold 70% ethanol for 2 min to stop the denaturation process as well as to prevent the denatured chromosomes from re-annealing.\nDehydrate the slide by placing it into 80% ethanol for 2 min and then into 100% ethanol for 2 min at room temperature.\nDenature the SKY probe (vial #1 supplied by manufacturer) in a water bath set to 80 °C (± 2 °C) for 7 min, and then immediately place into a different water bath set to 37 °C for 10 min.\nProbe Hybridization\n\t\nAdd 10 µL of denatured SKY probe onto the denatured chromosomes.\nCarefully place an 18 mm x 18 mm glass coverslip onto the SKY probe so that no air bubbles are trapped under the coverslip.\nSeal the edges of the coverslip with rubber cement.\nPlace the slide in a humidified lightproof chamber and incubate in the dark at 37 °C for 24 h to 36 h.\nPost-hybridization Washing and Fluorescence Detection\n\t\nRemove rubber cement very carefully without disturbing the coverslip.\nPlace the slide into pre-warmed rapid washing solution (0.4x SSC) at 72 °C (± 2 °C) for 5 min with constant shaking. Immerse slide into washing solution III (4x SSC/0.1% Tween 20) and incubate for 1 min while shaking.\nOptional: Add 80 µL of blocking reagent (vial #2 supplied by manufacturer) onto the area of hybridization, place a 24 mm x 60 mm plastic coverslip, and incubate in the dark at 37 °C for 30 min in a humidified chamber.\nGently remove the plastic coverslip and wash the slide with pre-warmed (45 ºC) washing solution III for 5 min.",
    "Apply 80 µL of Cy5 staining reagent (vial #3 supplied by manufacturer), place a 24 mm x 60 mm plastic coverslip, and incubate at 37 °C in the dark for 40 min in a humidified chamber.\nDip the slide into a glass Coplin jar containing pre-warmed (45 ºC) washing solution III (4x SSC/0.1% Tween 20) and incubate at 45 °C in a water bath for 2 min with shaking. Repeat this washing step 3 times.\nApply 80 µL of Cy5.5 staining reagent (vial #4 supplied by manufacturer), place a 24 mm x 60 mm plastic coverslip, and incubate at 37 °C in the dark for 40 min in a humidified chamber.\nWash the slide 3 times with pre-warmed (45 ºC) washing solution III.\nHold the slide in a tilted position against a paper towel to drain excess fluid. Add 20 µL anti-fade DAPI reagent (vial #5 supplied by the manufacturer) and carefully place a 24 mm x 60 mm glass coverslip without introducing any air bubbles. Seal the edges of coverslip with nail polish and observe with an epifluorescence microscope equipped for capturing SKY images.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}