{
  "id": 3133,
  "origin_website": "Cell",
  "title": "Protocol to evaluate the impact of murine MCT1-deficient CD8+ T cells on adipogenesis",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCD8+ T lymphocytes isolation from lymph nodes and spleen\nTiming: 2.5 h\nThis section describes how to collect mice lymph nodes and spleen and how to process these tissues to obtain a uniform cell suspension for the isolation of CD8+ T cells to be used for the co-culture with mouse adipocytes NIH-3T3 cells.\nCollect the lymph nodes and spleen.\nEuthanize mouse with isoflurane (2%) or other approved methods.\nOpen the abdomen of the mice by using surgical scissors and tweezers. It is important to lift the skin without opening the peritoneum.\nCollect the two inguinal lymph nodes located in the subcutaneous adipose tissue of the inguinal left and right regions.\nCollect brachial and axillary lymph nodes located in the axillary left and right regions.\nEnsure to eliminate the surrounding adipose tissue.\nPlace the organs collected in a 48-well plate containing 500μL of MACS buffer (PBS/2% FBS/2 μM EDTA) each well.3[href=https://www.wicell.org#bib3]\nOpen the peritoneal cavity and collect the spleen which is located inside the rib cage on the left, above the stomach. Place the organ in the 48-well plate containing 500 μL of MACS buffer previously used also for lymph nodes.\nPrepare a uniform cell suspension of primary lymphocytes from the lymph nodes and spleen.\nIn a sterile biosafety cabinet, place a 70 μm cell strainer on top of a 50 mL tube.\nMash the lymph nodes and spleen, through the strainer by using a 1mL syringe plunger and 10 mL MACS buffer.\nNote: the percentage of CD8+ T cells obtained from the cell suspension (derived both from lymph nodes and spleen) is less than 10%.",
    "Centrifuge the cells at 500 g for 5 min, aspirate the supernatant with the vacuum and resuspend the pellet in 1 mL of eBioscience™ 1X RBC Lysis Buffer. RBC or red blood lysis buffer is used for the lysis of erythrocytes in single-cell suspension. Leave the suspension at 4°C for 5 min.\nBring up the suspension to a volume of 10 mL by using MACS buffer. This step allows us to wash the cells. Centrifuge the suspension for 5 min at 500 g.\nNote: If there is a need to pool out lymph nodes and spleen collected from more than one mouse, then increase the volume of lysis buffer, and wash the cells with at least 3 times the volume of the lysis buffer used.\nAspirate the supernatant and resuspend the cells in 10 mL of MACS buffer.\nCount the cells in the counting chamber by using a 1:20 dilution in Trypan blue.\nNote: Whether the number of cells is too high to be counted in the squares of the chamber, it is necessary to increase the dilution to limit count errors.\nIsolate CD8+ T lymphocytes with negative selection beads present in the EasySep™ mouse CD8+ T cell isolation kit.\nCentrifuge cells at 500 g for 5 min.\nResuspend the cells in MACS buffer in order to achieve a concentration of 1×108 cells per mL and then transfer samples in a 5 mL sterile polystyrene round bottom tube.\nNote: For the isolation protocol, we usually use the EasySep™ magnet with which the isolation can be performed with 2 mL as a maximum volume of cells. If you have more than 2×108, divide the sample for two isolations, in two different tubes.",
    "Add rat serum 50 μL/mL and 50 μL/mL of isolation cocktail supplied with the kit. This cocktail is done by biotinylated monoclonal antibodies against non-CD8+ T cells dissolved in PBS and 0.1% BSA. Mix briefly and incubate 10 min at 22°C.\nVortex the beads vial present in the kit for 10 s and add a concentration of 125 μL/mL to each sample.\nVortex rapidly and leave the tubes for 5 min at 22°C.\nFill in the tube with MACS buffer until reaching a volume of 2.5 mL.\nPlace the tube into the magnet and incubate for 2.5 min.\nPour the enriched cells by inverting the magnet and collect the CD8+ T cells in a new 15 mL tube.\nCount the enriched cells with Trypan Blue with a 1:10 dilution.\nResuspend the cells in RPMI-10 medium in order to achieve a cell concentration of 2×106 cells/mL.\nCD8+ T cells are ready for cells activation.\nNote: To assess CD8+ T cell activation, save an aliquot of your cells (2×105 cells are sufficient) to perform the cytometry staining the same day of the isolation (flow cytometry staining and evaluation of activation is described in the next paragraph 2 “Activation assessment”).\nCD8+ T lymphocyte activation\nTiming: 25 h\nThis section explains in detail how to activate CD8+ T lymphocytes in vitro and how to assess their activation through flow cytometry.\nIn vitro activation.\nCoat a 12-well plate with 500 μL per well anti-CD3 (0.5 μg/mL) and CD28 (2.5 μg/mL) diluted in PBS, for 1 h at 37°C.4[href=https://www.wicell.org#bib4]\nCritical: The coating must be performed in PBS and not in MACS buffer because the presence of fetal bovine serum (FBS) can reduce the efficiency of anti-CD3 and anti-CD28 coating.",
    "Aspirate the coating and plate 2×106 of isolated CD8+ T lymphocytes in each well ensuring to reach a final volume of 2.5 mL of complete RPMI medium (R10; RPMI plus 10% FBS, glutamine, HEPES, 2-ME, sodium pyruvate and antibiotics) preheated at 37°C.\nAdd interleukin (IL)-2 at a concentration of 25 U/mL and leave the cells to be activated for 24 h at 37°C in the presence of 5% CO2.\nHarvesting of CD8+ T cells.\nAfter 24h of incubation, collect CD8+ T cells from the 12-well plate into a 15 mL tube. Use a 1 mL pipette.\nNote: if you have many wells to collect, use a 50 mL tube.\nAdd 1 mL of MACS buffer to the well and pipette again to be sure to collect all the cells.\nNote: to ensure that all cells are collected before throwing away the plate, add 1 mL of PBS to the well and check at the microscope to see if the plate is free of cells. Otherwise pipette again and add the solution to the previous collected cells.\nCentrifuge the 15 mL tube containing the cells at 500 g for 5 min.\nAspirate the supernatant and resuspend the pellet with MACS buffer to allow the cells to be counted. Use Trypan Blue, as described above.\nCentrifuge the 15 mL tube containing the cells at 500 g for 5 min.\nResuspend the counted cells in R10 complete medium to achieve a 2×106 cells every 1.5 mL.\nCD8+ T cells are now ready to be co-cultured with adipocytes.\nActivation assessment: the staining with anti-CD69 APC-Cy7, an early activation marker, allows us to evaluate changes in cell physical parameters.",
    "Note: If you want to evaluate the activation of the CD8+ T cells, you must compare the cells before the induction of activation with the activated ones, and you need to perform the same staining for not activated cells the day of the isolation and 24 h post activation (2×105 cells are sufficient for the staining).\nTransfer 2×105 cells in a 96 well plate (V-bottom).\nCentrifuge the plate at 800 g for 5 min.\nDiscard the supernatant and resuspend the pellet with 50 μL MACS buffer containing 0.5 μL of anti-CD69 antibody per well.\nIncubate for 30 min at 4°C in the dark.\nAdd 150 μL of MACS buffer to each well to wash the cells.\nCentrifuge 5 min at 800 g.\nRepeat steps “e” and “f” once more.\nResuspend each well with 100 μL of MACS buffer and transfer cells to a 5 mL tube.\nBring each sample to a final volume of 250 μL with MACS buffer.\nAcquire the samples with the cytofluorimeter: compare median of the forward scatter, the side scatter and CD69 fluorescence intensity between basal and activated cells (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2703-Fig3.jpg\nFigure 3. Flow cytometry analysis of activated CD8+ T cells\nThe Left panel shows the comparison of forward scatter median fluorescence intensity between basal and activated cells.\nThe central panel comparison of forward scatter median fluorescence intensity between basal and activated cells. The right panel comparison of CD69 median fluorescence intensity between basal and activated cells.",
    "Note: During the activation process, the dimension (cell size) and complexity (cell granularity) of CD8+ T cells are raised. These features translate into a shift in the median fluorescence intensity read in the forward scatter (a physical parameter that refers to the cell size) and the side scatter (an index of cell granularity or complexity). The expression of cluster of differentiation (CD)69, a marker of early activation, increases rapidly after activation leading to a higher fluorescence that is detected in cytofluorimetric analysis if compared to a CD8+ T cell not stimulated.\nCo-culture between activated CD8+ T lymphocytes and murine NIH-3T3 cells\nTiming: 3 days\nThis section describes how to co-culture differentiating NIH-3T3 cells with CD8+ T lymphocytes to evaluate the impact of the MCT1 expression in CD8+ T lymphocytes on late stages of adipogenesis.\nCo-culture (Figure 1[href=https://www.wicell.org#fig1]A).\nAt day 6 (T6) of the differentiation protocol, put a transwell insert and add on the insert 2×106 activated CD8+ T cells, in a 1.5 mL volume, in each well of the 6-well plate.\nLet the co-culture to growth for further three days, until the last day of the preadipocytes differentiation into mature adipocytes (T9).\nRemove the transwell inserts and harvest cells from each well of the 6-well plate\nRNA isolation\nExtract RNA through a spin column isolation method.\nNote: To isolate RNA, we usually use the RNeasy Mini Kit (Qiagen), but any other kit that allows for a good yield of high-quality RNA can be used.\nPerform a reverse transcription to synthesize cDNA.\nNote: To obtain cDNA, we usually reverse transcribe 1 μg/μL of RNA with Maxima First Strand cDNA Synthesis Kit for RT-qPCR (Thermo fisher).5[href=https://www.wicell.org#bib5] Any other kit which ensures a good efficiency in cDNA synthesis can be used. If the RNA yield is low, reverse transcribe 0.5 μg/μL of RNA.",
    "Perform a qPCR analysis to evaluate the expression of key genes involved in the adipogenesis, e.g., Cebpα (CCAAT/enhancer binding protein), Cebpδ, Cidea (cell death inducing DFFA like effector a), Glut4 (glucose transporter type 4), Lep (leptin), Lpl (lipoprotein lipase), Ppar (peroxisome proliferator-activated receptor) δ, Pparγ, Ppargc1α (Pparg coactivator 1 alpha). RPL (ribosomal protein L) 13a can be used as a housekeeping.\nNote: To perform a qPCR analysis, we usually use Maxima SYBR Green/Fluorescein qPCR Master Mix (2X) with a final concentration of primers of 300nM allowing a good efficiency (e.g, between 90% and 110% 6[href=https://www.wicell.org#bib6]). Any other kit ensuring a good DNA detection and analysis together with a high PCR specificity and sensitivity can be used. It is mandatory to test primer efficiencies before performing the experiments.\nNote: the in vitro adipogenesis is composed by two phases, each of which is characterized by the activation of different genes. Therefore, the day of the differentiation protocol in which to start the co-culture should depends on which stage of adipogenesis needs to be analyzed. Co-culturing activated CD8+ T cells at day 6 of the differentiation protocol allows to evaluate the possible effect on the second phase of adipogenesis, by studying the expression of genes such as GLUT4 and LPL (Figure 1[href=https://www.wicell.org#fig1])."
  ],
  "subjectAreas": [
    "Metabolism",
    "Cell Isolation",
    "Flow Cytometry",
    "Cell Culture",
    "Cell Biology",
    "Molecular Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}