{
  "id": 9091,
  "origin_website": "Jove",
  "title": "Lipid Index Determination by Liquid Fluorescence Recovery in the Fungal Pathogen Ustilago Maydis",
  "procedures": [
    "1. Preparation of Buffers and Solutions\nTo prepare 1 L of phosphate buffered saline (PBS, pH 7), dissolve 8 g of NaCl, 0.2 g of KCl, 1.44 g of Na2HPO4, 0.24 g of KH2PO4 in 800 mL of distillated water. Adjust the pH to 7.0 with HCl, and then add water for a final volume of 1 L. PBS can be made as a 10x stock solution and stored at room temperature.\nTo prepare 10 mL of fixing solution, add 1 mL of 37% formaldehyde to 9 mL of PBS to reach a final concentration of 3.7%. Prepare this solution just before use.\n\tCaution: Use gloves to handle the formaldehyde solution.\nTo prepare the quenching-solution (500 mM), dissolve 8.3 g of KI in 100 mL of distilled water. Prepare this solution before use and store it at room temperature.\nTo prepare BODIPY 10 mM stock solution, dissolve 10 mg of BODIPY 493/503 in 3.8 mL of dimethyl sulfoxide (DMSO). Keep 100 µL aliquots in the dark at -70 °C.\nTo prepare BODIPY 5 µM-quenching solution, add 1 µL of 10 mM BODIPY 493/503 to 2 mL of 500 mM quenching solution. For the LFR assay, a final concentration of 5 µM of BODIPY is required.\nTo prepare the mineral solution, add 0.06 g of H3BO3, 0.14 g of MnCl2-4H2O, 0.4 g of ZnCl2, 0.04 g of Na2MoO4-2H2O, 0.1 g of FeCl3-6H2O and 0.4 g of CuSO4-5H2O to 1 L of distilled water.\nTo prepare the salt solution, add 16 g of KH2PO4, 4 g of Na2SO4, 8 g of KCl, 2 g of MgSO4, 1 g of CaCl2, and 8 mL of mineral solution to 1 L of distilled water.",
    "To prepare the minimal medium without a nitrogen source for U. maydis FB2 (a2b2), add 10 g of glucose and 62.5 mL of salt solution to 1 L of distilled water, according to Holliday, et al.31. Adjust the pH to 7.0 and then dispense 100 mL of the media in 250 mL flasks and sterilize them. Autoclave for 20 min at 15 psi (1.05 kg/cm2) on liquid cycle or filter sterilize.\nTo prepare the yeast peptone dextrose medium (YPD), add 5 g of yeast extract, 2.5 g of peptone, and 5 g of glucose to 1 L of distilled water. Dispense 100 mL of the solution in 250 mL flasks and sterilize them. Autoclave for 20 min at 15 psi (1.05 kg/cm2) on liquid cycle or filter sterilize.\n2. Culture Condition and Cell Fixation\nNOTE: Preserve the structure of the LDs by fixing the cells as soon as possible. The fixation can be done in microcentrifuge tubes. Fixed cells can be kept at 4 °C for up to one month if dehydration is avoided leaving a thin layer of water.\nGrow U. maydis cells under culture conditions relevant for the study. Start the culture with an initial OD600 of 0.05 (1.15 × 106 cells/ mL). Incubate the cells at 28 °C, 180 rpm for 24 h. An OD600 of 1 corresponds to 2.3 × 107 cells/ mL.\nAt the selected times, withdraw an aliquot of the cells. For U. maydis, withdraw 5 mL every 2 h during the first 8 h. After 8 h of growth, aliquots of 2 mL are enough.\nMeasure the optical density at 600 nm of each aliquot.\nCentrifuge the cell suspension at 14,000 x g for 1 min at 4 °C using a tabletop centrifuge. Discard the supernatant.",
    "Suspend the pellet of the cells in 1 mL of PBS-formaldehyde 3.7% buffer. Incubate the cells for 15 min at room temperature.\nAfter the incubation, centrifuge the cell suspension at 14,000 x g for 1 min at 4 °C. Discard the supernatant.\nWash the cells pellet twice with a similar volume of distilled water (1 mL). Centrifuge the cell suspension at 14,000 x g for 1 min at 4 °C. Discard the supernatant after each washing step.\nAdjust the cell pellet to 5 OD600 (1.15 x 108 cell/ mL) with distilled water (Equation 1).\nimgsrc://cloudfront.jove.com/files/ftp_upload/57279/57279eq1.jpg    Equation 1.\nKeep the sample at 4 °C until its use.\n3. Liquid Fluorescence Recovery Assay (LFR)\nTurn on the spectrophotometer and open the Skanlt software. Click on NEW SESSION, and choose START and then Varioskan Lux. Select PROTOCOL from the session tree, enter the settings for the fluorescence wavelengths (excitation 485 nm/emission 510 nm; optical density 600 nm) and choose automatic photomultiplier gain. For excitation bandwidth, select 12 nm. In the optics, select top (excitation of the sample is from the top of the well).\nEnter a gentle and continuous agitation (300 rpm). Select RUN PLATE OUT, and PAUSE UNTIL THE USER ACTION (time used for the addition of the sample to the wells). Repeat the protocol five times. Click SAVE and write a name for the session on the SESSION NAME FIELD. The protocol is now ready for the samples analyses.\nAdd 200 µL of the BODIPY 5 µM- quenched solution to each well of a 96 well black-clear bottom plate.\nPlace the plate inside the spectrophotometer chamber and incubate 5 min at 30 °C. From this point, protect the plate from light as much as possible.",
    "Click the START button and read the fluorescence (excitation 485/emission 510) and the OD600 corresponding to the blanks.\nAdd 5 µL of the formaldehyde-fixed cell suspension to the wells during the pause time. Mix the samples carefully with the pipette. Put the plate inside the spectrophotometer and click CONTINUE. Then, the samples will be processed according to the protocol designed above.\nRepeat three successive additions of 5 µL of cell suspension. Make sure that the cells do not precipitate. (Figure 1).\n4. Calculations of The LD Index\nFor each sample in the microplate, plot a graph of fluorescence and absorbance against the volume of each successive addition (5 points including the blank). In this study, use Microsoft Excel software for the calculations. To plot the data, enter the volume, fluorescence, and absorbance data in the first, second and third column of the datasheet, respectively. Then, select the whole data with the cursor, click INSERT and select (XY) SCATTER.\nSelect the points for each line in the graph and insert the respective TREND LINE with the SHOW EQUATION box selected. Write down the values of the slopes of the two straight lines, according to equation 2:\nimgsrc://cloudfront.jove.com/files/ftp_upload/57279/57279eq2.jpg    Equation 2\n\tWhere y= fluorescence or optical density, x = volume of sample (0, 5, 10, 15, 20 µL), m = slope of the fluorescence or optical density line, and b = y-intercept.\nDivide the slope of the fluorescence line by the slope of the optical density line to get the LD index, equation 3.\nimgsrc://cloudfront.jove.com/files/ftp_upload/57279/57279eq3.jpg    Equation 3\n\tThe LD index corresponds to the quotient of fluorescence and optical density slopes.\n5. Data Quality Analysis",
    "Calculate the correlation coefficient of each straight line: click on the FUNCTION WIZARD (fx) and choose CORREL. If r <0.9, discard the data and repeat the readings. If r ≥ 0.9, readings are reliable.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}