{
  "id": 18969,
  "origin_website": "Jove",
  "title": "Formation of Human Prostate Epithelium Using Tissue Recombination of Rodent Urogenital Sinus Mesenchyme and Human Stem Cells",
  "procedures": [
    "This study was carried out in strict accordance with the recommendations in the Guide for the Care and Use of Laboratory Animals of the National Institutes of Health. The protocol was approved by the University of Chicago Institutional Animal Care and Use Committee (IACUC, protocol numbers 72066 and 72231). All surgery was performed under anesthesia, and all efforts were made to minimize suffering. The human embryonic stem cell line WA01 (H1; NIH-registration #0043) was acquired from WiCell (Madison, WI) and cultured using the feeder-independent protocol using mTeSR1 media (Stem Cell Technologies; Vancouver, B.C.). ES cells were used within ten passages of thawing.\n1. Isolation of the Urogenital Sinus from Mouse or Rat Embryos\nEuthanize a timed-pregnant mouse (day 17.5) or rat (day 18.5) by inhalation of CO2 for 5 min. Death is confirmed by cessation of vital signs in the rat. Then break its neck humanely. The rat is euthanized at this point. Spray 70% ethanol to sterilize the abdominal skin and flanks. Cut the abdominal skin and muscle layers and then cut the uterus, separate the rat embryos from the amniotic sac, and cut the umbilical cord. Transfer the embryos into a 50 ml Falcon tube containing ice-cold Hank's Balanced Salt Solution (HBSS) and keep on ice. Fetuses are euthanized by decapitation with surgical scissors.",
    "Place the embryo in 100 mm Petri dish. Bisect the embryo with scissors at the level of the umbilicus (Figure 1A). Remove the stomach and small intestine. Reveal the ovaries in the female embryo and testis in the male embryo (Figure 1B and 1C). (The ovaries are located at the caudal poles of the kidneys. The testes are approximately at the level of the bladder). At this developmental stage, UGSM isolated from both male and female embryos are capable of inducing a prostatic epithelial lineage in the presence of host testosterone.4 After this developmental time point, however, prostatic buds begin forming into the UGSM, and isolation of pure UGSM is very challenging.4\nUnder the dissection microscope, cut the abdominal wall in the middle line with Vannas scissors to expose the bladder and posterior wall of the abdomen. Free the upper genital tract from attachments (in male embryos, cut the ureter, Wolffian duct and Müllerian duct; in female embryos, cut the ureter and Müllerian duct). Free the bladder from the umbilical cord. Cut pubic bone and bluntly separate from the anterior wall of the urogenital sinus with Dumont fine tip forceps. Finally, separate the posterior wall of the urogenital sinus from the rectum. Cut the urogenital sinus with the bladder at the lower end (from the urethra) and store the urogenital sinus en bloc (with the bladder) in ice cold HBSS.\n2. Separation of the Urogenital Sinus Mesenchyme\nRemove the bladder from the urogenital sinus under the dissection microscope (Figure 1D).\nTransfer the urogenital sinus to a falcon tube containing 1% trypsin in Calcium (Ca2+) and Magnesium (Mg2+) free HBSS. Place the tube in a refrigerator at 4 °C for 75 min.\nRemove the trypsin and neutralize trypsinization with 10% Fetal Bovin Serum (FBS) in DMEM/F12 medium.",
    "Carefully tease the sticky mesenchymal sleeve from the epithelial tube with a needle or Dumont fine tip forceps (maintaining the epithelial tube intact reduces the chances of epithelial cell contamination of the mesenchyme; this can result in rodent glands forming along with your stem cell-derived human glandular epithelium) (Figure 1D).12\nTransfer UGSM into a new Falcon tube containing DMEM/F12 medium + 10% FBS + 1% Penicillin/Streptomycin (Pen/Strep; 0.5 mg/ml) + 1% Non-Essential Amino Acids (NEAA) plus 1nM R1881. Place the tube in an incubator at 37 °C with 5% CO2 overnight.\nCentrifuge the tissue at 200 x g and discard the supernatant. Wash with Phosphate Buffer Saline (PBS) (do not disturb the tissue pellet).\nAdd 0.2% collagenase (in DMEM/F12) to re-suspend the tissue. Incubate in 37 °C with gentle rocking for 1 hr.\nVigorously vortex the digestion tissue three times until it becomes homogenous single-cell mixture and add DMEM/F12 medium + 10% FBS + 1% P/S + 1% NEAA + 1nM R1881 to neutralize the collagenase.\nCentrifuge at 200 x g and then wash by re-suspending the UGSM cells in HBSS, and repeat three times to fully wash the UGSM. Finally suspend mesenchymal cells in DMEM/F12 and count the cells using a hemocytometer or cell counting device.",
    "Dissociate hES cells cultured using feeder-free protocol with mTeSR1 media (Stem Cell Technologies; Vancouver, B.C.) using an Accutase digestion (Millipore; Billerica, MA). Wash the hES cells during the log phase of their growth in warm DMEM/F12 media, then add warm 1x Accutase solution, and incubate at 37 °C for 15-20 min until single cells are uniformly dissociated from colonies. Add an equal amount of 1x defined Trypsin Inhibitor (Invitrogen; Grand Island, NY) to neutralize the Accutase and gently pipette up and down to mix and break up cell clumps. Pipette cells into a centrifuge tube and centrifuge for 3 min at 200 x g, and re-suspend cell pellet in DMEM/F12 media. Centrifuge tube for 3 min at 200 x g again and remove the supernatant, then re-suspend in cold HBSS or DMEM/F12 at desired volume.\nAdd hES cells with 1:2.5 ratio of hES/mesenchymal cells.3 This will be a cellular composition of 1E5 UGSM cells with 4E4 hESCs per 10 ml injection (a single rat UGS typically yields about 2E6 mesenchymal cells). Centrifuge at 200 x g for 5 min and then discard the supernatant. Re-suspend with 75% Matrigel (BD Biosciences, San Jose, CA; mixed with 25% cold HBSS for easier handling) and place the tube in ice for sub-renal capsule injection.\n3. Transplantation of Tissue Recombinant Underneath the Renal Capsule\nPrepare a sterile surgical area.\nAnesthetize a male athymic nude mouse with ketamine/xylazine i.p.; use a fresh mix containing a 1:1:8 ratio of ketamine:xylazine:saline. Dosing will be 100 mg/kg Ketamine and 2.5 mg/kg Xylazine. Animals unresponsive to a toe-pinch should be fully under for 20-30 min.\nSurgically prepare the mouse by shaving the surgical site (if not using a nude mouse), cleansing with three alternating wipes of 70% alcohol followed by betadine solution and applying a surgical drape.",
    "Put eye moisture salve (Altalube eye ointment) to the eyes of the mouse to prevent drying during anesthesia.\nDuring surgery, respiration rate and core body temperature of the mice are monitored. The respiration rates should be steady and maintained within 40-90 breaths/min. Core body temperature is monitored with observation of the color of the mucous membranes and the pink soles of the feet. \nMake a 1.0 cm long longitudinal skin incision on the back. Continue to cut the abdominal wall in a 0.5 cm longitudinal incision.\nGently squeeze the kidney out of the abdomen and keep the kidney surface moist using drops of sterile saline.\nGently puncture the renal capsule using an empty 27-gauge syringe needle. A very shallow puncture is sufficient. This will be where you insert your blunt needle to inject your cellular mixture.\nFill a 28-gauge blunt syringe needle with 10 μl of your cell mixture. Slowly insert the puncture site and penetrate the kidney parenchyma to reach an area underneath the renal capsule. Inject 10 μl of the cellular mixture to form a bolus on the kidney underneath the renal capsule. Withdrawal the needle.\nReturn the kidney to the abdominal cavity. Secure the muscular layer of the peritoneum with 4-0 nylon sutures.\nClose the skin with either suture or staple.\nClean blood from the skin using sterile saline.\n4. Post-operative Analgesia and Monitoring\nInject the animal with buprenorphine (0.1 mg/kg every 12 hr) or ketoprofen (3-5 mg/kg in saline every 12 hr) to manage post-operative pain, and 1 ml of 37 °C saline i.p. to keep the animal warm and prevent dehydration.\nPut the animal in a clean cage and place it on a mild heating pad.\nSend the animals back to animal room once they regain consciousness and are moving within the cage.",
    "Observe the animal daily for unexpected signs of illness and infection for the following three days. The mice are monitored with observation of activities in cages including accessing food and water 1 day post-operatively. If the mice display fewer activities, Ketoprofen is intraperitoneally administered again once a day.\nRemove the skin staples or sutures 2 weeks post-surgery.\nXenograft tissues can be harvested as early as 8 weeks post-surgery. Xenografts can be imaged in vivo using small-animal ultrasound (Figure 2A), and fixed tissues can be sectioned and stained for various proteins using immunohistochemistry (Figure 3).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}