{
  "id": 3241,
  "origin_website": "Cell",
  "title": "Protocol for generating in vitro glioma models using human-induced pluripotent- or embryonic-stem-cell-derived cerebral organoids",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nGenerating embryoid bodies (EBs)\nTiming: 30 min, to generate a 96-well plate of EBs\nThis procedure demonstrates the method for generating embryoid bodies from hiPSCs and hESCs.\nGrow cells at 70%–80% confluency.\nThe healthy condition of cells is crucial for generating organoids, in short, cells confluency should reach 70%–80% and appear as flat and smooth colonies (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2808-Fig1.jpg\nFigure 1. EBs embedded in Matrigel to form neuroepithelium, related to step 28\n(A) Figure A shows a smooth and round hiPSCs colony.\n(B) At Day 8, EBs appear spherical with a transparent edge and smooth surface.\n(C) Figures show the procedure of making ‘cookies’ when embedding EBs in Matrigel. (Scale bar: 500 μm).\nDetach colonies into single cell by Accutase and incubate cells at 37°C with 5% CO2 for 4–5 min.\nAdd 1 mL EB formation medium, that is, mTeSR Plus with 50 μΜ Y-27632, into each well to stop the dissociation.\nNote: mTeSR Plus used as the EB formation medium is because hiPSCs and hESs are maintained in this medium for a long time. If cells are cultured in other medium, such as Essential 8 medium, it’s better to use the medium that culturing cells to form EBs.\nCollect cells in the 15 mL centrifuge tube.\nCentrifuge at 300 × g for 5 min, remove the supernatant and keep the cell pellet.\nResuspend the cells in 1 mL EB formation medium and calculate the live cell density.\nResuspend the respective number of cells in the appropriate volume of EB formation medium.\nThe generation of single EB requires 1500 cells/well.\nThe total volume of each well is 150 μL.\nFor a 96-well plate, resuspend cells in 15 mL EB formation medium at the total number of 150,000.",
    "Transfer the cell suspension to multichannel reagent reservoirs, then aliquot 150 μL into each well of an ultra-low cell attachment U bottom 96-well plate by using the multichannel pipette.\nOptional: Centrifuge the plate at 480 × g for 5 min at room temperature. EBs can form naturally in the wells, this step can help EBs gather faster without any impact on EBs formation.\nIncubate EBs at 37°C with 5% CO2 for 24h and avoid disturbance.\nAt Day 1 (24 h after EBs generation), observed the successfully formed EBs under a bright field microscope. EB presents a spherical shape and smooth peripheral. Some dead cell debris that appeared around EBs will not affect the formation of organoids. troubleshooting 3[href=https://www.wicell.org#sec6.5].\nInduction of forebrain organoids\nTiming: 6 days\nThis procedure is to generate organoid of forebrain regions.\nOn Day1, remove half volume of EB formation medium and replace with Medium 1, that is, the medium used at the First stage (Table 1[href=https://www.wicell.org#tbl1]).\ntable:files/protocols_protocol_2808_6.csv\nStorage condition and storage time: The prepared culture medium should be stored at 4°C and used up within two weeks. We recommend mixing small molecule compounds at the day before use to achieve their maximum effect.\nHalf-half refresh the medium daily from Day 2 to Day 5.\nOn Day 5 and Day 6, refresh half volume of the medium with the Medium 2 (Table 1[href=https://www.wicell.org#tbl1]).",
    "Notice: The formula of Medium 2 refers to Qian et al.,1[href=https://www.wicell.org#bib1] the only difference is that Medium 2 contains WNT3A. It was mentioned in Qian et al. 20162[href=https://www.wicell.org#bib2] that WNT3A and CHIR99021 activate the same downstream signaling pathway. They considered that WNT3A had little effect in it, so they deleted it in their article at 2018. But we found that the success rate of forebrain region induction is higher with the addition of WNT3A, which may be caused by the insufficient concentration of CHIR99021.\nOn Day 7, EB appears spherical with a transparent and smooth surface. The sphere edge is brighter than the interior with a clear interface in brightness between the two regions (Figure 1[href=https://www.wicell.org#fig1]Β).\nNote: The quality of healthy EBs is crucial for successful outcome.\nGeneration of neuroepithelium of organoids\nTiming: 1 h for embedding EBs in Matrigel, 5 days for generation of neuroepithelium of organoids, and 1 h for mechanically dissociating organoids from Matrigel\nThis procedure is to generate neuroepithelium buds of organoids.\nOn Day 7, thaw an aliquot of Matrigel (Cat. 354230) on ice.\nWet 600 μL centrifuge tubes with the Medium 2 for later use.\nCut the P200 pipette tips to widen the openings to 1.5–2 mm in diameter, and transfer EBs into pre-wet tubes.\nLet the EBs settle down and remove all the supernatant.\nAdd 67 μL Medium 2 to each tube.\nPlace the tubes on ice.\nNote: Each tube containing 20–30 EBs.\nAdd 100 μL Matrigel and mix with medium and EBs on ice by using a cut tip.\nPipette the suspension up and down.\nUsing the cut tip, transfer the EBs-Matrigel mixture to the ultra-low-attachment 6-well plate to make a ‘cookie’ (Figure 1[href=https://www.wicell.org#fig1]C).",
    "Use P10 pippette tips to distribute EBs in the cookie, and place the cookie in the middle of each well.\nCritical: The whole process should be performed on ice.\nIncubate the EBs-Matrigel cookies at 37°C with 5% CO2 for 30 min.\nGently add 4 mL pre-warmed Medium 2 into each well, incubate EBs at 37°C with 5% CO2.\nCompletely refresh the Medium 2 each day from Day 8 to Day 14. To avoid disrupting EB-Matrigel complex, add pre-warmed medium gently. troubleshooting 4[href=https://www.wicell.org#sec6.7].\nOn Day 14, pipette the cookies by using 15 mL serological pipettes at a volume rate of 2 mL per s. More details can be referred to Qian et al.1[href=https://www.wicell.org#bib1]\nObserve whether the organoids are completely detached from the Matrigel under a bright field microscope; if not, repeat step 27 for 1–2 times.\nGrowing organoids of forebrain region\nTiming: long term culture, approximately 45 days\nThis procedure describes the method for long-term cultivation of organoids.\nTransfer the detached organoids in 60 mm cell culture dishes for long term culture.\nEach 60 mm cell culture dish contains 10–15 organoids.\nCompletely replace Medium 2 with 5 mL Medium 3 each dish (Table 1[href=https://www.wicell.org#tbl1]).\nPlace an orbital shaker in the incubator.\nPlace dishes on the orbital shaker at the speed of 85–95 rpm.\nPlace organoids on the orbital shaker for long-term culture.\nChange Medium completely every two days.\nOn Day 35, refresh the medium with Medium 3 containing supplementary Matrigel (Cat. 354230) at the dilution ratio 1: 100 in order to create an extracellular matrix coating on the surface of organoids.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2808-Fig2.jpg\nFigure 2. Scheme of organoid pattern with bright field microscope images, related to step 34",
    "Figure 1[href=https://www.wicell.org#fig1] shows the formation time line of forebrain organoids. The bright field microscope images of different stages organoids are shown respectively. (Scale bar: 500 μm).\nNote: COs can be maintained for at least 6 months. The scheme of organoid pattern is shown in Figure 2[href=https://www.wicell.org#fig2].\nSlice organoids to prevent cell death and sustain health\nTiming: 1 h for slicing a dish of organoids\nThis procedure is set for preventing hypoxia and cell death of organoid, by exposing organoid sections into culture medium.\nPreparation before vibrating sectioning.\nPlace the vibratome (Leica VT 1200S) into the hood.\nExpose the vibratome to UV sterilization for at least 1 h to prevent contamination.\nCollect forebrain organoids at Day 45 from the orbital shaker and immerse organoids in the 3% (w/v) ultra-low-melting-point agarose dissolved in DMEM/F-12.\nKeep the agarose mixture at 45°C to maintain a liquid phase to avoid solidifying.\nEmbed up to 15 organoids in agarose within a disposable plastic base mold (1.5 cm wide, square).\nMove the agarose blocks on ice for 5–10 min to solidify.\nNote: When embedding organoids, first lay a thin layer of agarose solution in the block. Then quickly use a Pasteur pipette to place the organoids into the block, and finally drop agarose solution to make all organoids sink to the bottom of the block, to keep the organoids in the same plane within the block. troubleshooting 5[href=https://www.wicell.org#sec6.9].\nPerform vibrating sectioning by Leica VT 1200S in ice-cold DMRM/F-12 containing 1 X Penicillin-Streptomycin-Amphotericin B.\nSet vibratome as 0.12 mm/s in speed and 1 mm in amplitude.\nNote: For users who have no access to this vibratome, we recommend using Leica VT1000S to perform vibratome with same parameters. Or use spring scissors to cut COs, refer to Momoko et al..",
    "Collect and separate 500 μm-thick sections from agarose by gentle pipetting.\nNote: Only the middle sections are collected. Each organoid can be considered as an irregular sphere with a diameter of 1.2–1.5 mm, so each organoid can collect 1–2 middle sections. The first and last sections of each organoid cut with a vibratome should be discarded, as it cannot be guaranteed that they are 500 μm-thick.\nTransfer organoid sections to the ultra-low-attachment 6-well plate with the Medium 3 supplemented with 1% Matrigel(354230).\nMaintain organoid sections in a static state at 37°C with 5% CO2 for 1 h. troubleshooting 6[href=https://www.wicell.org#sec6.11].\nAfter 1 h, transfer organoid sections to 60 mm cell culture dishes on the orbital shaker at 37°C with 5% CO2 for long term culture.\nNote: COs should be sliced once a month from Day 45 to avoid hypoxia following the same procedure as described in steps 35–41.\nValidation of forebrain organoids\nTiming: 1 week\nThe purpose of this step is to confirm the success of the forebrain pattern and the formation of the ventricular zone (VZ) and cortical plate (CP).\nOn Day 1, collect Day 60 COs in a 35 mm dish without medium and fixed in 4% paraformaldehyde (PFA) pH7.4 at temperature for 20 min.\nRinse COs in phosphate buffered saline (PBS) 3 times for 10 min each at room temperature.\nGently transfer COs in 1.5 mL microcentrifuge tubes with 30% sucrose solution.\nIncubate COs in 30% sucrose solution at 4°C overnight (8–12 h).\nOn Day 2, transfer each CO to a 7∗7∗5 mm disposable plastic base mold and embed in optimal cutting temperature compound (OCT) for supporting tissue integrity during cryosectioning.\nNote: COs embedded in OCT should stay at 4°C overnight (8–12 hrs) before being transferred to −80°C or −20°C, to completely infiltrate the tissue.",
    "On Day 3, before cryosectioning, thaw the mold with the frozen COs for 30 min in a cryostat chamber set to −20°C.\nRemove COs from mold and set on the specimen stage with OCT.\nCollect 10 μm sections and place two sections each glass slide.\nAllow slides to dry at temperature for at least 1 h.\nRinse slides with PBS 3 times for 10 min to remove OCT.\nUse a pap-pen or liquid blocker pen to draw a border around the sections on the slide and allow to dry.\nBlock and permeabilize the tissues by adding blocking solution (PBS supplemented with 5% normal donkey serum and 0.1% Triton X-100).\nBlock for 1 h at room temperature or 4°C overnight (8–12 h) in a humidified chamber.\nStain with an appropriate primary antibody in blocking solution overnight (8–12 h) in a humidified chamber at 4°C.\nRinse slides with PBST (PBS supplemented with 0.1% Triton X-100) twice and PBS twice for 10 min each time.\nStain with the secondary antibody in blocking solution for 2 h in humidified chamber at room temperature.\nRinse slides with PBST (PBS supplemented with 0.1% Triton X-100) twice and PBS twice for 10 min each time.\nStain with DAPI (1ug/mL in PBS) for 5–10 min at room temperature.\nRemove the DAPI solution and add glycerol to samples on the slides.\nMount the slides with cover glass and seal them using clear nail polish.\nStore the slides in store at −80°C or imaging immediately using confocal microscopy. Forebrain organoids successfully develop VZ, CP and astrocytes at Day 60 (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2808-Fig3.jpg\nFigure 3. VZ, CP, neuron and glia formation of day 60 organoids, related to step Multiple antibodies were used to verified the formation of forebrain organoids, related to step 62",
    "(A) including TUJ1, a marker for neurons of early stage; GFAP, a marker for astrocytes.\n(B) SOX2, a marker for neurons in ventricular zone; TBR2, a marker for neurons in subventricular zone; CTIP2, a marker for neurons cortical plate.\n(C) BRN2, a marker for neurons in layers 2/3 of CP; SATB2, a marker for neurons from layers 2–4 of CP. Forebrain organoids at Day 60 show appropriate glia formations and polarized rosettes. (Scale bar: 300 μm).\nTransfection of fluorescent protein in U-87 MG cell line\nTiming: 1.5 week\nThis procedure is to produce U-87 MG cell line with a fluorescent protein which can be visualized its activity under the fluorescence microscope.\nPlate U-87 MG into 24-well plate at a density of 1 × 105 cells/mL one day in advance using Dulbecco’s modified Eagle’s medium (DMEM) supplemented with 10% fetal bovine serum (FBS). 50%–70% confluence should be reached on the following day.\nBefore infection, calculate the volume of virus based on MOI and resuspend the melted virus in the 250ul cell culture medium.\nExample: If the virus titer is 1 × 108 IU/mL and you want to deliver 1 × 105 cells, you need 10 μL volume of virus to achieve an MOI of 10.\nRemove the preceding medium and wash once with the DPBS. Then U-87 MG are inoculated with VSVG-Lentai-hEF1a-PuroR-CMV-mRuby3 lentivirus at multiplicities of infection (MOI) of 0, 10, 20, 40, 80 with or without the 5ug/mL polybrene.\nRefresh the culture medium after 12–16h incubation in 37°C.\nCheck the fluorescence via microscopy after 72h to choose one appropriate MOI for subsequent experiments, which ensures the high lentiviral transfection efficiency with minimum damage.\nAfter choosing an appropriate MOI for infection, prepare uninfected U-87 MG cells in 6-well plate 24h in advance.\nRepeat the procedure 61–63 at an MOI of 10.",
    "Note: In fact, both MOI of 10 and 20 are relatively appropriate. Viruses within this range of MOI will cause cells to express strong red fluorescent protein without affecting cell viability.\nAfter 24h, change the medium completely for U-87 MG and incubate under the same conditions for 48h.\nNext, select stably transfected U-87 MG cells by changing medium supplemented with puromycin (5ug/mL) until the non-transfected cells die off. This procedure lasts for 1 week.\nOrganoids slices co-culture with U-87 MG cells\nTiming: 1 day\nThis step is to generate glioma organoids with high reproducibility.\nPrepare the co-culture medium: mix the differential organoid medium with U-87 MG culture medium at the volume ratio of 1: 1.\nNote: Co-culture medium can prevent cell death from both organoids and U-87 MG cells.\nOn day 0, transfer each vibratome-sectioned Day 60 forebrain organoids in a well of ultra-low-attachment 24-well plate. troubleshooting 7[href=https://www.wicell.org#sec6.13].\nAdd 1 mL co-culture medium to each well.\nRinse the U-87 MG cells twice with PBS (1x) to remove FBS in the dishes.\nAdd 3 mL of 0.25% Trypsin-EDTA solution to each 10 cm dish.\nIncubate U-87 MG cells at 37°C with 5% CO2 for 5 min.\nAdd 3 mL of U-87 MG culture medium to stop the digestion, and pipette the suspension to completely detach the cells from the culture dish.\nTransfer the cell suspension to a 15mL centrifuge tube.\nCentrifuge Cells for 5 min at 300 × g.\nRemove the supernatant. Resuspend the cells with 1 mL co-culture medium and calculate the live cell density.\nResuspend the respective number of cells in the appropriate volume of co-culture medium.",
    "The generation of a single organoid slide in co-culture with U-87 MG cells require seeding of 10ˆ5 U-87 cells in each well. Load each well with one organoid slide (approximately 3–4 mm in diameter).\nLoad each well with 1 mL co-culture medium and kept consistent across wells.\nFor a 24-well plate, resuspend cells in total 24 mL co-culture medium at the total number of 2.4∗106 cells per well.\nAdd 1 mL cell suspension into each well.\nIncubate organoids co-cultured with U-87 MG cells at 37°C with 5% CO2 for 24 h under static culture.\nOn Day 1, U-87 MG cells successfully invade into forebrain organoids, which can be observed under the fluorescence microscope (Figure 4[href=https://www.wicell.org#fig4]). troubleshooting 8[href=https://www.wicell.org#sec6.15] and 9[href=https://www.wicell.org#sec6.17].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2808-Fig4.jpg\nFigure 4. Timeline of forebrain organoids co-cultured with U-87 MG, related to step 85\nU87 cells carried mRuby fluorescent proteins invaded in the organoids after 24 h and formed the special structures in organoids. On the first day of co-culture, U87 cells are observed to diffuse and begin to aggregate in the organoid under a fluorescent microscope (see zoom-in image of Day 1); as the days increased, U87 cells show a stronger preference for clustering together in the organoids. (Scale bars: Expect for the last panel, scale bar represents 500 μm. Scale bar of the last panel images represent 300 μm).\nValidation of organoid-U87 assembloids\nTiming: 1 week\nThis procedure is to verify that U87 cells have successfully invaded the organoids and that the cell-cell interactions between U87 cells and organoids can be observed under confocal microscopy.\nOn the third day of co-culture, fix the assembloids in 4% PFA at room temperature for 20 min.\nRinse the assembloids for three time with PBS (1x), each time lasts for 10 min.",
    "Transfer the assembloids to a 1.5 mL centrifuge tube for subsequent immunofluorescence staining.\nBlock and permeabilize the tissues by adding blocking solution (PBS supplemented with 5% normal donkey serum and 0.1% Triton X-100). Block for 1 h at room temperature or 4°C overnight (8–12 h) in the tubes.\nStain with an appropriate primary antibody in blocking solution for 1–2 day at 4°C.\nRinse the assembloids with PBST (PBS supplemented with 0.1% Triton X-100) twice and PBS twice for 10 min each time.\nStain with the secondary antibody in blocking solution for 1 day at 4°C.\nRinse assembloids with PBST (PBS supplemented with 0.1% Triton X-100 ) twice and PBS twice for 10 min each time.\nStain with DAPI (1ug/mL in PBS) for at least 3 h at room temperature.\nUsing FOCM (ultrafast optical clearing method) to perform tissue clearing on assembloids. Ultrafast optical clearing method refers to Zhu et al.3[href=https://www.wicell.org#bib3]\nFOCM reagent preparing:\nDissolve urea and D-mannitol in DMSO.\nStir overnight (8–12 h) at room temperature (25°C) until completely dissolved.\nAdd glycerol and stir further.\nStore the reagent at room temperature for several months and gently shake before use.\nTransfer the assembloids to the glass bottom cell culture dishes.\nRemove all the liquid and add 100 μL FOCM reagent on the dish.\nCulture organoids in FOCM reagent for at least 15 min until sent for confocal scanning (Figure 5[href=https://www.wicell.org#fig5] & Methods video S1[href=https://www.wicell.org#mmc1]). troubleshooting 10[href=https://www.wicell.org#sec6.19].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2808-Fig5.jpg\nFigure 5. Immunofluorescence validation of the sectioned assembloids at Day 3, related to step 98",
    "(A) First, the organoid-U87 cell assembloids on Day 3 are fixed and immune-fluorescence stained. Prior to performing confocal microscopy, tissue clearing is required for assembloids to facilitate laser penetration through the tissue. The 3D graph in the middle column shows a 120 μm thick structure of assembloid, with green representing TUJ1, red representing U87 cells, and magenta representing GFAP. The 3D graph in the left column shows the invasion of U87 cells in a 90-micron thick section of the organoid-U87 assembloid, with red representing U87 cells and magenta representing GFAP. These results indicate that U87 cells can infiltrate to at least 120 μm thick and distribute throughout the organoid slices after co-culturing for three days.\n(B) Two-dimensional immunofluorescence images of organoid-U87 assembloids: Green represents Ki67, a marker for cell proliferation, red represents U87, and magenta represents MAP2\n(C) Green represents TUJ1, red represents U87, and magenta represents GFAP. The scale bars for both B and C are 300 μm.\n    Your browser does not support HTML5 video.\n  \n      Methods video S1. 3D structure of sectioned assembloids, related to step 98\n    \nThe drug sensitivity (e.g., TMZ) of U-87 MG glioma organoid models\nTiming: 2 days\nThis procedure is to test the temozolomide (TMZ) sensitivity, a widely used clinical drug for glioma cancer, of U-87 MG glioma organoid models (Figure 6[href=https://www.wicell.org#fig6]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2808-Fig6.jpg\nFigure 6. TMZ drug sensitivity of U-87 MG glioma organoids, related to step 99–107\n(A) Figures show the changes of the density and the fluorescent intensity of U-87 MG glioma organoids under TMZ treatment after 48 h.",
    "(B) To more accurately measure drug sensitivity, U87 cells were transfected by SFFV-luciferasr-IRES2-EGFP and VSVG-Lentai-hEF1a-PuroR-CMV-mRuby3. The U87 cells used for testing drug sensitivity will stably express the luciferase protein. After co-culturing with organoid slices and drug treatment for 48 h, luciferin substrate was added and allowed to react with the expressed luciferase from U87 cells for 10–20 min. Luciferase activity was measured via microplate reader to quantitate the activity of U87 cells.\n(C) And the histogram shows the drug sensitivity of U-87 MG glioma organoids exposed to different concentration of TMZ, measured by the fold change of luciferase activity. The histogram was shown as the mean ± SEM (n = 4). Statistical significance (∗∗∗P < 0.001, ∗∗P < 0.01, ∗P < 0.05) was assessed by one-way ANOVA followed by Bonferroni’s multiple comparison tests. (Scale bar: 500 μm).\nGenerate U-87 MG cells stably expressing luciferase by lentiviral infection of the SFFV-luciferasr-IRES2-EGFP construct.\nU-87 MG/Luciferase cells, which have been transfected with SFFV-luciferasr-IRES2-EGFP, are transfected with VSVG-Lentai-hEF1a-PuroR-CMV-mRuby3 lentivirus, refer to step 63–71.\nSince that, U-87 MG/Luciferase/mRuby3 cells are generated.\nTransfer Organoids co-cultured with U-87 MG/Luciferase/mRuby3 cells of Day 2 to an ultra-low-attachment 24-well cell culture plate.\nPlace organoids in individual wells in a co-culture medium containing TMZ or vehicle control.\nRespective concentration of TMZ: 200 μM, 500 μM, and 1000 μM is diluted in co-culture medium.\nIncubate Organoids at 37°C with 5% CO2 for 48 h.\nNote: Do not refresh the medium within 48 h.\nTake images of each organoid on Day 0 and Day 2 (Figure 6[href=https://www.wicell.org#fig6]A).\nOn Day 2, prepare D-Luciferin Potassium Salt Bioluminescent Substrate solution.\nPrepare 200X Luciferin stock solution (30 mg/mL) in sterile water. Mix the solution by pipetting repeatedly until the solute is completely dissolved.\nAliquot the luciferin stock solution and store it in −80°C.",
    "Prepare Luciferin working solution (150 mg/mL final concentration) in co-culture medium. 1 mL for each well.\nRemove all the medium in wells. Add 1 mL luciferin working solution to each well.\nIncubate organoids at 37°C with 5% CO2 for 10–20 min before imaging.\nNote: Incubation time will influence the signal.\nCheck the in vitro bioluminescence with Tecan Spark Cyto. Analyze the signal among each group (Figure 6[href=https://www.wicell.org#fig6]C). troubleshooting 11[href=https://www.wicell.org#sec6.21].\nNote: To obtain multiple luciferase readings from the same drug-treated organoids at different time points, after each measurement of luciferase activity, completely remove the luciferin working solution and wash the organoid-U87 assembloids twice with the co-culture medium. Then, add back the medium at step 105 into the corresponding wells. Repeat steps 105–107 when performing the next measurement.\nFurther application of U-87 MG glioma organoids: Although we have only demonstrated one of the applications of U-87 MG glioma organoids, which is to test the drug sensitivity of U87 cells fused with organoid tissues, other types of cell activity in the cerebral organoids, such as neurons and astrocytes, can also be monitored during drug treatment, to predict potential side effects or adverse reactions of new drugs in clinical use. In addition to drug-related applications, this model can serve as a mechanism research model for glioma cells invasion and interaction with other types of cells in the brain."
  ],
  "subjectAreas": [
    "Organoids",
    "Tissue Engineering",
    "Neuroscience",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}