{
  "id": 9899,
  "origin_website": "Jove",
  "title": "A G-quadruplex DNA-affinity Approach for Purification of Enzymatically Active G4 Resolvase1",
  "procedures": [
    "1. Preparation of G4-DNA Structures to be Used for the Purification of rG4R1 (Formation of Biotinylated G4-DNA G-Quadruplex)\nOrder the following DNA oligomer, called Z33-Bio, at a 1 µmole-scale: 5’ AAA GTG ATG GTG GTG GGG GAA GGA TTC GGA CCT-biotin 3’. Ensure that the biotin moiety is at the 3’ end of the oligomer.\nPrepare 10x G4 buffer: 450 mM Tris-HCl pH 8, 25 mM EDTA, and 2,500 mM NaCl.\nResuspend the Z33 oligomer in 250 µL of water (so that the oligomer concentration is ~2.5 mM). Add 25 µL of 10x G4 buffer and mix. Incubate the oligomer at 50 °C for ~48 h.\nBriefly spin down the tube to collect the condensation (~1,000 x g, 10 s). Add ~50 µL of a high-mass, hydrophilic polysaccharide (30% Ficoll in H2O) and mix. Pour a 10% acrylamide/1x TBE/10% glycerol gel (gel dimensions: 16 cm x 16 cm x 1 mm). Once the gel is polymerized, wash the wells with 1x TBE and load the formed Z33-Bio oligomer evenly across most of the gel (sample lane loading can be visualized with Schlieren lines).\n\t\nIn one lane at the end of the gel, load a small fraction of the oligomer that has been heated at 98 °C for 10 min (this will serve as an unstructured control), as well as a small amount of gel loading dye in another lane to monitor how far the gel has run.\nUse 1x TBE as the gel running buffer and run the gel at 120 V until the dye front has traversed at least 1/3 of the gel.",
    "Place a thin layer chromatography plate with its rough side face up in a sheet protector (or cover with plastic wrap). Remove one of the glass plates and transfer the gel to the surface of the sheet protector. Turn off the overhead lights and UV shadow the gel (long wavelength: 365 nm). Use a fresh razor blade and cut out the G-quadruplex-Z33-Bio band, which will be seen as running higher up in the gel (having slower mobility) relative to the melted control.\nPlace the gel slice containing the formed G4-DNA in a 50 mL tube and add just enough soaking buffer to cover the gel slice (soaking buffer consists of 1/3 volume 10x TBE, 1/3 volume saturated sodium acetate, and 1/3 volume H2O). Place the tube in a 37 °C incubator (nonhumidified) and incubate O/N.\nTransfer the solution to a 15 mL tube and add 1/10 volume glycogen (glycogen stock at 20 mg/mL in 10 mM Tris-HCl pH 8, 2.5 mM EDTA pH 8, and 0.05% sodium azide) and ~1.2x volume isopropanol.\n\tNOTE: Sodium azide is acutely toxic, so use with caution!\n\t\nMix and place the tube at -20 °C for at least 2 h. Spin the tube at 2,700 x g in a tabletop centrifuge cooled to 4 °C for 12 min. Gently decant the solution from the pelleted G4-DNA. Wash the pellet 3 times with 70% EtOH + 50 mM NaCl (the salt in the wash is critical for G4 stability). Wick away excess liquid with lint-free tissue paper.\nPlace the washed pellet in the refrigerator for at least 2 h to hydrate the pellet and allow for easier resuspension. Resuspend the pellet in 50 µL of TNE buffer (10 mM Tris-HCl pH 8, 50 mM NaCl, and 0.05 mM EDTA pH 8).",
    "Place 5 µL of this formed DNA G-quadruplex into 495 µL of H2O and quantify by using a spectrophotometer that allows the extinction coefficient to be determined by entering the nucleotide composition of the oligomer (the extinction coefficient of the Z33 DNA oligomer with a base composition of A = 8, C = 3, G = 15, and T = 7 is 341,946 L/mol/cm). Enter the dilution factor as 25 (not 100), as the formed G-quadruplex consists of 4 strands of DNA.\nAliquot the volume equivalent of 3 ODs (OD260 units) per tube and store at -20 °C; for example, if the 5 µL that was added to the 495 µL of H2O gives an OD260 reading of 3, then prepare 5 µL aliquots.\n2. Preparation of G4-DNA Structures to be Used in An Enzymatic Activity Assay of rG4R1 (Formation of TAMRA-labeled G4-DNA)\nOrder the following DNA oligomer, called Z33-TAM, at a 1 µmole-scale: 5’ TAMRA-AAA GTG ATG GTG GTG GGG GAA GGA TTC GGA CCT 3’. Ensure that the TAMRA moiety is at the 5’ end of the oligomer.\nFollow the same procedure as outlined in Section 1 for the formation of the G-quadruplex, except that ultraviolet (UV) shadowing is not necessary because the tetramethylrhodamine (TAMRA)-labeled G-quadruplex will be readily visible with the naked eye. Again, make sure to include a melted control on the gel.\nAfter taking a spectrophotometer reading of the TAMRA-labeled DNA G-quadruplex, as in step 1, dilute the formed G-quadruplex to 0.2 pmol/µL with TNE buffer. Finally, add glycerol to a 10% final concentration and store at -20 °C.\n3. Transform (DE3) PlysS Competent Cells with pTriEx4-DHX36 (Plasmid Encoding Human G4R1) and Grow/Induce Large Bacterial Cultures\nObtain the TriEx4-DHX36 plasmid.",
    "Aliquot the bacteria into 20 µL aliquots and store them at -80 °C. Aliquot the SOC medium (2% tryptone, 0.5% yeast extract, 10 mM NaCl, 2.5 mM KCl, 10 mM MgCl2, 10 mM MgSO4, and 20 mM glucose) into 80 µL aliquots and store at -80 °C.\nPrepare carbenicillin (CARB)/chloramphenicol (CAM) LB-agar plates. Stock concentrations of CARB and CAM are 50 mg/mL in H2O and 35 mg/mL in 70% EtOH, respectively, and these are 1,000x concentrated; thus, the final concentrations in the LB agar selection plates are 50 µg/mL and 35 µg/mL, respectively.\nPlace 1 aliquot of bacteria on ice and place 1 aliquot of SOC medium at RT. Add 1 µg of pTriEx4-DHX36 plasmid to the bacteria and swirl gently with the pipette tip to mix. Incubate on ice for a further 5 min and then heat shock at 42 °C for 30 s. Place on ice for 2 min and add the SOC medium.\nPlate the transformed bacteria on prewarmed selection plates (typically, plate a small volume, such as 5 - 10 µL, to ensure low colony density so that single colonies can be easily inoculated into large cultures) and incubate at 37 °C O/N.\nPrepare Terrific Broth according to the manufacturer’s instructions24. Make 500 mL per large flask (make sure to add glycerol) and autoclave on a short liquid cycle.\nAdd CARB/CAM (50 µg/mL/ 35 µg/mL) to the broth and then inoculate the cultures by taking agar plugs (using a p1000 pipette) containing a single bacterial colony and pipetting into the broth. Swirl the cultures vigorously to aerate them and then incubate the cultures at 37 °C O/N without shaking.",
    "The next day, place the cultures in a 37 °C shaker and shake at ~225 rpm. Grow the cultures until the OD600 is about 0.4 - 0.6, which will typically take about 4 - 6 h, depending on the initial cell density.\nNOTE: This will require periodic density monitoring via spectrophotometric readings, and it is critical to not grow the cultures to much above 0.5 ODs. As a blank for spectrophotometric readings, spin down 1 mL of bacteria and use the clarified broth as the blanking solution.\nOnce the proper OD600 is obtained, immediately place the cultures on ice and quickly cool them to 10 °C. Monitor the temperature using a thermometer wiped clean with 70% EtOH. Expedite the cooling by quickly rotating the flasks while on ice, as this will limit further bacterial growth prior to recombinant protein induction.\nAdd IPTG to a 1 mM final concentration (~120 mg/500 mL culture) and then shake at 80 rpm at 14 °C for ~17 - 18 h. The ideal temperature for protein induction has been found to be 14 °C; to best achieve this, use a cooled water-bath shaker located in a conventional cold room and manually check the temperature of the water bath with a thermometer.\nNOTE: Alternatively, use an air-cooled shaker/incubator, although it is necessary to test what digitally-set temperature setting will yield the desired liquid temperature (test this by incubating a flask of water with a thermometer in it and shaking at 80 rpm for a few hours, adjusting the digital temperature setting accordingly until 14 °C is reached).\nPlace the cultures on ice and cool them quickly, as in step 3.9. Take a small aliquot of bacteria and take an OD600 reading; ideally, the cultures will have doubled during induction to about 0.8 - 1.2 OD600.",
    "Transfer the bacteria to 500 mL centrifuge tubes and manually balance them using bacterial culture to even the weight between tubes. Once balanced, centrifuge them at 3,840 x g for 20 min at 4 °C. Pour off the clarified broth and freeze the bacterial pellets at -80 °C until the time of protein purification.\n4. Purification of Human rG4R1\nThaw and lyse bacterial pellets.\n\t\nThaw the bacterial pellet in 3 mL of TN buffer at RT (TN buffer consists of 100 mM Tris pH 7.5 and 50 mM NaCl). Hold the bottles in hand and swirl to thaw/resuspend the bacterial pellet. Once thawed and relatively evenly suspended, bring the volume up to 5 mL with TN buffer (further suspension can be accomplished via pipetting up and down with a 5 mL pipette).\nNOTE: It is typical to thaw/prep either 2 or 4 bottles on the day of preparation, depending on the user’s level of comfort with the purification procedure.\nDissolve 20 mg of lysozyme in 250 µL of H2O (per culture) and add to the resuspended bacteria. Allow the lysozyme to digest the bacteria for ~5 - 10 min while swirling the bottles in hand.\nNOTE: The color of the suspension will begin to lighten slightly as the digestion proceeds, and the suspension will be relatively non-viscous. If the cultures are too overgrown (i.e. much greater than 1.2 OD600), then chromosomal bacterial DNA can cause unwanted viscosity at this stage.\nAdd 250 µL of protease inhibitor cocktail (PIC) and one 10 µL aliquot of leupeptin. Mix thoroughly.\nPlace on ice and add 10 mL of cold TN buffer and 22 µL of BME. Transfer to a 50 mL tube.",
    "Sonicate the bacteria on ice with a digital sonicator set to 30% amplitude. Pulse at 2 s ON and 2 s OFF for 1 min. Repeat the sonication 3 times, allowing the samples to cool on ice for at least 2 min between sonication steps.\nNOTE: With multiple cultures, sonicate each one in turn before repeating the sonication iterations. During sonication, be careful to keep the sonication tip sufficiently submerged in the bacterial lysate, but not touching the sides of the tube, as this will generate excess heat.\nAdd an equal volume (15 mL) of cold 4x SSC + 20 µL of BME + 50 µL of PIC + 1 aliquot of leupeptin and mix.\nIn a tabletop centrifuge pre-cooled to 4 °C, centrifuge the lysates at 2,300 x g for 20 min. Transfer the supernatant to fresh, pre-cooled 50 mL tubes (1 tube per large culture being prepped).\nPrepare G4-magnetic beads.\n\t\nTake 1 mL of streptavidin paramagnetic bead (SPB) suspension (per 1 L culture) and transfer it to a 1.5 mL microcentrifuge tube. Pellet the SPB with a magnet and wash 2x with 2x SSC + 5 mM EDTA pH 8. Resuspend the washed SPB in 200 µL of the same solution used for washing the beads.\nAdd one 3 OD aliquot of G4-DNA (Z33-Bio G4 prepared in Section 1) to the SPB suspension and mix quickly by pipetting up and down several times. Place the tubes on a rotator and rotate at RT for at least 30 min (and up to 60 min).\nAfter this period of rotation, block the G4-bound SPB by adding 1 mL of 0.4% lactalbumin, and keep on ice until needed. Dilute the 0.4% lactalbumin from the 4% lactalbumin stock using 1x Tris-glycine.",
    "NOTE: The stock 4% lactalbumin (w/v) is initially prepared by dissolution in 2 M glycine pH 7.5, with the further addition of 1x PIC and 0.05% sodium azide.\nBind histidine-tagged rG4R1 to cobalt beads (CB) (continued from step 4.1).\n\t\nAdd 1 mL of CB slurry (equivalent to a 0.5 mL bead volume) to each 50 mL tube containing clarified bacterial lysate. Incubate for 20 min at RT on a rotator.\nNOTE: 0.5 mL bead volume is used per 1 L of clarified lysate; e.g., if two 500 mL bacterial cultures are prepared, only add CB to the 50 mL tube containing clarified lysate from one of the cultures at this point, as lysate from the second culture will be serially bound with the same 0.5 mL of CB in step 4.3.3).\nSpin down CB at 110 x g for 5 min in a 4 °C tabletop centrifuge. Aspirate the liquid carefully, and leave a couple mL of liquid so as to not disturb the pelleted CB. Wash with 10 - 15 mL of cold 4x SSC + BME (0.5 µL of BME/mL of 4x SSC).\nNOTE: For washes, pour the 10-15 mL directly onto the pelleted cobalt beads instead of pipetting, as pipetting will cause the beads to get stuck to the inside of the pipette and protein will be lost.\nPellet the CB again via centrifugation and then pour the next clarified lysate (30 mL, representing the 2nd large induced bacterial culture) onto the pelleted CB. Incubate for a further 20 min at RT on the rotator and then wash twice with 10-15 mL of 4x SSC + BME. Pellet at 110 x g for 5 min at 4 °C.",
    "After the second wash, aspirate the liquid and leave about 2 mL of beads/liquid at the bottom of the tube. Transfer the protein-bound CB to a pre-cooled 2-mL tube by using a 1 mL “wide-bore” pipette tip.\nNOTE: Use a fresh razor blade to cut the end of the tip prior to transfer, as the use of this “wide-bore” pipette tip will reduce the loss of protein-bound cobalt beads.\nBriefly centrifuge the beads in the 2 mL tube at high speed (~18,000 x g) in a microcentrifuge at 4 °C (~5 - 10 s is all that is necessary for quick pelleting). Gently remove and discard the supernatant by pipetting, being careful to not lose the protein-bound CB.\nElute rG4R1 from CB.\n\t\nIncubate the CB in 0.5 mL of histidine elution buffer (HEB) on a rotator for 5 min in a cold room. Again, when adding HEB, just pipette the 0.5 mL onto the beads (to eliminate CB loss) and resuspend the beads by inverting the tube. HEB is 0.7 M L-histidine pH 6 (the pH is adjusted using acetic acid).\nCentrifuge at 18,000 x g in a 4 °C microcentrifuge for 1 min. Transfer the supernatant to a pre-cooled 15 mL tube. Gently remove and transfer the protein-containing supernatant by careful pipetting, leaving a small amount of liquid on top of the CB.\nRepeat steps 4.4.1 and 4.4.2 for a total of 3 HEB elutions.\nElute once with 0.2 M EDTA pH 6.0; the color of the CB will change from pink to white as the EDTA chelates the cobalt.",
    "After this fourth and final elution has been transferred to the 15 mL tube, pipette the residual elution buffer from the CB by using a gel-loading tip on the end of a 1 mL pipette tip; by plunging the tip to the bottom of the tube, residual protein-containing elution buffer can be collected.\nBind rG4R1 to G4-bound SPB and elute recombinant enzyme in an ATP-dependent manner.\n\t\nPrepare 5x Res Buffer: 250 mM Tris-Acetate pH 7.8, 250 mM NaCl, 2.5 mM MgCl2, and 50% glycerol. Prepare 3x Res Buffer: 0.915 mL of H2O, 2 mL of 5x Res Buffer, 0.33 mL of 0.4% lactalbumin (diluted from 4% lactalbumin with 1x Tris-glycine), 0.010 mL of BME, 0.015 mL of 1 M MgCl2, 0.050 mL of PIC, and 0.010 mL of leupeptin. Keep on ice.\nNOTE: The stock 4% lactalbumin (w/v) is initially prepared by dissolution in 2 M glycine pH 7.5, with the further addition of 1x PIC and 0.05% sodium azide.\nPellet G4-SPB to the side of the tube with a magnet and discard the supernatant (G4-SPB, as prepared in step 4.2). Add 1 mL of 3x Res Buffer to the G4-SPB and pipette to mix.\nPipette this 1 mL of G4-SPB suspended in 3x Res buffer into the 15 mL tube containing ~2 mL of protein-containing HEB/EDTA (eluate from step 4.4). Incubate for 15 min in a 37 °C water bath with occasional agitation so the beads do not settle.\nOn ice, pellet the protein-bound G4-SPB to the side of the tube with a magnet. To wash, add 1 mL of 4x SSC + 0.4% lactalbumin (+ 0.5 µL/mL BME) and pipette to resuspend the beads. Pellet beads with the magnet on ice. Repeat this wash for a total of 2 washes.",
    "NOTE: Patience is required during the washing procedure to ensure that all of the magnetic beads have been pelleted between washes. This is especially true given the increased viscosity of the solution due to the glycerol contained in the Res buffers.\nWash the G4-SPB 1x with 1 mL of 3x Res Buffer.\nPrepare elution buffer (EB): 0.5 mL of 3x Res Buffer, 0.1 mL of 0.1 M ATP, and 0.4 mL of H2O.\nPre-warm 1 mL of EB to 37 °C in PCR tubes distributed across the heating block of a thermal cycler set to 37 °C.\nPellet G4-SPB with the magnet on ice and resuspend the beads in 100 µL of pre-warmed EB. Immediately transfer the beads to a pre-warmed PCR tube and incubate for 30 s at 37 °C.\nPromptly add 12 µL of 5 M NaCl and pipette up and down vigorously 20 - 30 times. The combination of the high salt and ATP contained in the EB serves to elute rG4R1 from the G4-beads.\nNOTE: It is highly important to minimize the number of bubbles formed during the pipetting process, as bubbles can denature the protein.\nImmediately pellet the G4-SPB with a magnet and transfer the protein-containing eluate to a fresh PCR tube on ice (labeled with the date).\nRepeat the elution and transfer described in steps 4.5.8-4.5.10; the end product of this process is thus ~200 µL of EB containing purified rG4R1. Set aside two 7 µL aliquots (in PCR tubes labeled with the appropriate date) for use in the quality-control enzymatic activity assay that will test whether highly active rG4R1 has indeed been purified.\nStore the purified rG4R1 at -80 °C until the time of the activity assay.\n5. Quality Control Enzymatic Activity Assay of Purified rG4R1",
    "For each preparation of rG4R1 to be assayed, prepare 300 µL of resolvase assay buffer (RAB), where each 30 µL contains 0.2 pmol of TAMRA-labeled Z33 G4-DNA (prepared in step 2); the makeup of the RAB is as follows: 0.1 mL of 3x Res Buffer, 0.01 mL of 0.2 pmol/µL G4-Z33-TAM, 0.03 mL of 0.1 M ATP, and 0.16 mL of H2O. In a strip of 6 PCR tubes, pipette 40 µL of RAB into the first tube and 30 µL of RAB into the remaining tubes (keep the tubes on ice at this point).\nRetrieve one of the 7 µL rG4R1 aliquots (from step 4.5.11) and place it on ice. With a p20 pipette set to 5 µL, gently pipette up and down a few times to mix the rG4R1 in the aliquot and transfer 5 µL to the first tube of the strip of 6 PCR tubes (the one that contains 40 µL of RAB). Next, set the pipette to 10 µL and serially transfer 10 µL to the remaining PCR tubes containing RAB.\nImmediately incubate this strip of PCR tubes at 37 °C for 30 min in a thermal cycler, followed by a 4 °C hold. Open the tubes while they are being held at 4 °C and add 2 µL of 0.5 M EDTA pH 8 to each tube (to stop the enzymatic reaction).\nPour a 10% acrylamide/1x TBE/10% glycerol gel. After removing the comb, wash the wells with 1x TBE. Add 5 µL of a high-mass, hydrophilic polysaccharide (30% Ficoll in H2O) to each tube and load 15 µL from each tube (the loading of wells can again be observed using Schlieren lines).",
    "As a control for G4-DNA mobility, add 4 µL of a high mass, hydrophilic polysaccharide to 20 µL RAB, and load 15 µL; as a control for unwound monomeric Z33, heat 20 µL of RAB at 98 °C for 10 min, add 4 µL of a high mass, hydrophilic polysaccharide, and load 15 µL.\nRun the gel at 120 V for 2 h with 1x TBE as the running buffer. Image the gel on a multimodal imager with fluorescence-imaging capability using TAMRA-specific filters (excite with a 532 nm green laser and use a 580 nm band pass 30 filter (580 BP 30)).\nNOTE: A highly active preparation of rG4R1 will yield complete resolution of TAMRA-labeled Z33 in the first 3 lanes that were loaded on the gel, as shown in Figure 2.\n6. Pooling of Highly Active rG4R1 Preps, Aliquoting, and Storage\nNOTE: This step requires 2 people. The number and enzymatic requirements of the downstream assays that the purified rG4R1 will be used in will determine how many preparations are needed prior to aliquoting. A typical large preparation consists of the pooling of 8 highly active preparations (thus using a total of 16 induced 500 mL bacterial cultures), but this is an arbitrary number and is laboratory-specific.\nCalculate the total volume of highly active, purified rG4R1 that is to be aliquoted. Typically, 7 µL aliquots are used in downstream assays. Fill the block of a thermal cycler set to 4 °C with strip PCR tubes (these will be aliquoted into, as the solid nature of the block will expedite the rapid closing of the PCR strips).",
    "Retrieve the PCR tubes containing highly active rG4R1 from -80 °C and quickly thaw the tubes in hand; when a small amount of ice is left in the tube, place the tubes on ice. Combine all of the quickly-thawed preparations into a prechilled, 15 mL tube and mix well, making sure to minimize bubbles.\nUsing an automatic repeating pipette, dispense the desired aliquot volume into the pre-chilled PCR strip tubes in the thermal cycler. As soon as 1 - 2 strips are completed, have the second person close the lids and transfer them to 96-well wafers that are floating in liquid nitrogen (flash freezing is necessary to preserve enzymatic activity).\nNOTE: Do not take more than about 200 µL of rG4R1 into the tip of the automatic pipette at a time to reduce the time that the enzyme is not at 4 °C.\nOnce the prechilled PCR strip tubes in the thermal cycler have been filled with aliquots and properly frozen, quickly transfer more pre-chilled PCR strip tubes from ice to the thermal cycler and continue aliquoting. Continue in this manner until the remainder of the enzyme has been aliquoted, flash frozen in liquid nitrogen, and transferred to dry ice. Finally, transfer the aliquots to -80 °C for long-term storage.\n7. Quantification of Purified rG4R1 Concentration\nPour a standard 5% stacking/12% resolving acrylamide/SDS gel for protein separation.\nThaw about 50 µL of aliquoted rG4R1, combine into one tube, and mix well. Measure the exact volume with a pipette and add an equal amount of 2x Laemmli sample buffer (65.8 mM Tris-HCl pH 6.8, 26.3% (w/v) glycerol, 2.1% SDS, and 0.02% bromophenol blue) + BME (50 µL/950 µL of 2x Laemmli buffer). Denature the protein at 98 °C for 10 min.",
    "Prepare dilutions of broad-range MW markers in 1x sample buffer + BME such that the following protein amounts can be loaded onto the gel as standards: 31.3, 62.5, 125, 250, and 500 ng.\nNOTE: Each protein standard contained in the broad-range MW markers is present at 0.1 µg/µL, except for the 50 kDa protein, which is present at 0.3 µg/µL. These markers do not need to be heat-denatured.\nRemove the comb from the gel and wash the wells with standard 1x SDS/glycine running buffer. Load the equivalent of 25 and 12.5 µL of rG4R1 (which is 50 and 25 µL of denatured protein), although the optimal volume of enzyme to load should be determined by the user, as the concentration of the enzymatic preparations will vary (e.g., 35 µL was loaded on the gel in Figure 3). Load the protein standards prepared in step 7.3. Ensure that the pipettes are properly calibrated, and make sure to be as precise as possible with pipetting technique to ensure accurate quantification.\nRun the gel at 120 V until the dye front has traversed about 2/3 of the gel (to ensure proper separation of the proteins that make up the broad-range MW markers).\nRemove the gel and dispose of the portion of the gel that will not contain protein by cutting it away with a razor blade. Place the gel in a glass casserole dish or an equivalent receptacle. Stain the gel with Coomassie dye (50 mg of Coomassie R-250 per 100 mL of 50:10:40 v/v methanol:acetic acid:H2O that has been filtered through a filter-paper funnel) O/N at RT on an orbital shaker set to ensure adequate agitation of the gel.",
    "De-stain the gel with 30:10:60 v/v methanol:acetic acid:H2O using balled-up, lint-free tissue paper to expedite destaining. Change the destaining solution as needed. Continue destaining until the background is sufficiently low to visualize rG4R1 and protein standards; a typical gel at this stage is shown in Figure 3.\nPlace the destained gel in between a sheet protector and scan the gel at ≥300 dpi resolution. Open the scanned image in an image analysis software program (such as Fuji Multiguage or equivalent) and prepare standard curves from the protein standards that correspond to 75, 100, and 150 kDa (the curves represent gram amounts versus densitometric readings). Make sure to subtract the background from each lane being quantified during the process of obtaining densitometric values.\nAssuming that the volume amount of rG4R1 that was loaded on the gel contains an amount of protein that is within the linear range of these standard curves, the gram amount of protein per microliter of rG4R1 loaded can be extrapolated.\nConvert the extrapolated gram amount of rG4R1 into a molar amount using the molecular weight of G4R1, which is 120,000 g/mol.",
    "NOTE: For each gel, three extrapolated values will be generated (one for each of the three protein markers used to generate the standard curves: 75, 100, and 150 kDa). Run two further gels and stain and quantify them by repeating steps 7.1 - 7.10. With the results of the quantification for the first gel, the user will be able to gauge how much rG4R1 needs to be loaded on further gels to yield an amount that is within the linear range of the protein standards. Altogether, extrapolate nine values representing the concentration of highly active, purified rG4R1. Average these values to give the final batch-specific rG4R1 concentration, which is typically in the range of 20-100 nM. Calculate the standard deviation from these values (n = 9).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}