{
  "id": 17007,
  "origin_website": "Jove",
  "title": "Local Anesthetic Thoracoscopy for Undiagnosed Pleural Effusion",
  "procedures": [
    "The following protocol will describe how to perform LAT in a clinical setting. The protocol is in accordance with the guidelines of the institution's human research ethics committees (Odense, Næstved, Lleida, Bristol, and Preston). Informed verbal and written consent was obtained from the patients prior to the procedure. Recurrent pleural effusion of unknown cause, despite guideline-based work-up, was included in the study. Exclusion criteria included complete obliteration of the pleural space due to adhesions, skin infection at the site of entry, respiratory failure, cardiac instability, and uncorrectable coagulopathy.\n1. Preparing for the procedure\nExamine the available image and perform thoracic ultrasound (US) to confirm the presence of pleural effusion and a safe distance (>2 cm) from the parietal to visceral pleura at the expected entry site, preferably in the middle of the intercostal spaces 4 or 5 in the midaxillary line12.\nMark the expected entry site with a designated pen.\nIn case of small-volume effusions, induce an artificial pneumothorax by inserting a blunt needle (e.g., 'Boutin needle') or a small-bore chest tube under direct ultrasound guidance. After fluid removal, air is introduced via the needle or drain, and ultrasound confirms the disappearance of lung sliding8,12.\n\t\nIf in doubt, perform a lateral decubitus chest X-ray to confirm the presence and depth of the pneumothorax.\nPlace the patient in the lateral decubitus position on a pillow or roll, facing the operator, with the effusion side up. The pillow/roll spreads the contralateral ribs, making it easier to insert the trocar and cannula, and minimizing the patient's discomfort11.\nPrepare for the sterile procedure according to local standards:\n\t\nFor operator and any assistant: surgical hand scrub, sterile gown and gloves, mask, cap.\nFor patient: cleanse the skin with an alcohol-based sterilizing solution, use sterile draping for coverage while leaving the expected entry site accessible.",
    "For tools: sterile table with a knife, trocar, cannula, endoscope, forceps, suction, and skin suture tools11(see Table of Materials).\nCommence sedation with a benzodiazepine (e.g., midazolam 1 mg/mL) IV in incremental doses, combined with an opiate (e.g., fentanyl 25 microgram/mL) IV in incremental doses to control pain and cough. In select centers, LAT may be performed with thoracic nerve blocks or with remifentanil sedation12.\nEnsure sufficient additional sedation is available during the procedure in case of pain, cough, or agitation.\n2. Patient preparation\nAnesthetize all layers step by step with 20 mL of lidocaine 1% (or mepivacaine 2%) plus adrenaline: the skin, subcutaneous tissue, intercostal muscle, parietal pleura, intercostal nerve, and rib periosteum (the caudal rim of the upper and cranial rim of the lower rib)7,11,18.\nEnd the local anesthesia by checking the correctness of the entry site through the aspiration of pleural fluid (or air if an artificial pneumothorax is present), and note the distance from the skin to the pleural space11,12.\nHave additional doses of local anesthesia available during the procedure in case of pain or agitation.\nPerform skin incision and insertion of trocar and cannula.\n\t\nMake an approximately 10 mm incision in the skin and subcutaneous tissue parallel to the intercostal space to allow for the trocar and cannula to pass easily.\n\t\tNOTE: A longer incision does not add maneuverability and needs to be closed with more stitches, which is associated with the risk of infections19.\nEnsure with the tip of the scalpel that adequate parietal pleural anesthesia has been achieved before trocar insertion.",
    "Perform a careful blunt dissection of the various layers between the skin and the pleura with either a narrow-tip straight or curved forceps until the pleural cavity is entered, and a tract of sufficient width to allow the trocar and cannula to pass has been created.\n\tNOTE: The release of fluid or air (the latter often heard as a 'hiss') confirms the location. Optional: Blunt dissection might not be necessary for semirigid procedures given the smaller diameter of the working channel.\nConsider inserting a closing (\"mattress\") suture (see Table of Materials), which is used later to seal the skin once the post-LAT chest drain is removed.\nGuided by the distance from the skin to the pleural space, insert the trocar and cannula with a cork-screw movement until a sudden release of resistance is felt. Then, remove the trocar and push the cannula forward to lie 1-3 cm within the pleural cavity11,12.\n3. Inspection of the pleural cavity\nEnsure that the thoracoscope image is optimized for focus and color correction, and that the lens has been warmed or has demisting liquid applied.\nFor semi-rigid LAT, insert the thoracoscope via the cannula and apply suction to remove the remaining fluid. For rigid LAT, insert a separate suction tube via the cannula to remove fluid before inserting the camera (Figure 1 and Figure 2).\nInspect the pleural cavity systematically: the apex, mediastinal surface, diaphragm, and costal pleura back to the apex. As with other endoscopic techniques, experts use deliberate and minimal movements to achieve full inspection20,21.\n\tNOTE: If using a rigid setup, initial inspection is best carried out using a 50-degree lens before switching to a 0-degree lens for intervention.",
    "Full visibility of the pleural space may be limited by fibrous pleuro-pulmonary adhesions12. Gently swipe away fine adhesions with the thoracoscope, but avoid those with a vascular supply.\n4. Tissue biopsy\nSample suspicious lesions on the parietal pleura with six to ten biopsies using appropriate forceps with a 'grip and strip' approach (Figure 3A,B). Ensure that there is sufficient penetration of the parietal pleural membrane, as the invasion of subpleural fat can affect mesothelioma T classification8,12.\n\t\nTake care to avoid the visceral pleura due to the risk of lung injury and subsequent persistent air leak.\nExercise caution to avoid the intercostal neurovascular bundle due to the risk of bleeding and neuralgia.\n\t\tNOTE: Safety tip: Feeling the rib with the forceps and obtaining biopsies from the parietal pleura 'on' the rib is believed to reduce the risk of bleeding and damage to underlying vessels.\nFor semirigid thoracoscope procedures, introduce the forceps via the endoscope working channel. Switching to narrow-band imaging may improve the visualization of areas with abnormal vascular patterns13,22.\nFor rigid thoracoscope procedures, introduce over-scope forceps.\nIn the absence of clear malignant infiltration but with strong clinical suspicion of malignancy, perform random biopsies11.\nSend 1-2 biopsies for culture and tuberculosis analysis, especially in endemic areas, or in patients with risk factors23.\nIf pleural infection is suspected during LAT, remove infectious debris (Figure 3C) and adhesions as far as possible12,24. Note that LAT is not an optimal procedure for the clearance of complex or widespread pleural infection9.\n5. Termination and insertion of chest tube\nRemove the thoracoscope and cannula.\nInsert the post-LAT chest tube (typically 16-24 F, see Table of Materials) into the pleural space via the port tract.\nClose the incision with the \"mattress\" suture (as described in 2.6) or use another closing suture.",
    "​NOTE: Talc pleurodesis and/or placement of an indwelling pleural catheter (IPC) can be optionally performed in combination with the LAT procedure and are now standard practice in many centers8. The description of talc pleurodesis or IPC procedures is beyond the scope of the current review.\n6. Follow-up procedures\nRemove the chest tube when air and fluid production ceases, typically within 1-2 h.\n\tNOTE: While a pre-removal chest X-ray or thoracic ultrasound is not mandatory, it may be helpful for assessing lung re-expansion.\nClose the incision with appropriate sutures or adhesive glue (see Table of Materials).\nObserve the patient for stability over 2-4 h.\n\tNOTE: Although a post-removal chest X-ray or thoracic ultrasound is not mandatory, it can be helpful in assessing lung re-expansion. Patients who are well and stable after observation are discharged with a written action plan in case of serious symptoms25.\nAdmit frail patients to the ward for further observation and treatment.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}