{
  "id": 18116,
  "origin_website": "Jove",
  "title": "Generation of Human Nasal Epithelial Cell Spheroids for Individualized Cystic Fibrosis Transmembrane Conductance Regulator Study",
  "procedures": [
    "HNE samples were procured from subjects recruited through the Cincinnati Children's Hospital Medical Center CF Research Center. All methods described here have been approved by the Institutional Review Board (IRB) of Cincinnati Children's Hospital Medical Center. Written consent was obtained from all subjects prior to testing.\n1. Prepare Expansion Media and Antibiotic Media\nGather media components listed in Table 1. Thaw frozen materials at room temperature and make necessary stock solutions as indicated in Table 1 under \"Expansion Media\".\n\tNOTE: Use care when handling cholera toxin, which is toxic if ingested, and is a skin, eye, and respiratory irritant. Make and combine all solutions and media under clean conditions in the biosafety cabinet.\nUsing a 50 mL serologic pipette, remove and discard 50 mL of base medium (Dulbecco Modified Eagle Medium/F12) from one container to compensate for the addition of other materials. Pour all base media by hand into an autoclaved 1 L glass bottle.\nUsing a 50 mL serologic pipette or 1 mL pipette as appropriate, transfer all remaining components from the \"Expansion Media\" section of Table 1 into the autoclaved glass bottle containing the media. Gently swirl the bottle by hand to mix.\nFilter media into a fresh, sterile 1 L, 0.22 µm polyethersulfone (PES) filter flask using the manufacturer's instructions and annotate with \"Expansion Media\" and date.\nPrepare Antibiotic Media. Make necessary antibiotic stock solutions as indicated in Table 1 under \"Antibiotic Media.\"\nUsing a 50 mL serological pipette, transfer 150 mL of Expansion Media to a fresh 250 mL autoclaved glass bottle.\nUsing a 1 mL pipette, add all components from the \"Antibiotic Media\" section of Table 1 into the autoclaved glass bottle containing the media. Swirl by hand to mix until the media is uniform in appearance.",
    "Filter media into a fresh, sterile 250 mL, 0.22 µm PES filter flask using the manufacturer's instructions and annotate with \"Antibiotic Media\" and date.\nStore media at 4 °C for up to one month, discarding if cloudy, suggesting contamination.\n2. Prepare Differentiation Media\nGather media components listed in Table 2. Thaw frozen materials at room temperature and make necessary stock solutions as indicated in Table 2.\n\tNOTE: Use caution when handling retinoic acid, which is a reproductive toxin, can be toxic if swallowed, and causes skin irritation. Make, aliquot, and combine all solutions and media under clean conditions in the biosafety cabinet.\nRemove and discard 52 mL of the base medium from one container to compensate for the addition of other materials. Pour all base media into an autoclaved 1 L glass bottle.\nUsing a 25 mL serological pipette or 1-mL pipette as appropriate, transfer all remaining components from Table 2 to the autoclaved glass bottle containing the media and swirl gently by hand to mix.\nFilter media into a fresh, sterile 1 L, 0.22 µm polyethersulfone (PES) filter flask using the manufacturer's instructions and annotate with \"Differentiation Media\" and date.\nStore media at 4 °C for up to one month, discarding if cloudy, suggesting contamination.\n3. Coat Culture Dishes and Plate Feeder Fibroblasts\nNOTE: Perform all steps under clean conditions in the biosafety cabinet.\nMix 0.5 mL of collagen stock and 37.5 mL of sterile water in a 50 mL conical tube.\nPipette 4-5 mL of collagen solution into each clean P100 culture dish, ensuring the entire surface is covered.\nCover dishes with lids and incubate overnight at 37 °C and 5% CO2.\nIn the biosafety cabinet, remove all dish lids. Swirl solution to cover dish, then aspirate.",
    "Sterilize by exposure to ultraviolet (UV) light for 1 h. Place lids back on the dishes, stack and cover dishes with aluminum foil.\nStore coated dishes at 4 °C for 3-6 months, re-sterilizing under UV light 15-30 min before cell culture use.\n24 h before obtaining a HNE sample, sterilize a pre-coated dish and label as Mouse Embryonic Fibroblast (MEF) and the date.\nAdd the Expansion Media to cover the plate (approximately 5 mL) with a serologic pipette.\nThaw a vial of 2 x 106 irradiated MEFs in a 37 °C waterbath. As soon as the MEFs are thawed, add half of the vial (approximately 106 cells) to the dish with a 1-mL pipette, swirling by hand to disperse.\nIncubate at 37 °C and 5% CO2 overnight in preparation for HNE culture.\n\tNOTE: If necessary, steps 3.7-3.10 can be performed as late as 60 min before plating cells, though overnight is ideal.\n4. Obtain and Process HNE Sample\nEnsure IRB-approved consent/assent is obtained for all subjects.\nHave patient blow nose to clear loose mucus.\nVisualize inferior turbinate using a rhinoscope. Ensure no lesions or polyps are present that may preclude sample collection.\nCollect nasal cells from the first nostril by curettage or brushing.\nCurettage: Bend curette at its midpoint to create a slight, ~135° angle with the apex away from the curette cup. Insert the curette into the nostril and advance the curette cup under the inferior turbinate. Gently press the curette cup against the inferior turbinate and scrape the turbinate by pulling the curette forward, repeating 3-4 times total.\nBrush: Pass the cytology brush below the inferior turbinate, then rotate and move the brush in-and-out slightly 4-5 times, without exiting the nostril.",
    "Place curette/brush in a 15 mL conical filled with Antibiotic Media. Repeat steps 4.3-4.4 for the other nostril, placing the curette/brush into the same conical tube.\nStore conical on ice until ready for processing. Ensure that the processing occurs within 4 h of sample acquisition but can occur as late as 24 h after acquisition if necessary.\n5. Process and Expand HNE Cells in Dishes\nNOTE: Perform all steps under clean conditions in the biosafety cabinet.\nUsing a 1-mL pipette and media from the sample conical, wash all cells off of curettes/cytology brushes into the same conical tube. Once clean, discard curettes / brushes.\nCentrifuge conical at 360 x g and 4 °C for 5 min.\nAspirate supernatant, taking care not to disturb the cell pellet.\nRe-suspend the cell pellet in 3 mL of cell detachment solution, pipetting with a 1 mL tip to homogenize the mixture.\nCentrifuge conical at 360 x g and 4 °C for 5 min.\nRepeat steps 5.3-5.5 once.\nAspirate remaining supernatant, taking care not to disturb the cell pellet.\nRe-suspend the pellet in 1 mL of Antibiotic Media and count cells with a hemocytometer.\nUsing a 1-mL pipette, plate cells dropwise onto the coated, fibroblast-seeded dish prepared in step 3.10. Add Antibiotic Media to fully cover the dish and disperse the cells across the surface. Label dish with contents and date and incubate at 37 °C and 5% CO2.\nAfter 48 h, ensure that the cells are attached to the culture dish. Aspirate the media and replace with enough fresh Antibiotic Media to cover the plate.",
    "Change media 3x weekly, aspirating old media with a vacuum line and Pasteur pipette, and replacing with enough fresh media to cover the plate. After 5 days on Antibiotic Media, change the media to Expansion Media, continuing to replace three times weekly.\n\tNOTE: Contamination risk is high in the first week of culture. Keep fresh samples in a separate incubator to minimize the risk of cross-contamination.\nCheck the cell growth several times weekly. Once cells are approximately 70-80% confluent, proceed to passage cells.\n6. Passage HNE Cells\nPrepare 0.1% Trypsin solution in ethylenediaminetetraacetic acid (EDTA).\n\tNOTE: Use caution handling trypsin, which is a skin, respiratory, and eye irritant.\n\t\nWeigh 15 mg of trypsin from the porcine pancreas in a conical tube.\nWeigh 56 mg of EDTA in a separate conical tube.\nIn the biosafety cabinet, transfer trypsin and EDTA into an autoclaved 250 mL glass bottle. Use a small aliquot of sterile phosphate-buffered saline (PBS) to rinse the trypsin/EDTA tubes to ensure complete transfer.\nAdd sterile PBS to bring the solution total to 150 mL. Close lid tightly.\nIncubate trypsin solution in a 37 °C waterbath until fully dissolved. Check every 15 min and remove promptly once dissolved.\n\t\tNOTE: Do not leave unchecked for prolonged periods of time (e.g., overnight), as trypsin in solution will denature if heated for too long.\nClean bottle with 2-3 sprays of 70% ethanol and return to the biosafety cabinet.\nFilter 0.1% Trypsin-EDTA solution into a fresh, sterile 250 mL, 0.22 µm PES filter flask using the manufacturer's instructions and annotate with contents and date.\nStore trypsin-EDTA solution at 4 °C for up to one month, discarding if cloudy.\nBring Differentiation Media, 0.1% Trypsin-EDTA solution, and sterile PBS to room temperature over 30 min. Clean with 70% ethanol and transfer to a clean biosafety cabinet.",
    "In the biosafety cabinet, use a vacuum line and Pasteur pipette to aspirate and discard media from tissue culture dish. Wash the dish by adding, swirling, and aspirating 5 mL of PBS using a clean serological pipette.\nUsing a 5-mL serological pipette, add 5 mL of 0.1% Trypsin-EDTA solution to the tissue culture dish and return to the incubator at 37 °C and 5% CO2 for 5 min.\nVisualize cells on an inverted microscope at 4-10X. Check that the cells detach from the dish, become round, and float. Gently tap the side of the culture dish to dislodge cells, and/or re-incubate for an additional 5 min until most cells are detached.\n\tNOTE: Take caution to quickly remove cells once detached from the culture dish; prolonged exposure to 0.1% Trypsin-EDTA will impair cell viability.\nUsing a 10 mL serological pipette, add 5 mL of Expansion Media to the dish and collect all liquid contents (10 mL total) into a labeled, sterile 50 mL conical tube.\nIf cells remain adherent to the culture dish, repeat steps 6.4 through 6.6 up to two times, collecting contents in the same conical tube.\nIf cells remain adherent to the culture dish after three rounds of Trypsin solution exposure, use a sterile cell scraper gently remove the remainder. After scraping the dish, wash the scraper and dish with 5 mL of Expansion Media and collect in the same labeled conical tube.",
    "NOTE: If passaging to spheroids, modify this procedure to perform a differential trypsinization. After adding trypsin solution (step 6.4.), check the dish frequently until fibroblasts have detached (typically 1-2 min), leaving only polygonal epithelial cells attached to the dish. Collect and set aside this supernatant, which can be passaged forward for expansion. Repeat steps 6.4-6.6 using the same trypsin solution, and collect only the remaining epithelial cells for spheroid culture.\nCentrifuge conical at 360 x g for 5 min and 4 °C. Aspirate media from conical.\nResuspend cell pellet in 1 mL of Expansion Media and count cells using a hemacytometer.\nOnce quantified, cells can be divided if necessary and either passaged forward onto a new culture dish (including preparation of fibroblast co-culture, step 3, and plating cells for expansion, steps 5.9-5.12) or cultured as spheroids (step 7).\n\tNOTE: If passaging to a new culture dish for expansion, a seeding density of 0.5-1 × 106 cells in a P100 dish is recommended.\n7. Seeding Cells for HNE Spheroid Cultures\nNOTE: Carry out all procedures in this step, other than centrifugation, in a clean biosafety cabinet.\nThaw the basement membrane matrix on ice per manufacturer's instructions (100 µL per spheroid well).\n\tNOTE: Consider making sterile 500 µL aliquots of the basement membrane matrix on receipt; this amount will seed a single 4-well plate.\nSeparate an appropriate number of differentially trypsinized, passaged cells (from step 6.9) for a final concentration of 500,000 cells per mL of the matrix. For a 4-well plate, use 200,000 cells. Collect in a 1.5 mL tube.\nCentrifuge cell and media mixture at 360 x g for 5 min at 4 °C. Completely, but carefully aspirate and discard media using a 1 mL pipette, taking care not to disturb the cell pellet.",
    "Using a 1 mL pipette tip, add 100 µL per planned well of the basement membrane matrix to the 1.5 mL tube containing the cells. Keep the tube on ice.\nPipette up and down to carefully and thoroughly resuspend cells in the basement membrane matrix. Move quickly to avoid solidification of the matrix. Avoid completely emptying the pipette tip to ensure air bubbles are not introduced into the matrix/cell mix.\nSeed 100 µL matrix aliquots into each well of a 4-well IVF culture plate.\nUsing a clean pair of scissors, trim off the distal 3-4 mm of a 200 µL pipette tip.\nUsing the trimmed tip, carefully pipette 100 µL of the cell/matrix mixture into the center of each well. Pipette slowly, with the goal of making a single matrix \"drop\" in the center of each well. The drop should remain spherical, and should not touch the sides of the well. When moving the plate, do so carefully as to avoid disturbing these drops.\nIncubate the basement membrane matrix drops at 37 °C and 5% CO2 for 30 min, until solid.\nCarefully pipette 500 µL of Differentiation Media into each well, taking care not to disturb the matrix drop. Ensure that the media just cover the matrix drop and add more if necessary.\n8. Differentiate and Mature HNE Spheroids\nUsing a 1 mL pipette tip, gently aspirate all media from well; avoid aspirating the matrix, which will destroy spheroids in that portion of the matrix, though any spheroids left behind may remain viable.\nUsing a fresh 1 mL pipette tip, gently add 500 µL of differentiation media to the well around the matrix. Do not touch the matrix with the pipette and avoid disturbing the matrix drop.",
    "Return spheroids to the incubator at 37 oC and 5% CO2 for ongoing growth. Repeat steps 8.1 through 8.3 three times weekly.\nEvaluate spheroid morphology daily under an inverted microscope at 20X. Spheroids should form within 3-5 days of plating, and reach maturity within approximately 10 days.\n9. Pretreat, Stimulate, and Image HNE Spheroids for Analysis\nPretreat spheroids as desired prior to imaging as previously described30.\n\tNOTE: For VX809 pretreatment, add 3 µM of VX809 to the media for 48-72 h prior to imaging. Mix 1 µL of 10 mM VX809 stock (see Materials Table) in 3.3 mL of media for this concentration.\nChange each well of spheroids to 1 mL of fresh Differentiation Media, including pretreatment (steps 8.1-8.3) before imaging spheroids.\nPrepare fresh stimulation drugs solutions (Forskolin, 3-isobutyl-1-methylxanthine [IBMX], VX770, and CFTR Inhibitor 172 [Inh172]) from stocks (see Materials Table). For forskolin/IBMX, add 1 µL of each stock to 98 µL of sterile water in a single labeled 1.5 mL tube. For VX770 and Inh172, add 1 µL of each stock to 99 µL of sterile water in separate labeled 1.5 mL tubes. Make a total volume allowing for 50 µL of solution for each well tested. Prepare solutions under sterile conditions in the biosafety cabinet.\nTransfer spheroid plate to an incubated chamber set to 37 °C and 5% CO2, mounted on an inverted microscope equipped with electronic image capture software and a mechanical stage for XY adjustment. Turn on the microscope and camera, as well as the imaging computer.\nCapture baseline images of spheroids in one well.\nOpen the image capture software (Slidebook 5.5 for directions below). Once initialized, open a new file by clicking \"File\", then \"New\". Name the file accordingly and click \"Save\".",
    "Carefully remove the culture plate lid and center one matrix drop over the objective.\nStarting at the top of the matrix drop, move in a grid to find spheroids at 20x magnification with the microscope eyepiece. Focus up and down to capture the sphere at its widest point. Annotate the location of each spheroid on a map of the matrix drop to re-identify after imaging.\nIn the software, click \"Image-Capture\". For Exposure, select \"Manual\" and enter 50 ms. Ensure other settings are appropriate (Bin Factor: 1x1, W: 512, H: 512, X and Y Offset: 0). Enter an appropriate name for each image in the \"Name\" box (e.g., Spheroid 1 Baseline). Click \"Start\" to view a live image, and \"Save\" to capture a baseline image.\nRepeat steps 9.5.1-9.5.4 until goal number is reached, or entire matrix drop is imaged.\n\t\tNOTE: Group differences can be detected with as few as 3-5 spheroids per condition, however, it has become our practice to image 10 or more spheroids per condition to increase power. Variability of the assay is demonstrated in Figure 2 of the \"Representative Results\" section, with samples of 8-10 spheroids per subject as an example.\nStimulate spheroids.\nUsing a 200 µL pipette, add 50 µL of the appropriate stimulation drug into the media within the well, taking care not to disturb the matrix.\n\t\tNOTE: After this 10-fold dilution (50 µL into 500 µL of media), the final drug concentration will be: forskolin 10 µM, IBMX 100 µM, VX770 1 µM, Inh172 10 µM.\nFor cAMP only, add only forskolin/IBMX.\nFor cAMP + VX770, add forskolin/IBMX first, then VX770 after 2 min.\nFor inhibited conditions, add Inh172 first, then forskolin/IBMX after 2 min.",
    "Immediately after stimulation, monitor spheroid swelling by timelapse imaging for 1 h. In the software, click \"Image-Capture\". Click \"Timelapse\", and set the interval to 30 s, with a duration of 60 min. Enter an appropriate name and click \"Save\" to start timelapse.\n\tNOTE: Standard timelapse is to capture images of a single spheroid every 30 s to ensure a high-quality video. Alternatively, perform lower-magnification capture of the entire well (e.g., 4X), and fewer images captured if desired. If an automated stage is used, perform timelapse of all spheroids using predefined coordinates; otherwise, use timelapse of a subset of spheroids to provide a qualitative review of swelling and to ensure no systematic issues arise during imaging (e.g., matrix detachment from the well).\nImmediately upon completion of the 1 h timelapse image, capture post-stimulation images of all spheroids (per step 9.5) using the map created in step 9.5.3.\nRefer to pre-stimulation images to ensure the same plane of focus is used for follow-up images (the focal quality of surrounding cells, spheroids, or debris greatly facilitate this process).\nSave files with a paired annotation from step 9.5.4 (e.g., Spheroid 1 Post-Stimulation).\n\t\tNOTE:Complete this step immediately after the timelapse, as spheroids may continue to swell.\nReplace media in the imaged well with fresh Differentiation Media.\nRepeat steps 9.5 through 9.9 for each well/condition, adjusting stimulation drugs as indicated for experimental conditions.\nOnce all imaging is completed, return spheroids to the incubator at 37 °C and 5% CO2.\n\tNOTE: Depending on the sterility of the incubated microscope chamber, post-stimulation contamination of spheroids can be quite common. Either keep imaged spheroids in a separate incubator, to minimize cross-contamination risk, or discard spheroids immediately after imaging.\n10. Analyze HNE Spheroid Images",
    "Export all captured images to a format compatible with image analysis software. In the software, click \"View\", hover over \"Export\", and select \"Default Views of All Images as TIFF...\". Save to the hard drive or a flash drive for analysis.\n\tNOTE:A commercial analysis software (Table of Materials) and .tiff files perform well and are described here, though analysis can also be performed using other platforms. When naming files, staff analyzing images should be blinded to the experimental conditions, but aware of which images are paired (pre- and post-stimulation) to ensure equivalent analysis.\nUsing analysis software, delineate the luminal area of each spheroid image and export into a data analysis software.\nOpen analysis software. Click \"File\", then \"Open\" and navigate to the file folder containing spheroid images. Select all images for analysis and click \"Open\".\nClick \"Measure\" and select \"Region Measurements\". Within the Region Measurements dialog box, select the droptab \"Configuration\" and ensure \"Image Name\" and \"Area\" boxes are checked.\nClick \" Log\" and select \"Open Data Log\". Click \"OK\" on the Data Log dialogue box and name file accordingly (e.g., Condition X, Date). This will transfer all measurements to a spreadsheet.\nSelect \" Trace Region\" tool button and carefully trace the lumen of the spheroid in the first image for analysis. In the Region Measurement dialogue box, click \" Log Data\" to log the measurement into Excel.\nRepeat steps 10.2.2-10.2.4 until all spheroids are analyzed.\nCalculate the percent change (100 * [Post-stim - Baseline] ÷ Baseline) in the luminal area from baseline for each individual spheroid image pair and compile data for analysis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}