{
  "id": 9057,
  "origin_website": "Jove",
  "title": "Polysome Profiling in Leishmania, Human Cells and Mouse Testis",
  "procedures": [
    "All animal treatments and handling of tissues obtained in the study were performed according to protocols approved by the Institutional Animal Care and Use Committee at the Texas Tech University Health Science Center in accordance with the National Institutes of Health animal welfare guidelines, protocol number 96005. Please sacrifice vertebrate animals and prepare tissues according to the guidelines from the Institutional Animal Care and Use Committee. If lacking such a committee, please refer to the National Institutes of Health animal welfare guidelines. Adult (>60 day old) C57BL/6 mice were used. All animals and tissues were obtained according to protocols approved by the Institutional Animal Care and Use Committee at the Texas Tech University Health Sciences Center in accordance with the National Institutes of Health animal welfare guidelines. For euthanasia, a single mouse was placed in a small chamber, and the air was displaced gradually with about 30% carbon dioxide to anesthetize and minimize the distress of the animal. Following cessation of breathing, we used cervical dislocation to confirm the death of the animal before harvesting tissues.\nCaution: All work with live Leishmania and cultured human cells was done in biosafety cabinet in BSL-2 certified laboratory.\n1. Preparation of Cytoplasmic Lysates from Leishmania Major , Cultured Human Cells, and Mouse Tissues\nNOTE: There are several differences in the lysate preparations from the different source materials. Other steps including sucrose gradient preparation and polysomal fractionation are identical and do not depend on sample source.\nLeishmania major cytoplasmic lysate preparation\nInoculate Leishmania major (FV1 strain) cells in 30 mL of 1x M199 medium29 containing 10% Fetal Bovine Serum (FBS) and penicillin/streptomycin mixture (100 units and 100 μg/mL correspondingly) at density of 1x105 cells/mL.\n\t\tNOTE: All steps involving Leishmania major cells must be conducted in a biosafety cabinet.",
    "Place cells in the incubator and grow them at 27 °C until the logarithmic phase (mid log corresponds to 5x106 cells/mL). It usually takes about two days to grow.\nAdd cycloheximide to Leishmania major culture to a final concentration of 100 μg/mL to arrest the ribosomes on translated mRNAs. Place cells back in the incubator for 10 min at 27 °C.\nAfter cycloheximide treatment is completed, transfer cells to a 50 mL conical tube and spin them at 1,800 x g and 4 °C for 8 min. Discard supernatant.\nWash cells with 30 mL of Dulbecco's phosphate buffered saline (DPBS). Centrifuge at 1,800 x g and 4 °C for 8 min.\nDiscard the supernatant. Resuspend cells in 1 mL of DPBS.\nTake an aliquot of cells and mix it with 3.5% formaldehyde solution.\nCount cells by hemocytometer and determine their concentration. Transfer the desired number of cells into microfuge tube. Lysate prepared from 0.5x108-2x108 cells/mL is sufficient for one sucrose gradient loading.\nSpin the cells at 1,800 x g and 4 °C for 8 min. Discard the supernatant.\nResuspend the cell pellet on ice in 1 mL of lysis buffer containing protease inhibitors and RNase inhibitor (20 mM HEPES-KOH, pH 7.4, 100 mM KCl, 10 mM MgCl2, 2 mM DTT, 1% NP-40, 1x protease inhibitor cocktail (EDTA-free), 200 units/mL RNase inhibitor).\nPass the lysate through a 23-gauge needle three times. The lysate should become transparent after passage through the needle.\nCentrifuge at 11,200 x g and 4 °C for 10 min to clarify lysate. Transfer the clarified lysate to a fresh tube and keep it on ice until sucrose gradient ultracentrifugation.",
    "Collect 400-500 μL of the lysate as input (to analyze later), freeze it right away in liquid nitrogen for future protein analysis or add RNA purification reagent before freezing for RNA analysis.\nCytoplasmic lysate preparation from cultured human HeLa cells\nSplit HeLa cells and seed them into 20 mL of the DMEM medium containing 10% FBS and penicillin/streptomycin mixture (100 units and 100 μg/mL correspondingly) with cell count 2x105 cells/mL in a 15 cm plate.\nGrow HeLa cells at 37 °C, 5% CO2 for 20-24 h. Perform plasmid DNA transfection according to manufacturer's protocols.\nPropagate cells for 24 h after transfection at 37 °C, 5% CO2.\nAdd cycloheximide to grown HeLa cells to the final concentration of 100 μg/mL to arrest the ribosomes on translated mRNAs and incubate cells for 10 min at 37 °C, 5% CO2. Aspirate medium. Wash the cells twice with cold DPBS on ice.\nAdd 500 μL of lysis buffer (20 mM HEPES-KOH pH 7.4, 100 mM KCl, 5 mM MgCl2, 1 mM DTT, 0.5% NP-40, 1x protease inhibitor cocktail (EDTA-free), 200 units/mL of RNase inhibitor or 1 mg/mL heparin) to the plate and scrape the cells on ice.\nTransfer the lysed cells to the microfuge tube. Adjust the concentration of NP-40 to 0.5% and MgCl2 to 5 mM according to the increased volume of the sample.\nPass the lysate through a 23-gauge needle 3-6 times.",
    "Spin at 11,200 x g and 4 °C for 8 min to clarify lysate. After centrifugation, transfer supernatant to a new tube. Use a spectrophotometer to evaluate cell lysis efficiency and to determine sample amount for the loading on the gradient. Add 10 μL of sample to 0.5 mL of 0.1% Sodium Dodecyl Sulfate (SDS). Blank against 0.1% SDS. Measure absorbance at 260 nm. Expected absorbance value is around 15-20 units/mL.\nDilute all samples with lysis buffer to the same absorbance value before sucrose gradient centrifugation. Keep samples on ice until sucrose gradient centrifugation.\nCytoplasmic lysate preparation from mouse testis\nDissect the mouse testis. Make a small incision in the tunica albuginea and collect the seminiferous tubules of the testes and transfer them in a 15 mL conical tube containing 5 mL of DPBS supplemented with 0.1 mM phenylmethylsulfonyl fluoride (PMSF).\nMix the tissue vigorously by inverting several times. Allow the tissue to settle at unit gravity on ice for 5 min.\nRemove and discard the cloudy buffer containing connective cells and tissue fragments. Repeat the procedure 2-3 more times. The remaining white pellet is enriched for seminiferous tubules and germ cells.\nTransfer the seminiferous tubule pellet to a 2 mL microcentrifuge tube and spin at 500 x g for 1 min. Discard the supernatant.\nAdd 500 µL of lysis buffer (20 mM Tris-HCl, pH 7.4, 100 mM KCl, 5 mM MgCl2, 1 mM DTT, 0.5% NP-40, 1x protease inhibitor cocktail (EDTA-free), 1 mg/mL heparin or 200 units/mL of RNase inhibitor) to the tubules. Use a pipette to triturate the tissue.\nTransfer the suspension to a small (0.5-1.0 mL) Dounce homogenizer. Disrupt the tissue with seven to eight strokes of the glass pestle.\nTransfer the lysate to a 1.5 mL microcentrifuge tube.",
    "Centrifuge the sample at 12,000 x g and 4 °C for 8 min to clear the lysate. Transfer the supernatant to a new tube and store on ice until loading on the sucrose gradient.\nCollect 50 μL of the lysate as input sample, freeze it right away at -80 °C for future protein analysis; or add RNA purification reagent before freezing for RNA analysis.\n2. Sucrose Gradient Preparation and Ultracentrifugation\nPrepare two sucrose gradient solutions (20 mM HEPES-KOH, pH 7.4, 100 mM KCl, 10 mM MgCl2, 1 mM DTT, 1x protease inhibitor cocktail), containing either 10% sucrose or 50% sucrose. (Tris-HCl, pH 7.4, can be used instead of HEPES). Add 200 units/mL RNase inhibitor or 1 mg/mL heparin according to the experimental design. Place an ultracentrifuge tube for SW 41 rotor into the marker block and draw the line along the upper level of the block. Transfer the tube into a stable rack.\nTake a 10-mL syringe with the layering device attached and fill the syringe with 10% sucrose solution (prepared as above). Gently release it at the bottom of the ultracentrifuge tube until it reaches the mark on the tube.\nFill another syringe with 50% sucrose solution and carefully insert its layering device through the 10% sucrose layer to the bottom of the tube. Gently release sucrose solution starting from the bottom until it reaches the mark on the tube. Seal the tube with the provided cap.\nTo prepare the sucrose gradient, turn the gradient maker device ON. Level the plate using the UP or DOWN buttons and press DONE. Leveling is important for linearity of the gradient.",
    "After leveling the plate press GRAD to open the gradient menu. Go to LIST on the gradient menu and select the SW 41 Ti rotor. Then choose the desired sucrose gradient from the list of the menu using UP and DOWN buttons. Press USE.\nPlace the gradient tube holder on the gradient maker plate. Transfer the tube into the holder. Up to 6 gradients can be prepared at the same time. Press RUN. The gradient maker rotates the tubes at the programmed speed and angles forming a linear gradient. It will take only a few minutes to prepare the gradient.\nWhen process is completed, place the tubes in a rack. Take the caps off. Remove the same volume as the sample volume from the top of the ultracentrifuge tubes.\nCarefully load 400-500 μL of lysate containing 15-20 A260 units of polysomes on the top. Place the tubes in the rotor buckets and balance them.\nCentrifuge at 260,000 x g and 4 °C for 2 h using SW 41 rotor.\n3. Polysome Fractionation and Sample Collection\nNOTE: While lysate preparations have some differences depending on the source, gradient preparation and polysome fractionation protocols are the same for all types of lysates.\nAfter completion of the ultracentrifugation, place the rotor buckets with the tubes on ice. Turn fraction collector and gradient fractionator ON. Click SCAN on the fractionator menu. Put a rack with 24 collection tubes into the fraction collector.\nFill up a rinse reservoir on the side of the fractionator with deionized water. Press the RINSE key for 10 s to rinse the pump on fractionator. Attach a rinse adaptor with the syringe filled with water to the piston for the calibration.",
    "Open the fractionator software on the computer. Press CALIBRATE. Use the DEFAULT settings and press OK. Be ready to inject water from syringe.\nPress OK to do calibration. Immediately start injecting water for the next 5 s. During this time, water will flow through the UV detector flow cell and the instrument will be calibrated. The sign ZERO CALIBRATION COMPLETED will appear. The instrument is ready for fractionation.\nRemove the rinse adaptor with the syringe. Attach a tip to the piston of the fractionator.\nOpen the brass air valve and press AIR key for 10 s to dry tubing and flow cell. Close the air valve.\nGently remove the gradient tube from the rotor bucket and place it in the rack. Apply the tube holder cap to the top of the tube and carefully move the tube into the tube holder and lock it in position.\nPlace the holder under the piston of the fractionator. Often, polysomal bands can be seen by eye. Introduce the desired settings for fraction numbers and volume (24 fractions at 500 μL/fraction are usually sufficient). Name the file appropriately. Press OK, and then GO TO GRAPH button. In the next window, press START SCAN. Settings will appear, press OK. The collector will move from the gutter to the first fraction and the piston will move into the tube. When the piston reaches the top of the gradient it will slow to the selected speed and the fractions will be collected. When completed, the piston moves out of the gradient tube.\nOpen the brass air valve and press AIR key on the fractionator to retrieve the last fraction.\nMove the tubes from the rack on ice.",
    "Add 2 volumes of RNA purification reagent to each fraction and flash freeze in liquid nitrogen until RNA purification. Alternatively, if protein needs to be analyzed, add trichloroacetic acid to the final concentration of 10% to concentrate them for Western blotting (see Section 8).\n4. Preparation of Synthetic RNA In Vitro for Normalization of mRNAs Levels During RT-qPCR Data Analysis\nNOTE: The E. coli OmpA mRNA is used in this protocol for normalization. Any other RNA that does not have extensive identity with the mRNAs of the studied organism (mammalian or Leishmania) can be used.\nPrepare the OmpA DNA fragment containing SP6 promoter sequence by a standard PCR reaction from a plasmid containing OmpA gene30.\nPrepare 100 µL of the mixture: 80 mM HEPES-KOH, pH 7.5, 16 mM MgCl2, 2 mM Spermidine, 10 mM DTT, 3 mM ATP, 3 mM CTP, 3 mM UTP, 3 mM GTP, 0.5 U/μL RNase inhibitor, 1 μg of OmpA PCR DNA, 3 μL SP6 RNA polymerase, 0.005 U/μL pyrophosphatase.\nIncubate at 40 °C for 2 h.\nPurify RNA by a RNA purification kit.\nMeasure concentration by spectrophotometer and examine by agarose gel electrophoresis.\n5. RNA Isolation from Gradient Fractions and cDNA Preparation\nNOTE: Proceed directly with this protocol for RNA purification if an RNase inhibitor was used as a ribonuclease inhibitor. However, when used as a ribonuclease inhibitor, heparin will inhibit reverse transcriptase used in cDNA preparation. Therefore, additional purification of RNA will be needed if heparin was used in the lysis buffer and gradient. See Section 6 to prepare RNA for cDNA synthesis if heparin was used.",
    "Thaw the samples containing RNA purification reagent, add 20 ng of synthetic RNA as internal control for normalization of RT-qPCR results. Proceed with RNA preparation according to the manufacturer's protocol except one modification. Add 1 µL of RNA grade glycogen (20 µg) prior isopropanol precipitation. Dissolve RNA pellets in 20-25 µL of RNase-free water.\n\tNOTE: Glycogen serves as a carrier and helps to avoid losses and visualize RNA pellet during purification. OmpA mRNA is used for further normalization in RT-qPCR reactions.\nMeasure RNA concentration using spectrophotometer to ensure adequate yield. Combine equal volumes of RNA fractions containing 40S, 60S and monosomes as prepolysomes. Fractions containing 2-4 ribosomes combine as light polysomes and fractions with 5-8 ribosomes combine as heavy polysomes.\nUse 5-10 µL of RNA from combined fractions to prepare cDNAs using a kit and following manufacturer's recommendations.\nAdd 80 µL of nuclease free water to 20 µL of cDNA. Freeze the cDNA samples at -20 °C.\n6. RNA Purification from Heparin Contamination\nNOTE: Heparin inhibits nucleic acid processing enzymes such as reverse transcriptase. Therefore, use this additional purification protocol when heparin is used in the lysis buffer and/or in the gradient.\nAdd LiCl to a 1 M final concentration to the purified RNA samples.\nMix the samples and incubate on ice for 1 h.\nSpin the samples at 16,000 x g and 4 °C for 15 min.\nRemove the supernatant as complete as possible using a pipette.\nAir-dry the pellets for about 5 min.\nRe-suspend the pellets in the initial volume of RNase-free water.\nPerform spectrophotometric measurement at 260 nm to determine the concentration of the RNA. Usually, the loss of the sample is minimal.\n7. RT-qPCR and Data Analysis of mRNA Distribution",
    "Combine 10.2 μL of water, 20 μL of SYBR Green, 4.8 μL of gene specific primers (2.5 μM each set), 5 μL of cDNA, mix well and load 10 μL per well in triplicates into 384-well plate.\nCover plate with adhesive film tightly and centrifuge plate at 1,800 x g for 5 min.\nUsing a Real-Time PCR instrument set up qPCR reaction under conditions shown in the Table 1.\nUsing the cycle threshold (CT) values and the comparative CT (ΔΔCT) method31 calculate the percentage (%) of mRNA distribution in prepolysomes, light, and heavy polysomes as described32 with one modification. Use synthetic RNA (OmpA here) for data normalization in RT-qPCR data analysis. The synthetic RNA provides a normalization control that allows to calculate relative mRNAs levels and compare them in different fractions of a gradient.\n8. Analysis of Proteins in Polysomal Fractions by Western Blotting\nFrom a 100% (w/v) stock, add trichloroacetic acid (TCA) to the selected fractions (500 μL) to a final concentration of 10%, keep on ice for at least 15 min, centrifuge in a microfuge for 5 min, discard supernatant, wash twice with ice-cold acetone and dissolve in 25 μL of SDS-PAGE sample loading buffer for electrophoresis.\nLoad on the SDS-PAGE and conduct standard electrophoresis with following transfer to the PVDF membrane. Proceed to Western blotting33.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}