{
  "id": 13412,
  "origin_website": "Jove",
  "title": "Fetal Mouse Cardiovascular Imaging Using a High-frequency Ultrasound (30/45MHZ) System",
  "procedures": [
    "The University of California, Los Angeles, Animal Care and Use Committee has approved all procedures shown in this protocol. The experiments were conducted as part of an ongoing study under active animal protocols approved by the institutional Animal Care and Use Committee of University of California, Los Angeles, California, USA. Animal handling and care followed the standards of the Guide for the Care and Use of Laboratory Animals.\n1. Preparing the High Frequency Ultrasound Imaging System\nTurn on the ultrasound imaging system and the physiology monitoring unit.\nConnect the 30/45 MHz transducer.\nPlace the corresponding scan head on its holder near the imaging platform.\nSelect the Cardiac Measurement Program option.\nPlace the ultrasound gel upside down in its pre-warming container set to 37 °C.\nConfirm appropriate tubing system for anesthesia and verify the levels of oxygen and isoflurane.\nDisinfect the imaging platform and the working area.\nSet the heat level of the imaging platform to maintain constant body temperature and heart rate of the dams.\n2. Pregnant Mouse Preparation\nPlace the pregnant mouse (C57/BL6) dam in the anesthesia induction chamber.\nInduce anesthesia by using continuously delivered inhalational isoflurane (isoflurane 2%-3%) mixed with 100% oxygen (100% O2) at a flow rate of 200 mL/min in the induction chamber.\nTransfer the sedated animal onto the imaging platform in a supine position.\nProvide steady-state sedation by using a facemask connected to the anesthesia tubing system-delivering isoflurane (1.0% - 1.5%) mixed with 100% O2 at 200 mL/min.\n\tCAUTION: Control the leakage of anesthetic gas by using a ventilation system equipped with a charcoal filter containing canister set.\nTape the limbs gently to the embedded electrocardiographic electrodes after application of the electrode gel to achieve constant monitoring of maternal cardiac and respiratory rates.",
    "Adjust the level of isoflurane to maintain an average heart rate of (450 +/- 50 beats/min (bpm)).\nMaintain the body temperature within a range of 37.0 °C +/- 0.5 °C. Monitor the body temperature and heart rate being displayed on the physiology controller unit.\nDocument the vital signs of the sedated mouse every 15 min throughout the imaging procedure.\nAssess the level of anesthesia by evaluating the mouse's posture, heart rate, and response to toe pinches.\nApply ophthalmic balm (1 drop into each eye) to prevent eye dryness and corneal damage.\nRemove the fur from the mid-chest level to the lower limbs by using a depilatory cream to minimize ultrasound attenuation. Remove cream 1-1.5 min after application by alternating wet and dry gauze wipes to prevent damage to the skin.\n3. Embryo Identification\nPalpate the abdominal wall gently to locate the fetuses and spread them out.\nAnnotate each embryo on the dam's abdomen and define their anterior-posterior and dorsal-ventral orientations by using a marker.\nUse the cervix of the sedated dam as a landmark. Label the fetuses on the left and right uterine horns as L1, L2,L 3, etc. (left side) and R1, R2, R3, etc. (right side), respectively (Figure 1A).\n\tCAUTION: Avoid spreading the fetuses forcefully. 1-2 fetuses in each litter may overlap with the others, making their positioning and imaging unreliable. Exclude these fetuses from the analysis.\n4. Fetal Heart Visualization and Annotation\nApply pre-warmed ultrasound gel on the abdomen and spread it carefully to avoid bubble formation. Add additional amount of gel on the area of scan imaging.\nPlace the ultrasound probe on its mechanical holder and mobilize it gradually towards the skin to contact with the thick gel layer while looking for the beating heart using the scanning B-Mode (Figure 1).",
    "Click the scanning B mode button to obtain 2-D images. Use the bladder as a landmark to identify the first fetus positioned in the right or the left uterine horn and mark it as R1 or L1, respectively.\nConfirm the right and left orientation of the individual fetus in real time by moving the imaging platform in the horizontal plane. Scan from head to tail to annotate the snout, the limbs, and the spine as landmarks (Figure 1B, Video 1).\nVisualize the beating heart and annotate the left ventricle (LV) and the right ventricle (RV). Use color Doppler mode to optimize the heart visualization (Figure 1 C-G, Videos 1-2).\nClick the scanning B mode button to obtain a parasternal short axis-view, have the LV and RV displayed in their maximum diameter at the center of data acquisition frame. Start live imaging (Figure 1B-C).\nChange the orientation of the mouse with respect to scanning planes to obtain a longitudinal four-chamber view (Figure 1D). First, identify the remaining structures of the heart such as the atria, interventricular septum, and left and right outflow tracts. Next, have the ventricular and atrial chambers displayed in their maximum diameter. Then start image acquisition.\nExclude the non-optimal, oblique images from the final analysis. Click the Cini button to obtain continuous recording 'Cineloops' for a minimum of 10 s, then save the recorded images.\n5. Evaluating Fetal Heart Rate and Ventricular Function\nClick the scanning M-mode button to obtain cardiac images from four chamber planes (Video 3).\nView the list of the recordings for analysis once the images of all the embryos are complete.\nExclude the non-optimal, oblique images from the final analysis.",
    "Click the analysis button to measure wall thickness and the left/right ventricular internal diameter at diastole (LVID, d; RVID, d) and systole (LVID, s; RVID, s), as shown in Figure 2.\nDetermine the average fetal heart rate by playing each recorded M-mode tracing and calculating the measurement of one flow cycle to the following flow cycle (the spacing between adjacent peaks).\nPerform multiple measurements (at least 5 per tracing) to obtain the average heart rate (Figure 2).\nMeasure the temporal changes between left ventricular internal diastolic diameter (LVID, d) and left ventricular internal diameter at end systole (LVID, s) throughout the cardiac cycle. Then calculate fractional shortening percentage (FS%) as follows: FS%=[(LVID,d-LVID,s)/LVID,d]x100.\nPerform multiple measurements (at least 5 per tracing) to obtain the average FS% values.\n6. Evaluating Cardiopulmonary Flow Parameters\nAdjust the sector at an angle of acquisition less than 60o. Click the Doppler Button to perform pulsed wave Doppler measurements from the 2-D four chamber-imaging plane by using a 45-MHz transducer.\n\t\nFirst, visualize the bifurcation of the pulmonary artery to identify the right outflow tract. Next, click pulsed wave Doppler button to obtain the flow pattern through the pulmonary and the aortic valves (Figure 3A, Video 4).\nObtain pulmonary flow measurements from pulsed wave Doppler tracing, including peak systolic velocity (PkV), acceleration time (AT), and ejection time (ET).\nPerform multiple measurements (at least 5 per tracing) to obtain average measurements as shown in Figure 3A (right).\nCalculate the AT/ET ratio for each outflow valve as an indicator of the outflow tracts patency and blood flow.",
    "Proceed to obtain the mitral and aortic flow patterns from 2-D apical four chamber views using the pulsed wave Doppler. First, identify the left atrial and left ventricular chambers. Next, place the pulsed wave Doppler sample volume for recording of mitral inflow Doppler patterns and measuring early diastolic velocity ( E) and atrial contraction velocity ( A) (Figure 3B)24,25.\nAdjust Doppler sample volume to obtain the aortic Doppler jet pattern. Use the aortic Doppler jet tracing to measure acceleration time (AT) and ejection time (ET) as shown in Figure 3B (right) (Video 5)\n7. Evaluating the Feto-Placental Axis\nUse the color Doppler scan to visualize the uterine artery and feto-placental vascular tree by using the 45 MHz transducer (Figure 4A).\nIdentify the umbilical vessels (two arteries and one vein) in the intra-amniotic segment of the umbilical cord, just after the cord exits from the fetal abdomen.\nPlace pulsed wave Doppler sample volume to obtain the umbilical artery flow pattern (Figure 4A).\nMeasure vascular peak flow parameters including acceleration time (AT), ejection time (ET), and peak flow velocity at end systole (PkV, s) using the pulsed wave Doppler scanning record (Figure 4B).\nObtain 5 consecutive waveforms in each vessel, in the absence of fetal movements and maternal respiratory movements, to measure the average peak velocity for each vessel.\nProceed to the next embryo.\n8. Post-Imaging Animal Monitoring\nTurn off the isoflurane container following the completion of the imaging process.\nContinue monitoring body temperature, respiratory rate, and heart rate during the recovery phase.\nRemove the facemask and the connected tubing system once the dam starts spontaneous movements.\nReturn the dam to the appropriate housing and continue observation according to standard institutional post-procedure protocols.\nDocument the time to full resumption of normal activity.\n9. Performance Requirements and Technical Considerations",
    "Limit the processing time for ~8 fetuses to approximately 1 h to avoid the adverse effects of prolonged anesthesia on vital signs and physiological parameters.\nComplete training with 8-10 pregnant mice to optimize techniques for image acquisition and flow patterns tracing in a short time frame.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}