{
  "id": 8758,
  "origin_website": "Jove",
  "title": "The Identification of Sea Lamprey Pheromones Using Bioassay-Guided Fractionation",
  "procedures": [
    "All methods described here have been approved by the Institutional Animal Care and Use Committee of Michigan State University (AUF# 03/14-054-00 and 02/17-031-00).\n1. Collection and Extraction of Sea Lamprey Conditioned Water\nPlace sexually mature male sea lampreys (15 - 30 animals) in a tank supplied with 250 L of aerated Lake Huron water maintained at 16 - 18 °C.\nCollect the male-conditioned water throughout each night from June to July.\n\tNote: Sea lampreys naturally die after spawning. If a fish is nearing this point in its life, replace it with a fresh mature male.\nExtract the conditioned water by solid phase extraction.\n\t\nSoak the resin in methanol for 4 h before loading it into a column. Load the resin into the column, then pump 10 L of water through the column to eliminate the organic solvent.\nPass the conditioned water from the tank holding the fish via the pumping system to the top of the column. The water passes through a bed of 2 kg of moderately polar polymeric ion-exchange resin (e.g., Amberlite XAD-7 HP resin), contained in a series of four 2.5 L-capacity glass columns. Maintain load speeds between 400 and 600 mL/6 min. Elute the metabolites with 10 L of methanol followed immediately by 5 L of acetone.\n\t\tCAUTION: This step uses methanol and acetone. Both are flammable and poisonous.\n\t\tNote: The pooled residual can be stored at -80 °C until further processed.\nReactivate the column after 1 week of enrichment by washing it with water (approximately 10 L).\nRemove the organic solvent (the mixture of methanol and water) and harvest the extract by rotatory evaporation for 5 h under reduced pressure (under 300 mbar) at 40 °C. Concentrate the water residue by freeze dryer lyophilization for 48 h at -20 °C until dry.",
    "2. Isolation of Fraction Pools with Chromatography\nSoak the silica gel (230 - 400 mesh) in the initial mobile phase for 30 min. Transfer the gel with the solvent (suspension) to a glass column. Open the valve of the column to allow the mobile phase to go through. Allow the silica gel to precipitate and form a silica gel bed.\nMix the extracts with silica gel (70 - 230 mesh) thoroughly and load them into the liquid chromatography column over the silica gel bed. Elute them with a gradient from 95% CHCl3 (chloroform)/MeOH (methanol) to 100% MeOH, 2.5 L in total volume. Collect the eluent in individual vials (each 10 ml).\n\tCAUTION: The chloroform used in this step is a poisonous reagent.\nGuide the pooling of the eluents into 20 fractions by a thin layer chromatography (TLC) analysis.\n\t\nPerform the TLC experiment on pre-coated silica gel plates by applying the sample on the starting line and immersing the starting line of the plate in the developing solvents (choose the polarity by the ratio of CHCl3 to methanol from 100 - 0%) in a sealed glass tank.\nSelect the ratio of developing solvent to make all the TLC spots with a retention factor (Rf) ranging from 0.3 - 0.8.\nAfter the developing solvent reaches the end line, take the plate out of the tank, and wait 10 min for the solvent to evaporate.\nVisualize the spots first under UV light at 254 nm and then stain them by spraying them with an acidic methanol solution of 5% anisaldehyde (20 μL) by a chromatography sprayer and heating them at 85 °C for 3 min.\n\t\tNote: The colorful spots on the TLC plate indicate the main component in the fraction.",
    "Combine the eluent to 20 fractions based on the spot color and the Rf similarity of the main component.\nConcentrate the fraction to a residue by rotatory evaporation under reduced pressure (300 mbar according the property of solvents) at 40 °C for approximately 30 min.\n3. Electro-olfactogram (EOG) Recordings to Identify Odorous Fractions/Compounds\nPull borosilicate glass capillaries (outer diameter: 1.5 mm; inner diameter: 0.86 mm; length: 100 mm) with a micropipette puller with the heater level set to 65.\nScore and cut the opening at the tip of the capillary with a diamond-tipped glass cutter and fill it with molten 0.4% agar in 0.9% saline. The opening at the tip of the capillary should be around 10 µm in diameter.\nFill the pulled capillary electrodes from steps 3.1 - 3.2 and solid-state electrodes holders pre-fabricated with Ag/AgCl pellets (see Table of Materials) with 3 M KCl using a micropipette.\n\tNote: Dislodge any air bubbles in the capillary or the electrode holder.\nInsert the pulled electrodes in the electrode holders.\nPrepare 100 mL of 10-5 M L-arginine in charcoal-filtered water from a 10-2 M L-arginine stock solution in deionized water (stored at 4 °C) in a volumetric flask. Transfer 20 mL of the 10-5 M L-arginine to a glass vial.\nFor the concentration-response curve, prepare 10 mL of 10-fold dilutions of the fraction pools from step 2.3 in glass vials. Prepare fresh dilutions daily prior to the experiments and use them within a day. Put the glass vials of the working solutions of L-arginine and the fraction pool dilutions in a recirculating water bath to allow the temperature to equilibrate to 8 °C.",
    "Anesthetize the lamprey with 3-aminobenzoic acid ethyl ester (MS222; 100 mg/L) and immobilize it with an intramuscular injection of gallamine triethiodide (3 mg/kg of body weight, in 0.9% saline) with a sterile syringe.\n\tNote: A sufficient depth of anesthesia is determined by observing no gill motion, an inability to maintain an upright posture, and no suction to the sides of the tank using its oral disk. To minimize any microbial contamination before and during surgery, wear sterile gloves and soak the dissection tools in 70% ethanol (v:v) in deionized water for at least 10 min before use.\nOrient the anesthetized lamprey in a V-shaped stand and wrap it with a wet paper towel to prevent desiccation.\n\tNote: Do not obstruct the gill openings.\nInsert a tube of recirculating aerated water containing 50 mg/L of MS222 into the buccal cavity, adjust the flow rate, and ensure that water is exiting via the gill openings to continuously irrigate the gills.\nUse a sterile scalpel and forceps [under the stereoscopic microscope at a 1.25X magnification (see Table of Materials)] to remove a 5 mm2 section of the skin on the surface of the olfactory capsule to expose the olfactory epithelium.\nFlush the odorant delivery tubing with filtered water and connect it to the valve mounted on a micromanipulator. Place the odorant delivery capillary tube into the olfactory epithelium cavity using the micromanipulator to deliver filtered water to the olfactory epithelium to prevent desiccation when not administering odorants.\nMount the recording and reference electrodes on the micromanipulators. Lower the reference electrode onto the external skin near the naris. Using the stereoscopic microscope (1.25X), lower the recording electrode to barely touch the surface of the olfactory epithelium.",
    "Transfer the uptake of the odorant delivery tube from the background filtered water to the 10-5 M L-arginine solution.\nTurn on the computer, amplifier (set to DC mode), filter, and digitizer. Using the valve driver software, program the procedure to administer a 4 s single pulse of odorant by checking the box of T1, setting T to 4 s, and checking the box of T2.\nIn the data acquisition software (see Table of Materials), set the acquisition mode to a high-speed oscilloscope, click the play icon, and then click Start in the valve driver to trigger the odorant pulse.\n\tNote: The data acquisition software automatically records the differential EOG response amplitude for 20 s (3 s before, 4 s during the odorant pulse and 13 s afterward). Use the micromanipulator to maneuver the positions of the recording electrode, reference electrode, or odorant delivery tube to increase the signal-to-noise ratio with a maximum response to the L-arginine standard and a minimal response to the blank control (filtered water). Ground the amplifier by switching the AC-DC amplifier switch to GND while moving the electrodes.\nStart recording the blank control, L-arginine, and then the odorants prepared in step 3.6 from low to high concentrations with a 2 min flush of filtered water between applications.\nAfter recording responses to all the odorants to be tested, ground the amplifier and carefully retract the electrodes and odorant delivery capillary tube. Following the approved Institutional Animal Care and Use Committee (IACUC) methods, at the termination of the EOG experiment, euthanize the anesthetized lamprey with an overdose of MS222 (1 g/L).\n\tNote: Verify successful euthanasia by noting a lack of gill movement and heartbeat for at least 5 min followed by pithing the brain.",
    "Analyze and plot the data using analysis software. Determine the threshold of detection of the odorants22 to identify odorous fractions that elicit responses greater than the blank water control. The fraction pools that elicit concentration-dependent olfactory responses that are different than the blank water control are then tested in a behavioral assay (step 4).\n4. Two-choice Maze Behavioral Bioassay to Identify Behaviorally Active Fractions/Compounds\nAcclimate the sexually mature female sea lamprey in the release cage in the maze (see Supplementary Figure 1) for 5 min. Maintain the flow rate of the river water in the maze\n\tNote: The maze is built from varnished marine grade wood and measures 6.5 m in length and 1.2 m in width with a divider measuring 2.7 m in length to separate the maze into two channels at the upstream end. Water is temporarily diverted into the maze. The water depth should be maintained at 0.19 m and the velocity should be maintained at 0.07 m/s ± 0.01.\nRelease the sea lamprey and record the cumulative amount of time the lamprey spends in the experimental and control channel each containing river water for 10 min.\n\tNote: If the sea lamprey fails to enter the experimental and control channel for at least 10 s during this 10 min period, end the trial, as this is an indication of inactivity or strong side bias.\nApply the test stimulus (i.e., a putative pheromone at 10-12 M dissolved in 50% methanol/deionized water) to the randomly assigned experimental channel and the vehicle (50% methanol/deionized water) to the control channel using peristaltic pumps at constant rates of 200 mL/min for 5 min.\n\tNote: The detection threshold concentration of the test stimulus as determined with the electro-olfactogram recordings should be used as the initial concentration for the behavioral test.",
    "Apply the test stimulus and the vehicle for an additional 10 min and record the cumulative amount of time the lamprey spends in the experimental and control channel.\nFlush the maze with water for 10 min before the start of the next trial. Repeat steps 4.1 - 4.4 with at least 7 lampreys if sufficient test stimulus is available.\nCalculate an index of preference22 for each trial and evaluate the significance using a Wilcoxon signed-rank test.\n\tNote: The index results in a single number that can be either positive or negative. A positive value of the index of preference indicates attraction, whereas a negative value of the index of preference indications repulsion. If the index of preference is significantly different from zero, the fraction is deemed active.\nimgsrc://cloudfront.jove.com/files/ftp_upload/58059/58059eq1v2.jpg\n\tHere,\n\tBc = the time spent by the test lamprey in the control channel before the odorant application,\n\tBe = the time spent in the experimental channel before the odorant application,\n\tAc = the time spent in the control channel after the odorant application, and\n\tAe = the time spent in the experimental channel after the odorant application.\n5. Chromatographic Isolation of Pure Compounds from Active Fractions\nRepeat steps 2.1 - 2.4 with the fraction pools that induce olfactory responses (step 3) and elicit behavioral responses (step 4).\nFurther purify the active fractions into compounds with size-exclusion chromatography using a Sephadex LH-20 column.\n\t\nPrepare the sample in 0.5 mL in the initial mobile phase [CHCl3-MeOH (1:1) or MeOH 100%], load into the corresponding column a CHCl3-MeOH (1:1) column and then a MeOH (100%) column, and elute them to yield the compounds.\n6. Structure Elucidation of a Pure Compound with Mass Spectrometry (MS) and Nuclear Magnetic Resonance (NMR)",
    "Dissolve and dilute the purified compound in the initial mobile phase (usually, methanol to water, 1:1, v:v) of high-performance liquid chromatography (HPLC) to form a 10 μL solution of approximately 1 μg/mL.\n\t\nTransfer the sample solution to HPLC vials and set them into the autosampler of HPLC. Inject the sample (10 μL) into the electrospray ionization mass spectrometry (ESIMS) and record the high-resolution electrospray ionization mass spectrometry (HRESIMS) spectra using a chromatography mass spectrometer23.\nPredict the molecular formula according to the database in the mass spectrometer software (see Table of Materials)24.\n\t\nOpen the chromatogram of the injected sample and obtain its mass spectrum by selecting the chromatographic peak.\nInput the measured mass to ion (m/z) value (4 decimals) in Elemental composition under the Tool module. Set the tolerance parameter to PPM < 5.\nAdjust the symbol parameters to fit the element composition of the measured molecule. The software produces a prediction of molecular formula based on the single mass analysis.\nSelect the deuterated solvents (600 μL, CH3OH-d4 or DMSO-d6) according to the protocol25 to dissolve the samples.\n\t\nCompletely dissolve the sample in the selected deuterated solvents to form a solution with a concentration ranging approximately from 0.1 to 10 mg/mL. Transfer the sample solution into an NMR tube to record the 1D (1H, 13C) and 2D NMR [1H-1H correlation spectroscopy (COSY), heteronuclear single quantum coherence (HSQC), heteronuclear multiple bond correlation (HMBC)] spectra on a 900 MHz NMR spectrometer26.\nPlace the NMR tube with the sample inside the spinner turbine. Use the depth gauge to ensure the sample height is in the middle of the measuring window. Open the NMR software (see Table of Materials) and click the Lift button to change the sample in the magnet.",
    "Note: Hold a hand over the top of the magnet to feel the gas coming from the top of the magnet. At the same time, a whistling sound should be audible.\nGently place the sample on the air cushion on top of the magnet and push the Lift button again to descend the sample into the NMR magnet.\n\tNote: Listen for a “click” noise to indicate the sample is in the right position.\nCreate a new dataset and load the default parameters recommended by the NMR instrument (see Table of Materials).\n\t\nType “lock” to invoke the automatic locking procedure and select the solvent at the prompt page.\nFor fine-tuning, in the Manipulate panel, adjust the button in the Unlock model, adjust the cursor on the manipulate panel, and lock the magnet again.\nOn the prompt Atma page, adjust the parameter in the manipulate panel to the tuning procedure, which may take a few minutes. Wait until the tuning is completed to proceed.\nStart the automatic shimming routine by typing “topshim” in the prompt. Wait until the shimming is completed to proceed.\nType “rga” to set automatic receiving gain adjustments, then type “d1” to set the delay between pulses, then type “zg” to start the acquisition, and wait until the acquisition finishes.\nType “ef” or “efp” to process the data and then type “apk” for automatic phasing. Process the data on the NMR processing software.\nElucidate the chemical structure by an interpretation of the NMR data analysis.\nCount the carbon signals in the 13C NMR spectrum. Select the matched molecular formula from the predicted result in high-resolution mass spectrometry (HR-MS).\nIntegrate the proton signals in the 1H NMR spectrum and assign the connectivity of the carbon- and proton-based on the signals in the HSQC spectrum.",
    "Assign the connectivity of the carbon skeleton based on the correlations in the 1H-1H COSY and HMBC spectrum.\nTentatively assign the chemical structure based on the structure rationale27. Search the tentative structure in the chemical structure databases. Compare the tentative structure with the analogs in references.\nAssign the relative configuration with the Nuclear Overhauser Effect Spectroscopy (NOESY) spectrum.\n\tNote: Since the identity properties of enantiomers displayed on spectrometry and spectroscopic methods are identical, the absolute configuration of some compounds, especially those with 2’-alcohol and 2’-NH2, has to be determined with a derivatization reaction. After the derivatization reaction, the differences indicated on the spectra facilitate the unequivocal assignment of the absolute configurations of most compounds28.\n7. EOG and Bioassay to confirm pure compounds are odorous and behaviorally active\nRepeat steps 3.1 - 3.5.\nFor the concentration-response curve, prepare 10 mL of 10-fold dilutions of the pure compounds from 10-6 M - 10-13 M of a 10-3 M pheromone stock solution in 50% methanol/water stored at -20 °C based on the molecular weight determined in step 6.2. Put the glass vials with the working solutions of L-arginine and the pure compounds in a recirculating water bath to allow the temperature to equilibrate to 8 °C.\nRepeat steps 3.7 - 3.18.\nRepeat steps 4.1 - 4.2.\nApply the pure compound at the EOG detection threshold concentration to the randomly assigned experimental channel and the vehicle (50% methanol/deionized water) to the control channel using a peristaltic pump at constant rates of 200 mL/min for 5 min.\nRepeat steps 4.4 - 4.6.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}