{
  "id": 13473,
  "origin_website": "Jove",
  "title": "Isolation and Characterization of Primary Rat Valve Interstitial Cells: A New Model to Study Aortic Valve Calcification",
  "procedures": [
    "All animal experiments were approved by The Roslin Institute's Animal Users Committee, and the animals were maintained in accordance with Home Office (UK) guidelines for the care and use of animals. For the protocol described below, 5-week old, male Sprague Dawley rats were used.\n1. Reagent Recipes\nPrepare the culture medium using Dulbecco's Modified Eagle Medium (DMEM) and nutrient mixture F-12 (DMEM/F12). Add 10% sterilized heat-inactivated fetal bovine serum (FBS) and 1% gentamicin.\nPrepare the calcification medium using culture medium and 2.7 mM Ca/2.5 mM Pi.\n\t\nPrepare 1 M calcium chloride (CaCl2) by weighing out 555 mg of CaCl2 and dissolving it in 5 mL distilled water to make 5 mL of 1 M CaCl2. Filter the solution through a 0.22 µm syringe filter to sterilize the solution.\nPrepare 1 M sodium phosphate by weighing out 710 mg anhydrous dibasic sodium phosphate (Na2HPO4) and 600 mg of anhydrous monobasic sodium phosphate (NaH2PO4), dissolving each separately in 5 mL distilled water. Combine 3,870 µL of Na2HPO4 and 1,130 µL of NaH2PO4, and filter through a 0.22 µm syringe filter to sterilize solution.\nPrepare the wash buffer containing Hank's Balanced Salt Solution (HBSS) and 1% gentamicin.\n2. Preparation of the Dissection Hood\nCarry out all dissections in a ventilated hood, previously disinfected with 70% ethanol to ensure sterility of samples and reagents.\nSterilize dissection tools by autoclaving them followed by immersing the tips of the tools in a beaker containing 70% ethanol prior to use.\nPrepare beakers containing wash buffer, and soak the dissection tools in wash buffer before coming into contact with the animal or tissues. Keep the wash buffer on ice at all times.\n3. Extraction of Primary Rat VICs\nNOTE: For the protocol described below, 5-week old, male Sprague Dawley rats were used.",
    "Cull the rats (~ 100 g) by cervical dislocation in accordance with UK Home Office guidelines.\nTo dissect out the heart of each rat, place the animal supine on a glass dissection board, and disinfect the skin by spraying with 70% ethanol.\nMake a 4 cm incision in the midline of the rat with the aid of dissection scissors, to expose the abdominal cavity, and carefully remove the rib cage and lungs, to expose the heart.\nRemove the heart with a pair of sharp, spring curved scissors, and store the dissected heart in ice cold wash buffer until all gross dissections of the rats are complete.\nTo micro-dissect each heart, transfer the latter into a Petri dish covered in wash buffer. Trim the cardiac muscle with a pair of spring straight scissors (6 mm blade) to be left with a small area surrounding the ascending aorta and the aortic root.\nUsing the same spring straight scissors (6 mm blade), carefully cut open the ascending aorta towards the left ventricle and expose the aortic valve leaflets.\nTransfer the opened aorta into a fresh, sterile Petri dish filled with HBSS. Dissect out the aortic valve leaflets, marked by their unique 'U' shape at the base of the aorta, with a pair of Vannas-type capsulotomy micro-scissors (3 mm blade).\nStore all leaflets in 1 mL of ice cold wash buffer, in a 1.5 mL microcentrifuge tube until all dissections are complete.\nOnce all leaflets have been harvested, centrifuge them at 100 x g for 1 min at 4 °C to remove the wash buffer.",
    "Perform subsequent steps in a cell culture hood to ensure sterilization. To remove the VECs, digest the leaflets in 100 µL 425 U/mL collagenase II for 5 min at 37 °C. Disrupt the digestion by gently pipetting up and down using a 200 µL pipette tip.\nCentrifuge at 100 x g for 30 s to pellet the leaflets, and discard the supernatant carefully. Wash twice with 500 µL wash buffer and re-pellet the cells by centrifugation at 100 x g for 30 s.\nTo harvest the VICs from the leaflets, digest with 100 µL of 425 U/mL collagenase II for 2 h, and then release the VICs by gently pipetting up and down using a 200 µL pipette tip.\nDilute the collagenase II in 19 mL of culture medium and centrifuge at 670 x g for 5 min to pellet the VICs and remaining valve leaflet debris. Discard supernatant, and transfer leaflets and VICs to culture plates/flasks accordingly (Table 1).\nCulture the VICs for 5-7 days in culture medium, until confluency is reached at 37 °C, in the presence of 5% (carbon dioxide) CO2, changing the medium after 72 h. For subsequent use in in vitro experiments, passage up to 5 times once confluency reaches 100%.\n4. Induction of Calcification of Rat VICs\nNOTE: For all experiments, count cells with a hemocytometer.\nPerform all primary cell seeding and passaging in sterilized hoods to prevent contamination. To prepare primary rat VICs for in vitro calcification experiments, seed the cells at a density of 150,000 cells/well in 6-well plates. Maintain in culture medium until ≥ 90% confluency (typically 72 h).\nTreat the VICs with calcification versus control medium and incubate at 37 °C, in the presence of 5% CO2, for an additional 72 h.",
    "To study the calcified primary rat VICs for subsequent downstream analyses, remove the calcification/control medium and wash the monolayers with wash buffer to remove non-bound Ca and Pi ions.\n5. Rat VIC Characterization\nFor immunostaining to monitor for phenotypic markers such as vimentin and α-SMA, seed the rat VICs at a density of 150,000 cells/well in 6 well-plates containing cover slips (cells will grow on the surface of the cover slips), and leave to grow until 50% confluency.\nAspirate the culture medium and fix the cell monolayers with 4% paraformaldehyde (PFA) for 10 min before washing them 3 times with phosphate buffered saline (PBS), for 5 min each time.\n\tCaution: PFA is toxic and must be handled carefully.\nIncubate the cell monolayer with blocking and permeabilization buffer (1x PBS, 5% of normal serum from the same species as the secondary antibody, 0.3% Triton X-100) for 1 h at room temperature.\nIncubate the cell monolayers with mouse anti-vimentin and rabbit anti-α-SMA antibodies diluted in antibody dilution buffer (1% bovine serum albumin + 0.3% Triton X-100 in PBS) overnight at 4 °C, gently shaking on a rocker.\n\tNOTE: Negative controls consisted of non-conjugated mouse IgG and rabbit IgG, using the same dilutions as the test samples.\nOn the next day, wash off the primary antibodies 3 times with PBS, for 5 min each time.\nIncubate the cell monolayers with fluorophore-conjugated secondary antibodies for 1 h at room temperature, gently shaking on a rocker.\nWash 3 times with PBS, and gently tweeze out the coverslips (which contain rat VICs) with a pair of forceps and place on a coverslip containing 4',6-diamidino-2-phenylindole (DAPI). Leave the slides to cure for at least 24 h at 4 °C before visualizing with a fluorescence microscope.",
    "For Western blot analysis, seed the rat VICs at a density of 150,000 cells/well in 6 well-plates and leave to grow in culture medium until 100% confluent.\nUse 8 µg of protein to run a Western blot to measure the expression of CD31 and rule out any VEC contamination.\n\tNOTE: A standard Western blot protocol was followed as described previously9.\nFor gene studies, extract ribonucleic acid (RNA) using a commercial kit following the manufacturer's guidelines.\nObtain cDNA using reverse transcription to measure target genes' expression using polymerase chain reaction (PCR) and real-time PCR (RT-PCR; also known as qPCR) with green fluorophore detection, using Gapdh as the reference gene, as previously described10.\n\t\nUse the following program for PCR analysis: 1 cycle of 94 °C for 3 min, 30 cycles of 94 °C for 30 s, 63 °C for 30 s, 72 °C for 35 s, and finally 1 cycle of 72 °C for 5 min.\nUse the following program for qPCR analysis: 1 cycle of 95 °C for 10 min, 40 cycles of 95 °C for 15 s, 60 °C for 1 min and an additional cycle of 95 °C for 1 min, 55 °C for 30 s, and 95 °C for 30 s.\nRun a gel electrophoresis to analyze PCR products using a 2% agarose gel in Tris/Borate/EDTA (TBE) buffer.\n6. Rat VIC Calcification Studies\nFor Alizarin Red S and biochemical calcification studies, please follow seeding and calcification guidelines described in section 4.\nStain the cell monolayers with 5% Alizarin red S solution, gently rocking on a shaker, for 20 min. Subsequently wash 3 times with distilled water, for 5 min each time. Acquire images of each well.",
    "To quantify Ca deposition, use a biochemical Ca assay kit. Leach Ca2+ ions using 0.6 M hydrochloric acid (HCl) for 24 h at 4 °C, with gentle agitation.\nHarvest the supernatant and measure the Ca concentration using a Ca assay kit (see Table of Materials) following the manufacturer's guidelines.\nCalculate the calcium concentration as a fraction of total cellular protein. Denature cellular proteins from the cell monolayers with 0.1 M sodium hydroxide (NaOH) + 0.1% sodium dodecyl sulphate (SDS). Determine the total protein concentration using a detergent compatible (DC) protein assay following the manufacturer's guidelines."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}