{
  "id": 19206,
  "origin_website": "Jove",
  "title": "Establishment and Propagation of Human Retinoblastoma Tumors in Immune Deficient Mice",
  "procedures": [
    "1.\tPreparation of retinoblastoma tumorspheres\nObtain retinoblastoma tumor sample under an IRB-approved protocol.\nPrepare fresh defined stem cell media (Neurobasal-A media, 1X B-27 supplement minus vitamin A, 1X non-essential amino acid solution, 1X L-glutamine, 20 ng/mL EGF, 10 ng/mL bFGF).\nMechanically disaggregate the tumor tissue with a scalpel using a cross-cutting technique in a sterile, tissue culture-treated 6-well plate. Immediately add 100 μL of defined stem cell media to the tissue and gently spread the minced tissue using the scalpel. Add 5 mL of defined stem cell media to the well.\nIncubate at 37°C, 5% CO2 in a humidified incubator and inspect daily. Some tumorspheres should arise from the disrupted tumor tissue almost immediately, with increasing numbers over the course of 2-4 days.\nWeekly, centrifuge tumorspheres at 300xg for 5 minutes, resuspend in freshly prepared defined stem cell media, and pipet up and down 10 times to disrupt larger, centrally necrotic spheres and allow new, healthy spheres to form.\n2.\tPreparation of tumor cells for injection\nIf injecting cultured tumorspheres, gently pipet spheres into a 15-mL conical tube. Gently pipet up and down with a serological pipet 10-15 times to disrupt the spheres.\nCount the cells to be injected using a hemacytometer, and aliquot at least 50,000 cells per injection into a new tube. Prepare for as many injections as possible based on the number of cells available.\nCentrifuge at 300xg for 5 minutes. Carefully aspirate the supernatant and resuspend in 5 mL PBS. Repeat centrifugation and aspiration, and resuspend in 10 μL PBS per injection.\n3.\tPreparation of animals",
    "Using an insulin syringe, administer an intraperitoneal injection of rodent anesthesia cocktail (ketamine 37.6 mg/mL, xylazine 1.92 mg/mL, acepromazine 0.38 mg/mL) at 1 μL per gram body weight (gbw). Wait 5 minutes for the animal to become sedated. Check for heartbeat and place the animal on a heated pad. Maintain animals on a heated pad at all times until recovery.\nAfter sedation, administer 1 drop of proparacaine HCl to the right eye. Replace animal on heated pad and wait 1 minute.\nAdminister 1 drop of phenylephrine HCl to the right eye. Replace the animal on the heated pad and wait 5 minutes. If dilation of the pupil has not occurred, re-administer 1 drop and wait another 5 minutes.\nMonitor animals for signs of movement or twitching, which may occur at >30 minutes post-sedation. At first signs of movement, administer 1 μL/gbw of ketamine HCl (diluted to 10 mg/mL in PBS) and wait 5 minutes.\n4.\tInjection of tumor cells\nPlace the anesthetized animal under the microscope on its side, with the right eye facing up and with the head resting on gauze and centered to obtain a red reflex of the right eye fundus (pupil should be dilated at this time) when observed through the microscope.\nProp up the right globe by gently pushing down simultaneously with two fingers on the eyelids and hold this position steadily for the remainder of the procedure.\nUsing a sterile 30-gauge needle attached to a Luer-lock syringe, pierce the globe laterally through the conjunctiva and sclera adjacent to the corneal limbus in the area of the pars plana (Figure 1) and just through the choroid into the vitreous cavity. Remove the needle from the opening.",
    "Sterilize the Hamilton needle with an alcohol swab. Draw the cell suspension into the Hamilton syringe and insert the needle into the opening until the needle is visualized through the microscope behind the lens in the vitreous near the retina. With the help of a second person while holding the needle steadily in this position, depress the plunger slowly. Remove the needle. If necessary, use a cotton swab to absorb any fluid from the opening.\nGently release the pressure from the eyelids to close the mouse eyelids.\nAdminister 1 drop of hypromellose to each eye and return animal to heated pad for recovery.\n5.\tMonitoring of injected mice and harvesting of tumors\nDaily, examine the injected eye for leukocoria (white papillary reflex) and/or periocular distention that usually becomes apparent 2-4 weeks post-injection.\nOnce tumor growth is detected, euthanize animal according to institutional guidelines.\nIf the eye and tumor are covered by the eyelids, use the scalpel to make two incisions orthogonal to the palpebral fissure and lift the skin flaps.\nUnder visualization using the stereoscopic microscope, make a circumferential incision at the limbus, removing the cornea and the lens, and carefully dissect the bulk of the tumor mass from the other tissues using tweezers. Place the tumor in sterile RPMI-1640 media.\nUse tweezers to slowly pull the open globe from the socket. To ensure an attached optic nerve so tumor invasion can be visualized, pull the globe until the nerve is exposed and use scissors to cut the nerve as long as possible. Place in 10% formalin for regular processing for histological examination.\n6. Representative Results:",
    "Retinoblastoma tumorspheres will begin to appear from the disaggregated tissue almost immediately as they are liberated from the tumor mass. Within 2-4 days, more tumorspheres will begin to form and will increase in size. The spheres tend to be regular and exhibit a well-defined, secondary membrane surrounding the aggregate (Figure 2).\nThe animal typically presents with leukocoria within 4 weeks post-injection (Figure 3b), followed by enlargement of the globe and distention of the surrounding tissues 5-8 weeks after injection as the tumor grows (Figure 3c). \nimgsrc://cloudfront.jove.com/files/ftp_upload/2644/2644fig1.jpgFigure 1. Cross-sectional diagram of the mouse eye highlighting features referenced in the protocol.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2644/2644fig2.jpgFigure 2. Culture of human retinoblastoma cells in vitro imaged at a) 4x, and b) 10x objective magnification. Retinoblastoma primary tumor cells produce tumorspheres with a regular spheroid shape and a crisp outer membrane. Scale bars represent a) 500 μm, and b) 200 μm.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2644/2644fig3.jpgFigure 3. Eye of Rag2-/- mouse showing a) normal features, b) leukocoria indicative of a tumor mass in vitreous cavity, and c) a large tumor mass filling the globe with associated periocular distension, intraocular hemorrhage."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}