{
  "id": 12283,
  "origin_website": "Jove",
  "title": "A Murine Orthotopic Bladder Tumor Model and Tumor Detection System",
  "procedures": [
    "All animal work adhered to the Institutional Animal Care and Use Committee (IACUC) guidelines on animal use and handling (Protocol number 084/12) at the National University of Singapore.\n1. Growing MB49-PSA Cells In Vitro and Measuring PSA Secretion\nMaintain murine bladder cancer cells MB49-PSA15 in complete Dulbecco's Modified Eagle Medium (DMEM) supplemented with 10% fetal bovine serum (FBS), 2 mmol/L L-glutamine, and 0.05 mg/mL Penicillin-Streptomycin in an incubator at 37 °C and 5% CO2. Add 200 μg/mL Hygromycin B to maintain the selection pressure of PSA-secreting cells.\nTo determine PSA secretion, plate 1 x 106 cells in a 6-well culture plate and incubate it at 37 °C in the presence of 5% CO2 for 48 h.\nTwo days later, collect the supernatant for the PSA measurement.\n\t\nUsing a Pasteur pipette, transfer the supernatant to a 15 mL centrifuge tube.\nCentrifuge for 5 min at 250 x g to remove floating cells and debris. If the PSA assay is carried out on a different day, store the supernatant at - 30 °C in a 1.5 mL microcentrifuge tube. If not, proceed to the next step immediately.\nDetermine the PSA concentration using a human-free PSA ELISA kit7.\nEnumerate the plated cells.\n\t\nUsing a Pasteur pipette, wash the cells gently with 1 mL of DMEM. Aspirate and completely remove the media.\nAdd 1 mL of fresh media and scrape gently with a cell scraper to dislodge the cells from the well.\nTransfer the cells to a microcentrifuge tube and re-suspend them thoroughly to ensure a single-cell suspension.\nMix equal volumes of the cell suspension and a 0.4% trypan blue solution. Count the live cells (which do not take up the dye) using a hemocytometer.",
    "Calculate the PSA expression as ng of PSA/mL of media/106 cells. The PSA expression of MB49-PSA cells for implantation in mice is 80 - 120 ng/mL/106 cells.\n2. Determining the Sensitivity of PSA Measurements by ELISA and Real-time PCR Analysis\nPlate MB49-PSA cells in complete DMEM media in a 6-well culture plate with different amounts of parental MB49 cells such that there is a maximum of 1 x 106 cells per well (i.e., 100, 101, 102, 103, 104, 105, or 106 MB49-PSA cells are cultured with 106, 105, 104, 103, 102, 101, or 100 MB49 cells, respectively).\nOne day later, collect the supernatant for PSA measurement, as described in step 1.3. Determine the PSA concentration using a human-free PSA ELISA kit7.\nExtract the RNA from the cells.\n\t\nLyse the cells directly in the plate by adding 1 mL of RNA extraction reagent.\nIncubate for 5 min at room temperature and transfer the cell lysate to a microcentrifuge tube. Add 0.2 mL of chloroform and vortex the samples vigorously for 15 s. Incubate them for 3 min at room temperature.\nCentrifuge the samples at 12,000 x g for 15 min at 4 °C. Carefully transfer the upper aqueous phase (0.5 mL) to a fresh tube without disturbing the interphase.\nAdd 0.5 mL of isopropyl alcohol. Incubate for 10 min at room temperature. Centrifuge the samples at 12,000 x g for 10 min at 4 °C. Remove the supernatant completely, without disturbing the RNA precipitate at the bottom of the tube.\nWash the pellet once with 1 mL of 75% ethanol. Centrifuge at 7,500 x g for 5 min at 4 °C. Remove all ethanol and allow the pellet to air dry for 10 min.",
    "Dissolve the RNA in 30 µL of nuclease-free water. Incubate for 5 min at 60 °C to increase the solubility.\nQuantitate the RNA by measuring the absorbance using ultraviolet (UV) spectroscopy at 260 nm (A260). To assess RNA purity, measure the absorbance at 280 nm (A280) and calculate the A260/A280 ratio which should be above 1.6.\nReverse-transcribe cDNA from 2 µg of RNA.\n\t\nPrepare the reaction mixture on ice and transfer it to 0.2 mL tubes.\nBriefly centrifuge the tubes to spin down the contents and to eliminate air bubbles.\nLoad the tubes into the thermal cycler and perform reverse transcription at the following conditions: 60 min at 37 °C followed by 5 min at 95 °C. Once the run is completed, keep the cDNA samples at 4 °C.\nStore the samples at - 30 °C for long-term storage.\nPerform a real-time PCR analysis for PSA and cytoplasmic beta actin. Beta actin is used to normalize the samples. Perform the assay on 100 ng of reverse-transcribed RNA in a 96-well plate. Assay all samples in triplicate. Perform 40 cycles with the following parameters: 2 min at 50 °C, 10 min at 95 °C, 15 s at 95 °C for denaturation, and 1 min at 60 °C. Set the lowest limit of detection at a cycle threshold (CT) of 35; thus, any sample with a CT value beyond 35 is considered not detectable.\n3. Maintaining the Tumorigenicity of the MB49-PSA Cell Line\nNOTE: Prolonged growth in vitro leads to a loss of tumorigenicity. To maintain tumorigenicity, the MB49-PSA cell line is passaged through the mouse at least once every 2 years.\nCells.",
    "Harvest exponentially growing cells by scraping them gently with a sterile cell scraper. Mix equal volumes of the cell suspension and a 0.4% trypan blue solution. Count the live cells using a hemocytometer. Do not implant if more than 20% of the cells are dead.\nCalculate the amount of live cells required (1 x 107 cells/mL) and transfer them to a 15 mL centrifuge tube. Centrifuge at 250 x g for 5 min at 4 °C and discard the supernatant. Re-suspend the cell pellet in DMEM blank media. Repeat the wash three times to remove all traces of FBS before implantation.\nKeep the cell suspension on ice until the mice are ready for implantation.\nImplant the tumor cells subcutaneously in mice on the dorsal flank.\n\t\nAnesthetize a 4- to 6-week-old C57BL6/J mouse using a mixture of the anesthetics ketamine and medetomidine (75 mg/kg and 1 mg/kg, respectively), injected intraperitoneally at 0.1 mL per 10 g of bodyweight.\nShave the right flank to expose the skin.\nUsing a pair of forceps, lift the skin to separate it from the underlying muscle and inject 0.1 mL of the cell suspension (1 x 106 cells) subcutaneously with a 24 G needle. While removing the needle, pinch the injection site for 5 to 10 s so that the tumor cells do not leak out of the injection site.\nRevive the mouse with a subcutaneous injection of atipamezole (1 mg/kg) at 0.1 mL per 10 g of bodyweight.\nMonitor tumor growth every two days by measuring tumor diameter using calipers. The tumor volume is calculated using the formula v = (ab2)/2, where \"a\" is the longest dimension and \"b\" is the perpendicular width, both in mm.",
    "When the tumor volume is at least 50 mm3 (approximately 7 days), euthanize the mouse with CO2. Excise the tumor mass with a pair of sterile forceps and scissors under aseptic conditions and place in DMEM.\nIn a 6-well culture plate, mince the tumor into small pieces using sterile scalpels. Use a 1 mL syringe plunger as a \"pestle\" to further disaggregate the tumor.\nAdd 3 mL of complete DMEM and maintain the cells in an incubator at 37 °C and 5% CO2.\nOnce the cells adhere to the plate (between one and two days), remove the media, debris, and non-adherent cells by aspirating gently with a sterile Pasteur pipette. Wash twice with DMEM. Take care to not disturb the cells.\nAdd 1 mL of DMEM and harvest the cells by scraping them with a cell scraper. To select and expand single colonies, count the cells using a hemocytometer and plate 1 cell per well in a 96-well culture plate. Culture cells in DMEM with 200 μg/mL Hygromycin B at 37 °C and 5% CO2.\nChange the media and antibiotic every 4 - 5 days. Monitor the cells until they are at about 80-90% confluent. Re-plate the cells on a 24-well culture plate by pipetting to dislodge cells from the well.\nOnce the cells in the 24-well culture plate are confluent, dislodge them by scraping with a cell scraper and plate them in a 6-well culture plate.\nScreen the different clones for PSA secretion, as described in step 1. Cryo-preserve the clone with the highest PSA secretion and use it for future mouse experiments.\n4. Implanting the Tumor",
    "NOTE: Each mouse is implanted with 1 x 105 MB49-PSA cells in 50 µL of DMEM blank media in the bladder. Due to the dead space in the catheter, always prepare extra volume (at least 100 µL extra per mouse). An alternative approach would be to use an air filled syringe as described by Kasman et al.5 rather than a filled syringe.\nCells.\n\t\nOne day before implantation, when the cells are approximately 80% confluent, passage the MB49-PSA tumor cells in complete DMEM media (supplemented with 10% FBS, 2 mmol/L L-glutamine, 0.05 mg/mL Penicillin-Streptomycin, and 200 µg/mL Hygromycin B) at 37 °C and 5% CO2 at a split ratio of 1:2.\nOn the day of the procedure, harvest the cells by scraping them gently with a sterile cell scraper. Mix equal volumes of the cell suspension and a 0.4% trypan blue solution. Count the live cells using a hemocytometer. Do not implant if more than 20% of the cells are dead.\nCalculate the amount of live cells required (2 x 106 cells/mL) and transfer them to a 15 mL centrifuge tube. Centrifuge at 250 x g for 5 min at 4 °C and discard the supernatant. Re-suspend the cell pellet in DMEM blank media. Repeat the wash three times to remove all traces of FBS before implantation.\nKeep the cell suspension on ice until the mice are ready for implantation.\nAllow the 4- to 6-week-old female C57BL/6J mice to acclimatize for one week before the procedure. All animal work must be performed in a biological safety cabinet to maintain sterile conditions.\n\t\nWeigh each mouse and inject anesthesia (75 mg/kg ketamine and 1 mg/kg medetomidine) intraperitoneally at 0.1 mL per 10 g of bodyweight. Bodyweights should be between 17 and 22 g. Confirm anesthetization by observing no response after a toe pinch.",
    "For identification, mark the ear using an ear punch.\nInject Hartmann's solution or compound sodium lactate intraperitoneally at 0.1 mL per 10 g of bodyweight every 1 - 2 h for hydration.\nApply sterile ophthalmic ointment to both eyes using a sterile cotton bulb, since the blinking reflex is lost under anesthesia and the eyes dry out. Reapply when necessary.\nLay the mice in supine position on paper towels on top of a heat pack (activated by contact with air) to maintain body temperature and tape the hind legs down.\nWith a finger, apply gentle pressure to the lower abdominal region and collect urine from the bladder into a 1.5-mL microcentrifuge tube. This sample serves as the basal value of urinary PSA.\nWithdraw sterile poly-L-lysine (PLL) into a 1 mL syringe and attach a 24-gauge IV catheter, with the needle stylet removed. Apply lubricant to the tip of the catheter and insert the catheter through the urethra into the bladder using forceps to guide the catheterization. Stop when resistance is felt. NOTE: Researchers should discuss with their veterinary staff about the need for the use of a lubricating gel with anesthetic for intravesical instillations and the use of post–procedure analgesics.\nInstill 50 µL of PLL slowly, at a rate of 10 µL every 20 s, to avoid vesico-ureteral reflux18. Leave the catheter in the bladder for 20 min with a stopper to prevent out-flow.\nAfter 20 min, remove the catheter and vacate the bladder of any contents by gently pressing on the lower abdominal region. Using an empty 1 mL syringe, flush any remaining contents out of the catheter.",
    "Mix MB49-PSA cells thoroughly by pipetting and withdraw them into a 1 mL syringe. Attach the catheter and apply lubricant. Instill 50 µL of 1 x 105 cells at a slow rate of 10 µL every 20 s. Replace the stopper on the catheter. Give control mice 50 µL of saline.\nAfter 1 h, remove the catheters and vacate the bladder of any contents. Remove the tape on the hind legs and place the mice on their ventral sides. Revive the mice by subcutaneously injecting the reversal drug (1 mg/kg atipamezole) at 0.1 mL per 10 g of bodyweight.\nMonitor the mice until motility is observed. Return the mice to their cages.\nUpon completion of a tumor detection protocol (sections 5, 7, or 8), euthanize the mice using CO2. Post-mortem tumor detection is described in section 6.\n5. Monitoring Tumor Growth with ELISA\nNOTE: Tumor presence and growth is monitored in mice by measuring PSA secretion in urine. Researchers should consult with their veterinary staff on monitoring animal health and well-being post-tumor implantation and humane endpoints.\nThere are two methods to collect urine from mice.\n\t\nCollect urine overnight by placing a single mouse in an individual metabolic cage designed to separate urine from fecal material. If the set-up does not have refrigeration, add a protease inhibitor (100 µL) into the urine collection tube to prevent degradation of PSA overnight. However, the number of available metabolic cages limits the utility of this method of urine collection.",
    "Where it is logistically impossible to use metabolic cages (such as in the ABSL2 rooms), collect spot urine by using a finger to exert gentle pressure on the lower abdominal region while the mice are anesthetized as described in step 4.2.1. This is usually done before the therapy is instilled. From our experience, at least 150 µL of urine can be collected 1 h after anesthesia.\nImmediately place the collected urine on ice. Hematuria may be visible from the second week after tumor implantation. Highly hemolyzed samples may affect ELISA analysis. Therefore, urine must be placed on ice and processed quickly after collection.\nCentrifuge the urine tubes at 6,700 x g for 5 min at 4 °C to remove cells or debris.\nTo normalize the difference in urine output between the mice, aliquot the urine into new tubes and store them at -30 °C until performing the analyses for PSA using an ELISA kit7 and creatinine using an assay kit7. Even though mice do not produce PSA, there are low levels of non-specific binding detected using the ELISA. For samples to be considered positive, the threshold must be set at values greater than in normal mice + 3 Standard Deviations (SD)15.\n6. Detecting Tumor Presence with Real-time PCR\nAt termination, dissect the abdominal cavity of the mouse and locate the bladder. Excise the bladder and place it into a cryovial. Freeze immediately in liquid nitrogen.\nExtract the RNA by homogenizing the tissues in an RNA extraction reagent.\nPerform reverse transcription and real-time PCR analysis for PSA, as described above in section 2.\n7. Monitoring Tumor Growth with Fluorescence Imaging\nLabel 1 x 107 MB49-PSA cells with a near-infrared fluorescent dye19.",
    "Re-plate and harvest the labeled cells on days 4, 7, 11, 14, 18, and 21 to check if cells retain viability and fluorescence by flow cytometry20.\nImplant the labeled MB49-PSA cells in mice bladders, as described above in section 4.\nMonitor the tumor growth using a fluorescence imaging system every two days.\nOn the day of imaging, weigh and anesthetize the mice using a mixture of the anesthetics ketamine and medetomidine (75 mg/kg and 1 mg/kg, respectively), injected intraperitoneally at 0.1 mL per 10 g of bodyweight.\nShave the abdominal area to expose the skin.\nPlace mice in the imaging chamber and acquire images of the bladders using the software provided with the imaging system.\nRevive the mice by subcutaneously injecting a reversal drug (1 mg/kg atipamezole) at 0.1 mL per 10 g of bodyweight.\n8. Monitoring Tumor Growth with High-frequency Ultrasound Imaging\nImplant tumors in mice, as described above in section 4.\nEvery two days, monitor tumor growth using ultrasound imaging.\nOn the day of imaging, weigh and anesthetize the mice using a mixture of the anesthetics ketamine and medetomidine (75 mg/kg and 1 mg/kg, respectively), injected intraperitoneally at 0.1 mL per 10 g of bodyweight.\nShave the abdominal area to expose the skin.\nInstill 100 μL of sterile 0.9% saline into the bladder using a 24-gauge IV catheter. The saline will distend the bladder and improve visibility during the ultrasound imaging.\nPlace the mouse on the ultrasound platform and apply conductive gel to the lower abdomen.\nLower the handheld probe to the skin and acquire B-mode images of the bladder on the imaging platform21.\nRevive the mice by subcutaneously injecting reversal drug (1 mg/kg atipamezole) at 0.1 mL per 10 g of bodyweight.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}