{
  "id": 3742,
  "origin_website": "Cell",
  "title": "Nuclear RNA purification by flow cytometry to study nuclear processes in plants",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThe protocol presented here provides a key approach to investigate subcellular RNA distribution. It is an assembly and adaptation of different existing methods optimized by introducing key control steps in order to obtain a highly pure nuclear (membrane-/chromatin-associated and nucleoplasmic) RNA from intact nuclei to study nuclear-cytoplasmic shuttling processes in plants (Galbraith, 2014[href=https://www.wicell.org#bib8]; Slane and Bayer, 2017[href=https://www.wicell.org#bib12]; Weinhofer and Köhler, 2014[href=https://www.wicell.org#bib14]; Zhang et al., 2008[href=https://www.wicell.org#bib18]). The procedure relies on the manual homogenization of fresh cross-linked tissue (using a razor blade), leading to the release of cellular content into a small volume of Nuclei Isolation Buffer. Filtering the crude homogenate through ∼35 μm filter removes large tissue debris, serves as an initial purification step, and avoids the blockage of the sample tubing and sorter nozzle. Crude nuclear preparations are stained with DAPI/PI or labeled using fluorescence proteins and flow-sorted (Vrána et al., 2014[href=https://www.wicell.org#bib13]). RNA extraction followed by qPCR is used to validate nuclear RNA quality. Finally, the levels of particular RNA molecules in total and nuclear fractions are determine by qPCR/RNA sequencing (RNA-seq)(Bologna et al., 2018[href=https://www.wicell.org#bib1]; de Leone et al., 2020[href=https://www.wicell.org#bib6]) (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/462-Fig1.jpg\nFigure 1. Preparation and isolation of plant nuclei by flow sorting\n(A) Protocol work flow.\n(B–E) Steps for sample preparation. (B) Cross-linking. (C) Samples before chopping. (D) Plant homogenate after chopping. (E) Samples after filtration with 35 μm filters.\n(F and G) Microscope images during sample preparation. (F) DAPI stained nuclei before filtration. (G) DAPI stained nuclei after filtration. Top panels show DAPI fluorescence channel, bottom panels show bright light channel. White arrows indicate examples of small and large contaminations and/or debris present in the samples before sorting.",
    "(H and I) Gating during FACS sorting. Top panels show dot plot of SSC-A versus DAPI fluorescence area. Populations of nuclei with different DAPI fluorescence intensities reflect the different levels of polyploidy. Bottom panel shows histogram of DAPI fluorescence of all particles. The gates show percentage of nuclei on total events before and after nuclear sorting. (H) Before sorting. (I) After sorting. See also Figure S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/protocol-id-Mmc1.extension]A.\n(J and K) Microscope images of sorted nuclei prior to and post-concentration. Top panels show the DAPI fluorescence channel, bottom panels show bright light channel. (J) Before nuclear concentration. The inset shows a 60× image of a purified nucleus where is possible to distinguish the nucleolus, depicted as an empty black hole (mark with a circular dotted line), and chromocenters showed as high-intensity dots inside the nucleus. (K) After nuclear concentration. Note that small and large contaminations and/or debris (thick white arrows) that were previously present in the sample (F and G) showed on the bright field, have been eliminated during the sorting (J and K).\nCritical: Use gloves and RNase-free material throughout the entire protocol.\nTissue cross-linking: day 1\nTiming: 30 min\nThis step helps preventing the loss of nucleoplasmic RNA prompted to diffuse out of the nucleus during nuclear isolation.\nCritical: All solutions should be ice-cold and all manipulations through to step 7 should be performed on ice to prevent sample degradation.\nPrepare fresh Cross-linking (CL) Buffer. Add 1.35 mL of 37% Formaldehyde to every 48.65 mL of freshly prepared Sample Buffer (final concentration: 1% (v/v)).\nCritical: Formaldehyde is a corrosive and carcinogenic compound. Always handle with gloves under a fume hood and discard according to safety guidelines.",
    "Place a chilled beaker containing ∼50 mL of CL Buffer on ice and add ∼100 seedlings including roots. Shake the beaker to allow as much contact as possible between the plant material and CL Buffer, avoiding air bubbles (Figure 1[href=https://www.wicell.org#fig1]B). Keep the beaker on ice and transfer to a desiccator.\nAlternatives: To extract nuclei from other plant tissues (e.g., leaves, inflorescences or isolated roots), maintain a CL Buffer/tissue ratio of ∼10:1.\nApply 600 atm vacuum for 7 min and then slowly release the vacuum. Shake the beaker and repeat this step one more time.\nCritical: Check if seedlings have sunk from the interphase into the sine of the solution. The cross-linking starts only after CL buffer penetrates the tissue (Figure 1[href=https://www.wicell.org#fig1]B). See Problem 1[href=https://www.wicell.org#sec6.1] in the Troubleshooting[href=https://www.wicell.org#troubleshooting] Section.\nAdd ∼7 mL of 1 M Glycine to obtain a final concentration of 0.125 M. Shake the beaker well and apply 600 atm vacuum for 7 min. This step stops the cross-linking.\nDiscard the content of the beaker and wash the seedlings twice with ∼15 mL of Sample Buffer.\nRapidly semi-dry the plant tissue in Whatman Paper. Separate 10% of the plant tissue in an Eppendorf tube, freeze it in liquid nitrogen and store it at −80°C. This will be the used later on as total fraction. See step 24 for further details.\nTissue homogenization\nTiming: 15 min per sample\nTransfer the remaining plant tissue (90%) from the Whatman Paper into a pre-cooled Petri dish. Add approximately 300 μL of NIB and chop it for ∼5 min with a sharp razor blade until getting a fine suspension (Figure 1[href=https://www.wicell.org#fig1]C) (Methods Video S1[href=https://www.wicell.org#mmc2]).",
    "Critical: Keep the sample cold and monitor the blades of the homogenizer to ensure that fibrous debris does not accumulate and impairs homogenization. The quality of the blades is important, we used Feather double-sided 0.1 mm.\nDepending on the amount of plant tissue, add an additional 300–700 μL of NIB and chop it for ∼5 more min (Figure 1[href=https://www.wicell.org#fig1]D).\nFilter the suspension through a 35 μm cell strainer caps into a 5 mL round-bottom polystyrene tube (Figure 1[href=https://www.wicell.org#fig1]E).\nCritical: Tilt the tube and pipet out gently the supernatant on the filter so that the drops run on the side of the tube and do not fall to the bottom. Repeating this step will help clarify the suspension. See Problem 2[href=https://www.wicell.org#sec6.3] and Problem 3[href=https://www.wicell.org#sec6.5] in the Troubleshooting[href=https://www.wicell.org#troubleshooting] Section. Keep it on ice.\nStain the suspension by adding DAPI to a final concentration of 1–2 μg/mL and incubate it at 25°C for 5 min.\nAlternatives: Nuclei can be stained with PI to a final concentration of 50 μg/mL.\nNote: The quantity of debris and/or contamination prior and after filtering the sample can be verified by observing an aliquot with DAPI/PI under the microscope (Figures 1[href=https://www.wicell.org#fig1]F and 1G). Contamination can be spotted as particles on the bright field, which are not detected on the fluorescent channel (Figures 1[href=https://www.wicell.org#fig1]F and 1G, upper and lower panels, white arrows). See step 22 for more details on how to set the microscope.\n        Your browser does not support HTML5 video.\n      \nMethods Video S1. Sample homogenization using sharp razor blade, related to step 7\nSorting plant nuclei using BD FACS AriaIII cell sorter\nTiming: 25 min per sample (plus 40–60 min sorter start-up time)",
    "Switch on the cell sorter (including lasers) and the computer. Launch the BD FACS Diva Software. Perform fluidics start up, insert the 70 μm nozzle (70 psi), switch on the stream, and let it stabilize. Switch on the cooling water-bath. Set the temperature of the sample injection chamber to 4°C.\nRun Cytometer Setup and Tracking research beads (CS&T beads, BD Biosciences Cat. nr 655050) to check performance. Connect the 1.5 mL Eppendorf tube collection device to the cooling system; adjust the side streams so the sorted droplets fall in the middle of the collection tubes.\nRun Accudrop Beads (BD Biosciences Cat. nr 345249) and determine the optimal drop delay according to BD FACS Aria III User’s Guide.\nIn the Settings, choose the appropriate channels to measure light scattering and fluorescence. Use the following laser excitation parameters and fluorescence detection filters: for DAPI: excitation at 405 nm (50 mW) and detection with a 450/40 Band Pass (BP) filter. Set up the trigger on DAPI fluorescence. For side scatter use 488 nm laser (20 mW or higher) and 488/10 BP.\nAlternatives: for PI use the following parameters. Excitation at 488 nm, 532 nm or 561 nm (50 mW, depending on laser line availability) and detection with a 620/10 nm BP filter. Set up the trigger on PI fluorescence.\nSet up the experiment with 2 bivariate dot plots: log side scatter (SSC) A vs log DAPI-A, and log DAPI-A vs log DAPI-H; and one histogram: log DAPI-A.\nAlternatives: Define the bivariate dot plots and histogram for PI, when using it to stain the nuclei, instead of DAPI.",
    "Run the nuclei sample; select a proper threshold level that allows the display of the signals on an SSC-A plot versus DAPI/PI fluorescence area (both in log scale). Adjust the voltage of the photomultiplier for the DAPI/PI fluorescence to achieve a displaying of all ploidy level populations (Figure 1[href=https://www.wicell.org#fig1]H-upper panel). Make sure the debris from preparation are also visible on this plot. Histogram of DAPI fluorescence area is shown on lower panel (Figure 1[href=https://www.wicell.org#fig1]H).\nDefine a gate around the nuclei populations selected to be sorted. To exclude aggregates, we suggest also drawing additional diagonal gate on the DAPI-A vs DAPI-H plot (Figure S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/protocol-id-Mmc1.extension]A).\nIn the “Sort layout” choose the 4-way purity mode. Assign the sort location field to the collection tube. Run the sample at 1,000–3,000 events/s. Sort the required number of nuclei into 1.5 mL Sarstedt screw-cap tubes containing ∼100 μL of NIB and keep them on ice afterwards. For additional analysis export recorded data as FCS 3.0 file(s) and use FlowJo, LLC software.\nNote: The number of nuclei varies between 250,000 to 1,000,000; depending on the availability of the individual ploidy levels and the desired number of samples for RNA analysis. For example, for RT-qPCR or RNA sequencing analysis 250,000 nuclei should suffice.\nRe-analyze sorted DAPI or PI-positive nuclei to check the sorting quality and verify sorting parameters (Figure 1[href=https://www.wicell.org#fig1]I).\nMicroscopy, nuclei concentration, and reverse cross-linking\nTiming: 60 min",
    "We recommend following key steps of the protocol by confocal microscopy to check the presence of debris, prior and after sorting (Figures 1[href=https://www.wicell.org#fig1]F, 1G, 1J, and 1K, steps 8–18), at least the first time the protocol is performed. Small and large contaminations and/or debris can be found in the samples before sorting (Figures 1[href=https://www.wicell.org#fig1]F and 1G, white arrows bottom panels). The optimal outcome after sorting the samples is the lack of debris in the bright field when comparing the prior and post sorting (Figures 1[href=https://www.wicell.org#fig1]F, 1G, 1J, and 1K).\nCentrifuge 30 min 300 × g at 4°C, in a pre-cooled centrifuge.\nRemove the supernatant leaving only ∼100 μL remaining. Re-suspend the nuclei in those 100 μL and place 2–5 μL to check nuclear integrity under the microscope. Use the bright field to look for small debris of contamination that could have passed through the sorter (Figure 1[href=https://www.wicell.org#fig1]J).\nTurn on the microscope, select the laser for DAPI or PI, and set the objective first to 20× and then to 40× for an overview of the nuclei. Once the nuclei are spotted, use the 60× objective to assess nuclear integrity in more detail.\nNote: The intact nuclei should look blue when stained with DAPI and red for PI. In both cases, a non-stained dark spot, the nucleolus, should be visible (Figure 1[href=https://www.wicell.org#fig1]J, inset).\nAdd 200 μL of Lysis Buffer to the remaining re-suspended nuclei from step 21. The final volume will be ∼300 μL. Incubate on a spinning wheel 10 min at 4°C. Keep as nuclear fraction.",
    "In parallel, during centrifugation time (step 20), process total fraction from step 6. Grind the sample in liquid Nitrogen with a mortar and pestle while adding 1 mL of Lysis Buffer and filter through a 35 μm mesh. Afterwards, incubate it on a spinning wheel for 10 min at 4°C. Take ∼300 μL of the total fraction for sonication.\nSonicate total and nuclear fractions using a Bioruptor. Use the following settings: Power: H position (High), Sonication cycle: 30 s ON, 30 s OFF, Total sonication time: five cycles on a refrigerated bath. The main purpose of the sonication step is not only to shear DNA but also ensure all nuclei are lysed after the Lysis Buffer incubation.\nNote: Pre-chilled Bioruptor before using it and keep the samples on ice and/or a refrigerated bath during sonication.\nAdd 12 μL of 5 M NaCl, to a final concentration of ∼200 mM, and 40 μg of proteinase K. First, incubate for 15 min at 50°C to allow digestion of cross-linked polypeptides by proteinase K, and then for 30 min at 65°C to reverse the formaldehyde cross-linking.\nNote: The protocol has been successfully applied to different plants species, as Rice, Sorghum, Tomato, Tobacco, Cucumber, Zucchini, and Melon, in addition to Arabidopsis. Samples have been chopped, filtered, DAPI labeled, the nuclei were gated and sorted by FACS. After sorting, isolated nuclei were analyzed by FACS and also microscopy confirming the quality of nuclear purification (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/462-Fig2.jpg\nFigure 2. Nuclei isolation by flow sorting from the leaves of different plant species",
    "Dot plot of SSC-A versus DAPI fluorescence area before and after sorting, and microscope images of sorted nuclei from different plant species. Right: Arabidopsis thaliana, Cucumis sativus (cucumber), Cucumis melo (LP T111, melon), and Oryza sativa (subsp. japonica, rice). Left: Sorgum bicolor (BTX623, sorgum), Nicotiana bentamiana (tobacco), Solanum lycopersicum (cv. Micro-Tom, tomato), and Cucurbica pepo (zucchini).\nRNA extraction and cDNA synthesis: days 1 and 2\nTiming: ∼120 min\nAdd 300 μL of RotiAqua P/C/I (Phenol acid/Chloroform/Isoamilic) for RNA extraction.\nVortex strongly for 15 s, mix well.\nCentrifuge at 12,000 × g for 15 min at 4°C\nTransfer ∼250 μL of aqueous phase (upper phase) into a new 1.5 mL Eppendorf tube. Add 1 μL of glycogen , 30 μL of NaAc 3 M pH 5.2 and 750 μL Ethanol absolute. Mix by inverting and incubate at −80°C for at least 30 min or at −20°C for at least 8 h (recommended).\nCentrifuge at 12,000 × g for 30 min at 4°C.\nDiscard the supernatant. The RNA should be seen as a white pellet.\nWash the pellet with ∼500 μL of 80% EtOH. Centrifuge at maximum speed for 5 min at 4°C.\nDiscard the supernatant. Repeat steps 33 and 34 once.\nDry the pellet for 5–10 min at 37°C. Re-suspend the pellet in 10 μL of ddH2O.\nMeasure RNA concentration using Qubit RNA HS Assay Kit. Nuclear RNA samples should have a concentration of ∼5–100 ng/μL, depending on the initial number of nuclei. See Problem 4[href=https://www.wicell.org#sec6.7] in the Troubleshooting[href=https://www.wicell.org#troubleshooting] Section.\nNote: RNA integrity could be checked using Bioanalyzer High Sensitivity RNA Analysis (Agilent RNA 6000 Pico Kit-5067-1513).\nPause Point: RNA may be stored at −80°C.\nPrepare DNase treatment by following the reaction.\ntable:files/protocols_protocol_462_4.csv\nIncubate 2 min at 37°C and place it on ice.",
    "Take 1 μL of each DNase treated RNA to be used as a negative control for contaminations in the qPCR. See steps 43–44 for further details.\nAdd components listed to the same tube containing DNase-treated RNA to synthesize the cDNA.\ntable:files/protocols_protocol_462_5.csv\nMix gently and spin down.\nUse the cDNA program:\ntable:files/protocols_protocol_462_6.csv\nPause Point: cDNA can be stored at −20°C.\nNuclear RNA purification quality control step by qPCR: day 2\nTiming: 180 min",
    "In order to analyze the quality of the nuclear purification, we have designed three specific pairs of oligos to amplify: (i) un-spliced nuclear-only mRNA of ACT2 (primers UA-Fw and UA-Rv), (ii) spliced mRNA of ACT2 (primers SA-Fw and SA-Rv) and (iii) total (un-spliced and spliced) mRNA of ACT2 (primers TA-Fw and TA-Rv) (Figure 3[href=https://www.wicell.org#fig3]A, Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/protocol-id-Mmc1.extension]). The purpose of these pairs of oligos, is to control the success of the nuclear enrichment. In the case of an efficient nuclear purification, the amount of un-spliced mRNA of ACT2 (UA mRNA) in the nuclear fraction, should be higher than the amount of UA mRNA in the total fraction. Opposite to this, the amount of spliced mRNA of ACT2 (SA mRNA) present in the total fraction, should surpass the amount of SA mRNA detected in the nuclear fraction. The relative accumulation levels will depend on several factors including the number of nuclei sorted, plants species, and plant tissue. We suggest a difference in the Ct of UA between the nuclear and total fraction of at least two cycles (See Figure 3[href=https://www.wicell.org#fig3]B). Our experience showed that differences of four to five cycles showed better results. Additionally, a comparison of Ct values of the SA between the total and nuclear fraction higher than two will also allow discarding any possible cytoplasmic contaminations on nuclear fractions. Finally, the TA, will be used as reference gene for the Relative accumulation levels of mRNA measure by RT-qPCR in the nuclear and total fractions.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/462-Fig3.jpg\nFigure 3. Molecular validation of nuclear RNA enrichment by RT-qPCR and RNA-seq",
    "(A) Schematic representation of exon1, intron1, and exon2 of ACT2. Arrows indicate primers combination to amplify: un-spliced mRNA of ACT2 (UA primers FW and RV), spliced mRNA of ACT2 (SA primers FW and RV) and total (un-spliced and spliced) mRNA of ACT2 (TA primers FW and RV).\n(B) Threshold cycle of un-spliced and spliced mRNA of ACT2 in total (T) and nuclear (N) fractions. Biological duplicates are shown as 1 and 2.\n(C) Relative expression levels of mRNA in total and nuclear fractions of un-spliced ACT2 (yellow) and RHIP1 (purple) measured by RT-qPCR.\n(D) Relative expression levels of MIR159a and MIR167a in total and nuclear fractions measured by RT-qPCR. Note that both miRNA precursors and un-spliced ACT2 accumulate on the nuclear fraction, while the levels of RHIP1 are similar in both fractions. (B–D) The errors bars show the standard deviation of the three technical replicates performed for each sample. For all RT-qPCR total ACT2 (primers TA-Fw and TA-Rv) was used as reference RNA.\n(E–G) RNA-seq analysis. (E) Nuclear and total fractions distribution of inter-genic (turquoise), introns (yellow) and exons (gray). Biological duplicates are shown as 1 and 2. Note the increase in detection of inter-genic and intronic regions in nuclear fractions. (F) Reads distribution in total (light purple) and nuclear (light green) fractions of exons corresponding to: protein coding, long-non-coding RNA (lnc), small nuclear (sn)/ small nucleolar (sno) RNA, and microRNA precursors (MIRNA). (G) Reads distribution in total and nuclear fractions of MIR159b and MIR167b. Note that over ~85% of the miRNA precursors reads are detected on the nuclear fraction.\nPrepare a dilution of each cDNA (we recommend 1:4) to use as a template in the qPCR reaction.\nPrepare a dilution of each DNase treated RNA (keeping same ratio used for cDNA synthesis) to use as DNAse treatment control.",
    "Prepare the following qPCR reaction. Perform technical triplicates of each sample.\ntable:files/protocols_protocol_462_7.csv\nSet and run the qPCR program as shown below. See Problem 5[href=https://www.wicell.org#sec6.9] and Problem 6[href=https://www.wicell.org#sec6.11] in the Troubleshooting[href=https://www.wicell.org#troubleshooting] Section.\ntable:files/protocols_protocol_462_8.csv\nCalculate relative accumulation levels by subtracting the average threshold cycle (Ct) values for the genes of interest from those of the housekeeping gene (to give ΔCt) and then calculating “ΔΔCt” (Figures 3[href=https://www.wicell.org#fig3]B–3D).\nNote: In the example depicted in Figure 3[href=https://www.wicell.org#fig3], we analyzed two biological replicates of wild-type (Col-0) plants total (T) and nuclear (N) fractions (1 and 2) by RT-qPCR. Both biological replicates showed a relative mRNA expression level of un-spliced ACT2 of ∼100 times higher in the nuclear fraction than in total fractions (Figure 3[href=https://www.wicell.org#fig3]C, left panel). Conversely, housekeeping control mRNA, RHIP1 (Czechowski et al., 2005[href=https://www.wicell.org#bib3]) showed an equal relative expression level in the nuclear and total fractions (Figure 3[href=https://www.wicell.org#fig3]C, right panel). Finally, we decided to analyze relative accumulation level of MIRNA precursors (e.g., MIR159a and MIR167a). MIRNA precursors are processed in the nucleus, not being exported to the cytoplasm, this makes them a good example of nuclear-specific RNAs (Yu et al., 2017[href=https://www.wicell.org#bib16]). These showed an enrichment on the nuclear fraction versus the total fraction (Figure 3[href=https://www.wicell.org#fig3]D). These controls were used to verify the quality of the nuclear RNA purification.\nNote: In addition to be nuclear-specific RNAs, one of the advantages of using un-spliced Actin, or MIRNA precursors is that these genes were conserved during evolution and can be found in other plant species. Moreover, orthologs have been already described (Chorostecki et al., 2017[href=https://www.wicell.org#bib5]) and/or they can be found through ortholog finders such as MetaPhOrs[href=http://orthology.phylomedb.org/] (Chorostecki et al., 2020[href=https://www.wicell.org#bib4]), in case nuclear sorting is performed from other plant species different to Arabidopsis.\nRNA-seq: day 3",
    "RT-qPCRs can be a very effective approach to analyze the changes in a handful of genes but, when global analyses are desired, we recommend doing RNA-seq. After validating nuclear purification quality by qPCR, RNA libraries can be constructed from (i) total RNA, (ii) ribosomal-depleted RNA, and (iii) poly-A-enriched RNA. Alternatively, (iv) small RNA libraries can be constructed using the Illumina TruSeq sRNA kit. Additionally, other types of specific libraries, such as miRNA target detection or MIRNA processing intermediates, among others) can be constructed using nuclear sorted RNA (Schapire et al., 2013[href=https://www.wicell.org#bib11]; Zhai et al., 2013[href=https://www.wicell.org#bib17]).\nAfter performing nuclear sorting, RNA libraries can be prepared according to TruSeq RNA Sample Preparation Guide (Illumina) as used in (de Leone et al., 2020[href=https://www.wicell.org#bib6]). First, RNA is poly-A-enriched. This represents the case of lowest RNA input, but often the preferred method when constructing libraries for RNA-seq. cDNA is synthesized using random hexamers and multiplex indexed adapters ligated. Finally, an enrichment step of 12 PCR cycles is done prior to DNA sequencing.\nLibraries are validated with the Agilent 2100 Bioanalyzer and the Agilent DNA1000 Kit (Agilent Technologies). The libraries are pooled and pair-end sequenced with an Illumina HiSeq1500, providing 100-bp single end reads.",
    "As an example, we analyzed RNA-seq results of total and nuclear fractions of two replicates of wild-type (Col-0) plants poly-A enriched (Figures 3[href=https://www.wicell.org#fig3]E–3G) (de Leone et al., 2020[href=https://www.wicell.org#bib6]). After sequencing, raw data processing and normalization of the reads, the quality of the nuclear purification was assessed. We quantify the presence of poly-A RNA molecules derived from exons, introns, and inter-genic regions in total and nuclear fractions. Exons represented ∼96.5% of the reads in the Total fraction and ∼89.0% of the reads in the nuclear fraction (Figure 3[href=https://www.wicell.org#fig3]E). On the other hand, introns represented ∼2.7% of the reads in the total fraction and ∼8.7% in the nuclear fraction, consistent with the enrichment of nuclear RNA molecules (Figure 3[href=https://www.wicell.org#fig3]E). Next, we analyzed the distribution of different RNA molecules in the total and nuclear fraction. While the same amount of protein-coding exon reads was found in the total and nuclear fractions, long-non-coding RNA (lnc), small nuclear (sn), nucleolar (sno) RNA, and MIRNA precursors were highly enriched in the nuclear fraction (82%–94% of the reads) (Figure 3[href=https://www.wicell.org#fig3]F). Furthermore, ∼85%–90% of the reads of, previously RT-qPCR validated same MIRNA precursors families, MIR159 and MIR167, were found in the nuclear fraction (Figure 3[href=https://www.wicell.org#fig3]G). Throughout this analysis, we could verify the efficiency of the nuclear purification on a global scale as well as particular examples of well-known RNA molecules, such as snRNA, snoRNA, and MIRNA precursors.\nCell-type-specific sorting: day 1\nTiming: 180 min",
    "The protocol described so far purifies the nucleus of every cell in the chopped plant tissue without distinction. However, the experimental design may occasionally require the analysis of subcellular RNA distribution of specific cell types. For this purpose, we use transgenic Arabidopsis lines expressing Nuclear Fluorescence Protein. In this protocol, we used a Nuclear Targeting Fusion (NTF), as an example. NTF consist on: the WPP domain of RanGAP1 (targeting the nuclear envelope) and GFP under the transcriptional control of the SHR promoter (pSHR:NTF), which is specifically expressed in the stele of Arabidopsis roots (Brosnan et al., 2019[href=https://www.wicell.org#bib2]; Helariutta et al., 2000[href=https://www.wicell.org#bib10]) (Figures 4[href=https://www.wicell.org#fig4]A–4C). The translational fusion of WPP to GFP results in the GFP protein being inserted into the nuclear envelope (Figure 4[href=https://www.wicell.org#fig4]B, white arrows). The advantage of this approach is that any plants expressing WPP-GFP or any other nuclear fluorescent tags can be used to purify nuclei by flow cytometry (Deal and Henikoff, 2011[href=https://www.wicell.org#bib7]; You et al., 2017[href=https://www.wicell.org#bib15]; Gutzat and Scheid, 2020[href=https://www.wicell.org#bib9]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/462-Fig4.jpg\nFigure 4. Cell-type-specific nuclear sorting\n(A) Microscope image of Arabidopsis transgenic roots expressing pSHR:NTF (WPP:GFP:BLRP) stained with PI. PI and GFP channels are merged.\n(B) Close up of Arabidopsis transgenic roots expressing pSHR:NTF (WPP:GFP:BLRP) stained with PI. White arrows indicate nuclei where the GFP is visually located on the nuclear envelope.\n(C) Schematic representation of the expressed construct, pSHR:NTF.\n(D) Plot of SSC-A versus DAPI fluorescence area from nuclear preparation of pSHR:NTF transgenic plants.\n(E and F) Plot of GFP versus DAPI fluorescence area in control non-transgenic plants nuclei (E) and in pSHR:NTF transgenic plants nuclei (F). Note than non-transgenic plants nuclei could show some false positive GFP events (usually less than 2%) cause probably to some fiber leftover present on plants homogenate. See also Figure S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/protocol-id-Mmc1.extension]B.",
    "(G) Plots of GFP versus DAPI fluorescence on GFP-positive nuclei from pSHR:NTF transgenic Arabidopsis plants after sorting.\n(H) Relative expression levels of mRNA in total and nuclear fractions of whole roots (DAPI staining defined) and cell-type-specific (GFP labeled) nuclear purifications measured by RT-qPCR. The mRNA levels of un-spliced nuclear ACT2 (yellow) and SHR (blue) stele-specific transcription factor are shown in the upper and lower panels, respectively. The errors bars show the standard deviation of the three technical replicates performed for each sample. Total ACT2 (primers TA-Fw and TA-Rv) was used as reference RNA.\nNote: Grow seedlings on vertical MS plates covered in nylon mesh with continuous white light (100 mmol photons m−2 s−1) at 22°C. Use a Nº 10 scalpel blade to harvest 6-day-old roots by cutting several millimeters from the cotyledons of the seedlings. Cross-link, homogenize, and stain the samples as described on steps 1–10. To set up the flow sorter (BD FACS Aria III), follow steps 11–13.\nUse the following laser excitation parameters and fluorescence detection filters. For DAPI: excitation at 405 nm (50 mW) and detection with 450/40 BP. Set the trigger on DAPI fluorescence. For GFP: excitation at 488 nm (20 mW or higher) and detection with a 530/30 BP.\nPrepare the layout with two bivariate dot plots: log SSC-A vs log DAPI-A (Figure 4[href=https://www.wicell.org#fig4]D) and log GFP-A versus log DAPI-A (Figures 4[href=https://www.wicell.org#fig4]E and 4F).\nRun the nuclei sample and select a proper threshold level that allows you to display the signals on a dot plot of SSC-A versus DAPI fluorescence area (both in log scale). Adjust the voltage of the photomultiplier for the DAPI fluorescence to achieve a displaying of all ploidy level populations.",
    "Draw a gate around the nuclei populations (Figure 4[href=https://www.wicell.org#fig4]D, black polygon). For GFP-positive nuclei sorting, draw the subsequent polygonal gate around GFP-positive events on the GFP-A vs DAPI-A plot (Figure 4[href=https://www.wicell.org#fig4]F). To exclude aggregates, its optional to draw additional diagonal gate on the DAPI-A vs DAPI-H plot. (Figure S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/protocol-id-Mmc1.extension]B).\nIn the “Sort layout” choose the 4-way purity mode. Assign the sort location field for the collection tube. Sort the required number of nuclei into collection tubes with ∼100 μL of NIB and afterwards keep them on ice. For additional analysis export data as FCS 3.0 file(s) and use FlowJo, LLC software.\nRe-analyze sorted GFP-positive nuclei to check purity and verify sorting conditions (Figure 4[href=https://www.wicell.org#fig4]G).\nConcentrate, reverse cross-link, extract, and quantify the RNA from the sorted samples (as was described before in steps 20-36).\nPause Point: RNA may be stored at −80°C.\nPerform DNase, cDNA synthesis, and qPCR (as was described before in steps 37-47).\nNote: For Nuclear RNA purification quality control step, we first used the same primers described in Figure 3[href=https://www.wicell.org#fig3]A to quantify un-spliced nuclear mRNA of ACT2 and the total mRNA of ACT2 (See Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/protocol-id-Mmc1.extension]). Initially, we analyzed the enrichment of nuclear ACT2. There was an enrichment of nuclear ACT2 RNA levels in the nuclear fractions sorted either by DAPI (∼30 times) or GFP (∼20 times) when compared to the total fraction (Figure 4[href=https://www.wicell.org#fig4]H, top panel). Then, to characterize the GFP-sorted nuclei, we designed a new set of primers to specifically amplify SHR mRNA (Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/protocol-id-Mmc1.extension]). Analysis of SHR mRNA levels showed a 5-fold enrichment on GFP-sorted nuclei in comparison to DAPI-sorted nuclei (Figure 4[href=https://www.wicell.org#fig4]H, bottom panel). These results support the high effectiveness of nuclear sorting by GPF expression driven by cell type-specific promoters."
  ],
  "subjectAreas": [
    "Genomics",
    "Rnaseq",
    "Plant Sciences",
    "Flow Cytometry",
    "Cell Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Ecology & Environmental Biology"
  ]
}