{
  "id": 3251,
  "origin_website": "Cell",
  "title": "Mapping alternative polyadenylation in human cells using direct RNA sequencing technology",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIsolation of cytoplasmic RNAs\nTiming: 30–45 min\nPrior to the isolation step, prepare ice-cold PBS and pre-cool the centrifuge to 4°C.\nNote: To ensure optimal cytoplasmic RNA yield (∼30 μg), prepare two plates of HEK293 in 10-cm tissue culture dishes at 80% cell confluency (9 × 106 cells). For other cell systems, 5–30 pg of total RNAs per cell are expected.\nNuclear-cytoplasm fractionation of HEK293 cells.\nDiscard the medium from the culture dishes. Place the culture dishes on ice.\nAdd 3 mL of cold PBS to each culture dish and carefully scrape the cells using a cell scraper (tilt the culture dish to maximize the collection of cells in the PBS solution).\nCombine the cell suspension from both plates (2 × 3 mL) into a single 15 mL falcon tube and centrifuge at 1500 × g at 4°C for 2 min.\nRemove the supernatant and resuspend the cell pellets with 800 μL cold cytoplasmic extraction buffer. Add 400 units of RNase Inhibitor (NEB) to the cell suspension and incubate on ice for 10 min.\nCentrifuge at 1500 × g and 4°C for 2 min.\nTransfer and divide 800 μL of the supernatant (cytoplasmic fraction) into four new RNAse-free Eppendorf tubes (200 μL each). Nuclear pellets are discarded.\nCritical: Dividing 800 μL of the cytoplasmic fraction into 4 × 200 μL is crucial to ensure efficient column throughput and optimal RNA yield.\nIsolation of cytoplasmic RNAs.",
    "Note: We used the ReliaPrep™ miRNA Cell and Tissue Miniprep System for isolation for RNA from cytoplasmic fraction. However, it is not necessary to use the miRNA kit, because the length of most of polyA-tailed RNAs (mRNAs and lncRNAs) is longer than 200nt. Thus, they can be enriched with other RNA extraction column such as RNeasy Kit (Qiagen) or High Pure RNA Isolation Kit (Roche).\nNote: All four cytoplasmic fractions should be used to isolate the RNA material from step 1f. Separate column should be used for each 200 μL fraction.\n  Steps 2a-e describe the RNA isolation for one cytoplasmic fraction reaction (200 μL).\nGently mix 200 μL of cytoplasmic fraction with 200 μL Lysis Buffer (LBA+TG) buffer, 130 μL RNA Dilution Buffer (RDB) and 739 μL isopropanol.\nTransfer the mixture to the column and centrifuge at 11,600 × g at 25°C for 1 min. Remove the liquid from the collection tube. Repeat this step for the rest of the mixture using the same column.\nAdd 500 μL RNA Wash Solution (RWA) to column and centrifuge at 11,600 × g for 1 min at 25°C. Discard the liquid from the collection tube.\nAdd another 500 μL RWA to column and centrifuge at 16,000 × g for 2 min. Discard liquid from the collection tube.\nTransfer the column into a new 1.5 mL elution tube.\nElute the RNAs by adding 50 μL nuclease-free water to column and incubate for 1 min at 25°C then centrifuge at 11,600 × g for 1 min. Collect all eluted cytoplasmic RNA into one single 1.5 mL elution tube.\nNote:",
    "Check the quantity and quality of the cytoplasmic RNA using nanodrop spectrophotometer. A yield of at least 30 μg is expected at this point. If A260/A280 and/or A260/A230 ratios are low, they indicate a contamination by proteins or salt. If A260/A280 ratio < 1.8 and A260/A230 < 1.7, users can follow the troubleshooting[href=https://www.wicell.org#troubleshooting] (problem 4[href=https://www.wicell.org#sec7.7]). In addition to RNA quality check, the RNA integrity should be tested on a Bioanalyzer or RNA gel, especially for RNAs isolated from primary tissues.\n  The purified RNAs can be stored at −80°C for up to one week.\nIsolation of cytoplasmic polyA-tailed RNA\nTiming: 90 min\nNote: Keep all reagents on ice for optimal results. The following protocol is modified from NEBNext® poly(A) mRNA magnetic isolation module (E7490).\nCritical: When working with Oligo-dT magnetic beads, do not use a high-speed centrifuge or a vortex mixer; instead, gently pipet up and down to mix the beads solution. 30 μg cytoplasmic RNAs should be used as the starting material for optimal results.\nDilute the cytoplasmic RNAs with nuclease-free water to a final volume of 100 μL in a 1.5 mL RNAse-free tube.\nNote: Prepare the thermal cycler at 65°C for step 5b. The lid needs to be heated at 95°C.\nWashing the magnetic beads.\nAdd 100 μL of well resuspended NEBNext magnetic oligo-dT beads to 1.5 mL RNAse-free tube.\nWash the beads by adding 100 μL RNA binding buffer (provided in NEB #E7490 kit). Gently pipette the solution up and down 6 times using 100 μL pipette.\nPlace the tube in a magnetic rack at 25°C for approx. 1 min until the solution becomes clear.\nDiscard the supernatant from the tube by pipetting using 100 μL pipette without removing the tube from the magnetic rack or disturbing the beads.\nRemove the tube from the magnetic rack.",
    "Repeat steps 4b-e.\nRNA binding to the beads.\nResuspend the washed beads in 100 μL RNA binding buffer and add the 100 μL of cytoplasmic RNA from step 3. Mix the solution gently by pipetting up and down 3 times using 100 μL pipette. The pipette is set for 100 μL.\nTransfer the bead suspension into 0.5 mL tube. Place the tube in the thermal cycler and heat the sample at 65°C for 5 min and cool to 4°C with the heated lid set at ≥75°C to denature the RNA and facilitate binding of the mRNA to the beads.\nResuspend the beads by gently pipetting the solution up and down 6 times using 100 μL pipette. The pipette is set to 100 μL.\nIncubate the tube at 25°C for 5 min to allow the binding of polyA-tailed RNA to the beads.\nResuspend the beads by gently pipetting the solution up and down 6 times using 100 μL pipette. The pipette is set to 100 μL.\nIncubate the tube at 25°C for another 5 min to allow the RNA to bind to the beads.\nPlace the tube in a magnetic rack at 25°C for 30 s–1 min until the solution becomes clear.\nDiscard the supernatant from the tube by pipetting without removing the tube from the magnetic rack or disturbing the beads.\nRemove the tube from the magnetic rack.\nNote: Prepare the thermal cycler at 80°C for steps 7b and 7o. The lid temperature is set at 95°C.\nWashing the magnetic beads.\nWash the beads by adding 200 μL wash buffer (provided in NEB #E7490 kit) to remove unbound RNA. Gently pipette the solution up and down 6 times using 1000 μL pipette. The pipette is set to 200 μL.",
    "Place the tube in a magnetic rack at 25°C until the solution becomes clear.\nDiscard the supernatant from the tube by pipetting without removing the tube from the magnetic rack or disturbing the beads.\nRemove the tube from the magnetic rack.\nRepeat steps 6a-d.\nElution of the polyA-tailed RNA from the beads.\nAdd 50 μL of Tris buffer (provided in NEB #E7490 kit) to each tube and gently pipette the solution up and down 6 times using 100 μL pipette. The pipette is set to 50 μL.\nIncubate the tubes at 80°C for 2 min, and then place them on the working bench until they reach 25°C.\nAdd 50 μL of RNA binding buffer to each sample and gently pipette the solution up and down 6 times to mix thoroughly using 100 μL pipette. The pipette is set to 50 μL.\nIncubate the tubes at 25°C for 5 min.\nResuspend the beads by gently pipetting the solution up and down 6 times.\nIncubate the tubes at 25°C for another 5 min to allow the RNA to bind to the beads.\nPlace the tube in a magnetic rack at 25°C until the solution becomes clear.\nDiscard the supernatant from the tube by pipetting without removing the tube from the magnetic rack or disturbing the beads.\nRemove the tube from the magnetic rack.\nWash the beads with 200 μL wash buffer. Gently pipette the solution up and down 6 times.\nPlace the tube in a magnetic rack at 25°C until the solution becomes clear.\nDiscard the supernatant from the tube by pipetting without removing the tube from the magnetic rack or disturbing the beads.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2817-Fig1.jpg\nFigure 1. The use of the 10 μL and 100 μL pipette tips to remove ethanol residue",
    "Note: To remove ethanol residue without disturbing the beads, use the 10 μL and 100 μL pipette tips as shown in the picture below (Figure 1[href=https://www.wicell.org#fig1]).\nRemove the tube from the magnetic rack.\nElute the RNA from the beads by adding 11 μL of Tris buffer. Gently pipette the solution up and down 6 times.\nIncubate the tubes at 80°C for 2 min, and then place them on working bench until they reach 25°C.\nPlace the tube on magnetic rack at 25°C until the solution becomes clear.\nCollect the purified polyA-tailed RNA by transferring the supernatant to a 1.5 mL DNA LoBind tube and then place the tube on ice.\nCheck the yield and the quality of the purified polyA-tailed RNA using Qubit fluorometer and Qubit RNA high sensitivity assay kit. Prepare the following component in a 0.2 mL tube and measure on a Qubit fluorometer:\ntable:files/protocols_protocol_2817_2.csv\nNote: Expectation: approx. 500 ng of polyA-tailed RNA from 30 μg input RNAs. For isolation from polyA-tailed RNAs from primary cells or tissues we recommend to check the RNA integrity on a Bioanalyzer. A low yield of polyA-tailed RNA may be due to the RNA degradation from 3′end (troubleshooting[href=https://www.wicell.org#troubleshooting]: problem 5[href=https://www.wicell.org#sec7.9]).\nLibrary preparation\nTiming: 110–130 min\nNote: The following protocol is modified from Direct RNA sequencing (SQK-RNA002 version: DRS_9080_V2_revO_14Aug2019) Nanopore protocol. Prepare a program at the thermal cycler for incubation at 50°C for 50 min, then 70°C for 10 min (step 9d). The lid temperature needs to be set at 95°C. Keep all reagents on ice for optimal results. For a quality library preparation 500 ng polyA-tailed RNA is used as a starting material. However 200–500 ng polyA-tailed RNA will also work. Lower than 200 ng polyA-tailed RNA may reduce the sequencing yield.",
    "Ligation of a double stranded RT adapter (RTA) (provided by SQK-RNA002 kit) to polyA-tailed RNA.\nPrepare in a 0.2 mL PCR tube and mix the reagents in the following order:\ntable:files/protocols_protocol_2817_3.csv\nGently mix by pipetting and incubate the reaction at 4°C for 10 min.\nNote: The incubation time could be extended up to 1 h. According to our experience extending of the incubation time does not affect the sequencing yields. Thus, having a break at this step is possible.\nReverse transcription.\nMix the following reagents to make the reverse transcription master mix:\ntable:files/protocols_protocol_2817_4.csv\nAdd the master mix into the 0.2 mL PCR tube from step 8b and mix gently by pipetting.\nAdd 2 μL of SuperScript III reverse transcriptase to reaction and mix gently by pipetting.\nIncubate the tube in a thermal cycler at 50°C for 50 min, then 70°C for 10 min, and bring the sample to 4°C for 10 min.\nTransfer the sample to a clean 1.5 mL Eppendorf DNA LoBind tube.\nResuspend the stock of Agencourt RNAClean XP beads by vortexing.\nAdd 72 μL of resuspended RNAClean XP beads to reverse transcription reaction from step 9e and mix it by pipetting.\nIncubate the mixture on a Hula mixer (rotator mixer) for 5 min at 25°C.\nSpin down the sample shortly, place it on magnetic rack at 25°C until the solution becomes clear and remove the supernatant by pipetting without disturbing the beads.\nWash the beads by adding 150 μL of freshly prepared 80% ethanol without disturbing the beads.\nCritical: Freshly prepared 80% ethanol in nuclease free water should be used. Pipetting ethanol directly on the beads will decrease the output.\nKeep the tubes on the magnetic rack, rotate the tubes 180°C and wait until the beads migrate toward the magnet and build a pellet.",
    "Repeat the step 9k so that the beads migrate to the starting position.\nRemove the 80% ethanol by pipetting without disturbing the beads.\nNote: To remove ethanol residue without disturbing the beads, use the 10 μL and 100 μL pipette tips shown in Figure 1[href=https://www.wicell.org#fig1].\nRemove the tube from the magnetic rack and resuspend the pellet in 20 μL nuclease-free water. Incubate at 25°C for 5 min.\nPlace the tube in a magnetic rack at 25°C until the solution becomes clear.\nPipette 20 μL of eluate into a 1.5 mL DNA LoBind tube.\nLigation of RNA sequencing adapter with motor protein (RMX) to the RNA molecule.\nPrepare the reaction mixture in a 1.5 mL DNA LoBind tube in the following order:\ntable:files/protocols_protocol_2817_5.csv\nMix the components by gently pipetting up and down using 100 μL pipette. The pipette is set for 50 μL.\nCritical: Do not use a vortex mixer! The reaction mixture contains the motor protein (RMX).\nIncubate the reaction mixture at 25°C for 10 min.\nResuspend the stock of Agencourt RNAClean XP beads by vortexing.\nAdd 40 μL of resuspended RNAClean XP beads to the adapter ligation reaction from step 10b and mix it gently by pipetting.\nIncubate the mixture on a Hula mixer (rotator mixer) for 5 min at room temperature.\nSpin down the sample shortly (centrifuge speed), place it in a magnetic rack at 25°C until the solution becomes clear, and remove the supernatant by pipetting without disturbing the beads.\nAdd 150 μL wash buffer (WSB, provided in SQK-RNA002 kit) to the beads. Close the tube lid and resuspend the beads by flicking the tube carefully.\nCritical: Do not try to mix the beads by pipetting or vortexing; it will damage the motor protein annealed on the adapter.",
    "Critical: Gently flicking the tubes is more effective in removing unbound adapters than immediately aspirating after adding the wash buffer. A high number of unbound adapters will decrease the sequencing output.\nSpin down the tube shortly and place the tube on a magnetic rack at 25°C until the solution becomes clear.\nDiscard the supernatant from the tube by pipetting without removing the tube from the magnetic rack or disturbing the beads.\nRepeat steps 10h-j once.\nRemove the tube from the magnetic rack and resuspend the beads in 21 μL Elution Buffer (ELB, provided in SQK-RNA002 kit) by gently pipetting.\nIncubate for 10 min at 25°C.\nSpin down the tube shortly and place the tube in a magnetic rack at 25°C until the solution becomes clear.\nTransfer the 21 μL eluate into a clean 1.5 mL DNA LoBind tube.\nOptional: Quantity control of the purified sample from step 10o can be done using the Qubit fluorometer dsDNA high sensitivity assay kit. An approximate yield of 200 ng is expected. A lower yield of adapter annealed RNAs is due to the RNA degradation during library preparation or a lower than intended AMPure beads-to-sample ratio (troubleshooting[href=https://www.wicell.org#troubleshooting]: problem 6[href=https://www.wicell.org#sec7.11]).\nPriming and loading the SpotOn flow cell\nTiming: 15–20 min\nThe reverse-transcribed and adapted RNA is now ready for loading into the flow cell.\nThaw the RNA Running Buffer (RRB), Flush Tether (FLT) and one tube of Flush Buffer (FB) at room temperature.\nMix the RNA Running Buffer (RRB), Flush Tether (FLT) and Flush Buffer (FB) tubes thoroughly by vortexing and spinning down at room temperature.\nOpen the MinION Mk1B lid and slide the flow cell under the clip. Firmly press down the flow cell to ensure proper thermal and electrical contact.\nSlide the priming port cover clockwise to open the priming port (Figure 2[href=https://www.wicell.org#fig2]).",
    "imgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2817-Fig2.jpg\nFigure 2. SpotON flow cell map (Retrieved from streetscience.community/protocols/beer-dna-sequencing/[href=http://streetscience.community/protocols/beer-dna-sequencing/])\nCritical: Make sure the array pores are always covered by buffer throughout the entire procedure. Introducing air bubbles into the array can irreversibly damage the pores.\nPriming and loading the SpotON flow cell.\nAfter opening the priming port, check for small air bubbles under the cover. Remove any bubbles by withdrawing 20–30 μL of buffer from the flow cell.\nSet a 1000 μL Pipette to 200 μL.\nInsert the tip into the priming port.\nTurn the wheel until the dial shows 220–230 μL or until a small volume of a buffer can be seen entering the pipette tip.\nVisually check that there is a continuous buffer from the priming port across the sensor array.\nCritical: Make sure that no bubble forms during pipetting. The bubble will induce unwanted pressure in the flow cell.\nPrepare the mixture for flow cell priming by adding 30 μL of thawed Flush Tether (FLT) directly into the Flush Buffer (FB) tube and mix by pipetting it gently at 25°C.\nLoad 800 μL of the priming mix into the flow cell through the priming port (avoid introducing air bubbles). Wait for 5 min to equilibrate the flow cell.\nNote: Connect the SpotON flow cell loaded MinION device with the computer. Prior to use, the flow cell can be checked by performing a Flow Cell Check using MinKNOW (the MinION device software). The Flow Cell Check will report the number of nanopores available for sequencing (> 1,100 nanopores should be active). The Flow Cell Check will be performed as following:\nConnect the device to a computer (a window of a flow cell appears and a note with “Flow cell not checked”).\nClick symbol ≡.\nThen “Flow cell check”.\nThen “Start”.",
    "Note: After the device reaches 37°C, it will start scanning the number of active channels. If the temperature is fluctuated, the flow cell may lose the contact with the device (troubleshooting[href=https://www.wicell.org#troubleshooting]: problem 2[href=https://www.wicell.org#sec7.3] and 3[href=https://www.wicell.org#sec7.5]).\nPrepare the library for loading by following these steps:\nMix the 20 μL of prepared RNA library with 17.5 μL nuclease-free water.\nIn a new tube, prepare the library for loading as follows:\ntable:files/protocols_protocol_2817_6.csv\nComplete the flow cell priming:\nGently lift the SpotON sample port cover to make the SpotON sample port accessible.\nLoad 200 μL of the priming mix into the flow cell via the priming port (not the SpotON sample port), avoiding the introduction of air bubbles.\nMix the prepared library gently by pipetting prior to loading.\nAdd 75 μL of prepared library to the flow cell via SpotON sample port in dropwise fashion. Ensure each drop flows into the port before adding the next.\nGently replace the SpotON sample port cover, making sure the bung enters the SpotON port, close the priming port and close the MinION Mk1B lid.\nNanopore direct RNA sequencing\nTiming: 48–72 h\nOpen the MinKNOW software (21.06.0).\nSelect “Start” then “Start sequencing” and fill in the information, as requested:\nSelected positions:\nPosition: Select the MinION device.\nChoose an experiment number and sample ID.\nVerify the flow cell ID number. The flow cell model will be recognized by MinKNOW.\nKit:\nSelected kit: SQK-RNA002.\nRun options:\nRun length: 72 h.\nBias voltage: −180 mV.\nBase calling: Off.\nOutput: FAST5 (On).\nNote: After starting the sequencing run, it is recommendable to monitor the initial result after around 1 h to ensure that more than 90% of the pores are sequencing samples.",
    "Critical: A solid state drive (SSD) should be used to save the data. Make sure that there is at least 250 GB free on the disk drive where the sequencing data will be saved, less disk space might interrupt the sequencing (troubleshooting[href=https://www.wicell.org#troubleshooting]: problem 1[href=https://www.wicell.org#sec7.1]).\nData analysis\nThe complete data analysis pipeline is depicted in Figure 3[href=https://www.wicell.org#fig3]. Here, we describe a step-by-step protocol, including the expected outcome.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2817-Fig3.jpg\nFigure 3. Strategy for data analysis\n(A) Cytoplasmic polyA-tailed mRNAs were subjected to direct RNA-seq. The nanopore reads can be used for mapping 3′end cleavage, quantitating gene expression and identification of spliced isoforms. To map and quantitate 3′end cleavage sites, raw nanopore reads were trimmed to the last 200 nucleotides from the 3′end. The 3′end cleavage site usage at the distal and the proximal site were quantitated based on the human polyA database. Full-length reads are used for gene expression quantification and alternative splicing analysis.\n(B) Due to the nature of long read sequencing, reads of transcripts cleaved at the distal site also cover the proximal site. Thus, to calculate the read coverage for 3′ cleavage site we trimmed the reads to the last 200 nucleotides from the 3′end.\n(C) An overview of the data analysis pipeline (Steps 18–21).\nBase calling and alignment\nTiming: 1–2 days\nNote: Base calling is a process to convert the electrical signals (FAST5 data) into nucleotide sequences (fastq data) (Figure 3[href=https://www.wicell.org#fig3]C).\nBase calling:",
    "Use Guppy, a data processing toolkit containing Oxford Nanopore Technologies’ base calling algorithms, to translate the raw electrical signal from the sequencer into a nucleotide sequence in fastq format. Guppy v6.4.8 for GPU mode is available for download at community.nanoporetech.com/downloads[href=https://community.nanoporetech.com/downloads]. Guppy is installed according to Oxford Nanopore’s instruction (community.nanoporetech.com/docs/prepare/library_prep_protocols/Guppy-protocol/v/gpb_2003_v1_revas_14dec2018/linux-guppy). All base calling operations are launched in GPU mode, using a Nvidia Tesla A100 40GB GPU. For base calling, we use the script runbatch_gpu_guppy.sh (available for download in github.com/trandoanduyhai/guppy_on_slurm).\nFor base calling RNA data the config file rna_r9.4.1_70bps_hac.cfg needs to be added to the “runbatch_gpu_guppy.sh” script. Alternatively, user can also provide flowcell model and sequencing kit as the guppy parameters. For example, guppy_basecaller --flowcell FLO-MIN106 --kit SQK-RNA002. Guppy can choose the config file automatically according to the provided flowcell model and sequencing kit.\nAlignment:\nAfter base calling, data was aligned to the human reference genome GRCh37 using minimap2.4[href=https://www.wicell.org#bib4] Open a terminal, navigate to the run folder and run:\n> minimap2 –ax splice –uf –k14 $referenceGenome.fa $sample.fastq | samtools sort -@ 8 -O BAM -o $outfile.bam - && samtools index $outfile.bam\nNote: The alignment of full-length reads can be used to quantitate the cytoplasmic expression level. To install minimap2, user can acquire precompiled binaries with: curl -L https://github.com/lh3/minimap2/releases/download/v2.26/minimap2-2.26_x64-linux.tar.bz2 | tar-jxvf-/minimap2-2.26_x64-linux/minimap2\nTrimming of nanopore reads\nTo map and quantify the 3′end cleavage sites, raw nanopore reads are trimmed from the 5′ end to a uniform length so that the last 200 nucleotides before the polyA tail are retained. The tool NanoFilt6[href=https://www.wicell.org#bib6] is applied for the read trimming. The python script is freely available at (https://github.com/wdecoster/nanofilt/blob/master/scripts/get_read_ends.py[href=https://github.com/wdecoster/nanofilt/blob/master/scripts/get_read_ends.py]).\nNote: Users do not need to install NanoFilt the whole tool. In order to run get_read_ends.py script, users only need python with biopython dependency installed.\nOpen a terminal, navigate to the run folder and run:",
    "> python get_read_ends.py --bases_from_end 200 reads.fastq.gz | gzip > last_200_bp.fastq.gz\nFor downstream analysis trimmed reads are then aligned to the GRCh37 human genome reference using minimap2:\n> minimap2 –ax splice –uf –k14 –t16 $referenceGenome.fa last_200_bp.fastq.gz | samtools sort -@ 8 -O BAM -o $outfile.bam - && samtools index $outfile.bam"
  ],
  "subjectAreas": [
    "Sequence Analysis",
    "Gene Expression"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}