{
  "id": 6741,
  "origin_website": "Bio",
  "title": "Expression and Purification of Adeno-associated Virus Virus-like Particles in a Baculovirus System and AAVR Ectodomain Constructs in <em>E. coli</em>",
  "procedures": [
    "Baculoviral expression of AAV-2 VLPs in Sf9 cellsThis consists of five steps: (1) starting and maintaining a culture of Sf9 cells, (2) construction and purification of the bacmid DNA containing the AAV-2 capsid gene, (3) transfection of Sf9 cells with the prepared bacmid DNA, (4) collection and amplification of baculovirus stock, and (5) baculoviral infection of Sf9 cells for production of VLPs.Growth of Sf9 cellsWarm frozen Sf9 stock at 37 °C until nearly thawed.Aseptically transfer the cells into a 250 ml Erlenmeyer flask containing 25 ml of pre-warmed (25-30 °C) Sf-900TM II SFM.Incubate at 28 °C while shaking at 135 rpm, protected from light (as suggested by the manufacturer).Note: A culture from frozen stock can take a couple of weeks to grow to a suitable density. Count cells daily when culture shows signs of growth. To count, mix 1 ml of culture with 100 µl of trypan blue and mix gently by flicking the tube. Wait 2 min, then remix and count with a hemocytometer. (It can also usually be assumed that cells will have propagated sufficiently, and can be counted at 48 h, and split immediately, as described in the next paragraph.)When cells reach a density of 4 x 106-6 x 106 cells/ml, passage to 0.5 x 106-1.0 x 106 cells/ml in a final volume of 50 ml. Healthy cultures double in ~24 h and should be passaged every 2-4 days. Continue passaging as needed to maintain an appropriate cell density. Cultures may show decreasing viability after passage 30 and a new culture may need to be started.Note: Starting a culture with a density < 0.5 x 106 cells/ml or allowing a culture to exceed 8 x 106 cells/ml is highly discouraged as it leads to longer growth lags and decreased viability.",
    "Generation and purification of bacmid DNAFrom the pFBDVPm11 donor plasmid, generate bacmid shuttle vector in DH10Bac cells following the Bac-to-BacTM protocol (Thermo Fisher, publ. MAN0000414).Purify bacmid using Qiagen’s endotoxin-free large construct kit.Transfection of bacmid DNA into Sf9 cells according to the Bac-to-BacTM protocol (see above).Isolation of P1 baculovirus stock according to the Bac-to-BacTM protocol. Modifications to the Bac-to-BacTM procedure include:Quantifying the virus titer by qPCR with the BaculoQUANT All-In-One Extraction & Titration Kit to estimate readiness for virus harvest.Optionally, instead of harvesting when the Sf9 cells are 20-30% viable, harvest when the baculovirus titer is at least 106 viral genomes (vg)/ml.Note: This tends to take about 4-5 days post transfection. Amplification of baculovirus stock (generation of P2 stock)This continues to follow the Bac-to-BacTM, modified as follows:Quantifying the P2 virus titer by qPCR.Note: This tends to take about 3-4 days post infection. Sf9 infection for VLP productionScale up a Sf9 culture to 600-800 ml and a density of 2 x 106-4 x 106 cells/ml, as described in Step A1, above.Infect the culture with the P2 baculovirus stock. Add P2 to a MOI of between 5 and 10.Incubate the culture as before and check cell density and viability daily. When viability starts to decrease (at 40-60 h), check culture more frequently and harvest when the viability is between 80-60% (typically between 55-80 h).Transfer the culture into two 500 ml centrifuge bottles, balance and centrifuge at 5,500 x g for 30 min at 20 °C.Resuspend each pellet in 10 ml of HM buffer and pool into a 50 ml centrifuge tube. Collect any additional cells with a single aliquot of 5 ml of additional HM buffer.Store the ~25 ml of resuspended cell pellet at -80 °C until ready for VLP purification.",
    "AAV-2 VLP purificationAAV-2 VLP purification consists of four steps: (1) lysis of the cell pellet by freeze-thaw cycles, (2) clarification of the VLP product from the remaining soluble components, (3) affinity column purification and (4) desalting by dialysis. First is an initial lysis that extracts VLPs from the cells. The second step relies upon ultracentrifugation of the sample in a cesium chloride gradient to separate the VLP from the other soluble components using differential density centrifugation. Following three rounds of CsCl gradient centrifugation, the sample is 50-70% pure. For greater purity, the sample is run through a heparin affinity column followed by one additional CsCl centrifugation to concentrate the sample. [For serotypes that do not have high affinity for heparin, one can substitute ion exchange for affinity chromatography (Kaludov et al., 2002), or Cs-gradient ultracentrifugation can be performed with higher stringency, further repeating, or accepting only a narrower fraction near the peak of the band (Xie et al., 2004)]. The yield for a VLP preparation is typically 2-4 mg/ml in 100 µl. Lastly, since the sample contains a high concentration of CsCl which would interfere with electron microscopy visualization, the sample is dialyzed using a custom dialysis device (dialysis button) designed for 40-60 µl volumes. Due to the relative stability of the VLP sample in 3.3 M CsCl and the instability in low-salt solution, the last dialysis step is performed on small volumes of purified sample that will be used within 1-2 days. (AAV-2 is more prone to aggregation at low salt than other serotypes, many of which are stable at 4 °C for up to 4 weeks.)Lysis of the Sf9 cells and collection of soluble proteinsThaw the VLP-containing cell suspension in 37 °C water bath for 30 min.",
    "Refreeze the cell suspension at -80 °C for at least 2 h.Repeat Steps B1a and B1b 4 more times (5 cycles of thaw and freeze).Thaw the cell suspension in 37 °C water bath for 20 min, add 0.25 µl benzonase per ml of cell suspension, mix and continue incubating in 37 °C water bath for 20 min.Note: Digestion of the nucleic acids reduces the viscosity. Add 5 M sodium chloride solution to increase sodium chloride in cell suspension by 100 mM (e.g., add 0.6 ml to a 30 ml suspension) and freeze at -80 °C for at least 2 h.Note: Addition of sodium chloride deactivates benzonase. Thaw the suspension a final time in a 37 °C bath and dispense 2-ml aliquots into fifteen 2-ml tubes and spin at 16,000 x g for 10 min.Pool the supernatant from all tubes and filter through a 0.45 µm filter.CsCl gradient purification of AAV-2 VLPAdd CsCl to the pooled supernatant (above) until the refractive index (RI) is 1.3690 (± 0.0005).Note: This will be approximately 0.5 g per ml of sample and brings it to ~3.3 M CsCl. Make an extra 50 ml of HM buffer plus CsCl, to the same RI, for balancing (Recipe 11).Transfer ~5 ml of sample into each of 6 ultracentrifuge tubes and balance each pair to within 0.05 g, using the solution made above (Step C2b) to top off tubes as needed. Fill each tube to within 1 mm of the top to avoid collapse during centrifugation.Centrifuge the samples at 135,000 x g with the SW50.1 rotor (or similar) in an ultracentrifuge at 20 °C for 20-24 h.Gently transport the tubes to your working area to preserve gradient separation. Wipe the outside of each tube with ethanol and visualize the AAV band using a bright halogen lamp (see Figure 2).",
    "As a guide, mark the side of the tube about 2 mm above and below the AAV-2 band (e.g., with a Sharpie pen).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200118/20200118224512_3802.jpgFigure 2. Side-illumination of the centrifuge tube after separation of AAV-2 by CsCl gradient centrifugation. The cloudy white band in the middle is AAV-2 VLP.Use a standard disposable transfer pipette to remove the liquid down to the mark 2 mm above the AAV-2 band and discard this into a 10% bleach solution.Use a fine-tipped disposable transfer pipette to gently collect the sample containing AAV-2 (take 2 mm above to 2 mm below the band), and transfer it to a new ultracentrifuge tube. Collect the AAV-2 band from all six tubes similarly and pool into a single ultracentrifuge tube. Check and record the refractive index (RI).Balance and centrifuge the tube containing the pooled AAV-2 samples as before (Steps C2c-C2e, above) (second spin).Repeat the AAV-2 band collection and ultracentrifugation step one more time (third spin).Collect the sample after the third ultracentrifugation and inject into a Slide-A-Lyzer dialysis cassette with the 1 ml syringe and 18 gauge needle provided, as per product instructions.Float the dialysis cassette in 2 L of phosphate buffered saline (PBS) and stir for 2 h at 4 °C. Replace with 2 L of fresh PBS and allow to dialyze overnight at 4 °C.Transfer the dialyzed sample from the Slide-A-Lyzer cassette to a low protein-binding microcentrifuge tube; store at 4 °C until loading onto heparin affinity column.Heparin affinity column purification of AAV-2 VLPPrepare AKTA system and heparin affinity columnVerify the 2 ml sample loop is connected to the FPLC system.Purge the FPLC system lines A and B with ultra-pure deionized water.Purge the FPLC system lines with heparin affinity buffers: line A with the running buffer A and line B with the elution buffer B (Recipe 6).",
    "With buffer A flowing at 0.5 ml/min connect the Heparin HiTrap column.Equilibrate the column with 20 ml of 100% buffer A at 1 ml/min.Wash the column with 10 ml of 100% buffer B at 1 ml/min.Wash the column with at least 10 ml of 100% buffer A.Once UV and conductivity stabilize, end the flow of buffer A.Run sample on heparin affinity columnSpin the dialyzed sample at 16,000 x g for 10 min to remove aggregates.Set the system to “Load” and flush the loop with 10 ml of PBS using a Luer lock syringe.Set the system to “Inject” and remove the syringe.Load a 1 ml syringe with your VLP sample and connect it to the loop.Set the system back to “Load” and inject your sample into the loop, being careful not to inject air.Set the flow to 1 ml/min and introduce your sample to the column by setting the system to “Inject” and flushing the loop with 3 ml of 100% buffer A.Set back to “Load” and continue to run 100% buffer A at 1 ml/min for 5 min.Run a linear gradient from 0-85% buffer B over 25 min, collecting 0.5 ml fractions.Examine the UV chromatogram and set aside the eluate fractions containing the AAV-2 peak for evaluation by SDS-PAGE.Run a sample from each AAV-2 peak-containing fraction on an SDS-PAGE gel, following standard protocols, to verify the presence of VLP.Pool the AAV-2-containing fractions and run a final CsCl gradient ultracentrifugation as before (see Steps C2c-C2e above). This gradient serves to concentrate the VLPs.Store the collected sample in a low protein-binding microcentrifuge tube.Clean the column by running 10 column volumes of elution buffer B, ultra-pure DI water, and 20% ethanol, sequentially. Store the column in 20% ethanol.",
    "Desalting by dialysisOur protocol continues to use a custom mini-dialysis apparatus that we designed for low volume and high recovery before somewhat similar devices became available commercially. It is likely that the Slide-A-Lyzer MINI dialysis device (see Materials) could be substituted, following the manufacturer’s directions, rejoining the protocol at Step D3i below, “Measure the absorbance…”.We continue the protocol based on the custom device:Prepare the dialysis membrane, according to the manufacturer’s instructions, then:Using a 12 mm circular glass cover side as a template, cut small circles out of dialysis membrane; store at 4 °C in HM buffer plus 0.02% sodium azide until use.Prepare the dialysis buttonAssemble the custom dialysis button according to Figure 1, ensuring a smooth fit of the membrane between the bottom inner chamber and the plastic washer inside the bottom cap.If fully assembled, remove the top cap, cover slip and rubber washerAliquot a sample (30-60 µl) of the purified VLP (from Procedure D) into the inner hole of the inner chamber, taking care to avoid introducing air bubbles onto the surface of the dialysis membrane.Place the glass coverslip, rubber washer, and top cap in the outer chamber and tighten carefully to seal.Use a twist-tie to suspend the dialysis button partially in a 50 ml beaker with the glass coverslip facing up.Add HN buffer so that the lower portion of the dialysis button is submerged while the top is above the surface.Use a Pasteur pipette that has been melted (to form a 180°-hairpin) to remove air bubbles present on the bottom surface of the dialysis membrane in the bottom cap of the dialysis button.Note: The presence of air bubbles will occlude the liquid portion from allowing dialysis of the salts from the sample and may harm protein structure. Dialyze overnight with stirring at 4 °C.",
    "Remove the dialysis button from the beaker and gently dry the area near the dialysis membrane by wicking away with strips of filter paper.Use a 10 µl tip to carefully puncture the dialysis membrane and pipette the sample into a sterile, low protein-binding microcentrifuge tube.Measure the absorbance of the sample at 280 nm and determined the protein concentration using an extinction coefficient of 17.3 (g/100 ml)-1/cm, otherwise known as imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200119/20200119005501_4244.jpg, or E1%).Expression of MBP-PKD1-5 and His6PKD1-2 AAVR constructs in E. coli Subclone desired PKD1-5 fragments from the KIAA0319L cDNA clone (clone ID 3843301; GE Dharmacon; Pillay et al., 2016). PKD1-5 is subcloned into the pMAL-c5X vector as a fusion with MBP whereas PKD1-2 is subcloned into the pET-11a vector with an N-terminal His-tag (Figure 3).Transform pMAL-c5x plasmids (1 pg) into NEB Express cells and pET-11a plasmids (1 pg) into BL21(DE3) cells using standard techniques and plate on LB-ampicillin agar plates (100 µg/ml).Note: Both constructs can be expressed using the procedure delineated below (Steps E3-E5). Transformation efficiencies did not vary significantly from the advertised values of 8 x 108 CFU/µg for NEB Express and 3 x 107 CFU/µg for BL21(DE3). Inoculate a single transformed BL21(DE3) colony from a freshly streaked LB-ampicillin agar plate into a volume of LB-ampicillin (100 µg/ml) media that is 5% of the final total desired culture volume (e.g., 50 ml overnight culture into 1,000 ml final volume). Grow the starter culture overnight at 37 °C with shaking at 210 rpm.The next day, transfer the starter culture into the final media volume and incubate at 37 °C with shaking at 210 rpm until the OD600 is ~1.0. Remove a 1 ml aliquot (pre-induction sample) and place into a 1.5 ml tube.",
    "Spin this aliquot for 1 min at 6,000 x g and discard the supernatant into a 10% bleach solution. Store the bacterial pellet at -20 °C for post-expression analysis by SDS-PAGE, if desired.Add IPTG to a concentration of 1 mM and incubate the culture at 37 °C with shaking at 210 rpm for an additional 4-5 h. After incubation, remove a 1 ml aliquot (post-induction sample) and pellet these cells as described in Step E4 for the pre-induction sample. Store this pellet also at -20 °C for post-expression analysis. Centrifuge the remaining culture at 6,000 x g, discard the supernatant into a 10% bleach solution, and store the pellets at -20 °C until lysis and purification steps.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200118/20200118224609_3569.jpgFigure 3. Subcloning of MBP-PKD1-5 and His6PKD1-2. A. Use the KIAA0319L cDNA clone as a template for PCR amplification using primers 1 and 2. Cut the PCR product with SbfI then phosphorylate using T4 Polynucleotide Kinase. Cut pMAL-c5x with XmnI and SbfI. Ligate the cut/phosphorylated PCR product and the cut pMAL-c5x vector together to make MBP-PKD1-5. B. Use the same DNA as a template for PCR using primers 3 and 4. Cut the PCR fragment with NheI and BamHI. Cut pET-11a with NheI and BamHI. Ligate the cut PCR product and the cut pET-11a vector together to make His6PKD1-2.Purification of AAVR constructsMBP-PKD1-5 purificationCell lysis (do on ice)Resuspend frozen pellets in 25 ml of MBPTrap running buffer containing 100 µl HALT Protease Inhibitor Cocktail 100x.Load cell slurry into a French press cell and pass through two complete rounds of lysis at 1,000 psi using a slow flow rate to collect the lysate into a 50 ml centrifuge tube.Centrifuge lysate at 4 °C, 16,000 x g, for 45 min in a F13-14x50cy rotor (or similar). While spinning, prepare the AKTA system.",
    "MBP affinity chromatography on the AKTA systemWashing and equilibrating the MBPTrap column1)Prior to attaching the column, place line A of the AKTA into MBPTrap running buffer and line B into MBPTrap elution buffer.2)Inject 10 ml of MBPTrap running buffer into the superloop (valve setting = Load).3)Start flow at 5 ml/min and 50%B, bypassing superloop (valve setting = Load). Run for about 5 min.4)Switch to buffer A (0%B), and run for 5 more min.5)Reduce flow to 2 ml/min and flow through superloop (valve setting = Inject) for 10 min or until the superloop is purged completely.6)Reduce flow to 1 ml/min, switch valve back to “Load”, and attach the MBPTrap HP column, avoiding introduction of air.7)Equilibrate the column with 5 column volumes of elution buffer B at 1 ml/min and until UV and conductivity baselines stabilize.8)Switch to running buffer A and wash until the baseline stabilizes, at least 10 column volumes.Loading sample onto MBPTrap column1)Remove the tube containing cell lysate from the centrifuge and transfer the supernatant to a new 50 ml centrifuge tube.2)Filter through a 0.45 µm filter using a 10 ml Luer lock syringe. It may take multiple filters if membranes become fouled.3)With the valve setting set to “Load”, inject 10 ml of lysate into the superloop.4)Set flow rate to 0.5 ml/min, fraction size to 10 ml, and the valve to “Inject”.5)Flow through the superloop into the column until the superloop is almost empty.6)At this point, pause the FPLC, switch the valve to “Load”, inject another 10 ml into superloop, switch back to “Inject”, and resume flow. Repeat this process until entire lysate volume is loaded onto the column (with a high capacity superloop, the entire sample could be loaded in a single step).",
    "Elution of MBP-PKD1-51)After loading, wash the column by switching the valve to “Load” and increasing the flow of running buffer to 1 ml/min.2)Once baseline is stabilized–at least 10 column volumes–reduce the flow to 0.5 ml/min and the fraction size to 2 ml.3)Flow 100% elution buffer B for 45 min to elute MBP-PKD-1-5. Processing MBPTrap column fractions1)Run peak fractions (Figure 4) on SDS-PAGE to verify the presence of MBP-PKD-1-5 and pool the appropriate fractions.2)Concentrate the pooled sample to ~1 ml using a 30 kDa Amicon Ultra centrifugal filter unit. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200118/20200118224644_6701.jpgFigure 4. Elution of MBP-PKD1-5 from MBPTrap HP column. The flow was switched from 100% A to 100% elution buffer B at elution volume 0. Superdex 200 SEC on the AKTA systemNote: MBP-PKD1-5 oligomerizes slowly (over a ~30 day period at 4 °C) (Meyer et al., 2019). This SEC step allows dimers to be selected over higher order oligomers shortly before use, and must be repeated, if this separation is desired, after the sample has been stored at 4 °C for an extended time. Washing and equilibrating the Superdex 2001)Prior to attaching the column, place line A of the AKTA into HN buffer and flush line A by running 0%B at 5 ml/min for 5 min.2)Inject 10 ml of HN buffer into superloop (ensure valve setting = Load).3)Set flow to 2 ml/min and flow through superloop (valve setting = Inject) for 10 min or until the superloop is purged completely.4)Reduce the flow rate to 1 ml/min and attach a pre-calibrated Superdex 200 size exclusion column, avoiding introduction of air. To equilibrate, flow HN buffer through the column at 1-1.5 ml/min until the baseline stabilizes.",
    "Loading sample onto the Superdex 2001)Pause the AKTA and inject into the superloop a sample volume that is no more than 1% of the column volume (valve setting = Load).2)Set flow rate to 1 ml/min and resume flow (valve setting = Inject).3)Collect the fractions (Figure 6) that correspond to the molecular weight of the MBP-PKD1-5 dimer (190 kDa) based on your gel filtration d calibration results and Meyer et al., 2019. Figure 5 provides an example of what a standard calibration may look like. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200118/20200118224714_5489.jpgFigure 5. Calibration of Superdex 200 using the BioRad Gel Filtration Standards. The blue line tracks elution of standards (left to right): bovine thyroglobulin (670 kDa), bovine γ-globulin (158 kDa), chicken ovalbumin (44 kDa), horse myoglobin (17 kDa) and vitamin B12 (1.35 kDa). Chromatography of the standards should be performed under the same conditions (flow rates, etc.) as will be used for sample (see Step F1c and Figure 7). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200118/20200118224743_9418.jpgFigure 6. MBP-PKD1-5 elution from Superdex 200 SEC. Comparison of the elution times with Figure 5 indicates that the larger left peak corresponds to higher order oligomers of > 380 kDa. The smaller right peak, corresponding to dimers of MBP-PKD1-5 (190 kDa), is collected. Purification of His6PKD1-2Cell lysis (do on ice)Resuspend frozen pellets in 25 ml of IMAC running buffer containing 100 µl HALT Protease Inhibitor Cocktail 100x.Load the cell slurry into a French press cell and pass through 2 complete rounds of lysis at 1,000 psi using a flow rate slow enough to avoid foaming, collecting the lysate into a 50 ml centrifuge tube.Centrifuge lysate at 4 °C, 16,000 x g, for 45 min in a F13-14x50cy rotor (or similar). While spinning, prepare the AKTA system.",
    "IMAC affinity chromatography on the AKTA systemWashing and equilibrating the IMAC column1)Place line A of the AKTA in the IMAC running buffer and line B in the IMAC elution buffer. The column should not be attached to the AKTA at this point unless the valve is set in the bypass mode.2)Inject 10 ml of IMAC running buffer into the superloop (ensure valve setting = Load).3)Start the flow at 5 ml/min and 50%B, bypassing the superloop (valve setting = Load). Run for about 5 min.4)Switch the buffer to A (i.e., 0%B), and run for an additional 5 min.5)Reduce the flow to 2 ml/min and flow through the superloop (valve setting = Inject) for 10 min or until the superloop is purged completely.6)Reduce the flow to 1 ml/min, switch valve back to “Load”, and attach the HiTrap HP (IMAC) column, avoiding introduction of air.7)Equilibrate the column by flowing elution buffer for 5 column volumes at 1 ml/min and until UV and conductivity baselines stabilize.8)Switch to running buffer and flow until the baseline stabilizes, at least 10 column volumes.Loading sample onto the IMAC column1)Remove the tube containing the cell lysate from the centrifuge and transfer the supernatant to a new 50 ml centrifuge tube.2)Filter through 0.45 µm filter. It may take multiple filters if membranes become fouled.3)With the FPLC valve setting set to load, inject 10 ml of lysate into the superloop.4)Set the flow rate to 0.5 ml/min, fraction size to 10 ml, and valve to inject.5)Flow through the superloop into the column until the superloop is almost empty.6)At this point, pause the FPLC, switch the valve to load, inject another 10 ml into the superloop, switch the valve to inject, and continue running the FPLC. Repeat this process until the entire lysate is loaded onto column.",
    "Elution of His6PKD1-21)Wash the column by switching the injection valve to “Load” and increasing the flow to 1 ml/min.2)Once the baseline stabilizes–at least 10 column volumes–reduce the flow rate to 0.5 ml/min and the fraction size to 2 ml.3)Run a linear gradient from 0%-100% elution buffer over 45 min.Processing IMAC column fractions1)Run the peak fractions (Figure 7) on SDS-PAGE and pool the appropriate fractions.2)Concentrate pooled sample to ~1 ml using a 3 kDa MWCO Amicon Ultra centrifugal filter unit. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200118/20200118224819_8482.jpgFigure 7. Elution of His6PKD1-2 from the IMAC column. The blue line shows the elution of the His-tagged protein peaking in the first 3 ml over a large background. Background, coming from absorption of the imidazole in buffer B (orange line), is approximately removed in the gray line through subtraction of a value proportional to %B. Superdex 75 SEC on the AKTA systemNote: As with MBP-PKD1-5, His6PKD-1-2 oligomerizes slowly at 4 °C (Meyer et al., 2019). This SEC step allows dimers to be selected over higher order oligomers shortly before use, and must be repeated, if this separation is desired, after the sample has been stored at 4 °C for an extended time. Washing and equilibrating the Superdex 75Wash and equilibrate the Superdex 75 column with HN buffer exactly as described for the Superdex 200 (Step F1c, above).Loading sample onto the Superdex 751)After equilibration, pause the AKTA and, as with the Superdex 200, inject a sample volume that is no more than 1% of the column volume (set valve to “Load”).2)Set flow rate to 1 ml/min and resume flow (valve setting = Inject).3)Collect the fractions that correspond to the molecular weight of the His6PKD1-2 dimer (44 kDa) based on your gel filtration standard calibration results and Meyer et al., 2019.",
    "Note: Loading and elution procedures, including flow rates, for the Superdex 75 SEC are the same as for the Superdex 200 SEC (Step F1c), but samples have different retention times. The expected retention time of the His6PKD-1-2 dimer can be estimated by gel filtration standard calibration results (see Figure 8 for an example) and Meyer et al., 2019.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200118/20200118224857_5632.jpgFigure 8. Calibration of Superdex 75 using the BioRad Gel Filtration Standards. The blue line tracks elution of standards (left to right): (a) the first major peak has a shoulder indicative that it is unresolved bovine thyroglobulin (670 kDa) and bovine γ-globulin (158 kDa); (b) chicken ovalbumin (44 kDa), (c) horse myoglobin (17 kDa); and (d) vitamin B12 (1.35 kDa). Chromatography of the standards should be performed under the same conditions (flow rates, etc.) as will be used for sample (see Step F2ci and Figure 9). Monomers of His6PKD1-2 (22 kDa) would be expected at about 70 ml and dimers at about 60 ml, the same elution time as ovalbumin.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200118/20200118224924_5429.jpgFigure 9. His6PKD1-2 elution from Superdex 75 SEC. Comparison of the elution times with Figure 8 indicates that the larger left composite peak corresponds to higher order oligomers exceeding > 75 kDa and approximately 670 kDa. The largest peak, corresponding to dimers of His6PKD1-2, is used, and there is only the faintest hint of something approximating a monomer eluting later."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}