{
  "id": 2340,
  "origin_website": "Cell",
  "title": "Chromosomal integration of complex DNA constructs using CRAGE and CRAGE-Duet systems",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIntegrating CRAGE and CRAGE-Duet LPs\nTiming: 5–10 days (user-dependent)\nThis section describes step-by-step methods for conjugal transformation of pW17 and pW37, as well as integration of the CRAGE and CRAGE-Duet LPs into the genomes of recipient bacteria. The step numbers correspond to those of the Graphical Abstract and Figure 1[href=https://www.wicell.org#fig1].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1830-Fig1.jpg\nFigure 1. Schematic diagram of the CRAGE and CRAGE-Duet systems\n(A) The CRAGE system. A landing pad (LP) transposon (containing Cre and KmR, flanked by loxP and lox5171) on a pW17 plasmid is integrated into the genomes of recipient strains (steps 1–4). The payloads are then integrated into the LP site via Cre-mediated cassette exchange (step 5).\n(B) The CRAGE-Duet system. An LP transposon (containing Cre flanked by lox2272 and loxP and KmR flanked by loxP and lox5171) on a pW37 plasmid is integrated into the genomes of recipient strains (steps 1–4). The payloads are subsequently integrated into the first and second sites of the LP via Cre-mediated cassette exchange (steps 6–8).\nPreparation of donor and recipient strains.\nCulture donor strain BW29427 harboring pW17 or pW37 LP plasmid in LB medium supplemented with 0.3 mM diaminopimelic acid (DAP) and 50 μg/mL Km at 37°C in an incubation shaker at 200 rpm overnight.\nCulture the recipient bacteria using their optimal growth conditions.\nNote: With improper handling, bacteria can contaminate media, and cross-contamination can occur between cultures. Use proper sterilization techniques. If working in a laminar flow hood, make sure not to block airflow inside it. Use filter tips and change them often.\nAlways include a blank control culture with the media being used. Follow necessary practices to prevent contamination.\nConjugal transformation of the LP plasmid.",
    "Measure optical density at 600 nm (OD600) for the donor and recipient cultures and mix with a 4:1 donor to recipient ratio in a 2 mL tube (see notes below). Centrifuge this mixture (18,000 × g, 1 min) and wash three times with 1 mL LB to remove residual antibiotics from the culture.\nNote: For landing pad integration, we typically mix 400 μL to 1 mL of OD=2 donor strain with 100–250 μL of OD=2 recipient strains. Users can increase conjugation efficiency by changing the donor to recipient ratio in either direction. Some recipient strains can be conjugated in less than 6 h, while other strains may take more than 24 h. For strains with lower conjugation efficiency, consider increasing donor and/or recipient strains by 2- to 5-fold as well as increasing conjugation incubation time.\nResuspend the resulting pellet in 50 μL LB with 0.3 mM DAP media and transfer onto a nitrocellulose filter membrane on top of an LB agar plate containing 0.3 mM DAP (Figure 2[href=https://www.wicell.org#fig2]A). Incubate this plate at 28°C (or at an optimal temperature for the target strain) for 12–24 h (Figure 2[href=https://www.wicell.org#fig2]B).\nNote: Use strain-specific temperatures for conjugation. We used 28°C because it was the optimal temperature for many bacteria with which we worked.\nResearchers can use LB with 0.3 mM DAP instead of LB throughout steps 2a–2c to simplify the procedure.\nInclude a blank control to confirm that the procedure is contamination-free. To do this, pipette 25 μL LB and/or LB with DAP that was used for wash and resuspension steps (steps 2a–2c) onto an empty LB with DAP agar plate and incubate with other experimental samples.\nAlthough multiple conjugations can be done on the same plate, we strongly recommend using separate or multi-well plates to prevent contamination (Figure 2[href=https://www.wicell.org#fig2]C).",
    "Scrape off the bacterial mixture grown on the membrane using an inoculation loop and resuspend it into 500 μL LB media. Then centrifuge it (18,000 × g, 1 min), wash it with 1 mL LB three times, and resuspend it in 1 mL LB. Plate 100 μL of the mixture on an LB plate containing the appropriate concentration of Km.\nNote: Single colonies can also be streaked out simply on the selection plate using an inoculation loop.\nDepending on the conjugation efficiency, users might consider plating the mixture with 10-1, 10-2, or 10-4-fold dilution onto selection plates.\nAlthough freezing will compromise conjugation efficiency, users can freeze the conjugation mixture and store it by adding glycerol to a final concentration of 15%.\nIncubate the plate at an optimal temperature for the growth of the recipient bacteria until single colonies appear (Figure 2[href=https://www.wicell.org#fig2]D, 1–3 days, strain-dependent); then restreak single colonies on selection media.\nScreening and verifying LP integration.\nInoculate single colonies onto 96-well plates containing 150 μL of LB media with 7.5% glycerol and an appropriate concentration of Km, determined using the MIC test for the recipient strain.\nUse 0.5 μL of each overnight culture in a 20 μL PCR reaction to determine whether the LP has integrated into the genome or has remained as a plasmid (Figure 3[href=https://www.wicell.org#fig3]).\nFor the CRAGE system, primers SBP572 (CCACCTTCGTAAGACTGTAGTG) and 99W (TCCCAGATCTCAAACTGGAACAACACTC) amplify a 374 bp LP region, and primers SBP202 (GAAAAGCTGGGCGCGTTAAGCCAGCCCCGACACCCG) and SBP203 (GGGGCTGGCTTAACGCGCCCAGCTTTTCAATTC) amplify a 645 bp plasmid backbone region.\nFor the CRAGE-Duet system, primers 197_DT (GCTATCAGGACATAGCGTTGGCTACC) and 190_DT (GTAATGCTCTGCCAGTGTCGCG) amplify a 423 bp LP region, and primers 197_DT (GCTATCAGGACATAGCGTTGGCTACC) and 44W (CGCTGCATAACCCTGCTTCGG) amplify a 859 bp backbone region. If the LPs are integrated into the genome of the recipient bacteria, only the LP region is amplified.\ntable:files/protocols_protocol_1830_8.csv\ntable:files/protocols_protocol_1830_9.csv",
    "To identify the integration location of the LP, isolate genomic DNA from 2 mL overnight culture using QIAGEN blood and tissue kit followed by Illumina or PacBio sequencing, with 10–500 ng or 2–5 μg input DNA, respectively. Users can map the raw reads to the LP using Geneious Prime or Integrative Genomics Viewer (IGV). This allows the user to identify the reads that map both 3′- and 5′-ends of the LP as well as the LP integration site. Users can then map the flanking sequences that correspond to the genome to identify the integration location. Alternatively, users can use inverse PCR (Ochman et al., 1988[href=https://www.wicell.org#bib6]) at the junctions of LP and genomic DNA combined with Sanger sequencing to determine the LP integration site (Liu et al., 2020[href=https://www.wicell.org#bib4]).\nNote: Typically, we pick 8–16 colonies from each conjugal transformation plate.\nSome of the conjugation steps (e.g., mixing and washing) are contamination prone; therefore, we recommend using 16S rRNA sequencing to ensure the integrity of the strains.\nThe amount of input DNA for sequencing may vary depending on the requirement of each sequencing facility. Follow the guidelines from each facility.\nTesting the growth phenotype to evaluate the impact of the LP integration.\nCulture the LP-integrated strains and their corresponding wild-type strain in 1 mL LB with appropriate antibiotics at the strain-specific optimal growth temperature to reach an OD600 of 2–6.\nCentrifuge cells (18,000 × g, 1 min), wash them with M9 minimal media three times and resuspend them into a fresh medium. Dilute this culture to an OD600 of 0.1.\nAdd 150 μL of cultures to each well of a 96-well black/clear flat-bottom plate (Corning). Perform the growth assay in triplicate for each strain.",
    "Use a Synergy H1 microplate reader (BioTek) to measure the growth of the LP strains at intervals of 15 min for 20–48 h at a strain-specific optimal growth temperature with constant shaking (Figure 4[href=https://www.wicell.org#fig4]).\nSelect the LP strains with growth phenotypes more similar to those of the wild-type strain for subsequent study. Information about the LP insertion location identified in the previous section also supports the selection of the target strain.\nNote: In our experience, almost all strains grow well. However, we sometimes see obvious growth differences between WT and LP strains. Strains whose growth is not compromised will be carried over to the downstream experiment.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1830-Fig2.jpg\nFigure 2. Conjugation on LB/DAP agar plates\n(A) A conjugation mixture was spotted on nitrocellulose filter membranes placed on top of LB/DAP agar plates. LB/DAP medium was used as a negative control to ensure that no contamination occurred during the conjugation procedure.\n(B) Conjugation plates after 24 h incubation.\n(C) Multi-well plates were used to increase conjugation throughput.\n(D) Single colonies from the conjugation mixture appeared on the LB plate containing Km. Different dilutions were plated.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1830-Fig3.jpg\nFigure 3. CRAGE landing pad integration screening\n(A and B) Agarose gel electrophoresis (1% agarose) of PCR products using (A) the CRAGE LP or (B) backbone-specific PCR primer sets. Lanes 1–8 were from LP integrants. Lane 9 was from pW17 conjugation plasmid DNA used as a template. Lane M is an NEB 2-log ladder.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1830-Fig4.jpg\nFigure 4. Growth curve comparison between wild-type and CRAGE LP-integrated strains\nOne wild-type (WT) Serratia odorifera and its seven CRAGE variants were incubated in a Synergy H1 microplate reader with shaking for 20 h at 28°C. The optical density (OD) was measured at intervals of 15 min. No obvious differences were seen between the CRAGE LP strain and its WT.",
    "Integrating the payload into the LPs\nTiming: 5–10 days (user-dependent)\nIntegrating a lux operon to confirm LP function.\nConjugally transform pW34 containing the luxCDABE operon into the LP strain. Because of the high conjugation and integration efficiency, we recommend streaking out a single colony directly from the conjugation mixture (Figure 5[href=https://www.wicell.org#fig5]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1830-Fig5.jpg\nFigure 5. Integration of the luxCDABE operon and luminescence assay of the integrated strains\n(A) The second-step conjugation mixture was directly streaked out on the selection media.\n(B) 1 μL of each of the overnight cultures was spotted on both Apr and Km plates at appropriate concentrations. Strains gained Apr resistance and lost Km, indicating successful cassette exchange of the Km resistance gene with the Apr resistance gene and the luxCDABE operon.\n(C and D) The Pseudomonas simiae strain with the LuxCDABE operon integrated (C) and its corresponding LP strain (D) were induced under different amounts of IPTG and incubated in the Synergy H1 microplate reader with shaking for 10 h at 28°C. Bioluminescence was measured at intervals of 15 min. Error bars from three different biological replicates are shown for the LuxCDABE-operon-integrated strain (C). No obvious bioluminescence was detected in the LP-only strain (single replicate). Bioluminescence increases at a higher rate with increased IPTG.\nScreen 8 to 10 single colonies from each conjugation for their resistance to Apr and sensitivity to Km through counterselection (Figure 5[href=https://www.wicell.org#fig5]B).\nInoculate the positive integrants of the luxCDABE operon in 1 mL of LB medium with appropriate antibiotics and grow them at optimal temperature overnight.\nDilute these cultures to an OD600 of 0.1 with fresh LB medium containing appropriate antibiotics.",
    "Transfer 4 × 150 μL aliquots of each culture to a 96-well plate with a clear bottom. Add IPTG to these cultures at final concentrations of 0, 0.01, 0.1, and 1.0 mM. Incubate the cultures in the Synergy H1 microplate reader at the optimal growth temperature for 24 h. Measure the OD and bioluminescence at intervals of 15 min (Figures 5[href=https://www.wicell.org#fig5]C and 5D).\nNote: Once successful integration of the luxCDABE operon and luminescence activity is confirmed, the LP strain is ready for the downstream payloads integration steps.\nSingle constructs or libraries of constructs can be transformed and directly integrated into the set of both CRAGE and CRAGE-Duet LP strains. Multi-well plates can help improve throughput.\nBecause the transposon is randomly integrated into the genomes, the LP may be accidentally integrated into a location essential to the growth of the recipient strains. In our experience, an optimal LP strain, in which the LP is inserted in the non-polycistronic intergenic region, is usually found if 10 transconjugants are selected at step 2. In addition to identifying the LP integration location and evaluating the growth phenotype, we recommend that users perform assays for other phenotypes that are important in downstream scientific applications.\nIntegrating the second payload into the LPs (CRAGE-Duet only)\nTiming: 5–10 days (user-dependent)\nIntegrating the inducible or constitutive promoter.\nFor the CRAGE-Duet system, the second payloads are delivered to the second integration site. As a proof-of-principle experiment, use donor strains with T7RP under IPTG-inducible promoter pW38 and/or constitutive promoter pW39 for the conjugation at the second integration site (lox2272 and loxP). Select strains in which T7RP has been integrated by their resistance to both Km and Apr (indicating successful cassette exchange), followed by a luminescence assay (refer to step 5 for details).\nImplementing the CRAGE-CRISPR system\nTiming: 5–10 days (user–dependent)",
    "Users can use 3-lox LP strains created from steps 2 and 3 (described above) for all the downstream conjugation and verification steps.\nOnce the LP for the CRAGE-Duet system is successfully integrated into the genome, implement the CRAGE-CRISPR system in these strains. Use the plasmids pR6K-2L-SpCas9 and pR6K-2L-dCas9-RNAPω to implement CRISPRi and CRISPRa, respectively. These plasmids are targeted to the first integration site between loxP and lox5171. Follow the step 5 protocol to integrate the payloads on these plasmids into the LP site.\nUse pR6K-lox2272WT as a base plasmid to integrate sgRNA constructs for the CRISPR systems. Modify these plasmids to target sequences of interest. Follow the step 6 protocol to integrate the payloads into the second integration site of the CRAGE-Duet LP.\nOnce the LP is integrated into the genome, integrating payloads using the Cre-mediated cassette exchange is generally more efficient than mariner-transposase-mediated transposon integration. Although we generally use a 1 mL culture of recipient strain, 100 μL is often sufficient for conjugal integration of payloads into the recipient LP strain. If the efficiency of the conjugal recipient strain is very high, users can shorten the conjugation incubation time to optimize the protocol."
  ],
  "subjectAreas": [
    "Genetics",
    "Microbiology",
    "Crispr"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}