{
  "id": 15224,
  "origin_website": "Jove",
  "title": "Reverse Transcription-Loop-mediated Isothermal Amplification (RT-LAMP) Assay for Zika Virus and Housekeeping Genes in Urine, Serum, and Mosquito Samples",
  "procedures": [
    "All methods described here have been approved by the Institutional Review Board (IRB) of Beaumont Health. All experiments were performed in accordance with relevant guidelines and regulations.\nCAUTION: All potentially infectious materials should be handled according to Biosafety Level 2 standards including the use of personal protective equipment. Any procedures which may produce aerosol should be performed in a biosafety cabinet. Additionally, work with live mosquitoes should be performed in the appropriate Arthropod Containment Level 1-3 facility. Given the association of ZIKV infection with congenital abnormalities, women who are pregnant, trying to conceive, or the partners of these women should significantly minimize their laboratory exposure to ZIKV. Transport of ZIKV samples is classified in the United States as Category B Biological Substances in accordance with Department of Transportation Hazardous Materials Regulations (49 CFR Part 171-180) and therefore shipping samples should adhere to those guidelines. Import into the United States of ZIKV biospecimens requires a Centers for Disease Control and Prevention (CDC) Import Permit. Import of any arthropods that could serve as a vector for ZIKV transmission, even if they are not infected, requires a United States Department of Agriculture (USDA) permit. This information is current at the time of publication. Up-to-date recommendations can be found at https://www.cdc.gov/zika/laboratories/lab-safety.html.\nNOTE: RT-LAMP reactions are prone to higher rates of false positive reactions, so precautions should be taken in experimental planning. All set-up and execution of RT-LAMP reactions should use designated pipettes and filter tips. Ideally, a lateral work flow should be established. If possible, analysis and imaging (Section 5) should occur in a separate enclosed room to prevent contamination. Opening of test tubes containing RT-LAMP products should be kept to a minimum.\n1. RT-LAMP Primer Preparation",
    "Reconstitute each lyophilized RT-LAMP primer in molecular grade water to a final concentration of 100 µM (Table 1). Briefly vortex the primer solution to ensure a homogenous solution and briefly spin down the solution at maximum speed in a table top centrifuge to collect all primer solution.\nPrepare a 10x RT-LAMP Primer Mix of the FIP, BIP, F3, B3, LF, and LB primers using the volumes in Table 2. Briefly vortex the primer solution to ensure a homogenous solution, and briefly spin down the solution at maximum speed in a table top centrifuge to avoid any loss.\n\tNOTE: The RT-LAMP primer set for Ae. aegypti actin (AEDAE) does not contain a LB primer (loop primers are not always necessary for RT-LAMP reactions). In this case, replace the LB primer volume with molecular grade water.\nStore the primers at -20 °C between uses and avoid free-thaw cycles.\n2. Sample Preparation\nFor human urine samples: Use either fresh urine, frozen urine, or urine in preservative. For fresh or frozen sample: immediately spin down the sample after the collection for 10 min at 700 x g, and use the supernatant for analysis or freeze at -80 °C for future use. Thaw frozen samples on ice before use.\nFor human serum samples: Use either fresh or frozen serum samples.\nFor ZIKV infected cell lines: Use either conditioned media or cell lysates.\n\tNOTE: Cell-free conditioned media from Ae. albopictus C6/36 cells 8 days post-infection can be used as positive controls for ZIKV RT-LAMP reactions.",
    "For Ae. aegypti mosquitoes: Use either whole fresh or frozen mosquito carcasses. Thaw frozen mosquitoes on ice. Prepare a crude mosquito lysate by placing an individual mosquito in 100 µL of phosphate-buffered saline (PBS) and homogenize by crushing the mosquito 10 times with a P10 pipet tip (Figure 1). Briefly centrifuge the crude lysate to pellet any debris. Use the supernatant for downstream RT-LAMP analysis.\n\tNote: Positive controls can be generated in a laboratory setting by infecting female mosquitoes using intrathoracic microinjection with approximately 103 genome equivalents of virus in a volume of 200 nL and harvesting the mosquito 5 days post-infection.\n3. Prepare RT-LAMP Master Mix\nPrepare a RT-LAMP master mix reaction on ice for each primer set to be used by using volume guide in Table 3.\n\tNOTE: The use of thermolabile Uracil DNA Glycosylase (UDG) assists in preventing false positives.\nVortex briefly to ensure that all samples are well mixed, then spin down briefly to prevent volume loss.\n4. RT-LAMP Assay\nPipet 23.0 µL of the RT-LAMP master mix per reaction into a 200 µL PCR tube. Add 2.0 µL of sample (urine, serum, or crude mosquito lysate supernatant as described in Step 2). This will bring the total volume to 25.0 µL per RT-LAMP reaction. For the negative control, use molecular grade water. Include a positive control.\n\t​NOTE: A PCR standard or virus stocks from supernatant of infected cell lines can be used as a positive control.\n\t\nOptional: Include a specificity control reaction of a related arbovirus such as dengue virus (DENV). Prepare the sample as outlined in Step 2 according to sample type. Add 2.0 µL of the specificity control to 23.0 µL of the RT-LAMP master mix into a 200 µL PCR tube.",
    "Heat the samples at 61 °C for 30 min using a heat block, water bath, or thermocycler.\nHeat deactivate the polymerase by heating to 80 °C for 10 min.\n5. RT-LAMP Analysis\nNOTE: Perform RT-LAMP analysis in a separate, enclosed space.\nAfter the incubation, access RT-LAMP reactions visually by looking for the presence of a color change.\nDilute the fluorescent nucleic acid dye 1:10 in TAE (40 mM Tris, 20 mM acetic acid, 1 mM EDTA) buffer.\n\t\tCAUTION: Any nucleic acid stain binds to nucleic acids and therefore is a carcinogen. Wear gloves when handling.\nTo 12 µL of the RT-LAMP reaction, add 2 µL of fluorescent nucleic acid dye dilution.\n\t\tNOTE: Negative reactions will be orange in color and positive reactions will be yellow/green in color.\nOptional: Take pictures of RT-LAMP reactions on a white background using a camera.\nPlace the samples under 302 nm UV light to confirm the presence of RT-LAMP products by fluorescence. Take picture of the result using a camera.\n\tNOTE: Positive RT-LAMP reactions will have a fluorescent output.\n\tCAUTION: Wear UV protective eye googles or face shield when working with UV light.\nOptional: Confirm the presence of RT-LAMP products by performing gel electrophoresis on the samples.\nPour a 2% agarose gel in 1x TAE buffer with a nucleic acid stain for visualization.\n\t\tCAUTION: Any nucleic acid stain binds to nucleic acids and therefore is a carcinogen. Wear gloves when handling.\nAdd 5 µL of a DNA ladder in the first lane to compare the molecular weights.\nFor each RT-LAMP reaction, mix 13 µL of RT-LAMP reaction mixture with 2 µL of DNA loading dye. Load the 15 µL mixture containing the DNA loading dye.",
    "Run the gel at 90 V for 90 min or until the bands are separated and image with 302 nm UV light.\n\t\tNOTE: Positive RT-LAMP reactions will have a laddering pattern. Negative RT-LAMP reactions should not contain any bands.\n6. Disposal\nDispose of RT-LAMP reactions in double sealed bags. Do not autoclave as this may aerosolize the RT-LAMP products, leading to false positive reactions in the future.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}