{
  "id": 10175,
  "origin_website": "Jove",
  "title": "DNA-Tethered RNA Polymerase for Programmable In vitro Transcription and Molecular Computation",
  "procedures": [
    "1. Buffer preparation\nNOTE: Protein purification buffer preparation can occur on any day; here, it was done prior to beginning the experiments.\nPrepare lysis/equilibration buffer containing 50 mM tris(hydroxymethyl)aminomethane (Tris), 300 mM sodium chloride (NaCl), 5% glycerol, and 5 mM β-mercaptoethanol (BME), pH 8. Add 1.5 mL of 1M Tris, 1.8 mL of 5M NaCl, 1.5 mL of glycerol, 25.2 mL of deionized water (ddH2O) into a 50 mL centrifuge tube, and add 10.5 µL of 14.2 M BME just prior to use.\n\tNOTE: Tris can cause acute toxicity; hence, avoid breathing its dust, and avoid skin and eye contact. BME is toxic and should only be used in a fume hood. It is important to add BME last, just prior to resuspension and cell lysis. See Table 1 for lysis buffer formula.\nPrepare wash buffer (pH 8) containing 50 mM Tris, 800 mM NaCl, 5% glycerol, 5 mM BME, and 20 mM imidazole. Add 1.5 mL of 1 M Tris, 4.8 mL of 5 M NaCl, 1.5 mL of glycerol, and 22.2 mL of ddH2O into a 50 mL centrifuge tube. Just prior to use, add 7 µL of 14.2 M BME and 200 µL of 2 M imidazole to 20 mL of the above solution.\n\tNOTE: To prevent acute toxicity due to imidazole, use personal protective equipment. It is important to add BME and imidazole last, just prior to washing the protein out of the column. See Table 2 for wash buffer formula.",
    "Prepare elution buffer (pH8) containing 50 mM Tris, 800 mM NaCl, 5% glycerol, 5 mM BME, and 200 mM imidazole. Add 0.5 mL of 1 M Tris, 1.6 mL of 5 M NaCl, 0.5 mL of glycerol, and 6.4 mL of ddH2O to a 15 mL centrifuge tube. Just prior to use, add 3.5 µL of 14.2 M BME and 1 mL of 2 M imidazole to 10 mL of the above solution.\n\tNOTE: It is important to add BME and imidazole last, just prior to eluting the protein out of the column. See Table 3 for elution buffer formula.\nPrepare 2x storage buffer (to be mixed 1:1 with glycerol) containing 100 mM Tris, 200 mM NaCl, 40 mM BME, and 2 mM ethylenediaminetetraacetic acid (EDTA), 0.2% of a non-ionic surfactant (see the Table of Materials). Prepare 50 mL of the storage buffer by adding 5 mL of 1 M Tris, 2 mL of 5 M NaCl, 42.56 mL of ddH2O, 200 µL of 0.5 M EDTA, 100 µL of the non-ionic surfactant to a 50 mL centrifuge tube. Mix until the solution is homogeneous, filter the storage buffer through a 0.2 µm syringe filter, and add 140.8 µL of BME to the above solution prior to use.\n\tNOTE: To avoid acute toxicity due to EDTA, avoid breathing its dust, and avoid skin and eye contact. It is important to add BME last and mix the entire storage buffer 1:1 with glycerol, just prior to storing the purified protein. See Table 4 for storage buffer formula.\n2. Overnight culture growth: Day 1\nPrepare 1,000x kanamycin stock by dissolving 500 mg of kanamycin in 10 mL of ddH2O.\n\tNOTE: Use personal protective equipment to prevent acute toxicity due to kanamycin.",
    "Add 20 µL of the 1,000x kanamycin stock to 20 mL of lysogeny broth. Using a sterile pipette tip, poke a transformed BL21 E. coli glycerol stock and then inoculate the culture by introducing the tip into the growth media broth.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62073/62073fig04.jpg\nFigure 4: Plasmid map for SNAP T7 RNAP. The plasmid encodes a T7 RNAP containing an N-terminal histidine tag (6x His) and SNAP-tag domain (SNAP T7 RNAP) under a lac repressor (lacI) on a pQE-80L backbone. Other features include kanamycin resistance (KanR) and chloramphenicol resistance (CmR) genes. Abbreviation: RNAP = RNA polymerase. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62073/62073fig04large.jpg]\nNOTE: The plasmid encodes a T7 RNAP containing an N-terminal histidine tag and a SNAP-tag domain (SNAP T7 RNAP), as well as a kanamycin resistance gene under a pQE-80L backbone (Figure 4)25.\nAgain, add 20 µL of the 1,000x kanamycin stock to a separate culture flask containing 20 mL of lysogeny broth, and incubate it as a control.\nIncubate the two samples (from steps 2.2 and 2.3) overnight for 12-18 h at 37 °C, while rotating at 10 × g.\n3. Cell growth and induction: Day 2\nInoculate 400 mL of lysogeny broth containing 400 µL of kanamycin stock with 4 mL of the overnight growth culture from step 2.4. Incubate the culture flasks at 37 °C, while rotating at 10 × g.\nOnce the culture has reached an optical density (OD) at 600 nm of ~0.5, take out 1 mL of sample from the growth flask as a control. Store the control sample at 4 °C.",
    "Induce the cells with isopropyl β-D-1-thiogalactopyranoside (IPTG) by adding 40 µL of 1M IPTG per 100 mL of culture to achieve a final concentration of 0.4 mM IPTG. Incubate the sample for 3 h at 37 °C, rotating at 10 × g, and then spin the induced culture at 8,000 × g for 10 min to pellet the cells. Remove the supernatant, and store the pellet at -20 °C until further use.\n\t​NOTE: To avoid acute toxicity due to IPTG, avoid breathing its dust, and avoid skin and eye contact. If necessary, you can pause the experiment here and continue the next day.\n4. Cell lysis, protein purification: Day 3\nResuspend the stored cell pellet with 10 mL of lysis buffer on ice, and gently swirl to ensure the entire pellet is resuspended. Then, pipette 1 mL of sample into ten 1.5 mL tubes that are kept on ice.\nSonicate each sample at an amplitude setting of \"1\", pulsed for 2 s with a 50% duty cycle over a period of 30 s. Before and after each sample, clean the sonication tip with 70% ethanol and ddH2O. Keep all samples on ice during and after sonication.\n\tNOTE: Keep 70% ethanol away from heat and open flame.\nEquilibrate a nickel-charged nitrilotriacetic acid (Ni-NTA) purification spin column to a working temperature of 4 °C. Place/store the column at 4 °C, and keep on ice during use.\nCentrifuge the ten 1 mL samples at 15,000 × g for 20 min at 4 °C. Carefully pipette out the supernatant containing the recombinant RNAP without disturbing the pellet. If necessary, use additional equilibration buffer to adjust the total volume to ≥ 6 mL.",
    "Gently remove the bottom tab from the Ni-NTA spin column to allow for flow through the column. Place the column in a centrifuge tube, and keep it on ice.\n\tNOTE: Use a 50 mL centrifuge tube with the 3 mL Ni-NTA spin columns.\nCentrifuge the column at 700 × g and 4 °C for 2 min to remove the storage buffer. Equilibrate the column by adding 6 mL of equilibration buffer to the column. Allow the buffer to fully enter the resin bed.\nRemove the equilibration buffer from the column by centrifugation at 700 × g and 4 °C for 2 min. Before adding the prepared cell extract to the column, place a bottom plug on the column to avoid losing any product. Then, add the cell extract to the column, and mix on an orbital shaker mixer for 30 min at 4 °C.\nRemove the bottom plug from the column and place the column in a 50 mL centrifuge tube labeled flow through. Centrifuge the column at 700 × g for 2 min to collect the flow through.\nAdd 6 mL of wash buffer to the column to wash the resin. Centrifuge the column at 700 × g for 2 min to collect the fraction in a new centrifuge tube labeled wash 1. Repeat this step two more times for a total of 3 separate fractions, and collect the fractions in separate centrifuge tubes (wash 2 and wash 3).",
    "Add 3 mL of elution buffer to elute the His-tagged proteins from the resin. Centrifuge the column at 700 × g for 2 min to collect fraction in a new centrifuge tube labeled eluate 1. Repeat this step two more times for a total of 3 separate fractions, and collect the fractions into separate centrifuge tubes (eluate 2 and eluate 3).\nCombine the eluates and perform desalting to remove salts from the protein solution.\n\t\nPipette 15 mL of 0.05 % w/v polysorbate 20 over a 100 kDa centrifugal filter unit. Centrifuge at 4,000 × g for 40 min and discard the flow-through.\nUse the coated filter to concentrate the eluates 1, 2, and 3 (9 mL of total of protein eluate + 6 mL of storage buffer) to ~1,500 µL. Centrifuge the filter at 3,220 × g for 20 min, and gently pipette-wash the membrane to prevent precipitation.\nDilute the sample to 15 mL with storage buffer. Perform a buffer exchange using storage buffer 1:1,000 by repeating step 4.11.2 two more times.\nQuantify the purified protein by measuring the absorbance of the fraction at 280 nm. Blank the spectrophotometer with storage buffer (2x storage buffer at 4 °C). Gently mix the sample of the combined eluates and measure its absorbance.\n\tNOTE: Perform three separate readings at 1x, 10x, and 50x dilutions of the protein sample to average and quantify the protein. Dilute samples in storage buffer.\nAdjust the protein samples to 100 µM using 2x storage buffer. Dilute the adjusted sample 1:1 by volume with 100% glycerol. Store the resulting protein solution at -80 °C.\n5. Sodium dodecyl sulfate-polyacrylamide gel electrophoresis (SDS-PAGE) analysis of protein product: Day 3",
    "Run an SDS-PAGE gel for protein analysis. Mix 9 µL of the sample with 3 µL of 4x lithium dodecyl sulfate (LDS) protein loading dye. Heat the samples at 95 °C for 10 min.\nLoad the samples onto a 4-12% Bis-Tris SDS-PAGE gel setup. Load the protein ladder in well 1, then with samples (from left to right): flow-through, wash 1, wash 2, wash 3, elution 1, elution 2, elution 3, and total desalted elution.\n\tNOTE: Table 5 contains a sample loading table for the SDS-PAGE gel.\nRun the loaded gel samples in 2-(N-morpholino) ethanesulfonic acid (MES) buffer for 35 min at 200 V. Rinse the gel in a clean tray three times for 10 min each using 200 mL of ddH2O, with gentle agitation to remove any SDS from the gel matrix.\n\tNOTE: Wear personal protective equipment to avoid acute toxicity due to the MES.\nStain the gel with 20 mL of Coomassie blue, and incubate the gel overnight at room temperature with gentle agitation. De-stain the gel twice for 1 h each with 200 mL of ddH2O with gentle agitation on an orbital shaker.\n\tNOTE: Washing the gel for a longer period or frequently replacing the water will enhance sensitivity. Additionally, placing a folded delicate-task wipe tissue in the container to absorb excess dye will accelerate the de-staining process.\n6. Functional verification of SNAP T7 RNAP via in vitro transcription\nNOTE: This protocol uses DNA template, which encodes for the fluorescent Broccoli RNA aptamer and allows the use of fluorescence to monitor the kinetics of transcription on a fluorescence plate reader.",
    "Set up three in vitro transcription (IVT) reactions to compare the activity of SNAP T7 RNAP with wild-type (WT) T7 RNAP from a commercial source and a buffer-only control. Adjust the volume of each reaction to 20 µL.\n\t\nPrepare the SNAP T7 RNAP IVT reaction by mixing 2 µL of 10x transcription buffer, 0.4 µL of 25 mM ribonucleoside triphosphate (rNTP) mix, 5 µL of 500 nM DNA template, 2 µL of 500 nM SNAP T7 RNAP, and 10.6 µL of ddH2O.\nPrepare the WT RNAP IVT reaction by mixing 2 µL of 10x transcription buffer, 0.4 µL of 25 mM rNTP mix, 5 µL of 500 nM DNA template, 2 µL of WT T7 RNAP, and 10.6 µL of ddH2O.\nPrepare the buffer-only IVT reaction by mixing 2 µL of 10x transcription buffer, 0.4 µL of 25 mM rNTP mix, 5 µL of 500 nM DNA template, and 12.6 µL of ddH2O.\n\t\tNOTE: Add the RNAP last, keeping the samples on ice until its introduction. Table 6, Table 7, and Table 8 contain the IVT reaction formulas.\nMonitor the transcription kinetics on a fluorescence plate reader for 2 h at 2 min intervals at 37 °C using an excitation wavelength of 470 nm and an emission wavelength of 512 nm.\n7. Preparation of BG-modified oligonucleotides: Day 1\nDissolve the oligonucleotide with 3'-amine modification in ddH2O to a final concentration of 1 mM. Label this S1.\n\t\nMix 25 µL of 1 M sodium bicarbonate (NaHCO3), 284 µL of 100% dimethyl sulfoxide (DMSO), 125 µL of S1 (oligonucleotide stock), and 66 µL of 50 mM of the BG-N-hydroxysuccinimide (NHS) ester (BG-GLA-NHS) diluted with DMSO, adjust the volume to 500 µL, and incubate overnight at room temperature at 100 × g.",
    "NOTE: Keep DMSO away from heat and flame as it is a combustible liquid. Table 9 contains the reaction formula for the BG conjugation to the oligonucleotide.\n8. Ethanol/acetone precipitation of BG-oligonucleotide conjugate: Day 2\nCentrifuge the product of step 7.1.1. at 13,000 × g for 5 min. Carefully transfer the supernatant to a fresh tube and discard any precipitated BG. Split the reaction into two equal 250 µL aliquots to prevent overflow, and perform the following steps on both aliquots.\nAdd 1/10th of the volume of 3 M sodium acetate (25 µL), followed by 2.5x the volume in 100% ethanol (625 µL). Incubate at -80 °C for 1 h.\n\tNOTE: Use personal protective equipment when handling both sodium acetate (may cause irritation to eyes, skin, digestive and respiratory tract) and ethanol (extremely flammable, causes irritation on contact). If necessary, pause the experiment here and continue the next day.\nPlace the tubes in the centrifuge, and mark the outer edge. Centrifuge the tubes at 17,000 × g for 30 min at 4 °C.\n\tNOTE: The oligonucleotide pellet will appear on the marked edge of the tube.\nWithout disturbing the pellet, discard the supernatant. Top up with 750 µL of chilled 70% ethanol, and spin at 17,000 × g for 10 min at 4 °C.\nWithout disturbing the pellet, discard the supernatant. Top up with 750 µL of 100% acetone, and spin at 17,000 × g for 10 min at 4 °C.\n\tNOTE: Use personal protective equipment when handling acetone as it is extremely flammable and causes irritation on contact.\nWith the tube lid open, air dry for 5 min to remove any excess acetone through evaporation. Re-dissolve the oligonucleotide in 250 µL of 1x Tris-EDTA (TE) buffer to produce a ~850 µM BG-oligonucleotide solution.",
    "Repeat steps 8.2 to 8.6, and re-dissolve in 70 µL of 1x TE buffer. Label this S2.\n9. BG-oligonucleotide cleanup via gel filtration chromatography\nSuspend the matrix by vigorously inverting the columns several times; remove the top cap and snap off the bottom tip of column. Place the column in a 1.5 mL centrifuge tube, and centrifuge the tube at 1,000 × g for 1 min at room temperature. Discard the eluted buffer and collection tube.\n\tNOTE: It is important to prevent vacuum formation. Use prepared columns immediately.\nPlace the packed columns in clean 1.5 mL centrifuge tubes. Add 300 µL of 1x TE buffer to the center of the column bed, and centrifuge at 1,000 × g for 2 min to exchange the buffer solution. Once again, discard the eluted buffer and collection tube.\nPlace the buffer-exchanged columns in clean 1.5 mL centrifuge tubes. Apply up to 75 µL of sample to the center of the bed. Spin at 1,000 × g for 4 min.\n\tNOTE: Do not disturb the bed or touch the sides of the column; the highest point of the gel media should point toward the outside rotor.\nCollect the eluate from the collection tube, as it contains the purified nucleic acid. To quantify the sample, measure its absorbance at 260 nm; label this S3.\n\t​NOTE: Note the path length used in the measurement, and calculate the concentration using the Beer-Lambert law.\n10. Denaturing PAGE analysis of BG-oligonucleotide conjugate",
    "Cast a 18% Tris-borate-EDTA (TBE)-Urea PAGE gel. Dissolve 4.8 g of UREA, 4.5 mL of 40% acrylamide (19:1), and 1 mL of 10x TBE in 2.8 mL of ddH2O; add 5 µL tetramethylethylenediamine (TEMED) and mix thoroughly. Repeat with 100 µL of 10% ammonium persulfate (APS). Pour the solution into an empty gel cassette and allow polymerization for 40 min.\n\tNOTE: Use appropriate personal protective equipment when handling urea (causes irritation to eyes and skin), acrylamide (toxic and carcinogenic), and TEMED (toxic, flammable, corrosive). Table 10 contains the reaction formula for an 18% TBE-UREA polyacrylamide gel.\nMicrowave 500 mL of TBE buffer (0.5x) for 2 min and 30 s or until ~70 °C and pour into a gel apparatus. Prepare formamide (denaturing) loading dye containing 95% formamide + 1 mM EDTA and bromophenol blue. Mix the loading dye with each sample, and load the mixture onto the polyacrylamide gel.\n\tNOTE: Use appropriate personal protective equipment when handling formamide as it is carcinogenic. Table 11 contains a sample gel loading table.\nRun the gel at 270 V for 35 min, or until the dye front migrates to the end. Place the gel in a gel box and stain with cyanine dye for nucleic acids for 15 min at room temperature before imaging.\n\tNOTE: Use appropriate personal protective equipment when handling cyanine dye as it is combustible.\n11. Conjugation of oligonucleotide to SNAP T7 RNAP and PAGE analysis\nPrepare the reagents for the analytical-scale coupling of BG-oligonucleotide to SNAP T7 RNAP: make 9 dilutions of single-stranded DNA (ssDNA) oligo with ddH2O to create oligo:RNAP ratios ranging from 5:1 to 1:5. Dilute the protein stock to 50 µM.\n\tNOTE: Example ratios can be found in Table 12; these ratios are calculated using a RNAP concentration of 50 µM.",
    "For each dilution of ssDNA oligo, make 10 µL of the reaction mixture containing 2 µL of SNAP buffer, 4 µL of BG-oligonucleotide, and 4 µL of SNAP T7 RNAP.\n\tNOTE: Table 13 contains reaction formulas for the SNAP-tag labeling reaction.\n\t\nPrepare two more control samples: 1) an RNAP control by replacing BG-oligonucleotide with ddH2O; 2) a DNA control by replacing SNAP T7 RNAP with ddH2O (for the lowest oligonucleotide concentration of SNAP T7 RNAP). Incubate all samples at room temperature for 1 h, and keep on ice until needed.\nSet up eleven 10 µL reactions by adding 2 µL of each sample to 4 µL of SNAP buffer and 2 µL of protein loading dye, and heat at 70 °C for 10 min. Load 2 µL of each sample onto the 4-12% Bis-Tris protein gel, and perform gel electrophoresis on ice at 200 V for 35 min.\n\tNOTE: Table 14 contains reaction formulas for the gel loading samples.\n\t\nWash SDS off via 3x water-exchange on a shaker, each wash lasting 10 min each. Stain with cyanine dye for nucleic acids for 15 min before imaging. Stain the gel again using 20 mL of Coomassie blue stain for 1 h. De-stain with ddH2O for 1 h (or overnight) before imaging.\n\t\tNOTE: In the gel, one of the reactions will produce the most tethered polymerase along with the least amount of excess free BG-oligonucleotide; this is the optimal ratio.\nPrepare reagents for the preparative scale coupling BG-oligonucleotide to SNAP T7 RNAP. Perform the coupling reaction with the optimal ratio found in the analytical scale.\n\t​NOTE: Minimize protein exposure to room temperature by placing the protein on ice when not in use.\n12. Purification of oligonucleotide-tethered SNAP-T7 using ion exchange columns",
    "Follow the manufacturer's instructions for tube setup if it deviates from the instructions listed here. Prepare a purification buffer with pH higher than the isoelectric point of the protein.\n\t​NOTE: For the example protein in this protocol, a purification buffer of 10 mM sodium phosphate buffer (pH 7) was used.\n\t\nPrepare 1,000 µL of elution buffer containing final concentrations of 50 mM Tris and 0.5 M NaCl. Mix 50 µL of 1 M Tris, 100 µL of 5 M NaCl, and 850 µL of ddH2O.\n\t\tNOTE: Table 15 contains the reaction formula for the elution buffer.\nPlace a column in a 2 mL centrifuge tube, and wash with purification buffer at 2,000 × g for 15 min, or until all the buffer has been eluted. Discard the eluted buffer.\nDilute each sample with purification buffer at a 3:1 purification buffer:sample ratio, and load the sample into the column 400 µL at a time. Spin at 2,000 × g for 10 min, or until all the buffer has been eluted. Collect the flow-through and label it as flow-through.\nAdd 400 µL of purification buffer into the center of the column. Spin at 2,000 × g for 15 min, or until all the buffer has been eluted. Collect the flow-through and label it as wash 1. Repeat twice more for wash 2 and wash 3.\nAdd 50 µL of elution buffer into the center of the column. Spin at 2,000 × g for 5 min, or until all the buffer has been eluted. Collect the flow-through and label it as eluate 1. Repeat twice more for eluate 2 and eluate 3.",
    "Pool eluates 1, 2, and 3 (label this total eluate), leaving a small fraction of each eluate for the gel, and measure absorbance at 260 nm (A260) and 280 nm (A280). After the measurement, add glycerol at a 1:1 ratio and store at -20 °C until further use.\nUse a centrifugal filter unit (0.5 mL; 30 kDa) to buffer-exchange total eluate with 2x storage buffer (~1:100) (label this product). Measure A260/280 again. Add glycerol at a 1:1 ratio and store at -20 °C until further use.\nLoad each eluate: flow-through, wash 1-3, total eluate, and product in a 4-12% Bis-Tris SDS-PAGE gel, along with a protein ladder. Run at 200 V for 35 min, or until the dye front migrates to the end.\n13. Demonstration of on-demand control of tethered RNA polymerase activity\nPrepare 5x annealing buffer containing 25 mM Tris, 5 mM EDTA, and 25 mM magnesium chloride (MgCl2). Mix 2.4 µL of each template (1 µM) with 5 µL of annealing buffer and 14.2 µL of ddH2O to form 25 µL of 1 µM dsDNA cage. Incubate this solution at 75 °C for 2 min. Similarly, anneal the sense and antisense strands of the promoter and malachite green aptamer DNA template. Prepare a 1mM solution of malachite green oxalate.\n\tNOTE: Table 16 contains the reaction formula for 5x annealing buffer, Table 17 contains the reaction formula for annealing two ssDNA templates.\nIncubate the tethered SNAP T7 RNAP with the dsDNA cage in a 1:5 molar ratio at room temperature for 15 min to a final concentration of 500 nM RNAP. Keep on ice until needed.\nPreheat the plate reader to 37 °C. Set up three 25 µL IVT reactions on ice",
    "Set up a reaction containing the caged SNAP T7RNAP with nucleic acid transcription factors. Mix 2.5 µL of 10x IVT buffer, 1 µL of 25 mM rNTP mix, 1 µL of 1 mM malachite green, 2.5 µL of the RNAP-cage mixture, 2.5 µL each of 1 µM transcription factor A and B oligonucleotide strands, and 3 µL of 1 mM malachite green aptamer template in 10 µL of ddH2O.\nSet up a reaction containing the caged SNAP T7RNAP without nucleic acid transcription factors. Mix 2.5 µL of 10x IVT buffer, 1 µL of 25 mM rNTP mix, 1 µL of 1 mM malachite green, 2.5 µL of the RNAP-cage mixture, and 3 µL of 1 mM malachite green aptamer template in 15 µL of ddH2O.\nSet up a reaction containing buffer only. Mix 2.5 µL of 10x IVT buffer, 1 µL of 25 mM rNTP mix, 1 µL of 1 mM malachite green, and 3 µL of 1 mM malachite green aptamer template in 17.5 µL of ddH2O.\n\t\tNOTE: Table 18 contains a general reference for the in vitro transcription reactions.\nTransfer each reaction to a 384-well plate. Monitor transcription of the malachite green aptamer on a fluorescence plate reader for 2 h at 37 °C and with 610 nm excitation and 655 nm emission. Once finished, keep the plate on ice until needed.\nMicrowave 0.5x TBE buffer for 2 min 30 s or until ~70 °C. Run the RNA products of each well in a denaturing 12% TBE-Urea polyacrylamide gel in the heated 0.5x TBE buffer at 280 V for 20 min, or until the dye front reaches the end. Stain the gel with cyanine dye nucleic acid stain for 10 min on an orbital shaker before imaging.",
    "NOTE: Table 19 contains the reaction formula for a denaturing 12% TBE-Urea PAGE gel.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}