{
  "id": 3448,
  "origin_website": "Cell",
  "title": "Using PrISMa to reveal the interactome of the human claudins family",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDesign the PrISMa peptide membrane\nTiming: 3 h\nHere we design the peptides for the screening of the regions of interest. We will include the PTMs or mutations of interest as a separate entry on the screen. There is a company that commercialize those membranes in a cost-effective manner (JPT Peptide Technologies GmbH - JPT[href=https://www.jpt.com/] -). For our studies we utilized their membranes.\nSelect the region or the protein/proteins of interest.\nEach selected region is designed based on structure and exposition to binding. Identify the amino acid sequence for the targeted region for utilization with the prismaR package (the amino acid sequence not as a fasta file). Here we use the Rad23 sequence file that is included in the prismaR package.\nCreate a meta description file using the create_PTM_table() command. The command creates a table which is needed to be filled in with the PTM information (The package contains an example dataset).\nRead the meta data in using:\nPTMs <- read_PTM_table()\nCreate the peptide list:\npeptide_set <- construct_prisma_peptide_set(protein_sequence, PTM_table)\nOrder at least three replicates of the membrane from a peptide synthesis company that performs the Fmoc syntheses. Procedures to generate those membranes are described in.9[href=https://www.wicell.org#bib9],15[href=https://www.wicell.org#bib12]\nNote: The overlapping peptides can be automatically designed using the prismaR R package (https://git.lih.lu/dittmarlab/prismaR[href=https://git.lih.lu/dittmarlab/prismaR]). For a detailed description, see the documentation of the package. A high overlap of the peptides increases the resolution of the screen and makes the filtering of the results more effective, but also drastically increases the number of spots to analyze by LC-MS/MS, decreasing the time-cost effectiveness.\nNote: For peptides covering a modified site are all peptides spanning the modified site are also included as modified peptides besides the unmodified ones.",
    "Critical: The PrISMa screen works best for unfolded regions, like intrinsically disordered regions. Use a structural database to check if the selected region matches this criterion (PDB[href=https://www.wwpdb.org/], UniProt[href=http://www.uniprot.org/]).\nNote: In case a specific region contains several modifications, we recommend a maximum of three modifications per peptide. The number of control peptides added increases exponentially, hindering the analysis and the validation of the potential interactions.5[href=https://www.wicell.org#bib5]\nCell culture on MDCK-C7 cells and protein extraction\nTiming: 2 weeks\nHere we describe the generation of the nuclear-depleted protein extract from MDCK-C7 cells, following a modified version of a nuclear-cytoplasmic fractionation protocol.16[href=https://www.wicell.org#bib13]\nNote: In this protocol, we use MDCK-C7 cells, which are well-established in the field of tight junction research. The cells can form tight junctions with a high frequency and thus provide a good source of tight junction proteins.17[href=https://www.wicell.org#bib14],18[href=https://www.wicell.org#bib15]\nThaw MDCK-C7 cells in DMEM medium supplemented with 10% FBS and 1% Penicillin/Streptomycin and incubate in a 37°C and 5% CO2 humidified incubator.\nPassage the cells at 80%–90% confluency.\nNote: 10 confluent 10 cm dishes are needed per PrISMa membrane. In this case, 166 spots were placed in a 5 cm × 4 cm membrane. Depending on the number of peptides to analyze the size of the membrane will differ, so the required material could be higher.\nWash the cells with 5 mL PBS twice.\nIncubate with 1 mL trypsin/EDTA (0.25%/0.53 mM) solution for 1 h at 37°C.\nCritical: MDCK-C7 cells are well-known to be strongly attached to the culture dish. It is needed longer periods of time to detach the cells.\nCollect detached cells in a 15 mL tube. See problem 1[href=https://www.wicell.org#sec7.1].\nCentrifuge the cells at 600 g for 10 min at 4°C.\nRemove the supernatant.",
    "Resuspend cell pellet in 5 packed cell volumes (pcv) of Hypotonic Buffer A and incubate for 15 min on ice to allow cells to swell.\nNote: The buffer can be stored at 4°C for 4 weeks but If DTT has been added then only use fresh.\nCentrifuge the cells at 600 g for 10 min at 4°C.\nRemove the supernatant.\nResuspend the cell pellet in 5 cell pellet volumes of Hypotonic Buffer B.\nNote: The buffer can be stored at 4°C for 4 weeks, but if DTT has been added then only use fresh.\nPass cell suspension through a 23G needle 3 times to burst the cells without breaking the nuclei.\nIncubate for 10 min at 4°C.\nCentrifuge the lysate at 600 g for 5 min at 4°C to precipitate the nuclei.\nCollect supernatant (post-nuclear supernatant) in a fresh 1.5 mL Eppendorf tube.\nCollect 50 μL supernatant for protein concentration measurement, western blot analysis, and as a control for mass spectrometry analysis. See problem 2[href=https://www.wicell.org#sec7.4] and 3[href=https://www.wicell.org#sec7.6].\nSnap-freeze the protein lysate at −80°C.\nNote: The cells should be at a low passage number (< 20).\nNote: If no interactions with membrane proteins are expected, we recommend an ultra-centrifugation step to clear membrane micelles from the lysate at 100,000 g for 30 min after step 12.\nNote: Protein quantification can be measured using a variety of assays following manufacturer instructions such as Pierce BCA Protein Assay[href=https://assets.thermofisher.com/TFS-Assets/LSG/manuals/MAN0011430_Pierce_BCA_Protein_Asy_UG.pdf] (Thermo Fisher Scientific), Bradford Protein Assay[href=https://www.bio-rad.com/sites/default/files/webroot/web/pdf/lsr/literature/Bulletin_1069.pdf] (Bio-Rad), or other protein quantification methods.\nCritical: The protein concentration has to be maintained greater than 2 mg/mL. Lower concentrations will decrease the number of potential interactors drastically.4[href=https://www.wicell.org#bib4]",
    "Pause point: Samples can be used fresh. It is recommended to use protein lysates within 2 weeks of preparation. Samples can be stored at −20°C for 2 weeks; for longer periods they should be stored at −80°C.\nPrISMa pull-down\nTiming: 2.5 h\nHere, the protein extract is incubated with the peptide membrane to allow protein binding to the peptide spots.\nThaw cell lysate on ice.\nPre-condition the PrISMa membrane in a plastic container by submerging it in 5 mL Hypotonic Buffer A and incubating it on a rocking shaker for 45 min at room temperature (RT, at 22 motions per minute).\nWash the membrane 5 times with 5 mL Hypotonic Buffer A for 5 min each at RT on a rocking shaker.\nIncubate the membranes in sealed bags with 2 mL MDCK-C7 cell extracts (3.5 mg/mL) for 20 min on ice in a rocking shaker.\nNote: For the membrane incubation, we recommend performing the binding in a sealed plastic bag, which fits the membrane to reduce the amount of protein extract needed for the experiment.\nNote: Multiple membranes should be incubated in separate bags.\nNote: We recommend performing the membrane binding assay in triplicates to obtain robust data for the downstream analysis.\nWash membranes 3 times with Hypotonic Buffer A for 5 min at RT on a rocking shaker at 22 motions per minute.\nLet membranes dry on a clean glass surface for 60 min.\nWhile waiting, fill Skirted 96-well Robotic Plates with 20 μL Denaturation Buffer per membrane spot (i.e., 166 peptide spots = 166 wells).\nNote: Samples should be analyzed at least in triplicates to further calculate the t-test comparison (Step 49).\nNote: The buffer has to be prepared fresh.",
    "Cut membrane spots by cutting out each spot with a scalpel and transfer each spot with tweezers to a well containing Denaturation Buffer.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3024-Fig2.jpg\nFigure 2. Extracting membrane tiles from the PrISMa membrane and incubation of the membrane\n(A) An example of a biopsy punch being used on a PrISMa membrane. Note the excised membrane tiles next to the membrane.\n(B) Tools used PrISMa study. The red arrow indicates excised membrane tiles placed into a conical 96-well plate containing buffer.\n(C) Sealed bag with the membrane and the cell extract.\n(D) Incubation of the sealed bag on a rocking shaker.\nCritical: The membrane should be cut when it’s dry to see the spots more clearly. The spots should be cut entirely as truncated spots will derive biased results.\nNote: A 25 mm biopsy punch can also be used to punch out spots from the membrane (Figures 2[href=https://www.wicell.org#fig2]A and 2B).\nPause point: The Skirted 96-well Robotic Plate containing the excised peptide spots in Denaturation Buffer can be kept at −20°C for several weeks.\nIn-solution protein digestion and peptide cleaning for LC-MS/MS analysis\nTiming: 1 h 30 min + overnight incubation\nHere we describe the steps to digest the protein extract bound to the peptide spots and desalting for LC/MS-MS analysis.\nAdd 1 μL DTT buffer to each well to the Skirted 96-well Robotic Plate containing proteins in Denaturation Buffer and incubate for 30 min at 37°C.\nAdd 3 μL IAA buffer to each well and incubate for 45 min at RT protected from light.\nNote: Reduction of disulfide bonds with DTT followed by alkylation with IAA is a standard procedure for mass spectrometry-based proteomics. The disulfide bonds are broken, and cysteine groups are carbamidomethylated (ΔM = 57.021), controlling the high reactivity of those groups, allowing the identification of cysteine containing peptides.",
    "Alternatives: Other reduction agents, like TCEP (Tris-(2-carboxyethyl)-phosphine), and alkylation reagents, such as Chloroacetamide can also be used.\nAdd 150 μL ABC buffer and add 2 μL of digestion buffer at 37°C overnight (ON).\nStop the digestion with 20 μL of 10% TFA and store the samples at −20°C.\nCritical: Check pH of the samples after adding TFA (pH < 2). Add more TFA in case the pH is > 2, otherwise there will be massive peptide losses in the peptide clean-up process.\nPause point: Samples can be stored at −20°C for several weeks.\nPeptide clean-up\nTiming: 1 h\nHere we described the desalting and cleaning of the digested peptides in a Sep-Pak C18 96-well plate.\nCondition a Sep-Pak C18 96-well plate with 300 μL MeOH per well.\nCentrifuge the plate at 700 g for 1 min at RT, removing the MeOH.\nAdd 300 μL elution Buffer A.\nCentrifuge again at 700 g for 1 min at RT.\nPerform two equilibration steps with 300 μL 0.1% FA with centrifugations at 700 g for 1 min.\nTransfer the digested peptides to the plate.\nCritical: Check that the pH of the samples is < 3. Acidify by adding 1–2 μL of 10% FA if needed.\nWash and centrifuge at 700 g with 300 μL 0.1% FA 5 times, removing all the buffer.\nElute the peptides with 200 μL of elution Buffer B in a fresh Skirted 96-well Robotic Plate.\nDry peptides for 45 min - 1 h using a vacuum centrifuge until 5–10 μL remain in the well.\nPause point: Peptides can be stored at −20°C in the plate for several weeks.\nReconstitute dried peptides in 30 μL of MS Sample Buffer.",
    "Critical: After every centrifugation step, confirm that there is no liquid remaining on top of the wells. If liquid remains, centrifuge again at 1000 g for 3 min to remove it.\nAlternatives: Other methods can be used, like StageTips.5[href=https://www.wicell.org#bib5],19[href=https://www.wicell.org#bib16]\nLC-coupled mass spectrometry\nTiming: 4 days\nHere we describe the analysis of the pull-downs by LC-MS/MS. In this protocol we used a Dionex Ultimate 3000 RSLCnano (Dionex) and Q Exactive HF (Thermo Fisher Scientific) using the Nano-electrospray ion source at 275°C. However, the HPLC-MS setup can be performed on different LC-MS/MS machines. Individual parameters should be adjusted considering identification depth and minimal LC gradient.\nThe PrISMa technique generates many samples for mass spectrometric analysis. In the case of the claudin samples, 798 peptide spots (166 spots run in triplicates) were analyzed.\nRun samples on a nanoHLPC-coupled mass spectrometer in triplicates while running a blank between each sample.\nNote: We noticed a 5% carryover between samples and are encouraging the use of a blank to be run between each triplicate sample.\nCritical: Monitoring the blanks between samples will estimate the carryover. The levels should be maintained below 5%, otherwise the number of false positives hints will increase.\nAlternatives: Longer LC gradients can be used to identify more peptides. In our hands, this method is a good balance of time versus peptide identification.\nData analysis using maxquant\nTiming: 1 week\nThe recorded mass spectrometric data must be matched to peptides and proteins. For this, we use the MaxQuant software package (www.maxquant.org[href=http://www.maxquant.org]). MaxQuant demands significant computing resources. In our case, we used a 72-core computer to analyze the data. Using a less powerful computer will prolong the time needed for the analysis.\nAfter collecting the raw data, run a MaxQuant software analysis using the parameters from the materials and equipment.",
    "Note: The proteomics reference databases for the human C-terminal sequences and the canis lupus familiaris proteome are available at Mendeley Data: https://doi.org/10.17632/ptxs8ctgb7.1[href=https://doi.org/10.17632/ptxs8ctgb7.1].\nNote: In the MaxQuant analysis, two different databases were used. One for the sequences of the C-terminal regions of the human claudins and another database covering the canis lupus familiaris proteome. By checking for the peptide identifications mapped to the C-terminal regions database, peptides can be excluded that are derived from the peptide matrix, to avoid the identification of false claudin-claudin interactions (Filtering by reference species).\nAlternatives: Other search engine software could be used for data analysis (such as Proteome Discoverer, Mascot, Comet, etc.), but parameters and data analysis could differ from our workflow."
  ],
  "subjectAreas": [
    "Proteomics",
    "Mass Spectrometry",
    "Protein Biochemistry",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}