{
  "id": 9170,
  "origin_website": "Jove",
  "title": "Selective Depletion of Microglia from Cerebellar Granule Cell Cultures Using L-leucine Methyl Ester",
  "procedures": [
    "All experiments described herein were performed in accordance with the United Kingdom Animals (Scientific Procedures) Act of 1986.\n1. Preparation of Instruments, Culture Media, and Dishes\nPrepare two stainless steel laboratory dissecting scissors and two stainless steel laboratory forceps. Autoclave all instruments and place in a culture hood O/N under ultraviolet light (UV) light for sterilization.\nMake 500 ml of minimum essential media (MEM) culture medium (10% Foetal Bovine Serum [FBS], 20 mM KCl, 25 mM NaHCO3, 30 mM D-glucose, 2 mM L-glutamine, 100 U/ml penicillin, 100 µg/ml streptomycin and 6 µg/ml ampicillin) and filter sterilize. Store at 4 °C for months.\nPrepare 24 well culture plates containing 14 mm, number 1 thickness coverslips. Autoclave the coverslips and coat in 100 mg/L poly-d-lysine (PDL) as previously described 3. UV light sterilize O/N.\n2. Preparation of CGC Culture Solutions\nPrepare ‘solution A’ (100 ml) in autoclaved, UV light treated, sterile dH2O containing 250 mg of glucose, 300 mg of Bovine Serum Albumin [BSA], 955 mg of Phosphate Buffered Saline [PBS] (Ca2+ and Mg+ free), and 1 ml of 3.8% MgSO4·7H2O.\nPrepare ‘solution B’ (10 ml) containing 1 ml of 5 mg/ml trypsin diluted in 9 ml of solution A.\nPrepare ‘solution C’ (10 ml) containing 1,000 units DNase, 0.5 mg of soybean trypsin inhibitor, 100 µl of 3.8% MgSO4·7H2O, diluted to 10 ml with solution A.\nPrepare ‘solution D’ (20 ml) containing 3.2 ml of solution C, diluted to 20 ml with solution A.\nPrepare BSA/Earle’s Balanced Salt Solution (EBSS) solution containing EBSS, 25 mM NaHCO3, 3 mM MgSO4·7H2O, and 4% BSA, pH 7.4, as previously described3.",
    "Prepare LME by adding pure LME into 5 ml of MEM culture medium to give a final concentration of 150 mM LME, return the solution to pH 7.4 using a benchtop pH meter, and filter sterilize using a 28 mm polyether sulfone (PES) 0.2 µm syringe filter.\n3. Culturing the CGCs\nCollect cerebella from 4-7 day old rat pups as previously described3. Place immediately in Petri dish containing 5 ml solution A on ice.\nPour off excess solution from cerebella and place tissue in the Petri dish lid.\nChop tissue finely with a well-flamed razor blade in at least three different directions.\nAdd chopped tissue to solution B (rinse Petri dish with solution to ensure limited tissue is lost) and place in water bath at 37 °C for 5 min. Shake gently every couple of min.\nAdd solution D (20 ml) to the tube to neutralize the trypsin, shake and centrifuge at 65 x g for 5 min.\nPour off supernatant.\nResuspend in 4 ml of solution C. Triturate well (approximately 10 times each) with three flamed glass pipettes of decreasing diameter, until the suspension is as homogenous as possible.\nSlowly and gently add a few drops of this homogenate on top of the BSA/EBSS. If it starts to sink through the BSA/EBSS, triturate more and/or add a little more solution C. The homogenate should sit in a layer on top of the BSA/EBSS. Do not shake. Spin at 100 x g for 5 min.\nRemove supernatant and resuspend pellet (soft) in 1 ml of MEM medium.\nCount cells using a haemocytometer and plate at 800,000 cells/coverslip in 500 µl of MEM medium. Place in an incubator at 37 °C with 6% CO2.",
    "Change the medium the following day (24-36 hr after the prep). Make a solution of MEM medium containing 10 µM of the cell cycle inhibitor arabinofuranosyl cytidine (AraC).\n\t\nFor each coverslip, retain 250 µl of the old medium in a fresh 24 well plate, aspirate the rest, add 250 µl of normal MEM medium and aspirate this to wash the cells, then add the 250 µl of old medium back to the cells and top up with 250 µl of AraC-containing medium.\n\t\tNote: Cells can be used from 6 days in vitro (DIV).\n4. Selectively Depleting the Microglia (Performed at 6 DIV)\nAdd pure LME to 5 ml of a separate aliquot of MEM medium to give a final concentration of 150 mM LME.\nReturn the solution to pH 7.4 and filter sterilize using a 28 mm polyether sulfone (PES) 0.2 µm syringe filter.\nDilute solution to a concentration of 50 mM (2 x LME) in MEM medium and place in a water bath at 37 oC for 10 min along with normal MEM medium for control cultures.\nRemove half (250 µl) the MEM medium from CGC cultures and retain at 37 °C.\nTreat cells with MEM medium containing 2 x LME (250 µl), i.e. diluted 1:1 giving a well concentration of 25 mM, or with pre-warmed MEM medium without LME (250 µl) for control cultures.\nIncubate cells at 37 °C in a humidified atmosphere with 6% CO2 for 1 hr.\nWash cells twice in fresh pre-warmed MEM medium to remove LME-containing media, and then replace the retained culture medium and an equal volume of fresh pre-warmed MEM medium to the corresponding wells.\nReturn cultures to the incubator (humidified with 6% CO2 at 37 °C) and leave to rest for 24 hr before any further treatment.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}