{
  "id": 10481,
  "origin_website": "Jove",
  "title": "Methanol Independent Expression by Pichia Pastoris Employing De-repression Technologies",
  "procedures": [
    "1. Media Preparation\nBuffered minimal media (BMG with glycerol, BMD with dextrose as carbon source) preparation (1 L)\n\t\nAutoclave 650 mL of distilled water in a 1 L screw cap glass bottle. After cooling down, complete the medium by adding 100 mL of autoclaved 10x YNB (134 g/L yeast nitrogen base w/o amino acids), 200 mL of potassium phosphate buffer (1 M, pH 6), 30-100 mL of 10% w/v glucose or glycerol (depending on the desired generated biomass amount during the batch), 2 mL of sterile 500x Biotin (10 mg/mL) solution and fill up to 1 L with sterile distilled water.\n\t\tNote: All ingredients have to be autoclaved in separate flasks. Biotin is destroyed when autoclaved, and therefore has to be filter sterilized with 0.2 µm membrane filters.\nBuffered rich media (BYPG) (1 L)\n\t\nAutoclave 700 mL of distilled water with 1% w/v yeast extract and 2% w/v peptone in a 1 L screw cap bottle. After cooling down, add 30-100 mL of the separately autoclaved 10% w/v glycerol, 200 mL of potassium phosphate buffer (1 M, pH 6) and fill up to 1 L with sterile distilled water.\n2. Shake Flasks Preparation\nAdd 5 mL of distilled water in the 250 mL baffled shake flasks, cover it with two layers of cotton cloth and fix it in place with rubber bands. Cover the cloth with a piece of aluminum foil.\nAutoclave the flasks at 121 °C for 20 min for full sterilization.\nRemove residual water from the flask and aliquot 50 mL of the previously prepared media to each flask.\n3. Overnight Culture Inoculation",
    "Start an overnight culture (ONC) with a single fresh colony of the desired expression strain in 5 mL of YPD (1% w/v yeast extract, 2% w/v peptone, 2% w/v glucose) in a 50 mL centrifuge tube while leaving the lid slightly open to allow proper aeration.\nLet it grow over night at 28 °C, 80% humidity, in a shaker at 100-130 rpm (2.5 cm shaking diameter).\n4. Measurement Setup and Main Culture Cultivation\nFor setting up the online monitoring system, follow the manufacturer’s instructions for appropriate calibration of the devices.\nPlace a computer, where the appropriate software for monitoring is installed in range for a Bluetooth connection to the measurement stations. Start the software to connect the devices via Bluetooth.\n\t\nTurn on the Bluetooth connection on the biomass measuring device by pressing the silver button on the front.\nIn the software, click Devices then Find Devices.\n\t\tNote: The devices should appear as a list in the window below the task line. If they do not, it is advisable to check if the batteries are charged and the computer is within reach for a Bluetooth connection.\nDrag and drop the found devices to the squares on the right side of the screen Measurement Tray.\nClick Connect.\n\t\tNote: When the connection was successful, a control screen appears.\nTo start a test run for the Bluetooth connection, click Measurement.\nSet up the experiment.\n\t\t\nClick Start Measurement, name the experiment and enable all parameters needed to monitor.\n\t\t\tNote: Licenses are needed for each of the possible measured parameters.\nSet Interval to 3 min.\n\t\t\tNote: The interval determines how often measurement points are taken and every measurement point results in a value afterwards. Measuring every minute is very accurate, but lots of data are generated which makes it more laborious to evaluate.",
    "Set Average Measurement Points to 11.\n\t\t\tNote: This setting determines how many measurement points are actually taken every 3 min. Therefore, the output is the mean value of 11 measurement points over 11 s.\nEnter the names for the samples.\nSkip the next screen, as the angle was already calibrated before (Step 4.1).\n\t\t\tNote: A test run for the Bluetooth connection before inoculating the main cultures is advised to ensure stable connections and appropriate location of the connected computer. Also, the batteries have to be charged.\nMeasure the cell density of the ONC (Step 3.1) diluted in cultivation media (1:20) in a spectrophotometer at 600 nm wavelength. Inoculate 50 mL of the medium (recommended carbon source concentration 0.3-1%, different media possible as described in Step 1.) with the ONC to an OD600 of 0.05 by using the following calculation.\nimgsrc://cloudfront.jove.com/files/ftp_upload/58589/58589eq1.jpg\nPlace the flasks in the detectors and shake at 28 °C, 130 rpm and 80% humidity.\n\tNote: It is very important to give the culture 5 min of shaking before starting the measurement to avoid cells sticking to the bottom of the flask and yielding wrong values.\nClick Start Measurement in the software.\nTake 0.2 mL samples for cell density measurement 4 h after the inoculation and when the carbon source gets depleted (determination described in step 4.7) in triplicates. Dilute the samples appropriately in cultivation media (first measurement 1:5, second measurement 1:20) and measure the absorption at 600 nm wavelength in a spectrophotometer. Before removing the flasks and even before stopping the shaker, always pause the measurement in the software.",
    "Note: The detectors are calibrated for recording the parameters under defined shaking conditions and will yield to nonsense measurements when recording still cultures. Also, make sure to always wait 5 min of shaking before starting the measurement again. The cell density measurements are essential because the detector is delivering just values for the biomass and not real cell density. A calibration function between the OD600 values (x values) and the values obtained by the online measurement system (y values) can be achieved by measuring several timepoints spectrophotometrically. The values are not in a linear but in a logarithmic relation according to the following calibration function:\nimgsrc://cloudfront.jove.com/files/ftp_upload/58589/58589eq2.jpg\n\ty: OD600 values obtained by spectrophotometer\n\tx: values obtained by online measurement system\n\tk: slope\n\td: axis intercept\n\tThe slope and the axis intercept can then be used to convert any value into the corresponding OD600 value. In Excel one can plot the spectrophotometrically obtained OD600 values against the values from the online system from the same timepoint. The addition of a logarithmic trendline and the corresponding equation will give the calibration function shown above.\nCultivate until the carbon source is nearly depleted (app. 12-20 h). For that purpose, let the cultures grow until it can be seen in the software diagrams that the oxygen concentration is approaching zero and the cells are in the exponential growth phase.\n\tNote: This is the case for carbon source concentrations used in this protocol. The timepoint of carbon source depletion can be determined with the online monitoring system as it is shown exemplarily in Figure 1 in the Representative Results section, when the oxygen level approaches zero and the cells are in the exponential growth phase.\n5. Protein Expression by De-repression",
    "When the timepoint described in Step 4.6 is reached, start feeding the cultures by the addition of four feed discs per flask under sterile conditions.\n\tNote: Under the described conditions, four glycerol feed discs release 2 mg/h glycerol according to the manufacturer.\nContinue the cultivation for 60-90 h while taking samples every 24 h to monitor the protein expression by an assay of choice (e.g., Bradford assay15, SDS PAGE16 or activity assays) and cell density measurements.\n6. Culture Harvesting\nAfter the 60-90 h of cultivation, fill the cultures in 50 mL centrifuge tubes for harvesting by centrifugation at 4,000 x g, 4 °C for 10 min.\n\tNote: The supernatant (for secreted proteins) or the cells (for intracellular protein expression) can be harvested by centrifugation at 4,000 x g, 4 °C for 10 min and further analyses can be done.\nExport the online measurement data as a spreadsheet file from the software for further analysis.\nFill 5-10 mL of distilled water to all the flasks and autoclave to inactivate the remaining cells."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}