{
  "id": 17790,
  "origin_website": "Jove",
  "title": "Integrating Augmented Reality Tools in Breast Cancer Related Lymphedema Prognostication and Diagnosis",
  "procedures": [
    "This study was approved by the Institutional Review Boards from the Authors' Institutions. This protocol applies to node-positive (i.e., N>1 according to the TNM staging system)14 breast cancers showing LVI and/or ENE.\n1. Real time arm measurements\nInstall the free downloadable application (e.g., Captevia) on a tablet computer.\nTake a marker of the highest-contrast color compared to the skin of the patient (e.g., white, black).\n\t\nMark the skin of the upper limb to be analyzed using point-landmarks at 5 cm starting from wrist to the elbow, and from elbow to proximal portion of the arm. Draw the circumferences on the skin of the upper limb to be analyzed at the level of each landmark.\nPosition the patient in an upright position in a room with sufficient space to move around her/him. Raise the patient's upper limb anteriorly by 90°. Ask the patient to remain still in this position for all the scan duration.\n\tNOTE: In case of difficulty of the patient to maintain this position, a support at hand level (e.g., a stick) can be used.\nHook and link the 3DLS device to the tablet.\nOpen the application from the tablet and enter the credentials of the subject to be examined within the patient database.\n\t\nClick Connection and then + to enter a new patient. Enter the patient's Name and Surname together with other preset anamnestic variables (such as date of birth, height, weight, etc.) and others as desired in the dedicated space.\nClick the 3D icon. Select the area to be examined by modulating the distance and size of the cube that appears on the screen using 2 fingers on the touch screen",
    "Click Scan and start the three-dimensional scan framing the upper limb of the patient on all the planes of the space. Rotate around the limb from all the views many times in order to optimize the quality of the acquired image.\n\tNOTE: A good acquisition takes on average time of 30 seconds. Do not stray more than one meter from the limb to be examined. Do not move the tablet too quickly.\nOnce the acquisition is completed, press Done. If needed, revise the form to assess any acquisition defects or missing part.\nSelect the acquisition and press the icon at the bottom right of the screen to send the file. Enter an email to send the file to and click Send.\nStart the PC and download the data file sent by e-mail. Then insert the USB key with the software license, double click the software icon, confirm selected license type, and open the data file.\nView the scan and press Create New Patient. Name the patient's file, select the destination to save the file, and press Save.\nSelect File in the upper left corner. Select the patient's file previously named.\nSelect the scan and press Extract to extract the scan. Select the extracted scan and press Cleaning.\nSelect the image. Clean the shape by orienting it in the space (x, y and z axis). Cut off any segments included in the scan on the various axes (x, y and z). It will also be possible to view any skin marks included in the scan to more precisely cut the scan. Validate the cut figure.\nName the shape obtained from the scan. Press Create a new shape.\nOrient the shape axis on the 3 planes of the space and press End.",
    "Select the processed form and press Open: the software will provide the total volume of the processed form.\nCalculate the volume of different sections, press Volume. Move and select the upper and lower margin of the section from which to extract the volume.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}