{
  "id": 15072,
  "origin_website": "Jove",
  "title": "In Vitro Directed Evolution of a Restriction Endonuclease with More Stringent Specificity",
  "procedures": [
    "1. Preparation of ESCs\nClone methyltransferase of the restriction-modification system to be engineered in a low copy number plasmid (e.g., pACYC184 or pACYC174 or their derivatives).\nNOTE: The bacterial host strain must be able to tolerate methylation introduced by the cloned enzyme and provide inducible expression of T7 RNA polymerase. Use of the ER2566 strain (carrying McrA, McrBC, and Mrr mutations) is recommended.\nConfirm that the recombinant plasmid DNA is protected against cleavage by the cognate endonuclease by treating 0.5 µg of plasmid DNA with 10 units of cognate REase in buffer and temperature recommended by the enzyme supplier for 2 h.\nPrepare competent cells of this strain.\nNOTE: Any method can be used. The NlaIV engineering project used a simple calcium chloride method12.\nConstruct recombinant plasmid with the ORF for the REase under control of the T7 promoter from a different exclusion group and with a different selection marker than the one containing the methyltrasferase gene in step 1.1. Vectors pET28 and pET30 can be used.\nRemove all recognition sites for the engineered enzyme from the section of the recombinant plasmid between the T7 promoter and the stop codon of the enzyme ORF by introducing silent mutations (Figure 2, Table 1A).\n\tNOTE: If more than one such site must be removed, multiple mutation rounds will be necessary (steps 1.5.1–1.5.7).\n\t\nUse an inside-out PCR reaction that amplifies the full-length plasmid with designed variations introduced at the 5' ends of the primers (Table 2A).\nRemove the template DNA by adding 10 U of DpnI endonuclease to the 50 µL of the PCR reaction, and incubate for 2 h at 37 °C.\nResolve the products by agarose gel electrophoresis. Cut out the band corresponding to the full-length plasmid and purify it with a commercial kit.",
    "Add 10x ligation buffer (to a 1x concentration) and supplement with ATP (to 1 mM). Add 10 U of T4 polynucleotide kinase and incubate for 20 min at 37 °C. Inactivate the enzyme by heating at 70 °C for 10 min.\nAdd PEG 4000 to 5%, supplement again with ATP (to 1 mM), and add 5 U of T4 DNA ligase. Incubate for 2 h at room temperature (RT).\nTransform into a competent bacterial strain carrying cognate methyltransferase (step 1.1).\nIsolate the plasmid DNA in small scale and confirm the introduction of sequence changes by dideoxy sequencing.\nIntroduce unique restriction sites close to the sequence(s) targeted by oligonucleotide guided mutagenesis (Figure 2, Table 1B). Follow steps 1.5.1–1.5.7 for each site.\nNOTE: This step is performed only when a targeted mutagenesis is used. If doing random mutagenesis, skip steps 2-3 and proceed to section 3 instead. In the presented example all sites were introduced upstream of the targeted regions, but they can be introduced downstream as well.\nDesign primers for the amplification of the ESC (Table 1C).\nDesign a reverse primer binding downstream of the endonuclease ORF that will introduce the selected recognition site (R1) and its shorter version (R2) that binds outside the selected NlaIV sequence and contains biotin at the 5' end (see Figure 1).\nDesign a forward primer (F1) binding to the ESC upstream of the T7 promoter. This primer should also introduce counterselected variant(s) of the original recognition sequence (i.e., the maximum of sequence variations recognized by the original enzyme with the exception of the selected reverse sequence).\nNOTE: A shorter version of this primer (F2) that covers the sequence distal to the counterselected sequence will be used later in the selective PCR (step 5.9).\n2. Split-and-mix Synthesis of Mutagenic Primers",
    "NOTE: This step is used only for projects that require subsaturation mutagenesis at more than one site. A synthesizer with multiple synthesis columns is required. Assign columns for synthesis of randomized NNS codon triplets and wild type codon triplets according to the mutagenesis frequencies. For example, if seven equal volume synthesis columns are available, and a mutagenesis rate of 0.3 is desirable at a given site, add randomized NNS codons in ~0.3 x 7 or two columns, and wild type codons in ~0.7 x 7 or five columns (Figure 3).\nDecide about sites for subsaturation mutagenesis. Choose mutagenesis frequencies according to the hypothetical importance of the sites (i.e., the more important the site, the higher the frequency), keeping limits on the overall library complexity in mind (see Discussion).\nSynthesize oligonucleotides in all columns, up to the triplet immediately preceding the second subsaturation mutagenesis site counting from the 3'-end. Do not remove the 5'-trityl protecting group at the last synthesis cycle (use the trityl-on option on the synthesizer). The protecting group will be removed at the beginning of the next synthesis cycle (step 1 in Figure 3).\nOpen the synthesis columns. Collect controlled pore glass (CPG) synthesis support into a dry 1.5 mL tube and mix by vortexing. Repartition the mixed CPG resin into new synthesis columns. Avoid introducing humidity, because it will decrease the overall yield (steps 2 and 4 in Figure 3).",
    "Continue synthesis, starting from the subsaturation mutagenesis site triplet. Assign columns to randomized NNS triplets or wild type triplets according to the desired mutagenesis frequency (see note above). If additional subsaturation sites are present, proceed only to the triplet preceding the next subsaturation mutagenesis site. Again, leave a 5'-trityl group on at the end (5'-trityl-on option on the synthesizer) (step 3 in Figure 3). Then continue with step 2.3.\nIf no more subsaturation sites are present downstream, complete the synthesis, leaving a 5'-trityl group at the end (5'-trityl-on option on the synthesizer) (step 5 in Figure 3).\nDeprotect and purify the oligonucleotide library according to the purification cartridge manufacturer's instructions.\nNOTE: Oligonucleotides released by deprotection from the CPG can also be purified in the reverse phase high performance liquid chromatography (HPLC) with trityl-on followed by a manual trityl group removal (1 h treatment with 80% acetic acid at RT) and a second HPLC purification.\nCheck the oligonucleotide library quality in a urea-PAGE gel.\n3. Generating Variant Libraries\nNOTE: Use the recombinant plasmid from step 1.6.\nGenerate the libraries by oligonucleotide directed mutagenesis.\n\tNOTE: Alternatively, use the EP-PCR protocol (step 3.2).\n\t\nAmplify a section from the T7 promoter to the unique restriction enzyme site flanking the sequence targeted with mutagenesis (in case of NlaIV: SalI, EcoRI, or Eco52I) (Table 1B-C, Table 2B, Figure 4). Amplify the second part from the unique restriction enzyme site to the 3' end of the ESC.\nMix separately 5 µL of the PCR reactions (from step 3.1.1) with 8 µL of water, 1.5 µL of 10x restriction enzyme buffer, and 5 units of the appropriate restriction enzymes (SalI, EcoRI, or Eco52I) and incubate at the appropriate temperature for 2 h.",
    "Resolve the products of both reactions using agarose gel electrophoresis. Cut out the expected size bands and purify with a commercial kit.\nRun up to 1/3 of the purified products in an agarose gel and measure the concentration of each purified band by densitometry.\nSet up the ligation of two parts of the ESCs in a 1:1 molar ratio with 1x ligase buffer and 1 U of T4 DNA ligase and incubate for 2 h at RT.\nResolve the reaction products in the agarose gel. Cut out the expected size products and purify with a commercial kit.\nAmplify the purified ligation products in a PCR reaction with primers F1 and R2 (Table 1C and Table 2A). Do not run more than 20 amplification cycles.\nFractionate the PCR reactions in an agarose gel. Cut out the products and purify with a commercial kit.\nRun a 5 µL aliquot of the purified library from the previous step in the agarose gel and measure the concentration by densitometry.\nClone a small sample of the library (up to 5 µL) and sequence >15 clones to check the mutation frequency and distribution (Table 3). Proceed to step 4.\nNOTE: Alternatively, high throughput sequencing of the small sample of the ESCs can be used.\nPerform EP-PCR.\nAmplify the ESC from the plasmid obtained in step 1.5.7 with primers F1 and R1. Run 20 cycles with Taq I polymerase (Table 1B).\nGel purify the PCR product.\nSet up EP-PCR with 2 ng of purified PCR product from the previous step and run 15 cycles of EP-PCR (Table 1C) with F1 and R1 primers.\nGel purify the product and quantify it by gel densitometry.\nNOTE: Due to the low concentration of the purified EP-PCR product use about 1/3 for quantification.",
    "Clone a small sample of the library (up to 1/5) and sequence >15 clones to check mutation frequency and distribution (Table 4).\nNOTE: Alternatively, perform high-throughput sequencing of the small sample of the ESCs.\n4. Performing Compartmentalized In Vitro Transcription-translation Reaction\nTest endonuclease expression and enzymatic activity in in vitro transcription-translation.\nPrepare a short (200–500 bp) substrate with a single recognition site for the endonuclease located close to the center of the molecule so the cleavage reaction can be easily detected.\nNOTE: The easiest way to prepare the substrate is by PCR amplification of an appropriate fragment of any DNA molecule. The substrate can be radiolabeled or fluorescently labeled to simplify cleavage detection.\nSet up 50 µL of a transcription-translation reaction with 0.5 µg of wild type ESC according to manufacturer's recommendations. Add magnesium salt (MgCl2, MgSO4, and magnesium acetate can be tested) to 1.5 mM and the appropriate amount of substrate from the previous step (at least 0.5 µg in case of unlabeled DNA).\nNOTE: Any transcription/translation kit that does not contain nuclease activated by magnesium can be used. Some kit vendors use nucleases to remove DNA contamination during production and then add chelators as nuclease inhibitors. Such kits are not compatible with this method.\nIncubate the transcription-translation reaction according to the manufacturer's instructions. Then transfer the reaction mixture to the optimal temperature for the restriction enzyme for 2 h.\nAnalyze cleavage of the substrate in an agarose gel followed by appropriate detection (e.g., DNA staining, fluorescence visualization, or autoradiography) (Figure 5).\nNOTE: At least partial cleavage of the substrate is necessary before proceeding with the compartmentalization. If this is not achieved, further optimization of the magnesium chemical form or its concentration is necessary.",
    "Prepare an oil-surfactant mixture by adding 225 µL of Span 80 and 25 µL of Tween 80 to 5 mL of mineral oil in a 15 mL conical tube. Mix thoroughly by gentle inverting the tube 15x.\nFor each library transfer 950 µL of the oil-surfactant mixture to a 2 mL round bottom cryogenic vial, label with a library name, and transfer to ice. Put one small cylindrical stirring bar (5 x 2 mm2) into each vial.\nPrepare an in vitro transcription-translation reaction mixture (50 µL for each library) according to the manufacturer's suggestions. Supplement the mixture with magnesium chloride to a final concentration of 1.5 mM (see step 4.1.4).\nDispense 50 µL aliquots into 1.5 mL tubes on ice.\nAdd 1.7 fmole of the library (from section 3) to the reaction mixture on ice.\nNOTE: Do not use a higher amount of expression library for selection efficiency. It is crucial to minimize the frequency of aqueous droplets containing more than one DNA molecule.\nPrepare water-in-oil emulsion consecutively for each library.\nPut a small beaker (or large bottle cup) filled with ice on a magnetic stirrer with the stirring speed set at 1,150 rpm.\nTransfer a cryogenic vial with 950 µL of oil-surfactant mixture and a small stirring bar from step 4.3 to an ice-cold beaker on the magnetic stirrer. Check that the stirring bar is spinning.\nAdd five 10 µL aliquots of the in vitro library-transcription-translation mixture over a 2 min period in 30 s intervals and continue stirring for an additional minute. Transfer the vial with the emulsion to an ice container. Proceed with the next library starting with step 4.7.2.\nAfter all the libraries are processed start the incubation of all the libraries according to the kit manufacturer's recommendations.",
    "Transfer the vials to the temperature optimal for the engineered endonuclease for an additional 2 h and then put them on ice for at least 10 min.\n5. Continued Processing of Libraries and Selection\nTransfer the emulsions from the cryogenic vials into cold 1.5 mL tubes, add 1 µL of 0.5 M EDTA and centrifuge them at 13,000 x g for 5 min at room temperature.\nRemove the upper oil phase with a pipette. If an oil-water interphase is not visible, incubate the tube for at least 5 min at -20 °C to freeze the aqueous phase, then immediately pipet out the liquid oil phase.\nAdd 100 µL of 10 mM Tris HCl pH 8.0 and immediately perform extraction with 150 µL of phenol:chloroform (1:1 v/v) by short vortexing followed by phase separation by 30 s centrifugation at 13,000 x g. Collect the upper aqueous phase.\nPrecipitate the DNA by adding 0.1 vol (15 µL) of 3 M sodium acetate (pH = 5.2), 2.5–5 µg of glycogen and 2.5 vol (375 µL) of ethanol. Incubate at -20 °C for 1 h and centrifuge for 15 min at 13,000 x g, 4 °C. Discard the supernatant and briefly wash the pellet with 1 mL of cold 70% ethanol.\nDry the DNA/glycogen pellet in a speedvac or air dry for >5 min.\nDissolve the pellet in 50 µL of 10 mM Tris-HCl (pH = 7.5). Add 5 µL of streptavidin magnetic beads prepared according to the manufacturer's instructions and mix for 1 h at RT, preferably in a carousel mixer or by gentle vortexing.\nSeparate the beads on a magnetic stand and collect the liquid enriched in DNA without biotin.\nConcentrate the DNA by ethanol precipitation (steps 5.4–5.5).",
    "Dissolve the concentrated DNA from the previous step in 5 µL of water and use as a template in a PCR reaction with F2 and R1 primers (Table 1A).\nNOTE: To avoid problems with template contamination and minimize PCR artifacts use Taq polymerase (not Pfu or Phusion) and run 18–20 cycles with the extension time proportional to the template size (1 kb = 1 min) (see Table 2B).\nFractionate the PCR product in an agarose gel and cut out the expected size product. Some smearing indicates that there are products of different sizes (see Figure 6). Purify the DNA from the gel slab with a commercial kit.\nRun a second PCR reaction with up to 50 ng of DNA from step 5.10 and primers F1 and R2 using the same protocol as in step 5.9. Proceed with product purification as described in 5.10. Purified DNA after quantification by agarose gel densitometry (not UV spectroscopy) can be used in the next round of in vitro selection (step 4.6).\n6. Screen variants for Altered Sequence Specificity\nClone selected variants.\nDigest the product from step 5.10 for 2 h with 10 U of restriction enzymes appropriate for cloning of the ORF into the expression vector (for NlaIV: NcoI and XhoI) in the temperature and buffer recommended by the enzyme vendor. Resolve the products with agarose gel electrophoresis and isolate the expected size fragment.\nPrepare the plasmid vector (e.g., pET28) by double cleavage with the same enzymes as in step 6.1.1 and gel purify the product with a commercial DNA gel purification kit.\nEstimate the concentrations of vector and insert by densitometry with agarose gel electrophoresis.",
    "Set up a ligation with 1–5 U of T4 DNA ligase and vector:insert molar ratio 1:3–1:5 in 1x ligase buffer recommended by the enzyme vendor. Incubate for 2 h at RT and introduce into appropriate host bacteria (from step 1.3) by transformation or electroporation12.\nSelect extransformants on LB plates containing the appropriate antibiotic (50 µg/mL of kanamycin for pET28 or pET30 vectors) and 1% glucose.\nExpress protein variants.\nInoculate single colonies from the transformation (up to 24 clones can be easily processed in a single run) into 2 mL of LB with kanamycin (50 µg/mL) and 1% glucose and grow overnight at 37 °C with shaking.\nInoculate 15 mL of warm (37 °C) LB containing 100 µg kanamycin and no glucose with 0.75 mL of the overnight culture and incubate at 37 °C with vigorous shaking.\nNOTE: Either 50 mL centrifuge tubes or 100 mL Erlenmayer flasks can be used.\nAdd 176 µL of glycerol to 1 mL of overnight culture (final concentration of glycerol = 15%) mix thoroughly and freeze at -70 °C.\nAfter 2–3 h supplement 15 mL of the culture (from step 6.2.1) with IPTG to 1 mM and culture for an additional 5 h.\nCollect the bacterial pellet by centrifugation (10,000 x g, 4 °C, 10 min) and freeze at -70 °C.\nPurify the protein variants.\nTransfer 20 µL of nickel affinity resin suspension into 200 µL of B1 buffer in a 1.5 mL tube with a wide bore pipette tip, mix gently, and centrifuge (5,000 x g, 30 s, 4 °C). Remove the supernatant by pipetting and leave the tube on ice.\nResuspend the bacterial pellet from step 6.2.5 in 300 µL of B1 by vigorous vortexing. Transfer the suspension into a 1.5 mL tube.",
    "Add 3 µL of 100x protease inhibitor cocktail and lysosome solution in B1 (final concentration of 1 mg/mL). Disintegrate the cells by sonication with a tip equipped probe. Use six 10 s bursts per sample with >15 s tip cooling time in ice in between. Keep cell suspensions on ice all the time.\nPellet cell debris by centrifugation (2 min, 12,000 x g, 4 °C) and transfer 250 µL of supernatant to the resin aliquot from step 6.3.1.\nMix for 15 min in a cold room, preferably in a carousel mixer or by gentle vortexing.\nCentrifuge (5,000 x g, 30 s, 4 °C) and aspirate the supernatant with a pipette.\nAdd 500 µL of W buffer and gently resuspend the resin. Centrifuge (5,000 x g, 30 s, 4 °C) and aspirate the supernatant with a pipette.\nRepeat step 6.3.7.\nAdd 20 µL of buffer E, gently resuspend the resin, and leave the sample on ice for 2–5 min. Centrifuge (5,000 x g, 30 s, 4 °C) and collect the supernatant.\nRepeat step 6.3.9. Pool supernatants.\nAnalyze protein samples in by SDS-PAGE (5–10 µL) (Figure 7).\nScreen for variants with the altered specificity.\nAssay cleavage activity on bacteriophage lambda DNA. The protein sample can constitute up to 10% of the final reaction volume. A total of 2 µL of protein sample per 0.5 µg of DNA and 2 h reaction time is a good starting point.\nAnalyze the reaction products by agarose gel electrophoresis along with the products generated by the wild type enzyme. Select the clones generating cleavage patterns clearly distinguishable from the one generated by the wild type enzyme for further analysis (Figure 8)."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}