{
  "id": 5240,
  "origin_website": "Bio",
  "title": "Transformation of <em>Thermus</em> Species by Natural Competence",
  "procedures": [
    "Culture preparation: growth of the subject strain to be transformed (see Figure 2).Inoculate 50 μl of saturated liquid growth culture (optical density at 600 nm [OD600] aprox. 2) in 10 ml TB medium in a 50-ml Erlenmeyer or inoculate the culture from the glycerol stock or from a frozen pellet. In the latter cases, one additional day growth would be required to reach optimal culture fitness.Incubate overnight the culture at 65 °C in a shaker incubator at 150 rpm.Dilute the overgrown culture in 10 ml fresh TB medium to OD600 = 0.05 in a 50-ml Erlenmeyer.Notes:  If the culture has not reached saturation after overnight growth, postposition of the experiment is highly recommended.If the culture has not grown optimally overnight and the experiment should be performed, a starting OD600 of 0.07-0.08 is possible.Incubate in a shaker incubator at 65 °C until an OD600 of 0.3-0.4 is reached.Note: An OD600 close to 0.3 is recommended.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171027/20171027010012_6686.jpgFigure 2. Schematic representation of the Thermus transformation procedure. Plate shows a dilution of a transformation of 100 ng of a linearized plasmid harbouring a kat cassette flanked by two genomic arms for double recombination in HB27 strain.DNA additionAdd 0.01-1 μg of DNA (genomic ~0.01 μg; plasmids ~0.1-0.25 μg; PCR products ~1 μg) in a sterile 12 ml plastic tube. Tubes can be pre-heated at 65 °C.Notes:  Genomic DNA (carrying a selectable marker integrated in the genome) should not be added in higher quantities to avoid recombination farther than the target.DNA samples should be purified following standard protocols and eluted in water or TE.Pre-heating of the tubes keeps the temperature of the growing culture stable.Add 500 μl of the exponentially growing culture (see Figure 2) to the DNA.",
    "As a control, prepare 15 ml plastic tube without DNA, and add 500 μl of the exponentially growing culture to this tube.DNA transformationIncubate each tube in a shaker incubator at 65 °C for 4 h.Plate 50 μl and 400 μl of the cells on selective agar medium, spread by using glass beads or a spreader.Notes: Volume plated depends on the competence efficiency of the employed Thermus strain. Previous assays plating serial dilution spots can shed light on the appropriate volume to plate.Plate the control tube like the others, in addition to plating on a non-selective agar medium, as it will work as the reference of viable cells.Incubate plates in humid chambers for 48 h at 65 °C or until colonies become visible.Notes:Ordinarily, incubation temperature is set according to optimal growth of the strain but it should be adapted to the limitations of the selectable marker employed in the transformations too (for instance, hph5 conferring hygromycin resistance cannot be exposed to temperatures higher than 60 °C whereas kanamycin is selectable in temperatures higher than 70 °C).Transformation yields highly depend on the DNA template employed and the strain being transformed. For instance, HB27 transformed with 100 ng of plasmidic DNA shows rates of 10-3 transformants per viable cell."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}