{
  "id": 6133,
  "origin_website": "Bio",
  "title": "Quantification of the Composition Dynamics of a Maize Root-associated Simplified Bacterial Community and Evaluation of Its Biological Control Effect",
  "procedures": [
    "Surface sterilization and germination of maize seedsPick ten intact maize seeds of no disease symptom and put them in a Petri dish (9-cm diameter) (Figure 1A) with tweezers. Immerse the seeds in 70% (v/v) ethanol for three minutes then remove the ethanol.Immerse the seeds in 5% (v/v) bleach for three minutes then remove the bleach.Rinse the seeds with sterile distilled water three times.Take 250 μl water from the third rinse and spread onto tryptone soya agar (TSA) plates in order to check for contamination.Incubate the TSA plates at 30 °C overnight.Continue with the following steps if there is no microbial colony presenting on the TSA plates, otherwise, discard the maize seeds and repeat Steps A1 to A6 until no colony is detected on the TSA plates.Remove the distilled water from the Petri dish containing maize seeds. Keep the embryos of the seeds up and fill the Petri dish with 7 ml sterile distilled water (Figure 1B). Put the Petri dish containing surface-sterilized seeds in the dark at 30 °C.After an incubation of 24 h, take 250 μl water from the Petri dish and spread onto TSA plates to check for contamination.Incubate the TSA plates at 30 °C overnight.Continue with the following steps if there is no microbial colony presenting on the TSA plates, otherwise, discard the maize seeds and repeat Steps A1 to A12 until no colony is detected on the TSA plates.Remove the water from the Petri dish and refill with 7 ml sterile distilled water. Put the Petri dish back in the dark at 30 °C. After an incubation of 50 to 55 h in total, choose the germinated maize seeds (Figure 1C) with a root of 1-2 cm for the following steps. Note: Perform Steps A2 to A17 in a biological safety cabinet.",
    "Inoculation of bacterial community on maize seedlingsStreak the seven bacterial strains (Stenotrophomonas maltophilia ZK5342, Ochrobactrum pituitosum ZK5343, Curtobacterium pusillum ZK5344, Enterobacter cloacae ZK5345, Chryseobacterium indologenes ZK5346, Herbaspirillum frisingense ZK5347 and Pseudomonas putida ZK5348) on 0.1x TSA plates and incubate at 30 °C for 24-48 h.Inoculate a single colony of each strain in 5 ml of tryptic soy broth (TSB) and shake at 120 rpm at 30 °C overnight.Transfer 50 μl of overnight culture of each strain into 5 ml fresh TSB and shake at 30 °C for another 8 h.Collect the cells in 2.0-ml tubes by centrifuge at 2,940 x g for 10 min at 4 °C.Resuspend the cells in 1x phosphate buffered saline (PBS) and dilute the cell suspensions of each strain to ~108 cells per milliliter (Table 1).Table 1. The OD600 value for each strain corresponding to ~108 cells/mlimgsrc:https://en-cdn.bio-protocol.org/attached/image/20180614/20180614232709_8522.jpgMix the cell suspension of each strain in a 50-ml Falcon tube in equal volume to prepare the multiple species (seven-species or six-species resulting from the removal of each of the seven species, respectively) bacterial suspensions. Soak no more than 30 surface-sterilized and germinated maize seeds with primary roots of 1-2 cm (Figure 1C) in 30 ml multiple species bacterial suspensions in a Petri dish (Figure 1D) without shaking at room temperature for 0.5-1.0 h. Move the seeds to make sure the roots are completely submerged in the suspensions. Soak another 10 surface-sterilized and germinated seeds in 1x PBS buffer for 0.5-1.0 h and use as a control. Transfer the maize seeds adhered by bacteria and sterile seeds onto 20 ml ½ Murashige and Skoog (MS) agar (0.8%) in glass tubes (16 x 150 mm) by sterile forceps. Press the seeds gently with the forceps to insert the primary roots into the agar (Figure 1E).",
    "Use the sterile empty glass tubes of the same size to close the tubes containing the seeds in a mouth-to-mouth way. Connect and fix the two tubes by parafilm (Figure 2A).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180614/20180614232316_8835.jpgFigure 1. Maize seeds. A. Dry seeds; B. The seeds after surface-sterilization; C. Surface-sterilized and germinated seeds; D. Surface-sterilized and germinated seeds soaked in suspensions of multiple bacterial species in a Petri dish; E. Surface-sterilized and germinated seeds with/without bacteria sitting in ½ MS agar. Scale bars = 1 cm.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180614/20180614232403_1512.jpgFigure 2. Growth of axenic maize seedlings. A. The double-tube growth chamber. The parafilm is used to hold the two glass tubes together. B. The axenic maize seedlings of different ages grown in the double-tube growth chambers.Place the maize seedlings in double-tube chambers under the following conditions: 16 h of light (day) and 8 h of dark (night), 4,000 lx, 25 °C and a relative humidity of 54%. Keep the maize seedlings under the above conditions for 15 days.Note: Perform the Steps B1 to B8 in a biological safety cabinet or close to a flame. Quantification of the compositions of the bacterial communities colonized on maize rootsSample three to five maize seedlings inoculated with each of the eight bacterial communities (one seven-species and seven six-species communities) at day 5, day 10 and day 15 after inoculation.Cut the root from each maize seedling with a sterile scalpel blade (Video 1).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Sampling root fragments from maize seedlings Rinse the root in sterile 1x PBS buffer quickly to remove the agar adheres to the root surface.Harvest a 1-cm-long primary root fragment below maize kernel by cutting the primary root with a sterile scalpel blade.Remove the lateral roots on the root fragment with the sterile scalpel blade.Transfer the root fragment into a 1.5-ml centrifuge tube with two sterile 200-μl pipette tips.",
    "Put six glass beads (diameter: 3 mm) in the tubes and add 1 ml sterile 1x PBS buffer.Dislodge the bacterial cells colonized on the root surfaces by sonicating (amplitude: 30%; pulse: on 01 sec, off 01 sec; time: 30 sec) for 1 min, then by vortexing for another 1 min. Repeat the Step C8 twice. Put the tube on ice for 1 min.Add 180 μl sterile 1x PBS buffer in one lane (8 wells) of a 96-well plate (Video 2).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Diluting bacterial suspension and plating Put 20 μl bacterial suspension obtained in Step C9 in the first well of the lane and mix by sucking and excluding the suspension with a pipette.Take the root fragment out with a pair of forceps, dry the fragment with paper wipers, then weigh it on a balance and record the weight of the root fragment.Transfer 20 μl well mixed bacterial suspension from the first to the eighth well sequentially to get 10 to 108 times dilutions of the bacterial suspension.Take 10 μl diluted bacterial suspension from each of the eight wells and spot on three selective 0.1x TSA plates (Table 2) for each strain with a multichannel pipette.Table 2. Supplements in the selective medium and incubation time for each strainimgsrc:https://en-cdn.bio-protocol.org/attached/image/20180614/20180614233523_7600.jpgTilt the plates to make the bacterial suspension drops move toward one direction to spread the cells on agar surfaces.Air-dry the selective 0.1x TSA plates spread with the bacterial suspensions.Incubate the plates at 30 °C in the dark for 16 to 60 h (Table 2). Count and record the numbers of the Colony Formation Units (CFUs) (Figure 3A) on the selective plates.Use the CFU numbers between 10 and 200 (Figure 3B) to calculate the bacterial abundances:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180614/20180614233625_4257.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20180614/20180614233712_5262.jpgFigure 3. Colonies of the seven bacterial strains of the simplified community. A.",
    "Morphology of the colonies of each of the seven bacterial strains grown on the plain and selective 0.1x TSA plates. ‘P’ and ‘S’ designate the plain 0.1x TSA plates and the selective 0.1x TSA plates, respectively. B. Colonies of O. pituitosum grown on the selective plates. From left to right, the four lanes of colonies were formed through the growth of the cells in 104-, 103-, 102- and 10-times diluted bacterial suspensions, respectively. The CFUs (Colony Formation Units) numbers of the two lanes framed are fit for the quantification of bacteria.Calculate the relative abundance of each species in the communities.Perform the Steps C2 to C16 in a biological safety cabinet or close to a flame.Watch Video 1 for details of Steps C2 to C7.Watch Video 2 for details of Steps C10 to C16.In vivo assay for the inhibitory effect of bacterial community against F. verticillioidesNote: Perform the Steps D1 to D10 in a biological safety cabinet or close to a flame. Place an F. verticillioides MRC826 mycelial disk of 0.5-cm diameter at the center of a potato dextrose agar (PDA) plate and incubate at 28 °C for 7 days until the mycelia cover the whole plate.Put 20 ml sterile 1x PBS buffer in the F. verticillioides colony grown on a PDA agar plate.Harvest the fresh spores with a cell scraper.Filter the F. verticillioides spore suspension through eight layers of sterile gauze.Dilute the spore suspension and count the spores using a hemacytometer under a microscope.Adjust the concentration of spores to ~108 spores per milliliter sterile 0.01% (vol/vol) Tween 20. Store the suspension at 4 °C.Dilute the suspension to ~106 spores per milliliter sterile 1x PBS buffer. Inoculate the spores by spreading on the trays (~103 CFU/cm2) containing 20 ml 2.25% (wt/vol) water agar.",
    "Soak 10 surface-sterilized maize seeds (Figure 1B) in a 30 ml suspension of the seven-species bacterial community, each single species of the community, or Escherichia coli DH5α in a Petri dish for 0.5-1.0 h. Soak another 10 surface-sterilized seeds in sterile 1x PBS for 0.5-1.0 h and use as a control.Put the seeds on the surfaces of water agar in trays with sterile forceps.Put the trays in the dark at 23 °C for 10 days.Count and record the number of seeds showing visible fungal mycelia (Figure 4A) in each treatment every day. Calculate the fungi colonization rate as:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180614/20180614234504_5961.jpgTake photographs of mycelial growth on the surface of each seed on day 4 and day 10 after incubation using a dissecting microscope (Figure 4B).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180614/20180614234606_7319.jpgFigure 4. The maize seedling co-inoculated with the seven-species simplified bacterial community and F. verticillioides. A. A ten-day-old maize seedling inoculated with the bacterial community grown on water agar spread with fungal spores. The white spots on the agar are the mycelia developed from the spores. B. The enlargement of the seed in (A) indicated by the two yellow dash lines. The white hairs on the seed are mycelia colonized on the surface of seed (scale bar = 2 mm).Evaluate the severities of maize seedling blight disease for each treatment on day 10 by calculating the disease severity indices based on the ranks described previously (Niu et al., 2017) following the formula (Sherwood and Hagedorn, 1958):imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210711/20210711205023_0241.",
    "jpgThe disease ranks were established as follows: rank 1 = no visible fungal mycelia grow on the surfaces of kernels, and tan lesions are present on the roots; rank 2 = the surfaces of kernels are partially covered by fungal mycelia, and tan lesions are present on the roots; rank 3 = the surfaces of kernels are partially covered by fungal mycelia, and tan to brown lesions are present on the roots; rank 4 = the surfaces of kernels are fully covered by fungal mycelia, and tan to brown lesions are present on the roots; rank 5 = the surfaces of kernels are fully covered by fungal mycelia, and reddish brown lesions are present on the roots (Niu et al., 2017)."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}