{
  "id": 18478,
  "origin_website": "Jove",
  "title": "A Neonatal Mouse Spinal Cord Compression Injury Model",
  "procedures": [
    "This experimental protocol has been approved by the National Animal Research Authority in Norway (Forsøksdyrutvalget, local experimental approval number 12.4591) in compliance with European Union animal care regulations (Federation European Laboratory Animal Science Association). Efforts were made to minimize the number of animals used and their suffering. In this article the procedure used on postnatal (P) day 1 wild-type ICR (Imprinting Control Region) mice (Jackson, USA) is described but the same approach can also be used at later stages.\n1. Constructing a Gas Anesthesia System for Neonatal Mice (Figure 1)\nBuild a nose-mask from the tip of a syringe. Connect this to the 3-way stopcock with plastic tubing (Figure 1 - red tubing and Figure 2A1).\nDrill a small hole in the side of the nose mask and connect this to plastic tubing to remove the overflow of gas from the mask. End the tubing either at a vacuum pump set for a slight negative pressure, or in a fume hood (Figure 1 - bright green tubing).\nMake an anesthesia chamber from a 150 mm x 25 mm plastic Petri dish (Figure 2A2).\n\t\nOn one side, make a hole large enough to accommodate the head of the mouse and the nose mask.\nOn the opposite side, make two smaller holes through which the plastic tubes to and from the nose mask can be inserted (Figure 1 - red and bright green tubing, respectively).\nMake a third hole on the top of the lid and attach to this a third plastic tube that ends at the vacuum pump (Figure 1 - dark green tubing). The purpose of this third tube is to ensure that any excess gas that has not been captured by the outlet from the nose mask is removed.",
    "Build a sleep chamber by making a hole in the bottom of any kind of lab dish that is large enough to contain the mouse and has a smooth and even edge (the opening of the dish must lie flush with the table to prevent leakage of gas). Connect the hole in the chamber to the 3-way stopcock with plastic tubing (Figure 1 - brown tubing). Place the sleep chamber under a fume hood.\nConnect a 3-way stopcock to the outlet tube from the vaporizer (Figure 1 - yellow tubing and Figure 2A3).\nConnect the inlet of the vaporizer to the oxygen supply (Figure 1 - blue tubing).\n2. Modification of a Yasargil Temporary Aneurysm Mini-clip to Create the Compression Tool (Figure 2 and Table 1)\nAffix the clip firmly to a stand with a clamp. Using a binocular loupe for visual control, file down the outer surface of the tip of each clip blade to a final thickness of about 150 µm using a sharpening stone mounted on a drill (Figure 2B and C).\nMake a stopper for the clip by cutting a short stretch of polyethylene capillary tubing (Table 1) under a stereomicroscope using a micro-knife (Table 1), and place this on one of the blades (Figure 2A4 and Figures 2B and C). This prevents full closure of the clip and creates standardized compression dimensions. When the clip is closed the interblade distance is about 230 µm. Make a new stopper for each experiment as the polyethylene material may compress during use, which would alter the interblade space.\n\tNote: The spring tension of the clip diminishes over time such that after about 80 compressions the clip no longer closes fully to the stopper and needs to be replaced.\n3. Preparation Prior to Surgery",
    "Place the mouse in the sleep chamber (Figure 1) and initiate anesthesia with 4% isoflurane (Figure 2A5) vaporized in pure oxygen, using a vaporizer (Figure 2A3 and Table 1).\nTest the withdrawal reflex of the mouse by gently pinching the web of skin between the toes with a thin plastic forceps. Do this carefully as new-born mice are easily injured. Pinching too hard results in immediate bruising. Performing this test at the beginning of the sedation triggers the reflex and provides a good indication of the amount of force necessary.\nOnce the reflex is abolished, remove the mouse from the sleep chamber and place it in a prone position on the operating table with the snout inserted into the nose mask that provides a continuous supply of 4% isoflurane mixed in pure oxygen (Figure 1). Ensure that the warming pad is switched on and set to 37-38 °C as hypothermia during surgery can be fatal.\nTo achieve complete analgesia, inject subcutaneously 50 µl of the local anesthetic Bupivacain (2.5 mg/ml, Figure 2A6) at the surgery site (in the experiments reported here, this is at thoracic level (T)9-T11). Use an insulin syringe (300 µl, 30 G, Figure 2A7 and Table 1) to perform the injection.\nReduce the isoflurane concentration delivered to the nose mask to 1-2%.\n4. Dorsal Laminectomy\nPerform surgery under microscopic control.\nAfter cleaning the surgery area with chlorhexidine gluconate (Table 1 #19) for at least 30 sec, make a 1-2 mm transverse skin incision at T9-T11 using a microknife (Figure 2A8).",
    "Note: In ICR neonatal mice the rostral part of the stomach, visible when it contains milk, is facing the vertebral levels T12-T13 (Figure 3). Another landmark is the rostral part of the thoracic subcutaneous adipose tissue aggregate which ends at about T8-9. This landmark is only visible after skin incision.\nUse forceps (Figure 2A9 and A10) to widen the skin opening in a transverse direction to 8-9 mm by pulling the skin gently rostrally and caudally (the skin tears easily, creating a smooth and straight wound). This provides sufficient lateral access to the spinal column.\nRetract the edges of the skin incision from underlying structures by inserting sterile pieces of hemostatic gelatin sponge (Figure 2A11 and Table 1) subcutaneously rostral and caudal to the incision. This enlarges the opening and prevents the skin from retracting and obscuring the area during surgery. The hemostatic gelatin sponge does not need to be soaked in saline prior to use.\nTo expose the spine, dissect the paravertebral muscles using thin scissors (Figure 2A12, and Table 1). Cut the attachments of the muscles to the vertebral column and expose the lamina (Figure 4A). Note also that at this stage the spinal process is underdeveloped.\nIdentify the midline and cut transversely between the two laminae (which at this stage is cartilaginous) with thin scissors (Figure 4B). Carefully place one blade of a thin forceps between the lamina and the dura (Figure 4C), grasp the lamina with the forceps and lift it carefully up until a piece breaks away, leaving the dura intact (Figure 4D). Repeat this 2-3 times to obtain a 1-2 segment long laminectomy.",
    "Using the thin forceps as rongeurs, remove parts of the facet joints bilaterally to gain enough space to place the clip within the vertebral canal. Clean the surgical area and control bleeding with small pieces of hemostatic gelatin sponge.\n5. Spinal Cord Compression Injury\nOpen the modified aneurysm mini-clip in the clip holder (Figure 2A13 and Figure 2B) and place the blades on either side of the spinal cord in the spaces between the facet joins and the cord. Make sure that the blades are inserted deeply enough to affect the ventral part of the spinal cord. If this is not possible, remove more of the facet joints.\nRelease the mini-clip rapidly, holding it in place with the clip holder to prevent it from sliding. Maintain the compression for 15 sec.\nOpen the mini-clip rapidly and remove it. To achieve a symmetrical compression, reverse the orientation of the mini-clip, and using the easily seen mark made by the haemorrhagic edema from the first compression as a guide, reposition the clip in the reverse orientation for a second 15-sec compression (prior experiment showed that this generates symmetrical histological and physiological deficits, whereas single compressions do not1). The dura should not be damaged by the compression.\nClean the area and maintain hemostasis with pieces of hemostatic gelatin sponge.\nRemove the pieces of hemostatic gelatin sponge that were placed under the edges of the skin incision at the start of the surgery and close the skin incision with sterile 6.0 suture and a needle holder (Figure 2A14 and 15).\nInject subcutaneously 0.75 mg/kg body weight Buprenorphine (Figure 2A16) diluted in sterile PBS using an insulin syringe (300 µl, 30 G).\n6. Postoperative Care",
    "Remove the mouse from the nose mask and place it in a temperature-controlled chamber set at 30 °C until the anesthesia wears off and the mouse becomes alert (1-3 hr is typically sufficient).\nInject Diazepam (Figure 2B17) intraperitoneally into the mother (8 g/kg body weight). This creates a torpor that diminishes the risk of cannibalism during the first night, when this risk is highest.\nReturn the operated mouse to the litter.\nIf the litter is large (>12 pups), remove some of the unoperated pups, preferentially the larger animals if they differ in size, to reduce competition for the milk. Maternal care of the operated pups is best in the ICR line if the litter size is around 9 pups.\nFor pain management, administer Buprenorphine (0.75 mg/kg body weight) subcutaneously once a day during the first postoperative days, using an insulin syringe (300 µl, 30 G). An appropriate volume for subcutaneous injection is 30-50 µl. In neonatal mice vocalization and agitation are good indicators of pain.\nPerform a daily examination of the injured mice using a score sheet to evaluate nutrition, body weight, dehydration, pain, wound healing, urine retention and infection status. According to the score obtained, provide special care, such as injections of a sterile pediatric nutrition solution (Table 1 #18) in case of abnormal nutrition. The score sheet also defines humane endpoint criteria. A mother that does not reject the injured pups is the best caregiver.\nIn the unusual case of bladder dysfunction, perform bladder massage twice a day until function is restored. This is done by placing the mouse in a supine position in one hand and massaging the lower abdomen gently in a rostro-caudal direction using a fingertip."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}