{
  "id": 5640,
  "origin_website": "Bio",
  "title": "Behavioral and Functional Assays for Investigating Mechanisms of Noxious  Cold Detection and Multimodal Sensory Processing in <em>Drosophila</em> Larvae",
  "procedures": [
    "Cold plate assayNote: The following procedure describes how noxious cold stimulus is delivered to the ventral surface of D. melanogaster larvae. Larvae are placed on a black metal plate, to enable high contrast imaging of larvae, allowed to resume locomotion and then exposed to noxious thermal stimulus by placing the black metal plate on a chilled Peltier plate. The benefit of using this assay to assess noxious cold evoked behavioral responses is that this assay exposes the entire ventral surface of the animal to noxious cold stimulus and the behavior can be quantitatively assessed (see Data analysis section).  Cold plate assayPrepare genetic cross of interest with approximately 30-40 virgins and 20-25 males. Place the vial in 29 °C. Allow adult flies to mate for two days and then transfer to a new vial to perform a timed egg collection for 4-6 h at 29 °C. After 4-6 h remove adult flies and age the vial to 96-102 h after egg lay (AEL) corresponding to the third instar larval stage of development. Behavioral assays should be performed in a diffusely lit room.At 96-102 h AEL, turn on the Peltier cold plate and set to desired temperature (6 °C). Allow few minutes for the plate to reach desired temperature and critically, make sure that the plate is able to hold desired temperature as measured with an infrared thermometer.Note: At 6 °C make sure to wipe off excess condensation.Turn on recording equipment, Nikon DSLR and lens set to 55 mm placed roughly 18 cm above the focal plane of the plate. Select 6-9 third instar larvae (Figure 1A) at a time with a brush for cold plate assay and rinse them gently with tap water in a 9-well glass spot plate. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170703/20170703025018_9552.jpgFigure 1. Set up of cold plate assay. A.",
    "High magnification image of Drosophila third instar larva (scale bar represents 1.7 mm); B. 1. Nikon DSLR camera mounted on tripod, 2. TE Technology Peltier plate, 3. TE Technology temperature controller, and 4. TE Technology power supply. C. Cold plate assay of w1118 third instar larvae exposed 6 °C at 0 sec; D. Cold plate assay of w1118 third instar larvae exposed to 6 °C at 3 sec. Larvae exhibit contraction (CT) behavior in response to noxious cold stimulation.Quickly, transfer them to a wet Kimwipe.Apply a thin fine mist of water via a trigger sprayer on a black metal plate. Note: Too much water on the plate will create noise during the ImageJ/Fiji quantification steps.Using a brush gently pick up each larva and place them on the metal plate. After all the larvae have been placed on the plate, allow roughly 30 sec for the larvae to acclimate and resume peristaltic movement on the plate.Note: Make sure there are no residual food particles on larvae, excess water has not accumulated around the larvae, and there is enough space between larvae (Figure 1B). Place the metal plate on the Peltier plate very gently so that light touch stimuli do not confound noxious thermal assay. Record the animals for up to 30 sec at 30 frames per second (Figure 1B and Video 1).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Cold plate assay. Video of a cold plate assay setup.Repeat until desired number of larvae are recorded.Representative image stills (Figures 1C and 1D) and videos of baseline larval behavior at 25 °C (Video 2) and in response to noxious cold stimulation (6 °C) (Video 3). At baseline temperature (25 °C) larvae exhibit peristaltic locomotion and head turning behavior consistent with surveying their environment, whereas upon noxious cold stimulation (6 °C), larvae exhibit bilateral anterior-posterior contraction (CT) behavior.",
    "<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Larval behavior at baseline temperature. Video of w1118 larvae at 25 °C.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 3. Larval behavior in response to noxious cold. Video of w1118 larvae at 6 °C.In vivo calcium imaging via GCaMPNote: We designed an experimental paradigm for imaging transient calcium responses in live intact D. melanogaster larvae using modern confocal imaging and fluorescence technology. These novel in vivo analyses are facilitated by investigations of larval md sensory neurons that are located just beneath a semi-transparent cuticle. We use larval md neuron class specific GAL4 drivers to direct the expression of GCaMP6, a transient fluorescent intracellular Ca2+ sensor. To assess in vivo GCaMP responses to noxious cold exposure we delivered stimuli via a Linkam Peltier system. Using this method one can assess GCaMP calcium responses in any PNS neuron in a live animal preparation. Prepare before setting up genetic cross or stock for calcium imaging.Prepare an amber glass dropper bottle containing halocarbon oil #700. This will be used for microscope slide preparation for in vivo imaging. Note: Water will also work, but halocarbon oil #700 has greater viscosity that is ideal for mounting 22 x 22 mm coverslips not moving. Optimize laser confocal microscope time-lapse imaging settings.Notes: Make sure that laser power and gain settings do not saturate the neuron throughout time-lapse acquisition period. Set the highest possible image acquisition rate. At maximum image acquisition rate should be 1 frame per second for proper temporal resolution. Image resolution should be at least 256 x 256 pixel resolution. There will ideally have to be a balance between image resolution and image acquisition rate.Set up genetic cross or stock, as described above for the cold plate assay, prior to calcium imaging and place the vial in 29 °C.",
    "Age embryo collection in food vial to 96-102 h AEL and select third instar larvae for imaging.Set up water circulation system, Linkam PE 120 Peltier stage, mount Peltier stage onto the laser confocal microscope, and turn on confocal microscope (Figures 2A and 2B).Notes: Use double sided tape to mount the Peltier stage onto microscope stage. Allow time for lasers to stabilize and maximal water circulation.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170703/20170703025515_1044.jpgFigure 2. In vivo GCaMP set up, temperature profile and class III md neuron GCaMP response. A. View of water circulation tank (1), temperature programmer (2), temperature controller (3), and Zeiss laser confocal (4). B. Close up of laser confocal microscope stage (1) with Peltier stage (2); C. Close up of how larva is mounted on to the Peltier stage (1) and water circulation pipes (2) connected to Peltier stage; D. Sample temperature profile for GCaMP assay; E. Class III md neuron GCaMP response to noxious cold. Fluorescence intensity is represented as lookup table. There is a large increase in GCaMP fluorescence in response to noxious cold temperature (6 °C) compared to baseline (25 °C).Program the pre-determined temperature profile using the T95 linkpad. Ideally, 2-5 min of baseline at 25 °C, ramp down at 20 °C/min (maximal ramp speed) to desired temperature, hold at desired temperature for at least 10 sec and then ramp up at 20 °C/min to 25 °C and hold for up 1 min (Figure 2D). Note: For multiple noxious thermal stimulations allow at least 1 min at 25 °C for GCaMP signal to return baseline.Prepare microscope slide for calcium imagingObtain one microscope slide, two 22 x 22 mm coverslips, and one 24 x 50 mm long coverslip.Place a small drop of halocarbon oil #700 on both ends of the slide.Place two small coverslips on top of the small droplets.",
    "One at a time shimmy the coverslips, and stop after the coverslip is difficult to move.Using a brush gently pick up one larva, expressing GCaMP in your desired cell type, and wash the larva in a 9-well glass spot plate. Place the larva on a wet Kimwipe.Place the semi-wet larva on the middle of the slide.Note: Depending on laser confocal microscope set up, the orientation of larva will differ either horizontal or vertical compared to the length of the slide.Place a drop of water on top of both the small coverslips. If the larva is not straight on the slide, then use forceps to gently reorient the larva to the preferred direction.Place a 24 x 50 mm coverslip on top of the larva and the two coverslips. Again, shimmy, this time gently, until the larva is completely flat, straight and the desired side of the animal facing up (Figure 2C).Mount the slide containing the larva onto the Linkam PE 120 Peltier stage.Focus onto the region of interest and acquire time-lapse images for duration of thermal cycle.Representative GCaMP response in class III md neuron at baseline (25 °C) and at noxious cold temperature (6 °C) (Figure 2E).Functional assays for multimodal sensory processingRecent studies have revealed class III md neurons function in multimodal sensory processing (Turner et al., 2016). Class III neurons act as noxious cold sensing nociceptors, where the cold evokes bilateral head and tail contraction (CT), and innocuous mechanical sensors, where light touch primarily evokes only a head withdrawal (HW) response (Tsubouchi et al., 2012; Yan et al., 2013; Turner et al., 2016).",
    "We developed an optogenetic dose response assay and implemented the use of the stable calcium integrator CaMPARI to investigate how a single class of md sensory neuron is able to mediate unique behaviors (HW and CT) in response to two distinct sensory stimuli. In the optogenetic dose response assay we titrate the amount of blue light intensity activating class III md sensory neurons, revealing that at high blue light intensities CT is the predominant behavior, whereas at lower blue light intensities HW is the predominant behavior and as expected at the lowest blue intensity, we failed to observe any CT behavior and only a few HW responders (Turner et al., 2016). Optogenetic dose response revealed that level of class III activation determines the behavioral output and suggested that class III neurons are high threshold cold nociceptors and low threshold mechanosensors. To functionally assess how different levels of class III activation lead to distinct sensory behaviors, we examined intracellular calcium responses to gentle touch and noxious cold stimuli. Assessing intracellular calcium dynamics upon light touch, in an intact larvae, posed a technical challenge in the in vivo GCaMP assay. Therefore, we implemented the use of class specific expression of CaMPARI, where the larva is freely behaving and either innocuous mechanical or noxious cold stimuli could be delivered. This technique allowed us to measure the amount of green-to-red fluorescence photo-conversion revealing that noxious cold evokes significantly greater photo-conversion than innocuous mechanical stimulus. Both of these techniques can be used to assess the multimodality of PNS neurons.Optogenetic dose response assayOptimize light delivery and recording systems.Using a Zeiss AxioZoom.V16 microscope vary the light intensity delivered to the animal.While keeping magnification and source of white light constant, change the aperture from 100-37% (Figure 3A).",
    "Note: Preferred aperture settings are 100%, 90%, 80%, 70%, 50% 40% and 37%.Use the dark field illumination setting on the microscope stage. Turn on the LED for bottom illumination, increase the brightness just enough to barely see the larva.Mount recording equipment onto the microscope.Prepare a genetic cross or stock as described above and age embryo collection to 96-102 h AEL prior to optogenetic dose response assay.Prepare ATR supplemented food for optogenetic experimentsFinal concentration of ATR needs to be 1,000 μM.In a dimly lit room, add appropriate amount of ATR in liquefied food, mix thoroughly and allow the food to solidify.Note: Maintain ATR and ATR supplemented food in the dark.For the ATR condition: add the genetic cross/stock to ATR supplemented food containing vial.For the no ATR control condition: add the genetic cross/stock to normal food containing vial. Place both types of crosses in the dark. On day of experimentation.Turn on Zeiss Axiozoom.V16 microscope system. Working in a dimly lit space, using a brush select third instar larvae and wash in a 9-well glass spot plate with tap water. Place the larva on a wet Kimwipe.Spray a thin fine mist of water via a trigger sprayer on a large piece of glass (10 x 15 x 0.1 cm).Place the larva on the center of glass piece. Note: Make sure there is not too much water around the animal, as it will make quantification difficult. Allow animal to acclimate to the plate and resume peristaltic movement. Use a timer for precise blue light delivery and expose the animal to the following blue light on/off cycles (Figure 3B).10 sec off–5 sec on–10 sec off–5 sec on–10 sec off–5 sec on–10 sec off.Executing multiple stimulations per animal will allow within animal comparisons of multiple stimulations.",
    "Repeat the previous step until an N of 20 third instar larvae is achieved for each blue light dose. Quantify changes in length as described in Data analysis section. (Figure 3C and Video 4)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170703/20170703030114_5778.jpgFigure 3. Zeiss AxioZoom.V16 set up for optogenetic dose response and blue light exposure diagram. A. Optogenetic dose response set up in a brightly lit room for demonstration purpose, but conduct the assays in a dimly lit room. 1. Zeiss AxioZoom.V16, 2. Glass plate, 3. Blue light, 4. Aperture control and 5. Dark field illumination. B. Sample blue light on/off time course; C. Image stills of larvae expressing ChETA in class III md neurons being exposed 100% or 66% max blue light. 100% illumination elicits CT behavior (consistent with noxious cold evoked behavior), whereas 66% illumination elicits HW behavior (consistent with gentle touch evoked behavior).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 4. Optogenetic dose response. Video of larvae expressing ChETA in class III md neurons being exposed to either 100% or 66% max blue light.CaMPARI Ca2+ integrator assayAs with GCaMP analysis, optimize red and green fluorescence for live confocal imaging.Optimize photo-converting (PC) light intensity for consistent green to red photo-conversion.PC light is delivered via Zeiss AxioZoom.V16 using previously described filter cube set. Using Zeiss AxioZoom.V16 microscope and HXP200C lamp, deliver 84,000 lux for 20 sec of PC light, which reliably photo-converts CaMPARI from green to red in presence of high calcium.Prepare 1:5 (v/v) ratio of ethyl ether:halocarbon oil #700 solution in an amber glass dropper bottle at least one day prior to imaging.Prepare a genetic cross or stock as described above and age embryo collection to 96-102 h AEL prior to CaMPARI analysis. Prepare microscope slide for calcium imaging.Obtain one microscope slide, two 22 x 22 mm coverslips, and one 24 x 50 mm long coverslip.",
    "Place a small drop of ethyl ether:halocarbon oil #700 solution on both ends of the slide.Place two small coverslips on top of the small droplets. Shimmy the coverslips, one at a time, and stop after the coverslip is difficult to move.Turn on your PC light delivery system. Set up stimulus delivery equipment on the base of the microscope.For noxious cold stimulus, place the Peltier plate as shown in Figure 4A. For light touch stimulus, attach a fine brush bristle to nickel plated pin holder as shown in Figure 4A inset.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170703/20170703030533_7148.jpgFigure 4. Microscope slide preparation. A. A view of the Zeiss AxioZoom.V16 with Peltier plate placed on the microscope stage, where larvae can be stimulated via cold and delivered PC light. 1. TE tech cold plate, 2. Black metal plate, 3. TE tech. power supply, 4. TE tech. temperature controller, 5. PC light, 6. HXP200C white light source, 7. Zeiss AxioZoom.V16 microscope and 8. Inset shows image of fine brush bristle mounted to a nickel plated pin holder. B. For live confocal imaging, larval mounted on the microscope slide with dorsal side up and fully stretched. C. Representative images of class III neurons expressing CaMPARI. PC (photo-converting light) and NS (no stimulus).Using a brush gently pick up one larva, expressing CaMPARI in your desired cell type, and wash the larva in a 9-well glass spot plate. Place the larva on a wet Kimwipe.Place the larva under Zeiss AxioZoom.V16. Simultaneously deliver stimulus and 20 sec of PC light.For cold stimulus: place one larva on black metal plate. Gently place the metal plate on the Peltier plate (set to 6 °C) and turn on PC light.For light touch stimulus: place one larva on black metal plate.",
    "Deliver light touch stimulus first to the head of the larva, followed by a stroke along the length of the animal, while the animal is exposed to PC light.Mount larva on to a microscope slide (Figure 4B).Place the larva on the middle of the slide.Note: Depending on laser confocal microscope set up orientation of larva will differ either horizontal or vertical compared to the length of the slide.Place a drop of ethyl ether:halocarbon oil #700 solution on both small coverslips. If the larva is not straight on the slide, then use forceps to reorient the larva to the preferred direction. Generously add drops of ethyl ether:halocarbon oil #700 solution on to and around the larva. Place a 24 x 50 mm coverslip on top of the larva and the two coverslips. Again, shimmy, this time gently, until the larva is completely flat, straight and desired side of the animal facing up.Image z-stacks of neuronal cell bodies in the neural type of interest. Imaging multiple segments and/or both hemisegments will allow more detailed analysis of spatial CaMPARI response."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}