{
  "id": 18154,
  "origin_website": "Jove",
  "title": "OaAEP1-Mediated Enzymatic Synthesis and Immobilization of Polymerized Protein for Single-Molecule Force Spectroscopy",
  "procedures": [
    "1. Protein production\nGene clone\nPurchase genes coding for the protein of interest (POI): Ubiquitin, Rubredoxin (RD)51, the cellulose-binding module (CBM), dockerin-X domain (XDoc) and cohesion from Ruminococcus flavefacience, tobacco etch virus (TEV) protease, elastin-like polypeptides (ELPs).\nPerform polymerase chain reaction and use three-restriction digestion enzyme system BamHI-BglII-KpnI for recombining the gene from different protein fragments.\nConfirm all genes by direct DNA sequencing.\nProteins expression and production\nTransform E. coli BL21(DE3) with the pQE80L-POI or pET28a-POI plasmid for expression.\nPick one single colony into 15 mL of LB medium with respective antibiotics (e.g., 100 μg/mL ampicillin sodium salt or 50 μg/mL, kanamycin). Keep shaking the cultures at 200 rpm at 37 °C for 16-20 h.\nDilute the overnight cultures into 800 mL of LB medium (1:50 dilution). For rubredoxin, centrifuge the culture at 1,800 x g, then resuspend in 15 mL of M9 medium (supplemented with 0.4% glucose, 0.1 mM CaCl2, 2 mM MgSO4), and then dilute it into 800 mL of M9 medium.\nIncubate the culture at 37 °C while shaking at 200 rpm, until the culture reaches an optical density at 600 nm (OD600) of 0.6. Save 100 μL sample of the culture as the pre-induction control for testing protein expression.\nInduce protein expression by adding IPTG to a final concentration of 1 mM and shake the culture at 37 °C for 4 h at 200 rpm. Reserve a 100 μL sample of the culture as the post-induction control for testing protein expression.\nCentrifuge the culture at 13,000 x g for 25 min at 4 °C and store at -80 °C before purification.\n\t\tNOTE: The protocol can be paused here.\nPurification of protein of interest",
    "Resuspend the cells in 25 mL of lysis buffer (50 mM Tris, 150 mM NaCl, pH 7.4 containing DNase, RNase, PMSF) and use a sonicator (15% amplitude) to lyse it for 30 min on ice.\nClarify the cell lysate at 19,000 x g for 40 min at 4 °C.\nPack 1 mL (bed volume) of Co-NTA or Ni-NTA affinity column and wash the column with 10 column volumes (CV) of ultrapure water and then 10 CVs of wash buffer (50 mM Tris, 150 mM NaCl, 2 mM imidazole, pH 7.4) by gravity flow.\nPass the protein supernatant through the column by gravity flow for three times.\nPour wash buffer on the column with 50 CVs to move away contaminant proteins.\nElute the bound protein with 3 CVs of ice-cold elution buffer (20 mM Tris, 400 mM NaCl, 250 mM imidazole, pH 7.4). When it comes to rubredoxin proteins, further anion exchange purification using anion exchange column at pH 8.5 at 4 °C is necessary.\nAnalyze the sample by SDS-PAGE.\n2. Functionalization of coverslip and cantilever surface\nFunctionalized coverslip surface preparation\nDissolve 20 g of potassium chromate in 40 mL of ultrapure water. Slowly add 360 mL of concentrated sulfuric acid to the potassium chromate solution with glass rod stir gently and to prepare the chromic acid.\n\t\tCAUTION: The chemical used here and the final chromic acid is strongly corrosive and acidic. Work with proper protective equipment. The solution releases heat when add concentrated sulfuric acid, which means slow adding and proper pause for cooling down.\nClean and activate a glass coverslip at 80 °C for 30 min by chromic acid treatment. Completely immerse the coverslips in 1% (v/v) APTES toluene solution for 1 h at room temperature while protecting them from light.",
    "Wash the coverslip with toluene and absolute ethyl alcohol and dry the coverslip with a stream of nitrogen.\nIncubate the coverslip at 80 °C for 15 min and then cool down to room temperature.\nAdd 200 μL of sulfo-SMCC (1 mg/mL) in dimethyl sulfoxide (DMSO) solution between two immobilized coverslips and incubate for 1 h protected from light.\nWash the coverslip with DMSO first and then with absolute ethyl alcohol to remove residual sulfo-SMCC.\nDry the coverslip under a stream of nitrogen.\nPipet 60 μL of 200 μM GL-ELP50nm-C protein solution onto a functionalized coverslip and incubate for about 3 h.\nWash the coverslip with ultrapure water to remove the unreacted GL-ELP50nm-C.\n\t\tNOTE: Functionalized coverslips are capable for about two weeks under storage at 4 °C.\nFunctionalized cantilever surface preparation\nClean the cantilevers at 80 °C for 10 min by chromic acid treatment.\nFunctionalize the cantilever by amino-silanization with 1% (v/v) APTES toluene solution and then bake the cantilever at 80 °C for 15 min before conjugating to sulfo-SMCC.\nLink the C-ELP50nm-NGL to the surface with the maleimide group of sulfo-SMCC for 1.5 h.\nWash away the unreacted C-ELP50nm-NGL on the coverslip by ultrapure water.\nImmerse a functionalized cantilever in 200 μL of 50 μM GL-CBM-XDoc protein solution containing 200 nM OaAEP1 at 25 °C for 20-30 min. Then use AFM buffer (100 mM Tris, 100 mM NaCl, pH 7.4) to wash away unreacted protein.\n\t\tNOTE: The surface chemistry of the cantilevers and the coverslip are similar.\n3. Stepwise polyprotein preparation with controlled sequences\nLink the ligation unit Coh-tev-L-POI-NGL to the GL-ELP50nm immobilized on the coverslip surface by OaAEP1 for 30 min.\nUse 15-20 mL of AFM buffer (100 mM Tris, 100 mM NaCl, pH 7.4) to wash away any unreacted proteins.",
    "Add 100 μL of TEV protease (0.5 mM EDTA, 75 mM NaCl, 25 mM Tris-HCl 10% [v/v] glycerol, pH 8.0) to cleave the protein unit at the TEV recognize site for 1 h at 25 °C.\nUse 15-20 mL of AFM buffer to wash away residual proteins.\nLink the ligation unit Coh-tev-L-POI-NGL to the GL-Ub-NGL-Glass by OaAEP1 for 30 min.\nRepeat steps 3.3 to 3.5 N-1 times to build protein construct GL-(Ub)n-NGL on the glass surface. Omit the last TEV cleavage reaction to reserve cohesin on the protein-polymer as Coh-tev-L-(Ub)n-NGL-Glass.\n4. AFM Experiment measurement and data analysis\nAFM measurements\nAdd 1 mL of AFM buffer to the chamber with 10 mM CaCl2 and 5 mM Ascorbic Acid.\nChoose the D tip of the functionalized AFM probe for the experiment. Use the equipartition theorem to calibrate the cantilever in AFM buffer with an accurate spring constant (k) value before each experiment.\nAttach the cantilever tip to the sample surface to form the Cohesin/Dockerin pair.\nRetract the cantilever at a constant velocity of 400 nm·s−1 from the surface. In the meantime, record the force-extension curve at a sample rate of 4000 Hz.\nData analysis\nUse JPK data processing select force-extension traces.\nUse software to analyze the traces. Fit the curves with the worm-like-chain (WLC) model of polymer elasticity and obtain unfolding force and contour length increment for individual protein unfolding peak.\nFit the histograms of unfolding forces with the Gaussian model to obtain the most probable values of unfolding force (<Fu>) and contour length increment (<ΔLc>).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}