{
  "id": 17977,
  "origin_website": "Jove",
  "title": "A Novel Approach to Monitoring Graft Neovascularization in the Human Gingiva",
  "procedures": [
    "The reported method was employed in a clinical trial which was granted ethical approval from the Hungarian Committee of the Health Registration and Training Center (approval number: 034310/2014/OTIG).\n1. LSCI Setup\nSwitch on the computer and any peripherals.\nSwitch on the LSCI instrument to be used with the switch on the rear panel.\nAllow the instrument to warm up for at least 5 min. The instrument is ready for measurement when both LEDs on the rear panel have stopped flashing.\nStart the software by double-clicking on the software icon on the desktop or via the Start menu.\nWait until both the yellow and the green LEDs on the rear panel have stopped flashing, which indicates that the laser is warm and initialization is finished.\n\tNote: When starting up the system, one will occasionally be prompted to perform the verification procedure for the system.\n2. System Verification\nUse the calibration box supplied. Remove the lid from the calibration box and shake it to avoid sedimentation in the colloidal suspension.\nLeave the lid off for 30 s to avoid bubbles.\nPut the lid back on the calibration box.\nClick Advanced | Verification | Verify instrument.\nSelect Routine verification | Next.\nTurn the head 90°, fasten the calibration box using the integrated magnets and click Next.\nEnter the room temperature in the text box, select °C and click Start.\nWait while the wizard completes the verification procedure.\nAfter a successful verification procedure close the wizard by clicking Finish.\n3. Participant Preparation\nMake sure that measurement is performed in a temperature-controlled room (26 °C).\nPlace the patient in a comfortable supine position in a dental chair and place a vacuum pillow under his head (Figure 1).\nLeave the patient undisturbed for 15 min before any measurements are taken.\n4. Microcirculation Image Measurement",
    "In the Tools menu, select and click on Project Editor. A new window opens in which the commonly used settings can be saved.\nIn the Projects box, click New to create a new project. Enter the “Vestibulum” and click OK.\nIn the Sites box, click New to create a new site. Enter “Tooth 14” and click OK.\nUnder the Contents of Tooth 14 panel add “10 cm” as the required distance for the Working Distance and enter a width of 3 cm and a height of 2 cm in the measurement boxes.\nSet the point density resolution to normal and the frame rate to 16 images/s and select Time from the Duration drop-down menu to set the recording duration to 0:30.\nSelect “Record with no averaging” and set the color photo capture rate to 1/second.\nThen click “Apply” and “OK” to save the Project parameters.\nIn the File menu, select and click New recording. A new Image Window will open and the Setup panel will be displayed.\nUnder Recording Setup, select “Vestibulum” for the Project and “Tooth 14” for the 4.9. Site.\nOpen the Subject drop-down menu, click New in the Select subject dialog box, and enter the name of the Patient.\nClick OK and enter a name for the recording in the Rec Name field: e.g., day 1 (days elapsed after the operation) and the name of the operator in the Operator field.\nBefore beginning the microcirculation image measurement, measure patient’s blood pressure and pulse.\nEvacuate the air from the vacuum pillow to fix the patient’s head in a position appropriate to the area under investigation.\nAsk patient to open his mouth.\nRetract lips gently by two dental mirrors (Figure 1).",
    "Adjust the instrument’s head parallel to the measured area of the gingiva. A built-in visible (650 nm) indicator laser facilitates the positioning of the imager relative to the patient's mouth.\nAdjust the working distance to 10 cm by moving the instrument in relation to the tissue. The distance is measured continuously by the LSCI device and it is displayed by the software as working distance/measured value under Image Setup.\nInstruct the subject to remain still for the duration of the measurement.\nClick on the Record button to start recording. The color of the Image Window now changes to red, indicating that recording is in progress. The Setup panel is replaced by the Recording panel. Recording stops automatically after 30 s. When recording is finished, the color of the Image Window changes to blue and the Recording panel is replaced by the Review panel.\nRemove dental mirrors and allow the patient to close his mouth and swallow.\nSwitch back to the live image by pressing the Resume recording button.\nRepeat the steps from 4.14 to 4.21 twice.\nClose the file. The data are saved automatically.\nMeasure blood pressure and pulse after the LSCI measurements. \n5. Offline Analysis\nAnalyze the LSCI images using the built-in software. Go to Image or Split view (Figure 2).\nDefine regions of interest (ROI). Note: the perfusion values of pixels within a ROI are averaged and defined as the blood flow value of the ROI, expressed in an arbitrary value called Laser Speckle Perfusion Unit (LSPU).\nSelect the desired ROI shape within the ROI tools palette on the right.\nSelect the Apply option in the ROI tools palette, which applies ROI operations to all images of the recording.",
    "Draw the ROI by clicking and holding the mouse button in the intensity image, dragging the ROI out to the desired size, and releasing the mouse button (click and double-click for free-form ROIs). Adjust the position of the ROI, resize or rotate it, if needed.\nRepeat steps from 5.3. to 5.5 as many times as the desired number of ROIs (Figure 3).\nDefine time periods of interest (TOI). This allows for averaging perfusion in a ROI over a definite period of time (Figure 2).\nGo to Graph or Split view. Select the Add TOI tool button.\nClick and hold on the graph at the position where you want the TOI to begin and drag the cursor to the desired end position. Then release the mouse button.\nExport data from the mean value table for further processing.\nConstruct blood flow curves by a suitable software used for statistical analysis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}