{
  "id": 5638,
  "origin_website": "Bio",
  "title": "<em>In vitro</em> Demonstration and Quantification of Neutrophil Extracellular Trap Formation",
  "procedures": [
    "Neutrophil isolationIsolate human neutrophils from fresh peripheral blood using gradient centrifugation (Figures 1A and 1B)Dilute peripheral blood 1:2 with PBS containing 2 mM EDTA. In each 50 ml tube, carefully and sequentially lay 10 ml Histopaque-1119, 10 ml Histopaque-1077 and 25 ml diluted blood. Note: Histopaque should be brought to room temperature prior to use.Centrifugation at 700 x g (Note: Without break.) at room temperature for 30 min. Transfer the layer at the interface of Histopaque-1077 and Histopaque-1119 to a new 50 ml tube (the usual volume ranges from 2-3 ml), top up to 50 ml with PBS and centrifuge at 300 x g at room temperature for 10 min. Wash again with 30 ml PBS. Note: The expected average yield of neutrophils per ml of peripheral blood from healthy donor ranges from 2-5 million cells.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170702/20170702193339_3880.jpgFigure 1. Neutrophil isolation. A. Human neutrophils were isolated from fresh peripheral blood of healthy donors by gradient centrifugation (step A1). The neutrophil layer at the interface of H1077 and H1119 were collected. PBMC, peripheral blood mononuclear cells; PMN, polymorphonuclear leukocytes; RBC, red blood cells. B. The cell viability was analyzed with PI dye and the purity of the viable neutrophils was analyzed using a human CD15 antibody within the PI negative gate. C. Human neutrophils were isolated from buffy coat with the MACSxpress method (step A2). The cell viability was analyzed with PI dye and the purity of the viable neutrophils was analyzed with human CD15 antibody within the PI negative gate. D. Murine bone marrow neutrophils were isolated by magnetic sorting using a negative depletion method (step A3). The cell viability was analyzed with PI dye and the purity of the viable neutrophils was analyzed with a mouse Ly6G (Gr-1) antibody within the PI negative gate.",
    "Gray histograms: PI dye or CD15 antibody or Gr-1 antibody; open histogram: unstained control or isotype antibody.Alternative: Isolate human neutrophils with MACSxpress neutrophil isolation kit (Figure 1C)Mix 5 ml of buffy coat (Note: less than 12 h after collection.) with 1 ml reconstituted buffer A (kit component), 1 ml buffer B and 100 µl reconstituted MACSxpress erythrocyte depletion reagent. Incubate sample for 5 min at room temperature using the MACSmix Tube Rotator at 12 rpm.Place the open tube in the magnetic field of the MACSxpress Separator for 10 min, then carefully collect the supernatant containing neutrophils into a new tube.Isolation of murine bone marrow neutrophils (Figure 1D)Dissect femur bones of C57BL/6J mice, and flush out the bone marrow with 10 ml PBS containing 2 mM EDTA by using a 10 ml syringe and 26 G needle aseptically. Filter the suspension with a 30 µm cell strainer.Isolate neutrophils by immunomagnetic separation (MACS) using the negative depletion method with mouse neutrophil isolation kit (Miltenyi), following the manufacturer’s instructions. Note: The expected average yield of neutrophils from bone marrow of two femur bones of one C57BL/6J mouse at age of 8-12 weeks ranges from 10-15 million cells.Optional: Check purity and viability of isolated neutrophilsResuspend 2 x 105 isolated human neutrophils in 100 µl FACS buffer (see Recipe 1) containing 5 µl of anti-human CD15-FITC antibody (or anti-mouse Gr1-APC antibody for mouse neutrophils). Another 2 x 105 cells in 100 µl FACS buffer containing 5 µl of mouse IgM-FITC isotype control (or rat IgG2b-APC isotype control for mouse neutrophils). Incubate at room temperature in the dark for 30 min.Add 100 µl FACS buffer, mix gently, and centrifuge to collect cell pellet with a benchtop centrifuge at 3,000 RPM (870 x g with 87 mm rotor) at room temperature, remove supernatant.",
    "Resuspend pellet in 300 µl FACS buffer, add 3 µl Propidium iodide (PI) staining solution, mix quickly.Proceed to flow cytometric analysis for CD15+PI- cells (human), or Gr-1hiPI- cells (mouse).NET demonstration by immunostainingNote: If the aim is to study the interaction of specific adherent cells with neutrophils and NET formation, seed the cells of interest one day prior to neutrophil isolation into 8-well glass chamber slide (Millicell EZ Slide 8-well glass) in 300 µl medium per well and culture overnight. The seeding cell number depends on the ratio of the target cells to neutrophils. Make duplicate wells for each condition. Remove culture medium before adding neutrophils. Induction of NET formationAdd freshly isolated neutrophils into 8-well glass chamber slide at a density of 2 x 105 neutrophils in 300 µl R1 medium (see Recipe 2) per well. Make duplicate wells for each condition. Note: Resuspend neutrophils in R1 medium at 6.67 x 105 cells/ml, then add 300 µl per well.Add the treatment of interest (e.g., potential chemical activator/inhibitor of NET, bacteria, interacting cells, etc.) Note: Incubation time needs to be optimized individually, more details see Note 1. Dissolve PMA in DMSO to make 1 mg/ml stock solution. To the positive control wells, and conditions that NET formation are desired, add PMA at a final concentration of 100 ng/ml to activate neutrophils (i.e., dilute PMA stock 1:100 in R1 medium, then add 3 µl of diluted PMA to each well). (see Note 2)Dilute DMSO 1:100 in R1 medium, add 3 µl of diluted DMSO to each well of the negative control (resting neutrophils) wells. Incubate for 3 h in a 37 °C incubator. Add 100 µl 4% PFA to each well without removing the medium (i.e., at final concentration of 1%) to fix the cells at 4 °C for overnight.",
    "Staining with anti-DNA/Histone H1 antibody and DAPI on the next day (Figures 2A and 2B).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170702/20170702194029_4905.jpgFigure 2. NET demonstration by immunostaining. 2 x 105 human neutrophils (A) or murine neutrophils (B) were activated by 100 ng/ml PMA for 3 h in wells of glass chamber slide. Resting neutrophils with DMSO served as negative control. Slides were fixed and labelled with anti-DNA/Histone H1 antibody followed by AF555-conjugated anti-mouse IgG (red) and nuclei were counterstained with DAPI (blue) (steps B1 and B2). C. Immunostaining of human neutrophil marker CD15 (green) and NET marker DNA/Histone H1 (red) on paraffin-embedded skin section from human vasculitis patients. D. Immunostaining of the murine neutrophil marker Ly6G (green) and NET marker DNA/Histone H1 (red) on paraffin-embedded skin section from mice with induced immune complex-mediated vasculitis (step B3). Scale bars = 100 µm.Remove medium, add 100 µl PBS to each well and then remove.Add 100 µl blocking buffer (see Recipe 3) to each well. The slides were left still on bench at room temperature for 45 min.Dilute DNA/Histone H1 antibody in antibody diluent (see Recipe 4) to a final concentration of 4 µg/ml.Add 100 µl diluted antibody to each well, incubate on bench at room temperature for 1 h.Remove antibody, wash slides twice with 100 µl PBS in each well, on an orbital shaker at 100 RPM for 5 min for each time. Dilute secondary anti-mouse-AF555 1:200 in antibody diluent.Add 100 µl diluted secondary antibody to each well, incubate at room temperature in the dark for 45 min. Remove antibody, wash 2 times with 100 µl PBS on an orbital shaker.Dilute DAPI 5 mg/ml stock 1:5,000 in PBS, add 100 µl to each well, incubate at room temperature in the dark for 3 min.Remove DAPI staining solution, and remove the frame of chamber slides.",
    "Wash slides 2 times by dipping in a container with PBS.Mount cover slips with fluorescence mounting medium.Fluorescence microscopy with red channel (AF555) and blue channel (DAPI) (e.g., Zeiss Axiophot microscope with an AxioCam digital color camera and AxioVision software) (see Note 3).Optional: staining with additional neutrophil marker (Figures 2C and 2D)Additional neutrophil markers can be co-stained with NET, in order to provide an additional confirmation. The following primary antibodies have been tested, and one or more combinations can be considered depending on the number of color filters available on the fluorescence microscope: CD15 (human, Novus, 1:50), Ly6G (mouse, Abcam, 1:100), MPO (human and mouse, R&D Systems, 1:50), or NE (human and mouse, Abcam, 1:200). Proper secondary antibodies with different fluorophores other than NET staining are necessary. This staining can be performed before the NET staining. Sequential staining is recommended based on the staining specificity and intensity.After blocking (step B2b), add 100 µl diluted primary antibody to each well, incubate at 4 °C overnight.Remove primary antibody, wash 2 times with 100 µl PBS.Add 100 µl diluted secondary antibody to each well, incubate at room temperature in the dark for 1 h.Remove secondary antibody, wash 2 times with 100 µl PBS.Continue with NET staining (step B2c).NET quantification with Sytox orange (Figure 3)Note: If the aim is to study the interaction of specific adherent cells with neutrophils and NET formation, seed the cells of interest one day prior to neutrophil isolation into a 96-well, black, flat bottom plate in 100 µl medium per well, and culture overnight. The seeding cell number depends on the ratio of the target cells to neutrophils. Make 5 repeated wells for each condition. Remove culture medium before adding neutrophils.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170702/20170702194252_4736.jpgFigure 3.",
    "1 x 105 human neutrophils (hNeu) were cultured alone or with adipose tissue derived mesenchymal stem cells (MSC) at hNeu:MSC ratios of 1,000:1, 100:1 and 10:1 and subsequently activated with 100 ng/ml PMA for 3 h. Cocultures were labelled with 0.25 µM Sytox orange for 5 min at room temperature and fluorescence intensities were measured by a microplate reader. Culture medium containing Sytox orange served as background fluorescent control. Fluorescence intensities were normalized on the intensity of non-activated controls. Results are expressed as mean ± SEM of quintuplicate measurements. This experiment was independently repeated three times with similar results. **P < 0.01; ***P < 0.001; RFI, relative fluorescence intensity; AU, arbitrary unit.Add freshly isolated neutrophils into a 96-well, black, flat bottom plate at a density of 1 x 105 neutrophils in 100 µl R1 medium (see Recipe 2) per well. A background fluorescence control with only R1 medium, a positive control with PMA activation, and a negative DMSO-only control of resting neutrophil are necessary. Note: Make 5 repeated wells for each condition. Avoid the wells in the first and last rows/columns of the plate. (We had experience that the peripheral wells of the plate may give inaccurate fluorescence reading, especially the wells on four corners. It could be due to the technical specification of the microplate reader or due to the quality of the black bottom 96-well plate.)Add the treatment of interest (see Note 1 in Notes section).To the positive control wells, and conditions that NET formation are desired, add PMA at a final concentration at 100 ng/ml to activate neutrophils. (i.e., dilute 1 mg/ml PMA stock 1:100 in R1 medium, then add 1 µl of diluted PMA to each well).",
    "Dilute DMSO 1:100 in R1 medium, add 1 µl of diluted DMSO to each well of the negative control wells. Incubate for 3 h in a 37 °C incubator. Dilute 5 mM Sytox orange stock 1:5,000 in R1 medium. Then add 50 µl of 1 µM working solution to each well with a multichannel pipette (i.e., Sytox orange at a final concentration of 0.25 µM). Incubate for 5 min at room temperature in the dark.Centrifuge the plate at 400 x g for 5 min, carefully remove 100 µl supernatant from each well to reduce the background fluorescence. Note: Remove the medium slowly and carefully, and avoid touching the bottom of the plate.Immediately measure the fluorescence intensity with a Mithras LB940 microplate reader, at excitation and emission wavelengths of 540 nm and 580 nm, respectively (see Note 4)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}