{
  "id": 19739,
  "origin_website": "Wiley",
  "title": "Protocol Considerations for In Vitro Metabolic Glycoengineering of Non-Natural Glycans",
  "procedures": [
    "The first step in MGE is the incubation of cells with sugar analogs Ac4ManNAz, Ac4ManNAl, Ac4ManLev, and Ac5ManNTGc (1-4 in Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-fig-0004]). Although an exhaustive bevy of analog controls is not always required, it is recommended to compare a test analog with appropriate control analogs when performing initial experiments with a previously untested cell type. To illustrate this process, we briefly describe appropriate controls for the thiol-modified analog Ac5ManNTGc (4). First, ManNAc (5) serves as a control for increased flux through the sialic acid pathway and Ac4ManNAc (6) controls for increased flux plus any off-target responses engendered by the SCFA protecting groups, either from their scaffold-dependent effects (Elmouelhi et al., 2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0032]) or from SCFA-specific responses (e.g., multifaceted responses from acetate [Moffett et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0077]] or HDACi activity from butyrate [Sampathkumar, Jones, Meledeo et al., 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0093]]) after removal by intracellular esterases (Fig. 1C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-fig-0001]). Taking a step towards increased complexity, Ac4ManNProp (7) and/or Ac5ManNGc (8) are appropriate size-matched controls for an elongated N-acyl side chain reported to enhance signaling propensities (Kontou et al., 2008[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0058]) or receptor-binding properties (Collins et al., 2000[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0023]) of these molecules, but without the unique chemical properties of the thiol installed by Ac5ManNTGc at this position (the NProp analog has a methyl and the NGc analog has a hydroxyl instead of a thiol group). Comparably, Ac4ManNAz, Ac4ManNAl, and Ac4ManLev all have an N-acyl group five atoms long, making Ac4ManNPent (9; Kim et al., 2004[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0055]) an appropriate, sized-matched, chemically inert control analog. Note that, although this report provides suggested analogs to use in basic MGE experiments, we acknowledge that analog options continue to expand, providing new MGE opportunities. For example, 1,3,4-tributanoylated analogs (Fig. 1C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-fig-0001]) such as 1,3,4-O-Bu3ManNAz (10) are used more efficiently by cells than Ac4ManNAz (Almaraz, Aich et al., 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.",
    "822#cpz1822-bib-0008]), and two recently reported thiol analogs (Ac5ManNTProp, 11, and Ac5ManNTBut, 12) have improved neuromodulatory activity compared to Ac5ManNTGc (Du et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0028], 2022[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0029]).",
    "Materials\nAnalog stock solutions (for additional information, see Strategic Planning):\n               \n10 mM peracetylated analogs (e.g., 1-4 and any control other than 5; Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-fig-0004]) in ethanol or DMSO\n500 mM free hydroxyl monosaccharides (e.g., ManNAc, 5) in PBS or serum-free culture medium, filter sterilized\nJurkat cells (ATCC, cat. no. TIB-152; see Support Protocol )\nComplete RPMI-1640 (see recipe) or appropriate medium for cells of interest\nEthanol (200 proof; Pharmco)\n24-well tissue culture plates\nCell counter (e.g., Z2 Coulter Particle Counter and Size Analyzer, Beckman Coulter) or hemacytometer\n1. Label sterile 24-well tissue culture plates, e.g., with the desired concentrations of SCFA-derivatized analogs (see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-tbl-0001]) or higher millimolar concentrations of free hydroxyl analogs (e.g., up to 75 mM; Yarema et al., 1998[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0138]). Set up triplicate wells for each concentration.\nTable 1.\n                Addition of Analog and Ethanol to Give Desired Final Concentrations after 0.5 ml Cells are Added\ntable:\n﻿0,1,2,3,4,5,6,7,8\nDesired concentration of analog (1-4; µM),0,5.0,10.0,20,40,80,160,320\nVolume of 10 mM analog (1-4; µl),0,0.25,0.5,1,2,4,8,16\n\"Volume of ethanol (µl) (optional, see text)\",16,15.75,15.5,15,14,12,8,0\n2. Add the appropriate volume of 10 mM analog stock solution to give the desired final concentration after 0.5 ml cells are added below.\nFor volumes less than 1-2 µl, even if a pipettor capable of measuring 0.2-2 µl is available, it is advisable to use 10× volumes of a 1 mM stock solution to avoid pipetting errors, because the surface tension of ethanol differs from aqueous solutions sufficiently that it is difficult to add such small volumes accurately and reproducibly when using standard pipet tips.",
    "When adherent cells are tested, the same protocol described for Jurkat cells in steps 1-5 can be followed, where the analog is added to the culture plate before the cells. Alternatively, the appropriate amount of analog can be added to the cell culture medium after the cells are plated (steps 3-4) to minimize the deleterious effects of cytotoxic analogs. In this case, the total amount of ethanol added to each well should be kept constant (e.g., by separately adding the appropriate amount shown in the “optional” line of Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-tbl-0001]).\n3. Leave plates in a sterile tissue culture hood with the lids open for ∼15 min to allow the ethanol to evaporate.\n4. While ethanol is evaporating, harvest Jurkat cells as described (see Support Protocol) or alternate cell lines by the usual methods.\n5. Adjust Jurkat cell density to 5 × 105 cells/ml in complete RPMI-1640 for a 48-hr experiment or 2.5 × 105 cells/ml for a 72-hr experiment. Mix thoroughly to obtain a homogeneous single-cell suspension.\nWhen using a cell line that deviates significantly from the growth rate of Jurkat cells (doubling time ∼26 hr), adjust the initial cell density to ensure that approximately the same number of cells are present at the end of the experiment for each condition tested.\nGenerally, as long as cell density is in a range that supports robust growth (e.g., from 2 × 105 to 2 × 106 cells/ml for Jurkat cells ), density does not significantly influence analog metabolism (Jones et al., 2004[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0046]). As a cautionary note, very low densities (e.g., <1 × 105 cells/ml) experience exacerbated analog toxicity and should be avoided.\n6. Add 0.5 ml cell suspension to each well and incubate cells at 37°C for 48 or 72 hr.\nFor time-dependency experiments, see step 8.",
    "Typically, the surface display of modified glycans reaches maximal levels after 2-3 days incubation with SCFA-derivatized analogs (e.g., Ac4ManNLev), whereas free hydroxyl monosaccharides (e.g., ManNLev) may require up to 5 days to achieve saturating surface display. The shorter time period is advantageous because cells do not need to be passaged, which they do for 4-day or longer incubations. It is also generally long enough to observe growth inhibition and early indications of analog-induced cytotoxicity and apoptosis.\n7. After the appropriate time, mix cell culture thoroughly by gently pipetting up and down several times with a 1-ml pipet to obtain a single-cell suspension and then count an aliquot to determine cell density.\nCells can now be used for toxicity, labeling, or functional assays.\nWhen preparing adherent cells for flow cytometry analysis, take care to use the minimal amount of trypsin and shortest exposure time needed to detach the cells to avoid damaging cell-surface components bearing the metabolically glycoengineered glycans. Alternatively, metabolic incorporation of MGE analogs into adherent cells can be monitored by fluorescence microscopy or microplate reader assays (Smirnov et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0106]; Wen et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0130]; Wu et al., 2022[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0133]).\n8. Study analog incorporation as a function of time.\nSeveral options are available. For short time intervals (e.g., <48 hr), we suggest preparing separate plates in step 1 and harvesting each one at a specified time. For time points <24 hr, a higher initial cell density (e.g., 1 × 106 cell/ml) may be required to ensure a sufficient number of cells for analysis.",
    "For multi-day time points, because Jurkat and other human cancer cell lines double in ∼1 day, one option is to prepare larger-volume cultures (e.g., 1 ml) and remove 0.5 ml each day for analysis. The volume is replenished with 0.5 ml fresh medium and the appropriate volume of analog can be added to maintain the initial concentration. In this case, because the analog is added directly to the culture and not allowed to evaporate as described in step 2, ethanol should be added (e.g., as shown in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-tbl-0001]) to maintain the same solvent concentration in each well.",
    "This protocol describes routine methods to maintain Jurkat cells, a lymphocyte line derived from human acute T cell leukemia (clone E6-1, often referred to as wildtype Jurkat cells). In general, no special procedures are needed for cell preparation for MGE experiments, so the usual methods used to culture any mammalian cell line of interest can be followed.\nMaterials\nJurkat clone E6-1 (ATCC, cat. no. TIB-152)\nComplete RPMI-1640 (see recipe)\nCell counter (e.g., Z2 Coulter Particle Counter and Size Analyzer, Beckman Coulter) or hemacytometer\n75-cm2 tissue culture flask (Sarstedt, cat. no. 83.1813)\n37°C, 5% CO2 humidified incubator\n15- or 50-ml polypropylene centrifuge tubes\n1. Add Jurkat cells to complete RPMI-1640 to attain a cell density of ∼1–2.5 × 105 cells/ml and add to a tissue culture flask or dish (e.g., 1.5 × 106 cells in 15 ml in a 75-cm2 flask).\nThe volume and/or number of cells used should be adjusted depending on the number of cells required (for use in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-prot-0001]).\n2. Place in a 37°C, 5% CO2 humidified incubator for up to 4 days to allow cells to reach a density of ∼2 × 106 cells/ml.\nIf the cells were freshly thawed, cell growth to saturating density may take up to 1 week.\nIf the pH indicator in the medium has not changed color, indicating a lack of accumulation of metabolic waste products, and the cells will be diluted significantly for subsequent use, steps 3-5 may not be necessary.\n3. Transfer cell suspension to a 15- or 50-ml centrifuge tube and centrifuge 3.5 min at 1300 × g, room temperature.\n4. Carefully discard supernatant and resuspend cells in 10 ml prewarmed (37°C) complete RPMI-1640.\n5. Disperse cell clumps by gently pipetting up and down several times and then count cells using an electronic cell counter or hemacytometer.",
    "Jurkat cells that tend to form small, loosely associated clusters while growing in suspension. To ensure counting accuracy, they should always be dissociated first by gentle pipetting.\n6. Replate an aliquot of cells as described (see step 1) and place the stock flask in the incubator. Use the remaining harvested cells (typically 85% to 95% of the total number of cells initially present) in MGE protocols.",
    "SCFA-monosaccharide analogs often reduce cell viability, but these deleterious effects vary greatly, ranging from transient growth inhibition to rapid onset of apoptosis at sufficiently high concentrations. Cytotoxicity depends on analog structure. For example, Jurkat cells incubated with peracetylated ManNAc analogs (e.g., 1-4 in Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-fig-0004]) experience cytotoxicity not observed with free hydroxyl monosaccharides (Fig. 1A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-fig-0001]), and the degree of toxicity is influenced by the N-acyl modification (Kim et al., 2004[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0055]; Wang et al., 2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0128]), so both hydroxyl and N-acyl modifications affect cell viability. Cell viability can be evaluated with various levels of sophistication and thoroughness. At the simplest, cell counts obtained in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-prot-0001] identify analogs that inhibit cell growth, which can be quantified as an IC50 value (the inhibitory concentration that reduces cell counts to 50% of control values). IC50 values are typically a useful endpoint after short-term analog exposure (e.g., 2, 3, or 5 days) because actual cell death from analog exposure is usually slow over concentration ranges used in optimized MGE experiments. Accordingly, additional analyses often are needed to understand the source of reduced viability. To explain briefly, reduced cell numbers could be due to transient growth inhibition from which the cells can recover and resume robust growth; alternatively, the test cells could be fated to die over the next several days (Sampathkumar, Jones, Meledeo et al., 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0093]; Sampathkumar, Jones, & Yarema, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0093]). If this issue needs resolution—in particular in samples that contain fewer cells than the negative controls (i.e., samples without analog), indicating that actual cell death has occurred—trypan blue (or other live/dead assays) can be used to detect if dead cells are already present.",
    "In addition, standard apoptosis assays can be run to determine if programmed cell death has been set in motion, or the MTT assay can be used to evaluate the metabolic state of the cells (Kim et al., 2004[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0055]). A straightforward and reliable way to determine lethality is to continue to monitor cell counts over a 2-week period (Sampathkumar, Jones, Meledeo et al., 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0093]); in general, IC50 data obtained from 2-, 3-, or 5-day cell counts or LD50 data from 15-day experiments are adequate to determine safe analog levels to use in subsequent metabolic uptake (e.g., Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-prot-0004]) and labeling (Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-prot-0005]) experiments. Below, IC50 and LD50 assays are described.",
    "Additional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-prot-0001])\nPhosphate-buffered saline (PBS), pH 7.4 (Invitrogen, cat. no. 10010-049)\n10 mM analog stock solutions (e.g., Ac4ManNAc (6) plus any additional analogs required for user-specific applications)\n1. Incubate Jurkat cells (1 × 105 cells in 0.5 ml) with analog (e.g., 2 at 0-320 µM) in a 24-well plate for 3 days in a 37°C, 5% CO2 incubator (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-prot-0001]).\nIf adherent cells are used, two plates (with three replicates each) will be needed for each condition because the cells will be trypsinized, counted, and discarded at each time point (days 3 and 5). Steps 3-5 are typically not performed for adherent cells, because they tend to become overconfluent without trypsinization and passaging, and the manipulations of these procedures introduce errors that lead to inaccurate results.\n2. On days 3 and 5:\n         \nGently pipet Jurkat cells up and down using a 1-ml pipet to dislodge cell clumps.\nTransfer two 100-µl aliquots to 10 ml PBS in cuvettes.\nMeasure and record the cell density using a cell counter or hemacytometer.\nAdd 1 ml medium to each well and return cells to the incubator.\n3. On days 7, 9, 11 and 13:\n         \nGently pipet cells to dislodge clumps.\nRemove 1 ml suspension and add 1 ml fresh medium.\n4. On day 15:\n         \nGently pipet cells to dislodge clumps.\nTake a 1-ml aliquot and add it to 10 ml PBS in a cuvette.\nMeasure and record the cell density.\n5. Calculate the relative cell number for each analog concentration with respect to the ethanol control for days 3, 5, and 15. Plot relative cell number with respect to analog concentration for days 2 or 3, 5, and 15 to determine the IC50 or LD50 value (concentrations where relative cell numbers are 50% of untreated controls).",
    "Once the maximum concentration of glycan analog that can be used without deleteriously affecting cell viability has been determined, the next step is to quantify the extent of analog incorporation. The ideal way to measure uptake and metabolism is to quantify non-natural glycan display on the cell surface as described in Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-prot-0005]; this approach is preferred to the periodate-resorcinol assay described here because it measures flux all the way through a metabolic pathway to the cell surface. However, the detection of non-natural glycans on the cell surface is not trivial and requires more highly sophisticated instrumentation than the periodate-resorcinol assay. In brief, the periodate-resorcinol assay is a colorimetric technique that quantifies total and glycoconjugate-bound sialic acids and can provide a rapid quantitative estimation of ManNAc analog incorporation into the sialic acid biosynthetic pathway. It is attractive because it provides a low-cost and technically simple option to monitor cellular uptake and subsequent successful incorporation of high-flux analogs into the sialic acid biosynthetic pathway.\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-prot-0001])\n10 mM Ac4ManNAc (6) stock solution (as positive control) plus additional analogs of choice\nPhosphate-buffered saline (PBS), pH 7.4 (Invitrogen, cat. no. 10010-049)\n0.4 M periodic acid (see recipe)\n6% (w/v) resorcinol (Sigma, cat. no. 108-46-3; store at –20°C)\nt-Butyl alcohol (2-methyl-propan-2-ol; Sigma, cat. no. 3972-25-6)\n2.5 mM CuSO4 (see recipe)\n10 mM sialic acid (see recipe)\nConcentrated HCl\n25-cm2 tissue culture flasks\n15-ml centrifuge tubes\n1.5-ml microcentrifuge tubes\n–80° C freezer or pulverized dry ice\n37°C water bath\n100°C heating block\n96-well microtiter plates\nMicroplate reader (µQuant, Bio-Tek Instruments)\n1. Incubate Jurkat cells (or other line being tested) with sugar analog(s) as described (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-prot-0001]), but use 25-cm2 tissue culture flasks instead of 24-well plates and seed ∼1 × 107 cells in 10 ml.",
    "For Jurkat cells, a volume of 10 ml in a 100-mm culture dish will provide a sufficient number of cells to perform the resorcinol assay in triplicate; in some cases, a 2-ml culture in a 6-well plate or 35-mm dish will yield sufficient cells. At a minimum, ∼1 × 106 cells are recommended for each replicate to obtain reliable results. For adherent cells, a 75-cm2 flask will provide enough cells for triplicates.\nWe suggest using a high-flux, low-toxicity analog such as 6 in all experiments as a positive control. Over a concentration range of 0-250 µM, these compounds are expected to increase levels of total sialic acid by at least 10-fold in most cell lines.\n2. After 2-3 days, harvest Jurkat cells by gently pipetting up and down using a 1-ml pipet to dislodge clumps and transferring to a 15-ml centrifuge tube.\nFor adherent cells, detach cells from the culture flask using trypsin and transfer to a 15-ml tube.\n3. Centrifuge cells 5 min at 1000 × g, room temperature. Discard supernatant and resuspend cells in 10 ml PBS by gentle pipetting.\n4. Centrifuge 3.5 min at 1300 × g, room temperature. Discard the supernatant and resuspend cells in 5 ml PBS by gentle pipetting. Repeat two more times to wash the cells thoroughly.\nFBS in the culture medium is rich in glycoconjugate-bound sialic acids and must be thoroughly removed to ensure accuracy and reproducibility.\n5. Remove two 100-µl aliquots and determine density using a cell counter or hemacytometer. Add PBS to each sample to obtain a density of 1 × 106 cells/ml, pipetting gently to obtain a homogenous cell suspension.\n6. Aliquot 1 ml suspension to three 1.5-ml microcentrifuge tubes (1 × 106 cells/tube) to yield three replicates per condition.",
    "In general, at least 1 × 106 cells are needed to provide a robust colorimetric signal; an exception is provided by high-flux analogs (e.g., 6 and 7) that increase sialic acid levels by 10-fold or more. In this case, a correspondingly lower number of cells can be used for each replicate.\n7. Pellet cells by centrifuging 3.5 min at 1300 × g, room temperature, and resuspend in 300 µl PBS.\n8. Freeze tubes in a –80° C freezer for ∼1 hr or on pulverized dry ice for 5-10 min, and then thaw in a 37°C water bath. Repeat for a total of three freeze/thaw cycles.\nFreeze-thaw cycles offer an effective means of lysing cells without introducing chemical agents or other factors that may impact later readings.\n9. During the freeze-thaw cycles, prepare the assay reagents:\n         \nRemove 0.4 M periodic acid and 6% (w/v) resorcinol from freezer and thaw at room temperature.\nWarm t-butyl alcohol to 25°C (just above room temperature).\nPrewarm heating block to 100°C.\nPrepare a fresh 1 mM sialic acid solution by diluting the 10 mM stock in PBS. Then, in 1.5-ml microcentrifuge tubes, use the 1 mM solution to prepare 300-µl standards of 0, 10, 20, 30, 40, and 50 μM as follows:\n300 μl PBS\n3 μl sialic acid in 297 μl PBS\n6 μl sialic acid in 294 μl PBS\n9 μl sialic acid in 291 μl PBS\n12 μl sialic acid in 288 μl PBS\n15 μl sialic acid in 285 μl PBS\nSialic acid standards should be prepared in the same buffer as the samples.\n10. Add 5 µl of 0.4 M periodic acid to each sample and standard. Vortex and place on ice for 15 min.\n11. To measure glycoconjugate-bound measurement sialic acids, incubate samples 80 min at 37°C.",
    "This results in a colorimetric signal from only glycoconjugate-bound sialic acids; signal from the free monosaccharide form of sialic acid is lost during this incubation. To measure total sialic acid content (free and bound, as in step 10), omit this step.\n12. Prepare resorcinol working reagent:\n         \n1.5 ml 6% resorcinol\n1.5 ml 2.5 mM CuSO4\n6.6 ml deionized H2O\n5.4 ml conc. HCl\n13. Add 500 µl working reagent into each tube, vortex, and incubate 10 min in the 100°C heating block.\nTo ensure uniform heating, fill the heating block with water after placing the microcentrifuge tubes in it. When heating, place an empty heating block on top of the microcentrifuge tubes to prevent them from opening.\n14. Remove tubes cool rapidly in room temperature water.\n15. Add 500 µl t-butyl alcohol to each tube and mix by vortexing.\n16. Centrifuge 2 min at maximum speed in a benchtop microcentrifuge.\n17. Aliquot samples into 96-well plates (two wells per sample) and measure absorbance at 630 nm.\nThe colorimetric change measured in the assay is directly proportional to the number of sialic acids present in the sample. As such, alongside a standard curve and appropriate control, the A630 measurements represent the uptake and conversion of analogs to sialic acid. These values can be directly compared to controls for relative conclusions or compared to a standard curve for more quantitative results.",
    "Absorbance can also be measured using a spectrophotometer, but using a microplate reader allows for smaller volumes and provides a semi-high-throughput alternative to cuvette-based methods. One disadvantage to the 96-well format is that, unlike a cuvette where the path length is constant, the depth of solution in a well changes the path length and thereby changes the spectroscopic reading. For this reason, it is critical to aliquot precisely the same volume (e.g., 100 µl) into each well. This feature also provides flexibility in that if the sample is too dilute to obtain a reading, 200 or 300 µl can be added to the well (conversely, if the sample is too concentrated, 25 or 50 µl can be used).",
    "Cell surface display of non-natural glycans is an inherently inefficient process including entry into a cell, which necessitates the use of SCFA-derivatized analogs (Wang et al., 2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0128]), as well as bottlenecks within intracellular glycosylation pathways (Viswanathan et al., 2003[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0122]). As a result, analog incorporation into glycans is not a linear function of medium concentration and does not necessarily reflect intracellular metabolite levels as determined by the periodate-resorcinol assay. Consequently, surface display needs to be determined empirically. Non-natural analogs with chemical functional groups such as ketones, azides, alkynes, and thiols that do not occur naturally in the glycocalyx allow quantitative detection and quantification of surface-displayed analogs after conjugation with fluorophores using chemoselective ligation reactions. Commonly, the cell-surface functional groups are reacted with biotin-conjugated chemoselective ligands, then stained using fluorescein-conjugated avidin or streptavidin, and finally quantitated using flow cytometry (Mahal et al., 1997[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0072]). A brief history of this method is described by Kufleitner, Haiber & Wittmann (2023[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0060]). Alternatively, protein-specific aptamers can be designed for subcellular measurements of non-natural glycans into specific proteins such as PD-L1 (Zhu et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0143]).",
    "There are two variations on the basic workflow outlined above and described in detail below that are worth noting. One variation is direct versus indirect labeling. Below, we describe and recommend a two-step labeling process where cell-surface functional groups are first conjugated to biotin linked to an appropriate chemical probe and then the appended biotin is stained with fluorescently tagged streptavidin. As an alternative, glycan-displayed chemical functional groups (fluorophores capable of direct conjugation to the cell surface) are now widely available, enabling direct one-step labeling of the cell surface with fluorescent probes (Liao et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0068]; Soares da Costa et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0107]; Vanbeselaere et al., 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0119]). In our experience, these fluorescent probes have a propensity for nonspecific staining. The two-step approach avoids this pitfall, most likely because fluorescently labeled streptavidin, unlike small-molecule fluorophores, is membrane impermeable, thereby reducing nonspecific background signal.",
    "The second variation is in the quantification approach. Below, we describe quantification via flow cytometry. Alternative approaches that are well-suited for adherent cells involve labeling and staining without cell detachment from the tissue culture plastic. Examples are described elsewhere and include three basic approaches. In one, cells are solubilized after labeling, releasing fluorophores into suspension where they can be quantitatively measured using a fluorescence microplate reader (Smirnov et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0106]; Wen et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0130]; Wu et al., 2022[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0133]). In the second, metabolic incorporation of MGE analogs can be visualized by fluorescence microscopy, which provides rich detail on the subcellular distribution of the non-natural monosaccharide. As an aside, cells can be fixed, stained, and permeabilized before labeling, allowing visualization not only of cell-surface display, but of analog incorporation in glycoprotein secretory pathways (Almaraz, Aich et al., 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0008]; Scache et al., 2022[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0100]; Tian et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0117]; Wang et al., 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0126]). In the third, a “far western” approach is based on the separation of proteins in a cell lysate using gel electrophoresis. Instead of staining the blots with antibodies as in conventional western blotting, the blots are reacted with biotin-conjugated bioorthogonal probes followed by avidin-based fluorescent probes (Scache et al., 2022[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0100]). This approach quantifies the incorporation of an unnatural analog in purified protein or cell lysate as an alternative to flow cytometry or plate reader assays. In theory, the same principle can be applied to ELISA assays, creating a sandwich of capturing antibodies and fluorescing molecules (Srinivasan et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0109]).",
    "The detection and quantification of ketone-, azido-, and alkyne-groups, as described below, follows the same basic set of steps with the main difference being the use of a ketone-, azido-, or alkyne-specific probe. Due to their chemical properties and the slightly oxidizing conditions in the extracellular milieu in normal tissue culture conditions, an additional nuance exists for glycan-displayed thiols; specifically, the majority of glycocalyx-displayed thiols form cis-disulfides (Sampathkumar, Jones, & Yarema, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0093]). These disulfides are refractory to labeling probes such as maleimide-conjugated biotin, resulting in significant underestimation of incorporation of thiol-modified analogs such as Ac5ManNTGc into cell-surface glycans. Therefore, to better estimate the total level of surface sugar analog display, this protocol introduces the mild reducing agent tris(2-carboxyethyl)phosphine (TCEP), which reduces disulfide bonds before chemoselective ligation of thiols is performed, thereby providing a more accurate estimate of metabolic incorporation.\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-prot-0001])\n10 mM stock solutions of desired sugar analogs: Ac4ManNLev, Ac4ManNAz, Ac4ManNAl, or Ac5ManNTGc (1-4) for ketone, azide, alkyne, or thiol labeling, respectively, plus any needed controls (e.g., 5-9)\nPhosphate-buffered saline (PBS), pH 7.4 (Invitrogen, cat. no. 10010-049)\nBiotin buffer (see recipe), freshly prepared\n5 mM biotin hydrazide (see recipe)\nCuAAC buffer (see recipe)\n1 mM biotin alkyne (see recipe)\n4 mM biotin-PEG4-DBCO (see recipe)\n1 mM biotin azide (see recipe)\nTris(2-carboxyethyl)phosphine hydrochloride (TCEP; Sigma, cat. no. C4706)\nEZ-Link maleimide PEG2-biotin (MB; Pierce Biotechnology, cat. no. 21901)\nAvidin staining buffer (ASB; see recipe)\n2.8 mg/ml FITC-avidin (see recipe)\n6-well tissue culture plates or 35-mm dishes\n15-ml centrifuge tubes\n5-ml round-bottom polystyrene tubes, 12 × 75 mm (BD Falcon, BD Biosciences, cat. no. 352054)\nFlow cytometer with 488-nm argon laser (Becton Dickinson FACSCalibur, BD Biosciences)\nIncubate cells with sugar analogs",
    "1. Incubate Jurkat cells with the appropriate test analog (e.g., 1-4, Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-fig-0004]) and control (e.g., 5-9) as described (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-prot-0001]), but use 6-well tissue culture plates (or 35-mm dishes) instead of 24-well plates and seed ∼1 × 106 cells in 2 ml for each sample.\nThis volume should provide a sufficient number of cells at the end of 2-3 days incubation (i.e., ∼4 × 106 cells in total) to perform quantitative estimation of surface display in triplicate. When cell availability is limiting, as few as 2 × 105 cells per replicate can be used or the number of replicates can be reduced to two.\nJurkat cell density should be maintained between 0.5 × 106 and 2 × 106 cells/ml. Below this density, the cells are more sensitive to analog toxicity; above this level, their growth rates slow, which may deleteriously affect analog metabolism (Jones et al., 2004[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.822#cpz1822-bib-0046]).\nPrepare cells for labeling\n2. Gently pipet cell suspension up and down using a 5-ml pipet to dislodge cell clumps. Count an aliquot to determine cell density.\nThe cell density and total number of cells per sample are not critically important in these labeling steps. However, if there are too many cells (e.g., >2 × 106 per sample), a large pellet is formed that traps reagents during wash steps. By contrast, if there are too few cells (e.g., <0.5 × 106 per sample), the pellet may not be large enough to see during the wash steps and can potentially be lost.\n3. Centrifuge cells in 15-ml tubes for 3.5 min at 1300 × g, room temperature, and discard supernatant.\n4. Add 3 ml PBS and resuspend cells by gentle pipetting.\nTo minimize damage of cells, avoid vortexing.",
    "5. Aliquot 1 ml resuspended cells to three 1.5-ml microcentrifuge tubes (maximum of 2 × 106 cells/tube).\nPerform labeling\nIMPORTANT: For all labeling reactions, it is crucial that the cells be properly resuspended before and immediately after adding the labeling reagent to avoid cell aggregation and cross-linking. During incubation, tubes should be laid flat on the benchtop with intermittent mixing by gently flipping the tubes end-to-end to ensure uniform labeling. We recommend not vortexing the cells during labeling.\nFor ketone expression:\n6a. Wash cells twice with freshly prepared biotin buffer, then twice with PBS. For each wash, centrifuge cells 2.5 min at 3000 × g, room temperature, discard the supernatant, and gently resuspend in a volume of 1 ml.\n7a. Centrifuge cells 3.5 min at 3000 × g, room temperature, and resuspend gently in 250 µl biotin buffer.\n8a. Add 250 µl of 5 mM biotin hydrazide and mix immediately by gentle pipetting.\n9a. Lay tubes flat on the benchtop at room temperature for 2 hr, mixing by gentle inversion every 15 min. Proceed to step 12.\nFor azide expression using the copper-catalyzed azide-alkyne [3 + 2] conjugation reaction:\n6b. Wash cells as in step 6a.\n7b. Centrifuge cells 3.5 min at 3000 × g, room temperature, and resuspend gently in 250 µl CuAAC buffer.\n8b. Add 250 µl of 1 mM biotin alkyne and mix immediately by gentle pipetting.\n9b. Lay tubes flat on the benchtop at room temperature for 2 hr, mixing by gentle inversion every 15 min. Proceed to step 12.\nFor azide expression using the copper-free strain-promoted azide-alkyne conjugation reaction:\n6c. Wash cells as in step 6a.\n7c. Dilute 5 µl of 4 mM biotin-PEG4-DBCO in 495 µl PBS.",
    "8c. Centrifuge cells 3.5 min at 3000 × g, room temperature, and resuspend gently in 500 µl diluted biotin-PEG4-DBCO.\n9c. Lay tubes flat on the benchtop at room temperature for 1 hr, mixing by gentle inversion every 15 min. Proceed to step 12.\nFor alkyne expression:\n6d. Wash cells as in step 6a.\n7d. Centrifuge cells 3.5 min at 3000 × g, room temperature, and resuspend gently in 250 µl CuAAC buffer.\n8d. Add 250 µl of 1 mM biotin azide and mix immediately by gentle pipetting.\n9d. Lay tubes flat on the benchtop at room temperature for 2 hr, mixing by gentle inversion every 15 min. Proceed to step 12.\nFor thiol expression:\n6e. Wash cells twice with PBS only. For each wash, centrifuge cells 3.5 min at 3000 × g, room temperature, discard the supernatant, and gently resuspend cells in 1 ml PBS.\n7e. Prepare a 10 mM solution of TCEP by adding 2.87 mg TCEP to 1 ml PBS.\n8e. Centrifuge cells 3.5 min at 3000 × g, room temperature and discard the supernatant. Resuspend cells gently in 360 µl PBS and then add 40 µl of 10 mM TCEP (final 1 mM).\n9e. Lay tubes flat on the benchtop at room temperature for 1 hr, mixing by gentle inversion every 15 min.",
    "The time and concentration required for TCEP treatment has been optimized as a compromise between complete reduction of disulfides (which is estimated to be only 90% to 95% under the given conditions) and a loss of cell viability that occurs at longer time periods or higher concentrations. To ensure reproducibility between experiments performed on different days, it is recommended to maintain TCEP concentration and incubation time and temperature as constant as possible. Note that if room temperature varies from 18°C to 25°C over time, this can measurably affect TCEP reduction of disulfides as well as labeling efficiency in the next step.\nIf TCEP treatment is not intended, or to compare TCEP-treated and untreated cells to estimate the degree of disulfide formation under normal culture conditions, centrifuge cells as in step 8e, resuspend in 400 µl PBS, and proceed to labeling in step 10a.\n10e. Prepare a fresh 5 mM MB solution by adding 3.9 mg EZ-Link maleimide PEG2-biotin to 1.5 ml PBS. Add 100 µl to each sample and mix immediately by gentle pipetting.\n11e. Lay tubes flat on the benchtop at room temperature for 1 hr, mixing by gentle inversion every 15 min. Proceed to step 12.\nStain with FITC-avidin\n12. While the cells are labeling, cool 50 ml ASB and 50 ml PBS in an ice bath.\n13. Centrifuge labeled samples 3.5 min at 3000 × g, room temperature. Discard supernatant and resuspend cells in 1 ml ice-cold ASB.\n14. Repeat wash two more times, but resuspend the third pellet in 100 µl ASB.\n15. Dilute 2.8 mg/ml FITC-avidin 1:250 in PBS. Mix well and keep in the dark on ice for no more than 12 hr.\nPrepare slightly more than is needed (200 µl/sample) to ensure there is sufficient solution for the last tube.",
    "16. Add 100 µl diluted FITC-avidin to each tube (final 5.6 µg/ml), mix immediately by gentle pipetting, and incubate on ice out of direct light for 15 min.\nIt is important to resuspend the cells properly before and immediately after addition of FITC-avidin to obtain uniform labeling and avoid cell clumping.\n17. Centrifuge FITC-labeled cells 3.5 min at 3000 × g, room temperature. Discard supernatant and resuspend cells gently in 100 µl ASB.\n18. Repeat FITC-avidin incubation as in step 16.\nIncomplete removal of unreacted biotin reagents from the cell suspension before staining with FITC-avidin leads to inconsistent results, as FITC-avidin reacts preferentially with free biotin reagents instead of the surface-bound form. For this reason, cells are reacted with FITC-avidin twice. The first incubation functions to remove any remaining free biotin reagents, allowing cells to be more reproducibly stained in the second incubation.\n19. During the second incubation, collect untreated Jurkat cells and add ∼1 × 106 cells to each of two 1.5-ml microcentrifuge tubes. Wash twice, resuspend in 500 µl PBS, and transfer to 5-ml polystyrene tubes. Keep on ice.\nThese will be used to adjust flow cytometer settings and define the healthy cell population on the forward scatter–side scatter plot.\n20. Centrifuge labeled samples 3.5 min at 3000 × g, room temperature. Discard supernatant and resuspend cells gently in 1 ml ice-cold ASB.\n21. Repeat wash two more times, but resuspend the third pellet in 500 µl PBS and transfer to 5-ml polystyrene tubes. Keep on ice out of direct light.\nSamples may be kept on ice for up to 3 hr before analysis by flow cytometry.\nAnalyze by flow cytometry\n22. Analyze samples by flow cytometry, collecting at least 10,000 events for each run for more accurate results. Run analysis twice for each sample.",
    "23. Measure the relative fluorescence content (and hence relative surface display) of cells using the geometric mean in arbitrary units."
  ],
  "subjectAreas": [
    "Chemical Biology"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}