{
  "id": 17721,
  "origin_website": "Jove",
  "title": "Native Cell Membrane Nanoparticles System for Membrane Protein-Protein Interaction Analysis",
  "procedures": [
    "1. Protein expression\nInoculate 15 mL of Terrific Broth (TB) media with antibiotics specific to plasmids with BL21(DE3) pLysS cells containing the AcrB expressing plasmids in 50 mL tubes overnight at 37 °C with shaking at 250 rpm.\nCheck the optical density of the overnight culture at 600 nm (OD600) and ensure that it is over 2.0.\nDilute 5 mL of cell culture into 1 L of TB media containing antibiotics specific to plasmids and incubate at 37 °C with shaking until OD600=0.8 and then induce with IPTG that has a final concentration of 1 mM.\nCarry out induction at 20 °C with shaking for 20 h.\nPellet down the cells using centrifugation for 15 min at 4 °C and 4,000 x g.\n2. Cell lysis and membrane isolation\nResuspend the cell pellet in Buffer A (Table 1, use DDM Buffer A or NCMNs Buffer A depending on purification scheme that is to follow) using 80 mL for every 20 g of the cell pellet.\nHomogenize the resuspended cell pellets by using a glass Dounce homogenizer at 4 °C or if at room temperature be sure to put on ice immediately after.\nTransfer the sample into a metal beaker on ice and lyse the cells by loading them into a high-pressure homogenizer at 4 °C and 1,500 bar.\n\t\nRepeat the process of loading the cells into the homogenizer and allowing them to pass through the homogenizer for 3-4 cycles or until the lysate begins to clarify.\nCentrifuge the lysate at 15,000 x g for 30 min at 4 °C.\nCollect the supernatant and load into ultracentrifuge tubes and centrifuge at 215,000 x g for 1 h at 4 °C.\nDiscard the supernatant and collect the membrane pellets from the ultracentrifuge tubes. Store any excess membrane pellet at -80 °C.",
    "3. Preparation of native cell membrane nanoparticles\nResuspend 1 g of membrane pellet in 10 mL NCMNs Buffer A (Table 1).\nHomogenize the resuspended cell membrane sample with a glass Dounce homogenizer at 20 °C.\nTransfer the suspended membrane sample to a 50 mL polypropylene tube and add membrane active polymers stock solution and additional NCMNs Buffer A to bring the sample to a final concentration of 2.5% (w/v) membrane active polymer (NCMNP1-1 or NCMNP5-2).\n\tNOTE: Stock solutions of membrane active polymers should be made in double distilled water and can be kept at varying concentrations, but typically 10% (w/v).\nShake the sample for 2 h at 20 °C.\nLoad the sample into an ultracentrifuge and spin at 150,000 x g for 1 h at 20 °C.\nWhile the sample is being ultra-centrifuged begin to equilibrate a 5 mL Ni-NTA column with 25 mL of NCMNs Buffer A.\nCollect the supernatant after ultracentrifugation is complete and load it onto 5 mL of Ni-NTA column at room temperature with a flow rate of 0.5 mL/min using a syringe pump.\nWash fast protein liquid chromatography (FPLC) lines with enough NCMNs Buffer B (Table 1) to completely flush the system and then connect the column to the FPLC machine.\nWash the column with 30 mL of NCMNs Buffer B with a flow rate of 1 mL/min and collect the flow through.\nWash the column with 30 mL of NCMNs Buffer C (Table 1) with a flow rate of 1 mL/min and collect the flow through.\nElute the protein with 20 mL of NCMNs Buffer D (Table 1) at a flow rate of 0.5 mL/min and collect the sample using a fraction collector and the fractions each being set to 1.0 mL.\nStore the protein samples at 4 °C.",
    "Run an SDS-PAGE gel electrophoresis assay in order to check the samples that correspond to peaks observed on the FPLC elution graph.\n4. SDS-PAGE gel electrophoresis\nPrepare the casting chamber by clamping the glass to the casting apparatus.\nPrepare the 12% separation gel according to the recipe listed in Table 1.\n\tNOTE: Once TEMED is added the gel will polymerize quickly so only add this once ready to pour the gel.\nPour the gel, leaving 2 cm below the bottom of the comb for the stacking gel.\nRemove any bubbles by layering the top of the gel with 100% isopropanol and wait for the separation gel to polymerize.\nRemove the isopropanol and wash out any traces of the isopropanol with distilled water.\nPrepare the stacking gel according to the recipe listed in Table 1.\n\tNOTE: Once TEMED is added the gel will polymerize quickly so only add this once ready to pour the gel.\nPour the stacking gel on top of the separation gel.\nAdd a comb to the chamber to form the wells and wait for the stacking gel to completely polymerize.\nPlace 1 µL of 1 M DTT into a microcentrifuge tube for each fraction sample that needs to be run on the gel.\nAdd 7 µL of 4x loading buffer to each tube as well.\nAdd 20 µL of sample from the fractions that need to be run on the gel to each microcentrifuge tube.\nVortex the tubes containing the samples.\nSpin down the sample tubes using a tabletop microcentrifuge for 3 s and make sure all the sample has returned to bottom of the tubes.\nPrepare the gel electrophoresis cell by securing a 12% polyacrylamide gel cassette into place and filling the inner and outer chambers of the cell with Tris-acetate-EDTA (TAE) Buffer (Table 1).",
    "Load the molecular weight marker into the first lane of the gel with the appropriate volume required by its instructions.\nLoad 28 µL of the sample from each tube mixed with DTT and loading buffer.\nPlace the lid of the electrophoresis cell on top of the box and plug the lid into the power supply.\nTurn on the power supply and set it to 100 V and allow it to run for 20 min.\nAfter 20 min, increase the power supply current to 140 V and continue to run it for another 30-40 min or until the band of loading buffer dye reaches the bottom of the gel cassette.\nAfter completing electrophoresis stain and de-stain the gel to visualize the protein bands contained within the gel.\n5. Protein purification using DDM\nNOTE: The purpose of carrying out this purification process is to serve as a control for the experiments utilizing the membrane active polymers.\nResuspend 6-10 g of membrane pellet, from step 2.6, in DDM Buffer A (Table 1) using 5 mL/g of membrane pellet.\nHomogenize the resuspended sample with a glass Dounce homogenizer at 4 °C or if at room temperature be sure to put on ice immediately after.\nTransfer sample to a 50 mL of polypropylene tube and add DDM and additional DDM Buffer A to bring the sample to a final concentration of 2% DDM.\nShake the sample for 2 h at 4 °C.\nLoad the sample into ultracentrifuge tubes and centrifuge for 1 h at 4 °C and 150,000 x g.\nWhile sample is being ultra-centrifuged begin to prepare the 5 mL of Ni-NTA column by washing with 25 mL of DDM Buffer A (Table 1).",
    "After ultracentrifugation is complete, collect the supernatant and load it onto the 5 mL Ni-NTA column at 4 °C with a flow rate of 0.5 mL/min using a syringe pump.\nWash FPLC lines with enough DDM Buffer B + 0.05% DDM (Table 1) to completely flush the system and then attach the column to the FPLC machine.\nWash the column with 30 mL of DDM Buffer B + 0.05% DDM with a flow rate of 1 mL/min and collect the flow through.\nWash the column with 30 mL of DDM Buffer C + 0.05% DDM (Table 1) with a flow rate of 1 mL/min and collect the flow through.\nElute the protein with 20 mL of DDM Buffer D + 0.05% DDM (Table 1) at a flow rate of 0.5 mL/min and collect the flow through using a fraction collector and the fractions each being set to 1.0 mL.\nSelect the fractions containing the elution peak for pooling and concentrating by using a centrifugal concentrator and centrifuging at 4,000 x g and 4 °C until reaching 500 µL.\nUsing a 500 µL loop load the sample into the FPLC machine and then onto the 25 mL size exclusion column at 4 °C. Elute using 30 mL of DDM Buffer E + 0.05% DDM (Table 1) at a flow rate of 0.5 mL/min and collect as fractions with the fraction sizes set to being 0.5 mL per a fraction.\nTake the fractions and measure the protein concentration using 280 nm absorbance to confirm UV-Vis curve from the FPLC elution graph.\nCollect 20 µL from each sample fraction that correspond to peaks observed on the FPLC elution graph and were confirmed to be accurate with the absorbance test.",
    "Freeze the remainder of those sample fractions using liquid nitrogen or dry ice in desired aliquots and store protein samples at -80 °C.\nRun an SDS-PAGE gel electrophoresis assay as previously described to check the samples that correspond to peaks observed on the FPLC elution graph.\n6. Negative stain grid preparation\nPlace the grids that are going to be used for the sample preparation on a glass slide wrapped in filter paper with the carbon side facing up.\nPlace the glass slide with the electron microscope grids into the chamber of a glow discharger between the two electrodes and replace the glass lid making sure it is centered and well-sealed.\nRun the glow discharging machine and make sure that the purple light generated by the plasma is visible.\nWhen the machine is done running, wait until the chamber has reached atmospheric pressure to remove the glass lid and then return the slide with the grids to the bench where samples will be loaded onto them.\nAdjust the concentration of the purified protein samples to about 0.1 mg/mL by either diluting the sample with the appropriate buffer or concentrating using a centrifugal concentrator.\nLoad 3.5 µL of protein sample onto the 10 nm thick carbon grid and wait for 1 min.\nRemove the liquid from the surface of the EM grid with a filter paper.\nWash the grid surface 3x by picking up 3 µL droplets of water with the grid and removing the water from the grid with filter paper in between picking up each droplet.\nWash the grid surface 2x by picking up 3 µL droplets of fresh, filtered 2% uranium acetate and remove the wash solutions on the grid with filter paper in between picking up each droplet.",
    "Stain the grid with a 3 µL droplet of fresh, filtered 2% uranium acetate for 1 min.\nRemove the uranium acetate solution on the surface of the EM grid with filter paper and air dry the grid for at least 1 min.\nStore the grid in a grid box for the later use.\n7. EM imaging\nLoad the prepared grid into the grid holder at a safe workbench.\nPrepare the microscope by placing the microscopes dewar into a polystyrene box and fill the dewar 3/4th full of liquid nitrogen.\nConfirm that the rubber cover of the microscope window is covering it and then load the dewar onto the microscope by placing the copper wires into the dewar until it fits on the platform.\nFill the remainder of the dewar with liquid nitrogen and place a cap on top of the dewar to cover it.\nTurn on the high tension, condition the microscope, and wait for the microscope to warm up and establish a safe vacuum level for use.\nOnce the microscope is ready open the column valve and confirm the beam is present by removing the rubber cover on the microscope window.\nCheck the beam stigmation by spreading in and out by adjusting the intensity of the beam. If astigmatism is present the beam will have an elliptical shape as one moves away from cross-over and the beam should be the same oval shape on both sides.\nAdjust the microscope binoculars to be the right height and distance as per the eyes of the observer.\nCheck the beam positioning for Search, Focus, and Exposure modes by cycling through all three modes until the beam is center in each.\nClose the column valve and proceed to load the grid holder into the electron microscope.",
    "Adjust the microscope to eucentric height by using the microscopes wobbler feature and adjusting the movement of the stage using the Z-axis until there is no side-to-side motion of the sample in the center.\nUsing the low dose Search mode on the microscope search the grid for a desirable area of reasonable contrast with sample molecules present to focus on the sample.\nFocus on the sample in Focus mode by using a high step size until the sample is seen and then decrease steps to find the correct focus level.\nZero and blank the beam and then be sure the rubber pad is covering the microscope window.\nUsing the Exposure mode take the image of the desired grid area for a 1 s exposure at 62,000x magnification and check the obtained image.\nWhen done imaging a grid close the column valves and remove the grid holder from the column.\nWhen finished imaging all grids of interest shutdown the microscope by turning off the filament power and removing the liquid nitrogen dewar from the microscope.\nPlace something to absorb moisture on the stand where the dewar sat to catch condensation from the copper coils of the microscope.\nActivate the Cryo Cycle mode and make sure the turbo pump is turned off.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}