{
  "id": 17492,
  "origin_website": "Jove",
  "title": "Controlled Semi-Automated Laser-Induced Injuries for Studying Spinal Cord Regeneration in Zebrafish Larvae",
  "procedures": [
    "All animal studies were carried out with approval from the UK Home Office and according to its regulations, under project license PP8160052. The project was approved by the University of Edinburgh Institutional Animal Care and Use Committee. For experimental analyses, zebrafish larvae up to 5-day-old of either sex were used of the following available transgenic lines: Tg(Xla.Tubb:DsRed;mpeg1:GFP), Tg(Xla.Tubb:DsRed), Tg(betaactin:utrophin-mCherry), Tg(Xla.Tubb:GCaMP6s), and Tg(mnx1:gfp) (see Supplementary File 1 regarding the generation of the transgenic zebrafish lines). A schematic of the protocol using the automated zebrafish larvae handling platform is shown in Figure 1. All custom software, scripts, and detailed experimental protocols used in this work are available at https://github.com/jasonjearly/micropointpy/.\n1. Sample preparation\nAt 5 h post-fertilization, sort the embryos for the correct developmental stage21. Discard dead eggs and poorly developed and overdeveloped embryos.\nAt 3 days post-fertilization (dpf), anesthetize larvae by adding 2 mL of 0.4% aminobenzoic-acid-ethyl methyl-ester to 50 mL of fish facility water in a 90 mm Petri dish. Use animals raised with phenylthiourea (PTU) (see Table of Material) to prevent skin pigmentation if it is an issue, which is not the case for spinal cord injuries on 3 dpf larvae described in this protocol.\n\tNOTE: This relatively high anesthetic concentration is used to prevent movements of the larvae following the laser impact.\nScreen the embryos for fluorescent reporter expression (Supplementary File 1).\n\tNOTE: A fluorescent reporter for the spinal cord (or other structure of interest) is often required to assess the efficiency of the injury. The use of tg(Xla.Tubb:DsRed) helps to identify the spinal cord.",
    "Transfer the selected larvae into a 96-well plate for use in the VAST system (see Table of Materials) with 300 µL of fish facility water per well. Use the medium containing the anesthetic from the 90 mm Petri dish directly. Ensure to have only one larva per well. Prepare one extra empty 96-well plate to collect the lesioned larvae.\n\t​NOTE: If using another laser lesion system, mount the larvae in 1% Low-Melting Point (LMP) agarose gel in an appropriate observation chamber.\n2. Microscope preparation\nSwitch on all the system components (VAST, microscope, laser, PC), including the laser for ablation.\nOnce the hardware is fully initialized, launch the microscope software, ImageJ/Fiji, a python integrated development environment (IDE), and the automated zebrafish imaging (VAST system) software if using this platform (see Table of Materials).\nSet up the VAST software following the steps below.\n\t\nWhen the VAST software launches, choose Plate on the first window and click on the Done button (Figure 2A). Another small window will pop up asking whether the capillary is empty and clean. Verify by looking at the image of the capillary if there are any air bubbles inside. If not, click on Yes. If there are any bubbles, click on No and follow step 2.3.2-2.3.3 (Figure 2B).\nOn the Large Particle (LP) Sampler window, click on Prime to remove air bubbles (Figure 2C).\nGo to the main software window (with the capillary image) and right-click on the image. Select Record empty capillary image on the pop-up menu (Figure 2B).\nIn the LP Sampler window, go to the File menu and select the Open Script option. Choose a file containing the script corresponding to the experiment to be performed.",
    "In the main VAST software window, go to File and choose Open Experiment. Choose the experiment file corresponding to the planned experiment.\n\t\tNOTE: Ensure that the boxes Auto unload and Bulk output to waste are NOT checked.\nSet up the microscope software for imaging.\n\t\nLaunch the microscope imaging software (see Table of Materials) to initialize the hardware. This may take a few minutes, depending on the system.\nGo to the acquisition settings and set up the microscope for imaging the fluorophore expressed in the larvae. Use a 10x NA 0.5 water-dipping objective to ensure the focal volume is elongated enough along the optical axis to lesion the whole depth of the spinal cord or the targeted tissue.\nSet up ImageJ/Fiji for laser lesions.\n\t\nGo to the File menu, choose New/Script to open the script window.\nIn the New window, go to the File menu and choose Open to load the laser lesion script (Manual_MP_Operation.ijm).\nSet up the Python IDE.\n\t\nLaunch the Python IDE.\nGo to the File menu and choose Open File to load the script to manage the laser (Watch_for_ROIs_py3.py).\nGo to the Run menu and choose Run Without Debugging to run the script. Check to ensure that a sequence of messages in the TERMINAL panel appears along with some noise while the laser attenuator initializes (Figure 2D).\n3. Performing laser lesions on the VAST system\nCenter the capillary relative to the microscope objective by moving the stage by clicking on the arrow buttons on the main window of the VAST software (Figure 2B).\nFocus on the top of the capillary by looking through the eyepieces and using the transmitted light of the microscope.\n\tCAUTION: The capillary is very fragile and may break if touched by the objective. Move the microscope knob slowly when focusing in and out.",
    "Place the 96-well plates on the plate holder of the LP Sampler of the VAST system. Place the plate containing larvae on the left holder and the plate for collection on the right. Ensure that the plates are correctly oriented: the A1 well must be in the front-left corner of the holder.\nIn the VAST software, on the LP Sampler window, click on the Plate Template button and select all the wells containing larvae. Click on the OK button to validate and close the window (Figure 2C).\nIn LP Sampler window, click on the Run Plate button to start loading a larva.\n\tNOTE: After some time, the larva should be visible in the capillary at position (predefined in the experiment definition file), allowing to injure the spinal cord. The VAST tray light will turn off after a few rotations to set the larva with the lateral side facing the microscope objective.\nGo to the microscope software and click on the Live button to image the larva.\nTurn the microscope focus knob until the spinal cord central canal is visible.\n\tNOTE: It can be easier to focus using transmitted light first, and then refine with fluorescence.\nTake a snapshot in fluorescence and save the image to a dedicated folder.\nOpen the image in ImageJ and adjust the contrast if required (using the Image/Adjust/Brightness/contrast... menu in ImageJ).\nClick on the Region of Interest (ROI) line tool and draw a short line (20 µm) centered on the spinal cord (Figure 3A).\nSwitch the microscope to the 100% reflective mirror position.\nLoad the ImageJ script and click on the Run button. Use the following parameters: Repetition - 2; Sample - 1; Width - 40-micron; Attenuation - 89 (Full laser power) (Figure 3C).",
    "When the laser shot sequence is finished, switch to fluorescence imaging on the imaging software and adjust the focus if required.\n\tNOTE: A shift in focus is often observed due to tail displacement during laser exposure.\nTake a new snapshot and save it.\nOpen this new image in ImageJ and draw a new line that should be larger than the spinal cord itself (~80 µm), starting below the ventral side of the spinal cord in the upper part of the notochord and going towards the dorsal side to end in the space between the spinal cord and the skin (Figure 3B).\nSwitch the microscope to the 100% reflective mirror position.\nGo to the ImageJ script window and click on the Run button. Use the following parameters: Repetition - 2; Sample - 1; Width - 40 microns; Attenuation - 89 (Full laser power).\nAfter the (longer) laser shot sequence is finished, verify the transection quality by imaging fluorescence and focusing. Ensure that no cell or axons remain intact in the lesion site, which should appear as a dark or as a faint and homogeneous fluorescent area (Figure 3D, bottom panel).\nCollect the lesioned larvae into the empty 96-well plate (with the same well co-ordinates as that of the original well) by going to the main VAST software window and clicking on the Collect button.\nSwitch back on the VAST system light by clicking on the check box Tray Light on the bottom left of the window.\nRepeat step 3.3-3.17 for each new larva to be injured.\n4. Post-lesion handling and additional experiments",
    "Take out larvae from the 96-well plate as soon as possible and transfer them to a clean Petri dish with fresh fish facility water for the larvae to recover post-lesion. Put the Petri dish in an incubator at 28 °C.\n\t​NOTE: The damage often continues to propagate in the first hour after the lesion. The actual extent of the lesion should thus be assessed by fluorescence imaging after a delay of approximately 1 h.\n5. Troubleshooting\nIf air bubbles are present in the tubes and capillary of the VAST system, click on the Prime button on the LP Sampler window to remove them.\nConsider the unsuccessful lesions (as assessed from the remaining fluorescence in the lesion site, apart from the expected residual and homogenous background), which can be due to several reasons mentioned below.\n\t\nLow laser power: When this happens, try with a higher value.\n\t\tNOTE: The VAST system is equipped with a dye laser. This implies that the concentration of the dye solution used for laser light generation can change with time, leading to a decrease in laser power. Replacing with a fresh solution usually solves the problem22.\nPoor calibration: When this happens, verify the calibration and power of the laser system as per step 5.2.2.1-5.2.2.4. If not calibrated correctly, the laser won't be directed to the desired location, thus leading to unsuccessful lesions or undesired damage in adjacent tissues.\n\t\t\nPlace a mirror slide on top of the capillary chamber. Focus on the coated side (it should face the objective). Use a previous default in the slide to focus more easily.\nApply a pattern of laser ablation using a calibration script.\nAssess the quality of the pattern. The spots or lines should appear sharp and not blurry.",
    "Use a ramp with increasing power to evaluate whether the laser power has changed compared to the previous sessions.\nLarval movement during lesions: Larvae respond differently to anesthesia; thus, the laser lesion may trigger movements of the tail during the process, thus preventing a successful transection. When this happens, take an extra iteration of the laser lesion steps to complete it while still avoiding damage to the surrounding tissues.\nBad focus: When this occurs, focus on the middle of the central canal to get the best results.\nROI drawing, position, and size: The position and size of the ROI are critical for successful transections. The ROI should be larger than the spinal cord and centered on the center of the spinal cord. To solve this, start to draw the ROI from the ventral side of the spinal cord and go up toward the dorsal side to obtain successful transection. This is likely due to tail movements triggered by the sequence of laser shots during the ablation procedure.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}