{
  "id": 9140,
  "origin_website": "Jove",
  "title": "Laser-guided Neuronal Tracing In Brain Explants",
  "procedures": [
    "1. Optical Genotyping\n1. Optical Genotyping of Mouse Pups\nCheck for expression of the respective fluorescent marker using a laser pointer of the appropriate excitation wavelength (405 nm in the experiments described here) and corresponding filter goggles blocking the excitation wavelength but passing the emission wavelength (450 - 700 nm in the experiments described here). Point the laser pointer at the back of the head or the spinal cord of the mouse pup (see Figure 1). Avoid shining the laser into the eyes and lengthy exposure of the skin to laser light.\n2. Optical Genotyping of Older Animals\nDeeply anesthetize the mouse (aged p14 to p138 in the experiments described here) with an overdose of pentobarbital through an intraperitoneal injection (120 mg/kg bodyweight). Confirm proper anesthesia by checking the animal's reflexes (briefly pinch the tip of the ear or one of the hind legs to elicit the retraction reflex of the ear or leg). \nNote: Despite the use of an overdose of pentobarbital (120 mg/kg bodyweight) we refer to the injection procedure as \"deep anesthesia\" instead of euthanasia, because the animal is ideally still alive (i.e. its heart is still beating), when the surgery and the perfusion begin. This ensures a more efficient perfusion of the inner organs including the brain. \nOnce the animal does not show any reflexes, carefully remove the skin overlying the skull (Figure 2A) by making an incision in the skin covering the back of the head and cutting to the midsection of the skull. Expose the uncovered skull to laser light and observe the fluorescence through the filter goggles as described above. If a positive GFP signal is observed, proceed to step 2, if not, sacrifice the animal through decapitation (second/ensuring form of euthanasia following our IACUC regulations).",
    "Note: In even older mice ( >1 month) the fluorescence can be observed through the eyes of the animal.\n2. Transcardial Perfusion and Brain Preparation\nPerfuse transcardially with ice-cold phosphate buffered saline (PBS; NaCl: 137 mM, KCl: 2.7 mM, KH2PO4: 1.76 mM, Na2HPO4: 10 mM) using a 30 G syringe needle to largely remove the blood from the animal.\n\t\nFirst, carefully open the rib cage with sharp scissors and then push the needle into the left ventricle of the heart. Start pumping the PBS into the heart and the aorta and immediately following this step open the right atrium of the heart with the scissors to allow for the blood to exit the body. Note: Perfusion takes 5 - 10 min depending on the size of the animal.\nAfter exsanguination through perfusion, decapitate the animal, secure its head with pin needles (or 30 G syringe needles) by piercing them through the eye sockets in a preparation dish and remove the brain from the skull.\n\t\nFirst, use sharp scissors to cut off the skin overlaying the skull: make a small incision in the back of the head, then cut along the midline on the dorsal side of the head, cut to the sides just caudally of the eyes of the animal and lastly cut in the caudal direction to completely remove the flaps of skin at the back of the head.\nNext, repeat the same cutting pattern for the skull itself, make sure to remove both cochleas in the process, because this will significantly simplify the removal of the brain stem in the end. After this procedure the caudal half of the brain should lie completely exposed.",
    "In the next step, use a sharp razor blade or a scalpel to cut through the whole forebrain at an angle of about 45° and about 2 mm rostral from the cerebellum. Scoop out the separated front half of the brain with a bent spatula.\nUse the spatula to elevate the caudal half of the brain at its rostral end and subsequently cut through the cranial nerves that are still connected to the brain stem on its ventral side. As an end result, the caudal half of the brain including the brainstem should fall freely off the rest of the prepared animal head.\nFlip the removed caudal half of the brain to expose its ventral side and cut along the coronal plane just rostral (for the anterograde injections) or just caudal (for the retrograde injections) of the ventrally located \"bulbs\" containing the trapezoid body (see step 2.3).\n\t\t\nAlways use a sharp razor blade or a scalpel for the cutting procedure to minimize cell death caused by excessive mechanical stress on the tissue. As an end result, a brain explant spanning about 1 cm in length and containing the complete superior olivary complex along other brain regions should have been obtained.\nNote: This protocol demonstrates the procedure for a tracer injection into the trapezoid body located in the auditory brainstem. Adapt the location and orientation of the cutting planes and injection sites as needed. If the fluorescing brain regions of interest lie close enough to the brain surface, so that they can be identified and injected without cutting the brain (see Figure 2B), then the coronal cutting step can be omitted.\nIdentify the trapezoid body as two ventral prominent \"bulbs\" containing the ventral nucleus of the trapezoid body (VNTB).",
    "Note: For further anatomical reference regarding the approximate stereotactic location of these cutting planes, see Franklin & Paxinos, 2008. Panel 78 of the atlas, Bregma ~ -5.7 mm shows the medial nucleus of the trapezoid body (=MNTB) labeled as \"Tz\". Panel 69 shows the ventral nucleus of the trapezoid body (VNTB) labeled as \"MVPO\" (medioventral periolivary nucleus)19.\n3. Anterograde/Retrograde Tracing\nNote: Perform all following procedures at RT (25° C).\nAfter cutting, place the brainstem explant in a preparation dish containing oxygenated (95% O2, 5% CO2) dissecting solution (NaCl: 125 mM, KCl: 2.5 mM, MgCl2: 1 mM, CaCl2: 0.1 mM, glucose: 25 mM, NaH2PO4: 1.25 mM, NaHCO3: 25 mM, ascorbic acid: 0.4 mM, myo-inositol: 3 mM, pyruvic acid: 2 mM), securing it with 30 G syringe needles. Ensure that the area of injection is facing upwards.\nPull injection pipettes from borosilicate glass and fill them with one of the following three solutions: a) a 1.0 mg/ml solution of choleratoxin subunit-b conjugated to an Alexa fluorophore 555 in PBS12-13 (mainly used for retrograde transport), b) a 1%-dilution in 0.9% saline of dextran tetramethylrhodamine 555 (3,000 MW, mainly used for retrograde transport) or c) a 1%-dilution in 0.9% saline of 10,000 MW dextran-TRITC 555 (mainly used for anterograde transport).\n\t\nEnsure that injection pipette resistances range from 2.5 to 3.5 MOhm and that they are manufactured in 3 - 4 pulling cycles. For the experiments described here, achieve this by selecting a pre-programmed pulling algorithm on the pipette puller.",
    "Illuminate the brain explant using a statically mounted laser pointer of the appropriate wavelength (item No. 2 in Figure 3A; 405 nm wavelength in the experiments described here). Use the laser pointer as a guide for the injections, and aim the laser beam at the fluorescently labeled brain nucleus or cells of interest that will be injected.\nFind and observe the illuminated target area through a binocular microscope while wearing the compatible filter goggles (450 - 700 nm band-pass filter in the experiments described here). Insert the injection electrode via the micromanipulator into the area of interest.\nInject the tracer substance. The injections consist of 2 - 10 pressure pulses at 15 psi for 50 msec each, using a pressure injection device, directed perpendicular into the region of interest (ROI) within the brain section. Administer each pressure pulse at intervals of 10 - 15 sec to allow for the dye to spread.\nIn the case of the tetramethylrhodamine (TRITC) injections, additionally stimulate electrically to enhance the dye uptake through electroporation with the electrode placed in the brain area of interest (MNTB and VNTB in the experiments described here).\n\t\nUse 8 TTL pulses of 8 Volts for 50 msec with 50 msec interpulse intervals, driven by a stimulator and amplified to 55 V with a stimulation isolation unit (items No. 7 and 9 in Figure 3B). Use 10 - 20 repetitions of this protocol, administered over several minutes7,8. Make sure to ground the electrode properly - the grounding wire should be connected to the bath solution!",
    "Check for success of the injection. Since a fluorescent tracer with a longer emission wavelength is also emitting a fluorescent signal upon laser excitation with shorter wavelengths, visually check for the dye uptake/spread in the injected target area while illuminating the area with the laser and observing through the filter goggles.\n4. Incubation\nAfter the injection, incubate the brainstems in oxygenated artificial cerebrospinal fluid (ACSF; NaCl: 125 mM, KCl: 2.5 mM, MgCl2: 1 mM, CaCl2: 2 mM, glucose: 25 mM, NaH2PO4: 1.25 mM, NaHCO3: 25 mM, ascorbic acid: 0.4 mM, myo-inositol: 3 mM, pyruvic acid: 2 mM, bubbled with 95% O2 - 5% CO2) at room temperature (RT, 25° C) for 1 - 4 hr, while the dye is being transported. Bubble the solution during the entire incubation period.\nSubsequently, transfer the brainstems in 4% paraformaldehyde (PFA) dissolved in PBS (approx. 100 ml; pH 7 for the PFA/PBS mix) and incubate them at 4° C to allow post-fixation overnight (O/N).\n5. Tissue Slicing and Mounting\nThe next day, wash the brainstem three times in PBS (5 min for each washing step), cover it in 4% agar and then cut into 50 - 80 μm thick slices on a vibratome. Mount slices using a mounting medium on a glass slide, and coverslip.\nOptionally, label the sections with fluorescent Nissl for 25 min (for example blue Nissl at a 1:100 dilution in AB media).\n\t\nTo prepare AB media, mix 250 ml of 0.2 M phosphate buffer (PB; 51 mM KH2PO4, 150 mM Na2HPO4), 15 ml 5 M NaCl, 15 ml 10% Triton-X, 220 ml ddH2O and 5 g bovine serum albumine.\nPrecede and succeed the Nissl labeling step by 3 washing steps in PBS (10 min each).",
    "Note: In cases where thicker sections need to be mounted and analyzed (in experiments described here such slices were 100 - 500 microns thick to preserve axonal connections over bigger distances), the technique can be combined with tissue clearing. We found the ClearT212 to be successful20. When a tissue clearing step is included, perform it before mounting the sections.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}