{
  "id": 19903,
  "origin_website": "Wiley",
  "title": "“SIT” with Emx1-NuTRAP Mice: Simultaneous INTACT and TRAP for Paired Transcriptomic and Epigenetic Sequencing",
  "procedures": [
    "This protocol includes a breeding scheme that generates a line of mice that have excitatory neurons in the neocortex (including the hippocampus) labeled with biotin and mCherry on the nuclear membrane and eGFP on ribosomes. Emx1-NuTRAP mice are healthy, with no signs of phenotypic abnormalities.\nMaterials\nFemale Emx1-IRES-Cre knock-in breeder mice (Jackson Laboratory, strain no. 005628)\nMale NuTRAP breeder mice (Jackson Laboratory, strain no. 029899)\nAdditional reagents and equipment for mouse perfusion, brain removal, tissue sectioning, and immunofluorescence imaging (see Current Protocols article: Paletzki & Gerfen, 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.570#cpz1570-bib-0005]; Tu et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.570#cpz1570-bib-0010])\nNOTE: We recommend ordering at least three female breeders; in our experience, crossing Emx1-Cre females with NuTRAP males yields litter sizes of 4 to 8 pups. Three breeding pairs are usually sufficient to produce enough Emx1-NuTRAP offspring of the same sex to generate four mice/sex/group.\nNOTE: The Emx1-Cre mouse line contributes the Cre driven by the excitatory cortical neuron–specific promoter (Emx1 promoter) that activates the NuTRAP cassette in the Emx1-NuTRAP mouse (Gorski et al., 2002[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.570#cpz1570-bib-0002]). The NuTRAP mouse line contributes the NuTRAP cassette for labeling the cells expressing Cre with biotin and mCherry on their nucleus and eGFP on their ribosomes (Roh et al., 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.570#cpz1570-bib-0007]).\nNOTE: A vivarium with proper environmental controls, housing, and animal feed according to the recommendations of the Jackson Laboratory is required.\n1. Cross female Emx1-IRES-Cre knock-in breeder mice with male NuTRAP breeder mice (see Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.570#cpz1570-fig-0001], step I).\nWe do not use male Emx1-IRES-Cre animals in this cross. Emx1 may allow active Cre in sperm.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/a84271ca-e28c-4fcf-a6df-8d0109332723/cpz1570-fig-0001-m.jpg</p>\nFigure 1\nDiagram of Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.570#cpz1570-prot-0001] for generation of Emx1-NuTRAP mice and dissection of the hippocampus from those mice.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/dfe70507-a3fb-4ab3-9638-5c26d58d8062/cpz1570-fig-0002-m.jpg</p>\nFigure 2\nSchematic of the major steps of the SIT protocol (Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.570#cpz1570-prot-0002]).\n2. Optional: Separate males from the dams when a pregnancy is noted.",
    "We have found that this decreases the litter cannibalization rate.\n3. Wean pups from their dams at P21.\nEarlier weaning may be possible, but qualitatively, we observe this to be a weaning time with high pup survival.\n4. To confirm that the ribosomes and nuclei are fluorescently labeled specifically in hippocampal neurons, perfuse mice, remove brain, section tissue, and perform immunofluorescence imaging according to Tu et al. (2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.570#cpz1570-bib-0010]) or Current Protocols article by Paletzki & Gerfen (2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.570#cpz1570-bib-0005]).\nWe use a traditional immunofluorescent microscope (Keyence BZ-X800), rather than the scanner described in Tu et al. (2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.570#cpz1570-bib-0010]).\nThe mCherry fluorophore could be used to enhance visualization of nuclear labeling.\nThe pairing of homozygous Emx1-Cre with homozygous NuTRAP can only produce offspring that are heterozygous for both alleles. We recommend examining the NuTRAP-expressing tissue by fluorescence microscopy for one mouse from each new pairing to confirm that the parent mice indeed were the intended mice.",
    "This protocol isolates eGFP-tagged ribosomes bound to translating mRNA and nuclei from a single homogenate of NuTRAP-tagged cells. The goal is to pair bulk mRNA sequencing data with epigenetic sequencing data derived from the same set of cells, as this may more directly reflect the epigenetic regulatory mechanisms involved in the observed differential gene expression. The protocol begins with a preparation section that is critical for efficient execution of SIT, and it is important enough that we include it here rather than in the Strategic Planning section. These steps are followed by tissue homogenization and suspension of the cells in a solution containing cycloheximide to bind the mRNA to the ribosomes. The protocol continues with lysing the cell membrane in a buffer followed by filtration with cell strainers that leave the nuclear membrane intact. Then, the biotin-tagged nuclei are incubated with and bound to streptavidin-coated beads, and the supernatant containing the cytoplasmic lysate is employed in a modified TRAP protocol. The nuclei from this preparation can be used in many downstream chromatin analysis applications. Similarly, the isolated TRAP mRNA can be applied in many downstream analyses, such as sequencing.\nMaterials\n1× phosphate-buffered saline (PBS; 1:10 dilution of 10× PBS in molecular-grade water; Genesee Scientific, cat. no. 25-507XB)\nDL-Dithiothreitol (DTT), molecular biology grade (Sigma-Aldrich, cat. no. D9779-1G)\nCycloheximide, 98% (Fisher Scientific, cat. no. NC9651091)\nNuclear preparation buffer (NPB; see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.570#cpz1570-rec-0004]), without cycloheximide and DTT added\nConcentrated TRAP isolation buffer (CTIB; see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.570#cpz1570-rec-0001]; make fresh), without cycloheximide and DTT added\nHigh-salt wash buffer (HSWB; see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.570#cpz1570-rec-0002]), without cycloheximide and DTT added\nINTACT buffer (IB; see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.570#cpz1570-rec-0003])\nProtein G Dynabeads (Novex magnetic beads DYNAL Dynabeads, protein G, Fisher Scientific, cat. no. 10003D)\nMouse anti-GFP antibody (Sigma, cat. no. G6539-100UL, lot no. 128M4867V)",
    "Emx1-NuTRAP mice (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.570#cpz1570-prot-0001]; or another transgenic line expressing NuTRAP cassette in select cell type of interest)\nStreptavidin-coated Dynabeads (SCD; Dynabeads M-280 Streptavidin, Life Technologies, cat. no. 11205D)\nRNeasy Mini Kit (QIAGEN, cat. no. 74134), including RLT, RW1, RDD, and RPE buffers; spin columns; 2-ml collection tubes; and RNase-free water\n70% (v/v) ethanol\nRNase-free DNase (QIAGEN, cat. no. 79254)\n1.7-ml microcentrifuge tubes (Laguna, cat. no. 4060C)\nVortex\nMagnetic stand (MagneSphere Technology Magnetic Separation Stand, 12 position, 1.5 ml, Fisher Scientific, cat. no. PRZ5342)\nNutator (MiniMixer 3-D Shaker Nutator, “10.5 × 7.5” Dimpled Mat, VWR, cat. no. 490012-328)\nRazor blades\nForceps\nDissection scissors\nSterile filter paper–covered petri dishes\nSpatulas\n18G needles (BD PrecisionGlideTM Needle 18G, BD, cat. no. 305195)\n1-ml syringes (BD, cat. no. 309659)\n100-μm cell strainer caps (yellow) on 5-ml tubes (Bundle pluriStrainer® Mini 100 µm and Flow Cytometry Tubes, pluriSelect USA, cat. no. 43-10100-46)\nBenchtop centrifuge (with 5424 R 24 × 2 ml AT-ROTOR, Eppendorf, cat. no. 5404000537), 4°C\n40-μm cell strainer caps (blue) on 5-ml tubes (Bundle pluriStrainer® Mini 40 µm and Flow Cytometry Tubes, pluriSelect USA, cat. no. 43-10040-46)\nMicrocentrifuge, 4°C\nMini centrifuge (TSZ mini centrifuge, max speed 7000 rpm, Fisher Scientific, cat. no. 507514951)\nFluorometer [Qubit 4 Fluorometer, University of California, Irvine, Genomics High Throughput Facility (UCIGHTF)]\nBioanalyzer (Agilent Bioanalyzer 2100, UCIGHTF)\nAdditional reagents and equipment for mouse sacrifice\nCAUTION: Cycloheximide is extremely toxic. Be sure to use proper personal protective equipment and hazardous waste disposal when handling solutions containing it.\nNOTE: Experiments involving RNA require careful technique to prevent contamination.",
    "NOTE: Use barrier tips where pipet tips are needed (e.g., 10-µl barrier tips, Genesee Scientific, cat. no. 24-401; 20-µl barrier tips, Genesee Scientific, cat. no. 24-404; 200-µl barrier tips, Genesee Scientific, cat. no. 23-412; and 1000-µl barrier tips, Genesee Scientific, cat. no. 23-430).\nPreparation\n1. Put 1× PBS on ice.\n2. Thaw cycloheximide and DTT on ice and add to NPB, CTIB, and HSWB (see recipes[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.570#cpz1570-rec-0001]).\n3. Keep NPB, CTIB, HSWB, and IB on ice.\n4. Prepare an appropriate volume of NPB so it will ready immediately after tissue dissection (2 ml buffer per animal; see step 11).\n5. Label five 1.7-ml microcentrifuge tubes for each sample: one for homogenization, one for nuclei for INTACT, and three for ribosomal mRNA for TRAP (one to contain the protein G Dynabeads, one to contain anti-GFP-bound beads, and one to store the eluate from the RNA isolation).\n6. Aliquot 1 ml NPB into each homogenization tube.\n7. For each TRAP isolation, prepare one tube of washed protein G Dynabeads for pre-clearing:\n         \nGently resuspend beads by brief vortexing and pipet 50 µl beads into a 1.7-ml microcentrifuge tube for each sample.\nPlace tube on a magnetic stand for 1 to 3 min.\nSlowly pipet off buffer and add 500 µl NPB to each tube.\nGently resuspend by inversion and repeat steps 7b and 7c.\nPlace tube on the magnetic stand for 1 to 3 min and then slowly pipet off buffer.\nResuspend beads in 50 µl NPB and store on ice or at 4°C until ready for use.\n8. For each TRAP isolation, prepare one tube of washed anti-GFP-coupled protein G Dynabeads for ribosomal GFP binding:\n         \nGently resuspend beads by brief vortexing and pipet 100 µl of beads into a 1.7-ml microcentrifuge tube for each sample.",
    "Place tube on a magnetic stand for 1 to 3 min.\nSlowly pipet off buffer and add 500 µl NPB to each tube.\nGently resuspend by inversion and repeat steps 8b and 8c.\nPlace tube on the magnetic stand for 1 to 3 min and slowly pipet off buffer.\nResuspend beads in 100 µl NPB.\nAdd 2 µl mouse anti-GFP antibody.\nIncubate for 1 hr at 4°C on a nutator.\nPlace tube on the magnetic stand for 1 to 3 min and pipet off buffer.\nAdd 200 µl NPB and gently resuspend by brief vortexing.\nPlace tube on the magnetic stand for 1 to 3 min, remove buffer, and resuspend in 100 µl NPB.\nBead washes ensure that the solution that the beads and cells are suspended in is not affected by the buffer that the beads are shipped in.\nTissue homogenization (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.570#cpz1570-fig-0001], steps II and III, and Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.570#cpz1570-fig-0001], steps I and II)\n9. Sacrifice Emx1-NuTRAP mice (or another transgenic line expressing the NuTRAP cassette in a select cell type of interest) using methods approved by the Institutional Animal Care and Use Committee.\nWe use rapid cervical dislocation at the age required for the experiment in order to capture gene expression unaltered by anesthetics or stress.\n10. Dissect mouse brain to remove the whole hippocampal formation according to Sultan (2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.570#cpz1570-bib-0009]):\n         \nDecapitate mouse using a razor blade.\nUsing gloved hands and forceps, peel away skin on the skull and use dissection scissors to open skull.\nRemove brain and place on a sterile filter paper–covered petri dish (acting as a dissection stage). Rinse brain with cold 1× PBS.\nMake a midsagittal cut using a razor blade.\nPin cerebellum with one spatula and, with another, peel back cortex.",
    "With the spatula that pulled back the cortex, scoop out circumscribed curved hippocampal structure.\nTransfer this hippocampus to another petri dish for the following steps.\nThe tissue may be flash-frozen on dry ice and stored ≤3 months at −80°C before use. You may use any other tissue as long as cells within the selected tissue express the NuTRAP cassette; however, this protocol is optimized for hippocampal tissue. To use this protocol with other tissues, you may have to adjust the volume of NPB used relative to the sample size. The goal would be to lyse the cells without disrupting the nuclear membranes or saturating the NPB solution with lipids (which would lead to an incomplete homogenization).\n11. After tissue dissection, add about 700 to 800 µl NPB (from the 1-ml aliquot from step 6) to tissue and use a razor blade to quickly chop and mince tissue.\nWe have found that hippocampal tissue thawed after being flash-frozen works well with this procedure.\n12. Collect tissue using a P1000 pipet and add to the homogenization tube (total volume of 1 ml NPB).\n13. Homogenize tissue on ice slowly and thoroughly by drawing through a 18G needle and 1-ml syringe 50 times.\nSometimes this will not fully homogenize the tissue, but we have found this amount of homogenization to be sufficient regardless. Experimenter judgment can be used here.\nNuclear isolation (Fig 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.570#cpz1570-fig-0002], steps III, IV, and V2)\n14. Add homogenized tissue sample to a 100-μm cell strainer cap (yellow) on a 5-ml tube.\nThis helps separate the cells and more fully homogenize the sample.\n15. Centrifuge 10 min at 1000 × g, 4°C, to filter supernatant. During this spin, prepare an appropriate volume of CTIB (200 µl per animal).\n16. Wash SCD:",
    "Resuspend beads by brief vortexing and add 100 µl SCD per animal to a 1.7-ml microcentrifuge tube.\nIncubate for 3 min on a magnetic stand.\nRemove supernatant.\nAdd 1 ml NPB and vortex briefly.\nRepeat steps 16b to 16d.\nResuspend beads in 100 µl NPB per 100 µl SCD used.\n17. Resuspend cell pellet from step 15 (still in the 5-ml tube) in the NPB that remains in the tube. Add sample to a 40-µm cell strainer cap (blue) on a 5-ml tube.\nThis step aims to better lyse the cell membrane and leave only suspended nuclei in the solution.\n18. Centrifuge 10 min at 1000 × g, 4°C, to filter supernatant.\n19. Add 100 µl washed SCD (see step 16f) to each tube.\n20. Resuspend beads by briefly pipetting up and down. Incubate for 20 min on ice and then resuspend and transfer resuspended beads to a 1.7-ml microcentrifuge tube (INTACT tube).\n21. Place tubes on a magnetic stand for 3 to 5 min to pull down the beads (nuclei are bound to these).\n22. Slowly collect supernatant with a P1000 pipet and save for TRAP isolation procedure (see steps 27 to 35) in the ribosomal mRNA tube from step 5.\n23. Slowly add 1 ml IB to beads while still on the magnetic stand to wash.\n24. Pipet off IB slowly.\n25. Repeat steps 23 and 24.\n26. Ensure that beads do not dry out by continuing to a downstream analysis protocol immediately.",
    "At this step, the beads will be carrying the isolated nuclei. We use 100 µl IB to resuspend the nuclei and beads if we want to freeze for future downstream analysis. We use the Quick-DNA Microprep Plus Kit (Zymo Research, cat. no. D4074; no modifications to the manufacturer's instructions) to isolate genomic DNA for quality control.\nTRAP isolation procedure (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.570#cpz1570-fig-0002], steps V1 to VIII)\n27. Add 100 µl CTIB to each 1 ml of supernatant from step 22.\nThis brings the solution concentrations to that required for a normal TRAP isolation.\n28. Centrifuge 10 min at 16,000 × g, 4°C, in a microcentrifuge.\n29. Collect all clear supernatant and transfer to a tube containing 50 µl washed protein G Dynabeads from step 7f (avoid any pellet or top lipid layer).\nOptional: Save 50 µl of each sample in a new tube and keep on ice. RNA from this will be extracted for use as a total RNA input control.\n30. Incubate for 30 min at 4°C on a nutator.\n31. Incubate for 3 min at 4°C on a magnetic stand to pellet beads and transfer supernatant to a tube containing 100 µl washed protein G Dynabeads bound to anti-GFP antibody from step 8k.\n32. Incubate for 2 hr (or overnight) at 4°C on a nutator.\n33. Slowly pipet off supernatant.\n34. Wash beads three times by resuspending in 1 ml HSWB, incubating at 4°C on a magnetic stand for 3 min, and then removing supernatant.\n35. Pipet off wash buffer and resuspend beads in 350 µl RLT buffer (from the RNeasy Mini Kit) by slowly pipetting up and down. Incubate for 30 min at 4°C on a nutator and then proceed to RNA purification.\nRLT buffer is necessary, as this contains reagent to bind RNA to the column.",
    "Steps 36 onward are the instructions from the RNeasy Mini Kit, with minor adaptations to apply to this protocol specifically.\nRNA purification\n36. Incubate sample for 3 min at 4°C on a magnetic stand to pellet the beads. Meanwhile, prepare one new 1.7-ml microcentrifuge tube as a collection tube for each TRAP-isolated mRNA sample.\n37. Add 350 µl of 70% ethanol to each tube.\n38. Prepare one RNeasy spin column in a 2-ml collection tube for each purification to be performed.\n39. After the spin, carefully pipet the 350 µl supernatant out of each tube, leaving pelleted beads, and transfer to corresponding RNA tube containing the equal volume of 70% ethanol from step 37 (700 µl total volume per tube). Mix immediately by pipetting up and down.\n40. To each RNA spin column, add the 700 µl ethanol/RNA mixture.\n41. Centrifuge 15 s at 9500 × g and discard flowthrough (but save the collection tube).\n42. Centrifuge 15 s at 9500 × g again and discard flowthrough.\n43. Add 350 µl RW1 buffer to each column and centrifuge 15 s at 9500 × g. Discard flowthrough.\n44. Prepare DNase solution by adding 10 µl stock RNase-free DNase (at −20°C) to 70 µl RDD buffer (at 4°C) for each column. Mix by inverting and centrifuge briefly in a mini centrifuge.\n45. Carefully add 80 µl DNase incubation mix directly to column matrix.\n46. Incubate at room temperature for 15 min.\n47. Add 350 µl RW1 buffer to each column and centrifuge 15 s at 9500 × g. Discard flowthrough.\n48. Add 500 µl RPE buffer to each column and centrifuge 15 s at 9500 × g. Discard flowthrough.\n49. Add 500 µl RPE buffer to each column and centrifuge 2 min at 9500 × g.",
    "50. Carefully transfer column to a new 2-ml collection tube, being sure not to let it contact the flowthrough to avoid ethanol contamination. Discard old collection tube and flowthrough.\n51. Centrifuge 1 min at maximum speed.\n52. Carefully transfer spin column to a 1.7-ml collection tube from step 36.\n53. Add 30 µl RNase-free water directly to column matrix.\n54. Centrifuge 1 min at 9500 × g.\n55. Discard spin column, ensure that each tube is labeled correctly, and store at 80°C.\nThis eluate contains the RNA.\n56. Quantify RNA with a fluorometer and determine RNA quality using a bioanalyzer (see example data in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.570#cpz1570-tbl-0001] and Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.570#cpz1570-fig-0003]).\nThe RNA can now be used for downstream analysis.\nTable 1.\n                Qubit Concentrations\ntable:\n﻿Type,Concentration (by Qubit),RIN (if RNA),Original tissue description,Sample\nRNA,66.6 ng/μl,8.4,P42 mouse hippocampus,Unilateral\nDNA,10.4 ng/ml,,P42 mouse hippocampus,Unilateral\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/8527e134-5c90-40ce-bca2-23b9cc7ebfe2/cpz1570-fig-0003-m.jpg</p>\nFigure 3\nRepresentative Agilent Bioanalyzer traces for SIT-isolated RNA (RNA Pico) (A) and DNA (high sensitivity) (B)."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}