{
  "id": 6412,
  "origin_website": "Bio",
  "title": "On-demand Labeling of SNAP-tagged Viral Protein for Pulse-Chase Imaging, Quench-Pulse-Chase Imaging, and Nanoscopy-based Inspection of Cell Lysates",
  "procedures": [
    "This protocol uses fluorescence light microscopy to reveal stable assemblies of SNAP-nsP3 protein that persist in cell lysates. It is partly based on an isolation protocol (Wheeler et al., 2017) that has been used to determine the proteome and substructure of stress granules (Jain et al., 2016). Our protocol adds additional flexibility in labeling (by using the SNAP labeling system) and detection (by using the sensitive ZEISS LSM 880 Airyscan confocal imaging system). Note: Carry out all liquid handling steps that involve live cells inside the biosafety cabinet. Only use sterile pipettors, pipets, micropipettors, microtubes, and tips. After cell lysis, users can handle samples outside the biosafety cabinet. Wear safety glasses when handling formaldehyde solutions. Detach stable CHIKV cells with trypsin and seed in at least one well of a 6-well microtiter plate. Also, detach and seed naïve cells, which do not express SNAP-tagged proteins, in at least one well; these cells will serve as a negative control.Incubate cells under standard growth conditions (i.e., 37 °C at 5% CO2) overnight.On the next day, take frozen SNAP Cell® TMR-Star from -20 °C freezer and thaw at room temperature. In a 1.5-ml microtube, dilute SNAP-Cell® TMR-Star 1:600 (final concentration of 1 µM) dilution in complete cell culture media. Prepare at least 1 ml per well to cover the entire area of the well. Vortex briefly (for ≥ 5 s) or pipet the diluted labeling solution up and down (ten times). We have only validated this protocol with the SNAP-Cell® TMR-Star reagent. However, the protocol should also be compatible with SNAP-Cell® 647 SiR. Use the same labeling conditions as described in Protocol 1 (i.e., 1:1,000 dilution, 15 min incubation).Note: Recipe for two dishes, scale accordingly for additional dishes:           1996.8 µl Complete Cell Culture Media           3.",
    "2 µl SNAP-Cell® TMR-Star Spin diluted labeling solution for 5 min at maximum speed (≥ 12,000 x g) to remove possible insoluble fluorescent debris. Take care not to disturb the pellet when removing supernatant (which may be invisible).Replace the medium on stable CHIKV cells with 1 ml of SNAP-tag labeling medium (pre-heated to 37 °C in a water bath). Also, replace medium in the ‘negative control’ well. Incubate for 15 min at 37 °C, 5% CO2.Note: We found that a 15-min incubation gave us optimal labeling. According to the manufacturer, optimal reaction times range from 5 to 30 min, respectively, depending on experimental conditions and expression levels of the SNAP-tagged protein. Wash the cells three times each with 2 ml of tissue culture medium containing serum (pre-heated to 37 °C in a water bath). Do not remove media after the final wash.Place cells back into the humidified incubator for another 45-60 min.We use an extended wash-out period (compared to Protocol 1) to reduce the non-specific background-binding further. Moreover, we do not add ProLong Gold Live in this protocol, as live-cell imaging is only limited to an optional quality-control-step in Step 8.Optional: Confirm fluorescent staining of SNAP-nsP3 with microscopyA basic widefield fluorescent microscope equipped with a 10x or 20x objective is sufficient to evaluate the quality of SNAP-labeling through the microscope eyepiece. If documentation of staining quality is needed, take pictures with a connected camera. Also, confirm the absence of staining in the well that contains negative control. We recommend this step when testing labeling conditions for the first time. Perform imaging quickly and proceed to Step 9 as soon as possible to limit the deterioration of cell health. If this is not logistically possible, we recommend proceeding to Step 9 directly.",
    "Replace complete cell media with 1 ml PBS and use separate cell scrapers to detach cells from growth area in each well. Transfer the resulting cell suspension to a 1.5 ml microtube. Pellet cells at 1,500 x g, 3 min at room temperature. Remove supernatant. Optional pause point: We freeze pellets at ≤ -20 °C if we want to carry out lysis at a later time. Lyse pellets by adding 300 µl of ice-cold Glasgow Lysis buffer containing protease inhibitors (see Recipes). Ensure complete re-suspension of pellet through repeated pipetting, flicking the tube, or vortexing. If pellet came from the freezer, thaw on ice for 5 min before adding lysis buffer. Vortex Lysates for 30 s. Place on ice for 30 s. We return samples to ice in between vortexing cycles to prevent an extended incubation period at room temperature. Alternatively, lysates can be vortexed in a cold room.Repeat Step 11 three times.Spin at 850 x g for 5 min at 4 °C to remove remaining cellular debris.Note: We do not further purify assemblies of SNAP-nsP3 after this step but instead use the crude supernatant in the microscopic analysis. It would be interesting to test whether subsequent centrifugation at 18,000 x g can pellet assemblies of SNAP-nsP3; this step is essential in the isolation of a pure population of stress granule cores (Wheeler et al., 2017). After this step, users can handle cell lysates outside a biosafety cabinet. Transfer the entire volume of supernatant to a two-well Ibidi chambered plastic slide. Discard pelleted cellular debris. Note: We have noticed that the supernatant may appear turbid at this step. Proteins that are components of RNPs are known to undergo liquid-liquid phase transitions, and turbidity is due to the formation of small protein-rich droplets (Molliex et al., 2015).",
    "However, we have not yet tested whether purified SNAP-nsP3 can form similar droplets in solution. Incubate overnight at 4 °C in a humidified environment in the dark.To obtain humidified conditions, we cover the Ibidi slide with the supplied plastic cover and place the slide in a 10-cm Petri dish that also contains moistened paper (e.g., cut sheets of Western blotting filter). We further seal dishes with Parafilm M and wrap them in aluminum foil to prevent light exposure. We incubate overnight to give assemblies of SNAP-nsP3 enough time to settle to the bottom of the chamber. Future experiments may determine the minimum duration for deposition of SNAP-nsP3 to the bottom of the chambered slide; this information would be useful for reducing the overall time required to complete Protocol 3. In a fume hood, add 1 ml of 4% formaldehyde to wells containing cell lysates. Incubate for one hour at room temperature. Note: Slowly dispense formaldehyde with a micropipette. We add this step to fix assemblies of SNAP-nsP3; fixation reduces the likelihood that the assemblies detach from the well surface during subsequent washing steps.  Wash wells three times with PBS. Ensure that wells do not dry out in between washes. Transfer slide to microscopy system of choice:As described in Protocol 2, we use the ZEISS LSM 880 imaging system operated in Airyscan mode. Use the appropriate filter settings for TMR-Star, which should have an excitation maximum at 554 nm and an emission maximum at 580 nm. Also, acquire an image in brightfield mode. This image can provide an additional record of the examined biostructure.We recommend taking at least three images for each experiment: We acquire images with the 63x objective. Export processed Airyscan files to Icy bioimaging software.",
    "Adjust the image contrast within the Icy software by dragging the boundaries of the viewing range in the software’s histogram viewer (see Figure 4, arrows). We prefer viewing the SNAP-nsP3 channel with the ‘Fire’ colormap. Use Icy’s controls to zoom into regions-of-interest. See Figure 4 for representative images. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190218/20190218002118_2685.jpgFigure 4. Analysis of cell lysates with Airyscan microscopy. We processed samples according to Protocol 3 and detected granular structures containing TMR-Star-labelled SNAP-nsP3. We chose the ‘Fire’ colormap in Icy to display signals from the TMR-Star staining. We also adjusted image contrast by dragging the adjustable bounds of the histogram viewer (marked by arrows). We acquired images at a zoom factor of 1 with a 63x objective. During image processing, we also magnified regions-of-interest (ROI) by increasing the digital zoom within the Icy software (i.e., by a factor of 3.3 for ROI1 and 20 for ROI2). Lastly, we also acquired a brightfield channel to provide a reference and reveal all contrast-producing structures present in the lysate."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}