{
  "id": 3793,
  "origin_website": "Cell",
  "title": "Protocol for transgenerational learned pathogen avoidance behavior assays in Caenorhabditis elegans",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nInoculate bacteria in liquid culture for training plates and seed worm maintenance plates: day 1\nTiming: 15 min\nBacterial colonies from freshly streaked plates are used to inoculate liquid culture. These overnight cultures will be used in the next step to seed plates used to train worms. Additionally, worm growth plates will be seeded using a healthy stock of liquid OP50.\nInoculate 6 mL of LB media with bacteria from single colonies using a sterile inoculating loop.\nAdjust the amount of LB inoculated based on the number of training plates required. 1 mL will be used for each training plate. To test P0 worms and subsequent generations, prepare enough bacteria for 6 training plates per bacteria and condition (i.e., worm genotype) tested.\nLB is suitable for growth of most bacteria. Use appropriate growth media for strains, as needed.\nE. coli expressing P11/empty vector are grown in LB + 100 ug/mL carbenicillin + 0.2% (w/v) arabinose.\nUse an appropriately sized tube to ensure proper aeration during growth. A 14 mL round bottom conical is suitable for 6 mL of LB.\nOptional: Worms can be raised on RNA interference (RNAi) to knock down individual gene expression. To adapt this protocol for RNAi use, inoculate LB + 100 ug/mL carbenicillin + 12.5 ug/mL tetracycline with a colony or glycerol stock from a sequence-verified RNAi clone. This step is performed on day 0 (1 day prior to the start of the experiment).\nGrow bacteria at 37°C overnight (16–22 h), shaking at 250 rpm.\nBacteria should be grown for a minimum of 8 h, but not to exceed more than 16 h. If a biofilm forms (PA14), do not use the culture.",
    "Seed HG 10 cm plates with 1 mL of OP50 grown from “before you begin[href=https://www.wicell.org#before-you-begin]” (or RNAi bacteria on HG RNAi plates, if using) per plate. These will be used to bleach worms onto for day 2 of the experiment.\nSeed three 10 cm HG plates per genotype.\nOP50 plates need to be seeded with sufficient time to ensure they are completely dry, but not so old that these plates crack (at minimum one day before use).\nOptional: For RNAi use, seed HG RNAi plates with RNAi cultures prepared on day 0.\nNote: A stock of pre-prepared LB + 100 ug/mL carbenicillin + 0.2% (w/v) arabinose can be maintained at 4°C for up to 1 week, or prepared fresh each time.\nSynchronize worms, prepare training plates, and inoculate bacteria for choice assay plates: day 2\nTiming: 1–2 h\nIn this step, healthy adult worms are bleached to obtain a synchronized population of eggs. These animals will be used on day 4 for training. The plates required for training will also be prepared. Finally, liquid cultures of bacteria will be inoculated (separate from the cultures on day 1) that will used to seed choice assays plates on day 3.\nSynchronize worm population: Bleach worms to be used for experiments onto HG OP50-seeded plates (or HG RNAi-seeded plates, if using) (∼250–350 eggs per plate).\nWash gravid worms off 3 HG plates with M9 and pour (or use wide-orifice pipette to collect) M9 + worms into a 15 mL conical.\nAllow worms to settle (do not centrifuge). To obtain enough eggs for the experiment, the resulting worm pellet should be roughly 300 μL.\nRemove supernatant using a vacuum, making sure not to disturb the worm pellet.\nAdd 5 mL of bleach solution.\nPlace tube onto nutator to shake.",
    "Check on worms every 5 min for the first 15 min. Once worms start to dissolve, check every 2 min until the majority of worm bodies have dissolved (about 99% of the worms should be dissolved).\nUsing a table top centrifuge, spin bleached worms for 1 min at 160 × g (1,000 rpm in a clinical centrifuge). There will be a small white pellet at the bottom of the tube containing embryos.\nUse a vacuum to remove all of the bleach solution.\nAdd 2 mL of M9 and spin embryos again for 1 min at 1,000 rpm.\nRemove supernatant and repeat wash 2 times.\nPlate eggs (250–350 eggs) onto each of the 3 OP50-seeded HG plates prepared on day 1. This is performed by estimating the density of eggs in M9 by counting 2 μL of the egg suspension on a slide using a dissecting microscope.\nPlace synchronized embryos on HG plates into a slightly opened container and in a 20°C incubator.\nIncubate worms for 2 days at 20°C for use on day 4.\nOptional: For RNAi use, HG RNAi plates seeded on day 1 are induced with IPTG before use. Using sterile conditions, place a total of 200 μL of 0.1 M IPTG in small spots all over the HG RNAi lawn. Allow IPTG to dry before plating bleached eggs as in step 4 (∼1 h).",
    "Critical: Bleaching is usually performed on the morning of day 2 (48–52 h before training) to allow sufficient time for worm development. Worms that are too young during training (pre-L4 stage) on PA14 will arrest and are not suitable for the standard assay described here. Additionally, arrested animals will not make progeny, interfering with the transgenerational portion of this assay. Bleaching in the morning is recommended so that worms are the appropriate age on the morning of day 4 of the experiment, and allows the steps on day 5 to be performed during convenient daytime hours.\nCritical: Worms should never be centrifuged prior to the addition of bleach. Allow worms to pellet by gravity on the bench. Centrifugation can cause physical damage/induce stress.\nPrepare training plates: For each genotype, obtain the following numbers of plates.\nOP50 = at least four 10 cm NGM plates per genotype of worms being tested.\nPA14 = at least four 10 cm NGM plates per genotype of worms being tested.\nE. coli expressing P11 or empty vector = at least four 10 cm plates (10 cm NGM + 100 ug/mL carbenicillin + 0.2% w/v arabinose) per genotype of worms being tested.\nSeed OP50 plates with 1 mL of liquid OP50 culture (prepared from “before you begin[href=https://www.wicell.org#before-you-begin]” section) per plate.\nSeed E. coli expressing P11 or empty vector plates with 1 mL of overnight culture (prepared from step 1) per plate.\nSeed PA14 plates with 1 mL of diluted overnight culture PA14 per plate (prepared from step 1), as follows.\nUse a nanodrop or other spectrophotometer to determine OD of PA14 liquid culture.\nDilute the overnight culture of PA14 to an OD600 nm = 1 using LB.",
    "For a healthy liquid PA14 culture (Figure 1[href=https://www.wicell.org#fig1]), this dilution corresponds to about 1 mL of PA14 overnight culture into 3 mL of LB.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/515-Fig1.jpg\nFigure 1. Appearance of liquid bacteria cultures\nOvernight cultures of OP50 (left) and PA14 (undiluted, right). PA14 grown in the proper condition appears blue when aerated.\nNote: If the PA14 bacteria are too concentrated, motile spots and biofilms will form. These conditions will kill worms very rapidly.\nCritical: Training plates need to be fully seeded with bacteria so that there are no unseeded areas of the plate. Worms on pathogenic bacteria may move to areas without bacteria if there are empty spots, which could affect training.\nPut all plates right side up into a large plastic container and into a 25°C incubator for 2 days. Do not seal the box containing the plates. These plates must fully dry, otherwise worms will swim and/or arrest. Allowing the plates to come to room temperature (20°C–23°C) before seeding with bacteria helps ensure drying.\nTo prepare bacteria for choice assay plates, inoculate bacteria in liquid culture as in step 1.\nCalculate the amount of liquid culture needed to seed choice assay plates. 25 μL of each bacteria (OP50 and diluted PA14) is used for each spot per plate.\nMaintain stock of OP50 as needed.\nInoculate pathogenic bacteria (from single colonies on streaked out plates) in LB or appropriate growth media (i.e., for E. coli expressing P11/Empty vector).\nPrepare choice assay plates: day 3\nTiming: 2–3 h\nTake the appropriate number of 60 mm NGM plates out of fridge and let warm to room temperature (20°C–23°C) before use.\nUse at least 10 choice assay plates per condition tested.",
    "Prepare several extra choice assay plates to replace any that need to be discarded due to contamination or irregular spread of bacterial spots.\nArrange the 60 mm plates in stacks of 5 upside down (bottoms up).\nUsing a black permanent marker, dot the bottom center of each plate (for OP50), and dot the top center of the plate with another color (for PA14/pathogen).\nDots should be as far apart as possible on the plates. See Figure 2[href=https://www.wicell.org#fig2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/515-Fig2.jpg\nFigure 2. Choice assay plate setup\nLeft, illustration of choice assay plate. X = origin, yellow = OP50 spot, Blue = pathogen spot (PA14). Right, plate seeded with PA14 and OP50 and incubated for 2 days at 25°C. PA14 spot appears darker than OP50, but may not appear blue.\nTurn plates right side up.\nFor PA14, dilute bacteria as on day 2 (step 5f).\nUsing a repeating pipette with a sterile tip, carefully pipette 25 μL of OP50 onto the agar where the black dot is marked.\nUsing a new sterile tip, pipette 25 μL of other bacteria (for PA14, used diluted sample) onto the other dot.\nNote: When preparing choice assay plates, bacteria spots should not be plated so close to the edge of the plate that worms will be forced onto the vertical walls of the plate.\nNote: For experiments in which worms are raised on RNAi bacteria, the choice assay remains the same (OP50 vs. PA14).\nAllow plates to dry at room temperature (20°C–23°C) before moving them (∼30 min).\nNote: Spots of bacteria may shift if the plates are moved before they are dry, causing greater and/or uneven distribution of bacteria on the choice assay plates. Discard any plates in which the bacteria are present outside of the designated spot.",
    "Move dry plates face up into a plastic container and place in a 25°C incubator for 2 days.\nCritical: Choice assay plates must be moved to an incubator with a constant temperature of 25°C. It is important that both the training plate and choice assay plates are prepared in this manner.\nOptional: If transgenerational inheritance of learned behavior will be tested in the F1 generation, use 1 mL of OP50 to seed each of two 10 cm HG plates per strain and condition being tested. Incubate plates at room temperature for use on day 5 of the protocol. Seed additional plates if more F1 progeny are required.\nTrain worms for aversive learning: day 4\nTiming: 1 h\nL4 worms from day 2 (48–52 h after bleaching) are washed from the growth plates and transferred to training plates. If worms were bleached on the morning of day 2, the following steps for day 4 are performed during the morning or early afternoon. Worms are then incubated for 24 h for training.\nTake training plates out of 25°C incubator and let come to room temperature (20°C–23°C).\nNote: If training worms on E. coli expressing P11, both empty vector (control) and P11 training plates need to be induced with 0.1% arabinose prior to use. Place a total of 200 μL of 0.1% (w/v) arabinose in small spots all over training plates. Allow arabinose to fully dry at room temperature prior to continuing to step 17 (∼ 1 h).\nObserve the worms intended for training—approximately 90% of the population must be at least at the L4 stage.\nWash worms using M9 into a 15 mL conical tube, and let them settle by gravity.\nCritical: NEVER centrifuge worms to pellet them (Kauffman et al., 2010[href=https://www.wicell.org#bib7]). Centrifugation can interfere with behavior.",
    "Remove supernatant, leaving some M9 behind (about 50 μL of extra M9 per 100 μL of worms).\nCritical: Do not leave worms in M9 for extended periods of times, since this can lead to starvation/stress. Worms should be washed and plated quickly.\nPlate worms onto training plates.\nUse your index finger to lightly tap the worms to resuspend them.\nUsing wide-orifice tips, and making sure not to puncture the agar, pipette 10 μL of worms onto OP50 or transgenic E. coli plates (any more than this and the worms will starve by the end of the 24 h training period).\nUsing wide-orifice tips, pipette 10 μL of worms onto pathogenic bacteria plates – (worms will not run out of PA14 by 24 h. Also, the recovery from PA14 plates is lower since the lawns are very thick).\nNote: Results do not differ when more worms are trained on each PA14 training plate. Up to 40 μL of worms can be used per PA14 plate, without affecting the results compared to training equal numbers of worms on OP50 and PA14 plates. Increasing the number of worms per PA14 plate improves worm recovery for choice assays and bleaching following training.\nNote: When pipetting worms onto training plates, pipette from the middle of the worm suspension. This will help ensure an equal number of worms on each plate. Worms settle rapidly. Tap tube as needed to keep worms resuspended.\nAllow the M9 spot of worms to dry, and put plates into a 20°C incubator with the lid of the container cracked.\nDo not put PA14 plates in the same box as OP50, since volatile odorants from PA14 may interfere with worm training.\nIncubate plates at 20°C for 24 h. The training time must be precise.\nAversive learning behavior assay: day 5",
    "Timing: 3–6 h\nIn this step, a subset of the trained worms is washed from the training plates and used to test the behavior of the population using the prepared choice assays. The remaining trained worms are used to collect the next generation of progeny.\nTake choice assay plates out of the 25°C incubator at least 1 h before use.\nSet aside a subset of worms on training plates to be used for collection of the next generation (F1). Half of the worms (2 of the 4 training plates) are used during step 37 to obtain F1 synchronized embryos via bleaching. These plates are left at 20°C until step 37, which should be performed as close to the end of the 24 h training period as possible.\nThe worms used for behavior testing on choice assay plates are not the same worms used to bleach for F1 collection, but they do derive from the same batch of trained animals.\nFor the choice assay, use M9 to wash worms off of the remaining training plates and into a 15 mL conical, being careful not to carry over large chunks of bacteria. Wash worms 2 more times to ensure no food from the training plates is carried over. If there is food in the washed worm pellet, worms will not move from the origin.\nAllow worms to pellet by gravity, do not disrupt worm pellet.\nLay out choice assay plates and remove lids.\nWhile worms are settling, place 1 μL of sodium azide (used at 400 mM, diluted in water) onto the center of each bacterial spot.",
    "Critical: Do not spot choice assay plates with sodium azide until immediately before use. Sodium azide should be put onto the bacteria spots right before trained worms are washed off the plate in preparation for the assay. Sodium azide is used to paralyze worms so that the worm’s first choice is recorded. Left too long on plates, sodium azide will diffuse broadly, and this will cause worms to be paralyzed far away from the bacterial spots. Worms are counted if they are within a few millimeters of the bacterial spot. The remaining worms are censored. If the majority of the worms are paralyzed outside of a few millimeters of the bacterial spots, the entire plate is censored. (If the experiment is performed as described, censoring occurs in <1% of all choice assay plates, and <1% of the worms on those rare plates are censored. The number of censored animals should be recorded during data collection.)\nLabel bottoms of plates or place a piece of tape by the plates to label the genotype and condition being testing.\nCarefully remove supernatant from washed worms.\nLeave some M9 on top of pellet (∼50 μL of M9 per 100 μL of worms).\nUsing your index finger, gently tap the worm pellet into suspension immediate before pipetting worms.\nUsing a wide-orifice pipette tip, place 5 μL of the resuspended worm pellet on the bottom of the plate (origin), midway between the two bacteria spots (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/515-Fig3.jpg\nFigure 3. Initial appearance of the choice assay plate\nChoice assay plate shortly after worms are placed at origin.\nWhen sticking your pipette tip into the worm pellet, take worms from the top of the resuspension. This will help ensure that a reasonable number of worms are being measured in the choice assay.",
    "Note: For the choice assay plates, aim for 75–200 worms per plate. Overcrowding on choice assay plates may affect behavior, and makes counting more challenging.\nClose lids and wait 1 h.\nNote: The 1 h incubation for the choice assay is the preferred time to proceed to step 37, where worms on the remaining training plates are bleached to obtain the F1 progeny.\nCount number of worms on each spot (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/515-Fig4.jpg\nFigure 4. Choice assay plate 1 h following the addition of worms\nAll of the worms are paralyzed on either the PA14 or OP50 spot, which measures the worms’ first choice. This is in contrast to other pathogen learning assays that allow worms to continually move on the plate (Ooi and Prahlad, 2017[href=https://www.wicell.org#bib9]).\nRemove lid and place plate upside down (with bottom of plate facing up) on a dissecting microscope. Manually count each worm, marking off each worm that is already counted using a fine-tip marker.\nRecord the number of worms at each spot.\nDo not count worms that are burrowed into the agar.\nDo not count worms that remain at the origin.\nIf the bacterial spots are too close to the sides of the plate, plates may need to be tilted to observe worms that are paralyzed near the wall.\nNote: Plates should be counted at the end of the 1 h behavior assay. Worms left too long on plates in the presence of azide will explode, which will interfere with counting.\nCalculate Choice Index.\nTo collect the progeny of trained worms, bleach the remaining trained animals (as described for day 2), and plate eggs onto OP50-seeded HG plates.\nPlace plates with eggs in a 20°C incubator. Incubate 72 h until worms develop to day 1 of adulthood.",
    "To test for transgenerational memory in F1 animals, repeat protocol starting at day 2, omitting the step for training worms.\nP0 worms trained on PA14 or P11 small RNA pass on the transgenerational memory through the F4 generation compared to controls (Kaletsky et al., 2020[href=https://www.wicell.org#bib5]; Moore et al., 2019[href=https://www.wicell.org#bib8]). The F1 through F4 generation are each grown on OP50-seeded HG plates until day 1 of adulthood, at which time a subset of worms is tested for behavior and a separate subset is bleached to obtain the next generation. Since N2 animals produce more progeny than needed for behavior assays and worm propagation, the remaining worms are discarded. Repeat protocol for additional generations, as needed."
  ],
  "subjectAreas": [
    "Model Organisms",
    "Behavior",
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Ecology & Environmental Biology"
  ]
}