{
  "id": 19164,
  "origin_website": "Jove",
  "title": "Modeling and Imaging 3-Dimensional Collective Cell Invasion",
  "procedures": [
    "1. Retroviral labeling of cells with fluorescent proteins\nPlate retroviral packaging cells (e.g. Phoenix) out at 0.25 x 106 cells per well of a 6-well dish in 10% fetal bovine serum (FBS)/DMEM.\nTransfect cells with retroviral DNA 48 hours later cells using Effectene according to the manufacturers' instructions.\nRinse wells twice with medium 24 hours later, then add 1.5 ml of 10% FBS/DMEM per well.\nCollect packaged virus in tissue culture medium 48 hours later by pipetting and transferring to 2 mL microcentrifuge tubes.\nCentrifuge at 1600 rpm for 5 min to pellet any cells.\nRemove supernatant to a clean tube and store at -80°C.\nCells to be retrovirally transduced are plated out at 1.5 x 105 cells per well of a 6 well dish and placed in a humidified incubator at 37°C overnight.\nThe next day, remove the media from the cells and add 1 ml of virus stock supplemented with 4 μl polybrene (2 mg/mL) to each well. Replace plates in incubator.\nFollowing incubation for 5-6 hours, add 2 ml 10% FBS/DMEM to each well and plates are replaced in 37°C inbubator overnight.\nThe next day, replace the media and allow cells 24 hours before adding appropriate selective media.\nWhen confluent (which depends on the growth rate of the cells, and efficiency of the retroviral transduction, but typically takes from 4-14 days), trypsinize cells and sort for fluorescence using non-transduced cells as a reference, collect and pool cells with fluorescence greater than non-transduced cells and freeze aliquots at -80° C for future use.\n2. Inverse Matrigel invasion assay\nSlowly thaw an aliquot of complete Matrigel (i.e. containing growth factors) on ice (Figure 1A).",
    "Once defrosted, dilute Matrigel 1:1 in ice cold PBS (along with any other additional treatments at 2x concentration in the PBS prior to dilution; Figure 1B). To make it easier to handle Matrigel before polymerization, all plasticware (e.g. tips, tubes, etc.) should be ice cold.\nInsert as many 8 micron pore 6.5 mm diameter uncoated Transwells as required into the wells of a 24 well tissue culture plate, then carefully pipette 100 μl of the diluted Matrigel into the wells and leave to incubate for ˜30 mins at 37°C to solidify (Figure 1C).\nDuring this time, prepare one or more fluorescently-labeled cell suspensions at between 1 to 4 x 105 cells per ml, depending on cell line, from each pre-treated condition (e.g. siRNA, drug treatment) in their normal growth medium (Figure 1D).\nWhen the Matrigel has solidified, invert the Transwells and pipette 100 μl of the cell suspension onto the upward facing underside of the filter (Figure 1E).\nCarefully cover the Transwells with the base of a 24 well tissue culture plate, making contact with each droplet of cell suspension (Figure 1F).\nIncubate the plate in the inverted state for 4 hours to allow for cell attachment (Figure 1G).\nFollowing this time, turn the plates right-side-up and wash each Transwell by sequential dipping into 2 x 1 ml serum free medium (Figure 2A).\nLeave the Transwells in a third well containing any drugs or treatments required (Figure 2B).\nGently pipette 100 μl of 10% FBS/DMEM plus chemoattractant (e.g. EGF at 25 ng/ml) into the Transwell on top of the solidified Matrigel/PBS mixture, replace the lid and incubate for 3-5 days at 37°C with 5% CO2 (Figure 2C).\n3. Staining and visualization\nCells expressing fluorescent proteins can skip the steps below prior to confocal microscopy",
    "To image non-fluorescent cells invading Matrigel , place Transwells in fresh 24 well dishes and pipette 1 ml of 4 μM Calcein AM stain solution on top of each Matrigel plug, allowing it to spill over the sides and stain from the top and bottom. Calcein AM (acetoxymethyl ester of calcein) is a live cell dye that stains the entire cells green and requires no fixation.\nIncubate 1 hour at 37°C in 5% CO2 humidified atmosphere, at which point cells are fully stained and ready to be imaged by confocal microscopy.\nAlternatively, non-fluorescent cells invading Matrigel may be fixed and stained as described below in 3.5 to 3.9.\nTransfer each Transwell to a fresh 24-well plate. Overlay 1 ml of 4% para-formaldehyde/0.2% Triton-X 100.\nIncubate at room temperature for 0.5 hour.\nRemove fixative and wash 3 times with 1 ml PBS.\nRemove cytoplasmic RNA with 30 min RNase treatment using 100 μg/ml RNase. Wash 2 times with PBS.\nFor visualization add 0.01 mg/ml Propidium Iodide (PI) diluted in PBS and leave at room temperature in the dark for 0.5 hour. Wash 3 times with PBS. At this stage, PI stained transwell can be kept at room temperature in the dark for at least 1 month.\nPrecise imaging methods by confocal microscopy are dependent upon available resources. Using an inverted confocal microscope, place Transwell with a small amount of residual PBS onto large coverslip (ensure no bubbles are present) over non-immersion 20 X objective and capture optical sections every 10-15 μm from the bottom of the matrigel plug. Individual optical slices can be used to quantify the extent of invasion (Figure 3A) or to build into 3-dimensional objects using appropriate software such as Volocity (Figure 3B).\n4. Representative Results",
    "An example of a Z-series of optical slices is shown in Figure 3A. In this instance, cells were stained with Calcein AM and the number of cells invading up from the filter can be seen to decrease with distance. Quantification of invasion can be done by analyzing the ratio of Calcein AM positive pixels to negative pixels at each interval, or by using the fixation/staining method detailed above and counting PI positive nuclei at each position. One advantage of Calcein AM staining is that 3-dimensional reconstructions of cell invasion can be assembled using software such as Volocity, giving a visual depiction of the mode of invasion (Figure 3B). If cells are labeled by expression of fluorescent proteins, then the positions of each color cell can be visualized in 3-dimensional reconstructions, either viewed from the side (Figure 3C) or by making slices through the reconstruction (Figure 3D).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3525/3525fig1.jpg\nFigure 1. Schematic diagram of steps involved in setting up inverse invasion assay. A) Matrigel ECM thawed on ice. B) Matrigel is diluted 1:1 with PBS containing any drug treatments at twice final concentration. C) Transwell inserts are placed into multiwell plates, and Matrigel pipetted into each. D) Cell suspensions made at desired concentration. E) Once the Matrigel has set, the plate is inverted and removed, cells are plated onto the underside filter of the Transwell inserts. F) In the inverted position, the multiwall plate is carefully placed over Transwell inserts, making contact with the cell suspension. G) Cells are allowed to adhere to the filter for 4 hours.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3525/3525fig2.jpg",
    "Figure 2. Continuation of the schematic diagram for the inverse invasion assay. A) Once cells have adhered, dip each Transwell into serum-free media twice to remove loose cells. B) Place washed Transwell into a final well containing media plus treatments as required. C) Media containing chemoattractant (e.g. 10% fetal bovine serum) with treatments as required is carefully layered onto Matrigel.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3525/3525fig3.jpg\nFigure 3. Representative images of results of inverse invasion assay. A) Optical sections of cells stained with Calcein AM invading Matrigel, taken at 15 μm intervals by confocal microscopy. B) Reconstruction of a 3-dimensional reconstruction of cell invasion from a stack of confocal Z-series images, viewed from the side. Reprinted from reference 10. C) Three-dimensional reconstruction of GFP and RFP-labeled cells invading Matrigel viewed from the side. D) Optical slice through the 3-dimensional reconstruction of GFP and RFP-labeled cells. Reprinted from reference 10.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}