{
  "id": 8978,
  "origin_website": "Jove",
  "title": "Assessment of Neuronal Viability Using Fluorescein Diacetate-Propidium Iodide Double Staining in Cerebellar Granule Neuron Culture",
  "procedures": [
    "All procedures followed the National Institutes of Health (NIH) Guide for the Care and Use of Laboratory Animals (NIH Publications No. 80-23, revised 1996) and were approved by the Institutional Animal Care and Use Committee (IACUC) at Ningbo University (SYXK-2008-0110).\n1. Preparation of Solutions and Culture Media\nNote: Reagents and stocks need to be prepared under sterile conditions. Sterilize by filtering using a filter with a pore size of 0.22 µm.\nPrepare Poly-L-Lysine (PLL) stock solution by adding 5 mg of PLL  to 10 mL of double-distilled water (ddH2O). Sterilize by filtering. Aliquot and store the PLL stock solution at -20 °C for several months.\nPrepare Krebs buffer by adding 7.25 g of NaCl, 0.4 g of KCl, 0.14 g of NaH2PO4, 2.6 g of D-glucose, and 5.94 g of 4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid to 100 mL of ddH2O. Sterilize by filtering. Store the Krebs buffer solution at 4 °C for up to one month.\nPrepare 3.82% Mg2SO4 solution by adding 3.82 g of Mg2SO4 to 100 mL of ddH2O. Sterilize by filtering. Store the Mg2SO4 solution at 4 °C for several months.\nPrepare 1.2% CaCl2 solution by adding 1.2 g of CaCl2 to 100 mL of ddH2O. Sterilize by filtering. Store the CaCl2 solution at 4 °C for several months.\nPrepare 2M KCl solution by adding 15 g of KCl to 100 mL of ddH2O. Sterilize by filtering. Store the KCl solution at 4 °C for several months.\nPrepare the D-glucose stock solution by adding 1.8 g of D-glucose to 100 mL of ddH2O. Sterilize by filtering. Aliquot and store the D-glucose solution at 4 °C for up to one month.",
    "Prepare Cytosine β-D-Arabinofuranoside (Ara-C) stock solution by adding 0.24 g of Ara-C to 10 mL of ddH2O. Sterilize by filtering. Aliquot and store the Ara-C stock solution at 4 °C for several months.\nPrepare 250 mL of culture medium (for 25-30 pups) using 25 mL of Fetal Bovine Serum (FBS), 2.5 mL of 100x glutamine, 2.78 mL of 2M KCl solution, and 2.5 mL of 100x antibiotics in Basal Medium Eagle (BME). Adjust the volume to 250 mL and sterilize by filtering.\nPrepare 25K medium using 2.5 mL of 100x glutamine, 2.78 mL of 2M KCl solution, and 2.5 mL of 100x antibiotics in BME. Adjust the volume to 250 mL and sterilize by filtering.\nPrepare 5K medium using 2.5 mL of 100x glutamine and 2.5 mL of 100X antibiotics in BME. Adjust the volume to 250 mL and sterilize by filtering.\n\tNOTE: The culture medium, 25K medium, and 5K medium need to be freshly prepared\nPrepare FDA stock solution by adding 5 mg of FDA to 1 mL of acetone. Store the FDA stock solution at 4 °C for long-term storage.\nPrepare PI stock solution by adding 1 mg of PI to 1 mL of ddH2O. Store the PI stock solution at 4 °C for several months.\nPrepare Hoechst stock solution by adding 5 mg of Hoechst 33342 to 1 mL of ddH2O. Store the Hoechst stock solution at 4 °C for several months.\n2. Preparation of Dissection Solutions\nNOTE: Do this 1 d prior to the dissection.\nPrepare the dissection solution by adding 15 mL of Krebs buffer, 1.2 mL of 3.82% Mg2SO4 solution, and 0.45 g of Bovine Serum Albumin (BSA) to 150 mL of ddH2O. Adjust the pH to 7.4 using NaOH.\nLabel 5 x 50 mL tubes as follows: 1, 2, 3, 4, and 5.",
    "Place 40 mL of dissection solution into a 50 mL syringe with a filter. Filter 30 mL of dissection solution into tube 1, and 2 mL each to several 35 mm cell culture dishes, which will be used to process tissues.\nTo tube 2, add 12.5 mg of trypsin in 50 mL of dissection solution. Mix completely by vortexing. Sterilize by filtering.\nTo tube 3, add 1.2 mg of DNAse I, 7.8 mg of soybean trypsin inhibitor, and 150 µL of 3.82% Mg2SO4 solution in 15 mL of dissection solution. Mix completely by vortexing. Sterilize by filtering.\nTo tube 4, add 5 mL of the solution from tube 3. Add 10.5 mL of dissection solution. Sterilize by filtering.\nTo tube 5, add 100 µL of 3.82% Mg2SO4 solution and 15 µL of 1.2% CaCl2 solution in 12.5 mL of dissection solution. Mix completely by vortexing. Sterilize by filtering.\nStore all tubes at 4 °C before use.\n3. Coating the Cell Culture Plates\nNOTE: Do this 1 d prior to the dissection.\nAdd 1 mL of PLL stock solution to 100 mL of ddH2O (final concentration: 5 µg/mL). Coat plastic 6-well or 12-well cell culture plates (2 mL per well for 6-well cell culture plates or 1 mL per well for 12-well cell culture plates) by adding 5 µg/mL of poly-L-lysine solution.\nIncubate at room temperature for 1 day (or at 37 °C for 2 h). 1-2 h before the dissection, remove the solution using a pipette. Wash once with ddH2O and dry in the cell culture hood.\n4. Processing Tissues for 8 day old Sprague-Dawley Rats.\nPut a 100 mm dish on ice. Decapitate the rat pups into the dish using a pair of sterilized scissors.",
    "Insert the scissors into the foramen magnum and cut the two sides of skull, from the ears to the eyes. Lift the skull using a pair of forceps. Ensure that the whole brain is in the skull. Isolate the cerebellum and put it into the abovementioned 35 mm dish using a pair of forceps.\nWork under a dissecting microscope. Remove the meninges and blood vessels with two pairs of forceps.\nChop the tissues with a blade. Put the tissues into tube 1. Centrifuge for 5 min at RT and 1,500 x g.\nAspirate the supernatant. Save the pellet.\nAdd the solution in tube 2 to the pellet. Resuspend by shaking gently.\nPlace the tube in a 37 °C water bath for 15 min. Gently shake every 3 min.\nAdd the solution in tube 4 to this solution. Shake and centrifuge for 5 min at RT and 1,500 x g.\nAspirate the supernatant. Save the pellet.\nAdd the solution in tube 3 to resuspend the pellet.\nPrepare two 15 mL tubes. Place half of the cells in each tube. Pipette up and down 60-70x using a cotton-plugged Pasteur pipette to homogenize the cells.\nAdd 3 mL of the solution in tube 5 to each 15-mL tube. Let them sit at RT for 10 min and then carefully remove the supernatant with a cotton-plugged Pasteur pipette. Place the supernatant into new 15 mL tubes and centrifuge for 5 min at RT and 1,500 x g.\nAspirate the supernatant. Save the pellet.\nAdd culture medium into the pellet to get a cell density of around 1.5 x 106 cells/mL (about 100 mL for 10 pups).\nPut the cells into culture plates and culture them in the incubator at 37 °C and 5% CO2.\n5. Addition of Ara-C and D-glucose during Culturing",
    "After 24 h, add Ara-C stock solution (10 µL/well for 12-well cell culture plates or 20 µL/well for 6-well cell culture plates; final concentration: 1 mM) to inhibit the growth of the glial cells.\nOn day 7, add 50 µL of D-glucose stock solution per well for 12-well cell culture plates or 100 µL per well for 6-well cell culture plates so that final concentration is 1 mM.\n6. FDA-PI Double Staining and FDA-PI-Hoechst Triple Staining in CGN Culture\nPrepare FDA-PI working solution by adding 20 µL of FDA stock solution (final concentration: 10 µg/mL) and 50 µL of PI stock solution (final concentration: 50 µg/mL) in 10 mL of PBS. Mix by vortexing and place this on ice.\nFor the FDA-PI-Hoechst working solution, add 20 µL of FDA stock solution (final concentration: 10 µg/mL), 50 µL of PI stock solution (final concentration: 50 µg/mL), and 10 µL of Hoechst stock solution (final concentration: 5 µg/mL) in 10 mL of PBS. Mix by vortexing and place this on ice.\n\t\tNOTE: Freshly prepare FDA-PI working solution and FDA-PI-Hoechst working solution just before use.\nTake the cell culture plate out of the incubator. Put it on ice.\nAspirate the culture medium and replace it with cold PBS.\n\tNOTE: The change of solution must be done slowly and carefully. Avoid touching the cells with pipette tips.\nAspirate the cold PBS and replace it with cold FDA-PI or FDA-PI-Hoechst working solution (500 µL/well for 12-well cell culture plates or 1 mL/well for 6-well cell culture plates). Leave on ice for 5 min.\nAspirate the FDA-PI or FDA-PI-Hoechst working solution and add cold PBS (100 µL/well for 12-well cell culture plates or 50 µL/well for 6-well cell culture plates).\n\tNOTE: Cells should not be allowed to dry when taking images.",
    "Take images using fluorescent microscopy. Use an excitation filter with a pass band of 450 - 490 nm. Detect the fluorescence emissions for FDA, PI, and Hoechst at 520, 620, and 460 nm, respectively. Under the same conditions, take an image under normal light using the phase contrast mode of fluorescent microscopy.\n\tNOTE: Take images within 15 min after FDA-PI or FDA-PI-Hoechst staining. The exposure time is 100-300 ms and the analog gain is 2.8x.\n7. Assessment of Neuronal Viability\nFor FDA-PI double staining, overlay the images of the cells detected after filtering by different fluorescence filters by dragging the FDA-positive layer on the PI-positive layer in a graphics editor software.\nAdjust the opacity of the FDA-positive layer by entering \"50%\" in the \"Opacity\" field of the \"Layers\" panel. Merge two layers by clicking on the \"Merge Visible\" button in the \"Layer\" menu. Set the contrast of the overlay images by entering \"50\" in the \"Contrast\" field under \"Image\"| \"Adjustments\" | \"Brightness/Contrast.\" Make sure that there is no FDA and PI double-positive cell in the overlay images.\nFor FDA-PI-Hoechst triple staining, overlay the images of the cells detected after filtering different fluorescence filters by dragging the FDA-positive layer on the PI-positive layer in a graphics editor software. Adjust the opacity of the FDA-positive layer by entering \"50%\" in the \"Opacity\" field of the \"Layers\" panel.\nMerge two layers by clicking on the \"Merge Visible\" button in the \"Layer\" menu. Drag the Hoechst-positive layer on the merged layer. Adjust the opacity of the Hoechst-positive layer by entering \"50%\" in the \"Opacity\" field of the \"Layers\" panel. Merge the two layers by clicking on the \"Merge Visible\" button in the \"Layer\" menu.",
    "Visually distinguish large, irregular glial cells from CGNs by comparing the images taken under fluorescent mode with those taken under phase contrast mode—cells with diameters three times larger than CGNs are considered glial cells and should be excluded.\nCount the number of viable neurons and dead neurons, respectively, by using a cell counter plugin in an image processing program (e.g., ImageJ)4.\nFor FDA-PI double staining, manually mark small FDA-positive cells as viable neurons. Manually mark PI-positive cells as dead neurons. For FDA-PI-Hoechst triple staining, manually mark small FDA- and Hoechst-double-positive cells as viable neurons. Manually mark PI- and Hoechst-double-positive cells as dead neurons.\nCalculate the percentage of neuronal viability by using the following equation: % of neuronal viability = [number of viable neurons / (number of dead neurons + number of viable neurons)] x 100%. For each well, choose five random fields and average the percentage of neuronal viability.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}