{
  "id": 7937,
  "origin_website": "Bio",
  "title": "Cuticular Hydrocarbon Profiling by Fractionation and GC-MS in Socially Parasitic Ants",
  "procedures": [
    "Application of artificial isotopic substances for the tracing assay Note: As this protocol uses organic solvents (e.g., hexane), we do not recommend the use of plastic instruments to avoid contamination by impurities from these instruments. Dissolve n-Triacontane-d62 and n-Dotriacontane-d66 individually in hexane (16 mg/mL). Add 100 μL of both solutions to a SIL target Polyspring inserts in the autosampler vial for Agilent Technologies. To allow the ants to breathe in the later process, drill a hole in the lid of this vial.Stir the solution with a glass capillary tube; meanwhile, spray nitrogen gas to evenly apply the above artificial isotopic substances over the entire inner wall of the insert, using a dry block bath test tube (already installed on another stand, with silicon tube, pressure regulator for N2 gas, and N2 gas cylinder) (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4772/bioprotoc-13-13-4772-g001.jpgFigure 1. Evaporation system of the solvent. A. The appearance of evaporation. B. The process of spraying N2 gas.Expose a single individual live host worker (e.g., C. japonicus) in a sterilization Petri dish to 4 °C for 2 min and then to -20 °C for 3 min, for anesthetic purposes (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4772/bioprotoc-13-13-4772-g002.jpgFigure 2. Anesthetizing of an ant. A. Before anesthetizing. B. After anesthetizing.After the solvent is completely volatilized, carefully lift the sterilization Petri dish containing the anesthetized host worker, taking care not to touch it directly with the hands. Move it from the head side into the entrance of the SIL target Polyspring inserts, where the artificial isotopic substances are applied to the inner wall (Figure 3). Gently shake the insert for 1 h using a mini disk rotor. If the anesthetized host worker is alive, it wakes up in this step.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4772/bioprotoc-13-13-4772-g003.jpgFigure 3. Application of artificial isotopic substances to an ant. An ant is put into the vial with micro inserts coated with artificial isotopic substances.",
    "Induction of chemical disguise behavior under laboratory conditions To prevent possible attacks from the host worker (C. japonicus) before the newly mated P. lamellidens queen performs the rubbing behavior, anesthetize the host worker with artificial isotopic substances. Use the same method of anesthesia as in step A3; however, to minimize the risk of the artificial isotopic substances coming off from the host worker, the autosampler vial with SIL target Polyspring inserts containing the host worker with the lid removed should be placed in the Petri dish, allowing the host worker to move around in the dish on its own.Place the newly mated P. lamellidens queen and host workers in plastic cases containing plaster (Figure 4). After dissolving the plaster in water and placing it in a plastic case, make sure the plaster has hardened in the case before using it in the experiment. The plaster acts as both a scaffold for the ants and a moisturizing factor. If a newly mated P. lamellidens queen is able to perform the rubbing behavior continuously, one new host worker with artificial isotopic substances should be added (all from the same colony) every day until the third day. The anesthetized host worker usually wakes up within approximately 10 min of being introduced.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4772/bioprotoc-13-13-4772-g004.jpgFigure 4. The rubbing behavior of a newly mated P. lamellidens queen. The newly mated P. lamellidens queen exhibits rubbing behavior against a C. japonicus worker under laboratory conditions. Adapted from Iwai et al. (2022).Extraction and fractionation Note: Ants of approximately 1–2 cm in size are used as a model case in this protocol. If the ant size is less than 1 cm, the number of ants should be increased per sample (e.g., three ants per sample).",
    "The conditions for selecting the internal standard are: 1) selecting a substance that has similar properties to the CHC of the ants used in the experiment and 2) that is not present naturally in these species. It is necessary to prepare a suitable internal standard (hydrocarbon with a similar chain length to the CHC of the ants) corresponding to that species. Expose a single individual live ant (e.g., the newly mated P. lamellidens queen or its host worker) in a sterilization Petri dish to 4 °C for 2 min and then to -20 °C for 3 min for anesthetic purposes (similarly to step A3).Immediately place the anesthetized ant in a disposable rimless culture tube containing 200 μL of hexane mixed with docosane (10 ng/μL) as an internal standard material (Figure 5). The above solvent is accurately measured by the digital syringe eVol® XR. The whole body of an ant should be immersed in hexane.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4772/bioprotoc-13-13-4772-g005.jpgFigure 5. An ant is immersed in the solvent (docosane in hexane). Ensure that the entire ant body is immersed.The chemical materials from the body surfaces of the ant are extracted by dipping the ants in hexane for 5 min. The ant will die during this step.Add a Pasteur pipette to the stainless-steel stand (three legs) with a clamp and wrap a Kimwipe S-200 around the surface of the Pasteur pipette (Figure 6A). The Kimwipe prevents contamination of the rubber part of the clamp even if a small amount of hexane is accidentally spilled while applying it to the Pasteur pipette.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4772/bioprotoc-13-13-4772-g006.jpgFigure 6. Extraction and fraction of CHC. A. Joint with the clamp. B. Placement of quartz wool. C. Placement of Wakogel® C-200. D and E. Injection of sample or hexane.Add quartz wool to the inside of the Pasteur pipette (Figure 7A).",
    "The amount of quartz wool used should be sufficient to fill the bottom hole of the Pasteur pipette. At this point, cram the quartz wool into the bottom using another pipette (Figure 6B and Figure 7A).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4772/bioprotoc-13-13-4772-g007.jpgFigure 7. Preparing a column for fractionation. A. Steps for loading Quartz Wool. B. Steps for loading Wakogel® C-200.For column chromatography, add 0.5 g of Wakogel® C-200 to the Pasteur pipette with the quartz wool. Measure the weight of the silica gel using balance dishes and a digital scale (Figure 6C and Figure 7B).Using another Pasteur pipette, add approximately 1 mL of hexane into the above Pasteur pipette with a Pasteur pipette bulb to wash and deaerate the silica gel. Drip the added hexane through the fractionation column into an empty Erlenmeyer flask using a Pasteur pipette bulb (Figure 6D). As 1 mL of hexane will flow down under its own weight within approximately 10 s of being placed on the Pasteur pipette column, it is necessary to prepare an Erlenmeyer flask before performing this step.Carry out fractionation by adding the ant extract into the above Pasteur pipette. At this time, dispense the ant extract obtained in steps C1 and C2 using another Pasteur pipette with a Pasteur pipette bulb (Figure 6E).Add 1 mL of hexane to the column after applying the ant extract using another pre-marked 1 mL scale Pasteur pipette equipped with a Pasteur pipet bulb to elute the hydrocarbons. Drip the fractionated product through the fractionation column into an empty autosampler vial using a Pasteur pipette bulb. This process can only fractionate CHC from ant crude extract.",
    "As the fractionated product will flow down under its own weight within approximately 10 s of being placed on the Pasteur pipette column, it is necessary to prepare an empty autosampler vial before performing this step. Approximately 1 mL of the fractionated product is yielded in this step. A new column and an empty vial must be prepared for each sample.Concentration By setting the autosampler vial containing the fractional product in a dry block bath test (already installed on another stand with silicon tube, pressure regulator for N2 gas, and N2 gas cylinder), the obtained hydrocarbons are concentrated by applying N2 gas until the solvent hexane is completely evaporated.To elute the concentrated hydrocarbons, add 50 μL of hexane to the autosampler vial using the digital syringe eVol® XR. After adding 50 μL of hexane, elute hydrocarbons adhering to the inner wall by tilting and turning the autosampler vial.Set the SIL target Polyspring inserts in the Shimadzu LabTotal Vial for GC/GC-MS and transfer 50 μL of eluted hydrocarbons into the insert using the glass capillary tubes.Analysis using the GC-MS system To analyze the samples (concentrated hydrocarbons), set up the GC-MS system under the following conditions. The splitless mode is adopted for the sample injection port and the apparatus is maintained at 300 °C. Helium is used as the carrier gas at a constant flow rate setting of 0.9 mL/min. The oven temperature is set as follows: 40 °C for 3 min, 40–260 °C at 30 °C/min, 260–300 °C at 15 °C/min, and 18 min at the final temperature. See Equipment for the liner and column used.Inject 2 μL of the sample (concentrated hydrocarbons) into the sample injection port of the GC.Inject also C7–C40 saturated alkanes of known concentrations (0.5, 1, 2, 5, and 10 ng/μL) to use as standard substances."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}