{
  "id": 6615,
  "origin_website": "Bio",
  "title": "An Operant Conditioning Task to Assess the Choice between  Wheel Running and Palatable Food in Mice",
  "procedures": [
    "Note: All experiments are performed during the dark phase of the light/dark cycle to be in the active phase. We are thus working in a partly inverted 12 h/12 h cycle with lights off at 10 AM and on at 10 PM. AcclimationHabituate the animal to the inverted cycle one week before starting the protocol.Individualize the animals.Three days before starting the protocol, give 3-4 chocolate food pellets in the homecage to avoid neophobia.General description of operant conditioning sessionsSelect the specific file for each mouse (one per reinforcement schedule and per mouse e.g., FR1_mouse1).Select the corresponding exercise (cf. Procedure: Exercises design).Place the mouse inside the operant chamber.Start the recording.At the end of the session, remove the mouse from the operant chamber.If the session is for palatable food:Count the remaining pellets in 1) the food tray and 2) the litter below the grid.For both wheel running and palatable food:Clean the operant chamber using Phagospray® and, if within a palatable food session, clean the food tray with dry air spray.For habituation, FR1 and FR3 sessions:Go back to Step B1 for the second session of the day (second reward).Note: To avoid the effect of one reward over the other on the same day, half of the animal must start with a session of wheel running, the other half with a session of palatable food, the order being inverted each day.Habituation (2 days)Exercise design Wheel-runningThe sessions last 30 min each.The cue light paired with the wheel (on top of it) turns on at the beginning of the session and remains on for 30 min.Note: The wheel-paired cue light indicates the availability of the wheel. Thus, it remains on all over the habituation session.The wheel remains unlocked all session-long.Palatable foodThe sessions last 30 min each.",
    "The cue light paired with the food tray (on top of it) turns on at the beginning of the session and remains on for 30 min.Note: The food tray-paired cue light indicates the delivery of food pellets in the food tray. Thus, it remains on all over the habituation session.Seventeen pellets are distributed consecutively at the beginning of the session.Practical stepsCover all nose poke ports with the appropriate metal piece.Place the appropriate Perspex wall to cover either the food tray or the wheel and their corresponding nose poke ports.Perform two sessions (1/day) for both rewards applying the instructions of Procedure B.No criteria are needed to be met to move on to the next step.Fixed ratio 1 schedule of reinforcement (5 days)Exercise designWheel-running (Figure 2)The sessions last 30 min.The sessions start without any light cue, the wheel being blocked by the brake pad.One nose poke (NP) in the active port triggers a rewarded sequence with simultaneous:Five-second NP-paired cue light turns on.Note: This NP-paired cue light is a conditioned stimulus indicating that the effort required to get access to the wheel is completed. Twenty-second wheel-paired cue light turns on.Note: The wheel-paired cue light is a conditioned stimulus indicating the availability of the wheel.Twenty-second unlocking of the wheel (removing the brake pad).Nose-poking during the rewarded sequence is recorded but has no functional consequence.After the rewarded sequence, the program goes back to the first step until the next NP.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190928/20190928023948_7657.jpgFigure 2. Logigram of Fixed ratio 1 schedule of reinforcement for wheel running. During the 30-min session, one nose poke in the active port gives access to a rewarded sequence of 20 s before going back to the initial condition. NP: Nose Poke.Palatable food (Figure 3)The sessions last 30 min.The sessions start without any light cue, the food tray being available but empty.",
    "One NP in the active port triggers a rewarded sequence with simultaneous:Five-second NP-paired cue light turns on.Note: This NP-paired cue light is a conditioned stimulus indicating that the effort required to get one food pellet is completed.Fifteen-second food tray-paired cue light turns on.Note: The food tray-paired cue light is a conditioned stimulus indicating the delivery of one food pellet.One chocolate food pellet is distributed.Nose-poking during the rewarded sequence is recorded but has no functional consequence.After the rewarded sequence, the program goes back to the first step until the next NP.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190928/20190928024110_8942.jpgFigure 3. Logigram of Fixed ratio 1 schedule of reinforcement for palatable food. During the 30-min session, one nose poke in the active port gives access to a rewarded sequence of 15 s before going back to the initial condition. NP: Nose Poke.Practical stepsNote: In order to facilitate the learning, the animals are mildly food-restricted for the 2-3 first sessions so as to reach a stable 10% decrease in body weight.Remove all the metal pieces from nose poke ports so as to render them accessible.Place the appropriate Perspex wall to cover either the food tray or the wheel and their corresponding nose poke ports.Perform five sessions (1/day) for both rewards following the instructions of Procedure B.No criteria are needed to be met to move on to the next step.Fixed ratio 3 schedule of reinforcement (5 days)Exercise designWheel-running (Figure 4)The sessions last 30 min.The sessions start without any light cue, the wheel being blocked by the brake pad.Three consecutive NPs in the active port trigger a rewarded sequence with simultaneous:Five-second NP-paired cue light turns on.Twenty-second wheel-paired cue light turns on.Twenty-second unlocking of the wheel (removing the brake pad).Nose-poking during the rewarded sequence is recorded but has no functional consequence.",
    "After the rewarded sequence, the program goes back to the first step until the next NP.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190928/20190928024204_6991.jpgFigure 4. Logigram of Fixed ratio 3 schedule of reinforcement for wheel running. During the 30-min session, three consecutive nose pokes in the active port give access to a rewarded sequence of 20 s before going back to the initial condition. NP: Nose Poke.Palatable food (Figure 5)The sessions last 30 min.The sessions start without any light cue, the food tray being available but empty.Three consecutive NPs in the active port trigger a rewarded sequence with simultaneous:Five-second NP-paired cue light turns on.Fifteen-second food tray-paired cue light turns on.One chocolate food pellet is distributed.Nose-poking during the rewarded sequence is recorded but has no functional consequence.After the rewarded sequence, the program goes back to the first step until the next NP.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190928/20190928024229_7970.jpgFigure 5. Logigram of Fixed ratio 3 schedule of reinforcement for palatable food. During the 30-min session, three consecutive nose pokes in the active port give access to a rewarded sequence of 15 s before going back to the initial condition. NP: Nose Poke.Practical stepsRemove all the metal pieces from nose poke ports so as to render them accessible.Place the appropriate Perspex wall to cover either the food tray or the wheel and their corresponding nose poke ports.Perform five sessions (1/day) for both rewards following the instructions of Procedure B.All animals need to meet the following criteria:Stability of performance over 3 consecutive days (< 20% variation in the total number of active nose pokes).Discrimination index over 75% (see “Data analysis” part).Progressive ratio schedule of reinforcement (2 days)Note: A 30 min session for the assessment of wheel running and palatable food breakpoints was chosen in order to have a comparable duration for both rewards without reaching satiety in the palatable food session.",
    "This duration can be adapted by investigators depending on the information needed from the progressive ratio assessment.Exercise design Wheel-running (Figure 6)The session lasts 30 min.The session starts without any light cue, the wheel being blocked by the brake pad.Performing n x 3 NP (with “n” being the rank number of the reward accessed e.g., the first access to the wheel required 1 x 3 = 3 NP, the second one 2 x 3 = 6 NP etc. The sequence is thus as follows: 3, 6, 9, 12, 15, 18, 21, 24, 27…) in the active port trigger a rewarded sequence with simultaneous:Five-second NP-paired cue light turns on.Twenty-second wheel-paired cue light turns on.Twenty-second unlocking of the wheel (removing the brake pad).Nose-poking during the rewarded sequence is recorded but has no functional consequence.After the rewarded sequence, the program goes back to the first step until the next NP.The last ratio completed (nfinal x 3 NP) is called the breakpoint: it is the maximum number of nose pokes the animal accepts to perform to obtain the reward in a given session.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190928/20190928034001_2273.jpgFigure 6. Logigram of Progressive ratio schedule of reinforcement for wheel running. During the 30-min session, the effort required to unlock the wheel is progressively increased between each rewarded sequence. The last ratio completed by the animal is the breakpoint. NP: nose poke; n: rank number of reward accessed.Palatable food (Figure 7)The session lasts 30 min.The session starts without any light cue, the food tray being available but empty.Performing n x 3 NP (with “n” being the rank number of the reward accessed e.g., the first access to the wheel required 1 x 3 = 3 NP, the second one 2 x 3 = 6 NP etc.",
    "The sequence is thus as follows: 3, 6, 9, 12, 15, 18, 21, 24, 27…) in the active port trigger a rewarded sequence with simultaneous:Five-second NP-paired cue light turns on.Fifteen-second food tray-paired cue light turns on.One chocolate food pellet is distributed.Nose-poking during the rewarded sequence is recorded but has no functional consequence.After the rewarded sequence, the program goes back to the first step until the next NP.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190928/20190928034035_1747.jpgFigure 7. Logigram of progressive ratio schedule of reinforcement for palatable food. During the 30-min session, the effort required to obtain a pellet is progressively increased between each rewarded sequence. The last ratio completed by the animal is the breakpoint. NP: nose poke; n: rank number of reward accessed.Practical stepsNote: This test is intended to assess the maximum effort an animal is willing to expend to get access to the reward. Accordingly, one unique 30-min session per day is performed for each animal given the highly demanding nature of the task.Remove all the metal pieces from nose poke ports so as to render them accessible.Place the appropriate Perspex wall to cover either the food tray or the wheel and their corresponding nose poke ports.The first day, half of the animal will undergo one unique session of PR for wheel running, the other half one unique session of PR for palatable food. For this apply the instructions of Procedure B from Step B1 to Step B7.The second day, the animal undergoes one unique session of PR for the reward not given on the first day. For this apply the instructions of Procedure B from Step B1 to Step B7.No criteria are needed to be met to move on to the next step.",
    "Fixed Ratio 3 Schedule of reinforcement post-progressive ratio (1 day)Note: This step is intended to ensure that the performances of the animals go back to pre-PR levels.Exercise design Follow instructions of Procedure E1Practical stepsFollow instructions of Procedure E2 for 1 dayChoice (Figure 8) (Video 1)Exercise design The sessions last 60 min.The sessions start without any light cue, the wheel being blocked by the brake pad, and the food tray being available but empty.If the animal performs 3 consecutive NP in the active port for the wheel running, it gets access to a wheel-rewarded sequence:Simultaneous:Five-second NP-paired cue turns onTwenty-second wheel-paired cue turns onTwenty-second wheel unlockingNose-poking during the rewarded sequence is recorded but has no functional consequence.At the end of the rewarded sequence, a green ceiling light turns on for 5 additional seconds during which no reward is accessible. Nose poking is recorded but has no functional consequence.Then, the program goes back to the start of Step H1b until the next NP.If the animal performs 3 consecutive NP in the active port for the palatable food, it gets access to a palatable food-rewarded sequence:Simultaneous:Five-second NP-paired cue turns onFifteen-second food tray-paired cue turns onOne chocolate food pellet is distributedNose-poking during the rewarded sequence is recorded but has no functional consequence.At the end of the rewarded sequence, a green ceiling light turns on for 5 additional seconds during which no reward is accessible. Nose poking is recorded but has no functional consequence.Then, the program goes back to the start of step H1b until the next NP.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190928/20190928034147_8234.jpgFigure 8. Logigram of the choice between wheel running and palatable food. Nose poking gives access to one reward but the choice is mutually exclusive, meaning that choosing one reward excludes the possibility to obtain the other reward for a given time.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1.",
    "Choice session showing (i) a food-rewarded sequence followed by (ii) a wheel-rewarded sequence.  (All experiments obeyed the French (Décret 2013-118) and European (2010/63/EU) rules on animal experimentation with authorization numbers 33-063-69 (F.C.) and A33-063-098 (Animal facilities).)Practical stepsChoice in fed animals (5 days)Remove all the metal pieces from nose poke ports so as to render them accessible.Remove all the Perspex walls so as to render both rewards accessible.Perform five sessions applying the instructions of Procedure B from Step B1 to Step B7.Choice under mild food restrictionIn the hour preceding the dark phase before the first session, remove the food from the home cage.In the hour preceding the dark phase, weigh the animals.Remove all the metal pieces from nose poke ports so as to render them accessible.Remove all the Perspex walls so as to render both rewards accessible.Perform one session applying the instructions of Procedure B from Step B1 to Step B7.Calculate the amount of food to give: 1)Seventy percent of mean daily consumption.2)Subtract the amount eaten during the session.Give the food in the home cage at least 1 h after the end of the operant conditioning session Perform the other sessions on the following days applying Steps H2b ii to H2b vii.Note: The body weight must be comprised between 85 and 90% of the normal body weight. If it is above or below this range, reduce or increase the amount of food accordingly."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}