{
  "id": 4140,
  "origin_website": "Cell",
  "title": "Collection of cells for single-cell RNA sequencing using high-resolution fluorescence microscopy",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThis section lists the major steps and provides step-by-step details and timing for each major step. Please use continuous number for this section.\nTrypsinize, count, and load cells\nTiming: 15 min\nThis step describes how to prepare a suspension containing living single cells for the punch procedure. Depending on cell line and cell counting method used, this step may require more time. We count the hTERT RPE-1 cells with an automated cell counter such as the Bio-Rad TC20.\nFilter serum-free medium using a 0.2 μm filter.\nTrypsinize cells according to routine procedures.\nSpin down cells to collect cells in a pellet (3 min, 400 rcf for hTERT RPE-1 cells).\nRemove medium and reconstitute cell pellet in filtered serum-free medium.\nOptional: if serum was used to inactivate the trypsin, we recommend an extra washing step to remove traces of serum. This can be done by spinning down the cells a second time and reconstituting them again in fresh serum-free medium.\nCount the cells.\nDilute ∼7500 cells in 200 μL of filtered serum-free medium.\nIf not all the cells harbor a fluorescent marker which can be used for automated selection, add Hoechst33342 (1:20.000 dilution) or another DNA dye to the cell suspension. This DNA staining is highly suitable for automated cell selection after the imaging step.\nCritical: When counting the concentration of cells, include also dead cells in the calculation. Dead cells will also block the pores! The chip contains only 6400 pores and adding a large excess of cells will inevitably result in multiple cells settling into one well. A modest excess of 1000–1500 cells is recommended however, because there is always a percentage of cells that don’t get captured, for example because they stick to the walls of the collection reservoir.",
    "Critical: Reconstitute the cell pellet in serum-free medium. Serum contains high amounts of proteins. These will stick to the needle, causing highly inefficient punching (see troubleshooting 1[href=https://www.wicell.org#sec7.1]).\nCell capture\nTiming: 15 min\nThis step describes the capturing of single cells in the chip and mounting of the chip on the microscope.\nPipet the suspension containing the cells on the chip and apply a negative pressure of −20 mbar on chips with 5 μm pores, or −100 mbar on chips with 2 μm pores.\nAs soon as the chip runs almost dry (i.e., only a < 1 mm thick film of liquid on top of the chip), immediately stop the pump and clean the bottom of the chip by pipetting 4–5 times 1 mL of sterile, filtered PBS on the backside of the chip.\nAfter the last wash, remove the last droplets of PBS by holding some absorbing paper to the corner of the bottom of the chip (Figure 2[href=https://www.wicell.org#fig2]F). Avoid touching the chip.\nMount the chip on the Puncher and immediately pipet 150–200 μL of serum-free medium on the chip to keep the cells in a wet environment (Figure 2[href=https://www.wicell.org#fig2]G).\nCritical: Carefully clean the backside of the chip, which faces the objective of the microscope. It should be completely dry and free of salt crystals or large dust particles. Contamination will result in poor quality of the reflection images. These images must be of high quality as they are essential for alignment and focusing of the chip, and evaluation of punch success.\nImage and select cells\nTiming: 30 min\nThis step describes the imaging and selection of captured cells.\nAlign the chip according to the instructions in the puncher software.\nFocus the chip using one of the fluorescence filters or the reflection channel.",
    "Scan the relevant fluorescent channels, as well as the reflection channel. The reflection channel will be used to evaluate punching success. Fluorescent reporters typically require exposure times of 20–100 milliseconds. A full microwell chip scan using a 20× objective typically generates 225 images per channel and takes 15–20 min when scanning 4 different channels. When using a 40× objective, scanning time can be reduced by imaging only a part of the chip.\nSelect cells of interest via automated selection. Automated selection can be performed by setting intensity ranges in up to 3 channels simultaneously.\nOptional: Instead of selection based on microscopy images, a file with predefined cup numbers can be loaded to select cells of interest.\nOptional: Alternative to automated selection, cells can be manually selected. However, to minimize time between preparation of cell suspension and collection of cells in multi-well plates, automated selection is preferred. Images of punched cells are stored and can be linked to transcriptomic data in downstream analysis.\nScroll through the list of selected cells to visually inspect their quality (Figure 3[href=https://www.wicell.org#fig3]A). Doublets or dead cells can simply be removed from the list.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/904-Fig3.jpg\nFigure 3. Cell selection and inspection of punch success\n(A) Screenshot from the VYCAP punch software showing a list of automatically detected cells. The list can be manually inspected and unwanted cells can be manually deleted (click button indicated by dark red arrow).\n(B) Screenshot from the VYCAP software showing the well assignment window. In this case the first 384 cells of interest were each assigned automatically to individual well positions.\n(C) Reflection images before and after a successful punch. Scalebar indicates 20 μm.\nPunch cells into microwell plate\nTiming: 30 min",
    "This step describes how the cells are punched into 384-well plates compatible with an automated platform for CEL-Seq2 library preparation (Muraro et al, 2016[href=https://www.wicell.org#bib2]). Wells of the collection plates contain primers and nucleotides in a volume of 100 nL, and 5 μL of mineral oil to avoid evaporation. Any desired alternative library preparation chemistry can in principle be used.\nTake a ready-to-use 384-well plate containing CEL-Seq2 primers from the −20°C freezer, and briefly spin down the plate (1 min, 2000 rfc).\nRemove the foil and place the plate on the puncher.\nOptional: a cooling block can be used to keep the 384-well plate cold to slow down potential RNA degradation.\nAssign each selected cell to a specific well ID of the 384-well plate (A1 through P24) using the VYCAP software (Figure 3[href=https://www.wicell.org#fig3]B).\nPunch the cells.\nAfter the last punch, immediately take the plate from the puncher, and seal it with adhesive foil.\nSpin down the plate (1 min, 2000 rfc).\nImmediately transfer the plate to a −80°C freezer.\nStore at −80 degrees Celsius until library preparation.\nInspect the after images to confirm successful punching throughout the plate (Figure 3[href=https://www.wicell.org#fig3]C). The number of correct punches should be ∼90% or higher; if not, please refer to troubleshooting[href=https://www.wicell.org#troubleshooting].\nCritical: Taking after-images takes a substantial amount of time: 30 minutes for a full 384-well plate. Hence it is important to spin down and freeze the plate immediately after the last punch, and not wait until the after-images are all taken.\nOptional: Initially assign and punch a limited number of cells (5–10) and check the after-images to ensure successful punching. After this small test the entire plate can be punched. This allows the user to troubleshoot by quickly replacing or re-calibrate the needle if necessary."
  ],
  "subjectAreas": [
    "Genomics",
    "Cell Biology",
    "Single Cell",
    "Microscopy"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}