{
  "id": 9870,
  "origin_website": "Jove",
  "title": "Dual Somatic Recordings from Gonadotropin-Releasing Hormone (GnRH) Neurons Identified by Green Fluorescent Protein (GFP) in Hypothalamic Slices",
  "procedures": [
    "Hypothalamic brain slices are prepared, incubated and transferred to the recording chamber as previously detailed (9) in animals whose GnRH neurons express green fluorescent protein (GFP) under the control of the GnRH peptide promoter (10). After removal of the brain from the animal, the brain is blocked using a razor blade to eliminate regions that are not of interest. In order to determine the regions to remove, the brain is placed on its dorsal surface so that the hypothalamus can be visualized. For both the coronal and sagittal slice orientations, the cerebellum is removed. For coronal slice preparation, the rostral portion of the cortex is removed. In this slice orientation, the lateral regions of the cortex provide support for slicing the brain and provide sufficient area of brain for the placement of silver wires to secure the brain in the recording chamber. For the sagittal slice preparation, the lateral regions of the brain are removed and the rostral portions of the cortex provide the support for brain slicing and for placement of silver wires to secure the brain in the recording well. Throughout the blocking procedure, the brain is continuously moistened with cold artificial cerebrospinal fluid (ACSF) using a glass pipette. \nA small amount of Superglue is placed on the cutting platform. The brain is lifted with a spatula. Excess ACSF is removed by bring a Kimwipe to the surface of the spatula and drawing excess ACSF away from the brain. The brain is gently slid forward onto the glue. It is important to not to touch the brain or push down on it in order to secure it. The weight of the brain itself is usually sufficient to ensure it is secure.",
    "The brain and the cutting platform is then secured to the vibrating microtome and the cutting well is filled with cold ACSF. The cold solution both firms the brain and may protect from damage during the cutting procedure. Different brain regions vary in the degree of coldness that optimizes quality slices. The temperature of the ACSF for preparation of hypothalamic slices is generally 0°C.\nSlices should be cut slowly and each slice should float freely away from the brain. If slices begin to curl during cutting, the speed at which the blade is advancing should be slowed. One can use a small paint brush to uncurl slices but this does risk damaging the slices and thus, should be avoided. Slowly the speed of advance of the blade is preferred over using a paint brush.\nAs each slice is cut from the brain, it is withdrawn from the cutting chamber and placed in a slice incubation chamber in a warm water bath (approximately 32°C). The slice incubator is continuously supplied with oxygen using a mixture of 95% O2 and 5% CO2. Generally, pre-recording slice incubation ranges from 30 minutes to 2 hours.\nGlass pipettes (3-6 MΩ) are fabricated as previously described (9) using a vertical puller. The temperature and duration of pulling varies based on the type of pipette puller one uses, the type of glass one uses and the lifetime of the heating filament of the puller. The shape of the pipette tip can also vary depending on the user's preference. We have achieved good success with a uniformly tapered tip with an opening of 0.1 mm. Larger openings in the pipette tend to damage the neurons while smaller openings fail to result in long duration recordings.",
    "Pipettes coated with Sylgard to reduce capacitance. Pulled pipette tips are lightly coated with Sylgard 184 using a second pipette. Sylgarded tips are then heat-cured using a heat gun. These pipettes are then filled with the bath perfusate. To increase visualization of the pipette tips, a small amount of Alexa-568 is added to the portion of the bath solution to be used as the pipette solution before filling the pipettes. We do not weigh the Alexa-568 but rather use enough to turn the solution pink by eye. The pipette tips can then be visualized under the Texas red filter.\nWe have developed an approach to obtain current-clamp recordings for detection of action potentials using low resistance seals (see Discussion). Recordings are performed at the cell's endogenous resting potential with no applied current using Axon Instrument's 2B Axoclamp. However, due to the low resistance seal, one could not detect action potentials with just the 2B amplifier. To increase the signal, a second amplifier (AM Systems 3000) is used in series with the Axoclamp 2B. This approach has the ease of loose seals and utility of long-term recordings. Technically, one can directly measure action potentials, thereby circumventing the problems with the approach in the voltage-clamp recording mode (see Discussion).\nOne takes two pipettes to the surface of the two previously selected neurons at the same time, in a similar fashion as the approach for the whole cell recording configuration. Approaching both neurons at the same time has been more successful in obtaining the dual recordings than attempting each neuron of the pair independently. During this time, current injection pulses are passed from the 2B amplifier as is done during the approach for whole-cell recordings.",
    "Positive pressure must be maintained on both pipettes to prevent clogging the tip. Positive pressure for dual recordings is best generated by using an unfilled 3 ml empty syringe attached to the pipette holder by a length of piece of tubing. Using syringes allows one to maintain pressure on both pipettes. Positive pressure should be applied as soon as the pipette has been placed in the bath solution of the recording chamber. One approaches the selected neurons with the pipettes sequentially. After positioning the first pipette directly over the largest surface of the neuron, one maintains positive by leaving the syringe in place and leaves the pipette in this position. One then returns to the top of the recording chamber and lowers the second recording pipette into position. Selected neurons are often at different levels of the slice. The first pipette should be positioned over the neuron that is deepest in the slice and position the second pipette at the more superficial neuron. This prevents the positioning of the second pipette from shifting the positioning of the second pipette as the slice will move slightly in the vertical plane as pipettes enter the slice. \nLoose seals (18-30 MΩ) will be used. The positive pressure will induce a small dimple on the surface of each cell. One attempts to seal the first neuron by releasing positive pressure and applying very slight negative pressure. The positive pressure is released by removing the syringe. Suction by mouth is then applied to the free end of the tubing. A healthy neuron's membrane will quickly respond to the release of positive pressure and adhere to the pipette. Slight suction will form a seal with appropriate resistance in a healthy neuron.",
    "When one attempts to seal a neuron and fails, the pipette cannot be re-used since membranes only seal to very clean glass. Instead, one raises the pipette (and microscope objective) away from the surface of the slice to the top of the perfusion well, removes the pipette from the bath, changes to a clean pipette and then returns to the slice to attempt to seal another cell. For these reason, it is important to select multiple potential neurons for recordings. For slices with less than 4-6 recording quality neurons from which to choose, the success in obtaining dual recordings is limited. \nAfter establishing a loose seal based on resistance, the current injection pulses from the 2B amplifier are terminated. The 2B amplifer is placed in series with the 3000 series amplifer. In this configuration, the output of the 2B amplifer serves as the input for the 3000 series amplifer. The latter amplifer provides signal for data acquisition.\nThe seal (step 4) and reconfiguration of amplifers (step 5) is then repeated for the second neuron.\nimgsrc://cloudfront.jove.com/files/ftp_upload/1678/1678fig1tmb.jpgFigure 1. A period of increased firing in two GnRH neurons using the loose seal attached recording configuration in a sagittal slice preparation. The slice was derived from a castrated male. Each upward deflection indicates an action potential. Note that one GnRH neuron (top traces) exhibits nearly continuous firing while the second GnRH neuron exhibits intermittent bursts. This pattern of activity from single GnRH neurons is similar to that of single units extracted from multi-unit recordings during hormone secretion in vivo (7). Please click here[href=http://www.jove.com/files/ftp_upload/1678/1678fig1.jpg] to see a larger version of figure 1."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}