{
  "id": 9637,
  "origin_website": "Jove",
  "title": "Isolating LacZ-expressing Cells from Mouse Inner Ear Tissues using Flow Cytometry",
  "procedures": [
    "1. Microdissection of the cochlea\nPrepare dissection microscope under hood by wiping surfaces with 70% ethanol and setting out ice blocks.\nPrepare 10-15 35 mm Petri dishes under sterile condition and fill half-way (~2 ml) with sterile Hank's Balanced Salt Solution with Calcium (HBSS).\nPrepare two 35 mm Petri dishes under sterile condition and fill half-way (~2 ml) with sterile 1x phosphate buffered solution (PBS).\nSterilize micro-forceps in 50 ml conical Falcon tube with 70% ethanol.\nIn a separate room from the sterile hood, use iris scissors to decapitate 12-15 postnatal (P) 0-3-day-old Axin2LacZ/+ reporter mice and place heads onto a 60 mm Petri dish on ice block.\nUsing #5 Dumont forceps and iris scissors, excise the mandible and tongue and cut through the skull base at the level of the palate.\nRemove the overlying skin of the calvaria and transect the skull base by inserting the scissors at the inferior part of the foramen magnum to the middle of the palate.\nMake another incision with iris scissors from the cut edge of the palate to the superior aspect of the calvaria on both sides, being careful not to damage the otic capsule.\nComplete isolation of the temporal bone by making two 45-degree angled incisions starting from the superior aspect of the foramen magnum extending to the coronal cut at the hard palate.\nPlace isolated temporal bones in 35 mm Petri dishes containing HBSS on ice block.\nCollect temporal bones from about 12-15 animals that have been sacrificed, for a total of 24-30 temporal bones.\nTransfer Petri dish with isolated temporal bones to previously prepared sterile dissection hood (1.1).\nTransfer four temporal bones to each pre-prepared 35 mm Petri dish containing HBSS (1.2) and place on ice block.",
    "Begin microdissection using two #55 forceps to gently remove the cortex, brain stem, and cerebellum in the temporal bone overlying the otic capsule.\nWithout removing the otic capsule, chip away from parts of the cochlear capsule beginning at the entrance of the vestibulocochlear nerve into the otic capsule.\nFollowing exposure of the base of the cochlea, gently pull out the cochlea and surrounding tissues. Remove any remaining spiral ganglion and the stria vascularis beginning at the base.\nTransfer cochlea to 35 mm Petri dish containing PBS on ice block.\nFor optimal tissue viability, the total time of dissection should be less than 60 min.\nRepeat above steps for 3-5 wild-type (WT) P0-P3 mice as controls for Axin2-LacZ mice.\n2. Cell dissociation (modified from previously described methods)2,10\nPlace 50 μl sterile PBS in the center of a well in a 6-well non-coated culture dish.\nTransfer up to 20 Axin2LacZ/+ cochleae into each 50 μl droplet of PBS. A new 50 μl droplet of PBS should be used for more than 20 cochleae.\nPre-warm 50 μl aliquots of 0.125% trypsin for ~2 minutes in a 37°C water bath.\nAdd 50 μl of pre-warmed 0.125% trypsin to PBS containing the cochleae.\nPlace 6-well dish at 37°C for 8 min, taking care not to shake the dish.\nTo terminate trypsinization, add 50 μl of soybean trypsin inhibitor to each 100 μl droplet.\nAdd an additional 50 μl of Full Media (FM) (IGF-1, EGF, bFGF, HS, ampicillin in DMEM/F12)2\nUsing a 300 μl blunt pipette tip with a p200 pipetteman set at 125 μl, gently triturate cells 80 times, being careful not to create bubbles.\nFollowing trituration of each droplet, add an additional 200 μl of FM to each well.\nPass cells through a 40 μm blue Falcon cell strainer into a new well.",
    "Transfer cells to standard Falcon FACS tubes (approximately 300 μl remains following trituration and filtration).\n\t\nSplit cells from wildtype cochleae into three tubes, diluting 100 μl with 300 μl FM in each tube. One tube will be used as a blank control, one will be stained with propidium iodide (PI, 1 μg/ml) only (not to be added at this step), while the last one will be stained with 3-carboxyumbelliferyl β-D-galactopyranoside (CUG, see 2.15) to detect background fluorescence.\nPlace 400 μl of dissociated cells from Axin2-LacZ cochleae in each FACS tube. As a CUG only control, dilute 10 μl of cells in 390 μl FM (see tube F in Step 2.15). Bring volume of any remaining tubes to 400 μl.\nIncubate cells in a 37°C humidified incubator for 10 min.\nPrepare CUG solution:\n\t\nPrepare 200 μl of CUG for each FACS tube requiring staining.\nDilute CUG in FM 1:50 in a dark hood with minimum light exposure.\nPre-warm diluted CUG at 37°C for 3-5 minutes.\nNext, add 200 μl of diluted CUG to each appropriate FACS tube. For tubes not designated to have CUG, add FM only (see 2.15).\nAt this juncture, there should be five categories of tubes with the following contents (do not add PI at this step):\n\t\nWildtype - without CUG or PI (for compensation, see step 3.5-6)\nWildtype - with PI only (for compensation)\nWildtype - with CUG and PI (for control against Axin2-LacZ cells)\nAxin2-LacZ - with CUG only (for compensation)\nAxin2-LacZ - with CUG and PI (for actual cell sorting)\nAxin2-LacZ - with CUG and PI (for event analysis)\nProtect all tubes from light and incubate them in a 37°C humidified incubator for 25 minutes.\nPrepare fresh HEPES + Fetal Bovine Serum (FBS) solution for halting reaction following incubation:",
    "Dilute 400 μl of freshly thawed FBS in 10 ml of sterile 10 mM HEPES (in PBS) in a 15 ml Falcon tube.\nPlace tube on ice until completion of 2.16.\nAdd 1.8 ml of ice-cold HEPES solution to each FACS tube under a sterile hood with lights off to minimize light exposure.\nCentrifuge cells at 1200rpm for 5 minutes.\nRemove supernatant and re-suspend cells in 300 μl FM, pool all aliquots for the sorting sample (Axin2-LacZ stained with CUG and PI).\nAdd PI to each tube to achieve a final concentration of 1 μg/ml.\nPlace cells on ice and protect from light.\n3. Flow Cytometry\nWe use a BD Aria II equipped with 488-nm, 633-nm, and 407-nm lasers. Detection of CUG was done using the 407-nm violet laser and PI using the 488-nm blue laser at the Stanford Shared FACS Facility.\nA trained flow cytometer operator is required. Proceed to the next step after warming up the lasers, calibrating the cytometer detectors using manufacturer instructions, and setting optimal sorting parameters. In our experience, we found the use of a 100 μm nozzle optimizes cell viability for subsequent experiments.\nThe following parameters were used: threshold at 5,000 events, flow rate less than 3,000 events/second, forward scatter (FSC) at 125 volts and side scatter (SSC) at 250 volts, PE-Cy5 channel was used for PI and Cascade Blue for CUG.\nFlush cytometer chamber with 70% ethanol and PBS twice each in that order.\nBegin analysis with unstained, wildtype cells (tube A in Step 2.15). Collect 1,000 events to determine cell distribution on the FSC versus SSC plot. If scatter is not desired, then adjust FSC and SSC parameters.",
    "Perform compensation using unstained WT (tube A), PI-stained WT (tube B), and CUG-stained Axin2-LacZ (tube D) cells. Compensation will allow for more accurate signal discrimination among the different laser wavelengths.\nStart analysis with wildtype PI- and CUG-stained cells (tube C) and set gating parameters for:\n\t\nExclusion of debris based on FSC versus SSC plot.\nExclusion of doublets and clumps using FSC-height versus FSC-area plot.\nExclusion of dead cells based on FSC-area versus PE-Cy5-area plot.\nSet up plot of FSC-area versus Cascade Blue-area with any gate placement.\nNext, analyze 10,000 events from sort sample tube that contains Axin2-LacZ PI and CUG stained cells (tube F).\n\t\nAll gates set using wildtype cells should be applied here.\nUsing plots for the wildtype cells, create gates for Cascade Blue-high cells that is less than 1% of the total number of events.\nThis same gates of Cascade Blue-high now encompass approximately 15-20% of cells in the Axin2-LacZ sample, making these Axin2-high cells.\nUsing the Axin2-LacZ cells' analysis plot, create a gate for the least fluorogenic 15-20% of cells, henceforth Axin2-low cells.\nBased on the aforementioned gating strategy, sort cells into FACS tubes containing 500 μl FM, one tube for Axin2-high and the other for Axin2-low cells. Make sure collection tubes are in a chamber cooled to 4°C during the sort.\nRecord number of cells counted by flow cytometer for each population.\n4. Representative Results (see Figure 2):",
    "With the above protocol, we typically recover 40-45% debris-free cells from both the wildtype and Axin2LacZ/+ cochleae (Figures 2A and B), with about 70% of them free of doublets (see Figures 2A' and B'). Most sorted cells are viable and did not take up PI (~95%) (Figures 2A'' and B''). On average, the top ~20% CUG-positive cells are considered Axin2-LacZ-positive cells (Figure 2B''') and correlate to about 15,000 Axin2-LacZ-high cells per 10-12 animals.\nFlow cytometry re-sort analysis of Axin2-high cells revealed greater than 93% purity in the Cascade Blue channel. In order to further confirm the identity of these cells, we performed post-sort immunostaining of both Axin2-high and Axin2-low cells using anti-β-galactosidase antibodies, and found that the Axin2-high cells contained ~93.4% β- galactosidase-positive cells (greater than 1,500 cells analyzed) and that Axin2-low cells contained ~4.8% β-galactosidase-positive cells.\nFigures and Tables:\nimgsrc://cloudfront.jove.com/files/ftp_upload/3432/3432fig1.jpg\nFigure 1.Experimental paradigm. The above figure depicts the overall experimental strategy and techniques as described through the protocol section. Cochleae from wildtype and Axin2LacZ/+ mice are harvested and dissociated into single cells, which were then treated with CUG, a fluorescent substrate for β-galactosidase. Axin2-LacZ-high and -low cells were then separated out via flow cytometry. Click here to view a full-sized version of this image.[href=http://www.jove.com/files/ftp_upload/3432/3432fig1large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/3432/3432fig2.jpg",
    "Figure 2.Gating Strategies. This figure illustrates the flow cytometry gating strategies used. A) Dissociated wildtype cells that underwent the same treatment as Axin2-LacZ cells are analyzed here using a total of 10,000 events. The first panel demonstrates the side scatter area (SSC-A) versus forward scatter area (FSC-A). Here, a distinct group of events are of a much larger size than those events closer to the y-axis. These events are designated as the \"Debris Negative.\" The next gate, A', analyzes the \"Debris Negative\" cells from panel A, which is 43.8% of the total number of events (see table below). In this panel, the forward scatter height (FSC-H) versus the FSC-A is used to exclude doublets. Events deviating from the expected linear nature of the plot are excluded. This preparation typically yields ~70% events within the designated gate, and the remaining cells are excluded. In panel A'', propidium iodide (PI) as detected by the PE-Cy5 channel, is used to label dead cells (5.3%). In the next panel (A'''), the Cascade blue channel is used to detect the fluorescent substrate CUG. Here, the LacZ-high gates include less than 1% of total events. B) Dissociated cells from Axin2-LacZ mice treated with CUG and PI are analyzed here using a total of 10,000 events. Identical gates from panel A are applied here. B' shows that 29.5% of cells are excluded as doublets while B'' demonstrates that 5.4% are not viable. The initial gates for LacZ-high and -low cells are drawn using panel B''' with LacZ-high initially set at 19.7% and LacZ-low at 20.4%. Click here to view a full-sized version of this image.[href=http://www.jove.com/files/ftp_upload/3432/3432fig2large.jpg]\ntable:\n﻿0,1,2,3\n,,Event number,Percentage\nA,Wildtype Analysis,10000,\nA',Debris Negative,4381,43.80%\nA'',Doublet Negative,3116,71.10%\nA''',PI Negative,2951,94.70%\n,LacZ-high,16,0.54%\n,LacZ-low,2790,94.50%\nB,Axin2-LacZ Analysis,10000,\nB',Debris Negative,4218,42.2%\nB'',Doublet Negative,2973,70.50%\nB''',PI Negative,2813,94.6%\n,LacZ-high,553,19.70%\n,LacZ-low,573,20.40%",
    "Table 1. Quantitative analyses of gating strategies in Figure 2.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}