{
  "id": 13096,
  "origin_website": "Jove",
  "title": "2D and 3D Human Induced Pluripotent Stem Cell-Based Models to Dissect Primary Cilium Involvement during Neocortical Development",
  "procedures": [
    "1. Generation of 2D hIPS cell-based models of neocortical development\nNeural rosette formation\nStart with hIPSC cultures harboring large regular colonies, exhibiting less than 10% differentiation and no more than 80% confluency.\nRinse the hIPSCs with 2 mL of PBS.\nAdd 2 mL of NSPC induction medium supplemented with the Rock inhibitor (NIM + 10 µM of Y-27632).\nManually dissect each hIPSC colony from one 35 mm dish using a needle to cut each colony precisely in horizontal and vertical directions to create a checker-board pattern dividing each colony into equal clusters.\nDetach the colony using a cell scraper and transfer them onto an ultra-low-attachment 35 mm dish.\nLet them float overnight (ON) in a humidified incubator at 37 °C and 5% CO2, so that they can form embryoid bodies (EBs).\n\t\tNOTE: Embryoid bodies (EBs) are defined as floating spheroid clusters or aggregates of hIPSCs.\nTransfer the EBs into poly-L-ornithine/laminin (PO/lam)-coated 35 mm dishes in 2 mL NIM + 10 µM of Y-27632.\nDaily refresh NSPC induction medium (NIM without Y-27632) until the formation of neural rosettes that takes approximately 12 to 14 days. Check under the microscope.\n\t\t​NOTE: After this step neural rosettes can be expanded, differentiated, and processed for immunostaining analysis or dissociated to get isolated neural stem and progenitor cells (NSPCs).\nNeural rosette expansion and early differentiation\nCut neural rosettes in a grid-like pattern with a needle and dislodge the clusters using a cell scraper.\nTransfer the rosettes into a 4-well plate containing PO/lam-coated glass coverslip (4-5 rosettes/well) in 0.5 mL of NSPC maintenance medium (NMM).\nIncubate the plate in a humidified incubator at 37 °C and 5% CO2.\nRefresh NMM every other day until day 20.",
    "From Day 20, culture neural rosettes in 0.5 mL of cytokine depleted NMM to allow differentiation. Refresh the medium every 2-3 days.\nAt Day 30 and Day 40 (10 or 20 days of differentiation), fix the rosettes with 0.5 mL of 4% PFA, 20 min, RT.\nPC biogenesis and function analysis on isolated NSPCs\nNSPC dissociation\nCut neural rosettes from step 1.1.8 in a grid-like pattern with a needle and dislodge the clusters using a cell scraper. Transfer the cells into PO/lam-coated 35 mm dishes in 2 mL of NMM and incubate in a humidified incubator at 37 °C and 5% CO2.\nRefresh NMM every other day until confluency (approximately 5-7 days).\nAfter scraping away the large, clear cells surrounding neural rosettes, pick them manually and transfer them onto fresh PO/lam-coated 35 mm dishes to enrich for NSPCs and deplete non-neural cell types.\nAfter one or two manual passages (repeat step 1.3.1.3 if needed) required to remove all contaminating cell types, remove the medium and rinse with PBS.\nAdd 300 µL of 0.05% trypsin and incubate for 5 min at 37 °C until most cells detach.\nAdd 2 mL of the medium containing 10% FBS (DMEM + 10% FBS) to inactivate the trypsin. Collect the cell suspension in a 15 mL conical tube. Gently pipette the cell suspension up and down three times to break up the cell clumps.\nCentrifuge at 300 x g for 5 min.\nCarefully aspirate the supernatant and resuspend the cells in NMN.\nSeed the dissociated NSPCs as single cells (1 x 105 cells/cm2) in NMM onto PO/lam-coated dishes and incubate them in a humidified incubator at 37 °C and 5% CO2.\nExpand NSPCs in NMM by changing the medium every other day.\n\t\t\tNOTE: NSPCs are seeded at high density to avoid differentiation.\nPC biogenesis analysis",
    "Seed dissociated NSPCs at 100,000 cells/cm2 and incubate them in a humidified incubator at 37 °C and 5% CO2 in NMM for 2 days.\nAspirate the medium and starve NSPCs in cytokine depleted medium (NSPC starvation medium, Supplemental Table 1) for 48 h.\nFix NSPCs with 4% PFA for 20 min at RT.\nWash twice with PBS for 5 min at RT before immunostaining.\nPC function analysis: SHH signaling pathway\nSeed dissociated NSPCs at 100,000 cells/cm2 on PO/lam-coated 8-well Chamber Slides (300 µL) or T25 dishes (5 mL) and incubate in a humidified incubator at 37 °C and 5% CO2 in NMM for 2 days.\nStarve NSPCs in NSPC starvation medium (300 µL per well of 8-well chamber slide and 5 mL in T25 flask) for 48 h.\nTo induce the SHH pathway, incubate the NSPCs with the starvation medium supplemented with recombinant SHH (100 ng/mL) or SAG (500 nM); (150 µL per well of an 8-well chamber slide and 2 mL in T25 flask) for 24 h.\nFix NSPCs cultured on 8-well Chamber Slides in 250 µL of 4% PFA per well for 20 min at RT and wash them twice with 250 µL of PBS for 5 min at RT before immunostaining analysis.\nRemove the medium and wash NSPCs cultured in T25 dishes with PBS.\nAdd 500 µL of 0.05% trypsin and incubate for 5 min at 37 °C until the cells detach.\nAdd 2 mL of medium containing 10% FBS (DMEM + 10% FBS) to inactivate the trypsin and collect the cell suspension in a 15 mL conical tube.\nCentrifuge at 300 x g for 5 min and carefully aspirate the supernatant to obtain NSPC pellets that can be cryopreserved at -80 °C before RNA extraction and RT-PCR analysis.\n2. Generation of dorsal forebrain organoids",
    "Single-cell culture of hIPSCs\nStart with hIPSC cultures harboring large regular colonies exhibiting less than 10% differentiation and that have been passaged almost once. Ensure that the cells are no more than 80% confluent.\nWash the colonies with 2 mL of PBS.\nAdd 500 µL of Gentle Cell Dissociation Reagent (GCDR) and incubate for 5 to 7 min at 37 °C.\nAspirate the GCDR and add 2 mL of mTeRS1 medium supplemented with 5 µM of Y-27632.\nPipette the cells gently up and down 10 times to dissociate all colonies into single cells.\nTransfer the cells on vitronectin-coated dishes and incubate in a humidified incubator at 37 °C and 5% CO2.\n\t\t​NOTE: Perform at least 1 passage of the hIPSCs using GCDR prior to the differentiation experiment to adapt the hIPSCs to single-cell culture conditions.\nOn Day 0, allow hIPSCs to form embryonic bodies in EB medium containing a low concentration of FGF2 and a high concentration of rock inhibitor required for hIPSC survival. To do so follow the steps below.\n\t\nWash the colonies with 2 mL of PBS.\nAdd 500 µL of Gentle Cell Dissociation Reagent (GCDR) and incubate for 5 to 7 min at 37 °C.\nAspirate the GCDR and add 1 mL of EB medium supplemented with 50 µM of Y-27632; Use a 1 mL pipette to gently detach the cells and transfer them to a 15 mL conical tube.\nRinse once more with 2 mL of EB medium supplemented with 50 µM of Y-27632, transfer the remaining cells to the 15 mL conical tube. Immediately add 3 mL of EB medium supplemented with 50 µM of Y-27632 to the conical tube and gently homogenize the solution using a 5 mL pipette.\nCentrifuge the dissociated cells at 100 x g for 5 min.",
    "Gently aspirate the supernatant and resuspend the cells in 6 mL of EB medium supplemented with 50 µM of Y-27632.\nCentrifuge the cells at 100 x g for 5 min.\nAspirate the supernatant and resuspend the cells in 1 mL of EB medium supplemented with 50 µM of Y-27632. Use a 1 mL pipette to gently dissociate the cells into a single-cell suspension.\nImmediately after resuspending the cells, dilute and count them.\nDilute the proper volume of cell suspension (containing 900,000 cells) into 30 mL of EB medium supplemented with 50 µM of Y-27632 and 4 ng/mL of bFGF and gently mix the solution.\nPlate 9,000 cells/well into an ultra-low attachment 96U plate (300 µL/well). To avoid disturbing EB formation, incubate the plate in a humidified incubator at 37 °C and 5% CO2 until Day 3 without medium change.\nNeural induction (Dual SMAD inhibition)\nOn Day 3, ensure EBs measure 300-400 µm and show regular borders. If both criteria are reached, replace half of the medium (150 µL) with induction medium-1 containing Dual SMAD inhibitors, leading to brightening of the contour of the EBs by Day 6 to Day 7 indicating neuroectodermal differentiation (Supplemental Table 2).\nOn Day 4, replace 3/4 of the medium (225 µL) with induction medium-1.\nOn Day 6 and Day 8: Refresh half of the induction medium-1 (150 µL).\nOrganoid embedding into basement membrane matrix (Day 10)\nOn Day 10, embed EBs in growth factor reduced basement membrane matrix (BMM).\n\t\tNOTE: From this step, always use sterile scissors to cut the opening of the pipette tips to avoid damaging the organoids by repeated pipetting.",
    "First transfer around 15-17 organoids in conical tubes. Let the EBs settle and remove the medium. Add 50 µL of induction medium-2 and transfer them into a microcentrifuge tube containing 100 µL of BMM.\nSpread the matrix-EB mixture onto the center of a well of an ultra-low-attachment plate and separate the EBs to prevent them from fusing.\nLet the BMM solidify in the incubator at 37 °C for 45 min.\nAdd 3 mL of the induction medium-2 in each well and put the plate in a humidified incubator at 37 °C and 5% CO2.\n\t\tNOTE: Ensure that this procedure is done as quickly as possible as BMM solidifies at room temperature.\nStationary culture of organoids embedded into basement membrane matrix\nDay 12, 14: Refresh induction medium-2.\nDay 16: Refresh induction medium-2 and check under a microscope the expansion of neuroepithelial loops.\nBasement membrane matrix dissociation and culture on an orbital shaker\nOn Day 17, dissociate organoids from BMM by pipetting up and down 10 times with a 5 mL pipette and transfer them into differentiation medium-1 (without vitamin A). Incubate onto an orbital shaker at 80 rpm in a humidified incubator at 37 °C and 5% CO2 to improve nutritional absorption.\n\t\tNOTE: Use a different incubator for stationary culture and culture onto an orbital shaker to avoid any vibrations detrimental to adherent hIPS cell growth.\nDay 19: Refresh differentiation medium-1.\nDay 21: Change differentiation medium-1 to differentiation medium-2 (with vitamin A).\nFrom Day 23 to Day 35: Refresh medium with differentiation medium-2 every 2-3 days.\nFrom Day 35 to Day 70: Refresh differentiation medium-2 with 1% BMM and refresh every 2-3 days.",
    "Collect the organoids after 28, 42, and 70 +/- 2 days of differentiation and fix them overnight at 4 °C, in 5 mL 4% PFA on a 15 mL conical tube.\nFor further in toto or free-floating immunostaining analysis, organoids are then rinsed twice in PBS and conserved at 4 °C in PBS + 0.05% sodium azide.\nFor immunostaining analysis on frozen sections, immerse 4% PFA fixed organoids in 10 mL 30% sucrose at +4 °C ON (or until organoids sink). Embed them into a frozen embedding matrix and store at -80°C until cryosectioning.\n3. In toto immunolabeling, clearing, and lightsheet acquisition of dorsal forebrain organoids\nFixation\nCollect the organoids in 6-well plates, remove the medium, and fix them with 2 mL of 4% PFA, at 4 °C, overnight.\nPerform three washes in 2 mL of PBS at room temperature.\nTransfer the organoids into 2 mL tubes and store at 4 °C in 2 mL of PBS + 0.05% sodium azide.\nPermeabilization\nIncubate organoids in 1 mL of PBS containing 0.2% Triton X100 at RT for 1 h. Do this twice.\nIncubate in 1 mL of PBS containing 0.2% Triton X100 and 20% DMSO, at 37 °C, overnight.\nIncubate in 1 mL of PBS containing 0.1% Tween20, 0.1% Triton X100, 0.1% Deoxycholate, 0.1% NP40 and 20% DMSO, at 37 °C, overnight.\nIncubate in 1 mL of PBS containing 0.2% Triton-X100, at RT, for 1 h. Do this twice.\nBlocking and immunolabeling\nBlock in 1 mL of blocking solution (PBS, 0.2% Triton X100, 6% Donkey Serum,10% DMSO), at 37 °C, ON.\nIncubate with primary antibodies diluted in 250 µL of PBS, 0.2% Tween20, 0.1 µg/mL of Heparin, 5% DMSO and 3% Donkey Serum, at 37 °C, for 2 days.",
    "Wash in 1 mL of PBS containing 0.2% Tween20 and 0.1 µg/mL of Heparin, for 1 h, at 37 °C. Do this four times.\nWash in 1 mL of PBS containing 0.2% Tween20 and 0.1 µg/mL of Heparin, overnight, at 37 °C.\nIncubate with secondary antibodies diluted in 250 µL of PBS containing 0.2% Tween 20, 0.1 µg/mL of Heparin and 3% Donkey Serum, at 37 °C, for 2 days.\nWash in 1 mL of PBS containing 0.2% Tween 20 and 0.1 µg/mL of Heparin, for 1 h, on a wheel, at RT. Do this four times.\nWash in 1 mL of PBS containing 0.2% Tween 20 and 0.1 µg/mL of Heparin, overnight, on a wheel, at RT.\nWash in 1 mL of PBS, for 24 h, at RT.\nStock at +4 °C in 1 mL of PBS and 0.05% sodium azide until clearing.\nClearing in TDE (2,2′ -Thiodiethanol)\nIncubate the organoids in 1 mL of 30% TDE (3 mL of TDE + 7 mL of PBS), for 24 h, at RT.\nIncubate in 1 mL of 60% TDE (6 mL of TDE + 4 mL of PBS), for 24 h, at RT.\nIncubate in 1 mL of 80% TDE (8 mL of TDE + 2 mL of PBS), for 24 h, at RT.\nOrganoid embedding prior to light sheet acquisition\n\tNOTE: Use a custom-made system; made with a 1 mL syringe with the tip cut with a scalpel.\n\t\nPrepare 100 mL of 4% Low-Melting Agarose in 60% TDE solution and aliquot in 2 mL tubes. Conserve at +4 °C.\nPrior to the organoid embedding, preheat one tube containing 1.5 mL of 4% low-melting agarose in 60% TDE in a water bath at 37 °C until it liquefies.",
    "Meanwhile, prepare a custom-made molding system made from a 1 mL syringe the tip of which is cut off using a scalpel.\nPump in the syringe 600 µL of the gel solution using the plunger.\nPosition the sample using an enlarged pipette tip the opening of which has been cut using sterile scissors.\nFill in the syringe with 400 µL of gel solution so that the sample is positioned within the lower third of the syringe.\nLet the gel polymerize and store in 80% TDE solution at 4 °C protected from light until acquisition.\nFor Light sheet acquisition, use a 20x objective immersed in 80% TDE solution added in the sample chamber to allow to accurately adjust to the refractive index of the clearing method.\nInsert the syringe containing the agarose embedded organoid in the largest sample holder designed to accommodate a 1 mL syringe the plunger of which can be operated to position the organoid in front of the objective.\n\t\t​NOTE: Light sheet acquisition of an entire organoid takes approximately 5 to 10 min.\n4. Immunostaining and clearing of free-floating sections of dorsal forebrain organoids\nFixation, agarose embedding, and sectioning of the organoids\nCollect organoids after 28, 42, and 70 +/- 2 days of differentiation in a 6-well plate and fix overnight at 4 °C in 2 mL of 4% PFA.\nRinse twice in 2 mL of PBS and conserve at 4 °C in 2 mL of PBS + 0.05% sodium azide.\nEmbed the fixed organoids into 4% low-melting agarose in a plastic embedding mold (7 x 7 mm). Carefully remove the agarose block from the plastic mold and glue it to the vibratome stage.",
    "Section the embedded organoids using a vibratome to obtain 150 µm free-floating sections transferred in a well of a 24-well plate containing 500 µL of PBS using a paintbrush to avoid damaging the sections.\n\t\tNOTE: Low-melting agarose is recommended as its melting temperature is only approximately 60 °C. Prepare 4% low-melting agarose in PBS solution and leave it to cool just above 37 °C in a water bath prior to organoid embedding.\nPermeabilization, blocking, and immunostaining\nIncubate the sections in 500 µL of PBS containing 0.3% Triton X100, at RT, under agitation, for 20 min. Do this three times.\nIncubate the sections in 500 µL of PBS containing 0.3% Triton X100 and 5% nonfat Milk, at RT, under agitation, for 2 h.\nIncubate the sections in 250 µL of primary antibody solution (PBS + 0.3% Triton X100 + 1% nonfat Milk), under agitation, at +4 °C, overnight.\nWash the sections in 500 µL of PBS, at RT, under agitation, for 20 min. Do this four times.\nIncubate the sections in 250 µL of secondary antibody solution (PBS + 0.3% Triton X100 + 1% nonfat milk), at RT, under agitation, for 2 h.\nWash the sections in 500 µL of PBS, at RT, under agitation, for 20 min. Do this four times.\nStore the sections in 500 µL of PBS, at +4° C until clearing.\nClearing in TDE (2,2′ -Thiodiethanol)\nIncubate the sections in 500 µL of 30% and 60% TDE for 1 h each at RT, and then in 500 µL of 80% TDE overnight, at RT.\nStore the cleared sections in 500 µL of 80% TDE until acquisition at +4 °C.\nMounting of free-floating sections prior to acquisition with resonant scanning confocal",
    "Mount a free-floating section in a sealed chamber enabling to maintain the sample in 80% TDE solution and designed to adapt on a motorized XY stage of confocal microscopes.\nPut one round coverslip in the chamber system.\nCarefully transfer the cleared immunostained section using a paintbrush.\nFill the chamber with 80% TDE solution.\nAdd two standard coverslips plus one second round coverslip and a silicone seal.\nScrew on the screwing ring of the chamber to perfectly seal the system.\n5. Light sheet and resonant scanning confocal analysis\nProcess light sheet and resonant scanning acquisitions using software that enable 3D visualization and analysis of the entire immunostained sample.\n\tNOTE: Such software allows to quickly open huge data to easily make snapshots and animations. It allows to move the sample in different orientations and to generate 2D views thanks to a 2D slicer tool in different orientations, XY and YZ for example.\nFor automatic detection of both centrosomes and primary cilia, use a spot wizard enabling to quantify their number in pathological versus control conditions.\nFor 3D reconstruction of PC enabling precise measurement of their length, use a filament wizard to manually fix the starting point of the PC and the software uses the fluorescence signal to reconstruct the PC precisely.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}