{
  "id": 10515,
  "origin_website": "Jove",
  "title": "Isolation and Decellularization of a Whole Porcine Pancreas",
  "procedures": [
    "The dissection of a porcine pancreas and the decellularization procedure presented here follow the ethical guidelines of the University of Gothenburg.\n1. Preparation of the Decellularization Set-up\nUsing 3 x 5 mm silicone tubes, connect in series the detergent inlet container to the peristalic pump and then to the pancreas in the organ chamber via the degasser (see Figure 1). Connect a male luer to the free end of tube in organ chamber.\nUsing another 3 x 5 mm silicon tube, connect the organ chamber to the detergent outlet container via the peristaltic pump to collect the perfused detergent.\nConnect a 2 ml unlabeled pipette to the free ends of tubes in detergent inlet container and detergent outlet cointainer.\nKeep the whole set-up at 4 °C.\nimgsrc://cloudfront.jove.com/files/ftp_upload/58302/58302fig1v2.jpg\nFigure 1: Preparation of the perfusion set-up. Using a 3 x 5 mm silicone tube, as shown in the set-up, connect in series the detergent inlet container to the peristaltic pump, the degasser and the organ chamber. The black arrows show the flow direction from detergent inlet container to organ chamber. For the detergent outlet, use another 3 x 5 mm silicone tube and connect the organ chamber via the peristaltic pump to the detergent outlet container. The red arrows show the flow direction from organ chamber to detergent outlet container. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/58302/58302fig1v2large.jpg]\n2. Preparation of Decellularization Solutions\nSolution 1 (phosphate-buffered saline [PBS]): Add 8 g of (137 mM) sodium chloride, 0.2 g of (2.7 mM) potassium chloride, 1.44 g of (10 mM) sodium phosphate, and 0.24 g of (1.8 mM) potassium phosphate to 1 L of ultrapure water and stir until dissolved. Adjust the pH to 7.4 with hydrochloric acid (HCl). In total, 3.2 L of this solution is required.",
    "Solution 2 (PBS + heparin): To 1 L of Solution 1, add 3.4 mL of heparin (17 international units [IU]/mL). Prepare this solution fresh and keep it on ice until it becomes cold. In total, 1.2 L of this solution is required.\nSolution 3 (ultrapure water + sodium azide + disodium ethylenediaminetetraacetic acid [EDTA]): To 1 L of ultrapure water, add 1.86 g of (5 mM) EDTA and 200 mg of (0.02%) sodium azide. Stir until the salts are dissolved. Cool the solution to 4 °C before use. In total, 22 L of this solution is required.\nSolution 4 (PBS + sodium azide + EDTA): To 1 L of Solution 1, add 200 mg of (0.02%) sodium azide and 1.86 g of (5 mM) EDTA. Stir until the salts are dissolved. Cool the solution to 4 °C before use. In total, 1 L of this solution is required.\nSolution 5 (ultrapure water + sodium azide): To 1 L of ultrapure water, add 200 mg of (0.02%) sodium azide. Stir until the salts are dissolved. Cool the solution to 4 °C before use. In total, 260 L of this solution is required.\n\tNOTE: EDTA forms a precipitate with SDC and was excluded from Solution 5 since it will be used for immediate washing before and after the SDC treatment.\nSolution 6 (SDC + Triton X-100): To 940 mL of ultrapure water, add 40 g of (4%) SDC, 60 mL of (6%) Triton X-100, 200 mg of (0.02%) sodium azide, and 69.6 mg of (0.4 mM) phenylmethylsulfonyl fluoride (PMSF). Stir until dissolved. Cool the solution to 4 °C before use. Add PMSF before use. In total, 9.6 L of this solution is required.",
    "Solution 7 (DNase): Add 10,000 Kunitz units of DNase-I in 250 mL of (40 Kunitz units/mL) Dulbecco's PBS containing CaCl2 and MgCl2. Prepare fresh and use immediately. Warm the solution to 37 °C before use.\nSolution 8 (PBS + sodium azide): To 1 L of Solution 1, add 200 mg of (0.02%) sodium azide. Stir until the salts are dissolved. Cool the solution to 4 °C before use. In total, 1 L of this solution is required.\n3. Dissection of the Porcine Pancreas\nNOTE: In this study, porcine pancreases were dissected from euthanized, heparinized (400 IU/kg) female pigs weighing 45 kg from a farm.\nPlace the pig on the dissection table in the supine position.\nMake a midline incision from the xiphoidal process to the pubic bone (approximately 40 cm) using a scalpel, exposing all abdominal organs.\nLocate the splenic, duodenal, and connection lobes.\nLocate the level of the major duodenal papilla and ligate the duodenum orally from that site using two separate sutures.\nLigate the inferior esophagus with two separate sutures and cut between the ligatures with scissors to take the stomach out.\nSeparate the connective tissue from the colon to reach the small intestine.\nSeparate the connective tissue of the colon that attaches to the splenic lobe of the pancreas.\nRemove the colon from the small intestine after ligating the arteries.\nFind the inferior mesenteric vein and the inferior mesenteric artery tree and ligate with one suture where they appear caudally of the pancreas.\nLigate the splenic artery and vein together with one suture, close to the spleen, in the hilum, and cut distally with scissors to remove the spleen.\nFollow the duodenum until the duodenal and connection lobes are cleared and ligate the duodenum at the end with two separate sutures.",
    "Dissect the portal vein, ligate it with one suture to prevent any blood leakage from the liver and cut proximally to ligature. The portal vein serves as an outlet during the decellularization.\nDissect and ligate the bile duct and hepatic artery with two sutures. Cut distally to sutures.\nFind the aorta under the renal vein and dissect it in the cranial direction from muscle and connective tissue until it reaches the pancreatic area.\nFlip the pancreas gently over and dissect the aorta, keeping the SMA and the CT intact, and cut the aorta superior to CT and inferior to SMA with scissors.\nCut the remaining surrounding tissues with scissors and take the pancreas out.\nUsing a 50-mL syringe connected to 4-mm arteriotomy cannula, flush the organ through the aorta with Solution 2 until it perfuses the whole organ or until the whole organ becomes cold.\n4. Preparation of the Porcine Pancreas for Decellularization\nKeep the pancreas at 4 °C or on ice throughout the process.\nCut the sutures of the duodenum using scissors, clean it of food by flushing 50 - 150 mL of ultrapure water using a 25-mL pipette, and ligate it again with sutures.\nLigate one end of the aorta and all branches besides the SMA and CT with sutures to prevent leakage.\nInsert from the other end of the aorta a 4-mm arteriotomy cannula and ligate it with sutures.\nPerfuse the pancreas with Solution 3 for 1 h at 20 mL/min using the decellularization set-up.\n\tNOTE: Prefill the tubes of pump with solution 3 such that no bubbles enter the pancreas. Look for any leakages from all sides of the organ and ligate all open vascular branches with sutures, except the portal vein.",
    "Freeze the pancreas at -20 °C in Solution 4 until the start of the decellularization.\n5. Decellularization of the Porcine Pancreas\nThaw the pancreas at 4 °C.\nRun the peristaltic pump in the decellularization set-up with Solution 3 at 20 mL/min until no air bubbles are seen in the detergent inlet tube.\nPlace the pancreas in the decellularization container and connect the detergent inlet tube to the aorta of the pancreas. Wash the organ by perfusion with Solution 3 overnight at 20 mL/min at 4 °C.\nPour out the solution left in the organ chamber.\nReplace Solution 3 with Solution 5 and perfuse the pancreas for 30 min at 20 mL/min at 4 °C. Pour out the solution in the organ chamber.\nAdd Solution 6 and perfuse the pancreas for 8 h at 20 mL/min at 4 °C. Pour out the solution in the organ chamber.\nWash the organ by perfusion with Solution 5 for 96 h at 20 mL/min at 4 °C. Pour out the solution in the organ chamber.\nPrepare the pancreas for DNase treatment by recirculating 500 mL of Dulbecco's PBS containing CaCl2 and MgCl2 for 30 min at 37 °C. Pour out the solution in the organ chamber.\nAdd 250 mL of Solution 7 and perfuse the pancreas for 4 h at 20 mL/min at 37 °C. Pour out the solution in the organ chamber.\nWash the organ by perfusion with Solution 5 for 120 h at 20 mL/min at 4 °C.\nStore the organ in Solution 8 at 4 °C for short periods or at -20 °C for long periods.\n6. Verification of Decellularization\nUsing scissors, cut 3- to 10-mm biopsies from all lobes of the pancreas and fix them in formaldehyde for 48 h at room temperature.",
    "Wash the pieces in ultrapure water for 15 min, process them in a tissue processor following standard protocols, and embed them in paraffin.\nCut 5-µm sections using microtome and stain them by Meyer's hematoxylin and 0.2% alcoholic eosin (HE) following standard protocols.\nView the slides under a light microscope to check for the loss of nuclei.\n\tNOTE: A piece from a fresh tissue processed in the same way can be used as a control to check for the presence of nuclei."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}