{
  "id": 3831,
  "origin_website": "Cell",
  "title": "Protocol for building a cognitive map of structural knowledge in humans by integrating abstract relationships from separate experiences",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nOne-back task\nTiming: 5 min\nTo familiarize participants with the 16 faces stimuli, participants perform a one-back task at the beginning of the Day 1 training.\nThe following instructions are given at ▼1 in Figure1[href=https://www.wicell.org#fig1]B. Read the following instructions to the participant:\nYou will see a sequence of 16 businessperson’s faces presented one after another. A cross will be shown between each of the faces at different time intervals. Each face will be presented for 2 s.\nPress a space key using the keyboard if the face on the screen is the same with the face from the trial before.\nYou won’t get a feedback on your decision.\nYour goal is to press as quickly and accurately as possible.\nIn each of 48 trials, a face stimulus is shown on the middle of the black screen for 2s followed by a 1s inter trial interval (ITI) with a grey cross in a black background.\n16 faces images are presented to participants in pseudorandom order. All 16 faces are shown three times while each face is followed by itself once.\nNote: The response data of the one-back task is not analyzed.\nLearning and test blocks (day 1 and day 2)\nTiming: 2 h in each day (30 m per block, 4 blocks in a day)",
    "The purpose of this behavioral training is to guide participants in learning the status of 16 unfamiliar people in two separate groups organized hierarchically on two orthogonal social hierarchy dimensions (Figure1[href=https://www.wicell.org#fig1]A). Participants complete three days of behavioral training, with a 48-h gap between each training session over a five-day period: the 1st day, Day 1 training; 3rd day, Day 2 training; and 5th day, Day 3 training (Figure1[href=https://www.wicell.org#fig1]B). During Day 1 and Day 2 participants learn the relationship of within-group members.\nDuring the first two days of training, participants learn two social hierarchies (one per group) through piecemeal experiences of pair comparisons. That is, the possible pairs of face stimuli to be compared were randomly chosen (not in succession across trials), which requires participants to integrate the knowledge learned at different times to construct the overall structural relationship.\nThe 16 face stimuli are split into two eight-person groups (Figure1[href=https://www.wicell.org#fig1]A). Participants learn the relative ranks of the two groups’ members in different dimensions separately in different blocks.\nEach day consists of four learning-blocks. Each learning-block is followed by a test-block (Figure1[href=https://www.wicell.org#fig1]B).\nFor example, for the first day of training, a participant learns the relative ranks of group 1 in the popularity dimension for block 1 and 3 (Figure1[href=https://www.wicell.org#fig1]C) and the relative ranks of group 2 in the competence dimension for block 2 and 4 (Figure1[href=https://www.wicell.org#fig1]D).\nFor the second day of training, the participant learns the relative ranks of each group in the unlearned dimensions in the same way. That is, the participants learn the relative ranks of group 1 in the competence dimension in block 1 and 3 (Figure1[href=https://www.wicell.org#fig1]E) and the relative ranks of group 2 in the popularity dimension in block 2 and 4 (Figure1[href=https://www.wicell.org#fig1]F).",
    "During learning-blocks participants learn the relative ranks of individuals through a series of feedback-based dyadic comparisons.\nParticipants learn relationships between individuals who differed by only one rank on the given dimension by completing 96 trials of binary decisions while receiving feedback on their choices.\nThere are 12 possible pairs of individuals whose ranks have one rank difference in each of two dimensions (Figures 1[href=https://www.wicell.org#fig1]C–1F, non-dotted arrows).\nThe pairs (i.e., A and B individuals) switch positions on the screen between trials (i.e., both ‘A and B’ and ‘B and A’ are shown in the right and the left side of the screen in different trials; 12 trials×2 = 24 pairs).\nEach pair is presented four times (24 pairs×4 = 96 pairs) in a random order.\nDuring test-blocks participants make inferences on the relative status of a pair of individuals who differed by one or more levels on one dimension.\nDuring each test-block participants complete 96 trials of binary decisions.\nThere are 24 possible pairs of individuals whose ranks have differences of one or more ranks differences in each of two dimensions (Figures 1[href=https://www.wicell.org#fig1]C–1F, dotted arrows).\nThe position of these 24 pairs are alternated (48 pairs) and presented twice (96 pairs).\nThe 96 pairs are presented in a random order.\nDuring test-blocks participants do not receive any feedback.\nDuring test-blocks the pairs presented in each trial, response, accuracy and the reaction times were recorded in output file.",
    "Critical: Participants are never asked to combine individuals’ ranks in both dimensions to make decisions, and they are never shown either the one-dimensional (1-D) or two-dimensional (2-D) social hierarchies. Participants are never given any information implying the structure of social hierarchies, such as the total number of ranks in each dimension, or the number of individuals allocated into the same rank and are never asked to solve the task spatially. Participants have up to 10 s to make a decision. If not responding in time, the next trial is presented. The missed trials are tested again after a random number of trials in the same block, this allows for collecting responses to all trials from all participants. To avoid the possibility that participants make decision strategically, participants are not informed of this. It is critical to make participants learn the hierarchy of different dimensions on different days. Based on a preliminary test, we found that all participants were not able to learn the hierarchy in two dimensions within one day training. This protocol has only been tested with the 48 h gap between training sessions which was chosen based on the general class schedule of participants.\nTask instruction for the learning and test blocks (day 1 and day 2)\nTiming: 30 min\nParticipants received oral instructions about the task with examples. Different faces from the actual stimuli are used in these examples. Participants were told the following information while each image (i.e., Figures 1[href=https://www.wicell.org#fig1]C and 1E) is on the screen. Participants receive this information at the time of ▼2 on Day 1 in Figure 1[href=https://www.wicell.org#fig1]B and are reminded again at the time of ▼3 on Day 2 in Figure 1[href=https://www.wicell.org#fig1]B.\nProvide the following cover story",
    "In this task, you will be shown two businessperson’s faces from the previous group of 16. These businesspersons have been previously evaluated based on two independent criteria “popularity” and “competence.”\nPopularity will be defined as individual’s ability to raise capital or funds through crowdfunding. For example, if business person A raised $10 million on Kickstarter for a previous venture, and business person B only raised $5 million on Kickstarter for a previous venture, then business person A would be considered to have a relatively higher popularity than B.\nCompetence will be defined as the business person’s technical skill set. For example, if business person A knows how to build or design a product better than business person B, then business person A would be considered to have a relatively higher competence than B.\nGive the following instructions while an example image of a learning block cue is present.\nThe learning block will start with “LEARN” sign on the screen.\nDecision during learning block\nGive the following instructions while an example image of a Decision phase during the learning-block is present.\nAt each trial in the learning block two faces among 16 entrepreneurs will be presented on the screen (top right and top left) with a color square (bottom middle) which indicates the task relevant dimension.\nWhen the square between the two businessperson's is red, you will infer the businessperson’s rank by popularity.\nWhen the square between the two businessperson's is blue, you will infer the businessperson’s rank by competence.\nDuring a learning block, through trial and error, you will need to learn which of the two businesspersons is relatively more popular or more competent.\nDuring the learning-block two individuals are paired together in every trial have one rank difference in the given social hierarchy dimension.",
    "Please choose the face who is of higher rank than the other by pressing a right or left arrow key on the keyboard.\nBecause the two faces on the screen always have one rank difference in the given dimension, there is always a correct answer.\nYour choice will be highlighted with the color corresponding to the given criteria.\nFeedback during the learning-block\nGive the following instructions while an example image of feedback during the learning-block is present.\nDuring the learning-block you will receive feedback for their choices.\nIf you choose the correct choice (the more popular or more competent business person), the word “correct” (in green) will be displayed on the screen.\nIf you choose the incorrect choice (the less popular or less competent business person), the word “incorrect” (in orange) will be displayed on the screen.\nYou can always rely on the feedback to learn. Therefore, after some trial-and-error, you will learn about the business person’s relative competence and popularity and be able to make correct decisions.\nSome business persons can be at the same rank in the social hierarchy. For example, when an individual A is shown together with B as well as C in different trials under the same competence criteria, and A is higher rank than both B and C, then B and C are at the same rank in the competence criteria.\nImportantly, we won’t show two faces who are at the same level in the given criteria. In the example, because B and C are not one rank different from each other but at the same rank, you would not see B and C together in the competence criteria.\nTherefore, there is always a correct answer.\nWhen you have “incorrect” sign, you can also learn that the other has higher competence or popularity.",
    "After feedback, the next trial would start.\nYour goal is to be as accurate as possible.\nYou will have up to 10 s to make a decision. If you do not respond in time, a text message, ‘Missed’ is shown for 2s which is followed by the next trial.\nWhen you see “BREAK” on the screen. Please take a small break and resume the task by pressing either left or right arrow key when you are ready.\nTest-block cue\nGive the following instructions while an example image of test block cue is present.\nWhen a learning-block ends, participants proceed to the test-block.\nParticipants can take a short break and start the test-block training by pressing any key when they are ready.\nDecision phase in test-block\nGive the following instructions while an example image of test block decision is present.\nDuring each test-block trial, you will see a pair of businesspersons and a color square indicating the task relevant dimension, similar to a learning-block trial.\nYou are asked to choose the businesspersons who is higher in rank than the other in the given criteria using the same arrow keys.\nEvery trial in the test-block will be presented under the same criteria (competence or popularity) of the previous learning-block.\nYou will see businesspersons among those they learned the relative rank in the given dimension.\nUnlike the learning-block, during test block a pair of two businesspersons can be one or more ranks difference.\nYour goal is inferring the relationship between two faces in the given criteria accurately.\nFor example. if you know that A is more competent than B, and B is more competent than C, then you can answer A is more competent than C.",
    "Unlike the learning-block, during test block you will not get any feedback on their choice, meaning the trial will not display “correct or “incorrect.”\nIf you did not make a choice within 10s, during the test blocks, a text message, ‘Missed’ is shown for 2s which is followed by the next trial.\nNew learning- and test-block cues\nGive the following instructions while an example image of the learning block cue is present.\nAfter a test block a new learning and test block is presented.\nThere are 4 learning-blocks. Each learning-block is followed by a test-block.\nParticipants would need to use the knowledge acquired during the learning-block to make better decisions in the later part of the experiments earning more monetary rewards according to their performance.\nAsk the following questions at the end of task instruction (at the time of ▼2 and ▼3 in Figure1[href=https://www.wicell.org#fig1]B). Ensure participants can answer correctly the following questions. If they can’t, provide the relevant instruction again (see below) and ask the question again.\nMake sure participants are able to associate each of the two colors to each of the two different dimensions of the hierarchy. It is important for the studies that specifically plan to take context variant variables into the analysis such as the direction of vector navigation over the cognitive map. For example, cosine angle vectors can indicate the competence modulated by popularity or the popularity modulated by competence according to how the vector angles are defined. Importantly, they can be different. To test this effect across participants, therefore, a researcher should be able to assume all participants use the same axis as the reference frame.\nWhen the square displayed between two businesspersons is red, what are you testing for?\nWhen the square displayed between two businesspersons is blue, what are you testing for?",
    "If a participant cannot answer correctly, provide the cover story again (in 8).\nDuring the learning-block, entrepreneur A is compared with entrepreneur B, as well as with entrepreneur C. If B is higher competence than A and A is higher competence than C, then who is at higher rank in competence dimension between B and C? And what is the rank level difference in the competence dimension?\nThe right answer is that ‘B is two rank higher than C in competence dimension’.\nIf a participant cannot answer correctly, provide the decision and feedback phases instruction in learning block story again (in 9 and 10).\nIf A is higher rank in popularity than B, who is at the higher rank in the competence dimension?\nThe right answer is ‘I don’t know’.\nIf a participant cannot answer correctly, provide the cover story again (in 8).",
    "Critical: Participants should be clearly instructed about the following information: feedback-based learning is limited to the relationship between individuals who differed by only one rank on one dimension at a time. During test-blocks, participants make inferences of the relationship between individuals who differed by one or more ranks on one dimension at a time. We have not tested the protocol without providing this instruction because participants theoretically could construct a social hierarchy structure in different forms without this information while making successful inferences during behavioral training based on this alternative structure. It is critical for researchers to be able to assume that participants place neighboring individuals with equidistant intervals to examine the distance and angles of inferred trajectories when participants use this representation as a map for making novel inferences. If participants have different structures, the distances and angles of the inference trajectories wouldn’t be measurable, which would subsequently prevent us from concluding whether participants construct the maps in 2-D space or not.\nOptional: During the first learning-block, half of the participants learn the competence dimension and the other half learn the popularity dimension (order counterbalanced).\nNote: From preliminary experiments, we have found that participants could not learn the relationship between one group of individuals in two dimensional hierarchies within one day. It is important to make participants learn each of two-dimensional hierarchies in separate days. We speculate that the memory consolidation process during sleep plays a critical role to transform the recently learned experiences into a more stable structural form (Ellenbogen et al., 2007[href=https://www.wicell.org#bib1]) and to afford learning multidimensional structural knowledge.\nPause Point: When the learning-block cue or test-block cue is on the screen, the participant could take a break and press any key to start a learning-block when they are ready.",
    "Testing within-group social hierarchy in intermixed dimensions (Test2 blocks on day 2 and day 3)\nTiming: 1 h in each day\nAfter the learning- and test-block on Day 2 training is complete, participants perform an additional test-block called ‘test2’. The test2-block (Figure1[href=https://www.wicell.org#fig1]G) includes the trials in which participants infer the relative rank between individuals who belongs to the same group (two individuals in group 1 or in group 2). During this additional test block (Test 2) the two dimensions are intermixed for the first time and presented in a random order across trials. This same test2-block is also performed at the beginning of Day3 training. Unbeknownst to participants, a missed trial is tested again after a random number of trials in the same block, which allowed collection of responses to all trials from all participants. We did not inform participants of this to prevent potential strategic decisions.\nLike the previous test blocks, during intermixed test block, participants choose a higher rank individual between two who have one or more rank difference in the given dimension.\nDuring intermixed test blocks present participants with all possible pairs whose ranks are different in each of two social dimensions while the task relevant dimension is intermixed across trials.\nDuring the intermixed test block on Day 2 participants make inferences on 192 unique pairs which were presented in the test blocks.\nThese 192 trials include 96 trials in competence dimension and 96 trials in popularity dimension (Figure1[href=https://www.wicell.org#fig1]G dotted-lines).\nFor Day 3 intermixed test block, participants make the same inferences while the position of the faces (right or left side) on Day 2, is alternated on Day3 (left or right side).\nDuring intermixed test blocks participants did not receive any feedback for their choice.",
    "During test2-block the pairs presented in each trial, response, accuracy and the reaction times were recorded in output file.\nParticipants who successfully distinguished the second and third rank individuals in each of two social hierarchy dimensions above chance (>50%) while also reaching more than 85% accuracy overall continue the behavioral training for the ‘hub learning’ phase on Day3 (See exclusion criteria[href=https://www.wicell.org#sec4.1] in quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis] for details of exclusion threshold).\nTask instruction for Test2 blocks\nTiming: 5 min\nThe following information is explained to participants at ▼4 and ▼5 in Figure1[href=https://www.wicell.org#fig1]B while presenting the intermixed test block cue.\nTest2-block cue\nThe block cue is the text ‘Test2’. ‘Test2’ is the title given to signify intermixed test block to participants.\nDecision in test2-block\nInform participants that during the test2-block, they choose who has a higher rank between two individuals in the given dimension.\nDuring the test2-block the task-relevant social hierarchy dimension can change every trial. Otherwise, these trials are identical to the other test-blocks.\nInform participants that they get an extra monetary bonus if their overall accuracy in the intermixed test block of each day is more than 90%, and they can get double the bonus when the accuracy is more than 95%.\nInform participants that if their overall accuracy in the intermixed test block of each day is below a certain threshold (which we do not specify), they could not continue the experiment.\nCritical: Check your IRB approval allows to provide performance-based compensation.\nPause Point: When test2-block cue is on the screen, the participant can take a break and press any key to start a learning-block when they are ready.\nLearning between-group social hierarchy (Hub learning blocks on day 3)\nTiming: 30 min (15 min per block, 2 blocks)",
    "During the first two days of training, participants learn the relative status of two groups of 8 individuals separately, on only one dimension per day. During Day3 hub-learning-block, participants learn the relationship of selected between-group members for the first time. Connecting two groups, the hub individuals allow unique “paths” to be created between members of different groups. By learning between-group relationships through the hubs, participants are theoretically able to make novel inferences of unlearned relationships of two between-group individuals. During the novel inferences, the hub will play an important role for transitive inferences between unlearned pairs of between-group individuals. This hypothesis can be tested in a separate experiment (Park et al., 2020a[href=https://www.wicell.org#bib2]).\nIn each trial of hub learning, participants are presented with two individuals in different groups. At least one of them is the ‘hub’. The hub indicates an individual who has been paired not only with within-group members during Day1 and Day2 training, but also with between-group members during Day3 hub-learning-blocks.\nDuring the hub learning block, we present a color cue indicating the task-relevant dimension and face stimuli (F1 and F2) in sequential order (Figure2[href=https://www.wicell.org#fig2]A). This sequential presentation is only to make participants familiar with the task in the future experiment (Park et al., 2020a[href=https://www.wicell.org#bib2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/553-Fig2.jpg\nFigure 2. The protocol for the hub-learning on day 3\n(A) An example trial of hub-learning.",
    "(B and C) The position of hubs and non-hubs. Note that the thin lines within each social hierarchy indicate the learned relationships during Day-1 and Day-2 training. The bold lines between two hierarchies indicate the pairs presented during the hub-learning. The hubs are paired with the non-hubs individuals in the other group who have 1 rank level difference in the given dimension. Therefore, the hubs in blue/red backgrounds are paired only with other non-hubs who are also in the same colored background.\nDuring hub learning a hub in one group is paired with four members in the other group in the given dimension.\nA hub is always rank 2 or 3 in the task-relevant dimension. This ensures all hubs have “won” and “lost” on ½ of trials and allows for equal comparisons with 1-rank-level difference people of both higher and lower rank.\nLike the learning-block on Day 1 and Day2, two faces paired in each trial of the hub learning block also have one rank difference. Therefore, a hub rank 2 would be paired with a rank 1 or 3 in the given dimension. A hub rank 3 would be paired with a rank 2 or 4 in the given dimension (Figures 2[href=https://www.wicell.org#fig2]B and 2C).\nThere are two individuals who are the hubs in each group in the popularity dimension (Figure2[href=https://www.wicell.org#fig2]B) and another two individuals who are the hubs in each group in the competence dimension (Figure2[href=https://www.wicell.org#fig2]C) (eight hubs in total).\nThere are 64 trials in each hub learning block.\nThere are 32 unique possible pairs in hub learning (Bold lines between two groups in Figures 2[href=https://www.wicell.org#fig2]B and 2C).\nIn a learning block each pair is tested twice in a different order (i.e., A hub is F1 for half of the trials and F2 for the other half).",
    "While F2 is present (2s), participants choose the higher rank individual between F1 and F2. Participants use the same arrow keys, pressing the left for choosing F1 or pressing the right for choosing F2.\nA face stimulus (F3) is presented at the end of each trial for the cover task. F3 is randomly selected from non-hub individuals in both dimensions (Figure2[href=https://www.wicell.org#fig2]A).\nOptional: During the hub learning block, the stimuli were not presented together on the screen but presented in sequential order (Figure2[href=https://www.wicell.org#fig2]A). This sequential presentation is only to acclimate participants to the future task design in which it is required to separate the neural signals associated with each individual stimulus, F1 and F2 (Park et al., 2020a[href=https://www.wicell.org#bib2]). Alternatively, if researchers plan a future study in which the cognitive process associated with each face stimulus does not need to be temporally separated, the stimuli (F1 and F2) can be presented together on the screen as participants have been previously trained on.\nTask instruction for the hub learning blocks (day 3)\nTiming: 15 min\nThe following information is explained to participants at ▼6 in Figure1[href=https://www.wicell.org#fig1]B while presenting an example trial which includes faces not used for the actual experiment.\nHub-learning-block cue\nThe block cue is the text message written ‘Learning2’. ‘Learning2’ is the title given to signify the hub-learning block to participants.\nInstruct participants that during learning2-block 3 faces are presented sequentially after a color cue indicating the task-relevant dimension.\nDecision in hub-learning\nWhile the second face (F2) is present, for 2s, participants choose the higher rank individual between the first (F1) and F2. Participants use the arrow keys, pressing the left (⟵) for choosing F1 or pressing the right (⟶) for choosing F2.",
    "Like other learning-blocks, two faces paired in the learning2-block also have one rank difference in the given social hierarchy dimension.\nParticipants receive feedback for their decision.\nWhen presenting F3, ask participants to press an arrow key (⟵) when F3 is a woman and to press the other key (⟶) when F3 is a man (the opposite configuration was used for the half of participants) as quickly as possible.\nDifferent colored crosses are presented between stimuli which inform participants the progress of each trial of hub learning.\nThere is a white cross fixation between the task relevant dimension cue and F1, a purple cross fixation between F1 and F2, and a green cross fixation between F2 and F3.\nThere is a grey cross fixation before the next trial.\nThere are two learning blocks.\nNote: Using different colors of fixation crosses helped participants know the progress of each trial during hub learning training.\nPause Point: When learning2-block cue is on the screen, the participant can take a break and press any key to start the learning-block when they are ready.",
    "Critical: Since we do not explicitly mention the two groups, we also do not use the word ‘hub’ when explaining the task to participants. We present stimuli in sequential order to make participants get used to the following fMRI experiment. To make participants acclimatize to the timing of sequential presentation, participants experience some example trials with faces that are not used during the actual experiment. The F3 presentation is not essential for building a cognitive map. However, by presenting a non-hub face as F3, we can ensure each face is presented an equal amount of times during hub learning (12 times per each face stimulus). It is potentially important to make sure participants are not familiarized with a certain face over the others in order to construct an unbiased cognitive map. To avoid the possibility that participants associate the F1-F2 pair with a specific F3 face, F3 is shown in block 1 after a pair of F1 and F2 that is different from F3 shown in block 2 after the same F1-F2 pair. A missed trial is tested again after a random number of trials in the same block, which allowed collecting responses to all trials from all participants.\nBehavioral training protocol for learning one group hierarchy in two dimensions\nOur same protocol could instead be administered to have subjects construct a unitary 2-D cognitive map of a single social hierarchy learned from piecemeal pairwise comparisons. The following is the altered protocol for the studies (Park et al., 2020b[href=https://www.wicell.org#bib3]) in which participants learned the relative status of 16 individuals in a combined 4 × 4 social hierarchy structure in two dimensions (not two groups of social hierarchies).",
    "The behavioral training protocol for learning a social hierarchy of a single 16 people group is the same with the protocol for learning the social hierarchies of two groups except for the following differences. First, the steps from 36 to 39 substitute for the steps from 3 to 6 (in the section of the learning and test blocks – Day 1 and Day 2). Second, the steps from 40 to 45 substitute for the steps from 16 to 19 (in the section of testing within-group social hierarchy in intermixed dimensions – Test2 blocks on Day 2 and Day 3). Since participants learn the relationship of 16 individuals together, participants do not need to participate in the hub-learning block (the steps from 24 to 35). Except for the upper mentioned steps, all the other steps and the task instruction are the same.\nLearning and test blocks (day 1 and day 2)\nTiming: 2 h in each day (1 h per block, 2 blocks in a day)\nThe purpose of this behavioral training is to guide participants in learning the status of 16 unfamiliar people organized hierarchically on two orthogonal social hierarchy dimensions (Figure1[href=https://www.wicell.org#fig1]A). Participants complete three days of behavioral training, with a 48-h gap between each training session over a five-day period: the 1st day, Day 1 training; 3rd day, Day 2 training; and 5th day, Day 3 training (Figure1[href=https://www.wicell.org#fig1]B).\nThe relative ranks in one dimension are learned and tested on Day1 and those in the other dimension are learned and tested on the Day 2.",
    "Participants learn the relative ranks in one dimension and are tested on Day 1. Participants then learn the relative ranks in the other dimension and are tested on Day 2. Because the possible pairs are doubled of those for learning two groups’ social hierarchies, we reduced the number of blocks as half (2 blocks).\nParticipants learn relationships between individuals who differed by only one rank on the given dimension by completing 96 trials of binary decisions while receiving feedback on their choices.\nThere are 48 possible pairs of individuals whose ranks have one rank difference in each of two dimensions (Figure1[href=https://www.wicell.org#fig1]H, non-dotted arrows).\n48 pairs are presented in a random order in each block (Individuals in the right side have a higher rank for one half (24 pairs); individuals in the left side have a higher rank for the other half).\nThe pairs (i.e., A and B individuals) switch positions on the screen in the second block (i.e., both ‘A and B’ in block 1 is shown as ‘B and A’ in block 2).\nDuring test-blocks participants make inferences on the relative status of a pair of individuals who differed by one or more levels on one dimension.\nDuring each test-block participants complete 96 trials of binary decisions.\nThere are 96 possible pairs of individuals whose ranks have differences of one or more ranks differences in each of two dimensions (Figure1[href=https://www.wicell.org#fig1]H, dotted arrows).\n96 pairs are presented in a random order in each block (Individuals in the right side have a higher rank for one half (48 pairs); individuals in the left side have a higher rank for the other half).\nThe position of these 96 pairs are alternated (192 pairs) and presented across two blocks.\nDuring test-blocks participants do not receive any feedback.",
    "During test-blocks the pairs presented in each trial, response, accuracy and the reaction times were recorded in output file.\nTesting within-group social hierarchy in intermixed dimensions (Test2 blocks on day 2 and day 3)\nTiming: 1 h in each day\nAfter the learning- and test-block on Day 2 training is complete, participants perform an additional test-block called ‘test2’. The test2-block (Figure1[href=https://www.wicell.org#fig1]G) includes the trials in which participants infer the relative rank between individuals. During this additional test block (Test 2) the two dimensions are intermixed for the first time and presented in a random order across trials. This same test2-block is also performed at the beginning of Day3 training. Unbeknownst to participants, a missed trial is tested again after a random number of trials in the same block, which allowed collecting responses to all trials from all participants. We did not inform this to participants to prevent potential strategic decisions.\nLike the previous test blocks, during intermixed test block (Test2), participants choose a higher rank individual between two who have one or more rank differences in the given dimension.\nDuring a Test2 participants make transitive inferences of relative status between individuals in all possible 384 pairs (96 pairs per one dimension × 2 for presentation in alternating order × 2 dimensions) who had one or more ranks differences while feedback is not given (Figure 1[href=https://www.wicell.org#fig1]H dotted lines).\nThe 384 trials are tested twice in Test2 block on Day2 and Day3.\nDuring intermixed test blocks participants did not receive any feedback for their choice.\nDuring test2-block the pairs presented in each trial, response, accuracy and the reaction times were recorded in output file.",
    "Participants were asked to repeat the protocol over multiple training days until their accuracy reached the designated threshold (such as 95%) in a Test2 block. This helps to make participants learn a more accurate cognitive structure while increasing the retention rates (see the limitations[href=https://www.wicell.org#limitations] section below).\nOptional: The threshold is determined by to what extent the researcher wants participants have an accurate cognitive map. Importantly, the threshold should be set higher than 85% while participants who successfully distinguished the second and third rank individuals in each of two social hierarchy dimensions above chance (>50%) (See exclusion criteria[href=https://www.wicell.org#sec4.1] in quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis] for details of exclusion threshold).\nPlacement task\nTiming: 5–10 min\nThe placement task (Figure 3[href=https://www.wicell.org#fig3]A) is not included in the training procedure. However, this is useful to test whether the behavioral training is efficient to generate an accurate cognitive map.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/553-Fig3.jpg\nFigure 3. Expected results of the behavioral training\n(A) An example screen of the placement task.\n(B) The example results of the placement task. The red and blue dots indicate the mean position (± standard error mean) of each businessperson while the grey dots represent their correct position according to their ranks in the social hierarchy. Figure reprinted with permission from (Park et al., 2020a[href=https://www.wicell.org#bib2]).\n(C) The coefficient of the multiple linear regression predicting the reaction times (RT) from the rank difference between a pair in the task-relevant dimension, D, and the rank difference in the task-irrelevant dimension, I.\n(D) The mean RT according to the rank differences in the task-relevant dimension (right); the mean RT according to the rank differences in the task-irrelevant dimension (left).\nFor the placement task, participants are presented with all 16 faces simultaneously in a randomized order on the left side of the screen.",
    "Participants select a face by mouse-click and designate where they believe the face ranked on a two-dimensional graph space.\nThe X and Y axis labels are counterbalanced between Popularity and Competence across participants.\nThere is no time limit. When participants finished the placement task, we asked the following questions. Participants do not get any feedback on their responses.\nHow many levels are in the popularity dimensions? – If participants learned the social hierarchy well they should answer as 4 levels\nHow many levels are in the competence dimension? – If participants learned the social hierarchy well they should answer as 4 levels\nIs any distance between neighboring individuals particularly longer/shorter than the others? – If participants learned the social hierarchy well they should know that all neighboring individuals are equidistant.\nAsk participants whether the multiple faces they place along an axis are at the same level in the dimension.\nAsk participants to place the faces on that axis as accurately as they could.\nAsk participants to press ‘q’ key once they complete to save and quit.\nCritical: Because of the purpose of the study, participants should not be explicitly asked to use a spatial representation for the following main experiment. Therefore, the placement task is not performed by subjects in the main experiment. We performed a placement task in a separate group of participants who did not participate in the following fMRI experiment to ensure the participants for fMRI experiments were never asked to solve the task spatially (Park et al., 2020a[href=https://www.wicell.org#bib2]). Alternatively, to examine the internal representation of the cognitive map of the fMRI participants with the placement task, it should be performed after finishing the fMRI experiment (Park et al., 2020b[href=https://www.wicell.org#bib3])."
  ],
  "subjectAreas": [
    "Clinical Protocol",
    "Neuroscience",
    "Behavior"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Ecology & Environmental Biology"
  ]
}