{
  "id": 18596,
  "origin_website": "Jove",
  "title": "Chick Heart Invasion Assay for Testing the Invasiveness of Cancer Cells and the Activity of Potentially Anti-invasive Compounds",
  "procedures": [
    "imgsrc://cloudfront.jove.com/files/ftp_upload/52792/52792fig1.jpg\nFigure 1. Schematic overview of the different assay steps. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/52792/52792fig1large.jpg]\n1. Preparation of Precultured Heart Fragments (PHFs)\nIncubate a fertilized chick egg at 37 °C for 9 days. Complete this incubation by a date that allows subsequent preparation of PHFs during 4 days (e.g., on a Thursday) and final confrontation with tumor cell aggregates (e.g., on the nest Monday).\nDisinfect the shell with 70% (v/v) ethanol in water. Carry out all further manipulations in a tissue culture cabinet using sterile solutions and materials. Open the shell at the embryonic pole using blunt forceps.\nPull out the embryo by holding the neck with an enucleation spoon (Figure 2). Place the embryo in a glass Petri dish with a diameter of 5 cm containing 5 mL of Ringer’s salt solution.\n\t\nOpen the ventral thoracic skin by ripping open the skin using a sharp forceps in both hands, remove the sternum by the same type of manipulation, and dissect out the heart using microdissection iridectomy scissors to disconnect its major blood vessels. Perform all further manipulations under a macroscope with a calibrated ocular grid.\nimgsrc://cloudfront.jove.com/files/ftp_upload/52792/52792fig2.jpg\nFigure 2. Lifting the embryo out of the egg with an enucleation spoon. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/52792/52792fig2large.jpg]\nTransfer the heart to a glass Petri dish with a diameter of 5 cm containing 5 ml of MEM-Rega 3 culture medium with 5% fetal bovine serum. Remove the atria and associated vessels by resecting the upper cranial third of the heart using microdissection iridectomy scissors. Dissect the pericardium from the ventricles with a pair of sharp forceps.\nMake a sagittal hemisection in the ventricles using microdissection iridectomy scissors, and remove the blood by gently shaking with a sharp forceps.",
    "Transfer the ventricles into another glass Petri dish with a diameter of 5 cm containing 5 ml of fresh MEM-Rega 3 culture medium with 5% fetal bovine serum. Cut the ventricles into pieces of approximately 0.4 mm in diameter by using microdissection iridectomy scissors. One heart can yield about 100 fragments.\n\tNote: One heart can yield about 100 fragments\nRotate the Petri dish gently to drive all ventricular fragments toward the center of the dish. Remove all corpora aliena with a stainless steel needle by separating them from the ventricular fragments and driving them towards the periphery of the Petri dish.\nTransfer the heart fragments with a glass Pasteur pipet to a 50 ml Erlenmeyer flask containing 2 to 3 ml of culture medium (MEM-Rega 3 plus 10% v/v fetal bovine serum).\n\tNote: The exact medium volume depends on the variable bottom convexities of the individual flasks: the centre of their bottom should be covered by a thin film of liquid only.\nGas the flask(s) with a mixture of 5% CO2 in air via the stoppers, and incubate the flask(s) on a gyrotory shaker at 37 °C at 70 revolutions/min (rpm) for 24 hr. The rationale for this suspension culture step is to obtain spheroidal heart tissue fragments suitable for subsequent confrontation with tumor cell aggregates.\nTransfer the heart fragments and their culture medium to a Petri dish. Discard corpora aliena, necrotic (dark) fragments, and conglomerates of heart fragments with a needle.\nIncubate the remaining heart fragments in another 50 ml Erlenmeyer flask containing 6 ml of culture medium as described in step 1.9 for another 60 h.\n\tNote: During this incubation period, the fragments will become spherical. They consist of a core of myoblasts and a thin layer of fibroblastic cells at the periphery.",
    "Select spheroidal fragments exhibiting a thin, homogeneous layer of fibroblastic cells (forming a translucent capsule) and a diameter of 0.4 mm by means of a macroscope and needles. One chick heart will yield about 20 suitable PHFs. Transfer these PHFs, many of which will contract rhythmically at 37 °C, to another Petri dish containing fresh culture medium. These PHFs are ready for confrontation with test cells.\n2. Preparation and Confrontation of Spheroidal Test Cell Aggregates\nPrepare semi-solid agar medium: dissolve 100 mg of agar in 15 ml of Ringer’s salt solution by boiling three times. Cool the suspension to 40 °C and add 7.5 ml of Ringer’s salt solution/egg white (1:1) and 7.5 ml of fetal bovine serum.\nPrepare 6 ml of a suspension containing 1 × 105 test cells/ml in their appropriate culture medium in a 50 ml Erlenmeyer flask. Do this 3 days before the start of the confronting culture is planned. Incubate the flask on a gyrotory shaker at 37 °C at 70 rpm for 3 days. Gas the flasks with a mixture of 5% or 10% (v/v) CO2 in air, depending on the type of culture medium used.\nView the aggregates under a macroscope equipped with a calibrated ocular grid. Select (with a needle) spheroidal cell aggregates with a diameter of 0.2 mm.\nUse a Pasteur pipet to transfer eight selected PHFs (diameter = 0.4 mm) in a minimal amount of culture medium to an embryological watch-glass containing semisolid agar medium13. Move the individual PHFs with a needle to form a circle. Aspirate excess medium using a small piece of filter paper (see Figure 3).\nimgsrc://cloudfront.jove.com/files/ftp_upload/52792/52792fig3.jpg",
    "Figure 3. Aspiration of excess fluid around PHFs. Eight PHFs are placed on semi-solid agar in an embryological watch glass, and fluid excess is removed with a small triangular piece op filter paper. Arrows indicate the 8 individual PHFs. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/52792/52792fig3large.jpg]\nBring ten selected spheroidal cell aggregates (diameter = 0.2 mm) into the circle using a Pasteur pipet. Aspirate excess medium. Move one aggregate towards each of the PHF with the needle until they make contact with each other. Aspirate excess medium using a small piece of filter paper.\nSeal the lid of the watch-glass with paraffin, and incubate at 37 °C for 4 - 24 h, depending on the adhesive properties of the test cells to the PHFs.\nImmerse the confronting pairs with pre-warmed (37 °C) culture medium, and transfer each individual pair with a Pasteur pipet into a 5 ml Erlenmeyer flask containing 1.5 ml of culture medium.\nIncubate the flasks on a gyrotory shaker at 37 °C adjusted to 120 rpm. Gas the flasks with 5% or 10% (v/v) CO2 in air, depending on the type of culture medium used for the test cells (see Figure 4).\n\t\nTo avoid concentration of the media, moisten the gasses by passing them through two supplementary 5 ml Erlenmeyer flasks filled with 2 ml of Ringer’s salt solution. Refresh the culture medium every 8 days.\nimgsrc://cloudfront.jove.com/files/ftp_upload/52792/52792fig4.jpg",
    "Figure 4. Small Erlenmeyer flasks on top of a gyrotory shaker. The flasks with 1.5 ml of culture medium are sealed with silicone stoppers equipped with a gas in - and outlet needle, and moved at 120 rpm at 37 °C. The gas is led by an inlet tubing (1) to the larger Erlenmeyer flask (2) filled with sterile Ringer’s salt solution, and further distributed (3 and 4) to smaller flasks containing culture medium with individual confronting pairs (5 and 6). Finally, spent gas is collected in a larger flask with a sterile water trap (7), from where it can escape into the air (8). The figure shows two sets of culture batteries on top of a home-made platform plate. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/52792/52792fig4large.jpg]\n3. Histology of the Confronting Cultures\nPrepare Bouin-Hollande’s fixation solution.\n\t\nDissolve 2.5 g of cupric acetate (neutral) in 100 ml of single-distilled water and slowly add 4.0 g of picric acid.\nFilter the solution through a paper filter. Add 10 ml of formalin and 1 ml of acetic acid. Mix 9 parts of this solution with 1 part of a saturated mercuric chloride solution in single-distilled water.\n\t\tCAUTION: This solution contains several toxic substances. Formalin is toxic by inhalation, in contact with skin, and if swallowed. Acetic acid is corrosive for mouth and intestinal tract after ingestion. Picric acid is allergenic and explosive when rapidly heated or by percussion. Mercuric chloride is highly corrosive to mucous membranes and nefrotoxic. Wear protective clothing and gloves for preparing Bouin-Hollande’s solution, and handle it in a well ventilated area remote from fire. An alternative fixation procedure is based on 4% formaldehyde in phosphate-buffered saline.",
    "Fix the individual cultures after several days or weeks of incubation as follows. First, transfer the cultures to Ringer’s salt solution for a few seconds to remove serum proteins. Next, immerse in Petri dishes with a diameter of 3 cm containing 3 ml Bouin-Hollande’s fixation solution for approximately 2 h.\nRinse the cultures three times in 3 ml demineralized water before incubating them in water for 2 h to remove as much fixation solution as possible. Finally, transfer to 3 ml of 70% (v/v) ethanol in water. Keep the cultures in this solution O/N, but this can be extended for a number of days.\nDehydrate by transferring sequentially through jars containing 100 ml of 96% (v/v) ethanol in water, 100% ethanol or 100% isopropanol, and 100% xylene for 2 hr each.\n\t\nTransfer each culture to a separate glass coverslip (with a minimal amount of xylene), place the coverslip on the bottom of a wine bottle capsule for paraffin embedding, and cover the fixed material with liquid paraffin wax at 56 °C. Incubate at 56 °C for 24 h, and then cool the embedded material to RT.\n\t\tCAUTION: As a benzene derivative xylene may be toxic after inhalation and should be handled in well ventilated areas only.\nRemove the wine bottle capsule and the coverslip, and cut out the paraffin block which contains the fixed culture.\nMake 8 µm thick paraffin sections of the entire confronting pair using a microtome14, and collect all sections on three alternating microscope glass slides that have been pretreated with tissue adhesive solution as a sticking agent. Avoid egg white as a sticking agent, because it may interfere with immunostaining.",
    "Note: Pretreatment of the microscope glass slides is done by delivering 1 small drop of tissue adhesive solution and 3 small drops of demineralized water with a Pasteur pipet, and mixing them to cover the slide.\nRemove the paraffin from the first slide by immersing twice in a jar containing 100 ml 100% xylene for 10 min.\nRehydrate the slides by immersion for 10 s in jars containing 100 ml of the following solutions: xylene/ethanol (1:1), 100% ethanol, 96% (v/v) ethanol in water, 70% (v/v) ethanol in water, and finally demineralized water.\nDissolve mercuric chloride crystals by immersion in a jar containing 100 ml of 0.5% (w/v) Iodine in 96% (v/v) ethanol in water for 2 min.\nClear the sections in a jar containing 100 ml of 5% (w/v) sodium thiosulfate in water for 10 sec. Then wash the slides thoroughly in distilled water.\nIncubate the slides in a jar containing 100 ml Harris’ hematoxylin for 2 min, submerge briefly in 0.1 M HCl, and then wash in running tap water for 10 min.\nIncubate in a jar containing 100 ml eosin 0.1% (w/v) in water for 1 min.\nDehydrate via brief submersion in jars containing 100 ml of the following series of solutions: demineralized water, 70% (v/v) ethanol, 96% (v/v) ethanol, 100% ethanol twice, xylene–ethanol (1:1), and finally in 100% xylene.\nMount the slides with mounting medium by delivering 2 separate drops of the medium on the slides, let these expand by putting a coverslip on top of them, and let it harden at RT for 24 h.\n4. Immunohistochemistry",
    "Prepare Tris-buffered saline (TBS). Dissolve 6.0 g of tris-(hydroxymethyl)-aminomethane (Tris base) and 45.0 g of NaCl in 4.5 L of demineralized water. Bring to pH 7.6 with 1 M HCl (about 42 ml). Add distilled water to make 5 L.\nPrepare Tris-HCl buffer. Dissolve 60 g of Tris base in 800 ml of demineralized water. Bring to pH 7.6 with 6 M HCl (about 65 ml). Add distilled water to make 1 L. Dilute 10x with distilled water before use.\nPrepare Tris-BSA 0.1% buffer. Dissolve 12.1 g of Tris base and 45.0 g of NaCl in 4.5 L of demineralized water. Bring to pH 8.2 with 1 M HCl (about 42 ml). Add 5.0 g of bovine serum albumin (BSA) and 6.5 g of NaN3. Add demineralized water to make 5 L.\n\tCAUTION: NaN3 is a highly toxic product. Contact with acids liberates very toxic gasses. Wear gloves and avoid ingestion by all means. NaN3 forms very sensitive explosive compounds with copper, lead and other metals. Flush sinks with copious amounts of water. An alternative preservative is 0.01% thiomersal.\nFollow items 3.2 to 3.10.\nDip the slides in TBS or Tris–0.1% BSA buffer, and wipe off excess fluid around the sections using a paper towel.\nApply 150 µl normal goat serum diluted 1:20 in TBS or in 5% (w/v) BSA in Tris–0.1% (w/v) BSA buffer for 30 min in a high-humidity chamber (a closed box for the co-incubation of the slides with an open water recipient ensuring high humidity inside). Then remove excess fluid with a paper towel.\nApply 150 µl primary antiserum diluted in Tris–0.1% (w/v) BSA supplemented with 1% (v/v) normal goat serum for at least 2 hr in a high-humidity chamber. Determine the optimal dilution of the primary antiserum empirically.",
    "Note: Immunohistochemistry can be used to detect chick heart antigens but, using specific antibodies, the technique described for chick heart antigens can be applied to other antigens (such as green fluorescent protein)15 as well.\nWash the slides twice in Tris–0.1% w/v BSA on a rocking table for 5–10 min.\nRemove excess fluid using a paper towel and apply 150 µl goat anti-rabbit antiserum in excess (e.g., 1:20 in TBS) for at least 1 hr in a high-humidity chamber.\nWash twice with TBS on a rocking table for 5–10 min.\nRemove excess fluid using a paper towel. Apply the peroxidase–anti-peroxidase complex diluted 1:250 in TBS supplemented with 1% (v/v) normal goat serum for at least 1 hr in a high humidity chamber. The dilution of the complex depends on the batch.\nWash the slides with TBS and transfer to Tris–HCl buffer pH 7.6.\nTransfer the slides into a Tris–HCl buffer containing 0.25 g/L of diaminobenzidine and 0.01% (v/v) H2O2 for a few minutes. Stop the incubation when the chick heart is stained. Check regularly under the microscope.\nTransfer the slides to Tris–HCl for 10 min and then to distilled water.\nFollow items 3.13 and 3.14.\n\tNote: For antigens that are easily destroyed during fixation, cryosectioning of the cultures can offer an alternative for immunohistochemical analysis. This is described in the following protocol steps:\nWash the living cultures with 3 ml of Ringer’s salt solution to remove serum proteins.\nAdd one drop of embedding medium to the precooled (−16 °C) specimen holder of a cryomicrotome. Transfer the cultured tissue from the edge of a glass coverslip to the top of this drop before it is completely frozen.\nCool the culture to −16 °C, cut 6 µm thick frozen sections, and collect them on gelatin-coated glass slides.",
    "Fix the slides in acetone at 4 °C for 10 min before storage at 4 °C.\nFollow items 4.5 to 4.15.\n5. Evaluation of the Assay Results\nNote: In the present assay, invasion is defined as the progressive occupation of the PHF by the confronting test cells. Microscopic analysis of all consecutive sections from a confronting culture allows the reconstruction of the interaction between the test cell aggregates and the PHFs in three dimensions.\nObserve the different patterns of interaction and grade according to the following scale (see Figure 5).\n\tGrade 0: Only PHF observed. No confronting cells can be observed.\n\tGrade I: The confronting test cells are attached to the PHF, but do not occupy the heart tissue, not even the outermost fibroblastic cell layers.\n\tGrade IIa: Occupation of the PHF is limited to the outer fibroblast-like and myoblast cell layers.\n\tGrade IIb: The PHF has surrounded the cell aggregates but there are no signs of occupation.\n\tGrade III: The confronting cells have occupied the PHF, but have left more than half of the original amount of heart tissue intact.\n\tGrade IV: The confronting cells have occupied more than half of the original volume of the PHF.\n\tNote: Grades I and II are observed with noninvasive cell populations, while grades III and IV are typical of invasion. To evaluate progression within different time frames, histological analysis should be applied to confronting cultures fixed after different incubation periods.\nimgsrc://cloudfront.jove.com/files/ftp_upload/52792/52792fig5.jpg\nFigure 5. Examples of interactions between confronting cancer cells and PHFs. Histological sections of confronting cultures stained either with hematoxylin-eosin (left panels) or immunohistochemically with an antibody against chick heart (right panels). Interaction grades are defined in the protocol text. (H: heart tissue, T: tumor cells). Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/52792/52792fig5large.jpg]",
    "6. Toxicity Assessment after Drug Treatments\nTransfer the confronting cultures in a minimal volume to 24-well tissue culture multidishes with a Pasteur pipet.\nWash the cultures by adding 500 µl of drug-free culture medium, and refresh after 6 hr.\nInspect all wells daily for cell outgrowth from the explants using an inverted microscope (objective lens 40X). Divide the number of outgrowing cultures by the total number of explanted cultures to obtain an index of survival of the confronting cultures. Compare the results of drug-treated cultures with solvent-treated ones.\n\tNote: The use of Ki67 immunohistochemistry (for cell proliferation) and of TUNEL assay (for apoptosis) are suggested as complementary techniques to the explant assay for assessing toxicity.\n7. Growth Assessment of Confronting Cultures\nMake black-and-white photographs of the cultures just before fixation, using a microscope equipped with a digital photocamera (objective lens 50X)\nMeasure in mm the larger ( a) and smaller ( b) diameter of the culture taking into account the magnification.\nCalculate the approximate volume ( V) in mm3 via the formula16\nV = 0.4 x a x b 2\nCalculate the growth of the culture by comparing this final volume with the combined volumes of PHF and cell aggregate at the start of the confrontation.\n\tNote: Because solitary PHFs tend to decrease their volume during culture, growth of the confronting pairs is dependent on the tumor cells.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}