{
  "id": 6510,
  "origin_website": "Bio",
  "title": "Immunoprecipitation and Sequencing of Acetylated RNA",
  "procedures": [
    "Notes: The acRIP-seq protocol starts with purified RNA. We used poly(A) RNA to specifically map acetylated regions in mRNA. However, this procedure can be extended to any RNA class of interest.  The steps described below are for one biological replicate. However, acRIP-seq should be performed in at least two biological replicates. A negative control consisting of ac4C-depleted RNA should be included. This can be accomplished by using poly(A) RNA from NAT10-/- cells (Arango et al., 2018).Poly(A) RNA purificationFor poly(A) RNA purification, we used two rounds of poly(A) selection using DynabeadsTM oligo(dT)25. Precautions should be taken to avoid ribonuclease contamination during the isolation procedure.Resuspend 1.8 mg of total RNA, obtained using the TRizol method (Rio et al., 2010), in 2.4 ml of Nuclease-free H2O at a concentration of 750 μg/ml. This amount of starting material is enough to obtain ~20 μg of poly(A) RNA. Resuspend the Dynabeads® Oligo (dT)25 and transfer 1.2 ml (6 mg) of beads to a 2.0 ml microcentrifuge tube.Magnetically separate the Dynabeads using a magnetic stand.Wash once with 1.2 ml poly(A) RNA washing buffer. Resuspend beads in 1.2 ml poly(A) RNA binding buffer.Pipette 600 μl of total RNA from Step A2 into a 1.5 ml microcentrifuge tube and heat at 75 °C for 2 min in a thermomixer set at 1,200 rpm.Immediately add the entire 600 μl of heated RNA to 1.2 ml beads from Step A6 to achieve a total volume of 1.8 ml.Mix thoroughly and anneal through continuous rotation for 5 min at room temperature.Magnetically separate the Dynabeads using a magnetic stand and carefully remove the supernatant.Remove the tube from the magnet and add 1.2 ml poly(A) RNA washing buffer. Repeat Steps A10-A11 for a total of three washes. Add 600 μl of 10 mM Tris-HCl [pH 7.",
    "5] and heat at 75 °C for 2 min in a thermomixer set at 1,200 rpm.Add 1.2 ml poly(A) RNA binding buffer.Mix thoroughly and anneal through continuous rotation for 5 min at room temperature.Magnetically separate the Dynabeads using a magnetic stand and carefully remove the supernatant.Remove the tube from the magnet and add 1.2 ml poly(A) RNA washing buffer. Repeat Steps A16-A17 for a total of three washes. Add 50 μl of 10 mM Tris-HCl [pH 7.5] and heat at 75 °C for 2 min in a thermomixer set at 1,200 rpm. Quickly place the tube in a magnetic stand and transfer the supernatant to a new 1.5 ml microcentrifuge tube. Add another 50 μl of 10 mM Tris-HCl [pH 7.5] to beads and heat at 75 °C for 2 min in a thermomixer set at 1,200 rpm.Quickly place the tube in a magnetic stand and transfer the supernatant to the same tube from Step A20. Repeat Steps A6 to A22 for a total of four times using the same set of beads. This procedure will process 2.4 ml of total RNA prepared in Step A2. After this step, the volume of poly(A) RNA will be 400 μl.Add 40 μl of 3 M sodium acetate, pH.5.5, 3 μl linear acrylamide, a coprecipitant to aid recovery of RNA during alcohol precipitation, and 1.1 ml of 100% ethanol. Incubate at -20 °C overnight.Centrifuge at 20,000 x g for 20 min at 4 °C in a microcentrifuge.Carefully remove supernatant.Wash pellet with 750 μl of 70% ethanol.Centrifuge at 20,000 x g for 5 min at 4 °C in a microcentrifuge.Carefully remove ethanol.Air dry pellet for 5 min at room temperature to remove residual ethanol.Resuspend in 50 μl Nuclease-free H2O.Evaluate poly(A) RNA quality using the Agilent RNA 6000 kit and Bioanalyzer (Figure 2A, top).",
    "Stopping point: Samples can be stored at -80 °C.RNA fragmentationTo narrow the mapping of acetylated regions, input poly(A) RNA is fragmented prior to immunoprecipitation. The optimal fragment size range of RNA is between 100-200 nucleotides. This range of RNA sizes is achieved by divalent metal cations such as Mg2+ or Zn2+ at high temperatures. Divalent cations attack the 2’ hydroxyl group of ribose ultimately cleaving the RNA strand with no sequence specificity (Shelton and Morrow, 1991; AbouHaidar and Ivanov, 1999).Mix 20 μg of poly(A) RNA in 180 μl of Nuclease-free H2O in a sterile PCR tube. This amount of poly(A) RNA will be split between IgG and anti-ac4C immunoprecipitations.Add 20 μl of 10x RNA Fragmentation Buffer from the NEBNext® Fragmentation Module.For better performance of the fragmentation reaction, divide the solution into four PCR tubes (50 μl each).Incubate at 94 °C for 5 min in a pre-heated thermal cycler with lid set at 105 °C.Immediately place PCR tubes on ice.Add 5 μl of 10x RNA Fragmentation Stop Solution from the NEBNext® Fragmentation Module to each PCR tube.Transfer the fragmentation RNA reactions into one 1.5 ml microcentrifuge tube and add the following components:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190618/20190618024708_3296.jpg*We recommend the use of linear acrylamide rather than other co-precipitants such as glycogen. We have observed that glycogen can bind non-specifically to anti-ac4C antibodies. Incubate at -20 °C overnight.Centrifuge at 20,000 x g for 20 min at 4 °C in a microcentrifuge.Carefully remove supernatant.Wash pellet with 750 μl of 70% ethanol.Centrifuge at 20,000 x g for 5 min at 4 °C in a microcentrifuge.Carefully remove ethanol.Air dry pellet for 5 min at room temperature to remove residual ethanol.Resuspend in 50 μl Nuclease-free H2O.Evaluate fragmentation efficiency and concentration using the Agilent RNA 6000 kit and Bioanalyzer (Figure 2A, bottom).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190618/20190618024818_1277.jpgFigure 2. Bioanalyzer profiles. A.",
    "Representative profiles of unfragmented (top) and fragmented (bottom) poly(A) RNA. B. Representative profiles of RNA isolated from immunoprecipitation with IgG control (top) or anti-ac4C antibodies (bottom). C. Representative profiles of DNA libraries from Input (top), IgG (middle) or acRIP (bottom).In vitro transcription of acetylated RNATo evaluate acRIP efficiencies between different conditions, an in vitro transcribed acetylated mRNA is spiked into input RNA prior to immunoprecipitation. In vitro transcription is performed using the MAXIscript T7 Transcription Kit. We use a 177 nt probe derived from the mouse β-globin gene with a nucleotide length within the range of poly(A) RNA after fragmentation (100-200 nt). The instructions described below are for the 177 nt probe derived from the mouse β-globin gene. However, any DNA sequence can be used for the same purpose. The sequence of probe: Probe can be purchased as Ultramer from Integrated DNA Technologies (IDT)TAATACGACTCACTATAGGGGAGGAAGTAGTGAAGAGTGTTAGAGGATGCTTGTCATCACCGAAGCCTGATTCCGTAGAGCCA CACCCTGGTAAGGGCCAATCTGCTCACACAGGATAGAGAGGGCAGGAGCCAGGGCAGAGCATATAAGGTGAGGTAGGATCAGTTGGATGTGGGAGTTGTAAGGTAGAATGTGGrey: T7 promoterRed: cytidinesMix the following components:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190618/20190618024905_6254.jpg*ac4CTP can be purchased from Trilink.Incubate at 37 °C for 1 h.Add 1 μl of DNase I (provided in the MAXIscript T7 Transcription Kit, see Materials and Reagents) and incubate at 37 °C for 20 min. Add 44 μl of Agencourt RNAclean XP beads and mix well.Incubate for 10 min at room temperature.Spin and place the tube on a magnetic rack for 5 min. Discard the supernatant.Wash twice each with 200 μl of freshly prepared 80% ethanol while the tubes are on the magnetic rack.Briefly spin the tube, and replace in the magnetic rack.Completely remove the residual ethanol, and air dry beads for 5 min while the tube is on the magnetic rack with the lid open.Elute RNA with 21 μl Nuclease-free H2O. Mix well by pipetting up and down, incubate for 2 min at room temperature. Put the tube in the magnetic rack until the solution is clear.",
    "Without disturbing the bead pellet, transfer 21 μl of the supernatant to a clean PCR tube.Assess the quality of the RNA fragment in a denaturing agarose gel.Measure concentration using the Nanodrop.Mix 16.2 μg fragmented poly(A) RNA from Step B15 with 16.2 pg of In vitro transcribed acetylated RNA from Step C13.Save 200 ng (~1.2%) of material from Step C14 as Input. Coupling antibodies to protein G DynabeadsacRIP is achieved with a rabbit monoclonal antibody against ac4C (Sinclair et al., 2017) and isotypic rabbit monoclonal IgG as control.Magnetically separate 20 μl (10 μl for IgG and 10 μl for acRIP) of Protein G-Magnetic Dynabeads using a magnetic stand.Wash twice with 200 μl 1x acRIP Buffer each.Resuspend Dynabeads in 200 μl 1x acRIP Buffer.Divide Dynabeads into two sterile 1.5 ml microcentrifuge tubes:Tube 1: rabbit monoclonal IgG; 100 μl of bead solution.Tube 2: rabbit monoclonal anti-ac4C antibody; 100 μl bead solution.Add 1 μg of monoclonal IgG to Tube 1. Add 1 μg of rabbit monoclonal anti-ac4C antibody to Tube 2.Incubate for 1 h at room temperature in a rotator.Magnetically separate the Dynabeads using a magnetic stand.Wash twice with 200 μl 1x acRIP Buffer.Resuspend Dynabeads in 200 μl 1x acRIP Buffer.RNA ImmunoprecipitationMix the following components:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190618/20190618024955_1005.jpgMagnetically separate Dynabeads from Step D9, discard the supernatant and add 100 μl of RNA solution from Step E1 into each tube.Incubate at 4 °C for 4 h in a rotator.Magnetically separate Dynabeads using a magnetic stand.Collect supernatants in a sterile microcentrifuge tube and save at -80 °C (optional).Add 500 μl of cold 1x acRIP buffer. Quickly flick tubes to resuspend beads.Magnetically separate Dynabeads on ice using a magnetic stand and discard the supernatant.Repeat Steps E6-E7 for a total of three washes.After last wash, resuspend Dynabeads in 100 μl 1x proteinase K buffer.",
    "Incubate at 37 °C for 30 min in a Thermomixer. Shake at 1,200 rpm.Separate magnetic Dynabeads and transfer the supernatant to a sterile 1.5 ml microcentrifuge tube.Add 300 μl of Nuclease-free H2O to Dynabeads. Flick tubes to resuspend beads.Magnetically separate Dynabeads and collect supernatant into the same microcentrifuge tube from Step E11.Add 400 μl Acid-Phenol:Chloroform, pH 4.5. Vortex.Centrifuge at 20,000 x g at 4 °C for 15 min in a microcentrifuge.Transfer the upper clear layer to a new 1.5 ml microcentrifuge tube.Add 400 μl chloroform.Centrifuge at 20,000 x g for 1 min.Transfer the upper layer to a new 1.5 ml microcentrifuge tube.Add the following components:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190618/20190618025033_4890.jpgIncubate at -20 °C overnight.Centrifuge at 20,000 x g for 20 min at 4 °C in a microcentrifuge.Carefully remove supernatant.Wash pellet with 750 μl of 70% ethanol.Centrifuge at 20,000 x g for 5 min at 4 °C in a microcentrifuge.Carefully remove ethanol.Air dry pellet for 5 min at room temperature to remove residual ethanol.Resuspend in 6 μl Nuclease-free H2O.Evaluate concentration using the Agilent RNA 6000 kit and Bioanalyzer (Figure 2). At least 1 ng of precipitated RNA should be obtained and used in library preparation.Stopping point: Samples can be stored at -80 °C.Library preparationLibraries are constructed using the NEBNext® UltraTM II Directional RNA Library Prep Kit for Illumina® and following the manufacturer’s suggestions (Figure 1C). All reagents are supplied with the kit.Samples:Input: Step C15IgG: Step E28acRIP: Step E28First strand cDNA synthesisSet up the following priming reaction in PCR tubes and mix by gentle pipetting. Use equivalent amounts of RNA (~1 ng) for all samples:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190618/20190618025118_3613.jpgIncubate the samples in a thermal cycler as follows:5 min at 65 °C, with heated lid set at 105 °C.Hold at 4 °C.To the RNA from Step F2b (6 μl) add the following components and mix by gentle pipetting:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190618/20190618025151_5887.",
    "jpgIncubate samples in a preheated thermal cycler (with the heated lid set at 105 °C) as follows: 10 min at 25 °C15 min at 42 °C15 min at 70 °CHold at 4 °C.Second strand cDNA synthesisTo the tubes from Step F2d (20 μl) add the following components and mix by gentle pipetting:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190618/20190618025236_5033.jpgIncubate samples in a thermal cycler (with the heated lid set at 37 °C) for 60 min at 16 °C.Add 144 μl (1.8x) of resuspended AMPure XP Beads to samples from Step F3b.Incubate for 5 min at room temperature.Spin, place the tube on the magnetic stand for 5 min. Carefully remove and discard the supernatant.Wash twice each with 200 μl of freshly prepared 80% ethanol while the tubes are on the magnetic rack.Air dry the beads for 5 min while the tube is on the magnetic rack with lid open. Elute into 53 μl 0.1x TE buffer. Mix well by pipetting up and down and incubate for 2 min at room temperature.Place the tube in the magnetic rack until the solution is clear.Remove 50 μl of the supernatant and transfer to a clean nuclease free PCR tube.Perform end prep of cDNA libraryMix the following components in a PCR tube:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190618/20190618025320_8443.jpgMix well by pipetting up and down at least 10 times.Incubate samples in a thermal cycler (with the heated lid set at 75 °C) as follows:30 min at 20 °C30 min at 65 °CHold at 4 °C.Adaptor ligationDilute the NEBNext Adaptor for Illumina 30-fold with Adapter Dilution Buffer prior to use.Add the following components directly to the End Prep Reaction. Caution: Do not pre-mix the components to prevent adaptor-dimer formation.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190618/20190618025358_5652.jpg*The NEBNext adaptor is provided in the NEBNext® Multiplex Oligos for Illumina®.Mix well by pipetting up and down at least 10 times.",
    "Incubate the sample in a thermal cycler (with the heated lid set at 75 °C) for 15 min at 20 °C.Add 3 μl of USER (uracil-specific excision reagent) Enzyme to the ligation mixture resulting in a total volume of 96.5 μl. USER enzyme is provided in the NEBNext® UltraTM II Directional RNA Library Prep Kit. Mix well and incubate at 37 °C for 15 min with the heated lid set to ≥ 45 °C.Add 96.5 μl (1x) resuspended AMPure XP Beads and mix well. Incubate for 10 min at room temperature.Quickly spin, place on a magnetic rack for 5 min. Discard the supernatant.Wash twice with 200 μl of freshly prepared 80% ethanol while the tubes are on the magnetic rack.Briefly spin the tube, and put the tube back in the magnetic rack.Completely remove the residual ethanol, and air dry beads for 5 min while the tube is on the magnetic rack with the lid open.Elute DNA with 16 μl 0.1x TE buffer. Mix well, incubate for 2 min at room temperature. Put the tube in the magnetic rack until the solution is clear.Without disturbing the bead pellet, transfer 15 μl of the supernatant to a clean PCR tube.PCR Enrichment of Adaptor Ligated DNAMix the following components:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190618/20190618025450_5790.jpg*The Universal PCR Primer and index primers for Illumina are provided in the NEBNext® Multiplex Oligos for Illumina®. Use a different index primer for each sample.PCR Cycling Conditions:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190618/20190618025531_9852.jpgAdd 50 μl (1x) resuspended AMPure XP Beads and mix well.Incubate for 5 min at room temperature.Spin and place the tube on a magnetic rack for 5 min. Discard the supernatant.Wash twice each with 200 μl of freshly prepared 80% ethanol while the tubes are on the magnetic rack.Briefly spin the tube, and put the tube back in the magnetic rack.",
    "Completely remove the residual ethanol, and air dry beads for 5 min while the tube is on the magnetic rack with the lid open.Elute DNA with 23 μl of 10 mM Tris-HCl. Mix well by pipetting up and down, incubate for 2 min at room temperature. Put the tube in the magnetic rack until the solution is clear.Without disturbing the bead pellet, transfer 21 μl of the supernatant to a clean PCR tube.Assess library quality on an Agilent Bioanalyzer DNA Chip (Figure 2).Sequence using an Illumina sequencer in paired-end mode read length 125 bp (2 x 125 bp)."
  ],
  "subjectAreas": [
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}