{
  "id": 4129,
  "origin_website": "Cell",
  "title": "Measuring CPT-1-mediated respiration in permeabilized cells and isolated mitochondria",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPrepare injectates, load and calibrate cartridge\nTiming: 45 min–1 h\nThis section covers the preparation of injectates and setup of the Seahorse XF assay. If unfamiliar with the Seahorse XF Assay, the researcher is encouraged to familiarize themselves with the basic setup of the instrument and assay (Gotoh et al., 2021[href=https://www.wicell.org#bib8]; Gu et al., 2021[href=https://www.wicell.org#bib9]; Pelletier et al., 2014[href=https://www.wicell.org#bib12]). This process is shared between both the permeabilized cell and isolated mitochondria assays.\nWarm 1× MAS medium in a 37°C water bath.\nPrepare injectates as shown below, adding stock concentrations of mitochondrial effectors [all made in 95% (v/v) EtOH] to plain 1× MAS medium without BSA. Vortex to mix.\nNo substrates are added to the injectate medium because most assays will involve testing the effects from multiple substrates, and thus 1× MAS is a shared, ‘base’ medium compatible with all conditions. BSA is omitted to avoid potential injection failures from increased medium viscosity.\nSample calculations are presented for one assay plate:\ntable:files/protocols_protocol_894_8.csv\nPipette 25 μL of each injectate solution into the corresponding port(s), using a multichannel pipette with the manufacturer-provided loading guides if desired.\nTake care to pipet gently but confidently. Avoid too much force so injectates do not escape through the port aperture, but ensure the liquid makes a full seal covering the opening of the port.\nThe user should familiarize themselves with the dilutions and concentrations required for sequential injections during an XF assay (Pelletier et al., 2014[href=https://www.wicell.org#bib12]). This assay will be run with an initial volume of 150 μL and sequential 25 μL injections.",
    "Note: In assays where all four ports are available for mitochondrial effects (i.e. no acute injection of test compounds), we suggest FCCP be injected twice to best measure maximal respiration. The concentration of FCCP required to achieve maximal respiration may change between measurement groups (e.g. pyruvate/malate vs. succinate/rotenone, WT vs. KO, etc.).\nWarm the utility plate and cartridge in a non-CO2, 37°C benchtop incubator. While the cartridge is warming, design the plate map and protocol on the Seahorse controller’s Wave application or load a previously made template.\nGroup Definitions: Define the injections, pre-treatments, assay medium, and cell/mitochondria types.\nPlate Map: Label each well with the respective conditions, ensuring to also define the background wells. When plating medium or saline is used in the outer wells during the cell culture (Before you begin: step 3), these wells should be used as background.\nProtocol: For permeabilized cells, we suggest a Mix/Wait/Measure (in min:s) cycle of 1:30 Mix/0:00 Wait/2:30 Measure. For isolated mitochondria, we suggest a cycle of 1:30 Mix/0:00 Wait/2:00 Measure. The reduced times [relative to those suggested for intact cells (Pelletier et al., 2014[href=https://www.wicell.org#bib12])] presented here are to (i) prevent permeabilized cells from detaching off of the measurement plate over the course of a long assay, and (ii) prevent anoxia in the measurement chamber from depletion of oxygen, particularly with isolated mitochondria.\nSave the template if desired and click “Run Assay” to load the cartridge in the instrument for calibration.\nNote: It is acceptable to uncheck the “Equilibrate” button, eliminating the Mix/Wait cycle used to ensure the plate is at 37°C. In this case, increase the number of initial measurements (e.g., from three to six) to provide ample time for the plate to warm while also obtaining these measurements.",
    "When the instrument opens, REMOVE THE LID from the cartridge and place the cartridge and utility plate in the thermal tray with the letters right-side up, aligned on the left of the plate. Start calibration.\nFailure to remove the lid can result in major damage to the instrument.\nSeahorse-XF96 assay\nTiming: 1.5–2 h\nThis section details the preparation of both permeabilized cells as well as isolated mitochondria for the Seahorse XF Assay. The assay preparations are slightly different but share the same principles. Stocks of reagents and mitochondrial effectors should be made well in advance of the assay. Single-use aliquots can be stored at −20°C and used for several months. All reagents should be prepared in tissue culture-grade H2O and used at pH 7.2, adjusted using KOH. Steps 6–10 are given in reference to permeabilized cells, and steps 11–16 for isolated mitochondria. Stocks for substrates, co-substrates, and additives for the experiments are shared between the two methods [apart from the recombinant perfringolysin O (rPFO)], and are presented here:\ntable:files/protocols_protocol_894_9.csv\nNote: The free calcium concentration with 700 μM CaCl2 added to 1 mM EGTA in MAS buffer (pH 7.2, 37°C, 330mOsm/L) is estimated to be 680 nM (Schoenmakers et al., 1992[href=https://www.wicell.org#bib13]).\nCritical: It is recommended that ascorbate and TMPD solutions be freshly made on the day of the assay. If stored, keep TMPD solutions shielded from light.\nPermeabilized cells\nPrepare the assay medium. For permeabilized cells, this almost always includes 1× MAS supplemented with ADP, BSA, permeabilization reagent (rPFO in this protocol), and the appropriate oxidizable substrates. Budget 1 mL of assay medium for every 5 experimental wells.\nFor example, if 10 wells are being used for one experimental group, prepare 2 mL of assay medium for this group to account for dead volume in the pipette or spills.",
    "If testing the acute effects of pharmacologic compounds, BSA will likely bind hydrophobic compounds and affect the free concentration. BSA can be reduced, or removed, accordingly.\nWash the Seahorse XF cell plate with unsupplemented 1× MAS medium. To do so, remove the remaining medium from the inner 60 wells with a multichannel pipette or gentle aspiration, keeping a small meniscus to not leave cells completely dry (i.e., remove 80 μL from the well to leave roughly 20 μL if cells were previously plated in 100 μL). Then add 130 μL of 1× MAS medium. Repeat this process of removing all but about 20 μL of medium and replacing with 130 μL two more times.\nIt is essential to avoid touching the bottom of the well with the pipet tips or aspirating the cells with too much force, as this will disrupt the cell monolayer. Given the unique geometry of the Seahorse XF plate wells, it is advised to practice with a blank plate ahead of time to get a feel for the process.\nUse an aspirator or multichannel pipette to completely remove the medium from background wells around the rim and replace with 150 μL of unsupplemented MAS.\nFor the final wash and addition of assay medium, remove all but about 20 μL of medium from the plate (including background wells). Add 130 μL of assay medium with substrates (e.g., pyruvate with malate) to the desired groups and the background wells.\nIt is important to add assay medium to the background wells during the assay (as opposed to plain MAS) to help with troubleshooting assays. Reasons for this include having the ability to check whether compounds were pH’d appropriately and whether uncharacterized compounds could interfere with the fluorometric measurement probes.",
    "Warm the plate in a benchtop, non-CO2 incubator set to 37°C for 5 min. When the calibration of the XF cartridge has finished, replace the ejected utility plate with the cell plate (AFTER REMOVING THE LID) and continue the run.\nFailure to remove the plate lid can result in major damage to the instrument. Do not leave the instrument until verifying that it is running properly.\nProvided the measurements used for analysis are conducted at 37°C, we suggest a shorter warming period for permeabilized cell assays than that which is suggested for intact cells for two reasons:\nA shorter incubation time prevents permeabilized cells from detaching from the measurement plate over the course of a long assay.\nSince glycolysis is non-functional in a permeabilized cell, ECAR is usually not measured and largely used only for troubleshooting (i.e., ensuring medium alkalinization during ATP synthesis, etc.). As such, there is much less need to worry about the CO2 stored in the plastic assay plate during cell culture affecting the pH measurements, obviating this long incubation period mostly used to ‘de-gas’ the plate.\nIsolated mitochondria\nPrepare the assay medium. For isolated mitochondria, this almost always includes 1× MAS supplemented with ADP, BSA, and the appropriate oxidizable substrates. Budget for 1 mL of assay medium for every 5 experimental wells.\nFor example, if 10 wells are being used for one experimental group, prepare 2 mL of assay medium for this group to account for dead volume in the pipette or accidents.\nAdditionally, for each plate, prepare 3 mL of MAS supplemented with ADP and BSA and chill on ice. This will be used in step 12.",
    "Place a Seahorse XF plate on ice as well as a basin to be used later. Dilute mitochondria to the appropriate concentration per well using the 3 mL of medium set aside in step 11.\nFor example, if the mitochondrial stock is 60 mg/mL of mitochondrial protein, then adding 7.5 μL of the mitochondrial stock to 3 mL of medium will result in a final concentration of 0.15 mg/mL. 20 μL of this solution added per well will yield 3 μg/well.\nThe amount of mitochondria required per well will depend on several factors such as the tissue of isolation, the substrate offered, and the method used to determine the protein concentration. The protein concentration should be optimized to give a robust signal without depleting the oxygen during the measurement period. In our experience with mouse liver mitochondria using the BCA protein assay, the following concentrations are used: 3 μg/well with complex I-linked substrates; 1.5 μg/well with succinate/rotenone; and 0.75 μg/well with ascorbate/TMPD.\nGently mix the diluted mitochondrial solution by pipetting up and down with a serological pipet (do not vortex). Empty contents of the tube into the chilled basin (on ice) and plate into the chilled Seahorse plate (on ice). Use a multichannel pipette to plate 20 μL of the mitochondrial solution into each well. Leave at least four wells (usually the corner wells) to be used as background wells, and fill these with 20 μL of plain medium.\nCentrifuge the plate in a swinging bucket rotor centrifuge for 20 min at 2000 g. Adjust the settings of the instrument such that there is no acceleration or brake.\nThe brake can be set at “1 of 10” on certain instruments provided it is sufficiently slow to not disturb the mitochondrial layer.",
    "When finished, return the plate to ice and add 130 μL of assay medium with substrates to the desired groups and the background wells.\nIt is important to add assay medium to the background wells (as opposed to plain MAS) to help with troubleshooting assays. Reasons include having the ability to check whether compounds were pH’d appropriately and whether uncharacterized compounds could interfere with the fluorometric measurement probes.\nWarm the plate in a benchtop, non-CO2 incubator set to 37°C for 5 min. When calibration has finished, replace the ejected utility plate with the cell plate (AFTER REMOVING THE LID) and continue the run.\nFailure to remove the plate lid can result in major damage to the instrument. Do not leave the instrument until verifying that it is running properly.\nNormalization\nTiming: 2–2.5 h\nPermeabilized cells\nThis section covers the fixing, staining, and counting of cell nuclei in the permeabilized cell assay. No post hoc normalization is required for experiments with isolated mitochondria, as this data is normalized to the amount loaded in the plate (e.g., pmol O2/min/μg mitochondrial protein)\nOnce the permeabilized cell run has completed, eject the plate and remove 175 μL of medium from inner 60 wells using a multichannel pipette. In a chemical fume hood, add 25 μL of 16% (v/v) paraformaldehyde, followed by 100 μL PBS for a final volume of 200 μL. Let the plate rest for at least 30 min.\nIt is essential to avoid touching the bottom of the well with the pipet tips or aspirating the cells with too much force, as this will disrupt the cell monolayer.\nAfter this step, the edges of the plate can be sealed with parafilm and stored at 4°C for several days until further use.",
    "When ready to stain, make 7 mL of 20 μg/μL of Hoechst 33342 (e.g., dilute 14 μL of a 10 mg/mL stock solution into 7 mL) in PBS per plate. Mix the solution.\nRemove 100 μL of medium from the inner wells and add 100 μL of stain to each well for a final concentration of 10 μg/μL Hoescht in 2% (w/v) paraformaldehyde. Wrap the plate in aluminum foil and let sit for at least 30 min at 21°C or for 8–48 h (usually overnight) at 4°C.\nUsing a high content imaging system (e.g., the Perkin Elmer Operetta), count the number of nuclei per plate to normalize the data to cell number as in Figure 2[href=https://www.wicell.org#fig2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/894-Fig2.jpg\nFigure 2. Example of automated cell counts\nSample cell counts of HepG2 cells using the Perkin-Elmer Operetta plated at 2.5 × 104 cells/well in Seahorse XF96 plates two days prior to the assay.\n(A) Computer-generated, full-well image of cell counts comprising the 31 fields imaged at 20× magnification to reconstitute the full plate.\n(B) Representative section showing identification of individual cells (nuclei outlined in various colors).\nThe three risers in the Seahorse XF well should be blacked out to avoid complications with automated cell counting. As shown in Figure 2[href=https://www.wicell.org#fig2]A, the XF well is divided into 31 sections, three of which contain the circular risers and are thus excluded.\nNormalize oxygen consumption rates from the permeabilized Seahorse XF data to pmol O2/min/1 × 103 cells. This can be done either in the Seahorse XF Wave software using the normalization tab, or in spreadsheet software (e.g., Excel) after the assay is completed (Gotoh et al., 2021[href=https://www.wicell.org#bib8]; Gu et al., 2021[href=https://www.wicell.org#bib9])\nFor isolated mitochondria, the data is generally presented as pmol O2/min/μg mitochondrial protein."
  ],
  "subjectAreas": [
    "Metabolism",
    "Cell-Based Assays",
    "Cell Separation/Fractionation"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}