{
  "id": 9676,
  "origin_website": "Jove",
  "title": "Examining Local Network Processing using Multi-contact Laminar Electrode Recording",
  "procedures": [
    "1. NAN microdrive construction\nWe use the U-Probe in combination with the NAN electrode drive system. Building this system requires 2-3 hours but once constructed it is very simple to modify. We begin by assembling the NAN tower, which includes a 4-channel base (Figure 2a), the NAN chamber (Figure 2b), the grid with 1 mm spacing (Figure 2c), 1-4 screw microdrives (Figure 2d), 1-4 guide tubes (Figure 2e, 500 μm diameter and cut to about 5-7 cm), and 1-4 microdrive towers (Figure 2f). For simplicity, we will describe the procedure for building the NAN system with one tower and one U-Probe. After some training, this procedure typically takes 2-3 hours if all materials are available.\nTo construct the NAN electrode drive assembly, first measure assembly all the tools and pieces you will need (e.g. guide tubes, guide wire, complete dremil set, NAN tools and parts and the U-probe).  Measure the guide tubes so when attached to the recording device they are long enough to rest on top of the dura without damaging it.\nTo construct the NAN electrode drive assembly, first measure the depth of the recording chamber.  Then, cut the guide tubes with the measured length of about 5-7 cm.  While cutting the guide tubes, one needs to ensure that no metal fragments enter inside the tube.  Use a stiff wire smaller than the inside diameter of the guide tube to remove any metal fragments inside the tube.\nNext, place the NAN grid into the NAN base.  Tighten the clamp screw and grid screw.  Once the base and grid are secured, identify the recording region of interest and advance the guide tube through the bottom of the NAN grid.",
    "Pass the guide tube through the grid until it is about 1-2 mm outside the NAN chamber.  Once the guide tube is at the desired position, begin assembling the NAN microdrive tower.\nOn each NAN microdrive tower there are two clamps – a motor drives the top clamp, while the bottom clamp can be either fixed in place or loose.  Attach the top clamp to the reinforcement tube of the U-Probe. Attach the bottom clamp to the guide tube and apply a small amount of superglue to secure the guide tube in place. This system is both more stable and more precise due to the two clamps that are attached to the reinforcement tube of the U-Probe.\nCarefully align the tip of the U-Probe with the top of the guide tube and pass the U-Probe through the guide tube until you can secure the tower to the NAN base. Adjust the tower position with the thumbscrew so that there is no added tension on the U-Probe or guide tube.\n2. U-Probe sterilization\nThe laminar electrode or Plextrode U-Probe is purchased from Plexon Inc. and is available at a price of about $2000-$4000. The price depends on three main aspects: the number of contact sites, the configuration of sites, and the diameter of each site. We are currently using the 16-channel version with a linear configuration and a contact diameter of 25 μm. Importantly, the thickness of the U-Probe is directly related to the contact diameter. In our experiments, we have always used 25 μm diameter contacts, which is equal to a 360 μm thickness. The current cost for our version model is approximately $3500 dollars.  The U-Probe comes packed in an electrode case with jumpers and grounding wire and the lead-time from purchase to delivery is approximately 4-6 weeks.",
    "Place the NAN system on the cylinder base and connect the motor cables to the corresponding towers. If using multiple towers color-coded zip ties are used to help distinguish between motor cables and towers.\nUsing the NAN software program, begin advancing the U-Probe, either set a target position that automatically advances the U-Probe to that location or by clicking 'Down' on the NAN software interface.  Advance the U-Probe so that at minimum 10 mm of the tip is through the guide tube past the end of the NAN chamber.\nTo sterilize the U-Probe, place in MetriCide Activated Dialdehyde solution for 20-30 minutes prior to attaching the NAN base to the implanted recording chamber.  After that, rinse the U-Probe and NAN base with sterile water.\nZero the NAN software locations by retracting the U-Probe so that the tip is just inside the guide tube.  In the NAN software, click zero all positions. \nAttach the NAN base to the implanted recording chamber and tighten all four screws.  Then, align the base according to a pin that is on the side of the recording chamber.  Tighten all four screws and make sure that the NAN base is securely attached to the recording chamber.\n3. Advancing the U-Probe for recording",
    "Given that strength and thickness of dura is highly variable between subjects, we have implemented a general procedure for advancing the U-Probe using the NAN microdrive system. Importantly, each U-Probe comes with a detailed analysis of the each contacts impedance and the overall ranger for the U-Probe. We used electrodes whose contacts impedances ranged from 0.3-0.5 MΩ. Currently there is an impedance tester available for purchase from Plexon but unfortunately, at the time of our recordings this device was not available. As a result, we have been unable to perform a detailed analysis of the impedance.\nThe U-Probe is left floating (has one wire-attached jumper on the bottom connectors). Headstages are secured to the U-Probe connector and the amplifier cables are connected and grounded.\nThe initial advancement of about 1-2 mm should be both fast and strong.  Set the velocity parameter in the range of 0.1 - 0.2 mm/sec and the depth step to 0.2 - 0.3 mm.  These values will ensure that the U-Probe is able to puncture the dura cleanly and is an important first step in the recording. \nOnce through the dura, reduce the velocity to 0.050 -0.1 mm/sec and reduce the depth step to 0.05 - 0.1 mm.  The goal is to advance the U-Probe as smooth and slow as possible such that no tissue is damaged.  One of the indications that the probe has entered the brain is a change in the amplitude of the LFP accompanied by a reduction in the noise level (Text Overlay:  local field potential).\nTo verify that the electrode is spanning all cortical layers, measure the change in amplitude in response to the full-field white flash stimulus.  The changes in the LFP amplitude across time underlie the evoked response potential analysis.  This analysis provides the basis for identifying cortical layers.",
    "4. Identification and verification of cortical layers\nWe have implemented a procedure for identify cortical layers using an evoked response potential (ERP) paradigm and current-source density (CSD) analysis. We relied on the CSD because it provides an index of the location, direction, and density of transmembrane current flow, allowing us to accurately position electrodes to record from all layers in a single penetration. Indeed, Charles Schroeder and colleagues have previously combined laminar recording, microlesion, and histological reconstruction to validate the effectiveness of the ERP/CSD method in the functional identification of cortical layers in V19-12. Other methods using the spontaneously generated oscillations have been used to identify cortical depth such as cortical spindles and up/down states13-15.\nFor this analysis, we utilize the iCSD toolbox for MATLAB, which computes the CSD according to the 2nd spatial derivative of the LFP time-series across the equally-spaced contacts of the U-Probe (http://software.incf.org/software/csdplotter/home[href=http://software.incf.org/software/csdplotter/home])9,10,16,17.\nTo identify the cortical layers, measure the evoked response potential during a passive fixation task while exposing the subject to a full-field black screen that flashes white for 100 ms, and then returns to black. This sequence constitutes 1 trial which is repeated 200 times.\nThe Plexon Multichannel Acquisition Processor saves all the continuous data signals directly to the recording computer through a National Instruments PCI board. After the data is saved, begin processing the signals for current-source density analysis.\nUse the software correction FPAlign provided by Plexon to correct the time delays in the LFP signals induced by the filters in the headstages and the pre-amplification boards.",
    "At this point data is transferred to MATLAB with Neuroexplorer. Each LFP channel is filtered using standard high and low pass filters with cutoff frequencies of 0.5 Hz and 100 Hz.  After each electrode contact has been filtered, identify each trial and average across trials to obtain the mean LFP time-series for each electrode contact.  Then, organize each contact into a matrix with LFP amplitude as a function of time.\nRun the iCSD (Text Overlay:  current-source density) toolbox in MATLAB by typing CSDplotter in the workspace. Given that the sampling frequency the continuous data is 1 kHz, set the dt parameter to 1 ms.  Next, set the cortical conductivity value to 0.4 S/m (this approximates the current source density in units of nanoamperes per cubic millimeter) and change the electrode's position as a vector of [0.1:0.1:1.6] to reflect the number of contacts.  When all the parameters have been inserted click 'Run This'.\nView the CSD profile in the CSDplotter interface and paste it to a new figure. Common functions in MATLAB such as imagesc can be used to plot the layer profile, and various smoothing algorithms and normalization routines can be applied for representing the CSD data and comparing the layer identification across hours and sessions.\nTo identify the polarity inversion accompanied by the sink-source configuration at the base of layer 4, first, verify the presence of a primary sink in the granular layer using the laminar CSD profile.  Locate the sink driven negative polarity in the CSD plot.  Then, compute the center-of-mass of the granular sink.",
    "A centroid is obtained from the analysis consisting of the contact number and time when the sink was largest.  The contact with the sink centroid serves as the granular layer reference at 0 μm.  Analyze all the contacts above and below the reference and group them into one of three possible layers: supragranular, granular, and infragranular.\nValidate the granular sink by shuffling the electrode positions leaving the temporal domain unchanged.  After shuffling the CSD matrix, compute the centroid analysis again. Shuffling electrode contacts as a function of cortical depth should destroy any laminar specificity. \n5. Identification of individual neurons and receptive field mapping\nWe have had great success with isolating and recording multiple single units from the U-Probe. On a typically recording, we can expect to have 6-10 well-isolated units and 14-16 local field potential signals. Finding single units is also more reliable with the U-Probe compared to single electrodes. Even if one were to use all the necessary hardware to precisely advance 16 electrodes, they would not be able to explore network populations as a function of cortical layers as precisely as with the U-Probe. Finally, we typically can record with the same U-Probe for 30-40 penetrations.\nTo find receptive fields, begin by presenting a reverse correlation stimulus on the monitor where receptive fields are potentially located.  The stimulus is comprised of four orientation gratings at 0, 45, 90, and 135 degrees. \nPerform cluster analysis of the firing rate maps to locate the receptive field.  First, calculate maximum firing rate locations and their centroid for each time delay.  Then, calculate the distances between the centroid and these maximum firing rate locations. Compute maps of firing rates at each spatial location for conduction delays between 40 – 120 ms at 5 ms intervals for each neuron independently.",
    "Find the total distance between the centroid and the surrounding maximum firing rate points at all-time delays.  The receptive field is at the time delay that minimizes that distance.\nOnce a receptive field is found for each cell, present a reverse correlation stimulus larger than all the receptive field locations overlapping all receptive fields in the recorded population.  A real-time firing rate plot can be used to determine whether the correct receptive field locations have been identified.\nLastly, remove single units which abruptly change their responses and only keep units with stable firing rates for further analysis.  In addition, select recording sites with the best signal-to-noise ratio.\n6. Representative Results: Recordings of single units and LFPs across cortical layers from primary visual cortex",
    "One of the most important steps in the analysis using the laminar electrodes is to reliably identify cortical layers and verify this identification across many hours and sessions. Thus, we measured the evoked response potentials (ERPs) of LFPs across laminar contacts in response to a full-field flashed stimulus (Figure 3a). Figure 3b provides an example of the type of information one needs to obtain in order to compute the current-source density (CSD) to identify the cortical layers. We then employed the CSD analysis of the LFP time-series to identify the polarity inversion accompanied by the sink-source configuration at the base of layer 4. Figure 4a illustrates the CSD analysis in localizing cortical layers across cortical depth as a function of time – the position of supragranular (SG), granular (G) and infragranular (IG) layers remained stable even four hours after the recording session began. Figure 4b contains CSD traces that represent the average of those contacts assigned to a given layer – in this example, the granular layer undergoes a clear decrease in CSD amplitude at ~ 50 ms. This analysis served as a reference to assign electrode contacts above and below the granular layer to supragranular and infragranular layers, respectively (the contact with the largest sink center-of-mass served as the granular layer reference at 0 μm).",
    "Another critical analysis using the laminar electrode is to accurately identify and localize the neurons' receptive field. This procedure is vital for positioning the stimulus to generate the most robust response from the neurons.  Figure 5a is an example of two receptive field plots of neurons in primary visual cortex (V1). The origin of these plots is the fixation point, which is a small white circle displayed centrally on a black computer screen. The color in these plots represents the firing rate of each neuron in response to a dynamic reverse correlation stimulus. We use this information to position the stimulus for a given experiment (e.g. a sine-wave grating). Stimuli that are presented are larger than the average receptive field size in order to encompass receptive field locations of all simultaneously recorded neurons.\nAfter we identify cortical layers and position the stimulus in the optimal receptive field location, we can proceed to the experimental protocol in which we present various visual stimuli while the animal performs either fixation or discrimination tasks. After the experiment, we perform our spike-waveform analysis to isolate the single-units we were able to record the same channel. This procedure often takes some time to master and is constantly being improved as new analysis software and techniques are made available. Figure 5b is an example of the type of output one might expect after using Plexon's Offline Sorter. Using this software, single unit isolation is performed through visual inspection. Distinct clusters are identified based on the weight of the first and second principal components, spike width, valley, and peak properties.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2806/2806fig1.jpg",
    "Figure 1. Multi-contact laminar electrodes Using multi-contact laminar electrodes, we recorded simultaneously spiking activity from isolated individual neurons and LFP units across cortical layers of V1. Each U-Probe consists of 16 equally spaced (100 μm) electrode contacts spanning a total length of 1.6 mm. Each electrode contact is 25 μm in diameter and is composed of platinum iridium.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2806/2806fig2.jpg\nFigure 2. NAN grid construction The NAN microdrive system provides added stability and precision over the classical screw-driven microdrive. Each group of electrodes is independently manipulated in the XY planes, within a user defined working range. Each group of electrodes is independently manipulated in the Z direction within a user defined working depth (up to 100 mm) and  variable speed range from 0.001mm /sec to 0.5 mm/sec and a high resolution of 1 micrometer. (a) 4-channel base, (b) the NAN chamber, (c) the grid with 1 mm spacing, (d) 1-4 screw microdrives, (e) 1-4 guide tubes (500 μm diameter and cut to about 5-7 cm), (f) 1-4 microdrive towers and (g) the completed NAN system and cylinder base.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2806/2806fig3.jpg\nFigure 3. Evoked response potential paradigm and LFP time series (a) To identify cortical layers, we measured the evoked response potential (ERP) during a passive fixation task while monkeys were exposed to a full-field black screen that flashed white (~1Hz) for 100 ms, and then returned to black. (b) The LFP responses recorded with the laminar U-Probe were processed to obtain ERP traces for each contact. The granular layer was determined in all sessions by locating a sink-driven inversion in the amplitude of the response in the ERP traces, and by the presence the polarity inversion accompanied by the sink-source configuration at the base of layer 4. The dotted box indicates the timing of the period of time when the inversion occurred.",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/2806/2806fig4.jpg\nFigure 4. Layer Identification using current-source density analysis (a) Current-source density analysis (based on the 2nd spatial derivate of the LFP time-series) was used to identify the polarity inversion accompanied by the sink-source configuration at the base of the granular layer. We assessed how stable the identification of cortical layers is maintained over time (left to right). In these examples, the current sink (blue) represents the granular layer and spans ~ 400 μm. (b) The CSD traces below each plot represent the average CSD of those contacts assigned to a given layer. This allowed us to determine the precise timing of the initial sink (in these examples ~ 50-60 ms. CSD trace envelopes represent standard deviation and black bars indicate the duration of the flashed stimulus (100 ms).\nimgsrc://cloudfront.jove.com/files/ftp_upload/2806/2806fig5.jpg\nFigure 5. Spike sorting and receptive field mapping (a) First, half a visual degree is calculated and doubled. Then, reverse correlation stimuli are presented in patches on a CRT monitor consisting of oriented gratings at 0, 45, 90 and 135 degrees.  Firing rates for each neuron are calculated independently at 5 ms intervals between 40 to 120 ms after stimuli are presented for each spatial location.  The maximum firing rates are calculated and then the centroid for each time delay.  Then, at each delay the distance between the centroid and adjacent firing rate locations is calculated.  The time delay with the minimum distance is chosen as the receptive field. (b) Spike waveform properties such as peak height, valley depth, peak to valley time, time of peak or valley, etc. are analyzed using an offline sorting software program (Plexon).  Spikes are sorted based on similar properties until waveforms from one neuron are clustered without overlap from another.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2806/2806fig6.jpg",
    "Figure 6. Shuffled CSD profile. Same convention as in Fig 3a but we performed a shuffling procedure that randomly compiles a new CSD matrix with the contact locations mixed. This analysis is used to better validate the granular sink by shuffling the electrode positions leaving the temporal domain unchanged. From these examples displayed over time, shuffling the electrode contacts as a function of cortical depth destroys any laminar specificity.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}