{
  "id": 3750,
  "origin_website": "Cell",
  "title": "Protocol to prepare functional cellular nanovesicles with PD1 and TRAIL to boost antitumor response",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nConstruction of stable cell lines expressing PD1 and TRAIL\nTiming: 3 weeks\nWhen the plasmids containing PD1 or TRAIL sequence and HEK293FT cells are ready, the genetic engineered cells are constructed according to the overexpression protocol which involves plasmid transfection, antibiotic selection to construct stable cell lines (Elegheert et al., 2018[href=https://www.wicell.org#bib4]). The procedure includes two parts. In the first part (steps 1–9), the HEK293FT cell lines are transfected using Lipofectamine 3000 kit (Thermo Fisher, L3000015[href=https://www.thermofisher.com/us/en/home.html?CID=cn-ebz-sem-sgk-gene-TFS-aBrand-pc-hp-082920-abcd-00000009FDC262D8]), and lentivirus supernatant are collected. In the second part, according to the resistance gene in the target gene plasmid, the corresponding antibiotic is added to screen the infected cells, then large-scale expanded (steps 10–13) (Chaudhary et al., 2012[href=https://www.wicell.org#bib1]).\nInoculate the parent HEK293FT cells in T75 culture flask in advance, and proceed to the next step after the cell density reaches 70%–80%.\nPrepare reagents for gene transfection. Prepare a 15 mL centrifuge tube (numbered A) and a 1.5 mL EP tube (numbered B). Transfer 1 mL Opti-MEM medium (Gibco, 31985-LSG, https://www.thermofisher.com/us/en/home/brands/gibco.html?CID=cn-ebz-sem-sgk-gene-Gibco-aBrand-pc-subb-082920-abcd-00000009FD973428[href=https://www.thermofisher.com/us/en/home/brands/gibco.html?CID=cn-ebz-sem-sgk-gene-Gibco-aBrand-pc-subb-082920-abcd-00000009FD973428]) and 40 μL Lipo 3000 in Tube A, mix them by using gentle pipette motion. Tube B contains target gene plasmid (10 μg), lentivirus packaging systems (plp1 plasmid: 7.5 μg; plp2 plasmid: 3 μg; plp/vsvg plasmid: 4 μg) and P3000 (40 μL), which are dissolved in 1 mL Opti-MEM medium (Gibco, 31985-LSG,https://www.thermofisher.com/us/en/home/brands/gibco.html?CID=cn-ebz-sem-sgk-gene-Gibco-aBrand-pc-subb-082920-abcd-00000009FD973428[href=https://www.thermofisher.com/us/en/home/brands/gibco.html?CID=cn-ebz-sem-sgk-gene-Gibco-aBrand-pc-subb-082920-abcd-00000009FD973428]). See Table 1[href=https://www.wicell.org#tbl1] for the description of all reagent for transfection. Then, set tube A and B aside for 5 min.\ntable:files/protocols_protocol_470_2.csv\nTransfer the solution in Tube B to Tube A, mix them by using gentle pipette motion, and let the mixture stand for 20 min.\nAdd the above mixture to the cell culture flask, and lentiviral supernatant are collected after 24 h to 72 h of incubation.",
    "Note: mCherry tag and EGFP tag inserted in the target gene plasmid provide the fluorescent signals to evaluate the gene transfection efficiency. Under fluorescence microscope, when the percent of fluorescence cells reach above 60% (Figure 3[href=https://www.wicell.org#fig3]), and the cell maintain normal morphology, it is suitable to collect the supernatant. If the transfection efficiency is low, See Troubleshooting[href=https://www.wicell.org#troubleshooting]: Problem 1[href=https://www.wicell.org#sec6.1].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/470-Fig3.jpg\nFigure 3. Fluorescence images of HEK293 FT cells after transfection for 24 h\nScale bar, 100 μm.\nCritical: Collect the supernatant and add fresh culture medium. Try to operate along the side wall of the culture flask, gently and slowly, and avoid direct contact with the cells.\nFilter the supernatant containing lentivirus by passing it though a 0.22 μm filter to remove large cell fragments.\nTransfer the sample to a sterilized ultracentrifugation tube. Place the centrifugation tube into a pre-cooled centrifuge. Counterbalance when needed.\nProgram the ultracentrifuge run using the following settings:\nRotor type: SW 32.1 Ti Rotor\nSpeed: 76,800 × g\nTime: 90 min\nTemperature: 4°C\nAcceleration: 0 (MAX)\nDeceleration: 0 (MAX)\nStart the ultracentrifuge.\nAfter centrifugation, the supernatant is gently discarded, and 1 mL of fresh culture medium is added to resuspend the virus, then aliquot into 3–5 tubes (virus titer: 106–107 IFU/mL), and stored at −80°C for future use.\nSeed 1 mL of the cell suspension of HEK293FT cells (containing 1 × 105 cells) in a 6-well cell culture plate, place the plate in an incubator with 5% CO2 at 37°C overnight.\nNote: Incubation time can be adjusted and terminated when 70%–80% cell confluence reach.",
    "The cell culture is replaced by fresh medium supplemented with a tube of virus solution (containing 106–107 IFU) and 5 μg/mL polybrene reagent to infect the cells. If the infection efficiency not high, see Troubleshooting[href=https://www.wicell.org#troubleshooting]: Problem 2[href=https://www.wicell.org#sec6.3]. After 2 or 3 days of culture, add puromycin or blasticidin to the cell for selecting PD-1 or TRAIL stably expression cells, respectively. The parent cells without lentiviral infection are used as control.\nNote: The concentration of puromycin or blasticidin should be adjusted above the lethal doses that kill nearly all the parent cells. If the high dose antibiotics also fail to screen, see Troubleshooting[href=https://www.wicell.org#troubleshooting]: Problem 3[href=https://www.wicell.org#sec6.5].\nCells in the infected group are screened for 1–2 weeks until the percent of fluorescence cells reached above 95%, proved that the stably expression cells are successfully screened.\nCritical: Different cells have different tolerance to antibiotics, so the concentration of drugs needs to be optimized.\nNote: Formation of puromycin or blasticidin resistance cells suggests the successful infection of lentivirus.\nThe stably expression cells are large-scale expanded.\nNote: When cells have reached 80%–90% confluence, split cells 1:3 onto another 6-well plate with fresh culture medium.\nCharacterization of stable cell lines\nTiming: 5 days\nThe constructed stable cell lines are characterized by confocal laser scanning microscopy observation (Dong et al., 2019[href=https://www.wicell.org#bib3]), western blot assay (Ohno et al., 2013[href=https://www.wicell.org#bib8]) and flow cytometry assay (Koh et al., 2017[href=https://www.wicell.org#bib7]) to confirm the target protein is well expressed and localized onto the cell membrane.\nConfocal microscopy observation\nCells are seeded in a confocal dish at a density of 1 × 105 per well. Place the dish in an incubator with 5% CO2 at 37°C until they completely adhered.\nWash cells three times with PBS, and fix them with 4% paraformaldehyde for 10–15 min",
    "Cell nucleus is stained with DAPI for 10 min, washed three times with PBS.\nCell membrane is stained with DiO or DiI for 15 min, washed three times with PBS, and observed under a confocal laser scanning microscope (Zeiss LSM780). See Figure 4[href=https://www.wicell.org#fig4].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/470-Fig4.jpg\nFigure 4. Confocal images of HEK293 FT cells stably expressing mouse PD1\n. Western blot assay\nCollect cells into a 1.5 mL EP tube by using cell scraper (Thermo Fisher Scientific), when the cells reach 70%–80% confluence in T75 cell culture flask.\nThe cells are lysed on ice with RIPA lysis buffer for 30 min. After lysis, the cells are centrifuged at 4°C for 30 min (13,000 × g), and the supernatant is collected for BCA protein quantification, using EasyⅡ Protein Quantitative Kit (TransGen, DQ111-01, https://www.transgen.com.cn/[href=https://www.transgen.com.cn/]).\nAccording to the BCA protein quantification result, the sample is diluted to 4 mg/mL and mixed evenly with 2× loading buffer (volume ratio 1:1), and the mixed sample is boiled at 100°C for 10 min. For details on preparation of 2× loading buffer, see the Materials and equipment[href=https://www.wicell.org#materials-and-equipment].\nThe prepared sample is subjected to polyacrylamide gel electrophoresis for protein separation. Select β-actin protein as the internal reference protein for comparison. And then, transfer to the NC membrane by membrane transfer. Afterwards, the NC membrane is placed in 5% milk and blocked at 20°C–25°C for 2 h, and washed with TBST buffer (100 mM Tris-HCl (pH=8.0), 1.5 mM NaCl, 0.1% Tween 20) for 3 times, 10 min per time. After that, add the primary antibody (dilution rate, 1:1,000), See Key resources table[href=https://www.wicell.org#key-resources-table], and incubate for 12–16 h at 4°C.",
    "The next day, recycle the primary antibody and wash the membrane with TBST buffer for 3 times with 15 min per time. Afterwards, add the secondary antibody and incubate for 1 h at 20°C–25°C. Then recycle the secondary antibody (dilution rate, 1:5,000), See Key resources table[href=https://www.wicell.org#key-resources-table], and wash the membrane with TBST buffer for 3 times with 10 min per time. Preparation the ECL and imaging on the gel imager (ChemiDoc MP) (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/470-Fig5.jpg\nFigure 5. Western blot assay to confirm the expression of PD1 (indicated as PD1+) and TRAIL (indicated as TRAIL+) in 293FT cells\nActin was used as an internal reference.\nFlow cytometer assay\nAbove prepared 105 ∼5 × 105 cells are collected, centrifuged at 20°C–25°C for 5 min (300 × g) and resuspended in PBS. The fluorescent protein signal was analyzed by flow cytometry (BD, FACSVerse) (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/470-Fig6.jpg\nFigure 6. The representative flow cytometric analysis of HEK293 FT cells before and after transfected with PD 1 and TRAIL, respectively\nCell membrane extraction\nTiming: 2.5 h\nWhen cells have reached 80%–90% confluence, remove medium and add 1 mL trypsin to digest cells. Harvest cells from plate and centrifuge cells at 600 × g for 5 min (Kim et al., 2017[href=https://www.wicell.org#bib6]).\nDiscard the supernatant, collect the cell precipitation and extract the cell membrane with a cell membrane extraction kit according to the manufacture’s instruction (Beyotime, P0033, https://www.beyotime.com/index.htm[href=https://www.beyotime.com/index.htm]).\nDetermine the protein content in the extracted membrane by BCA kit, and then store the membrane in −80°C refrigerator for future use.\nNote: The storage time of the extracted membrane should be no more than 1 month in −80°C refrigerator.\nCritical: In order to maintain the biological function, the extracted membrane cannot be lyophilized for storage.\nSynthesize the functional vesicles\nTiming: 2 h",
    "An Avanti mini-syringe extruder (Figures 7[href=https://www.wicell.org#fig7] and 8[href=https://www.wicell.org#fig8]) is used to prepare cell membrane vesicles using the mechanical force imposed by the extruding process to disrupt the membrane structure and enable it to reform into nano-scale vesicles (Fang et al., 2014[href=https://www.wicell.org#bib5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/470-Fig7.jpg\nFigure 7. The Avanti mini-syringe extruder\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/470-Fig8.jpg\nFigure 8. Schematic illustration of the parts of the Avanti mini-syringe extruder\nAssemble the mini-syringe extruder\nPlace the 2 Internal Membrane Supports on a flat test bed with the O-rings vertically upward\nPre-wet 2 Filter Supports with DI water, or buffer, and place over orifice of Internal Membrane Supports. The Filter Supports should adhere to the Teflon orifice inside the O-ring inner scope.\nInsert the Internal Membrane Support into the Extruder Outer.\nPlace 1 Polycarbonate Membrane in the Extruder Outer Casing over the Filter Support and O-ring.\nNote: Do not install the blue paper disks which separate the polycarbonate membranes in packing box.\nPre-wet a second pair of Filter Supports with DI water, or buffer, and place over orifice of remaining Internal Membrane Support.\nCarefully place the second Internal Membrane Support into the casing (O-ring facing down).\nPlace the Retainer Nut on the threaded end of the Extruder Outer Casing and tighten. Tighten the Retainer Nut by hand just until it is finger tight; do not use a wrench.\nNote: Autoclaving the Teflon inserts is not recommended as slight distortion may occur (∼0.002 mm). The use of ethylene oxide or UV irradiation is suggested as an alternative. The syringes should be sterilized with ethanol.\nCritical: See Figure 9[href=https://www.wicell.org#fig9] and Methods Video S1[href=https://www.wicell.org#mmc1] for detailed operate instructions of step 20.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/470-Fig9.jpg\nFigure 9. Installation process for the Avanti mini-syringe extruder\n(A and B) Place two Internal Membrane Support on a flat test bed with the O-rings vertically upward.",
    "(C) Insert one Internal Membrane Support into the Extruder Outer Casing.\n(D) Place one pre-wetted Filter Support over orifice of the Internal Membrane Support in the Extruder Outer Casing.\n(E) Place one Polycarbonate Membrane over the Filter Support Support and O-ring in the Extruder Outer Casing.\n(F) Place the second pair of pre-wetted Filter Support over orifice of the other Internal Membrane Support.\n(G) Carefully place the second Internal Membrane Support into the Extruder Outer Casing (O-ring facing down).\n(H) Place the Retainer Nut on the threaded end of the Extruder Outer Casing and tighten.\n(I) Place the empty gas-tight syringe (with plunger is set to zero) into the one end of the mini-extruder.\nAdd the cell membrane solution into one of the gas-tight syringes and carefully place into one end of the mini-extruder (Figure 10[href=https://www.wicell.org#fig10]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/470-Fig10.jpg\nFigure 10. Schematic illustration of drawing the sample by syringe\n    Your browser does not support HTML5 video.\n  \nMethods Video S1. The detailed operate instructions for assemble the mini-syringe extruder, related to step 20\nNote: To reduce the dead volume and facilitate extrusion, pre-wet the extruder parts by passing a syringe full of buffer through the extruder.\nPlace the empty gas-tight syringe into the other end of the mini-extruder. Make sure the empty syringe plunger is set to zero; the syringe will fill automatically as the cell membrane is extruded through the polycarbonate membranes.\nGently push the plunger of the filled syringe until the cell membrane solution is completely transferred to the alternate syringe (Figure 11[href=https://www.wicell.org#fig11]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/470-Fig11.jpg\nFigure 11. Schematic illustration of extrusion operation\nGently push the plunger of the alternate syringe to transfer the solution back to the original syringe.",
    "Repeat above steps 23 and 24. Total of 11 passes through the 1,000 nm, 400 nm, 200 nm, and 100 nm polycarbonate membranes, respectively. If the FCNVs fail to maintain their biological functions, see Troubleshooting[href=https://www.wicell.org#troubleshooting]: Problem 4[href=https://www.wicell.org#sec6.7].\nNote: The final extrusion should fill the alternate syringe. This is to reduce the chances of contamination with larger particles or foreign material.\nCritical: After being pushed through the syringes for enough times, the diameter of final product will be around 100 nm with a polydispersity index (PDI) less than 0.2. When the diameter and/or PDI are larger than these values, increasing the pass times appropriately.\nAfter the final extrusion, inject the obtained solution into a clean sample vial.\nCritical: When removing syringes, pull the syringe straight out of the extruder. See Methods Video S2[href=https://www.wicell.org#mmc2] for detailed operate instructions of steps 21–25.\n    Your browser does not support HTML5 video.\n  \nMethods Video S2. The detailed operate instructions for obtaining the FCNVs, related to steps 21–25\nThe characterization of FCNVs\nThe size distribution of FCNVs is measured by dynamic light scattering (DLS) method through Zetasizer NanoZS system (Malvern Instruments, Southborough, MA, USA). Therein, the size measurement is performed in Size module with 200 s equilibration time using DTS0012 cuvette. The ultrastructure, integrity and morphology of FCNVs are evaluated by transmission electron microscopy (TEM). Therein, the sample is dropped onto a Cu-grid that covered with carbon film, and dried for 2 h. Subsequently, the sample is stained by 50 μL of tungstophosphoric acid for 5 min, and the redundant solvent was removed blotters. After drying again, the morphology was observed and photographed using JEM-1400Plus transmission electron microscopy (JEOL, Japan). The specific ratio and content of TRAIL and PD1 in FCNVs are determined by ELISA (R&D Systems, DY1121 for TRAIL and DY1021 for PD1, https://www.rndsystems.com/cn[href=https://www.rndsystems.com/cn]).",
    "Assessment of immunotherapy of FCNVs\nThe TRAIL component on FCNVs could initiate the immune responses by specifically inducing immunogenic cancer cell death, which could be further strengthened by collaborating with presented ectogenic PD1 proteins as the checkpoint blockade to reactivate the anergic tumor-specific CTLs. The corresponding function of FCNVs can be evaluated both in vitro and in vivo.\nIn vitro immune checkpoint inhibition of FCNVs: naive mouse CD8+ T cells (CTLs) are first isolated from the spleen of BALB/c mice, followed by CD3/CD28 antibody stimulation to obtain activated CD8+ T cells. Subsequently, cancer cells with various treatments, such as blocking PDL1 on cell membranes by our FCNVs or PDL1 antibody, are added to the activated CD8+ T cells to check the cytotoxic activity by using Annexin V-FITC and PI cell apoptosis assay.\nIn vitro immunogenic cancer cell death (ICD) induced by FCNVs: Anticancer effect of TRAIL proteins on FCNVs can be assessed by Annexin V-FITC and PI cell apoptosis assay, and the danger-associated molecular patterns (DAMPs) like CRT proteins released from dead cancer cells are checked by immunofluorescent staining. Finally, the release of DAMPs together with tumor-associated antigens (TAAs) from dead cells are co-incubated with borrow-derived dendritic cells (BMDCs) to check whether they can promote the maturation of BMDCs though dual staining for CD80 and CD86, the typical markers on the surface of maturated DCs.\nIn vivo antitumor effect of FCNVs: The comprehensive immuno-modulating ability and robust antitumor immunity of our FCNVs can be demonstrated through evaluating tumor growth regression, metastasis prevention, distal and immune-memory effects, and long-term survival benefits.\nAll of the above corresponding results can be found in our recent iScience publication (Wu et al., 2020[href=https://www.wicell.org#bib11])."
  ],
  "subjectAreas": [
    "Cell Membrane",
    "Immunology",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}