{
  "id": 17826,
  "origin_website": "Jove",
  "title": "Porcine Model of Infrarenal Abdominal Aortic Aneurysm",
  "procedures": [
    "Animal protocols were approved by the University of Virginia Institutional Animal Care and Use Committee (No. 3848).\nNOTE: This model has been previously published by Cullen et al. and is a modified protocol described by Hynecek et al.8,15.\n1. Animals\nUse non-castrated male swine weighing 20-30 kg for the experiments.\nIn order to maximize the proportion of weight-based doses of BAPN ingested, provide pigs with divided meals of standard chow and 0.15 g/kg of BAPN mixed with whole-milk plain yogurt or wet dog food. Start BAPN administration 7 days prior to the index operation to achieve steady state in the blood, and daily during post-operative course.\n\tNOTE: BAPN has numerous side effects if ingested in large quantities. Isolation precautions for staff including cap, gowns, gloves, and shoe covers should be worn whenever interacting with animals fed BAPN or handling BAPN.\nMake pigs nil per os (NPO) the night prior to surgery.\n2. Anesthesia\nInduce general anesthesia (GA) using tiletamine-zolzepam 6 mg/kg, xylazine (2 mg/kg), and atropine sulfate (0.04 mg/kg) administered intramuscularly.\nIntubate the pig using a standard endotracheal tube (ETT) and Miller blade.\nObtain peripheral intravenous (IV) access using a 16 or 18 gauge IV in an ear vein and secure in place with tape.\nConnect the ETT to anesthesia machine and maintain GA using inhaled isoflurane (0.2 mg/kg).\nApply electrocardiogram (EKG) leads and pulse oximetry to monitor vital signs during surgery. Take oral temperature at the beginning of the case. Place an electrocautery pad on dependent portion of the pig.\nBe sure one member of your staff is continually monitoring and regularly recording vital signs to ensure the pig is appropriately sedate, ventilated, and oxygenated, as well as to identify and appropriately intervene upon any hemodynamic instability during the surgery.\n3. Surgical technique",
    "Perform sterilization of the surgical area using sterile gauze, povidone-iodine and 70% isopropyl alcohol. Drape the pig in the usual sterile fashion. Take a blood sample prior to incision.\n\tNOTE: At this point, all equipment, including instruments, balloons, wires, etc. must be sterile.\nUsing an eleven blade or Bovie electrocautery, perform a midline laparotomy to enter the abdominal cavity.\nDisplace the abdominal viscera cephalad to the pig's left to expose the retroperitoneum. Cover the bowel with a moist blue towel to avoid desiccation. Make a sharp incision to enter the retroperitoneum, allowing access to the inferior vena cava (IVC) and infrarenal abdominal aorta.\n\tNOTE: Identification and protection of the ureters bilaterally is crucial at this portion of the case. Swine retroperitoneal anatomy (including the course of the ureters) grossly mirrors that of humans, with subtle variations detailed below.\nCircumferentially dissect the aorta from the renal vessels, inferiorly to the aortic trifurcation. Take care to avoid IVC and lumbar artery injury. Once the entire infrarenal aorta is exposed, use calipers to measure the aortic diameter at the mid portion of the infrarenal aorta.\n\tNOTE: Unlike humans, swine have an aortic trifurcation, not bifurcation.\nIdentify the caudal mesenteric artery on the anterior portion of the infrarenal aorta, which usually lies a few centimeters proximal to the aortic trifurcation. This artery does not exist in humans. Dissect, clamp, and transect this artery. At this point, administer 5000 units of unfractionated heparin sulfate intravenously.\nCannulate the caudal mesenteric artery with a 0.018 in stainless steel wire guide from a micropuncture introducer set. Serially dilate the artery over the wire with a 5 French (Fr) and then a 7 Fr introducer.",
    "Leaving the 7 Fr introducer in place, replace the 0.018 in wire with a 0.035 in guidewire, and then remove the 7 Fr introducer, ensuring hemostasis with a finger over the cannulation site as the introducer is removed. Insert a 0.035 in guide wire until approximately 30 cm of wire remains or resistance is encountered.\nInsert a 16 mm percutaneous transluminal angioplasty balloon over the wire into the infrarenal aorta and position it at the midpoint of the dissected aorta. Inflate the balloon while intermittently measuring the diameter of the dilated aorta with calipers until maximal dilation is approximately 80% greater than your baseline measurement.\nAfter 10 min of reperfusion, cross clamp the aorta just distal to the renal vessels and proximal to the aortic trifurcation. Identify and clamp the previously dissected lumbar vessels to isolate the infrarenal aorta from systemic circulation. This is important to avoid systemic perfusion of elastase, which can cause a septic response in the acute post-operative period.\nReintroduce the 7 Fr introducer over the wire and remove the wire. Flush the isolated aortic segment with saline assuring no leakage of fluid. Connect the elastase (500 units) and collagenase (8000 units) solution to the introducer and perfuse 30 mL into the isolated aorta under constant manual pressure for 10 min. The entire 30 mL of solutions should be introduced to the isolated segment.\n\tNOTE: A well perfused aortic segment should be taut without leakage from the aortic wall or from the cannulation site. A vessel loop may be wrapped just proximal to the cannulation site to ensure no elastase escapes. Over the course of 10 min, elastase/collagenase solution can be observed \"weeping\" through the aortic wall.",
    "After 10 min, irrigate the solution from the aortic lumen with saline. Remove the introducer and ligate the caudal mesenteric artery stump. Release all clamps (lumbar clamps first, followed by distal clamp, then proximal clamp).\n\tNOTE: Restrict the clamp time to no more than 10 min in order to prevent spinal cord ischemia. Have a repair stitch (5-0 polypropylene) loaded in case of bleeding from the caudal mesenteric artery stump after the cross clamps are released.\nSoak a 2 cm x 5 cm piece of surgical gauze with 20 mL of undiluted elastase (27 units/mL) and wrap around the intervened aorta for 10 min. Take a measure of the aorta after all interventions with a caliper.\nIrrigate the abdomen with saline, replace the bowel, and close the abdomen in three layers. BAPN inhibits wound healing, so in order to minimize the risks of wound breakdown and fascial dehiscence, use suture with a long absorptions time and be sure to take judiciously small sized bites of tissue at every layer. Utilize a running synthetic absorbable monofilament 1 looped Polydioxanone (PDS) suture for the fascia, a running braided absorbable 2-0 suture for the deep dermal later, and a running subcuticular absorbable monofilament suture (4-0) for the skin.\n4. Postoperative care\nUtilize 0.2 mg/kg subcutaneous buprenorphine-SR for post-operative analgesia. Evaluate each pig three times daily for the first three post-operative days for signs of pain and discomfort and administer additional analgesia if identified. \nAdminister postoperative antibiotics (1 g cephalexin intramuscularly) on POD 1-3.\nSocially house animals after POD 3.\n5. Aortic tissue procurement\nPerform tissue procurement on either POD 7, 14, or 28.\nInduce GA as described in steps 2.1-2.5 above.\n\tNOTE: Terminal aortic tissue procurement does not need to be sterile.",
    "5.3. Reopen the previous midline laparotomy incision, being cognizant of adhered bowel to the anterior abdominal wall. Reflect the bowel to expose the retroperitoneum and aorta similar to step 3.3 above.\nDissect the aorta until the aneurysm is exposed and measure the external diameter of the aneurysmal segment with calipers. Calculate aortic dilation (%) using the following equation: [(harvest infrarenal diameter - initial operative infrarenal diameter) x 100%]. Once the measurement is attained, administer a lethal dose of pentobarbital-phenytoin (e.g., Euthasol) via injection into the IVC.\nDissect the aorta from the trifurcation to the suprarenal aorta and explant the aneurysmal segment with a control segment of untreated aorta. Place the sample in either liquid nitrogen or formalin for histologic evaluation.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}