{
  "id": 3042,
  "origin_website": "Cell",
  "title": "Protocol for bacterial typing using Fourier transform infrared spectroscopy",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\n      IR-spectroscopic measurement modes include traditional absorbance/\n      transmission (A/T), attenuated total reflection (ATR), and diffuse\n      reflectance mode (Figure 1[href=https://www.wicell.org#fig1]).5[href=https://www.wicell.org#bib5],16[href=https://www.wicell.org#bib16],30[href=https://www.wicell.org#bib30] FT-IR spectroscopy equipment: for a list of\n      available commercial instruments, please refer to\n      Table 1[href=https://www.wicell.org#tbl1]. The advantages of A/T mode are its higher\n      signal-to-noise (SNR) ratios and high-throughput in contrast to ATR.31[href=https://www.wicell.org#bib31]\n      The A/T mode is more common and based on the detection of the transmitted\n      IR radiation: the bacterial sample is placed in the path of the IR beam\n      and scanned. In this protocol, transmission mode was employed for\n      bacterial analysis.\n    \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2585-Fig1.jpg\nFigure 1. The main IR radiation mode\n          (A) Transmittance and typical bacterial FT-IR spectra, (B) attenuated\n          total reflectance (ATR), (C) reflectance.\n        \nPreparation of bacterial sample\nTiming: 12–24 h (for steps 1 to 6)\n    \n      Many different sample preparation techniques for FT-IR spectroscopy have\n      been published.15[href=https://www.wicell.org#bib15],17[href=https://www.wicell.org#bib17],24[href=https://www.wicell.org#bib24],32[href=https://www.wicell.org#bib32],33[href=https://www.wicell.org#bib33] For accurate microbial typing, it is\n      necessary to obtain a single purified colony stemming from a single,\n      individual bacterial cell. Mixed cultures would lead to\n      misidentifications. Agar plates are commonly used for growing bacterial\n      cells, which also allow easy sample preparation. In certain cases,\n      subculturing (on the same medium) may be necessary in order to adapt the\n      organism to the growth medium. In any case, standardization of growing\n      conditions (including media preparation, subculturing, and incubation\n      conditions such as time and temperature, and cell recovery) is critical\n      because any variation introduced in these steps will hamper typing\n      results. Therefore, we recommend comparing the FT-IR signals of strains\n      grown under the same conditions, including media and growth times, in\n      order to achieve reliable results and high typing reproducibility.\n    \n        Bacterial culture\n        \n            Streak the isolated strains onto agar plates in a four-quadrant\n            streak pattern by an inoculation loop under sterile conditions\n            \nNote: Once a specific culture",
    "medium is chosen, the protocol should be carried out using the\n              same medium and the same water pH during media preparation.\n            \n            To culture clinical bacteria, such as E. coli, incubate\n            bacteria for 16 h ± 30 min at an optimal temperature (35°C–37°C).\n            For food microbiology, a temperature between 25°C and 30°C is often\n            used.\n            \nCritical: To achieve data\n              compatibility between laboratories, a simple and reproducible\n              standard is needed for cultivation conditions and experimental\n              procedures. Agar plates allow easy sample preparation and show the\n              best discriminatory power in later typing; therefore, we recommend\n              agar plates. If the strains cannot grow on agar plates or tryptone\n              soy agar(TSA), or need blood or any other nutrition factor, or\n              require incubation for several days to flourish, these strain\n              suspensions should be washed 4–5 times by centrifugation in\n              sterile water to remove culture media.\n            \nCritical: A preliminary\n              experiment (six known strains grown in the same culture\n              conditions) is needed to determine and standardize the growth\n              conditions with the best discriminatory power for typing, which is\n              an essential prerequisite to starting extensive comparative\n              studies. To assess the discriminatory power of the methodology,\n              its robustness and reproducibility, and to differentiate taxonomic\n              from methodological variability, several statistical values\n              (measuring within-replicate variability) should be calculated, by\n              e.g., averaging Pearson's product moment correlation\n              coefficient and expressed as differentiation index (D). For\n              a more detailed description of how to (approx. 20 mL), utilize,\n              and assess reproducibility values (D value), see the\n              refs.8[href=https://www.wicell.org#bib8],15[href=https://www.wicell.org#bib15],34[href=https://www.wicell.org#bib34]\nNote: If concentrations of salts\n              and nutrients in the culture medium differ, it will introduce\n              unwanted variability into the IR spectrum. Therefore, the medium\n              complements must remain consistent in order to obtain reliable\n              results in the multivariate analysis.\n            \n        Remove the small amount of biomass (10–60 μg dry weight) from the",
    "bacterial lawn carefully from confluent colonies on the third quadrant\n        of the agar surface (this technique yielded the best reproducibility)\n        using an incubating loop.35[href=https://www.wicell.org#bib35]\nCritical: For comparative FT-IR\n      spectrometric analysis, only a single colony should be applied. It is\n      important that the bacterial samples that are used are grown under similar\n      conditions, particularly for bacterial analysis on the subspecies level.\n      In any case, the user should avoid analyzing mixed bacterial samples\n      stemming from mixed, impure cultures. The user should also avoid analyzing\n      bacterial samples in the lag phase or that have entered the death phase.\n      For this purpose, strict adherence to standardized growth conditions\n      (incubation time, temperature, humidity, culture medium) is required.\n    \nNote: Contamination by medium components\n      should be minimized by accurately picking the bacterial clones. Do not\n      transfer agar into the sample, which requires special care when\n      harvesting. Loops should be closed and without sharp ends.\n    \n        After harvesting cells from these cultures by scraping, resuspend\n        approximately 50 μg of microbial biomass in sterilized distilled water\n        or 0.9% NaCl solution and wash three times. Centrifuge the suspension at\n        11000 × g at room temperature (20°C–25°C) for 2 min.\n      \nOptional: Submerge the bacterial cells\n      in 35% ethanol aqueous solution in the suspension vial, and then remove\n      the bacterial cells from the plastic inoculation loop by flipping. If the\n      biomass in the loop is too sticky and will not come off, try to take a\n      larger amount. If this does not work, cut off the loop with the adherent\n      bacterial cells. A metal cylinder (Bruker Part No. 1851760) can be used.\n      Shake the metal cylinder for about 1–2 min to remove the biomass from the\n      loop, transfer the suspension into a new vial, and centrifuge at\n      11000 × g at room temperature (20°C–25°C) for 2 min.",
    "Note: Some bacteria will stay in the loop\n      unsuspended, but this may be compensated for by the mass on and around the\n      loop.\n    \n        After closing the suspension vial, vortex to form a homogeneous\n        suspension.\n      \nCritical: Prior to use in bacterial\n      culture, all experimental materials and reagents should be autoclaved and\n      handled under sterile conditions. Use sterile vessels or Petri dishes.\n    \n        Smear 50 μL of bacterial suspension on the surface of a CaF2\n        or ZnSe slide.\n      \nDry the bacterial suspension at 40°C or under vacuum for 30 min.\nNote: Thin transparent bacterial films\n      form on the CaF2 optical substrate. The degree of drying\n      influences the FT-IR spectrum, as shown in Figure 2[href=https://www.wicell.org#fig2].\n      Apply the sample as evenly as possible on the imprinted positions of the\n      microtiter plate, i.e., the sample should cover each imprinted position\n      completely and form a homogeneous layer.\n    \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2585-Fig2.jpg\n          Figure 2. Comparison of drying effects of different methods\n        \n          (A) FTIR spectra of bacteria dried at 40°C for different times, and\n          the corresponding CaF2 slides are shown below.\n        \n          (B) FTIR spectra of bacteria dried under vacuum (25°C, 20 kPa) for\n          different times, and the corresponding CaF2 slides are\n          shown below.\n        \nCritical: Control and standardize the\n      exposure temperature and exposure time. Any temperature in the range of\n      25°C–40°C is acceptable. It is recommended that the moisture outside the\n      sample not be visible to the naked eye when drying is completed. Excessive\n      drying may affect the bacterial morphology, which in turn affects the\n      authenticity of the bacterial typing.\n    \nNote: Be careful when handling the FT-IR\n      slides. Hold the cell at its edges. Do not touch the cell surface, neither\n      the front side nor the rear side. IR-spectroscopy is very sensitive to any\n      contamination and will detect fingerprints or dust. We give a detailed",
    "example of sample preparation and inoculation in the FT-IR equipment in\n      the\n      supplemental information[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2585-Mmc1.pdf]\n      (Figure S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2585-Mmc1.pdf]).\n    \nNote: The cell should be delivered in a\n      clean, ready-to-use state and packed in a reclosable plastic bag. After\n      use they can be cleaned. For the microtiter plate, if enough free spots\n      are still available, it can be used for another measurement run. You can\n      clean and disinfect the microtiter plate by covering the surface first\n      with 70% (v/v) isopropanol and then with deionized water and carefully\n      rubbing the plate with a sponge or cleaning tissue. To remove any fatty\n      residues, repeat the cleaning with 70% (v/v) isopropanol. To dry the\n      microtiter plate, use clean pressurized air (oil-free) or a clean and\n      dust-free cleaning cloth.\n    \nNote: If not successful, check\n      problem 1[href=https://www.wicell.org#sec6.1] in\n      troubleshooting[href=https://www.wicell.org#troubleshooting] section.\n    \nEquipment preparation\nTiming: 40 min\n      Transmission mode is recommended for FT-IR spectroscopy collection. For\n      FT-IR spectroscopy, water vapor rotational bands have a low intrinsic\n      half-width and their precise wavenumber position. To collect high-quality\n      FT-IR spectra, the FT-IR instrument should be placed in an enclosed space\n      avoiding disturbance of air flow.\n    \n        Turn on air-conditioning and a liquid desiccant system in the room in\n        which you are doing the experiment. Control the temperature at 25°C.\n      \nCritical: Only operate the FT-IR\n      machine in a well-enclosed room; air movement must be minimized.\n      Maintaining a dry and steady test environment is very important to avoid\n      atmosphere changes inside the spectrometer.\n    \nTurn on the drying equipment for the instrument.\nCritical: Dry air or nitrogen should\n      displace water vapor absolutely.\n    \nTurn on the IR source and the FT-IR spectrometer.\nNote: The IR instrument should be\n      permanently switched on. Each time after switching on the instrument, you\n      must wait for ∼1 h after power-up for the IR source to stabilize.\n    \nCollecting FT-IR spectra\nTiming: 40 min",
    "It should be noted that some or many of the steps included could be\n      performed by the FTIR software automatically and do not need to be\n      executed by the lab operator. More details can be found in previous\n      protocols.25[href=https://www.wicell.org#bib25],36[href=https://www.wicell.org#bib36]\n        Set the spectrum collection parameters based on the chosen FT-IR\n        instrument. Set spectrometer resolution to 4 cm−1 and\n        spectral range to 4,000–500 cm−1.\n      \nNote: To improve the SNR, the scan number\n      should be high enough, always considering time measurement.\n    \nNote: If not successful, check\n      problem 2[href=https://www.wicell.org#sec6.3] in\n      troubleshooting[href=https://www.wicell.org#troubleshooting] section.\n    \n        Collect a background spectrum. The background spectra are used to check\n        the spectral signals that originate from air, moisture (water vapor),\n        and atmospheric changes.\n      \nCritical: If the water vapor is not\n      purged completely by dry air, there will be peaks in the regions of\n      1900–1750 cm−1. If these peaks appear, you should check the\n      tubing and ensure no air leaks are present. You should also check the\n      liquid desiccant system and drying equipment, and then purge for a longer\n      period of time.\n    \nCritical: It is advisable to obtain\n      the single beam reference spectrum through an empty sample-cell system\n      before the single beam sample spectrum is obtained. This can eliminate the\n      contributions from possible impurities in the sample cells and minimize\n      signals arising from CO2 and water vapor caused by\n      instabilities in the instrument and dry air purging of the system.\n    \nNote: A background spectrum should be\n      taken if atmospheric changes occur.\n    \nNote: If not successful, check\n      problem 3[href=https://www.wicell.org#sec6.5] in\n      troubleshooting[href=https://www.wicell.org#troubleshooting] section.\n    \nCollect a spectrum for one type of bacterial sample.\nCritical: To improve reproducibility\n      and use chemometric approaches, the spectral resolution should be\n      constant. During spectrum acquisition, the IR instruments can set a\n      quality control to check the different spectral properties, e.g.,",
    "absorbance intensity and SNR. Spots with spectra pass this quality test.\n      Failed spectra should not be taken into account for further calculations.\n    \nNote: The sample cell must be handled with\n      care. Make sure the microbic film does not flake off. Empty areas will\n      result in poor absorption spectra caused by fringing from channel spectra,\n      dispersion of the IR beam by incorrect absorbance from lack of sample.\n    \nNote: If not successful, check\n      problem 4[href=https://www.wicell.org#sec6.7] in\n      troubleshooting[href=https://www.wicell.org#troubleshooting] section.\n    \nSubtract background spectra.\nCritical: To obtain high-quality\n      bacterial IR spectra, the background spectrum must be carefully and\n      adequately subtracted from the sample spectrum. Most of the IR instruments\n      are equipped with software that can subtract background spectra\n      automatically. Ensure the background spectrum is correctly set.\n    \nNote: If not successful, check\n      problem 5[href=https://www.wicell.org#sec6.9] in\n      troubleshooting[href=https://www.wicell.org#troubleshooting] section.\n    \nSave the raw data on the hard drive or other media.\nNote: Always save the data immediately to\n      prevent loss if there is a power failure.\n    \n        Clean the cell when finished. Wash the sample cell with ethyl alcohol\n        (∼5 mL), and then with an excess of water (∼10 mL). Finally, gently wipe\n        the windows with lens cleaning paper to keep them clean.\n      \nNote: The overriding principle of\n      experimental disposal is that all waste should be decontaminated,\n      autoclaved, or incinerated within the laboratory to guarantee \"zero\n      leakage\" of infectious biohazards.\n    \nFT-IR spectrum preprocessing\nTiming: 5 min\n      Preprocessing of the spectra is a significant issue, as the application\n      and suitability of preprocessing can greatly affect the results of the\n      computational analysis.37[href=https://www.wicell.org#bib37] The preprocessing of\n      spectra can correct variations related to spectrum acquisition, improve\n      the robustness and accuracy of subsequent multivariate analyses, remove\n      outliers, reduce the dimensionality of the data, and increase data\n      interpretability by correcting issues associated with spectral data\n      acquisition.38[href=https://www.wicell.org#bib38] Preprocessing includes a spectral",
    "quality test, derivation, normalization, and spectrum window selection.39[href=https://www.wicell.org#bib39]\n      An illustration of the recommended preprocessing workflow based on FT-IR\n      spectra is given in Figure 3[href=https://www.wicell.org#fig3]. The previous protocols\n      give detailed information about FT-IR spectrum preprocessing.25[href=https://www.wicell.org#bib25],40[href=https://www.wicell.org#bib40]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2585-Fig3.jpg\n          Figure 3. Combination of preprocessing steps\n        \n          The raw spectral data are processed using the following sequence of\n          preprocessing steps: (i) quality test of raw spectrum; (ii) signal\n          amplification by first or second derivative; (iv) normalization;\n          (v) spectral window selection. Baseline adjustment is performed to\n          compare absorbance spectra. Baseline correction is not needed if\n          derivatives are calculated but can be a point in the checklist for\n          some cases.\n        \n        Spectral quality test. The spectral quality analysis involves three\n        aspects (Figure 4[href=https://www.wicell.org#fig4]).\n        \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2585-Fig4.jpg\n              Figure 4. Strategy for quality testing the bacterial spectrum\n            \n              (A) The difference between the maximum and minimum absorbance\n              values of the original spectrum were calculated in the spectral\n              region of 2100–1600 cm−1.\n            \n              (B) Signal 1, Signal 2, Noise, and water are the differences\n              between the maximum and minimum values of the first derivatives at\n              1700–1600 cm−1, 1200–900 cm−1,\n              2100–2000 cm−1, and 1847–1837 cm−1,\n              respectively. More details are shown in B1, B2\n              and B3, B4.\n            \n            Check the absorbance value. The difference between the maximum and\n            minimum absorbance values of the original spectrum at\n            4000–500 cm−1 should be in the range of 0.3 to 2\n            absorbance units.\n          \n            Check the SNR value.\n            \n                Evaluated the signal to noise ratio (SNR) from the first\n                derivation spectrum.\n                \nNote: As shown in\n                  Figure 4[href=https://www.wicell.org#fig4]B, Signal 1, Signal 2, and Noise\n                  are the differences between the maximum and minimum values of\n                  the first derivatives at 1700–1600 cm−1,\n                  1200–900 cm−1, and 2100–2000 cm−1,\n                  respectively.\n                \n                Calculate the noise in any region free of sample absorption\n                bands.\n                \nNote: the 2100–2000 cm−1\n                  region is designated as noise in this protocol. The value of",
    "Noise should not exceed 0.00015 units.\n                \n                Calculate the SNR for Signal 1 and Signal 2.\n                \nNote: :These must greater than\n                  400:1 and 80:1, respectively.41[href=https://www.wicell.org#bib41]\nNote: Data not meeting the\n                  quality criteria should be excluded from further analysis, and\n                  the user should check the sample, instrument, and instrumental\n                  setting.\n                \n            Check the water vapor signals.\n            \n                Calculate the difference between the maximum and minimum values\n                of the first derivative spectrum in the 1847–1837 cm−1\n                region as the water vapor signal, which must not exceed\n                3 × 10−4.\n              \n                Calculate the \"signal/water\" ratio from Signal 1,\n                Signal 2, and water max values, Signal 1: Water > 100:1;\n                Signal 2: Water > 20:141[href=https://www.wicell.org#bib41]\nCritical: To ensure the\n                  quality of bacterial IR spectra, at least five replicates are\n                  required in each class. Ideally, 3 biological (different days)\n                  and 3 other experimental (same plate) replicates should be\n                  performed for each isolate.\n                \nNote: If not successful, check\n                  problems 6[href=https://www.wicell.org#sec6.11] and\n                  7[href=https://www.wicell.org#sec6.13] in\n                  troubleshooting[href=https://www.wicell.org#troubleshooting] section.\n                \n        Use Savitzky-Golay smoothing to remove spectral noise.\n        \n            Try different window sizes from 3 to 21 and observe how the spectra\n            change in shape and how the noise is reduced.\n          \n            Use the smallest window that removes a considerable amount of the\n            noise while maintaining the original spectral shape.\n          \n            If the Savitzky-Golay method is used in the derivative analysis, the\n            smoothing step can be omitted.\n          \n        Savitsky-Golay derivation.\n        \n            From the applications menu, select derivative function (the\n            second-derivative is recommended).\n          \n            Use a baseline-corrected seven-point Savitsky-Golay derivative\n            function. Save the second-derivative spectrum.\n          \nCritical: The derivative spectra show\n      the details much better, allowing the differences between different\n      strains to be visualized. In particular, second-derivative spectra (for\n      which ease of visual inspection is often inverted around the frequency\n      axis) are well suited for identifying component bands in a complex\n      spectral region. The sharp and narrow absorption peaks from residual water",
    "vapor would be greatly enhanced by the second-derivative analysis and\n      distort the protein amide I bands.\n    \nNote: Discard points below a threshold,\n      and then fit the remaining points with a straight line.\n    \n        Perform a normalization to correct different scales across spectra\n        (e.g., due to different sample thicknesses when using FT-IR in\n        transmission mode).\n      \nCritical: Vector normalization is\n      recommended. If the spectra are collected on different instruments, the\n      SNRs will be quite different and the application of smoothing and\n      normalization is necessary.\n    \nNote: As excessive smoothing can build up\n      side lobes and periodic noise, which may be confused with true spectral\n      features, the amount of smoothing should be kept to a minimum.\n    \n        Cutting at interested region. Truncate the second-derivative spectrum to\n        the appropriate subrange(s) by selecting the ZAP function.\n      \n        Save the results in a comma-separated value or CSV file (.csv), a text\n        file (.txt), or an appropriate, compatible-format file.\n      \n      Multivariate analysis of spectral data for bacterial typing\n    \nTiming: 10 min (for steps 22 to 27)\n    \n      Multivariate data analysis can be divided into unsupervised and supervised\n      methods. Unsupervised methods, such as HCA and PCA, are used to describe\n      the associations and patterns among a set of input measures. Such\n      calculations do not necessarily rely on existing spectral databases or a\n      priori knowledge. Supervised methods are machine learning techniques for\n      creating a classification function from training data with a priori\n      knowledge. These methods involve a supervised learning procedure in which\n      models are created that map input objects (spectra) to desired outputs\n      (class assignments). There are three essential steps in the supervised\n      classification analysis: data selection, model construction, and model\n      validation. The data selection step aims to split the dataset into at\n      least two subsets: training and test. In general, the training set\n      accounts for approximately 70% and the test set accounts for approximately",
    "30%. The training set is then used to establish the model, whereas the\n      test set is used to verify the established model. Support vector machine\n      (SVM) and ANNs are recommended in microbial typing analysis.42[href=https://www.wicell.org#bib42],43[href=https://www.wicell.org#bib43],44[href=https://www.wicell.org#bib44] In\n      model validation, the receiver operating characteristic (ROC) curve and\n      confusion matrix are commonly used to evaluate the performance of the\n      model.\n    \n        Create a new folder in your file system. All the preprocessed files\n        should be contained.\n      \n        Assemble the data set.\n        \nOptional: When using commercial\n          software not supporting multivariate analysis of spectral data, the\n          user can follow the following procedure to assemble the data set.\n        \n            Execute the following steps in Excel.\n            \nOpen the CSV or text file created in the previous step.\n                Next, enter the class labels in this column (take care not to\n                miss any boxes).\n              \nSave the spreadsheet as a ‘Text (tab-delimited)’ file.\n                Choose a data analysis procedure appropriate to your analysis\n                goal.\n                \nCritical: Each list file\n                  is saved in a .csv or text file (.txt) format containing\n                  several columns, with the first column corresponding to\n                  wavenumber (cm−1) and the remaining columns\n                  corresponding to peak intensities. The replicates should share\n                  the same class label. At least five replicates are required in\n                  each class.\n                \nNote: The data (except class\n                  labels) must not contain non-numeric values. Missing values or\n                  features should be given zeros.\n                \n        Analysis of the spectra by using software.\n        Option A: MetaboAnalyst.\n        \n            Enter\n            https://www.metaboanalyst.ca/[href=https://www.metaboanalyst.ca/]\n            in the address bar of the browser and click on the Statistical\n            Analysis button on the corresponding website.\n          \n            Upload the files, choose Data Type: spectral bins; Format: samples\n            in columns (unpaired); Data file: .csv.\n          \n            Check data integrity to ensure that the data meets the basic\n            requirements for meaningful downstream analysis.\n          \n            Low-quality data filtering. Select the default “Interquartile range\n            (IQR)” and click the Process button.",
    "Select “Normalization by sum” for sample normalization. After\n            normalization, click the Proceed button.\n            \nNote: MetaboAnalyst is a\n              comprehensive Web application for metabolomic data analysis and\n              interpretation. It provides a variety of data processing and\n              normalization procedures and supports a number of data analysis\n              and data visualization tasks using a range of univariate and\n              multivariate methods, such as PCA, heatmap clustering, and machine\n              learning methods. The software was carefully designed to enable\n              researchers with little statistical or computational background to\n              perform complex data analysis procedures commonly used in\n              metabolomic studies.\n            \n            Click the Submit button to proceed to the Data Analysis Exploration\n            page. The user can choose the preferred mathematical method.\n            \n                Choose one of the major analysis categories (univariate\n                analysis, multivariate analysis, significant feature\n                identification, cluster analysis, and classification &\n                feature selection).\n              \n                Choose one of the subcategories containing individual methods.\n                The most particular approaches useful for clustering are PCA and\n                dendrogram, which are listed under the Multivariate Analysis\n                category, and heatmaps, which is listed under the Cluster\n                Analysis category.\n              \n            Click Download to generate a .pdf report (Analysis_Report.pdf).\n            \nCritical: In general, we\n              recommend using the dendrogram view first.\n            \nNote: If not successful, check\n              problems 8[href=https://www.wicell.org#sec6.15] and 9[href=https://www.wicell.org#sec6.17] in\n              troubleshooting[href=https://www.wicell.org#troubleshooting] section.\n            \n        Analysis of the spectra by using software.\n        Option B: Home-made tool.\n        \nNote: Discrimination by FTIR\n          spectroscopy can also be achieved by combining it with supervised\n          learning methods. Here, we also give a feed-forward three-layer ANN\n          method: the information propagates from the input layer, through the\n          hidden layers, to the output layers. During the iterative training\n          process, the connection weights (numbers of inputs and hidden neurons)\n          are automatically adjusted until the global error is minimized.16[href=https://www.wicell.org#bib16]\n          We provide this home-made tool for ANNs in the\n          supplemental information[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2585-Mmc1.pdf]\n          section (Data S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2585-Mmc2.zip]).\n        \n            Install Python and the related packages.\n            \nNote: Put the data and script into",
    "the same folder (the data set should be in .csv format and\n              compatible with MetaboAnalyst).\n            \n            Open the given script. According to the script prompt, enter the\n            name of the “data_set” and “unknown_data” in the corresponding\n            location.\n          \n            Run program. The the running interface of the script were shown in\n            Figure 5[href=https://www.wicell.org#fig5]. The ANN model will be trained and\n            validated using the “data_set” and the “unknown_data” will be\n            identified by the model.\n            \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2585-Fig5.jpg\n                  Figure 5. The running interface of the ANN script\n                \nOptional: In commercial\n              software (such as IR biotyper), data analysis and collection are\n              closely related. Usually, after data collection, the software can\n              automatically analyze and provide results without too much\n              intervention.\n            \n        Analysis of the spectra by using software.Option C: Commercial software\n        (such as IR biotyper or OPUS) that supports multivariate analysis of\n        spectral data.\n        \n            First, set relative information about the strains.\n            \nSelect or add species name;\n                add isolate labels (only one label can be added to isolates);\n              \n                input incubation protocols in the software (incubation time,\n                temperature, incubation medium);\n              \n                set the preparation protocols. Spectra can be compared only if\n                the same preparation protocol was used. The protocol consists of\n                a name, the suspension medium, such as sterilized distilled\n                water, 0.9% NaCl, or 35% ethanol aqueous solution, and a\n                description. The user can also attach a standard operating\n                procedure (SOP).\n              \n                acquisition methods, strain typing methods (we always use\n                Euclidean distance metric);\n              \n                set exploration methods. Various exploration methods can be\n                chosen in IR Biotyper, and the user can add other algorithms.\n                Generally, Euclidean-ward’s algorithm method comprising\n                agglomerative hierarchical clustering using Euclidean distances\n                for distance matrix calculation and Ward’s method as the\n                clustering method is almost always used;\n              \n            Set relative information about the sample plate, the background\n            position, and the test standard position;\n          \n            Set the Data file path, including IR data directory, IR acquisition",
    "control, stage calibration file, and quality test method;\n          \nAdd the sample position to a table;\nLoad a target plate into the IR spectrometer;\n            Go to the test standard position on the IR plate. Measure the\n            standard sample to ensure the instrument is prepared for testing;\n          \nStart measuring samples;\n            For bacterial typing, the spectra with good quality are selected as\n            one project. Select the typing method or add the typing algorithm.\n            Then press ‘Run.’ The results appear for all FT-IR spectra. For\n            graphical correlations, an average statistical algorithm is\n            implemented in the IR Biotyper software. IR Biotyper can provide\n            visualization tools, such as dendrogram and distance matrix (see\n            supplemental information[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2585-Mmc1.pdf],\n            Figures S3[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2585-Mmc1.pdf]\n            and\n            S4[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2585-Mmc1.pdf]). The user can choose the visualization tools and output the\n            visualization result under specified path.\n          \n        Analysis of the spectra by using software. Optional D: Matlab.\n        \nNote: Matlab can also be employed for\n          the genetic algorithm and successive projection algorithm.23[href=https://www.wicell.org#bib23],26[href=https://www.wicell.org#bib26],27[href=https://www.wicell.org#bib27],28[href=https://www.wicell.org#bib28] Here, we give an example of a\n          Matlab script for library construction and bacterial predication. This\n          Matlab script were provided in the\n          supplemental information[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2585-Mmc1.pdf]\n          section (Data S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2585-Mmc3.zip]), and the the running interface of the Matlab script were shown in\n          Figure 6[href=https://www.wicell.org#fig6].\n        \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2585-Fig6.jpg\n              Figure 6. The running interface of the Matlab script\n            \n            Put “Features.csv” (characteristic-feature-data files of a series\n            bacteria) and “buildlib.m” in the same directory.\n          \n            Run the script in Matlab to construct a reference library file\n            (e.g., “lib.csv”).\n          \n            Set the input and output file names by modifying the corresponding\n            variable in “buildlib.m”. The library should include a high range of\n            taxonomic units covering a large scope of taxonomic diversity,\n            similar to that found in the unknown samples. A minimum number of\n            spectra (10) belonging to each taxonomic unit should be included.\n          \n            The characteristic-feature-data file of unknown bacteria is created\n            (unknown.csv) using the same feature extraction method.",
    "The distance is measured by another Matlab script (dosearch.m). Put\n            “unknown.csv”, “lib.csv”, and “dosearch.m” in the same directory.\n            Specify the input file (“unknown.csv”), library file (“lib.scv”),\n            and output score file (e.g., “scores.csv”) in the script, and then\n            run “dosearch.m” in Matlab to obtain the statistical distance\n            between the unknown spectrum and reference spectra in the library.\n            The scripts are described in the\n            supplemental information[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2585-Mmc1.pdf].\n          \n            Score and prediction. Similarity scores are recorded in the output\n            file (“scores.csv”). Each score is a metric of the distance between\n            the unknown and reference spectra. A higher score indicates greater\n            similarity, and the highest matching scores and related spectra in\n            the library are selected as the final results among all of the\n            comparisons between the unknown spectrum and the spectra in the\n            library.\n            \nCritical: The score derived\n              from the distance indicates the similarity between the unknown and\n              known bacteria. The similarity between the unknown and known\n              bacteria can be calculated by a distance measure algorithm, most\n              commonly the Pearson correlation coefficient.45[href=https://www.wicell.org#bib45],46[href=https://www.wicell.org#bib46],47[href=https://www.wicell.org#bib47] A higher score means a shorter distance\n              and will be obtained when the values in each pair are closer. ”"
  ],
  "subjectAreas": [
    "Bioinformatics",
    "Health Sciences",
    "Cell Culture",
    "Cell Biology",
    "Microbiology",
    "Biophysics"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology"
  ]
}