{
  "id": 19128,
  "origin_website": "Jove",
  "title": "Induction of Myocardial Infarction in Adult Zebrafish Using Cryoinjury",
  "procedures": [
    "1. Equipment Set-up\nThe main tool used to perform cryoinjury is the cryoprobe, the pen-like instrument that is made of stainless steel (Figure 1A). The cylindrical handle is 40 mm long and has a diameter of 8 mm. The tip of the applicator is 6 mm long and 0.8 mm of diameter. The junction between the tip and the handle is conical 4 mm long. In addition, the handle of the cryoprobe should be isolated with a plastic tube and tape to avoid frostbite of the fingers while holding the tool during the procedure.\nOther materials that are needed for the cryosurgery are a stereomicroscope, sharp forceps, micro dissecting spring scissors and a plastic transfer pipette. In addition prepare a beaker for anesthetizing the fish and a plastic spoon for transferring the fish.\nDuring the surgery, the fish are placed on a moist sponge with its ventral side up (Figure 1B). To hold the animal in a stable procedure, an appropriate groove should be manually cut in the sponge.\nPrepare a tank with system water to transfer the fish after the surgery.\nSet up a double timer first with a 10 second countdown and then automatically a 24 second countdown.\n2. The Cryoinjury Procedure\nCool down the cryoprobe by immersing the tip in 3-5 cm of liquid nitrogen for at least 3 min.\nAnesthetize an adult zebrafish by immerging it in 0.02% tricaine until the fish turns on its back and its gills almost stop moving (approximately 90 seconds).\nTransfer the fish with a plastic spoon to a moist sponge that has been cut to hold a fish upside down (Figure 1B). Hold fish steady with forceps using non-dominant hand. Visually locate the posterior medial margin of the heart and use straight iridectomy scissors to puncture the skin. (Figure 1C).",
    "Make a small (approx. 2 mm) incision above the heart by cutting straight anteriorly through the skin, muscles (Figure 1D). Do not cut through the bony branchial apparatus, as this will kill the animal.\nGently tear the silvery epithelial layer of the hypodermis (Figure 1E) with the tip of the scissors to have a direct access to the beating ventricle. Do not insert the scissors deeper in the body cavity, as this will puncture the heart. The beating heart should be well visible, and no extensive bleeding should occur during the thoracotomy (Figure 1F).\nStart the programmed timer that has been set for 10 seconds followed by 24 seconds. During 10 seconds take out the cryoprobe from the liquid nitrogen. Make sure that there is no more nitrogen on the cryoprobe by shaking it gently. Spread the incision laterally using forceps to open the chest (Figure 1F).\nOnce the timer rings 10 seconds, touch immediately but gently the ventricle with the tip of the pre-cooled cryoprobe (Figure 1G).\nOnce the timer rings 24 seconds, pour 2-3 mL of system water using a plastic pipette onto the chest to release the cryoprobe from tissue, and transfer the fish into the tank with system water.\nThe fish should restart breathing after a few seconds, and then it should resume swimming. If it doesn't breathe after around 45 seconds, stimulate the animal by squirting water into the gills with a plastic pipette until it starts breathing by itself. In our experience, 95% of the fish survive surgery, and all deaths occur on the day of surgery. It will not be necessary to suture incisions.\n3. Heart Collection and Fixation\nPrepare 1 mL of 2% formalin in a microcentrifuge tube for fixing the heart, two forceps, micro-dissecting scissors and the moist slotted sponge.",
    "At the selected day after cryoinjury, euthanize the fish in 0.1% tricaine for 5 minutes.\nPlace the fish ventral side up into a moist, slotted sponge. Make a large (approx. 4 mm) incision above the heart through the branchial cartilage with the micro dissecting scissors. Open widely the incision with forceps (Figure 1H).\nPinch off the bulbus arteriosus, a white structure anterior to the ventricle (Figure 1 H-I), and remove the heart from the cavity by pulling it. A whole dissected heart is shown in Figure 1J and Figure 2A.\nPlace up to 3 hearts into a microcentrifuge tube with 1 ml of 2% formalin. Gently turn the tube several times and keep it overnight at 4 °C.\n4. Heart Mounting\nRinse the hearts in PBS for 5 minutes. Transfer the hearts into 10 mL of 30% sucrose that should be pre-cooled at 4 °C, and mix gently. The specimen should initially float at the surface of sucrose solution. Continue incubation for 1 hour 20 minutes at 4 °C. After this time, the hearts will sink to the bottom of the tube.\nPrepare a box with dry ice. Take an embedding mold, and pour a 5 mm layer of O.C.T. mounting medium at the bottom of the mold.\nWith forceps place the heart into the O. C. T mounting medium in the mold. Under the stereomicroscope, adjust the orientation of the specimen to achieve the ventricular apex on the bottom of the mold, and the bulbus arteriosus towards the top.",
    "Place the molds with specimen on dry ice. When the mounting medium begins to freeze, fill up the rest of the mold with O.C.T. medium and let it freeze completely. Keep the mold for at least 1 h at -80 °C before sectioning. The frozen specimen can be stored for many months at -80 °C.\n5. Hearts Sectioning\nSet up a cryostat with a cutting size of 16 μm, a chamber temperature of -24 °C and the temperature of the specimen at -22 °C.\nPlace the frozen block with the specimen in the cryostat and fix its orientation to begin cutting parallel to the bottom of the block.\nPrepare six Superfrost-plus slides per one block and numerate them from 1 to 6. Start cutting until the tissue is reached, and trim the block around the specimen with a razorblade.\nTo obtain 6 replicates of one heart, take up the first section on slide 1, the second section on slide 2, the third on slide 3, etc. Once you placed the sixth section on slide 6, restart with slide 1 and continue until the whole organ is cut. Collect two rows of around 8 sections on the slide (Figure 3).\nLet the slides dry for 1 hour at room temperature. Store them for up to 1 year in tightly closed boxes at -20 °C.\n6. Representative Results\nRepresentative cardiac injury following this protocol is shown in dissected whole hearts at 4 dpci (days post cryoinjury; Figure 2D-F). To visualize the myocardial tissue in vivo, we used transgenic fish expressing EGFP and nuclear DsRed2 under the control of cardiac-specific cmlc-2 promoter11,12. The absence of EGFP and DsRed2 fluorescent signals demarcated a disc-shaped infarct zone along the apical-lateral ventricular wall.",
    "To perform cellular and molecular analyses of the tissue, the hearts were fixed and sectioned with a cryostat. A representative slide with a consecutive series of transversal heart sections is shown in Figure 3.\nThe sections can be analyzed with various methods (Figure 4). To determine the extent of heart regeneration versus scarring, we performed histological analysis using Acid Fuchsin Orange-G (AFOG) staining, which differentially labels cardiac and fibrotic tissues9. The gene expression analyses were achieved according to the in situ hybridization procedure13. To detect the distribution of marker proteins, we applied immunofluorescence assay with specific antibodies9. A combination of diverse staining procedures leads to the identification of molecular and cellular mechanisms involved in cardiac regeneration following cryoinjury.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3666/3666fig1.jpg",
    "Figure 1.  Inducing cryoinjury of the ventricle in the adult zebrafish. (A) A photograph of the cryoprobe. (B) An adult zebrafish is placed in the slit of the sponge with its ventral side up. (C-F) Chest incision to access the heart. (C) A small cut through the skin and muscles is made between the two pectoral fins (red line). (D) The scissors are inserted into the incision to cut the skin following the red arrow. (E) Underneath the skin, the fine layer of silvery hypodermis (encircled by blue dashed line) is gently opened to access the heart. (F) The incision is spread with the forceps and the beating ventricle (green arrow) is accessible for cryoinjury. (G) The cold cryoprobe is gently inserted into the chest to touch the heart. (H-J) Heart collection. (H) A deep and long incision is made through the branchial arches of the chest to access the pericardial cavity. Two heart structures are visible: bulbus arteriosus (white arrow) and ventricle (green arrow). (I) The bulbus arteriosus is hold with forceps and pulled out from the body cavity. (J) The entire heart is excised from of the body.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3666/3666fig2.jpg\nFigure 2.  Representative control and cryoinjured hearts dissected from adult transgenic zebrafish expressing EGFP and nuclear DsRed2 in cardiomyocytes. (A-C) Uninjured heart. (A) The dark field illumination shows the ventricle (V), bulbus arteriosus (Ba, white) and the valves (Va), where the atrium was linked to the ventricle. (B and C) Fluorescent images of the intact ventricle display EGFP and DsRed2 expression in cardiomyocytes. (D-F) Heart at 4 days post cryoinjury (4 dpci) (D) The dark field illumination reveals a disc-shaped infarct (yellow dashed line). (E-F) Cardiomyocyte markers EGFP and DsRed2 are not detected in the infarct area, indicating the damaged myocardium (encircled by dashed line).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3666/3666fig3.jpg",
    "Figure 3.  Sectioning of the heart. (A) Whole heart with the drawing of transversal sections starting from the bottom of the heart (1 and 2, in red) towards the top of the heart (3 and 4 in green). (B) Photography of a slide with the series of consecutive transversal sections stained with AFOG (Acid Fuchsin Orange-G). The first sections (1 and 2, red squares) contain the ventricular apex, and the last sections of the heart (3 and 4, green squares) comprise bulbus arteriosus.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3666/3666fig4.jpg\nFigure 4.  Examples of analysis performed on heart sections at 7 days post cryoinjury. (A) AFOG (Acid Fuchsin Orange-G) staining labels healthy muscle cells in orange, the scar tissue containing collagen in blue and fibrin in red. (B) In situ hybridization of ventricular myosin heavy chain (vmhc) mRNA visualizes the intact myocardium (blue staining). The injured tissue is devoid of the cardiac gene transcript (red dashed line). (C) Immunoassaying of Tropomyosin (green) labels intact cardiomyocytes and not damaged tissue (encircled with the dashed line). DAPI (blue) stains the nuclei of all the cells. (D) Genetically labeled cardiomyocytes express DsRed2 (red) in their nuclei. DAPI (blue) labels all the nuclei. The infarct zone does not contain DsRed2-positive cells (white dashed line)."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}