{
  "id": 13503,
  "origin_website": "Jove",
  "title": "Derivation of Stem Cell Lines from Mouse Preimplantation Embryos",
  "procedures": [
    "The use of the animals described in the sections below has been approved by the Ethics Committee on Animal and Human Research of the Universitat Autònoma de Barcelona and by the Departament d'Agricultura, Ramaderia, Pesca i Alimentació of the Generalitat de Catalunya (protocol #8741).\n1. Feeder Cell Inactivation and Storage\nNOTE: Human foreskin fibroblasts (HFF-1) were previously frozen in 1 mL of freezing solution consisting of 90% Fetal Bovine Serum (FBS) and 10% dimethyl sulfoxide (DMSO) and stored in liquid nitrogen until use.\nThaw a cryogenic vial of HFF-1 (1 mL) by immersing the vial in a 37 °C water bath.\nAdd the thawed contents of the cryogenic vial to pre-warmed Dulbecco's Modified Eagle's Medium (DMEM) supplemented with 10% FBS to make a 1:10 dilution.\nSeed the diluted cells (10 mL) in a T75 flask and culture them at 37 °C and 5% CO2.\nThe next day, change the medium to eliminate the DMSO remnants. Remove the medium and add 10 mL of pre-warmed DMEM supplemented with 10% FBS.\nCulture the HFFs and change the medium every 48 h until the culture reaches the confluent stage. This may take approximately 7 to 10 days.\nTo prepare the inactivation solution, dilute mitomycin C in DMEM supplemented with 10% FBS at a final concentration of 10 µg/mL. Incubate the cells with the inactivation solution for 3 h at 37 °C and 5% CO2.\nRemove the inactivation solution and rinse the cells thrice with 2 mL of Hanks Balanced Salt Solution (HBSS) to eliminate mitomycin C remnants.\nTo detach the inactivated cells, add 1 mL of pre-warmed Trypsin-EDTA solution and incubate for 5 min at 37 °C and 5% CO2.",
    "Observe the cells under an inverted microscope to ensure they are detached (10x objective with 0.3 numerical aperture or NA). If they are not, incubate them for a couple more minutes at 37 °C and 5% CO2. Check the cells again under the inverted microscope.\nPipette the solution with a Pasteur pipette in order to dissociate the cell clumps.\nNeutralize the enzymatic solution by adding 4 mL of DMEM supplemented with 10% FBS and resuspend.\nTake an aliquot of the cell suspension and make a 1:100 dilution in HBSS. To determine the number of cells, load 10 µL of the dilution into a Neubauer's chamber. Count the cells located in one of the big squares of the chamber under an inverted microscope (20x objective with a 0.45 NA).\nRepeat the counting in a total of four big squares. Calculate the total number of cells (N) as N = average number of cells counted x total volume x dilution x 104.\nCentrifuge the rest of the sample for 5 min at 200 x g. Discard the supernatant and resuspend the pellet with freezing solution at a concentration of 106 cells per mL.\nAliquot the suspension in cryogenic vials with 106 cells (1 mL) each. Place the cryogenic vials in a freezing container and freeze at -80 °C.\nThe next day, store the cryogenic vials in liquid nitrogen.\n2. Feeder Cell Culture\nOne to four days before starting the derivation process, thaw a cryogenic vial containing 1 x 106 inactivated HFF-1 cells in a water bath at 37 °C.\nMake a 1:6 dilution of the thawed HFF-1 in pre-warmed DMEM supplemented with 10% FBS and keep the temperature at 37 °C.",
    "Fill every well of a 4-well plate with 500 µL of pre-warmed 0.2% gelatin from porcine skin and keep the plate at 37 °C for 10 min.\nRemove the 500 µL of gelatin from the wells and add 500 µL of the HFFs dilution. Gently rock the plate to ensure a uniform distribution of the HFFs on the bottom of the wells. Avoid circular movements, otherwise the cells will concentrate at the center of the well.\nIncubate the plate at least 24 h at 37 °C and 5% CO2 to obtain a monolayer of inactivated HFFs in each well.\nThe next day, observe the cells under an inverted microscope (10X objective with 0.3 NA) and check that they are attached and homogeneously distributed. Change the medium to eliminate the DMSO remnants. Remove the medium and add 500 µL of pre-warmed DMEM supplemented with 10% FBS.\n3. Embryo Collection and Culture\nFour days before embryo collection, administer 5 IU of pregnant mare's serum gonadotropin by intraperitoneal injection to 6-12 week old female mice.\n\tNOTE: We have used females from the 129S2 or B6CFAF1 strains, though females from other mouse strains can be used. Nevertheless, when working with females from non-permissive strains (e.g. CBA), medium should be supplemented with 2i as mentioned in step 4.2.\nAfter 48 h, administer 5 IU of human chorionic gonadotropin by intraperitoneal injection, and mate the females with males, at least 8 weeks old, at a 1:1 ratio. Separate the females from the males the next day.",
    "The day before embryo collection, prepare a 35-mm cell culture Petri dish with several 40 µL drops of KSOMaag medium supplemented with 4 mg/mL Bovine Serum Albumin (BSA) and fill the plate with mineral oil to fully cover the drops. Incubate the dish at 37 °C and 5% CO2 to equilibrate the medium.\nTo prepare embryo manipulation pipettes, heat the thinner part of a long-tipped glass Pasteur pipette using a Bunsen burner. Once soft, withdraw it from the flame and pull the two ends apart. Break it to the desired length. The inner diameter at the tip should be 100-150 µm.\nEuthanize the female mice by cervical dislocation 45-48 h post-coitum (p.c.).\nDissect the mice to expose the abdominal cavity by cutting the skin with curved smooth sharp scissors and the peritoneum with straight sharp scissors. Grab one uterus with forceps, cut off the oviduct using straight sharp scissors, and place it in Hepes-buffered CZB medium (HCZB)13 at 37 °C. Repeat the process to remove the other oviduct.\nFlush the oviducts with a 1 mL syringe loaded with HCZB held in place by watchmaker forceps to collect the 2-cell embryos.\n\tNOTE: To prepare the flushing needle take a 30 G hypodermic needle, cut the end, and ground to a blunt tip on an abrasive stone.\nUsing the mouth pipette apparatus, pick up the embryos, wash them in HCZB and culture them in the previously prepared embryo culture dish at 37 °C and 5% CO2 until the blastocyst stage. Up to 50 embryos can be cultured in each 40 µL drop. Monitor embryo development every 24 h under a stereomicroscope.",
    "NOTE: Alternatively, embryos can be collected at the blastocyst stage to shorten in vitro embryo culture. In this case, euthanize the females at day 3.5 - 4.5 p.c., dissect the uterus. and flush it with HCZB.\n4. Stem Cell Derivation\nPreparation of the derivation plates\nOn the day of embryo seeding, prepare the derivation medium by supplementing DMEM medium with 100 µM 2-β mercaptoethanol, 1x Non-Essential Amino Acids, 20% of serum replacement, and 103 U/mL LIF.\nIf desired, also add 1 µM of the MEK inhibitor PD0325901 and 3 µM of the GSK3 inhibitor CHIR99021 to obtain a 2i medium.\nTake the 4-well plate with the monolayer of inactivated HFFs (step 2.6) from the incubator. Remove the medium and add 800 µL of pre-warmed derivation medium to each well. Return the plate to the incubator.\nZona pellucida removal and embryo seeding\nPrepare a 35 mm cell culture Petri dish with three 30 µL drops of acidic Tyrode's solution14 and three 30 µL drops of derivation medium. Cover the drops with mineral oil and keep the dish at 37 °C.\nTake the embryo culture dish from the incubator. One by one, transfer the blastocysts from the culture drops to an acidic Tyrode's solution drop using an embryo manipulation pipette. If possible, select only the expanded blastocysts to start the derivation process.\nMonitor the zona pellucida digestion under the stereomicroscope. As soon as the zona pellucida disappears, transfer the blastocyst to a derivation medium drop in order to wash out the acidic Tyrode's solution.\nTake the 4-well derivation plate from the incubator and seed one zona-free blastocyst on the feeder cells in each well.\nReturn the 4-well derivation plate to the incubator and culture at 37 °C and 5% CO2.\nMonitoring stem cell growth and medium change",
    "Monitor the cultures every 24 h under an inverted microscope (20X objective with 0.45 NA). It is important to note whether there are signs of stem cell differentiation, such as swollen refractive cells surrounding the outgrowth or even pushing the feeder cells aside.\nEvery other day, change the medium of the culture. Take the 4-well plate from the incubator, remove the medium from each well, and add 800 µL of pre-warmed derivation medium supplemented with LIF and 2i, if used. Maintain the culture until outgrowths are observed (6-8 days).\n5. Stem Cell Culture and Maintenance\nPrepare Kolle-like handles and stem cell manipulation pipettes. Follow step 3.4 to prepare stem cell manipulation pipettes with an inner diameter at the tip of 250-300 µm. Use the other part of the pulled Pasteur pipette to prepare the Kolle-like handle. Heat and shape it until obtaining a hook.\nTake the 4-well culture plate out of the incubator and locate the outgrowth under a stereomicroscope. Use the handle to push away the differentiated cells and the feeders that surround the outgrowth.\n\tNOTE: To avoid eventual differentiation of the outgrowth, it is important to remove all the differentiated cells from the edge of the outgrowth.\nAspirate the outgrowth with a stem cell manipulation pipette and place it in a new dish in a 50 µL trypsin-EDTA drop.\nUse a scalpel to cut the outgrowth in several parts in order to disaggregate it both mechanically and enzymatically.\nStraight away, transfer the outgrowth fragments into a fresh drop of derivation medium to neutralize trypsin action.\nTransfer the outgrowth fragments to a new 4-well plate with a monolayer of feeders. Transfer up to 10 fragments per well and culture them with derivation medium at 37 °C and 5% CO2.",
    "Maintain the stem cell-like cultures for at least six weeks before considering the mESC line established. Change the medium every other day and subculture them once a week.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}