{
  "id": 2390,
  "origin_website": "Cell",
  "title": "Protocol for generation of human peptide-specific primary CD8+ TÂ cell lines",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThis method describes the generation of a CD8+ T cell line against the HLA-B∗07:02 restricted SARS-CoV-2 SPR peptide using PBMCs from a healthy HLA-B∗07:02+ individual.\nPeptide stimulation of PBMCs to establish CD8+ T cell lines\nIn this step, PBMCs are stimulated with the peptide of interest, in this case the HLA-B∗07:02-restricted SPR peptide, to begin the activation and proliferation of peptide-specific CD8+ T cell for the establishment of peptide-specific CD8+ T cell lines. All work should be undertaken in a Class II Biohazard cabinet to prevent contamination.\nDay 0\nTiming: 3–3.5 h\nThaw and prepare PBMCs derived from a healthy HLA-B∗07:02+ donor.\nThaw 3 × 106–1 × 107 cryogenically frozen PBMCs per CD8+ T cell line into 9 mL pre-warmed RF10 in a 10–15 mL tube.\nWarm the cryovial in a 37°C water-bath until half of the cells are thawed.\nUsing a transfer pipette, add a small amount of pre-warmed media from your tube into the cryovial to thaw the remaining cells, then transfer everything into your tube.\nNote: Aim to use between 3 × 106 and 1 × 107 PBMCs per CD8+ T cell line.\nNote: Cells are typically cryogenically frozen in media containing 10% DMSO, which prevents the formation of ice that would shear up the membrane of the cells during the freezing and storing process. Once thawed, DMSO can be toxic to cells, so it is important to work quickly to get cells into pre-warmed FCS containing media to prevent cell death.\nAlternatives: Freshly isolated PBMCs can also be used by harvesting into a 10 mL tube and topping to 10 mL with pre-warmed RF10 media.\nCentrifuge tubes to pellet cells, 600 × g, for 5 min at 20°C–25°C is sufficient to pellet cells.\nRemove supernatant by decanting.",
    "Decant by pouring in a single swift motion to prevent losing your cell pellet.\nResuspend cells in 10 mL R0 and take a small aliquot (∼20 μL) into an Eppendorf tube or 96 well plate for cell counting.\nNote: FCS is thought to perhaps interfere with peptide presentation, therefore this wash in FCS free media is important to remove any remaining FCS from the thawing and first wash step.\nCentrifuge tubes 600 × g for 5 min at 20°C–25°C to pellet cells.\nWhile cells are spinning, perform a cell count using the trypan blue exclusion method and a Neubauer hemocytometer.\nAlternatives: Any manual or machine-assisted cell counting methods that can quantify the number of live cells can be used.\nRemove supernatant by decanting.\nResuspend PBMCs in 300 μL R0.\nAiming to use 3 × 106 and 1 × 107 PBMCs per CD8+ T cell line, resuspend PBMCs in 300 μL R0 for each CD8+ T cell line, so 600 μL for two CD8+ T cell lines, 900 μL for three CD8+ T cell lines etc.\nPrepare the stimulators.\nNote: One third of your PBMCs become your stimulators (Figure 1[href=https://www.wicell.org#fig1]). These are then peptide pulsed, and since all nucleated cells present HLA-I on their cell surface, they have the potential to present the peptide at their cell surface. Upon exposure to the responders, CD8+ T cells in the responder fraction become activated, the stimulators are likely to be killed off. Therefore, peptide pulsing and “sacrificing” just a fraction of your PBMCs as stimulators, rather than just adding peptide into all of the cells, can result in less overall cell death.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1877-Fig1.jpg\nFigure 1. Theory behind the expansion of peptide-specific CD8+ T cells from PBMCs",
    "Peptide-specific CD8+ T cells are at low frequency within PBMCs, therefore to increase their frequency above the limit of detection and prime them for functional assays, they can be expanded in vitro. PBMCs, which contain a range of cells including but not limited to Macrophages, Dendritic cells, T cell and B cells, are split into 1/3 stimulators and 2/3 responders. The stimulators are peptide pulsed with the peptide of interest and subsequently co-cultured with the responder fraction. Over time, peptide-specific CD8+ T cells grow in size, and proliferate, while other cells dye off, thereby increasing the relative frequency of the peptide-specific cells of interest.\nRemove 100 μL (1/3 of 300 μL) into a new 10 mL tube to become stimulators.\nAdd 1 μL of 1 mM SPR peptide stock to the tube, resulting in a final concentration of 10 μM of peptide in the tube.\nNote: Peptide pulse up to 3 × 106 cells in 100 μL (1/3 of a starting number of 1 × 107 PBMCs), if you are using more cells to generate larger CD8+ T cell lines, scale up the volume and amount of peptide added accordingly, keeping the same final concentration of peptide as 10 μM.\nAlternatives: We have set up CD8+ T cell lines with as little as 1 μM of peptide, but 10 μM for individual peptides results is our most common approach as it is well used in the literature and results in robust and reproducible results.",
    "Alternatives: You can stimulate PBMCs with pools of peptide rather than individual peptides. We have published concentrations of peptide from as low as 2 μM per peptide (Szeto et al., 2021[href=https://www.wicell.org#bib9]), and up to 10 μM per peptide (Grant et al., 2018[href=https://www.wicell.org#bib2]), with many other concentrations found in the literature. For optimized results it is best to test various concentrations for your specific work.\nMix well by vortexing for 5 s.\nIncubate for 90 min at 37°C with 5% CO2, keeping lids loose (not sealed tightly but still closed to prevent contamination) to permit CO2 exchange.\nProceed immediately to step 3 once your incubation has begun.\nPrepare the responders.\nDuring the 90 min incubation (step 2), plate out the remaining 200 μL of PBMCs, or 2/3, (from step 1) into a single well of a flat bottom tissue culture grade plate.\nUse a 48 well plate for CD8+ T cell lines with a starting number of 3–5 × 106 PBMCs.\nUse a 24 well plate for CD8+ T cell lines with a starting number of 1 × 107 PBMCs.\nNote: If setting up CD8+ T cell lines with a starting number of more than 1 × 107 PBMCs, but less than 2 × 107 PBMCs, start with a 24 well plate and assess cell density for overcrowding daily (for more details, see step 6). If setting up CD8+ T cell lines with a starting number of more than 2 × 107 PBMCs, consider starting with a 12 well plate, and assess your cell density for overcrowding or sparsity (see step 6 for more details) daily.",
    "Note: If setting up multiple CD8+ T cell lines and therefore using multiple wells of the tissue culture plate, use wells towards the middle of the plate as these tend to be subject to less evaporation.\nNote: If setting up multiple CD8+ T cell lines and therefore using multiple wells of the tissue culture plate, consider spacing them out on the plate in case of any unexpected splashes which may cause media to enter an adjacent well.\nTop well with RF10 until the well is approximately half full.\nLeave cells to rest until step 5, at 37°C with 5% CO2.\nNote: If using multiple plates, label both the base (on the side) and the lid of the plate, or draw a line down the plate in different colors or positions so they can be easily matched (Figure 2[href=https://www.wicell.org#fig2]) in case several lids are off at once.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1877-Fig2.jpg\nFigure 2. Tips for labeling tissue culture plates so that lids can be matched to their base\nIn the instance you have multiple tissue culture plates in use, it is worth making sure that the lid and base of the plates can be matched in case several lids are off at once. A simple way to do this is to use a marker and draw a line down the plate. This can be done in different colors or in different positions, allowing the correct lid to be matched to the correct base quickly and easily. Alternatively, you can label both the lid and the side of the plates with an appropriate identifier.\nFinish preparing your stimulators.",
    "Note: These wash steps remove excess unbound peptide so that it can’t be bound by your “responder” fraction when added together, ensuring only the stimulators are presenting peptide. Since FCS is not useful at this stage, using R0 is best to prevent wasting FCS.\nAdd 10 mL of R0 to your stimulators.\nCentrifuge tube 600 × g for 5 min at 20°C–25°C to pellet cells.\nRemove supernatant by decanting.\nResuspend cells in another 10 mL of R0.\nCentrifuge tube 600 × g for 5 min at 20°C–25°C to pellet cells.\nRemove supernatant by decanting.\nResuspend stimulators in 50 μL RF10.\nAlternatives: Although we typically resuspend our stimulators in 50 μL, you can resuspend them in any volume that will fit within the wells containing your responders, which are approximately half full as per step 3b. By the end of this protocol, all wells will be topped up with media (step 5d), therefore the exact volume doesn’t matter at this stage. If you resuspend your cells in more media, you will simply add less media in the top up step (step 5d).\nMix your stimulators and responders together.\nAdd the 50 μL of stimulators into the tissue culture plate into the half-full wells (step 3b) containing your responders.\nMix gently by pipetting.\nTop wells with RF10.\nNote: Do not fill the wells to the brim, leave 2–3 mm free at the top of the well to prevent splashing of media onto the lid of the plate when the plate is moved around.\nIncubate plates at 37°C with 5% CO2 4 days.\nFirst half media change of CD8+ T cell lines",
    "This step is to allow for fresh media replacement, as well as adding IL-2 to assist in the growth of the CD8+ T cell lines. All work should be undertaken in a Class II Biohazard cabinet to prevent contamination.\nDay 4\nTiming: 30–45 min\nAlternatives: Although we typically do this on day 4, if media in the CD8+ T cell line is already starting to change color (compared to the RF10 used when setting up the CD8+ T cell lines), this step can be performed on day 3.\nHalf media change of your cultures.\nPrepare some pre-warmed RF10 containing 20 IU/mL recombinant human IL2 (rIL2).\nRemove plate carefully from the incubator to prevent splashing.\nLook at your cells under a microscope, typically a 10× objective is sufficient, making note if your cells look particularly sparse (Figure 3[href=https://www.wicell.org#fig3]Ai) or overcrowded (Figure 3[href=https://www.wicell.org#fig3]Aii).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1877-Fig3.jpg\nFigure 3. Microscope images of CD8+ T cell lines\nHLA-A∗02:01 restricted M158-specific CD8+ T cells were expanded from a HLA-A∗02:01+ individual as per the protocol described in this manuscript. Images were taken on a Nikon Eclipse Ti microscope on a ×4,×10 and ×20 objective daily from Day 1 to Day 10.\n(A) Representative photo depicting cells that are too sparse, which can limit interactions between cells which can prevent adequate activation.\n(B) Images demonstrating how cells sometimes preferentially clump around the edges of tissue culture wells, therefore it is important to resuspend and redistribute cells during media changes.\n(C) Representative image of round clumps which can be indicative of peptide-specific proliferation. Scale bars depict 100 μm at the various magnifications.",
    "Critical: Cell density is very important in the first few days of establishing a CD8+ T cell line to ensure that responders are interacting with the stimulators, but that they are not so overcrowded that there is nowhere to proliferate. If your cells are too sparse (step 6c, Figure 3[href=https://www.wicell.org#fig3]Ai) or overcrowded (step 6c, Figure 3[href=https://www.wicell.org#fig3]Aii) see the alternate protocol below.\nNote: You would not typically expect to need to condense or split your cells this early on in the protocol if the recommended cell number is used in the recommended well size.\nUsing a pipette, remove approximately half of the media from the top of the well.\nTake care not to disturb your cells which have settled on the bottom of the well.\nTop the wells (leaving 2–3 mm gap) with fresh pre-warmed RF10 media.\nGently mix the media into the well, resuspending the cells at the same time.\nNote: Cells like to sometimes gather and settle around the edges of wells, while leaving the middle sparser (Figure 3[href=https://www.wicell.org#fig3]B). Mixing helps to redistribute the cells within the well if this has occurred.\nGently measure the volume of media in your well by pipette.\nAdd rIL2 directly into the well for a final concentration of 10 IU/mL and gently mix.\nIncubate plates at 37°C with 5% CO2.\nCheck your cells under a microscope every few days, and more frequently if the cells are looking overcrowded or sparse, typically a 10× objective is sufficient.",
    "Alternatives: If your cells are too sparse (steps 6c/6j, Figure 3[href=https://www.wicell.org#fig3]Ai) consider placing them in a smaller tissue culture grade plate. Remove half of the media as per step 6d. Then, resuspend your cells in the existing media, taking care to resuspend all of your cells from the bottom of the plate thoroughly, and transfer to a smaller well (i.e., if using a 24 well plate, move to a 48 well plate), making note of the volume of your culture. Top the well with RF10, making note of the volume you have added. Then add rIL2 directly at a final concentration of 10 IU/mL.\nAlternatives: If your cells are too overcrowded (steps 6c/6j, Figure 3[href=https://www.wicell.org#fig3]Aii), consider moving the cells into a larger well in a tissue culture plate. Remove half of the media as per step 6d and replace with RF10 as per step 6e. Then, resuspend your cells, taking care to resuspend all of your cells from the bottom of the plate thoroughly, and either transfer to a larger well, or distribute into two wells. Top the well(s) with RF10 media. Gently measure the volume in each well by pipette, and add rIL2 directly into the well for a final concentration of 10 IU/mL.\nSecond half media change of CD8+ T cell lines\nIn this step, we will remove some of the existing media, replacing it with fresh media. All work should be undertaken in a Class II Biohazard cabinet to prevent contamination.\nDay 8 and then twice weekly until used or discarded\nTiming: 30–45 min\nAlternatives: Although this is typically done on day 8, if media in the CD8+ T cell line is starting to change color (compared to the color after the last media change), this step can be performed on day 7.",
    "Critical: Cell density is very important for the continual proliferation and growth of CD8+ T cell lines. If your cells are too sparse (step 7c, Figure 3[href=https://www.wicell.org#fig3]Ai) or overcrowded (step 7c, Figure 3[href=https://www.wicell.org#fig3]Aii) see the alternate protocol below.\nNote: You would not typically expect to need to condense or split your cells this at this stage of the protocol if the recommended cell number is used in the recommended well size. However, if the CD8+ T cells have expanded significantly, or there has been a large amount of cell death, this may be required.\nHalf media change of your cultures.\nRepeat steps 6a to 6f, keeping note of how much fresh RF10 media is added into each well.\nAdd rIL2 for a final concentration of 10 IU/mL of the fresh rIL2 added into your well.\nNote: Your existing media now contains the remaining rIL2, and your new media contains 10 IU/mL rIL2, ensuring that the final concentration of rIL2 within the well remains at approximately 10 IU/mL IL2. If you are concerned about variability in rIL2 concentrations between CD8+ T cell lines, please see the alternative approach below.\nAlternative: If you are concerned about minor differences in the concentration of rIL2 between wells, harvest your CD8+ T cell lines into a 10 mL tube and centrifuge tube at 600 × g for 5 min at 20°C–25°C to pellet cells. Then resuspend cells in RF10 containing 10 IU/mL rIL2 and place them back into their original well.\nGently mix the media into the well, resuspending the cells at the same time.\nNote: Cells like to gather and settle around the edges of wells, while leaving the middle sparser (Figure 3[href=https://www.wicell.org#fig3]). Mixing helps to redistribute the cells within the well.\nIncubate plates at 37°C with 5% CO2 for an additional 3–4 days.",
    "Alternatives: If your cells are too sparse or crowded (step 6c, Figures 3[href=https://www.wicell.org#fig3]Ai and 3Aii) follow the advice as per “Alternatives” in step 6. Make a note of any fresh media added into your wells and add rIL2 so that the concentration with the fresh media is 10 IU/mL rIL2.\nNote: CD8+ T cell lines can be assayed from day 9 or 10, or continue to be grown, if required, by doing a half media change twice weekly. We have grown CD8+ T cell lines until day 21, and in theory they can be grown for longer, however, since these are not immortalized cell lines, they do start dying if subject to extended culture. Therefore, we typically do our first assays from day 10, and try to complete any subsequent assays by day 16 or day 17 where possible."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}