{
  "id": 19879,
  "origin_website": "Wiley",
  "title": "STARR-seq and UMI-STARR-seq: Assessing Enhancer Activities for Genome-Wide-, High-, and Low-Complexity Candidate Libraries",
  "procedures": [
    "Due to the unique location of the candidate fragments within the reporter gene transcription unit of the STARR-seq screening plasmid, each candidate serves as its own barcode, which enables the straightforward and simple cloning of candidate libraries. The transcription unit consists of a core promoter followed by an intron and a reporter gene (ORF, a truncated form of GFP). The candidate fragments are cloned between the ORF and the poly(A) site, i.e., into the 3′UTR of the reporter gene (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-fig-0001] top). For human STARR-seq, we recommend using the second-generation human STARR-seq screening plasmid from Muerdter et al. (2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0022]) (hSTARR-seq_ORI vector; Addgene #99296). Compared to the first-generation human STARR-seq screening plasmid (SCP1 as core-promoter; pSTARR-seq_human; Addgene #71509), this plasmid exhibits strongly improved signal-to-noise levels, as it uses the bacterial ORI as core promoter [see Background Information and Muerdter et al. (2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0022]) for details].",
    "To enable highly efficient library cloning and avoid the cleavage of candidates, we clone the STARR-seq plasmid library by recombination (Gibson assembly is also possible). This requires that the candidate fragments be flanked by constant sequences that match to the plasmid backbone sequences around the insertion site. To ease cloning and the final deep sequencing on the Illumina platforms, we first ligate the Illumina adapters (here we use the NEBNext hairpin-adapters) to randomly sheared and size-selected BAC or genomic DNA or pre-enriched candidate pools. As the Illumina adapter is a Y-shaped adapter (double-stranded on one end), candidates will be ligated in both orientations and will, in the resulting library, be present in both orientations (roughly equimolar). In principle, any source of DNA is applicable (Arnold et al., 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0002]). When using synthesized DNA oligo pools, we recommend including the adapter sequences into the DNA oligos. This allows the PCR amplification of the DNA oligo pool and the directional cloning of all candidates (note that the adapter sequences have to be included directionally, i.e., the P5 adapter sequence at the 5′ end and the reverse-complement P7 adapter sequence at the 3′ end).\nAlso, the length of the candidate fragments can be of a wide range, essentially limited only by cloning efficiencies. We have used fragments between 150 and 1500 bp, and we recommend 1200 to 1500 bp for human STARR-seq. Note, however, that an individual library should only contain inserts of a limited size range of 100 to 300 bp around the desired fragment length, as the various amplification and deep sequencing steps can distort the length distribution. Note that the source of DNA, i.e., the input material for the library insert, is the major determinant of library complexity.",
    "The adapter-ligated DNA is then PCR amplified using primers that bind to the Illumina adapters (constant part of the insert) and add homology arms for directional cloning into the STARR-seq screening plasmid. Importantly, the candidate fragments cloned via Y-linker adapters will become directional at this PCR step, such that candidates cloned in either direction can be unambiguously identified by deep sequencing. Next, the library insert is cloned by recombination into the STARR-seq screening plasmid using the homology arms added to the Illumina adapters during library insert amplification. As the cloning efficiency strongly impacts library complexity, it is necessary to ensure the highest possible efficiency.\nThird, the library cloning reactions are column purified and transformed into competent bacteria, which are subsequently grown in liquid cultures for the large-scale amplification of the STARR-seq plasmid library. A high transformation efficiency is critical for the complexity and quality of the library (especially for genome-wide libraries). Therefore, transformation should be performed by electroporation using electrocompetent bacteria with the highest efficiency.\nThis protocol describes how to clone a medium-sized focused library from BAC-derived DNA fragments and a highly complex genome-wide library.\nMaterials\nGenomic DNA (e.g., Promega, cat. no. G3041; or any other source of genomic DNA; for genome-wide library)\nBAC DNA [e.g., BAC PAC Resource Center (BPRC); for focused library]\nLB medium (Elbing & Brent, 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0008])\nChloramphenicol\nLarge-Construct Kit (Qiagen cat. no. 12462; focused library only)\n1× TE buffer (10 mM Tris·Cl, pH 8.0, 1 mM EDTA; Moore, 1996[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0021])\n6× DNA loading dye (see Current Protocols article: Voytas, 2000[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0041])\n1-kb DNA ladder (should indicate 1 and 1.5 kb)\nSYBR® Safe DNA Gel Stain (Invitrogen cat. no. S33102)\nGel Extraction Kit (Qiagen cat. no. 28704)\nEB (10 mM Tris·Cl, pH 8.5)\nNEBNext® Ultra™ II DNA Library Prep Kit for Illumina® (NEB cat. no. E7645S)",
    "NEBNext Multiplex Oligos for Illumina (NEB cat. no. E7335L)\nEthanol\nMonoQ H2O\nAMPure XP beads (Beckman Coulter cat. no. A63882)\nRNase-free H2O (Qiagen cat. no. 129115)\nQIAquick PCR Purification Kit (Qiagen cat. no. 28104)\nPrimers:\n               \nlibrary cloning forward (fw) primer:\n                     \nTAGAGCATGCACCGGACACTCTTTCCCTACACGACGCTCTTCCGATCT\nlibrary cloning reverse (rev) primer:\n                     \nGGCCGAATTCGTCGAGTGACTGGAGTTCAGACGTGTGCTCTTCCGATCT\nIllumina-compatible i5 and i7 index primers\nKAPA 2× HiFi HotStart ReadyMix (Kapa Biosystems cat. no. KK2601)\nSTARR-seq screening plasmid (see Strategic Planning, “Choice of STARR-seq screening plasmid)\nAgeI-HF restriction enzyme (NEB cat. no. R3552L)\nSalI-HF restriction enzyme (NEB cat. no. R3138L)\n10× CutSmart buffer (NEB cat. no. B7204S)\nMinElute PCR Purification Kit (Qiagen cat. no. 28004)\nIn-Fusion® HD Cloning Kit (Clontech cat. no. 639650); alternatives are:\n               \nGibson Assembly Master Mix (NEB cat. no. E2611L)\nNEBuilder HiFi DNA Assembly (NEB cat. no. E2621L)\nMegaX DH10B™ T1R electrocompetent bacteria (Invitrogen cat. no. C640003)\nLB agar plates (Elbing & Brent, 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0008])\nAmpicillin\nPlasmid Plus Giga Kit (Qiagen cat. no. 12991)\n37°C heating block\nShaker\nUV/Vis spectrophotometer\nRefrigerated centrifuge\nCovaris S220 focused ultrasonicator\nCovaris microTUBEs with AFA fiber (Covaris cat. no. 520045)\nBlue light illuminator (Thermo Fisher cat. no. G6600EU)\nScalpel\nPCR strips (Biozym cat. no. 711030)\nPCR 8er-CapStrips (Biozym cat. no. 711040)\nMagnetic separator for PCR strips (NEB cat. no. S1515S)\nMagnetic separator for 1.5-ml and 2-ml tubes (Thermo Fisher cat. no. 12321D)\nThermal cycler (PCR machine)\n1.5-ml DNA LoBind tubes (Eppendorf cat. no. 0030108051)\nGene Pulser Xcell Electroporation System (BioRad)\nMicroPulser cuvettes, 0.1-cm gap (Bio Rad cat. no. 1652089)\n14-ml polypropylene round-bottom tubes\n50-ml conical tubes (e.g., Corning Falcon)\n5 L baffled Erlenmeyer flasks\nBacteria shaker with holders for 5-L Erlenmeyer flasks\n1-L centrifugation bottles\nAdditional reagents and equipment for quantitation of DNA (see Current Protocols article: Gallagher & Desjardins, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0010]) and agarose gel electrophoresis (see Current Protocols article: Voytas, 2000[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0041])",
    "Preparation of BAC and genomic DNA\nCulturing BAC clones and extraction of BAC DNA\n1. Select the genomic loci of interest. Include genomic loci that span known enhancers that are active in the cell line of interest. These enhancers serve as positive controls in STARR-seq.\nSee Strategic Planning for more details.\nIf generating a genome-wide library, skip steps 1 to 11.\n2. Identify BAC clones that cover the genomic loci of interest.\nThe number of BACs per library is variable. We have successfully cloned and screened libraries from up to 70 BACs. We anticipate that higher numbers of BACs are also applicable.\n3. Pre-culture each BAC clone individually in 5 ml LB medium containing 12.5 µg/ml chloramphenicol for at least 12 hr at 37°C while shaking at 200 rpm.\n4. Inoculate each BAC pre-culture (5 ml) into 50 ml LB medium + chloramphenicol (12.5 µg/ml final concentration).\nThe minimum volume of the pooled BAC culture that is required for BAC DNA extraction (step 9) is 500 ml.\nIf using less than 10 BAC clones, increase the volume per culture accordingly, to ensure a final volume of 500 ml for the pooled BAC culture.\n5. Grow BAC cultures individually for at least 16 hr at 37°C while shaking at 200 rpm.\n6. Measure OD600 for each BAC culture using an appropriate spectrophotometer.\n7. Pool BAC cultures equally according to OD600 measurements.\nDetermine the required volume per BAC culture according to the OD600 measurements. This results in pooling equal amounts of bacteria and an even representation of each BAC within the BAC DNA pool.\n8. Divide the BAC culture pool into 500-ml batches (if applicable) and spin down for 15 min at 4000 × g, 4°C, to pellet the bacteria.\nBacterial pellets can be stored at −20°C.",
    "9. Extract BAC DNA using the Qiagen Large-Construct Kit according to the manufacturer's protocol.\n10. Resuspend BAC DNA in 300 µl 1 × TE buffer.\nAdd 300 µl 1 × TE buffer to the BAC DNA pellet and incubate at room temperature for at least 12 hr under constant agitation.\n11. Measure the concentration of the BAC DNA pool (Gallagher & Desjardins, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0010]).\nSonication and size-selection of human BAC and genomic DNA\n12. Sonicate DNA to a target size of 1200 to 1500 bp.\nExample settings when using Covaris microTUBEs with AFA fiber and a Covaris S220 focused-ultrasonicator:\nFor a target size of 1200 to 1500 bp, sonicate for 15 s per 5 µg DNA with intensity parameters: 2 “duty cycle”; 4 “intensity”; 200 “cycles/burst.”\nFor a target size of 500 to 750 bp, sonicate for 45 s per 5 µg sample with intensity parameters: 5-3-200.\n13. Use 5 µg DNA (BAC or genomic DNA) in 130 µl TE buffer per sonication.\nSonicate 10 µg BAC DNA or 50 µg genomic DNA in total (you will recover ∼10% DNA after sonication and size selection).\nPrepare two samples of sonicated DNA for a focused library or ten samples for a genome-wide library.\n14. Collect the sonicated DNA on ice.\n15. Pool all sonicated DNA samples and add the corresponding volume of 6× DNA loading dye.\n16. Load 12 µl of a 1-kb DNA ladder in both outermost wells of a 1% agarose gel (well size: 60 µl). See Current Protocols article Voytas (2000[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0041]) for essential agarose gel electrophoresis protocols.\nUse SYBR® Safe DNA stain.\nIt is important to load the DNA ladder on both sides of the gel (see step 19).",
    "17. Load 60 µl of sonicated DNA per well on the 1% agarose gel and perform electrophoresis at 140 V for 20 to 30 min.\nDo not load more than 2.5 µg DNA per well on the gel, to avoid poor separation of the sonicated DNA.\n18. Visualize DNA on a blue light illuminator.\nDo not use UV light, as this may lead to DNA damage.\n19. Size-select the sonicated DNA between 1.2 and 1.5 kb.\nUse a ruler or similar implement to connect the respective bands of the DNA ladder on both sides of the gel. Cut the gel along the ruler between 1.2 and 1.5 kb using a scalpel. Cut first at 1.2 kb and then at 1.5 kb.\n20. Extract the size-selected DNA from two gel slices per QIAquick column using the Qiagen Gel Extraction kit according to the manufacturer's protocol.\nYou will need 10 columns for genomic DNA and 4 columns for BAC DNA.\nDo not use more than 400 mg agarose per column.\nDissolve gel slices at 25° to 37°C under constant agitation (300 rpm) for 10 to 15 min. Do not heat to 50°C.\n21. Elute the DNA in 50 µl EB.\n22. Repeat the elution with the eluate from the first elution (step 21).\nThis step increases the yield of purified DNA.\n23. Pool the elution fractions from five columns.\n24. Purify the gel-extracted DNA pool from five columns (from step 23) using one QIAquick column according to the manufacturer's protocol for PCR purification.\n25. Elute in 50 µl EB and repeat the elution with the eluate.\n26. Pool all eluates from step 25.\n27. Measure the concentration of the sonicated, size-selected and purified DNA pool (see Current Protocols article: Gallagher & Desjardins, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0010]).",
    "Generation of focused and genome-wide library inserts (Illumina adapter ligation)\n28. Perform adaptor ligation using the NEBNext Ultra™ II DNA Library Prep Kit for Illumina.\nUse 1 µg sonicated and size-selected DNA as starting material per reaction.\nPerform one adaptor ligation reaction for a focused library insert and five for a genome-wide library insert.\n29. Precisely follow section 1.1 (NEBNext End Repair) and 1.2 (Adaptor ligation) of the NEBNext Ultra™ II DNA Library Prep Kit for Illumina manual for adaptor ligation.\nAfter Section 1.2.5 in the manual, continue with step 30 (see below).\nUse NEBNext hairpin adapters and the USER enzyme [both contained in NEBNext Multiplex Oligos for Illumina (E7335L)] and follow the manufacturer's instructions.\nThe NEBNext Ultra II Ligation Mixture needs to be cleaned up twice with AMPureXP beads. The first cleanup (steps 30 to 41) recovers all DNA; the second cleanup excludes adapter dimers (steps 42 to 45).\nCleanup of adaptor-ligated DNA with AMPureXP beads\nBefore starting:\n         \nPrepare 80% ethanol (diluted with nuclease-free MonoQ H2O)\nWarm AMPureXP beads to room temperature.\n30. Add 90 µl of the NEBNext Ultra II Ligation Mixture from step 29 per well of a PCR strip.\nThe NEBNext Ultra II Ligation Mixture is very viscous.\nPrepare one reaction for a focused library and five reactions for genome-wide libraries.\n31. Add 1.8 vol AMPureXP beads (162 µl) to 1 vol DNA (90 µl) in a well of the PCR strip, vortex, and pipette up and down 20 times.\nResuspend beads thoroughly by vortexing before use.\n32. Incubate for 10 min at room temperature.\n33. Transfer the PCR strip to a magnetic separator and incubate for 5 min at room temperature.\nAllow the beads to migrate to the magnet-touching wall of the tube. Ensure that the solution is clear before removing the supernatant.",
    "Keep samples on magnetic separator for the following steps (until step 38),\n34. Remove the supernatant completely.\nKeep supernatant until the successful cleanup is confirmed.\n35. Wash the beads twice with 250 µl of 80% ethanol, incubating in the ethanol for 2 min between the washes.\nMake sure that the beads are completely covered with 80% ethanol.\nRemember to keep samples on the magnetic separator.\n36. After the second wash, completely remove the ethanol.\n37. Dry the beads at room temperature for 2 to 5 min to allow the evaporation of the remaining ethanol.\nKeep the tubes on the magnet with open lids while drying.\nAvoid over-drying and elute as soon as the bead pellet starts to show cracks.\n38. To elute, add 100 µl RNase-free H2O, close the PCR strip, and remove it from the magnet.\n39. Resuspend the beads completely by thoroughly vortexing and incubate at 37°C on a heating block for 3 min while shaking (300 rpm).\nAlternatively, a thermal cycler can be used.\n40. Transfer the PCR strips immediately onto the magnetic separator and carefully tilt the magnet to allow the beads to migrate up the tube wall. Incubate for 1 min.\n41. Transfer the adapter-ligated DNA to a new PCR strip.\nRemoval of adapter dimers using AMPure XP beads\n42. Size-select the adapter-ligated DNA from step 41 using AMPure XP beads.\n43. Repeat steps 30 to 41 but add 0.8 vol beads to 1 vol DNA (use 80 µl beads for 100 µl DNA).\nUsing 0.8 vol of beads per 1 vol DNA selectively excludes DNA fragments <100 to 200 bp, thereby removing adapter dimers. The ratio of beads to DNA sample should be determined for every new batch of AMPure XP beads before first use for size-selection.",
    "44. Elute the adapter-ligated DNA in 20 µl EB.\n45. Pool all adapter-ligated DNA samples prior to PCR amplification.\nThis applies to genome-wide libraries only (five samples).\nTest PCR amplification of the adapter-ligated DNA library insert\n46. Perform two test PCR reactions, with 5 and 9 cycles.\nThe test PCR is performed to determine the optimal number of PCR cycles that are needed for library insert amplification based on band intensity (typically 6 to 10 cycles) on a 1% agarose gel (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0002], step 149). It is important to avoid over-amplification, as this leads to poor-quality library inserts. Over-amplification results in the concatemerization of PCR products, which can be monitored by the increase in size of the PCR product after gel electrophoresis.\n47. Prepare the test PCR reaction mix (for one reaction):\n         \n1 µl adapter-ligated DNA (from step 45)\n2.5 µl library_cloning_fw (10 µM)\n2.5 µl library_cloning_rv (10 µM)\n25 µl KAPA 2× HiFi HotStart Ready Mix\n19 µl H2O.\nIMPORTANT NOTE: It is critical to use the KAPA HiFi DNA polymerase (KAPA 2× HiFi HotStart Ready Mix) for library insert amplification, to prevent amplification biases. The library_cloning primers (see Materials, above) add homology arms to the library insert, which are needed for cloning the library insert into the STARR-seq screening plasmid by In-FusionHD or Gibson cloning.\n48. Run the test PCR using the following PCR program:\n         \ntable:\n﻿0,1,2,3\n1 cycle:,45 s,98°C,(initial denaturation)\n5 or 9 cycles:,15 s,98°C,(denaturation)\n,30 s,65°C,(annealing)\n,45 s,72°C,(extension)\n1 cycle:,120 s,72°C,(final extension).\nExtension time depends on insert size, here 1200 to 1500 bp.\n49. Analyze the test PCR by gel electrophoresis (Voytas, 2000[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0041]).",
    "Run 10 µl PCR plus 2 µl 6× DNA loading dye per test PCR on an 1% agarose gel at 140 V for 15-30 min. The number of PCR cycles is determined by band intensity. Please see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0002], step 149, and Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-fig-0002].\nPCR amplification of the adapter-ligated DNA library insert\n50. Set up PCR reactions to amplify the library insert using 1 µl of adapter-ligated DNA per 50 µl PCR reaction (refer to step 47 for the reaction mixture).\nPerform 30 PCR reactions for the amplification of adapter-ligated genomic DNA.\nFor focused libraries, perform four PCR reactions.\n51. PCR amplify the library insert using the number of cycles determined during test PCR.\nSee step 48 for the PCR program.\nScale the PCR reaction mix according to library complexity (i.e. focused versus genome-wide).\nPurification and size-selection of the amplified library insert with AMPureXP beads\n52. Pool four PCR reactions in a 1.5-ml DNA LoBind tube for a focused library or pool ten PCR reactions per tube for a genome-wide library.\nClean up 3 × 10 PCR reactions for genome-wide libraries.\nDo not clean up more than 10 PCR reaction in one tube.\n53. Purify PCR reaction with AMPure XP beads (see steps 30 to 41, above), using 0.8 vol beads per 1 vol PCR reaction.\nThis ratio of beads to PCR selectively excludes DNA fragments <100 to 200 bp.\n54. Elute in 10 µl EB per PCR reaction.\nTotal volume: 40 µl or 3 × 100 µl for focused or genome-wide library inserts, respectively.\nPCR purification of the library insert with the QIAquick PCR purification kit\n55. Clean up 40 or 100 µl library insert per QIAquick column (according to manufacturer's instructions).\nThis step increases the cloning efficiency of the In-FusionHD reaction.\n56. Elute in 50 µl EB.",
    "57. Re-apply the eluate to the column and elute again.\n58. Measure the DNA concentration (Gallagher & Desjardins, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0010]).\nFor genome-wide library inserts, pool the elutions from all three columns.\nRestriction digest and purification of the STARR-seq screening plasmid\n59. Prepare restriction digest master mix (genome-wide library):\n         \n25 µg STARR-seq screening plasmid (5 µg plasmid for focused library)\n25 µl AgeI-HF\n25 µl SalI-HF\n50 µl CutSmart buffer (10×)\nMake up with H2O to 500 µl\nMix thoroughly by vortexing and distribute 10 × 50 µl master mix to PCR strips.\n60. Incubate for 2 hr at 37°C in thermal cycler.\n61. Heat inactivate for 20 min at 65°C in thermal cycler.\nGel purification of the digested STARR-seq screening plasmid\n62. Add 10 µl of 6× DNA loading dye to 50 µl restriction digest reaction.\n63. Run 60 µl sample per well on a 1% agarose gel at 160 V for 30 min (Voytas, 2000[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0041]).\nRun 10 µl 1 kb DNA ladder on the gel.\nUse SYBR® Safe DNA stain.\n64. Size-select the digested plasmid DNA (∼3 kb).\nVisualize the plasmid DNA using blue light.\nConfirm that the restriction digest was complete.\nCut out the plasmid DNA band (∼3 kb) on a blue light illuminator.\n65. Extract the size-selected plasmid DNA from two gel slices per QIAquick column according to manufacturer's instructions.\nDo not use more than 400 mg agarose per column.\n66. Wash twice with 750 µl buffer PE (from QIAquick Kit).\n67. Elute twice using 50 and then 25 µl EB.\nPCR purification of the digested STARR-seq screening plasmid\n68. Pool all eluates of the gel extracted plasmid (step 67) and equally divide into two samples.\n69. Clean up each sample with one QIAquick column (according to manufacturer's instructions).",
    "Increased purity of the plasmid DNA used for In-FusionHD cloning increases the cloning efficiency.\n70. Elute twice using 50 and then 25 µl EB.\nMinElute PCR purification of the digested STARR-seq screening plasmid\n71. Pool all eluates from the PCR purification step (step 70) and equally divide into two samples.\n72. Clean up with two MinElute columns according to manufacturer's instructions.\nThis cleanup step further increases purity and concentrates the digested plasmid DNA.\n73. Elute twice, each time using 15 µl EB.\nLibrary cloning reaction using In-Fusion HD\nNOTE: Gibson Assembly or NEBuilder HiFi DNA Assembly can also be used for the library cloning reaction (according to manufacturer's instructions), using the same amounts of plasmid DNA and library insert as indicated for In-Fusion HD initially (step 74). Cloning efficiency needs to be determined experimentally before library cloning. When experiencing a low cloning efficiency, first switch to alternative cloning methods\n74. Prepare In-Fusion HD master mix (for one reaction):\n         \n125 ng AgeI-HF/SalI-HF-digested STARR-seq screening plasmid (from step 73)\n2× molar excess purified library insert (step 58)\n2 µl 5× In-Fusion HD Enzyme Premix\nMake up with H2O to 10 µl\nUse a 2:1 molar ratio of library insert [∼1250 bp (including adapters)] to digested STARR-seq screening plasmid (∼3 kb). Especially for Gibson Assembly, other molar ratios might also work.\nPerform 40 In-Fusion HD reactions for a genome-wide library (four reactions can be processed as pool).\nYou can also first perform 20 reactions, clone the library, and determine its complexity. If the library is not complex enough to properly cover the entire genome, perform another 20 reactions. You can pool both libraries.\nWe recommend to only use 20 reactions at a time for bacterial transformation, i.e., perform the transformation twice per genome-wide library.",
    "Perform four reactions for a focused library (process as pool).\n75. Distribute the In-Fusion HD master mix to PCR strips (40 µl per well, i.e., four pooled reactions).\n76. Incubate for 15 min at 50°C in thermal cycler.\n77. Place samples on ice.\nMinElute PCR purification of the library cloning reaction\n78. Make up In-Fusion HD reaction pool (four reactions) to 100 µl.\nAdd 60 µl H2O to 40 µl In-Fusion HD reaction pool.\n79. Clean up one In-Fusion HD reaction pool per one Qiagen MinElute column according to manufacturer's instructions.\nThe purification of the In-Fusion HD cloning reaction is absolutely essential for high transformation efficiency, and therefore library complexity.\n80. Wash twice with 750 µl buffer PE (from Qiagen MinElute Kit).\n81. After washing, centrifuge columns at maximum speed for 5 min to dry the membrane.\n82. Elute in 12.5 µl EB.\n83. Re-elute by passing the first eluate (12.5 µl) through the column again.\n84. Pool all purified library cloning reactions\nThis only applies to a genome-wide library (5 × 12.5 µl).\nTransformation of electrocompetent MegaX DH10B bacteria (Invitrogen)\nNOTE: Transform bacteria in the afternoon, grow them overnight, and harvest the next morning. Avoid growing them for more than 14 to 16 hr.\nGrow 12 to 24 L for a genome-wide library and 4 L for a focused library. The scale of the liquid culture depends on the demand of the library. We did not experience any influence of the scale of the liquid culture on transformation efficiency.\nBefore starting:\n         \nPre-warm LB medium at 37°C (1 day in advance).\nPre-warm recovery medium (comes with the bacteria) at 37°C.\nPre-cool 20 µl tips at 4°C.\nPre-cool DNA1.5 ml LoBind tubes on ice.\nPre-cool MicroPulser Cuvettes (0.1-cm gap) on ice.",
    "For maximum efficiency, it is essential to use MegaX DH10B™ T1R electrocompetent bacteria (Invitrogen cat. no. C640003) and precisely follow the protocol (steps 85 to 108).\nNOTE: Perform all steps on ice and work in cold room (if possible).\n85. Distribute 2.5 µl of purified and pooled library cloning reaction (for 20 transformations) to pre-cooled 1.5-ml LoBind tubes.\nPerform 20 transformations for a genome-wide library at once. Perform 40 in total.\nPerform four transformations for a focused library.\n86. Pipet 1 µl transformation control plasmid (pUC19) into a pre-cooled 1.5-ml LoBind tube.\npUC19 comes with the bacteria.\n87. Thaw five tubes (one tube) of MegaX DH10B™ T1R electrocompetent bacteria on ice.\nIt is absolute essential to thaw the bacteria on ice and keep them on ice after thawing.\n88. Add 20 µl MegaX DH10B bacteria into each 2.5-µl library cloning reaction tube and mix carefully by flicking two to three times.\nIMPORTANT NOTE: NEVER pipet MegaX DH10B bacteria up and down.\n89. Transfer bacteria-DNA mix into pre-cooled MicroPulser cuvettes using pre-cooled 20 µl tips.\nMake sure to transfer the bacteria without generating bubbles. Distribute the bacteria at the bottom of the cuvette by flicking or tapping.\n90. Electroporate bacteria using the Bio-Rad Gene Pulser Xcell electroporator.\nSETTINGS: 2 kV, 25 µF, 200 Ω, 1 mm.\n91. Immediately add 1 ml of pre-warmed (37°C) recovery medium to the cuvette and transfer resuspended bacteria to a 14-ml polypropylene round-bottom tube.\nThe recovery medium comes with the MegaX DH10B™ T1R electrocompetent bacteria.\nIt is critical to immediately add the pre-warmed medium. Efficiency drops on the order of seconds.\n92. Recover the transformed bacteria in 14-ml polypropylene round-bottom tubes for 1 hr at 37°C while shaking (>300 rpm).",
    "Recovering the transformed bacteria in 14-ml round bottom tubes increases efficiency, compared to recovery in 1.5 ml tubes.\n93. Pool all transformation reactions (∼22 to 23 ml) in a 50-ml conical tube.\n94. Prepare a dilution series of the pooled bacterial culture and the transformation control (pUC19). Determine the transformation efficiency of the MegaX DH10B bacteria using the colony counts of pUC19 (also see manufacturer's instructions). Efficiency should be >3 × 1010.\nTo estimate the library complexity, use colony counts from library transformed bacteria:\n         \n1:10, 100 µl bacteria culture + 900 µl LB medium without addition of antibiotics\n1:50, 200 µl from 1:10 dilution + 800 µl LB medium without addition of antibiotics\n1:500, 100 µl from 1:50 dilution + 900 µl LB medium without addition of antibiotics\n1:5000, 100 µl from 1:500 dilution + 900 µl LB medium without addition of antibiotics.\n95. Plate 100 µl of 1:50, 1:500, and 1:5000 dilutions on selective LB agar plates containing 100 µg/ml ampicillin (see Elbing & Brent, 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0008]).\nMore than 50 colonies should be obtained from the 1:5000 dilution of the library transformed bacteria.\n96. Add equal volumes of the pooled bacteria culture from step 93 to 2 L pre-warmed (37°C) LB medium containing 100 µg/ml ampicillin in 5-L Erlenmeyer flasks.\n97. Incubate overnight (∼13 hr) while shaking at 200 rpm at 37°C. Measure OD600 after ∼10 to 12 hr.\nOD600 should be between 2 and 2.6 when harvesting the bacteria culture.\n98. Spin down bacteria culture in 1-L centrifugation bottles for 30 to 45 min at >4200 × g, 4°C.\n99. Decant the supernatant, leaving behind ∼10 ml medium for resuspension.\n100. Resuspend the bacteria pellets in the residual medium by vortexing and pipetting in the centrifugation bottles.\n101. Pool all resuspended bacteria in one centrifugation bottle.",
    "102. Rinse centrifugation bottles subsequently with 10 to 15 ml LB medium to collect remaining bacteria.\n103. Add to bacterial pool and resuspend bacteria by vortexing until homogenous.\n104. Distribute bacterial suspension evenly into 8 to 10 50-ml conical tubes.\nDetermine the tare weight before and note on the tube.\n105. Spin down the bacteria for 15 min at 6000 × g, 4°C.\n106. Decant the supernatant if clear; otherwise, spin down again for 10 min at 6000 × g, 4°C.\n107. Determine the weight of the bacteria pellets in the 50-ml conical tubes, taking the tare weight into account.\n108. Store pellets at −20°C.\nPurification of the STARR-seq plasmid library\n109. Purify one bacterial pellet (maximum, 7.5 g) per column using the Plasmid Plus Giga Kit according to manufacturer's instructions.\n110. Elute in 1 ml MonoQ H2O and measure concentration.\nElectroporation using the MaxCyte STX transfection system requires the DNA to be suspended in H2O; in addition, the DNA concentration needs to be >1 µg/µl.\nCheck requirements for other transfection methods or protocols.\n111. Elute again in 0.5 ml MonoQ H2O.\nIf the concentration of the second elution is >2 µg/µl, add to first elution.\nDeep sequencing of the STARR-seq plasmid library\nThe quality and complexity of the STARR-seq plasmid library needs to be assessed by deep sequencing.\nNOTE: The STARR-seq plasmid library is used as input for STARR-seq analysis (see Statistical Analyses).\n112. Amplify the STARR-seq plasmid library using Illumina-compatible i5 and i7 index primers.\n113. Use the STARR-seq plasmid library diluted to 100 ng/µl (in MonoQ H2O) as template for the sequencing-ready PCR.\n114. Prepare the master mix for the sequencing-ready PCRs (the mix below is for one reaction; scale accordingly):\n         \n1 µl STARR-seq plasmid library (100 ng/µl)\n2.5 µl Illumina i5 primer (10 µM)",
    "2.5 µl Illumina i7 primer (10 µM)\n25 µl KAPA 2× HiFi HotStart Ready Mix\n19 µl H2O (MonoQ).\nPerform two sequencing ready PCR reactions for focused (BAC) and 10 for genome-wide libraries.\nThe number of PCR reactions depends on the library complexity. Keep in mind to also scale the sequencing depth according to library complexity.\n115. Distribute the master mix to PCR strips (50 µl per well).\n116. Run the sequencing-ready PCR:\n         \ntable:\n﻿0,1,2,3\n1 cycle:,45 s,98°C,(initial denaturation)\n9 cycles:,15 s,98°C,(denaturation)\n,30 s,65°C,(annealing)\n,45 s,72°C,(extension)\n1 cycle:,120 s,72°C,(final extension).\n117. Add 10 µl of 6× DNA loading dye per 50-µl PCR reaction.\n118. Run 60-µl sample per well on a 1% agarose gel (see Current Protocols article: Voytas, 2000[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0041]) at 160 V for 30 min.\nRun 12 µl of 1-kb DNA ladder for size determination.\nUse SYBR® Safe DNA stain and visualize DNA on a blue light illuminator.\n119. Size-select the amplified STARR-seq plasmid library (∼1 to 1.5 kb).\nCut out DNA band (smear) from the gel using blue light illumination.\nCut-out size depends on initial library insert size (see steps 12 to 19).\n120. Purify size-selected DNA from two lanes with one QIAquick gel extraction column according to manufacturer's instructions.\nDo not use more than 400 mg agarose per column.\n121. Wash twice with 750 µl buffer PE.\n122. Elute twice using 50 and then 25 µl EB.\n123. Pool eluates from gel extraction step (step 122) and divide into two samples with equal volume.\n124. Clean up with two MinElute columns following the Qiagen MinElute PCR purification protocol (according to manufacturer's instructions).\nFor focused libraries, use only one column.\n125. Elute twice, each time using 10 µl EB per column and pool eluates.\n126. Submit ∼500 ng sample for Illumina deep sequencing.\nFinal concentration: ∼5-10 ng/µl.",
    "Ideally sequence paired-end. Single-read sequencing is also possible at the expense of the loss of fragment-length information (for analysis, reads should be extended by the median size of the STARR-seq plasmid library (see step 12)).\nIMPORTANT NOTE: The sequenced STARR-seq plasmid library serves as input for STARR-seq analysis (peak calling).\n127. Store sample at −20°C.",
    "STARR-seq is a plasmid-based enhancer-activity assay that allows the identification of enhancers on a genome-wide scale and the quantitative assessment of the enhancers’ activities by deep sequencing of reporter transcripts. As for all ectopic assays based on reporter transcript quantification, the STARR-seq candidate library has to be transfected into the cells of interest, and the reporter transcripts have to be harvested, processed, and sequenced. This protocol describes these steps in human cells for focused and genome-wide candidate libraries using the hSTARR-seq_ORI vector (Muerdter et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0022]). Note that the ORI is used as core promoter; see Background information for details. Library cloning is covered in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0001] (also see Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-fig-0001], top).",
    "The first step in STARR-seq is the transfection of the STARR-seq plasmid library (from Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0001]) into the cells of interest. The transfected cells are then incubated to allow the transcription of the reporter mRNAs. For human cells, a 6-hr incubation resulted in the strongest STARR-seq signal over background (incubation time may vary depending on cell line and transfection method used). After harvesting the cells, total RNA is isolated and the reporter transcripts are enriched as part of the cellular mRNA by oligo(dT)-based mRNA isolation, followed by Turbo DNase digestion to remove residual plasmids. cDNA synthesis is performed using a reporter-transcript-specific reverse-transcription (RT) primer, and the reporter cDNAs are then selectively amplified by a nested two-step PCR amplification strategy. To ensure that only reporter cDNA and not residual library plasmids are amplified, we use a primer for the first PCR step (junction PCR) that specifically binds across the splice junction of the reporter transcript. The second PCR step specifically amplifies the candidate sequences flanked by Illumina adapters (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-fig-0001], left: see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0001]) using Illumina-compatible index primers. The amplified candidate sequences are then subjected to deep sequencing.\nMaterials\nCultured cell line of interest\nAppropriate growth medium (for HCT116 or HeLaS3 cells):\nDMEM (Gibco cat. no. 52100-047) containing:\n               \n10% heat-inactivated FBS (Sigma cat. no. F7524)\n2 mM L-glutamine (Sigma cat. no. G7513)\nSTARR-seq plasmid library (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0001])\nControl plasmids, e.g., pIRES-EGFP (Clontech cat. no. 6029-1)\n1× phosphate-buffered saline (PBS; Moore, 1996[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0021])\n1× Trypsin (0.05% trypsin-EDTA; Gibco cat. no. 25300 054)\nTransfection buffer (depends on chosen transfection protocol)\nPKR inhibitor (C16 inhibitor) (Sigma cat. no. I9785-5MG)\nTBK1/IKK inhibitors (BX-795 inhibitor) (Sigma cat. no. SML0694-5MG)\nRNeasy Maxi kit (Qiagen cat. no. 75162)\n14.3 M β-mercaptoethanol (β-ME) (Sigma cat. no. 63689-100ML-F)\n70% Ethanol [diluted with DEPC-treated (see recipe) MonoQ H2O]",
    "RNase-free H2O or DEPC-treated (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-rec-0001]) MonoQ H2O\nRNase Zap (Sigma cat. no. AM9780)\nSpike-in controls (see text over steps 47 to 62)\nDynabeads Oligo-dT25 (Invitrogen cat. no. 61005)\nBuffers for Dynabeads Oligo-dT25 (see recipes[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-rec-0003] in Reagents and Solutions):\n               \n2× Binding buffer\nWashing buffer\nStorage buffer\nReconditioning buffer\n10 mM Tris⋅Cl, pH 8.0 and 7.5, RNase-free (Moore, 1996[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0021])\nTurbo DNase (Invitrogen cat. no. AM2238) and 10× Turbo DNase buffer\n80% Ethanol [diluted with DEPC-treated (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-rec-0001]) MonoQ H2O]\nRNA CleanXP beads (Beckman Coulter cat. no. A63987)\n10 µM dNTP mix (NEB cat. no. 4475)\nPrimers:\n               \ngene specific RT primer (GSP): CTCATCAATGTATCTTATCATGTCTG\njunction forward (fw) primer: TCGTGAGGCACTGGGCAG*G*T*G*T*C\njunction reverse (rv) primer: CTTATCATGTCTGCTCGA*A*G*C\n* = phosphorothioate bond (protection of primer from 3′ to 5′ exonuclease activity of proof-reading DNA polymerase; especially important for junction fw primer that specifically binds across the splice junction of the reporter cDNA/transcript)\nIllumina-compatible i5 and i7 index primers\nSuperScript® III reverse transcriptase (supplied with 5× first-strand buffer and 0.1 M DTT; Invitrogen cat. no. 18080093)\n40,000 U/ml Murine RNase Inhibitor (NEB cat. no. M0314L)\nAMPure XP beads (Beckman Coulter cat. no. A63882)\nRNaseA (Thermo Fisher cat. no. EN0531)\nKAPA 2× HiFi HotStart Ready Mix (Kapa Biosystems cat. no KK2601)\nEB (10 mM Tris·Cl, pH 8.5)\n6× DNA loading dye (see Current Protocols article: Voytas, 2000[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0041])\nSPRIselect beads (Beckman Coulter cat. no. B23318)\nSquare plates (24.5 × 24.5–cm; Thermo Scientific cat. no. 166508)\nT-175 or T-225 culture flasks (Thermo Scientific cat. no. 159910 or 159934)\nAutomated cell counter\n50-ml conical tubes (e.g., BD Falcon)\nCentrifuge (for 50-ml tubes)\nredundant to Thermomixer\nMagnetic separator for PCR strips (NEB cat. no. S1515S)\nMagnetic separator for 1.5-ml and 2-ml tubes (Thermo Fisher cat. no. 12321D)\nMagnetic separator for 5-ml tubes (Thermo Fisher cat. no. 12303D)",
    "Magnetic separator for 15-ml tubes (Thermo Fisher cat. no. 12301D)\nTissue Ruptor (Qiagen cat. no. 9002756)\nTissue Ruptor disposable probes (Qiagen cat. no. 990890)\n15-ml conical/polystyrene tubes (Thermo Fisher cat. no. 05-527-90)\n1.5-ml DNA LoBind tubes, RNase-free (Eppendorf cat. no. 022431048)\n5-ml tubes, RNase-free (Eppendorf cat.no. 0030119487)\nRolling shaker\nThermomixer\nPCR strips (Biozym cat. no. 711030)\nPCR 8er-CapStrips (Biozym cat. no. 711040)\nThermal cycler (PCR machine)\nAdditional reagents and equipment for transfection (see Support Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0004], references cited under step 1, below, and other relevant articles in Current Protocols in Molecular Biology), fluorescence-activated cell sorting (FACS; Robinson et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0028]), RNA and DNA quantitation (see Current Protocols article: Gallagher & Desjardins, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0010]), DNA sequencing (see Current Protocols article: Shendure, Porreca, & Church, 2008[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0031]), and agarose gel electrophoresis (see Current Protocols article: Voytas, 2000[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0041])\nTransfection of human cells with the STARR-seq plasmid library\nEstablishing transfection conditions for human cells\n1. Select a suitable transfection method for the cell line of interest that yields high transfection efficiencies and makes it possible to scale to the required throughput.\nWe recommend using electroporation for transfection due to scalability and efficiency (see Support Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0004]). Other transient transfection methods like chemical transfection have been successfully used for STARR-seq (Barakat et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0003]; Vockley et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0040]).\nViral transfection (infection) has been used for other MPRAs (Inoue et al., 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0014]; Maricque et al., 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0020]; Nguyen et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0025]; Shen et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0030]); however, not for STARR-seq. We anticipate that viral infection should be compatible with STARR-seq as well. This would require the construction of a virus-compatible STARR-seq plasmid.\n2. Test and optimize the transfection efficiency of the cell line of interest by transfecting control plasmids that strongly express a fluorescence protein (e.g., GFP).\nWe recommend using pIRES-EGFP (Clontech cat. no. 6029-1).",
    "Determine the transfection efficiency using FACS (Robinson et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0028]).\nThe transfection efficiency should be as high as possible, ideally >60% for genome-wide screens to account for the high library complexity and to ensure high-quality screens (high library coverage).\n3. Determine if the cell line of interest is generating a type-I interferon (INF) response upon plasmid transfection.\nConsult the literature (e.g., Muerdter et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0022]; supplementary Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-fig-0002]) or test the upregulation of INF-responsive genes such as IFIT2, MX1, OAS3, or ISG15 after plasmid transfection (24 and 48 hr post transfection) using qPCR (see Muerdter et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0022]).\nIf an interferon response is expected, use signaling pathway inhibitors to prevent false-positive and false-negative STARR-seq signals (enhancer activities) (see Strategic Planning and Background Information).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/964fb136-cd69-4eb3-945d-8519ee41ceb1/cpmb105-fig-0002-m.jpg</p>\nFigure 2\nTest PCR on 1% agarose gel (lanes): left lane, Fermentas GeneRuler 1 kb plus; (1) 10 µl of sequencing-ready PCR with five cycles; (2) 10 µl of sequencing-ready PCR with nine cycles; and (3) 10 µl of sequencing-ready PCR with nine cycles of minus RT.\nTransfection of human cells\nWe provide two variants of the transfection protocol: (1) a general protocol for transfection of human cells with the STARR-seq plasmid library (see below) and (2) an optimized transfection protocol for human cells using the electroporation device “MaxCyte STX scalable transfection system” (Support Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0004]).\n4. Seed/split cells 24 hr before transfection in square plates (24.5 × 24.5 cm).\nCells should be 80% confluent on transfection day for optimal transfection efficiency. An 80% confluent square plate contains around 8 × 107 cells HCT116.",
    "Use 4 × 108 cells per replicate for a genome-wide screen (five to six square plates) or 8 × 107 cells for a focused screen (one to two square plates). Note that these cell numbers were determined in HCT116 and HeLa S3 cells using electroporation (transfection efficiency >80%, viability >90%). The number of cells may vary, depending on transfection method, cell line, transfection efficiency, cell viability, and STARR-seq plasmid library complexity. The number of cells needs to be determined prior to transfection of the STARR-seq plasmid library for every cell line.\nPerform at least two independent replicates per screen. To monitor the transfection efficiency for each STARR-seq screen, always include a transfection control (e.g., transfect a small number of cells using a GFP expressing plasmid, e.g., pIRES-EGFP). Measure efficiency by FACS (Robinson et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0028]).\n5. Harvest cells after 24 hr for transfection.\n6. Remove the growth medium completely.\n7. Wash cells carefully with 12 ml of 1 × PBS. Remove 1 × PBS completely.\n8. Add 8 ml of 1× trypsin per square plate (cells need to be covered completely) and incubate at 37°C for ∼5 min.\nSteps 8 and 9 are only needed for adherent cells.\n9. Add 12 ml growth medium to stop the action of trypsin, resuspending the cells by pipetting up and down thoroughly.\n10. Pool cells from all square plates in a T-175 or a T-225 flask, depending on total volume, and mix thoroughly.\n11. Count the pooled cells using an automated cell counter.\nUse 4 × 108 cells for a genome-wide screen or 8 × 107 cells for a focused screen. The number of cells may vary depending on transfection protocol and cell line.\n12. Transfer the required number of cells to 50-ml conical tubes.",
    "Use cell count from step 11 to calculate the volume of cell suspension needed.\n13. Spin down cells 5 min at 125 × g, room temperature.\n14. Remove medium and resuspend each cell pellet in 5 ml transfection buffer, then pool all resuspended pellets in a 50 ml conical tube.\nThe transfection buffer depends on transfection method/protocol.\n15. Spin down cells 5 min at 125 × g, room temperature.\n16. Resuspend cells in appropriate transfection buffer.\nThe transfection buffer as well as the volume depend on transfection method/protocol.\n17. Transfect cells with the STARR-seq plasmid library using the previously determined transfection method according to manufacturer's instructions and previously determined conditions.\nTransfect 20 µg STARR-seq plasmid library per 1 × 107 cells.\n18. Resuspend transfected cells in growth medium and plate 50 ml per square plate (final concentration: 1 × 106 cells/ml).\nFor cells with an interferon (INF) response, add C16 and BX-795 inhibitors to the transfected cells at a final concentration of 1 µM per inhibitor (add 40 µl of 1 mM stock solution to 40 ml growth medium).\n19. Incubate at 37°C for 6 hr.\nThe incubation time of STARR-seq is counted from plating the cells (step 18) until cell lysis for total RNA isolation (step 33).\nUsing electroporation, we found 6 hr to be ideal for STARR-seq in several human cell types (determined by the signal over background ratio). The optimal incubation time of STARR-seq may depend on the transfection method and cell line, and should be determined individually.\nIf using lipofection, the incubation time should be extended to 12 to 24 hr. The optimal time frame needs to be determined experimentally.\nHarvesting cells transfected with STARR-seq plasmid library\n20. Harvest cells to ensure cell lysis 6 hr post transfection when using electroporation.",
    "If using adherent cells: 30% to 40% of the cells are not yet attached after 5 to 6 hr post transfection. Therefore, non-attached cells from the growth medium also need to be harvested.\nIf performing a genome-wide screen, start harvesting of cells after ∼5 hr to ensure cell lysis after 6 hr.\n21. Transfer 50 ml growth medium (from one square plate) to two 50-ml conical tubes.\nThe growth medium contains transfected cells that have not attached to the culture flask yet.\n22. Wash the cells with 10 ml of 1 × PBS.\n23. Transfer the PBS wash to the 50-ml Falcon tubes from step 21, for maximum recovery.\n24. Add 8 ml 1× trypsin per square plate and incubate at 37°C for 4 to 5 min.\n25. During trypsin incubation, spin down growth medium from step 21 for 5 min at 125 to 300 × g, room temperature, and aspirate supernatant.\n26. Add 12 ml serum-containing growth medium per square plate to stop the action of trypsin, resuspending the cells by pipetting up and down thoroughly.\n27. Combine this cell suspension with the cell pellet from step 21.\n28. Spin down the cells 5 min at 125 to 300 × g, room temperature.\n29. Wash cells with 20 ml of 1 × PBS.\n30. Spin cells down 5 min at 125 to 300 × g, room temperature.\n31. Remove PBS by aspiration.\nLeave 200 to 400 µl of 1× PBS (∼1 to 2 mm) covering the cell pellet in the 50-ml conical tube.\nResuspend the cells in 200 to 400 µl of 1× PBS by softly flicking the tube prior to cell lysis (step 32).\nTotal RNA isolation",
    "Perform total RNA isolation using the Qiagen RNeasy Maxi Kit. Read the manufacturer's instructions before use. Clean and wipe fume hood and all equipment with RNase Zap (or similar) to ensure an RNase-free working environment.\nPrepare the following reagents freshly before starting (the indicated volumes refer to one sample). Calculate the total volume of the reagents by multiplying the total number of samples plus one (e.g., 4 samples +1 = 5) with the reagent volume per sample.\n         \nRLT buffer (15 ml): Add 150 µl 14.3 M β-ME to 15 ml RLT buffer (contained in RNeasy Maxi Kit). Work in an RNase-free fume hood to avoid β-ME inhalation.\n70% ethanol (15 ml): Dilute 10.5 ml 100% ethanol with 4.5 ml RNase-free/DEPC-treated MonoQ H2O\nRPE buffer (contained in the RNeasy Maxi Kit as concentrate). Add four volumes of 100% ethanol to the RPE buffer concentrate (volumes are indicated on the bottle) to obtain the working solution.\nPrepare the Qiagen TissueRuptor and disposable probes.\nInstall a waste container in the fume hood to dispose of β-ME-contaminated plastics and solutions.\n32. Resuspend the cell pellet in the 50-ml conical tube by vortexing at medium speed.\nThis is important to ensure complete and efficient disruption/lysis of cells.\n33. Lyse the cells by adding 15 ml RLT buffer (+β-ME) to the resuspended cell pellet.\nFirst add ∼5 ml RLT (+β-ME) dropwise while vortexing the cells, then add the remaining RLT (+β-ME), close the tube, and vortex until the solution is homogeneous (5 to 10 s).\nRepeat steps 32 and 33 for all samples/cell pellets.\n34. Homogenize the cells using the Qiagen TissueRuptor with a disposable probe at full speed.\nHomogenize each cell pellet/sample for 4.5 min while constantly moving the disposable probe within the tube. Note that shorter homogenization times lead to reduced RNA yield.",
    "Repeat step 34 for all samples. To avoid cross-contamination of samples, use a fresh disposable probe for each sample (meaning a different STARR-seq plasmid library or cell line).\nThe disposable probe can be re-used for cell pellets of the same sample (genome-wide screen).\n35. Add 15 ml 70% ethanol to the homogenized lysate, then mix thoroughly by shaking vigorously for 20 s.\n36. Transfer 15 ml of lysate to an RNeasy Maxi column (maximum volume, 15 ml).\nUse one RNeasy Maxi column per cell pellet (8 × 107) of a focused screen and two columns for the cell pellet of a genome-wide screen (2 × 108 cells per column). Do not overload the column, as this results in reduced RNA yield. Maximum capacity may vary between different cell lines.\n37. Centrifuge 5 min at >3200 × g, 25°C, and discard flow-through.\n38. Repeat steps 36 and 37 with the remaining 15 ml lysate and discard flow-through.\n39. Add 15 ml RW1 buffer (from the RNeasy kit), centrifuge for 5 min at >3200 × g, 25°C, then discard the flow-through.\n40. Add 10 ml RPE buffer prepared as described in the text above step 32, centrifuge 2 min at >3200 × g, 25°C, and discard the flow-through.\n41. Add 10 ml RPE buffer prepared as above, then centrifuge for 10 min at >3200 × g, 25°C\nThe extended centrifugation time (10 min) is necessary to dry the membrane and remove residual wash buffer.\n42. Transfer the column to a new collection tube (provided in the kit) for elution.\n43. To elute, add RNase-free H2O directly to the silica-gel membrane and incubate for 2 min before centrifuging for 5 min at >3200 × g, 25°C.",
    "44. Elute three times subsequently with the following volumes: first in 1.2 ml, second in 1 ml, third in 0.5 ml.\nSubsequent elution steps are important for maximum recovery of total RNA. If the concentration is expected to be low, e.g., for focused screens, elute in 0.5-ml steps only. If the concentration after the third elution is >300 ng/µl, elute further in 0.5-ml steps. If using more than one column per sample (typically for genome-wide screens), pool the same elution fractions to obtain pools of the first, second, and third elution steps.\n45. Measure the RNA concentration (see Current Protocols article: Gallagher & Desjardins, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0010]) of the pooled elution fractions.\n46. Pool elution fractions to obtain a final concentration of ≤750 ng/µl and a volume matching full or half milliliters (to facilitate handling during mRNA isolation in subsequent steps).\n750 ng/µl is the maximum concentration you can use in the next step due to the binding capacity of the Oligo-dT25 beads.\nIf processing more than one sample in parallel, adjust all samples to the same volume, to facilitate handling during mRNA isolation.\nSamples can be stored at −80°C; save 5 µl for gel analysis to determine RNA integrity.\nThe maximum volume of the sample for 5-ml tubes is 2 ml, for 15-ml tubes, 5 ml.\nOptional: Spike-in control for library normalization\nSpike-in controls are highly recommended if different conditions are examined using STARR-seq or global changes in enhancer activities are expected (e.g., the induction or inactivation of many or all enhancers). Spike-in controls are used to normalize different STARR-seq screens to perform comparative analyses.",
    "Total RNA from a previous screen of individual enhancers or a focused library can be used for spike-in controls—the candidates for the spike-in library must be different from the candidates for the current screen (e.g., use a different BAC region or DNA from a different closely related species). This ensures that the STARR-seq and spike-in transcripts are processed simultaneously throughout all steps of the protocol. We prepare spike-in controls beforehand and keep aliquots of total RNA. “Spike-in (total) RNA” is added to the total RNA of the STARR-seq screens.\nWe recommend two variants of spike-in controls:\n         \nPool of individual enhancers (steps 47 to 55).\nGenomic regions covered by BACs containing multiple enhancers (steps 56 to 62).\nUse spike-in control (1) from steps 42 to 50 or (2) from steps 56 to 62.\nPool of individual enhancers\n47. Identify putative enhancers from closely related species that can be mapped unambiguously to only the respective reference genome to avoid cross mapping between STARR-seq and spike-in reads.\nFor human cells, e.g., mouse enhancers can be used.\n48. Clone individual putative enhancers flanked by the Illumina adapters into the STARR-seq screening plasmid.\nFor the cloning protocol, see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0001]—STARR-seq plasmid library cloning\nRecommended, >10 to 15 enhancers.\n49. Verify the successful cloning by Sanger sequencing (Shendure et al., 2008[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0031]).\n50. Mix spike-in control plasmids at an equimolar ratio.\n51. Transfect spike-in control plasmid mix to the same cell line that is used for STARR-seq.\n52. Extract total RNA from the transfected cells (see steps 32 to 46—total RNA isolation procedure).\n53. Dilute the spike-in total RNA to 100 ng/µl with RNase-free MonoQ H2O and aliquot amounts needed per one genome-wide screen.\nAvoid repeated freeze-thaw cycles.\nStore spike-in total RNA at −80°C.",
    "54. Add an appropriate amount (ratio) of spike-in to focused or genome-wide STARR-seq screens.\nThe ratio of spike-in to STARR-seq total RNA depends on the size, i.e., complexity of the STARR-seq plasmid library (ratios successfully tested: focused library: 1:10,000 or genome-wide: 1:1000).\n55. Add spike-in total RNA to STARR-seq total RNA after its concentration has been adjusted prior to mRNA isolation (step 46).\nThe ratio of spike-in to STARR-seq total RNA needs to be experimentally determined by testing different ratios (e.g., 1:100, 1:1000, 1:10,000) in a standard STARR-seq screen. Spike-in reads should be in the range of ∼0.02% of total reads.\nGenomic regions covered by BACs containing multiple enhancers\n56. Identify putative enhancers from closely related species.\n57. Identify BACs that cover genomic regions containing single/multiple enhancers.\n58. Perform STARR-seq library cloning protocol (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0001]) using BAC DNA from step 57.\n59. Transfect spike-in control library to the same cell line used for STARR-seq.\n60. Continue as described above (see step 52).\n61. Process a fraction of the spike-in control screen to confirm successful performance of STARR-seq using the spike-in control library. Make sure that the control enhancers are detected after deep sequencing.\n62. Test the ratio of spike-in to STARR-seq total RNA (see step 55).\nmRNA/poly(A)+ RNA isolation with Dynabeads Oligo (dT)25\nUse 2 vol of Dynabeads Oligo (dT)25 for 1 vol of total RNA, e.g., 2 ml of Dynabeads Oligo (dT)25 per 1 ml of total RNA.\nPrepare before starting:\n         \n2× binding buffer (quantity 2.5× the starting volume of beads)\nWashing buffer (quantity 2× the starting volume of beads)\nStorage buffer (quantity 5× the starting volume of beads)\nReconditioning buffer (quantity 3× the starting volume of beads).\nAll buffers need to be at room temperature before use.\nPrepare RNA for binding to Dynabeads Oligo (dT)25",
    "63. Heat total RNA to 65°C in a heating block.\nIncubate the RNA for 12 min when using 5-ml or 15-ml tubes (genome-wide screen); incubate for 7 min when using 1.5-ml tubes (focused screen).\n64. Place total RNA on ice immediately for 5 or 3 min.\n65. Incubate total RNA at room temperature for 1 min.\nWashing procedure for Dynabeads Oligo (dT)25\nThis step prepares the beads for binding to the mRNA. Resuspend Dynabeads Oligo (dT)25 beads thoroughly by vortexing before use.\n66. Transfer the beads to an appropriate tube.\nUse 2 vol of Dynabeads Oligo (dT)25 for 1 vol of total RNA.\n67. Place the tube on a suitable magnetic separator and incubate until the solution is clear.\n68. Remove the storage buffer completely from the beads.\n69. Wash beads twice with 1 vol (volume refers to starting volume of beads) of 2× binding buffer. Vortex thoroughly, then place on magnetic separator for 1.5 min (until solution is clear).\n70. Resuspend beads in ½ vol of 2× binding buffer (referring to starting volume of beads).\nOligo-dT purification of mRNA using Dynabeads Oligo (dT)25\n71. Add 1 × vol of total RNA (from step 65) to 1 vol of beads (resuspended in 2× binding buffer) to obtain a final concentration of 1× binding buffer.\nMix gently but thoroughly by carefully vortexing or pipetting up and down.\n72. Incubate at room temperature for 10 min under constant rotation using a rolling shaker. To collect all beads from the lid, gently quick-spin tubes at <100 × g for ∼5 s.\n73. Place the tube on the magnetic separator for 2 min and completely remove the supernatant.",
    "74. Wash the beads twice carefully using 1 vol washing buffer (volume corresponds to the starting volume of the beads). To resuspend the beads, gently invert the tube. Place the tube on the magnetic separator for 2 min and completely remove the supernatant.\nIMPORTANT NOTE: Do not vortex while mRNA is bound to the beads!\n75. Remove the remaining washing buffer completely before elution. Spin tubes at <100 × g for 5-10 s. Place on the magnetic separator and remove the remaining liquid completely.\nThis is important to avoid contamination of the eluate with washing buffer.\n76. Elute in 50 µl 10 mM Tris·Cl (pH 7.5) per 1 ml of beads (starting volume). Mix by pipetting up and down 10 times. Incubate at 80°C for 3 min in a thermomixer while shaking (750 rpm).\n77. Immediately transfer the tubes to the magnetic separator and incubate for >1 min.\nThe immediate transfer to the magnet is essential to avoid re-annealing of mRNA to Oligo-dT beads.\n78. Transfer the eluted mRNA (supernatant) to a new RNase-free 1.5 ml LoBind tube.\nThe 1.5-ml LoBind tubes are RNase-free as purchased from the manufacturer.\n79. Elute again with 25 µl 10 mM Tris·Cl (pH 7.5) per 1 ml beads (starting volume). Repeat steps 76 to 78.\n80. Combine all first and second elutions of the same sample.\n81. Measure RNA concentration of the final mRNA pool (see Current Protocols article: Gallagher & Desjardins, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0010]). Save 200 ng mRNA for gel analysis\n82. Resuspend the beads in 1 vol storage buffer (same volume as starting volume) and store at 4°C.\nDynabeads Oligo (dT)25 can be regenerated (see Reagents and Solutions for details) and re-used.\nTurbo DNase digest",
    "83. Prepare Turbo DNase reaction master mix as follows (see steps 84 to 87 for mixing procedure; quantities are for one reaction):\n         \n88 µl mRNA (<200 ng/µl)\n10 µl 10× Turbo DNase buffer\n2.4 µl Turbo DNase.\nProcess the entire mRNA and scale the number of reactions accordingly. Perform at least two Turbo DNase reactions per sample (applies to focused screen).\n84. Combine mRNA and 10× Turbo DNase buffer.\n85. Mix thoroughly by vortexing or pipetting.\n86. Add Turbo DNase to the master mix.\nAs Turbo DNase is sensitive to mechanical stress, avoid extensive vortexing.\n87. Invert the tube gently and mix by slowly pipetting up and down 20 times.\n88. Distribute the master mix into PCR strips (100 µl master mix per well).\n89. Incubate for 30 min at 37°C in a thermal cycler with the heated lid set to 65°C, then hold at 4°C.\nTurbo DNase reaction cleanup with RNA CleanXP beads\nBefore starting:\n         \nPrepare 80% ethanol (diluted with RNase-free/DEPC-treated MonoQ H2O)\nWarm RNA CleanXP beads to room temperature.\n90. Combine two Turbo DNase reactions per sample (2 × 100 µl = 200 µl final volume).\n91. Add 1.8 vol beads to 1 vol mRNA (add 360 µl beads to 200 µl mRNA) using RNase-free 1.5-ml LoBind tubes.\nResuspend RNA CleanXP beads thoroughly by vortexing before use.\n92. Mix thoroughly by vortexing briefly and pipetting up and down 20 times.\n93. Incubate for 15 min at room temperature.\n94. Transfer to magnetic separator and incubate for 10 min at room temperature.\nThe solution needs to be clear—allow beads to migrate to the magnet.\nKeep tubes/samples on magnetic separator for the following steps (except elution); always pipette onto the tube wall opposite the magnet.\n95. Remove all liquid.",
    "96. Wash the beads twice on the magnet, each time with 1 ml of 80% ethanol, and incubate for 2 min.\nMake sure that beads are covered completely with 80% ethanol.\n97. After the second wash, completely remove the ethanol.\n98. Dry the beads at room temperature for 5 to 10 min, allowing the evaporation of any remaining 80% ethanol.\nKeep tubes on magnet with open lids. Avoid over-drying and elute as soon as the bead pellet starts to show cracks.\n99. To elute, add 20 µl RNase-free H2O per Turbo DNase reaction (40 µl per tube).\nClose the tube and remove from magnet.\n100. Resuspend the beads completely by vortexing thoroughly and incubate at 37°C on a thermomixer for 3 min while shaking (300 rpm).\n101. Transfer the beads/tubes immediately onto the magnetic separator and incubate for 1 min.\nCarefully tilt magnet to allow the beads to migrate upwards on wall.\n102. Transfer mRNA (supernatant) to a new RNase-free 1.5-ml LoBind tube and measure the mRNA concentration.\nPool all eluted mRNA of the same screen/sample. Save 200 ng of pooled mRNA for gel analysis.\nReverse transcription (RT)/first-strand cDNA synthesis\nUsing a reporter transcript–specific RT primer (GSP) allows processing of up to 4 to 5 µg mRNA per RT reaction. To determine the number of RT reactions, divide the RNA concentration by 5 and round this number up to the nearest multiple of 5 (e.g., 4 becomes 5; 8 becomes 10). This is the total number of RT reactions per sample\n103. Prepare RT master mix I (MMI). For one reaction:\n         \nX µl mRNA (divide total volume of mRNA by total number of RT reactions)\n1 µl dNTP mix (10 µM)\n1 µl GSP (2 µM) (gene-specific RT primer; CTCATCAATGTATCTTATCATGTCTG)\nMake up to 13 µl with RNase-free H2O.",
    "Process five RT reactions per tube (65 µl total volume).\nPerform 1 minus RT control (replace SSIII with H2O).\n104. Distribute 65 µl of RT master mix I per well to PCR strip (corresponding to 5 reactions/well).\n105. Incubate at 65°C for 5 min in a thermal cycler, then transfer to ice for 1 min.\n106. Prepare RT master mix II (mix thoroughly). For one reaction:\n         \n4 µl 5× first-strand buffer\n1 µl DTT (0.1 M)\n1 µl RNase Inhibitor (40,000 U/ml)\n1 µl SuperScript III (H2O for minus RT control)\nUse same number of reactions as in step 103.\n107. Add 35 µl RT reaction mix II to 65 µl RT reaction mixture I (5 reaction/well: final volume: 100 µl).\n108. Add 7 µl minus RT reaction mix II to 13 µl RT reaction mix I.\n109. Incubate in thermal cycler at 50°C for 1 hr, then 70°C for 15 min, and hold at 4°C, to prepare the cDNA.\nOptional: samples can be stored at −20°C.\nRNaseA treatment\nCAUTION: Avoid pipetting RNaseA next to RNase-free working space.\n110. Add 1 µl RNaseA (10 mg/ml) per five RT reactions (100 µl).\n111. Add 0.2 µl RNaseA per minus RT reaction.\n112. Incubate for 1 hr at 37°C in thermal cycler.\nOptional: Samples can be stored at −20°C\ncDNA purification with AMPure XP beads\nBefore starting:\n         \nPrepare 80% ethanol (diluted with RNase-free/DEPC-treated MonoQ H2O)\nWarm AMPureXP beads to room temperature\nResuspend AMPureXP beads thoroughly by vortexing before use.\n113. Pool all cDNA samples, mix them thoroughly, and distribute 200 µl (= 10 RT reactions) into 1.5-ml LoBind tubes.\nProcess minus RT reaction separately.\n114. Add 1.8 vol AMPureXP beads to 1 vol cDNA (add 360 µl beads to 200 µl cDNA; 36 µl to minus RT) in 1.5-ml LoBind tubes.",
    "115. Mix thoroughly by vortexing briefly and pipetting up and down 20 times.\n116. Incubate for 15 min at room temperature.\n117. Transfer to magnetic separator and incubate 10 min at room temperature.\nKeep tubes/samples on magnetic separator for the following steps (except elution), pipette on opposite tube wall.\n118. Remove all liquid.\n119. Wash the beads twice with 1 ml 80% ethanol while on magnet, incubating 2 min each time.\nMake sure that beads are covered completely.\n120. After the second wash, completely remove the ethanol.\n121. Dry the beads at room temperature for 5 to 10 min, allowing the evaporation of any remaining ethanol.\nKeep tubes on magnet with open lids. Avoid over-drying and elute as soon as the bead pellet starts to show crack.\n122. To elute, add 20 µl H2O per RT reaction (100 µl per tube). Close the tube and remove from the magnet.\n123. Resuspend the beads completely by vortexing thoroughly, and incubate at 37°C on a thermomixer for 3 min while shaking (300 rpm).\n124. Transfer the beads/tubes immediately onto the magnetic separator and incubate for 1 min.\nCarefully tilt magnet to allow beads to migrate upwards on wall.\n125. Transfer cDNA (supernatant) to a new RNase-free 1.5-ml LoBind tube.\n126. Pool all cleaned-up cDNA samples (except minus RT).\nFor the subsequent steps (step 127 onwards; step 144 onwards), the template for each PCR reaction is the equivalent of one RT reaction (1 RT reaction/4 to 5 µg mRNA = 1 PCR reaction).\nJunction PCR (jPCR)\nThe number of junction PCR (jPCR) reactions corresponds to the number of RT reactions.\nEach cleaned-up RT reaction/cDNA sample (4 to 5 µg mRNA) serves as template for one jPCR reaction.",
    "The jPCR specifically enriches reporter transcripts and disfavors the candidate library plasmids, as the forward primer binds only to the spliced intron of the reporter transcript.\nThe complexity of the reporter transcript pool linearly correlates with amount of cDNA amplified.\nFor maximum complexity/coverage, amplify all of the cDNA during the junction PCR.\nCAUTION: When processing more than one STARR-seq screen in parallel, work extremely carefully to avoid cross contamination of screens. Ideally separate screens physically (e.g., work on different benches, use different pipets, regularly change gloves).\n127. Prepare the junction PCR (jPCR) master mix. For one reaction:\n         \n20 µl cDNA (= one RT reaction)\n25 µl KAPA 2× HiFi HotStart Ready Mix\n2.5 µl junction fw primer (10 µM)\n2.5 µl junction rev primer (10 µM),\nScale according to the number of RT reactions, i.e., perform the same number of jPCR reactions as RT reactions. Use the cDNA from one RT reaction as template for one junction PCR reaction.\n128. Vortex and briefly spin down.\n129. Distribute 50 µl master mix per well into PCR strips.\n130. Run the following PCR program:\n         \ntable:\n﻿0,1,2,3\n1 cycle:,45 s,98°C,(initial denaturation)\n16 cycles:,15 s,98°C,(denaturation)\n,30 s,65°C,(annealing)\n,70 s,72°C,(extension)\n1 cycle:,120 s,72°C,(final extension).\nThe extension time depends on the candidate library insert size (here 1.2 to 1.5 kb). Adjust the extension time according to candidate library insert size.\njPCR purification with AMPure XP beads\nBefore starting:\n         \nPrepare 80% ethanol (diluted with MonoQ H2O)\nWarm AMPureXP beads to room temperature\nResuspend AMPureXP beads thoroughly by vortexing before use.\n131. Pool all jPCR reactions (except minus RT), mix thoroughly, and distribute 250 µl (=five RT reactions; keep minus RT separate) into 1.5-ml LoBind tubes.",
    "132. Add 0.8 vol beads to 1 vol of PCR reaction (add 200 µl beads to 250 µl PCR reaction; 40 µl to minus RT) in a 1.5-ml LoBind tube, briefly vortex, then pipette up and down 20× to mix.\n133. Incubate 15 min at room temperature.\n134. Transfer to magnetic separator and incubate 10 min at room temperature.\nKeep tubes/samples on magnetic separator for the following steps (except elution); pipette onto opposite tube wall.\n135. Remove all liquid.\n136. Wash twice with 1 ml 80% ethanol, incubating 2 min (while on magnet) for each wash.\nMake sure that beads are covered completely.\n137. After the second wash, make sure to remove ethanol completely.\n138. Dry beads at room temperature to allow evaporation of remaining 80% ethanol for 5 to 10 min.\nKeep tubes on magnet with open lids.\nAvoid over-drying and elute as soon as the bead pellet starts to show cracks.\n139. To elute, add 20 µl EB per jPCR reaction (100 µl per tube), close the tube, and remove from magnet.\n140. Resuspend beads completely by vortexing thoroughly and incubate at 37°C on thermomixer for 3 min while shaking (300 rpm).\n141. Transfer beads/tubes immediately onto magnetic separator and carefully tilt magnet to allow the beads to migrate upwards on wall. Incubate for 1 min.\n142. Transfer supernatant to new tube.\n143. Pool all cleaned-up jPCR reactions (except minus RT)\nSequencing-ready PCR\nThe sequencing-ready PCR is the final amplification step, preparing the STARR-seq screens for Illumina sequencing.",
    "First, perform a test PCR to determine how many PCR cycles (usually between five and nine) are necessary to amplify STARR-seq transcripts to a level that provides sufficient material for deep sequencing, while avoiding overamplification. Do not use <5 cycles for the PCR amplification of the STARR-seq cDNA. The minus RT control should be amplified with the highest number of cycles used during the test PCR. The minus RT reaction controls for plasmid DNA contamination of the STARR-seq reporter cDNA and should not result in a PCR product.\nTest PCR\n144. Prepare the test PCR mix:\n         \n20 µl jPCR (from pool) or 20 µl minus RT\n2.5 µl Illumina i5 primer (10 µM)\n2.5 µl Illumina i7 primer (10 µM)\n25 µl KAPA 2× HiFi HotStart Ready Mix.\n145. Amplify the jPCR product with five and nine cycles using the following PCR program:\n         \ntable:\n﻿0,1,2,3\n1 cycle:,45 s,98°C,(initial denaturation)\n5 or 9 cycles:,15 s,98°C,(denaturation)\n,30 s,65°C,(annealing)\n,45 s,72°C,(extension)\n1 cycle:,120 s,72°C,(final extension).\n146. Amplify the minus RT reaction with nine cycles only.\nGel analysis\n147. Perform gel electrophoresis of the test PCR using a 1% agarose gel (well size ∼15 µl) at 145 V for 15 min (Voytas, 2000[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0041]).\n148. Load 10 µl of each test PCR mixed with 2 µl 6× DNA loading dye.\n149. Determine the optimal number of PCR cycles by band intensity of the PCR product after five and nine PCR cycles on the 1% agarose gel (see Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-fig-0002]).\nFor the example in Figure 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-fig-0002], a faint band/smear is observed around 1.2 to 1.5 kb after five cycles and overamplification after nine cycles (in this case use five cycles to amplify the jPCR products).",
    "If five cycles already result in overamplification, reduce the amount of template (jPCR product) per sequencing-ready PCR reaction. Use 5 µl template and repeat test PCR.\nDo not reduce the number of cycles for the junction PCR to compensate!\nIf you do not detect a band after nine cycles, repeat the test PCR with 12 cycles. A higher number of cycles may indicate low complexity of the reporter transcript pool (e.g., due to poor performance of the transfection or RNA processing). A high number of PCR cycles (>10 to 15) increases the risk of PCR duplications and may lead to poor STARR-seq signals.\nSequencing-ready PCR\nUse the number of PCR cycles which was determined via “test PCR” (step 144 to 149). Perform two sequencing-ready PCRs for focused (BAC) and 10 to 20 for genome-wide screens. Use different Illumina index primers for each STARR-seq screen to allow multiplexed deep sequencing.\n150. Prepare the sequencing-ready master PCR mix (scale accordingly):\n         \n20 µl jPCR product\n2.5 µl Illumina i5 primer (10 µM)\n2.5 µl Illumina i7 primer (10 µM)\n25 µl KAPA 2×HiFi HotStart Ready Mix.\n151. Distribute the master mix to PCR strips (50 µl per well) and run the sequencing-ready PCR:\n         \ntable:\n﻿0,1,2,3\n1 cycle:,45 s,98°C,(initial denaturation)\nx cycles*[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-tbl-note-0001]:,15 s,98°C,(denaturation)\n,30 s,65°C,(annealing)\n,45 s,72°C,(extension)\n1 cycle:,120 sec,72°C,(final extension).\n*Number of cycles as determined in test PCR.\nSequencing-ready PCR purification with SPRIselect beads\nBefore starting:\n         \nPrepare 80% ethanol (diluted with MonoQ H2O)\nWarm SPRIselect beads to room temperature\nResuspend SPRIselect beads thoroughly by vortexing before use\nIt is important to use SPRIselect beads, to allow the selective purification of DNA >800-1000 bp.\n152. Pool all sequencing-ready PCR reactions, mix thoroughly, and distribute 100 µl (= 2 reactions) for focused or 500 µl (= 10 reactions) for genome-wide screens to 1.5-ml LoBind tubes.",
    "153. Add 0.5 vol SPRIselect beads to 1 vol of PCR reaction (add 250 µl beads to 500 µl PCR reaction) in 1.5-ml LoBind tubes, briefly vortex, and pipette up and down 20 times to mix.\nIt is critical to precisely mix the exact volumes of SPRIselect beads and PCR reaction at a ratio of 0.5 (beads/PCR), as the beads do not bind DNA at ratios lower than 0.5. Using a too low a volume of beads leads to loss of the sample.\nA ratio of 0.5 is used to specifically purify the sequencing-ready PCR products and exclude all nonspecific products that are smaller than 1000 bp.\n154. Incubate 10 min at room temperature.\n155. Transfer tubes to magnetic separator and incubate 10 min at room temperature.\nKeep tubes/samples on magnetic separator for the following steps (except elution); pipette onto opposite tube wall.\n156. Transfer entire supernatant to a new tube.\nKeep supernatant until successful purification is confirmed; in case the PCR products failed to bind to the beads, they can be re-extracted from the supernatant.\n157. Wash beads twice with 1 ml 80% ethanol, incubating 2 min (while on magnet) each time.\nMake sure that beads are covered completely.\n158. After the second wash, make sure to remove 80% ethanol completely.\n159. Dry beads at room temperature to allow evaporation of remaining 80% ethanol for 2 to 5 min.\nKeep tubes on magnet with open lids. Avoid over-drying and elute as soon as the bead pellet starts to show cracks.\n160. To elute, add 10 µl nuclease-free H2O per PCR reaction (two reactions: 20 µl, 10 reactions: 100 µl), close the tube, and remove from magnet.\n161. Resuspend the beads completely by vortexing thoroughly and incubate at 37°C on thermomixer for 3 min while shaking (300 rpm).",
    "Transfer beads/tubes immediately onto magnetic separator and carefully tilt magnet to allow the beads to migrate upwards on wall. Incubate for 1 min.\n162. Transfer supernatant/sample to a new tube.\n163. Pool all purified sequencing-ready PCR samples.\n164. Measure the DNA concentration (see Current Protocols article: Gallagher & Desjardins, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0010]).\n165. Check the successful purification of the sequencing-ready PCR products on a 1% agarose gel (see Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-fig-0003]). Also see Current Protocols article: Voytas (2000[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-bib-0041])\nLoad 10 µl pooled PCR product (unpurified), 10 µl of the supernatant, and 250 ng cleaned-up PCR product.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/2f42e986-6c58-4c35-89db-704642d16684/cpmb105-fig-0003-m.jpg</p>\nFigure 3\nSequencing-ready PCR on 1% agarose gel (lanes): left lane, Fermentas GeneRuler 1 kb plus; (1) 10 µl of the pooled PCRs; (2) 10 µl of the supernatant, taken after PCR has bound to the beads; and (3) 250 ng cleaned-up PCR product.\n166. Submit ∼500 ng sample for Illumina deep sequencing.\nFinal concentration should be ∼5 to 10 ng/µl.\nIdeally sequence paired-end. Single-read sequencing is also possible at the expense of the loss of fragment-length information (for analysis, reads should be extended by the median size of the STARR-seq plasmid library; see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0001], step 12). Use the same sequencing mode for STARR-seq screen and STARR-seq plasmid library (input; Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0001], step 126).\n167. Store sample at −20°C.",
    "This protocol is an addition to the standard STARR-seq protocol (Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0002]) and explains how to introduce unique molecular identifiers (UMIs) into the reporter transcripts prior to amplification (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-fig-0001], right). This allows the counting of individual reporter transcripts, which is preferable when performing STARR-seq with low-complexity candidate libraries that are prone to PCR-amplification biases, especially when individual candidates or defined synthetic oligos are screened. Note that a spike-in control might be needed for normalization (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0002], steps 47 to 62, spike-in control for library normalization.\nAs this protocol is a variant of Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0002], only steps that deviate are described (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-fig-0001], right). Please follow Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0002] until RNaseA treatment (step 112).\nDuring this protocol, indexing of different STARR-seq screens is only possible using the i5 index, as the i7 index is replaced with the UMI, making it possible to count individual reporter transcripts. It is important to note that the UMI will be read during deep sequencing on an Illumina platform as Index 1 (i7) read. This requires that the Index 1 (i7) read be read for 11 cycles (instead of the standard 8 cycles) to account for the UMI length (10 nucleotides).\nFor the sequencing-ready PCR, replace the Illumina i7 index primer with P7-seqReady rev primer (10 µM) (CAAGCAGAAGACGGCATACGAGA*T).\nAdditional Materials (also see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0002])\nPrimers:\n               \nSecond strand primer: GTCGTGAGGCACTGGGCA*G\nP7-UMI-primer: CAAGCAGAAGACGGCATACGAGATNNNNNNNNNNGTGACTGGAGTTCAGACGTGT*G\nP7-junction rev primer: CAAGCAGAAGACGGCATACG*A\nP7-seqReady rev: CAAGCAGAAGACGGCATACGAGA*T\n* = phosphorothioate bond (protection of primer from 3′ to 5′ exonuclease activity of proof-reading DNA polymerase; especially important for junction fw primer that specifically binds across the splice junction of the reporter transcripts/cDNA)",
    "NOTE: This protocol is identical to Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0002] until step 112, and only deviates from “cDNA purification after RNaseA treatment” on. Please follow Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0002], steps 1 to 112, and then continue with this Alternate Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0003] starting from step 1. After step 16, switch back to Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0002] and continue from step 131, with the exception of using the UMI-STARR-seq-specific primers (see Alternate Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0003]).\ncDNA purification after RNaseA treatment\nBefore starting:\n         \nPrepare 80% ethanol (diluted with nuclease-free MonoQ H2O)\nWarm AMPureXP beads to room temperature\nResuspend AMPureXP beads thoroughly by vortexing before use.\n1. Pool all cDNA samples, mix thoroughly, and distribute 200 µl (=10 RT reactions; keep minus RT separate) to 1.5-ml LoBind tubes.\n2. Add 1.4 vol beads to 1 vol of cDNA (add 280 µl beads to 200 µl cDNA; 28 µl to minus RT) in 1.5-ml LoBind tube, briefly vortex, then pipette up and down 20 times to mix.\n3. Incubate 15 min at room temperature.\n4. Transfer to magnetic separator and incubate 10 min at room temperature.\nKeep tubes/samples on magnetic separator for the following steps (except elution); pipette onto opposite tube wall.\n5. Remove all liquid.\n6. Wash twice with 1 ml 80% ethanol, incubating 2 min (while on magnet) each time.\nMake sure that beads are covered completely.\n7. After second wash, make sure to remove 80% ethanol completely.\n8. Dry beads at room temperature to allow evaporation of remaining 80% ethanol for 5 to 10 min.\nKeep tubes on magnet with open lids. Avoid over-drying (elute as soon as the bead pellet starts to show cracks).\n9. To elute, add 43 µl nuclease-free H2O per five RT reactions (86 µl per tube), close tube, and remove from magnet.",
    "10. Resuspend beads completely by vortexing thoroughly and incubate at 37°C on thermomixer for 3 min while shaking (300 rpm).\n11. Transfer beads/tubes immediately onto magnetic separator and carefully tilt magnet to allow the beads to migrate upwards on wall. Incubate for 1 min.\n12. Transfer supernatant/sample to new tube.\n13. Pool all cleaned-up cDNA samples (except minus RT).\nSecond strand synthesis\nDuring this reaction, the second DNA strand of the reporter cDNA is synthesized by a linear PCR reaction without amplification, using a DNA polymerase (KAPA HiFi HotStart DNA Polymerase) and a reporter transcript–specific forward primer. The resulting double-stranded reporter DNA will then be competent for UMI introduction.\n14. Prepare the master mix for the second-strand synthesis.\nProcess the entire pool of cDNA. Scale the master mix accordingly.\nSecond-strand synthesis mix (for one reaction):\n42.5 µl cDNA (=5 RT reactions)\n50 µl KAPA 2 × HiFi Hot StartReady Mix\n7.5 µl second-strand primer (10 µM) (GTCGTGAGGCACTGGGCA*G)\nPerform the following thermal cycling program:\n         \ntable:\n﻿0,1\nDenaturation:,98°C for 60 s\nAnnealing:,65°C for 30 s\nElongation:,72°C for 90 s.\nThe elongation time depends on the library insert size.\ncDNA purification\nPlease follow Alternate Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0003], steps 1 to 13.\nUnique molecular identifier introduction (UMI-PCR)",
    "This reaction adds a UMI to each reporter transcript by a linear PCR reaction (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-fig-0001], right). To introduce the UMI, we use a modified Illumina i7 index primer containing 10 random nucleotides at the position of the Illumina i7 index. The UMI-containing primer binds to the reverse Illumina adapter (P7) and replaces the original Illumina i7 index (Illumina i7 primer) that binds at this position in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0002] step 150. This makes it possible to read the UMI during Illumina sequencing as Index 1. As the UMI is 10 nucleotides long, the Index 1 during Illumina sequencing needs to be read for 11 bp.\nNote: the UMI introduction is also possible at the RT step but is not recommended as it leads to reduced specificity towards the STARR-seq reporter transcripts.\n15. Prepare the master mix for the UMI -PCR (linear UMI-PCR reaction mix):\n         \n42.5 µl cDNA (second-strand cDNA =five RT reactions)\n50 µl KAPA 2× HiFi Hot Start ready Mix\n7.5 µl P7-UMI primer (10 µM) (CAAGCAGAAGACGGCATACGAGATNNNNNNNNNNGTGACTGGAGTTCAGACGTGT*G)\nPerform the following thermal cycling program:\n         \ntable:\n﻿0,1\nDenaturation:,98°C for 60 s\nAnnealing:,65°C for 30 s\nElongation:,72°C for 90 s.\ncDNA purification (UMI-PCR)\nPlease follow Alternate Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0003], steps 1 to 13.\n16. Elute in 20 µl nuclease-free H2O per RT reaction (100 µl per tube).\nJunction PCR\nSee Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0002], step 127, for the junction PCR master mix; use 20 l UMI-PCR from step 16 as template. Replace the junction rev primer with the P7-junction rev primer (10 µM) (CAAGCAGAAGACGGCATACG*A) using the following PCR program:\n         \ntable:\n﻿0,1,2,3\n1 cycle:,45 s,98°C,(denaturation)\n16 cycles:,15 s,98°C,(denaturation)\n,30 s,65°C,(annealing)\n,70 s,72°C,(extension)\n1 cycle,2 min,72°C,(final extension).\nPurification of jPCR\nPlease follow Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0002], steps 131 to 143.\nSequencing-ready PCR\nPlease follow Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0002] from here on—“Sequencing ready PCR”—step 144.",
    "Indexing of STARR-seq screens can only be done using the i5 index as the i7 index is replaced by the UMI.\nFor the sequencing-ready PCR, replace the Illumina i7 index primer with P7-seqReady rev primer (10 µM) (CAAGCAGAAGACGGCATACGAGA*T).",
    "This protocol describes the transfection of human cells by electroporation using the MaxCyte STX scalable transfection system. This is the standard protocol we use in our lab for the electroporation of STARR-seq plasmid libraries into human and Drosophila cells. This support protocol yields very high transfection efficiency (>60% to 90%) and cell viability (75% to 90%).\nAdditional Materials (also see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0002])\nElectroporation buffer (MaxCyte cat. no. EPB1),\nClinical Processing Assembly, OC-100 100-µl (MaxCyte cat. no. GOC1)\nClinical Processing Assembly, OC-400 400-µl (MaxCyte cat. no. GOC4)\n1. Grow cells and split 24 hr before transfection to reach 4 × 108 cells at 80% confluency on electroporation day.\nFor genome-wide screens, use 4 × 108 per replicate; for focused screens (BAC screens), use 8 × 107 cells. These numbers were determined in HCT116 cells (transfection efficiency >80%, viability >90%). The number of cells may vary, depending on cell line and transfection method.\n2. Remove the medium completely.\n3. Wash cells with 1× PBS then remove PBS completely.\nFor adherent cells: add trypsin and incubate at 37°C for 4 to 5 min. Add growth medium and resuspend cells by pipetting up and down thoroughly.\n4. Collect the cells from all plates/flask and count cells using automated cell counter.\n5. Transfer 4 × 108 cells (for genome-wide screen) to a 50-ml tube (calculate corresponding volume according to cell counts). For focused screen, use 8 × 107 cells.\n6. Spin down cells for 5 min at 125 × g.\n7. Remove medium, resuspend cell pellets in ∼10 ml electroporation buffer, and pool all cells.\n8. Spin down cells 5 min at 125 × g.\n9. Remove electroporation buffer and add the STARR-seq plasmid library to the loosened cell pellet [library concentration needs to be >1.0 µg/µl in H2O (H2O is mandatory)].",
    "Use 80 µg library per 4 × 107 cells.\nFor a genome-wide screen, use a total of 800 µg STARR-seq plasmid library and 4 × 108 cells.\n10. Fill up the cell/library mix with electroporation buffer (account for the previous added STARR-seq library and cell pellet) to a final volume of 4 ml.\n11. Use cell-line specific pre-set transfection protocol of the MaxCyte STX scalable transfection system. Electroporate in steps of 400 µl (for genome-wide screen, 10 steps, and for focused screen, 2 in total) using OC-400 processing assemblies (cuvettes). Transfer all cells after electroporation into a single pre-warmed T-225 flask.\n12. Allow cells to recover for 25 min post-electroporation without adding growth medium at 37°C.\nThe recovery of the electroporated cells without growth medium is critical for optimal viability and transfection efficiency.\n13. Transfer the T-225 flask containing the electroporated cells (without medium) to a 37°C incubator for 25 min.\n14. After 25 min, add 350 ml growth medium without antibiotics to the recovered cells (focused screen 70 ml).\nFor cells with interferon (INF) response, add 350 µl (70 µl for focused screen) of a 1 mM stock of C16 and BX-795 inhibitors to the cells (final concentration 1 µM/inhibitor).\n15. Plate the transfected cells onto five square plates, with 70 ml/square plate (24.5 × 24.5 cm) corresponding to 80 million cells/square plate. For a focused screen, plate the cells on one square plate.\n16. Incubate cells for 6 hr, i.e., lyse cells 6 hr after addition of the growth medium (step 14).\nTo ensure that the cells can be lysed after 6 hr, we recommend that harvesting of the cells be started already after 5 hr when performing genome-wide screens.\n17. Continue with Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmb.105#cpmb105-prot-0002] step 20—harvesting of cells."
  ],
  "subjectAreas": [
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}