{
  "id": 3189,
  "origin_website": "Cell",
  "title": "Developmental-stage specific single-cell human embryo dissociation",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nZona pellucida removal (for cleaved embryos, morula, early blastocyst stages (B1/B2 according to Gardner’s classification)\nTiming: 5–15 min\nThe goal is to retrieve the embryo from the zona pellucida.\nThis step is only performed if processing cleavage stage, morula stage and early blastocyst stage embryos (B1/B2). The operator performs brief laser impulses (around 9) to open the zona pellucida.\nIn the GPGD/HSA droplet hold and immobilize the embryo with the holding micropipet.\nUse the laser to perform the hole, shoot the zona pellucida as far as possible of cells to open a hole large as 1.5× the biopsy micropipet (with a ZILOS-tk Hamilton-Thorne we use a laser power at 100% for 300 μs). A hole is visible in the zona pellucida (Figure 2[href=https://www.wicell.org#fig2]A and Methods video S1[href=https://www.wicell.org#mmc1]: Zona pellucida removal for cleaved embryos).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2761-Fig2.jpg\nFigure 2. Single-cell picking at each developmental stage (scale bar 30 μm)\n(A) Sample images of laser opening of zona pellucida at indicated developmental stages.\n(B) Snapshots showing an expanded blastocyst before, during and after laser dissection.\n(C) Snapshots showing a 10-cell embryo before, during and after biopsy.\n(D) Snapshots showing a morula before and after biopsy.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2761-Fig3.jpg\nFigure 3. Trouble shooting examples (scale bar 30 μm)\n(A) Embryo morphology associated with recommended processing.\n(B) Examples of retracted, hatching and hatched blastocysts.\n    Your browser does not support HTML5 video.\n  \n      Methods video S1. Zona pellucida removal for cleaved embryos, related to step 1 and 2\n    \nLaser opening of zona pellucida at 7 cells stage.\nMural / polar laser dissection\nTiming: 5–15 min",
    "This step is specifically for expanded blastocysts (B3/B4 according to Gardner’s classification3[href=https://www.wicell.org#bib3]). At this stage, dissociating polar vs. mural is critical, either to focus the analysis on the polar side, that contains the 3 main cell types of interest: epiblast (EPI), primitive endoderm (PrE) and trophectoderm (TE), or to capture differential-maturation events between mural and polar TE.\nThe operator starts by performing brief laser impulses to separate the polar TE and Inner cell mass (ICM) from the mural TE of the blastocyst (Figure 2[href=https://www.wicell.org#fig2]B and Methods video S2[href=https://www.wicell.org#mmc2]: Mural / polar laser dissection).\nIn the droplet, with the help of micropipettes, rotate the embryo in order to have the polar side close to the holding micropipet.\nHold and immobilize the blastocyst to strongly maintain the polar side in front of the holding micropipet.\nPlace the biopsy micropipet as close as possible to the mural trophectoderm, at the complete opposite side and apply a gentle suction pressure.\nUse the laser to perform the dissection.\nShoot the zona pellucida and the trophectoderm as close as possible to the ICM, in each visible cell junction from one side to the other (up and down on the screen, 3 times, with a ZILOS-tk Hamilton-Thorne we use a laser power at 100% for 700 μs).\nSimultaneously separate the 2 parts progressively by pulling each micropipet apart.\nUse the laser until the 2 parts (mural and polar) are fully separated.\nCritical: Aspiration / holding setup should be equilibrated. Embryo should be placed at the bottom of the dish to ensure stability and homogeneous laser power.\n    Your browser does not support HTML5 video.\n  \n      Methods video S2. Mural / polar laser dissection, related to step 3 and 4\n    \nExpanded blastocyst laser dissection.\nSingle cell dissociation at cleavage stage and morula stage\nTiming: 5–20 min",
    "Once extruded or aspirated through the zona pellucida hole, cells should be gently pipetted in and out with 135 μm tips in G-PGD/HAS solution at 37°C to be individualized (Figure 2[href=https://www.wicell.org#fig2]C and Methods video S3[href=https://www.wicell.org#mmc3] Single cell dissociation at morula stage).\nPerform the cell dissociation:\nTriturate with gentle pipette flush under stereo microscope. G-PGD-HAS solution allows very easy dissociation of the cells.\nSingle cell can be isolated by aspiration and flushing.\nNote: It is important to respect tips size to avoid breaking cell membrane.\nWashing may be necessary depend on the analysis performed. Three washing steps in individual droplets of appropriate medium (often PBS) is recommended.\nReplace cell isolated in the adapted container for your analysis.\n    Your browser does not support HTML5 video.\n  \n      Methods video S3. Single cell dissociation at morula stage, related to step 5\n    \nLaser opening of zona pellucida and cell biopsy a morula stage incubated in decompaction media.\nSingle cell dissociation at B1/B2 stage, B3/B4 or B5/B6 hatched blastocysts\nTiming: 15–60 min\nEmbryos or embryo sections were incubated in G-PGD/HSA and transferred in Accutase. Embryos were gently pipetted in and out under stereo microscope. Single-cells/clumps were washed in GTL and gently pipetted in and out again if necessary. Single-cells were picked one by one upon dissociation (Figure 2[href=https://www.wicell.org#fig2]D).\nThe mural or polar section, or the entire blastocyst, is incubated in the GPGD droplet for 10 min at 37°C with a 170 μm tips.\nNote: Repeated aspirations and flush helps homogeneous diffusion of the media.\nPlace the section or the entire blastocyst in the accutase droplet for 3–4 min at room temperature with a 135 μm tips.\nPipet in and out around thirty to fifty times the cell cluster in the droplet with gentle pipette flush under stereo microscope.",
    "During pipetting, to avoid, bubbles formation or cell lost, use the three droplets.\nSingle cell can be picked as soon as they individualize (Methods video S4[href=https://www.wicell.org#mmc4] Isolation of single cells after accutase treatment of blastocysts).\nPlace the single cell or the clumps in the first GTL droplet at room temperature with a 75 μm tips.\nTriturate with gentle pipette flush under stereo microscope.\nSingle cell can be isolated by aspiration and flushing.\nWashing may be necessary depend on the analysis performed. Three washing steps in individual droplets of appropriate medium (often PBS) is recommended\nReplace cell isolated in the container adapted for your downstream analysis.\nCritical: Steps 1 to 6 are performed at 37°C; steps 7 to 8 - with accutase - were performed at room temperature.\n    Your browser does not support HTML5 video.\n  \n      Methods video S4. Isolation of single cells after accutase treatment of blastocysts, related to step 7\n    \n2 single cells are highlighted at the beginning of the video. Upon pipetting of the remaining clump of cells, a third cell is isolated."
  ],
  "subjectAreas": [
    "Single Cell",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}