{
  "id": 13201,
  "origin_website": "Jove",
  "title": "Imaging and Analysis of Tissue Orientation and Growth Dynamics in the Developing Drosophila Epithelia During Pupal Stages",
  "procedures": [
    "NOTE: This protocol is divided into five steps: (1) staging the pupae, (2) preparing the pupae for imaging, (3) live imaging of the growing abdominal epithelia, (4) generation of genetic mosaics, (5) data processing and analysis (including sections describing how to analyze cell orientation dynamics from cell junction outlines and growth dynamics from cell clones).\n1. Staging of Drosophila pupae before imaging\nCulture flies of the appropriate genotype on standard medium in plastic vials at 25 °C for 5 days (±12 h) after egg laying (AEL).\n\tNOTE: Metamorphosis starts within the confinement of the third-instar larvae into the pupal case at 120 h AEL until 0 h after puparium formation (APF). This transition is easily identifiable, because larvae stop feeding and moving and the opercular region is formed (Figure 1A) at 0-12 h APF. The puparium is initially soft and white, but progressively hardens and tans.\nTransfer white prepupae (0 h APF) to a fresh plastic vial using a moisten paintbrush. Animals can be kept at different temperatures depending on the designed experiment until the desired age.\n\tNOTE: Pupa formation (i.e., pupation) occurs at 12 h APF, when the head and the appendages of the adult fly are totally everted (Figure 1A). By this time the pupal case is fully separated from the pupa, allowing its complete removal (Figure 1A).\n2. Preparing pupae for live imaging\nNOTE: After staging, the pupae are dissected and mounted as described below (see also Figure 1).\nRemove staged pupae from the wall of the vial with the help of the forceps.",
    "Glue the ventral side of each pupa on a glass slide covered with double-sided sticky tape. Gently tap on the head spiracles (i.e., opercular region) and the dorsal surface of the pupa with the tips of the forceps to assure the adhesion of the pupal case to the tape (Figure 1A,B).\n\tNOTE: The dorsal surface should face up to facilitate the dissection of the case and the recovery of the pupa.\nBegin dissection under a stereomicroscope by gently removing the operculum from the puparium with the forceps (Figure 1C).\nInsert one tip of the forceps in a shallow angle between the pupal case and the pupa surface through the opercular opening. Tear the case from head to tail laterally in one or more swings, avoiding pinching the pupa (Figure 1D). Fold back the cracked pupal case to the lateral sides as you keep proceeding to the posterior end (Figure 1E).\n\tNOTE: The pupal case is quite rigid and cracks easily. In case of high humidity or in particular genotypic backgrounds, the pupal case becomes softer and tearing is more difficult. In these cases, the cracking of the pupal case can be helped by pricking its free edges with both tips of the forceps.\nRemove the pupa from the opened-up pupal case by carefully inserting the forceps under the animal and gently pulling up (Figure 1F). The pupa will stick to the tip of the forceps (Figure 1G−H).\nTransfer the pupa with the help of the forceps to a glass-bottom dish and deposit it on top of a small drop of gas-permeable halocarbon oil (Figure 1I). Hold the pupa gently by the ventral side to avoid any possible tissue damage.",
    "NOTE: The drop of halocarbon oil has to be small, with a diameter approximately less than half the length of the pupa. Such amount is sufficient to adhere the pupa to the glass by capillarity and to correct the optics for oil immersion objectives.\nRoll a piece of wet tissue paper at the edges of the dish to maintain humidity. Cover the dish to avoid dehydration of the pupae during imaging.\n\tNOTE: Both female and male pupae can be employed for imaging. We recommend employing the third abdominal segments (AIII) as a reference abdominal metamere since it is almost identical in both sexes in terms of size, shape, and patterning.\n3. Live imaging of growing abdominal epithelia\nNOTE: An inverted laser scanning confocal microscope equipped with a 40x/1.3 NA oil immersion objective was used to image pupae at different developmental stages.\nOrient the pupa over the oil drop on the glass-bottom dish according to the domain and the process to be evaluated (e.g. dorsolaterally for long-term live imaging of the early expansion of the dorsal nests, or dorsally to image their late expansion and tissue remodeling). See Figure 1J,K and Figure 4.\nTransfer the glass-bottom dish containing the mounted pupae to the microscope stage and focus on the surface of the abdominal area using the transmitted light.\n\tNOTE: Even if this protocol is optimized for imaging on inverted microscopes, it is also possible to perform imaging on an upright microscope. In that case, the sample is placed on the microscope stage with the glass-bottom surface facing up. The halocarbon oil holds each pupa on a meniscus.",
    "Set the acquisition parameters: 1) the number of Z-slices are usually between 20−40 to allow appropriate two-dimensional (2D) reconstruction of the abdominal epidermis; 2) step size between each slice (e.g., 1 micron); 3) time interval for recording (a 5 min interval is suitable for high fidelity analyses of cell orientation dynamics); and 4) frame resolution (e.g., 1024 x 1024).\nTurn on the appropriate lasers (i.e., 488 nm and 561 nm to visualize GFP and RFP fluorophores respectively) and adjust the laser power and gain/offset settings to visualize the marked cells. Use the lowest possible laser power (in the range 5%−20%) to minimize photobleaching and phototoxicity.\nManually set the position and the appropriate Z-stack limits for multiple pupae using the attached motorized stage and the microscope multiposition acquisition software.\n4. Generation of genetic mosaics to follow behaviors of cell clones\nNOTE: We employ mitotic recombination to induce genetic mosaics in the abdominal epithelium via site-specific recombination (FLP/FRT system21,22) (Figure 2).\nCross virgin females carrying a heat shock-inducible Flippase transgene (hs-FLP), a FLP recognition target (FRT) site at a specific genomic location (e.g., FRT site at position 40A at the L arm of chromosome 2), and a recognizable cellular marker (e.g., Ubi-RFP.nls or Ubi-GFP.nls) distal to the FRT site, to mutant males carrying an FRT site at the equivalent genomic location (Figure 2A−C).\n\tNOTE: Autonomous and nonautonomous effects within or outside clones for any gene loss of function could be studied employing specific recessive alleles distal to the FRT site.",
    "Generate FLP/FRT somatic clones in the histoblasts by heat shock treatment at the third instar larval stage of the progeny of the cross. This is performed by submerging the plastic vials containing the animals in a water bath at 37 °C for 45 min to 1 h at the wandering larvae (LIII) stage.\n\tNOTE: The sensitive period for mitotic recombination is the G2 phase of the cell cycle. Histoblasts are arrested in G2 during the whole larval development.\nScore twin clones for absence (i.e., mutant cells) or enhanced (i.e., wild type twin-spot cells) levels of the fluorescent protein marker from 16 h APF onward (Figure 2D).\n\tNOTE: On average, 45 min to 1 h at 37 °C renders approximately only 2−3 twin clones per region of interest (e.g., the abdominal hemisegment). Pupae showing too a high clone density (e.g., more than four twin clones per hemisegment) should be discarded from further quantitative analyses.\nUpon clone identification, image living pupae at the desired stage and for the desired length of time as described in the previous section.\n5. Data processing and analyses\nNOTE: Data are processed using ImageJ (imagej.nih.gov/ij/).\nDistinguish cell orientation dynamics from cell junction outlines.\n\t\nProject the Z-stack slices acquired by confocal microscopy in 2D using the Maximum Intensity Projection (MIP) function of ImageJ.\n\t\tNOTE: The number of slices per stack should be kept to a minimum to avoid the out of focus noise generated by macrophages patrolling under the epidermis.\nSet a planar coordinate system identifying reliable tissue landmarks (e.g., A/P compartment boundaries) for analysis of each dataset (Figure 3A).\n\t\tNOTE: Employing the same planar references for each data set will allow multiple measurements to be compared.",
    "Use the OrientationJ plugin (bigwww.epfl.ch/demo/orientation/) of ImageJ23,24 on local cell edges to obtain qualitative and quantitative orientation values. The plugin renders color-coded overlays on input images based on local orientations and provides numerical values when used in quantitative mode (Figure 3B−B'' and Figure C−C'''').\n\t\tNOTE: The OrientationJ plugin is based on structure tensors, 2 x 2 matrix of eigenvalues derived from gradient and directional derivatives (See references23,24 for a detailed description).\nUse the OrientationJ Distribution option to color-code cell edge orientations relative to the set planar coordinate system (i.e., cell edge orientation maps) (Figure 3B). The Distribution option is found under the plugin menu in ImageJ. The settings to employ are: Gaussian window sigma = 1 pixel; Cubic Spline = Gradient; Minimum Coherency = 20%; Minimum Energy = 1%. Cell edge orientations are displayed as a color-coded image employing the Color Survey option of the plugin (Hue = orientation; Saturation = coherency; and Brightness = input image).\n\t\tNOTE: Areas that contain background fluorescence do not provide any directional information and must be manually excluded from the analysis. High threshold settings reduce the pixels considered in the processed images.\nUse the OrientationJ Measure option to quantify cellular orientations and directional cell-cell alignment (i.e., coherency) (Figure 3C). The Measure option is found under the plugin menu in ImageJ. Generate small adjacent non-overlapping regions of interest (ROIs) of uniform weight (64 x 64 pixels, about 20 µm x 20 µm) within the area occupied by the histoblasts (Figure 3C).\nCalculate the dominant local orientation (i.e., the averaged orientation between neighboring cells-averaged cell edge orientation map) and coherency from the ROIs. The software computes the predominant orientation and local coherency within each ROI (Figure 3C).",
    "NOTE: The largest and smallest eigenvalues of the structure tensor estimated by OrientationJ are employed to calculate coherency as the ratio between their difference and their sum. Coherency is bounded between values of 0−1. A value of 1 indicates full alignment uniformity, while a value of 0 indicates isotropic areas with no alignment.\nStatistically analyze the calculated orientation and coherency values from multiple images using free software packages such as PAST25. Axial data such as orientation values (in degrees) are appropriately described by directional statistics.\nThrough the software, calculate the mean direction and circular variance for each set of orientation distributions. The statistical significance of the difference between the distribution of the orientations between different genotypes or conditions is determined using the nonparametric Mardia-Watson-Wheeler test (W-test) for equal distributions.\nCalculate the statistical significance of the difference in coherency applying the non-parametric Kolmogorov-Smirnov test (K-S test). Display data graphically as desired (polar plots, bar charts, box plots, etc.).\nGrowth dynamics from cell clones\n\tNOTE: The following steps allow retrieval of geometrical and shape parameters for cells from 2D MIP images containing the clone(s) of interest. For comparisons between multiple clones, images must be acquired with the same settings.\n\t\nSegment clone areas by drawing their contours with the ImageJ Freehand Selection tool.\nCalculate geometrical and shape parameters by using the Set Measurements tool of ImageJ under the Analyze menu. Activate the Area, Perimeter, Fit Ellipse, and Shape Descriptor options.",
    "NOTE: This will allow retrieval of diverse geometrical parameters including the area (sum of the pixels within the clone), the perimeter (sum of the pixel of the clone border), the aspect ratio (AR, the ratio between the major and minor axes of the best-fit Legendre ellipse inscribed into the clone border), and the angle of orientation (i.e, the angle of the major axis of the clone relative to the anteroposterior boundary).\nCalculating non-dimensional ratios from these measurements retrieves shape parameters. These include roundness (4 x [area]/π x [major axis]2), roughness (solidity - area/convex area), and circularity (4π x [area]/[perimeter]2).\n\t\tNOTE: Each of the shape parameters represents the degree of deviation of the clones from ideal shapes such as a circle or a bounded convex hull, and they are all bounded between values of 0 and 1. Values equal to 1 indicate maximum symmetry (i.e., minimal complexity).\nStatistically analyze geometrical and shape parameters between different genotypes or conditions using Microsoft Excel and/or PAST. Statistical significance of the difference is determined using an unpaired two-tailed Student's t-test for equal mean or the non-parametric Kolmogorov-Smirnov K-S-test for equal distributions between conditions. Data can be graphically displayed as desired (e.g., bar charts, box plots, etc.). See Figure 5.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}