{
  "id": 2233,
  "origin_website": "Cell",
  "title": "Efficient isolation of mouse deletion mutant embryonic stem cells by CRISPR",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTransfection of ES cells\nTiming: About 8 h\nTwo sgRNA constructs targeting Zfp445 are co-transfected into ES cells by Lipofectamine, together with the plasmid expressing the puromycin resistance gene. This results in simultaneous expression of two sgRNAs targeting two different regions of Zfp445 in ES cells. Deletion mutations of Zfp445 may occur in the co-transfected ES cells expressing these two sgRNAs.\nPrepare Lipofectamine mixture in the DMEM medium.\nAdd 150 μL of DMEM without serum to a labeled 1.5-mL Eppendorf tube for transfection.\nThen add 6 μL of Lipofectamine 2000 (or Lipofectamine 3000) reagent to the DMEM medium in the tube because either Lipofectamine could work well. Mix by tapping the tubes with the fingers a few times.\nNote: Leave the tube containing the transfection reagent DMEM mixture at 20°C–25°C while you start mixing the DNA mixture for transfection.\nPrepare DNA mixture in the DMEM medium.\nMix two CRISPR constructs at 1.6 μg each with 0.8 μg of a plasmid containing the puromycin resistance gene in a clean autoclaved 1.5-mL Eppendorf tube. Mix well by pipetting 15 times because we think it will be easier to mix first and co-transfection efficiencies may be better with the premixed DNA sample. (troubleshooting 2[href=https://www.wicell.org#sec6.3]).\nAdd 4 μg of the DNA mixture to another labeled tube containing 150 μL of DMEM medium without serum. Pipet 15 times to make the diluted DNA mixture.",
    "Critical: The DNA samples containing two sgRNA constructs targeting Zfp445 are mixed first before DNA is mixed with the transfection reagent to make the transfection mixture. This ensures that almost all transfected ES cells contain a portion of all DNA samples in the transfection mixture. We also use less DNA containing the puromycin resistance gene so that most likely the puromycin-resistant ES colonies have undergone CRISPR-Cas9 editing events. The plasmid PGL3-U6-sgRNA-PGK-puromycin or its derivatives may be used for expression of the puromycin resistance gene in the co-transfection experiments, without expressing another sgRNA. Other constructs expressing puromycin resistance gene product can be also used in the co-transfection experiments in place of PGL3-U6-sgRNA-PGK-puromycin.\nPrepare transfection mixture.\nAdd the diluted DNA mixture to the diluted Lipofectamine mixture in the DMEM medium.\nMix it by tapping the tube a few times with the fingers to make the transfection mixture. You may mix it again a couple minutes later.\nKeep the transfection mixture at 20°C–25°C for 5 min.\nTransfection of ES cells.\nRemove the feeder cell medium from the DR4 feeder cells and plate 1 mL of freshly digested ES cells of about 1 million ES cells on the DR4 feeder cells for transfection.\nAdd the transfection mixture dropwise to the freshly plated ES cells on the DR4 feeder cells. Distribute the transfection mixture evenly on the ES cells by moving the cell culture plate sideways a few times.\nTransfer the ES cell plate with the transfection mixture to the cell culture incubator at 37°C with 5% of CO2.",
    "Note: The ES cells are grown to become relatively confluent before being harvested by trypsin digestion (Figure 2[href=https://www.wicell.org#fig2]A). Then about one million ES cells are plated onto the DR4 feeder cells seeded on a well of 6-well plate or a small 3.5-cm dish plate right before addition of the transfection mixture.\nPost-transfection addition of ES cell growth medium.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1705-Fig2.jpg\nFigure 2. The images of ES cell colonies are shown after transfection of ES cells followed by puromycin selection\nThe images were taken under an inverted microscope with a scale bar of 500 μm.\n(A) D1911 ES cells were relatively confluent right before being harvested for ES cell transfection experiments.\n(B) D1911 ES cell colonies are shown one day after transfection.\n(C) D1911 ES cells were dying quickly after one day in the ES cell culture medium with puromycin.\n(D) Most of D1911 ES cells died after two days in the ES cell culture medium with puromycin.\n(E) D1911 ES cells were recovering quickly after one day in the ES cell growth medium without puromycin.\n(F) D1911 ES cells became relatively confluent again after two days in the ES cell growth medium without puromycin.\nAbout 6 h later after addition of the transfection mixture onto the ES cells, add more ES cell growth medium to increase the total volume to about 3–4 mL of ES cell growth medium per well. Then move the transfected ES cell plate back to the cell culture incubator at 37°C with 5% of CO2.\nEnrichment of transfected ES cells\nTiming: About 5 to 6 days",
    "Puromycin is added to the ES cell culture medium for 2 days to select for ES cells expressing the puromycin resistant gene. These puromycin-resistant ES cells will probably express two sgRNAs targeting two different regions of Zfp445 in the same time. As a result, the ES cell culture is enriched with the co-transfected ES cells after puromycin selection.\nTo enrich the transfected ES cells, we use puromycin drug selection to kill most of un-transfected ES cells.\nWe usually start drug selection next day about 24 h later after transfection (Figure 2[href=https://www.wicell.org#fig2]B). For puromycin selection, 3–4 mL of fresh ES cell growth medium with 1 μg/mL puromycin is added to the ES cells after removal of the old growth medium one day later after the transfection experiment.\nRemove the old medium from the ES cell culture one day after puromycin selection, which is also two days after transfection. Add 3 mL of fresh ES cell growth medium with 1 μg/mL puromycin to the ES cells again (Figure 2[href=https://www.wicell.org#fig2]C).\nNote: Since ES cells die quickly in the medium containing puromycin, usually only 2 days of puromycin selection is required to enrich the transfected ES cells so that most untransfected ES cells are dead and removed from the ES cell culture during daily change of the ES cell medium (Figure 2[href=https://www.wicell.org#fig2]D).\nRemove the old medium containing puromycin from the ES cell culture after two days of puromycin selection, and add fresh ES cell growth medium to the transfected ES cells.\nChange the medium for ES cell culture next day. Change the ES cell medium daily until the ES cell culture becomes confluent.",
    "Note: Usually ES cell colonies will grow back quickly and become easily visible under microscope one day after removal of puromycin (Figure 2[href=https://www.wicell.org#fig2]E). Change the medium for the ES cell culture daily until the ES cell colonies are large enough (Figure 2[href=https://www.wicell.org#fig2]F). Typically 2–3 mL of fresh ES cell growth medium is needed for each well when ES cells are relatively sparsely populated. 4–5 mL of fresh ES cell growth medium is added to the transfected ES cells if the ES cells become more confluent.\nPause point: This completes the puromycin selection and enrichment of transfected ES cells. We may go to step 10 directly for serial dilution and plating of ES cells in order to pick individual ES colonies for screening and identification of candidate mutant ES clones. Alternatively, we may test the mutation rate of the transfected ES cells by the optional assay described immediately below. Then we can estimate how many ES cell colonies need to be individually picked for identification of the mutant ES clones before we proceed with the serial dilution and plating of ES cells in step 10.\nOptional: Testing targeting efficiency before plating and picking single ES clones\nTiming: About 10 days\nWe may test the targeting efficiency of Zfp445 in the ES cell culture first after co- transfection of two sgRNA constructs followed by puromycin selection. Then only ES cell culture with good targeting efficiency will be plated for picking ES cell colonies individually later. This will ensure that mutant ES clones can be relatively easily identified after certain number of singly picked ES clones are screened for the mutations in the Zfp445 gene.",
    "Note: T7 endonuclease I (T7E1) assay is often used to assess the mutation frequency mediated by CRISPR-Cas9 (Li et al., 2018[href=https://www.wicell.org#bib9]). However, we found the mutation frequencies were quite high after the enrichment of the transfected ES cells through puromycin selection. It is not necessary to use T7E1 assay to test the mutation frequency first before plating and picking of individual ES clones. However, the deletion mutation efficiency may be relatively low when two sgRNA target sites are far apart in the genome (e.g., much longer than 1 kb apart). Then it may be better to test the mutation efficiencies of the transfected ES cells with T7E1 assay first so that the required number of single ES colonies may be picked in order to find the candidate ES clones carrying the deletion mutations.\nTo test mutation rate in the transfected ES cell culture by T7E1 assay, it is necessary to grow a well of ES cells from the puromycin-treated transfected ES cells. Then isolate genomic DNA samples for the T7E1 assay as described below.\nCoat the new wells of a 6-well plate or a small 3.5-cm dish plate with 2 mL of 0.1% autoclaved gelatin in ddH2O the day before use.\nOnce the ES cells are relatively confluent, you may harvest the ES cells by trypsin digestion.\nAdd 2 mL of fresh ES cell medium to the well of gelatin-coated 6-well plate or a small gelatin-coated 3.5-cm dish plate after removal of the gelatin solution. Then harvest ES cells from the confluent ES cell culture that have regrown after removal of puromycin and add about 0.5 mL of the harvested ES cells to a well of gelatin-coated 6-well plate or gelatin-coated 3.5-cm dish plate containing 2 mL of ES cell medium.",
    "Spin down the rest of transfected ES cells in a 15-mL conical tube by centrifuge for 5–10 min at 1,000 g. Aspirate off the top medium from the 15-mL conical tube. Resuspend the cell pellet in 2 mL of freezing medium for ES cells and split the ES cells in two 2-mL freezing vials at 1 mL each. Store the freezing vials containing the resuspended transfected ES cells in freezing medium at −80°C in a cryo-freezer or in a liquid nitrogen tank.\nAllow the plated ES cells on gelatin-coated plates to grow to relatively confluent without the need to change the medium at the interval. Then harvest the ES cells for genomic DNA preparation according to the standard protocol as described below in step 14.\nPerform the T7E1 assay for the genomic DNA sample according to the manufacturer’s suggested protocol.\nIf the mutation frequency is high enough so that roughly more than 5% of the target region is mutated based on the T7E1 assay, we will plate the feeder cells derived from the SNL MEF cells on 6-well plates first the day before one frozen vial of transfected ES cells is thawed. Thaw the frozen ES cell sample according to the standard procedure and plate the thawed ES cells onto the SNL feeder cells in 2–3 mL of fresh ES cell growth medium.\nChange the medium 2 days later and then change the medium for the growing ES cells daily with the increasing volume of ES cell growth medium until about 5 mL of fresh ES cell growth medium is used for relatively confluent ES cells.\nPlating and picking of single ES cell colonies\nTiming: About 5 days",
    "The ES cells harvested from the ES cell culture after puromycin selection are serially diluted, and then plated on the feeder cells so that well separated single ES cell colonies appear a few days later. These single ES cell colonies are picked individually and transferred to grow on the wells of 24-well plates seeded with feeder cells.\nPicking single ES colonies grown from serially diluted ES cells.\nCritical: The ES cells need to be serially diluted and plated onto the SNL feeder cells at relatively low densities so that well separated ES cell colonies can be picked individually after they grow up. SNL feeder cells are recommended for the ES cell culture after transfection since they express LIF and it is not necessary to add LIF in the ES cell growth medium. This is advantageous because LIF is quite expensive.\nPlating serially diluted ES cells.\nNote: Seed SNL feeder cells on a 10-cm dish plate the day before the ES cells are harvested and serially diluted for plating single ES cell colonies.\nHarvest the ES cells from the well containing relatively confluent ES cells by trypsin digestion based on the standard cell culture procedure. Count the total number of cells for the harvested ES cell sample.\nPerform the serial dilutions of the harvested ES cells at 1:10 dilution for each dilution until the diluted ES cell density is low enough (about 100–200 ES cells/mL) to allow plating of ES cells with a 5-mL transfer pipet.\nThen plate the resuspended ES cells onto the SNL feeder cells on the 10-cm dish plate at the density of about 500 ES cells per 10-cm dish plate (Figure 3[href=https://www.wicell.org#fig3]A). The rest of the harvested ES cells may be frozen again in 1 or 2 freezing vials as backup.",
    "Growing ES cell culture for picking individual ES colonies later.\nStart changing the ES cell medium 2 days later with increasing fresh ES cell medium, from 10 mL for the first change of medium up to 20 mL a few days later.\nSingle well-separated ES colonies will appear on the 10-cm dish plate seeded with the SNL feeder cells in a couple of days (Figure 3[href=https://www.wicell.org#fig3]B). Wait until most ES cell colonies are large enough for picking single ES colonies a couple more days later (Figure 3[href=https://www.wicell.org#fig3]C).\nPicking well separated single ES cell colonies.\nNote: Seed SNL feeder cells on the 24-well tissue culture plates the day before the ES cell colonies are large enough for picking individually.\nRemove the medium from the 10-cm dish plate with ES cell colonies by aspiration.\nCircle the large ES colonies on the bottom of the plate with a marker pen quickly.\nCarefully wash the plate with 10 mL of autoclaved PBS solution. Aspirate off the PBS solution. Add 10 mL of fresh autoclaved PBS solution to the plate marked with ES cell colonies.\nPlace the plate under the microscope inside the hood. Then pick a relatively big well-separated undifferentiated ES cell colony with good morphology by circling around it with a sterile tip (200-ul filter tip) to break the feeder cell layer, suck off the whole ES cell colony and transfer it to a well of 96-well plate.\nDissociation and plating of individually picked ES cell colonies.\nNote: It is recommended to pick 24 well-separated ES cell colonies for each transfection. We usually start trypsin digestion after we have picked 12 ES cell colonies.",
    "Mix trypsin solution with autoclaved PBS solution at the ratio of 1:1 by volume. Add 1 drop (about 50–100 μL) of mixed trypsin/PBS solution to the wells of the 96-well plate containing the picked ES cell colonies. Leave the 96-well plate at 20°C–25°C for about 5 min. Then stop trypsin digestion by addition of two drops of ES cell growth medium to each well.\nDissociate the individually picked ES cell colonies by pipetting 15 times. To save time, we usually use multi-channel pipetman to dissociate ES cell colonies.\nAfter dissociation, transfer the resuspended ES cells for each ES cell colony to a well of 24-well plates containing 1 mL of fresh ES cell growth medium per well, which have been seeded with SNL feeder cells the day before.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1705-Fig3.jpg\nFigure 3. Single ES cell colonies were plated and picked for isolation of candidate deletion mutation ES clones\nThe images of the ES cell colonies were taken under an inverted microscope with a scale bar of 500 μm.\n(A) Transfected D1911 ES cells after enrichment by puromycin selection were serially diluted and plated onto the 10-cm dish plate seeded with the SNL feeder cells.\n(B) Well separated ES cell colonies appeared a few days after being plated onto the 10-cm dish plate seeded with the SNL feeder cells.\n(C) Single ES cell colonies were large enough for being picked individually.\n(D) Single ES cell colonies were plated onto the wells of 24-well plate seeded with the SNL feeder cells after being picked individually and dissociated by trypsin digestion.\n(E) ES cell colonies were rapidly growing on the SNL feeder cells in the wells of 24-well plate.",
    "(F) ES cells were ready for being harvested and frozen for temporary storage before PCR-based screening with the genomic DNA samples derived from a portion of the ES cells for each singly picked ES cell colony.\nGrowth and freezing of singly picked ES clones\nTiming: About 5 days\nThese singly picked ES cell colonies are frozen after the cell culture of these ES clones has become confluent on the wells of 24-well plates with feeder cells. The frozen ES cell samples are stored at −80°C until the candidate ES clones are identified by PCR screening. These stored ES cell samples can then be amplified later when the confirmed ES clones are needed for other experiments.\nThe individually picked ES clones will be grown to become relatively confluent before they are harvested and frozen for temporary storage. In the same time, genomic DNA samples will be isolated from these ES clones for PCR screening to identify the candidate ES clones in the following steps.\nNote: Normally it is not necessary to change the medium next day.\nChange ES cell medium two days later with 1 mL of fresh ES cell growth medium per well (Figure 3[href=https://www.wicell.org#fig3]D).\nChange the medium daily until the ES cells become relatively confluent in the wells of the 24-well plate (Figures 3[href=https://www.wicell.org#fig3]E and 3F).\nFreezing individually picked ES clones after they grow up.\nNote: The ES clones will be temporarily frozen afterward while the candidate ES clones are being screened by PCR and confirmed by sequencing.\nHarvest ES cell culture by trypsin digestion for freezing.\nTo harvest ES clones, remove the ES cell medium from the wells and wash once with 1 mL of PBS per well for the 24-well plate.",
    "Add 4 drops (approximately 200–400 μL) of 1:1 mixed trypsin/PBS solution to each well of 24-well plates. Leave the plate at 20°C–25°C for about 5 min until the ES cell colonies are dissociated from the plates. Then pipet 15 times with a 1-mL pipet to resuspend the ES cells for each ES cell colonies that are confluent.\nFreeze and store the ES cell samples from the ES cell culture of individually picked ES cell colonies.\nAdd 1 mL of ES cell freezing medium to each well of the 24-well plate. Use 1-mL pipetman to resuspend ES cells in each well by pipetting for 15 times.\nTransfer most of the resuspended ES cells in ES cell freezing medium to a labeled 2-mL freezing vial. Store these freezing vials containing the ES cells in ES cell freezing medium in a freezer of −80°C or in a liquid nitrogen tank for temporary storage until the candidate ES clones have been identified.\nIdentification of candidate ES clones\nTiming: About 5 days\nGenomic DNA samples are isolated from the cell culture of the picked ES clones. Then these genomic DNA samples are screened for candidate mutant ES clones carrying deletion mutations of Zfp445 by PCR with two primers flanking two sgRNA target sites.\nNote: Genomic DNA samples isolated from the ES clones will be subjected to PCR-based screening with two primers spanning two CRISPR target sites in order to identify the candidate ES clones carrying the deletion mutations of the target gene. The mutant PCR product is sequenced to find out the exact mutation caused by CRISPR-Cas9.\nGrow cell culture for genomic DNA preparation of the originally singly picked ES clones.",
    "For genomic DNA sample isolation of these ES clones, 1 mL of ES cell growth medium is added to the remaining resuspended ES cells in each well of the 24-well plate of step 13.\nThe remaining ES cells in the well will grow to become relatively confluent in a few days without the need to change the medium during this interval.\nPrepare genomic DNA samples for originally individually picked ES clones.\nNote: We harvest ES cells for genomic DNA sample preparation by using the standard procedure for genomic DNA preparation from the adherent cells (Thomas et al., 1992[href=https://www.wicell.org#bib17]). The detailed experimental procedure is provided below for genomic DNA sample preparation that we have employed in our own lab.\nAspirate off the medium from the confluent ES cell culture.\nAdd 200 μL of the lysis buffer containing 100 μg/mL of Proteinase K to each well of the 24-well plate with the cultured ES cells and then the lysed cell sample is transferred to a clean Eppendorf tube.\nIncubate the Eppendorf tubes containing ES cell lysate samples in the water bath at 37°C for 8–12 h.\nAdd 100 μL of saturated 6 M NaCl solution to each Eppendorf tube. Close the lid of each tube tightly.\nTransfer the tubes into a storage paper box and shake the box vigorously for 200 times to mix the cell lysate. Leave these tubes on ice for 10 min.\nCentrifuge these tubes at 3,500 g for 10 min.\nTransfer 200 μL of the supernatant to a clean tube containing 400 μL of ethanol. Mix the solution by inverting the closed Eppendorf tubes a few times until DNA precipitate appears.\nMove DNA in the tube with a pipet tip to a clean tube.\nRinse DNA once with 1 mL of 70% ethanol.",
    "Dry the DNA in air for 15 min.\nAdd 100 μL of TE buffer (pH=8) to the tube containing DNA and leave the tube at 25°C for 12 h to dissolve the genomic DNA sample.\nThis genomic DNA solution can be used for PCR or other experiments. Store the genomic DNA samples at 4°C.\nIdentification of the candidate mutant ES clones carrying deletion mutations.\nScreen for candidate ES clones with deletion mutations by PCR.\nCritical: To identify the candidate ES clones, generally we use PCR-based approaches to amplify the target regions from the purified genomic DNA samples. Routinely we use two constructs expressing two different sgRNAs targeting two different regions of the target gene so that a relatively large piece of genomic region including part of the exons will be removed from the target gene. The ES clones containing the desired deletion in the gene of interest will be identified by PCR amplification of the genomic DNA samples derived from these ES clones followed by regular DNA gel electrophoresis. (troubleshooting 3[href=https://www.wicell.org#sec6.5]).\nPrepare the PCR reaction master mix with Advantage GC2 PCR Kit according to the following format:\ntable:files/protocols_protocol_1705_10.csv\nUse the PCR cycling condition below for amplification of the target gene region from the genomic DNA samples of these ES clones.\ntable:files/protocols_protocol_1705_11.csv\nDetermine the deletion mutations by sequencing. Then the amplified PCR product containing the deletion will be sequenced to find out if it is indeed derived from the deleted allele of the candidate ES clone.\nThe PCR product of the right deletion may be separated on the agarose gel and purified with AxyPrep DNA Gel Extraction Kit by using the manufacturer’s suggested protocol.",
    "To find out the precise deleted sequence of the target gene in the candidate ES clones, the purified DNA fragment derived from the deletion mutation is cloned into the pUCm-T vector by using the TA cloning with the pUC-m vector, or into a common bacterial vector such as pBluescript.\nThen the plasmid containing the PCR product is sequenced with the M13 Reverse Primer to find out the exact deleted region of the target gene.\nNote: The PCR product derived from the target gene region containing the deletion mutation may be directly cloned into the pUCm-T vector first with the TA cloning strategy. The PCR product can be also cloned into the EcoRV site of pBluescript through blunt-end ligation. Alternatively, a unique restriction enzyme site (e.g., HindIII) may be introduced at both ends of the PCR product by another round of PCR with two primers containing the restriction enzyme recognition sequence. Then the new PCR product is cut with the restriction enzyme and ligated into the same restriction site present in pBluescript.\nAlternative reagents: Other similar TA cloning systems may be used in place of the pUCm-T vector system for TA cloning for cloning of the PCR product. These include the pGEM-T vector from Promega, USA (Cat. # A3610) and the TOPO TA cloning system from Invitrogen of Thermo Fisher Scientific, USA (Cat. # 451641).\nExpansion and storage of identified ES clones\nTiming: About 4 to 5 days",
    "The identified candidate mutant ES clones are thawed from the stored ES cell samples at −80°C and plated on the feeder cells seeded on 6-well plates. Then the mutant ES clones are expanded in cell culture on 6-well plates and may be further expanded on 10-cm dish plates if more frozen ES cell samples are needed for long-term storage of the confirmed mutant ES clones.\nNote: Plate SNL feeder cells on the 6-well tissue culture plates, with 2-mL of feeder cell medium per well, the day before the candidate ES cell clones are thawed and cultured for expansion of the ES cells on the SNL feeder cells.\nAfter they have been confirmed by PCR and sequencing, the candidate ES clones may be thawed from the freezing vials containing the frozen ES cells that have been stored temporarily at −80°C or in a liquid nitrogen tank in step 13.\nRemove the freezing medium from the thawed ES cells by washing with 10 mL of ES cell growth medium in a 15-mL conical tube followed by centrifuge at 1,000 g for 5 min.\nAspirate off the feeder cell medium from the 6-well plate, and then add the thawed ES cells for each candidate ES clone onto the feeder cells in 2 mL of ES cell growth medium.\nNote: Normally we do not need to change the medium next day.\nChange ES cell medium daily with the increasing fresh ES cell growth medium from 2 mL per well initially to 5 mL per well a few days later as the ES cells grow. When they become relatively confluent, the ES cells in the wells are ready for being harvested and put away for long-term storage.",
    "If necessary, the candidate ES clones can be further expanded on the SNL feeder cells on the 10-cm dish plate so that more freezing vials containing the frozen ES cells may be obtained for the desired ES clones for long-term storage in liquid nitrogen.\nOptional: Determining homozygous or heterozygous mutant ES clones\nTiming: About 2 days\nThe identified candidate mutant ES clones are either homozygous or heterozygous for Zfp445. To find out if they carry one deleted allele or two deleted alleles of Zfp445, the genomic DNA samples of these mutant ES clones may be subjected to PCR with a third primer located in the deleted region besides two primers flanking two sgRNA sites. Alternatively, western blot analysis or immunostaining may be carried out to test if there is no wild-type protein in the mutant ES clones.\nTest if the mutant ES clones are homozygous or heterozygous.\nPCR screening to identify wild-type or deletion mutant allele of Zfp445 in the ES clones. If homozygous mutant ES clones are needed for the experiments, the candidate ES clones carrying deletion mutation of the target gene may be subjected to another PCR-based screening with three PCR primers so that we can determine if they are homozygous and heterozygous mutant ES clones, with two primers spanning two CRISPR target sites and one primer located in-between. Then the PCR product is examined after agarose gel electrophoresis to find out if there is PCR product derived from the wild-type allele of the target gene.",
    "Note: Two PCR primers (Primer 1 and Primer 2 of the Table below for PCR reaction master mix) were used for amplification of small PCR product derived from the deleted allele for initial PCR-based screening of mutant ES clones carrying deletion mutations. Then we use three PCR primers (Primer 1, Primer 2 and Primer 3 of the Table below for PCR reaction master mix) to amplify both the wild-type and mutant alleles for the target gene to identify the homozygous mutant ES clones carrying deletion mutations on both alleles. If Zfp445 is used as an example, Primer 1 and Primer 2 are Zfp445-F1 and Zfp445-R1 listed in the key resources table[href=https://www.wicell.org#key-resources-table] (Figure 1[href=https://www.wicell.org#fig1]). Primer 3 is another new primer Zfp445-F2 located in the deleted region of Zfp445 (Figure 1[href=https://www.wicell.org#fig1]A).\nPrepare PCR reaction master mix with Advantage GC2 PCR Kit according to the following format:\ntable:files/protocols_protocol_1705_12.csv\nPerform PCR to identify wild-type or deletion mutant allele as illustrated below.\ntable:files/protocols_protocol_1705_13.csv\nTest if wild-type protein product is absent in the mutant ES clones.\nCritical: Good antibodies are available for either western blot analysis or immunostaining of wild-type protein in the ES clones.\nIn case there is good antibody available, the protein lysate samples will be prepared from these identified mutant ES clones and subjected to western blot analysis to test if there is wild-type protein in the mutant ES clones. Then we will be able to tell if they are indeed homozygous or heterozygous mutant ES clones.\nImmunostaining may be also performed to determine if the mutant ES clones lack any wild-type protein.",
    "Note: Some antibodies may be good for western blot analysis, whereas others may be suitable for immunostaining. Some may be good for both analyses. Antibodies may be generated to confirm the mutant ES clones. These antibodies may be useful for other experiments later such as ChIP analysis of the target gene product in the wild-type ES cells compared with the mutant ES clones. It can be also employed in characterization of the mutant mice derived from the mutant ES clones."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Genetics",
    "Stem Cells",
    "Crispr"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}