{
  "id": 5971,
  "origin_website": "Bio",
  "title": "Conditional Knockdown of Proteins Using Auxin-inducible  Degron (AID) Fusions in <em>Toxoplasma gondii</em>",
  "procedures": [
    "Generating gene-specific Cas9/sgRNA plasmids for C-terminal taggingGenomic sequence retrievalFrom www.toxodb.org[href=http://toxodb.org/toxo/], navigate to the gene of interest (GOI)’s gene page (Figure 2A). In general GT1 sequences are used when working with the RH TIR1-3FLAG line. Click the ‘Download Gene’ link above the Gene ID (Figure 2A).From the ‘Download Gene’ page on ToxoDB.org, download the 3’ tagging region by selecting the following options: Choose a Report: FASTA; Type of sequence: Genomic; Region: Translation stop -80, Translation stop +200; Download type: Show in browser. Select ‘Get Sequences’ link (Figure 2B).From the sequence retrieval page, select the genomic sequence without the FASTA identifiers and copy to clipboard (Figure 2C).Protospacer selectionFrom the Eukaryotic Pathogen CRISPR guide RNA/DNA Design Tool webpage (EuPaGDT, http://grna.ctegd.uga.edu/[href=http://grna.ctegd.uga.edu/]), begin by entering a ‘Job Name’. Use the default settings recommended for SpCas9: ’20 nt gRNA NGG PAM’. Under the genome selection tab, select the T. gondii lineage and database (e.g., T. gondii GT1 ToxoDB-32). Paste the copied genomic sequence from ToxoDB.org and select ‘Get guide RNA’ (Figure 2D).From the gRNA output page on http://grna.ctegd.uga.edu/[href=http://grna.ctegd.uga.edu/], select a 20 nt gRNA protospacer sequence with an NGG PAM downstream of the translation stop codon (e.g., STOP-N…N<100GATCGACTTAGTAACGCATCCGG) (Figure 2E). Optional: Add a ‘G’ to the 5’ end of the protospacer sequence if it does not begin with one to enhance sgRNA transcription (Doench et al., 2014).Mutagenesis of pSAG1::Cas9-U6::sgUPRT (Addgene #54467) (Shen et al., 2014)The plasmid pSAG1::Cas9-U6::sgUPRT transiently expresses SpCas9-HA-GFP nuclease and a single guide RNA (sgRNA) that binds Cas9 and directs it to perform a double stranded break in the TgUPRT gene. The gene target specificity of the Cas9/sgRNA ribozyme is based on a 20 nt protospacer sequence at the 5’-most end of the sgRNA.",
    "To switch the Cas9 target from TgUPRT to a different gene, the 20 nt protospacer sequence will need to be changed to the one designed in Step A2 Protospacer Selection. Use Q5 Site-Directed Mutagenesis (New England Biolabs) to mutate pSAG1::Cas9-U6::sgUPRT, changing the 20 nt TgUPRT protospacer to the 20 nt protospacer selected for the gene of interest (Figure 2E). A standard 25 µl reaction consists of:1 µl (1 ng) pSAG1::Cas9-U6::sgUPRT1.25 µl (10 µM) reverse primer: (5’-AACTTGACATCCCCATTTAC)1.25 µl (10 µM) forward primer:(5’-(G)NNNNNNNNNNNNNNNNNNNNGTTTTAGAGCTAGAAATAGC)9 µl deionized H2O12.5 µl 2x Q5 Hot-Start PCR mixQ5 Mutagenesis thermal cyclingStep 1. Denature at 98 °C for 30 secStep 2. Denature at 98 °C 10 secStep 3. Anneal at 55 °C 30 secStep 4. Extend at 72 °C for 5 minStep 5. Repeat Steps 2-4 24 timesStep 6. Extend at 72 °C for 2 minStep 7. Hold at 4 °C until further use.Resolve 1 µl of PCR reaction on a 0.8% agarose gel (TAE or TBE) with a 1 kb DNA ladder to check for amplification. The expected amplicon size is 9.68 kb.Kinase, Ligase, Digest (KLD) reaction (included in the Q5 Site-Directed Mutagenesis Kit)1 µl PCR product3 µl deionized H2O5 µl 2x KLD buffer1 µl 10x KLD enzyme mixMix and incubate at room temperature for 5 min.Transform NEB5α chemically-competent E. coli with 1 µl of the KLD reaction. Incubate on ice for 30 min. Heat chemically-transformed cells for 30 sec at 42 °C. Add 950 µl SOC medium (New England Biolabs) to transformed cells and incubate at 37 °C with mixing for 1 h. Spread 100 µl of transformed E. coli onto LB agar plates with 100 µg/ml ampicillin. Incubate plates at 37 °C overnight.",
    "The next day, pick 2-3 colonies from each LB agar plate to grow up in 5 ml LB broth + 100 µg/ml ampicillin overnight cultures for plasmid extraction.Pellet overnight bacterial cultures at 3,000 x g with a benchtop centrifuge for 10 min.Extract plasmid DNA from bacterial pellets using a plasmid extraction kit (Macherey-Nagel). Pre-warm sterile-filtered Buffer EB to 70 °C. Elute DNA into a sterile 1.7 ml microfuge tube with 50 µl pre-warmed sterile-filtered Buffer EB.Measure DNA concentration and purity by spectrophotometry (absorbance at 260 nm/280 nm, NanoDrop (Thermo Fisher)). The expected yield is approximately 500-1,000 ng/µl.Confirm mutated protospacer sequence of pSAG1::Cas9-U6::sg”GOI” by Sanger sequencing using the M13 reverse universal primer (5’-ACAGGAAACAGCTATGAC) (Genewiz).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180208/20180208183200_1913.jpgFigure 2. Generation of constructs for C-terminal mAID tagging. A-E. Generating gene-specific Cas9/sgRNA plasmids. The gene page of TgPKG (TGGT1_311360; example gene for C-terminal tagging) from ToxoDB.org. The red arrow points to the download gene link for acquiring the TgPKG genomic sequence needed. B. The ‘Download Gene’ page for TgPKG from ToxoDB.org. The red asterisks highlight fields that need to be entered as shown. The red arrow points to the get sequences link. C. The FASTA genomic sequence of TgPKG (-80 to +200 from the translation stop codon) from ToxoDB.org needed for gRNA and donor homology design for C-terminal tagging. D. Guide RNA design tool (cropped to fit) from EuPaGDT (http://grna.ctegd.uga.edu/[href=http://grna.ctegd.uga.edu/]). The red asterisks indicate the basic fields that need to be completed. The red arrow points to the ‘Get guide RNA’ link. E. Output of gRNA protospacers for TgPKG genomic sequence (-80 to +200 from the translation stop codon) on each strand from EuPaGDT (upper schematic). Selected gRNA protospacer and protospacer adjacent motif (PAM) sequence with quality scores from EuPaGDT (table). Swapping the TgUPRT protospacer with the designed TgPKG protospacer in pSAG1::Cas9-U6::sgUPRT by site-directed mutagenesis (lower schematic).",
    "F. Generation of a TgPKG-specific C-terminal mAID-3HA, HXGPRT tagging cassette. The FASTA genomic sequence of TgPKG (-80 to +200 from the translation stop codon) from ToxoDB.org with the indicated highlighted features. PCR amplification of mAID-3HA, HXGPRT tagging cassette from pYFP-mAID-3HA, Floxed HXGPRT with 5’ and 3’ regions of donor homology (40 bp) to TgPKG (flanking the Cas9 break-site) added to the forward and reverse primers, respectively (asterisks).Generation of a gene-specific AID tagging cassetteMicrohomology flank selection and primer designThe 5’ microhomology flank is the last 40 nt of the gene of interest that immediately precedes the translation stop codon. The 3’ microhomology flank will be the first 40 nt that immediately follows the selected protospacer/PAM site. These flanks will be appended to the (m)AID tagging cassette by PCR using ~60 nucleotide DNA oligo primers (Figure 2F).Order tagging primers. The tagging forward primer will be the 40 nt 5’ homology flank + GCTAGCAAGGGCTCGGGC. The tagging reverse primer will be the 40 nt 3’ homology flank (reverse complement) + ATAGGGCGAATTGGAGCTCC. We purchase 25 nmole DNA oligo primers with ‘standard desalting’ from Integrated DNA Technologies (www.idtdna.com[href=http://sg.idtdna.com/pages]).PCR amplification and clean-up of an AID tagging ampliconQ5 PCR set up. Set up the Q5 PCR reaction using pYFP-mAID-3HA, Floxed HXGPRT (Addgene #87259) (Brown et al., 2017) or pYFP-AID-3HA, Floxed HXGPRT (Addgene #87260) (Long et al., 2017b) plasmids as the template (Figure 2F). A standard 500 µl reaction consists of: 100 µl 5x Q5 Buffer10 µl dNTPs5 µl (50 µM) tagging forward primer (Figure 2F)5 µl (50 µM) tagging reverse primer (Figure 2F)5 µl (5 ng) plasmid template5 μl Q5 DNA polymerase370 µl deionized H2OSplit the PCR mix into 5 PCR tubes, 100 µl eachQ5 PCR thermal cycling.Step 1. Denature at 98 °C for 30 secStep 2. Denature at 98 °C for 10 secStep 3.",
    "Anneal at 60 °C for 30 secStep 4. Extend at 72 °C for 2.5 minStep 5. Repeat Steps 2-4 29 timesStep 6. Extend at 72 °C for 2.5 minStep 7. Hold at 4 °C until further useChecking PCR quality. Resolve 1 µl of PCR reactions on 0.8% agarose gel (TAE or TBE) with a 1 kb DNA ladder to check for amplification. The tagging amplicon will consist of a 5’ homology flank-linker-(m)AID-3HA, Floxed HXGPRT-3’ homology flank (expected amplicon sizes: 2.9 kb for mAID, 3.4 kb for AID).PCR cleanup with a PCR Cleanup Kit (Macherey-Nagel). Pool the 5 PCR reactions and add 1,000 µl Buffer NTI. Load 750 µl mix into DNA column. Centrifuge at 11,000 x g with a microfuge for 1 min. Discard flow through. Load remaining 750 µl mix into the column. Centrifuge at 11,000 x g for 1 min. Discard flow through. Wash column with 700 µl Buffer A3. Centrifuge at 11,000 x g for 1 min. Discard flow through. Repeat wash step and discard flow through. Centrifuge additional 3 min at 11,000 x g. Pre-warm sterile-filtered Buffer EB to 70 °C. Elute DNA into a sterile 1.7 ml microfuge tube with 30 µl pre-warmed sterile-filtered Buffer EB.Measure DNA concentration and purity by spectrophotometry (Absorbance at 260 nm/280 nm, NanoDrop (Thermo Fisher). Aim for having at least 10 µg tagging cassette for parasite transfection. Repeat PCR and cleanup steps if more DNA is needed.Cell cultureHuman foreskin fibroblasts (HFF) cultureStarter cultures. Grow starter HFF cells in 35 ml D10 medium (see Recipes) in sterile T-175 flasks in a 37 °C 5% CO2 incubator.HFF passage. Once confluent, remove D10 medium and wash with 35 ml sterile 1x PBS and discard wash.",
    "Add 5 ml trypsin, replace cap, and incubate cells at 37 °C for 1-5 min until cells detach from one another (as detected using 10x magnification). Firmly tap the side of the flask a few times forcefully to detach cells from the plastic. Add 175 ml fresh D10 medium to trypsinized cells and mix to generate a 1:5 cell suspension. Passage 35 ml into new T-175. Passage 5 ml into T-25s to make HFF feeder flasks to support Toxoplasma gondii culture. Passage 200 µl per well of 96-well plates and 1 ml per well of 24-well plates for parasite cloning following transfection.Parasite cultureParasite information. The T. gondii line RH TIR1-3FLAG (genotype: RHΔhxgprtΔku80; TUB1:TIR1-3FLAG, SAG1:CAT) is needed as it provides three key elements for the AID system: Δku80 restricts non-homologous end-joining, reducing random integration of the AID tagging cassette; Δhxgprt provides the proper genetic background for positive selection of the AID tagging cassette based on HXGPRT-mediated resistance to Mycophenolic acid; TIR1-3FLAG is the plant auxin receptor required for in auxin induced SCFTIR1-targeting of AID-tagged proteins for proteasomal degradation.Parasite passage. Inoculate confluent HFF T-25 feeder flasks with RH TIR1-3FLAG parasites using 350 µl of freshly egressed parasites every two days or immediately following natural egress as needed. Culture parasites in 37 °C 5% CO2 in D10 medium.(m)AID tagging using CRISPR genome editing (e.g., TgPKG-mAID-3HA; Figure 3)Parasite transfectionCulture parasites for transfection. Infect confluent host cells grown in T-25 flasks with sufficient RH TIR1-3FLAG parasites (95 µl of freshly egressed parasites from T-25) to achieve around 75% host cell lysis 2 days post-infection. Scrape the monolayers and pass the cell suspension through a 22 G blunt-end needle 3-5 times to disrupt the host cells and release all parasites. Avoid needle sticks and carefully dispose of used needles into a biohazard sharps container. Pre-wet 3.",
    "0 μm polycarbonate membranes by passing 5 ml HHE through the filter with a 10 ml syringe into a waste container. Pass the syringe-lysed parasites through the filter with a 10 ml syringe into a 50 ml polystyrene conical vial. Pass an additional 5 ml HHE through the filter into the 50 ml conical to collect additional parasites from the filter. Centrifuge the filtered culture at 400 x g with a benchtop centrifuge for 10 min at 18 °C, resuspend the pellets in 10 ml HHE, count the cell density with a hemacytometer, and centrifuge again under the same conditions. Subsequently, resuspend the parasite cell pellet in Cytomix buffer (see Recipes) to achieve a parasite density of 4 x 107 ml-1.Prepare the transfection mix in an electroporation cuvette 250 µl parasites in Cytomix buffer10 µg GOI-specific CRISPR/Cas9 plasmid (Figures 2A-2E)10 µg GOI-specific AID-tagging PCR amplicon (Figure 2F)3 µl ATP (0.2 M, 100x)3 µl glutathione (0.5 M, 100x)Adjust to 300 µl with Cytomix buffer.Electroporation. Electroporate parasites according to electroporator manufacturer’s instructions. We use the BTX ECM-830 electroporator with 4 mm gap cuvettes, with the following parameters:1,700 V176 μsec of pulse length2 pulses100 msec interval between pulsesImmediately after electroporation, transfer the parasites into fresh T-25 flasks with confluent host cells and grow them at 37 °C, 5% CO2.Drug selection and parasite cloningDrug selection. At 24 h after electroporation and recovery, begin drug selection for the (m)AID-3HA, Floxed HXGPRT construct using mycophenolic acid (25 µg/ml) supplemented with xanthine (50 µg/ml). Repeat passages until the drug-resistant pool becomes stable (usually 2-3 passages until the culture stabilizes (i.e., lyses the monolayer every two days with a 350 µl inoculum of freshly egressed parasites).Parasite cloning by limiting dilution. Following natural egress of the drug-resistant population, purify and count the parasites as described above.",
    "Dilute the purified parasites with D10 medium (without drug) to achieve 3 parasites/150 μl. Subsequently, add 150 μl/well of this diluted culture into 96-well plates with confluent host cells and let the parasites grow at 37 °C, 5% CO2 for 7 days without movement to allow plaques (macroscopic focal destruction of the host cell monolayer by lytic parasite replication) to develop.Screening clones for genetic recombinationIdentifying clones. After plaque development, visually check each well of the 96-well plates under an inverted-phase contrast microscope (such as a Nikon TS100) and look for wells that contain only one plaque (Refer to Ufermann et al., 2017 for high resolution examples of plaque morphology). Transfer the parasites of positive wells into 24-well plates containing confluent host cell monolayers and grow them until they naturally egress.Making lysates for diagnostic PCR. Inoculate a small aliquot (e.g., 10 μl) from each well into a new 24-well plate containing a confluent monolayer of host cells to continue culturing the parasites. The rest of the lysed out culture will be used for diagnostic PCR. Add 1 ml egressed parasite clones into 1.7 ml microfuge tubes. For a negative control, add 1 ml of egressed wild-type parasites (the parental line) to a separate 1.7 ml microfuge tube. Pellet the parasite suspensions at 400 x g with a microfuge for 10 min at 18 °C and remove supernatant from parasite pellet. To each pellet, add 100 μl Proteinase K (PK) (0.2 mg/ml) in 1x PBS and mix. Heat at 37 °C for 10 min, 50 °C 10 min, and 98 °C for 10 min. Freeze samples or chill on ice and proceed with diagnostic PCR.Diagnostic PCR set up. Two simple PCRs should be performed to determine the tagging success.",
    "PCR1 should exclusively amplify the unmodified gene locus, while PCR2 should exclusively amplify the tagged gene locus (Figure 3A). Each 25 μl diagnostic PCR reaction consists of:2.5 μl 10x Taq buffer0.5 μl dNTPs0.25 μl (50 μM) forward primer (same for PCR1 and PCR2) 0.25 μl (50 μM) reverse primer (unique for PCR1 and PCR2)1 μl PK-treated parasite lysate0.25 μl Taq DNA polymerase (New England Biolabs)20.25 μl deionized H2OThe forward primer for PCR1 and PCR2 should prime ~350 bp upstream (5’ side) of the translation stop codon. The PCR1 reverse primer should prime in the 3’ UTR, ~300 bp downstream of the translation stop codon. The PCR2 reverse primer should prime in the mAID or AID sequence ~+50 from start of linker.Diagnostic PCR thermal cyclingStep 1. Denature at 98 °C for 30 secStep 2. Denature at 98 °C 10 secStep 3. Anneal at 60 °C 30 secStep 4. Extend at 68 °C for 1 minStep 5. Repeat Steps 2-4 29 timesStep 6. Extend at 68 °C for 1 minStep 7. Hold at 4 °C until further useResolving diagnostic PCR amplicons. Resolve 10 µl of PCR reactions on 1% agarose gel (TAE or TBE) with a 1 kb DNA ladder to check for positive amplification (Figure 3C). PCR1 should yield an amplicon of ~650 bp for the wild-type, unmodified locus. PCR2 should yield an amplicon of ~400 bp for successfully tagged clones. PCR positive clones can be further examined by other means such as immunofluorescence microscopy (Figure 3D) or Western blotting (Figure 3E) for the (m)AID-3HA epitope tag using anti-HA antibodies.Subcloning tagged clones. Once positive clones are identified and confirmed, they should be transferred from 24-well plates into T-25 flasks and cryopreserved for future use.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180208/20180208184815_5975.jpgFigure 3. Generation and regulation of (m)AID protein fusions. A. CRISPR-mediated C-terminal mAID tagging in RH TIR1-3FLAG line.",
    "The example shown here is the gene encoding protein kinase G (TgPKG, reproduced with permission from [Brown et al., 2017]). Note the locations of diagnostic PCRs 1 and 2. B. Schematic of TgPKG-mAID-3HA expression showing the two PKG-mAID isoforms that are generated from alternative translation initiation sites on the transcript. Addition of IAA promotes the simultaneous degradation of both PKG-mAID isoforms. C-D. Data reproduced with modification for space limits from (Brown et al., 2017). C. Diagnostic PCRs 1 and 2 from genomic DNA samples showing successful integration of the mAID tagging construct into TgPKG (see A for PCR positions). WT (wild type), TIR1-3FLAG parent; Tag, PKGI,II-mAID-3HA parasites. D. Immunofluorescence of PKG-mAID-3HA isoforms I and II stained with anti-HA mAb and detected with Alexa Fluor 488-conjugated secondary antibody. Scale bar = 5 µm. E. Western blot assay of lysed PKGI,II-mAID-3HA parasites probed with antibodies recognizing HA (green) and aldolase (red). Parasites were treated with 500 µM IAA or the vehicle (EtOH) for 4 h prior to lysis.Depletion of AID-tagged proteinsParasite culture. Infect HFF cultures with RH TIR1-3FLAG and RH POI-(m)AID-3HA parasites. The type (e.g., dish, well plate, flask) and number of HFF monolayers to infect will depend on the experiment but at least two cultures are needed per parasite line for auxin and vehicle treatment.Auxin treatment. Use auxin at 1:1,000 to deplete (m)AID-tagged proteins at a final concentration of 500 µM. Mock treatment consists of an equivalent volume of 100% EtOH at a final concentration of 0.0789% (w/v). Incubate at 37 °C. Incubation times needed to achieve complete protein knockdown will vary based on protein localization, stability, and abundance. As little as 15 min has been used to achieve complete knockdown of soluble cytosolic (m)AID-fusions such as YFP (Brown et al., 2017; Long et al., 2017b).",
    "Following knockdown, parasites can be examined for phenotypes directly, harvested for follow-up assays, or lysed for analysis of (m)AID-tagged protein levels.Detection of AID-tagged protein levels. The 3HA portion of the (m)AID construct can be used for protein detection by immunofluorescence microscopy (Figure 3D) or Western blotting (Figure 3E) using anti-HA antibodies (Figure 2)."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}