{
  "id": 11204,
  "origin_website": "Jove",
  "title": "Induction of Adhesion-dependent Signals Using Low-intensity Ultrasound",
  "procedures": [
    "1. Coating Surfaces with Matrix Ligand\nUltrasound will be applied to cells in 3.5-cm wells, either as individual dishes or as a 6-well plate. For biochemical assays, coat ligand directly onto the plastic. For immunofluorescence, boil glass coverslips three times in MilliQ water and place 4 coverslips into the bottom of each well.\nGlass surfaces must be derivatized to ensure efficient ligand coating. Dissolve sulpho-m-maleimidobenzoyl-N-hydrosuccinimide ester in PBS at 1 mM. Add 2 ml to each well and incubate for 30 minutes at room temperature.\nWash the derivatized surfaces 3 times with PBS.\nCoat either derivatized glass or untreated plastic with integrin ligand. Apply 2 ml of 10 ug/ml integrin ligand9, dissolved in PBS containing Ca2+ and Mg2+ to each well and incubate overnight at 4 °C.\nPrepare monoparticulate BSA by heating 1% BSA, dissolved in PBS, to 85 °C for 13 minutes. Allow to cool and then pass through a 0.45-μm filter.\nWash ligand-coated surfaces 3 times with PBS and block with the monoparticulate BSA for 30 minutes.\n2. Preparation of Cells\nTo control the matrix environment throughout the experiment, protein synthesis should be blocked by addition of 25 μg/ml cycloheximide to 80% confluent fibroblasts for 2 hours.\nRinse cycloheximide-treated cells with PBS and detach from the culture flask using 0.5 mg/ml trypsin/EDTA.\nHarvest detached cells by centrifugation at 500x g for 5 minutes.\nResuspend cells in DMEM/25 mM HEPES, 25 μg/ml cycloheximide.\nCount cell density of the suspension using a haemocytometer and dilute to 105 ml-1.\nIncubate cells at 37 °C for 20 minutes to recover surface integrin.\nRinse the ligand-coated, BSA-blocked wells 3 times with PBS.\nSeed 2 ml of the cell suspension into each well.\nAllow cells to spread for 2 hours at 37 °C, 5% CO2.\n3. Ultrasound Stimulation",
    "Warm the ultrasound emitter array and coupling gel to 37 °C.\nApply a pea-sized blob of coupling gel to each emitter.\nTest that each emitter is functional using a ultrasound indicator diode detector.\nPlace the wells on the emitter array. Return array to 37 °C, 5% CO2 and allow temperature to equilibrate for 10 minutes.\nSwitch on the ultrasound signal.\nThe ultrasound signal will deactivate after 20 minutes, mimicking the therapeutic regime. If shorter stimulation times are required, plates should be removed from the array at the appropriate time-points. In all cases use unstimulated plates as the negative control.\n4. Focal Adhesion Analysis by Immunofluorescence\nFor analysis of focal adhesion formation, apply the 20-minute ultrasound signal and then allow structures to develop for a further 40 minutes by maintaining cells at 37 °C, 5% CO2.\nAspirate media and fix cells by applying 2 ml 4% paraformaldehyde in PBS. Incubate for 14 minutes at room temperature.\nAspirate paraformaldehyde and rinse three times with PBS, applying the PBS gently down the edge of the well to avoid generation of shear forces.\nTransfer each coverslip from the 3.5 cm well to a 24-well plate for subsequent immunofluorescent staining.\nQuench residual paraformaldehyde by applying 0.5 ml 0.1 M glycine in PBS to each of the 24 wells. Incubate for 20 minutes at room temperature.\nAspirate glycine and rinse three times with PBS.\nPermeabilise cells by applying 0.5 ml 0.5% Triton X-100 (w/v) in PBS. Incubate for 4 minutes at room temperature.\nAspirate Triton X-100 and rinse three times with PBS.\nBlock by applying 0.5 ml 3% (w/v) BSA in PBS. Incubate overnight at 4 °C.\nStain vinculin-containing focal adhesion with hVIN-1 antibody diluted 1:400 in BSA block. Incubate for one hour at room temperature.\nRinse three times with PBS.",
    "Apply fluorophore (DyLight 488)-conjugated secondary antibody (diluted 1:200) and stain actin with TRITC-conjugated phalloidin (diluted 1:200) in BSA block. Incubate for 30 minutes at room temperature.\nRinse three times with PBS, and once with water.\nMount on a glass slide in an inverted position using Prolong Gold mountant.\n5. Quantification of Rac1 Activation by Pull-down Assay\nFor analysis of Rac1 activation, apply the 20-minute ultrasound signal to cells at 37 °C, 5% CO2. When assessing response times longer than 20 minutes, apply the ultrasound signal for 20 minutes and maintain cells at 37 °C, 5% CO2 for remaining time to allow the response to develop.\nAspirate media and place wells on ice. Rinse wells with 2 ml cold PBS and aspirate. Ensure any residual PBS is removed by leaving wells tilted for 1 minute followed by thorough aspiration.\nLyse cells on ice with 35 μl lysis buffer (10% glycerol, 20 mM Hepes pH 7.4, 140 mM NaCl, 1% NP40, 0.5% Sodium Deoxycholate, 4 mM EGTA, 4 mM EDTA, 1 × cOmplete protease inhibitor) per well. In this example, 6 wells are used per time point to generate 210 μl of cell lysate. More or fewer wells can be used but total lysate volume should total ~200 μl.\nScrape cells thoroughly with cell scraper to ensure complete cell lysis and leave wells tilted for 1 minute to allow lysate to pool.\nTransfer lysate to a ice-cold 1.5-ml microfuge tube (pooling lysates from same treatment regime) and spin at 21000 × g for 2 minutes at 4 °C to pellet cellular debris.\nTransfer 180 μl of lysate to ice-cold 1.5-ml microfuge tubes containing 130 μl of lysis buffer and 25 μl PAK-glutathione agarose beads10. Keep remaining crude lysate at -20 °C for subsequent gel separation.",
    "Capture active Rac1 on the PAK-glutathione agarose beads by rotating tubes for 40 minutes at 4 °C.\nHarvest agarose bead conjugates by centrifugation at 2000 × g for 1 minute at 4 °C.\nWash bead conjugates three times with 500 μl lysis buffer, harvesting beads by centrifugation at 2000x g and discarding supernatant after each wash. Carefully remove any remaining lysis wash buffer with a 200 μl pipette.\nElute each sample by adding 35 μl SDS-PAGE loading buffer and incubate at 85 °C on a shaking heat block for 5 minutes. Remove beads by centrifugation at 21000 × g for 1 minute.\nResolve bead eluate by SDS-PAGE, transfer to nitrocellulose and probe for Rac1.\n6. Representative Results",
    "In this protocol we describe the induction of vinculin-stained focal adhesions and Rac1 activity by ultrasound. For the focal adhesion experiment, the baseline position is that fibroblasts spread on a ligand of α5β1-integrin do not form vinculin-containing adhesions (Fig. 3A) unless a second fibronectin receptor, syndecan-4, is engaged by addition of soluble ligand (Fig. 3B) 3,4. However, stimulation with ultrasound induces focal adhesion formation to the same extent as engagement of syndecan-4 (Fig. 3C), indicating that ultrasound stimulation can substitute for certain components of the fibronectin-dependent signaling pathway 5. The key hurdle with this protocol is eliminating focal adhesion formation in the absence of stimulant. Incomplete inhibition of protein synthesis by cycloheximide will allow matrix deposition that is sufficient for the cells to auto-stimulate. Overcrowding of cells can also lead to low-level focal adhesion formation and a poor response to ultrasound as crosstalk between cell-cell and cell-matrix contacts will complicate an experiment that is designed to isolate a single stimulus. As a development of the basic assay we show the same experiment, repeated with fibroblasts lacking syndecan-4 (Fig. 4). These fibroblasts still respond to ultrasound (Fig. 4C), but fail to respond to syndecan-4 ligand (Fig. 4B). The experiment using Sdc4 -/- fibroblasts demonstrates that ultrasound can indeed bypass the need for certain fibronectin receptors, and illustrates how the simple protocol can be developed to gain extra information about the signaling pathway.",
    "For the biochemical experiment we demonstrate that ultrasound can induce activation of Rac1, using a pull-down assay that is an adaptation of the method described by Del Pozo et al. 10. Precipitation of active Rac1 0, 10, 30 and 60 minutes after initiation of ultrasound stimulation reveals that Rac1 activity peaks at 10-30 minutes, before returning to the baseline (Fig. 5). Blotting crude lysates for vinculin ensures equivalent loading between time points. The result resembles activation of Rac1 by engagement of syndecan-43, but is slightly more protracted than activation by fibronectin. Therefore 8-10 repeats are typically required to achieve significant data. Activation of Rac1 is responsible for commitment of cells to focal adhesion formation, and nascent focal adhesions start to form at 10-30 minutes, coinciding with Rac1 activation. Once initiated, those adhesions will continue to mature into the large adhesion plaques shown in Figures 3 and 4.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4024/4024fig1.jpg\nFigure 1. The ultrasound wave form. Ultrasound comprises an intermittent 1.5 MHz signal that due to low amplitude (30 mW/cm2, spatial average, temporal average) has no heating effect.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4024/4024fig2.jpg\nFigure 2. Schematic representation of the workflow for preparation and stimulation of cells with ultrasound.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4024/4024fig3.jpg\nFigure 3. Ultrasound induction of focal adhesion formation in fibroblasts. Fibroblasts were spread on the integrin-binding fragment of fibronectin (A) before stimulation with the syndecan-4-binding fragment of fibronectin (B) or ultrasound (C). Following 60-minute stimulation, cells were fixed, stained for vinculin and actin, and imaged by epifluorescence. Bar = 10 μm.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4024/4024fig4.jpg",
    "Figure 4. Ultrasound induction of focal adhesion formation in fibroblasts lacking syndecan-4. Sdc4 -/- fibroblasts were spread on the integrin-binding fragment of fibronectin (A) before stimulation with the syndecan-4-binding fragment of fibronectin (B) or ultrasound (C). Following 60-minute stimulation, cells were fixed, stained for vinculin and actin, and imaged by epifluorescence. Although Sdc4 -/- fibroblasts were fibronectin-insensitive, ultrasound still induced focal adhesion formation, indicating that ultrasound bypasses matrix receptor engagement. Bar = 10 μm.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4024/4024fig5.jpg\nFigure 5. Activation of Rac1 by ultrasound. Cells were stimulated for 0, 10, 30 and 60 minutes with 6 wells used per time point. The amount of GTP-Rac1 present in samples from a Rac1 pull-down assay time course was visualized by incubation with anti-Rac1 antibody on a western blot (top image). Quantification of the band intensity (average of 8-10 replicates) reveals increased Rac1 activity resulting from ultrasound signal at 10 and 30 minutes, before returning to baseline levels at 60 minutes (graph). Error bars represent s.e.m."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}