{
  "id": 17866,
  "origin_website": "Jove",
  "title": "Murine Surgical Model of Topical Elastase Induced Descending Thoracic Aortic Aneurysm",
  "procedures": [
    "Animal protocols were approved by the University of Virginia Institutional Animal Care and Use Committee (No. 3634).\n1. Induction of anesthesia and intubation\nPlace an 8-10-week-old male C57BL/6 mouse in a closed chamber with continuous flow of 5% isoflurane and oxygen mixture for 5 min, until respirations are visibly slowed.\n\tNOTE: Different strains, genders and ages of mice can be used depending on the experimental protocol. Female mice may be more difficult to intubate because of smaller size and thus smaller airway.\nIntubate the mouse as described by Vandivort et al.13.\n\tNOTE: The intubation step is the most difficult portion of this model to both learn and perform. The above referenced authors do an excellent job explaining the steps in their video.\n2. Securing the mouse to the surgical board\nConnect the endotracheal (ET) tube, confirm chest rise, and lay the mouse in the right lateral decubitus position. Turn isoflurane to approximately 3% and apply lubrication to both eyes. The ventilator should be set to provide approximately 200 breaths per minute and 225 µL of tidal volume.\n\tNOTE: Toxicity is rapid if isoflurane is left at 5%. However, response to isoflurane is variable so anesthetic flow rate should be titrated such that spontaneous diaphragmatic contractions occur approximately every 10-20 s and oxygenation appears adequate on inspection of mucous membranes and exposed tissue.\nSecure the ET tube to the board with tape. Extend the right arm rostrally so the front paw is in line with the nose and secure it with tape.\nPull the tail caudally in order to create a line of tension between the right arm and tail, producing extension of the spine.\n\tNOTE: Securing both the tail and the right paw in line prevents over insertion or dislodgement of the ET tube.",
    "Tape the left leg in its natural position. Draw the left arm ventrally over rolled gauze and tape down.\n3. Preparation for surgery\nShave the left flank of the mouse with electric clippers from left shoulder to left abdomen.\nUse a cotton tipped applicator to brush betadine solution over the surgical site. Use a new cotton tipped applicator to brush 70% ethanol solution over the surgical site. Allow to dry. Place a sterile drape.\nCAUTION: Ensure that all ethanol is completely dried before proceeding as electrocautery is used and can ignite the ethanol.\n4. Entry into thorax\nMake a 1 cm lateral incision at the midpoint of the hemithorax using surgical scissors. Use handheld electrocautery to divide muscle layers until the ribs are visible.\nDirectly cauterize a 2 mm portion of the rib.\n\tNOTE: When using electrocautery on the rib, observe the spontaneous breathing frequency. If the mouse has a diaphragmatic contraction during cautery, the tip may enter the thorax and puncture the lung, which is usually fatal in this model.\nUsing a wetted, fine cotton-tipped applicator in the rib space superior to the cauterized portion, rotate the tip upon the tissue to break into the pleural space. Place wetted 3 mm x 2 mm sponge into the thorax to help collapse the lung.\n\tNOTE: Only let soft, wet, sponges contact the lung as it is extremely delicate.\nUse scissors to cut along the top aspect of the cauterized rib, until diaphragm is visible.\n5. Aortic exposure\nPlace rib retractors and use them to open the thoracotomy incision. Carefully remove sponge from the surface of the lung.",
    "Place wetted 6 mm x 4 mm sponge so that it lays covering the lung, with ends pointing rostrally and caudally. Place the (wide flat) lung retractor on the sponge and gently slide the retractor ventrally until the descending thoracic aorta is exposed.\nUse #7 forceps to dissect the connective tissue and fat off the aorta for an approximately 5 mm section.\n\tNOTE: Small veins may be running transversely across the aorta; avoid tearing them during dissection (using at least 14x magnification can help to avoid this complication).\n6. Elastase exposure\nSaturate 0.5 mm x 1 mm sponge with 12 μL of porcine pancreatic elastase and place it upon the exposed surface of the aorta.\n\tNOTE: Do not let the sponge touch the contralateral lung.\nAfter the predetermined time (usually 3-5 min), remove the elastase sponge with #7 forceps. Remove the lung retractor. Irrigate the chest cavity with 1 mL of sterile saline.\n\tNOTE: Remove the lung retractor before irrigation with saline as it will allow the lung sponge to become saturated and soft, making it easier to remove from the surface of the lung.\nUse rolled 2\" x 2\" gauze to absorb the remaining saline irrigation. Turn isoflurane down to 2%.\n7. Closure of chest\nRemove the lung sponge. Remove the caudal lung retractor. Remove the rostral lung retractor.\nPlace 3 interrupted 6-0 non-absorbable sutures to oppose the ribs, tie a loose knot in each but do not tie down. Take great care to not touch the lung with the suture needle.\nRe-inflate the lung by occluding the outflow tube on ventilator or by rapidly blowing 0.5-1.0 mL of air through the ET tube by utilizing the 3 way stop cock.",
    "NOTE: To avoid barotrauma, avoid excessive use of the air-filled syringe, and use no more than 1.0 mL of air.\nTie non-absorbable sutures. Reapproximate the muscle layers with a running 5-0 absorbable multifilament suture. Turn isoflurane down to 1%.\nClose skin with 7-10 interrupted 5-0 non-absorbable sutures. Turn isoflurane to 0%.\n8. Recovery\nAdminister 6 µg (0.02 mL of a 0.3 mg/mL suspension)  of buprenorphine subcutaneously. Remove the tape from the right foot, tail, and left arm followed by the right arm tape.\nWhen the mouse moves extremities, extubate by pulling it by its tail to slide off the ET tube. Place in the high oxygen content warmer chamber in the supine position.\n\tNOTE: It is safe to move mouse from oxygen chamber into cage when it can turn itself over to normal standing position. Furthermore, mice should be monitored for signs of pain, distress, or failure to thrive frequently for the first 24-48 hours after surgery and provided additional analgesia or soft food as indicated.\n9. Exposure of aortic aneurysm (terminal harvest procedure)\nNOTE: In general, tissue harvest is carried out at 14 days, as this represents the period of maximal dilatation. However, depending on the experiment, the harvest procedure timing can be carried out at any time between 3 days and 4+ weeks, depending on the experiment.\nIntubate and secure mouse to operative field as described above (sections 1-3). Use scissors to incise skin medially from left flank to central abdomen taking care to not enter the peritoneum.\nIncise skin from dorsal left flank rostrally to the level of the left shoulder. Then incise at a 90° angle through the axilla to the sternum.\n\tNOTE: This incision should completely encircle the original skin incision.",
    "Using cautery, dissect skin flap toward the ventral aspect of the mouse, exposing the left hemithorax. Use scissors to enter the abdomen and incise along the left costal margin from ventral to dorsal to expose the underside of the left diaphragm. The lateral most edge of the diaphragm may open which is desired.\nIf not created with the prior step, incise the diaphragm at its most lateral edge. Place tip of cautery in this hole and cauterize the diaphragm off the costal margin to the xyphoid process. Using a damp fine tipped cotton-tipped applicator, gently free the lung from adhesions to the chest wall and push lung medially.\n\tNOTE: If adhesions do not easily come off the chest wall, use cautery to remove them; doing so helps avoid tearing the lung which can cause heavy bleeding.\nCauterize the inside of the chest wall from rib one to the costal margin, dorsal to the mid axillary line but at least 2 mm from the aorta. Cut chest wall along the cauterized line.\n\tNOTE: This technique avoids bleeding from the intercostal arteries.\nCut along the superior margin of rib one and then caudally along the lateral edge of the sternum, removing the left rib cage. Place retractors on the lung and pull medially. Place retractor on diaphragm and draw caudally to expose as much aorta as possible.\nUse a dry cotton-tipped applicator to remove adhesions from aortic aneurysm and an unaffected distal segment. Measure the diameter of the unaffected control segment and the widest portion of the elastase treated aneurysm using video micrometry.\n\tNOTE: The video micrometry measurements are used to calculate the percent dilation of the aneurysmal segment compared to a control segment with Equation 1. A control segment that is 0.5 mm distal to the aneurysmal segment 1 is selected.",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/60105/60105eq1.jpg              Equation 1\n\t \nGrasp aorta with Harms forceps, just distal to the treated segment. Use scissors to cut distal to forceps, then dissect the aorta off spinal column. Cut aorta proximal to treated segment and remove aneurysmal aorta.\nUsing a tuberculin syringe and needle, wash the aortic lumen with saline and process tissue as desired. \nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}