{
  "id": 2004,
  "origin_website": "Cell",
  "title": "A digital PCR-based protocol to detect and quantify RNA editing events at hotspots",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nNote: The method described below has been specifically optimized for the QuantStudio Absolute Q Digital PCR platform from Thermo Fisher Scientific.\nAlternatives: The method described below can be successfully adapted to other commercially available digital PCR systems such as the QIAcuity dPCR platform from Qiagen or the droplet digital PCR platform from Bio-Rad. The QIAcuity dPCR platform uses similar technology as the one described here with the QuantStudio Absolute Q Digital PCR platform but has not been tested. Additional information on how to adapt this method to the QX200 Droplet Digital PCR (ddPCR) System from Bio-Rad can be found in Jalili et al. (2020)[href=https://www.wicell.org#bib6].\nRNA purification and generation of complementary DNA\nTiming: 3–4 h\nThis step describes how to purify RNAs from cells and perform reverse transcription to generate the cDNA required for the dPCR reaction step.\nCollect the cells for RNA purification.\nWash the cells twice with 2 mL of PBS.\nAdd 300 μL of RNA lysis buffer (R1060-1-100; Zymo) directly onto the cells, mix, and collect lysed cells in a Non-Stick RNAse-free 1.5 mL microfuge tube.\nPause point: Lysed cells can be stored at −80°C for at least a month without compromising the results.\nPerform RNA purification according to the manufacturer’s protocol. This protocol uses a Zymo Quick RNA mini-prep kit.\nAlternatives: RNA purification using a TRIzol-based method as well as RNA purification kits from other manufacturers can also be used but have not been tested.\nQuantify purified RNA using a Nanodrop spectrometer (Thermo Fisher Scientific) or equivalent.\nNote: We recommend using a Qubit fluorometer (Thermo Fisher Scientific) or equivalent to determine the RNA concentration for samples with low RNA concentrations (below 10 ng/μL).",
    "Critical: When working with RNA, it is important to avoid contamination with RNases. We recommend adopting laboratory practices that minimize contamination with RNases such as wearing gloves and using RNase-free tubes, filter tips, water, and other reagents. We also recommend using RNase decontamination solution to clean the workspace.\nPause point: Purified RNA can be stored at −80°C for at least a month without compromising the results.\nPerform a reverse transcription reaction on the purified RNA samples.\nAdd 500 ng of purified RNA diluted in 10 μL of RNAse free ddH2O to 10 μL RT-PCR reaction mix (total volume 20 μL). This protocol uses a High-Capacity cDNA Reverse Transcription Kit (Thermo Fisher Scientific).\nNote: While we recommend using 500 ng of purified RNA in the RT reaction, it is possible to use less RNA from a few ng to 500 ng without compromising the results.\nStart the RT-PCR reaction (step 1: 10 min at 20°C, step 2: 2h at 37°C, step 3: 5 min at 85°C, step 4: hold at 4°C).\nNote: The generation of cDNA may be verified by performing PCR or qPCR with primers targeting the gene of interest or a housekeeping gene.\nPause point: cDNA can be stored at −20°C or −80°C for at least a month without compromising the results.\nDigital PCR reaction mix\nTiming: 20–30 min\nThis step describes how to prepare a digital PCR reaction and properly load the samples into a digital PCR plate.\nDilute the cDNA 4 to 32-fold in RNAse free ddH2O.\nCritical: Samples that are not sufficiently diluted will result in a saturation of the microchambers with the target DNA that will preclude calculating an accurate percentage of editing events in the sample. Troubleshooting 1[href=https://www.wicell.org#sec7.1]",
    "Note: This dilution factor has been optimized for cDNA obtained from BICR6 cells (see step 2). Because the expression level of DDOST mRNA may vary between cell lines, we recommend adjusting the dilution when using other cell lines.\nAdd 1 μL of diluted cDNA to 8 μL of dPCR reaction mix.\nCritical: Probes are light-sensitive. Avoid exposure to light.\nLoad 9 μL of the PCR mix to the bottom of the well of the dPCR plate following the steps described in Figures 2[href=https://www.wicell.org#fig2]A and 2B.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1486-Fig2.jpg\nFigure 2. Samples loading on a digital PCR plate\n(A) Right; Picture of a digital PCR plate and its indicated compartments. Left; Zoom in on some of the 20,480 microchambers present in the partition array.\n(B) Schematic explanation of how to load a sample in a well of the digital PCR plate.\n(C) Picture of a digital PCR plate with the gaskets.\nCritical: Centrifuge the PCR mix at 10,000g for 1–2 minutes before loading in the plate. We have found that centrifuging the samples eliminates any micro debris that potentially affects the micro-partitioning of the PCR reactions. Troubleshooting 2[href=https://www.wicell.org#sec7.3]\nLoad 15 μL of the isolation buffer overlay for each well (Figure 2[href=https://www.wicell.org#fig2]B).\nCritical: Do not puncture the thin membrane at the bottom of the well.\nCritical: Use a new tip to load the isolation buffer for each well to avoid cross-contamination between wells and load the samples in the wells using a 45° angle to avoid the formation of bubbles.\nCritical: A minimum of 1 full column (Figure 2[href=https://www.wicell.org#fig2]A) needs to be filled with samples in a dPCR plate. For any unused well in a column to be run, add 24 μL of isolation buffer.\nApply 5 gaskets to close all the wells from the plates (Figure 2[href=https://www.wicell.org#fig2]C)",
    "Critical: Even if not all columns are used, apply gaskets across all of the wells of the plate as shown in Figure 2[href=https://www.wicell.org#fig2]C. There are 4 columns of wells plus a last column in the plate (that is not used to load samples) that need to be capped with gaskets.\nDigital PCR set up\nTiming: 1.5–2 h\nThis step describes how to load a digital PCR plate and use the QuantStudio Absolute Q Digital PCR System to analyze the samples by digital PCR.\nInsert the plates into the QuantStudio Absolute Q Digital PCR System.\nOpen the QuantStudio Absolute Q Digital PCR Software and select the column(s) to be run and assign each partition array on the software to a specific sample (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1486-Fig3.jpg\nFigure 3. Digital PCR set up\nExample of a setup page obtained from QuantStudio Absolute Q Digital PCR Software to assign the samples to be analyzed on the digital plate, the fluorescence dyes associated with the probes, and the PCR conditions.\nSelect Preheat Two-Step and set up the reaction as below (Table 1[href=https://www.wicell.org#tbl1]):\ntable:files/protocols_protocol_1486_3.csv\nNote: The PCR steps for this digital PCR-based method differ from a regular PCR reaction with both the annealing and extension steps merged into a single step. Moreover, the time for the annealing/extension step is very short due to the close proximity of the 2 primers (separated by only 24 base pairs) (Figure 1[href=https://www.wicell.org#fig1]B).\nCritical: The annealing/extension temperature and time must be optimized for every set of primers and probes.",
    "Note: The PCR condition has been optimized for DDOST probes on a QuantStudio Absolute Q Digital PCR platform (Thermo Fisher Scientific). Optimization of the PCR reaction is required if different dPCR platforms are used. For example, the PCR reaction for the DDOST probes needs to be modified to: 5 min at 95°C, 40 cycles of 94°C for 30 s, 53°C for 1 min and then 98°C for 10 min (ramp rate: 2°C s−1) when used in a droplet-based digital PCR equipment from Bio-Rad.\nAssign a fluorescence (e.g., FAM or HEX) channel to each probe (Figure 3[href=https://www.wicell.org#fig3]).\nCritical: Make sure to select ROX (a reference dye) in the channels section. While there are no probes with a ROX fluorophore, ROX is a component of the Digital PCR Mastermix (5×) and is important for quality control to confirm the proper sample partitioning. Partitions with negative ROX signals are eliminated to reduce the incidence of false negatives. Troubleshooting 2[href=https://www.wicell.org#sec7.3]\nAlternatives: Other channels such as VIC and Cy5 can be selected instead of FAM and HEX depending on the fluorophores present on the probes of interest.\nAssign a name of the run and start the reaction.\nData analysis\nOnce the PCR reaction is completed, open QuantStudio Absolute Q Digital PCR Software.\nSelect the run to be analyzed.\nAssign the samples into groups if running different sets of samples that need to be analyzed independently.\nAdjust the thresholds on the x and y-axis to assign positive FAM and HEX signals as shown in Figure 4[href=https://www.wicell.org#fig4].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1486-Fig4.jpg\nFigure 4. Quantification of the positive and negative micro-chambers",
    "(A–C) Example of scatter plots displaying HEX (WT) signals shown in orange and FAM (Mutant) signals shown in purple in MCF10A (A) and BICR6 (B) cell lines transfected with 3p-hpRNA for 48 h and 36 h respectively, or U2OS-A3A/A3AE72A DOX-inducible cell lines (C) treated with doxycycline (DOX) (200 ng/mL) for 48 h. Partitions with double-positive signals are shown in green and partitions without any amplification are shown in black. The thresholds to determine positive HEX and FAM signals are applied uniformly among samples from the same group.\nCritical: Select the group to analyze the samples together. The same thresholds on the x and y-axis need to be assigned when comparing samples from the same group.\nThe data can be exported as an Excel spreadsheet or generated as a report (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1486-Fig5.jpg\nFigure 5. Example of a table generated after the digital PCR reaction is completed\nThe positive FAM and HEX signals in the microchambers are assigned based on their fluorescence amplitude.\nNote: During a digital PCR, the target DNAs in the samples are randomly partitioned into the 20,480 microchambers (Figure 2[href=https://www.wicell.org#fig2]A). As the result of this random distribution, microchambers will contain zero, one, or several copies of the target DNA depending on the overall concentration. The microchambers are assigned as positive or negative based on their fluorescence amplitude (partitions with two identical templates of DNAs cannot be differentiated from those with one template DNA). To account for the fraction of partitions with one or more copies (where both cases are assigned as positive microchambers), the concentration of samples is corrected using Poisson modeling (Whale et al., 2013[href=https://www.wicell.org#bib12]; Dobnik et al., 2018[href=https://www.wicell.org#bib4]; Quan et al., 2018[href=https://www.wicell.org#bib8]). The formula used for Poisson modeling is:",
    "Poisson  corrected  copy  /  μ L  or  cp  /  μ L  =  (   − ln  (  1 −   number  of  positive  partition s   total  partitions    )    total  partition  volumes   )   \nCritical: When there are no negative microchambers and all the microchambers contain fluorescence signals, the Poisson correction cannot be applied. Troubleshooting 1[href=https://www.wicell.org#sec7.1]\nCalculate the percentage of RNA editing events present in each sample (Figure 6[href=https://www.wicell.org#fig6]). The formula used for calculating the fraction of editing events is:\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1486-Fig6.jpg\nFigure 6. Quantification of RNA editing at DDOST558C>U\n(A) RNA editing events at DDOST558C>U were quantified in MCF10A or BICR6 cells after 3p-hpRNA transfection for 48 h and 36 h, respectively. Error bar: S.D. (n = 3). N.D.: not detected (signal below LoD).\n(B) U2OS-derived cell lines inducibly expressing A3A or A3A-E72A were induced with doxycycline (DOX) for 48h or left uninduced. The level of edited DDOST558C>U in U2OS cells was quantified by dPCR assay. Error bar: S.D. (n = 3).\n(C) Indicated serial dilution of cDNA obtained from BICR6 cell line transfected with 3p-hpRNA for 36 h. The Poisson corrected concentration of DDOST T558 (left y-axis) and the fraction of RNA-editing event DDOST558C>U (right y-axis) were monitored. Error bar: S.D. (n = 3).\n  Percentage  of  RNA  editing  events =   mutated  cp / μ L   mutated  cp / μ L + WT  cp / μ L    × 100 %   \nNote: The dynamic range of the dPCR extends from around 0.25 copies/μL to several thousands of copies/μL without affecting the absolute quantification of the fraction of the target DNA in the samples as illustrated in Figure 6[href=https://www.wicell.org#fig6]C for DDOST. The strong advantage of having an extended dynamic range is the direct comparison of samples with different levels of concentration of the target DNA.",
    "Critical: For a sample to be considered positive for RNA editing events, the measured signal must be higher than the Limit of Detection (LoD) and have more than 1000 partitions with positive fluorescence signal (see “quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis]” section).\nAlternatives: Similar analysis and calculation can be performed when using other dPCR platforms such as the QX200 Droplet Digital PCR System from Bio-Rad (Jalili et al., 2020[href=https://www.wicell.org#bib6]; Oh et al., 2021[href=https://www.wicell.org#bib7]).\nPrimer and probe optimization for digital PCR\nThis protocol can be readily adapted to monitor additional RNA editing events induced by A3A or by other RNA editing systems. To successfully detect RNA editing events, it is important to first test the primers and probes to verify their specificity to their respective target sequences as they differ in only one nucleotide. This is crucial when determining false-positive signals.\nTo test the specificity of the primers and probes, we advise synthesizing two oligonucleotides of 200 nucleotides containing the wild-type or mutated sequence of the region of interest. Then, use these two oligonucleotides as templates instead of adding cDNA as described in step 4.\nAs shown in Figure 7[href=https://www.wicell.org#fig7], we recommend testing the probes in 4 different dPCR reactions with (A) no templates, (B) wild-type oligonucleotide template only (DDOST C558), (C) mutated oligonucleotide template only (DDOST T558), and (D) both wild-type and mutated oligonucleotide template. Specific probes should only amplify their respective target (Figures 7[href=https://www.wicell.org#fig7]B and 7C) and equal fluorescence signal (50%) should be obtained when both oligonucleotides are equally mixed together (Figures 7[href=https://www.wicell.org#fig7]D and 8[href=https://www.wicell.org#fig8]). In these reactions, using 0.1–1 pg/mL of oligonucleotides is recommended.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1486-Fig7.jpg\nFigure 7. Example of dPCR results used to determine the specificity of the DDOST primers and probes",
    "(A–D) No templates (A), DDOST C558 oligonucleotide template (B), DDOST T558 oligonucleotide template (C), or both DDOST C558 and DDOST T558 oligonucleotide templates (D) were added to the dPCR mix containing the DDOST primers and probes as indicated in step 4. The dPCR reactions were then run as described in steps 5 to 18.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1486-Fig8.jpg\nFigure 8. Quantification of the DDOST C558 and DDOST T558 oligonucleotides ratio by dPCR\nDDOST C558 and DDOST T558 oligonucleotides were mixed together (1:1 ratio) at different concentrations and quantified by dPCR. The concentrations and the ratio highlighted in blue were obtained from the panel shown in Figure 6[href=https://www.wicell.org#fig6]D. S.D.: Standard deviation.\nAdditionally, the annealing/extension temperature and time must be optimized for every set of primers/probes to limit non-specific amplification of the target. We suggest increasing or decreasing the annealing/extension temperature to improve the specificity of the primers and probes and limit false positive if such results are not obtained. Troubleshooting 3[href=https://www.wicell.org#sec7.5], 4[href=https://www.wicell.org#sec7.7], and 5[href=https://www.wicell.org#sec7.9].\nOther than testing for the specificity of the probes, this optimization step is also crucial for determining the Limit of Detection (LoD) or the threshold for significance to establish the level of false-positive signals generated by each probe, which allows to separate positive signals from background noises (see quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis] section for more details)."
  ],
  "subjectAreas": [
    "Health Sciences",
    "Crispr",
    "Cancer",
    "Cell Biology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}