{
  "id": 1715,
  "origin_website": "Cell",
  "title": "A proteomics protocol to identify stimulation-induced binding partners dependent on a specific gene in mammalian cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTransfection of cells\nTiming: 18–24 h\nMAVS+/+ and MAVS−/− HEK293T cells need to be transfected with Flag-PRMT7 before immunoprecipitation. Three 10-cm dishes with 70%–80% confluent cells are used for this experiment. HEK293T cells are cultured in DMEM medium supplemented with 10% (vol/vol) fetal bovine serum (FBS) at 37°C with 5% CO2.\nPrepare cells for transfection\nRemove old medium from MAVS+/+ and MAVS−/− HEK293T cells (with 80–90% confluency) and mildly wash cells once by PBS. Add 2 mL trypsin to each 10-cm dishes, place the dishes in a cell culture incubator for 5 min at 37°C.\nAdd 4 mL warm (37°C) DMEM medium into each plate to inactivate trypsin. Pipette the cells softly and then transfer the suspension into 15-mL tubes and spin at 600 × g for 5 min.\nRemove the supernatant, add 6 mL fresh medium to each tube, and then suspend the cells by pipetting.\nPrepare two 10-cm dishes and add 2 mL of MAVS+/+ HEK293T cells and 8 mL fresh DMEM medium into each plate. Similarly, add 2 mL of MAVS−/− HEK293T cells and 8 mL fresh DMEM medium into a new plate. Pipette the medium to homogenize cells (∼30% confluency), and put into an incubator at 37°C with 5% CO2. After seeded for 16 h, the cells will reach about 70%–80% confluency.\nPlasmid transfection\nLipofectamine 2000 and 10 μg Flag-PRMT7 are diluted with 100 μL Opti-MEM respectively. After 5-min incubation, mix them gently and incubate for 20 min at room temperature.\nAdd DNA-Lipofectamine 2000 complexes (100 μL) to each dish, mix gently by rocking the plate back and forth.",
    "6 h later, change the medium with fresh pre-warmed medium, and put back into the incubator at 37°C with 5% CO2 for 10 h before SeV stimulation. It is not necessary to change medium after transfection unless culture medium turns yellow.\nNote: The number of 10-cm dishes may vary depending on your experiments, and the abundance of protein.\nNote: The step 2 can be optional if you wish to enrich the endogenous proteins by validated antibodies.\nNote: It is recommended to transfect Flag-empty vector into MAVS+/+ HEK293T cells as a control for further analysis.\nNote: Optionally choose other transfection reagent if needed and use the manufacturer instructions for troubleshooting.\nStimulate the cells\nTiming: ∼8 h\nCells respond to pathogen-associated molecular patterns by upregulating IFN and IFN-stimulated genes (ISGs). Sendai virus (SeV) is an RNA virus which can trigger IFN response and has been extensively used to study innate antiviral responses. In this protocol, for identifying associated proteins of PRMT7 induced by RNA virus infection, we challenged cells with SeV.\nTreat the MAVS+/+ and MAVS−/− HEK293T cells with or without SeV for 8 h.\nDilute SeV (MOI=1) in minimal volume of serum-free medium.\nAdd diluted SeV to MAVS+/+ and MAVS−/− HEK293T cells, and also add the same amount of serum-free medium to another set of MAVS+/+ HEK293T cells; put the cells in the incubator at 37°C with 5% CO2 for 8 h.\nNote: The types of pathogen-stimulation and treatment time are dependent on your experiments. This step can be optional if your experiment does not need any stimulation.\nCell lysis\nTiming: ∼1.5 h\nThe transfected cells with or without stimulation are lysed and the protein concentration is measured.\nAfter the transfected cell infected with or without SeV for 8 h, transfer dishes from the incubator on ice.",
    "Remove the medium and wash dishes twice with 10 mL PBS.\nFor each dish, add 1 mL lysis buffer (RIPA) and keep shaking on a horizontal shaker at 4°C for 30 min. Optionally, use cell scrapers to lift cells from dishes if multiple dishes are transfected with the same plasmid, add 1 mL lysis buffer (RIPA) and transfer cell lysate into 1.5-mL microcentrifuge tube.\nCentrifuge at 12,000 × g for 15 min at 4°C.\nTransfer supernatant into new microcentrifuge tubes.\nMeasure protein concentration using BCA assay or other available methods.\nAdd additional lysis buffer (RIPA) to ensure the same concentration for different samples.\nSave 50 μL of each lysate as input and store at -80°C.\nNote: Prior to experiment, prepare lysis buffer and store at 4°C. 1% NaVO4, PMSF and protease inhibitor must be added immediately before use.\nNote: Even though RIPA is the most commonly used lysis buffer, sometimes a different buffer may be used, based on the proteins tested.\nCritical: Be careful about the medium containing SeV. Collect the medium using a container and have it autoclaved before discard.\nAffinity purification using Anti-Flag M2 agarose beads\nTiming: 4–5 h or overnight\nAnti-Flag M2 agarose beads (anti-Flag monoclonal antibody covalently attached to agarose by hydrazide linkage) is used to isolate Flag-tagged protein (bait) and its interactome (prey). Keep agarose beads on ice and slowly warm them at 4°C for 5 min. Gently rotate to mix bead slurry.\nPrepare enough 1.5-mL microcentrifuge tubes based on your experiments and add 20 μL anti-Flag M2 agarose bead slurry into each tube.\nWash beads with 1 mL lysis buffer by gently resuspending.\nCentrifuge at 5000 × g for 1 min at 4°C, and remove supernatant.\nRepeat step 13 and 14 three times.",
    "Replace 1 mL cell lysates from step 10 to each 1.5-mL microcentrifuge tubes containing washed beads and put on an end-over-end rotator at 4°C for 3 h or overnight.\nNote: For resin transfer, use a scissor to cut the sharp end of a plastic pipette tip to enlarge the tip opening which allows to transfer resin smoothly. Gently rotate or vortex to ensure resuspension of resin before transferring.\nNote: Be careful! Don’t transfer any resin when removing supernatant. It is recommended to use a narrow-end pipette tip which can be made by using forceps to pinch the opening of a plastic pipette tip until it is partially closed.\nWashing and elution of affinity purified proteins\nTiming: 1.5 h\nElution of Flag-tagged proteins and associated complexes can be carried out with SDS-PAGE sample buffer, 3 × Flag peptide or 0.1 M glycine HCl, pH 3.5. In this protocol, we use SDS-PAGE sample buffer as an example. Alternatively, this method can be also applied for other immunomagnetic beads. For further details about other two methods, you can refer to manufacturer instructions of anti-Flag M2 agarose beads (Sigma).\nCentrifuge the tubes containing lysate and bead at 5000 × g for 1 min at 4°C, and remove supernatant.\nWash beads with 1 mL lysis buffer by gently resuspending and try to remove nonspecific binding proteins.\nCentrifuge at 5000 × g for 1 min at 4°C, and remove supernatant.\nRepeat step 18 and step 19 three times.\nAdd 50 μL 2 × SDS sample buffer to each sample.\nBoil samples for 5 min.\nCentrifuge samples at 5000 × g for 2 min at 4°C and remove supernatants to new 1.5-mL microcentrifuge tubes. Keep on ice, use immediately or store at -80°C.\nBiochemical analysis of affinity purified proteins\nTiming: 2 days",
    "To confirm affinity purified proteins by anti-Flag M2 beads worked and enriched proteins qualified for mass spectrometry, you can perform Western blot analysis and protein staining, such as silver staining or Coomassie blue staining.\nLoad and run inputs (step 11) and concentrated samples (step 23) on SDS-PAGE gel in duplicate.\nOne set of gel is used for silver staining (Figure 2[href=https://www.wicell.org#fig2]) or Coomassie blue staining.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1172-Fig2.jpg\nFigure 2. Silver staining from samples A, B, and C shows enrichment of putative FLAG-PRMT7 interaction proteins\nTransfer another set of gel to PVDF membrane and use anti-Flag antibody for Western blot analysis.\nNote: In this step, it is recommended to make verification for gene knockout using immunoblotting analysis of the inputs from wildtype and knockout cells respectively.\nIn-gel digestion of proteins separated by SDS-PAGE\nTiming: 2 days\nOnce affinity purified proteins are validated, perform SDS-PAGE to separate proteins of each sample and use in-gel digestion to digest the proteins into small peptides which will be used for Mass spectrometry analysis.\nExcision of Coomassie blue stained bands\nSeparate protein of each sample obtained from step 23 by SDS-PAGE. In this step, we generally use straight percentage gels (10%–12%). Load each sample into two adjacent wells (up to 20 μL/well). Let them run to reach 1.0–1.5 cm in gels (200V for ∼10 min).\nStain gels with Coomassie blue.\nScan gel before cutting out the bands.",
    "Excise bands of each sample from the gel. We generally cut entire lane into 5-12 slices. Once you get the slices cut from a specific lane, further cut into 1.0 × 1.0 mm pieces and place into 1.5 mL microcentrifuge tubes. Next, use a fresh scalpel to cut each slice, and transfer them to a tube using same scalpel. Try to finish this step as quickly as possible, because gels will become stickier and sticker as they stay longer in air.\nWash gel pieces of each sample with 300 μL dH2O water for 15 min. Add 300 μL CH3CN and wash them for further 15 min. Remove supernatant.\nWash gel pieces of each sample with 300 μL NH4HCO3 (100 mM) for 15 min and discard supernatant.\nAdd 100 μL CH3CN to dehydrate gel pieces of each sample for 5 min. The gel pieces should shrink and look completely white. Remove supernatant.\nDry gel pieces of each sample in a speedvac for 5 min.\nReduction/Alkylation of gel pieces\nAdd 50 μL DTT (10 mM) in 100 mM NH4HCO3 to each sample and incubate at 56°C for 1 h. Discard supernatant.\nAdd 50 μL of 50 mM freshly prepared iodoacetamide in 100 mM NH4HCO3 to each sample and incubate in dark at room temperature for 30 min. Discard supernatant.\nWash band pieces with 300 μL of 100 mM NH4HCO3 for 15 min. Remove supernatant.\nWash band pieces with 300 μL of 20 mM NH4HCO3/CH3CN (50:50 V/V) for 15 min. Remove supernatant.\nAdd 100 μL CH3CN to dehydrate band pieces for 5 min. Remove supernatant.\nDry band pieces in a speedvac for 5 min.\nDigestion of gel pieces\nAdd 20 μL of 12.5 μg/mL trypsin in 20 mM NH4HCO3 to each sample.\nKeep gel to dehydrate in trypsin digestion buffer for 30 min.",
    "Incubate at 37°C overnight.\nExtraction of peptides\nTransfer supernatants to new 1.5-mL microcentrifuge tubes. The supernatants containing peptides are used for further analysis.\nAdd 50 μL of 1% formic acid to each sample and incubate for 20 min.\nTransfer supernatant to corresponding tubes at step (a).\nRepeat step (a) and (b) one more time.\nAdd 150 μL CH3CN to each sample and incubate for 10 min.\nTransfer supernatant to corresponding tubes at step (a).\nUse a speedvac to dry peptides in tubes at step (a) completely.\nResuspend invisible pellet with 50 μL of 1% formic acid. To optimize solubilization of peptides, firstly add 10 μL of 5% formic acid and then add 40 μL dH2O. Store at -20°C or -80°C.\nNote: Perform all gel washing and extraction steps on a shaker to ensure complete extraction of peptides.\nCritical: Perform all pipetting steps in a laminal flow hood. Do not crash your head or any other part of your body, and wear gloves and mask during this procedure in order to avoid keratin contamination.\nMass spectrometry and statistical analysis\nTiming: weeks\nSmall peptides digested from proteins of each sample are analyzed by mass spectrometry to identify the interactome of PRMT7.\nTryptic peptides are dissolved in 0.1% formic acid (solvent A), directly load into a home-made reversed-phase analytical column (C18 resin with 3-μm particle size, 250-mm length×75-μm inner diameter, Acclaim PepMap RSLC, Thermo Fisher Scientific) or other suitable column (e.g., C18 resin with 1.9-μm particle size, 250-mm length ×75-μm inner diameter, New Objective, Woburn, MA).",
    "Gradient is comprised of an increase from 5% to 6% solvent B (0.1% formic acid in 98% acetonitrile) over 5.2 min, 6%–33% in 52.8 min and climbing to 90% in 0.2 min then holding at 90% for the last 6.8 min, all hold at a constant flow rate of 400 nL/min on an EASY-nLC 1000 UPLC system.\nPeptides are subjected to ESI (Electrospray Ionization) source followed by tandem mass spectrometry (MS/MS) in Q ExactiveTM HF-X (Thermo) coupled online to the UPLC.\nThe electrospray voltage applied is 2.4 kV (according to experience). The m/z scan range is 350–1800 for full scan, and intact peptides are detected in the Orbitrap at a resolution of 60,000 (default parameter).\nPeptides are then selected for MS/MS using NCE (Normalized Collision Energy) setting as 28 and fragments are detected in Orbitrap at a resolution of 15,000.\nA data-dependent procedure that alternated between one MS scan followed by 25 MS/MS scans with 25.0 s dynamic exclusion. Fixed first mass is set as 100 m/z.\nAll acquired raw data are processed with pFind (V3.1.6) software. Peak lists are searched against NCBI protein database. Four missed cleavages are allowed for trypsin. The precursor and fragment ion mass tolerances are 20 ppm and 20 ppm, respectively. Minimum peptide length is set at 6, while the estimated false discovery rate (FDR) threshold for peptide and protein are specified at maximum 1%. For other parameters in pFind, we use the algorithm defaults.",
    "After analyzing raw data from these samples, PRMT7-associated proteins in each sample are identified. Then the identified proteins in each sample are compared with each other. The proteins enriched in sample B compared to those in sample A are considered as virus-induced PRMT7 associated proteins, and the proteins diminished in sample C compared with sample B are considered as PRMT7 associated proteins dependent on MAVS. The common proteins obtained from the two independent comparisons[(B-A)∩(B-C)] are considered as virus-induced PRMT7 associated proteins dependent on MAVS (Table 1[href=https://www.wicell.org#tbl1]).\ntable:files/protocols_protocol_1172_4.csv\nNote: For researchers who cannot directly access to mass spectrometers, mass spectrometry services and data analysis can be contracted with a facility or a commercial company available to the researchers.\nNote: It is recommended to perform replicates for sample A, B and C in order to improve the accuracy of results.\nNote: You can narrow down the range of proteins based on your research goal to find out the proteins you are interested in before validation, such as you intend to look for E3 ubiquitin ligases, you can specifically pick up the proteins with E3 ubiquitin ligase activity for further analysis.\nBiochemical analysis for the candidate validation\nTiming: 2–3 days\nAfter mass spectrometry and statistical analysis, biochemical analysis, such as immunoprecipitation, must be performed for the validation of candidate proteins. In this protocol, based on our previously study (Zhu et al., 2021[href=https://www.wicell.org#bib7]), we think that E3 ligase SMURF1 are supposed to be the target among associated- proteins. If you do not have specific target of interest, it is recommended to validate proteins based on their PSMs (Peptide Spectrum Matches).\nTreat 80%–90% confluent MAVS+/+ HEK293T cells (four 10-cm dishes including one as control) and MAVS−/− HEK293T cells (three 10-cm dishes) with SeV for 0 h, 4 h and 8 h.",
    "Cell lysates are prepared following step 4 to step 11.\nPreclear cell lysate by combing with 20 μL Protein A/G and 1 μg IgG in a 1.5 mL microcentrifuge tube. Incubate tubes at 4°C with gentle rotation for 30 min.\nCentrifuge at 5000 × g for 1 min at 4°C, and remove supernatant to new 1.5-mL microcentrifuge tubes placed on ice.\nAdd appropriate amount of PRMT7 antibody (1.0 μg–2.0 μg ) to precleared lysates from step 40 (the control is added with the same amount of IgG). Incubate samples at 4°C for 2 h with gentle rotation.\nAdd 20 μL Protein A/G to each sample. Incubate samples at 4°C for 4 h or overnight with gentle rotation.\nWashing and elution of affinity purified proteins following step 17 to step 23.\nLoad and run inputs and concentrated samples on SDS-PAGE gels.\nTransfer gels to PVDF membranes and use indicated antibodies for Western blot analysis (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1172-Fig3.jpg\nFigure 3. Immunoprecipitation analysis of endogenous interaction of PRMT7 and SMURF1 in MAVS+/+ and MAVS−/− HEK293T cells\nImmunoblot of whole-cell lysates (bottom) and proteins immunoprecipitated with anti-PRMT7 antibody (top) from MAVS+/+ and MAVS/ HEK293T cells infected with SeV for 0–8 h. Figure reprint with permission from (Zhu et al., 2021[href=https://www.wicell.org#bib7])."
  ],
  "subjectAreas": [
    "Protein Expression And Purification",
    "Crispr",
    "Proteomics",
    "Mass Spectrometry",
    "Chromatin Immunoprecipitation (Chip)",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}