{
  "id": 6610,
  "origin_website": "Bio",
  "title": "Simple Protocol for Distinguishing Drug-induced Effects on Spatial Memory Acquisition, Consolidation and Retrieval in Mice Using the Morris Water Maze",
  "procedures": [
    "Room preparationPlace the tank in the center of the sectioned/curtained off testing area.Hang different spatial cues on the north, east, south and west walls of the testing area around the tank with transparent tape, 1-2 m away from the tank.Note: Ensure that the cues are large and contain contrasting colors to the walls/curtains of the testing area for better visibility and are at a distance and height where they are visible to mice from inside the tank (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190917/20190917230857_5908.jpgFigure 1. Holding and testing area setup. The tank must be curtained/walled off such that the holding area and experimenter are not visible to mice in the tank. Distinct spatial cues in the testing areas must be displayed at a height visible to the mice from within the tank. The digital camera is mounted above the center of the tank (not depicted).Center the camera directly above the tank facing directly down and high enough above the tank to capture the entire diameter.Connect the webcam to the Windows PC situated outside of the testing area.Place the platform without flag in the center of the tank.Fill tank with water to within 20 cm of the top of the wall.Adjust the level of the platform so that it is submerged 1 cm below the water surface.Submerge the aquarium heater in the water in the tank and set it to 24 °C and allow at least 24 h to reach the set temperature. Remove heater immediately before behavioral testing and replace after each session.Add tempera paint to water until it becomes opaque. To reach opacity, approximately 0.34 g/L paint powder is needed. Opaque water prevents the mice from potentially using submerged objects, such as dropping from past trials or the base of the escape platform, as visual cues to navigate.",
    "Software setupLaunch ANY-Maze and under “File” click “New Experiment”. ANY-Maze will then open a new window with the heading “Experiment details”. Under the “Experiment” tab enter experiment name under “Title”, then enter treatment names and the number of animals per treatment in the “Treatments” section.Assign animals to each treatment: Under the Tests tab, click on “Treatment codes report”, ANY-Maze assigns a letter to each treatment entered in the “Experiment details” section (e.g., control treatment is assigned letter code A and drug treatment is assigned letter code B). Click on “Animal treatments and data”, and under the “Treatment” column use the drop-down menu to assign a letter code to each animal to a treatment group (e.g., animal number 1 is assigned letter code A, animal number 2 is assigned letter code B etc.). This will ensure that all the animals being used in the experiment have been assigned a treatment group, and can be confirmed by clicking on the “Experiment” tab and looking at the “Treatments” window on the right.For protocol setup, click on the “Protocol” tab and following the following steps:Click on “Unnamed Protocol” and assign a name to your protocol.Click on the “Unnamed Protocol” folder icon to expand all options.Click on “Video Sources” and then on “New video source”.Select digital camera from the “Source of video images” drop-down menu. This video source can be renamed for use in future experiments by entering a name in the “Video source name” text box.After setting up the camera, proceed to configuring the MWM by the following steps:Click on “Apparatus” to expand all options, the water tank should be visible on the right side of the screen under the heading “New apparatus”.Rename the apparatus to Morris Water Maze in the “Apparatus name” text box.Select digital camera from the “Video Source” drop-down menu.",
    "Select the preferred key on the keyboard for starting and stopping the assay from the “Test control key” drop-down menu. External devices (such as a wireless mouse) can also be used, as long as they are connected to the computer and are visible under the “Test control key” drop-down menu.Select None from the “Test Control Switch” drop-down menu if using the keyboard.Select the option “If a user ends a test, save results without requesting confirmation”.Draw a virtual map onto the MWM tank by the following steps:In the window to the right, click the circle icon under the “Image” heading, and draw a circle on top of the MWM water tank such that the edges of the circle perfectly line up to the edge of the water in the tank. This will set the boundary of the MWM apparatus.Next, click the line icon under the “Image” heading, and draw a vertical and horizontal line cutting through the middle of the previously drawn circle, such that the circle is split into 4 equal quadrants.Place the water maze platform in the center of the target quadrant and draw a circle around the platform using the circle icon under the “Image” heading.In order to allow ANY-Maze to measure distances to scale within the MWM apparatus, physically measure any distance in the tank (e.g., diameter of tank, diameter of platform etc.) with a ruler. Record the measured distance in the text box in front of “The length of the ‘ruler line’ is (mm)”. Make sure to position the ‘ruler line’ along the distance that was measured in the tank, so that ANY-Maze can properly assess scale within the apparatus.",
    "(The ‘ruler line’ can be found in the bottom left corner of the window labeled “Image”)Once the virtual circle and quadrants have been drawn, each quadrant must be assigned to a specific zone as follows:Click on “Zones” and enter a name in the “Zone name” text box, then click on the quadrant in the “Image” window that you wish to assign to this zone.Repeat the above step for all 3 remaining quadrants and the platform.Once all 5 zones (4 quadrants and a platform) have been assigned, click on the first zone to verify the “Zone entry settings”.Make sure the check box in front of “Use the center of the animal is checked” is selected.Repeat this for all remaining zones.In order for ANY-Maze to compute the distance of the animal travels to the platform, a reference point needs to be assigned to the platform within the apparatus as follows:Click on “Points” to add a new point in the apparatus. Place point at the center of the platform in the “Image” window to the right. Rename this point to Platform in the “Point name” text box.Make sure that the check box in front of “Use the center of the animal when calculating the distance from this point” is selected.Adjust the test settings by clicking on the “Test settings and options” then:Under “Animal color”, select the “The animals are darker than the apparatus background” option.Under “Tracking the animal’s head”, select the “No, I don’t need to track the animal’s head” option.Under “Automatic starting of tests”, select the “No, I’ll start the tests manually” option.Under “What to record while testing”, select the “Record a maximum of 10 positions/second” option from the “Recording frequency” drop-down menu.Under “What to display while testing”, make sure the following options are selected:Show the time elapsed (i.e., count up).",
    "Mark the animal’s center point.List any active zones.Display the indicators in the top right corner of the image.Display the real the time in the bottom right corner of the image.When working from video don’t show the video file name.Under “Advanced tracking options”, select the “Suppress Water-maze reflections” option.To customize the settings for all the trials run during the MWM assay, click on “Stages”, select the “Manually schedule tests” option, then click on “Trial” under “Stages” to customize trial settings as follows:Rename “Stage name” to Trial.Set “Test Duration” to 90 s.Set “Maximum number of trials in this stage” to 4.Under “Automatic repetition” of trials, select the “Don’t automatically repeat the trials in this stage (default)” option.To configure automatic data analysis click on “Analysis” to expand all options and perform the following:Under “Analysis across time”, put 30s in the text box in front of “Specify the duration of the time segments”.Under “Heading errors”, select the “The following time after the start of test” option, and put 500 ms in the text box in front of it. Also check the “Calculate heading errors to the centre of zones” option.Under “Movement towards and away from the zones and points”, select the “Calculate time moving towards zones based on the entire zone area” option.Under “Additional scoring – overlapping key strokes”, select the “Merge overlapping key strokes” option.",
    "Click on “Results, reports and data” and adjust the following settings for the “Test Schedule report”:Under “Animal and test information” these options should be selected:Test numberAnimal numberStageTrial numberApparatusTest dateUnder “Apparatus measures” these options should be selected:Test durationTotal distance traveledAll “zone measures (excluding platform zone)” should have these options selected:Time in the zoneDistance traveled in the zoneUnder “Platform zone measures” these options should be selected:Number of entries to the zoneLatency to the first entry to the zoneInitial heading error to the zoneAverage heading error to the zoneUnder “Field entries”, select the “Animal ID” optionUnder “Platform point measures” these options should be selected:Average distance from the pointMaximum distance from the pointMinimum distance from the pointAdjust the following settings under “Animal and test details reports”:Under “Apparatus measures” the options below should be selected:Test durationTotal distance traveledAverage speedAdjust the following settings under “Test data report”:Under “Animal position and activity” select the “The position of the animal” option.For all zones listed under “Test data report”, only the “Entries into the zone” option is selected.Adjust the following settings under “Data page”:Under “Animal and test information” these options should be selected:Animal numberTreatmentTreatment codeStageTrial numberApparatusTest dateUnder “Apparatus measures” these options should be selected:Test durationTotal distance traveledAverage speedAll “zone measures” (excluding platform zone) should have these options selected:Time in the zoneDistance traveled in the zoneUnder “Platform point measures” these options should be selected:Number of entries to the zoneLatency to first entry to the zoneUnder “Field entries”, select the “Animal ID” option.",
    "Under “Platform point measures”, these options should be selected:Average distance from the pointMaximum distance from the pointMinimum distance from the pointTime moving towards the pointTime moving away from the pointInitial heading error to the pointAverage heading error to the pointTo configure the results from each experiment click on the “Results” tab to perform the following:Adjust the following settings under “Text report”:Under “Apparatus measures”, select the “Test duration” option.Choose “Treatment” from the “On the x-axis show” drop-down menu.Choose the “Scatter graph” option from “Select the type of graph to display”.Choose Individual points and group means from “Select what the graph should show”.Adjust the following settings under “Graph report”:Under “Apparatus measures”, select the “Test duration” option.Choose “Treatment” from the “On the x-axis show” drop-down menu.Choose the “Scatter graph” option from “Select the type of graph to display”.Choose Individual points and group means from “Select what the graph should show”.Adjust the following settings under “Statistical analysis report”:Under “Apparatus measures”, select the “Test duration” option.Choose “Treatment” from the “Select the 1st independent variable” drop-down menu.Choose “Parametric” from the “Select the type of statistical tests to use” option.Choose the following options under “Select the control group to compare to”:1)Include a column for standard deviation.2)Show animal number next to data values.The following are settings under “Track plot report”:Select “Track of the animal’s center point” from the “Type of plot” drop-down menu.Select “Treatment” from the “Group plots by” drop-down menu.Once all parameters and settings have been configured, save protocol as a file in desired folder. A duplicate of this protocol file can be made for each training day for each MWM experiment and named accordingly.Behavioral testingDays 1-3: Habituation sessionDay 1: Acclimatize mice to the holding area.Place mice in their home cages into the holding area for 30 min.",
    "Mice may be housed in groups up to four per cage or in isolation. The number of mice per cage has little impact on MWM behavior in C57BL/6 mice (Võikar et al., 2005) unless elderly mice are to be used. With elderly mice social isolation may be a confound (Huang et al., 2018) and is not recommended.Return to normal housing room.Day 2: Acclimatize mice to the intraperitoneal injection procedure and testing area.Place mice in their home cages in the holding area.Remove one mouse from cage and use one hand to restrain the mouse by firmly grasping the mouse by the scruff using the index finger and thumb while securing the tail with the 3rd and 4th finger.Note: Always ensure that all procedures with mice are approved by your institutional animal care and use committee. Mimic an intraperitoneal injection by poking the mouse with a ballpoint pen firmly. Do not depress the skin deeper than 0.5 cm. Return the mouse to home cage for 30 min.Repeat Steps C1b ii-C1b iv for each mouse.Place one mouse on the platform positioned in the center of the maze.1)Immediately after placing the mouse in the maze, vacate the testing area.2)Let the mouse sit on the platform for 15 s. Note: During the training sessions, it is important for the mouse to take note of the extra-maze visual cues to help establish the spatial location of the platform. If the mouse fails to find the platform during a training trial, by guiding it to the platform and letting it sit there for 15 s will provide an opportunity for the mouse to see the visual cues and better establish its spatial location in the maze.",
    "The amount of time varies somewhat between various MWM protocols but 15 s is typically used and generally works well to generate learning and memory (Vorhees and Williams, 2006). 3)If the mouse jumps off the platform, guide it back to the platform with your hands to ensure that it experiences sitting on the platform for an uninterrupted duration of 15 s.Remove the mouse from the maze, dry it well with paper towels and return it to its home cage.Repeat Steps C1b vi-C1b vii for each mouse.Day 3: Acclimatize mice to the training procedure.Bring all mice in their home cages into the holding area and place on a mat that has been heated to 37 °C.Place the platform without the flag in the center of the maze in the testing area.Remove one mouse from its home cage and restrain by the scruff with one hand.Mimic an intraperitoneal injection by poking the mouse with a ballpoint pen firmly.Return the mouse to its home cage for 30 min.Repeat Steps C1c ii-C1c iv for each mouse.To begin the trial, place one mouse in the water on the perimeter of the maze at one randomly chosen cardinal direction (N, E, S, or W) and facing towards the wall of the maze (Figure 2).1)Immediately after placing the mouse in the maze, vacate the testing area.2)Allow the mouse 90 s to find the platform.3)After finding the platform let mouse reside there for 15 s.4)If the mouse does not find the platform after 90 s, or jumps off the platform, guide it back to the platform with your hands and ensure it experiences sitting on the platform for a total duration of 15 s.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190917/20190917230941_6730.jpgFigure 2. Platform and mouse placement. The starting location of mice beginning each trial is indicated by a hand holding a mouse.",
    "During all trials starting on day 3 and onward, mice are to begin facing the wall of the tank. The initial location chosen to start mice on day 3 determines the relative location mice are to begin each trial on subsequent days. The small grey circle indicates the location the submerged platform within the tank. To end the trial, remove the mouse from the maze, dry it well with paper towels and return to home cage on the heated mat to prevent hypothermia.Repeat Steps C1c vii-C1c viii for each mouse. Starting in the same cardinal direction for all mice.Days 4-7: Training sessionsBring all mice in their home cages into the holding area and place on a mat that has been heated to 37 °C.Place the platform without the flag in center of one of the quadrants of the maze, equidistant from the wall and the pool center.Note: In this protocol, we place the platform in the same quadrant for every trial during the training session. Alternatively, one-quarter of the animals can be tested with the platform in each of the quadrants. The latter approach counterbalances for possible bias in finding the target quadrant. Remove one mouse from home cage and restrain by the scruff with one hand.Spatial memory acquisition injection regime:For testing impact of drug treatment on spatial memory acquisition, inject drug or vehicle intraperitoneally into the mouse (Figure 3).For testing impact of drug treatment on spatial memory consolidation or retrieval, mimic an intraperitoneal injection by poking the mouse with a ballpoint pen firmly.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190917/20190917231015_7966.jpgFigure 3. Behavioral testing timeline. Injection regime for testing the effect of drug on either memory acquisition, consolidation or retrieval separately. Arrows of indicated colors specify when drug injections are to occur.",
    "When testing drug impact on acquisition or consolidation, mock injections with a ballpoint pen poke mimicking an intraperitoneal injection occur prior to probe 1, probe 2 and the flag trials. When testing drug impact on retrieval, mock injections occur prior to each day of training. For all testing conditions, mock injections occur during habituation.Return the mouse to home cage for 30 min.Repeat Steps C2c-C2e for each mouse.When performing an experiment, limit the number of mice used to an amount which can realistically be injected within a 30 min timespan. This prevents mice from having longer than 30 min between injection in Step C2d. and the beginning of training trials in Step C2h.Launch ANY-Maze software and open previously configured protocol. Make sure that the video source (camera) is working. The MWM should appear in the window on the right.Click on the “Test” tab.Click on “Test Schedule Report”. All trial runs for each mouse should be visible in the MWM experiment in the left window.To begin the training trial, place mouse in the tank at the same cardinal direction used during the habituation session and facing the pool wall.Immediately after placing the mouse in the maze, press “Play” as soon as the mouse is placed into the water tank to start the timer and activate video recording in ANY-Maze. Vacate the testing area in order to ensure that the experimenter is not visible to the animal.Press “Stop” to stop the timer once the mouse has found the platform in the water tank. If the mouse cannot locate the platform during the allotted time of the trial, the software will automatically stop the timer once the allotted time has been reached.",
    "If the mouse has not found the platform after 90 s has elapsed, gently guide the mouse to the platform and ensure it experiences sitting on the platform for a total duration of 15 s.At the end of each trial, remove the mouse from the maze, dry it well with paper towels and return to home cage on the heated mat to prevent hypothermia.Repeat Steps C2h-C2i for each mouse four times.Ensure there is a 10 min inter-trial interval for each mouse.Start all mice in the same cardinal direction as the first training trial for that day.On subsequent trial days, start each mouse in the cardinal direction that is one quarter turn clockwise from the starting position of the previous trial day.Memory consolidation injection regime:For testing impact of drug treatment on spatial memory consolidation, intraperitoneally inject drug or vehicle immediately after the last training session for each day.For testing impact of drug treatment on spatial learning or memory retrieval, mimic an intraperitoneal injection by poking each mouse with a ballpoint pen firmly.Repeat Steps C2a-C2j on each subsequent day of training.Note: For each training day, change the starting direction for the first trial to the cardinal direction that is one quarter turn clockwise from the previous day. Day 8: Probe trial for 24 h long-term memoryBring all mice in home cages into the holding area and place on a mat that has been heated to 37 °C.Remove the platform from the maze in the testing area.Remove one mouse from home cage and restrain by the scruff with one hand.Memory retrieval injection regime:For testing impact of drug treatment on memory retrieval, intraperitoneally inject drug or vehicle before the probe trial.",
    "For testing impact of drug treatment on spatial learning or memory consolidation, mimic an intraperitoneal injection by poking the mouse with a ballpoint pen firmly.Return the mouse to its home cage for 30 min.Repeat Steps C3c-C3e for each mouse.Launch ANY-Maze and open saved protocol.To begin the probe trial, place mouse in the tank at the same cardinal direction used during the habituation session and facing the pool wall. Immediately after placing the mouse in the maze, Press “Play” in ANY-Maze and vacate the testing area in order to ensure that the experimenter is not visible to the animal.Allow the mouse 60 s to explore the maze.ANY-Maze automatically stops recording after the mouse reaches the platform and records the time. If the mouse does not find the platform, the time is recorded as 60 s.To end the probe trial, remove the mouse from the maze, dry it well with paper towels and return to home cage on the heated mat to prevent hypothermia.Day 15: Probe trial for 7-day long-term memory and flag trial for testing visuospatial navigationRepeat Step C3 in an identical manner.After all mice have completed the second probe trial, place the platform with the flag in the maze in the center of the quadrant opposite the target quadrant used during the training and probe trials.Note: Ensure the flag is visible above the surface of the water. To begin the flag trial, place mouse in the tank at the same cardinal direction used during the habituation session, facing the pool wall and away from the flag.Immediately after placing the mouse in the maze, activate the video recording in ANY-maze and vacate the testing area.Allow the mouse 90 s to find the platform.Once 90 s has elapsed or the mouse has found the platform, end the trial.",
    "To end the trial, remove the mouse from the maze, dry it well with paper towels and return to the home cage on the heated mat to prevent hypothermia."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}