{
  "id": 3074,
  "origin_website": "Cell",
  "title": "Isolation of human cutaneous immune cells for single-cell RNA sequencing",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDay one: Obtaining the biopsy\nTiming: 30 min–1 h\nIn this step, the skin biopsy is obtained for downstream processing.\nA 6 mm skin punch biopsy is collected in a sterile 15 mL conical tube with 10 mL of RPMI-1640, supplemented with 10% Fetal Bovine Serum (FBS), 100 IU/mL Penicillin, 100 μg/mL Streptomycin, and 10 mM HEPES and kept on ice during transport.\nDay one: Manual dissociation of sample by mincing\nTiming: 30 min\nIn this step, you will begin the enzymatic dissociation and incubate the cells overnight for 16–18 h.\nNote: The cells require overnight enzymatic digestion for 16–18 h, so you should begin the “Day One: Manual Mincing Dissociation of Sample” 16–18 h before you plan to start the protocol on the second day.\nNote: These steps are conducted at room temperature under sterile conditions in a biosafety hood. All cell work should use wide-bore pipette tips to decrease cell shearing.\nTransfer the biopsy to a sterile cell culture dish to remove all subcutaneous fat and hair with scissors (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2649-Fig1.jpg\nFigure 1. Skin biopsy specimen in sterile cell dish after removing subcutaneous fat and hair\nAdd 2 mL of the enzymatic digestion buffer to a 6-well plate.\nTransfer the biopsy to the well containing 2 mL of digestion buffer.\nMince the tissue with scissors for 4 min (see Methods video S1[href=https://www.wicell.org#mmc1] for an example of mincing and Figure 2[href=https://www.wicell.org#fig2] for the desired final consistency).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2649-Fig2.jpg\nFigure 2. Appropriate skin specimen consistency after 4 min of manual mincing with scissors\nAdd 2 mL of the digestion buffer into the same well to bring to a total of 4 mL.\nIncubate at 37°C with 5% CO2 overnight for a minimum of 16 h and a maximum of 18 h.",
    "Note: Cell yield will vary between samples and may depend upon the quality of mincing.\nCritical: Minimize the time the sample is not in media to maintain cell viability.\n    Your browser does not support HTML5 video.\n  \n      Methods video S1. Skin sample manual mincing with scissors technique, related to step 5\n    \nDay two: Obtaining a single-cell suspension\nTiming: 15 min\nIn this step, you will conclude the enzymatic dissociation and obtain a single-cell suspension to stain for CD45+ immune cells for subsequent flow cytometry sorting.\nNote: All buffers, centrifuges, and cells should be kept on ice or at 4°C to maintain cell viability, and cells should be processed efficiently. All centrifuge steps should be performed with a swinging bucket rotor.\nIn the 6-well plate containing the digested biopsy, gently pipette up and down 6–8 times to mix with a 5 mL serological pipette and transfer to a 50 mL conical tube (Methods video S2[href=https://www.wicell.org#mmc2]).\nRinse the same well with 4 mL of cold wash buffer and transfer to the same 50 mL conical tube.\nVigorously shake the tube for 30 s. Do not vortex as this may lyse or damage the cells.\nPre-wet a 100 μm filter with 1 mL wash buffer over a new 50 mL conical tube.\nPour the cell solution through the filter into the new 50 mL tube.\nRinse the original conical tube with 5 mL of wash buffer and pour over the filter to wash the filter. Allow the liquid to filter through thoroughly before removing and discarding the strainer.\nCentrifuge the new conical tube containing the single cell suspension at 400 g for 5 min at 4°C.\nDecant by pouring supernatant out. There will be approximately 100–200 μL of volume remaining. See Methods video S3[href=https://www.wicell.org#mmc3] for further clarification.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2649-Fig3.jpg\nFigure 3. Flow cytometry gating methods",
    "(A) Excluding Debris with a Forward Scatter (FSC) versus Side Scatter (SSC) plot.\n(B) Excluding Doublets with a FSC-Area (A) versus FSC-Width (W) plot.\n(C) Exclusion of Dead Cells with a DAPI-A versus SSC-A plot.\n(D) Obtaining Live, Single, CD45+ Cells with a SSC-A versus CD45+ graph.\n(E) Optional method to plot DAPI Live Dead versus CD45 APC.\nNote: There is less cell loss with decanting relative to supernatant aspiration.\nNote: We do not utilize a red blood cell lysis step as CD45+ cells will be selected for in FACS sorting.\nNote: It is not necessary to conduct a debris removal step because the cells will be filtered in steps 12 and 28, undergo several wash steps, and debris will be gated out in the first plot of the FACS sorting step (See Figure 3[href=https://www.wicell.org#fig3]A).\nResuspend in the remaining volume and transfer to a 96-well V-bottom plate.\nCount the cells using a hemocytometer.\nObtain a 7.5 μL aliquot of the cell suspension and add an equal amount of 0.4% Trypan Blue Solution.\nGently mix, incubate at room temperature for 5 min.\nTransfer 10 μL to a hemocytometer chamber.\nNote: Typical yields will vary based on disease and diseased state. Ranges that we note for healthy, non-diseased skin are 300,000–600,000 cells and for inflamed skin ranges from 500,000 to 5 million cells.\n    Your browser does not support HTML5 video.\n  \n      Methods video S2. Day Two Pipetting to Mix the Sample, related to step 8\n    \n    Your browser does not support HTML5 video.\n  \n      Methods video S3. Decanting Supernatant when in 50 mL or FACS tubes, related to step 15\n    \nDay two: Staining the single-cell suspension for CD45+ immune cell sorting\nTiming: 45 min",
    "In this step, the immune cells will be marked for separation from the rest of the cell suspension with fluorochrome-labeled antibodies. The flow cytometer will achieve this isolation through scattered light and fluorescence-based sorting. These CD45+ immune cells will be the cells utilized for single-cell RNA-sequencing.\nCentrifuge the 96-well plate at 400 g for 5 min at 4°C.\nDiscard the supernatant by tipping over the plate.\nResuspend the cells with 100 μL of antibody cocktail. The antibody cocktail will contain 97 μL of Cell Staining Buffer and 3 μL of CD45 Mouse Anti-Human APC (approximately a 1:30 dilution).\nNote: Researchers should conduct antibody titrations on optimization/test skin samples to ensure optimal antibody staining and ultimately optimal immune cell isolation.\nNote: When staining for flow cytometry, it is common practice to make an antibody cocktail as a master solution containing the conjugated antibodies and the staining buffer and resuspend the dry pellet with 100 μL of this solution. This is especially beneficial when there are many samples or multiple antibodies to stain for. By creating an antibody cocktail, you increase the volumes pipetted, create a uniform solution, and can quickly and efficiently stain numerous samples at a time. Always make enough volume for the number of samples (plus 1–2) for the antibody cocktail.",
    "Note: Other fluorophores may be used. However, we have noted that APC allows for a bright signal and minimal spectral overlap with DAPI. Please ensure that the selection of fluorophores is compatible with your cytometer. Per the manufacturer, the CD45 Mouse Anti-Human antibody that we utilize has an Excitation Range of 633–647 nm, an Emission Spectrum of 660 nm, and is excited by the Red Laser (637 nm) with a BandPass Filter of 670/30 and LongPass Mirror of 650LP. DAPI can be excited by an ultraviolet (UV) or violet laser. We utilize the violet laser at 402 nm with a BandPass Filter of 431/28 and LongPass Mirror of 410LP. DAPI excites at 358 nm and has an emission maximum of 460 nm.\nCritical: Do not add DAPI at this point in the protocol. DAPI will be added at the end of the procedure, in step 38, just before sorting the sample in the FACS sorter.\nIncubate for 30 min at 4°C in the dark.\nCritical: Flow cytometry antibodies are light-sensitive and can be photobleached. It is critical that the cells are incubated in the dark and protected from excess light downstream.\nAfter incubation, add 150 μL of FACS buffer and pipette up and down three times to mix.\nCritical: To maximize viability, it is essential to be gentle with resuspending the cells.\nCentrifuge the plate at 400 g for 5 min at 4°C.\nDiscard the supernatant by tipping over and resuspend with 200 μL of FACS buffer. Pipette up and down to resuspend three times.\nCentrifuge the plate at 400 g for 5 min at 4°C.\nDiscard the supernatant by tipping over.\nResuspend cells in 200 μL FACS buffer.\nUsing the same pipette tip, transfer to a filtered FACS tube to filter the cells before sorting.",
    "Wash the original well with 200 μL of FACS buffer and pass through the same filter to wash.\nFill a new 5 mL FACS tube with 3 mL of Cell Staining Buffer to collect the sorted cells.\nNote: When sorting cells, the concentration affects the sorting efficiency. We find that 400 μL is an appropriate volume for efficient sorting while minimizing sort time. With inflamed samples, we often have 1–2 million cells at this step, however, we have noted that 400 μL is appropriate with our highly inflamed samples that have had up to 5 million cells. An additional method to monitor this is with sort efficiency. If you have a higher number of cells (e.g., a highly inflamed skin sample), you may need to increase the final volume. While sorting, your cytometer may include a sort efficiency metric, which can aid in determining the best concentration for your sample. During the sort, if your sort efficiency falls below 70%, it is discarding 30% of your sorted, desired cells. This indicates that your sample may be too concentrated, and you should increase the buffer volume to decrease sorted cell loss.\nCell sorting/gating preparation\nTiming: 30 min–1 h\nIn this section, you will prepare your flow cytometry gating workflow as well as test your DAPI concentration. This should be conducted on optimization/test skin samples prior to obtaining patient biopsies that you intend to perform scRNA-seq on. If you have completed this workflow and created a gating template, you can proceed directly to the next section on Cell Sorting for CD45+ Cells with Flow Cytometry, skipping steps 31–35 and starting at step 36.\nIf not already prepared, set a sorting gate to capture cells on the Forward Scatter (FSC) versus Side Scatter (SSC) plot (Figure 3[href=https://www.wicell.org#fig3]A).",
    "If not prepared, take the gated population from the previous step and create a FSC-Area versus FSC-Width plot to exclude any doublets (Figure 3[href=https://www.wicell.org#fig3]B).\nNote: You may additionally utilize a SSC-A versus SSC-H gate to exclude any remaining doublets.\nIf not prepared, plot the singlets on a DAPI-A versus SSC-A plot and create a gate to exclude any DAPI-positive cells (Figure 3[href=https://www.wicell.org#fig3]C).\nCritical: The live cells will be DAPI-negative.\nNote: Our DAPI stock concentration is 1 μg/mL. We add DAPI for a final concentration of 1 μL per 1 million cells. However, it is beneficial to test this to ensure this concentration will allow for high viability.\nIf not prepared, plot the live, single cells on a SSC-A versus CD45+ APC plot and create a sorting gate for CD45+ cells (Figure 3[href=https://www.wicell.org#fig3]D).\nNote: Alternatively, researchers may plot DAPI versus APC on a singular plot (see Figure 3[href=https://www.wicell.org#fig3]E).\nCreate a sort layout to sort the live, single, CD45+ cells.\nSorting for CD45+ cells with flow cytometry\nTiming: 30 min–1 h\nThis step isolates the less abundant immune cell subpopulation and ensures high cell viability for sequencing by eliminating poor-quality cells and debris. These poor-quality cells include non-single cells and dead cells. We utilize the BD FACSAria Fusion Cell Sorter (BD Biosciences, Vienna, Austria). During this step, we collect all sorted CD45+ cells, as there will be cell loss in later wash steps.",
    "Note: The BD FACSAria Fusion Cell Sorter will sort 400 μL of our cell suspension in approximately 25 min. However, other cytometers may result in different time requirements for sorting. We have only conducted the sorting of up to three samples sequentially during the same day. The total sorting time was approximately 1.5 h and we have not seen any diminishment in cell quality at this number due to the extended preparation time due to processing multiple samples.\nCritical: Before obtaining patient biopsies, please ensure familiarity with flow cytometry and conduct optimization experiments to set PMT voltages, a gating template, and compensation controls. As referenced in steps 31–35, a gating template based on optimization samples will allow for timely and accurate flow sorting. This template will be created based on the single-stained samples to accurately set gating parameters.\nCritical: Ensure the cytometer has been turned on and calibrated before you bring your cells to sort. Prolonging the protocol by setting up the cytometer when the cells are ready to sort may decrease cell viability and increase cellular stress.\nTurn the sorting pressure on to the lowest setting.\nOpen the previously created gating template (from the section: Cell sorting/gating preparation).\nAdd DAPI and flick mix the sample. Allow the DAPI to incubate for 5 min.\nNote: Our DAPI stock concentration is 1 μg/mL. We add DAPI for a final concentration of 1 μL per 1 million cells. However, it is beneficial to test this to ensure this concentration will allow for high viability.\nBegin the sort with the pressure on the lowest setting, and sort into the previously prepared collection tube with 3 mL of Cell Staining Buffer.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2649-Fig4.jpg\nFigure 4. Immune cell subsets within the sorted CD45+ cell population",
    "Critical: Sorting should be conducted under the lowest pressure and flow setting to decrease cell stress.\nNote: Figure 4[href=https://www.wicell.org#fig4] portrays selected expected immune cell populations, including T cells, natural killer cells, and dendritic cells.\nDay two: Preparing for 10× genomics chromium library preparation\nTiming: 30 min\nThis step will ensure your CD45+ cells are at the proper volume and concentration for 10× Genomics Chromium Library Preparation.\nNote: All the below steps are conducted with the new FACS tube that contains your sorted CD45+ cells.\nAdd FACS buffer into the sorting tube to bring to a total of 5 mL.\nResuspend to wash the sides of the FACS tube with FACS buffer.\nCentrifuge the tube at 400 g for 5 min at 4°C.\nDecant by pouring off.\nCentrifuge at 400 g for 1 additional minute at 4°C.\nResuspend in the remaining volume and transfer to a 96-well v-bottom plate.\nSpin the plate at 400 g for 5 min at 4°C.\nDecant the supernatant by tipping over.\nAdd 10 μL Cell Staining Buffer to a total volume of approximately 41 μL.\nNote: As noted in step 51, the final concentration will ideally be 700–1,200 cells/μL. By resuspending at 41 μL, after a volume loss of 7.5 μL for the cell count in step 50, the cell volume will likely be at the maximum volume that can be loaded on the Chromium chip for step 52.\nResuspend the cells and transfer to a Low Retention 0.8 mL Microcentrifuge Tube.\nPerform a final cell count with a hemocytometer by taking a 7.5 μL aliquot of the cells and combining with 7.5 μL of Trypan Blue Solution, 0.4%. Gently mix, incubate at room temperature for 5 min, and then transfer 10 μL to a hemocytometer chamber.",
    "Note: The cell yield will vary between disease states. However, generally, healthy skin ranges from ∼5,000–20,000 cells at this step, and inflamed skin samples have an average of approximately 30,000 cells with a range of 5,000–50,000 cells depending on disease state.\nIdeally, the final concentration of cells is 700-1,200 cells/μL.\nNote: If your concentration is above this, adjust to this concentration with Cell Staining Buffer and perform an additional cell count.\nProceed to desired single-cell RNA-sequencing library construction protocol (e.g., 10× Genomics Chromium Single Cell 3ʹ expression library kit). For scRNA-seq, please see the 10× Genomics latest recommendations for sequencing depth and parameters, but we typically utilize 20,000 read pairs/cell for Single Cell 3′ v3.1 libraries and Single Cell 5′ v2 libraries.\nNote: Minimize post-sorting time prior to utilizing cells for library preparation.\nNote: Researchers may desire an additional method to ensure cell viability prior to sequencing. As you will sort for live cells and conduct a live/dead cell count at the end of the protocol, researchers may identify additional tests for ensuring cell viability, but we have not found them to be necessary, as our scRNA-seq quality control metrics show a high percentage of fraction of reads in cells (representative of high cell viability).\nNote: To quantify and assess quality of our scRNA-seq libraries, we use the High Sensitivity DNA assay on the Agilent 2100 Bioanalyzer and either KAPA Library Quantification kit or a Qubit fluorometer."
  ],
  "subjectAreas": [
    "Rnaseq",
    "Immunology",
    "Cell Isolation",
    "Flow Cytometry",
    "Molecular Biology",
    "Single Cell"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}