{
  "id": 17520,
  "origin_website": "Jove",
  "title": "Quantification of Optic Nerve Cross Sectional Area on MRI: A Novel Protocol using Fiji Software",
  "procedures": [
    "The following study was approved by the research committee and institutional review board of the University of Jordan Hospital. The following protocol will describe the imaging technique used to acquire MRI images, followed by image processing and optic nerve quantification using Fiji software.\n1. MRI image acquisition\nNOTE: MR image acquisition was done using a 3 Tesla (3 T) MRI to perform multiplanar T2-weighted fat suppression sequence (Table of Materials).\nFully explain the examination to the patient. The following include instructions and explanations that need to be mentioned to the patient.\n\t\nExplain to the patient that they will need to change clothes and wear a special gown for imaging.\nHave patients remove any worn eyeliner as it can produce artifacts (especially at 3 T) due to electrical conductivity of the titanium oxide pigment.\nEnsure that the patient does not have any contraindications to perform MRI imaging9:\n\t\t\nAsk the patient about any metallic materials, which might include face masks, piercings, artificial limbs, magnetic dental implants, cerebral artery aneurysm clips.\nAsk the patient about metallic intraocular foreign bodies. For this, ask the patient if they have welded without proper protective gear.\nAsk the patient about any implantable devices might be incompatible with MRI, including pacemakers and insulin pumps, analgesic drugs, or chemotherapy pumps. In addition to this, cochlear implants/ear implant, Implantable neurostimulation systems, Implantable neurostimulation systems, Catheters with metallic components, are all contraindicated.\nAsk the patient about metallic foreign body left inside their body. This includes bullets, shotgun pellets, and metal shrapnel\nAsk the patient about any surgical clips or wire sutures, joint replacement or prosthesis, inferior vena cava (IVC) filter, ocular prosthesis, stents, or intrauterine device.\nAsk the patient if they have gotten a tattoo in the last 6 weeks.",
    "Ask the patient if they have undergone a colonoscopy procedure in the last eight weeks.\nDue to the confined space of the MRI machine, ask the patient if they have claustrophobia.\n\t\t\tNOTE: Difficulty might be found with patients having high body mass index (BMI).\nExplain to the patient that the exam is expected to take 15 minutes, where the patient needs to stay still.\nAfter completing the instructions and making sure the patient fully comprehends the exam, obtain a signed consent.\nDuring MRI image acquisition, lay the patient supine in the MRI machine, and fixate on a straight target during imaging without any head movement. For patients with poor visual acuity, use a sound stimulus to optimize fixation. More comprehensive methods for fixation involve shutting one eye, use of a fixation target centrally in the form of an LCD screen that changes colors, and use of ocular lubricants.\nEnsure that the patient is aware that there is a squeeze button that can be pressed if they need anything while in the MRI machine. While a head coil can be used, an eye coil and an orbital coil may be more suited for ophthalmic imaging.\nInput the following parameters for image acquisition: A T2-weighted fat suppression sequence (TR = 3000 milliseconds; TE = 90 milliseconds; TE = 100; field of view = 16 cm×16 cm; matrix = 296*384; slice thickness = 3 mm; slice gap = 0.3 mm). The final image analyzed was an oblique coronal image 3 mm behind the globe. It is important to note that while T2-weighted fat suppression sequence is generally used for optic nerve imaging, other sequences can be used, including T2 fast spin echo imaging.",
    "Take a coronal cut of the optic nerve orthogonal (i.e., perpendicular) to the nerve 3 mm posterior to the globe. Use scout images in the transversal and oblique sagittal planes to ensure optimal optic nerve direction and optic nerve-globe junction positioning.\nAssess the quality of gaze fixation by CSF distribution around the optic nerve, where it should be uniformly distributed around the optic nerve with almost equal thickness at all sides.\nRepeat the process to image the optic nerve for the other side.\n2. Image analysis\nDownload Fiji image processing package from (https://imagej.net/Fiji).\nUpload the coronal image of optic nerve to ImageJ Fiji software for analysis by clicking File from the menu bar, followed by Open button. Choose the coronal image to be processed. Transfer the images to Fiji software without losing image quality during transfer, as image quality loss will lead to unreliable image analysis results.\nStandardize the scale by specifying the number of pixels per a unit of length by drawing a straight line on the map scale. Then choose Set Scale from the Analyze menu bar. Specify the length of the line as appears on the map scale with the proper unite of length (i.e., mostly mm).\nConvert the image into a grayscale using the image menu, and then choosing Type and 8-bit.\nQuantify the range of intensity of white matter pixels.\n\t\nUsing the Lasso selection tool (Plugin | Segmentation | Lasso tool), select a sufficient area of white matter, making sure not to include gray matter area during selection. We found that a total selected white matter area of around 1000 pixels is enough. Use Analyze and Measure tool to quantify the selected area.",
    "Show the Histogram tool from Analyze menu, which shows the distribution of pixels intensity in the white matter area selected. Click on the Live box to make sure the histogram assesses the selected area. The graph on the histogram should show a normal distribution of intensity.\nCalculate white matter intensity range as follows:\n\tLower limit = mean intensity - (3* standard deviation)\n\tUpper limit = mean intensity + (3* standard deviation)\nOpen the Threshold tool from Image menu, followed by the Adjust function. Specify the range calculated from the previous step. Tick only dark background function and specify black and white annotation B&W from drop list, then click apply. The mask for white matter present within the optic disc will appear.\nUsing the Lasso selection tool (Plugin | Segmentation | Lasso tool), select the black area representing the optic disc.\nUse the Measure function from the Analyze menu bar, which will calculate the area marked by the threshold function in mm.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}