{
  "id": 19730,
  "origin_website": "Wiley",
  "title": "Intravital Microscopy for the Study of Hepatic Glucose Uptake",
  "procedures": [
    "Here, we describe in detail microscope setup, mouse preparation, mouse anesthesia, and a surgical procedure for liver exposure. Next, we provide guidelines on how to position the mouse on the microscope stage to minimalize motion artifacts due to heartbeat and respiration while maintaining proper perfusion.\nIMPORTANT NOTE: All experiments involving animals must be performed under an animal protocol approved by your animal care and ethics committee. Personnel should be properly trained before proceeding.\nMaterials\nClidox disinfectant (VWR, MSPP-96118F)\nMus musculus\n70% (v/v) ethanol\nFORANE (isoflurane, USP) liquid for inhalation, 250 ml (Baxter, 10019-360-60)\nHeparin sodium, 1000 USP U/ml (Hikma, 0641-0391-12)\nNormal saline (0.9% sodium chlorine; Fisher Scientific, cat. no. 7210-16)\nLeica SP8 (or other commercial) confocal microscope\nCustom-made stage cardboard of appropriate dimensions (see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-tbl-0001])\nCustom-made aluminum stage insert (3 mm thick) with 35-mm depression\n40-mm coverslips (Bioptech, 40-1313-0319)\nSurgical gauze\n½-inch. masking tape\nAnesthesia machine: AMD-3 plus (Somni, AMD-17106)\nReusable chemical heat packs\nMouse heat pad (ALA Scientific Instruments, HEATINGPAD-1/2)\nSpace heat pad (AIMSTM, AIMS™ GGP1)\nUltra Fine U-100 Insulin Syringes, 31-G (BD, BD328438)\nHair clipper\nSurgical scissors\nCautery System (Gemini, GEM 5917)\nSurgical forceps, curved tip\nCotton-tip applicators\nHeat pad with rectal probe (ALA scientific instruments, HEATINGPAD-1/2)\nAquasonic 100 ultrasound transmission gel (Parker lab Inc)\nTable 1.\n                Reagents for Mouse Liver Intravital Microscopy\ntable:\n﻿Unnamed: 0,Mouse body weight (g),Board (cm),Board thickness (mm),Imaging window (cm)\nSmall (S),17-20,12 × 8,1.5,2.5 × 2.3\nMedium (M),22-25,15 × 8,2.5,2.0 × 2.0\nLarge (L),>30,15.5 × 8,4.0,3.5 × 1.8\nMicroscope preparation",
    "1. IVM of the liver can be performed on any commercial inverted confocal microscope (Fig. 1B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-fig-0003]). Standard microscope stages have various inserts to accommodate slides or tissue culture plates. For IVM, a flat surface with a 35-mm circular opening covered with a 40-mm coverglass is required. In some cases, 35-mm-plate inserts can be modified to hold a mouse. Alternatively, a custom-made metal insert, 3 mm in thickness, with a central 35-mm circular opening can be fabricated. The coverglass should be cleaned thoroughly on both sides using 70% ethanol before use.\n2. Select the objective based on area size, spatial resolution, and the length of the imaging session. In general, lower magnification is useful for imaging larger areas at lower resolution, whereas higher magnification increases the resolution of smaller structures. One should consider that motion artifact (see below) will be more noticeable when using higher magnifications.\n3. Select stage cardboard dimensions based on mouse weight (see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-tbl-0001]) and tape the stage insert with the imaging window (in the cardboard) directly over the coverslip (Fig. 1D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-fig-0003]). Minimizing motion artifacts due to respiration and/or heartbeat is central to IVM; the cardboard is used to absorb such motion while also creating a barrier between the body and the microscope stage. Place a small strip of gauze (1 × 8 cm) across the cardboard imaging window and fix it with masking tape on one side (Fig. 1D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-fig-0003]).\n4. Warm the stage area using chemical heat pads at least 30 min prior to imaging. This will help maintain the mouse body temperature during the imaging experiment.\nMouse anesthesia and surgical procedure\n5. Clean anesthesia induction chamber with Clidox disinfectant; this will remove odor of the previous mouse, which reduces stress.",
    "6. Place the mouse in the induction chamber, and turn on the oxygen condenser and 3% isoflurane for 5 min. When the mouse is anesthetized, transfer it onto the heating pad and maintain anesthesia using 1% isoflurane delivered via a nose cone (Fig. 1C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-fig-0003]).\nThis procedure should be done using isoflurane as opposed to other anesthetic agents such as ketamine and xylazine to avoid stimulation of hepatic gluconeogenesis, which may affect the rate of glucose uptake in the liver (Bevan, Rose, & Duggan, 1997[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-bib-0002]).\n7. Inject 20 U heparin intraperitoneally (i.p.; dilute 20 μl heparin from 1000 U/ml stock into 30 μl saline). The liver is prone to injury and ischemia; heparin ensures proper perfusion during the imaging study.\n8. Shave the mouse abdomen using a hair clipper and remove hair using gauze soaked with 70% ethanol (Fig. 1C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-fig-0003], left).\nRemoving hair from the surgical site is crucial, as any errant hairs on the liver surface can impede your field of view.\n9. Expose the liver by making a 2- to 3-cm incision along the ribcage starting from the xiphoid and ending at the left lateral side of the abdomen. Initially, the outer skin is cut with scissors, and then the muscle layer is cut, using a cauterizer as needed to avoid bleeding. To avoid burning the liver with the cauterizer, carefully open the abdominal cavity on the lateral side and insert wet gauze (soaked in normal saline) between the liver and muscle layer before starting with the major incision (Fig. 1C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-fig-0003], right).\nMice injected with heparin will be susceptible to bleeding. Using a cauterizer to avoid excessive bleeding is crucial for mouse survival.\nPositioning of the mouse",
    "10. Position mouse on the microscope stage with the exposed left lateral lobe of the liver laid against the coverslip. Use gauze to separate the liver lobe from the intestines and mouse by placing it between the liver and abdomen (Fig. 1D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-fig-0003]). Stretching the mouse flat on the microscope stage may help reduce motion (Fig. 1E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-fig-0003]).\n11. Reposition the mouse if breathing causes the liver position to shift on the coverslip. Adjust the liver position very gently using a cotton-tipped applicator soaked in normal saline.\n12. Secure the mouse's neck to the stage using tape to prevent motion artifacts upon retro-orbital injection of fluorescent tracers during imaging. Adjust the nose cone so that the mouse remains under the plane of anesthesia while allowing access to the eye. Maintain mouse anesthesia through delivery of 1% isoflurane via a nose cone on the microscope stage.\nHigher percentages of isoflurane can make the mouse gasp, causing exaggerated chest movements that destabilize the liver during imaging.\n13. Monitor and maintain the mouse body temperature using a heat pad with a rectal probe. Avoid placing the heat pad directly against the skin to avoid overheating. Additionally, avoid tissue dehydration by (1) using a microscope with an enclosed chamber with humidity control or (2) applying Aquasonic 100 ultrasound transmission gel at the edges of the exposed cavity.",
    "This protocol describes how to (1) fluorescently label different compartments within the hepatic lobule, (2) identify PV regions, and (3) select the ideal imaging area for time-lapse IVM.\nMaterials\nAppropriate fluorescent dyes (see Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-tbl-0002])\n31-G insulin syringe\nTable 2.\n                Reagents for Fluorescent Labeling of Hepatic Compartments\ntable:\n﻿Fluorescent dyes,Compartment,Concentration,Source (cat. no.)\nAlexa Fluor® 647–conjugated anti-mouse/human CD324 (E-cadherin) antibody,PV hepatocytes,0.5 µg/g,Biolegend (147308)\n2 M tetramethylrhodamine-dextran,Vasculature,18 µg/g,Thermo Fisher (D7139)\nHoechst 33342,Nuclei,2 μg/g,Thermo Fisher (H357\nAdditional reagents and equipment for mouse anesthesia, surgery, and intravital imaging (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-sec-0080])\n1. Anesthetize the mouse and maintain anesthesia using nose cone (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-sec-0080]).\n2. Inject 0.5 µg/g Alexa Fluor® 647–conjugated anti-mouse/human CD324 (E-cadherin) antibody diluted in 1× heparin (total volume of 50 μl) via retro-orbital injection using a 31-G insulin syringe.\n3. Inject 2 µg/g Hoechst 33342 diluted in 1× heparin (total volume 50 μl), via retro-orbital injection using a 31-G insulin syringe. Use the other eye for Hoechst 33342 injection, as the probe tend to precipitate if combined with other fluorescent probes.\n4. Incubate 30-45 min to allow labeling of PV hepatocytes and nuclei, while controlling the body temperature with a heating pad.\n5. Prepare microscope and mouse for imaging (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-sec-0080]).\n6. Secure the mouse's neck to the stage with tape.\n7. Minimize motion, then retro-orbitally inject 18 µg/g of fluorescent dextran diluted in 10 USP units/ml heparin (total volume 50 μl) using a 31-G insulin syringe.\n8. Assess blood flow by observing the fluorescent dextran signal via the eyepiece. Strong labeling of the vasculature should occur within 1 s of injection (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-fig-0004]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/cf9d2d5a-3c66-4422-86c6-dce1ad69e52b/cpz1139-fig-0002-m.jpg</p>\nFigure 2",
    "Imaging different compartments in the liver. (A) IVM image of the liver parenchyma. Sinusoids are labeled with 2 M dextran (cyan), PV hepatocytes with Alexa-647-conjugated E-cadherin antibody (magenta), and nuclei with Hoechst 33342 (yellow). The white hexagon denotes one lobule, and the dashed rectangle the hepatic acinus. PV, portal vein; CV, central vein. Scale bar, 50 µm. (B) Close-up view of the hepatic acinus. (C) Selected frames from time-lapse IVM demonstrating how fluorescent blood tracers such as 2 M dextran (cyan) can be used to identify PV and CV regions based on the direction of blood flow. Scale bar, 50 µm.\n9. Identify PV from CV areas of the lobule using E-cadherin labeling and the direction of the blood flow. Blood flows from the PV towards the CV regions (Fig. 2C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-fig-0004]).\n10. Select an imaging area that is stable and has a good blood flow. This can be assessed by looking through the eyepiece and acquiring a short IVM time-lapse to evaluate stability over time.\nIt may take 20-30 min for the liver to settle down and form stable contact with the coverslip.\n11. Set up time-lapse IVM to acquire 512 × 512 pixels every 2.5 s for 10 min using the 20× objective (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-fig-0004] and Video 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-fig-0001]).\nThis video cannot be streamed at this time, please download the video instead.[href=https://currentprotocols.onlinelibrary.wiley.com/cms/asset/82510039-01a9-40c7-a19b-82ba398bf323/cpz1139-vid-0001.mp4]\nVideo\nThe liver was labeled with Hoechst (nuclei; yellow) and Alexa-647-conjugated E-cadherin antibody (magenta) to mark PV regions prior to time-lapse IVM acquisition. Fluorescent dextran (2 M; cyan) was injected while acquiring time-lapse IVM, which can be used to identify PV and CV regions based on the direction of blood flow. Magnification: 20×; 512 × 512; frames were acquired every 2.5 s. Scale bar, 50 µm.",
    "This protocol describes how to use the fluorescent glucose analog 2-(N-(7-nitrobenz-2-oxa-1,3-diazol-4-yl)amino)-2-deoxyglucose (2-NBDG) to measure glucose mobilization between different compartments in the hepatic lobule of a live, anesthetized mouse. A step-by-step guideline for image analysis follows. This procedure provides an alternative to other methods of measuring hepatic glucose uptake by providing spatiotemporal information. The protocol can be completed in 45-60 min per mouse.\nMaterials\nDextrose 50% (Hospira, 000622)\n2-NBDG (Thermo Fisher, N13195)\n31-G insulin syringe\nImageJ software or similar\nExcel spreadsheet software\nAdditional reagents and equipment for mouse anesthesia, surgery, and intravital imaging (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-sec-0080])\nImage acquisition\n1. Fast the mice for 4-6 hr prior to imaging.\n2. Prepare the microscope and surgically expose the liver as described in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-sec-0080].\n3. Secure the mouse's neck to the stage with tape.\n4. Minimize motion, then retro-orbitally inject 18 µg of dextran per gram of mouse body weight (diluted to a total volume of 50 μl in 10 USP U/ml heparin) using a 31-G insulin syringe.\n5. Set up time-lapse IVM to acquire 512 × 512 pixels every 2.5 s for 30 min. Use the 20× objective and select the field of view as described in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-prot-0002] (Video 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-fig-0002]).\nThis video cannot be streamed at this time, please download the video instead.[href=https://currentprotocols.onlinelibrary.wiley.com/cms/asset/87f676f6-8a76-4aca-9214-097a19585f1e/cpz1139-vid-0002.mp4]\nVideo\nSinusoids were labeled with fluorescent dextran (2 M; red) ahead of imaging. 2-NBDG (green) was injected while acquiring time-lapse IVM. Magnification: 20×; 512 × 512; frames were acquired every 2.5 s. Scale bar, 50 µm.\n6. Dissolve 2-NBDG (6.83 μg/g mouse) in 50% dextrose (1 g/kg body weight). Inject 50 μl 2-NBDG retro-orbitally with a 31-G insulin syringe while acquiring time-lapse IVM (Fig. 3A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-fig-0005]).\nKeep 2-NBDG stock solution on ice, protected from light, for up to 6 hr.",
    "Expect 2-NBDG signal to appear in sinusoids located in the PV area (Fig. 3A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-fig-0005]) within 10 s after injection and to be taken up by hepatocytes within 10-15 min.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/1417bec6-16a5-47d2-9075-ce29181b5e5b/cpz1139-fig-0003-m.jpg</p>\nFigure 3\nHepatic glucose uptake and retention quantified using intravital microscopy. Representative frames from time-lapse IVM in which sinusoids were labeled with 2 M dextran (red) and the fluorescent glucose analog 2-NBDG (green in overlay, or gray). Dashed circles around periportal hepatocytes indicate the portal vein (PV) regions; dashed rectangle around pericentral hepatocytes indicate the central vein (CV). White arrows denote the direction of blood flow. Time is shown as minutes:seconds. (B) Glucose uptake measured as mean gray value over time in PV, mid-lobular (M), and CV (three ROIs from one mouse). (C) Rate of glucose uptake in PV, M, and CV. (D) Glucose retention calculated as the ration between the mean gray values in hepatocytes over the mean gray values in the sinusoid. Errors bars, SEM.\nTime-lapse IVM.\nImage analysis\n7. Open the time-lapse LIF (.lif) file with ImageJ.\n8. Brighten and smooth the dextran signal. Click on Image > Adjust > Brightness/Contrast and enhance the dextran signal as needed, then click Process > Smooth.\n9. Identify PV and CV as described in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-prot-0002] using the 2-NBDG channel. Create three ROIs (regions of interest) of the same size on the PV-CV axis: PV, M (mid-lobular), and CV.\nPV regions can be identified by labeling with Alexa-conjugated E-cadherin antibody (Fig. 2C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-fig-0004]) or by time-lapse IVM, in which 2-NBDG signal appears first at the PV (Fig. 3A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-fig-0005]).\n10. Crop the three ROIs and save them separately.\n11. Split the channels\n12. Threshold the dextran channel (Image > Adjust > Threshold).",
    "13. Adjust the threshold bar so that only the dextran signal is included (shaded red). Select the thresholder regions (Edit > Selection > Create selection).\n14. Save the selections (File > Save as > Selection).\n15. Transfer the selection of sinusoids to the 2-NBDG channel by opening the saved selection (File > Open saved selection).\n16. Measure 2-NBDG in the sinusoid area (Image > Stacks > Plot z axis profile > Data > Copy all data).\n17. Paste the data points into an Excel spreadsheet. The first column (x) is time in seconds and the second column (y) is the mean gray value inside the sinusoid, at each time point.\n18. Measure 2-NBDG in the hepatocyte area (2-NBDG channel > Edit > Selection > Make inverse > Image > Stacks > Plot z axis profile > Data > Copy all data).\n19. Paste data points into the Excel spreadsheet. The first column (x) is time in seconds and the second column (y) is the mean gray value in the hepatocytes, at each time point (Fig. 4A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-fig-0006]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/a4f276ae-2bc7-43f6-88af-3ce148207ee3/cpz1139-fig-0004-m.jpg</p>\nFigure 4\nSample data from intravital hepatic glucose uptake assay. (A) 2-NBDG data from the hepatocyte area. (B) 2-NBDG uptake data. (C) Scatterplot with trend line. The three data points with mean gray values near the top right represent outliers that were deleted. (D) Data for sinusoid and hepatocyte mean gray values.\n20. Plot the mean gray intensity of the different parts of the hepatic lobule (Fig. 3B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-fig-0005]).\nCalculating the rate of 2-NBDG uptake\n21. Identify the time point in the hepatocytes column at which the signal dramatically increases; this is likely the time point where the 2-NBDG was injected. Copy the mean gray values from this column within the 2-min period after that time point. Paste these values into a separate column.",
    "22. Copy the time values for that same 2-min period and paste them into a column (Fig. 4B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-fig-0006]).\n23. Create a scatterplot. If the liver preparation was stable, the scatterplot should be linear.\n24. Add a trendline to the scatterplot. Select “Linear” in the Format Trendline box and check “Display equation on chart” and “Display R-squared value on chart.” If the points fit a linear equation well, the R2 value will be close to 1.\nMotion artifacts can result in outlier data points that can be removed. However, the removal of multiple data points will result in an inaccurate linear fit. Therefore, each time-lapse should be evaluated for stability and quality of data. An example is provided in Figure 4C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-fig-0006].\n25. Compare the slope (in the example above, slope = 0.3995) between zones and mice. A higher value reflects a higher rate of uptake (Fig. 3C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-fig-0005]).\nCalculating 2-NBDG retention in hepatocytes\n26. The rate of glucose retention can be calculated as the ratio of the mean gray value of 2-NBDG in hepatocytes to the mean gray value of 2-NBDG in the sinusoids:\n         \nratio >1: More 2-NBDG in hepatocytes than in sinusoids;\nratio <1: Less 2-NBDG in hepatocytes than in sinusoids;\nratio = 1: 2-NBDG signal in hepatocytes = 2-NBDG signal in sinusoids.\n27. Select time points from time-lapse IVM from which to calculate ratios. For example: 0 s (defined as the frame before 2-NBDG signal first appears) and 30 s, 2 min, 4 min, and 6 min post 2-NBDG injection.\n28. Copy and paste the mean gray values at the chosen time points, and paste them into a new spreadsheet.",
    "29. Subtract the background mean gray value prior to the appearance of the 2-NBDG signal, for both the sinusoid and hepatocyte selections. Next, divide the hepatocyte mean gray value by the sinusoid mean gray value (at each time point) to find the ratio (Figs. 3D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-fig-0005] and 4D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.139#cpz1139-fig-0006])."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}