{
  "id": 8972,
  "origin_website": "Jove",
  "title": "Non-invasive Assessment of Changes in Corticomotoneuronal Transmission in Humans",
  "procedures": [
    "This protocol was approved by the local ethics committee and the experiments are in accordance with the Declaration of Helsinki (1964).\n1. Subject Preparation\nNOTE: Subject instructions - Before starting with the experiment, instruct each subject about the purpose of the study and potential risk factors. For transcranial magnetic stimulation (TMS), medical risks include any history of epileptic seizure, mental implants in eyes and/or head, any diseases of the cardiovascular system, and pregnancy. Exclude all subjects affirming to one of these risk factors. Furthermore, in the experiment testing healthy individuals, exclude all subjects with neurological and/or orthopedic disease.\nSubject Placement\nPlace the subject in a chair that supports legs, trunk, and head in place. Ensure that the legs are outstretched so that the knees are extended and the peripheral nerve is closer to the skin making the nerve easier and more reliably excitable by electrical stimulation.\nMake sure that the subject's head is flexed, resting on a stable support surface such as a table and is secured with cushions. Ensure that the neck and the atlanto-occipital are flexed to allow stimulation of the corticospinal pathway.\nPosition the double cone magnetic coil so that its central portion is placed on or near the inion and the first derivative of the induced current is cranially directed 19,26. Use elastic straps at the head and the trunk to ensure that this position is maintained throughout the experiment.\nUsing surface electrodes measure the electrophysiological responses by Peripheral Nerve Stimulation (PNS) and TMS.\n\t\nPrepare the skin over the muscle belly of soleus by shaving, disinfection with propanol, and light abrasion.\n\t\t\nPlace self-adhesive EMG electrodes on the skin over the muscle belly of m. soleus. Place a reference electrode on the skin over the bone, e.g., on the patella or the medial malleolus.",
    "Connect all electrodes to an EMG-amplifier and finally an analogue-digital converter. Amplify EMG signals (×1000), bandpass-filter (10 - 1000 Hz) and sample at 4 kHz.\nPNS\nFor H-reflex conditioning, record H-reflexes in the soleus muscle by stimulating the posterior tibial nerve in the popliteal fossa.Apply stimulation with square-wave pulses lasting 1 ms. For stimulation, fixate an anode of 5 x 5 cm with tape on the anterior aspect of the knee just underneath the patella.\n\t\t\tNOTE: Stable H-reflex amplitude is a prerequisite for successful H-reflex conditioning and the least variability of all muscles can be found when recording from the soleus muscle.\nMove the cathode in the popliteal fossa until the best position for stimulation is found.\n\t\t\tNOTE: The best position refers to recording H-reflexes in the soleus muscle with minimum stimulation intensity, without a visible M-wave in the EMG recordings at these low stimulation intensities, and without receiving any response in the antagonist m. tibialis.\nAvoid responses in m. tibialis muscle as those may affect results by reciprocal inhibition from Ia afferents of n. peroneus communis to spinal motoneurons of the soleus muscle. After finding the optimal location, place a self-adhesive electrode on the skin and fix the electrode with tape to ensure consistent stimulation conditions.\nTMS\nStimulate the motor cortical area of the contralateral hemisphere with TMS using a figure eight coil to elicit motor evoked potentials (MEPs) in the electromyographic recordings of the soleus muscle.\nIn order to find the optimal stimulation spot, place the coil first over the vertex and 1 cm frontal. The handle of the coil should point backwards, evoking a posterior to anterior flux of the induced current in the center of the coil.",
    "Start stimulation with low intensities of around 20 - 30% of the maximal stimulator output so that subjects get accustomed to the magnetic stimulus. Choose the pause between successive stimuli to be 4 s.\nAfter a few trials, increase stimulation intensity to around 40 - 60% of the maximal stimulator output and move the coil in the frontal-rostral and medio-lateral direction in order to find the hotspot of m. soleus. The hotspot is defined as the position where MEPs in the m. soleus can be evoked with minimum stimulation intensity.\nAfter finding the soleus hotspot, determine the resting motor threshold (1.0 MT) as the minimum intensity required to evoke MEP peak-to-peak amplitudes in the EMG larger than 50 µV in six out of ten consecutive trials30. In subjects in whom the background EMG is already around 50 µV, use 100 µV as threshold.\nFixation of the Coil\nPlace the subject's head on a table (see \"Subject placement\") and use rigid foam to prevent head movements in all directions. Fixate the coil to a stand and the subject's head to the chair.\nFixate the coil with Velcro strips to the head and use an image-guided TMS navigational system for monitoring coil and head position throughout the experiment. Avoid even small movements of the coil relative to the subject's head as this changes the recruitment of neurons by TMS.\nMagnetic Stimulation at the Cervicomedullary Junction\nUse a double-cone magnetic coil placed at the cervicomedullary junction to excite axons of the corticospinal tract.\nPosition the coil so that the first derivative of the induced current is cranially directed and that its central portion is on or near the inion. Apply stimulation with maximum stimulator output (100%).",
    "NOTE: Even with this high stimulation intensity, the stimulus is too weak to sufficiently recruit spinal motoneurons and activate the muscles of the lower leg (i.e. m. soleus and m. tibialis anterior) in most subjects. Thus, with cervicomedullary stimulation, there is no compound potential in the surface EMG of lower leg muscles. Therefore, combine cervicomedullary simulation with the H-reflex (see \"3.1) to raise the excitability of the spinal motoneurons.\n2. Premeasurement\nAdjust the size of the H-reflex (peripheral nerve stimulation)\n\t\nFor H-reflex conditioning, adjust the size of the H-reflex to 20% of the maximum M-wave (Mmax) 31 by changing the stimulation intensity of the electrical stimulator. To obtain Mmax, record an H-reflex recruitment curve. For this purpose, apply stimuli with varying stimulation intensities. The pause between successive trials is 4 s.\nCalculate H-reflexes and M-waves as peak-to-peak amplitudes in the EMG (in mV) online in the recording software. Take care that the size of the control H-reflex stays constant at 20% of Mmax throughout the experiment and check its size in each trial. When detecting a systematic deviation of the H-reflex size (control H-reflex is always smaller or larger as the target size), adjust the stimulation intensity just prior to the consecutive trial.\nAdjust the stimulation intensity of TMS prior to the experiment.\n\t\nFor H-reflex conditioning at rest, set the stimulation intensity for TMS over the motor cortex to 90 - 100% of MT.Ensure that no MEP is seen in trials without PNS.\n\t\tNOTE: The simulation intensity should be close to 100% of MT in order to ensure large effects on the conditioned H-reflex at rest so that the early facilitation can easily be detected.\nAdjust cervicomedullary stimulation intensity prior to the experiment. Unlike cortical stimulation, always adjust stimulation intensity for cervicomedullary stimulation to 100% of the maximum stimulator output.",
    "Condition the H-reflex with magnetic stimulation over the motor cortex.\n\t\nApply TMS and PNS by varying the timing between the two stimuli (H-reflex conditioning) to allow assessment of changes in corticomotoneuronal transmission. To detect the early facilitation, start the conditioning protocol with an interstimulus interval (ISI) of -5 ms and alter ISIs in steps of milliseconds, from -5 - +1 ms (Figure 1B).\n\t\tNOTE: Negative ISIs indicate that PNS is elicited before TMS, positive ISIs indicate the opposite.\nVary the ISI between TMS and PNS randomly from stimulation trial to stimulation trial so that no bias due to a certain order of stimuli may arise.\n\t\tNOTE: The \"early facilitation\" should occur around ISIs -4 ms to -2 ms when applying TMS over the motor cortex. This means that the fastest (monosynaptic corticospinal pathways) collide with the afferent volley by PNS at the spinal motoneurons at this time (see 5.2 for detecting the early facilitation).\nSet the pause between successive stimulation trials to 4 seconds.\nCondition the H-reflex with magnetic stimulation over the cervicomedullary junction.\n\tNOTE: Using cervicomedullary stimulation for conditioning, excitation of the corticospinal pathways is spatially closer to the spinal motoneurons than with stimulation of the motor cortex. Therefore, the ISI corresponding to the early facilitation is shifted by approximately 3 - 4 ms. As an example, the early facilitation with TMS over the primary motor cortex at -4 ms would correspond to an ISI between -7 - -8 ms with cervicomedullary stimulation.",
    "Use ISIs between ISI -9 - -3 ms in steps of 1 ms for cervicomedullary conditioning. Apply ISIs for TMS over the motor cortex and TMS over the cervicomedullary junction always together in one trial and record a control H-reflex and a control MEP in this trial, too. Use the control H-reflex as a reference for the conditioned H-reflexes and the control MEP to ensure comparable stimulation conditions. Record (at least) ten trials in the pre-measurement.\nAlternating Stimulation over the Motor Cortex and Cervicomedullary Junction\nApply conditioning of the SOL H-reflex by magnetic stimulation of the motor cortex (M1-conditioning; see 2.1) and by magnetic cervicomedullary stimulation (CMS-conditioning; see 2.2) in a random order during the same trial.\n\t\tNOTE: It is recommended to alternately apply M1- and CMS-conditioning in one and the same trial in order to refer the conditioned H-reflexes to the same sample of control H-reflexes (see Figure 1).\n3. Intervention - Slow Repetitive TMS\nSet the stimulation intensity to 1.2 MT, which induces a long-lasting 32,33 suppression of corticospinal excitability required as H-reflex conditioning takes several minutes to accomplish. During the rTMS intervention, apply TMS over the primary motor cortex at 1 Hz for 20 min.\n4. Postmeasurement\nDirectly after the intervention, apply H-reflex conditioning with the same ISIs as used in the premeasurement.\nUse the same stimulation intensities for magnetic stimulation over M1 and the cervicomedullary junction than in the pre-measurement.\nEnsure that the control H-reflex has the same size as in the pre-measurement. If a systematic deviation is detected, adjust the stimulation intensity.\n5. Data Processing\nCalculate all physiological responses such as H-reflexes, MEPs, and conditioned H-reflexes as peak-to-peak amplitudes of the unrectified EMG.",
    "For each ISI, average ten conditioned H-reflexes for a) cortical and b) cervicomedullary stimulation. Additionally, average ten control (i.e. unconditioned) H-reflexes that serve as a reference (i.e. 100%) for the conditioned H-reflexes.\nConsequently, express the mean amplitude of the conditioned H-reflexes for each ISI as a percentage of the mean amplitude of the control H-reflex in both the pre- and post-measurement. Take care when determining the early facilitation as this is of critical significance:\n\t\tNOTE: As there is inter-individual variability in the occurrence of the onset of the early facilitation, determine the early facilitation in the premeasurement for each subject separately.\nUse nonparametric Wilcoxon tests to determine the first rise of the conditioned H-reflex. For CMS-conditioning, start the tests at ISI -9 ms, for M1-conditioning search the early facilitation beginning at ISI -5 ms. Compare the amplitude of this early facilitation obtained in the pre-measurement with the amplitude of the early facilitation obtained in the post-measurement using the same ISI.\nAdditionally, verify the early facilitation by visual inspection.\n\tNOTE: After M1-conditioning, the early facilitation is most likely to occur around ISI -3 ms. Shortly after the first rise in the conditioned H-reflex, i.e. 1 to 2 ms later, there is a decline in the conditioned H-reflex before it rises again. After CMS-conditioning, the early facilitation is likely to occur around ISI -7 ms, thus, around 4 ms earlier than after M1-conditioning.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}