{
  "id": 7492,
  "origin_website": "Bio",
  "title": "Flow Cytometry Analysis of Planarian Stem Cells Using DNA and Mitochondrial Dyes ",
  "procedures": [
    "Preparation of cell suspensionSeparate the required number of worms that have been starved for at least 7 days and wash with fresh 1× Montjuïc salts.Note: This protocol is optimized with the planarian species, Schmidtea mediterranea, and both sexual and asexual biotypes can be used. The number of worms required depends on the number of cells required for the downstream applications. In our experience, 35 worms of ~0.7 cm size will yield ~100,000 to 150,000 X1 cells. Transfer the worms to the cap of a 60 mm or 35 mm culture dish. Remove the 1× Montjuïc salts completely.Immediately add ~100 μL of CMFB to the planarians (Figure 1A).Note: The volume of CMFB is approximate, as it should be enough to cover all the planarians. The volume could be scaled up or down based upon the specific requirement. Using a scalpel, slice the worms into pieces as small as possible (Figure 1B). Intermittently wipe the scalpel with tissue paper, to remove the mucous. Ensure that no large fragments remain.Once the tissues are diced into small fragments, add 1 mL of CMFB.Make a wide bore 1 mL pipette tip by cutting its end using a sterile scalpel (Figure 1C). Using this wide-bore pipette, transfer the tissue fragments to a fresh 50 mL centrifuge tube.Note: The tissue fragments may stick to the surface. If so, flush the tissue with excess CMFB and transfer it to the centrifuge tube. In our lab, we take the tissue fragments in ~5 mL of CMFB. Mechanically dissociate the cells using a 1 mL pipette by gently pipetting multiple times. After ~20-30 times of pipetting, let the centrifuge tube sit for ~2-3 min. The undissociated tissue fragments will settle down. Transfer the supernatant containing cells to a fresh 50 mL tube without disturbing the settled tissue fragments.",
    "Leave some supernatant, so that the undissociated fragments don’t come along with the supernatant (Figure 1D).Add another 3-4 mL of CMFB solution to the undissociated fragments and dissociate again by gently pipetting.Repeat Steps A7 and A8 till all the tissue fragments are completely dissociated.Note: Steps A7 and A8 are to reduce cell death as much as possible, since pipetting of already dissociated cells is unnecessary and may induce cell death. Collect all the cell suspensions and strain through a 40 μm strainer into a fresh 50 mL centrifuge tube.Centrifuge the strained cell suspension at 290 × g at 4°C for 10 min in a swinging bucket rotor. A dark cell pellet is observed at this stage (Figure 1E).Discard the supernatant and resuspend the cell pellet in IPM + 10% FBS media. The volume of media depends on the number and size of the worms used. For ~40 worms of ~0.7 cm, 10 mL of media could be used.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4299/bioprotoc-12-02-4299-g001.jpgFigure 1. Preparation of cell suspensions. A. Planarians are taken in the cap of a 35 mm culture dish and ~100 μL of CMFB is added. B. Representative image of diced planarian fragments. C. Representative image of the 1 mL pipette with the tips cut (right) compared to a normal pipette (left). D. After mechanical disruption by pipetting the cell suspension ~20-30 times, the solution is allowed to settle down (left centrifuge tube) and the supernatant is transferred to a fresh centrifuge tube (right) and fresh CMFB is added to the undissociated fragments. See Steps A7-A9 for details. E. Cell pellet after cell straining and centrifugation.Staining of the cell suspensionsAdd 40 μg/mL Hoechst 33342 to the cell suspension and incubate at room temperature in the dark for 40 min. Mix the solution intermittently at an interval of ~10 min.",
    "After 40 min, add 100 nM MTG to the same cell suspension and incubate for another 20 min at room temperature in the dark.Post incubation with MTG, centrifuge the cell suspension at 290 × g for 10 min at 4°C in a swinging bucket rotor. Discard the supernatant and resuspend the cell pellet in IPM + 10% FBS media.The final volume could be adjusted based on the efficiency of the sorting machine. In our laboratory, for ~40 worms of ~0.7 cm, we use 3 mL of IPM + 10% FBS media.Finally, add 1 µg/mL of propidium iodide to the cell suspension to discriminate live/dead cells.For FACS sorting of cells for transplantation or in vitro culture experiments, SiR-DNA (1 μM) should be used instead of Hoechst 33342 at Step B1. At Step B4, for live/dead cell discrimination, use 10 μg/mL of DAPI instead of propidium iodide. The rest of the staining protocol remains the same.FACS gating for X1 and X2 MTG populationsFor sorting, use a 100 μm tip at 20 psi sheath pressure. Use the proprietary BD Sheath fluid.Note: Before every sorting session, we routinely calibrate the instrument by setting up the appropriate laser delay with the SpheroTM Rainbow fluorescent particles and the drop delay with the BD FACS Accudrop beads. This step should be done according to the instrument used and the information is generally available with the instrument manual. Run the Hoechst 33342 and MTG stained cells in the FACS machine. Adjust the forward scatter (FSC) and side scatter (SSC) voltage and make a gate (P1) to exclude debris and dead cells.Next, gate the singlets using an FSC A (area) vs FSC W (width) dot plot (P2).Within this singlet population, select the live cells indicated as propidium iodide negative events (P3).",
    "Set the gates for X1, X2, and Xins population as represented in Figure 2 and Mohamed Haroon et al. (2021).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4299/bioprotoc-12-02-4299-g002.jpgFigure 2. Representative FACS gating for X1, X2, and Xins populations. See Steps C2-C5 for details. FSC- forward scatter, SSC- side scatter, FSC-W width, FSC-A area. The blue (Hoechst Blue) emission of Hoechst 33342 can be collected using a 450/20 bandpass filter and for the red emission (Hoechst red), use 630/40 bandpass filter.To obtain a population with enriched pluripotent cells, gate MTG Low cells within X1. Similarly to enrich the lineage primed population gate corresponding to MTG High within the X1 cells (Figure 3A).The X2 gate could also be separated into MTG Low and MTG High cells. To enrich the 2N stem cells within X2, make four gates based on MTG and FSC parameters (Figure 3B).Note: C6-C7: With the current understanding, it is impossible to mark the exact fluorescent intensity or percentage of MTG Low cells that exactly represent stem cells while excluding the differentiating progenies in both X1 and X2 populations. Hence, for consistency, the population can be divided into equal percentages of MTG Low and MTG High. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4299/bioprotoc-12-02-4299-g003.jpgFigure 3. Gating strategy for MitoTracker Green (MTG) populations within (A) X1 and (B) X2 cells. For consistency, an equal percentage of MTG Low and High populations should be gated. HFSC-High FSC, LFSC- Low FSC.FACS gating for SiR-DNA 2N and 4N MTG populationsRun SiR-DNA stained cells and set gates P1 and P2 as described above, to eliminate debris and doublets. Next, gate DAPI negative cells (P3) to obtain the live cells.Within the live cells, gate SiR-DNA 2N (P4) and 4N (P5) populations (Figure 4).Note: Unlike Hoechst staining, SiR-DNA staining does not separate 2N and 4N cells well in a FACS plot.",
    "Hence, to ensure accurate gating, use the reference plots in Figure 4 and other Sir-DNA plots (Lei et al., 2019). Alternatively, one could use 6000 rads irradiated animals (>2 days post irradiated animals) as a control that is devoid of proliferating stem cells (Wagner et al., 2011).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4299/bioprotoc-12-02-4299-g004.jpgFigure 4. Representative FACS gating for 2N (P4-gate) and 4N (P5-gate) cells using SiR-DNA nuclear dye. See Steps D1-D2 for details.To obtain the population that is X1 equivalent, first determine X1(fs) gate by back-gating X1 cells in an FSC vs SSC plot (Figure 5) (Wagner et al., 2011). Within the X1(fs) population, gate the SiR-DNA 4N population as determined in the earlier Step D2 (Figure 5).Similarly, determine X2(fs) gate by back-gating X2 cells in FSC vs SSC plot, and gate the SiR-DNA 2N population within the X2(fs) gate (Figure 5).Set gates for MTG Low and High, as well as FSC low and high within 4N and 2N gates, similarly to the Hoechst stained cells as explained in Steps C7-C8.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4299/bioprotoc-12-02-4299-g005.jpgFigure 5. Representative FACS graph for sorting 2N and 4N SiR-DNA population within X2(fs) and X1(fs) gates. This gating is performed to reduce cross-contamination of X1 cells and X2 cells, as the SiR-DNA dye could not resolve the cell cycle stages well, unlike Hoechst.FACS sortingSort the cells in 5 mL FACS tubes containing 2 mL of IPM + 10% FBS media. Keep the collection chamber at 4°C using the appropriate adaptor.Note: We routinely perform the sorting using the ‘purity’ mode described in BD FACS Aria III and BD FACS Aria Fusion sorters. Such sort precision modes are instrument specific, and the users should refer to the instrument manual for the appropriate settings. The users can run the sorted samples in the FACS machine to ensure the purity of the sort.",
    "In addition, fluorescent in situ hybridization or immunostaining for neoblast markers, such as piwi-1, can be performed to check the purity of the sorted samples. Centrifuge the sorted cells at 300 × g for 10 min at 4°C using a swinging bucket rotor. Discard the supernatant and resuspend the cells in an appropriate volume based on the downstream applications.Note: The cell pellet after sorting ~100,000 to 150,000 cells will be very small and may not be readily visible."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}