{
  "id": 6942,
  "origin_website": "Bio",
  "title": "Determination of the Cellular Ion Concentration in <em>Saccharomyces cerevisiae</em> Using ICP-AES",
  "procedures": [
    "Sample preparationStreak the S. cerevisiae strains to be analyzed on YD plates (Recipe 1). Incubate for two days at 28 °C.Using a sterile toothpick, select individual colonies.Re-suspend cells in 100 ml YD medium (in 500 ml Erlenmeyer) (Recipe 2) and grow them at 28 °C under agitation (120 rpm) to an OD600 of 3 (OD600 = 1 corresponds to a density of 1.25 x 107 cells/ml). Note: Wash the 500 ml Erlenmeyer with 10% HCl before yeast growth to avoid any impact of the detergents used for washing the glassware on the ionic content measurement. Rinse them with Milli Q water and allow them to dry. Filter the 100 ml culture using glass microfiber filters on the filter holding manifold at 4 °C.Wash cells twice on the filter with 2 ml EGTA 1 mM (Recipe 3) at 4 °C.Wash cells twice with 2 ml Milli Q water at 4 °C.Immerge each filter in a heat-resistant porcelain crucible containing 10 ml Milli Q water for 10 min. Remove the filter from the crucible. Note: Before introducing any sample in the porcelain crucibles, weigh them when empty for further determination of the mass of dry matter.  Place the porcelain crucibles in an oven at 95 °C overnight to dry the sample. Figure 1 summarizes the protocol Steps A4 to A8.Place the porcelain crucibles in a desiccator for 8 h for further drying.Weigh the porcelain crucibles for further determination of the mass of dry matter.Note: Steps A4 to A8 can be carried out with 100 ml YD medium (without cells). This sample will be used as a blank for further measurement.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200818/20200818181155_1268.jpg Figure 1. Experimental Steps A4 to A8. The 100 ml yeast culture is first filtered. Then, cells on the filter are washed with EGTA 1 mM (twice) and Milli Q water (twice).",
    "The filter with washed cells is subsequently immerged in a porcelain crucible containing 10 ml Milli Q water. Finally, the filter is removed and the porcelain crucible is placed in an oven for further drying.Measurement of the ionic contentPlace the samples in the muffle furnace at 500 °C for 4 h.Resuspend the ashes in 6.5% nitric acid (0.5 ml nitric acid 65% + 9.5 ml Milli Q H2O).Dilute the ICP standards from Merck in a range of concentration that covers the expected ionic concentration in the samples to be analyzed. Acidify the standard solutions to 0.5% nitric acid (from 65% nitric acid). The standard concentrations used for measurement of yeast ionic content in our study are mentioned in Table 1.Measure the emitted light for each standard and sample. Typical instrument parameters are given in Table 2. Table 3 gathers the wavelengths and the viewing mode used for measurement of each cation.Deduce the ionic content in the samples using the calibration curve established from the standards (see Data analysis).Table 1. Concentrations of the standards (St) used for the calibration lineimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200818/20200818181230_6449.jpgTable 2. Typical instrument parameters used on the Thermo Scientific ICAP 6500 ICP OESimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200818/20200818181319_1775.jpgTable 3. Wavelengths and viewing mode used for the twelve elementsimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200818/20200818181409_7794.jpg"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}