{
  "id": 8738,
  "origin_website": "Jove",
  "title": "Methods for the Discovery of Novel Compounds Modulating a Gamma-Aminobutyric Acid Receptor Type A Neurotransmission",
  "procedures": [
    "Xenopus laevis are housed and handled according to the Geneva Canton Animal Guidelines.\n1. Radioligand Binding\nPreparation of the assay plate\nPrepare 1.5 L of assay buffer with 5 mM KCl, 1.25 mM CaCl2, 1.25 mM MgCl2, 120 mM NaCl, and 15 mM Tris; adjust the pH with HCl to 7.4.\nPrepare the compounds to be tested at 50.76 µM (e.g., a 5 µL compound at 10 mM into a 980 µL assay buffer in a microcentrifuge tube). Mix them well using a vortex machine at high speed for 2–5 s.\nPrepare a pre-dilution of the reference compound flumazenil by pipetting 1 µL of the compound (10 mM) to 1,970 µL of assay buffer. Mix them well using a vortex machine at high speed for 2–5 s.\nDilute a [3H]flumazenil stock solution with the assay buffer at 4 °C to 4 nM in a 50 mL polypropylene tube.\nPipette 50 µL/well of assay buffer into columns 1 and 3–11 of a 96-well microplate as shown in the plate layout represented in Figure 2.\nPipette 73.2 µL of the compounds diluted at 50.76 µM (see step 1.1.2) into column 12 of the plate.\nDilute each compound, using a geometrical progression over 9 steps (1E-10 – 1E-06 M), with a 23.12 µL transfer volume and fill columns 3–11. Mix the dilution thoroughly. Change the tip after every dilution.\nDilute the cell membranes\nThaw the cell membranes previously isolated from an HEK293 overexpressing human GABAA receptor (0.025–0.15 mg/mL) to obtain 80 mL at room temperature (RT) and transfer the suspension to the assay buffer at 4 °C.\nResuspend the membrane solution still at 4 °C with a tissue homogenizer for 30–40 s at 10,000–12,000 rpm.\nDilute diazepam for the non-specific binding (NSB) control",
    "Dilute a 4 mM diazepam stock solution with the assay buffer to a concentration of 40 µM in 5 mL.\nStart the reaction\nPipette 50 µL of 4 nM [3H]flumazenil into each well of the 96-well plate and keep it in an ice water container.\nAdd 100 µL of the GABAA receptor subtype membranes preparation to have a protein concentration of 0.5mg/mL.\nPipette 50 µL of 40 µM diazepam into column 2.\nIncubate the plate for 1 h on ice.\nAdd 50 µL of assay buffer in each well of a 96-well filter plate for the subsequent membrane separation and radioactivity measurement and stop the reaction afterward.\nStop the reaction\nPrepare a washing buffer with 50 mM Tris-HCl, pH 7.4.\nFilter the solution using a 96-well cell harvester. Wash the plate 3x with 300 µL of ice-cold washing buffer per well.\nSeal the bottom of the plate with a plastic film and add 40 µL of scintillation cocktail for liquid scintillation counting in each well and wipe it with ethanol 70%.\nGently shake the plate for at least 1 h at RT. Let it stand for at least another hour at RT.\nMeasure the radioactivity (in CPM) by placing the plate on a scintillation counter. Allow a measuring for 3 min per well.\nData analysis\nDetermine the mean for the 8 replicates of non-specific binding (NSB) and the total binding (TB) as well as for the duplicates or triplicates of the samples. Calculate the % specific binding (SB) for the mean of each sample according to the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/57842/57842eq1.jpg\n\t\tHere,\ntotal SB = the mean TB minus the mean NSB.\nPlot in abscissa the % SB versus in ordinate the inhibitor concentrations. Fit the data using the single site competition analysis equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/57842/57842eq2.jpg\n\t\tHere,",
    "y = the % of SB,\nA = the minimum of y,\nB = the maximum of y,\nC = the IC50,\nX = the log10 of the concentration of the competing compound,\nD = the slope of the curve (a Hill coefficient).\nCalculate the binding affinity (Ki) using the half maximal inhibitory concentration (IC50), the dissociation constant (Kd) of [3H]flumazenil on the respective membranes9, and the concentration of [3H]flumazenil in the assay according to the following data-using equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/57842/57842eq3.jpg\n2. Receptor Expression and Recordings in Xenopus Oocytes\nOvaries harvesting and oocyte preparation\nPrepare the sterile Barth solution with 88 mM NaCl, 1 mM KCl, 2.4 mM NaHCO3, 10 mM HEPES, 0.82 mM MgSO4.7H2O, 0.33 mM Ca(NO3)2.4H2O, and 0.41 mM CaCl2.6H2O, at pH 7.4, supplemented with 100 unit/mL of penicillin, 100 µg/mL streptomycin and 0.25 µg/mL of amphotericin B.\nPrepare the 1x OR2 medium (no CaCl2) with 88.5 mM NaCl, 2.5 mM KCl, 5 mM HEPES, 1 mM MgCl2.6H2O, at pH 7.4.\nSacrifice a Xenopus Laevis female by deep anesthesia for 20 min in cooled Tricaine methanesulfonate (at a concentration of 150 mg/L, adjusted at pH 7.4) and sodium bicarbonate (300 mg/L) followed by decapitation.\nHarvest the ovaries rapidly with clean scissors and forceps and place them in 2 Petri-dishes (10 cm) filled with 40 mL of 1x Barth solution and antibiotics/antimycotic.\nStore the non-dissociated ovaries for up to 2 weeks in Barth solution at 4 °C.",
    "For the dissociation, cut the ovaries with a clean razor blade in small fractions (1–2 cm3) and incubate them in 50 mL of OR2 medium without CaCl2 (OR2-noCaCl2) containing 0.2% collagenase (Type I) at 17–19 °C in a 100 mL spinner flask with a slow agitation for 4–5 h. Verify that the magnetic bar is placed approximately 3–5 cm above the bottom of the spinner flask to avoid crushing the oocytes.\nAfter 4–5 h, verify that most of the oocytes are freed from their follicle (i.e., they swim around individually). Wash them 5x with 200 mL of OR2 supplemented with 1.8 mM CaCl2.\nTransfer the defolliculated oocytes to Petri-dishes (10 cm) filled with Barth solution and antibiotics/antimycotics and keep them at least overnight at 17 °C before the cDNA or mRNA injection.\nOn the next day, select, under a binocular, a healthy oocyte presenting a clear and distinct animal versus a vegetal pole (dark brown for the animal pole versus light yellow for the vegetal pole). Use clean Pasteur pipettes and dispose the oocytes one by one into a sterile conical 96-injection well plate.\n\t\tNOTE: No special care is needed in the placement of the oocytes for the mRNA injections; whereas, for the cDNA injections, it is indispensable to orient the oocytes with the animal pole facing upward.\nmRNA or cDNA automatic injection\nSynthesize the mRNAs using a commercially available kit following the recommended instructions. Clean the instruments and the table with RNase and wear the appropriate protecting gloves.\n\t\tNOTE: The quality of the mRNA is determinant to yield a good expression, and it is indispensable to prevent mRNA degradation during the injection procedure.\nPrepare cDNAs using a commercially available kit and dissolve the desired amount in bidistilled water at a concentration of 0.2 µg/µL.",
    "Inject 10–50 nL of mRNA solution at a concentration of 0.2 µg/µL, or 10 nL of cDNA solution at a concentration ranging from 0.02–0.2 µg/µL, preferably in batches of 95 oocytes.\nFor membrane proteins requiring multiple subunits (i.e., heteromeric α1β2γ2 GABAA receptors), mix the corresponding mRNAs or cDNAs in the desired ratio (i.e., 1:1:1 or 1:10:1).\nKeep the oocyte at 17 °C to prevent the expression of heat shock proteins by the oocytes; store the microplate in a thermo-controlled storage area.\nDissolve the test compounds which were tested positive in the binding assay in OR2 at 0.1–1,000 µM for electrophysiological recordings and dispose them off in a 96-well flat bottom polypropylene plate.\nPlasmids for expression\nFollow the instruction manuals of commercially available kits for the mRNA synthesis with bacterial T7 or T6 promotors and make 20 µL of a solution at 0.2 µg/µL in RNase-free water.\nPrepare at least 20 µL of a solution containing a eukaryote expression vector for the cDNA expression, typically at 0.2 µg/µL dissolved in bidistilled water.\nMicroinjection in the Oocyte and Visualization of its Quality\nInject 10–50 nL of the solution containing plasmid (see step 2.3.1 or 2.3.2) using a glass micro-injection needle with a tip diameter ranging up to 100 µm mounted on a micromanipulator equipped with a pressure ejection system or with an automated injection system.\n\t\tNOTE: In the example discussed here, oocytes are injected by batches of 95 with an automated system suitable for use with cDNA or mRNA.\nFill the injection needle with 1 µL of a dye such as methylene blue at 1% and inject the oocytes using the standard procedure (either in the nucleus for cDNA or in the cytoplasm for mRNA).",
    "Dispose the injected oocytes for about 1 min in boiling water. Cut the oocytes in half with a razor blade under a binocular.\n\t\tNOTE: The dye remains localized as shown in Figure 3E, allowing a precise observation of the injection.\nTwo-electrode voltage clamp recordings\nPlace the well plate containing the oocytes on the automated system, which uses the principle illustrated in Figure 4.\n\t\tNOTE: In contrast to the patch clamp system illustrated in Figure 5, the true membrane potential of the cell is read by the voltage electrode.\nProgram the automated recording system using the icon-based interface with, for example, the scheme illustrated in Figure 6 for the determination of the concentration activity relationship.\nCurve fitting\nAnalyze the results using the appropriate software, using the illustrated concentration activation curve, plot the current amplitude as a function of the logarithm of the agonist concentration.\nObserve the sigmoidal curve that can be subsequently fitted with the empirical Hill equation in the form:\nimgsrc://cloudfront.jove.com/files/ftp_upload/57842/57842eq4.jpg\n\t\tHere,\nY= the fraction of evoked current,\nEC50 = the concentration for a 50% activation,\nx = the concentration of the compound,\nnH = the Hill coefficient or apparent cooperativity.\nNormalize the currents to a unity by dividing the amplitude of each response versus the value recorded at the highest concentration to analyze the data obtained from a series of cells.\nDetermine the average and standard errors and realize the curve fitting using standardly available software.\n3. Electrophysiological Recordings in Brain Slices\nNOTE: Hippocampal rat slices are prepared in accordance with the national and institutional guidelines.\nPreparation of hippocampus slices",
    "Prepare the dissection artificial cerebro-spinal fluid (dACSF) with 124 mM NaCl 124, 2.5 mM KCl, 1.25 mM KH2PO4, 2 mM MgSO4.7H2O, 2.5 mM CaCl2 2H2O, 26 mM NaHCO3, 10 mM glucose, and 4 mM saccharose gassed in the bottle with a mixture of 95% O2 and 5% CO2.\nPrepare the recording artificial cerebro-spinal fluid (rACSF) with 124 mM NaCl, 5 mM KCl, 1.25 mM KH2PO4, 2 mM MgSO4.7H2O, 2.5 mM CaCl2 2H2O, 25 mM NaHCO3, and 10 mM glucose gassed in the bottle with a mixture of 95% O2 and 5% CO2.\nAnesthetize the rats using a mixture of 2.5% isoflurane and pure oxygen and decapitate them.\nCut the scalp following the midline with a fine pair of scissors. Cut the skull along the midline without damaging the underlying tissue. Remove the skull with tweezers and use a fine spatula to scoop out the brain.\nPlace the brain in the gassed dACSF solution at RT and dissect the left hippocampal formation with a fine spatula.\nCut transverse slices (400 µm thick) from the medium part of the hippocampus with a tissue chopper and transfer them to the recording chamber with the use of a painting brush. Maintain the slices at RT for 45 min.\nPerfuse the slices with the gassed rACSF at 35 °C and at a rate of 1.5 mL/min. Bubble the solution with a mixture of 95% O2 and 5% CO2.\n\t\tNOTE: After this step, the slices are ready for the electrophysiological experiments.\nSingle population spike recording\nPlace a brain slice into the microscope-mounted chamber.\nPerfuse the slice at a rate of 3 mL/min with rACSF.\nPull a borosilicate glass micropipette with the pipette puller having a resistance of ~2 MΩ.\n\t\tNOTE: This micropipette is used as a recording electrode and is electrically connected to the amplifier.",
    "Fill the micropipette with a solution containing 2 M NaCl and place it into the pipette holder of the amplifier.\nPosition the recording micropipette in the stratum pyramidale in the CA1 region of the hippocampal slice using the right micromanipulator.\n\t\tNOTE: The location is schematically represented in Figure 7.\nPlace an insulated bipolar platinum/iridium electrode into the holder on the left micromanipulator.\n\t\tNOTE: This electrode is used as the stimulation electrode and is electrically connected to the stimulus generator.\nPosition the stimulation electrode in the Schaffer collaterals in the CA1 region of the hippocampal slice using the right micromanipulator.\n\t\tNOTE: The location is schematically represented in Figure 7.\nDeliver a current pulse to the stimulation electrode using the stimulus generator every 30 s (100 µs durations, starting at 10 µA) and gradually increase the stimulation strength until a population spike (PS) appears.\nAdjust the stimulus strength to evoke a PS corresponding to 45% of the maximum amplitude that can be obtained. PSs are filtered at 2.4 KHz and digitized at 20 KHz using the signal amplifier.\nPaired-pulse inhibition\nPrepare the brain slices (step 3.1) and proceed as described previously (steps 3.2.1–3.2.7).\nDeliver two current pulses (100 µs durations at a 20 ms interval) to the stimulation electrode every 30 s using the stimulus generator. Set the stimulus strength to evoke a PS corresponding to 45% of the maximum amplitude.\nCompound testing\nMake dilutions of the compounds to be tested in gassed ACSF so that the final concentration of DMSO not higher than 0.1%.\nAdd DMSO to the control solution at the same concentration than that in the compound solution.",
    "Record a single (step 3.2) or a paired-pulse (step 3.3) PS evoked by Schaffer collateral stimulations every 30 s for at least 30 min. The PS shape should be stable during this baseline period.\nPrepare a beaker with gassed rACSF containing a fixed concentration of the compound to be tested.\nPerfuse the hippocampal slice with this solution while still recording the single or paired-pulse PS.\nEvaluate the recovery from the compound effect by perfusing the slice with gassed rACSF without the compound.\n\t\tNOTE: For reversible effects, the PS reverts to its initial shape observed during the baseline period before the compound application.\nData analysis\nAverage the PS traces recorded during the experiment in blocks of 4 using the data analysis software.\nMeasure the PS amplitudes of the averaged traces.\nNormalize the amplitudes as a percentage of the baseline values recorded 10 min before perfusing a compound.\nExpress the data as mean ± SEM."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}