{
  "id": 1672,
  "origin_website": "Cell",
  "title": "Protocol for the assessment of mTOR activity in mouse primary hepatocytes",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDay 1: Isolation of primary mouse hepatocytes by liver perfusion\nTiming: 45 min (per mouse)\nThis major step allows to obtain digested livers from mice. Following anesthesia, two surgical knots are performed in the abdominal and the thoracic cavities of the mouse; the heart is cannulated through the left atrium and the liver is perfused and digested in situ.\nPreheating: Warm the Perfusion Solution and the Digestion Solution in the water bath at 37°C. The water bath should be inside a laminar flow hood to assure sterile conditions of the solutions. Keep both solutions inside the bath during the whole isolation procedure.\nCritical: Collagenase must be added to the Digestion Solution immediately before the start of the isolation procedure. It must be completely dissolved and warmed before dissection to obtain the best digestion efficiency. We recommend to add the Collagenase before anesthetizing the mouse See troubleshooting 1[href=https://www.wicell.org#troubleshooting].\nAnesthesia: Anesthetize the mouse according to your institution’s approved animal protocol; for example, through intraperitoneal injection of Ketamine/Xylazine (100 μL/ 10 g animal weight). Mice lose consciousness within 15 min after the injection.\nNote: Pre-warm the anesthesia before injecting the mouse to avoid thermal shock.\nNote: Confirm that the mouse is completely anesthetized before continuing with the step 3. Loss of the righting and palpebral reflexes, relaxation in the muscular tone, disappearance of pedal reflex and a decrease in the rate and depth of respiration are common readouts of successful anesthesia. If the mouse still maintains reflex 15 min after the injection, we recommend to additionally inject 50 μL of Ketamine/Xylazine.",
    "Preparation of the perfusion pump: Extensively wash the perfusion line with Rinsing Solution to eliminate 70% ethanol. Place one end of the perfusion line inside the Perfusion Solution located inside the water bath. Fill the perfusion line with Perfusion Solution before opening the mouse peritoneal cavity. Connect the outlet end of the perfusion line to the catheter (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1133-Fig1.jpg\nFigure 1. Isolation of primary mouse hepatocytes by liver perfusion\n(A) Working area for isolation of primary hepatocytes from mouse. Most relevant materials are indicated.\n(B) Cartoon showing the direction of the non-recirculating circuit from aorta artery to portal vein.\nCritical: Bubbles in the pumping tube can compromise digestion efficiency and viability of the isolated hepatocytes. See troubleshooting 2[href=https://www.wicell.org#troubleshooting] for instructions on how to avoid the presence of bubbles.\nPositioning: Immobilize the anesthetized mouse by using needles to attach the upper and lower limbs on a dissecting board. Spray the mouse with 70% ethanol to ease dissection (Methods video S1[href=https://www.wicell.org#mmc1] – part 1).\nNote: If primary hepatocytes from more than one mouse are going to be isolated on a day, anesthetize the second mouse at this step. The 15 min of anesthesia of the second mouse will fit with the 15 minutes of dissection, surgery, cannulation, perfusion, digestion and collection of the liver from the first mouse.\nDissection: Using surgical scissors and forceps, open the abdominal cavity and carefully lean the small intestine to expose inferior vena cava and portal vein. With a syringe, add approximately 2 mL of Rising Solution into the abdominal cavity of the mouse to prevent contaminations (Methods video S1[href=https://www.wicell.org#mmc1] – part 2).\nNote: All the surgical material must be sterilized with 70% ethanol or by dry heating before use.",
    "Surgery: For stable liver perfusion, perform two surgical knots in the abdominal and the thoracic cavities (Methods video S1[href=https://www.wicell.org#mmc1] – part 3):\nAbdominal knot: Take the needle and thread (Sterile surgical non-absorbable sutures) and pass the needle under the inferior cava vein and the left kidney (located at researcher’s right side). Pass the needle above the kidney located at your left and tie a loose knot.\nThoracic knot: Open the thoracic cavity vertically cutting the ribs on both sides. Heart must not be damaged, so slow and gentle scissor movements are needed. Remove the ribs to facilitate posterior cannulation. Pass the needle under the visible aorta artery above the liver and tie a loose knot.\nNote: Ensure the thoracic knot is over the end of the catheter. Otherwise, the circuit would be blocked.\nCannulation: Make an incision in the left atrium of the heart and cannulate.\nSwitch on the pump to begin a very slow perfusion (1 mL/min) of the mouse liver with Perfusion Solution. Secure the catheter with two needles.\nOnce the mouse is cannulated, tight the thoracic knot to secure the catheter above the liver; this allows the catheter to remain stable during posterior perfusion and digestion.\nThen, tight the abdominal knot below the liver and cut inferior vena cava below the knot. Wait until the portal vein becomes distended, and then cut the portal vein (Methods video S2[href=https://www.wicell.org#mmc2]). At the end of this step a non-recirculating circuit from aorta artery to portal vein has been created (Figure 1[href=https://www.wicell.org#fig1]B).\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Positioning, dissection, and surgery, related to steps 4–6\nCritical: Proper cannulation of the aorta is crucial for a successful perfusion. Verify that no bubbles are introduced to avoid an incomplete digestion. See troubleshooting 2[href=https://www.wicell.org#troubleshooting].",
    "Note: Cannulation of the inferior cava vein instead of the left atrium for the isolation of primary mouse hepatocytes has been described in other protocols (Charni-Natan and Goldstein, 2020[href=https://www.wicell.org#bib1]; Shen et al., 2021[href=https://www.wicell.org#bib5]).\nLiver perfusion: Perfuse approximately 25 mL of Perfusion Solution at 5 mL/min of speed (Methods video S3[href=https://www.wicell.org#mmc3] – part 1).\n    Your browser does not support HTML5 video.\n  \nMethods video S2. Cannulation, related to step 7\nNote: If the surgery, cannulation and initial perfusion were performed correctly, the liver should turn pale. The Perfusion Solution should leave the circuit through the portal vein.\nOptional: Add Rinsing Solution to the abdominal cavity of the mouse regularly to prevent contamination.\nOptional: A soft massage of the liver while perfusing, favors posterior liver digestion.\nLiver digestion: Switch on the heat lamp facing the mouse liver. Switch the end of the perfusion line from the Perfusion Solution to the Digestion Solution and perfuse the liver with 25 mL of this solution at 3.5 mL/min (Methods video S3[href=https://www.wicell.org#mmc3] – part 2).\nNote: When switching the perfusion line from the Perfusion Solution to the Digestion Solution, briefly turn off the perfusion pump to avoid bubbles.\nNote: The optimal pump speed depends on the diameter of the tube. In this protocol, pump speed was optimized according to the perfusion pump used (Masterflex C/L Analog Variable-Speed Pump with Dual-Channel Pump Head for Microbore Tubing Pump, 10–60 rpm; 12 VDC).\nLiver collection: Once the perfusion with the Digestion Solution has finished, collect the mouse liver carefully. Remove gallbladder and the leftovers of tissue from diaphragm. Transfer the liver to 25 mL of Hepatocyte Attachment Medium in a 50 mL centrifuge tube in ice (Methods video S3[href=https://www.wicell.org#mmc3] – part 3).\nNote: Carefully remove the liver avoiding puncturing/cutting the small intestine to prevent bacterial contamination.",
    "Critical: After digestion, liver texture should be soft and easily disaggregated by shaking the 50 mL centrifuge tube. If the liver has a dense-viscous texture, the perfusion failed and the yield for cell culture will be very low. See troubleshooting 3[href=https://www.wicell.org#troubleshooting].\nLiver disaggregation: To favor release of hepatocytes, place the 50 mL tube containing the liver in a shaker (ROCKER 3D digital) for 5 min on ice.\nNote: After finishing liver perfusion of one mouse, and before starting the procedure with another mouse, wash the perfusion line of the pump with Rinsing Solution to eliminate the rest of Collagenase from Digestion Solution.\n    Your browser does not support HTML5 video.\n  \nMethods video S3. Perfusion, digestion, and collection, related to steps 8–10\nDay 1: Collection and plating of primary mouse hepatocytes\nTiming: 35–40 min (plus 6 h for incubation)\nThis major step allows to culture primary hepatocytes from the digested liver obtained in the previous step. Hepatocytes are filtered and separated by a density gradient; cells are counted and plated at a suitable confluence to perform the signaling experiment in the following step.\nNote: All the steps of this section must be performed in a sterile cell culture hood (Methods video S4[href=https://www.wicell.org#mmc4]).\nHepatocyte filtration: Filter the mouse liver through a 100 μm cell strainer transferring the sample to a clean 50 mL centrifuge tube. Favor liver disaggregation by gently smashing the liver with the plunger of a 10 mL syringe on top of the cell strainer. Use 10 mL extra of Hepatocyte Attachment Medium to clean the initial centrifuge tube and recover the possible remaining cells.\nHepatocyte collection: Centrifuge the filtered hepatocytes at 50 × g for 5 min at 20ºC–25ºC (Figure 2[href=https://www.wicell.org#fig2]A). Aspirate the supernatant and resuspend the cell pellets with 25 mL of Hepatocyte Attachment Medium.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1133-Fig2.jpg",
    "Figure 2. Hepatocyte collection and density-gradient separation\n(A) Filtered hepatocytes collected from liver are centrifuged. The cartoon shows the pellet with total cells from liver.\n(B) The pellet in (A) is resuspended in 50:50 Hepatocyte Attachment Medium: Gradient Solution and centrifuged. The cartoon shows the pellet containing viable hepatocytes; the supernatant is composed by dead cells and debris.\nNote: Prepare the Gradient Solution while cells are centrifuging.\nDensity-gradient separation: Add 25 mL of Gradient Solution slowly to the resuspended cells without mixing. Homogenize the solution by flipping the centrifuge tube 10 times. Centrifuge at 50 × g for 10 min at 20ºC–25ºC with deceleration. At the end of the centrifugation, viable hepatocytes will be pelleted and dead cells will remain in the upper fraction of the supernatant (Figure 2[href=https://www.wicell.org#fig2]B).\nCritical: Double-check that the deceleration step is set in the centrifuge. Otherwise, the gradient will be lost and the hepatocyte pellet will be contaminated with dead cells.\nNote: This step is an improvement over other protocols, in which viable hepatocytes are not separated from dead cells through a density gradient. Percoll-based separation results in higher viability of the isolated hepatocytes.\nHepatocyte clean-up: Centrifuge the hepatocytes to remove dead cells.\nAspirate the supernatant very carefully to remove dead cells and resuspend the pellet using 20 mL of Hepatocyte Attachment Medium. Centrifuge the cells at 50 × g for 5 min at 20ºC–25ºC.\nAspirate supernatant and resuspend the pellet with Hepatocyte Attachment Medium. In this step the volume for resuspending the hepatocytes depends on the pellet size.\nNote: A successful isolation will require 25 mL of Hepatocyte Attachment Medium for resuspending the hepatocyte pellet (Figure 3[href=https://www.wicell.org#fig3]A). If the yield of isolation is lower, volume can be decreased to 10 mL (Figure 3[href=https://www.wicell.org#fig3]B) or 5 mL (Figure 3[href=https://www.wicell.org#fig3]C) of Hepatocyte Attachment Medium.",
    "Your browser does not support HTML5 video.\n  \nMethods video S4. Tissue culture, related to steps 12–15\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1133-Fig3.jpg\nFigure 3. Hepatocyte clean up\nThe volume of Hepatocyte Attachment Medium for resuspending hepatocytes depends on the size of the pellet obtained in step 15.\n(A) A successful isolation requires a resuspension volume of 25 mL of Hepatocyte Attachment Medium.\n(B) If the yield of isolation is lower, volume can be decreased to 10 mL.\n(C) If the isolation was limited, the volume of resuspension should not exceed 5 mL.\nAssess hepatocyte viability: Gently homogenize the hepatocyte suspension by pipetting up and down with a 1000 μL pipette. Stain the hepatocytes with 10 μL of cell sample with 10 μL of Trypan Blue staining solution. Count both dead (dark blue) and live (translucent) cells using a TC20 Automated cell counter to calculate the survival rate. Alternatively, a classical hemocytometer could be used. Hepatocyte viability should be around 85%.\nNote: Repeat the staining and cell counting twice or three times on each sample and average the numbers obtained. Variability in sampling can lead you to inaccurate quantification of the hepatocyte concentration and to differences in confluence upon plating.\nHepatocyte plating: Plate 300,000 live hepatocytes per well in the collagen-coated 6 multi-well plates with 2 mL of Hepatocyte Attachment Medium. Replace the medium after 6 h and culture hepatocytes for another 16 h with Hepatocyte Attachment Medium before the signaling experiment.\nCritical: Confluence of hepatocytes must not be higher than 300,000 cells per well, because mTORC1 activity is affected by confluence (Figures 4[href=https://www.wicell.org#fig4]A and 4B). See troubleshooting 4[href=https://www.wicell.org#troubleshooting].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1133-Fig4.jpg\nFigure 4. Hepatocyte plating\nLiver cells should be plated at a confluence of 300,000 hepatocytes per 3.5 cm well for signaling experiments.",
    "(A) Within 6 h after hepatocyte plating, cells attach to the plate and acquire a round shape (Scale bar 300 μm).\n(B) 16–20 h after hepatocyte plating, cells have acquired their hexagonal shape (Scale bar 300 μm).\nNote: If mTORC1 signaling will be determined in different conditions (e.g., mice of different genotypes, under different treatments, etc., we strongly recommend to plate all groups in the same plate. If so, upon processing the plate, different conditions would have simultaneous, equal handling (Figures 5[href=https://www.wicell.org#fig5]A and 5B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1133-Fig5.jpg\nFigure 5. Scheme of hepatocyte plating for signaling experiments\nGroups A and B are shown as an example to distribute different experimental groups and to achieve equal handling.\n(A) Amino acid deprivation of mouse primary hepatocytes. Top: mTOR ON rate. Down: mTOR OFF rate.\n(B) Serum withdrawal + insulin stimulation of mouse primary hepatocytes.\nOptional: Add one extra well in the plate as positive control for the signaling experiments. These hepatocytes will be cultured in complete Hepatocyte Attachment Medium during the whole experiment.\nNote: Before changing the medium 6 hours after the plating, we recommend to wash each well with Rinsing Solution to prevent potential contaminations.\nDay 2: Amino acid deprivation + replenishment of primary mouse hepatocytes\nTiming: 1 h 45 min for ON rate; 4 h for OFF rate\nThis major step allows for a time-lapse assessment of nutrient-dependent activation of the mTOR signaling pathway through amino acid deprivation followed by replenishment.",
    "Note: We have previously performed nutrient signaling experiments on other primary cultures of mouse cells: Mouse Embryonic Fibroblasts (de la Calle Arregui et al., 2021[href=https://www.wicell.org#bib2]) (Ortega-Molina et al., 2021[href=https://www.wicell.org#bib4]) and naïve B lymphocytes (Ortega-Molina et al., 2019[href=https://www.wicell.org#bib3]), using standard RPMI without amino acids, supplemented with dFBS. However, this medium resulted suboptimal for the assessment of mTORC1 activity in primary hepatocytes from adult mice: poor acute activation of mTORC1 was observed with this medium and with several iterations aimed to more closely resemble Hepatocyte Attachment Medium (Table 1[href=https://www.wicell.org#tbl1] and Figure 6[href=https://www.wicell.org#fig6], See troubleshooting 5[href=https://www.wicell.org#troubleshooting]). In contrast, a wide dynamic range of activation/inhibition suitable for the assessment of nutrient-dependent activation of mTORC1 was obtained with Amino acid Starvation Medium (CELL MEDIUM E with insulin in Table 1[href=https://www.wicell.org#tbl1]).\ntable:files/protocols_protocol_1133_4.csv\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1133-Fig6.jpg\nFigure 6. Assessment of mTORC1 activity in the cell culture media tested and sub-optimal to perform amino acid starvation on primary mouse hepatocytes\nDMEM/F12 is best suited to perform amino acid starvation on primary hepatocytes when supplemented with insulin (CELL MEDIUM E with Ins, Amino acid Starvation Medium).\nHepatocyte washing: The next day, rinse cultured hepatocytes three times with Pre-starvation Medium. Aspirate thoroughly the medium in each wash to remove any leftover of the Hepatocyte Attachment Medium (containing non-dialyzed FBS and amino acids).\nAmino acid starvation: Add to each well 2 mL of Amino acid Starvation Medium. Return the plates to the incubator for 1 h.\nNote: During this incubation prepare the Amino acid cocktail.\nAmino acid replenishment: 1 h after incubation of hepatocytes in the Amino acid Starvation Medium, add 200 μL of Amino acids cocktail, or 200 μL of Amino acid Starvation Medium (without amino acids) to control, non-replenished hepatocytes. In our experiments, we perform re-stimulation during 1, 2, 5, 10 and 20 min (Figure 5[href=https://www.wicell.org#fig5]A top).",
    "Note: Timing of plate processing is critical. Start the amino acid re-stimulation with the longest timepoint. In our experiment the longest replenishment is 20 min. 10 min after adding back amino acids in the “20 min” wells, we add back amino acids to the “10 min” wells. 5 min after this condition we add back amino acids to the “5 min” wells. 3 min after this condition we add back amino acids to the “2 min” wells. Finally, 1 min after this condition we add back amino acids to the “1 min” wells.\nOptional: In case you have included an additional well for high mTORC1 activity, replace the medium 16 hours after plating, adding to each well 2 mL of Hepatocyte Attachment Medium and incubate for 1 hour.\nHepatocyte collection: Once the timepoints are finished, place the cell plates on ice.\nWash twice with cold PBS. Aspirate thoroughly the PBS in each wash for minimal PBS leftover volume.\nAdd 150 μL of cold, freshly prepared Protein Lysis Buffer to each well of the plate.\nScrape hepatocytes with cell lifters.\nCollect the hepatocytes in 1.5 mL centrifuge tubes.\nNote: At this point the cells could be stored at −80°C, or proceed to protein extraction.\nProtein extraction:\nIncubate the samples at 4°C during 10 min with rotation in the ELMI Intelli Mixer.\nCentrifuge at 4°C during 10 min at 21,130 g.\nTransfer supernatant to a new 1.5 mL centrifuge tube.\nProtein quantification: Quantify protein concentration with Pierce BCA method or an equivalent method.\nNote: Protein concentration from isolated primary hepatocytes should be approximately 1.5 μg/μL.",
    "Western Blot: Load 8 μg of protein in each lane in a 16% polyacrylamide gel and proceed to run and transfer a standard Western Blot. Probe for levels of Phospho-Thr389-p70 S6 Kinase (1:500), total S6 Kinase (1:500), Phospho-Ser235/236-S6 (1:1000), total S6 (1:1000), Phospho-Thr37/46-4E-BP1 (1:500) and total 4E-BP1 (1:1000) See troubleshooting 5[href=https://www.wicell.org#troubleshooting] (Figure 7[href=https://www.wicell.org#fig7]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1133-Fig7.jpg\nFigure 7. Assessment of mTORC1 activity by amino acid deprivation/stimulation in DMEM/F12 medium without or with insulin\n(A) mTORC1 ON rate.\n(B) mTORC1 OFF rate.\nOptional: As an alternative to the assessment of the ON rate of amino acid-dependent mTOR activation, it is possible to assess the OFF rate. In such case, the experiment is performed identically until the step 19. Primary hepatocytes are deprived of all amino acids for 0 min, 10 min, 30 min, 1h, 2h and 4h (Figure 5[href=https://www.wicell.org#fig5]A down, Figure 7[href=https://www.wicell.org#fig7]B).\nDays 2 and 3: Serum withdrawal + insulin stimulation of primary mouse hepatocytes\nTiming: 24 h\nThis major step allows to assess growth factor-dependent activation of the mTOR signaling pathway through withdrawal of FBS followed by a 10-min stimulation with insulin.\n∗ Continue from step 17.\nChange medium: 16–24 h after plating, replace the medium (Hepatocyte Attachment Medium).\nHepatocyte washing: 4 h after changing the medium, rinse cultured hepatocytes three times with FBS withdrawal Medium. Thoroughly aspirate the medium in each wash to remove any leftover of FBS from the Hepatocyte Attachment Medium.\nSerum withdrawal: Add 2 mL of FBS withdrawal Medium to each well. Return the plates to the incubator and leave for 16 h.\nInsulin re-stimulation: After 16 h, add 2 μL of 100 μM insulin in the corresponding wells during 15 or 30 min (Figure 5[href=https://www.wicell.org#fig5]B). 10% FBS can be used instead of insulin for re-stimulation.",
    "Optional: In case you have included an additional well for high mTORC1 activity, replace the medium 20 and 4 hours after plating, adding to each well 2 mL of Hepatocyte Attachment Medium (containing FBS).\nHepatocyte collection: After 15 or 30 min, place the cell plate on ice.\nWash twice with cold PBS. Aspirate thoroughly the PBS in each wash for minimal PBS leftover volume.\nAdd 150 μL of Protein Lysis Buffer to each well of the plate.\nCollect the hepatocytes with cell lifters in 1.5 mL centrifuge tubes.\nNote: At this point the cells could be stored at −80°C, or proceed to protein extraction.\nProtein extraction:\nIncubate the samples at 4°C during 10 min with rotation in the ELMI Intelli Mixer.\nCentrifuge at 4°C during 10 min at 21,130 g.\nTransfer supernatant to a new 1.5 mL centrifuge tube.\nProtein quantification: Quantify protein concentration with Pierce BCA method.\nWestern Blot: Load 8 μg of protein in each lane in a 16% polyacrylamide gel and proceed to run and transfer a standard Western Blot. Probe for levels of Phospho-Thr389-p70 S6 Kinase (1:500), total S6 Kinase (1:500), Phospho-Ser235/236-S6 (1:1000), total S6 (1:1000), Phospho-Thr37/46-4E-BP1 (1:500), total 4E-BP1 (1:1000), Phospho-Ser473-Akt (1:1000) and total Akt (1:1000) (Figure 8[href=https://www.wicell.org#fig8]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1133-Fig8.jpg\nFigure 8. Assessment of mTORC1 activity by serum withdrawal + insulin stimulation\nTwo different samples of hepatocytes (H1 & H2) are shown for each condition.",
    "The isolated primary hepatocytes can be alternatively used for other molecular purposes independently of the assessment of mTOR activity. This protocol can be applied to assess the activity of additional signaling pathways, by exposing the primary hepatocytes to different experimental manipulations (chemical, physical and pharmacological). We have previously used this in vitro system to measure ex vivo cellular respiration (de la Calle Arregui et al., 2021[href=https://www.wicell.org#bib2]), as well as to evaluate specific proteins through immunofluorescence, gene expression through RT-qPCR or whole transcriptome profiling, and metabolomic analysis."
  ],
  "subjectAreas": [
    "Metabolism",
    "Cell Isolation",
    "Cell Culture",
    "Cell-Based Assays",
    "Signal Transduction",
    "Metabolomics"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}