{
  "id": 2850,
  "origin_website": "Cell",
  "title": "Optimized protocol for live imaging of overnutrition-elicited interactions between immune cells and β cells in zebrafish",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation of the desired fish lines for live imaging\nTiming: Approximately 3–6 months\nGenerate breeders.\nRaise the following breeder lines to adulthood: 1) Tg(acta1:dnigf1ra-EGFP)vu530 (referred to as zMIR; henceforth); Tg(ins:H2BmCherry)vu513 (Maddison et al., 2015)4[href=https://www.wicell.org#bib4], 2) zMIR; Tg(ins:H2BmCherry); Tg(mpeg1:EGFP),6[href=https://www.wicell.org#bib6] 3) Tg(LyzC:DsRED2), and 4) Tg(LyzC:GFP).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2354-Fig1.jpg\nFigure 1. Identify fish with the desired genotypes\n(A) Image of Tg(acta1:dnigf1ra-EGFP)(zMIR ) fish at 4 dpf that expresses a dominant negative Igf1r-EGFP indicated by green immunofluorescence in skeletal muscle, particularly the jaw muscle (White arrow).\n(B) Image of Tg(mpeg1:EGFP) fish at 4 dpf with its macrophages labelled by EGFP (Green dots). The white arrow points to a macrophage.\n(C) Image of a zMIR larva that also has EGFP-labelled macrophages.\n(D) Image of a Tg(ins:H2B-mCherry) fish at 4 dpf showing red fluorescence in the β cells (White arrow).\n(E) Image of a Tg(lyzC:DsRed2) fish at 4 dpf showing red fluorescence in neutrophils (Red dot). The white arrow points to a neutrophil.\n(F) Image of a larva that has Tg(ins:H2B-mCherry) and Tg(lyzC:DsRed2). All scale bars represent 100 μm.\nNote: These lines can be identified under a fluorescent microscope by their fluorescent markers at 4 days postfertilization (dpf) by their specific expression patterns (Figure 1[href=https://www.wicell.org#fig1]).\nUse a transfer pipette to carefully move the desired larvae individually into a Petri dish.\nRaise them to adults in the fish facility.\nRaise the above breeder lines that are also tnfa+/−. PCR genotyping is needed to determine the tnfa genotypes.\nCritical: If the desired stage of larvae is older than 6 days post fertilization (dpf), larva should be fed with Paramecium or 1% egg yolk medium twice daily. Starvation during development may result in misleading outcomes and conclusions.\nGenerate fish with the desired fluorescence lineage markers\nTiming: 1 week",
    "Set up appropriate breeders to generate progenies with the desired genotypes.\nNote: We use 2 distinct breeder lines for each imaging experiment. In this protocol, we use Tg(ins:H2B-mCherry) to label β cells; Tg(mpeg1:EGFP) to label macrophages; Tg(LyzC:DsRED2) or Tg(LyzC:GFP) to label neutrophils. For imaging 2 cell types, each breeder line carries one cell type marker in addition to the desired mutation(s) or transgene(s). For imaging 3 cell types, one of the breeder lines should carry 2 cell type markers in addition to the desired mutation(s) or transgene(s). These mutations or transgenes may be obtained de novo, by breeding or from other investigators.\nDetermine their genotypes using fluorescent marker(s) and/or PCR.\nRaise these fish to adulthood.\nGenerate fish of the desired genotypes for the experiment.\nHarvest the embryos using a strainer and rinse them with egg water gently and thoroughly to remove fish feces.\nCollect them with fresh egg water (0.2 g/L Instant Ocrean Salt) in 10 cm Petri dishes.\nPut the dishes into a 28°C incubator.\nCheck the embryos daily to remove dead embryos and detached chorions with a transfer pipette.\nNote: Do not add methylene blue in egg water. Methylene blue is strongly fluorescent, which will interfere in the screening of fluorescent markers.\nCritical: 70–80 embryos/larvae develop normally in a 10 cm Petri dish. Putting more embryos than this in a dish may impair their development.\nIdentify fish with the desired cell lineage markers at 4 dpf (Figure 1[href=https://www.wicell.org#fig1]).\nAdd the 150 μL of Tricaine stock into a Petri dish that contains larvae in 15 mL of egg water. Wait approximately 1 min until all the larvae are anesthetized.\nExamine them under a stereo fluorescent microscope (Zeiss Discovery V12) to identify individuals with the desired genotypes.\nNote: Figure 1[href=https://www.wicell.org#fig1] shows the expected expression patterns of some of these transgenes.",
    "Use a glass Pasteur pipette to transfer the zMIR+ and zMIR- larvae one by one separately into a cell strainer sitting in a Petri dish with 15 mL egg water.\nTransfer each of the cell strainer to another Petri dish containing egg water and gently agitate it to eliminate Tricaine.\nTransfer all fish in the strainer to a Petri dish with 25 mL of fresh egg water.\nNote: In our experiments, we have already allocated the RFP channel to islet β cells and assigned the GFP channel to macrophages. Because of their distinct morphology and behavior, neutrophils can use either the GFP or RFP channel.\nCritical: Perform the screening process rapidly and gently, avoid damaging the larvae or immersing the larvae in the tricaine solution for too long. Damaged or unhealthy fish will have an abnormal macrophage and neutrophil response in the islet.\nPut the dishes back into the 28°C incubator until the next step.\nNote: The optimal fish age for this protocol is 6 dpf as they have nearly exhausted the maternal nutrient supply in the yolk and eager to forage. If the desired age of larvae is older than 6 dpf, larvae should be fed with Paramecium (400 paramecia per larva) or 1% egg yolk medium (25 mL for 30 min for a group of up to 80 larvae).\nPerform the 3-day overnutrition experiment\nTiming: 3 days (for steps 6 to 9)",
    "This section provides a detailed description of performing a 3-day 5% egg yolk overnutrition experiment on 6 dpf larvae (Figure 2[href=https://www.wicell.org#fig2]). The macronutrient composition of chicken egg yolk is 57.7% lipid, 34.5% protein, and 7.8% carbohydrates. It is thus a high fat diet. After culturing in 5% chicken egg yolk emulsion for 8 h, zebrafish larvae have a fully stuffed foregut and a high lipid content in circulation and in the liver.2[href=https://www.wicell.org#bib2] At the end of each session of the 8-h culture in 5% egg yolk emulsion, ER stress can be detected in β cells and compensatory neogenesis occurs,2[href=https://www.wicell.org#bib2] indicating nutrient stress. Therefore, we choose this as an overnutrition regime. We have not tested other means of overnutrition for this stage of larvae, such as overfeeding with paramecia.7[href=https://www.wicell.org#bib7]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2354-Fig2.jpg\nFigure 2. Prepare and use the nutrient-rich medium\n(A) Harvest egg yolk.\n(B) Add equal amount of 0.3x Danieau’s solution to an egg yolk-containing conical tube.\n(C) Generate 50% stock by vigorous vortexing.\n(D) Prepare working medium by vigorous mixing of 5 mL Stock and 45 mL 0.3x Danieau’s solution.\n(E) Add 25 mL of the 5% egg yolk medium and < 20 larvae to a clean 50 mL beaker.\n(F) Transfer the larvae into the Sterile Cell Strainer in a Petri dish.\n(G) Quickly transfer the larvae into a 50 mL clean beaker with 25 mL of the 5% egg yolk medium.\n(H) Put the beaker into a 28°C incubator. As sediments accumulate, stir the medium every 2 h\n(I) Transfer the larvae clear of egg yolk into a Petri dish with 0.3x Danieau’s solution.\nFormulate the 5% egg yolk medium (Methods video S1[href=https://www.wicell.org#mmc1]).\nIsolate egg yolk.\nObtain a fresh egg and break the eggshell.\nRemove the egg white as much as possible.",
    "Carefully transfer the egg yolk to the other half of the shell or to the palm of the nondorminant hand.\nGently rinse it with 10 mL DI water to remove the egg white (Figure 2[href=https://www.wicell.org#fig2]A).\nTransfer the fresh egg yolk into a 50 mL conical tube. One egg yolk is typically 15 mL in volume (Figure 2[href=https://www.wicell.org#fig2]B).\nNote: Always use fresh eggs before they are expired.\nCritical: Before collecting the egg yolk, try to remove as much egg white as possible. When in contact with salt water (Danieau buffer), the protein from the egg white may denature and become flocculent, which may stick to the larvae and impede their motility.\nMake 50% egg yolk emulsion (Figure 2[href=https://www.wicell.org#fig2]C)\nAdd equal volume of 0.3x Danieau’s solution into the 50 mL conical tube (Figure 2[href=https://www.wicell.org#fig2]B).\nClose the lid and shake the tube on a tube vortexer at maximum speed for 2 min.\nPrepare 5% egg yolk medium.\nTake 5 mL of the 50% egg yolk emulsion after letting the mixture stand for 5 min and add it into a 50 mL centrifuge tube that contains 45 mL of 0.3x Danieau solution.\nClose the lid and shake on a tube vortexer at maximum speed for 2 min (Figure 2[href=https://www.wicell.org#fig2]D).\nPour 25 mL of the 5% egg yolk medium into a 50 mL glass beaker.\nNote: If the fish need to be treated with an inhibitor during the overnutrition process, dilute the compound in the appropriate solvent (eg. DMSO) as stock (≥1000x) and dilute to the desired working concentration(s) in the 5% egg yolk medium. Add the same volume of the solvent (eg. DMSO) into the 5% egg yolk medium for the control group.\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Preparation of 5% chicken egg yolk medium, related to step 1",
    "Setup the overnutrition experiment for larvae (Figure 2[href=https://www.wicell.org#fig2]E).\nCollect larvae for the experiment.\nPut a sterile cell strainer in a petri dish containing 25 mL 0.3x Danieau’s solution.\nTransfer all the larvae from the original dish into the sterile cell strainer using a transfer pipette (Figure 2[href=https://www.wicell.org#fig2]F).\nTake the cell strainer out of the 0.3x Danieau’s solution.\nRemove excess liquid by taking the strainer out of the Danieau’s solution and tapping it on a clean paper towel as quickly as possible to remove excess liquid.\nNote: Try to remove as much of the excess Danieau’s solution on the cell strainer as possible to avoid diluting the egg yolk medium. Gently transfer the larvae into the cell strainer to avoid damaging the larvae.\nSubmerge the cell strainer in a beaker containing the 5% yolk medium to release the larvae (Figure 2[href=https://www.wicell.org#fig2]G).\nNote: Put the same number of larvae into the 25 mL 5% yolk medium to create the same condition for both control and experimental groups.\nCritical: Do not put more than 20 larvae in a 50 mL beaker that contains 25 mL 5% yolk medium, or 40 larvae in 100 mL beaker containing 50 mL 5% yolk medium as more fish may cause hypoxia and stress.\nPut the beaker back into the incubator and stir up the sediments in the egg yolk medium (Figure 2[href=https://www.wicell.org#fig2]H) with a transfer pipette every 2 h.\nNote: Place the bore of the transfer pipette to the bottom of the beaker and gently pipette the egg yolk medium up and down to break up the sediments. The sediments may bury the larvae and limit their motility and oxygen availability.",
    "Critical: Use a new transfer pipette for each beaker, especially when using a drug or compound within the yolk medium. Some larvae may be stuck onto the transfer pipette and transferred to another beaker.\nTransfer the larvae to the nutrient-free medium after 8 h in the 5% egg yolk medium.\nGently pour the egg yolk medium into a sterile cell strainer to collect the larvae.\nRinse the residual egg yolk medium off the larvae by gently stirring the cell strainer in a Petri dish with 25 mL 0.3x Danieau’s solution.\nMove the larvae to a new Petri dish containing 25 mL fresh 0.3x Danieau’s solution using a transfer pipette (Figure 2[href=https://www.wicell.org#fig2]I).\nNote: Gently perform this procedure. Larvae at this stage are fragile and could be harmed or damaged. After transferring the larvae into a Petri dish, remove all the residual egg yolk sediments and replenish the dish with fresh 0.3x Danieau’s solution. If an inhibitor is needed during the nutrient free period, then dilute the stock into 0.3x Danieau’s solution to the desired working concentration. Add the same volume of solvent (eg. DMSO) into 0.3x Danieau’s solution of the control group. We usually put 25 mL solution in a 100 mm × 15 mm Petri dish.\nPut Petri dish back into the 28°C incubator for 16 h.\nRepeat steps 7 and 8 twice for a complete 3-day overnutrition experiment.\nCritical: Follow the same schedule in all 3 days as β cell loss occurs during a 4-h window after a complete 3 day overnutrition (see problem 1[href=https://www.wicell.org#sec6.1] in troubleshooting[href=https://www.wicell.org#troubleshooting]). We use fresh 5% egg yolk each day because the used 5% egg yolk has a high microbial load after 8 h at 28°C, which not only emits a foul odor but also impacts fish health.\nLive confocal imaging of treated zebrafish",
    "Timing: 3–5 h\nThis section provides a detailed description of performing live imaging on zebrafish to visualize immune cell (macrophages; neutrophils) infiltration into the principal islet after 3 days of overnutrition (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2354-Fig3.jpg\nFigure 3. Embed larvae in LMA for imaging\n(A) Transfer the larvae into a 35 mm Glass Bottom Dish.\n(B) After anesthesia, remove most of the medium with a transfer pipette.\n(C) Remove the residual medium using a transfer pipette with a 10 μL pipette tip attached.\n(D) Add 750 μL of the pre-heated 1.2% LMA at the center of glass bottom using a P1000 pipette.\n(E) Position the larvae on their right side using two insulin syringe needles.\n(F) Add 750 μL 0.3x Danieau’s solution (containing Tricaine) at the periphery of the dish after the LMA solidifies to submerge the gel.\n(G) Check the larvae under a stereo microscope.\nEmbed larvae in a glass bottom dish (Methods video S2[href=https://www.wicell.org#mmc2]).\nUsing a transfer pipette, move the larvae from the petri dish into a 35 mm glass bottom dish (uncoated).\nAdd Tricane stock to a final concentration of 0.16 g/L to anesthetize the larvae (Figure 3[href=https://www.wicell.org#fig3]A) (see problem 2[href=https://www.wicell.org#sec6.2] in troubleshooting[href=https://www.wicell.org#troubleshooting]).\nNote: Do not transfer more than 4 larvae into a dish. At room temperature (ca. 20°C), we found that only 4 larvae could be embeded in a glass bottom dish before the gelling of LMA. If more fish per dish is necessary, a warm microscope stage may help delay the gelling.\nRemove liquid.\nUse a transfer pipette to aspirate most of the medium in the bottom glass dish (Figure 3[href=https://www.wicell.org#fig3]B).\nAttach a 10 μL pipette tip to the transfer pipette and aspirate the residual medium as much as possible (Figure 3[href=https://www.wicell.org#fig3]C).",
    "Take one aliquot of LMA out from the 42°C block heater and rapidly add 750 μL of LMA on the bottom glass to cover the larvae (Figure 3[href=https://www.wicell.org#fig3]D).\nNote: Remove the medium out of the bottom glass dish carefully. Avoid contacting the larvae with the transfer pipette or the 10 μL pipette tip.\nCritical: When aspirating the excess medium, slowly release the bulb of the transfer pipette, especially when a 10 μL pipette tip is attached. Larvae will be easily caught by the tip and injured. Macrophages and neutrophils will be attracted to the injury site, which may confound the experiment.\nUnder a stereo microscope, use the needles of two insulin syringes (1 mL) to position the larvae so that their righthand side is close to the glass bottom (Figure 3[href=https://www.wicell.org#fig3]E). Perform this as quickly as possible.\nNote: Beginners may want to start with one larva at a time; it takes around 30–45 s for the LMA to solidify. Once the LMA solidifies, do not move or change the position of the larvae.\nCritical: Carefully position the larvae. Do not touch the larvae with the tip of the needles to avoid injury. Injury may affect the phenotype.\nAdd 750 μL 0.3x Danieau’s solution (containing tricaine at a final concentration of 0.16 g/L) gently on the periphery of dish to submerge the LMA gel and cover the dish with a lid (Figure 3[href=https://www.wicell.org#fig3]F).\nCheck the orientation and health of the larvae and put the dish back to the incubator until imaging (Figure 3[href=https://www.wicell.org#fig3]G).\nNote: Wait until the LMA gel completely solidifies before adding the medium to the non-glass portion of the dish to submerge the LMA gel. Do not squirt the medium on the top of the gel as it may loosen up the fish and/or disturb the gel.",
    "Critical: We immobilize the larvae for about 1.5 h for a 1 h time lapse imaging session. In our model, immobilization for more than 2 h abolishes the phenotypes (macrophage infiltration and β cell loss).\n    Your browser does not support HTML5 video.\n  \nMethods video S2. Emded larvae for live confocal imaging, related to step 10\nPerform live imaging on the principal islet.\nStart the LSM 780 Laser Scanning Microscope according to the manufacturer’s instructions.\nNote: We usually use a 20x objective (NA 0.5).\nHeat up the environment chamber to 30°C.\nTransfer the glass bottom dish to the chamber.\nCritical: Incubate the larvae at 30°C for at least 20 min before imaging because the expansion of LMA may cause a drift of the samples (see problem 3[href=https://www.wicell.org#sec6.4] in troubleshooting[href=https://www.wicell.org#troubleshooting]).\nConfirm the larvae are laying on the righthand side (Figure 3[href=https://www.wicell.org#fig3]F) before beginning the imaging session.\nSetting up the z-stack settings.\nTake 512 × 512 volumetric time-lapse images at 15-s or 30-s intervals with a z-step size of 1.2 μm and an average total thickness of 35 μm (see Methods videos S3[href=https://www.wicell.org#mmc3], S4[href=https://www.wicell.org#mmc4], and S5[href=https://www.wicell.org#mmc5] for examples).\nNote: To catch more details without losing too much image quality, we set the pixel dwell at 3.15 μs. Since macrophages’ migration velocity is much slower than that of neutrophils, multiple larvae may be imaged in a session.\nCritical: Maintain the power of all excitation lasers as low as possible (<1.5%) to minimize phototoxicity.\n    Your browser does not support HTML5 video.\n  \nMethods video S3. Representative video, related to step 11\nThe video shows islet surveillance by macrophages and neutrophils from 66 to 67 h post treatment in control fish (Red cell clusters, islet β cell; Green cells, macrophages; Red moving cells, neutrophils).\n    Your browser does not support HTML5 video.",
    "Methods video S4. Representative video, related to step 11\nThe video shows islet surveillance by macrophages and neutrophils from 66 to 67 h post treatment in zMIR fish (Red cell clusters, islet β cell; Green cells, macrophages; Red moving cells, neutrophils).\n    Your browser does not support HTML5 video.\n  \nMethods video S5. Representative video, related to step 11\nThe video shows that depletion of tnfa leads to more macrophages in the islet area without increasing neutrophil visits to the islet (Red cell clusters, islet β cell; Green cells, macrophages; Red moving cells, neutrophils).\nGenotype the larvae after live imaging (only necessary if the genotype is unknown).\nAfter live imaging, carefully aspirate the medium with a transfer pipette and use a pair of tweezers to pick up individual larvae from the LMA.\nPut each larva into a tube in an 8-strip of PCR tubes to extract DNA.\nAdd 100 μL 50 mM NaOH to each tube and incubate in a PCR machine at 95°C for 30 min.\nAdd 20 μL 1 M Tris-HCl (pH 8.0) to neutralize the lysate.\nPerform PCR using the Genotyping Primers.\ntable:files/protocols_protocol_2354_5.csv\nRun the reaction using the following PCR cycling conditions in a thermocycler.\ntable:files/protocols_protocol_2354_6.csv\nRun the PCR product on a 3% agarose gel to distinguish the mutant, heterozygous and wide type larvae.\nNote: The tnfa mutation in this study is a 59-basepair deletion.\nPause point: Images can be analyzed at a later time.\nAnalyze images and tracking the immune cells\nTiming: 1–2 h\nThis section provides a detailed description of video analysis and cell tracking using Imaris (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2354-Fig4.jpg\nFigure 4. Track macrophages near the principal islet in control and zMIR fish from 64 to 65 h post treatment using Imaris",
    "The islet is labelled by H2B-mCherry (red) and macrophages are labelled by EGFP (white). Each track is color coded to indicate the time during which the macrophage was tracked. The color gradient at the bottom of each image represent the tracking time.\nConvert the LSM file of images into an Imaris Image File using Imaris File Converter.\nOpen the images with Imaris.\nTo track the movement of macrophages or neutrophils according to the reference manual.\nClick on the spot icon. Make sure to unselect “Start Creation with slice view”.\nClick on the “Start” button.\nSlect GFP in the “chanel” pulldown menu. In this protocol, macrophages and neutrophils are labeled with GFP.\nClick on \"slice view” button, zoom in to measure the largest distance between 2 points within a GFP labelled cell. Go back to “3D view”.\nIn 3D view, key in the XY diameter, which is the distance measured in d.\nClick on the next button. Each cell visible in the channel is now automatically labelled with a spot.\nClick on the next button until you see the “Algorithm” pulldown menu. Choose “Autoregressive Motion”.\nMeasure the MaxDistance between adjacent frames of a spot. In “Slice View”, select a spot and measure the distance it has shifted in the next frame in 4 consecutive frames. Round up the largest distance as Max Distance.\nKey in the MaxGapSize. We always use 3.\nClick the play button to track all selected images in the video. All cells in the field of view are tracked.\nExport the tracking images (Figure 4[href=https://www.wicell.org#fig4]).",
    "Quantify the number of macrophages that were in or near (within a defined diameter) the islet or the number of times a neutrophil was detected in the islet within the imaged period in both control and experiment groups. Manually confirm the number frame by frame.\nEnter the data points into the GraphPad Prism 8.0 and analyze the data through one-way ANOVA."
  ],
  "subjectAreas": [
    "Immunology",
    "Metabolism",
    "Microscopy",
    "Cell Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}