{
  "id": 15246,
  "origin_website": "Jove",
  "title": "Biotin-based Pulldown Assay to Validate mRNA Targets of Cellular miRNAs",
  "procedures": [
    "1. Transfection of 3'-biotinylated miRNA\nNOTE: Perform the following steps inside a sterile laminar flow hood.\nSeed 4 x 105–5 x 105 HEK-293T cells per well in 2 mL of complete Dulbecco's Modified Eagle Medium (DMEM) [DMEM supplemented with 10% Fetal Bovine serum (FBS) and 1x Pen-strep antibiotic]. Culture the cells in an incubator set at 37 °C, 5% CO2 overnight.\nThe next day, check the health and adherence of the plated cells under a light microscope.\n\tNOTE: Make sure the cells have adhered and attained appropriate morphology before proceeding to the next step. The HEK-293T cells are typically ready for transfection 18–24 h post plating.\nIn a sterile 1.7 mL microfuge tube, dilute 75 picomoles of biotinylated miRNA in 200 µL of minimal essential media. Transfer this mix to another 1.7 mL microfuge tube containing Liposome based transfection reagent (8 µL/well) diluted in 200 µL of minimal essential media. Mix thoroughly, but gently, by pipetting and incubate for 20–25 min at room temperature to allow formation of the transfection complexes.\nRemove the old media from the 6 well culture plate by gentle pipetting and replenish each well with 1.6 mL of freshly prepared complete DMEM (without 1x Pen-strep antibiotics).\nAdd the transfection complexes (from 1.3) drop-wise to the cells in the 6-well plate using a well-calibrated pipette. Swirl the plate gently while adding the complexes to ensure their uniform distribution across the plate.\n\tNOTE: This step is very critical for achieving high-efficiency transfection and must be performed with care and patience.\nCulture the cells at 37 °C and 5% CO2 for at least 36 h.\n2. Preparation of Streptavidin Coated Magnetic Beads — I\nResuspend the streptavidin magnetic beads thoroughly by vortexing. Transfer 30 µL of bead suspension (per sample) to a 2 mL nuclease-free microfuge tube.",
    "Place the tube containing the bead suspension on the magnetic bead separator stand (\"magnet\" hereafter) for 2 min. After ensuring that the beads are drawn to the side of the tube in contact with the magnet, carefully remove the supernatant using a micropipette.\nAdd 100 µL of bead wash buffer (10 mM Tris-Cl pH 7.5, 0.5 mM EDTA, 1 M NaCl) to the beads. Remove the tube from the magnet. Vortex for 15 s at room temperature to wash the beads.\nPlace the tube containing beads on the magnet for 2 min, and carefully remove and discard the supernatant.\nRepeat steps 2.3 and 2.4 for a total of three washes. After the final wash step, remove the tube from the magnet.\nAdd 100 µL of RNase freeing solution (0.1 M NaOH, 0.05 M NaCl) to the beads, mix well by vortexing for 15 s, and incubate at room temperature for 5 min. Place the tube containing beads on the magnet for 2 min, and carefully remove and discard the supernatant.\nRepeat step 2.6 for a total of three times.\nAdd bead resuspension solution (0.5 M NaCl) to the beads, vortex 15 s, and incubate at room temperature for 5 min. Place the resuspended beads on the magnet for 2 min, and carefully remove the supernatant.\nAdd 200 µL of bead blocking solution (1 µg/µL BSA, 2 µg/µL Yeast tRNA) to the beads. Mix by gentle vortexing for 15 s at room temperature. Incubate at 4 °C for 16 h (over-night) on a multi-tube rotator.\n3. Preparation of Cell Lysates\nHarvest the transfected HEK-293T cells by gentle scraping using a sterile cell scraper inside the laminar hood, then transfer each sample into a sterile 2 mL microfuge tube.",
    "Pellet the scraped cells by centrifugation at 1,500 x g for 5 min. Resuspend the pellet in 1x sterile PBS (Phosphate Buffer Saline), pH 7.2. Centrifuge again at 1,500 x g for 5 min to obtain a pellet free of residual media. Immediately plunge the tube containing pellet into ice.\nPrepare fresh complete cell lysis buffer (150 mM NaCl, 25 mM Tris-Cl, pH-7.5, 5mM DTT, 0.5% IGEPAL, 60 U/mL Superase, 1x Protease Inhibitor).\n\tNOTE: A stock of cell lysis buffer lacking IGEPAL, Superase, and Protease inhibitor cocktail may be prepared in advance and stored at room temperature. Prepare a fresh batch of complete cell lysis buffer by adding the above supplements at the recommended final concentrations to the stock cell lysis buffer and storing it on ice.\nAdd 260 µL of ice-cold complete cell lysis buffer to each sample in the microfuge tube (i.e., each microfuge tube contains cells harvested from one well of the 6-well plate) and resuspend the cell pellet into a homogenous suspension by pipetting.\nLyse the cells using the freeze-thaw method: Incubate the tubes at -80 °C for 10–15 min. Then, allow the cells to thaw out on ice.\nCentrifuge the resulting cell lysate at 16,000 x g for 5 min in a refrigerated benchtop centrifuge set at 4 °C.\nTransfer the cleared cell lysate to a sterile 1.7 mL microfuge tube on ice. Discard the pellet.\n\tNOTE: The final volume of cleared lysate should be ~240–250 µL.\nAdd 5M NaCl to the cleared lysate to a final concentration of 1M and maintain the samples on ice.\n4. Preparation of Streptavidin Magnetic Beads — II",
    "Prepare fresh complete pull-down wash buffer (10 mM KCl, 1.5 mM MgCl2, 10 mM Tris-Cl pH 7.5, 5 mM DTT, 1 M NaCl, 0.5% IGEPAL, 60U/mL Superase, and 1x Protease Inhibitor cocktail)\n\tNOTE: A stock of pull-down wash buffer lacking IGEPAL, Superase, and Protease inhibitor cocktail may be prepared in advance and stored at room temperature. Prepare a fresh batch of complete cell lysis buffer by adding the above supplements at the recommended final concentrations to the stock cell lysis buffer and storing it on ice.\nPlace the tube containing the prepared beads (from step 2.9) on the magnet for 2 min. Carefully remove and discard the supernatant.\nAdd 150 µL of ice-cold complete pull-down wash buffer to the beads. Vortex for 15 s and incubate at room temperature for 30–60 s. Place the tubes on the magnet for 2 min. Carefully remove and discard the supernatant.\nRepeat step 4.3 for a total of 3 times.\nResuspend the beads in 300 µL of complete pull-down wash buffer.\n5. Pull-down of Target mRNA-miRNA Complexes\nTransfer 300 µL of the cell lysate (from step 3.8) to the microfuge tube containing 300 µL of beads (from step 4.5).\nIncubate the mixture on a nutating mixer for 1 h at room temperature.\nPlace the tube on the magnet for 5 min. Carefully remove and discard the supernatant.\nAdd 300 µL of ice-cold complete pull-down wash buffer to the beads. Vortex for 15 s at room temperature and place the tube on the magnet for 5 min. Carefully remove and discard the supernatant.\nRepeat step 5.4 two more times.\nResuspend the beads in 100 µL of nuclease-free water and incubate on ice.\n6. Total RNA Extraction, cDNA Synthesis, and qPCR",
    "Extract total RNA from the resuspended beads (from step 5.6) using an appropriate method (see Table of Materials). Resuspend the extracted total RNA in 25 µL of nuclease-free water. Determine the RNA concentration and quality using a spectrophotometer (absorbance at 260/280). Prepare a working stock of RNA at 50 ng/µL.\nPerform cDNA synthesis, in triplicates, using 50 ng of total RNA (from step 6.1) using an appropriate cDNA synthesis kit (see Table of Materials) using oligo dT primers in a final volume of 20 µL (Table 1). Then, load PCR tubes into the qPCR instrument to perform thermal cycling as per the conditions described in Table 2.\nPerform qPCR on the CDNA (from step 6.2) using SYBR Green chemistry (see Table of Materials):\nPerform all qPCR reactions in triplicates in a 96 well clear bottom plate in sterile conditions.\nAliquot 9 µL of the reaction mixture from the qPCR master mix (see Table 3) into each well of the plate. Then, add 1 µL of the cDNA to each well to achieve a final volume of 10 µL. Seal the PCR plate using heat resistant PCR plate sealer and load into the qPCR instrument\nPerform thermal cycling as per the conditions described in Table 4.\nNormalize the expression levels (Ct values) of each sample to the expression levels of the scrambled control. Use these values to calculate fold changes in expression.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}