{
  "id": 1992,
  "origin_website": "Cell",
  "title": "A simple protocol to isolate a single human cell PRDX1 knockout generated by CRISPR-Cas9 system",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTiming: 1 day for step 1\nVerification of PRDX1 expression in the target cells by RT-PCR and immuno- blot (Figures 1[href=https://www.wicell.org#fig1]A and 1B, see section 7 for immunoblot).\nIsolation of total RNA from HEK293 cells\nGrow cells in complete media (DMEM Glutamax (Thermo Fisher) supplemented with 5% Penicillin streptomycin and 10% FBS).\nHarvest a minimum of 2 × 106 cells for RNA extraction. Discard the culture medium. Wash the cells with PBS, and trypsinize with 1 mL of Tryp-LE to cover the surface of the cells. Then stop the trypsin enzymatic activity with an equal volume of complete culture medium.\nPellet cells using a clinical centrifuge at 201×g for 5 mins in Eppendorf centrifuge 5810.\nDiscard the supernatant and extract total RNA from the cell pellet using RNeasy mini kit (Qiagen, catg. no.74104)-as per the supplier protocol.\nQuantify the RNA yield using Nanodrop. Typically, expect 300–700 ng/μL of total RNA with an A260/A280 ratio above 1.8.\nUse 2 μg of total RNA to prepare the cDNA using Agilent cDNA synthesis kit.\nSet up RT-PCR reaction to check for target gene expression. Prepare reactions in triplicates for target gene amplification as well as for housekeeping gene amplification (GADPH or ACT1).\nSet up PCR reaction for amplification of the targeted region using 2 μL of this cDNA to check for the amplification of the target gene, see key resources table[href=https://www.wicell.org#key-resources-table] for primer sequences. For amplification, Accuprime high fidelity DNA polymerase was used for amplification (Aouida et al., 2015[href=https://www.wicell.org#bib1]).\nCheck PCR amplification using 1% agarose gel pre-stained with SYBR-SAFE dye\nNote: If antibodies exist for the target gene product, immune-blot analysis can also be performed.\nCritical: If no commercial antibody is available, knockouts can be verified by Sanger sequencing\ngRNA cloning, sequencing and Maxi-prep-endotoxin free (5 days)",
    "Timing: 2–3 days for step 4\nCloning of the guide RNA in plasmid PX330_U6-Chimeric _BB_CBh-hSpCas9 (Addgene # 42230) (Lee et al., 2017[href=https://www.wicell.org#bib3])\nPhosphorylate the complementary oligos for each guide (Forward and Reverse, key resources table[href=https://www.wicell.org#key-resources-table]).\nNote: See reaction set up in 25 μL, Table 1[href=https://www.wicell.org#tbl1] (Lee et al., 2017[href=https://www.wicell.org#bib3]).\nFor annealing the oligos, mix the complementary pair of oligos in a final volume of 50 μL in PCR strip tubes at a final concentration of 140 nM of each oligo.\nSet up thermomixer at 95°C, insert PCR tubes, incubate for 10 mins, reset the temperature to 25°C to allow annealing of the oligos. This takes ∼ 45 mins.\nIn parallel digest 10 μg of the PX330_U6-Chimeric _BB_CBh-hSpCas9 (Addgene # 42230) plasmid, a gift from Feng Zhang (Addgene plasmid # 42230 ; http://n2t.net/addgene:42230[href=http://n2t.net/addgene:42230] ; RRID:Addgene_42230) (Cong et al., 2013[href=https://www.wicell.org#bib2]) with BbsI (10 Units) for 2 hrs. There is no need to dephosphorylate the BbsI ends.\nRun the digested plasmid on 1% agarose gel and purify the linear plasmid backbone (QIAEX II gel extraction kit) (backbone is 8,484 bp).\nLigate 50 ng of the purified digest plasmid with 1, 2 or 4 μL of the annealed primers in ligation reaction with T4 ligase in 10 μL final volume reaction as indicated in Table 2[href=https://www.wicell.org#tbl2] and incubate the ligation reaction at 16°C for 16–18 h.\nNext day transform 3 μL of the ligation reaction (keep the rest at −20°C) into E. coli highly competent TOP10 bacteria (Invitrogen) following the manufacturer protocol (https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2Foneshottop10_chemcomp_man.pdf[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2Foneshottop10_chemcomp_man.pdf]). Alternatively, use chemically prepared laboratory competent bacteria. Plate all the transformation mix (∼150 ul) onto LB agar plates containing ampicillin (100 μg/mL) and incubate 16–18 hrs at 37°C. Check the following day for colony formation.",
    "Pick at least 10 colonies and inoculate in 5 mL of LB medium with ampicillin (100 μg/mL) and grow 16–18 hrs.\nNext day extract the plasmid using mini prep kit (Qiagen).\nNote: store 100 μL of the 16–18 hrs culture for maxi prep with Endotoxin free Qiagen kit.\nPositive clones are identified by DNA Sanger sequencing (Saifaldeen et al., 2021[href=https://www.wicell.org#bib4]) using a pair of forward and reverse primers (see key resources table[href=https://www.wicell.org#key-resources-table]).\nThe 100 μL of stored culture carrying the correct plasmid PX330 with the Cas9 and the specific guide RNA can be subcultured into 100 mL of LB with Amp and used for Maxi prep Endotoxin free (Qiagen) to isolate a sufficient amount of the plasmid expressing the gRNA for transfection.\nCritical: It is important to test different gRNAs and use the best gRNA with high efficiency of gene editing determine by the T7EI assay. For the cloning reaction, it is important to troubleshoot with different amount of digested plasmid and annealed primers.\ntable:files/protocols_protocol_1474_1.csv\ntable:files/protocols_protocol_1474_2.csv\nTransfection of HEK293 cells with PRDX1 CRISPR components for gene deletion.\nHEK293 cells are cultured in complete media to 80% confluency.\nThe cells were collected by trypsinization using TrypLE, resuspended in DMEM with 10% FBS medium without antibiotics and counted using cell counter.\nCoat 24-well plate with 500 μL of 0.1% of sterile filtered gelatin for 10 mins at 37°C and dry the wells by aspirating the gelatin using aspiration pump.\nNote: the coat with 0.1% gelatin is optional but we found that coating with 0.1% improve the efficiency of the transfection and thus the efficiency of editing.\nSeed ∼ 80,000 living cells in 500 μL of media into the coated 24-well plate. Cells are left to adhere 16–18 hrs.",
    "Next day cells are transfected with the indicated plasmid (e.g., pCas9-gRNA-PRDX-1) using Fugene HD (Promega) reagent in Opti-MEM. The transfection master mix is prepared as follow, 2 μL of pCas9-gRNA-PRDX1 (500 ng/μL) + 20 μL of Opti-MEM + 3.4 μL Fugene HD mix by pipetting and incubate 7 mins at 22°C–25°C.\nAdd the final master mix to each well and shake the 24 well plate by hands.\nIncubate at 37°C for 48–72 hrs (see Figure 2[href=https://www.wicell.org#fig2]).\nAfter the 2–3 days post-transfection, collect cells from each well by trypsinization, centrifugation and resuspend in 1 mL of complete DMEM GlutaMax media (Figure 2[href=https://www.wicell.org#fig2]).\nSave some of the cells (1,000 cells) to isolate single cell colonies with potential PRDX1 knockout (See step 6) and centrifuge the remaining cells to be used for extracting genomic DNA using the Quick Extract DNA extraction kit, which will be used to verify and calculate the gene editing efficiency using T7EI assay (See step 5) (Figure 2[href=https://www.wicell.org#fig2])\nCritical: Note we recommend transfection with a GFP or m-RFP expressing plasmid in separate wells for monitoring transfection efficiency of the suggested protocol with the chosen cell line followed by fluorescence microscopy 48–72 hrs post-transfection.\nNote: pSpCas9(BB)-2A-GFP (PX458: Addgene# 48138) can be used simultaneously to monitor the transfection efficiency as well as to perform the specific editing with the specific gRNA.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1474-Fig2.jpg\nFigure 2. Workflow to follow to engineer PRDX1 knockout in HEK293 using CRISPR-Cas9 system\nThe editing activity is tested by T7EI assay in cells un-transfected or transfected with pgRNA-1-PRDX1-Cas9, or pgRNA-2-PRDX1-Cas9 or pgRNA-3-PRDX1-Cas9 (Created with BioRender.com[href=http://BioRender.com]).\nT7EI assay to assess the gene editing efficiency\nExtract the genomic DNA from the transfected cells (4i) using Quick Extract DNA (Aouida et al., 2015[href=https://www.wicell.org#bib1]; Lee et al., 2017[href=https://www.wicell.org#bib3]).",
    "Use 1 μL of the extracted genomic DNA as a template to amplify the gene of interest; PRDX1 generated a fragment of 703 bp using a pair of primers (key resources table[href=https://www.wicell.org#key-resources-table]) and the Accuprime High fidelity enzyme following the instructions of the manufacturer (https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2Faccuprimetaqhifi_man.pdf[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2Faccuprimetaqhifi_man.pdf]) (Table 3[href=https://www.wicell.org#tbl3]) and the PCR program indicated in Table 4[href=https://www.wicell.org#tbl4].\ntable:files/protocols_protocol_1474_3.csv\ntable:files/protocols_protocol_1474_4.csv\nLoad 5 μL of the PCR reaction onto a 1% agarose gel pre-stained with SYBER safe to confirm the PCR amplification of the target gene (e.g., PRDX1) and purify the remaining PCR reaction using QIAGEN PCR purification kit. Elute the PCR product using 35 μL of H2O that is DNase/RNase free.\nQuantify the PCR amplified DNA using Nanodrop and normalize the concentration to 12 ng/μL.\nPrepare the reaction that is required for the T7EI assay as indicated in Table 5[href=https://www.wicell.org#tbl5]. Denature the total reaction follow by renaturation and digestion with the T7 endonuclease (T7EI) according to the conditions indicated in Table 5[href=https://www.wicell.org#tbl5] and incubate at 37°C for 1 h (Aouida et al., 2015[href=https://www.wicell.org#bib1]; Lee et al., 2017[href=https://www.wicell.org#bib3]).\ntable:files/protocols_protocol_1474_5.csv\nAdd 6 μL of DNA loading dye (0.5 M EDTA with 6× DNA loading dye) to the reaction, and load the entire content onto a 2 % agarose gel. Run the gel until the bands are well separated, typically 1 hr at 110 V. When imaging the gel, make sure that the exposure time is properly adjusted so that none of the bands is saturated as this will interfere with accurate quantification of the band intensities (Figure 2[href=https://www.wicell.org#fig2]).",
    "Estimate the gene editing activity using the free software ImageJ. The percent of alleles that show evidence of NHEJ can be calculated from the band intensities according to the formulas reported by Lee et al. (2017)[href=https://www.wicell.org#bib3]. The gene editing efficiency and specificity can be confirmed by Sanger sequencing using Topo-TA cloning kit and M-13 forward and Reverse primers (key resources table[href=https://www.wicell.org#key-resources-table]).\nCritical: To evaluate the gene editing activity by T7EI assay for PRDX1 gene or any other gene targeted with CRISPR-Cas9 system, the PCR amplification of the target should be specific and always do a PCR optimization to determine the Tm that amplify the specific DNA fragment.\nSingle cell cloning of PRDX1 transfected HEK293 cells\nCount the transfected cells and serially dilute the cells in culture media to achieve a final concentration of 1,000 cells/mL. Dispense 100 μL of cell suspension (∼100 cells) into 150 mm tissue culture plates (Figure 2[href=https://www.wicell.org#fig2]).\nTop up the plates with enough volume (25 mL) of complete culture media.\nIncubate the plates for 10–15 days to form visible and separate colonies (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1474-Fig3.jpg\nFigure 3. Steps for single colony expansion\nWorkflow of PRDX1 knockout for (i) colony expansion (ii) colony storage (iii) Western blot for Prdx1 protein expression and (iv) colony Sanger sequencing for PRDX1 gene to identify the mutations (Created with BioRender.com[href=http://BioRender.com]).\nAfter enough colony expansion, the visible colonies can be picked up by 10 μL pipette with 5 μL of TrypLE (Pick up only colonies that are very well separated from others to avoid cross contamination).\nTransfer each of 24 single colonies into separate wells of a 24 well plate for expansion (2–3 days). Expand the single colonies further by transferring the cells to 6-well plates and then finally to Sterile Cell Culture/Petri Dishes 100×15 mm (Figure 3[href=https://www.wicell.org#fig3]).",
    "Store some of the expanded single colonies in storage media (50% FBS, 40% DMEM-GlutaMax, 10% DMSO) for further use that include total protein extract for immunoblot analysis (see Figure 3[href=https://www.wicell.org#fig3] for anti-PRDX1). Collect some cells for genomic DNA extraction using the Quick Extract DNA extraction kit for PCR amplification using a primer-pair (Key resources table for PRDX1). Purify the PCR product and proceed with sanger sequencing to identify the type of mutation (see Figure 3[href=https://www.wicell.org#fig3] and section 8)\nCritical: For colony isolation, we strongly recommend using the Sterile Petri Dishes for cell culture with a large size such 150×25 mm to have enough separation between the clones and to avoid any cross contamination between the colonies.\nPRDX1 knockout verification by immunoblot.\nHarvest enough cells from a culture dish or a T75 flask at 70–80% confluency.\nDiscard the culture media and wash twice with 1× PBS.\nAdd 1 mL of TrypLE to trypsinize the cells and incubate at 37°C for 1–2 mins. Do not leave TrypLE for extended periods.\nAdd 5–10 mL media to collect the cells and transfer them to a 15 mL tube.\nCentrifuge at 201×g for 3 mins in Eppendorf centrifuge 5810. Discard the supernatant. Add 200 μL of ice-cold RIPA lysis buffer supplemented with 1% of 100 × Protease Inhibitors and mix gently by pipetting up and down. Incubate on ice for 5 mins. Transfer the lysate to a pre-chilled micro-centrifuge tube. RIPA lysis buffer\ntable:files/protocols_protocol_1474_6.csv\nStorage 4°C",
    "Sonicate twice at 40% amplification for 5 seconds. Clean the sonication probe with dH2O before and after every use. Note that sonication generates heat which might disturb your proteins, therefore let the samples chill on ice between sets. Make sure the sample is fully submerged but do not let the probe touch the sides or the bottom of the tube.\nCentrifuge the tubes at 9,391×g for 10 mins at 4°C in an Eppendorf microcentrifuge 5424R. Transfer the supernatant to a new micro-centrifuge tube. Keep the samples on ice.\nQuantify your proteins using pierce BCA protein assay kit (Thermo Fisher). Mix 20–30 μg of your protein with 4 μL 5 × Laemmli loading buffer and up to 20 μL dH2O in a microcentrifuge tube. 5 × Laemmli loading buffer\ntable:files/protocols_protocol_1474_7.csv\nStorage 22°C–25°C\nPlace the tube on a thermal mixer at 95°C for 5 mins to denature the proteins. Load 3 μL of the ladder followed by 20 μL from each sample in each well of a 12.5% Acrylamide gel. 12.5% Acrylamide gel\ntable:files/protocols_protocol_1474_8.csv\nFreshly prepared\nRun the gel at 90 V for 130 mins. Transfer the proteins to a nitrocellulose membrane in Transfer Buffer using Trans-Blot Turbo Transfer System (BioRad) at 1.3 A and 25 V for 10 mins Transfer buffer\ntable:files/protocols_protocol_1474_9.csv\nStorage 22°C–25°C\nWash the membrane with dH2O a few times to remove any gel residue. Block the membrane in 5% milk 1 × TBST for 30 mins.\nIncubate the membrane with rabbit anti-PRDX1 primary antibody (Cell signaling) at 1:2,000 dilution 16–18 hrs at 4°C.\nWash the membrane three times with 1× TBST, 10 mins each.\nIncubate the membrane with anti-rabbit HRP secondary antibody (Jackson Immuno-research) at 1:5,000 dilution for 1 h at 22°C–25°C.\nWash three times with 1 × TBST, 10 mins each.",
    "Visualize using Pierce™ ECL Western Blotting Substrate (Thermo Fisher) (Figure 4[href=https://www.wicell.org#fig4]).\nPrdx1 knockout verification by Sanger sequencing.\nTake the PCR product from section 6f and subject it to Topo-TA cloning following the manufacturer instructions (https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2Ftopotaseq_man.pdf[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2Ftopotaseq_man.pdf]).\nTransformations of the Topo-TA cloning product in Top10 competent bacteria and colony selection on solid LB + Kanamycin (50 μg/mL) plates or on solid LB + Ampicillin (100 μg/mL).\nSelect five colonies and inoculate into 5 mL of LB + Kanamycin (50 μg/mL) followed by miniprep plasmid DNA extraction (Qiagen mini prep kit).\nPerform Sanger sequencing using M-13 primers (key resources table[href=https://www.wicell.org#key-resources-table]) and using the protocol described by Saifaldeen et al. (2021)[href=https://www.wicell.org#bib4].\nUse SnapGene or any other DNA analysis software in order to determine the mutations (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1474-Fig4.jpg\nFigure 4. Characterization of 3 prdx1 knockout derived from gene editing using CRISPR-Cas9 system by western blot analysis\n(A) prdx1 knockout derived from CRISPR-Cas9-gRNA-1.\n(B) prdx1 knockout derived from CRISPR-Cas9-gRNA-2,\n(C) prdx1 knockout derived from CRISPR-Cas9-gRNA-3.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1474-Fig5.jpg\nFigure 5. Characterization of 3 prdx1 knockouts derived from gene editing using CRISPR-Cas9 system by Sanger sequencing analysis\n(A) prdx1 knockout derived from CRISPR-Cas9-gRNA-1.\n(B) prdx1 knockout derived from CRISPR-Cas9-gRNA-2.\n(C) prdx1 knockout derived from CRISPR-Cas9-gRNA-3."
  ],
  "subjectAreas": [
    "Biotechnology And Bioengineering",
    "Cell Isolation",
    "Crispr",
    "Cell Culture",
    "Cell Biology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}