{
  "id": 1580,
  "origin_website": "Cell",
  "title": "Efficient acquisition of tens of thousands of short tandem repeats in single-cell whole-genome-amplified DNA",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nSTR target enrichment\nTiming: [2 days]\nIn this step, we enrich all the designed targets from every single cell WGA DNA in 96 well plates.\nHybridization\nMake Hybridization Mix with 200–500 ng of single cell WGA DNA (∼2 μL) per reaction. Note that single cell WGA product concentration is generally 100–200 ng/μL in our hands.\nFor large scale experiments, prepare Hybridization Master Mix according to the following table without WGA DNA. Distribute 8μL Hybridization Master Mix per well of a 96-well plate. Add 2 μL DNA or ddH2O to each well and mix by liquid handling system (Evoware, Tecan) or manually.\ntable:files/protocols_protocol_1019_7.csv\nPlace the reaction plate into a PCR machine with 100°C lid temperature. Heat at 98°C for 3 min and ramp the temperature at 0.01°C per second to 56°C.Then, incubate at 56°C for 17 h. An example in our PCR machine is shown below.\ntable:files/protocols_protocol_1019_8.csv\nGap filling\nPrepare Gap Filling Mix half an hour before hybridization finishes. See table below.\ntable:files/protocols_protocol_1019_9.csv\nKeep the mix at 56°C on a heat block\nTransfer reaction plate from the PCR machine to a 56°C heat block when the hybridization step is finished.\nAdd 10 μL of Gap Filling Mix to each well, carefully mix by pipette, seal tightly and quickly return plate to the PCR machine.\nRun a 4-h 56°C incubation, deactivate for 20 min at 68°C, then keep at 4°C until next step.\nPause point: After the gap filling step, the reaction plate can be stored at 4°C fridge for up to two days.\nDigestion of linear DNA:\nPrepare Digestion Mix 15 min before gap filling ends.\ntable:files/protocols_protocol_1019_10.csv\nRetrieve reaction plate from PCR machine. Note: take care when removing cover.\nAdd 2 μL of the Digestion Mix to each well and mix.",
    "Spin down the reaction plate and seal.\nIncubate at 37°C for 60 min, 80°C for 10 min and 95°C for 5 min.\nPause point: the reactions can be stored at −20°C for at least 2x months after the digestion step.\nCritical: Seal the plate tight, avoid evaporation.\nLibrary preparation and sequencing\nTiming: [4 days]\nIllumina sequencing adapters and unique barcode per cell are added by a barcoding PCR. Then all the samples are pooled into one tube in equal volume and then equal molecular concentration. The pools are size selected by Blue Pippin to remove dimmers and by products. library pools passed quality control are sequenced on MiSeq or NextSeq with default illumine sequencing primers.\nSample specific barcoding PCR\nNote the structure of the dual-index Illumina barcoding primers used in the experiments:\ni5-index-primer: AATGATACGGCGACCACCGAGATCTACAC[i5-8bp-index]ACACTCTTTCCCTACACGACGCTCTTCCG;\ni7-index-primer: CAAGCAGAAGACGGCATACGAGAT[i7-8bp-index]GTGACTGGAGTTCAGACGTGTGCTCTTCCG;\n2 μL product from the previous step (step 3) are amplified with a pair of unique barcoding primers for each sample in a reaction as shown below.\ntable:files/protocols_protocol_1019_11.csv\ntable:files/protocols_protocol_1019_12.csv\nSample pooling and Purification for Diagnostic Sequencing\nClean up barcoded PCR product in a 96-well plate using 0.8× AMPure XP SPRI magnetic beads (Beckman Coulter) according to manufactory’s manual by Tecan liquid handling system, eluted in 40 μL ddH2O.\nPool equal volumes (usually take 2 ul) of purified samples manually.\nConcentrate the pool by MinElute according to manufacturer instructions, elute with 35 μL ddH2O.\nSize Selection for Diagnostic Sequencing\nRetain 3 ul of the concentrated pool for quality control in step 5.\nRun 30 μL of the concentrated pool on a lonza 2% V1 cassette BluePippin (Sage Science) with setting range 240–340 bp according to manufactory’s protocol. Agarose gel extraction in the range of 240–340 bp can serve as an alternative.\nPurify size-selected elution by MinElute, elute with 15 μL ddH2O.",
    "Measure concentration by Qubit dsDNA HS (High Sensitivity) assay kit. Troubleshooting 1[href=https://www.wicell.org#sec5.1]\nInspect size distribution of the concentrated pool before and after size selection using a Tape Station dsDNA chip (Figure 2[href=https://www.wicell.org#fig2] is a reuse of panel 1 in Supplementary Figure 1 from our Cell Reports Methods paper (Tao et al., 2021[href=https://www.wicell.org#bib1]) and confirms a single peak around 300 bp. Troubleshooting 2[href=https://www.wicell.org#sec5.3]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1019-Fig2.jpg\nFigure 2. Quality control of sequencing library\nDilute size-selected pool to make 12 μL of 4 nM (4 fmol/μL) library for Illumina NGS calculated based on the concentration and average size reported by the Tape Station.\nDiagnostic sequencing (∼17 h for sequencing, ∼2 h for analysis) Troubleshooting 5[href=https://www.wicell.org#sec5.9]\nSequence at 10 pM loading concentration. We recommend to run on a 300 cycle MiSeq Nano flow cell in pair end mode. Set Read1 and Read2 as 151, and both Index1 and Index2 reads as 8. Minimum read length we have tested is 125 × 2 pair end to allow sequencing through the repeat regions of most STRs in our design. Default sequencing primers suffice for sequencing.\nFollowing bcl2fastq demultiplexing, merge overlapping Read1 and Read2 with the following command:\n    >pear -v 40 -m 300 -f fastq1 -r fastq2 -o\npear_files_prefix\nMap merged reads against customized STR reference (as shown in Figure 3[href=https://www.wicell.org#fig3]) of all amplicons with bowtie2, each appearing multiple times, once with every possible STR length.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1019-Fig3.jpg\nFigure 3. MS reads mapping\nEach read is mapped to a specific target locus according to its flanking regions.\n    >bowtie2 -x index_files_prefix -U merged_fastq |\nsamtools view -bS - | samtools sort -o\nsorted_assignment_bam\nFor more details, parallel execution and integration to the clineage analysis system, please see the codes at: https://github.com/shapirolab/clineage/blob/master/sequencing/analysis/full_msv/full_msv.py[href=https://github.com/shapirolab/clineage/blob/master/sequencing/analysis/full_msv/full_msv.py]\nExtract the total number of reads per sample from “sorted_assignment_bam” with pysam.\nBalancing reads per sample",
    "Calculate the scaling volume for each sample based on the total number of reads extracted from the diagnostic sequencing result to equalize the read coverage per sample. For example, sample A got 500 reads, sample B got 1000 reads in the diagnostic sequencing, to equalize the read coverage in the following production sequencing, we can pool 2 ul sample A with 1 ul sample B.\nAccording to the scaling volume, pool purified samples from step (5a) manually or by Echo550, then concentrate by miniElute, elute in 35μL ddH2O.\nPrepare production sequencing library for pooled samples as in step (6).\nProduction sequencing (∼29 h for sequencing)\nThe minimum reads per samples is 1M, and the minimum read length is 125 × 2 pair end. We recommend to sequence up to 200 samples on one NextSeq500 high output flow cell with 151×2 pair-end run parameters according to manufactory manual and relying on default sequencing primers. Set both Index1 and Index2 as 8. Load at 1.8–2.2 pM concentration. (Figure 3[href=https://www.wicell.org#fig3])\nOptional: If the production sequencing doesn’t generate enough reads for some samples (i.e over 1M reads for samples enriched with the OM6 panel), another round of NextSeq could be conducted using the same library for these samples. Consider Hiseq or NovaSeq platforms for large scale projects."
  ],
  "subjectAreas": [
    "Genomics",
    "Molecular/Chemical Probes",
    "Molecular Biology",
    "Sequencing",
    "Single Cell",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}