{
  "id": 13241,
  "origin_website": "Jove",
  "title": "Genotyping and Quantification of In Situ Hybridization Staining in Zebrafish",
  "procedures": [
    "Procedures involving animal subjects are regulated by the Animals (Scientific Procedures) Act 1986 and have been approved by the Home Office and the local Animal Welfare and Ethical Review Body.\n1. Image ISH-stained embryos\nPrepare a glycerol solution (50%–80% in 1x PBS buffer) and mix to homogenize the solution (e.g., leave in a roller for at least 5 min). This solution can be kept for months at room temperature.\nAfter in situ hybridization14,15,16,17, transfer embryos to the glycerol solution with a 3 mL Pasteur pipette and leave to settle for at least 5 min. If imaging embryos older than 24 hpf (hours post fertilization), they may be bleached as described18.\n\t\nPrepare and label enough PCR tubes to transfer ISH-stained embryos after imaging.\nAdd 100% glycerol to the bottom of the well in a glass depression slide with a 3 mL Pasteur pipette.\nUsing a 3 mL Pasteur pipette, transfer a single ISH-stained embryo to the glass slide and orient as required under a stereomicroscope equipped with a digital camera and bottom and top illumination.\n\tNOTE: Use gel loading pipette tips to position the embryos for imaging, but other tools (e.g., forceps, dissecting needle) will be equally adequate.\nUsing the first embryo, adjust the illumination and exposure time at the desired magnification. Use these conditions for ALL of the embryos in the same experiment (i.e., if imaging 40 embryos from a heterozygous mutant incross, make sure the illumination, exposure time and magnification are the same for all).\nImage as many embryos as required. Label each image with a unique number. After imaging, transfer the embryo to a PCR tube/plate labelled with the same number.\n\tNOTE: Images should be saved as TIF files, but other formats are also adequate.\n\t\nIf required, remove excess glycerol in the PCR tubes/plates.",
    "NOTE: At this point, the embryos can be stored in the PCR tubes for several weeks at room temperature.\n2. Extract DNA and genotype the ISH-stained embryos\nNOTE: Here, use a reliable and inexpensive method to isolate genomic DNA based on the HoTSHOT method19 with a DNA extraction efficiency of 95%-100%3.\nAfter the imaging is complete, add 40-75 µL of alkaline lysis buffer (e.g., HoTSHOT) to each tube.\nIncubate at 95 °C for approximately 30 min and cool the tubes to 4 °C before adding an equal volume of neutralization buffer. An overnight incubation at 4 °C may improve PCR efficiency.\n\tNOTE: At this point, the genomic DNA can be used for genotyping or stored at -20 °C until it is required.\nGenotype samples with an appropriate method (e.g., HRMA, RFLP)3,20,21 as required for the mutation of interest.\nNote the genotype corresponding to each sample (e.g., using a spreadsheet software).\n3. Quantify the pixel intensity of ISH-stained embryos (image analysis using Fiji software)\nTo quantify the in situ hybridization (ISH) staining signal intensity, convert all images to 8-bit grayscale as described3. If the images were saved as .TIF files, use a Fiji macro for batch conversion3. Alternatively, convert images in other formats (e.g., .JPG) to .TIF using appropriate software and then convert to 8-bit grayscale using Fiji. For convenience, here is the step-by-step procedure that was published previously3, with some alterations.\nOpen images in Fiji and invert the image with Edit > Invert. Then change the image type to 8-bit (Image > Type > 8-bit).\nUsing the polygon selection tool, draw the region of interest (ROI) manually on the image around the region containing the signal.",
    "Press t to open the ROI manager. Use the ROI manager's Measure command to measure the intensity of the ROI. Copy the mean value from the Results window to a spreadsheet software.\nMove the same ROI, ensuring the same size and shape as the original region, to a region of the zebrafish not containing any staining. Repeat step 3.4 to measure the background.\nTo obtain the mean pixel intensity of the ISH signal, subtract the mean intensity value of the background region from that of the stained region for each embryo.\nAssign each intensity value to a genotype (from step 2.3).\n4. Analyze the results with appropriate statistical tests\nPlot all the values on one Q-Q plot to identify any deviations from normal distribution.\n\tNOTE: Normal distribution can also be verified with the Kolmogorov-Smirnov test or the Shapiro-Wilk test. However, for large sample sizes there is a high risk of false positives in these tests.\nIf there are strong deviations from normal distribution, transform all the values (using ln or sqrt functions) to make sure they are normally distributed before proceeding.\nAnalyze the differences between the values (transformed if necessary) assigned to each genotype (wt vs. heterozygote vs. mutant) with 2-tailed ANOVA with 95% confidence levels, accounting for the equality of variances with a Levene's test and Welch correction. For pairwise comparisons between each pair of genotypes, use Tukey's (equal variances) or Games-Howell (unequal variances) post-hoc test.\n\t\nIf the values are not normally distributed despite the transformation, use a non-parametric test (Kruskall-Wallis) to analyze the differences between ranked values and a post-hoc Dunn's multiple comparisons test with Bonferroni correction for pairwise comparisons.\nPlot the untransformed values (from step 3.6) as dot plots for the best representation of the results."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}