{
  "id": 9397,
  "origin_website": "Jove",
  "title": "Functional Interrogation of Adult Hypothalamic Neurogenesis with Focal Radiological Inhibition",
  "procedures": [
    "Animal Usage\nObtain approval from institutional Animal Care and Use Committee for standard care and use protocols. The current protocol was developed for focal irradiation studies on 5.5-10 week old adult C57BL6/J mice, as previously described (Figure 2)2. However, other ages and small animal species (rats, hamsters, ground squirrels, etc.) can also be used, provided that effective anesthesia protocols and a radiographic reference atlas allowing identification of the region of interest (ROI) are available.\n1. Calibration of CT-guided Radiological Platform\nPerform film-based calibrations for radiation dose on the radiological platform in advance for each collimator size and type of X-ray tube filter used. In order to target an arc beam of irradiation at the desired target site, use the radiation dose-planning software49 available on most commercial radiation platforms to calculate required delivery time based on the radiation dose, the depth of the region of interest (ROI) based on CT scans of the mouse, and the rotation speed of the robotic platform; details on this are left out of this protocol as they differ between radiation platforms. For the purposes of visualizing the ventrobasal hypothalamus2 (Figure 3) with CT imaging, operate the X-ray tube with a 0.4-mm focal spot and beam energy of 100 kVp with 1 mm Al filtration. For focal irradiation of the HPZ, operate the X-ray tube at 225 kVp, 13 mA, and a 1-mm focal spot with filtration of 0.15 mm Cu, to deliver 10 Gy of radiation at a tissue depth of 0.6 cm over a treatment time of 4.6 min. Targeting between different ROIs will require calculating different parameters.",
    "If studying the effects of high-fat diet on neurogenesis in the median eminence as previously described2, obtain four-week-old female C57BL6/J mice from Jackson Mouse laboratories, and house four mice per cage. Switch food from normal chow to a high-fat diet at five weeks old. Allow mice to acclimate to new housing and food. Perform CFIR treatment at 5.5 weeks old. Transport subjects to the operation room that contains the radiological platform. Minimize stress levels during transfer. Prepare isoflurane gas anesthesia chamber. Then, add a single mouse into chamber. In parallel, prepare heating pad (low setting) for post-treatment.\nOnce mouse is under and no longer responding to foot-pad compression, bring the subject to the radiological platform and place on the immobilization bed of the robotic stage. Place subject's mouth into the nose-cone anesthesia cup, and teeth into the bite guard (Figure 1D). Lay mouse flat on the immobilization bed and check to see if it continues to maintain unresponsiveness. If so, tape down mouse to the bed with gauze tape. While taping down the mouse to the bed, make sure the head is leveled to a horizontal plane. This can be determined by pulling up the ears and seeing if they are leveled. Once the mouse is in the correct position, close the lead protective shield.\nAcquire the computer-tomography scan using on-board software of the experimenter's radiological platform (this will differ between platforms), which will provide a three-dimensional anatomical structural scan of the mouse subject. Check to see if the mouse head is leveled to the horizontal plane. If not, repeat steps 1.2 - 1.3 until the subject's head is leveled.\nIdentify ROI by CT image. Calculate distance from ROI to the surface of the skull using a 45° angle to the horizontal plane as shown in Figure 3E.",
    "Using on-board software, take an X-ray of the mouse subject from above as shown in Figure 4A. Then, remove mouse from the radiological platform, put on heating pad, and monitor until active.\nFrom the coronal CT images, calculate the average ROI anatomical depth of at least three mice in order to determine delivery dosing. As an example from a previous study2 where 10 Gy of irradiation was administered to the ventrobasal hypothalamus, the depth of the ROI from the skull (from a 45° angle) is 0.66 cm (See Figure 3E). Knowing that, the researchers used the dose planning software (DPS) installed on their radiological platform to calculate the appropriate rotation speed and length of treatment to achieve desired dosage to the ROI.\nAfter determining treatment duration and rotation speed of the robotic stage with the dose-planning software, measure dose distributions of the calculated parameters with GAFchromic radiation-sensitive films embedded in a water-equivalent plastic mock-mouse model. To do this, embed three GAFchromic radiation-sensitive films between four vertically stacked water-equivalent plastic blocks29 as shown in Figure 4B.\nPlace mock mouse model containing GAFchromic films on robotic stage, and run the focal irradiation beam with the newly calculated parameters. For example, to target the ventrobasal hypothalamus, input the parameters of 0.15 mm Cu filter, 225 kVp, 13 mA, 1-mm diameter radiation beam setting, 45° gantry angle, 1.3°/sec rotation, and 4.6 min to achieve an ROI radiological dose of 10 Gy.",
    "Following irradiation, check films for pattern and intensity of radiation dosage. For a 360° angle rotation with the parameters listed to target the ventrobasal hypothalamus, a dark ring in the film above the isocenter, a small crisp spot at the isocenter film, and a lighter ring in the film below the isocenter corresponding to the cone-beam administration of the irradiation will be observed (Figure 4B).\nSuperimpose isocenter GAFchromic film over the X-rays of mouse subjects from which the parameters were calculated. The irradiated focal point at isocenter should overlap with the desired ROI region as shown in Figure 4C.\nAlternative method: If difficulty in targeting brain ROI persists, use iodine contrast injected intrathecally to enhance visualization of ventricles under CT images. For the sake of brevity, this procedure is left out of this protocol, but is previously described35, 50. Iodine contrast will provide additional ventricular landmarks (Figure 5A).\n2. Determining Accuracy of Irradiation Beam\nFurther confirm CFIR beam accuracy by direct visualization of the radiation beam in tissue2, 35, 51. To do this, perform immunohistochemistry to detect γH2AX 51, a histone protein and an early marker of DNA double strand breaks. Mouse subjects must be transcardially perfused and fixed within one hour of irradiation. Following irradiation, DNA repair rapidly ensues, and levels of ϒH2Ax decrease significantly35.\nRepeat steps 1.1 - 1.3.\nAfter the target is identified on CT, the mouse subject is moved under robotic control to align this target with the radiation delivery beam. Input calculated parameters (rotation speed and length of treatment to achieve desired dosage) from step 1.6 into dose-planning software and begin treatment. Treatment is delivered with the gantry pointed to 45° from the vertical while the mouse rotates about a vertically-oriented axis.",
    "Following irradiation, perform transcardial perfusion on mouse subjects. Perform perfusion within one hour52. Following perfusion, immersion fix brains in 4% PFA/PBS and gently rock overnight at 4 °C.\nThe following morning, wash 5 min in PBS 3x to remove paraformaldehyde fixative. Then, immerse in 30% sucrose in 1x PBS on a rocker at 4 °C.\nGently rock at 4 °C (usually 12-16 hr), until brain sinks to bottom of tube. This serves as a cryoprotection step. Once brains sink, remove brain with a perforated spoon to prevent excess 30% sucrose/1x PBS transfer. Quickly embed in freezing medium on dry ice. Swirl freezing medium with pipette tip and align brain in plastic mold.\nOnce completely frozen, transfer brain blocks to -20 °C freezer for storage.\nOn the day when immunohistochemistry will be performed, section coronally at 40 μm thickness, and float into a 24-well plate containing PBS with a thin paintbrush. Sections should be kept in correct serial order for immunostaining to determine irradiation coverage of target region.\nPrewarm 0.01 M sodium citrate solution to 80 °C in water bath in preparation for antigen retrieval step. Simultaneously, while the sodium citrate is warming, perform 5 min washes 3x in 0.01 M PBS.\nOnce sodium citrate solution is at 80 °C, submerge brain sections in the sodium citrate buffer solution. Leave in water bath at 80 °C for 1 hr.\nRemove section and allow sodium citrate solution to reach room temperature, then perform three 5-minute washes in 0.01 M PBS.\nBlock brain sections for 1 hr in PBS-Triton containing 5% normal goat serum.\nIncubate brain sections overnight in PBS-Triton containing 5% normal goat serum with 1:700 concentration of mouse anti-phospho-H2AX primary antibody at 4 °C.\nThe next day, perform 15 min washes 3x in 0.01 M PBS-Triton.",
    "Incubate brain sections PBS-Triton containing 5% normal goat serum with goat anti-mouse secondary antibody conjugated with 488 nm fluorphore at 1:500 concentration for 2 hr.\nPerform 15 min washes 3x in 0.01 M PBS-Triton.\nPerform 4',6-diamidino-2-phenylindole (DAPI) stain (1:5,000 in PBS) for 10 min to visualize nucleus. Then, wash brain sections for 5 min with PBS.\nMount on electrostatically charged microscope slides by floating section in PBS. Wipe off excess PBS and allow slides to dry. Coverslip the slides using mounting medium and allow the slides to dry in the dark at room temperature overnight.\nTake pictures of serial coronal sections with fluorescent microscope. ϒH2Ax immunostaining (green) indicates site of irradiation. DAPI (blue) is a nuclear stain (Figure 5B).\n3. Preparation of Mouse Subjects for Focal Irradiation\nExamine ϒH2Ax immunostaining results. Once satisfied with the calibration and targeting of the irradiation beam, proceed with the experiment. At this point, the total time required to treat a mouse (from animal setup to completion of beam delivery) is approximately 10-15 min for a 10-Gy treatment with a 1-mm beam.\nOrder four-week-old C57BL6/J female mice from Jackson Mouse laboratories. House four mice per cage, and switch food from normal chow to a high-fat diet at five weeks old. Ear punch mice to give them unique identifying marks. Monitor health of mice daily. Note: metallic markers cannot be used as they will result in streaking artifacts on the CT.\nWeigh mice the day before radiation or sham treatment. Split mice into two cohorts for radiation or sham treatment and ensure that there is no significant difference in weight between cohorts. On the day of treatment, when mice are six weeks old, reweigh all mice and record their mass. Gently transport both cohorts to the radiological platform. Take care to minimize stress levels.",
    "Prepare isoflurane gas anesthesia chamber. Anesthetize two mice, one in the predetermined irradiation group, and another in the sham control group. Prepare heating pad set in the low setting for postoperative treatment.\nFollow steps 1.2 - 1.4 for the mouse to receive irradiation. For the sham mouse, keep mouse in anesthesia chamber while treatment is going on. Make sure that anesthesia chamber is near the CFIR platform so any effects on ambient radiation are factored in. After the target is identified on CT, move mouse subject under robotic control to align this target with the radiation delivery beam. Input calculated parameters (rotation speed and length of treatment) into dose-planning software.\nOnce irradiation treatment is complete, return both sham and irradiated mice to heating pad, and monitor until they wake up.\nReturn both sham and irradiated mice to animal facility. Monitor every day. Weigh the mice every half week. To confirm irradiation of targeted hypothalamic proliferative zone, administer intraperitoneal injections of BrdU (50 mg/kg) three days post-treatment and examine neurogenesis between groups by colabeling of immunohistochemistry for BrdU and a neuronal marker one month following initial BrdU exposure (Figure 6)2.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}