{
  "id": 1607,
  "origin_website": "Cell",
  "title": "A new flow cytometry assay to measure antibody-dependent cellular cytotoxicity against SARS-CoV-2 Spike-expressing cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation of the experiment and the cells\nTiming: 2 h\nThis section describes how to plan your experiment, how to calculate the appropriate number of cells and on what conditions to thaw the PBMCs.\nCalculate the number of cells you will need for your experiment. You will need 5 × 104 CEM.NKr parental cells, 5 × 104 CEM.NKr.Spike cells and 1 × 106 PBMCs per condition. An example of a typical template can be found in Figure 2[href=https://www.wicell.org#fig2]A and can greatly help for the calculations and design of the experiment.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1044-Fig2.jpg\nFigure 2. Template of the designed experiment\n(A) The template is showing the number of wells required for the experiment and how to identify them.\n(B) The template is showing in what wells to add the effector cells (PBMCs) or the supplemented RPMI 1640 media.\n(C) The template is showing in what wells to add the appropriate target cells.\n(D) The template is showing the volume of each specific antibody to add in each specific well.\nOne day before the planned experiment, look at your cells. They should be nice and round. If the cells are in nice condition proceed to step 3.\nCount the target cells to make sure you have enough cells to conduct the experiment. If you do not have enough cells, wait a few more days. If the CEM.NKr parental and/or CEM.NKr.Spike cells doesn’t grow, please refer to the troubleshooting[href=https://www.wicell.org#troubleshooting] section (problem 2[href=https://www.wicell.org#sec7.3]).\nIf you have enough cells, thaw the PBMCs.\nTake a sterile 15 mL tube and pipette 10 mL of supplemented RPMI 1640 media in the tube.\nTake the cryogenic vial containing the PBMCs and put it in a hot-water bath at 37°C.",
    "Wait a few moments (1 or 2 min) until the cells are no longer frozen.\nQuickly pour the content of the vial in the tube.\nCentrifuge the cells at 484 × g for 3 min.\nDiscard the supernatant of the PBMCs.\nAdd the appropriate volume of supplemented RPMI 1640 media and mix the PBMCs. The PBMCs should be at a concentration of 5 × 106 cells/mL.\nPipette the PBMCs in a 25 cm2 cell culture treated flask.\nPut the flask to incubate at 37°C and 5% CO2 until the beginning of the experiment the next day.\nPreparation of the solutions\nTiming: 0.5–1 h\nThis section describes how to prepare the antibody solutions as well as how to prepare the target cells and the effector cells solutions used to mark the cells.\nTake out two 1.5 mL tubes per antibody you want to titrate. Since 3 antibodies are used in this experiment (CV3-25 WT, CV3-25 LALA and CV3-25 GASDALIE), take out six 1.5 mL tubes.\nLabel these tubes appropriately. One tube will have an antibody solution of 100 μg/mL (Antibody solution 1) and the other will have an antibody solution of 1 μg/mL (Antibody solution 2).\nIn half of these tubes dilute the antibodies at a concentration of 100 μg/mL. See the materials and equipment[href=https://www.wicell.org#materials-and-equipment] section for the recipe of the ''Antibody solution 1''.\nAdd 36 μL of PBS in the tube labeled as ''Antibody solution 1'' for each antibody.\nAdd 4 μL of the stock antibody solution (if at a concentration of 1 mg/mL) in the tube.\nMix very well the antibody solution.\nIn half of the remaining tubes, dilute the antibodies at a concentration of 1 μg/mL. See the materials and equipment[href=https://www.wicell.org#materials-and-equipment] section for the recipe of the ''Antibody solution 2''.",
    "Add 999 μL of PBS in the second tube labeled for each antibody.\nAdd 1 μL of the stock antibody solution (if at a concentration of 1 mg/mL) in the appropriate tube.\nVortex the antibody solution.\nPrepare the cell marking solution for the PBMCs that are used as the effector cells. See the materials and equipment[href=https://www.wicell.org#materials-and-equipment] section for the recipe of the ''Effector cells solution''.\nTake a 15 mL tube and label it.\nAdd the appropriate amount of PBS in the tube. Stain the PBMCs at a concentration of 10 × 106 PBMCs/mL. For this experiment, add 2.5 mL of PBS in the tube.\nAdd 2.5 μL of cell proliferation dye eFluor-450 (eBioscienceTM Cell Proliferation Dye eFluorTM 450).\nVortex the solution.\nCover the solution with aluminum foil.\nPrepare the cell marking solution for the CEM.NKr parental and the CEM.NKr.Spike cells that are used as the target cells. See the materials and equipment[href=https://www.wicell.org#materials-and-equipment] section for the recipe of the ''Target cells solution''.\nLabel a 15 mL tube.\nAdd the appropriate amount of PBS in the tube. Stain both cell line at a concentration of 1 × 106 Target cells/mL. In the case of this experiment, add 3.5 mL of PBS in the 15 mL tube.\nAdd 3.5 μL of cell proliferation dye eFluor-670 (eBioscienceTM Cell Proliferation Dye eFluorTM 670).\nVortex the solution.\nCover the solution with aluminum foil.\nStarting the ADCC assay\nTiming: 7 h\nThis section describes how to prepare and organize the cells for the experiment and how to add the antibodies in order to start the ADCC assay.\nTake the cells out of the incubator.\nMix the cells in order to homogenize them.\nCount the cells in order to determine the concentration of the CEM.NKr parental cells, the CEM.NKr.Spike cells and the PBMCs.",
    "Label the tubes as shown in Figure 3[href=https://www.wicell.org#fig3].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1044-Fig3.jpg\nFigure 3. Identification of the different tubes as well as what cells to add in each tube\nLabel the first tube as ''Effector cells''.\nLabel the second tube as ''Target cells ①''.\nLabel the third tube as ''Target cells ②''.\nLabel the fourth tube as ''CEM.NKr parental cells 0.5 × 106''.\nPipette the appropriate volume to have the needed number of PBMCs in the ''Effector cells'' tube. The ADCC assay requires 1 × 106 PBMCs/condition. For this experiment, pipette 25 × 106 PBMCs. If there are not enough effector cells (PBMCs) to perform the experiment, please refer to the troubleshooting[href=https://www.wicell.org#troubleshooting] section (problem 3[href=https://www.wicell.org#sec7.5]).\nPipette the appropriate volume to have the needed number of CEM.NKr.Spike cells in the ''Target cells ①'' tube. The ADCC assay requires 5 × 104 CEM.NKr.Spike cells/condition. For this experiment, pipette 1.5 × 106 CEM.NKr.Spike cells.\nPipette the appropriate volume to have the needed number of CEM.NKr parental cells in the ''Target cells ②'' tube. The ADCC assay requires 5 × 104 CEM.NKr parental cells/condition. For this experiment, pipette 1.5 × 106 CEM.NKr parental cells.\nPipette the appropriate volume to have 0.5 × 106 CEM.NKr parental cells in the ''CEM.NKr parental cells 0.5 × 106'' tube. Each time you do an experiment (no matter the size of the experiment), prepare this tube.\nCentrifuge the cells at 484 × g for 3 min.\nCarefully remove the supernatant without touching the cells.\nResuspend the PBMCs at a concentration of 10 × 106 PBMCs/mL with the ''Effector cells solution'' and mix well. For this experiment, add 2.5 mL of the ''Effector cells solution''.",
    "Resuspend the CEM.NKr parental cells in the ''Target cells ②'' tube at a concentration of 0.5 × 106 cells/mL with the ''Target cells solution'' and mix well. For this experiment, add 3 mL of the ''Target cells solution''.\nImmediately after resuspending the CEM.NKr parental cells in the ''Target cells ②'' tube with the ''Target cells solution'', pipette the whole volume of this solution in the ''Target cells ①'' tube and mix well. The target cells (now composed of 50% of CEM.NKr parental cells and of 50% of CEM.NKr.Spike cells) should now be at a concentration of 1 × 106 cells/mL.\nUse the remaining 500 μL of the ''Target cells solution'' to resuspend the cells in the ''CEM.NKr parental cells 0.5 × 106'' tube. These cells should now be at a concentration of 1 × 106 cells/mL.\nWait 20 min for the cells to be stained with the different cell markers.\nAdd an identical volume of supplemented RPMI 1640 media as there is of ''Effector cells solution''. For this experiment, add 2.5 mL of supplemented RPMI 1640 media.\nAdd an identical volume of supplemented RPMI 1640 media as there is of ''Target cells solution'' in each of the 2 tubes containing the target cells. For this experiment, add 3 mL of supplemented RPMI 1640 media in the ''Target cells ①'' tube and add 0.5 mL of supplemented RPMI 1640 media in the ''CEM.NKr parental cells 0.5 × 106'' tube.\nCentrifuge the tubes at 484 × g for 3 min.\nRemove carefully the supernatants.\nAdd a volume of supplemented RPMI 1640 media to dilute the PBMCs at a concentration of 10 × 106 PBMCs/mL. For this experiment, add 2.5 mL of supplemented RPMI 1640 media.",
    "Add a volume of supplemented RPMI 1640 media to dilute the target cells at a concentration of 1 × 106 cells/mL. For this experiment, add 3 mL and 0.5 mL of supplemented RPMI 1640 media in the ''Target cells ①'' tube and the ''CEM.NKr parental cells 0.5 × 106'' tube, respectively.\nCentrifuge the tubes at 484 × g for 3 min.\nRemove carefully the supernatants.\nAdd an appropriate volume of supplemented RPMI 1640 media to dilute the PBMCs at a concentration of 20 × 106 PBMCs/mL. Mix the cells very well. For this experiment, add 1.25 mL of supplemented RPMI 1640 media.\nAdd an appropriate volume of supplemented RPMI 1640 media to dilute the target cells at a concentration of 2 × 106 cells/mL. Mix the cells very well. For this experiment, add 1.5 mL and 0.25 mL of supplemented RPMI 1640 media in the ''Target cells ①'' and the ''CEM.NKr parental cells 0.5 × 106'' tubes, respectively.\nTake out a 96 well V-bottom plate.\nPipette the PBMCs in a reservoir and mix them.\nPipette 50 μL of the PBMC solution in every well that requires it according to your template. For this experiment, PBMCs should be introduced in 22 wells (18 wells for the experiment with the 3 different antibodies and 4 wells for the control conditions) as shown in Figure 2[href=https://www.wicell.org#fig2]B. There should be a total of 1 × 106 PBMCs/well.\nIn the 4 control wells that do not require any PBMCs, add 50 μL of supplemented RPMI 1640 media as shown in Figure 2[href=https://www.wicell.org#fig2]B.\nPipette the target cells from the ''Target cells ①'' tube (composed of 50% of CEM.NKr parental cells and of 50% of CEM.NKr.Spike cells) in a reservoir and mix these cells very well.",
    "Pipette 50 μL of this solution in every well that requires it according to your template. For this experiment, target cells should be introduced in 24 wells (18 wells for the experiment with the 3 different antibodies and 6 wells for the control conditions) as shown in Figure 2[href=https://www.wicell.org#fig2]C. There should be a total of 1 × 105 Target cells/well (composed of 5 × 104 CEM.NKr parental cells and of 5 × 104 CEM.NKr.Spike cells).\nMix the target cells in the ''CEM.NKr parental cells 0.5 × 106'' tube (composed of 100% of CEM.NKr parental cells).\nPipette 50 μL of the target cells from the previous step in the two remaining control wells as showed in Figure 2[href=https://www.wicell.org#fig2]C.\nMix and vortex every 1.5 mL tube containing the antibodies you will use for the experiment.\nAdd 0.25 μL of the 3 antibodies at a concentration of 1 μg/mL in the 3 appropriate wells according to your template as shown in Figure 2[href=https://www.wicell.org#fig2]D. These antibodies will be at a final concentration of 2.5 ng/mL.\nAdd 1 μL of the 3 antibodies at a concentration of 1 μg/mL in the 3 appropriate wells according to your template as shown in Figure 2[href=https://www.wicell.org#fig2]D. These antibodies will be at a final concentration of 10 ng/mL.\nAdd 5 μL of the 3 antibodies at a concentration of 1 μg/mL in the 3 appropriate wells according to your template as shown in Figure 2[href=https://www.wicell.org#fig2]D. These antibodies will be at a final concentration of 50 ng/mL.\nAdd 0.25 μL of the 3 antibodies at a concentration of 100 μg/mL in the 3 appropriate wells according to your template as shown in Figure 2[href=https://www.wicell.org#fig2]D. These antibodies will be at a final concentration of 0.25 μg/mL.",
    "Add 1 μL of the 3 antibodies at a concentration of 100 μg/mL in the 3 appropriate wells according to your template as shown in Figure 2[href=https://www.wicell.org#fig2]D. These antibodies will be at a final concentration of 1 μg/mL.\nAdd 5 μL of the 3 antibodies at a concentration of 100 μg/mL in the 3 appropriate wells according to your template as shown in Figure 2[href=https://www.wicell.org#fig2]D. These antibodies will be at a final concentration of 5 μg/mL.\nMix every well of the 96 well V-bottom plate containing cells (even if no antibody was added to the well).\nCentrifuge the 96 well V-bottom plate at 300 × g for 1 min.\nPut the 96 well plate in the incubator at 37°C and 5% CO2 for 5 h.\nDuring the 5 h of incubation, prepare a PBS-Formaldehyde 4% (PFA 4%) solution. See the materials and equipment[href=https://www.wicell.org#materials-and-equipment] section for the recipe of the ''PFA 4%'' solution.\nTake a 15 mL tube and label it a PFA 4%.\nPipette the appropriate volume of PBS in the 15 mL tube. You will need 100 μL of the PFA 4% solution per well used in the 96 well V-bottom plate. For this experiment, pipette 2.41 mL of PBS in the tube.\nPipette the appropriate volume of formaldehyde 37% in the tube in order to make a PFA 4% solution. For this experiment, add 292 μL of formaldehyde 37%.\nVortex the solution.\nPrepare and label the appropriate number of micro test tubes (Titertubes® Micro Test Tubes) you will need once you stop the experiment. You need 1 micro test tube per well. For this experiment, prepare a total of 26 micro test tubes.",
    "Once the 5 h of incubation are finished, add 100 μL of the PFA 4% solution to each well of the 96 well V-bottom plate containing cells and mix extremely well.\nPipette the content of each well in the corresponding micro test tube.\nPut the micro test tubes at 4°C and shelter them from light until further use. We do not recommend letting the cells more than 1 week at 4°C before further use.\nCritical: The experiment will only work if there is an equivalent number of PBMCs in each well (∼ 1 × 106) and, initially, an equivalent number of target cells in each well (∼ 0.1 × 106). Also, it is crucial that the initial proportion of target cells (1 CEM.NKr parental : 1 CEM.NKr.Spike) in each well be the same. The proportion of effector cells to target cells must also be the same in every well (10:1). To make sure this is respected, mix the cells frequently while pipetting the cells from the reservoirs into the wells of the 96 well V-bottom plate.\nCritical: Do not use the wells in the rows and columns at the extremities of the 96 well V-bottom plate. Higher evaporation and consequently higher variability in the data is observed when using these wells.\nPause point: Between steps 59 and 60 you can wait up to 1 week.\nAnalyzing the cells on the cytometer\nTiming: 1–4 h\nThis section describes the gating strategy used to calculate the % ADCC mediated by the different antibodies. It also describes in what order to pass and analyze the cells on the cytometer.\nPrepare the gating strategy as shown in Figure 4[href=https://www.wicell.org#fig4].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1044-Fig4.jpg\nFigure 4. Gating strategy of the ADCC assay when passing the cells in the cytometer and analyzing them",
    "Prepare the first gate by selecting the target cells based on their side scatter area (SSC-A) and their forward scatter area (FSC-A). To know where to place your gate, pass and select the cells that were in a well of the control conditions without the addition of any PBMCs. The purpose of this gate is to select the target cells.\nPrepare the second gate by selecting the cells based on their forward scatter width (FSC-W) and their forward scatter height (FSC-H) in order to exclude the target cells doublets. To know where to place your gate, pass and select the cells that were in a well of the control conditions without the addition of any PBMCs.\nPrepare the third gate by selecting the target cells based on their eFluor-670 signal and their eFluor-450 signal. The target cells are eFluor-670High and eFluor-450Low. To know where to place your gate, pass and select the cells that were in a well of the control conditions without the addition of any PBMCs. The purpose of this gate is to select the target cells, while excluding the effector cells.\nPrepare the fourth gate by selecting the target cells based of their eFluor-670 signal and their GFP signal. The target cells expressing the SARS-CoV-2 Spike are eFluor-670High and GFPHigh. To know where to place your gate, pass and exclude the target cells that were in the well of the control conditions without the addition of any PBMCs and where the target cells were composed of 100% of CEM.NKr parental cells (i.e., the cells that are 100% GFPLow). The purpose of this gate is to select the cells that express the SARS-CoV-2 Spike (i.e., the cells that are GFPHigh).",
    "Start passing the samples in the cytometer by beginning with the 2 wells where 100% of the target cells are CEM.NKr parental cells. Following these 2 controls, start passing the other 6 control samples.\nPass the other samples in the cytometer. If there are very few cells in the samples, please refer to the troubleshooting[href=https://www.wicell.org#troubleshooting] section (problem 4[href=https://www.wicell.org#sec7.7]).\nOnce you finish passing the samples, export the data.\nCritical: Once you optimized your gating strategy and start passing your samples, never change the parameters mid experiment.\nNote: The target cells in the first column of Figure 4[href=https://www.wicell.org#fig4] should be gated on by using the 4 control wells where the only cells introduced in the wells were the target cells.\nNote: The target cells expressing the SARS-CoV-2.Spike (CEM.NKr.Spike) also express GFP. Use the wells where 100% of the target cells are CEM.NKr parental cells to delineate the GFPLow from the GFPHigh population as shown in the fourth column of Figure 4[href=https://www.wicell.org#fig4].\nNote: Pass at least 10 000 target cells per sample in the third gate.\nNote: We suggest every lab to prepare compensation tubes (Unstained CEM.NKr.Spike (GFP), PBMCs stained with eFluor-450, CEM.NKr parental cells stained with eFluor-670 and unstained CEM.NKr parental cells) to determine if they require compensation or not.\nAnalyzing the data\nTiming: 1 h\nThis section describes how to analyze the data obtained from the samples that were used in flow cytometry.\nExport the data to the computer for the analysis.\nDrag the data from the computer into the FlowJoTM program to analyze the data.\nPrepare the gating as shown in Figure 4[href=https://www.wicell.org#fig4].\nOnce the gating is completed, add the % GFPHigh cells from the gating in the fourth column as shown in Figure 4[href=https://www.wicell.org#fig4].\nExport the % GFPHigh cells for each condition in a file on your computer.",
    "Using the % GFPHigh cells in each wells, calculate the % ADCC using this formula:\n  %  A D C C =     (  A v e r a g e  o f   ( T a r g e t s + E f f e c t o r s )  )   −  (  T a r g e t s + E f f e c t o r s + A n t i b o d y  )     A v e r a g e  o f  T a r g e t s  a l o n e    x  100  \nIf the calculated % ADCC differs significantly from an experiment to another, please refer to the troubleshooting[href=https://www.wicell.org#troubleshooting] section (problem 5[href=https://www.wicell.org#sec7.9]).\nNote: For further explanations on the quantification of ADCC, please refer to the quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis] section."
  ],
  "subjectAreas": [
    "Immunology",
    "Microbiology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}