{
  "id": 4163,
  "origin_website": "Cell",
  "title": "A whole-mount immunohistochemistry protocol for detection of mouse corneal nerves",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDissecting mouse corneas: Day 1\nTiming: 1 h\nDissect the corneas using surgical spring scissors and forceps (Figure 3[href=https://www.wicell.org#fig3]), under a binocular dissecting microscope (Zeiss stenin 305) (Methods video S1[href=https://www.wicell.org#mmc1]).\nUse forceps to hold the posterior part of the eye softly.\nUse the tip of the surgical spring scissors to make the first incision upon the sclera.\nEnlarge the incision and make it a circular cut to eliminate part of the sclera that is attached to the optic nerve.\nGently press the eye ball to push out the lens.\nMake radial incisions to the central cornea and gently scrape off the retina with the tip of the scissors.\nGently scrape off the iris with the tip of the scissors.\nNote: Ensure that pressure is on the sclera and not the cornea as it could damage cellular morphology.\nNote: The dissection of the corneas should be performed in a petri dish filled with 1× PBS to prevent the corneas from drying out\nCut off the sclera, making sure to allow for a generous margin at the limbus to include nerves at the corneal/limbal interface.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/926-Fig3.jpg\nFigure 3. A Student Vannas spring scissor and a Student Dumont #5 forceps (standard tips, straight, Inox, 11 cm) were used for corneal dissection\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Cornea dissection, related to dissecting mouse corneas day 1 (steps 1–8)\nA mouse eye immersed in 1× PBS in petri dish was dissected under a Stemin 305 Microscope using a Student Vannas spring scissor and a Student Dumont #5 forceps.\nPrimary antibody incubation: Day 1\nTiming: 5–7 h\nUsing a 96-well plate for staining, place one cornea per well and wash the corneas with 1× PBS 5 times/5 min at 20°C–25°C.",
    "Note: Both Eppendorf tubes and 96-well plates can be used for the staining. Keep one cornea in one tube or one well.\nNote: Thorough washing of the cornea in this step decreases nonspecific background signal. See troubleshooting: problem 3[href=https://www.wicell.org#sec6.5].\nPipette off 1× PBS after the last wash and add permeabilization buffer (1% Triton-X100 in 1× PBS).Then, keep the plate on a low-speed orbital shaker at 20°C–25°C for 60 min.\nTransfer the corneas using fine-tip forceps into new wells and add in 20% serum in blocking buffer (0.3% Triton-X-100/0.1% Tween-20 in 1× PBS) and incubate at 20°C–25°C for 30 min.\nNote: Only touch the residual sclera to ensure that mechanical disruption of corneal epithelium and endothelium does not take place.\nNote: For the staining illustrated in this protocol, we use goat serum because our secondary antibody is goat specie (Cedarlane, Burlington, NC, USA); however, the serum used in the blocking buffer should match the species of the secondary antibodies you are going to use. See troubleshooting: problem 3[href=https://www.wicell.org#sec6.5].\nTransfer the corneas into new wells and add a 100 μL cocktail of primary antibodies diluted in blocking buffer to each well. For this study we used, a pan-neuro marker, rabbit anti-mouse βIII tubulin at a dilution of 1:200.\nIncubate at 20°C–25°C for 2 h, followed by an additional incubation for 12–16 h at 4°C.\nNote: Place the plate or tubes on a low-speed orbital shaker for all the washing steps and incubation steps.\nCritical: If it is necessary to add BSA to the blocking buffer when making the antibody cocktail, make sure to use BSA with the highest purity, as BSA with low purity causes high background.\nSecondary antibody incubation: Day 2\nTiming: 4–5 h\nWash the corneas in washing buffer (0.1% Tween-20 in 1× PBS) 5 times/5 min",
    "Transfer the corneas into new wells (or new tubes) and add a 100 μL cocktail of secondary antibodies diluted in blocking buffer (1:500 dilution) into each well. Incubate at 20°C–25°C for 2 h.\nFollowing five 10-min washes with washing buffer, mount the corneas on slides with the epithelium apposed to the #1.5 coverslip (170 μm). There should be only one cornea per slide.\nNote: For the staining illustrated in this protocol, we use Alexa Fluor 488 goat anti-rabbit IgG(H+L) (Dilution 1:500) as secondary antibody.\nNote: Sensory nerve endings and the fine subbasal plexus are more prone to bleaching compared to the thick neuronal trunks in the stroma. Therefore, scanning should always begin with the epithelium and end at the endothelium. See troubleshooting: problem 1[href=https://www.wicell.org#sec6.1].\nDry the slides at 4°C for at least 12 h before imaging (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/926-Fig4.jpg\nFigure 4. A mouse cornea was mounted on a slide with a #1.5 thickness coverslip\nNote: Drying times may vary with different types of mounting media. We use Immu-Mount from Thermo Scientific (Ref 9990402).\nCritical: Examining the corneas with a confocal microscope before the mounting medium is fully dried will compromise the imaging; the corneas will not lie flat and the acquired z-stack image mosaic will be difficult to stitch because of the objective lens of the microscope may disrupt the contact between the coverslip and cornea during scanning acquisition (Figure 5[href=https://www.wicell.org#fig5]). See troubleshooting: problem 4[href=https://www.wicell.org#sec6.7].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/926-Fig5.jpg\nFigure 5. Scanning the corneas before the mounting media was completely dried led to curved images\nHere we showed the images of the same cornea (4% PFA/ 1 h fixation) before and after the mount medium was fully dried, and in addition a cornea fixed with 1.3% PFA for 1 h (blue, DAPI; green, βIII Tubulin).\nConfocal microscopy acquisition: Day 3",
    "Turn on the upright Olympus IX81 Fluoview 1000 laser scanning confocal microscope equipped with a 20× oil (numerical aperture 0.85) objective lens and an automated stage. Make sure the system is set up to do ZDC stitched mosaics with 10% overlap of the images to assist in good registration. Engage Multi-Area Time Lapse (MATL), and then go to Multi-Area Time Lapse Controller and select Mosaic Outline. Define the boundary of the cornea in the mosaic outline, allowing generous margins around the cornea.\nAlternatives: We use an Olympus IX81 Fluoview 1000 laser scanning confocal microscope; however, any confocal microscope should be sufficient to capture detailed images of corneal nerves.\nNote: We use a 20× oil objective for our studies; however, we have imaged corneal nerves with 10×, 40×, 60×, and digital 360×.\nFocus the objective and set up the start and stop points of the z-scan spanning from the epithelium to the endothelium. Check the z settings at multiple locations in the tissue to ensure that the entire cornea will be included in the stacks.\nApply all the points in the Mosaic Outline.\nGo to Registered Point List, check Display Current Area in Center of Stage Map.\nGo to File and Folder, save the scanning files, check “Auto create sub folder every experiment.”\nMake sure to check “Set Track info to FV with position movement” and Re-Register to include all the points selected in step 19.\nCheck Ready button and then start scanning.\nSave images in the native Olympus Image Binary (OIB) format or an OIF format. After acquisition images will be ready to be stitched together using FV10-ASW 2.0 software (Olympus Life Science, Tokyo, Japan).",
    "To stitch mosaic: go to MATL Viewer under Devices, then click Open MATL-Log File, choose the MATL Mosaic file from the data folder, and then press the Select Action button, select the areas that need to be stitched and click Stitch.\nNote: Stitching can also be performed using other software like Fiji.\nCheck all the channels that need to be stitched, and check Correction and Smoothing, and then press the Show button.\nAfter the “tiling” (stitching) process is finished, save the file with the original name in the native OIB format, and make sure to check Apply to Series.\nNote: Make sure to click all the options mentioned in this step, otherwise, the raw data might not be saved correctly and might be lost after stitching. See troubleshooting problem 5[href=https://www.wicell.org#sec6.9]."
  ],
  "subjectAreas": [
    "Microscopy",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology"
  ]
}