{
  "id": 2260,
  "origin_website": "Cell",
  "title": "A Biologist’s Guide to Traction Force Microscopy Using Polydimethylsiloxane Substrate for Two-Dimensional Cell Cultures",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nPolydimethylsiloxane Substrate Preparation\nTiming: 2–2.5 h\nPrepare polydimethylsiloxane (PDMS) mixture and coat glass bottom dishes\nPipette equal weights of Cy-A and Cy-B using a P1000 cut tip into a weigh tray. For example, 0.5 g of Cy-A and 0.5 g of Cy-B.\nNote: This gives rise to a substrate stiffness of approximately 10–20 kPa, measured by Atomic Force Microscopy (AFM), (Kenry et al., 2015[href=https://www.wicell.org#bib4]). To generate different substrate stiffness, other mixing ratios can be adopted. Cy-A:Cy-B – 1.2:1 for 2–3 kPa, and Cy-A:Cy-B – 1:1.2 for 30–40 kPa.\nStir PDMS mixture well with a P200 cut tip. Mixing by pipetting may be less efficient due to the viscosity of PDMS.\nCritical: The mixed PDMS thickens within 20 min of mixing the two-part PDMS and it is advisable to proceed to steps 3) and 4) in a similar duration. This is particularly important when preparing multiple samples at the same time. Check section on Troubleshooting.\nUsing a P200 cut tip, add 0.08 g (approximately 80 μL) of PDMS mixture onto a glass bottom dish.\nNote: Pipette amount by weight and not volume as PDMS is viscous. This weight does not need to be changed if dishes of similar size or bigger are used. Ensure that the mixture is dropped at the center of the dish to generate an even layer of substrate coating. The drop would have a diameter of approximately 0.5–1 cm before spin coating.\nSpin coat at 500 rpm for 30 secs to generate a substrate thickness of >100 μm (Figure 1[href=https://www.wicell.org#fig1]) (Yoshie et al., 2019[href=https://www.wicell.org#bib21]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/173-Fig1.jpg\nFigure 1. Schematic to Illustrate the Process of Spin-Coating a PDMS Substrate Droplet onto a Dish with a Glass Coverslip to Achieve a Flattened Layer with Certain Height",
    "Be sure to align the centers of the spin-coater, the PDNS drop, and the Petri dish.\nNote: As the software assumes cells exert forces on an infinite half-plane, this thickness was chosen such that cells are less likely to sense the stiff glass surface at the bottom, allowing this assumption to be better met (Buxboim et al., 2010[href=https://www.wicell.org#bib1], Tusan et al., 2018[href=https://www.wicell.org#bib18]). At the same time, this allows relatively flat PDMS to be fabricated.\nCure PDMS substrate for 2 h at 80°C.\nCritical: Be sure there are no obvious bubbles in the PDMS prior to curing. Check section on Troubleshooting.\nPause Point: Once PDMS is cured, proceed to the next steps, or seal the dishes with parafilm and store at room temperature (∼22°C–25°C) for future use. The solidified PDMS in the dishes can be kept for 1–2 months without significant deterioration.\nPrepare PDMS Surface for Bead Incubation\nTiming: 40 min–1 h\nSilanize PDMS Surface\nPrepare 5% (v/v) APTES solution in 100% ethanol.\nNote: APTES is sensitive to moisture and should be stored by filling the pocket of gas in the bottle with inert gas such as nitrogen. The solution should be prepared fresh. Do not keep any unused solution.\nAdd 2 mL of 5% APTES solution on cured PDMS dish for 10 min.\nRemove 5% APTES solution and wash PDMS dish 3 times with 3 mL of 100% ethanol.\nNote: The surface is soft and slightly sticky, be careful not to pipette vigorously close to the surface nor touch it, in order to not generate unwanted plastic deformations.\nDry PDMS dish at 80°C for 30 min with the lid ajar.\nPrepare Nanobead Solution\nTiming: 30 min\nPrepare 5 mL of 0.05% (v/v) beads in distilled water.\nSonicate bead solution at around 50–60 Hz for 10 min.",
    "Note: Check section on Troubleshooting.\nFilter bead solution through a 0.45 μm filter.\nFunctionalize PDMS with Nanobeads\nTiming: 45 min–1 h\nIncubate PDMS dish with bead solution for 5 min at room temperature (∼22°C–25°C).\nRemove bead solution and wash PDMS dish 3 times with 3 mL of distilled water.\nNote: During washing, care should be taken to not have any parts of the PDMS dry at any time, which can generate streaks and non-uniform bead distribution.\nDry dish at 80°C for 15 min with the lid ajar.\nIncubate dish with 3 mL of 100 mM Tris solution for 10 min at room temperature (∼22°C–25°C). This is to inactivate the bead surfaces.\nRemove Tris solution and wash PDMS dish 3 times with 3 mL of distilled water.\nDry dish at 80°C for 15 min with the lid ajar.\nNote: PDMS dish coated with beads should be protected from light from here on. For example, keep dishes in an opaque box or a container wrapped with aluminum foil.\nCoat PDMS Dish with Fibronectin and Seed Cells\nTiming: 1–2 h\nPrepare 50 μg/mL of fibronectin solution in distilled water or 1× PBS.\nAdd 2 mL of fibronectin solution to PDMS dish. Incubate PDMS dish at room temperature (∼22°C–25°C) for 1 h.\nNote: Ensure that the dish is fully covered with fibronectin solution. Fibronectin adheres to the PDMS surface through non-specific binding, it is thus expected that other ECM proteins can also adhere to the surface with a similar protocol.\nRemove fibronectin solution and wash PDMS dish 3 times with 3 mL of PBS.\nAdd 1 mL of 1% pluronic to PDMS dish for sterilization. Incubate at room temperature (∼22°C–25°C) for 30 min.\nRemove pluronic and wash PDMS dish 3 times with 3 mL of PBS.",
    "Seed cells onto PDMS dish so that a confluent monolayer is established in 24 h (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/173-Fig2.jpg\nFigure 2. Confluent Monolayer of AML12 Cells on PDMS Substrate\nRepresentative phase contrast image of AML12 (A) seeded on PDMS substrate functionalized with fluorescent beads (B). Scale bar, 100 μm.\nNote: This protocol can be adopted to measure traction forces from single cells as well.\nImaging\nTiming: 26 h\nTransfer dish to a widefield fluorescence microscope. For instance, we used the Nikon Ti-E Inverted Microscope equipped with a Hamamatsu Flash 4.0 sCMOS camera, Lumencor 7 line LED light source, motorized X-Y-Z stage, piezo Z-drive and a CO2 and temperature incubator box.\nUsing a 10× (or 20×) dry objective, acquire images of beads with a large field of view (e.g., 1,000 × 1,000 μm depending on the camera and objective).\nNote: It is advised to set up a single z-plane each for imaging channels of beads and cells as they are usually not in the same focal-plane. In addition, ensure that images are captured and saved as tiff files.\nDetermine the duration and time interval for capturing the movie. For instance, capturing an image every 15 min for 24 h.\nNote: The time interval is not important for traction force calculations, but is important to correlate cell motion with the traction forces. For cells moving at ∼30 μm/h, a 10 min interval is good. For cells moving at few μm/h, ∼60 min interval is enough.\nAt the end of a 24-h run, remove lid of the dish carefully and add 10% SDS.",
    "Note 1: This detaches the cells and obtains the reference bead images when cells are no longer exerting forces on the substrate (Style et al., 2014[href=https://www.wicell.org#bib14]). Alternatives such as Trypsin and Triton X-100 could also be used to detach cells for the same purpose, but SDS has the advantage of detaching cells within minutes. Do not remove the dish from the microscope to prevent the loss of imaging positions. Generally, movement of the imaging position less than ∼20% of the whole image allows the alignment software to work.\nNote 2: Another way to obtain reference states is to make TFM samples on dishes pre-printed with gridlines at the bottom, and image the reference state before cell seeding. The gridlines will allow one to find the corresponding cell region for imaging after cells are seeded. This second method eliminates the need to remove cells at the end of the experiment and allows for cell fixing and staining of antibodies.\nAfter ∼1 h, when substrate deformation is fully reversed, capture reference bead images."
  ],
  "subjectAreas": [
    "Microscopy",
    "Cell Biology",
    "Biophysics"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}