{
  "id": 6734,
  "origin_website": "Bio",
  "title": "Transcervical Mouse Infections with <em>Chlamydia trachomatis</em> and  Determination of Bacterial Burden",
  "procedures": [
    "Preparation of bacterial stockNote: The protocol below is for Ct grown in two 75 cm2 flask of cells.Preparation of chlamydial stock (Mukhopadhyay et al., 2004; Rajeeve et al., 2018).For infections in mice, Chlamydia trachomatis (Ct) is propagated in mouse embryonic fibroblast (MEFs). Cells are grown in 75 cm2 or 150 cm2 flasks in RPMI with 5% heat inactivated FCS.The cells are infected with Ct for 48 h. The cells are scraped with a rubber scraper and collected in a sterile 50 ml Falcon.The cells are lysed using glass beads for 3 min by vortexing to release the bacteria.The lysate is pelleted to remove the cell debris by centrifuging at 1,344 x g for 10 min at 4 °C.The lysate from Step A4 is centrifuged at 30,000 x g for 30 min. The pellet is washed with 10 ml 1x SPG buffer at 30,000 x g for 30 min.Now the pellet is resuspended in 2 ml of SPG buffer and passed 5 times through 20 G syringe and later 18 G syringe.To prevent any cell debris, the bacterial suspension should be purified using renografin gradient.Prepare a step 20-50% (vol/vol) Renografin gradient in sterile 38.0-ml high-speed centrifuge tubes (Beckman Coulter polycarbonate coated).The gradient should be made with 3.0 ml of 50% Renografin and 7.0 ml of 20% Renografin carefully layered above the 50% Renografin.Add 2.0 ml of the Ct suspension onto the top of the 20% phase.Centrifuge at 60,000 x g for 60 min. The EB will appear as a distinct band the 20-50% interface. This layer should be carefully separated and diluted with ice-cold SPG buffer. Repeat a centrifugation step at 30,000 x g and collect the bacterial pellet (it can be very sticky).Resuspended bacterial suspension is made into small aliquots (20-50 μl) and frozen at -80 °C until used.",
    "One aliquot should be used to check the multiplicity of infection (MOI). We need 1 x 106-1 x 107 bacteria to infect a mouse.Determine the multiplicity of infection (MOI)Hela cells are plated in duplicate on 12-well plate with glass slides to get a 60-70% confluency next day.Different concentrations of bacterial aliquot in different dilution from 1:10 to 1:10-10 are used to infect each well (e.g., 0.25 μl, 0.50 μl, 1 μl, 2 µl and so on).After 48 hpi, the MOI is calculated by counting the number of inclusions and number of cells. A MOI of 1 indicates one bacterium infects one cell thereby all cells are infected in a well.Selection of miceTrans cervical infections are carried out in female mouse, which are sexually matured minimum 8 weeks old. Five-ten female mice should be considered per treatment group. Mice in each experiment should be age-matched and cage mates should be randomly distributed into different treatment groups to avoid cage effect.Transcervical infectionTo establish a genital tract infection, it is necessary to control the shedding from the uterus. Depo-provera, the hormone progesterone prevents ovulation, thus synchronize the estrus cycle and increase susceptibility to Chlamydia infection. Five days before transcervical infection, mice are injected subcutaneously with 2.5 mg of DepoProvera (medroxy-progesterone acetate): Dissolve one tablet (250 mg) in PBS and use 200 μl per mouse.On the day of trans cervical infection procedure the bacterial stocks are thawed in ice. One should also carry sterile PBS in 50 ml Falcon, 200 μl pipette and Non-surgical embryo transfer (NSET) device (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200119/20200119070924_6228.jpgFigure 2. Non-Surgical Embryo Transfer (NSET) device. 1, 2 and 3 indicates the parts of the NSET device.The infection procedure should be performed in a biosafety level 2 facility. The mouse is retrieved from the cage and placed on the top of the grill.",
    "Gently hold the tail and allow the mice to grip on the top of the cage. Now orient the mouse so that the posterior part is visible.Gently hold the tail between thumb and forefinger and pull upward that the feet come off the cage. Now use the ring finger to push the back of the mice to angle the hip upwards to easily access the vagina.Carefully insert a 200 μl pipette tip into the vagina nearly 0.2 cm deep and aspirate liquid that accumulates the cervix. Make sure not to insert too deep that might hurt the mice and lead to internal injury.Now slowly insert the NSET device into the vaginal vault by placing the parts in the order 1, 2 and 3 (Figure 2) as shown in the image and video below (Figure 3) in the order. Pass the needle up and down until it passes through the cervical opening. This needs a few trails and one can use bromophenol blue to confirm passing the cervix (see Video 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200119/20200119070950_7323.jpgFigure 3. Steps in transcervical infection. A. The mouse is held by the tail as explained above (Step D4) and insert the adaptor of the NSET device into the vagina. B. The NSET needle is further inserted through the adaptor till it reaches the cervix of the mice. C. Make sure that the needle is completely inserted into the cervix. D. One can insert the pipette into the NSET needle and load the bacterial inoculum (refer to the Video 1).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Steps in transcervical infection. This video was made at the University of Würzburg under the allowance A2 55.5-2531.01-49/12. The animal experiments were performed in accordance with protocols approved by animal care and experimentation of German Animal Protection Law approved under the Animal (Scientific Procedures) Act 1986 (project license 55.",
    "2-2532-2-762).Pipette the required MOI of bacteria through the NSET device and load the bacteria to the uterine fundus. Keep the mouse with the hip upward for 3-5 min to ensure the proper spread of the inoculum. Place the mouse back to its home cage.Bacterial load determinationCopy number detection via RT-PCRThe mice were euthanized 7 days post-infection and the uterine horns were taken for further analysis.The uterine horns were homogenized in SPG buffer and DNA was isolated using DNeasy blood and tissue kit (Qiagen) as per the manufacturers’ protocol.Quantitative PCR was used to enumerate Chlamydia and host genome copy number.To determine the copy number a standard curve was done first with a plasmid encoding the chlamydial lytA gene and mouse gene Synectin. One can use any bacterial/host gene for this purpose. The following primers were used for amplifying the C. trachomatis lytA gene that was cloned into the vector: fwd, 5′-TCTAAAGCGTCTGGTGAAAGCT-3′ and rev, 5′-GAAATAGCGTAGTAATAATACCCG-3′. Normalization of bacterial genome to that of the host was performed using mouse synectin primers: fwd, 5′-ACTAATGTCAAGGAGCTGTACG-3′ and rev, 5′-CCTCCGACTTGAACACTTCC-3′.For creating the standard curve first, the gene of interest (lyt A from Chlamydia/Synectin from mouse) should be cloned in a suitable plasmid for example TOPO pCR 2.1 vector (Life Technologies, Germany). Different dilutions of the Plasmid are used to perform a standard curve. This gives the primary information on the DNA copy number and the corresponding CT value (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200119/20200119071339_8973.jpgFigure 4. An example of determining the copy number. Different dilutions of plasmid DNA is used to make a standard curve. From the slope of the given line, the amount of DNA present in an unknown sample can be calculated (in this graph the X value) from a corresponding CT value (Y value).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200119/20200119071500_5448.",
    "jpgFrom the standard curve, the number of copies is determined per µl of the sample as the ratio of chlamydial genome to the host genome."
  ],
  "subjectAreas": [
    "Microbiology",
    "Immunology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}