{
  "id": 10257,
  "origin_website": "Jove",
  "title": "DNA Tension Probes to Map the Transient Piconewton Receptor Forces by Immune Cells",
  "procedures": [
    "The OT-1 transgenic mice are housed at the Division of Animal Resources Facility at Emory University. All the experiments were approved and performed under the Institutional Animal Care and Use Committee (IACUC) protocol.\n1. Oligonucleotide preparation\nDissolve the ligand strand DNA in water (18.2 MΩ resistivity, used throughout the whole protocol). Vortex and spin down the solution with a tabletop centrifuge. Tune the volume of water such that the final concentration is 1 mM. Validate the concentration by using a nanodrop spectrophotometer to measure the absorbance at 260 nm and determine the final concentration based on the extinction coefficient of the oligonucleotide.\n\tNOTE: The ligand strand has a modification at each terminus, 5' amine and 3' biotin, to conjugate with the fluorophore and to present the biotinylated ligand. The amine group in the ligand strand needs to be conjugated with a fluorophore. Cy3B dye is used for this conjugation due to its high brightness and photostability, but it is not generally offered commercially and requires in-house conjugation. Accordingly, the following section describes the conjugation between amines and NHS ester dyes. For end users that do not have access to facilities or resources for nucleic acid modification, modified nucleic acids can instead be purchased from custom DNA synthesis vendors that offer bright and photostable dyes, such as the Alexa and Atto family of dyes.",
    "Prepare 10x PBS and 1 M NaHCO3 solutions. Mix 10 µL of the 1 mM amine ligand strand solution (10 nmol) with 10 µL of 10x PBS, 10 µL of 1 M NaHCO3, and 60 µL of H2O. Dissolve 50 µg of Cy3B NHS ester in 10 µL of DMSO immediately before use and add to the mixture for a total reaction volume of 100 µL. Add Cy3B NHS ester last. Allow to react at room temperature for 1 h or 4 °C overnight.\nPrepare the Atto647N locking strand by conjugating the amine locking strand with Atto647N NHS ester. Prepare 10x PBS and 1 M NaHCO3 solution. Mix 10 µL of the 1 mM amine locking strand solution (10 nmol) with 10 µL of 10x PBS, 10 µL of 1 M NaHCO3, and 60 µL of H2O. Dissolve 50 µg of Atto647N NHS ester in 10 µL of DMSO immediately before use and add to the mixture for a total reaction volume of 100 µL. Add Atto647N NHS ester last. Allow to react at room temperature for 1 h or 4 °C overnight.\nAfter the reactions, remove by-products, excess dye, and salts by P2 desalting gel filtration. Dilute the reaction mixture with H2O to a total volume of 300 µL, which is appropriate for the subsequent HPLC purification step. Add 650 µL of hydrated P2 gel to a centrifugal device and spin down at 18,000 x g for 1 min. Remove the liquid at the bottom of the device, add the reaction mixture to the column containing P2 gel, spin down at 18,000 x g for 1 min and collect the reaction mixture at the bottom of the device.\n\tNOTE: P2 gel should be hydrated at least 4 h before use with H2O.",
    "Purify the desalted reaction mixture with HPLC using a C18 column designated for oligonucleotide purification, with solvent A: 0.1 M TEAA in H2O and B: ACN as the mobile phase for a linear gradient elution 10-100% B over 50 min at a flow rate of 0.5 mL/min. Inject the desalted reaction mixture in reverse-phase HPLC with a 500 µL injection loop for purification. Collect the product that has an absorbance peak for the DNA (260 nm) and an absorbance peak for the fluorophore (560 nm for Cy3B and 647 nm for Atto647N) and dry them in a vacuum centrifugal concentrator overnight (see Figure 2A).\nReconstitute the dried oligo-dye product in 100 µL water. Determine the concentration of the Cy3B ligand strand and Atto647N locking strand with the nanodrop spectrophotometer. Ensure that the dye labeling ratio is close to 1:1. Correct for the 260 nm absorbance of the dye if needed when determining the oligonucleotide concentration.\nValidate the purified product with MALDI-TOF-MS using 3-HPA as the substrate in 50% ACN/H2O with 0.1% TFA and 5 mg/mL ammonium citrate using 0.5 µL of the product at 1-5 µM for MALDI-TOF-MS sample preparation. An example mass spectrum can be found in Figure 2B.\nDissolve the hairpin strand and the quencher anchor strand in water and make sure the concentration of the stock solutions is between 50 and 100 µM.\n\tNOTE: The hairpin strand is unmodified and can be directly custom synthesized from a vendor. The anchor strand has a thiol anchoring group and a quencher BHQ2 and can be directly custom synthesized from a vendor.",
    "Aliquot all of the oligonucleotides. For short-term use and storage, store these oligonucleotides at 4 °C. For long-term storage, freeze and keep them at -20 °C. At this point, all of the oligonucleotides are ready for the DNA tension probe assembly.\n\t​NOTE: Repeated freeze-thaw cycles are not problematic for oligonucleotides.\n2. Surface preparation\nNOTE: The preparation of DNA hairpin tension probe substrates takes two days. The DNA hairpin tension probe will be functionalized onto glass coverslips.\nDay 1\n\t\nPlace the 25 mm coverslips on a polytetrafluoroethylene rack in a 50 mL beaker. Each rack can hold up to 8 coverslips. Rinse the coverslips by submerging in water three times.\nAdd 40 mL of a 1:1 ratio (v:v) solution of ethanol mixed with water to the beaker containing the rack and coverslips, and seal the beaker using a paraffin film.\nSonicate the beaker for 15 min in an ultrasonics cleaner (operating frequency 35 KHz) to clean the coverslips. After sonication, discard the liquid and rinse the beaker with the rack and coverslips in it with water at least 6 times to remove any remaining organic solvent.\nPrepare fresh Piranha solution by mixing sulfuric acid and hydrogen peroxide in the ratio of 3:1. To make 40 mL of Piranha solution, add 30 mL of sulfuric acid to a clean 50 mL beaker first and then slowly add 10 mL of H2O2. The Piranha solution will rapidly heat and bubble upon addition of the H2O2. Gently mix the piranha using the end of a glass pipette.",
    "Next, transfer the rack that holds the coverslips to the beaker containing gently mixed Piranha solution for etching (Figure 3A). Allow the Piranha solution to hydroxylate and clean the coverslips for 30 min at room temperature. After Piranha etching, transfer the rack using steel or polytetrafluoroethylene tweezers to a clean 50 mL beaker with water and rinse again with water at least 6 times.\n\t\tCAUTION: Large amounts of organic substances could react vigorously with Piranha solution and may cause explosion. Be careful and always work with Piranha solution in a fume hood. Make sure to wear a labcoat, gloves, and safety goggles. Never store fresh Piranha solution in a sealed container.\n\t\tNOTE: The hydrogen peroxide to sulfuric acid ratio should be kept under 1:2 (v:v) and should never exceed 1:1. When submerging the rack with coverslips in Piranha solution, place them in the solution slowly and carefully. Do not discard the solution immediately after etching, as it is still active and hot. Leave it in the beaker overnight before pouring it in the acid waste container.\nImmerse the rack holding the coverslips in a 50 mL beaker with 40 mL ethanol to remove water. Discard the ethanol and repeat 3 times to ensure that the water has been removed.\nThen immerse the rack in 3% aminopropyl triethoxy silane (APTES) (v/v) in 40 mL of ethanol to react with the -OH on the coverslips for 1 h at room temperature (Figure 3B).\n\t\tNOTE: Ethanol can be replaced by acetone.\nRinse surfaces 6 times by submerging them into 40 mL ethanol, then dry in oven at 80 °C for 20 min. After cooling, store the dried amine-modified coverslips at -20 °C for future use (up to 6 months).",
    "Cover the bottom inner side of 10 cm diameter plastic Petri dishes with paraffin film. The paraffin film prevents the coverslips from sliding inside the Petri dish and helps in keeping the solution for the next steps of functionalization stay on the coverslips. Place the cooled-down amine-modified coverslips in the Petri dishes. The side to be functionalize should be facing up.\nTo modify the amine groups on the coverslips, add 300 µL of 0.5% w/v lipoic acid PEG NHS (LA-PEG-SC) and 2.5% w/v mPEG NHS (mPEG-SC) in 0.1 M NaHCO3 onto each coverslip and incubate for 1 h at room temperature (Figure 3C). For each 25 mm coverslip, weigh 1.5 mg of LA-PEG-SC and 7.5 mg of mPEG-SC. Dissolve the NHS reagents immediately before adding to the surfaces, as they have a short half-life (~10 min) in aqueous solution at room temperature. After the reaction, rinse surfaces 3 times with water.\n\t\tNOTE: The NHS reaction can be performed at 4 °C overnight. NHS reagents have longer half-life before hydrolysis at 4 °C, which is around 4-6 h. This will result in a three-day surface prep procedure.\nAdd 100 µL of 0.1 M NaHCO3 containing 1 mg/mL of sulfo-NHS acetate to a set of \"sandwich\" coverslips (two coverslips facing towards each other with reaction buffer in between). Allow passivation to occur for at least 30 min. To save reagent, this step could be done with 50 µL of 1 mg/mL sulfo-NHS acetate. Rinse with water three times after passivation.",
    "Add 0.5 mL of gold nanoparticles (AuNP, 8.8 nm, tannic acid, 0.05 mg/mL) to each coverslip and incubate for 30 min at room temperature (Figure 3D). To save the reagent, this step can be done by sandwiching two coverslips as well. Make sure no salts are present in the system from previous steps to avoid aggregation of gold nanoparticles. Do not leave the coverslips to dry after this step.\nMeanwhile, pre-hybridize 4.7 pN hairpin, Cy3B ligand strand, and BHQ2 anchor strand that form the DNA tension probes construct at a ratio of 1.1:1:1 in 1 M NaCl at 300 nM in a PCR tube. Anneal the strands by heating the solution up to 95 °C for 5 min, then gradually cool down by decreasing the temperature to 20 °C over 30 min in a thermal cycler.\nRinse the coverslips with water three times after 30 min of incubation with gold nanoparticles. Add additional BHQ2 anchor strand (from 100 µM stock) to the annealed DNA solution to make the ratio between BHQ2 anchor strand and Cy3B ligand strand 10:1. At this point, the DNA solution should contain 300 nM of tension probe construct and 2.7 µM BHQ2 strand. Add 100 µL per two coverslips to make the \"sandwich\" (Figure 3E).\nCarefully place a wet lab tissue ball in the Petri dish (away from coverslips) and seal the dish with paraffin film to prevent the solution from drying up. Cover the dish with foil and incubate at 4 °C overnight.\nDay 2\n\t\nWash off the excess probes from the coverslips with 1x PBS. Check for DNA tension probe surface quality under an epifluorescent microscope.",
    "Prepare 40 µg/mL of streptavidin in 1x PBS and incubate on coverslips for 30 min at room temperature (Figure 3F). Usually, 100 µL is sufficient for a 25 mm coverslip. Rinse with PBS 3 times after incubation to wash away the excess amount of streptavidin.\nPrepare 40 µg/mL biotinylated antibody/ligand in 1x PBS. Add 50-100 µL per sandwich and incubate for 30 min at room temperature (Figure 3G). Rinse with PBS three times after incubation to wash away the excess amount of biotinylated antibody/ligand.\nAssemble the clean imaging chambers with surfaces carefully. Surfaces can be easily cracked when tightening the chambers. Add 0.5-1 mL of Hank's balanced salt solution (HBSS) to the imaging chambers and keep them ready for imaging with cells (Figure 3H).\n3. Imaging cell receptor forces\nPrepare immune cells of interest in HBSS at 1-2 x 106 cells/mL.\n\tNOTE: OT-1 CD8+ naïve cells are used as an example in this paper. Purify OT-1 CD8+ naïve T cells a from the spleens of sacrificed mice using the MACS mouse CD8+ T cell isolation kit with a MACS separator following manufacturer's instruction. Isolate and enrich the CD8+ T cells by removing any non CD8+ T cells that magnetic depleting antibody cocktail bound to. Resuspend purified OT-1 CD8+ naïve T cells in HBSS at 2 x 106 cells/mL and keep on ice prior to use.\nCheck the quality of DNA hairpin tension probe surface under a fluorescence microscope (100x objective) for quality control before adding ligands or plating cells. Image and quantify the average background intensity in Cy3B channel of a DNA hairpin tension probe surface from at least 5 different positions and 3 replicates. Keep the imaging acquisition conditions consistent so that this value can be used as a reliable marker of surface quality and probe density (Figure 4C).",
    "NOTE: Quantify the number of DNA strands per gold nanoparticle and the number of gold nanoparticles per µm2 the first few times of surface preparation according to literature12, which can be used as another reliable marker of surface quality.\nPlate ~4 x 104 - 10 x 104 cells onto each DNA tension probe functionalized coverslip and allow them to attach and spread for ~15 min at room temperature.\nAs cells are plated onto the DNA hairpin tension probes and start to spread, image the fluorescence signals that are generated in the Cy3B channel with the 100x objective (Figure 3I).\nAfter cells start to produce real-time tension signal on the DNA hairpin tension probe surface in the Cy3B channel, acquire images in both Cy3B and Atto647N channels (TIRF microscopy gives better signal-to-noise ratio than epifluorescence). Subsequently, add Atto647N strand to the imaging chambers at a final concentration of 200 nM for mechanically selective hybridization.\nAfter 10 min of incubation, quickly and gently remove the buffer containing the fluorescent Atto647N locking strand and replace with fresh Hank's balanced salts. Image in both Cy3B and Atto647N channels again and determine the Pearson's correlation coefficient with Fiji software15.\nAt the timepoint of interest for the investigation, introduce non-fluorescent locking strand to the cells in the imaging chamber to store the tension signal. Prepare locking strand stock (100 µM) and add to the cells at a final concentration of 1 µM. Gently pipette to mix. The duration of locking can vary but 10 min is the recommended time.\nAcquire time-lapse movies or end-point images in epifluorescence for both qualitative tension mapping and quantitative analysis as needed (Figure 3J and Figure 5).",
    "​NOTE: If tension measurement at multiple time points is desired, initiate erasing of stored tension signals by the addition of an unlocking strand. To avoid excess rinsing, a higher final concentration of unlocking strand at 2 µM is used to initiate a toehold-mediated strand displacement reaction with the locking strand for 3 min, which erases the stored signals (Figure 3J). Gently rinse the excess oligonucleotides off with HBSS. The DNA hairpin tension probe surface and the cells are ready for another round of tension storing and mapping. Unlocking of tension signals is not necessary if only one time point is of interest in the study.\n4. Data analysis\nNOTE: Image analysis is performed using Fiji software, and the quantitative analysis is performed using analysis software.\nCorrect any drift during image acquisition with Correct 3D drift command in Registration under the Plugins menu.\nRemove the camera background of the image with Subtract command under the Process menu.\nDetermine the Pearson's correlation coefficient with the Colocalization function under Analyze menu.\nAverage and subtract the fluorescence background produced by the unopened probes from three different local background regions. Draw ROIs of cells on either background-subtracted images or RICM (reflection interference contrast microscopy) images with Image J Freehand Selections tool. Measure any metric of interest of the ROIs, e.g., integrated fluorescence intensity and tension occupancy using Measure tool under Analyze menu (Figure 6).\nExport the measurements for quantitative analysis with analysis software.\nPlot the data with any analysis software.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}