{
  "id": 2695,
  "origin_website": "Cell",
  "title": "Quantitative phenotypic screens of Aspergillus niger mutants in solid and liquid culture",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPrepare individual spore solutions of progenitor and mutant isolates\nTiming: 1 day preparation, 10 days incubation\nPurified A. niger spores suspended in water with a defined density are required for inoculating solid and liquid growth media.\nInoculate solid growth media from long term storage.\nPour minimal media (MM) plates and air dry (1 plate per strain). See materials and equipment[href=https://www.wicell.org#materials-and-equipment] section for MM recipe.\nRetrieve strains from long term storage. We store isolates as spore suspensions in 25% glycerol stocks at −80°C.\nKeep glycerol stocks on ice and do not allow to defrost.\nGently touch frozen spore solution with a sterile cotton stick and streak to a single colony forming unit (CFU).\nIncubate plates at 30°C in a static, temperature-controlled incubator for 3–5 days until single CFUs are visible.\nSubculture single colony.\nPour MM plates and air dry (5 plates per strain).\nUsing a sterile cotton stick, isolate a single CFU and subculture in a grid pattern (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2185-Fig1.jpg\nFigure 1. Exemplar image of A. niger growing on agar plate as grid format\nSub-culturing as a grid allows visual inspection of plates for fungal contamination, e.g., by colonies growing at a different rate, sporulation phenotype, or spore color. Scale bar is 1 cm.\nIncubate plates at 30°C for 5 days or until abundantly sporulated.\nHarvest spores.\nPrior to harvesting spores, inspect the plate for contamination.\nAdd approximately 10 mL sterilized water to the agar plate, and gently agitate the surface with a sterile cotton stick to release spores.\nRemove agar debris by filtering spore solution through two layers of sterile Miracloth.\nAdd sterilized water to a final volume of 30 mL, and vortex for 1 min.\nCentrifuge for 10 min at 2750 RCF.",
    "Remove supernatant, and repeat wash step one more time (d. and e.). Suspend spores in 5 mls sterile water.\nEnumerate spores using a counting chamber, and adjust to a final density of 1 × 105/mL (for solid growth assays) and 2 × 108/mL (liquid growth assays). Purified spores can be stored at 4°C and used within two weeks.\nCritical: To avoid cross contamination of genetically distinct A. niger strains, thoroughly decontaminate all working areas and equipment between spore preparation of each isolate. We routinely do this by decontaminating work surfaces using 2% Kohrsolin® FF and 15-minute periods of UV irradiation.\nCritical: For preparation of sterile Miracloth filters, cut two 10 × 10 cm squares and store both in aluminum foil. Autoclave at 121°C for 20 min and store at room temperature prior to use.\nDetermine conditions that cause sublethal growth perturbation in progenitor control on solid agar\nTiming: 1 day preparation, 5 days incubation\nSublethal growth perturbation in the progenitor strain on solid agar must first be established as (i) insufficient stress will not cause a measurable reduction in colony radial growth, and (ii) excess stress may lead to total inhibition of cell growth or death. For each progenitor strain it is therefore necessary to titrate desired stress conditions in preliminary growth assays. We typically define sublethal perturbation as a 5%–50% reduction in radial growth rates under stress conditions when compared to standard growth media controls. Here, we use hydrogen peroxide enacting oxidative stress as an exemplar. This assay should be conducted in technical triplicate.\nPrepare agar plates.\nUsing a permanent pen, mark the center spot on the back of a petri dish. Draw two lines at 180° angles through the center mark.\nPour minimal media agar supplemented with 0, 0.5, 1, 10 or 100 mM H2O2.",
    "Critical: Check stability of stress compounds during autoclaving. If necessary, add filter sterilized solutions after agar has cooled sufficiently.\nCritical: Plates must be fully dried. Droplets of water on the agar surface will result in defective spore spotting.\nOptional: Conduct a preliminary literature analysis to estimate concentrations/conditions that will result in sublethal stress prior to pouring plates.\nInoculate plates.\nVortex the 1 × 105 spore/mL solution of progenitor strain for a minimum of 1 min.\nCarefully add 10 μL of this solution to the marked center of each agar plate.\nAllow inoculum to fully dry on agar surface.\nIncubate for 5 days at 30°C.\nMeasure radial growth rates.\nUse a vernier caliper and measure from the center of the colony to the outermost hyphal edge. We conduct this on the back on the agar plate and record to the nearest 0.5 mm.\nMeasure radial growth at the four axes indicated by the marked lines (see step 4a).\nCritical: Radial growth rates should be measured visually. Automated image analysis can result in inaccurate calls of the extending hyphal front.\nCalculate reduced growth rates thus:\n   (   Average  radial  growth  rate   ( mm )   on  MM + stress   Average  radial  growth  rate   ( mm )   on  MM   )  × 100  \nA 5%–50% reduction in radial growth on MM + stress relative to MM is appropriate for subsequent steps of this protocol.\nScreen mutant and progenitor isolates on sublethal stress and control agar\nTiming: 1 day preparation, 5 days incubation\nAnalysis on radial growth rates on solid agar (+/- stress) enables the calculation of susceptibility coefficients. This assay should be conducted in technical triplicate. Sublethal perturbation that we routinely use for isolate MA70.15 are given in Table 1[href=https://www.wicell.org#tbl1].\ntable:files/protocols_protocol_2185_6.csv\nPrepare agar plates as follows:",
    "See step 4. for marking the center and measurement axes of the agar plate.\nPer strain/technical replicate, generate four MM plates supplemented with 0, 0.2, 2 or 20 μg/mL doxycycline.\nPer strain/technical replicate, generate MM plus stress (e.g., 1 mM H2O2) supplemented with 0, 0.2, 2 or 20 μg/mL doxycycline.\nAllow plates to fully dry to avoid moisture on the surface.\nCritical: Doxycycline is light sensitive, and therefore light exposure should be minimal. We therefore avoid unnecessary light exposure, e.g., by turning off room lights while plates dry. Additionally, we wrap doxycycline supplemented plates with tin foil during storage or incubation.\nOptional: Where using strains that are not tet-on conditional expression mutants (e.g., conventional deletion/overexpression or mutagenized isolates) it is not necessary to add doxycycline to growth media.\nInoculate plates, incubate, and measure radial growth as detailed in steps 5, 6 and 7.\nOptional: We routinely measure radial growth rates at days 3, 5 and 10. If desired, a single timepoint can be used.\nRecord colony images.\nInspect the lids of agar plates for condensation and if necessary either air dry in a category II microbiological hood, or wipe dry with sterile paper towels.\nRemove permanent marker on rear of plate using 95% ethanol or acetone.\nMount a camera on a tripod. We typically use mobile phone cameras, e.g., iPhone or similar.\nPlace agar plates on a light background and capture an image of the colony.\nOptional: Images of the back side of the colony can also be captured, which can be informative for noting different pigmentation between mutant and control strains.\nOptional: We routinely capture colony images at days 3, 5 and 10. To reduce work load and data storage, a single timepoint can be used.\nQuantification of mutant and progenitor control in submerged culture using MPD analysis",
    "Timing: 0.5 day preparation, 3 days incubation\nMPD analysis provides multiple measurements of submerged macromorphologies, including a quantification of culture heterogeneity (% pelleted growth), structure diameter, aspect ratio, solidity, area, and morphology number. This assay should be conducted in technical triplicate.\nInoculate liquid growth cultures.\nPrepare 100 mL Erlenmeyer flasks containing 20 mL MM supplemented with 0, 0.2, 2 or 20 μg/mL doxycycline.\nInoculate media with 100 μL of 2 × 108 spore suspension from progenitor control or mutant isolate(s). Final density is 1 × 106 spores/mL.\nIncubate flasks at 30°C, 220 RPM in the dark for 72 h.\nCritical: Trace amounts of detergent in sterilized glass wear can drastically impact morphological development of A. niger. Thoroughly wash all glass wear with distilled water prior to sterilization.\nCritical: Confirm all flasks are of identical design, as deviations (e.g., in circumference of flask neck) can modify fungal macromorphology.\nCritical: Flasks are sealed using sterilized cotton plugs or similar. Note that plugs or other method of sealing should be uniform between each flask.\nCapture images of fungal culture.\nDecant culture and biomass into a clean 50 mL falcon tube and invert gently several times to separate biomass.\nPour 5–10 mls into a 25 mL petri dish.\nCapture images of fungal culture using a desired magnification. We routinely use ∼10–20 × magnification which captures large pellets (e.g., 3 mm diameter) and dispersed mycelial fragments.\nIf you observe pelleted macromorphologies, ensure that >10 pellets are captured per fungal culture. Multiple images are advised.\nCritical: In order to define the μm/pixel ratio for quantification, capture an image of a known length (e.g., a technical ruler) at the identical magnification used for analyzing fungal macromorphology.",
    "Optional: Where macromorphological fungal structures and physically touching, gently shake the petri dish to separate them. If required, use a sterile pipette tip to physically separate them. In rare instances where biomass is very high, we dilute the culture media with either MM or distilled water immediately prior to imaging in order to separate structures. We have found that a 1:1 dilution is sufficient to separate macromorphologies for imaging."
  ],
  "subjectAreas": [
    "Biotechnology And Bioengineering",
    "Microbiology",
    "Genetics",
    "Molecular Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}