{
  "id": 12057,
  "origin_website": "Jove",
  "title": "In Vivo Inhibition of MicroRNA to Decrease Tumor Growth in Mice",
  "procedures": [
    "Animal experimentation was performed in compliance with the European Community Law (86/609/EEC) and the Spanish law (R.D. 1201/2005), with approval of the Ethics Committee of the Consejo Superior de Investigaciones Científicas (CSIC, Spain).\n1. Flank inoculation of cells and intratumoral antagomiR treatment\nCell preparation\nEngineer a Cal62 human thyroid cancer cell line (KRASG12R and p53A161D mutations) to overexpress a transgenic construct that constitutively expresses GFP and luciferase (CMV-Firefly Luc-IRES-eGFP). Select the transgenic cells by antibiotic resistance or by sorting the GFP-positive cells with flow cytometry.\nGrow the cells in Dulbecco´s modified Eagle´s medium (DMEM) supplemented with penicillin, streptomycin and 10% fetal bovine serum (FBS) at 37 °C and 5% CO2.\nSuspend 1 x 106 cells in 50 μL of phosphate buffered saline (PBS) at 4 °C.\nCell inoculation into the flanks of mice \nMix the cells with the same amount of basement membrane matrix. For example, add 1 x 106 cells in 50 μL of PBS to 50 μL of basement membrane matrix (see Table of Materials) and mix gently.\n\t\tNOTE:\nInject 100 μL of the sample (cells in PBS + basement membrane matrix) subcutaneously into the left flank of 6-week-old immunodeficient BALB/c nu/nu mice using a 1 mL insulin syringe with a 27G 1/2'' (0.4x13 mm) needle.\nIntratumoral antagomiR treatment. \nSuspend the antagomiR (see Table of Materials) or the negative control in 500 µL of RNase-free distilled water.\nPrior to the injection, prepare 2 nmol of the antagomiR or the control together with an in vivo delivery reagent (see Table of Materials) for each injection.",
    "First mix the antagomiR solution (see Table of Materials) and the complexation buffer (see Table of Materials) in a 1:1 ratio. For example, add 80 μL of miRNA-inhibitor solution (16 nmol) to 80 μL of complexation buffer (included in the in vivo delivery reagent kit, see Table of Materials).\nBring the in vivo delivery reagent to room temperature. Add 160 μL to a 1.5-mL tube and immediately add 160 μL of diluted antagomiR solution. Return remaining reagent to -20 °C. If necessary, store the reagent at 4 °C for up to one week after thawing.\nVortex immediately (10 s) to ensure complexation of the in vivo delivery reagent-antagomiR.\nIncubate the in vivo delivery reagent-antagomiR mixture for 30 min at 50 °C. Centrifuge the tube briefly to recover the sample.\nDilute the complex 6-fold by adding 1360 µL of PBS pH 7.4 and mix well.\nProceed with in vivo delivery of the reagent-antagomiR complex (8 mice/condition), or store the complex at 4 °C for up to one week prior to injection. Inject 200 μL intratumorally into each tumor (2 nmol of antagomiR).\n\t\t\tNOTE: The volume and quantity of the antagomiR is independent of the tumor volume.\nPerform the treatment 3 times each week (Monday, Wednesday and Friday) for 2 weeks.\nAnalysis of tumor growth\nInject 50 μL of a 40 mg/mL solution of D-luciferin substrate (see Table of Materials) subcutaneously at each time point with a 1 mL syringe with a 27G 1/2'' (0.4 mm x 13 mm) needle.\n\t\t\nAt 8 min post-injection, anesthetize the mice using 3% isoflurane mixed with oxygen. Assess the level of anesthesia by pedal reflex (firm toe pinch) and adjust anesthetic delivery as appropriate to maintain surgical plane.\nApply ophthalmic ointment to both eyes to prevent desiccation.",
    "Image the bioluminescent signal with in vivo imaging software (see Table of Materials).\n\t\tNOTE: Calipers can also be used to measure the tumor volume and the tumor growth.\nOnce the bioluminescence signals are obtained, analyze the tumoral growth comparing both treatments and determine the significance by using a t-test. To analyze the within-group variance use the SEM.\nTumor excision\nSeven days after the end of the antagomiR treatment, sacrifice the mice, excise the tumor and extract protein and/or RNA for future analysis. Alternatively, section the tumors and fix them for immunohistochemistry.\n2. Thyroid orthotopic inoculation of cells and systemic antagomiR treatment\nCell preparation\nEngineer a Cal62 human thyroid cancer cell line to overexpress a transgenic construct that constitutively expresses GFP and luciferase. Select the transgenic cells by antibiotic resistance or by sorting the GFP-positive cells with flow cytometry.\nGrow these cells in DMEM supplemented with antibiotics (penicillin and streptomycin) and 10% FBS at 37 °C and 5% CO2.\nSuspend 1 x 105 cells in 5 μL of PBS.\nCell inoculation into the thyroid gland of mice\nInject 100 μL of analgesic (buprenorphine) and 100 μL of antibiotic (cephalosporin) subcutaneously into 7-week-old BALB/c nu/nu mice. Disinfect the injection site with alcohol.\nInject 5 μL of the cell solution into the thyroid gland of the mice.\n\t\t\nAnesthetize the mouse using 3% isoflurane mixed with oxygen and place it under a stereomicroscope in a sterile flow cabinet.  Assess the level of anesthesia by pedal reflex (firm toe pinch) and adjust anesthetic delivery as appropriate to maintain surgical plane.\nApply ophthalmic ointment to both eyes to prevent desiccation. \nFor each mouse, disinfect the neck with iodopovidone and make an incision of approximate 2 cm in the skin with scissors. Once open, expose the neck by displacing the salivary glands.",
    "Dissect the strap muscles using dissection forceps and/or scissors to expose the trachea and the thyroid gland. Using a 10 μL microliter syringe inject 5 μL of the cell solution into the right thyroid lobule, located at the side of the cricoid cartilage.\nReposition the salivary glands and suture the incision with silk using braided, coated, non-absorbable sutures.\nAdd iodopovidone to the wound area and place the mouse on a thermic blanket while it recovers from the anesthesia.\nThe following day post-surgery, inject subcutaneously analgesic (buprenorphine) and add 3 mL of liquid ibuprofen (40 mg/mL) into 250 mL of the drinking water for 1 week.\nSystemic antagomiR treatment\n\tNOTE: Perform this step 2-3 weeks after the cell injection, when the bioluminescent signal is detectable.\n\t\nSuspend the antagomiR or the negative control in distilled RNase-free water.\nPrior to the injection, prepare 7 nmol of the antagomiR or the control together with the in vivo delivery reagent for each injection.\n\t\t\nFor the antagomiR and the in vivo delivery reagent solution preparation see step 1.3 but add 7 nmol of the miRNA-inhibitor per mouse.\nAdminister the solution intravenously by retro-orbital injection of the venous sinus of the mouse. Use isoflurane to induce anesthesia.\n\t\tNOTE: Assess the level of anesthesia by pedal reflex (firm toe pinch).\nTreat the mice 3 times a week (Monday, Wednesday and Friday) for 2 weeks.\nAnalysis of tumor growth\nDetermine the tumor bioluminescent signal twice weekly to calculate tumor growth.\n\t\t\nInject 50 μL of a 40 mg/mL solution of D-luciferin substrate at each time point via subcutaneous injection.\nAt 8 min post-injection, anesthetize the mice using 3% isoflurane mixed with oxygen and image the bioluminescent signal with in vivo imaging software.",
    "Once the bioluminescence signals are obtained, analyze the tumoral growth comparing both treatments and determine the significance by using a t-test. To analyze the within-group variance use the SEM.\nTumor excision\nSeven days after the end of the antagomiR treatment period, sacrifice the mice, excise the tumor and extract protein and/or RNA for future analysis. Alternatively, section the tumors and fix them for immunohistochemistry.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}