{
  "id": 3402,
  "origin_website": "Cell",
  "title": "Generation of mouse models carrying B cell restricted single or multiplexed loss-of-function mutations through CRISPR-Cas9 gene editing",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPart 1. Lentiviral preparation\nTiming: 1 week total; 1 h for Day 1, 3 h for Day 2, 2 h for Day 3, 2 h for Day 4, and 6 h for Day 5\nThis section details methods and tips for preparation of high-titer lentivirus.\nDay 1 – Plating 293T.\nSeed 1.8–2.0 × 106 HEK293T cells per 10 cm2 plate in 10 mL DMEM + 10% FBS (no antibiotics).\nAdd cells dropwise and gently swirl to mix evenly.\nIncubate (37°C, 5% CO2) until the following afternoon until ∼60%–70% confluence (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2982-Fig1.jpg\nFigure 1. Example of suboptimal (left and right), and optimal (middle) confluence for HEK293T cells at time of transfection\nScale bar: 100 μm.\nDay 2 – Transfection of 293T cells.\nIn a biosafety cabinet, set up 2 sterile 1.5 mL tubes per plate. Perform the below steps for each plate.\nIn one 1.5 mL tube, prepare a mixture of the 3 transfection plasmids: psPAX2 packaging plasmid (9 μg), VSV-G envelope plasmid (0.9 μg), pLKO5 vector expressing sgRNA of interest and mCherry (9 μg), and add OPTI-MEM to reach a total volume of 225 μL.\ntable:files/protocols_protocol_2982_2.csv\nIn second 1.5 mL tube, prepare a dilution of TransIT-LT1 transfection reagent: 36 μL OPTI-MEM, 54 μL TransIT-LT1 added dropwise.\nMix by swirling the tip or gently flicking the tube (but not pipetting or vortexing).\nIncubate for 5 min at room temperature (20°–25°C).\nAdd the diluted TransIT-LT1 mix to the 3 plasmid mix dropwise and mix by swirling the tip or gently flicking the tube.\nIncubate the transfection mix for 30 min at room temperature (20°–25°C).\nCarefully add the transfection mix dropwise to the plate of HEK293T cells. Be careful not to dislodge cells.",
    "Move cells to lentivirus room BSL2 incubator and incubate for 18 h or until the following morning (37°C, 5% CO2).\nDay 3 – Media change.\nUse a 10 mL serological pipet to remove starting media.\nThen, using a 10 mL serological pipet, add 10 mL of virus harvest media (DMEM with 20% FBS, 1% GlutaMAX, 1% MEM-NEAA) very slowly (suggestion: 1 mL/10 s) against side of plate to reduce dislodging of cells.\nIncubate cells 24 h (37°C, 5% CO2).\nDay 4 – Virus harvest 1 and media change.\nUsing a 10 mL syringe, carefully remove virus-containing media from the plate.\nAttach a 0.45 μm filter to syringe and filter into a 50 mL tube.\nNote: Viral harvest from plates containing the same virus may be pooled. The first- and second-day’s viral harvest will also be pooled. Do not fill over 40 mL per Falcon tube and keep on ice or at 4°C.\nUsing a 10 mL serological pipet, add 10 mL of virus harvest media very slowly (suggestion: 1 mL/10 s) against side of plate to reduce dislodging of cells.\nIncubate cells 24 h in lentivirus room (37°C, 5% CO2).\nStore virus harvest at 4°C (in cold room) overnight (12–16 h).\nDay 5 – Virus harvest 2, Lenti-X concentration, and preparing virus aliquots.\nRepeat viral harvest with syringe and filter, pooling as desired (but keep tube volume under 40 mL).\nAdd 1:3 dilution of Lenti-X Concentrator, for example: 10 mL Lenti-X to 30 mL virus, 13.3 mL Lenti-X to 40 mL virus. Mix by inverting 10 times.\nIncubate at 4°C for 2–4 h.\nSpin in refrigerated centrifuge at 1,500 × g for 45 min.\nDecant off supernatant in a container with 100 mL bleach (to inactivate any residual viral particles).\nResuspend pellet(s) in 50–100 μL single-use aliquots.",
    "Store at −80°C until use.\nCritical: Do not freeze-thaw viral preparations as it considerably reduces viral titers.\nPause point: Virus can be stored at −80°C for up to 6 months without substantial loss of titer.\nPart 2. Hematopoietic stem and progenitor isolation and lentiviral transduction\nTiming: 12 h\nThis section details methods for isolation of hematopoietic stem and progenitor cells [i.e., Lineageneg Sca1pos c-Kitpos (LSK) cells] and in vitro transduction with high-titer lentivirus.\nDay 1(morning)- Isolation of total bone marrow cells.\nEuthanize donor mouse of interest (see ‘before you begin[href=https://www.wicell.org#before-you-begin]’ for choice of strain) according to approved methods, collect spine and complete lower limbs.\nRemove all muscle from bones and smash spine, femur, tibia, and fibula from each of the lower limbs with mortar and pestle in RPMI + 10% FBS media. Use approx. 40 mL of media (4 rounds of smashing with 10 mL media each).\nFilter media through a 40-μm filter placed on a Falcon 50 tube.\nNote: Cut spine into pieces once in the mortar to smash more effectively and use pestle to prevent any pieces from falling into the filter when decanting off. It takes approximately 15 min to process one bone marrow.\nCount cells in a standard cell counting chamber before proceeding with hematopoietic progenitor enrichment.\nNote: Expected total cell count: 180 to 250 million cells per mouse.\nSpin down (400 g, 5 min at 4°C) and resuspend in FACS buffer (2% FBS, 2 mM EDTA in PBS) using 1 mL of buffer per 100 million cells.\nEnrich hematopoietic progenitors using EasySep Mouse Hematopoietic Progenitor Cell Isolation Kit according to the manufacturer’s instructions (https://cdn.stemcell.com/media/files/pis/10000003753-PIS_02.pdf?_ga=2.128784460.1514010518.1675898534-1149677530.1675898534[href=https://cdn.stemcell.com/media/files/pis/10000003753-PIS_02.pdf?_ga=2.128784460.1514010518.1675898534-1149677530.1675898534]).",
    "Note: when pouring enriched cell suspension into a 50 mL collection tube, hold and pour from magnet with one hand and collect excess cell suspension at the tip of the flow tube using a P1000 tip.\nCount after EasySep isolation (expected count: 15 to 20 million cells per mouse).\nDay 1 (afternoon)- Sorting of Lineage-/Sca-1+/c-Kit+ (LSK) cells by flow cytometry.\nAfter EasySep isolation, spin down (400 g, 5 min at 4°C) and resuspend in sterile FACS buffer for sort using approximately 1 mL FACS buffer per 20 × 106 cells.\nRemove supernatant gently using a P1000 tip to prevent cell loss and proceed with staining using the same 50 mL Falcon tube.\nBlock Fc receptors by incubating cells with 1 μL purified anti-CD16/32 (1:100 dilution) per 1 million cells on ice for 10 min.\nNote: during incubation, start thawing Stemspan media for collection and culture.\nStain cells with the following antibodies and incubate on ice for 15 min in the dark:\ntable:files/protocols_protocol_2982_3.csv\nAfter staining, wash by adding ∼10 mL FACS buffer and spinning down (a high volume wash helps minimize cell loss).\nDiscard supernatant using P1000 and resuspend in FACS buffer using approximately 1 mL/20 × 106 cells.\nRight before sorting, filter using a 40-μm filter cap polystyrene 5 mL FACS tube.\nSort Lineage- cells that are Sca-1+ and c-Kit+ (sorting strategy in Figure 2[href=https://www.wicell.org#fig2]) into StemSpan media with murine cytokines thrombopoietin (TPO) and stem cell factor (SCF) at 50 ng/mL; expect a LSK population frequency of around 2%–3%.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2982-Fig2.jpg\nFigure 2. Schematic representation of steps required to extract LSKs via cell sorting\nImage adapted from Figure S1A of ten Hacken et al.3[href=https://www.wicell.org#bib3] with permission from the journal.\nNote: Expected output per each bone marrow is 180–250,000 LSKs.\nDay 1 (late afternoon) - LSK Transduction.",
    "Gently resuspend sorted cells in a 50 mL Falcon tube at 20,000 LSKs/mL in pre-warmed media (StemSpan with 50 ng/μL TPO and 50 ng/μL SCF) and gently invert tube for homogenous resuspension.\nPlate cells according to downstream application (48-well plate for titration vs. 6-well plate for in vivo transplantation) at 20,000 LSKs/mL.\nNote: In a 48-well plate add 1 mL per well, in 6-well plates add maximum 5 mL per well.\nIncubate plate for 20–30 min at 37°C, 5% CO2.\nDuring this time, make sure virus and polybrene are thawing on ice and centrifuge for spinfection is pre-warmed at 37°C.\nFor transduction: first add polybrene 1 μL/mL (concentration = 10 μg/μL stock aliquots) then 10 μL virus added dropwise.\nResuspend gently using a P1000.\nSpin for 2 h, 900 g at 37°C.\nCritical: make sure centrifuge spinning temperature is stable throughout the run as this may largely impact transduction efficiency.\nRemove plate and incubate plate at 37°C overnight (12–16 h).\nThe below steps highlight procedures required to: assess viral transduction efficiency in vitro\n(step 9) and in vivo transplantation of engineered LSKs (part 3[href=https://www.wicell.org#sec3.3]).\nLentiviral transduction read out in vitro:\nChange LSK media after overnight (12–16 h) incubation: spin plate for 5 min at 400 g and exchange media extremely gently.\nBe careful when moving plate from incubator to hood to avoid dislodging cells.\nIncubate at 37°C for 72 h post transduction, then assess mCherry positivity by flow cytometric analysis.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2982-Fig3.jpg\nFigure 3. Example of successful viral titration, as identified by presence of >60% mCherry+ LSKs at 72 h post-transduction",
    "Note: an optimal viral titer yield is 60% transduction rate achieved after transducing LSKs with 10 μL virus per mL (Figure 3[href=https://www.wicell.org#fig3]). Virus volume is proportionally scaled up when utilizing plates of different size (e.g., 6 mL plates allow transduction of up to 5 mL cells, with 50 μL virus/well).\nCritical: individual titers should be very high (>50% transduction rate with 10 μL virus) to ensure efficient multiplexed transduction of LSKs.\nPart 3. Transplant of lentivirally-engineered LSKs into recipient mice\nTiming: 4 h Day 1, 6 h Day 2\nThis section describes procedures for transplant of engineered LSKs into pre-conditioned immunocompetent or immunodeficient recipient mice.\nPre-condition 8–12 week old CD45.1 (JAX ID: B6.SJL-Ptprca Pepcb/BoyJ) recipient mice with 800 rads split dose irradiation (2 doses of 400 rads each), one day prior to injection. If recipient strain is NSG (JAX ID: NOD.Cg-Prkdcscid Il2rgtm1Wjl/SzJ), 250 rads split dose (2 doses of 125 rads each) is sufficient (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2982-Fig4.jpg\nFigure 4. Schematic transplant workflow for single and multiplexed B-cell edited mouse models\nImage adapted from Figure 1A of ten Hacken et al.2[href=https://www.wicell.org#bib2] with permission from the journal.\nOn the day of transplant, prior to collecting the transduced LSKs, isolate hematopoietic stem and progenitors from the bone marrow of a separate donor mouse.\nNote: these isolated cells will serve as ‘bone marrow’ helper cells (200,000 unsorted hematopoietic stem and progenitors to be co-injected with transduced LSKs per recipient mouse) to facilitate immune reconstitution of recipient mice.\nCollection and transplant of lentivirally-transduced LSK cells.\nSpin plate containing transduced LSKs at 400 g for 5 min at room temperature (20°–25°C) to allow cell adhesion to bottom of plate.\nCritical: Open plate adapter very gently inside lentiviral hood to avoid cells returning in suspension.",
    "Thoroughly collect all cells and wash with PBS containing 20% FBS (PBS- 20% FBS) and transfer to 15 mL Falcon tubes.\nSpin for 5 min at 400 g at room temperature (20°–25°C).\nAdd 1 mL PBS- 20% FBS to well.\nGently collect by pipetting 3–4 × against the side and bottom of well to wash cells off the surface.\nCritical: Be extremely gentle to avoid lysing cells, minimize bubbles, and try to use a circular motion with pipet to dislodge cells at edges.\nCollect cells into a 15 mL tube and repeat one wash with 5 mL PBS.\nNote: Samples of the same condition should be pooled.\nSpin tubes at 400 g for 5 min at room temperature (20°–25°C).\nRemove supernatant with P1000 until about 1 mL remains, then use P200 to remove supernatant until ∼100–150 μL remains.\nCritical: Be careful not to disturb pellet.\nGently resuspend samples in a total of 600–650 μL PBS per cells for every 5 mice.\nSplit sample into 1 eppendorf per cage with 600–650 μL resuspended cells – 100 μL injection per mouse plus extra volume to account for syringe dead volume.\nInject 100 μL cells into the tail vein of recipient mice.\nPart 4. Verification of single or multiplexed gene edits\nTiming: 2 weeks total, 4–6 h for Day 1, 5 h Day 2, 3 h for Day 14\nThese steps describe procedures necessary for assessment of efficacy of gene editing in mature B cells in transplanted mice in vivo.\nIsolate B cells from the peripheral blood of animals at 4 months post-transplant by cell sorting.\nTo do so, draw 200 μL peripheral blood from the submandibular vein, and lyse erythrocytes by incubating blood with 1 mL Ammonium-Chloride-Potassium (ACK) lysis buffer for 5 min.\nWash cells with FACS buffer.",
    "Stain cells with 100 μg each of the following antibodies:\ntable:files/protocols_protocol_2982_4.csv\nSort edited (GFP+mCherry+) B cells according to sorting strategy in Figure 5[href=https://www.wicell.org#fig5], with an expected sorting output of 5–10,000 cells per sample.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2982-Fig5.jpg\nFigure 5. Schematic workflow for isolation of edited B cells from peripheral blood via cell sorting\nDonor-derived (CD45.2+) lymphocytes, which express B220 (i.e., B cells) and are double positive for GFP (i.e., Cas9) and mCherry (i.e., lentivirus) are selected for sorting.\nPerform multiplexed PCR assessment of gene edits on DNA isolated from edited B cells.\nIsolate DNA from sorted cells via the QIAamp DNA Microkit and amplify 5–10 ng by multiplexed PCR, as previously described1[href=https://www.wicell.org#bib1] on Day 2.\nCritical: to design primers for the multiplexed PCR, optimize primer design by targeting a 200bp region flanking the sgRNA cut site, ideally with identical or ±1°C melting temperature, to facilitate optimal concomitant amplification of all targets.\nPurify PCR product using a DNA, RNA and protein purification kit and submit for targeted sequencing (10–35 ng/μL concentration).\nSequence at 50–80,000 reads per sample (MiSeq is generally sufficient).\nOn Day 14, process FASTQ files by CRISPResso2 software analysis5[href=https://www.wicell.org#bib5] to assess presence of gene edits quantitatively and qualitatively in individual samples (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2982-Fig6.jpg\nFigure 6. Multiplexed PCR-based assessment of CRISPR-Cas9 introduced gene edits\nIndels, insertions-deletions. CRISPResso2 analysis results are also depicted in Figure 1A of ten Hacken et al.,2[href=https://www.wicell.org#bib2] with permission from the journal.\nInstall CRISPResso2 using the instructions here: https://github.com/pinellolab/CRISPResso2#installation[href=https://github.com/pinellolab/CRISPResso2] using Bioconda or Docker. Amplicons can be analyzed by running the command “CRISPResso --fastq_r1 {fastq read 1} --fastq_r2 {fastq read 2} --amplicon_seq {amplicon_sequence} --guide_seq {guide sequence}”.\nRead out editing rates in the file “CRISPResso_quantification_of_editing_frequency.txt” under the columns “Unmodified%” and “Modified%”. Runs should have at least 10,000 reads aligned as reported in the “Reads_aligned” column.",
    "Edited/unedited rates as well as abundance of frameshift vs. in-frame mutations is provided by the CRISPResso software output."
  ],
  "subjectAreas": [
    "Immunology",
    "Health Sciences",
    "Cell Isolation",
    "Crispr",
    "Cancer",
    "Cell Biology",
    "Genetics",
    "Molecular Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}