{
  "id": 18343,
  "origin_website": "Jove",
  "title": "High-Throughput Total Internal Reflection Fluorescence and Direct Stochastic Optical Reconstruction Microscopy Using a Photonic Chip",
  "procedures": [
    "1. Preparation of the polydimethylsiloxane (PDMS) layer\nPrepare a 10:1 mix of Sylgard 184 monomer and curing agent.\nPlace the mixture in a vacuum chamber until air bubbles are gone.\nPour 1.7 g of PDMS mixture in the center of a 3.5 inch (diameter) Petri dish.\nPlace the Petri dish on the vacuum chuck of a spin coater.\nSpin coat the Petri dish for 20 s at 900 rpm, with an acceleration of 75 rpm/s.\nCure the dish on a hotplate at 50 °C for at least 2 h.\n2. Sample preparation\nWaveguide cleaning\nPrepare 100 mL of a 1% dilution of cleaning detergent concentrate (Table of Materials) in deionized (DI) water.\nPlace the chip in a glass Petri dish using a wafer tweezer and cover completely with the detergent solution.\nPlace the Petri dish on a hot plate at 70 °C for 10 min.\nWhile still on the hot plate, rub the surface with a cleanroom tissue swab.\nRemove the chip from the Petri dish. Rinse with at least 100 mL of DI water.\nRinse with at least 100 mL of isopropanol, taking care that solvent does not dry on the surface to prevent evaporation stains.\nRinse with at least 100 mL of DI water. Blow the chip dry with a nitrogen gun.\nChamber preparation\nPrepare a layer of 150 µm polydimethylsiloxane (PDMS) in a Petri dish (section 1).\nUse a scalpel to cut a 1.5 cm x 1.5 cm frame from the PDMS layer.\nLift the frame from the Petri dish with a tweezer. Deposit it flat on a clean and polished chip. The sample is now ready for cell seeding.\nFluorescent labeling\nPrepare the following chemicals: phosphate-buffered saline solution, dye solution(s), dSTORM imaging buffer.\nAfter cell seeding, remove the chip from the media.",
    "Use a pipette to remove any excess fluid from outside the PDMS chamber.\nRemove the current fluid from inside the PDMS chamber with a pipette while adding approximately 60 µL of clean PBS at the same time.\n\t\tNOTE: The amount added to the chamber will have to be changed according to the chamber size. Be careful not to remove all media from the cell surface.\nReplace the PBS with 60 µL of clean PBS and let it incubate for 1 min.\nRepeat the previous step, letting it incubate for 5 min this time.\nRemove the PBS and replace it with 60 µL of the dye solution. Leave the sample to incubate for around 15 minutes, shielding it from light.\n\t\tNOTE: This step might have to change significantly, depending on the fluorescent dye used. We use CellMask Deep Red to label the cell membrane for this experiment\nWash the sample with PBS as in steps 2.3.3-2.3.5.\nRemove the PBS and replace it with 40 µL of the imaging buffer at the same time.\n\t\tNOTE: There are several different imaging buffers for different fluorescent dyes.\nPlace a coverslip on top, preventing air bubbles from forming underneath. Gently press the coverslip against the imaging chamber to remove any excess media.\nUse a pipette to remove any excess media outside the coverslip. Clean the area outside the coverslip with a water moist swab to avoid crystals formed by dried immersion media residues.\n3. Imaging procedure\nComponent setup\n\tNOTE: This version of the setup consists of three main components: the microscope, coupling stage, and sample stage. See the Table of Materials.\n\t\nUse a microscope with a filter holder, white light source, camera, and objective revolver.\nUse a 3-axis piezo coupling stage with a fiber-coupled laser and a coupling lens.",
    "Use a one-axis manual sample stage with tip and tilt and a vacuum holder.\nMount both the coupling and the sample stage on a 2-axis motorized stage for sample translation.\nWaveguide coupling\nPlace the chip on the vacuum chuck with the coupling facet towards the coupling objective. Make sure the chip is approximately one focal length away from the coupling objective.\nTurn on the vacuum pump.\nTurn on the laser to 1 mW. Roughly adjust the chip height so that the beam hits the edge of it. Turn off the laser.\nTurn on the white light source. Choose a low magnification objective lens (e.g. 10x). Focus the microscope on a waveguide.\nTranslate the microscope along the waveguide to see if it is well aligned with the optical path. Move the microscope to the coupling edge.\nTurn on the laser at 1 mW or less. Translate the microscope along the coupling edge to find the laser light. Focus the beam on the chip edge.\nAdjust the coupling stage along the optical path in the direction that reduces the laser beam spot size until it disappears. The beam is now either above or below the chip surface.\nAdjust the coupling stage height until the beam spot reappears and is maximized.\nRepeat the two previous steps until the laser forms a focused spot.\nMove the focused spot to the waveguide of interest.\nTranslate the microscope a short distance away from the edge so that the focused beam spot is no longer visible. Turn off the white light.\nAdjust the contrast. If the waveguide is guiding, the scattered light along the waveguide should be clearly visible.\nAdjust the axes of the coupling stage to maximize the scattered light intensity. Turn off the laser.\nTurn on the white light. Adjust the contrast if necessary.",
    "Navigate to the imaging region.\nDiffraction limited imaging\nFocus with the desired imaging objective. Turn the white light off.\nInsert the fluorescence filter and turn the laser power to 1 mW.\nSet the camera exposure time to approximately 100 ms. Adjust the contrast as needed. Ensure that the coupling is still optimized.\nLocate a region of interest for imaging. Turn on the piezo stage looping to average out modes.\n\t\tNOTE: 20 µm scan range with a step size of 50 nm is suitable for most waveguide structures.\nCapture at least 300 images.\nLoad the captured image stack to Fiji using a virtual stack. From the image menu in Fiji, choose Stacks and z-project.\nCalculate the TIRF image by choosing projection type average intensity.\ndSTORM imaging\nTurn on the laser to 1 mW and set the camera exposure time to 30 ms.\nAdjust the contrast and focus.\nIncrease the laser power until blinking is observed.\n\t\tNOTE: This might take a while, depending on evanescent field intensity.\nZoom in on a small region of the sample.\nAdjust the contrast.\nCapture a few images to see if the blinks are well separated.\nAdjust the camera exposure time for optimal blinking.\n\t\tNOTE: Optimizing blinking is a complex task, but a lot of suitable literature is available12.\nTurn on the piezo stage looping.\nRecord an image stack of at least 30,000 frames, depending on the blinking density.\ndSTORM image reconstruction\nOpen Fiji and load the dSTORM stack as virtual images.\nAdjust the contrast, if necessary.\nUse the rectangle tool to select the area to reconstruct.\nOpen Run analysis in the Thunderstorm13 plugin in Fiji.\nSet the basic camera settings in Thunderstorm corresponding to the device. The remaining default parameters are usually satisfactory.\nStart the reconstruction.",
    "NOTE: For the full field of view, the data might need to be divided in substacks, due to the large file size.\nFilter the localization list provided by the reconstruction software to remove unspecific localizations. Apple an additional drift-correction if necessary."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}