{
  "id": 2230,
  "origin_website": "Cell",
  "title": "Multi-omics profiling of single nuclei from frozen archived postmortem human pituitary tissue",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nFrozen tissue pre-crushing or pulverization\nTiming: 10–20 min\nThere are two alternate ways of conducting the first step of the method: 1) either by breaking the tissue into smaller pieces and processing one piece for nuclei extraction, 2) or by pulverizing the tissue and processing part of the powder for nuclei extraction. In either case, the remainder of the pituitary sample should be stored back at −80°C. Tissue pulverization is more advantageous than breaking a piece of tissue, as it yields a homogeneous nuclei preparation and thus precludes tissue regionalization.\nPre-chill the homogenizer on ice.\nPre-chill the ceramic mortar and pestle on dry-ice.\nPlace aluminum foil in the pre-chilled mortar.\nTransfer the frozen tissue vial from −80°C to dry-ice.\nAdd 0.2 U/μL of RNase inhibitor (NEB MO314L) to the Homogenizing Buffer (HB), 50% OptiPrep, 35% OptiPrep, and 30% OptiPrep solutions.\nFrozen tissue crushing or pulverization:\nTake out the frozen tissue sample from the vial and place it on aluminum foil in the pre-chilled mortar (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1702-Fig1.jpg\nFigure 1. Flowchart of the protocol\nThe key steps of the protocol from nuclei isolation to data analysis are depicted.\nUse the pestle to either break the tissue into small chunks or smash it into powder.\nSave an aliquot of the crushed or pulverized tissue (∼5–10 mg) for the assay, and transfer the remainder immediately on dry-ice for storage at −80°C.\nPlace the tissue chunk or powder to assay in the pre-chilled homogenizer containing 200 μL of HB.\nTissue homogenization and nuclei extraction\nTiming: 90–120 min\nDuring this 2nd step, nuclei are extracted from the tissue and purified for single nucleus (sn) multi-omics assays. All steps are done on ice using ice-cold reagents.",
    "Critical: Nuclei extraction is a critical step that must be followed precisely per protocol and in the time allotted for each step. Leaving samples on ice for any additional time, for example, may lead to poor quality sequencing data.\nHomogenize the tissue with 10–20 strokes of the Loose Pestle.\nAdd another 300 μL of HB. Incubate on ice for 5 min, and apply another 10 strokes with the Loose Pestle.\nPlace on ice a 50 mL Falcon tube with a 40 μm filter on the top, wet the filter with 100 μL of HB using standard tips. The 100 μL used to wet the filter should be retained in the 50 mL tube.\nTransfer the tissue homogenate onto the filter using standard tips.\nAdd another 500 μL HB to the glass homogenizer. Collect the wash with a pipette and transfer it to the same 40 μm filter (Figure 1[href=https://www.wicell.org#fig1]).\nMeasure the volume of the flow-through and add an equal volume of 50% OptiPrep to bring the concentration of the homogenate to 25% and keep aside until the next step.\nPrepare a gradient in one of the clear centrifuge tube for SW41 (Beckman Coulter, cat# 344059). Dispense slowly 3 mL of 35% OptiPrep at the bottom of the tube; then add a layer of 4 mL of 30% OptiPrep, followed by about 2.5–4 mL of the mixed tissue homogenate with 50% OptiPrep (Figure 1[href=https://www.wicell.org#fig1]). The volume in the tube will be between 9.5 to 11 mL at this stage.\nBalance the tubes and centrifuge in a Beckman ultracentrifuge SW41 rotor at 12,818 × g at 4°C for 25 min (Figure 1[href=https://www.wicell.org#fig1]).\nAfter centrifugation, discard the remaining of the homogenate (25% OptiPrep part of the gradient, i.e., top layer) from the tube (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1702-Fig2.jpg",
    "Figure 2. Purification of nuclei with gradient centrifugation\nFollowing gradient centrifugation, nuclei are at the border between the 30% and 35% OptiPrep. The suspension around this band is taken for further cleanup of the nuclei in preparation for downstream sn assays.\nCollect nuclei from the interphase between 30% OptiPrep and 35% OptiPrep; the volume from the SW41 tubes is about 2 mL–3 mL. Transfer nuclei to a 14 mL polystyrene round-bottom tubes (Falcon # 352057).\nCritical: For best results, nuclei should be collected around the visible band (interphase). Processing very low amounts of tissue (pieces of tissue of 1 mg or less) proves challenging for collecting the nuclei as no clear compact band can be seen. In such cases when the band is not clearly visible, the whole supernatant around the 30%–35% interphase should be collected while avoiding the bottom layer in the tube with debris and pellet under the 35% OptiPrep layer (around 3–5 mL). Refer to Figure 2[href=https://www.wicell.org#fig2].\nAdd 7 mL of ice-cold 1× PBS 0.04% BSA to the top, mix by inverting the tubes.\nSpin at 700 g for 10 min in a 4°C-pre-cooled cell culture centrifuge (Eppendorf 5804R) using a swinging-bucket rotor (A-4-44).\nCritical: To obtain good quality nuclei, it is important to use a swinging-bucket rotor.\nRemove the top layer of supernatant, leaving 500 μL behind in the tube.\nAdd 10 mL of ice-cold PBS 0.04% BSA to the top and repeat centrifugation at 500 g for 5 min at 4°C. Avoid pipetting of nuclei if possible; pipetting may result in clumping of nuclei. If pipetting, use 1 mL wide bore tips.\nRemove all but 200 μL of supernatant. Gently pipette 3 times with a 1-mL pipette tip.\nNuclei counting using fluorescent cell counter\nTiming: 10–30 min",
    "Counting the nuclei will ensure correct loading onto the 10× Genomics chips.\nPrepare counting slides and tubes (Figure 1[href=https://www.wicell.org#fig1]):\nRemove protective layers from Nexcelom counting slides.\nAdd 5 μL of nuclei suspension to 5 μL of PBS 0.04% BSA buffer in a 1.5 mL Eppendorf tube.\nAdd 10 μL of Nexcelom ViaStain propidium iodide (PI) staining solution to tube, pipette to mix.\nLoad the 20 μL onto the Nexcelom slide.\nInsert the slide into the Nexcelom K2 cell counter or an alternative fluorescence counter.\nObserve the brightfield and adjust the focus as per manufacturer’s recommendations (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1702-Fig3.jpg\nFigure 3. Quality assessment of nuclei preparation\nFollowing nuclei isolation and cleanup steps, nuclei quality is assessed and nuclei are counted on a Nexcelom fluorescent cell counter.\n(A) Image showing highly concentrated nuclei and clumps in the preparation.\n(B) Image showing the same preparation after dilution and pipetting to remove large clumps.\nMake sure that PI emits fluorescence in the red channel.\nCount nuclei on the Nexcelom K2 instrument and record nuclei number and nuclei diameter.\nBefore proceeding to the next step, note your nuclei dilution in order to calculate your total number of nuclei. The nuclei can be preserved once isolated.\nIf freezing nuclei upon isolation, follow the protocol adapted from the Collas lab (University of Oslo), http://collaslab.org/wp-content/uploads/2011/07/Isolation_somatic_cell_nuclei.pdf[href=http://collaslab.org/wp-content/uploads/2011/07/Isolation_somatic_cell_nuclei.pdf].\nRe-suspend the pelleted nuclei into 50 μL of PBS 0.04% BSA. Add up to 500 μL of Nuclei freezing medium. Mix by gently pipetting.\nFreeze aliquots directly in the −80°C freezer and store at –80°C.\nIf not freezing nuclei at the previous stage, these nuclei can now be used for single nucleus assays (See following section for details).\nIf thawing frozen nuclei for further sn assays:",
    "Take out the tube of frozen nuclei (500 μL), thaw it at 20°C–25°C temperature, and place on ice.\nDilute with 1 mL of ice-cold Buffer N.\nMix well but gently with a 1000 μL pipette tip.\nCentrifuge at 1,620 g for 15 min in a swing out rotor.\nDiscard supernatant and re-suspend nuclei in 500 μL of ice-cold buffer N.\nCentrifuge at 1,620 g for 10 min in a swing out rotor.\nRemove supernatant and wash nuclei in buffer suitable for the next sn application.\nCritical: Ensure that nuclei are fully resuspended without clumps. If clumps are observed, either gently resuspend or gently filter the nuclei suspension. If the nuclei break, this will result in additional clumping. Refer to Figure 3[href=https://www.wicell.org#fig3].\nCritical: It is necessary to have a sufficient number of concentrated nuclei, i.e., a minimum of 1,000 nuclei per μL in 10 μL, for the snATACseq and sn multiome assays.\nCritical: Loading the proper number of cells is critical for high quality data. Nuclei counting methods can be user-dependent, and thus may or may not yield reliable results for these assays. One should always assume that the counts obtained using a particular cell counting method may or may not be accurate. Reproducibility of the nuclei counts should be demonstrated. In testing various methods, we find that the counting platform we selected (based on fluorescence compared to trypan blue) for this protocol provides adequate reproducibility and stability of measurements across different users.\nNote: The K2 cellometer is our cell counter of choice for nuclei. It is not a requirement, but in our experience, it is currently the most reliable and reproducible nuclei counter on the market for downstream sn assays. Trypan blue is not reliable to count nuclei.",
    "Alternatives: Any other fluorescence-based cell counter could be used instead of the Nexcelom instrument.\nSingle nucleus assays\nTiming: 1–4 days\nSingle nucleus assays are performed following the 10× Genomics protocols. Users should follow the links below for the specific protocol to be performed.\nIf users perform snRNAseq for gene expression, they should use the 10× Genomics Chromium Next GEM Single Cell 3′ Reagent Kits v3.1 protocol: https://assets.ctfassets.net/an68im79xiti/1eX2FPdpeCgnCJtw4fj9Hx/7cb84edaa9eca04b607f9193162994de/CG000204_ChromiumNextGEMSingleCell3_v3.1_Rev_D.pdf[href=https://assets.ctfassets.net/an68im79xiti/1eX2FPdpeCgnCJtw4fj9Hx/7cb84edaa9eca04b607f9193162994de/CG000204_ChromiumNextGEMSingleCell3_v3.1_Rev_D.pdf].\nCritical: The snRNAseq assay can be performed with a nuclei concentration as low as 200 nuclei/μL in 50 μL, with a preferred range of 700 to 1,200 nuclei/μL in 50 μL.\nIf users perform snATACseq for chromatin accessibility, they should use the 10× Genomics Chromium Next GEM Single Cell ATAC Reagent Kits v1.1 protocol: https://assets.ctfassets.net/an68im79xiti/6Be7TWXkltEluNIaWgA0dj/37c815979660f6a718328d525914a5d5/CG000209_Chromium_NextGEM_SingleCell_ATAC_ReagentKits_v1.1_UserGuide_RevF.pdf[href=https://assets.ctfassets.net/an68im79xiti/6Be7TWXkltEluNIaWgA0dj/37c815979660f6a718328d525914a5d5/CG000209_Chromium_NextGEM_SingleCell_ATAC_ReagentKits_v1.1_UserGuide_RevF.pdf].\nIf users perform same-cell sn multiome for both gene expression and chromatin accessibility from the same nuclei, they should use the 10× Genomics Chromium Next GEM Single Cell Multiome ATAC + Gene Expression protocol: https://assets.ctfassets.net/an68im79xiti/7x5E4P6xefQruTbFg0yr3a/1381fdcd2d2e7d667ef5b415119dab15/CG000338_ChromiumNextGEM_Multiome_ATAC_GEX_User_Guide_RevE.pdf[href=https://assets.ctfassets.net/an68im79xiti/7x5E4P6xefQruTbFg0yr3a/1381fdcd2d2e7d667ef5b415119dab15/CG000338_ChromiumNextGEM_Multiome_ATAC_GEX_User_Guide_RevE.pdf].\nPause point: The 10× Genomics protocols include specific Pause points to use accordingly.\nPause point: The experimenter can pause after library preparations. Prepared libraries remain stable at −20°C for several months.\nPooling of libraries for sequencing\nTiming: 1–2 h\nIn this section, we will explain how we pool multiple libraries for sequencing. This step is only possible if each of the libraries is prepared with unique indexes, so as to distinguish them in sequencing.\nAccurately determine library concentration using the Qubit double stranded (ds) DNA high-sensitivity (HS) Assay in individual tubes with the Qubit3 or Qubit 4 fluorometers and following the manufacturer’s instructions (https://assets.fishersci.com/TFS-Assets/LSG/manuals/Qubit_dsDNA_HS_Assay_UG.pdf[href=https://www.google.com/url?q=https://assets.fishersci.com/TFS-Assets/LSG/manuals/Qubit_dsDNA_HS_Assay_UG.pdf&sa=D&source=docs&ust=1646146970361536&usg=AOvVaw1NRGq9jygoL2ATYSc2uflh]).\nRecord the measured library concentration from the qubit assay for use in calculating the sample molarity.",
    "Critical: Do not use the Bioanalyzer results for concentration results as those tend to be less accurate. For precision, it is recommended to quantify library concentrations using a Qubit system.\nDetermine the average fragment size in each sample by running a Bioanalyzer assay. Refer to Figures 4[href=https://www.wicell.org#fig4] and 5[href=https://www.wicell.org#fig5].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1702-Fig4.jpg\nFigure 4. Representative Bioanalyzer traces for snRNAseq QC\n(A–C) Shown are representative traces of successful Bioanalyzer QC analyses for snRNAseq (A) and sn multiome (B), each at the cDNA amplification step (i) and following library preparation (ii). Failed QC traces are shown in (C).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1702-Fig5.jpg\nFigure 5. Representative Bioanalyzer traces for snATACseq QC\n(A–C) Shown are representative traces of successful Bioanalyzer QC analyses for snATACseq (A) and sn multiome (B) libraries. Failed QC traces are shown in (C).\nAlternatives: A TapeStation system may be used instead of the Bioanalyzer.\nCalculate the molarity of each sample using the following formula:\n    Molarity in nM = [(Concentration in ng/μL) / (Fragment size in bp × 660)] × 10ˆ6.\nDilute all samples to a uniform concentration ≥ 2 nM (ex: 5 nM or 10 nM). MiSeq sequencing requires ≥ 2 nM of library concentration. Any sample whose concentration is already lower than the chosen concentration should not be diluted and kept as is.\nNote: When including samples of a lower molarity ∼2–5 nM, we recommend avoiding dilution of the samples to the lowest molarity. Lower molarity samples are assumed to be of lower quality, and although they can be included for sequencing, they should be included as undiluted stock samples. Instead of diluting to the lowest molarity, the lower molarity samples should be added to the pool with a higher volume compared to the rest of the samples to account for the lower yield.",
    "Note: We recommend keeping the sequencing pool concentration well above 2 nM. A higher starting pool concentration is better in case of any pool adjustments based on rounds of shallow sequencing. If the sample pool molarity decreases to less than 2 nM, it will be harder to continue with deep sequencing.\nPool each of the diluted sample dilutions together, using the same volume for each sample.\nMeasure the library pool concentration in duplicate using the Qubit assay, then calculate the pool molarity with the average measured concentration and the overall average fragment size.\nUse the calculated pool molarity to prepare the pool for MiSeq sequencing.\nPause point: The experimenter can pause after pooling of the libraries. Pooled libraries remain stable at −20°C for several months.\nMiSeq sequencing of libraries for pool adjustment\nTiming: 30 min to load the pool – Sequencing using a v2 Nano kit: ∼17 h\nThaw a MiSeq V2 nano kit 300 cycle reagent cartridge according to manufacturer’s instructions (See ‘Chapter 3 Sequencing’ of the Illumina MiSeq System Guide).\nRefer to the Illumina ‘MiSeq System Denature and Dilute Libraries Guide, Protocol A – Standard Normalization Method’ for preparing a library pool for MiSeq sequencing.\nRefer to Illumina ‘MiSeq System Denature and Dilute Libraries Guide, Denature and Dilute PhiX Control’ for preparing PhiX control to include in MiSeq sequencing. Follow instructions for a 1% PhiX spike-in.\nRefer to ‘Chapter 3 Sequencing’ of the Illumina MiSeq System Guide to load the MiSeq reagent kit for sequencing and prepare the MiSeq instrument for a sequencing run.\nAllow the necessary duration for the MiSeq sequencing run.\nAfter completion of the sequencing run, check the read distribution results. If needed, use the results to adjust the sample volumes in the pool to further balance the sequencing read distribution prior to deep sequencing.",
    "Pause point: The experimenter can pursue with deep sequencing at any time. Pooled libraries remain stable for several months.\nDeep sequencing of libraries\nTiming: >36 h\nRun a final Bioanalyzer QC of the library pools prior to deep sequencing (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1702-Fig6.jpg\nFigure 6. Representative Bioanalyzer traces for library pool QC\n(A and B) Shown are representative traces of successful Bioanalyzer QC analyses after the pooling of snRNAseq (A) or snATACseq (B) libraries. Twenty-four libraries were pooled in both (A and B).\nWe out-source NovaSeq sequencing to the New York Genome Center and follow their guidelines for sample submission. The sequencing parameters that we use for deep sequencing of our sn libraries are the following:\nV1.5 FC.\n100 × 10 × 24 × 100 with a total number of 234 cycles.\nNo need to accommodate the dark cycles.\nQuality control of the sn sequencing data\nTiming: 1–3 days\nThe quality of the sequencing data is estimated for each dataset. We use the metrics from the CellRanger Summary output files as well as additional metrics (see Tables 1[href=https://www.wicell.org#tbl1] and 2[href=https://www.wicell.org#tbl2] below).\ntable:files/protocols_protocol_1702_9.csv\nPresented in the table are the QC metrics rules used to assess sequencing quality of the snRNAseq libraries.\ntable:files/protocols_protocol_1702_10.csv\nPresented in the table are the QC metrics rules used to assess sequencing quality of the snATACseq libraries.\nAfter samples are sequenced, follow the 10× Genomics Cell Ranger pipeline to process the sequenced data (Cell Ranger for snRNAseq, Cell Ranger ATACseq for snATAC, and Cell Ranger ARC for multiome).\nExtract relevant metrics from the summary CSV file generated through the Cell Ranger pipeline (metrics_summary.csv for snRNAseq, summary.csv for snATAC, and summary.csv for multiome). The metrics used for QC and their appropriate threshold are listed in Table 1[href=https://www.wicell.org#tbl1].\nFor each assay modality, please follow the corresponding guidelines below:\nsnRNA.",
    "Use snrna_qc.R to calculate the percentage of cells with over 20 percent of mitochondrial read counts.\nCalculate the percentage of cells with expression of XIST gene. If the result is greater than 0.1, the sample is determined as female. Otherwise, the sample is determined as male.\nsnATAC.\nUse snatac.R to calculate the nucleosome-free region (NFR) peak and mononucleosome peak.\nOptional: Determine the presence of the NFR peak and mononucleosome peak. Use Chr1-1-200000000 to generate the fragment length histogram, retaining fragments that are shorter than 600 bp for analysis. If one of the highest two peaks in the resulting density plot is located between 0 and 150 bp, then the NFR peak is determined as TRUE. If the other of the highest two peaks is located between 150 and 300 bp, then the mononucleosome peak is determined as TRUE. NFR peak and mononucleosome peak are used as additional reference metrics for quality assurance.\nsnMultiome.\nsnMultiome QC pipeline consists of the snRNA and snATAC pipelines presented above. Use multiome_qc.R to calculate both snRNA and snATAC metrics listed individually in the snRNA and snATAC sections.\nFor nuclei, sequencing data quality is assessed following the criteria listed in Table 1[href=https://www.wicell.org#tbl1] for snRNAseq and in Table 2[href=https://www.wicell.org#tbl2] for snATACseq (Reprinted with permission from (Zhang et al., 2022[href=https://www.wicell.org#bib15]) and from Elsevier under the license number 5302501441831).\nThe pipeline code has been deposited on Github and is accessible at https://github.com/sealfonlab/snRNA_snATAC_snMultiome_QC[href=https://github.com/sealfonlab/snRNA_snATAC_snMultiome_QC].\nFor the full QC outcomes of both male and female murine and human pituitaries, the reader should refer to the Supplementary Information and tables in (Zhang et al., 2022[href=https://www.wicell.org#bib15]). We are reproducing below the QC metrics summary tables for the male human samples published in (Zhang et al., 2022[href=https://www.wicell.org#bib15]) as examples. Reprinted with permission from (Zhang et al., 2022[href=https://www.wicell.org#bib15]) and from Elsevier under the license number 5302501441831.",
    "Preliminary cell type identification and quality assessment\nTiming: days to weeks\nOnce datasets have passed the QC pipeline, they are visualized as Uniform Manifold Approximation and Projection for Dimension Reduction (UMAP) for cluster identification. Preliminary analysis enables the identification of multiplets and debris in addition to the pituitary cell clusters (Figure 7[href=https://www.wicell.org#fig7]A). Clusters with low RNA counts are usually debris or dead cells, whereas clusters with very high (>2) RNA counts are often multiplets (Figure 7[href=https://www.wicell.org#fig7]B). Dying cells usually exhibit a higher than normal expression level of mitochondrial genes (Figure 7[href=https://www.wicell.org#fig7]C). After removal of the dead cells and multiplets by filtering, one can obtain a clean UMAP (Figure 7[href=https://www.wicell.org#fig7]D).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1702-Fig7.jpg\nFigure 7. Cluster identification and quality assessment\nResults obtained for the frozen archived human pediatric pituitaries processed for sn multiome.\n(A) Preliminary UMAP including multiplet and debris/dead cell clusters.\n(B) UMI/RNA count.\n(C) Mitochondrial gene content.\n(D) Clean UMAP following the removal of multiplet and debris/dead clusters."
  ],
  "subjectAreas": [
    "Genomics",
    "Rnaseq",
    "Health Sciences",
    "Cell Biology",
    "Sequencing",
    "Single Cell"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}