{
  "id": 10864,
  "origin_website": "Jove",
  "title": "Computed Tomography and Optical Imaging of Osteogenesis-angiogenesis Coupling to Assess Integration of Cranial Bone Autografts and Allografts",
  "procedures": [
    "The protocol follows the guidelines of the institutional animal care and use committee (IACUC) of The Hebrew University of Jerusalem, Israel (Request No. MD-12-13524-4), an AAALAC approved facility, and by the Cedars-Sinai Medical Center IACUC (Request No. 3770). The animals were treated in strict adherence to NIH guidelines.\n1. Preparation of Bone Allografts\nEuthanize 7- to 8-week-old Balb/C mice, or any strain different from the recipient, using the standard method of CO2 inhalation or intraperitoneal injection of 50 μl phenobarbital (65 mg/ml.; 100 mg/kg). Confirm the absence of a heartbeat and perform cervical dislocation. Alternatively, harvest the allografts from carcasses that have been kept in –20 °C and thawed prior to harvest.\nShave the calvarial region using a hair clipper, applying it against the direction of hair growth. Disinfect the carcass head by applying 70% isopropanol. Cut the scalp skin using a No. 11 scalpel and remove the periosteum.\nUsing a dental drill and a 4.5-mm inner-diameter trephine, detach a circular fragment of calvarial bone. Transfer the bone fragment to a 100-mm plastic dish containing sterile saline. At this point, observe blood and soft tissue attached to the bone fragment (Figure 1A). Obtain bone fragments in this manner from 22 donors.\nHold one bone fragment at a time using curved tweezers. Swab it thoroughly using cotton tipped applicator and remove any brain tissue, soft tissue, and blood (Figure 1B). Gently cut away any bone chips that remain attached to the graft using fine scissors so that the graft will have a perfect rounded shape.\nDip each graft once in a 15 ml tube containing 70% ethanol and twice in 15 ml tubes containing phosphate-buffered saline to wash the ethanol.",
    "Freeze the allografts in a –80 °C refrigerator in cryotubes for at least 1 week. At this point, make sure the allografts appear transparent (Figure 1C).\n2. Calvarial Defect Surgery\nFor recipients use transgenic mice that express luciferase under the control of the osteocalcin promoter6.\nSterilize the tips of the surgical tools using a glass bead heater for 30 sec. Transfer the tools to a jar containing 70% isopropanol to maintain sterile conditions. Use sterile gloves.\nAnesthetize a 7- to 8-week-old female mouse by intraperitoneal injection of a ketamine- medetomidine mixture (75 mg/kg and 1 mg/kg, respectively). Pinch the animal limb to make sure it is deeply anesthetized. Do not leave an animal unattended until it regained sufficient consciousness to maintain sternal recumbency.\nShave the calvarial region using a hair clipper by applying it against the direction of hair growth. Apply hair-removing cream to remove any fur remnants and wipe it after no longer than 2 min using dry gauze followed by saline soaked gauze. Care should be taken to avoid getting it in the eyes. Alternatively, the vet eye ointment can be applied prior to hair removal as an extra layer of protection for the eyes. It is imperative that all traces of the depilatory cream be removed in order to avoid possible irritation from excessive exposure to the chemical agent. Disinfect the scalp by applying 5% chlorhexidine (Figure 1D).\nInject subcutaneously 5 mg/kg carprofen diluted in 200 µl saline. Apply vet eye ointment to prevent dryness and keep the animal on a thermal pad at all times. Position the animal under the operating binoculars.\nMake a 1-cm-long oval cut in the scalp skin using fine scissors and tweezers (Figure 1E). Hold the periosteum using curved tweezers and cut away using fine scissors.",
    "Drill the calvarial defect 2 mm anterior to the lambdoid suture by using a dental drill and a 5-mm outer-diameter trephine (Figure 1F and G). To avoid penetration of the dura mater, drill three-fourths of the way into the bone and detach the bone fragment using a spatula.\nTo implant an autograft, retrieve the bone fragment and wash it in a 10 mm plastic plate containing 10 ml sterile saline to remove debris. Do not remove the soft tissues. To implant an allograft, thaw in advance an allograft and normalize it to RT, and then wash it.\nPlace the bone graft in the defect using curved tweezers so it will not touch the defect margins ( Figure 1H). Glue the graft to the host bone using fibrin gel (5 µl of 46 mg/ml fibrinogen mixed with 5 µl of 25 U/ml thrombin).\nSuture the skin using 4-0 vicryl suture ( Figure 1I). Apply povidone-iodine to the surgical cut. Care should be taken to prevent the contamination of the suture by fur. Mark the mouse ear and inject 0.25 mg/kg Antisedan to reverse the anesthetic effect of medetomidine.\nIf the animal does wake up in 10 min, make sure it is situated on a warmed pad. Inject 200 µl sterile saline, and if needed inject 0.1 mg/kg Antisedan. Do not return an animal that has undergone surgery to the company of other animals until fully recovered.\nKeep the animals in separated cages for a week to prevent them from opening the sutures. Place mouse chow soaked in water in a petri dish on the cage floor for a few days post-op. Inject subcutaneously 200 µl of 1mg/ml Carprofen solution diluted in sterile saline once a day for 3 days after surgery to treat post-surgical pain.\nimgsrc://cloudfront.jove.com/files/ftp_upload/53459/53459fig1.jpg",
    "Figure 1. Calvarial Allograft Preparation and Calvarial Defect Surgery. The bone fragment is isolated from the calvarial region (A). Soft tissue, bone marrow, and blood are swabbed (B), and the graft is rinsed in 70% ethanol followed by two washes in phosphate-buffered saline (C, AG = allograft). The recipient mouse is prepared for surgery by shaving and disinfection of skin in the calvarial region (D). An oval cut is created in the scalp skin, and the periosteum is removed (E). Next, the calvarial defect is drilled using a 5-mm-diameter trephine (F). The bone fragment is detached using a spoon-shaped spatula, leaving the superior sagittal sinus intact (G). The allograft is then placed in the defect and secured using fibrin gel (H). Finally, the skin is sutured (I). Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/53459/53459fig1large.jpg]\n3. Micro-Computed Tomography for Characterization of the Vascular Tree\nPrepare heparinized saline. Weight 2,000 U sodium heparin and place it in 50ml plastic tube. Add 20 ml saline and shake well the tube. Fill a 20-ml Luer lock syringe with 15 ml warmed heparinized saline and connect the syringe to a 23-G scalp vein set. Affix the syringe to a syringe pump, and set it to pump 10 ml at 1 ml/min.\nSedate a mouse using an intraperitoneal injection of 50µl phenobarbital (65 mg/ml.; 100 mg/kg). Pinch the animal’s limb to make sure it is deeply sedated. Secure the mouse on its back to a fixation board wrapped with an absorbent surface liner (Figure 2A). Place the fixed mouse in a fume hood to prevent personnel exposure to fume.",
    "Cut the skin from the abdomen to the neck using fine scissors and tweezers (Figure 2B). Cut the abdominal wall up to the xiphoid process (Figure 2C). Cut the rib cage along its lateral aspect. Avoid injuring the lungs and heart, and make sure the heart is fully exposed. Use a hemostat to retract the sternum (Figure 2D).\nInsert the butterfly needle 3 mm into the left ventricle (Figure 2E). Glue the needle to the heart and chest wall using 3-sec glue (Figure 2F).\nActivate the pump immediately. After a minute, dissect the inferior vena cava in order to depressurize the vasculature (Figure 2G). Tilt the board so that liquids will flow away from the head. Successful perfusion will result in clearing the liver and blood vessels.\nWhen the heparinized saline perfusion is completed, perfuse 10 ml of 4% formaldehyde. Avoid penetration of air bubbles into the vasculature and avoid exposure to formaldehyde fumes. Successful formaldehyde perfusion will result in stiffening of the tail. Flush out the formaldehyde with 10 ml heparinized saline.\nPrepare the radio-opaque contrast agent according to manufacturer instructions. Typically, it will require mixing of the compound, diluent, and a curing agent. Use serological pipettes and mix the solution in a 15 ml plastic tube.\nPerfuse the animal with the contrast agent mixture at a rate of 1 ml/min. Observe the coronary, intestinal and hepatic blood vessels and make sure they are turning yellow after perfusion of 2 - 3 ml, indicating successful perfusion (Figure 2H). Upon completion of perfusion, cut the butterfly needle’s tubing, obtain the carcass alone and wrap it with toilet paper to prevent leakage of the solution to the calvarial region. Allow polymerization in 4 °C O/N.",
    "Dissect the calvarial region (Figure 2I); First use a scalpel to cut the skin as lateral as possible, avoiding damaging the cranial region of interest. Locate the bone graft and then use fine scissors to cut the cranial bone 10 mm away from the graft.\nScan the isolated calvarial bone sample using a μCT scanner; set field of view to 20.5 mm, X-ray energy of 55 kVp, Intensity of 145 μA, using 1,000 projections per 360° and integration time of 200 msec. Adjust μCT parameters7 to image other bone defect models.\nObserve the 2D reconstructed slices that were generated by the μCT software. Make sure to scan the region of interest is properly and then locate the calvarial defect. Assess the quality of the perfusion. After successful identification of blood vessels (Figure 2J), continue and decalcify the sample using 6% Trichloroacetic Acid (TCA) diluted in Double Distilled Water (DDW).\nRescan the sample using the parameters indicated in Section 3.10. Locate the Lambdoid suture in the reconstructed 2D slices. Define a cylindrical volume of interest (VOI) in height of 2 mm and 8 mm diameter, that is tangent to the suture – this is the anatomical site of defect.\nSegment the bone tissue from soft tissues using a global thresholding procedure; set the lower threshold to 130, and apply a constrained 3D Gaussian filter (sigma [σ] = 2.0 and support = 2) to partially suppress noise in the volumes. Generate a 3D reconstruction and make sure the VOI is properly positioned (Figure 2K).\nGenerate a thickness map using the IPL software and the “dt_object_param” function (Figure 2L).\n\tNOTE:This function describes the vessel volume for each vessel diameter.\nimgsrc://cloudfront.jove.com/files/ftp_upload/53459/53459fig2.jpg",
    "Figure 2. Perfusion using a radio-opaque agent via the cardiac approach. The mouse is affixed to the fixation board (A), and the skin is cut along the abdomen up to the neck (B). The abdominal wall is cut along the medial line up to the xiphoid process (C), and the rib cage is cut laterally (D). A butterfly needle is inserted into the left ventricle, avoiding insertion into the right ventricle, which is markedly darker (E, the right ventricle is indicated by the white dashed line), and the needle is affixed to the heart and chest wall (F). Heparinized saline (2–3 ml) is pumped into the heart, and the inferior vena cava is dissected (G, white arrow indicates the inferior vena cava). Formaldehyde (4%) is perfused and washed out; this is followed by a perfusion of yellow-dyed radio-opaque contrast agent. Successful perfusion will be evident by clearance of the blood vessels, which change color to yellow (H). After polymerization, the calvarial region is isolated (I, AG = allograft) and imaged using a µCT scanner to confirm proper perfusion (J, volume of interest is marked with orange). The sample is decalcified and rescanned (K), followed by generation of a colored thickness map (L). Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/53459/53459fig2large.jpg]\n4. Fluorescence Imaging of Bone Mineralization and Blood Perfusion\nReconstitute probes to a concentration of 2 nmol/100 µl PBS in a 1.5 ml tube (use a bisphosphonate-conjugated fluorescent probe to monitor bone mineralization and a blood-borne fluorescent agent to measure blood perfusion). Pipette gently several times to ensure homogenous dissolving of the probe.",
    "24 hr before the designated imaging session take a time-zero image; anesthetize 3 mice using 2 L/min inhalation of 100% medical-grade oxygen supplemented with 3% isoflurane in an induction chamber. After proper anesthesia has been established, lower the isoflurane concentration to 1.5% – 2%.\nApply vet eye ointment to prevent dryness and make sure thermal pad is switched on at all times. Pinch the animal limb to make sure it is deeply anesthetized. Do not leave an animal unattended until it regained sufficient consciousness to maintain sternal recumbency.\nShave the calvarial region using a hair clipper applying it against the direction of hair growth. Remove fur remnants using hair-removing cream. Any fur remnant will interfere with optical imaging. Remove sutures using fine scissors and tweezers.\nPlace three animals on the IVIS stage warmed to 37 °C for each imaging session. Set exposure time to auto, view field to C, and adjust filters. e.g., for a bisphosphonate-conjugated fluorescent probe characterized with maximal excitation at light wavelength of 680 nm, use an excitation filter of 675 nm and an emission filter of Cy5.5. Similarly, when using a blood-borne fluorescent agent with peak excitation at light wavelength 750 nm use an excitation filter of 710 nm and an emission filter of 780 nm.\nImage the mice through Living Image software by pressing the “Acquire” button. Make sure the calvarial region is completely visible (Figure 3B) For a comprehensive guide advise Lim et al 20098.\nAllow the mice to awake inhaling 100% oxygen.\nInject the 2-nmol fluorescent probe via an intravenous tail injection. At the designated imaging session, perform imaging as described above.\n5. Micro-Computed Tomography for Bone Regeneration",
    "For quantification of bone formation, anesthetize the mouse by inhalation of 3% isoflurane, as depicted in step 4.2 - 4.3. Transfer the mouse to the μCT scanner bed, and place it in the scanner.\nSet the μCT scanner’s x-ray tube potential energy to 55 kVp and intensity of 145 µA medium resolution. Using a field of view of 20.5 mm, perform a scout (single x-ray) scan and define a region of interest extending from the mouse’s eyes to the back of its skull. Perform a CT scan, using 1,000 projections per 360° and integration time of 200 msec.\nReconstruct the 2D slices using a nominal spatial resolution of 20 µm. Align the defect margins to a standardized position using μCT software9.\nSimilar to step 3.20, define a cylindrical volume of interest and apply the constrained 3D Gaussian filter (σ = 0.8 and support = 1) to partially suppress noise in the volumes. Segment the bone tissue from soft tissues using a global thresholding procedure.\nDetermine the volume of mineralized bone tissue in the volume of interest.\n6. Bioluminescence Imaging of Stem Cell Recruitment and Differentiation\nPrepare the mouse for imaging as depicted in Sections 4.2-4.4 and awake the mice by inhalation of 100% oxygen.\nAdminister 126 mg/kg beetle luciferin to each mouse via intraperitoneal injection, and return the animal to the induction chamber. After 2 min, anesthetize the animal using 3% isoflurane. Place the mice on the IVIS warmed stage.\nVia Living Image software, set the exposure time to “auto,” and the field of view to C. Image the mice 5 min after luciferin administration. Image the animals as depicted in step 4.6, using the “Bioluminescence” modality Define regions of interest because transgene expression varies between mice. Normalize the calvarial signal to the tail.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}