{
  "id": 19476,
  "origin_website": "Jove",
  "title": "Measuring and Interpreting Oxygen Consumption Rates in Whole Fly Head Segments",
  "procedures": [
    "1. Instrument Preparation\nNote: For this experiment, we have used a Seahorse XF24 device with “islet plates”. The operation of the technique uses different cycles of mixing, waiting and measurements as well as the possibility to add substances to the measurement compartment.\nTurn on the machine well before the start of the experiment so that there is adequate time to reach the desired temperature and remain stable.\nIn the software setup (administration mode), choose the length of the cartridge calibration (here, 20 min was chosen) and the desired temperature.\n\tNote: While mitochondria or mammalian tissue measurements are typically carried out at 37 °C, fly head ambient temperature is 25 °C but results of measurements at 31 °C are published. We used 31 °C since this is the lowest temperature setting for the device at room temperature. To reach temperatures of 25 °C or lower, place the machine in a colder room or at 11 °C as recently published21.\nIn the software, use the following protocol: 3 min mixing – 2 min waiting – 2 min measuring. Depending on the experimental design, add injection steps from ports A-D after a chosen measurement step.\n\t\nFor quality check, and determination of basal OCR, wait for at least three measurement cycles before injecting the first drug via port A. For a detailed timeline of the protocol, please see reference Becker et al.13.\n2. Cartridge Preparation\nPre-calibrate the cartridge a day (or at least 4 h) prior to testing. Add 1.0 mL of Calibrant (pH 7.4) to each well and place the sensor cartridge on top of the plate and store at 37 °C without CO2 for overnight or up to 72 h. Prevent the evaporation of cartridge with parafilm if it is being hydrated for more than 24 h.",
    "Ensure that the experimental drugs are well dissolved in the medium (fresh medium + 2.5% glucose) before the start of the experiment.\nMeasure and adjust the pH of the drug solution to the pH of the vehicle at the desired temperature to avoid any pH difference during drug injection.\nPipet the drug solution to its allocated injection port. For example, use 77 μL for port A to achieve a 1:10 dilution in a 770 μL solution and subsequently 85 μL for port B.\nLoad the cartridge into the machine and begin calibration.\n3. Plate Preparation\nNote: It is strongly recommended that two people prepare the plate simultaneously. The duration of one plate preparation per two people may require ~45-60 minutes.\nAdjust the freshly prepared media + 2.5% glucose to the desired pH with 1 N HCl. Make sure that the pH is not affected by changes in temperature.\nPrepare an ice box and place a metal plate on the ice.\nOpen the islet plate (the 24-well plate) package and immerse the nets in a Petri dish (92 mm x 16 mm) with media.\nCollect one net with the inserter (a small instrument that places the net firmly in the well) and have the inserter stand up next to the microscope. Add a small drop of media to the net attached to the inserter.\nAnesthetize the flies (one week or 4 weeks old canton males were used here) by placing the flies on the ice-cold metal plate.\nUsing forceps, grab the abdomen of a fly and immerse it in the media in a Petri dish under the microscope.",
    "Using a second pair of forceps, gently remove the head of the fly. Place it in the middle of the net attached to the inserter and verify that the head is immersed in media.\nCenter the heads when there are 16 of them on the net. Remove superfluous fluid before centering the heads to prevent loss of heads while placing them in the well.\n\tNote: 16 fly heads were used as this number gave sufficient and stable data within a reasonable time of plate preparation during method establishment.\nUsing the inserter, place the net in the well. Ensure that the heads are trapped under the net. Slowly add 700 μL of media + 2.5% glucose (Figure 1). Repeat the process for each of the wells.\n\tNote: 20 wells of fly head samples and 4 empty wells for background calibration per plate is recommended. Make sure that empty wells also contain a net with 700 μL of the buffer + 2.5% glucose.\nCheck the wells for air bubbles under the nets via the microscope. Pipet gently up and down using a 1 mL pipet to remove any bubbles. Keep the heads centered for a reliable OCR reading.\nAdd the plate to the machine and start the measurement.\n4. Analysis of the OCR Measurements\nAt the end of the protocol, remove the cartridge.\nAs a quality check, observe any visible leftovers in the port fillings. Discard the cartridge and plate (Option 1) if the heads are not to be used for protein extraction, e.g., (see Option 2).\nExtract the spreadsheet files and quality check each well for oxygen and pH levels. Make sure that the background wells show no OCR and that oxygen levels are stable.",
    "Use an algorithm for data analysis, some of which can be chosen in the respective software. Use the AKOS algorithm for OCR values2 if the range of oxygen levels during the entire measurement, between the first and last tick (= sub-measurement) are similar between two biological samples and the oxygen levels of the last ticks are not lower than 95 (mmHg) (the heads’ OCR is markedly lower at this oxygen level), (Figure 2).\nSome conditions will cause the sample to generate a rapid OCR and may display lower oxygen levels during the 1st tick and/or in the last tick (anoxia) (Figure 3A). In such a scenario, use an alternate measurement method such as the FIXED algorithm. In anoxia, the OCR is greatly reduced due to low levels of oxygen in the solution. As such, the AKOS algorithm yields misleading readings.\n\t\tNote: The newer machine lacks the FIXED algorithm. Therefore, it is preferred to extract the total oxygen levels and plot the rate per time for the first 3-5 ticks (Figure 3).\n5. (Option 2) Biochemical Analysis of the Head Segment\nTo measure the biochemical (metabolites, proteome, etc.) properties of a head segment, adjust the run time to the requirement; however, it is possible to abort the protocol at any time and remove the plate.\nOnce the plate is removed, use non-sharpened forceps to make a hole in the net and remove it thereby releasing the heads to float.\nUsing a 1 mL pipet with a cut tip and transfer the heads to a vial.\nQuickly discard the buffer and snap-freeze the heads in liquid nitrogen. Store the heads at -80 °C for future analysis."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}