{
  "id": 2792,
  "origin_website": "Cell",
  "title": "Inducing T cell dysfunction by chronic stimulation of CAR-engineered T cells targeting cancer cells in suspension cultures",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPart I: Production of lentiviral vectors\nTiming: 10–14 days\nIn this step, lentiviral vectors carrying the CAR transgene are prepared, concentrated and titrated to determine viral vector concentration.\nNote: The viral products have been made replication-defective by isolation of packaging constructs (Rev, Gag/Pol/RRE, VSV-G) onto three separate plasmids (third-generation), greatly reducing the likelihood of recombination events that may result in replication-competent virus. However, these products still have a theoretical potential to cause DNA damage and thus should be handled with caution. All materials used in the production and handling process should be disposed of appropriately under BSL-2+ conditions.\nNote: We have titrated the DNA:Lipofectamine ratio for our packaging and target plasmids. For other plasmids, it is possible that this ratio may not be most efficient for the production of lentiviral particles, and hence, further titration may be needed.\nThaw HEK-293T cells using standard methods.\nPlate 3 × 106 cells per T175 culture flask.\nNote: All volumes and methods are described for this culture size.\n48 h later, examine the flask to determine cell confluence.\nIdeally, this should be ∼70%–80% at this time point.\nSplit HEK-293T cells.\nAspirate all culture media.\nAdd 10 mL cold DPBS to the flask and gently rinse the culture-side of the flask.\nCritical: Take care not to dislodge adherent cells from the culture plate.\nAspirate DPBS.\nAdd 3 mL 0.05% Trypsin-EDTA into the flask and coat the culture-side of the flask.\nWait 2–3 min, then wash the flask with 10 mL D10. Collect cells into a conical tube.\nCritical: Thorough washing of the culture-side of the flask will ensure high-yield collection of all viable HEK-293T cells.\nCentrifuge the cell suspension at 350 × g for 5 min.",
    "Aspirate supernatant and resuspend the cell pellet in an appropriate volume of D10 for cell counting.\nPerform a cell count and determine cell concentration.\nWe anticipate that once recovered from thaw, 3 × 106 HEK293T cells will yield ∼18–22 × 106 cells after 48 h of growth in a T175 culture flask.\nAdd 3 × 106 cells to each T175 flask and add D10 media to a final volume of 25 mL.\nPlace flask horizontally and rock the flask to ensure even cell distribution on the culture-side.\nIncubate for 48 h.\nRepeat this process for at least 2 passages after thawing prior to initiating lentivirual production.\nOn the day before lentiviral production is to begin, plate 8 × 106 HEK-293T cells in each T175 flask.\nThis should result in ∼80% confluence 24 h later.\nThe following day, transfect HEK-293T cells with lentiviral packaging and CAR constructs:\nThaw RSV.Rev, Gag/Pol, VSV-G, and target (i.e., containing the CAR transgene) plasmids.\nCombine 18 μg RSV.Rev, 18 μg Gag/Pol, 7 μg VSV-G and 15 μg target plasmid, per flask you intend to transfect, to a tube.\nBring OPTI-MEM I media and Lipofectamine 3000 solution to room temperature (RT).\nFor each transfection reaction, add 1.75 mL OPTI-MEM I each to two 5 mL round-bottom flow cytometry tubes.\nAdd 87 μL Lipofectamine 3000 to one of two OPTI-MEM I-containing tubes.\nAdd plasmid mix to the other OPTI-MEM I-containing tube.\nAdd 116 μL of P3000 Enhancer Reagent to the tube containing the plasmid dilution and incubate for 5 min at RT.\nCritical: Adding the P3000 Enhancer Reagent after the addition of plasmids is essential. Addition of plasmids after the P3000 Enhancer Reagent will result in immediate precipitation of DNA, thus reducing the transfection efficiency dramatically.",
    "Gently combine the contents of both flow cytometry tubes to produce the final transfection mixture and incubate for 15 min at RT.\nPosition the flask of HEK-293T cells upright, then add the mixture to the bottom of the flask. Gently rock the mixture over the cells to ensure even distribution of this transfection mixture.\nNote: Adding the transfection mixture directly onto the cells can result in dislodging. This can reduce the number of vector-producing cells.\nIncubate for 24 h.\nAfter 24 h, harvest and concentrate lentivirus from flasks:\nPre-cool the tabletop centrifuge to 4°C and pre-warm D10 media.\nCollect media from each flask into a 50 mL conical tube.\nAdd 25 mL fresh D10 media back to flasks for collection at the 72-h time point.\nCentrifuge the tube of collected media containing unconcentrated lentivirus at 350 × g for 5 min.\nNote: This step removes larger cell debris.\nRemove tubes from the centrifuge.\nTransfer the supernatant into 150 mL vacuum filter units with a 0.45 μm pore size.\nAttach to a vacuum.\nNote: This step removes smaller cell debris.\nNote: This filtration step can also be performed using 60 mL syringes with 45 μm syringe filters attached. This may be preferred if preparing several different constructs, where the volume of each individual preparation is low. If using this method, remove the syringe plunger, attach the filter, add supernatant into the syringe barrel, place syringe and filter on top of a 50 mL conical tube and carefully replace the plunger. Using gentle pressure, filter the supernatant into the conical tube.\nDistribute the filtered supernatant into new 50 mL conical tubes.\nUse a marker to mark the side of the tube and tube cap facing outward.\nNote: this indicates where the pellet should be:",
    "Centrifuge overnight at 8,000 × g at 4°C with acceleration on maximum and deceleration reduced to a low level (i.e., brake set at 3 out of 9).\nOptional: Overnight centrifugation can be replaced by ultracentrifugation for 2 h at 25,000 × g, under vacuum, at 4°C with maximum acceleration and reduced deceleration. This option requires distinct tubes for collection, depending on the specific ultracentrifuge.\nTowards the end of centrifugation, tightly pack ice into a bucket and create “slots” to hold 50 mL conical tubes, by quickly and forcefully plunging a 50 mL conical into the ice.\nNote: This creates a stable position for the tubes, minimizing disruption of the viral pellet.\nWhen the centrifuge stops, place the 50 mL conical tubes into the slots created on ice.\nCritical: Be very careful not to disturb or dislodge the pellet.\nAspirate supernatant carefully until there is approximately 0.5–1 mL of supernatant left in the tube.\nResuspend the viral pellet in the remaining media.\nNote: Sometimes, a faint pellet can be seen on the marked side, but not always. We have not found this to correlate with lentiviral quality or quantity. Regardless, make sure to thoroughly wash the side of the tube where the pellet should be (identified by the mark made in step 12f) to ensure that the maximal quantity of lentivirus is collected. We recommend washing 120° (∼1/3) of the tube circumference and ∼2 cm above the expected pellet site.\nSet aside 70 μL of the concentrated virus in a cryotube.\nThis will be used for viral titration.\nDistribute the remainder into the desired number of aliquots.\nFlash-freeze on dry ice.\nStore the virus aliquots at −80°C.\nRepeat steps 13a–r at the 72-h collection time point.\nPause point: Virus can be stored at −80°C.",
    "Thaw or purify the appropriate number of T cells required for lentiviral titration.\nEach viral collection being titered requires 0.7 × 106 T cells.\nResuspend T cells at a concentration of 1.25 × 106 cells/mL in R10.\nAdd to an appropriate culture vessel.\nWash the required number of anti-CD3/CD28 DynaBeads three times with R10:\nCalculate the number of beads required. Bead stimulation is optimal at a ratio of 3 beads per cell (3:1).\nCritical: DynaBeads often come at a concentration of 400 × 106 beads/mL. These beads are also heavy. As such, it is essential to ensure thorough resuspension before removing beads for use.\nTransfer the total amount of beads required into a 1.5 or 2 mL microcentrifuge tube containing 1 mL of R10.\nPlace the microcentrifuge tube onto the DynaMag-2 magnet, or equivalent.\nIncubate for approximately 30 s until the beads have collected on the side of the tube closest to the magnet.\nKeep the tube on the magnet and aspirate the media.\nCritical: being carefully not to dislodge the beads.\nRemove the microcentrifuge tube from the magnet.\nResuspend the beads in fresh R10 media.\nRepeat 17b-g twice more to achieve a total of 3 washes.\nCritical: Proper washing of the beads is important to remove the sodium azide present in the bead solution. Insufficient washing may result in poor cell viability.\nAfter third wash, resuspend the beads in an appropriate volume of R10 such that resuspension of the T cells in the bead suspension results in a final concentration of the 1 × 106 T cells/mL.\nMix beads with T cells and culture at 37°C, overnight.\nNote: Allow T cells to be stimulated for at least 18 h before proceeding. Bead–cell clumps can be observed under a light microscope.\nThaw the 70 μL lentiviral titration aliquot.",
    "Set up a dilution plate by serially diluting the virus at a 1:3 dilution, 6 times resulting in a dilutions ranging from 1:3 to 1:729:\nIn a U-bottom 96-well plate, add 100 μL R10 into wells A to F (6 wells) of a column, for each vector being titrated.\nAdd 50 μL of vector to well A and mix well by pipetting.\nTransfer 50 μL from well A to well B in the same column.\nContinue this serial dilution all the way down to the well F, which should result in a final volume of 150 μL in well F.\nNote: We use T cells (1:1 ratio CD4:CD8) for lentiviral titration. Although more labor intensive, titering virus on the same cell type to be used in experimental studies is ideal. We have compared titrations performed on primary human T cells and the T cell acute lymphoblastic leukemia (T-ALL) Jurkat cell line and found that titers are ∼10–20× higher when performed on Jurkat cells. It is feasible to determine titers on Jurkat cells with the knowledge of this discrepancy, but ultimately, the transduction efficacy in primary T cells is more unpredictable if using this method.\nSet up a titer plate by adding 100 μL of stimulated T cells (approximately 0.1 × 106 cells) to each well of a U-bottom 96-well plate, mirroring the dilution plate.\nAdd 100 μL of T cells to three additional wells (Figure 1[href=https://www.wicell.org#fig1], step 4).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2300-Fig1.jpg\nFigure 1. Schematic for setting up lentiviral titer using human T cells\nThese will serve as non-transduced controls.\nAdd 50 μL of each diluted vector from the dilution plate prepared in step 15l to the corresponding wells of the titration plate containing 100 μL of T cells.\nMix well by pipetting.\nAdd 50 μL R10 to each non-transduced control well.",
    "Incubate the plate for at 37°C for 72 h.\nAfter 72 h, remove the beads:\nMix each well gently and transfer the contents of each well into 1.5 mL microcentrifuge tubes.\nPlace the tubes onto the DynaMag-2 magnet and incubate for 1 min.\nKeep the tube on the magnet and transfer the bead-free T cells to a U-bottom 96-well plate, being careful not to disrupt the beads.\nAdd 100 μL FACS buffer into each well and centrifuge the plates at 350 × g for 5 min.\nAnalyze the efficacy (%) of transduction for each titered well by flow cytometry.\nNote: Proper titration and detection of the CAR transgene requires a well-validated detection antibody. This will vary depending on the CAR. In our case, we routinely use an antibody detecting FMC63 (refer to the key resources table[href=https://www.wicell.org#key-resources-table]) to detect our FMC63-based anti-CD19 CAR.\nUse the following formula to calculate the amount of lentiviral particles (transducible units (TU)) per mL of concentrated virus8[href=https://www.wicell.org#bib8]:\nTU/mL = (% positive cells/100) × 105 × 16.6 × dilution factor.             105 is the number of T cells in each well.             16.6 is the volume of lentivirus in each well (50 μL diluted in 100 μL in the dilution plate, then 50 μL [1/3 volume] transferred to the titer plate).\nFor example: if 15% of cells are positive at the 1:27 dilution, the titer would be:\n(15/100) × 105 × 16.6 27 = 8.1 × 106 TU/mL.\nGenerate a graph of sample dilution (x-axis) vs. sample titer (y-axis) for each vector.\nNote: It is important to remember that this titer is an estimate of the transducible units (TU)/mL.",
    "Note: The first dilution for which the percentage of positive cells is <20% is the most accurate limiting dilution for the vector. We suggest using the calculated titer from this dilution as the working titer.\nPart II: CAR T cell production\nTiming: 16–18 days\nIn this step, human T cells will be engineered to express CAR.\nPurify or thaw previously purified T cells (we start with CD4 and CD8 cells at 1:1 ratio).\nNote: If using fresh T cells, proceed directly to stimulation (step 19). If using frozen T cells, we recommend resting thawed cells overnight in R10.\nWhen ready to stimulate, wash the number of beads required to obtain a 3:1 ratio of beads:cells as previously described in steps 17a–h.\nMix T cells with beads to a final concentration of 1 × 106 T cells/mL of R10.\nCulture overnight at 37°C.\nThe next day, thaw sufficient virus to ensure a multiplicity of infection (MOI) of ∼3.\nAdd lentivirus to bead-stimulated T cells and mix gently.\nIncubate for a further 5 days (for a total of six days of stimulation).\nCount cells on alternate days to trend growth.\nRemove beads by magnetic separation as described in step 17s.\nNote: We also collect measurements of cell size, quantified as cell volume using a Coulter Principle counter. This additional parameter facilitates estimation of when T cells have plateaued from stimulation and have begun to rest. Not all cell counters allow this measurement, in which case, relying on the rate of T cell expansion (based on cell counts) should be sufficient.\nEvaluate cells by flow cytometry-based detection of the CAR transgene to determine the transduction efficiency. Refer to troubleshooting[href=https://www.wicell.org#troubleshooting], problem 1[href=https://www.wicell.org#sec6.1] if facing difficulties with transduction efficiency.",
    "Freeze cells when expansion plateaus (i.e., where the rate of division is < 1.2× over two days) and the cell volume has decreased to <300 femtoliters.\nNote: If comparing multiple CAR or cell products to each other, cryopreservation will ensure a complete return to resting phase prior to tumor challenge. This serves to set an equal “starting point” for the cell products being compared in down-stream functional evaluations.\nPart III: Chronic stimulation of CAR T cells to induce dysfunction\nTiming: 13–17 days\nIn this step, CAR+ T cells will be persistently exposed to antigen-expressing tumor cells to induce chronic receptor stimulation that drives the development of T cell dysfunction.\nNote: We routinely use Nalm6 cells that have been edited to disrupt the BH3 Interacting Domain Death Agonist (BID). These cells are partially-resistant to CAR T cell killing,1[href=https://www.wicell.org#bib1] facilitating chronic antigen–receptor engagement.\nThaw tumor cells in R10.\nCulture for at least four days to ensure recovery.\nThaw CAR T cells in R10 media and rest overnight at 37°C.\nThe day after thawing CAR T cells, count both tumor and CAR T cells.\nAdjust both to a concentration of 1 × 106 cells/mL in R10.\nEstablish co-cultures of 1 CAR+ T cell per 8 Nalm6 cells (1:8 effector:target (E:T) ratio).\nNote: While the absolute cell numbers can vary depending on cell availability, we aim for 0.25–2 × 106 T cells per culture. Each co-culture condition is set up in triplicate.\nTwo days after establishing co-cultures, collect 50–100 μL sample into a flow cytometry tube or a U-bottom 96-well plate.",
    "Stain cells to determine the number of CAR T cells (using either an antibody directly targeting the CAR or a marker contained within the CAR vector) and the number of Nalm6 cells (our Nalm6 cells are engineered to express GFP, but alternatively you could use CD10 or CD20, which are robustly expressed by Nalm6). Refer to troubleshooting[href=https://www.wicell.org#troubleshooting], problem 2[href=https://www.wicell.org#sec6.3] if facing difficulties with this step.\nNote: Throughout this protocol, check culture plates daily and replenish media when necessary, as determined by media color and approximate cell density. We aim to maintain cell cultures at 0.25–2 × 106 cells/mL, as stated above.\nNote: Due to the targeting of CD19 by the CAR, quantifying CD19 surface expression can be difficult.\nNote: Antibodies targeting additional surface or intracellular proteins of interest can be included in this staining panel.\nAnalyze stained co-cultures by flow cytometry.\nCritical: Ensure that the stopping gate is set to a specific volume and not to a specific event count. This enables calculation of cell concentration, and thus total cell number, in the culture well.\nNote: Alternatively quantification beads (such as the CountBright Absolute Counting Beads from Thermo Fisher) can be used to determine cell counts during flow cytometry analysis.\nUse the following formula to calculate the number of cells within each culture:\n(cell count by flow cytometry/volume of cells collected for analysis) × resuspension volume for analysis × correction factor.\nFor example: Each co-culture contains 1 mL and 50 μL was removed for analysis. This was then resuspended in a final analysis volume of 200 μL, of which 50 μL was acquired on the cytometer. The total number of Nalm6 cells in the co-culture would be:\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2300-Fx5.jpg",
    "Calculate the total number of Nalm6 cells and CAR+ T cells in each co-culture and then determine the following three key measurements: Nalm6 fold expansion, CAR+ T cell fold expansion, E:T ratio.\nCritical: To perform these calculations effectively the culture volume of each well should be measured at each analysis time point.\nAdd an appropriate number of Nalm6 cells to each co-culture to re-establish an E:T ratio of 1:8,\nAdjust culture volumes to ensure equivalent cell concentrations in each well.\nCritical: It is important to consider the number of residual Nalm6 cells in each culture when adding fresh Nalm6 to re-establish the E:T ratio.\nRepeat steps 33–38 every other day for the duration of the co-culture.\nNote: For standard CD28 and 4-1BB CAR T cells, we anticipate the development of dysfunction—as defined by a T cell fold-change of <1 and/or Nalm6 fold-change of >1—to occur after 13–17 days of co-culture.\nNote: As cultures expand, it may become infeasible to maintain the entire co-culture due to the quantity of Nalm6 cells required. T cells routinely expand >100× during these cultures, which would require >800 × 106 Nalm6 cells per well for a co-culture that started with 1 × 106 T cells. In these situations, we only maintain a fraction of the culture after each measurement. This mandates calculation of only fold-change in Nalm6 cells and T cells relative to the previous day. While non-traditional (compared to a calculation of fold-change over the duration of the co-culture), these measurement still provide the critical data required i.e., a fold-change in T cell counts of >1 demonstrating continued cell expansion, and similarly a fold-change in Nalm6 cells of <1 demonstrating continued killing.\nPart IV: Down-stream characterization of CAR T cells",
    "To perform any directed analysis, we purify CAR T cells from co-cultures at various time points during chronic stimulation. This can be performed either by flow-based cell sorting using the same antibodies used to identify CAR+ T cells during co-culture monitoring, or by magnetic isolation based on a surface marker. Refer to troubleshooting[href=https://www.wicell.org#troubleshooting], problem 3[href=https://www.wicell.org#sec6.5] for help if encountering difficulties.\nNote: At later time points, after the onset of T cell dysfunction and outgrowth of target cells, we recommend performing dead cell and target cell depletion prior to T cell purification regardless of purification method. This will significantly enhance the yield of CAR+ T cells. We routinely use the Dead Cell Removal Kit and CD10 Microbeads (both from Miltenyi Biotec) for these two steps."
  ],
  "subjectAreas": [
    "Biotechnology And Bioengineering",
    "Immunology",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}