{
  "id": 5881,
  "origin_website": "Bio",
  "title": "Using xCELLigence RTCA Instrument to Measure Cell Adhesion",
  "procedures": [
    "Notes: Perform all steps under sterile conditions.Avoid touching the underside of the plate where the detectors are located.Avoid scratching the electrodes located at the bottom of the well. This can occur by pipette tips coming into contact with the electrodes. When removing solutions, tilt the plate slightly and place pipette at the side of the well and gently pipette the solution up. Pre-warm HyQTase (for detaching cells) and base medium (see Recipes) at 37 °C in a water bath prior to the experiment.Use at least 3-4 wells as technical replicates for each condition being tested.Avoid errors in cell counting and/or cell clumping in the E-plate 96 wells by thoroughly mixing the cell suspension and ensuring sufficient cell-cell dissociation prior to counting/seeding. Use multichannel pipettes, where appropriate, to ensure even addition of cells to each well. Optimise the number of cells plated for every cell line being tested; for monitoring cell adhesion to the ECM, it is best to avoid overcrowding of cells/confluent monolayers.The maximum recommended volume for each well of an E-plate 96 is 200 μl.Refer to the troubleshooting guide (see Table 1 in Notes section) for more information. Preparing the E-platesWash wells with 150 μl sterile PBS and then aspirate the buffer.Coat wells with 100 μl ECM molecule of choice or with 100 μl 0.1% BSA (negative control, see Recipes) at 37 °C for 1 h.Note: The choice of ECM coating will depend on the cells being used. For HEK293 cells, which are weakly adhering cells, we have in the past used a mix of fibronectin and collagen ECM molecules (see Recipes). Remove coating and wash twice with 150 μl PBS.Block non-specific cell binding to the E-plate by incubating all wells with 100 μl 0.1% BSA at 37 °C for 1 h.",
    "Remove BSA and wash twice with 150 μl PBS.Add 50 μl of pre-warmed base medium (see Recipes) into each well and leave the E-plate in the incubator (37 °C), for at least 15 min before starting the experiment, to ensure that the culture medium and E-plate surface achieve equilibrium.Setting up the xCELLigence RTCA programNote: Program set-up needs to be completed prior to starting the experiment. Start the RTCA program.Set up the Exp Notes page (Figure 2A)–select File Directory in which to save the experiment files, fill in the experimental information, such as an experiment date, cell lines and treatments, an experimental procedure, a purpose and any additional information you would like to be saved.Set up the Layout page (Figure 2B). This page records the experiment layout for the run. Note that unmarked wells will not be scanned. Select a single well or multiple wells (replicates) at once (selected wells will be highlighted). Enter appropriate information for each well, such as cell type, number of cells, used compounds, etc. For example: Cell Type–HEK293, control, Cell number–20,000.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171206/20171206185800_8734.jpgFigure 2. Setting up the xCELLigence RTCA program–experimental details. An example of the Exp Notes (A) and the Layout page (B) for an experiment performed with HEK293 cells is shown. Four technical replicates are included for each condition. Details of the selected well in blue can be seen at the top of the page.Set up the Schedule page (Figure 3) for the plate running procedure. Experiments can be divided into multiple Steps which consist of one or several sweeps. One sweep consists of one scan across all selected wells (one measurement per well).Step 1 is considered to be the background (baseline) measurement, i.e., a scan of the E-plate prior to addition of cells (wells contain base-medium only). Step 1 is preprogrammed to be one sweep.",
    "Do not change the settings for Step 1.Make a separate Step for each time an E-plate needs to be removed from the RTCA instrument using the Add a Step option (Figure 3) (for example, add Step 2 for cell addition and Step 3 for compound addition).For continuous scanning, without pause, but with different intervals between sweeps, e.g., if measuring events occurring at different rates, use Add a Substep and edit the Interval and Sweeps by entering the appropriate values and click Apply. In the example schedule below the program will pause after Step 1 but will automatically move from Step 2.1 (substep) to Step 2.2 (substep) without the need for manual confirmation. Shorter intervals between sweeps are useful for detecting quick and potentially short-lived events, e.g., initial cell attachment to the substrate.An example set up for HEK293 cells:Step 1 (background measurement); 1 sweep (total time 00:00:06).Step 2.1 (e.g., substep to monitor initial cell attachment to substrate); 16 sweeps, 2 min interval (total time 00:30:06).Step 2.2 (e.g., substep to monitor subsequent cell spreading and adhesion to substrate); 18 sweeps, 5 min interval (total time 02:00:06).An example set up for MEFs:Step 1 (background measurement); 1 sweep (total time 00:00:06).Step 2 (to monitor cell attachment and spreading); 18 sweeps, 10 min interval (total time 03:00:06).Note: It is important to optimise the number of sweeps and intervals for your cell line of interest. To avoid wasting E-plates, first use normal 96-well plates to discover the timeline of adhesion for your cells, i.e., while some cells adhere very quickly (few minutes) and spread within 2 h, other cells may take longer to adhere and spread (3-4 h). When performing the xCELLigence adhesion experiment for the first time, you can use short intervals (e.g., as in Step 2.",
    "1 above) for 1 h to monitor cell index and then adjust the parameters for the next experiment accordingly.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171206/20171206190257_9402.jpgFigure 3. Setting up the xCELLigence RTCA program schedule–Steps and Sweeps. An example of a Schedule page is shown for HEK293 cells. Step 1 (A) is preprogrammed and should not be changed. Use Add a Step and/or Add a Substep (A) to insert additional experimental steps with different sweeps and intervals in the schedule (B).Performing the cell adhesion experiment using xCELLigence RTCA–background readingOnce the program has been set up (see above), place the pre-prepared and pre-warmed E-plate containing 50 μl of base medium into the RTCA SP Station.Click Start to begin the experiment. This will initiate Step 1 for measuring the background impedance of the base medium. This reading is used as reference impedance for cell index values. A Step-Status will now display TEST. Check the Message page to see if the status and connections of the wells measured are OK. Important: Exclude any wells that give abnormal readings. Baseline readings are expected to be close to zero. Refer to troubleshooting section (Table 1).After completion of Step 1, the Step-Status displays DONE and the program is ready for the next step.Note: The RTCA program does not move onto the next Step until it is manually instructed to do so.Remove the E-plate from the RTCA SP Station and move on to adding cells.Performing the cell adhesion experiment using xCELLigence RTCA–adding cellsRemove the growth medium from HEK293 cells (see Recipes). Wash cells with 5 ml of sterile PBS.Remove PBS, add 2 ml of pre-warmed HyQtase (volumes are adjusted for a confluent 10 cm culture dish) and incubate plates at 37 °C until all the cells have detached.",
    "Add 5 ml of base medium and then collect the cells by centrifugation (180 x g, 4 min).Note: If you use trypsin to detach cells, it is advised to subsequently inhibit trypsin activity either by using trypsin inhibitors or by adding 5 ml growth medium containing serum. We recommend using HyQtase, or other similar products, rather than digestive enzymes such as trypsin to detach cells for short-term assays where integrin function is under investigation. Integrins are sensitive to trypsin cleavage and therefore use of trypsin can affect the time taken for cells to adhere to the coated E-plates. In some cases, when cells are extremely adherent, the use of trypsin may be unavoidable and required for ECM degradation to break the cell-ECM linkage. Discard the supernatant and re-suspend the remaining cell pellet in 4 ml of base medium. Important: Pipet up and down gently multiple times to break cell clumps.Note: If using growth medium to inhibit trypsin, ensure the medium is removed completely following centrifugation, re-wash the pellet with serum-free base medium and repeat the centrifugation step above. Count cells using a method of choice (e.g., Bürker cell counting chamber), prepare a cell suspension of 2 x 105 cells/ml (dilute in base medium) and transfer 100 μl (20,000 cells; optimised for the HEK293 cell line) to each well of the pre-prepared E-plate (already contains 50 μl of base medium; therefore the total volume in each well is now 150 μl).Note: Cell numbers must be optimised for each cell line of interest so that the cells have enough space to adhere and spread. It is advised to use normal tissue culture treated 96-well plates and a bright-field microscope for this optimisation as the E-plate 96 are more costly.",
    "We have in the past used the following cells and cell numbers in xCELLigence cell adhesion assays: MEFs and human telomerase-immortalised fibroblasts: 7,500-10,000; MDA-MB-231 cells: 15,000-20,000; human iPSCs: 50,000. However, these are guidelines only. Different experimental treatments or culture conditions may impact on cell survival or on cell size and it is best to optimise the number of cells accordingly.Important: When performing a large number of conditions, it is possible that the order in which cells are added to the wells may affect the data. For example, if control cells adhere very quickly, and you expect that treated cells will respond more slowly, this difference may be exaggerated if control cells are always added first to the wells and several minutes have passed before treated cells can be plated. To overcome this potential problem, try using multichannel pipettes whenever possible to speed up cell addition and try changing the order in which cells are added to the wells in biological repeats to see if data are being influenced by the order of cell addition. If this seems to be the case, consider reducing the complexity of the experiment to reduce the intervals between cell plating. Reinsert the E-plate into the RTCA SP Station and click Start to scan Step 2.Important: The first measurement of Step 2 should be considered as time point 0 when analysing the data. During the experiment, you can follow the Plot page to see the cell index in real time. To do this, select the well/wells of interest and click Add. By clicking Add All every well included in the experiment is plotted. After completion of the experiment, open the Plot page, click Add All and select a full-time scale if you wish to collect the data from the entire experiment.",
    "If you click Average, the replicate wells (wells with the same name) will be combined and only the average cell index values are exported. Export raw data (cell index versus time) into an Excel spreadsheet by selecting Plate–Export Experiment Info."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}