{
  "id": 13356,
  "origin_website": "Jove",
  "title": "A Mouse Distraction Osteogenesis Model",
  "procedures": [
    "All experiments were carried out in accordance with protocols approved by the Animal Care and Use Committee of our institution. Sterilize all instruments prior to the procedure.\n1. Preparation of a Mold for Creating the Custom-made Distractor\nMake two incomplete rings (outer diameter, 20 mm; inner diameter, 10 mm), which are a part of the distractor, with one sheet of paraffin wax (145 mm x 74 mm) using an Evans wax carver.\n\t\nMake 4 of the same pieces. Use a wax spatula heated with a gas burner. Stack the four rings for a thickness of 5 mm. Provide space for the expansion screw and needle, 8 mm x 2 mm and 5 mm x 2 mm respectively with the Evans wax carver (Figures 1A, 1B).\nEmbed wax patterns in the silicone impression material and create a mold for the resin rings (Figure 1C).\nAfter curing the silicone impression material (approximately 5 min at room temperature), remove the wax patterns.\n2. Production of the Custom-made Distractor\nApply petroleum jelly thinly and evenly to the silicone mold. Mix 3 g of polymerization dental resin and immediately pour it into the silicone mold. Set for 5 min at room temperature (RT).\nRemove the polymerized resin ring from the mold and polish it with a carbide bar and a dental micromotor to remove the burr (about 1 min). Two resin rings are required for each custom-made distractor.\n\t\nRepeat the procedure to create the required number of resin rings (Figure 1D).\nLeave a gap of about 2 mm to fix the resin rings with utility wax and secure the outside of the expansion screw completely with transparent resin. Set the resin for 5 min at RT. When polymerization is complete, remove the expansion screw knob (Figure 1E).\n3. Surgical Protocol\nUse 8 week-old male mice.",
    "Induce anesthesia with an intraperitoneal injection of medetomidine hydrochloride at 0.3 mg/g, midazolam at 4 mg/kg, and butorphanol tartrate at 5 mg/kg of body weight.\n\t\nCarefully shave and disinfect the surgical area with 10% iodine solution, and then, administer 0.5% lidocaine hydrochloride at the right lower limb.\nMake a longitudinal skin incision (approximately 15 mm in length) at the right lower leg with a No. 15 scalpel. Bluntly separate the underlying muscles, taking care not to remove all of the periosteum. Approach from the outside to easily reach the fibula. Cut the fibula with scissors.\nGrasp the ankle with narrow thin sterile forceps, and use a sterile 27 G needle to make a hole in the bone about 5 mm from the heel. The needle should penetrate the skin, bone, and skin in that order. When the needle penetrates, cut the tip and root with a nipper so that the needle is about 15 mm.\n\t\nMake another hole in the same manner, about 2–3 mm proximal. Hold around the ankle and pass two 25 G needles under the knee in the same manner. After the needles penetrate, cut the tips and roots with a nipper (Figure 1F).\nPlace the custom-made distractor such that it is parallel to the extension direction. Fix the needles and device with enough polymerization dental resin to fill the grooves of the device. Wait for the polymerization to complete (approximately 5 min) (Figure 1G).\nBe careful not to damage the surrounding tissues. Cut the middle of the diaphysis of the tibia using a very thin cutting disc while applying a saline solution (1–2 mL).\nClose the wound with a 4-0 nylon suture.",
    "Give subcutaneous injections of buprenorphine (0.1 mg/kg) for analgesia immediately after operation. Continue buprenorphine every 12 h through postoperative day 7 and as needed thereafter.\n4. Distraction Protocol\nNOTE: There are various reports on the latency period and distraction rate, but here, representative protocols are shown.\nAfter a latency period of 5 days, start distraction at a rate of 0.2 mm/12 h. For extension, use the pin attached to the rapid expansion screw. Move the pin in the direction of the yellow arrow attached to the extension screw (Figure 1E).\nAnesthesia is not necessary during extension. Hold the tail with the little finger and palm, and fix the extension device with the forefinger and thumb.\nPerform extension (0.2 mm for 1/4 turn). Continue lengthening for 8 days, which will result in a total gap of 3.2 mm.\n5. Analysis\nRadiography analysis: After completion of extension, evaluate bone regeneration with computed tomography under general anesthesia by using 2.0% isoflurane.\n\tNOTE: If care has been taken with regard to the position of the extension device, it is possible to evaluate it with simple radiography even with the device attached.\nHistological analysis: Remove the apparatus carefully so as not to cause a fracture distraction site during sampling. Fix the sample in 10% neutral buffered formalin for 24 h at room temperature. Decalcify with Morse's solution (10% sodium citrate, 20% formic acid) overnight at 4 °C.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}