{
  "id": 7438,
  "origin_website": "Bio",
  "title": "Isolation of Healthy F4/80+ Macrophages from Embryonic day E13.5 Mouse Fetal Liver Using Magnetic Nanoparticles for Single Cell Sequencing",
  "procedures": [
    "Mouse E13.5 embryonic fetal liver extraction and cell homogenizationSacrifice the mouse and extract E13.5 embryos, placing them in ice-cold 1× PBS in a sterile 6 cm tissue culture dish.Using sharp tweezers, carefully extract the fetal livers into 200 μl of 1× PBS with 2% FBS.Using a P200, pipette repeatedly but gently to homogenize the livers and generate single cell suspensions (collagenase or other enzymatic treatments are not required).Filter the cells by passing them through a 70 μm mesh filter into 5 ml of ice-cold 1× PBS + 2% FBS in a 50 ml conical tube.Mix well, take a small aliquot for counting the cells, and centrifuge the remaining cells in a refrigerated centrifuge at 180 × g for 5 min at 4°C.F4/80-PE+ cell selection using EZ-Sep mouse PE selection kitResuspend the cells in 1× PBS + 2% FBS + 1 mM EDTA (EZ-Sep recommended medium) at room temperature and at a density of up to 108 cells per ml in a microfuge tube. (Usually, each fetal liver generates about 5-10 million cells, so each liver can be considered one sample). We usually resuspend each fetal liver in 200 µl of 1× PBS + 2% FBS in separate tubes.Add FWV peptide to a final concentration of 2 mM and mix well (~17.5 µl of 23 mM stock solution added per 200 µl of sample).Note: At this point onwards, the steps refer to the protocol for EZ-Sep mouse PE selection kit. Add 2 µl of mouse FcR blocker from the EZ-Sep kit and pipette to mix cells.At a dilution of 1:100 (based on the total volume from Step B1), add anti-F4/80-PE antibody, mix well by pipetting gently, and incubate at room temperature in a dark place for 20 min.",
    "Note: Antibody dilutions will vary depending on the antibody used and must be standardized for different antibodies. Add 2 µl of PE selection cocktail from the EZ-Sep kit, mix well by pipetting gently, and incubate at room temperature for 20 min.Add 10 µl of magnetic nanoparticles from the EZ-Sep kit, mix well by pipetting gently, and incubate at room temperature for 10 minPlace the tubes on an EasyEights EasySep Magnet from Cell Signaling Technologies (which allows for eight tubes to be processed at once) for 5 min at room temperature.Gently decant the supernatant by inverting the magnet with the tubes into a waste container (use one smooth inversion motion, do not shake).Remove the tubes from the magnet and collect the cells in 1 ml of cold EZ-Seq recommended medium by gentle pipetting along the walls of the tubes. Centrifuge at 180 × g for 5 min at 4°C.Resuspend in 200 µl of EZ-Sep recommended medium at room temperature, and repeat the magnetic nanoparticle selection steps from Step B6.Remove the tubes from the magnet and wash twice in ice-cold 1× PBS. For each wash, add 2 ml of 1× PBS along the walls of the tubes and place on the magnet for 5min. Decant the liquid gently each time, as in Step B8.After the final wash, resuspend the cells in 0.5 ml 1× PBS and proceed with single cell sequencing.Take out a small aliquot of cells and analyze using flow cytometry for the purity of F4/80-PE+ cells."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}