{
  "id": 5423,
  "origin_website": "Bio",
  "title": "Measurement of Dipeptidylpeptidase Activity <em>in vitro</em> and <em>in vivo</em>",
  "procedures": [
    "Measuring DPP4 activity in vitro The protocol to measure DPP4 enzymatic activity was performed as described by Promega (provider of the DPP4 enzymatic activity kit used in our assays). Briefly, this assay provides a DPP4-sensitive substrate (Gly-Pro-aminoluciferin) that produces a luminescent signal upon reaction with dipeptidylpeptidases (DPP) and luciferase. DPP-mediated truncation of the Gly-Pro dipeptide is necessary for this reaction, and therefore the luminescent signal is indicative of DPP enzymatic activity. Important considerations concern the preparation and dilutions of biologic samples used in these assays:Mouse serum and plasma samples should be used at 1 to 20 dilution in Prionex solution.Mouse tumors homogenates should be used at 1 to 2 and 1 to 10 dilution in Prionex solution.Note: Please refer to the notes at the end of the protocol for instructions on how to obtain tumor homogenates.Peritoneal washes (collected with 1 ml of sterile cold PBS) should be used at 1 to 2 dilution in Prionex solution.A standard curve should be performed using dilutions of recombinant human DPP4 in Prionex solution. Start at 50 ng/ml and perform 2 fold dilutions until 0.01 ng/ml.Leave 2 wells with Prionex solution only (blank wells) in order to determine the background values of the assay.Note: We recommend the dilutions to be done in a 96-well U-bottom plate, before transferring them into the luminometer plate. Prepare the samples in a final volume of at least 60 μl in order to correctly pipet 50 μl of each sample onto the luminometer plate. Transfer of samples should be done with a multichannel pipet, avoiding the generation of bubbles. When all the samples have been transferred, add 50 μl of reaction buffer (provided in the kit) to each well, using a multichannel pipet. Pipetting up and down is not necessary.",
    "Before reading the results in the luminometer, incubate plate at room temperature for 15 min, exposed to room light (do not cover the plate with light blocking foil). Preparing tumor lysates for analysis of DPP4 activityCollect tumors using sterile dissection tools and place them in cold, sterile 1x PBS.Carefully dry the tumor with a paper towel and weigh it in a precision scale (such as Veritas Analytical Balance, M124A).Place tumors in a 2 ml Eppendorf tube. Note: Tumor can be frozen at -20 °C after this step. To each tube, add a sterile stainless steel bead (5 mm) and 250 μl of cold sterile 1x PBS.Tumor lysates are generated by high speed shaking, using the TissueLyser II. Speed used is 25 Hz for 2 min. Repeat this step 2 times. The machine should be placed in a cold room. From this moment on, keep the samples on ice at all times.Centrifuge tubes in an Eppendorf centrifuge at 500 x g for 10 min, at 4 °C.Collect supernatants containing the tumor lysates into new, sterile tubes. Note: It is advisable to make at least 2 aliquots from each supernatant, to avoid multiple freeze/thaw cycles in the future analysis.Freeze supernatants at -20 °C or use them for evaluation of DPP4 activity.Collecting peritoneal washes for analysis of DPP4 activitySacrifice mice according to the regulations instituted by your working facility. If possible, we recommend the mice to be sacrificed in a CO2 chamber, as cervical dislocation might result in internal organ damage and bleeding into the peritoneal cavity.Disinfect the skin of the mouse with ethanol and cut it. Expose the entire peritoneal area, without damaging the peritoneal membrane.Inject 1 ml of cold 1x PBS, into the peritoneal cavity using a 1 ml syringe with a 20 G (0.9 x 25 mm) needle.",
    "We recommend the injection to be performed through the abdominal fat pads in order to reduce the probability of damaging organs.Collect the peritoneal wash: hold up the peritoneal membrane over the intestine (use blunt tweezers) and gently aspirate the liquid with the same syringe used to inject the PBS.Place each peritoneal wash in a 2 ml Eppendorf tube.Centrifuge tubes in a tabletop microcentrifuge (such as centrifuge 5417 R, Eppendorf) at 500 x g for 5 min at 4 °C. This step allows elimination of peritoneal cells collected with the washes.Collect supernatants containing the peritoneal washes proteins into new, Eppendorf tubes. Note: It is advisable to make at least 2 aliquots from each supernatant, to avoid multiple freeze/thaw cycles in the future analysis.Freeze peritoneal washes at -20 °C or use them for evaluation of DPP4 activity.Measuring DPP activity in vivoThe luciferin/luciferase system used to measure DPP activity in vitro can also be used to detect DPP activity in vivo, as follows:Inject 50 μl of 10 nM Gly-Pro-aminoluciferin (provided by the Promega kit) into a luciferase expressing mouse, such as the FVB-Tg(CAG-luc) mice. Injection can be intravenous or intraperitoneal. Intravenous injection results in fast systemic delivery (within 5 min, see Figure 1), while intraperitoneal injection results in luminescence detected in the peritoneal cavity area (Barreira da Silva et al., 2015).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170314/20170314083635_9140.jpgFigure 1. Example of luminescence image of FVB CAG-luciferase transgenic mice treated with control chow or chow containing DPP4 inhibitor (DPP4i). Mice were fed overnight with respective diets. DPP4i chow was sitagliptin 1.1%. Injection of Gly-Pro-aminoluciferin was done intravenously and images were acquired 3 minutes after injection. Exposition time was 1 sec. Regions of interest (ROI) were selected for quantification of radiance, calculated in photons per second per cm2 (of area selected), per steradian (sec-1 cm-2 sr-1).",
    "Place the mouse in a XENOGEN (IVIS System) and image luminescence 3-5 min after injection. The mouse should be anesthetized during the entire procedure, using an isoflurane-based anesthesia system, as specified for each research institution. For image acquisition, test different exposure times (start with 1 sec, up to 1 min)."
  ],
  "subjectAreas": [
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}