{
  "id": 19424,
  "origin_website": "Jove",
  "title": "A Visuospatial Planning Task Coupled with Eye-Tracker and Electroencephalogram Systems",
  "procedures": [
    "All procedures in this protocol were approved by the bioethics committee of the Faculty of Medicine of Pontificia Universidad Católica de Chile, and all participants signed an informed consent form before the beginning of the study (research project number: 16-251).\n1. Participant recruitment\nRecruit right-handed healthy adults (males and females) with normal or corrected-to-normal vision, and screen them on the inclusion/exclusion criteria.\n\tNOTE: In this study, 27 healthy individuals who were aged between 19 years old and 38 years old and were fluent speakers were recruited. The sample size can vary based on the desired level of statistical power, and the age range may vary depending on the specific research question to be addressed. In our protocol we calculated the sample size by taking into account the statistical Wilcoxon signed-rank test, an effect size of 0.7, an alpha level of 0.05, and a power of 0.95, as described in Faul et al.96. We used the MINI-International Neuropsychiatric Interview97, applied by a trained psychologist, to assess the participants in terms of the inclusion/exclusion criteria. Recruit only right-handed subjects to reduce variability in the EEG signal because left-handed individuals might present a different topographical distribution of EEG activity98,99,100.\n2. Stimuli preparation\nFor the planning task, create a set of stimuli using a vector graphic editor software (see Table of Materials). For each stimulus, design a grayscale maze that represents a zoo map. Inside the maze, make a gateway and several paths leading to the animal locations (e.g., in this study, there were four animal locations, see Figure 1).",
    "NOTE: In this study, we created 36 mazes in which each stimulus consisted of a zoo map with a starting gate, four images of animals located on the maze, and several paths. The paths on the maze may or may not lead to the animal locations. Using grayscale stimuli with reduced contrast is often preferred for pupillometry because it reduces the stimulation of the retinal cones, which are responsible for color vision. This shift in stimulus emphasis allows for a more sensitive measurement of changes in the size of the pupil, which are thought to reflect changes in the state of arousal or attention. Additionally, the use of grayscale stimuli reduces variability in the measurement due to differences in color vision between individuals101.\nIn order to obtain different levels of complexity in the final task, divide the stimuli based on the number of valid solutions in accordance with the established goal and rules (particularly, the goal is to plan a path to visit animal locations). The number of valid solutions refers to the number of paths possible to plan following the rules (see rules in Figure 2 and step 5.12.1.). Classify stimuli with greater than five possible solutions as \"easy\" and those with five or fewer possible solutions as \"difficult.\" Then, create an equal number of trials for each category.",
    "NOTE: Alternatively, request the stimuli created for Domic-Siede et al.54 from the authors, as those stimuli were created following these instructions. Consider that all the materials are available upon request, but the specifications are detailed here. In this study, we created 18 easy trials and 18 difficult trials. Evaluating the differences in difficulty levels at behavioral and electrophysiological levels is important because it will help to determine if you are measuring cognitive demand/cognitive effort/difficulty or intrinsic aspects of cognitive planning (see representative results and discussion sections).\nFor the control task, use the same structure as the planning task (evaluation period, maintenance, execution, response, see Figure 2), and use the same stimuli created for the planning task, but add a drawn line representing a marked path for visiting the sequence of animal locations starting from the gate until the last location (see Figure 1B). Make the marked path a slightly darker color than the main paths of the maze, with low contrast evaluated using a lux-meter (see step 2.4).\n\tNOTE: The idea behind this is to keep the psychophysical features of both conditions (planning and control tasks) as similar as possible. The traced paths of the mazes could either follow the rules or not (see section 5 of the protocol for more detail regarding the instructions given to the participants). In this study, half of the stimuli had a correct visiting sequence following the rules, whereas the other half presented errors (such as using the same path twice or crossing dead ends, see step 5.12.1 and step 5.12.3 and Figure 2).",
    "Assess the illuminance of the stimuli using a lux-meter positioned in the chinrest that the subjects will use (see step 4.5 and step 4.6) and at the same distance from the screen. Each stimulus of each condition produces a lux value. Record each value manually for further analyses.\n\tNOTE: No differences in illuminance are expected between conditions (see step 4.6). Otherwise, check the contrast of the stimuli. This is relevant if pupil diameter will be measured102.\nCreate one stimulus representing correct feedback (thumbs-up when correct) and another stimulus representing incorrect feedback (thumbs-down when incorrect) using a vector graphic editor (see Table of Materials) as well (Figure 2).\nimgsrc://cloudfront.jove.com/files/ftp_upload/64622/64622fig01.jpg\nFigure 1: Stimuli of the experimental and control task. Illustrative examples of the (A) planning and the (B) control task stimuli are shown. The stimuli represent a zoo map consisting of a gate, four animal locations in different places, and several paths. The stimuli for both conditions were similar; the only difference was that for the control task, (B) the stimuli had a marked line indicating an already existing path (black line here for illustrative purposes). This line in the real control stimuli was slightly darker, with low contrast controlled by illuminance (see step 2.4). This figure has been modified from Domic-Siede et al.54. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64622/64622fig01large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/64622/64622fig02.jpg",
    "Figure 2: Experimental design. (A) Planning task trial. Trials in this condition started with a 3 s fixation cross. Then, the participants were instructed to plan a path to visit all the four animal locations following a set of rules (10 s maximum). Next, a shifted fixation cross appeared (3 s), followed by the appearance of the maze again. In this period (execution), the subjects had to execute the trace planned in the previous planning period using their gaze with online visual feedback (given by the eye-tracker system), which delineated their gaze movement in real-time (dark line) (10 s maximum). Afterward, in the response period, the subjects had to report the sequence made during the execution by ordering the animals visited. According to their responses, feedback was delivered. (B) Control task trial. Trials in this condition started with a 3 s fixation cross. Then, the participants were instructed to evaluate whether a traced path (dark line) followed the rules or not. Next, a shifted fixation cross appeared (3 s), followed by the appearance of the maze again. In this period, the subjects had to redraw the already traced path with online visual feedback, like in the planning execution period (10 s maximum). Afterward, in the response period, the subjects had to answer (yes or no) whether the traced sequence followed the previously stated rules According to their responses, feedback was delivered. This figure has been modified from Domic-Siede et al.54. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64622/64622fig02large.jpg]\n3. Planning and control task programming\nWrite a script coding a planning task paradigm based on the Zoo Map Task66 and Porteus Maze68using a stimuli presentation/behavioral experiments software (see Table of Materials and the Supplementary File).",
    "Code the task considering two conditions (a planning condition and a control condition) with a similar structure to that explained in section 2 and section 4 (see Figure 2 and the Supplementary File).\n\t\tNOTE: It is important to use the same structure in both conditions in order to control the confounding factors and perceptive components involved in the process of solving the task demands (Figure 2). Using the same structure improves the assessment of the specific cognitive process involved in cognitive planning.\nSynchronize the communication between the display computer, the EEG computer, and the host computer (eye-tracker computer) via ethernet and parallel port communication sending transistor-transistor logic (TTL) pulses from the display computer (see Figure 3).\nWrite a code to calibrate the eye movements with the eye-tracker system at the beginning of the planning and the control tasks and after every five trials completed because gaze position on the screen is crucial for the execution period (see step 3.2.3 and step 3.3.3 of the protocol, the discussion section, and the code in the Supplementary File).",
    "NOTE: There might be delays in the computer communication. There are several methods to measure the delay between TTL pulses on two different computers, but one common approach is to use a hardware device such as a digital oscilloscope or a logic analyzer. Another approach is to use software-based methods, such as sending the TTL pulses over a network connection and using network analysis tools to measure the delay. Another approach is to synchronize the clocks of the two computers, either using a global positioning system (GPS) or network time protocol (NTP) server or using a hardware-based synchronization solution, calculate the delay between the timestamp and the time of arrival for each pulse, and average the results to obtain the overall delay between the two computers.\nWrite a code for the planning task with the following structure: the planning period, the maintenance period, the planning execution period, the response period, and feedback (Figure 2, Supplementary File).\n\t\nThe planning period: Initiate the planning condition by setting a fixation cross presented for 3 s as a baseline.\nRandomly present the set of mazes one by one (36 in this study).\n\t\tNOTE: In this planning period, participants are asked to plan a path to visit the four animal locations, with a maximum time of 10 s, following a set of rules (the rules are previously explained to them; see section 5 of the protocol to see the rules given, as well as Figure 2).\nInclude a TTL trigger in the code signaling the onset of the stimulus presentation using a tag code, and send this trigger to the EEG computer and the eye-tracker host computer for further narrower and windowed analyses.",
    "Write in the code that the planning period culminates once a button from a joystick/keyboard is pressed whenever the subject finishes planning or if the maximum time is exceeded. The reaction time (RT) must be recorded in the logfile for further analyses.\n\t\tNOTE: For this period, we used a trigger code using the number 1, but the use of hierarchical event descriptors (HED) tags over numerical codes is recommended, because HED tags provide meaning and structure to the content, thus making it easier for other researchers or collaborators to understand the content of the data.\nThe maintenance period: Initiate this period using a shifted fixation cross presented for 3 s. Locate the shifted fixation cross in the spatial position where the gate of the maze is located in order to anticipate the start position (gate) of the zoo map (see Figure 2).\n\t\tNOTE: The purpose of this period is three-fold. First, the shifted fixation cross facilitates the execution of the trace representing the planned path for the next period (see step 3.2.8). Second, during this period, the participants hold the plan elaborated during the planning period in their working memory. Finally, this period serves as an inter-trial interval to delimitate the end of the planning period and the beginning of the next period-the planning execution period.\nThe planning execution period: After shifted fixation cross is shown for 3 s during the maintenance period, present the maze again.\nSend a TTL trigger to the EEG and the host eye-tracker computer to indicate the beginning of this period using a specific tag code.\nWrite a code to give real-time visual feedback (a dark line, see the execution period in Figure 2) of the subject's gaze position approximately 992 ms after the onset of this period.",
    "NOTE: Starting to delineate with a delay (1,000 ms approximately) gives the subjects time to become oriented in the maze, allowing them to delineate their previous planned path (during the planning period) with a dark line.\nRecord the coordinates of the paths for further reconstruction of the paths made by the subjects, and score the performance offline (see step 6.1.1, Figure 4).\nEnsure a maximum time of 10 s to trace the planned path, and allow the subjects to finalize this period by pressing a button. In this way, the subjects can control when they have finished their drawn path.\nSave the RT in the logfile for further analyses.\nThe response period: Write a code for the response period, which starts after 10 s of planning execution or upon a button press at the end of the planning execution period, in which the maze disappears but the animals and their spatial positions remain on the screen.\nPlace four empty circles horizontally at the bottom of the screen in the response period.\n\t\tNOTE: The purpose of this period is to allow the subjects to indicate the sequence of animals visited during the planning execution period by putting the animals into the circles in the same order in which they visited them using a joystick or keyboard.\nConfigure the program/code to allow the subjects to use the joystick or keyboard to select each of the animals (four animals in this study) presented before and insert them into each of the four circles (see Supplementary File and Figure 2).",
    "Feedback: Write a code to deliver 3 s of feedback to the participants. A thumbs-up image should be displayed in response to valid combinations of animals visited if the rules are followed, while a thumbs-down image should be displayed if the combination reported is invalid.\nSend a TTL trigger, using a specific tag code for correct feedback and another tag code for incorrect, to the EEG and eye-tracker computers.\n\t\tNOTE: The reason for giving feedback is to facilitate the monitoring of performance and maintain motivation during the task. This provision of real-time feedback enhances the reward effect and encourages proper task performance103.\nWrite a code for the control task with the same structure as the planning condition: a control period, a maintenance period, a control execution period, a response period, and feedback (see Supplementary File, Figure 2).\n\t\nThe control period: Write a code for the control condition period to mitigate confounding factors. The code for this period must start with a fixation cross presented for 3 s as a baseline.\n\t\tNOTE: Since the planning task predominantly demands the implementation of planning but also recruits other cognitive domains as part of executive function, such as visuospatial function, working memory, attentional control, inhibitory control, etc.66,88,104,105, a control task is crucial to mitigate confounding factors. Thus, the main goal of this task is to demand all the cognitive and perceptual functions needed to solve the planning task while removing the implementation of cognitive planning54.\nRandomly present the mazes of the control condition one by one (mazes with a marked path already traced). Code a maximum time of 10 s.\nInclude a TTL trigger in the code signaling the onset of the stimulus presentation using a tag, and send this trigger to the EEG computer and the eye-tracker host computer.",
    "Write in the code that this control period culminates once a button from a joystick/keyboard is pressed whenever the subject finishes or if the maximum time is exceeded.\n\t\tNOTE: Subjects are instructed to evaluate the marked paths (whether they are following the rules or not, see step 5.12 for details on the instructions given to the participants).\nSave the reaction time (RT) in the logfile for further analyses.\nThe maintenance period: Once the control period has ended, present a shifted fixation cross for 3 s.\nAs the planning execution period, place the fixation cross where the gate entrance is located to facilitate gaze drawing for the next period.\nThe control execution period: Present the maze again, and simultaneously send a TTL trigger to the EEG and host eye-tracker computers with a tag signaling the onset of the execution period.\nRepeat the same code as for the planning execution period to give online feedback of the gaze position and to delineate and overlap their gaze with the traced path.\nEnsure a maximum time of 10 s to trace the path, and allow the subjects to finalize this period by pressing a button.\nSave the RT in the logfile for further analyses.\nThe control response period: Once the control execution period has ended, present a question mark indicating the response period.\nProgram two buttons, respectively, for the subjects to give a response using a joystick or a keyboard.\n\t\tNOTE: Here, the subjects are asked to answer whether the sequence marked by the trace was correct or not by selecting one button for correct/YES and another for incorrect/NO.\nSave the accuracy in the logfile.",
    "Feedback: Write a code to deliver 3 s of correct feedback whenever the subjects respond correctly (a thumb-up image) and deliver 3 s of incorrect feedback when the subjects respond incorrectly (a thumbs-down image).\nAs in the planning condition, send a TTL trigger to the EEG and host eye-tracker computers with a tag for correct feedback and another tag for incorrect feedback.\nTraining tasks: Create stimuli, write a code, and present before the aforementioned planning and control tasks a brief training session of approximately six trials/mazes for each condition (planning and control)\n\tNOTE: The idea is to ensure familiarization with the task setting. It is recommended to set criteria for proceeding. In this study, if the last three trials were correct, and the participants reported understanding the goal and the procedure at the end of the training session, the participants then proceeded to the experimental session.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64622/64622fig03.jpg\nFigure 3: Example of a laboratory setup. Schematic representation of a laboratory setup showing three interconnected computers. The host computer (eye-tracker computer) is responsible for tracking and storing the eye movement data. The EEG computer acquires and stores the EEG signals. The display computer controls the behavioral experiment, presents the stimuli to the subjects, and sends event triggers to the host and EEG computers through parallel ports and LAN connections to synchronize the data collection. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64622/64622fig03large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/64622/64622fig04.jpg",
    "Figure 4: Path reconstruction from visual online feedback given by the eye-tracker system. Illustrative examples of a path reconstruction from the motor execution of a plan (A, in purple, planning execution period) and a control execution period (B, line in green) and with eye-tracker data. The path reconstructed in the planning execution period is used to evaluate the accuracy of each planning task trial. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64622/64622fig04large.jpg]\n4. Laboratory setting and equipment\nUse an EEG acquisition system to record EEG activity from the participant's scalp, with the EEG electrodes placed according to the international 10-20 system106. Position two electrodes on the participant's mastoids for offline re-referencing. Use electrooculogram electrodes to identify vertical, horizontal, and blink eye movement signals during visual inspection.\nUse EEG acquisition software for the EEG data acquisition with a sampling rate of 2,048 Hz or 1,024 Hz and a band-pass filter between 0.1-100 Hz in the EEG computer.\n\tNOTE: Sampling rates of 1,024 Hz and 2,048 Hz provide enough resolution to analyze low-frequency oscillations. It is important to acquire EEG signals with a high sampling rate, such as over 1,000 Hz, when analyzing low-frequency oscillations in order to ensure that the low-frequency signals are not aliased.\nUse a display computer, which is connected with the EEG computer and the host eye-tracker computer via parallel ports and ethernet and has a platform to run behavioral experimentsinstalled on it, to project the stimuli onto an extended monitor with a minimum resolution of 1,920 pixels x 1,080 pixels and a refresh rate of 60 Hz. Place this monitor approximately 82 cm away from the subject.",
    "NOTE: We used a 24 in monitor with a refresh rate set at 144 Hz located 82 cm away from the participant. It is recommended to use a monitor with a screen size of at least 19 in for cognitive experiments involving recording EEG and eye movements. Additionally, a general recommendation is to place the monitor at a distance that allows the participant to comfortably perform the task and maintain a stable gaze on the screen while still allowing for accurate recordings of EEG and eye movements. It is advisable to test and adjust the setup as necessary to ensure the best results.\nUse an eye-tracking system to give the participants real-time feedback on their eye movements during the execution periods, and record the pupil size. Set the sampling rate at 1,000 Hz for an adequate temporal resolution.\nAvoid head movements. Left and right and up and down head movement restrictions are needed to keep the eye within the video camera's field of view. Forward and backward movement restriction is needed to keep the eye in the video camera's focal range. Use a combination of forehead/chin rests to keep movements within this range.\nEvaluate the luminance of the stimuli using a digital lux-meter or similar to compare differences between the planning stimuli and control stimuli.\n\tNOTE: A statistical test such as a t-test or Wilcoxon can be used to evaluate differences between the stimuli of the two conditions.\nUse a control joystick or keyboard with at least four buttons: two buttons for Yes/No questions from the control condition; one of these two buttons to finish trials; and another two buttons for the response period of the planning condition to move forward or backward to insert the animals into each of the four circles at the bottom of the screen.",
    "5. Electroencephalography and eye-tracking recording sessions\nBefore starting the study, have the participants complete written and signed informed consent.\nPrior to the recording session, ask the participants not to attend wearing makeup (mascara and eyeliner can be detected as a pupil by the eye-tracker system), having taken drugs or caffeine107,108, or if they feel severe fatigue109 (stress, sleep deprivation, etc.).\nHave participants complete a demographic survey to provide information on their sex, age, handedness, native language, and neuropsychiatric history via the MINI-International neuropsychiatric interview97 applied by a trained psychologist.\nClean the subject's forehead, scalp, mastoids, and electrooculogram (EOG) skin position with an alcohol wipe.\nPlace all the external electrodes on the participant. Put the horizontal EOG bipolarly on the outer canthi of both eyes and the vertical EOG above and below the participant's right eye. Put two external electrodes on the right and left mastoid for later re-referencing.\nMeasure the subject's head, and place the correct-size EEG cap according to the extended international 10-20 system. In order to do this, find and place the Cz electrode following these steps:\n\t\nIdentify the midline of the scalp by visually inspecting the hairline and the top of the nose. Identify a line connecting these two points to define the midline.\nLocate the Cz. The Cz is typically defined as the midpoint between the two preauricular points (i.e., the points located just in front of each ear). Locate these points, and then identify a line connecting them to identify the approximate location of the Cz.",
    "Measure and mark the Cz. Measure the distance from the nasion (i.e., the bony protuberance at the top of the nose) to the Cz. The distance from the nasion to the Cz is typically around 53% of the total head circumference in the 10-20 system. Mark the location of the Cz using a pen or another marking tool.\n\t\tNOTE: It is important to follow a consistent and standardized procedure for electrode placement in order to minimize errors and ensure the validity of the EEG data. It is recommended to develop a standard placement procedure. Create a standard procedure for placing the electrodes on each subject's scalp, and ensure that the same procedure is used for every subject. In case there is a team or staff performing the recordings, train the technicians or research assistants on the proper placement procedure to ensure that they consistently and accurately place the electrodes. Furthermore, digitizing the electrode positions for each subject would be a desirable approach in order to perform source analysis later. In EEG studies, the precise three-dimensional (3D) location of each electrode on the subject's head is frequently a requirement for establishing a correlation between the EEG data and the corresponding brain activity110. This information is also critical for the proper alignment of the EEG data with anatomical images derived from MRI or CT imaging techniques111,112.\nInsert conductive gel into each hole of the cap using a syringe with a blunted needle, moving away the participant's hair with the tip. Afterward, put all the scalp electrodes on the EEG cap.\nCheck the impedances using the EEG recording software, and make sure they are under the resistance level recommended by the EEG system.",
    "Ask the participant to stay as still as possible during the experiment. Inspect the EEG signal, and test it by asking the participant to blink, make a jaw, and remain a few seconds with the eyes closed.\nSeat the participant in a dark and sound-attenuated room. Use a chin rest to stabilize their head and minimize movement, and check that there is a distance of approximately 82 cm between the chin rest and the center of the stimulus-presentation screen.\nPlace a joystick or keyboard in front of the participant for the responses.\nInstructions: Give oral instructions using visual aids before starting each condition (planning and control). In the instructions, include visual examples of the stimuli, and explain how to solve the mazes in the planning and the control conditions, respectively.\n\t\nFor the planning task, instruct the subjects to find a path to complete a sequence of visits to certain animal locations (four locations in this study) in different places of the maze in any order and following a set of rules: \"(1) Plan the path as fast as possible within a maximum of 10 s; (2) Start from the gateway, and conclude the path at the fourth animal visited; (3) Do not pass through the same path or corner twice; (4) Do not cross a dead end; (5) Do not cross a path perpendicularly\"54.\n\t\tNOTE: For rule 2 to rule 5, we recommend showing visual examples to the participant.\nAfterward, start the planning task training session of six trials.\n\t\tNOTE: Instruct the participants to report before each eye-tracker calibration period if there was any problem performing the task, especially during delineating the path in the execution period. Take a note of whether there was a trial to check offline/post-processing (see step 6.1.1).",
    "For the control condition, instruct the subjects to evaluate whether the already marked path on the maze has been made correctly or incorrectly considering the rules previously learned.\n\t\tNOTE: Give examples with visual support of how to evaluate the mazes without using planning strategies, such as not trying to plan a new path when errors are detected (such as drawings using the same path twice, crossing a dead end, etc.). When an error is found, the focus should be solely on reporting the detection of the error rather than correcting the path. After each trial, ask the participants about the strategies they implemented. Then, provide oral feedback about their performance to make sure that they evaluated the paths drawn and avoided planning new paths. Afterward, start the control task training session of six trials.\nCheck the EEG signal to make sure that all the channels are correctly being acquired. Start the EEG recording.\nCalibrate the eye tracker.\n\tNOTE: Verify the capability of the eye tracker to determine the gaze position when the participant directs their gaze to various regions of the screen.\n\t\nInform the participant that the eye tracker will be calibrated and that they are going to see a white circle (with a small gray dot) moving randomly to the four corners of the screen (five-point calibration procedure). Instruct them to fixate their gaze in the circle, and inform them that, when it moves to another location, they should follow the circle's position and fixate their gaze again in that new position.\nRun the experiment, start saving the eye movements by clicking on Output/Record, and ask the participant to follow the instructions previously given, informing them the experiment will now begin.",
    "Keep the laboratory room in a dark environment. The largest changes in pupil dilation occur in response to changes in luminance113. Maintain a consistent light level in the experimental environment.\n6. Data analyses\nBehavioral analyses\n\t\nAnalyze the behavioral data using statistical software (see Table of Materials). Measure the accuracy (percentage rate of accurate responses) as a quantitative behavioral parameter in both the planning and control conditions. For the planning condition, use eye-tracker data (x and y coordinates of gaze position) to recreate the paths taken during the execution period offline, and determine the accuracy of the planned paths compared to the actual traced paths (Figure 4). To do this, manually check the congruency between the combinations correctly/incorrectly made in the response period and the trace made.\nCalculate the RT, which is the mean time spent solving the mazes for the planning period and the mean time spent evaluating the marked paths for the control period.\nCalculate the mean RT of the execution periods for the planning and control conditions. Specifically, use the RT corresponding to only the correct trials.\n\t\tNOTE: Complementarily, it is possible to use the linear integrated speed-accuracy score (LISAS)114,115 described in Domic-Siede et al.54, which provides a combined measure that considers reaction time and accuracy. As the reaction time during the planning execution period and the accuracy of planning are interrelated, the LISAS can be utilized to compute an index that accounts for the reaction time corrected for the number of errors made. Additionally, the LISAS index can be used to assess the correlation between electrophysiological signals and behavioral performance as well. It is calculated as a linear combination of reaction time (RT) and error proportion (PE).",
    "Evaluate the homoscedasticity using a statistical test such as the Levene Test116,117, and test the normality using the D'Agostino and Pearson omnibus normality distribution test118 or Shapiro Wilk test119 to choose the proper statistical test for comparisons (parametric or non-parametric).\nEvaluate whether the planning component in the planning condition is more cognitively demanding than the control condition using either the Wilcoxon signed-rank test120 or the matched-pair t-test121 to compare the behavioral parameters between the conditions.\n\t\tNOTE: In this way, validate that the behavioral paradigm is optimal to evaluate cognitive planning.\nSeparate the trials in the planning condition into \"easy\" and \"difficult\" categories (refer to step 2.2), and then use a matched-pair t-test to compare the accuracy and reaction times in the planning and execution periods between the \"easy\" and \"difficult\" trials.\nEEG and eye movement pre-processing\n\t\nPerform the EEG data pre-processing pipeline explained in the following points using self-made scripts and/or established toolboxes, such as those described in Delorme and Makeig122, in Dimigen et al.123, and in Mognon et al.124, in a programming language software (see Table of Materials).\nSynchronize the eye movement activity with the EEG recordings to import the fixations, saccades, and blink events for better visual inspection or further analyses (see step 3.1.2 and the Supplementary File).\n\t\tNOTE: In this study, we used the timestamps on the eye-tracking data and the time stamps on the EEG data as described in Domic-Siede et al.54 and in Dimigen et al.123 to import the eye movement events to the EEG data in a programming language software.\nDown-sample the data to 1,024 Hz in case they were recorded at 2,028 Hz to reduce the computational demands.",
    "NOTE: A sampling rate of 1,024 Hz is sufficient according to the frequency range of interest of 4-8 Hz, the expected frequency resolution, and the computational requirements of the analysis.\nRe-reference the EEG signal to the average of the electrodes on the mastoids.\n\t\tNOTE: Other references are possible. The choice of reference can impact the results of the EEG analysis and the interpretation of the data, so it is important to carefully consider the pros and cons of different referencing options. The average mastoid reference is a popular choice for EEG studies because it provides a stable reference that is easy to calculate, and it has been shown to be effective for analyzing many different EEG signals. Referencing the EEG data to the average of the mastoids (known as the average mastoid reference) is a common approach for analyzing frontal theta activity in scalp EEG data. The mastoid electrodes are located near the ear and provide a reference for the EEG signals. Referencing to the average of the mastoids can help to reduce the influence of noise and artifacts that are not of interest while avoiding canceling the signal of interest, which helps the user to obtain a clearer representation of the EEG signals.\nApply a zero-phase finite impulse response (FIR) with a high-pass cut-off frequency of 1 Hz and a low-pass cut-off frequency of 40 Hz over the extended signal (without epoching) using a programming language software.\n\t\tNOTE: In this study, we used the toolbox described in Delorme and Makeig122.",
    "For each condition, considering the number of trials, divide the data into epochs centered around the start of the planning and control periods, respectively. Use the 1 s prior to the start of the maze presentation as the baseline and 4 s after the planning or control period as the segments of interest. Use a programming language software.\n\t\tNOTE: In this study, we used the toolbox described in Delorme and Makeig122and 36 epochs/trials.\nCreate a second segmentation centered around the end of the planning and control periods using 4 s before the end and 1 s after as the maintenance period.\n\t\tNOTE: The reason for selecting the first and last 4 s of the planning and control periods (step 6.2.6 and step 6.2.7) is that the duration of each period in both conditions can vary, and analyzing the first and last seconds of planning can provide a more comprehensive view of the planning process. Thus, these window lengths are adequate and sufficient to analyze the oscillatory dynamics underlying planning.\nOver the segmented signal, run the Logistic Infomax independent components analysis (ICA) algorithm125to identify and remove artifactual components.\nUse the saccade-to-fixation variance ratio criterion recommended in Plöchl et al.126to automatically detect potential noisy components, and use the automatic EEG artifact detector based on the joint use of spatial and temporal features recommended in Mognon et al.124.\n\t\tNOTE: We recommend the use of the independent component classifier proposed in Pion-Tonachini et al.127, which estimates independent component classifications as compositional vectors across seven categories, helping to identify artifacts.\nInspect other potential artifactual components such as EMG, electrode movement, or non-brain-related components. Validate the rejection of these components by visually inspecting the topographies, spectra, and activations over time.",
    "Interpolate (spherical interpolation) noisy channels by automatic channel rejection using the kurtosis criterion (with a z-score of 5 as the threshold).\nTime-frequency analyses\n\t\nPerform a short-time fast Fourier transform (FFT) (1 Hz to 40 Hz) using a window length of 250 ms and a time step of 5 ms. Use a Hanning window. Use the z-score to normalize the time-frequency charts to the baseline (−1 s to −0.1 s).\n\t\tNOTE: The visualization of the spectrum is subject to a trade-off between the window size and the temporal resolution. To achieve a comprehensive view of the entire spectrum including the theta range of 4 Hz to 8 Hz, we recommend using the lower limit of the window size, which is 250 ms, to ensure a higher temporal resolution during each trial and task. Additionally, we recommend using a Hanning window, as this is widely regarded as a conventional choice for these cases. For better resolution in time and frequency, see the further steps.\nSelect a time-frequency chart from a frontocentral electrode, such as the Fz, or an averaged group of frontal electrodes.\n\t\tNOTE: Consider the broad evidence regarding the association between cognitive control and frontal midline theta12,128,129.\nSelect non-frontal control time-frequency charts from electrodes such as the Pz and Oz electrodes to further the comparisons.\nFor the frontal and control electrodes, perform a non-parametric cluster-based permutation test for paired samples, with a p-value < 0.05 for the group-level comparisons of the time-frequency charts from both conditions. Use the Monte Carlo method with 1,000 random draws. Use the maximum statistic value of the cluster to perform the permutation test130.\nAverage the theta frequency band (4-8 Hz) from the first 4 s of planning and control, respectively, and the last 4 s segment as well.",
    "Compare the averaged theta activity between the conditions using a matched-pair t-test or Wilcoxon signed-rank test.\nAnalyze the time profile of the theta activity. To do this, average the frequency range of 4-8 Hz across the trials by subject.\nCompare the theta activity dynamics between the conditions using a Wilcoxon signed-rank test match-paired and corrected with the false discovery rate (FDR).\n\t\tNOTE: We used 88 ms steps of non-overlapping windows in the Wilcoxon test.\nSource reconstruction\n\t\nUse a toolbox for source analysis reconstruction, such as the open access toolbox described in Tadel et al.131 or another similar one.\nCalculate the sources of the pre-processed EEG signal from the first 4 s of planning using an algorithm such as standardized low-resolution brain electromagnetic tomography (sLORETA)132and the minimum-norm imaging method, as well as the symmetric boundary element method (symmetric BEM), with the help of a toolbox such as that described in Gramfort et al.133to solve the inverse problem.\nUse the source algorithm (sLORETA algorithm in this study) on an anatomical MNI template (we used the MNI template in Brainstorm \"Colin27\") with the default electrode locations for each participant in case there is no 3D digitization of the electrodes (see step 5.6).\n\t\tNOTE: It should be noted that using the default electrode locations is not the most efficient method for determining the sources of brain activity. However, it can still provide a general understanding of the origin of the activity. It is important to keep in mind that the localization sources obtained through these methods are rough approximations and should be interpreted with caution during the analysis of the results.\nApply a 4-8 Hz bandpass filter over the pre-processed signal.\nApply a z-score normalization using the period −1,000 ms to −10 ms before the trial onset as the baseline.",
    "Average the theta activity using a time window of interest between 1 s and 4 s after the trial onset.\nCompare the average space sources between the conditions using a non-parametric permutation sign test with Monte Carlo sampling (1,000 randomizations)131.\nIn order to determine the regions of interest (ROIs), label the cortex using a brain atlas.\n\t\tNOTE: We used the Destrieux Atlas134 implemented in the toolbox described in Tadel et al.131.\nSelect the brain regions of interest (ROIs).\n\t\tNOTE: We considered the evidence reporting that the prefrontal cortex regions, such as the bilateral superior frontal gyri (SF), bilateral transverse frontopolar gyri and sulci (FP), bilateral ACC, bilateral MCC, and bilateral dorsolateral prefrontal cortex137,138, are involved in cognitive control functions135,136.\nPerform principal component analysis (PCA) over the previous pre-processed EEG signal (1-40 Hz range) for each ROI, and take the first mode of the PCA decomposition for each ROI.\nPerform a spectral analysis using a short-time fast Fourier transform, and compare the results between the left and right regions of interest using a non-parametric, cluster-based permutation test130.\nExtract and represent the left and right ROIs showing no differences as one bilateral time series: SF, ACC, and MCC. Then, plot time-frequency charts, and compare between the conditions.\nCompare the time-frequency charts according to the complexity level of the planning task (easy versus difficult trials) for each ROI.\nMirror the edge of the signal for each of the 512 samples, and perform a bandpass filter between 4 Hz and 8 Hz for the selected ROIs.\nApply a Hilbert transform to obtain the instantaneous amplitude139using a signal processing toolbox from a programming language software (see Table of Materials).\nCorrect the signal using z-score normalization (−1,000 to −10 ms as baseline), and average across the trials by subject.",
    "Compare each ROI theta band time profile between the conditions using the Wilcoxon signed-rank test (matched pairs, 1 s of non-overlapping windows), and correct with the FDR.\nCorrelations between EEG activity and behavioral performance\n\t\nNormalize the source time series of the ROIs to the baseline using the z-score. Select a window from 1 s to 4 s after the planning or control onset (where prominent theta activity in the time-frequency charts is observed).\nTo determine the increase in theta activity in the planning condition compared to the control condition, first transform the signal into the frequency domain (1-40 Hz) using the multitaper method through a toolbox such as the Chronux toolbox140 for each condition and source in the regions of interest.\nCompute the average frequency of the theta band (4-8 Hz), and calculate two measures of theta power: i) the difference between the theta power during the planning period (θ planning) and the control period (θ control), denoted as Δ theta, and ii) the relative increase in theta activity, expressed as the ratio of Δ theta (Δ θ) and the theta activity during the control period (θ control), as in Domic-Siede et al.54:\nimgsrc://cloudfront.jove.com/files/ftp_upload/64622/64622eq01.jpg       (1)\nimgsrc://cloudfront.jove.com/files/ftp_upload/64622/64622eq02.jpg\nCalculate two behavioral parameters: iii) Δ LISAS planning, by subtracting LISAS control from LISAS planning, and iv) Δ LISAS planning execution, by subtracting LISAS control execution from LISAS planning execution, as in Domic-Siede et al.54:\nimgsrc://cloudfront.jove.com/files/ftp_upload/64622/64622eq03.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/64622/64622eq04.jpg\nPerform Spearman's rho correlations using the electrophysiological and behavioral parameters calculated, and then correct by the FDR.\nEye movement analysis: To control the potential differences in eye movements for each condition that might result in different oscillatory dynamics, perform the following analysis:",
    "Determine the saccade amplitude and the saccade peak velocity from the entire trial and from 0 s to 3.75 s during the planning and control conditions.\nCompare the results using either the Wilcoxon signed-rank test or the matched-pair t-test, whichever is appropriate.\n\t\tNOTE: A toolbox such as that described in Dimigen et al.123can be helpful.\nCalculate and evaluate the coherence between the Fourier EEG power at one frontal electrode (for instance, the Fz or an averaged frontal ROI electrode) and the saccade rate as described in Sato and Yamaguchi141.\nUse the Wilcoxon signed-rank test to compare the coherence power-saccade rate values of the first 4 s of each trial between the two conditions."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}