{
  "id": 3489,
  "origin_website": "Cell",
  "title": "A miniTurbo-based proximity labeling protocol to identify conditional protein interactomes in vivo in Myxococcus xanthus",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDetermine the concentrations of vanillate, biotin and labeling time for proximity labeling experiments using western blot\nTiming: 1–2 weeks\nIn this step, the amount of inducer used to express the control protein (sfGFP-mTurbo-FLAG) is titrated to reach a level similar to that of the bait protein. Additionally, the amount of biotin and the labeling time is adjusted.\nTo adjust the accumulation of bait and control protein to similar levels, whole cell lysates of cells, grown in the presence of different concentrations of inducer (in our case vanillate), are prepared and analyzed by western blot.\nPrepare culture of strains synthesizing the bait protein or the control protein.\nResuspend a single colony per strain in 5 mL CTT liquid medium and incubate cultures with shaking for 8 h at 32°C in the dark.\nNote: Incubation times should be adjusted to the doubling time of the bacterium used. M. xanthus cells growing in suspension culture have a doubling time of 5–6 h. Also M. xanthus cells are light-sensitive and therefore incubated in the dark. These parameters can be adjusted to suit other bacteria.\nDilute the cultures to an OD550nm = 0.1 in 10 mL CTT. For the strain expressing the control protein, inoculate 5 cultures with an OD550nm = 0.1.\nTo induce synthesis of the control protein from the vanillate inducible promoter, add vanillate to the five cultures to final concentrations of 0, 5, 10, 50, and 100 μM, and incubate the cultures with shaking for maximal 3 generations (≈18 h) at 32°C in the dark to make sure that cells remain in the exponential growth phase.\nTake samples for SDS-PAGE by normalizing cultures to an OD550nm = 14.",
    "Harvest cells by centrifugation at 4,500 g for 10 min at RT and resuspend to an OD550nm = 14 in 1× Laemmli buffer.\nHeat samples at 95°C for 10 min with shaking at 1,000 rpm.\nBriefly centrifuge the samples to sediment condensation in the lid.\nPause point: Samples can be stored at ‒20°C for weeks.\nLoad 15 μL of each sample on an Any kD Mini-PROTEAN TGX Precast Protein Gel and run the gels at 150 V for 45 min in an electrophoresis cell.\nTransfer the gel to 0.2 μm nitrocellulose membrane using the 7 min TurboTransfer program using the TransBlot TurboTransfer System.\nBlock the membrane with 5% milk for 1 h at RT.\nIncubate the membrane with α-FLAG primary antibody (1:2,000 in 1% milk TBS) over night at ‒4°C.\nWash the membrane three times with 1× TBST for 5 min each.\nIncubate the membrane with α-rabbit secondary antibody (1:15,000 in 1% milk TBS) for 1 h at ‒4°C.\nWash the membrane three times with 1× TBST for 5 min each.\nDevelop the blot using the luminescent image analyzer LAS-4000 after applying the Luminata Western HRP Substrate.\nStrip the membrane by incubating it in 15 mL stripping-buffer for 15 min at RT.\nWash the membrane three times with 1× TBST for 5 min each.\nBlock the membrane with 5% milk for 1 h at RT.\nWash the membrane three times with 1× TBST for 5 min each.\nIncubate the membrane with Streptavidin-HRP (1:4,000 in 3% BSA-TBS) over night at 4°C.\nWash the membrane three times with 1× TBST for 5 min each.\nDevelop the blot using a luminescent image analyzer after applying the Luminata Western HRP Substrate.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3063-Fig1.jpg\nFigure 1. Optimization of vanillate concentration, biotin concentration and labeling time",
    "(A‒C) Protein from the same amount of cells was loaded in each lane and separated by SDS-PAGE. Blots were probed with the indicated antibodies or Streptavidin-HRP. Before probing with a different antibody, blots were treated with stripping-buffer. LonD was used as a loading control. In (A), gap indicates lanes removed for presentation purposes.\nNote: Using western blot, we determined that 5–10 μM vanillate are sufficient to reach the same level of accumulation of the bait and control proteins (Figure 1[href=https://www.wicell.org#fig1]A). Additionally, we observed that the sfGFP-mTurbo-FLAG fusion is degraded when increasing the expression (50 and 100 μM vanillate).\nTo optimize the amount of biotin added to the cells for the labeling reaction, whole cell lysates of cells grown with different biotin concentrations for 4 h are prepared and analyzed by western blot.\nPrepare culture of strains synthesizing the bait protein or the control protein.\nResuspend a single colony per strain in 5 mL CTT liquid medium and incubate cultures with shaking for 8 h at 32°C in the dark.\nDilute cultures to an OD550nm = 0.1 in 10 mL CTT. For the strain expressing the control protein, inoculate 5 cultures with an OD550nm = 0.1.\nInduce synthesis of the control protein using the experimentally determined vanillate concentration and incubate culture with shaking for 18 h at 32°C (see comment in Step 1b about incubation).\nInduce labelling by adding biotin to 0, 5, 25, 50, 100, 200, and 500 μM final concentration to the cultures. Incubate with shaking for 4 h at 32°C in the dark.\nTake samples for SDS-PAGE by normalizing cultures to an OD550nm = 14.\nHarvest cells by centrifugation at 4,500 g for 10 min at RT and resuspend to an OD550nm = 14 in 1× Laemmli buffer.",
    "Heat samples at 95°C for 10 min with shaking at 1,000 rpm.\nBriefly centrifuge the samples to sediment condensation in the lid.\nLoad 15 μL of each sample on an Any kD Mini-PROTEAN TGX Precast Protein Gel and run the gels at 150 V for 45 min in an electrophoresis cell.\nTransfer the gel to 0.2 μm nitrocellulose membrane using the 7 min TurboTransfer program using the TransBlot TurboTransfer System.\nBlock the membrane with 5% milk for 1 h at RT.\nWash the membrane three times with 1× TBST for 5 min each.\nIncubate the membrane with Streptavidin-HRP (1:4,000 in 3% BSA-TBS) over night at 4°C.\nWash the membrane three times with 1× TBST for 5 min each.\nDevelop the blot using a luminescent image analyzer after applying the Luminata Western HRP Substrate.\nNote: Generally, concentrations between 50 and 100 μM are already saturating the labeling reaction (Figure 1[href=https://www.wicell.org#fig1]B). Ideally, the concentration is chosen as low as possible to reduce the amount of free biotin in the lysate.\nThe labelling time after addition of biotin should be optimized to ensure labeling level and specificity. To optimize the labeling time, whole cell lysates at different time points after addition of biotin to a fixed concentration are prepared and analyzed by western blot. For the test experiments, we used 50 μM biotin to induce the labeling reaction because this concentration yielded robust and strong labeling as determined in step 2.\nPrepare culture of strains accumulating the bait protein and the control. Because samples will be taken from the same culture at different time points the culture is started with a larger volume.",
    "Resuspend a single colony per strain in 5 mL CTT liquid medium and incubate cultures with shaking for 18 h at 32°C in the dark (see comment in Step 1b about incubation).\nDilute cultures to an OD550nm = 0.3 in 10 mL CTT and incubate cultures with shaking for 8 h at 32°C in the dark.\nDilute cultures to an OD550nm = 0.1 in 50 mL CTT.\nAdd vanillate to a final concentration as determined in step 1 to induce synthesis of the control (sfGFP-mTurbo-FLAG) and incubate culture with shaking for 18 h at 32°C in the dark (see comment in Step 1b about incubation).\nInduce labelling by adding 50 μM biotin to the cultures.\nIncubate the cultures with shaking for 0 min, 10 min, 30 min, 1 h, 2 h, 4 h, 6 h, and 24 h at 32°C in the dark.\nTake samples for SDS-PAGE by normalizing cultures to an OD550nm = 14.\nHarvest cells by centrifugation at 4,500 g for 10 min at RT and resuspend to an OD550nm = 14 in 1× Laemmli buffer.\nHeat samples at 95°C for 10 min with shaking at 1,000 rpm.\nBriefly centrifuge the samples to sediment condensation in the lid.\nLoad 15 μL of each sample on an Any kD Mini-PROTEAN TGX Precast Protein Gel and run the gels at 150 V for 45 min in an electrophoresis cell.\nTransfer the gel to 0.2 μm nitrocellulose membrane using the 7 min TurboTransfer program using the TransBlot TurboTransfer System.\nBlock the membrane with 5% milk for 1 h at RT.\nWash the membrane three times with 1× TBST for 5 min each.\nIncubate the membrane with Streptavidin-HRP (1:4,000 in 3% BSA-TBS) over night at 4°C.\nWash the membrane three times with 1× TBST for 5 min each.",
    "Develop the blot using a luminescent image analyzer after applying the Luminata Western HRP Substrate.\nNote: Labeling times likely depend on the organism and protein used and should be optimized accordingly. We determined the optimal labeling time to be 4 h, based on the observation that labeling with proteins saturated between 2 h and 8 h (Figure 1[href=https://www.wicell.org#fig1]C).\nPreparation and labeling of cells grown on a surface or in suspension culture\nTiming: 52 h\nAfter optimizing the vanillate and biotin concentration, as well as the labeling time, biotinylated proteins are enriched using Strep beads. To compare cells grown on a surface with cells grown in suspension culture, vanillate was added to the control cells in suspension culture and in 150 mm Petri dishes. Each strain was analyzed in biological triplicates to verify reproducibility.\nInduction of labeling in cells in suspension culture.\nResuspend single colonies in 10 mL CTT liquid medium and incubate cultures with shaking for 8 h at 32°C in the dark.\nDilute cultures to an OD550nm = 0.1 in 50 mL CTT, induce synthesis of the control protein by adding vanillate and incubate cultures with shaking for 18 h at 32°C in the dark (see comment in Step 1b about incubation).\nNote: Adjust vanillate concentration to the concentration determined in step 1. For the presented experiment we used 5 μM.\nAdd biotin to each suspension culture and incubate the cells for 4 h.\nNote: Use the biotin concentration determined in step 2 and adjust the time determined in step 3, for these experiments we used 50 μM biotin.\nLabeling in cells grown on a surface.\nPrepare suspension cultures of strains accumulating the bait protein and the control in biological triplicates.",
    "Resuspend a single colony per replicate in 5 mL CTT liquid medium and incubate cultures with shaking for 8 h at 32°C in the dark.\nDilute cultures to an OD550nm = 0.1 in 20 mL CTT and incubate cultures with shaking for 18 h at 32°C in the dark (see comment in Step 1b about incubation).\nDilute each culture in 40 mL CTT to OD550nm = 0.05 in 40 mL, transfer the cell suspension to a Petri dish (Ø = 150 mm) and incubate for 8 h at 32°C in the dark.\nNote: The cells sediment at the plastic bottom of the Petri dish while being overlaid by the growth medium. Vanillate and biotin are added directly to the growth medium.\nTo induce synthesis of the control protein from the vanillate inducible promoter, add vanillate to the growth medium covering the cells in the Petri dishes with the corresponding strains and continue for 18 h at 32°C in the dark (see comment in Step 1b about incubation).\nNote: Adjust the vanillate concentration to the concentration determined in step 1. For the presented experiment we used 5 μM.\nTo induce the labeling reaction, add biotin to the growth medium covering the cells for 4 h at 32°C in the dark.\nNote: Adjust the biotin concentration to the concentration determined in step 2 and adjust the time determined in step 3, for the presented experiment we used 50 μM biotin.\nCritical: Do not agitate Petri dishes as agitation will lead to detachment of cells from the bottom of the Petri dish.\nAfter labelling, scrape cells off the surface using a cell scraper and combine cells of the 3 Petri dishes of one replicate.\nEnrichment of biotinylated proteins and on-bead digest\nTiming: 20 h",
    "After in vivo labeling cells are lysed and biotinylated proteins enriched using Strep beads. Subsequently, biotinylated proteins are eluted and digested using an on-bead digest procedure.\nEnrichment of biotinylated proteins using Strep beads.\nHarvest cells by centrifugation at 8,000 g for 10 min at RT.\nWash the cell pellet by resuspending in 10 mL TPM buffer.\nHarvest cells at 8,000 g for 10 min at 4°C and discard the supernatant.\nRepeat steps b and c three times.\nNote: Extensive washing ensures that free biotin, which could interfere with the enrichment of biotinylated proteins, is removed efficiently.\nResuspend the cell pellet in 600 μL RIPA buffer supplemented with cOmplete protease inhibitor (Roche).\nSonicate for 30 s with a Hielscher UP200st set to amplitude = 50% and pulse = 50%.\nPellet cell debris at 8,000 g for 10 min 4°C. In the meantime, start equilibrating the desalting columns.\nEquilibrate G25-Desalting columns.\nNote: Desalting columns are used to remove any free biotin left in the lysate. Instead of a spin protocol, desalting columns can also be used with a gravity protocol for more efficient removal of free biotin.\nRemove the top and bottom seal of the column and remove the filter with forceps.\nLoad the desalting column onto a 15 mL Falcon tube using an appropriate adapter.\nLoad 2–3 mL of RIPA buffer on the desalting column and let the buffer drain by gravity. Repeat this step.\nLoad 2–3 mL of RIPA buffer on the desalting column and empty the desalting column by centrifugation at 1,000 g for 2 min.\nTransfer 500 μL of the cleared lysate on a desalting column and let the lysate enter the column bed.\nTransfer the desalting column into a new falcon tube and collect the cleared lysate by centrifugation at 1,000 g for 2 min.",
    "Measure the protein concentration in all samples.\nDilute 10 μL of the desalted lysate in 90 μL ddH2O.\nIn a 96-well plate: Mix 10 μL ddH2O, and 10 μL of BSA standards with 190 μL 660 nm Protein Assay. In triplicates: Mix 10 μL of the diluted lysates with 190 μL 660 nm Protein Assay.\nMix all wells by shaking and measure the absorbance at 660 nm in an appropriate plate reader (i.e., Tecan M200).\nNote: Dilute samples and use BSA standards according to the linear range of the assay used to measure the protein concentration.\nDilute all lysates to the same protein concentration.\nNote: We use 2 mg/mL in our experiments.\nEquilibrate Strep beads.\nResuspend 40 μL of Strep beads per sample in 1 mL RIPA buffer.\nSeparate beads using a magnetic rack.\nRepeat wash.\nResuspend beads in 500 μL RIPA.\nMix 500 μL desalted lysate and 500 μL equilibrated beads in a 2 mL Eppendorf tube (corresponding to a protein concentration of 1 mg/mL during the binding step) and incubate for 1 h on a rotary shaker at 4°C.\nNote: In our hands, 2 mL tubes allow easier separation of magnetic beads.\nSeparate the Strep beads from the lysate using a magnetic rack.\nWash the beads twice with 1 mL RIPA buffer.\nWash the beads twice with 1 mL 1 M KCl.\nWash the beads three times with 1 mL 50 mM Tris-HCl pH 7.6.\nNote: As on-bead digest is performed by directly adding the endopeptidase trypsin to proteins enriched on Strep beads, all detergents and protease inhibitors have to be removed prior to adding the protease.\nWash the beads with 1 mL 100 mM Ammonium bicarbonate (ABC).\nResuspend beads in 100 μL 100 mM ABC.",
    "Pause point: Remove ABC and snap-freeze the dry beads in liquid nitrogen. Beads can be stored at ‒80°C until proceeding with the on-bead digest.\nCritical: Liquid nitrogen can cause severe burns when in contact with the skin/ eye. Wear appropriate protection.\nPerform on-bead digest of enriched proteins.\nAdd 200 μL on-bead digestion buffer (1 μg trypsin in 100 mM ABC) to the beads, vortex and incubate for 30 min on a thermomixer at 30 °C at 1,200 rpm. Make sure the beads are always fully resuspended.\nSeparate, collect supernatant and transfer into new Eppendorf tube.\nAdd 100 μL TCEP reduction buffer to the beads, vortex and separate beads.\nCollect supernatant and add to trypsin containing sample.\nLet reaction proceed at 30°C overnight.\nAfter tryptic digest, add 5 μL alkylation buffer, vortex and incubate for 30 min in the dark.\nPause point: Proceed with solid phase extraction or freeze samples at ‒20°C.\nSolid phase extraction of tryptic peptides\nTiming: 3 h\nIn this step the peptide samples are desalted and prepared for LC-MS injection.\nAcidify samples by adding 50 μL of 5% trifluoroacetic acid (TFA).\nCondition C18-columns with 200 μl Acetonitrile and spin at 8 g on a table top centrifuge for 30 s.\nEquilibrate columns with 400 μL SPE Buffer 1, centrifuge at 15 g for 30 s at RT.\nLoad sample and spin at 8 g for 1 min at RT.\nNote: Depending on sample and cartridge dimensions, the centrifugation time, speed and buffer volumes may be adopted. The SPE columns should never run completely dry. Repeatedly discard the centrifugation flow through.\nWash loaded peptide sample by adding 400 μL Buffer 1, centrifuge at 15 g for 30 s at RT.",
    "Transfer the SPE column with bound peptides to a new Eppendorf tube. Add 400 μL SPE Buffer 2 and centrifuge 15 g for 30 s at RT.\nConcentrate eluted peptide mixture under vacuum to dryness. Drying process in a SpeedVac takes around 2 h.\nReconstitute peptides in 50 μL Buffer 1, vortex and transfer sample into LC vial and proceed with LC-MS analysis. Otherwise, peptides can be stored dry at ‒20°C.\nPause point: Peptide sample can be stored dry for several months.\nLC-MS analysis\nTiming: 75 min per sample\nHere we describe an example for an LC-MS acquisition method suited for mTurbo affinity purification experiments. This individually established routine includes an Ultimate 3000 RSLC system connected to an Exploris 480 Orbitrap mass spectrometer using a data dependent acquisition (DDA) MS strategy for label-free protein quantification.\nNote: With the variety of possible LC-MS/MS analytical set ups including column origin, important parameters can vary substantially, depending on the installed HPLC and MS system.\nLoad 5 μL peptide material onto the Pre-column with 10 μL/min flow LC-Buffer A (0.15% Formic acid).\nFor peptide separation use a self-packed C18 column with 42 cm length and 75 μm ID × 360 μm OD column heated at 60°C using an in-house designed column heater.\nPerform peptide separation at constant flow rate of 300 nL/min using a 40 min gradient from 6%‒35% LC buffer B (99.85% Acetonitrile/0.15% Formic acid) on a 42 cm self-packed analytical.\nNote: The implementation of a column heater will reduce back pressure and allow the use of longer column for better peptide separation. If no column heater is used, shorter columns are used to prevent LC overpressure.\nEluting peptides are ionized with a spray voltage of 2.3 kV in positive mode.\nSet the capillary temperature to 300°C.",
    "Acquire MS1 survey scan (scan range m/z 350–1,650) in profile mode with following parameters:\nSet Orbitrap resolution to 60,000.\nAGC target setting to 300% (3e6) and max fill time to 25 ms.\nRF lens 40%\nAcquire MS/MS fragment spectra in data dependent acquisition (DDA) mode with following parameters:\nQuadrupole isolation window m/z 1.5.\nFor fragmentation include ions with charge states 2–6.\nSet Orbitrap resolution to 15,000.\nAGC target setting to 200% (2e5) and max fill time set to “Auto”.\nHCD normalized collision energy 27.\nDynamic exclusion 20 s.\nSet cycle time for MS/MS sequencing attempts to 1 s.\nOptional: Next to DDA other MS acquisition strategies like data independent acquisition (DIA) are possible options for protein label-free quantification. The choice of the MS acquisition strategy is based on several factors including sample complexity and observed data robustness.\nProtein label-free quantification using MaxQuant\nTiming: 4 h\nThe MS raw data is analyzed with MaxQuant for protein label-free quantification (LFQ). MaxQuant is a widely used, freely available analysis software with several implemented strategies including label-free, isotopic and isobaric protein quantification.\nDownload MaxQuant (https://www.maxquant.org/[href=https://www.maxquant.org/]) and install software on an appropriate PC.\nDownload Myxococcus xanthus protein sequence database in FASTA format via UniProt (https://www.uniprot.org/[href=https://www.uniprot.org/]).\nLoad raw files and “set experiment” according to experimental set up.\nProcess MaxQuant with “Label-free quantification” and “min. ratio count” set to “1”. For modifications set carbamidomethyl on (C) as fixed; oxidation on (M) and deamidation on (DQ) as variable. Activate “Require MS/MS for LFQ comparisons” to include only peptides identified by defined identification FDRs.\nWith few exceptions MaxQuant is best performed in standard settings.\nLocate the MaxQuant output “.txt” folder and use the “LFQ intensities” in the “proteinGroups.txt” output for further analysis.",
    "Note: The MaxQuant output tables offer detailed information on identified peptides and proteins helpful for further monitoring and troubleshooting. In order to evaluate comparability across samples and to avoid label-free quantification biases make sure homogenous distribution of number unique peptides and intensities found in the “proteinGroups.txt” table."
  ],
  "subjectAreas": [
    "Proteomics",
    "Mass Spectrometry",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}