{
  "id": 2157,
  "origin_website": "Cell",
  "title": "Complementary protocols to evaluate inhibitors against the DnaK chaperone network",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nProtocol 2: Measurement of DnaK ATPase stimulation by chaperone-cofactors\nTiming: 4 h\nThis protocol details how to monitor the ATP hydrolysis (ATPase) activity of mycobacterial chaperone DnaK and protein cofactors DnaJ2 and GrpE over a time course following purification. Activity of reactions containing (A) DnaK alone, (B) DnaJ2 and GrpE combined, and (C) DnaK with DnaJ2 and GrpE will be evaluated.\nPerform the following steps for the preparation of an ATP standard curve using Kinase-Glo Max (Promega) reagents for ATP detection:\nCritical: Make sure to thaw the Kinase-Glo Max reagent prior to starting and let it warm to 25°C before use.\nPrepare a stock of 100 mM ATP (UltraPure) in ddH2O.\nPrepare 200 μL of 200 μM ATP using ATP Standard buffer (described in materials and equipment).\nNote: ATP Standard buffer can be stored at 25°C for 1 month.\nFollow Table 1[href=https://www.wicell.org#tbl1] to label ten 0.65 mL microcentrifuge tubes (#1–10) for serial dilution. Perform a two-fold serial dilution using ATP Standard buffer in a total volume of 50 μL per tube. Vortex tubes and spin down briefly on a table-top centrifuge to mix.\ntable:files/protocols_protocol_1636_14.csv\nPrepared in ATP Standard buffer. Aliquoted and stored at −20°C for single use.\nLabel another set of ten 0.65 mL microcentrifuge tubes (#1–10) and add 15 μL of 0.05% formic acid to each tube. Transfer 15 μL of each ATP dilution from step 1c to each tube. Vortex to mix.\nNote: ATP standard samples will be transferred to a microplate at the end of the experiment.\nNote: ATP standard samples prepared in steps 1b and c can be stored at −20°C for several months. ATP standard samples prepared with 0.05% formic acid cannot be stored at −20°C.",
    "Dilute DnaK, DnaJ2, and GrpE using 1× PBS buffer, 2 mM MgCl2, 0.01% Tween-20 in at least 50 μL final volume to initial concentrations of 40 μM, 4 μM, and 4 μM, respectively. Keep on ice.\nNote: 1× PBS buffer, 2 mM MgCl2, 0.01% Tween-20 can be stored at 25°C for 1 month.\nPrepare master mixes for each reaction. To do so, mix components in Tables 2[href=https://www.wicell.org#tbl2], 3[href=https://www.wicell.org#tbl3], and 4[href=https://www.wicell.org#tbl4] in separate 1.5 mL microcentrifuge tubes. Each reaction should be performed in triplicate and tubes can be labeled as A1, A2, A3, B1, B2, etc.\ntable:files/protocols_protocol_1636_15.csv\naNote: The volume per reaction will be brought to 15 μL when ATP is added at a later step to initiate reactions.\ntable:files/protocols_protocol_1636_16.csv\naNote: The volume per reaction will be brought to 15 μL when DnaJ2, GrpE and ATP are added at later steps to initiate the reactions.\ntable:files/protocols_protocol_1636_17.csv\naNote: The volume per reaction will be brought to 15 μL when DnaJ2, GrpE and ATP are added at later steps to initiate the reactions.\nNote: 10× PBS (pH 7.4), 20 mM MgCl2, 0.1% Tween-20 can be stored at 25°C for 2 weeks.\nNote: Master mixes A and C contain DnaK because the chaperone is pre-warmed at 37°C prior to the addition of cofactors DnaJ2 and GrpE in a subsequent step. While five time points will be measured, the master mix volumes are calculated for 6 reactions to account for loss in volume due to aliquoting. DMSO is added to master mixes because compounds dissolved in DMSO will be tested in subsequent steps.\nAgitate each microcentrifuge tube and spin down briefly using a table-top centrifuge to mix.\nIncubate reactions A1-3, B1-3 and C1-3 on a heating mantle for 15 min at 37°C.",
    "Note: During this incubation time, prepare the tubes that will be used to quench five time points per reaction by adding 15 μL of 0.05% formic acid to five 0.65 mL microcentrifuge tubes for each replicate. For this experiment, a total of 45 microcentrifuge tubes will be required for quenching the reactions.\nAdd 9 μL of 4 μM DnaJ2 and 9 μL of 4 μM GrpE to reactions B and C for a final concentration of 0.4 μM of each (Tables 3[href=https://www.wicell.org#tbl3] and 4[href=https://www.wicell.org#tbl4]). Agitate tubes and spin down briefly using a table-top centrifuge to mix.\nIncubate reactions A1-3, B1-3, and C1-3 on a heating mantle for an additional 15 min at 37°C.\nInitiate reactions by adding 9 μL of 1 mM ATP to each for a final concentration of 100 μM, starting with reaction A1, in 30-s intervals (see Table 5[href=https://www.wicell.org#tbl5], line 1). Agitate each tube and spin down briefly using a table-top centrifuge to mix.\ntable:files/protocols_protocol_1636_18.csv\nNote: The indicated volumes of ATP and cofactors added to the master mix will bring the final volume per reaction to 15 μL (See Note under each table).\nNote: Staggering reaction initiation times as shown in Table 5[href=https://www.wicell.org#tbl5] will allow you to run multiple time course experiments simultaneously.\nAt 5 min, quench the first reaction (A1) by removing 15 μL from microcentrifuge tube A1 and transferring it to a 0.65 mL microcentrifuge tube containing 15 μL of 0.05% formic acid.\nVortex the quenched reaction and spin down briefly using a table-top centrifuge.\nThirty seconds later, remove 15 μL of the next reaction (A2) and transfer it to a 0.65 mL microcentrifuge tube containing 15 μL of 0.05% formic acid. Vortex the quenched reaction and spin down briefly using a table-top centrifuge.",
    "Repeat step 5b to terminate each subsequent reaction at 30-s intervals (see Table 5[href=https://www.wicell.org#tbl5], line 2) to achieve a 5-min time point for each reaction.\nFor each remaining time point, terminate the reactions as described in step 5 in 30-s intervals following the times shown in Table 5[href=https://www.wicell.org#tbl5], lines 3–6.\nOnce the time course is complete:\nTransfer 15 μL of the ATP standards from step 1d into one row of a 96-well half-area black microplate.\nTransfer 15 μL of each quenched time point to remaining wells in the same 96-well half-area black microplate.\nAdd 15 μL of Kinase Glo Max Reagent to each reaction well (including the ATP standard wells).\nSpin down the microplate at 233 × g for 1 min.\nCover plate with foil and rock at 200 RPM for 10 min at 25°C.\nSpin down the microplate at 233 × g for 1 min.\nPerform a luminescence measurement on a plate reader (1s integration, 25°C).\nCritical: Standards and reactions containing 0.05% formic acid should not be stored at −20°C; hence, all steps after formic acid addition should be performed in sequence on the same day.\nData Analysis of the time course experiment:\nGenerate a linear calibration curve by plotting the relative light units (RLUs) of the ATP standards against the concentration of ATP (μM) (Figure 1[href=https://www.wicell.org#fig1]C). Data can be analyzed in Excel using the simple linear regression equation y = mx + b.\nQuantify the [ATP] (μM) in each reaction time point using the linear calibration curve in Excel.\nTransfer data to Graphpad Prism and plot as “remaining ATP (μM)” vs. “time (min)” for each reaction (Figure 1[href=https://www.wicell.org#fig1]D). Data can be plotted as average values with standard deviation (SD) indicated.",
    "Alternatives: This assay can be modified to test potential inhibitors by diluting a 10× concentration of compound in DMSO in place of the DMSO component in Tables 2[href=https://www.wicell.org#tbl2], 3[href=https://www.wicell.org#tbl3], and 4[href=https://www.wicell.org#tbl4].\nProtocol 3: Determination of the half-maximal inhibitory concentration (IC50) of compounds against cofactor-mediated chaperone ATPase activation\nTiming: 4 h\nThis section details how to determine the IC50 for a potential inhibitor (compound) against the Mtb DnaK-DnaJ2-GrpE co-chaperone network. Here, we use the model compound telaprevir, known to inhibit the activation of Mtb DnaK’s ATPase activity by cofactors (Hosfelt et al., 2021[href=https://www.wicell.org#bib7]). The last step of this section details how to perform a necessary control experiment to rule out false-positive hits that may result from inhibition of coupled assay reagents.\nCritical: Make sure to thaw the Kinase-Glo Max reagent prior to starting and let it warm to 25°C before use.\nPrepare ATP standards as described in steps 1b and c above (Note that formic acid is not used as a quench buffer in this protocol).\nPrepare compound dilutions, DMSO, and ATP stocks in a single V-bottom plate as follows:\nIn the first row of a V-bottom plate, perform a two-fold serial dilution of the desired compound, with an initial concentration of 2.5 mM in the first well (Table 6[href=https://www.wicell.org#tbl6]). If possible, dilute the desired compound in 100% DMSO and perform the serial-dilution in DMSO in a final volume of at least 50 μL per well.\ntable:files/protocols_protocol_1636_19.csv",
    "Critical: It is important to check the solubility of the compound being tested. In this protocol, the model compound, telaprevir, can be dissolved in 100% DMSO. Please refer to the manufacturer’s site for the solubility of commercial compounds in common solvents. Note that if the reaction conditions are changed due to the addition of a different solvent, the buffers used to prepare ATP standards must be adjusted to match the reaction buffers, and enzyme activity must be tested in the desired solvent concentration as detailed in steps 1–8.\nIn the following row of the V-bottom plate, add 50 μL of DMSO to each well.\nIn the next row of the V-bottom plate, add 50 μL of 1 mM ATP in ddH2O to each well.\nNote: Reagents are added to the V-bottom plate to facilitate the use of a multichannel pipette for reagent addition in subsequent steps. A prepared V-bottom plate can be sealed and stored at −20°C for 2 months (unless different compound storage conditions are suggested).\nDilute DnaK, DnaJ2, and GrpE using 1× PBS (pH 7.4), 2 mM MgCl2, 0.01% Tween-20 in a final volume of 100 μL each as 40 μM, 4 μM, and 4 μM stocks, respectively. Keep on ice.\nAdd 15 μL of each ATP standard mixture (from step 9) to row A of a 96-well half-area black microplate (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1636-Fig2.jpg\nFigure 2. Small molecule inhibitors can prevent ATPase stimulation of Mtb DnaK by cofactors\n(A) Representative plate map for an IC50 experiment of the model inhibitor telaprevir against mycobacterial DnaK (4 μM), DnaJ2 and GrpE (0.4 μM each).\n(B) Dose-response curve of telaprevir against DnaK ATPase activation by DnaJ2 and GrpE. [ATP] measured using Kinase-Glo Max reagent (n=3, error bars represent standard deviation (SD)).",
    "(C) Representative plate map for assessment of false positives that inhibit coupled-enzymatic assay reagent (Kinase-Glo Max).\n(D) Representative analysis of a range of [telaprevir] incubated with Kinase-Glo Max confirms that it does not interfere with ATP detection. Instrumental error causes the calculated μM ATP remaining per reaction to exceed 100 μM in some cases.\nPrepare reactions to determine IC50 values of a given compound against DnaK and cofactors as follows:\nNote: DnaK is pre-incubated in reaction mixtures with or without compound prior to adding cofactors to pre-warm the chaperone mixture and facilitate compound binding.\nFollow Table 7[href=https://www.wicell.org#tbl7] to prepare the DnaK-DnaJ2-GrpE master mix reaction that will have varying concentration of added compound.\ntable:files/protocols_protocol_1636_20.csv\naNote: The volume per reaction will be brought to 15 μL when compound, DnaJ2, GrpE and ATP are added at later steps to initiate reactions.\nIn a 1.5 mL microcentrifuge tube, add the indicated reagents and agitate the tube to mix.\nBriefly spin down using a table-top centrifuge.\nTo perform technical triplicates, pipette 9 μL of the master mix to rows B-D of a 96-well half-area black microplate (Figure 2[href=https://www.wicell.org#fig2]A).\nNote: Master mixes shown here are calculated for an excess number of reactions to account for volume loss due to aliquoting reactions and for the analysis of 12 compound concentrations in triplicate.\nFollow Table 8[href=https://www.wicell.org#tbl8] to prepare the master mix for the negative control (DnaK, DnaJ2 and GrpE with vehicle only).\ntable:files/protocols_protocol_1636_21.csv\naNote: The volume per reaction will be brought to 15 μL when DMSO, DnaJ2, GrpE and ATP are added at later steps to initiate reactions.\nIn a 1.5 mL microcentrifuge tube, add the indicated reagents and agitate the tube to mix.\nBriefly spin down using a table-top centrifuge.",
    "To perform technical replicates, pipette 9 μL of the master mix to wells E1-4 of a 96-well half-area black microplate (Figure 2[href=https://www.wicell.org#fig2]A).\nFollow Table 9[href=https://www.wicell.org#tbl9] to prepare the master mix for the positive control (DnaK alone).\ntable:files/protocols_protocol_1636_22.csv\naNote: The volume per reaction will be brought to 15 μL when DMSO and ATP are added at later steps to initiate reactions.\nIn a 1.5 mL microcentrifuge tube, add the indicated reagents and agitate the tube to mix.\nBriefly spin down using a table-top centrifuge.\nTo perform technical replicates, pipette 12 μL of the master mix to wells F1-4 in a 96-well half-area black microplate (Figure 2[href=https://www.wicell.org#fig2]A).\nSpin down the 96-well half-area black microplate at 233 × g for 1 min.\nUse a p10-μL multichannel pipette to add 1.5 μL of 100% DMSO from the V-bottom plate (from step 10b) to wells E1-E4 and F1-F4 of the 96-well half-area black microplate (Figure 2[href=https://www.wicell.org#fig2]A).\nUse a p10-μL multichannel pipette to add the serially-diluted compounds from the V-bottom plate (from step 10a) to wells in rows B-D of the 96-well half-area black microplate (Figure 2[href=https://www.wicell.org#fig2]A).\nCover the microplate with adhesive foil and rock plate at 200 RPM for 2 min at 25°C.\nSpin the plate down at 233 × g for 1 min.\nPre-incubate the plate in a 37°C incubator for 20 min.\nRemove the plate from the incubator and spin at 233 × g for 1 min.\nRemove the adhesive foil from the plate and add 1.5 μL of 4 μM DnaJ2 and 1.5 μL of 4 μM GrpE to rows B-D and E1-E4 of the 96-well half-area black microplate (Figure 2[href=https://www.wicell.org#fig2]A) to obtain a final concentration of 0.4 μM of each cofactor in the indicated wells.",
    "Cover the plate with adhesive foil, rock the plate at 200 RPM for 2 min at 25°C, and then spin the plate down at 233 × g for 1 min.\nPre-incubate the plate in a 37°C incubator for 20 min.\nInitiate each reaction with ATP and quench as follows:\nRemove the plate from the incubator and spin down at 233 × g for 1 min.\nUse a p10-μL multichannel pipette to add 1.5 μL of 1 mM ATP from the V-bottom plate prepared in step 10c to all of the filled wells of the 96-well half-area black microplate (Figure 2[href=https://www.wicell.org#fig2]A).\nCover the plate with adhesive foil, rock for 2 min at 25°C, spin down plate at 233 × g for 1 min, and place in a 37°C incubator for 30 min.\nAfter removal from the incubator, spin down the plate at 233 × g for 1 min.\nNote: The time point (t = 30 min) was selected because it is within the linear phase of the reaction.\nTo quench reactions, add 15 μL of Kinase-Glo Max reagent to each well (including the ATP standards) using an automatic pipette.\nImmediately spin down the plate at 233 × g for 1 min.\nCover plate with foil and rock for 10 min at 25°C.\nCritical: It is important to be consistent with incubation times prior to measuring luminescence on a plate reader.\nSpin down the plate at 233 × g for 1 min and measure luminescence using a plate reader (1s integration, 25°C).\nProceed to step 16 for data analysis.\nPerform the following steps to evaluate if the compound of interest inhibits Kinase-Glo Max reagents.\nAdd 15 μL of ATP Standards to row A of a 96-well half-area black microplate (Figure 2[href=https://www.wicell.org#fig2]C).",
    "Follow Table 10[href=https://www.wicell.org#tbl10] for the preparation of the reaction mixture that will contain serially-diluted compound.\ntable:files/protocols_protocol_1636_23.csv\naNote: The volume per reaction will be brought to 15 μL when compound is added to each well.\nIn a 1.5 mL microcentrifuge tube, add the indicated reagents and agitate the microcentrifuge tube to mix.\nBriefly spin down tube using a table-top centrifuge.\nTo perform technical triplicates, pipette 13.5 μL of the mixture to rows B-D of a 96-well half-area black microplate (Figure 2[href=https://www.wicell.org#fig2]C).\nUsing a p10-μL multichannel pipette, add 1.5 μL of serially-diluted compound (prepared in V-bottom plate from step 10a) to rows B-D of a 96-well half-area black microplate (Figure 2[href=https://www.wicell.org#fig2]C).\nFollow steps 14e–h and proceed to step 17 for data analysis.\nPerform the following steps for data analysis of IC50 experiments (from steps 13 and 14).\nGenerate a linear calibration curve by plotting the relative light units (RLUs) of the ATP standards against the concentration of ATP (μM). The data can be analyzed in Excel using the simple linear regression equation y = mx + b.\nConvert the RLU data of the plate in Figure 2[href=https://www.wicell.org#fig2]A to [ATP] (μM) using the linear calibration curve in Excel.\nExport the data into GraphPad Prism. Plot the “remaining ATP (μM)” from each reaction (analyzed from rows B-D) versus the “log10([compound (μM)])”. The data can be plotted as average values with the standard deviation (SD) indicated.\nNormalize the data by setting the “remaining ATP (μM)” of the positive control (DnaK only + DMSO) as 100% and the “remaining ATP (μM)” of the negative control (DnaK + cofactors + DMSO) to 0%. This will adjust the y-axis from “remaining ATP (μM)” to “percent inhibition of ATPase activation”.",
    "Using GraphPad Prism, calculate the half-maximal inhibitory concentration (IC50) of the compound using the nonlinear equation logEC50 = logECF – (1/HillSlope)∗log(F/(100-F)) and Y = Bottom + (Top-Bottom)/(1+10ˆ((logEC50-X)∗HillSlope) wherein F is set to 50 to calculate 50% inhibition values (see Figure 2[href=https://www.wicell.org#fig2]B).\nNote: EC50 is the effective concentration (EC) of compound necessary for producing 50% of the maximal response. See the manufacturer’s instructions for a detailed description of the equation used, wherein F is defined as the percentage of the maximal response. Since the response is inhibition of DnaK ATPase activation, this equation provides the IC50 value, which is the half-maximal inhibitory concentration of the compound.\nPerform the following steps for data analysis of possible false-positives (from step 15).\nIn Graphpad Prism, plot the data from step 15 as averaged RLU values versus [compound] (μM). The averaged RLU can also be converted to “remaining ATP (μM)” (following steps 16a and b).\nCompare results from ‘vehicle-only’ reactions (B12, C12 and D12 from Figure 2[href=https://www.wicell.org#fig2]C), which represents 100 μM ATP only, and ‘compound’ reactions (rows B-C, wells 1–11) (see Figure 2[href=https://www.wicell.org#fig2]D).\nProtocol 4: Assessment of global chaperone conformational changes in the presence of inhibitors/ligands\nTiming: 5 h",
    "Partial proteolysis experiments are used to help deduce the conformational state of DnaK in the presence of ligands or inhibitors of interest (Meng et al., 2018[href=https://www.wicell.org#bib14]; Kassenbrock and Kelly, 1989[href=https://www.wicell.org#bib11]; Wei et al., 1995[href=https://www.wicell.org#bib23]; Kamath-Loeb et al., 1995[href=https://www.wicell.org#bib10]; Buchberger et al., 1995[href=https://www.wicell.org#bib1]; Preissler et al., 2017[href=https://www.wicell.org#bib18]). A catalytically dead mutant of the Mtb DnaK, T175A, is used to prevent ATP turnover during analysis. In the first step, a control experiment is performed to ensure that the compound of interest does not inhibit the protease at the concentrations tested (steps 18 and 19). In the second step, Mtb DnaK conformation is compared in the apo-, ATP-, and ADP-bound states with the ligand NRLLLTG (Meng et al., 2018[href=https://www.wicell.org#bib14]) or the model inhibitor telaprevir (steps 20 and 21).\nPerform the control proteolysis experiment using denatured hemoglobin monomer as a model substrate, as follows:\nPrepare Hemoglobin buffer as described in materials and equipment[href=https://www.wicell.org#materials-and-equipment].\nNote: Hemoglobin buffer must be prepared fresh before each experiment.\nPrepare compound dilutions in a V-bottom plate according to Table 11[href=https://www.wicell.org#tbl11], with the compound dissolved in DMSO at an initial concentration of 10 mM and two-fold serially diluted in DMSO across 7 wells in a final volume of at least 50 μL per well.\ntable:files/protocols_protocol_1636_24.csv\nDilute proteinase K to 1 μM in 50 μL of ddH2O prior to each experiment. Keep on ice.\nFollow Table 12[href=https://www.wicell.org#tbl12] to prepare the hemoglobin control that lacks added protease in a 0.65 mL low-affinity microcentrifuge tube (VWR). Pipette to mix components.\ntable:files/protocols_protocol_1636_25.csv\nNote: 100 mM potassium phosphate (pH 7.5), 3 M urea buffer must be prepared fresh before each experiment.\nNote: 3 M urea is added to the potassium phosphate buffer to assist in solubilizing the hemoglobin already dissolved in buffer.",
    "Follow Table 13[href=https://www.wicell.org#tbl13] to prepare seven hemoglobin digestion reactions in seven 0.65 mL low-affinity microcentrifuge tubes. Pipette to mix components.\ntable:files/protocols_protocol_1636_26.csv\naNote: The volume per reaction will be brought to 40 μL when compound/DMSO and protease is added to each tube.\nAdd 2 μL of either compound (#1–6) or vehicle only (#7) (DMSO) (Table 11[href=https://www.wicell.org#tbl11]) to the seven reaction mixtures and pre-incubate at 25°C for 30 min.\nNote: To ensure consistent temperature in all reactions, incubate reactions at 25°C using a heat block.\nTo initiate proteolysis reactions, add 2 μL of 1 μM proteinase K for a final concentration of 0.050 μM to each mixture in 30-s intervals.\nAgitate microcentrifuge tubes and briefly spin-down using a table-top centrifuge to mix.\nAfter a t=15 min incubation for each tube, quench each reaction by transferring 20 μL of the mixture to a microcentrifuge tube with 4 μL of 100 mM PMSF and 10 μL of 2× Laemmli buffer.\nFor each sample, analyze 3 μg of hemoglobin (calculated based on amount of protein in quenched samples) by SDS-PAGE (15% acrylamide gel) using standard protocols. Stain with Coomassie Brilliant Blue (see Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1636-Fig3.jpg\nFigure 3. Limited proteolysis experiments deduce global conformational changes in Mtb DnaK in the presence of a ligand/inhibitor\n(A) Representative SDS-PAGE analysis of limited proteolysis of denatured hemoglobin (Hb) monomer with increasing concentrations of telaprevir as a control experiment to evaluate protease inhibition by compound of interest.\n(B) Quantification of the SDS-PAGE result from part A. Hb cleavage is not prevented by 50 μM telaprevir; hence, this concentration was used for conformational analysis experiments. Dashed lines represent the indicated band percentages from lane 2 (no protease added) (n = 3, error bars indicate SD).",
    "(C) Representative SDS-PAGE analysis of limited proteolysis of Mtb DnaK +/− excess nucleotides +/- ligand/inhibitor shows that samples with telaprevir retained the greatest amount of full-length (FL) DnaK compared with the apo and NRLLLTG samples. NBD: nucleotide binding domain; SBD: substrate binding domain; ∗ indicates partial cleavage of the C-terminal ɑ-helical lid. A portion of this figure is reprinted with permission from Hosfelt et al., 2021[href=https://www.wicell.org#bib7].\nFor data analysis of the control proteolysis experiment, upload an image of the stained acrylamide gel to Bio-Rad Image Lab.\nFollow the manufacturer’s instructions to calculate the percent band intensities in each lane (see Figure 3[href=https://www.wicell.org#fig3]B).\nNote: Based on the results, choose a concentration of compound for the next steps that does not inhibit the protease, but is predicted to bind DnaK according to the IC50 value calculated above (step 16). For telaprevir (TP), a final concentration of 50 μM was chosen based on hemoglobin proteolysis results and its IC50 value (4–8 μM).\nPerform the following steps for limited proteolysis analysis of Mtb DnaK T175A (the catalytically dead mutant) in the presence of a compound of interest or a known ligand.\nPrepare Proteolysis buffer (10× Buffer D) as stated in materials and equipment[href=https://www.wicell.org#materials-and-equipment].\nNote: Proteolysis buffer (10× Buffer D) must be prepared fresh before each experiment.\nDilute proteinase K to 1 μM in 50 μL total volume using ddH2O prior to each experiment.\nDilute DnaK T175A to an initial concentration of 200 μM using 1× PBS (pH 7.4), 2 mM MgCl2, 0.01% Tween-20 in a final volume of at least 15 μL.\nNote: DnaK T175A was dialyzed to remove bound nucleotides prior to starting the experiment. See Protocol 1, step 4g.\nTo prepare nucleotide-bound DnaK with and without ligand/inhibitor, follow Table 14[href=https://www.wicell.org#tbl14].\ntable:files/protocols_protocol_1636_27.csv",
    "aNote: These components will be added first and pre-incubated for t=1 h at 25°C.\nPrepare six 0.65 mL low-affinity microcentrifuge tubes and label according to the components (see Note below).\nAdd indicated components (ddH2O, 10× Buffer D, DnaK T175A, and appropriate nucleotide).\nAgitate tubes and briefly spin down using a table-top centrifuge to mix.\nIncubate at 25°C for 1 h.\nNote: Six tubes are suggested because each ATP- and ADP-bound DnaK will be incubated with (1) vehicle, (2) the known ligand NRLLLTG and (3) the model inhibitor telaprevir. Tubes should be labeled according to the components (e.g., ADP, ADP + inhibitor, ADP + ligand, ATP, ATP + inhibitor, ATP + ligand).\nTo prepare apo-DnaK, follow Table 15[href=https://www.wicell.org#tbl15].\ntable:files/protocols_protocol_1636_28.csv\naNote: These components will be added first and pre-incubated for t=1 h at 25°C.\nPrepare three 0.65 mL low-affinity microcentrifuge tubes and label according to the components (apo, apo + ligand, and apo + inhibitor).\nAdd indicated components (ddH2O, 10× Buffer D, and DnaK T175A).\nAgitate tubes and briefly spin down using a table-top centrifuge to mix.\nIncubate at 25°C for 1 h.\nTo prepare the control lacking protease, follow Table 16[href=https://www.wicell.org#tbl16].\ntable:files/protocols_protocol_1636_29.csv\naNote: These components will be added first and pre-incubated for t=1 h at 25°C.\nPrepare one 0.65 mL low-affinity microcentrifuge tube.\nAdd indicated components (ddH2O, 10× Buffer D, and DnaK T175A). Agitate tube and briefly spin down using a table-top centrifuge to mix.\nIncubate at 25°C for 1 h.\nAfter 1 h of pre-incubation for all microcentrifuge tubes, add 1 μL of vehicle (DMSO) or 20× [compound/ligand] to the appropriate reactions. Agitate tubes and briefly spin down using a table-top centrifuge to mix. Pre-incubate at 25°C for 30 min.",
    "Note: Final concentrations of telaprevir and NRLLLTG (Pellecchia et al., 2000[href=https://www.wicell.org#bib17]; Stevens et al., 2003[href=https://www.wicell.org#bib20]) in the reactions described here are 50 and 500 μM, respectively. Hence, initial concentrations were 1 and 10 mM, respectively.\nAfter the second pre-incubation step, initiate proteolysis reactions by adding 1 μL of 1 μM proteinase K to each reaction in 30-s increments. Agitate tubes and briefly spin down using a table-top centrifuge to mix.\nQuench each reaction after 15 min by adding 0.2 μL of 100 mM PMSF and 20 μL of 2× Laemmli buffer. Vortex to mix and spin down using a table-top centrifuge.\nHeat samples for 5 min at 95°C and load 1 μg of DnaK (calculated based on the amount of protein in the quenched samples) on a 12% acrylamide gel (Invitrogen) for SDS-PAGE analysis with a protein molecular weight ladder. Stain with Coomassie Brilliant Blue using standard protocols.\nNote: Percentage of acrylamide gels should be adjusted based on the desired molecular weights that will be analyzed.\nExperiments should be run in triplicate prior to data analysis.\nFor data analysis of partial proteolysis of Mtb DnaK, upload an image of the stained acrylamide gel to Bio-Rad Image Lab.\nFollow the manufacturer’s instructions to calculate the predicted molecular weights of the proteolysis fragments using a standard molecular weight ladder (such as Bio-Rad Precision Plus).\nCompare the distribution of truncations for each state of DnaK with vehicle only, known ligand and compound of interest (Figure 3[href=https://www.wicell.org#fig3]C, box).\nAlternatives: The molecular weight of proteolysis bands can be determined using Image Processing and Analysis in Java (ImageJ), which is available for free download. Bio-Rad Image Lab requires an account to log-in.\nProtocol 5: Reconstitution of DnaK-cofactor folding activity to identify chaperone inhibitors\nTiming: 3 h",
    "This experiment is performed to evaluate the ability of inhibitors to disrupt the chaperone-mediated folding activity of a model substrate, denatured luciferase, over a time course. An overview of the experimental scheme is presented in Figure 4[href=https://www.wicell.org#fig4]A. Four mixtures will be set up as replicates: reaction D: chaperone and cofactors with denatured luciferase and vehicle; reaction E: chaperone and cofactors with denatured luciferase and added compound; reaction F: denatured luciferase; reaction G: native luciferase.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1636-Fig4.jpg\nFigure 4. Reconstitution of protein folding by Mtb DnaK and cofactors can be used to evaluate inhibitors of chaperone activity\n(A) Schematic of DnaK-DnaJ2-GrpE-mediated protein folding assay of a model substrate, denatured luciferase, performed in triplicate.\n(B) Standard curve of luminescence (in RLU) versus varying concentration of native luciferase to determine appropriate concentration of luciferase for given plate reader settings.\n(C) Denatured luciferase reactivation by Mtb DnaK (5 μM), DnaJ2 (1 μM), GrpE (2.5 μM) +/- excess telaprevir (100 μM) over a time course with the data represented as relative light units (RLU) (left) or normalized compared to the native and denatured luciferase controls (right) indicates telaprevir inhibits protein folding (n=3, error bars indicate SD). A portion of this figure is reprinted with permission from Hosfelt et al., 2021[href=https://www.wicell.org#bib7].\nCritical: Use 0.65 mL low-affinity microcentrifuge tubes (VWR) for all preparations in the assay to prevent the denatured substrate luciferase from sticking to tubes.\nCritical: Make sure to thaw the Luciferase Assay reagent (Promega) prior to starting and let it warm to 25°C before use.\nCritical: Perform this experiment near a plate reader with settings preset for the luminescence measurements (1 s integration) or use an autoinjector to add luciferase reagent in the plate reader.",
    "Critical: Ensure to add bovine serum albumin (BSA) to buffers containing luciferase samples to stabilize luciferase, and to prevent adhesion to tubes/plate wells.\nNote: This protocol is written so that components are prepared during the incubation steps.\nPerform reconstitution of DnaK and cofactor chaperone activity by carrying out the following steps:\nPrepare both the 2× and 1× Buffer R as described in materials and equipment[href=https://www.wicell.org#materials-and-equipment]. Filter solutions and store at 25°C.\nPrepare protein stocks and 40 mM ATP as follows:\nPrepare 5 mL of 40 mM ATP in ddH2O.\nDilute chaperones DnaK, DnaJ2, and GrpE to initial concentrations of 100 μM, 40 μM, and 100 μM, respectively, using 1× PBS buffer in at least 50 μL total volume. Agitate tubes and briefly spin down using a table-top centrifuge to mix. Keep on ice.\nDilute luciferase to 100 μM using 1× Buffer R in a final volume of 20 μL. Agitate the tube and briefly spin down using a table-top centrifuge to mix. Keep on ice.\nNote: A standard curve should be generated to determine how much luciferase to use in the experiment by plotting the relative light units (RLU) against the concentration of luciferase (Figure 4[href=https://www.wicell.org#fig4]B). Select a concentration of luciferase that is within the linear range of your plate reader settings.\nLabel twelve 0.65 mL low-affinity microcentrifuge tubes for the four reactions (D-G) that will be set up in triplicate. Tubes can be labeled as D1, D2, D3, E1, E2, E3, etc.\nFollow Table 17[href=https://www.wicell.org#tbl17] for the preparation of reactions D and E: initially add respective volumes of indicated components (2× Buffer R, ddH2O, and DTT) to each tube.\ntable:files/protocols_protocol_1636_30.csv\naNote: These components will be added first.\nNote: 2× and 1× Buffer R must be filtered and can be stored at 25°C for 1 year.",
    "For reaction D, add 2.5 μL of 100% DMSO to each tube.\nFor reaction E, add 2.5 μL of 40× compound to each tube.\nNote: The desired final concentration of telaprevir is 100 μM, thus the initial stock concentration used is 4 mM.\nFor both reactions, add 5 μL of DnaK. Agitate tubes to mix and briefly spin down using a table-top centrifuge. Incubate reactions at 25°C for 30 min.\nNote: To ensure a consistent temperature in all reactions, incubate reactions at 25°C using a heat block. DnaK is added prior to cofactors to facilitate compound binding.\nFollow Table 18[href=https://www.wicell.org#tbl18] to prepare reactions F and G. Pipette appropriate volumes of indicated components (2× Buffer R, ddH2O, DTT and 100% DMSO) into each tube.\ntable:files/protocols_protocol_1636_31.csv\naNote: These components will be added first and pre-incubated at 25°C for 1 h.\nAgitate tubes and briefly spin down using a table-top centrifuge to mix. Incubate reactions at 25°C for 1 h.\nPrepare the denatured luciferase stock solution by following Table 19[href=https://www.wicell.org#tbl19] in a low-affinity microcentrifuge tube. Vortex to mix all components and briefly spin down using a table-top centrifuge. Incubate at 25°C for 1 h.\ntable:files/protocols_protocol_1636_32.csv\nAfter 30 min of incubation at 25°C, add 2.5 μL of DnaJ2 and GrpE to Reactions D and E (Table 17[href=https://www.wicell.org#tbl17]). Agitate tubes and briefly spin down using a table-top centrifuge to mix. Incubate reactions at 25°C for 30 min.\nPrepare the native-luciferase stock solution following Table 20[href=https://www.wicell.org#tbl20] in a low-affinity microcentrifuge tube. Agitate tube and briefly spin down using a table-top centrifuge to mix. Place on ice.\ntable:files/protocols_protocol_1636_33.csv\nTo initiate reactions and start time course:\nAdd 5 μL of 40 mM ATP to all of the tubes (Reactions D-G).",
    "Add 1 μL of denatured luciferase to reaction D1 to initiate the reaction. Agitate tube, spin down using a table-top centrifuge, and incubate at 25°C.\nProceed to add 1 μL of denatured luciferase to Reactions D2 to F3 following the instructions in step ii above.\nAdd 1 μL of native luciferase to Reactions G1 to G3. Agitate each tube, spin down using a table-top centrifuge, and incubate at 25°C.\nCritical: Additions of 1 μL of denatured and native luciferase should be done as quickly as possible. Upon addition of denatured luciferase to each reaction, the time course starts.\nFor the 5-min time point: Approximately 45 s prior to the time point, transfer 10 μL of triplicate reactions (D1-3, E1-3, F1-3 and G1-3) into separate wells of a 96-well half-area black plate.\nAt t = 5 min, immediately add 25 μL of Luciferase Assay reagent using an automatic pipette and perform a luminescence measurement on a plate reader (1s integration, 25°C). Repeat for each replicate.\nFollow the same process for conducting the t = 10-, 15-, 20-, and 30-min time points.\nData Analysis of the chaperone folding experiment:\nExport luminescence data to Prism. Plot as the average relative light units (RLU) versus time (min) for each reaction (D-G).\nNormalize data by setting the native luciferase control (reaction G) to 100%, and the denatured luciferase control (reaction F) to 0%. This will adjust the y-axis from being relative light units (RLU) to percentage (%) of native luciferase activity (see Figure 4[href=https://www.wicell.org#fig4]C). Data can be plotted as average values with standard deviation (SD) indicated."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}