{
  "id": 4824,
  "origin_website": "Bio",
  "title": "3’ Rapid Amplification of cDNA Ends (3’ RACE) Using <em>Arabidopsis</em> Samples",
  "procedures": [
    "Extracting total RNA from flower budsPour liquid nitrogen in the mortar, let it to evaporate and then carefully place plant material. Grind until a fine homogeneous powder is obtained. Store in a 1.5 ml Eppendorf tube with a small spatula.Note: Operate at room temperature. Plant material can be freshly collected or previously harvested and stored at -80 °C. In both cases, however, harvesting must be carried out under freezing conditions (it is recommended to keep the Eppendorf tube and spatula in liquid nitrogen prior to use).Extract total RNA by using GeneJET Plant RNA Purification Kit (see protocol[href=https://tools.lifetechnologies.com/content/sfs/manuals/MAN0012668_GeneJET_Plant_RNA_Purification_UG.pdf]). Add 20 μl of 1 M DTT to each 500 μl of RNA Lysis Solution (containing the chaotropic salt guanidine thiocyanate). Add this mixture to the tube containing the tissue powder (up to 100 mg) and vortex for 10-20 sec to mix thoroughly. This step should be performed quickly to avoid degradation.Incubate for 3 min at 56 °C in a thermomixer or heat block.Centrifuge for 5 min at maximum speed (≥20,000 x g, ≥13,000-14,000 rpm).Collect the supernatant (usually 450-550 μl) and transfer to a clean 1.5 ml tube.Add 250 μl of 96% ethanol. Mix by pipetting.Transfer the mixture to a purification column inserted in a 2 ml collection tube (both provided with the kit).Centrifuge the column for 1 min at 12,000 x g (~11,000 rpm). Discard the flow-through solution and reassemble column and collection tube.Add 700 μl of Wash Buffer WB 1 (provided with the kit) to the purification column.Centrifuge for 1 min at 12,000 x g (~11,000 rpm). Discard the flow-through and collection tube. Place the purification column into a clean 2 mL collection tube.Add 500 μl of Wash Buffer 2 (provided with the kit) to the purification column.Centrifuge for 1 min at 12,000 x g (~11,000 rpm).",
    "Discard the flow-through solution and reassemble column and collection tube.Repeat previous steps A2j-k and re-spin the column for 1 min at maximum speed to remove all traces of Wash Buffer 2.Elute the RNA with 50 μl of nuclease-free water and centrifuge for 1 min at 12,000 x g (~11,000 rpm). Repeat this step with the same volume of nuclease-free water to increase the yield of RNA.Use the purified RNA immediately or store until use. Storage at -80 °C is recommended.DNase treatment and concentration.Treat the sample with 5 µl (5 U) of DNase I (Thermo Fisher Scientific, according to manufacturer’s protocol[href=https://tools.lifetechnologies.com/content/sfs/manuals/MAN0012000_DNase_I_RNasefree_1UuL_UG.pdf] with minor modifications) for 1 h at 37 °C to eliminate traces of genomic DNA. Include RiboLock RNase Inhibitor at 1 U/µl to prevent RNA degradation.Add 10 µl 50 mM EDTA and incubate at 65 °C for 10 min.Immediately, mix the RNA sample with two volumes of cold 100% ethanol and store at -20 °C for several hours or overnight.Add 1/10 volume of 4 M LiCl and centrifuge at 12,000 rpm and 4 °C for 10 min. Remove the supernatant carefully.Wash with 500 µl cold 70% ethanol and centrifuge as in step A3d.Remove as much supernatant as possible with the pipette tip. Put the microcentrifuge tube with the open lid in a box with ice, and let the pellet dry for 5 min at the bench or in a laminar flux cabin.Note: Drying the pellet at room temperature also works fine.Resuspend in 25 μl RNase-free water and store at -80 °C if not used immediately.Determine RNA concentration photometrically, and check integrity by visualizing 500 ng in a 2% agarose gel (Figure 1).Note: It is highly recommended to use photometer cuvettes and gel trays previously treated with 0.",
    "4 M NaOH (at least for 5 min) to minimize the presence of RNases.Control PCR. Despite DNase I treatment after RNA extraction, 0.5 µl of the sample was used as template for a conventional PCR reaction with deoxynucleotide primers to test absence of genomic DNA. Carry out PCR with a pair of primers of your choice to test the presence of DNA in your sample. Actin or other housekeeping genes might be suitable.PCR components:16 µl Distilled water2.5 µl 10x Buffer B (+15 mM MgCl2)1 µl dNTPs mix (5 mM each)1 µl ACT2-f (5 µM)(see oligonucleotide sequence below)1 µl ACT2-r (5 µM)(see oligonucleotide sequence below)0.25 µl (1.25 U) Taq DNA polymerase0.5 µl RNA simplePCR profile:table:",
    "﻿0,1\n1 cycle,\"94 °C, 2 min\"\n35 cycles,\"94 °C, 30 sec; 51 °C, 30 sec; 72 °C, 30 sec\"\n1 cycle,\"72 °C, 10 min\"",
    "3’ RACEDesigning specific primers (forward primers).Primers were designed using the free online software OligoCalc (http://www.basic.northwestern.edu/biotools/oligocalc.html[href=http://www.basic.northwestern.edu/biotools/oligocalc.html]). Best suited primers usually are 20 to 25 nt in length, and 50-60% GC content (as suggested by the Roche 5’/3’ RACE Kit protocol[href=http://lifescience.roche.com/shop/Instructions4Use?storeId=20855&catalogId=10001&langId=-1&id=iforu&iforu_page=search&catalogNumber=03353621001&instruction_version=Version+10]). Melting temperature (Tm) must be close to that of the PCR Anchor primer (see below), not exceeding a 5 °C difference.Retrotranscription.According to the instructions provided by the Maxima Reverse Transcriptase protocol[href=https://tools.lifetechnologies.com/content/sfs/manuals/MAN0012044_TS_Maxima_Reverse_Transcriptase_2000U_UG.pdf] with minor modifications.Mix the following components for the annealing reaction mixture:5 µg of previously isolated total RNA1 µl of Oligod(T)-Anchor Primer (37.5 µM) from Roche 5’/3’ RACE Kit (A polydT stretch followed by an adapter sequence, see primer sequence below)1 µl dNTPs mix (10 mM each)14.5 µl Distilled water (nuclease-free)Incubate at 65 °C for 5 min. Chill on ice, centrifuge for a few seconds (to place the whole reaction at the bottom) and place on ice again.Add the following reaction components to the annealing mixture in the indicated order4 µl 5x RT Buffer (provided with the enzyme batch)0.5 µl (20 U) RiboLock 1 µl (200 U) Maxima Reverse Transcriptase Incubate at 60 °C for 30 min.Note: Retrotranscription of GC-rich RNAs can be performed at 65 °C. Indeed, temperature may vary from 50 to 65 °C. Pilot experiments might be necessary to find optimal temperature.Terminate the reaction by heating at 85 °C for 5 min.Retrotranscription verification.This is an optional step. Carry out a conventional PCR procedure with a pair of primers of your choice to corroborate the presence of cDNA in your sample. Actin or other housekeeping genes might be suitable.First PCR (PCR amplification of cDNA). According to the High Fidelity PCR Enzyme Mix protocol[href=https://tools.lifetechnologies.com/content/sfs/manuals/MAN0012922_High_Fidelity_PCR_Enzyme_k0191_UG.pdf] with some modifications.",
    "Prepare the following reaction mixture30 µl Distilled water5 µl 10x High Fidelity PCR buffer (+ 15 mM MgCl2)1 µl dNTPs mix, 10 mM each1 µl specific primer (forward primer), 12.5 µM5 µl Template DNA 0.4 µl (2 U) High Fidelity PCR Enzyme Mix 8 µl PCR Anchor Primer (reverse primer) 12.5 µM (from Roche 5’/3’ RACE Kit, corresponding to the adapter sequence. See primer sequence below)PCR profile (check manufacturer’s indications, parameters may vary according to the length of the expected products)1 cycle 94 °C, 2 min35 cycles 94 °C, 30 sec; 57 °C, 30 sec; 68 °C, 4 min 30 sec1 cycle 68 °C, 10 minNote: It might be convenient to perform simultaneous reactions with distinct forward primers (2-4) hybridizing at close locations in order to select that one yielding optimal results.Check 10 µl of the reaction in an agarose gel (Figure 2)Note: Agarose concentration and running time may depend on the size of the expected products. Second PCR. Same as in step B4, except template (an aliquot of the first strand PCR), and a new forward primer (hybridizing downstream to the one used in the first reaction to endorse specificity).Reaction mixture34 µl Distilled water5 µl 10x High Fidelity PCR buffer (+ 15 mM MgCl2)1 µl dNTPs mix, 10 mM each1 µl specific primer (forward primer), 12.5 µM8 µl PCR Anchor Primer (reverse primer) 12.5 µM1 µl First PCR reaction0.4 µl (2 U) High Fidelity PCR Enzyme MixUse same PCR profile as in step B4b.Note: Eventually the forward primer might be one of those tested for the first strand reaction provided that it lies downstream to the one used during that step. Isolate PCR products.Load the whole reaction in an agarose gel and carry out electrophoresis until the bands are separated as much as possible (Figure 3).",
    "Note: Agarose concentration may depend on the length of the expected products.Under a UV transilluminator, excise PCR DNA bands and store separately in Eppendorf tubes.Purify DNA using GeneJET Gel Extraction Kit (see protocol[href=https://tools.lifetechnologies.com/content/sfs/manuals/MAN0012661_GeneJET_Gel_Extraction_UG.pdf]) or any other equivalent system. Finally, DNA is eluted from columns in a total volume of 30 µl.Cloning and sequencing.Eluted dsDNA PCR fragments contain 3'-A overhangs that allow for easy cloning in any T-vector plasmid system. For example, see protocol[href=http://www.chem.agilent.com/library/usermanuals/public/240205.pdf] for StrataClone PCR Cloning Kit. Finally, sequence and analyze the structure of inserts contained in positive clones."
  ],
  "subjectAreas": [
    "Plant Science",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}