{
  "id": 16987,
  "origin_website": "Jove",
  "title": "The Automated Crystallography Pipelines at the EMBL HTX Facility in Grenoble",
  "procedures": [
    "NOTE: Funded access to these pipelines for scientists worldwide is supported through a series of funding programs. At the moment of writing this manuscript applications for access are accepted through either the iNEXT Discovery program (https://inext-discovery.eu), an European facility network to stimulate translational structural biology20 funded by the Horizon 2020 programme of the European Commission or INSTRUCT-Eric (https://instruct-eric.eu/). Contact the corresponding author for the current modalities and routes for funded access at a particular time. This protocol describes operation of the protein-to-structure pipeline and includes steps common to all our pipelines while specificities for the other two pipelines are discussed in the following section. The instructions here refer to CRIMS V4.0. \n1. High Throughput Crystallization Laboratory\nBefore starting, ask for registration at the HTX lab through the CRIMS system https://htxlab.embl.fr/#/. The user credentials provide remote access to all experimental design and evaluation interfaces. \n\t\nLog in to CRIMS through a web navigator (Firefox, Chrome and Safari are supported). The CRIMs web server is encrypted to prevent third parties from accessing data while it travels through the web. Once in CRIMS, a series of menus to the left of the screening help manage and create samples, request crystallization experiments, manage and visualize plates, etc. A series of video tutorials are available at https://medias01-web.embl.de/Mediasite/Showcase/embl/Channel/a2168bcaa36b4564851663e5b69594014d.\n\t\tNOTE: Users sending samples by courier need to register the samples and the requested crystallization experiments through CRIMS before sending the sample to ensure they can be processed without delay upon arrival. Please, send the shipment details to htx@embl.fr.\nLog in into CRIMS (https://htxlab.embl.fr ) with a web browser and click on the Samples Menu. This will open an interface with project and sample management tools.",
    "Click on the New Sample button and provide the information requested. CRIMS allows to organize samples under different projects, targets and constructs. Assign the sample to existing ones or create new ones at this point.\nOnce the requested information has been entered click on Save & Make Request. Select the crystallization protocol, the crystallization screens to be used, the incubation temperature and the desired date for the experiments.\n\t\nUse the comment fields to provide indications about the samples that are important for the HTX lab operators to know. Custom screens can also be selected (see below). After submitting the crystallization request it will be validated by the HTX Lab Team and confirmation about the scheduling of the experiments will be sent via e-mail. Make sure to select experiment dates that are compatible with times required for sample shipment.\nOnce the samples arrive in the facility operators at the HTX lab will carry out the experiments as requested. Once crystallization experiments are set up, confirmation will be sent via e-mail and crystallization trays will be transferred to the automated imagers. CRIMS provides access to all experimental parameters and will automatically track new imaging sessions. E-mail notifications will be automatically sent when new images are available. An thermofluor-based30 sample quality assessment experiment based on a protocol developed at the facility25,26 is carried out with every sample at this point and will be available through CRIMS.\nImages of the crystallization experiments along with the results of the sample quality assessment will be available in CRIMS shortly after the crystallization trays are set up. Click on the Thermofluor menu and navigate to the sample to see the results of the sample quality assessment experiment.",
    "Click on the Plates menu to see the images from the Crystallization plates. Navigate to the sample and either click on View to see the last imaging session or on the + (expand) symbol to select a different imaging session. A series of tools help to find and navigate easily through the samples. For example, clicking in a project box at the top of the screens filters samples for that project and search functions are available for most of the table columns.\nUse the plate View interface to help evaluate and score the results of the crystallization experiments. It allows navigation through the different wells of the crystallization plates, select image types (i.e., Vis, UV), select image resolution or record scores, for example. This interface also provides all experimental parameters used for the crystallization experiments including the composition of the crystallization solutions.\nClick on the Refinement menu to design crystal optimization screens based on primary hit conditions identified through the initial screening. The Chemicals and Stock Solutions submenus allow one to register and manage the crystallization stock solutions. The Screens submenu provides access to an interface to design your own optimization or custom screens.\n\t\nSelect the plate type, stock solutions or gradient configurations that best fit the experimental design. It is possible to ask CRIMS to output a file directly compatible with the Formulator Robot (Formulatrix) to automatically pipette the screens into the plate or to output a printable document with the volumes for manual operation.\nIterate through steps 1.2-1.8 to carry out crystal optimization experiments.\nOnce crystals suitable for X-ray diffraction experiments are identified, navigate to the plate View interface and select the image corresponding to the right crystallization drop. Pre-stored scores will help you do this easily.",
    "Click either on Crystal Harvesting to record an automated crystal harvesting plan for the CrystalDirect harvester robot or on Manual Harvesting for traditional manual crystal mounting, if using CRIMS at a facility that is not equipped with CrystalDirect. Both interfaces will guide the user through the crystal harvesting process. CRIMS will automatically record and store the location of harvested crystals into either SPINE or Unipucks21.\nSelect the Crystal Manager menu in CRIMS. Click on the Harvested Crystals submenu to inspect the frozen samples. When using the CrystalDirect harvester, images of the harvesting process are presented, including images of the pins with the harvested crystals.\nSelect the Shipments menu to connect to either ESRF or Petra III synchrotrons and create sample shipments for X-ray diffraction analysis. Click on the Create Shipment button and select the synchrotron you want to use and the bag number (the bag password at the synchrotron is necessary here). The next series of interfaces are used to select the pukcs to be included in the shipment. The system makes it possible to provide comments to support data collection and determine data collection parameters for automated beamlines like MASSIF-1.",
    "If data collection is being carried out at ESRF or Petra III HTX lab, operators will transfer the samples to the beamline, data collection at other synchrotrons will be done at the user's own expense. It is possible to collect data by traveling to the synchrotron, through remote beamline operation or at MASSIF-1. In the latter case, the data collection process is fully automated. At the synchrotron, specific interfaces in ISPyB29 allow users to recover the information sent by CRIMS and associate sample pucks to it so that results of data collection are automatically tracked. For the experiments described here, data collection at synchrotrons was typically carried out with the MXcube31 software, while data processing and structure refinement was carried out with atuoPROC32, Staraninso33, BUSTER33, Pipedream32,33 and Coot35.\nOnce data collection experiments have been carried out CRIMS retrieves summary information along with results of initial data processing at the synchrotron from the ISPyB29 system. Go to CRIMS Crystal Manager menu and click on the Crystal Diffraction Data sub menu. All the information and metadata regarding diffraction data collection is available. It is also possible to download processed data from the synchrotron as well as raw diffraction images. View multiple data collections or select specific datasets. Sample management tools make it possible to navigate and select samples for specific projects constructs.\n\tNOTE: This pipeline provides fully automated operation over the internet from pure protein to X-ray diffraction results and can be operated with one or multiple samples at the same time. It can be applied to different context and project types in structural biology."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}