{
  "id": 13722,
  "origin_website": "Jove",
  "title": "Geomagnetic Field (Gmf) and Plant Evolution: Investigating the Effects of Gmf Reversal on Arabidopsis thaliana Development and Gene Expression",
  "procedures": [
    "1. Setting of the Triaxial Coils\nNOTE: Figure 1 shows the triaxial coils used to reverse the GMF.\nTurn on the three-axis magnetometer, whose probe is inserted in the triaxial coils.\nTurn on the computer and launch the magnetometer software that allows data to be collected from three-axis magnetometer.\nUse the component values reported by the magnetometer to calculate the magnitude of the GMF. For instance, with magnetometer values: Bx = 6.39 µT, By = 36.08 µT, Bz = 20.40 µT calculate a field strength of 41.94 µT by using the following equation: B = BGMF + Badditional, where Badditional = (Bx2 + By2 + Bz2)½ (i.e., 41.9 µT in the example.)\nTurn on the three DC power supplies (dual range: 0-8V/5A and 0-20V/2.5A, 50W) each one connected to three couples of Helmholtz coils and connected to a computer via a GPIB connection (Figure 1B).\nSet voltages of the power supplies to generate the desired magnetic field with a reversed magnetic field vector. For instance, with BGMF as in step 1.3 and with the coil size of the instrumentation described here, set the voltages to Vx =0.00 V, Vy = 30.52 V, Vz = 0.00 V in order to generate a new resultant B = BGMF + Btriaxial coils = (6.38, -36.08, 20.39) µT. i.e., a new field with the same magnitude as BGMF but pointing to a different direction.\nVerify the new field with the magnetometer software by using the procedure described in 1.3.\nExpose plants to both normal and reversed GMF conditions by using Petri plates as described in section 2.",
    "Perform sham exposure experiments by keeping the magnitude of the field equal to | BGMF| and keeping the vertical component of the field equal to that of the GMF but altering the direction (i.e., “North, East or West”) of the horizontal component of the field with equal currents in the triaxial coils compared to the field reversal condition. Do this by altering the voltage of the coils as described in 1.5.\n\tNote: This sham exposure rules out potential subtle heating or vibrational effects from either the coils themselves or from the electronics used to control the coils.\nRun double-blind experiments by applying field conditions blinded from the personnel performing the remainder of the experiments and/or interpreting the data.\n2. Preparation of Plant Materials and Conditions for Plant Growth\nUse seeds of Arabidopsis thaliana, ecotype Columbia 0 (Col 0), place then into a 1.5 ml tube and surface sterilize by treatment with a 5% (w/v) calcium hypochlorite solution and 0.02% (v/v) Triton X-100 in 80% ethanol (EtOH), for 10-12 min at 25-28 °C, with continuous shaking. Then rinse twice with 80% EtOH, wash with 100% EtOH and finally rinse with sterile distilled water.\nPrepare 1 L of Murashige and Skoog 22 (MS) modified medium by adding: 2.297 g of MS (0.5 x MS Basal Salt Mixture), 10 g Sucrose, deionized water up to 1 L, pH 5.8-6.0 adjusted with KOH. Add 16 g of agar and autoclave for 20 min, 120 °C.\nBefore solidification, pour 80 ml of medium into each (120 x 120 mm2) square Petri plates. Sow thirty sterile seeds on plate, and then seal plates with a waxy film.\nVernalize the plates horizontally in darkness at 4 °C for 2 days to potentiate and synchronize germination, and then expose Petri plates to either normal or reversed GMF.",
    "Expose seeds in a climate controlled environment at 22 °C in a vertical position in parallel experiments both inside the triaxial coils and outside the triaxial coils under a photoperiod schedule of 8 hr darkness and 16 hr light, using Sodium vapor lamps (220 x 10-6 E m-2s-1). Use a blue gelatin film for spotlight to reduce the red component of lamps.\nExpose plants for 10 days before RNA extraction to both normal (control) and reversal (treatment) GMF conditions.\nAfter exposure, take pictures of Petri dishes.\nUse the ImageJ software to calculate root length and leaf areas.\n\t\nBriefly, measure the side of the Petri plate, then open the image of the Petri plate and by using the “straight” line option to draw a line that exactly crosses the plate side.\nIn the “analyze” menu select “set scale” and insert the actual distance in the “known distance” box (e.g., 120 mm), then insert the unit of length (mm); finally click the “global” option to make settings available for all measurements.\nFor root length, follow carefully the shape of the root by using the freehand tool. Measure the length by using the “measure” option in the “analyze” menu. Continue to measure all roots in the picture and save the file for further statistical analyses.\nFor leaf area, from the “image” menu use the adjust option and then “color threshold”. Select the individual leaf and in the “analyze” menu select “analyze particles”. Save the individual measurements for statistical analyses.\n3. Arabidopsis Total RNA Extraction, Quantitative Real Time-PCR (qPCR) Reaction Conditions and Primers for Arabidopsis\nCollect separately 30 shoots and 30 roots and immediately freeze in liquid nitrogen. Then grind in liquid nitrogen with mortar and pestle.\nIsolate total RNA using a purification kit and RNase-Free DNase treatment kit by using manufacturer’s instructions.",
    "Check sample quality and quantity by using an RNA nano kit and capillary gel electrophoresis according to manufacturer’s instructions. Confirm the quantification of RNA spectrophotometrically.\nUse 2 µg of total RNA and random primers using a cDNA Reverse Transcription Kit to obtain first strand cDNAs according to the manufacturer’s recommendations.\nPerform all experiments on a Real-Time System using SYBR green I with ROX as an internal loading standard.\nPerform the reaction with 25 µl of mixture consisting of 12.5 µl of 2x SYBR Green qPCR Master Mix, 0.5 µl of cDNA and 100 nM primers. Use the primers listed in Table 1. Include in controls non-RT controls (using total RNA without reverse transcription to monitor for genomic DNA contamination) and non-template controls (water instead of template).\nCalculate primer efficiency for all primers pairs using the standard curve method 23.\nUse the following PCR conditions: CRU3, COTP1, RRTF1. 10 min at 95 °C, 40 cycles of 15 s at 95 °C, 30 sec at 58 °C, and 30 sec at 72 °C; UBP6, eEF1Balpha2, ACT1, GAPC2, CAT3, TAPX, APX1, RbohD, FeSOD1 10 min at 95 °C, 40 cycles of 15 s at 95 °C, 20 sec at 57 °C, and 30 sec at 72 °C.\nRead fluorescence following each annealing and extension phase. For all runs, perform a melting curve analysis from 55 to 95 °C by including the dissociation segment in the thermal profile. Use the dissociation curve screen, accessed through the results tab to view the dissociation profile (plot of the fluorescence as a function of temperature). Ensure that the dataset collected during the dissociation segment of the experiment is selected for analysis using the Analysis/Setup screen.",
    "Determine the linear range of template concentration to threshold cycle value (Ct value) by performing a tenfold dilution series (1- to 103-fold) using cDNA from three independent RNA extractions analyzed in three technical replicates 24,25.\nAnalyze all amplification plots with the Real-Time PCR instrument software to obtain Ct values. Calibrate and normalize relative RNA levels with the level of the best housekeeping genes as follows: 3.11.1) Access the Amplification Plots screen through the Results tab, select the ramp or plateau for which data should be analyzed using the Analysis Selection/Setup screen, and then select the dRn (baseline-corrected normalized fluorescence) from the Fluorescence menu on the command panel. Access the Plate Sample Values screen through the Results tab to display Ct values for the sampled wells.\nUse four different reference genes [e.g., cytoplasmic glyceraldehyde-3-phosphate dehydrogenase, (GAPC2), ubiquitin specific protease 6 (UBP6), Actin1 (ACT1) and the elongation factor 1B alpha-subunit 2 (eEF1Balpha2)] to normalize the results of the real time PCR. Select the top ranked gene using an analysis software 26; and use the most stable gene for normalization.\n\t\nBriefly, organize the input data on an Excel sheet with the first column containing the gene names and first row containing the sample names. Then select the analysis software from the menu-bar. Use the dialog box to select the input data.\nNext, check the fields Sample names, gene names and simple output only. Click on Go button to perform the analysis. Select the top ranked gene (which has the smallest stability value) as candidate gene most stably expressed.\nPlot data by showing the differential fold change expression in both shoots and roots.\n4. Statistical Analyses",
    "Express data as mean values ± standard error. Compare the control and the treatment groups by performing analysis of variance (ANOVA) and Tukey’s test with Bonferroni and Dunn-Sidak Adjusted Probability test (0.95% confidence)."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}