{
  "id": 7795,
  "origin_website": "Bio",
  "title": "Automated Sleep Deprivation Setup Using a Shaking Platform in Mice ",
  "procedures": [
    "The procedures of electrode implantation surgery, EEG/EMG recoding, and data processing have been described in detail in our previous studies (Eban-Rothschild et al., 2016; S. B. Li et al., 2018; S. B. Li et al., 2020; Bian et al., 2022; S. B. Li et al., 2022), and therefore will not be a focus of this protocol. The SD system can accommodate up to four mice with EEG/EMG recording at the same time, using a custom-made divider (cardboard, Makrolon plastic, or other materials) which prevents the tangling of recording cables (Figure 1B).Wean the mouse pups on postnatal day (P) 21 and assign them randomly to Sleep Deprivation (SD) or Control (Ctrl) groups.Implant the electrodes for EEG/EMG recording at P28–P30 (Bian et al., 2022).After the surgery, individually house the animals in the customized home-cage (Figure 1C).At least one day before EEG/EMG recording, habituate the animal to the ultra-light extension cord for at least 24 h, by connecting the cord to the mouse headset. Fix the other end of the extension cord above the home-cage. Allow an ample length of the extension cord, for the free moving of the animal, but avoid leaving too much of the cord in the cage to prevent the animal from biting it. Mice will be kept connected for the entire experimental period.Baseline recording of spontaneous sleep/wake cycle in the home-cage (P36, Day 0).Connect the extension cord to the main EEG/EMG cable and the recording setup.Start recording at 7:00 (ZT 0) and stop recording at 7:00 the next morning (ZT 24).Set up the SD and Ctrl protocols in the Shaker Driver (Figure 2 and Video 1).In Stimulation Designer, set High Level Duration (ms) to 15, Total Duration (ms) to 500, and Delay (ms) to 0.",
    "Test the communication amongst the computer, the control box, and the deprivation chamber by clicking the Test button in Shaker Driver. It will generate a pulse as you programmed in Stimulation Designer, and the platform should shake accordingly.Set up the delivery sequence of pulses for the SD and Ctrl protocols.For the SD protocol, set Protocol duration (hours) to 4 in Sequence Designer, check “Use a randomized number of stimulations,” and set Number of Stimulations per sequence from 2 to 8. Check “Use a randomized Time between 2 sequences (min)” and set Time from 0.2 to 0.8. This will generate a train of randomized 2–8 pulses (of 15 ms in duration) delivered at 2 Hz every randomized 0.2–0.8 minutes, for a total duration of 4 h.For the Ctrl protocol, set Protocol duration (hours) to 4 in Sequence Designer, uncheck “Use a randomized number of stimulations,” and set Number of Stimulations per sequence to 5. Uncheck “Use a randomized Time between 2 sequences (min)” and set Time to 0.5. This will generate a train of five pulses (of 15 ms in duration) delivered at 2 Hz every 0.5 min, for a total duration of 4 h.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4620/bioprotoc-13-04-4620-g002.jpgFigure 2. Software interface of Shaker Driver <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Setting up Shaker Driver for the SD and Ctrl protocolsPerform the Ctrl/SD protocol (P37–P41, Days 1–5)Place bedding materials on the platform. Other materials/objects (e.g., shredded paper, nestlets, or paper tubes) may also be added as environmental enrichment, as they help to prevent distress in animals. Place a few food pellets and hydrogels (see Notes) on the platform, so the animals have access to food and water ad libitum.Transfer the SD animals to the deprivation chamber at 9:00 (ZT 2). No prior acclimation or habituation to the chamber is needed.",
    "The novel environment of the chamber also helps to maintain the animals awake. Place each animal in each compartment separated by the cardboard divider and allow the extension cord to pass through from the top of the apparatus (Figure 1A, B and Video 2). Start the SD procedure in Shaker Driver. After 4 h (ZT 2–6), the procedure will stop, or it can be manually terminated by clicking the Stop button.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Programmed platform shaking during an SD session For Ctrl animals, transfer them to the deprivation chamber and start the Ctrl protocol at 19:00 (ZT 12) and stop at 23:00 (ZT 16).After either an SD or Ctrl session, immediately return the animals to their home-cages.Discard the bedding, food pellets, and hydrogels. Clean the apparatus with 70% ethanol.Repeat steps a–e for the remaining days of the Ctrl/SD protocol.EEG/EMG recording is continuously performed on Day 3 from 7:00 (ZT 0) to 7:00 the next morning (ZT 24). It can also be performed in other days during the five days of Ctrl/SD (see Notes).One day after Ctrl/SD (P42, Day 6), record the 24-h EEG/EMG signals in the home-cage.To examine the stress response potentially caused by the SD or Ctrl protocols, measure the plasma corticosterone level by enzyme-linked immunosorbent assay (ELISA):Use a different cohort of animals without EEG/EMG recording and subject them to steps 6 and 7. On Days 1 and 5, immediately after the Ctrl/SD session, anesthetize the animal using isoflurane and use a capillary to collect a small quantity of blood (~100 μL) from the retro-orbital sinus into heparin-treated microvette tubes (Sarstedt Inc., 16.443.100). The animal should recover from at least one blood collection. Collect no-shake control samples from naïve animals without any manipulation at the same ZT.",
    "Separate the plasma from the whole blood sample by centrifugation (Eppendorf, Centrifuge 5424) at 1,000 × g and room temperature for 15 min. Transfer the supernatant (plasma) to a clean tube, avoiding contamination with the blood cells in the precipitate.Measure the corticosterone level in the plasma samples using a corticosterone ELISA kit (Enzo, ADI-900-097), according to the manufacturer’s instructions."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}