{
  "id": 14995,
  "origin_website": "Jove",
  "title": "Measuring Caenorhabditis elegans Sensitivity to the Acetylcholine Receptor Agonist Levamisole",
  "procedures": [
    "1. Preparation of plates for the levamisole assay\nPrepare nematode growth medium (NGM) media by combining 3 g of NaCl, 2.5 g of peptone, and 17 g of agar with 1 L of deionized (DI) water in a flask with a stir bar.\nAfter autoclaving, put the media on a hot plate set to 70 °C and stir at a moderate speed for 1 h.\nAdd 1 mL of 5 mg/mL cholesterol dropwise to prevent precipitation, 1 mL of 1 M CaCl2, 1 mL of 1 M MgSO4, and 25 mL of 1 M pH 6.0 potassium phosphate buffer to the media.\nTransfer 2 mL of NGM media into each well of a 24-well plate with a sterile serological pipette (Figure 1).\nAllow the plates to dry on the benchtop for 2 days before seeding with bacteria. For longer-term storage, place them at 4 °C.\nStreak out OP50 E. coli on a lysogeny broth (LB) plate and grow overnight at 37 °C.\nPick a single OP50 colony into B-broth (10 g of tryptone and 5 g of NaCl in 1 L of DI H2O) and set the culture shaking at 37 °C overnight.\nUsing a sterile pipet, drop 30 µL of OP50 suspension onto the agar in the middle of each well (Figure 1).\n\tNOTE: Be sure not to damage the agar surface as this will lead to worm burrowing.\nLet the plates sit at room temperature for at least 2 days after seeding to allow a bacterial lawn to form.\n\tNOTE: If the bacteria in the center wells is not dry after 2 days, leave the plates open in the hood for 20 min (Figure 1). The plates should be poured and seeded with bacteria 1-2 weeks before the assay.\n2. Synchronizing  C. elegans (day 1)",
    "Grow wild-type, unc-63(x26), lev-10(x17), and unc-49(e407) C. elegans to adulthood on 6 cm plates, preparing at least eight plates per strain. Confirm that there are many non-starved gravid adults on the plates.\n\tNOTE: This is twice as many plates as needed; however, it is important to have backup plates in case the first batch of eggs is destroyed during bleaching.\nMake 10x M9 buffer by dissolving 59.6 g of Na2HPO4 (dibasic), 29.9 g of KH2PO4 (monobasic), 12.8 g of NaCl, and 2.5 g of MgSO4 in 750 mL of DI water with stirring. Once dissolved, bring the volume up to 1 L and filter sterilize. Dilute 1:10 and autoclave to make 1x M9 buffer.\n\tNOTE: The 1x M9 buffer can be made weeks or months in advance.\nPrepare bleaching solution under the hood on the day of synchronization. Mix 10 mL of bleach (Table of Materials), 2.5 mL of 10 N NaOH, and 37.5 mL of DI water in a 50 mL conical tube. Wear goggles, gloves, and a lab coat whenever working with the bleaching solution.\nUsing a plastic transfer pipet, wash gravid adult worms from at least four plates with 1x M9 buffer and transfer them into a 15 mL conical tube.\nSpin at 716 x g for 1 min at room temperature, and then remove the supernatant using a transfer pipet.\nAdd 10 mL of the bleaching solution. Invert or gently shake the tube for ~4 min until most, but not all, of the worm carcasses have dissolved (Figure 1).\n\tNOTE: Be careful not to over-bleach the worms as this will destroy the eggs. Certain mutations may increase the difficulty of egg isolation.\nSpin at 716 x g for 1 min.",
    "Pour off the bleach solution in one motion; as long as the tube is not shaken at this point, the eggs will stick to the side of the tube.\nAdd 15 mL of 1x M9 buffer and invert. Spin at 716 x g for 1 min, and pour off M9 buffer in one smooth motion.\nPerform three washes in total with 1x M9 buffer, as described in step 2.9.\nAfter the final wash, add 10 mL of fresh 1x M9 and place on a rotator overnight at 15 °C to isolate a synchronized population of starved first larval (L1) stage animals.\n\tNOTE: Before placing on the rotator, check to make sure that there are eggs in the M9 buffer. If not, repeat the prep with backup plates and bleach for a shorter time.\n3. Plating synchronized  C. elegans (day 2)\nPrint out a 24-well plate map and assign strains to randomized places. Each strain should be represented in the 24-well plate at least six times.\nApproximately 24 h after the bleach prep, spin down hatched starved L1 worms in M9 buffer at 716 x g for 1 min at room temperature.\nRemove ~9 mL of M9 buffer with a plastic transfer pipet, and then gently mix the starved first larval stage worms (L1s) in the remaining M9 buffer.\nImmediately pipet 3 µL of the worms in M9 buffer onto a microscope slide and determine the number of L1s; the desired number is 20-30 L1s in 3 µL. Spin down and remove M9 if the worm concentration is too low, and add M9 if the concentration is too high.\n\tNOTE: Check the number of worms per 3 µL at least 2x, inverting the tube each time.",
    "Pipet 3 µL of L1s (20-30 worms total) into each well according to the pre-made plate map (step 3.1; Figure 1).\n\tNOTE: Invert the tube with the L1s in M9 frequently to maintain an even distribution of worms as they will settle to the bottom. If this is not done, some wells will have too few worms, while others will have too many. Also, do not pierce the agar with the pipet tip as this will cause the animals to burrow.\nLet the worms grow to adulthood for 3 days at 20 °C.\n\t​NOTE: The use of different growth temperatures and certain mutations can impact maturation speed, so be sure to consider the C. elegans life cycle.\n4. Performing the levamisole assay (day 5)\nPrint a blank datasheet, which will be used to record the number of worms moving in each well every 5 min for 1 h.\n\tNOTE: Students will be able to count the worms in at most 12 wells every 5 min. The top 12 wells are assayed in the first hour, with the bottom 12 wells assayed in the subsequent hour.\nCheck the worms in the 24-well plates. Using a marker, make an \"X\" on the plate lid over any wells that have contamination, have starved, or have too many worms (>40), which will make counting difficult.\nMake 0.4 mM levamisole solution by adding 200 µL of 100 mM levamisole stock to 50 mL of 1x M9. Prepare 100 mM levamisole stock by dissolving 240.76 mg of levamisole hydrochloride in 10 mL of H2O and store it at −20 °C.\n\tNOTE: Levamisole must be diluted in M9; dilution in H2O accelerates paralysis. Students should wear gloves. Ingestion of high concentrations of levamisole is toxic.",
    "Start a timer and then, using a transfer pipet, add 1 mL of 0.4 mM levamisole to the first two wells, such that the animals are freely swimming. Continue to add levamisole to the adjacent wells, staggering the time according to the number of wells to be assayed.\n\tNOTE: For example, if 10 wells are assayed, levamisole will be added in the following manner: wells 1 and 2 at time 0, wells 3 and 4 after 1 min, wells 5 and 6 after 2 min, wells 7 and 8 after 3 min, and wells 9 and 10 after 4 min.\nAt 5 min, start manually counting only the number of moving worms in each well, beginning with the first well, and record that number on the datasheet (Figure 1). Counters can be used but are not required to accurately determine the number of moving worms.\n\tNOTE: Students need to keep an eye on the timer as they will sometimes get behind during early time points before many worms paralyze. The number of time points can be adjusted, or fewer wells can be assayed at each time point if necessary.\nContinue to count the number of moving worms in each well every 5 min for 1 h.\n\tNOTE: Immersion in M9 induces constant swimming movement over the course of this 1 h assay, which eliminates the need for the prodding of the worms to assess paralysis (Figure 2A). Exposure to 0.4 mM levamisole solution induces time-dependent paralysis as observed by cessation of swimming; worms that paralyze do not recover.\nRepeat steps 4.4.-4.6. for the rest of the wells in the plate.\nAt the end of the assay, or when time permits, record the total number of worms in each well.\n5. Data analysis",
    "Obtain the plate map (step 3.1.) and record which strain corresponds to each well.\n\tNOTE: Due to the amount of data collected, the subsequent analysis and discussion of the data will take at least a couple of hours.\nEnter the data into a spreadsheet, starting with the total number of worms in each well and organizing by genotype.\nCombining data from the wells, determine the number of worms moving at each time point for every strain.\nUse these data to create a \"survival curve\" in the statistical software (Table of Materials) to visually display the time-dependent paralysis of the population (Figure 2B).\nMake a data table such that the left-hand column indicates time and subsequent columns contain the data for each strain. For each animal that is paralyzed within the first 5 min, create a row and enter a \"1\" for 5 min. Repeat this for each time point. For all animals that do not paralyze by the end of the assay, enter a \"0\" for 60 min.\nPerform pairwise comparisons using the log-rank (Mantel-Cox) test in the statistical software (Table of Materials) to determine if there is a statistically significant difference between two different strains.\nFor additional/alternative analysis, instead of performing step 5.3. and step 5.4., determine the percentage of animals moving in each well at every time point. Plot the average with standard error at each time point for all strains assayed using a spreadsheet program or the statistical software (Figure 2C)."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}