{
  "id": 3816,
  "origin_website": "Cell",
  "title": "Protocol for fractionation-assisted native ChIP (fanChIP) to capture protein-protein/DNA interactions on chromatin",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThe procedure is illustrated in Figure 1[href=https://www.wicell.org#fig1].\nCell culture\nTiming: 1–3 days before the experiment (depending on your cells and POI)\nThe standard number of cells required for adherent cells (e.g., HEK 293T) is 1 × 107 and for suspension cells (e.g., leukemia cell lines) to prepare 2 mL of chromatin is 2 × 107. For HEK 293T cells, this is usually equivalent to a confluent culture in a 10 cm dish. Below is an example to perform fanChIP-WB and fanChIP-qPCR using HEK 293T cells transiently expressing POI.\nTwo days prior to “Cell Harvesting”, seed HEK 293T cells on a 10 cm dish to achieve 80% confluency on the next day. This is usually achieved by seeding at a density of approximately 25%\nOne day before “Cell Harvesting”, transfect expression vector carrying the gene of interest according to manufacturer's protocol(e.g., Lipofectamine 2000 transfection reagent: https://www.thermofisher.com/jp/en/home/references/protocols/cell-culture/transfection-protocol/lipofectamine-2000.html[href=https://www.thermofisher.com/jp/en/home/references/protocols/cell-culture/transfection-protocol/lipofectamine-2000.html]). Change media after 6–8 h of transfection.\nPreparation of buffers/equipment\nTiming: 30 min\nThaw the required buffers in icy water and keep them on ice until use. Make sure that the PBS, CSK buffer, MNase buffer, and lysis buffer are ready at the beginning of “Cell Harvesting”.\nPlace the rotator (for MNase digestion) in a 37°C incubator to prewarm it\nSet the centrifugation temperature to 4°C.\nCell harvesting\nTiming: 5 min\nIn this step, cells are harvested for chromatin preparation. The methods are described for 1 × 107 adherent cells (cultured in a 10 cm dish) and 2 × 107 suspension cells to prepare 2 mL of chromatin. The volumes of buffers should be scaled up or down according to the amount of the starting material.",
    "Note: Before starting the procedure, ensure that all required solutions are prepared and stored at an appropriate temperature. Use safe-lock tubes throughout the procedure to avoid leakage during incubation and rotation.\nAdherent cells (e.g., HEK 293T cells)\nRemove media and add 1 mL of PBS.\nDetach the cells from the dish using a cell lifter (if it is difficult to detach the cells using a cell lifter, trypsinize, wash with PBS, and follow the procedure described for suspension cells).\nDissociate clumped cells by pipetting with P1000 pipette.\nTransfer the suspension to a 2 mL centrifuge tube.\nSpin down (400 × g, 5 min, 4°C) and remove the supernatant.\nResuspend the cells with 1 mL of ice-cold PBS.\nTransfer the tube to a cold ice rack.\nSuspension cells (e.g., HB1119 cells)\nCount the number of cells.\nTransfer 2 × 107 cells to a 50 mL centrifuge tube.\nCentrifuge the tube (400 × g, 5 min, 4°C) and remove the supernatant.\nResuspend the cells in 10 mL PBS.\nCentrifuge the tube (400 × g, 5 min, 4°C) and remove the supernatant.\nResuspend the cells in 1 mL of ice-cold PBS, and transfer them to a 2 mL centrifuge tube.\nExtraction of chromatin fraction\nTiming: 30 min–1 h\nIn this step, chromatin samples are prepared for subsequent IP. From this step to the “elution” step, perform all procedures on ice or at 4°C to avoid protein degradation. Centrifuge tubes should be kept on a cold ice rack for short intervals between each procedure (See the procedures illustrated in Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/538-Fig2.jpg\nFigure 2. Schema for “extraction of chromatin fraction”\nNumbers correspond to the steps mentioned in the step-by-step method details[href=https://www.wicell.org#step-by-step-method-details].\nCentrifuge the tubes containing the cell suspension (400 × g, 5 min, 4°C) and remove the supernatant.",
    "Add 1 mL of cold CSK buffer, and dissociate clamped cells completely by pipetting. This step solubilizes the cell membrane, permeabilizes the nuclear membrane, and liberates chromatin-unbound proteins.\nIncubate the lysates for 5 min on ice.\nCentrifuge the tubes (400 × g, 5 min, 4°C) and remove the supernatant.\nAdd 1 mL of MNase buffer and pipet 5–10 times to resuspend the nuclei.\nAdd the predetermined amount of MNase to the tubes [It is necessary to identify the optimal conditions for digestion by testing various amounts of MNase and the incubation time in advance (the steps 22–25). We recommend starting with 1 unit of MNase for 5 min of incubation].\nSet the tubes on a rotator in a 37°C incubator.\nIncubate at 37°C with rotation for the planned time period.\nAlternatives: If the rotator is unavailable, a 37°C incubator or thermal block can be used. In this case, the tubes should be mixed every 1–2 min by gently inversing the tubes.\nRemove the tubes from the rotator, and immediately place them on a cold ice rack.\nNext, add 40 μL of EDTA (0.5 M, pH 8.0) to the tubes, and mix by inverting to completely stop MNase digestion.\nAdd 1 mL of lysis buffer, and mix by pipetting five times.\nIncubate on ice for 5 min to solubilize proteins.\nCentrifuge tubes at 17,700 × g (or at maximum speed of the centrifuge) to pellet the insoluble materials (5 min, 4°C).\nTransfer the supernatant to a new 2 mL centrifuge tube as the “Chromatin fraction”, and store it at −80°C or proceed to check chromatin fragmentation (the steps 22–25).",
    "Pause Point: If you stored the samples at −80°C, you can pause at this point. However, frequent freeze-thaw cycles should be avoided as they may disrupt the protein-protein/DNA interactions of interest. Consider aliquoting the sample in volumes of 400 μL (for fanChIP-qPCR/seq) or 1 mL (for fanChIP-WB).\nCritical: Chromatin fragmentation to appropriate sizes is critical for successful chromatin IP. This is dependent on the conditions of MNase treatment (total unit, incubation time). Proceed with the steps 22–25 punctually. The fragmentation pattern differs depending on the concentration of MNase, cell type, number of cells, and laboratory equipment. See also troubleshooting 1[href=https://www.wicell.org#sec6.1]. The chromatin fragmentation pattern of Lane #4 and 8 in Figure 3[href=https://www.wicell.org#fig3] is recommended for IP. The fragmentation patterns of Lane #5 and 9 are also acceptable especially for ChIP of histone modifications\n.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/538-Fig3.jpg\nFigure 3. Chromatin fragmentation pattern using MNase\n“chromatin fractions” were obtained from HEK 293T cells with different MNase treatment conditions. Purified DNA from the chromatin was electrophoresed in a 2% agarose gel at 100 V for 40 min. DNA was visualized with Midori Green Advance DNA staining solution. “n” indicates mono-nucleosome.\nChecking chromatin fragmentation\nTiming: 1 h\nIn this step, the degree of chromatin digestion is checked.\nNote: While handling DNA, use filter tips to avoid cross contamination.\nTransfer 50 μL of “Chromatin fraction” to a new 1.5 mL microcentrifuge tube.\nAdd 50 μL of phenol/chloroform/isoamyl alcohol (25:24:1, PCI) to the tube and vortex vigorously.\nCentrifuge tubes at 17,700 × g (or at maximum speed of centrifuge machine, 10 min, 25°C)\nAfter centrifugation, three layers consisting of top clear, middle white, and bottom yellow layers can be observed. Transfer 10 μL of the top layer to 2 μL of 6 × loading dye and mix.\nElectrophorese DNA in a 2% agarose gel.\nImmunoprecipitation (primary antibody)",
    "Timing: 15 min–30 min followed by 5 h of incubation\nIn this step, a specific antibody against your POI is added to the chromatin sample to form chromatin/antibody complexes. If the chromatin samples are stored at −80°C, they should be thawed on a cold ice rack in advance. This will take 10–30 min depending on the volume of stored samples. Set a rotator for antibody incubation in a refrigerator.\nPrepare 1.5 mL centrifuge tubes as the “input” samples. (For qPCR/NGS samples, they will be used in the step 50 for DNA extraction). Typically, we mix 20 μL of the chromatin sample and 180 μL of elution buffer in a tube as an input sample for fanChIP-qPCR/seq while we mix 60 μL of the chromatin sample and 60 μL of 2 × sample buffer for fanChIP-WB (10% input). Store the samples at −20°C.\nTransfer 400 μL of chromatin sample to a new 1.5 mL centrifuge tube for “IP”. For the analysis of histone modifications, add 32 μL of 5 M NaCl to the tube (final NaCl concentration is approximately 550 mM). This high salt concentration induces dissociation of chromatin reader proteins and exposes the epitope.\nAdd antibody to the “IP” tube. One microgram of antibody is the standard amount used for 400 μL of chromatin (final 2.5 μg/mL), but it should be empirically determined for your POI and antibody.\nSet the “IP” tube on a rotator placed in a refrigerator.\nRotate for 5 h.\nNote: Consider preparing a negative control. The use of normal IgG is one common method. If your POI is an exogenously expressed protein, the chromatin of untransfected cells can be a good negative control.",
    "Note: You may use a bead-conjugated primary antibody (e.g., Anti-FLAG M2 Magnetic Beads) for IP-WB. In that case, skip the next step and proceed to “Elution”.\nImmunoprecipitation (Dynabeads Protein G)\nTiming: 10 min followed by 1 h of incubation\nIn this step, the Protein G beads are equilibrated and then added to the chromatin-antibody mix to purify the DNA/protein complex of your POI.\nAdd 10 μL × (N + 1) [N is the number of samples] of Dynabeads Protein G suspension to a 1.5 mL centrifuge tube containing 1000 μL of fanChIP wash buffer (the “beads” tube).\nPlace the “beads” tube on the DynaMag-2 Magnet tube holder, and wait until the beads are completely attached to the side of the magnet and the solution is cleared.\nDiscard the cleared solution, and add 400 μL of fanChIP wash buffer to the “beads” tube.\nResuspend the beads in the buffer by removing the upper plastic holder together with the tubes from the bottom magnet stand and inverting it repeatedly.\nSet the plastic holder on the magnet stand, and wait until the solution is clear.\nRepeat the steps 33–35 twice to equilibrate the beads.\nDiscard the clear solution, and add 50 μL × (N + 1) of fanChIP wash buffer to the “beads” tube.\nRemove the “beads” tube from the plastic holder, and repeatedly invert the tube to suspend the beads.\nPlace the “IP” tubes onto a cold ice rack from the rotator.\nAdd 50 μL of the bead suspension to each “IP” tube.\nSet the tubes on a rotator, and rotate for another hour at 4°C.\nElution\nTiming: 15 min–1 h (depending on the number of samples)\nIn this step, the DNA/protein complexes of your POI attached to the beads are washed, and then eluted for further analyses.",
    "Place the “IP” tubes on the DynaMag-2 Magnet tube holder, and wash with 400 μL of fanChIP wash buffer five times as described in the steps 33–35.\nDiscard the cleared solution and briefly centrifuge the “IP” tubes (400 × g, 30 s, 4°C) to spin down the residual wash buffer.\nPlace the “IP” tubes on the DynaMag-2 Magnet tube holder.\nCarefully remove the residual wash buffer from the bottom of the tube.\nAdd 40 μL (for WB) or 200 μL (for qPCR or NGS) of elution buffer, and break the pellet by pipetting five times.\nCritical: It is important to rigorously resuspend the beads by pipetting for efficient elution at the step 46.\nPlace the “IP” tubes on the DynaMag-2 Magnet tube holder.\nFor qPCR/NGS samples, carefully pipette the eluted sample into a new 1.5 mL centrifuge tube.\nFor WB samples, transfer the eluted sample to a new 1.5 mL centrifuge tube containing 40 μL of 2 × sample buffer.\nPause Point: Store samples at −20°C, and you can pause at this point. However, frequent freeze-thaw cycles may accelerate protein degradation.\nDNA extraction for ChIP-qPCR/seq\nTiming: 30 min–1 h\nIn this step, the samples for DNA analyses (e.g., qPCR, NGS) are prepared. DNA is purified from the eluted and input samples, and dissolved in TE buffer after EtOH precipitation.\nAdd 200 μL of PCI (25:24:1) to the tube and vortex vigorously. Make sure to also perform the same procedure to the input samples from the step 26.\nCentrifuge tubes at 17,700 × g (or at maximum speed of the centrifuge machine, 10 min, 25°C).\nDispense 20 μL of 3 M NaOAc and 2 μL glycogen solution (20 mg/mL) in a new 1.5 mL centrifuge tube during centrifugation.",
    "After centrifugation, carefully transfer the top layer (approximately 190 μL) to the tube with NaOAc/glycogen, and mix by vortexing.\nAdd 500 μL of 100% EtOH and vortex vigorously. You can pause here and store the samples at −20°C.\nCentrifuge the tubes (17,700 × g, 10 min, 4°C).\nCarefully remove the supernatant so as not to disturb the white pellet.\nAdd 500 μL of 70% EtOH and vortex vigorously.\nCentrifuge the tubes (17,700 × g, 5 min, 4°C).\nCarefully remove the supernatant so as not to disturb the white pellet.\nBriefly centrifuge tubes to spin down residual EtOH.\nCarefully remove EtOH with a P20 pipette.\nAdd 400 μL (for qPCR) or 130 μL (for NGS) of TE buffer to the IP samples to solubilize DNA.\nAdd 1000 μL of TE buffer to the input samples to prepare a 2% solution of input sample.\nPause Point: You can pause at the step 54 or 63 and store the samples at −20°C."
  ],
  "subjectAreas": [
    "Chromatin Immunoprecipitation (Chip)",
    "Genomics",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}