{
  "id": 16632,
  "origin_website": "Jove",
  "title": "Single-Molecule Imaging of EWS-FLI1 Condensates Assembling on DNA",
  "procedures": [
    "1. Preparation of the lipid bilayer master mix\nRinse glass vials with double-distilled water (ddH2O) and 99% ethanol and dry them in a 60 °C drying oven.\nMake the lipid master mix by dissolving 1 g of 1,2-dioleoyl-sn-glycero-3-phosphocholine (DOPC), 100 mg of polyethylene glycol-reacted (PEGylated) lipids (18:1 of 1,2-dioleoyl-sn-glycero-3-phosphoethanolamine-N-[methoxy (polyethylene glycol)-2000] (ammonium salt) (PEG2000 DOPE) and 25 mg of biotinylated lipids (18:1 of 1,2-dioleoyl-sn-glycero-3-phosphoethanolamine-N-(cap biotinyl) (sodium salt) (Biotinyl Cap DOPE)) into 10 mL of chloroform.\nPrepare 1 mL aliquots of the lipid master mix per vial and store them at -20 °C in clean glass vials.\n\tNOTE: Store the dissolved lipid in glass vials and cover the vial cap with parafilm during storage.\n2. Preparation of liposome solution\nRinse a 2 mL glass vial with ddH2O and 99% ethanol and dry it thoroughly in a 60 °C drying oven.\nRinse a 250 µL glass syringe with chloroform and then transfer 200 µL of the lipid master mix into the dry glass vial.\nUse a nitrogen spray gun to flow N2 gently while continuously rotating the vial in one direction.\n\tNOTE: The N2 will help evaporate the chloroform, and the residual lipids will form a thin film on the wall of the glass vial. Adjust the nitrogen stream to be very gentle at first and increase the flow when a white film appears in the vial; complete this evaporation process within 5 min.\nTransfer the glass vial to a vacuum drying oven at room temperature (RT) for 16-24 h for complete removal of the chloroform from the lipids.",
    "Add 2 mL of fresh lipid buffer (10 mM Tris-HCl (pH 7.5) and 100 mM NaCl) to the glass vial and dissolve the lipids at RT for 2 h. Vortex the solution several times and transfer it to a 5 mL polypropylene culture tube.\nSonicate the lipid solution on ice with a micro-tip sonicator to form small unilamellar vesicles, using the following settings: 6 s on-12 s off (20% amplitude) for 6 cycles, then 6 s on-6 s off (30% amplitude) for 3 cycles, finally 10 s on (40% amplitude).\n\tNOTE: The temperature increase during sonication could result in the bursting of foam and destroy the liposomes. Therefore, check the state of the foam and the temperature and replenish the ice frequently.\nFilter the liposomes through a 0.22 µm nylon syringe filter, aliquot, and store it at 4 °C.\n\tNOTE: As their mobility decreases with prolonged storage, the liposomes must be used in 2-3 months or prepared freshly before use.\n3. Sequence cloning and biotinylation of Lambda DNA\nInsertion of the binding motifs into Lambda DNA\n\t\nDigest the target fragment containing the binding motifs and Lambda DNA with NheI and XhoI. Ligate the target fragment with Lambda DNA using T4 ligase overnight at RT.\nCulture E.coli VCS257 cells in antibiotic-free LB medium until the OD600 reaches 0.6. Store the bacteria at 4 °C for later use.\nHeat the ligation solution at 65 °C for 20 min to denature the T4 ligase.\nThaw the Lambda phage extract, mix it with the ligated product gently by pipetting with blunt tips, and incubate the mixture at RT for 2 h.",
    "Add 500 µL of SM buffer (50 mM Tris-HCl (pH 7.5), 100 mM NaCl, and 8 mM MgCl2, filtered through a 0.22 μm filter) and 20 µL of chloroform into the packaging mixture from step 3.1.4, mix well, and centrifuge the solution.\n\t\tNOTE: The activity of the packaging extract can be maintained at 4 °C for prolonged periods.\nPrepare the reaction mixture by mixing 10 µL of packaging extract with 90 µL of SM buffer and 100 µL of the VCS257 cells (from step 3.1.2) together, and incubate the mixture at 37 °C for 15 min.\n\t\tNOTE: The packaging solution concentration depends on the density of the phage plaques on the following day; it can be diluted or added as needed.\nTake ~5 mL of melted top agar (22 g/L NZCYM broth with 15 g/L agar) in a 15 mL tube. As soon as the top agar cools down to ~42 °C, add the reaction mixture (from step 3.1.6) slowly using a blunt-end pipette and pour the liquid onto an antibiotic-free LB agar plate. Keep the plate in a 37 °C incubator overnight.\nConfirm the positive plaques among the transparent phage plaques on the top agar plate by PCR. Transfer the positive plaques to a new top agar plate with a pipette and keep the plate in a 37 °C incubator overnight.\nAdd 400 µL of VCS257 cells into 400 µL of buffer containing 10 mM MgCl2 and 10 mM CaCl2, inoculate one plaque into this cell mixture, and incubate it in a 37 °C shaker at 250 rpm for 15 min.\nAdd 800 µL of this suspension containing the phage plaque to 200 mL of NZCYM broth in a 2 L flask and incubate it in a 37 °C shaker at 125 rpm.",
    "Measure OD600 of the bacterial suspension after ~4 h of cultivation. Keep in mind that the OD600 value will rise first and then drop to a trough at ~0.2. Stop the incubation when the OD600 value is about to rise again, add 500 μL of chloroform, and shake at 80 rpm for another 5 min.\n\t\tNOTE: The increase in OD600 after the trough will occur quickly; hence, the OD600 value must be measured more often when it decreases to 0.3 to avoid excessive VCS257 cell growth in the culture.\nTransfer the phage culture to a 500 mL bottle, add 11.7 g of NaCl, and shake the bottle. Incubate the bottle on ice for 10 min.\nTransfer the suspension equally into four 50 mL tubes. Centrifuge the tubes at 12,000 x g for 10 min.\n\t\tNOTE: All these centrifugation steps in section 3.1 need to be done at 4 °C.\nTransfer the supernatants to four new 50 mL tubes and centrifuge again at the same speed for 5 min.\nCollect the supernatants, add 10% (w/v) PEG8000 powder, and rotate at 4 °C to incubate for 30 min.\nCentrifuge the suspensions from step 3.1.15 at 12,000 x g for 15 min to obtain the phage pellets.\nResuspend the pellets in 1 mL of phage dilution buffer (10 mM Tris-HCl (pH 7.5), 100 mM NaCl, and 10 mM MgCl2) in four tubes and pour all 4 mL of these mixtures into a 50 mL tube.\nAdd RNase A (10 mg/mL) and DNase I (4 mg/mL) to 20 µg/mL and 5 µg/mL final concentrations and incubate at 37 °C for 30 min to degrade excess nucleic acids.",
    "Add 4.5 mL of 300 mM Tris-HCl (pH 7.5), 2.76 mL of 0.5 M ethylenediamine tetraacetic acid (EDTA), 1.67 mL of 10% sodium dodecylsulfate (SDS), and 75 µL of proteinase K (10 mg/mL) into the tube, and incubate at 65 °C for 10 min.\nAdd 4.5 mL of pre-cooled 3 M potassium acetate, and incubate on ice for 10 min.\nCentrifuge at 8,000 x g for 10 min, and spin the supernatant for an additional 5 min at 10,000 x g.\nAdd 70% volume of isopropanol into the collected supernatant (from step 3.1.21) with sufficient mixing, incubate at RT for 2 min, and then centrifuge at 8,000 x g for 10 min. Discard the isopropanol and spin again for 5 min.\n\t\tNOTE: The DNA pellet will be smeared before the first 10 min centrifugation; the pellet will be concentrated at the bottom of the tube after the second 5 min centrifugation.\nWash the precipitated DNA with 2-3 mL of 70% ethanol and spin down again for 1 min. Dry the pellet at 4 °C for 2 h, and then resuspend the DNA in 500 µL of TE buffer (10 mM Tris-HCl (pH 8.0) and 1 mM EDTA) overnight at RT.\nTransfer the DNA to a 1.5 mL tube and spin it at 18,000 x g for 3 min. Transfer the DNA to a new 1.5 mL tube. Aliquot the purified Lambda DNA and store it at -20 °C.\nBiotin-Lambda DNA preparation\n\t\nMelt 50 µL of purified Lambda DNA with cloned motifs at 65 °C for 10 min.\n\t\tNOTE: As Lambda DNA is ~48 kbp long, it must be heated before pipetting to avoid DNA breaks.",
    "Mix 50 µL of Lambda DNA, 1 µL of Biotin primer (5' - (Phos) - AGG TCG CCG CCC - BIOTEG - 3') (100 µM) and 54 µL of ddH2O together. Co-incubate the mixture at 65 °C for 5 min and leave it on the bench to cool down to RT.\nAdd 12 µL of 10x T4 ligase buffer and 3 µL of T4 ligase, and incubate at RT for several hours or overnight.\nAdd an equal volume of phenol-chloroform (1:1) mixture to the ligation product, mix well immediately, and centrifuge at 12,000 x g for 2 min at RT.\nTransfer the upper aqueous phase containing the DNA carefully to a new tube, add an equal volume of chloroform, mix well, and then centrifuge at 12,000 x g for 2 min.\nTransfer the upper aqueous phase to a new tube, add an equal volume of isopropanol and 10% of the volume of 3 M sodium acetate, and incubate at RT for 2 min. Centrifuge the mixture at 12,000 x g for 5 min.\nRemove the supernatant, wash the pellet with 75% ethanol, and then centrifuge at 12,000 x g for 5 min.\nRemove the 75% ethanol, air-dry the DNA at RT for 10 min, and use 120 µL of TE buffer to dissolve the DNA.\nAdd 60 µL of Buffer A (30% (w/v) PEG8000 and 30 mM MgCl2) to 120 µL of the solution from step 3.2.8, and rotate at 4 °C for 20-24 h.\nCentrifuge the mixture at 18,000 g for 5 min, and remove the supernatant.\nUse 180 µL of pre-cooled 75% ethanol to wash the pellet, and repeat step 3.2.10.\nDry the pellet at RT, and use 100 µL of TE150 buffer to dissolve the DNA.\n4. Nanofabricated zig-zag barriers",
    "Clean slides in acetone for 20 min by sonication and transfer them to a new glass container with 1 M NaOH for sonication for another 20 min. Mix 90 mL of H2SO4 with 30 mL of H2O2, and immerse the slides in this mixture for 30 min. Rinse the slides with acetone and isopropanol and dry the slides with N2.\n\tNOTE: Mixing H2SO4 and H2O2 is an exothermic process; take adequate safety precautions during the operation.\nCoat the cleaned slide with polymethylmethacrylate (PMMA) 25 kDa, PMMA 49.5 kDa, and the top layer of conductive protective coating in succession. Use electron beam lithography to write the zig-zag barriers (Figure 1A).\nWash the slides with ddH2O to remove the conductive protective coating and dry the slides with N2.\nDeposit a 30 nm layer of chromium (Cr) using a magnetron sputtering machine and remove the remaining PMMA layers with acetone.\n\t​NOTE: One flowcell can be reused for more than 20 DNA Curtains experiments. To reuse the flowcell, wash it with ethanol, detergent, and NaOH.\n5. Purification of EWS-FLI1 protein\nNOTE: The observation of 500 nM EWS-FLI1 on Lambda DNA with 25× GGAA motifs serves as a good example for the application of DNA Curtains to condensate formation. EWS-FLI1 is a fusion protein combining the N-terminal of EWSR1 (1-265) and the C-terminal of FLI1 (220-453). An mCherry tag was fused to the N-terminal of the EWS-FLI1 fusion protein for visualization.\nClone the EWS-FLI1 gene into a reconstituted pRSF vector or any other suitable prokaryote expression vector.",
    "Transform the plasmid encoding 7x His-mCherry-EWSFLI1 into the E.coli BL21(DE3) strain; grow a single colony in 5 mL of LB medium at 37 °C overnight. When the OD600 value reaches 0.6-0.8 after transferring to 2 L of LB medium, add 0.5 mM IPTG and shake the cell culture at 18 °C for 16-18 h.\nCentrifuge the culture to remove the supernatant and resuspend the cells with lysis buffer (50 mM Tris-HCl, pH 7.5; 1 M KCl; 1 M urea; 10 mM imidazole; 1.5 mM beta-mercaptoethanol (β-ME); and 5% glycerol).\nAfter sonication and centrifugation at 18000 × g for ~30 min, load the supernatant onto Ni-NTA resin equilibrated in a 5-fold volume of lysis buffer, and then wash the resin with a 10-fold volume of washing buffer (50 mM Tris-HCl (pH 7.5), 1 M KCl, 1 M urea, 40 mM imidazole, 1.5 mM β-ME, and 5% glycerol).\nElute the bound protein with 15 mL of elution buffer (50 mM Tris-HCl (pH 7.5), 1 M KCl, 1 M urea, 500 mM imidazole, 1.5 mM β-ME, and 5% glycerol) and concentrate the elution to ~500 µL.\nLoad the concentrated protein solution onto a gel filtration column and analyze the products by SDS-polyacrylamide gel electrophoresis. Quickly freeze the purified protein in liquid nitrogen and store at -80 °C.\n6. Preparation of a DNA Curtains flowcell\nPrepare a flowcell with zig-zag nanofabricated barriers for a DNA Curtains experiment and determine the direction of flow. To do this, connect the input and output tubes in the correct direction.\nWash the flowcell with 2.5 mL of lipid buffer using two 3 mL syringes. Ensure there is no bubble in the flowcell.",
    "Remove the syringe from the output, and inject 1 mL of the liposome solution (40 µL of liposome stock from section 2 and 960 µL of lipid buffer) three times with 5 min incubation after each injection.\nFor the healing step, wash the flowcell with 2.5 mL of lipid buffer slowly, and incubate at RT for 30 min.\n\tNOTE: The healing time can be longer if necessary; if any bubbles appear, perform double-healing by repeating steps 5.3 and 5.4 to remove the bubbles.\nPrepare 30 mL of bovine serum albumin (BSA) buffer (40 mM Tris-HCl (pH 7.5), 2 mM MgCl2, 1 mM dithiothreitol, and 0.5 mg/mL BSA for surface passivation). After 30 min of healing, wash the flowcell with 2.5 mL of BSA buffer from the output side.\n\tNOTE: The BSA stock is a 20 mg/mL solution stored at 4 °C and must be used within 1-2 weeks. The BSA concentration in the buffer can be adjusted according to the surface condition.\nInject 800 µL of streptavidin buffer (10 µL of a 1 mg/mL streptavidin stock, 790 µL of BSA buffer) into the flowcell from the input side in two steps with 10 min of incubation after each step.\n\tNOTE: The streptavidin anchors the DNA onto the lipids due to its multivalency by bridging between the biotinylated lipids and the biotinylated DNA.\nWash the flowcell with 2.5 mL of BSA buffer to remove all free streptavidin molecules.\nDilute the Biotin-Lambda DNA with cloned motifs from section 3 using BSA buffer (2.5 µL of DNA and 998 µL of BSA buffer). Inject Lambda DNA 4 times slowly at 5 min intervals.",
    "Turn on the microscope and the scientific Complementary Metal Oxide Semiconductor (sCMOS) system during the injection. Wash the tubing with 10 mL of ddH2O. Rinse the prism and the tubing connector with water, 2% liquid cuvette cleaner, and 99% ethanol. Prepare the imaging buffer by adding KCl and double-stranded DNA dye into the BSA buffer to obtain final concentrations of 150 mM and 0.5 nM, respectively, and take up at least 20 mL of the imaging buffer into a 30 mL syringe.\nSet up the flowcell on the microscope stage and connect it to the microfluidic system.\nUse a flow rate of 0.03 mL/min to flush the DNA molecules to the barrier for 10 min, incubate for 30 min with the flow stopped, and then switch it off to let the DNA diffuse laterally.\n\t​NOTE: The purpose of this 30 min incubation is to let the DNA molecule distribute more evenly in front of the barrier through simple diffusion because DNA molecules tend to accumulate on the side of the barrier that is closed to the input where they are flushed in. The incubation time can be adjusted as necessary.\n7. Imaging of EWS-FLI1 condensation formation on DNA Curtains\nOpen the imaging software, find and mark the positions of the 3 × 3 zig-zag patterns under bright-field.\nTurn on the flow at 0.2 mL/min to stain the DNA with the double-stranded DNA dye for 10 min.\nDilute mCherry-EWS-FLI1 with the imaging buffer to the concentration of 100 nM in 100 µL in the tube.\nLoad the protein sample through the valve with a 100 µL glass syringe, and change the flow rate to 0.4 mL/min.",
    "Turn on the 488 nm laser and pre-scan each region to check the DNA distribution state; select the region in which the DNA molecules distribute evenly. Set the laser power to 10% for the 488 nm laser and 20% for the 561 nm laser. Use the power meter to measure the real laser power near the prism: 4.5 mW for the 488 nm laser and 16.0 mW for the 561 nm laser.\nImage acquisition\n\t\nStart acquiring images at 2 s intervals with both 488 nm and 561 nm lasers simultaneously.\nChange the valve from manual mode to injection mode to let the imaging buffer flush the protein sample into the flowcell after 60 s.\n\t\t​NOTE: This process will take ~30 s, and the field-of-view will be covered with mCherry signals as soon as the EWS-FLI1 proteins reach the flowcell.\nTo remove free EWS-FLI1, keep washing the flowcell with the imaging buffer for 5 min with only the 561 nm laser switched on. Stop the flow and incubate at 37 °C for 10 min.\nTurn on the flow at 0.4 mL/min to let the DNA extend, and acquire images at 2 s intervals between different frames to obtain high-throughput data of EWS-FLI1 condensate formation.\n8. Intensity analysis for mCherry-EWS-FLI1\nImport the data as image sequences into ImageJ software, pick out the puncta at 25× GGAA sites in an 8× 8 pixels square, and save the image in .tif format.\nCalculate the intensity as the summation of the intensity in the 8×8 pixels square, including the whole puncta, and remove the background by subtracting the intensity of background in an area of the same size near the 8 x 8 pixels square.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}