{
  "id": 5455,
  "origin_website": "Bio",
  "title": "Purification of <em>N</em>-coronafacoyl Phytotoxins from <em>Streptomyces scabies</em>",
  "procedures": [
    "Culture growthPrepare a seed culture of S. scabies by inoculating 1 ml of the DMSO freezer stock into 25 ml of tryptic soy broth medium in a 125 ml Erlenmeyer flask, and incubate at 28 °C with shaking (200 RPM) for 48 h. Subculture 10 ml of the seed culture into 1 L of SFMB medium in a 4 L Erlenmeyer flask, and incubate at 25 °C with shaking (200 RPM) for 10 days (see Notes 1 and 2).Divide the culture into four 250 ml centrifuge bottles and centrifuge at 3,005 x g for 15 min at 4 °C to pellet the cell material. Decant the supernatant into a 2 L plastic container and store at -20 °C until needed. Even if the supernatant is going to be extracted immediately, it is useful to freeze it for a minimum of 24 h (see Note 3).Organic extraction (see Figure 2 and Note 4)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170329/20170329182404_2813.jpgFigure 2. Schematic outline of principle steps performed during the extraction of coronafacoyl phytotoxins from S. scabies culture supernatantsMeasure the pH of the culture supernatant using a pH strip, and adjust the pH to 11-12 using a 5 N solution of NaOH (~4-5 ml).Decant the supernatant into a 2 L separatory funnel and extract with 0.5 volumes (~450 ml) of chloroform. To perform the extraction, add the chloroform to the separatory funnel, close the funnel stopper, and shake the funnel to mix the contents well. Open the stopcock to release any expressed gas, then repeat the shaking until no more gas is expressed. Allow the organic (bottom) and aqueous (top) layers to separate as much as possible by gravity (~15-20 min; Figure 3A), then open the stopcock and collect the organic layer.",
    "If an emulsion layer is present, this can be collected and separated by centrifugation at 3,005 x g for 10 min at 4 °C, and the aqueous layer returned to the separatory funnel (Figure 3B). Discard the organic layer, and repeat the extraction of the aqueous supernatant with another 0.5 volumes of fresh chloroform. Perform the extraction a total of three times, discarding the organic layer after each extraction (see Note 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170329/20170329182525_9012.jpgFigure 3. Extraction of S. scabies culture supernatants with chloroform. A. The extraction is performed using a 2 L separatory funnel. After mixing the supernatant and chloroform, the phases are allowed to separate as much as possible by gravity. The upper dark brown layer is the aqueous phase, and the lower layer is the organic phase. B. When an emulsion layer is present, it is collected into centrifuge bottles and the phases are separated by centrifugation.   Acidify the aqueous supernatant to a pH of 1-2 by adding 1 N HCl(aq) (~5 ml).Decant the supernatant back into the 2 L separatory funnel and extract with 0.5 volumes (~450 ml) of chloroform. Use the same extraction procedure as described under 2 except that now the organic layer should be collected and saved. Perform the extraction a total of three times, after which the collected organic layers can be pooled and the aqueous layer discarded (see Note 6).Remove any residual water from the organic extract by adding ~30 g of anhydrous Na2SO4 and gently swirling the mixture. The anhydrous Na2SO4 is added until it no longer forms clumps, indicating that all of the residual water has been absorbed. Filter the organic extract using a 0.45 μm polypropylene membrane filter and a glass filter assembly attached to a vacuum pump.",
    "Wash the beaker that contained organic extract as well as the filter assembly with fresh chloroform to recover all of the residual extract.Concentrate the organic extract to ~100 ml using a rotary evaporator. The evaporator heating bath (filled with water) should be set to 50 °C, and the condenser should be chilled with a circulating solution of 50% v/v ethylene glycol (chilled to -10 °C using a refrigerated circulating bath).  Transfer 50 ml of the organic concentrate into each of two 125 ml separatory funnels. Extract each concentrate with 0.5 volumes (25 ml) of a 0.5 M aqueous solution of KHCO3. After mixing, allow ~5 min for the phases to separate by gravity, then collect each phase separately. Repeat the extraction of the organic concentrates two more times, then pool the collected aqueous phases (to give two sets of aqueous extracts, ~75 ml each) and discard the organic extracts (see Note 7).Wash the aqueous extracts twice with 0.5 volumes (35-40 ml) of chloroform. To wash, add the chloroform to a separatory funnel containing the aqueous extract, mix, then leave for 5 min to allow the phases to separate. Collect and discard the organic layer, and repeat. After washing, combine the aqueous extracts together (total volume ~140-150 ml).Adjust the pH of the aqueous extract to 1-2 using 1 N HCl(aq) (~12-15 ml). The acid will cause a neutralization reaction with the KHCO3 that will produce heat and a large amount of CO2. The acid must be added slowly or the reaction can become violent and will cause the acid to splash. After each 1 ml of acid has been added, gently mix the solution until the CO2 dissipates.Pour ~40 ml of the aqueous extract into each of four 125 ml separatory funnels. Extract each aliquot three times with 0.",
    "5 volumes (20 ml) of chloroform. Collect and combine all of the organic extracts together, and discard the aqueous layers. Evaporate the organic extract to dryness overnight in an uncovered beaker in a chemical safety hood (see Note 8).Preparative TLC (see Note 4)Re-dissolve the dried organic extract in 2-3 ml of MeOH containing 0.1% v/v formic acid by pipetting up and down. Transfer the extract to a clean screw-capped glass vial. Rinse the beaker with an additional 1 ml of MeOH + 0.1% formic acid to recover residual amounts of the extract. Filter the extract into a new screw-capped vial using a 1 ml syringe and a 0.2 μm PTFE membrane filter. Pour the TLC mobile phase (see Recipes) into a TLC developing tank and fill to a depth of ~2 cm. Saturate the air in the TLC chamber by placing two pieces of 12.5 cm filter paper into the tank and covering the tank for at least 30 min. Mark a 5 x 20 cm analytical TLC plate with a pencil to indicate the submersion point of the mobile phase solution (see Note 9).Apply at least ~30-50 μg of a standard of the molecule of interest (or of a comparative analogue; see Note 10) dissolved in 100% MeOH + 0.1% formic acid onto the TLC plate. Apply the standard at least 1 cm from the edge of the plate and at least 1 cm above the submersion mark on the plate.Apply ~30-50 μl of the organic extract along ~2 cm of the plate width. Ensure that the applied extract is at least 1 cm from the edge of the plate, 1 cm above the submersion mark on the plate and 1 cm away from the previously applied standard (see Note 11).",
    "Remove the filter paper discs from the TLC tank and place the TLC plate into the tank and cover. Allow the mobile phase to migrate to within 1 cm of the top of the plate (~20-40 min). Remove the TLC plate and allow to air dry (~15 min). Repeat the process.Place the air dried TLC plate under a UV lamp and use a pencil to mark the positions of the applied standard and the N-coronafacoyl phytotoxin of interest in the organic extract (Figure 4). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170329/20170329183650_6476.jpgFigure 4. TLC analysis of the S. scabies organic extract containing CFA-L-Ile. A pure sample (50 µg) of CFA-L-Ile (i) and a small portion (30-50 µl) of the organic extract (ii) containing CFA-L-Ile is spotted onto a 5 x 20 cm silica gel GF analytical TLC plate. Following separation, the plate is visualized under UV light, and the position of the pure standard is marked (blue circle) along with the expected position of the phytotoxin within the extract (blue rectangle). The black arrow indicates the direction of migration of the samples on the plate.Mark the preparative TLC plate with a pencil to indicate the area of the plate that will be submersed in the mobile phase solution.Apply the organic extract along the entire width of the TLC plate, 10 μl at a time. Do not place any sample within 1 cm of either edge of the plate or within 1 cm of the marked submersed area (see Note 11).Remove the filter paper discs from the TLC tank and place the TLC plate into the tank and cover. Allow the mobile phase to migrate to within 1 cm of the top of the plate (~1-1.5 h). Remove the plate from the tank and allow to air dry (~20-30 min).",
    "Return the plate to the tank and repeat the separation.Place the air dried TLC plate under a UV lamp and use a pencil to mark the region of the plate where the N-coronafacoyl phytotoxin migrated to (Figure 5; see Note 12).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170329/20170329183828_8640.jpgFigure 5. Preparative TLC analysis of the S. scabies organic extract containing CFA-L-Ile. The CFA-L-Ile will be found within the dark smear as indicated by the analytical TLC reference plate (see Figure 4). To ensure complete recovery of the CFA-L-Ile, a large area (indicated by the blue rectangle) of the silica is scraped from the plate. The white arrow indicates the direction of migration of metabolites on the plate.Scrape the marked region using the flat edge of a metal spatula to remove the silica gel - bound metabolites. Transfer the silica gel to a Falcon conical tube and add 10 ml of MeOH + 0.1% v/v formic acid. Vortex the mixture, and then incubate at room temperature for 1 h, vortexing for 1 min every 10 min.Centrifuge the mixture at 3,803 x g for 5 min at room temperature to pellet the silica gel. Transfer the MeOH extract to a clean Falcon tube. Repeat the centrifugation of the silica gel mixture to recover as much of the MeOH extract as possible.Filter the MeOH extract using a 1 ml syringe and a 0.2 μm PTFE membrane filter. Concentrate the extract to a final volume of 1-1.5 ml using a dry heating block set to 60 °C (see Note 13). Semi-preparative RP - HPLCBegin running the HPLC mobile phase (30% ACN:70% H2O, with 0.1% formic acid) through the C18 semi-preparative HPLC column (held at a constant temperature of 50 °C) at a constant flow rate of 4 ml/min until the column is equilibrated.",
    "Load 50 μl of the sample onto the column, and use the following mobile phase running conditions for sample separation: hold at 30% ACN:70% H2O for 7.5 min, then increase linearly to 50% ACN:50% H2O over a period of 12.5 min. Hold at 50% ACN:50% H2O for 5 min, then return to initial conditions using a linear gradient over 7.5 min. Hold at the initial conditions for at least 12 min before beginning the next injection (see Note 14).Monitor the separated metabolites using a detection wavelength of 230 nm, and collect fractions of the peak that corresponds to the desired N-coronafacoyl phytotoxin (see Note 15).Repeat the sample injection, metabolite separation and fraction collection until all of the initial extract has been used.Pool the collected fractions for the N-coronafacoyl phytotoxin of interest, and evaporate to dryness using a rotary evaporator. The evaporator heating bath (filled with water) should be set to 70 °C, and the condenser should be chilled with a circulating solution of 50% v/v ethylene glycol (chilled to -10 °C using a refrigerated circulating bath). Re-dissolve the pure metabolite in 3 ml of MeOH + 0.1% v/v formic acid. Transfer the solution to a pre-weighed screw cap vial, and dry down in a heating block set to 60 °C. Weigh the vial + dried sample, and calculate the weight of the purified sample. Store the dried sample at -20 °C until needed (see Notes 16 and 17)."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}