{
  "id": 6922,
  "origin_website": "Bio",
  "title": "The ATPase Activity of <em>Escherichia coli</em> Expressed AAA<sup>+</sup>-ATPase Protein",
  "procedures": [
    "Estimation of protein concentration by Bradford assay (Bradford, 1976)Prepare a 100 µg/ml stock solution of BSA in water from BSA 50 mg/ml.Use a 96-well microtiter plate to prepare the reaction mix. Make triplicates for all reactions.Prepare 2.5, 5, 10, 20, and 50 µg of BSA standard in corresponding well as described in Table 1 below:Table 1. Protein estimation reaction mix compositionimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200731/20200731025715_4555.pngPrepare a blank by adding 160 µl of water in a blank microtiter plate well.Prepare test samples in a microtiter plate well by making several dilutions of purified recombinant ATPase protein/enzyme with water to make a total of 160 µl volume.Add 40 µl of Bradford reagent to each microtiter plate well, mix and incubate for 5 min at room temperature.Read absorbance (ABS) at 595 nm on a microtiter plate reader.If the spectrophotometer does not have software to plot the standard curve, then plot the standard curve in Excel by plotting known BSA concentrations on X-axis and ABS595 on Y-axis. Obtain trendline and use the equation for the trendline and the ABS595 of the unknown to resolve the unknown concentration. The representative data are shown in Figure 2.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200731/20200731025744_9342.jpgFigure 2. BSA standard curveATPase assayReagent preparationPrepare stock solutions supplied with the EnzCheck Phosphate Assay Kit to perform the assay.Prepare a 1 mM stock solution of the MESG substrate by adding 20 ml of dH2O directly to the bottle (Component A). Mix extensively to dissolve MESG completely (maybe ~10 min).Note: Do not heat to dissolve. Because MESG is near its saturation point, a small amount of solid may remain, even after extensive mixing. Immediately after dissolving the MESG substrate, aliquot the solution into convenient volumes and place immediately at -20 °C.",
    "Thaw an aliquot of MESG substrate before use by placing it in a 37 °C water bath until just melted (not more than 5 min). Vortex vigorously and immediately chill the solution by placing it on ice.Note: The solution is stable for at least 4 h on ice at pH 7.5. If left at room temperature, the half-life of MESG is about 4 h at pH 8.0 and 40 h at pH 6.0. Do not refreeze leftover MESG substrate. Prepare enzyme purine nucleoside phosphorylase (Component B) stock by adding 500 µl of dH2O to a vial to prepare a 100 U/ml stock solution and store at 4 °C.Prepare recombinant ATPase protein (test protein) stock.Note: Use different concentrations of test protein to analyze ATPase activity. Prepare 1 mM ATP stock. Make 10 mM ATP stock by adding 0.05 g of ATP (disodium salt) in 10 ml of 25 mM Tris-Cl (pH 8.0) buffer (250 µl of 1 M Tris-Cl pH 8.0 in 9.75 ml sterilized water). Dilute to 1 mM ATP stock by adding 1 ml of 10 mM ATP in 9 ml of 25 mM Tris-Cl (pH 8.0).Dilute a portion of the 50 mM potassium phosphate monobasic (KH2PO4), a phosphate standard, 100-fold with dH2O to generate a 500 µM solution. Further, dilute a portion of 500 µM solution to make 1 µM KH2PO4, working solution.Phosphate Standard curvePrepare 10, 20, 30, 40, and 50 nmol of inorganic phosphate standard with 1 µM KH2PO4 in corresponding well to the final volume of 300 µl reaction mix as per Table 2 below:Table 2. Phosphate standard curve reaction mix compositionimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200731/20200731025814_6082.pngUse a 96-well microtiter plate to perform the assay.Start the reaction by the addition of final component purine nucleoside phosphorylase and incubate for 30 min at 22 °C.Read the absorbance at 360 nm.",
    "Correct the absorbance by subtracting blank from each standard.Plot Phosphate standard curve in Excel by plotting known inorganic phosphate concertation on X-axis and ABS360 on Y-axis and obtain trendline and equation. The representative data is shown in Figure 3.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200731/20200731025833_5982.jpgFigure 3. Phosphate standard curveATPase reaction Use a 96-well microtiter plate to perform the assay. If the plate reader is not available, use 1 ml of assay mix to perform the assay in cuvettes.Make triplicate for all reactions.Prepare assay mix by mixing the stock solution to make 300 µl assay mix for plate reader in 96-well plates and 1 ml assay mix to use in the cuvette as described in Table 3 below:Table 3. ATPase assay reaction mix compositionimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200731/20200731025859_2003.pngPrepare blank in a microtiter plate well by adding water instead of recombinant ATPase test protein.Prepare the sample volume of recombinant ATPase test protein ranging from 0.5 to 2 µg of protein in water to the total volume to 100 µl.Prepare test samples well by adding 100 µl of recombinant ATPase test protein prepared above.Prepare positive control microtiter plate well by adding 0.5 units of ATPase (Sigma) instead of recombinant ATPase test protein.Incubate the reaction at 22 °C for 10 min in the plate reader.Start the reaction by adding 25 µl of ATP (1 mM) as a substrate in each microtiter plate well and mix in the plate reader. If using 1 ml cuvette the amount of ATP needs to be increased accordingly (83 µl).Read absorbance in a microtiter plate reader at 360 nm at 0 min and then 10 min intervals for one hour or until saturation point has reached at 22 °C. Incubate the plate in the microtiter plate reader."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}