{
  "id": 8734,
  "origin_website": "Jove",
  "title": "Investigating Mammalian Axon Regeneration: In Vivo Electroporation of Adult Mouse Dorsal Root Ganglion",
  "procedures": [
    "All animal experiments were performed in accordance with the animal protocol approved by the Johns Hopkins Institutional Animal Care and Use Committee.\n1. Materials and Reagents\nAnimals\nUse six-week-old female CF1 mice weighing 30–35 g for the experiments.\n\t\tNOTE: The mice were group-housed (5 mice per cage) in individually ventilated sterilized cages with 1/4” corn cob bedding and 2” square nestlets for nesting. The cages were maintained in a controlled 12-h light-dark cycle and the room temperature was between 19.4 °C and 25 °C. The mice were fed with global rodent diet and automatic water supplying system. \nInstruments\nUse the following surgical instruments to efficiently conduct the surgery: disposable syringes (27 G, 1.0 mL) for intraperitoneal injection, fur clipper, stereo dissection microscope, micro-surgery forceps, micro-surgery scissors, and small bone rongeurs and sterilized non-woven sponges.\n\t\tNOTE: All the instruments and materials are autoclaved before surgery or pre-sterilized by the producers. During surgery, the instruments are sprayed with 75% alcohol to maintain the sterilization.\nAnesthetic Solutions\nUse anesthetic solution #1 to induce the anesthesia and use anesthesia solution #2 before DRG injection to maintain the anesthesia.\n\t\t\nTo make anesthetic solution #1, dilute ketamine and xylazine in sterile saline at a final concentration of 10 mg/mL and 1.2 mg/mL.\nTo make anesthetic solution #2, dilute avertin in sterile saline at a final concentration of 20 mg/mL.\nDNA Plasmid and RNA Oligos\nPrepare the plasmids using the commercial kit following the manufacturer's protocols accordingly. Dilute the plasmid DNAs in sterile deionized water to the concentration of 2.0 µg/µL.\nAdd Fast Green dye solution to reach a final concentration of 0.005–0.01% (v/v) for better visualization of the DRG outline during injection.\nDissolve the siRNA or microRNA oligos in corresponding buffers provided by manufacturers to reach a final concentration at 50 µM.\nMicro-Injection Pipette",
    "Pull the capillary glass using the micropipette puller and cut the tip of the pulled capillary glass pipette with microsurgery scissors to generate an opening with an approximate 50 µm outer diameter. Then sterilize the glass pipette under UV light on a clean bench for 20–30 min approximately.\nMount the sterilized glass pipette on the pipette holder connected to an intracellular microinjection dispense system. Set the parameters of the microinjection system at 30 psi of pressure and 8 ms of duration.\nElectroporation System\nConnect the electrodes to the square wave electroporation system and set the following parameters: 15 ms pulses at 35 V with 950 ms intervals for in vivo electroporation.\nPerfusion and Fixing Solution\nDissolve the paraformaldehyde (PFA) powder in 1x PBS at a concentration of 4% (w/v). Store the PFA solution at 4 °C.\n2. Experimental Procedures\nSurgical Exposure of the L4 and L5 DRGs\nAnesthetize the mouse using an intraperitoneal injection of the anesthetic solution #1 prepared previously (with ketamine 100 mg/kg body weight and xylazine 12 mg/kg body weight).\nShave the surgical area with the fur clipper.\n\t\tNOTE: Since there will be another surgery for left sciatic nerve crush, the fur of the left posterior thigh can be shaved simultaneously.\nPlace the mouse on the heated blanket (35.0 °C) and monitor the rectal temperature with a temperature probe.\nTo test the anesthesia, pinch the toes and tail of the mouse and observe the behavioral responses.\nTape the four limbs of the mouse on the corkboard.\nWipe the surgical area with iodophor solution and then with 75% alcohol to remove the iodophor before cutting the skin.\nApply ophthalmic ointment on eyes to prevent dryness while under anesthesia.",
    "Before incision, mark both sides of the iliac crests with a fine marker pen. Draw a line connecting two points of iliac crests to facilitate identifying the positions of L5 DRGs.\nMake a 3 cm incision along the midline of low back with micro-scissors. Moreover, detach the paraspinous muscles, such as the musculus multiﬁdus and the musculus longissimus lumborum, from the L3 to S1 spinous processes, and expose the facet joints of L4-5 and L5-6.\nUse a micro-rongeur to remove the facet joints of L4-5 and L5-6. Moreover, remove the left neural arch of L4 and L5 to expose the dorsal side of the DRGs.\nDRG Injection\nInject anesthetic solution #2 (with avertin 200 mg/kg body weight)  intraperitoneally to maintain the anesthesia before DRG injection.\nLoad the DNA plasmids or RNA oligos (1 µL per DRG) into the glass capillary pipette.\nInsert the tip of the capillary glass pipette carefully into the DRG.\nGradually inject 1.0 µL solution of DNA plasmids or RNA oligos into the DRG using the intracellular microinjection dispense systems (30 psi, 8 ms).\n\t\tNOTE: The duration of the injection should last no less than 5 minutes.\nElectroporation\nDrop PBS on tips of the electrodes.\nClean up the bleeding with sterilized square cotton gauze.\nPinch the target DRG with the electrodes gently and apply 5 square electric pulses with the electroporation system.\nClose the muscle and skin layers respectively with 5-0 nylon sutures.\nPlace the mouse on a heated blanket (35.0 °C) under close attention until it has completely regained sufficient consciousness to maintain sternal recumbency. Return the mouse to the home cage after it has fully recovered from the anesthesia.",
    "NOTE: It takes approximately 60 min for the mouse to completely recover from anesthesia on the 37 °C blanket. Dissolve one pill (200 mg) ibuprofen into 1,000 ml water (0.2 mg/ml) for daily feeding to relieve the post-surgical pain.\nSciatic Nerve Crush\nTwo or three days (depending on the experimental design) after the DRG electroporation, anesthetize the mouse intraperitoneally with anesthetic solution #2 (with avertin 400 mg/kg body weight).\nTape the four limbs of the mouse on the corkboard.\nMake a 1 cm incision 0.5 cm to the left side along the midline. Cut the muscles, such as gluteus maximus muscle and piriformis muscle, longitudinally. Expose the segment of the sciatic nerve between the greater sciatic foramen and the sciatic notch.\nCrush the nerve with microsurgery forceps for 12 s and mark the crush site with a 10-0 nylon epineural suture. Make a knot on the dural membrane to mark the crush site.\nClose the muscle and skin layers with 5-0 nylon suture.\nPlace the mouse on a heated blanket (35.0 °C) with close attention until it has completely regained sufficient consciousness to maintain sternal recumbency. Return the mouse to the home cage after it has fully recovered from the anesthesia.\n\t\tNOTE: It takes approximately 60 min for the mouse to completely recover from anesthesia on the 37 °C blanket. Dissolve one pill (200 mg) ibuprofen into 1,000 ml water (0.2 mg/ml) for daily feeding to relieve the post-surgical pain.\nMouse Perfusion, DRG and Sciatic Nerve Harvest\nTwo or three days after the sciatic nerve crush (depending on the experimental design), anesthetize the mouse intraperitoneally with anesthetic solution #2.\nPerfuse the mouse transcardially with PBS (pH 7.4) followed by ice-cold 4% paraformaldehyde (PFA) (pH 7.5) in PBS.",
    "After perfusion, separate the DRGs together with the nerve roots and sciatic nerve before the knee carefully with micro-scissors and micro-forceps under the dissection microscope. Place the sciatic nerve directly in 4% PFA overnight at 4 °C.\nImaging and Measuring the Fluorescence-Labeled Sensory Axons\nStrip off the attached tissue and membrane on the fixed sciatic nerve with micro-scissors and micro-forceps carefully under the dissection microscope. Then, exchange the 4% PFA with PBS and wash the nerve three times.\nPlace the sciatic nerve on a slide and keep it straight. Add 80 µL of antifade solution around the nerve, then lay a coverslip on it. Flatten the whole mounted tissue with pressure.\nPlace the ﬂattened tissues on the inverted epiﬂuorescent microscope equipped with an accessory for mosaic acquisition and image processing.\n\t\tNOTE: The excitation and emission lengths are 488 nm and 509 nm. It is also possible to take multiple overlapping images manually and stitch the images together using ImageJ with the Mosaic plug-in.\nWhen measuring the length of regenerated axons, trace all identiﬁable ﬂuorescently-labeled axons in the sciatic nerve from the crush site (marked with the 10-0 epineural suture) to the distal axon ends.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}