{
  "id": 2855,
  "origin_website": "Cell",
  "title": "Capture-seq protocol and TE-reX pipeline guidelines for detection of recombination of repeat elements in short- and long-DNA reads libraries",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nGeneration of biotinylated RNA probes\nTiming: 2.5 days\nThis step contains the instructions to generate by PCR and in vitro transcription the double-stranded PCR template and the biotinylated RNA probes used to enrich for repeat element sequences from genomic DNA samples.\nNote: Due to the high repetitiveness of the PCR templates, to minimize the risk of PCR artifacts each ssDNA oligonucleotide is amplified individually.\nDilute the ssDNA oligos in ddH2O to 50 ng/μL in individual wells of two 96-wells plates (96 oligonucleotides for L1HS, 80 oligonucleotides for Alu)\nPrepare the following master mix for the first PCR (a 180x mix is sufficient for both plates):\ntable:files/protocols_protocol_2359_5.csv\nAliquot 24 μL of mix in individual wells of two new 96-well PCR plates, following the same plates design used for the ssDNA oligonucleotides dilution plates in point 1.\nTransfer 1 μL (50ng) of ssDNA oligonucleotide from each well of the dilution plates to corresponding wells of the PCR plates, place the plates to a thermocycler and run the first PCR using the following program. We recommend using the indicated number of cycles in order to avoid the formation of PCR artifacts.\ntable:files/protocols_protocol_2359_6.csv\nPrepare the master mix for the second PCR:\ntable:files/protocols_protocol_2359_7.csv\nAliquot 24 μL of mix in two new 96-well PCR keeping the same plate design as the first PCR and transfer 1 μL from each well of the two plates of the first PCR in the new plates. Run the second PCR with the following program:\ntable:files/protocols_protocol_2359_8.csv\nPool 2 μL from each well of the second PCR plate in a 1.5 mL Eppendorf tube and mix well.\nNote: The dsDNA PCR samples can be stored at −80°C indefinitely.",
    "Run 100 μL of pooled dsDNA on a 1% preparative agarose gel in 1x TAE buffer at 10V/cm, cut the expected 122 bp band with a clean, sterile blade and purify the dsDNA using the QIAquick Gel Extraction kit:\nWeigh the gel band and add 3 volumes of buffer QG to 1 volume of gel.\nIncubate at 50°C for approximately 10 min or until the gel band has completely dissolved. Vortex every 2–3 min to help the gel dissolving in the buffer.\nAdd 1 gel volume of isopropanol to the sample and mix thoroughly by vortexing.\nTransfer the sample in a QIAquick column inserted in a collection tube.\nCentrifuge for 1 min in a tabletop centrifuge at maximum speed and discard the flow-through. If the initial volume of the sample exceeds 800 μL (maximum capacity of the column), repeat this step as required.\nAdd 500 μL of buffer QG to each sample, centrifuge at 21,000 × g for 1 min and discard the flow-through.\nAdd 750 μL of PE buffer, let the samples sit for 5 min, centrifuge at 21,000 × g for 1 min and discard the flow-through.\nCentrifuge the tubes for 1 additional min at 21,000 × g and transfer the columns in clean 1.5 mL Eppendorf tubes.\nElute the dsDNA by applying 55 μL of ddH2O directly on the center of the membrane in the column, let the tube sit for 5 min and centrifuge at 21,000 × g for 1 min.\nRepeat the previous step once more for a total of 2 elutions and a final total volume of ∼100 μL.\nMeasure the concentration of the purified by Nanodrop or Qubit.\nNote: the purified dsDNA oligonucleotides pool can be stored at −80°C indefinitely.",
    "Prepare the following mix to perform the in vitro transcription of the biotinylated RNA probes using the MEGAscript T7 Transcription Kit:\ntable:files/protocols_protocol_2359_9.csv\nMix thoroughly and incubate for 4 h–16 h at 37°C.\nAdd 1 μL of TURBO DNase, mix well and incubate 15 min at 37°C.\nCritical: Omitting this step will result in critically reduced enrichment of the target genomic regions due to interference by the dsDNA oligos.\nPerform RNA precipitation:\nAdd 10 μL of NaAc 3M and 300 μL of ethanol 100%. Mix thoroughly and incubate 16 h or for 16 h at −20°C.\nMicrocentrifuge at 21,000 × g for 30 min at 4°C.\nCarefully remove the supernatant and wash the RNA pellet with cold 80% ethanol freshly prepared using RNAse-free ddH2O.\nMicrocentrifuge at 21,000 × g for 10 min at 4°C and completely remove traces of ethanol from the tubes.\nAir dry the RNA pellet for 5 min, add 150 μL of RNAse-free ddH2O and gently pipet up and down until the pellet is completely resuspended.\nPerform QC of the purified RNA probes on a Bioanalyzer using the RNA 6000 nano kit. Aliquot the RNA probes in 0.2 mL tubes and store at −80°C.\nNote: the RNA probes can be stored at −80°C indefinitely.\nFragmentation, adapters ligation, size selection and PCR enrichment of DNA samples\nTiming: 4 h\nThis step provides instructions to prepare the genomic DNA samples for the enrichment and capture of repeat element sequences using the biotinylated RNA probes.",
    "Note: we recommend using genomic DNA samples that have been purified using the same method, in order to avoid inconsistencies in DNA integrity especially among large batches of samples. The integrity of each sample should be confirmed by agarose gel. Purified genomic DNA should be resuspended in 1X TE (10 mM Tris pH 8.0, 1 mM EDTA) and should have a A260/A280 absorbance ratio of 1.7–1.9. If some samples show signs of partial degradation, the enzymatic fragmentation of these samples should be calibrated separately since performing the capture on samples with different fragments distribution may lead to variable sequencing result.\nNote: the protocol in this section has been adapted from the NEBNext Ultra II FS DNA Library Prep Kit manual. Please refer to the original manual for more details.\nNote: the following protocol is for genomic DNA input ≥ 100 ng. For inputs ≤ 100 ng, please refer to the NEBNext Ultra II FS DNA Library Prep Kit manual.\nPrepare the following mix in 0.2 mL PCR tubes kept on ice:\ntable:files/protocols_protocol_2359_10.csv\nMix well by vortexing and briefly spin the sample to collect all material at the bottom of the tubes.\nTransfer the tubes in a thermocycler and run the following program:\ntable:files/protocols_protocol_2359_11.csv\nNote: Samples can be stored at −20°C after the incubation but this may result in a reduced yield.\nAdd the following reagents directly to the tubes containing the digested genomic DNA:\nNote: The Ligation Master Mix requires mixing by pipetting up and down a few times before being added to the other components.\ntable:files/protocols_protocol_2359_12.csv\nMix thoroughly the reaction by pipetting up and down a few times with a P200 pipette set at 50 μL, spin briefly and incubate at 20°C for 15 min in a thermocycler with the lid heater set to off.",
    "Add 3 μL of USER enzyme and incubate at 37°C for 15 min with the lid heater set to 47°C.\nPerform a 150–250bp fragments size selection with AMPure XP beads:\nNote: ensure AMpure XP beads have been kept at 20°C–25°C for at least 30 min before usage.\nTransfer the reaction from step 18 to a new 1.5 mL Eppendorf tube and add 28.5 μL of 0.1X TE to bring the reaction volume to 100 μL. Mix well by vortexing briefly.\nVortex the beads to resuspend any clump and add 40 μL of resuspended beads to each sample.\nVortex 10 s or pipette up and down 10 times to mix well.\nIncubate at 20°C–25°C for 5 min.\nBriefly spin the samples and place them on a magnetic stand for 5 min.\nCritical: be careful not to discard the supernatant.\nTransfer the supernatant (∼140 μL) to a new 1.5 mL tube and add 20 μL of resuspended beads.\nVortex 5 s at high speed or pipette up and down 10 times to mix well.\nIncubate at 20°C–25°C for 5 min.\nDiscard the supernatant and wash with 250 μL of freshly prepared 80% ethanol, let sit for 30 s.\nDiscard the ethanol without disturbing the beads and perform a second ethanol wash.\nDiscard the second ethanol wash without disturbing the beads, briefly spin the tubes, place them back on the magnetic stand and carefully remove any residual ethanol from the tubes.\nAir-dry the beads for 5 min by leaving the tubes at 20°C–25°C with the lid open.\nCritical: avoid over-drying the beads as this will result in a lower yield.",
    "Remove the tubes from the magnetic stand and elute the fragments from the beads by adding 17 μL of 0.1X TE. Resuspend the beads thoroughly by pipetting up and down 10 times of vortexing, briefly spin the samples and let sit for 2 min at 20°C–25°C.\nPlace back the tubes on the magnetic stand and after 5 min transfer 15 μL of supernatant to a clean 0.2 mL PCR tube.\nPrepare the mix for the PCR enrichment by mixing the following components:\ntable:files/protocols_protocol_2359_13.csv\nNote: The choice of primers will depend on the designated sequencing platform. Please refer to the NEBNext Ultra II FS DNA Library Prep Kit manual for details.\nCritical: Take careful note of the primer pairs used to amplify each sample as the post-capture PCR will require the same primers pair used in the pre-capture enrichment PCR.\nSet the following program in a thermocycler and perform the PCR enrichment:\ntable:files/protocols_protocol_2359_14.csv\nNote: A minimum of 3 PCR cycles is required by the kit protocol. We don’t recommend using more than 4 cycles to minimize PCR artefacts.\nPerform purification of the PCR samples by AMPure XP beads:\nBriefly spin the PCR tubes and transfer all 50 μL in new 1.5 mL Eppendorf tubes.\nAdd 45 μL (0.9X) of resuspended AMPure XP equilibrated at 20°C–25°C for at least 30 min.\nVortex for 10 s or pipette up and down 10 times and let stand at 20°C–25°C for 5 min.\nPlace the tubes on a magnetic stand, wait for 5 min.\nAdd 300 μL of freshly prepared 80% ethanol, let stand for 30 s.\nRemove the ethanol and perform a second wash. Let stand for 30 s.\nDiscard the second ethanol wash, briefly spin the tubes, place them back on the magnetic stand and thoroughly remove any trace of ethanol.",
    "Air-dry the beads for 5 min by leaving the tubes at 20°C–25°C with the lid open.\nCritical: avoid over-drying the beads as this will result in a lower yield\nElute the enriched pre-capture DNA by adding 33 μL of 0.1X TE to each tube and resuspend by pipetting up and down at least 10 times or by vortexing.\nLet the samples sit for 2 min, place them on the magnetic stand and wait for 5 min.\nTransfer the eluted DNA in new and properly labeled 0.5 mL Eppendorf tubes.\nNote: pre-capture DNA samples can be stored at −80°C indefinitely.\nCheck and confirm the profile of the pre-capture DNA samples on a Bioanalyzer using a High Sensitivity DNA kit.\nAlternatives: If other library construction kits that do not employ enzymatic fragmentation are used, in case a Covaris S2 is available in the lab we suggest the following shearing protocol using the Covaris microtube AFA Fiber Pre-Slit Snap-Cap tubes:\nDilute 1–5μg intact genomic DNA in 130μL H20 or TE and load in Covaris SnapCap tube (avoid introducing air bubbles in the tube).\nShear the DNA using a program to produce a 200bp fragments distribution (Duty cycle 10% - Intensity 5% - Cycler 200, 60 s × 3 times).\nAfter shearing, perform a standard cleanup the DNA with AMPure XP (1.8x ratio). Elute the DNA in 40μL of ddH2O.\nGeneration of capture libraries\nTiming: 1 day (for steps 24 to 51)\nThis step describes the procedure to enrich and capture repeat element sequences from the pre = processed genomic DNA samples.\nAliquot 50 μL of M-280 beads for each pre-capture sample in 1.5 mL tubes and wash the beads:\nPlace the beads on a magnetic stand and when the separation is complete, remove the storage buffer.",
    "Add 165 μL of B&W buffer for each initial 50 μL beads aliquot, vortex for 20 s, spin briefly the tubes in a tabletop microcentrifuge and place the tubes on a magnetic stand. Repeat for a total of 2 washes.\nAfter the second wash, remove the B&W buffer and add a fresh 165 μL aliquot of B&W buffer for each initial 50 μL beads aliquot, vortex briefly to resuspend the beads. Keep the beads at 20°C–25°C until usage.\nPrepare the pre-capture samples for the enrichment in 0.2 mL PCR tubes or plates by mixing in each tube:\ntable:files/protocols_protocol_2359_15.csv\nKeep on ice until use.\nPrepare the following RNA probes mix for each pre-capture sample and aliquot in 0.2 mL tubes:\ntable:files/protocols_protocol_2359_16.csv\nKeep on ice until use.\nSet the following program on a thermocycler and set the lid at 75°C:\ntable:files/protocols_protocol_2359_17.csv\nSet an additional block of the thermocycler at 72°C with the lid at 75°C.\nPlace the DNA samples in the thermocycler and start the program.\nWhen the 65°C (1) stage is completed, place the RNA probes in the block at 72°C.\nWhen the 65°C (2) stage is completed, pause the program for the block with the pre-capture samples, remove the lids from the DNA and RNA tubes and quickly transfer 7 μL of RNA probes to each pre-capture sample.\nUsing a P20 micropipette, add 13 μL of hybridization buffer warmed up to 65°C to each tube containing the pre-capture DNA and the RNA probes and gently but quickly mix by pipetting up and down 10 times.\nPut back the lids on the tubes and restart the thermocycler program.\nWhen the 65°C (3) stage is completed, take out the tubes from the thermocycler, spin them briefly in a tabletop centrifuge and place them on ice.",
    "Transfer the DNA + RNA samples to the 1.5 mL tubes containing each one aliquot of resuspended M-280 beads (165 μL), mix by pipetting up and down and place the tubes for 30 min on a rotating wheel set at a speed sufficient for the tubes content to be mixed gently at each rotation.\nTransfer the tubes on a magnetic stand. After 5 min remove the supernatant and place the tubes on a rack.\nAdd 165 μL of LS buffer at 25°C and mix by pipetting up and down 10 times or vortex for 10 s to resuspend the beads. Incubate at 25°C for 15 min flicking the tubes every 2 min to avoid precipitation of the beads. In the meanwhile, aliquot the HS buffer in a sufficient number of 1.5 mL tubes and transfer them in a thermo block set at 68°C.\nPlace the tubes on a magnetic stand, wait for 5 min and remove the LS buffer. To each tube add 165 μL of warm HS buffer, vortex for 15 s and incubate the tubes in the thermo block set at 68°C for 10 min. Briefly spin the tubes to collect all material to the bottom, place on a magnetic stand, wait 5 min and remove the supernatant. Add 165 μL of fresh HS buffer at 68°C and repeat for a total of 3x HS buffer washes.\nAfter the third HS buffer wash remove the tubes from the thermo block, spin them briefly and place them on a magnetic stand. After 5 min discard the supernatant.\nAdd 50 μL of freshly prepared of NaOH 0.1N to each capture library to denature the RNA-DNA hybrids and pipette gently up and down 15 times or until the beads are thoroughly resuspended.",
    "Incubate for 15 min at 25°C occasionally flicking the tubes to avoid precipitation of the beads.\nPlace the tubes on a magnetic stand, wait 5 min and transfer the supernatant to a clean 1.5 mL Eppendorf tube.\nAdd 50 μL of Tris-HCl 1M pH 8.0 to each tube to neutralize the NaOH. Mix well by vortexing or pipetting.\nPerform a clean-up of the samples with AMPure XP beads using a standard 1.8X ratio:\nAdd 180 μL of AMPure XP beads equilibrated at 20°C–25°C for at least 30 min to each sample, vortex for 10 s and let stand at 20°C–25°C for 5 min.\nPlace the tubes on a magnetic stand, wait for 5 min.\nAdd 300 μL of freshly prepared 80% ethanol, let stand for 30 s.\nRemove the ethanol and perform a second wash. Let stand for 30 s.\nThoroughly remove the ethanol, briefly spin the tubes and place them back on the magnetic stand. Thoroughly remove traces of ethanol from the tubes and air-dry the pellets for 5 min on the magnetic stand with the lids open\nCritical: avoid over-drying the beads as this will result in a lower yield.\nElute the captured ssDNA fragments from the beads by adding 17 μL of ddH2O. Gently pipette up and down until the beads are thoroughly resuspended and incubate for 5 min at 20°C–25°C.\nPlace the tubes on a magnetic stand for 2 min and transfer 15 μL of the eluted ssDNA in new 0.2 mL tubes.\nPrepare the following mix using for each capture library the same primers pair used for the enrichment PCR (step 20 and 21):\ntable:files/protocols_protocol_2359_18.csv\nMix well and run the following program in a thermocycler to perform capture library amplification; we don’t recommend increasing the number of cycles to avoid the formation of PCR artifacts:",
    "table:files/protocols_protocol_2359_19.csv\nSpin the tubes briefly to collect all material at the bottom, transfer the samples to new 1.5 mL Eppendorf tubes and cleanup the samples using AMPure XP beads at standard 1.8X ratio:\nAdd 90 μL of AMPure XP beads equilibrated for at least 30 min at 20°C–25°C to each sample, vortex for 10 s or mix y pipetting up and down 10 times and let stand at 20°C–25°C for 5 min.\nPlace the tubes on a magnetic stand, wait for 5 min.\nDiscard the supernatant and add 300 μL of freshly prepared 80% ethanol, let stand for 30 se.\nRemove the ethanol and perform a second wash. Let stand for 30 s.\nThoroughly remove the ethanol, briefly spin the tubes and place them back on the magnetic stand. Thoroughly remove traces of ethanol from the tubes and air-dry the pellets for 5 min on the magnetic stand with the lids open.\nCritical: avoid over-drying the beads as this will result in a lower yield\nElute the captured ssDNA fragments from the beads by adding 27 μL of ddH2O. Gently pipette up and down 15 times or until the beads are thoroughly resuspended and incubate for 5 min at 20°C–25°C.\nPlace the tubes on a magnetic stand for 2 min and transfer 25 μL of cleaned-up, amplified capture libraries in labeled 0.5 mL tubes.\nPerform QC of the amplified libraries by checking the fragments size distribution and concentration on a Bioanalyzer using a High Sensitivity DNA kit. When measuring the library concentration in the Agilent software make sure to exclude any non-library peaks (e.g., artefacts/adapter dimers) by selecting only the expected size range.",
    "Calculate the enrichment efficiency of Alu and L1 sequences in each capture library by qPCR. The objective is to measure the Ct of Alu and L1 sequences in each pre-capture sample and in its respective the post-capture, amplified library.\nNote: the following qPCR protocol is for use on a StepOnePlus Real-Time PCR Systems instrument. For different qPCR systems, please refer to the manual of your qPCR reagents of choice.\nDilute the pre-capture samples and the respective post-capture, amplified libraries to 100 pg/μL. We recommend to perform serial dilutions to reach the desired final concentration.\nFor each pre-capture and post-capture samples to be assayed, prepare the following PCR mixes:\ntable:files/protocols_protocol_2359_20.csv\nKeep on ice in the dark until use.\ntable:files/protocols_protocol_2359_21.csv\nKeep on ice in the dark until use.\nMix well and transfer 18 μL for each reaction in single wells of a 96-well plate suitable for qPCR.\nAdd 2 μL of diluted pre-capture and post-capture samples (200 pg) to each well, seal the plate with film, briefly spin the plate and run the following program:\ntable:files/protocols_protocol_2359_22.csv\nCalculate the enrichment efficiency for each capture library as 2ˆ(Ct_Pre_capture-Ct_post_capture). The Ct values used are the mean value measured from triplicate qPCR assays.\nMake an equimolar pool of the libraries that will be sequenced, according to sample concentration conditions recommended by Illumina for the target sequencer.\nOptional: If an adapters dimer peak was observed in the Bioanalyzer profiles of capture libraries after the final PCR, this can be efficiently removed with a 0.8x size selection step using AMPure XP beads:\nAdd 80 μL of AMPure XP beads equilibrated for at least 30 min at 20°C–25°C to 100 μL of pooled libraries sample, vortex for 10 s or mix by pipetting up and down 10 times and let stand at 20°C–25°C for 5 min.",
    "Place the tubes on a magnetic stand, wait for 5 min.\nDiscard the supernatant and add 300 μL of freshly prepared 80% ethanol, let stand for 30 s.\nRemove the ethanol and perform a second wash. Let stand for 30 s.\nThoroughly remove the ethanol, briefly spin the tubes and place them back on the magnetic stand. Thoroughly remove traces of ethanol from the tubes and air-dry the pellets for 5 min on the magnetic stand with the lids open.\nCritical: avoid over-drying the beads as this will result in a lower yield.\nElute the samples from the beads by adding 27 μL of ddH2O. Gently pipette up and down 15 times or until the beads are thoroughly resuspended and incubate for 5 min at 20°C–25°C.\nPlace the tubes on a magnetic stand for 2 min and transfer 25 μL of cleaned-up, pooled capture libraries in a new tube.\nPerform a QC of the cleaned, pooled samples on a Bioanalyzer using a High sensitivity DNA kit. Load the samples in duplicate or triplicate wells and calculate the final molarity.\nThe libraries pool is ready for sequencing.\nAligning FASTQ files on reference genome and running TE-reX\nTiming: variable, depending on dataset size\nThis step provides instructions to align the FASTQ files of the sequenced capture libraries on the reference genome and instructions to run the TE-reX pipeline that finds and annotates recombination events from aligned split reads.",
    "Objective: this section provides basic guidance about how to process the FASTQ files from short-reads and long-reads sequencing. The FASTQ files are first run in the TE-reX pipeline and the output files are in MAF format (for more information, visit https://genome.ucsc.edu/FAQ/FAQformat.html[href=https://genome.ucsc.edu/FAQ/FAQformat.html]). The TE-reX output post-processing section provides some simple scripts to convert the output MAF files in a BED-like format that can be used for downstream analyses.\nHardware requirements: the scripts have been tested on Linux-based servers and computing clusters; we recommend at least 32GB or RAM and 8 CPU cores.\nSoftware requirements: TE-reX can be obtained from: https://gitlab.com/mcfrith/te-rex[href=https://gitlab.com/mcfrith/te-rex]. Please read the TE-reX documentation for dependencies and detailed information. Running TE-reX and the post-processing scripts require a standard Linux/Unix OS environment. The latest test of TE-reX and the post-processing scripts has been performed on Debian GNU/Linux 11 (bullseye).\nAlign the FASTQ files on the reference genome using LAST.5[href=https://www.wicell.org#bib5],6[href=https://www.wicell.org#bib6],7[href=https://www.wicell.org#bib7]\nNote: Please refer to LAST manual and literature for detailed information about genome indexing and generating the “train_file” accessory file. The following is an example command line, assuming LAST has been installed in a standard /home/bin path. We recommend compressing the aligned files to save storage space:\n>/home/bin/lastal -D1e9 -p train_file --split /indexed-genome-path/mydb my_library.fastq.gz | /home/bin/last-postmask | gzip > my_aligned_library.maf.gz\nRun the TE-reX pipeline on the aligned libraries.\nNote: please refer to the TE-reX manual for detailed information about accessory files and parameters. The following is an example command line, assuming that TE-reX has been installed in a standard /home/bin path and that the aligned library and accessory files are in the same path. We recommend to generate the output in a dedicated path:\n>/home/bin/te-rex -s 0 -m 1e-04 genome-to-reps.maf reps-to-reps.tab my_aligned_library.maf.gz /my_terex_out/my_terex_out\nWith this example command line, TE-reX will generate 2 output files in the /my_terex_out/ folder.\nmy_terex_out-insert.maf\nmy_terex_out-recomb.maf",
    "Post-processing of TE-reX recomb output\nTiming: variable, depending on dataset size\nThis step provides instructions to convert the .maf format of the TE-reX output files into a BED-like format suitable for downstream analyses.\nIn order to convert the output files of TE-reX Recomb from the standard MAF to a BED-like format that can be used for downstream analyses we designed 3 scripts for TE-reX Recomb output from short-reads (with and without repeats enrichment) and long-reads datasets sequenced on Illumina and Oxford Nanopore Technologies (ONT) platforms. The scripts are available at https://gitlab.com/mcfrith/te-rex/-/tree/master/bin[href=https://gitlab.com/mcfrith/te-rex/-/tree/master/bin].\nThe scripts perform a series of transformations on TE-reX Recomb output files:\nConvert the multi-line .maf format in single-line, BED-like format where all the information for a given recombination event are contained within the same line.\nCollapse PCR duplicates in a single entry.\nFilter recombination events based on the mismap score of the respective split reads.\nGenerate a unique ID for each recombination event based on the RepeatMasker annotations of the recombined repeats and the breakpoint information from the Dfam repeat models.\nCount the number of independent reads supporting each recombination event.\nAdd information about the genomic distance of the recombined repeats (<100Kb, >100Kb, Inter-chromosomal).\nAdd information about the type of SV theoretically generated by the recombination event (inversion, deletion, duplication).\nGenerate a list of recombination events found in multiple samples of the datasets and use it to identify singleton recombination events found only in single samples. Depending on the experimental design of the dataset, this may be useful to identify putative polymorphic and somatic recombination events.",
    "The main difference between the scripts for short- and long-reads is the absence of the sequence of the split reads in the long-reads script output files, since its inclusion would make the results harder to consult. The scripts are provided as executable files that can be run from the same folder of the TE-reX Recomb output files. The requirements for the scripts are:\nTE-reX Recomb output files (my_out-recomb.maf).\nRepeatMasker annotation in BED format.\nThe RepeatMasker annotation can be downloaded in BED format using the UCSC Table Browser at https://genome.ucsc.edu/cgi-bin/hgTables[href=https://genome.ucsc.edu/cgi-bin/hgTables]. The BED file needs to be modified to remove all the underscore (“_”) symbols present in the name of some repeat subfamilies. The RepeatMasker file should have the following structure (“/t” indicates tab separation): chromosome\\tstart \\tend\\tstrand\\trepeatname\\trepeattype\\trepeatfamily.\nBelow is one line of example:\nField $1: chr1.\nField $2: 67108753.\nField $3: 67109046.\nField $4: +\nField $5: L1P5.\nField $6: LINE.\nField $7: L1.\nThe scripts can be run as a standard executable in the command line, for example:\n>sh te-rex-short-reads.sh repeatmasker.mod.bed ∗-recomb.maf\nThe scripts will generate in the run folder a “redundant-recomb-events” file and the output files with the extension \".all\" (including all recombination events) and “.uniq” (only putative somatic events).\nThe ‘redundant-recomb-events” files is a list of unique IDs of those recombination events found by TE-reX in n > 1 input .maf files in the exact same configuration (i.e., same repeat elements pairs and same breakpoint position according to Dfam models), together with the count of the number of occurrences (i.e., the number of independent samples in which a given redundant recombination event has been found).\nThe .all and .uniq files for the short-reads scripts have the following structure:\nField $1: chromosome name of split read A.\nField $2: Start position of breakpoint for split read A.",
    "Field $3: End position of breakpoint for split read A.\nField $4: Strand for split read A.\nField $5: mismap score for split read A.\nField $6: TE-reX Recomb ID for split read A.\nField $7: mapping information for split read A (genomic location and length)\nField $8: chromosome name of split read B.\nField $9: Start position of breakpoint for split read B.\nField $10: End position of breakpoint for split read B.\nField $11: Strand for split read B.\nField $12: mismap score for split read B.\nField $13: TE-reX Recomb ID for split read B.\nField $14: mapping information for split read B (genomic location and length)\nField $15: identity of the recombined repeats according to Dfam models.\nField $16: Sequence of split read A.\nField $17: Sequence of split read B.\nField $18: Fastq ID.\nField $19: Unique ID (Repeat A_Repeat B_Breakpoint A_Breakpoint B)\nField $20: Independent supporting reads count.\nField $21: Genomic distance of recombined repeats (“<100Kb”, “>100Kb”, “Inter”)\nField $22: Sample name.\nField $23: Type of SV generated by the recombination (“inv”, “del”, “dupl”, “Inter”)\nThe .all and .uniq files for the long-reads script have the following structure:\nField $1: chromosome name of split read A.\nField $2: Start position of breakpoint for split read A.\nField $3: End position of breakpoint for split read A.\nField $4: TE-reX Recomb ID for split read A.\nField $5: mismap score for split read A.\nField $6: length of mapped split read A.\nField $7: chromosome name of split read B.\nField $8: Start position of breakpoint for split read B.\nField $9: End position of breakpoint for split read B.\nField $10: TE-reX Recomb ID for split read B.\nField $11: mismap score for split read B.\nField $12: length of mapped split read B.",
    "Field $13: Fastq ID.\nField $14: Genomic distance of recombined repeats (“<100Kb”, “>100Kb”, “Inter”)\nField $15: Unique ID (Repeat A_Repeat B_Breakpoint A_Breakpoint B)\nField $16: Sample name.\nField $17: Type of SV generated by the recombination (“inv”, “del”, “dupl”, “Inter”)"
  ],
  "subjectAreas": [
    "Genomics",
    "Molecular Biology",
    "Sequencing",
    "Bioinformatics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology"
  ]
}