{
  "id": 4038,
  "origin_website": "Cell",
  "title": "Ultracentrifugal separation, characterization, and functional study of extracellular vesicles derived from serum-free cell culture",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDay 1: Preparation of FreeStyleTM 293-F cell for transfection\nTiming: 30 min for seeding cells; 48 h of growing cells before transfection\nThe EVs are secreted into FreeStyle 293 Expression Medium during culture, and the resulting medium is referred to as the conditioned medium.\nCaution: Perform all steps described in this section in a sterilized biosafety cabinet.\nGrow and expand suspension cell number in culture flask, such that they will reach the density of 0.6 – 1.0×106 cells/mL after 48 h. In the case of FreeStyleTM 293-F cells, culture 2×105 cells/mL in a 125 mL polycarbonate, disposable, nonpyrogenic Erlenmeyer flask, in final volume of 15–30 mL of FreeStyle 293 Expression Medium. Maintain the culture in 37°C, 8% CO2 incubator with constant agitation on an orbital shaker rotating at 135 rpm.\nNote: To assure the cell density is sufficient for transfection at 48 h later, the cells at this point should be in the log phase, and the cell viability should be more than 90%.\nUse trypan blue exclusion to determine cell density and cell viability.\nAliquot 100 μL of cell suspension into a microcentrifuge tube.\nAdd equal part of 0.4% trypan blue solution (100 μL in this case) to the cell suspension to achieve 2 times dilution and pipetting several times to mix completely.\nLoad 8 μL of the trypan blue/cell mixture to a hemocytometer chamber.\nView the hemocytometer under light microscope with low magnification.\nCount the stained (nonviable) and unstained (viable) cells from the four corner squares of hemocytometer.\nCalculate the percentage of viable cells as follows:\nCalculate the cell density as follows:",
    "Critical: To ensure that the amount of EVs collected from the conditioned medium is sufficient for downstream analysis (Please refer to the expected outcome for the typical yield of this protocol), it is recommended that a minimum of 15 mL cell suspension at the density of 2×105 cells/mL is used as a starter culture at this point.\nNote: The cell number can be scaled up or down by modifying the culture volume based on experimental needs.\nDay 3: Transfection of FreeStyleTM 293-F cell\nTiming: 1 h to transfect cells; 48 h for plasmid-DNA or siRNA-transfected cell culture before EV collection\nThis section aims to transfect the cells with desired plasmid DNA or siRNA to determine the effect of a gene of interest on EV secretion. For the manufacturer's protocol of FreeStyleTM 293-F cell transfection, please visit https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2FMAN0007819_293fectinTransfectionReagent_UG.pdf&title=VXNlciBHdWlkZTogMjkzZmVjdGluIFRyYW5zZmVjdGlvbiBSZWFnZW50[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2FMAN0007819_293fectinTransfectionReagent_UG.pdf%26title=VXNlciBHdWlkZTogMjkzZmVjdGluIFRyYW5zZmVjdGlvbiBSZWFnZW50].\nCaution: Perform all steps described in this section in a sterilized biosafety cabinet.\nAliquot 100 μL of cell suspension into microcentrifuge tube. Use trypan blue exclusion method (see step 2) to determine cell viability and examine the clumping of the cells. To achieve high transfection efficiency, the percentage of cell viability must be more than 90%.\nNote: For good transfection efficiency, it is important to ensure the cells are in single-cell suspension. Vortex the cell suspension vigorously at 2,500–3,000 rpm for about 30 s to dissociate cell clumping. The cell suspension should appear turbid and homogenous, as shown in Figure 1[href=https://www.wicell.org#fig1].\nCount the cell number by using hemocytometer. The cell density at this point should be around 0.6–1.0×106 cells/mL. FreeStyleTM 293-F cells usually will achieve approximately 0.8×106 cells/mL.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/751-Fig1.jpg\nFigure 1. Appearance of the Freestyle 293-F cell suspension culture in a flask",
    "Pellet down the cells at 200 × g for 5 min at 25°C and resuspend them in fresh, pre-warmed medium. For each 30 mL transfection, resuspend the cells in 28 mL of the medium. Keep the cells in culture flask under constant agitation to avoid cell clumping for the transfection later.\nPrepare the lipid-DNA or siRNA complex. In the FreeStyleTM 293-F cells system, we use 293fectin reagent for siRNA transfection according to the manufacturer’s protocol. As for plasmid DNA transfection, we use 293fectin or polyethyleneimine (PEI MAX).\nDilute 30 μg of plasmid DNA or 72 μL of 20 μM siRNA in 1 mL Opti-MEM reduced-serum medium in a tube. Dilute 60 μL of 293fectin in 1 mL Opti-MEM medium in another tube. For plasmid DNA transfection, 90 μL of 1 mg/mL PEI MAX can be used instead of 293fectin. Incubate them for 5 min at 25°C.\nMix the solutions and incubate for 30 min at 25°C to allow the formation of lipid-DNA or siRNA complex.\nAdd the complex to the previously prepared 28 mL cell suspension to form total 30 mL cell suspension culture.\nIncubate the cells in 37°C, 8% CO2 incubator with constant agitation on an orbital shaker rotating at 135 rpm for 48 h.\nCritical: For siRNA transfection, optimal cell concentration at the transfection is 0.6–0.7×106 cells/mL.\nNote: When transfecting cells with nucleic acid, the possible contamination of nucleic acid in the EV preparation is unavoidable. Hence, extra caution should be taken for analysis of nucleic acid contents by next-generation sequencing (NGS) and so on.\nDay 5: Collecting whole cell lysate and conditioned medium\nTiming: 1–1.5 h",
    "The cell suspension is collected in 50 mL conical tube and centrifuged twice at low speed (1000 × g and 3000 × g, each for 10 min) to pellet down the cell body and eliminate cellular debris from the conditioned medium. This partially clarified medium will be subjected to differential ultracentrifugation in the next section to separate the l-EVs and s-EVs. An overview of the whole-cell lysate (WCL) and EV preparation is illustrated in Figure 2[href=https://www.wicell.org#fig2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/751-Fig2.jpg\nFigure 2. Scheme of the preparation of WCL, l-EVs, and s-EVs by stepwise centrifugation from HEK 293 cell culture media\nObserve the cell suspension under light. As shown in Figure 1[href=https://www.wicell.org#fig1], you should see a homogenous cell suspension without cell clumping. Alternatively, aliquot a small amount of cell suspension and observe under microscope. If cell clumping is observed, vortex the cell suspension vigorously at 2,500–3,000 rpm for about 30 s to dissociate the clump.\nCritical: It is important to dissociate cell clumping as it will affect the cell counting, which will be used to calculate the number of EV secretion per cell and immunoblotting normalization later.\nAliquot 100 μL of the cell suspension to microcentrifuge tube for trypan blue exclusion assay and cell counting using hemocytometer (see step 2). Both the viable cell number and dead cell number should be counted.\nNote: We recommend examining the number of dead cells, which can be fragmented into the apoptotic bodies. The dead cell number should be similar between comparisons. The larger fraction of dead cells in the culture will cause the contamination of apoptotic bodies in the EV fractions.\nAliquot another 500 μL cell suspension to a microcentrifuge tube to prepare WCL fraction.\nCentrifuge the cell at 1,000 × g at 4°C for 10 min.",
    "Discard the supernatant and resuspend the pellet in 1× sample buffer (dilute 5× sample buffer with ddH2O). Pipette the WCL up and down several times.\nSonicate the lysate.\nNote: We sonicate the cell lysate for 30 s at the intensity of output 4 using an ultrasonic cell homogenizer (Taitec Co., Model VP-5S). Other model of homogenizer with similar output can be used as well. The purpose here is to reduce the viscosity caused by the nucleic acids in the samples for electrophoresis, therefore, moderate sonication is sufficient.\nHeat the sample at 95°C for 5 min.\nKeep the sample at −30°C for further analysis.\nTransfer the rest of the homogenous cell suspension to a 50 mL conical tube for EV separation.\nPerform 2-steps low-speed centrifugation to eliminate the cell body and debris from the conditioned medium.\nCentrifuge the cell at 1,000 × g at 4°C for 10 min to pellet down the cell body.\nTransfer the supernatant to a new 50 mL conical tube and centrifuge again at 3,000 × g at 4°C for 10 min to pellet down the cell debris.\nTransfer the supernatant to a new 50 mL conical tube for EV fractionation. Keep the tube on ice to avoid EV degradation.\nCritical: Gently open the lid of the conical tube and carefully transfer the supernatant without disturbing the pellet.\nDay 5: Extracellular vesicle fractionation\nTiming: 4–5 h\nDifferential high-speed centrifugation is applied to the conditioned medium to separate the l-EVs and s-EVs. The stepwise ultracentrifugation is depicted in Figure 2[href=https://www.wicell.org#fig2].\nNote: The ultracentrifugation parameters in this protocol are partly adapted (Lasser et al., 2012[href=https://www.wicell.org#bib5]).\nThe partially clarified conditioned medium in 50 mL conical tube now contains l-EVs and s-EVs. To separate l-EVs, we use TOMY MX-307 high-speed refrigerated microcentrifuge.",
    "Note: As shown in Figure 3[href=https://www.wicell.org#fig3]A, while using fixed angle rotor, place the conical tube in the rotor so that the marking area of the conical tube is facing outward. This eases the finding of the pellet, which usually accumulates at the lower portion of the tube at the side of the marked area. In this way, even if the pellet is too small to be seen, we can still know which side of the tube the pellet is on.\nSubject the conditioned medium to 16,500 × g centrifugation for 20 min at 4°C (TOMY AR510-04 rotor; k-factor: 880; 13,500 rpm) to pellet down the l-EV.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/751-Fig3.jpg\nFigure 3. Setting of the centrifuge tubes in rotors and the appearance of the pellet after the centrifugation for each preparation\n(A) Top: setting of the conical tube in AR510-04 rotor. Bottom: the appearance of the l-EV pellet after centrifugation.\n(B) Top: setting of polycarbonate ultracentrifuge bottle in Ti45 Beckman rotor. Bottom: the appearance of the s-EV pellet after centrifugation.\n(C) Top: setting of 1mL open-top thick-wall polycarbonate ultracentrifuge tube in the Beckman TLA 120.2 rotor. Bottom: the appearance of the s-EV pellet after centrifugation.\nMark the position of the l-EV pellet on the conical tube and gently decant the supernatant to a clean polycarbonate ultracentrifuge bottle (Beckman, 355622). Immediately keep the bottle on ice as the supernatant at this point contains s-EV. (Please go to step 14 for s-EV separation)\nNote: An off-white to transparent EV pellet is usually visible in the lower portion of the tube at the marking side. The pellet might be hard to be seen if the size is too small. Please refer to troubleshooting problem 1[href=https://www.wicell.org#sec6.1] if unable to visualize the EV pellet.",
    "Critical: Open the lid of the conical tube carefully without disturbing the pellet. While decanting, keep the pellet side of the tube facing upward so that it is not transferred to the new tube (Figure 4[href=https://www.wicell.org#fig4]).\nResuspend the l-EV pellet in 500 μL of sterile ice-cold filtered PBS. Pipet up and down against the wall of the conical tube at the marking area to fully dislodge and dissociate the pellet.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/751-Fig4.jpg\nFigure 4. Decantation of the supernatant to a polycarbonate ultracentrifuge bottle with the part of the tube with EV pellet (red circle) facing upward\nMove the resuspended l-EV to a low-protein-binding microcentrifuge tube (Watson, PK-15C-500).\nTransfer another 500 μL sterile ice-cold PBS to the conical tube and pipette against the wall to collect the remaining EV in the tube.\nMove the remaining EV suspension to the low-protein binding microcentrifuge tube to make a total of 1 mL l-EV resuspended in sterile ice-cold PBS.\nCentrifuge the tube at 16,500 × g centrifugation for 20 min at 4°C (TOMY AR015-24; k-factor: 643; 13,500 rpm) to precipitate the l-EV.\nUse p1000 to remove 800 μL of the supernatant.\nCritical: Pipette out the supernatant gently. Leave ̴200 μL of supernatant in the microcentrifuge tube to avoid disturbing the pellet.\nCentrifuge the tube again at 16,500 × g centrifugation for 3 min at 4°C (TOMY AR015-24; k-factor: 643; 13,500 rpm).\nUse p200 to remove the remaining supernatant completely.\nResuspend pellet in a suitable buffer for downstream application. Keep the tube on ice.",
    "Note: We suggest to resuspend the l-EVs in 75–150 μL cold-sterile PBS buffer, and dispense some amount to sterile tubes for downstream experiments. For example, aliquot 5–10 μL of l-EV suspension for NTA, 3–5 μL for Qubit protein quantification assay, 10 μL for cell migration assay, and 5–10 μL for lamellipodia formation assay. For immunoblot analysis, add 5× sample buffer to 1/4 of the sample volume to lyse the EVs. Besides PBS buffer, other neutral pH buffers such as HEPES (N-2-hydroxyethylpiperazine-N-2-ethane sulfonic acid) buffer can also be used for l-EVs suspension.\nNote: L-EVs might form clusters due to their “sticky” nature. Gently resuspend the pellet by pipetting up and down for 20–30 times to dissociate the clump adequately.\nNote: The l-EVs suspended in PBS buffer can be kept frozen at −80°C to be used for protein quantification, immunoblotting and functional study later on. However, multiple freeze-thaw cycles might deteriorate the sample quality. For NTA, we suggest storing the l-EV suspension at 4°C and analyze within 24 h in order to get stable and reproducible results.\nWeigh the polycarbonate ultracentrifuge bottles containing supernatant from step 13b. Equate their weight by using sterile ice-cold PBS.\nCritical: It is important to ensure that all the bottles are properly balanced. An imbalance can damage the ultracentrifuge equipment.\nPlace the bottles into the pre-cooled Ti45 Beckman rotor. We use Beckman Coulter OptimaTM L-90K Ultracentrifuge to separate s-EVs.\nNote: Similar to the previous step, while using the Ti45 fix-angle rotor, it is important to label the side of the bottle facing outward of the rotor to indicate the pelleting side. This step is also shown in Figure 3[href=https://www.wicell.org#fig3]B.\nCentrifuge the bottles at 120,000 × g for 70 min at 4°C (Ti45 Beckman Rotor; k-factor: 259; 32200 rpm).",
    "Immediately pull out the bottles from the rotor. Use a marker to circle the EV pellet.\nNote: An off-white to transparent EV pellet is usually visible in the bottom portion of the bottles at the marking side. The pellet might be hard to be seen if it is too small. Hence, it is important to indicate the side where the pellet will attach.\nGently open the lid of the bottle and carefully decant the supernatant. The supernatant is now free of l-EVs and s-EVs.\nOptional: The vesicle-free supernatant can be collected in a conical tube to be analyzed for its contents, such as soluble factors. The soluble factors in the vesicle-free medium can be concentrated by using centrifugal concentrator and analyzed by using immunoblotting (Wang et al., 2021[href=https://www.wicell.org#bib16]).\nNote: While decanting, keep the pellet side of the tube facing upward so that it is not disturbed.\nImmediately keep the bottles containing the s-EV pellet on ice.\nWash the s-EV pellet with 400 μL sterile ice-cold PBS. Gently resuspend the pellet by pipetting up and down several times.\nTransfer the resuspended s-EV to the labeled, 1 mL open-top thick-wall polycarbonate ultracentrifuge tube (Beckman, 343775), which is placed on ice.\nCollect remaining EV using another 400 μL sterile ice-cold PBS.\nWeigh the tubes to ensure that they are balanced. Add sterile ice-cold PBS to equate their weight if necessary.\nPlace the tube into the pre-cold Beckman TLA120.2 fixed-angle rotor (Figure 3[href=https://www.wicell.org#fig3]C).\nCentrifuge at 120,000 × g for 70 min at 4°C (Beckman TLA 120.2 rotor; k-factor: 34.8; 58,000 rpm) using ultracentrifuge Beckman Coulter OptimaTM TLX 120,000 RPM.\nImmediately pull out the tube from the rotor and decant the supernatant.\nNote: While decanting, keep the pellet side of the tube facing upward so that it is not disturbed.",
    "Remove the remaining medium in the tube completely by turning them upside down on a paper towel. Use p200 to remove the residual medium in the tube if necessary.\nResuspend pellet in a suitable buffer for downstream application and move the EV suspension to a low-protein-binding microcentrifuge tube (Watson, PK-15C-500). Keep the tube on ice.\nNote: We suggest to resuspend the s-EVs in 75–150 μL cold-sterile PBS buffer, and dispense some amount to sterile tubes for downstream experiments. For example, aliquot 5–10 μL of s-EV suspension for NTA, 3–5 μL for Qubit protein quantification assay, 10 μL for cell migration assay, and 5–10 μL for lamellipodia formation assay. For immunoblot analysis, add 5× sample buffer to 1/4 of the sample volume to lyse the EVs. Besides PBS buffer, other neutral pH buffers such as HEPES (N-2-hydroxyethylpiperazine-N-2-ethane sulfonic acid) buffer can also be used for s-EVs suspension.\nNote: The s-EVs suspended in PBS buffer can be kept frozen at −80°C to be used for protein quantification, immunoblotting and functional study later on. However, multiple freeze-thaw cycles might deteriorate the sample quality. For NTA, we suggest storing the s-EV suspension at 4°C and analyze within 24 h in order to get stable and reproducible results.\nDay 5: Measurement of the protein concentration of EVs\nTiming: 25 min\nThe protein concentration of the l-EV and s-EV fractions should be quantified. The protein concentration of EV will be used to normalize the sample loading in the immunoblotting assay later. In this protocol, we use QubitTM protein quantification assay for the measurement. This assay is easy to perform and provides accurate results. For the manufacturer’s protocol, please visit https://assets.thermofisher.com/TFS-Assets/BID/manuals/MAN0017210_Qubit_4_Assays_QR.pdf[href=https://assets.thermofisher.com/TFS-Assets/BID/manuals/MAN0017210_Qubit_4_Assays_QR.pdf]",
    "Note: To quantify the protein amount inside EVs, add 0.2% SDS to the EVs suspension to lyse the EVs (Vergauwen et al., 2017[href=https://www.wicell.org#bib15]). To measure EV surface protein, no detergent is required.\nPrepare 3 QubitTM assay tubes for 3 standards and 1 QubitTM assay tube for each sample. Label the standards and the sample according to their orders at the tube lids.\nNote: Always label the tube lids only. Labeling at the side of the tube could interfere with the measurement.\nPrepare 200 μL QubitTM working solution for each standard and sample.\nDilute the QubitTM reagent in the QubitTM buffer in a ratio of 1:200. For example, if there are 2 samples, prepare 1000 μL working solution by diluting 5 μL QubitTM reagent in 995 μL QubitTM buffer.\nVortex the working solution for 5–10 s to mix well.\nDispense 1–5 μL of EV samples suspended in sterile PBS into Qubit assay tube and dilute with the QubitTM working solution to a total volume of 200 μL.\nNote: QubitTM protein quantification assay can detect the protein concentration range from 12.5 μg/mL to 5 mg/mL. Sample volume can be increased up to 20 μL depending on the protein concentration.\nCritical: The presence of KPO4 and NaCl in the PBS could interfere with the measurement. For an accurate result, it is necessary to add an equal amount of PBS to the standard tubes. For other different contaminants in the buffer of choice, please visit the user guide at http://tools.thermofisher.com/content/sfs/manuals/Qubit_Protein_Assay_UG.pdf[href=http://tools.thermofisher.com/content/sfs/manuals/Qubit_Protein_Assay_UG.pdf]\nDispense 10 μL of each standard #1, #2, and #3 into clean tubes and add same volume of PBS (1–5 μL) used to load the samples. Dilute the standards with QubitTM working solution to a total volume of 200 μL.\nVortex all tubes for 2–3 s to mix well.",
    "Incubate them at 25°C for 15 min.\nCritical: The QubitTM Protein Assay works best at room temperature (22°C–28°C). Warm up the working solution to around 25°C for accurate measurements. Avoid holding the sample before measurement, as raising in temperature could lower the reading.\nInsert the tube in the QubitTM Fluorometer and take the reading.\nDay 5: Measurement of the size distribution and concentration of EVs\nTiming: 15 min per sample\nNTA is used to measure the size and amount of EVs. NTA enables the tracking and quantification of EVs by capturing the movies of particles moving under Brownian motion. NTA tracks the center of each particle, calculates the average distance moved per time, and converts it into a size distribution profile. The concentration of EVs measured in this section will be used to normalize the sample loading in the immunoblotting assay later. In this protocol, Nanosight LM10 (Malvern Panalytical, UK) and NTA 3.1 analytical software (Malvern Panalytical, UK) are used for the analysis.\nCritical: Always keep the EVs on ice or in 4°C fridge for storage. Perform the NTA measurement within 48 h after EV collection to reduce EV lysis and aggregation.\nDilute the EVs sample in 300–500 μL of sterile ice-cold PBS and keep on ice.\nNote: For initial measurement, it is recommended to start with low dilution (e.g., 40× dilution for l-EVs and 100× dilution for s-EVs) and then use further dilution to get an optimum particle concentration for the measurement. The optimum particle range should within 108–109 particles/mL.",
    "Clean the LM10 viewing unit using a deionized-water-dampened optical lens grade cleaning tissue to wipe over the inside surface of the top-plate window and the optical plate surface. Dry the surface by wiping with the tissue and blowing with an air stream from an air compressor. The viewing unit components are depicted in Figure 5[href=https://www.wicell.org#fig5].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/751-Fig5.jpg\nFigure 5. Nanosight LM10 viewing unit components\nCaution: Water could seep into the laser module and cause damage. Do not wipe the surface by using soggy tissue or pour any liquid over the surface.\nAssemble the LM10 viewing unit and attach the power lead.\nCaution: Make sure the “O”-ring is placed correctly in the groove on the inside surface of the top plate (Figure 5[href=https://www.wicell.org#fig5]). It is important to avoid any leakage of liquid to the laser inside.\nNote: To further ensure the beam path is free of impurities, users are encouraged to rinse the beam path twice by injecting 1 mL of PBS (or any buffer used to resuspend the EVs) into the chamber slowly and steadily using a syringe.\nLoad the EV sample into the chamber. Similar steps can be taken for PBS buffer (or any buffer used in EV suspension) as a control for the measurement.\nVortex the EV sample gently at 500–1,000 rpm for 5 s.\nUse 1 mL syringe to withdraw 0.5 mL of sample. Ensure no bubbles are introduced into the syringe. If there is, hold the syringe upright and slowly eject the air bubbles from the tip.\nIntroduce the sample slowly and steadily into the chamber. Rapid injection might increase the pressure in the chamber and cause leakage. After the introduction, withdraw the sample by pulling the plunger and then introduce it again. Repeat these 3 times to make the sample distribute evenly in the chamber.",
    "Alternatives: For smoother flow of sample loading, the Malvern Panalytical NanoSight syringe pump can be used instead of manual injection.\nPlace the viewing unit on the microscope stage and turn on the laser power.\nAdjust the imaging position, focus, and camera level on the capture setting to obtain a clear and distinguishable particle image on the screen.\nCritical: EV aggregates can affect the NTA analysis. To reduce the aggregates, add more PBS to resuspend the EVs and pipette up and down several times. If aggregates are still visible, gently vortex the suspension at 500–1,000 rpm for 10–15 s.\nCapture the movie of the particles under Brownian motion for 30–60 s.\nChange to a different observation field by slowly inject more sample into the chamber and record another movie. Repeat this step another 3 times to capture a total of 5 different movies.\nAdjust the detection threshold to the level that most of the particles are properly identified. Proceed to the NTA analysis to determine the particle concentration and size distribution.\nDay 5-6: Identification of protein marker in EVs by immunoblotting\nTiming: 2 days\nThe total cell number, EV protein concentration, and EV number quantified previously can be used to normalize the immunoblotting analysis in this section. The protein of interest and specific markers in WCL, l-EV and s-EV fractions can be detected using various antibodies, including those listed in the key resources table[href=https://www.wicell.org#key-resources-table]. The protein amount can be quantified by using ImageJ software (NIH, USA).\nAdd 5× sample buffer of one-fourth volume into the l-EV and s-EV samples obtained previously to make 1× sample buffer concentration and heat them at 95°C for 5 min.",
    "Load the equal cell number, equal protein concentration, and equal EV number per sample to SDS-PAGE. For cell-number normalization, load 1×104 cells for WCL and 4×106 cells for EV; for total-protein normalization, load 500 ng protein; for EV-number normalization, load 6×108 EVs.\nRun the SDS-PAGE and resolve the protein based on their size.\nTransfer the protein resolved in the gel onto polyvinylidene difluoride (PVDF) membrane using a semi-dry western blot transfer system for 45 min to 1 h at 24 V.\nBlock the membrane in 20 mL of 5% skim milk/PBS-0.05% Tween 20 (PBS-T) solution and rock it on a shaker for 1 h at 25°C.\nWash the membrane with PBS-T once.\nIncubate the membrane in primary antibody diluted in PBS-T/0.01% NaN3 and rock it for 12–16 h at 4°C. The antibody dilution varies according to manufacturer recommendation. For the antibodies listed in the key resources table[href=https://www.wicell.org#key-resources-table] and used in Figure 7[href=https://www.wicell.org#fig7]:\nCalnexin and GM130 antibodies can be used as negative marker for EVs at 1:1000 dilution.\nCD81, CD63, TSG101 and ALIX antibodies can be used as s-EV markers at 1:1000 dilution.\nAnnexin A1 antibody can be used as l-EV marker at 1:1000 dilution.\nMIM, Integrin α2, IRS4, and GAPDH antibodies can be used at 1:000 dilution.\nNectin-2 antibody can be used at 1:2000 dilution.\nRac1 and GFP antibodies can be used at 1:4000 dilution.\nCaution: Many antibodies for tetraspanins, including the anti-CD63 antibody listed in the key resources table[href=https://www.wicell.org#key-resources-table], do not bind to antigens treated with sample buffers containing reducing agents such as 2-mercaptoethanol or dithiothreitol. In case you use those antibodies, you should omit reducing agents from the sample buffer. The anti-CD81 antibody in the list can be used for samples treated with these reagents. See also troubleshooting problem 5[href=https://www.wicell.org#sec6.5].",
    "Wash the membrane with PBS-T for 10 min at 25°C for 3 times.\nIncubate the membrane with AP- or HRP- labeled secondary antibody diluted in PBS-T for 10,000× at 25°C for 1 h.\nWash the membrane with PBS-T for 10 min at 25°C for 3 times.\nFor detection by AP, go to step 42, and for detection by HRP, go to step 46.\nFor AP detection, wash the membrane with AP buffer at 25°C once.\nDilute 37.5 μL BCIP solution (50 mg/mL in dimethylformamide) and 50 μL NBT solution (100 mg/mL in 70% dimethylformamide) in 10 mL AP buffer. Add 4–5 mL to each membrane and shake at 25°C until the protein bands appear.\nTo stop the reaction, discard the solution and wash the membrane with tap water.\nDry the membrane and quantify the signals by using ImageJ software.\nFor HRP detection, add 5 mL of ECL Prime western blotting detection reagents and detect the chemiluminescence using the image detector, such as LAS 4000 (GE Healthcare).\nDay 5-6: The assay for the EV-induced cell migration\nTiming: 2 days\nSome EVs promote the migration of cells in an autocrine or paracrine manner, which may cause some diseases such as cancer cell metastasis (Becker et al., 2016[href=https://www.wicell.org#bib1]). Cell migration can be measured by live cell imaging in the presence of EVs and subsequent cell tracking analysis.",
    "Lamellipodia formation is one of the key features of cell migration (Krause and Gautreau, 2014[href=https://www.wicell.org#bib4]). Lamellipodia are fan-like structures of actin filaments assembled at the cell periphery, especially at the leading edge of the migrating cells (Krause and Gautreau, 2014[href=https://www.wicell.org#bib4]). Lamellipodia are mainly generated by the activation of the Wiskott-Aldrich syndrome protein-family verprolin homologous protein 2 (WAVE2) complex, which causes the Actin-related protein 2/3 (Arp2/3) complex-mediated actin polymerization (Oikawa et al., 2004[href=https://www.wicell.org#bib9]). WAVE2 complex is activated by a small G protein Rac1, which activation leads to the lamellipodia formation (Miki et al., 1998[href=https://www.wicell.org#bib7]). Lamellipodia formation can be assessed by the staining of actin filaments and WAVE2, which is the major component of WAVE2 complex.\nNote: It is important to control the amount of EVs added to the cells. By adding the same amount of EVs to the cells, we can compare the differential effects of EVs. The amount can be adjusted by the number of the cells that produce EVs, the number of EV particles, the amount of proteins that EVs have, and so on. For example, 2–10 μg/mL of EVs can lead to cell migration in our hand. However, the amount is subjected to cell type and experimental condition. In this section, we describe the effect of the EV on cell migration, lamellipodia formation, and Rac1 activity, but other analyses can be done in a similar way.\nCell migration assay\nMix 293-F cells (8×104 cells) suspended in 1.2 mL of FreeStyle 293 Expression Medium with the EVs and seed them in the 3.5 cm culture dishes (Corning).\nNote: The amount of EVs to be used in the assay can be adjusted by cell number, EV number, or EV protein concentration. For example, we perform the assay by using EVs prepared from 9×106 of HEK293-F cells.",
    "Set the dishes on the CytoSMART Lux2 (Zutphen, Netherlands) apparatus in the 8% CO2 incubator at 37°C. After 30 min, take pictures of the cells every 15 min for 48 h. For CytoSMART Lux2 information, please visit the following link: https://www.cytosmart.com/products/lux2[href=https://www.cytosmart.com/products/lux2].\nTrack the migration of cells manually by ImageJ (NIH, USA) using Cell Tracker plug-ins such as MTrackJ or Manual Tracking (NIH, USA). Select 10 cells per region and track the cell migration every 15 min for 48 h. Calculate the average migration speed for every 12 h and compare them with the first 12 h migration speed.\nLamellipodia formation assay\nSuspend HEK 293-F cells (8×103 cells) in 0.1 mL of FreeStyle 293 Expression Medium, seed them in glass-based dishes (IWAKI), and incubate in 8% CO2 incubator at 37°C for 3 h.\nReplace the FreeStyle 293 Expression Medium with fresh medium containing EVs and incubate at 37°C, 8% CO2 for 15 min.\nNote: The amount of EVs to be used in the assay can be adjusted by cell number, EV number, or EV protein concentration. For example, we perform the assay by using EVs prepared from 9×106 of HEK293-F cells.\nImmediately after removing the medium, fix the cells with 4% (wt/vol) paraformaldehyde (PFA) in the FreeStyle 293 Expression Medium at 25°C for 5 min. Then, wash the cells with tris-buffered saline (TBS) once.\nCaution: After removing the medium, the cells should be fixed immediately and quickly to avoid the disassembly of actin filaments, including lamellipodia.\nPermeabilize cells with 0.1% Triton X-100 in 1% bovine serum albumin (BSA)/TBS for 5 min. Then, wash the cells with TBS once.\nBlock the cells with 3% (wt/vol) BSA in TBS at 4°C for 16 h. Then, wash the cells with TBS once.",
    "Incubate the cells with anti-WAVE2 antibody or an antibody to any other lamellipodia localizing protein in 1% BSA/TBS (90 μL) at 25°C for 2 h.\nNote: The rabbit anti-WAVE2 antibody recommended in key resources table[href=https://www.wicell.org#key-resources-table] can be used at 1:100 dilution.\nWash the cells 3 times with TBS.\nIncubate cells with secondary fluorochrome-labeled antibodies and fluorochrome-labeled phalloidin in 1% BSA/TBS at 25°C for 1 h.\nNote: Please refer to the key resources table[href=https://www.wicell.org#key-resources-table] for the recommended antibodies. Dilute the Alexa Fluor 647-conjugated anti-rabbit IgG and Alexa Fluor 488-conjugated anti-rabbit IgG at 1:400. For rhodamine-labelled phalloidin, dilute at 1:1000.\nWash the cells 3 times with TBS.\nSoak the cells in TBS containing 0.02% (w/v) NaN3.\nObserve cells under a confocal microscope.\nRac1 activity measurement\nNote: Because Rac1 was enriched in the missing in metastasis (MIM)-induced l-EVs, we describe this measurement (Nishimura et al., 2021[href=https://www.wicell.org#bib8]). Rac1 activity in l-EVs was measured using Rac1/Cdc42 Activation Assay Kit (Merck) according to the manufacturer’s protocol with slight modifications as follows. https://www.merckmillipore.com/JP/en/product/Rac1-cdc42-Activation-Magnetic-Beads-Pulldown-Assay,MM_NF-17-10394?ReferrerURL=https%3A%2F%2Fwww.bing.com%2F#overview[href=https://www.merckmillipore.com/JP/en/product/Rac1-cdc42-Activation-Magnetic-Beads-Pulldown-Assay,MM_NF-17-10394?ReferrerURL=https%3A%2F%2Fwww.bing.com%2F#overview].\nLyse l-EVs prepared from 3.6×107 cells with 300 μL of lysis buffer (25 mM HEPES, pH 7.5, 150 mM NaCl, 1% Igepal CA-630, 10 mM MgCl2, 1 mM EDTA, and 2% glycerol containing protease inhibitors) on ice and then centrifuge at 14,000 × g for 5 min at 4°C.\nTransfer the supernatant to GST-PAK1-PBD-conjugated resin (bed volume: 10 μL) and rotate at 4°C for 45 min.\nWash 3 times with 0.5 mL of lysis buffer and analyze the protein bound to resin by immunoblotting.\nNote: Only GTP-bound active form of Rac1, but not GDP-bound inactive form, can bind to the GST-PAK1-PBD-conjugated resin."
  ],
  "subjectAreas": [
    "Cell Separation/Fractionation",
    "Antibody",
    "Cell Membrane",
    "Biotechnology And Bioengineering",
    "Cell Culture",
    "Signal Transduction",
    "Molecular Biology",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}