{
  "id": 13691,
  "origin_website": "Jove",
  "title": "Isolation and Culture of Adult Zebrafish Brain-derived Neurospheres",
  "procedures": [
    "Zebrafish of the WTCF strain were raised and maintained according to protocols approved by the Yale University Institutional Animal Care and Use Committee (IACUC protocol number 2012-11473). All experiments should first be approved by all relevant governmental and institutional ethics regulating bodies regarding the use of animals for research purposes.\n1. Preparations\nPrepare 10 ml of dissection medium, add 200 µl of 100x penicillin-streptomycin into 9.8 ml of DMEM/F12.\nPrepare L-Cysteine solution: to 10 ml of water for tissue culture, add 120 mg of L-cysteine. Store the L-cysteine solution at 4 °C for up to 2 weeks, or in aliquots at -20 °C for up to 1 year.\nPrepare DNase I solution: to 1 ml of water for tissue culture, add 10 mg of DNase I. Store the DNase I solution at 4 °C for up to 2 months.\nPrepare papain solution: to prepare papain solution, add 100 µl papain (approximately 140 units), 100 µl DNase I (1%) and 200 µl L-cysteine (12 mg/ml) into 5 mL of DMEM/F12. Freshly prepare the papain solution every time and sterilize with a 0.22 µm pore size filter before use.\nPrepare washing solution: to prepare 100 ml of washing solution, add 650 µl glucose 45%, 500 µL HEPES 1 M and 5 ml FBS into 93.85 ml DPBS 1x. Sterilize the washing solution with a 0.22 µm pore size filter before use. Store the washing solution at 4 °C for up to 2 months.\nPrepare insulin solution: to prepare 2 ml of insulin solution, add a 25 µl drop of 10 N NaOH and 100 mg insulin into 2 ml of water for tissue culture.\nPrepare EGF and FGF solutions: Dissolve both mitogens in DMEM/F12 at 100 µg/ml concentration. Store as 10 µl aliquots at -20 °C.",
    "Prepare B-27 and N-2 media: store B-27 and N-2 supplements at -20 °C as 500 µl and 1 ml aliquots, respectively.\nPrepare Z-differentiation condition medium: to prepare 100 ml of Z-differentiation condition medium, add 40 µl insulin (50 mg/ml), 500 µl B-27, 1 ml N-2, 650 µl glucose 45% and 1 ml of 100 x penicillin-streptomycin into 97.81 ml of DMEM/F12. Sterilize the Z-differentiation condition medium with a 0.22 µm pore size filter before use. Store the Z-differentiation condition medium at 4 °C for up to 1 week.\nPrepare Z-condition medium: to prepare 50 ml of Z-condition media, add 10 µl of EGF and 10 µl of FGF into 50 ml of sterile Z-differentiation condition medium (20 ng/ml). Store the Z-condition medium at 4 °C for up to 1 week.\nPrepare coating solution for differentiation culture: for 5 ml extracellular coating solution, add 100 µl of the extracellular matrix solution (e.g., Matrigel) into 4.9 ml of DMEM/F12. Thaw extracellular matrix solution at 4 °C on ice. Once defrosted, keep at 4 °C for up to 2 weeks.\n2. Dissection of the Adult Zebrafish Brain\nPrepare a dissection bed by filling a 100 mm x 15 mm Petri dish with gel ice packs. Then place the lid on the petri dish and incubate at -20 °C until the gel freezes. On top of the lid place a square of clean filter paper and wrap both the filter paper and petri dish with plastic film.\nClean and sterilize all the microdissection instruments by 70% ethanol or heat before each use. Place all sterilized dissection instruments near the dissecting microscope and, right before euthanasia, place the dissection bed under the microscope with optical fiber illumination.",
    "Collect 2 adult zebrafish for a whole brain neurosphere preparation; and 3 to 4 zebrafish to generate neurospheres from dissected brain regions.\nEuthanize adult zebrafish (8-12 months old) using a protocol approved by the Institutional Animal Care and Use Committee. Next, immerse the fish in 75% ethanol for 5-10 sec and quickly place in the dissection bed followed by decapitation at the level of the gills using a surgical blade.\n\t\nTo euthanize animals, administer an overdose (300 mg/L) of tricaine methanesulfonate until the animal's heart-beat gradually slows down and circulation stops, then immerse in iced water.\nTurn the head dorsal side down, and using the scissors make a longitudinal cut from the cut side to the mouth. Using the forceps expose the base of the skull and remove all the adjacent tissue. Cut the lateral walls of the skull from the beginning of the spinal cord towards the tectum.\nUsing the scissors, cut and remove the optic nerves and then remove both sides of the most lateral part of the skull at the level of the tectum. Turn the head ventral side up. Using forceps, peel off the rest of the most apical part of the skull.\nTransfer the brain along with the remaining part of the skull into a new dish with the dissection medium (1.1). Clean the brain tissue in the dissection medium using the micro knife's plastic handle, keeping all brain structures intact.\nFrom this point, continue the protocol using the whole zebrafish brain.\n\t\nAlternatively adapt this protocol to specific brain regions to generate neurospheres from whole zebrafish brain or from the telencephalon, tectum/diencephalon or cerebellum dissected with a fresh scalpel. Use a neural specific fluorescent zebrafish neural transgenic line to dissect the brain region of interest according to Figure 3 and reference 11.",
    "3. Single Cell Dissociation of Adult Brain\nPerform all subsequent work in a biological safety cabinet. Transfer the brain tissue into a 1.5 ml tube containing 800 µl of dissection medium (prepared in step 1.1). Remove the dissection medium by pipetting, without touching the brain tissue.\nAdd 500 µl of papain solution (step 1.4) and digest the brain tissue at 37 °C for 10 min. Do not incubate longer than 15 min as it could decrease cell viability.\nAfter incubation, transfer the brain tissue with 500 µl of the papain solution into a 15 ml conical tube using a 1,000 µl pipet tip cut at ~0.25 inches from the bottom. Gently dissociate the brain tissue by slowly pipetting up and down 10 times with the same tip. Do not pipet up and down more than 15 times and do not generate air bubbles during this step, as it could alter cell viability.\nIncubate the brain tissue again at 37 °C for 10 min followed by pipetting up and down 10-13 times using an uncut 1,000 µl regular tip. Do not pipet up and down more than 15 times, to avoid cell death.\nStop the enzymatic digestion by adding 2 ml of washing solution (step 1.5), and centrifuge the cell suspension at 800 x g for 5 min at room temperature (RT). Carefully decant the supernatant and resuspend the pellet in the remaining solution by tapping the tube vigorously with a finger and then by pipetting up and down with a 1,000 µl regular tip. Next, add 2 ml of washing solution.",
    "At this stage, check under the microscope that a single cell suspension has been obtained. Centrifuge the cell suspension again at 800 x g for 5 min at RT. Remove the supernatant and re-suspend the pellet using 1 ml of fresh Z-condition medium (step 1.10).\nStain cells by using trypan blue12 and count the living cells using a hemocytometer by excluding blue dead cells. Prepare a 24-well plate with 200 µl of cell suspension and 300 µl of fresh Z-condition medium in each well. Seed cells at a density of ~500 cells/µl. Maintain cultured cells in an incubator at 30 °C in 5% CO2, since zebrafish brain-derived neurospheres do not grow well at 37 °C.\n4. Generation of Primary Neurospheres\nAfter 1 day in vitro (DiV1), observe the single cell suspension obtained from the adult whole brain under the microscope and note whether debris has accumulated in the center of the well. Carefully remove any debris by pipetting approximately 100 µl of medium (less if possible). Next add 100 µl of fresh Z-condition medium. Single cell suspensions should be observed at this time (Figure 2A DiV1).\nAfter 2 days in vitro (DiV2), expand the cultured cells. Using a 1,000 µl pipette with the tip cut, collect and transfer 250 µl of cell suspension from each well into a new well. Add 250 µl of fresh Z-condition medium into all wells. Before expanding the cultured cells, homogenize the suspension very gently by pipetting up and down throughout the well.\nRepeat steps 4.1 and 4.2 for the following 4 days in vitro (DiV4). A progressive increase in size of neurospheres should be visible at the center and edges of the well at DiV3 and DiV4 (Figure 2B and C).",
    "Note: Primary neurospheres can be processed for passage or differentiation to assess multipotency. Alternatively, they can be processed for nucleofection or lipo-transfection11 to characterize the role of specific genes during the differentiation process.\n5. Passaging of Primary Neurospheres\nRemove 250 μl of tissue culture from each well and mechanically dissociate DiV4 neurospheres with a 1 ml pipette. Do not pipet up and down too rapidly as air bubble formation may increased cell death.\nCount the cells with a hemocytometer and distribute 800 cells/µl in 250 µl of primary culture supernatant into each well of a 24-well plate.\nAdd 250 µl of Z-condition medium to each well.\nAfter 2 days in vitro (DiV2), expand the cultured cells as reported in step 4.2 and 4.3.\n6. Differentiation of Primary Neurospheres\nSterilize cover glasses by immersion in 70% ethanol for 10 min, then dry cover glasses at RT by placing them into each well of a 12-well plate.\nAdd 300 µl of extracellular coating solution (step 1.11) at the center of the cover glass in such a way that it can expand widely and cover the entire cover glass. Then, incubate at 37 °C for 1 h (using the humidified cell culture incubator).\nRemove the extracellular coating solution after incubation, and dry the cover glass for 2 hr at 37 °C.\nRemove 250 µl of tissue culture from each well. Mechanically dissociate all the DiV4 primary neurospheres per well with a 1 ml pipette (with wider-end tip) by pipetting up and down.",
    "Seed dissociated neurosphere cell suspensions at a cell density of 4 x 103 cells/ml on previously prepared extracellular matrix-coated coverglasses (step 6.1-6.3) and keep for at least 30 min, at 30 °C in 5% CO2, until attached to the substrate. Then, remove the culture medium and rapidly add 1 ml of pre-warmed fresh Z-differentiation condition medium (step 1.9) before culturing the cells for 24 hr at 30 °C in 5% CO2.\nEvery two days, replace half of the Z-differentiation condition medium during the time of cell differentation.\n7. Gene Manipulation of Primary Neurospheres\nCollect DiV3-4 primary neurospheres (step 4.3) by centrifuging for 8 min at 80 x g at 4 °C. Prepare for liposome transfection of commercial oligonucleoatides as previouly described11 or nucleo-transfection of DNA plasmid vectors.\nResuspend neurosphere pellet at a cell density of 4 x 103 cells/μl in 100 μl of a reaction mixture (82 μl nucleofactor solution and 18 μl of supplement).\nMix the neurosphere suspension with 5 μl of the DNA plasmid vectors of choice (plasmid stocks at 1 μg/μl). Transfer the neurosphere/DNA mixture into a nucleofector cuvette for nucleotransfection and select nucleofector program according to the manufacturer's instructions provided by the nucleofector kit.\nImmediately after nucleofection, add a volume of 500 ml of pre-warmed Z-condition media (1.10) to the cells and plate the transfected neurospheres for studying their cell renewal and/or differentiation properties, as described above.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}