{
  "id": 7075,
  "origin_website": "Bio",
  "title": "Establishing an Adult Mouse Brain Hippocampal Organotypic Slice Culture System that Allows for Tracing and Pharmacological Manipulation of <em>ex vivo</em> Neurogenesis",
  "procedures": [
    "Preparation of slicesFor EdU label tracing studies, inject a 6-8-week old C57/Bl6N mouse i.p. with 100 µl EdU (10 mg/ml). To increase number of labeled cells, we injected EdU twice: 4 h and 2 h before sacrifice.Prepare 4% low melting agarose in 1x PBS and keep it in a water bath at 37 °C until use.Sacrifice the animal by exposing it to rising concentrations of CO2.Isolate brain rapidly and transfer it into 2 ml serum-free dissection buffer (Kim et al., 2013) in a 7 ml tube on ice. Allow brain to equilibrate for at least 5 min.Prepare for sectioning (Figure 1A): Transfer brain into a 10 cm Petri dish (Figure 1B), remove cerebellum and brainstem with a scalpel (Figure 1C) and cut along the midline of the brain (Figure 1D). According to the instructions provided in Kleine Borgmann et al. (2013) place hemispheres on the cut surface (Figure 1E) and remove a small part of the cerebral cortex cutting from dorsolateral to ventromedial at an angle of approximately 70° (Figures 1F, 1G). Flip the hemispheres onto these new cut surfaces and place them into an embedding mold on ice. Gently fill the mold with 4% low melting agarose and wait till it solidifies (Figure 1H). Trim the agarose block using a scalpel and glue it onto a vibratome tissue platform using super glue (Figure 1I). Hemispheres can be embedded, glued and cut separately or in parallel. We obtained the best results by cutting them in parallel oriented in a lateral-to-medial direction (i.e., the lateral part facing the vibratome and being cut first).Transfer platform into the vibratome tissue container filled with chilled dissection buffer. To keep the temperature low, cover the container with ice (if possible) or store it on ice if not in use.",
    "Cut 300 µm thick sections using high frequency (level 7-8) and low speed (level 1-2).Carefully transfer sections containing the hippocampus into a 10 cm Petri dish containing 4-5 ml dissection buffer on ice using a brush and spatula (Figure 1J). Note examples of a well cut section with preserved brain cyto-architecture (Figure 1K) and a badly sectioned slice (Figure 1L). We did not trim the sections as we did not find any discernable difference in long term viability between trimming them so that they only contain the hippocampus and entorhinal cortex or culturing the entire sections.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3869/bioprotoc-11-01-3869-g001.jpgFigure 1. Dissection procedure. (A) Schematic representation of brain sectioning. Panels B-L show photographs of the key steps, as follows. Place the brain in a Petri dish (B). Having cut away cerebellum and brainstem (C), bisect brain along the midline (D). Place hemispheres onto the new cut surfaces (E) and cut off a small part of the cerebral cortex in a dorsolateral to ventromedial direction at an angle of 70° (F). Flip onto the newest cut surface (G), embed in 4% low melting agarose (H), glue the block onto a tissue platform (I) and section hemispheres using a vibratome. Collect slices in a 10 cm Petri dish (J). Representative pictures of a well-cut slice suitable for culturing (K) and of a badly cut slice (L).Slice cultureBefore sacrificing the animal, place the required amount of Millicell inserts into 6-well-plate wells.Prepare stock solutions. Dissolve Indomethacin in DMSO to obtain a 100 mM stock solution. Dissolve drugs in DMSO or medium.Add 1 ml serum-free culture medium (Kim et al., 2013) containing Indomethacin and inhibitor (or solvent control) per well. Work in a tissue culture hood. Equilibrate at 37 °C and 5% CO2 for one to two hours in a standard cell culture incubator.",
    "Add a small drop of culture medium (approx. 50 µl) from the well onto the insert using a standard 200 µl pipette to facilitate transfer of the sections. Using a brush and spatula transfer the vibratome sections from chilled dissection medium onto the Millicell inserts so that they are at the air/liquid-interface. Culture 2-3 sections per insert at 37 °C and 5% CO2.On the next day, remove the culture medium containing inhibitors or solvent control completely using a 1 ml pipette. Keep the insert in the well and carefully raise it on one side using a pipette tip or forceps to allow for the removal of residual medium. Replace immediately with 1 ml of fresh medium (containing inhibitors) carefully pipetted into the well so that the sections on the insert are once again at the air/liquid interface. Repeat every other day.FixationFix slices by removing the culture medium and adding 1 ml 3.7% formaldehyde in PBS into the well and an additional 1 ml carefully on top of the slices. Fix for 1 h at ambient temperature.Wash slices 3x 20 min in PBS.Store the fixed slices in PBS at 4 °C or proceed with immuno-histochemistry.Note: Slices may detach from the membrane during fixation. This does not affect further steps. Immuno-histochemistryUse forceps, scissors or a scalpel to cut the Millicell insert membrane from the plastic ring.For EdU detection, transfer all slices from the same animal and condition (on the membrane or free-floating) into a 12-well-plate well and permeabilize them in PBS containing 0.1% Triton X100/0.1 M glycine. Block slices for 2 h in PBS containg 3% BSA.",
    "Incubate slices with 300 µl Click-iT reaction cocktail prepared according to the manufacturer’s instructions (Thermo Fisher Scientific Click-iT® EdU Alexa Fluor® 647 Imaging Kit, chapter EdU detection) at room temperature on a rocker for 3 h. For this and all subsequent steps protect the plate from light (e.g., by covering it with tin foil).Block slices in 10% normal goat serum in PBS containing 0.5% Triton X100 overnight at 4 °C.Prepare primary antibodies in blocking buffer (400 µl per well). Incubate slices at 4 °C on a rocker for 48 h. In our experiments, we used rabbit-anti Ki67 (1:250) to visualize proliferating cells, mouse-anti-NeuN (1:300) as a marker for neurons, and guinea pig-anti Dcx (1:300) to label neuroblasts and immature neuronsWash slices 3x 1 h in PBS.Incubate slices with secondary antibodies (1:500 in blocking buffer) on a rocker at 4 °C over night.Remove secondary antibodies, add 400 µl Hoechst33258 (in water; 5 µg/ml) per well and incubate for 30 min.Wash slices 3x 1 h in PBS.Using forceps, transfer membranes (slices facing upwards) onto microscope slides or, in case of detached slices, use a brush and spatula.Place the slices in the center of the slide. Add 200 µl Fluoromount-G onto the slices and gently apply a coverslip (e.g., 24 x 50 mm). Be careful not to squeeze the slices as they are extremely thick. Dry at 4 °C.ImagingImage slices using a confocal microscope. We employed a Leica  SP8  confocal microscope and a 20x objective and imaged a 30-50 µm thick stack in the middle of the 300 µm thick slice."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}