{
  "id": 9492,
  "origin_website": "Jove",
  "title": "The Dig Task: A Simple Scent Discrimination Reveals Deficits Following Frontal Brain Damage",
  "procedures": [
    "1. Materials Required for Training and Testing\nTesting chamber. Any container large enough to accommodate one animal and two scent cups. Our laboratory utilized modified operant chambers (Med Associates Inc.) with floor bars removed to make space for scent cups (Figure 1).\nScent cups and cup holder. Cups sufficiently wide and deep to allow for digging and some mechanism/holder to stabilize them (Figure 2).\nScented sands. Our testing protocol used scents previously established to not show response bias in rats (cocoa, basil, cumin, coffee)4. Each scented sand was mixed at a ratio of 1 g odorant to 110 g unscented, clean playground \"sand box\" sand and can be stored in airtight containers for up to 6 months.\nReinforcer. We utilized fruit loop cereal pieces as a reinforcer. We recommend exposing animals to the reinforcer (via placement in their home cages) 3 to 5 days prior to training to overcome neophobic responses.\nStop watch or timer.\n2. Animal Handling Prior to Training\nHandling. As animals will be placed in and removed from the chambers repeatedly throughout training/testing, we recommend handling animals three to five days prior to training in order to familiarize them with human contact.\nMotivating. In order to motivate animals to perform on this task, some level of food deprivation is necessary. Food restriction should be initiated at least three days prior to both training and testing and animals may be maintained at 90% of free-feeding weight. Typically amounts of 15-20 g of chow per day are sufficient, but animal weights should be checked every other day while food restricting.\n3. Dig Training",
    "Training an animal to dig in sand can be accomplished in an average of eight sessions over a four day period of time. During dig training, the chamber should be set up by placing two scent cups into the mechanism/holder and placing the scent cup setup into the chamber. The general procedure is detailed below with the goal of shaping the animal from consuming the reinforcer to completely digging in sand to retrieve it.\nSession 1 - chamber habituation and magazine training. Completely fill the scent cups with the reinforcer (no sand). Place the animal into the apparatus for 30 min allowing the animal to freely consume the reinforcer.\nSession 2 - sand habituation. Completely fill the scent cups with the reinforcer and pour a small amount of unscented sand into each cup, filling no more than half of the cup. Place the animal into the apparatus for 30 min allowing the animal to freely consume the reinforcer.\nSession 3 - surface digging. Fill the scent cups with an even mixture of reinforcer and unscented sand, leaving multiple reinforcers exposed. Place the animal into the apparatus for 30 min allowing the animal to freely consume the reinforcer. In the process of consuming the exposed reinforcers, the animal should uncover additional reinforcers below the surface of the sand. The animal should shift from using its mouth to using its forepaws to remove each reinforcer from the sand.",
    "Session 4 - digging. Fill the scent cups with a mixture of 1 part reinforcer to 3 parts unscented sand, leaving 1-2 reinforcers exposed. Place the animal into the chamber for 30 min allowing the animal to freely consume the reinforcer. The animal should begin to dig with its forepaws to uncover additional reinforcers and remove them from the sand. Animals that do not begin to uncover the reinforcer after a 10 min period of time should be assisted (the researcher should uncover one reinforcer at a time until the animal learns).\nSession 5 - full digging. Fill the scent cups with a mixture of 1 part reinforcer to 3 parts unscented sand, leaving no reinforcers exposed. Place the animal into the apparatus for 30 min allowing the animal to freely consume the reinforcer. Animals should be assisted as needed. Some animals may need multiple instances of this session in order to demonstrate digging behavior.\nSession 6 - trial structure habituation. Place three reinforcers in deep, middle, and shallow positions in the sand in each scent cup. Place the animal into the chamber until all three are retrieved from each cup, assisting as needed. Once all have been retrieved, place the animal into a holding apparatus for 15-30 sec and reset the scent cups as described in this step. Then, place the animal back into the chamber and repeat the process until the animal has completed four total trials. The animal should become habituated to being placed in the holding apparatus and start digging immediately when placed into the chamber. The animal should also demonstrate full digging behavior and retrieve the reinforcer at the bottom of the scent cup.",
    "Session 7 - single reinforcers. Place a single reinforcer at half of the depth of the sand in each cup. Place the animal into the chamber and allow it to retrieve both reinforcers, and then place it into the holding apparatus for 30 sec. Repeat this process for four total trials. The animal should begin to dig faster and require minimal assistance from the researcher.\nSession 8 - mock discrimination testing. Fill cups as described in session 7. Give the animal 30 sec to retrieve both reinforcers. Place the animal into the holding apparatus when both have been retrieved or 30 sec has elapsed. Repeat this for the number of trials that will be used in the testing phase. Animals should learn to dig rapidly when placed back into the chamber.\nAdditional sessions. Depending on initial discrimination testing, the experimenter may wish to perform additional sessions to familiarize the animal with the given scents. Rats will tend to initially exhibit neophobia and prefer the familiar scents previously associated with reinforcement10.\n4. Discrimination Testing\nThe researcher should choose a scent pairing, including which scent will be baited with the reinforcer (correct discrimination) and which will not. Additional decisions, such as number of discriminations and reversals, maximum number of days and trials, and whether to pretest prior to injury will be largely based on experimental question (see additional notes below).\nRats can be tested and data recorded by hand by the researcher. The researcher should record for each trial: correct or incorrect choice, latency to initiate digging, and trials in which a rat times out on.\n\t\nThe number of trials administered should be at the discretion of the researcher (see additional notes below).\nThe length of the trial should be at the discretion of the researcher (see additional notes below).",
    "The researcher should randomize the trial structure (left-right location of the scent cups), with the caveat that no more than three trials in a row are on a given side. This will help reduce side bias.\nIn order to initiate each trial, place the animal into the chamber facing the rear, equidistant from each cup. Placing an animal closer to one cup may increase the chance of developing a bias.\nIf the animal correctly discriminates, allow it to retrieve and consume the reinforcer, and then remove it to the holding apparatus for 30 sec. If it times out or chooses incorrectly, remove it immediately, before it \"corrects\" itself, and place it into the holding apparatus for 30 sec.\nRepeat this process for the chosen number of trials.\nOnce an animal achieves a pre-determined criterion (i.e. > 80% accuracy per day for three consecutive days), the animal may move on to the next discrimination/reversal and repeat the above process.\n5. Additional Notes\nTesting in our laboratory found that training and testing work best using one-half of a fruit loop cereal piece to avoid satiation.\nDuring training, some animals may need more help than others. We recommend doing what is necessary to achieve digging behavior. However, once testing starts, we never attempt to intervene and improve a rat's digging behavior.\nVarying the total number of trials may be sufficient for different labs. Testing in our laboratory have used 6, 8, and 12 trials per session, 1 session per day, and have found a preference for the 8 trial setup.\nVarying the length of the trial may be necessary in some experimental setups (e.g., animals under a stress paradigm may need increased trial times or fewer total trials).",
    "A preset criterion should be used in order to determine when an animal has mastered a discrimination. Testing in our laboratory have required an accuracy of greater than 80% (5/6 trials, 7/8 trials, or 10/12 trials) per day for 3 consecutive days. However, a higher criterion (85%) could also be used.\nPreset thresholds/maximums should be used for the maximum number of days spent on a given scent. This will be largely dictated by research question. For example, our laboratory studies TBI and, as of result of the progressive nature of TBI, rats that have not hit criterion are moved on to a novel discrimination/reversal after 12 days of testing.\nDeciding whether to pretest or just posttest is a question that is largely determined by experimental direction. Pretesting allows one to perform a memory assessment on the animal post injury, which may be relevant depending on the injury type. However, post testing allows one to examine differences in acquisition rate on the discriminations between groups. Our laboratory has and will continue to use both."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}