{
  "id": 5231,
  "origin_website": "Bio",
  "title": "Hydrogen Peroxide Measurement in <em>Arabidopsis</em> Root Tissue Using Amplex Red",
  "procedures": [
    "A graphical overview of the different protocol steps starting with sample preparation and finishing with resorufin detection is provided in Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161101/20161101005125_0291.jpgFigure 1. A graphical overview of the different protocol steps for H2O2 measurement describing the preparation of samples, H2O2 standards and negative controls, which are color coded depending on their identity. The same color code is used for the plate setup in Figure 3.Plant extract preparation for H2O2 content measurementGrow Arabidopsis plants to the desired age under the desired growth conditions.In our case, Arabidopsis seeds were surface sterilized as described previously (Lingam et al., 2011). The seeds were incubated for 8 min in sterilization solution (see Recipes) at room temperature on a tube rotator and subsequently washed five times with sterile distilled water. After the fifth wash, the seeds were stored in 0.1% plant agar for 1-2 days in the dark at 4 °C for stratification. Note: Do not incubate the seeds in the sterilization solution for longer than 8 min since this can lead to a reduced seed viability.Seeds were plated out and germinated on upright Hoagland medium agar plates (see Recipes). Seedlings were grown under long-day conditions (16 h light/21 °C and 8 h dark/19 °C) for 5, 7, 8 and 10 days before harvesting (an example of plates with 10-day-old seedlings is shown in Figure 2). Roots were separated from the shoot directly on the agar plate on which the plants were growing (in order to avoid drying of the roots) and quickly collected into a bunch. The bunch of roots was then very briefly (for a second) and gently laid on a Kimtech precision paper to remove excess moisture before freezing it in liquid nitrogen.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161101/20161101005319_2525.jpgFigure 2. Example of wild-type Arabidopsis plants (Col-0) grown on upright Hoagland medium agar plates for 10 days.",
    "The plants were either grown continuously on sufficient (left) or deficient (right) Fe supply. Scale bars = 1 cm.Grind frozen roots with mortar and pestle in liquid nitrogen.Collect the frozen tissue powder in pre-cooled 2 ml microcentrifuge tubes and weigh the samples on analytical scales.Add 200 µl of ice-cold phosphate buffer (see Recipes) to 30 mg of tissue powder and resuspend on ice. If the amount of powder differs adjust the buffer volume accordingly. For example, for 15 mg powder add 100 µl of phosphate buffer. In order to avoid plant material loss due to sticking to pipet tips we do not resuspend the powder by pipetting up and down. Rather, we let the samples on ice, with the added buffer, for not more than a minute under the powder is well soaked. Afterwards, we flip the microcentrifuge tubes until the suspension appears homogenous.Note: The minimal amount of root powder that we have been able to use successfully has been 15 mg, which in our growth conditions corresponded to approx. 25 10-day-old seedlings.Centrifuge for 3 min at 16,200 x g (corresponds to 13,000 rpm in the centrifuge suggested in Equipment), 4 °C. Transfer the supernatant to a new pre-cooled microcentrifuge tube. This is the sample that will be used for the H2O2 assay (see Figure 3A for an example of sample identity). Keep the samples on ice and proceed, at best, immediately with the H2O2 measurement. We do not have data on how stable the H2O2 in the obtained extracts is. H2O2 measurementPrepare 10 mM Amplex® Red reagent stock solution, 1x reaction buffer (0.05 M sodium phosphate buffer, pH 7.4), 10 U/ml horseradish peroxidase (HRP) stock solution, and 20 mM H2O2 working solution according to the instructions provided with the Amplex® Red Hydrogen Peroxide/Peroxidase Assay Kit.",
    "Notes: The Amplex® Red reagent is air and light sensitive. The 1x reaction buffer is stable at room temperature. The HRP stock solution should be aliquoted and kept at -20 °C. The 20 mM H2O2 working solution is stable only for a few hours and should, therefore, be prepared fresh every time.The manufacturer’s protocol of the Amplex® Red Hydrogen Peroxide/Peroxidase Assay Kit recommends to perform the H2O2 assay in a 100 µl total volume per reaction. We were able to successfully perform the assay with half the volume (50 µl). Therefore, the following protocol is based on a 50 µl reaction volume. Prepare an H2O2 standard curve by diluting the respective amount of 20 mM H2O2 working solution with 1x reaction buffer to obtain H2O2 standards of 0 to 10 µM, in 25 µl each. The final H2O2 concentration per reaction will be two-fold lower (e.g., 0 to 5 µM). Notes: The 0 µM H2O2 standard is one of the important negative controls that shows the background fluorescence coming from the mixture of Amplex® Red reagent and HRP in 1x reaction buffer in the absence of H2O2 (see negative control ‘No H2O2’ in Figure 3B).In our case, we used standards with the following final concentration – 0, 1, 2, 3, 4, and 5 µM H2O2 (see the loading scheme in Figure 3C). Prepare additional negative controls. A negative control ‘Amplex® Red background’ (see control A in Figure 3B) contains only Amplex® Red reagent in 1x reaction buffer and is needed in order to monitor the background fluorescence/absorbance of the Amplex® Red reagent itself. Another negative control, termed here ‘Sample background’ (see control C in Figure 3B) is prepared for each H2O2 extract and contains the extract in 1x reaction buffer together with the HRP enzyme but without Amplex® Red reagent.",
    "This control allows to monitor the individual sample background that could come from the presence of plant compounds that could potentially serve as substrates for HRP, mimicking resorufin production. Pipet 25 µl of the H2O2 standards, the controls, and the samples (from step A5) into a microtiter plate.Note: In our case, we did not have to dilute the samples with 1x reaction buffer prior to the assay. However, it may be necessary to prepare serial dilutions of the sample in order to determine the optimal sample amount per assay. As stated in the manual of the Amplex® Red Hydrogen Peroxide/Peroxidase Assay Kit, high H2O2 levels may lead to lower fluorescence being detected due to the ability of the excess H2O2 to oxidize resorufin (the fluorescent reaction product) to the nonfluorescent resazurin.Prepare a working solution of 100 µM Amplex® Red reagent and 0.2 U/ml horseradish peroxidase using the solutions from step B1 (see Table 1), in a light-protected tube (e.g., wrapped in aluminum foil).Table 1. Working solution composition. Exemplary calculation for 2.5 ml solution, sufficient for approx. 100 assays.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161101/20161101231225_5712.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20161101/20161101010447_4633.jpgFigure 3. An example of samples, necessary controls and standards, and a plate setup. A. An example of sample identity. In this case, wild-type Arabidopsis plants (WT) were grown for 10 days on sufficient (+Fe) or deficient (-Fe) supply in three biological replicates (1 to 3). The H2O2-containing root extracts from these plants were used for the negative controls ‘Sample background’ (C1 to C6) and as samples (S1 to S6). B. A composition summary of the necessary negative controls, samples and standards. C. An example of a plate setup in a 96-well microtiter plate. Each control, sample or standard was pipetted in two technical replicates.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161101/20161101010541_5330.jpgFigure 4. Example settings for the plate reader Infinite® M200 Pro for measuring resorufin fluorescence (A) and absorbance (B).",
    "Note that the Z-Position (optimal measuring height in a well) is calculated based on a well that is expected to contain a high amount of H2O2 and serves as a positive control. In this case, this is well E6 containing one of the two technical replicates of the 5 µM H2O2 standard as shown in the plate setup on Figure 3C.Begin the reaction by adding 25 µl of working solution to each microtiter-plate well containing the H2O2 standards, the controls, and the samples (pipetted in advance in step B4). See also Note 4.Incubate the reactions at room temperature for 30 min in the dark. Note: Since the assay is continuous, the reaction kinetics can be followed by performing measurements at several time points.Detect resorufin production using a plate reader by measuring either the fluorescence (excitation at 530-560 nm, emission at 590 nm) or the absorbance at 560 nm (see Figure 4 for example settings). See Note 5."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}