{
  "id": 2940,
  "origin_website": "Cell",
  "title": "Cell-free reconstitution of peroxisomal matrix protein import using Xenopus egg extract",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nInducing ovulation\nTiming: 2 h\nEgg extract is prepared from freshly harvested eggs on the day of the experiment. To trigger egg laying, primed frogs must be injected the day before with a high dose of gonadotropin.\nSee frog priming and ovulation[href=https://www.wicell.org#sec2.2] for a list of required materials.\nOne day before the experiment, induce ovulation by injecting 500 units of human chorionic gonadotropin (HCG) into the dorsal lymph sacs of each primed frog, using a fine 27-gauge hypodermic needle and sterile 1-mL syringe (Figure 1[href=https://www.wicell.org#fig1]A).\nNote: To improve egg yield, frogs should be injected between 16–24 h before egg extract preparation.\nCritical: Discard used needles in an appropriate sharps-collection container.\nTransfer each frog into 2 L of 1× MMR buffer and house overnight at 16°C in separate containers.\nNote: MMR buffer46[href=https://www.wicell.org#bib46] improves the quality of the eggs and helps prevent premature activation of the eggs before they can be collected.47[href=https://www.wicell.org#bib47] Please see the next section on preparation of egg extract for more information.\nCritical: Frogs should not be maintained in MMR buffer for longer than 16 h to avoid osmotic stress. If a longer ovulation period is desired, frogs should be injected earlier in the day and maintained in conditioned water before being transferred into MMR later in the day.\nPreparation of egg extract\nTiming: 2 h",
    "Egg extract corresponds to frog egg cytoplasm, and is generated by quickly crushing the eggs by centrifugation. It is imperative to lock the extract in interphase of the cell cycle for the import reactions to work, because peroxisomal matrix protein import is turned off during cell division by mitotic cyclin-dependent kinases.48[href=https://www.wicell.org#bib48] Freshly harvested eggs are arrested in metaphase,49[href=https://www.wicell.org#bib49] but progress into interphase upon being crushed because of the influx of calcium from residual buffer used for harvesting. Extract can be locked in interphase by the addition of cycloheximide,37[href=https://www.wicell.org#bib37] which prevents the synthesis of cyclins needed to enter the next cell cycle.\nSee preparation of egg extract[href=https://www.wicell.org#sec2.6] for a list of required materials.\nThe following morning, transfer the frogs to a new container filled with at least 4 L of conditioned water per frog.\nNote: Frogs may be housed together in a sufficiently large container. The frogs should complete ovulation for an additional 24 h at 16°C, and any additional eggs laid during this time should be discarded. The frogs should then be allowed to recover for 3–4 months, according to institutional protocols, before being reused for ovulation.\nCritical: The recovery period is essential to avoid harming the frogs' reproductive system.\nCarefully decant the eggs into a round glass dish, beaker, or other suitable container.\nExamine the eggs, and use a 2-mL transfer pipet to remove any that look malformed or damaged.\nNote: Healthy eggs look spherical, are enclosed in a transparent jelly coat, and have one hemisphere colored white (the vegetal pole) and the other dark (the animal pole). Eggs that look uniformly white and swollen (i.e., puffy) should be discarded, as should eggs that are joined together (stringy) or are otherwise deformed or discolored (Figure 1[href=https://www.wicell.org#fig1]B).\nDejelly the eggs:",
    "Decant most of the buffer from the glass dish, leaving some to cover the eggs.\nPour in a third of the dejellying solution, and gently swirl the dish for 1–2 min.\nNote: Adding the dejellying solution in portions gradually changes the buffer composition and thereby reduces stress on the eggs.\nNote: Inclusion of cysteine (a mild reductant) in the dejellying solution helps disrupt the disulfide bonds between mucin molecules that hold the jelly coats together.50[href=https://www.wicell.org#bib50]\nDecant most of the buffer, and repeat with the next third of dejellying solution.\nDecant most of the buffer, and add the last third of dellying solution.\nSwirl the dish for 10–15 min, or until the eggs have shed their jelly coats.\nNote: The transparent jelly coats are difficult to see, but appear as a slightly refractive layer encasing the eggs. A better method for judging dejellying efficiency is to tilt the dish so that the eggs pile up on one side (Figure 1[href=https://www.wicell.org#fig1]C). Dejellied eggs pack tightly against each other without noticeable interstitial space.\nCritical: Dejellying should be complete within 10–15 min. If this step takes significantly longer (> 25–30 min), the prolonged exposure of the eggs to cysteine can compromise the quality of the extract. See problem 1[href=https://www.wicell.org#sec7.1] in the troubleshooting[href=https://www.wicell.org#troubleshooting] section for more information.\nDecant most of the buffer.\nPour in 200 mL of XBS buffer and swirl for 2 min.\nNote: Adding XBS buffer in portions gradually changes the buffer composition and thereby reduces stress on the eggs.\nDecant most of the buffer, and repeat three more times with additional XBS buffer.\nPour in the last 200 mL of XBS buffer.\nPack the eggs:\nAdd 1 mL of XBS buffer to a 5-mL thin-walled ultracentrifuge tube (Figure 3[href=https://www.wicell.org#fig3]A, left image).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2479-Fig3.jpg\nFigure 3. Fractionating eggs to produce a cytoplasmic extract",
    "(A) Transferring eggs to a thin-wall tube mounted in a test tube rack. A little buffer (∼1 mL) is first added to the tube, then eggs are dispensed from a transfer pipet. Note how the pipette is immersed in the buffer before expelling the eggs.\n(B) Scheme on top depicts the procedure for fractionating eggs. Step 1, eggs are transferred to a thin-wall tube as described above. Step 2, eggs are packed by low-speed centrifugation, then supplemented as shown. Step 3, packed eggs are crushed by high-speed centrifugation to produce a lipid layer on top, a straw-colored cytoplasmic fraction (i.e., the extract) in the middle, and a dark debris pellet on the bottom. Photographs show the actual appearance of the eggs after each step.\n(C) Tilt test to assess egg compaction. Properly packed eggs resist sliding when the tube is tilted. All scale bars represent 5 mm.\nCut off the tip of a 2-mL soft polypropylene transfer pipet.\nTilt the dish and collect the eggs along one side.\nCarefully scoop up some eggs using the prepared pipet and deposit in the tube.\nNote: To avoid disrupting the eggs by surface tension, immerse the transfer pipet in the buffer already in the bottom of the tube and dispense the eggs into the buffer (Figure 3[href=https://www.wicell.org#fig3]A, right image).\nRepeat until the tube is almost completely full with eggs (Figure 3[href=https://www.wicell.org#fig3]B, step 1).\nNote: Multiple tubes may be used to process more eggs. However, tubes should not be filled less than half-way to prevent collapse during centrifugation. If more tubes are necessary, the volume of eggs should be adjusted (by eye) to be similar in each tube.\nAspirate off most of the buffer covering the eggs.",
    "Centrifuge the tube at 16°C, first at 350 × g for 1 min, then at 1,200 × g for an additional minute (Figure 3[href=https://www.wicell.org#fig3]B, step 2).\nNote: Packing the eggs displaces most of the buffer that could otherwise dilute the final egg extract. Properly packed eggs should be tightly squeezed against each other but remain otherwise intact (Figure 3[href=https://www.wicell.org#fig3]B, step 2). They should also be fixed in place and not slide around when the tube is tilted (Figure 3[href=https://www.wicell.org#fig3]C).\nNote: Performing this step in two stages ensures optimal packing efficiency: the initial low-speed spin settles the eggs in the tube, while the second higher-speed spin compresses the eggs to fill most of the interstitial space. We start the centrifuge at 350 × g set for 2 min; after the first minute, we quickly increase the speed to 1,200 × g and let the run complete in the remaining time.\nCrush the eggs:\nAspirate off as much residual buffer as possible, taking care not to disrupt the packed eggs.\nEstimate the volume of packed eggs, and add an appropriate volume of the 1000× stock solution of protease inhibitors, cytochalasin, and cycloheximide.\nNote: The stock can be directly pipetted onto the top of the packed eggs (Figure 3[href=https://www.wicell.org#fig3]B, step 2).\nNote: Cytochalasin prevents actin polymerization and thereby decreases the viscosity of the extract to facilitate pipetting. Cycloheximide locks the extract in interphase, and is crucial for the import reactions to work because peroxisomal matrix protein import is inhibited during mitosis.48[href=https://www.wicell.org#bib48]\nCentrifuge the tubes in an SW 55 Ti swinging-bucket rotor for 15 min at 12,100 × g and 16°C, then place the tubes on ice (Figure 3[href=https://www.wicell.org#fig3]B, step 3).",
    "Note: The crush spin will separate the eggs' contents into three fractions: a yellow lipid-rich layer on top; a straw-colored cytoplasmic layer (the egg extract) in the middle; and a dark pellet on the bottom consisting of pigment granules, nuclei, and other dense debris (Figure 3[href=https://www.wicell.org#fig3]B, step 3).\nNote: If an SW 55 Ti swinging-bucket rotor is not available, the older SW 50.1 Ti rotor will also work.\nIsolate the cytoplasmic fraction (Figure 4[href=https://www.wicell.org#fig4]):\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2479-Fig4.jpg\nFigure 4. Removal of the cytoplasmic extract after fractionating eggs\n(A) Scheme depicting the procedure for isolating the cytoplasmic fraction (i.e., the extract) after fractionating eggs. Step 1, the tube is propped against the edge of the bench as shown, then pierced by a large-gauge needle just above the dark pellet on the bottom. Step 2, the cytoplasmic fraction is aspirated out while sweeping the needle from side to side.\n(B) Photographs illustrating a pierced tube before (left) and after (right) aspirating out the cytoplasmic fraction.\n(C) The resulting egg extract in a microfuge tube. All scale bars represent 5 mm.\nWipe one side of the tube with a kimwipe soaked in 100% ethanol to remove oils and other contaminants present on the outside.\nPierce the cleaned side of the tube with an 18-gauge beveled needle connected to a 1-mL syringe, just above the dark pellet on the bottom of the tube (Figure 4[href=https://www.wicell.org#fig4]A, step 1).\nCritical: The needle should be oriented with the beveled side facing up (i.e., toward the cytoplasmic fraction) to avoid aspirating the pellet underneath. For easy reference, the orientation of the needle can be marked on the outside of the syringe.\nCritical: Needles narrower than 18-gauge should NOT be used to avoid shearing organelles.",
    "Note: The tube wall is more easily pierced if the tube is propped vertically against the side of the bench (Figure 4[href=https://www.wicell.org#fig4]A, step 1).\nAspirate out the cytoplasmic layer by gently sweeping the needle from side to side while slowly pulling back the plunger (Figure 4[href=https://www.wicell.org#fig4]A, step 2).\nCritical: Pulling the plunger too fast generates shear forces in the needle that can disrupt peroxisomes and other organelles. A rate that fills a 1-mL syringe in 40–60 s is sufficient.\nNote: The sweeping motion allows the cytoplasmic fraction to be uniformly removed, and reduces the risk of forming a flowstream that could disrupt the fat layer on top or the pellet on the bottom, which should remain intact (Figure 4[href=https://www.wicell.org#fig4]B).\nSlowly expel the contents of the syringe into a microfuge tube on ice.\nRepeat for any remaining tubes.\nNote: We use a clean needle and syringe for each tube to avoid shearing organelles by repeated sliding of the plunger.\nCritical: Discard used needles in an appropriate sharps-collection container.\nAdd an appropriate volume of the 1000× stock solution of protease inhibitors, cytochalasin, and cycloheximide to each microfuge tube, and mix by inversion.\nCollect the extract on the bottom of the tube using a touchspin centrifuge, and keep on ice (Figure 4[href=https://www.wicell.org#fig4]C).\nNote: If the extract is significantly contaminated by debris from the pellet (i.e., the extract looks gray instead of straw-colored), it can be clarified by centrifugation. Spin the tube for 5 min at 10,000 × g and 4°C to sediment the debris, then transfer the supernatant to a new microfuge tube on ice using a wide-bore pipette tip.\nCritical: Egg extract should be used promptly because it will degrade over time. In general, extract kept on ice for longer than 5–6 h should be discarded.\nDepletion of endogenous PEX5",
    "Timing: 30 min\nEndogenous PEX5 is depleted from egg extract using agarose beads covalently conjugated to the GST-tagged PEX5-binding domain from the docking factor PEX14. The resulting PEX5-depleted extract can then be supplemented with recombinantly produced PEX5 to restore import activity. Beads conjugated to GST alone may be used as a negative control.\nSee depletion of PEX5[href=https://www.wicell.org#sec2.7] for required materials.\nMix the prepared 1:1 suspension of protein-conjugated agarose beads by gently vortexing.\nUsing a wide-bore pipette tip, transfer 20 μL of the bead suspension (i.e., 10 μL of beads) to a 0.5-mL microfuge tube on ice.\nNote: This amount of beads is generally sufficient to deplete PEX5 from 100–200 μL of extract. The exact amount of beads needed to deplete PEX5 from a given volume of egg extract will depend on the coupling efficiency, and should be empirically determined for each batch of beads.\nNote: When working with small volumes of beads, it is helpful to mark the desired volume on the outside of the tube as a reference.\nNote: Affi-Gel beads settle quickly by gravity. The suspension should be pipetted soon after mixing.\nWash the beads.\nAdd 500 μL of cold XBH buffer to the tube.\nClose the tube and invert a few times to mix.\nCollect the beads by centrifugation for 1 min at 1,500 × g and 4°C.\nAspirate off the supernatant.\nRepeat two more times.\nNote: This step removes residual non-conjugated protein that might have detached from the beads during storage. A swinging-bucket rotor (e.g., Eppendorf model S-24-11-AT) facilitates bead collection on the bottom of the tube.\nAfter the last wash, briefly spin the tube on a touchspin centrifuge to collect residual buffer on the bottom of the tube.\nCompletely aspirate off the remaining supernatant.",
    "Note: This step is facilitated by using a flattened capillary pipette tip.\nImmediately add 200 μL of egg extract using a wide-bore pipette tip.\nCritical: A wide-bore pipette tip decreases the shear force applied to the egg extract during aspiration, and thereby reduces the risk of disrupting peroxisomes and other organelles.\nNote: Egg extract is very viscous. To avoid air bubbles and ensure greater accuracy, extract should be transferred by reverse pipetting.51[href=https://www.wicell.org#bib51] This technique involves pressing the pipette plunger past the first stop and then aspirating up a larger volume of extract then intended. The actual volume is expelled by pressing on the plunger down to the first stop and no further, so that air is not blown out of the pipette tip. Excess extract that might coat the outside of the pipette tip may be wiped off using a Kimwipe. Avoid touching the Kimwipe to the orifice of the pipette tip.\nMix the beads into the extract by gently swirling with a fine pipette tip.\nInvert the tube a few times by hand, then rotate for 30 min at RT.\nCollect the extract on the bottom of the tube by briefly spinning on a touchspin centrifuge.\nUsing a wide-bore pipette tip, transfer the mixture of extract and beads into a Micro-Spin column.\nPartially cap the Micro-Spin column and briefly spin on a touchspin centrifuge.\nNote: The Micro-Spin column allows the egg extract to flow through but retains the beads in the sample reservoir on top. Ensure that all of the extract has flowed through before proceeding.\nCritical: The Micro-Spin column must be loosely capped to avoid creating a vacuum during centrifugation that might prevent all of the extract from flowing through.\nTransfer the PEX5-depleted egg extract to a microfuge tube using a wide-bore pipette tip, and keep on ice.",
    "Note: The extent of PEX5 depletion may be assessed later by immunoblotting. Boil a small aliquot (e.g., 2 μL) of the PEX5-depleted extract in a 10-fold excess of Laemmli buffer,52[href=https://www.wicell.org#bib52] according to conventional protocols. As a control, boil an equivalent aliquot of unmanipulated extract. Prepare a few serial two-fold dilutions of each sample, resolve them by reducing sodium dodecyl sulfate (SDS) polyacrylamide-gel electrophoresis (SDS-PAGE), and immunoblot for PEX5 as described previously.1[href=https://www.wicell.org#bib1],36[href=https://www.wicell.org#bib36] Depletion efficiency may then be estimated from the resulting blot by densitometry.53[href=https://www.wicell.org#bib53]\nNote: It is faster and more meaningful to assess depletion efficiency by performing a matrix protein import assay with the PEX5-depleted extract, as described in the next section. Successful PEX5 depletion should preclude import, as discussed in the expected outcomes[href=https://www.wicell.org#expected-outcomes]. Once a batch of beads is standardized, this control can be included in every assay to confirm that depletion is still effective. Consult Problem 5 in the troubleshooting[href=https://www.wicell.org#troubleshooting] section for tips on improving depletion efficiency.\nSetting up an import reaction\nTiming: 30 min\nPEX5-depleted egg extract is supplemented with purified recombinant PEX5, and import is initiated by adding the fluorescent cargo GFP-SKL (reaction #1). We recommend to include two additional control reactions. First, a negative control reaction (reaction #2) using just PEX5-depleted egg extract (without recombinant PEX5) to verify the efficiency of PEX5 depletion. Second, a positive control reaction (reaction #3) using unmanipulated or mock-depleted egg extract to confirm that the peroxisomal import pathway is functional in this particular batch.\nReactions are prepared in two stages. First, all reagents EXCEPT the cargo are mixed in a tube and the reactions briefly warmed up. Then, import is initiated by adding cargo to the pre-warmed reactions.\nSee Setting up an import reaction[href=https://www.wicell.org#sec2.8] for required materials.\nPrepare three 0.2-mL tubes (i.e., PCR tubes) on ice.",
    "To each tube, add the reagents specified in the following table EXCEPT GFP-SKL:\ntable:files/protocols_protocol_2479_10.csv\nNote: The reagents should be combined in the order specified in the table, starting with egg extract. The fluorescent cargo (GFP-SKL) will be added later, after warming up the extract.\nNote: Dilute the purified PEX5 and GFP-SKL to the indicated 20× stock concentrations using cold XBHS buffer and keep on ice.\nNote: PEX5 may be used at higher concentrations (≤ 1 μM) to accelerate import,1[href=https://www.wicell.org#bib1] but the recommended concentration is sufficient and close to the concentration of endogenous PEX5 (∼50 nM).54[href=https://www.wicell.org#bib54] Higher concentrations of GFP-SKL are not recommended because they will increase the background and reduce the visibility of GFP-SKL imported into peroxisomes.\nNote: Egg extract is very viscous. To avoid air bubbles and ensure greater accuracy, extract should be transferred by reverse pipetting, as described above.\nCritical: To avoid shearing forces that could disrupt organelles, transfer the egg extract using a wide-bore pipette tip. Commercial wide-bore tips are usually too wide for the small volumes of extract required. We recommend cutting off a 2-mm portion of a generic tip using a clean razor blade.\nGently flick the tubes to mix, then collect the contents on the bottom of the tubes by briefly spinning on a touchspin centrifuge.\nPre-warm the tubes for 5 min at 24°C on a pre-heated 96-well thermoblock in a thermomixer, or in a block heater capable of accommodating PCR tubes.\nRemove the tubes from the thermoblock and add the fluorescent cargo to initiate import.\nGently flick the tubes to mix, and then collect the contents by a brief touchspin.\nReturn the tubes to the thermoblock and incubate for 1 h at 24°C.",
    "Note: The amount of cargo imported into peroxisomes increases linearly over time.36[href=https://www.wicell.org#bib36] A 1-h incubation is sufficient to visualize import and detect differences between samples. Incubations longer than several hours are not recommended because of the risk of triggering apoptosis.55[href=https://www.wicell.org#bib55]\nOptional: Reactions may be performed at 16°C–18ºC, which is closer to the frogs' physiological body temperature. However, egg extract becomes more viscous at lower temperatures and may be difficult to pipet. We have seen no difference in import competence between the two temperatures within the timeframe of the assay, except that import is slightly faster at 24°C.\nPreparing egg extract for imaging\nTiming: 10 min\nEach import reaction is sandwiched between two passivated coverslips and mounted on a slide using Valap sealant. While import will continue to occur during this stage of the protocol, the amount of imported cargo increases linearly with time for several hours.36[href=https://www.wicell.org#bib36] As long as this stage of the protocol is performed expeditiously and all samples are treated similarly, we have not noticed any effect on the results. If desired, import may be stopped by spiking each reaction with the purified PEX5-binding domain from PEX14 to a final concentration of 10 μM (which will sequester PEX5 in the cytosol and preclude further rounds of import).36[href=https://www.wicell.org#bib36]\nSee imaging the import reactions[href=https://www.wicell.org#sec2.9] for a list of required materials.\nPrepare coverslips:\nFill a clean container (e.g., a lid from a pipette-tip box) with 100% ethanol.\nPlace the container on a block heater or a hot plate warmed to 100°C.\nPlace 3 passivated coverslip sandwiches (one sandwich for each import reaction) into the hot ethanol bath and incubate for 5–10 min to soften.\nNote: Freshly prepared sandwiches soften within a few minutes. Sandwiches that have been stored for a week or more may require a longer incubation.",
    "Using fine-tipped tweezers, remove a coverslip sandwich from the ethanol bath.\nGently pry apart the coverslips using a clean razor blade.\nPlace the separated coverslips on a coverslip rack, ensuring that the passivated (PEGylated) surfaces are oriented in the same direction.\nRepeat for the remaining sandwiches.\nRinse the coverslips well with 100% ethanol to remove residual PEG (immobilize the coverslips by pressing along one edge with the index finger as shown in Figure 2[href=https://www.wicell.org#fig2]A).\nRinse the coverslips extensively with ultrapure water.\nBlow off excess water with compressed air or a handheld rubber bellows.\nPlace the rack on a hot plate warmed to 100°C until the coverslips are dry.\nTransfer the rack to a closed container to protect from dust, and allow the coverslips to cool to RT.\nNote: Coverslips may be prepared in advance, e.g., while the import reactions are incubating.\nPrepare slides:\nWipe 3 aluminum or glass slides with 100% ethanol to remove residual oils.\nBlow off any dust.\nNote: We use aluminum slides because they are more robust and can be reused. See Figure 5[href=https://www.wicell.org#fig5] for manufacturing instructions, and step 39 for instructions on reusing aluminum slides.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2479-Fig5.jpg\nFigure 5. Dimensions of aluminum slides used for imaging import reactions\nWe manufacture these in-house by abrasive waterjet cutting. The round hole reduces reflection of excitation light during episcopic fluorescence imaging, and allows the sample to be viewed diascopically by transmitted light.\nNote: Slides may be prepared in advance, e.g., while the import reactions are incubating.\nAssemble the imaging chambers (Figure 6[href=https://www.wicell.org#fig6]):\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2479-Fig6.jpg\nFigure 6. Preparation of import reactions for imaging",
    "(1) A PEGylated coverslip is placed PEG side up on a slide as shown. (2) The import reaction is spotted onto the coverslip. (3) A second PEGylated coverslip is placed PEG side down over the import reaction to form a sandwich. (4) Two corners of the sandwich are spot-welded with Valap sealant using a cotton swab. (5) The sandwich is sealed by smearing Valap around all four edges.\nUsing fine-tipped tweezers, gently place a clean and dry passivated coverslip in the center of a slide (Figure 6[href=https://www.wicell.org#fig6], step 1).\nCritical: The passivated (PEGylated) side should face up.\nMix the import reaction by gently flicking the tube.\nNote: Egg extract sets over time. Flicking the tube resuspends the extract to facilitate pipetting.\nBriefly spin down the tube on a touchspin centrifuge.\nPipette 10 μL of the import reaction onto the center of the coverslip (Figure 6[href=https://www.wicell.org#fig6], step 2).\nNote: To avoid air bubbles, the import reaction should be spotted onto the coverslip by reverse pipetting, as described above. A wide-bore pipette tip is recommended.\nPlace a second coverslip on top to form a sandwich (Figure 6[href=https://www.wicell.org#fig6], step 3).\nCritical: The passivated side of this second coverslip should face down toward the sample.\nNote: To minimize air bubbles, it is helpful to lower the second coverslip on top of the first at an angle by starting from one side of the sandwich, instead of straight down.\nCritical: Place the second coverslip down promptly. Waiting too long after spotting the import reaction may compromise the ability of the extract to spread evenly over the glass.\nUsing a cotton swab, dab a little Valap sealant onto two corners of the assembled coverslip sandwich to spot-weld it to the slide (Figure 6[href=https://www.wicell.org#fig6], step 4).",
    "Immerse the cotton swab in more Valap sealant, quickly shake off any excess, and smear along one side of the sandwich to form a seal (Figure 6[href=https://www.wicell.org#fig6], step 5).\nNote: The cotton swab spreads the sealant better if it is allowed to soak in the Valap for at least several hours or even several days. We routinely reuse the same cotton swab, which can be left in the same container as the sealant and then reheated along with it.\nRepeat for the remaining three sides (Figure 6[href=https://www.wicell.org#fig6], step 5).\nNote: Ensure that the sandwich is completely sealed. If any gaps are present, dab with a little additional Valap.\nLabel the slide with a marker and lay flat, with the coverslips facing up, in a slide tray to protect from light.\nRepeat for the remaining import reactions.\nImaging the import reactions\nTiming: 30 min\nThe assembled slides are mounted on a fluorescence microscope, and the fluorescence of the reporter cargo (i.e., GFP-SKL) is imaged at multiple positions.\nMount the first prepared slide in a slide holder on the microscope stage, with the coverslip sandwich facing the objective (Figure 7[href=https://www.wicell.org#fig7]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2479-Fig7.jpg\nFigure 7. Imaging the import reactions\n(A) The prepared imaging chamber is mounted on a fluorescence microscope, with the coverslip side facing the microscope objective as shown.\n(B) Multiple fields, arrayed around the center of the coverslip and spaced at least 500 μm apart to avoid overlapping illumination, are then imaged sequentially. Blue arrow indicates the recommended imaging direction.\nNote: On a research-grade fluorescence microscope, this usually means that the sandwich should face downward.\nCritical: Handle the slides gently and move the microscope stage slowly to avoid shaking the extract. Extract that has been shaken will flow within the imaging chamber and be difficult to image.",
    "Note: Because egg extract is a uniform suspension, out-of-focus light is a considerably greater problem than when imaging intact cells. To mitigate this issue, we highly recommend using a spinning disk confocal microscope instead of a widefield setup to reduce the illuminated volume.\nNote: Extract cannot be easily fixed, so peroxisomes and other organelles are constantly buffeted by Brownian motion. A spinning disk confocal microscope offers a sufficiently small illuminated volume to minimize out-of-focus light, while allowing fast acquisition rates to prevent blurring. A point-scanning confocal might be too slow, despite the advantage in blocking out-of-focus light.\nConfigure the excitation light and optical elements in the microscope to be compatible with mEGFP fluorescence.\nNote: The spectral properties of mEGFP43[href=https://www.wicell.org#bib43] (and other fluorescent proteins) can be found in FPbase[href=https://www.fpbase.org/].56[href=https://www.wicell.org#bib56] As a reference, the optical elements that we use can be found in Skowyra and Rapoport.1[href=https://www.wicell.org#bib1]\nBring into focus the coverslip facing the objective.\nNote: This step is facilitated by using an adaptive focusing system, e.g., the Nikon Perfect Focus System (PFS), the Olympus Z-drift compensation (ZDC) module, or the Leica Adaptive Focus Control (AFC). Otherwise, the coverslip must be focused manually. Manual focusing is facilitated by noting the increase in overall brightness as the objective nears the coverslip.\nNote: Peroxisomes in egg extract are diffraction-limited. We therefore use high-power 60× or 100× oil-immersion objectives, with a high numerical aperture (NA) of 1.4 or greater, to maximize spatial resolution and fluorescence detection. Ensure that the chosen objective is corrected for chromatic aberration and flat-field illumination (e.g., a plan apochromat objective). Again, a detailed description of the optical elements in our imaging platform can be found in Skowyra and Rapoport.1[href=https://www.wicell.org#bib1]\nAdjust the focus to ∼5 μm above the coverslip (i.e., toward the middle of the sandwich).",
    "Note: If using an adaptive focusing system, adjust the offset value to reach the desired height above the coverslip. Otherwise, focus must be adjusted manually. Properly focused egg extract looks diffuse with round voids (Figure 8[href=https://www.wicell.org#fig8], panel 2), which correspond to different types of vesicular compartments.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2479-Fig8.jpg\nFigure 8. Expected outcomes of the peroxisomal import reactions\nImported GFP-SKL molecules show up as bright puncta (panels 1 and 3), whereas unimported GFP-SKL produces a dimmer diffuse signal in the background (panel 2). Dark voids are vesicular compartments that exclude cytosol. Scale bar represents 5 μm.\nConfigure the acquisition software to image multiple fields arrayed around the center of the coverslip (Figure 7[href=https://www.wicell.org#fig7]B).\nNote: We generally image a 5 × 5 or a 6 × 6 array, with individual fields separated from each other by 500 μm. This spacing yields a sufficient number of images for analysis, yet minimizes phototoxicity and photobleaching that might arise from overlapping illumination.\nCritical: Reduce the stage speed to avoid shaking the extract during acquisition.\nAdjust the imaging parameters to maximize the signal-to-noise ratio (SNR) while avoiding saturation of the camera.\nNote: Pixel binning (e.g., 2 × 2) may be required to maximize the SNR. Binning should not greatly compromise spatial resolution if high-power objectives are used.\nAcquire images and repeat for the remaining samples.\nAluminum slides (if using) can be cleaned and reused:\nBriefly heat a slide on top of a hot plate to melt the Valap sealant.\nScrape off the coverslip.\nWipe off the remaining sealant with a paper towel.\nResidual grease can be cleaned by wiping with ethanol.\nCritical: Discard used coverslips in an appropriate sharps-collection container."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Cell Separation/Fractionation",
    "Metabolism",
    "Microscopy",
    "Cell Biology",
    "Molecular Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}