{
  "id": 13468,
  "origin_website": "Jove",
  "title": "Using Fluorescence In Situ Hybridization (FISH) to Monitor the State of Arm Cohesion in Prometaphase and Metaphase I Drosophila Oocytes",
  "procedures": [
    "1. Preparations\nPrepare solutions for fluorescence in situ hybridization (FISH). Prepare all solutions using ultrapure water.\nPrepare 5x Modified Robb's buffer: 275 mM potassium acetate, 200 mM sodium acetate, 500 mM sucrose, 50 mM glucose, 6 mM magnesium chloride, 5 mM calcium chloride, 500 mM HEPES pH = 7.4. Bring the pH to 7.4 using 10 N NaOH. Filter sterilize and store at -20 °C. Thaw and dilute to 1x as needed and store 1x aliquots at -20 °C.\nPrepare 10x Phosphate buffered saline (PBS) using 1.3 M NaCl, 70 mM Na2HPO4, 30 mM NaH2PO4. Bring pH to 7.0 using 10 N NaOH. Sterilize by autoclaving or filter sterilization.\nPrepare poly-L-Lysine coverslips one day before needed.\nPipette 70% ethanol containing 1% hydrochloric acid onto the surface of an 18 mm x 18 mm #1.5 coverslip and incubate 5 min. Use vacuum aspiration to remove liquid. Repeat with sterile ultrapure water. Cover surface of coverslip with 0.1 mg/mL poly-L-lysine and incubate for 10 min.\nAspirate to remove liquid and air dry for 10 min. Store coverslips poly-L-lysine side up in a plastic container with a tight-fitting lid to avoid dust.\nPrepare pulled Pasteur pipettes to remove liquid solutions without removing the oocytes. Over a Bunsen burner flame, heat the middle of a long glass Pasteur pipette while gently pulling on each end until the glass melts and pulls apart.\n2. Generation of Arm Probe for FISH\nNOTE: All centrifuge steps are performed at ~16,000 - 21,000 x g (maximum speed on most table top microcentrifuges). Brief centrifuge spins indicate spinning for 5 - 15 s. Vortex indicates vortexing for ~15 s at max speed unless otherwise noted.",
    "NOTE: BACs for arm probes can be obtained from BAC PAC Resources. Two X chromosome euchromatic arm probes have been used successfully with this method. One arm probe was composed of six BAC clones corresponding to cytological bands 6E-7B (BACR17C09, BACR06J12, BACR35J16, BACR20K01, BACR35A18, BACR26L11). The other arm probe consisted of six BAC clones corresponding to cytological bands 2F-3C (BACR13K19, BACR21G11, BACR09H13, BACR30B01, BACR34O03, BACR03D13). BACs to other Drosophila chromosome regions may be browsed at: http://www.fruitfly.org/sequence/X1-11-assembly.html. Two pericentric probes that recognize the 359 bp satellite repeat of the X chromosome have been used successfully with this method. A 22 nucleotide probe has been used extensively and works well (5'-Cy3-AGGGATCGTTAGCACTCGTAAT)19,23. A 28 nucleotide probe was recently tested and also worked well (5'-Cy3-GGGATCGTTAGCACTGGTAATTAGCTGC)24. HPLC purified oligonucleotides 5' labeled with a specific fluorophore were ordered from a commercial source (e.g., Integrated DNA Technologies).\nPrep BAC clone DNA following kit instructions as specified in the Table of Materials. Resuspend the DNA pellet obtained from 100 mL of culture in 200 µL TE; the final DNA concentration should range between 5 - 40 ng/µL depending on the BAC clone.\nPerform DNA amplification for each BAC using the amplification kit, as specified in the table of materials, and the following protocol. Process BAC DNA for each clone individually. Use enzymes and buffers supplied with the kit in steps 2.2.1 through 2.2.3.\nRandom fragmentation of BAC DNA: For each BAC, use TE to prepare 10 µL of a 1 ng/µL DNA solution in a 200 µL PCR tube. Add 1 µL of 10X Fragmentation Buffer. Place the tube in a PCR machine at 95 °C for exactly 4 min. Immediately cool the sample in ice water and centrifuge briefly. The incubation is time sensitive and any deviation may alter results.\nLibrary preparation",
    "NOTE: This method uses random primers to generate a library of amplifiable fragments.\n\t\t\nTo the tube containing the DNA add the following: 2 µL of 1x Library Preparation Buffer, 1 µL of Library Stabilization Solution. Mix thoroughly by vortexing, centrifuge briefly, and place the tube in the PCR machine at 95 °C for 2 min. Immediately cool the sample in ice water and centrifuge briefly.\nAdd 1 µL of Library Preparation Enzyme to the PCR tube, mix and centrifuge briefly. Place PCR tube in the PCR machine and incubate as follows: 16 °C for 20 min, 24 °C for 20 min, 37 °C for 20 min, 75 °C for 5 min, then hold at 4 °C.\nRemove samples from the PCR machine and centrifuge briefly. Samples may be amplified immediately or stored at -20 °C for up to three days.\nAmplification of BAC DNA Library\n\t\t\nAdd the following reagents to the entire 15 µL random fragment reaction: 7.5 µL 10x Amplification Master Mix, 47.5 µL Nuclease Free Water, 5 µL WGA DNA Polymerase. Mix thoroughly by vortexing and centrifuge briefly.\nPlace PCR tube in the PCR machine and incubate as follows: Initial Denaturation 95 °C for 3 min, 14 cycles of denaturation at 94 °C for 15 s, followed by annealing/extension at 65 °C for 5 min, then hold at 4 °C.\nAfter cycling is complete, assay the DNA concentration. The concentration of DNA should be at least 800 ng/µL. Keep samples at 4 °C or store at -20 °C until ready for digestion. Optionally, assess DNA fragment size by running 400 ng of DNA on a 2% agarose gel. Fragments should range from 200 bp to 3 kb (Figure 2).\nRestriction enzyme digestion of amplified DNA",
    "Place 20 µg of amplified DNA from the previous section in a 1.5 mL microfuge tube. Add 20 units of Alul, Haelll, Msel, Mspl, Rsal, 25 units of BfuCl, 0.5 µL 100x BSA, 5 µL 10x restriction enzyme digestion buffer, and adjust volume to 50 µL by adding the appropriate amount of ultrapure H2O.\nIncubate the digest overnight at 37 °C in an incubator to prevent condensation on the lid. Ethanol precipitate the digested DNA. Add to the digest: 1 µL glycogen, 1/10 volume 3M sodium acetate, 2.5 volumes 100% molecular grade ethanol. Incubate at -80 °C for 1 h or overnight.\nCentrifuge for 30 min at 4 °C. Wash DNA pellet with 1 volume of room temp 70% ethanol and spin for 5 min at 4 °C. Remove the supernatant and let the DNA pellet air dry or gently dry with a steady stream of air.\nResuspend the DNA pellet in 36 µL sterile ultrapure H2O and use 1 µL of DNA to assay the DNA concentration, which should be approximately 285 ng/µL. Store the DNA at -20 °C.\nOptionally assess DNA fragment size running 400 ng of DNA on a 2% agarose gel. Most fragments should range from 100 - 200 bp, with a fainter signal up to 500 bp (Figure 2).\n3' tailing reaction",
    "Denature the digested DNA at 100 °C for 1 min in a heat block. Immediately chill in ice water. To the 35 µL of DNA, add the following: 50 µL 400 mM sodium cacodylate, 1 µL 10 mM DTT, and vortex well. Add 4 µL 25 mM CoCl2, 2.5 µL 2 mM 5-(3-aminoallyl)-dUTP from ARES labeling kit as specified in the table of materials, 5 µL 1mM dTTP, 18 µL 5x TdT buffer, and 1 µL terminal deoxynucleotidyl transferase (TdT) 400 U/µL. Vortex and centrifuge briefly.\n\t\tCAUTION: CoCl2 is toxic, wear appropriate protection.\nIncubate for 2 h at 37 °C in an incubator to prevent condensation. Add 1 µL of 250 mM EDTA to stop the reaction and vortex briefly to mix. Ethanol precipitate the tailed DNA as described above (steps 2.3.2 - 2.3.4). Resuspend the dried DNA pellet in 10 µL sterile ultrapure H2O. Store the DNA at -20 °C until ready to continue.\nConduct fluorescent dye conjugation using the DNA labeling kit as specified in the Materials Table.\n\tNOTE: Once dye is added keep samples in the dark.\n\t\nDenature the tailed DNA at 95 °C for 5 min in a heat block. Immediately cool DNA in ice water and centrifuge briefly. Prepare labeling buffer according to the kit instructions and add 6 µL to each DNA sample. Resuspend each tube of dye in 4 µL of DMSO from the kit. Vortex and centrifuge briefly.\nUse one tube of dye for each labeling reaction. Add the dye solution to the DNA, vortex, and centrifuge briefly. Incubate the labeling reaction at room temperature for 2 h in the dark. Add 3 µL of 3M hydroxylamine to stop the reaction followed by 77 µL of the nuclease-free H2O from the kit. Vortex and centrifuge briefly.",
    "Remove non-conjugated dye using the PCR purification kit as specified in the table of materials. Follow manufacturer's instructions. Elute DNA from the column two times using 40 µL of elution buffer each time.\nEthanol precipitate the labeled DNA as described previously (steps 2.3.2 - 2.3.4). Resuspend the dried DNA pellet in 10 µL elution buffer.\nPrepare Probe Mixture\nFor labeled DNA, determine the concentration of the fluorochrome dye in pmol/µL. The fluorophore concentration may range from 30 - 100 pmol/µL, depending on the BAC. The DNA concentration may range from 300 - 800 ng/µL.\n\t\tNOTE: The microarray setting works well on a microvolume spectrophotometer, such as that specified in the table of materials. In the microarray window, select DNA-50, and specify the fluorochrome.\nCreate a master mix by combining equimolar amounts (pmol fluor) of each of the BAC probes. Vortex 30 s before combining. To avoid freeze/thaw cycles, prepare aliquots of the master mix, apply paraffin film to the tubes to prevent evaporation, and store in the dark at -20 °C.\n\t\tNOTE: A mastermix containing 250 pmol of each of the 6 individual BAC probes in a total volume of 30 - 50 µL works well. An aliquot containing 25 pmol (fluor) for each BAC will be sufficient for two 40 µL hybridization reactions, with a final probe concentration of 0.31 pmol fluor/µL for each BAC.\n3. Dissection and Fixation of Oocytes\nCollect 30 adult virgin females of the appropriate genotype. To enrich for late stage oocytes, hold females without males in a vial with fly food and dry yeast for 3 - 5 days before dissection25. The day before dissection, transfer the females without gas to a fresh vial with yeast.\nPerform the dissection.",
    "NOTE: See Figure 3 for tools needed. Solutions are removed using a pulled Pasteur pipette unless otherwise noted. When transferring ovaries always use a pipette tip coated with a 10% BSA solution.\n\t\nIn a shallow dissecting dish containing Modified Robb's buffer, use forceps to remove the ovaries from a single female. Use forceps or a tungsten needle to gently splay each ovary, allowing the solution to contact inner ovarioles. Transfer the pair of splayed ovaries to a 1.5 mL microfuge tube containing 1 mL Modified Robb's buffer.\nRepeat step 3.2.1 to accumulate ovaries from 20 - 25 females in the 1.5 mL microfuge tube. Finish dissections of the 20 - 25 females within 10 min.\nPerform fixation as follows.\nWith a pulled Pasteur pipette, remove the liquid in the microfuge tube, use a P1000 to quickly add 500 µL of 37 °C fix solution to the ovaries, and then immediately add 500 µL of room temperature heptane to the ovaries.\nShake microfuge tube to mix and place on a nutator for 3 min. Remove the microfuge tube from the nutator and place in a tube rack for 1 min to allow the oocytes to settle to the bottom. The total fixation time is 4 min.\nCaution: Fix solution and heptane are toxic, wear appropriate protection.\nRemove the fix solution and rinse the ovaries 3 times in 500 µL of PBS containing 0.5% BSA and 0.1% Triton X-100 (PBSBTx)\nRepeat for remaining genotypes.\n4. Removal of Chorions and Vitelline Membranes\nNOTE: See Figure 3 for tools needed.\nSeparate late stage oocytes",
    "Add 1 mL PBSBTx to a shallow dissecting dish. Use a P200 with a BSA coated tip to transfer fixed ovaries (in ~150 µL) into the shallow dish. Pipette ovaries up and down with the BSA coated pipette tip to dislodge the mature oocytes from the less mature oocytes.\nWhen late stage oocytes are sufficiently separated, transfer all the tissue to a 500 µL microfuge tube. Remove excess liquid with a pulled Pasteur pipette, leaving about 150 - 200 µL in the tube. Repeat section 4.1 for remaining genotypes.\nPrepare for rolling\nPre-wet a deep well dish with 200 µL of PBSBTx. Cover and set aside. Obtain 3 frosted glass slides and set slide #3 aside. Gently rub the frosted glass regions of slides #1 and #2 together. Rinse them in deionized water to remove any glass shards and dry with a disposable wipe.\nCoat the frosted regions of slides #1 and #2 with PBSBTx by adding 50 µL of PBSBTx to one slide and rubbing this region with the other slide. Remove liquid with a disposable wipe.\nPlace the slides under a dissecting microscope in the configuration shown in Figure 4A. Keep the frosted regions of slides #1 and #2 in contact, with slide #3 supporting slide #2.\nRoll oocytes; ensure that the direction of rolling is always in a straight line and never a circular motion.\nPrewet a P200 pipette tip in PBSBTx and disperse the oocytes in the microfuge tube by pipetting up and down. Transfer 50 µL of liquid containing oocytes to the center of the frosted glass part of slide #1. Lift slide #2 to do this.",
    "Slowly lower slide #2 until the surface tension of the liquid creates a seal between the two frosted glass regions. There should be enough liquid to cover the frosted area but none should be seeping out. If liquid is overflowing, use a pulled Pasteur pipette to remove excess liquid.\nHold the bottom slide (#1) in place with one hand and use the other hand to move the top slide (#2) back and forth in a horizontal direction, keeping slide #2 level and supported on slide #3. Perform under a microscope for easy visualization of oocyte movements and progress.\n\t\tNOTE: This movement will generate friction and cause the oocytes to \"roll\" and lose their chorions. Minimal pressure should be used and movements should be short and quick.\nAfter a few movements in the horizontal direction, slightly change the angle of movement (Figure 4B). In multiple increments, gradually increase this angle to 90° until movement of the top slide (#2) is perpendicular to the starting direction (Figure 4B). Note that empty chorions will be visible in the liquid and oocytes lacking chorions will appear longer and thinner.\nRepeat steps 4.3.3 - 4.3.4 about 7 - 10 times until the solution becomes slightly cloudy. Stop rolling when the majority of oocytes (75 - 85%) appear to have lost their vitelline membranes.\n\t\tNOTE: A distinctive pointed end is often visible on oocytes lacking vitelline membranes. Vitelline membranes are more difficult to remove than chorions. Light pressure may be applied to the top slide (slide #2) while rolling to achieve removal of vitelline membranes. Trying to remove vitelline membranes from all the oocytes often results in destruction of other oocytes.",
    "Gently lift the top slide (#2), dragging one of its corners to the center of the frosted region of the bottom slide (#1) so that rolled oocytes accumulate in the center of the frosted region. Rinse oocytes from both slides with PBSBTx into the deep well dish containing PBSBTx.\nClean slides #1 and #2 with ultrapure water, dry with a disposable wipe, and reset. Repeat steps 4.3.1 - 4.3.6 until all the oocytes of the same genotype have been rolled. This usually requires 3 - 4 rounds of rolling per genotype.\nRemove debris after rolling\nAdd 1 mL PBSBTx to a 15 mL conical tube. Swirl the liquid to coat the sides of the tube.\nUsing a PBSBTx coated P1000 pipette tip, transfer the rolled oocytes from the deep well dish to the conical tube containing 1 mL of PBSBTx. Add an additional 2 mL of PBSBTx to the conical tube containing the oocytes.\nLet the oocytes begin to settle to the bottom, then remove the top 2 mL of solution containing debris (chorions, vitellines, etc.) with a P1000 and discard. If needed, hold the conical tube against a dark background to see the opaque oocytes as they sink.\nAdd an additional 2 mL of PBSBTx to the oocytes, and repeat step 4.4.3. Repeat 4.4.3. for a total of 3 rounds of debris removal.\nUsing a PBSBTx coated P1000 pipette tip, transfer oocytes back to the original 500 µL microfuge tube. 20 - 25 females should yield approximately 50 µL of rolled mature oocytes.\nRepeat section 4 for the remaining genotypes using fresh frosted slides, a clean deep well dish, and a new conical tube for each genotype.",
    "If storage is necessary, transfer oocytes to 1x PBS with 0.1% TritionX-100 and store overnight at 4 °C. Long-term storage is not recommended because formaldehyde crosslinking can be reversed by non-ionic detergents.\n5. FISH\nNOTE: All washes are performed on a nutator at room temperature unless otherwise noted. Oocytes that have been rolled take longer to settle to the bottom of the microfuge tube, especially in solutions that contain formamide. It is important to be patient when changing solutions so that oocytes are not lost in the process. This may require waiting 5 - 15 min to let oocytes settle after rinses and washes. Also note that oocytes in formamide are less opaque.\nExtraction and RNAse treatment\nRinse oocytes with 500 µL of PBS containing 1% Triton X-100 (PBSTx). Remove the liquid and add 500 µL Extraction Buffer (PBSTx containing RNAse). Incubate on nutator at room temperature for 2 h.\nPre-hybridization washes\nRinse oocytes 3 times with 500 µL 2x Saline Sodium Citrate containing Tween 20 (SSCT). Preheat an aliquot (~500 µL/genotype) of 2x SSCT + 50% formamide to 37 °C.\nCaution: formamide is toxic, wear appropriate protection.\nWash oocytes 3 times for 10 min each in 500 µL 2x SSCT. Wash oocytes for 10 min in 500 µL 2x SSCT + 20% formamide. Wash oocytes for 10 min in 500 µL 2x SSCT + 40% formamide. Wash oocytes for 10 min in 500 µL 2x SSCT + 50% formamide.\nRemove liquid and add 500 µL of 37 °C 2x SSCT + 50% formamide from step 5.2.1 to sample and incubate for 2 h at 37 °C with rotation.\n\t\tNOTE: A hybridization oven equipped with a rotator works well for this. A foam microfuge tube \"float\" attached to the rotator can be used to secure the tubes.\nDenaturation and hybridization",
    "For each tube of oocytes, use 40 µL of 1x hybridization buffer containing 2.5 ng/µL centromeric probe and 0.31 pmol fluor/µL of each BAC probe. Prepare a solution of probe in hybridization buffer sufficient for all the genotypes. Vortex probe mix 30 s before adding.\nUsing a BSA-coated P200 pipette tip, transfer oocytes to a 200 µL PCR tube. Keep samples at 37 °C and let oocytes settle to the bottom, then use a pulled Pasteur pipette to remove as much liquid as possible.\nAdd 40 µL of hybridization solution containing probe (prepared in section 2) to the oocytes. Place the PCR tube containing oocytes in the PCR machine and incubate as follows: 37 °C for 5 min, 92 °C for 3 min, then 37 °C overnight. After probe is added to the oocytes, keep them in the dark as much as possible.\nPost-hybridization washes\nPreheat the 2x SSCT + 50% formamide to 37 °C and keep it in the hybridization incubator. With a BSA coated P200 pipette tip, add 100 µL of 37 °C 2x SSCT + 50% formamide to the PCR tube with the oocytes and transfer the oocytes to a new 500 µL microfuge tube.\nAdd an additional 400 µL of 37 °C 2x SSCT + 50% formamide to the same tube and let the oocytes settle at 37 °C in the incubator.\n\t\tNOTE: Settling often takes longer at this step. It is not unusual to take 15 min or longer. A lack of patience will result in significant loss of oocytes.\nWash the oocytes 3 times for 20 min each in 500 µL 37 °C 2x SSCT + 50% formamide at 37 °C with rotation. Keep oocytes at 37 °C while they settle.",
    "Wash the oocytes 3 times for 10 min each in 500 µL 37 °C 2x SSCT + 50% formamide at 37 °C with rotation. Keep oocytes at 37 °C while they settle.\nAt room temperature, wash the oocytes for 10 min in 500 µL 2x SSCT + 40% formamide on a nutator. Wash the oocytes for 10 min in 500 µL 2x SSCT + 20% formamide. Wash the oocytes for 10 min in 500 µL 2x SSCT.\nStain with DAPI\n\tCAUTION: DAPI is toxic, wear appropriate protection.\n\t\nWash oocytes for 20 min in 500 µL DAPI solution (1 µg/ml) in 2x SSCT on the nutator. Rinse the oocytes 3 times in 500 µL 2x SSCT. Wash oocytes 2 times for 10 min each in 500 µL 2x SSCT on the nutator. Samples can be stored for up to 4 h at room temperature in the dark until they are ready to mount on coverslips.\nMounting\n\tNOTE: See Figure 3 for tools needed.\n\t\nPlace a poly-L-lysine coated coverslip under the dissecting microscope. Remove liquid from the tube of oocytes, adjusting the total volume to about 150 µL. With a BSA coated P200 pipette tip, pipette up and down to disperse oocytes throughout the solution, and then transfer 40 µL of the oocytes/solution to a poly-L-lysine coated coverslip.\nRemove some of the liquid from the coverslip using a pulled Pasteur pipette until the oocytes stick to the coverslip but are still surrounded by liquid. With forceps, hold down the cover slip on one side and use a tungsten needle to gently dissociate clumps of oocytes, moving them to achieve a single layer of non-overlapping oocytes.",
    "Remove the remainder of the liquid around the oocytes with a pulled Pasteur pipette. Take a clean glass slide and use compressed gas to blow off any dust. Add 22 µL of mounting media (e.g., Prolong-GOLD) to the middle of the slide. Slowly lower the slide towards the coverslip, with the mounting media facing the sample, until the media touches the sample. Surface tension will cause the coverslip to adhere to the slide.\nPlace slides in a plastic container with a tight-fitting lid that contains a layer of fresh dessicant (e.g., drierite). Let slides dry for 3 - 5 days in the dark before imaging. Drying time may vary depending on the humidity of the room.\n6. Imaging\nUpon removing dry slides from the box of dessicant, clean them to remove any dust particles. Seal coverslips with nail polish. Sealed slides may be stored indefinitely at -20 °C.\nAcquire laser scanning confocal images using a high numerical aperture 40X oil objective with 6X digital zoom.\n\tNOTE: Ideally, system software will allow one to find and mark the X-Y location of meiotic chromosomes for multiple oocytes while viewing them using epifluorescence. This capability saves time during an imaging session. Rapid bleaching with a high numerical aperture 60X objective made its use unsuitable with the chosen confocal system, but it may work for other systems.\nCapture a Z series for each oocyte, setting the top and bottom of the series using the DAPI signal.\n\tNOTE: Gain, offset, and laser power will need to be determined empirically using a subset of oocytes. Once suitable parameters are found, only minor adjustments should need to be made.",
    "If altered acquisition settings are required, use the previously collected image stack to estimate the necessary changes. To avoid bleaching, refrain from pre-imaging the arm probe before capturing the Z series. With a step size of 0.25 µm, Z series typically range from 25 to 30 steps depending on the orientation and placement of the chromosomes. A smaller step size may improve one's ability to assess whether two FISH spots are separated in the axial dimension, but there is a trade-off with the time required to capture smaller steps and loss of signal intensity due to bleaching. A 40X objective with 6X digital zoom and a 1,024 x 512 image field generates images with a pixel size of 0.05 µm.\n7. Image analysis and scoring for cohesion defects\nDeconvolve the Z series to optimize the signal to noise ratio for each oocyte19.\n\tNOTE: A software package such as the one specified in the Materials Table allows one to deconvolve using integrative restoration, as well as crop and contrast-enhance images. Importantly, a software package that allows one to view images and score for cohesion defects in three dimensions is imperative.\nFor each oocyte, tabulate the number of arm and centromeric foci that colocalize with the DAPI signal. Loss of cohesion results in three or four distinct and separated signals for a specific probe. It is not uncommon to observe two foci that are connected by a thin thread. By the most stringent criteria, these foci would not be considered \"separated.\"\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}