{
  "id": 15261,
  "origin_website": "Jove",
  "title": "Gene-targeted Random Mutagenesis to Select Heterochromatin-destabilizing Proteasome Mutants in Fission Yeast",
  "procedures": [
    "1. Preparation of Media\nPrepare Yeast Extract with supplements (YES), YES without adenine (YES Low Ade), Pombe Glutamate medium (PMG12), and PMG without adenine (PMG-Ade) by mixing the components as described in Table 1. YES-Ade (Low Ade) and PMG-Ade plates have all of the same components, but the adenine is omitted from the latter.\n\t\nUse the following salt (50x) stock: 52.5 g/L MgCl2·6H2O, 2 g/L CaCl2·2H2O, 50 g/L KCl, 2 g/L Na2SO4 in distilled water. Filter sterilize using a 0.22-µm pore-size filter and store at 4 °C.\nUse the following vitamin (1,000x) stock: 1 g/L pantothenate, 10 g/L nicotinic acid, 10 g/L inositol, 10 mg/L biotin in distilled water. Filter sterilize using a 0.22-µm pore-size filter and store at 4 °C.\nUse the following mineral (10,000x) stock: 5 g/L boric acid, 4 g/L MnSO4, 4 g/L ZnSO4·7H2O, 2 g/L FeCl2·4H2O, 0.4 g/L MoO3, 1 g/L KI, 0.4 g/L CuSO4·5H2O, 10 g/L citric acid in distilled water. Filter sterilize using a 0.22-µm pore-size filter and store at 4 °C.\n\t\tNOTE: YES liquid medium can be made by omitting the agar.\nAutoclave the medium and cool it to below 60 °C while stirring with a stir bar, at the rate of 200 rpm.\nFor YES+G418 (geneticin) plates, add 1 mL/L G418 stock solution to the YES medium.\n\t\nUse the following G418 (1,000x) stock: 100 mg/mL G418 in distilled water. Filter sterilize using a 0.22-µm pore-size filter, aliquot to 1.5 mL centrifuge tubes, and store at -20 °C.\nStir for another 5 - 10 min and aliquot the media into 90-mm Petri dishes (1 L of medium aliquots to roughly 40 Petri dishes. Store the plates at 4 °C.\n2. Cloning of rpt4+ and its 5'/3' UTRs",
    "Perform PCR with primers p1 and p2 (Figure 1A) using fission yeast genomic DNA (gDNA) as the template in a total volume of 50 µL (~1 µg DNA, 20 U enzyme, 1x reaction buffer), and applying the reaction cycles described in Table 2 to amplify a 3,315-base pair (bp) fragment comprising rpt4+ and its 5'/3' UTRs. Purify the PCR product using a purification kit13 as directed by the manufacturer (Figure 1A).\nDigest the pBlueScript KS(-) vector14 and the amplified DNA fragment containing rpt4+ with its 5'/3' UTRs with BamH1 and Xho1 in a total volume of 20 µL (~1 µg DNA, 20 U enzyme, 1x digestion buffer) at 37 °C in a water bath for 16 - 18 h (Figure 1B).\nGel purify the digested vector (1.2% agarose gel) and DNA insert by performing TAE-based agarose gel electrophoresis (100 V, 1 h), excising the DNA bands of the desired sizes, and isolating the DNA with a gel extraction kit15.\nLigate the vector and DNA insert using T4 DNA ligase by performing a 20-µL ligation reaction containing 50 - 100 ng of the vector DNA, a ~3-fold molar excess of the insert DNA, 400 U T4 DNA ligase, and 1x ligation buffer. Incubate this mixture at 18 °C for 16 - 18 h.\nTransform the ligated DNA into 100 µL of E. coli DH5α by applying heat shock for 70 s at 42 °C. Add 1 mL of LB and incubate for 1 h at 37 °C for recovery. Perform centrifugation (13,800 x g), discard the supernatant, plate all of the transformed E. coli cells on LB-Ampicillin (LA) plates, and incubate at 37 °C for 16 h.\nPick 4 - 8 colonies with toothpicks and grow overnight at 37 °C in 3 mL LA medium.",
    "Isolate the plasmids with a plasmid purification kit16 used according to the manufacturer's protocol and perform analytical restriction enzyme digestions with 5 µL of the isolated plasmid, 5 U of each restriction enzyme (BamH1 and Xho1) and 1x restriction buffer. Incubate the reaction mixture at 37 °C in a water bath for 3 h. Confirm the cloning by sequencing candidate plasmids.\n3. Introduction of the Silent Mutation (Xho1 Restriction Site)\nDesign a pair of 33-bp primers (p3 and p4) that contain the desired mutation in the otherwise complementary sequence.\nPerform PCR with high-fidelity polymerase17 (Figure 1C) in a total volume of 25 µL (10 ng of cloned plasmid, 2 µL of 10 pmol primer mix, 2 U enzyme, 1x reaction buffer) using the cycling parameters listed in Table 3.\nDigest the template plasmid with DpnI in a total volume of 20 µL (20 U enzyme, 1x digestion buffer) at 37 °C in a water bath for 1 h.\nTransform, propagate, isolate, and sequence the plasmid containing the silent mutation, as described in steps 2.5 - 2.7.\nNote: The silent mutation can also be introduced using a cloning method which allows for the joining of multiple DNA fragments in a single reaction18.\n4. Random Mutagenesis of rpt4+ by Error-prone PCR\nPerform error-prone PCR, using the plasmid with the silent mutation (Xho1 site) as the template, primers p5 and p6, a total volume of 50 µL (the amount of template defined in step 4.1.1, 2 µL of 10 pmol primer mix, 2.5 U enzyme, 1x reaction buffer), and a special polymerase that is designed to generate a high error rate19 (Figure 1D). Perform PCR as described in Table 2.\n\t\nUse 4 - 5 µg of template plasmid to control the mutation frequency to 1 bp/kb (kilobase).",
    "Note: A high-concentration (>500 ng/µL) of plasmid, which may be obtained using a Mini-prep kit20, is required.\nUse gel electrophoresis to confirm a PCR product of 2670 bp (1.2% agarose gel). Gel purify this PCR product as described in step 2.5.\n5. Preparation of Fusion PCR Fragments (KAN, 3'UTR)\nPerform PCR using pFA6a-KANMX621 as the template, primers p7 and p8, and the conditions listed in Table 4 to obtain the marker (KAN) fragment. Gel purify the resulting 1,480-bp fragment as described in step 2.5 (Figure 1E).\n\t\nCheck if the stop codon of the gene targeted for mutation and the coding region of its adjacent gene are separated by more than 500 bp. The endogenous terminator may not be used when this region is less than 500 bp; rather, the ADH terminator should be used instead of the endogenous terminator. The protocol changes required to use the ADH terminator are presented in Table 5.\nNote: These changes only apply when the ADH terminator, which is available in the pFA6a-3HA-KANMX6 plasmid, is used instead of the endogenous terminator.\nPerform PCR with the cloned rpt4+-containing vector as the template and primers p9 and p10 in a total volume of 50 µL (20 ng of the cloned plasmid, 2 µL of 10 pmol primer mix, 2 U enzyme, 1x reaction buffer), using the conditions presented in Table 6. Gel purify the obtained 506-bp 3'UTR fragment (Figure 1E).\n6. Generation of the Transformation Construct by Fusion PCR (Figure 1E)\nPrepare the 3 fragments (mutagenized rpt4+, KAN, and the 3'UTR) at 50 ng/µL.\nPerform fusion PCR of the three fragments using primers p11 and p12, as described in Table 7. (The protocol for fusion PCR is a modification of the original protocol22.) Purify the major 4,398-bp PCR product.",
    "Use rpt4+:KAN:3'UTR fragments at a ratio of 1:3:1 for optimal results.\nNote: The total amount of the insert DNA should not exceed 500 ng. The recommended amount of rpt4+:KAN:3'UTR is 50 ng:150 ng:50 ng. The mutagenized region is approximately 1.6 kb, so the minimum number of yeast colonies that would account for all possible combinations of each base being mutated to the other three is 1,600 x 3 = 4,800 colonies. Because one transformation reaction typically yields 400 - 500 colonies, at least 10 reactions worth of fusion PCR construct is needed. This need can be met by simply increasing the reaction amount (i.e., the number of PCR tubes) by a factor of ten.\n7. Transformation of Fission Yeast by Electroporation (Figure 1F)\nInoculate yeast to 10 mL of YES medium to saturation by incubating it for more than 16 h.\nDilute the cells to an optical density at 600 nm (OD600) of 0.2 in 200 mL of YES medium and incubate at 30 °C with shaking for 5 - 6 h, to OD600 = 0.6 - 0.8.\nConcentrate cells to OD600 = 30, dispense to four 50-mL conical tubes and chill on ice for 10 min.\nHarvest the cells by performing centrifugation at 1,050 x g for 3 min at 4 °C. Place the tubes and 10 electro-cuvettes on ice. Perform the steps 7.3 - 7.8 on ice.\nDiscard the supernatant and add 15 mL of 1.2 M sorbitol. Gently shake the tubes to resuspend the cells.\nCentrifuge the cells at 1050 x g for 3 min at 4 °C.\nRepeat steps 7.4 and 7.5. Discard the supernatant. Add 500 µL of 1.2 M sorbitol to each tube, resuspend the cells, and collect all of the cells in one 15-ml conical tube.",
    "Add 1.2 M sorbitol up to 2.4 mL (OD600 = 10 per 0.2 mL). Keep the tube on ice.\nAdd 200 µL of sorbitol-suspended cells (make sure they are fully suspended) to an EP tube containing the fusion PCR construct, mix well, and transfer the sample to an electro-cuvette.\nElectroporate the cells with the following options: Fungi, ShS (2.00kV, 1 pulse).\nAdd 600 µL of 1.2 M sorbitol to each electro-cuvette for a total volume of 800 µL, and then spread the cells on four YES plates (200 µL/plate). Ten electro-cuvettes will dispense to 40 YES plates.\nIncubate the plates at 30 °C for 24 h.\nPerform replica plating to YES+G418 and incubate the plates at 30 °C for 3 days.\n8. Selection of Heterochromatin-destabilizing Mutants and Checking for False Positives\nFor each YES+G418 plate, perform replica plating to YES-Ade (Low Ade) and PMG-Ade (No Ade) plates. Incubate the replica plates for 1 - 2 days at 30 °C, until some of the colonies on the YES-Ade plates show a red coloration (Figure 1G).\nCompare YES-Ade and PMG-Ade plates and select cells that show pink or white on the YES-Ade plate and also grow on the PMG-Ade plate. Do not select colonies without growth on PMG-Ade, as they are false positives (e.g., reflecting that the KAN cassette has been integrated at a non-target site elsewhere in the genome).\nPick approximately 1 x 105 cells from each colony and incubate in 10 µL of SPZ solution containing 2.5 mg/mL zymolyase 100 T at 37 °C for at least 30 min. Use 1 µL of this solution to perform as the starting template for colony PCR (Figure 1H).",
    "Make SPZ (50 mL) by mixing 30 mL of 2 M sorbitol, 4.05 mL of 1 M Na2HPO4, 0.95 mL NaH2PO4 and 15 mL of distilled water (final pH, 7.5). Samples (5 mL) can be supplemented with zymolyase and stored in 500-µL aliquots at -20 °C until use.\nPerform gel electrophoresis (1.2% agarose gel, 180V, 20 min) to visualize the results of +the colony PCR. Select reactions that exhibit PCR bands of the proper size and digest 5 µL of each reaction product with XhoI (4 U enzyme, 1x digestion buffer, 37 °C water bath, 1 h) to screen out false positives (Figure 1H).\nPerform gel electrophoresis to visualize the XhoI digests (1.2% Agarose gel, 180 V, 20 min). Mark the colonies whose PCR products are cut by XhoI, and patch them to YES+G418 plates (Figure 1I).\nIsolate gDNA from the fission yeast cells and perform sequencing of the PCR products23. Compare the obtained sequence with the wild-type sequence to identify mutations (Figure 1I).\nDirectly re-introduce the mutation(s) to wild-type cells by transforming them with fusion constructs amplified by PCR from mutant cells23. Use spotting to confirm the phenotype in the newly made mutant cells (Figure 1J).\n\t\nFusion transformation construct can be easily amplified by PCR with primers p1 and p10 using the genomic DNA of mutants as the template in a total volume of 50 µL (~1 µg DNA, 20 U enzyme, 1x reaction buffer), and applying the reaction cycles described in Table 2. Transformation of the construct can be done by following the steps 7.1 - 7.13.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}