{
  "id": 5882,
  "origin_website": "Bio",
  "title": "Preparation of Onion Epidermal Cell Walls for Imaging by Atomic Force Microscopy (AFM)",
  "procedures": [
    "Purchase fresh onion bulbs (Allium cepa, cv. Cometa or similar white varieties, ~8 cm in diameter) from a local grocery store. The onions can be stored at 4 °C up to two weeks.    Remove the dry, papery outer layers. The fleshy scales are numbered consecutively 1, 2, 3…, n with scale #1 being the oldest, outermost layer (Figure 1A).   Excise scale #5 as a ~1 cm wide strip and press a 2 x 1.2 cm piece of double-sided tape to the convex, abaxial surface of the upper middle (near the tip) part of the onion scale (Figure 1B).    Peel off the epidermis (with the tape) by hand, trim to ~1.5 x 1.2 cm (Figure 1C), and place the tape and the sample onto a clean glass slide, with the sample side facing up. Press the perimeter of the sample onto the slide.    Seal the perimeter of the sample with a narrow line of nail polish and add a droplet (~20 μl) of washing buffer (see Recipes) to the center of the sample to keep it from drying (Figure 1D). The washing buffer should not submerge the surrounding still-wet nail polish. Steps 2 to 5 should be completed in ~30 sec.   imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171206/20171206195846_6287.jpg Figure 1. Procedure of onion epidermal wall preparation for AFM. A. Numbered onion scales with scale #1 being the oldest, outermost layer. Epidermal peels from scale #5 were usually used for imaging, although other scales are compatible with this procedure. B. A ~1 cm wide strip was excised and a double-sided tape was pressed against the abaxial side of the upper middle (near the tip) part of the onion scale. C. The epidermis was peeled off along with the tape. D.",
    "The epidermis and the tape were pressed onto the slide and a drop of washing buffer was added to the center of the sample.    Allow the nail polish to cure for ~2 min or longer before adding more of the same washing buffer (~100 μl) and gently agitate on a rocking platform for at least 20 min. The slide is put in a Petri dish with lid closed to reduce evaporation. Before scanning, examine the peel under an optical microscope to verify that epidermal wall indeed separated from the rest of the cell, exposing the inner surface of the wall for direct contact with the AFM tip.  Note: In our experience, peeling of the abaxial epidermis results in separation of the outer (periclinal) cell wall from the rest of the epidermal cell layer. However, this is not always uniform and must be verified by examination of the peel by optical microscopy after the detergent washing step. Cells with serrated edge or teeth-like features are usually torn open and good candidates for AFM imaging (Figure 2). The nucleus and other organelles should be absent. For AFM observations it is not essential that all of the cells split open in this way. Regions of the peel with intact cell walls can be ignored for the AFM imaging. The advantage of the onion scale abaxial epidermis is that it generally peels in this manner quite reproducibly and uniformly. Epidermal layers from other tissues sometimes split open in a similar fashion, others not. This must be determined by trial and error.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171206/20171206195924_9212.jpg Figure 2. Optical micrograph showing an AFM tip hovering above an epidermal cell. The serrated, teeth-like structures are good indications that the epidermal cells are split open.    Calibrate the deflection sensitivity (~50-60 nm/V) and spring constant (0.2-0.",
    "7 N/m) of the AFM tip with a clean glass slide in fluid, following the manufacturer’s protocol. The tip radius (~1.8 nm), tip half angle (17.5°), and sample Poisson’s ratio (estimated as 0.3) need to be entered manually. The values given here are based on the tips that we routinely use (Scanasyst-fluid+ AFM tips) and may differ for other tips.    Throughout the scanning processes, the samples are immersed in imaging buffer (20 mM HEPES buffer [pH 7.0] or 20 mM sodium acetate [pH 4.5], see Recipes).    Start scanning at 2 x 2 μm size and 512 x 512 sampling rates (thus resolution of ~4 nm/pixel). For high resolution images, scan the sample at 0.5 x 0.5 μm or smaller. The scanning parameters are not identical for all materials, but typically fall in the following ranges, which are determined empirically: a peak force set point (600 pN-1.5 nN), scan rate (0.4-0.7 Hz), peak force frequency (1 kHz), tip velocity (0.9-1.5 µm/sec). The gain is auto controlled by the software but the set point and scan rate are typically controlled by the user for consistency throughout imaging (Figure 3).   For standard cell wall imaging, scan at least five different cells from each sample and choose representative images for further analysis.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171206/20171206200000_3660.jpg Figure 3. A screenshot of Nanoscope interface during AFM operation. Four different channels are in display: Height, PeakForce Error, DMT modulus and Adhesion. Trace-retrace curves of each scan lines are displayed under each channel. The real-time force-distance curve is shown on the upper right corner."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}