{
  "id": 10934,
  "origin_website": "Jove",
  "title": "Surgical Technique for the Implantation of Tissue Engineered Vascular Grafts and Subsequent In Vivo Monitoring",
  "procedures": [
    "NOTE: This protocol has been approved by the Animal Care and Use Committee at the State University of New York at Buffalo.\n1. Pre-surgical Preparation\nUse sheep (Dorset cross, female, approximately 1-3 years old with a weight of 40-60 kg) for the following study. Administer cyclosporine A (200 mg/day), aspirin (975 mg/day), and coumadin (20-30 mg/day) by mouth, starting 3 days before surgery and continue for the duration of all studies.\nEnsure the sheep has fasted 12 hr before surgery (normal feed = 1.8 kg hay and 0.4 kg grain).\nSterilize all surgical supplies using a steam autoclave at 121 °C and 15 psi for 30 min.\nPlace the following items in a paraformaldehyde desiccator 48 hr prior to surgery: 4 mm Doppler flow probes, 1 mm ultrasonic crystals, indwelling arterial catheters, extension tubing, and 42” Tygon Tubing.\n\tNOTE: A table of relevant medical equipment needed for the surgery and for sterilization is listed in Table 1. Pre-placement of the instrumentation into the Tygon tubing at this step will help save time during surgery.\n\t\nLabel each end of the probes, catheters and crystals as left and right, if applicable.\n2. Surgical Operation\nInduce sheep for anesthesia with diazepam (0.5 mg/kg) and ketamine (4 mg/kg) intravenously (IV). Alternatively, use Telazol (4 mg/kg) IV.\n\t\nPerform orotracheal intubation with an 8.5-10.0 mm internal diameter cuffed endotracheal tube7.\nAdminister inhalant anesthesia through a rebreathing circuit with a tidal volume ventilator (7-10 ml/kg) or a pressure-regulated ventilator (15-20 cm H2O). Use a precision vaporizer to administer isoflurane or sevoflurane at an appropriate amount (3%-4% initially) to reach a medium to deep surgical anesthetic stage. The minimum alveolar concentration for sheep is 1.4% or 1.9% respectively8.",
    "Assess anesthetic depth by observing motor response to stimuli, palpebral reflex, eye position, and heart rate. Monitor blood oxygen saturation (95%-100%) using pulse oximetry, CO2 concentration (45-55 mmHg) in expiratory gases using capnography and maintain body temperature during the procedure (38.5-39.5 °C) using an auto regulated warming blanket.\nShave wool from the entire neck of the sheep, and over one cephalic vein, using a #40 blade on standard clippers. Prepare the skin of both sites for surgery using 70% isopropyl alcohol and 7.5% betadine scrub saturated gauze. Begin with alcohol gauze to facilitate removal of skin oils. Alternate between betadine gauze and alcohol gauze three times.\nPlace sheep onto the operation table in dorsal recumbency on top of a warming blanket. Pass a medium sized orogastric tube to allow for passive expulsion of stomach contents. Extend the sheep’s neck and use supportive cushioning as needed to maintain placement.\n\t\nPerform a final aseptic scrub using 7.5% betadine soaked gauze and allow to sit for 5 min prior to surgery.\nAdminister IV fluids (Lactated Ringer’s Solution or 0.9% Saline) at 10 ml/kg/hr through an angiocath placed in the cephalic vein. Administer intraoperative antibiotics and analgesia: Penicillin G Procaine 6,600 U/kg intramuscularly (IM), Gentamicin 1.6 mg/kg IM, and Buprenorphine 0.005-0.01 mg IV or IM.\nMake a ~12 cm incision lengthwise over the ventral midline neck using electro cautery. Isolate left and right carotid arteries (~6 cm) by removing connective tissue using a blunt dissection technique. Tie off and cauterize micro-vessels branching from the carotid arteries to minimize bleeding.",
    "Maintain sterility by utilizing (a non-sterile) surgical nurse to assist with burrowing all wiring and tubing (flow probe, ultrasonic crystal wires and catheter tubing) in the subcutaneous layer of the skin. Use a blunted trocar, which exits through the surgically prepped incision at the dorsolateral neck.\n\t\nReach under the sterile drape and turn the head of the sheep so that the side of the neck can be visualized under the drape.\nUse an 8 cm curved hemostat to tunnel through the subcutaneous space between the ventral midline neck incision and the side of the neck. Open and close the hemostat to bluntly dissect a space for the tubing ~1.5 cm wide. The tips of the hemostat should reside halfway between the head and shoulders, approximately 10 cm caudal to the right or left ear. Turn the hemostat so that the tips are pointing toward the superficial skin.\nReach under the sterile drape and make a 1.5 cm incision through the skin, over the tips of the hemostat with a sterile #11 blade. Visualize the tips of the hemostat to confirm a clear exit through the skin.\nPass the Tygon tube containing all wiring and tubing through the subcutaneous tunnel. Hold the wires and tubing above the sterile drape.\nReach under the drape to remove the outer Tygon tubing from the neck, exposing the implanted wiring as it leaves the neck of the sheep. Pull individual lines out to minimize any slack in the subcutaneous space. Leave enough distance to properly attach the instrumentation to the artery.\nPlace 4 mm Doppler flow probes on both carotid arteries and attain an initial reading (Figure 1). Administer 100 U/kg of heparin IV 30 min before clamping the artery.",
    "Continue heparin administration at 100 U/kg/hr until the end of surgery. Clamp the carotid artery using non-crushing vascular clamps and excise a portion (approximately 4 cm in length). The contralateral carotid flow rate will increase 50%-100% to maintain blood flow to the brain.\n\tNOTE: It is possible to limit longitudinal stretch by recoil of native vessel by removing shorter segments than being replaced and/or stretching the native artery with vascular clamps to shorten gap until full anastomotic procedure is completed. This will help limit the tension on individual holding sutures and the implanted graft.\nSuture the TEV in place using simple interrupted stitches with 7-0 proline ethalloy double armed monofilament suture. If necessary, apply vascular smooth muscle relaxants such as Papaverine (15 mg/ml) or Nicardipine (1.25 mg/ml) topically to the native vasculature in order to prevent vasoconstriction which would hamper anastomotic suturing.\n\tNOTE: Begin placing sutures with approximately 1 mm spacing. This can greatly vary from case to case. The composition and TEV thickness will affect the effective distance between sutures. As the thickness of the native tissue or TEV decreases, it may be necessary to place the sutures closer together.\n\t\nFirst anchor four points of the TEV to the native artery by placing two opposing stitches on both proximal and distal ends (Figure 2-Di). Hold each anchor taught using hemostats.\n\t\tNOTE: Proximal and distal descriptions are in reference to direction of blood flow throughout the paper.\nAdd 5-6 more sutures on the superficial side of both the proximal and distal ends to begin the anastomosis. (Figure 2-Pr). Simultaneously rotate the vascular clamps 180 degrees.\nRe-establish tension on the anchoring sutures. Add additional (5 to 6) interrupted sutures to proximal and distal ends on rotated side of the TEV.",
    "Once the TEV is securely sutured in place, rotate it back to the original position and remove the vascular clamps one at a time, distal clamp first. Slight bleeding at the anastomosis sites is common. This may naturally resolve after several minutes of clamp release and reclamping or require the placement of additional sutures. Place the Doppler flow probe (Figure 3-Fl) back on native artery proximal to blood flow entering the TEV and monitor flow rate.\n\tNOTE: Expect the flow rates of the left and right carotid to equilibrate after approximately 15 min. If the flow rate on the carotid artery with implanted TEV steadily drops, it is possible the TEV is clotting. Other possible abnormalities regarding flow can be attributed to constriction of the native arteries proximal or distal to the TEV. If this occurs, the use of additional vascular smooth muscle relaxant may be applied, and the native vessel should return to a basal tone after 30-60 min following the closure of tissue over the graft site.\n\t\nIf desired, excise the contralateral carotid artery and suture it back into place as a “Sham” control. This is more clinically relevant than leaving the right carotid artery alone and only attaching the flow probe, ultrasonic crystals, and catheter. If a sham control is wanted, perform this before continuing to step 2.11.\nSuture 1 mm ultrasonic crystals (Figure 3-cr1 cr2) to opposing sides of the TEV using 7-0 Proline. Thread suture through the ultrasonic crystal head and stitch only to the superficial layer of the TEV.\nCatheterize the artery using a modified 18 G catheter with a Teflon woven placket (Figure 3-Ca & Figure 4A). Place the catheter distal to the TEV on native arterial tissue.",
    "Suture the placket to the arterial wall with 5/0 Ethibond to control any bleeding. Use cyclohexanone to adhere the microbore tubing to the catheter that has been flushed with saline. Use the tubing as an extension line.\nUse a 20 G Luer Stub Adapter with a Surflo Injection Plug to seal the exteriorized end of tubing (Figure 4B). To maintain patency of the catheter, obtain the priming volume of the line and flush it with 10 ml of saline and then 5,000 U/ml of heparin sodium injection every 2-3 days.\nRecord the distance between the flow probe and the ultrasonic crystals, as well as the distance between the flow probe and the catheter. This will enable pulse wave velocity to be calculated in conjunction with software. If such calculations are not needed, do not implant a catheter.\nObtain an intraoperative reading if desired to ensure all implanted hardware is functional (see section 3).\nSecure implanted lines and wires to nearby musculature using 2/0 Silk and a taper needle (Figure 3).\n\t\nPosition the vascular flow probe wire parallel to the vessel, with the probe caudal and the wire extending cranially, and then making a “U-Turn” toward the lateral musculature. Secure the wire to adjacent musculature, using 2-0 silk on a taper needle at two locations, so that the wire or flow probe is not able to place any strain on the vessel. Be sure sutures are snug but do not over tighten and strangulate musculature (Figure 3).\nSuture the crystal wires and arterial catheter line to the lateral musculature, allowing for ~1.5 cm of slack, similar to previous steps for securing flow probe (Figure 3).\nGroup all wires and lines together and anchor them to musculature just before exiting out through subcutaneous tunnel, similar to previous steps.",
    "Close the surgical site with a 2-0 Vicryl suture in layers using a running suture pattern on facia and subdermal, running mattress stitch on the skin (facia, non-cutting needle; skin, cutting needle). Close the 1.5 cm incision at the dorsal neck around the exteriorized wires and lines using 2/0 Vicryl and a cutting needle.\nPlace flow probe wires, catheter lines, and ultrasonic crystal wires into a pouch (10 cm x 10 cm) that is securely sutured to the skin of the sheep (Figure 5 — after recovery).\nGradually wean the sheep off anesthesia and the tidal volume ventilator then extubate the sheep when spontaneous breathing is resumed. Remove the angiocath inserted into the cephalic vein and bandage if needed.\nBandage the neck using triple antibiotic ointment on the incisions, a Telfa pad, stretch roll gauze, and elasticon.\nAdminister post-operative analgesia: flunixin meglumine 2.2 mg/kg IM once during recovery, then 1.1 mg/kg IM once a day for two days, buprenorphine 0.005-0.01 mg IV or IM twice a day for one day.\n3. In Vivo Monitoring\nPlace sheep into mobile cart to ensure proper restraint. This allows the sheep to remain calm and conscious without compromising the hardware. May need to acclimate sheep to cart 2 or 3 times for 30 min prior to obtaining instrumentation recordings.\nRemove all wires and lines from pouch and connect to the monitoring devices. Connect flow probe to a Flowmeter, 1 mm ultrasonic crystals connected to TRB-USB box, and catheter lines to pressure transducers. A flow chart of this setup is provided (Figure 6).\nCalibrate flow probes and pressure transducers prior to data acquisition.\n\tNOTE: Due to potential variability between software versions and differences in equipment used, calibrations and settings will vary from case to case.",
    "Utilize an oscilloscope to fine tune the Sonometrics crystal measurement, according to manufacturer’s protocol.\nRecord data using computer software (Figure 7). Traces in the top half of Figure 7 in white color corresponds to the implanted TEV, while traces in the bottom half in red color corresponds to the Sham/Native. For both the TEV and Sham the flow rate (ml/min), arterial blood pressure (mm Hg) and diameter (mm) are recorded live.\nRecord for at least 1 min with no disturbances. Export this data for more detailed analysis. After the recording, disconnect all wires and place back into pouch sutured on the neck of the sheep.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}