{
  "id": 9206,
  "origin_website": "Jove",
  "title": "Experimental Demyelination and Remyelination of Murine Spinal Cord by Focal Injection of Lysolecithin",
  "procedures": [
    "NOTE: The animals used in this procedure were cared for in accordance with the Canadian Council on Animal Care (CCAC) guidelines. Ethics were approved by the Animal Care Committee of the University of Calgary.\n1. Prepare Syringe for Injection\nDissolve lysolecithin to a 1% solution in phosphate-buffered saline (PBS; pH 7.4) and store at -20 °C in small aliquots (75 μl). Thaw a vial to RT.\n\tNOTE: if lysolecithin is undissolved, sonicate the tube in an ultrasonic cleaner (40 kHz) for approximately 30 min to form a uniform solution.\nHandle the pre-pulled glass capillary with extreme care to avoid damaging the delicate tip. Unscrew the nut of a 10 μl injecting syringe and thread it onto the flat end of the capillary followed by 2 ferrules, ensuring that the mating ends of the ferrules align and the capillary is snug in the conical ferrule (Figure 1). Rinse the syringe with isopropyl alcohol and remove the plunger. Once dry, screw the needle assembly hand tight onto the injecting syringe.\nAttach the metal hub needle to the priming syringe. Pierce a rubber disc with the needle and slide it down to the base. Fill the priming syringe with lysolecithin. Gently depress the priming syringe until liquid is visible at the tip of the needle. This ensures air bubbles will not be introduced into the injecting syringe.",
    "Insert the metal hub needle of the priming syringe into the injecting syringe. Making a firm seal with the rubber disc, slowly depress the priming syringe until the capillary fills to the tip with solution. Carefully remove the priming syringe while simultaneously depressing to fill the barrel of the injecting syringe without introducing air bubbles. Insert the plunger into the injecting syringe and ensure solution flows from the tip of the capillary as the plunger is gently depressed.\n\tNOTE: If any air bubbles are visible in the capillary or injecting syringe, the syringe preparation must be repeated from the beginning. Continuous fluid in the injecting apparatus is critical to ensure accurate injection volumes.\nAttach the completed injecting syringe to the arm of a stereotactic micromanipulator. This completed apparatus will be able to inject 15-20 animals before needing to be refilled.\nDiscard the remaining lysolecithin from the priming syringe. Withdraw and depress isopropyl alcohol several times, and detach the metal hub needle. Wait several hours for the remaining isopropyl alcohol in the priming syringe to evaporate before filling again.\n2. Prepare Animal for Surgical Procedure\nNOTE: This procedure is described for female C57BL/6 mice, aged 8-10 weeks.\nAnesthetize the animal with an intraperitoneal injection of ketamine (200 mg/kg) and xylazine (10 mg/kg) or per institutional animal care regulations. Plan for the animal to be under anesthesia for approximately 1 hr if using injectable anesthesia.\nTest that the animal is deeply anesthetized by firmly pinching the foot. A properly anesthetized animal will not respond to the pinch.\nUsing clippers, shave a 2-3 cm2 area on the dorsal side of the animal, close to the ears. Be careful not to damage the ears.",
    "Wipe the area clean with 70% ethanol applied to a gauze pad. Ensure all clipped hair has been removed from the area. Disinfect the area with iodine.\nApply petroleum jelly to the eyes to prevent drying throughout the procedure.\nKeep the animal in a heated recovery chamber until ready to begin the procedure.\n3. Perform the Surgical Procedure\nNOTE: Ensure adequate aseptic technique for all steps of the procedure. This includes proper use of gloves, hairnets, masks, and drapes. All tools should be sterilized before coming in contact with the animal.\nMove the animal to a stereotactic frame, dorsal side up, elevated at the mid section by folded paper towels to exaggerate the curvature of the spine. Fasten the arms and tail with surgical tape and secure the head with a tooth clamp. Stabilizing ear bars are not necessary for this procedure.\nUse a scalpel to make a 3 cm midline incision, starting just below the ears and cutting in the caudal direction.\nLocate the divide between the 2 large adipose structures and use fine forceps in each hand to pull these apart. Spread retractors to open the surgical field.\nUnder a surgical microscope, locate the prominent outgrowth process of the T2 vertebra (Note: this feature is characteristic of the C57BL/6 mouse strain). Perform a blunt dissection with closed spring scissors through the overlaying musculature to better visualize T2. Using the forceps, feel for the hard surfaces of T3 and T4 to confirm proper anatomical location.",
    "Using spring scissors, make shallow lateral cuts (2-3 mm deep) of the connective tissue between T3 and T4. Due to natural spacing between vertebrae in the upper thoracic portion of the mouse vertebral column, a laminectomy is not necessary to reveal the spinal cord. Be mindful that too deep a cut will pierce and damage the cord.\n\tNOTE: A small degree of bleeding is common during this step. If this occurs, hold a sponge spear into the area until the bleeding subsides (30-60 sec).\nVisualize the spinal cord. It will be covered with a thick layer of visible dura if this meningeal layer was not yet cut while exposing the cord. A prominent blood vessel runs caudal/rostral through the approximate midline of the spinal cord.\n\tNOTE: This vasculature should not be used as a landmark for the midline. Instead, adequate lighting should reveal the grey-white matter boundaries flanking the dorsal column, and these should be used to estimate the midline.\nIf the dura remains intact, make gentle lateral scrapes with a 32 G metal needle until it is cleared. The goal is to remove the dura while not cutting the remaining underlying meninges, which are not as thick and harder to see.\n\tNOTE: Release of cerebrospinal fluid indicates a breach of the arachnoid and while this can occur without mechanical damage to the tissue, the accumulated cerebrospinal fluid should be removed with a sponge spear to better visualize the surface of the cord.\nMove the injecting syringe in place and slowly lower it until the tip of the capillary just barely touches the spinal cord immediately lateral of either side of the midline. Lock the arm in place.",
    "Use the graded measurements of the Z-direction stereotactic arm to make a baseline position measurement. From this reading, subtract 1.3 mm. Use a quick and shallow downward motion to pierce the tissue and then carefully lower the capillary until the new measurement is reached. Optional: if desired, lesions in the dorsal column can be produced by the same piercing motion at the midline and a depth of 0.3 mm (see discussion for more information).\n\tNOTE: These values are specific for injecting between T3 and T4. If opting to perform the injection at any other location in the spinal cord, these values must be derived from any available mouse brain atlas.\nUse the micromanipulator to depress lysolecithin into the ventral spinal cord white matter. Make 1 rotation of the micromanipulator every 5 sec for 2 min, resulting in a final volume of 0.5 μl. Leave the capillary in place for 2 additional min to prevent backflow of solution, and then carefully remove the capillary.\nTie a single suture in the muscle/adipose tissue overlaying the spinal column. Use a non-interrupted suture to close the skin. Apply more iodine to the incision site.\nPlace the animal in a heated recovery chamber until it recovers, then return it to its cage. Apply analgesics post-operatively as per institutional animal care regulations. Additional post-operative care is usually not necessary as the animals are fully ambulatory and capable of self-feeding and drinking as soon as they recovery from anesthesia.\nRepeat the procedure for the remaining animals.",
    "NOTE: With proficiency, the operation can be completed in 10-15 min per animal, particularly with the help of a second person tying sutures. The same glass capillary can be used for approximately 15-20 surgeries before the tip becomes blunt and should be replaced. Control surgeries can be performed identically as described, with an injection of PBS into the spinal cord instead of lysolecithin. We do not recommend cleaning the capillaries for future use.\n4. Tissue Processing and Analysis\nSacrifice the animals with an intraperitoneal overdose of ketamine (500 mg/kg) and xylazine (25 mg/kg) at desired time points. Lesions typically evolve in the following manner: 1-3 days, active demyelination; 3-7 days, OPC recruitment; 7-10 days, oligodendrocyte differentiation; 10-21 days, active remyelination2,10,11.\nTo prepare tissue for histology, first perform a transcardial perfusion12 with 20 ml RT PBS followed by 20 ml ice-cold 4% paraformaldehyde in PBS. For preparation of resin embedded tissue for semi- or ultrathin sectioning, see step 4.9.\nRemove the spinal cord using curved bone scissors to cut through each vertebrae starting at the cervical end of the spinal column and working down to the lower thoracic level. Fix the spinal cords O/N in 4% paraformaldehyde in PBS at 4 °C. Switch the cords to 30% sucrose in PBS at 4 °C for at least 72 hr.\nIdentify the injection site as an abnormality on the dorsal surface of the spinal cord. Cut a 3 mm piece of tissue (with the injection site in the center) and align the pieces in cryomolds containing optimal cutting temperature (OCT) compound. Suspend the underside of the cryomolds in a chilled mixture of 2-methylbutane and dry ice until the OCT is completely frozen. Store at -80 °C until ready to section.",
    "Section the spinal cords on a cryostat at a width of 20 μm onto microscope slides and allow to air dry O/N before storing the slides at -20 °C.\nDetect lesion location and size using a eriochrome cyanine histological stain of myelin13. Perform all steps at RT. Air-dry slides for 30 min. Place slides in clearing agent for 1 min followed by rehydration in graded ethanol solutions (100%, 95%, 90%, 70%, 50%, water) for 1 min each.\n\t\nPlace slides in eriochrome cyanine solution for 15 min, followed by a 1 min wash with water. Differentiate in 0.5% ammonium hydroxide for 10 sec, followed by a 1 min wash with water. Dehydrate in graded ethanol solutions (reverse order as described above) for 1 min each, coverslip with mounting media, and image on a bright-field microscope.\nUse immunohistochemistry to visualize axons and myelin. Air-dry slides for 30 min. Dehydrate with graded ethanol (water, 50%, 70%, 90%, 95%, 100%) for 2 min each at RT, then reverse order back to water. This step results in greater resolution of individual myelin rings14.\n\t\nBlock non-specific antibody interactions using 10% goat serum and 0.25% triton X-100 in PBS for 60 min at RT. Dilute primary antibodies (mouse anti-SMI312 1:2,000, rabbit anti-MBP 1:1,000) in PBS and incubate on slides O/N at 4 °C.\nWash 5 times for 5 min with PBS at RT. Dilute secondary antibodies (Alexa 488 anti-rabbit 1:500, Alexa 546 anti-mouse 1:500) in PBS and incubate on slides for 60 min at RT. Wash 5 times for 5 min with PBS at RT. Mount slides with coverslips using gelvatol and image on a fluorescent microscope.",
    "Use immunohistochemistry to visualize cells of the oligodendrocyte lineage. Follow the procedure for step 4.7, omitting the dehydration/rehydration step, and using 10% horse serum instead of goat serum. Use the following primary antibody dilutions: goat anti-PDGFRα 1:100, mouse anti-CC1 1:200, rabbit anti-Olig2 1:200. Use the following secondary antibody dilutions: Alexa 488 anti-goat 1:500, Alexa 594 anti-mouse 1:500, Alexa 647 anti-rabbit 1:500.\nTo prepare tissue for semi- or ultrathin sectioning, first perform a transcardial perfusion12 with 20 ml RT PBS followed by 20 ml ice-cold 4% paraformaldehyde/1% glutaraldehyde in PBS. Remove spinal cord as described in step 4.3. Fix O/N in 4% paraformaldehyde/1% glutaraldehyde in PBS at 4 °C.\nIdentify the injection site as described in step 4.4. Cut a 1 mm piece of tissue containing the injection site. Additional 1 mm blocks on either side of the lesion can be prepared as well if desired.\nIn a fume hood, add 10 times volume 1% osmium tetroxide/1.5% potassium ferrocyanide to each block on ice for 60 min.\n\tNOTE: osmium tetroxide is a highly toxic substance and should be handled with extreme care. All materials in contact with osmium tetroxide should be placed in corn oil (twice volume as osmium tetroxide solution) for neutralization.\nWash cords 3 times with 0.2 M cacodylate for 10 min at RT, discarding in corn oil. Dehydrate with graded ethanol solutions (water, 50%, 70%, 90%, 2 times with 95%, 2 times with 100%, 2 times with propylene oxide) for 10 minutes at RT.\nEmbed cords in resin as per manufacturer’s instructions.\nCut blocks on an ultramicrotome and mount sections onto water droplets on microscope slides. Place slides on a hot plate (approximately 50 °C) until dry.",
    "Visualize myelin by adding a few drops of 1% toluidine blue/2% borax solution onto the slides for 10-15 sec at 50 °C. Rinse with water, dry, and coverslip with mounting media. Image sections on a bright-field microscope."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}