{
  "id": 11338,
  "origin_website": "Jove",
  "title": "A Method to Study Adaptation to Left-Right Reversed Audition",
  "procedures": [
    "All methods described here have been approved by the Ethics Committee of Tokyo Denki University. For every participant, informed consent was obtained after the participant received a detailed explanation of the protocol.\n1. Setup of the Left-Right Reversed Audition System\nSetup of the Reversed Audition System without a Participant \nPrepare a linear pulse-code-modulation (LPCM) recorder, binaural microphones, and binaural in-ear earphones.\nConnect the left and right lines of the microphones crossly to the LPCM recorder so that left-right reversed analogue sound signals are digitalized. Moreover, connect the left and right lines of the earphones straight through to the recorder so that the reversed digitalized signals are immediately played.\n\t\tNOTE: In the case of employing the binaural earphone-microphones as binaural earphones, do not use the earphone parts in order to reduce the spillover of the sounds that go through the microphone parts.\nPut the bodies of the microphones and the earphones together for each ear with slight isolation by sound proofing materials, and cover the microphones with dedicated windscreens for suppressing the wind noise.\nInsert rechargeable batteries and a large-capacity high-speed memory card into the LPCM recorder and turn it on. Set the recording conditions properly in such a manner that the sound signals are recorded on the memory card as an LPCM format at a sampling rate of 96 kHz with a 24-bit depth.\nPlace the body of the system into a pocket-sized bag.\nSetup of the Reversed Audition System with a Participant \nInstruct a participant to insert the earphones of the reversed audition system tightly into the ear canals.\nDisconnect the lines for the left and right microphones and connect the dominant-ear side of the microphone straight through to the recorder.",
    "Instruct the participant to take off and put on the dominant-ear side of the system repetitively while adjusting the sound volume of the recorder to make the subjective loudness of direct (normal) and indirect (reversed) sounds equal (as close as possible).\nCheck the loudness for the non-dominant ear as well, and connect all the lines of the system back again.\nPlace the system into the participant’s pocket, fix the cords on the participant’s clothes appropriately to prevent them from becoming entangled, and pick up unwanted noises.\n2. Validation of the Left-Right Reversed Audition System\nNOTE: Perform the following steps to validate the left-right reversed audition system, irrespective of experiments studying adaptation to left-right reversal.\nValidation of the Sound Source Localization of the Reversed Audition System\nLocate a digital angle protractor whose initial direction is defined as 0° at the center of an anechoic room, and assume a virtual circle centered at this point with a radius of 2 m. Along the virtual circle, mark 72 possible sound sources at every 5° from -180° to 175° in a clockwise manner, and set up plane-wave speakers at these points directed towards the center of the circle.\nSet up a video camera near the center of the room to record the display of the digital protractor.\n\t\tNOTE: Since the display of the protractor moves with the protractor’s body, the field of view of the video should be large enough to cover all the possible areas. Moreover, the video camera should be carefully placed in order to not disturb the participant’s sitting position and the sound presentation.",
    "Prepare for two sessions of sound source localization: in the first session, the participant does not put on the reversed audition system. In the second session, the participant puts on the equipment, calibrates it, and checks the system (as explained in step 1.2) as quickly as possible.\nGuide the participants to sit comfortably and blindfolded at the center of the circle facing a 0° sound source and wait for the experiment to start.\nConduct two sessions of sound source localization. In both sessions, have the participant use the protractor to indicate the perceived sound direction as precisely as possible without moving the head.\nFor each session, start video-recording the angle display of the protractor, and present 1000-Hz sounds at 65-dB sound pressure level (SPL) from any of the sound sources: the sound at one location is randomly switched to the sound at another location every 10 s in such a way that each location is used once.\n\t\tNOTE: Here we use MATLAB with the Psychophysics Toolbox16,17,18. Although this toolbox is commonly used to present sounds, any reliable stimulation software can also be used.\nAfter each session, stop the video-recording and instruct the participants to take a break for sufficient amount of time.\nRead the trial-by-trial perceptual angles displayed on the protractor from the recorded video, and evaluate the spatial performance of the reversed audition system by comparing the perceptual angles in the normal and the reversed conditions against the physical angles defined by the direction of sound sources.\nValidation of the Delay of the Reversed Audition System\nPut the reversed audition system on a desk in a calm room with no participants.\nDisconnect a line to the left microphone, and place a plane-wave speaker and the left earphone as close as possible to the right microphone.",
    "Start recording direct (normal) sounds from the speaker and indirect (reversed) sounds from the left earphone simultaneously through the right microphone.\nPresent 1-ms click sounds from the speaker with a moderate inter-stimulus interval at 65-dB SPL.\nAfter a sufficient number of trials, stop presenting and recording the sounds.\nIn order to confirm the symmetrical configuration of the system, repeat the same steps above using the right earphone and the left microphone.\nRead the recorded sound data using software (e.g., MATLAB) and evaluate the difference between the onset timings of the direct (normal) sounds and indirect (reversed) sounds, which corresponds to a potential delay caused by the time spent passing through the electrical path in the system.\n3. Studying the Adaptation to Left-Right Reversed Audition\nProcedure of the Exposure to Reversed Audition\nRemind the participants repeatedly of their right to quit the exposure at any time.\n\t\tNOTE: Stop the exposure as soon as possible if the participant reports sickness or if an observer notices any sign that the participant wants to quit the exposure for any reason.\nPrepare a sufficient number of spare rechargeable batteries and large-capacity high-speed memory cards to allow the participant to replace them at anytime.\nInstruct the participant to wear, calibrate, and check the reversed audition system by themselves during the exposure period, as explained in step 1.2. Perform the same procedure each time the participant wears the system after each interruption.\nInstruct the participant to perform daily-life activities while wearing the system continuously for approximately a month, except while sleeping, bathing, neuroimaging, and other emergency times. In these cases, ask participants to remove the system and immediately insert earplugs into their ears to prevent recovery of adaptation.",
    "NOTE: Although it is ideal for the participant to wear the system all day and night, it is strongly recommended that the system not be worn while sleeping and bathing in order to prevent unexpected loud noises and electrical shocks, respectively.\nReplace the batteries and memory cards routinely before battery exhaustion and memory overcapacity, respectively. Remove the system and replace it with earplugs quickly in a silent place without producing any sound.\nWhen a participant needs to move around outside, drive the participant in a car, accompany the participant on the move, or ask them to use safe means of transportation for acts performed alone.\n\t\tNOTE: Great care should be taken by the researcher in order to not endanger the participant’s safety during the exposure period, especially when the participant goes outside. Prohibit the participant from performing any dangerous behaviors.\nIn order to facilitate adaptation, instruct the participant to experience situations involving high auditory input, such as walking in a shopping mall or a campus, having a conversation with more than two persons, and playing 3D video games, for as long as possible.\nInstruct the participant to keep a diary or provide a subjective report to an observer as frequently as possible about perceptual and behavioral changes, experienced events, and anything that the participant notices.\nAfter the target exposure period, instruct the participant to take off the reversed audition system.\n\t\tNOTE: It is also important to follow up about the perceptual and behavioral changes in order to examine the recovery process from the adaption to left-right reversed audition.\nNeuroimaging During the Exposure to Reversed Audition\nInstruct the participant to train on a task that will be used during the neuroimaging experiments as sufficiently as possible.",
    "For example, train the participant to perform a selective reaction time task in two conditions, compatible and incompatible15. The compatible condition consists of responding immediately to the right-ear sound with the right index finger and to the left-ear sound with the left index finger. The incompatible condition consists of responding immediately to the right-ear sound with the left index finger and to the left-ear sound with the right index finger.\nUse 1000-Hz sounds at 65-dB SPL for 0.1 s with an inter-stimulus interval of 2.5 – 3.5 s, which appears pseudorandomly on either ear side.\nBefore the exposure to reversed audition, conduct a neuroimaging experiment under the trained task.\n\t\t\nFor example, record either MEG or EEG responses, as well as the left and right finger responses under the selective reaction time task15. The task consists of two compatible and two incompatible blocks that are alternatively arranged with an inter-block interval of at least 30 s, and with sounds appearing 80 times for each block through the inserted earphones with plastic ear tubes.\n\t\t\tNOTE: Although a 122-channel MEG system was used in Aoyama and Kuriki15, a multi-channel EEG system is also suitable for this protocol.\nFor the MEG/EEG recording, set the sampling rate at 1 kHz and the analog recording passband at 0.03 – 200 Hz.\nDuring approximately a 1-month exposure to reversed audition, conduct neuroimaging experiments under the trained task every week without the reversed audition system in exactly the same way as in the pre-exposure experiment (step 3.2.2).\n\t\tNOTE: The system is removed immediately before and put on immediately after each experiment.\nOne week after the exposure, conduct a neuroimaging experiment under the trained task in exactly the same way as the pre-exposure experiment (step 3.2.2).",
    "Analyze the collected data before, during, and after the exposure to left-right reversed audition.\n\t\t\nFor example, after rejecting the epochs contaminated with eye-related artifacts, removing the offset in the pre-stimulus interval, and setting the low-pass filtering at 40 Hz, average the MEG/EEG data from 100 ms before to 500 ms after the sound onset for the stimulus-response compatible and incompatible conditions15.\nUsing an MNE software package19,20, estimate the sources of the brain activity with dynamic statistical parametric maps (dSPMs) overlaid on cortical surface images and quantify the intensities of brain activity with minimum-norm estimates (MNEs) for each time point of the averaged data.\nCalculate the auditory-motor functional connectivity from single-trial zero-mean MEG/EEG data from 90 to 500 ms after the sound onset for each condition\n\t\t\tNOTE: Here we use MATLAB with the Multivariate Granger Causality Toolbox21.\nFor the behavioral data, calculate the mean reaction times for the stimulus-response compatible and incompatible conditions.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}