{
  "id": 13158,
  "origin_website": "Jove",
  "title": "Is My Mouse Pregnant? High-Frequency Ultrasound Assessment",
  "procedures": [
    "All the steps in this protocol follow the Guide for the Care and Use of Laboratory Animals published by the National Institutes of Health and have been approved by the Institutional Animal Care and Use Committee of New York University Grossman School of Medicine.\n1. Mating of mice for timed pregnancies\nPair the appropriate female mouse (usually a heterozygote) in a cage with the appropriate male mouse (usually a heterozygote) for overnight mating.\nSeparate the mice the next morning. Alternatively, continuously mate the female and male mice, thus increasing the chances of pregnancy.\n\tNOTE: However, an accurately timed pregnancy cannot be assured with the alternative, and staging of mouse embryos by ultrasound is not clear, especially when the disease process results in intrauterine growth retardation. If the embryos carrying the gene variant are assumed to be small, look for the larger wildtype littermates to gauge the gestational age.\n\t\nOptional: Look for the vaginal plug. If there is no vaginal plug, the female mouse has not been mated. If there is a vaginal plug, it is still likely that the female mouse does not become pregnant.\nTime the day after the overnight mating as E0.5.\nPerform imaging at E6.5–E.8.5 to determine pregnancy, and re-mate the mice if the mouse is not pregnant (see step 1.1).\n\tNOTE: At this stage, the female dam is not obviously pregnant to the eye; hence, the ultrasound imaging allows early determination and re-mating.\n2. Anesthesia and preparation of mouse\nPlace the pregnant mouse in the anesthetic induction chamber.\nMix isoflurane with either room air or medical oxygen, at a concentration of 2%–3% at 1 L/min flow rate to induce sedation of the pregnant mouse in the induction chamber.",
    "NOTE: Sedation typically occurs within 1–2 min. The mouse will be lying still, and her breathing will have slowed.\nQuickly transfer the mouse to the imaging platform. The imaging platform typically has heating elements as well, which can help keep the mouse warm.\nPlace the nose of the mouse into the anesthetic nosecone.\nQuickly re-route the isoflurane/oxygen mixture to the imaging platform nosecone. Maintain isoflurane at 2%–3% at 1 L/min flow.\nDetermine the level of sedation by paw pinch, corneal reflex, level of respiration, and any movement.\n\tNOTE: The corneal reflex can be initially determined by applying moisturizing ointment to the eyes to keep them from drying out while the mouse is anesthetized (the mouse does not close her eyes).\nWith the mouse lying supine (on its back), tape the paws to the imaging platform’s electrocardiogram (EKG) pads.\n\tNOTE: However, an EKG is not necessary for this kind of imaging.\nRemove the fur from the pregnant dam’s abdomen as follows:\n\t\nWet the abdominal fur thoroughly with 70% ethanol, including up to the lateral edges. Do not apply so much that there is run-off onto the platform.\n\t\tNOTE: Ethanol works better as a shaving lubricant than water.\nUse the razor blade to carefully shave the abdomen. Be careful not to cut the nipples.\nWipe the shaved fur off the abdomen with gauze or some wipes.\nAlternatively, use a depilatory cream after using the fur clippers to remove most of the fur.\n3. Transabdominal imaging of the (presumed) pregnant mouse\nAfter the abdomen is shaved, reduce the isoflurane to 1%–1.5%, still maintaining a flow rate of 1 L/min. Monitor the level of sedation by the level of respiration and any movements as well as paw pinch and/or corneal reflex.",
    "NOTE: The heart rate of the anesthetized mouse will typically be 400–500/min, depending on the core (rectal) temperature. For the purpose of a rapid pregnancy check, do not warm the mouse to a physiological core temperature; the heart rate will be closer to 400–450/min, but may drop further with an irregular rhythm should the mouse become cold with prolonged imaging.\n\t\nImportantly, make sure that the respirations are moderate in depth and regularity, not erratic or agonal (gasping: deep, slow, and erratic, with deep intercostal and subcostal retractions).\n\t\tNOTE: The respiratory rate of the non-ventilated, anesthetized mouse will typically be 60–100/min. See https://ahcs.ninds.nih.gov/ACUC_pages/pg_003_anesth_animals.html and https://az.research.umich.edu/animalcare/guidelines/guidelines-anesthesia-and-analgesia-mice.\nApply ultrasound (acoustic coupling) gel to the abdomen generously.\nPlace the imaging transducer on the abdomen to orient it in a horizontal plane: orient the probe to obtain a left-right orientation on the imaging system; the “dot” or ridge indicated on the side of the imaging probe should be facing right.\n\tNOTE: Sliding the imaging probe to the mouse’s right should shift the corresponding image on the ultrasound system to the mouse’s right (imagine looking “up” from the mouse’s tail—the mouse’s right will be left on the monitor).\n\t\nTypically, use the imaging system’s transducer mount and rail-manipulator system. Here, “free hand” imaging has been used in which the imaging transducer is hand-held (two hands are steadier than one) and which allows for more rapid movements around the abdomen. These movements, as will be outlined below, include both rotational and translational movements. However, this requires more practice.\nIdentify the bladder on the screen (Video 1).\nScanning caudally from the bladder, identify the vagina. Then, scanning slowly and smoothly in a cranial direction, identify the bifurcation of the vagina into the left and right uterine horns (Figure 2; Video 1).",
    "Begin the survey of the uterus (left and right uterine horns)13 (Figure 3; Video 2).\n\tNOTE: Up to mid-gestation (E10.5 or E11.5), the mouse embryos will be positioned along the right and left peripheries. As they grow, the more distal portions of the uterus and their corresponding embryos will turn outwards and posteriorly. As the embryos grow further (E15.5 and later, generally), the mouse fetuses will be positioned almost randomly in various directions, and it becomes difficult to “track” a uterus from proximal to distal.\n\t\nScan quickly simply to check if a mouse is pregnant or not. This rapid method requires only recognition of a gravid uterus and mouse embryos.\nAlternatively, take extra time to enumerate the embryos (live, dead, resorbed) in each uterine horn.\n\t\tNOTE: In general, a live embryo will exhibit distinct organs such as a heart, limbs, head with ventricles, and eyes. A dead embryo takes on a homogeneous, “mushy” appearance unless just dead. Resorbed embryos have a pinpoint echogenic spot in the middle of a gravid-looking uterus (Figure 4, Figure 5, Figure 6, Figure 7, Figure 8).\nTo determine if an embryo is truly alive, look for the heartbeat and/or blood flow.\n\t\tNOTE: Color Doppler flow mapping can aid in determining the presence of blood flow, both in the embryo and in the umbilical cord. In general, this may be applied to embryos older than E8.5.\nRecognize potential artifacts that may mimic a gravid uterus (Figure 9, Figure 10). In addition, as bowel gas and other ultrasound “shadow” artifacts may obscure segments of the uterine horn, perform the imaging from multiple vantage points to ensure adequate visualization of the uterus.",
    "After the survey is complete, wipe the gel from the abdomen with gauze or wipes. Try to remove as much as possible as the gel tends to cool the mouse down.\nUntape the paws, and remove the mouse from the anesthetic nosecone.\nGently move the mouse back into her cage. She should wake up and start moving around within a minute or so.\n\tNOTE: Genetically modified mice may take a little longer to recover from anesthesia and need to be watched more closely.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}