{
  "id": 6407,
  "origin_website": "Bio",
  "title": "Rapid Multiplexed Reduced Representation Bisulfite Sequencing Library Prep (rRRBS)",
  "procedures": [
    "DNA extraction and quantification (estimated time: overnight lysis + 2 h)DNA is extracted from tissues or cultured cells using QIAGEN QIAamp DNA micro or mini kit, depending on the size of the original sample, following manufacturer’s recommendations. The Qubit fluorometric device with dsDNA BR assay kit is then used to quantify DNA samples. To ensure efficiency of bisulfite conversion (Procedure F), 0.5% (2.5 ng) of unmethylated λ phage DNA can be added as a spike-in with 500 ng of sample DNA to provide an internal control. Enzymatic digestion (estimated time: overnight)For each sample, in a 0.2 ml PCR tube from a strip tube with individual caps, dilute 500 ng of DNA in DNase/RNase-free water for a final volume of 26.8 μl. Note: Use 0.2 ml PCR strip tubes with individual caps at every step to avoid contamination of your samples. Prepare a master mix of MspI enzyme by mixing 3 μl of 10x NEB Buffer 2 and 0.2 μl of 100 U/μl MspI enzyme per reaction (Table 1). Table 1. Preparation of MspI digestion miximgsrc:https://en-cdn.bio-protocol.org/attached/image/20190217/20190217183830_2149.jpgAdd 3.2 μl of the master mix to each sample tube. Mix by pulse vortexing and briefly centrifuge (i.e., spin down) reaction. Incubate the digestion reaction in a thermocycler overnight at 37 °C, with lid set at 42 °C.Gap filling and A-tailing (estimated time: 1 h)Gap filling and A-tailing are achieved using Klenow fragment and a dNTPs mixture (10 mM dATP, 1 mM dCTP, 1 mM dGTP).Prepare the dNTPs mixture by mixing 176 μl of DNase/RNase-free water, 20 μl of dATP (100 mM), 2 μl dCTP (100 mM) and 2 μl dGTP (100 mM). Aliquots of dNTPs can be stored at -20 °C for future rRRBS experiments.",
    "For each sample, prepare a master mix by combining 1 μl of the dNTP mixture and 1 μl of Klenow fragment enzyme (Table 2). Table 2. Preparation of gap filling and A-tailing miximgsrc:https://en-cdn.bio-protocol.org/attached/image/20190217/20190217183849_9958.jpgWithout deactivating MspI digestion, add 2 μl of the master mix in each sample tube. Mix by pulse vortexing and briefly centrifuge. Place tubes back in the thermocycler for a cycle of 20 min at 30 °C and 20 min at 37 °C. The lid should not be heated. Bead clean-up (estimated time: 1 h 30 min)After the gap filling and A-tailing step, AMPure XP magnetic beads in PEG solution are used to clean up the reactions from previous reagents. To improve resuspension of the beads later on, warm up EB buffer in a heating block at 55 °C. Note: Warming up the EB buffer at 55 °C will facilitate the resuspension of the beads, especially if they are over dried.Add 64 μl of beads (2x ratio of beads [Note 1]) to each sample. Mix by slowly pipetting up and down at least 10 times. Incubate mixture for 30 min at room temperature.Add 0.2 ml tubes on a DynaMagTM-96 Side magnet for 5 min. At this stage, DNA is bound to the AMPure XP magnetic beads. Without disturbing the beads, carefully remove and discard the supernatant.Wash the beads by adding 100 μl of 80% freshly prepared ethanol. Incubate for 5 min and remove EtOH without disturbing the beads.Repeat Step D5 for a second wash.Remove the residual EtOH with a P10 pipet.Dry the beads for about 5 min. Do not over dry (i.e., bead ring appears cracked if over dried) as this will significantly decrease elution efficiency (Note 2).",
    "Remove the tubes from the magnetic rack and resuspend the beads in 26 μl warmed EB buffer by repetitive pipetting, and incubate for 2 min at room temperature (not on the rack). Place the tubes back in the magnetic rack and incubate for at least 5 min. Make sure all the beads are bound to the wall of the tube.Carefully remove the supernatant without taking any beads and transfer into a new PCR tube.Adapter ligation and bead clean-up (estimated time: 2 h)The next stage is to ligate the adapters for the future qPCR amplification and index fixation steps. Here, the NEBNext® Multiplex Oligos for Illumina® (Methylated Adapter, Index Primers Set 1) kit is used in combination with the T4 DNA ligase.For each reaction, prepare a master mix of 8.5 μl of DNase/RNase-free water, 5 μl of T4 DNA ligase enzyme 10x buffer, 10 μl of NEB methylated adapters and 1.5 μl of T4 DNA ligase. It is crucial to use methylated adapters to avoid any incompatibility at the amplification step with the index primers. If non-methylated adapters are used, the bisulfite treatment will convert non-methylated cytosine into thymidine, and this will interfere with the recognition of the adapter sequence in future reactions (Table 3).Table 3. Preparation of adapter ligation miximgsrc:https://en-cdn.bio-protocol.org/attached/image/20190217/20190217183924_3298.jpgOn ice, add 25 μl of the master mix to each 26 μl DNA sample. Mix by pulse-vortexing and briefly centrifuge.Incubate for 20 min at 20 °C in a thermocycler with a non-heated lid. Remove the tubes from the thermocycler and add 3 μl of USER enzyme (included in NEBNext® Multiplex Oligos kit) to every reaction. Keep the reaction tubes at room temperature while adding the enzyme. Mix by pulse-vortexing, briefly centrifuge and place the tubes back in the thermocycler for 15 min at 37 °C with a non-heated lid.",
    "Note: A second AMPure XP magnetic bead clean-up step is performed.Add 55 μl of beads to each sample. Mix by slowly pipetting up and down at least 10 times. Incubate for 5 min at room temperature.Place the tubes on a DynaMagTM-96 Side magnet for 5 min. At this stage, DNA is captured by the beads. Without disturbing the beads, carefully remove and discard the supernatant.Wash the beads by adding 100 μl of 80% freshly prepared EtOH. Incubate for 5 min and remove EtOH.Repeat Step E9 for a second wash.Remove the residual EtOH with a P10 pipet.Dry the beads for about 5 min. Do not over dry (Note 2).Remove tubes from the magnetic rack, resuspend the beads in 25 μl warmed EB buffer, and incubate for 2 min at room temperature (not on the magnetic rack). Place the tubes back in the magnetic rack and incubate for at least 5 min to make sure all the beads stick to the magnet.Carefully remove the supernatant without taking any beads and put into a new PCR tube.Note: The samples can be frozen (-20 °C) at this time to continue later (Note 3). Bisulfite conversion (estimated time: 3 h)Sodium bisulfite DNA treatment allows for discrimination between methylated and unmethylated cytosines. Compared to previously described RRBS methods, our bisulfite conversion procedure reduces significantly time associated with this step. Since sodium bisulfite-treated DNA is more sensitive to freezing and thawing, it is better to perform the bisulfite conversion and the amplification of rRRBS libraries without stopping to avoid any degradation (Note 3). (Table 4)Table 4. Preparation of sodium bisulfite conversion reaction (from QIAGEN EpiTect Fast bisulfite kit)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190217/20190217183945_6589.jpgAdd 85 μl of bisulfite mix to each 25 μl DNA sample. Pipet up and down for at least 10 times.Add 30 μl of DNA protect buffer.",
    "Mix by pulse-vortexing, briefly centrifuge and place tubes in the thermocycler.Run 2 cycles: 95 °C for 5 min and 60 °C for 20 min as recommended by the manufacturer’s protocol.During the last minutes of incubation, a preparation of carrier RNA (QIAGEN EpiTect Fast bisulfite kit) is made by mixing the appropriate quantity of carrier RNA with BL buffer following the indication from the kit handbook. For the second part of the bisulfite reaction procedure (i.e., cleanup steps), follow the manufacturer’s protocol. To elute the DNA, carefully add 15 μl of EB buffer in the middle of the column and incubate at room temperature for 5 min, then centrifuge for 1 min at full speed. Elution step is repeated with another 15 μl of EB buffer.Amplification of rRRBS librariesThis step, one of the main improvements of our approach, uses a quantitative-PCR (qPCR) method to directly monitor the final amplification of rRRBS libraries to minimize the over cycling effect. In previous protocols, samples were tested with varying PCR cycle numbers to determine the minimal cycle number to be used in the final library preparation. For each sample, the appropriate number of cycles was determined by visualizing the PCR reactions on gel electrophoresis, and then a final library amplification step was performed on the rest of the samples. This protocol is therefore faster and accurately defines the appropriate number of PCR cycles required for library amplification. Prepare a large-scale PCR mix reaction for each sample following the indication provided in Table 5. NEB Universal primer and Indexing primers are provided with the methylated adapter’s kit. SYBR Green is diluted to 10x in water from 10,000x stock.Table 5. Preparation of qPCR mix for library amplificationimgsrc:https://en-cdn.bio-protocol.org/attached/image/20190217/20190217184002_4563.",
    "jpgDivide the 200 μl reaction mix of each sample by distributing 25 μl in individual wells of an 8-strip PCR tube (0.2 ml). Insert PCR strips into the Roche LightCycler96 qPCR instrument and run under conditions indicated in Table 6.Table 6. qPCR amplification protocolimgsrc:https://en-cdn.bio-protocol.org/attached/image/20190217/20190217184019_0840.jpgStop the qPCR reaction at the end of the linear phase of amplification, after about 12 to 15 cycles, before the plateau phase is reached (Figure 2). Note: When various libraries are amplified simultaneously, they might not all reach the plateau phase at the same time. Samples with adequate amplification can be quickly removed at the end of an amplification cycle, and transferred to another PCR machine for the final 7 min of extension step.  Perform a final extension step of 7 min at 72 °C. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190217/20190217183657_6435.jpgFigure 2. Schematic of qPCR library amplification plots. A. The red line represents the total amplified product accumulation at each qPCR cycle. The blue rectangle represents the period when the qPCR library amplification should be stopped; following the exponential phase and just before the plateau phase. B-C. Examples of library amplifications for 2 sample (each separated in 8 wells) stopped at (B) cycle 14 and (C) cycle 16.Clean-up and size selection of rRRBS libraries (estimated time: 1 h 30 min)After amplification of rRRBS libraries by qPCR, the last clean-up step is performed using AMPure XP magnetic beads to remove reagent and primer-dimers. For each sample, pool all 8 PCR reactions into a 1.5 ml low-binding DNase/RNase-free tube. Calculate the precise volume of each reaction and add the same volume of beads to the PCR reaction to have a 1x ratio (Note 1) (i.e., add 200 μl of beads if 200 μl of reaction remains after the PCR). Mix by pipetting up and down.",
    "The DNA/bead 1x ratio will remove most fragments below 200 bp and all smaller fragments below 100 bp.Incubate for 15 min at room temperature and gently tap the tube every 5 min to mix beads and DNA. Place tubes in a magnetic rack and let stand 10 min. Carefully remove and discard the supernatant without disturbing the beads.By keeping the tubes on the magnetic rack, wash the beads by adding 1 ml of 80% freshly prepared EtOH. Incubate for 5 min and remove EtOH.Repeat Step H6 for a second wash.Remove the residual EtOH with a P20 pipet.Dry the beads for about 10 min. Do not over dry (Note 2). Remove the tube from the magnetic rack and resuspend the beads in 40 μl of pre-warmed EB buffer. Mix by pipetting, and incubate for 5 min at room temperature (not on the rack). Put the tubes back in the magnetic rack and incubate for at least 5 min to ensure all the beads stick to the magnet.Carefully remove the supernatant without taking any beads and transfer the solution into a new 1.5 ml tube.Quality control (estimated time: 1 h 30 min)Assess the quality and concentration of the sample by performing a High Sensitivity DNA Assay on the 2100 Bioanalyzer instrument. Concentration varies depending on the original amount of input DNA and the efficiency of the different steps. The peak should be between 200 bp and 300 bp, and concentration at approximatively 5 ng/μl or higher. If a peak of primer-dimer is visible on the Bioanalyzer, at a length of about 75 bp or 150 bp (see Figure 3), perform a second DNA/beads cleanup and repeat the Bioanalyzer quality assessment before sequencing.",
    "Note: If you observe a peak at around 75 bp or 150 bp, perform a second DNA/beads clean-up with a 1x ratio of beads to get rid of all the primer-dimer as those smaller fragments can affect the quality of the sequencing.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190217/20190217183714_9023.jpgFigure 3. Quality controls of the final libraries by Bioanalyzer. A. Example of a good library with the major peak between 200 bp and 300 bp, no significant peak is observed at a lower size. B. Example of a library containing primer dimers (significant peak at ~75 bp and/or 150 bp). For this sample, a second bead clean-up (with 1x ratio of beads) would have to be performed to remove the primer dimers before sequencing the library.SequencingPaired-end sequencing (> 100 bp read length) of libraries is performed on Illumina apparatus. The number of multiplex libraries per sequencing lane depends on the sequencing technology used and the species investigated (i.e., the total number of CpG of species) (Doherty and Couldrey, 2014). One should aim to obtain at least 20-30 million reads per sample for downstream bioinformatics analysis."
  ],
  "subjectAreas": [
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}