{
  "id": 3474,
  "origin_website": "Cell",
  "title": "Protocol for the Bottom-Up Proteomic Analysis of Mouse Spleen",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nTissue Homogenization\nTiming: 2–3 h\nPrior to protein extraction for mass spectrometric analysis, a crucial step of comparative proteomic studies is the reproducible homogenization of the biological material of interest. In the case of small tissue/organ specimens from mice such as the spleen, a handheld device is in our experience ideal for swift and efficient tissue homogenization in small sample volumes (Dowling et al., 2020[href=https://www.wicell.org#bib7]). Various types of handheld devices are available. In this protocol, the Kinematica Polytron model PT1200E was used for the efficient homogenization of mouse spleen specimens. During the initial preparation of tissue extracts, buffers should be supplemented with a suitable protease inhibitor cocktail to avoid the degradation of potentially sensitive proteins. Treatment at 95°C is a suitable approach to counteract the masking effect that highly abundant proteins such as albumin have with respect to maximizing the number of proteins identified in biological samples (Chiangjong et al., 2019[href=https://www.wicell.org#bib4]). High temperature precipitation of thermolabile proteins is a relatively straightforward step and compares favorably to optimize demanding protocols for high abundant protein removal such as immunodepletion. For mass spectrometric analyses, sufficient biological and technical repeats should be used for the statistical evaluation of protein hits. Ideally, n=6 biological repeats and n=2 technical repeats per specimen of interest are employed to account for potential biological and bioanalytical variations.\nHomogenize mouse spleen tissue (25 mg wet weight) using a handheld homogenizer in 150 μL of homogenization buffer, supplemented with 1× protease inhibitor cocktail. The ratio of tissue to buffer should be 1:6 (mg/μL).\nHeat the suspension at 95°C for 5 min.\nSonicate the suspension using 4 bursts of 5 s to shear the DNA to reduce the viscosity of the sample.\nCentrifuge the suspension at 20,000 × g for 10 min to clarify the homogenate.",
    "Determine protein concentration using the Pierce 660 nm protein assay kit.\nProtein Determination\nTiming: 1–2 h\nFor comparative proteomic studies, it is crucial to accurately determine the protein concentration in individual samples. This can be conveniently carried out with a variety of commercially available protein assays. In this protocol, the Pierce 660 nm Protein Assay system (Antharavally et al., 2009[href=https://www.wicell.org#bib2]) and pre-prepared protein standards were employed for the swift determination of protein concentration. Since the protocol described here uses detergents during the homogenization step, ionic detergent compatibility reagent has to be added to the protein assay reagent.\nAdd 10 μL of each protein standard, such as bovine serum albumin (25, 50, 125, 250, 500, 750, 1,000, 1,500 and 2,000 μg/mL), the unknown samples and the appropriate blank sample (homogenization buffer) into a microplate well in triplicate.\nAdd 150 μL of the protein assay reagent (supplemented with ionic detergent compatibility reagent) to each well.\nCover plate and mix on a plate shaker at medium speed (of approximately 600 rpm) for 1 min and incubate at 20°C for 5 min.\nUse the blank wells to zero the plate reader. Measure the absorbance of the standards and unknown samples at a wavelength of λ = 660 nm.\nPrepare a standard curve by plotting the average blank-corrected 660 nm measurement for each bovine serum albumin standard versus its concentration in μg/mL.\nUse the standard curve to determine the protein concentration of each unknown sample, using a four-parameter (quadratic) curve fit.\nProtein Digestion\nTiming: 10–24 h",
    "A key step of bottom-up proteomics is the controlled digestion of protein mixtures with a suitable protease. The most commonly used protease is trypsin and is also employed in this protocol. Alternative digestion strategies can be carried out with the enzyme Lys-C or combinations of Lys-C and trypsin, as well as a variety of other proteases or chemicals (Murphy and Ohlendieck, 2018[href=https://www.wicell.org#bib15]). The workflow of tissue homogenization, protein determination, and protein digestion, as well as the subsequent peptide mass spectrometric analysis, protein identification, and bioinformatic analysis, is summarized in the flowchart of Figure 2[href=https://www.wicell.org#fig2]. In this protocol, a filter-aided sample preparation approach, usually abbreviated as FASP, is used for processing the sodium dodecyl sulfate-solubilized spleen cells in a centrifugal filter unit (Wiśniewski, 2018[href=https://www.wicell.org#bib29]). The disposable centrifugal ultrafiltration units can be conveniently used for the sequential removal of excess detergent, the controlled trypsination of proteins and the subsequent isolation of generated peptide populations. Prior to conducting filter-aided sample preparations, the appropriate cutoff size of the filter units (e.g., 10,000, 30,000 or 50,000 MWCO) should be evaluated for particular samples and types of analyses. For optimum chromatographical separation and subsequent mass spectrometric analysis, the choice of molecular weight cutoff should on the one hand prevent the retention of interfering chemicals and on the other hand not result in the loss of peptides/proteins. In our experience, the usage of smaller pore size cutoff filters (10 kDa) results in the retention of chemicals that can alter chromatography. Using a filter with a 30 kDa pore size reduces this interference greatly resulting in more reproducible data.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/305-Fig2.jpg\nFigure 2. Workflow of the Comparative and Mass Spectrometry-Based Proteomic Profiling of the Spleen from Wild Type versus the Dystrophic mdx-4cv Mouse Model of Duchenne Muscular Dystrophy\nThe corresponding experimental steps are listed in parentheses.",
    "Combine 25 μg of sample homogenate (maximum volume of 30 μL) with 200 μL urea buffer in the Sartorius Vivacon 500 centrifugal filter unit.\nBriefly vortex and centrifuge at 14,000 × g for 15 min.\nAdd 200 μL of urea buffer to the filter unit, briefly vortex and then centrifuge at 14,000 × g for 15 min. Discard the flow-through solution.\nAdd 100 μL of iodoacetamide solution. This solution is light sensitive. Therefore, the filter units should be covered in tinfoil.\nMix this solution at 600 rpm in a thermomixer for 1 min and incubate without mixing for 20 min in the dark.\nCentrifuge at 14,000 × g for 15 min.\nAdd 100 μL urea buffer to the filter unit.\nBriefly vortex and centrifuge at 14,000 × g for 15 min.\nRepeat this step by adding 100 μL urea buffer, followed by vortexing and centrifugation at 14,000 × g for 15 min.\nAdd 100 μL of ammonium bicarbonate buffer.\nBriefly vortex and centrifuge at 14,000 × g for 15 min.\nRepeat this step by adding 100 μL ammonium bicarbonate buffer, followed by vortexing and centrifugation at 14,000 × g for 15 min.\nTransfer the filter units to new collection tubes.\nAdd 40 μL of trypsin-containing digestion buffer and keep this solution on ice.\nMix the solution at 600 rpm in a thermomixer for 1 min.\nIncubate the filter units in a wet chamber. This can be constructed with a pipette box containing water and soaked tissue sheets and tubes held in foam floater, as illustrated in Figure 3[href=https://www.wicell.org#fig3]. Incubation should be carried out in a sterile incubator at 37°C for 4–18 h.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/305-Fig3.jpg",
    "Figure 3. Image of a Pipette Box Containing Water and Soaked Tissue Sheets and Filter Unit Tubes Held in Foam Floater for Incubation in a Wet Chamber (Step 27)\nPlace filter units in new collection tubes.\nCollect the peptide-containing filtrate by centrifugation at 14,000 × g for 10 min.\nAdd 40 μL of ammonium bicarbonate buffer and re-centrifuge the filter units at 14,000 × g for 10 min.\nAdd 60 μL of each sample to new Eppendorf tubes and add 15 μL of sample buffer (containing 2% (v/v) trifluoroacetic acid and 20% (v/v) acetonitrile), so that the peptide sample solution contains 0.5% trifluoroacetic acid in 5% acetonitrile.\nPeptide Clean Up to Remove Interfering Chemicals\nTiming: 1–3 h\nIn order to remove interfering chemicals prior to mass spectrometric analysis, peptide-containing samples are washed and centrifuged prior to elution and liquid chromatographical separation.\nPlace C18 spin tubes into receiver tubes.\nAdd 200 μL of Activation Solution to rinse walls of the C18 spin tubes and to wet resin.\nCentrifuge at 1,500 × g for 1 min and discard flow-through solution.\nRepeat steps 33 and 34.\nAdd 200 μL Equilibration/Wash Solution.\nCentrifuge at 1,500 × g for 1 min and discard flow-through solution.\nRepeat steps 35 and 36.\nPipette sample on top of resin bed.\nPlace C18 spin tubes into receiver tubes.\nCentrifuge at 1,500 × g for 1 min.\nTo ensure complete binding, recover flow-through and repeat steps 39–41.\nPlace C18 spin tubes into new receiver tubes.\nAdd 200 μL Equilibration/Wash Solution to C18 spin tube and centrifuge at 1,500 × g for 1 min and discard flow-through solution.\nRepeat step 44.\nPlace C18 spin tubes in new receiver tubes.\nAdd 20 μL of Elution Buffer to top of the resin bed.\nCentrifuge at 1,500 × g for 1 min.",
    "Repeat steps 47 and 48 with same receiver tubes.\nGently dry sample in a vacuum evaporator and resuspend sample in 50 μL of resuspension buffer, so that the peptide sample solution contains 2% (v/v) acetonitrile and 0.1% (v/v) trifluoroacetic acid.\nLiquid Chromatography-Mass Spectrometry Using Orbitrap Fusion Tribrid\nTiming: 12–72 h (depending on the number of samples to be analyzed by LC-MS)\nA key bioanalytical step of bottom-up proteomics is the peptide-centric identification of protein species. Peptides generated by trypsin treatment are separated by reverse-phased liquid chromatography and then analyzed by mass spectrometry (Sethi et al., 2015[href=https://www.wicell.org#bib22]). The amino acid sequence information of individual peptides is combined and then used for the systematic identification of individual proteoforms.\nUsing a liquid chromatography system (for example the Thermo Scientific UltiMate 3000 UHPLC), load 2 μL of protein digest onto the trapping column (PepMap100, C18, 300 μm × 5 mm - Thermo Fisher Scientific) at a flow rate of 25 μL/min with trapping buffer for 3 min before being resolved onto an analytical column (Acclaim PepMap 100, 75 μm × 50 cm, 3 μm bead diameter column).\nElution of peptides is carried out with the following binary gradient; LC Solvent A and LC Solvent B using 2%–32% Solvent B for 75 min, 32%–90% Solvent B for 5 min and holding at 90% for 5 min at a flow rate of 300 nL/min.\nFor peptide identification analysis, a data-dependent acquisition method is selected using a voltage of 2.0 kV and a capillary temperature of 320°C.\nData-dependent acquisition with full scans in the 380–1,500 m/z range is performed using an mass analyzer (for example the Thermo Scientific Orbitrap Fusion Tribrid) with a resolution of 120,000 (at m/z 200), a targeted automatic gain control (AGC) value of 4E+05 and a maximum injection time of 50 ms.",
    "The number of selected precursor ions for fragmentation is determined by the top-speed acquisition algorithm.\nSelected precursor ions are isolated in the Quadrupole with an isolation width of 1.6 Da.\nPeptides with a charge state of 2+ to 7+ are analyzed and a dynamic exclusion is applied after 60 s.\nPrecursor ions are fragmented using higher energy collision-induced dissociation with a normalized collision energy of 28%. Resulting MS/MS ions are measured in the linear ion trap.\nThe typical MS/MS scan conditions are as follows: a targeted AGC value of 2E+04 and a maximum fill time of 35 ms.\nPeptide and Protein Identification\nTiming: 2–3 h\nIn order to analyze mass spectrometric files, commercially available software programs can be used. It is crucial to define suitable search parameters for proper protein identification.\nFor data analysis of mouse proteins, mass spectrometric files (.raw) are searched against the UniProtKB-SwissProt Mus musculus database with Proteome Discoverer 2.2 using Sequest HT and Percolator.\nLocate the proteome for your organism of interest by searching by name or by taxonomy ID (i.e., Mus musculus for Mouse) at https://www.uniprot.org/proteomes/[href=https://www.uniprot.org/proteomes/].\nClick on the Proteome ID link - UP000000589.\nUniProt offers different databases to select from, including reviewed (UniProtKB/Swissprot), unreviewed (UniProtKB/TREMBL) or both (UniProtKB) options. In model organisms such as mice, which are researched extensively, reviewed (Swissprot) databases contain highly curated (i.e., carefully annotated) entries, a minimal level of redundancy and the ability to integrate with other databases efficiently.\nClick on the Download button and choose: All protein entries, Fasta (Canonical and isoform), compressed.\nThe following search parameters are a useful guide for protein identification:\nPeptide mass tolerance set to 10 ppm.\nMS/MS mass tolerance set to 0.6 Da.\nUp to two missed peptide cleavages should be allowed.\nCarbamidomethylation of cysteine set as a fixed modification.",
    "Methionine oxidation set as a variable modification.\nImportantly, only highly confident peptide identifications with a false discovery rate (FDR) ≤ 0.01, identified using a SEQUEST HT workflow coupled with Percolator validation in Proteome Discoverer 2.2, should be considered.\nComparative Protein Abundance Profiling Using Progenesis QI Analysis\nTiming: 6–48 h\nThe comparative proteomic analysis of different protein populations can be carried out by commercially available software programs. For example, protein extracts of tissue preparations from wild type versus mutant specimens can lead to the identification of hundreds of differentially expressed protein species. This protocol is based on the recent proteomic profiling of the spleen from normal versus dystrophic mdx-4cv mice (Dowling et al., 2020[href=https://www.wicell.org#bib7]).\nUsing Progenesis QI (Waters) for comparative abundance profiling, mass spectrometric raw files are imported into the software and automatic run alignment can be used to combine and compare the result from different LC-MS runs.\nAutomatic peak picking and matching across all data files is carried out to create an aggregate dataset from the aligned runs. For a representative example, see Figure 4[href=https://www.wicell.org#fig4].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/305-Fig4.jpg\nFigure 4. Aggregate Dataset from Aligned Runs\nShown is a representative example of a reference run that other samples are aligned to (step 68).\nThis contains all peak information from all sample files used and allows the detection of a single map of peptides.\nThis map is then applied to each sample, giving 100% matching of peaks with no missing values.\nThe peptide ion abundance measurements are normalized allowing for the comparisons between the wild type and the mutant specimens in order to identify peptides of biological interest. For a representative example, see Figure 5[href=https://www.wicell.org#fig5].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/305-Fig5.jpg\nFigure 5. Comparisons between Wild Type and Mutant Specimens in Order to Identify Peptides of Biological Interest",
    "Shown is a representative example of clustering (wt samples marked in purple vs mdx-4cv samples marked in orange) based on significant peptides (step 71).\nThe peptide ions of interest are determined based on the significance measure of ANOVA with a p-value of 0.05.\nMS/MS spectra from these peptides are exported and identified using the process above using Proteome Discoverer 2.2 software. For user guides and tutorial datasets of Progenesis QI for proteomics, see: http://www.nonlinear.com/progenesis/qi-for-proteomics/v4.0/user-guide/[href=http://www.nonlinear.com/progenesis/qi-for-proteomics/v4.0/user-guide/]).\nThe result file is re-imported in Progenesis QI which allows a review of all the peptide ions used to quantify and identify individual protein species.\nThe proteins of interest are then determined based on the significance measure of ANOVA with a p-value of 0.05.\nIt is crucial to review quality control metrics before finalizing the list of significant proteins with a changed abundance. Critical metrics to be considered include:\nSample preparation metrics – highlighting issues or problems with the preparation of your samples, for example problems due to missed peptide cleavages.\nInstrument metrics – highlighting whether your chromatography column and mass spectrometer are configured and performing correctly, for example issues with column deterioration.\nExperiment metrics – concerning the identified proteins and peptides in your experiment, for example the identification of statistical outliers in the sample set.\nSystems Bioinformatics\nTiming: days to weeks",
    "For further analyses of proteomic datasets and sequence information of individual proteoforms of biological or pathophysiological interest, a large variety of publicly accessable bioinformatics programs are available. Bioinformatics can be used to model protein structures, determine the distribution of distinct protein families within large proteomic datasets, evaluate the affiliation of individual proteins to biochemical pathways or protein assemblies, and establish potential protein-protein interaction patterns between identified proteoforms (Na and Paek, 2020[href=https://www.wicell.org#bib18]). Below listed are commonly employed search programs for the systematic analysis of proteomic data.\nProteomic datasets and peptide sequences can be further analyzed by a variety of bioinformatic software programs, such as:\nUniProt (https://www.uniprot.org[href=https://www.uniprot.org]): Comprehensive database of protein sequence and functional information.\nBLAST (https://blast.ncbi.nlm.nih.gov[href=https://blast.ncbi.nlm.nih.gov]): BLASTP is an algorithm and search program for comparing amino acid sequences of proteins.\nPANTHER (http://www.pantherdb.org[href=http://www.pantherdb.org]): The PANTHER classification system is a large curated biological database of gene/protein families and their functionally related subfamilies that can be used to classify and identify the function of gene products.\nSTRING (https://string-db.org[href=https://string-db.org]): Program for the identification of protein-protein interaction networks and functional enrichment analysis.\nREACTOME (www.reactome.org[href=http://www.reactome.org]): Database that provides a bioinformatics tools for the visualization and analysis of biological pathways.\npiNET (www.pinet-server.org[href=http://www.pinet-server.org]): Server for peptide-centric post-translational modification mapping, differential expression analysis, gene (protein) enrichment analysis, and Library of Integrated Network-based Cellular Signatures (LINCS) connectivity mapping.\nDAVID (https://david.ncifcrf.gov[href=https://david.ncifcrf.gov]): Database for annotation, visualization, and integrated discovery that provides a comprehensive set of functional annotation tools for studying the biological meaning of large lists of genes.\nKEGG (https://www.genome.jp/kegg/[href=https://www.genome.jp/kegg/]): Database resource for studying high-level functions and utilities of biological systems using large-scale molecular datasets.\nPhyre2 (http://www.sbg.bio.ic.ac.uk/∼phyre2[href=http://www.sbg.bio.ic.ac.uk/%7Ephyre2]): Automatic fold recognition server for predicting the structure of peptide and protein sequences.\nVerification Analysis\nTiming: weeks to months",
    "Mass spectrometry-based proteomics is an unbiased and technology-driven approach in exploratory bioresearch. Thus, the design of a comparative proteomic study is not necessarily based on a specific biological hypothesis, but is instead valuable in formulating novel research questions. Proteomic findings can therefore form the rationale for new bioanalytical avenues in a specific area of research. This frequently includes crucial and independent verification experiments to confirm proteomic findings (Dowling et al., 2020[href=https://www.wicell.org#bib7]). Below listed are a few of the most commonly performed experiments to further investigate the biological or pathophysiological meaning of findings from proteomic surveys.\nTo confirm and interpret proteomic hits or data from comparative mass spectrometric studies, a large variety of standard biochemical and cell biological techniques are used, including:\nImmunoblotting\nEnzyme assays\nProtein binding assays\nImmunofluorescence microscopy\nPhysiological assays"
  ],
  "subjectAreas": [
    "Model Organisms",
    "Proteomics",
    "Mass Spectrometry",
    "Protein Biochemistry",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}