{
  "id": 9428,
  "origin_website": "Jove",
  "title": "Genetic Manipulation of the Mouse Developing Hypothalamus through In utero Electroporation",
  "procedures": [
    "1. Preparation of DNA and Glass Micropipettes for Injection\nGood quality glass micropipettes are essential to reduce initial high abortion rate due to loss of amniotic fluid. The procedure to pull glass micropipettes has been well documented13,18,25. Use 1.2 mm diameter capillaries pulled in a conventional Sutter P-97 device with the settings P=500; Heat=300; Pull=40; Velocity=50; Time=50. Fit the puller with 3 mm \"trough\" filaments (Sutter Instrument FT330B). The 2 mm size filaments have yielded for us less satisfactory results. On the other hand, beveling of the micropipette tips does not seem to improve results for us.\nDissolve purified, endotoxin-free plasmid DNA in PBS (Cell Culture Grade) containing 0.1% Fast Green to a final concentration of 1 to 2 μg/μl. The Fast Green will make the injected solution visible in the embryonic brain ventricle.\nLoad 10 μl of the DNA solution into the glass micropipette.\nConnect the glass micropipette to the injection system (Pico Pump) or mouth pipette.\n2. Anesthesia\nPrepare the surgical table with a heating pad and the surgical instruments. Turn on the cold-light sources to facilitate the visualization of the embryos. Disinfect the surgical tools using for instance a glass bead sterilizer.\nThree different anesthesia procedures are possible for this protocol (see Discussion). Here we will describe the one we consider the best, using isoflurane inhalation for anesthesia induction (flow rate 0.5 L/min) as well as maintenance (flow rate 1 L/min).\nIntroduce the pregnant mouse in a small transparent (so the mouse remains visible) container connected to the Komesaroff Mark 5 Anesthetic Device by a short length of tubing.\nFill the vaporizer with isoflurane, then open the oxygen bottle attached to the device. Blow one or two pulses of isoflurane/oxygen (0.5 L/min) into the container holding the mouse and watch for narcosis to set in.",
    "Take the mouse out, cover its eyes with ointment to prevent them from drying and fit the flow anesthesia mask on its head immediately.\n3. Laparotomy\nPlace the mouse belly up on the heating pad (otherwise its body temperature will go down very fast, decreasing chances of recovery) and secure its body into place by fixing its four legs to the sides with tape. Assess the depth of anesthesia by checking for loss of response to reflex stimulation (e.g. toe or tail pinch with firm pressure).\nShave the abdominal surface and disinfect it with the iodophorpovidone-iodine (Braunoderm).\nMake a longitudinal incision (1 to 1.5 cm long) on the abdominal skin. Then cut the peritoneum. Place cotton gauze around the incision. Make one uterine horn visible and pull it out carefully with blunt forceps onto the PBS-rinsed gauze. Rinse the uterus with PBS very often to keep it always moistened (Figures 2A and 2B). During the entire procedure avoid pulling the mesometrium or the uterus tight, since high pressure inside the uterus will transmit to the embryo increasing the chances of loss of fluid upon injection resulting in abortion.\n4. DNA Injection into the Brain Ventricle\nHold the uterus in such a way that the brain ventricles can be visualized. Do not extensively reposition an embryo that lies in an unfavorable position - this only increases the chances of abortion.",
    "Looking at the embryo's head from top, localize visually the gap or fissure between the left and right cortical hemispheres. The hemispheres are easy to distinguish and the lateral ventricles inside them (not to be targeted) can usually be perceived as somewhat darker shapes. If an embryo is found to be perfectly oriented for DNA injection (Figures 2C and 2D), it is possible to pierce the uterine wall and enter the third ventricle at once. Hold the glass micropipette at 45° to the uterine wall and puncture it at the rostral end of the gap between cortical hemispheres, penetrating for about 1 mm. In this way the tip of the glass micropipette will enter the third ventricle of the brain (not the lateral ventricle) (Figures 2C and 2D). In embryos less favorably oriented it is useful to first pierce the uterine wall (always at 45°) in the vicinity of the embryonic head, place the micropipette tip in the right position between the cortical hemispheres and only then perforate the brain. Inject about 1 μl of DNA solution into the third ventricle (a good injection fills the ventricle with green fluid). Repeat the same procedure with all embryos of one uterus horn. This allows some time for the DNA solution to mix evenly with the ventricular fluid and reach the entire neuroepithelium.\n5. Targeting the Hypothalamus for Electroporation\nSwitch the electroporator on and adjust settings according to the embryonic age (for E12.5 we use 5 square-wave pulses, 50 V, 50 msec ON/950 msec OFF). Use as positive pole the stainless steel needle electrode (CUY550-10) and as negative pole a round flat electrode (CUY700P4L). (It is important that the electrodes are smaller than the embryo, since otherwise the current just flows around the embryo but not through it.)",
    "Select for electroporation those embryos whose dorsal side is up (i.e. turned towards the experimenter) (as most of them are), and discard those whose orientation is not favorable. It is now safe to touch the uterus with ethanol-disinfected fingers or with gloves. Holding the uterus with forceps, however, would interfere with the flow of current during electroporation.\nPierce the uterine wall by the embryo's head between the amniotic sac and the placenta by thrusting downwards through it with the tip of the needle electrode. Use the index finger of the other hand as thrust block. About 5 mm of the electrode tip must be now between the amniotic sac and the uterine wall, at about the level of the midbrain (Figures 2E and 2F). Remember that this is the \"targeting electrode\", so its position will determine which part of the hypothalamic neuroepithelium is most likely to get transfected. The embryo has to be very gently \"squeezed\" between the electrodes.\nWith the other hand, position the round flat electrode outside of the uterus wall on the opposite side of the embryo's head (Figures 2E and 2G).\nUse the pedal switch to apply voltage (50 V, 50 msec ON, 950 msec OFF, 5 square-wave pulses).\nSlowly pull the needle electrode out of the uterus while holding back the uterus with the index finger of the other hand - if amniotic liquid is lost through the punctured wall, usually the embryo will undergo abortion. Repeat the procedure with all the embryos.\nReturn the uterus horn into the abdomen and repeat the injection and electroporation in the remnant horn.\n6. Finishing the Surgery",
    "After injection and electroporation of all embryos, place the uterus back into the abdomen very carefully, positioned exactly as they were before and moist the peritoneal cavity with saline before closing it.\nSuture the peritoneum with surgical catgut (Vicryl Polyglactin 910, 5-0, Ethicon V4914). For the closure of the skin use \"interrupted stitch\" methodwith a more resistant suture (Supramid Nylon, 6-0, Serag Wiessner TO 07171L).\nDisinfect the abdomen surface with povidone-iodine(Braunoderm)  and inject a non-steroid anti-inflammatory subcutaneously (e.g. 100 μl of a 1:10 solution of Rimadyl in 0.9% NaCl) or, even better, an opioid like buprenorphine (Temgesic, 0.05 to 0.1 mg/kg body weight in 0.9% NaCl)to relieve pain.\nRemove the mother from the anesthetic machine and place it in a cage which is heated by a heating pad. Monitor the mouse continually until it is completely recovered from the anesthesia. Later on, check the animals daily to insure they are recovering from the procedure without any sign of infection or pain.\n7. Analyzing the Results\nHarvest the embryos (or postnatals) according to the desired day of analysis. Postnatal mice (1 to 2 day old) are killed by decapitation.\nSeparate every embryo according to the previous electroporation annotation. Dissect the brain under a stereomicroscope and check under the microscope for green fluorescent signal (from the GFP reporter) in the appropriate region.\nThe selected brain can be analyzed \"fresh\": fix the tissue for a short time in 4% paraformaldehyde and embed in agarose 4% or in gelatin-albumin, then section on a vibratome-type device (Figure 3). For more detailed immunohistochemical analysis (Figure 4), cryo-protect the brain in 30% saccharose solution, embed in OCT mounting medium (Tissue Tek) then cut 20 μm sections in a cryostat.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}