{
  "id": 8871,
  "origin_website": "Jove",
  "title": "Sample Preparation for Endopeptidomic Analysis in Human Cerebrospinal Fluid",
  "procedures": [
    "The protocol described below is a refined version of the one used in a previous study where a large amount of endogenous peptides were identified in human CSF15. Updates to the original protocol involve minor alterations to the chemical pre-treatment of CSF as well as optimisation of the gradient used for offline high-pH RP HPLC pre-fractionation.\nEthical considerations\nAll studies of Swedish patient and control materials have been approved by ethical committees: St. Göran (ref. 2005-554-31/3). CSF samples from the Amsterdam Dementia Cohort and samples collected at the National Hospital for Neurology and Neurosurgery, London were used for research with written consent from all participating patients and approval from regional ethics committees. The material here utilized mainly consisted of left-over CSF from samples taken for the purpose of diagnosis and it was de-identified before being included in our studies. There is no possibility of tracing back the sample to any individual donor or group of donors.\n1. Extraction of Human Cerebrospinal Fluid (CSF):\nExtract CSF through lumbar puncture (must be performed by a trained physician) using a standardized protocol22.\nRemove cell debris and other non-soluble material by centrifugation at 2,500 x g for 20 min.\nVisually inspect CSF samples for discoloration that may indicate blood contamination resulting from puncture bleeding. The significantly higher protein concentration in blood and the presence of proteases may greatly affect the analytical results.\n2. Pre-treatment of CSF (1.5 mL Sample Volume, No Quantification):\nThaw 1.5 mL of CSF aliquots at room temperature (RT), transfer the contents to 10 mL polypropylene tubes and add 80 µL of 1 M Triethylammonium bicarbonate (TEAB) as a buffering agent.\nAdd 0.65 mL 8 M guanidinium hydrochloride (GdnHCl) (active concentration GdnHCl: 2.4 M) and vortex gently at RT for 10 min.",
    "NOTE: The chaotropic agent, GdnHCl, both affects solvent viscosity and interacts with the polypeptide chain, which results in protein unfolding being energetically favourable23. Thus, GdnHCl dissolves protein aggregates and increases recovery of endogenous peptides during subsequent filtration.\nAdd 60 µL of 200 mM of aqueous tris(2-carboxyethyl)phosphine hydrochloride (TCEP) (active concentration TCEP: 6 mM) and incubate at 55 °C for 1 h to reduce cysteine disulphides.\nAdd 35 µL of 400 mM iodoacetamide (IAA) (active concentration IAA: 4 mM) and incubate at RT in darkness for 30 min to alkylate cysteines. The addition of an alkyl group ensures that cysteine residues cannot spontaneously form new disulphide bridges at any point during subsequent sample preparation.\nAdd 3.25 mL of de-ionized water and vortex briefly to dilute the sample prior to MWCO filtration, resulting in a total sample volume of 5.5 mL. This step serves to dilute GdnHCl to below 1 M as a higher concentration has been observed to sometimes cause leaching of polymeric substances from the filter devices.\n3. Pre-treatment of CSF (10 x 150 µL Sample Volume, Isobaric Labelling-quantification):\nThaw 150 µL of CSF aliquots from 10 individuals at RT and subsequently transfer the contents to individual 1.5 mL low-binding micro centrifuge tubes and add 8 µL of 1 M TEAB as a buffering agent.\nAdd 65 µL of 8 M GdnHCl (active concentration GdnHCl: 2.4 M) and vortex gently at RT for 10 min.\nAdd 6 µL of 200 mM of aqueous TCEP (active concentration TCEP: 6 mM) and incubation at 55 °C for 1 h to reduce cysteine disulphides.\nAdd 3.5 µL 400 mM aqueous IAA (active concentration IAA: 6 mM) and incubate at RT and darkness for 30 min to alkylate cysteines.",
    "Prepare the isobaric labelling kit (e.g., Tandem Mass Tag 10plex isobaric labelling reagent). Allow the isobaric labelling-reagent vials to reach RT prior to opening them to avoid unnecessary reagent hydration, add 41 µL of HPLC-grade acetonitrile (AcN) and dissolve by gentle agitation for 5 min.\nTransfer 30 µL of isobaric labelling-reagent solution to the corresponding sample and incubate for 1 h at RT under gentle agitation. The isobaric labelling reagent includes an NHS-ester group which reacts with the primary amines present at peptide N-termini as well as with Lysine residues.\nAdd 8 µL of 5% hydroxylamine (active concentration hydroxylamine: 0.16%) and shake gently at RT for 20 min to quench the labelling reaction. Since the separately labelled samples are to be combined, ensure that the labelling reaction is quenched. By addition of an abundance of amine groups in the form of hydroxylamine, the remaining isobaric labelling reagent is allowed to react and is thus rendered inert.\nCombine the contents of each of the 10 individually labelled samples in a single 15 mL polypropylene tube.\nAdd 6.4 mL of de-ionized water to the combined sample and vortex briefly to reduce the AcN concentration from 12% to 3% and to the GdnHCl concentration GdnHCl to below 1 M as a higher concentration has been observed to sometimes cause leaching of polymeric substances from the filter devices.\n4. Molecular Weight cut-off Filtration\nIn order to remove potential contaminants, condition the MWCO filters by loading 10 mL of aqueous 1 M GdnHCl, 25 mM TEAB and centrifuging for 15 min at 2,500 x g and RT, discard the flow-through (FT).",
    "Load the whole sample volume on the filter (5 mL non-labelled CSF (step 2.5) or 10 mL isobarically-labelled CSF (step 3.9)) and centrifuge for 30 min at 2,500 x g and RT, leave the flow-through (FT) in the collection container. The result of the filtration is that peptides and small proteins are separated from larger proteins and residual cell debris. This step can be seen as the peptidomic equivalent to the use of proteolytic digestion of proteins to generate peptides in proteomic experiments.\nLoad 5 mL of 25 mM TEAB (aqueous) on the filters and centrifuge for 15 min at 2,500 x g and RT, in order to increase recovery of peptides.\nVortex the combined FTs from the two previous steps (a total 10 mL of non-labelled or 15 mL isobarically-labelled sample), and proceed to sample acidification.\n5. De-salting and Sample Clean-up by Solid Phase Extraction\nAcidify the filtered sample from step 4.4 prior to solid phase extraction (SPE). The acidification is performed in order to improve solute (peptide) interaction with the stationary phase of the SPE-cartridge.\nFor the non-labelled sample (volume 10 mL): add 550 µL of 1% Trifluoroacetic acid (TFA) - total volume of the sample: 10.55 mL with 0.05% TFA.\nFor the isobaric-labelled sample (volume 15 mL): add 20 mL 0.1% TFA to acidify and lower AcN concentration from 3% to 1% - total volume of the sample: 30 mL with 0.066% TFA.\n\tNOTE: TFA is also added for its function as an ion-pairing reagent, which improves retention of peptides not themselves capable of sufficiently strong hydrophobic interaction with the packing material of the SPE cartridge to be retained.\nIf pH >3, titrate the sample with 20% phosphoric acid until sample pH is <3.",
    "Condition the SPE cartridges by addition of 1 mL of 84% AcN, 0.1% formic acid (FA), and discard the FT. Repeat once. Conditioning of the cartridge filter is required to remove unwanted substances which would otherwise elute along with the peptides in subsequent steps; further, conditioning increases permeability of the filter.\nEquilibrate the SPE cartridge by addition of 1 mL of 0.1% TFA, discard FT. Repeat once. Ensure that the filter does not run dry after the last equilibration step - keep a small volume on top of the filter. Equilibration of the cartridge filter is performed in order to prepare the filter to retain peptides by removing the hydrophobic substance (acetonitrile) left from the conditioning step.\nLoad the whole sample volume (10.55 mL for non-labelled samples or 30 mL for isobarically-labelled samples), in several portions if necessary, and let the FT run into waste. Ensure that the cartridge does not run dry between sample loading rounds or after the last sample volume has been loaded - keep a small volume on top of the filter.\nPass 1 mL of 0.1% TFA over the filters to remove salts and reagents and discard the FT. Repeat once. Ensure that the cartridge does not run dry after each washing step - keep a small volume of liquid on top of the cartridge.\nPlace 1.5 of mL low binding micro centrifuge tubes under the cartridge and elute the sample by passing 1 mL of 84% AcN, 0.1% FA over the cartridge.\nRemove the solvents from the de-salted sample by evaporation in a vacuum centrifuge run without active heating until dry, store at -80 °C or proceed immediately to high-pH fractionation.\n6. Offline high-pH Reverse Phase HPLC Sample Fractionation\nPrepare aqueous high-pH (HpH) mobile phases:\n\tHpH Buffer A: Pure water",
    "HpH Buffer B: 84% AcN\n\tHpH Buffer C: 25 mM NH4OH\n\tHpH Loading buffer: 2.5 mM NH4OH, 2% AcN\n\tNote: HpH Loading buffer is used as transport solution and sample buffer\nRe-dissolve the sample in 16 µL HpH Loading buffer by gentle agitation for 20 min\nLoad 15 µL the sample on an HPLC system with an internal fraction collector for 96-deep-well plates configured according to Batth et al.20 with minor alterations. Fractionate at a flow of 100 µL/min over a pH-stable separation column (C18 3.5 µm, 2.1 mm x 250 mm) and collect one fraction per min over a linear 60 min gradient.\nUse the following gradient time-points: t = 0 min, B = 1%, C = 10%; t = 4 min, B = 1%, C = 10%, start fraction collection; t = 76 min, B = 70%, C = 10%; end fraction collection; t = 76.5 min, B = 85%, C = 10%; t = 80 min, B = 85%, C = 10%; t = 80.5 min, B = 1%, C = 10% and t = 90 min, B = 1%, C = 10%.\nCollect fractions repetitively in 12 wells in a circular pattern, thus concatenating fractions spaced by 12 min, resulting in 12 fractions, each containing 6 concatenated sub-fractions.\nRemove the solvent from samples by vacuum centrifugation at RT and 3000 rpm until dry, and store the samples at -80 °C prior to LC-MS analysis.\n7. LC-MS\nPrepare aqueous mobile phases:\n\tBuffer A: 0.1% FA\n\tBuffer B: 0.1% FA, 84% AcN\n\tLoading buffer: 0.05% TFA, 2% AcN\n\tNote: Loading buffer is used as transport solution, sample buffer and mobile phase for the loading pump.\nRe-dissolve each of the 12 fractions by addition of 6 µL loading buffer and shaking at RT for 20 min",
    "Load 5 µL sample on a nano-flow HPLC, operating in trap column configuration (trap column: 75 µm x 2 cm, C18, 100 Å pore size, 3 µm particle size; separation column: C18, 75 µm x 500 mm, 100 Å pore size, 2 µm particle size, and perform peptide separation at a flow rate of 150 nL/min using the following gradient: t = 0 min, B = 2%; t = 10 min, B = 2%; t = 11 min, B = 7%; t = 100 min, B = 26%; t = 170 min, B = 45%; t = 175 min, B = 80%; t = 181 min, B = 2%, and t = 210 min, B = 2%.\nPerform MS on high-resolution hybrid mass spectrometer connected to the HPLC via a nano-ESI interface. Record full scan spectra in MS mode at a resolution setting of 120,000 (2.0e5 AGC target) over the m/z range 350 - 1,400.\nOperate the mass spectrometer in data-dependent acquisition mode, select MS/MS spectra from the top ten most intense peaks with m/z > 150 and within the intensity range 1.0e4-1.0e5 for fragment ion analysis. Isolate precursor ions using a quadrupole isolation window of 1 m/z, maximum injection time of 100 ms and the RF lens at 60%.\nApply dynamic exclusion with an exclusion time of 15 s and an m/z tolerance of ±10 ppm. Perform fragmentation in the higher-collision energy dissociation (HCD) cell and record MS/MS acquisitions in the orbitrap at a resolution setting of 50,000 (5.0e4 AGC target value).\n8. Peptide Identification\nFor peptide identification submit the resulting .raw-files from the mass spectrometric analysis to a proteomics search engine applying the following settings:",
    "NOTE: In our previous study15, three search engines; Mascot v2.4, Sequest HT, and PEAKS v7.5 were used in parallel and the settings here specified were employed for all three search engines, unless otherwise specified. The majority of the adjustable settings are universal for peptide/protein identification and should have corresponding settings in any given search engine.\n\tSpectrum selector:\n\tMin. precursor mass: 350 Da\n\tMax. precursor mass: 5,000 Da\n\tScan type: Full\n\tSignal/Noise threshold: 1.5\n\tSequence database search\n\tDatabase: UniProt_SwissProt [version2015_11]\n\tTaxonomy: Homo sapiens\n\tEnzyme: none\n\tMax. missed cleavages: 0\n\tInstrument (Mascot only): ESI-Trap\n\tMin. peptide length (SequestHT only): 6\n\tMax. peptide length (SequestHT only): 144\n\tPrecursor mass tolerance: 15 ppm\n\tFragment mass tolerance: 0.05 Da\n\tStatic modifications: Carbamidomethyl (C); [If labelled] TMT10plex (N-Term)\n\tDynamic modifications: Oxidation (M); [If labelled] TMT10plex (K)\n\tPeptide-spectrum match (PSM) validator\n\tPercolator (Mascot and Sequest HT only) or Decoy Fusion (PEAKS only)\n\tTarget FDR: 0.01\n\tValidation based on: q-value\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}