{
  "id": 8851,
  "origin_website": "Jove",
  "title": "Optimized Management of Endovascular Treatment for Acute Ischemic Stroke",
  "procedures": [
    "Procedural timings, interventional features, and clinical data described in this protocol are derived from a comprehensive observational database, which was approved by the local ethics committee (approval number 4/11/08 and 15/7/13). Patients' consent for treatment was obtained according to common clinical guidelines; the need for a separate consent concerning the inclusion in the database was waived by the ethics committee.\n1. Patient Management in the Emergency Room (ER) - Target Time: 10 min\nNOTE: The following steps have to be performed by the stroke neurologist.\nInform the neuroradiologist that a patient with signs suggestive of acute stroke is expected prior to the arrival of patient. State age and symptom onset, if known.\nFurthermore, inform the anesthesiologist about the potential upcoming EVT (first call).\nHave the neuroradiologist inform the interventional neuroradiologist about a suspected upcoming acute stroke patient.\nPerform a rapid clinical assessment of the patient upon arrival, including the quantification of functional impairment according to the NIHSS. Thus, test the level of consciousness, vision, motor and sensory function, language and speech, as well as extinction and inattention.\nMeanwhile, have the ER nurse place two large peripheral venous catheters and take a blood sample for immediate laboratory analysis.\nHave the ER nurse attach ECG, blood pressure, and blood oxygen saturation mobile monitoring systems to the patient.\nIf stroke is suspected, escort the patient to the angiography suite (scenario A) or to the CT imaging site adjacent to the angiography suite (scenario B), depending on NIHSS score and time from symptom onset to admission.\nTake a backpack containing emergency equipment and a complete set for intravenous thrombolysis. Include 90 mg rtPA, syringes, i.v. lines, and a syringe pump in this set.\nIf the clinical condition of the patient is not consistent with stroke, treat the patient according to respective neurological guidelines.",
    "2. Diagnostic Imaging in Scenario A = NIHSS 7 or Above and Less than 6 h Elapsed since Symptom Onset - Target Time to Imaging: 15 min\nNOTE: The following steps have to be performed by the neuroradiologist.\nHave the neurologist escort the patient directly to the angiography suite.\nPosition the patient on the angiographic table together with the neurologist and the neuroradiological technician.\nPosition the patient’s head within the headholder so that the orbitomeatal line is parallel to the rotation pane. Cover the eyes and fixate the head with two straps to prevent motion.\nPerform a standard 20 s non-enhanced rotational FDCT and a standard biphasic FDCTA.\nPerform FDCT on the angiography system using the following parameters: 20 s rotation; 200° total angle with ~500 projections; 109 kV; 1.8 µGy/frame; effective dose ~2.5 mSv.\nFor the FDCTA on the angiography system, perform intravenous injection of 60 mL contrast agent at an injection rate of 5 mL/s, followed by 60 mL saline chaser at the same injection rate of 5 mL/s.\nUse the antecubital vein of the right arm in order to optimize the bolus concentration. Use a power injector for injection.\nUse the following specifications of FDCTA: 2 x 10 s rotation; 200° total angle (0.8° per frame); 70 kV; 1.2 µGy/frame; effective dose ~2.5 mSv.\n\t\tNOTE: The first rotation is timed after a bolus-watching digital subtraction angiography to capture the peak arterial phase, while the second phase is acquired automatically after 5 s correlating to the venous phase. Raw data are automatically transferred and automatically reconstructed on a commercially available workstation.",
    "Review the acquired images together with the interventional neuroradiologist to rule out an intracranial hemorrhage using the FDCT and to detect LVO using the early phase of the FDCTA. Use the late venous phase of the FDCTA to evaluate the collateral status.\nAfter exclusion of an intracranial hemorrhage and confirmation of patient's eligibility, have the neurologist start intravenous administration of rtPA (dose: 0.9 mg/kg infused over 60 min with 10% of the total dose as an initial bolus).\n\tNOTE: Total target time from admission to initiation of rtPA treatment: 20 min.\nCall the anesthesiologist (second call) and confirm an upcoming EVT.\nHave mobile monitoring devices replaced by stationary devices present in the angiography suite and start preparations for EVT immediately as described in step 3 of this protocol (see step 3. \"Preparation of EVT\").\nIf FDCT and FDCTA are not consistent with acute ischemic stroke, symptoms sustain, and the patient is eligible for an MRI scan, have the neurologist escort the patient to the MRI suite. Perform an MRI to further investigate the neurological condition of the patient.\n3. Diagnostic Imaging in Scenario B = NIHSS below 7 and/or More than 6 h Elapsed since Symptom Onset - Target Time: 25 min\nNOTE: The following steps have to be performed by the neuroradiologist.\nHave the neurologist escort the patient to the CT suite.\nHave the neuroradiological technician perform a non-enhanced CT scan immediately after arrival of the patient at the imaging site.\n\tNOTE: One can decide to perform an MRI instead of CT only if CT is not possible or if other factors favor an MRI scan.\nRead the CT images quickly in order to rule out an intracranial hemorrhage and a large demarcated infarct.",
    "After excluding both, confirm the patient's eligibility. If less than 4.5 h have elapsed since symptom onset, have the neurologist start intravenous administration of rtPA (dose: 0.9 mg/kg infused over 60 min with 10% of the total dose as an initial bolus).\nGive the initial bolus on-site while the patient is lying on the CT table.\n\t\tNOTE: Total target time from admission to initiation of rtPA treatment: 20 min.\nHave the neuroradiological technician perform CT angiography (CTA) and perfusion (CTP) scans.\nAfter completion of CTA and CTP, evaluate whether the patient is eligible for EVT.\n\tNOTE: Eligibility criteria are: presence of LVO on CTA detected by lacking opacification and absence of a large demarcated infarct determined using the Alberta Stroke Program Early CT score (ASPECTS)12 on non-enhanced CT. ASPECTS values of 4 and below indicate large infarct demarcation.\n\t\nUse CTP to determine the amount of still salvageable tissue. For this determination, assess ASPECTS on maps of cerebral blood volume (CBV); patients are eligible for EVT with a CBV-ASPECTS of above 4.\nIf the patient is eligible for EVT, call the anesthesiologist and confirm upcoming EVT.\nHave the neurologist transfer the patient immediately to the adjacent angiography suite, where the patient is positioned on the angiographic table and mobile monitoring devices are replaced by stationary devices present in the angiography suite.\n4. Preparation of EVT - Target time: 10 min\nNOTE: The following steps have to be performed by the neuroradiologist.\nPrepare the patient for the EVT together with the neuroradiological technician.\nHave the neuroradiological technician setup the material required for EVT, i.e. catheters, flushing infusions, syringes, etc.\nShave and disinfect the patient's groin with skin antiseptic (e.g., kodan tincture forte) and place sterile drapes to ensure aseptic conditions for EVT.",
    "Have the anesthesiologist commence conscious sedation: induce with ketamine (1 mg/kg) in combination with propofol (1 mg/kg) intravenously and maintain a continuous infusion of propofol (1-2 mg/kg/h) to ensure sufficient spontaneous breathing and patient cooperation.\n\tNOTE: Conscious sedation is the preferred method during EVT.\n\t\nIf conscious sedation seems inappropriate due to sustained agitation or movement of the patient, have the anesthesiologist intubate the patient, so that EVT is performed under general anesthesia.\n\t\t\nInduce with a sufentanil bolus (0.2 - 0.4 µg/kg) and a propofol bolus (1.5 -2 mg/kg) intravenously. Improve intubation conditions with muscle relaxation using rocuronium boli (0.6 mg/kg). Maintain general anesthesia with sevoflurane (0.5-1.5 MAC) and additional repetitive boli of sufentanil (0.2-0.5 µg/kg), if necessary. To facilitate intubation, sway the angiographic table towards the ventilation machine.\n5. Performance of EVT\nNOTE: The following steps have to be performed by the interventional neuroradiologist.\nPuncture the right femoral artery in the groin using an 18 G puncture needle and introduce a peripheral 8F guiding sheath. Then start EVT; total target time from patient admission to groin puncture is 30 min in scenario A and 45 min in scenario B.\nPerform EVT.\nChoose the Stent retriever Assisted Vacuum-locked Extraction (SAVE)13 technique as the primary treatment approach. If needed, adapt the procedure to individual requirements of the situation. In cases of tandem occlusions, use the ReWiSed CARe technique for simultaneous thrombectomy of the intracranial lesion and treatment of the cervical stenosis14.\nHave the anesthesiologist closely monitor the vital signs of the patient during the whole procedure. In particular, have the anesthesiologist take immediate action to prevent hypotension.",
    "After a control angiogram confirms successful reperfusion, defined as a modified Thrombolysis in Cerebral Infarction (mTICI) score of 2b – 3, perform a flat-panel detector angiographic CT. Read the images to rule-out complications of the treatment, e.g. intracranial hemorrhage.\nRemove all materials and dress the wound in the groin. Use a vascular closure device to close and seal the puncture in the femoral artery.\n6. Post EVT Procedures and Follow-up\nNOTE: The following steps have to be performed by the neuroradiologist.\nRemove all drapes, position the patient in a bed, and make the patient ready for transport to the Intensive Care Unit (ICU) or Stroke Unit together with the neuroradiological technician.\nHave the anesthesiologist escort the patient to the ICU or Stroke Unit, where the patient is treated according to neurological guidelines.\nPerform a follow-up non-enhanced CT after 24 h or upon clinical deterioration of the patient.\nAll clinical data, imaging scores, and achieved times are prospectively recorded in a comprehensive database approved by the local ethics committee."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}