{
  "id": 11260,
  "origin_website": "Jove",
  "title": "Novel Object Recognition and Object Location Behavioral Testing in Mice on a Budget",
  "procedures": [
    "The following protocol has been approved by the Institutional Animal Care and Use Committee (IACUC) at the Ohio State University (OSU).\n1. Building the Arenas\nOrder the materials outlined in Table 1: five sheets of acrylic, acrylic cement, and a 16 G hypo applicator.\nWear appropriate safety equipment according to manufacturer’s instructions, which may include eye, skin, and other types of protection.\nRemove the protective paper coating from the acrylic sheets.\nDry fit all the materials to confirm that sizes are correct (Figure 1A).\nAssemble and load the syringe with acrylic cement.\nAlign the long edge of an outside wall (Part B) with a top edge of the base (Part C) and ensure that they are perpendicular to each other using a combination or machinist square.\nUsing the syringe, apply a small and steady bead of cement directly to the corner of the two pieces being joined.\nHold the two pieces (Parts B and C) in place until they are initially set (approximately 5 min).\n\tNOTE: Typically, they will be 80% hardened in 24 h, but assembly can continue after 5 min.\nRepeat steps 1.5–1.7 with the other outside wall (Part B) to the same base.\nAttach the two inner walls (Part A), one at a time, to the base using steps 1.5–1.7.\nAdditionally, use the syringe to apply a small and steady bead of cement directly to the corner now being formed by the outside wall (Part B) and the inside wall (Part A).\nHold these pieces in place for 5 min.\nAfter 24–48 h, proceed to setting up the behavioral testing environment.\n2. Setting up the Behavioral Testing Environment and Equipment\nPlace environmental cues (as described in the discussion section) across from each other and facing the arenas in the testing area (Figure 1B).",
    "Arrange the four testing arenas in a 2-by-2 manner either on the floor or sturdy table at appropriate distances from the cues and the camera to maximize visual input to the mice (Figure 1B).\nVerify the line of sight using a meter stick propped from each arena floor over the wall towards the cues to confirm that these distances between the arenas and the cues are appropriate.\nDetermine the optimal optical path length that allows video documentation of all four arenas by adjusting the height of the camera or the height of the table. (Figure 1B).\nConnect the camera to a USB Extension Cable.\nUsing cable raceways, run the cable across the ceiling and down a wall to a computer running video capture software.\nHide the computer behind a curtain that will separate the mice in the testing area from the researcher (Figure 1C).\nAssemble 4 each of at least 3 different objects that are approximately 2–5 cm in length and width and up to 10 cm in height to use for testing (Figure 1D).\nimgsrc://cloudfront.jove.com/files/ftp_upload/58593/58593fig1.jpg",
    "Figure 1: Behavioral testing preparation. (A) Open-field-testing arena assembly with part A corresponding to the inner wall, part B as the outer wall, and part C as the base. The finished arena will have two outer walls (parts B) that run the entire edge of the base and two inner walls (parts A) that fit between the outer walls on the adjoining edges of the base (part C). All walls will rest on top of the base. (B) Representative arrangement of arenas on a 0.62 m high table, 60 x 90 cm environmental cues, lights, and a camera for a testing area that allows the capture of all four arenas simultaneously. (C) A curtain hides the experimenter and computer system from mice during trials. The overhead lights are on for the purposes of taking this photograph, but during testing, only the floor lamps are on. Also, one of the environmental cues has been removed for this photograph of the testing area, but during testing, there is a fourth cue in front of the arenas, facing the all black cue behind the table. (D) A representative object (and ruler for scale) that is appropriate for OLT or NORT testing with mice. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/58593/58593fig1large.jpg]\nValidate these objects.\n\t\nObtain a minimum of 8 wild-type mice in the sex, strain, and age group representative of the experimental mice that will be used (e.g., 6 to 9 week-old female and male C57Bl/6 mice).\nHandle all mice daily for 1 min over the course of 3–5 days prior to testing.\nDivide mice into groups of 4 and, if they are not already singly housed, move them into individual clean holding cages.\nBring them into the testing room and allow them to acclimate for at least 30 min.",
    "NOTE: Presence of the experimenter in the room for these 30 min will reduce stress on the mice during the task, particularly if the experimenter is male20.\nAfter acclimation is done and the experimenter is ready to start, begin recording the video.\nPlace each mouse facing the walls of one corner of the arena (called the release corner) (Figure 2A).\nAllow the mice to explore the arenas freely for 10 min.\nStop recording the video.\nReturn mice to their clean holding cages for a duration of 20 min.\nClean all arenas with animal facility recommended cleaning methods, such as wiping with 70% ethanol to minimize olfactory cues before the next use.\nUsing double-sided tape, affix 2 different objects near 2 non-release corners such that the objects are counterbalanced in the arena, and 6 x 6 cm2 from each wall of that corner (Figure 2B).\nStart recording the video.\nPlace each mouse facing the walls in the release corner.\nAllow mice to investigate the arena and objects freely for 10 min.\nStop recording the video.\nPlace mice back in their clean holding cages for a duration of 20 min.\nClean all arenas and objects with animal facility recommended cleaning methods such as wiping with 70% ethanol to minimize olfactory cues.\nRepeat training trials with 2 new objects affixed in the same locations until all the objects (at least three different objects if conducting both the OLT and NORT) have been tested with each mouse.\nExclude objects that allow mice to sit on top of the object.\nAnalyze investigation time of each mouse with each object according to step 4.\nExclude objects that have a negative or positive intrinsic value.\n3. Conducting the Behavioral Test\nOne week prior to testing: familiarization to individuals conducting the behavioral tests",
    "Handle adult 6 to 9 week-old female and male C57Bl/6 mice daily for 1 min over the course of 3–5 days prior to testing.\nDay 1: habituation sessions\n\t\nDivide mice into groups of 4 and, if they are not already singly housed, move them into individual clean holding cages.\nBring them in to the testing room and allow them to acclimate to the testing room for at least 30 min.\n\t\tNOTE: Presence of the experimenter in the room for these 30 min will reduce stress on the mice during the task, particularly if the experimenter is male20.\nAfter acclimation is done and the experimenter is ready to start, begin recording the video.\nPlace each mouse in the arena (one mouse per arena) facing the walls of the release corner (Figure 2A).\nAllow the mice to explore the arenas freely for 6 min.\nStop recording the video.\nReturn mice to their clean holding cages during the inter-trial interval (ITI).\nClean all arenas with animal facility recommended cleaning methods such as wiping with 70% ethanol to minimize olfactory cues.\nRepeat steps 3.3–3.9 two more times for a total of 3 habituation sessions for each mouse.\nReturn all mice to their home cages.\nClean all arenas with animal facility recommended cleaning methods such as wiping with 70% ethanol to minimize olfactory cues before use the next day.\nDay 2: training trial, OLT, NORT\n\tNOTE: The NORT is an optional test.\n\t\nAfter 24 h, bring the same group of mice in to the testing room and allow them to acclimate to the testing room for at least 30 min as done before the habituation sessions on the previous day.\nConduct a training trial using 2 objects placed in the arena (Figure 2B).",
    "Using double-sided tape, affix objects 6 x 6 cm2 away from 2 non-release corners such that they are counterbalanced in the arena.\nStart recording the video.\nPlace each mouse facing the walls of the release corner as done during the habituation sessions.\nAllow mice to investigate the arena and objects freely for 10 min.\nStop recording the video.\nPlace mice back in their clean holding cages for an ITI of 20 min.\nClean all arenas and objects with animal facility recommended cleaning methods such as wiping with 70% ethanol to minimize olfactory cues.\nPerform the OLT.\n\t\t\nMove one of the objects used in the training trial to a new non-release corner and affix the object 6 cm from each wall of that corner with double-sided tape (Figure 2C).\n\t\t\tNOTE: The other object should remain where it was during the training trial.\nStart recording the video.\nPlace each mouse facing the walls in the release corner.\nAllow mice to investigate the objects for 10 min.\nStop recording the video.\nPlace mice back in their clean holding cages for an ITI of 20 min.\nClean all arenas and objects with animal facility recommended cleaning methods such as wiping with 70% ethanol to minimize olfactory cues.\nPerform the NORT.\n\t\t\nReplace the object that was not moved during the OLT with a novel object and affix the novel object 6 cm from the two walls of the corner with double-sided tape (Figure 2D).\nStart recording the video.\nPlace each mouse facing the walls in the release corner.\nAllow mice to investigate the objects for 10 min.\nStop recording the video.\nPlace mice back in their home cages.\nClean all arenas and objects with animal facility recommended cleaning methods such as wiping with 70% ethanol to minimize olfactory cues before next use.\nimgsrc://cloudfront.jove.com/files/ftp_upload/58593/58593fig2.jpg",
    "Figure 2: Arena configuration for trials. (A) Open-field testing arena without objects for habituation session. The black arrow indicates a release corner. This corner should be the same relative location in each arena and be consistent for every mouse being tested and for every trial. (B) For the training trial, two different objects are secured to the open field at 6 x 6 cm away from their respective walls. (C) For the OLT, one object is moved to a new location, also 6 x 6 cm away from the walls and not the release corner. (D) For the NORT, the object that was stationary in the OLT is replaced with a novel object while the moved object from the OLT is now the familiar object. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/58593/58593fig2large.jpg]\n4. Analyzing Behavioral Test Data\nNOTE: Analysis of video should ideally be completed by at least two independent, blinded experimenters.\nOpen the video file.\nApply a transparent circle that provides a border of 2 cm around each object over the screen to help determine active investigation. Use a video file image with a ruler placed in an arena to calibrate this grid.\nObserve mouse behavior and record the times the mouse is actively investigating the object, which consists of its nose pointed at the object at a maximum distance of 2 cm from that object.\n\t\nRecord the time stamp the mouse starts to investigate an object and the time stamp when it stops investigating that object.\nRepeat this for both objects in the arena for the duration of the trial.\nCalculate the cumulative time the mouse investigated each object by subtracting the start time from the stop time for each instance of object investigation, and adding all of those values.",
    "Calculate percent of total investigation time or the discrimination index with the following formulas:\n\t\nCalculate percent of total investigation time =\nimgsrc://cloudfront.jove.com/files/ftp_upload/58593/58593eq1.jpg\n\t\tNOTE: A value above 50% indicates greater investigation of the novel location or object.\nCalculate discrimination index =\nimgsrc://cloudfront.jove.com/files/ftp_upload/58593/58593eq2.jpg\n\t\tNOTE: A positive value indicates more time investigating the novel object. A discrimination index of zero indicates equal time spent with both objects.\nGraphically represent results and complete statistical analyses using a t-test or ANOVA as appropriate for the number of groups being compared."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}