{
  "id": 17310,
  "origin_website": "Jove",
  "title": "Preclinical Evaluation of Coronary Artery Stents",
  "procedures": [
    "All animal experiments were approved by the Animal Experiment Board in Finland. Adult 3.0-4.0 kg New Zealand White (NZW) rabbits were used for the atherosclerotic rabbit model. For the pig coronary study, the animals weighed 30-40 kg at the start of the experiment. The protocol for the rabbit atherosclerotic model and the pig coronary artery model is described separately, followed by the description of how histology can be performed for non-degradable coronary stents, regardless of the in vivo model used.\n1. Rabbit atherosclerotic model\nNOTE: To induce rapid atherosclerotic changes in the aorta, the animals are fed a high cholesterol diet, and the aortas undergo de-endothelialization prior to stent implantation. Stenting and imaging are performed through the carotid arteries, and the stents are processed for histology as outlined below. Intravascular ultrasound (IVUS) is more suitable than optical coherence tomography (OCT) for rabbit aorta because there is no need for arterial flushing.\n High cholesterol diet (Figure 1)\n\t\nConvert the regular rabbit feed into high cholesterol feed by adding cholesterol. Mix cholesterol into one part ethanol and one part diethyl ether (250 g of cholesterol to 2 L of 96% EtOH and 2 L of diethyl ether) on a magnetic stirrer in a large beaker.\nWhen the cholesterol has dissolved, pour the mixture over 25 kg of rabbit feed in a large basin inside a hood. Mix the feed several times daily for 3-4 days until the mixture has dried.\nThis will produce a 1% cholesterol feed. To make 0.025% cholesterol feed, the 1% cholesterol feed is mixed into regular rabbit feed in a 1:40 ratio.\nBalloon denudation of rabbit aorta",
    "Mix aspirin into the rabbit drinking water, starting 3 days prior to denudation injury and continue until the end of the experiment (100 mg of aspirin to 1 L of drinking water). Water is offered ad libitum.\nAnesthetize the rabbits with 0.3 mg/kg medetomidine and 20 mg/kg ketamine subcutaneously (s.c.). Remove the fur from the inguinal area and inner thigh area of the right hind leg with grooming clippers and sterilize the skin with an ethanol-based disinfectant.\nAdminister a perioperative prophylactic antibiotic (125 mg cefuroxime s.c.).\nApply a local anesthetic prior to skin incisions with 10 mg/mL lidocaine s.c. along the inner thigh area along the groove, which holds the main blood vessels and nerves in the femoral region.\nMake a skin incision and advance carefully through the subcutaneous tissue and leg muscles with operating scissors and dissection scissors.\nExpose the femoral artery and separate from the surrounding tissues and the vein and nerve.\nPass a 5-0 non-resorbable surgical suture twice under the artery in the proximal femoral artery. Elevate the artery carefully with the suture line (no ligature is made, rather the surgical suture is held with a pair of needle drivers or mosquito forceps). This line is used to temporarily stop blood flow into the femoral artery.\nPass a 5-0 non-resorbable suture line twice under the distal part of the femoral artery and securely tie a ligature to occlude the distal femoral artery (for example, with a Miller's knot).\nMake a small 1-2 mm incision or arteriotomy into the artery with microsurgical scissors or a fine scalpel while the artery is supported and held in place from the proximal and distal surgical lines by an assistant.",
    "Insert a Fogarty 3F embolectomy balloon catheter into the artery heading proximally towards the iliac artery. Prior to insertion, prepare the embolectomy catheter by connecting it to a 1 mL syringe filled with 0.6 mL of air (saline can also be used, but an air-filled balloon is more compliable). The proximal surgical line is lowered to allow passage of the embolectomy catheter.\n\t\tNOTE: A Fogarty embolectomy catheter without a guide wire lumen is used for the procedure.\nPass the embolectomy catheter 30 cm into the artery (as judged by the markings on the catheter shaft). Inflate with the syringe and pull the inflated catheter until it reaches at least the iliac bifurcation, at which point resistance is felt on the catheter.\nDeflate the embolectomy catheter and reintroduce it into the aorta. Repeat the pull back a total of three times.\nAfter the denudation is complete, withdraw the embolectomy catheter and close the femoral artery with the proximal suture line. The femoral artery will thus be occluded after the procedure. However, due to good collateral circulation in the rabbit's hind limb, there are rarely any health concerns related to ischemia.\nLigate the muscle covering the femoral artery with 4-0 resorbable sutures, and the skin with an intracutaneous suture with a 4-0 resorbable suture line.\nThe animals are monitored until they are awake, alert, and drinking or feeding. Facilitate the recovery of rabbits with the use of a heated chamber with access to water and hay.\nAdminister carprofen after surgical procedures for 1-3 days or longer if needed (2 mg/kg s.c., once daily) for analgesia.\nStenting of the rabbit aorta",
    "Start clopidogrel on the day of stenting with a loading dose of 30 mg and continue with 15 mg daily until the end of the experiment. Ground clopidogrel tablets in a mortar, mix into tap water (5 mL of water for one 75 mg clopidogrel tablet; the loading dose is 2 mL followed by 1 mL daily), and administer via a gastric tube.\n\t\tNOTE: Clopidogrel does not dissolve completely in tap water; make a fresh dose daily prior to medicating the rabbits. At this point, ensure that the rabbits are on daily administered aspirin following the denudation injury.\nAnesthetize the rabbits with 0.3 mg/kg medetomidine and 20 mg/kg ketamine s.c.\nAdminister a perioperative prophylactic antibiotic (125 mg of cefuroxime s.c.).\nRemove hair from the anterior side of the neck with shaving clippers and sterilize the skin with an ethanol-based disinfectant.\nApply lidocaine as a local anesthetic along the midline of the neck (3-5 mL) and make a longitudinal 4-5 cm cut through the skin.\nOpen the platysma by cutting with dissection scissors longitudinally. Coagulate small bleeding arterioles by squeezing with surgical tweezers or coagulating with a unipolar or bipolar coagulation device.\nA natural groove is identified within the muscles of the neck, between which the carotid artery along with the vagus nerve can be found (between the sternomastoid and sternohyoid muscles) (Figure 2A). Dissect the artery carefully and separate it from other tissues. The right carotid artery is preferred as it provides a more direct line of access to the descending aorta.\nPass a 5-0 non-resorbable suture line twice under the distal part of the carotid artery and securely ligate the artery. Hold the surgical line up to elevate the distal part of the carotid artery.",
    "Pass a 5-0 non-resorbable surgical line twice under the proximal part of the carotid artery. Without making a ligature, use the proximal surgical line to lift up the carotid artery to temporarily block blood flow to the carotid artery in the operational area.\nMake a small 1-2 mm arteriotomy into the carotid artery between the surgical lines with microsurgical scissors.\nInsert a fully prepared 5F or 6F introducer sheath into the proximal direction.\n\t\t\nFlush the sheath with saline, insert the dilator into the sheath, and flush prior to insertion of the sheath into the artery. Additionally, to facilitate the advancement of the sheath, insert a short guide wire through the dilator to make a tapered tip for the sheath.\nOnce the tip of the sheath (or rather the dilator) is inside the carotid artery, lower the proximal surgical line to allow the sheath to pass into the artery.\nAdvance the sheath 2-3 cm into the carotid artery.\nRemove the obturator and the wire from the introducer sheath.\nConfirm the placement of the sheath in the artery by opening the sheath valve and letting a small amount (1-2 mL) of blood out of the sheath.\nFlush the sheath with heparinized saline (5000 IU per 1000 mL, 0.9% NaCl) and suture to secure it into the surgical drapes or the skin of the rabbit. Heparinize the rabbit by administering unfractionated heparin through the sheath (150 IU/kg).\nMove the animal to the catheterization table if the surgery was not performed on the table of the catheterization laboratory.\nAdvance a thin coronary guide wire (0.014 in) via the introducer sheath and guide it into the descending aorta under fluoroscopy. Advance a 5F guide catheter over the guidewire.",
    "NOTE: A guide catheter with a bend can be used if one has trouble navigating from the carotid artery into the descending aorta.\nIf a guide catheter with an angled tip was used to access the descending aorta, change it for a straight guide catheter over the guide wire to deliver stents or imaging catheters.\nAcquire an angiographic image of the abdominal aorta by contrast injection through the guide catheter with an iodine-based contrast agent (250-350 mgI/mL).\nSelect a suitable section between the lumbar arteries in the infrarenal aorta for stent deployment. Deploy the stent to a 1.1:1 ratio (the stent is slightly oversized to the artery to prevent the stent from moving when the balloon catheter is withdrawn) into the aorta with the aid of an indeflator according to the stent manufacturer's instructions (all stents mounted on balloon catheters will have a sizing chart delivered with the stent). Deflate the balloon and withdraw the stent catheter (Figure 2B). \nPerform a repeat angiography with the contrast agent to confirm stent placement.\nRemove the introducer sheath after stenting and imaging. Close the artery with the proximal suture line in the carotid artery. This will completely occlude the carotid artery.\nClose the muscle layers of the neck (usually two layers of sutures) with 4-0 resorbable sutures and the skin with resorbable 4-0 intracutaneous sutures.\nMonitor the animal's recovery and administer analgesics as described in the balloon denudation operation (steps 1.2.15-1.2.16).\nImaging rabbit aorta with IVUS\n\t\nAcquire vascular access and position a straight guiding catheter into the descending aorta as described for the stenting operation for the rabbit aorta.\n\t\tNOTE: Imaging is performed at the time of stenting via the same vascular access. A second imaging time point can be created by utilizing the left carotid artery.",
    "Advance the imaging catheter over a guide wire into the distal aorta beyond the stented segment (or where the stent will be placed if pre-stenting imaging is performed).\nPerform a pullback either manually while the IVUS data is recorded or start the automatic pullback (see instructions for the IVUS system). During the pullback, the imaging unit moves over the target area automatically if enabled by the imaging system or manually by pulling the imaging catheter over the area of interest (the stent) while recording the imaging data.\nSave the imaging data and remove the imaging catheter, the guide wire, and the guiding catheter.\nRemove the sheath and close the surgical wound as described for the stenting procedure (step 1.3).\nMonitor the animal recovery as described previously. Administer analgesics as previously described (steps 1.2.15-1.2.16).\nTissue perfusion and fixation (rabbit model)\n\t\nSacrifice the animals while under ketamine-medetomidine anesthesia with a 20-30 mL intravenous (i.v.) injection of saturated magnesium sulfate (MgSO4).\nPerfuse with saline, or if collecting samples only for histology with 1% paraformaldehyde mixture, using a dedicated pump.\nPerfuse the rabbit aorta by inserting the perfusion system via a needle or cannula directly into the descending aorta above the renal artery level or by inserting the needle through the left ventricle of the heart and into the aorta (which will perfuse the whole animal).\nApply a clamp over the aorta where the tip of the needle or cannula is to secure it in the aorta during the perfusion procedure.\nPerfuse with 1000 mL (from the descending aorta) or 1500 mL (from the ascending aorta through the left ventricle) of saline or 1% PFA.\nCollect the stented segment of the aorta by carefully dissecting from the surrounding tissues.",
    "NOTE: Consider collecting proximal and distal segments of the aorta for histology. Also, collect any safety tissues necessary.\nPlace the collected tissues designated for histological analysis into 4% paraformaldehyde for 4 h at room temperature (RT), or overnight at 4 °C.\nFor further storage, transfer to 50% EtOH at 4 °C for 24 h and then 70% EtOH at 4 °C until prepared for histology.\n2. Pig coronary artery model\nNOTE: The pig heart anatomically and physiologically resembles the human heart. The coronary arteries are also similar-they run epicardially and form three main coronary branches (the right coronary artery (RCA) and the left coronary artery (LCA), which further divides into the left ascending coronary artery (LAD) and the left circumflex artery (LCX)). Here is a model with stenting performed to native pig coronary arteries and intravascular imaging performed with OCT. Pigs are fasted overnight prior to anesthesia.\nAnesthesia and vascular access for pig coronary stenting and imaging\n\t\nSedate the animals with azaperone (8 mg/kg intramuscularly (i.m.)) and atropine (0.05 mg/kg i.m.), and induce and continue anesthesia with intravenous propofol (15 mg/kg/h) and fentanyl (10 µg/kg/h). Intubate the animals and keep them on a ventilator throughout the procedures.\nVascular access is acquired via the right femoral artery. Locate the femoral artery with the aid of an ultrasound transducer (the artery can be distinguished from the vein by the arterial pulsation and by compressing with the transducer).\nUnder ultrasound guidance, advance an angiographic needle into the femoral artery.\nOnce inside the artery, a strong pulsating blood flow will come through the needle. Advance a guidewire into the artery and remove the needle.\nAdvance an assembled and flushed introducer of appropriate size (typically 5F or 6F) into the artery over the wire.",
    "NOTE: Take care to keep the wire visible at all times, so it is not lost in the artery.\nRemove the dilator and the wire from the introducer sheath.\nFlush the sheath with heparinized saline (5 IU/mL).\nAdminister 1 mg/kg enoxaparin i.v. once vascular access is accomplished.\nAdminister a prophylactic antibiotic for every invasive procedure (500 mg of cefuroxime i.m.).\nPig coronary artery angiography and stenting\n\t\nStart antithrombotic medication on the day of stenting with a loading dose of 300 mg of aspirin per os (po) and a loading dose of 600 mg of clopidogrel po. Continue aspirin (100 mg daily) and clopidogrel (75 mg daily) until the end of the experiment.\nAdvance a J-tipped guide wire under fluoroscopy to the ascending aorta.\nAdvance a guiding catheter with an appropriate angle over the J-wire and engage the right and left coronary arteries (typically AR1 for the right coronary artery and AR2 for the left coronary artery).\n\t\tNOTE: The guiding catheter is connected to a Y-adapter and a manifold with a line for at least the contrast agent to minimize the risk of air entering the imaging system.\nPerform coronary angiography by injecting a contrast agent into the coronary artery.\n\t\tNOTE: Imaging should be performed from at least two different angles for each coronary artery. Also, administer intracoronary nitrate prior to imaging (50-300 µL).\nPass a coronary guide wire (0.014 in) into the appropriate coronary segment. Place the stent into the RCA and the LCX or the obtuse marginal artery originating from the LCX.",
    "NOTE: The LAD is often tapered in shape, and a stent could easily be left either over-expanded at the distal part or under-expanded at the proximal edge. A careful consideration of which coronary arteries are used must be made. Use the stenosis analysis software of the X-ray unit or intravascular imaging to help choose a good arterial segment and size-match the stent.\nAdvance the stent over the guide wire and deploy with an indeflator according to the manufacturer's instructions to a 1.1:1 stent to artery ratio, slightly oversizing the stent compared to the reference diameter of the artery.\nPerform repeat angiography and intravascular imaging if appropriate.\nRemove the catheterization equipment.\nRemove the introducer sheath and apply pressure on the puncture site either manually or with the aid of a femoral compression device.\n\t\tNOTE: Vascular closure devices generally do not work well in pigs due to differences in the anatomy of the hind leg of the pig compared to man and the relatively small size of the femoral artery.\nOCT imaging of coronary arteries\n\t\nPerform OCT imaging before and after the stent deployment and during the follow-up. To start OCT imaging, acquire vascular access, engage the target coronary artery with a guiding catheter, and advance a coronary guide wire distally in the target artery.\nConnect the OCT imaging catheter to the dock of the imaging system.\n\t\tNOTE: Follow the instructions of the imaging system as they vary between manufacturers as well as between different generations of imaging catheters.\nCreate a new Patient for the recording with an ID code of choice.\nFlush the imaging catheter lumen with a contrast agent.\n\t\tNOTE: Imaging can be performed with saline flushing, but may require changing of the image settings of the system for accurate results.",
    "Insert the imaging catheter monorail system over the guide wire and advance the catheter imaging markers to the desired imaging location.\n\t\tNOTE: Always be sure that the guide wire advances far enough into the artery; do not let catheters (imaging, balloon, stent) pass beyond the tip of the guide wire.\nPerform imaging. Include the whole stent as well as the distal and proximal reference vessels in the pullback.\n\t\t\nFlush the imaging catheter lumen with a contrast agent.\nStart the automatic pullback sequence.\nFlush the coronary artery with a large bolus of contrast agent through the guide catheter (250-350 mgI/mL).\nTissue perfusion and fixation (pig model)\n\t\nUnder anesthesia, the pig is sacrificed with an 50-100 mL i.v. bolus of saturated potassium chloride (KCl).\nPerfuse with saline, or if collecting samples only for histology with 1% paraformaldehyde mixture, using a dedicated pump.\nPerfuse the whole pig heart by placing a cannula or needle attached to the perfusion pump loosely into the ascending aorta.\nPlace a clamp outside the aorta to close the aorta around the needle/cannula.\n\t\tNOTE: Makes sure the cusps of the aortic valve are open to allow perfusion liquid to flow into the coronary arteries.\nPerfuse with 750-1000 mL of chosen perfusion liquid.\nCollect the stented segments of the coronary artery by carefully dissecting from the surrounding tissues.\n\t\tNOTE: Consider collecting proximal and distal segments of the coronary artery for histology. In addition, collect any safety tissues necessary.\nPlace the collected tissues designated for histological analysis into 4% paraformaldehyde for 4 h at RT, or overnight at 4 °C.\nFor further storage, transfer to 50% EtOH at 4 °C for 24 h and then 70% EtOH at 4 °C until prepared for histology.\n3. Stent histology",
    "NOTE: Stent histology from non-degradable metallic stents requires the use of a plastic embedding system and sample sectioning with a specialized microtome. The embedding system is commercially available, but to allow for antibody-based immunohistology, a few modifications need to be made to the protocol. Embedding protocol is the same for all samples regardless of the animal model used. Use a plastic embedding system for the embedding process. Work inside a hood for all embedding and histology procedures.\nDehydrate the samples from EtOH solution to xylene.\nFollow the protocol for the embedding system, with the exception of using destabilized basic solution starting from the second pre-infiltration step.\n\tNOTE: Basic solution is destabilized by draining through ammonium oxide.\nCombine the polymerization liquids in plastic sample jars with the stented segments.\n\tNOTE: The stented arteries can be fixed into position by inserting a small needle through the outside of the container.\nApply vacuum on the samples for 10-15 min and leave to polymerize at 4 °C for at least 48 h.\nSaw off the edges of the plastic block (especially if using a cylindrical mold) to create straight surfaces. This will allow for secure attachment to the microtome.\nCut with a dedicated microtome into 5-7 µm sections.\nLeave the freshly cut sections in 50% EtOH for 5-10 min.\nCollect the sections from the EtOH onto standard microscopy slides (two or three sections per slide).\nCover with two or three drops of Haupt's solution and cover with a plastic film. Place a layer of paper on top of the plastic film and place an empty glass preparate slide on top of the paper.\nApply pressure on the slide for at least 24 h at 42 °C by placing the slides in a small tabletop vice while padded with layers of paper.",
    "Store the slides at RT.\nBefore histological staining, remove the plastic-based resin by incubating the slides in methyl methacrylate for 24-48 h.\nClear in xylene (2 x 10 min incubation) before the standard histological or immunohistological procedure7,8.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}