{
  "id": 9520,
  "origin_website": "Jove",
  "title": "Ex Vivo Organotypic Corneal Model of Acute Epithelial Herpes Simplex Virus Type I Infection",
  "procedures": [
    "All reagents and equipment were purchased sterile or were sterilized prior to the procedure.  This article describes the steps of setting up the ex vivo model beginning with a pre-enucleated eye.  In our experiments, we use fresh whole eyeballs from young (8-12 wks) albino rabbits (Pel-Freez Biologicals, Rogers, AR).  In addition, we use human corneas obtained from the local eye bank.  If performing enucleation yourself, take care to avoid damaging the cornea or the limbus during the procedure.  Rabbit enucleation protocols can be found elsewhere 2.\nPart 1: Excision of the Corneoscleral Button\n Wet a narrow strip of gauze with PBS and wrap it around the eyeball to facilitate holding it during the procedure.    \n Use a sharp scalpel to make a tangential incision in the sclera, about 0.5 cm away from the limbus. \n Use sharp scissors to extend the incision and completely excise the corneoscleral button. \n Once the corneoscleral button is isolated, tease away the iris while holding the scleral rim with forceps.  Avoid damaging the endothelium or exerting excessive stress on the cornea. \nPart 2: Introduction of Cornea into Organotypic Culture\n Explanted corneas are cultured in Minimum Essential Medium (MEM) supplemented with Non-Essential Amino Acids (1X), L-Glutamine (2 mM), Penicillin (200 U/ml), and Streptomycin (200 μg/ml).  An antifungal agent, such as amphotericin, may also be added if necessary.    \n Prepare a 1% agarose solution in culture medium and keep it ready at 55 °C. \n Thoroughly rinse the cornea in sterile PBS containing Penicillin (200 U/ml) and Streptomycin (200 μg/ml).\n Place the cornea epithelial side down into a well of a sterile spot plate. \n Add the agarose-containing medium to the endothelial concavity of the cornea just enough to fill it completely.  Allow ~1 min for the agarose to solidify.",
    "Place the cornea with the supporting gel scaffold epithelial side up into a 35 mm tissue culture dish and add culture medium to cover the epithelial surface. \n The cornea may be cultured in this way for over a week, with medium changes every 48 hr. \nPart 3: Infection with HSV-1 and Treatment with Experimental Drugs\n Add 1 ml of medium containing the desired amount of virus into a 35 mm tissue culture dish.  We usually infect with 1x104 PFU of strain KOS HSV-1 per cornea.  Our stock titers are determined by performing plaque assays on CV-1 monolayers.    \n Place the cornea together with the agarose scaffold epithelial side down into the virus-containing medium. \n Place the cornea into a tissue culture incubator to infect for 1 hr with intermittent rocking every 10-15 min. \n After 1 hr, aspirate the virus-containing medium and rinse 2-3 times with PBS to remove any residual viral particles. \n Place the cornea back into its previous position and add fresh culture medium to cover the epithelial surface. \n Experimental treatments may be started before or after infection, depending on the nature of the experiment. \n Culture medium is changed every 48 hr. \nPart 4: Sample Collection\n Medium for plaque assay analysis.  Mix the medium well and use it immediately for a plaque assay or store at -80 °C for later use if collecting samples at different time points.\n DNA, RNA, protein, or cells from corneal epithelium\n Remove the agarose scaffold and rinse the cornea well with PBS.        \n Excise the ring of scleral tissue from the cornea to ensure that only corneal epithelial material is collected.",
    "Using a scalpel, scrape off the corneal epithelial cells into the appropriate buffer, depending on the type of material to be isolated.  For isolation of DNA and RNA, we use the DNeasy Blood & Tissue Kit and the RNeasy Mini Kit, respectively (QIAGEN, Hilden, Germany).  For collection of protein lysates, we use Laemmli buffer.  For flow cytometry analysis of corneal epithelial cells, we pre-incubate the corneas in a small amount of trypsin to loosen the cells, and then dislodge them into trypsin with a scalpel.  Since scraping the corneal epithelium does not yield equal amounts of tissue, it is important to include appropriate controls when analyzing the samples.  We use 18S rRNA as a reference transcript in qRT-PCRs, GAPDH as a reference gene in qPCRs, and nucleolin as a loading control for Western blots. \nTissue samples for immunohistochemistry or immunofluorescence\n    \n Remove the agarose scaffold and rinse the cornea well with PBS.        \n Depending on your experimental goal, use the cornea to make a paraffin tissue block or a frozen tissue block, as shown in the video.  We follow standard procedures when preparing corneal tissue sections.\nRepresentative Results\nMost of the methods available for studying cells in tissue culture can be easily adapted for use in corneas infected with HSV-1 ex vivo.  Shown here are representative results for a few of the most common techniques applicable to studying HSV-1 infection - qPCR (Figure 1D), qRT-PCR (Figure  1B), Western blot (Figure 1F), plaque assay (Figure 1C), and tissue immunofluorescence (Figure 1E).",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/3631/3631fig1.jpgFigure 1.  Analysis of corneas infected with HSV-1 ex vivo. (A) Schematic representation of the ex vivo model of acute corneal epithelial HSV-1 infection.  (B-F) Analysis of corneas infected using the method outlined in this video article.  Explanted rabbit corneas were infected with 1x104 PFU/cornea of strain KOS HSV-1 and cultured in the presence (PAA) or absence (Mock) of phosphonoacetic acid (400 μg/ml), a known inhibitor of HSV replication.  (B) Total RNA was collected at the indicated time points, and viral transcription was assessed by qRT-PCR with primers for HSV-1 polymerase.  Primers against 18S rRNA were used as a reference.  n=3.  Error bars indicate ± SEM.  (C) Culture medium was collected at 48 hpi, and infectious particle production was assessed by plaque assay on CV-1 monolayers.  (D) Total DNA was collected at 48 hpi, and viral genome replication was assessed in a qPCR assay with primers for the HSV-1 genome.  Primers against GAPDH were used as a reference.  n=3.  Error bars indicate ± SEM.  (E) Mock-treated corneas were flash-frozen at 48 hpi, sectioned, and analyzed by indirect immunofluorescence for the presence of a viral early protein (ICP8) within the infected epithelium.  Nuclei are counterstained with Höchst 33258.  (F) Protein lysates were collected at 48 hpi, and expression of a viral protein (ICP0) was assessed by Western blot.  BCA assay was used to ensure equal loading of samples.  hpi = hours post infection.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}