{
  "id": 3196,
  "origin_website": "Cell",
  "title": "Protocol for high-throughput electron tomography exemplified on centrioles in primary human plasma cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDay 1–2: Chemical fixation\nTiming: 30 min bench work, 12 h incubation, 15 min bench work\nIn this first step, a standard chemical fixation is performed using glutaraldehyde and paraformaldehyde to prepare cells for electron microscopy. The protocol was optimized so that it is usable with very sparse amounts of cells.\nPrepare EM fixative according to the recipe provided above in the ‘materials and equipment[href=https://www.wicell.org#materials-and-equipment]’ section.\nTransfer a minimum of 100.000 live cells into a 1.5 mL Eppendorf protein LoBind tube.\nNote: Usage of protein LoBind tubes is crucial especially when working with small samples to preserve as many cells as possible during preparation steps.\nFill up the Eppendorf tube with 1× PBS.\nSpin the cells down for 10 min with 1000 g at 4°C in a swing-out centrifuge.\nLocate the newly formed cell pellet on the bottom of the tube. Gently remove and discard supernatant, then add 1 mL of 4°C cold fixative and resuspend well.\nNote: Always leave the cell pellet slightly covered in liquid when discarding supernatant after centrifugation. This will prevent dehydration of the sample.\nNote: If available, use a glass pipette since cells are more likely to adhere to plastic pipettes.\nIncubate at 20°C for 2 min, then centrifuge again (swing-out, 10 min, 1000 g, 4°C).\nRemove supernatant, then add 1 mL of fixative and resuspend well.\nContinue fixation in the fridge at 4°C for 12 h.\nOn the next day, centrifuge again (swing-out, 10 min, 1000 g, 4°C).\nRemove supernatant and add 1 mL of 0.1 M cacodylate buffer (pH 7.4). Store sample in the fridge at 4°C.\nDay 2: Agarose pre-embedding\nTiming: 30–60 min preparation time, 90 min bench",
    "In this step, cells are embedded into agarose in order to form a stable, dense pellet for consecutive Epon embedding and sectioning.\nPreparation:\nPrewarm a 37°C water bath, heat up a heating block to 37°C and prewarm a swing-out centrifuge to 37°C.\nMelt low melting point agarose in a microwave (max. 10 s) and keep it in water bath at 37°C.\nCut 4 mm of pipette tips off to facilitate handling of low melting point agarose\nPre-heat pipette tips and 200 μL PCR tubes on the heating block.\nNote: Give equipment at least 30 min to reach a stable temperature. This is paramount for the formation of a proper cell pellet.\nStain cells by adding 50 μL of 20 mg/mL Evans Blue in 0.1 M cacodylate buffer to your sample. Incubate at 20°C for 20 min.\nWash your sample 2–3 times until supernatant is almost clear and a blue pellet is visible on the bottom of the tube:\nCentrifuge (swing-out, 10 min, 1000 g, 37°C).\nRemove supernatant and add 1 mL of 0.1 M cacodylate buffer.\nCentrifuge again (swing-out, 10 min, 1000 g, 37°C).\nRemove supernatant completely and immediately add 150 μL of low-melting agarose. Carefully resuspend once and put agarose and cells into 200 μL PCR tube.\nCentrifuge (swing-out, 10 min, 1000 g, 37°C).\nNote: It is crucial to carry out steps 15 and 16 as quickly as possible. If the agarose cools down too much, cells cannot make it to the bottom of the tube during centrifugation and you will not obtain a usable cell pellet.\nLet the pellet solidify on ice for 10 min.\nContinue with Epon embedding or store the pre-embedded sample in the fridge at 4°C.\nDay 2–4: Post-fixation, dehydration and Epon embedding\nTiming: 90–120 min preparation, 120–150 min bench, 48–60 h polymerization",
    "During post-fixation, heavy metals are used so that cells can be visualized in EM later with adequate contrast. Afterwards, water is replaced by acetone and cells are embedded into Epon resin as preparation for sectioning. You will end up with at least one Epon block per sample. These steps are carried out using a temperature-controlled microwave (Pelco BioWavePro) at 23°C equipped with a vacuum pump to speed up the embedding process.\nCritical: Since you will work with cacodylate, OsO4, uranyl acetate and acetone, the microwave needs to be set up under a fume hood.\nNote: You can find a detailed microwave protocol on Mendeley Data: https://doi.org/10.17632/ct23zrnxc2.1[href=https://doi.org/10.17632/ct23zrnxc2.1]\nPreparation:\nPlace all components (Epon mixture A, Epon mixture B, DMP-30, and acetone (50%, 70%, 90%, 100%) at 20°C for 1 h.\nCalculate the necessary amount of resin: You will need 15 mL Epon resin per sample.\nIn a 50 mL Falcon tube, mix Epon mixtures A and B according to “hard” formula:\nPer 15 mL resin, you will need 4.5 mL (4.85 g) Epon mixture A and 10.5 mL (12.72 g) Epon mixture B.\nMix them together in a 50 mL Falcon Tube.\nLet the components mix well for 30 min, then add 0.225 mL DMP-30 per 15 mL resin. Let mix well again.\nNote: Mix gently and do not shake to avoid the formation of small air bubbles inside the resin.\nPrepare at least 2 mL each of the following EPON concentrations (v/v%) in 100% acetone: 10%, 30%, 50%, 70%, 90%\nOn a glass dish under the fume hood, cut the PCR tube to free your cell pellet. Add a few drops of 0.1 M cacodylate buffer to prevent dehydration. If necessary, trim the pellet into appropriate pieces with a scalpel.",
    "Note: Trimming larger pellets into small pieces (e.g., cubes of 0.5 mm side length) is necessary to ensure penetration of the post-fixation agents.\nCarefully transfer the cell pellet or its pieces into a new 1.5 mL Eppendorf tube containing 1 mL 0.1 M cacodylate buffer.\nNote: In the upcoming steps, you will be required to remove the respective supernatant and add another substance. To prevent desiccation and subsequent damage to your sample pellet, it is safer to leave a few μl of supernatant in the tube. This is especially important for steps involving acetone due to its volatility.\nRemove buffer and add 400 μL of 1% OsO4 in water.\nTransfer samples into microwave and start the protocol.\nWhen the microwave is finished, remove OsO4 and wash with dH2O twice.\nRemove supernatant and add dH2O again. Put into the microwave, continue protocol, then repeat this step once.\nRemove supernatant and add 500 μL 1% uranyl acetate in dH2O.\nTransfer samples into microwave and continue protocol.\nRemove uranyl acetate and wash with dH2O twice.\nRemove supernatant and add dH2O again. Put into the microwave, continue protocol, then repeat this step once.\nFor dehydration, remove supernatant and add 50% acetone in water.\nTransfer to the microwave and continue protocol.\nRepeat steps 30 and 31 with 70%, 90%, and 2 × 100% acetone to complete dehydration.\nTransfer cell pellets into small glass vials containing enough 100% acetone to cover the pellet(s).\nRemove acetone and start Epon embedding:\nAdd 10% Epon in acetone, then put the sample in the microwave.\nAfter microwave step, remove Epon.\nRepeat steps 34a and 34b with the following Epon concentrations: 30%, 50%, 70%, 90%, 3 × 100%\nAdd the pellet(s) and enough Epon to an embedding mold. Incubate at 20°C for 12 h.",
    "Polymerize blocks in an oven at 60°C for 48 h.\nDay 4: Serial sectioning and post-staining\nTiming: 3–4 h for serial sectioning; 2 h post-staining\nIn this step, Epon blocks are serially sectioned and then loaded onto formvar-coated grids. A post-staining is applied to enhance contrast in electron microscopy images.\nNote: We used five serial sections measuring approximately 300 × 800 μm in length and width, respectively, and of 200 nm thickness each per grid, yielding a total of 1 μm in Z dimension. You can increase or decrease your final volume by either fitting more sections on one grid, increasing the section thickness, or analyzing several consecutive grids. The choice of your section thickness depends on your feature of interest and the available microscope. Thicker sections will lead to more blur in transmission electron microscopy (TEM), and since you will use 2D TEM images to screen for your target feature, still being able to identify your regions of interest limits your section thickness choice. As an example, larger features (e.g., mitochondria) might still be visible in 300 nm thick sections, whereas for small structures such as cell junctions, you might even have to use thinner sections of 100–150 nm thickness. Additionally, your choice is limited depending on your available electron microscope since for greater section thicknesses, a higher acceleration voltage (200 or even 300 kV) might be necessary to achieve an adequate electron penetration depth, especially at high tilt angles during tomography acquisition. Thus, depending on the cellular ultrastructure you want to analyze, your sample, and the available microscope, we recommend planning your sectioning conditions accordingly.\nSectioning: Trim the block, then make serial sections of 200 nm thickness. Carefully place 5 or more consecutive sections on a formvar coated slot grid (2 × 1 mm).",
    "Note: If you are a novice to serial sectioning of resin blocks, you should consider practicing both sectioning and picking up of the sections with a trial sample (e.g., cells from a cell line) before working with precious, scarce samples. For very detailed information regarding ultramicrotomy techniques, refer to Kolotuev et al.8[href=https://www.wicell.org#bib6] Additionally, at SynapseWeb, the University of Texas provides a well-described step-by-step protocol for serial sectioning for beginners (link in the key resources table[href=https://www.wicell.org#key-resources-table]).\nPlace parafilm on a wet surface and use a lid to cover it to create a slightly moist chamber.\nUranyl acetate staining:\nPer grid you want to post-stain, prepare one row of drops (content of drops see below) to the parafilm:\n50% methanol.\n2% (v/v%) uranyl acetate in 70% methanol.\n4 × 50% methanol.\n3× dH2O.\nNote: All solutions should be filtered using a 0.22 μm filter prior to use to avoid precipitation of reagents.\nCarefully place your grid onto the methanol drop.\nProceed to uranyl acetate. Let the grid incubate for 5 min. Cover parafilm with a lid.\nNote: Grids should float on the surface of the drops during incubation, sections facing down.\nRinse the grid in all 4 methanol drops, then place it in the first water drop.\nLet sit in the water for 1 min with the lid on, then proceed to the next drop. Repeat until last drop of water.\nLead citrate staining:\nAdd potassium hydroxide (KOH) pellets to the parafilm.\nNext to that, add one drop of lead citrate and cover with a lid for 2 min.\nAdd 4 drops of water next to lead citrate.\nPlace grid on lead citrate drop and incubate for 3 min with a lid on.",
    "Place grid in first drop of water and let it sit in the water for 1 min with the lid on, then proceed to the next drop. Repeat until last drop of water is reached.\nTransfer grid to a rubber plate with the sections facing upward.\nDay 4–5: Transmission electron microscopy screening acquisition\nTiming: 2 h at the electron microscope + automated acquisition, ∼ 8–12 h\nIn this step, images of each cell will be acquired on the central section at 1000× and 3000× magnification semi-automatically using SerialEM,2[href=https://www.wicell.org#bib2] KNIME,3[href=https://www.wicell.org#bib3] IMOD5[href=https://www.wicell.org#bib5] and pyEM.6[href=https://www.wicell.org#bib7] These should thus be installed on your TEM computer before you start. 3000× magnification images will be needed to screen through cells and identify cells with target features (in our case: centrioles), whereas 1000× images will be used to trace cells on adjacent sections on the same grid. For in-depth information, refer to Schorb et al.6[href=https://www.wicell.org#bib7]\nSet up the electron microscope at 200 kV, cool it down and insert the grid.\nStart SerialEM and load your settings.\nRecord a low-magnification overview of the whole grid to assess its quality at 80×.\nSelect 80× magnification in the Imaging states window.\nUsing a continuous acquisition camera parameter set, draw a polygon around all sections on the grid using ‘add polygon’ in the Navigator window.\nPress ‘stop adding’ in the Navigator window, then tick ‘Acquire (A)’ and ‘New File at item’.\nChoose ‘Montaged images’ and ‘Fit montage to polygon’ in the upcoming dialogue, then press ‘OK’.\n‘Montage Setup’ will appear. Select ‘Move stage instead of shifting image’, adjust the minimum overlap to 15%.\nNote: If the acquired image montage is not assembled well, increase overlap to 20% (or higher), and check that the microscope is in eucentric focus (‘Standard Focus’) when acquiring.",
    "In the upcoming ‘File Properties’ dialog box, select ‘Unsigned integers’ and tick all information for storage in the extended header of the file (Figure 1[href=https://www.wicell.org#fig1]). Press ‘OK’ and save as ‘80_ov’.\nIn SerialEM, run ‘Navigator’ → ‘Acquire at items’.\nSelect only ‘Acquire map image or montage’ and ‘Skip Z moves in initial move and Realign’, then press ‘GO’.\nAfter acquisition, label the new map in the Navigator window.\nRecord an overview of the central section for image analysis at 400×.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2768-Fig1.jpg\nFigure 1. File Properties dialog\nChoose ‘Unsigned integers’ (highlighted in red) on top and tick all information to store it in the extended header.\nSelect 400× magnification in the Imaging States window.\nFrom the 80× overview map, navigate to a corner of the central section (usually section 3[href=https://www.wicell.org#step-by-step-method-details]) by clicking on it on the map image and pressing ‘Go to marker’ in the navigator window.\nIn continuous mode, draw a polygon around the section and record a map/montage following the instructions from step 43.\nSave as ‘400_s3’. After acquisition, label your map in the Navigator window.\nSet up a reference map (‘refmap’) at 1000×.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2768-Fig2.jpg\nFigure 2. ‘cells_virtualmaps’ workflow in KNIME\nYou can edit node settings by double clicking on them. Top: Overview of the whole workflow. Bottom: Detailed view of ‘Image analysis’ metanode.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2768-Fig3.jpg\nFigure 3. Label mask of the section displayed in KNIME\nThe algorithm marks each cell as an individual object (displayed as different colors).\nUse the 400× overview map and select a cell on an adjacent section close by. Move the stage to this cell by clicking ‘Go to marker’.\nIn the Imaging states, change to 1000× magnification. Adjust the beam and focus.\nRecord an image and save it as ‘refmap’.\nClick ‘New map’ in the Navigator window and label the new item as ‘refmap’.",
    "Set ‘400_s3’ to ‘Acquire’ in the Navigator window and save the navigator as ‘nav.nav’.\nImage analysis workflow using KNIME to detect all cells on the section.\nLaunch KNIME on your PC and open the workflow ‘cells_virtualmaps’ (Figure 2[href=https://www.wicell.org#fig2]).\nDouble-click ‘Navigator settings’ node. Load your saved navigator file and double-check that ‘Reference map NavLabel’ is set to ‘refmap’.\nRight-click on the ‘Image Viewer’ node, then click ‘Execute and View’.\nNote: The script will now automatically merge the 400× mosaic map from step 44 to obtain a smooth merged image using IMOD.\n3dmod will launch automatically. In there, use ‘Model mode’ to create a polygon around the cells and omit section borders. When you are done, save the model by pressing ‘s’ on your keyboard and close 3dmod.\nKNIME will then generate the cropped map image which will automatically open once the workflow is done. Continue with 46.f if you are content with your cropped map. If not, go to troubleshooting[href=https://www.wicell.org#troubleshooting], problem 1[href=https://www.wicell.org#sec6.1].\nRight-click ‘Interactive Segmentation View’ node, then click ‘Execute and View’ and wait until an image will pop up.\nNote: This will create a label mask of the section, marking each cell on it in a different color (Figure 3[href=https://www.wicell.org#fig3]). All cells should be labelled individually.\nIf you are content with the results, continue with step 46.h. If not, refer to troubleshooting[href=https://www.wicell.org#troubleshooting], problem 2[href=https://www.wicell.org#sec6.3].\nNote: This color labelling of individual cells is later used to automatically target these cells during acquisition at higher resolutions. Hence, it is important that as many cells as possible were picked up correctly.\nRight-click on ‘Python Script’ node, then click execute.",
    "Note: KNIME will now create individual virtual maps at each labeled position at 1000× magnification using the reference map. This is needed because SerialEM cannot use low magnification maps for the ‘Realign to item’ command. A new Navigator file (‘nav_automaps.nav’) containing all items will be generated automatically.\nAutomated acquisition of each cell on the central section at 1000× and 3000× magnification, respectively:\nIn SerialEM, open the new Navigator file: ‘Navigator’ → ‘Read and Open’ → select ‘nav_automaps.nav’.\nStill at 1000× magnification, record an image and save it as ‘anchormaps.mrc’. Click ‘New map’ in the Navigator window and label the new item as ‘anchormap’.\nFor this new map, tick ‘For anchorstate’ in the Navigator window.\nDouble-check that ‘anchormaps.mrc’ is the only open file in SerialEM (displayed on top of the screen). If not, close all other files.\nSwitch to 3000× magnification in the imaging states. Check brightness and centering of the beam and apertures.\nIn the main window, click ‘File’ → ‘Open new’ → select ‘Series of TIFF files’. Create a new folder ‘cells’ and in there, save your file as ‘c_’. All 3000× magnification maps will be stored there individually.\nOptional: In the ‘Scripts’ dialog, open script ‘screen’. Adjust parameters for autofocus and eucentricity if necessary.\nClick ‘Navigator’ → Acquire at items…’. Choose the following settings in the upcoming dialog:\nAs ‘Primary Task’, tick ‘Run script’ and select ‘screen’.\nBelow, tick ‘Skip Z moves in initial move and Realign’ and ‘Turn off filament at end’.\nClick ‘Go’.\nNote: SerialEM will automatically create individual images at 1000× and 3000× magnification of all cells and store them in the Navigator file (‘lm_xxx’ for 1000× and ‘hm_xxx’ for 3000× magnification, respectively). Depending on your microscope, about 150 cells will be acquired per hour.",
    "Let the microscope run for the estimated run time. Remember to refill cooling agent (e.g., liquid nitrogen).\nDay 5: Screening evaluation\nTiming: 60–75 min per 1000 cell images at 3000× magnification\nIn this step, 3000× magnification images from the previous step will be used to identify cells of interest (i.e., cells containing target features, in our case centrioles) using ImageJ software.4[href=https://www.wicell.org#bib4] Images/maps of these cells will be kept for further targeting, whereas all other items, such as images of cells without interesting features, will be discarded after this step.\nLaunch ImageJ on your PC and drag and drop your folder ‘cells’ there. Load it as a stack.\nCheck your images for features of interest and note the image number of your target cell. You can use your own sheet or the excel template provided on Mendeley Data: https://doi.org/10.17632/ct23zrnxc2.1[href=https://doi.org/10.17632/ct23zrnxc2.1]\nIn SerialEM, prepare your Navigator file:\nSet the following items to ‘Acquire’ in the Navigator window:\nAll polygons.\nAll virtual maps.\nThe reference map (‘refmap’).\nAll maps (both lower and higher magnification) of cells without target features.\nAll 3000× magnification maps (‘hm_xxx’) of cells containing target features.\nThe ‘anchormap’.\nThe following items need to be kept and therefore must not be set to ‘Acquire’:\n1000× magnification maps (‘lm_xxx’) of cells containing target features.\nThe 400× magnification overview of the central section (‘400_s3’).\nSave the Navigator file, then save as ‘nav_prepared’.\nIn the main window, select ‘Tools’, run ‘Delete Navigator’s Acquire Items’. Once the script is finished, re-open ‘nav_prepared’.\nCheck that all relevant data is still stored in the Navigator file. If not, re-open your old navigator (‘nav_automaps.nav’) and check that all items are set to ‘Acquire’ correctly. Repeat from step 50.a.\nDay 5–6: Targeting and tomography acquisition\nTiming: 3–4 h to set up; for 1 h per 6–7 tomograms (automated acquisition)",
    "In this step, maps of cells containing centrioles and points defining the exact location of the centrioles will be created to serve as target coordinates for tomography on the central section. Afterwards, these will be duplicated and then shifted to all adjacent sections of the grid using registration/transformation and SerialEM’s RealignToItem feature. Thereafter, an automated tomography acquisition is initiated at the points of interest.\nNote: Steps 51 to 56 only need to be performed if you removed the grid or if you use two different electron microscopes for the workflow. If in your setup, everything is performed on a single microscope, you will only have to acquire the section overviews as described in step 54 and then continue with step 57.\nSet up your microscope: Cool it down and load the grid. Launch SerialEM and load your settings.\nOpen the Navigator file ‘nav_prepared’. In the Navigator window, change ‘Registration’ to 2 using the arrow buttons.\nSwitch to 110× in the Imaging states. Add a polygon around the whole grid in Preview mode and acquire a montaged image using the instructions from step 43. Name it ‘ov_new’ and label the item in the Navigator window as well.\nAcquisition of section overviews at low magnification:\nNote: These section overviews will be used for transformation of duplicate items in step 59.\nSwitch to 450× magnification in the Imaging states.\nOpen ‘ov_new’ and click on a corner of one of the outmost sections. Navigate to this position by clicking ‘Go to marker’.\nDraw a polygon around each section. When you are finished, set all polygons to ‘Acquire’ in the Navigator window.\nMark the first polygon in the Navigator window, then click ‘New file at item’ and ‘Montaged images’ with 15% overlap. Choose MRC format and name the file ‘s1’.",
    "Note: SerialEM will now automatically name the subsequent files (‘s2’, ‘s3’, and so on)\nIn the main window, go to ‘Navigator’ → Acquire at items. Select ‘Acquire map image or montage’ as Primary Task, and tick ‘Skip Z moves’, then click ‘GO’.\nOnce the acquisition is finished, relabel the new maps in the Navigator file and save the Navigator.\nRegistration:\nDisplay your new image of the central section (in our case ‘s3’) by double-clicking on it in the Navigator window.\nClick ‘New window’ in the buffer control menu of the main window.\nNow double-click on ‘400_s3’. It will appear in your new window. Arrange both windows so that they are displayed side by side.\nSet registration points to shift the coordinates from the old items to the newly acquired ones: Set corresponding points on correlating structures on both images by clicking ‘Add points’ in the Navigator window. Evenly distribute 6–8 pairs of these points on the whole section.\nMake them ‘registration points’ in the Navigator window.\nSave the Navigator file, then save the Navigator as ‘s3_pretransform’.\nIn the main window, click ‘Navigator’ → ‘Transform items’.\nNote: This will transform the coordinates of all images acquired during the screening to the new, correct coordinates.\nIf the mean deviation is higher than 10 μm between the old and the new coordinates, an error box will show up. In that case, refer to troubleshooting[href=https://www.wicell.org#troubleshooting], problem 3[href=https://www.wicell.org#sec6.5], potential solution 1[href=https://www.wicell.org#sec6.6].\nUpdate microscope states for the old 1000× magnification maps:",
    "Note: Moving a grid from one microscope to another usually requires applying a large scaling factor and rotation to maps. This script therefore creates virtual maps with a modified header from the old 1000× modification maps which can then be utilized for the ‘RealignToItem’ procedure on the second microscope. These virtual maps are eventually replaced by newly acquired maps on the second microscope (step 57).\nSelect 2300× in the Imaging states and adjust the beam.\nRecord an image, save the image as ‘refmap_new’, make it a map in the Navigator window and label the new item as ‘refmap’.\nNote: Even a blank image with a blocked beam is fine.\nSet all 1000× magnification maps (‘lmxxx’) to ‘Acquire’ and save the Navigator file.\nIn the main window, click ‘Tools’ → Update Microscope States for Selected Maps’ to generate a new Navigator file called ‘s3_pretransform_updated’.\nClick ‘Navigator’ → ‘Read and Open’ and open the newly generated Navigator file. All maps acquired at 1000× earlier will now be converted into virtual maps at 2300× magnification.\nCheck whether your transformation was successful: Choose a virtual map in the Navigator window and click ‘Realign to item’. Continue with the next step if you are content with your results. If not, refer to troubleshooting[href=https://www.wicell.org#troubleshooting], problem 3[href=https://www.wicell.org#sec6.5].\nRe-Acquisition of target cells and defining target points.\nNote: In this step, you will reacquire the maps of cells containing centrioles to replace the virtual maps from step 56. On these new maps, you will define your points of interest (where tomography will be performed eventually) by setting points to the centrioles. These points and maps on the central section of the grid will be used in step 59 to semi-automatically target the same cells on adjacent sections.\nSet all created virtual maps to ‘Acquire’.",
    "Move the stage to a point on the central section. In the main window, click ‘Task’ → ‘Eucentric Rough’.\nClick ‘Navigator’ → ‘Acquire at items’. In the upcoming dialog, choose ‘Run script’ as a Primary Task and select the script ‘serial section_initial map’ from the drop-down menu. Then click ‘GO’.\nAfter the first map, an error message will pop up asking for the saving directory of the new maps. Simply click ‘yes’.\nWhen the script has finished, control whether all cells were identified correctly comparing the newly acquired maps with the virtual maps. If an incorrect cell was targeted, refer to troubleshooting[href=https://www.wicell.org#troubleshooting], problem 4[href=https://www.wicell.org#sec6.8].\nWhile controlling all maps, set points to your feature of interest (in our case, centrioles) by clicking ‘Add points’ in the Navigator window.\nRename points and add a section index.\nSet all points to ‘Acquire’.\nIn the main window, click ‘Navigator’ → ‘Acquire at items’. As Primary Task, run the script ‘Name_pts’, and tick ‘Skip initial stage move’ and ‘Skip initial Z move and realign’. Click ‘GO’ and confirm the upcoming error message.\nNote: This will rename all points according to the map they were added on (e.g., a point on the map ‘lm001’ will be named ‘c001’)\nSet all 2300× maps and all corresponding points to ‘Acquire’.\nIn the main window, click ‘Navigator’ → ‘Acquire at items’. Run the script ‘Add Section Index’.\nNote: This will add the index ‘_s03’ to the name of your maps and points. If you did not screen on section 3[href=https://www.wicell.org#step-by-step-method-details], edit the script accordingly in the ‘Scripts’ window.\nSave the Navigator file.\nTransfer acquired maps and coordinates to adjacent sections to locate target cells:",
    "Note: In this step, three major steps are involved: First, the maps and points on the central section are duplicated. Second, these duplicates are shifted from the central section to another using transformation on low-magnification overviews of the respective sections. Third, a SerialEM script utilizes the ‘RealignToItem’ feature to locate the exact cell and centriole point on the adjacent section and labels the points automatically.\nMark the map ‘s3’ in the Navigator window and change its Registration to 3. To do that, in the main window, click ‘Navigator’ → ‘Change registration’.\nDisplay ‘s3’ side by side with the overview map of an adjacent section by clicking ‘New window’ in the Buffer controls menu.\nAdd 6–8 pairs of registration points (as described in step 55).\nChange the registration of s3 back to ‘2’ using ‘Navigator’ → ‘Change registration’ in the main window.\nSet the target points (the ones named ‘cxxx_s03’) to ‘Acquire’ and save the Navigator file.\nIn the main window, click ‘Tools’ → Duplicate Navigator’s Acquire Points and associated maps’ to create a new Navigator file with the suffix ‘_duplicated’.\nNote: This tool duplicates the selected points and maps. Subsequently, the duplicates will be shifted to an adjacent section using a transformation, while the original items on the central section remain unmoved.\nRead and open the new Navigator file.\nFind the points from the central section and ‘De-Acquire’ them. Instead, find the duplicated points at the bottom of the Navigator file and set them to ‘Acquire’.\nThe registration was automatically set to ‘3’ in the process. Set it back to ‘2’ using the arrow keys in the Navigator window.\nSave the Navigator file.\nIn the main window, click ‘Navigator’ → ‘Transform items’. If an error message pops up (Figure 4[href=https://www.wicell.org#fig4]), refer to troubleshooting[href=https://www.wicell.org#troubleshooting], problem 3[href=https://www.wicell.org#sec6.5], potential solution 1[href=https://www.wicell.org#sec6.6].",
    "Note: The duplicated points and maps should now be moved to the adjacent section you chose before.\nCheck for 3 to 4 cells if they have been identified correctly: Select the map or point in the Navigator window and click ‘Realign to Item’. If you are content with your results, continue with the next step. If not, refer to troubleshooting[href=https://www.wicell.org#troubleshooting], problem 3[href=https://www.wicell.org#sec6.5], potential solution 2[href=https://www.wicell.org#sec6.7].\nIn the ‘Scripts’ dialog, find the script ‘serialsections_pts_map’. Change the section number to the one you have just transferred your points to (Figure 5[href=https://www.wicell.org#fig5]).\nMove the stage to a point on the adjacent section. In the main window, click ‘Task’ → ‘Eucentric Rough’.\nClick ‘Navigator’ → ‘Acquire at items’. Run the script ‘serialsections_pts_map’ as a Primary Task. Below, only ‘Skip initial Z moves and realign’ should be ticked.\nNote: This script uses the shifted maps from the central section to identify the same cells on the adjacent section. It will automatically realign to the points, create new map images of each cell, mark the target features with points and then rename the maps and points accordingly.\nSet the old virtual maps and the registration points to ‘Acquire’ in the Navigator window.\nSave the Navigator file, then save as a new file (e.g., ‘s1_pretransform’).\nIn the main window, click ‘Tools’ → ‘Delete Navigator’s acquire items’.\nRead and open the new Navigator file and repeat step 59 for all sections on the grid.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2768-Fig4.jpg\nFigure 4. Error box showing up if the registration points were not set correctly\nThis comes up if the coordinates between the new and old maps deviate too much from each other. In that case, refer to troubleshooting[href=https://www.wicell.org#troubleshooting], problem 3[href=https://www.wicell.org#sec6.5].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2768-Fig5.jpg\nFigure 5. Script dialog for ‘serialsections_pts_map’ script",
    "Each time you use the script on a new section, the section index should be edited accordingly (highlighted in blue).\nPrepare the Navigator file for tomogram acquisition:\nSort the Navigator file by clicking ‘Tools’ → ‘Sort Navigator’ to generate a new Navigator file with the suffix ‘_sorted’.\nBrowse through the Navigator file and check that all points were set correctly on all sections. Use ‘Edit mode’ in the Navigator window if a point was not set accurately and correct its position or, if a cell was not imaged correctly, refer to troubleshooting[href=https://www.wicell.org#troubleshooting], problem 4[href=https://www.wicell.org#sec6.8].\nSet all points to ‘Acquire’ and save the Navigator file.\nClick ‘Tools’ → ‘Sort by Section’.\nStart the automated tomogram acquisition:\nSwitch to your desired magnification for tomography in the imaging states and adjust the beam.\nGenerate a new folder as a directory for the tomograms. Name it ‘tomo’ and copy its file path.\nEdit the script ‘quicktomo_master’ in the Scripts’ ‘dialog: paste the file path to the directory you have just created and set ‘realign to item’ (=1) as strategy.\nCheck the available space on your hard drive: approximately 1 GB will be used per tomogram.\nStart the acquisition by clicking ‘Navigator’ → ‘Acquire at items’. Run the script ‘quicktomo_master’ as Primary Task and tick ‘Skip initial Z move and realign’ and ‘Close column valves at the end’ / ‘Turn off filament at end’.\nNote: Depending on your microscope and your settings, around 7 tomograms will be acquired per hour automatically. Remember to refill your cooling agent and let the microscope run for the projected time given in SerialEM.\nDay 6–7: Data reconstruction and joining\nTiming: Reconstruction: 5 min for set up + runtime on the cluster; joining: 5–7 serial tomograms per hour",
    "After acquisition, you will end up with single axis tomograms of cells on individual sections. In this step, raw tomography data are first converted into actual volume data (reconstruction), and then tomograms of the same cell on different sections are joined to form the final volume.\nNote: We used a set of Python commands to launch IMOD’s automated pipeline on a high-performance computer cluster as reported elsewhere.7[href=https://www.wicell.org#bib8] Instructions for implementation and usage of the batchruntomo feature can be found in the IMOD user manual (link provided in the key resources table[href=https://www.wicell.org#key-resources-table]).\nReconstruction: launch IMOD’s automated reconstruction either through scripts on dedicated HPC hardware or use the etomo graphical user interface to manage the procedure. Provide the location to the acquired tilt series and the batch directive with the reconstruction parameters.\nNote: The parameters used in our study are provided in Mendeley Data: https://doi.org/10.17632/ct23zrnxc2.1[href=https://doi.org/10.17632/ct23zrnxc2.1]\nDuring reconstruction, new ‘.rec’ files will be generated in the folder where the original tilt series are stored. Copy these files to a new folder called ‘reconstructed’.\nJoin single tomograms to obtain final volume:\nLaunch etomo and create a new join by clicking ‘File’ → ‘New’ → ‘Join Serial Tomograms’.\nSet your working directory and name your output file.\nAdd all individual section tomograms of one cell: E.g., if you have acquired cell 001 on 5 sections, add ‘c001_s01’ to ‘c001_s05’.\nDisplay each tomogram in 3dmod using the etomo graphical user interface and check the lower and higher frames. Trim away frames without information by adding the respective frame numbers in the ‘Start’ and ‘End’ panel.\nCreate a stack by clicking ‘Make samples’ and wait until the program has finished.\nIn the upcoming ‘Align’ window, you can calculate a coarse or fine alignment or manually align your stacks.",
    "Once you are content with your alignment, switch to the ‘Join’ window and finish the serial tomogram. You can display your result directly from etomo or open it with IMOD."
  ],
  "subjectAreas": [
    "Microscopy",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}