{
  "id": 2440,
  "origin_website": "Cell",
  "title": "Protein purification, crystallization, and structure determination of human DEAD-box RNA helicase DDX21 in different unwinding states",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTransformation and expression of DDX21\nTiming: 2 days\nTransform the expression plasmids into the BL21-CodonPlus (DE3) RIL cells and express DDX21 protein with IPTG. Collect the cell pellets for future purification.\nThe plasmids and corresponding antibiotic resistance are summarized as bellow:\ntable:files/protocols_protocol_1924_14.csv\nNote: BL21-CodonPlus (DE3) RIL Competent Cells (Agilent Technologies) are chloramphenicol-resistant.\nResuspension of plasmid.\nSpin lyophilized commercial custom plasmid (from GenScript) down at 10,000 × g for 2 min in an Eppendorf 5430R Centrifuge with an FA-45-30-11 rotor (Eppendorf).\nAdd 40 μL MilliQ ultrapure water directly to the bottom of the tube containing 100 μg plasmid.\nVortex it for 10 s to make a DNA plasmid stock of 40 ng/μL final concentration.\nSpin it down at 10,000 × g for 2 min in Eppendorf 5430R Centrifuge with a FA-45-30-11 rotor (Eppendorf).\nStore the plasmid at −80°C until use.\nCritical: Do NOT open the commercial plasmid tube without spinning it down. This may cause loss of the plasmid.\nTake BL21 (DE3) RIL competent cells (Agilent Technologies) cells from −80°C and place them on ice.\nThaw both the competent cells and the plasmid on ice for 30 min.\nAdd 1 μL of the plasmid into 50 μL of competent cells.\nMix the plasmid gently through the bacterial solution by pipetting.\nIncubate the cells for 30 min on ice.\nPerform heat shock at 42°C for 90 s.\nPut the cells back on ice for 2 min.\nAdd 500 μL of pre-warmed (37°C) LB medium into the Eppendorf tube that contains transformed competent cells.\nIncubate the culture tube in an incubator at 37°C for 60 min.\nSpread 100 μL of cell suspension using a commercial sterile spreader into kanamycin (50 μg/mL) and chloramphenicol (34 μg/mL)-containing agar plate that is preheated to 37°C.",
    "Put the plate upside down in a 37°C incubator and incubate for 18 h.\nInoculate a single colony from the plate into 50 mL LB media supplemented with 34 μg/mL chloramphenicol and 50 μg/mL kanamycin.\nCulture the cells in New Brunswick Innova 44 shaker (Eppendorf) at 37°C and 250 rpm for around 16 h.\nInoculate the overnight culture 1:100 (v/v) in 1 L LB media supplemented with 50 μg/mL kanamycin, in a 2 L Erlenmeyer flask (Thermo Fisher Scientific).\nGrow the cells in New Brunswick Innova 44 shaker (Eppendorf) with an agitation speed of 250 rpm at 37°C until the optical density of OD600 reaches around 0.8.\nSwitch the shaker temperature to 16°C and the speed to 180 rpm, while cooling down the cell culture in a 4°C refrigerator for 15 min.\nPut the cell culture back to the shaker, and induce protein expression by adding IPTG at a final concentration of 0.1 mM, along with shaking at 180 rpm at 16°C for 20 h.\nHarvest cells by centrifugation using a F10-6 × 500y Fixed-Angle Rotor (Thermo Fisher Scientific) in Sorvall™ RC 6 Plus Centrifuge (Thermo Scientific) at 5,000 × g for 10 min at 4°C, and then discard the supernatant.\nPause point: Pellets can be stored at −80°C for up to 12 months.\nPurification of DDX21 with a high salt buffer\nTiming: 2–3 days\nPurify nucleic acid-free DDX21 protein using a high-salt buffer during both the loading and washing steps (Figure 2[href=https://www.wicell.org#fig2]). High salt interrupts the electrostatic interactions between protein and nucleic acid. It is easy, cheap, fast, and sufficient to remove bound nucleic acid in general, and is the only way to purify nucleic acid-binding proteins in one step.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1924-Fig2.jpg\nFigure 2. Diagram of the procedure for expression and purification of DDX21\n(A) Preparation of cells expressing DDX21.",
    "(B) Affinity purification and removal of the His-SUMO tag from DDX21.\n(C) Further purification by size exclusion chromatography.\nNote: Both DDX21 constructs (WT and del-loop) were purified using the same procedure.\nResuspend the cell pellets with lysis buffer B with a ratio of 10–20 mL buffer per gram (wet weight) cell pellet, by using an ULTRA-TURRAX T10 Basic Disperser (IKA), and resuspend cell homogeneously with intervals of 30 s on and 30 s off on ice.\nCritical: The high salt (1 M NaCl) condition in the lysis buffer B is used for the purpose of nucleic acid removal from DDX21 protein. A concentration of NaCl higher than 1 M could be tried, but be careful that too high salt concentration may also cause precipitation of DDX21. 1 M NaCl is the optimal concentration in this research.\nAlternatives: HL-SAN nonspecific endonuclease (ArcticZymes) or equal product of nuclease which could endure high salt conditions, could be added into the lysis buffer B to digest nucleic acid.\nAlternatives: Polyethyleneimine (PEI) can be used to precipitate nucleic acids, but itmay cause protein loss from co-precipitation, and must be handled with care.\nNote: Please keep the cell on ice for resuspension, to avoid protein aggregation or precipitation caused by heating.\nNote: 1 tablet of EDTA-free protease inhibitor cocktail (Roche) per 100 mL buffer should be added to inhibit the protease activity.\nLyse the resuspended cells by using APV Laboratory Homogenizers (SPX FLOW), under 800–1,500 bar pressure and disrupt the cells for 3–4 cycles.\nNote: Keep the lysate at a low temperature with 4°C cold circulation water.\nAlternatives: Sonication can be used to lyse the cell.\nCentrifuge the cell lysate at 15,000 × g using a SS-34 Fixed-Angle Rotor (Thermo Fisher Scientific) for 30 min to remove cell debris and insoluble fractions.",
    "Equilibrate 10 mL Ni-NTA resin (QIAGEN) with lysis buffer B.\nIncubate the supernatant with the pre-equilibrated Ni-NTA resin in 50 mL Falcon tubes, rocking on a Tube Roller Mixer (AliExpress) at 4°C overnight.\nAlternatives: A pre-packed Ni-affinity column can be used along with an AKTA system. But overnight batch binding with Ni-NTA beads significantly increased the yield of affinity purification in our lab.\nApply the suspension with the protein-bound Ni-NTA resin to an Econo-Column Chromatography Column (Bio-Rad).\nTo remove impurities and nucleic acid, wash the resin extensively with at least 500 mL lysis buffer B that contains 20 mM imidazole.\nCritical: Washing the resin with no less than 50 × CV volume of wash buffer is important to remove the bound nucleic acid. In particular, if purifying full-length DDX21, a larger volume of wash buffer might be necessary for complete nucleic acid removal (i.e., 100 × CV).\nNote: Quick Start™ Bradford 1× Dye Reagent (Bio-Rad) can be used to roughly evaluate the protein concentration of the wash or elution fractions from a gravity column. Add 10 μL of the fractions to 100 μL of Bradford 1× Dye Reagent and observe the depth of the blue color, to roughly estimate the protein concentration.\nElute his-sumo tagged DDX21 protein with lysis buffer B containing 500 mM imidazole.\nAdd the pre-prepared Ulp1 enzyme (5 mg/mL, 200 μL) to the elution fractions to cleave between the His-sumo tag and DDX21.",
    "Note: In general Ulp1 could efficiently cleave sumo tagged protein at a ratio between 1: 500 and 1: 1,000 (w/w) for a over-night cleavage at 4°C, with a proper buffer condition. Since high concentration of salt and imidazole will reduce the cleavage efficiency of Ulp1, we recommend to add an excess amount of Ulp1 to ensure complete cleavage. Here 200 μL of 5 mg/mL (1 mg total) Ulp1 enzyme could efficiently cleave at least 100 mg of DDX21 in this study.\nTransfer the reaction mixture to several D-Tube Dialyzers (15 mL, MWCO 3.5 kDa; Millipore).\nImmerse the D-Tube Dialyzers into 4 L dialysis buffer, stirring with a magnetic stirrer (Corning) and incubate for 16 h at 4°C to cleave the His6-SUMO tag.\nAlternatives: Other high-performance dialysis products, such as Slide-A-Lyzer Dialysis Cassettes (Thermo Scientific), could also be used for dialysis to remove imidazole at this step.\nAnalyze a 15 μL sample of the Ulp1 cleavage reaction by SDS polyacrylamide gel electrophoresis (SDS-PAGE) using a Novex™ 4%–20% Tris-Glycine Mini Gel (Thermo Fisher Scientific). Troubleshooting 1[href=https://www.wicell.org#troubleshooting].\nOnce the desirable extent of the cleavage reaction is achieved (90%–100%), load the reaction mixture back onto an Econo-Column Chromatography Column (Bio-rad) containing 10 mL Ni-NTA resin, which is pre-equilibrated with lysis buffer B containing 20 mM imidazole.\nNote: Calculate the final concentration of imidazole in the reaction mixture after dialysis, and add imidazole to reach a final concentration of 20 mM in the reaction mixture, before loading onto the “substractive” Ni-NTA column.\nCollect the flow-through.\nWash the Ni-NTA column with lysis buffer B containing 20 mM imidazole.\nAnalyze a 15 μL sample of each purification step by SDS Polyacrylamide gel electrophoresis (SDS-PAGE) using a Novex™ 4%–20% Tris-Glycine Mini Gel (Thermo Fisher Scientific). Troubleshooting 2[href=https://www.wicell.org#troubleshooting].",
    "Combine the Ni-NTA column flow-through and wash fractions that contain the tag-free DDX21.\nAdd DTT to a 5 mM final concentration.\nConcentrate the protein to be with 3–5 mL final volume, using a 30 kDa MWCO Amicon Ultra-15 Centrifugal Filter Unit (Millipore) and centrifuge at 3,000 × g and 4°C in an Eppendorf 5810 R Centrifuge with an A-4-62 rotor (Eppendorf).\nCritical: Adding 5 mM DTT could improve the stability of DDX21 protein during the concentration step. If precipitant is still observed, more NaCl (up to 1 M) and/or glycerol (up to 10%) can be added to stabilize the DDX21 protein.\nNote: For DDX21(188–563, WT) and DDX21(188–563, del-loop) constructs, the solubility limit of the two proteins is around 40 mg/mL.\nTransfer the concentrated protein into several 1.5 mL centrifuge tubes.\nCentrifuge at 16,000 × g and 4°C in an Eppendorf 5430R Centrifuge with an FA-45-30-11 rotor (Eppendorf) for 5 min.\nCollect the supernatant by pipetting.\nInject the concentrated protein onto a HiLoad 16/600 Superdex ® 200 prep grade (Cytiva) pre-equilibrated with gel-filtration buffer.\nSet the flow rate at 0.5 mL/min. DDX21 protein elutes at ∼90 mL on this column. Troubleshooting 3[href=https://www.wicell.org#troubleshooting].\nAnalyze a 15 μL sample of each gel-filtration fraction by SDS polyacrylamide gel electrophoresis (SDS-PAGE) using a Novex™ 4%–20% Tris-Glycine Mini Gel (Thermo Fisher Scientific).\nPool protein-containing fractions, and concentrate the protein to 30 mg/mL using a 30 kDa MWCO Amicon Ultra-15 Centrifugal Filter Unit (Millipore) at 3,000 × g in an Eppendorf 5810R Centrifuge with an A-4-62 rotor (Eppendorf).",
    "Note: Use Nanodrop (Thermo Fisher Scientific) to determine the OD280 value, and calculate the protein concentration using the Beer-Lambert law equation with molar extinction coefficient, which could be obtained from online tools such as ExPASy Protparam tool (https://web.expasy.org/protparam/[href=https://web.expasy.org/protparam/]). For the two DDX21 constructs used here, 1 A[280] is correlated to 1.7 mg/mL for WT construct and 1.67 for del-loop construct. For example, for WT construct when the absorbance value of the protein solution at 280 nm is 1, then its concentration is 1.7 mg/mL.\nAlternatives: The Quick Start™ Bradford 1× Dye Reagent (Bio-Rad) could also be used to quantify the protein concentration. Use the BSA standard to make a standard curve. Then measure and calculate the concentration of your protein with the standard curve.\nNote: Also use Nanodrop (Thermo Fisher Scientific) to determine the OD260/OD280 ratio, a ratio less than 0.60 is a good indication of pure protein with minimal nucleic acid contamination.\nTransfer the concentrated protein into several 1.5 mL centrifuge tubes.\nCentrifuge at 16,000 × g and 4°C in an Eppendorf 5430R Centrifuge with an FA-45-30-11 rotor (Eppendorf) for 10 min.\nCollect the supernatant by pipetting.\nAliquot the protein into 1.5 mL centrifuge tubes (50 μL per tube).\nSnap-freeze in liquid nitrogen, and store at −80°C for further use.\nCritical: Reduce the freeze-thaw cycles to avoid the destabilization of DDX21 protein and for better repeating of the crystals. Snap-freeze the aliquots every time before putting back to −80°C.\nMST binding assay\nTiming: 1 day\nMeasure the binding affinity of the interaction between DDX21 and RNA using the microscale thermophoresis (MST), which is a rapid and precise method to quantify protein-nucleic acid interactions in solution (Mueller et al., 2017[href=https://www.wicell.org#bib11]), especially for RNA that tends to degrade (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1924-Fig3.jpg",
    "Figure 3. Characterization of the interaction between DDX21 and RNA by MST\nRNAs are labeled with 5′-FAM and DDX21 is titrated. Data are presented as mean ± SD. U15 RNA has a higher affinity (lower KD value) than U10 RNA when binding to DDX21, and Both AMPPNP and MgCl2 co-factors are necessary for the interaction of DDX21 with RNA.\nAssay setup pretests: before you start, make sure that you are using the optimal concentration of the labeled molecule, the correct capillary type and a buffer composition in which your sample is homogeneous.\nNote: A proper buffer recipe should be used to ensure the binding between the RNA of interest and the RNA helicase protein.\nNote: Before you start, compare the Monolith systems to find the suitable one. Monolith NT.115 gives the most flexibility when it comes to labeling strategy with multiple fluorescent channels, while Monolith NT. Labelfree utilizes intrinsic tryptophan fluorescence and may have less sensitivity. Furthermore, Monolith NT. Automated can help you with your screening projects with higher throughput, detection versatility, and automation option (used in this study).\nNote: For more details on the MST assay to quantify protein-nucleic acid interaction, also refer to Huang and Li (2022)[href=https://www.wicell.org#bib7].\nFluorescence check.\nFill the labeled RNA in a standard capillary and place the capillary on the tray.\nInsert the tray in the instrument and close the door.\nSelect the “LED Color” fitting the dye that you are using in the box “LED Settings” (Blue color for Fam fluorescent dye).\nSelect the “LED Power” as 50% in the box of “Capillary Scanning”.\nPress the “Start Cap Scan” button and the instrument will automatically scan the sample tray by measuring the fluorescence.\nThe “Capillary Scan” will start from the last capillary and move to the first position.",
    "Note: Make sure the reading is between 200–1,500 fluorescence counts. To achieve this, sample concentration can be adjusted, or the LED power can be varied between 15% and 95%.\nChoose a concentration of the labeled RNA to achieve optimal fluorescence counts. Typically, 5–100 nM labeled RNA is used.\nCapillary Check.\nPrepare the labeled RNA at the concentration you want to use in the assay.\nFill four standard treated capillaries, four hydrophilic capillaries, and four hydrophobic capillaries with the RNA.\nPut these 12 capillaries on the tray.\nInsert them into the instrument and start a capillary scan.\nPick the capillary that gives a symmetrical fluorescence peak.\nNote: Avoid using the capillary that gives the fluorescence peak having shoulders or even clear double peak.\nNote: If the fluorescence peak has shoulders or even a clear double peak, it means the labeled sample was slightly or firmly adsorbed to the surface of the capillary. In this case, try another type of capillary. In the unlikely case that the sample is sticking to all types of capillaries, you can also try different buffers (e.g., containing detergent, BSA, casein, or other additives). Additionally, try to improve buffer conditions by adjusting pH and ionic strength.\nSample check.\nDilute the labeled RNA in 100 μL of the the MST binding buffer.\nFill into the suitable type of capillary determined.\nStart a capillary scan with the predetermined setting, and measure the labeled RNA sample at 40% MST power with an on-time of 30 s.\nLoad and analyze the results in the MO. Affinity Analysis software.\nNote: If there is no bumpiness of the MST curves and a decimal appears on the left axis of the plot, the quality of the sample is good (Huang and Li, 2022[href=https://www.wicell.org#bib7]).",
    "MST binding test: Setting up the MST experiment with a fixed concentration of the fluorescent-labeled RNA, titrated with the unlabeled DDX21 protein.\nNote: We used polyU in the MST binding test because it represents ssRNA and is the RNA we used for co-crystallization with DDX21. Other RNA sequences can be tested using MST with similar protocol.\nNote: Binding of RNA helicase with RNA of interest may need additional co-factors (i.e., Mg2+ ion and ATP analogs), and a suitable pH value of the buffer is important to retain the stability and activity of your proteins. In addition, high salt (i.e., 500 mM NaCl) will tend to disrupt the binding between them, so in general please avoid using high salt buffer condition in this MST binding test.\nNote: The del-loop construct still binds to polyU RNA with comparable binding affinity.\nFill 20 μL of the highest concentration of the unlabeled DDX21 protein in the first well of a 384-well low attachment microplate (Corning).\nAlternatives: Instead of the microplate, micro reaction tubes can be used.\nCritical: It is crucial to ensure that the correct protein amount is pipetted because there is no possibility of normalizing protein concentrations.\nFill 10 μL of the MST binding buffer in the wells 2–12.\nTransfer 10 μL solution from well 1 to well 2.\nMix thoroughly by pipetting up and down for several times without making any bubbles.\nRepeat to get a serial dilution.\nFinally, remove 10 μL from well 12 after mixing.\nNote: Protein samples were serially diluted to obtain a concentration range spanning from ∼0.1 × Kd to ∼10 × Kd, where possible. In this study we do the two-fold serial dilution of DDX21 starting from 340 μM.\nPrepare a stock of the fluorescent-labeled RNA at double the concentration determined in the MST binding buffer.",
    "Mix 10 μL of 100 nM RNA with 10 μL of the titrated DDX21 protein and so the final concentration of RNA in the mixture is 50 nM.\nMix well by pipetting up and down several times without making any bubbles.\nIncubate at 25°C in the dark for 30 min before loading them into the capillaries.\nTo fill a capillary, dip Monolith NT. Automated Premium Capillary Chips (NanoTemper Technologies) directly into the reaction samples from the 384-well plate.\nNote: All steps, including the work with capillaries, should be performed with powder-free gloves to prevent impurities and adverse effects on the glass surface, because the powder used in laboratory gloves can fluoresce and scatter light and hence, impair the measurement. In addition, touch only the ends but not the middle part of the capillaries where the observation field is located (Zillner et al., 2012[href=https://www.wicell.org#bib16]).\nStart MST analysis. Measure at 3 different MST powers starting from the lowest MST power (e.g., 20%, 40%, 80%), and compare the results.\nChoose the power that yields a good signal to noise ratio as low as possible (Huang and Li, 2022[href=https://www.wicell.org#bib7]).\nPerform data interpretation.\nOpen MO.Affinity Analysis software.\nCreate a new analysis and load raw data.\nClick Initial Fluorescence button in the View Panel to check.\nNote: Typically, the variation among the 12 capillaries should be lower than 10% between different capillaries. Troubleshooting 4[href=https://www.wicell.org#troubleshooting].\nThe KD can be determined by selecting the KD fit model with the default setting in the Dose Response Fit window. Troubleshooting 5[href=https://www.wicell.org#troubleshooting].\nAlternatives: Data can be exported and loaded to GraphPad Prism for binding analysis if preferred.\nThe Compare Results screen allows for a side-by-side comparison of MST runs.\nThe Export button in the Compare Results screen allows for exporting the dose-response chart as either a figure or raw data format.",
    "The Generate Full Report button in the Compare Result screen allows for generating a full PDF report.\nSize exclusion chromatography co-elution binding assay\nTiming: 1 day\nEvaluate the interaction between DDX21 and RNA and the stability of the DDX21-RNA complex using a size exclusion chromatography (SEC) co-elution binding assay. A prepacked Superdex 200 10/300 GL gel filtration column (Cytiva) is used to separate the RNA-DDX21 complex from individual components (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1924-Fig4.jpg\nFigure 4. Characterization of the interaction between DDX21 and RNA by SEC co-elution\nU15 RNA forms a stable complex with DDX21 while U10 RNA does not.\n(A) Graphical representation of the principle of the gel filtration technique in which the separation of components is based on differences in their stokes radius (also called hydrodynamic radius), which is influenced by both molecular weight and shape (Hagel, 2011[href=https://www.wicell.org#bib6]). SEC employs a gel matrix with pores of a specific size range and separates on the basis of whether or not a protein of a particular size or shape can enter the pore or is excluded from the pore.\n(B) Superimposition of the gel-filtration profiles among DDX21, U15, AMPPNP, and the DDX21-U15-AMPPNP mixture. DDX21-U15-AMPPNP forms a stable complex in SEC (the peak marked with asterisk). U15 RNA: DDX21=1:1.3 (molar ratio).\n(C) Superimposition of the gel-filtration profiles among DDX21, U10, AMPPNP, and the DDX21-U10-AMPPNP mixture. DDX21-AMPPNP and U10 could not form a stable complex in SEC.\nDilute DDX21 protein to 1 mg/mL in a 1.5 mL centrifuge tube with size exclusion chromatography (SEC) co-elution buffer supplemented with 100 μM AMPPNP in a final volume of 200 μL.\nDilute RNA for analysis in another 1.5 centrifuge tube with MST binding buffer to a final volume of another 200 μL.\nNote: Make sure that the molar ratio of RNA: protein is around 1:1.",
    "Mix the diluted DDX21 protein and RNA and incubate the mixture at 4°C for 1 h.\nCentrifuge the DDX21-RNA mixture at 16,000 × g and 4°C in an Eppendorf 5430R Centrifuge with an FA-45-30-11 rotor (Eppendorf) for 5 min.\nLoad the supernatant into Superdex 200 10/300 GL gel filtration column (Cytiva).\nRun sample with a flow rate of 0.5 mL/min.\nSet up control of individual components including DDX21 alone, RNA alone, and AMPPNP alone.\nNote: Run 200 μg DDX21 protein, or 15 μM RNA of interest, or 100 μM AMPPNP respectivtly in the same gel filtration column with a flow rate of 0.5 mL/min. Pre-dilute the three samples respectively with size exclusion chromatography (SEC) co-elution buffer in a final volume of 400 μL, before loading into the column.\nSuperimpose the gel-filtration profiles.\nCompare the retention volume of DDX21-RNA mixture with individual components.\nNote: Left shift of the peak of the RNA-DDX21 mixture from gel-filtration indicates the binding of RNA and DDX21 protein. Troubleshooting 5[href=https://www.wicell.org#troubleshooting].\nNote: AMPPNP has very strong absorbance at OD260, and elutes with a retention volume of around 20 mL.\nAlternatives: Collect each peak fraction and run SDS-PAGE gel to check, especially when the interaction is not very strong and the RNA-protein complex is not stable enough. A partial left shift of the gel filtration fractions in the SDS-PAGE gel still indicates the interaction between RNA and protein, but is not recommended to be used for co-crystallization.\nCrystallization and structure determination of DDX21\nTiming: 7–14 days for crystallization\nTiming: 3–7 days for X-ray data collection and structure determination\nGenerate the crystals of DDX21-apo (with DDX21 aa 188–563, del 401–405), DDX21-ADP (with DDX21 aa 188–563, del 401–405) and DDX21-AMPPNP-U15 RNA (with DDX21 aa 188–563, WT). Collect X-ray data sets of these crystals and determine the structures (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1924-Fig5.jpg",
    "Figure 5. Crystallization and structure determination of DDX21\nScale bar, 100 μm.\nPerform the crystallization screening by using a crystal screening robot of Phoenix (ARI), with commercially available JCSG + suite kit (NeXtal) and pEG ion kit (Hampton).\nStore the INTELLI-PLATE 96 Well plates (Art Robbins Instruments) in Rockimager (Formulatrix) to record the formation of crystals.\nAfter initial crystal hits are obtained, optimize crystals by using a 24-well sitting drop plate with a grid search strategy, to evaluate appropriate pH, salt, and precipitant concentrations.\nGrow crystals by equilibrating a mixture containing 1 μL protein solution and 1 μL reservoir solution against 500 μL reservoir solution at 20°C using sitting drop vapor diffusion methods. Troubleshooting 6[href=https://www.wicell.org#troubleshooting].\nMix 20 mg/mL of DDX21 (188–563, del 401–405) with an equal volume of reservoir solution containing 20% PEG3350 and 0.2 M Na2HPO4) to grow DDX21-apo crystals at 20°C.\nMix 20 mg/mL of DDX21 (188–563, del 401–405) protein supplemented with 5 mM ADP and 10 mM MgCl2 with an equal volume of reservoir solution containing 20% pEG3350, 0.2 M Magnesium acetate, to grow DDX21-ADP crystals at 20°C.\nDilute purified DDX21 (188–563) to 6–8 mg/mL and incubate with a U15 RNA at a protein to RNA ratio of 1:1.1, in 20 mM Tris-HCl (pH 7.5) buffer containing 100 mM NaCl, 1 mM TCEP, 1.5 mM AMPPNP and 3 mM MgCl2.\nThen mix 1 μL of the DDX21-U15 RNA mixture sample with 1 μL of reservoir solution comprised of 7% v/v 2-Methyl-2,4-pentanediol (MPD) and 0.1 M Bicine, pH8.5, to grow DDX21-AMPPNP-U15 RNA crystals at 20°C.\nCritical: Pre-equilibrate the DDX21 protein and RNA to room temperature, and pre-dilute RNA from the RNA stock before mixing with DDX21 protein, could prevent precipitation. Troubleshooting 7[href=https://www.wicell.org#troubleshooting].",
    "Alternatives: Purifying the DDX21-RNA complex by SEC may help to obtain the complex with correct stoichiometric ratio, and remove excess individual components. But normally this step will cause protein loss and is unnecessary, especially when the correct stoichiometric ratio is pre-determined from SEC co-elution.\nPlate-shaped crystals of the dimensions of ∼ 100 × 50 × 5 mm3 for DDX21-ADP and DDX21-AMPPNP-U15 complex appear within 7–14 days.\nPlate-shape crystals of the dimensions of ∼ 60 × 20 × 5 mm3 for DDX21-apo are formed within 14 days.\nLoop the crystals using appropriate loops under the optical microscope.\nCryoprotect the crystals with 30%–35% glycerol before freezing in liquid nitrogen. Troubleshooting 8[href=https://www.wicell.org#troubleshooting].\nCollect X-ray diffraction data at the synchrotron (Shanghai Synchrotron Radiation Facility beamlines).\nUse the HKL2000 program (Otwinowski and Minor, 1997[href=https://www.wicell.org#bib13]) and the XDS program package (Kabsch, 2010[href=https://www.wicell.org#bib8]) for indexing, integrating, and scaling of crystallographic data.\nPerform crystal structure determinations by molecular replacement, using the pre-solved DDX21-AMP structure (PDB: 6L5M) (Chen et al., 2020[href=https://www.wicell.org#bib2]) as a searching model with PHASER (McCoy et al., 2007[href=https://www.wicell.org#bib10]), and one molecule was used to search for in the asymemetric unit.\nPerform structure refinement with REFMAC5 (Murshudov et al., 2011[href=https://www.wicell.org#bib12]) and PHENIX (Adams et al., 2010[href=https://www.wicell.org#bib1]).\nPerform iterative rounds of the model building using COOT (Emsley et al., 2010[href=https://www.wicell.org#bib3]).\nNote: The RNA was not part of the search during molecular replacement.\nDeposit data in Worldwide Protein Data Bank OneDep SYSTEM (https://deposit-2.wwpdb.org/deposition/[href=https://deposit-2.wwpdb.org/deposition/]).\nNote: Timing of crystallization and structure determination may vary depending on the protein and X-ray data quality."
  ],
  "subjectAreas": [
    "Protein Expression And Purification",
    "X-Ray Crystallography",
    "Structural Biology",
    "Molecular Biology",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}