{
  "id": 19136,
  "origin_website": "Jove",
  "title": "Assessing Teratogenic Changes in a Zebrafish Model of Fetal Alcohol Exposure",
  "procedures": [
    "1. Ethanol Treatment of Embryos\nZebrafish embryos derived from wild-type matings were raised at 28 °C in 5 ml of embryo water. (Milli-Q water with 60 mg/L Instant Ocean). Different strains of wild-type embryos have slightly different tolerances to ethanol exposure9.\nExposure to ethanol was initiated at dome stage (~4.3 hours post fertilization, hpf) for the desired length of time, up to a 24 hr pulse. This starting stage is roughly equivalent to the implantation stage of mammalian embryos, just prior to gastrulation. Ethanol concentrations used range from 0.2%-2.5%, volume/volume. Tests have demonstrated that between 25-50% of the solution in the water ends up in the developing embryo10, 11. Embryos are maintained at 28 °C for the desired length of time. After the desired length of ethanol exposure, the ethanol-water solution is removed and replaced with three washes of regular zebrafish water and maintained for the desired length of time. The specificity of the defect depends on the time of onset, the dose, and the length of the pulse of ethanol.\n2. Collection of Embryos for RNA, in situ Hybridization, Antibody, and Cartilage Staining\nTo collect mRNA for qPCR, age matched embryos are collected in eppendorf tubes. After removal of the zebrafish water, lysis buffer with TCEP is added. A motorized pulverizer is used to physically dissociate the embryos in the lysis solution. This is then passed through a preclear column, which removes any undissociated large pieces. The resulting solution contains all the macromolecules released by the lysis process. RNA is then extracted by running this solution on a column, followed by washes and DNAse treatment. Elution is then performed using either water or an elution solution provided by the manufacturer (5'-Prime). The RNA can be converted to cDNA using standard techniques for qPCR or used in microarray analysis.",
    "For in situ hybridization and antibody staining, embryos from 6 to 24 hpf were fixed in 4% paraformaldehyde overnight at 4 °C. This is followed by 3 washes in PBS + 0.1% Tween (PBT), to keep embryos from sticking together. Embryos are then transferred through a series of 3 methanol:PBT washes into 100% methanol, at which point they can be stored at -20 °C. These embryos can be used for in situ hybridization or antibody staining. Some antibodies do not work after methanol treatment, so this caveat needs to be taken into account and your specific antibody tested to determine if it will work after methanol treatment.\nFor cartilage staining, embryos need to be raised to 5 or 6 days post fertilization (dpf). They are then fixed in 4% paraformaldehyde overnight at 4 °C, followed by 3 washes in PBT.\n3. Assessing Ethanol-induced Gene Expression Changes and Developmental Consequences",
    "To determine what gene expression levels have changed, targeted genes are examined by both qPCR and in situ hybridization. qPCR is achieved using primers designed with Integrated DNA Technologies (IDT) software, then validated using 3 separate biological samples. Once primers have been validated, qPCR is performed on cDNA created from collected RNA samples. Each sample is run in triplicate. PCR reactions are run Platinum SYBR Green qPCR Super mix (Invitrogen) on a Chroma-4 PCR machine (BioRad) or similar PCR machine with a multicolor detection system. In addition to the genes being interrogated, it is critical that a control set of primers is used to balance small differences in cDNA or RNA preparation. For our zebrafish embryos, we use gapdh: 5'GAAGGTGGGAAACTGGTCAT3' and 5'TTGCACCACCCTTAATGTGA3'. Genes being analyzed are then normalized to gapdh levels an the relative quantification of gene expression is calculated using the Pfaffl method variation on 2-      Ct, displaying data as fold difference in experimental relative to wild type12. The normal calculation assumes that all genes are duplicating the DNA twice for every cycle, and thus expresses the data as a ratio of the change in the experimental gene over the change in the reference gene, expressed as power calculations over the integer \"2\", which is the efficiency of doubling of DNA per cycle seen in a perfect PCR reaction. The Pfaffl method replaces the generic \"2\" with the experimenter generated true efficiency for the PCR primers chosen. It reflects a more accurate reflection of the difference in the PCR reactions. The full formula is:\ntable:\n﻿0\n(Efficiency of experimental gene)(Ct of control sample-Ct of treated sample)\n-------------------------------------------------------------------------------------\n(Efficiency of reference gene)(Ct of control sample - Ct of treated sample)",
    "For in situ hybridization, digoxigenin (dig) -labeled riboprobes are constructed from plasmids containing portions of the gene of interest. Age-matched embryos are exposed to riboprobes using standard conditions13 and detected using anti-dig antibodies coupled to Alkaline phosphatase which allows the location of the labeled riboprobes using a color reaction (NBT/BCIP). Embryos are then visualized using a Leica dissecting microscope (Figure 1B-G).\nTo assess morphogenic development, embryos are collected at the desired time and examined under the dissecting microscope. For somite shape, live embryos are imaged 14. For inter ocular distance and body length, embryos are fixed in PFA. In all cases, images of the desired region are captured on a dissecting microscope at a fixed magnification and measurements taken using Adobe Photoshop software 10,14.\nTo examine the effects of treatment on the developing cartilage structures in the larval zebrafish, we use Alcian Blue staining. Fixed zebrafish larvae are treated with Alcian blue solution dissolved in 80% ethanol: 20% glacial acetic acid (acid alcohol) for several hours or overnight. Larvae are destained in several washes of acid alcohol before being transferred to a 1% KOH: 3% hydrogen peroxide solution for further clearing of pigment cells. Zebrafish need to be at least 4 days old to show cartilage structures, and these are better defined in fish that are 5 or 6 days old.\nCell death in living embryos is assessed using Acridine Orange (AO). AO is not cell permeable to living cells, and binds to DNA in cells with compromised membranes, including those undergoing apoptosis and necrosis. Living embryos are incubated with 5 mg/ml AO in PBS for 1 hour, followed by 3 washes in PBS. Embryos are then imaged using the confocal microscope. Digital Z-series images are combined to create composites.\n4. Manipulating the Zebrafish Embryo",
    "After identification of genes which are decreased by ethanol exposure, it is possible to try to replace them using injection of mRNA designed to replace the missing gene. Capped mRNA is transcribed from linearized DNA plasmids using RNA polymerase in vitro transcription kits, according to the manufacturers instructions (mMessage Machine, Applied Biosystems). Between 25-200 pg/nl of RNA is injected into 1-2 cell stage zebrafish eggs, in a solution of 0.1 M KCl. Embryos are then allowed to recover before being treated with ethanol as described above (Figure 5).\nFor any gene transcripts that are increased by ethanol exposure, they can be reduced, or \"knocked-down\" using an antisense morpholino technology. Antisense morpholinos (AMOs) are designed by the company Gene Tools, and block the translation of RNA into protein, or block the maturation and splicing of RNA, depending on the experimental need. This action of morpholinos limit the amount of active protein for the gene targeted, a deficit which can be measured using anitibodies if they are available. The efficiency of RNA splicing morpholinos can be measured using RT-PCR to detect the relative amounts of spliced and unspliced transcripts. Titrating of the morpholino can result in dose-dependent activity15. AMOs are diluted to working concentrations (titrated pg to ng concentration) in Danieau solution (58 mM NaCl, 0.7 mM KCl, 0.4 mM MgSO4, 0.6 mM Ca(NO3)2, 5 mM HEPES, pH 7.6). Injection takes place at the 1-2-cell stage, then the embryos are allowed to develop before being subjected to ethanol treatment as above.\n5. Representative Results",
    "Zebrafish embryo exposure to ethanol results in a number of developmental and genetic defects that are related to the phenotypes found in other vertebrates. We have documented abnormal development of axial tissues, including the notochord (data not shown14). The developmental delay produced by ethanol apparently leads to disruption of proper notochord elongation, leading to a shortened and occasionally disrupted notochord (data not shown14). This early delay and notochord defect likely leads in part to the later abnormalities in the somites (Figure 2), which have lost their strong chevron shape as seen in the untreated controls, and are closer to the u-shaped somites characteristic of phenotypes seen when sonic signaling is reduced14. The angle of the somites can be measured using standard software, and the angle increases from 92.1 ± 4.6° in the untreated controls to 122.6 ± 6.6° in the ethanol treated embryos (p < 0.001).\nAnother consequence of ethanol exposure that might be downstream of early developmental delay and later notochord defects is a shortened length of the embryo (Figure 3). Even measuring embryos to take into account the curvature produced by ethanol exposure, ethanol exposure leads to a shortened trunk that is dependent on the dose of ethanol the embryo was exposed to (Figure 3E14) . This finding is similar to the persistence of prepuberty short stature found in children exposed to ethanol during development16, 17, suggesting that the zebrafish model is relevant for the understanding of the human birth defect.",
    "One of the classic characteristics of FAS is a classic facies, including a reduced jaw, small eye opening, and a smooth philtrum. Much of these features are related to a reduction in the midline tissues. It has been demonstrated in animal models that severe ethanol exposure leads to even more pronounced phenotypes, including synopthalmia and cyclopia. When exposing zebrafish embryos to increased doses of ethanol, the intraocular distance (IOD) decreases in a dose dependent fashion (Figure 4) consistent with the nature of the human birth defect. Cyclopia is only found with very high doses, but lower doses do produce a significant reduction in the IOD (Figure 4), suggesting that this animal model has a similar defect in midline facial development10.",
    "In order to understand the mechanism underlying the defects in both the body and face produced by ethanol exposure, we sought to establish gene expression changes that occur early in development and that might reasonably be expected to contribute to later developmental defects. We do this in two ways, the extraction of mRNA from embryos allows for a quantitative evaluation of the levels of gene expression in ethanol treated embryos compared to controls (Figure 1A). In addition, we can perform in situ hybridization to look at the pattern of genes, regardless of whether or not the signal is decreased (Figure 1B-G18). In this example, two genes whose expression is decreased after exposure to ethanol are shown, gli1and six3b. When we examined the in situ pattern for six3b, we did find a reduction in the spatial extent of the expression of this gene (Figure 1 E-G) in embryos exposed to ethanol. A similar reduction was found in the gene gsc (Figure B-D). Both six3b and gsc are expressed in tissues destined to contribute to craniofacial midline tissues. So reduction of these genes at 8 hpf is consistent with the reduction in IOD found later as shown in Figure 4.",
    "Once genes that are affected by ethanol are identified, there are mechanisms by which the expression of them can be increased or decreased. In this particular example, we have shown 2 genes that are decreased (gli1 and six3b) by qPCR. We chose to inject mRNA to determine if reversing these gene changes can improve outcomes. For this experiment, instead of injecting gli1, we chose to inject shh, a ligand that increases gli1 levels. For six3b, we were able to inject six3b itself. We found no changes when we injected six3b (data not shown) but were able to fundamentally rescue the gross defects in zebrafish embryos with supplemental shh injections (Figure 5).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3704/3704fig1.jpg\nFigure 1.  Ethanol exposure changes the early pattern and gene expression levels of selected developmental genes. A) qPCR results for embryos at 8hpf. The results for two genes are displayed: six3b and  gli1. Results shown as average of three separate experiments, and the dose of ethanol shown is 2.5%. Both genes are reduced in a manner that is significant from control (t-test, p < 0.05). B-G) In situ hybridization of 8 hpf zebrafish embryos. Both gsc and six3b patterns are altered at this time point compared to controls. (Modified with permission from Loucks et al. 2007).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3704/3704fig2.jpg\nFigure 2.  Somite development is altered in treated embryos. Somite structure and angles are examined at 48 hpf. In control embryos (A), somites have a chevron shape and a sharp angle. Ethanol exposed zebrafish have more I- or U- shaped somites, and less sharp angles. (Modified with permission from Loucks and Ahlgren 2009).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3704/3704fig3.jpg",
    "Figure 3.  Ethanol treatment significantly decreases body length in zebrafish. The length of untreated and ethanol-exposed embryos were measured at 5 days postfertilization. A significant reduction in length was seen in all treated embryos (ANOVA, p < 0.001). B-D. There was a slight but significant reduction in the total length of embryos treated with 1.0% and 1.5% ethanol, whereas a greater reduction was seen in embryos dosed with 2.0% and 2.5% ethanol. E. To control for size differences in each clutch, the control embryos for each experiment were normalized to 100, and sibling treated embryos expressed as a percentage of 100. (Modified with permission from Loucks and Ahlgren 2009).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3704/3704fig4.jpg\nFigure 4.  Ethanol exposure results in a reduction in the intraocular distance (iod) in zebrafish embryos. A) frontal views of embryos demonstrate normal and fused eye phenotypes. B) Differing doses of ethanol administered for 3 hours during gastrulation results in decreased iod when fish are examined 24 hours later. Fused eyes and cyclopia are only seen at the highest dose tested (2.4%). * denotes a significant reduction in iod compared to controls. (modified with permission from Ahlgren, 2004).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3704/3704fig5.jpg\nFigure 5.  shh-NmRNA injection rescues the gross defects produced by ethanol exposure of zebrafish. One-two cell embryos were injected with 100 pg/nl shh-NmRNA and half of the injected embryos were exposed to the standard ethanol doses from 4.3 to 24 hpf. Embryos were analyzed at 5 dpf. Embryos treated with 2.0% ethanol exhibit dorsally curved shorter tails, I-shaped somites, and eye defects including cyclopia. Rescue of these phenotypes is seen in 71/76 of injected embryos (93%). In these embryos, the body is straight, the somites are chevron shaped, and the eyes are completely separated."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}