{
  "id": 3922,
  "origin_website": "Cell",
  "title": "Protocol for the derivation, culturing, and differentiation of human iPS-cell-derived neuroepithelial stem cells to study neural differentiation in vitro",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nNeural induction – derivation of NES cells from iPS cells\nThe following section describes how to culture iPSCs using laminin521 coating and E8 media, which is our preferential procedure.\nNote: Other culture methods for stable culture of iPSCs are available. Please refer to the appropriate protocols if you wish to pursue them.\nCulturing iPSCs\nTiming: 4 days\nCulture iPS cells until a sufficient cell number for the intended experiment is reached.\nSeed 17 500 – 25 000 cells/cm2 iPS cells (see Table 8[href=https://www.wicell.org#tbl8]) in a plate coated with laminin521.\ntable:files/protocols_protocol_645_8.csv\nCulture iPS cells in complete E8 media containing the E8 supplement (1:50) and P/S (1:100). Split the cells once they reached 80% confluency (after 3–4 days).\nChange the media every day.\nAdd 1:1000 ROCK inhibitor to the media after every splitting and thawing.\nCritical: Do not warm up the media for more than 15 min at 37°C, but rather keep them outside of the fridge until they reached 21°C and then quickly warm them up in a water bath before using.\nCritical: All the steps must be performed under sterile conditions.\nCritical: An appropriate cell density is crucial for a successful induction. Use the recommended cell numbers for seeding (see Table 8[href=https://www.wicell.org#tbl8]).\nNeural induction\nTiming: 12 days\nPrepare KOSR media and N2B27 media according to Tables 3[href=https://www.wicell.org#tbl3] and 4[href=https://www.wicell.org#tbl4], respectively.\nDay 0\nSplit the iPS cells and seed according to the number of cells in 2-3 wells of your culture dish of choice.\nPlate the cells in an appropriate volume of complete Essential 8 media (E8 incl. P/S and E8 supplement).\nAdd ROCK inhibitor 1:1000 to the media.\nDay 1\nStart of neural induction\nWarm an appropriate volume of KOSR media to 37°C.",
    "Prepare the complete KOSR media by adding the factors according to Table 3[href=https://www.wicell.org#tbl3].\nChange the media in all wells to KOSR media, according to Table 9[href=https://www.wicell.org#tbl9].\ntable:files/protocols_protocol_645_9.csv\nDay 2–4\nChange the media daily as stated above (see Table 9[href=https://www.wicell.org#tbl9]).\nDay 4\nCoat double the number of wells used before in a fresh culture dish of the same size with laminin521. Keep refrigerated for ≥ 12 h at 4°C.\nDay 5\nSplit cells to a fresh plate\nPrepare an appropriate volume (see Table 1[href=https://www.wicell.org#tbl1]) of KOSR/N2B27 media (see Tables 3[href=https://www.wicell.org#tbl3], 4[href=https://www.wicell.org#tbl4], and 9[href=https://www.wicell.org#tbl9]). Prepare 3 mL extra.\nWash the cells once with PBS. Ensure that all PBS is removed after washing.\nAdd 500 μL of TrypLE Express (500 μL are sufficient for culture dishes up to T25) to each well.\nIncubate at 37°C for maximum 3 min. Rounding and detachment of the cells from the culture surface can be confirmed under a standard light microscope.\nMeanwhile, prepare a sterile 15 mL tube with an equal volume of KOSR media to TrypLE used.\nTransfer the detached cells from the culture dish to the 15 mL tube with KOSR media.\nCentrifuge for 3 min at 300 g.\nCarefully aspirate the media without touching the pellet.\nResuspend the cell pellet in 1–2 mL KOSR/N2B27 media and count the cells.\nSeed the cells with a density of 2–2.85 × 105 cells/cm2 and according to Table 8[href=https://www.wicell.org#tbl8].\nAdd ROCK inhibitor 1:1000 to the media.\nDay 6-Day 11\nChange the media every day according to media composition in Table 9[href=https://www.wicell.org#tbl9].\nDay 11\nCoat the necessary plates following NES cell culture section + additional laminin521 for splitting at day 12. Prepare the same type of plate as currently used for the cells. i.e., 12-well plate.\nDilute an appropriate volume of poly-L-Ornithine 1:500 in PBS, according to Table 1[href=https://www.wicell.org#tbl1].",
    "Incubate for at least 2 h at 37°C.\nRemove the Poly-L-Ornithine and wash each well with the volume of PBS stated in Table 1[href=https://www.wicell.org#tbl1].\nDilute mouse laminin for a final concentration of 4 μg/mL and laminin521 for 5 μg/mL in PBS (see Table 2[href=https://www.wicell.org#tbl2] for working concentrations).\nAdd an appropriate volume (see Table 1[href=https://www.wicell.org#tbl1]) of the diluted laminin solution to each well.\nWrap the edges in parafilm and incubate for ≥ 12 h at +4°C.\nDay 12\nRemove the media and wash the cells with PBS.\nRemove the PBS and add 500 μL of TrypLE to each well.\nIncubate at 37°C for 2–3 min.\nTransfer the detached cells from the wells into a tube with the same volume of NES media as the volume of TrypLE.\nSpin for 3 min at 300 g.\nAspirate the supernatant carefully and without touching the cell pellet.\nResuspend the cells in 1 mL of NES growth medium (Table 5[href=https://www.wicell.org#tbl5]) and count the cells.\nPlate 1 ∗106 cells per well (12 well plate) in a Poly-L-Ornithine- and laminin (mouse laminin and laminin521) coated 12 well plate.\nAdd ROCK inhibitor 1:1000.\nCritical: Prepare the media as stated in Tables 3[href=https://www.wicell.org#tbl3] and 4[href=https://www.wicell.org#tbl4]. Add all factors (see Table 2[href=https://www.wicell.org#tbl2]) fresh every day.\nCritical: It is essential to pre-warm plastic dishes, TrypLE select, and media to 37°C prior to working with NES cells. For NES growth medium the pre-incubation in a water bath should not exceed 15 min to avoid the degradation or inactivation of included factors.\nEstablishment of NES cells\nTiming: 6 days until the first splitting, after that 3–4 days until the next passage (new NES cell line established after 6 passages)\nSee “before you begin” for required stock solutions and media\nDay 1–3",
    "Wash the newly established NES cells with PBS before changing the media for the first three days after neural induction.\nExchange the media daily with fresh NES growth media (see Table 5[href=https://www.wicell.org#tbl5]). See Table 1[href=https://www.wicell.org#tbl1] for details about the suggested medium volumes.\nDay 4–5\nChange the media every day to fresh NES growth media (see Table 5[href=https://www.wicell.org#tbl5] for media composition and Table 1[href=https://www.wicell.org#tbl1] for medium volumes).\nDay 6 and after the first passage\nSplit the cells when they reached a confluency of 100%.\nAdd ROCK inhibitor 1:1000 for this passage.\nSeed the cells onto normal NES cell plates (Poly-L-Ornithine and mouse laminin) (see section “Before You Begin” above.)\nPassage the cells 1:2 for 5 passages. After this the cells should be seeded with a density of 4 × 104 cells/cm2 and without adding ROCK inhibitor to the media.\nExchange the media daily with fresh NES growth media (see Table 5[href=https://www.wicell.org#tbl5] for medium composition and Table 1[href=https://www.wicell.org#tbl1] for suggested volumes).\nMonitor the newly established cell lines for the formation of typical NES cell clusters in order to confirm the establishment of NES cells. NES cells will form small rosettes and express NES cell markers, such as NESTIN and SOX2 (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/645-Fig1.jpg\nFigure 1. NES cell characteristics\n(A). Representative bright-field image of a healthy control NES cell line after 7 passages growing in the typical rosette shapes. Scale bar: 200 μm.\n(B). Immunofluorescence analysis of an established healthy control NES cell line expressing the neural stem cell makers SOX2 (green) and NESTIN (red). Cell nuclei are shown in blue. Scale bar: 100 μm.\nFreeze several aliquots of the newly established NES cell line. For cryopreservation see the section below.",
    "Critical: The right cell density is an important factor for the successful establishment of NES cells. Use the recommended cell numbers for seeding and splitting.\nNES cell culture\nThawing of NES cells\nTiming: 30 min\nFrozen aliquots of NES cells should be rapidly thawed in a 37°C water bath for not longer than 30 seconds.\nAdd 0.5 mL of warm wash medium dropwise to the vial the cells are in.\nTransfer the thawed NES cells to a fresh 15 mL sterile tube and add wash medium 5× the volume (see Table 1[href=https://www.wicell.org#tbl1]).\nCentrifuge the cell suspension for 3 min at 300 g and carefully remove the supernatant by pipetting or aspiration.\nCarefully resuspend the cells in 1 mL of wash media and count them.\nCalculate how many cells to seed according to the used cell culture plate (see Table 10[href=https://www.wicell.org#tbl10]). Increase the cell number slightly for this step.\ntable:files/protocols_protocol_645_10.csv\nAdd an appropriate volume for the planned culture plate of NES growth medium according to Table 1[href=https://www.wicell.org#tbl1].\nRemove the laminin solution from the warm tissue culture plates by aspiration and rapidly seed the cells with an appropriate volume of NES growth medium.\nReplace the NES cell growth medium daily to ensure successful culturing and proliferation.\nCritical: Always pay attention to all washing steps to remove all residues of DMSO.\nCritical: Warm the plastic dishes and media before usage. Do not warm complete media in the water bath for more than 15 min.\nCritical: Increase the number of cells per well after thawing.\nMaintenance of NES cells\nTiming: daily feeding: 30 min; 3–5 days until next splitting\nReplace the NES growth medium daily.\nSplit the cells once they reached 100% confluency. This can take between 3–5 days, depending on the seeding density and the cell line.",
    "The stated cell numbers in Table 10[href=https://www.wicell.org#tbl10] are suitable for normal NES cell expansion. For experimental set-ups like immunocytochemistry or electrophysiological recordings cell numbers must be adapted according to the needed cell density. The recommended cell density for NES cell maintenance is 4 × 104 cells/cm2.\nSplitting of NES cells\nTiming: 30 min–1 h\nRemove all NES growth medium from the culture dish by slightly tilting the plate to one side. Add an appropriate volume of pre-warmed TrypLE select for 2–3 min to the cells.\nAfter incubation gently pipette the cell suspension to detach the remaining cells. If cells remain attached, a slight tapping to the side of the plates or an additional incubation for 1 min at 37°C can be performed.\nTransfer the cell suspension to a new 15 mL tube containing 5× the volume of wash media and centrifuge for 3 min at 300 g.\nCarefully remove the supernatant by pipetting, aspiration, or decanting, and resuspend the cell pellet in 5 volumes of wash medium (see Table 11[href=https://www.wicell.org#tbl11]).\ntable:files/protocols_protocol_645_11.csv\nCentrifuge the cells for 3 min at 300 g.\nCount the cells.\nRemove the wash medium as above and carefully resuspend the cells in NES growth medium before seeding the cells at an appropriate concentration on coated plates (Table 10[href=https://www.wicell.org#tbl10]).\nAspirate the mouse laminin dilution from the wells before adding the cells.\nCritical: Excessive pipetting of NES cells and the formation of bubbles should be avoided at all costs. Direct pipetting onto the cell layer should be avoided as much as possible. Similarly, smooth pipetting, when resuspending cell pellets, is advised to prevent cell breakage.\nCritical: Do not extend trypsinization for longer than three minutes. Excessive trypsinization can cause cell breakage. Disregard residual undetached cells after maximum incubation and proceed with the addition of the trypsin inhibitor medium.",
    "Critical: Splitting of confluent NES cell cultures should not exceed a ratio 1:3. Increased dilution ratios can induce neuronal differentiation, repression of the cellular division program and cell death. On the contrary, smaller dilution ratios, such as 1:2, are possible and will stimulate cell division.\nCritical: It is essential to pre-warm plastic dishes, TrypLE select and all medias to 37°C 30 min prior to working with NES cells. For NES growth medium the incubation in a water bath should not exceed 15 min to avoid degradation or inactivation of included factors.\nCritical: For NES cell maintenance carefully remove old medium and replace with fresh. Do not add medium directly onto the cells but rather pipet it carefully along the inside of the plate wall.\nCryopreservation of NES cells\nTiming: 30 min\nNES cells can be cryopreserved in NES growth medium, supplemented with 10% DMSO (NES freezing medium). Avoid using serum from animal origin. NES cells should be frozen slowly in appropriate freezing containers at −80°C and transferred to the vaporous phase of a liquid nitrogen tank or equivalent 24 h after freezing.\nFollow the guidelines for splitting of NES cells, but instead of a final resuspension in NES cell growth medium, resuspend the cell pellet in NES freezing medium in a concentration ranging from 2–5 x106 cells/mL and transfer to a cryotube.\nCritical: Freeze NES cells at concentrations between 2–5 x106 cells/mL.\nCritical: Storage of frozen cells longer than 24h at −80°C can compromise cell viability.\nCritical: Work as quick as possible when freezing and thawing the cells so they are not exposed to the cryo media for longer periods of time.\nCritical: Always pay attention to all washing steps to remove all residues of TrypLE select or DMSO.",
    "Critical: Should the storage tank, i.e., a liquid nitrogen tank, be not near the water bath, we recommend transport on dry ice.\nNeural differentiation of NES cells\nTiming: 30 min/day; culture between 14 days-several months\nChange the medium for at least 14 days for a completely developed neuronal morphology. At least 45 days for a mixed culture of neurons and glia. Differentiated cells can be cultures for at least 2 months.\nIn order to induce neuronal differentiation NES growth medium is modified by removing growth factors bFGF and EGF and increasing B27 concentration 10 times (Falk et al., 2012[href=https://www.wicell.org#bib2]; Koch et al., 2009[href=https://www.wicell.org#bib3]). We assigned the name of NES differentiation medium to this medium (see Table 6[href=https://www.wicell.org#tbl6]). As it was indicated above for NES cell culture section, it is also necessary to pre-warm NES differentiation medium.\nDay 0\nCulture NES cells according to the above guidelines.\nSeed NES cells in NES growth media with a density of 40 000 cells/cm2.\nDay 1\nRemove NES growth medium by slightly tilting the culture plate and replace it with an equal volume of NES differentiation medium (see Table 1[href=https://www.wicell.org#tbl1]).\nDay 2–7\nReplace half of NES differentiation medium every other day without tilting the plate.\nDay 7 until intended day of differentiation\nCarefully replace half of NES differentiation medium every other day.\nAdd mouse laminin (1:500) to the media for every feeding\nCritical: Do not induce neuronal differentiation right after NES cells thawing. Culture the cells for at least 24h in NES medium before changing the medium to differentiation medium.",
    "Critical: NES cells under differentiation and eventually neurons only loosely attach to the growth surface. We therefore recommend being extra careful when handling plates, i.e., while moving plates in and out of the incubator or changing medium. Additionally, we recommend using a p1000 pipette for the removal of media, instead of aspiration with a vacuum pump.\nCritical: Doubling the amount of NES differentiation medium after two weeks of differentiation can be beneficial.\nCritical: To document neuronal differentiation morphology, bright-field imaging represents an informative and quick procedure (Figure 1[href=https://www.wicell.org#fig1]). Differentiating cells should not be removed from the incubator for extended periods of time and we therefore recommend placing cell incubator, cell hoods, and microscope close to one another to minimize neurons detachment during transport.\nCritical: We recommend supplementing the culture plate with fresh mouse laminin (1:500 final concentration) for every feeding during differentiation starting from day 7 to prevent detachment of the neurons.\nModulation of neuronal differentiation through redox homeostasis\nTiming: 1 h\nThe growth conditions mentioned above are sufficient for NES cell culturing and differentiation. One should be aware that redox homeostasis is tightly coupled to stem cell differentiation and function (Li et al., 2019[href=https://www.wicell.org#bib4] and Nugud et al., 2018[href=https://www.wicell.org#bib5]). We here present consequences on NES cell differentiation, when antioxidant levels differ from those recommended in the standard NES differentiation medium mentioned above.\nThe following protocol compares differentiation potential using standard B27 (as above) or B27 minus antioxidants (B27-MA) in the NES cell differentiation medium in the presence or absence of the antioxidant N-Acetyl-L-cysteine (NAC). B27-MA is lacking antioxidant power: vitamin E, vitamin E acetate, superoxide dismutase, catalase, and glutathione. Thus, we can study how the lack of antioxidant supplementation in the medium is affecting neuronal differentiation.",
    "Follow NES cells establishment guidelines for correct storage of factors and medium. B27-MA is stored and aliquoted as B27.\nPrepare NES differentiation medium with B27 or B27-MA (see Table 7[href=https://www.wicell.org#tbl7]).\nPrepare 6 wells to evaluate the effect of antioxidants on neuronal differentiation:\nB27 no NAC\nB27 + 0.5 mM NAC\nB27 + 2.5 mM NAC\nB27-MA no NAC\nB27-MA + 0.5 mM NAC\nB27-MA + 2.5 mM NAC\nTiming: 30 min\nCulture for at least 14 days for a completely developed neuronal morphology.\nDay 1\nPlate the cells as mentioned in the NES cell differentiation part. Remove NES growth medium 24 h after seeding of the cells by slightly tilting the culture plate and replace it with an equal volume of the 6 different NES differentiation mediums mentioned above.\nDay 2–14\nReplace half of NES differentiation medium every day.\nAdd mouse laminin to the media every time the media gets changed.\nCritical: This experiment needs daily attention and documentation since cells are extremely sensitive to a deregulation in ROS levels and can quickly die.\nCritical: As in the normal differentiation handling of the plates and adding media must be performed carefully. Add fresh media to the side of the plate wall as slow as possible.\nCritical: Remove the media carefully when changing the media.\nNucleofection of NES cells\nTiming: 1 h\nWe noticed extensive NES cell death after transfecting NES cells with Lipofectamine 3000 (Thermo Fisher Scientific) and therefore explored nucleofection as transfection method.\nCollect 2.5 × 105 NES cells for one well in a 16-strip and 2 × 106 for one cuvette according to NES cell culture protocol above but pellet cells by slow centrifugation at 80 g for 10 min.",
    "Resuspend cells in 20 μL of pre-warmed P3 buffer for one strip well and 100 μL for one cuvette.\nAdd 0.6 μg and 5 μg of the desired DNA for the strips and cuvettes, respectively.\nTransfer the NES cells-DNA mix into the strip or the cuvette.\nPlace the strips or cuvette into the nucleofector and run program DC100 (this is the most efficient program to nucleofect NES cells).\nAfter nucleofection let the cells recover for 10 min at 21°C to reduce cell death. Gently transfer the transformed cells to NES growth medium and seed them in a coated 24 multi-well plate (strip) or T25 flask (cuvette). Add ROCK inhibitor (1:1000) for better survival of the cells.\nAfter 24 h, change medium according to NES cell culture conditions (see Table 1[href=https://www.wicell.org#tbl1] (volume) and Table 5[href=https://www.wicell.org#tbl5] (media composition)).\nFor stable line generation, antibiotics can be incorporated into the medium after 48 h. For transient experiments the peak of expression is reached at 48–72 h.\nCritical: Avoid making bubbles when placing cells in the strip or the cuvette.\nCritical: For stable cell lines generation, the antibiotic selection should be added after 48–72 h.\nCritical: Make sure to never culture NES cells in densities lower than stated in the above sections."
  ],
  "subjectAreas": [
    "Cell Differentiation",
    "Neuroscience",
    "Stem Cells"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}