{
  "id": 8799,
  "origin_website": "Jove",
  "title": "Establishing Mouse Models for Zika Virus-induced Neurological Disorders Using Intracerebral Injection Strategies: Embryonic, Neonatal, and Adult",
  "procedures": [
    "All animal use protocols follow the animal care guidelines of the University of Southern California and the University of Georgia. Euthanasia methods for pregnant dams and adults are performed according to approved protocols: carbon dioxide asphyxiation, followed by cervical dislocation as a secondary method to ensure euthanasia. Neonatal pups are euthanized by decapitation.\nCaution: The following protocol involves handling a pathogenic virus. Proper precaution should be taken while handling the virus. All protocols must be approved by the appropriate institutional committee prior to use.\n1. Embryonic Intracerebral Inoculation of Zika Virus\nFor timed pregnant mating, consider noon of the day after mating as E0.5. Pair mice at the end of the day and check plugs in the early morning to reduce variability of mating time.\nPrepare the glass needle prior to surgery. Pull the needle and cut at 1/3 its length, then sharpen at a 45° angle using a micropipette grinder with a water drip until the pore is sized to 50 - 70 µm. Check needle tips under a stereoscope for quality and breakage.\nKeep the virus aliquot on ice. Just prior to surgery, load the ZIKV injection mix into the prepared glass injection needle. Assemble the gas-tight injection syringe (50 µL volume), luer-lock attachment, and tubing, and saturate the assembled syringe with the tubing with mineral oil. Once saturated, attach the needle, and draw ~ 6 - 7 µL ZIKV into the needle (~ 1 µL is 1.7 × 106 TCID50/mL).",
    "Inject pregnant C57BL/6J or 129S1/SvImJ mice with embryonic day E14.5 embryos (for intracranial injection) or E10.5 embryos (for intrauterine injection) with ketamine hydrochloride (80-100 mg/kg) and xylazine (5-10 mg/kg) diluted in sterile saline solution intraperitoneally to induce anesthesia in the mother. Alternatively, anesthetize mothers with monitored isoflurane isoflurane provided by inhalation, with waste gas scavenging, if appropriate. Inject buprenorphine-SR (0.5-1.0mg/kg) subcutaneously to induce analgesia.\nPinch test anesthetized mothers on the toe tip or tail and then lay them supine on an animal-approved heating pad (thermal pad of 100 x 200 2.5 mm). The toe pinch forceps are not sterile and are not used to handle tissue in surgery. Alternatively, gloved hands may be used to test the toe pinch withdrawal reflex.\n\tNOTE: Refer to your institutional veterinary staff for the preferred perioperative heating method. A cover was placed between this heating pad and the animal.\nAdd ophthalmic ointment to the eyes.\nShave the surface of the abdomen and sterilize with iodine and alcohol three times. Alternate the iodine and alcohol wipes; wipe in a circular motion away from the surgical site.\nDrape the skin surrounding the surgical site with sterile cloths to avoid contamination of the incision and the instruments.\n\tNOTE: The drape opening should not be larger than the prepared surgical site; no hair should be seen in the drape opening.\nPinch the mother's skin away from her abdomen with forceps and cut the lower abdomen in a 1 - 1.5 cm line at the medial sagittal line with sterile surgical scissors. This cuts into the skin and further into the abdominal cavity so that the embryos are now exposed.\n\tNOTE: Surgical scissors are used to incise the skin and peritoneal layer. Sterile instruments and gloves are used for each surgery.",
    "Cut a slit in the middle of a small sterile gauze and apply on top of the surgical opening. Hydrate with sterile saline. Pull the embryos through the slit to rest on the sterile gauze, with care to not remove more than 4 - 5 embryos focusing on one uterine horn at one time.\nHydrate the embryos with sterile saline prior to and throughout the inoculation to ensure they do not dry out. Keep track of which embryos are injected and their location within the uterine horn. Individual embryos are thus treated as separate experiments, as embryos do not change position while developing in utero. (Continue to step 1.15 for intrauterine injection).\nGently place a spatula under the head of the embryo. Illuminate the embryos well with a lamp to visualize the head and skull sutures.\n\tNOTE: Aseptic technique is followed, including sterile surgical gloves and instruments. After non-sterile items (such as the lamp) are manipulated, gloves should be replaced with new sterile gloves prior to handling sterile instruments and areas.\nPosition the head by manipulating the embryo with both the lamp (behind the head for visibility) and free fingers until the head of the embryo is pushed up directly against the uterine wall and held in place with the non-dominant hand.\n\tNOTE: Positioning the embryo is a critical part and the technique that takes the most practice. Too much finger pressure can damage the embryonic membranes leading to lethality and not enough pressure can make the injection difficult.\nUse the blood vessels running along the skull suture as a guide. Inject ZIKV virus (~ 1 µL, 1.7 × 106 TCID50/mL Mexican isolate MEX1-44) into the lateral ventricles of E14.5 embryo brains with the assembled syringe and needle. Use control media as a sham injection.",
    "To improve retention of the pregnancy, avoid viral injection of the two embryos next to the ovaries and the two embryos next to the upper vagina (Figure 1A). Overall, no more than 6 embryos are injected per litter to reduce the time of the surgery and prevent embryo loss.\nPlace the injected embryos back into the pregnant dams, and fill the abdominal cavity with ~ 0.5 mL sterile saline. To close, first suture both the abdominal peritoneal muscle and then secondly suture the external skin layer with 4.0 sterile sutures. It is preferable to use interrupted sutures; there is possibility of wound dehiscence if the mouse chews the suture.\nPlace the mouse in a cage partially resting on a heating pad to allow the mouse to escape to a non-heated area if needed. Monitor the mothers while they recover (1 - 2 h) from anesthesia. Develop the embryos after surgery for varied times according to individual experiments.\nIntrauterine injection\nWith one uterine horn and embryos exposed, use a 1 mL syringe and 27G needle to inject 100 μL Zika virus (106 TCID50 units suspended in 100 μL DMEM), or control medium, into the intrauterine space or into the placental tissue. Note which embryos have been injected for embryonic-stage dissections. See previously published work for more details18.\nPlace injected embryos back into the pregnant dams, and fill the abdominal cavity with ~ 0.5 mL sterile saline. To close, first suture the abdominal peritoneal muscle and then secondly suture the external skin layer with 4.0 sterile sutures. It is preferable to use interrupted sutures; there is possibility of wound dehiscence if the mouse chews the suture.",
    "Place the mouse in a cage partially resting on a heating pad to allow the mouse to escape to a non-heated area if needed. Monitor the mothers while they recover (1 - 2 h) from anesthesia. Develop the embryos after surgery for varied times according to individual experiments.\n2. Neonatal Intracerebral Inoculation of Zika Virus: P0/P1\nEnsure that the gas-tight injection syringes (10 µL volume) and needles are not clogged. Clean and test by loading three 20 mL disposable syringes with 26-gauge needles: one with saline, one with 70% ethanol, and one with air to clear the solutions. Sterilize with 10% bleach if previously used for virus injection.\nKeep virus on ice. Load the syringe by filling it with saline to reduce dead volume in the syringe, and draw 0.75 µL of air to separate the saline solution from the injection material.\nSet up a warmed humidified recovery chamber for injected pups. Using a heating block, place a closeable container (such as an empty tip box) with a sterile gauze and humidify with saline. Preheat it prior to starting injections.\nSet up the microinjector including the pump and the controller. Determine the device type code for the specific syringe (i.e., for a 10 µL syringe, the device type is \"D\"). Determine the speed of injection.\nCollect the postnatal day 0 or 1 pups (P0/P1) near the surgical setup. Load the injection syringe with virus. Disinfect the pup head mount with 70% EtOH.\nWrap the pups in a thin layer of gauze and bury them completely in ice to achieve an anesthetic state. Pups are cryoanesthetized for 5 min. Ensure that the pups are sufficiently anesthetized for injection by performing a tail/toe pinch without response. This roughly yields 15 min of an anesthetic state.",
    "Place the pup on head mount, sterilize the surface of the head with iodine and, ethanol (three times) and then wipe dry with a sterile wipe (isopropanol or 70% EtOH).\nMark lambda with a black marker and record the coordinates at lambda using the stereotaxic instrument. Measure the distance from lambda to the edge of the eye and beginning from the stereotaxic coordinates of lambda calculate the 2/5 distance from lambda to the eye (for both hemispheres if you are injecting both).\nRe-check the anesthetic depth prior to creating a hole for the injection site. Use a 26-gauge needle to carefully and superficially puncture the scalp and skull at the injection location (the skull is very soft in neonates) to create an opening for the injection needle.\nLower the injection needle into the punctured location, and once the needle has just breached the skin, calculate a 1 mm depth for the injection site (lateral ventricle) using the stereotaxic instrument.\nOnce the needle is lowered to the injection depth, program the microinjector to inject: 1 µL of virus, at a rate of 10 nL/s, injecting approximately 1 µL over 1.5 min (~ 1 μl 3.4 x 105 TCID50/mL ZIKV).\nWhen the injection finishes, wait 30 s, and retract the needle in 0.5 mm increments by rotating the screw (dorsally), waiting 30 s after each increment.\n\tNOTE: This reduces leakage of injected virus.\nOnce removed, either quickly load the needle and syringe with more virus (different viruses or mock controls should be loaded into separate syringes/needles) or remove the pup from the head mount to the pre-warmed humidified chamber. Monitor the pup every few minutes to gauge recovery. Replace the pups with its litter.\n3. Adult Intracerebral Inoculation of Zika Virus",
    "Inject adult mice intraperitoneally with ketamine hydrochloride (80-100 mg/kg) and xylazine (5-10 mg/kg) diluted in sterile saline to induce anesthesia. Inject buprenorphine-SR (0.5-1.0mg/kg) subcutaneously to induce analgesia. Toe/tail pinch the mouse to ensure its anesthetic state, and subsequently mount it on the stereotaxic instrument (with a heating pad) to immobilize the head during surgery. \nAdd ophthalmic ointment to the eyes to prevent the eyes of the mouse from drying out during surgery. Shave the scalp starting behind the eyes to the beginning of the ears. Sterilize the exposed skin with iodine and 70% EtOH three times. Alternate the iodine and alcohol wipes; wipe in a circular motion away from the surgical site.\nRe-check the anesthetic depth prior to incising the skin. Using a scalpel, make a 0.5 cm incision along the medial sagittal line of the head in the sterilized location, exposing bregma. Using a rolling motion with a cotton-tipped applicator, clear the surface of the skull of meningeal tissues, while simultaneously pushing the skin away from the injection sites.\nStarting from bregma, align the surgical drill bit and identify the injection sites using the following coordinates: AP -0.5 mm, ML: +/-1.5 mm. Using the control foot pedal, drill into skull slowly as to only drill bone until a hole has been cleared for the needle.\nReplace the drill with the microinjector pump and gas-tight syringe (10 µL volume) on the stereotaxic. Leaving a small air bubble between the saline solution and the virus, draw ~ 4-5 µL of virus. Determine the device type code for the specific syringe volume (ie, D for 10 μL volume syringe). Lower the needle to DV: -1.5 mm from the brain surface. To inject 1 µL of virus, program a rate of 10 nL/s, injecting approximately 1 µL over 1.5 min.",
    "When the injection finishes, wait 30 s, and remove the needle in 0.5 mm increments, waiting 30 s after each turn. This reduces backflow and leakage of the injected virus.\nWhen the injection(s) are finished, use forceps to loosen the skin and recover the exposed skull. Suture the scalp back together using 4.0 sutures and remove the mouse from the stereotaxic instrument. Place the mouse in a cage partially resting on a heating pad to allow the mouse to escape to a non-heated area if needed and monitor while they recover (1 - 2 h) from anesthesia.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}