{
  "id": 13476,
  "origin_website": "Jove",
  "title": "Dissection and Coronal Slice Preparation of Developing Mouse Pituitary Gland",
  "procedures": [
    "C57BL/6 mice are bred in specific pathogen-free conditions. All animal experimental methods are in compliance with the guidelines approved by the Animal Care and Ethics Committee at Second Military Medical University.\n1. Dissection of Postnatal Developing Pituitary Gland\nPerform anesthesia: Place neonatal mice (P0 - P5) on crushed ice to induce hypothermia. For mice older than 5 days of age, inject 5% urethane (30 µL/g of body weight) intraperitoneally to induce anesthesia. Assess responses to tail/toe pinches. Proceed only after the mouse is unresponsive to the noxious stimuli.\nSecure the mouse in the supine position (lying on the back with face upward) by gently taping the forepaws and hindpaws to a work surface that is capable of being pinned (i.e., Styrofoam) inside a chemical fume hood.\nPerform transcardial perfusion.\nCut the mouse ribcage with surgical scissors to expose the heart (and other thoracic organs).\nSecure the beating heart with blunt forceps and insert a 26G (0.45 mm) needle into the left ventricle. The needle is attached to a 10 mL syringe filled with heparinized phosphate buffered saline (PBS; supplemented with 5 mg/mL sodium nitrite and 10 U/mL heparin, pH 7.4, warm to 37 °C before use). Immediately cut the right atrium with fine scissors and begin to perfuse the body with the warm PBS until the fluid exiting the right atrium is clear.\n\t\tNOTE: Approximate 5 - 10 mL PBS is needed for neonatal mice and 10 - 20 mL PBS for adult mice.\nKeep the needle in place and change to another syringe filled with 4% paraformaldehyde (PFA; pH 7.4). Perfuse 10 mL and 20 mL of fixative for neonatal and P21 mouse, respectively.\n\t\tCaution: PFA is toxic. It may cause skin and respiratory irritations, and eye damage. Wear gloves and work under a chemical hood.",
    "Decapitate the PFA-fixed mouse and cut the skull bone open with scissors.\nGently lift the hindbrain from the base of the skull with small forceps. At the first sign of the sella turcica, stop lifting but hold the hindbrain, cut the pituitary stalk and nerve fibers connecting to the base of the brain with fine scissors. This step is critical to ensure that the pituitary is not lifted away with the brain.\nThen keep lifting the brain and remove the whole brain to expose the pituitary gland fully. Cut the entire sella region including the pituitary gland, lateral trigeminal nerves, and the beneath sphenoid bone with scissors (approximately 3 x 5 mm2).\nPut the dissected tissue into a 35 mm dish or one well of a 6-well plate containing 2 mL cold 4% PFA (pH 7.4). Fix the tissue at 4 °C for 40 min for P0 - P7 pituitaries, 1 h for P14 pituitaries, 1.5 h for P21 - P28 pituitaries, and 3 h for adult pituitaries.\nFurther dissociation of pituitary\nWash the fixed tissue with 10 mL PBS, 5 changes, 15 min each. The neonatal pituitary gland together with its surrounding tissues and the beneath sphenoid bone can be processed directly to dehydration. However, pituitary glands from mice older than 5 days should be dissociated further under a stereo microscope.\nPut the fixed tissue into a 35 mm dish containing 1 mL PBS. For P5 - P14 pituitaries, remove the connective membranes between the nerves and the bone with fine forceps and scissors, and carefully isolate the pituitary gland together with lateral trigeminal nerves as a whole but leaving the sella turcica.The isolated gland and nerves are connected by connective membranes with a \"H\"-like appearance (Figure 1B).",
    "For P21 and adult pituitaries, remove the nerves and connective membranes around the pituitary and free the gland from the surrounding tissues. Wrap the pituitary tissue with lens cleaning tissue paper and put it into an embedding cassette.\n\t\tNOTE: Wrapping the tiny pituitary with lens cleaning tissue paper helps to prevent any potential loss of specimens and preserve tissue integrity in the following paraffin-embedding procedure. It may not be necessary to wrap the pituitary if it is processed in a small bottle in the cryo-embedding procedure.\n2. Paraffin Embedding and Sectioning\nDehydrate the specimens in embedding cassettes with 50%, 65%, 75%, and 95% ethanol solutions for 15 min each. Subsequently dehydrate with 3 changes of pure ethanol, 3 min each for P0 - P4 glands, 4 min each for P5 - P14 glands, and 5 min each for P21 and older glands. Clear with xylene, 3 changes, 3 min each for P0 - P4 glands, 4 min each for P5 - P14 glands, and 5 min each for P21 and older glands. Infiltrate with molten paraffin wax, 3 changes, 7 min each for P0 - P4 glands, and 8 min twice followed by 6 min once for P5 and older glands.\n\tNOTE: The optimal parameters for tissue processing can be empirically adjusted. To obtain high quality sections, insufficient or over dehydration should be avoided. The same is true for clearing the tissue using xylene.\nOrientation when embedding\nOn a tissue embedding console system, remove the specimen from the cassette and place it into a base mold half-filled with molten paraffin wax. Proper orientation of the embedding pituitary gland is essential for satisfying coronal sections.",
    "For P21 and adult pituitary glands, position the pituitary gland with its short axis perpendicular to the bottom surface of a base mold (the section plane). Use sphenoid bones and trigeminal nerves as anatomic landmarks for P0 - P4 and P5 - P14 pituitaries, respectively. Orient specimens with their trigeminal nerves or transversal lamina of sphenoid bones perpendicular to the bottom surface of a base mold.\nGently hold the tissue in the desired position with warmed fine forceps until the wax becomes semi-solid on a cooling plate. Top up the mold with molten paraffin wax. Allow the paraffin block to cool until the wax is fully solidified.\n\t\tNOTE: The pituitary at embryonic day 18.5 (E18.5) can be treated in the same way as the neonatal pituitary. But the pituitaries (Rathke's pouches) younger than E16.5 should be embedded with the entire head and oriented with the sagittal axis (from mouth to occiput) perpendicular to the bottom surface of a base mold.\nChill the paraffin block at -20 °C for 10 - 20 min and then cut it into thin slices (4 µm thickness is preferred) with a microtome. To get satisfactory coronal sections, fine tune the position of paraffin blocks during sectioning. Mount the tissue slices onto polylysine-coated glass slides to prevent detachment of slices in the following procedures.\n\tNOTE: Alternatively, specimens can be dehydrated in 15%, 30% (W/V) sucrose solutions (in PBS) at 4 °C until they sink to the bottom, embedded in cryo-embedding compound using the same orientation method, and quickly frozen on dry ice. Then cut the frozen tissue blocks into slices of 8 - 10 µm using a cryostat. The morphology of cryo-sections, however, is often inferior to paraffin sections.\n3. H&E Staining and Immunofluorescence Labeling",
    "Warm the slides on a heat block at 55 °C and dewax with xylene, 2 changes, 4 min each. Dehydrate the samples with 95% ethanol twice and 75% ethanol twice, 3 min each. Wash the slides with distilled water for 5 min on a shaker.\nFor H&E staining, stain the sections in alum hematoxylin solution for 6 min, rinse in running tap water for 2 min, differentiate with 0.2% ammonia water for 45 s, and re-rinse in running water for 2 min. Then dehydrate the sections with 95% ethanol for 1 min and stain with eosin for 2 min. Sequentially dehydrate, clear, and mount.\nImmunofluorescence labeling\nTreat the sections with methanol containing 3% H2O2 and 0.01% NaN3 for 20 min at room temperature to inactivate endogenous peroxidases. Retrieve antigens by boiling sections in the retrieval buffer (1 mM EDTA and 1 mM Tris-HCl, pH 7.4) in a pressure cooker for 2 min. Incubate the sections with blocking buffer (5% goat serum in PBS) for 30 min at 37 °C.\nIncubate sections with rabbit anti-growth hormone (GH) antibody (1:2,000) or rabbit anti-glial fibrillary acidic protein (GFAP) antibody (1:2,000) diluted in blocking buffer overnight at 4 °C.\nIncubate sections with secondary antibody (goat anti-rabbit IgG-HRP, 1:300 in blocking buffer) for 35 min at 37 °C.\nAmplify the signals using Biotinyl Tyramide (1:50 in Tris buffered saline containing 0.3% H2O2) for 15 min at room temperature, and visualize with Streptavidin-Alexa594 or 488 (1:300 in blocking buffer, 30 min, 37 °C).\nCounterstain the nuclei with DAPI (50 mg/L in PBS) for 5 min at room temperature.\n\t\tNOTE: It may not be necessary to amplify the signal using Tyramide Signal Amplification (TSA) system. Alternatively, a fluorescence-conjugated secondary antibody can be used to visualize the signal.",
    "Acquire images using a fluorescence microscope equipped with DAPI, Texas Red, and FITC filter sets, ×4/0.13 to ×40/0.75 objectives and 5.0 megapixel camera. Use the 360, 488, and 594 nm laser wavelengths for imaging DAPI, Alexa 488-, and Alexa 594-stained sections, respectively. Optimize the laser power (0.8 was used generally) and exposure time to the desired levels for each channel. Capture the image under the control of image acquisition software and overlay the fluorescence images subsequently using image processing software.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}