{
  "id": 18571,
  "origin_website": "Jove",
  "title": "Murine Isolated Heart Model of Myocardial Stunning Associated with Cardioplegic Arrest",
  "procedures": [
    "NOTE: All Procedures were approved by the Lifespan Institutional Animal Care and Use Committee and all animals and procedures according to the National research Council Guide for Care and Use of Laboratory Animals10.\n1. Balloon Fabrication and Left Ventricular Pressure Monitoring Circuit\nConstruct LV balloons according to Miller et al.11 In a beaker with a stir bar, mix 9.5 ml of distilled water, 14.2 ml of light corn syrup and 33.8 g of sucrose, and heat on a hot plate, mix until the sugar is dissolved. Continue heating solution until it reaches approximately 150 ºC.\n\tNOTE: Numerous methods exist to construct LV balloons including modification of condom tips and cling film construction9,12. We find the above method to be relatively easy to construct leak-free balloons, however an advantage of cling film balloons includes previous characterization for appropriate frequency-response relationships9.\nBreak dry spaghetti strands into pieces about 5 cm in length and dip one side of each piece about 1 cm deep into the sugar solution and slowly remove.\nPlace the dry end of the pasta strand into a polystyrene foam block and suspend so the sugar mix drips down and forms a teardrop shape mold. Leave O/N in a desiccator so the mold hardens.\nThe following day, dip the molds into silicone dispersion gel. Place pasta strands back into polystyrene foam block and place in a a 37 ºC oven for 2 hr or until dry. Repeat this step once more so two layers of silicone are applied.\nOnce dry, place in water for several hours to assist in removal of balloon from the mold. Store balloons in 0.02% sodium azide solution.\nUse a 23 G blood collection set to produce a customized balloon cannula by cutting a needle to create a blunt tip and placing notches in the needle.",
    "Connect the tubing to a pressure transducer and flush with water while keeping tubing and cannula completely submerged to prevent air from entering the system. Place a balloon that has been filled with water onto the cannula and use 2-0 silk sutures to tie onto cannula. Test balloon by ability to maintain pressure (~100 mmHg for at least 1 hr)\n2. Preparation of the Isolated Heart Perfusion System\nInitially, wash and warm the system. Turn on a 37 ºC warm water bath circulator that has been connected to the Langendorff apparatus, and fill buffer reservoir with distilled water. Connect a new glass fiber filter to tubing flowing into apparatus and turn on pump to flush out the system. During prep time, monitor the temperature of water expelled from the Langendorff block using a temperature probe, to ensure that water bath is set accurately. Also, turn on a refrigerated circulator pump and set to 20 ºC that will be used during cardioplegic arrest of the heart.\nIn the meantime prepare the following solutions. Prepare 1 L of cardioplegia solution (110 mM NaCl, 16 mM KCl, 16 mM MgCl2, 1.5 mM CaCl2, 10 mM NaHCO3) and filter. Also, prepare 2 L of KHB (118 mM NaCl, 4.8 mM KCl, 1.2 mM KH2PO4, 1.7 mM MgSO4, 2 mM Na-pyruvate, 6 mM dextrose, 24.9 mM NaHCO3 (pre-aerated with CO2),1.4 mM CaCl2 (added last). Once dissolved, remove precipitates by filtering into a flask using a 5 µm glass fritted funnel. Place some into a small dish on ice to be used during surgery and isolation.",
    "Oxygenate the perfusate (KHB) with 95% O2/5% CO2 for at least 30 min prior to use. Perfuse Langendorff system with KHB to remove any remaining water from system and buffer reservoir. For mice, set the initial pump speed to ~2.0 ml/min. Place 2-0 and 4-0 silk sutures near perfusion cannula. Run the pump until the tubing and apparatus are filled with perfusate and ensure the bubble strup is filled with perfusate.\n\tNOTE: For long periods of perfusion and stable function it is highly recommended to install an in-line glass fiber filter (~1 µm) in the perfusion circuit to collect any precipitates that could form clots in the heart\n3. Mouse Surgery\n3.1) Mouse Anesthesia and Handling\nPrepare syringe with anesthetic dose of 80 mg/kg ketamine and 5 mg/ml xylazine mixture, and add sterile 0.9% saline to bring up volume to 0.2 ml. Inject Heparin I.P. (50 µl of 1,000 U/ml solution).\nPlace mouse back into transport container (~10-20 min) and wait for it to lose consciousness as heparin takes effect. Periodically do a toe pinch to monitor pain reflex.\n3.2) Remove the Heart\nOnce mouse is fully unconscious and does not respond to toe pinch, secure it to an appropriate operating table using pins or 25 G syringe tips through the extremities. Perform a thoracotomy to expose the heart. Cut a small hole just below the sternum and extend the cut to the sides of the mouse avoiding the diaphragm.\nQuickly cut the diaphragm and then rapidly cut up the sides of the rib cage. Flip back the rib cage like a clam shell to expose the thoracic cavity. Gently take hold of the heart, place scissors underneath and remove the heart.",
    "NOTE: It is essential to quickly remove the heart once it is exposed in the thoracic cavity and the lungs are non-functional.\n3.3) Clean the Heart\nPlace the heart into the dish containing ice cold KHB and trim off any large pieces of lung tissue attached. Use forceps to pick up the heart and locate the aorta. Gently squeeze the heart and look for any blood that appears, as this should be the open end of the aorta. Use fine tip tweezers to hold the heart by the open end of the aorta.\n4. Mounting the Heart, Starting Perfusion, and Placing the Balloon\n4.1) Mounting and Cannulating the Heart\nBefore transporting the heart to the Langendorff apparatus, turn on the pump ensuring that the perfusion pressure is low (~20 mmHg). Hold the heart by the aorta just under the cannula. Using another set of fine tip tweezers, carefully open the aorta and slide heart up onto the cannula. Hold it in place with one set of tweezers and then use a soft edged clip to temporarily secure it to cannula.\n\tNOTE: Quickly mounting the heart to the perfusion cannula is critical for a good preparation. With experience, the procedures from opening the thoracic cavity until mounting the heart should take between 1 and 2 min.\nTie and initiate perfusion as follows, using 4-0 silk suture secure aorta to the cannula directly below the clip. Ensure the tie is also around the metal aortic cannula, so the aorta does not get tied off when tightening the knot. Once one tie is firmly placed, remove the clip.",
    "Use additional silk sutures to fasten the aorta securely to the cannula making sure to tie off below any vessel branches that may be coming off the aorta. These can often be spotted by perfusate leaking or shooting out from the aorta.\n\tNOTE: During the initial stages of perfusion the blood should be washing from the heart and the entire heart should appear a soft pink color. Dark discolorations that do not wash out indicate ischemic areas likely due to air emboli or clots and the heart should not be used.\n4.2) Establishing Perfusion and LVP Measurement\nSlowly increase the perfusion pressure and increase pump speed until the perfusion pressure reaches 70 mmHg.\n\tNOTE: Standard perfusion pressures for mouse perfusion can be 70-90 mmHg, but must be kept constant from animal to animal within an experiment.\nClean the remaining tissue (lung, thyroid etc.) that may still be attached to the heart. Use scissors to cut off the left atria in order to create an opening into the left ventricle.\nPlace the balloon onto the holder and deflate. Position the balloon cannula near the aortic cannula, directly over the opening into the left ventricle. Carefully insert balloon downward into the left ventricle while holding the heart in place so the aorta does not tear.\nOnce it is in place slowly start to inflate the balloon until the LVEDP reaches ~8 mmHg. Place the temperature probe against the bottom of the heart so it measures the temperature of the effluent.\n4.3) Basal Measurement\nSeal the heart in a water jacketed perfusion chamber. During this time continuously perfuse the heart with KHB, and ensure that the temperature continues to rise. Monitor the temperature and adjust the water bath accordingly until it reaches approximately ~37 ºC.",
    "NOTE: Monitoring temperature in the initial phases of perfusion is critical as coronary flows and subsequently temperature can vary from heart to heart. Temperature of the effluent perfusate is monitored for desired myocardial temperature via a temperature probe placed at the apex of the heart. In addition, in comparison to other Langendorff perfusion protocols, the heart is not submerged in CP or KHB during perfusion or arrest, this is mainly done to quickly adjust temperature as well as provide efficient CP delivery without diffusion.\nBegin to continuously record functional measurement using a data acquisition system attached to the appropriate sensors, including perfusion pressure, left ventricular pressure (pressure transducer attached to LVP balloon), temperature, and electrophysiological parameters (EKG, MAP if so equipped) (attachment will be according to manufacturers and specific to the individual sensors and data acquisition system). Once the effluent KHB reaches ~37 ºC for at least 15 min and cardiac functional parameters are stable, note the time for baseline measurements.\n\tNOTE: Inclusion/exclusion criteria are applied to each heart. A LVDP of <60 mmHg at baseline indicates a heart that should be removed from analysis. In addition, coronary flow >4.5 ml/min, or inability to maintain perfusion pressure at baseline likely indicates a leaking or torn aorta. Also any hearts that have clear ischemic areas which can be confirmed visually (i.e., clot) or exhibit ischemia-associated reductions in cardiac function (i.e., increasing LVeDP, extremely arrhythmic) are removed from analysis.\nMeasure coronary flow via collection of the coronary effluent in a graduated cylinder for 1 min. Close the chamber and allow temperature and function to return to baseline values. Alternatively measure the coronary flow continuously in the perfusion line via a flow probe placed after the pressure relief circuit.\n5. Initiating Cardioplegic Arrest",
    "Place 100 ml of cold cardioplegia buffer into another reservoir and. transfer the KHB reservoir cannula to the cardioplegia reservoir.\nDetach the water jacketed housing and the perfusion warming circuit from the warm water bath and connect to the refrigerated circulator using tubing quick disconnects. Use separate heating and cooling circulators to allow rapid temperature changes of the heart and perfusate.\nFollow the air bubble that gets introduced into the tubing during the switch, and once it reaches near the isolated heart start the timing for cardioplegia. Deliver cardioplegia for 2 min. After the initial dose stop the pump. Ensure to arrest the heart in diastole and be close to the desired CP temperature.\n\tNOTE: A sufficient bubble trap is necessary to avoid air emboli in the heart. Alternatively a delivery system for both reservoirs switched by a stopcock can be easily constructed, however we find following the small air bubble that is introduced when swapping the cannula between reservoirs, an easy method of timing CP delivery given potentially different pump speeds between experiments (i.e., due to mouse/rat, perfusion pressure, filter resistance, etc.)\nKeep the heart in cardioplegia for 2 hr at ~20 ºC. Every half hour during CP turn the pump back on for 1 min so another dose is administered.\n\tNOTE: Intermittent doses of CP every 30 min results in functional impairment of the heart without necrosis of the tissue. Longer periods between doses of CP (i.e., >45 min) can result in necrosis and ischemic contracture and would be more appropriate for a model of necrotic injury associated with unprotected ischemia.\n6. Reperfusion",
    "At the end of CP, transfer the reservoir cannula back to the oxygenated KHB. Connect the temperature control circuits to the heating circulator and turn the pump on to start reperfusion. At this point the cardioplegia washes out, observe the temperature rise and the heart starts beating again after 2-4 min of reperfusion. When the heart starts the heart beat is slow and often arrhythmic.\n\tNOTE: There usually is not a large rise in diastolic LVP (i.e., ≤10 mmHg rise) which is often characteristic in pure ischemia models. Arrhythmias can persist well into reperfusion and occasionally the heart will need to be defibrillated. This can be achieved with the use of a stimulator set to higher voltages (~10-50 V) and electrodes placed at the base and apex of the heart.\nAllow the heart to reperfuse for 30 min, and during this time period take coronary flow measurements as necessary. Measure coronary flow by collecting the effluent with a graduated cylinder for 30-60 sec.\n7. Collecting the Tissue\nDeflate the balloon and remove it from the left ventricle. Take the heart off the cannula and weigh it. In initial experiments, at least one transverse slice of the heart should be taken and TTC stained to evaluate necrosis to ensure that the heart is free of any necrotic injury.\nCollect heart slices for microscopy studies, wet/dry weights, etc. The remainder or whole heart should be rapidly frozen by placing into liquid nitrogen. Store frozen hearts in a -80 ºC freezer.\n\tNOTE: For measurement of high energy phosphate compounds (i.e., ATP, creatine phosphate), the hearts should be frozen immediately.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}