{
  "id": 6956,
  "origin_website": "Bio",
  "title": "Measuring Breathing Patterns in Mice Using Whole-body Plethysmography",
  "procedures": [
    "Several parameters may critically influence WBP outcomes and reproducibility. Therefore, they might be considered in the experimental design. These include time of the day (considering mouse circadian cycle), mouse behavior during recording, and standardization of the habituation period (Quindry et al., 2016; Receno et al., 2019). Depending on the specific research question, strain-specific differences in pulmonary physiology might be evaluated (Cramer et al., 2015; Bates, 2017). Importantly, the parameters described in the following section may be adapted and validated considering the basal/control breathing activity of each mouse strain.  Furthermore, environmental conditions must be kept constant during the entire procedure. Here, we maintained a constant temperature of 22 °C and a relative humidity of 55% (as recommended in the Guide for the Care and Use of Animals, National Research Council, 2011).Setting up the equipmentInstall USB Data Acquisition (eDacq) to the computer.Connect through the USB connector the Adaptive Amplifier to the acquisition unit.Attach Pulmonary Flow Transducer into the transducer entrance from Adaptive Amplifier (Figure 1D).Join the Pulmonary Flow Transducer to the Plethysmograph apparatus (Figure 1A).Set up Flow 1 and Flow 2 levels at 1cc/min from the Bias Flow Generator (Figure 1C).Join Port 1 from Bias Flow Generator with Entrance 1 of Large capacity drying column and Port 2 to the top input from Plethysmograph chamber. Then, connect Entrance 2 of drying column to the lower input from Plethysmograph device (Figures 1A and 1C).Note: Silica beads must be maintained dehydrated, when hydrated (color indicator shifts from orange to green, Figure 1C) it is necessary to replace the beads or reactivate them by drying them at 150 °C for 24 h.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200902/20200902205313_6197.jpgFigure 1. Plethysmograph equipment. A. Plethysmograph chamber. 1: Top input (incoming airflow), 2: Pulmonary Flow Transducer, 3: Lower input (air exit), 4: Alternative lower input). B.",
    "Plethysmograph apparatus attached to the 1 ml Lock syringe by the alternative lower input (4). C. Bias Flow generator and drying column containing silica beads. 5: Port 1 (flow1), 6: Entrance 1, 7: Port 2 (flow2, incoming air), 8: Entrance 2 (air extraction). D. Adaptive amplifier connected to the chamber through transducer entrance (9). Fresh air is continuously administrated into the chamber trough the Port2 and released from the chamber trough the lower input (3). Then, the air passes through the drying column and it is extracted from the Bias Flow generator (air dehumidification is required to preserve bias flow generator).Setting up the protocol (see Video 1)Start eDacq program.Select Protocol from left panel. A new window will pop up.Click Site 1 option and then Edit.Add and edit the different steps of the desired protocol:Record on all sitesWait for user advancePause for 00:03:00 (time to leave the workspace/room)Record control period for 00:45:00 (habituation time)Record period for 00:15:00 (recording time)Record off all sitesSelect Site 1 from left panel. Add the following flow derived parameters (FDP) properties for recording:On the General tab: in the Input group select 20 ms of smoothing and in the Output group select 5 s of time based.On the Breath Analysis tab: in the Breath Detection group introduce 0.5 ml/s for Row Threshold and 20% TV for Start of Breath Extrapolation. In the Breath Rejection group, do not select Enable Breath Rejection.On the Filtering tab: do not select Enable-Pass Filter and Enable Mains Filter.Apply all changes.Save configuration.Note: Experimental parameters (from Steps B4 to B5) may be adjusted depending on the biological question, experimental design, and mouse phenotype. Please check manufacturer’s recommendations.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1.",
    "Setting up the protocol Chamber calibration (see Video 2)Turn on the Bias Flow Generator and the Adaptive Amplifier (a white light will flash on standby) 15 min before starting calibration.Tightly close the plethysmography chamber.Start eDacq program.Introduce assigned password (select ok).Introduce study name (press close).Close the configuration file version window that appears.Accept calibration option (always recommended).Activate DC mode for calibration (AC mode is automatically set during recording).Set the high flow value to -10 ml/s.Press F8 (Zero button) to adjust basal parameters.Press F9 (Low) to adjust low calibration volume.Join 1ml lock syringe to the alternative lower stopcock input of plethysmography chamber (Figure1 A-B).Gently inject 1 ml air volume into the chamber using the connected syringe and 1.5 s after press F11 (Record volume) to adjust high calibration volume. Proper calibration range should be between -35 and +35 ml/s (repeat the process otherwise).Remove the syringe and place back the cap.Click Finish button and proceed to respiration recording.A white light should flash on ready from the adaptive amplifier machine.Notes:Calibration must be performed every time the equipment is switched on. There is no need to calibrate between each animal/trial in the same day. Calibration can also be initiated through the U option from toolbar at any time. High flow value must be ten times the injected calibration volume (step 13) as a correction factor for FDP analysis.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. System calibration Breathing recording (see Video 3)Weigh the mouse right before recording.Open the plethysmography device and place the animal inside.Note: It is critical not disturbing the transducer when manipulating the chamber device. Vibrations can affect the calibration. If this occurs recalibrate the system. Avoid installing the equipment in unstable surfaces or close to high-traffic areas. Close the chamber tightly and make sure the animal moves freely.",
    "Select Protocol option and then Site 1 choice (the pre-configured protocol will be open).Restart the protocol.Introduce mouse identification, weight and any other comments of interest. After assessing this step, recording will start, (green flashing window on screen may appear).Advance the protocol to wait period (3 min) step. After this period the protocol will automatically proceed to the following steps.Note: During this interval we recommend that the user leaves the workspace/room without disturbing the equipment to avoid interferences with the analysis. However, mouse must be monitored by visual resources or from outside the room through the whole session to record motor activity periods as well as any other behaviors. After recording, return the animal to its cage. Clean and wipe the equipment with 70% Ethanol. Recording will be automatically saved in the assigned project folder.Record next animal by restart button (start from Step D1) or proceed to data analysis.Turn off all the equipment.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 3. Recording whole-body plethysmography"
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}