{
  "id": 7597,
  "origin_website": "Bio",
  "title": "Bacterial Growth Curve Measurements with a Multimode Microplate Reader",
  "procedures": [
    "Bacteria Growth:  Preparation of initial liquid culture of bacteriaPrepare liquid LB medium, followed by autoclaving (120°C, 41 min) and cooling down to room temperature.Inoculate a single colony of the bacterial strain into 7 mL of LB medium in a culture tube, supplemented with ampicillin or the appropriate antibiotic at a final concentration of 50 µg/mL. Note: Several colonies in separate culture tubes may be used if more replicates are desired. Incubate the liquid culture in a shaking incubator at 37°C with orbital shaking at 250 rpm overnight.Pre-treatment of 96-well plates and lidsPrepare 10% Triton X-100 in ethanol by mixing 1 mL of Triton X-100 with 9 mL of ethanol.Pour 10 mL of the diluted Triton X-100 to a new microplate lid.Incubate the lid with diluted Triton X-100 at room temperature for 15 s.Take a new 96-well plate and fill each well with 100% ethanol (400 µL per well). Incubate at room temperature for 15 min.Discard ethanol from the microplate wells and discard the diluted Triton X-100 from the microplate lid.Air dry the microplate wells and microplate lid at room temperature by leaving them inside the biosafety cabinet for 30 min.Turn on the UV light of the biosafety cabinet and further disinfect the microplate wells and lid for 15 min.Note: Treatment with ethanol and UV is for sterilization, while treatment with Triton X-100 is to prevent water condensation on the lid during the measurements. Setup of microplate reader and softwareTurn on the microplate reader and open the Gen5 software.Set up a new procedure/protocol in Gen5 (Figure 3).Plate type: 96-well plate.Use lid: checked.Temperature: 37°C.Shake: orbital for 0:10.Kinetic measurement for a desired total time (e.g., 16 h, 24 h, or 48 h) and interval of 10 min with continuous orbital shaking.",
    "Reading: absorption at 600 nm, fluorescence at excitation = 488 nm and emission = 525 nm.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4410/bioprotoc-12-09-4410-g003.jpgFigure 3. An example for setting up the procedure/protocol in Gen5 software for the growth curve measurements of bacteria using a microplate reader. Growth curve measurements using microplate readerDilute the overnight liquid bacterial culture by 100–500 times in fresh LB supplemented with ampicillin at 50 µg/mL.Notes:  If a photometer is available, measure the optical density of the overnight culture and make the dilution to the desired optical density (typically <0.05). Other media or additional ingredients (such as ions, nanoparticles, and drugs of interest that may affect bacterial growth) can be used if desired. For example, silver ions were added to the LB medium at a final concentration of 40 µg/mL in the sample S2 of the representative data (Figure 4). Pipette 200 μL of the diluted culture into a single well of the 96-well plate as a sample. Samples should be prepared with at least triplicates.Pipette 200 µL of LB medium with ampicillin into a single well of the 96-well plate as a blank. Blanks should be prepared with at least triplicates.After loading all the samples and blanks, cover the 96-well microplate with the prepared lid.Start the procedure/protocol in Gen5 software. When prompted, place the microplate properly on the microplate holder, and start recording of the bacterial growth curve.Finishing upUpon completion of the data acquisition, remove the 96-well plate from the microplate reader.Disinfect the samples and discard the microplate properly.Save the results in Gen5 software, and export the data as an Excel spreadsheet file.Close the Gen5 software, and turn off the microplate reader."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}