{
  "id": 6104,
  "origin_website": "Bio",
  "title": "Enzymatic Activity Assay for Invertase in <em>Synechocystis</em> Cells",
  "procedures": [
    "Cultivation of Synechocystis sp. PCC 6803 (Tan et al., 2011)Note: Monitor the growth of cyanobacterial cells by measuring the optical density (OD) at 730 nm with a spectrophotometer. Culture volume should be less than 30 ml in 50 ml flasks. Grow Synechocystis cells in 20 ml liquid BG-11 media (see Recipe 1) in 50 ml flasks with an initial OD730 of 0.05.Cultivate the Synechocystis cultures at 30 °C with shaking (150 rpm) and constant white light illumination (50 μE/m2/sec) for ~4 days to reach the exponential growth phase.Preparation of cell crude extracts from Synechocystis cellsCollect 8 ml of the exponential phase culture (OD730 ≈ 2) of Synechocystis by centrifugation at 8,000 x g for 10 min at room temperature. Resuspend Synechocystis cells in 0.5 ml of 100 mM potassium phosphate buffer (pH 7.0) in a 2 ml tube.Add 1 g of glass beads (150-212 μm; Sigma-Aldrich) into the 2 ml tube containing cell suspensions and 100 mM Phenylmethanesulfonyl fluoride (PMSF) to reach a final concentration of 1 mM. Then, vortex the tube at the highest speed for 1 min. For each 10 sec vortexing, cool the tube on ice for 5 sec. After centrifugation at 12,000 x g, 4 °C for 30 min, transfer the supernatant into a new tube and store on ice before use.Note: The cell crude extracts should be used immediately.Detection of the in vitro invertase activityFor 50 µl in vitro invertase reactions, mix potassium phosphate buffer (pH 7.0), sucrose and crude extracts together (The final concentrations of potassium phosphate and sucrose are 100 mM and 2 g/L respectively. Whereas, the protein concentrations of crude extracts are 2.5~4.0 g/L.) Use the reaction mixture without the cell crude extract as a negative control.Incubate the mixtures at 30 °C in a thermal cycler (T100, Bio-Rad, USA) for 1.",
    "5 h. Then, stop the reaction by three freeze-thaw cycles. In each freeze-thaw cycle, freeze the reaction mixtures in liquid nitrogen and next thaw by incubation in a 65 °C water bath. Measure the amount of the resulting glucose and fructose as well as the rest of the sucrose substrate using ion chromatography (Figure 1). Spin down the reaction mixtures at 12,000 x g for 10 sec. Then, subject 25 μl of the diluted mixtures to ICS-5000+ ion-exchange chromatography system equipped with an electrochemical detector and a DionexTM CarboPacTM PA10 analytical column (4 x 250 mm, ThermoFisher, Waltham, MA, USA). Elute the column with 200 mM NaOH at a flow rate of 1.0 ml/min.Note: The reaction mixtures should be diluted to at least 50 folds before analyzed by ion chromatography.Prepare a series of glucose standard solutions (0.01, 0.05, 0.1, 0.5, 1, 2 mg/L), establish the standard curve by using ion chromatography (see below).Quantification of glucose resulted from the sucrose degradation catalyzed by invertaseRetention times of glucose and fructose using the method described above are 3.5 and 3.8 min respectively (Figure 1).Establish the glucose standard curve by using the peak area calculated by the Chromeleon software (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180515/20180515213158_0510.jpgFigure 1. Ion chromatography profiles of standards and the in vitro invertase reaction mixtures. A. Chromatogram of the glucose-fructose standard mixture. 100 mg/L of the glucose and fructose standards were mixed together and analyzed by ion chromatography. B. Chromatogram of the in vitro invertase reaction mixture without the cell crude extract (negative control). C. Chromatogram of the in vitro invertase reaction mixture. Glu, Glucose; Fru, Fructose; Suc, Sucrose.",
    "For quantification of glucose in reaction mixtures, calculate the areas of the target peak obtained by ion chromatography by the Chromeleon software, and then determine the glucose concentration using the standard curve of the glucose standards (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180515/20180515213303_1887.jpgFigure 2. The glucose standard curve"
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}