{
  "id": 17039,
  "origin_website": "Jove",
  "title": "Erosion Identification in Metacarpophalangeal Joints in Rheumatoid Arthritis using High-Resolution Peripheral Quantitative Computed Tomography",
  "procedures": [
    "All methods in this protocol follow the guidelines set by the Conjoint Health Research Ethics Board at the University of Calgary (REB19-0387).\n1. Install 3D Slicer 15 and bone analysis modules\nDownload the installation file for a stable release of 3D Slicer that is relevant to the operating system used from https://download.slicer.org/.\nRun the downloaded installation file and follow the instructions provided on the wizard.\nOnce the installation is complete, proceed with installing the bone analysis modules.\n\t\nDownload the bone analysis modules from https://doi.org/10.5281/zenodo.7943007 as a compressed zip file and extract the compressed folder. Please note the directory where the extracted folder is located.\nLaunch 3D Slicer. Load the modules onto 3D Slicer by clicking on Edit on the top left corner of the 3D Slicer window. Click on Edit > Application Settings to open a new window.\nClick on Modules which is a tab located on the left on the recently opened Settings window. Add the paths to the bone analysis modules under Additional module paths: (Figure 2).\n\t\t\nTo do this, drag and drop the following list of folders onto the box located under Additional module paths:. These folders are located inside of the downloaded folder in step 1.3.1: AutoMask, CorticalBreakDetection, ErosionComparison, ErosionVolume, FileConverter, ImageRegistration, Training. Settings window should resemble Figure 2.\nPress OK on the bottom right of the Settings window. A restart is required to confirm the installation of the modules. Do this by closing 3D Slicer and relaunching it.",
    "​NOTE: Loading the modules is only done once per installation of 3D Slicer. Upon further updates to the bone analysis GitHub repository, a simple terminal (or command line) git pull command at the directory containing the earlier BAM download will automatically update all the modules. Again, alternatively, the repository can be downloaded, and old modules exchanged with the new ones manually.\nimgsrc://cloudfront.jove.com/files/ftp_upload/65802/65802fig02.jpg\nFigure 2: Example of settings window after adding bone analysis modules to an installation of 3D Slicer. The image shows a screenshot of the settings window with the modules highlighted in the red box. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/65802/65802fig02large.jpg]\n2. Training module\nLaunch the BAM-Training module.\n\t\nClick on the Drop-down Menu located on 3D Slicer's toolbar. Find bone analysis modules and hover the mouse above it (Figure 3). Click on Training.\nLoad files in the module.\n\t\nUpon launching the BAM training module, all the required files (greyscale images, masks, reference erosion segmentations) will be loaded automatically by clicking Proceed, assuming the BAM github repository was downloaded as mentioned above.\nChoose a scan type for the files.\n\t\nChoose one by hovering over the drop-down menu labeled Input Volume: Select a Volume, this represents the master grey scale image.\nChoose the mask (i.e., the file that identifies the volume within the periosteal surface) in the drop-down menu labeled Input Mask: Select a Volume. Make sure this mask corresponds to the input volume above by verifying the measurement ID and the MCP joint is the same in both selections.",
    "If this is the first time running the training module on this image with this launch of 3D Slicer, then create a new output segmentation at the drop-down menu labeled Output Erosions: Select a Segmentation. To do this, click the drop-down menu and select Create New Segmentation. This will create a new output segmentation node labeled after the input mask label + _ER. To give the output a different label, select Create New Segmentation As… instead and input the desired label.\n\t\tNOTE: In 3D Slicer and this document, mask and segmentation identifies the volume inside the bone's periosteal surface. The mask is visualized as a binary image, while the segmentation refers to the visualization of the binary image overlaid with the grey scale image. These distinctions are made by 3D Slicer. An example is illustrated in Figure 4.\nPlace seed points as described below.\n\t\nTo begin, create a new seed point list to add seed points. To do this, click on the drop-down menu labeled Seed Points: None and create a new list by selecting Create new Point List. Again, the default labeling standard is input image label + _SEEDS. To provide your own label, select Create New Point List….\nScroll through the slices and identify erosion sites by placing a seed point in the region of interest. Press the Red Dot-Blue Drop button shown in Figure 5A to add a new seed point.\n\t\t\nPlace the seed point as deep (inwards into trabecular bone) into the erosion volume as possible. Make sure the seed point is placed on the darkest region of the volume.",
    "To change the seed point size, modify the percentage size at the text box labeled Seed Point Size:. Other fields in the seed points table, such as bone and cortical interruption, are for the user's records and do not affect the erosion computation algorithm.\nObtain feedback as described below.\n\t\nOnce the seed points have been placed. Press the button labeled Get Erosions, highlighted in Figure 5B, to run the erosion measurement algorithm on the given inputs. Upon completion of the erosion measurements, the module will provide feedback on the seed point placement. Each seed point's location is compared with the location of reference erosions to match seed points to the erosion it is trying to measure.\nObtain reference erosions by calculating the erosion volume using seed points placed by rheumatologists with training, extensive publication records and more than 10 years of experience using HR-pQCT imaging and erosion analysis (SF and CF).\nimgsrc://cloudfront.jove.com/files/ftp_upload/65802/65802fig03.jpg\nFigure 3: 3D Slicer's dropdown menu. The dropdown menu to find the bone analysis modules and select the training module. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/65802/65802fig03large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/65802/65802fig04.jpg\nFigure 4: Identification of the volume inside the bone's periosteal surface. (A) Example of a mask. The mask is visualized as a binary image. (B) Example of a segmentation. The segmentation refers to the visualization of the binary image overlaid with the grey scale image. These distinctions are made by 3D Slicer. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/65802/65802fig04large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/65802/65802fig05.jpg\nFigure 5: Example screen shot of training module within 3D Slicer. (A) Click to add new seed points. (B) Click to compute erosion volumes. (C) Click to import images. (D) Click to reveal seed points placed by experts. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/65802/65802fig05large.jpg]",
    "3. Image acquisition and export to use in erosion analysis tool\nAcquire HR-pQCT images using a first or second-generation HR-pQCT scanner. A commercial scanner was used to acquire the images for this study (see Table of Materials).\n\tNOTE: The images used in this study are of the 2nd and 3rd metacarpophalangeal joints and were acquired using the protocol described in Barnabe et al.8, however images of any joints with erosions are compatible with BAM.\nInspect images for motion artifact16,17. Do not use images with motion scores > 3 for erosion analysis.\nExport AIM (proprietary image format) or digital imaging and communications in medicine (DICOM) files of each joint to a local disk using file transfer protocol (FTP). Files of individual joints may be generated using the joint space width (JSW) analysis pipeline provided by the manufacturer18. Rename files from default number format for easier use.\n4. File conversion and bone mask generation\nNOTE: Depending on the image format, follow step 4.1 for AIM (HR-pQCT proprietary image format), MHA (ITK MetaImage format), nii (NIfTI - Neuroimaging Informatics Technology Initiative), NRRD (Nearly Raw Raster Data) images or step 4.2 for DICOM images.\nTo import images with any of the following image file formats: MHA, nii, AIM or NRRD follow the steps described below.\n\t\nClick on the button labeled DATA located at the top left corner of the 3D Slicer window (Figure 5C).\nTo add image files, click on Choose File(s) to Add, locate and add the images.\nTo add an entire directory of images, click on Choose Directory to Add, locate and add the directory. This will load all images in that directory.",
    "If an image mask needs to be imported as a 3D Slicer segmentation for any reason, first convert to an NRRD or nii file. This conversion can be done automatically, see step 4.4.1 for details.\nImport DICOM file(s) in 3D Slicer as described below.\n\t\nClick on the button labeled DCM located at the top left corner of the 3D Slicer window.\nClick on Import DICOM Files, locate and add the directory containing the DICOM files (extension is .dcm).\nClick on the button labeled Load located at the right side of the window.\nGet image mask using Step 2 - Automatic Mask in the BAM - Automatic Mask module.\n\t\nClick on the drop-down menu located on 3D Slicer's toolbar. Find Bone Analysis Modules and hover the mouse cursor above it. Click on Automatic Mask.\nUnder the tab Step 2 - Automatic Mask, select an input volume using the drop-down menu labeled Input Volume:. This is the input scan.\nCreate a new output at the drop-down menu labeled output segmentation: and select Create New LabelMapVolume. This will create a new output node labeled after the input mask label + _MASK. To give the output a different label, instead select Create New LabelMapVolume as… and input the desired label.\nInput the number of bones to be masked at the text box with that label. Select Ormir in the drop-down menu labeled Algorithm for the optimal segmentation for this analysis19.\n\t\tNOTE: Other options for generating these masks are available and may be added in the future.\nClick on Get Mask. This will run the algorithm (~2-3 min) and output the result at the same directory of the input image. It will also save a separate mask for each bone if the image had multiple bones.",
    "Perform manual correction of bone mask using Step 3 - Manual Correction in the BAM module. Often the mask generated is not accurate. Perform manual correction to add, delete, or edit specific components of the segmentations.\n\t\nTo edit a mask that was generated through other means or generated in a previous run of 3D Slicer, use this module to load these masks to 3D Slicer from a file. The file extension can be any of the following, MHA, nii, NRRD, AIM.\n\t\t\nCopy the images to the LOAD_MASKS directory located in the BAM folder downloaded in step 1.3.\nGo back to 3D Slicer and press the button labeled Load in the manual correction stage.\nSelect the segmentation to be corrected in the drop-down menu labeled Mask To Be Corrected:\".\nSelect the original gray-scale image belonging to this erosion segmentation in the drop-down menu labeled Master Volume:. Press Initialize.\nEach segmentation must have its own entry in the table below. Select the segmentation to be corrected based on the color of the segmentation.\nTo add to a segmentation, click on the second button on the first row. This uses the paint function. Make additions to the volumes by drawing on the images (hold left mouse button down and move the mouse).\nTo remove part of the segmentation, click on the button below the table labeled Erase Between Slices. This is the erase function and works like the paint function but erases instead.\nDraw additions as needed on roughly every 10-25 slices, but make sure to include the first slice and last slice where an addition was needed.\nIf the paint function was used, the changes can be interpolated by clicking on the first button of the fifth row labeled Fill in Between Slices function. Click on the buttons Initialize > Apply.",
    "If the erase function was used, simply click on the button below the table labeled Apply Erase. Do not use both paint and erase functions at the same time. Apply one function first then apply the other.\nAfter the edits are completed, press Apply.\n5. Identification of erosions\nUse Step 4 - Erosions in the BAM - Erosion Volume module for identification of erosion. The erosion volume module is the tool responsible for identifying and measuring erosions within a scan.\n\tNOTE: This module is the focus of the training tool detailed above and has a nearly identical workflow. The differences are that the computed erosions are not compared against expertly annotated ones, exporting erosion statistics and manual correction of the volumes after their identification is possible here.\nPlace seed points and get erosion as done in step 2.4. In the end no feedback will be provided.\nManual Correction\n\t\nIf the size and shape of the automatically detected erosion volumes are unsatisfactory, edit these under the tabs labeled Step 5 - Manual Correction and Export Segmentation. Follow steps outlined in step 4.4. However, there is no option to load external erosion volumes. Do not press Apply after finishing the corrections as the changes have already been saved.\n6. Erosion Statistics\nExport the computed data to a spreadsheet file (CSV format) using the tab labeled Step 6 - Statistics.\nProvide the erosion volume computed in Step 4 and optionally corrected in Step 5 under the drop-down menu labeled Input Erosions.\nProvide the greyscale image under the drop-down menu labeled Master Volume. Provide the voxel width, in mm, of the image in the text box. Press Get Statistics.",
    "The spreadsheet file has been generated in the directory called EROSIONS_OUTPUT_DATA located in the BAM folder downloaded in step 1.3. See Table 1 for an example of the output table."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}