{
  "id": 10630,
  "origin_website": "Jove",
  "title": "Metabolic Glycoengineering of Sialic Acid Using N-acyl-modified Mannosamines",
  "procedures": [
    "1. Preparation of Buffers and Reagents\nPreparation of 3 mM sodium methoxide solution\nDissolve 8.1 mg sodium methoxide in 50 mL methanol (3 mM) in a 100 mL glass bottle with a stir bar. Store at room temperature (RT) for several weeks.\nPreparation of Tris-HCl buffer\nCombine 8.766 g NaCl, 157 mg Tris-HCl, and 146 mg EDTA in a 100 mL glass bottle with a stir bar and dissolve in 80 mL water.\nAdd sodium hydroxide (1 M, in water) or HCl (20%, in water) to the stirring solution, while observing the pH with a pH-meter, and adjust the pH to 8.0.\nAdd the volume of water needed to achieve a final volume of 100 mL. Filter the solution using a 0.22 µm sterile filter system.\n\t\tNOTE: 100 mL Tris-HCl buffer will contain 150 mM NaCl, 10 mM Tris-HCl, and 5 mM EDTA (pH 8.0). The solution can be stored at 4 °C for several weeks.\nPreparation of aprotinin solution\nDissolve 10 mg aprotinin in 1 mL water (1.54 mM). Aliquot the aprotinin solution into 10 x 1.5 mL-plastic tubes (100 µL each). Store at -20 °C for several weeks.\nPreparation of leupeptin solution\nDissolve 10 mg leupeptin in 2 mL water (10 mM). Aliquot the leupeptin solution 10 x 1.5 mL-plastic tubes. Store at -20 °C for several weeks.\nPreparation of phenylmethylsulfonyl fluoride (PMSF) solution\nDissolve 34.8 mg PMSF in 2 mL ethanol (100 mM). Aliquot the PMSF solution in 10 x 1.5 mL-plastic tubes. Store at -20 °C for several weeks.\nPreparation of 1,2-diamino-4,5-methyldioxybenzol-dihydrochloride (DMB) solution",
    "Combine 15.62 mg DMB, 352 µL β-mercaptoethanol, and 48 µL sodium bisulfite-solution (39%), and add 9.6 mL water (6.9 mM DMB, 500 mM β-mercaptoethanol, and 0.19% sodium bisulfite). Aliquot the DMB solution in 40 x 1.5 mL-plastic tubes (250 µL each). Store protected from light at -20 °C for several weeks.\nPreparation of 1 M trifluoroacetic acid (TFA) solution\nAdd 770.3 µL of 100% TFA to 9.23 mL water in a 15 mL plastic tube (1 M). Store at 4 °C for several weeks.\nPreparation of 120 mM TFA solution\nAdd 92.4 µL TFA (100%) to 9.91 mL water (120 mM) in a 15 mL plastic tube. Store at 4 °C for several weeks.\nPreparation of 400 mM sodium hydroxide (NaOH) solution\nDissolve 160 mg NaOH in 10 mL water (400 mM) in a 15 mL plastic tube. Store at 4 °C for several weeks.\nPreparation of Western blot lysis buffer\nDissolve 5.84 g NaCl, 0.1 g Tris(hydroxymethyl)-aminomethan (Tris), 0.1 g CaCl2, 0.95 g MgCl2, and 1 g Triton-X100 in 100 mL water and adjust the pH to 7.8. Store at 4 °C. Add 100 µL of each protease inhibitor (aprotinin, leupeptin, and PMSF) before using the lysis buffer.\nPreparation of sodium dodecyl sulfate polyacrylamide gel electrophoresis (SDS-PAGE) buffer\nDissolve 0.3 g Tris, 1.5 g glycine, and 0.1 g SDS in 100 mL water and adjust the pH to 7.3. Store at RT.\nPreparation of Western blot buffer\nDissolve 0.3 g Tris, 1.1 g glycine in 90 mL water and add 10 mL ethanol. Store at RT.\nPreparation of blocking solution\nDissolve 1 g of fat free milk power in 25 mL phosphate buffered saline (PBS). Always prepare fresh.\n2. Synthesis of ManNProp and Related N-acyl-modified Mannosamines",
    "Dissolve 431.2 mg mannosamine hydrochloride in 10 mL 3 mM sodium methoxide solution in a 50 mL glass bottle with a stir bar.\nCool the mixture on ice to 0 °C. To the stirring solution, slowly add dropwise 210 µL propionyl chloride (2.4 mmol), or 248 µL butanoyl chloride (2.4 mmol) to synthesize ManNProp or ManNBut, respectively. Incubate the stirring mixture at 0 °C for 4 h.\nTransfer the solution into a 50 mL plastic tube. Poke 4 - 8 holes into the lid of the plastic tube with a thin needle. Rapidly freeze the solution using liquid nitrogen and subsequently lyophilize (freeze dry) it for 48 h or until it has completely dried.\nMix 350 g silica gel 60 with 750 mL ethyl-acetate/methanol/water (15:2:1) (this is a suspension). Fill a glass column (35 mm diameter and 70 cm length) with the silica gel 60 suspension and wash the prepared column with an additional 100 mL ethyl-acetate/methanol/water (15:2:1) before use.\nDissolve the dried products from step 2.3 (5 g dried product) in 10 mL ethyl-acetate/methanol/water (15:2:1) and load them using a pipette onto the silica gel column. Collect 4 mL fractions after 500 mL (for ManNProp). NOTE: ManNBut will elute from the column approximately after 700 mL.\nTransfer the eluted fractions into 15 mL plastic tubes. Poke 3 - 6 holes into the lid of the plastic tube with a thin needle. Rapid freeze the solution using liquid nitrogen and subsequently lyophilize it until it has completely dried.\n\tNOTE: The lyophilized products can be stored for several months at RT.\nVerify the purity of the products by mass spectrometry (see section 9).\n\tNOTE: Alternatively, purity can also be verified by 1H Nuclear Magnetic Resonance (NMR).\n3. Cell Culture",
    "Culture Kelly neuroblastoma cells in Roswell Park Memorial Institute (RPMI) medium containing 10% fetal bovine serum, 100 U penicillin, 100 mg streptomycin, 2 mM L-glutamine containing 5 mM ManNAc, 5 mM ManNProp, or 5 mM ManNBut, at 37 °C and 5% CO2.\n\tNOTE: Cells cultured in medium without ManNAc or its analogues are used as a control.\nPrior to application of the mannosamines, detach the Kelly neuroblastoma cells by incubating them for 10 min with trypsin/EDTA (0.25%, 0.02%, in PBS) and count using a Neubauer-chamber or cell counter. Seed the cells at defined numbers based on the size of the plate/dish.\nTo measure sialic acid monosaccharides, seed 1 x 105 cells in 500 µL medium into a 48-well tissue culture plate. For the analysis of polysialic acids, seed 1 x 106 cells in 3 mL medium onto a 6 cm diameter cell culture dish. Incubate at 37 °C and 5% CO2. Replace the medium every 24 h.\n\t\tNOTE: The effect of MGE increases with the total time of treatment. For high metabolic efficiency treat the cells for 5 - 7 days.\nAfter treatment, decant the medium. Wash the plates/dishes with PBS. Detach the cells by incubating them for 10 min with trypsin/EDTA (0.25%, 0.02%, in PBS). Neutralize the trypsin by adding the same volume of cell culture medium to the detached cells. Transfer the detached cells into 15 mL plastic tubes. Centrifuge the samples for 3 min at 500 x g and discard the supernatant.\nAdd 5 mL PBS and centrifuge cells (see step 3.3). Repeat the washing procedure two more times.\n\t\tNOTE: The washed cell pellet without supernatant can be stored at -20 °C for several days. If the expression of polysialic acid is to be elucidated continue to section 10.\n4. Cell Lysis for HPLC Analysis",
    "Preparation of HPLC lysis buffer\nCombine 5 mL Tris-HCl buffer, 5 µL aprotinin solution, 20 µL leupeptin solution, and 50 µL PMSF solution.\n\t\tNOTE: 5 mL HPLC Lysis buffer will contain 150 mM NaCl, 10 mM Tris-HCl, 5 mM EDTA, 1.54 µM aprotinin, 40 µM Leupeptin, and 1 mM PMSF (pH 8.0). This buffer should always be prepared fresh prior to cell lysis.\nRe-suspend the collected cell pellets (step 3.3) each in 500 µL ice-cold HPLC lysis-buffer, and ultra-sonicate the samples with an ultra-sonic processor needle three times for a period of 30 s at medium-high amplitudes. Cool the samples on ice for at least 1 min in between the cycles.\n5. Separation of the Membrane Fraction\nCentrifuge the lysed cell samples for 2 h at 20,000 x g and 4 °C.Separate the supernatant (approximately 480 µL), representing cytosolic proteins, in 1.5 mL plastic tubes. Determine the protein concentration of these fractions using, e.g., the Bradford or the bicinchoninic acid (BCA) assay.\n\tNOTE: The protein concentration (approximately 1 mg/mL) of the cytosolic fractions can later be related to the measured amounts of the respected sialic acid species. The pellet represents the membrane fraction, which is used in step 6.1.\n6. Acidic Hydrolysis\nNOTE: Oligo- and polysaccharides in the cell membranes are hydrolyzed to monosaccharides. Further, possible O-modifications in the monosaccharides are hydrolyzed, as well. This is necessary for quantitative HPLC analysis, because the overwhelming majority of sialic acids in the membrane fractions are naturally incorporated in glycoconjugates and might possibly bear O-acetyl or O-lactolyl modifications.\nAdd 150 µL 1 M TFA-solution to the separated membrane fractions (pellet from section 5). Incubate the samples for 4 h at 80 °C with shaking at 200 - 600 rpm.",
    "Centrifuge the samples for approximately 30 min at 20,000 x g and 21 °C using 0.5 mL filter tubes with 3 kDa exclusion membranes, until the upper phase volume is less than 20 µL.\n\tNOTE: This step is important to dispose higher molecular debris.\nTransfer the lower phase containing smaller molecules, including the sialic acid species, into 2 mL plastic tubes. Poke 2 - 4 holes into the caps of the plastic tubes with a thin needle. Rapid freeze the samples using liquid nitrogen and then lyophilize them overnight.\n\tNOTE: The dried samples can be stored for several days at RT. Replace a cap without holes for longer storage.\n7. Fluorescent Labeling\nRe-suspend the dried samples in 10 µL 120 mM TFA solution and add 50 µL DMB solution. Transfer samples into dark 1.5 mL tubes to protect them from ultraviolet light.\nFor standards, dissolve 1 µL Neu5Ac (60 ng/mL, in water) or 1 µL Neu5Gc (60 ng/mL, in water) in 10 µL 120 mM TFA solution in dark 1.5 mL tubes. Add 50 µL DMB solution.\nIncubate the cell membrane samples and the standards for 1.5 h at 56 °C protected from light. After incubation, add 4 µL 400 mM NaOH solution to each sample to stop the labeling reaction.\n8. HPLC Analysis\nNOTE: Labeled samples are analyzed on a HPLC system equipped with a C18 RP column (110 Å, 3 µm particle size, 4.6 x 150 mm), a fluorescence detector, and a fraction collector. The solvents used are methanol, acetonitrile, and water. Make sure to degas all solvents prior to the measurements, if the HPLC system lacks an internal degasser.",
    "Set the temperature of the column to 40 °C and configure the fluorescence detector with 373 nm for excitation and 448 nm for emission, respectively. Inject 10 µL sample volume and separate the probes for 50 min at 0.5 mL/min flow rate with methanol/acetonitrile/water (6:8:86) as the eluent. For mass spectrometry analysis, collect the peaks of interest.\n\tNOTE: Neu5Gc is expected to eluate after 6-8 min, Neu5Ac after 9 - 12 min, Neu5Prop after 17 - 23 min, and Neu5But after 38 - 44 min. The fractionated samples can be stored for several h at 4 °C protected from light.\nAfter measuring each sample, wash the column for 7.5 min at 1.0 mL/min flow rate (≈ 1.5 column volumes) with methanol/acetonitrile/water (6:25:69) and re-equilibrate the system for 7.5 min at 1.0 mL/min flow rate with methanol/acetonitrile/water (6:8:86).\nFor quantitative analysis, calculate the area under the curve of the sialic acid peaks of interest using the operating software of the respective HPLC-system22.\n\tNOTE: Obtained data can be related to the Neu5Ac or the Neu5Gc standard and to the measured protein concentrations in the cytosolic fractions (see section 5.1).\n9. Mass Spectrometry Analysis of Sialic Acid Monosaccharides\nNOTE: HPLC retention peaks of interest can be further analyzed by liquid chromatography (LC) electrospray-ionization mass spectrometry (ESI-MS), in order to verify the unnatural sialic acid species.\nFor mass spectrometry analysis, inject 20 µL of collected sample into a LC/Mass Selective Detector (MSD) system with 79.9% methanol, 20% isopropyl alcohol, and 0.1% formic acid as eluent, 0.5 mL/min flow rate, 4 kV capillary voltage, and 350 °C capillary temperature22,23.\nIn the evaluation software of the respective LC/MSD system, select the peak of interest in the total ion chromatogram. View the mass spectrum of the resolved peak. Display the positive mass/charge ratio between 300 and 700.",
    "NOTE: DMB labeling of sialic acids leads to an increase in the molecular mass of 116.2 g/mol. The DMB-labeled sialic acid species have the following molecular masses: DMB-Neu5Ac = 424.2 g/mol, DMB-Neu5Gc = 441.8 g/mol, DMB-Neu5Prop = 436.2 g/mol, DMB-Neu5But = 453.2 g/mol. Common adducts are acetonitrile, sodium, or isopropyl alcohol.\n10. Western Blot Analysis of Polysialic Acid in Kelly Neuroblastoma Cells\nPreparation of cell lysates\nAdd 1 mL Western blot lysis buffer to the cell pellets from step 3.3 and vortex. Incubate for 30 min on ice. Vortex every 5 min.Centrifuge the samples for 1.5 h at 20,000 x g and 4 °C. Collect the supernatant containing the proteins from the lysed cells.\nDetermine the protein concentration of the protein fractions, e.g., the Bradford or the BCA assay. Dilute the samples to a protein concentration of 1.5 µg/µL in lysis buffer.\nPrepare the samples for the SDS-PAGE by adding 10 µL Laemmli sample buffer to 90 µL protein fraction (1.5 µg/µL) and boil the sample for 5 min24.\nImmunoblotting\nUse 8% SDS-acrylamide gels with 20 - 30 µL pockets and 0.75 or 1 mm thickness. Run the gel at 25 mA for 2 h at RT.\nCarefully remove the glass cover from the gel. Cut out and discard the upper part of the gel containing the loading pockets. Place the gel on a nitrocellulose membrane (0.2 µm), previously soaked in Western blot buffer. Transfer the proteins to nitrocellulose according to the recommendation of the system (e.g., 250 mA for 1 h at 4 °C).\nRemove the nitrocellulose membrane from the blotting system. Stain the blot with Ponceau red to visualize the proteins. Transfer the nitrocellulose membrane into a plastic chamber and add 10 mL blocking solution. Incubate for 1 h at RT or overnight at 4 °C.",
    "Decant the blocking solution and add monoclonal anti-polySia 735 antibody (1 µg/mL) in PBS. Incubate the membrane for 1 h at RT or overnight at 4 °C. After incubation, wash the membrane at least three times for 5 min with PBS.\nAdd polyclonal anti-mouse IgG secondary antibody (1 µg/mL) coupled to horseradish peroxidase (HRP) or a fluorescent label in PBS. Incubate the membrane for 1 h at RT. After incubation, wash the membrane at least three times for 5 min with PBS.\nTransfer the membrane onto a plate of an appropriate imager. Detect the signal according to the manufacturer's instructions.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}