{
  "id": 11149,
  "origin_website": "Jove",
  "title": "Computerized Adaptive Testing System of Functional Assessment of Stroke",
  "procedures": [
    "This study protocol was approved by a local institutional review board, and all patients gave informed consent.\n1. Development of the CAT-FAS\nRetrieve the secondary and encrypted data from the FAS study14 to conduct simulations (Supplementary File 1: Appendix 2).\n\tNOTE: In the study, a total of 301 patients were recruited froma rehabilitation ward of a medical center and assessed at 14 d after stroke onset. Among the 301 patients, 262 patients were repeatedly assessed at 30 d after stroke onset. The study recruited patients who had (1) a diagnosis of stroke, (2) first onset of stroke, (3) onset of stroke within 14 d before hospitalization, (4) the ability to follow commands, and (5) the ability to give informed consent personally or by proxy. Patients who had other major diseases were excluded. In each assessment session, patients were assessed with the FM, PASS, and BI by a well-trained occupational therapist (Supplementary File 1: Appendices 3-5).\n\t\nEstablish the item bank of the CAT-FAS by adopting the item bank of the FAS (Supplementary File 1: Appendix 2A).\n\t\tNOTE: The item bank has sufficient items fit the Rasch partial credit model15,16 and covers a wide range of item difficulties. The item bank contains 58 items (Supplementary File 1: Appendix 3) selected from the FM-UE (26 items), FM-LE (11 items), PASS (12 items), and BI (nine items).\nRetrieve the item difficulties of all items in the item bank from the FAS study (Supplementary File 1: Appendix 2A - Item difficulty).",
    "NOTE: Each item in the item bank has a set of parameters to depict the difficulty of the item (i.e., item difficulties), which are estimated by the Rasch partial credit model. The CAT-FAS uses the item difficulties to (1) select items with difficulties tailored to the examinee's level of function (step 1.3.3) and (2) estimate the examinee's level of function (step 1.3.5).\nRetrieve each patient's responses (e.g., 0, 1, or 2 points) to the items of the item bank of the FAS (Supplementary File 1: Appendix 2B).\n\t\tNOTE: In previous studies14, all items of the item bank of the FAS were administered to the patients. In this simulation study, these responses of the patients were retrieved and used as the simulated responses (patients were not administered by the CAT-FAS) to the items of the CAT-FAS (step 1.3.4).\nRetrieve the ability distribution (i.e., the standard deviation [SD] of the scores) of the patients in the four functions (BADL, postural control, and UE/LE motor functions; Supplementary File 1: Appendix 2C).\n\t\tNOTE: The abilities of the patients in the four functions are the final scores of the assessment of the item bank (Supplementary File 1: Appendix 2C). The scores (and SD of the scores) of the four functions are estimated in a previous study14 by the Rasch partial credit model, based on the patients' responses to each item (step 1.1.3). In this study, the SD of the scores is retrieved and used as prior information to calculate the reliability of the CAT-FAS (step 1.3.6).\nDetermine the operational algorithms of the CAT-FAS (Supplementary File 1: Appendix 7).\n\t\nAdopt the maximum a posteriori (MAP) method for estimating each patient's scores of the four functions with Newton-Raphson iteration17.",
    "Use the criterion of D-optimality for the item selection18. An item with the maximum determinant of the Fisher information matrix is selected from the item bank for administration.\nAdopt 10 candidate sets of stopping rules for exploring the properties of the CAT-FAS via simulation (Supplementary File 1: Appendix 8).\n\t\tNOTE: The first five candidate sets are \"reaching limited reliability increase (LRI) criterion\" (i.e., an LRI < 0.001, < 0.005, < 0.010, < 0.015, or < 0.020). The other five candidate sets are \"reaching either LRI criterion or threshold of reliability\" (i.e., a Rasch reliability ≥ 0.90, paired with the aforementioned five LRI criteria). The LRI and threshold of reliability are frequently adopted stopping rules in CATs13,17.\nExplore the measurement reliability and efficiency (number of items needed for administration) of the CAT-FAS via steps 1.3.1 to 1.3.11 of simulation (Figure 1).\n\tNOTE: Supplementary File 1: Appendix 9 shows the screenshot of the software.\n\t\nUse a specified set of stopping rules (i.e., from the first to the last candidate sets of stopping rules which are in step 1.2.3, successively) to explore the properties of the CAT-FAS (Figure 1A).\nSet the initial CAT-FAS scores of the four functions (BADL, postural control, UE motor function, and LE motor function) to 0 for specified patients (i.e., from the first to the last patient in the data, successively; Figure 1B,C).\nAdaptively select an item with the maximum determinant of the Fisher information matrix (i.e., the criterion of D-optimality) from the item bank for administration (Figure 1D).",
    "NOTE: The information matrix of each item is calculated based on a patient's scores of the four functions and the item's difficulty (from step 1.1.2). To ensure that the CAT-FAS administers at least one item in each function/domain, the first four items of the CAT-FAS are selected from the four functions.\nObtain the patient's response to the selected item from step 1.1.3 (Figure 1E).\nSimultaneously estimate the CAT-FAS scores (and standard errors [SEs] of the scores) of the four functions using the MAP method with an iterative Newton-Raphson process (Figure 1F).19 During the iterative Newton-Raphson process, renew the scores and SEs of the four functions in each iteration until the criterion of convergence is met. Convergence occurs when the differences in scores between two consecutive iterations are <0.001.\nCount the number of items which are administered, save the latest renewed CAT-FAS scores (and SEs), and calculate the individual-level Rasch reliability of each function using the following formula:\n\t\t1 - ([SE2 of step 1.3.5] / [SD2 of the scores of step 1.1.4]).\nCalculate the LRI using the last renewed individual-level Rasch reliability (step 1.3.6) minus that of the previous estimation (Figure 1G).\nCheck whether the specified set (e.g., the first candidate set) of stopping rules is met (Figure 1H). If not, repeat steps 1.3.3 - 1.3.8 until the specified set of stopping rules is met. If so, save the latest renewed CAT-FAS scores (and SEs) as the final CAT-FAS scores (and SEs).\nRepeat steps 1.3.2 to 1.3.8 until all patients' administrations are completed (Figure 1I).\nFinish the simulation of the CAT-FAS with the specific set of stopping rules and save the results of the simulation (Figure 1J).",
    "NOTE: The results should include (1) the final CAT-FAS scores (and SEs) of the four functions, (2) the number of items needed to complete the CAT-FAS, (3) the Rasch reliability of each patient (i.e., individual-level Rasch reliability), and (4) the average Rasch reliability of all patients.\nRepeat steps 1.3.1 to 1.3.11 to explore the properties of the CAT-FAS with other candidate sets of stopping rules until all candidate sets of stopping rules are explored (Figure 1K).\nSelect the final set of stopping rules for the CAT-FAS according to the average Rasch reliability of ≥0.90 in at least three functions and the average items of administration of ≤10.0.\nDevelop an online administration platform for the CAT-FAS by writing a computer program to establish a website (Supplementary File 1: Appendix 10).\n2. Administration of the CAT-FAS\nConnect the examiner's electronic device (e.g., personal computer, tablet, or smartphone) to the online administration platform of the CAT-FAS using an internet browser.\nLog in to the administration system (Supplementary File 1: Appendix 11).\nClick Data management to access data from previous examinees (Supplementary File 1: Appendix 12).\nClick New examinee to create an account for a new examinee by entering the examinee's name and ID number.\nSelect an examinee and click Start (Supplementary File 1: Appendix 13).\nClick New assessment to create a new assessment or click Results to review the results of the examinee's previous assessments.\nAdminister the items shown on the screen to the examinee (Supplementary File 1: Appendix 14).\nRate the examinee's performance or responses by clicking the rating scale shown at the bottom of the screen(Supplementary File 1: Appendix 14).",
    "Explain the results of the CAT-FAS to the examinee, including the T-scores with a 95% interval, the percentile ranks of the T-scores, and the reliabilities of the four functions of the CAT-FAS. These results are calculated and shown automatically by the CAT-FAS (Supplementary File 1: Appendix 15).\nClick OK and return to the Data management page.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}