{
  "id": 6401,
  "origin_website": "Bio",
  "title": "I Plate-based Assay for Studying How Fungal Volatile Compounds (VCs) Affect Plant Growth and Development and the Identification of VCs via SPME-GC-MS",
  "procedures": [
    "I plate assay (Figure 1)Use a sterile 10 µl pipette tip to streak V. dahliae stock on 0.5x PDA (Recipe 1) plate in a zigzag pattern and incubate at 22 °C for 10 days. Surface sterilize A. thaliana seeds as follows:Add 1 ml 95% ethanol to a 1.7 ml microcentrifuge tube containing seeds, vortex, and incubate for 1 min.After removing ethanol, wash once with sterile MilliQ water and discard the water.Add 1 ml 6% sodium hypochlorite solution, vortex, and incubate for 15 min by shaking at 100 rpm.Wash twice with sterile MilliQ water after removing the sodium hypochlorite solution.Incubate seeds in 1 ml sterile MilliQ water at 4 °C in darkness for 3 days. Prepare square plates with MS agar (Recipe 2) and slice the medium into 10 x 10 mm pieces using a sterilized scalpel with blade #10.Hold one seed at the tip of a 10 µl micropipette using suction and then release the seed onto each agar piece. Seal the plate with two layers of Parafilm and place in a plant growth chamber set at 22 °C, 12 h light (4,500 lux, 60 μmol photons m-2 s-1), and 60% relative humidity for 7 days.Prepare I plate by adding 8 ml MS agar to one compartment and 8 ml 0.5x PDA to the other compartment. Transfer five A. thaliana seedlings (similar in size and growth stage) along with attached agar piece to the MS side of I plate using a sterilized scalpel with blade #10.Use a heat-sterilized cork borer to generate culture plugs along the actively growing margin of V. dahliae culture and place one plug (upside down) to the far end of the PDA side of I plate using a sterilized scalpel with blade #11.",
    "Seal the inoculated I plate with two layers of Parafilm and place in a plant growth chamber for a designated amount of time for each experiment (see Li et al., 2018b for specific examples).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190214/20190214015347_3510.jpgFigure 1. Workflow of the I plate-based assayExtraction of VCs produced by V. dahliae (Figure 2)Inoculate a plug of V. dahliae culture on 8 ml PDA slant in a 15 ml clear glass vial. Seal the vial with Parafilm. Incubate at 22 °C until the culture fully covers the surface of PDA slant, which typically takes 8 days.Replace Parafilm with a screw cap containing PTFE/silicone septum and incubate for one day.Condition the SPME fiber before VC extraction by placing the SPME needle into the GC injection port set at 230 °C for 1 h.Insert the conditioned SPME fiber in the injection port and starting the GC temperature program shown in Table 1. Desorb the fiber for 5 min in the injection port. Retract the fiber and remove the needle after 5 min and check resulting chromatograms when the program is completed. The intensity of background peaks (= blank sample) should be very low. Otherwise, repeat the desorption of the fiber. Extract VCs for 1 h by leaving the SPME fiber in the headspace of sampling vial. Use a flexible-arm electrode holder to lock the position of the SPME fiber holder so that the insertion depth of fiber is uniform for all extractions. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190214/20190214015433_5964.jpgFigure 2. Workflow of volatile compound extractionTable 1. Conditions for gas chromatography-mass spectrometry analysisimgsrc:https://en-cdn.bio-protocol.org/attached/image/20190214/20190214015547_1717.jpgGC-MS analysis of extracted VCs (Figure 3)Analyze the extracted VCs using a GC-MS system (manual injection mode, Figure 3A) by following the conditions described in Table 1. Insert the SPME needle into the GC injection port immediately after retracting it from each sampling vial.",
    "Desorb VCs bound to the SPME fiber for 5 min. An Rtx-Wax capillary column is used as it exhibits better retention and separation of polar VCs. Place the fiber in the GC injection port for 20 min for desorption before extracting another sample of VCs.Analyze C7-C30 saturated alkane standards using the automatic sample injection mode (Figure 3B). Connect the AOC-20i auto injector to the GC injection port. Place a 1.5 ml sample vial containing 0.5 ml solution of standards (1:50 dilution with n-hexane) on the rack of the auto injector. Inject 1 μl solution into the GC-MS system and analyze using the same column and conditions (Table 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190214/20190214015456_4047.jpgFigure 3. Gas chromatography-mass spectrometry analysis. A. Extracted volatile compounds (VCs) from V. dahliae were analyzed via the manual injection mode. B. Alkane standards were analyzed using the automatic sample injection mode."
  ],
  "subjectAreas": [
    "Microbiology",
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}