{
  "id": 2123,
  "origin_website": "Cell",
  "title": "Microfluidic platform for spatially segregated experimental evolution studies with E. coli",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nBacterial cell culture\nTiming: 2 days\nStreak −80°C frozen stock containing strains of interest onto non-selective, nutrient-rich (e.g., Luria-Bertani) agar plates for isolation (Figure 3[href=https://www.wicell.org#fig3]A).\nIncubate plates aerobically for 1 day at 37°C.\nPrepare at least four tubes for one control group and three test populations (Recommend more than three biological replicates).\nUsing a sterile loop or swab, select a single colony to add to each test tube containing 5 or 10 mL of sterile growth media (Figure 3[href=https://www.wicell.org#fig3]B).\nIncubate in a shaker at 250 rpm at 37°C.\nMeasure OD600 values of cultures and convert them to the colony-forming unit (CFU) counts/mL using a standard curve as different microbial species can have different sizes.\ntable:files/protocols_protocol_1605_1.csv\nDilute with fresh growth media to achieve the desired lambda (λ), representing the average number of cells in each microdroplet (Figure 3[href=https://www.wicell.org#fig3]C).\nNote: One or fewer cells are encapsulated in each microdroplet when the λ value is significantly lower than 1 thereby reducing clonal interference. At λ >1 encapsulated cells compete for resources and favor success of the faster growing variants. At λ< 1, more evolutionary trajectories can be maintained as slower growing phenotypes will not be readily eliminated by competition within the microdroplet. The experiment can thus be tuned for more or less clonal interference by altering λ and provides yet another controllable parameter for the investigator.\nPrepare at least four populations of 2 mL growth media containing the desired number of cells to 50-mL conical-bottom tubes.",
    "Critical: Maintain the same λ value during experimental evolution to eliminate the effects of λ change on the evolutionary trajectories. We typically maintain the starting population of ∼2.6×106 CFU mL-1 of E. coli in microdroplets of 247 ± 3.5 μm for ∼20 λ. The average number of cells per microdroplet used was ∼20. The choice of λ determines the extent of clonal interference within each microdroplet. Values of λ significantly less than 1 will dramatically decrease clonal interference and may allow the investigator to identify more evolutionary trajectories than higher values in which different variants within a microdroplet will compete against each other for resources based largely on growth rate. The number of cells in a microdroplet can be derived from the Poisson distribution, as P(X = x) = λxe-λ/x!, where P is the probability of finding x cells per microdroplet and the parameter λ is the average number of cells per microdroplet which is calculated by multiplying the cell concentration by microdroplets volume.",
    "Emulsions of microfluidic generated microdroplets can provide spatially segregated micro-environments in experimental evolution. Microorganisms of interest can be trapped within a microemulsion. One milliliter of emulsion contains millions of microdroplets (e.g., size 90 μm and volume ∼380 pl) and thus, each milliliter can be thought of as having millions of individual bioreactors. We use an iterative cycle of encapsulation, adaptation/selection, and decapsulation followed by deep sequencing of the populations to identify genetic changes associated with antibiotics of interest. Figure 2[href=https://www.wicell.org#fig2] shows schematic diagrams of the geometry of microdroplets-based microfluidic and the protocol of serial propagation in the emulsion for experimental evolution. A flow-focusing geometry in a microfluidic chip consists of two microchannels (100 μm wide) for a dispersed phase and one microchannel (200 μm wide) for a continuous phase converging into the main microchannel (200 μm wide) for two-phase microdroplet flows. The height of all microchannels is 80 μm.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1605-Fig2.jpg\nFigure 2. Microdroplets-based microfluidic platform for experimental evolution for identification of antimicrobial biomarkers or the production of synthetic ecologies for use in multi-species studies\n(A) Encapsulation process: Antibiotic susceptible cell is compartmentalized in the desired size of microdroplets with an appropriate antibiotic concentration. Representative optical microscopy images of monodispersed microdroplets immediately after the junction and in the observation chamber are shown in the inset (Scale bar: 200 μm).",
    "(B) Iterative culturing, selection, and amplification process: An optical micrograph of the compartmentalized model organism (Escherichia coli) after the incubation process is shown in the inset (Scale bar: 200 μm). For propagating the emulsion, the microdroplets are broken after incubation, and the cells are diluted in fresh media before inoculating into new emulsion microdroplets containing higher antibiotic concentrations. After dilution, if 5 resistant variants are encapsulated in new microdroplets, then these can multiply once again. Through this repeated series of processes, the evolved resistant mutants increase in frequency with each iteration.\n(C) Applications of microdroplets-based experimental evolution: Optical microscopy images of compartmentalized Pseudomonas aeruginosa, Streptomyces venezuelae, and fluorescence microscopy images of encapsulated green and red fluorescent proteins labeled P. aeruginosa and S. venezuelae and their co-encapsulation after the incubation process are shown in the inset (Scale bar: 100 μm).",
    "Founder cells are encapsulated in a water-in-oil emulsion system that includes the antibiotic. While the initially inoculated cells are reproduced within microdroplets, mutant cells that are resistant to an antibiotic are evolved. After incubation under appropriate conditions, the resistant cell multiplies to reach the carrying capacity of the microdroplet while the others may not grow at all or to a much lower density in the presence of antibiotics. In this highly simplified illustration, only 12 microdroplets are shown for simplicity on day 1. The microdroplets are broken for propagating the emulsion, and the cells are diluted in fresh media before inoculating into new emulsion microdroplets containing higher antibiotic concentrations. After dilution, if 5 resistant genotypes are encapsulated in new emulsion microdroplets, then these can multiply once again. This cycle is then repeated, and the more resistant genotypes will increase in frequency with each iteration. At the end of the experiment, deep sequencing of the entire population and individual endpoint isolates will identify the genes associated with resistance to antibiotics. This section describes step-by-step instructions of cell encapsulation for one control and five biological replicates using prepared bacterial cell liquid cultures and microdroplet generators in the previous step as outlined in Figure 3[href=https://www.wicell.org#fig3].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1605-Fig3.jpg\nFigure 3. Schematic illustration of the workflow\nSchematic overview of the workflow in the protocol for preparation of cell suspension, including (A) streaking glycerol stock to an agar plate; (B) selection of a single colony to add to each test tube; and (C) dilution with fresh growth media to achieve the desired lambda (λ); cell encapsulation, including (D) microdroplets collection; iterative culturing, selection, and amplification process, including (E) decapsulation; and (G) selection of evolved isolates in microdroplets-based experimental evolution\nCell encapsulation\nTiming: 10–35 min\nTransfer each prepared population to a 3-mL sterile syringe in a biosafety cabinet.",
    "Prepare six 3-mL sterile syringes containing 2 mL of fluorinated oil with 1.5% (wt/wt) fluorinated surfactants.\nAffix one end of PTFE tubing to a sterile syringe needle and another one to the inlet of the PDMS microdroplets generator.\nLoad twelve 3-mL sterile syringes to a twelve-channel programmable syringe pump.\nStart infusing with 100 μL min-1 of both flow rates for cell suspension and the continuous oil phase.\nNote: Using parallelized six microfluidic chips, 247 ± 3.5 μm of the average diameter value with a standard deviation of microdroplets is generated for each population.\nCritical: Should confirm the size of microdroplets under the microscope before the operation in a biosafety cabinet. See Video S1[href=https://www.wicell.org#mmc2]. Recorded highly homogeneous microdroplets with a high-speed camera attached to an inverted microscope with a 10× objective lens, related to step 10. Troubleshooting 5[href=https://www.wicell.org#sec5.9]. The ImageJ software, an open-source image processing program, can be used for analyses of microdroplet diameters. After collecting microscopy images of more than 50 microdroplets, their projected areas were used to calculate the diameters of microdroplets because they are an elongated shape when the diameter of microdroplets is longer than the wide or depth of the microchannel. Histograms of the microdroplet diameters are then made for evaluation. The average diameter values with standard deviations of microdroplets are accurately determined by fitting Gaussian or Lorentzian models to the histograms.\nCollect ∼2.0 mL of emulsions (1.0 mL of microdroplets) for each population to a 50-mL conical-bottom tube for 10 min (Figure 3[href=https://www.wicell.org#fig3]D).\nNote: The production rate of parallelized six microfluidic chips is 36 mL/h which is equivalent to 4.6×106 microdroplets/h (production rate of the individual chip is 6 mL/h, 7.6×105 microdroplets/h).",
    "Critical: In our optimal microdroplets-incubation method, we achieved a comparable bacterial growth rate within microdroplets compared to a flask, which was shaken for 24 h at 37°C using an orbital shaking incubator (calculation based on E. coli).\n    Your browser does not support HTML5 video.\n  \nVideo S1. Recorded highly homogeneous microdroplets with a high-speed camera attached to an inverted microscope with a 10× objective lens, related to step 10\nIterative culturing, selection, and amplification process\nTiming: Variable\nWe have optimized multiple parameters in this protocol, including the microdroplets incubation method, and selection strengths, which are the gradient of the daily controlled concentration of antibiotics to select evolved resistant mutants.\nIncubate microdroplets containing E. coli at 37°C for 24 h.\nCarefully transfer ∼1.0 mL of microdroplets onto the oil surface from an old 50-mL conical-bottom tube to a new 1.5-mL Eppendorf tube for each population using a pipette.\nCritical: Used fluorinated oil containing 1.5 w/w% fluorinated surfactants can be recycled several times following filter sterilization through a 0.22 μm filter. Troubleshooting 5[href=https://www.wicell.org#sec5.9].\nOptional: Use a sterile capillary tube to take microscopy images of microdroplets after incubation. Recommend using a capillary tube with a path length similar to microdroplets’ diameter for a clear image as the morphology of microdroplets can be distorted by smaller path lengths.\nAfter adding 250 μL of 1H,1H,2H,2H-perfluoro-1-octanol (PFO) to 1.0 mL of microdroplets, gently mix to break microdroplets by tapping a 1.5-mL Eppendorf tube with a finger for 30 s (Figure 3[href=https://www.wicell.org#fig3]E). Troubleshooting 6[href=https://www.wicell.org#sec5.11].\nNote: PFO can cause skin irritation and serious eye irritation. Use it only in a fume hood or a biosafety cabinet with appropriate laboratory clothing.\nLeave the tubes in a biosafety cabinet for 5–10 min.\nNote: When microdroplets are completely broken, the interface between oil and growth media containing E. coli becomes clear.",
    "Pipette 100 μL of growth media containing E. coli for each population into each well of flat-bottom 96-well microplates. After measuring OD600 values of six populations using a microplate reader, calculate the volumes required for the desired λ in the next iteration.\nRepeat 6–15 with gradually increasing antibiotic concentration until it reached four-fold of the antibiotic’s clinical breakpoint (Figure 3[href=https://www.wicell.org#fig3]F). Troubleshooting 7[href=https://www.wicell.org#sec5.13].\nNote: Each population is diluted to the fresh media containing a higher concentration of antibiotics and the populations are not mixed at this step.\nCritical: When the density of E. coli is 1.71×108 CFU mL-1 after incubation, ∼1.5% of dilution factor was used to get 2.6×106 CFU mL-1 of the starting population for the next iteration. The volume required for the serial propagation of a microbial population is variable depending on the growth kinetics of the organism within microdroplets and antibiotic concentration.\nMix 200 μL of collected cell suspension with 66.7 ul of 80% (vol/vol) sterile glycerol (20% (vol/vol) final concentration).\nPrepare two glycerol stock solutions for each population, one for daily deep metagenomic sequencing from whole-community samples and another for storage.\nStore the glycerol stock solutions at −80°C.\nOn the last day of experimental evolution when the concentration of antibiotics has reached the target maximum concentration, spread each population onto non-selective, nutrient-rich (e.g., Luria-Bertani) agar plates for the selection of evolved isolates following appropriate dilution (Figure 3[href=https://www.wicell.org#fig3]G).\nRandomly select a single colony to add to each test tube containing 5 or 10 mL of sterile growth media using a sterile loop or swab (Recommend more than three colonies per population).\nPerform Minimum Inhibitory Concentration (MIC) test for endpoint isolates followed by preparing two glycerol stock solutions for each endpoint isolate and storing them at −80°C."
  ],
  "subjectAreas": [
    "Microscopy",
    "Cell Biology",
    "Microbiology",
    "Evolutionary Biology",
    "Sequencing"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}