{
  "id": 12216,
  "origin_website": "Jove",
  "title": "Practical Considerations in Studying Metastatic Lung Colonization in Osteosarcoma Using the Pulmonary Metastasis Assay",
  "procedures": [
    "All animal protocols from which imaging data were obtained were performed with approval of the Animal Care and Use Committee of the National Cancer Institute, National Institutes of Health. All animal protocols discussed and portrayed in the article video have been approved by the University of British Columbia Animal Care Committee.\n1. Preparation of tumor cells for injection and materials for the PuMA model\nNOTE: The amount of solutions and cells will be enough for 1 mouse. Scale up as necessary if more mice are used in the study. For media recipes, refer to Table 1 and Table 2.\nPre-warm 5 mL of A-Media in a 15 mL conical tube in a 37 oC water bath.\nMelt the 1.2% low melting agarose solution (in sterile water) using the lab microwave.\nTransfer 5 mL of the molten agarose into a 15 mL conical tube, and keep warm in a 37 oC water bath. Ensure the melted agarose is at 37 oC and liquid prior to the lung insufflation step.\nPre-chill 30 mL of cell-culture grade PBS supplemented with 1X pen/strep in an ice bucket.\nIn one well of a 6-well plate, pre-soak a gelatin sponge in 1.5 mL of B-media. The sponge will be the support anchor for the lung slices.\nEnsure the OS cells are about 70-90% confluent on the day of the procedure. Do not use cells that are over-confluent or if the media is orange to yellow since the cells are usually stressed and have diminished viability at this point. For the osteosarcoma cell lines, MNNG and HOS, 5 x 105 in a volume of 100 μL will be used to inject into the tail vein of 1 mouse. Upscale accordingly if more mice are used for the study.",
    "Harvest the tumor cells using 0.25% trypsin-EDTA (3 mL for a T75 flask or 2 mL in a 10 cm culture dish). When cells are beginning to lift off the plate, neutralize the trypsin-EDTA with complete media. Spin down cells and rinse once with cell-culture grade PBS. Resuspend pellet in 5 mL of PBS.\nPerform a cell count by standard methods. It is best to make more cell suspension than what is actually needed since loss of cell suspension often occurs during needle draw-up and failed injection attempts.\nPerform a Trypan-Blue Exclusion Assay on a sample of the cell suspension to assess the viability of the cells. Proceed only if the cell show 90% viability or higher.\nInject 5 x 105 cells in a volume of 100 μL. To prepare an excess of 2X of this amount, 1 x 106 cells should be spun down and resuspended in 0.2 mL of HBSS.\nPlace cell suspension in an ice bucket while preparing the mice for injection.\n2. Tail Vein Injection and Lung Insufflation\nNOTE: The amount of solutions and cells in this section will be enough for 1 mouse. Scale up as necessary if more mice are used in the study. For a list of the equipment, materials and surgical instruments used in the following steps, refer to Table 3 and Table 4.\nWarm a female mouse (age 6-8 weeks) under a heating lamp for 5 min in order to make their tail vein more visibly apparent. For murine K7M2 or K12 cells, use Balb/c mice; for human MG63.3, MG63, MNNG, and HOS cells, use severe combined immunodeficiency mice.",
    "Make sure the cell suspension is uniform by gently shaking the tube. Carefully draw up the cell suspension into the 1 mL syringe without the needle. Cap the syringe with a 27 gauge needle. Make sure the needle bevel is on the same side as the volume markings on the needle.\nPlace the mouse in the restrainer, and swab the tail with an alcohol wipe.\nProceed to perform a tail vein injection and inject the 100 μL of the cell suspension. 5 min after the injection, place the mouse in a CO2 chamber and begin the euthanasia standard operating procedure (as outline by your institutional animal care committee). Cervical dislocation should not be used as a means of euthanasia since the procedure will damage the trachea.\nOnce the mouse is euthanized, begin preparation of the laminar flow hood for insufflation of the mouse lung with the agarose/A-media solution. Within the laminar flow hood, set up a work area with your sterile pad. Onto this pad you will place your sterilized instruments, IV catheter, IV extension set, and gravity perfusion apparatus (see Supplemental Figure 1).\nPlace the mouse in dorsal recumbancy. With sterile small scissors, carefully dissect out the sternum to expose the chest cavity. Take care to not puncture the lung since an agarose/A-media solution will be used to insufflate the lung.\nWhen dissecting out the sternum, dissect past the thoracic inlet on both sides the trachea. Expose the trachea by dissecting away the surrounding soft tissue.\nCannulate the trachea with a 20 gauge IV catheter. Loosely tie a surgical knot using sterile catgut suture around the cannulated trachea.\nAttach an IV extension set from the catheterized trachea to the 10 mL syringe of the gravity perfusion apparatus.",
    "Combine the pre-warmed 37 oC agarose (5 mL) and A-media (5 mL) into a 1:1 mixture. Pour the liquid agarose/A-media solution into the 10 mL syringe of the gravity perfusion device. Prior to insufflation of lungs with agarose/A-media solution, ensure that the entire length of the extension set has been primed with agarose/A-media, thereby negating inadvertent insufflation of lung samples with air.\nFill the lung the agarose/A-media solution until the lung is fully insufflated.\nOnce the lung is fully insufflated, remove the cannula and firmly tie off the surgical knot to prevent leakage of the agarase/A-media solution through the trachea.\nProceed to dissect out the pluck (trachea, heart, and lung) from the chest cavity. Take care to not puncture or damage the surface of the lung.\nPlace the pluck (in no particular orientation) in the pre-chilled 30 mL of PBS supplemented with 1X pen/strep, and allow the agarose/A-media to solidify for 20 min.\nUsing fine scissors and tweezers, cut small pieces of the lung (3 mm x 1.5 mm) as shown in Figure 1A. Smaller lung slices can be easily imaged using a 2.5X objective. Multiple slices can be cut per experimental condition, typically 4-10 slices per group.\n\tNOTE: For each experimental group, place the lung slices into a separate well (6-well plate) containing a 2 x 2 cm gelatin sponge pre-soaked in B-media. The amount of media per well should be 1.5 mL. Change the media every 2-3 days. For drug studies, the frequency of changing the media/drug is user determined.\n3. Widefield Fluorescence Imaging of Lung Slices and Analysis\nNOTE: For widefield fluorescence imaging, smaller slices are cut (3 mm x 1.5 mm x 1 mm) in order to fit the lung section into 1 image using a 2.5X objective.\nImage acquisition on a widefield fluorescence microscope:",
    "Lung slices are typically imaged at 0, 3, 7, and 14 days post-injection. In the sterile environment of the biological cabinet, carefully transfer the lung slices from the gelatin sponges to a sterile 35 mm glass-bottom round dish. Take care to dab off the excess fluid from the lung slice as the excess fluid will act as a mirror and reflect fluorescent light coming from the tumor cells.\nArrange the lung slices in a similar manner depicted in Figure 1A. Each column would represent a different experimental condition. Take care to not cross-contaminate the lungs with the tweezers. Rinse with 70% ethanol and dry before handling lung slices from another experimental group.\nOptimize the imaging parameters (ie. gain, offset, exposure time, binning) that provides the best contrast between the fluorescent tumor cells and background lung tissue in the control (vehicle untreated) group. Use the same parameters from the control group to image the experimental groups. Save as tiff image format.\nFor a scale reference, take a digital picture of a micrometer at the same objective.\nSince lung auto-fluorescence changes over time, the imaging parameters must be adjusted to the control lungs each imaging session. The imaging parameters for one session may not necessarily be optimal for subsequent imaging sessions.\nImage Analysis:\nNOTE: The following image processing steps are done with ImageJ 1.51h software package 17.\nOpen an image file in ImageJ (Figure 3A).\nSubtract background: Process > Subtract Background > Rolling ball radius (start with 50 pixels), uncheck \"Light Background\" (Figure 3B).\nConvert image to 8-bit format: Image > Type > 8-bit (Figure 3C).\nSet units to pixels: Image > Enter \"Pixels\" in Unit of Length, enter 1 in \"Pixel width\", \"Pixel Height\", \"Voxel Depth\". Check \"Global\" box to apply to subsequent images.",
    "Using the Polygon selection tool, outline the shape of the entire lung slice and determine the area (pixel2) of the total lung slice. This value will be used to calculate the percent tumor burden of the lung.\nThreshold image: Image > Adjust > Threshold > highlight \"Default\" and \"B&W\" > use the slider to threshold the image such that the majority of tumor cells are accurately highlighted. Pressing \"Apply\" will result in a black and white image where the lung is all black, and the fluorescent lesions are white (Figure 3D). Pressing \"Apply\" a second time will invert the image where all fluorescent structures are now black shapes (Figure 3E).\nQuantification of the number and shape of lesions:\n\tAnalyze > Set Measurements > Check \"Area\". Uncheck all other boxes.\n\tAnalyze Particles > Size (pixel2): 0-infinity represents the range of shapes that ImageJ will enumerate. Empirically determine the smallest lesion that is deemed to be a single tumor cell in Day 0 vehicle images. Use the area of this single tumor cell as the lower limit for the remaining images in the data set. For the work presented in this paper, 11 pixel2 is set as the lower limit. For the work presented in the video example, 24 pixel2 is set as the lower limit. Leave \"Circularity\" range as 0-1. \"Show\" can be set to \"Nothing\". Alternatively, if \"Show\" and \"Outlines\" is selected, a drawing of all outlined shapes is generated. Check \"Display results\" for a separate window of measurements to pop up. Optionally, having \"Add to manager\" box checked will save all the shapes quantified to a ROI manager, which can be saved for future reference. After pressing OK, a \"Results\" window will pop up containing all enumerated shapes and area measurements (Figure 3F).",
    "Copy and paste the data from the \"Results\" window into a spreadsheet. Use the SUM mathematical function in Excel to sum all the areas of the metastatic lesions for that particular lung slice. To assess the percent lung tumor burden of lung slice, divide the sum of the areas of metastatic lesions by the total area of the lung slice. This parameter is also known as Area fraction (AA) which is described further by Underwood 18.\n\tLung tumor burden = Sum of metastatic lesion areas/total area of lung slice\nCalculate the lung tumor burden for the rest of the lung sections in control group and remaining groups. Plot the average lung tumor burden per group over 0, 3, 7 and 14 days. Representative widefield fluorescent pictures of high and low metastatic human OS cells growing in the PuMA model at progressive time points are shown (Figure 4A). A line graph showing the fold-change (normalized to Day 0) in percent metastatic tumor burden over time is shown (Figure 4B).\n4. Confocal Fluorescence Imaging of the PuMA Model\nNOTE: For confocal imaging, tissue processing is similar to that in the previous section except that larger lung slices are cut (complete transverse sections, 1-2 mm thick) to allow for more ROIs to be imaged.\nLabelling of lung parenchyma with DAR4M:\nImmerse lung slices in 10 μμM of DAR4M (in HBSS) for 45 min at 37 °C. DAR4M labels reactive nitrogen species within the cells of the lung.\nAfter 45 min of incubation, rinse the lung slices with fresh HBSS.\nPlace the lung slice in a 35 mm glass-bottom round dish, and image on the confocal microscope.\nThe imaging parameters for the example images shown in Figure 5 are listed in Table 5.",
    "Acquire a Z-stack for a region of interest. Use the suggested Z slice thickness for Nyquist sampling. A representative movie of a 3D stack showing green fluorescent OS cells in the DAR4M-labeled lung tissue is provided in Movie 1 and Supplemental Movie 1.\nFor the example confocal images shown in Figure 5, the imaging session was terminal. If longitudinal imaging is required, the use of a 2-photon or multi-photon equipped confocal LSM microscope for imaging is advised since there is less photodamage to living tissues19,20.\nImaging mito-RFP expressing MG63 cells in the PuMA model:\nPerform the PuMA protocol as outline in Step 1 and 2 with using MG63 cells expressing the mito-RFP construct.\nPlace the lung slice in a 35 mm glass-bottom round dish, and image on the confocal microscope.\nThe imaging parameters for the example images shown in Figure 6 are listed in Table 6. A representative movie of a 3D stack showing green fluorescent OS cells with red fluorescent mitochondria is provided in Movie 2 and Supplemental Movie 2.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}