{
  "id": 17920,
  "origin_website": "Jove",
  "title": "Application of Biochip Microfluidic Technology to Detect Serum Allergen-specific Immunoglobulin E (sIgE)",
  "procedures": [
    "This study and the use of human serum samples were approved by the Ethics Committee of The First Affiliated Hospital of Guangzhou Medical University (GYYY-2016-73). All participants have given their written consent independently or through their parents (in the case of children).\n1. Basic information of the study group\nNOTE: The Allergy Information Repository of the State Key Laboratory of Respiratory Disease (AIR-SKLRD) is a large serum bank established inside the Guangzhou Institute of Respiratory Hospital (GIRH). Initiated in the last decade, the AIR-SKLRD has already started to collect and store serum samples from patients with allergic diseases, together with their clinical information (Table 1)4,5. The current study was performed with sera from the AIR-SKLRD.\nSearch the AIR-SKLRD’s database for sera collected from January 2015 to June 2018 and select the patients with allergic disease, who were found to be sensitive to the common allergens in the region.\nEnsure that all selected patients have allergic-related diseases, such as allergic rhinitis and or asthma, allergic dermatitis, and/or urticaria, and that the serum of these patients contains multiple serum allergen-specific immunoglobulin E (sIgE) sensitizations of common allergens in this region, detected by the System 1.\nExclude patients with incomplete medical records, those lost to follow-up, those who refuse to give informed consent regarding the use of their serum samples for scientific purposes, those with an identified immunodeficiency, those currently on immunotherapy or immunomodulatory agents, or those found to have parasitic infections.\nEnsure no treatment or drug prescription was given prior to the serum collection so as to minimize interference to the laboratory findings. All serum samples that do not fulfill the criteria were rejected.\n2. Study flow and measurements of interest",
    "NOTE: The microfluidic system needs 100 µL of serum for determining 19 allergens. Venous blood (5 mL) was collected from each patient using a vacuum blood vessel containing separating gel. After centrifuging for 10 min at 1,000 x g, the upper layer was collected for testing. Unused serum was stored at -80 °C. Prior to testing, the serum was kept at room temperature for 30 min and was shaken with a vortex mixer. Repeated freeze-and-thaw cycles were avoided.\nPrimarily test the serum samples for sIgEs to whole allergens of Dermatophagoides pteronyssinus (d1), Dermatophagoides farinae (d2), Blomia tropicalis (d201), cat dander (e1), dog dander (e5), Bermuda grass (g2), timothy grass (g6), cockroaches (i6), Aspergillus fumigatus (m3), Candida albicans (m5), ragweed (w1), egg white (f1), milk (f2), wheat (f4), peanut (f13), soybean (f14), almond (f20), crab (f23), and shrimp (f24). Follow the instructions given in section 3.\n\tNOTE: sIgE determination was done with the allergen-specific IgE assay kit (see the Table of Materials) and measured by a chemiluminescence analyzer.\nRandomly select three samples from among the samples with enough serum (at least 900 µL) for a reproducibility study. Keeping all the conditions unchanged, measure the three sera for allergen sIgEs daily for 9 consecutive days (i.e., a total of 100 x 9 = 900 µL of serum).\n3. Semi-automation test procedure of the microfluidic system\nNOTE: The System 2 is the integration of automatic microfluidic technology, protein microarray, cold light analysis, parallel IgE analysis, and image processing technology. The testing protocol is divided into four parts: preparation of the equipment, sample loading, incubation, and measurement.\nPreparation of the equipment\nTurn on the PC and the analyzer power.\n\t\tNOTE: The power switch is on the left of the base.",
    "Start the LabIT program on the PC. If the Dark Frame warning window pops up, click OK to run LEAK Test. Afterward, click the center logo to enter the operation interface.\n\t\tNOTE: The system will remind the user to run LEAK Test if it is idle for more than 24 h.\nCheck the Reaction Temp and CCD (charge-coupled device) Temp at the lower right corner of the screen. The Reaction Temp should rise to 37 °C ± 1 °C in about 10 min, and the CCD Temp should drop to -15 °C ± 1 °C.\nRun the LEAK Test after the CCD Temp has dropped to -15 °C ± 1 °C. Before running the LEAK test, make sure there are no other items left inside the instrument and close the door. Click Tools | System Test | LEAK Test. Do not open the door during testing. When the test is finished, the report window will pop up.\nSample loading\nAdd 620 µL of wash buffer, 120 µL of blocking buffer, 60 µL of conjugates A and B, 60 µL of substrate A and B, and 100 µL of serum samples to the corresponding reagent tank on the microfluidic cartridge.\nIncubation\nClick on Cartridge ID, use the barcode scanner to scan the serial number of the cartridge, enter the sample ID, put the cartridge into the analyzer and close the door, and click Analyzer and Run to start the analysis.\nMeasurement\nExport the results to statistical software (e.g., Excel) after the measurement.\n\t\tNOTE: After 30 min of incubation, the analyzer automatically performs the measurement and reports the result.\nSwitching off of the analyzer\nFor routine maintenance, after finishing the test, remove the cartridge and wipe the analyzer’s internal heating iron and electromagnet lightly with 75% alcohol.",
    "NOTE: Do not press hard or shake the electromagnet.\nClose the LabIT window. The temperature monitoring window will pop up. It will automatically close when the CCD warms up to the 5 °C protection mode. By then, it will be safe to turn off the power of the analyzer and PC.\n\t\tNOTE: Do not manually close the temperature monitoring window before the CCD Temp has risen to 5 °C, and do not turn off the power of the analyzer nor the PC during the CCD warm-up.\n4. Definition of sIgE reactivity\nNOTE: For an undiluted serum specimen, the detection range of the System 2 is 0.21–100 IU/mL.\nBased on the threshold value of 0.35 IU/mL, consider an sIgE level exceeding 0.35 IU/mL to be positive6,7. Rate the reactivity of the sIgE tests as8: class 1 (≥0.35 and <0.70 IU/mL), class 2 (≥0.70 and <3.50 IU/mL), class 3 (≥3.50 and <17.50 IU/mL), class 4 (≥17.50 and <50.00 IU/mL), class 5 (≥50.00 and <100.00 IU/mL), and class 6 (≥100.00 IU/mL).\n5. Statistical analysis\nUse a histogram to show the positive rate of the 19 allergens (Figure 1) and use the Levey-Jennings curve to demonstrate the repeatability of the detection system (Figure 2)9.\nSelect the three most common inhalant allergens and food allergens (in total, six allergens) and compare the results to the I System 1 to evaluate its clinical diagnostic performance10,11. Include the concordance rate, sensitivity, specificity, positive and negative predictive values, and the area under the receiver operating characteristic (ROC) curve (AUC) as the evaluation criteria.",
    "Apply Spearman’s correlation analysis12 to describe correlations between the two systems and use kappa value for consistency. Categorize the kappa value as almost perfect (0.8–1.0), substantial (0.6–0.8), moderate (0.4–0.6), fair (0.2–0.4), or poor (<0.2)13. Use SPSS 23.0 and MedCalc 11.0 statistical analysis and define P < 0.05 as statistical significance.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}