{
  "id": 9879,
  "origin_website": "Jove",
  "title": "Expression, Purification, and Antimicrobial Activity of S100A12",
  "procedures": [
    "1. Expression of S100A12\nTransform competent BL21 DE3 cells with a pGEMEX-S100a12 plasmid using a standard heat shock protocol18. Add 1 to 5 µL of plasmid to 50 µL of bacteria in a microcentrifuge tube on ice. Incubate for 20 min.\nHeat shock the cells at 42 °C for 30 s.\nIncubate the cells on ice for 2 min.\nAdd 500 µL of SOC media to the cells. Incubate at 37 °C with shaking at 250 rpm on an orbital shaker for 1 h.\nPlate 150 µL of the transformation reaction on LB-agar medium (supplemented with 100 µg/mL ampicillin). Incubate for 12-16 h at 37 °C.\nPick one colony. Inoculate 2 mL of LB (supplemented with 100 µg/mL ampicillin).\nIncubate for 4-6 h at 37 °C on an orbital shaker (300 rpm). The OD600 should read between 1-3 absorbance units.\nAdd 500 µL of starter culture to 50 mL of ZYM-5052 autoinduction media26 supplemented with 100 µg/mL of ampicillin. For best aeration and maximum expression, use a 250 mL baffled Erlenmeyer flask. Shake (300 rpm) for 24 h, at 37 °C.\nTransfer bacterial suspension to a centrifuge tube. Pellet the cells by centrifugation (4,000 x g, 10 min) at 4 °C.\nDecant the media, log sample, and store cell paste at -80 °C. Sample is stable for years.\n2. Purification of S100A12 Using Low Pressure Chromatography\nResuspend cells in 30 mL of 20 mM Tris, pH 8.0.\nSonicate the suspension on ice to lyse cells. Use ~20 W output, 5 s on and 5 s off cycle for 5 min.\nTransfer the solution to high-speed centrifuge tubes. Clarify the cell lysate by centrifugation, 20,000 x g for 30 min at 4 °C.",
    "Decant the supernatant and transfer to a clean 100 mL polypropylene beaker. Cool the solution by placing the beaker on ice. Add a stir bar and slowly add 11.20 g of ammonium sulfate. Allow the solution to stir on ice for an additional 1 h. This will create a 60% solution of ammonium sulfate and precipitate most of the E. coli endogenous proteins. S100A12 will remain soluble.\nCentrifuge the solution at 4 °C, 20,000 x g for 20 min to pellet the precipitated protein.\nDecant the supernatant and transfer to dialysis tubing (MWCO 3,500 kDa). Dialyze against 1 L of 20 mM Tris, pH 8.0 at 4 °C. Change the dialysis buffer twice. Allow 4 h in between changes.\nAnion exchange chromatography\nPerform chromatography on a low pressure system. Typical flow rate is 1 mL/min.\nEquilibrate a 5 mL Sepharose column with 10 mL of 20 mM Tris, pH 8.0.\nLoad the ~40 mL of S100A12 solution using the sample pump (collect the flow through).\nWash the column with 10 mL of 20 mM Tris, pH 8.\nDevelop the column with a 0-30% gradient (Buffer B is 20 mM Tris, pH 8.0, 1 M NaCl) over 19 column volumes (CV, 95 mL). Collect 5 mL fractions.\nTake a 10 µL aliquot of each fraction and analyze using MES SDS PAGE with Coomassie staining. Run gel using constant voltage (20 V/cm) for 30 min.\nPool fractions containing S100A12. S100A12 runs at ~10 kDa protein on a denaturing gel.\nConcentrate fractions to 5 mL using an ultrafiltration device (MWCO 10 kDa). Centrifuge at 3,000 x g for ~8 min. Take the top fraction.\nSize-exclusion chromatography\nEquilibrate S75 column with 1 CV (120 mL) of 20 mM Tris pH 8, 100 mM NaCl.",
    "Inject < 5 mL of concentrated S100A12 fractions (from the ion exchange chromatography).\nDevelop the column at a flow rate of 1 mL/m over 120 mL. Collect 5 mL fractions.\nTake a 10 µL aliquot of each fraction and analyze using SDS PAGE with Coomassie staining. Validate protein identity using western blot or mass spectrometry (calculated molecular mass of monomeric subunit 10,575.0 Da, measured 10575.4 Da).\nPool fractions\nMeasure the absorbance of the protein A280 using a spectrophotometer. Use the SEC buffer as a blank. The calculated extinction coefficient for S100A12 homodimer is 5960 M-1 cm-1.\n\t\tNOTE: Typical yields are 35-45 mg of S100A12 per 50 mL of culture.\nAliquot S100A12 into 1.5 mL microcentrifuge tubes (1 mg/tube), flash freeze in liquid nitrogen and store at -80 °C.\n3. Antimicrobial Activity Assays\nStreak H. pylori strain G27 onto tryptic soy agar plates supplemented with 5% sheep blood (blood agar plates). Grow 2-3 days at 37 °C in room air supplemented with 5% carbon dioxide.\nInoculate H. pylori into Brucella broth supplemented with 1x cholesterol. Culture overnight shaking (250 rpm) at 37 °C in room air supplemented with 5% carbon dioxide.\nDilute H. pylori 1:10 into 50% Brucella broth, 50% calprotectin buffer plus 1x cholesterol and culture in medium alone or supplemented with 100 µM zinc chloride plus 0, 100 or 1,000 µg/mL of purified S100A12. Culture overnight shaking (250 rpm) at 37 °C in room air supplemented with 5% carbon dioxide.\nThe following day, perform serial dilutions and plate onto blood agar plates. Allow bacterial colonies to grow for 2-3 days at 37 °C in room air supplemented with 5% carbon dioxide. Enumerate the colony forming units to calculate bacterial growth in the presence or absence of S100A12 and/or exogenous zinc.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}