{
  "id": 11631,
  "origin_website": "Jove",
  "title": "Automated, Long-term Behavioral Assay for Cognitive Functions in Multiple Genetic Models of Alzheimer's Disease, Using IntelliCage",
  "procedures": [
    "All the procedures were approved by the institutional animal care and use committee, and they were carried out according to the RIKEN Brain Science Institute’s guidelines for animal experimentation.\n1. Setting Apparatus\nNOTE: An overview of the automated home-cage monitoring system is shown in Figure 1. Each system (39 cm x 58 cm x 21 cm) contains one microprocessor, and four corner chambers, each of which has two water bottles and a ring antenna for detecting radio-frequency identification of the transponders implanted into the animals (Figure 1A). The identification numbers of the microprocessor are defined by the rotary selector (hardware addresses) (Figure 1B). The identification numbers of the microprocessor should not overlap. Two doors in each corner are controlled by computers, which are used for the operant conditioning (Figure 1C). Typically, each cage can assess up to 12 mice (see Figure 2 as example of group housing). Using a larger number of mice is acceptable. However, one should ensure that the mice do not fight excessively and that they are not overcrowded when they perform strongly competitive tasks.\nConnect the cages to a computer serially via CAN cables.\nConnect the battery cables to the plugs in the microprocessor (Power-on). All LEDs should then be switched on for a few seconds and all the doors should move. If the LEDs do not switch off or if the doors do not move, unplug and replug the power cord (bad electrical connections may lead to improper functioning).\nEnsure that the sliding doors open and close correctly. If the doors do not move correctly, check the small magnets attached to the black arm. If this problem occurs frequently, consider gluing the magnet to the arm.\nContinue to check the conditions of the doors throughout the experiments (at least once per day).",
    "Turn on the PC.\n2. Software\nNOTE: All three components of software (\"Designer\", \"Controller\", and \"Analyzer\") for the automated home-cage monitoring system have been designed as graphical user interfaces (Figure 3). Users can easily control or add various functions during the experiment.\nMaking experiment files using the \"Designer\" \n\tNOTE: The \"Designer\" is used to generate and edit experimental files (programs on the system) for performing various experimental protocols and for testing the status of the system (Figure 3A). One experimental file embeds the animal list, hardware setting, and multiple experimental protocols. Users can also obtain published journal protocols by contacting the authors.\n\t\nCreate the animal list\n\t\t\nDefine the conditions. Build the experimental grand design, which includes the following parameters: 1) the number of subject mice, 2) the number of genetic lines (or treatment groups), 3) sex (male animals, female animals or both), and 4) the number of the cage to be used.\nSelect the appropriate transponder type (DataMars or Trovan) in the central tool bar.\nSet \"Groups\". In the \"Groups\" panel, add or remove the experimental groups (i.e., genotypes or treatments) by pressing the \"green plus (+)\" or \"red cross (x)\" button in the \"Groups\" window, respectively.\nSet \"Clusters\". Use the \"Cluster\" function to operate subgroups equally by defining correct, incorrect and neutral corners and sides.\n\t\t\tNOTE: The visit, nosepoke, and lick events, the main data for any behavioral tasks, are all associated with the definition. This setting is required for spatial learning tasks. The defined clusters for each animal remain the same throughout the experiment. For example, in one cluster for place preference (PP) task or place preference reversal (PPR), one corner is defined as correct (water-accessible) and three corners are defined as incorrect (water-inaccessible). In addition, clusters can be linked to another one using \"Link\" function.",
    "Assign variables including \"Name\", \"Tag\" (transponder ID), \"Sex\", \"Group\", and \"Cluster\".\nSave and paste the animal lists by selecting \"Export Animals\"… and \"Import Animals\"… in the \"File\" menu bar to replicate the animal lists for another experiment.\nSet up the hardware in \"Setup\" tab. Set up all systems using their corresponding ID numbers (hardware address) in the \"Setup\" tab. Correspond the number of addresses in the \"designer\" section to the actual number of addresses.\nBuild the experimental protocols in the \"IntelliCage\" tab\n\t\t\nBuild the experimental protocols in the \"IntelliCage\" tab using the following head and inferior tabs (\"Module\" and \"Option\" tabs).\nDesign the experimental structures in the \"Module Space\" by clicking the \"Module\" tab (Figure 3A). To add new modules, press the \"Add\" (green plus button in the \"Module\" tab).\n\t\t\tNote: There are four different types of components, namely \"Tasks\", \"Utils\", \"Reporters\", and \"Events\". Typically, an experiment begins with a trigger event, namely \"Visit\", \"Nosepoke\", or \"Drinking\". To select the trigger event, drag the corresponding unit from the Events section to define the starting sign. Subsequently, to set the output for certain actuators (such as door opening), drag the units from the \"Tasks\" section (e.g., \"Door\", \"LED\", and \"Air\").\nDrag the units, shown in \"Units\" part, into the \"Module Space\".\n\t\t\tNOTE: Again, users can obtain published protocols (as experimental files) from the authors and reuse the files by importing new animal list. Users do not have to make all modules.\nTo make a nosepoke adaptation (NPA) module (Figure 6A), drag the \"Door\" unit from the \"Tasks\" section, \"Gate\" and \"Timer\" units from the \"Utils\" section, and the \"Visit\" and \"Nosepke\" units from the \"Events\" section into the \"Module Space\".",
    "Link \"Any\" on the \"ON\" line of the Nosepoke unit to \"In\" in the Gate unit. Link \"Out\" to \"Close\" in the \"Gate\" unit. Link \"Out\" in the \"Gate\" to \"Activate\" in the \"Timer\" unit. Link \"Out\" in the Gate to Open in the \"Door\" unit. Link \"Out\" in the \"Timer\" unit to \"Close\" in the \"Door\" unit. Set \"Period\" as 5,000 (ms) in the Timer section.\n\t\t\tNOTE: The \"Gate\" unit is used to control the input and output of the sequence. In the \"Open\" state (the default state), the sequence connected to the \"Output\" will be operated. In contrast, in the \"Close\" state, the sequence connected to the Output will be stopped. The probability of the opening rate can be specified (Figure 6A, Figure 8A, and Figure 9A). The \"Module Selector\" is used to change the modules at random or in a certain sequence during the same experimental period. In the Serial Reaction Time (SRT) task, for example, the modules (of variable delay lengths) are randomly switched at each end of the visit using the Module Selector (set \"RandomExcludeDefault\" mode) linked to the \"END\" line of the \"Visit\" unit (Figure 8A). The \"Splitter\" unit will be used to direct an input signal to a specified side of the corner. This is required for more complicated modules such as those used in the SRT or Delay Discounting (DD) task, which require operation of a specific side. For example, in the DD task, only one side (sweetened side) will open with a delay (Figure 9A).\nDefine the initial status of the doors in cages in the \"Options\" tab. Specify all doors to be closed in the non-drinking session as the typical initial status for PP or PPR tasks.",
    "Set the time schedules in the \"Options\" tab. The Modules are changed at certain time points, and the action defined in the \"Day Patterns\" window is carried out.\n\t\t\tNOTE: The \"Day Patterns\" part can be used to set the experimental time window. Typically, the night time, active phase of the mice, is used to assess the behavior in the cognitive tasks. It should be noticed that the duration of the task may affect the amount of water intake. If the duration is long in relatively easy tasks, the performance in the end of the time-window may decrease due to satisfaction. Thus, the time window is required to be set carefully.\nRunning experiment using the \"Controller\"\nLoad the experimental file by pressing the \"Experiment\"… button in the \"Setting\" section in the \"Controller\".\nRun the experiment by pressing the \"Start\" button of the \"Controller\" (center right part).\nMonitor and visualize the current status of the system and the mice.\n\t\tNote: The behavioral events are explained as follows: visit, entering to a corner (detected by thermal sensor); nosepoke, putting the nose to the hole inside the corner (detected by infrared beam, and can be divided into left and right nosepoke); lick, licks detected by lickometer (counted as contact time and frequency).\nCarefully check the status of the system, paying especially attention to the cautions.",
    "CAUTION: Errors due to an incorrect animal tag (transponder number) will be reported in the log even if the actual tag number is correct (i.e., \"Unregistered tag ****\", \"Presence signal without antenna registration\", etc.). This may be due to the use of a transponder that is about to expire. However, this error is not a serious problem. In this case, one should recheck that the animal identified in the message can be detected. Errors due to long periods without a visit or drink will be displayed as, for example, \"**** (animal ID) did not make any visits during last 720 minutes\" (Figure 3B). Carefully check several possibilities that may lead to such errors. The most serious case is that the animal is already dead. The second most serious possibility is that there is a problem with the detection system for the animal (the transponder is not working, or has fallen out). The third possibility is that the animal is just not active. If the animal does not make any visits for an entire 24 h period, the experimenter should consider removing the animal from the cage due to its health condition. A serious problem that does not have an error indication is the failure of the door to close (almost always due to the problems with the magnets on the door). This results in the creation of an inappropriate drinking corner. To check this problem, the conditions of all doors should be checked during a non-drinking session at least once a day. The data acquired when this problem is present cannot be used for the analysis of PP, PPR, SRT or DD tasks.\nOutput all the behavioral events with the tag for the time and animal information by pressing the \"Stop\" button on the \"Controller\" (Figure 3B).",
    "Data handling using the \"Analyzer\"\nUsing the \"Analyzer\", analyze and visualize the data.\nExport the time-binned data as Excel files (Figure 3C). The graphical results shown in the \"Charts\" tab can facilitate the understanding of the data. In the \"Data\" tab, the data are arranged in multiple columns and can be sorted and filtered using any parameters.\n3. Animal Preparation\nUse animals over 15 g (aged 2 months or older).\n\tNOTE: If the animals are smaller than 15 g, multiple mice can visit a corner simultaneously, leading to the failure in data collection. Aged animals should be carefully monitored to ensure that they are able to jump into the corners and climb the feeder. Some older mice or mice with genetic mutations exhibiting motor impairments may die because they cannot access the water or food.\nReduce the potential risk of aggression.\n\tNOTE: Even when using female mice, it is better to begin housing all the mice together in a cage at a young age (i.e., at the age of 1 month) prior to starting the experiment. A profile of the mouse line, especially with respect to aggressiveness, should be obtained when using male mice in the cage.\nImplant the radiofrequency identification transponders (sterilized, needle included) subcutaneously into the mice in the dorso-cervical region under isoflurane inhalation anesthesia (Figure 4).\nPlace the mouse in the chamber for the anesthesia induction.\nAdjust the oxygen flowmeter to 0.8 to 1.5 L/min and isoflurane vaporizer to 2.0 to 2.5%.\nRelease the mouse from the induction chamber after the respiratory rate become slow (about 5 % drop).\nMaintain the anesthesia with a face mask.\nApply ophthalmic ointment to eyes to prevent eye drying.\nPinch and lift the skin around the posterior part of the scapulae to create a pocket.",
    "Douse the injection site with 70% ethanol to minimize the introduction of hair into the subcutaneous space. Then, insert the injecting needle through the skin parallel to the spine.\nEject the microchip subcutaneously.\nPinch the microchip through the skin to keep it inter-scapular space.\nWithdraw the needle slowly. Continue to pinch the area for a few seconds to provide hemostasis.\nUse post-administration pain relief if the needle is incorrectly inserted.\nRelease the mouse from anesthesia.\nPlace the mouse in a recovery cage and monitor it until they wake up and move around. Avoid leaving the mouse unattended.\nReturn the mouse to the home cage once it has become fully ambulatory.\nCheck the implanted transponder with a transponder reader for at least 1 week.\n\t\tCAUTION: The position of the implanted transponders is absolutely critical for the identification (see Figure 2). Do not insert the transponder vertically into the neck; this can cause, animals receive serious injury of the animal’s spinal cord. Transponders sometimes fall out after some hours or days. Check if the transponder is working by using a transponder reader. In optional, implant transponder again if it falls out; however, the repeated re-implant may cause artificial behavioral changes. Check the expiration date. Expired transponders will frequently transmit incorrect signals that resulting in missing of data.\nIntroduce the animals into the cage and check the transponders implanted in the mice using the transponder readers. Remove the mice if the transponders are not detected.\n4. Running Experiments",
    "NOTE: Mice are fed ad libitum with standard mouse chow and maintained with synthetic bedding that is changed every 1 or 2 weeks depending on the task schedule. Avoid changing bedding during spatial learning task especially initial 1–2 days. Lights are on between 08:00 and 20:00. The experimental modules are sequentially performed according to the scientific questions. The experimental schedule is illustrated in Figure 5.\nGeneral activity\n\tNOTE: Mice are sequentially adapted to the environment in the cage using three experimental conditions: the Free Adaptation, where the animals can always access the water bottles in the corners liberally (one day to 1 week of habituation is typically considered adequate); NPA, where the mice can access the water bottles for 5 s after every nosepoke into the holes in front of the doors in the corners (3 day to 1 week habituation is typically considered adequate); and the Drinking Session Adaptation, where the mice can access the water bottles at a specific time of day.\n\t\nPrepare the experiment files for the FA, NPA, and DSA tasks.\nRun the FA task in the \"Controller\".\nMeasure the number of visits, nosepokes and/or licking episodes daily or circadian activity periodically as an index of general activity.\nRun the NPA task in the \"Controller\".\nRun the DSA task in the \"Controller\".\n\t\tNote: Many learning paradigms require adaptation for the drinking session. To set the time schedule for the DSA, use two different experimental modules: the default (for water deprivation) session, and drinking session. The mice cannot access the water bottles because nothing happens after a nosepoke in the default module. The drinking session is identical to the NPA module. The time schedule defined in the \"Options\" tab in the \"Designer\" can then shift to the non-drinking session defined by another module.",
    "Spatial Learning and Memory Tasks\n\tNOTE: The PP task is used to assess spatial learning (typically 5–7 days). In the PP task, the mice have limited access to water in three out of four corners (one correct corner and three incorrect corners). Thus, the animals would have to visit a certain corner to drink water during the drinking sessions. The PPR task is used to assess flexibility or compulsivity and the ability to change behavior fluently (normally 5-7 days). In the PPR task, the mice can only access water in the opposite corners used as the correct corner in the PP task.\n\t\nPrepare the experiment files for the PP and PPR tasks. Define the correct corners for the mice by setting the \"Clusters\" (typically 1-4 corners each) in the \"Animal\" tab of the \"Designer\" (see Figure 6A, bottom). To avoid heavy traffic in one corner, allocate the four corners to all mice uniformly.\nRun the PP task in the Controller.\nEvaluate the spatial learning performance on the time course, the numbers, and the percentage of correct nosepokes.\n\t\tNote: The current version of the PP task focuses more on spatial learning rather than, spatial memory, as the task does not require a time gap between the different trials. To focus more on spatial memory, consider using the place avoidance (PA) task or an undefined new version of the spatial task that utilizes specific time gaps between trials.\nRun the PPR task in the \"Controller\".\nEvaluate flexibility or compulsivity based on the time course, the number, and the percentage of the correct nosepokes.",
    "Note: Interpretation of the PPR data requires several careful judgments. Initial performance of the PPR task is strongly dependent on performance in the PP task. This is because the PPR task relies on interference or the necessity to alter behavior. Therefore, the performance of the PPR can be especially poor if the performance of the PP task is close to 100% correct. Flexibility can be considered one of the executive functions11,12,13.\nAssess spatial fear memory in PA.\n\t\tNote: The PA task consists of 4 continuous sessions: habituation (day 1); conditioning (air-puff is introduced after nospoke at any sides of a pre-defined corner [incorrect nosepoke], day 2); 24 h break outside of the testing cage (the mice are placed back into their normal home-cages, day3); placing mice back into the testing cage without air-puff (days 4–10).\n\t\t\nPrepare the experiment files for PA.\nRun habituation (day 1).\nRun conditioning (day 2).\nTake the mice into normal home cages and keep for 24 h (day3).\nTake the mice back to the testing cage and run the test protocol (day 4–10).\nEvaluate the aversive spatial learning based on the ratio of incorrect nosepokes on the conditioning day (day 2), aversive spatial memory based on that on the day of return to the testing cage (day 3), and extinction learning based on that on days 4–10.\nAssessment of Executive Function (Impulsivity, Attention, and Compulsivity)\nSRT tasks",
    "NOTE: This procedure was previously described in more detail10,14. In this set of tasks, all four corners are operated in the same way, 24 h per day. The SRT consists of two training sessions (SRT-Training 1 and 2) and two testing sessions (SRT-Test 1 and 2). In the first training session (SRT-Training 1), the animals are trained to learn that the yellow LED light is a start signal for a nosepoke. The LED lights always flash immediately after the initial nosepoke (delay is set to 0 s).",
    "In the second training session (SRT-Training 2), the delay is set to vary randomly among 0.5, 1.0, 2.0, and 4.0 s. During this period, premature responses have no consequence (pre-training). Any nosepoke during the delay period is considered a premature response, while the first nosepoke when the door is opened (5 s) is considered a correct response. In the first test session (SRT-Test 1, used to assess impulsivity), the first nosepoke defines the correct side, and initiates a delay period (0.5–4.0 s, depending on the task phase), after which yellow LEDs are turned on for a specific time period (stimulus duration = 2.0 s, depending on the task phase). The door is then opened. The first nosepoke after the delay period opens the door (5 s) and is counted as a correct nosepoke while any nosepoke during the delay period is considered premature nosepoke. There are several modifications in the second test session (SRT-Test 2, used to assess attention). After starting a stimulus (0.2–1.0 s, slightly shorter than the first test), the mice are provided with a time period during which nosepokes are allowed (the limited hold, typically 2 s). The doors open (5 s) only after a correct nosepoke, which is the first nosepoke during the limited hold. Nosepokes after the limited hold are considered as omitted nosepoke and do not lead to any changes in the outcome. The errors are divided into three types: premature nosepoke, omitted nosepoke, and omission (first nosepoke only). The attention test requires ability to notice LED flash (defined by the duration of stimulus duration) as well as moderately quick response (defined by the duration of limited hold). The time course of the trial is illustrated in Figure 7.\n\t\t\nPrepare the experiment files for SRT tasks.\nRun the SRT-Training 1 for 3 days.",
    "Run the SRT-Training 2 for 7 days.\nRun the SRT-Test 1 (Impulsivity) for 7 days. Calculate the impulsivity based on the following formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/58009/58009eq1.jpg\n\t\t\twhere P is the number of premature nosepoke trials (or the number of incorrect nosepoke), and T is the number of total trials (the number of first nosepoke).\nRun the SRT-Test 2 (Attention) for 7 days. Calculate the accuracy (which is considered a performance indicator for attention) using the following formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/58009/58009eq2.jpg\n\t\t\twhere C is the number of correct nosepoke trials (number of correct second nosepokes), T is the number of total trials (the number of first nosepokes), O is the number of omission trials (number of trial missing a second nosepoke), and P is the number of premature nosepoke trials (or the number of second incorrect nosepoke before the limited hold).\nDD task",
    "NOTE: This is a simple choice task, where the animals choose either to wait to drink sweetened water (SW, 0.5% saccharin or 10% sucrose) with a delay or to drink normal water without a delay. The door on the chosen side opens while the door on the opposite side remain closed. The SW and normal water are allocated in right or left sides of all corners identically. The DD task schedule includes the training and test sessions. In the training session, the mice can access both SW and water without a wait time. Thus, the mice will develop their preference to the SW side. In test sessions, the wait time increases daily (i.e., 0, 1, 2, …, 8 s). The delays sequentially increase daily by making multiple modules exhibiting different delay length (0, 1, 2, …, 8 s) and setting \"Link\" in the \"Module\" and \"Options\" areas (Day patterns). In this task, all four corners operate in the same way, 24 h per day.\n\t\t\nPrepare the experimental file for DD task.\nDefine the side of the SW (right or left sides at the all corners).\nReplace the water bottles at the defined sides with the bottles containing SW.\nRun the training session to train the animals to drink SW at the defined sides with no delay for 5–7 days.\nCalculate the preference index, which is defined as the ratio of licking or nosepoking at the side of the SW to the total number of licks or nosepokes. The preference index for the side containing SW is thus calculated as:\nimgsrc://cloudfront.jove.com/files/ftp_upload/58009/58009eq3.jpg\n\t\t\tor\nimgsrc://cloudfront.jove.com/files/ftp_upload/58009/58009eq4.jpg\n\t\t\tThe former index focuses more on action outcomes, while the latter focuses more on choice behavior.",
    "NOTE: Ensure that most mice preferentially choose the sides with the SW (>90 % for the licking number-based index, >80% for the first nosepoke-based index) at the end of the training.\nSubsequently, run the test session of DD task for 9 days (delay 0 to 8 s).\nAssess the time course of the change in the preference toward the side with SW to evaluate the compulsivity.\nData Analysis\nOpen the archives using the \"Analyzer\" and export all data to Excel files. If the amount of data amount is quite large, it is better to filter the data (i.e., extract the drinking session for the spatial tasks, and extract the first and second nosepokes for SRT tasks).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}