{
  "id": 12252,
  "origin_website": "Jove",
  "title": "Generation of Prostate Cancer Cell Models of Resistance to the Anti-mitotic Agent Docetaxel",
  "procedures": [
    "1. Determination of the Docetaxel Concentration Causing 50% Decrease in Colony Formation Ability (IC50)\nNOTE: In this protocol, Docetaxel IC50 concentration has been evaluated using colony formation ability. Alternative methods used to evaluate cell viability (i.e., MTS assays) can be used based on investigators' preferences.\nGrow DU145 or 22Rv1 cells in a 75 cm2 flask and prepare enough stock of 10 mM Docetaxel diluted in DMSO to be used in future experiments.\nTo plate cells for determination of IC50 of Docetaxel, remove media from the flask, carefully wash cells with 5 mL PBS, and incubate with 2 mL 0.05% Trypsin-EDTA for 3-5 min at 37 °C to detach cells from the flask surface.\nRinse trypsinized cells from the flask using 5 mL of fresh media and collect the cell suspension in a 15 mL tube. Pellet cells by centrifugation (300 x g, 3 min, room temperature (RT)).\nRemove the supernatant, resuspend the cell pellet in 5 mL of fresh media and count the cells. Dilute the cell suspension to 2-2.5 x 105 cells/mL for DU145 and 4-4.5 x 105 cells/mL for 22Rv1, mix well by pipetting up and down and seed 2 mL of the suspension in each well of two 6-well plates.\nAfter 24 h, when the cells are at 70-80 % confluence, add dose-escalating Docetaxel concentrations of 1 nM, 2.5 nM, 5 nM, 10 nM, 25 nM, 50 nM, 100 nM, 250 nM, 500 nM, and 1000 nM to each well. Treat the control well with DMSO at the highest volume used for Docetaxel (Figure 2A).\nAfter 72 h, aspirate drug containing media and add 2 mL of fresh media. Within approximately 4-5 days, the plates will be ready for staining.",
    "To stain the colonies, wash them gently with 2-3 mL PBS and incubate them with 2-3 mL crystal violet solution (0.1 % w/v in 10 % formalin) for 20 min inside the tissue culture hood or a fume hood.\nRemove staining solution and wash plates with 2-3 mL of H2O, remove H2O and air-dry plates.\nAnalyze the results by visualizing the wells to determine which one has the Docetaxel concentration that decreases cell viability by 50% (IC50). Manually count colonies with the help of a marker pen (to avoid counting the same colonies twice) and represent the percentage of cell viability in a graph (Figure 2A). Finally, take digital images of the plates for figure representation (as shown in Figure 3A).\n2. Generation of Docetaxel-resistant Prostate Cancer Cells\nNOTE: Perform cell treatments using the same Docetaxel solution stock used for determination of IC50 drug concentration (prepare enough stock in advance for experimental use). Always keep a small flask of cells from the previous step, just in case something does not work well. Parental cells should be grown in parallel in a small flask throughout the whole procedure and exposed to vehicle (DMSO) in corresponding volumes mimicking the amounts used in the Docetaxel treated flasks.\nPlate DU145 or 22Rv1 cells in 150 cm2 flasks containing 20 mL of media (3.5 x 106 cells per flask for DU145 and 6.5*106 cells per flask for 22Rv1). Use of 10 to 20 flasks of cells is recommended to have enough cells at the end of the protocol.\nAfter 24 h, when cells are at about 70-80% confluence (Figure 2B, before Docetaxel), add Docetaxel at the IC50 concentration determined in step 1 of the protocol (5 nM for the cells described in this protocol).",
    "After 72 h, aspirate drug containing media and add fresh, Docetaxel-free media (Figure 2B, 72 h after Docetaxel). Change the media every 3-4 days. Within approximately 1-2 weeks, resistant clones will appear evident under the microscope (Figure 2B, 7 and 14 days after Docetaxel).\nAspirate media, carefully wash cells with 15 mL PBS and incubate with 4 mL 0.05% Trypsin-EDTA for 3-5 min at 37 °C to detach cells from the flask surface.\nResuspend trypsinized cells from the flask using 8 mL of fresh media. Pool cells from all treated flasks. Pellet cells by centrifugation (300 x g, 3 min, RT).\nRemove the supernatant, resuspend the cell pellet in 20 mL of fresh media and plate the cells in 150 cm2 flasks (3.5 x 106 cells per flask for DU145 and 6.5*106 cells per flask for 22Rv1).\nAfter 24 h, when cells are at about 70-80% confluence, add 5 nM Docetaxel (initial IC50 concentration) again.\nRepeat steps 2.3 to 2.6 on day 3.\nAfter 24 h, when cells are at about 70-80% confluence, treat cells with 2X IC50 Docetaxel concentration (10 nM for the cells described in this protocol).\nRepeat steps 2.3 to 2.8, following a dose-escalation of Docetaxel concentrations (25 nM, 50 nM, 100 nM and 250 nM), to generate a stable population of cells growing in your flasks under the final highest concentration. For higher concentrations, the dose-escalation protocol can be implemented for up to 6 months until the 1,000 nM concentration is reached (Figure 1A).\n3. Functional Characterization of Acquired Docetaxel Resistance by Colony Formation Assay\nNOTE: In this protocol, chemoresistance has been evaluated using colony formation assays. Alternative methods used to evaluate cell viability (i.e., MTS assays) can be used based on investigators' preferences.",
    "Plate 2,000 cells (DU145 or 22Rv1, both parental and Docetaxel-resistant) per well in 6-well plates, using 2 mL of media per well.\nAfter 24 h, add increasing concentrations of Docetaxel (parental cells: 0.25, 0.5, 1, 2.5 and 5 nM; DR cells: 50, 125, 250, 500 and 1,000 nM). For both DU145 and 22Rv1 cell lines. Add DMSO only to one well as a control at the same volume used for the highest Docetaxel dose.\nAfter 72 h, aspirate drug containing media and add fresh Docetaxel-free media.\nIncubate plates for 1-2 weeks until colonies are visible under the microscope.\nTo stain the colonies, wash them gently with 2-3 mL PBS and incubate them with 2-3 mL crystal violet solution (0.1% w/v in 10% formalin) for 20 min inside the tissue culture hood or a fume hood.\nRemove staining solution and wash plates with 2-3 mL of H2O, remove H2O and air-dry plates.\nAnalyze result by visualizing the wells and manually counting colonies with the help of a marker pen (to avoid counting the same colonies twice) and represent the percentage of cell viability in a graph. Take digital images of the plates for figure representation (Figure 3A).\n4. Phenotypic Characterization of Docetaxel Resistance Acquired Phenotype via qRT-PCR Analysis\nNOTE: Docetaxel-resistant (DR) cells exhibit a different expression profile compared to their parental cell lines28,29. Therefore, the success of the selection can be verified by qRT-PCR using primers for specific markers (for primer sequences, refer to the materials section; for details, refer to the results section). This should be done after each round of selection starting after the third round. Alternatively, evaluation of Docetaxel-resistant phenotype by Western blotting is also possible.",
    "Extract RNA from both parental and Docetaxel-resistant cells using an RNA extraction kit and following the manufacturer's instructions (see the Table of Materials and reagents for details). Using a minimum of 1-2 x 106 cells is recommended.\nQuantify RNA at 260 nm absorbance, using a spectrophotometer. For best purity, the 260 nm/280 nm absorbance ratios should be close to 2.0.\nPerform reverse transcription to obtain complementary DNA (cDNA) using the reverse transcription kit and following the manufacturer's instructions (see the Table of Materials and reagents for details), using 1 µg of RNA in a 20 µL reaction mix (if a higher amount of cDNA is needed, scale up the reaction mix accordingly).\nPrepare the qPCR reaction in triplicate for each gene of interest as follows:\n\t- 2 µL of 10 µM forward primer\n\t- 2 µL of 10 µM reverse primer\n\t- 10 µL SYBR Green PCR master mix\n\t- 5 µL H2O\n\t- 1 µL of the newly prepared cDNA from step 4.3.\n\tNOTE: See Table of Materials for the sequences of primers used in this protocol.\nSet the PCR program as follows:\n\t- 95 °C for 15 min\n\t- 94 °C for 30 s     |\n\t- 56 °C for 40 s     | 40 times\n\t- 72 °C for 30 s     |",
    "To analyze qPCR results and determine changes in gene expression between parental and DR samples, the cycle threshold (Ct) values for each gene of interest are determined in triplicate and the average normalized to the loading control (Actin triplicate average) for DR (Ct DR) and parental cells (Ct parental). Values for the parental cells are normalized to 1. ΔCt (Ct DR - Ct parental) is determined to obtain final mRNA fold changes and represented in a graph. An increase of >2 or a decrease of < 0.5 are considered significant and a good validation of the establishment of the Docetaxel acquired resistant phenotype (Figure 3B)."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}