{
  "id": 11848,
  "origin_website": "Jove",
  "title": "Proximity Ligation Assay Allows the Detection, Localization, and Quantification of Protein Arginine Methylation in Fixed Tissue",
  "procedures": [
    "Written informed consent was obtained from each patient. The study protocol was approved by the institutional ethics committee of the Cancer Research Center of Lyon.\n1. Choice of the antibodies\nUse primary antibodies validated by IHC or immunofluorescence (IF).\n\t​NOTE: The primary antibodies selected for the study are crucial to the success of PLA and more particularly in fixed tissue. Using an antibody validated by IHC or IF will increase the success rate of the experiment. Optimization and specificity of antibodies are required before conducting experiments, ideally by performing control experiments in cells invalidated for the expression of the protein of interest and using an inhibitor specific to the enzymatic activity of the methyltransferase involved. Here the conditions have previously been optimized10.\n2. Paraffin-embedded cell line pellet preparation\nNOTE: The samples are embedded in a gel and then placed in an automated tissue processor for sample dehydration and paraffin embedding.\nPrepare the cell pellet in a 1.5 mL microcentrifuge tube using trypsin dissociation.\n\tNOTE: Do not scrape to harvest cells.\nResuspend the cell pellet in 1.5 mL of phosphate buffered saline (PBS).\nCentrifuge the cells at room temperature (RT) at 200 x g. Aspirate the PBS supernatant.\nResuspend the pellet in 1 mL of 4% formalin and store the tubes at 4 °C for 3 h.\nWash the cells in 1X Tris-buffered-saline (TBS).\n\tNOTE: Do not use a phosphate-based solution as it depolymerizes the gel.\nAdd 1 mL of TBS and homogenize for 30 s by vortexing. Centrifuge for 5 min at 200 x g and remove the supernatant.\nRepeat steps 2.5 to 2.7 twice.\nPerform inclusion of the tissue in the automated tissue processor following the specific program:\n\tFormalin         1 h      37 °C\n\tDistilled water 2 min  RT\n\tEtOH 70%    40 min  45 °C",
    "EtOH 80%    40 min  45 °C\n\tEtOH 95%    40 min  45 °C\n\tEtOH 100%  40 min  45 °C\n\tEtOH 100%  40 min  45 °C\n\tEtOH 100%  40 min  45 °C\n\tXylene          40 min  45 °C\n\tXylene          40 min  45 °C\n\tXylene          40 min  45 °C\n\tParaffin          1 h       60 °C\n\tParaffin          1 h       60 °C\n\tParaffin          1 h 30 min  60 °C\n3. Tissue fixation and slide preparation\nFix the tissues in 4% formalin for 24 h before inclusion.\nCut 3 μm thick serial sections of the blocks containing tissues with a microtome.\nConduct deparaffinization with the autostainer by sequentially incubating slides in xylene (10 min) twice, 100% ethanol (5 min), 95% ethanol (5 min), and water (5 min).\nPerform heat-induced epitope retrieval in 10 mM citrate buffer using a water bath at 98 °C for 40 min at the appropriate pH (usually 6-9).\n\tNOTE: The two antibodies have to work at the same pH for the method to be successful. Several tests were performed before establishing the optimal pH used herein. The antibodies used in this study are SDMA antibody and the GR antibody.\nLet the slides cool for 20 min, then wash them in 1x PBS for 20 min.\n4. IHC experiment\nNOTE: IHC experiments are performed using the Discovery XT research instrument (Table of Materials) for automation and reproducibility.\nTo avoid peroxidase quenching, use the inhibitor included in the diaminobenzidine (DAB) kit.\nIncubate the slides with the two primary antibodies diluted in the antibody diluent for 60 min.\nIncubate the slides with the secondary anti-rabbit horse radish peroxidase (HRP) antibody for 16 min or the anti-mouse antibody for 30 min.\n\tNOTE: It is recommended to use a commercial diaminobenzidine (DAB) kit (Table of Materials) for IHC detection.",
    "Apply hematoxylin (100 µL/slide for 8 min) and bluing (100 µL/slide for 4 min) to the samples to stain the nuclei.\nWash the slides in warm soapy water, then dehydrate using an autostainer and mount on an automated cover slipper using a mounting medium.\n5. Proximity ligation assay reactions\nNOTE: All of the reagents used are included in the PLA kits (Table of Materials). It is recommended to use 40 μL of reagent for 1 cm2 of tissue. All of the incubations need to be performed in a humid environment to prevent excessive evaporation. Do not allow the sample to dry out, as this may lead to background noise. It is recommended to use 1x buffer A (in situ wash buffer, Table of Materials) for the washes in the jars. There should be a minimum volume of 70 mL in the jars when incubating samples under agitation. Samples should be kept at RT before use.\nPeroxidase quenching\n\t\nDelimit the reaction area using a hydrophobic pen to prevent excessive evaporation of the solution during the experiment. Add one drop of hydrogen peroxide solution per 1 cm2 of each sample. Incubate for 5 min at RT.\n\t\tNOTE: It is recommended to optimize the incubation time according to the samples/antibodies used.\nBlocking\n\t\nGently drip buffer A onto the samples and wash in buffer A at 50 rpm under agitation for 5 min at RT.\nTap off the remaining buffer A and add one drop per 1 cm2 of blocking solution (included in the PLA kit). Incubate for 30 min at 37 °C.\nPrimary antibody incubation\n\t\nDilute the two primary antibodies at suitable concentrations in the antibody diluent.",
    "Remove the blocking solution from the slides and immediately add the primary antibody solution (included in the PLA kit). Incubate for 1 h in a humidity chamber at 37 °C.\nPLA probe incubation\n\t\nDilute the PLA probe PLUS (1:5) with PLA probe minus (1:5) in the antibody diluent.\n\t\tNOTE: It is recommended to use 8 µL of PLA probe minus stock (5x), 8 µL of PLA probe plus stock (5x), and 24 µL of antibody diluent for a 40 µL reaction.\nGently drip buffer A onto the samples and wash in buffer A at 50 rpm for 5 min at RT.\nTap off the remaining buffer A and apply the PLA probe solution (included in the PLA kit) to the samples. Incubate for 1 h at 37 °C.\nLigation\n\t\nThaw the ligation buffer (included in the PLA kit) prior to the following steps.\nGently drip buffer A onto the samples and wash in buffer A at 50 rpm for 5 min at RT.\nDilute the 5x ligation buffer (1:5) (included in the PLA kit) in high-purity water. Add the ligase (1:40) (included in the PLA kit) immediately before adding it to the sample.\n\t\tNOTE: It is recommended to add 8 µL of the 5x ligation buffer to 31 µL of high purity water for a 40 µL reaction. Then add 1 µL of ligase.\nTap off the remaining buffer A and apply the ligase solution to the samples. Incubate for 30 min at 37 °C.\nAmplification\n\t\nThaw the amplification buffer prior to the following steps.\nGently drip buffer A onto the samples and wash in buffer A at 50 rpm for 2 min at RT.",
    "Dilute the 5x amplification buffer (1:5) (included in the PLA kit) in high-purity water. Add the polymerase (1:80) (included in the PLA kit) immediately before gently dripping it onto the sample.\n\t\tNOTE: It is recommended to add 8 µL of the 5x ligation buffer to 31.5 µL of high purity water for a 40 µL reaction. Then add 0.5 µL of ligase.\nTap off the remaining buffer A and apply the amplification solution to the samples. Incubate for 2 h at 37 °C.\nDetection\n\t\nGently drip buffer A onto the samples and wash in buffer A at 50 rpm for 2 min at RT.\nDilute the 5x detection bright-field buffer (1:5) (included in the PLA kit) in high-purity water.\n\t\tNOTE: It is recommended to add 8 µL of the 5x detection buffer to 32 µL of high purity water for a 40 µL reaction.\nTap off the remaining buffer A and apply the detection solution to the samples. Incubate for 1 h at RT.\nSubstrate development\n\t\nGently drip buffer A onto the samples and wash in buffer A at 50 rpm for 2 min at RT.\nDilute the substrate solution by diluting the substrate reagents A (1:70), B (1:100), C (1:100), and D (1:50) (included in the PLA kit) in high purity water.\n\t\tNOTE: It is recommended to add 0.6 µL of substrate A, 0.4 µL of substrate B, 0.4 µL of substrate C, and 0.8 µL of substrate D in 37.8 µL of high purity water for a 40 µL reaction.\nTap off the remaining buffer A and apply the amplification solution to the samples. Incubate for 10 min at RT.\nNuclear staining\n\t\nGently drip distilled water onto the samples and wash in distilled water at 50 rpm for 2 min at RT.",
    "Tap off the remaining distilled water. Add one drop of nuclear stain (included in the PLA kit) to each 1 cm2 sample and incubate for 2 min at RT.\nRinse the slides under running tap water for 10 min to let the stain mature and obtain a blue coloration. Do not use standing tap water.\nDehydration\n\t\nIncubate the slides in a solution containing 96% ethanol twice for 2 min. Then incubate the slides in a solution containing 99.7% ethanol twice for 2 min.\nIncubate the slides in xylene for 10 min. Then transfer the slides to fresh xylene.\nMounting of the slides\n\t\nUse a minimum volume of non-aqueous mounting medium and apply a coverslip on top of the sample, ensuring no air bubbles get caught under the coverslips.\nLet the slides dry before analyzing on a bright-field microscope.\n6. Imaging for localization\nAcquire images using an upright microscope.\n\tNOTE: In this study, imaging of slides was performed under an upright bright-field microscope (Table of Materials). Images were acquired under identical conditions at 40x magnification for at least 10 randomly chosen fields of view in an automated manner. It is recommended to analyze a minimum of 500 cells per condition.\n7. Analysis for quantification\nNOTE: Quantification of samples was performed using ImageJ software8. FIJI, an ImageJ distribution including ImageJ and other pre-installed plugins, was used for the subsequent analyses9,10.\nTo determine the number of dots:\n\t\nOpen the image.\nPerform Color Deconvolution. For this, click on Image > Colors > Color Deconvolution.\nSelect image: - (color_1) in the filename.\nUse the Find Maxima command to determine the number of dots (Process > Find Maxima).\nTo determine the number of cells:\n\t\nOpen the image.\nPerform Color Deconvolution. For this, click on Image > Colors > Color Deconvolution.",
    "Select image: - (color_1) in the file name.\nFind a threshold that shows the maximum number of nuclei. For this, click on Image > Brightness/Contrast > Threshold.\nFill the holes by clicking on Process > Binary > Fill Holes.\nUse the watershed command to divide connected components into separate ones. Click on Process > Binary > Watershed.\nAnalyze particles to determine the number of nuclei by clicking on Analyze > Analyze Particles.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}