{
  "id": 11611,
  "origin_website": "Jove",
  "title": "A Microphysiologic Platform for Human Fat: Sandwiched White Adipose Tissue",
  "procedures": [
    "All tasks were performed in adherence to protocols #8759 and #9189, as approved by the IRB Office of LSUHSC-NO. All animal work was performed in adherence to protocol #3285 approved by the IACUC Office at LSUHSC-NO.\n1. Seeding of Sandwiching Cell Sheets\nNOTE: See Figure 1.\nSeed ADSCs at approximately 80% confluency in tissue culture plates (6 cm or 6-well plates). For each well of SWAT desired, seed 1 conventional tissue culture well and 1 well of corresponding size on poly(N-isopropylacrylamide (pNIPAAm)-coated tissue culture plastic plate.\n\tNOTE: Accordingly, a 6-well plate of SWAT will require seeding cells on one 6-well standard tissue culture plate (base layer) and one 6-well pNIPAAm-coated tissue culture plate (upper layer). pNIPAAm-coated plates can be bought commercially or produced in-lab12,13,14.\nMaintain ADSCs at 37 °C and 5% CO2 in Dulbecco's Modified Eagle Medium (DMEM) supplemented with 10% FBS and 1x Penicillin/Streptomycin. Change media every 2 days.\nAllow cells to coalesce until they become 100% confluent and take on a striated pattern (approximately 6–8 days).\n\tNOTE: These cells will need to function as a single intact cell sheet in order to stabilize the buoyant adipose tissue. Insufficiently confluent cells will fragment upon seeding with WAT.\n2. Preparation of SWAT Supplies\nPrepare several 10 mL aliquots of 1x Hank's Balanced Salt Solution (HBSS); prepare enough for the desired number of plates with volume to spare.\nPrepare the plunger apparatus for SWAT seeding. Construct the plunger using simple acrylic plastics, comprised of a stem attached to a round disk. Ensure that it fits within the circumference of the tissue culture wells (diameter: <6 cm for 6 cm dish, <3.5 cm for 6-well plate; approximate mass: 6.7 g for a 6 cm dish, 5.1 g for a 6-well plate).",
    "Prepare extra plungers to ensure that the procedure will run smoothly in case there is a problem with any individual plunger.\nWrap lab tape around the rim of the plunger disk, at least 2x, to prevent leakage of gelatin solution.\nSpray a biosafety cabinet (BSC) with 70% EtOH. Spray down a 15 mL conical tube rack inside the BSC with empty, uncapped 15 mL conical tubes; tubes will help secure the placement of the gelatin plungers.\nSpray each tape-wrapped plunger thoroughly with 70% EtOH and place into a 15mL conical tube on the rack. Spray metal washers (approximate mass 6.3 g) and place them on the rack along with a pair of hooked forceps; the washers will add weight to the plungers during SWAT seeding.\nClose the BSC sash and turn on the UV light to facilitate drying and sterilization.\n\t\tNOTE: Ideally, conduct this step 24 h prior to SWAT seeding. Alternatively, conduct the process on the day of tissue collection/SWAT seeding; however, in this case, allow 15–45 min for UV drying/sterilization.\n3. Preparation of Gelatin Plungers — Application to Upper Cell Sheets\nHeat a water bath to 75 °C.\nPrepare the gelatin solution by adding 0.75 g of gelatin powder to 10 mL stock of 1x HBSS. Under a fume hood add 100 µL of 1 M NaOH to balance the pH of the solution.\nAdd the 10 mL stocks to the water bath and shake vigorously every 5 min until the powder dissolves into solution. Aim to dissolve the powdered gelatin soon after adding to the heated water bath.",
    "Turn on the BSC blower, turn off the UV light, and raise the sash. Spray the BSC surface and prepare the filter supplies (5 mL luer-lock syringes and 0.2 µm syringe filters). Prepare multiple filters to efficiently strain sufficient volumes of gelatin to apply to plungers.\nWhen the gelatin solution reaches a homogenous consistency, filter the solution and apply it to the plungers. Load the syringe with gelatin. Apply the gelatin to the plastic plungers through the syringe filter (~2.5 mL for a 6-well plate, ~4.5 mL for a 6 cm dish) and allow to solidify (~20 min).\nOnce the gelatin is solid, unwrap the tape from the edge of the plungers. With hooked forceps, remove the gelatin from the outer edge of the plunger (i.e., the raised edges of the meniscus). Ensure that the remaining gelatin in the center of the plunger is completely level to maximize contact with ADSC sheet.\nOnce excess gelatin is removed, gently apply the gelatin plungers to the pNIPAAm-coated ADSC plates. Use the metal washers to weigh down the plunger. Do not shear cell sheets while applying the plungers.\nLeave the plungers on the cell sheets for 1.5 h at room temperature. Incubate plates/plungers in an ice water bath for 1.5 h to complete dissociation of the cell sheet from the pNIPAAm-coated plate surface.\nExercise caution while incubating in the ice bath; do not allow the ice bath to contaminate the cell media during incubation.\nAfter completing incubation, clean the bottom of the pNIPAAm-coated plates to remove non-sterile water.\n4. White Adipose Tissue Processing",
    "When collecting human adipose tissue from the operating room, keep all samples in a sterile container that is on ice until SWAT is to be seeded. Add sterile maintenance media, such as phosphate-buffered saline (PBS), to adipose tissue container for tissue stability.\nAdd cold cell culture medium to 1.5 mL microcentrifuge tubes for each well/dish to be seeded (100 µL for a 6-well plate, 200 µL for a 6 cm dish).\nMince the adipose tissue.\nFor solid adipose tissue segments, do as follows.\n\t\t\nWash large segments of adipose tissue 3x in sterile PBS and remove as much PBS as possible.\nCoarsely mince tissue with forceps and sterile razor and remove as much vasculature and fascia as possible (see Discussion for more detail).\nFinely mince fat with razor until minced tissue takes on thick, liquid consistency.\n\t\t\tNOTE: Ideally tissue will appear homogenous with no visible individual segments of WAT although this is not always possible.\nProcess lipoaspirate as follows.\n\t\t\nUnder the BSC, tape sterile gauze over the top of a beaker, and place this beaker in a larger beaker to collect any excess liquid.\nUsing a 25 mL serological pipette, draw as much lipoaspirate as needed and apply it to the surface of the sterile gauze. Apply PBS directly to this surface to wash lipoaspirated fat and to remove excess blood and lipid residue.\nUse forceps to recover drained tissue, transfer it to a sterile mincing surface, and mince the lipoaspirate.",
    "Use a sterile razor to cut off the distal end of p1000 pipette tips to transfer minced tissue; this will minimize shear stress that can lead to adipocyte lysis. Once a proper tissue consistency is reached transfer the desired volume of minced tissue to each 1.5 mL tube (300–400 µL for 6-well plate, 500–600 µL for 6 cm dish). Mix minced WAT and media briefly in the tubes.\nTake the base ADSC plates and decant/aspirate the media. Replace the media with the WAT/media mixture from each 1.5 mL tube.\nGently remove the gelatin plungers from the pNIPAAm-coated plates and apply them to the WAT mixture on the base ADSC plates. Examine the monolayer of the pNIPAAm-coated plates under a microscope to confirm cellular detachment.\nSet a heat block to approximately 37–40 °C under the BSC. With the plungers still in place, move the plates to the heat block's surface. Add 2–3 mL of warmed culture media to incubate the cells and facilitate gelatin melting.\nAfter ~30 min, gently remove the plungers from the plate surface. Replace the lids of the base tissue culture plates and move to a cell culture incubator. Once the gelatin has completely liquefied at 37 °C, aspirate and replace cell culture media.\nMaintain SWAT at 37 °C and 5% CO2 in phenol red-free M199 medium with 7 µM insulin, 30 µM dexamethasone, 1x Penicillin/Streptomycin. Maintain in approximately 2 mL media for 6-well plates and 3 mL for 6 cm dishes. Change media every 2 days.\n5. SWAT Harvest\nPrepare collagenase (0.5 mg/mL collagenase, 500 nM adenosine, in PBS) aliquots in 15 mL conical tubes (approximate volume of 10 mL). Freeze the tubes and store them at -20 °C.",
    "Aspirate any culture medium from cells, wash 1x with PBS, and then aspirate PBS. Prep the collagenase aliquots by thawing them in a 37 °C water bath.\n\tNOTE: Ideally, the collagenase solution will reach 37 °C; immediately thereafter, add tissue.\nAdd all tissue from the SWAT plate to the individual aliquots. Harvest SWAT using a sterile cell scrapper and transfer it to the collagenase aliquots with a cut-off p1000 pipette tip. Add tissue directly to the 15 mL conical tubes containing collagenase solution.\nAlternatively, incubate the tissue/collagenase mixture in a 50 mL conical tube; the increased surface area will further facilitate enzymatic digestion.\nPlace sample tubes in an incubated orbital shaker at a 45° angle. Incubate at 200 rpm, at 37 °C for 30–60 min.\nPlace a 250 µm mesh filter into a new 15 mL conical tube for collection. Pour the digested adipocyte solution through the filter.\n\tNOTE: This will allow all cells to pass through while filtering out fibrous tissue.\nAllow flow-through to sit for 5 min at room temperature to allow for phase separation.\n\tNOTE: The adipocytes will float to the top of the solution while the adipose stromal cells (ASCs) will settle into the lower phases. Centrifugation for 5 min at 500 x g can also maximize cell separation or harvest surrounding ADSCs in the pellet.\nUsing a cut-off p1000 pipette tip, transfer the adipocytes (the floating layer at top of collagenase solution) to a 1.5 mL microcentrifuge collection tube. Taking ~250 µL at a time, pipette slowly along the edge of the tube to collect the adipocytes.\nRotate the tube slowly while collecting the adipocytes to maximize the recovery of cells adhering to the inside. Keep drawing more cells until the 1.5 mL microcentrifuge tube is full.",
    "Remove excess liquid from the isolated adipocytes using a syringe attached to a needle (~21 G). Submerge the needle under the floating adipocyte layer. Agitate the needle briefly to dislodge any cells adhering to the needle shaft, and then wait for the dislodged adipocytes to float to the top.\nSlowly draw the excess liquid, being careful to avoid unintended removal of adipocytes. Use microcentrifuge tube graduations to consistently isolate sample volumes (e.g., .0.1 mL for each sample).\nUse the isolated cells for DNA/RNA extraction, glucose uptake assay, lipolysis assay, etc.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}