{
  "id": 3560,
  "origin_website": "Cell",
  "title": "Protocol for generating embedding-free brain organoids enriched with oligodendrocytes",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nNeuroectodermal (NECT) colonies induction (days 1–3)\nTiming: 3 days\nBefore initiating the neuroectodermal induction (NECT, See Figure 1[href=https://www.wicell.org#fig1]A), prepare the experimental environment by culturing the stem cells on human embryonic stem cell (hESC)-qualified Matrigel, using the following steps.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3129-Fig1.jpg\nFigure 1. Characterization of iPSCs and neuroectodermal (NECT) colonies using immunocytochemistry\n(A) Schematic diagram representing the protocol used to generate NECT colonies from stem cells. Representative bright-field-phase images showing the morphology of stem cells and NECT colonies in vitro are shown. Dotted white boxes indicate zoomed in regions. Scale bar = 500 μm, zoomed images scale bar = 100 μm.\n(B) Immunocytochemistry staining of stem cell colonies marked with SOX2 (Green), NANOG (Red), OCT4 (Red), and N-CADHERIN (RED). Scale bar = 100 μm.\n(C) Immunocytochemistry staining of NECT colonies marked with SOX2 (Green), NANOG (Red), OCT4 (Red), and N-CADHERIN (RED). Scale bar = 50 μm.\nPrepare the basement membrane matrix by thawing a vial of 100% Matrigel on ice.\nDilute the Matrigel for coating at a ratio of 1:50 in a standard DMEM/F12 medium.\nAdd 1 mL of DMEM/F12 medium with Matrigel per well of a 6-well plate.\nEvenly spread across the well.\nLet it coat the floor of the well at room temperature for an estimated 1-h or 30 min in the tissue culture incubator at 37°C temperature and 5% CO2.\nOnce the well coating is done.\nCarefully remove all the coating materials and avoid touching the surface of the coated wells.\nPassage the stem cells using ReLeSR as described by STEMCELL Technologies.\nPlate the stem cells into these Matrigel coated wells at a density between 20%–30% confluency per well. To achieve this density, transfer 60% confluent stem cell colonies from one well of a 6-well plate into three wells of another 6-well plate.",
    "Maintain the stem cells colonies for one day in mTeSR Plus medium prior to the differentiation.\nColony Assessment.\nOn the day of planned differentiation, inspect the stem cell colonies using a bright-field microscope at a magnification between 4× to 10×. It is best to photograph your colonies using phase optics for your records (e.g., See Figure 1[href=https://www.wicell.org#fig1]A).\nEnsure that the colonies show no signs of differentiation. A healthy iPSC colony should display a compact edge and contain cells with a large nucleus, minimal cytoplasm, and visible nucleoli (Figure 1[href=https://www.wicell.org#fig1]A, day 0), and should express the pluripotent markers NANOG and OCT4 (Figure 1[href=https://www.wicell.org#fig1]B)\nPrepare Olig1 medium by combining the reagents listed in neural induction medium recipe and allow it to reach room temperature prior to use.\nRemove the mTeSR Plus medium from the cultured plate with stem cells and add 2 mL of Olig1 medium to each well of a 6-well plate.\nAdd the dual SMAD inhibitors, SB-431542 (10 μM) and LDN 193189 (0.1 μM) to each well containing Olig1 medium. Alternatively, add these inhibitors at appropriate concentrations to the required volume of Olig1 medium before adding it to the cells.\nNote: To ensure even distribution of the inhibitors, gently rotate the plate or invert the tube containing the medium and the SMAD inhibitors 3–4 times.\nFor the next 2 days, add fresh Olig1 medium containing 10 μM of SB-431542 and 0.1 μM of LDN 193189 daily.",
    "Note: Differentiated iPSC colonies towards neuroectodermal lineage should have a distinct shape compared to iPSC colonies, particularly at the colony's external borders. Namely, at day 3 one should see in these regions, a loss of cell contacts with fine cell membrane extensions (i.e., presence of filopodia and lamellipodia; Figure 1[href=https://www.wicell.org#fig1]A, day 3). During this period (day 0–3), neuroectodermal colonies should lose pluripotent markers and express markers of neural cells, such as N-CADHERIN (Figures 1[href=https://www.wicell.org#fig1]B and 1C).\nGeneration/development of neural spheroids enriched in oligodendrocyte precursors (OPCs) (days 4–7)\nTiming: 4 days\nThis phase of the protocol focuses on the preparation and enrichment of neural spheroids with oligodendrocyte precursors (OPCs). The following steps promote differentiation towards the oligodendrocytes lineage, fostering the proliferation of newly generated OPCs.\nBegin the procedure by preparing Olig2 medium using the reagents listed in Olig2 recipe and allow the medium to reach room temperature.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3129-Fig2.jpg\nFigure 2. Schematic diagram showing the process of neural spheroids generation enriched with oligodendrocyte progenitor cells from day 4 to day 7 of in vitro differentiation\nCreated with BioRender.com[href=http://BioRender.com].\n(A) Schematic diagram illustrates generation and characterization of neural spheroids.\n(B) Schematic diagram showing the protocol used to culture the neural spheroids.\n(C) Bright field images showing the progressive changes in morphology of neural spheroids during 4 days of proliferation. Scale bar = 400 μm.\n(D) Bar graphs showing the quantification of neural spheroids area and roundness over 4 days of in vitro differentiation. Data are shown as the mean ± standard deviation; ∗p < 0.05, ∗∗∗∗p < 0.0001 via one-way ANOVA.\nColony detachment and Dispase treatment (Figure 2[href=https://www.wicell.org#fig2]).\nRemove Olig1 medium from each well of your 6 well plate and wash once with HBSS to ensure the total removal of Olig1 medium.",
    "Note: Ensure a complete removal of the Olig1 medium as it may potentially disrupt the enzymatic activity of Dispase, which could result in a failure to properly detach neuroectodermal colonies.\nRemove the HBSS and add 1 mL of Dispase of 2.4 units/mL to detach NECT colonies.\nSubject the tissue culture well to incubation at 37°C for a period ranging from 20 min to a maximum of 30 min and periodically monitor for colony detachment.\nNote: It's possible for smaller colonies to detach within the initial 20 min. After a 30-min period, all NECT colonies should be detached, and any colonies still attached should be discarded. Only detached colonies should be used for the next steps.\nNECT colonies handling (Figure 2[href=https://www.wicell.org#fig2]).\nAfter the Dispase incubation and detachment of the colonies, add 1 mL of Olig2 medium to each tissue culture well to halt the enzymatic activity of Dispase.\nUse a wide-bore (cut) sterilized P1000 pipette tip (modified) to transfer the colonies into a 15 mL tube.\nAllow the colonies to settle at the bottom of the tube by gravity, a process expected to take about 1 min (inspect by eye).\nAfter the colonies have settled, cautiously remove the supernatant using a standard P1000 pipette tip and replacing it with 1 mL of fresh Olig2 medium. This step should be repeated three times to ensure a complete removal of Dispase from around the colonies.\nNote: The complete removal of Dispase is crucial, as any remaining Dispase may hinder the formation of neural spheroids and lead to significant cell death.\nNote: To make the washing step cost effective, you can perform these washes using DMEM/F12 medium and only use the Olig2 medium on the last wash since Olig2 is significantly more expensive as compared to DMEM/F12 medium.\nColony Suspension and Seeding (Figure 2[href=https://www.wicell.org#fig2]).",
    "After the cell aggregates are sufficiently washed, resuspend them in 3 mL of Olig2 medium. This medium contains a cocktail of growth factors and small molecules that included thyroid hormone T3, neurotrophin NT3, hepatocytes growth factor (HGF), insulin growth factor (IGF), and platelet derived growth factor (PDGF-AA) to promote differentiation toward the oligodendroglial lineage and to foster the proliferation of newly generated OPCs.\nPlace the resuspended colonies in a single well of a 6-well plate and add 40 ng/mL of bFGF (Figure 3[href=https://www.wicell.org#fig3]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3129-Fig3.jpg\nFigure 3. Schematic diagram representing the detailed protocol of generating brain organoids enriched with oligodendrocyte precursors from day 7 to day 10\nCreated with BioRender.com[href=http://BioRender.com].\nNote: If a large number of colonies have been detached, consider dividing them across multiple wells of a 6-well plate to prevent spheroids fusion. Monitor theses fusions over the next 24 h.\nMaintain the spheroids in the same medium for the subsequent 3–4 days.\nSupplement them with 40 ng/mL of bFGF daily to induce the proliferation of NECT cells and the self-organization activity that accompanies the neuroepithelia expansion (Figure 3[href=https://www.wicell.org#fig3]B).\nNote: If the spheroids are plated at a higher density, a yellowing of the medium may occur, signaling a need to replace it every two days with fresh medium and 40 ng/mL of bFGF. To circumvent this issue, it's advised to keep a lower number of spheroids in each well.\nNote: Between days 3 and 4, niches of SOX10+ cells, the precursors of oligodendrocytes, may begin to emerge. Use immunostaining procedures, to confirm their presence in organoids sections or intact (whole mount) organoids.\nGeneration of brain organoids enriched in OPCs (day 8–10/11)\nTiming: 3 days\nThis phase is dedicated to the process of generating brain organoids enriched with OPCs.",
    "Begin the procedure by preparing Olig3 medium using the reagents listed in Olig3 recipe and allow the medium to reach room temperature before use.\nThaw a vial or aliquot of 100% Matrigel on ice.\nCalculation and preparation of Matrigel and Olig3.\nCalculate the required amounts of Olig3 medium and Matrigel to achieve 1% Matrigel. For instance, for 10 wells of 96 well plate, you will need 2.1 mL of Olig3 medium (including an extra 100 μL for pipetting error) and 21 μL of Matrigel.\nAdd the calculated amount of Matrigel to Olig3 medium in a 15 mL tube and mix well by inverting the tube vertically 4–5 times.\nAdd 200 μL of 1% Matrigel-Olig3 medium to each well of U-bottom low-attachment 96 well plate.\nSelecting and transferring neural spheroids (Figure 3[href=https://www.wicell.org#fig3]).\nUse the stereomicroscope and select neural spheroids of similar size (around 500 μm) from the 6-well plate.\nUse modified (cut tip) or wide bore pipette tip of 100 μL or 200 μL and carefully transfer neural spheroid one by one to each well of a 96-well plate (U-bottom low attachment).\nNote: Avoid using flat-bottom low attachment 96 well plate as it does not allow optimal intermingling of neural spheroids with the Matrigel containing medium.\nAfter 2 days of incubation in 1% Matrigel-Olig3 medium, the organoids should be intermingled with Matrigel, and a thin layer of Matrigel surrounding the organoid can be observed (Figure 3[href=https://www.wicell.org#fig3]).\nAlternatively, if the interaction between organoids and Matrigel isn’t clear, the incubation in the 1% Matrigel-Olig3 medium can be extended for additional day.\nDifferentiation and maturation of brain organoid enriched oligodendrocytes (day 11/12–60)\nTiming: ≥60 days\nThis segment of the protocol focuses on the extended differentiation and maturation of the brain organoid, specifically enriching it with mature oligodendrocytes.",
    "Prepare 24 well low-attachment plates containing 800 μL of Olig3 medium per well (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3129-Fig4.jpg\nFigure 4. Schematic diagram representing the detailed protocol of generating brain organoids enriched with oligodendrocyte precursors from day 8 to day 10 or 11\nCreated with BioRender.com[href=http://BioRender.com].\nCollect the organoid with the entire medium using a wide bore tip.\nTransfer each organoid to a new 24-well low-attachment plate containing Olig3 medium to make 1 mL total volume.\nNote: Always handle cells with care during the transfer to avoid damaging the organoids.\nCritical: There is a high probability of organoids fusing when culturing multiple organoids in the same well.\nMaintenance and maturation of the oligodendrocytes brain Organoids\nMaintain the differentiated oligodendrocyte brain organoids in Olig3 medium for more than six weeks to achieve mature oligodendrocytes.\nReplace 0.5 mL of medium with 0.5 mL of fresh Olig3 medium in each well every 3 days during the first week.\nAfter the first week of differentiation, medium can be changed every 2 days.\nCritical: As organoid development progresses, nutrient consumption, and metabolic activity increases. Hence, it is recommended to visually inspect the medium for yellowing before the regular medium change (every 2–3 days). This is a crucial indicator for increasing the frequency of medium replacement."
  ],
  "subjectAreas": [
    "Organoids",
    "Neuroscience",
    "Stem Cells"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}