{
  "id": 1915,
  "origin_website": "Cell",
  "title": "Protocol for inducing inflammation and acute myelin degeneration in larval zebrafish",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nZebrafish breeding\nTiming: 2 h\nIn this step, we describe the parameters used to collect zebrafish for these experiments\nPrepare the E3 water (see “materials and equipment[href=https://www.wicell.org#materials-and-equipment]” for detailed recipe).\nBreed the zebrafish to acquire the embryos and larvae for the experiment. (If the number of embryos is inadequate, see troubleshooting 1[href=https://www.wicell.org#sec7.1]).\nTo maximize embryo production, females and males can be kept in separate tanks before breeding.\nPrior to the day when you wish to obtain embryos, transfer adult male and female zebrafish into the same tank, at a 1:2 ratio, respectively. Use breeding tanks or use marbles to cover the bottom of the tank.\nPause point: Allow the fish to stay in the breeding tank for next ∼12 h\nAfter the beginning of the next light cycle, collect embryos into a fresh petri dish by siphoning and place the adult fish back in their home tanks.\nRemove unfertilized and dead embryos from the petri dish and place 50 live embryos per dish in E3 water at 28°C for 7 days to develop.\nPause point: Allow larvae to develop at 28°C for 7 days.\nDuring the growth period, remove dead embryos daily and change E3 water if needed.\nInduction of inflammation and demyelination\nTiming: 1 h\nIn this step, we describe the use of cuprizone and LPS to induce inflammation and demyelination\nPrepare cuprizone stock solution (see “materials and equipment[href=https://www.wicell.org#materials-and-equipment]” for detailed recipe).\nThaw or prepare LPS stock solution (see “materials and equipment[href=https://www.wicell.org#materials-and-equipment]” for detailed recipe).\nPrepare Cuprizone + LPS treatment solution (see “materials and equipment[href=https://www.wicell.org#materials-and-equipment]” for detailed recipe) and control (zebrafish system water) conditions in a 12-well plate and transfer the 7 dpf fish into the plate with 3 fish/well and 3 wells/condition.",
    "To screen the effects of additional compounds on inflammation (such as environmental pollutants as described in (Wheeler et al., 2019[href=https://www.wicell.org#bib6])), additional groups can be included which include compound only, and Cuprizone + LPS + compound.\nPlace the 12 well plate containing larvae into a 28°C incubator for 48 h.\nPause point: Keep larvae in the Cuprizone + LPS solution at 28°C for 48 h.\nSample collection\nTiming: 1 h\nIn this step, we describe how to isolate zebrafish samples.\nNote: Animals have to be euthanized according to the permission and ethical rules of local authorities.\nEuthanize larvae by placing the 12-well plate on ice.\nCollect at least n=3 larvae per group for the desired end point measurement.\nRNA isolation from zebrafish\nTiming: 1–2 h\nIn this step, we describe how to isolate RNA from zebrafish larvae\nIsolate RNA from at least n=3 larvae per group with TRIzol LS per the manufacturerś protocol.\nCritical: TRIzol is a hazardous chemical, process samples in a ventilated hood and use gloves, a lab coat, and goggles when handling.\nPurify RNA with Direct-zol RNA kit according to the manufacturer’s protocol.\nMeasuring inflammation and demyelination markers by qPCR\nTiming: 3–4 h\nIn this step, we describe how to quantify gene expression in zebrafish\nSynthesize cDNA with High-Capacity cDNA Reverse Transcription Kit according to manufacturerś protocol.\ntable:files/protocols_protocol_1397_7.csv\nMeasure gene expression by qPCR with TaqMan Fast Universal PCR Master Mix according to manufacturerś protocol.\ntable:files/protocols_protocol_1397_8.csv\nAnalyze qPCR data using the DDDDCt method by comparing the expression of target genes of interest (ccl20, il1b, il10, il17a/f1, mpz, nos2a) relative to actb1. (troubleshooting 2[href=https://www.wicell.org#sec7.3]).\nBioinformatic identification of environmental compound mechanisms\nTiming: Variable\nIn this step, we describe how to bioinformatically analyze the pathways regulated by each compound",
    "To identify mechanisms associated with compound hits from the EPA ToxCast inventory, go to the Dashboard, here. These data are derived from the EPA ToxCast compound inventory studies (Dix et al., 2007[href=https://www.wicell.org#bib2]; Sipes et al., 2013[href=https://www.wicell.org#bib5]).\nSearch for a compound of interest.\nIdentify the molecules which interact with the compound of interest using the “Bioactivity” ↪ “ToxCast: Summary”.\nTo construct interaction networks, go to https://www.networkanalyst.ca/[href=https://www.networkanalyst.ca/] and input the gene set of interest derived from the compound’s interactions.\nSelect the species of interest as well as the database of interest to identify interactions between the interacting molecules (Figure 1[href=https://www.wicell.org#fig1]E).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1397-Fig1.jpg\nFigure 1. Expected outcomes of screening environmental factors in zebrafish\n(A) Expression of myelin protein zero (mpz) in different exposure time points. LPS + cuprizone exposure results in significant demyelination in all measured time points.\n(B) LPS + cuprizone induces expression of inflammatory markers. Expression of il1b, il10, il17a/f1, and ccl20 is significantly increased after 48 h cuprizone exposure.\n(C) Expression of inducible nitric oxide synthase (nos2a) in different exposure time points.\n(D) LPS + cuprizone causes astrocyte activation. Dot plot analysis of gfap::EGFP expression after 48 h LPS + cuprizone exposure demonstrates increased gfap::EGFP expression. Expression of nos2a in gfap::EGFP+ cells is increased after 48 h LPS + cuprizone exposure.\n(E and F) Example upload and (F) visualization in NetworkAnalyst of geneset identified by compound screening. ∗∗p<0.001; ∗∗∗ p<0.0001. Data shown as mean±SEM."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Neuroscience",
    "Immunology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}