{
  "id": 9350,
  "origin_website": "Jove",
  "title": "Extracellular Wire Tetrode Recording in Brain of Freely Walking Insects",
  "procedures": [
    "1. Preparation of Tetrode Wires\nPull out a very thin nichrome wire (12 μm diameter, PAC coating) of about 1.1 m length. Attach a tape tag to each end. Hang the wire over a horizontal threaded rod such that the two ends are at the same height near the benchtop.\nRepeat step 1.1 for a second wire, making two more ends for a total of 4, and place it next to the first wire (about 1 cm in between).\nStick the four ends together with a tape tag and attach the tag to a motorized rotating winding device. This device can be made from an inexpensive dc motor.\nWind the tetrode in one direction for 2 min (60 rpm) and unwind it in the opposite direction for 30 sec.\nUse a heat gun to fuse the wires together. Do not touch the wires with the gun. Use three up and down passes from alternating directions, with each pass taking about 10 sec.\nCut the top and the bottom of the wound wires. The four wires are twisted and fused together at one end but separate at the other.\nAdd the supporting tube. Cut a 30 cm length of polyethylene tubing (diameter: inside 0.28 mm, outside 0.61 mm). Thread the tetrode very slowly and carefully into the supporting tube so that it does not kink.\nOnce the fused end appears out the other side, pull it through so that there is an equal length of wire at both ends of the guide tube.\nGrab the separate end of each wire with a forceps. Using the base of the flame of a gas burner, carefully burn the insulation off of the last 2 or 3 mm of each wire. Heat the wire until it glows, but does not curl.",
    "Connect the tetrode with a male-female IC socket adaptor that fits your recording device. Put the deinsulated end of each wire into a different socket of the adaptor with a forceps. Stabilize the wire in the socket with a small brass pin. Use a fine point soldering iron and fill the socket with the melted solder. Be careful to not contact the fragile wire with the soldering iron.\nCheck the impedance of each wire and the inter impedance of each pair of wires.\n\t\nPlace the fused, twisted end into a container of saline and connect a copper wire conductor from the saline to the ohm meter.\nConnect the other end of the meter to the socket pin containing the wire. The impedance of each wire should be below 3 MΩ. \nIf the above values are not attained, reattempt the solder connections.\nRemove the wires from the saline, rinse the tips with water, and test the inter wire impedance for each pairing (n=6). The inter impedance should be above 5 MΩ.\nIf the above values are not attained, slice a small amount of the tip off at the fused end and retest. \nDiscard any wire set that does not meet both of the impedance requirements for all of the wires.\nSecure the tetrode.\n\t\nFold a small rectangular paper box slightly larger than the socket adaptor.\nTransfer the adaptor into the box with the male side at the bottom. Penetrate the box such that all the pins of the male side are outside the box while the rest of the adaptor is inside the box.",
    "Tape the corners of the box on the outside. Use small pieces of double sided sticky tape on the inside of the box to stabilize any individual strands of wire. The wire should be fused as it exits the box.\nMix fast set 2 part epoxy and pour into the box to secure the adaptor and all the wires.\nAttach the near end of the guide tubing to one side of the box with dental wax but leave the tubing open such that the tetrode can be pulled through freely at both ends.\nSharpen the tetrode.\n\t\nBefore each experiment, cut the tip of the tetrode with a sharp scalpel blade, not scissors. This prevents crushing and splaying of the wire ends while providing a clean flat edge for the next step.\n\t\t\nUse a small rotary tool mounted vertically with medium and fine grit sanding disks (these can be combined on one platform) to polish the tetrode and remove some tip insulation. Hold the bundle near its end with forceps. Tilt the wire set end to a 45° angle relative to the sanding disk and gently touch it to the moderate speed spinning disk for about 1 or 2 sec each on the medium and then the fine grits. Repeat this three more times, axially rotating the bundle 90° each time. It is critical that the direction of spin of the sanding disks is away from the shallow angle of the wire ends, otherwise separation of the wires may occur.\nThe desired result transforms the bundle end from a straight edge to a pointed tip with small amounts of insulation removed from the end of each wire. Verify the point using a dissecting microscope before plating the tetrode. If any fraying occurs at the tip, recut and repolish.",
    "If impedance testing during the subsequent plating step shows extremely low inter wire values (less than 4 MΩ), it indicates too much material removed during the polishing step. Recut and repolish the tetrode.\nPlate the tetrode. Put the tip of the tetrode into a saturated copper sulfate solution (85 ml water, 5 ml sulfuric acid, 50 g copper sulfate). Plate each wire with a current of 2.5 μA with a stimulus isolator. Inject the current for 1 sec, pause for 1 sec and repeat this process 4x.\nCheck the impedance of each wire and the interimpedance of each pair of wires. The impedance of each wire should be between 0.5-1 MΩ and the inter impedance should be above 4 MΩ.\nMount the adaptor onto the headstage of a multichannel recording system.\nAttach a bent insect pin to a micromanipulator. Attach the tip of the tetrode to the insect pin with dental wax\n2. Animal Preparation\nAnesthetize the cockroach with ice.\nAfter the cockroach stops moving, restrain the cockroach vertically against a flat cork surface with large saddle pins that straddle the insect but do not penetrate any part of its body.\nTransfer the preparation into a plastic container and place ice around the animal to minimize blood flow and body movements.\nPosition a plastic collar at the neck to support the head and place dental wax around the head to stabilize it.\nCut a small window between the ocelli with a razor blade and remove the cuticle from the head.\nRemove connective tissues and fat with a forceps to expose the brain.\nPlace some cockroach saline into the head capsule to cover the brain tissue.",
    "To desheath the brain, use a fine forceps to gently grab the sheath on top of the brain and use another fine forceps to tear the sheath apart in the wire implanted area.\nOpen a small hole in the head capsule anterior to the brain with an insect pin. Insert a braid of three larger diameters (56 µm) insulated copper wires into the hole to serve as a reference/ground electrode.\nLower the tip of the tetrode to the brain surface with the micromanipulator and position it near the brain region of interest.\nCarefully place two small pieces of thin acetate sheet (2 mm x 1 mm), slightly larger than the hole in the head capsule, anterior and posterior to the tetrode.\nTurn on the recording system.\nSlowly lower the tetrode 150-250 µm below the brain surface depending on the recording quality.\nTurn off the recording system.\nMove the two pieces of acetate sheet as close to the tetrode as possible without touching it (Figure 1A).\nHeat a small spatula or flattened hypodermic needle and put it into dental wax such that there is liquid wax at the tip of the spatula. Carefully touch the far end of each piece of acetate sheet from the tetrode with the spatula so that liquid wax can flow onto each piece and seal the gap between it and the head cuticle.\nRepeat step 2.16. Drop a small amount of liquid wax onto the acetate sheet each time. Start the process far away from the tetrode and move gradually towards it. Eventually the tetrode will be anchored by dental wax. Avoid getting hot wax into the cavity and onto the brain.\nUse the same method as steps 2.16 and 2.17 to anchor the reference/ground electrode with wax.",
    "Heat the wax that attaches the tetrode to the micromanipulator to release the tetrode from it.\nLoop the tetrode into the dental wax on the head to provide a strain relief (Figure 1B).\nCover the strain relief loop with dental wax (Figure 1C).\nCarefully remove the constraints and transfer the preparation onto a Petri dish. Restrain the preparation dorsal side up with large saddle pins.\nAttach a rod to the pronotum using a glue gun. This is a wooden stick which extends from the pronotum over the abdomen.\nAttach the tip of the tetrode tubing to the posterior end of the rod with dental wax.\nAnchor the tetrode and the reference/ground electrode to the anterior end of the rod with dental wax.\nPull the tetrode from the socket end of the tubing as much as possible, but do not tug on it, in order to eliminate the chance that the animal may damage the portion of the tetrode outside the tubing (Figure 1D).\nRemove all the constraints. Attach the reference/ground electrode to the tetrode tubing with dental wax.\nWait at least 60 min for the animal to recover from the ice anesthesia before any experiment.\n3. Experimental Procedures\nConnect a PC with both the recording system and an LED light using a USB to serial port cable.\nStart neural recordings.\nStart video recordings at 20 frames per second for walking experiments using the Motmot image acquisition package16 or 120 fps for climbing experiments using a high speed camera.",
    "Place the cockroach into a 40 cm x 40 cm Plexiglas arena for walking experiments or a 58 cm long, 5 cm wide, and 5 cm high arena for climbing experiments. The walking arena has a transparent barrier extending from the middle of the right wall to the center of the arena, above which the headstage is located. The barrier is used to prevent animals from walking in areas where the camera view is blocked by the headstage. The climbing arena has an acrylic block (either 1.2 cm or 1.8 cm high, and 5 cm wide) or a shelf located at a comparable height in the center.\nGenerate a TTL pulse from the PC using a customized MATLAB command. (s=serial('COM4'); fopen(s); s.RequestToSend='off'/s.RequestToSend='on'/; fclose(s); delete(s);). The TTL pulse generates a timestamp for the recording system and either turns on or turns off the LED light. \nAllow the cockroach to explore the arena until it stops moving for more than 30 seconds for walking experiments. Allow the cockroach to either climb over the block/shelf or tunnel through the shelf for climbing experiments. \nStop video recordings.\nStop neural recordings.\nWrite down the timestamp generated by the TTL pulse.\nRemove the cockroach from the arena and wait at least 3 min.\nRepeat steps 3.2-3.10 for the next trial.\nOnce all recordings have been completed, pass 5 sec of 5 µA DC current through one of the wire tips (anode) and the reference electrode (cathode) to deposit copper into the brain at the wire tip.\n4. Offline Analysis\nSynchronize video and neural data by linking the frame where the LED light is switched and the timestamp recorded by the recording system at that moment.",
    "Mark wire tip locations. Use Timms intensification procedures to precipitate and observe the copper in 12 µm serial sections17. Prominent deposits should be visible in 3-8 adjacent sections (about 18-48% of the length of the dorsal ventral plane of the area we record from) (Figure 2).\nCorrelate specific electrical impulses to the activity of single neurons. Follow spike sorting procedures laid out in detail elsewhere10,14,18. Use the program KlustaKwik (version 1.5, author K. Harris, Rutgers University) to generate initial, automated clustering. Import them into the program MClust (version 3.5, authors A.D. Redish et al., University of Minnesota) for further refinement and analysis (Figure 3).\nTrack the cockroach’s movements. For walking experiments, extract the position of the cockroach’s (visual) center of mass and its body orientation in each frame of the video recordings using the Caltech Multiple Fly Tracker (version 0.1.5.6; http://ctrax.sourceforge.net/) and the associated FixErrors toolbox for MATLAB19. For climbing experiments, extract the position of the block and the cockroach’s head and pronotum in each frame of the video using motion analysis software package.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}