{
  "id": 6798,
  "origin_website": "Bio",
  "title": "Measurement of Protein-Protein Interactions through Microscale Thermophoresis (MST)",
  "procedures": [
    "Cell cultureCHO-K1 cells were cultured in Ham’s F12 Nutrient mixture with 1% P/S and 10% FBS.Cells were passaged every 3 days.The subculturing of the cells requires their detachment from the support and their separation, which is performed by the action of a proteolytic enzyme, trypsin. The action of trypsin must be stopped by adding complete medium. A volume of 1.5 ml of 0.25% trypsin was introduced into the flask, which was then placed in an incubator (5 min at 37 °C). It is possible to assist the detachment by gently shaking the box. The action of trypsin was then stopped. A volume of 3.5 ml of supplemented complete medium was added to the flask. The cells were carefully homogenized by pipetting up and down. The volume of cell suspension and the volume of medium to be introduced into each flask were calculated depending on how many cells were needed to perform the MST experiments. The flasks were then placed in the incubator at 37 °C. Every two days, the culture medium was replaced, and the cells were observed. The subculture rate was adapted according to the growth rate of the cell line used.Subculturing/passaging of cells immediately before the plateau is reached, when the cells are still growing exponentially, will result in improved overall cell viability and yield cells that are less aggregated, and this will shorten the lag time. The process does not have to be exact. It involves an estimation within a range. The cells should be between 50% and 100% confluent, which will become easier to estimate as more experience is gained in culturing cells. If in doubt, subculturing cells at between 60% and 90% confluency is best.Cell transfectionTransfect the cells with the Cell Line Nucleofector® Kit T Program U-023 and the pcDNA3.1 Hygro plasmid expressing PD-1-eGFP.",
    "Two micrograms of plasmid should be used for one million CHO-K1 cells in 100 µl of Nucleofector solution (Figure 1).Incubate the cells for 48 h.Select the cells (use the appropriate selective pressure) for 3 weeks. In our case, 10 µl/ml GeneticinTM Selective Antibiotic (Thermo Fisher Scientific) was used.Select the subpopulation that strongly expresses eGFP by flow cytometry.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200330/20200330122117_9107.jpgFigure 1. PD-L1 sequences of plasmids purchased from GeneCopoeia (CS-GS402L-M10/pReceiver-M10 and CS-GS406L-M10/pReceiver-M10). Restriction enzyme sites are highlighted in red.Protein extractionPlate the CHO-K1 cells overexpressing the R-eGFP proteins in T75 flasks.Treat the CHO-K1 cells when they reach 80% confluency using an inverted laboratory microscope with LED illumination (Leica Microsystems).Wash the cells with 3-5 ml PBS.Trypsinize the cells with 1.5 ml trypsin.Stop the trypsinization with 3.5 ml of complete medium.Centrifuge the cells at 400 x g and 4 °C for 5 min using  SIGMA 3-16KL  (Sigma Labourzentrifugen GmbH).Remove the supernatant.Wash the cells with 5 ml of PBS.Centrifuge the cells at 400 x g and 4 °C for 5 min.Remove the PBS.Resuspend the cells in lysis buffer and incubate them for 30 min at 4 °C with 300 µl RIPA buffer + 3 µl HaltTM Protease Inhibitor Cocktail.Centrifuge the cells at 25,200 x g and 4 °C for 45 min.Aliquot the supernatant.Freeze the samples (80 °C) for further investigations.PD-1 binding assayRecommendations:A stepwise dilution of the ligand in assay buffer should be performed. Typically, a serial 1:1 dilution is performed by transferring one volume of ligand solution into an equal volume of buffer, mixing, and repeating these steps. In this way, the ligand concentration is reduced by 50% for each dilution step (Figure 2).Never prepare less than 20 μl of sample. Otherwise, the probability of encountering problems due to evaporation, adsorption of the sample material to the plastic micro reaction tubes and pipetting errors is increased.",
    "Never prepare small volumes (e.g., 20 μl) in large micro reaction tubes (e.g., 500 μl or more). The high surface-to-volume ratio leads to surface adsorption even for well-behaved proteins. Always use the smallest micro reaction tubes possible (e.g., PCR tubes).Always mix very small volumes with a pipette. Do not vortex. Do not flip the tube.Avoid any buffer dilution effects. The buffer in tube 1 and the buffer in tubes 2-16 must be the same. Otherwise, you will create a gradient in the concentrations of salt, DMSO, glycerol or other additives. This will bias the MST measurements.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200330/20200330122144_5611.jpgFigure 2. MST step by step procedure. A. How to prepare a serial dilution range. B. How to correctly fill capillaries."
  ],
  "subjectAreas": [
    "Biochemistry",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}