{
  "id": 3687,
  "origin_website": "Cell",
  "title": "Data-deposition protocols for correlative soft X-ray tomography and super-resolution structured illumination microscopy applications",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThis section details the steps required for depositing SIM data to BioStudies and SXT data to EMPIAR. An overview of the whole process is provided in Figure 3[href=https://www.wicell.org#fig3].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/374-Fig3.jpg\nFigure 3. Overview of the workflow for uploading CLXM data to the appropriate EMBL-EBI archives\nCritical: At present SIM data should be deposited in BioStudies first to generate a BioStudies accession code, which is needed for depositing SXT data in EMPIAR.\nDeposition of light microscopy data (BioStudies)\nTiming: 30 min to 1 week depending on number of files and overall data size\nThe deposition of light microscopy data to the BioStudies archive comprises three main steps: (a) registering an account with BioStudies, (b) uploading the data, and (c) uploading the metadata (as per Table 1[href=https://www.wicell.org#tbl1]). These steps are described in detail below.\nRegister at the BioStudies database\nOpen the BioStudies submission page: https://www.ebi.ac.uk/biostudies/submissions[href=https://www.ebi.ac.uk/biostudies/submissions].\nClick on “Register.”\nComplete the form providing the following personal information: name, email address, ORCID (optional), and a password.\nNote: The data will be stored, processed, and shared in a GDPR-compliant fashion according to EMBL-EBI and BioStudies GDPR privacy notices.\nActivate your account by opening the link sent to the email address you provided.\nLogin to the BioStudies submission system using the same link as in step 1a. In the home portal you can find a history of previous data submissions, as well as those still in progress under the “Drafts” tab.\nTo begin the data-upload process click on the “Files” tab in the upper right corner (Figure S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/protocol-id-Mmc1.extension]A). Depending on your chosen method for upload follow the instructions below:\nAspera:\nClick the “FTP/Aspera” button on the upper right corner (Figure S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/protocol-id-Mmc1.extension]A).",
    "In the pop-up window, note the code for the “secret” directory as shown in Figure S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/protocol-id-Mmc1.extension]B (this will be the destination directory to which the data are to be uploaded).\nIn the command prompt, type the path to the ascp file in the directory where you installed the Aspera client (refer to step 2b in the “File upload software setup and installation” section above), followed by the connection settings, the path of the source directory to be uploaded and, the path of the destination “secret” directory. This information is provided in the FTP/Aspera pop-up window (Figure S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/protocol-id-Mmc1.extension]B).\nFor example, to begin the upload, first enter the path to the Aspera executable (this varies by operating system):\nWindows:\nC:\\Users\\<your_user_name>\\AppData\\Local\\Programs\\Aspera\\Aspera Connect\\bin\\ascp.exe\nMac:\n∼/Applications/Aspera\\ Connect.app/Contents/Resources/ascp\nLinux:\n∼/.aspera/connect/bin/ascp\nNote: Default paths are used in the above examples. The path to the Aspera executable (ascp) will depend on where you installed the Aspera client\nFollowed by the arguments:\n-P33001 -i ..\\etc\\asperaweb_id_dsa.openssh -d <directory to upload> bsaspera_w@hx-fasp-1.ebi.ac.uk:.<[href=https://www.wicell.orgmailto:bsaspera_w@hx-fasp-1.ebi.ac.uk:.%3c];secret directory>\nNote: Refer to Troubleshooting 1[href=https://www.wicell.org#troubleshooting] if Aspera transfer is blocked by your local firewall.\nTransfer via FTP: you can use any freely available FTP client such as FileZilla (https://filezilla-project.org/[href=https://filezilla-project.org/]) or use the command line to execute FTP commands as follows:\nClick the “FTP/Aspera” button on the upper right corner (Figure S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/protocol-id-Mmc1.extension]A).\nIn the pop-up window note the code for the “secret” directory as shown in Figure S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/protocol-id-Mmc1.extension]B (this will be the destination directory where the data are to be uploaded to).\nOpen a command prompt and type ftp then at the ftp> prompt type open followed by the link to your chosen FTP server.\nWhen prompted type your username and password.",
    "Define the source and destination directories as follows: type cd followed by the path of the source directory, then type put followed by the destination directory which will be your secret directory noted from step (ii).\nNote: Further help on how to transfer files using FTP or Aspera can be found at https://www.ebi.ac.uk/ega/about/ftp-aspera[href=https://www.ebi.ac.uk/ega/about/ftp-aspera].\nTransfer via HTTP: click “File upload” or “Folder upload,” select from your local system the files or folder to be uploaded and confirm. The upload progress for each of the files and directories selected will be shown in the “Progress” column of the “Files” table (Figure S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/protocol-id-Mmc1.extension]A).\nPause Point: 1 min – 1 week depending on number of files and overall data size.\nUpload the relevant metadata describing the dataset (based on Table 1[href=https://www.wicell.org#tbl1]). This can be done in one of two ways:\nWeb form (under development):\nFill all mandatory fields.\nClick the “Submit” button which appears after all relevant fields are completed.\nExcel template:\nDownload template from ftp://ftp.biostudies.ebi.ac.uk/biostudies/pub/BioImaging/templates/ (file “SIM_template.xlsx”).\nComplete the template.\nSend the completed file to biostudies@ebi.ac.uk[href=https://www.wicell.orgmailto:biostudies@ebi.ac.uk] for processing.\nNote: You will now receive your BioStudies accession code which can be cited in your publication. This code will also be required to complete the deposition of the corresponding SXT data to EMPIAR.\nDeposition of X-ray microscopy data (EMPIAR)\nTiming: 30 min to 1 week depending on number of files and overall data size\nRegister an account with the EMPIAR database\nOpen the EMPIAR deposition webpage: https://empiar.org/deposition/login[href=https://empiar.org/deposition/login].\nClick on “Register as a new user.”\nCompete the web form providing general information, such as your name, contact details, and a password.\nNote: The data will be stored, processed, and shared in a GDPR-compliant fashion, according to EMBL-EBI (https://www.ebi.ac.uk/data-protection/privacy-notice/embl-ebi-public-website[href=https://www.ebi.ac.uk/data-protection/privacy-notice/embl-ebi-public-website]) and EMPIAR Deposition System Data Protection (https://empiar.org/deposition/gdpr[href=https://empiar.org/deposition/gdpr]) schemes.",
    "Activate the account by opening the web link sent to the email address that you provided.\nOptional: you can use your Google, Facebook, or ORCID account to sign in.\nLogin to the EMPIAR deposition system using the same link as in step 5a to reach the deposition home portal; then click on “Begin/Continue an EMPIAR deposition” (Figure S3[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/protocol-id-Mmc1.extension]A).\nClick on “Create a new deposition” (Figure S3[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/protocol-id-Mmc1.extension]B) to reach the “Deposition overview” page.\nComplete the web form providing some of the initial metadata associated with your dataset as follows:\nDeposition image: click “choose a file” to upload a figure (not subject to copyright, e.g., by a journal) that illustrates a facet of your data or study (see Figure S4[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/protocol-id-Mmc1.extension]A).\nNote: This image will be used on the EMPIAR website to illustrate your entry.\nCitations: complete the details of the publication where the data are described (e.g., DOI, journal name, authors etc.).\nNote: Publication details can be automatically filled if you provide a DOI or PubMed ID.\nNote: More than one publication can be added by pressing the “Add Citation” button. The first publication provided will be the primary one.\nNote: If the data are not published yet, then some of the fields can be omitted or filled by pressing the associated “N/A” button. Publication details can be updated by curators at a later stage but remains the depositor’s responsibility to communicate publications associated with this data as and when they are released.\nEntry details: enter a title for the dataset, followed by “Entry type” and “Release instructions” as follows:",
    "Entry type: select the type or modality used to acquire the dataset from the available options. For the scope of this protocol, select the “CLXM” option to upload the SXT data here (while the corresponding SIM data should be uploaded in the BioStudies archive as explained above).\nNote: You will be required to provide the BioStudies accession code (refer to footnote 1) where the corresponding SIM data are stored (see step 8d).\nRelease instructions: choose an option (listed in Table 3[href=https://www.wicell.org#tbl3]) to indicate when the entry should be released (made available to the public) once it has been submitted and processed successfully.\ntable:files/protocols_protocol_374_3.csv\nCross-references: enter the accession codes of related datasets. For CLXM data, the BioStudies code for the corresponding light microscopy data is required. Click “N/A” for other unrelated codes such as EMDB (see Figure S4[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/protocol-id-Mmc1.extension]B).\nEntry authors, Corresponding author and Principal Investigator(s): provide the relevant information of the research team that conducted the study.\nNote: Entry authors may differ from the publication(s) authors specified previously.\nNote: All authors must be listed under “Entry authors” including those listed as corresponding author and principal investigator(s).\nPress the “Save & Validate” button on the “Deposition overview” page. If all fields have been successfully completed, you will be transferred to the “Upload data” page.\nUpload the data using one of the three available methods:\nTransfer via Globus:\nIn the “Upload data” page, click “Globus” under “Options for upload” and note your username and password for the EMBL-EBI endpoint (Figure S5[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/protocol-id-Mmc1.extension]A).\nEnsure you have set up your Globus account and personal endpoint (refer to step 2a in “File upload software setup and installation”).\nLogin at the Globus webpage www.globus.org[href=http://www.globus.org] to reach the “File Manager” interface.",
    "In the “Collection” field, search for and select “EMBL-EBI Private endpoint,” then enter your authentication username and password noted from step (i). Enter your EMPIAR directory by selecting the link provided back in the “Upload data” page under the option “Globus” (Figure S5[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/protocol-id-Mmc1.extension]B).\nIn the Globus “File Manager,” click “Transfer or Sync…” then search for and select your personal endpoint in the second “Collection” field (Figure S5[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/protocol-id-Mmc1.extension]C).\nUnder your personal endpoint, navigate to the directory to be uploaded and click “Start” to begin the transfer to the EMPIAR directory. You can follow the status of your transfer under the “Activity” tab (Figure S5[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/protocol-id-Mmc1.extension]C).\nTransfer via Aspera (command-line client):\nIn the command prompt, type the path to the ascp file in the directory where you installed the Aspera client (refer to step 2b in the “File upload software setup and installation” section above), followed by the connection settings, the path of the source directory to be uploaded, and the path of the destination EMPIAR directory. This information is provided by selecting “Aspera Command Line” under “Options to upload.”\nFor example, to begin the upload, first enter the path to the Apera executable (this varies by operating system):\nWindows:\nC:\\Users\\<your_user_name>\\AppData\\Local\\Programs\\Aspera\\Aspera Connect\\bin\\ascp.exe\nMac:\n∼/Applications/Aspera\\ Connect.app/Contents/Resources/ascp\nLinux:\n∼/.aspera/connect/bin/ascp\nNote: Default paths are used in the above examples. The path to the Aspera executable (ascp) will depend on where you installed the Aspera client\nFollowed by the arguments:\nQT -P 33001 -l 200M -L- -k3 <directory to upload> emp_dep@hx-fasp-1.ebi.ac.uk:upload/<;your_unique_directory_name>/data[href=https://www.wicell.orgmailto:emp_dep@hx-fasp-1.ebi.ac.uk:upload/%3c;your_unique_directory_name%3e/data]\nWhen prompted enter the provided password for your EMPIAR upload.\nTransfer via Aspera Connect (web interface):\nClick on “Aspera web interface” under “Options to upload.”\nSelect either the “Upload files” or “Upload directories” option.",
    "Select the files or directories to upload from the pop-up dialog (a maximum limit of files/directories selected will be set by your web-browser and operating system).\nTransfer via FTP: you can use any freely available FTP client such as FileZilla (https://filezilla-project.org/[href=https://filezilla-project.org/]) or use the command line to execute FTP commands following similar steps as in step 3b of the “Deposition of Light Microscopy Data” section. You will need to contact EMPIAR team (empdep-help@ebi.ac.uk[href=https://www.wicell.orgmailto:empdep-help@ebi.ac.uk]) to obtain your destination directory.\nNote: Refer to Troubleshooting 1[href=https://www.wicell.org#troubleshooting] if Aspera transfer is blocked by your local firewall.\nNote: Refer to Troubleshooting 2[href=https://www.wicell.org#troubleshooting] if problems are encountered using the above upload methods.\nPause Point: 1 min – 1 week depending on number of files and overall data size\nIn the “Upload data” page, click the “Associate image sets with the data” link from the left-hand-side menu (Figure S5[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/protocol-id-Mmc1.extension]A).\nComplete the web form of the requested metadata to describe at least one image set. Additional metadata (in accordance with Table 1[href=https://www.wicell.org#tbl1]) should be entered in the “Details” field of the web form.\nNote: This is for bioimage data only. Any textual and other supplementary data should not be created as a separate image set, but rather described in the free text “Details” field. Some of the fields can be automatically filled from the header of an image file by clicking the “Populate Form” button.\nOptional: check the data for consistency by:\nDownloading a script that compares checksums of files on your machine and those stored in EMPIAR using the MD5 message-digest algorithm.\nDownloading a listing of files present on the EMPIAR side.\nPress the “Save + Validation” button on the “Associate image sets with the data” page.",
    "Optional: describe EMDB-SFF (https://emdb-empiar.org/emschema/segmentation.html/[href=https://emdb-empiar.org/emschema/segmentation.html/]) segmentation files. Segmentation is the decomposition of 3D volumes into regions that can be associated with defined (biological) objects. You can also provide the original segmentation files from software such as Amira HyperSurface (.surf), Segger (.seg), EMDB Map masks (.map), IMOD (.mod), etc.\nNote: Click the “Add segmentations” button at the bottom of the “Associate image sets with the data” page. A page “Associate segmentations with the data” will be opened where you can select one of your image sets and associate it with a segmentation file. This can be done for multiple files / image sets. If you change your mind you can click “Remove all segmentations.” You will not be able to submit unless you either remove all segmentations or save them with validation.\nClick the “Submit entry” button.\nNote: You will be redirected to the main deposition page where you can see your accession code, which can be cited in your publication.\nNote: Once the entry has been checked by the EMPIAR curation team, you will receive a request to approve the entry."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Structural Biology",
    "Bioinformatics",
    "Microscopy"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology",
    "Bioengineering & Technology"
  ]
}