{
  "id": 17001,
  "origin_website": "Jove",
  "title": "The Third Channel-Assisted Unilateral Biportal Endoscopic Technique for Lumbar Spinal Stenosis Combined with Contralateral Disc Herniation",
  "procedures": [
    "The Institutional Review Board of the Third Affiliated Hospital at Sun Yat-sen University approved the protocols (ID:[2022]02-356-01). All included patients were required to sign an informed consent form.\n1. Surgical indications\nInclude patients with lumbar spinal stenosis who have contra-lateral recess stenosis or disc herniation or who have contra-lateral neural compression.\n2. Surgical method\nPerform bilateral endoscopic spinal canal decompression via UBE-ULBD technique and endoscopic discectomy via T-UBE.\n3. Preoperative procedure\nAnesthesia and surgical position:\n\t\nUnder general anesthesia, position the patient prone on a spinal frame, avoiding any discomfort. Flex the lumbar spine slightly to open up the interlaminar space.\n\t\tNOTE: General anesthesia with endotracheal intubation or combined spinal-epidural anesthesia is used for surgical procedures to minimize intraoperative pain.\nDesired portals position (L4-5, for example):\n\t\nObtain a standard anteroposterior (AP) X-ray view, and let the target intervertebral space be vertical to the ground in the X-ray lateral view by adjusting the surgical table.\nMark the bilateral pedicles of L5 and the ipsilateral pedicle of L4. Draw a line along the midline of the L4/5 intervertebral disc and the posterior midline of the spine.\nOn the ipsilateral side, mark two incisions 1.5 cm above and below the midline of the intervertebral disc for manipulation and endoscopic portal, respectively. Locate the third channel incision on the contra-lateral midline of the L4/5 intervertebral disc space.\n4. Surgery procedure (L4-5, for example)\nSterilize the surgical site with iodine tincture and 75% alcohol, and prepare the site with waterproof drapes.\nEstablish UBE endoscopic channel and ipsilateral working channel.",
    "Insert two syringe needles from the medial edge of the line of the ipsilateral pedicle shadow, one at 15 mm cranial and the other at 15 mm caudal, to the midline of the L4/5 intervertebral disc. The inserted needles will form a triangle and meet at the L4/5 interlaminar.\nThen, make two 8-10 mm longitudinal skin incisions for endoscopic and manipulated portals based on the location of the aforementioned needles.\nAfter dissecting the extralaminal soft tissue with a curette, insert serial dilators to expand the surgical field. Then, establish the endoscopic channel and working channel, converging along the sublaminar edge.\nEstablish endoscopic operating space (Figure 1A-C)\n\t\nInsert a 30-degree endoscope via the viewing channel, connected to a continuous gravity saline irrigation positioned 50-60 cm high above the patient.\nAfter that, insert the surgical instruments and a radiofrequency ablation blade via the working channel to remove the soft tissue on the laminar surface until exposure of the lower edge of the L4 lamina, the ligamentum flavum, and the medial edge of the ipsilateral L4/5 facet joint. Establish the endoscopic operating space.\nIpsilateral laminotomy and neural decompression (Figure 2A-D, Figure 3A-D)\n\t\nRemove the ipsilateral lower part of the L4 lamina, the upper part of the L5 lamina, and the medial inferior facet by a 3.5-mm high-speed drill (8000 rotations/s) and Kerrison punches until the ligamentum flavum is fully mobilized.\nThen, separate the ligamentum flavum from the dural sac and gradually remove it from the cranial to the caudal end with Kerrison punches or forceps.\nAfter that, carefully remove the medial facet joint of L4/5 and the hyperplastic facet joint bone with a soft-tissue protection drill or punches until the traversing nerve root is completely decompressed.\nEnsure that more than 50% of the medial facet is preserved, avoiding the possibility of spinal instability.",
    "Contra-lateral dorsal neural decompression (Figure 4A-E)\n\t\nRemove the base of the L4 spinous process with a drill (8000 rotations/s) and adjust the working channel obliquely towards the contralateral spinal canal.\nUndercut the medial part of the contralateral L4 inferior facet, fully expose the contralateral ligamentum, separate from the dural sac, and remove it using Kerrison punches (4 mm) until adequate dorsal neural decompression.\nContralateral third channel-assisted discectomy (Figure 5A-C, Figure 6A-E)\n\t\nMake an 8-mm longitudinal skin incision adjacent (5 mm) to the spinous process at the midline of the contralateral disc. Insert a K-wire, followed by serial dilators under endoscopic view, to establish the contra-lateral working channel.\nAfter the thecal sac and contra-lateral traversing nerve root (L5) are retracted and well protected, expose the contralateral herniated disc fragment. Then, insert forceps or other instruments vertically into the contra-lateral disc space and remove the herniated disc tissues through the third channel.\nAt last, use a blunt nerve hook to explore the dural sac and bilateral nerve roots to ensure sufficient spinal decompression.\nPlace a drainage tube outside the lamina and suture each incision to complete the operation.\n\tNOTE: The surgical instruments used in the T-UBE technique are essentially the same as those used in the conventional UBE technique and traditional open spinal surgery. There is no need to purchase specialized instruments. T-UBE instruments include a 30-degree, 4-mm-diameter arthroscope, an endoscopic sheath, standard laminectomy instruments such as Kerrison punches, forceps, and nerve hooks, as well as a bipolar flexible radiofrequency probe, and a 3.5-mm radiofrequency electrode.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}