{
  "id": 11985,
  "origin_website": "Jove",
  "title": "Assessing Cellular Target Engagement by SHP2 (PTPN11) Phosphatase Inhibitors",
  "procedures": [
    "1. Preparation of cell culture and reagents\nFormulate a 500 mL bottle of growth media with 10% fetal bovine serum, 1x antibiotic/antimicotic, 20 mM HEPES, and 1 mM sodium pyruvate. Store at 4 °C.\nThaw cellular thermal shift reagents (EA reagent, lysis buffer, and substrate) from frozen original stock bottles.\nDispense reagents and buffer as 2 mL aliquots and store at -20 °C.\n\tNOTE: Avoid freeze/thaw for reproducibility and use only that volume of reagent required for the assay procedure.\n2. Growth and maintenance of HEK293T cells\nObtain low passage adherent HEK293T cells from cryo storage.\nMaintain HEK293T cells in growth media at 37 °C, 5% CO2.\nSplit cells every 4 days in a 1:14 ratio.\n\tNOTE: For best performance, HEK293T cells are not allowed to passage greater than 25 times.\n3. HEK293T cell preparation for transient transfection\nDetach HEK293T cells from 16 mL plates using 3 mL of the cell detachment reagent.\nDilute with 12 mL of growth media. Collect cells by centrifugation at 1,400 x g for 4 min.\nResuspend the pellet in 10 mL growth media. Measure the concentration and viability of cells using trypan blue and a cell counter.\nPlate 7.0 x 105 exponentially growing HEK293T cells per well in a 6 well cell culture plate approximately 24 h before transfection.\n\tNOTE: Reserve one well for each plasmid to be transfected.\nIncubate for 24 h at 37 °C, 5% CO2.\n4. Transfection of HEK293T cells\nFrom a purified plasmid stock of pICP-ePL-N-SHP2-WT or pICP-ePL-N-SHP2-E76K (~200 ng/µL) dilute 2 µg of plasmid DNA into 200 µL of transfection buffer.\nVortex for 10 s and centrifuge at 1,400 x g for 4 min.\nAdd 4 µL of transfection reagent to the diluted DNA. Vortex for 10 s and centrifuge at 1,400 x g for 4 min.",
    "Incubate at 23 °C for 10 min.\nRemove the 6 well plate containing growing HEK293T cells from incubator. Add the transfection mix to the attached cells in the 6-well plate. Incubate for 24 h at 37 °C, 5% CO2.\n5. Preparation of assay plates\nPrepare 10 mM stock solutions in DMSO of compounds to be tested.\nDispense inhibitor solutions into a 384-well low dead volume source plate for immediate use.\nSpot the desired volume of inhibitors or vehicle (DMSO) using a liquid handler into 384-well real-time PCR plates at a target final volume of less than 0.5% DMSO (v/v). Seal the plate using a plate sealer with inert gas purging.\n\tNOTE: For inhibitor dose-response assays, make sure to backfill DMSO accordingly so that equal amounts of DMSO are used for each inhibitor concentration. For best results, store plates at 23 °C and use plates within 24 h.\n6. Transfected cell detachment and preparation\nPreincubate growth media and cell detachment reagent in a 37 °C water bath. Remove transfected cells from the incubator. Gently aspirate media from the wells of the plate.\n\tNOTE: Use a new aspirator for every well that contains a different transfected plasmid.\nAdd 0.3 mL of the cell detachment reagent. Gently rock the plate back and forth to thoroughly cover the surface of the plate bottom. Incubate at 23 °C for 2 min.\nAdd 1 mL of growth media to each well. Gently pipette media and cells in the well and transfer to a 15 mL Falcon centrifuge tube. Collect cells by centrifugation at 1,400 x g for 4 min.\nGently but thoroughly aspirate off the media.\n\tNOTE: Residual phenol red in the cell detachment reagent can interfere with the assay.",
    "Carefully resuspend cell pellet in 2 mL of growth media. Measure the concentration and viability of cells using trypan blue and a cell counter.\n\tNOTE: Cell viability should be > 90% for best results.\nDilute cells to a concentration of 125 cells/µL. For example, for a 5 µL assay this is ~625 cells/µL. For optimal viability keep cells in suspension for no more than 2 h.\n7. Incubation of cells with SHP2 inhibitors\nDispense cells into a sterile single channel solution trough.\nCentrifuge 384-well real-time PCR plate that has been pre-prepared by SHP2 inhibitor deposition at 2,500 x g for 5 min at 23 °C.\nRemove seal from the compound plate. Using a 125 µL multichannel pipette, add 5 µL of the diluted cells to desired wells.\nCentrifuge the plate at 42 x g for 30 s without a lid on the plate. Attach a lid seal to the plate after the plate is spun down and incubate the assay plate at 37 °C, 5% CO2 for 1 h.\n8. Preparation of chemiluminescent reagent master mix\nRemove the necessary quantity of detection reagents (EA reagent, lysis buffer, and substrate) from -20 °C storage after plating cells. Thaw reagents at 23 °C.\n\tNOTE: For convenience in transfer, prepare a volume that is 1.5x the total volume of cells that have been deposited to the plate. Do not reuse reagents after use.\nPrepare a master mix of the reagents using condition EA-10, which consists of component and volume fraction as follows: EA reagent (0.17), lysis buffer (0.17), substrate (0.67).\n\tNOTE: Reagent ratios are based on optimization experiments performed as specified in the supplier's manual.\n9. Isothermal or thermal profile gradient heat pulse\nProgram the gradient capable thermocycler for the delivery of heat pulse.",
    "For thermal profile gradient experiments, preprogram the thermocycler with the following example specifications:\nHeat pulse: 3 min desired melting temperature (vertical or horizontal gradient +/- 15 °C; example 38-68 °C spread across 24 wells yields temperature increments of 1.25 °C).\nEquilibration recovery step: 3 min 20 °C with ramp speed = 1 °C/s\n\t\nFor isothermal experiments set up the protocol set up as follows:\nHeat pulse: 3 min 55 °C. Equilibration recovery step: 3 min 20 °C with ramp speed = 1°C/s\n\t\tNOTE: For increased reproducibility, as it can be difficult to place the plate precisely at the time the thermocycler reaches its desired temperature, set up the program to count down 15 s before beginning the 3 min pulse. For the thermocycler used in this experiment see Table of Materials, the lid is kept up during the heat pulse.\n10. Lysis detection and measurement\nSupplement assay plates with lysis detection master mix by addition of equal volumes (5 µL) to each well to be analyzed using a multichannel pipette.\nCentrifuge the plate 42 x g for 30 s. Store at 23 °C in darkness for 30-60 min.\nMeasure chemiluminescence using a microplate reader capable of detecting luminescence in 384-well format. Perform luminescence measurement with the plate type and integration time optimized (integration time 1000 ms, settle time 0 s). Measure values as counts/s and output for further analysis.\n11. Data analysis\nAnalyze the luminescence data using a scientific 2D graphing and statistics software.\nGenerate thermal profiles by analyzing the normalized luminescence data (normalized to the vehicle control) using nonlinear regression and a Boltzmann sigmoidal model.",
    "NOTE: In thermal profile experiments, the calculated V50, the temperature that is the halfway point between bottom and top of the curve, defines the melting temperature of SHP2. In isothermal experiments, EC50 defines the concentration of the inhibitor that gives half-maximal response.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}