{
  "id": 17587,
  "origin_website": "Jove",
  "title": "Isolation and Culture of Resident Cardiac Macrophages from the Murine Sinoatrial and Atrioventricular Node",
  "procedures": [
    "Animal care and all experimental procedures were conducted in accordance with the guidelines of the Animal Care and Ethics committee of the University of Munich and all the procedures undertaken on mice were approved by the Government of Bavaria, Munich, Germany. C57BL6/J mice were commercially obtained.\n1. Preparations\nPrepare Cell sorting buffer (Table 1) and store at 4 °C.\n\tNOTE: During the whole experimental procedure, the cell sorting buffer should always be on ice.\nPrepare Digestion buffer (Table 1) shortly before the digestion as the activity of collagenase could only be detected for few hours at room temperature.\nRefer to the previously published protocol for the preparation of dissection dish10. In brief, add 30 mL of agarose gel (3%-4%) into a 100 mm diameter Petri dish and cool down at room temperature.\n2. Animal sacrifice and heart excision\nAnesthetize the mouse with isoflurane by placing it into an incubation chamber connected with an isoflurane vaporizer and flushed with 5% isoflurane/95% oxygen.\nAfter the injection of fentanyl for analgesia, open the rib cage and perfuse the heart by injecting 5-10 mL of ice-cold 1x PBS directly into the left ventricle (LV). Extract the mice heart and put it on the dissection dish. Experimental details have been described in detail previously10.\n3. Microdissection of SAN and AVN\nAfter isolating the heart, perform the following microdissection procedures in the dissection dish with ice-cold 1x PBS under the dissecting microscope.\nUse the cardiac anatomical landmarks, i.e., aorta, pulmonary artery, coronary sinus, left/right ventricle, etc. to determine the left/right (left: LV; right: RV) and anterior/posterior (anterior: aorta; posterior: coronary sinus) of the heart. After the orientation is determined, turn around the heart with the front of it at the bottom of the dish (to expose the large veins that are located posterior).\nMicrodissection of SAN",
    "NOTE: Microdissection of the SAN have been previously described10. The process is described in brief below.\n\t\nExpose the inter-caval region by pining the right atrial appendages (RAA) and the tissue adjacent to superior vena cava (SVC) and inferior vena cava (IVC) on the microdissection dish using insect pins.\nCut the heart along the interatrial septum parallel to the crista terminalis (CT) to separate the inter-caval region and to obtain the SAN sample (Figure 1A, Figure 2A). Put the sample in an empty 1.5 mL microcentrifuge tube on ice.\nMicrodissection of AVN\nAfter collection of the SAN sample ensure that the RAA and parts of the right atrium (RA) have already been cut away leaving only the interatrial septum (IAS) and, interventricular septum (IVS).\nPin the remaining parts of the heart through the tissue adjacent to the IAS and IVS using insect pins to make the right atrial side of IAS facing up.\nLook at the right atrium on the endocardial surface for the triangle of Koch. It will be bordered anteriorly by the hinge-line of the septal leaflet of the tricuspid valve (TV), and posteriorly by the tendon of Todaro. The orifice of the coronary sinus is observed at the base. (Figure 1B, Figure 2B).\nCut the triangle of Koch, which contains the AVN, and directly put it in an empty 1.5 mL microcentrifuge tube on ice.\n4. Digestion\nPrepare the Digestion buffer (Table 1) shortly before use.\nMince the SAN and AVN tissue well with scalpels.\n\tNOTE: Mincing the tissue well will increase the digestion efficiency and help to get good cell suspension for sorting. As the SAN and AVN samples are quite small, mincing the tissue directly inside the 1.5 mL microcentrifuge tube is recommended to reduce the loss of sample.",
    "Add 500 µL of digestion buffer per sample and wash down all minced tissue from the wall of the 1.5 mL microcentrifuge tube. Gentle pipetting helps digesting the sample.\nHomogenize the tube on a vortex machine (settings: 37 °C, 750 rpm for 1 h).\nAfter digestion, transfer the tissue suspension to a fresh 15 mL centrifuge tube by passing through a 40 µm cell strainer. Rinse the cell strainer with an additional 5 mL of cell sorting buffer to stop the digestion.\nCentrifuge the 15 mL tube at 350 x g for 7 min at 4 °C. Then remove the supernatant completely using the pipette. Resuspend the cell pellet with 90 µL cell sorting buffer.\n\t​NOTE: Before magnetic separation, pipette the cell suspension gently a few times or pass through a 30 µm cell strainer to remove cell clumps if necessary, to obtain a single cell suspension for optimal performance of magnetic enrichment of interesting cell populations.\n5. Magnetic enrichment of CD45 and sample staining\nNOTE: To isolate the cardiac macrophages with high sorting efficiency, exclusion of undesired cells including lymphocytes was performed with CD45 microbeads according to the manufacturer's protocol. Based on the sorting panel, cardiac resident macrophages were identified as CD45highCD11bhighCD64high Ly6Clow/int F4/80high.\nAdd 10 µL of CD45 microbeads per 107 total cells to the cell suspension in the 15 mL centrifuge tube. Mix the samples well and incubate them for 15 min at 4 °C.\n\tNOTE: The cell counting using a hemocytometer should be briefly done to make sure that each tube contains no more than 107 total cells. When working with higher cell numbers, the volume of magnetic beads needs to be scaled up.",
    "Prepare the antibody mixture by diluting the following antibodies in cell sorting buffer (1:100 dilution for each antibody): CD45-PE, CD11b-APC-Cy7, CD64-APC, F4/80-PE-Cy7, Ly6C-FITC. DAPI will be added later to the staining for live/dead discrimination.\nAfter 15 min of magnetic bead incubation, add 100 µL of antibody mixture directly into the cell suspension in the 15 mL tube (then all the antibodies' final concentration is 1:200) and incubate for 20 min at 4 °C.\nAfter 20 min of antibody incubation, wash the cell suspension by adding 1-2 mL of cell sorting buffer per 107 cells and centrifuge at 350 x g for 10 min. Completely remove the supernatant by pipetting.\nResuspend up to 108 cells in 500 µL of cell sorting buffer.\n\tNOTE: The maximum cell number for magnetic separation should be determined according to the manufacturer's protocol.\nPrepare the magnetic separation set.\n\t\nAttach the magnetic column to a suitable magnetic separator and place a collection tube under the magnetic column.\nPrepare the magnetic columns by rinsing with cell sorting buffer: add 500 µL of cell sorting buffer at the top of the column and let the buffer pass through.\nApply the cell suspension immediately onto the column while the cell sorting buffer is passing through.\n\tNOTE: Avoid the formation of air bubbles in the column. As per the manufacture's protocol, although the column filling time might change from storage conditions, it has no influence on the quality of the separation.\nWash the column with 3 x 500 µL cell sorting buffer. The flow-through in step 5.7 and step 5.8 contain unlabeled cells, which can be discarded if no further experiment is needed.\n\t​NOTE: Add the cell sorting buffer immediately when the column reservoir is nearly empty.",
    "Remove the column from the magnetic separator and place it on a new collection tube.\nAdd 1 mL of cell sorting buffer onto the column. Immediately flush the column by firmly applying the plunger supplied with the column. The flow-through contains the magnetically labeled cells.\nAdd DAPI solution into all the collected magnetically labeled cell suspensions shortly before running them on the cell sorter. Adjust the final concentration of DAPI to 0.3-0.5 µg/mL.\nPerform FACS analysis.\n6. Samples for compensation\nPrepare 6 brown 1.5 mL microcentrifuge tubes labeled as \"PE\", \"APC-Cy7\", \"APC\", \"PE-Cy7\", \"FITC\", and \"DAPI\" respectively to protect antibodies from light. Prepare one more 1.5 mL microcentrifuge tube labeled as \"unstained\".\n\tNOTE: This could be done at the same time as incubating the cell suspension with the microbeads and antibodies. The unstained sample could be the cardiomyocyte tissue collected randomly from the spared heart tissue and also treated according to step 4.\nDilute each single fluorescence-conjugated antibody with cell sorting buffer into 1:50 in the 1.5 mL brown microcentrifuge tubes that are marked accordingly.\nAdd one drop of compensation beads solution and incubate for 20 min at 4 °C.\nAdd 2 mL of cell sorting buffer into each 1.5 mL brown microcentrifuge tube and centrifuge at 450 x g for 5 min. Completely discard the supernatant and resuspend the bead containing pellet with 300 µL cell sorting buffer and transfer them into cell sorter tubes that are also marked accordingly.\n7. Running on the cell sorter and gating strategy\nApply the unstained sample and compensation tubes first and adjust the voltages of each channel to align both the positive and negative peak to the proper position of the axis. Save the compensation settings and apply it to the following samples.",
    "Apply the samples on the cell sorter. Set the gating strategy as described in Figure 4. Cardiac resident macrophages are identified as CD45highCD11bhighCD64highLy6Clow/int F4/80high. DAPI is used as a cell viability marker.\nCheck the flow cytometry charts to confirm that the cell population of interest is properly shown on the charts. If not, adjust the voltage of each channel to the center view of each chart.\nIf the voltage settings are satisfactory, start the sorting procedure. Collect the sorted cell population into culture medium composed of DMEM containing 10% fetal bovine serum, supplemented with 100 µg/mL streptomycin and 100 U/mL penicillin.\n8. Resident macrophages culture\nAfter gathering the sorted macrophages, transfer the cells immediately either to 35 mm tissue culture dishes or 24 well plate, or directly use them for subsequent experiments.\nTo culture sorted macrophages, incubate the cells at 37 °C, 5% CO2 incubator.\nChange the culture medium every 48-72 h. Floating dead cells can be easily removed by medium change. Use live macrophages attaching to the bottom of culture dish for subsequent experiment.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}