{
  "id": 475,
  "origin_website": "Nature",
  "title": "Isolation of extracellular vesicle RNA from bile",
  "procedures": [
    "1. Collect bile into a sterile collection bottle.\n  2. Centrifuge sample at 3,000g for 10 min at 4oC to remove any cellular sediment and debris.\n  3. Transfer supernatant into 1 ml aliquots in microcentrifuge tubes and store at 4°C or -20°C for long term storage \\(> 2 days).\n  4. After thawing, filter sample using 0.20 µm filter prior to RNA isolation.\n  5. RNA Isolation can be performed from one of the following options. \n  \nA. miCURY RNA Isolation Kit, Exiqon\ni. Transfer 200 µl of bile into 1.5 ml microcentrifuge tube. \nii. Add 60 µl Lysis Solution BF, vortex 5 sec, incubate for 3 min at room temperature.\niii. Add 20 µl Protein Precipitation Solution BF, vortex 5 sec, incubate for 1 min at room temperature.\niv. Centrifuge at 11,000g for 3 min at room temperature.\nv. Transfer clear supernatant to new microcentrifuge tube.\nvi. Add 270 µl Isopropanol, vortex 5 sec.\nvii. Assemble microRNA Mini Spin Column BF in a new collection tube and load entire sample onto column.\nviii. Centrifuge at 11,000g for 30 sec at room temperature. Discard flow-through and return column to collection tube.\nix. Add 700 µl Wash Solution 2 BF to column and centrifuge at 11,000g for 30 sec at room temperature. Discard flow-through and return column to collection tube.\nx. Add 250 µl Wash Solution 2 BF to column and centrifuge at 11,000g for 2 min at room temperature. Discard flow-through and return column to collection tube.\nxi. Add 50 µl rDNase directly onto membrane of spin column. \nxii. Close lid and incubate for 15 min at room temperature\nxiii. Add 100 µl Wash Solution 1 BF to column and centrifuge at 11,000g for 30 sec at room temperature. Discard flow-through and return column to collection tube.",
    "xiv. Add 700 µl Wash Solution 2 BF to column and centrifuge at 11,000g for 30 sec at room temperature. Discard flow-through and return column to collection tube.\nxv. Add 250 µl Wash Solution 2 BF to column and centrifuge at 11,000g for 2 min at room temperature.\nxvi. Transfer spin column into a new collection tube.\nxvii. Add 50 µl RNase free H2O directly onto the membrane of spin column.\nxviii. Close lid and incubate for 1 min at room temperature.\nxix. Centrifuge at 11,000g for 1 min at room temperature.\nxx. Discard spin column and store purified RNA at -70°C.\nB. miRNeasy Mini Kit\ni. Transfer 200 µl of bile into 1.5 ml microcentrifuge tube. \nii. Add 700 µl QIAzol Lysis Reagent, vortex 5 sec, incubate for 5 min at room temperature.\niii. Add 140 µl chloroform, shake vigorously for 15 sec, incubate for 3 min at room temperature.\niv. Centrifuge sample at 12,000g for 15 min at 4°C.\nv. Transfer the upper aqueous phase to a new microcentrifuge tube.\nvi. Add 500 µl 100% Ethanol, mix by pipetting.\nvii. Assemble RNAeasy Mini Column in a new collection tube and load entire sample onto column.\nviii. Centrifuge sample at 8,000g for 15 sec at room temperature. Discard flow-through and return column to collection tube.\nix. Add 700 µl Buffer RPE to column and centrifuge at 8,000g for 15 sec at room temperature. Discard flow-through and return column to collection tube.\nx. Add 500 µl Buffer RPE to column and centrifuge at 8,000g for 2 min at room temperature. Discard flow-through and return column to collection tube.\nxi. Centrifuge column at 8,000 x g for 1 min at room temperature to dry membrane.\nxii. Transfer spin column into a new collection tube.",
    "xiii. Add 30 µl RNase free H2O directly onto the membrane of spin column.\nxiv. Close lid and centrifuge for 1 min at 8,000 x g at room temperature.\nxv. Discard spin column and store purified RNA at -70°C.\nC. SeraMir Exosome RNA Purification Kit\ni. Transfer 200 µl of bile into 1.5 ml microcentrifuge tube. \nii. Add 40 µl ExoQuick-TC, mix well, incubate for 30 min at 4°C.\niii. Centrifuge sample at 13,000 rpm for 2 min at 4°C.\niv. Remove supernatant, add 140 µl Lysis Buffer to pellet, vortex 15 sec, incubate for 5 min at room temperature. \nv. Add 80 µl 100% Ethanol, vortex 10 sec.\nvi. Assemble Spin Column in a new collection tube and load entire sample onto column.\nvii. Centrifuge sample at 13,000 rpm for 1 min at room temperature. Discard flow-through and return column to collection tube.\nviii. Add 400 µl Wash Buffer to column and centrifuge at 13,000 rpm for 1 min at room temperature. Discard flow-through and return column to collection tube.\nix. Add 400 µl Wash Buffer to column and centrifuge at 13,000 rpm for 1 min at room temperature. Discard flow-through and return column to collection tube.\nx. Centrifuge column at 13,000 rpm for 2 min at room temperature to dry membrane.\nxi. Transfer spin column into a new collection tube.\nxii. Add 30 µl Elution Buffer directly onto the membrane of spin column.\nxiii. Close lid and centrifuge at 2,000 rpm for 2 min at room temperature.\nxiv. Increase speed and centrifuge at 13,000 rpm for 1 min at room temperature.\nxv. Discard spin column and store purified RNA at -70°C."
  ],
  "subjectAreas": [
    "Biological Techniques",
    "Cell Biology",
    "Genetics",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}