{
  "id": 7335,
  "origin_website": "Bio",
  "title": "Preparation and Characterization of Internally Modified DNA Templates for Chemical Transcription Roadblocking",
  "procedures": [
    "Overview of the procedureMy procedure for preparing internally modified linear dsDNA comprises three primary steps (Figure 1): First, an internal modification is introduced into the DNA template by PCR amplification (Procedure C). PCR amplification yields a truncated DNA product because DNA modifications that halt transcription elongation are also likely to halt elongation by the DNA polymerases that are typically used for PCR. Next, the remainder of the truncated DNA strand is synthesized using the translesion polymerase Sulfolobus DNA Polymerase IV (Procedure D). Finally, the completed dsDNA product is purified to remove excess oligonucleotides and the template DNA that was used for PCR amplification (Procedure E or Procedure F). The purified DNA is then subjected to three quality control steps to verify the efficiency of translesion synthesis (Procedure G), the purity of the dsDNA (Procedure H), and the activity of the internal modification as a transcription roadblock (Procedure I). The resulting internally modified linear dsDNA is then ready to be used to cotranscriptionally display nascent RNA from arrested TECs.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4141/bioprotoc-11-17-4141-g001.jpgFigure 1. Overview of the procedure for enzymatically preparing internally modified dsDNA. PCR with an internally modified primer yields a DNA product with one truncated strand. The truncated strand is then completed using translesion DNA synthesis with Sulfolobus DNA Polymerase IV, which bypasses the internal modification site, and Vent® (exo-). The resulting internally modified dsDNA is then purified and assessed for quality prior to use as a DNA template for in vitro transcription experiments.Priming site and oligonucleotide sequencesSuccessful DNA template preparation depends on the careful design of PCR priming sites. My standard protocol uses two constant DNA regions that have been validated for efficient amplification without detectable side products (Table 1).Table 1. Priming sites and primers used to prepare linear DNA templates.",
    "The region of each oligonucleotide that anneals to its corresponding adapter is underlined. ‘/iMod/’ indicates the position of an internal DNA modification. Validated modifications include desthiobiotin-TEG, biotin-TEG, etheno-dA, and UniLinkTM Amino-Modifier (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210831/20210831191026_5439.png 1The PRA1 promoter (Strobel, 2021) is a derivative of the λPR and T7A1 promoters and can be substituted in place of λPR by using the PRA1.F primer instead of LPR.F.Critical: Order the LPR.F, PRA1.F, dRP1iMod.R, and dRP1.R primers at 100 nmol or greater scale with HPLC purification. Oligonucleotides can be from any source. I use Integrated DNA Technologies. Design PCR primer sequences.I recommend using the sequences described in Table 1, which have been extensively validated for use in the procedures below. If your application requires different sequences, use oligonucleotide design tools such as Integrated DNA Technologies OligoAnalyzerTM[href=https://www.idtdna.com/pages/tools/oligoanalyzer] to verify that your sequences do not contain significant secondary structure and are unlikely to yield primer dimers due to stable homo- or heterodimers. Ideally, primers should be less than 60 nts in length, and the internally modified oligo should have ~30 nts between the modification and the 5’ end to ensure duplex stability downstream of the modification site in the final dsDNA product. The region of each primer that anneals to the PCR adapters should have a GC content of ~50%. Tm will vary with the polymerase used; when using Q5® DNA polymerase I aim to anneal primers at 65°C. The New England Biolabs Tm Calculator[href=https://tmcalculator.neb.com/] is useful for assessing annealing temperatures when using NEB polymerases.  Priming sites can be added to the PCR template DNA in several ways depending on the intended application. First, if the PCR template will be plasmid DNA, priming sites can be included in the DNA sequence during cloning.",
    "Similarly, if the PCR template will be a synthetic oligonucleotide, the priming sites (which together total 52 nts) can be introduced during oligonucleotide synthesis. It is also possible to append priming sites to DNA or RNA of cellular origin by modifying existing protocols for the preparation of genomic or transcriptomic sequence libraries. However, these applications are beyond the scope of this protocol and their implementation will require application-specific expertise.Select an internal modification. I have validated four internal DNA modifications for use with this protocol (Figure 2) and describe their properties below.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4141/bioprotoc-11-17-4141-g002.jpgFigure 2. Validated internal DNA modifications. Validated DNA modifications include (A) desthiobiotin-TEG, (B) etheno-dA, and (C) UniLinkTM Amino-Modifier. Biotin-TEG has also been validated for use in the protocols below (Strobel, 2021).Desthiobiotin-TEG/Biotin-TEG: Desthiobiotin (Figure 2A) is biotin analog that can be eluted from streptavidin by the addition of free biotin. Sulfolobus DNA Polymerase IV primarily bypasses desthiobiotin-TEG without incorporating a nucleotide opposite the modification site. Desthiobiotin-TEG is a potent transcription roadblock: ~100% of TECs stall 1 nt upstream of the modification site, and ~87% of TECs remain at the stall site after 32 min in the presence of 500 μM NTPs (Strobel et al., 2020). When stalled at a desthiobiotin-TEG roadblock, RNAP blocks desthiobiotin from binding streptavidin, thereby enabling the enrichment of TECs based on their position along the DNA template. I have also performed the protocols below using an internal biotin-TEG modification (Strobel, 2021).Etheno-dA: Etheno-dA (Figure 2B) is an adenosine analog in which an etheno bridge between N1 and N6 of adenine prevents hydrogen bonding. Sulfolobus DNA Polymerase IV tends to incorporate a dA nucleotide opposite the modification site when bypassing the etheno-dA modification. Pupov et al. (2019) showed that etheno-dA is a potent transcription blockade using a TEC scaffold system.",
    "My analysis of etheno-dA-modified DNA templates agreed with the findings of Pupov et al. (2019): ~100% of TECs stall 1 nt upstream of the modification site, and ~84% of TECs remain at the stall site after 32 min in the presence of 500 μM NTPs (Strobel et al., 2020). Etheno-dA is useful as a functionally inert chemical transcription roadblock.Uni-LinkTM Amino-Modifier: The Uni-LinkTM Amino-Modifier (Figure 2C) comprises a primary amine attached to a six-carbon spacer and is designed to preserve natural nucleotide spacing in the phosphodiester backbone. Sulfolobus DNA Polymerase IV incorporates a dA nucleotide opposite the modification site ~50% of the time when bypassing the Uni-LinkTM Amino-Modifier. In comparison to desthiobiotin-TEG and etheno-dA, the Uni-LinkTM Amino-Modifier is a weak transcription roadblock: although ~100% of TECs initially stall at the modification site, RNAP can bypass the stall site efficiently so that only ~40% of TECs remain at the stall site after 32 min in the presence of 500 μM NTPs (Strobel et al., 2020). Nonetheless, the free amino group may be useful for functionalizing the DNA template in some experiments.Upon receipt of the oligonucleotides described above, dissolve the lyophilized oligonucleotide and prepare working stocks:Centrifuge the oligonucleotide tubes in a mini centrifuge for several seconds to ensure that the lyophilized oligonucleotide is at the bottom of the tube.Add 1× TE, pH 7.5, to dissolve the oligonucleotide to a concentration of 100 μM.Note: The oligonucleotides used in this protocol are critical and costly reagents. For this reason, I recommend using commercial nuclease-free TE to resuspend primary oligonucleotide stocks so that storage and handling is standardized. Shake thoroughly and spin down the dissolved oligonucleotide in a mini centrifuge.Prepare a 10 μM working primer stock by combining 180 μl of 10 mM Tris-HCl, pH 8.",
    "0 with 20 μl of 100 μM oligonucleotide stock in a 2 ml screw-cap tube with an O-ring. Vortex and spin down the working primer stock in a mini centrifuge.Critical: Store working primer stocks in a screw cap tube with an O-ring to reduce the possibility of cross-contamination. Store both the 100 μM and 10 μM primer stocks at -20°C.Critical: When thawing primer stocks, mix the oligonucleotide solution and then spin the tube in a mini centrifuge so that no liquid remains at the cap. PCR amplificationThe internal DNA modification is incorporated by PCR using the modified primer dRP1iMod.R (Table 1) to yield a dsDNA with a 5’ overhang downstream of the DNA modification site (Figure 1).Note: An unmodified version of the template can be prepared in a separate 500 μl PCR by substituting dRP1iMod.R with the unmodified dRP1.R primer. The unmodified template can be prepared in parallel with the internally modified template using the same procedures except that Procedure D: Translesion DNA Synthesis is omitted. The unmodified DNA template is a useful control for the QC analyses described in Procedures G, H, and I. Note: My laboratory typically uses Q5® or Q5U® DNA polymerase for PCR. Other polymerases can be substituted if desired. See Note 2 for additional information. Prepare 620 μl of Q5® PCR master mix (Table 2) in a 1.7 ml microcentrifuge tube on ice. Add each reagent in the order listed in Table 2 and mix as follows:Note: When the DNA template will be purified using Procedure F, the PCR can be scaled down if desired because sample recovery is efficient. The smallest scale preparation my laboratory typically performs uses 200 μl of the initial Q5 PCR.After adding Q5® Reaction Buffer, vortex and spin down the master mix in a mini centrifuge.",
    "After adding every reagent except Q5® DNAP, vortex and spin down the master mix again.Add Q5® DNA polymerase and gently mix the completed master mix by pipetting.Table 2. Reaction master mix for Q5® PCR.  The Q5® PCR master mix is based on the New England Biolabs protocol for PCR Using Q5 High-Fidelity DNA Polymerase[href=https://www.neb.com/protocols/2013/12/13/pcr-using-q5-high-fidelity-dna-polymerase-m0491].table:",
    "﻿0,1,2,3,4\nReagent,Stock Conc.,Final Conc.,100 μl Rxn.,6.2 Rxn. Vols.\nNuclease-Free Water,-,-,71.0,440.2 μl\nQ5® Reaction Buffer,5×,1×,20.0 μl,124.0 μl\ndNTP Solution1,10 mM,0.200 mM,2.0 μl,12.4 μl\nLPR.F,10 μM,0.250 μM,2.5 μl,15.5 μl\ndRP1iMod.R,10 μM,0.250 μM,2.5 μl,15.5 μl\nTemplate DNA2,-,-,1.0 μl,6.2 μl\nQ5® DNAP,2 U/μl,0.020 U/μl,1.0 μl,6.2 μl\nTotal Volume,,,100.0 μl,620.0 μl\n1Standard dNTP solution containing dATP, dGTP, dTTP, and dCTP at 10 mM each.2The DNA template used for PCR can vary by application. Adjust the volume added accordingly.Aliquot 100 μl reaction volumes into six thin-walled 200 μl PCR tubes.Critical: If the thermal cycler does not accommodate 100 μl reactions, use a smaller aliquot. Start the thermal cycling protocol shown in Table 3. Place the reactions on the thermal cycler block once the thermal cycler lid is fully heated.Table 3. Thermal cycling protocol for PCR amplification.  Thermal cycling protocol for the PCR described in Table 2. Always perform the PCR using a heated lid set to 105°C. Adjust the annealing temperature if primers other than those described above or a DNA polymerase other than Q5® High-Fidelity DNA polymerase are used. Adjust the extension time to account for the length of the DNA template. The final hold is at 10°C to reduce energy consumption and extend thermal cycler life.table:\n﻿0,1,2,3\nStep,Step,Temperature,Time\nInitial Denaturation,Initial Denaturation,98°C,30 s\n30 Cycles,Denature,98°C,10 s\n30 Cycles,Anneal1,65°C,20 s\n30 Cycles,Extend,72°C,30 s/kb\nFinal Extension,Final Extension,72°C,5 min\nFinal Hold,Final Hold,10°C,Forever",
    "1Adjust the annealing temperature as needed. I recommend using the NEB Tm Calculator[href=https://tmcalculator.neb.com/] to determine annealing temperature.After thermal cycling is complete, place the reactions on ice.Quantify PCR yield using a QubitTM dsDNA HS assay (Table 4) to ensure that the PCR yielded sufficient DNA for the downstream processing steps. Multiply the sample concentration by 500 (five reaction volumes, representing the five reactions used for translesion synthesis) to estimate the total PCR yield. Yield can vary depending on DNA template length and composition; for reference, a 121 bp DNA template that was used when validating this protocol typically measured ~10 ng/μl by Qubit for an estimated total of ~5 μg of input DNA for the subsequent steps. This is likely an underestimate of DNA quantity because the initial PCR product contains a 5’ ssDNA overhang that is not detected efficiently in the QubitTM dsDNA HS assay.Table 4. Protocol for QubitTM dsDNA assays.  The protocol for QubitTM dsDNA HS and BR assays is presented here for convenience. The protocol is written in general terms to include both assays. Please refer to the QubitTM 4 Fluorometer[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2FMAN0017209_Qubit_4_Fluorometer_UG.pdf&title=VXNlciBHdWlkZTogUXViaXQgNCBGbHVvcm9tZXRlcg==], QubitTM dsDNA HS Assay Kit[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2FQubit_dsDNA_HS_Assay_UG.pdf&title=VXNlciBHdWlkZTogUXViaXQgZHNETkEgSFMgQXNzYXkgS2l0cw==], and QubitTM dsDNA BR Assay Kit[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2FQubit_dsDNA_BR_Assay_UG.pdf&title=VXNlciBHdWlkZTogUXViaXQgZHNETkEgQlIgQXNzYXkgS2l0cw==] User Guides for more information.table:\n﻿0,1\nStep,Action\n1,Gather one 2.0 ml microcentrifuge tube and a QubitTM assay tube for each sample plus two assay tubes for the QubitTM standards.\n2,\"Dilute the QubitTM dsDNA Reagent 1:200 in QubitTM dsDNA Buffer in the 2.0 ml tube. Prepare enough QubitTM working solution to accommodate both standards and each sample, e.g., for two standards and one sample, prepare four volumes of QubitTM working solution. Vortex thoroughly and spin down in a mini centrifuge.\"\n3,Aliquot 190 μl of QubitTM working solution per tube to each standard assay tube. Aliquot 199 μl of QubitTM working solution to each sample assay tube.",
    "41,Add 10 μl of QubitTM Standards #1 and #2 to the respective assay tubes.\n5,Add 1 μl of sample to the respective assay tubes.\n6,Vortex the assay tubes and incubate at room temperature for 2 min.\n7,Read each standard and the samples using the QubitTM 4 Fluorometer.",
    "1QubitTM standards must be prepared fresh for each assay.PCR purification and translesion DNA synthesisProcedure C yields a truncated dsDNA with a 5′ overhang. Translesion DNA synthesis using Sulfolobus DNA Polymerase IV fills this overhang so that the DNA template is fully double-stranded (Figure 1). The PCR product from Procedure C is first purified using a spin-column kit to exchange the reaction buffer and deplete dNTPs. This clean-up step ensures that reaction conditions are optimal for translesion synthesis using Sulfolobus DNA Polymerase IV regardless of which DNA polymerase is used for PCR amplification.Purify the six 100 μl PCRs using the QIAquick PCR Purification Kit[href=https://www.qiagen.com/us/resources/resourcedetail?id=e0fab087-ea52-4c16-b79f-c224bf760c39&lang=en], which will exchange the reaction buffer and deplete dNTPs (see Note 2):Transfer each 100 μl PCR into a corresponding 1.7 ml microcentrifuge tube.Add 500 μl of Buffer PB to each PCR. Vortex thoroughly and spin down in a mini centrifuge.Apply each sample to a separate QIAquick spin column.Centrifuge the samples at 18,000 × g and 4°C for 1 min. Discard the flow-through.Apply 750 μl of Buffer PE to each column.Centrifuge the samples at 18,000 × g and 4°C for 1 min. Discard the flow-through.Centrifuge the samples at 18,000 × g and 4°C for 3 min to pull down residual liquid.Transfer the columns to clean 1.7 ml microcentrifuge tubes.For five of the six columns, apply 50 μl of Buffer EB. These samples will be pooled for translesion synthesis. For the sixth column, apply 30 μl of Buffer EB. This will be a negative control for denaturing PAGE QC (Procedure G).Critical: Always elute with Buffer EB. Do not elute with water. The DNA must remain buffered. See Note 1b. Buffer EB is 10 mM Tris-HCl, pH 8.5. Centrifuge samples at 18,000 × g and 4°C for 1 min to elute DNA.",
    "Store the sample that was eluted in a 30 μl volume at -20°C for use in Procedure G.Pool the five samples that were eluted in 50 μl volumes into a 1.7 ml microcentrifuge tube.Estimate the volume of the eluted sample by transferring 200 μl to a new 1.7 ml microcentrifuge tube, adjusting the pipette so that it barely aspirates the remaining sample, and transferring the remaining volume. The sample volume will be used in Step D5.Prepare a 500 μl translesion synthesis reaction (Table 5) in a 1.7 ml microcentrifuge tube on ice. Add each reagent in the order listed in Table 5 and mix as follows:After adding ThermoPol® Buffer, vortex and spin down the master mix in a mini centrifuge.After adding the purified PCRs, vortex and spin down the master mix again.Add Vent® (exo-) DNA Polymerase and Sulfolobus DNA Polymerase IV and gently mix the completed master mix by pipetting.Note: Although Sulfolobus DNA polymerase IV alone is sufficient to complete the translesion synthesis reaction, including Vent (exo-) DNA polymerase may improve the fidelity of DNA synthesis beyond the internal lesion (see Note 3). Table 5. Reaction master mix for translesion DNA synthesis.  The translesion DNA synthesis master mix is used for preparatory scale translesion primer extension.table:",
    "﻿0,1,2,3\nReagent,Stock Conc.,Final Conc.,500 μl Rxn.\nNuclease-Free Water,-,-,See footnote 1\nThermoPol® Buffer,10×,1×,50.0 μl\n\"Std./Thermostable dNTP Solution2,3\",10 mM,0.200 mM,10.0 μl\nPurified PCRs,-,-,See Step D4\nVent® (exo-) DNA Polymerase4,2 U/μl,0.020 U/μl,5 μl\nSulfolobus DNA Polymerase IV,2 U/μl,0.020 U/μl,5 μl\nTotal Volume,,,500.0 μl\n1Add nuclease-free water so that the total reaction volume including all reagents is 500 μl.2Translesion synthesis can be performed using either standard dNTPs or thermostability-enhancing dNTPs. Standard dNTPs are suitable for most applications. Thermostability-enhancing dNTPs are useful as a safeguard against DNA end-fraying when downstream protocols require prolonged heating to high (>65°C) temperatures.3See Recipe 3 for the composition of thermostability-enhancing dNTP solution.4See Note 3.Aliquot 100 μl reaction volumes into five thin-walled 200 μl PCR tubes.Start the thermal cycler protocol shown in Table 6. Place the reactions on the thermal cycler once the block temperature is 55°C, then advance the thermal cycler to the next step.Table 6. Thermal cycling protocol for translesion DNA synthesis.  The translesion synthesis reaction proceeds at 55°C for one hour in a thermal cycler with a heated lid set to 105°C. The final hold is at 12°C to reduce energy consumption and extend thermal cycler life.table:\n﻿0,1,2\nStep,Temperature,Time\n55°C Hold,55°C,Forever\nExtension,55°C,1 h\nFinal Hold,12°C,Forever",
    "After translesion synthesis, the completed dsDNA must be purified using either Procedure E (agarose gel purification) or Procedure F (exonuclease I clean-up). If the purification cannot be performed immediately, the reactions can be stored at -20°C.Purification option 1: Agarose gel purification of the completed dsDNA templatesWhen plasmid DNA is used as the template for PCR Amplification (Procedure C), gel purification is required to remove plasmid DNA and any excess primers. If an ssDNA oligonucleotide was used as the template for PCR amplification, Procedure F (Purification option 2: Thermolabile exonuclease I clean-up) can be used to purify the dsDNA transcription template instead of agarose gel extraction.Pool the five 100 μl translesion synthesis reaction aliquots into a 1.7 ml microcentrifuge tube.Add 50 μl of 3M sodium acetate, pH 5.5, and 1 ml of cold 100% ethanol to the pooled sample. Mix the sample thoroughly by vortexing and inverting the tube.Precipitate the DNA by chilling the sample at -20°C overnight or at -80°C for 30 min.When the sample has chilled sufficiently, pour a 1× TBE, 1% agarose gel containing 0.5 μg/ml ethidium bromide. Use a gel comb that holds at least 50 μl per well.Critical: Use preparatory grade agarose (such as SeaKem GTG Agarose) for gel purification. Critical: The gel must contain ethidium bromide so that the DNA is stained while the gel runs. Note: Ethidium bromide should be handled and disposed of according to institutional guidelines. Centrifuge the sample at 18,000 × g and 4°C for 30 min to pellet the precipitated DNA.Aspirate and discard the supernatant by pipetting. Be careful to avoid the pellet.Tip: To aspirate large supernatant volumes with precision, a 10 μl pipette tip can be loaded onto the end of a 1,000 μl pipette tip. This enables aspiration of ~1 ml with precise control.",
    "Add 1 ml of cold 70% ethanol to the sample and gently invert the tube several times. Do not dislodge the pellet.Centrifuge the sample at 18,000 × g and 4°C for 2 min.Aspirate and discard the supernatant by pipetting.Centrifuge the sample for several seconds to spin down residual supernatant.Aspirate and discard the residual supernatant by pipetting.Cover the open tube with a tissue wiper and set it on a bench to dry for several minutes.Assemble and fill a horizontal gel tank with enough 1× TBE to cover the agarose gel.Resuspend the pellet in 30 μl of 10 mM Tris-HCl, pH 8.0.Critical: Always resuspend the pellet in 10 mM Tris-HCl, pH 8.0. Do not resuspend the pellet in water. The sample must remain buffered. See Note 1b. Add 6 μl of 6× DNA Loading Dye (+SDS, XC only) to the sample and mix by pipetting.Load the sample into the agarose gel and run the gel at 100 V for 1-2 h.Note: Because the sample contains several micrograms of DNA, a red band should become visible as the ethidium bromide co-migrates with the DNA (Figure 3A). This enables gel extraction to be performed without exposing the DNA to any UV light. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4141/bioprotoc-11-17-4141-g003.jpgFigure 3. DNA band excision without UV light. A. The PCR product can be visualized as a red band under visible light because ethidium bromide co-migrates with the large quantity of DNA in the gel. B. Visualization of the gel from (A) on a UV transilluminator after the PCR product was excised to assess the quality of the PCR and the band excision. No side products were detected.Without exposing the gel to UV light, excise the PCR product with a clean razor blade (Figure 3).Trim the gel slice to remove as much excess agarose as possible.",
    "Critical: Removing excess agarose improves DNA yield and quality. Tare a balance with a 2.0 ml tube. Add the gel slice to the 2.0 ml tube, weigh the gel slice, and record the mass. The mass of the gel slice will be used below in Steps E21a and E21b.Visualize the gel on a UV transilluminator to confirm that the band was excised precisely and assess whether any side products are present (Figure 3B).Recover the DNA from the excised gel slice using the QIAquick Gel Extraction Kit. Use the following protocol, which includes every optional step recommended by the manufacturer and reduces gel melting temperature to minimize the possibility of DNA end fraying:Note: For more information, refer to theQiagen QIAquick®Gel Extraction Kit Quick-Start Protocol[href=https://www.qiagen.com/us/resources/resourcedetail?id=a72e2c07-7816-436f-b920-98a0ede5159a&lang=en].If the gel slice weighs more than 400 mg, divide it into several 2.0 ml tubes so that each tube contains <400 mg of gel.Add 3 volumes of Buffer QG to 1 volume gel  (1 mg gel ~1 μl).Incubate the sample at 30°C and occasionally vortex until the gel slice has dissolved.Critical: The gel slice is melted at 30°C to minimize DNA template end fraying. Add 1 gel volume of isopropanol to the sample. Mix by inverting the tube and spin down in a mini centrifuge.Apply 700 μl of the sample to a QIAquick spin column and centrifuge at 18,000 × g and 4°C for 1 min. Discard the flow-through and repeat until the entire sample has been applied.Add 500 μl of Buffer QG to the column and centrifuge at 18,000 × g and 4°C for 1 min. Discard the flow-through.Add 750 μl of Buffer PE to the column and centrifuge at 18,000 × g and 4°C for 1 min. Discard the flow-through.",
    "Centrifuge the samples at 18,000 × g and 4°C for 3 min to spin down residual liquid.Place the column into a clean 1.7 ml microcentrifuge tube.Apply 30 μl of 10 mM Tris-HCl, pH 8.0 to the center of the QIAquick column.Critical: Always elute with 10 mM Tris-HCl, pH 8.0. Do not elute with water. See Note 1b. Centrifuge the column at 18,000 × g and 4°C for 1 min.Transfer the eluted sample to a clean 1.7 ml microcentrifuge tube.Quantify the DNA template concentration using the QubitTM dsDNA BR Assay Kit (Table 4).Convert the DNA concentration from ng/μl to μM. A typical prep yields 30 μl of DNA at a concentration between 0.75 μM and 1.25 μM.Tip: Promega has a web-based tool[href=https://www.promega.com/resources/tools/biomath/] for converting μg of DNA to pmol of DNA. Enter the DNA length in base pairs and the number of μg of DNA in 1 μl of sample to calculate the concentration of your sample in pmol/μl; pmol/μl equals μM. Prepare 200 μl of 50 nM working stock for each template by diluting the primary stock into 10 mM Tris-HCl, pH 8.0. Both the primary stock and the working stock should be stored at -20°C.Critical: Always prepare working stocks using 10 mM Tris-HCl, pH 8.0. Do not use water. The DNA must remain buffered to prevent fraying of the duplex downstream of the modification site. See Note 1b. Purification option 2: Thermolabile exonuclease I clean-upWhen an ssDNA oligonucleotide is used as the template for PCR Amplification (Procedure C), the final dsDNA product can be purified by using thermolabile exonuclease I (exoI) to degrade excess primers and a PCR purification kit to exchange the reaction buffer.",
    "This alternate purification protocol yields approximately two times more DNA template than agarose gel purification and, consequently, does not require as much input DNA (Note 1c). However, the success of the thermolabile exoI clean-up procedure is contingent upon the specificity of the PCR because it does not select for DNA size.Purify the five 100 μl translesion synthesis reactions using the QIAquick PCR Purification Kit[href=https://www.qiagen.com/us/resources/resourcedetail?id=e0fab087-ea52-4c16-b79f-c224bf760c39&lang=en], which depletes dNTPs and enzymes:Critical: Sulfolobus DNA polymerase IV is active at 37°C. If substantial amounts of primer remain when the thermolabile exoI reaction is incubated at 37°C, exoI-resistant primer dimers that do not occur at higher temperatures can form. PCR purification before thermolabile exoI treatment removes dNTPs and Sulfolobus DNA polymerase IV, which prevents the formation of primer dimers. Transfer each 100 μl PCR into a corresponding 1.7 ml microcentrifuge tube.Add 500 μl of Buffer PB to each PCR. Vortex thoroughly and spin down in a mini centrifuge.Apply the samples to QIAquick spin columns by adding 600 μl of sample to the column, centrifuging at 18,000 × g and 4°C for 1 min, and discarding the flow-through. Multiple samples can be loaded onto one column by repeating this procedure as long as the column capacity (10 μg DNA) is not exceeded.Apply 750 μl of Buffer PE to each column.Centrifuge the samples at 18,000 × g and 4°C for 1 min. Discard the flow-through.Centrifuge the samples at 18,000 × g and 4°C for 3 min to pull down residual liquid.Transfer the columns to clean 1.7 ml microcentrifuge tubes.Apply 50 μl of Buffer EB to each column.Critical: Always elute with Buffer EB. Do not elute with water. The DNA must remain buffered. See Note 1b. Buffer EB is 10 mM Tris-HCl, pH 8.5.",
    "Centrifuge the samples at 18,000 × g and 4°C for 1 min to elute the DNA.Pool the eluted samples into one 1.7 ml microcentrifuge tube.Estimate sample volume by adjusting a pipette so that it barely aspirates the sample and transferring it to a new 1.7 ml microcentrifuge tube. This sample volume is used in Step F4.Prepare a 500 μl thermolabile exoI reaction (Table 7) in a 1.7 ml microcentrifuge tube on ice.Table 7. Reaction master mix for thermolabile exonuclease I digestion table:",
    "﻿0,1,2,3\nReagent,Stock Conc.,Final Conc.,500 μl Rxn.\nNuclease-Free Water,-,-,See footnote 1\nThermoPol® Buffer2,10×,1×,50.0 μl\nPurified PCRs,-,-,Determined in Step F3\nThermolabile Exonuclease I,20 U/μl,0.1 U/μl,2.5 μl\nTotal Volume,,,500.0 μl\n1Add nuclease-free water so that the total reaction volume including all reagents is 500 μl.2ThermoPol® Buffer is used here because thermolabile exoI is heat inactivated 80°C.Aliquot 100 μl reaction volumes into five thin-walled 200 μl PCR tubes.Set a thermal cycler to 37°C with a heated lid set to 45°C. Place the reactions in the thermal cycler once the block temperature reaches 37°C and incubate for 4 min.Move the reactions to ice.Start the thermal cycler protocol shown in Table 8. Place the reactions on the thermal cycler once the block temperature reaches 80°C, then advance the thermal cycler to the next step.Table 8. Thermal cycling protocol for thermolabile exonuclease I heat inactivation.  Heat inactivation proceeds at 80°C for 1 min in a thermal cycler with a heated lid set to 105°C.table:\n﻿0,1,2\nStep,Temperature,Times\n80°C Hold,80°C,Forever\nInactivation,80°C,1 min\nFinal Hold,12°C,Forever",
    "Repeat the PCR purification described in Step F1 with the following modifications to purify the dsDNA template:Perform the 750 μl Buffer PE wash described in steps F1d/e twice.In step F1i, elute the samples in 30 μl of 10 mM Tris-HCl pH 8.0 instead of Buffer EB.Quantify DNA template concentration and prepare a working stock as described in Steps E22-E24.Internally modified DNA template quality control by denaturing PAGEThe quality of an internally modified DNA template preparation should be assessed by using denaturing urea polyacrylamide gel electrophoresis (Urea PAGE) to confirm that the translesion synthesis reaction proceeded to completion. Successful DNA template QC requires complete denaturation of the DNA template so that the size of each strand can be assessed. It is therefore critical that the gel is run at a high temperature (~50°C). The protocol below is designed to achieve this using a Bio-Rad Mini-PROTEAN Vertical Electrophoresis Cell.Note: Experienced readers will be able to perform denaturing PAGE QC and native PAGE QC (Procedure H) in parallel. Thoroughly clean a 1.0 mm spacer plate, a short plate, and a 1.0 mm 10-well comb with deionized water. Rinse the plates with 70% ethanol and allow them to air-dry.Assemble the glass plates in the Mini-PROTEAN casting frame. When securing the plates in the casting frame, be sure that the bottom edges of the plates are flush.Secure the assembled casting frame on a gasket in the Mini-PROTEAN casting stand.Combine 1 ml UreaGel Buffer, 5 ml UreaGel Diluent, and 4 ml UreaGel Concentrate in a 15 ml conical tube. Invert the tube to mix. This mixture will prepare a 10% acrylamide gel.Caution: Acrylamide is a neurotoxin and should be handled cautiously. Note: Adjust the gel percentage as needed depending on DNA template length.",
    "My laboratory has used 10% gels to assess DNA templates from 121 to 273 nt in length. Add 80 μl of 10% APS to the UreaGel mixture and invert the tube to mix.Add 4 μl of TEMED to the UreaGel mixture and invert the tube to mix and start polymerization.Pipette the UreaGel mixture carefully but quickly to fill the space between the glass plates.Insert the 1.0 mm 10-well comb and allow the gel to polymerize for at least 30 min.Once the gel has polymerized, assemble the Mini-PROTEAN Electrode Assembly. Secure the gel plates on one side of the electrode assembly and a buffer dam on the other.Place the electrode assembly in the Mini-PROTEAN gel tank.Fill the chamber between the gel plates and buffer dam with 1× TBE. Add 1× TBE to the outer gel chamber so that it covers the lower gel gasket.Critical: It is important to cover only the bottom of the gel gasket. Using more buffer will disperse heat while the gel is running and result in poor DNA denaturation. Rinse the wells with 1× TBE by pipetting until the buffer in each well appears homogenous.Pre-run the gel at 480 V for ~30 min to warm the gel.Set a heat block to 95°C once the gel is pre-running.For each sample that will be assessed, combine 15 μl of 1× Formamide Loading Dye with 1 μl of 50 nM DNA template in a 1.7 ml microcentrifuge tube. The negative control and positive control (if performed) should also be prepared this way.Critical: A 16 μl sample volume is used to further dilute the sample so that re-annealing of DNA duplexes after denaturation is reduced. Combine 19 μl of 1× Formamide Loading Dye with 1 μl of Low Range ssRNA Ladder.",
    "Aliquot 5 μl into a separate tube and store the remaining 15 μl at -20°C for future use.Note: An ssRNA ladder is used due to the lack of commercially available ssDNA ladders in the required size range. The ladder is therefore intended to be a rough approximation of DNA size. After the gel has pre-run for ~25 min, place all samples on the 95°C heat block for 5 min. Place an aluminum block on top of the samples to prevent the tubes from opening.Remove the samples from the heat block and immediately place them on ice to snap cool. Leave the samples on ice for 2 min.Critical: Snap cooling minimizes re-annealing of DNA duplexes. Turn off the power supply and quickly rinse the wells with 1× TBE by pipetting.Load the samples onto the gel using gel-loading pipette tips. Take care to fill as little of the well as possible so that the resulting bands are sharp despite the large sample volume.Critical: Load the samples quickly so that the gel remains warm. Run the gel at 480 V until the bromophenol blue dye band reaches the lower gel gasket.Note: Monitor the gel closely. At 480 V, electrophoresis will be complete in ~10 min. Turn off the power supply, disassemble the gel tank, and set the gel plates on a bench to cool.Add 3 μl of SYBR Gold Nucleic Acid Stain to 30 ml of 1× TBE in a 150 mm culture dish. Gently swirl the dish to disperse the stain.Pry apart the gel plates using the Mini-PROTEAN gel releaser.Carefully lift the gel off the plate while touching only the edges. Submerge the gel in the SYBR Gold stain. Cover the dish in aluminum foil and rock gently for 10 min.Visualize and document the gel.",
    "Gel visualization can be performed in several ways: I prefer to use a Typhoon Biomolecular Imager or equivalent laser scanner due to its high sensitivity. The Typhoon should be run in fluorescence mode using the settings recommended for SYBR Gold (488 nm laser with the 520 BP 40 emission filter on a Typhoon 9400). Set the PMT voltage to 475 V for the first scan and adjust it as needed. If you do not have access to a laser scanner that is capable of imaging SYBR Gold Nucleic Acid Stain, the gel can also be viewed and documented on a Dark Reader Blue Light Transilluminator.Evaluate the quality of the DNA template preparation for the following expected outcomes:The negative control should have two DNA template bands (Figure 4). The upper (modified) strand should correspond to full DNA template length. The lower (unmodified) band should correspond to the length of the DNA template minus the number of nucleotides downstream of the internal modification site. Some excess primers may be present.The DNA template preparation should contain a single band that corresponds to the full length of the DNA template (Figure 4). No primers should be present.Critical: Only a single band of the expected length should be present. The translesion synthesis reaction can and should go to completion (see Note 1a). The positive control (if performed) should contain a single band that corresponds to the full length of the DNA template (Figure 4). Some excess oligonucleotide may be present if the positive control sample was not gel extracted.Note: The positive control is a useful indicator for the effectiveness of DNA duplex denaturation. If a gel-extracted positive control contains multiple bands, this suggests that DNA denaturation is incomplete and should be optimized. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4141/bioprotoc-11-17-4141-g004.jpgFigure 4. Example of a denaturing PAGE QC gel.",
    "Analysis of denaturing gel QC. Denaturation of the dsDNA duplex enables the length of each DNA strand to be assessed. The negative control, which contains a desthiobiotin modification and did not undergo translesion synthesis, contains a truncated DNA strand. In contrast, the internally desthiobiotinylated sample that was treated by translesion synthesis contains only full length DNA and is indistinguishable from the unmodified positive control. The gel image is adapted from Strobel et al. (2020) Figure 1E and was acquired using a Typhoon 9400 Biomolecular Imager.Internally modified DNA template quality control by native PAGE.After confirming that translesion synthesis went to completion using denaturing PAGE (Procedure G), the internally modified DNA template preparation should be assessed by native PAGE to confirm the purity of intact dsDNA duplexes.Thoroughly clean a 1.0 mm spacer plate, a short plate, and a 1.0 mm 10-well comb with deionized water. Rinse the plates with 70% ethanol and allow them to air-dry.Assemble the glass plates in the Mini-PROTEAN casting frame. When securing the plates in the casting frame, be sure that the bottom edges of the plates are flush.Secure the assembled casting frame on a gasket in the Mini-PROTEAN casting stand.Combine 3.6 ml Milli-Q water, 3 ml 3× TBE, and 2.4 ml ProtoGel (30%), in a 15 ml conical tube. Invert the tube to mix. This mixture will prepare an 8% acrylamide gel.Caution: Acrylamide is a neurotoxin and should be handled cautiously. Note: Adjust the gel percentage as needed depending on DNA template length. An 8% gel will be suitable for DNA up to ~500 bp in length. Use a 6% gel for DNA that is longer than ~500 bp. Add 100 μl of 10% APS to the acrylamide mixture and invert the tube to mix.",
    "Add 10 μl of TEMED to the acrylamide mixture and invert the tube to mix.Pipette the acrylamide mixture carefully but quickly to fill the space between the glass plates.Insert the 1.0 mm 10-well comb and allow the gel to polymerize for at least 30 min.Once the gel has polymerized, assemble the Mini-POTEAN Electrode Assembly. Secure the gel plates on one side of the electrode assembly and a buffer dam on the other.Place the electrode assembly in the Mini-PROTEAN gel tank.Fill the chamber between the gel plates and buffer dam with 1× TBE. Add 1× TBE to the outer gel chamber up to the 2-gel fill line.Rinse the wells with 1× TBE by pipetting.For each sample that will be assessed, combine 4 μl of 10 mM Tris-HCl pH 8.0, 1 μl 6× DNA Loading Dye (non-denaturing), and 1 μl of 50 nM DNA template in 1.7 ml microcentrifuge tube. The positive control (if performed) should also be prepared this way. Mix by vortexing and spin down in a mini centrifuge.Critical: The samples must be prepared using 10 mM Tris-HCl, pH 8.0. See Note 1b. Load the samples onto the gel using gel-loading pipette tips.Load 3 μl of Quick-Load® Purple 100 bp DNA ladder (or a comparable 100 bp DNA ladder).Run the gel at 100 V until the bromophenol blue loading dye reaches the lower gel gasket.Turn off the power supply and disassemble the gel apparatus.Add 3 μl of SYBR Gold Nucleic Acid stain to 30 ml of 1× TBE in a 150 mm culture dish. Gently swirl the dish to disperse the stain.Pry apart the gel plates using the Mini-PROTEAN gel releaser.Carefully lift the gel off the plate while touching only the edges. Submerge the gel in the SYBR Gold stain.",
    "Cover the dish in aluminum foil and rock gently for 10 min.Visualize and document the gel using a Typhoon Biomolecular Imager (preferred method) or a Dark Reader Blue Light Transilluminator.Evaluate the quality of the DNA template preparation. The DNA template preparation should contain a single band that corresponds to the expected full length dsDNA product. No side products or excess primer should be detectable (Figure 5). If a slow-migrating band is observed by native PAGE after a template preparation passes denaturing PAGE QC, this suggests that the DNA was mishandled during preparation (e.g., diluted into an unbuffered solution; see Note 1b).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4141/bioprotoc-11-17-4141-g005.jpgFigure 5. Example of a native PAGE QC gel. The dsDNA template preparation contains no detectable side products or oligonucleotides and is the expected length (121 bp). Note that the internally modified DNA template migrates slightly slower than an unmodified control. The gel image is adapted from Strobel et al. (2020) Supplementary Figure S2B and was acquired using a Typhoon 9400 Biomolecular Imager.Assess the efficiency of transcription roadblocking using single-round in vitro transcription (optional)The transcription roadblocking activity of an internally modified DNA template can be evaluated using a single-round in vitro transcription time course. This quality control step is optional when using a previously validated DNA modification. However, it may be useful to perform this analysis to be confident that the internally modified DNA template has the expected transcription roadblocking activity, particularly if you are new to the protocols described above.Note: (1) When assessing a new DNA template sequence, prepare an additional transcription reaction using an unmodified version of the DNA template to distinguish halted TECs from run-off transcripts. (2) The experiment described below uses [α-32P]-UTP as a radioactive tracer. Perform this experiment using appropriate radiation shielding and in compliance with institutional protocols.",
    "(3) The procedure includes phenol:chloroform extraction and subsequent ethanol precipitation remove protein and concentrate the sample prior to sequencing gel electrophoresis. These steps are not strictly required but ensure that RNA mobility is not influenced by residual protein. Set a heat block to 37°C at least 30 min before starting the experiment.Prepare in vitro transcription Master Mix (Table 9) in a 1.7 ml microcentrifuge tube on ice. Add each reagent in the order listed in Table 9 and mix as follows:After adding 10× Transcription Buffer, vortex and spin down the master mix.After adding every reagent except E. coli RNAP, vortex and spin down the master mix again.Add E. coli RNAP holoenzyme and gently mix the completed Master Mix by pipetting.Table 9. Reaction master mix for single-round in vitro transcription. Individual in vitro transcription reactions have a total volume of 25 μl. MgCl2 is omitted from the master mix so that transcription is only initiated upon addition of 10× Start Solution.table:",
    "﻿0,1,2,3,4\nReagent,Stock Conc.,Final Conc.,25 μl Rxn.,10 Rxn. Vols.\nNuclease-Free Water,-,-,14.85 μl,148.5 μl\nTranscription Buffer,10×,1×,2.50 μl,25.0 μl\nNTP Solution1,20×,1×,1.25 μl,12.5 μl\nBSA2,5 mg/ml,0.1 mg/ml,0.50 μl,5.0 μl\nDNA template,50 nM,5 nM,2.50 μl,25.0 μl\nE. coli RNAP holo,1 U/μl,0.016 U/μl,0.40 μl,4.0 μl\n[α-32P]-UTP3,-,-,0.50 μl,5.0 μl\nTotal Volume (omits 10× Start Solution),,,22.50 μl,225.0μl",
    "1NTP concentration is 200 μM ATP, 200 μM GTP, 200 μM CTP, and 50 μM UTP to promote [α-32P]-UTP incorporation. Adjust the NTP mix accordingly if a different radioactive tracer is used.2Critical: BSA must be molecular biology grade. 3Critical: Use [α-32P]-NTPs within two weeks of receipt, assuming the stock is from a fresh lot. Prepare 10× Start Solution.Critical: 10× Start Solution must be prepared fresh for each experiment. Pipette 200 μl of 100 mM MgCl2 into a 1.7 ml microcentrifuge tube.Pipette 10 μl of 2 mg/ml rifampicin into the 100 mM MgCl2.Note: Rifampicin inhibits bacterial RNAPs by blocking extension of transcripts beyond 2-3 nt. Starting transcription by adding MgCl2 and rifampicin simultaneously permits pre-formed open complexes to initiate but blocks further initiation so that transcription is single-round. Vortex thoroughly and spin down the 10× Start Solution in a mini centrifuge.Cover the 10× Start Solution in foil to protect from light and keep at RT.Prepare a 1.7 ml microcentrifuge tube containing 125 μl of Stop Solution for each time point and label the tubes accordingly. Keep these tubes on ice throughout the experiment.Perform the single-round in vitro transcription time course. An example time course with eight time points is shown in Table 10.Note: In vitro transcription time courses require fast sample manipulation. Inexperienced users should practice these manipulations with mock samples before performing the experiment. Table 10. Single-round in vitro transcription time course.  Open promoter complexes are formed by incubating the transcription Master Mix at 37°C for 10 min. Single-round transcription is initiated by adding 10× Start Solution, and at each time point, a 25 μl aliquot of Master Mix is transferred to a tube containing 125 μl of Stop Solution, vortexed briefly, and kept on ice.table:\n﻿0,1,2\nTime (MM:SS),Action,Purpose\n00:00,Place Master Mix (MM) at 37°C,Form open promoter complexes",
    "10:00,Add 25 μl of 10× Start Solution (2.5 μl/rxn),Initiate transcription\n10:15,Transfer 25 μl of MM to 125 μl of Stop Solution,Take a 15 s time point\n10:30,Transfer 25 μl of MM to 125 μl of Stop Solution,Take a 30 s time point\n11:00,Transfer 25 μl of MM to 125 μl of Stop Solution,Take a 1 min time point\n12:00,Transfer 25 μl of MM to 125 μl of Stop Solution,Take a 2 min time point\n14:00,Transfer 25 μl of MM to 125 μl of Stop Solution,Take a 4 min time point\n18:00,Transfer 25 μl of MM to 125 μl of Stop Solution,Take an 8 min time point\n26:00,Transfer 25 μl of MM to 125 μl of Stop Solution,Take a 16 min time point\n42:00,Transfer 25 μl of MM to 125 μl of Stop Solution,Take a 32 min time point",
    "Add 150 μl phenol:chloroform:isoamyl alcohol, pH 8.0 to each sample.Vortex the samples thoroughly.Centrifuge the samples at 18,000 × g and 4°C for 5 min.For each sample, prepare a 1.7 ml microcentrifuge tube containing 450 μl 100% ethanol, 15 μl 3 M sodium acetate, pH 5.5, and 1 μl GlycoBlue Coprecipitant.Carefully transfer the aqueous phase (upper layer) of each sample to the corresponding 1.7 ml microcentrifuge tube prepared in Step H9. Invert the tube several times to mix.Store the samples at -20°C overnight to precipitate the RNA.The next morning, prepare a 0.4 mm, 12% acrylamide, 7.5 M urea sequencing gel as follows:Caution: Acrylamide is a neurotoxin and should be handled cautiously. Notes: It is essential to wear a lab coat and safety glasses while pouring sequencing gels to protect against acrylamide splashes – occasionally, inserting the gel comb between the glass plates can cause the acrylamide to splash. Gel percentage and running conditions are dictated by the length of the RNA. According to the National Diagnostics UreaGel System Protocol, 12% acrylamide monomer is appropriate for 10 to 50 nt RNAs, 8% for 40 to 100 nt, and 6% for 60 to 150 nts. Clean the long and short sequencing gel plates thoroughly with a mild detergent and a plastic brush and rinse with deionized water. Rinse the gel plates with 70% ethanol and wipe dry with a light-duty tissue wiper.Note: Periodically treat the short plate with Rain-X to assist with releasing the gel plates. Clean a 0.4 mm comb and 0.4 mm spacers with soap and deionized water and dry using a light-duty tissue wiper.Assemble the sequencing gel for pouring. See Video 1 for a demonstration of the recommended assembly.In a 250 ml plastic beaker, combine 7 ml UreaGel Buffer, 29.4 ml UreaGel Diluent, 33.",
    "6 ml UreaGel Concentrate, and 400 μl 10% APS. Swirl the beaker carefully to mix.Note: This prepares a 12% acrylamide gel. Adjust as needed. Add 25 μl TEMED to the UreaGel mixture and swirl to begin polymerization. Draw the mixture into a 60 ml syringe and carefully expel the mixture once to ensure that it is fully mixed. Draw the UreaGel mixture into the syringe again.Note: This protocol uses less 10% APS and TEMED than recommended in the National Diagnostics UreaGel System protocol to slow polymerization for easier gel pouring. Pour the sequencing gel. See Video 1 for a demonstration of the recommended procedure.Allow the gel to polymerize for 60 to 90 min. <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Recommended procedure for pouring a sequencing gel. A straightforward and reliable procedure for pouring a 0.4 mm large format sequencing gel is demonstrated.While the gel is polymerizing, centrifuge the samples at 20,000 × g and 4°C for 30 min.Aspirate the supernatant from each sample while taking care not to disturb the small blue pellet.Centrifuge the samples for several seconds to spin down residual liquid.Aspirate residual liquid with a 10 μl pipette tip.Add 6.5 μl of 1× Formamide Loading Dye to each sample.Briefly vortex the samples and spin down the liquid.Once the gel has polymerized, assemble the sequencing gel apparatus. Rinse the wells by drawing 1× TBE from the upper buffer chamber into a 60 ml syringe with a bent 20G 1½” needle and expelling the TBE into the wells. See Video 2 for a demonstration of how to assemble a BRL Model S2 sequencing gel apparatus.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Assembly of the BRL Model S2 sequencing gel system. The procedure for assembling a gel onto the Model S2 sequencing gel system is demonstrated.",
    "Close the safety lids, attach the leads, and pre-run the gel at 1,500 V for ~20 min.Place the samples into the 95°C heat block for 5 min. Place a second aluminum block on top of the samples to prevent the tubes from opening.Snap cool the samples by immediately placing on ice.Using a Sharpie, label the sequencing gel plates to indicate what sample each well will contain. Mark any wells that will be left blank between samples.Once the sequencing gel has pre-run for ~20 min, turn off the power supply and rinse the wells a second time by drawing 1× TBE from the upper buffer chamber into a 60 ml syringe with a bent 20G 1½” needle and expelling the TBE into the wells.Carefully load each sample into its corresponding well using a 0.4 mm gel loading tip.Tip: Set the pipette volume several microliters higher than the sample volume. This generates an air buffer between the sample and the tip. When loading a sample, dispense the air buffer first and move the tip toward the base of the well as the sample is ejected. The air bubble will either float free of the well or can be gently aspirated. Caution: It is not feasible to load a sequencing gel behind acrylic shielding. Wear a lab coat and safety glasses, and minimize radiation exposure by keeping every sample except the one you are loading shielded. Radiation exposure can be monitored using a dosimetry badge. Load 6.5 μl of 1× Formamide Loading Dye into any blank wells that are next to sample wells. This helps the sample lanes to run straight.Close the upper buffer chamber lid and reattach the leads.Run the gel at 1,400 V for 2.5-3 h.Blank a storage phosphor screen using the Storage Phosphor Screen Image Eraser.",
    "Turn off the power supply and disassemble the Model S2 apparatus. See Video 3 for a demonstration of how to disassemble the BRL Model S2 sequencing gel apparatus.Caution: The transcription reactions contain free [α-32P]-UTP, which will typically migrate into the lower buffer chamber. The buffer in the lower chamber will therefore be radioactive. <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 3. Disassembly of the BRL Model S2 sequencing gel system. The procedure for removing a gel from the Model S2 sequencing gel system is demonstrated.Prepare the gel for exposure to a storage phosphor screen by opening the plates and covering the exposed gel in plastic wrap. See Video 4 for a demonstration of this procedure.Critical: It is absolutely critical that the outer surface of the plastic wrap, which will contact the storage phosphor screen, remains perfectly clean. This is easily achievable by changing your gloves frequently while applying the plastic wrap. Note: It is not typically necessary to dry the gel if the exposure time is short (i.e., <16 h). <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 4. Preparation of a sequencing gel for storage phosphor screen exposure. The procedure for opening and covering the sequencing gel with plastic wrap is demonstrated.Place the wrapped gel into a cardboard exposure cassette.Put on a clean pair of gloves. Open the storage phosphor cassette and, handling only the edges, set the screen onto the wrapped gel. Close the cardboard exposure cassette and place the storage phosphor cassette on top to prevent the screen from moving during exposure.Critical: The quality of the gel image depends on the condition of the storage phosphor screen. Handle the storage phosphor screen with care. Expose the storage phosphor screen. Exposure time depends on sample activity. I find that 4-6 h is usually sufficient for a clear image.",
    "It is essential to not overexpose the screen, particularly if you wish to quantify your results. I typically perform a scan after a short exposure (e.g., 4-6 h), blank the storage phosphor screen, and perform a second overnight exposure.Scan the phosphor screen on a Typhoon Biomolecular Imager using phosphorimaging mode.Evaluate the transcription roadblocking activity of the DNA template (Figure 6). Because 100% of TECs are expected to stall at the internal modification site, this analysis can typically be qualitative. For example, in the experiment below run-off transcripts only begin to become visible at the 4 min time point, indicating that the internal DNA modification efficiently halts RNAP.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4141/bioprotoc-11-17-4141-g006.jpgFigure 6. Example of a single-round in vitro transcription time course. Single-round in vitro transcription time course performed as described in this protocol except with 24 time points for kinetic analysis; the 8 time points suggested in this protocol are more than sufficient to assess transcription roadblocking activity. An unmodified positive control was not performed in this experiment because the precise location of stalled and run-off transcripts had already been determined. Data is adapted from Strobel et al. (2020) Figure 4."
  ],
  "subjectAreas": [
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}