{
  "id": 2655,
  "origin_website": "Cell",
  "title": "Protocol to quantify and characterize contact between T cells and antigen-presenting cells in the antigen-draining lymph nodes of mice using flow cytometry",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThe overall workflow for this protocol is shown in Figure 4[href=https://www.wicell.org#fig4].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2149-Fig4.jpg\nFigure 4. Operational workflow of this protocol\nSample collection and enzymatic digestion\nTiming: 1 h (for step 5)\nThis part details how to prepare cell suspensions from resected murine LNs.\nBefore euthanizing the mice, prepare LN digestion plates by placing a ∼1 × 1 cm2 piece of 100 μm nylon mesh at the bottom of each well of 24-well plates.\nAdd 200 μL of dissection medium (RPMI1640 with 10% FBS) per well.\nPrepare as many wells as needed so that each well receives one LN of the mice. Place the plate on ice while collecting the LNs.\nEuthanize the mice 3 or 24 h after the OT-II cell transfer and collect the popliteal draining LNs (Figure 5[href=https://www.wicell.org#fig5]) on top of the nylon mesh in the well of a digestion plate.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2149-Fig5.jpg\nFigure 5. Location of popliteal lymph nodes of mice\n(A and B) There is one popliteal lymph node localized within the fat tissue surrounding the nerves and major vessels of the popliteal fossa in each hind leg. Before (A) and after (B) removing the fat around the lymph node.\nNote: Analysis on different time points allows examining whether the DC subsets binding to T cells changes over time during the process of priming.\nMechanically disrupt the LN.\nCut the LN into tiny pieces with fine scissors.\nGently mush it by grinding the LN pieces against the nylon mesh with a plunger of 1 mL syringe.\nWash the scissors and the plunger with 800 μL of RPMI1640 with 10% FBS in the well, so that the total media volume in the well is 1 mL.",
    "Digest LNs. Add 10 μL per well 0.25 g/mL Collagenase D (final concentration 2.5 mg/mL in RPMI1640) and incubate the plate in a 5% CO2 incubator at 37°C for 30 min.\nCollect the digested LN cell suspension by gently pipetting up and down the media in the well with a 1 mL micropipette so that any remnants of the LN tissue will detach from the nylon mesh.\nPlace a ∼1 × 1 cm2 piece of nylon mesh on top of a 1.5 mL tube and pass the entire digested cell suspension (approximately 1 mL) through the mesh.\nTake 10 μL for cell counting. Collect the remaining cells in the LN digestion plate by washing the well with ∼0.6 mL ice-cold PBS and also pass the wash through the nylon mesh and combine with the rest of the cells.\nNote: Keep the cell suspensions on ice until pelleting.\nCentrifuge the tubes at 500 × g for 5 min at 4°C. Remove supernatants and resuspend the cells in 200 μL of RPMI1640 with 10% FBS by gentle pipetting. Transfer the cell suspensions to 96-well U-bottom plates.\nCentrifuge the plates at 850 × g for 2 min at 4°C, then dump the supernatant into the sink or a waste container.\nWash cells.\nGently vortex the plate to loosen the cell pellet.\nWash the cells by adding 200 μL/well EDTA-free PBS by a multi-channel pipette.\nCentrifuge the plates at 850 × g for 2 min at 4°C.\nDump the supernatant into the sink or a waste container.\nStaining the cells and acquisition on the flow cytometer\nTiming: 2 h (for step 15)\nThis section describes how to stain dead cells with live/dead staining dye, stain cell surface markers with antibodies, and acquire samples by flow cytometry.\nStain dead cells.",
    "Loosen the cell pellets by gentle vortexing and add 20 μL/well dead cell staining dye (Zombie-UV, or Zombie-Aqua, diluted 1:100 in PBS).\nSuspend the cells by gently vortexing the plate.\nIncubate the plate on ice for 15–30 min.\nWash the cells as in step 10.\nNote: Although live/dead cell staining could be done together with Fc Block or cell surface marker staining step, some venders recommend buffers free of sodium azide and protein for fixable live/dead staining dye. We stain dead cells with Zombie-Aqua or Zombie-DAPI live/dead staining dye (BioLegend) diluted in PBS as a separate step.\nStain cell surface markers.\nAdd 10 μL/well Fc block solution (see materials and equipment[href=https://www.wicell.org#materials-and-equipment] section).\nSuspend the cells by gentle vortexing.\nIncubate the plate on ice for 15 min.\nWithout washing, add 10 μL/well cell surface staining Ab cocktails prepared in FACS buffer w/o EDTA as indicated in Table 1[href=https://www.wicell.org#tbl1].\ntable:files/protocols_protocol_2149_6.csv\nSuspend the cells by gentle vortexing.\nIncubate the plate for another 15–30 min on ice.\nWash the cells as in step 10.\ntable:files/protocols_protocol_2149_7.csv\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2149-Fig6.jpg\nFigure 6. Detection of CD45.1+ MHCII+ OT-II-APC conjugates by fluorochrome exchange in vitro\nRepresentative dot plots of CD45.1+ MHCII+ events in the fluorochrome exchange assay, where two sets of LN cells of OT-II-transferred mice are separately stained for CD45.1 and MHCII with different sets of fluorochromes (Ab set 1 or 2), mixed together in vitro, and incubated for another 10 min to allow fluorochrome exchange.",
    "Optional: To confirm that the OT-II-APC conjugates (defined as CD45.1+ MHCII+ double positive events with a high FSC/SSC ratio) are cellular conjugates formed in vivo rather than those formed ex vivo during the staining process, stain two sets of LN cells separately for CD45.1 and MHCII with different sets of fluorochromes (Table 2[href=https://www.wicell.org#tbl2]) as above in step 12, and then mix together and incubate for another 10 min at room temperature (20°C–25°C) (Figure 6[href=https://www.wicell.org#fig6]).\nWash the cells as in step 10 and resuspend them in 200 μL PBS. Filter the cells by passing the cell suspension through a small piece of nylon mesh and collect them into a FACS tube (5 mL round-bottom polystyrene tube).\nNote: Keep the samples on ice until loaded on a flow cytometer.\nDefine the gating strategy (see Figure 7[href=https://www.wicell.org#fig7] for an example).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2149-Fig7.jpg\nFigure 7. Gating strategy for detecting cellular conjugates between APCs and OT-II cells\n(A) Representative dot plots of gating strategy used in this protocol are shown. Adapted from Tatsumi et al. (2021).1[href=https://www.wicell.org#bib1] Reprinted with permission from AAAS.\n(B) Representative forward scatter area (FSC-A) and height (FSC-H) of CD45.1 single positive (SP) or CD45.1+ MHCII+ double positive (DP) events 3 h after OT-II cell transfer.\nNote: Refer to data analysis section for additional information on the gating strategy.\nAcquire all of isolated LN cells (typically 1–2 × 106 cells from one popliteal dLN) while watching the flow rate.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2149-Fig8.jpg\nFigure 8. Increase in the false CD45.1+MHCII+ conjugates at high flow rate",
    "Stained LN cells from mice immunized with OVA and papain (OVA/Pap) or papain alone (Pap) were analyzed at a low speed (around 5,000 events/s) or high (around 20,000 events/s) flow rate using Attune NxT flow cytometer (Thermo Fisher Scientific). When cells were acquired at a higher flow rate, CD45.1+MHCII+ “false conjugates” start to appear even in samples prepared from mice immunized without the cognate antigen (OVA), likely due to the increased frequency of multiple singlet cells passing through the detector simultaneously. Representative dot plots of CD45.1+MHCII+ are shown.\nNote: The optimal flow rate should be determined by the user for each experiment condition (Figure 8[href=https://www.wicell.org#fig8]). We typically run at 5,000 events/s or less on the Attune NxT flow cytometer (Thermo Fisher Scientific)."
  ],
  "subjectAreas": [
    "Immunology",
    "Microbiology",
    "Flow Cytometry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}