{
  "id": 2853,
  "origin_website": "Cell",
  "title": "Targeting endogenous proteins for spatial and temporal knockdown using auxin-inducible degron in Caenorhabditis elegans",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nGenerating AID::BFP or AID::mTagBFP2 knock-in mutants using CRISPR/Cas9 genome editing technology\nTiming: 1–5 days\nIn our original paper,1[href=https://www.wicell.org#bib1] we used a plasmid-based CRISPR/Cas9 system combined with a plasmid containing a dual selection marker cassette as a homology-dependent repair (HDR) donor template (Method 1). According to the recent technological advancements which greatly enhances genome editing efficiency in C. elegans,14[href=https://www.wicell.org#bib14],15[href=https://www.wicell.org#bib15],16[href=https://www.wicell.org#bib16] we have updated our CRISPR/Cas9 genome editing method to Method 2, which uses a ribonucleoprotein (RNP) complex containing Cas9 protein and gRNA, and PCR-amplified linear DNA as an HDR donor template. In this section, we describe both methods with some benefits and potential limitations of each method (Tables 1[href=https://www.wicell.org#tbl1] and 2[href=https://www.wicell.org#tbl2]).\ntable:files/protocols_protocol_2357_6.csv\ntable:files/protocols_protocol_2357_7.csv\nMethod 1. A plasmid-based AID::BFP/AID::mTagBFP2 knock-in\nTiming: 5 days\nIn this method, we deliver Cas9, single guide RNA (sgRNA), and HDR donor template into the C. elegans germ line as plasmids (Figure 2[href=https://www.wicell.org#fig2]). The plasmid-based Cas9 and sgRNA delivery method is cost-efficient and works reasonably well for many genetic loci in C. elegans. However, direct injection of in vitro assembled Cas9-gRNA RNP complex increases the editing efficiency compared with the plasmid delivery method,14[href=https://www.wicell.org#bib14] which we describe in Method 2.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2357-Fig2.jpg\nFigure 2. Workflow of Method 1: plasmid-based AID::BFP/AID::mTagBFP2 knock-in",
    "As an HDR donor plasmid, we used the dual-marker selection cassette plasmid17[href=https://www.wicell.org#bib17] containing 5′ and 3′ homology arms for HDR, AID::BFP or AID::mTagBFP2, and two selection markers (neomycin resistance (neoR) gene and Pmyo-2::GFP) flanked by two loxP sites. Animals with successful knock-in of the AID::BFP and a selection cassette can be screened for neomycin resistance and pharyngeal GFP expression.17[href=https://www.wicell.org#bib17],18[href=https://www.wicell.org#bib18] The dual selection marker allows for the high-throughput screening of the potential knock-in animals without the need for PCR-based screening. The dual selection marker cassette can be excised by injecting a plasmid containing the Cre recombinase gene into successful knock-in animals. This dual selection marker system can be combined with direct injection of the Cas9-gRNA RNP complex as described in Au et al.18[href=https://www.wicell.org#bib18]\nsgRNA plasmid construction (A detailed protocol is described in Arribere et al.)7[href=https://www.wicell.org#bib7]\nFind gRNA sequence near the knock-in site using the web-based CRISPR guide RNA selection tools.\nNote: Many design tools provide several parameters: for example, GC content and folding energy are provided in the C. elegans CRISPR gRNA selection tool (http://genome.sfu.ca/crispr/about.html[href=http://genome.sfu.ca/crispr/about.html]). According to Dr. Stephane Flibotte, who developed the database, all gRNAs on this database should be usable (personal communication). From our experience, the length of sequence between the gRNA target site and the knock-in site (closer is better) is critical for efficient knock-in.\nOrder oligo DNAs containing the 19 nt gRNA sequence (remove one base at the most 5′ end from 20 nt gRNA sequence on design tool databases) with the following overhangs: Forward: 5′-TCTTG-NNNNNNNNNNNNNNNNNNN- 3′. Reverse: 5′ -AAAC-NNNNNNNNNNNNNNNNNNN-C- 3′ (N denotes the reverse complement of the gRNA sequence).\nDigest the pRB10177[href=https://www.wicell.org#bib7] or pTK738[href=https://www.wicell.org#bib8] sgRNA plasmid with BsaI (NEB).\nAnneal the forward and reverse primers and ligate them into the digested sgRNA plasmids using T4 DNA ligase (NEB).",
    "Add ligation mixture to the DH5-alpha Escherichia coli competent cells for transformation.\nPurify plasmids using plasmid purification kits such as NucleoSpin Plasmid, Mini kit for plasmid DNA.\nUse Sanger sequencing to confirm the plasmid sequence using the M13 Forward primer.\nHDR donor plasmid construction.\nUsing high-fidelity DNA polymerases and N2 genomic DNA as a template, amplify approximately 500 bp of 5′ and 3′ homology arms flanking the knock-in site using specific primers with the following linker sequences for Gibson assembly. 5′ homology arm forward: 5′- AAAACGACGGCCAGTGAATTCCCGCGG-(20–25 nt gene-specific primer sequence)- 3′. 5′ homology arm reverse: 5′- GGGCTCCGGCTCCGGCTCCGGCTCC-(20–25 nt gene-specific primer sequence)- 3′. 3′ homology arm forward: 5′- ACGAAGTTATAGTTGCAGGACCACT -(20–25 nt gene-specific primer sequence)- 3′. 3′ homology arm reverse: 5′- CCATGATTACGCCAAGCTTGCGGCCGC -(20–25 nt gene-specific primer sequence)- 3′.\nPurify the PCR product using a gel purification kit.\nCritical: Make sure to remove the stop codon of the target gene in the 5′ reverse primer such that the coding sequence of AID::BFP/AID::mTagBFP2 is in frame with the target gene.\nDigest the AID::BFP/AID::mTagBFP2 plasmid with SacII and NotI according to the manufacturer’s protocol.[href=https://nebcloner.neb.com/]\nUsing the Gibson assembly method,19[href=https://www.wicell.org#bib19] clone the gel-purified 5′ and 3′ homology arm fragments into the SacII and NotI sites of the digested plasmid, respectively.\nAdd the Gibson assembly mixture to the DH5-alpha Escherichia coli competent cells for transformation.\nPurify the plasmid using plasmid purification kits such as NucleoSpin Plasmid Mini kit for plasmid DNA.\nUsing Sanger sequencing, confirm the sequence of the homology arms using the M13(-41) Forward (5′-GGTTTTCCCAGTCACGAC-3′) and the M13 reverse (5′-GGAAACAGCTATGACCATG-3′) primers.\nNote: Do not use the M13(-21) primer for sequencing as the dual selection marker cassette plasmids possess two M13(-21) sites, which cause mixed sequencing results.\nMicroinjection.",
    "Prepare a 10 μL microinjection mixture with the final concentration of each component as follows: HDR donor plasmid                  50 ng/μL. sgRNA plasmid                    50 ng/μL. Peft-3::cas9-SV40_NLS::tbb-2 3′UTR Cas9 plasmid50 ng/μL. Pmyo-2::mCherry (co-injection marker)        5 ng/μL.\nNote: Co-injection marker can be any dominant marker such as pRF4 (rol-6) except for Pmyo-2::GFP which is included in the dual selection marker cassette plasmid.\nCentrifuge the microinjection mixture at maximum speed (∼14000 G) for 10 min.\nNote: We recommend centrifuging the original plasmid solutions (∼14000 G, 10 min) before preparing the microinjection mixture, to minimize the contamination of resins and small debris, which can clog the needle during microinjection.\nInject the mixture into the gonads of gravid adults (P0s).12[href=https://www.wicell.org#bib12]\nNote: The number of animals you need to inject varies depending on several factors including the microinjection skill of the person who conducts the experiment. We usually inject 20–30 animals (40–50 gonad arms).\nTransfer the injected animals to the 60 mm NGM plate.\nWait 4–5 h for the injected P0 animals to lay the eggs that they already had at the time of microinjection.\nTransfer injected P0 animals to the 60 mm NGM plates with OP50 (P0 plates: 2–3 P0s / plate).\nCulture injected P0 animals for 24–36 h at room temperature (22°C).\nScreening F1s for knock-in mutants.\nPrepare a Geneticin (G418) working solution by diluting the stock solution (500 mg/mL in dH2O) with M9 buffer to a final concentration of 50 mg/mL. The Geneticin stock solution can be stored at −20°C.\nAdd 500 μL of the G418 working solution to the P0 plates with many F1 larvae.\nCulture P0 for 2–3 days at room temperature (22°C).",
    "Critical: Animals that survive the G418 treatment are either 1) proper knock-ins, 2) imperfect knock-ins (such as random insertion of the selection marker), or 3) animals carrying injected donor plasmid DNA as an extrachromosomal array. The following step will exclude animals with extrachromosomal arrays.\nUnder a fluorescence stereoscope, look for the F2-F3 animals that do not express pharyngeal mCherry, but express dim and uniform GFP in the pharynx.\nNote: These are the candidate knock-in animals. Animals that express mCherry and strong GFP carry multiple copies of Pmyo-2::mCherry and Pmyo-2::GFP sequences as an extrachromosomal array.\nNote: You may see some non-GFP animals surviving in the G418-treated P0 plates. This is because G418 is less effective on L4 larvae and adults.\nSingle candidate animals to the NGM plates and check for the Mendelian segregation of GFP+ animals in the progeny.\nNote: 100% of the progeny express GFP if the singled candidate animal is homozygous for knock-in, and 75% for heterozygous candidates.\nConfirm the perfect knock-in of AID::BFP/AID::mTagBFP2 by sequencing and the BFP/mTagBFP2 expression/localization.\nNote: More than one independent knock-in event may occur in each P0 plate. However, with this screening method, we cannot distinguish if two knock-in animals obtained from each P0 plate are derived from a single knock-in from one F1 animal or two independent knock-ins from two F1 animals. For this reason, we obtain a maximum of one independent knock-in line per P0 plate, and the number of P0 plates sets the maximum independent knock-in lines that could be obtained from each microinjection experiment.\nExcision of the dual selection marker cassette.\nPrepare a 10 μL microinjection mixture with the final concentration of each component as follows: Peft-3::Cre plasmid (pDD104: Addgene #47551) 50 ng/μL. pRF4 (rol-6(su1006dn)) co-injection marker 50 ng/μL.",
    "Note: All F1s from the successfully injected P0s are the potential candidates for Cre-dependent excision event. As the co-injection marker is for checking the microinjection quality only, any co-injection markers other than Pmyo-2::GFP (such as Pmyo-2::mCherry) would work.\nCentrifuge the injection mixture at the maximum speed (∼14000 G) for 10 min.\nInject the mixture into the gonads of homozygous knock-in animals.\nSingle injected P0 animals to the new NGM plate, and culture them for 3 days.\nScreen F2 animals for loss of pharyngeal GFP.\nSingle animals without GFP to the new NGM plates.\nConfirm the excision by sequencing.\nNote: While the dual selection marker cassette can be left at the knock-in site and used as a dominant marker for subsequent genetic crosses, we recommend excising the selection cassette, as the insertion of a 5.3kb dual selection marker cassette in between the coding region and the 3′ untranslated region may cause unwanted changes in gene expression and/or mRNA stability in certain cases.\nMethod 2. RNP and linear donor DNA-based CRISPR/Cas9 mediated genome editing\nTiming: 1 day\nIn the second method of CRISPR/Cas9 mediated knock-in, we use the Cas9 protein and gRNA to assemble an RNP complex in vitro, and PCR-amplified linear DNA as an HDR donor template (Figure 3[href=https://www.wicell.org#fig3]). While the direct injection of the RNP complex greatly increases the efficiency of genome editing in C. elegans,14[href=https://www.wicell.org#bib14] this method is more expensive as you need to purchase/synthesize crRNA, tracrRNA and Cas9 protein.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2357-Fig3.jpg\nFigure 3. Workflow of Method 2: RNP and linear DNA donor based AID::BFP/AID::mTagBFP2 knock-in",
    "For the linear DNA-based CRISPR/Cas9 method, we use a PCR-amplified linear HDR donor template with short (35–70 nt) homology arms. Compared with the dual selection marker cassette donor plasmid used in Method 1, the preparation of the HDR donor template is significantly simpler. Furthermore, in our experience, we have obtained multiple knock-in mutants from 3–10 injected P0s, due to the high editing efficiency of the direct injection of RNP complex, and increased HDR efficiency by ‘melting’ the donor DNA.16[href=https://www.wicell.org#bib16] A detailed protocol for ‘melting’ the donor DNA is also available in Ghanta et al.20[href=https://www.wicell.org#bib20]\nNote: To amplify the linear HDR donor template with homology arms, we need primers with the homology arm sequence and the DNA sequence between the gRNA target site and knock-in site (‘internal homology sequence’ see Figure 3[href=https://www.wicell.org#fig3] - step 2). Therefore, you may be constrained by the maximum length of the oligo DNA sequence you can order. We suggest using a gRNA targeting sequence that is as close to the insertion site as possible (within 30 nt).\nCRISPR RNA (crRNA) design.\nSelect a guide RNA target sequence that is close to the knock-in site using guide RNA selection tools.\nCritical: When selecting the guide RNA target sequence, make sure to choose a sequence that is close to the site of insertion.\nOrder/synthesize the crRNA.\nRibonucleoprotein (RNP) complex assembly.\nDissolve the crRNA in nuclease-free water to a working concentration of 40 ng/μL.\nDissolve the tracrRNA in nuclease-free water to a working concentration of 40 ng/μL.\nMix 1 μL of 40 ng/μL crRNA and 1 μL of 40 ng/μL tracrRNA and anneal them using the thermal cycler with the following program. 95°C 30 s. 90°C 30 s. 85°C 30 s. (5°C decrement). 35°C 30 s. 30°C 30 s.",
    "Mix 0.5 μL of 61 μM Cas9, 1 μL crRNA:tracrRNA and 2.5 μL of Cas9 Buffer.\nIncubate the mixture at room temperature (22°C) for 5 min for the RNP complex assembly.\nNote: The RNP complex may be kept at −20°C for up to 1 year.\nHDR donor template preparation.\nUsing high fidelity DNA polymerases and AID::BFP/AID::mTagBFP2 plasmids as templates, amplify an HDR donor template containing either AID::BFP or AID::mTagBFP2 sequence with a minimum of 35 nt of 3′ and 5′ homology arms. Use the following primer sequences to amplify the HDR template: Forward: 5'-(35–70 nt 5′ homology arm)-GGAGCAGGTGCCCCTAAAGATCCAG. Reverse (BFP)∗: 5 '-(35–70 nt 3′ homology arm)- TTAATTAAGCTTGTGACCCAGTTTGCT. Reverse (mTagBFP2)∗: 5'-(35–70 nt 3′ homology arm)- TTAGTTGAGCTTGTGTCCGAGCTTGG.\nNote: underlined sequences correspond to the stop codons of BFP and mTagBFP2, which should be removed if AID::BFP/AID::mTagBFP2 is inserted internally or at the N-terminus of the protein of interest.\nCritical: Make sure to remove the stop codon of the target gene in the BFP reverse or mTagBFP reverse primer such that the coding sequence of AID::BFP/AID::mTagBFP2 is in-frame with that of the target gene.\nCritical: Depending on the location of the gRNA target site, you will need to include the sequence between the Cas9 cut site and the AID knock-in site (‘internal homology sequence’ See Figure 3[href=https://www.wicell.org#fig3] – step 2). For details, see Ghanta et al.20[href=https://www.wicell.org#bib20]\nNote: To reduce the risk of mutations caused by polymerase errors, we recommend using fewer PCR cycle numbers (∼15 cycles).\n‘Melt’ the gel-purified HDR donor template according to Ghanta et al.20[href=https://www.wicell.org#bib20]\nNote: We use the same program as crRNA/tracrRNA duplex formation (step 7c) for ‘melting’ the donor template.",
    "Note: We recommend centrifuging the HDR donor template (14000 G, 10 min) before microinjection mixture preparation to minimize the contamination of resins and small debris, which can clog the needle during microinjection.\nMicroinjection.\nPrepare a 10 μL microinjection mixture with the final concentration of each component as follows:\ntable:files/protocols_protocol_2357_8.csv\nNote: According to Ghanta et al.,20[href=https://www.wicell.org#bib20] the microinjection mixture can be stored at 4°C at least up to 4 weeks in our hand.\nCentrifuge the microinjection mixture (∼14000 G) for 10 min.\nInject the mixture into the gonads of 5 gravid adult animals (P0s). Make sure to inject into both anterior and posterior gonad arms.\nTransfer injected P0 animals to the NGM plate.\nWait 4–5 h for the P0 animals to lay eggs that they already had at the time of injection.\nTransfer single P0 animals onto new NGM plates.\nCulture them for 48–72 h.\nScreening F1s for knock-in mutants.\nCheck each plate for the presence of roller F1 animals to check the microinjection quality.\nFrom each P0, transfer single 20–30 young roller and non-roller F1s that are younger than their roller siblings onto NGM plates (F1 plates).\nNote: Ghanta and Mello16[href=https://www.wicell.org#bib16] reported that the likelihood of CRISPR/Cas9 genome editing occurs later in the brood, after the rol-6(su1006dn) extrachromosomal array-containing cohort.\nCulture them for 3–5 days.\nLyse ∼20 worms from each F1 plate using the worm lysis buffer.\nUsing the gene-specific forward primer that bind to the sequence upstream of the 5 ‘homology arm of the HDR donor template, and the BFP or mTagBFP2 reverse primer below, screen F1 plates for AID::BFP/AID::mTagBFP2 knock-in. BFP reverse primer:     5 ′-GTCCACGGTTCCTTCCATG-3 ′. mTagBFP2 reverse primer: 5 ′-TGTGCATGTTCTCCTTGATGAGC-3 ′.\nConfirm the knock-in of AID::BFP/AID::mTagBFP2 via sequencing and examining the BFP/mTagBFP2 expression and localization.\nSingle copy insertion of TIR1 transgene using CRISPR/Cas9 genome editing technology",
    "Timing: 2–5 days\nUsing either of the CRISPR/Cas9 genome editing methods described above, you could insert a single copy of TIR1 from Arabidopsis thaliana with a tissue-specific promoter into one of the universal Mos1-mediated single-copy insertion (MosSCI) sites. TIR1 appears to be toxic to worms when overexpressed from the extrachromosomal array (unpublished observation). Here we describe the protocol to knock-in (Promoter of interest)::TIR1::unc-54 3′UTR transgene into the oxTi365 MosSCI site using the plasmid-based CRISPR/Cas9 protocol (Method 1). The oxTi365 MosSCI site is located on chromosome V at position 8,643,066.8[href=https://www.wicell.org#bib8],11[href=https://www.wicell.org#bib11] The gRNA target sequence in the sgRNA plasmid (pTK73_oxTi365) is 5′-CGGTCGCGGTACTCCAAATAGG-3′ (the underline shows the PAM sequence). Several TIR1 single-copy knock-in strains are available from the Caenorhabditis Genetics Center (CGC). There is also another method for generating TIR1 single-copy knock-in strains.21[href=https://www.wicell.org#bib21]\nNote: If the function of the protein of interest is unknown, a single copy TIR1 transgene with a ubiquitous promoter may be used. For example, you can simply cross your AID-containing strain into the CA1200 strain containing ieSi57 [Peft-3::TIR1::mRuby::unc-54 3′UTR + Cbr-unc-119(+)] II.3[href=https://www.wicell.org#bib3]\nHDR donor plasmid construction (Figure 4[href=https://www.wicell.org#fig4]).\nConstruct TIR1 transgene using the pSM vector plasmid which is derived from the Fire lab vector plasmid pPD49.26 (Addgene #1686).\nDigest the TIR1 containing pSM plasmid (Punc-4c::TIR1::unc-54 3′ UTR) with SphI and AscI restriction enzymes.\nUsing high-fidelity DNA polymerases and N2 genomic DNA as a template, amplify your promoter of interest using specific primers with the SphI and AscI sequences (undelined). Forward: 5′- GGGGCATGC-(20–25 nt promoter-specific primer sequence)- 3′. Reverse: 5′- GGGGGCGCGCC-(20–25 nt promoter-specific primer sequence)- 3′.\nPurify the PCR product using a gel purification kit.\nDigest the PCR product with SphI and AscI for 16 hours.\nGel purify the digested PCR product according to the manufacture’s protocol[href=https://assets.thermofisher.com/TFS-Assets/LSG/manuals/MAN0012661_GeneJET_Gel_Extraction_UG.pdf].",
    "Ligate the purified PCR product with the TIR1 containing pSM plasmid digested with SphI and AscI from step i using T4 ligase according to the manufacture’s protocol[href=https://international.neb.com/protocols/0001/01/01/dna-ligation-with-t4-dna-ligase-m0202].\nAdd ligation mixture to the DH5-alpha Escherichia coli competent cells for transformation.\nPurify plasmids using plasmid purification kits such as NucleoSpin Plasmid Mini kit for plasmid DNA.\nUsing a high-fidelity PCR polymerase and the TIR1 plasmid as a template, amplify (Promoter of interest)::TIR1::unc-54 3′utr using the following primers: oxTi365 forward: CGCGGTACTCCAAATGCCCATGACCATGATTACGCCAAG. oxTi365 reverse: TTATAGGCCGCCTGATGCCCAAACGCGCGAGACGAAAGGG. ∗Bold letters indicate the primer sequences that bind to the backbone sequences of the pSM vector plasmid located upstream of the promoter (forward) and downstream of the unc-54 3′UTR (reverse). Underlined sequences are the adapter sequences for Gibson assembly.\nNote: To reduce the risk of mutations caused by polymerase errors, we recommend using fewer PCR cycle numbers (∼15 cycles).\nDigest the oxTi365_loxP_myo2_neoR plasmid with SrfI.\nNote: The oxTi365_loxP_myo2_neoR plasmid contains 742bp and 946bp of 5′ and 3′ homology arm sequences, respectively. The SrfI site is located between the 5′ homology arm and the dual selection marker cassette.\nClone the PCR product of (Promoter of interest)::TIR1::unc-54 3′utr from step b) into the SrfI site of oxTi365_ loxP_myo2_neoR plasmid using Gibson assembly.\nCheck the insert by restriction enzyme digestion and sequencing.\nMicroinjection.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2357-Fig4.jpg\nFigure 4. Workflow of HDR donor plasmid construction for TIR1 single copy insertion\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2357-Fig5.jpg\nFigure 5. Schematic of auxin-inducible protein degradation\n(A) Schematic of negative control (top) and the experimental group (bottom) for auxin-inducible protein degradation. We cultured 6–8 L4 animals on the NGM plates with or without K-NAA and examined the F1 progeny at the L4 stage for auxin-induced UNC-4::AID::BFP knock-down in DA motor neurons.",
    "(B) Representative image of unc-4::AID::BFP; mizSi3(Punc-4c::TIR1::unc-54 3′utr) animals grown on the NGM plates without K-NAA. BFP expression is observed in the DA8 and DA9 (white arrowheads) and VA12 (yellow arrowhead) neurons. DA8 and DA9 presynaptic sites are labeled with GFP::RAB-3 (green) and mCherry::RAB-3 (magenta) on the dorsal side of the worm, respectively. Minimal overlap between the DA8 and DA9 presynaptic domains (yellow line) are observed.\n(C) Representative image of unc-4::AID::BFP; mizSi3(Punc-4c::TIR1::unc-54 3′utr) animals grown on K-NAA containing NGM plates. Large overlap between DA8 and DA9 synaptic domains is observed (yellow line). Loss of UNC-4::AID::BFP signal in the DA8 and DA9 neurons (dotted white line outlines the cell body) and the presence of UNC-4::AID::BFP signal in the VA12 neuron (yellow arrowhead) indicates DA neuron-specific UNC-4::AID::BFP degradation.\nFollow the steps described in step 3.\nScreening F1s for knock-in mutants.\nFollow the steps described in step 4.\nNote: In addition to the oxTi365 MosSCI site we used in our original work, we also generated sgRNA and HDR donor plasmids for single copy TIR1 transgene knock-in at another MosCI site on chromosome II (ttTi5605).8[href=https://www.wicell.org#bib8],11[href=https://www.wicell.org#bib11] The ttTi5605 MosSCI site is located on chromosome II at position 8,420,204.8[href=https://www.wicell.org#bib8],11[href=https://www.wicell.org#bib11]\nThe gRNA target sequence in the sgRNA plasmid (pTK73_ ttTi5605) is 5′-GATATCAGTCTGTTTCGTAACGG-3′ (the underline indicates the PAM sequence).\nPrimers to amplify Punc-4c (or your promoter of interest)::TIR1::unc-54 3′utr to clone theTIR1 transgene into the ttTi5605_loxP_myo2_neoR HDR donor plasmid is as follows:\nttTi5605 forward: CGATATCAGTCTGTTTCGGCCCATGACCATGATTACGCCAAG.\nttTi5605 reverse: TTATAGGCCGCCTGATGCCCAAACGCGCGAGACGAAAGGG.\n∗ Bold letters indicate the primer sequences that bind to the backbone sequences of the pSM vector plasmid located upstream of the promoter (forward), and downstream of the unc-54 3′UTR (reverse). Underlined sequences are the adapter sequences for Gibson assembly.\nFollow step 11 in this section for cloning the TIR1 transgene into the ttTi5605_loxP_myo2_neoR HDR donor plasmid.",
    "Note: The pTK73_ ttTi5605 and pTK73_oxTi365 plasmids are identical to previously published plasmids, pTK_pOB5 and pTK_pOB4, respectively.8[href=https://www.wicell.org#bib8]\nPreparation of synthetic auxin-containing NGM plates\nTiming: 20 min\nThe original work implementing the AID system in C. elegans used natural auxin indole-3-acetic acid (IAA), which requires ethanol as a solvent. We found that IAA treatment disrupted the localization pattern of mCherry::RAB-3, a marker to visualize presynaptic vesicles (unpublished). It is also known that IAA causes cytotoxicity.22[href=https://www.wicell.org#bib22],23[href=https://www.wicell.org#bib23] For these reasons, we use a water-soluble synthetic auxin analog, 1-naphthaleneacetic acid (NAA), which has been shown to work effectively for the AID system in C. elegans.24[href=https://www.wicell.org#bib24]\nPrepare a stock solution of NAA by dissolving potassium salt of NAA (K-NAA) in distilled water (dH2O) at a final concentration of 400 mM.\nNote: The K-NAA stock solution may be kept at 4°C for up to 3 months.\nPrepare a 4 mM K-NAA working solution by diluting the stock solution with M9 buffer.\nNote: We did not observe growth defects or abnormal localization of presynaptic markers at high concentrations of K-NAA (100 mM) (data not shown). We found that 1 mM (data not shown) and 4 mM K-NAA is sufficient for spatiotemporal degradation of UNC-4::AID::BFP (Figure 5[href=https://www.wicell.org#fig5]) and UNC-37::AID::BFP.1[href=https://www.wicell.org#bib1]\nAdd 500 μL of 4 mM K-NAA working solution to the 60 mm NGM plates with OP50 bacteria and let the solution dry for 12–16 h at room temperature (22°C).\nStore the K-NAA NGM plates in a light-blocking container at 4°C for up to four weeks.\nNote: Even though NAA is more photostable than IAA,23[href=https://www.wicell.org#bib23] it may still degrade if K-NAA is kept under prolonged light exposure. Storing the K-NAA stock solution, working solution and K-NAA containing NGM plates in the dark at 4°C may help extend their shelf life.",
    "∗Opened K-NAA powder bottle can be stored at 4°C for up to one year.\nK-NAA treatment for degradation of AID-tagged proteins\nTiming: 2–3 days\nTo test the efficiency of the AID system, conduct continuous knock-down from embryogenesis to adult stage of the gene of interest and examine if this condition reproduces known observable phenotypes (if any) (Figure 5[href=https://www.wicell.org#fig5]).\nConfirmation of spatial degradation of AID-tagged protein.\nGenerate strains with AID::BFP/AID::mTagBFP2 knock-in and the single copy TIR1 transgene. Check if they exhibit the wild type phenotype of your interest.\nTransfer 6–8 L4 P0 animals onto K-NAA containing NGM plates.\nAs a control, culture the same stage of P0 worms on the NGM plate without K-NAA.\nCulture them for 24–48 h.\nUsing a fluorescence microscope, examine the BFP or mTagBFP2 signal in the F1 animals grown on the NGM plates with and without K-NAA.\nNote: Successful protein knock-down will result in a loss of BFP/mTagBFP signal in the cell-types (DA neurons in the case of unc-4::AID::BFP; mizSi3) that express both the AID-tagged gene and TIR1 in the experimental group treated with K-NAA (Figure 5C[href=https://www.wicell.org#fig5]) .\nExamine the progeny for any known observable mutant phenotypes (Ex. dumpy, uncoordinated locomotion, lethality).\nCritical: Once it is confirmed that the continuous degradation of AID-tagged protein causes expected phenotypes, protein degradation can be induced within a specific developmental time point for examining the temporal requirement of the protein of interest. The degradation of AID-tagged proteins can occur within minutes of treating the animals with auxin.3[href=https://www.wicell.org#bib3] Below we describe the protocol used to knock-down UNC-4::AID::BFP embryonically and post-embryonically to determine the post-embryonic roles of UNC-4 in the spatial organization of synapses.1[href=https://www.wicell.org#bib1]\nTemporal degradation of the AID-tagged proteins.\nPositive and negative control:\nFor the positive control, we conducted continuous UNC-4::AID::BFP knock-down as described in step 18b.",
    "For the negative control, we cultured 6–8 L4 P0 animals on NGM plates without K-NAA as described in step 18c.\nEmbryonic knock-down:\nPlace 6–8 L4 P0 animals onto the K-NAA-containing NGM plates for 16 h.\nTransfer F1 animals at the early L1 stage to the NGM plates without K-NAA.\nLet the F1 worms grow on the NGM plate without K-NAA until the L4 stage.\nExamine for their phenotype.\nPost-embryonic knock-down:\nPlace 6–8 P0 animals at L4 stage onto the NGM plates without K-NAA for 16 h.\nTransfer F1 animals to the K-NAA containing NGM plates to induce UNC-4::AID::BFP degradation post-embryonically.         For early post-embryonic knock-down, transfer newly hatched F1 animals at the early L1 stage to the K-NAA-containing NGM plates.         For late post-embryonic knock-down, transfer F1 animals at the L2-L3 stages to the K-NAA containing NGM plates.\nLet the transferred animals grow on the K-NAA-containing NGM plates until the L4 stage and examine their phenotypes."
  ],
  "subjectAreas": [
    "Crispr",
    "Neuroscience",
    "Developmental Biology",
    "Genetics",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}