{
  "id": 7801,
  "origin_website": "Bio",
  "title": "Assessment of Oxidative Stress Biomarkers in Rat Blood",
  "procedures": [
    "Sample collection  Collect whole blood samples from pregnant rats at term through a cut at the end of the tail in both dry/free of anticoagulant (approximately 5.0–9.0 mL of blood) and heparinized (approximately 1.5 mL of blood in 0.2 mL of heparin) tubes. These volumes of blood are sufficient to process samples for oxidant and antioxidant biomarker measurements.Store under refrigeration at 4–8 °C for 30 min after collection. Note: The samples cannot be stored on wet ice.  Use the heparinized tubes to obtain washed erythrocyte samples (Figure 1):imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4626/bioprotoc-13-05-4626-g001.jpgFigure 1. Procedures to obtain the washed erythrocytes. Created with BioRender.com.Centrifuge the blood samples in heparinized tubes at 185 × g for 10 min at 4 °C.Discard the plasma (light yellow supernatant) and the buffy coat (leukocytes and platelets, translucid supernatant).Notes:  1) If the phases do not separate appropriately, repeat centrifuging. If the phases do not separate again, discard the sample. 2) If there is high lipid concentration in the samples, the plasma color will be white. Add 2 mL of PBS 1× (pH 7.4) to the erythrocyte samples for washing.Centrifuge at 1,575 × g for 1 min at 4 °C.Discard the supernatant (translucid supernatant).Repeat procedures A3c–e three times.Identify three microtubes for Hb, TBARS, and SH level measurements (Figure 2):i) Pipette 50 μL of washed erythrocyte samples (pellet obtained from previous steps) directly in each microtube (three in total) for later measurements of Hb, TBARS, and SH levels.ii) Add 950 μL of purified water in each microtube containing 50 μL of the washed erythrocyte.iii) Gently homogenize the samples by inversion.iv) Store aliquots at -80 °C until assays (stable for up to six months).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4626/bioprotoc-13-05-4626-g002.jpgFigure 2. Aliquots for Hb, TBARS, and SH level measurements in the washed erythrocytes using purified water. Created with BioRender.com.",
    "Identify five microtubes for Hb, SOD, H2O2, GSH-Px, and CAT level measurements (Figure 3):i) Pipette 50 μL of the washed erythrocyte samples (pellet obtained from previous steps) directly in each microtube (five in total) for activity measurements of Hb, SOD, H2O2 GSH-Px, and CAT.ii) Add 950 μL of the stabilizing solution (see Recipe 1) in each microtube.iii) Gently homogenize the samples by inversion.iv) Store the aliquots at -80 °C until assays (stable for up to six months).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4626/bioprotoc-13-05-4626-g003.jpg Figure 3. Aliquots for Hb, SOD, H2O2, GSH-Px, and CAT level measurements in the washed erythrocytes using a stabilizing solution.  Created with BioRender.com.Serum sample collection in dry/free anticoagulant tubes (mentioned in step 1,Figure 4):Centrifuge the blood samples in dry tubes at 1,575 × g for 10 min at 4 °C.Collet the serum using a micropipette and put it in another tube. Next, discard the pellet.Pipette the serum aliquots directly into six microtubes for protein quantification (20 μL), TBARS (550 μL), SH (10 μL), H2O2 (20 μL), SOD (5 μL), and GSH-Px (5 μL) using specific identification in each microtube.Store at -80 °C until analysis (stable for up to six months).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4626/bioprotoc-13-05-4626-g004.jpg Figure 4. Procedures to obtain the serum.  Created with BioRender.com. Hemoglobin (Hb) quantification in the washed erythrocytes  Take identified microtubes with Hb [diluted with purified water (step A3g) and stabilizing solution (step A3h)]. Note: Hemoglobin concentration measurements are similar in purified water and/or stabilizing solution because they are necessary for the determination of the normalization of oxidant and antioxidant concentrations. Thus, two microplates will be used for Hb determination (one for the purified water and another for the stabilizing solution).  Homogenize the samples in the vortex agitator mixer.Pipette 200 μL of Drabkin’s solution (see Recipe 2) in two wells of the microplate as a blank.Pipette 197.5 μL of Drabkin’s solution and 2.",
    "5 μL of samples (washed erythrocytes) in each well of the microplate (in duplicates).Cover the microplate and mix using a microplate mixer for 1 min at 750 rpm for homogenization.Rest the microplate for 10 min at 25 °C.Lightly tap the sides of the microplate several times to gently mix.Measure the absorbance at a wavelength of 546 nm using Gen5 software.Calculate Hb concentrations (see Data analysis). Quantification of protein concentrations in serum samples by Bradford’s method (Bradford, 1976)  Dilute one part of the serum samples in 100 parts of purified water in a microtube. Note: Other dilutions can be tested according to the experiment.  Identify six microtubes for the BSA solutions: 0, 0.1, 0.2, 0.4, 0.8, and 1.0 μg/μL.Prepare the BSA solutions for a standard curve setting from the 1 μg/μL stock solution (see Recipe 3), pipetting the following volumes of BSA and purified water:table:",
    "﻿Concentration (µg/µL),Stock solution (µL),Purified water (µL)\n0.0,0,50\n0.1,5,45\n0.2,10,40\n0.4,20,30\n0.8,40,10\n1.0,50,0",
    "Dilute the protein assay dye reagent concentrate in a ratio of one part of the reagent to four parts of purified water to prepare Bradford’s reagent.For example: dilute 10 mL of the protein assay dye reagent concentrate in 40 mL of purified water. Note: Calculate the quantity for Bradford’s reagent according to the number of wells that will be used.  Pipette 190 μL of Bradford’s reagent into each well of the microplate (standard curve and sample wells).Pipette 10 μL of each BSA solution into the standard curve wells (in duplicates). Homogenize with the tip.Pipette 10 μL of the serum samples into other wells (in duplicates). Homogenize with the tip.Measure the absorbance at a wavelength of 595 nm using Gen5 software.Calculate total protein concentrations (see Data analysis). Thiobarbituric acid reactive substances (TBARS)  Prepare 3% (w/v) 5-sulfosalicylic acid hydrate (see Recipe 4) and TBA 0.67% (see Recipe 5) solutions.Add 500 μL of serum or washed erythrocytes to a test microtube containing 500 μL of 3% 5-sulfosalicylic acid hydrate.Vortex the microtube for 10 s.Centrifuge the microtube at 18,000  × g  for 3 min at 4 °C.Rest the microtube for 15 min at 25 °C.Pipette the supernatant and store it in new microtubes. Note: Avoid pipetting the brown granules.  Add 500 μL of purified water in a tube as a blank.Add 500 μL of the supernatant to 500 μL of the TBA solution in a tube for each sample.Vortex the tubes for 10 s.Heat the mixtures at 95 °C for 30 min in a water bath with the tubes partially sealed.Cool on ice for 10 min to stop further reactions.Do not exceed 30 min for the next steps (a–e):Equilibrate the blanks and samples at 25 °C.Pipette 300 μL of purified water in two wells as a blank.",
    "Pipette 300 μL of the samples into each well of the microplate (in duplicates).Lightly tap the sides of the microplate several times to gently mix.Measure the absorbance at a wavelength of 535 nm using Gen5 software.Calculate TBARS concentrations (see Data analysis). Reduced thiol groups (-SH)  Prepare 0.1 M TRIS/HCl 0.5 mM EDTA pH 8.0 solution (see Recipe 7).Prepare the 10 mM DTNB solution (see Recipe 8).For the -SH quantification in the washed erythrocytes:Pipette 200 μL of 0.1 M TRIS/HCl 0.5 mM EDTA pH 8.0 in two wells as a blank.Pipette 195 μL of 0.1 M TRIS/HCl 0.5 mM EDTA pH 8.0 solution into other wells (in duplicates).Pipette 1.0 μL of the washed erythrocyte (in duplicates except in blank wells).Pipette 4.0 μL of the 10 mM DTNB solution into the sample wells (in duplicates).Cover the microplate and mix using a microplate mixer for 10 min at 750 rpm for homogenization.Measure the absorbance at a wavelength of 412 nm.For the -SH serum quantification:Pipette 200 μL of 0.1 M TRIS/HCl 0.5 mM EDTA pH 8.0 in two wells as a blank.Pipette 175 μL of 0.1 M TRIS/HCl 0.5 mM EDTA pH 8.0 solution into other wells (in duplicates).Pipette 5.0 μL of serum (in duplicates except in blank wells).Pipette 20 μL of the 10 mM DTNB solution into the sample wells (in duplicates).Mix the microplate using a microplate mixer at 750 rpm for 10 min.Measure the absorbance at a wavelength of 412 nm using Gen5 software.Calculate -SH concentrations (see Data analysis). Hydrogen peroxide (H2O2)  Prepare the solutions below:Solution 1 (see Recipe 9).Solution 2 (see Recipe 10).Solution 3 (see Recipe 11).Solution 4 (see Recipe 12).Phosphate buffer solution A (see Recipe 13).Peroxidase solution (HRP) (see Recipe 14).Prepare buffer solution B (see Recipe 15).",
    "Pipette 110 μL of the buffer solution B into two wells of the microplate as a blank.For the H2O2 quantification in the washed erythrocytes:Pipette 5 μL of the washed erythrocyte sample into other wells (in duplicates).Pipette 105 μL of the buffer solution B into the sample wells.Mix the microplate using a microplate mixer at 750 rpm for 10 s.Incubate the microplate at 37 °C for 10 min.Pipette 10 μL of 1 M NaOH (see Recipe 16) to stop the reaction.Measure the absorbance at a wavelength of 620 nm.For the H2O2 quantification in the serum samples:Pipette 10 μL of the serum sample into other wells (in duplicates).Pipette 100 μL of the buffer solution B into the sample wells.Mix the microplate using a microplate mixer at 750 rpm for 10 s.Incubate the microplate at 37 °C for 10 min.Pipette 10 μL of 1 M NaOH to stop the reaction.Measure the absorbance at a wavelength of 620 nm using Gen5 software.Calculate H2O2 concentrations (see Data analysis). Superoxide dismutase (SOD)  Prepare 1 M TRIS/HCl 5 mM EDTA pH 8.0 solution (see Recipe 17).Prepare 10 mM pyrogallol solution (see Recipe 18).Pipette 147 μL of 1 M TRIS/HCl 5 mM EDTA pH 8.0 solution into two wells of the microplate as a blank.Pipette 144 μL of 1 M TRIS/HCl 5 mM EDTA pH 8.0 into other wells (in duplicates).Pipette 3.0 μL of the washed erythrocyte/serum (in duplicates except in the blank wells).Lightly tap the sides of the microplate several times to gently mix.Add 3.0 μL of 10 mM pyrogallol solution into all wells including the blank (30 s for pipetting the solution in all microplates).Lightly tap the sides of the microplate several times to gently mix.",
    "Measure the absorbance during the time intervals of 0 (T0) and 10 (T10) min at 25 °C at a wavelength of 420 nm.Calculate SOD concentrations using Gen5 software (see Data analysis). Glutathione peroxidase (GSH-Px or GPx)  Prepare the solutions below: Note: All solutions (except 50 mM TRIS/HCl 5 mM EDTA pH 7.6 and 7 mM  t-butyl hydroperoxide) and reagents must be kept on ice until the moment of the assay. 0.1 M TRIS/HCl 0.5 mM EDTA pH 8.0 solution (see Recipe 7).50 mM TRIS/HCl 5 mM EDTA pH 7.6 solution (see Recipe 19).1% (w/v) NaHCO3 and 1 mM EDTA solution (see Recipe 20).10 mM HCl solution (see Recipe 21).0.1 M glutathione reduced (GSH) solution (see Recipe 22).10 U/mL glutathione reductase (GSH-Rd) solution (see Recipe 23).7 mM t-butyl hydroperoxide solution (see Recipe 24).4 mM NADPH solution (see Recipe 25).Prepare a MIX solution containing: Note: The MIX solution must be prepared immediately before the assay. It is recommended to trigger the reaction in up to 16 duplicate samples. If you prepare more than 16 duplicate samples, the results will be different because of the long time between the reactions.  240 μL of the 0.1 M GSH solution.1,200 μL of the 10 U/mL GSH-Rd solution.1,200 μL of the 4 mM NADPH.Keep this MIX solution on ice.Pipette 100 μL of the 50 mM TRIS/HCl 5 mM EDTA pH 7.6 solution in all wells of the microplate.Pipette 1.0 μL of the serum or 0.5 μL of the washed erythrocytes into all wells (in duplicates).Lightly tap the sides of the microplate several times to gently mix.Pipette 50 μL of the MIX solution into all wells.Lightly tap the sides of the microplate several times to gently mix.Pipette 20 μL of the 7 mM t-butyl hydroperoxide solution into all wells (to initiate a reaction).",
    "Note: It takes 15 s to pipette the 7 mM t-butyl hydroperoxide solution into the sample wells and trigger the reaction in up to 16 duplicate samples.  Quickly homogenize the microplate.Measure the absorbance every one-minute interval for 5 min at 25 °C in a microplate at a wavelength of 340 nm using Gen5 software.Calculate GSH-Px concentrations (see Data analysis). Catalase (CAT)  Prepare 0.1 M NaH2PO4·H2O solution (see Recipe 26).Prepare 1 M H2O2 solution (see Recipe 27).Verify hydrogen peroxide molarity:Pipette 1,000 μL of the 0.1 M NaH2PO4·H2O solution into a quartz cuvette (cuvette 1) as a blank in the reference position.Pipette 990 μL of the 0.1 M NaH2PO4·H2O solution into another quartz cuvette (cuvette 2) in the reading position.Select AUTO ZERO in a UV1800 spectrophotometer for calibration.Wait until the absorbance reaches zero.Keep the cuvette 1 in the reference position.Add 10 μL of 1 M H2O2 into cuvette 2.Quickly homogenize.Return cuvette 2 to the reading position.Measure the absorbance at a wavelength of 240 nm.Calculate the hydrogen peroxide real molarity (see Data Analysis and Notes).Wash both cuvettes.Pipette 999 μL of the 0.1M NaH2PO4·H2O solution with 1.0 μL of washed erythrocytes into a quartz cuvette (cuvette 1) as a blank (in the reference position).Pipette 978 μL of the 0.1M NaH2PO4·H2O solution with 1.0 μL of the washed erythrocytes into another quartz cuvette (cuvette 2) in the reading position.Select AUTO ZERO in a UV1800 spectrophotometer.Wait until the absorbance reaches zero.Add 21 μL of 1 M H2O2 into the quartz cuvette 2 for a quick homogenization.Perform the kinetics measurements for 2 min at 25 °C in a UV1800 spectrophotometer at 240 nm using UVProbe software.Calculate CAT concentrations (see Data analysis)."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}