{
  "id": 3141,
  "origin_website": "Cell",
  "title": "Protocol for production and purification of SARS-CoV-2 3CLpro",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nExpression and purification of SARS-CoV-2 3CLpro\nTiming: 4 days\nThis section details all the experimental steps needed to express His6-SUMO-3CLpro from BL21(DE3) Escherichia coli cells harboring the pGTM_CoV2_NSP5_004_SUMO (or pGTM_CoV2_NSP5_C145A_SUMO) plasmid, and to obtain 3CLpro (or C145A-3CLpro) in a pure and native form.\nExpression of His6-SUMO-3CLpro by induction with IPTG of transformed BL21(DE3) cells (days 1 and 2):\nNote: The transferring of cell cultures, as well as the addition of reagents and the collection of cell samples for the measurement of cellular growth must be carried out working under aseptic conditions inside the laminar flow cabinet or using a Bunsen burner to prevent cell culture contamination.\nPrepare a starter culture of transformed BL21(DE3) cells by picking and inoculating a single colony (from plates prepared at step 13 in the before you begin[href=https://www.wicell.org#before-you-begin] section, which contain transformed BL21(DE3) cells) in 50 mL of LB broth with 100 μg mL−1 ampicillin added. Incubate the resulting suspension for 16 h at 37 °C under agitation (at 225 rpm).\nTransfer the starter culture to 1 L of LB broth with 100 μg mL−1 ampicillin added and incubate the suspension at 37 °C under agitation (225 rpm).\nMeasure the optical density at 600 nm (OD600) every 30 min until it reaches ca. 0.6 units (approximately 1.5–2 h).\nAdd IPTG to a final concentration of 1 mM to induce protein expression.\nIncubate for 16 h at 17 °C under agitation (225 rpm).",
    "Alternatives: To prepare isotopically-enriched samples for NMR experiments using MJ9 minimal medium optimized for isotope-enrichment,8[href=https://www.wicell.org#bib8] at the end of point a above, transfer 25 mL of the obtained starter culture to 1 L of MJ9 minimal medium added with 50 μg mL−1 ampicillin. The resulting suspension should be incubated at 37 °C under stirring (225 rpm) and treated as described from point c onwards.\nAlternatives: While the best results are usually obtained using MJ9 medium, M9 minimal medium can also be used. In this case, once OD600 reaches ca. 0.6 units (point c above), harvest the cells by centrifugation for 20 min at 7000 × g at room temperature and resuspend the pellet in 375 mL of M9 minimal medium containing 15N ammonium sulphate (and/or 13C-enriched glucose) added with 50 μg mL−1 ampicillin. Incubate the resulting suspension for 20 min at 17 °C under agitation (225 rpm), then induce and further incubate as described in points d and e.\nAlternatives: To prepare 15N,13C,2H-enriched samples for NMR experiments using MJ9 minimal medium optimized for isotope-enrichment,8[href=https://www.wicell.org#bib8] fully replace step 1 a-e with the following procedure:\nPrepare a starter culture of transformed BL21(DE3) cells by picking and inoculating a single colony (from plates prepared at step 13 in the before you begin[href=https://www.wicell.org#before-you-begin] section) in 1.0 mL of LB medium added with 100 μg mL−1 ampicillin. Incubate the resulting suspension at 37 °C until OD600 reaches 0.6 units (approximately 1.5–2 h).\nHarvest the cells by centrifugation (7000 × g) at room temperature.\nResuspend the cell pellet in 3.0 mL of MJ9 medium A added with 50 μg mL−1 ampicillin.\nIncubate the cell suspension in a 15 mL Falcon Tube at 37 °C under agitation (225 rpm) until OD600 reaches 0.5 units (approximately 1.5–2 h).",
    "Critical: OD600 must not exceed 0.65 units to ensure that the culture is still in the log phase.\nPrepare four separate dilutions (1:40, 1:100, 1:200, 1:400) of the cells grown in MJ9 medium A in a final volume of 20 mL using MJ9 medium B (with 50 μg mL−1 ampicillin prepared in 2H2O added).\nIncubate the cell suspensions for 16 h at 37 °C under agitation (225 rpm).\nMeasure the OD600 of the cultures and select the one with OD600 closest to 0.5 units.\nHarvest the cells of the selected culture by centrifugation (7000 × g) at room temperature (20–25 °C) for 5 min.\nResuspend the cell pellet in 500 mL of MJ9 medium C with 50 μg mL−1 ampicillin prepared in 2H2O added.\nIncubate the cell suspension at 37°C under agitation (225 rpm) until OD600 reaches 0.35 units, then further incubate for 45 min at 17 °C under agitation (225 rpm).\nInduce protein expression with 1 mM IPTG (using IPTG stock prepared in 2H2O).\nIncubate the culture for 12–16 h at 17 °C under agitation (225 rpm).\nCell lysis and soluble extract recovery (Day 3).\nHarvest the cells by centrifuging the culture for 30 min at 7000 × g at 4 °C.\nGently resuspend the harvested cells in 20 mL lysis buffer.\nLyse cells by sonication (50 % power, 5 s/5 s on/off, for a total on time of 10 min) on ice.\nCollect a 10 μL aliquot of the lysate (total lysate, TL) in a 1.5 mL microcentrifuge tube for SDS-PAGE analysis; add the appropriate amount of loading dye (usually 5 μL or what is recommended by manufacturer) and freeze at −20 °C.",
    "Centrifuge the lysate for 30 min at 17000 × g at 4 °C to separate the soluble extract from the insoluble proteins and cell debris: collect the soluble extract. Collect 10 μL aliquots each of the soluble extract (S) and the insoluble pellet (I) in 1.5 mL microcentrifuge tubes for SDS-PAGE analysis, add the loading dye to each tube, and freeze at −20 °C. Discard the remaining insoluble portion according to standard biosafety protocols.\nFilter the soluble extract using 0.45 μm syringe filters and store at 4 °C.\nAlternatives: Lysis can also be carried out by using a French press (SLM Aminco). The harvested cells can be resuspended in ca. 25 mL of lysis buffer and homogenized by using a Potter-Elvehjem tissue grinder to obtain a homogeneous cell suspension and to disrupt any solid salt precipitate possibly formed during cellular growth. The resuspended cells are lysed performing three lysis cycles using the French press at 20,000 psi (1 psi = 6.9 kPa).\nCritical: While lysing, both procedures cause an abrupt temperature increase in the cell suspension. It is highly recommended to keep the lysate on ice and to use a container with good thermal conductivity during the procedure to prevent thermal protein denaturation that would negatively affect final protein yield.\nImmobilized metal affinity chromatography (IMAC) (Day 3).\nNote: The expressed SARS-CoV-2-3CLpro contains a His6-SUMO tag at its N-terminus that allows for protein purification using immobilized nickel affinity chromatography carried out using an ÄKTAprime system with a 5 mL HiTrap Chelating HP column (Cytiva) working at a flow rate of 4 mL min−1.",
    "Note: Due to the high amount of His6-SUMO-3CLpro expressed from 1 L of cell culture, it is recommended to split the soluble fraction and perform the IMAC in two steps to prevent column overloading and possible loss of protein. Two or more columns placed in series can also be used to achieve high amounts of protein recovery and speed up the purification procedure.\nWash the 5 mL HiTrap Chelating HP column with five column volumes (CVs) of MilliQ water and regenerate with 0.1 M NiSO4 following the manufacturer’s protocol https://cdn.cytivalifesciences.com/api/public/content/digi-11225-pdf[href=https://cdn.cytivalifesciences.com/api/public/content/digi-11225-pdf]).\nEquilibrate the column with 5 CVs of washing buffer.\nLoad the soluble extract onto the column either through a superloop (Cytiva) (using washing buffer) or directly with pump A.\nWash the column with washing buffer and collect the unbound material (hereafter called Flow-Through, FT). Monitor the absorbance at 280 nm (Abs280) and wait until the baseline returns to zero (typically ca. 10–20 CVs) to ensure complete removal of the FT.\nCollect a 10 μL aliquot of FT in a 1.5 mL microcentrifuge tube for SDS-PAGE analysis, add the loading dye, and freeze at −20 °C. Store the rest of FT at 4 °C.\nElute the bound proteins by increasing the imidazole concentration by setting a linear gradient from 0 to 100 % of elution buffer in ten CVs and collecting eluate in 2 mL fractions. A representative chromatogram is shown in Figure 3[href=https://www.wicell.org#fig3]A.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2712-Fig3.jpg\nFigure 3. Immobilized metal (nickel) affinity chromatography (IMAC)\n(A) Representative chromatogram showing the entire process of protein loading, flow through collection, and protein elution.\n(B) SDS – PAGE showing total lysate (TL), soluble extract (S), flowthrough (FT) and fractions eluted in peak 1 (P1) of the IMAC. His6-SUMO-3CLpro (molar mass of ca. 46 kDa) is detected in lanes corresponding to peak P1.",
    "Collect a 10 μL aliquot of each fraction in 1.5 mL microcentrifuge tubes for SDS-PAGE analysis, add the loading dye and freeze at −20 °C.\nOnce the elution is complete, wash the column with five CVs of elution buffer, MilliQ water, and 20 % v/v ethanol each to return the column in storing conditions. Store the column at 4 °C.\nAnalyze the total lysate (TL), the soluble extract (S), as well as the FT and the fractions eluted from the IMAC, for protein presence and purity by running an SDS-PAGE loading 5 μL of the samples previously collected and boiled for 5 min at 90 °C (a representative protein gel is shown in Figure 3[href=https://www.wicell.org#fig3]B).\nPool the fractions containing His6-SUMO-3CLpro and store at 4 °C.\nCleavage of the His6-SUMO tag by SUMO protease and buffer exchange (Day 3).",
    "Note: The proteolytic cleavage of the N-terminal His6-SUMO tag is performed by the addition of His8-MBP-SUMOpro to the expressed His6-SUMO-3CLpro. General protocols for SUMO protease cleavage recommend carrying out cleavage in the presence of imidazole concentrations lower than 150 mM to prevent adverse effects of imidazole on the activity of SUMO protease. His6-SUMO-3CLpro elutes at ca. 180 mM imidazole concentration from the IMAC, therefore a buffer exchange may be useful to decrease the concentration of imidazole in the protein solution prior to treating with SUMO protease. However, uncontrolled cleavage of His6-SUMO tag from His6-SUMO-3CLpro, probably by trace amounts of native E. coli proteases, has been observed prior to the addition of SUMO protease. This can be minimized by carrying out cleavage in imidazole immediately after purifying the His6-SUMO-3CLpro fusion, with minimal to no negative effects on the production of pure and native 3CLpro (as described in this protocol). Nevertheless, if SUMO protease activity issues are observed, a buffer exchange into the Loading / Washing Buffer can be carried out before treatment with SUMO protease by performing points c-e before points a and b of the following procedure. Buffer exchange can be carried out using an ÄKTAprime system and a HiPrep 26/10 Desalting column (Cytiva) working at a flow rate of 10 mL min−1, or by dialysis. In any case, buffer exchange is mandatory to decrease the concentration of imidazole in the protein prior to the following protocol for removal of the cleaved tag and the SUMO protease from the native 3CLpro by reverse IMAC.",
    "Note: Incubation times for complete cleavage of N-terminal His6-SUMO tag by SUMO protease may vary depending on protease activity. As described in the before you begin[href=https://www.wicell.org#before-you-begin] section, the optimal ratio and cleavage temperature (4 or 26 °C) should be empirically determined by performing cleavage assays on small-scale samples. In this protocol a 1:100 (w/w) ratio of SUMO protease generally provides > 99 % cleavage after 3 h when carried out in a pH 8.0 buffer containing reducing agent (e.g. the Elution Buffer) at 26 °C.\nCollect a 10 μL aliquot of the pre-cleaved His6-SUMO-3CLpro in a 1.5 mL microcentrifuge tube for SDS-PAGE analysis, add the loading dye, and freeze at −20 °C.\nAdd 1:100 (w/w) ratio of His8-MBP-SUMOpro (ULP1) to the protein solution (estimated by absorbance at 280 nm and considering ε280 = 100,855 M−1 cm−1 and 32,890 M−1 cm−1 for His8-MBP-SUMOpro and His6-SUMO-3CLpro, respectively) in Elution Buffer (or after buffer exchange in Loading / Washing Buffer to reduce imidazole concentrations, if preferred) and incubate for 3 h at 26°C to ensure complete cleavage of the N-terminal tag.\nDuring this hydrolysis incubation, wash the HiPrep 26/10 Desalting column (Cytiva) with five CVs of MilliQ water and equilibrate it with five CVs of Loading / Washing Buffer.\nAt the end of the hydrolysis incubation, load up to 10 mL of protein solution onto the HiPrep 26/10 Desalting column using a sample loop of the appropriate volume, and carry out the buffer exchange and protein elution using Loading / Washing Buffer, monitoring Abs280 and stopping sample collection when Abs280 returns to baseline.",
    "Note: Imidazole elution strongly affects the conductance of the eluate. Therefore, it is recommended to monitor the change of this parameter value during elution to ensure the correct separation from the protein solution (to read more about the basis of desalting procedures and technical details using HiPrep 26/10 Desalting visit manufacturer’s web site at https://www.cytivalifesciences.com/[href=https://www.cytivalifesciences.com/]).\nComplete washing of the Desalting column with five CVs of washing buffer, MilliQ water, and 20 % v/v ethanol each to return the column in storing conditions. Store the column at 4 °C.\nAlternatives: Cleavage of His6-SUMO tag from 3CLpro and buffer exchange can also be carried simultaneously by dialyzing the protein eluted from the IMAC in the presence of a 1:100 (w/w) ratio SUMO protease, for 12–16 h at 4 °C, against Loading / Washing Buffer prepared without imidazole (i.e., 20 mM Tris pH 8.0, 300 mM NaCl, 1 mM DTT).\nRemoval of the cleaved tag and SUMO protease from cleaved 3CLpro solution (Day 4).\nNote: The cleaved His6-SUMO tag and His8-MBP-SUMOpro both present N-terminal His-tags allowing for separation from the native 3CLpro through an additional step of IMAC. Cleaved 3CLpro will not interact with the column resin and will therefore be collected in the flowthrough, while His6-SUMO tag and His8-MBP-SUMOpro will bind to the column and will be eluted at a higher imidazole concentration. Separation is carried out using an ÄKTAprime system and a 5 mL HiTrap Chelating HP column (Cytiva) loaded with Ni2+, working at a flow rate of 4 mL min−1.\nWash the 5 mL HiTrap Chelating HP column (Cytiva) used the day before with five CVs of MilliQ water and equilibrate it with five CVs of Loading / Washing Buffer.\nLoad the protein solution onto the column using a superloop (Cytiva) or pump A (while using Loading / Washing Buffer).",
    "Wash the column with Loading / Washing Buffer while monitoring the absorbance at 280 nm (Abs280) to recover the cleaved, native 3CLpro in the flowthrough. Store the protein solution at 4 °C.\nCollect a 10 μL aliquot of protein solution in a 1.5 mL microcentrifuge tube for SDS-PAGE analysis, add the loading dye, and freeze at −20 °C.\nElute the bound proteins remaining on the column using five CVs of 100 % Elution Buffer until the Abs280 baseline returns to zero.\nCollect a 10 μL aliquot of the eluted proteins in a 1.5 mL microcentrifuge tube for SDS-PAGE analysis, add the loading dye and freeze at −20 °C.\nWash the column with five CVs of MilliQ water and five CVs of 20 % v/v ethanol to return the column in storing conditions. Store the column at 4 °C.",
    "Alternatives: To minimize cleavage of His6-SUMO tag from 3CLpro by native E. coli proteases, an on-column cleavage of His6-SUMO tag can be performed directly on the 5 mL HiTrap Chelating HP column prior to eluting with imidazole. This useful shortcut allows to perform IMAC purification, cleavage of His6-SUMO tag from 3CLpro, and removal of cleaved His6-SUMO tag and His8-MBP-SUMOpro from native 3CLpro in one step. In the on-column cleavage protocol, follow points a-e of step 3 (Immobilized metal affinity chromatography). Then add 1–2 mL of 1 mg mL−1 His8-MBP-SUMO-pro (1 mL is sufficient for lower yields, e. g., batches fermented in minimal medium, but 2 mL may be needed for higher yield batches). Run one CV of Loading / Washing Buffer to fully load the protease onto the column and allow cleavage by storing the column 12–16 h at 4 °C. The next morning, elute the cleaved 3CLpro with Loading / Washing Buffer and use the Elution Buffer to elute any remaining uncleaved His6-SUMO-3CLpro, the His8-MBP-SUMOpro, and the cleaved His6-SUMO tag. In this protocol, the target product is also not exposed to high concentrations of imidazole.\nSize exclusion chromatography (SEC) (Day 4).\nNote: A final size exclusion chromatographic (SEC) step provides a fully monodisperse and pure 3CLpro sample in a buffer suitable for downstream structural and biochemical studies. This step is carried out using an ÄKTAprime system and a HiLoad® 16/60 Superdex® 75 column (Cytiva), working at a flow rate of 1 mL min−1.\nConcentrate the protein solution to a final volume   ≤   5 mL using an Amicon Ultra Centrifugal Filter Unit (MWCO 10,000 Da) (Merck Millipore).",
    "Critical: Although not strictly necessary, this concentration step is highly recommended to expedite the following SEC. During this step it is important to monitor the concentration of the protein solution (by measuring the absorbance at 280 nm and considering ε280 = 32,890 M−1 cm−1), which should not exceed 0.8 mM to avoid possible precipitation. If the desired volume of 5 mL is not achievable, split the protein solution into two or more aliquots to be independently treated in the next purification step.\nWash the column with one CV of MilliQ water and equilibrate it with one CV of SEC buffer.\nLoad up to 5 mL of protein solution using a sample loop of the appropriate volume and carry out the protein elution using SEC buffer (a representative chromatogram is shown in Figure 4[href=https://www.wicell.org#fig4]A), collecting the eluate in 1 mL fractions and store at 4 °C.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2712-Fig4.jpg\nFigure 4. Size exclusion chromatography of native 3CLpro\n(A) Representative SEC chromatogram and (B) corresponding SDS – PAGE from elution of the SEC column. Lanes C, FT, P1, and P2 correspond respectively to the pre-loaded cleaved protein solution, molecular weight standards, native 3CLpro eluted in peak P1 (at a molar mass of ca. 33 kDa for the monomer), and the His6-SUMO tag eluted in peak P2 (at a molar mass of ca. 12 kDa).\nCollect a 10 μL aliquot of each fraction in 1.5 mL microcentrifuge tubes for SDS-PAGE analysis, add the loading dye, and freeze at −20 °C.\nRepeat points c - d for each 5 mL of the remaining protein solution.\nUpon complete elution of the last protein sample wash the column with one CV of MilliQ water and one CV 20 % v/v ethanol. Store the column at 4 °C.",
    "Analyze all collected fractions for protein presence and purity by running an SDS-PAGE gel loading 5 μL of the samples previously collected and boiled for 5 min at 90°C. Pool the fractions containing native 3CLpro. A representative SDS-PAGE is shown in Figure 4[href=https://www.wicell.org#fig4]B.\nNative 3CLpro can be concentrated up to 25 mg mL−1 (corresponding to 0.8 mM monomer). At these concentrations, native 3CLpro can be flash-frozen in liquid nitrogen and stored for up to one month at −80 °C.\nNote: SEC buffer here reported is one among the several buffers in which native 3CLpro can be stored. Buffers most compatible with other downstream studies can be chosen as well.\nAlternatives: In our experience, the cleaved His6-SUMO tag and the His8-MBP-SUMOpro can also be effectively separated from the native 3CLpro directly through the SEC procedure, rather than using the HiTrap column. To pursue this alternative, follow the purification procedure until point 4b (Cleavage of the His6-SUMO tag by SUMO protease), then skip step 4 points c - e (Buffer exchange) and step 5, and go directly to step 6.\nCharacterization of SARS-CoV-2 3CLpro by mass spectrometry\nTiming: 3 h\nSample separation by HPLC.\nDilute a 1 mg mL−1 solution of 3CLpro 1:10 (v/v) in MilliQ water.\nLoad the diluted protein sample onto a Jupiter C4 column (Phenomenex) working at a flow rate of 0.4 mL min−1 using mobile phases A (H2O/formic acid; 100/0.1; v/v) and B (acetonitrile/formic acid; 100/0.1; v/v) to perform a gradient to enhance the separation of the eluting species.\nAnalyze the eluted species using an ESI-Q-TOF spectrometer (Xevo, Waters) using the software provided with the instrument.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2712-Fig5.jpg\nFigure 5. Characterization of purified 3CLpro",
    "(A) SDS-PAGE gel showing high quality of SARS-CoV-2 3CLpro sample. Lane a – molecular weight standards; Lane b – SARS-CoV-2 3CLpro post SEC purification (sample prepared as described above in \"Size exclusion chromatography (SEC)\" section) (B) ESI-MS profile of SARS-CoV-2 3CLpro showing the signal corresponding to an experimental molecular mass of 33,796 Da.\nNote: The resulting deconvoluted spectrum shows a single signal corresponding to an experimental molar mass of 33,796 Da (Figure 5[href=https://www.wicell.org#fig5]). The experimental value perfectly matches that estimated by the amino acid protein sequence (UniProt entry P0DTD1, residues 3264–3569) and establishes that the current protocol for the expression and purification of SARS-CoV-2 3CLpro is a reliable procedure to obtain large quantities of native 3CLpro.\nFRET (Förster resonance energy transfer) assay for the characterization of 3CLpro inhibition by IC50 determination\nTiming: 2 h\nNote: 3CLpro inhibition properties are characterized by performing FRET assays using peptide substrate KTSAVLQ/SGFRKME (designed with the 3CLpro cleavage site Q/S) labeled with a DABCYL and EDANS FRET pair (fluorophore/quencher) on N and C termini, respectively (DABCYL-KTSAVLQ/SGFRKME-EDANS) (GenScript). Excitation at 360 nm excites the donor EDANS which transfers its energy non-radiatively due to the close proximity of the acceptor (quencher), DABCYL. Upon enzymatic cleavage of the labeled FRET peptide by 3CLpro, energy transfer no longer occurs between the fluorophore and quencher, resulting in an increase in fluorescence that can be detected at the emission maximum of the fluorophore EDANS (460 nm). This rate of increase in fluorescence is directly proportional to the enzyme activity. FRET assays are carried out at increasing concentrations of potential 3CLpro inhibitors to screen candidate molecules and evaluate their IC50 values (i.e., the inhibitor concentration providing a 50 % decrease of enzyme activity).",
    "FRET assays are carried out using black opaque 96-well microplates (Corning) containing a final volume of 100 μL per well. Figures 6[href=https://www.wicell.org#fig6] and 7[href=https://www.wicell.org#fig7] provide the detailed amounts of reagents placed in each well. Experiments should be run in triplicate and results are monitored and analyzed using a TECAN Infinite M1000 microplate reader and Magellan™ software (or comparable multi-well fluorimeter).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2712-Fig6.jpg\nFigure 6. Materials preparation for calibration curve\n(A) Schematic of 96 microwell plate set-up for FRET calibration curve.\n(B) Table of reagents for each well.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2712-Fig7.jpg\nFigure 7. Materials preparation and data processing for IC50 determination\n(A) Schematic of 96-well plate set-up for dose response assay to determine IC50.\n(B) Table of reagents for each well (final DMSO concentration = 4 %).\n(C) Representative experimental raw data showing the increase of fluorescence intensity as a function of reaction time.\n(D) Representative dose response curve for Narlaprevir, error bars represent SD's of triplicate measurements.\nInstrument protocol setup:\nUse the Magellan™ software of TECAN Infinite M1000 microplate reader with the following parameters: (i) Excitation wavelength: 360 nm; (ii) Emission wavelength: 460 nm. Fluorescence intensity is recorded every 3 s for a total of 15–60 min at room temperature (20–25 °C).\nCalibration curve for fluorescence-to-activity conversion.\nNote: Raw data collected during the FRET experiments indicate fluorescence intensity due to substrate proteolysis and are reported in terms of Relative Fluorescence Units (RFU). Preparation of a calibration curve for the conversion of the fluorescence data to cleaved peptide concentration (μM) using 0.10 to 20 μM EDANS is described below:\nPrepare a stock solution of 500 μM EDANS (MedChem Express) in DMSO.\nPrepare 100 μM and 10 μM dilutions of the 500 μM stock solution using DMSO.\nAdd FRET buffer to each well according to Figure 6[href=https://www.wicell.org#fig6].",
    "Add the appropriate volume of EDANS to each well so that the final concentrations range from 0.10 to 20 μM.\nMeasure emission at 460 nm using the Magellan™ software of TECAN Infinite M1000 microplate reader.\nPlot the measured fluorescence as a function of EDANS concentration in Microsoft Excel or GraphPad Prism.\nPerform a linear fit of the data.\nNote: The resulting best-fit equation will be used to interpolate experimental fluorescence data obtained in the following experiment and convert from RFU per second to substrate hydrolysis rates (μM s−1).\nAlternatives: A calibration curve can also be set up by incubating 200 nM 3CLpro with increasing concentrations of FRET substrate (0.5–50 μM) and monitoring the reaction until the fluorescence signal reaches plateaus for all concentrations, thus indicating that the total amount of the FRET substrate has been cleaved by 3CLpro. Final fluorescence values can be plotted as a function of the FRET substrate concentration and fit linearly to generate a calibration curve as described in step 10.\nNote: For certain FRET studies it is necessary to calibrate the fluorimeter for inner-filter effects arising from UV absorbance by the substrate (or inhibitor) at high concentrations.20[href=https://www.wicell.org#bib20] However, at the concentrations of substrate described in this protocol, no inner filter effect corrections are required.\n3CLpro, FRET substrate and inhibitor preparation:\nPrepare a 10 mM peptide substrate stock solution in DMSO, and store it as 60 μL aliquots at −20 °C.\nPrepare 5 mM peptide substrate samples from the 10 mM stock by diluting 35 μL with an equal volume of FRET buffer.\nPrepare inhibitor stocks dissolving them in DMSO and diluting to 10.0, 1.0, and 0.1 mM concentrations in DMSO.",
    "Gently thaw 30 μL of purified 3CLpro on ice. Estimate the protein concentration using Lambert-Beer equation, with ε280 = 32,890 A.U. M−1 cm−1, and dilute the 3CLpro sample to a final concentration of 10 μM using FRET Buffer.\nSetup of the reaction mixtures in the 96-well microplates:\nIn each well of the 96-wells microplate add:\nFRET buffer as described in Figures 7[href=https://www.wicell.org#fig7]A and 7B (90 μL of FRET Buffer will be added to every well except for column 2, where a negative control experiment in the absence of enzyme will be set up using 94 μL of FRET Buffer).\n4 μL of 10 μM 3CLpro stock solution (resulting in 400 nM 3CLpro final concentration) except for the negative control experiment in column 2.\n0–2.0 μL inhibitor, corresponding to 0–200 μM concentration (refer to Figures 7[href=https://www.wicell.org#fig7]A and 7B for details).\nAdd the appropriate amount of DMSO to maintain the DMSO concentration constant in all wells.\nLet the plate equilibrate for 10–15 min at room temperature (20–25 °C).\nInitiate the reaction by adding 4 μL of 5 mM peptide substrate stock (resulting in 200 μM substrate final concentration), and mix by pipetting up and down 2–3 times.\nNote: The enzymatic reaction begins as soon as the substrate is added to each well. Carefully pipette the substrate into each well, moving as quickly as possible to initiate the FRET data collection (below) with minimal dead time.\nPlace the 96-well microplate in the Infinite M1000 plate reader (TECAN) and press START on the Magellan software immediately to begin data collection.\nLet the reactions run for 10–20 min to measure initial enzyme velocities.\nNote: Measurements are carried out at saturating substrate concentration (i.e. [S]   ≫   Km and reaction rate close to Vmax). Final concentration of DMSO = 4 %.",
    "Note: Inhibitors vary in their solubility. Therefore, the assay may be adjusted to use final concentrations of DMSO even lower than 1 % for appropriately soluble substrates and inhibitors.\nData export and analysis.\nExport the data from Magellan in Microsoft Excel .xls or in .csv format.\nAnalyze the data using GraphPad or other kinetic analysis software:\nPlot the fluorescence intensity vs. time data (Figure 7[href=https://www.wicell.org#fig7]C) for each inhibitor concentration.\nMeasure the slope of the linear portion of each curve (usually within the first 5 min of reaction) by performing a linear fit on that region.\nNote: Each obtained slope value corresponds to the initial velocity in the presence of that inhibitor concentration (Vi). The slope determined for the positive control measurements in column 1 (Figure 7[href=https://www.wicell.org#fig7]B), carried out in the absence of inhibitor, corresponds to the initial velocity of the non-inhibited 3CLpro (V0).\nCalculate the average   ±   standard deviation values for the triplicate measurements carried out at each inhibitor concentration to obtain, for each concentration, an averaged Vi (or V0) value.\nUsing the averaged values, calculate residual activity (%) at each inhibitor concentration using the formula\n(Equation 1)\nR\ne\ns\ni\nd\nu\na\nl\na\nc\nt\ni\nv\ni\nt\ny\n(\n%\n)\n=\n100\n×\nV\ni\nV\n0\nPlot residual activity (%) data as a function of increasing inhibitor concentration and fit them by using the following equation:\n(Equation 2)\nR\ne\ns\ni\nd\nu\na\nl\na\nc\nt\ni\nv\ni\nt\ny\n(\n%\n)\n=\n100\n1\n+\nx\n/\nI\nC\n50\nTransform the x-axis visualization on a Log10 scale to show the plotted experimental data and resulting fit following the typical sigmoidal behavior (Figure 7[href=https://www.wicell.org#fig7]D).",
    "Note: The IC50 value estimated by Equation 2[href=https://www.wicell.org#fd2] corresponds to the inhibitor concentration at which residual activity is 50 %.\nAlternatives: This protocol can also be adopted as a method for preliminary screening of a panel of molecules as potential inhibitors by using a single concentration (e.g., 20 μM) of each.\nNMR spectroscopy of 3CLpro\nTiming: Approximately 4 h\nSample preparation for the 15N NMR experiment.\nGently thaw a 250 μL aliquot of purified 0.8 mM 15N-enriched 3CLpro on ice.\nAdd 25 μL deuterium oxide (CortecNet or Cambridge Isotopes) to the protein solution.\ntransfer the clear, transparent sample to the Shigemi 5 mm symmetrical NMR microtube (SHIGEMI, INC).\nData recording and analysis.\nRecord 1H,15N BEST-TROSY spectra of the protein at 298 K on a Bruker 700 MHz NMR spectrometer using 256 increments, 24 scans, and 1.2 s relaxation delay.\nSweep widths of 13 ppm and 40 ppm and offsets of 4.7 ppm and 118 ppm are used for the 1H and 15N dimension, respectively. The total acquisition time for each experiment is 135 min.\nProcess the spectra using the NMRPipe software.10[href=https://www.wicell.org#bib10]\nAnalyze the obtained spectra (Figure 8[href=https://www.wicell.org#fig8]) using the POKY11[href=https://www.wicell.org#bib11] or NMRFAM SPARKY.12[href=https://www.wicell.org#bib12]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2712-Fig8.jpg\nFigure 8. 2D 1H,15N BEST-TROSY NMR spectrum of SARS-CoV-2 3CLpro at 298 K\n(A) Wild type and (B) [Cys145Ala]- SARS-CoV-2 3CLpro mutant. No significant sample degradation was observed over a 1-week period at room temperature.\nAlternatives: Alternative NMR software for processing include Bruker TopSpin 4.2.0, and earlier releases, the CcpNmr software suite, or software available in NMRBox software collection.21[href=https://www.wicell.org#bib21],22[href=https://www.wicell.org#bib22] An extensive review of NMR data processing is presented in Stern and Hoch (1996).23[href=https://www.wicell.org#bib23]\nSequence-specific resonance assignments for SARS-CoV-2 3CLpro are available in the BMRB entry 5078024[href=https://www.wicell.org#bib24] and can be used to validate the spectrum and to label the observed peaks following the nearest neighbor criterium.",
    "Crystallization and structural determination of SARS-CoV-2 3CLpro\nTiming: Approximately 2 weeks\nNote: SARS-CoV-2 3CLpro can be crystallized at 3–8 mg mL−1 through vapor diffusion technique (hanging drop method) using a 20–60 mM ammonium acetate buffer at pH 7.0 and 20–30 % PEG4000 as a precipitant. This protocol reports a representative crystallization procedure using a 5 mg mL−1 sample.\nCrystallization of SARS-CoV-2 3CLpro.\nPrepare the crystallization cocktail by filling each well (0.5 mL) of the EasyXtal 15-well crystallization plate (Quiagen) with the correct volumes of 1 M ammonium acetate at pH 7.0 (AMA 1 M), 50 % PEG4000 (PEG 50 %), and MilliQ water according to the scheme in Table 1[href=https://www.wicell.org#tbl1], as shown in Figure 9[href=https://www.wicell.org#fig9]A.\ntable:files/protocols_protocol_2712_6.csv\ntable:files/protocols_protocol_2712_7.csv\naHighest resolution bin in parentheses;\nb   R  s y m   =  ∑  h k l    ∑ j   |   I j  −  ⟨ I ⟩   |  /  ∑  h k l    ∑ j   I j    , where I is the intensity of a reflection, and   ⟨ I ⟩   is the mean intensity of all symmetry related reflections j;\nc   R  p . i . m .   =  ∑  h k l    {    [  1 /  (  N − 1  )   ]   1 / 2    ∑ j   |   I j  −  ⟨ I ⟩   |   }  /  ∑  h k l    ∑ j   I j   , where I is the intensity of a reflection, and   ⟨ I ⟩   is the mean intensity of all symmetry related reflections j, and N is the multiplicity28272827282828282726252626272727272727272625242322222118;\ndTaken from REFMAC; Rfree is calculated using 5% of the total reflections that were randomly selected and excluded from refinement;",
    "e  D P I =  R  f a c t o r   ·  D max  ·   c o m p l   −  1 3       N  a t o m s    (   N  r e f l   −  N  p a r a m s    )     , where Natoms is the number of the atoms included in the refinement, Nrefl is the number of the reflections included in the refinement, Dmax is the maximum resolution of reflections included in the refinement, compl is the completeness of the observed data, and for isotropic refinement, Nparams ≈ 4Natoms\ntable:files/protocols_protocol_2712_8.csv\nProtein was spectrophotometrically quantified assuming MW = 33,796 Da and ε280 = 32,890 A.U. M−1 cm−1\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2712-Fig9.jpg\nFigure 9. Experimental set up for the crystallization of SARS-CoV-2 3CLpro by hanging drop and crystal recovery and storage\n(A and B) (A) Preparation of the crystallization plate, and (B) crystallization drops deposition.\n(C and D) (C) 3CLpro typically grows as bundles of sword-shaped crystals which (D) are fished using cryo-loops, flash-cooled in liquid nitrogen for storage, and shipped to the synchrotron facility for data collection.\nNote: Due to different viscosities of the three solutions added, it is recommended to mix the content of each well using a micropipette.\nGently thaw 50 μL of purified 5 mg mL−1 3CLpro on ice.\nPlace a screw-in crystallization support upside down and pipette 2 μL of 3CLpro solution at its center.\nRecover 2 μL of the precipitation cocktail present in well A1 and pipette it onto the already deposited protein solution.\nReverse the crystallization support in the original position and screw it onto the corresponding A1 well (Figure 9[href=https://www.wicell.org#fig9]B).\nRepeat point c for all the wells present in the crystallization plate.",
    "Store the crystallization plate at 20 °C in a PKS-E100 Protein Crystallization Cabinet (RUMED) to avoid temperature oscillations as well as vibrations during crystallization.\nMonitor the evolution of each crystallization drop under a light microscope after regular time intervals (1 day, 2 days, 4 days, 1 week and then every week), noting any phase transition occurring (precipitation, liquid-liquid separation, crystal formation, or clear drop).\nAlternatives: The same experimental setup used to crystallize native 3CLpro can be also successfully followed, after minor changes, to crystallize the protein in the presence of potential inhibitors by using either co-crystallization or crystal soaking. In the first case, appropriate amounts of test molecule should be added in the crystallization cocktail (point 16a) prior to drop deposition, in order to obtain a co-crystallization drop containing both the protein and the molecule. To perform the crystal soaking, procedure described at point 17c (see below), the protocol should be modified by exposing a crystal of native 3CLpro in a cryo-protectant droplet that also contains the appropriate amount of ligand. During soaking the ligand may diffuse into the preformed crystal through solvent channels and bind to the protein. Exposure time of the protein to the ligand needs to be optimized to achieve complete binding (usually from a few minutes to 12–16 h).\nCrystal storage and shipping.\nFill a SPINE Sample Changer Basket (Molecular Dimensions) with ten magnetic Cryo-Vials (Molecular Dimensions) and place it in a foam Dewar topped up with liquid nitrogen.\nSelect the desired 3CLpro crystal candidate(s) (Figure 9[href=https://www.wicell.org#fig9]C) to be shipped to the synchrotron facility among those grown in one or more wells by carefully observing the crystallization drops under the light microscope.",
    "Open the screw-in crystallization support, fish the crystal from the crystallization drop using a cryo-loop (Molecular Dimensions) of the correct size mounted on a magnetic Cryo wand (Molecular Dimensions) (Figure 9[href=https://www.wicell.org#fig9]D), and expose it in a new cryo-protectant drop composed of a slightly higher concentration of the crystallization cocktail.\nFish the crystal from the new drop and quickly flash freeze it by depositing the cryo-loop in the magnetic cryo-vial stored in the basket immerged in liquid nitrogen.\nRepeat the same procedure for each crystal to be shipped, load the filled baskets in a dry shipper properly equilibrated with liquid nitrogen and ship the material to the synchrotron.\nCritical: The liquid contained in the drops tends to evaporate quickly. This phenomenon also causes the disruption of the crystal order, which in turn negatively affects data quality. Crystal fishing and flash-cooling procedures must be therefore carried out as quickly as possible. If additional time is needed between two consecutive crystal fishing steps, place the drop support back onto the corresponding well to minimize drop drying.\nCrystallography data collection, processing, and structural determination.\nNote: Diffraction data used for the structural determination of the X-ray crystal structure of native SARS-CoV-2 3CLpro were collected on one crystal at 100 K using synchrotron X-ray radiation at the EMBL P13 beamline of the Petra III storage ring, c/o DESY, Hamburg (Germany).25[href=https://www.wicell.org#bib25]\nRecord diffraction data using the collection strategy suggested by the MXCuBE software.13[href=https://www.wicell.org#bib13],14[href=https://www.wicell.org#bib14]\nProcess X-ray diffraction images by using XDS.15[href=https://www.wicell.org#bib15]\nScale and reduce processed data by using AIMLESS,17[href=https://www.wicell.org#bib17] included in the suite CCP4.16[href=https://www.wicell.org#bib16]",
    "Carry out structural refinement and model building using the REFMAC5 software18[href=https://www.wicell.org#bib18] and COOT,26[href=https://www.wicell.org#bib26] respectively, both included in the suite CCP4.16[href=https://www.wicell.org#bib16] Use the structure factor amplitudes obtained by AIMLESS as experimental data and the PDB entry 7ALH as a starting model until refinement convergence. A representative picture of the final X-ray crystal structure of 3CLpro obtained in this work (and deposited in the Protein Data Bank under PDB code 8CDC) is shown in Figure 10[href=https://www.wicell.org#fig10]. Data collection, processing and refinement statistics are reported in Table 2[href=https://www.wicell.org#tbl2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2712-Fig10.jpg\nFigure 10. Active site region the X-ray crystal structure of SARS-CoV-2 3CLpro\nThe atomic model is shown superimposed on the final 2Fo - Fc electron density map contoured at 1σ and colored gray. The carbon, nitrogen, oxygen, and sulfur atoms are gray, blue, red, and yellow, respectively. The figure is generated using PyMol (The PyMOL Molecular Graphics System, v. 1.8 Schrödinger, LLC.).\nAlternatives: Other data collection facilities may be used. Other software can be used for analyzing the crystallographic data, such as PHENIX.27[href=https://www.wicell.org#bib27]\nNote: Crystals grown in experimental conditions described belong to space group C121, as does the starting model selected for the refinement (PDB code 7ALH). If the space groups of experimental data and the starting model do not match, a molecular replacement procedure must be carried out to obtain initial crystallographic phases to be used in the following refinement and model building steps.\nSample quality control\nIn addition to crystallography and NMR data, if available, sample quality control includes SDS-PAGE, MALDI-TOF mass spectrometry, and specific enzyme activity measurements. The expected specific activity is 55 Units / μmole of enzyme, where a Unit is 1.0 μmol substrate cleaved / min, assayed using the FRET buffer conditions, as described in “materials and equipment[href=https://www.wicell.org#materials-and-equipment]” section, using 0.4 μM 3CLpro, 200 μM DABCYL-KTSAVLQ/SGFRKME-EDANS substrate at 25°C."
  ],
  "subjectAreas": [
    "Protein Biochemistry",
    "Microbiology",
    "Structural Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}