{
  "id": 13616,
  "origin_website": "Jove",
  "title": "Analysis of Coronary Vessels in Cleared Embryonic Hearts",
  "procedures": [
    "All animal research was carried out in accordance with institutional guidelines under license from the UK Home Office.\n1. Dissection and Fixation of Embryonic Hearts\nEuthanize a timed-pregnant mouse on the required day using an ethically approved culling technique, e.g., CO2 narcosis followed by cervical dislocation, and remove the embryonic sacs14, placing them in a 10 cm Petri dish filled with phosphate buffered saline (PBS).\nUsing a dissecting microscope and forceps, carefully open up the uterine sacs and remove each embryo, severing the umbilical cord and removing the yolk sac.\nFor genotyping purposes, remove the embryonic tail and place in a 1.5 ml microcentrifuge tube for lysis/DNA extraction later.\nIn order to remove the heart, pin each embryo out on its back in a PBS-filled silicone elastomer-coated 35 mm Petri dish, using stainless steel minutien pins. Using fine forceps, carefully open the chest and sever the great vessels, anterior to the heart. Then reaching behind the heart with the forceps, grasp the vessels behind the heart and pull gently to remove the heart; the lungs may also come away at the same time.\nTransfer the heart to a fresh 35 mm Petri dish containing PBS and use fine forceps to trim away the lung tissue, if necessary. Then transfer the heart to a well of a 48-well plate filled with cold PBS.\nAfter collecting all the hearts in the 48-well plate, aspirate the PBS with a fine-tipped plastic Pasteur pipette and replace with 0.5 ml 4% paraformaldehyde (PFA).\nCAUTION: PFA is a known to be allergenic, carcinogenic, and toxic.\n\t\nFix E11.5 - 12.5 hearts for 15 min, E13.5 hearts for 20 min and E14.5 - 15.5 hearts for 30 min, in 4% PFA at room temperature.",
    "Aspirate the PFA with a fine-tipped plastic Pasteur pipette and rinse the hearts 2x in cold PBS.\nCAUTION: PFA is hazardous and must be disposed of in accordance with institutional regulations.\nIf not using immediately for whole mount immunostaining (see section 2), dehydrate the hearts by carrying out successive 5 min washes in the following solutions: 25% methanol/75% PBS, 50% methanol/50% PBS, 75% methanol/25% PBS.\nCAUTION: Methanol is toxic, wear gloves. Store the hearts at -20 °C in 100% methanol.\n2. Whole Mount Immunostaining of Embryonic Hearts with Anti-PECAM1 Antibody\nNOTE: Anti-PECAM1 antibodies work well for staining the coronary vessels (see step 2.4) but any pan-endothelial marker that gives a robust signal would be suitable.\nIf using hearts that have been stored in 100% methanol, transfer to 1.5 ml microcentrifuge tubes and rehydrate by carrying out successive 5 min washes in the following solutions: 75% methanol/25% PBS, 50% methanol/50% PBS and 25% methanol/75% PBS.\nPermeabilize the hearts by carrying out 3 x 10 min washes in 0.5 - 1.0 ml PBST (PBS/0.1% Tween-20), rotating at room temperature.\nBlock the hearts by rotating for 1 hr at room temperature in 1.0 ml 10% goat serum in PBST.\nRemove blocking buffer with a fine-tipped plastic Pasteur pipette or 1,000 μl pipette tip and replace with 400 - 500 μl fresh block containing the anti-PECAM1 primary antibody diluted 1:50. Rotate the tubes overnight at 4 °C.\nThe next day, aspirate the block/primary antibody with a fine-tipped plastic Pasteur pipette or 1,000 μl pipette tip and carry out at least 6x 1 hr washes in 1.0 ml PBST, rotating the tubes at room temperature.",
    "Replace the last wash with fresh blocking buffer containing the fluorophore-conjugated secondary antibody diluted 1:500, and incubate overnight at 4 °C, with rotation. Protect from light by wrapping the tubes in foil.\nThe following day, aspirate the block/secondary antibody with a fine-tipped plastic Pasteur pipette and carry out at least 6x 1 hr washes in 1.0 ml PBST, rotating the tubes at room temperature.\nStore the hearts at 4 °C (protected from light) until needed.\n3. Preparation of Clearing Solutions and Microscopy Dishes\nNOTE: When imaging hearts in BABB it is vital that none of the BABB solution comes into contact with the components of the microscope. For this purpose the following protocol contains instructions for preparing silicone elastomer-sealed dishes suitable for fluorescence microscopy, which can be prepared well in advance. The silicone elastomer provides a barrier to contain the BABB and prevent it from potentially seeping between the glass bottom and the polycarbonate sides of the dish.\nTo prepare the silicone elastomer-coated dishes, take optical glass-bottomed culture dishes and place a cap from a 4 ml screw top vial (approximately 1.5 cm in diameter) in the center of each dish.\n\tNOTE: This will form a well for the sample when the elastomer is applied to the dish.\nFill the dishes with silicone elastomer to a depth of approximately 0.5 cm, using an applicator cartridge to mix the two components as they are applied, according to the manufacturers' instructions. Leave to cure for at least 24 hr, making sure that the vial cap remains in the center of each dish.\n\tNOTE: Use safety glasses to avoid accidental contact of the silicone elastomer with eyes.",
    "After curing the elastomer, remove the vial cap from each dish, This will leave a central well where the sample to be imaged can be placed in direct contact with the glass bottom of the dish.\n\tNOTE: when cured the elastomer should be firm and dry to the touch.\nPrepare the BABB solution (1 part benzyl alcohol to 2 parts benzyl benzoate). This should be stored in a glass bottle and protected from light.\nCAUTION: BABB is a toxic, corrosive solution. Handle in a fume cupboard whilst wearing appropriate protective clothing.\nMix BABB and methanol to make a 50:50 solution (1 - 5 ml) in a glass vial. Protect from light, e.g., by wrapping the vial in foil.\n4. Dehydration, Clearing and Mounting of Hearts for Confocal Microscopy\nNOTE: Larger samples can be cleared in 4 ml glass vials, however for small samples (e.g., hearts up to E13.5) it is better to carry out the clearing process directly in the microscopy dish. This helps prevent 'losing' the samples as the hearts become very transparent once cleared. For these small samples clearing is very rapid, occurring within a few minutes.\nNOTE: Protect the samples from light during all the following steps by wrapping/covering tubes and dishes with foil.\nBefore clearing, dehydrate the immunostained-hearts through a methanol series by rotating the hearts at room temperature in a 1.5 ml microcentrifuge tube in successive changes of the following solutions: 25% methanol/75% PBS, 50% methanol/50% PBS and 75% methanol/25% PBS (5 min in each). Finally, rotate for 3 x 5 min in 100% methanol.\nFor hearts up to E13.5, place in the center of the microscopy dish; under the microscope ensure the heart is orientated with its dorsal side uppermost. Remove any methanol from around the heart with a fine-tipped plastic Pasteur pipette.",
    "Using a clean fine-tipped plastic Pasteur pipette, add BABB:methanol 50:50 solution in a sufficient volume to immerse the heart (approximately 300 - 400 μl). As the hearts can sometimes flip over in the solution, check the orientation again whilst the hearts are still opaque. Leave in the solution for 5 min.\nRemove the 50:50 solution to a glass waste bottle in the fume hood and replace with BABB, again using a fine-tipped plastic Pasteur pipette.\n\tNOTE: A large volume is not required; add sufficient so that the heart sits within a drop of solution. The heart should clear within 5 min.\nFor larger hearts, clear the samples in glass vials.\n\tNOTE: An E15.5 heart should clear within 30 min-1 hr but can be left overnight if necessary.\nAfter the sample is clear, remove the solution and replace with a minimal volume of BABB. Optionally, cover the sample with a cover slip, to help to keep it in place, however this is not absolutely necessary. Use the heart for imaging.\n5. Imaging Cleared Hearts by Confocal Microscopy\nNOTE: Images were captured on an inverted confocal microscope using 10X or 20X dry objectives. Although it is possible to use the dishes on an upright confocal, extra care must be taken to avoid contact of the objective with the BABB solution.\nCollect a z-scan of the heart15. Depending on the size of the heart, a tile scan may be required to image the whole heart16.\nCAUTION: BABB is a corrosive solution, wear clean gloves and ensure the outside of the microscopy dish is free from BABB. Handle the dish carefully and keep the lid on the dish to minimize the risk of accidental spillage onto the microscope.",
    "If the objective working distance allows, use a higher magnification to attain higher-resolution pictures of regions of interest.\n6. Data Analysis Using Fiji Software\nOpen the z stack of images in Fiji17.\nTo make a z projection of the whole stack or part of it, click on Image and select Stack, followed by Z project. Enter the Start and Stop slice numbers, and select the type of z projection, e.g., average intensity, max intensity.\nTo highlight individual vessels within a stack of image slices use the Blow tool (from the Plugins menu select Segmentation, and then Blow/Lasso tool) and click on the areas of the image to be filled in each slice. Use the Fill command (click on Edit, then select Fill) to fill the selected areas with the foreground color of choice (click on Edit, then select Options, followed by Colors and Foreground).\nZ project the image stack as before.\n7. 3D Surface Volume Rendering of Coronary Arteries Generated Using Imaris\nClick on the Surpass view icon at the top of the screen and drag and drop the image file into the data window. Click on the 3D View icon at the top of the screen.\nSelect the surfaces icon (blue icon) and then click on the Create tab. Click on the 'Skip automatic creation, edit manually' dialog box and click on the Draw icon (thin pencil icon).\nSelect the Contour tab, and then the Mode tab. In Mode, click on the magic wand or isoline icons. Choose the pointer mode in the Pointer selection on the right hand side of the screen by clicking next to 'Select', and then click on the 'Draw' box (in the bottom left hand corner of the screen).",
    "Use the isoline or magic wand tool to select the contours of the arteries in successive slices. Navigate from slice to slice using the Slice Position slider.\nWhen all the contours have been selected, click on the Create Surface box. The surrounding volume can be made invisible, or rendered more or less opaque using the Blend mode; click on Volume to highlight it and then select the Settings tab, followed by the Mode tab. Select Blend and use the slider to change the opacity.\nCapture images using the Snapshot function."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}