{
  "id": 3436,
  "origin_website": "Cell",
  "title": "Proteomics protocol for obtaining extracellular vesicle from human plasma using asymmetrical flow field-flow fractionation technology",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPlasma sample preparation for EVs isolation\nTiming: 3 h\nThis section describes the pretreatment steps before plasma EVs separation using the AF4 method. These steps could reduce the stickiness of plasma and remove cells or large debris in advance.\nTake the plasma from −80°C and thaw it at 4°C.\nDilute 200 μL of the plasma with PBS at a 1:1 v/v ratio.\nCentrifuge the sample at 300 × g for 10 min at 4°C to remove intact cells.\nCarefully transfer the supernatant into a new 1.5 mL tube.\nCentrifuge the supernatant at 4200 × g for 20 min at 4°C to remove large cell debris, apoptosis body, and platelet.\nCarefully transfer the supernatant into a new 1.5 mL tube for the following enrichment of EVs.\nCritical: There may be white flocs on the tube wall after centrifugation, try not to touch it when collecting the supernatant.\nPause point: The supernatant can be stored at −80°C for several weeks.\nNote: It is recommended to freeze and thaw the supernatant only once.\nIsolation of plasma EVs using AF4 method\nTiming: 4–5 days\nTiming: ∼1 day for steps 7–15\nTiming: ∼4 days for step 16\nTiming: ∼2 h for step 17\nEVs are separated using AF4 according to the size differences. The real-time signals recorded in ASTRA are the instructions for effluent collection. The protein concentration of EVs fraction is determined by BCA assay and the enriched EVs are also characterized by Western blot and transmission electron microscopy (TEM).\nOpen the monitoring software, ASTRA (version 5.3.4).\nRight-click on the “Experiments” and create a new template for the observation of signals.\nSet a duration time and check “LS 11”, “UV”, “dRI” on the right.\nClick the blue triangle on the control menu to start the sample injection.",
    "Suck up 300 μL of the prepared sample solution using a needle and insert the needle into the injector.\nRotate the injector to \"Load\", then inject the sample solution and rotate the injector to \"Inject\".\nCollect the peak 4 effluent according to the signal showing on the collection panel including UV 280, LS 11, dRI, see Figure 3[href=https://www.wicell.org#fig3].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3013-Fig3.jpg\nFigure 3. Signal recording during the sample separation\nBlue: dRI. Red: MALS. Green: UV280.\nCritical: When observing the budding of the EVs peak, collect the EVs effluent after 5 s, which will reduce the contamination of lipoproteins.\nNote: The system needs to be washed for about 20 min before loading the next sample.\nConcentrate the collected effluent to about 150 μL using a 3 kDa MWCO membrane filter at 3000 × g for 3 h at 4°C.\nOptional: Alternatively, concentrate with a 10 kDa MWCO membrane filter for about 30 min.\nPause point: The concentrated effluent can be stored at −80°C for several months.\nQuantify the protein concentration using a Pierce BCA Protein Assay Kit following the manufacturer’s instruction, please visit https://www.thermofisher.cn/document-connect/document-connect.html?url=https://assets.thermofisher.cn/TFS-Assets%2FLSG%2Fmanuals%2FMAN0011430_Pierce_BCA_Protein_Asy_UG.pdf[href=https://www.thermofisher.cn/document-connect/document-connect.html?url=https://assets.thermofisher.cn/TFS-Assets%2FLSG%2Fmanuals%2FMAN0011430_Pierce_BCA_Protein_Asy_UG.pdf].\nDilute the EVs sample twice with 10% SDS solution, then heat it at 95°C for 10 min.\nPrepare appropriate amount of the BCA working reagent by mixing 50 parts of Reagent A with 1 part of Reagent B (A:B = 50:1, v/v). Calculate the volume required for Reagent A and Reagent B according to the following formula:\nV\no\nl\nu\nm\ne\no\nf\nR\ne\na\ng\ne\nn\nt\nA\n:\n(\nn\no\nf\ns\na\nm\np\nl\ne\ns\n×\n3\n+\n8\no\nf\nP\nr\no\nt\ne\ni\nn\nS\nt\na\nn\nd\na\nr\nd\ns\n×\n3\n+\nm\n)\n×\n200\nμ\nL\nR\ne\na",
    "g\ne\nn\nt\nA\nV\no\nl\nu\nm\ne\no\nf\nR\ne\na\ng\ne\nn\nt\nB\n:\n(\nn\no\nf\ns\na\nm\np\nl\ne\ns\n×\n3\n+\n8\no\nf\nP\nr\no\nt\ne\ni\nn\nS\nt\na\nn\nd\na\nr\nd\ns\n×\n3\n+\nm\n)\n×\n4\nμ\nL\nR\ne\na\ng\ne\nn\nt\nB\nNote: Three technical replicates are usually performed for each sample and standard. In addition, more working reagents are prepared in case of shortage. m is the number of extra samples, and 3–5 are recommended. The R2 value of the standard curve is required to be larger than 0.99.\nAdd 200 μL of the working reagent to each well of the 96-well plate.\nPipette 4 μL of water, 7 different concentrations of bovine serum albumin (BSA) standard solution, and EVs samples with triplicates into the 96-well plate successively.\nNote: BSA concentrations of 0 μg/μL, 0.125 μg/μL, 0.25 μg/μL, 0.5 μg/μL, 0.75 μg/μL, 1.0 μg/μL, 1.5 μg/μL, and 2.0 μg/μL are used to make the standard curve.\nCritical: It is recommended to carefully pipet the sample up and down gently for several times to mix well.\nOptional: Instead of diluting the BSA standard (2 mg/mL) into seven concentrations according to the manufacturer protocol, one can use the protein standards available as a prediluted series of seven concentrations, such as Bio-Rad Cat#5000207.\nIncubate the plate at 37°C for 30 min. After this, measure the absorbance values of samples at 562 nm.\nNote: After incubation, there may be air bubbles in sample wells. Use the tip of 10 μL pipette to pierce the air bubbles to prevent interference with quantification.\nCalculate the protein concentration of each sample according to the standard curve.",
    "Western blot analysis of enriched EVs, see Figure 4[href=https://www.wicell.org#fig4]A.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3013-Fig4.jpg\nFigure 4. Characterization of separated EVs from human plasma using AF4 method\n(A) Western blot analysis of EVs and whole plasma (each n=2) with a 10 μg protein loading volume.\n(B) Transmission electron microscopy micrographs of EVs. Scaled bars: 100 nm, left; 200 nm, right. (A) and (B) are adapted with permission from Figure S1 (B) and Figure 1 (B) of Li et al.2[href=https://www.wicell.org#bib2] respectively.\nSeparate 15 μg of proteins on SDS-PAGE gel at a constant voltage of 200 V.\nNote: Choose gel concentration according to the size of the target protein. Use 10% gel for proteins larger than 60 kDa and 12% gel for proteins less than 60 kDa.\nObtain the target protein stripe by cutting the gel. Try to keep the target protein in the center of the stripe.\nImmerse the PVDF membrane in 100% methanol for 30 s to activate it.\nTransfer the protein to the PVDF membrane at a constant current of 200 mA.\nNote: For apolipoprotein B-100 (APOB, 516 kDa), add 1% SDS to the transfer buffer and apply a constant current of 40 mA for 12–18 h transfer.\nWash the PVDF membrane using 1 × TBST for 5 min then block the membrane with 5% milk for at least 2 h.\nIncubate the membrane with primary antibody (diluted with 5% milk in the ratio of 1:1000).\nWash the membrane using 1 × TBST for 10 min for 3 times.\nIncubate the membrane with secondary antibody (diluted with 5% milk in the ratio of 1:10000)\nWash the membrane using 1 × TBST for 10 min for 3 times.\nMix the developer solution A and B in a ratio of 1:1, then drip the mixed solution to the membrane and develop the membrane.",
    "Prepare the EV sample for TEM analysis.\nPut the carbon-coated copper grids into the glow instrument.\nVacuumize the instrument for 4 min.\nCharge the carbon-coated copper grids with glow for 30 s.\n5 μL of the EV sample is placed onto the coated side of the grid and allowed to adsorb for 1 min. Absorb away the drop using filter paper.\nWash the copper grid with the negative staining solution (2% uranyl acetate) and absorb away the drop using filter paper.\nAdd 5 μL of negative staining solution to the sample side of the grid and incubate for 1 min to stain the background around the EVs.\nAir dry the grid and TEM imaging, see Figure 4[href=https://www.wicell.org#fig4]B.\nSample preparation for proteomic analysis\nTiming: 2 days\nIn this section, proteins are digested into tryptic peptides prior to the mass spectrometry (MS) analysis.\nSolubilize a total of 50 μg protein in a final concentration of 8 M urea/50 mM NH4HCO3, and reduce it with a final concentration of 20 mM DTT for 1 h at 37°C.\nFor alkylation, add a final concentration of 40 mM IAM to the sample, and incubate the mixture in the dark for 45 min at 20°C–25°C.\nAdd Lys C at an enzyme/protein ratio of 1:50 (w/w) for 3 h at 37°C.\nDilute the sample with 25 mM NH4HCO3 to a final concentration of <1.5 M urea.\nAdd trypsin at an enzyme/protein ratio of 1:50 (w/w). Incubate the sample in a ThermoMixer F1.5 for heating and mixing at 37°C for 12–18 h.\nUse a final concentration of 0.1% formic acid (FA) to stop the protein digestion.\nDesalt the sample with an Oasis HLB 1 cc Vac cartridge using a vacuum manifold. The detailed procedure is as follows:\nWash, 1 mL methanol and 1 mL 75% acetonitrile (ACN)/0.1% FA.",
    "Equilibrium, 1 mL 0.1% FA for twice.\nLoading the sample solution for 3–4 times.\nWash, 1 mL 0.1% FA for twice.\nElution, 400 μL of 20% ACN/0.1% FA, 40% ACN/0.1% FA, and 60% ACN/0.1% FA successively.\nDry the sample in a centrifugal vacuum concentrator (Labconco, USA).\nPause point: The peptides can be stored at −20°C for several weeks, or at −80°C for several months.\nTandem mass tags (TMT)-based quantitative proteomics\nTiming: 4–6 days\nTiming: ∼1–2 days for steps 26–32\nTiming: ∼1–2 days for steps 33–39\nTiming: ∼2 days for steps 40–43\nThis section includes TMT labeling, detection of labeling efficiency, adjustment of sample mixing ratio, and high pH reversed-phase HPLC fractionation.\nRedissolve the desalted peptides in 50 μL of 100 mM HEPES (pH 8.5).\nOptional: Measure the peptide concentration using Nanodrop or Pierce quantitative colorimetric peptide assay.\nEquilibrate the TMT6-plex label reagents to 20°C–25°C for about 30 min.\nOptional: Alternatively, other plex isobaric mass tags are also available.3[href=https://www.wicell.org#bib3] For example, 16-plex TMT reagents4[href=https://www.wicell.org#bib4] are available commercially, and even 29-plex can be achieved by combinatorial use of labelling channels.5[href=https://www.wicell.org#bib5]\nLabel the 50 μL peptides with a TMT6-plex kit according to the manufacturer’s protocol, please visit https://www.thermofisher.cn/document-connect/document-connect.html?url=https://assets.thermofisher.cn/TFS-Assets%2FLSG%2Fmanuals%2FMAN0011639_TMT_Mass_Tagging_Reag_UG.pdf[href=https://www.thermofisher.cn/document-connect/document-connect.html?url=https://assets.thermofisher.cn/TFS-Assets%2FLSG%2Fmanuals%2FMAN0011639_TMT_Mass_Tagging_Reag_UG.pdf].\nNote: TMT labeling at a final concentration of 25%–30% ACN is recommended.\nPause point: The TMT-labeled peptides can be stored at −20°C for several days, or at −80°C for several weeks.\nCalculate the labeling efficiency.\nMix 2 μL of each labeled sample. After drying, redissolve the sample in 10 μL of 0.1% FA.\nDesalt the sample using μC18 ZipTip, then dry again and redissolve the sample with 15 μL of 0.1% FA.\nCentrifuge the sample at 20,000 × g for about 30 min, and transfer the supernatant into a new autosampler vial.",
    "Load sample into an EASY-nLC 1000 HPLC system coupled to Nanospray Flex Ion Source and Q Exactive Mass Spectrometer.\nElute peptides in an in-house packed C18 trap column (100 μm × 2 cm, Reprosil-Pur C18 AQ, 5 μm, Dr. Maisch GmbH, Germany), and then separate peptides on an in-house packed C18 capillary column (75 μm × 20 cm, Reprosil-Pur C18 AQ, 3 μm, Dr. Maisch GmbH, Germany) using mobile phase A (0.1% FA) and B (ACN/0.1% FA) at a flow rate of 310 nL/min with the following 78-min gradient:\n4%–10% solvent B for 5 min.\n10%–22% solvent B for 50 min.\n22%–32% solvent B for 15 min.\n32%–90% solvent B for 1 min.\n90% solvent B for 7 min.\nOperate Q Exactive in data-dependent MS/MS mode using 20 most intense precursors detected in survey scan from 300 to 1600 m/z performed at 70,000 resolution. Also include as settings:\nSelect precursor ions with an isolation width of 2 m/z and the dynamic exclusion time of 50 s for fragmentation with normalized collision energy of 27%.\nAcquire MS/MS spectra at a resolution of 17,500 at m/z 200 and set the target value as 5e4 with a maximum injection time of 80 ms.\nProcess the obtained raw data in Proteome Discoverer 2.2 using a regular workflow.\nSearch the raw data against the Uniprot human protein database together with a common contaminant list (download from http://www.coxdocs.org/doku.php?id=maxquant:start_downloads.htm[href=http://www.coxdocs.org/doku.php?id=maxquant:start_downloads.htm]) using the Sequest HT search engine for protein identification. Set other parameters as follows.\nSelect trypsin as the enzyme and allow two miss cleavage.\nSet the mass tolerance of precursor and product ions to 10 ppm and 0.02 Da, respectively.\nSpecify carbamidomethylation on cysteine as fixed modifications; specify TMT-labeling (lysine and peptide N-terminus), methionine oxidation, and acetylation of the N-terminus as variable modifications.",
    "Set the false discovery rate (FDR) to 1% for both protein and peptide identifications.\nRemove contaminant proteins before downstream analysis.\nNote: In this step, the TMT labeling of lysine and peptide N-terminus should be designated as dynamic modifications, not fixed modifications.\nOptional: Alternatively, MS raw files could also be processed in other pipelines and platforms,6[href=https://www.wicell.org#bib6],7[href=https://www.wicell.org#bib7],8[href=https://www.wicell.org#bib8] such as MaxQuant,9[href=https://www.wicell.org#bib9] which is freely available for download.\nCalculate the labeling efficiency of TMT on peptides.\nL\na\nb\ne\nl\ni\nn\ng\ne\nf\nf\ni\nc\ni\ne\nn\nc\ny\n=\n(\nn\nu\nm\nb\ne\nr\no\nf\nT\nM\nT\n−\nl\na\nb\ne\nl\ne\nd\np\ne\np\nt\ni\nd\ne\ns\n)\n/\n(\nn\nu\nm\nb\ne\nr\no\nf\nt\no\nt\na\nl\np\ne\np\nt\ni\nd\ne\ns\n)\n×\n100\n%\nCritical: The labeling efficiency should be higher than 95%.\nCalculate the total signal intensity at peptide or peptide spectral matches (PSMs) levels. Then, adjust the mixing ratio of each sample making the total signal intensity of each sample equally.\nCombine the labeled samples according to the adjusted mixing ratio of each sample.\nDry the mixture in a centrifugal vacuum concentrator.\nRedissolve the mixture with 200 μL of 0.1% FA.\nDesalt the mixture using an Oasis HLB 1 cc Vac cartridge.\nDry the elution in a centrifugal vacuum concentrator.\nPause point: The dried elution can be stored at −20°C for several days.\nRedissolve the dried elution with 100 μL of buffer A (2% ACN/0.1% NH4OH).\nCentrifuge the sample at 20,000 × g for 20 min, then transfer the supernatant into a new tube.",
    "Fractionate the sample into 10 fractions using high pH reversed-phase HPLC on a RIGOL L-3000 series HPLC system (RIGOL, China). Inject the sample onto a C18 column (130 Å, 5 μm, 4.6 × 250 mm, Waters, USA) and elute it using buffers A and B (98% ACN/0.1% NH4OH) at a constant flow rate of 0.7 mL/min with a 76 min gradient as follows:\n5%–8% solvent B for 5 min.\n8%–18% solvent B for 35 min.\n18%–32% solvent B for 22 min.\n32%–95% solvent B for 2 min.\n95% solvent B for 4 min.\nNote: All fractions are collected at 90 s intervals and concatenated into 10 post-fractions.\nOptional: Alternatively, other fractionation methods, such as strong cation exchange10[href=https://www.wicell.org#bib10] and off-gel electrophoresis fractionation,11[href=https://www.wicell.org#bib11] and Dionex UltiMate 3000 HPLC system (Thermo Fisher Scientific, USA) are also available.\nDry all fractions in a centrifugal vacuum concentrator.\nPause point: The dried fractions can be stored at −20°C for several days, or at −80°C for several weeks.\nRedissolve each sample with 50 μL of 0.1% FA.\nCentrifuge samples at 20,000 × g for 30 min, and transfer supernatants into new autosampler vials.\nAnalyze the fractionated peptide samples using LC-MS/MS, see detailed parameters in step 29d-f.\nOptional: Several approaches are available to alleviate the ratio compression problem of the isobaric labeling methods, such as synchronous precursor selection (SPS)12[href=https://www.wicell.org#bib12] and real-time search (RTS)13[href=https://www.wicell.org#bib13] acquisition methods.\nSearch the raw data using Proteome Discoverer 2.2. Designate the TMT labeling of lysine and peptide N-terminus as fixed modifications. For details about other parameters, see step 29g.\nNote: The scaled abundance of proteins is used for quantitative analysis.\nTargeted proteomics, parallel reaction monitoring (PRM)\nTiming: 7–9 days\nTiming: ∼1 day for steps 44–46\nTiming: ∼1–2 days for steps 47–51\nTiming: ∼5–6 days for step 52",
    "After identified from comparative proteomics, the differential proteins are verified using PRM. This section contains the generation of spectral library and assay panel. Spectra are acquired with an Orbitrap Eclipse Tribrid mass spectrometer coupled with an EASY-nLC 1200 HPLC system (Thermo Fisher Scientific). The criteria for selecting quantotypic target peptides and typical values of instrument parameters used in PRM experiments have been reported in detail by Rauniyar14[href=https://www.wicell.org#bib14] and Gallien et al.15[href=https://www.wicell.org#bib15]\nSelect proteins from differential proteins for the following monitoring.\nFor peptide quantitation, Pierce quantitative colorimetric peptide assay is used according to the manufacturer’s protocol, please visit https://www.thermofisher.cn/document-connect/document-connect.html?url=https://assets.thermofisher.cn/TFS-Assets%2FLSG%2Fmanuals%2F23275_quantpeptide_color_UG.pdf[href=https://www.thermofisher.cn/document-connect/document-connect.html?url=https://assets.thermofisher.cn/TFS-Assets%2FLSG%2Fmanuals%2F23275_quantpeptide_color_UG.pdf].\nTryptic peptides digested from 50 μg protein are redissolved with 100 μL 0.1% FA, of which 50 μL is transferred to a new tube and 50 μL 0.1% FA is added to dilute the peptide concentration.\nPrepare a dilution series of the peptide standard to generate a standard curve.\nPrepare appropriate amount of working reagent by mixing 50 parts of Reagent A with 48 part of Reagent B and 2 part of Reagent C (A:B:C = 50:48:2, volume ratio). After vortex and mixture, add 180 μL working reagent to each well of the 96-well plate.\nPipette 20 μL of water, 7 different concentrations of peptide standard, and peptide samples with triplicates into the 96-well plate successively.\nNote: Peptide concentrations of 0 μg/μL, 0.0156 μg/μL, 0.0313 μg/μL, 0.0625 μg/μL, 0.125 μg/μL, 0.25 μg/μL, 0.5 μg/μL, and 1.0 μg/μL are used to make the standard curve.\nIncubate the plate at 22°C for 30 min or 37°C for 15 min.\nMeasure the absorbance value at 480 nm using a Varioskan Flash spectral scanning multimode reader (Thermo Fisher Scientific, USA) and calculate the peptide concentration of each sample according to the standard curve.\nAcquire the MS data using data-dependent acquisition mode.",
    "Take 1 μg peptide of each sample and mix together, then 10 × iRT peptide is spiked into the mixed peptide sample.\n1 μg of mixture is used for data-dependent MS/MS analysis. Detailed parameters are exampled as follows:\nAcquire full MS scans at a resolution of 60,000 at m/z 200 across the mass range of 350–1500 m/z with an AGC of 4e5 and maximum injection time of 50 ms.\nAcquire MS/MS spectra at a resolution of 15,000 at m/z 200, an isolation window of 1.6, a collision energy of 30% and an AGC target value of 5e4 with a maximum injection time of 22 ms.\nSet up library generation from Pulsar search engine in the SpectroDive™ 10.4.\nFirst, click “Generate Library from Pulsar / Search Archives…”.\nClick “Add Runs from File…”, and upload the obtained DDA raw data.\nSelect a FASTA file by clicking “Fasta File…”, such as human Swiss-Prot FASTA database.\nClick ‘Next’ in the lower right corner. The emerged Pulsar search parameters are set as follows by clicking on the option “Search Settings…”:\nSelect the enzyme as trypsin/P.\nSet carbamidomethyl (C) to a fixed modification, and set acetyl (Protein N-term) and oxidation (M) to variable modifications.\nIon types include b, y.\nOther settings are default and follow the wizard.\nAfter the search finished, one spectral library will be generated.\nOptional: Spectral library can also be generated from results of external search engines, such as MaxQuant, Proteome Discoverer, ProteinPilot, Mascot. The search result need be imported into the SpectroDive from “Import Spectral Library…”.\nGenerate an assay panel based on the spectral library.\nChoose ‘Prepare’ and click ‘Generate New Panel…’.\nSelect the just established spectral library and click “Next”.\nPaste the differential protein annotations into the ‘Filter’ and click ‘Check All’.",
    "Next, precursors are filtered as follows: precursor m/z, 350–1500; precursor charge, 2–3; missed cleavages, 0; peptide length, 8–25; Only proteotypic; allowed modification, carbamidomethyl (C).\nClick “Check All” and “Next”.\nFilter the fragments of the selected precursors as follows: fragment m/z, 300–1800; max fragment charge, 2; Ion types, b and y; allowed loss types: noloss; min fragment length, 3; Top N fragments, 6.\nClick “Apply Settings” and follow the wizard of “Next”, then the panel is created.\nModify the established panel. Precursors from the differential proteins will be further filtered in this step.\nClick “Analysis” and “Set up Targeted Analysis from File…”.\nUpload the DDA data and assign the established panel from the left corner. Follow the wizard and finish this process.\nA tree view shows the details of the panel. Right-click on the precursor to be deleted and choose “Reject”.\nNote: The tree view can be organized by Protein or Panel. Right-click on the name of the experiment and move the mouse over “Group By…”, then one can choose how the data is presented.\nCritical: The MS2 XIC and more detailed information of transitions should be checked one by one. Precursors with Q value < 0.01 but poor signal intensity and peak shape should be discarded in the panel. At least two precursors per protein are recommended for quantitative analysis.\nChoose “Report” module and click “BGS Factory Report” under “Run Pivot Report” and make sure “EG.PrecursorId” is checked.\nClick “Export report” and save the result, then copy the column of “EG.PrecursorId”.\nGo back to the “Prepare”, and right-click on the established panel and click “Generate Modified Panel”.\nTo filter precursors, paste the precursor id into the “Filter” of “Peptide Sequences”.\nContinue to filter the fragments of the precursors as described above. Then follow the wizard to complete this process.",
    "Create the calibration run. Click “Import from Library…”, and choose the spectral library and the calibration run. Then click “Finish”.\nCritical: If the data collection time is too long from the DDA data collection time or if the LC column or the instrument state is changed, it is best to take an unscheduled PRM to calibrate the retention time. As such, the raw data from unscheduled PRM should be analyzed as a new RT calibration run and selected as the generated calibration run.\nBuild the PRM data acquisition method. Concurrent select the “PRM iRT-Kit” below “LC Calibration”, the modified panel below “Panels”, and the generated calibration run below “Choose RT Calibration Run”, then modify the specific parameters in “3) Export Method”. As such, the new method can be exported by clicking “Export Method”.\nCritical: For reliable quantification, 10–12 scans across the chromatographic peak are recommended.\nImport the target list in Xcalibur and analyze each sample using PRM.\nTake 1 μg of each sample for monitoring according to the exported precursor list.\nThe data acquisition parameters are exampled as follows: full MS scans are acquired at a resolution of 60,000 at m/z 200 with an AGC of 4e5 and maximum injection time of 20 ms; MS/MS spectra are acquired at a resolution of 30,000 at m/z 200, an isolation window of 1, a collision energy of 30% and an AGC target value of 2e5 with a maximum injection time of 80 ms.\nCritical: It is recommended to first collect a PRM data with this method, and then analyze whether there are precursors that deviate from the retention time and are not monitored. If so, change its retention time.\nPRM data analysis using SpectroDive\nTiming: 1 day",
    "This section mainly contains the selection of transitions for protein quantitation. The confidence and quantitative area of the spectrum need to be confirmed manually.\nClick “Analysis” and “Set up Targeted Analysis from File…”. Upload the PRM raw data and assign the established panel.\nSelect the search and extraction settings schema for the PRM analysis. The default BGS factory settings are used in this protocol.\nFollow the wizard and specify the condition, replicates, and other information of the raw data. After clicking “Finish”, all the data in this protocol will be loaded within about 1 h.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3013-Fig5.jpg\nFigure 5. Fragments with bad elution peak shapes need be excluded (red arrow)\nOptional: Right-click on the file name and select \"Group by protein\" to facilitate data verification based on the protein name. In order to analyze a specific protein conveniently, one can filter the data by entering the protein/gene name in the Node Text Filter. In addition, the more convenient way to screen multiple data is to display MS2 XIC and MS2 XIC Alignment in the upper and lower panels.\nManually screen the precursors and their fragments in the MS2 XIC panel.\nFor precursors and fragments to exclude, right-click on the fragment and select “Exclude” or “Remove” in the node or all runs.\nCritical: Precursors and fragments with bad elution peak shape should be excluded. The fragment ions in the following cases need to be excluded: different peak patterns from other b+, y+ ions; interfered by other ions. Product ions with high intensity and an m/z above the precursor m/z are preferred, see Figure 5[href=https://www.wicell.org#fig5].\nFor precursors that require adjustment of the quantitative area range, manually adjust the green dotted lines representing the start and end points of the peak area calculations.",
    "Note: In some cases, the intensity alignment of the fragment ions from a precursor given by the software is very consistent across all runs, but there is an obvious error in the selection of the elution peak range, which may only select part of the region with high consistency of fragment ion intensity alignment or the wrong peak.\nThen, right-click on the name of the experiment to recalculate the Q values by clicking “Recalculate Qvalues” for qualitative analysis, and then refresh the post analysis by clicking “Refresh Post Analysis”.\nNote: After screening, some excluded precursors also pass the threshold of Q value, which may be false positives because their signal may be very low, close to noise.\nAfter completing all data filtering and adjustment, save the result as a .spe file.\nGo to the “Report” module and export the “Run Pivot Report” and the “Normal Report”. The default export parameters are sufficient for subsequent quantitative analysis."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Cell Separation/Fractionation",
    "Health Sciences",
    "Cell Isolation",
    "Proteomics",
    "Mass Spectrometry",
    "Cell Biology",
    "Protein Expression And Purification",
    "Clinical Protocol"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}