{
  "id": 10009,
  "origin_website": "Jove",
  "title": "An Intra-Tissue Radiometry Microprobe for Measuring Radiance In Situ in Living Tissue",
  "procedures": [
    "This study is compliant with all the relevant ethical regulations of Yale University regarding vertebrate and invertebrate animal research.\n1. Building the optical micro-probe\nBuilding the glass sleeve, material: Pasteur pipette, 5.75 in(see Table of Materials)\n\t\nUsing a mountable alligator clip (Table of Materials), mount the glass pipette by the wide end such that the tapered end is facing down toward the floor and the orientation of the pipette is perpendicular to the floor.\nHang a 50 g plastic vice grip (Table of Materials) from the tapered end of the pipette. Place a pad of electrical tape between the pipette and the vice grip to help prevent slippage.\nHeat the tapered end of the pipette using a small butane torch (Table of Materials). Apply the flame 1 cm above the vice grip. Hold the torch such that the brightest part of the flame is 3 cm from the glass and the glass is at the tip of the flame. When the pipette's length has increased by about 5 in, immediately remove the flame.\nUse small scissors or a glass cutter to trim the pulled end of the pipette at the point where the new pulled diameter is roughly twice that of the optical fiber used in the next section (see step 1.2). File down any sharp areas of the trimmed end using carborundum paper (Table of Materials). Rinse away any resulting small glass shards or dust using a squirt bottle of isopropyl alcohol followed by compressed air.\nPulling the optical fiber (Figure 1D)",
    "Use a razor blade to sever the optical fiber, removing one SMA connector of a 200 µm diameter SMA-terminated optical fiber (Table of Materials). Cut close to one of the SMA terminations. Then, use the razor blade to remove the next 5 cm of plastic and fiberglass jacketing so that the bare optical fiber is exposed and protrudes from the rest of the intact assembly.\nUse the butane torch to burn off the polyimide polymer coating from the glass fiber. Rinse with isopropanol. Wipe the bare glass fiber clean using a lint-free wipe.\nThe next step is to mount the bare fiber so it can also be pulled with a flame. Mount the bare end of the optical fiber directly in a plier clamp (Table of Materials) on a table or shelf edge, letting the SMA-terminated end of the fiber hang toward the floor. Add the weights for pulling in the form of two small clamps (total weight: 10 g) on the jacketed end of the fiber about 12 in down from where the bare optical fiber is held in the plier clamp.\nTo pull the fiber, start with the butane torch flame on. With the flame on, hold the butane torch 1 cm from the bare fiber so the flame is perpendicular to the optical fiber and 3 cm down vertically from where the plier clamp holds the bare fiber. Allow the fiber to stretch, pull, separate, and drop to the floor.\nExamine the resulting pulled optical fiber end. Gently sand away any irregularities with carborundum paper, clean with isopropyl alcohol and a lint-free wipe, and dry with compressed air.\n\t\tNOTE: At this point, one may use a microscope to characterize and document the size and shape of the pulled fiber.",
    "Use a film-opaquing pen to darken the sides of the fiber and prevent the entry of stray light (Table of Materials). Gently pull the fiber across the tip of the pen, leaving only a small area at the tip uncovered.\nMounting the pulled fiber inside the glass pipette sleeve (Figure 1A)\n\t\nWorking under a stereomicroscope, carefully insert the tapered optical fiber from step 1.2 into the wide end of the altered glass pipette from step 1.1, and push the fiber through until ~1 mm of bare fiber is sticking out of the tapered end of the pipette.\nUsing electrical tape, secure the jacketed end of the optical fiber to the wide end of the pipette.\nPut a drop of cyanoacrylate adhesive onto a small-gauge needle (Table of Materials). Carefully touch the drop of adhesive to the cut edge of the pulled pipette, avoiding the bare end of the pulled fiber.\nAllow capillary action to wick the adhesive into the pipette, wetting the area between the wall of the pipette and the optical fiber. Allow the adhesive to cure for at least 15 min before moving the probe assembly.\nModifying the fiber tip with a scattering sphere (Figure 1C)\n\t\nCreate the raw material for the scattering ball tip by mixing a drop of UV-curable adhesive with titanium dioxide powder (Table of Materials) at ~1:1 v/v.",
    "Attach the probe to a micromanipulator with a mounting rod holder (Table of Materials) such that the probe is in a horizontal orientation. Prepare a working reservoir of the scattering material by dipping the tip of a wire or needle in the adhesive/TiO2 mixture prepared above such that a droplet of adhesive forms. Mount the wire or needle with the droplet near the tip of the horizontal probe. It is convenient to do this using an alligator clip mounted to the bench.\nDeposit a scattering sphere on the tip of the probe. Use the micromanipulator to slowly and carefully push the tip of the probe's optical fiber into the droplet of adhesive/TiO2. Then, quickly withdraw the tip from the glue. Repeat two to three times until a spherical droplet of adhesive of the desired size is deposited on the tip of the optical fiber.\n\t\tNOTE: The scattering sphere will be stable at diameters from two to eight times greater than the diameter of the tapered optical fiber. The final optimal size depends on the final desired application.\nCure the sphere by connecting the SMA-terminated end of the optical fiber to a fiber-coupled UV light source (Table of Materials).\n\t\t​NOTE: The light source used in this study had a power of 5.3 mW. At this power, the recommended cure time is at least 12 h or overnight. After curing is a good time to characterize and measure the size of the final optical probe tip. \n2. Preparing and mounting the tissue for optical measurements (Figure 2 and Figure 3)",
    "Prepare the dishes to mount the samples for an experiment. Heat the large end of a Pasteur pipette using a butane torch to make a punch to melt a 0.5 cm diameter hole in the bottom of a 35 mm x 10 mm plastic Petri dish. Seal the hole on the bottom side of the dish with electrical tape or lab tape. Make several at a time for efficiency.\nPrepare liquid gelatin (Table of Materials) according to the instructions on the package.\n\tNOTE: Commercial food-grade flavorless gelatin from the grocery store is better for this purpose than chemical-grade gelatin from chemical suppliers because the chemical-grade gelatin is less optically clear and less mechanically reliable than the food product.\nPerform the dissection and preparation of the tissue that will be used.\n\tNOTE: From experience, any flat tissue up to 1 cm thick can be successfully measured in this experiment using any dissection technique appropriate for the system of interest. For giant clam tissue, an 8 mm biopsy punch was used to make a flat, regular circle of clam tissue for use in the experiment12. For this system, only one sample could effectively be prepared at a time given the length of time required to complete a measurement to ensure that the sample was still in lifelike condition at the end of the experiment.",
    "Fill two Petri dishes from step 2.1 a quarter of the way with the liquid gelatin, and let cool to room temperature (RT) just short of gelation. In one dish, place the biopsy in the cushion of viscous gelatin that forms in the hole in the bottom of the dish. Use a Pasteur pipette to gently add RT gelatin around the biopsy until the Petri dish is full (Figure 3). Fill the second dish with gelatin to make a blank sample.\nPlace the sample dishes into a refrigerator for about 10-30 min until the gelatin is fully cured and slightly elastic to the touch.\n\tNOTE: In a cool room, this may not be necessary; when working in the tropics, this step is required to fully cure the gelatin.\nMaking a mount for the Petri dish on the micromanipulator (Figure 2)\n\t\nCut a 6 cm x 6 cm square of 1/4 in thick plexiglass (Table of Materials).\nDrill or melt a hole in the plastic square the same diameter as the Petri dish (~35 mm). Ensure that the Petri dish fits snugly in this hole and is held in place with friction. Add tape to the edges of the dish to slightly increase the size and frictional contact.\nDrill or melt a 1/4 in diameter hole in the corner of the plastic square. Use this hole to attach the square to the micromanipulator using a 1/4 in screw and bolt.\nCover the plastic square with black electrical tape to reduce the stray light reaching the probe. Similarly, use tape to create a skirt around the sides of the square extending below the bottom of the inserted dish (>10 mm) to reduce stray light (Figure 2B).",
    "Use a bolt and appropriate hardware to attach the Petri dish holder to a micromanipulator that allows for three-dimensional adjustments and well-resolved vertical movement over an extent greater than the thickness of the samples (part 1 and part 2 of the manipulator mentioned in the Table of Materials are good examples). Affix this micromanipulator to an optical breadboard.\n3. Measurement setup for tissue biopsies\nMount a light source above the area where the measurement takes place such that the light is collimated when it reaches the plane where the sample will be placed (Figure 2A). For example, attach a 5 cm collimating lens (Table of Materials) to a 5 mm liquid light guide (Table of Materials), and elevate above the sample by >0.6 m using a vice and frame attached to an optical breadboard (Table of Materials). Then, connect the light guide to a broadband light source, such as the plasma light source listed in the Table of Materials.\nAttach the probe to a vertically oriented mount such that it points toward the light source. Secure the probe with clamps, hose clamps, or tape to an optical table post.\n\tNOTE: In the giant clam experiment, a specifically designed rod holder, such as the micromanipulator listed in the Table of Materials, is used. In this work, it was secured by magnets to an optical breadboard (Table of Materials). The additional degrees of freedom for alignment obtained by having both the probe and the sample on manipulators are convenient but not required. Be careful not to over-clamp to the post, as this can break the pipette housing.",
    "Position the sample manipulator near the vertically mounted probe. Use the sample manipulator to adjust the position of the sample stage such that the probe is centered in the 0.5 cm opening at the bottom of the Petri dish. Use extreme caution to avoid touching or bumping the tip of the mounted probe.\n\tNOTE: A boom-mounted stereomicroscope positioned over the sample area can be useful. This way, the top-down alignment of the probe tip, stage, and sample can be viewed before starting an experiment (Figure 2A).\nConnect the SMA-terminated end of the probe's optical fiber to a USB fiber-optic spectrometer (Table of Materials), and connect the spectrometer to the computer using a USB cable.\n4. Data collection\nExperimental setup\n\t\nHave the probe and manipulators in the exact aligned position in which the data will be collected, as in step 3.4.\nUse a cotton swab or fine-gauge needle to carefully apply a small amount of silicone lubricant (Table of Materials) to the part of the probe that will be inserted into the tissue to lower the friction between the sides of the probe and the tissue sample. Reapply the silicone lubricant before each baseline or tissue measurement.\nRemove the tape covering the hole in the blank sample Petri dish, and place it in the sample holder (step 2.7), making sure it is held securely in place by friction.\nUse the micromanipulator to lower the sample onto the probe. Allow the probe to enter the gelatin via the hole on the underside of the petri dish. Continue until the probe is approximately 5 mm from the bottom of the gelatin layer.",
    "Turn on the light source. Using the spectrometer software, adjust the spectrometer integration time until the signal is as high as possible but not saturating. Set the number of averaged scans between two and five and the smoothing pixels value to six. Usable integration times at this stage can vary between 1-50 ms for this baseline.\nCollecting the reference spectra\n\t\nCollect a dark measurement.\n\t\t\nOnce the spectrometer parameters have been set with the blank sample, detach the probe fiber from the spectrometer, and cover the port with the opaque metal cover that came with the spectrometer.\nObtain a dark measurement from the spectrometer (often using the dark lightbulb icon in the GUI) to characterize the noise of the spectrometer with no input light. Save this measurement according to the data acquisition strategy.\nCollect a lamp measurement. Reconnect the probe fiber to the spectrometer, wait for the signal to stabilize, and acquire another spectrum. This measurement characterizes the light reaching the probe through the gelatin in the absence of tissue.\nCollecting the tissue spectra\n\t\nRemove the tape on the bottom of the sample Petri dish, and place it in the sample holder.\nAlign the sample dish with the probe using three-dimensional manipulation so that the tissue biopsy is centered above the tip of the probe.\nApply silicone gel to the probe (see 4.1.2), and slowly lower the sample onto the probe until the probe tip has passed through the gelatin supporting the tissue sample and has just entered the tissue sample.\n\t\tNOTE: Some spectrometers and computer programs allow real-time monitoring of the detected light. Use this to determine when the probe enters the tissue. The spectrum intensity will abruptly decrease as soon as the probe tip is in direct contact with the tissue.",
    "Verify that the integration time is appropriate for the measurement by ensuring that the measured spectrum is neither too noisy nor saturated. Change the integration time if necessary.\n\t\t\nAny time the integration time is adjusted, perform and store a new dark measurement (step 4.2.1). Do not change the number of averaged scans or the number of smoothed pixels.\nAfter finding suitable measurement parameters, take the measurements and save the spectrum.\nMove the sample down a specified distance using the micromanipulator. For the manipulator used for this study, each small tick mark was 0.001 in or 25.4 µm. The sample was moved down through five tick marks, or 127 µm, for each measurement. Repeat step 4.3.4.\nContinue to save the spectra at each vertical position within the tissue.\n\t\tNOTE: For the system described here, the required integration times varied between 1 ms to 5 s for the measurements within a single tissue sample. Eventually, the probe tip will exit the top of the tissue and be visible there (Figure 4A). This is the final measurement and characterizes the light incident at the top of the tissue.\nLoading and processing the data\n\t\nUse the spectrometer's software to convert all the collected spectra (dark spectra, lamp spectra, and tissue measurements) to delimited text files.\nUsing Matlab or a coding language of choice, load all the measurement files for a sample. For each tissue measurement spectrum, subtract the dark spectrum with the matching integration time, and then divide it by the integration time.\n\t\tNOTE: In this study, a Matlab script was used for loading and processing the data (Supplementary File 1).\nCalculate the percentage of incident light reaching each position in the tissue by dividing the spectra obtained with the probe inside the tissue by the baseline spectrum obtained in empty gelatin.",
    "NOTE: The measurement at the top of the tissue (step 4.3.6) should be very similar to the baseline measurement in gelatin (step 4.1) and, when divided, should be close to 100%. Depending on the experimental context, either lamp spectrum (the spectrum from empty gelatin or that from the very top of the tissue) can be used as a reference. However, it is still important to collect a lamp spectrum before starting the experiment. This is because, if the probe breaks or the experiment otherwise fails before reaching the top of the tissue, the data obtained before the failure are still usable, which is not the case if there is no corresponding initial lamp reference spectrum.\nVisualize the data; contour plots can be helpful (Figure 4B).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}