{
  "id": 3228,
  "origin_website": "Cell",
  "title": "Protocol for preparing murine tissue for comparative proteomics study of vaccine adjuvant mechanisms",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nSkin treatment and tissue harvest\nTiming: 3 days\nHair of the lateral back skin of mice is removed the day before experiment. Hair-removed skin is intradermally injected with diverse types of chemical adjuvants or treated with physical RFA. Skin is collected 18 h later.\nDay 1 Hair removal.\nAnesthetize mice as approved by your IACUC protocol.\nRemove hair on lateral dorsal skin of mice with scissors to create an area of more than 2 × 2 cm2, and then carefully apply hair Nair for 2 min followed by gently rinsing with warm tap water.\nKeep mice on 37°C warming pad for recovery.\nNote: Step 1 takes about 1–2 h.\nDay 2 RFA treatment.\nAnesthetize mice appropriately.\nApply a thin layer of ultrasound coupling medium on the hair-free skin of mice.\nActivate RFA device and set the energy level at high.\nFirmly press the front tip of the RFA device on the coupling medium-applied skin and hold for 90–120 s for RFA treatment.\nDry RFA-treated skin with Kimwipe and mark the treatment area with a sharpie marker.\nIntradermally inject 20 μL sterile PBS to the RFA treated skin using the Mantoux method,11[href=https://www.wicell.org#bib11] as shown in Figure 1[href=https://www.wicell.org#fig1].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2797-Fig1.jpg\nFigure 1. Intradermal injection of chemical adjuvants\n(A) Place the needle, bevel up, on the skin.\n(B) Gently insert the needle into the dermal layer of the skin.\n(C) Slowly advance by ∼5 mm and inject 20 μL chemical adjuvants.\n(D) A small bleb forms in the skin.\nNote: The red indicator light should be always on during the treatment. This step takes about 1 h.\nDay 2 Sham treatment.\nAnesthetize mice appropriately.\nApply a thin layer of ultrasound coupling medium on the hair-free skin of mice.",
    "Firmly press the front tip of the RF device with the power off on the coupling medium-applied skin and hold for the same period of time.\nDry RFA-treated skin with Kimwipe and mark the treatment area with a sharpie marker.\nIntradermally inject 20 μL sterile PBS to the Sham-treated skin as above.\nNote: Make sure the power of the RF device is off. This step takes about 1 h.\nDay 2 Chemical adjuvant treatment.\nAnesthetize mice appropriately.\nIntradermally inject 20 μL chemical adjuvants to the same anatomical location of the skin as above.\nMark the chemical adjuvant-treated area with a sharpie marker.\nNote: This step takes about 1 h.\nDay 3 Skin collection.\nEuthanize mice with appropriate methods.\nCollect center regions of RFA-treated skin and entire chemical adjuvant-treated skin according to the Sharpie marker labels 18 h after treatment.\nWeigh skin weight and then freeze skin in dry ice or liquid nitrogen.\nNote: Remove the fat tissue using forceps and scissors while harvesting the skin. This step takes about 1 h.\nPause point: Skin tissue can be stored at −80°C for several months.\nProtein extraction\nTiming: 2–5 h\nSkin tissue is cut into small pieces followed by homogenization in 8 M Urea buffer. Skin homogenates are then centrifuged. Supernatants are collected for downstream processing.\nSample preparation.\nTransfer skin tissue from −80°C to an Eppendorf tube.\nAdd 1 mL 8 M Urea buffer to the tube.\nCut the skin tissue into small pieces of less than 2 mm in any dimensions (Figure 2[href=https://www.wicell.org#fig2]A) with scissors.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2797-Fig2.jpg\nFigure 2. Tissue Homogenization\n(A) Cut tissue into small pieces with scissors.\n(B) homogenize tissue using a glass grinder on ice.",
    "Note: Keep the tubes on ice while cutting the tissue. The cutting step facilitates the release of most of the tissue proteins during the subsequent homogenization step. We used the same volume of Urea buffer since we believe this volume is sufficient to extract total proteins from the biggest skin tissues collected according to the tissue weight in Table 1[href=https://www.wicell.org#tbl1]. Another strategy is to add 8 M Urea proportionally to skin weight.\ntable:files/protocols_protocol_2797_4.csv\nHomogenization.\nTransfer the tissue with the 8 M urea buffer into a 2 mL glass grinder.\nThoroughly homogenize the skin tissue with the glass grinder on ice as shown in Figure 2[href=https://www.wicell.org#fig2]B.\nNote: Keep the tissue cold while homogenizing. Skin tissue is ‘hard’ to homogenize due to its high contents of collagen.\nTransfer homogenized tissue with the buffer to new Eppendorf tubes including the remaining ‘hard’ skin tissue that cannot be homogenized.\nCentrifuge at 16,000 × g for 10 min at 4°C.\nCollect supernatants into new Eppendorf tubes.\nNote: Collect only the supernatant. Centrifuge again to obtain pure supernatant if needed.\nProtein concentration quantification\nTiming: 1–2 h\nThe protein concentration of skin homogenates is determined with BCA assay following the manufacturer’s instruction. Below is a shortened version.\nSample and reagent preparation.\nDilute BSA stock with PBS to prepare BSA standard samples at 2,000, 1,500, 1,000, 750, 500, 250, 125, 25, and 0 μg/mL.\nMix 20 μL skin homogenates with 60 μL PBS to prepare a 1:4 fold dilution.\nNote: 1:4 fold dilution reduces 8 M Urea to 2 M, which is within the compatible urea range for BCA assay. This volume (80 μL) is sufficient for a duplicate measurement.\nPrepare a sufficient volume of working reagent by mixing 50 parts reagent A with 1 part reagent B following the formula provided by the manufacturer.\nMicroplate procedures.",
    "Add 25 μL standard and skin homogenate samples in duplicate to 96-well plates.\nAdd 200 μL working reagent to each standard and skin sample wells.\nIncubate microplates at 37°C for 30 min (troubleshooting 1[href=https://www.wicell.org#troubleshooting]).\nRead absorbance at 562 nm in a microplate reader.\nPlot standard curve and obtain protein concentrations of skin homogenates by taking into consideration of the dilution factor (troubleshooting 2[href=https://www.wicell.org#troubleshooting]).\nNote: The associated software of a modern microplate reader (for example, SpectraMax iD3 microplate reader with SoftMax Pro) usually allows the input of standard sample concentrations to create standard curves for calculation of protein concentrations of unknown samples in the same software. Users need to select the best-fit standard curve to obtain accurate protein concentrations of unknown samples.\nPause point: Skin homogenates can be stored at −80°C for several months.\nProtein digestion\nTiming: 5–6 h\nProteins are subjected to reduction, alkylation, precipitation, and resuspension followed by two rounds of digestion with TPCK-treated trypsin according to a prior protocol with slight modifications.12[href=https://www.wicell.org#bib12]\nSample preparation.\nIdentify the skin sample with the lowest protein concentration.\nCalculate the volume of other skin homogenate samples to give the same amount of total protein with 400 μL skin sample identified in step 10a.\nCalculate the volume of 8 M Urea to make up a total volume of 400 μL for each sample.\nPrepare 400 μL skin samples of equal concentrations in new Eppendorf tubes.\nOptional: Sample volume can be adjusted to prepare a total 50–200 μg total protein to digest. Bovine Serum Albumin (BSA, 2 μL of 1 mg/mL) can be added as an internal control for MS data normalization.13[href=https://www.wicell.org#bib13]\nProtein reduction and purification.\nPerform protein reduction for skin homogenates by adding 25 μL of 100 mM DTT and incubate at 35°C in a shaking water bath at 100 rpm for 30 min.",
    "Critical: Wear protective gloves, protective clothing and protective eyeglasses when preparing DTT because it is irritating to eyes and skin.\nNote: Prepare the water bath at 35°C in advance. Make sure the power switch is turned on, enough water is added, and the temperature is set at 35°C the night before the procedure.\nAlkylate skin homogenates by adding 25 μL of 200 mM iodoacetamide (IAA) and incubate in the dark at 25°C for 30 min.\nCritical: IAA has acute toxicity and respiratory sensitization. Use IAA only in a chemical fume hood and immediately change contaminated clothing. Always use equipment for eye/face protection and wear protective gloves and clothing when using IAA.\nNote: IAA is unstable and light-sensitive. Prepare solutions immediately before use and perform alkylation in the dark.\nAdd cold methanol:chloroform:water mixture (2:1:1, v/v/v) to precipitate proteins.\nCritical: Methanol is highly flammable and toxic. Use methanol in a chemical fume hood and use equipment for eye/face protection and wear protective gloves and clothing.\nCritical: Chloroform has acute toxicity, skin and eye irritation, carcinogenicity and other organ toxicities. Use chloroform in a chemical fume hood and use equipment for eye/face protection and wear protective gloves and clothing when handling.\nNote: Mix methanol: chloroform: water mixture well before adding to your samples since these solvents are immiscible.\nShake the tubes vigorously and centrifuge at 16,000 × g for 5 min at 10°C.\nNote: The white pellets form at the interface of methanol/water (upper) and chloroform (lower), as shown in Figure 3[href=https://www.wicell.org#fig3].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2797-Fig3.jpg\nFigure 3. Interphase pellet (arrow) forms between upper methanol/H2O and lower chloroform phases after Methanol:Chloroform:Water precipitation\nCarefully remove upper and lower phases with micropipettes without touching pellets (troubleshooting 3[href=https://www.wicell.org#troubleshooting]).\nNote: A small volume of liquid can be kept to avoid the removal of protein pellets.",
    "Wash pellets by adding 500 μL ice-cold methanol.\nVortex the tube and then centrifuge at 16,000 × g for 5 min at 10°C.\nCritical: Methanol is highly flammable and toxic. Use methanol in a chemical fume hood and use equipment for eye/face protection and wear protective gloves and clothing when handling methanol.\nNote: Wash the pellets in cold methanol as increased temperature may cause protein loss. This step removes the organic solvent from the previous step. There is no need to break the pellet.\nCarefully remove methanol after centrifuge.\nProtein digestion.\nResuspend the pellets in 125 μL 50 mM ammonium bicarbonate (pH 8.0) supplemented with 3% w/v sodium deoxycholate.\nDigest protein samples by adding 12.5 μL of 1 mg/mL TPCK-treated trypsin and mix.\nTransfer 135 μL samples into digestion tubes and run in a barocycler.\nNote: Label the sample# on the digestion tubes clearly for sample identification. Barocycler is an instrument designed for high pressure applications such as accelerated enzymatic digestion of proteins. The barocycler program needs to be set up in advance and the water bath for digestion needs to be set at 35°C at least 20 min before running.\nRun the barocycler at 35°C for 75 cycles with 60-s pressure cycle (50-s high pressure, 10-s ambient pressure, 25 kpsi).\nAdd another 12.5 μL of 1 mg/mL TPCK-treated trypsin into the same tube and the digestion is repeated in the same condition.\nSodium deoxycholate removal.\nTransfer 145 μL digested samples to new Eppendorf tubes.\nAdd 15 μL acetonitrile: water (1:1, v/v) containing 5% formic acid into each tube to precipitate sodium deoxycholate.\nCritical: Formic acid is flammable and harmful and causes severe skin burn and eye damage. Use formic acid under a chemical fume hood and wear personal protective gloves, clothing and eye/face protection.",
    "Critical: Acetonitrile has acute toxicity and eye irritation. Wear personal protective gloves, clothing and eye/face protection and ensure adequate ventilation when handling acetonitrile.\nVortex to mix (troubleshooting 4[href=https://www.wicell.org#troubleshooting]).\nNote: White precipitations form immediately after mixing.\nCentrifuge at 11,000 × g at 10°C for 5 min.\nCarefully collect 80 μL supernatants using micropipettes and add to new Eppendorf tubes.\nCentrifuge again at 11,000 × g at 10°C for 5 min to ensure no pellets are left in the supernatants.\nTransfer supernatants to LC-MS/MS vials and store supernatants at −20°C or inject 25 μL for LC-MS/MS analysis as previously described.1[href=https://www.wicell.org#bib1]\nPause point: The peptides can be stored at −20°C for several weeks."
  ],
  "subjectAreas": [
    "Proteomics",
    "Immunology",
    "Protein Biochemistry",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}