{
  "id": 19894,
  "origin_website": "Wiley",
  "title": "Single-Nucleus RNA-Sequencing in Brain Tissue",
  "procedures": [
    "Here, we provide an in-depth protocol for the generation of a single-nucleus suspension from flash-frozen brain tissue (Fig. 3A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.919#cpz1919-fig-0003]). This protocol relies on the mechanical disruption of tissue in a lysis buffer. The nuclei are further cleaned by centrifugation and filtering. Although we use hippocampal tissue (approximately 15 to 25 mg per sample), this protocol should be applicable for a wide variety of brain regions.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/c44090f2-6401-4257-9146-b083b7b4420a/cpz1919-fig-0003-m.jpg</p>\nFigure 3\nSchematic of nuclei isolation. (A) Preparation of single-nucleus suspension from flash-frozen brain tissue. (B) Example of a single-nucleus suspension obtained from this protocol. (C) Example image of intact nuclei that can be used for library preparation.\nFor successful nuclei isolation, it is critical to keep the tissue frozen on dry ice or in liquid nitrogen until the mechanical disruption. The success of this protocol can be evaluated by counting the nuclei and assessing their quality (Fig. 3B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.919#cpz1919-fig-0003]). A nucleus of good quality shows an intact membrane and is round in shape. Over-lysed nuclei will show signs of leakiness and blebbing. As the nuclei contain no rRNA, no quality control for RNA integrity can be obtained after nuclei isolation. In case this is required, a standard cDNA conversion can be performed directly on the nuclei before moving to the single-cell readout. However, in our experience this is not necessary if RNase inhibitors were used and the nuclei seem intact.\nMaterials\nRNase away\nDouble-distilled water (ddH2O)\nInput tissue (flash-frozen, -80°C)\nLysis buffer (see recipe)\nWash buffer (see recipe)\n0.4% Trypan blue (Millipore Sigma, cat. no. T8154, or equivalent)\n          \nDounce homogenizer (Millipore Sigma, cat. no. D9063)\nBeaker, large\nAluminum foil\nCentrifuge, fixed-angle or swing-bucket\nCellTrics strainer, 100-µm (Sysmex, cat. no. 04-004-2328)\n50-ml Conical tubes\n15-ml Conical tubes\n1.5-ml Microcentrifuge tubes\nFlowmi cell strainer, 40-µm (Millipore Sigma, cat. no. BAH136800040)",
    "CellTrics strainer, 30-µm (Sysmex, cat. no. 04-004-2326)\nCellTrics strainer, 10-µm (Sysmex, cat. no. 04-004-2324)\nCounting chambers (Carl Roth, cat. no. PK36.1)\nBrightfield microscope\nPreparation\nNOTE: All steps need to be performed on ice.\n1. Clean all surfaces with RNase away.\n2. Prepare buffers following the recipes as they appear in the Reagents and Solutions section.\n3. Rinse Dounce homogenizer and pestle with ddH2O before use, wrap in aluminum foil, and store in the refrigerator at 4°C until use.\n4. Prepare a large beaker with ddH2O for cleaning the Dounce homogenizer and pestles.\n5. Cool down centrifuge to 4°C.\n6. Add RNase inhibitors to the lysis buffer directly before starting the protocol (see recipe).\nNuclei isolation\n7. Add 1 ml of cold lysis buffer to the Dounce homogenizer and then add your tissue. Make sure the tissue is fully submerged in the lysis buffer.\nIf you are using larger amounts of tissues, it can be helpful to first chop your tissue of interest in 100 µl of lysis buffer with a scalpel.\n8. Homogenize the tissue with 10 strokes of pestle A (loose pestle).\nDepending on your tissue of interest, you can try between 5 and 20 strokes. To avoid creating bubbles, do not lift the pestle all the way out of the fluid.\n9. Homogenize the tissue with 20 strokes of pestle B (tight pestle).\nNo larger tissue pieces should be visible in the solution after this second homogenization, avoid creating bubbles.\n10. Add 2 ml of lysis buffer to the Dounce homogenizer.\n11. Incubate on ice for 5 min.",
    "Timing is very important to ensure sufficient lysis while preventing over-lysis. Therefore, a second pair of hands might be needed if many samples need to be processed. When testing a new tissue of interest, it is advisable to perform a lysis timeline to identify the time that shows sufficient lysis but prevents over-lysis.\n12. Add 4 ml wash buffer to the Dounce homogenizer.\n13. Pour homogenate through a 100-µm CellTrics filter into a fresh 50-ml conical tube.\nPre-wet the filter with 100 µl wash buffer.\n14. Transfer supernatant into a 15-ml conical tube and add 5 ml wash buffer.\n15. Centrifuge 5 min at 500 × g, 4°C.\nThis first centrifugation is critical to remove mRNAs from ruptured cells from the suspension.\n16. Discard supernatant.\nA pellet should be clearly visible by eye. The supernatant can be kept and flash-frozen to perform a cytosolic bulk RNA-seq later. For this, extract RNA from 100 µl supernatant with 1000 µl Trizol.\n17. Add 1 ml wash buffer and resuspend the pellet using a P1000.\nMake sure that the pellet detaches from the tube, complete resuspension is not necessary.\n18. Transfer the liquid to a new 15-ml conical tube.\nThe previous tube can contain debris at the walls.\n19. Add 4 ml wash buffer and fully resuspend the pellet using a P1000.\nPrepare a clear suspension; no nuclei clumps should be visible after resuspension. Avoid creating a seal between the pipet tip and the tube as this can rupture nuclei.\n20. Centrifuge for 5 min at 500 × g, 4°C.\n21. Discard supernatant.\n22. Add 1 ml wash buffer and fully resuspend the pellet using a P1000.",
    "Prepare a clear suspension; no nuclei clumps should be visible after resuspension. Avoid creating a seal between the pipet tip and the tube as this can rupture nuclei.\n23. Aspirate all liquid using a P1000 tip, attach a Flowmi 40-µm filter and slowly release the suspension through the filter into a 1.5-ml microcentrifuge tube.\nDo not collect the foam that will be released from the filter after the suspension has run through.\n24. Filter solution through a 30-µm CellTrics filter into a new tube.\nPre-wet filter with 100 µl wash buffer.\n25. Filter solution through a 10-µm CellTrics filter into a new tube.\nPre-wet filter with 100 µl wash buffer. In case the liquid does not immediately run through the filter (because of the small mesh size), carefully move the tube over a straight surface (e.g., bench).\nCounting of nuclei\n26. Directly before counting, mix the nuclei suspension very well by carefully pipetting with a P1000 pipet.\n27. Transfer 10 µl of nuclei suspension/dilution into a new tube and add 10 µl of Trypan blue. Mix carefully by pipetting and wait 2 minutes.\nPerform a trial experiment to test whether you need to prepare a higher dilution for counting. Aim for a concentration of 600 to 1500 nuclei/µl (before adding Trypan blue).\n28. Add 10 µl of the mix to a counting chamber.\nIn our experience, using single-use counting chambers greatly decreases variability between the different counts due to improper glass slide attachment. Quickly insert the counting mixture to make sure the nuclei are distributed equally within the chamber.\n29. Count nuclei from all four squares and calculate the concentration of your nuclei suspension.\nCounting all four squares is recommended to account for variability. Ideally, the sample is counted by two experimenters and the average is calculated.",
    "30. Assess nuclei quality of the suspension using a brightfield microscope. Intact nuclei are round in shape and can be easily differentiated from debris and ruptured nuclei (Fig. 3C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.919#cpz1919-fig-0003]).\nCleaning\n31. Properly clean the Dounce homogenizer and pestle under water until there is no foam or tissue pieces left. Place them for drying and rinse again with ddH2O before further use.\n32. Buffers can be kept at 4°C and used within 24 hr.",
    "Single-nucleus RNA-seq using the 10x Genomics assay depends on the generation of microdroplets, called gel beads in emulsion (GEMs). Each GEM contains, ideally, one barcoded gel bead and one nucleus. Within these individual reaction units, cDNA synthesis is performed to allow the tracing of multiple reads back to a single nucleus (Fig. 4A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.919#cpz1919-fig-0004]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/21a78431-ab5e-491a-99be-7f7c1c984de3/cpz1919-fig-0004-m.jpg</p>\nFigure 4\nSchematic of library preparation. (A) GEMs are produced in the 10x chromium chip with each GEM containing one bead and one nucleus. Within each GEM, reverse transcription takes place to produce barcoded cDNA. (B) The quality of the cDNA can be assessed on a Tapestation or Bioanalyzer and should yield a fragment size that peaks around 900 to 1000 bp. (C) After fragmentation, the fragment size of each library should be around 400 to 500 bp.\nWe performed cDNA synthesis and library preparation following the chromium single-cell 3’ reagent kit v3 user guide (CG000183 Rev B). Each version of the chromium single-cell 3’ reagent kit v3 user guide contains detailed instructions on how to prepare each individual reaction mix. However, the general steps are similar to newer versions of the RNA-seq protocol provided by 10x Genomics.\nMaterials\nSingle-nucleus suspension (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.919#cpz1919-prot-0001])\nChromium single-cell 3ʹ gel bead kit v3 (10x Genomics, cat. no. PN-1000076)\nChromium single-cell 3ʹ GEM kit v3 (10x Genomics, cat. no. PN-1000077)\nDynabeads™ MyOne™ SILANE (10x Genomics, cat. no. PN-2000048)\n80% Ethanol\nSPRIselect reagent kit (Beckman Coulter, cat. no. B23318)\nChromium single-cell 3ʹ library kit v3 (10x Genomics, cat. no. PN-1000078)\nChromium i7 multiplex kit (10x Genomics, cat. no. PN-220103)\nBuffer EB (Qiagen, cat. no. 19086)\nKapa DNA quantification kit (Roche, cat. no. KK4824)\n50% Glycerol (Ricca Chemical Company, cat. no. 3290-32)\n          \n10x Genomics chromium controller\n10x Genomics chromium accessories\n               \n10x Vortex adapter (cat. no. 330002)",
    "10x Vortex clip (cat. no. 230002)\n10x Chip holder (cat. no. 330019)\n10x Magnetic separator (cat. no. 230003)\nThermal cycler\nAgilent 4200 tapestation system/bioanalyzer 2100\nSequencing system\nPreparation\n1. Count nuclei and calculate the concentration of nuclei as previously described (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.919#cpz1919-prot-0001]).\n2. Turn on the chromium controller.\nCompartmentalized reverse-transcription\n3. Thaw all reagents for the reverse-transcription, vortex the gel beads thoroughly.\nThaw gel beads (chromium single-cell 3ʹ gel bead kit) and RT reagent, template switch oligos, and reducing agent B (chromium single-cell 3ʹ GEM kit v3) to room temperature as specified in the chromium single-cell 3’ reagent kit v3 user guide. Keep RT enzyme C (chromium single-cell 3ʹ GEM Kit v3) on ice.\n4. Dilute nuclei in water according to the calculated nuclei concentration, aiming for your desired nuclei concentration.\nThe chromium single-cell 3’ reagent kit v3 user guide (e.g., CG000183 Rev B) provides a calculation table that takes the usual recovery rate into account.\nIf bulk RNA-seq on the nuclei is additionally required, the remaining nuclei can be pelleted by centrifugation and flash-frozen with 1000 µl Trizol.\n5. Assemble the chromium chip as shown in the user guide.\n6. Prepare the master mix containing all reagents required for the reverse transcription on ice.\n7. Mix the master mix and the nuclei dilutions on ice.\n8. Load the chromium chip by adding the requested volume of nuclei suspension, gel beads, and partitioning oil. Fill all unused wells with 50% glycerol solution.\nMake sure to not load any solution in the upper row of the chip, as this is where the GEMs will be produced.\n9. Immediately close the chip and start the chromium run.\n10. After the run is finished, slowly aspirate 100 µl of the formed GEMs from the first row of the chip.",
    "Make sure to not create a seal between the pipette and the tube.\nClosely examine the quality of the GEMs when inside the tip to make sure no clog has occurred.\n11. Transfer 100 µl of the GEMs into a pre-cooled 0.2-ml 8-strip tubes on ice.\nAs the reaction already contains the mix for the reverse transcription, very carefully pipette up and down a few times to make sure the emulsion is properly mixed.\n12. Incubate the sample in the thermal cycler and immediately start reverse-transcription (lid temperature 53°C).\n         \ntable:\n﻿0,1\n45 min,53°C\n5 min,85 °C\nHold,4°C\ncDNA amplification\n13. Thaw all reagents for the amplification.\nThaw reducing agent B, cDNA primers (chromium single-cell 3ʹ GEM kit v3) and Dynabeads (Dynabeads™ MyOne™ SILANE) to room temperature. Thaw cleanup buffer (chromium single-cell 3ʹ GEM kit v3) at 65°C as specified in the chromium single-cell 3’ reagent kit v3 user guide and then cool to room temperature. Keep Amp mix (chromium single-cell 3ʹ GEM kit v3) on ice.\n14. Remove the sample from the thermal cycler and immediately add recovery agent to break all GEMs and release cDNA.\nWait 60 sec, do not mix the solution.\n15. Perform a clean-up using Dynabeads.\nKeep all fractions that are removed from the samples during the cleanup until the final Bioanalyzer/Tapestation readout, this can help to save the experiment in case some mix-up occurs.\nPerform two washes with 80% ethanol by pipetting on the other side of the tube to not disturb the beads.\n16. Recover cDNA in elution solution I.\n17. Prepare the amplification mix on ice.\n18. Mix the amplification mix and the cDNA.\n19. Incubate the sample in the thermal cycler for cDNA amplification to generate sufficient amounts of cDNA while minimizing amplification biases (lid temperature 105°C).\n         \ntable:\n﻿0,1,2\n1 cycle,3 min,98°C",
    "n cycles,15 sec,98°C\n,20 sec,63°C\n,1 min,72°C\n1 cycle,1 min,72°C\nHold,,4°C\nThe number of cycles (n) depends on the number of cells and the transcripts per cell. We used 14 cycles as nuclei contain less transcripts compared to a whole cell.\n20. Perform a SPRIselect clean-up.\nKeep all fractions that are removed from the samples during the cleanup until the final Bioanalyzer/Tapestation readout, this can help to save the experiment in case some mix-up occurs.\n21. Perform two washes with 80% ethanol by pipetting on the other side of the tube to not disturb the beads. Recover cDNA in EB buffer.\n22. Perform quality control (QC) using Bioanalyzer or Tapestation (Fig. 4B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.919#cpz1919-fig-0004]).\ncDNA obtained from nuclei usually shows a fragment size distribution with a peak around 900 to 1000 bp (Fig. 4B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.919#cpz1919-fig-0004]).\nLibrary preparation\n23. Thaw all reagents for the fragmentation and ligation step.\nThaw fragmentation buffer, ligation buffer, adaptor oligos, SI primers (chromium single-cell 3ʹ library kit v3) and chromium i7 sample index plate (chromium i7 multiplex kit) to room temperature. Keep fragmentation enzyme, DNA ligase, and Amp mix (chromium single-cell 3ʹ library kit v3) on ice.\n24. Prepare fragmentation mix on ice.\n25. Mix a fraction of the amplified cDNA with the fragmentation mix and incubate on the thermal cycler (lid temperature 65°C). Immediately start the fragmentation (32°C) once the samples are in the pre-cooled thermal cycler.\n         \ntable:\n﻿0,1\nPre-cool,4°C\n5 min,32°C\n30 min,65°C\nHold,4°C\n26. Perform a double-sided SPRI size selection.\nPay attention to keep the supernatant after the first bead addition as it contains all fragments below 600 bp.\nKeep all fractions that are removed from the samples during the size-selection until the final Bioanalyzer/Tapestation readout, this can help to save the experiment in case some mix-up occurs.\n27. Recover cDNA in EB buffer.",
    "28. Prepare adaptor ligation mix.\n29. Mix fragments with the adaptor ligation mix and incubate on a thermal cycler (lid temperature 30°C).\n         \ntable:\n﻿0,1\n15 min,20°C\nHold,4°C\n30. Perform a clean-up using SPRI size selection to select fragments in the range of 200 to 600 bp.\nPay attention to keep the supernatant after the first bead addition as it contains all fragments below 600 bp.\nKeep all fractions that are removed from the samples during the cleanup until the final Bioanalyzer/Tapestation readout, this can help to save the experiment in case some mix-up occurs.\n31. Recover the fragments in EB buffer.\n32. Prepare sample index PCR mix.\n33. Mix the cleaned fragments with the samples index PCR mix and the indexes.\nProperly record the indexes used for each sample to allow for proper demultiplexing, use different indexes for all samples that will be pooled for sequencing.\n34. Incubate on a thermal cycler (lid temperature 105°C).\n         \ntable:\n﻿0,1,2\n1 cycle,45 min,98°C\nn cycles,20 sec,98°C\n,30 sec,54°C\n,20 sec,72°C\n1 cycle,1 min,72°C\nHold,,4°C\nThe number of cycles used (n) depends on the cDNA yield as obtained from the cDNA quality control (step 22). The recommended cycle numbers can be found in the chromium single-cell 3’ reagent kit v3 user guide.\n35. Perform double-sided SPRI size selection to select fragments in the range of 200 to 600 bp.\nPay attention to keep the supernatant after the first bead addition as it contains all fragments below 600 bp.\nKeep all fractions that are removed from the samples during the cleanup until the final Bioanalyzer/Tapestation readout, this can help to save the experiment in case some mix-up occurs.\n36. Recover fragments in EB buffer.\n37. Perform QC using Bioanalyzer or Tapestation (Fig. 4C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.919#cpz1919-fig-0004]).",
    "The fragments should show a lower fragment size peaking around 400 to 500 bp (Fig. 4C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.919#cpz1919-fig-0004]).\nObtain the average fragment size for each sample from the Bioanalyzer or Tapestation profiles.\nSequencing\n38. Calculate the molarity of each sample and pool the libraries that will be sequenced together accordingly.\nUse the Kapa DNA quantification kit to measure the final concentration of each sample. This kit is more specific compared to other measurements (e.g., Bioanalyzer), as it can specifically quantify sequenceable library molecules (containing both P5 and P7 sequences).\nThe molarity of each sample is calculated as: formula:\n$molarity\\;[ {nM} ] = \\frac{{{\\rm{sample \\; concentration}}[ {\\frac{{{\\rm{ng}}}}{{{\\rm{\\mu l}}}}} ]}}{{{\\rm{average \\, fragment \\, size}}[ {{\\rm{bp}}} ]*660\\frac{g}{{mol}}}}\\times{10^6}$\nChoose an appropriate sequencing platform to achieve the required sequencing depth (recommended sequencing depth is 20,000 read pairs per cell). The 10x genomics chromium single-cell gene expression assay produces sequencing-ready libraries for Illumina sequencing platforms.\n39. Sequence the pool using the following recommended parameters on an Illumina sequencing platform:\n         \nRead 1: 28 bp\nRead 2: 91 bp\ni7 index read: 8 bp"
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}