{
  "id": 15272,
  "origin_website": "Jove",
  "title": "RNA Pull-down Procedure to Identify RNA Targets of a Long Non-coding RNA",
  "procedures": [
    "All procedures were performed in strict accordance with European Economic Community for the care and use of laboratory animals (86/609/EEC and 2010/63/UE) and under a license granted to D. Becquet (Préfecture des Bouches-du-Rhône, Authorization no. 13-002).\n1. Probe Design\nUsing the primary sequence of the lncRNA of interest, generate its secondary structure on the \"RNAstructure Webserver\"5.\n\tNOTE: On this site, different algorithms can be used. The three prediction tools that give the best results for the probe designs are: \"Fold\" (lowest free energy structure), \"MaxExpect\" (highly probable base pairs), and \"Probnot\" (probable base pairs including pseudoknots). These three analyses can be performed and compared. Other web servers, such as the Vienna RNA websuite7, can also be used.\n\t\nSelect regions that display a low probability of internal base pairing and design anti-sense oligonucleotide probes of 25 bases with a strong affinity for these regions.\n\t\tNOTE: The GC contents of these probes should be comprised between 40 and 60%. Using an alignment search tool (Blast), make sure that the selected anti-sense oligonucleotide probes do not recognize nucleotide sequences in other RNA expressed in the chosen cell system.\nDesign also a non-specific DNA oligonucleotide probe of 25 bases which displays neither affinity for the lncRNA of interest nor for other RNA sequences in the genome of interest.\nOrder the probes with biotin at the 3'-end.\n\tNOTE: In order to reduce the steric hindrance, the distance between oligonucleotide and Biotin has to be increased with a triethyleneglycerol spacer. For an optimal result, and to be able to assess the specificity of results of the pull-down, it is recommended to design 3 different anti-sense oligonucleotide probes and then to experimentally compare their efficiency.\n2. Cross-linking\nCultured cell cross-linking",
    "Culture the GH4C1 sommatolactotroph pituitary cells in Ham's F10 medium supplemented with 15% horse serum and 2% fetal calf serum. Grow the cells until confluence in 78.5 cm2 culture plates. This corresponds approximately to 1 x 107 cells.\nRemove the cell culture medium from a confluent GH4C1 78.5 cm2 culture plate, then rinse with 1x the medium volume of phosphate buffered saline (PBS)\nFix the cells with a 1% paraformaldehyde solution in PBS (10 mL for a 78.5 cm2 dishes); this solution must be freshly prepared from a 4% paraformaldehyde stock solution. Cross-link under agitation for 10 min at room temperature (RT).\n\t\tCAUTION: Paraformaldehyde (PFA) is toxic, and must be handled with caution.\nQuench the paraformaldehyde action by adding 1/10 volume of glycine 1.25 M (1 mL per 10 mL of paraformaldehyde solution); agitate 5 min at RT.\nDiscard the media by aspiration and rinse two times (5 min) with 1X the medium volume of PBS.\nAdd a volume of PBS corresponding to 1/10th of the volume of media, collect cells with a cell scraper, and then transfer to a centrifuge tube.\nSpin at 510 g at 4 °C for 5 min.\nRemove as much supernatant as possible.\nStore pellets indefinitely as needed at -80 °C.\nTissue Cross-linking\nPut 5 mg of freshly obtained mouse pituitary gland tissue in a solution of 1% paraformaldehyde diluted in PBS (approximately 10x the volume of the tissue), agitate for 10 min at RT.\nQuench the paraformaldehyde action by adding a 1.25M glycine solution (1 mL per 10 mL of paraformaldehyde solution) and agitate 5 min at RT.\nDiscard the media by aspiration and rinse two times with PBS (approximately 10x the volume of the tissue). Remove as much supernatant as possible.\nStore the cross-linked tissue indefinitely at -80 °C.",
    "3. Cell or Tissue Lysis\nPrepare the Lysis Buffer (50 mM Tris-HCl pH 7.0, 10 mM EDTA, 1% SDS supplemented with 200 U/mL of a RNAse inhibitor solution, and a cocktail of proteases inhibitor 5 µL/mL).\nTo obtain lysed samples without prior thawing, re-suspend the cell pellets or cross-linked tissues with this buffer (approximately 1 mL per 100 mg of cell pellet or tissue). A cell pellet obtained from 1 x 107 cells give rise to a lysed sample containing roughly 20 mg of protein.\n\tNOTE: Depending on the tissue used, a step of mechanical disruption should be added. In this case, it is important to avoid heating of the samples during this additional step.\n4. Sonication\nOptimization of the sonication conditions\nProgram the sonicator with 2 to 5 series of 30 s ON and 30 s OFF.\nPerform tests to optimize sonication conditions on diluted lysed samples (dilution factor ½ or ¼ corresponding to approximately 10 or 5 mg of protein). Place diluted lysed samples in the 4 °C water bath and start the sonication series.\nPurify RNAs either with a RNA purification kit or with an RNA isolation reagent (e.g., Trizol).\nLoad the totality of purified RNA on a 1% agarose gel electrophoresis in TBE buffer, check the length of RNA fragments. This length should range between 200 and 800 bp.\n\t\tNOTE: Depending on the RNA fragment size, the anti-sense oligonucleotide probes' efficiency can vary. It is then recommended to check the efficiency of the probes under different conditions of sonication.\nSonication of the lysed samples\nPlace lysed samples corresponding to 20 mg of proteins (obtained after step 3.2) in the 4 °C water bath and start the sonication series as optimized in step 4.1.",
    "Immediately after sonication, centrifuge for 5 min at 12,000 g at 4 °C. Transfer supernatants in new centrifuge tubes.\n\t\tNOTE: To ensure homogeneity, replicate supernatants can be pooled and redistributed at this step.\n5. RNA Pull-down\nDay 1 – hybridization step\nAdd 2 volumes of hybridization buffer (50 mM Tris-HCl pH 7.0, 750 mM NaCl, 1 mM EDTA, 1% SDS, 15% Formamide added extemporaneously) to supernatants collected after the sonication step. Vortex.\nTransfer 20 µL of each sample in a centrifuge tube (input samples) and store at -20 °C.\nAdd 100 pmol of biotinylated oligonucleotide probes (specific or non-specific; see Table 1) to each sample. Incubate 4 to 6 h under moderate agitation on a tube rotator at RT.\nAdd 50 µL of magnetic streptavidin beads supplemented with 200 U/mL of a RNAse inhibitor solution and a cocktail of proteases inhibitor 5 µL/mL.\nIncubate overnight under moderate agitation on the tube rotator at RT.\nDay 2 – RNA isolation step\nUse magnetic support to separate beads from cell lysate, discard the supernatant, and wash the beads with 900 µL of wash buffer (SDS 0.5%, SSC 2x). Repeat 5 times interspersed with 5 min agitation on the rotator at RT.\nAfter the last wash, decant one last time and add 95 µL of Proteinease K buffer (10 mM Tris-HCl pH 7.0, 100 mM NaCl, 1 mM EDTA, 0.5% SDS) and 5 µL of proteinase-K (20 mg/mL) to the samples.\nOn ice, thaw the input samples (20 μL) and add 75 µL of Proteinease K buffer and 5 µL of proteinase-K (20 mg/mL).\nIncubate all samples with proteinase K for 45 min at 50 °C then 10 min at 95 °C.",
    "Chill the sample on ice for 3 min before separating the beads from RNAs with the magnetic support. Keep the supernatant and discard the beads.\nPurify RNAs with a RNA purification kit, which should include a DNA digestion step. Store RNAs at -80 °C.\nPerform reverse transcription qPCR (RT-qPCR) using a RT kit followed by qPCR using specific primers (Table 1).\nConstruct two DNA libraries corresponding to the two RNA pools obtained with each of the specific Neat1 probes (Table 1). Perform sequencing on a next-generation sequencing system."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}