{
  "id": 3532,
  "origin_website": "Cell",
  "title": "Protocol for the expansion of mouse immune effector cells for in vitro and in vivo studies",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPlate coating with αCD3/αCD28\nTiming: 15 min\nPlate coating αCD3/αCD28 needs to be performed one day before splenocyte isolation.\nDilute both antibodies in 12 mL DPBS to a final concentration of 1 μg/mL for αCD3 and 5 μg/mL for αCD28.\nTransfer 2 mL of the antibody dilution per well on each well of a 6-well suspension plate and make sure that the wells are fully covered.\nWrap the plate in aluminum foil and incubate for 8–16 h at 4°C.\nIsolation of splenocytes\nTiming: 1 h\nThe spleen of one C57BL/6 mouse will give ∼30–80 × 106 splenocytes with ∼20%–30% T cells and 1%–2% NK cells.\nPrepare a 50 mL centrifuge tube with DPBS on ice.\nSacrifice one mouse and disinfect the abdominal skin with 70% ethanol.\nIsolate the spleen with sterile instruments.\nOpen the peritoneum using a forceps and scissors.\nExpose the spleen by pulling associated white connective tissue with forceps.\nRemove unwanted tissue with scissors and transfer the spleen into the 50 mL centrifuge tube.\nPause point: The spleen can be kept in DPBS on ice for transport. Try to process within 2 h after isolation.\nPlace a 100 μm cell strainer in a new 50 mL centrifuge tube and mash the spleen with a plunger of a 2 mL syringe. Continuously moisten the cell strainer with DPBS while mashing. Fill the tube with DPBS.\nCritical: Ensure that the tissue stays moistened with DPBS throughout this step.\nSpin at 400 g for 5 min and aspirate the supernatant.\nResuspend the red pellet in room tempered ACK lysis buffer using a 1000 μL pipette.\nUse 500 μL ACK lysis buffer/spleen.\nIncubate for 2–3 min and fill the tube with DPBS.",
    "Pass cells through a 40 or 70 μm cell strainer to remove cell clumps and debris. Moisten the cell strainer with DPBS or medium before use.\nSpin at 400 g for 5 min and aspirate the supernatant.\nResuspend the pellet in RPMI complete medium (for T cell expansion) or recommended medium (for NK cell expansion) to get ∼8–12 × 106 cells/mL.\nCount cells with a hemocytometer at a 1:20 dilution.\nNote: Proceed with T cell or NK cell expansion after this step.\nT cell expansion\nTiming: 5–7 days\nSplenocytes will be activated with αCD3/αCD28 antibodies for 2 days and further expanded with IL-2. During activation, T cells will form clusters and will increase in size. After 3–5 days, an increased proliferation rate, an elongated shape and clonal clusters can be observed.\nCritical: Ensure you have splenocytes counted and ready for seeding before starting.\nAspirate the remaining supernatant of the αCD3/CD28-coated 6-well suspension plates. Wash one time with DPBS to remove unbound antibodies and repeat aspiration.\nSeed 5 × 106 isolated splenocytes in 5 mL RPMI complete medium per coated well.\nOn day 1, supplement the medium with 50 U/mL IL-2.\nOn day 2, harvest cells with a serological pipette.\nDetach the cells by pipetting up and down with a serological pipette and transfer the cell suspension into a 50 mL centrifuge tube.\nAdd 1 mL DPBS to remaining cells and detach with a 1000 μL pipette. Combine cell fractions.\nSpin the cell suspension at 400 g for 5 min, resuspend in appropriate volume of RPMI complete medium and count. Reseed cells at a concentration of 1 × 106 cells/mL with 0.5 mL/cm2. Supplement the medium with 50 U/mL IL-2.\nNote: Activated T cells can be easily detached by resuspension.",
    "From now on, count cell numbers every 1–2 days and expand with additional RPMI complete medium to maintain a concentration of 1 × 106 cells/mL with 0.5 mL/cm2. Supplement additional medium with 50 U/mL IL-2.\nT cells show >95% purity and high viability 5–7 days after isolation (Figure 1[href=https://www.wicell.org#fig1]) and can be used for in vitro and in vivo experiments.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3103-Fig1.jpg\nFigure 1. T cell proliferation and phenotypic characterization during expansion\n(A) Expansion of T cells over time starting from 1 × 106 splenocytes. Error bars are based on n = 3 replicates. Mean cell numbers (in ×106) are indicated for each measurement time point.\n(B) Microscopic image of T cells on day 6 of expansion. As expected, T cells show elongated shape and clonal clusters indicative for a proliferative state. Scale bar is 100 μm.\n(C) Flow cytometry of CD3+ T cells on day 3, 5 and 7 of expansion including the relative proportion of CD4+ and CD8+ T cells. SSC, side scatter.\nNote: For long-term culture and higher number of cells increase IL-2 dose to 200 U/mL from day 6 onward. With increased IL-2 concentration T cells can be cultured for up to 11 days.\nNK cell expansion\nTiming: 7–12 days\nThe following steps are written for the processing of splenocytes from two C57BL/6 mouse spleens of which ∼1.5 × 106 NK cells can be isolated. NK cells show an increased proliferation rate after 3–5 days.\nCritical: Ensure you have splenocytes counted and ready for seeding before starting. Cell concentration and medium volume are important. Deviations will hamper proliferation and viability.\nSpin splenocytes in recommended medium at 400 g for 5 min and aspirate the supernatant.",
    "Resuspend the splenocyte pellet at 1 × 106 cells/mL in recommended medium and follow the instructions of the EasySep Mouse NK Cell Isolation Kit.\nSpin the isolated NK cell suspension at 400 g for 5 min and aspirate the supernatant.\nResuspend the pellet in 1 mL medium to get ∼1–2 × 106 cells/mL.\nCount cells with a hemocytometer at a 1:5 dilution.\nSeed NK cells at a concentration of 0.5 × 106 cells/mL in 800 μL MEMα complete medium/well on a 24-well suspension plate. Supplement medium with 150 ng/mL IL-15.\nOn day 3, count the cell suspension with a hemocytometer and expand with additional MEMα complete medium to reach 0.4 × 106 cells/mL with 0.25 mL/cm2. Supplement additional medium with 150 ng/mL IL-15.\nFrom now on, count cell numbers every 2 days and expand with additional MEMα complete medium to maintain a concentration of 0.4 × 106 cells/mL with 0.25 mL/cm2. Supplement additional medium with 150 ng/mL IL-15.\nNK cells show >95% purity 4 days after isolation (Figure 2[href=https://www.wicell.org#fig2]). High viability is maintained for 12 days after isolation. NK cells are recommended to be used 7–12 days after isolation for in vitro and in vivo experiments.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3103-Fig2.jpg\nFigure 2. NK cell proliferation and phenotypic characterization during expansion\n(A) Expansion of NK cells over time starting from 1 × 106 splenocytes. Error bars are based on n = 3 replicates. Mean cell numbers (in ×106) are indicated for each measurement time point.\n(B) Microscopic image of NK cells on day 8 of expansion. As expected, NK cells show elongated shape indicative for a proliferative state. Scale bar is 100 μm.\n(C) Flow cytometry of CD3-NKp46+ NK cells on day 4, 8 and 12 of expansion including the relative expression CD49b expression.\nCritical: Keep NK cells on uncoated suspension plates/flasks.",
    "Note: The viability of NK cells will reduce after 1 day if not stimulated or deprived from IL-15.\nIsolation of bone marrow cells\nTiming: 1.5 h\nBoth femora and tibiae of one C57BL/6 mouse will give ∼50–90 × 106 bone marrow cells.\nPrepare a 50 mL centrifuge tube with DPBS on ice.\nSacrifice one mouse and disinfect the skin at the legs and abdomen with 70% ethanol.\nMake an incision at the top of each hind leg and pull the skin down towards the foot to expose the muscle. Cut the cartilage between femur and tibia.\nUse scissors to free the hind legs from muscles and perform the amputation.\nNote: Twisting will help to isolate the femur. But be careful not to break the bones.\nUse a paper tissue sprayed with 70% ethanol to remove remaining muscle tissue from the bones.\nSpray the bones with 70% ethanol to disinfect and wait 30 s. Transfer them into the 50 mL centrifuge tube filled with DPBS for transport.\nPause point: The bones can be kept in DPBS on ice for transport. Try to process within 2 h after isolation.\nPlace the bones on a petri dish under a sterile working bench. Remove remaining connective tissue with forceps and scalpel by scratching. Cut the cartilage at both sides of the bone to allow excess to the bone marrow.\nCritical: Process bones of max. 2 mice at the same time to not let the bone marrow dry out.\nAttach a 25G needle to a 10 mL syringe. Flush the bone cavity with DMEM/F12 complete medium into a 50 mL centrifuge tube until the bone cavity appears white.\nSpin at 400 g for 5 min and aspirate the supernatant.\nResuspend the red pellet in room tempered ACK lysis buffer using a 1000 μL pipette.",
    "Use 500 μL ACK lysis buffer/spleen.\nIncubate for 2–3 min and fill with DPBS.\nPass the cells through a 40 μm or 70 μm cell strainer to remove cell clumps and debris. Moisten the cell strainer with DPBS or medium before use.\nSpin at 400 g for 5 min and aspirate the supernatant.\nResuspend the pellet in DMEM/F12 complete medium to get ∼4–6 × 106 cells/mL.\nCount the bone marrow cells with an automated cell counter or a hemocytometer at a 1:10 dilution.\nNote: Proceed with BMDM differentiation and expansion after this step.\nBMDM differentiation and expansion\nTiming: 5–7 days\nOn day 1–3 of differentiation dead floating cells can be observed. Adherent macrophages will become visible on day 3–4 of differentiation. Each 10 cm Petri dish will give ∼8 × 106 BMDMs on day 5 and ∼18 × 106 BMDMs on day 7.\nCritical: Ensure you have bone marrow cells counted and ready for seeding before starting.\nDilute bone marrow cells to a concentration of 0.2–0.25 × 106 cells/mL in 12 mL DMEM/F-12 complete medium supplemented with 20% L929 conditioned medium and seed 12 mL cell suspension per non-adherent 10 cm petri dish.\nNote: Alternative to 20% L929 conditioned medium also 20 ng/mL mouse M-CSF can be added to the medium.\nPerform partial medium change on day 3 and day 5. For long-term culture, repeat every other day.\nCarefully tilt the plate and gently remove 7 mL medium with a serological pipette.\nReplace with fresh DMEM/F-12 complete medium supplemented with 20% L929 conditioned medium to again reach a total volume of 12 mL.\nCritical: Differentiating BMDMs are not firmly attached on day 3. Be careful to aspirate medium from the top.\nAfter 5–7 days, aspirate the medium from the plate. Gently wash the cells 1× with 5 mL DPBS.",
    "Detach macrophages using cold DPBS with 2.5 mM EDTA:\nAdd 5 mL of cold DPBS with 2.5 mM EDTA per plate.\nIncubate for 10–20 min on ice or at 4°C in the fridge.\nGently resuspend detaching cells with a serological pipette and collect them in a 50 mL centrifuge tube. Add additional DPBS + 2.5 mM EDTA to collect remaining cells.\nCentrifuge at 350 g for 5 min and discard the supernatant.\nFlick the pellet and resuspend the cells in required buffer or medium.\nBMDMs show >95% purity 5 days after isolation (Figure 3[href=https://www.wicell.org#fig3]). They might be kept in culture for up to 2 weeks but will become more differentiated and adherent with time. With respect to the seeding concentration in this protocol, BMDMs are recommended to be used 5–7 days after isolation for in vitro and in vivo experiments.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3103-Fig3.jpg\nFigure 3. BMDM proliferation and phenotypic characterization during expansion\n(A) Expansion of BMDMs over time starting from 1 × 106 bone marrow cells. Error bars are based on n = 3 replicates. Mean cell numbers (in ×106) are indicated for each measurement time point.\n(B) Microscopic image of BMDMs on day 5 of expansion. As expected, cells are attached to the plate indicative for a successful differentiation of bone marrow cells to BMDMs. Scale bar is 100 μm.\n(C) Flow cytometry of CD11b+F4/80+ BMDMs on day 3, 5 and 7 of expansion."
  ],
  "subjectAreas": [
    "Immunology",
    "Cell Isolation",
    "Flow Cytometry",
    "Cancer",
    "Cell Culture",
    "Cell Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}