{
  "id": 5466,
  "origin_website": "Bio",
  "title": "Expression and Analysis of Flow-regulated Ion Channels in <em>Xenopus</em> Oocytes",
  "procedures": [
    "Harvesting of ovaries from female Xenopus laevis Anesthetize frogs in a 2-L beaker with anesthetic solution containing 0.15 % (w/v) tricaine methane sulfonate (MS-222) buffered with 0.2 % (w/v) NaHCO3 at room temperature. Frogs are immersed in the anesthetic solution (1 L) for at least 30 min or until lack of response to toe pinch (Figure 1A).Harvest ovaries through a lateral incision in the lower abdominal area. Avoid cutting the abdominal vein that runs through the center of the abdominal region, as it will result in unnecessary bleeding (see Figures 1B and 1C).Place harvested ovaries in a Petri dish containing ~20 ml MBS and incubate at 18 °C in B.O.D. incubator until further use.Euthanize the frog by immersion in the anesthetic solution for 1 h, followed by a thoracotomy and heart removal.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170412/20170412193641_2041.jpgFigure 1. Surgical removal of oocytes. A. Anesthesia depth is evaluated by pinching the toe with a pair of forceps. Surgical procedures are conducted when no withdrawal response to pinch is observed. B and C. Ovaries are harvested through a lateral incision in the lower abdominal area (B) using fine forceps (C).Oocytes isolation and sortingPrepare a collagenase stock (7x) solution by dissolving 21 mg of collagenase type IV and 50 mg of soybean trypsin inhibitor in 2 ml of Ca2+-free SOS.Gently dissociate ovarian lobes in small pieces (0.5-1 cm diameter) with a pair of Dumont size 4 forceps in a Petri dish containing MBS. Transfer ovary fragments to a 50 ml conical tube and wash 3 times with 50 ml of Ca2+-free SOS. To wash the fragments, leave the tube in vertical position until the fragments sink to the bottom, then gently rotate the tube to dump the solution covering the pieces of tissue.",
    "Transfer ~7 ml of washed ovary fragments to a 15 ml conical tube containing 3 ml of Ca2+-free SOS. Add 2 ml of collagenase stock solution to the 15 ml conical tube containing the ovary fragments, fill the tube with Ca2+-free SOS to 14 ml and close the tube.Rotate the tubes containing ovary pieces in the Nutator Mixer at 12 rpm for one hour at room temperature. After 1 h of incubation, use a plastic transfer pipette with a cut tip (~5 mm diameter) to transfer an aliquot of the digest to a Petri dish. Oocyte should be submerged in the solution and not come in contact with air at any time. Visually inspect the oocyte under a stereomicroscope. The digestion with collagenase is completed when oocytes lack most of the extracellular connective tissues and vessels (see Figure 2C). If after 1 h incubation a significant amount of connective tissue and vessels are still visible, extend the incubation for 10 min more, or as required. Take into consideration that excess of collagenase digestion can affect the viability of the oocytes.To remove remaining pieces of connective tissue that might still attached to the oocytes after the collagenase digestion, transfer the oocytes (and solution) from the 15 ml conical tube to a 50 ml conical tube. Leave the tube in vertical position until the oocytes sink to the bottom, then gently rotate the tube and dump the solution covering the oocytes. Fill the tube with 30 ml of hypotonic solution, mix gently and dump the solution covering the oocytes. Repeat the last step twice. Incubate the oocytes with 30 ml of hypotonic solution for 15 min at room temperature on a bench (without agitation).",
    "After the incubation, wash the oocytes three times with MBS and place them in a Petri dish containing MBS. Store the oocytes in the B.O.D. incubator at 18 °C for at least two hours before proceeding to sorting. Select oocyte stage V and VI with the oocytes transferring pipette (see Figure 2E). At these stages of development, oocytes normally have a well-defined belt separating the animal pole (dark) from the vegetal pole (light).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170412/20170412193840_1551.jpgFigure 2. Isolation of Xenopus laevis oocytes. A. Macroscopic view of harvested ovaries; B. Close view of an ovary sac; C. Close view of oocytes after collagenase digestion. Note that some connective tissue and vessels still present in the surface of the oocytes. D. Close view of oocytes after treatment with the hypotonic solution; E. Close view of oocytes at development stages 1-6. Note that stage 5-6 oocytes have a diameter of approximately 1 mm. Oocyte injectioncRNA is produced with a commercial in vitro transcription kit following the supplier directions. We use mMessage mMachine transcription kits from Ambion. Use nuclease free water and nuclease-free tubes and tips to prepare and handle cRNA solutions.Pull injection needles from 3.5” glass capillaries using a single step protocol (one step, heater level 65.1). Cut the tip to a 30° angle with a razor blade. The diameter of the tip of the injection needles should be approximately 50 µm. Note: Injection needles with angled fine tips enable wound healing and increase oocytes survival. Set the injection volume at 50 nl and the injection speed at fast. Fill the injection pipette with mineral oil using a syringe with a 25 G needle. Plug the filled injection pipette in the microinjector and push the mineral oil out with the ‘empty’ bottom (Figure 3A).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170412/20170412194032_4642.jpgFigure 3. Oocytes injection workstation. A.",
    "Injection pipettes made of glass capillaries are used for injection of cRNAs encoding for ion channels and other proteins in Xenopus oocytes. Injection workstation components labeled as follows: 1. Stereo microscope with external light source; 2. Micromanipulator and magnetic holding device; 3. Nanoinjector; 4. Nanoinjector controller. B. Loading of injection needle with cRNA. The injection needle is filled with mineral oil. A drop of the solution containing the cRNA of interest is place in the center of a piece of Parafilm. cRNA solution is collect with the injection pipette using the ‘fill’ bottom in the nanoinjector controller. C. Close view of oocytes aligned in a Petri dish. To prevent rolling during injection, oocytes are placed in a Petri dish with a polypropylene mesh glued to the bottom.Place a square piece of Parafilm (~2 x 2 cm) in the field of view of the stereomicroscope (Figure 3B). Place a drop of the solution containing the cRNA of interest (5-6 µl) in the center of the Parafilm. Collect the cRNA solution with the injection pipette using the ‘fill’ bottom. Press the injection bottom several times to verify that the injection pipette is working properly.Fill the oocyte injection Petri dish with MBS. Transfer 20-40 oocytes from the incubation dish with a polished Pasteur pipet and arrange them in a line in the injection Petri dish (Figure 3C). Move the injection pipette close to the oocytes. Gently impale an oocyte in the center of the animal pole (dark side) and inject the cRNA by pressing the ‘inject’ bottom. Hold the injection pipette for 3-4 sec inside the oocyte. Retract the injection pipette and sequentially inject the next oocyte in the line.Collect the injected oocytes and place them in a 6-well tissue culture plate filled with MBS.",
    "Incubate the oocytes at 18 °C for at least 20 h. The incubation time required for expression depends on the ion channel being studied. Note: For expression of ENaC, 1-2 ng cRNA/subunit is routinely injected and 24-48 h of incubation are required. For other channels, such as C. elegans degenerin channels, 5-10 ng cRNA/subunit are injected and a longer incubation (> 4 days) is required for optimal expression.Flow apparatus and estimation of laminar shear stress rateA software-controlled gravity-fed inflow perfusion system and vacuum-assisted outflow is utilized to perfuse the chamber used for electrophysiological recordings (Figure 4). The apparatus employed to deliver the fluid-shearing flow consist of an L-shaped glass pipette with an inner diameter of 1.8 mm, which is connected to one channel of the perfusion system. The fluid-shearing pipette is made of a 1.8 inner diameter capillary glass. The capillary glass is bent to L-shape (~ 90° angle) with a Bunsen burner. The fluid-shearing pipette is mounted in a three-axis manual micromanipulator in front of the recording chamber (see Figure 5B).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170412/20170412194245_2278.jpgFigure 4. Schematic of the recording chamber and perfusion system used to study flow-regulated ion channels. A home-made (20-mm diameter and 6-mm deep) chamber is used to bath the oocytes. To apply laminar shear stress, a homemade vertical perfusion glass tube (1.8 mm internal diameter) is placed right above the oocytes. Fluid is delivered through the fluid-shearing pipette using a software-controlled gravity perfusion system.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170412/20170412194325_1462.jpgFigure 5. Two-electrode-voltage (TEV) clamp of Xenopus oocytes. View of the two-electrode voltage clamp rig. A. Components are labeled as follows: 1. GeneClamp 500B amplifier and Digidata 1550B; 2. VC-6 PTFE valve perfusion system; 3. Stereo microscope with external light source; 4. Dell OPTIPLEX desktop; 5. Left and right electrode holders, micromanipulators and magnetic holding devices; 6. Fluid-shearing pipette, micromanipulator and magnetic holding device; 7.",
    "Flow valve. B. Close view of the oocyte flow chamber and perfusion system.The rate of laminar shear stress (LSS) on the oocyte surface is estimated as the relation of the drag force (Fdrag) and the surface area of the oocyte, LSS = Fdrag/surface area of the oocyte. The magnitude of the Fdrag is determined according to Fdrag = 0.5 ρAω2Cd, where ρ represents the water density (1 g/cm3), A is the cross-sectional area of the sphere (πr2) (for Xenopus oocytes r = 0.05 cm), ω is the average free stream velocity (flow rate/cross sectional area of the perfusion pipette) and Cd is the drag coefficient (~1 for spheres with a Reynolds number within the 3-25 range). The Reynolds number is determined as, Re = θωD/λ, where θ is the fluid density, ω is the average free stream velocity, D is the sphere diameter and λ is the viscosity of the water. For example, a perfusion rate of 1.5 ml/min is needed to generate a shear stress of 0.12 dynes/cm2 with a fluid-shearing pipette with a diameter of 1.8 mm.Two-electrode voltage clampExperiments are conducted at room temperature (20-25 °C) on a two-electrode voltage clamp rig as shown in Figure 5. Estimate required flow rate to achieve desired rate of LSS as indicated in step D2. Fill the perfusion syringes with TEV solution. Adjust the perfusion rate of the bath solution to ~3 ml/min. Adjust the flow of the fluid-shearing pipette to the desired rate with the flow valve. The flow rate is determined by gravimetry by collecting fluid for a minute in a pre-weighted tube. Alternatively, a flowmeter can be connected in line with the perfusion system to measure the flow rate. Pull recording pipettes from 4” glass capillaries (1.",
    "5 mm) using a two-step protocol with the micropipette puller (set heater level step 1 at 47.2 and step 2 at 62.1). Backfill glass pipettes with 3 M KCl and gently tap them to release air bubbles from the tips.Transfer an injected oocyte to the center of the recording chamber (see Figure 5B). Mount the recording pipettes onto the left and right electrode holders. With the amplifier in the setup mode, carefully place the recording pipettes in the chamber to measure their resistance in the TEV solution. Note: The resistances of the pipettes should be between 0.2-2 mΩ. Pipettes with resistances < 0.1 mΩ are considered leaky and should be replaced.Adjust the offset of the recording electrodes to zero.Move the recording electrodes close to the oocyte by altering the X-Y-Z knobs of the micromanipulator. Gently impale the oocyte with the recording electrodes using the Z knob. The fluid-shearing pipette should be visible with the stereo microscope. Using the stereo microscope, position the tip of the fluid-shearing pipette directly above the oocyte. Carefully move the fluid-shearing pipette down within 0.5-1.0 mm of top of the oocyte.Set the amplifier to voltage-clamp mode. For ENaC, currents are continuously recorded at a membrane potential at -60 mV. The perfusion system is controlled with external TTL signals using pClamp 10. During the recordings, the chamber is continuously perfused with TEV solution. Pulse of fluid are applied through the fluid-shearing pipette. Usually, we record currents with bath perfusion for the first 30 sec, we apply fluid shear stress for 60 sec or until the current plateaus, and then we perfuse the chamber with a TEV solution containing benzamil (5 μM) for 30 sec to determine the leak current.",
    "To examine the voltage-dependence of the flow-activated component, whole cell currents are measured using a series of voltage steps (e.g., 500 msec) from -140 to 60 mV under basal conditions, in the presence of fluid shear stress and after perfusion with a channel inhibitor (see Carattino et al., 2006 for details). At the end of the experiment, move the fluid-shearing pipette to the initial position, remove the recording pipettes from the oocytes and discard the oocyte. Note: Benzamil or other channel blockers used during the experiments must be washed off by flushing TEV solution in the bath and vertical tube for at least 3 min."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}