{
  "id": 2548,
  "origin_website": "Cell",
  "title": "Mass spectrometry analysis of affinity-purified cytoplasmic translation initiation complexes from human and fly cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nImmuno-affinity purification of FLAG-tagged human 5MP1 (h5MP1) and its binding partners\nTiming: 4 days (1 h for step 1; 1 h for step 2; 5 h for step 3)\nDay 1\nSeed HEK293T in 10-cm dishes.\nTake a cryogenic vial of HEK293T and thaw at 37°C.\nSpin 1,500 rpm for 3 min at room temperature.\nRemove supernatant and wash the cells with 5 mL PBS to remove DMSO, which is toxic to many cultured cells.\nPellet down the cells by centrifuging 1,500 rpm for 3 min at room temperature and aspirate the supernatant. Suspend cells with 0.5 mL of DMEM/10% FBS/PenStrep and seed them in a 10-cm dish with 10 mL of the same medium at ∼25% confluency which is around 2.5 million cells.\nIncubate cells at 37°C, 5% CO2; 4 passages are recommended for the cells to fully recover from cryogenic freezing before performing transfection.\nNote: Cryogenic vial of HEK293T cells is typically made from ∼80-90% confluent cells/10-cm dish and each vial contains 2.5 million viable cells in 1 mL stock medium (DMEM/10% FBS/PennStrep with 10% DMSO).\nDay 2\nTransfection of HEK293T with pET-h5MP1 or mutant DNA.\nMake solution A with 500 μL 0.15 M NaCl and 8 μg DNA.\nMake master mix solution B with 500 μL × n 0.15 M NaCl and 40 μL × n 1 mg/mL PEI (n = number of transfection).\nDistribute 0.5 mL solution B to each tube with solution A and vortex the tube.\nIncubate 20–30 min at room temperature.\nReplace the media 2 h prior to transfection with 10 mL of fresh media for cells to be transfected.\nAdd the mixture to cells in a 10-cm dish with 30%–50% confluent cells which is around 300K–500K cells per mL.\nIncubate cells at 37°C, 5% CO2.",
    "Note: It is recommended to have at least one negative control with empty expression vector transfection (n>2).\nNote: DNA is purified from an E. coli strain (such as DH5α) carrying the desired plasmid, using a commercially available endotoxin-free mid-scale plasmid preparation kit (such as PureyieldTM Plasmid Midiprep System). See troubleshooting[href=https://www.wicell.org#troubleshooting] below.\nDay 4\nAnti FLAG-affinity purification. Harvest cells 42–48 h after transfection.\nPrepare the anti-FLAG affinity resin by removing 40 μL of anti-FLAG M2 affinity gel 40 μL per plate and wash with 10× bed volume of FLAG-AP stock buffer twice (spin at 5,000 rpm, 4°C, 1 min).\n(In the culture room and clean bench) Wash plates with ice-cold 5 mL PBS and remove PBS.\nTake out the plates from the clean bench and place them directly onto ice.\nAdd 0.5 mL FLAG-AP buffer per plate.\nMove the materials on ice to the lab.\nCollect cells in the lysis buffer with a scraper and pipettman. Move the cells into a ice-cold 1.5-mL microcentrifuge tube and leave it on ice for 10 min.\nSpin cells at 15,000 rpm at 4°C for 20 min.\nCollect supernatant fraction after the centrifugation as “In-put” fraction. Save ∼1% portion for diagnostic analyses. Add the remainder to the tube containing the washed anti-FLAG resin.\nIncubate at 4°C for 90 min, rotating.\nSpin the tube at 4,000 rpm at 4°C, 1 min.\nRemove sup carefully using P200 pipette without disturbing the pelleted resin Keep sup from empty vector control transfection (c-sup) for the FLAG eluate clean-up step No. 4 (see next).\nWash with 0.5 mL FLAG-AP buffer (spin as above).\nWash with 0.2 mL FLAG-AP buffer (spin as above).\nElute with 30 μL FLAG elution buffer by incubating at 4°C for 20 min, rotating.\nSpin the tube as step i and keep the eluate.",
    "Elute with 20 μL FLAG elution buffer by incubating at 4°C for 10 min, rotating.\nSpin the tube as step i and combine the eluate with that from step n.\nImmediately proceed to FLAG eluate cleanup below.\nNote: Diagnostic analysis is meant to check the h5MP1 expression level and molecular weight size confirmation through western blot.\nFLAG eluate cleanup. This process removes any contaminating antibodies through incubation with Protein A Sepharose, while keeping original associated proteins in solution. To ensure the latter, the Protein A Sepharose is pre-coated with cell lysate proteins in the supernatant fraction from step 3-j. In order to avoid possible contamination of control proteins, it is recommended to wash the resin twice. The pre-coated step is required to avoid loss of any specific proteins from the experimental samples by binding on the resin.\nWeigh 0.025 × n g Protein A Sepharose CL-4B in a tube and add 25 × n μL di water.\nSwirl the resin, rotating, for 5 min at room temperature.\nSpin the tube at 4,000 rpm at 4°C, 1 min and discard the supernatant.\nWash with 100 × n μL FLAG AP stock buffer.\nAdd 100 × n μL control supernatant (c-sup) from above to the washed total resin.\nIncubate for 20 min at 4°C, rotating.\nWash with 100 × n μL FLAG AP stock buffer twice.\nIn the last wash, split the resin to the number of eluates in a 1.5-mL microcentrifuge tube.\nAdd the FLAG eluate from above to the tube with the coated resin.\nIncubate for 20 min at 4°C, rotating.\nSpin as above and recover sup as the final product.\nImmuno-affinity purification of FLAG-tagged fly 5MP (Kra) and its binding partners\nTiming: 4 days (1 h for step 5; 1 h for step 6; 5 h for step 7)",
    "Day 1\nSeed S2 cells in 6-well plate.\nTake a cryogenic vial of S2 cell stock and thaw at 28°C.\nSpin 1,000 rpm for 3 min at room temperature.\nRemove supernatant.\nWash the cells using 5 mL PBS to remove DMSO, which is toxic to many cultured cells.\nUse same parameter as in step b above for centrifugation.\nSuspend cells in 0.5 mL of Schneider’s Drosophila Medium supplemented with 10% heat-inactivated FBS and PennStrep; and seed them in a 6-well plate with 2.5 mL of the same medium at a density of 6 × 105 cells/mL.\nIncubate cells at 28°C.\nNote: Prior to transfection, it is suggested to passage the culture at least 3 times so that the cells reached enough time to recover from the effects of cryogenic storage. Frozen S2 cell stocks are typically made from ∼6 × 106 cells/mL grown in a 25 cm2 flask and each cryovials contains 1 mL of 2 × 106 cells/mL.\nDay 2\nTransfection of S2 with pAC-h5MP1 or mutant DNA.\nWarm up serum-free S2 medium, TransIT-Insect reagent and plasmids at room temperature. Vortex gently the TransIT-Insect reagent and leave it at the room temperature.\nTake 250 μL of serum-free medium and add 3 μg of DNA for each transfection and mix by pipetting.\nDrop slowly 5 μL of TransIT-Insect reagent and mix by pipetting.\nIncubate for 30 min at room temperature.\nAdd the mixture drop-wise to cells spreading out evenly in each of the 6-well plate.\nIncubate cells at 28°C for 48 h.\nNote: It is recommended to have at least one negative control with empty expression vector transfection (n≥2).",
    "DNA used for transfections is purified from an E. coli strain (such as DH5α) carrying the desired plasmid, using a commercially available endotoxin-free mid-scale plasmid preparation kit (such as PureyieldTM Plasmid Midiprep System). See troubleshooting[href=https://www.wicell.org#troubleshooting] below.\nAnti FLAG-affinity purification. Day 4 The following procedure is followed almost the same as the above HEK293T protocol: Prepare the anti-FLAG affinity resin:\nTake anti-FLAG M2 affinity gel 30 μL per well.\nWash with 10× bed volume of FLAG-AP stock buffer twice (spin at 5,000 rpm, 4°C, 1 min). Harvest cells 42–48 h after transfection; at this time the transfection efficiency should be above 80%.\n(In the culture room and clean bench) Wash wells with 3 mL PBS and remove PBS.\nTake out the plates from the clean bench and place them directly onto ice.\nAdd 0.5 mL FLAG-AP buffer per plate.\nMove the materials on ice to the lab.\nTransfer the cells into a 1.5-mL microcentrifuge tube.\nSpin cells at 15,000 rpm at 4°C for 20 min.\nCollect supernatant fraction as “In-put” fraction. Save ∼1% portion for diagnostic analyses. Add the remainder to the tube containing the washed anti-FLAG resin.\nIncubate at 4°C for 90 min, rotating.\nSpin the tube at 4,000 rpm at 4°C, 1 min.\nRemove sup. Keep sup from empty vector control transfection (c-sup) for the FLAG eluate clean-up (see next).\nWash with 0.5 mL FLAG-AP buffer (spin as above).\nWash with 0.2 mL FLAG-AP buffer (spin as above).\nElute with 30 μL FLAG elution buffer by incubating at 4°C for 20 min, rotating.\nSpin the tube as step v and keep the eluate.\nElute with 20 μL FLAG elution buffer by incubating at 4°C for 10 min, rotating.\nSpin the tube as step c and combine the eluate with that from step h.",
    "Immediately proceed to FLAG eluate cleanup exactly as step 4 of human 5MP1 complex purification described above.\nWhole-lane mass-spectrometry analysis of the affinity-purified products after SDS-PAGE\nTiming: 4 days (4 h for step 8; 12 h for step 9; 2 h for step 10; 3-4 days for step 11)\nDay 1\nSDS-PAGE and silver staining.\nAnalyze 15 μL (30%) of eluted fractions along with control samples (e.g., whole cell lysate or purified proteins) on 15% SDS-PAGE gel.\nSilver-stain the gel. The following describes the outline protocol using the Silver Staining kit from Wako. (MS-compatible kit must be used, to avoid glutaraldehyde).\nIncubate the SDS-PAGE gel in Fixing Solution 1 for 10 min.\nContinue with the fixing using Fixing Solution 2 for 10 min, and soak the gel in the Enhancing solution for 10 min.\nWash twice with DI water for 5 min each time.\nStain the gel with the provided Staining Solution by shaking for 20 min.\nRinse the gel three times for 5 min each.\nAdd Developing solution and shake for few minutes until the bands appear. Do not overstain the gel.\nUse the provided Stopper Solution to avoid overstaining and wash the gel three time using di water for 2 min each (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2052-Fig1.jpg\nFigure 1. To excise the whole lane of the gel into 12 pieces\n(A) Original gel. M, a size standard; 1 and 2, vector controls; 3 and 4, WT h5MP1.\n(B) The excised gel strips separated from each lane. Lanes 1–4, same as in panel A.\n(C) The cut gel pieces.\n(D) Gel pieces were diced into cubes with approximately 1 mm dimension.\nThe gel now can be stored at 4°C.\nDay 2\nIn-gel digestion.",
    "Excise the whole lane of the gel into 12–16 pieces with a razor blade, according to the size standards and staining patterns (Figures 1[href=https://www.wicell.org#fig1]B and 1C).\nNote: The gel is cut on the fresh sheet of OHP film (KOKUYO). Before using the OHP sheet and scalpel (Knife holder No.3, Substitute edge No.11: FRIGZ, Kai Corp.), wipe off twice with methanol (FUJIFILM Wako Pure Chemical) and distilled water (FUJIFILM Wako Pure Chemical), respectively. OHP film sheet is a normal type without treatment for printing with inkjet.\nNote: It is no problem even if the gel breaks a little (see Figure 1[href=https://www.wicell.org#fig1]A). It is important to return the broken part to the original position. Then, cut the gel.\nCut the gel piece approximately 1 mm sized cubes, to facilitate in-gel trypsin digestion. The gel pieces (cubes) are transferred to a 1.5-mL Protein LoBind micro-tube (Eppendorf) (Figure 1[href=https://www.wicell.org#fig1]D).\nAdd 200 μL ultrapure water, shake for 10 min at room temperature with the Maximizer MBR-022UP (TAITEC Corp.) (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2052-Fig2.jpg\nFigure 2. In-gel digestion and dehydration\n(A) Samples are consistently shaken by the Maximizer MBR-022UP in the pre-processing for in-gel digestion.\n(B) Dehydration by a centrifugal evaporator.\n(C) The maximizer MBR-022UP is covered with aluminum foil to avoid light in step r.\nNote: Unless otherwise stated, the incubation processes during the pre-processing and subsequent in-gel digestion steps are performed in the Maximizer MBR-022UP at the speed of 900 rpm.\nSpin down, and remove the supernatant.\nAdd 200 μL ultrapure water, and shake for 10 min at room temperature.\nNote: The gel pieces of 1.5 mL tube can store at 4°C for 1 week at this step prior to proceeding to step f.\nSpin down, and remove the supernatant.",
    "De-stain the sliver-stained protein band of gel pieces (cubes) with 300 μL mixture of De-staining solution A and De-staining solution B (Silver stain MS kit, FUJIFILM Wako Pure Chemical) in equal quantity for 20 min.\nSpin-down, and remove the supernatant.\nWash the gel with 200 μL of ultrapure water for 10 min at 25°C.\nSpin down, and remove the supernatant. Repeat washing in steps i-j twice more.\nDehydrate the washed pieces with 150 μL of acetonitrile (FUJIFILM Wako Pure Chemical) for 10 min.\nSpin down, and remove the supernatant.\nSubsequently, dehydrate the gel pieces with a centrifugal evaporator (Centrifugal concentrator CC-105: TOMY Seiko, TOMY digital biology) for 15 min (Figures 2[href=https://www.wicell.org#fig2]B and 2C).\nReduce proteins in the gel pieces with 200 μL of 10 mM DTT (Thermo Fisher Scientific) in 25 mM ammonium bicarbonate (FUJIFILM Wako Pure Chemical) for 60 min at 56°C.\nSpin down, and remove the supernatant.\nWash the gel pieces with 100 μL of 25 mM ammonium bicarbonate for 10 min at 25°C.\nSpin down, and remove the supernatant.\nAlkylate proteins of the gel pieces with 95–100 μL of 55 mM iodoacetamide (Thermo Fisher Scientific) in 25 mM ammonium bicarbonate for 45 min at 25°C in the dark (protect from light with aluminum foil) (Figure 2[href=https://www.wicell.org#fig2]C).\nSpin down, and remove the supernatant.\nWash the gel pieces with 100 μL of 25 mM ammonium bicarbonate for 10 min at 25°C.\nSpin down, and remove the supernatant.\nDehydrate with 200 μL of 25 mM ammonium bicarbonate, 50% acetonitrile for 10 min (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2052-Fig3.jpg\nFigure 3. Dehydration of gel pieces and in-gel digestion\n(A–C) The gel pieces dehydrated with (A) 50% acetonitrile followed by (B) a centrifugal evaporator were subjected for in-gel digestion on ice (C).\nSpin down, and remove the supernatant. Repeat steps v-w once more.",
    "Subsequently, the gel pieces are dehydrated with a centrifugal evaporator for 15 min (Figure 3[href=https://www.wicell.org#fig3]B).\nIn-gel digestion: Add 30 μL of 20 ng/μL trypsin and lysyl endopeptidase (Promega) in a buffer containing 40 mM ammonium bicarbonate, pH 8.0. Incubate for 1–1.5 h on ice (Figure 3[href=https://www.wicell.org#fig3]C).\nNote: Wait for the gel pieces to swell with a solution of trypsin and lysyl endopeptidase. If the gel does not swell, add small amounts of 40 mM ammonium bicarbonate buffer to the gel pieces and wait for them to swell. If necessary, repeat this several times until the gel swells.\nSupplement the gel pieces (cubes) with 40 mM ammonium bicarbonate buffer.\nIncubate overnight at 37°C, at the speed of 600 rpm.\nDay 3\nPost-digestion processing.\nExtract the digested peptides from gel pieces with 50 μL of 50% acetonitrile, 0.1% formic acid (FUJIFILM Wako Pure Chemical) for 30 min at 25°C and incubate the reaction in the Maximizer MBR-022UP at 1,300 rpm.\nSpin down, and transfer the supernatant to a fresh 1.5 mL Protein LoBind micro-tube.\nExtract once more with 50 μL of 70% acetonitrile, 0.1% formic acid and incubate for 30 min as in step bb.\nSpin down, and combine the supernatant with the supernatant from step cc.\nConcentrate the combined supernatants to 15 μL with a centrifugal evaporator.\nNote: The concentrated samples can store at 4°C–5°C for 1 week until LC-MS/MS analysis. Before applying to LCMS analysis, the concentrated sample was centrifuged at the speed of 12,000 rpm (13,000 × g) for 10 min at 4°C with High Speed Refrigerated Micro Centrifuge MX-107(TOMY Seiko, TOMY digital biology) for preventing small gel fragments from getting into the HPLC system in subsequent steps.\nLC-MS/MS analysis.",
    "Dilute the concentrated samples 2-fold with 2% acetonitrile, 0.1% trifluoroacetic acid (FUJIFILM Wako Pure Chemical), and then transfer to a fresh autosampler’s vial.\nApply the diluted sample to LC-MS/MS analysis (10 μL/injection) (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2052-Fig4.jpg\nFigure 4. LC-MS/MS analysis\n(A) Set sample vials on autosampler for LC-MS/MS analysis.\n(B) The overview of Advance UHPLC system coupled to a Q Exactive mass spectrometer.\n(C) Profile of Top-10 DDA on Xcalibur/Tune.\n(D) Advance Captive Spray Ionization probe.\n(E) PAL HTS-xt autosampler and time table of continuous injection/acquisition.\nAnalyze on an Advance UHPLC system (AMR/Michrom Bioresources) coupled to a Q Exactive mass spectrometer (Thermo Fisher Scientific) (Figure 4[href=https://www.wicell.org#fig4]B).\nThe injected sample is trapped on a pre-column (L-column 2 ODS, 5 μm, 0.3 × 5 mm, cartridge trap column, CERI), and then de-salted and concentrated. Equilibration, de-salt and concentration were performed with 2% acetonitrile, 0.1% trifluoroacetic acid.\nThe concentrated peptides are separated on micro-ODS column (L-column 2 ODS, 3 μm, 0.1 × 150 mm, PEEK-steeved type, CERI), at 40°C, flow rate 500 nL/min.\nMobile phase A is (ultrapure water, 0.1% formic acid), while mobile phase B is (acetonitrile, 0.1% formic acid).\nThe eluent gradient is set to 5%–45% Phase B/0–20 min, 45%–95% Phase B/20–25 min, 95% Phase B/25–35 min (wash), 95-5% Phase B/35–36 min, and 5% Phase B/36–45 min (equilibration).\nSetting for MS and MS/MS acquisitions: MS range is m/z 350–2,000, resolution 70,000, positive mode. MS/MS spectra are acquired according for using a Top-10 DDA (data-dependent acquisition), resolution 17,500, high-energy collision dissociation value 27 (Figure 4[href=https://www.wicell.org#fig4]C). ESI spray: Advance Captive Spray Ionization probe (AMR/Bruker, Figure 4[href=https://www.wicell.org#fig4]D), 1,400 V, 250°C, 500 nL/min.\nPerform continuous injection with auto-sampler (PAL HTS-xt, AMR/CLC Analytic AG), which links to a Xcalibur/Tune (Thermo Fisher Scientific) operating software to process the raw LC-MS/MS data (mass spectra) (Figure 4[href=https://www.wicell.org#fig4]E).",
    "Analyze the raw LC-MS/MS data using Proteome Discoverer version 1.4 (Thermo Fisher Scientific) with the Mascot search engine version 2.5–2.7 (Matrix Science) (Figure 5[href=https://www.wicell.org#fig5]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2052-Fig5.jpg\nFigure 5. Data analysis\n(A) Work-flow of data analysis with Proteome Discoverer.\n(B) Quantitative analysis setting on Scaffold 4.8.4.\nProtein database: SwissProt or Uniprot restricted to Homo sapiens or Drosophila melanogaster.\nParameter for analysis: carbamidomethylation of Cys is selected as fixed modification. Oxidation of Met, deamidation of Asn, and deamidation of Gln are selected as variable modification. A precursor mass tolerance is 10 ppm and a fragment ion mass tolerance is 0.02 Da. Max missed cleavages: 2. Digestion enzyme: Trypsin.\nA decoy database comprised of either randomized or reversed sequences in the target database is used for false discovery rate (FDR) estimation, and Percolator algorithm is used to evaluate false positives. Search results are filtered against 1% global FDR for high confidence level.\nFurther analyze using Scaffold 4.8.4 (Proteome Software Inc.) for calculating emPAI values (Figure 5[href=https://www.wicell.org#fig5]B).\nQuantitative Analysis Setup: not to use normalization; Quantitative method, emPAI; Protein Threshold; 1.0%FDR; Min#peptides, 2; Peptide Threshold, 95%.\nNote: The emPAI is defined by (10PAI – 1) where PAI, or Protein Abundance Index, is the number of observed peptides divided by the number of observable peptides per protein. If we use normalization in step e, the sum of emPAI values computed from each gel slice does not match the emPAI value computed from the sum of peptide count from each gel slices. On the other hand, these values match well if we do not use normalization. Thus, do not use normalization in the setup."
  ],
  "subjectAreas": [
    "Bioinformatics",
    "Biotechnology And Bioengineering",
    "Cell Culture",
    "Mass Spectrometry",
    "Protein Expression And Purification",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology"
  ]
}