{
  "id": 1694,
  "origin_website": "Cell",
  "title": "Marker-based assays for studying gut transit in gnotobiotic and conventional mouse models",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nNote: These experiments can be conducted on conventional or gnotobiotic mice (germ-free or colonized). For guidance on working with gnotobiotic mice, please see (Zucoloto et al., 2021[href=https://www.wicell.org#bib4]).\nNote: Careful consideration of sample size accounting for covariates of interest is recommended. To sufficiently power your study, consider performing a pilot study to determine effect sizes.\nCarmine red dye assay—Part 1\nTiming: 2–8 h (conventional mice have shorter transit times, while germ-free mice have longer transit times)\nWhole gut transit times can be quantified by administering the 6% carmine solution via oral gavage using a 1 mL syringe attached to a feeding needle and recording time to passage in the fecal stream. If working in the gnotobiotic setting, additional sterilization techniques should be followed during the carmine gavage and fecal observation (e.g., sterilization of the fume hood, cage, equipment, and reagents), and a sterile gown and gloves should be worn by research staff.\nGavage each mouse with 150 μL of 6% carmine solution and record the time of administration.\nNote: It may be helpful to mark the tail of each mouse with a sequential number using a marker for easy identification (e.g. I, II, III, etc).\nPause point: Given that whole gut transit times are typically ≥2 h after carmine gavage, a 2-h pause can be instituted prior to the first time point at which fecal pellets are examined.\nObtain fresh fecal pellets.\nTransfer each mouse individually into a sterile beaker or sterile plastic container (e.g., empty 1000 μL pipette tip box cleaned with 70% w/v ethanol) until a fecal pellet is produced.\nImmediately after the production of a fecal pellet, return the mouse to its cage.",
    "Note: It is helpful to cover the container with a weighted lid to minimize the risk of a mouse escaping. If no fecal pellets are seen within 5 min, it is reasonable to return the mouse to its cage and repeat this step in 5–10 min.\nAssess fecal pellets for passage of red dye.\nRecord all times at which assessments are made, including documentation of whether fecal pellets are produced and whether red carmine dye is seen at those times.\nIf the pellet contains NO red color, continue to repeat the observation every 20–30 min until a red pellet is seen. If the pellet clearly contains red dye, no further observations are required.\nOptional: Smear fecal pellets on white tissue if there is a question of whether carmine passed, as this permits easier visualization.\nWhole gut transit time is calculated as the time interval between the gavage and the first observed red fecal pellet. A fecal pellet that is partially red may constitute a red pellet if the red color is carefully examined and convincingly felt to represent carmine dye.\nCritical: If studying gnotobiotic mice, then the beaker or plastic container used to observe mice must first be sterilized (e.g. via autoclave). Containers should NOT be shared by mice harboring different microbiota.\nNote: We grant mice ad libitum access to food and water during the red carmine assay as it typically takes greater than 2 h and up to 8 h (particularly in gnotobiotic mice) to complete. If necessary, researchers can consider a standardized period of fasting, but the impacts of prolonged fasting on mouse health must be carefully considered.\nNote: We do NOT squeeze or apply pressure to the mouse abdomen to stimulate passage of fecal pellets, as stress also influences gut transit.",
    "Note: Typically, the time to clearance is not recorded for practical reasons, as it can take >1 day; however, this could be considered with extended observation or through video monitoring of cages. “Time to clearance” is defined as the amount of time it takes for carmine to be passed in its entirety (i.e., the duration required for fecal pellets to no longer be red).\nNote: Transit times are sensitive to time of carmine gavage and the light/dark cycle; therefore, if intending to compare between cohorts, it is essential to standardize one’s protocol. We administer carmine between 8:00 and 8:30 AM local time. If needed, limit the number of mice that you are testing on a given day.\nIntra-colonic administration of bile acids (or other metabolites or treatments of interest)—Part 2 (optional)\nTiming: 0.5–1.5 h\nTreatments of interest can be administered via intra-colonic infusion to characterize effects on the distal colon. Intra-colonic infusions are paired with the carmine red dye assay (Part 1) to quantify the effects of infusions on whole gut transit times. We have performed this in conventional mice only. Gnotobiotic mice will require additional sterility precautions not described here. Although we have not used it as such, this could potentially be paired with a rectal bead expulsion assay (Soret et al., 2010[href=https://www.wicell.org#bib3]).\nCritical: Evaluate the safety and potential toxicity of administered substances prior to administration. Safety considerations should be given for both the mice and personnel administering the metabolites. All substances should be approved by the biosafety committee and animal ethics committee prior to use.\nCritical: The timing of when to administer the metabolites of interest depends on how long the metabolites take to exert a physiologic effect and their half-life.\nCritical: Select the appropriate controls for your experimental infusions (e.g. vehicle-only control).",
    "Critical: Since the carmine red dye assay is sensitive to the time of day at which it is performed and the light/dark cycle, it is essential that intra-colonic infusions and carmine gavages are performed as uniformly as possible (i.e., at the same times and intervals) across treatment groups.\nAttach a feeding needle to a 1 mL syringe and aspirate 400 μL of infusion media. To minimize discomfort, apply a layer of petroleum jelly to the needle with a sterile Q-tip. Ensure the needle tip is covered.\nCarefully remove one mouse from the cage and place into the restrainer (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1153-Fig1.jpg\nFigure 1. Mouse restrainer\n(A) Image of unoccupied mouse restrainer.\n(B) Example of mouse inside restrainer\nNote: Permitting time for the mouse to first pass fecal pellets will minimize rectal leakage when administering the infusion.\nApply petroleum jelly to the anus of mouse with a sterile Q-tip and slowly insert feeding needle 5 mm into the rectum. The tip of the needle is 5 mm; thus, stop pushing when the tip is fully inserted.\nSlowly infuse 400 μL of infusion media into the rectum and carefully remove the needle. Maintain the mouse in Trendelenburg position for several seconds.\nNote: Perform this procedure quickly to avoid the mouse from moving or turning around in the restrainer.\nPlace the mouse into a clean cage for recovery. Monitor the mouse’s condition according to institutional safety operating procedures.\nRepeat steps 5–9 for remaining mice.\nCritical: Call veterinary services, such as the Animal Welfare and Compliance Officer or Veterinarian, if any bleeding from the anus is observed.\nOptional: Repeat carmine and intra-colonic infusions as needed to characterize the effect of different metabolites on distal colonic transit. For studying additional treatments, we advise intervals of ≥72 h between intra-colonic infusions.\nFITC-dextran assay—Part 3",
    "Timing: 3–5 h\nCharacterization of intestinal distribution of an orally delivered fluorophore permits spatial resolution of gut transit. This step must be done after measuring transit times with carmine as it requires euthanization. Auto-florescence can be impacted by diet; therefore, it is important to perform a pilot experiment characterizing the impact of the mouse chow being used by quantifying fluorescence in mice not receiving FITC-dextran. Gnotobiotic mice will require additional sterilization precautions during the FITC gavage such as sterilization of the fume hood, cage, equipment, and reagents; additionally, a sterile gown and gloves should be worn by research staff.\nGavage each mouse with 200 μL of 5 mg/mL FITC-dextran.\nNote: It may be helpful to mark the tail of each mouse with a sequential number using a marker for easy identification (e.g. I, II, III, etc).\nPause point: Given that there needs to be sufficient time to conduct the flushes described in step 15, we recommend an interval of 20–30 min between FITC-dextran gavages (i.e., between mice).\nNote: It is helpful to set up the dissection equipment during one of the pause points. Supplies will vary depending on what samples are collected, but the following are required for FITC flushes: a dissection board, two 100 mL beakers of cold PBS for motility inhibition and FITC flushing, a 5 mL syringe, feeding needle, and twelve 5 mL Eppendorf tubes per mouse (1 per gut segment) labelled 1–12.\nEuthanize mice one at a time using your institutionally approved protocol.\nRemove the gastrointestinal tract from stomach to the rectum and place in ice cold 1× PBS for 30 s to inhibit motility.\nUsing a razor or scalpel, divide the entire GI tract into 12 segments, according to the following list (Figure 2[href=https://www.wicell.org#fig2]):\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1153-Fig2.jpg\nFigure 2. Dissection of mouse gastrointestinal tracts",
    "(A) Example of a conventional mouse GI tract with each gut segment cut and labelled.\n(B) Example of germ-free mouse GI tract, notable for enlarged cecum.\nSI, small intestine, numbers indicate segment: 1 = most proximal, 8 = most distal.\nStomach.\nSmall intestine (divided into 8 segments, numbered from proximal to distal).\nColon (divided into cecum, proximal, and distal colon).\nNote: We numbered the segments from proximal to distal with the stomach as segment 1 and the distal colon as 12. Any numbering system will work, but the researcher should plan this out ahead of time.\nFlush each gut segment:\nFirst draw 2 mL of ice cold 1× PBS into a 5 mL syringe attached to a feeding needle.\nThen, using forceps, pick up each gut segment and align directly above its corresponding 5 mL Eppendorf tube (e.g., the distal colon contents will be flushed into tube #12).\nFinally, insert feeding needle into one end of the gut segment and slowly flush contents with PBS into the 5 mL Eppendorf tube. Withdraw feeding needle when flush is complete.\nClose and shake Eppendorf tube to mix contents.\nRepeat for each of the 12 gut segments. For more guidance, see Figure 3[href=https://www.wicell.org#fig3].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1153-Fig3.jpg\nFigure 3. FITC-dextran flush procedure\n(A) Example of a mouse GI tract with each gut segment cut and labelled along with corresponding tubes labelled 1–12.\n(B) Diagram of how to flush gut segment.\nSI, small intestine, numbers indicate segment: 1 = most proximal, 8 = most distal.\nOnce all segments are flushed, immediately store samples in their proper conditions. Wrap Eppendorf tubes in aluminum foil, and store at 4°C or on ice until FITC is quantified.",
    "Critical: Storage conditions are important to preserve fluorescence. When flushes are complete, wrap Eppendorf tubes in aluminum foil to limit the exposure to light, and store at 4°C or on ice.\nPause point: Depending on the time between FITC gavages and the experience level of the researcher, there may be a 10–20-min gap between flushes. This is a good time to clean up the dissection board, store samples in the proper conditions, and prepare for the next mouse.\nFinish flushing procedures for all remaining mice before processing samples.\nCritical: Fluorescence in flush contents should be quantified immediately after completing all flushes to ensure accurate detection of FITC.\nProcess samples for fluorescence quantitation:\nTransfer 110 μL of FITC flush contents into an opaque black 96-well plate. If using the suggested plate organization shown in Table 1[href=https://www.wicell.org#tbl1], flushes should be aliquoted into columns 1 and 7.\ntable:files/protocols_protocol_1153_4.csv\nDC, distal colon; PC, proximal colon; SI, small intestine, numbers indicate segment: 1 = most proximal, 8 = most distal. Ratios represent the serial dilution. 0.05 mg/mL FITC is positive control to quantify absolute amount of FIT in each intestinal segment. 1×PBS is negative control.\nPerform a 1:10 dilution series as per Table 1[href=https://www.wicell.org#tbl1]:\nAliquot 90 μL of 1× PBS into each empty well of columns 2–6 and 8–12.\nThen perform a serial dilution, starting with 10 μL in columns 1 and 7, and stopping at columns 6 and 12, respectively. This is best performed using a multi-channel pipette.\nRemove 10 μL from 1:100,000 wells, columns 6 and 12.\nQuantitate fluorescent signal using a plate reader. We use a BioTek Synergy 2 (excitation at 485/20 nm, emission at 530/20 nm).\nNote: Plate replicates are recommended. We typically perform triplicates.",
    "Note: To establish the limits of detection for FITC, we made 10-fold dilution series using different starting concentrations of FITC-dextran (e.g. 1 mg/mL, 0.1 mg/mL, 0.01 mg/mL vs. 0.5 mg/mL, 0.05 mg/mL, 0.05 mg/mL). We found that measurements from a ten-fold dilution series starting at 0.05 mg/mL were linear (R > 0.99, R2 > 0.99) and captured the range of values we observed in samples from GI tract flushes."
  ],
  "subjectAreas": [
    "Model Organisms",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}