{
  "id": 17899,
  "origin_website": "Jove",
  "title": "X-Ray Crystallography to Study the Oligomeric State Transition of the Thermotoga maritima M42 Aminopeptidase TmPep1050",
  "procedures": [
    "1. Production and purification of recombinant TmPep1050\nNOTE: Hereafter are described the cloning procedure and purification of wild-type TmPep1050 adapted from a previous study11. Alternatively, the cloning can be done using a synthetic gene. To generate TmPep1050 variants, site directed mutagenesis can be performed following, for instance, the single-primer reactions in parallel protocol (SPRINP) method30. The purification protocol can be used for TmPep1050 variants. The use of His-tag should be avoided as it interferes with metal ion binding.\nExpression vector design\n\t\nAcquire genomic DNA of Thermotoga maritima MSB8 (ATCC 43589) or TmCD00089984 (Joint Center for Structural Genomics).\nAmplify TM_1050 open reading frame (ORF) using either genomic DNA or template plasmid, a high-fidelity DNA polymerase, and the following primers: ocej419 (5’- TTTAACTTTAAGAAGGAGATATACATACCCATGAAGGAACTGATCAGAAAGCTG) and ocej420 (5’- ATCCGCCAAAACAGCCAAGCTGGAGACCGTTTACGCCCCCAGATACCTGATGAG). Run the polymerase chain reaction (PCR) screening according to the following scheme: 5 min at 95 °C, 30 cycles of 3 steps (30 s at 95 °C, 30 s at 55 °C, 90 s at 72 °C), and 10 min at 72 °C as the final step.\nClone the PCR fragment into a suitable expression vector (Table of Materials) by homologous recombination (Figure 1) in E. coli according to the SLiCE protocol31. To 50 ng of linearized vector, add PCR fragment in a 10:1 molar ratio of fragment to vector, 1 µL of PPY strain extract, 50 mM Tris-HCl pH 7.5, 100 mM MgCl2, 10 mM ATP, and 10 mM dithiothreitol (DTT) for a reaction volume of 10 µL. Incubate for 1 h at 37 °C.\nTransform chemically competent E. coli XL1 blue strain (or any recA- suitable strain) with 1 µL of recombination reaction. Plate the cells on LB medium containing 100 µg/mL ampicillin. Incubate the plates overnight at 37 °C.",
    "Pick colonies on fresh LB plates with 100 µg/mL ampicillin. Incubate the plates at 37 °C for a least 8 h.\nScreen for positive candidates by colony PCR using suitable primer pair (5’- ATGCCATAGCATTTTTATCC and 5’- ATTTAATCTGTATCAGGC if using the recommended vector listed in Table of Materials). With a microtip end, scratch a picked colony and transfer the cells to 20 µL of reaction mix containing 0.5 µM of each primer and 10 µL of a commercial Taq DNA polymerase mix.\nRun the PCR screening according to the following scheme: 5 min at 95 °C as the denaturation step, 30 cycles of 3 steps (30 s at 95 °C, 30 s at 55 °C, 90 s at 72 °C), and 10 min at 72 °C as the final step.\n\t\tNOTE: The PCR reactions can be stored overnight in the PCR machine at 12 °C.\nLoad 10 µL of each PCR reaction on a 0.8% agarose gel prepared in Tris-acetate-EDTA (TAE) buffer. Run the electrophoresis for 25 min at 100 V.\n\t\tNOTE: A 1.1 kbp amplicon is expected.\nExtract plasmids from candidates using a commercial kit (Table of Materials) and sequence them using the same primer pair used in step 1.1.6.\nCell culture\n\tNOTE: When a suitable candidate has been identified by sequencing, the clone can be directly used as the expression if using the recommended vector (Table of Materials). In that case, the expression is controlled by the arabinose-inducible PBAD promoter32.\n\t\nInoculate 10 mL of LB medium containing 100 µg/mL ampicillin with the candidate and incubate the preculture overnight at 37 °C under orbital shaking. Add 5 mL of the preculture to 1 L of LB medium with 100 µg/mL ampicillin. Mind to respect an air to liquid ratio of 3.",
    "Let cells grow at 37 °C under orbital shaking. Monitor the optical density at 660 nm (OD660).\nWhen OD660 has reached 0.5−0.6, rapidly cool the culture for 5 min on ice and transfer it to an incubator set to 18 °C.\nAdd 0.2 g/L arabinose to induce gene expression and incubate for 12−18 h at 18 °C.\nHarvest cells by centrifuging the culture at 6,000 x g for 30 min at 4 °C. Discard the supernatant and wash cells with 100 mL of 0.9% (w/v) NaCl.\nCentrifuge again at 6,000 x g for 15 min at 4 °C and discard the supernatant.\n\t\tNOTE: Cell pellets can be used directly for protein extraction or stored at -80 °C.\nProtein purification\n\t\nResuspend the cell pellets in 40 mL of 50 mM MOPS, 1 mM CoCl2, pH 7.2. Add 1 µL of 25 U/µL DNA/RNA endonuclease and one tablet of protease inhibitor cocktail that does not contain EDTA. Sonicate the suspension in pulse mode under cooling for 30 min.\nCentrifuge the crude extract at 20,000 x g for 30 min at 4 °C. Collect the supernatant and heat it in a water bath at 70 °C for 10 min.\nCentrifuge the denatured cell extract at 20,000 x g for 30 min at 4 °C and collect the supernatant for purification.\nUse suitable anion exchange resin (Table of Materials) packed in a column of ~15 mL of volume. Refer to manufacturer’s recommendations for the working flow rate and column pressure limit. Equilibrate the resin with 50 mM MOPS, 1 mM CoCl2, pH 7.2.\nLoad the supernatant collected from step 1.3.3 into the column. Monitor the absorbance of the eluate at 280 nm. When it has reached the baseline, proceed to the elution.",
    "Apply a gradient from 0 to 0.5 M NaCl in 50 mM MOPS, 1 mM CoCl2, pH 7.2 for 5 column volumes (CV). Wait till the conductivity is stabilized and the absorbance has reached the baseline.\nApply a final gradient from 0.5 to 1 M NaCl in 50 mM MOPS, 1 mM CoCl2, pH 7.2 for 1 CV.\nAnalyze some fractions (see Figure 2A for guidance) by sodium dodecyl sulfate polyacrylamide gel electrophoresis (SDS-PAGE).\n\t\tNOTE: TmPep1050 appears as a 36 kDa band after Coomassie staining. Alternatively, the presence of TmPep1050 can be confirmed by activity assay (see section 2.1). At this step, fractions can be stored at 4 °C overnight.\nPool the fractions containing TmPep1050 and add finely ground powder of (NH4)2SO4 to obtain a concentration of 1.5 M (NH4)2SO4. Mix gently by inverting the tube upside down till complete dissolution.\nUse hydrophobic interaction resin (Table of Materials) packed in a column of ~30 mL of volume. Refer to manufacturer’s recommendations for the working flow rate and column pressure limit. Equilibrate the resin with 50 mM MOPS, 1.5 M (NH4)2SO4, 1 mM CoCl2, pH 7.2.\nLoad the sample onto the column and monitor the absorbance of the eluate at 280 nm. When the absorbance has reached the baseline, elute bound proteins by applying a gradient from 1.5 M to 0 M (NH4)2SO4 in 50 mM MOPS, 1 mM CoCl2, pH 7.2 for 5 CV.\nAnalyze some fractions (see Figure 2B for guidance) by SDS-PAGE.\n\t\tNOTE: TmPep1050 appears as a 36 kDa band after Coomassie staining. Alternatively, the presence of TmPep1050 can be confirmed by activity assay (see section 2.1). At this step, fractions can be stored at 4 °C overnight.",
    "Pool the fractions containing TmPep1050 and concentrate to 2 mL using ultrafiltration units with 30 kDa cutoff (Table of Materials). Proceed to section 1.4 to determine the molecular weight.\nSize exclusion chromatography\n\t\nUse size exclusion resin (Table of Materials) packed in a column of ~120 mL of volume. Refer to manufacturer’s recommendations for the working flow rate and column pressure limit. Equilibrate the resin with 50 mM MOPS, 0.5 M (NH4)2SO4, 1 mM CoCl2, pH 7.2.\nLoad the sample onto the column and monitor the absorbance of the eluate at 280 nm. Fractionate from the column dead volume (~0.33 CV) until the end of the elution (1 CV).\nMeasure the elution volume for each observed peak.\n\t\tNOTE: For guidance, dodecameric TmPep1050 elutes at ~82 mL (Figure 3A) under current experimental conditions, while dimeric TmPep1050, such as the TmPep1050H60A H307A variant, elutes at ~95 mL (Figure 3B). Some TmPep1050 may adopt both oligomeric forms, such as TmPep1050H60A (Figure 3C).\nAnalyze fractions corresponding to the maxima and tails of observed peaks using SDS-PAGE.\n\t\tNOTE: TmPep1050 appears as a 36 kDa band after Coomassie staining.\nPool the fractions of each peak and concentrate using ultrafiltration units with 30 kDa cutoff (Table of Materials) to obtain a concentration of ~300 µM.\nMeasure the absorbance at 280 nm on a nano-volume spectrophotometer and calculate the concentration using the molecular extinction coefficient of 18,910 M-1 cm-1.\nStore the purified protein at -18 °C.\nTo determine the molecular weight, calibrate the size exclusion chromatography (SEC) column using molecular weight standards (Table of Materials). Analyze the standards using 50 mM MOPS, 0.5 M (NH4)2SO4, 1 mM CoCl2 pH 7.2 as the running buffer.\n2. Activity assay and apo-enzyme preparation",
    "NOTE: Originally, the apo-enzyme was prepared by diluting 1 volume of TmPep1050 in 10 volumes of 2.1 M malic acid pH 7.0 and concentrating back to 1 volume prior to dialysis11. Below is presented an alternative procedure using 1,10-phenanthroline, a metal ion chelator. This procedure reduces protein loss and gives the same results than the previously published method.\nActivity assay\n\t\nPrepare a stock solution of 100 mM L-Leucine-p-nitroanilide (Table of Materials) in methanol.\nAdd 25 µL of 100 mM L-Leucine-p-nitroanilide in 965 µL of 50 mM MOPS, 250 µM CoCl2, pH 7.2, 10% methanol. Preincubate the reaction mix at 75 °C in a dry bath.\nDilute the enzyme in 50 mM MOPS pH 7.2 to a concentration of 1 µM. Add 10 µL to the reaction mix, vortex, and incubate at 75 °C either until it has turned yellowish or for 1 h.\nStop the reaction by adding 1 mL of 20% acetic acid. Vortex well and let it cool down to room temperature.\nTransfer the reaction mix in a spectrophotometer cell. Read the absorbance at 410 nm against a negative control (incubated reaction mix without enzyme).\nApo-enzyme preparation\n\t\nPrepare a stock solution of 1 M 1,10-phenanthroline in ethanol. Add 10 µL of 1,10-phenanthroline stock solution to 890 µL of 50 mM MOPS, 0.5 M (NH4)2SO4, pH 7.2. Add 100 µL of purified TmPep1050 (300 µM−1 mM concentration).\nCheck the activity loss using the activity assay described in section 2.1 without adding CoCl2 in the reaction mix.\nTransfer the sample in a dialysis tube. Dialyze against 200 mL of 50 mM MOPS, 0.5 M (NH4)2SO4, pH 7.2 at 4 °C. Exchange thrice the dialysate with fresh buffer during the 48 h dialysis.",
    "Collect the sample from the dialysis tube and concentrate back to 100 µL using ultrafiltration units with 30 kDa cutoff (Table of Materials). Check the concentration by reading the absorbance at 280 nm using a nano-volume spectrophotometer.\nDimer preparation\n\t\nDilute the apo-enzyme to a concentration of 1 µM in 50 mM MOPS, 0.5 M (NH4)2SO4, pH 7.2. Incubate for 2 h at 75 °C in a dry bath, then let the sample cool down to room temperature.\nConcentrate the sample to an enzyme concentration of at least 50 µM. Check the molecular weight by SEC (see section 1.4). The elution peak must shift from ~82 mL to ~95 mL (under current experimental conditions).\n3. TmPep1050 crystallization\nNOTE: Protein crystallization remains an empirical science as it is a multifactorial phenomenon33. While some parameters can be identified and controlled (such as temperature, pH, precipitation agent concentration), others may influence elusively the crystallization (such as protein and chemical purity, proteolysis, sample history). Nowadays protein crystallization is tackled in a rational and systematic manner thanks to a bunch of commercial crystallization screening conditions and automation. The optimization of a crystallization condition, however, relies mostly on a trial-and-error approach. Hereafter are described a blueprint for crystallizing proteins and several tips for optimizing the crystallization conditions.\nCrystallization screening\n\tNOTE: Using commercial crystallization kits, crystals of dodecameric TmPep1050 have been obtained in 2.2 M DL-malic acid pH 7.0, 0.1 M Bis-Tris propane pH 7.0 and 0.18 M tri-ammonium citrate, 20% polyethylene glycol (PEG) 3350. Crystals of dimeric TmPep1050 have been obtained in 0.1 M sodium citrate pH 5.6, 0.2 M ammonium acetate, 30% PEG4000. Crystals of dodecamers appear within a week and reach their full size in a month. Crystals of dimers usually appear within 24 h and grow to full size in a week.",
    "Acquire several commercial crystallization kits (see Table of Materials for examples).\nSet up crystallization plates (Table of Materials) for the hanging drop method. Fill the wells with 500 µL of each solution of a crystallization screening kit.\nFor each well, set up a crystallization support. On the support, deposit a 1 µL drop of purified protein (usually ~10 mg/mL).\nImmediately pipet 1 µL of crystallization solution from the well. Add it carefully to the protein drop and mix gently by pipetting upside down thrice. The drop must remain semispherical without any bubbles.\nScrew the support on top of the corresponding well. Repeat the operation for the whole kit.\nAfter setting up the plates, observe each drop with a binocular. Refer to the crystallization kit user guide for interpretation (clear drop, phase separation, precipitate, needles, etc.).\nIncubate the plates at 20 °C. Check the plates once per day during the first week and once per week afterwards.\nScore each well using the score sheet and the user guide provided with the crystallization kits.\nCrystallization optimization\n\tNOTE: The initial crystallization conditions of dodecameric TmPep1050 have been optimized to 2.1 M DL-malic acid pH 6.75 and 0.18 M tri-ammonium citrate pH 7.5, 40% (w/v) PEG3350 while the crystallization condition of dimeric TmPep1050 has been shifted to 0.1 M sodium citrate pH 6.0, 10% (w/v) PEG3350. One cycle of seeding has been necessary to improve crystallinity. Hereafter is described how the crystallization of TmPep1050H60A H307A variant has been optimized.\n\t\nPrepare stock solutions of 0.5 M sodium citrate buffer at different pH (4.5, 5.2, and 6.0), and 50% (w/v) PEG3350 solution.\nSet up a crystallization plate as a matrix of pH vs. precipitation agent (see Figure 4A).\nIncubate the plate at 20 °C. Observe each well with a binocular once per day during a week.",
    "Score each well according to crystal size and shape. Select a condition giving crystals of at least 50 µm. Proceed to microseeding.\nMicroseeding\n\tNOTE: Microseeding is a powerful method to improve the shape, size and crystallinity of protein crystals34. A faster seeding approach is streak seeding using a cat whisker. See Figure 4 as an example how crystallization optimization and microseeding have improved the crystal shape and size for TmPep1050H60A H307A.\n\t\nPrepare the seeds using the selected well in step 3.2.4.\nIncrease the volume of a drop containing crystals to 10 µL by adding crystallization solution from the well. Pipet the drop and add 90 µL of crystallization solution from the well. Vortex thoroughly and keep the seeds on ice.\nPrepare several dilutions of the seeds: 1x, 10x, 25x, and 100x. Vortex well the seeds before pipetting. Keep the dilutions on ice.\nFor each seed dilution, set up a crystallization plate as a matrix of pH vs. precipitation agent (see Figure 4B). Use the stock solutions prepared in step 3.2.1.\nWhen making the drop, add 0.2 µL of seeds for a 2 µL drop. Incubate the plate at 20 °C. Observe each well with a binocular once per day during a week.\n\t\tNOTE: Crystal size distribution and shape must be improved, see Figure 4C as an example for TmPep1050H60A H307A. For further uses, seeds can be stored at -20 °C.\n4. X-ray diffraction\nCrystal picking\n\tNOTE: Sample preparation depends on the X-ray source facility (home facility vs. synchrotron). Use storage devices (vials and vial-holder basket) accordingly. The addition of cryoprotectant (such as glycerol) may be required depending on salt/precipitation agent concentration. For TmPep1050 crystals, a cryoprotectant is not necessary as PEG or buffer concentration is high enough to avoid water crystals.",
    "Prepare a bath filled with liquid nitrogen, plunge any vials or basket used for sample handling.\nSet up sample picking loops of different sizes: 100, 150, and 200 µm (Table of Materials). Choose the sizes according to the crystal size.\nUsing a binocular, check the drop containing crystals and spot isolated crystals (the easiest to pick). With a loop, gently pick a crystal from the bottom. Immediately plunge the loop in liquid nitrogen and place the loop in a suitable vial.\nData collection\n\tNOTE: Data collection may vary greatly depending on the X-ray source (home facility vs. synchrotron) and detector sensitivity. The collection strategy may also differ greatly from a sample to another, depending on the resolution, spot intensity, space group, etc. The topic has been extensively reviewed by Dauter35.\n\t\nMount the loop carrying the crystal on the goniometer head of the diffractometer.\nTune the goniometer head along XYZ axes to align the crystal with the X-ray beam path.\nSet the wavelength to 0.98 Å and move the detector to get 2 Å of resolution.\nStart a short data collection by acquiring images in at least two different crystal orientations. Take 10 images (1 image per 0.1°) at 0° and 90°.\nCheck the collected images with suitable software (e.g., ADXV, XDS-Viewer or Albula Viewer). Determine the spot intensity and the highest resolution where spots are seen. Check also the monocrystallinity and spot separation.\nEventually, repeat steps 4.2.3−4.2.5 by changing the detector position for higher or lower resolution and the exposure time in accordance to the observation.\nStart data collection around 360° with 1 image taken per 0.1°. Remember to set the detector position and exposure time optimally.\n5. Indexation, molecular replacement and model building\nIndexation",
    "NOTE: Indexation is a method for measuring diffraction spots intensity, giving the amplitudes of structure factors36. Four software packages are commonly used for processing collected images: Mosflm37, HKL200038, DIALS39, and XDS40. The latter has been used for indexing the data sets obtained from TmPep1050 crystal diffraction.\n\t\nInstall XDS package and XDSME41. If processing HDF5 files, install XDS Neggia plugin (available on Dectris website). For more information, visit XDS wiki web page https://strucbio.biologie.uni-konstanz.de/xdswiki/index.php/Main_Page and XDSME web page https://github.com/legrandp/xdsme.\nBefore processing data, create a folder from where XDS will be run. Locate the path to the images.\nTo run XDSME, type xdsme /path_to_images/image.extension in a terminal window.\nAfter XDS has ended the job, check the CORRECT.LP file. Note the probability of the space group determination, data completeness, the highest resolution, crystal mosaicity, and data quality. Check also XDS_pointless.log to obtain the likelihood of space groups.\n\t\tNOTE: See Figure 5 as an example of output.\nRerun XDSME with different space group solutions proposed by XDS in separate folder to avoid overwriting the previous process. Type xdsme -s space_group_name -c “unit_cell_parameters” /path_to_images/image.extension (e.g., xdsme -s P21 -c “43.295 137.812 61.118 90.000 110.716 90.000).\nCheck the CORRECT.LP files and choose the best solution based on data statistics.\nRun XSCALE by typing xscale.py XDS_ASCII.HKL. Run XDSCONV by typing xdsconv.py XSCALE.HKL ccp4.",
    "NOTE: In some cases, XDSME fails to identify the space group or fails to cut the resolution range properly or generates weird data statistics. If such a problem is encountered, it is worth to run XDS natively. Several parameters must be introduced in the XDS.INP initiation file (see XDS wiki page). When using XDS, the likelihood of possible space groups can be checked by using Pointless, part of CCP4 package42. To cut the data set resolution, Rmeas < 60% and I/σ ~2 are commonly accepted to determine the highest resolution43. The molecular replacement and model refinement, however, can be improved by extending the resolution to I/σ ~0.5−1.5 and CC1/2 down to 0.2−0.444.\nMolecular replacement\n\tNOTE: Experimental data give access to the amplitude of structural factors but, without knowing the phase, they are useless. The phase can be determined experimentally by different methods relying on an anomalous signal (from a heavy atom, for instance)45. Molecular replacement is another method for determining the phase without an anomalous scattering atom46,47. This method uses the coordinates of a related molecule to find and improve the phase iteratively. We use Phaser48 in Phenix GUI49 for molecular replacement.\n\t\nPrepare the starting model for molecular replacement using 4P6Y coordinates. From the pdb file, extract the monomer A and truncate its aminoacids in alanine using the PDB file editor in Phenix (under the Model tools tab).\nRun Xtriage in Phenix (under the Data analysis tab) with the reflection file generated by XDSCONV (5.1.9) and the sequence as inputs.\nCheck the log file from Xtriage. Note the completeness, the number of subunits in the asymmetric unit, the anisotropy, the presence of ice rings, and twinning occurrence.",
    "Run Phaser-MR in Phenix (under the Molecular replacement tab) for molecular replacement using the reflection file, the sequence and the starting 4P6Y model truncated in poly alanine (step 5.2.1).\nUpon completion, check if a model has been found and the score of the molecular replacement. A translation factor Z-score (TFZ) of at least 8 indicates that the solution is definitively correct.\nModel building\n\tNOTE: After determining the phase by molecular replacement, the model must be built and refined. This protocol uses Phenix GUI49 for automatic building and iterative refinements, and Coot50 for manual structure building and refinement.\n\t\nAfter molecular replacement using Phase-MR in Phenix, select Run Autobuild. All the required files will be automatically added. Simply press Run to start autobuild.\nUpon completion, check the model in Coot. Build and refine the model manually according the electron density map in Coot.\nRefine the manually curated model in Phenix (in the Refinement tab) using the model, the sequence, and the diffraction data as inputs. Refer to Phenix help to choose the right strategy.\nAfter refinement, check the results: Rfree and Rwork must decrease, Molprobity51 indicators must be respected, and outliers with low real-space correlation must be limited.\nRepeat steps 5.3.2−5.3.4 until the best refined model is generated.\nRun Molprobity on the server: http://molprobity.biochem.duke.edu/. Check any outliers identified by Molprobity.\nEventually repeat steps 5.3.2−5.3.6 until the best refined model is obtained.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}