{
  "id": 13528,
  "origin_website": "Jove",
  "title": "Light-mediated Reversible Modulation of the Mitogen-activated Protein Kinase Pathway during Cell Differentiation and Xenopus Embryonic Development",
  "procedures": [
    "Animal research was conducted in accordance with guidelines set by the Illinois Institutional Animal Care and Use Committee (IACUC) and the University of Illinois Department of Animal Resources (DAR).\n1. Optogenetic Induction of Protein Localization in BHK21 Mammalian Cell Culture\nNOTE: Steps 1.1-1.3 provide a method to assemble a cell culture chamber for imaging with high-magnification objectives (e.g., 63X or 100X), which typically have short working distances. These objectives require a thin glass coverslip (e.g., #1.5, 170 µm thickness) as the imaging substrate. Alternatively, a glass-bottom cell culture dish/slide can be used. In such a case, steps 1.1-1.3 can be skipped.\nCleaning glass coverslips\nPlace 30 glass coverslips in a coverslip holder.\nIn a 600 mL plastic beaker, add 20 g of detergent and 400 mL of warm tap water. Place the beaker on a magnetic stirrer and stir until all detergent is dissolved. Remove the foam using tissue paper.\nUse the bottom of a 100 mm x 15 mm Petri dish as a spacer from the stir bar and as a surface for the coverslip holder. To maintain adequate flow during the cleaning process, make 3-4 draining holes in the Petri dish.\nTo make the draining holes, heat up a soldering iron and burn through the plastic in a vented hood.\n\t\tCAUTION: Do not touch the heated soldering iron with bare hands.\nPlace the coverslip holder on the Petri dish in the beaker. Stir for 2 h to overnight at room temperature.\nWash three times with 500 mL of DI water in a 1,000 mL beaker. The detergent solution can be re-used.\nPick up individual coverslips using forceps. Immerse the coverslips in 190-proof (95%) ethanol for 1 min.\nDry the coverslips inside a sterile hood. Store the coverslips in a sterile plastic container until use.\nMaking poly-L-lysine (PLL)-coated coverslips",
    "Make 0.1 M borate buffer by dissolving 1.24 g of boric acid and 1.9 g of disodium tetraborate in 400 mL of water. Adjust the pH to 8.5 with 10 M NaOH.\nDissolve PLL in the borate buffer to a final concentration of 1 mg/mL. Aliquot the PLL solution in 50-mL sterile centrifuge tubes.\nAdd 50 mL of PLL coating solution to a 10-cm tissue culture dish. Place the dish in a 37 °C incubator to warm up the PLL solution.\nOpen the coverslip container (step 1.1.8) in a sterile hood.\nImmerse the cleaned coverslips one by one in the pre-warmed PLL solution in the tissue culture dish. Avoid bubble formation in order to immerse all surfaces.\nPlace the dish with the coverslip in a 37 °C CO2 incubator overnight. Take out each coverslip and place it in a sterile coverslip holder. Rinse three times with autoclaved ultrapure water (18.2 MΩ·cm resistivity) in a 1,000 mL beaker in a sterile hood.\nDry the coverslips in the coverslip holder in the sterile hood. Store the coverslips in a sterile plastic container until use.\nAssembling polydimethylsiloxane (PDMS) cell culture chambers\nIn a plastic container, weigh 40 g of PDMS base and add 4 g of curing agent to achieve a 10:1 w/w ratio of PDMS and curing agent. Mix the PDMS/curing agent by stirring with a pipette tip for 2 min. Alternatively, use a centrifugal mixer.\nUse a beaker with a 4 inch diameter as a template to make a holder with a piece of aluminum foil. Place the aluminum foil holder in a 15 cm Petri dish. Place a 4 inch silicon wafer within this aluminum foil holder.",
    "Pour the mixed PDMS solution into the holder. Use a thin glass rod to touch the edge of the wafer gently. Remove any air bubbles trapped under the wafer.\nInsert the 15 cm Petri dish into a vacuum chamber to degas the PDMS solution. Continue degassing for about 20 min, until no bubbles are generated. In the meantime, preheat a convection oven to 65 °C.\nCarefully place the 15 cm Petri dish into the oven. Incubate for 2 h.\nRemove the plate from the oven. Use a glass rod to gently touch the edge of the PDMS and ensure complete crosslinking. If not, incubate longer, until the PDMS is solid and non-sticky.\nRemove the aluminum foil from the plate and peel it off the silicon wafer. Starting from the edge, carefully peel the cured PDMS off the silicon wafer.\n\t\tCAUTION: Avoid applying too much force, as it can break the wafer.\nTrim the PDMS into 20 mm x 30 mm rectangular pieces to fit the 24 mm x 40 mm coverslip with a razor blade.\nUse a chisel-shaped blade to cut a rectangular opening of 10 mm x 20 mm from the center of each PDMS piece.\nClean the PDMS chambers using the detergent protocol described in step 1.1.\nDry the PDMS chambers in a clean hood. Place the dry chambers in an autoclavable container covered with aluminum foil.\nAutoclave the container using gravity (121 °C, 15 psi) for 30 min and store the container at room temperature.\nBHK21 cell culturing and transfection\nMake 500 mL of medium for BHK21 cell culture by mixing 445 mL of DMEM with 50 mL of FBS and 5 mL of 100× Penn-Strep-Glutamine (10,000 U/mL penicillin, 10 mg/mL streptomycin, and 29.2 mg/mL L-glutamine). Ensure that the final concentration of FBS is 10%.",
    "Aliquot 10 mL of non-HEPES CO2-independent medium for live-cell imaging.\n\t\tNOTE: CO2-independent medium supports cell growth without a CO2 incubator and is ideal for imaging cells under atmospheric conditions. Refer to the Materials List for detailed information. In addition to the BHK21 cell line, other types of mammalian cells should also give similar results.\nAssemble a cell culture device by placing one autoclaved, sterile PDMS chamber (step 1.3) on a sterile PLL-coated coverslip (step 1.2) in a sterile hood.\nPlace each device in a sterile 60 mm Petri dish.\nUse 0.5 mL of 0.25% trypsin to detach the cells from one well of a 12-well tissue culture plate. Count the cell density with a hemocytometer. Plate 20,000 BHK21 cells in the chamber (about 10,000 cells/cm2) with 200 µL of cell culture medium.\nPrepare DNA plasmid with a plasmid preparation kit (see the Materials List).\n\t\tNOTE: The design and functionality of the CRY2-mCherry-Raf1-2A-2CIBN-GFP-CaaX are shown in Figure 1A-1B.\nTwenty-four (24) h after cell plating, transfect the cells with 50-100 ng of CRY2-mCherry-Raf1-2A-2CIBN-GFP-CaaX plasmid, according to the manufacturer’s protocol.\nThree (3) hours after transfection, change the medium to 200 µL of fresh culture medium (step 1.4.1) and allow the cells to recover overnight by incubating the culture in a 37 °C, 5% CO2 incubator.\nFluorescence live-cell imaging\nTurn on a computer, light source, microscope, and camera. Use a confocal fluorescence microscope (equipped with a 100X oil-immersion objective) for the rest of the protocol.\n\t\tNOTE: An inverted epifluorescence microscope can also be used.\nReplace the cell culture medium with 200 µL of CO2-independent medium.\nSet up the data-acquisition protocol before placing the cells on the microscope. Use 488-nm excitation FITC channel for optogenetic stimulation. Use 561 nm excitation TRITC channel to locate transfected cells and track the cellular localization of mCherry-labeled protein.",
    "Set the gain of FITC and TRITC channels as 120 and 200, respectively. Use a pixel-dwelling time of 2.2 µs and size of 512 x 512 pixels.\nMeasure the power of the 488-nm light by placing a power meter close to the objective window. A total power of 2 µW (about 10,000 W/cm2 at the focus) is sufficient to induce CIBN-CRY2PHR association.\nSet up a timestamp acquisition with a 5 s interval and a total acquisition time of 2 min.\nApply appropriate index-matching material (immersion oil) on the objective window. Use the phase-contrast mode to focus on the cells on the coverslip surface.\nLocate a transfected cell under 561 nm light by moving the microscope stage.\n\t\tCAUTION: Avoid using blue light during this step, as it will activate the association between photoactivatable proteins.\nOnce a transfected cell is located, initiate data acquisition.\n\t\tNOTE: Successfully transfected cells should show fluorescence in both FITC (from 2CIBN-GFP-CaaX) and TRITC (from CRY2-mCherry-Raf1) channels (Figure 1C-D).\nRecord a series of time-stamped images in both the FITC and TRITC channels (Figure 1D).\nTo probe the spontaneous dissociation of the CRY2-CIBN protein complex, record another timestamp with the Txred channel alone for 20 min, with a 30 s interval.\nSave the time-stamped image for data analysis.\nImage analysis\nOpen the images with an image analysis software that can extract the intensity from an image40.\nSelect two representative snapshots: one prior to blue-light exposure and the other post-blue-light exposure.\nDraw a line across the cell spanning the background, the plasma membrane, and the cytoplasm. Project the intensity along this line. Save the values and plot them out to compare the difference before and after light exposure (Figure 1D).",
    "To analyze the kinetics of protein association, select one representative region of interest (ROI) in the plasma membrane, one ROI in the cytoplasm, and one ROI in the background.\nAcquire the mean intensities of the plasma membrane (IPM), the cytoplasm (ICYT), and the background (IBKD) for the image stack.\nCalculate the ratio of membrane/cytosolic intensity for each image using the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/55823/55823eq1.jpg\nPlot the ratio versus time and determine the binding or dissociation kinetics of CRY2-CIBN (Figure 1E-F).\n2. Construction of an LED Array for Long-term Light Stimulation in a CO2 Incubator\nNOTE: The overall schematic of the experimental setup is shown in Figure 2A.\nMake the LED array by inserting 12 blue LEDs into two breadboards and connecting current-limiting resistors.\n\tNOTE: With a 30 V power supply, four LEDs can be connected in series, and their brightness can be controlled by a current-limiting resistor.\nPlace the breadboards into an aluminum box.\n\tNOTE: The height of the aluminum box should be 2 in. This height is optimal for illuminating a 12-well tissue culture plate, because the size of the diverging light spot is the same as that of a single well.\nUse two metal wires to connect to the power supply. Make sure that the length of the wire is sufficient when the light box is placed inside a CO2 incubator.\nUse a transparent light diffuser as the cover of the light box (Figure 2C).\nCalibrate the power output of each LED at a range of voltage inputs. Use a power of 0.2 mW/cm2 for the 24 h PC12 cell differentiation assay. Use a power of 5 mW/cm2 for live Xenopus embryos or explants assays.\n3. Optogenetic Induction of PC12 Cell Differentiation\nCell culturing and transfection",
    "Make 500 mL of medium for a rat pheochromocytoma (PC12) cell culture by mixing 407.5 mL of F12K with 75 mL of horse serum + 12.5 mL of FBS + 5 mL of 100× Penn-Strep-Glutamine (final concentrations of horse serum and FBS: 15% and 2.5%, respectively). Make low-serum medium by mixing 1 volume of full medium in 99 volumes of F12K medium.\nPlate PC12 cells in a 12-well plate at a density of 300,000 cells/well or 75,000 cells/cm2.\nTransfect the cells with CRY2-mCherry-Raf1-2A-2CIBN-GFP-CaaX 24 h after cell plating (similar to step 1.4.7). Use 1.2 µg of DNA for each well. Allow the cells to recover overnight in culture medium in a 37 °C incubator supplemented with 5% CO2. Check the transfection efficiency 16 h after transfection.\n\t\tNOTE: A 30-50% transfection efficiency should be achieved to ensure a sufficient cell count.\nChange the medium to low-serum medium 24 h after transfection. Use 1 mL of medium per well of a 12-well plate.\nLight-induced PC12 cell differentiation\nPlace the LED array in a CO2 incubator. Connect it to the power supply using a pair of wires. Set the power of the LED to 0.2 mW/cm2. Place the 12-well plate containing transfected PC12 cells (step 3.1.3) on the window of the LED array. Apply continuous light illumination for 24 h in a 37 °C incubator supplemented with 5% CO2.\nFluorescence live cell imaging\nFollow steps 1.5.1-1.5.4 for microscope and sample preparation.\nSet up single-snapshot data acquisition. Use 200 ms for both the GFP and Txred channel.\nCapture images of the transfected cells in both the GFP and Txred channels. Record roughly 200 cells for each condition. Save the files for data analysis.\nImage analysis\nCount the percentage of differentiated cells over the total number of transfected cells.",
    "Use any cell-counting module in the image analysis software to count the cells.\nManually count the differentiated cells.\n\t\tNOTE: Differentiated cells are defined as those in which at least one neurite is discernibly longer than the cell body (Figure 3A-3B).\nRepeat step 3.4.3 with undifferentiated cells.\nCalculate the differentiation ratio using the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/55823/55823eq2.jpg\n4. Optogenetic Control of Kinase Activity in Xenopus Embryos\nPreparation of buffers\nPrepare 1 L of 1x Marc's Modified Ringer (MMR): 100 mM NaCl, 2 mM KCl, 1 mM MgCl2, 2 mM CaCl2, and 5 mM HEPES; pH 7.5.\nPreparation of mRNA\nDigest the CRY2-mCherry-Raf1-2A-2CIBN-GFP-CaaX plasmid DNA (2 µg) with 1 µL of ApaI (50 unit) at 37 °C for 2 h.\nPrecipitate linearized DNA in 60 µL of 100% ethanol. Spin at 12,000 × g for 5 min at room temperature to pellet the DNA. Carefully remove the supernatant and wash the pellet again with 60 µL of 70% ethanol. Spin at 12,000 × g for another 5 min at room temperature. Carefully remove the supernatant and resuspend the DNA pellet in 6 µL of RNase-free H2O.\nPerform in vitro transcription by incubating 1 µg of linearized DNA with 2 µL of supplied SP6 RNA polymerase, a ribonucleotide mixture (10 mM ATP, CTP, and UTP; 2 mM GTP; and 8 mM cap analog), and 20 µL of nuclease-free water at room temperature for 1 h.\nRemove the DNA template by DNase I digestion at 37 °C for at least 15 min and purify the synthesized RNA using a silica-membrane spin column.\nStop the reaction and precipitate the RNA by adding 30 µL of nuclease-free water and 30 µL of LiCl precipitation solution. Mix thoroughly and chill for 30 min at -20 °C.",
    "Centrifuge at 4 °C for 15 min at 12,000 × g to pellet the RNA.\nCarefully remove the supernatant. Wash the RNA once with 1 mL of 70% ethanol and resuspend in 40 µL of nuclease-free water.\nLoad 40 µL of RNA in a spin column. Centrifuge at 4 °C for 1 min at 12,000 × g to remove the unincorporated nucleotides and caps.\nHarvest Xenopus embryos\nFollow the protocol described by Sive et al.41 to obtain the Xenopus embryos.\nmRNA microinjection\nFabricate the needles for microinjection by pulling glass capillaries with a capillary puller. Set the pulling program to: heat = 355, pull strength = 80, velocity = 50, and time = 100.\nRemove the jelly coat from the embryos by treating them with 3% cysteine (diluted in 0.2x MMR).\nTransfer the embryos to 3% polysucrose and 0.5x MMR solution for microinjection. Inject 500 pg to 1 ng of CRY2-mCherry-Raf1-2A-2CIBN-GFP-CaaX RNA into each embryo.\n\t\tNOTE: Injection of a dose higher than 1 ng results in blue light-independent activation of the MAPK signaling.\nOptogenetic stimulation of kinase activity\nCulture microinjected embryos in 3% polysucrose, 0.5x MMR solution at room temperature until they reach the mid-gastrula stage (stage 12). Then, culture the embryos in 0.2x MMR solution.\nTransfer the embryos or explants to a 12-well plate. Place the 12-well plate on the home-built LED array (step 2.5) for blue-light (475 nm) treatment.\nPlace a mirror on the top of the 12-well plate to ensure full blue-light illumination of the embryos or explants.\nTune the power of the blue light to 5 mW/cm2.\n\t\tNOTE: Blue-light treatment can be performed at any desired time, in either 3% polysucrose, 0.5x MMR solution, or 0.2x MMR solution.\nHarvest the embryos at any desired time. Use them for histological, Western-blot, or gene-expression analysis.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}