{
  "id": 12315,
  "origin_website": "Jove",
  "title": "A Mimic of the Tumor Microenvironment: A Simple Method for Generating Enriched Cell Populations and Investigating Intercellular Communication",
  "procedures": [
    "1. Preparation of Culture Media and Cells\nPrepare 500 ml of Eagle's minimum essential medium supplemented with 12.5% (vol/vol) heat-inactivated fetal bovine serum (FBS), 2 mM L-alanyl-L-glutamine, and 100 units of penicillin and 100 µg of streptomycin per ml.\n\tNOTE: The growth medium and supplement(s) can be easily exchanged for the growth requirements of other cell strains or cell lines.\nPrepare 70 µl of cell culture medium for each insert (6-well format insert): Eagle's minimum essential medium supplemented with 50% (vol/vol) heat-inactivated FBS, 2 mM L-alanyl-L-glutamine, and 100 units of penicillin and 100 µg of streptomycin per ml.\n\tNOTE: The medium is supplemented with 50% FBS to facilitate cell attachment to the bottom side (i.e., underside) of the insert. The growth medium and supplement(s) can be easily exchanged for the growth requirements of other cell strains or cell lines.\nPrepare a cell suspension of the cells destined to be plated on the bottom side of the insert.\n\tNOTE: Here, the results were obtained using AG1522 normal human fibroblasts grown in 75 cm2 cell culture flasks, and these cells will therefore be the focus of description of the cell suspension's preparation.\nTo collect cells, remove the growth medium and wash the cell monolayer 2x with 5 ml 1x Phosphate Buffered Saline (PBS).\nRemove the PBS and spread 1 ml of 0.25% (vol/vol) trypsin with 2.21 mM ethylenediaminetetraacetic acid (EDTA), pre-warmed to room temperature (RT) over the cells for 2 min at RT (room temperature).\nQuench the trypsin activity with 9 ml of complete growth medium (prepared in step 1.1) and collect cells by gently pipetting the cell suspension over the surface of the flask 10x.",
    "Determine the cell concentration by using a hemocytometer or electronic counter and pipette the cell suspension volume that will provide 250,000 cells per insert into a sterile 15 ml centrifuge tube.\nPellet the cell suspension by centrifugation (800 x g, 2 min). Suspend the cell pellet with growth medium (prepared in step 1.2) to create a concentration of 250,000 cells per 70 μl.\n\tNOTE: As cell culture in permeable microporous membrane inserts is based on 2D substrates, cell seeding is performed similarly, except the cells should be initially suspended in medium containing 50% (vol/vol) FBS to facilitate attachment.\n2. Preparation of Inserts\nNOTE: To ensure sterile conditions, work in a laminar flow biological safety cabinet dedicated to cell culture.\nSelect inserts with a membrane pore size of 0.4 μm, 1 μm, or 3 μm (determined by the experimental interest(s), as the pore size can be used to explore the role of different modes of intercellular communication).\n\tNOTE: The 0.4 μm pore is small enough to limit formation of functional gap junctions between cells on either side of the insert membrane and can be used to study intercellular communication by secreted factors. Whereas, the 1 μm and 3 μm pores are large enough to allow formation of functional gap junctions and can be used to study intercellular communication by both gap junctions and secreted factors.\nRemove individual inserts from the packaging and place into an equally sized multi-well dish.\n\tNOTE: Inserts are available with various membrane surface areas to fit specific application needs (e.g., 6-well, 12-well, and 24-well inserts). Here, the results were obtained using the 6-well insert, and will therefore be the focus of the model description.",
    "Cover the dish, containing the inserts with the dish lid. Holding the multi-well dish with both hands, gently invert the dish such that the insert bottoms (i.e., underside) are now facing upwards.\nRemove the bottom of the multi-well dish, exposing the bottom side of the inserts. Working with one insert at a time, use a sterile pair of forceps and gently hold the insert in place. With the free hand, use a pipette with a wide-mouth tip to draw 70 μl of the cell suspension (prepared in steps 1.3-1.8), containing 250,000 cells.\nTo plate the cells, place the pipette tip gently on the center of the insert's membrane, and slowly pipette the 70 μl of cell suspension while slowly moving the pipette tip around the surface of the membrane. Be careful not to extend the pipette tip and cell suspension to the edge of the insert.\n\tNOTE: Touching the edge of the insert could result in loss of capillary tension of the cell suspension leading to the cells drying out during attachment.\nRepeat for remaining inserts, with care being exercised not to work directly over the exposed inserts to avoid potential microbial contamination.\nGently return the multi-well dish bottom to cover the inserts. Keeping the dish with inserts inverted, incubate in a humidified air atmosphere of 5% (vol/vol) CO2 at 37 °C for 30-45 min.\n\tNOTE: If the cell suspension on the insert contacts the bottom of the well, carefully lift the dish bottom and rest it on the edge of the dish top, so that it forms a slight angle and creates greater separation between the surface of the dish and the bottom side of the inserts (where the cells are seeded). This will prevent the cells from attaching to the surface of the wells instead of the insert.",
    "Following the 30-45 min incubation time, gently remove the dish containing the inserts and place it in the laminar flow biological safety cabinet.\nWith two hands and keeping the dish lid tight, gently re-invert the dish such that the bottom side of the inserts containing the attached cells now faces down.\nSlowly and carefully add 2 ml (1 ml for 3 μm pore inserts to avoid migration of cells through the insert pores) of pre-warmed complete medium (see step 1.1) to each well, so that the bottom of the insert is immersed.\nAfter adding growth medium in all the wells containing inserts, place the dish back into the humidified incubator.\nAllow the inserts to remain undisturbed in the incubator for 48 hr. After 48 hr, feed the cells by aspirating the 2 ml of medium from the bottom of the well and adding 2 ml of fresh growth medium.\nAfter adding fresh medium to the bottom of the well, seed 1 ml of the second cell population suspension (~250,000 cells/ml) on the top side of the insert, which already has the first cell population growing on the bottom side (for these experiments, AG1522 (control) cells or cancer (experimental) cells are plated on the top of the inserts, which already have AG1522 cells, destined to become CAFs, growing on the bottom side of the inserts). Place the dish back into the humidified incubator.\n\tNOTE: If working with cells that do not adhere well to the bottom of the insert, these cells can be alternatively grown on the top side of the insert.",
    "Change the medium at 24, 72, and 96 hr after seeding the second population of cells on the top side of the insert by aspirating the medium from the top of the insert and bottom of the well. Gently add 1 ml of fresh medium to the top side of the insert and 2 ml to the bottom of the well. Allow the two cell populations to remain in co-culture on either side of the permeable microporous insert membrane for 120 hr.\n3. Collecting Cells from Insert by Trypsinization\nNOTE: In addition to the ease of obtaining enriched cell populations, the insert TME model also allows for similar experimental treatments (e.g., incubation with chemicals, exposure to oxygen conditions that are above or below ambient atmosphere, ionizing radiation treatment, etc.) as other in vitro TME co-culture models. Furthermore, the permeable insert co-culture substrate can be analyzed by procedures already developed for standard 2D tissue culture models. For example, cells can be harvested from either side of the insert membrane to obtain highly enriched populations, which can then be utilized for analysis of endpoints (e.g., in situ immuno-detection, Western blotting) or propagated for subsequent experiments36.\nTo collect cells, remove the insert from the growth medium and place it into a 35 mm cell culture dish containing 1 ml PBS. Wash the bottom and top sides of the insert 1x with 1 ml PBS.\nRemove the PBS and add 200 μl of 0.25% (vol/vol) trypsin with 2.21 mM EDTA, pre-warmed to RT.\n\t\nIf collecting the cells grown on the bottom side of the insert, place the trypsin solution into the 35 mm dish and gently place the bottom of the insert into the trypsin solution for 2 min at RT.",
    "If collecting the cells grown on the top side of the insert, place the insert into a 35 mm dish and add the trypsin solution to the top of the insert and incubate for 2 min at RT.\nQuench the trypsin activity by adding 800 μl of complete growth medium.\n\t\nIf collecting the cells grown on the bottom of the insert, add the growth medium to the 35 mm dish and collect the cells by gently pipetting the 1 ml of cell suspension over the surface of the insert 10x, with the insert being held at a slight angle, such that the cell suspension collects into the dish.\nIf collecting the cells from the top side of the insert, add the growth medium to the top side and gently pipette the 1 ml of cell suspension over the surface of the insert 10x.\n4. Characterization of Cell Purity by Flow Cytometry\nNOTE: To characterize the ability of the permeable microporous membrane inserts to maintain the purity of the two cell populations (i.e., top and bottom) for up to 120 hr, sections 1-3 were performed, with green fluorescent protein (GFP)-tagged MDA-MB-231 cells being plated on the top side of the insert, and non-GFP-tagged AG1522 cells being plated on the bottom side of 0.4 µm-, 1 µm-, or 3 µm pore inserts.\nOnce the cells from the bottom side of the insert were collected (procedure described in Section 3), pellet the cell suspension by centrifugation (500 g, 30 sec).\nRemove the supernatant and suspend the cell pellet in 400 µl of Hanks' Balanced Salt Solution (HBSS) supplemented with 1% (vol/vol) FBS.\nPerform cytometric analysis on a flow cytometer equipped with a 488 nm laser to excite GFP and a bandpass filter of 530/30 to detect GFP photon emission37.",
    "For cell identification purposes, use AG1522 control cell populations to adjust forward and side scatter voltages on the flow cytometer. Adjust the GFP channel voltage to set the cellular autofluorescence value as the lower detection threshold for the GFP signal.\nDetermine gating threshold using control cells. Assess purity of each cell population based upon the presence of GFP-positive cells versus control.\n\tNOTE: A pure population would be reflective of no GPF-positive cells detected.\n5. Characterization of Cells by In Situ Immunofluorescence\nFollowing trypsinization of cells from the insert (see section 3), collect cells, plate 5 x 104 cells in 250 μl growth medium (see step 1.1) onto sterile glass coverslips, and allow to attach for 1 hr in a humidified air atmosphere of 5% (vol/vol) CO2 at 37 °C incubator.\nAt the end of the incubation, gently remove the dish containing the coverslip and place it in the laminar flow biological safety cabinet.\nCarefully add 2 ml of pre-warmed complete medium (see step 1.1) to each dish, so that the coverslip is immersed.\nAfter adding growth medium to all the dishes containing coverslips, return the dishes to a humidified air atmosphere of 5% (vol/vol) CO2 at 37 °C in an incubator for 48 hr.\nFollowing the 48 hr incubation, wash the sample 3x with PBS and fix with 4% (wt/vol) formaldehyde in PBS for 10 min at RT.\nRinse 5x with Tris Buffered Saline (TBS: 50 mM Tris-Cl, pH 7.5, 150 mM NaCl) and then permeabilize with 0.25% (vol/vol) Triton X-100, 0.1% (wt/vol) saponin for 5 min at RT.\nBlock non-specific binding sites with 2% (vol/vol) normal goat serum (NGS), 1% (wt/vol) bovine serum albumin (BSA), 0.1% (vol/vol) Triton X-100 in TBS (blocking solution) for 1 hr at RT.",
    "Incubate with primary antibody (anti-Caveolin 1 (CAV1), 1:1,000) in blocking solution at 4 °C overnight.\nWash off unbound primary antibodies (3x, 5 min/wash) with 0.2% NGS (vol/vol), 1% (wt/vol) BSA, 0.1% (vol/vol) Triton X-100 in TBS (wash solution).\nIncubate with secondary antibody at RT for 1 hr in blocking solution (see section 5.4).\nWash off unbound secondary antibody (3x, 5 min/wash) with wash solution (see step 5.6).\nMount coverslips on a slide with an anti-fade mounting medium containing 4',6-diamidino-2-phenylindole (DAPI), and seal with nail polish.\nObserve cells using a 63X oil magnification objective on an inverted microscope equipped with an external light source for fluorescence excitation, and capture images using an attached digital camera for subsequent analysis.\n6. Characterization of Cells by Western Blot\nNOTE: The Western blot procedure is described elsewhere38. A brief outline is described here:\nFollowing detachment of cells from the insert by trypsinization (see section 3), pellet the cell suspension by centrifugation (500 g, 30 sec).\nRemove supernatant and suspend the cell pellet 2x with 100 µl PBS.\nRemove supernatant and lyse cells in 50 µl of modified radioimmunoprecipitation assay (RIPA) buffer (Tris pH 7.5 50 mM, NaCl 150 mM, NP40 1% (vol/vol), sodium deoxycholate monohydrate (DOC) 0.5% (vol/vol), sodium dodecyl sulfate (SDS) 0.1% (vol/vol)), containing protease and phosphatase inhibitor cocktail.\nIncubate for 20 min on ice and centrifuge at 19,000 g for 15 min at 4 °C.\nDetermine concentration of proteins in the supernatant using a protein optical density assay, compatible with the detergents in the RIPA buffer.\nSeparate proteins by sodium dodecyl sulfate polyacrylamide gel electrophoresis (SDS-PAGE) and electroblot onto a 0.2 µm nitrocellulose membrane.",
    "Incubate membranes in TBS containing 0.1% (vol/vol) Tween-20 (TBST) and 4% (wt/vol) skim milk (blocking solution) for 60 min and react with primary antibody at 4 °C overnight (anti-CAV1, 1:1,000).\nWash membrane 3x with TBST at RT (5 min/wash).\nIncubate membranes for 30 min in blocking solution containing an anti-mouse secondary antibody conjugated with horseradish peroxidase (HRP) (1:5,000).\nWash membrane 3x with TBST at RT (5 min/wash).\nVisualize reaction products by chemiluminescence using a Western blotting detection system.\n7. Characterization of Intercellular Communication by Flow Cytometry\nNOTE: To characterize the adaptability of the permeable microporous membrane inserts to examine different modes of intercellular communication (e.g., secreted factors, gap junctions). Sections 1-2.12 were performed with non-fluorescent AG1522 cells being plated on the bottom side of 0.4 µm-, 1 µm-, or 3 µm-pore inserts.\nCulture non-labeled AG1522 cells in a 35 mm dish to 90% confluency using medium described in section 1.1.\nRinse cells 1x with 1 ml of HBSS.\nLoad cells with Calcein AM by incubating cells in HBSS containing 30 µM of Calcein AM.\nIncubate for 15 min in a humidified air atmosphere of 5% (vol/vol) CO2 at 37 °C.\nWash cells 2x with 1 ml of HBSS.\nTrypsinize cells by adding 200 µl solution of 0.25% (vol/vol) trypsin with 2.21 mM EDTA for 2 min at RT.\nQuench the trypsin activity by adding 800 µl of complete medium containing 12.5% (vol/vol) FBS.\nBring cells into suspension by repeated pipetting.\nDetermine cell concentration by using a hemocytometer or electronic counter and plate 250,000 cells loaded with Calcein AM to the top side of inserts that already have AG1522 cells growing on the bottom side.\nIncubate the inserts in a humidified air atmosphere of 5% CO2 at 37 °C for 6 hr.",
    "After 6 hr, collect cells from the bottom side of the inserts, as described in section 3.\nPellet the cell suspension by centrifugation (500 g, 30 sec).\nRemove the supernatant and suspend the cell pellet in 400 µl of HBSS supplemented with 1% (vol/vol) FBS.\nAnalyze the cells on a cytometer equipped with a laser and filter capable of exciting and detecting the emission of Calcein (496 nm and 516 nm, respectively), per manufacturer protocol.\nFor cell identification purposes, use an unstained AG1522 control cell population to adjust forward and side scatter voltages on the flow cytometer. Adjust the Calcein channel voltage to set the cellular autofluorescence value as the lower detection threshold for the Calcein signal.\nDetermine the upper threshold limit using Calcein-loaded control cells. Assess communication for each cell insert based upon the presence of Calcein-positive cells versus control.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}