{
  "id": 12312,
  "origin_website": "Jove",
  "title": "Next Generation Sequencing for the Detection of Actionable Mutations in Solid and Liquid Tumors",
  "procedures": [
    "This protocol comprises the salient steps of two validated laboratory developed tests for the genomic profiling of solid and liquid tumors, respectively. The testing performed in the laboratory is done in accordance with the requirements of the Clinical Laboratory Improvement Amendments (CLIA) of 1988.\n1. DNA Extraction from Peripheral Blood or Bone Marrow\nDetermine how much blood or bone marrow to take based on Table 1.\ntable:\n﻿0,1\nSample/WBC,Amount to be treated as 1 ml of blood\nBone Marrow,250 μl\n\"Blood WBC 12,000 – 50,000\",1 ml\n\"Blood WBC 50,000 – 100,000\",500 μl\n\"Blood WBC 100,000 – 200,000\",200 μl\n\"Blood WBC > 200,000\",100 μl\n\"* For Blood WBC < 12,000, take 2 ml of blood\",\"* For Blood WBC < 12,000, take 2 ml of blood\"\nTable 1: Blood/Bone Marrow Volume to Use Chart. Since the white blood cell count will vary from sample to sample, it is difficult to specify a specific volume of blood to use. Therefore, the amount of blood to use for the assay must be determined by looking at the white blood cell count (WBC) prior to starting the assay. Although less blood is utilized, it should still be treated as if its 1 ml since the volume of blood used is reduced because the number of cells present is greater than normal.\nFollow the commercially available kit's protocol to isolate the genomic DNA.\n2. DNA Extraction from Formalin-fixed Paraffin-embedded (FFPE) Tissue\nBased on the tumor region the pathologist circled on the H&E slide, line up the unstained slides with the guide H&E slide and outline a similar area for extraction. For macro-dissection, process only one specimen/patient's set of slides at a time.",
    "Heat the slides on a 45 °C heat block to slightly melt the paraffin. Carefully scrape the tissue within the lines that are marked on the slide, using a new scalpel for each specimen to be extracted. Place the wax scrapings into the appropriately labeled 1.5 ml tube. Be careful because the scraped wax is very electrostatic and may jump out of the tube.\nAdd 320 µl of Deparaffinization Solution for every five to six 5 µm sections (25 - 30 µm total). For example, if a tube containing 3 sections of a 10 µm roll/curl is going to be processed, then use 320 µl, but if 5 sections at the same thickness were obtained then use 640 µl.\nVortex vigorously for at least 10 sec and perform a quick spin in a microcentrifuge to remove the tissue/wax from the sides and cap and into the solution. Incubate at 56 °C for 3 min., and then incubate at RT for 5 - 10 min.\nFollowing the RT incubation, add 180 µl of ATL buffer for every 320 µl of Deparaffinization Solution added. Mince the tissue ten times using a sterile mini-pestle using a new pestle for each specimen. Ensure there is no tissue stuck to the pestle, as it can be very sticky. Vortex the suspension vigorously for 3 sec, then centrifuge at maximum speed for 1 min.\nAdd 10 µl of Proteinase K to the lower clear phase. Mix gently by pipetting up and down to ensure the tissue is resuspended. Do NOT vortex. Incubate at 56 °C overnight with shaking at 400 - 500 rpm.",
    "The next morning, check if the tissue is fully dissolved (this has occurred if the lower solution is clear). If the lower solution is not clear, then vortex vigorously for 3 sec and centrifuge at maximum speed for 1 min. Add an extra 5 - 10 µl of Proteinase K and incubate at 56 °C for an additional 30 - 60 min.\nIncubate at 90 °C for 1 hr to help reverse the formaldehyde cross-linking. Allow samples to cool to room temperature for 5 - 10 min and then briefly centrifuge each tube to consolidate the liquid.\nTransfer the lower clear phase into a labeled 1.5 ml tube. If there are multiple tubes from the same patient specimen (such as the case if multiple rolls are being used), recombine the lower phases into one tube at this point. Note: Transferring small amounts of the Deparaffinization Solution should not interfere with the purification procedure, but there is a risk if a large amount is transferred.\nAdd 2 µl of RNase A solution. Vortex gently or invert 25 times and quick spin in a microcentrifuge. Incubate at RT for 5 min.\nAdd 200 µl of Protein Precipitation Solution. If doing one or two rolls, use 200 µl. If doing three rolls at once, then use 400 µl. Vortex vigorously at high speed for 30 sec to uniformly mix the lysis buffers. Incubate on ice for 5 min or the samples can stay on ice for up to an hr.\nCentrifuge at 5,000 x g for 5 min. The precipitated protein should form a tight, white pellet. Pour the supernatant into a labeled 1.5 ml tube, and then incubate the samples on ice for at least 3 min. Centrifuge at 5,000 x g for 3 min.",
    "Add 200 µl of 2-propanol (Isopropanol) for every 180 µl of Buffer ATL added earlier to a labeled 1.5 ml tube (it might be necessary to use a 2 ml tube). For example, if doing three rolls add 600 µl of isopropanol. Add 1 µl of glycogen for every 180 µl of Buffer ATL added earlier to the isopropanol and invert the tube several times to mix.\nCarefully add the supernatant from the Protein Precipitation step into the Isopropanol mixture. Mix the tube by inverting gently at least 50 times.\nCentrifuge at maximum speed for 3 min. The DNA will be visible as small white pellet at the bottom of the tube.\nPour or aspirate off the supernatant into the appropriate waste tube. Keep a separate 1.5 ml waste tube for each specimen in case the pellet comes dislodged so it will not be lost or mixed with the waste of other specimens. Drain the tube on a paper towel and ensure the majority of the Isopropanol is removed.\nAdd 300 µl of freshly made 70% ethanol. Invert the tube gently several times to wash the pellet. Try to ensure the pellet comes dislodged to ensure a more thorough cleaning.\nCentrifuge at maximum speed for 5 min. and then carefully remove the ethanol. The pellet may be loose, so pour or aspirate slowly and watch the pellet. Remove the excess ethanol from the inside of the tube, without touching the pellet. Allow the samples to air dry for 5 - 15 min, being careful to not over dry the sample.",
    "Add between 25 - 100 µl of DNA Hydration Solution to each sample based on the size of the DNA pellet and the starting amount of tissue. Vortex the tubes vigorously and briefly spin in a microcentrifuge. Incubate for 1 hr at 65 °C to fully rehydrate the DNA.\n3. Genomic DNA Quality Control\nNote: There are three independent steps for DNA quality control (QC). See Table 2 for further explanation of why each QC step is performed.\ntable:\n﻿0,1,2,3\nInstrument,Result,Indication,Ideal Range\nDropSense96,A260/A230,\"Identification of chemical contaminants (e.g., ethanol)\",1.50 – 2.2\nDropSense96,A260/A280,Identification of protein contaminants,1.60 – 2.2\nDropSense96,Concentration,DNA quantification,> 1 ng/µl\nTapeStation,DNA Smear,\"Determination of DNA integrity (e.g., degradation/fragmentation of extracted DNA)\",\"50% > 1,000 bp\"\nQubit 2.0,Concentration,More accurate DNA quantification,> 1 ng/µl\nTable 2: DNA QC Expected Results. All of these values are taken into account before running permitting a sample to proceed to the library preparation stage.\nFollowing the manufacturer's protocol, run 2 µl of the extracted DNA on a fluorometer to obtain the working concentration (ng/µl) of the sample.\nRun 1 - 2 µl of each sample on a UV/VIS spectrophotometer to check the quality of the sample (A260/A230 and A260/A280 ratios) according to the manufacturer's instructions.\nFor FFPE samples: Following the manufacturer's instructions, run 1 µl of each sample on a microfluidic gel-electrophoresis system to assess degradation/fragmentation of the DNA. See Figure 2 for examples.\nimgsrc://cloudfront.jove.com/files/ftp_upload/52758/52758fig2.jpg",
    "Figure 2: Genomic DNA QC Gel Example. The green line over the lower bands is to indicate the lower marker. The added-in red line is to indicate approximately 1,000 bp. Lane A2 represents fully intact DNA, as one would expect from fresh tissue (e.g., peripheral blood or bone marrow). Lanes B1, C1, D1, B2, C2, E2 are examples of good, intact FFPE DNA. The DNA in lane F2 appears to be intact, but at too low a concentration. The DNA in lane G2 is degraded or fragmented and will not work in the assay. Lanes E1, F1, G1, H1, D2, H2 represent DNA which falls in the 'gray zone' meaning that the assay might work well, but some of the DNA could be too damaged or cross-linked and thus it will not perform well in the assay. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/52758/52758fig2large.jpg]\n4. Amplicon Library Preparation\nHybridization of Oligo Pool and Extension-Ligation of Bound Oligos\n\t\nIn the Pre-PCR room, add the necessary volume of Low EDTA TE, 5 µl of the Panel's Oligo Tube (e.g., Solid-NGS Panel or Heme-NGS Panel), and 100 - 250 ng of genomic DNA to each corresponding well in a semi-skirted 96 well-plate labeled as the Hybridization (HYB) plate.\nAdd 40 µl of Oligo Hybridization for Sequencing Reagent 1 (OHS1) to each sample in the HYB plate. Gently pipette up and down at least 5 - 6 times to mix. Change tips after each column to avoid cross-contamination.\nSeal the HYB plate with adhesive aluminum foil and centrifuge at 1,000 x g for 30 sec.",
    "Incubate the HYB plate in the pre-heated hybridization incubator at 95 °C for 1 min. Set the temperature of the hybridization incubator to 40 °C. Continue incubating as long as it takes the incubator to decrease from 95 °C to 40 °C (~ 90 min). Note: This gradual cooling is critical for proper hybridization.\nDuring the last 15 - 20 min of the hybridization incubation, pre-wash the Filter Plate Unit (FPU). Prepare only the wells to be used in the current assay, i.e., only use fresh/unused wells of a previously opened filter plate, but never re-use wells that have been used. Note: This should be clear based upon the Kit Number on the filter plate, the markings on the filter plate, and the sealant used across the plate.\n\t\t\nUsing a multi-channel pipette, add 45 µl of Stringent Wash 1 (SW1) to each well.\n\t\t\tCAUTION: Contains formamide. Cover and centrifuge the FPU at 2,250 x g for 3 min at 20 °C. Check every single well for residual liquid (> 15 µl/well).\nIf residual liquid exists, rotate the FPU 180° and repeat the centrifuge step again for an additional 3 min. If the residual liquid spins through the second time, then proceed to the next step, if not then there may be a defect in the filter plate and the current plate will need to be replaced.\nOnce the hybridization incubator has cooled to 40 °C, centrifuge the plate at 1,000 x g for at least 30 sec at 20 °C to collect condensation. Transfer the entire volume of each sample from the HYB plate onto the center of the corresponding pre-washed wells of the FPU. Change tips after each column to avoid cross-contamination. Cover the FPU and centrifuge at 2,250 x g for 3 min at 20 °C.",
    "Add 45 µl of SW1 and centrifuge at 2,250 x g for 3 min at 20 °C. Repeat for a total of two washes. Rotate the FPU 180° and centrifuge again at 2,250 x g for 3 min to completely remove all the SW1.\nDissemble the FPU. Discard all the flow-through (containing formamide) into the proper waste container. Reassemble the FPU using a different MIDI Waste Collection Plate. Add 45 µl of Universal Buffer 1 (UB1) to each sample well and centrifuge at 2,250 x g for 3 min at 20 °C. CAUTION: Contains formamide.\nAdd 45 µl of Extension Ligation Mix 3 (ELM3) to each sample well on the FPU plate and pipette up and down 3 times to mix. Note: The Extension-Ligation reaction takes place on the filter plate membrane.\nSeal the FPU plate with adhesive aluminum foil and incubate the entire FPU assembly in a pre-heated 37 °C incubator for 45 min.\nIndexing and PCR Amplification\nAliquot the indexes being used to the corresponding wells in the Indexed Amplification Plate (IAP) by arranging the primers in the Index Plate Fixture, arranged in the following manner: i5 primer tubes (white caps, clear solution) vertically, aligned with rows A through H, i7 primer tubes (orange caps, yellow solution) horizontally, aligned with columns 1 through 12. Using a p10 multi-channel pipette, add 4 µl of i7 primers (yellow solution) to each row of the IAP and add 4 µl of i5 primers (clear solution) to each column of the IAP.\nOn ice or a cooling block, prepare the PCR Master Mix by adding 0.5 µl of DNA Polymerase 1 (TDP1) to 25 µl of PCR Master Mix 2 (PMM2) per sample. Invert, quickly vortex, and briefly centrifuge the PCR Master Mix to mix.",
    "Add 22 µl of the PCR Master Mix to each well of the IAP and pipette up and down 3 times to mix. Change tips between wells. Keep the IAP at 4 °C.\nAfter the 45 min Extension-Ligation reaction (step 4.1.10), remove the FPU from the incubator and carefully remove the aluminum foil seal. Cover with the lid and centrifuge at 2,250 x g for 3 min at 20 °C.\nAdd 25 µl of 50 mM NaOH to each sample well on the FPU. Pipette up and down at least 6 times; ensure the pipette tips come in contact with the membrane. Change tips after each column. Incubate at room temperature for 5 min.\nTransfer samples eluted from the FPU to the IAP as follows:\n\t\t\nUsing a p100 multi-channel pipette set to 20 µl, pipette the NaOH on the FPU plate up and down at least 6 times. Slightly tilt the FPU plate to ensure complete aspiration off the plate.\nTransfer 20 µl from the FPU to the corresponding column of the IAP. Gently pipette up and down at least 6 times to thoroughly combine the DNA with the PCR Master Mix. Seal the IAP with adhesive film and centrifuge at 1,000 x g for 1 min at 20 °C.",
    "Bring the PCR Plate into the Post-PCR Room and load the plate onto a thermal cycler. Run the PCR program consisting of a heat denaturing step at 95 °C for 3 min; followed by 25 cycles of 95 °C for 30 sec, 62 °C for 30 sec, 72 °C for 60 sec; followed by a final extension of 72 °C for 5 min; finishing with a hold at 10 °C. If not proceeding to the next stage following the completion of PCR, the plate can remain on the thermal cycler overnight, or it can be stored at 2 to 8 °C up to two days.\nPCR Purification and Bead-Based Normalization\nRemove the magnetic purification beads, Elution Buffer (EBT), and gel-electrophoresis reagents from the 4 °C fridge and place at RT at least 20 min before the next stage.\nOnce the PCR is complete, centrifuge at 1,000 x g for 1 min at 20 °C to collect condensation. Transfer 1 µl of each PCR reaction to strip tubes/plate wells containing 4 µl of water to dilute the samples 1/5. Pipette up and down to mix.\nAdd 2 µl of the diluted PCRed samples to 2 µl of microfluidic-gel buffer. Seal the strips/plate. Shake at 1,800 rpm for at least 30 sec and centrifuge at 1,000 x g for 30 sec. Following manufacturer's protocol, run the mixture on a microfluidic gel to assess if the library preparation yielded an acceptable library (see Figure 3).\nVortex the magnetic purification beads until they are well-suspended and the color appears homogeneous. Add 45 µl of the beads to each sample.\nSeal the plate with clear adhesive film and shake the plate at 1,800 rpm for 2 min. Incubate at room temperature without shaking for 10 min.",
    "Place the plate onto a magnetic stand. Once the supernatant has cleared, carefully remove and discard the supernatant. If any beads are inadvertently aspirated into the tips, dispense the beads back to the plate and let the plate rest on the magnet for 2 min and confirm that the supernatant has cleared.\nWith the plate on the magnetic stand, add 200 µl of freshly prepared 80% ethanol to each sample well. Move the plate back and forth a few times. Incubate the plate on the magnetic stand for 30 sec. Carefully remove and discard the supernatant. Repeat for a total of two washes.\nRemove the excess ethanol by briefly centrifuging the plate at 1,000 x g to drive down any ethanol on the tube sides, placing the plate back onto the magnetic stand, and using a p10 multi-channel pipette set to 10 µl to remove the ethanol. Allow the beads to air-dry for 5 - 8 min.\nUsing a p100 multi-channel pipette, add 30 µl of EBT to each well. Pipette up and down a few times to ensure the beads come off the side of the tube. Seal the plate with clear adhesive film and shake the plate at 1,800 rpm for 2 min.\nIncubate at room temperature without shaking for 3 min. If there are samples in which the beads are not completely resuspended, gently pipette up and down to resuspend the beads.",
    "Place the plate on a magnetic stand. Using a p100 multi-channel pipette, transfer 20 µl of the supernatant to a whole new plate called the Library Normalization Plate (LNP). Transfer the remaining ~ 10 µl of the individual sequencing libraries to a separate plate called the Remaining Cleaned-Up Library Plate (RCLP). Store this plate along with the final library prep, as it can be used as a reserve for a second sequencing run, if necessary. If not proceeding to the next stage, the LNP and RCLP can be stored at -15 to -25 °C.\nVigorously vortex and resuspend the Library Normalization Beads 1 (LNB1). It is critical to completely resuspend the LNB1 bead pellet at the bottom of the tube. Prepare the Normalization Mix, by mixing 8 µl of LNB1 with 44 µl of Library Normalization Additives 1 (LNA1) per sample. Vigorously vortex the Normalization Mix for 10 - 20 sec.\n\t\tCAUTION: LNA1 contains formamide.\nWith intermittent inversion and vortexing of the Normalization Mix, add 45 µl to each sample of the LNP. Seal the plate with clear adhesive film and shake the plate at 1,800 rpm for 30 min. This 30 min incubation is critical for proper library normalization as incubations of greater or less than 30 min may affect library representation and cluster density.\nDuring the 30 min incubation, prepare the reagents for sequencing by thawing the reagent cartridge and Hyb Buffer (HT1) [CAUTION: Both contain formamide]. In addition, get ice for a later step and ensure a heat block suitable for 1.5 ml centrifuge tubes is set to 96 °C.\nWhen the 30 min mixing step is complete, place the LNP on a magnetic stand. Once the supernatant has cleared, use a multi-channel pipette to carefully remove and discard the supernatant into the appropriate waste container.",
    "Remove the LNP from the magnetic stand and wash the beads with Library Normalization Wash 1 (LNW1) as follows:\n\t\t\nAdd 45 µl of LNW1 to each sample well.\n\t\t\tCAUTION: Contains formamide. Seal the plate with clear adhesive film and shake the plate at 1,800 rpm for 5 min. Repeat for a total of two washes. Ensure to remove all the LNW1 after the second wash.\nRemove the LNP from the magnetic stand and, using a multi-channel pipette, add 30 µl of 0.1 N NaOH (less than a week old) to each well to elute the sample. Seal the plate with clear adhesive film and shake the plate at 1,800 rpm for 5 min.\nDuring the 5 min elution, add 30 µl of Library Normalization Storage Buffer 1 (LNS1) to each well to be used in a new plate named the StoraGe Plate (SGP).\nPlace the LNP on the magnetic stand. Once the supernatant has cleared, transfer the 30 µl elution to the LNS1 in the SGP. Change tips between samples to avoid cross contamination.\nSeal the plate with adhesive film and centrifuge at 1,000 x g for at least 30 sec.\nAdd 5 µl of each sample to be sequenced to a labeled Pooled Amplicon Library (PAL) 1.5 ml tube. Vortex the PAL to mix and briefly spin down in a microcentrifuge.\nDepending on what sequencing chemistry being used (V2 or V3) add 4 - 10 µl of the PAL to 590 - 596 µl of HT1. Generally, add 5.8 µl of PAL to 595 µl of HT1 for V2 chemistry and 8.5 µl of PAL to 592 µl of HT1 for V3 chemistry. Label this tube as the Diluted Amplicon Library (DAL) tube.",
    "Vortex the DAL and briefly spin down in a microcentrifuge. Incubate the DAL at 96 °C for 2 min. Invert the DAL tube 3 times and put the DAL on ice for at least 5 min, while preparing the sequencer for sequencing. After the 5 min, the DAL is ready to be loaded.\nIf finished with the SGP, seal the plate with adhesive aluminum foil film and label it with the date and plate ID. Store the sealed SGP and PAL at -15 to -25 °C.\nimgsrc://cloudfront.jove.com/files/ftp_upload/52758/52758fig3.jpg\nFigure 3: Library Prep QC Gel Example. The green line over the lower bands is to indicate the lower marker and the purple line over the upper bands is to indicate the higher marker. Everything worked well for lanes H1, A2, B2, C2, E2, and G2. The library prep did not work optimally, for lanes D2, F2, and H2, but results will still be obtained they just might not have adequate coverage. For A3, the library prep barely worked and most likely this DNA sample was not adequate for the assay. The lower bands above the lower marker are the unused primers, because the aliquot is taken directly from the PCRed well. The NTC sample should only have the unused primer band, and nothing else. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/52758/52758fig3large.jpg]\n5. Sequencing\nEnsure a correct SampleSheet.csv has been made for the run. See Supplementary Figure 1 for an example.\nRinse and dry the flow cell and add 600 µl of the DAL to the thawed reagent cartridge.\nPrepare the sequencer for sequencing by following the on-screen prompts.\n6. Data Analysis\nExecute the bioinformatics pipeline. Utilize the in-house, custom designed bioinformatic pipeline to identify mutations, insertions, deletions and amplifications18.",
    "After the pipeline has completed, check the log files for errors/warning, as any significant errors/warnings aid in the QC of the pipeline processing.\nAnalyze the run statistics (Table 3) to ensure the sequenced library has passed the lab determined QC metrics (Figure 4). Manually review each variant by viewing the .bam files in a genomic data viewer (e.g., the Integrative Genomics Viewer16 (IGV)).\n\tNOTE: Only the variants within the validated allele-frequency range and above the minimum depth of coverage after quality filtering are reported (using Human Genome Variation Society's (HGVS) nomenclature). For final reporting, each exonic variant was categorized into: pathogenic, probably disease associated, variant of unknown significance (VUS), likely benign, and benign. All variants above the reporting criteria of 5% allele frequency, except those deemed benign variants and synonymous changes, were reported.\nimgsrc://cloudfront.jove.com/files/ftp_upload/52758/52758fig4.jpg\nFigure 4. Overview of Quality Control Steps for NGS. Quality control of each step in the process is necessary to ensure the sequencing will yield results such that pre and post sequencing metrics are considered. Appropriate specimen treatment is essential for high quality DNA. Blood and bone marrow in inappropriate fixatives can yield low quality DNA. Inappropriate fixation of solid tumor specimens can degrade DNA (e.g., fixation in B5). DNA quality should be assessed for protein and RNA contamination by spectrophotometric means, and accurately assessed for the amount and integrity of DNA. The sequencing metrics need to be empirically determined in the sequencing laboratory and followed for each sequencing reaction and every specimen. Prior to reporting the sequencing results for each specimen should be assessed for coverage, depth, and adequate performance of positive and negative controls. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/52758/52758fig4large.jpg]"
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}