{
  "id": 5997,
  "origin_website": "Bio",
  "title": "Dual-sided Voltage-sensitive Dye Imaging of Leech Ganglia",
  "procedures": [
    "Making toolsCoarse dissection container:Fill the base of the container with aquarium pebbles to about half its height.Pour black Sylgard (PDMS) into the container up to 10 mm from the top. Note: It is critical that the pebbles are generously covered.Leave the PDMS to set overnight at room temperature or in a lab oven set to 65 °C.Microdissection container:Pour 0.65-mm thick layer of transparent Sylgard (PDMS) into one plastic Petri dish, and a 2-mm thick layer into another.Allow the PDMS to set (as above).Use a microsurgical knife to cut a disk (13 mm in diameter) with an open window (1.6 x 2.6 mm) out of the 0.65-mm thick PDMS layer.Dye-loading dish (Figure 1):Into the center of a plastic Petri dish, drill a hole of just over 1.2 mm diameter for a capillary to fit through using a belt drive bench lathe.Heat capillary glass over a gas flame and shape it into an ‘L’ with a short leg of 7 mm. Cut the long leg to 10 mm.Insert the short leg of the L into the hole from the outside.Glue the capillary to the dish with epoxy glue.Connect the end of the capillary with a short tube connected to a short (18 mm) straight capillary. This short capillary is connected to the tubing of the perfusion pump. Pour a 2-mm-thick base layer of PDMS into the Petri dish and let it set overnight.Cut a 2-mm-diameter hole out of the PDMS directly over the capillary and verify that liquid can pass through the capillary.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180227/20180227174714_1538.jpgFigure 1. Double-sided dye-loading system. A. Top view of a dye-loading dish. In the center of the dish there is an outflow hole for loading dye onto the bottom surface of the ganglion. The hole is connected to capillary and tube for circulation pumping.",
    "A well formed with PDMS substrate around the hole helps reduce the required volume of VSD solution. The dish is placed on two aluminum blocks so that the dish, the capillary, and the tube are stably positioned. B. Side view of a dye-loading dish. Glass capillary inserted into the bottom hole of the dish is stabilized with epoxy glue (yellow matter). (For cleaning, the dish and tube can be separated by pulling out the non-glued part of capillary and tube.) C. Spatial arrangement of outflows and intakes of the dye-loading system. PDMS disk with a target ganglion on its center window is put in the center of the well so that the outflow from the bottom side reaches the bottom surface of the ganglion. Intake capillaries are positioned close to the edge of the well so as not to bump the PDMS disk. Top outflow is placed just above the top surface of the ganglion.Recording dishMake a hole (14 mm in diameter) in the center of the plastic dish. Note: This can be easily done using a laser cutter, a lathe, or a mill. We have found it difficult to achieve clean holes with a handheld drill.Place an 18 mm diameter round cover glass on the bottom of the center hole, apply PDMS around the rim of the cover glass to adhere it to the Petri dish, and leave it to set overnight.Pour transparent Sylgard (PDMS) into the dish to a thickness of 1.5 mm, again leaving it to set overnight. Cut a circle out of the PDMS slightly larger than the hole in the bottom of the dish.Completely remove any pieces of PDMS substrate from the cover glass.Dissection (Video 1: Coarse dissection, Video 2: Microdissection)<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Isolation of the leech nervous system (a short chain of ganglia). 1.",
    "Anesthetize a leech in ice-cold saline. 2. Pin down the leech’s head and tail, using insect pins on a coarse dissection container. 3. Cut the dorsal skin along with the midline with a pair of dissection scissors. 4. Cut open the skin and pin it down. 5. Find a target ganglion for imaging. 6. Use a microsurgical knife to expose a lateral nerve root to be extracellularly recorded, if needed. 7. Dissect away the blood sinus surrounding the target ganglion. 8. Dissect away the blood sinus with the lateral nerves of the ganglion. 9. Isolate a short chain of ganglia. 10. Aspirate the isolated preparation into a pipette. <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Double-sided desheathing of a leech ganglion. 1. Position a disk of transparent PDMS in the center of the container. 2. Transfer the ganglion into a microdissection container filled with cold saline. 3. Place the ganglion over the disk of transparent PDMS. 4. Use short pieces of tungsten wire to pin down sinus (the ganglion’s ventral side is up). 5. Stretch the connectives to apply tension to the ganglion’s sheath. 6. Zoom in on the target ganglion. 7. Remove the ventral sheath from the glial packet in the following order: the posterior, the central, and the lateral glial packets. 8. Check that the cells are not displaced or damaged. 9. Unpin the ganglion, flip the dorsal side up, then pin it down. 10. Zoom in on the ganglion. 11. Remove the dorsal sheath from the lateral glial packets (posterior to anterior). 12. Check that the cells are not displaced or damaged. 13. Unpin the ganglion, flip the ventral side up, then pin it down. 14. Check that the cells are not displaced or damaged.",
    "Place a leech in a saline-filled plastic container with an ice cube made of frozen saline and allow the leech to cool down for 10-20 min before dissection. Note: When anesthetized sufficiently, leeches do not show the fast reflexive twisting-like response that unanesthetized leeches display when pinned down at their head or tail. Transfer the leech to a ‘coarse dissection container’ (see ‘Materials and Reagents’) that has been kept in a fridge or freezer.Use insect pins to immobilize the leech for dissection. Note: Throughout the dissection, keep the container set on a cooling plate (see ‘Equipment’) and use a stereomicroscope for all procedures. Cut away tissue as needed to isolate the central nervous system of the leech (either the whole nerve cord or a short chain of ganglia). Note: The blood sinus surrounding the nervous system needs to be dissected away only around the ganglion targeted for imaging, not around any other ganglia. Aspirate the isolated preparation into a pipette and transfer it into a microdissection container (see ‘Materials and Reagents’) filled with saline. Place this container on a cooling plate and use a high-magnification stereomicroscope for the remaining steps.Position the disk of transparent PDMS (see ‘Materials and Reagents’) in the center of the container.Place the target ganglion over disk, ventral side up, centered over the window so that the PDMS substrate does not touch the dorsal side of the ganglion. Use short pieces of tungsten wire to pin down blood sinus tissue that surrounds the lateral nerve roots to the disk.Using micro-scissors or a microsurgical knife, carefully and cleanly remove the sheath from the ventral and dorsal surfaces of the ganglion with the following steps:Remove the ventral sheath (Figure 2A).",
    "Carefully unpin the ganglion as necessary to flip it upside down over the window in the PDMS disk, taking care not to damage any neurons in the process.Remove the dorsal sheath (Figure 2B).Note (very important): Throughout the procedure, keep the ganglion cool by replacing the saline in the dish with fresh cold saline every 2-3 min using plastic pipettes until ready for dye loading. Time after desheathing is critical. Desheathing should be done within 15-20 min.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180227/20180227174949_1662.jpgFigure 2. Desheathed ganglion. For voltage-sensitive dye loading, sheath tissue covering the target ganglion (e.g., the 10th segmental ganglion) is removed from both ventral (A) and dorsal (B) sides. ‘R’ indicates the right side of the ganglion, i.e., the animal’s right side when oriented dorsal side up. Scale bars = 100 μm.Dye loadingPrepare 2 ml of VSD solution (800 nM VF2.1(OMe).H) in leech saline containing 1% pluronic acid, see Recipes) and leave it at room temperature for at least an hour in the dark. Note: Using freshly made cold VSD solution results in significantly compromised staining and hence a dramatic drop in signal quality. Make sure that dye loading is carried out under dim red light to avoid bleaching the dyes. Place the ‘volume-restricting well’ into the ‘dye-loading dish’ (see ‘Materials and Reagents’), centered over the bottom outflow capillary.Position the top outflow capillary loosely over the center of the well.Fill the well with VSD solution, and dip the two intake capillaries into the solution near the edge of the well.Set both peristaltic pumps to a flow rate of about 1.1 ml/min (speed knob level 2), and verify that perfusion works well.Note: Make sure that no bubbles accumulate inside the outflow capillaries. If bubbles are stuck inside the capillaries, temporarily increase the pumping speed to eject the bubbles.",
    "Removing bubbles must be done before initiation of VSD staining. Transfer the PDMS disk with the ganglion still attached to it into the well in the dye-loading dish and use one or two insect pins to secure it with the ganglion hanging over the outflow capillary (Figure 1A). Note: The ganglion is ‘hanging’ below the disk at this time with the dorsal side facing down.Bring the top outflow capillary close to the ganglion (about 1-mm distance; Figure 1C) and use both peristaltic pumps to circulate the VSD solution (1.1 ml/min flow rate) for 8 min.Flip the PDMS disk with the ganglion attached to it upside down within the well (so the ganglion is on top of the disk and the dorsal side is facing up), taking care to keep it centered over the bottom outflow capillary. Use both peristaltic pumps to circulate the VSD solution for a further 12 min. Note: For well-balanced brightness on the both sides of the imaged preparation, what will be the bottom of the preparation must be stained more strongly than the top because the excitation light onto the top focus plane is brighter than that onto the bottom focus plane. The top outflow more efficiently stains a ganglion than the bottom outflow, so the choice of 8 min circulation in Step C7 and 12 min in Step C9 causes the dorsal side to be more strongly stained than the ventral side. This is by design: it compensates for the reduced excitation efficiently at what will be the bottom side of the ganglion during imaging. Gently wash the preparation with cold saline after dye loading and completely replace VSD-containing saline with normal cold saline. Clean the outflows tubes and capillaries by circulating with 70% EtOH and distilled water. Note: This can be done after imaging.",
    "Optical imagingStabilize the target ganglion for imaging by tightly pinning down blood sinus tissue that surrounds the nerve roots to the PDMS disk and by sandwiching adjacent connectives between small pieces of medical dressing (Figure 3C), which must also be pinned down, to minimize any motion artifacts.Place a small amount of petroleum jelly along the rim of the cover glass of a ‘recording dish’ (see ‘Materials and Reagents’; Figure 3A).Place the disk with the ganglion in the center of the recording dish, pushing it down into the petroleum jelly. Pull blood sinus tissue around the adjacent connectives from the ganglion so that the tissue can be tightly pinned down onto the periphery PDMS substrate of the recording dish (Figure 3B). Clean the bottom surface of the cover glass with lens cleaning paper before imaging.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180227/20180227175316_1880.jpgFigure 3. A recording dish for double-sided VSD imaging. A. Top view of the center area of recording dish (top) and a schematic frontal section view (bottom). Before placing a PDMS disk with a preparation into the dish, petroleum jelly is applied to the periphery of the cover glass. B. Top view of PDMS disk with a preparation set on the cover glass (top) and a schematic frontal section view (bottom). To minimize motion artifacts, tension is created by pinning the blood sinus tissues around the adjacent ganglia down onto the PDMS substrate of the outer area of the dish. C. An adjacent connective sandwiched between two pieces of medical dressing (top) and a schematic frontal section view (bottom). The pieces of medical dressing are pinned down onto the PDMS disk.Place the recording dish on the stage of a double-sided microscope (Figures 4A and 4B).Adjust the orientation of preparation using top (upright) microscope under red light exposure.",
    "Prepare for extracellular and/or intracellular recording by positioning electrodes near target nerves or cell bodies (Figure 4C).Note: Time interval between the end of dye-loading and the beginning of VSD imaging is typically 20-25 min. Spending much more time here may negatively impact the health of the ganglion. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180227/20180227175415_7953.jpgFigure 4. Double-sided microscope. A. Overview of a double-sided microscope. The fluorescence train of an Olympus BX upright microscope is mounted with a custom focus rack on top of the body of an Olympus IX inverted microscope. Images are acquired with two CCD cameras. B. Top and bottom 20x objectives precisely aligned for dual-sided VSD imaging. A recording dish is put in the cutout (white) of the plastic stage. Sticky clay is used for fixing the position of the dish. C. Simultaneous electrophysiology and double-sided VSD imaging. The top side of the preparation is accessible to both intracellular and extracellular electrodes.Aspirate target nerves into suction electrodes and/or impale target cells.Bring top and bottom surfaces of the ganglion coarsely into focus using top and bottom objectives.Adjust the brightness of images to obtain the best brightness but not to saturate the CCD cameras using the intensity control of the LED controller or the aperture stop of the microscope. Determine the final focus for top and bottom imaging.Note (important): Throughout all these preparations, frequently replace saline with cold saline.Start VSD imaging/electrophysiological trial using VScope (Wagenaar, 2017). Note: Make sure that optical imaging is carried out in dark surroundings.After finishing the VSD imaging experiment, acquire snapshots of both top and bottom aspects of the ganglion at different focusing depths for later creation of ‘focus-stacked’ images of the ganglion (Figure 5). These will be used for drawing for Regions of Interest (ROIs) in VScope.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180227/20180227175533_8115.jpgFigure 5. Visualizing the ganglion. A.",
    "Single snapshot image of the ventral aspect of the 10th ganglion as captured by top camera. B. The same image after processing with adaptive contrast enhancement (ACE) filter. C. Focus-stacked image constructed from multiple snapshots of the ventral aspect at different depths. D. The same image after processing with ACE filter. Scale bars = 100 μm."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}