{
  "id": 7487,
  "origin_website": "Bio",
  "title": "ATAC Sequencing Protocol For Cryopreserved Mammalian Cells ",
  "procedures": [
    "Notes:  Prepare buffers, mixes, and stock solutions as described in the Recipes section, before starting the protocol. We advise starting with at least 2 biological replicates. If this is not available, 2 technical replicates should be prepared from the same sample. Preparation of cryopreserved cells for ATAC-seq (day 1)Notes:  Cell viability is one of the most important parameters for a successful ATAC-seq experiment. To avoid cell death and lysis, the cells from cryopreserved vials should be carefully thawed and rapidly transferred to a conducive environment. The addition of a DNase digestion step in this section will digest the DNA from lysed cells that could otherwise interfere with the final data and interpretations. Warm the cell culture media (IMDM + 10% FBS) to 37°C.Add 4 mL of warm media to a 15 mL tube (one tube per sample).Remove cryopreserved cell vials from the -80°C freezer and place them in a bucket with ice.Place the cryopreserved cell vials at 37°C (no more than 3 vials at a time).When cells are half thawed (typically 1-2 min), add 1:1 volume of warm media to the vial.Pipet up and down several times, until the cells are completely thawed.Immediately transfer the cells into the 15 mL tube with warm media.Spin cells down at 500 × g for 5 min at room temperature.Discard the supernatant and resuspend the cell pellet in 1 mL of warm media.Transfer the resuspended cells to a microfuge tube.Add 10 μL of the aliquoted DNase stock solution (see Recipe 1) to the resuspended cells and incubate for 30 min at 37°C (final DNase concentration in each sample is 200 Units/mL).Spin cells down at 500 × g for 5 min at 4°C.Discard the supernatant and resuspend the cell pellet with 1 mL of ice-cooled PBS (first PBS wash).",
    "Spin cells down at 500 × g for 5 min at 4°C.Repeat Steps A13-A14.Resuspend the final pellet with 1 mL of ice-cooled PBS, count cells, and estimate viability using a cell counter. Using a dual-fluorescence (e.g., acridine orange and propidium iodide) imaging-based automated cell counter gives rapid and fairly accurate cell counts and viability estimates.Cell lysis, transposition, and DNA extraction (day 1)Notes:  To perform a successful ATAC-seq experiment, it is crucial to use the right cell-to-transposase ratio. Using too few cells will over-digest the chromatin, causing enrichment of smaller DNA fragments that may get preferentially sequenced, increasing the background noise in the data. On the other hand, an excess of cells will result in under-digestion, causing production of large DNA molecules that may be difficult to sequence. The authors of the OMNI-ATAC manuscripts (Buenrostro et al., 2015; Corces et al., 2017) have optimized the number of cells for this assay to 50,000. Thus, we have used this number for our routine experiments. If more or less cells need to be used, the cell-to-reagents ratio should be maintained, by adjusting the volumes of all reagents accordingly. Spin 50,000 viable cells down at 500 × g for 5 min at 4°C in an Eppendorf centrifuge.Remove the supernatant very carefully, without disturbing the pelleted cells. This process can be difficult since sometimes the pellets are almost invisible. To avoid accidentally aspirating the cells, we recommend first using a P1000 pipette until the last 150-200 μL, then a P200 pipette until the last 15-20 μL is left in the tube, and finally removing the remaining volume with a P20 pipette. If during this process some of the cells are accidentally disturbed, a second centrifugation at 500 × g, for 5 min at 4°C will be required.",
    "To lyse the cells, add 50 μL of the cold ATAC-RSB with detergents buffer previously prepared (see Recipes 2 and 3).Resuspend the cells with a P200 pipette up and down three times, and immediately incubate on ice for 3 min. If preparing more than one sample, ensure that all the samples have the same incubation time.Add 1 mL of the wash-out lysis buffer (see Recipe 4) and invert the tube three times to mix.Spin down the resulting nuclei solution at 500 × g for 10 min at 4°C in an Eppendorf centrifuge.Aspirate the supernatant very carefully, as described in Step B2.Resuspend the nuclei pellet in 50 μL of the transposition mix (see Recipe 5), and mix it by pipetting up and down six times.Using a thermomixer, incubate the samples at 37°C with agitation (1,000 RPM) for 30 min. In this step, the transposase will fragment and tag the accessible DNA with adaptors.Extract the DNA from the transposed nuclei using a Zymo DNA Clean and Concentrator-5 kit, according to the manufacturer’s instructions. Elute DNA in 21 μL of elution buffer. At this step, DNA can be stored at -20°C, until ready to prepare the library by PCR amplification.Library preparation (day 2)Notes:  During this part of the protocol, the DNA that was fragmented and tagged with adaptors in section B is PCR amplified using barcoded primers. To pool up to 24 libraries together, a list of 24 barcoded oligos (Ad2.1-Ad2.24) is in Table 1. In our experience, when starting with approximately 50,000 cells, the number of PCR cycles to have a successful ATAC-seq experiment without library over-amplification is between 7 and 9. In case of high cell viability (over 80%), we run the PCR for 7 cycles. In cases of low viability (less than 50%), we do 9.",
    "However, to avoid the risk of size and GC content PCR bias, the appropriate number of cycles can be determined by qPCR. Buenrostro et al. (2015) has a full explanation on how to calculate the precise number of PCR cycles. Prepare the following PCR reaction mix in a PCR tube.25 μL of 2× NEBNext Master Mix2.5 μL of 25 µM primer Ad12.5 μL of 25 µM barcoded primer Ad2.120 μL of transposed DNA sampleWhen preparing different samples in the same pool for sequencing, each individual sample PCR reaction mix will have a different barcoded primer Ad2.Perform PCR using the following cycling conditions:1 = 72°C for 5 min2 = 98°C for 30 s3 = 98°C for 10 s4 = 63°C for 30 s5 = 72°C for 1 min6 = Go to step 3, six times7 = Hold at 4°CTable 1. List of barcoded primers. table:",
    "﻿0,1\nAd1_noMX:,AATGATACGGCGACCACCGAGATCTACACTCGTCGGCAGCGTCAGATGTG\nAd2.1_TAAGGCGA,CAAGCAGAAGACGGCATACGAGATTCGCCTTAGTCTCGTGGGCTCGGAGATGT\nAd2.2_CGTACTAG,CAAGCAGAAGACGGCATACGAGATCTAGTACGGTCTCGTGGGCTCGGAGATGT\nAd2.3_AGGCAGAA,CAAGCAGAAGACGGCATACGAGATTTCTGCCTGTCTCGTGGGCTCGGAGATGT\nAd2.4_TCCTGAGC,CAAGCAGAAGACGGCATACGAGATGCTCAGGAGTCTCGTGGGCTCGGAGATGT\nAd2.5_GGACTCCT,CAAGCAGAAGACGGCATACGAGATAGGAGTCCGTCTCGTGGGCTCGGAGATGT\nAd2.6_TAGGCATG,CAAGCAGAAGACGGCATACGAGATCATGCCTAGTCTCGTGGGCTCGGAGATGT\nAd2.7_CTCTCTAC,CAAGCAGAAGACGGCATACGAGATGTAGAGAGGTCTCGTGGGCTCGGAGATGT\nAd2.8_CAGAGAGG,CAAGCAGAAGACGGCATACGAGATCCTCTCTGGTCTCGTGGGCTCGGAGATGT\nAd2.9_GCTACGCT,CAAGCAGAAGACGGCATACGAGATAGCGTAGCGTCTCGTGGGCTCGGAGATGT\nAd2.10_CGAGGCTG,CAAGCAGAAGACGGCATACGAGATCAGCCTCGGTCTCGTGGGCTCGGAGATGT\nAd2.11_AAGAGGCA,CAAGCAGAAGACGGCATACGAGATTGCCTCTTGTCTCGTGGGCTCGGAGATGT\nAd2.12_GTAGAGGA,CAAGCAGAAGACGGCATACGAGATTCCTCTACGTCTCGTGGGCTCGGAGATGT\nAd2.13_GTCGTGAT,CAAGCAGAAGACGGCATACGAGATATCACGACGTCTCGTGGGCTCGGAGATGT\nAd2.14_ACCACTGT,CAAGCAGAAGACGGCATACGAGATACAGTGGTGTCTCGTGGGCTCGGAGATGT\nAd2.15_TGGATCTG,CAAGCAGAAGACGGCATACGAGATCAGATCCAGTCTCGTGGGCTCGGAGATGT\nAd2.16_CCGTTTGT,CAAGCAGAAGACGGCATACGAGATACAAACGGGTCTCGTGGGCTCGGAGATGT\nAd2.17_TGCTGGGT,CAAGCAGAAGACGGCATACGAGATACCCAGCAGTCTCGTGGGCTCGGAGATGT\nAd2.18_GAGGGGTT,CAAGCAGAAGACGGCATACGAGATAACCCCTCGTCTCGTGGGCTCGGAGATGT\nAd2.19_AGGTTGGG,CAAGCAGAAGACGGCATACGAGATCCCAACCTGTCTCGTGGGCTCGGAGATGT\nAd2.20_GTGTGGTG,CAAGCAGAAGACGGCATACGAGATCACCACACGTCTCGTGGGCTCGGAGATGT\nAd2.21_TGGGTTTC,CAAGCAGAAGACGGCATACGAGATGAAACCCAGTCTCGTGGGCTCGGAGATGT\nAd2.22_TGGTCACA,CAAGCAGAAGACGGCATACGAGATTGTGACCAGTCTCGTGGGCTCGGAGATGT\nAd2.23_TTGACCCT,CAAGCAGAAGACGGCATACGAGATAGGGTCAAGTCTCGTGGGCTCGGAGATGT\nAd2.24_CCACTCCT,CAAGCAGAAGACGGCATACGAGATAGGAGTGGGTCTCGTGGGCTCGGAGATGT",
    "Library purification (day 2)Note: After the PCR is completed, double-sided bead purification is necessary, to remove primer dimers and fragments over 1,000 bp. Perform a double-sided SPRI bead purification.Add 0.5× volume (25 μL) of SPRI beads to the PCR samples (50 μL), and pipet up and down 10 times to mix thoroughly.Quickly spin the tubes down for 3 s and incubate for 10 min at room temperature.Place PCR tubes in a magnetic rack for 5 min, or until the supernatant is clear.Carefully transfer the supernatant to a new PCR tube.Add 1.3× original volume (65 μL) of SPRI beads, and pipet up and down 10 times to mix thoroughly.Quickly spin the tubes down for 3 s and incubate for 10 min at room temperature.Place PCR tubes in a magnetic rack for 5 min or until the supernatant is clear.Carefully remove the supernatant and discard it.Wash beads twice with 200 µL of 80% freshly made ethanol.Eliminate ethanol traces by spinning the tubes down for 3 s, placing them back in a magnetic rack, and aspirating the ethanol with a P10 pipette tip.Resuspend beads in 20 μL of nuclease-free water.Quickly spin the tubes down for 3 s and incubate for 1 min at room temperature.Place PCR tubes in a magnetic rack for 5 min or until the supernatant is clear.Transfer 19 μL of supernatant to a new tube.Check fragment size distribution profiles of the samples by running 0.5 μL on high sensitivity chip on a Bioanalyzer (Figure 1).Samples can be stored at -20°C until the next step.Note: Figure 1A shows a typical ATAC-seq bioanalyzer profile, after the first bead clean-up. Depending on the initial cell viability, cell type, experimental treatment, number of transposed nuclei,and number of PCR cycles, the nucleosomal banding pattern may have a different outcome. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4294/bioprotoc-12-02-4294-g001.jpgFigure 1.",
    "High Sensitivity Bioanalyzer profile of several ATAC-seq libraries after a variety of magnetic bead purifications. A. ATAC-seq profile after the first double size selection clean-up. Primer dimers and fragments over 1,000 bp are still present in this library. B. To remove all the unwanted DNA, a second double size selection purification was performed. The peaks in the final library indicate the mono-, di-, and tri-nucleosome-associated fragments. C. ATAC-seq profile after the first double size selection clean-up, showing the presence of primer dimers. D. To remove all the primer dimers, a second clean-up as described in Step D2 was conducted. E. ATAC-seq profile after the first double size selection clean-up, showing the presence of primer dimers, fragments over 1000 bp, and a big first peak. F. To reduce the size of the low molecular weight peak, a 0.95× instead of a 1× beads ratio was applied during the second purification (see notes in section D for more details).Notes:  In our experience, cells with very low viability (less than 30%), usually do not show good amplification after 9 cycles of PCR. Though these libraries can be further amplified and sometimes a pattern resembling the nucleosomal banding pattern may appear, the risk of PCR bias is very high for such samples, and we recommend not to proceed with the sequencing of such samples. If after 9 PCR cycles, samples with good starting cell viability do not show amplification, we recommend a few extra amplification cycles (no more than 4). After the first library purification, most of the experiments will still have primer dimers and/or fragments over 1,000 bp (Figure 1A and 1C). Another issue could be the presence of a big low molecular weight peak (3 to 4 times taller than the other 2 peaks, Figure 1E).",
    "The presence of this peak could be due to over-digestion with the transposase or over-PCR amplification. This big peak can be problematic during the sequencing process, due to the fact that the DNA in this peak will be preferentially sequenced, because of its lower molecular weight compared to the other two peaks. In all three cases, the library should be submitted to a second bead purification: (i) Libraries with primer dimers and fragments over 1,000 bp (Figure 1A) will need the double-sided bead clean-up described in Step D1. On this occasion, the beads ratio in Step D1e should be 1×, and the incubation times in Steps D1b and D1f should only be 5 min (Figure 1B). (ii) If the library only has primer dimers (Figure 1C), we recommend doing a left-side clean-up with a 1× beads ratio (Step D2) (Figure 1D). 3) If in both situations the big low molecular size peak is also present (Figure 1E), the beads ratio in Steps D2b and D1e should be 0.95× (Figure 1F). If needed, perform a left-sided SPRI bead purification.Add nuclease-free water to the sample from Step E1n up to 50 μL.Add 1× volume (50 μL) SPRI beads to the PCR samples, and pipet up and down 10 times to mix thoroughly.Quickly spin the tubes down for 3 s and incubate for 5 min at room temperature.Place PCR tubes in a magnetic rack for 5 min or until the supernatant is clear.Carefully remove supernatant and discard it.Wash beads twice with 200 μL of 80% freshly made ethanol.Eliminate ethanol traces by spinning the tubes down for 3 s, placing them back in a magnetic rack, and aspirating the ethanol with a P10 pipet tip.Resuspend beads in 15 μL of nuclease-free water.",
    "Quickly spin the tubes down for 3 s and incubate for 1 min at room temperature.Place PCR tubes in a magnetic rack for 5 min or until the supernatant is clear.Transfer 14 μL of supernatant to a new tube.Run 1 μL of the sample with high sensitivity chip Bioanalyzer (Figure 1D).Samples can be stored at -20°C."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Biochemistry",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}