{
  "id": 13182,
  "origin_website": "Jove",
  "title": "Dissection and Live-Imaging of the Late Embryonic Drosophila Gonad",
  "procedures": [
    "1. Day-before-dissection preparation\nElectrolytically sharpen a tungsten needle24 so that the resulting diameter is approximately 0.03 mm. Adjust the voltage supplied to approximately 14 V, and use 3.3 M NaOH. Sharpening should take no more than 1 or 2 min.\n\tCAUTION: NaOH is highly corrosive and will cause burns upon contact with skin. Wear gloves and goggles while handling, and work inside a fume hood.\n\tNOTE: After use, store NaOH in a polypropylene Falcon tube.\nMake the prepared imaging media. In a 15 mL conical tube, combine 4.25 mL of Schneider’s media with 750 µL of Fetal Bovine Serum (FBS, 15% final concentration) and 27.5 µL of Penicillin-Streptomycin (0.05 U/µL of Penicillin, 0.05 µg/µL final concentration). Store this prepared imaging media at 4 °C.\nMake heptane-glue solution. Add about 0.5 mL heptane to a 20 mL sealable vial stuffed with about 20 cm double-sided tape. Rock on a nutator for about an hour, or stir with a pipette tip until a consistency between that of water and glycerol is achieved. This solution of dissolved glue will last for several days before the heptane evaporates. To freshen the solution, add an additional 0.5 mL heptane, and rock.\n\tNOTE: An effective heptane-glue solution can be prepared using various ratios of heptane to tape, as well as varying durations of rocking/stirring. The above specifications are merely suggestions for preparing or freshening one such adequate solution.\n2. Embryo collection—15–17 h before dissection",
    "Add fresh yeast paste to an apple juice agar plate25. Set up an embryo collection cage by adding adult flies (less than 10 days old) to an empty food bottle, perforated with small holes26. Cap the collection cage using the yeasted agar plate, taped to the bottle, and place the cage with the plate side down in a 25 °C dark incubator for 1 h.\n\tNOTE: The flies must express a transgene that will fluorescently mark the gonad, for example, six4-eGFP::Moesin20, because dissection of embryos will take place under a stereo-fluorescent microscope. See Table of Materials for a list of genotypes used to mark the gonad.\nRemove the cage from the incubator and discard this first collection. Replace it with a freshly yeasted agar plate and place the cage back in the incubator for 2 h.\n\tNOTE: The first embryo collection is used to clear females of fertilized, developing embryos, to achieve a tightly timed second collection of embryos.\nRemove the agar plate from the cage and place it (with yeasted side facing upward) on a moist paper towel inside a sealable plastic container. Place this humid chamber in a 25 °C incubator to age the embryos for 14.5 h (final ages, 14.5–16.5 h after egg lay).\n\tNOTE: Immediately before beginning step 2.4, complete steps 3.1 and 3.2.\nRemove the agar plate from the incubator, and using a squirt bottle, add enough water to the agar plate to dissolve the yeast paste by brushing lightly with a paint brush. Rinse the embryos and dissolved yeast into a small mesh screen basket sitting inside a weigh boat. Rinse the basket with the water squirt bottle until most yeast paste has filtered through the mesh.",
    "Remove the water from the weigh boat and place the basket back inside. Dechorionate the embryos by immersing them in a 50% bleach solution, using a squirt bottle. The bleach solution should have a depth of 3–5 mm. Keep the embryos submerged in bleach for ~2 min, with occasional swirling.\n\tCAUTION: Bleach is corrosive and can irritate or damage eyes and the respiratory tract. Wear gloves and goggles while handling bleach.\n\tNOTE: During this time, complete as much as possible of step 3.3. Dechorionation progress can be checked by placing the basket under a stereo microscope and checking for the absence of the dorsal appendages. Submerge the embryos in the bleach solution for additional time, if necessary.\nDiscard the bleach, and thoroughly rinse the embryos inside the basket with water from a squirt bottle (for ~3 s, blotting the mesh basket with paper towels; repeat 2–3 times).\n3. Day-of-dissection preparation\nAdd 30 µL insulin (10 mg/mL) to 1,500 µL prepared imaging media (see step 1.2) in a 1.5 mL Eppendorf tube (0.2 mg/mL final concentration). Mix well and leave the tube on the benchtop to equilibrate to room temperature.\nPrepare coverslip strips coated with glue.\n\t\nUse a diamond-tipped knife to cut a 22 mm x 22 mm coverslip into four, equally sized strips (Figure 1A).\nUse forceps to pick up one strip and spread a total of approximately 30 µL of heptane-glue solution onto both sides of the strip (Figure 1B). To achieve an even layer of glue residue, tilt the strip at various angles while the heptane evaporates.",
    "Store the glue-covered strip in an empty slot of a coverslip box; to maintain its stickiness, place the strip in a slanted, but upright position, leaning against the edges of the box to minimize contact with box surfaces (Figure 1C). Close the box so that particulates in the air do not coat the glue and lessen its stickiness.\nPlace the following items on the benchtop: a 6-inch glass Pasteur pipette, a microscope slide, a P200 and a P1000 pipetteman with the appropriate pipette tips, Ringer’s solution27 (pH adjusted to 7.3 with NaOH), and an uncovered, Poly-D-Lysine-coated 35 mm imaging dish.\nTransfer embryos from the mesh screen basket to a small watch glass filled with 500–750 µL heptane.\n\t\nBlot the sides and bottom of the basket dry with a tissue wipe. Moisten a paintbrush in the heptane, touch the paintbrush to the embryos (the hydrophobic vitelline membrane should adhere to the bristles), and dip the paintbrush back into the heptane in the watch glass (embryos should sink to bottom).\n\t\tNOTE: The next steps must be performed as quickly as possible to prevent the embryos from drying out. Embryos should not be exposed to air for more than 20 s.\nTransfer the embryos onto the microscope slide using a Pasteur pipette (Figure 1D). Draw embryos into the pipette slowly and limit them to the narrow portion of the pipette. Pipette embryos onto the slide slowly, such that they aggregate just inside the tip of the pipette before flowing onto the slide. Twist the corner of a tissue wipe into a fine tip, and wick away heptane from embryos on the slide. They will aggregate and cover a smaller area, making it easier to capture them on a glue-covered strip in the next step.",
    "With forceps, pick up a glue-covered strip, and gently touch it to the embryos (Figure 1E). Place the strip in the imaging dish, embryo side-up, and just outside of the Poly-D-Lysine-coated center. Press the strip onto the dish using forceps, to ensure it is fixed in place. Immediately flood the dish with 2–3.5 mL Ringer’s solution; submerge the embryos first to prevent them from drying out (Figure 1F).\n4. Dissection\nNOTE: These steps must be carried out under a stereo-fluorescent microscope.\nDevitellinize 10–15 embryos.\n\tNOTE: This may range from two embryos, for beginners, to fifteen embryos, for experts.\n\t\nSelect Stage 16 embryos based on gut morphology (Figure 2). At this stage, embryos have three gut constrictions that create four stacked gut segments (Figure 2B,B’). To begin devitellinization, pierce the selected embryo at one end, preferably the anterior, with the tungsten needle. The embryo may pop out of its vitelline membrane, but if not, peel the membrane off of the embryo.\n\t\tNOTE: Embryos that are too young to dissect have non-regionalized guts (Figure 2C). Dissection of Stage 17 embryos is possible, but more challenging than dissection of Stage 16 embryos because the cuticle is beginning to develop at this stage. Early Stage 17 embryos present with four gut segments that are shifted relative to one another (Figure 2D,D’).\nHook the needle through the embryo in a region far from the gonads. Transfer the hooked embryo to the Poly-lysine-coated region of the dish (from here onwards referred to as simply “cover slip”) and drag it against the bottom until it adheres. Repeat these steps, and arrange devitellinized embryos in a row along the top of the Poly-lysine-coated cover slip (Figure 3A), leaving plenty of space below for further dissection.",
    "NOTE: The gonads appear as small spherical aggregates of cells that should fluoresce brightly, depending on the specific marker used and transgene copy number. At this stage, the gonads are located laterally in segment A5, at approximately 70%–80% of embryo length from anterior. Throughout the Dissection protocol, the tissue may stick to the needle. To rid the needle of the debris, raise it just above the surface of the Ringer’s solution. Devitellinization can be untidy as long as the gonad proper is disturbed as little as possible.\nFinesse the gonads out of the embryo and onto the dish (Figure 3C,D).\n\t\nFirst, filet the embryo to expose its interior (Figure 3C). Slice through the embryo from its center, moving the needle posteriorly, between the gonads. Tease out some internal tissue, as this will stick to the dish much better than the external cuticle. The stickiness of the tissue will enable the next manipulations to reveal the gonad and allow it to adhere to the cover slip.\n\t\tNOTE: If tissue is not sticking to the dish, try coaxing it to an uncontaminated region of the coated cover slip; the outer regions of the cover slip will be particularly sticky. As stated in step 4.1.2, it does not matter if the dissection manipulations result in a mangled embryo carcass, as long as the gonads remain unscathed.\nUse the needle to slice around a gonad until a piece of tissue, including the gonad, is separated from the remaining carcass. With the needle, draw this tissue to a fresh region of coated cover slip, and coax it against the bottom until it adheres to the dish.",
    "NOTE: The best imaging will be achieved for those cases where the gonad itself attaches directly to the cover slip, rather than indirect attachment via overlying tissue. Therefore, as tissue is guided away from the carcass, attempt to have the gonad touch the cover slip first, rather than extraneous tissue.\nRemove as much surrounding tissue from the gonad as possible (Figure 3D) by gently dragging adherent tissue away from the gonad with the needle. Avoid touching the gonad directly, which would damage it (Figure 4E). To ensure the gonad is sufficiently adhered to the dish, move the needle in a gentle circular motion around the gonad—if it moves, touch the needle to the remaining adherent tissue, and direct the gonad toward a fresh region of sticky cover slip. Repeat this process until there is no detectable movement of the gonad.\nReturn to the embryo carcass and dissect out the second gonad. Repeat this process on as many embryos as possible but do NOT exceed 25 min. Tissue viability will be compromised in Ringer’s solution after more than ~40–45 min.\nAfter dissections are complete, use an indelible marker to add registration marks to the outer rim of the imaging dish to record its orientation during dissection.\nRemove the glue-coated strip from the dish.\n\t\nGently insert the bottom prong of a pair of forceps underneath the strip, clasp and slowly tilt the strip upwards to free it from the dish with as little sloshing of the Ringer’s solution as possible to minimize disturbance of the adhered gonads.\n\t\tNOTE: The strip should be tilted away from the dissected-out gonads.\nGently carry the dish to the imaging microscope in a manner that avoids sloshing of the Ringer’s solution.\n5. Imaging",
    "Place the imaging dish in the stage holder, using the registration marks to place the dish in the approximate orientation as during dissection. Using brightfield microscopy and a low power (~10x) objective, identify and bring into focus any piece of tissue that is adhered to the cover slip. Switch the eyepiece settings to reveal fluorescence, and using the binocular eyepieces, systematically scan the dish, marking the position of each gonad within the imaging software (see Table of Materials).\n\tNOTE: Make sure gonads are centered in the field-of-view before marking positions.\nGently remove the entire stage holder assembly, with the imaging dish in its holder, and place the assembly on the work bench.\nReplace the Ringer’s solution with the prepared imaging media containing insulin (see steps 1.2 and 3.1).\n\t\nUse a P1000 to remove all Ringer’s solution from the inside upper ledge of the imaging dish (do not pipette Ringer’s from the central cover slip region). Next, switch to a P200, and place its tip just under the surface of the remaining Ringer’s in the central region. Carefully remove 50–100 µL of Ringer’s; do NOT remove the entire solution.\nDraw up ~200 µL of imaging media, and, again placing the P200 tip just under the surface of the remaining Ringer’s, slowly add this imaging media. Next, add the remaining imaging media (~1,300 µL) to the dish, starting at the outermost rim of the upper ledge. While pipetting, move toward the central dome of the fluid, and eventually merge the two by brushing the pipette tip across them both. Place the lid on the dish.\n\t\tNOTE: Imaging media should cover the entire inside diameter of the dish, with a depth of about 2 mm, to prevent evaporation (Figure 4D).",
    "Switch the microscope to a higher power objective (63x, 1.2 NA), apply the proper immersion fluid based on the objective used (immersion fluid type and refractive index required by the objective), and then replace the stage holder assembly. Use brightfield microscopy to focus on tissue adhered to the bottom of the imaging dish.\n\tNOTE: If the stage was not moved, the last gonad should come into view once the objective is focused.\nStep through each marked gonad position and adjust that position, as necessary. Select which gonads to image based on image clarity, gonad sex, etc. Customize the imaging settings (multi-channel, exposure times, laser intensities, Z-series increments, time-lapse with appropriate intervals, etc.). Begin imaging.\n\tNOTE: Male gonads can be identified by the presence of both a niche, and at the opposite end of the gonad, a cluster of small, highly circular somatic cells called male-specific somatic gonadal precursors (msSGPs). If the six4-eGFP::moesin fluorescent marker is used, the niche cells are the second-brightest cells in the gonad, the brightest being the msSGPs. At this stage, female gonads have neither a niche nor msSGPs.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}