{
  "id": 15242,
  "origin_website": "Jove",
  "title": "Informatic Analysis of Sequence Data from Batch Yeast 2-Hybrid Screens",
  "procedures": [
    "1. Mapping Fastq Files\nNOTE: DEEPN software as well as many bioinformatics programs use DNA sequence data wherein each sequence read has been mapped for its position in reference DNA. A variety of mapping programs can be used for this including the MAPster interface here that uses the HISTAT2 program to produce .sam files used in subsequent steps.\nMap the sequence data to the correct version of the genome. For Y2H libraries of mouse origin, use the UCSC mm10 genome; for those using human genes, use the UCSC hg38 reference genome, for Saccharomyces cerevisiae genes, use the UCSC SacCer3 reference genome.\nInstall MAPster.\nDownload MAPster software and install. The software can be found using a web browser at the following: https://github.com/emptyewer/MAPster/releases. HISAT2 runs on Unix-based systems such as an Apple Macintosh. Because of this, the MAPster program will only run on compatible systems such as Apple Macintosh and linux.\n\t\tNOTE: System requirements for an Apple Mac are: OSX 10.10+, >4 Gb RAM, >500 Gb disk space, and internet access for downloading reference genomes. Users may need to consult with an institutional IT person if their enterprise has security protocols restricting administrator rights and permissions.\nEnter required files and parameters through the \"Main\" tab (Figure 1). Select the appropriate \"Pairwise\" button to enter files either as pairs or unpaired with FASTQ as the default file format.\nFor DEEPN analysis, turn the \"Pairwise\" option to \"Off\" to run in single read format.\nLoad files into MAPster simply by drag-and-drop into the appropriate window.",
    "Select a reference DNA/genome source that corresponds to the source of the Y2H prey library inserts. Indexed genomes from several model organisms are listed in the \"Genome\" box and can be automatically downloaded from the Johns Hopkins University Center for Computational Biology. Reference genomes will be stored locally for later use.\nIndicate the number of computer processes to be devoted to the mapping program under the \"Threads\" box, since HISAT2 supports multi-threading. MAPster will search the computer and suggest the maximum number of processors available as a default.\nSpecify an output file name. This file name will be used throughout the DEEPN process so a short yet descriptive name without space or special characters is recommended. Specify a folder to output the mapped files using the \"Open Output Directory\" button.\nOnce the appropriate files and parameters have been selected, add the mapping job to the jobs queue using the \"Add to Queue\" button. The file names in the main window can be deleted and replaced with files corresponding to a new sample and they can be added to the queue after providing a corresponding output filename.\nClick the \"Run Queue\" button once all the jobs are entered into the job queue.",
    "NOTE: Once a mapping job has been placed in the queue, selecting that job causes the parameter settings to be displayed in the \"Job Parameters\" window and the command line statement with all arguments to be displayed in the \"Job Command\" window. The output options include directing whether to keep reads that fail to align and specifying the number of primary alignments allowed for each read. The default output file from MAPster is in SAM format (e.g. a '.sam' file). It will contain all the sequence reads from the fastq files specified for that sample including those that were (mapped) and were not (unmapped) successfully mapped to the specified geome.\n2. Bioinformatic Processing Using DEEPN Software\nNOTE: DEEPN software is currently compiled for use with prey libraries containing mouse cDNA sequences, human cDNA sequences, or S. cerevisiae genomic DNA sequences. DEEPN accepts the standard .sam file format and can accept a SAM (.sam) file containing both mapped and unmapped reads or separate files for each of the unmapped and mapped reads.\nDownload DEEPN software and install. The software can be found using a web browser at the following: https://github.com/emptyewer/DEEPN/releases. Select which version matches the computing platform and download. To install, open the downloaded install package.\n\tNOTE: Versions of DEEPN are available for PC, Mac, and Linux sysrems. Mac and PC systems should have >500 Gb hard disk space and >4 Gb RAM.\nOpen the DEEPN software. From the main window (Figure 2) select the corresponding prey library information from the top selection box. Select a folder where the processed files can go by clicking the \"Work Folder\" button and navigating to the folder/directory. One can create a new folder/directory if needed. Once a \"Work Folder\" is selected, DEEPN will create three subfolders entitled unmapped_sam_files, mapped_sam_files, and sam_files.",
    "If using .sam files containing both mapped and unmapped reads such as those produced with default settings of the MAPster program, place them in the 'sam_files' folder. Otherwise place .sam files into the unmapped_sam_files and mapped_sam_files accordingly.\nInitiate processing by clicking the \"Gene Count+Junction Make\" button.\n\tNOTE: Processing will begin with the Gene Count module that will use mapping positions to count how many reads correspond to each gene. Junction Make will then extract junction sequences (the sequences fused directly downstream from the Gal4-activation domain) from the reads and identify them using the Blast algorithm. This will create a full set of folders pictured in Figure 3. Processing time depends on the size and number of sequence data files and processing speed of the computer used. Typical times range from 12–30 h for an experimental dataset of ~250 million reads. The Gene Count procedure and the Junction_Make procedure can be individually started by clicking the \"Gene Count\" button or the \"Junction Make\" button.\nDownload and install Stat_Maker (https://github.com/emptyewer/DEEPN/releases). This is a statistical analysis package designed for DEEPN datasets that currently works only on Unix Mac systems.\nOpen Stat_Maker and click the button \"Verify Installation\" (Figure 4). If running for the first time, Stat_Maker will automatically install R, JAGS, and Bioconductor by pulling these resources from the internet. Once R, JAGS, and Bioconductor are detected, Stat_Maker will become active and allow further user input.\nClick the \"Choose Folder\" button to navigate to the working folder that DEEPN processed. Stat_Maker will automatically find and list the files for statistical analysis in the window.",
    "Drag and drop the appropriate files from the file list window above into the file windows below for each vector and bait dataset and for each growth conditions: non-selected (His+ media) and selected (His- media). Importantly, Stat_Maker requires duplicate datasets for empty vector alone, two samples of non-selected populations and two samples of selected. This gives an estimate of variability within the experiment.\nClick the \"Run\" button. Depending on the speed of the computer, computation will take between 5–15 min.\nReview results from the Stat_Maker output, which are placed in a new subfolder within the main work folder labeled \"Stat_Maker Results\".\n\tNOTE: The results are found in a CSV (comma-separated values) file that can be opened in common spreadsheet programs. Stat_Maker will rank gene hits that are likely to be differentially enriched upon selection with the bait of interest over the empty pTEF-GBD (Figure 5). Also tabulated is the percentage of reads for each dataset where the gene insert is found upstream, downstream, or within the open reading frame and whether the gene is also found within the correct translational reading frame. Often, DEEPN will capture robust Y2H interactions of a bait with portions of a given cDNA that are out of the proper reading frame of the corresponding protein or are to a portion of the cDNA that is downstream of its corresponding open-reading frame. Scanning the combined output from Stat_Maker streamlines detection and elimination of these irrelevant hits.\nTo review the data on each potential candidate, open the DEEPN software, select the corresponding prey library information and then the correct working folder using the \"Work Folder\".",
    "Click the \"Blast Query\" button. This loads a new window (Figure 6). In the top text box, type the gene name or GenBank NM number to select the candidate gene of interest. These gene names correspond to the names listed in the StatMaker output file. Type enter or return, which initiates retrieval of the gene of interest.\nSelect which datasets will be used for the analysis using the \"Select Dataset\" menus. Typically, these include the Vector only and Bait samples grown under non-selective conditions and the Bait sample grown under selection conditions. Initially, the datasets will take a few moments to load, however, subsequent query of the same datasets with different genes will go rapidly. Blast_Query will display the fusion points along the sequence of interest and how abundant each fusion point is. This can be displayed both in a table format using the \"Results\" tab or a graphic format using the \"Plot\" tab. These results can be exported to a .csv file by clicking the \"Save .csv\" button in the top right.\n3. Verification of Candidates Identified by DEEPN",
    "NOTE: The purpose of DEEPN and Stat_Maker is to identify candidate genes that give a positive Y2H interaction. Verifying such Y2H interactions can be done using a traditional binary Y2H format using the bait plasmid of interest paired with the empty Gal4-activation domain 'prey' plasmid as well as paired with the prey plasmid carrying the gene/cDNA fragment of interest. It is not feasible to isolate the actual plasmid of interest within the mixture of DNA isolated from the yeast population subjected to Y2H selection. However, one can computationally reconstruct what the gene/cDNA fragment is that produces the Y2H interaction, design primers for the 5' and 3' ends of that fragment, and amplify that fragment from the DNA isolated from the yeast population. This section describes how to find the 5' and 3' end of the candidate prey fragment.\nOpen the DEEPN software and choose the parameters \"Select Parameter\" and the work folder \"Select Work Folder\" corresponding to the project. Launch the Blast_Query module by clicking the \"Blast Query\" button.\nType the name of the gene of interest or its GenBank \"NM\" number in the top text box. Select from the pull-down menu the dataset that corresponds to the selected yeast population for the bait of interest to retrieve the table of junction positions under the 'Results' tab. By default, Blast_Query will order the different positions according their abundance in the dataset, quantified by the ppm of the total number of junctions found within the database.",
    "Find the most abundant position that is \"In ORF\" and \"In Frame\". The value for position corresponds to the nucleotide position of the gene with the NCBI Reference Sequence ('NM' number) found in the top text box. This sequence can be retrieved from GenBank (https://www.ncbi.nlm.nih.gov/nuccore/) or copied from the lower text box in the Blast_Query window.\n\t\tNOTE: An example can be found in Figure 6, middle panel. In the center dataset, the 'Results' show as the most abundant junction: 'Position': 867; '#Junctions': 20033.821; 'Query Start', 1; CDS: In ORF; and 'Frame': In Frame. Nucleotide 867 of the GenBank NCBI reference sequence NM_019648 is the start of the prey fragment.\nIf the Query Start is 1, design the 5' end of the primer to include the nucleotide corresponding to the position number and extend 25 nucleotides downstream from that position (Figure 7). If Query Start is more than 1, it indicates that there are extra nucleotides between the Gal4 activation domain and the prey sequence of interest and that the primer should start further downstream according to the Query Start value.\nFrom the DEEPN window click the \"Read Depth\" button under \"Analyze Data\". Once the Read Depth window is open, type the NCBI reference sequence (NM) number or gene name into the top text box. Use the pull-down menu to select the relevant dataset that contains the enriched gene of interest. Use the Table on the left and the graphics display on the right to determine how many reads were found in the data that correspond to the gene of interest (Figure 7B).",
    "Design a 3' end primer that will capture the sequence of the gene fragment computed by Read Depth. If the abundance of reads goes beyond the ORF and stop codon, design the primer so that it includes the stop codon and the region just upstream of the stop codon. If the sequences for the gene do not extend to past the stop codon, use the Results Table to find the most distant 3' region that can be detected and use this position as the furthest 3' position to place the primer.\n\tNOTE: The Read Depth program scans in intervals to find sequences that match the specified gene/cDNA of interest. This helps predict where the 5' and 3' end of the most abundant prey fragment is for that gene in the sample. Fluctuations in the read depth along the length of the sequence are normal, as can be seen in Figure 7. If the read depth is clearly past the stop codon, it indicates that the prey fragment extends beyond the stop codon and thus the 3' primer can simply correspond the region around the stop codon.\nPerform a 50 µL PCR reaction per gene. Each reaction contains 25 pmol of each forward and reverse primer matching the prey-library plasmid (see Table of Materials). Reactions also contain 25 µL of High-fidelity 2x PCR Master Mix, 5 µg of DNA sample, and water up to 50 µL.\nAmplify reactions for 25 cycles with extension times of 3 min at 72 °C, annealing temperature of 55 °C for 30 s, and denaturing at 98 °C for 10 s. Precede cycling by a 30 s denaturation at 98 °C and follow with a 5 min incubation at 72 °C.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}