{
  "id": 2080,
  "origin_website": "Cell",
  "title": "Bioprinting of heterogeneous and multilayered cell-hydrogel constructs using continuous multi-material printing and aerosol-based crosslinking",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nInstallation of the multibarrel nozzle and crosslinking aerosol tube on the printing head\nTiming: 1 h\nThe role of this step is to assemble the multibarrel nozzle (Section of ‘multibarrel nozzle processing[href=https://www.wicell.org#sec1.2]’ in Before you begin) and aerosol tube (Section of ‘preparation of nebulizing system components[href=https://www.wicell.org#sec1.3]’ in Before you begin) using the 3D printed components (Section of ‘preparation of bioprinting system components[href=https://www.wicell.org#sec1.1]’ in Before you begin) on the modified printing head (Section of ‘preparation of 3D printer and modification of the printing head[href=https://www.wicell.org#sec1.4]’ in Before you begin) as shown in Figure 3[href=https://www.wicell.org#fig3] and Methods video S2[href=https://www.wicell.org#mmc2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1564-Fig3.jpg\nFigure 3. The continuous multi-material bioprinting system consisting of a multibarrel nozzle and a crosslinking aerosol tube\nYellow arrows indicate the tightening parts using screws.\nAssemble the stopper into the groove on the back of the printing head.\nInstall the printing head in the gantry, and then assemble the prepared holders for the multibarrel nozzle holder and aerosol tube on the printing head (troubleshooting 1[href=https://www.wicell.org#sec6.1]).\nConnect the Tygon tubes from the pneumatic pump to the metal tubes of the nozzle adapter, and then insert the fully assembled nozzle into the holder of the printing head.\nConnect the PVC tube with a nebulizer, and then insert the aerosol tube into the holder of the printing head.\nOptional: End-user can change the length of the nozzle-pump tube and aerosol tube. However, the range for movement of the printing head should be considered to avoid the tension of the tubes. All components were sterilized and handled inside BSC.\nPause point: After the installation of the bioprinting system, the end-users can pause the protocol. Before printing with the biomaterials in the next steps, we recommend preparing the bioinks in advance and then using it to print immediately.",
    "Your browser does not support HTML5 video.\n  \nMethods video S2. Assembly of a continuous multi-material bioprinting system, related to steps 1–4 in the “step-by-step method details” section\nContinuous printing of multiple bioinks under crosslinking aerosol\nTiming: 2 h\nThe role of this step is to print the multiple bioinks and confirm the continuous multibioink printing system. Here, the authors printed the seven-different colored alginate hydrogels under optimal printing conditions with crosslinking aerosol.\nPrepare the seven-different colored 4% alginate inks by mixing food dye (pure alginate, red-, yellow-, green-, sky blue-, deep blue-, brown-colored alginates) and connect them to the pumping system via the Tygon reservoir and the tube.\nPrepare the 2% and 10% CaCl2 solution and pour into the Petri dish (for complete gelation of the alginate construct after printing) and the nebulizer (for retaining alginate structure by fast gelation during printing), respectively.\nFill the bioinks into the multibarrel nozzle by applying a pneumatic pressure of 2,000 mbar.\nAfter checking the extruded bioinks through the nozzle tip, turn off the pump to stop extrusion.\nPrepare the GCode for continuous printing and the pressure control program.\nBefore starting a printing process, turn on the nebulizer to supply 10% CaCl2 aerosol (troubleshooting 2[href=https://www.wicell.org#sec6.3]).\nStart the pumping program and the GCode for continuous extrusion at the same time (see Figure 1[href=https://www.wicell.org#fig1]B and supplemental data in our original report, Lee et al., 2021[href=https://www.wicell.org#bib2]).\nAfter the end of printing, immediately dip the printed sample into the crosslinking solution for 3 min for fully crosslinking of the printed hydrogels (troubleshooting 3[href=https://www.wicell.org#sec6.5]).\nAfter the crosslinking is complete, wash the printed sample with Dulbecco’s phosphate-buffered saline (DPBS) three times.",
    "Observe the sample on the microscope to optimize the printing conditions. Here we applied a pressure within the range from 200 mbar to 800 mbar and a speed of 100 mm/min as the optimal condition for printing seven-different colored alginate inks.\nPrinting of heterogeneous and multilayered cell-hydrogel construct\nTiming: 30 min\nThe role of this step is to continuously print the complex biological construct such as the heterogeneous and multilayered cell-hydrogel construct under crosslinking aerosol. Here, to demonstrate a TME, we use the four bioinks, including cancer cells, vascular endothelial cells, and stromal cells. Each bioink consisted of the optimal composition of hydrogel blend and cells for observing cancer cell migration or vascular network formation. If the end-user wants to mimic a specific physiological microenvironment, we recommend firstly finding the optimal composition of bioinks and then using the bioink for printing (see Figure 6 in our original report, Lee et al., 2021[href=https://www.wicell.org#bib2]).\nBring the four bioinks (cancer bioink, vascular bioink, fibroblast bioink, and supporting bioink) and connect them to the pumping system via the Tygon reservoir and the tube.\nFill the bioinks into the multibarrel nozzle by applying a pneumatic pressure of 2,000 mbar and a speed of 100 mm/min.\nAfter checking the extruded bioinks through the nozzle tip, turn off the pump to stop extruding.\nBefore starting a printing process, turn on the nebulizer to supply 10% CaCl2 aerosol (troubleshooting 2[href=https://www.wicell.org#sec6.3]).\nStart the pumping program and print the GCode for the TME construct at the same time.\nAfter the end of printing, immediately harvest the printed sample and dip it into the crosslinking solution for 3 min for fully crosslinking of the printed TME construct (troubleshooting 3[href=https://www.wicell.org#sec6.5]).\nAfter the crosslinking is complete, wash the printed TME construct with DPBS three times.",
    "Dip the TME construct into the EGM-2 culture medium.\nCheck the heterogeneous multilayered TME construct by observing the green fluorescent. cancer cells (GFP MDA-MB-231) in the bottom layer and red fluorescent vascular endothelial cells (RFP HUVECs) in the top layer on the microscope or confocal microscope over the culture time (The multilayered and heterogeneous TME construct should be compartmentalized with well-defined interfaces as shown in Figures 6B–6D in our original report, Lee et al., 2021[href=https://www.wicell.org#bib2]).\nFor immunostaining of the tight junction CD-31 of HUVECs, see the protocol of Lee et al. (2021)[href=https://www.wicell.org#bib2]. After the fixation process of a TME construct, the CD-31 antibody which was diluted to 1/100 with phosphate-buffered saline (PBS) was treated with the fixed TME construct and incubated at 4°C for 24 h (troubleshooting 4[href=https://www.wicell.org#sec6.7]).\nAnalyze the morphological characteristics of cancer cells and vascular endothelial cells tri-cultured in the printed TME (troubleshooting 5[href=https://www.wicell.org#sec6.9]).\nNote: If the end-user already has the verified protocol, we recommend following your protocol. All components were sterilized and handled inside BSC."
  ],
  "subjectAreas": [
    "Cell Culture",
    "Tissue Engineering",
    "Biotechnology And Bioengineering",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology"
  ]
}