{
  "id": 1660,
  "origin_website": "Cell",
  "title": "Domain-specific biochemical and serological characterization of SARS-CoV-2 nucleocapsid protein",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDynamic light scattering (DLS)\nTiming: 2 h\nDLS measures hydrodynamic properties of purified RNA-free nucleocapsid protein to monitor oligomerization using a Wyatt DynaPro PlateReader-III. This assay is useful to characterize particles with a wide range of hydrodynamic radii from 1 nm to 1000 nm (Figure 3[href=https://www.wicell.org#fig3]) (Stetefeld et al., 2016[href=https://www.wicell.org#bib16]; Su et al., 2018[href=https://www.wicell.org#bib17]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1122-Fig3.jpg\nFigure 3. Dynamic light scattering assay for size characterization\nBrownian motion of particles produces dynamic light scattering signals. These intensity fluctuations contain useful information and diffusion coefficients from autocorrelation analysis that can be converted to size.\nThaw purified protein on ice.\nFilter DLS buffer with a 0.22 μm filter.\nDilute protein solution into 2 mg/mL. Prepare 120 μL of sample for each protein, sufficient for technical triplicates. With Corning® Low Volume 384-well Clear Flat Bottom plate (Corning 3540), each well requires 35 μL of sample.\nNote: To adjust salt concentration, prepare buffer without salt for a simple calculation. First calculate the amount of buffer without salt needed for dilution, then dilute with DLS buffer to target for desired protein concentration.\nCritical: Centrifuge sample for 5 min at 4°C using a tabletop centrifuge at top speed to remove aggregates.\nLoad 35 μL sample into each well.\nNote: Before loading, check for presence of dust in wells. Cover plate with aluminum foil whenever possible when not loading to reduce likelihood of dirt getting inside.\nCritical: While loading, place pipette tip on the bottom of well and pipet slowly. Avoid generating bubbles. Gently shake plates if bubbles are trapped inside and remove bubbles by pipetting. It is important to get rid of bubbles before experiments.\nSet up experiment for acquisition.\nCorrelation function high cutoff set to 60 ms.\nAcquire well images set to Yes.\nDLS Acq time set to 5 s.",
    "DLS Number Acq set to 10.\nAuto-attenuation time limits set to 60 s.\nWhen analyzing data, access Regularization Graph and use triplicates to reach consensus.\nRemove peaks with less than 1% mass.\nAlign triplicates to check consistency for each major peak.\nDetermine statistics of measured radius across triplicates.\nRepeat with newly prepared sample to check consistency across runs.\nNote: DLS is extremely sensitive to dirt and bubbles. Use well images to check sample conditions and repeat when inconsistency arises. Please refer to Wyatt for additional guidance on instrument specific protocols.\nFluorescence polarization (FP) assay\nTiming: 1 day\nTiming: 2 h for step 7\nTiming: 1 h for step 13\nThe FP assay uses fluorescently labeled RNA and titrates increasing concentrations of protein for affinity estimation based on polarization change of fluorescence label upon binding (Figure 4[href=https://www.wicell.org#fig4]). Due to the high sensitivity of this technique, as low as 1 nM FITC-labeled RNA can be used, making it a useful probe for high affinity binding system (Liu et al., 2017[href=https://www.wicell.org#bib8]; Su et al., 2018[href=https://www.wicell.org#bib17]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1122-Fig4.jpg\nFigure 4. Fluorescence polarization assay for nucleocapsid-RNA binding",
    "(A) Principle for fluorescence polarization based RNA binding assay. Fluorescence labeled RNA molecules tumble fast and do not lead to preferential orientation. This results in depolarized emission that can be recorded with equal parallel and perpendicular fluorescence intensity. This corresponds to low FP values. After binding with protein, labeled RNA tumble slowly resulting in residual orientation that can be recorded with increased fluorescence polarization. By titrating protein concentration, the varying FP values will yield a binding curve that can be fit for a KD. (B) Fluorescence polarization assay in 96 well plate. First, a protein dilution series is prepared. Depending on binding mechanism which results in different curve shape, choose a suitable dilution factor to cover both unbound and bound side of baselines. A 2.5 fold dilution usually is a good starting point for a 12 point dilution series. After the dilution series are prepared, load protein first into wells and then labeled RNA. Cover solution containing labeled RNA with aluminum foil whenever possible to reduce quenching. A 10 min shake and incubation is recommended before reading with plate reader. Adapted from “Fluorescence Polarization Assay”, by Biorender.com[href=http://Biorender.com] (2020). Retrieved from https://app.biorender.com/biorender-templates[href=https://app.biorender.com/biorender-templates].\nPrepare protein titration series.\nDetermine highest concentration point and fold of dilution. For nM affinity binding, a 2.5 fold dilution series with 12 concentration points starting with 10 μM as highest concentration and 0.42 nM as lowest concentration covers the entire binding curve. This step usually requires optimization.",
    "Note: FITC labeled RNA at 1 nM concentration in this assay setup results in reasonable signal. Optimize RNA concentration with a known RNA binder so Z-factor is above 0.5.   Z = 1 −   3  ( σ  ( p )   + σ  ( n )  )   μ  ( p )  − μ  ( n )     ,   μ   and   σ  are means and standard deviations of positive (p) and negative (n) controls.\nPrepare 120 μL of highest concentration point for the entire dilution series (each concentration point needs a volume of 25 μL and duplicates need 60 μL). Binding buffer is same as DLS buffer has 150 mM NaCl.\nPipette 90 μL binding buffer into each of 11 Eppendorf tubes. Take out 60 μL from highest concentration tube and mix well into the next concentration point. Repeat 11 times until entire dilution series are prepared.\nPrepare labeled RNA stock.\nCalculate amount of RNA needed for each duplicate run. 700 μL at 2 nM (1 nM final concentration after mixing with protein) are prepared.\nCover tubes with aluminum foil to protect from light.\nLoad protein dilution series into wells of a 96 well plate (Corning 3650). Each titration series is in one row. For example, duplicate runs of one experiment will take row A and B.\nLoad 25 μL of RNA into each well.\nLoad buffer and RNA only controls in row C.\nOptional: Load multiple controls to estimate uncertainty associated with detection.\nRead with Cytation 5 Cell Imaging Multi-mode Reader.\nSet excitation to 485 nm and emission to 528 nm with a bandpass of 20 nm.\nSet read height to 8.5 mm.\nNote: Optical probe height has a considerable effect on the signal to noise ratio. Therefore, read height may need optimization for best performance.\nFit KD using Origin.",
    "Determine FP values using Gen5 Analysis software. More information on analysis using Gen5 Analysis can be found on the BioTek website.\nAverages and standard deviations for titration points are calculated in Excel.\nBinding curves are fit using Origin. See quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis] for details (Liu et al., 2017[href=https://www.wicell.org#bib8]; Su et al., 2018[href=https://www.wicell.org#bib17]). Alternative software such as GraphPad PRISM can also be for analysis.\nNote: Each experiment containing duplicates are repeated at least three times. Statistics about KD values are reported across these technical repeats.\nNegative-stain electron microscopy\nTiming: 1 day\nTiming: 30 min per grid (including loading and imaging) for step 22\nThis step describes preparation of nucleocapsid-RNA negative-stain sample for electron microscopy (EM) (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1122-Fig5.jpg\nFigure 5. Negative-stain electron microscopy\nFreshly thawed proteins samples are loaded onto glow-discharged grids. After blotting with filter paper, grids are washed in water before stained with 2% UA solution. Air dried grids are then imaged with electron microscope. Adapted from “EM”, by Biorender.com[href=http://Biorender.com] (2020). Retrieved from https://app.biorender.com/biorender-templates[href=https://app.biorender.com/biorender-templates].\nGlow discharge carbon-coated copper grids (Ted Pella, 01840-F).\nPlace grids onto a glass slide with carbon film side facing up.\nPut the glass slide on sample stage of Leica EM ACE600.\nGlow discharge for 45 s with following settings: Current (12 mA), Air (2.0E-1 mbar), Working Distance (50 mm), and Tilt (0°C).\nApply 2 μL of sample at 1 mg/mL diluted in PBS to each grid. Wait for 1 min.\nBlot the grid with filter paper for 3 s.\nOn a piece of parafilm, pipette three droplets of ddH2O and two droplets of 2% uranyl acetate (UA) solution. Each droplet has a volume of 20 μL.",
    "Critical: Though the external radiological and chemical hazards of UA are relatively low, it is acutely toxic if swallowed or inhaled and may cause damage to organs through prolonged or repeated exposure. Review Safety Data Sheet and use with precautions.\nPrepare fresh 2% UA from 4% UA stock solution and spin for 1 min at top speed using a tabletop centrifuge. Prepare 4% UA stock every 6 months.\nFace the grid onto the ddH2O droplet to wash for 30 s and blot the grid for 3 s.\nRepeat two more times with ddH2O.\nRepeat two more times with 2% UA.\nAirdry the grid before storing in a grid box.\nCritical: Make sure grids are completely dry before imaging.\nImage grids with electron microscope. Each negative-stained grid is loaded onto the side-entry holder of JEOL JEM-1400plus Transmission Electron Microscope operating at 120 kV and recorded with an AMT XR111 high-speed 4K × 2K pixel phosphor-scintillated 12-bit CCD camera at 3,000 to 40,000 magnification.\nEnzyme-linked immunosorbent assay (ELISA) for human plasma\nTiming: 2 days for step 23\nThis section outlines how to perform an ELISA with patient plasma samples to screen for serological responses (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1122-Fig6.jpg\nFigure 6. ELISA overview\nA 96-well plate is coated with N-protein fragments. The plate is subsequently blocked with protein and exposed to patient sera. A secondary antibody, an anti-human IgG conjugated to horseradish peroxidase (HRP) is then added to the plate for read-out. Created with Biorender.com[href=http://Biorender.com].\nRecombinant N proteins were coated on 96 well flat bottom immunosorbent plates at a concentration of 500 ng/mL in 100 μL coating buffer (PBS with 53% Na2CO3 and 42% NaHCO3) at 4°C for 12–18 h.\nAn additional plate was coated with a non-specific protein mixture to measure background binding of each sample.",
    "Non-specific protein mixture consisted of PBS with 5% fetal bovine serum (FBS).\nDiluted plasma samples (1:100) were bound for 2 h.\nSamples were diluted in dilution buffer (PBS with 0.05% Tween-20 and 0.1% FBS) for a total volume of 200 μL.\nThe 96 well plate was rinsed with 150 μL of wash buffer (PBS with 0.1% Tween-20).\nBoth 96 well plates were exposed to an anti-human IgG secondary antibody labeled with HRP (Invitrogen) diluted at 1:5000 in 20 mL dilution buffer (PBS with 0.05% tween-20 and 0.1% FBS).\nPlates were read-out with R&D substrate (Cat#DY999) as per manufacturer’s recommendation on a Wallac spectrophotometer[href=https://resources.rndsystems.com/pdfs/datasheets/duoanc.pdf?v=20210908&_ga=2.41750306.1448719793.1631140276-1192254123.1631140276]. Incubation was between 18°C–22°C for 20 min while protecting from light. The absorbance was detected at 450 nm.\nCritical: Patient plasma samples carry risk of pathogens, not limited to hepatitis B (HBV), hepatitis C (HCV), and human immunodeficiency virus (HIV). Therefore, proper PPE must be utilized when handling any samples (Twitchell, 2003[href=https://www.wicell.org#bib18]).\nIFN-β promoter reporter assay\nTiming: 3 days\nThis assays measures the ability of transfected proteins of interest to influence an interferon response induced by Sendai virus (SeV) (Figure 7[href=https://www.wicell.org#fig7]) (Messaoudi et al., 2015[href=https://www.wicell.org#bib11]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1122-Fig7.jpg\nFigure 7. IFN-β reporter assay\nHEK-293T cells are transfected with a plasmid containing an IFN-β promoter-firefly luciferase reporter, a control plasmid containing a Renilla luciferase reporter, and an expression plasmid for one of the studied N-protein variants. Subsequently, cells are infected with Sendai virus (SeV), which stimulates the Interferon signaling pathway. N-protein variants inhibit the Interferon response pathway. Following transfection and infection, cells are lysed, and luciferase activity evaluated. Created with Biorender.com[href=http://Biorender.com].\nSeeding HEK-293T cells.\nHEK-293T cells were prepared from a stock solution of cells.\nCells were split between 70%–90% confluency.\nHEK-293T cell media was aspirated from the flask.\nCells were exposed to EDTA-Trypsin for 5 min.",
    "DMEM + 10% was added to the cell flask.\nTrypsinized cells, split 5 × 104 into a 96 well plate.\n24 h later, HEK-293T cells (5 × 104) were co-transfected using Lipofectamine 2000 with:\n25 ng of an IFN-β promoter-firefly luciferase reporter plasmid\n25 ng of pRL-TK Renilla luciferase reporter plasmid\n125, 12.5, and 1.25 ng of the indicated viral protein expression plasmid\n24 h after transfection, cells were mock-treated or treated with SeV (15 hemaglutination units/mL).\n18 h post-treatment or post-infection, cells were lysed.\nCell lysates were analyzed for luciferase activity using a Dual-Luciferase reporter system.\nThe Promega Dual-luciferase system utilizes enzymatic substrates for both Renilla luciferase and Firefly Luciferase.\nPreparation of Buffers.\nResuspend the Luciferase Assay Substrate in Luciferase Assay Buffer II.\nDilute the stock solution of Stop & Glo® 50x to 1x with Stop & Glo® Buffer.\nRead-out of 96-well plate.\nAdd 20 μL of cell lysates prepared above.\nAssays were performed in triplicate.\nViral protein expression was confirmed by Western blot analysis.\nCritical: It is important that all reagents used in cell culture are kept sterile (Coté, 1998[href=https://www.wicell.org#bib3]). Prior to readout with the luciferase, verify that the LAR II and the Stop & Glo® Reagents have been warmed to 18°C–22°C. Luciferase activity is highly variable (Repele and Manu, 2019[href=https://www.wicell.org#bib15]), and it is recommended that an auto-injector is used for injection of reagents.\nDifferential HDX-MS structural characterization of RNA binding\nTiming: Mapping: 1 day; HDX-MS: 1 day per protein state",
    "Hydrogen-deuterium exchange mass spectrometry (HDX-MS) provides sensitive, high-resolution measurement of solvent accessible surface area and changes in protein dynamics (Masson et al., 2019[href=https://www.wicell.org#bib10]). We and others successfully used HDX-MS to characterize host-pathogen interactions (Pei et al., 2021[href=https://www.wicell.org#bib13]; Raghuvamsi et al., 2021[href=https://www.wicell.org#bib14]), monitor individual host and viral protein dynamics and interactions (Batra et al., 2021[href=https://www.wicell.org#bib1]; Su et al., 2018[href=https://www.wicell.org#bib17]; Courouble et al., 2021[href=https://www.wicell.org#bib4]), map antibody-antigen interactions (Huang et al., 2018[href=https://www.wicell.org#bib7]; Chen et al., 2019[href=https://www.wicell.org#bib2]), and determine binding sites of DNA/RNA with proteins (Long et al., 2017[href=https://www.wicell.org#bib9]). This protocol outlines a method to pinpoint viral protein RNA binding.\nPerform pre-HDX mapping.\nTo ∼ 100 pmol of the protein of interest (2 μL), dilute 10:1 with H2O buffer (+ 18 μL).\nDilute 2:3 with a selected quench buffer.\nNote: For more dilute protein samples, scale up the volumes if the ratios are retained.\nOptional: Flash freeze quenched solutions for ease in the HDX-MS analysis.\nInject into the LC-MS apparatus for digestion, desalting, and LC-MS/MS analysis\nDigest and desalt the protein with 200 mL/min solvent A using valve position 2 (Figure 2[href=https://www.wicell.org#fig2]) for 3 min (or 3 trap column volumes).\nAnalytically separate and elute the digested protein fragments by using valve position 1 (Figure 2[href=https://www.wicell.org#fig2]) and an organic gradient (solvent A – solvent B; for an example gradient, see below).\ntable:files/protocols_protocol_1122_18.csv\nNote: Include a high organic pulse (i.e., 100% solvent B) at the end of the LC gradient to decrease carryover from run to run.\nNote: The LC gradient may need to be adjusted for differences in protein hydrophobicity or to improve temporal separation of peptides/chromatogram congestion.\nProcess the LC-MS/MS results to optimize digestion efficiency using Byonic and Byologic (see quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis] below for details) to compare:\nProtein coverage\nPeptide length\nPeptide abundance\nCount of identified peptides\nRedundancy",
    "Note: Peptides with a 5–20 amino acid length are recommended for HDX-MS. Redundancy can be measured numerically as a function of the average number of overlapping peptides across all residues and tabulated in the suggested comparison. We also recommend visual inspection of redundancy in the context of protein coverage.\nRepeat with a range of quench conditions and protease columns/column orientations (Cravello et al., 2003[href=https://www.wicell.org#bib5]) (see Figure 8[href=https://www.wicell.org#fig8]A for an example of digestion optimization logic). Optimization of temperature, quench incubation time, addition of other chaotropic reagents can be done.\nRepeat the mapping experiment with the chosen conditions, but with added RNA to confirm the RNA is not affecting the digestion.\nPause point: As long as mapping conditions (i.e., MS settings and protease choice) are replicated during the HDX-MS experiment, HDX-MS can be completed at any time assuming sample integrity. Proteins can typically be stored for months at −80 °C.\nNote: If the protein contains disulfide bonds, a reducing agent should be added to the quench. Reduction of disulfide bonds may necessitate incubation at elevated temperature for 1–3 minutes. Incubation, especially at elevated temperatures, increases H/D back-exchange; care should be taken to minimize back exchange.\nNote: Denaturation using other chaotropic agents such as guanidine HCl may be used to better denature the protein. The efficacy of such denaturants on improving protein digestion is protein-dependent.\nCritical: Screening of mapping conditions defines the feasibility and resolution of the HDX-MS experiment. Carefully optimize the mapping results before proceeding with HDX-MS. For an example of mapping logic, see table below and Figure 8[href=https://www.wicell.org#fig8]A.\ntable:files/protocols_protocol_1122_19.csv\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1122-Fig8.jpg\nFigure 8. HDX expected outcome",
    "(A) (i) Representative MS2 spectrum of positively identified peptide from the mapping experiment, interpreted from b- and y- ion fragments that provide sequence information. Blue, N-terminal-facing notches in the peptide sequence indicate identification of b-ions; red, C-terminal-facing notches in the peptide sequence indicate identification of y-ions. A screenshot of data from Byologic software. Peptide map spanning SARS-CoV-2 N protein NTD-LKR-CTD showing coverage from digestion by pepsin (ii, black) and pepsin-FXIII columns (iii, orange). iv) Comparison of effect of protease selection on peptide length. In general, pepsin (black) generates longer peptides than pepsin-FXIII columns in series (red).\n(B) (i) LC extracted ion chromatograms, indicated by red triangle bookends, for a peptide submitted to incubation in D2O for 0 (nondeuterated control), 10, 30, 300, 3600 s (top to bottom), demonstrating consistent elution times with time. The mass spectra (ii) associated with these peaks demonstrate increased deuteration as a function of time. (iii) Graphing the centroid shift allows for the comparison of unbound (black) and the RNA-bound protein (red), indicating protection (left) or no change (right) for peptide generated by pepsin-FXIII digestion in the bound state. (iv) A Woods’ plot includes cumulative differences from all time points for the peptides to be viewed in one image, with statistics (p < 0.1, ∗; p < 0.05, ∗∗; p < 0.01, ∗∗∗), enabling an overall/global view/overview of changes in HDX across the entire protein sequence. Changes in deuteration upon RNA-binding mapped on a known structure of N protein NTD (PDB: 6M3M) (v). Meaningful decreases shown in blue. Raw data screenshots from PMI Byos and HDExaminer softwares. Woods’ plot and N protein NTD structure (iv and v) from Wu et al. (2021)[href=https://www.wicell.org#bib20].",
    "Equilibrate unbound and bound stock solutions. Protein/ligand concentrations and buffer conditions should be consistent across all HDX samples. A higher concentration stock should be generated for both bound and unbound states such that 2 μL of stock diluted with 18 μL D2O buffer yields the same final protein concentration.\nPrepare the unbound protein stock solution (∼25 μM).\nPrepare the bound protein stock solution (∼25 μM) with 1:1 RNA.\nOptional: The amount of RNA added may be increased to maximize the percentage of protein bound to RNA.\nNote: Prepare and acquire the non-deuterated control and all HDX time points in at least duplicate.\nPrepare the non-deuterated control (i.e., 0 s).\nTo 2 μL of the unbound protein stock, add 18 μL H2O buffer.\nStop HDX with addition of 30 μL quench solution.\nFlash freeze, and store solution at −80°C.\nPrepare HDX labeled protein (Figure 2[href=https://www.wicell.org#fig2]A).\nTo 2 μL of unbound protein stock on ice, add 18 μL D2O buffer (to maximize HDX at 90% D).\nIncubate at range of times logarithmic: 4 time point: 10, 30, 300, 3600 s.\nOptional: More time points may be added (e.g., 60, 900, 14400 s) to define better HDX kinetics.\nQuench HDX with addition of 30 μL quench solution for final volume of 50 μL (same as sample loop).\nFlash freeze in liquid nitrogen.\nRepeat all with the bound protein stock solution.\nCritical: All times should be controlled! Deviations in timing can lead to differential back-exchange extents and poor precision. Deviations in observed LC elution times result in more manual adjustment of extraction window during processing.\nCritical: HDX-MS is sensitive to fluctuations in temperature, pH, and ionic strength. All buffer conditions should be controlled, and all reagents should be pre-equilibrated at the temperature they will be used to ensure no unwanted deviations across the experiment.",
    "Alternatives: Inject immediately if protein aggregates upon flash freeze.\nPause point: Store flash frozen HDX samples at −80°C for up to 1 month.\nPerform LC-MS analysis of the HDX labeled protein states.\nThaw flash frozen HDX samples at 37°C for 30 s just prior to injection (consistency is essential).\nInject the protein and analyze as noted for mapping above for MS analysis (without MS/MS).\nNote: Deuteriums are prone to scrambling, especially with collision induced dissociation. Other dissociation techniques can be used for fragmentation without scrambling (Ferguson et al., 2007[href=https://www.wicell.org#bib6]).\nTo reduce carryover, wash sample loop with at least 3 volumes (i.e., 150 μL for a 50 μL loop) with water/0.1% formic acid, acetonitrile + 0.1% formic acid, and again water + 0.1% formic acid between injections.\nTo monitor carryover extents, run a blank between samples.\nH2O blank: 20 μL H2O buffer + 30 μL quench.\nD2O blank: 2 μL H2O buffer + 18 μL D2O buffer + 30 μL quench."
  ],
  "subjectAreas": [
    "Immunology",
    "Protein Expression And Purification",
    "Health Sciences",
    "Microscopy",
    "Mass Spectrometry",
    "Structural Biology",
    "Microbiology",
    "Molecular Biology",
    "Clinical Protocol",
    "Protein Biochemistry",
    "Biophysics"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}