{
  "id": 17409,
  "origin_website": "Jove",
  "title": "Myosin-Specific Adaptations of In vitro Fluorescence Microscopy-Based Motility Assays",
  "procedures": [
    "1. Protein purification\nCell lysis and protein extraction\n\t\nPrepare a 1.5x Extraction Buffer based on Table 1. Filter and store at 4 °C.\nBegin thawing the cell pellets on ice. While the pellets are thawing, supplement 100 mL of Extraction Buffer with 1.2 mM dithiothreitol (DTT), 5 µg/mL leupeptin, 0.5 µM phenylmethylsulfonyl fluoride (PMSF) and two protease inhibitor tablets. Keep on ice.\nOnce the pellet has thawed, add 1 mL of the supplemented Extraction Buffer per 10 mL of cell culture. For example, if the cell pellets were formed from 500 mL of cell culture, then add 50 mL of supplemented Extraction Buffer to the pellet.\nSonicate the cell pellets while keeping them on ice. For each pellet, use the following conditions: 5 s ON, 5 s OFF, duration of 5 min, power 4-5.\nCollect all the homogenized lysate into a beaker and add ATP (0.1 M stock solution; pH 7.0) such that the final concentration of ATP is 1 mM. Stir for 15 min in a cold room. The ATP dissociates active myosin from actin, allowing it to be separated in the following centrifugation step. It is, therefore, essential to proceed to the next step immediately to minimize the possibility for ATP depletion and rebinding to actin.\nCentrifuge the lysates at 48,000 x g for 1 h at 4 °C. While this is occurring, begin washing 1-5 mL of a 50% slurry of Anti-FLAG affinity resin (for a pellet formed from 1 L of cells) with 100 mL phosphate-buffered saline (PBS), according to the manufacturer's instructions. For example, for 5 mL of resin, wash 10 mL of a 50% slurry. In the final wash step, resuspend the resin with 1-5 mL of PBS with enough volume to create a 50% slurry.",
    "Following lysate centrifugation, combine the supernatant with the washed resin slurry and rock gently in the cold room for 1-4 h. While waiting, make the buffers described in Table 1 and keep them on ice.\nFLAG affinity purification preparation\n\t\nCentrifuge the solution in step 1.7 at 500 x g for 5 min at 4 °C. The resin will be packed at the bottom of the tube. Without disturbing the resin, remove the supernatant.\nResuspend the resin in 50 mL of Buffer A as detailed in Table 1 and centrifuge at 500 x g for 5 min at 4 °C. Without disturbing the resin, remove the supernatant.\nResuspend the resin in 50 mL of Buffer B as detailed in Table 1 and centrifuge at 500 x g for 5 min at 4 °C. Repeat this step once more and resuspend the resin in 20 mL of Buffer B. Then, mix the resin and the buffer thoroughly by gently inverting the tube by hand approximately 10 times.\nProtein elution and concentration\n\t\nMake 30 mL of Elution Buffer as described in Table 1 and let it chill on ice.\nSet up the elution column in a cold room. Gently pour the resin slurry into the column. Wash the column with 1-2 column volumes of Buffer B as the resin packs on the bottom, ensuring that the resin does not dry out.\nFlow 1 mL of the Elution Buffer through the resin and collect the flow-through in a 1.5 mL tube. Repeat such that 12, 1 mL fractions are collected.",
    "At this point, perform a crude Bradford test on the fractions to qualitatively determine which fractions are the most concentrated48. On one row of a 96-well plate, pipette 60 µL 1x Bradford reagent. As fractions are collected, mix 20 µL of each fraction per well. A darker blue coloration indicates the more concentrated fractions.\nIn a 50 mL tube, collect the remaining protein by gently pipetting the remaining Elution Buffer through the column, to release any remaining myosin bound to the resin in the column flowthrough. This flow-through will be concentrated in the next step. Ensure that the resin is then regenerated for reuse and stored according to the manufacturer's instructions.\nPool the three most concentrated fractions and further concentrate the flow-through in the 50 mL tube as well as the remaining 1 mL fractions using a 100,000 MWCO concentrating tube. Load the pooled sample onto the concentrating tube and centrifuge at 750 x g for 15 min at 4 °C and repeat until all eluted protein has been concentrated to a final volume of approximately 0.5-1 mL.\n\t\t​NOTE: This pore size allows for the retention of the myosin molecules, which have masses several times the molecular weight cutoff. The light chains remain tightly bound to the motor domains during this time course of concentration, as verified by performing SDS-PAGE gel electrophoresis on the final product.\nDialysis and flash-freezing\n\t\nMake 2 L of Dialysis Buffer, as described in Table 1. Load the sample in a dialysis bag or chamber and dialyze overnight in the cold room. Note that the composition of the dialysis buffers differs for NM2b and M5a.",
    "​NOTE: In the case of NM2b, the purpose of this dialysis step is to form myosin filaments in the low ionic strength buffer. Sedimentation of these filaments then provides an additional purification step and allows for the concentration of the sample. There will, therefore, be a visible white precipitate in the dialysis chamber the next day. These filaments will be collected by centrifugation and depolymerized in step 5.1. In the case of M5a-HMM, after the overnight dialysis, the protein will be sufficiently pure for the use in subsequent assays. Further purification steps such as gel filtration or ionic exchange chromatography can be performed, if required. For M5a recovery after dialysis, go to step 5.2.\nRecovering myosin after dialysis\n\t\nFor NM2b, carefully unload the entire sample from the dialysis bag or chamber and centrifuge at 4 °C for 15 min at 49,000 x g to collect the myosin filaments. Discard the supernatant and incrementally add the Storage Buffer to the pellet as described in Table 1 until it has dissolved. Gentle up and down pipetting helps to solubilize the pellet. Normally, this does not require more than 500 µL per tube. After ensuring that the pellet is fully dissolved in the high ionic strength storage buffer, an additional centrifugation step (15 min at 49,000 x g) can be performed to remove unwanted aggregates if required, since the myosin will now be unpolymerized and will remain in the supernatant.\nFor M5a-HMM, carefully collect the entire sample from the dialysis chamber and centrifuge at 4 °C for 15 min at 49,000 x g in case any unwanted aggregates are present. Take the supernatant.\nConcentration determination and flash-freezing",
    "To determine the concentration of the product, measure the absorbance using a spectrophotometer at wavelengths 260, 280, 290, and 320 nm. Calculate the concentration in mg/mL (cmg/mL) with Equation 1, where A280 represents the absorption at 280 nm and A320 represents the absorption at 320 nm. The resulting concentration in mg/mL can be converted into µM of myosin molecules with Equation 2, where M is the molecular weight of the entire protein (including the heavy chains, light chains, fluorophores, and all tags).\ncmg/mL = (A280 - A320) / ε   (1)\nμM molecules = 1000cmg/mL/M   (2)\n\t\tNOTE: If a dilution is necessary, then it must be done in a high ionic strength buffer. The extinction coefficient (ε) can be determined by importing the amino acid sequence of the protein into a program such as ExPASy. Typical yield for the M5a-HMM is approximately 0.5-1 mL of 1-5 mg/mL protein and for the full-length NM2b is 0.5-1 mL of 0.5-2 mg/mL. The extinction coefficient for the M5a-HMM used in this paper was 0.671. The extinction coefficient for the NM2b used in this paper was 0.611.\nStore the purified myosin in one of the two ways. Aliquot between 10-20 µL into a thin-walled tube, such as a polymerization chain reaction tube, and drop the tube into a container of liquid nitrogen for flash-freezing. Alternatively, directly pipette between 20-25 µL of myosin into liquid nitrogen and store the frozen beads of protein in sterile cryogenic tubes. In either case, the resulting tubes can be stored in -80 °C or liquid nitrogen for future use.\n\t\t​NOTE: Since both motility assays described below require very small amounts of protein, storage in small aliquots, as described, is economical.\n2. Gliding actin filament assay\nCoverslip preparation\n\t\nMake a 1% nitrocellulose solution in amyl acetate.",
    "Obtain a tissue culture dish (150 x 25 mm) and add a circular filter paper (125 mm diameter) to the bottom of the dish.\nLoad eight No. 1.5 thickness 22 mm square coverslips onto a rack and wash with approximately 2-5 mL of 200-proof ethanol followed by 2-5 mL of distilled water (dH2O). Repeat this washing step, ending with water. Then, dry the coverslips completely using a filtered air-line or N2-line.\nTake one coverslip and slowly pipette 10 µL of the 1% nitrocellulose solution along one edge of the slip. Then, in one smooth motion, smear it across the rest of the coverslip using the side of a smooth-sided 200 µL pipette tip. Place this coverslip on the tissue culture dish with the nitrocellulose side up. Repeat for the remaining coverslips and allow them to dry while preparing the remaining reagents and use coverslips within 24 h after coating.\nChamber preparation\n\t\nWipe a microscope slide with an optical lens paper to clean off large debris. Cut two pieces of double-sided tape, approximately 2 cm in length.\nPlace one piece along the middle of the long edge of the microscope slide. Ensure that the edge of the tape aligns with the edge of the slide. Place the second piece of tape roughly 2 mm below the first piece of tape such that the two are parallel and aligned. This creates a flow chamber that can hold approximately 10 µL of solution (see Figure 1).",
    "Take one of the nitrocellulose-coated coverslips from Part 1. Carefully stick the coverslip onto the tape such that the side coated with nitrocellulose is making direct contact with the tape, (see Figure 1). Using a pipette tip, gently press down on the slide-tape interface to ensure that the coverslip has properly adhered to the slide. Cut the excess tape hanging over the edge of the slide with a razor blade.\nActin preparation\n\t\nMake 20 µM F-actin by polymerizing globular actin (G-actin) in polymerization buffer (50 mM KCl, 2 mM MgCl2, 1 mM DTT, 25 mM MOPS (pH 7.0)) at 4 °C overnight.\nDilute F-actin to 5 µM in motility buffer (20 mM MOPS, 5 mM MgCl2, 0.1 mM EGTA, 1 mM DTT (pH 7.4)). Label with at least 1.2x molar excess of rhodamine-phalloidin. Leave (covered in aluminum foil) for at least 2 h on ice. This can be used for up to 1-2 months, stored on ice.\nPerforming the myosin 5a gliding actin filament assay\n\t​NOTE: In this section, the details of the myosin 5a (HMM) gliding assay are provided.\n\t\nPrepare the solutions for myosin 5a described in Table 2 and keep them on ice.\nFlow in 10 µL of the myosin 5a (50-100 nM) through the flow chamber and wait for 1 min.\nFlow in 10 µL of the 1 mg/mL BSA in 50 mM MB with 1 mM DTT (\"low salt\" buffer). Repeat this wash two more times and wait for 1 min after the third wash. Use the corner of a tissue paper or filter paper to wick the solution through the channel by gently placing the corner of the paper at the flow chamber exit.\nWash with 10 µL of 50 mM MB with 1 mM DTT. Repeat this wash two more times.",
    "Flow in 10 µL of the black actin solution (5 µM F-actin, 1 µM calmodulin, and 1 mM ATP in 50 mM MB with 1 mM DTT) to eliminate \"dead heads\", as discussed in the Discussion section.\n\t\t\nPipette the solution with a 1 mL syringe and 27 G needle to shear the actin filaments before introducing the solution to the chamber. Repeat this step two more times and wait for 1 min after the third time. Approximately 20 pipetting events are sufficient.\nTo perform the \"dead head\" spin, add a stoichiometric amount of F-actin to myosin in the presence of 1 mM ATP and 1 mM MgCl2 at a salt concentration of 500 mM. Then ultracentrifuge at 480,000 x g for 15 min at 4 °C. The dead myosin will be in the pellet.\nFlow in 50 µL of 50 mM MB with 1 mM DTT and 1 mM ATP to deplete the chamber of free actin filaments.\nWash with 10 µL of 50 mM MB with 1 mM DTT. Repeat this wash two more times to deplete the chamber of any ATP.\nFlow in 10 µL of 20 nM rhodamine actin (Rh-Actin) solution containing 1 mM DTT in 50 mM MB and wait for 1 min to allow rigor binding of actin filaments to the myosin 5a attached to the surface of the coverslip.\nWash with 10 µL of 50 mM MB with 1 mM DTT to wash away Rh-Actin filaments not bound to the surface. Repeat this wash two more times.\nFlow in 30 µL of Final Buffer.\nRecord images on a fluorescence microscope using an excitation wavelength of 561 nm to visualize Rh-Actin. An appropriate exposure time is 200 ms at 1.4 mW laser power for a total acquisition duration of 0.5-1 min.",
    "NOTE: Ensure that the acquisition rate is scaled appropriately to the speed of the moving filaments. An important consideration before collecting data for use with tracking programs is the acquisition frame rate. Subpixel movements between frames will result in an overestimate of the velocity, and movements of several hundred nanometers are required to obtain accurate values. An optimal acquisition rate features actin gliding for at least one pixel distance between frames. In the case of the TIRF microscope used for the imaging here, this threshold translates to 130 nm; therefore, a myosin expected to travel 1 µm/s must be imaged at a rate of 5 frames/s (0.2 s interval) to achieve 200 nm of movement while a myosin expected to travel 10 nm/s requires 0.05 frames/s (20 s intervals). Data can therefore be downsampled at this stage if necessary (see Discussion for more details).\nPerforming the nonmuscle myosin 2b gliding actin filament assay\n\t​NOTE: In this section, the details of the full-length nonmuscle myosin 2b gliding assay are provided. The nonmuscle myosin 2b gliding actin filament assay protocol is different from the myosin 5a protocol at certain steps. Ensure that the correct buffers are used for each of these steps. For example, the NM2b assay requires attachment of myosin to the coverslip in high salt buffer while the M5a can be attached to the coverslip in high or low salt buffers. Additionally, the M5a gliding actin filament assay uses a lower concentration of myosin to mitigate the frequency of actin filaments breaking apart during acquisition.\n\t\nPrepare the solutions for NM2b as described in Table 2 and keep them on ice.",
    "Flow in 10 µL of the nonmuscle myosin 2b (0.2 µM) in 500 mM Motility Buffer (MB) (\"high salt\" buffer) and 1 mM dithiothreitol (DTT) through the flow chamber and wait for 1 min.\n\t\tNOTE: The high salt buffers dissociate myosin filaments and allow for the attachment of single myosin molecules to the surface, as nonmuscle myosin 2b can polymerize into filaments at ionic concentration <150 mM.\nFlow in 10 µL of the 1 mg/mL bovine serum albumin (BSA) in 500 mM MB with 1 mM DTT (\"high salt\" buffer) as described in Table 2. Repeat this wash two more times and wait for 1 min after the third wash. Use the corner of a tissue paper or filter paper to wick the solution through the channel.\nWash with 10 µL of 500 mM MB with 1 mM DTT as described in Table 2. Repeat this wash two more times.\nFlow in 10 µL of the black actin solution as described in Table 2 to eliminate \"dead heads,\" as discussed further in the Discussion section. The black actin solution contains 5 µM of unlabeled F-actin, 1-10 nM MLCK, 1 mM ATP, 0.2 mM CaCl2, 1 µM CaM, and 1 mM DTT in 50 mM NaCl motility buffer to phosphorylate the nonmuscle myosin 2b on the surface of the chamber.\n\t\t\nPipette the solution with a 1 mL syringe and 27 G needle to shear the actin filaments before introducing the solution to the chamber. Repeat this step two more times and wait for 1 min after the third time. Approximately, 20 pipetting events are sufficient.\nFlow in 50 µL of 50 mM MB with 1 mM DTT and 1 mM ATP to deplete the chamber of free actin filaments.",
    "Wash with 10 µL of 50 mM MB with 1 mM DTT. Repeat this wash two more times to deplete the chamber of any ATP.\nFlow in 10 µL of 20 nM Rh-Actin solution containing 1 mM DTT in 50 mM MB and wait for 1 min to allow rigor binding of actin filaments to the nonmuscle myosin 2b attached to the surface of the coverslip.\nWash with 10 µL of 50 mM MB with 1 mM DTT to wash away Rh-Actin filaments not bound to the surface. Repeat this wash two more times.\nFlow in 30 µL of Final Buffer. For nonmuscle myosin 2b gliding actin filament assay, the Final Buffer also includes calmodulin, CaCl2, and myosin light chain kinase to provide full phosphorylation of the nonmuscle myosin 2b during video imaging. 0.7% methylcellulose can also be included in the Final Buffer if actin filaments are only loosely bound or are not bound to the surface. This is discussed further in the Discussion section.\nRecord images on a fluorescence microscope using an excitation wavelength of 561 nm. An appropriate exposure time is 200 ms at 1.4 mW laser power for a total acquisition duration of 0.5 -3 min.",
    "NOTE: Ensure that the acquisition rate is scaled appropriately to the speed of the moving filaments. An important consideration before collecting data for use with tracking programs is the acquisition frame rate. Subpixel movements between frames will result in an overestimate of the velocity, and movements of several hundred nanometers are required to obtain accurate values. An optimal acquisition rate features actin gliding for at least one pixel distance between frames. In the case of the TIRF microscope used for the imaging here, this threshold translates to 130 nm; therefore, a myosin expected to travel 1 µm/s must be imaged at a rate of 5 frames/s (0.2 s interval) to achieve 200 nm of movement while a myosin expected to travel 10 nm/s requires 0.05 frames/s (20 s intervals). Data can therefore be down-sampled at this stage, if necessary (see Discussion for more details).\n3. Single molecule TIRF assay\nCoverslip preparation\n\t\nDivide the stock powder into 10 mg aliquots (in 1.5 mL tubes) of methoxy-Peg-silane (mPEG) and 10 mg aliquots of biotin-Peg-silane (bPEG). Store at -20 °C in a sealed, moisture-free container and use within 6 months.\nLoad eight No. 1.5H (high precision) thickness 22-mm square coverslips onto a rack and wash with 2-5 mL of 200-proof ethanol followed by 2-5 mL of distilled water. Repeat this washing step, ending with water. Then, dry the coverslips completely using an air-line or N2 and plasma-clean with argon for 3 min.\nPlace the clean coverslips on filter paper (90 mm) in a tissue culture dish (100 x 20 mm) and incubate in a 70 °C oven while performing the following steps.\n\t\t​NOTE: The plasma cleaning can be replaced with other chemical cleaning methods49.",
    "Prepare 80% ethanol solution with dH2O and adjust the pH to 2.0 using HCl. Add 1 mL of this to a 10 mg aliquot of mPEG and 1 mL to a 10 mg aliquot of bPEG. Vortex to dissolve, which should not take more than 30 s.\nTake 100 µL of the bPEG solution and add 900 µL of 80% ethanol (pH 2.0). This solution is 1 mg/mL bPEG. Then, make a solution of both the PEGs as follows, mixing thoroughly.\n\t\t\n200 µL of 10 mg/mL mPEG (final concentration: 2 mg/mL).\n10 µL of the 1 mg/mL bPEG (final concentration: 10 µg/mL).\n790 µL of the 80% ethanol (pH 2.0) solution.\nTake the coverslips out of the oven. Carefully dispense 100 µL of the PEG solution onto the center of each coverslip, ensuring that only the top surface is wet. Then, place the slips back in the oven and incubate for 20 to 30 min.\nWhen the coverslips begin to take on a holey appearance, with small circles apparent across the surface, remove them from the oven.\nWash each coverslip with 100% ethanol, dry with an air-line, and place back in the oven. Incubate only for the time required to create chambers in step 2.\nChamber preparation\n\t\nClean a microscope slide for use in making the chamber. Cut two pieces of double-sided tape, approximately 2 cm in length.\nPlace one piece along the middle of the long edge of the microscope slide. Ensure that the edge of the tape aligns with the edge of the slide. Place the second piece of tape roughly 2 mm below the first piece of tape such that the two are parallel and aligned.",
    "Take one of the functionalized coverslips from the oven (created in 3.1). Carefully stick the coverslip onto the tape such that the side coated with PEG is face down and making direct contact with the tape, as shown in Figure 1. Using a pipette tip, gently press down on the slide-tape interface to ensure that the coverslip has properly adhered to the slide.\nCut the excess tape hanging over the slide with a razor blade. These chambers can be used immediately or placed pairwise into a 50 mL tube and stored in a -80 °C freezer for future use. It is important to store immediately or the surface will degrade.\nPerforming the myosin 5a TIRF microscopy assay\n\t\nPrepare the solutions for myosin 5a inverted motility assay described in Table 3 and keep them on ice.\nWash the chamber with 10 µL of 50 mM MB with 1 mM DTT.\nFlow in 10 µL of the 1 mg/mL BSA in 50 mM MB with 1 mM DTT. Repeat this wash two more times and wait for 1 min after the third wash. Use the corner of a tissue paper or filter paper to wick the solution through the channel.\nWash with 10 µL of 50 mM MB with 1 mM DTT. Repeat this wash two more times.\nFlow in 10 µL of the NeutrAvidin solution in 50 mM MB with 1 mM DTT and wait for 1 min.\nWash with 10 µL of 50 mM MB with 1 mM DTT. Repeat this wash two more times.",
    "Flow in 10 µL of biotinylated rhodamine actin (bRh-Actin) containing 1 mM DTT in 50 mM MB and wait for 1 min. For this step, use a large-bored pipette tip and avoid pipetting up and down to minimize shearing of the fluorescent actin filaments to ensure that long actin filaments can be attached to the surface (20-30 µm or longer). An effective alternative is cutting the cone of a standard pipette tip (with an opening of ≈1-1.5 mm).\nWash with 10 µL of 50 mM MB with 1 mM DTT. Repeat this wash two more times.\nFlow in 30 µL of Final Buffer with 10 nM myosin 5a added, then immediately load onto the TIRF microscope and record after finding the optimum focus for TIRF imaging modality. Exposure times between 100-200 ms are appropriate at 1.4 mW laser power for the actin and GFP-labeled myosin. An appropriate acquisition time for velocity analysis is 3 min.\nPerforming the nonmuscle myosin 2b TIRF microscopy assay\n\t​NOTE: In this section, the details of the nonmuscle myosin 2b TIRF assay using polymerized and phosphorylated filaments are provided. Detailed protocol (sections 4.1-4.3) for phosphorylating and polymerizing the nonmuscle myosin-2b in a tube is included.\n\t\nTo phosphorylate the purified NM2b, make a 10x kinase mix with the following conditions: 2 mM CaCl2, 1 µM CaM, 1-10 nM MLCK, and 0.1 mM ATP. This can be brought to volume with 500 mM MB with 10 mM DTT. Add the 10x kinase mix to the myosin at a volumetric ratio of 1:10 and allow this to incubate for 20-30 min at room temperature. Typically, the myosin concentration for this step is 1 µM.",
    "To polymerize the phosphorylated myosin into filaments, lower the salt concentration of the NM2b to 150 mM NaCl. To do so, make a 1x motility buffer (1x MB) with no salt by diluting the 4x MB four times in dH2O. This 1x MB can be used to lower the salt concentration because the NM2b was frozen in a 500 mM salt buffer.\nFor every 3 µL of stock NM2b, add 7 µL of 1x MB to lower the salt concentration to 150 mM NaCl and incubate on ice for 20-30 min to form NM2b filaments.\n\t\t​NOTE: The order in sections 4.1-4.3 is not crucial as long as the NM2b is phosphorylated and the final salt concentration is 150 mM. Incubation on the order of 30 min-1 h allows enough time for complete phosphorylation and polymerization.\nPrepare the solutions for nonmuscle myosin 2b inverted motility assay described in Table 3 and keep them on ice.\nWash the chamber with 10 µL of 150 mM MB with 1 mM DTT.\nFlow in 10 µL of the 1 mg/mL BSA in 150 mM MB with 1 mM DTT Repeat this wash two more times and wait for 1 min after the third wash. Use the corner of a tissue paper or filter paper to wick the solution through the channel.\nWash with 10 µL of 150 mM MB with 1 mM DTT. Repeat this wash two more times.\nFlow in 10 µL of the NeutrAvidin solution in 150 mM MB with 1 mM DTT and wait for 1 min.\nWash with 10 µL of 150 mM MB with 1 mM DTT. Repeat this wash two more times.",
    "Flow in 10 µL of bRh-Actin and wait for 1 min. For this step, use a large-bored pipette tip and avoid pipetting up and down to minimize shearing of the fluorescent actin filaments, to ensure that long actin filaments can be attached to the surface (20-30 µm or longer). An effective alternative is cutting the cone of a standard pipette tip.\nWash with 10 µL of 150 mM MB with 1 mM DTT. Repeat this wash two more times.\nFlow in 10 µL of the nonmuscle myosin 2b solution (approximately 30 nM) and wait for 1 min.\nWash with 10 µL of 150 MB with 1 mM DTT. Repeat this wash two more times.\nFlow in 30 µL of Final Buffer, then immediately load onto the TIRF microscope and record after finding the optimum focus for TIRF imaging modality. Exposure times between 100-200 ms are appropriate at 1.4 mW laser power for the actin and GFP-labeled myosin. An appropriate acquisition time for velocity analysis is 3 min.\n4. Image analysis\nImage analysis for gliding actin filament assay\n\tNOTE: The images can be analyzed using the software and manuals linked in the List of Materials. It is important to note that the program described here requires TIFF-stacks for analysis. The process for analyzing the gliding actin filament assay is as follows50.\n\t\nUpload raw movie stacks into a specified folder structure and input the top-most directory of the movie folders into the program.",
    "​NOTE: The program analyzes the files throughout this directory and subdirectories, treating the lowest-level directories as replicates. Average statistics for each group of replicates will be produced. In this case, a single movie was used for each myosin. When characterizing a novel myosin or investigating a new experimental condition, it is recommended to analyze movies from three field-of-views (FOV) per chamber for a total of three chambers and to repeat this workflow for three preparations of the myosin being investigated.\nUse the script \"stack2tifs\" in conjunction with the user-inputted frame rate to convert each TIFF stack into a folder containing a series of individual TIFF files and a corresponding metadata.txt file containing the start time of each frame. For data not in the TIFF stack format, a conversion must first be applied using software such as those listed in the Table of Materials.\n\t\tNOTE: This script is the part of the software package. The information of the script can be found here:  \"https://github.com/turalaksel/FASTrack/blob/master/bin/stack2tifs\"\nUse the -px parameter, which is the pixel size (in nm) during acquisition. In this case, the pixel size is 130 nm. Use the -xmax and -ymax parameters for scaling the axes for the scatter plot outputs. These correspond to the longest plotted filament length and the maximum plotted velocity (in nm/s).\n\t\t​NOTE: These are estimated values and can be set to higher-than-expected values to ensure data are contained in the plot. Following analysis, the raw data can also be exported for use in other statistical or graphing software for viewing and analysis.",
    "Use the -minv parameter, which is a minimum velocity cutoff parameter, to define the filaments that are not moving, and can, therefore, be excluded from the analysis. For a slow myosin such as NM2b, this parameter must be low (in this example, 5 nm/s) to avoid cutting out true gliding movements. For a fast myosin such as M5a, this parameter can be higher (in this example, 100 nm/s) to apply a more stringent filter, while retaining the true gliding speed distribution.\nUsethe -pt cutoff parameter to identify smooth movement. For each sampling window, a value is calculated equivalent to 100 x Velocity Standard Deviation/Mean velocity. Tracks with higher values than the cutoff, have more variable velocities and are excluded from further analysis. In this example, a cutoff value of 33 was used. Tracks with higher values have more variable velocities and are excluded from further analysis.\nUse -maxd to set a maximum allowed linkage distance between frames. This is a calculated frame-to-frame distance moved by the centroid of the filament in units of nm. It can be useful for excluding sporadic movements or incorrect linkage between filaments. In the examples here, the parameter was left on the default value of 2,000 nm.\nImage analysis for TIRF microscopy assay\n\tNOTE: The process for analyzing the single molecule TIRF assay on the imaging software specifically listed in the Table of Materials is as follows29.\n\t\nClick and drag the recorded microscopy video to the software's workspace to open it51. Then, split the acquisition channels. Click on Image > Color > Split Channels.",
    "NOTE: In the event of appreciable stage drift during the acquisition, images must be stabilized to correct instrumental drift on the imaging plane. In this case, no compensation for Z-axis drift was used as the microscope used to obtain this data stabilizes the Z-focus well. To stabilize the image on the image analysis program, install the appropriate stabilizer plug-in that is linked on the List of Materials. The image stabilizer assumes fixed positions for the objects in the image and uses a rolling average of the previous frames as a reference. The recommended procedure is therefore to begin with the channel containing images of labeled actin, since this is in a fixed position.\nClick on Plugins, then find Image Stabilizer; ensure that Translation is selected and keep the default settings. Check the box next to Log Transformation Coefficients. Applying this Log step allows for the calculated shift parameters to be applied to the other channel in the next step. Allow for the process to complete.\nThen, open the channel with labeled myosin and apply the stabilization by clicking on Plugins > Image Stabilizer Log Applier. If images of actin cannot be acquired during the same acquisition due to a requirement for higher rate imaging in a single channel, drift stabilize the stack of images by selecting a region that contains static objects such as a biotinylated fiducial marker or fluorophores bound non-specifically to the biotin-PEG surface. This region can be cropped from the original stack and stabilized, followed by application of the resulting shift values to the original stack.\n\t\t​NOTE: In practice, the drift observed in motility experiments will be negligible relative to the motion of myosins which move at several hundred nm/s, but for the slowest myosins this becomes an important consideration.",
    "Then, open TrackMate, click on Plugins; then, in its dropdown menu click on Tracking and finally on TrackMate. At this point, the image analysis is subject to optimization based on the parameters of the fluorophore and assay conditions. However, ideal starting parameters are as follows.\n\t\t\nCalibration settings: keep all of the default values.\nDetector: LoG detector.\nEstimated blob diameter: 0.5-1.0 micron.\nThreshold: 25-200. (This can be determined by clicking on Preview after choosing a number to see whether the detected spots match up to the movie and adjusting appropriately.)\nInitial thresholding: not set.\nView: HyperStack Displayer.\nSet filters on spots: not set.\nTracker: Simple LAP tracker.\n\t\t\t​NOTE: These depend on frame rate and myosin velocity and must be large enough to connect subsequent positions while excluding unwanted connections between different particles.\nLinking max distance: 1.0 micron.\nGap-closing max distance: 1.0 micron.\nGap-closing max frame gap: 1.\nSet filters on tracks: Track Displacement (>0.39-to include only spots moving more than 3 pixels), Spots in tracks (>3-to include only tracks with at least 3 spots). Other filters such as Minimal Velocity may be introduced to exclude spots that stall for long periods. The results of filtering must be checked by visual inspection of tracks to ensure that spurious tracks (i.e., myosin movement in the background that is not along an actin track) are removed while retaining the tracks associated with actin.\nOnce the Display Options screen comes up, click on Analysis for the relevant outputs. Save the three tables produced (Track Statistics, Links in Track Statistics, and Spots in Track Statistics). The Track Statistics table will contain the velocity and displacement data that can then be subsequently analyzed to characterize a novel protein or the effects of a certain experimental condition, for example.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}