{
  "id": 19924,
  "origin_website": "Wiley",
  "title": "Preclinical Models of Neuroendocrine Prostate Cancer",
  "procedures": [
    "This protocol describes and provides a detailed procedure for the generation of organoids (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.742#cpz1742-fig-0002]). Tissue from a human PDX or prostate tissue from a GEMM serve as source material to obtain individual cells. Next, single cells are mixed with Matrigel matrix and seeded as a drop in desired plates to generate 3D organoids.\nAbout 7 to 10 days post seeding, 3D organoids are well formed and reach a dimension of 150 to 300 µm in diameter.\nEnd points to be evaluated:\n         \nNumber of organoids\nPhenotype of organoids\nThe number of organoids formed reflects the proliferative index of the tissue of origin and is an important parameter to be evaluated. Depending on the tissue of origin, 3D organoids can show different morphologies and sizes. Recent advances in the assessment of tumor-derived organoids indicate that prostate epithelial normal cells give rise to 3D cystic-like organoids with a regular shape and lumen (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.742#cpz1742-fig-0001]). By contrast, transformed cells form full hyperplastic or irregular structures (Karthaus et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.742#cpz1742-bib-0026]). 3D organoid cultures are a suitable model to test drugs that can affect their number, morphology, and shape.\nNOTE: All protocols using live animals must first be reviewed and approved by an Institutional Animal Care and Use Committee (IACUC) and must follow officially approved procedures for the care and use of laboratory animals.\nMaterials\nGibco Dulbecco's modified Eagle medium (DMEM; Thermo Fisher Scientific, cat. no. 12100-061)\nGibco RPMI-1640 medium (Thermo Fisher Scientific, cat. no. 31800-089)\nFBS (Capricorn Scientific, cat. no. FBS-11A)\nMouse organoid medium (Drost et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.742#cpz1742-bib-0017])\nPBS, 1× (Chemie Brunschwig, cat. no. CS1PBS01-01)\nMatrigel Growth Factor Reduced (GFR), Phenol red-free (BD Biosciences, cat. no. 356231)\nL-Glutamine (Thermo Fisher Scientific, cat. no. 25030032)\nCollagenase type II (Thermo Fisher Scientific, cat. no. 17101-015)\nY-27632 dihydrochloride (MilliporeSigma, cat. no. SCM075)",
    "TrypLE™ Express Enzyme (1×), phenol red, 100 ml (Thermo Fisher Scientific, cat. no. 12605-010)\nTrypan blue, 0.4% (MilliporeSigma, cat. no. T8154)\nPenicillin-Streptomycin (10,000 U/ml; Thermo Fisher Scientific, cat. no. 15-140-122)\nDimethyl sulfoxide (DMSO; MilliporeSigma, cat. no. D2650)\nDissecting medium: DMEM supplemented with 10% (v/v) FBS, 1% (v/v) 100× glutamine, and 1% (v/v) 100× penicillin/streptomycin solution\n12- to 36-week-old male Ptenflox/flox; R26ERG mice, housed in individually ventilated microisolator cages\nDissecting tools (sterilized): \n               \nDissecting scissors\nMicro scissors\nDissecting forceps\nScalpel\nDissecting microscope (Olympus/Leica)\nCell strainer 40-μm pore size (Falcon; Corning, cat. no. 352340)\nCell culture centrifuge (Beckman Coulter)\nShaking platform\nTissue culture hood\nCell incubator set to 5% CO2 and 37°C\nCell culture disposables: \n               \nPetri dishes (BD Flacon)\nCentrifuge tubes (Eppendorf)\nPipets\nPipet tips\nFilter units (Millipore Sigma)\n96-well non-tissue culture plate (BD Falcon; Corning, cat. no. 351172)\nInverted microscope\n1. Sacrifice male mice according to specific animal licenses.\nMouse age can vary from 14 weeks to an older age depending on previous experimental design.\n2. Place mice with the abdomen in upside position. Spray abdomen with 70% ethanol.\nKeep the cabinet dissecting area clean and tidy.\n3. Cut the skin with the dissecting scissors vertically along the abdomen from proximal to distal to open the peritoneum.\nUsually, a layer of fat is present above the urogenital apparatus. Move with forceps the fat covering the urogenital apparatus from both sides and locate the bladder.\n4. Using forceps, carefully secure the bladder and pull it gently in order to remove the entire urogenital apparatus consisting of clearly visible seminal vesicles and prostate.\n5. Place seminal vesicles, prostate, and bladder in a 10-cm Petri dish containing 3 ml of ice-cold dissecting medium (Lukacs et al., 2010[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.742#cpz1742-bib-0036]).",
    "At this step, it is recommended that the Petri dish containing seminal vesicles, prostate, and bladder be placed under a dissecting microscope.\n6. Remove blood vessels and connective tissue, and make an incision (0.5 cm) at the base of the urethra.\n7. Remove bladder, seminal vesicles, vas deferens, and fat tissue covering the prostate lobes by gentle cuttings.\n8. Remove urethra and ampullary gland, and carefully move the whole prostate into a new clean 10-cm Petri dish.\n9. Mince the prostate lobes into small pieces (∼1 mm3) in the 10-cm Petri dish by using a clean scalpel, keeping tissue in 3 ml of ice-cold dissecting medium.\nIf required, it is possible to separate the lobes individually.\n10. Centrifuge tissue chunks at 300 × g for 5 min at 25°C.\n11. Transfer minced prostate into a 15-ml tube containing 4-5 ml of 5 mg/ml collagenase type II with Y-27632 (10 µM), mix well with a P1000 pipet, and incubate at 37°C for 1.5-2 hr on a rotator.\nIt is recommended that collagenase type II be prepared fresh.\n12. Centrifuge at 300 × g for 5 min at 4°C.\n13. Decant supernatant and resuspend pellet in 500 µl TrypLE with Y-27632 (10 µM) and incubate 15 min at 37°C on a shaking platform. Pipet up and down with a P1000 pipet to ensure efficient digestion.\n14. Put a 40-µm cell strainer on the top of a 15-ml Falcon tube and load digestion through the strainer.\nThis step can be performed in a 50-ml Falcon tube with a 40-µm cell strainer on the top.\n15. Add 2 ml ice-cold sterile 1× PBS and centrifuge at 300 × g for 5 min at 4°C.",
    "16. Decant supernatant and resuspend pellet in 2 ml ice-cold sterile 1× PBS and centrifuge at 300 × g for 5 min at 4°C.\n17. Decant supernatant and resuspend pellet in 1 ml ice-cold sterile 1× PBS.\n18. Take an aliquot of 10 or 20 µl of cell suspension and add it to an equal volume of 0.4% trypan blue for counting of viable cells by using an automatic counter.\nIf necessary, keep the cells in regular ice for a few minutes. A range of 5 × 106 to 7 × 106 viable cells are obtained for each prostate gland. In order to establish a good organoid culture, 5,000-10,000 cells are used as described in the following step.\n19. Combine 5,000 single cells with ice-cold sterile Matrigel (previously thawed at 4°C overnight) in a 1.5-ml Eppendorf tube in ice bucket.\nKeep Matrigel on ice to avoid solidifying. At this point, it is possible to prepare a master mix of cells and Matrigel for multiple replicates.\n20. Mix well combined cells and Matrigel with a 20-µl pipet and pipet 10 µl into the middle of one well of a pre-warmed (37°C) non-tissue treated 96-well plate to form a dome (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.742#cpz1742-fig-0003]).\nA dome is composed of 20% cells and 80% ice-cold Matrigel. The single dome has a final volume of 10 µl.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/6da0d85d-0c3c-4ddd-9c81-7681fc53e4d3/cpz1742-fig-0003-m.jpg</p>\nFigure 3\nMatrigel domes. Images of Matrigel domes at different stages of organoid formation.\n21. Invert the 96-well plate to prevent adherence of cells to the plate bottom and carefully place it upside down into the 37°C incubator for at least 30-45 min to allow the Matrigel to solidify.\n22. Transfer the 96-well plate carefully to the biological hood and gently add to each dome 100 µl of pre-warmed (37°C) Mouse organoid medium (Drost et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.742#cpz1742-bib-0017]).",
    "It is recommended that mouse organoid medium is added with a P200 pipet to avoid directly touching the formed dome.\n23. Optional: Drug as a single agent or combination can be diluted directly into mouse organoid medium for treatment during 3D organoid formation assay.\n24. Evaluate organoid formation with an inverted microscope after 7-12 days post seeding (see Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.742#cpz1742-fig-0002]). Culture organoids in tissue culture incubator at 37°C and 5% CO2.\nSingle or multiple wells for different experimental conditions can be evaluated every 24 hr to monitor 3D organoid formation.\n25. Take images of 3D organoids with inverted microscope and count organoids, evaluating only the organoids with a diameter >50 or >100 µm (Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.742#cpz1742-fig-0004]).\nChoose diameter cut off accordingly with the experimental conditions.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/3cf47e31-021c-41e6-97a8-de30b0e71c8c/cpz1742-fig-0004-m.jpg</p>\nFigure 4\n3D organoid formation. Images of 3D organoids taken at different time points (4 days and 7 days).\nOptional: Reversion of aggressive phenotype\nFollow steps 1-19 for the first part of 3D organoid establishment.\n26. Evaluate organoid formation and morphology after 7 days in culture.\n27. Count and take images of organoid morphology.\n28. Remove mouse organoid medium (Drost et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.742#cpz1742-bib-0017]) and gently add to each well 100 µl of pre-warmed (37°C) mouse drug treatment medium (Chan et al., 2022[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.742#cpz1742-bib-0008]) containing the drug or vehicle to be tested at the desired range of concentrations.\n29. Evaluate reversion of aggressive organoid morphology after 4 days of treatment. Count and take images of organoids with reverted morphology (Fig. 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.742#cpz1742-fig-0005]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/c2ea1e0a-4acc-4135-9b4a-efa50d391703/cpz1742-fig-0005-m.jpg</p>\nFigure 5\nPharmacological reversion of aggressive organoids morphology. Top panels, images of 3D organoids with irregular/slithering morphology (untreated). Bottom panels, organoids with reverted/cystic morphology following treatment with an epigenetic compound.",
    "This protocol provides a detailed procedure for the generation and culture of tumor spheres derived from human (e.g., PDX or cancer cell xenograft) or from GEMM prostates. First, single cells are obtained after enzymatic digestion of minced xenografts; tumor spheres are formed by plating single cells in low attachment, low density, and serum-free conditions. Tumor spheres can be incubated in vitro with specific drugs for the evaluation of the impact of treatment on tumor spheres morphology, size, and number.\nMaterials\nLuCaP 145.2 PDX tumors (Nguyen et al., 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.742#cpz1742-bib-0042])\nCollagenase D (MilliporeSigma, cat. no. 11088858001)\nGibco RPMI-1640 medium (Thermo Fisher Scientific, cat. no. 31800-089)\nPBS, 1× (Chemie Brunschwig, cat. no. CS1PBS01-01)\nTrypan blue, 0.4% (MilliporeSigma, cat. no. T8154)\nB27 supplement, 50× (Life Technologies, cat. no. 17504-044)\nhBFGF (MilliporeSigma, cat. no. F0291-25UG)\nEGF (LubioScience, cat. no. AF-100-15-100UG)\nInsulin (MilliporeSigma, cat. no. 12585-014)\nDNase I Solution (1 unit/µl), RNase-free (Thermo Fisher Scientific, cat. no. 89836)\nRed blood lysis buffer (Roche, cat. no. 11814389001)\nMammary Epithelial Basal Medium (MEBM; Lonza, cat. no. CC-3151)\nPoly-2-hydroxyethyl methacrylate, 1× (MilliporeSigma, cat. no. P3932), dissolved in 95% ethanol (12 mg/ml) for coating 12-well tissue culture plates\nDissecting tools (sterilized): \n               \nDissecting scissors\nDissecting forceps\nDissecting microscope (Olympus/Leica)\nCell strainer 40-μm pore size (Falcon; Corning, cat. no. 352340)\nCell culture centrifuge (Beckman Coulter)\nCO2 incubator set to 5% CO2 and 37°C\nCell culture disposables: \n               \nPetri dishes (BD Flacon)\nCentrifuge tubes (Eppendorf)\nPipets\nPipet tips\nFilter units (MilliporeSigma)\n12-well plates (VWR, cat. no. 10062-894)\n1. Remove subcutaneous LuCaP 145.2 tumor xenografts, separating them from mouse skin by using scissors and forceps.\nKeep dissecting cabinet area clean and tidy.\n2. Put xenograft in a 10-cm Petri dish containing 3 ml ice-cold 1× PBS.\n3. Mince xenograft into small pieces (∼1 mm3) in a 10-cm Petri dish by using a scalpel.",
    "4. Centrifuge tissue chunks at 300 × g for 5 min at 25°C.\n5. Transfer minced xenograft into a 15-ml tube containing 5 ml RPMI-1640 with collagenase D (5 mg/ml) and DNase I (100 U/ml).\nIt is recommended that collagenase D and DNase I mixed in RPMI-1640 medium be prepared fresh.\n6. Mix well with a P1000 pipet and incubate at 37°C for 45 min on a rotator.\n7. Centrifuge at 300 × g for 5 min at 4°C.\n8. Decant supernatant and resuspend cell pellet in 5 ml of 1× PBS. Pipet up and down with a P1000 pipet to ensure efficient resuspension.\n9. Centrifuge at 300 × g for 5 min at 4°C.\n10. Decant supernatant and resuspend cell pellet in 5 ml of 1× PBS.\n11. Put a 40-µm cell strainer on the top of a 15-ml Falcon tube and load resuspended cells trough the strainer.\nThis step can be performed in a 50-ml Falcon tube with a 40-µm cell strainer on the top.\n12. Centrifuge at 300 × g for 5 min at 4°C.\n13. Decant supernatant and resuspend pellet in 2-5 ml of red blood cell lysis buffer for 5 min at room temperature.\nThe volume of red blood cell lysis buffer and the incubation time can be adjusted based on the amount of starting material.\n14. Add 5 ml of 1× PBS and centrifuge at 300 × g for 5 min at 4°C.\n15. Decant supernatant and resuspend pellet in 1× PBS.\n16. Take an aliquot of 10 or 20 µl of cell suspension and add to an equal volume of 0.4% trypan blue for counting of viable cells by using an automatic hemacytometer.",
    "If necessary, keep the cells on regular ice for a few minutes. A range of 10 × 106 to 15 × 106 viable cells are obtained for each PDX. In order to establish a good spheroid culture, 5,000 to 10,000 cells are used as described in the following step.\n17. Prepare a mix of 5,000 cells in 2 ml of serum-free MEBM with specific supplements: 1× B27; 20 ng/ml hBFGF; 20 ng/ml EGF; 0.4 µg/ml insulin; 1% pen/strep.\nIt is recommended that MEBM with specific supplements be prepared fresh; use it for no more than 1 week. At this point, it is possible to prepare a master mix of multiple replicates.\n18. Seed cells in pre-coated poly-2-hydroxyethyl methacrylate 12-well plates.\nIt is possible to scale up or down the number of cells, volumes, and well-plates for specific experiments.\n19. Add therapeutic agent of interest at desired concentration(s) as a single agent or in combinations for treatment during tumor sphere formation assay. Culture tumor spheres in tissue culture incubator at 37°C and 5% CO2.\n20. Replenish 2 ml of fresh serum-free MEBM with specific supplements after 3 days.\n21. Evaluate tumor sphere formation after 14 days in culture (see Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.742#cpz1742-fig-0002]).\n22. Count and picture tumor spheres with a diameter >50 µm (Fig. 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.742#cpz1742-fig-0006]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/b1744440-d487-47af-b546-7587bffcc5c2/cpz1742-fig-0006-m.jpg</p>\nFigure 6\nTumor spheres formation. Images of tumor spheres from control (untreated) or following treatment (treated)."
  ],
  "subjectAreas": [
    "Pharmacology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}