{
  "id": 3916,
  "origin_website": "Cell",
  "title": "Cell-Based Glycan Arrays—A Practical Guide to Dissect the Human Glycome",
  "procedures": [
    "Step-by-Step Method Details\nStep-by-Step Method Details\nHEK293 Adherent Culture\nTiming: 1 week\nAdherent HEK293-6E cells have the advantage that it is possible to assess morphological features (size, shape, cytoskeleton, adhesion, etc.) and to perform functional analysis (uptake, migration, signaling, etc.), because they are larger and stretched compared to suspension cells. Adherent cells are less suitable for the production of recombinant glycoproteins, because of serum in the media that interferes with purification. This step describes how to culture isogenic HEK293 cells in adherent form.\nThaw vials of cryopreserved isogenic HEK293 cells and transfer into 50 mL canonical centrifuge tubes as soon as the cells are thawed. Add 10 mL of cold DMEM culture medium drop-wise and then fill the tube with cold medium to 50 mL.\nSpin the tube for 3 min, 300 xg at 4°C and discard the supernatant. Resuspend the cells in pre-warmed DMEM culture medium and seed 0.5–1 x 105 cells in 2–3 mL medium into a 6-well plate. Culture the cells at 37°C with 5% CO2 in a humidified incubator and monitor growth daily.\nCritical: HEK293 cells detach easily, therefore avoid shaking of the culture plate and add or aspirate medium with care.\nWhen the cells reach 70%–80% confluence (ca. 1 x 106 cells/well), carefully remove the culture medium and add 0.5 mL TrypLE dissociation reagent per well. Gently swirl the plate and incubate the plate for 2–3 min at 20–25°C until the cells have detached.\nAdd 1.5 mL culture medium, resuspend the cells and transfer 20 μL suspension to a 1.5 mL tube and mix with 20 μL 0.4% trypan blue solution. Count the number of cells using a hemocytometer or automated cell-counter.\nSeed 2–3 x 105 cells into a new 6-well plate in 2–3 mL culture medium and check growth and confluence every 1–2 days.",
    "Note: The doubling time of HEK293 cells and the isogenic clones is approximately 24 hrs.\nNote: HEK293-6E cells detach easily in dissociation reagent and it is not necessary to wash them with 1x PBS before adding dissociation reagent.\nNote: We recommend freezing vials of the isogenic cells and to renew the culture after 20 passages. For further information regarding the culture of HEK293 adherent cells visit the ECACC website.\nHEK293-6E Suspension Culture\nTiming: 1 week\nSuspension HEK293-6E cells grow in serum free medium and are thus highly useful for the production and purification of glycoproteins. Morphological and functional analysis of suspension cells is more difficult compared to adherent cells, because they are round and smaller. This step describes how the isogenic HEK293-6E cells are cultured in suspension condition.\nThaw vials of cryopreserved isogenic HEK293-6E cells and transfer into 50 mL bioreactor tubes with filter top as soon as the cells are thawed. First, add 10 mL of cold Freestyle F17 medium drop-wise and then fill the tube with cold medium to 50 mL.\nSpin the tube for 3 min, 300 xg at 4°C and discard the supernatant. Resuspend the cells in Freestyle F17 medium at a concentration of 1 x 106 cells/mL and place the 50 mL bioreactor tubes with filter top into an orbital tube shaker in a CO2 incubator at 37°C.\nCritical: Do not exceed a volume of 30 mL per tube and ensure that the shaking speed is sufficient to avoid sinking of the cells to the tube bottom.\nMonitor cell growth and when the density reaches 2 x 106 cells/mL, add fresh medium to a final concentration of 0.5 x 106 cells/mL.\nCritical: Optimal growth concentrations are 0.5–1 x 106 cells/mL. Make sure that the density does not exceed 2 x 106 cells/mL.",
    "Note: The doubling time of HEK293-6E cells and the isogenic clones is approximately 24 hrs.\nNote: We recommend freezing vials of isogenic cells and to renew the culture after 20 passages. Further information on the culture and application of HEK293-6E cells can be found in: (L'Abbe et al., 2018[href=https://www.wicell.org#bib3]).\nCryopreservation of the Isogenic HEK293 Cells\nTiming: 1–2 h\nBoth, adherent and suspension HEK293-6E cells can be cryopreserved for storage. The cryopreserved cells can be used to renew a culture upon exceeding 20 passages or for distribution. This step describes how the isogenic adherent HEK293 cells (A) and suspension HEK293-6E cells (B) can be cryopreserved.\nCulture a 6-well of isogenic HEK293 cells in complete DMEM to 70%–80% confluence (about 1–2 x 106 cells). Carefully remove the culture medium and add 0.5 mL TrypLE dissociation reagent and gently shake the plate to distribute the dissociation reagent and incubate for 2–3 min until the cells have detached. Collect the cells with 2 mL complete DMEM to inactivate the trypsin and transfer to a 15 mL centrifuge tube.\nCollect medium containing 5 x 106 suspension cells from a culture in a 50 mL bioreactor tube with filter top.\nCritical: Optimal growth concentrations are 0.5–1 x 106 cells/mL. Make sure that the density does not exceed 2 x 106 cells/mL.\nSpin the cells for 3 min at 300 xg at 4°C and discard the supernatant.\nResuspend the cells in 1 mL of the respective freeze medium at a concentration of 1 x 106 cells/mL for adherent HEK293 cells and 5 x 106 cells/mL for suspension HEK293-6E cells and transfer to 1.6 mL CryoPure tubes.",
    "Place the CryoPure tubes into a cooled freezing container and put the container into a -80°C freezer for 24 hrs. The cells can be stored at -80°C for several months or transferred to -150°C or liquid nitrogen for long-term storage.\nNote: The protocol can be adjusted to any number of cells. We recommend freezing 1 x 106 cells/mL for adherent HEK293 cells and 5 x 106 cells/mL for suspension HEK293-6E cells.\nTransient Expression of Reporter Glycoproteins\nTiming: 1–2 h\nGlycans can be presented on specific proteins and some probes (e.g. antibodies) recognize a glycan feature only in the context of a specific carrier protein which might not be endogenously expressed in HEK293 cells. Therefore, glycoprotein reporters can be designed for transient expression in the isogenic cells. This step describes how such glycoprotein reporters can be transiently transfected into the isogenic HEK293 cells using a 6-well format (Figure 5[href=https://www.wicell.org#fig5]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/64-Fig5.jpg\nFigure 5. Using GFP-Tagged Reporter Constructs to Probe Protein Specific Glycosylation\n(A) Depiction of the transient transfection protocol of isogenic HEK293 cells with GFP-reporter protein for glycan display.\n(B) Representative flow cytometry analysis of GBP binding to isogenic HEK293 cells transiently expressing a GFP-reporter protein. The gate is set on live cells based on the FSC-A versus SSC-A and single events are gated by plotting the FSC-A versus FSC-W. Live, single cells are transformed to a histogram showing GFP expression on the x-axis. Gates for GFP- and GFP+ cells are set based on non-transfected control cells and GBP binding to the GFP- and GFP+ population is shown as histograms.",
    "(C and D) Immunocytochemistry of isogenic HEK293 cells. Scheme showing the protocol for staining of isogenic HEK293 cells on coverslips (C). Representative fluorescence microscope images show binding of anti-STn antibody (clone TKH2) to HEK293WT cells (above) and isogenic HEK293 ΔCosmc/KI-ST6GALNAC1 cells (HEK030) with combinatorial KO of COSMC and KI of ST6GALNAC1 to produce homogenous STn O-glycosylation capacity (D).\nSeed ca. 0.5 x106 isogenic HEK293 cells/well in 0.5 mL DMEM culture medium into 6-well plates one day prior to transfection (ca. 50%–60% confluency).\nNote: When using penicillin/streptomycin in culture media, carefully exchange the medium to antibiotics-free medium before transfection as the presence of antibiotics during transfection can result in lower transfection efficiency and cytotoxicity.\nFor each plasmid, prepare a 1.5 mL tube containing 200 μL Opti-MEM and 2 μg DNA.\nCritical: Ensure high purity of the plasmid, the OD260/280 ratio should be around 1.9 for optimal transfection.\nAdd 9 μg PEI 25K to the diluted DNA (3:1 ratio) and immediately vortex for 10 sec.\nCritical: The 3:1 ratio PEI 25K:DNA was found to be optimal for most plasmids tested, but depending on the plasmid optimal transfection efficiency might be achieved at different ratios. Transfection should therefore be optimized for instance by comparing 1:1, 2:1, 3:1 and 6:1 ratios.\nIncubate the tube for 10–15 min at 20–25°C.\nAdd the PEI 25K/DNA mix dropwise to the 6-well while gently swirling the plate to evenly distribute the transfection reagent.\nAfter 24 h, carefully change the culture medium and harvest the cells 24–48 hrs post transfection for analysis or fixation.\nCritical: Confirm expression of the transfected glycoprotein for instance by co-expression of a fluorescent reporter protein encoded in the expression plasmid or other techniques (e.g. ELISA, SDS-PAGE).",
    "Note: Other transfection reagents may be used and the protocol can be adjusted to other cell numbers or plate formats. Selection markers can be included to obtain cells with stable expression.\nFixation and Storage of Isogenic HEK293 Cells\nTiming: 1–2 h\nCulturing large numbers of isogenic cells at the same time for the array can be impracticable. The cells can be fixed to make handling of a large numbers of isogenic cells more convenient. This step describes how isogenic HEK293 cells can be fixed and frozen for use in binding assays or storage for later use (Figure 3[href=https://www.wicell.org#fig3]A).\nTo obtain large numbers of isogenic HEK293 cells, culture a T175 flask of isogenic HEK293 cells in complete DMEM to 70%–80% confluence (about 20 x 106 cells). Carefully remove the culture medium and add 3 mL TrypLE dissociation reagent and gently shake the flask to distribute the dissociation reagent and incubate for 2–3 min until the cells have detached. Collect the cells with 7 mL complete DMEM to inactivate the trypsin and transfer to a 50 mL centrifuge tube.\nSpin the cells for 3 min at 300 xg at 4°C, discard supernatant.\nWash the cells with 10 mL 1x PBS and centrifuge for 3 min at 300 xg at 4°C.\nCritical: It is important to remove all culture medium proteins and trypsin before fixation, to avoid cross-linking of these proteins with the cells.\nResuspend the cells in 10 mL 1x PBS and transfer 20 μL cell suspension to an 1.5mL Eppendorf tube and mix with 20 μL 0.4% trypan blue solution. Count the number of cells using a hemocytometer or automated cell-counter.",
    "Spin the cells for 3 min at 300 xg at 4°C, discard the supernatant and resuspend the cells thoroughly in 2% paraformaldehyde solution (5 x 106 cells/mL) and incubate for 10 min at 20–25°C.\nCentrifuge the tube for 3 min at 300 xg at 20–25°C, carefully aspirate the supernatant and wash three times by centrifugation with 1x PBS to remove all paraformaldehyde.\nCritical: It is important to remove all paraformaldehyde to prevent cross-linking events when using the cells for analysis at a later time point.\nResuspend cells in HEK293 freezing medium at a concentration of 10 x 106 cells/mL and aliquot 1 mL per 1.6 mL CryoPure tube.\nPlace the CryoPure tubes into a cooled freezing container and place the container into a -80°C freezer for 24 hrs.\nPause Point: The fixed cells can be stored at -80°C or transferred to liquid nitrogen for long-term storage.\nNote: The protocol can be adjusted to any number of cells and can also be applied to cells transiently transfected with a glycoprotein. Cells may also be frozen in 96-well format instead of tubes.\nNote: Different fixation protocols may be used, but proper glycan presentation of fixed cells should be validated with lectins.\nPreparation of Glycan-Binding Reagent\nTiming: 1–2 h\nGlycan-binding reagents with high affinity are suitable for sequential staining, while reagents with weak binding affinity can be pre-complexed to create multivalent interactions. This step describes how reagents such as GBPs can be prepared for binding experiments.",
    "Critical: Be aware that pre-complexing may enhance the binding signal but may also enhance non-specific (false-positive) interactions. Some reagents require cofactors such as calcium (C-type lectins) for binding or different pH levels. The optimal reagent concentration for staining varies a lot between different reagents and there is batch-to-batch variation as well. Therefore, it is recommended to test several dilutions prior to a screening experiment.\nCritical: Make sure that the reagent carries a fluorophore or tag that enables assaying the binding to the isogenic cells. If no tag is available, the reagent may be conjugated to a fluorophore or possibly antibodies exist that will allow detection.\nDissolve and store reagents according to the manufacturer’s instructions.\nCritical: Some reagents are not stable in solution and should be used within a short time frame after dissolving. For binding reagents that are stored frozen, it is recommended to prepare several aliquots to avoid freeze-thaw cycles that can reduce their activity. If applicable, follow the manufacturer’s instruction regarding handling and storage and confirm activity of the reagent before performing large screening experiments.\nCalculate the amount of volume needed for staining. For high-throughput staining in 96-well plates use 30–50 μL staining buffer per well.\nDepending on the reagent’s binding affinity, prepare a staining mix for sequential staining (a) or staining with pre-formed complexes (b) (Figures 3[href=https://www.wicell.org#fig3]B and 3C).\nDilute the glycan-binding reagent to the desired final concentration (usually between 0.1–2 μg/mL) in staining buffer and keep at 4°C. Prepare these solutions freshly before every experiment.\nFor pre-complexing, mix 0.1–2 μg/mL tagged reagent (e.g. biotin, Fc) with fluorophore-conjugated secondary staining reagent such as streptavidin (1:4 ratio) or antibodies (1:2 ratio) in staining buffer and incubate for 20 min at 4°C protected from light.",
    "Critical: It is recommended to prepare the staining solution freshly every time, especially the pre-formed complexes.\nCritical: The concentration of the reagent (e.g. lectin) can influence its binding properties. Therefore, it is recommended to titrate the reagent before performing screening experiments and, if feasible, to also include 2–3 different concentrations in the screening assay.\nHigh-throughput Flow Cytometry Analysis\nTiming: 4–6 h\nBinding to a large panel of isogenic cells, the cell-based glycan array, can be assayed readily with high-throughput flow cytometry. This step describes the staining of isogenic cells with glycan-binding reagents and subsequent flow cytometry analysis (Figures 4[href=https://www.wicell.org#fig4] and 5[href=https://www.wicell.org#fig5]B).\nCollect a panel of isogenic cells with or without transfection of transient reporter, and prepare single cell suspensions from live or fixed cells in culture medium at a concentration of 0.5–1 x 106 cells/mL.\nUsing a multichannel pipette and multichannel pipette reservoirs, distribute 100 μL/well cell suspension over 96-well round or V bottom microwell plates (0.5–1 x 105 cells/well). Preferably, use three plates that will serve as technical replicates. Furthermore, extra wells should be included as unstained and secondary staining reagent only controls.\nSpin the plates in a plate centrifuge at 300 xg for 3 min at 4°C. Remove the supernatant by ‘flicking’ the plates or careful aspiration and wash the cells by adding 150 μL staining buffer followed by centrifugation at 300 xg for 3 min at 4°C and removal of supernatant.\nCritical: After centrifugation ensure that a pellet is visible at the bottom of the plate and perform ‘flicking’ carefully to avoid loss of cells (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/64-Fig6.jpg\nFigure 6. Image Showing Cell Pellets in a 96-Well Round Bottom Microwell Plate after Centrifugation",
    "Resuspend the cells in 30–50 μL staining solution and incubate the plates for 30–60 min at 4°C protected from light. Follow the protocol for sequential staining or staining with pre-formed complexes.\nCritical: It is important to stain live cells at 4°C to avoid uptake of the reagent or fluorophore and to avoid apoptotic signaling that can be induced by some lectins due to cross-linking of glycans.\nCritical: Optimal incubation time might vary between reagents. It is recommended to optimize the staining before performing large screenings with the cell-based glycan array.\nOptional: Other staining reactions (viability, surface marker) can be included in the staining mix, provided they do not interfere with glycan binding or the secondary staining reagents.\nIn case of sequential staining, wash the plate twice with staining buffer and incubate for 20 min at 4°C with 30–50 μL/well secondary staining reagent diluted in staining buffer. Protect the cells from light.\nWash the plates twice and resuspend the cells in 100–200 μl staining buffer. Keep the cells at 4°C protected from light until analysis.\nMeasure the samples by flow cytometry using the auto sampler function.\nFor analysis and interpretation of the data, proceed to the expected outcomes section.\nNote: When using fixed cells, the staining procedure can be performed at 20–25°C.\nImmunocytochemistry\nTiming: 4–6 h\nCompared to flow cytometry, immunocytochemistry is less high-throughput, but it is useful to obtain information on the binding localization, clustering or uptake of a probe by cells. This step describes how the isogenic HEK293 cells can be stained with glycan-binding reagents for analysis with fluorescence microscopy (Figures 5[href=https://www.wicell.org#fig5]C and 5D).\nCoat sterile cover slips with 100 μg/mL poly-L-lysine for 5 min at 20–25°C.",
    "Critical: Positively charged poly-L-Lysine allows negatively charged cells to attach firmly to the cover slips to avoid detachment during the staining procedure. Other reagents might also be used for coating.\nWash the cover slips three times with 1x PBS and place them on the bottom of 24-wells.\nCritical: Remove all non-bound poly-L-Lysine to avoid attachment to cells.\nCollect the isogenic HEK293 cells with TrypLE dissociation reagent and seed 0.1–0.2 x 106 cells in 0.5 mL on top of the coverslip into the 24-wells.\nAllow the cells to adhere and spread 12–18 h in the incubator at 37°C and 5% CO2.\nCarefully aspirate the supernatant and carefully wash the cells three times with 1 mL 1x PBS.\nCritical: Remove all culture medium proteins and trypsin before fixation to avoid cross-linking of these proteins with the cells.\nAdd 0.5 mL 4% paraformaldehyde solution to the cells and incubate them for 10 min at 20–25°C.\nWash thrice with 1x PBS.\nCritical: It is important to remove all paraformaldehyde to prevent cross-linking events when using the cells for analysis at a later time point.\nPause Point: The fixed cells can be kept at 4°C in 1x PBS for up to 24 hrs before proceeding to staining.\nBlock non-specific interactions by incubating the cells with 5% (w/v) bovine serum albumin in 1x PBS for 30 min at 20–25°C.\nOptional: Before blocking, the cells can be permeabilized for intracellular staining by incubation with 0.1%–0.2% (v/v) Triton X-100 for 10 min at 20–25°C or other permeabilization reagents.\nWash once with 1x PBS and add 0.3 mL staining solution for 60 min at 20–25°C or 12–18 hrs at 4°C.\nWash three times with staining buffer and incubate samples with 0.3 mL secondary staining reagent for 1 h at 20–25°C.",
    "Wash three times with staining buffer and one time with 1x PBS and mount the cover slips cell-side down with mounting medium.\nAssess binding using a fluorescent microscopy system and acquire representative images.\nOptional: Other staining reagents can be included e.g. nucleic acid stains.\nNote: Quantitative data can be obtained by analyzing the fluorescence microscopy images with ImageJ or similar software.\nTransfection of HEK293-6E Suspension Cells\nTiming: 1–2 h\nThe isogenic cells can be used to produce glycoproteins with display of a particular glycan feature of interest. This step describes how suspension HEK293-6E cells can be transiently transfected for the production and purification of secreted, recombinant glycoproteins with desired glycosylation features (Figure 7[href=https://www.wicell.org#fig7]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/64-Fig7.jpg\nFigure 7. Schematic Protocol for Expression and Purification of Recombinant Glycoprotein Reporters\nIllustrated is lipid-mediated transfection of HEK293-6E cells in suspension with a His-tagged reporter construct and purification by Ni-NTA chromatography.\nSelect isogenic HEK293-6E cells that display the desired glycan features and prepare a 50 mL bioreactor tube with filter top containing 30 mL of isogenic HEK293-6E cells in suspension at a density of 0.5 x 106 cells/mL two days before transfection.\nThe day of transfection, transfer 20 μl suspension cells to a 1.5 ml tube and mix with 20 μl 0.4% trypan blue solution. Count the number of cells and determine cell density and viability and transfer 30 mL of 1 x106 cells/mL into a 50 mL bioreactor tube.\nCritical: Make sure the cell viability is above 95% and that the density is in the range of 1.0–2.0 x 106 cells/mL.\nThe next day, prepare a 15 mL tube containing 4 mL Opti-MEM and add 30 μg of plasmid encoding the secreted N-/O-glycoprotein of interest with a 6x His tag (or another tag suitable purification).",
    "Critical: Ensure high purity of the plasmid, the OD260/280 ratio should be close to 1.9 for optimal transfection.\nAdd 90 μg PEI 25K solution (3:1 ratio PEI:DNA) to the diluted plasmid, vortex for 10 sec and incubate the mixture at 20–25°C for 10–15 min.\nCritical: The 3:1 ratio PEI:DNA was found to be optimal for most plasmids tested, but depending on the plasmid optimal transfection efficiency might be achieved at different ratios. Transfection should therefore be optimized for instance by comparing 2:1, 3:1, 4:1 and 6:1 ratios.\nTake the suspension cells from the shaker and carefully add 4 mL of transfection solution while gently swirling the tube for even distribution. Return the tube to the shaker and incubate for 72–96 hrs.\nCritical: Suspension cells sink down to the tube bottom fast after removal from the shaker. Ensure the cells are in suspension before adding the transfection mix. Gently swirling the tube while adding the transfection mix avoids pelleting of the cell.\nAfter 72–96 h, spin down the tube for 3 min at 300 xg at 20–25°C and transfer the supernatant into a clean 50 mL tube.\nCritical: Expression levels depend on the transfection efficiency and also vary between different N-/O-glycoprotein constructs. Usually, we obtain 50–100 μg/mL for most N-/O-glycoproteins tested.\nCritical: Assure that no cells are present in the supernatant and that cell death is minimal in the culture, because endogenous protein with immature glycosylation could be released. Above 90% viability is desirable when harvesting the supernatant.\nOptional: Take a 50–100 μL sample of the supernatant and assess correct expression of the N-/O-glycoprotein in the supernatant by SDS-PAGE analysis or other methods.",
    "Pause Point: The supernatant can be frozen and stored at -20°C for purification at a later time point. Alternatively, the supernatant can be flash frozen by liquid nitrogen and stored at -80°C, which might preserve protein integrity better.\nPurification of His-Tagged Glycoproteins\nTiming: 4–6 h\nThe produced recombinant glycoproteins can be highly useful for a variety of applications including studies on how a particular glycan feature modulates protein function or distribution in vivo or targeting of a glycan-binding receptor. For these experiments it is important to work with highly pure material. This step describes how glycoproteins can be purified from cell culture supernatant of the transfected isogenic cells.\nFilter the cell culture supernatant containing secreted His-tagged glycoprotein through a 0.45μm vacuum filter system to remove any cell debris.\nPack about 200 μL nickel-nitrilotriacetic acid (Ni-NTA) affinity agarose into a 2 mL gravity-flow column and equilibrate the column with 5 agarose bed volumes (1 mL) equilibration buffer.\nMix 30 mL of the cell culture supernatant with 10 mL of 4x column equilibration buffer.\nRun the sample twice over the Ni-NTA purification column and wash the column thrice with 10 agarose bed volumes (2 mL) column washing buffer.\nCritical: Keep the flow rate at a moderate speed, as fast flow will reduce the yield of glycoproteins.",
    "Optional: Collect the flow-through to assess the purification efficiency by SDS-PAGE analysis or other methods. The column size can be scaled up depending on the sample volume. Read the manufacturer’s instructions regarding the binding capacity of the Ni-NTA agarose (usually up to 50 mg/mL of 6x His-tagged proteins), imidazole concentrations and buffer volumes required. Alternatively, instead of using gravity-flow, Ni-NTA agarose beads can be added to the supernatant in 50 mL tubes followed by 12–18 hrs incubation at 4˚C and spin purification. This method may increase yield, but reduces purity with more non-specific proteins purified.\nElute the immobilized protein by adding 2 agarose bed volumes (0.4 mL) column elution buffer and collect into a 1.5 mL tube. Repeat this step two times to obtain a total of three fractions in separate tubes.\nDetermine the protein content in the fractions containing the His-tagged protein by SDS-PAGE analysis.\nSelect the fraction with the highest protein content (or pool fractions) and exchange the elution buffer to MQ, 1x PBS, 50 mM ammonium bicarbonate (Ambic) or another buffer type (compatible with the planned downstream applications) using a desalting column (e.g. PD MiniTrap™ G-25 column or ZebaTM column) according to the manufacturer’s instructions.\nNote: Ambic buffer is suitable for further mass spectrometry analysis.\nAliquot the purified glycoprotein and store at -20°C or flash freeze the protein and store at -80 °C, which may preserve protein integrity better.\nOptional: Correct glycosylation of the purified recombinant glycoproteins can be confirmed by mass spectrometry."
  ],
  "subjectAreas": [
    "Genomics",
    "Mass Spectrometry",
    "Flow Cytometry",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}