{
  "id": 2412,
  "origin_website": "Cell",
  "title": "Label-free protocol to quantify protein affinity using isothermal titration calorimetry and bio-layer interferometry of a human eIF5-mimic protein",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTiming: 5 days for h5MP1 protein purification\nTiming: 1.5–2 h for Day 1\nTiming: 16–18 h for Day 2\nTiming: 5 h for Day 3\nExpression & purification of human 5MP1 (h5MP1) and its binding partners heIF2β53-136 and heIF3c20-102.\nh5MP1 protein purification. Day 1.\nTransformation of BL21 (DE3) E. coli cells with pET-h5MP1 (Wild Type/BN1/7A) and heIF2β53-136 and heIF3c20-102.\nTake a vial of competent cells and thaw on ice.\nNote: Make sure to thaw competent cells on ice and handled gently as sudden changes of temperature affects cells viability.\nAdd <100 ng of plasmid to the competent cells.\nIncubate cells-DNA mixture on ice for 30 min.\nHeat shock competent cells at 42°C for 30 s.\nAdd 300 μL of sterile LB broth to the tube and incubate at 37°C in a shaker incubator at 220 rpm for 1 h.\nPlate 60 μL of cells onto LB agar plates with 50 μg/mL Kanamycin and place the plates in an incubator overnight (16–18 h) at 37°C. Day 2.\nPre-culture for h5MP1, heIF2β53-136 and heIF3c20-102.\nInoculate a single transformed colony into 100 mL LB media with Kanamycin (50 μg/mL) and incubated in shaker at 220 rpm at 37°C overnight. Day 3.\nLarge scale cultures.\nInoculate 20 mL of the overnight pre culture into 1 L LB media with Kanamycin (50 μg/mL) and incubate in shaker at 220 rpm at 37°C till OD600=0.6.\nInduce cell culture for T7 RNA polymerase expression with 0.5 mM IPTG final concentration and incubate further for 3–4 h.\nHarvest cells by centrifugation at 14000 g (Beckmann JLA 8.1 Rotor) for 15 min at 4°C and store pellets in the −80°C freezer.",
    "Note: Maintain sterile condition while working with bacterial culture to avoid any contamination. Use aseptic conditions for all transfer, clean bench and surfaces with 70% ethanol.\nDay 4.\nPurification of h5MP1, heIF2β53-136 and heIF3c20-102.\nThaw bacterial pellets at room temperature and resuspended in 35 mL/1 liter culture binding buffer (this buffer may contain protease inhibitors, see troubleshooting[href=https://www.wicell.org#troubleshooting] Problem 1). Lyse cells by sonication (10 s on; 20 s off cycle for a total of 3.5 min processing time at 95% amplitude) in ice-water mixed bath.\nCentrifuge cell lysate at 40,000 × g on a Beckmann JA 30.1 rotor for 40 min at 4°C and collect the supernatant and sterilize through a 0.22 μm filter (Celltreat).\nNote: Take 20 μL aliquot of cell lysate before centrifugation, add 5 μL 5× protein loading dye and boil for 2–3 min at 98°C. Label it as whole cell lysate and keep it aside to run on SDS-PAGE later.\nEquilibrate Ni-NTA column (5 mL resin bed volume) with binding buffer to at least 5 CV (25 mL). Load clear lysate to the column at 2 mL/min. Collect the flow-through.\nNote: Take 20 μL aliquot of flow-through, add 5 μL 5× protein loading dye and boil for 2–3 min at 98°C. Label it as flow through and keep it aside to run on SDS-PAGE later.\nWash the column with binding buffer until the absorbance at 280 reaches a plateau. This is followed by a second wash step with 5% of elution buffer. A peak should elute containing non-specific binding proteins. Wash until absorbance decreases and reaches a plateau. Collect all washes.\nNote: Take 20 μL aliquot of washes, add 5 μL 5× protein loading dye and boil for 2–3 min at 98°C. Label it 5% wash and keep it aside to run on SDS-PAGE later.",
    "Elute protein in 9 mL fractions with 50% elution buffer.\nAnalyze eluted fractions along with whole cell lysate, flow-through and washes on 12% SDS-PAGE gel, and pool together the fractions containing purified proteins.\nRemove the His-tag was by adding Thrombin (Hemotech) 10 Units/mg to protein and dialyze overnight at 4°C against Thrombin Dialysis buffer. Day 5.\nAnalyze the digestion on a 12% SDS-PAGE. If the tag has been removed, add benzamidine to a final concentration of 1 mM. Load the protein solution onto a Ni-NTA column pre-equilibrated with binding buffer to remove any remanent non-cleaved protein. Collect flow-through.\nNote: After His-tag removal, protein does not bind to column and will come in flow through. Still check 5% wash for any non-specific binding of protein to column.\nConcentrate protein using Centrifugal Filtration Unit (10 kDa MW Cut off) to 3 mL and load onto a HiLoad 16/60 Superdex 75 preparation-grade column pre-equilibrated with size-exclusion buffer (10 mM HEPES pH 7.5, 125 mM NaCl, 1 mM TCEP) for further polishing and removal of the small amount of thrombin.\nAnalyze the eluted fractions on a 12% SDS PAGE for purity. Pool fractions with protein and concentrate to 2 mg/mL final concentration, aliquote and store at −80°C freezer for the range of duration between 3 to 12 months (depending on protein purification fractions). See Figure 1[href=https://www.wicell.org#fig1], lanes 1–3 for the final products.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1898-Fig1.jpg\nFigure 1. SDS-PAGE of purified proteins used in the ITC experiments\nLane 1: h5MP1-WT; Lane 2: h5MP1-BN1; Lane 3: h5MP1-7A; Lane 4: Fisher EZ-run markers (116, 66, 45, 35, 25, 18 and 14 KDa); Lane 5 (heIF2β53-136, GB1- and His-tags removed).",
    "Note: All buffers for purification need to be prepared with cold deionized water, filter with 0.22 μM filter and store at 4°C. All columns used for purification need to be stored at cold temperature.\nNote: All protein purification steps need to be done over ice or at 4°C.\nPreparation of lysates containing GST-h5MP1. The lysates containing GST-h5MP1 proteins (WT, 7A or BN1 mutant) for their immobilization to the anti-GST biosensors in BLI were prepared as described in 1) up to step d-ii, except that BL21(DE3) transformants carrying pGEX-h5MP1 or its derivative were IPTG (0.5 mM) -induced for 1 h at 30°C and lysed in PBS containing 1% Triton X-100. Intact full-length GST-fusion product was analyzed as follows:\n250 μL of the cell lysates is added to 4 μL bed-volume of Glutathione Sepharose 4B and incubated for 30 min at room temperature on a rocker.\nWash the resins three times with 0.2 mL ice-cold PBS.\nAdd 3 μL of 5× Protein Loading Buffer and heat the tubes at 95°C for 2 min to elute the bound GST fusion proteins.\nAnalyze the supernatant by SDS-PAGE, followed by Coomassie Blue staining.\nNote: GST-fusion protein concentration is expected to be ∼20 μg/mL.\nIsothermal titration calorimetry (ITC)\nTiming: 1–1.5 h each run\nExperiments are performed on an MicroCal ITC200 instrument. This assay uses untagged proteins.\nSetting up ITC run.\nAll proteins used in the ITC must be buffer exchanged into size exclusion buffer using HiLoad 16/60 Superdex 75 column.\nPrepare all solutions of h5MP1 proteins (WT or BN1/7A mutants) to 20 μM final concentration. heIF2β53-136 is at 200 μM final concentration.\nWash Cell & Syringe of MicroCal ITC200 instrument thoroughly with deionized water followed by size-exclusion buffer.",
    "Fill cell with 200 μL of h5MP1 using a Hamilton syringe making sure no bubbles are left in the chamber by gently agitating the chamber with the syringe.\nFill the pipette/injector with 40 μL of heIF2β53-136 using the automated injection fill step. Move pipette/injector into the filled cell chamber.\nRunning ITC titration.\nThe program will wait for a stable baseline at an equilibrium temperature of 25°C.\nThe program setting consists of 20 injections with first unique injection of 0.5 μL and remaining 19 injections of 2 μL each with 2n injection time where n=injection volume and 150 s spacing between each injection. The agitation speed was set to 750 rpm).\nData Analysis.\nAnalyze all datasets (Figure 2[href=https://www.wicell.org#fig2], top) to obtain the binding constant, stoichiometry and binding enthalpy using the single site model within the ITC data analysis package of the Origin software. The software automatically determines the fitting parameters such as the baseline, the range to integrate the injection peaks and the initialization of the fitting parameters upon calculation of the heat of reactions (Figure 2[href=https://www.wicell.org#fig2], bottom).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1898-Fig2.jpg\nFigure 2. Representative single ITC titrations\nThe raw data of the titrations is shown in top while the non-linear least square fit of the integrated heats as a function of the molar ratio of the different protein pairs.\n(A–C) (A) h5MP1-WT/heIF2β53-136; (B) 5MP1-BN1/heIF2β53-136 and (C) 5MP1-7A/heIF2β53-136.\nConclusions.\nRepeat experiments under same condition for a total of 3 runs. The ITC200 Origin software calculates all the thermodynamic parameters based on the initial concentrations of the proteins, these included ΔH, ΔG, ΔS, Kd and stoichiometry.\nBiolayer interferometry (BLI)\nTiming: 3 h each run\nExperiments were performed on a BLItz Label-Free Protein Analysis System from ForteBio. This assay uses GST-5MP1 as ligand; and purified heIF3c20-102 and GB-heIF2β53-136 as analytes.",
    "Biosensors activation and setting up the BLItz system (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1898-Fig3.jpg\nFigure 3. Operation of the BLItz system\n(A) Operation interface and parameters.\n(B) Chronological steps of operations. 1, Initial baseline; 2, Loading; 3, Baseline; 4, Association; 5. Dissociation.\nSix anti-GST biosensors were first hydrated using 200 μL BLI binding buffer for 10 min in a tube. BSA and Tween-20 were added to avoid any non-specific binding. The biosensors were kept hydrated in PBS buffer until binding experiments were ready.\nAdvanced kinetic module was chosen as experiment type to perform the affinity binding assay with 2000 rpm shaker speed. GST-5MP1 was first loaded on the anti-GST biosensor followed by analyte association and dissociation.\nThe parameter for Initial Baseline, Loading, Baseline, Association and Dissociation are set at 30, 120, 30, 120 and 120 s respectively.\nBacterial cell lysates containing GST-5MP1, GST-5MP1-BN1 and GST-5MP1-7A proteins were used as ligands to immobilize on the anti-GST biosensors. The two proteins, heIF3c20-102 and GB-heIF2β53-136 purified for ITC experiment were used as analytes. Their concentrations were measured using Protein Bradford Assay and verified with SDS-PAGE. Prior to setting the experiments multiple simple binding assays were performed to check the binding pattern of ligand-analyte interaction.\nNote: The initial preliminary runs provide information for deciding the different concentrations to be used in the experiment. Accordingly, different concentrations (0 μM reference, 0.031 μM, 0.0625 μM, 0.125 μM, 0.25 μM, 0.5 μM, 1.0 μM, 2.0 μM) of the analyte were freshly prepared and equilibrated at the room temperature.",
    "Note: We used GST proteins in the lysates instead of purified ones, because the former contains other bacterial proteins which act as good blocking agents on the biosensor. The anti GST biosensor is very specific for GST tagged proteins; even if there are non-specific traces bound, they were cleared up in the subsequent washing step.\nLigand binding using Anti-GST biosensor (Figure 3[href=https://www.wicell.org#fig3]B, steps 7–9).\nConduct Initial Baseline for 30 s prior to the GST-5MP1 or GST-5MP1-BN1 or GST-5MP1-7A loading on the chip using the drop holder.\nPerform Loading step using 4 μL lysate of GST tagged proteins. Set the Loading duration for 120 s with shaker speed at 2000 rpm.\nConduct a 30 s baseline step to remove unbound GST-5MP1 proteins using tube position. After every step, wash the drop holder three times using double distilled water.\nAnalytes association and dissociation steps through Advanced Kinetic assay module (Figure 3[href=https://www.wicell.org#fig3]B, steps 10 and 11).\nPerform the Association step for different concentration of the purified analytes, heIF3c20-102 and GB-heIF2β53-136, starting with 0 μM concentration as reference to be incorporated during the data analysis. Set the parameter for this step at 120 s and 2000 rpm and generate an association curve.\nPerform the Dissociation step for 120 s at 2000 rpm. Do this measurement using 200 μL of BLI binding buffer to get the dissociation curve.\nRepeat the sequential steps of Initial Baseline to Dissociation for each concentration of the GB-heIF3C20-102 or GB-heIF2β53-136 by replacing new Anti-GST biosensors.\nComplete 6 runs of an assay for every ligand and analyte combination, during which, the run data are closely monitored.",
    "If the sensogram comes out irregular with erratic curves for various reasons, repeat the step by additional runs. Generally it is caused by tiny air-bubbles introduced while pipetting the solution. Tiny air-bubbles can affect the refractive index and thus the interference pattern. Exclude The while analyzing the data.\nAnalysis of data (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1898-Fig4.jpg\nFigure 4. The BLItz data analysis\n(A) An example of global fitting (1:1).\n(B) An example of final results showing deduced kinetic parameters.\nPerform data analysis with the BLItz Pro software. Following the runs, carefully observe every measurement curve for any erratic patterns. After the erratic runs, analyze the data using Global fitting (1:1) to display curve fits and results (Figure 4[href=https://www.wicell.org#fig4]A).\nEnable step corrections for both for the start of association and the start of dissociation; Set the fitting parameter to Global.\nRecord final results (Figure 4[href=https://www.wicell.org#fig4]B) and export them into an excel file for additional statistical analysis (e.g., by 2-tailed students’ Ttests).\nConclusion.\nRepeat experiments for at least 3 runs for every combination of ligand and analyte. Following the assay analysis, BLItz Pro software could generate association rate constant, ka (1/Ms), dissociation rate constant, kd (1/s), and affinity constant, KD (M). In addition, maximum response (Rmax), standard error in Rmax and response at equilibrium (Requilibrium) could also be provided."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Biophysics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}