{
  "id": 5718,
  "origin_website": "Bio",
  "title": "Structural Analysis of Target Protein by Substituted Cysteine Accessibility Method",
  "procedures": [
    "SCAM using intact MEF cellsSeed 1 x 106 cells expressing target protein with single cys-mutation to 12-well plates, and culture for 12 h to reach 100% confluency.Wash the cells once with 1x PBS.For the labeling assay, skip Steps A3 and A4. For the competition assay using MTSES, MTSET, or MTS-TEAE, add competitors at a final concentration of 2 mM to each well. Incubate the cells on ice for 30 min under light-shielded conditions.Wash cells that are not being incubated with labeling compound once with 1x PBS. Make sure not to wash the cells that are being incubated with compound.Dilute 50 mM MTSEA-biotin with DMEM (cys-) at a final concentration of 1 mM. Add 450 μl DMEM (cys-) solution to each well and incubate the cells on ice for 30 min under light-shielded conditions.Wash the cells twice with 1x PBS. Take care not to remove the cells by the water pressure.Solubilize the cells with 500 μl/well of 1% SDS/PBS. Shake the plate for 30 min at room temperature.Sonicate the sample (pulse on/off time: 1 sec; amplitude: 35%) for 2 min 30 sec on ice. Make sure to sonicate the sample to the point where the sample is no longer stringy.Wash the SA beads 4 times using 1x DPBS. Elute the SA beads in 1x DPBS in the ratio of 66% SA beads to 34% 1x DPBS.Add 30 μl of the washed SA beads to each sample. Rotate overnight at room temperature.Centrifuge the SA beads at 12,900 x g for 45 sec at 4 °C. Remove the supernatant and add 500 μl of 1% SDS/PBS. Repeat 4 times.Elute samples by boiling in sample buffer containing 1% 2-mercaptoethanol at 100 °C for 1 min. Analyze the eluted proteins by immunoblotting.",
    "Sometimes the separation of the precipitated beads and the supernatant is difficult because the stickiness of the samples. In this case, refer to Note 3.Preparation of MEF microsomesSeed the cells expressing target protein with single/double Cys mutant onto a 15-cm dish and culture the cells until approximately 90% confluency.Wash the cells with an adequate amount of 1x PBS, and collect the cells in 5 ml/plate of 1x DPBS using a spatula. Cells from two plates are gathered into one 15-ml tube and pelleted by centrifugation at 750 x g for 10 min at 4 °C and stored at -80 °C until use.Suspend the pellet in 2 ml of 1x homogenization buffer containing cOmpleteTM Protease inhibitor cocktail. Cells are then transferred to centrifuge tubes and suspended using a 27 G needle. Homogenize the sample using a polytron homogenizer (speed 4) for 1 min on ice. Then ultracentrifuge the sample at 1,400 x g for 10 min at 4 °C. Add 2 ml of 1x homogenization buffer containing cOmpleteTM Protease inhibitor cocktail to the pellet. Homogenize the sample again at speed 4 for 1 min on ice. Ultracentrifuge the sample at 1,400 x g for 10 min at 4 °C. Combine the supernatant and ultracentrifuge at 29,000 x g for 40 min at 4 °C. Store the pellet at -80 °C until use.SCAM analysis using MEF microsomesSuspend microsomes expressing single cys-mutant in 200 μl of 1x DPBS with a 27 G needle to make 1 mg/ml protein solution.For the normal labeling assay, skip Step C2 and go on to Step C3. For the competition assay using MTSES, MTSET, or MTS-TEAE, add competitors at a final concentration of 2 mM to each well. Incubate the cells on ice for 30 min under light-shielded conditions.",
    "Dilute 50 mM MTSEA-biotin to the microsome solution at a final concentration of 1 mM. Incubate the microsomes on ice for 5 min under light-shielded conditions.Ultracentrifuge the sample at 12,900 x g for 5 min at 4 °C. Discard the supernatant and add 200 μl of 1x DPBS to the pellet and ultracentrifuge under the same conditions.Add 500 μl of 1% SDS/PBS to the pellet. Resuspend the pellet by gentle pipetting and solubilize by rotation at room temperature for 30 min.After the rotation, precipitate the biotinylated proteins using SA beads in the same manner to that of SCAM using intact cells (see Procedure A, Steps 9-11). Analyze the eluted proteins by immunoblotting.Crosslinking experiments using MTS crosslinkersSuspend microsomes expressing double cys-mutant in 1x DPBS and further suspend with a 27 G needle. The amount of 1x DBPS can be adjusted according to the expression level of the Cys mutant protein.Add 8 mM MTS crosslinker dissolved in DMSO into the microsome solution at a final concentration of 0.2 mM. Incubate the sample in an aluminum block bath at 37 °C for 30 min.Add 5 M NEM dissolved in DMSO to the sample at a final concentration of 10 mM to modify cysteine residues that did not react with the crosslinker.Add sample buffer without 2-mercaptoethanol, gently mix the sample using a vortex, and analyze by immunoblotting.Cross-linking experiments using copper-phenanthrolineMicrosomes are prepared as Step D1.Add 120 mM CuSO4 and 500 mM phenanthroline dissolved in DMSO to the microsome solution at final concentrations of 3 mM and 15 mM, respectively. Incubate the samples at room temperature for 2 h.Samples are analyzed as in Steps D3 and D4."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}