{
  "id": 11026,
  "origin_website": "Jove",
  "title": "Remote Magnetic Actuation of Micrometric Probes for in situ 3D Mapping of Bacterial Biofilm Physical Properties",
  "procedures": [
    "1. Bacteria Culture and Suspension Preparation\nPick a freshly grown colony from a Lysogeny Broth (LB) agar plate, inoculate it in 5 ml liquid LB medium containing 100 µg/ml ampicillin and 7.5 µg/ml tetracycline and incubate it for 5 to 6 hr at 37 °C on a shaking platform.\nThen, add 100 µl of the bacterial culture in 5 ml minimum medium (M63B1) supplemented with 0.4% glucose and the same antibiotic concentrations. Incubate this freshly diluted culture overnight at 37 °C on a shaking platform.\nAfter 16 hr of incubation, add 100 μl the overnight culture to 5 ml M63B1, 0.4% glucose. Keep the tube at 37 °C to the shaking platform until a 0.5 OD is reached. The suspension is then ready for injection into the experiment channel for biofilm formation.\n2. Magnetic Particle Preparation\nTake 10 μl magnetic particles — 2.8 µm in diameter — from the stock and wash them 3x in 190 μl minimum medium with the aid of a magnetic sample rack.\nAdjust the particle concentration to 5 x 106 beads/ml. Typically 50 μl of the washed bead solution is mixed with a further 950 µl of M63B1 with 0.4% glucose.\n3. Channel Preparation and Biofilm Growth\nChannel Mounting\n\t\nCut two square (800 µm side length) borosilicate glass capillaries 10 cm long to obtain two 8 cm long pieces.\nGlue the two capillary pieces on two glass slides — cut in half first — 2 cm apart with 1 cm overhang on either end as in Figure 1 using a fast-acting cyanoacrylate glue (so called super-glue).\nAutoclave the entire setup and the necessary tubing required for further channel connection.",
    "Gather all the sterile materials under a laminar flow hood: i) the mounted channel and trap 1, ii) the tubing and connectors, iii) the two bubble traps — the bubble filter commonly used to secure children's drip-feeding (trap 1) and the home-made bubble trap as a 4 cm long tube of larger diameter (trap 2), iv) clamps, v) 30 ml syringes filled with M63B1, 0.4% glucose, and vi) the waste bottle.\nConnect the whole setup with Luer Lock connecters or junctions in the following order: 50 ml M63B1 syringe controlled by the syringe pump, pediatric bubble filter, homemade bubble trap, capillary (Figure 1, panel B), and the tube to the waste bottle. Then fill the setup with sterile M63B1, 0.4% glucose, turning on the syringe pump at a rate of about 10 ml/hr, higher than the experimental rates. Carefully track and eliminate all the bubbles in the circuit.\nFlow the medium through the system for 10-15 min; concurrently mix 1 ml of the bacteria suspension at OD 0.5 from Section 1.3 with 1 ml of the washed bead solution prepared in Section 2.2.\nAttach (but don't close) clamps to the tubing at two positions: before and after the capillaries. Switch the flow off.\nIntroduce the bacterial-bead mixture into the capillary after the home made bubble trap using a 1 ml syringe, taking care to hold up the tube ends to prevent air entry. Re-attach the tubing and then close the clamps.\nRepeat the same procedure for the second capillary and check all the tubes for bubbles.",
    "Transfer the apparatus to the microscope and allow it to stand for 15-20 min to enable the bacteria to settle and attach to the surface of the capillary. Install the capillary onto the microscope stage with the waste container at a slightly higher level. Place the syringe pump on the counter top beside the microscope. Elevate the bubble trap before the capillary slightly higher than the capillary plane to capture bubbles.\nBiofilm Growth\n\t\nAdjust the flow rate on the syringe pump and start the flow, the biofilm will now develop on the capillary surface during the required period — usually 24 or 48 hr in these experiments.\nFocus on the capillary bottom plane and start the time-lapse recording of the sample images — usually an acquisition frequency of 2 images/min will adequately report the biofilm growth. This video monitors biofilm growth post-control (see extracts in Videos 1, 2 and 3).\n4. Magnetic Tweezers Installation\nScrew the magnetic tweezers on manually controlled X-Y-Z micromanipulators and screw the micromanipulators on the microscope stage to adjust the position of the tweezers relatively to the capillary. Place the tweezers as in Figure 2 to ensure the appropriate magnetic field gradient is generated in the observation zone.\nConnect the tweezers to the function generator via the power amplifier to generate a 40 sec period of time made of 24 sec zero signal and 16 sec of 4 A direct current with a trigger sent to the bright field light shutter after 20 sec for signal synchronization providing a sequence of events as in Figure 3.\n\tNote: These two operations can be achieved at any time between capillary installation and measurement beginning. See experiment overview sketch in Figure 4.\n5. Creep Curve Acquisition",
    "Use the xy movement control of the microscope stage to bring the edge of the left-hand magnetic pole and the left-hand edge of the capillary in the same observation field. Take the origin of the analysis referential at the intersection of x- and y-axes defined by the edge of the capillary and the edge of the pole piece, respectively (see Figure 2).\nAdjust the vertical position of the capillary using fine focus control knob of the microscope position. Typically the first examined plane is located between 4 to 7 µm above the capillary bottom. Video 1 corresponds to the xy field that has its top left-hand corner at the origin of the spatial referential.\nTrigger the 40 sec sequence of events described in section 4.2 and Figure 3 by switching on the current generator and at the same time, manually trigger the image acquisition sequence of Video 1.\nMove the capillary to the neighbor right field by a 250 µm translation of the microscope stage to the left and operate as in section 5.3 to generate Video 2 of slice 2 and so on to obtain the required videos. Typically 3 to 4 fields of 250 x 250 µm2 are collected along the x-axis before changing the plane and repeating same operations for the new plane.\n6. Force Calibration\nPrepare a glycerol solution by mixing 39.8 g of glycerol with 190 µl of bi-distilled water and 10 μl of magnetic particles at a 2 x 109 particles/ml and fill up an experimental channel with this mixture and place it on the microscope stage as described for the biofilm sample.",
    "After installing the magnetic tweezers as indicated in section 4, apply the magnetic force as indicated in section 5.4 and make time-lapse images to extract each single particle velocity (v) and its position in the capillary to derive the calibration file. This file should contain the applied force as a function of its position in the zone of analysis of the capillary according to stokes law, F = 6πRηv (R: radius of the particle).\n7. Analysis\nUse a \"particle tracker\" software to obtain text files with the particle positions in each frame for all the stacks of images acquired as indicated in section 5. Using the image stack acquisition frequency, calculate the particle displacement as a function of time (e.g. Figure 5 and Video 4).\nUsing the force calibration file, convert the displacement curves to compliance curves (total compliance of the material — J(t)— as a function of time) according to the compliance formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/50857/50857eq1.jpg\n\twhich gives the relation between material strain and applied stress for a probe particle of radius R embedded in an incompressible, homogeneous viscoelastic medium as previously established by Schnurr and co-workers19.\nAdjust the creep compliance curves to the general Burgers model for viscoelastic materials and derive the viscoelastic parameters, J0, J1, η0, η1 for each particle (Figure 6) according to the Burgers' formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/50857/50857eq2.jpg\n\tNote: This phenomenological analysis has been previously employed for a wide range of materials including biological materials such as biofilms to interpret macroscopic rheology data20-22.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}