{
  "id": 10121,
  "origin_website": "Jove",
  "title": "Time-Resolved In Vivo Measurement of Neuropeptide Dynamics by Capacitive Immunoprobe in Porcine Heart",
  "procedures": [
    "All animal experiments were approved by the University of California, Los Angeles Animal Research Committee and performed following the guidelines set forth by the National Institutes of Health Guide for the Care and Use of Laboratory Animals (8th edition, 2011). Adult male Yorkshire pigs of approximately 75 kg were used for in vivo studies10.\n1. Capacitive immunoprobe fabrication and functionalization\nCut a 25 cm length of perfluoroalkoxy (PFA)-coated platinum wire (see Table of Materials) and strip approximately 5 mm of PFA coating from one end using a scalpel, being careful not to cut into the platinum wire.\nInsert the stripped end of the platinum wire into a gold-plated 1 mm male connector pin and crimp the connector pin teeth around the stripped end of the platinum wire using needle-nose pliers (see Table of Materials).\nSolder the platinum wire to the gold-plated connector pin. Be careful not to use an excessive amount of solder.\nPrepare dopamine solution by dissolving 50 mg of dopamine HCl in 50 mL of 10 mM phosphate-buffered saline (PBS, pH 6.0) by stirring.\nOnce the dopamine is completely dissolved, place the tip of the platinum wire in the vessel containing the freshly made dopamine-supplemented PBS. Plug a gold connector pin into a channel of the headstage (see Table of Materials).\nConnect the AgCl disc electrode (ground electrode, see Table of Materials) to the ground channel in the headstage. Place the AgCl disc in the vessel containing dopamine-supplemented PBS and platinum wire; be careful only to submerge the disc electrode and not any length of the wire or solder. Connect a wire shunt into the reference channels of the headstage prior to proceeding.",
    "Open the interactive data acquisition software (see Table of Materials). Prepare a sawtooth electrodeposition command potential protocol with the following parameters: start potential = −0.6 V; end potential = +0.65 V; scan rate = 0.04 V∙s-1; duration of deposition = 420 s. Begin the polydopamine deposition protocol, ensuring that all the wires are connected properly.\nAfter completing the polydopamine deposition, remove the AgCl ground pellet and the tip of the platinum wire from the vessel, being careful not to disturb the tip of the platinum wire electrode. Place the tip of the wire into a microtube containing PBS (pH 7.4) for 2-5 min as the antibody solution is prepared; ensure the wire tip does not contact the sides or bottom of the microtube.\n\tNOTE: Antibody solution can be made during polydopamine deposition; however, the transfer of the platinum wire from the dopamine-containing vessel to the microtube of PBS following polydopamine deposition should not be skipped.\nPrepare the antibody solution. Combine the antibody of interest with PBS (pH 7.4) in a 1:20 ratio in a vessel of an appropriate size (e.g., a microtube).\n\tNOTE: The anti-NPY monoclonal antibody (see Table of Materials) used here was aliquoted at 1 mg/mL; an example antibody preparation here would be 4 µL of antibody to 76 µL of PBS.\nSoak the polydopamine-deposited tip of the platinum electrode in antibody solution for a minimum of 2 h at room temperature, again ensuring the platinum wire tip is suspended in solution and not resting on the interior surface of the microtube.\n\tNOTE: Recent implementation of this technique has favored using the platinum wire electrode immediately following this step instead of wet or dry storage for later use.",
    "After soaking in the antibody solution, briefly rinse the newly-functionalized capacitive immunoprobe (CI probe) tip in PBS (pH 7.4). The probe is now ready for use.\n2. Experimental setup for in vitro detection and measurement of peptide\nPlace the functional tip of the CI probe into the flow chamber, taking care not to disturb the tip of the electrode in any way, as doing so may damage the sensory tip of the probe.\n\tNOTE: The flow chamber was created by pouring silicone elastomer (see Table of Materials) into a 35 mm culture dish with an elongated ovoid space-filler in the center of the dish. After hardening, the ovoid shape is removed from the elastomer. The chamber is then superfused with Tris-buffered saline (TBS) and allowed a flow rate of 3 mL/min. Ensure the inflow and outflow maintain the fluid level in the chamber such that no tidal action of the superfusate is observed. The flow must remain in place for as long as the CI probe is in use.\nPrior to the first experimental test, perform a TBS standard run to condition the CI probe. Set up the following command voltage protocol: positive step potential = +100 mV; negative step potential = −5 mV; step duration = 20 ms; duration of acquisition = 600 s.\n\tNOTE: It is important to allow for the equilibration of the probe during the initial phase of cycling command potential prior to data acquisition.\nCreate a solution of the peptide of interest using the same TBS to maintain the superfusate's composition. Set up a manifold system where the superfusate can be switched between TBS and peptide-supplemented TBS without introducing bubbles into the tubing system or flow chamber.\n\tNOTE: Synthetic porcine NPY peptide (see Table of Materials) was used in the present study.",
    "Set up the peptide-sensing data acquisition protocol using TBS standard parameters (see step 2.2.).\n\t​NOTE: In this implementation, the duration of each experimental test was 360 s (120 s TBS, 120 s peptide-supplemented TBS, 120 s TBS).\n3. Adaptation of the CI probe for in vivo use\nPrior to polydopamine deposition (step 1.7.), thread the exposed tip of the platinum wire electrode through a 22 G hypodermic needle, leaving approximately 2 mm beyond the tip of the needle. Using forceps, gently bend back the tip of the platinum wire electrode, creating a \"barb\" that hangs from the end of the hypodermic needle.\n\t\nGently withdraw the needle from the barbed tip, leaving enough wire to place in the vessel without the needle contacting the fluid. Proceed with steps 1.4.-1.11.\n\t\tNOTE: Depending on the in vivo setup, it may be necessary to cut a length of platinum wire longer than 25 cm.\nBefore connecting the CI probe to the headstage, ensure the entire electrical setup is properly grounded. Failure to do so may introduce unwanted electrical interference during the experimental recordings.\nAnesthetize the animals following a previously published report10.\nPerform surgery to expose the region of interest.\n\tNOTE: A median sternotomy was performed in the present study to expose the heart. Please see Kluge et al.10 for details on animal surgery.\nGently remove the functionalized tip from the PBS rinse (step 1.11.), forward the hydodermic needle to the barbed C.I. probe and gently implant it in the region of interest prior to plugging the gold connector pin into the headstage. Once implanted, withdraw the hypodermic needle, leaving the electrode in place.\n\tNOTE: For the present study, the probe was placed in the mid-lateral wall of the left ventricular myocardium10.",
    "After ensuring proper electrical setup, proceed with standard and experimental testing protocols (step 2.2. and step 2.4.).\nUpon completion of the experiments, euthanize the animal following institutionally approved techniques.\n\tNOTE: In the present study, the animals are euthanized under deep anesthesia via induction of ventricular fibrillation10.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}