{
  "id": 2734,
  "origin_website": "Cell",
  "title": "Protocol to colonize gnotobiotic mice in early life and assess the impact on early life immune programming",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPart 1: Prepare FMT\nTiming: 2 h\nHere, steps needed to prepare a microbiome transplant material (FMT) are detailed.\nCollect fecal samples from mice with microbiota of interest, at timepoint of interest.\nPlace each mouse individually onto a sterilized cage base where, the mouse will spontaneously defecate.\nPick up the fecal sample using a sterile toothpick/tip and place into a pre-labeled 2 mL sterile microcentrifuge tube.\nPlace collected sample directly onto dry ice.\nReplace mouse into cage.\nSterilize the cage base and gloved hands with an appropriate reagent (i.e., 70% ethanol/F10SC) to sterilize.\nNote: A light scruff will encourage any mouse not spontaneously defecating to do so.\nNote: Two or more fecal samples should be collected for each individual mouse at each timepoint of interest.\nCritical: Fecal samples must be placed on dry ice immediately to preserve the integrity of the sample.\nPause point: Fecal samples may be stored at −80°C until required.\nPrepare FMT material.\nIdentify fecal samples of interest to use in the FMT preparation.\nWeigh a sterile microcentrifuge tube.\nPlace the fecal samples inside the pre-weighed tube using a disposable sterile toothpick or tip.\nRe-weigh the tube, noting the weight of the fecal sample.\nNote: 100 μg of fecal material is enough to gavage a single mouse twice. Use an appropriate amount of fecal material for the FMT preparation based on number of animals and number of repeat gavages.\nTransfer fecal pellets, autoclaved Hungate tubes and rubber seals, disposal transfer pipettes, stomacher bags, screw cap microcentrifuge tubes to the anaerobic chamber via port.\nSterilize gloved hands inside the chamber.\nPlace stomacher bag onto provided stomacher stand (purchased with stomacher).",
    "Hold bag open using forceps (or similar) and drop fecal material in between the stomacher bag lining, to the bottom of the stomacher bag.\nAdd appropriate volume of 1× PBS and 30% glycerol based on weight of fecal sample as listed in Table 1[href=https://www.wicell.org#tbl1] to the bottom of the stomacher bag using disposal Pasteur pipettes.\ntable:files/protocols_protocol_2248_15.csv\nTurn stomacher to the highest setting for 120 s.\nRemove stomacher bag, and manually ensure that all material has been homogenized or repeat process until material is fully homogenized.\nUse a disposal Pasteur pipette to remove homogenized material from the outside of the mesh lining of the stomacher bag and dispense into Hungate tubes.\nSeal the Hungate tube without touching the rubber seal.\nUnwrap the rubber seal (only touching aluminum foil).\nPlace on top of Hungate tube and use screw lid to secure tightly into position.\nNote: A small portion of the FMT material can be placed in a screw top microcentrifuge tube for DNA extraction and subsequent 16S rRNA gene sequencing.\nCritical: Everything needs to be sterile for the preparation of an uncontaminated FMT. Place clean gloves over the gloved hands on the inside of the anaerobic chamber before use. Use single-use disposal items only. Aliquot all reagents inside a biosafety cabinet to ensure sterility and place solutions for removal of oxygen into sterile containers with filter lids when equilibrating.\nPause point: FMT material can be stored at −80°C until required. Studies have shown that samples stored in this way are stable to at least 6 months.5[href=https://www.wicell.org#bib5]\nPart 2: Propagation of colonization material\nTiming: 3–5 days (for step 3)\nTiming: 1 d (for step 4)",
    "Here, enough material for a large germ-free colonization study is prepared. A microbiome transplant material (FMT) prepared from limited fecal samples (Part 1, Prepare FMT #1), is used to colonize a small number of germ-free mice to generate a larger amount of FMT material.\nOrder germ-free mice from your gnotobiotic facility.\nOrder 2 or more germ-free mice from your gnotobiotic facility for each microbiota that is required.\nHouse germ-free mice for different microbiota in separate ISO-P cages.\nCritical: Germ-free mice should be handled using specially designed germ-free protocols.\nNote: It is possible to house mice in small isolators for this propagation, however, a single isolator is required for each microbiota of interest. Using ISO-P cage can be a more efficient way to conduct these types of studies.\nNote: It is possible to colonize additional mice in the initial colonization if more gavage material is needed for subsequent studies.\nPrepare biosafety cabinet for procedure.\nPrepare Clidox-S® (before you begin[href=https://www.wicell.org#before-you-begin] #2).\nImmerse all items needed for unpacking and gavaging mice.\nImmerse notching device (if required), mouse transport cages, ISO-P cages for (re-housing mice), autoclaved materials (before you begin[href=https://www.wicell.org#before-you-begin] #4–6); microcentrifuge tubes (for fecal sample collection), enrichment, bedding, nesting materials, single layer autoclavable food, holding box, Teri-wipe, gavage material, needle (19–25 gauge), 1 mL syringe, disposable gavage tubing in Clidox-S®.\nPlace into BSC using sterilized gloves.\nNote: Moisture sensitive items are double bagged, where the outer is opened and the inner bag containing the moisture sensitive item is dropped sterilely into the BSC.\nWait 10 min before commencing work.\nNote: Clidox-S® requires a 10 min contact time to sterilize items.\nDress for commencing germ-free work (before you begin[href=https://www.wicell.org#before-you-begin] #2–6).\nOptional: Sterile gloved hands maybe be dipped into Clidox-S® (10 min contact time) as an additional precaution before commencing unpacking and gavage.",
    "Unpack mice into ISO-P cages.\nSet up ISO-P cages with appropriate amounts of bedding and enrichment.\nOpen transport container and remove germ-free mice and place into holding container with a piece of sterile Teri® wipe for enrichment.\nPrepare gavage material.\nExtract colonization material from Hungate tube using needle and 1 mL syringe.\nRemove needle from syringe and place gavage tube in place.\nPerform gavage.\nPlace mouse on wire rack of cage and scruff.\nInsert gavage needle into mouse’s mouth and perform oral gavage procedure as per animal ethics approved SOP.\nRepeat for entire group of mice.\nOnce complete, check each mouse for recovery and place inside the ISO-P cage.\nFinish packing ISO-P cage.\nFill water bottles with autoclaved mouse drinking water and place in position on wire rack.\nDispense food pellets into position on wire rack.\nClose lid.\nPlace ISO-P cage on mouse ISO-P mouse rack.\nOptional: Mice may be ear notched at this time, if appropriate. Fecal samples or swabs may be collected from transport boxes (to ensure the mice are germ-free upon unpacking).\nNote: A second or third colonization may be performed 2–7 days apart if inoculation material is diverse in nature as additional time may be needed to establish the less abundant bacterial species.\nAssessment of germ-free status of mice. Confirm germ-free status of germ-free mice prior to inoculation with FMT.\nCollect fecal pellet from germ-free mouse (Part 1, prepare FMT #1) using sterile toothpick or Teri® wipe into sterile pre-labeled microcentrifuge tube.\nPause point: Fecal pellet can be stored at −80°C until required.\nPrepare and culture fecal slurry to confirm the germ-free status of mice.\nAdd 500 μL of sterile anaerobic 1× PBS to fecal pellet using a disposal Pasteur Pipette.\nVortex for 1–2 min.",
    "Prepare 1 in 2 serial dilutions in 1× PBS in a 96 well plate.\nPlate 1 drop (20 μL) from each dilution onto an agar plate.\nInclude 1× PBS reagent control when plating out.\nIncubate for 18 h in anaerobic conditions at 37°C.\nNote: Samples are considered germ-free if no colonies are formed on plates incubated for 48 h or more.\nAlternatives: Extract collected fecal material collected using the DNA extraction protocol outlined in another STAR Protocol from our laboratory entitled “Protocol to assess the impact of early life antibiotic exposure on murine longevity[href=https://www.sciencedirect.com/science/article/pii/S2666166722001009]”. Perform 16S rRNA gene qRT- PCR to confirm germ-free status as directed in this protocol.\nPart 2b: Glycerol preparation II\nTiming: 2 h\nColonized mice are humanely culled at designated timepoint (5–7 days post inoculation) and cecal contents are prepared with glycerol to make fecal microbiome transplant material.\nPrepare fecal microbiome transplant (FMT) from colonized germ-free mice.\nHumanely cull colonized mice as per animal ethics approved SOP.\nCollect whole intestine including ceca in 15 mL tube containing 10 mL 30% anaerobic glycerol.\nTransfer tube containing intestines, pre-weighed 50 mL tube, sterile petri dishes, scalpel, autoclaved Hungate tubes and lids, disposal transfer pipettes, stomacher bags, and screw cap microcentrifuge tubes to the anaerobic chamber.\nSterilize gloved hands inside the anaerobic chamber.\nPrepare ceca for collection of cecal contents.\nEmpty tube containing mouse intestines into a petri dish.\nUsing scalpel cut off rest of intestine and place ceca into fresh petri dish.\nDispose of glycerol solution and rest of intestines.\nUsing scalpel, cut down length of ceca and scrape cecal contents away from ceca membrane and transfer into pre-weighed 50 mL tube.\nRepeat with remaining ceca.\nRe-weigh the tube now containing all ceca and note weight of the ceca contents.\nPlace ceca contents into stomacher bag.",
    "Add glycerol and 1× PBS based on ceca weight and continue with protocol as outlined Prepare FMT #1.\nCollect 0.5 mL of homogenized material in screw cap microcentrifuge tube for 16S rRNA gene sequencing.\nNote: Aliquot colonization material in appropriate volumes for initial and subsequent gavages. i.e., 50 μL of colonization material is needed to colonize mice less than 14 days old, whilst 100 μL is needed for mice aged ∼21 days or 200 μL for mice aged over 4 weeks of older in line with recommended maximum volumes of 10 mL/kg body weight. Noting that recommended volumes may differ substantially depending on body weight in different mouse strains of the same age. Furthermore, depending on the complexity of the gavage material, up to 2–3 gavages/mouse may be required.\nPause point: Homogenized fecal/cecal material for FMT can be stored at −80°C until required.\nOptional: Assessment of the composition of the material for FMT via 16S rRNA gene sequencing may be carried out prior to commencing experiments.\nExtract cecal contents collected in screw cap tube during glycerol preparation using the DNA extraction protocol outlined in STAR Protocols entitled “Protocol to assess the impact of early life antibiotic exposure on murine longevity #10[href=https://www.sciencedirect.com/science/article/pii/S2666166722001009]”.\nPerform 16S rRNA gene sequencing as directed in the same protocol, “ #12[href=https://www.sciencedirect.com/science/article/pii/S2666166722001009]”.\nPart 2: Colonize infant germ-free mice with prepared FMT material\nTiming: ∼6 weeks\nNow that the material for colonization has been propagated and a sufficient amount of FMT material has been prepared, we can perform larger scale experiments using the FMT material.\nOrder pregnant dams from your germ-free facility.\nNote: Request 2–4 GF dams per microbiota community type of interest depending on your experimental needs and to account for loss of pups.",
    "Prepare BSC to unpack pregnant dams as described (part 2: propagation of colonization material[href=https://www.wicell.org#sec3.2] #3).\nSet up ISO-P cages with appropriate amounts of bedding and enrichment.\nOpen transport container and remove germ-free mice and place into prepared ISO-P cage.\nFinish packing ISO-P cage.\nFill water bottles with autoclaved drinking water.\nPlace in position on wire rack.\nDispense autoclaved food pellets into position on wire rack.\nClose lid.\nPlace ISO-P cage on ISO-P rack.\nCollect fecal samples from dams to confirm germ-free status of mice as described (Part 1, Prepare FMT #1).\nNote: Pregnant germ-free dams, aged 8–24 weeks, may be housed singularly or two pregnant dams to a single cage. If co-housing, try to co-house dams that plugged on the same day. Co-housing pregnant dams may reduce stress and may help prevent loss of pups.\nNote: If pregnant germ-free dams are first time parents or stressed in any way, there may be excessive loss of pups. On occasion we have experienced loss of pups from all but one or two litters following multiple pregnancies.\nMonitor for birth of pups.\nNote date of birth and number of pups born.\nNote: C57BL6/J pups are born at approximately day 19.5 of pregnancy. The gestation period for other strains may differ slightly.\nColonize germ-free mice.\nPrepare biosafety cabinet for procedure (before you begin[href=https://www.wicell.org#before-you-begin] #2–6).\nImmerse all items needed for gavaging mice in Clidox-S®; ISO-P cages, holding box, sterile Teri® wipe, gavage material, needle, 1 mL syringe, disposable gavage tubing and place into BSC using sterilized gloves.\nPrepare gavage material.\nCollect 50 μL of colonization material for each pup to be colonized using needle (19–24 gauge) and 1 mL syringe (if colonizing day 14 pups).\nRemove needle and attach gavage tube to syringe.\nPerform oral gavage.\nPlace mouse on wire rack of cage.",
    "Scruff and insert gavage needle into mouse’s mouth.\nPerform oral gavage procedure as per AEC approved SOP.\nOnce complete, place mouse into designated ISO-P cage.\nNote: Consider the appropriate age of mice for your experimental model. Pups can be successfully oral gavaged from approximately day 4–7 after birth. Use 50 μL of gavage material for mice aged 7–21 days, use 100 μL of gavage material for mice aged 21–28 days and up to 200 μL of gavage material for mice aged > 4 weeks as per AEC approved SOPs.\nNote: To colonize mice from day 0 of life, perform oral gavage on dams. The inoculated microbiota will be effectively transferred to the pups. Use isoflurane to anesthetize dams whilst performing the oral gavage procedure. This will result in less stress for dams and should result in less loss of pups.\nOptional: Collect fecal sample from mice prior to gavage to confirm colonization status.\nPart 3: Assessment of immune responses alterations in early life colonized germ-free mice\nTiming: 10 min per mouse\nThis part of the protocol describes how to assess the impact of colonization of GF mice with specific microbiota community types of interest on the weaning reaction, however, you may wish to assess other parameters/phenotypes following colonization. In our published study,1[href=https://www.wicell.org#bib1] mice were humanely culled at day 21 of life following colonization on day 14 of life.\nHumanely kill mice as per AEC approved SOP and collect organs as outlined below.\nHumanely kill mice as per approved SOP.\nPerform cardiac puncture to collect blood and place blood into microvette EDTA blood collection tubes.\nSterilely collect spleen into 1.5 mL microcentrifuge tube containing 500 μL of 1× PBS and place on ice.\nRemove intestine.\nIsolate 20 mm section directly above ceca (ileum).\nClear any feces.",
    "Place in 1.5 mL microcentrifuge tube.\nSnap-freeze using dry ice or liquid nitrogen.\nIsolate small intestine as a single unit from stomach to ceca.\nPlace in petri dish containing Media A for lamina propria extraction.\nPart 3a: Blood stimulations\nTiming: 1–2 h, plus 18 h stimulation\nTo assess whether colonization with the transplanted microbiota induces differential immune responses in peripheral blood, blood is stimulated with Lipopolysaccharide (LPS) and the resultant cytokine responses (TNFα) are measured via ELISA.\nPerform red cell lysis on blood and set up stimulations as outlined below.\nAliquot 200 μL peripheral blood into 96 well tissue culture plate.\nSpin down at 350 × g for 5 min at 4°C.\nDiscard supernatant.\nIncubate pellet with 100 μL 1× BD Pharm Lyse™ buffer for 60 s.\nStop reaction with 200 μL 1× Wash buffer.\nSpin down at 350 × g for 5 min at 4°C and discard supernatant.\nResuspend pellet in 300 μL 1× Wash buffer.\nSpin down at 350 × g for 5 min at 4°C and discard supernatant.\nResuspend in 200 μL Complete media.\nPlate out 100 μL for each condition (stimulated/unstimulated).\nStimulate with 100 μL of 10 ng/mL LPS for 18 h in an incubator at 37°C, 5% CO2.\nNote: Store reconstituted 1× BD Pharm Lyse and 1× Wash buffer solution at 4°C for up to 4 weeks.\nPause point: Collect supernatant and store at −80°C.\nPart 3b: Splenocyte stimulations\nTiming: 2–4 h, plus 18 h stimulation\nTo assess whether colonization with the transplanted microbiome induces systemic differential immune responses, splenocytes are stimulated with Lipopolysaccharide (LPS) and the resultant cytokine responses (TNFα) are measured via ELISA.\nPrepare single cell suspension from isolated spleen and stimulate with LPS as outlined below.",
    "Place single spleen into a well of a 6-well tissue culture plate with 3 mL of 1× Wash buffer.\nPerform manual homogenization with rough side of 2 sterile frosted glass slides (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2248-Fig2.jpg\nFigure 2. Schematic of manual homogenization\nCreated in Biorender.com[href=http://Biorender.com].\nFilter homogenized suspension through 80 μM filter into sterile 10 mL tube to achieve single cell suspension.\nSpin down at 350 × g for 5 min at 4°C and discard supernatant.\nPerform red cell lysis with 1 mL of 1× BD Pharm Lyse™ buffer for 90 s.\nStop with 4 mL of Wash buffer.\nSpin down at 350 × g for 5 min at 4°C and discard supernatant.\nResuspend cells in 1 mL 1× Wash buffer.\nBring volume to 5 mL with 1× Wash buffer.\nSpin down at 350 × g for 5 min at 4°C and remove supernatant.\nRepeat wash.\nResuspend cells in 5 mL of 1× Wash buffer.\nPerform cell count using hemocytometer.\nResuspend cells at 2 × 107 cells/mL in complete media.\nStimulate cells with 100 μL 10 ng/mL LPS for 18 h in an incubator at 37°C, 5% CO2.\nInclude unstimulated control (100 μL cells at 2 × 107 cells/mL and add 100 μL of complete media).\nPause point: Collect supernatant and store at −80°C.\nPart 3c: ELISA\nTiming: 4 h, plus 18 h incubations\nSupernatant was collected from whole blood and splenocytes following stimulation with LPS. TNFα levels were assessed by ELISA using the TNF alpha Mouse Uncoated ELISA kit as per manufacturer’s instructions (https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0017423_88-7324_MoTNFalpha-ELISA_PI.pdf[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0017423_88-7324_MoTNFalpha-ELISA_PI.pdf]).\nPart 3d: Lamina propria extraction, stimulations and analysis\nTiming: 2 d (for step 12)\nTiming: ∼4 h, 18 h fixation (for step 13)",
    "To assess whether colonization with the transplanted microbiome induces differential immune responses in lamina propria, extracted cells are stimulated with PMA/ionomycin and the resultant intracellular expression of TNFα and IFNγ are measured via intracellular cytokine staining.\nNote: Prepare buffers the day prior to the procedure (before you begin[href=https://www.wicell.org#before-you-begin]) and store at 4°C. Reconstituted medias can be stored at 4°C for up to 4 weeks. Percoll gradient solutions can be stored for 24 h at 4°C. Add the DTT, collagenase and DNase I on day of the procedure.\nNote: Warm up Media A, Media B and Percoll solutions to 20°C–25°C. Warm Media C to 37°C (via water bath) and keep Supplemented Media at 4°C.\nPerform Lamina propria extraction.\nPlace small intestine on bench protector or equivalent.\nRemove all mesenteric fat, fat and Peyer’s Patches from small intestine using scissors or scalpel.\nOpen longitudinally and remove fecal material.\nClean mucus and feces by gently scraping and flush with 1 mL of Media A.\nPlace cleaned intestines into a new tube with 10 mL Media B.\nCut intestines into ∼1cm pieces and place in a 12 well plate with 3 mL of Media A on ice.\nNote: If working with multiple mice, prepare all intestines until step 12e then proceed.\nIncubate intestinal sections in orbital shaker at 150 × g for 10 min at 37°C.\nNote: Incubate tubes horizontally in orbital shaker for better results.\nFilter solution through 100 μM filter and spin down at 600 × g at 10 min at 4°C and remove supernatant to collect epithelial layer.\nPlace filter containing tissue pieces onto a waste tube and wash with 5 mL of cold 1× PBS.\nNote: This step is used to wash away EDTA than can inhibit digestion of tissue.",
    "Transfer intestinal sections (located on top of 100 μM filter) into 1.5 mL microcentrifuge tube and add 1 mL Media C.\nCut intestines into 1 mm sections.\nNote: Cut intestines into 1 mm sections.\nTransfer intestines to a 15 mL tube.\nAdd 4 mL of Media C and incubate (horizontally) at 37°C in an orbital shaker at 150 × g for 20 min.\nFilter suspension through a 70 μM filter into a 50 mL tube.\nNote: The flow through will contain the lamina propria cells. Neutralize the flow through with 10 mL of media A.\nNote: Repeat digest (k - m) until all tissue pieces have been dissolved. It usually requires 2–3 repeats to dissolve all tissue. Flow through from each subsequent digestion can be added to the 50 mL tube with the previous digestion and neutralized. The plunger of a syringe can help to manually push through remaining tissue.\nSpin down at 600 × g at 10 min at 4°C and discard supernatant.\nAdd 1 mL of 44% gradient Percoll and resuspend cells.\nTransfer to a new 15 mL tube and add 7 mL of 44% Percoll to a total of 8 mL of 44% Percoll gradient in a 15 mL tube.\nUsing blunted needle/cannula slowly underlay with 5 mL 66% isotonic Percoll solution (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2248-Fig3.jpg\nFigure 3. Schematic of sterile Percoll gradient preparation\nCreated in Biorender.com[href=http://Biorender.com].\nSpin at 1,600 × g for 20 min at 4°C with no brake.\nCritical: Use of brake disrupts Percoll gradient interface.\nNote: A band forms at the 44–66% interface containing the viable cells. Red blood cells will pellet at the bottom of the tube and dead cells, debris and mucous form a layer at the top.",
    "Collect 2 mL of the opaque layer at the 44–66% interface and place into 50 mL tube.\nFill the 50 mL tube with 1× PBS (adding up to 48 mL of cold 1× PBS).\nSpin at 600 × g for 10 min at 4°C and remove supernatant.\nResuspend cells in 100 μL Complete media.\nStimulate and stain lamina propria and measure intracellular IFNγ and TNFα using flow cytometry. In this section isolated lamina propria are stimulated with PMA/ionomycin and stained to measure IFNγ and TNFα expressing CD4+ and CD8+ T cells using flow cytometry.\nStimulate 100 μL of isolated lamina propria cells with 100 μL of PMA/ionomycin stimulation solution for 4 h at 37°C.\ntable:files/protocols_protocol_2248_16.csv\nSpin down cells in 96 well round bottom plate at 350 × g for 5 min at 4°C and remove supernatant.\nResuspend cell pellet in 200 μL of FACS buffer.\nSpin down at 350 × g for 5 min at 4°C.\nPrepare surface stain (Table 2[href=https://www.wicell.org#tbl2]).\ntable:files/protocols_protocol_2248_17.csv\nStain cell pellets in 30 μL staining solution/well.\nIncubate in dark on ice for 30 min.\nNote: Dilution factors for each antibody listed have been deduced from titration assays in our lab. Antibodies should be titrated for use in each lab as catalogues or equipment availability may vary from lab to lab.\nAdd 200 μL of FACS buffer and spin down at 350 × g for 5 min at 4°C and remove supernatant.\nResuspend cells in 80 μL BD Fixation/Permeabilization buffer.\nIncubate cells in dark on ice for 30 min.\nSpin down at 350 × g for 5 min at 4°C and remove supernatant.\nResuspend in 150 μL of 1× BD Perm/Wash buffer.\nSpin down at 350 × g for 5 min at 4°C and remove supernatant.\nResuspend in 30 μL of intracellular stain.",
    "Incubate cells in dark on ice for 30 min.\nCritical: Prepare intracellular stain in 1× Perm/Wash buffer.\nAdd 100 μL of 1× BD Perm/Wash buffer and spin down at 350 × g for 5 min at 4°C and remove supernatant.\nResuspend in 200 μL FACS buffer and spin down at 350 × g for 5 min at 4°C and remove supernatant.\nResuspend cells in 120 μL FACS buffer.\nRun samples on flow cytometer.\nNote: We used the BD FACSymphony™ to acquire our data.\nPart 3e: Cytokine measurement in ileum\nTiming: 2–3 days (for step 14)\nTiming: 35 min (for step 15)\nTiming: 35 min (for step 16)\nTiming: 2 h (for step 17)\nTiming: 2 h (for step 18)\nTo assess whether colonization with the transplanted microbiota induces differential immune responses in ileum, RNA was extracted from ileum and gene expression of Tnfa and Ifng were measured via qRT-PCR.\nPrepare RNA from small intestine using TRIzol™ (Thermo Fisher Scientific) in accordance with manufacturer’s instructions (https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2Ftrizol_reagent.pdf[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2Ftrizol_reagent.pdf]).\nNote: For best results autoclave mortar and pestle and place at −80°C for 18 h before use.\nPlace 20 mm section of ileum in mortar and grind into powder using pestle on dry ice.\nScrape powder into 1.5 mL microcentrifuge tube.\nResuspend powder in 500 μL of TRIzol™.\nIncubate at 20°C–25°C for 5 min.\nNote: Vortex RNA powder and TRIzol™ until suspension is prepared.\nAdd 200 μL of chloroform and shake vigorously for 15 s.\nSpin at 12,000 × g for 15 min at 4°C to separate aqueous and organic layer.\nCollect upper aqueous layer (containing RNA) into fresh 1.5 mL microcentrifuge tube.\nNote: Hold microcentrifuge tube at 45° angle and collect upper layer. Be careful not to disturb interphase.",
    "Add 250 μL of isopropanol, and 0.5 μL of glycogen and invert/vortex briefly (1–2 s) to mix.\nIncubate at 20°C–25°C for 10 min.\nSpin at 15,000 × g for 15 min at 4°C and remove supernatant.\nAdd 500 μL of freshly prepared 75% ethanol and invert.\nSpin at 15,000 × g for 10 min at 4°C, remove supernatant and dry pellet.\nResuspend in 20 μL nuclease-free H2O.\nNote: To quickly dry RNA pellet, remove 480 μL of supernatant, spin again for 1 min at 15,000 × g and remove the residual solution with 20 μL tip.\nPause point: RNA may be stored at −80°C until next step.\nDNase I treat extracted RNA. Treat RNA samples with DNA-free™ kit (Ambion via Thermo Fisher Scientific) as per manufacturer’s instructions (https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2Fcms_055739.pdf[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2Fcms_055739.pdf]).\nIncubate 20 μL of RNA with 2 μL of DNase I buffer and 1 μL of DNase I (Table 3[href=https://www.wicell.org#tbl3]).\ntable:files/protocols_protocol_2248_18.csv\nIncubate at 37°C for 30 min.\nAdd 4 μL of DNase inactivation reagent and incubate for 2 min, mixing regularly.\nSpin down at 12,000 × g for 2 min and place treated RNA into fresh microcentrifuge tube.\nPause point: RNA may be stored at −80°C until next step.\nAssess RNA quality and quantity using TapeStation (Agilent). RNA samples are prepared as per manufacturer’s instructions.\nAssess 1 μL of RNA on the TapeStation to assess RNA quality (RNA integrity number, RIN) and quantity.\nNote: If RIN value is less than 6, the RNA quality may be insufficient to proceed with qRT-PCR.\nPause point: RNA may be stored at −80°C until next step.\nMake cDNA from the extracted RNA. Make cDNA from the extracted RNA using the Protoscript® II first strand cDNA synthesis kit (New England Biolabs) as per manufacturer’s instructions (https://www.nebiolabs.com.au/protocols/2016/04/26/first-strand-cdna-synthesis-standard-protocol-neb-m0368[href=https://www.nebiolabs.com.au/protocols/2016/04/26/first-strand-cdna-synthesis-standard-protocol-neb-m0368]).",
    "Mix 1 μg of RNA with buffer, Oligo dTs, dNTPs, as per manufacturer’s instructions (Table 4[href=https://www.wicell.org#tbl4]).\ntable:files/protocols_protocol_2248_19.csv\nDenature RNA on a heating block at 65°C for 5 min and incubate with Protoscript® II Reverse transcriptase, DTT buffer at 42°C for 60 min and 65°C for 20 min a per instructions (Table 5[href=https://www.wicell.org#tbl5]).\ntable:files/protocols_protocol_2248_20.csv\nPause point: cDNA may be stored at −20°C until next step.\nMeasure Tnfa and Ifng gene expression in lamina propria via qRT-PCR. Measure Tnfa and Ifng gene expression in lamina propria via qRT-PCR. Calculate Tnfa and Ifng relative expression to the house-keeping genes e.g., Gapdh, Hprt and Hsp90.\nNote: Calculate the amount of master mix components needed, multiplying volume by total number of reactions for each primer set (samples, controls and standards in duplicate and a few extra for pipetting errors, etc).\nNote: In a template-free room, prepare the master mix solution for each primer set separately consisting of SYBR green PCR master mix, forward and reverse primer in a sterile 1.5 mL microfuge tube and keep on ice (Tables 5[href=https://www.wicell.org#tbl5] and 6[href=https://www.wicell.org#tbl6]).\nCombine master mix solution for each primer set separately (Tables 5[href=https://www.wicell.org#tbl5] and 6[href=https://www.wicell.org#tbl6]).\ntable:files/protocols_protocol_2248_21.csv\nSeparately, prepare 1 in 10 dilutions of cDNA.\nAdd 3 μL diluted cDNA onto a PCR plate (96/384 depending on setup) first to the bottom of the well.\nAdd 7 μL primer specific master mix solution to each well.\nCritical: Use barrier tips to ensure no mixing of DNA.\nNote: Load DNA first to the bottom of each well. Add master mix second to the side of the well. Then you can visualize that each well has been correctly loaded.\nInclude a no template DNA control (NTC), where DNA is substituted for 3 μL nuclease-free H2O for each primer set.",
    "Note: Combine 2 μL of each diluted sample in 1.5 mL microcentrifuge tube to create top standard for a standard curve. Create successive 1 in 4 serial dilutions. Repeat for 5 dilutions.\nBriefly spin the PCR plate at 200 × g for 10 s to remove any air bubbles.\nLoad plate using following settings (Table 7[href=https://www.wicell.org#tbl7]).\ntable:files/protocols_protocol_2248_22.csv\nCalculate the relative fold gene expression changes as described (Part 4: Calculate the relative fold gene expression of Tnfa and Ifng)."
  ],
  "subjectAreas": [
    "Model Organisms",
    "Molecular Biology",
    "Immunology",
    "Microbiology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}