{
  "id": 3806,
  "origin_website": "Cell",
  "title": "Differentiation and characterization of human iPSC-derived vascular endothelial cells under physiological shear stress",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\niPSC plating and culture\nTiming: ≥1 week (30 min/day)\nPlate iPSCs\nCoat one 6-well plate with hESC-qualified Matrigel diluted 1:100 in DMEM/F-12 at 37°C for 30 minutes (refer to before you begin steps 7–12 for full details).\nRemove a vial of iPSCs from liquid nitrogen and place in a water bath set to 37°C. Swirl the vial in the water to heat evenly until only a small ice chunk remains (∼1 minute).\nNote: We freeze our iPSCs at a density of 1 million cells in 1 mL of Cryo-SFM freezing medium and thaw this amount into 2 wells of a 6-well plate.\nIn a biosafety cabinet, use a 1000 μl pipette to transfer thawed cells to a 15 mL conical tube.\nUsing a serological pipette, slowly add 9 mL warm mTeSR Plus to the cells.\nCentrifuge the cells at 170 × g for 5 minutes.\nAspirate the supernatant and resuspend the cells in 4 mL warm mTeSR Plus with 10 μM ROCK inhibitor (Y-27632).\nNote: ROCK inhibitor has been shown to significantly increase hESC and iPSC survival after cryopreservation and is critical for sufficient iPSC survival at this stage (Watanabe et al., 2007[href=https://www.wicell.org#bib17]; Claassen, Desler and Rizzino, 2009[href=https://www.wicell.org#bib3]). Without ROCK inhibitor treatment on the first day after thawing, the survival of the plated iPSCs will significantly decrease.\nPlate the cells in 2 wells of the Matrigel-coated 6-well plate by aspirating the Matrigel solution in those 2 wells and adding 2 mL cell solution per well.\nShake the plate gently to evenly disperse cells and incubate in a humidified incubator at 37°C with 5% CO2 for 24 hours.\nThe next day, replace the media with 2 mL fresh mTeSR Plus without ROCK inhibitor per well.",
    "Feed the cells with 2 mL warm mTeSR Plus per well every day for 2–3 more days until iPSC colonies are large enough to passage.\nFor the first passage after thawing iPSCs, if the cells are not 60%–80% confluent within 4 days after thawing, passage the cells at a 1:1 ratio using EDTA.\nAspirate Matrigel from the required number of Matrigel-coated wells and add 2 mL mTeSR Plus to each well. For a 1:1 passage from 2 wells, 2 new Matrigel-coated wells are needed.\nWash cells once with 1 mL PBS without calcium or magnesium per well.\nNote: EDTA chelates calcium and magnesium to allow cell dissociation, so PBS without calcium or magnesium is used so that the EDTA can chelate any residual calcium and magnesium surrounding the cells.\nAdd 1 mL warm 0.5 mM EDTA to each well and leave at 20°C–25°C for 3 minutes.\nCarefully aspirate the EDTA from the cells. Do not aspirate the cells.\nAdd 1 mL warm mTeSR Plus to each well of dissociated cells. The calcium and magnesium in the media will neutralize any remaining EDTA.\nScrape cells using a cell scraper and gently triturate using a 1000 μL pipette 4–6 times.\nNote: Do not over triturate the cells or else the colonies will become too small, causing low cell survival. Colonies of ∼10 cells are ideal.\nCombine the dissociated cells from both original wells and split among the new wells that were filled with mTeSR Plus in step 4a.\nIncubate at in a humidified incubator at 37°C for 24 hours.",
    "Continue to feed the cells with 2 mL warm mTeSR Plus daily and passage at low ratios (1:1 or 1:2) every 3 days until cells recover from cryopreservation and achieve 60%–80% confluence within 3 days. The cells should recover and grow at normal rate in one or two passages.\nFor continued culture after recovery from thawing, repeat step 4 to passage cells at a 1:6 ratio in 6-well plates every 3 days. Note that to split 1 well of cells at a 1:6 ratio, 6 new wells should be filled with media in step 4a and 160 μL dissociated cell solution will be added to each of the new wells in step 4g.\nCritical: Poor survival immediately after thawing is expected, but iPSCs still must be passaged every 3–4 days to prevent spontaneous differentiation. If 60%–80% confluence is not reached after 3 days, passage iPSCs at a lower ratio (even 1:1) until they recover from cryopreservation. After one or two passages, they should reach 60%–80% confluence after 3 days and can be passaged 1:6 routinely. See troubleshooting 3[href=https://www.wicell.org#sec7.5] and 4[href=https://www.wicell.org#sec7.7].\nNote: iPSCs can be passaged dozens of times without losing pluripotency or proliferative activity. Karyotype should be checked every 20 passages to rule out karyotypic abnormalities which may occur. iPSC karyotyping can be done by a number of services, such as WiCell.\nNote: iPSCs should be passaged at least 2–3 times after thawing before starting a differentiation. Culture and passage iPSCs until a sufficient number of cells for differentiation is attained (3.5 million).\nviEC differentiation\nTiming: 7 days (15–30 min/day, 2 h on day 7)",
    "This protocol to differentiate vascular endothelial cells (viECs) from human iPSCs was adapted from Patsch et al., (2015)[href=https://www.wicell.org#bib13]. Other methods to produce viECs from iPSCs are reviewed by Williams and Wu (2019)[href=https://www.wicell.org#bib18]. Full characterization of viECs is reported in Atchison et al., (2020)[href=https://www.wicell.org#bib2]. Representative images of each step of differentiation are shown in Figure 3[href=https://www.wicell.org#fig3].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/528-Fig3.jpg\nFigure 3. Representative images of iPSC-derived endothelial cell differentiation stages\n(A) Typical morphology of undifferentiated iPSCs. Inset shows prominent iPSC nucleoli (yellow arrows).\n(B) Images on days 1–7 of differentiation (mesoderm through endothelial induction).\n(C) Typical morphology of differentiated viECs 3 days after sorting.\n(D) Example of spontaneously differentiated cells which have different morphology than undifferentiated iPSCs.\nDay 0: Plate iPSCs\nCoat one T-75 flask with hESC-qualified Matrigel diluted 1:100 in DMEM/F-12 at 37°C for 30 minutes.\nWash 60%–80% confluent iPSCs once with 1 mL PBS per well.\nAspirate PBS and add 1 mL Accutase to each well. Incubate at 37°C for 3 minutes.\nLightly tap the plate to lift the iPSCs. If they have not all detached, incubate the plate at 37°C for additional time in increments of 2 minutes until all cells have detached.\nNote: Total time in Accutase should not exceed 7 min. Accutase is a gentler alternative to trypsin and is used for iPSCs and iPSC-derived cells to decrease cell damage and increase cell viability after single-cell dissociation.\nDilute Accutase 1:1 using warm mTeSR Plus. Collect the cells from all wells into a 15 mL conical tube and count cells.\nNote: Typical iPSC yield from one 6-well plate is 8–10 million cells.\nCentrifuge 3.5 million cells for one T-75 differentiation (or 47,000 cells/cm2 if using a different size plate for differentiation) at 170 × g for 5 minutes.",
    "Critical: This seeding density should be optimized for different cell lines for best results. We recommend testing a range between 37,000 and 47,000 cells/cm2. The cells should look similar in density to the Day 1 image shown in Figure 3[href=https://www.wicell.org#fig3]B. Cell density that is too low will reduce differentiation efficiency while cell density that is too high will cause a large amount of cell death due to cells overcrowding in the flask.\nNote: The differentiation can be scaled up or down by using a different size flask and adjusting the media volumes accordingly while using the same seeding density (37,000–47,000 cells/cm2).\nAspirate the supernatant and resuspend the cells in 15 mL warm mTeSR Plus + 10 μM ROCK-Inhibitor.\nAspirate Matrigel and add cell suspension to the Matrigel-coated T-75 flask.\nDay 1–3: Lateral Mesoderm Induction\nPrepare mesoderm induction media: 50 mL warm N2B27 medium supplemented with 8 μM (50 μL) CHIR-99021 and 25 ng/mL (50 μL) hBMP4.\nAspirate mTeSR Plus and add mesoderm induction media to cells. Leave for 3 days in the incubator without media change.\nDay 4–6: Endothelial Cell Induction\nPrepare endothelial cell induction media: 40 mL warm complete StemPro-34 medium supplemented with 200 ng/mL (80 μL) VEGF165 and 2 μM (8 μL) forskolin.\nChange media to fresh 40 mL endothelial cell induction media every day on days 4, 5, and 6.\nCollect conditioned media from differentiating endothelial cells on days 5, 6, and 7 for later use.\nNote: Some cell death on days 4–6 is expected but excessive cell death indicates that the iPSC seeding density on day 0 was too high. See troubleshooting 5[href=https://www.wicell.org#sec7.9].\nCritical: Do not accidentally aspirate the old media while changing media on days 5–7 as it will be needed later to make conditioned media for culturing the viECs after sorting.",
    "Day 7: Endothelial Cell Sorting\nPrepare 50 mL chilled MACS buffer and keep on ice in the cell culture hood.\nPrepare 20 collagen-coated T-75 flasks by coating with 0.05 mg/mL Collagen I in 0.02 N Acetic Acid at 20°C–25°C for 1 hour, then rinsing with PBS (refer to before you begin[href=https://www.wicell.org#before-you-begin] steps 14–18 for full details).\nCollect day 7 conditioned media from cells and wash with 10 mL PBS.\nAdd 5 mL Accutase and incubate at 37°C for 5 minutes.\nAdd 5 mL cold StemPro-34 and transfer cells to a 50 mL conical tube.\nCount cells.\nCentrifuge at 170 × g for 5 minutes.\nAspirate supernatant and wash cells with 10 mL cold MACS buffer.\nCentrifuge at 170 × g for 5 minutes. Meanwhile, retrieve MACS beads and place in cell culture hood.\nResuspend cells in 8 μL cold MACS buffer per million cells.\nAdd 2 μl per million cells each of Fc Blocking Buffer, anti-CD31 MACS beads, and anti-CD144 MACS beads. Mix well by pipetting after adding each component.\nIncubate cells on ice for 15 minutes.\nWhile the cells are incubating, prepare complete conditioned media by combining conditioned media collected from days 5, 6, and 7 (120 mL total) and adding the equal volume (120 mL) of fresh complete StemPro-34 medium supplemented with 240 μL heparin (2 μg/ml) and 1.2 mL Pen/Strep. Filter through 0.22 μm vacuum filter.\nNote: As this media is difficult to filter, we recommend using Nalgene Rapid-Flow filters for this step (VWR 73520-984).\nWarm conditioned media to 37°C in a water bath.\nAfter the 15-minute incubation, wash labeled cells by add 1 mL cold MACS buffer per million cells (or a maximum of 30 mL MACS buffer if cell yield is greater than 30 million).\nCentrifuge at 170 × g for 5 minutes.",
    "Aspirate supernatant and resuspend cells in 1 mL cold MACS buffer.\nPrepare LS column and magnet on a MACS stand in the cell culture hood. Obtain three 50 mL conical tubes and one 15 mL conical tube for sorting and place in the hood.\nAdd 1 mL cold MACS buffer to LS column. Collect the flow-through in the first 50 mL conical tube and discard.\nCritical: Do not allow the column to dry! When flowing is complete, move immediately to step 10t.\nAdd the cell suspension to the LS column. Collect the flow-through in the second 50 mL conical tube.\nCollect the flow-through from the previous step and reapply to the top of the column. Collect the flow-through in the third 50 mL conical tube.\nAdd 500 μL MACS buffer to the LS column. Continue to collect the flow-through in the third 50 mL conical tube.\nRepeat step 10v two more times to wash out any remaining negative cells from the column.\nOptional: This is the negative fraction. It can be discarded or kept for further analysis if desired.\nRemove LS column from the magnet and place in the prepared 15 mL conical tube. Add 1 mL PBS and use the plunger that came with the column to push the cells out of the column into the conical tube. This is the positive fraction.\nAdd 4 mL PBS to the retrieved positive cells.\nCount cells and centrifuge at 170 × g for 5 minutes.\nNote: On average, ∼50% CD31/CD144 positive cells are recovered after sorting. Cell count after sorting ranges from 10 to 55 million cells from one T-75.",
    "Plate 26,000 cells/cm2 in collagen coated T-75 flasks (∼2 million cells per T-75) with 20 mL warm complete conditioned media described in step 10m. Replace with 10 mL media the next day, then every other day until conditioned media is depleted or until first passage.\nNote: We report the optimal seeding density after sorting for our iPSC lines; this should be optimized for each cell line. The iPSC lines for which we have optimized this differentiation protocol are listed in in the key resources table[href=https://www.wicell.org#key-resources-table] and were obtained from the Progeria Research Foundation.\nviEC culture and maintenance\nTiming: 15–30 min per day\nFeed viECs with 10 mL warm viEC media every other day.\nNote: viECs should be cultured in viEC media starting when any of the following conditions are met: (1) when conditioned media is depleted, OR (2) following the first passage, OR (3) the day before cryopreserving p0 viECs.\nPause Point: After reaching 90% confluence, viECs can be cryopreserved (1 million cells per vial in 1 mL CryoSFM freezing medium) and stored in liquid nitrogen. If cryopreserving cells at p0, culture in viEC media for 24 h before freezing cells even if not all of the conditioned media has been depleted and discard the extra conditioned media.\nPassage viECs when 90% confluent.\nviECs can be cultured in well plates, flasks, or SlideFlasks depending on the experiment. Coat the culture vessel with 0.05 mg/mL Collagen I diluted in 0.02 N Acetic Acid at 20°C–25°C for 1 hour, then wash once with PBS (refer to before you begin[href=https://www.wicell.org#before-you-begin] steps 14–18 for full details on collagen coating).\nNote: Volumes of reagents presented in this protocol are for a T-75.\nAdd 5 mL Accutase to viECs and incubate at 37°C for 2–3 minutes.\nLightly tap the plate to detach the cells.",
    "Dilute Accutase with 5 mL warm viEC media.\nCollect the cells in a conical tube and count cells.\nCentrifuge cells at 170 × g for 5 minutes.\nAspirate supernatant and resuspend cells in viEC media. Plate 15,000–25,000 viECs/cm2.\nNote: One T-75 will usually yield ∼2 million cells, which can be passaged 1:2 into two T-75 s.\nFeed 24 hours after passaging, then every other day until the next passage.\nPause Point: viECs can be cryopreserved at any passage.\nTo cryopreserve viECs, passage using Accutase and freeze 1 million cells per cryovial in 1 mL CryoSFM freezing medium.\nTo thaw cryopreserved viECs, thaw into warm viEC media then plate on collagen coated plates (1 million cells per T-75). Feed the day after thawing, then every other day.\nOptional: Supplementation with 10 μM TGFβ inhibitor SB431542 when feeding viECs significantly improves viEC proliferation (Figure 5[href=https://www.wicell.org#fig5]F). Without it, viECs become senescent by passage 3 (Figure 5[href=https://www.wicell.org#fig5]G). With 10 μM SB431542 supplementation, we have been able to maintain viECs for at least 5 passages without inducing senescence and while maintaining confluent monolayers. See troubleshooting 6[href=https://www.wicell.org#sec7.11].\nPrepare viECs for parallel plate flow experiment\nTiming: 3 days\nParallel plate flow chamber experiments can be used to study viEC behavior under physiological shear stress. viECs are cultured in polystyrene 9 cm2 SlideFlasks and placed in a custom parallel plate flow chamber that allows media to be pumped over the cells at a specified flow rate. After 24–48 hours, cells can be harvested for gene or protein expression analysis.\nCoat Nunc polystyrene SlideFlasks with 0.05 mg/mL Collagen I in 0.02 M Acetic Acid at 20°C–25°C for 1 hour, then wash once with PBS. 2 mL of coating solution is needed to coat each flask (refer to before you begin steps 14–18 for full details on collagen coating).",
    "As described in step 12, use Accutase to passage viECs to slides at a density of 27,000 viECs/cm2 (∼250,000 viECs per 9 cm2 SlideFlask) in 4 mL of viEC media per SlideFlask. Feed the cells the day after passaging, then every other day.\nNote: The viEC seeding density should be optimized for each cell line to form a confluent monolayer on the SlideFlask.\nOptional: viEC response to treatments can be tested by supplementing the media with therapeutics of interest at this time.\nSet up parallel plate flow experiment\nTiming: 3 h\nWith a confluent monolayer of viECs in SlideFlasks, parallel plate flow experiments can be set up to study viEC behavior under physiological shear stress. Based on counting adhered cells in images of slides taken before beginning flow experiments, viEC are confluent at a cell density of 53,028 ± 11,690 cells/cm2 (mean ± SD). If testing a treatment on the viECs for a specified number of days, a non-treated control that was cultured for the same duration should be used to account for differences in endothelial behavior based on cell density or duration in culture. For example, if testing a 7-day treatment of a particular therapeutic followed by a 24-hour parallel plate flow experiment, we would also culture a non-treated SlideFlask of viECs for 7 days and perform a 24-hour parallel plate flow experiment as a control.\nAssemble and sterilize the flow circuit components as described in the before you begin[href=https://www.wicell.org#before-you-begin] section.\nObtain and autoclave two fine-point tweezers.\nWarm 37 mL viEC media in a 37°C water bath.\nIn the biosafety cabinet, assemble the pulse dampener by obtaining the two sterile 4-way stopcocks linked in series and screwing two sterile 60 mL Luer-Lock syringes into the top outlet of each stopcock (Figure 1[href=https://www.wicell.org#fig1]B).",
    "Note: There are also commercial pulse dampeners available that can be used (e.g., Cole Parmer 0759620), but these use large media volumes. We use this custom pulse dampener to reduce the required media volume.\nPull the plunger for each syringe up to the 25 mL mark.\nAssemble the rest of the tubing by screwing the female luer + 3/32″ barb fitting on the inlet tubing to the left side of the pulse dampener and the male luer + 3/32″ barb fitting on outlet tubing to the right side (Figure 1[href=https://www.wicell.org#fig1]A).\nAttach a 0.22 μm syringe filter to the female luer + 3/32″ barbed fitting of the gas exchange tubing and use parafilm to secure the connection (Figure 1[href=https://www.wicell.org#fig1]B).\nStabilize the pulse dampener by taping the syringes to a conical tube holder such that they are perpendicular to the flat surface of the biosafety cabinet.\nFill the reservoir bottle with 30 mL warm viEC media and screw the cap closed.\nIf the autoclave tape securing the tubing on the cap has come loose, reinforce it with lab tape.\nSecure the media reservoir bottle and the pulse dampener conical rack to a tray using lab tape (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/528-Fig4.jpg\nFigure 4. Parallel plate flow experiment set-up\n(A) Pulse dampener and filled media reservoir assembled and secured to tray.\n(B) Flow circuit without flow chamber, attached to the pump.\n(C–F) Stopcock settings to fill both syringes of the pulse dampener.\n(G) Flow chamber before inserting the slide (gasket is elevated to allow room for the slide to be inserted).\n(H–J) Process to separate the slide from the flask component of the SlideFlask.",
    "(K–O) Flow chamber assembly: (K) slide placed in the flow chamber flush with the gasket; (L) chamber after 7 mL viEC media is pipetted onto the slide; (M) chamber with top piece held in place over bottom piece before being released; (N) chamber after releasing the top piece in place onto the bottom piece; (O) full assembled flow chamber after screwing in wing nuts.\n(P) Full assembled flow circuit with flow chamber inserted.\n(Q) Flow chamber in cell culture incubator attached to the pump sitting on top of the incubator.\nCritical: If the flow circuit components are not appropriately secured to the tray, they may be knocked over in the incubator which will introduce air bubbles into the flow circuit.\nAttach the inlet tubing to the pump (Figure 4[href=https://www.wicell.org#fig4]B).\nFill the inlet tubing by turning on the pump at a speed of 9 mL/min. Stop the pump when media can be seen flowing through the stopcocks of the pulse dampener.\nFill the first syringe in the pulse dampener with 5 mL of media by using the stopcocks to allow flow up into the first syringe and to block flow to the tubing past the syringe. Turn the left stopcock so that the OFF switch is pointed to the right blocking flow past the first syringe, and the second stopcock so that the OFF switch is pointed up, blocking flow into the second syringe (Figure 4[href=https://www.wicell.org#fig4]C). Turn on the pump until the media level reaches 5 mL inside the syringe, then turn it off (Methods video S1[href=https://www.wicell.org#mmc1]).\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Filling pulse dampener syringe 1, related to step 30",
    "The pump is set to 9 mL/min and the pulse dampener stopcocks are set such that media flow past the first syringe is blocked. The first syringe of the pulse dampener is filled with 5 mL media.\nNote: The syringe will build some air pressure inside at first, then the pressure will reach a level such that the plunger will start to move up. Allow it to lift while the media flows into the syringe until the appropriate level. The plunger should now be at 30 mL after filling the syringe.\nFill the second syringe in the pulse dampener with 5 mL of media by using the stopcocks to block media flow into the first syringe, allow flow into the second syringe, and block flow to the rest of the tubing past the second syringe. Turn the left stopcock so that the OFF switch is pointed up to block flow into the first syringe and turn the right stopcock so that the OFF switch is pointed right to block flow past the second syringe (Figure 4[href=https://www.wicell.org#fig4]D). Turn on the pump until the media level reaches 5 mL inside the second syringe, then turn it off (Methods video S2[href=https://www.wicell.org#mmc2]). The plunger for both syringes should now be at the 30 mL mark.\n    Your browser does not support HTML5 video.\n  \nMethods video S2. Filling pulse dampener syringe 2, related to step 31\nThe pump is set to 9 mL/min and the pulse dampener stopcocks are set such that the media flow into the first syringe is blocked and the media flow past the second syringe is blocked. The second syringe of the pulse dampener is filled with 5 mL media.",
    "Use the stopcocks to block flow to each syringe (Figure 4[href=https://www.wicell.org#fig4]E) and use parafilm to secure the syringe plungers at their current position such that they will not move up when air pressure builds in the syringes due to higher flow rate. Both stopcocks should be turned so that their OFF switches are pointed up.\nCritical: If the plungers are not properly secured, they will rise when the flow rate is increased and may burst open in the incubator, at which point the experiment is not recoverable. Make sure to secure them well with plenty of parafilm. See troubleshooting 7[href=https://www.wicell.org#sec7.13].\nMark the location of each plunger’s end on each syringe (around the 30 mL mark) with a lab marker. This will allow you to track the plungers as you raise the flow rate to make sure they are not moving with increased pressure.\nTurn both stopcocks so that the OFF switches are pointed down, allowing the media to flow in all directions through the tubing and syringes (Figure 4[href=https://www.wicell.org#fig4]F). See troubleshooting 8[href=https://www.wicell.org#sec7.15].\nFill the rest of the tubing until media drips out of the outlet tubing back into the reservoir bottle (Methods video S3[href=https://www.wicell.org#mmc3]).\n    Your browser does not support HTML5 video.\n  \nMethods video S3. Complete flow circuit, related to step 35\nThe whole flow circuit has been primed and media is dripping from the outlet back into the reservoir. The pump flow rate is set to 9 mL/min.\nNote: The media should now flow continuously without pulsing.\nShake the tubing to move air bubbles out through the outlet. Ensure that no air bubbles remain in the tubing.",
    "Slowly turn up the pump to 52 mL/min in increments of ∼15 mL/min. Ensure that the pulse dampener plungers do not move and the flow circuit is stable. Allow the pump to continue running at this speed as a test while you assemble the flow chamber.\nNote: The media level inside the pulse dampener syringes will rise when the flow rate is turned up, but the plunger level should not rise since they are secured in place by parafilm. See troubleshooting 7[href=https://www.wicell.org#sec7.13].\nNote: A flow rate of 52 mL/min achieves a physiological shear stress of 1.2 Pa based on the dimensions of our chamber (see step 61 for the calculation).\nAssemble the bottom of the flow chamber by laying it flat on the biosafety cabinet surface or a sterile tray and using sterile tweezers to secure the gasket onto the screws at a slightly elevated position from the bottom of the chamber (Figure 4[href=https://www.wicell.org#fig4]G). The top of the flow chamber should lie nearby with the surface that will eventually touch the cells facing upwards.\nRetrieve the SlideFlask of confluent viECs from the incubator.\nSpray the SlideFlask with 70% ethanol, dry with a Kim wipe, and place it on a sterile surface in the cell culture hood.\nAspirate the media from the flask and use a SlideFlask removal tool to remove the culture chamber from the slide (Figures 4[href=https://www.wicell.org#fig4]H–4J). While using the forceps to keep the slide flat on the tray, wedge the tool underneath the lip of the flask and use it as a lever to crack the flask off the slide (Figure 4[href=https://www.wicell.org#fig4]H). Keep pressure on the forceps to keep the slide flat and use your other hand to pull the flask completely off the slide (Figures 4[href=https://www.wicell.org#fig4]I and 4J).",
    "Use sterile tweezers to transfer the slide to its designated groove in the bottom piece of flow chamber.\nUse both pairs of sterile tweezers to bring the gasket down, making it flush with the bottom of the chamber (Figure 4[href=https://www.wicell.org#fig4]K).\nUse a 5 mL serological pipette to add 7 mL warm viEC media on top of the slide and allow it to fill the interior area created by the gasket (Figure 4[href=https://www.wicell.org#fig4]L). The media should bubble above the culture area, slightly over-filling it.\nTo assemble the top, line it up with the screws of the bottom then bring it halfway down to the surface of the cells (Figure 4[href=https://www.wicell.org#fig4]M). Release the top chamber piece from your fingers quickly to allow it to fall into place (Figure 4[href=https://www.wicell.org#fig4]N).\nNote: Dropping the top of the chamber rather than lowering it slowly onto the cells allows fewer bubbles to be created on top of the slide. Some media will spill in the process; this is to be expected and is not concerning.\nOptional: Bubble creation should be minimized as they can shear the cells off as they move across the culture area and bubbles that get stuck in a particular location create obstructions that distort the media flow in that area. Avoiding creating bubbles at this step can be tricky so to minimize bubble formation, practice this step without cells using only water or media before performing the full flow experiment. See troubleshooting 9[href=https://www.wicell.org#sec7.17].",
    "Secure the two halves of the flow chamber by screwing in the wingnuts (Figure 4[href=https://www.wicell.org#fig4]O). Start from the corners and move to the middle. As you screw in each wingnut, screw in nuts diagonally opposite each other such that the pressure remains even on both sides of the chamber. The wingnuts are numbered in Figure 4[href=https://www.wicell.org#fig4]O to show the correct order.\nUse pliers to tighten the wingnuts as much as possible.\nCritical: The wingnuts must be screwed tightly (without breaking the acrylic) such that media does not leak out of the sides of the flow chamber. See troubleshooting 10[href=https://www.wicell.org#sec7.19].\nWipe off any spilled media from the flow chamber using Kim wipes soaked in 70% ethanol.\nTurn the pump off. The flow circuit should have been running stably at 52 mL/min for some time now.\nConnect the outlet tubing to the flow chamber first. Disconnect it from the 5/32″ straight tubing connector between the two short stretches of L/S 16 tubing and connect one end of the L/S 16 tubing to one of the flow chamber ports.\nNote: A small drop of media may drop out of the opposite flow chamber port when the outlet is connected.\nNote: Either side of the flow chamber can serve as the inlet or outlet. Just be sure to track which direction the flow runs on the slide such that future cell imaging can be calibrated to flow direction.\nConnect the stretch of L/S 16 tubing to the other side of the flow chamber.\nOptional: Wrap a small piece of parafilm around the connection site between the tubing and the flow chamber to prevent leaking in this area. While optional, we have found this advantageous to prevent leaking in our experiments. See troubleshooting 10[href=https://www.wicell.org#sec7.19].",
    "Place the flow chamber on the tray with the pulse dampener and the media reservoir (Figure 4[href=https://www.wicell.org#fig4]P).\nTurn the pump down to 9 mL/min and turn it on. Allow the media to flow through the flow chamber and drip into the reservoir for a few seconds.\nCritical: Do not forget to turn the pump down to 9 mL/min before flowing over the cells as exposing the cells to 52 mL/min immediately without any flow conditioning will cause them to detach from the slide. See troubleshooting 11[href=https://www.wicell.org#sec7.21].\nTurn the pump off. Disconnect the tubing from the pump and transfer the tray with the flow circuit to a cell culture incubator.\nNote: Make sure to set the rack inside the incubator such that the pulse dampener can fit. It measures ∼10 inches high.\nPlace the pump on top of the cell culture incubator.\nConnect the inlet tubing to the pump and tape to the incubator such that the incubator door can be closed (Figure 4[href=https://www.wicell.org#fig4]Q).\nTurn on the pump and close the incubator.\nTo condition the cells to shear stress exposure, slowly ramp up the flow rate over a period of two hours. First, maintain the flow at 9 mL/min flow rate for 15 minutes.\nTurn the pump flow rate up to 18 mL/min and maintain this rate for 45 minutes.\nTurn the pump flow rate up to 36 mL/min and maintain this rate for 1 hour.\nTurn the pump flow rate up to 52 mL/min and maintain this rate for 24 hours.",
    "Note: Pump flow rate can be set to achieve desired shear stress based on flow chamber dimensions. The relationship between shear stress    (  τ ,   d y n e s   c  m 2     )    and flow rate     (  Q ,   m L  s   )    for a chamber of width   w   (  c m  )    and height   h   (  c m  )    for a Newtonian fluid of viscosity   μ   (  g  s  c m   )    is as follows:\n  τ =   6 Q μ   w  h 2     \nTo convert the shear stress from cgs units (dyne/cm2) to SI units (Pa=N/m2), divide the value in cgs units by 10.\nThis relationship is valid for laminar flow in a rectangular channel and when the fluid velocity only depends on the vertical direction (Truskey, Yuan and Katz, 2009[href=https://www.wicell.org#bib15]). For laminar flow in a rectangular channel, the Reynolds number must be < 2000. The Reynolds number for a rectangular channel is calculated by the following equation:\n  R e =   ρ v  (   2 w h   w + h   )   μ   \nwhere   v   (   c m  s  )    is the fluid velocity and   ρ   (  g  c  m 3    )    is the fluid density (Truskey, Yuan and Katz, 2009[href=https://www.wicell.org#bib15]; Kandlikar, 2013[href=https://www.wicell.org#bib6]). For the flow to depend only on the vertical direction, the following conditions must be met:\nEntrance length    L e  > 0.05  R e   (   2 w h   w + h   )   . This establishes that the velocity does not vary with the direction of flow (i.e., it is fully developed) (Kandlikar, 2013[href=https://www.wicell.org#bib6]).\n  w ≫ h   (Typically,    w h  > 20  ). This establishes that the velocity does not vary along the width of the channel, except at the edges.",
    "For our chamber and media:   w = 1.89  c m  ,   h = 0.0495  c m  ,   μ = 0.0107   g  s  c m    , and   ρ = 1.02  g  c  m 3     . Based on the shear stress equation, to achieve a shear stress of  τ = 1 . 2  P a = 12   d y n e s   c  m 2     which is the physiological average away from branches, we need a flow rate of:\n  Q =   12 ∗ 1.89 ∗  0.0495 2    6 ∗ 0.0107   = 0.87   c  m 3   s  = 52   m L   m i n    \nBased on this flow rate, the fluid velocity is as follows:\n  v =  Q A  =  Q  w h   =  0.87  1.89 ∗ 0.0495   = 9.3   c m  s   \nThe Reynolds number equals:\n  R e =   1.02 ∗ 9.3 ∗   2 ∗ 1.89 ∗ 0.0495   1.89 + 0.0495    0.0107  = 85 < 2000  \nThis satisfies the condition for laminar flow.\nThe entrance length    L e  = 0.05 ∗ 85 ∗ 0.096 = 0.41  c m  . Note that the slide is placed 1.9 cm beyond the entrance, so the flow is fully developed before it reaches the slide.\nFinally, the width to height ratio    w h  =  1.89 0.0495  = 38 > 20  , satisfying the second condition for flow to depend only on the vertical direction.\nOptional: We have seen viEC alignment and altered gene expression after 24 h of flow. If studying longer-term phenotypes or if alignment is not seen after 24 h, viEC time under flow can be extended to 48 h. See troubleshooting 12[href=https://www.wicell.org#sec7.23].\nTake down flow chamber experiment\nTiming: 1 h\nAfter 24 hours, turn the pump off and disconnect the tubing from the pump.\nMove the flow circuit tray to the biosafety cabinet.",
    "Disconnect the tubing from the flow chamber and use a 5/32″ straight tubing connector to link the open ends of the tubing. Move the flow chamber to a clean surface to disassemble it.\nUse pliers to loosen each wingnut, again moving from the corners to the middle and unscrewing the diagonally opposite pairs together. Remove all the wingnuts.\nLift the top half of the flow chamber off of the bottom half to expose the cells.\nUse tweezers to remove the gasket such that the slide of cells can be reached.\nNote: Move quickly during this time such that the media on the cells does not evaporate. They will detach from the slide quickly if not moved into warm media immediately.\nUse tweezers to transfer the slide into a petri dish filled with warm viEC media. Make note of the flow direction for future reference if planning on imaging the slide.\nFix the cells for immunohistochemistry, prepare for DAF-FM DA assay, or isolate RNA as desired.\nWhen finished preparing the cells as desired, rinse the flow chamber with water and scrub with Alconox. Dry completely then EtO sterilize. Wingnuts can be autoclaved.\nFill the media reservoir with bleach and leave for 15 minutes, then rinse with dH2O. Allow to dry on a drying rack.\nFlush the tubing with 70% ethanol, then with dH2O, then with air. Hang and allow to air-dry completely.\nReassemble the tubing and reservoir and sterilize by autoclaving or EtO sterilization.\nDiscard the 60 mL syringes and flush the 4-way stopcocks with ethanol.\nAllow the stopcocks to dry, then EtO sterilize.",
    "Note: The tubing and chamber components can be reused indefinitely as long as they do not leak. If the chamber endures damage or cracks that cause leaking, then it must be replaced. We have been using our chambers for several years without any issues with cracking. The only component of the system that needs to be replaced regularly is the 4-way stopcocks, which will crack over time due to the high pressure of the media flow. The stopcocks should be replaced when they crack and cause leaking, which may occur every 2–3 months if they are being used frequently.\nNote: Contamination problems are very rare and indicate either a mistake in the flow experiment set-up process or in sterilizing the components. If contamination problems arise, filter all media and repeat steps 70–75 to sterilize all the components and use them again. If the contamination persists despite re-sterilization, replace all the components except the flow chamber (tubing, tubing connectors, and stopcocks).\nFix slide for immunohistochemistry\nTiming: 40 min\nUpon completion of a flow experiment, viECs can be fixed on the slide for immunohistochemistry. This protocol begins following step 68, with the slide of cells placed in a petri dish with warm viEC media.\nAspirate viEC media and wash the slide with PBS twice.\nIn the fume hood, add 4% paraformaldehyde (PFA) to cover the slide.\nLeave cells with PFA in the fume hood at 20°C–25°C for 15 minutes.\nAspirate PFA and wash cells with PBS 3 times for 5 minutes each.\nPause Point: Fixed cells can be stained immediately or stored at 4°C covered with PBS in a petri dish and wrapped in parafilm.\nRetrieve RNA after flow experiment\nTiming: 1 h",
    "Upon completion of a flow experiment, RNA can be isolated from the viECs for RT-PCR or RNAseq. This protocol begins following step 68, with the slide of cells placed in a petri dish with warm viEC media.\nAspirate viEC media and wash the slide with PBS once.\nUse tweezers to pick up the slide and dab the bottom of the slide (NOT the culture area) lightly with a Kim wipe to remove excess PBS.\nPlace the slide on a dry, flat, clean surface.\nAdd 220 μl lysis buffer to the culture area such that it fills the area with cells.\nNote: The specific lysis buffer will depend on the RNA extraction kit being used. We use the Qiagen RNeasy mini kit (Qiagen 74104) with lysis buffer RLT + β-mercaptoethanol.\nScrape the lysis buffer and cells off the slide into 1 well of a 6-well plate.\nRepeat steps 80–84 for all the slides if processing several at once. Include a static control for each flow slide.\nProceed with the RNA extraction according to the protocol for the specific RNA extraction kit being used.\nPause Point: Isolated RNA can be stored at −80°C for 1 year.\nDAF-FM DA assay to detect nitric oxide\nTiming: 1 h\nUpon completion of a flow experiment, viECs can be stained for nitric oxide using the DAF-FM diacetate (DAF-FM DA) assay. This protocol begins following step 68, with the slide of cells placed in a petri dish with warm viEC media.\nPrepare 5 mM DAF-FM DA by dissolving 50 μg DAF-FM DA in 20 μL DMSO. Dissolved DAF-FM DA stock can be stored at −20°C for 6 months.\nPrepare enough serum-free viEC media with complete StemPro-64, 50 μg/ml VEGF, and 2 μg/ml heparin for all samples. Warm to 37°C.",
    "Add 1 μM DAF-FM DA to warm serum-free viEC media.\nAspirate media from slides and add serum-free viEC media with DAF-FM DA.\nIncubate viECs with DAF-FM DA for 30 minutes at 37°C.\nAspirate media with DAF-FM DA and rinse cells once with PBS.\nAspirate PBS and add fresh warm serum-free viEC media.\nIncubate viECs for 15 minutes at 37°C.\nImage viECs immediately at 10× magnification. DAF-FM DA appears in the FITC channel.\nQuantify DAF-FM DA-positive viECs per unit area using image analysis software (e.g., FIJI).\nNote: viECs should be imaged within 30 min after completing the labeling process to avoid losing the DAF-FM DA signal as it is free-floating in the cytoplasm and not bound. We have not attempted fixing viECs after the DAF-FM DA assay and performing immunohistochemistry with other antibodies. If this is necessary, it may be possible to optimize but the fixation and washing steps may remove the DAF-FM DA signal."
  ],
  "subjectAreas": [
    "Cell Differentiation",
    "Cell Culture",
    "Stem Cells",
    "Biophysics"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}