{
  "id": 12042,
  "origin_website": "Jove",
  "title": "Generation of a Liver Orthotopic Human Uveal Melanoma Xenograft Platform in Immunodeficient Mice",
  "procedures": [
    "Patients enrolled in the study should provide written consent allowing the use of discarded surgical samples for research purposes and genetic studies, according to an Institutional Review Board-approved protocol. This protocol was carried out in strict accordance with the recommendations in the Guide for the Care and Use of Laboratory Animals of the National Institutes of Health and approved by the Institutional Animal Care and Use Committee (IACUC).\n1. Collection of Fresh Patient-derived Tumor Tissue\nObtain patient-derived tumor tissue from surgery or a needle biopsy in a hospital operating room.\nPut the tumor tissue in a 100 mL container containing Hanks' balanced salt solution (HBSS) solution on ice.\nTransfer the tissue into a sterile hood (Biosafety level 2) in a laboratory.\nProceed to step 2 as soon as possible.\nNOTE: For safety reasons, exclude patients with known HIV or Hepatitis B or C infections.\n2. Processing of Fresh Patient-derived Tumor Tissue\nPut the tissue in a 50 mL tube containing phosphate-buffered saline (PBS) on ice. For washing the tissue, add PBS in the tube and discard PBS from the tube twice.\nTransfer the tissue into a Petri dish containing PBS on ice.\nUsing sterile forceps and scissors, remove the necrotic parts of the tissue. Keep the tissue moist and cold during steps 2.3 to 2.5. For needle biopsy samples, skip step 2.3 and 2.5, and do not cut the samples.\nNOTE: The necrotic tissue often breaks apart easily when touched.\nCut the tissue into 1 mm3 cubes for surgical liver implantation.\nCut the rest of the tissue into 2 mm cubes in the Petri dish.\nTransfer them to a 1.7 mm microtube with 4% formalin for histological analysis and to another tube for genomic and proteomic analysis.",
    "Put the microtubes in a liquid nitrogen jar with liquid nitrogen. Transfer the tubes to a -80 °C freezer for permanent storage.\nNOTE: The time between sample removal from the patient and tissue processing should not exceed 30 min.\n3. Surgical Liver Implantation with Patient-derived Tumor Tissue\nSpray all objects coming into the hood for surgery with 70 % ethyl alcohol.\nNOTE: This includes surgical instruments, heating pads, and anesthesia machines.\nMeasure the weight of a cotton swab and fabric sheet.\nAnesthetize a mouse with a 3–5% isoflurane vaporizer by placing it in the induction chamber.\nOnce the mouse is fully anesthetized, place it in supine position on a heating pad. Place the isoflurane cone on the mouse's snout to inhale 1.5–3% isoflurane for maintenance of anesthesia.\nNOTE: The mouse needs to be on the heating pad during the entire procedure. Lack of heating may cause hypothermia.\nConfirm proper anesthesia by no reaction when the foot of the mouse is pricked with ultrafine forceps.\nInject buprenorphine (0.6 mg/kg) subcutaneously on the flank using a 27 G needle on a micro syringe before surgery.\nApply 70% ethyl alcohol to the abdomen and spread the fur upwards and downwards. After spreading the fur, confirm easier visualization of the skin below the left subcostal area for an easier cut. Do not shave off the fur from the abdomen.\nNOTE: The fur will hide the incision site after surgery and prevent the mouse from scratching the incision post operation. However, you can shave the fur to prevent infection of the incision site according to institutional standards.\nApply iodine and let it be absorbed into the skin.\nPlace a sterile surgical drape with a 2 cm hole on the mouse.",
    "Lift abdominal skin with curved ultrafine forceps and make a 1 cm transverse left subcostal skin incision with curved scissors.\nInsert the tip of the curved scissors beneath the skin of the incision and slightly open them to separate peritoneum from skin. Retract the scissors from the incision with closed blades.\nNOTE: Opening and closing scissors inside the mouse can cause damage and bleeding.\nLocate the liver under the peritoneum. Confirm a dark reddish color through the peritoneum.\nWith curved scissors, make a 1 cm transverse incision in the peritoneum. If a peritoneal artery bleeds from the cutting edge, immediately stop the bleeding with cautery.\nGrab fat tissue using curved ultrafine forceps with one hand, insert the edge of a cotton swab beneath the left liver lobe and roll the swab downward with the other hand to bring out the liver.\nNOTE: Grabbing fat tissue is important to keep the fat tissue from sticking to the cotton swab.\nExteriorize the liver on the cotton swab and place the liver on a non-woven absorbent fabric sheet.\nNOTE: The fabric sheet plays two essential roles in stabilizing the liver and absorbing hemorrhage.\nMake an incision 5 mm in width and depth using a sterile No. 11 scalpel blade to form a pocket in the parenchyma while softly pressing the incision site with the cotton swab.\n\t\nInsert the blade in parallel with the surface of the liver and cut horizontally.\nPress the incision site with the cotton swab to stop any hemorrhage.\nNOTE: Do not keep the blade vertical, otherwise you will break through the liver and injure large vessels in the middle of the liver.",
    "Roll the cotton swab upward to open the incision site and implant a 1 mm3 cube of tumor tissue into the pocket with curved ultrafine forceps. Retract the forceps while rolling the cotton swab in reverse rotation and pressing down.\nNOTE: Pressing down on the incision site with the cotton swab while retracting the forceps helps to prevent displacement of the tumor inside the pocket.\nGently take the cotton swab off the incision site after implantation. Proceed to step 3.19 as soon as possible.\nPut an absorbable hemostat on the incision site.\nConfirm hemostasis. If bleeding continues, add more hemostat on the incision site.\nPeel the liver off the fabric sheet with forceps (preferably blunt-ended) and put the liver back into the abdominal cavity.\nSuture peritoneum with double ligature using 5-0 absorbable suture.\nSuture skin with triple ligature using 5-0 absorbable suture.\nNOTE: Triple ligature helps to prevent surgical incision dehiscence.\nObserve the mouse until fully awake and put it back in the cage.\nMeasure the weight of the cotton swab and the fabric sheet with blood for bleeding volume during the surgery. Compare them with their original weights before surgery. Reduce bleeding during the surgery to less than 10% of circulating blood volume in mouse.\n4. Collecting and Processing of Cultured Human Liver Metastatic Uveal Melanoma Cell Line\nPrepare cultured cells.\nCollect cells and calculate the cell number using a cell counter.\nPrepare an appropriate amount of cell suspension for 10.0 x 106 cells in a 15 mL tube.\nSpin the tube at 300 x g for 5 min in a centrifuge at room temperature.\nRemove the supernatant in the 15 mL tube. Leave the cell pellet at the bottom of the tube.\nAdd 50 μL of RPMI 1640 medium into a 1.7 mL tube.",
    "Cut the tip of a 200 μL tip with scissors to enlarge the tip opening.\nAdd 60 μL of basement membrane matrix using a pipette with the cut tip into the 1.7 mL tube that has RPMI.\nMix RPMI and matrix in the 1.7 mL tube. Vortex it.\nAdd 110 μL of the mixture into the cell pellet in the 15 mL tube. Transfer the cell suspension into a new 1.7 mL tube.\nKeep the tube on ice before needle injection.\n5. Surgical Needle Implantation of Cultured Human Liver Metastatic Uveal Melanoma Cell Line into Liver\nFollow the above protocol from steps 3.1 to 3.15.\nCollect the cell suspension with a microsyringe with a 27 G needle.\nInsert the needle along the surface of the liver and advance the tip of the needle 5 mm deeper.\nInject 20 μL of cell suspension into the liver.\nCauterize the insertion point of the liver to prevent the injected cells from leaking out. Confirm hemostasis.\nFollow the above protocol from steps 3.21 to 3.24.\n6. CT Scan\nPlace the mouse into a restrainer in the awake state.\nWipe the tail with a sterile alcohol pad for disinfection and vasodilation.\nInject 100 µL of CT contrast agent through the tail vein with a 27 G needle on a 1 mL syringe.\nWait for 4 h after injection before taking the CT scan.\nNOTE: It takes 4 h until the agent is taken up by liver Kupffer cells.\nFour hours after injection, anesthetize the tumor-bearing mouse with 3–5% vaporized isoflurane by placing it in the induction chamber.\nOnce the mouse is fully anesthetized, place it in the prone position on a CT. Place the isoflurane cone on the mouse's snout to inhale 1.5–3% isoflurane for maintenance of anesthesia.",
    "Confirm proper anesthesia by no reaction when the foot of the mouse is pricked with ultrafine forceps.\nTake a CT scan for 15 min.\nEnsure that the mouse until it is fully awakened after the CT scan and put it back into the cage.\nEvaluate for the existence of tumor and measure the tumor size on the CT images.\nNOTE: The contrast agent enhances normal liver parenchyma so that it is easy to recognize unenhanced tumor. Do not misinterpret the gallbladder and stomach as tumor.\n7. Harvesting and Processing Tissue\nEuthanize mice using CO2 followed by cervical dislocation by placing the index finger and thumb behind the skull and pulling the body by the base of the tail. Proceed to step 7.2 as soon as possible.\nPlace the mouse in a supine position and spray the abdomen with 70% ethyl alcohol.\nUse sterile forceps and sterile scissors to make a 3-cm transverse incision below the xiphoid process to expose the abdominal organs.\nExcise the tumor tissue and perform steps 2.1 to 2.2.\nCut the rest of the tumor into 2 mm cubes in the Petri dish.\nTransfer them to a cryogenic tube with cryomedium for re-implantation after cryopreservation.\nPut the tubes in a cryogenic freezing container filled with isopropanol.\nTransfer the container to a -80 °C freezer for temporary storage. Do not put the cryotubes with cryomedium directly into a liquid nitrogen tank. Freeze them slowly at a cooling rate of -1 °C/min to preserve tumor tissue.\nOn the next day, transfer the tubes into a liquid nitrogen tank for permanent storage.\n8. Re-implantation\nKeep tubes frozen in a liquid nitrogen jar with liquid nitrogen until ready to implant tissue. Minimize exposure of the tissue to room temperature to maintain viability and enhance chances of engraftment.",
    "Thaw cryopreserved tube in a 37 °C water bath.\nPerform steps 2.2–2.4.\nImplant the thawed tumor into mice as described in steps 3.1–3.24.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}