{
  "id": 9893,
  "origin_website": "Jove",
  "title": "A Tandem Liquid Chromatography–Mass Spectrometry-based Approach for Metabolite Analysis of Staphylococcus aureus",
  "procedures": [
    "1. Preparation of Buffer Solutions\nPrepare phosphate-buffered saline (PBS; pH 7.4) by diluting a stock solution of 10x PBS to a final concentration of 1x with ultrapure (distilled and deionized) water.\nPrepare quenching solution by combining 2 mL of acetonitrile, 2 mL of methanol, 1 mL of ultrapure H2O, and 19 µL (0.1 mM final concentration) of formic acid.\nPrepare LC-MS solvent A by adding formic acid (0.2% [v/v] final concentration) to ultrapure water.\nPrepare LC-MS solvent B by adding formic acid (0.2% [v/v] final concentration) to acetonitrile.\n\tNOTE: All solutions should be prepared using the highest-purity reagents available (generally high-performance liquid chromatography grade). Solutions should be prepared fresh before each experiment and stored on ice prior to use.\n2. Establishment of Steady-state S. aureus Growth\nStreak S. aureus strains of interest for isolation on tryptic soy agar (TSA) from a frozen glycerol stock. Incubate at 37 °C for 16-24 h.\nInoculate 4 mL of tryptic soy broth (TSB) or another suitable medium in sterile glass incubation tubes with single colonies of each strain. Incubate inclined (~70° angle) with rotation at 60 rotations per min (rpm) at 37 °C for 16-20 h.\n\tNOTE: Overnight cultures are prone to oxygen gradients when using standard methods, including those described in step 2.2, which affect cellular physiology. Thus, we employ a multiple back-dilution strategy to ensure biological steady state (see steps 2.4-3.2, below).\nUse a spectrophotometer to measure the optical density of the cultures from step 2.2 at 600 nm (OD600). Use sterile medium as an optical reference (blank). Dilute these cells to an OD600 of 0.05 in 50 mL of sterile TSB medium (pre-warmed to 37 °C) in separate, 250 mL DeLong flasks.\nIncubate the cultures at 37 °C in a water bath with shaking at 280 rpm.",
    "Every 30 min, take OD600 measurements; as the optical densities increase, it may become necessary to dilute the cultures with TSB so that they remain within the linear absorbance range of the spectrophotometer.\nWhen cultures from step 2.5 achieve an OD600 of ~0.8-1.0, subculture them into 50 mL of 37 °C TSB to an OD600 of 0.01-0.05 and repeat steps 2.4 and 2.5.\n3. Sample Collection Setup\nPrepare a bed of crushed dry ice in an appropriate vessel (e.g., glass dish, ice bucket, or cooler).\nAs the optical densities of the cultures approach the desired harvest point, add 1 mL of quenching solution to a 35 mm untreated Petri dish and pre-cool on dry ice for ≥5 min.\n\tNOTE: The \"desired harvest point\" will vary depending on experimental goals. For example, if one were to examine metabolites during aerobic growth, key indicators of this state include acetate excretion and re-assimilation of the acetate during the post-exponential growth phase32,33. Generally, this point should be within a specific growth stage (e.g., exponential phase). The specific OD600 values associated with this stage may vary between different bacterial strains and growth media.\nPlace a stainless steel filter frit (pre-chilled to -20 °C) in a rubber stopper and place it atop a vacuum flask attached to a house vacuum or vacuum pump.\nApply the vacuum and place a mixed cellulose ester membrane (0.22 µm pore size) on top.\n\tNOTE: It is critical to use a filter with a diameter equal to that of the frit and to properly center this filter to ensure that the sample is drawn through the filter rather than over the edge. Wetting the membrane with ice-cold, sterile H2O may help with positioning the membrane.\n4. Sample Harvest",
    "At an OD600 of ~0.4-0.5, use a serological pipette to remove 13 mL of culture from the flask and to apply the sample to the filter.\nAfter the entire sample has been filtered, immediately wash the filter with ≥5 mL of ice-cold PBS to wash away medium-associated metabolites.\nDisconnect the vacuum and use a pair of sterile tweezers to remove the filter from the frit. Invert the filter (cell-side down) into the pre-chilled quench solution.\n\tNOTE: It is important to perform the above steps quickly (i.e., within seconds) and as soon as the liquid has been removed to ensure the rapid quenching of the cells, arresting metabolic activity.\nIncubate the filter in quench solution on dry ice for ≥20 min.\nUsing sterile tweezers, invert the filter (cell-side up) in the petri dish and use a micropipette to rinse the cells off of the membrane into the quench solution.\nRe-suspended the cells in quench solution and then transfer the cell suspension to a sterile 2 mL impact-resistant tube containing ~100 µL of 0.1 mm silica beads. Store this on dry ice or at -80 °C.\n5. Metabolite Extraction\nThaw samples on wet ice and disrupt the cells in a homogenizer with four 30 s bursts at 6,000 rpm, with 2 min cooling periods on dry ice between cycles.\nClarify the lysates for 15 min in a pre-chilled, refrigerated microcentrifuge at maximum speed (i.e., 18,213 x g at ≤4 °C).\nTransfer the supernatant to a clean microcentrifuge tube.\nUsing a micropipette, transfer a small portion of the sample to a microcentrifuge tube for the quantification of residual peptide content in step 6; store the remainder at -80 °C.",
    "NOTE: The volume of reserved sample varies, depending on the BCA assay used in step 6.1. This sample should be stored on wet ice for immediate analysis or frozen at -80 °C.\n6. Bicinchoninic Acid (BCA) Assay\nPerform a BCA assay as recommended by the kit manufacturer, using samples from step 5.4 to determine the residual peptide concentration for each sample.\n7. LC-MS\nMix 75 µL of S. aureus extract with 75 µL of LC-MS solvent B, prepared in step 1.4.\nVortex to mix and spin at 13,000 x g for 5 min.\nPlace 100 µL of supernatant into a liquid chromatography (LC) vial and cap it. Ensure that no air bubbles are trapped in the sample.\nLoad the LC vials onto the LC-MS autosampler and edit the running list in the software \"Offline Worklist Editor.\"\nFill out the \"Sample Name\" (e.g., wild-type-1), \"Sample Position\" (e.g., P1-A1), \"Method\" (e.g., Formic Acid-Negative Method), and \"Data File\" (e.g., wild-type-1) columns. Click the button \"Save Worklist\" button. Open the \"Mass Spectrometry Data Acquisition Workstation\" software and input the previously saved worklist. Click the \"Start Worklist Run\" button to start the continuous LC-MS measurement.\nSeparate the samples on a column, link the column to a time of flight (TOF) spectrometer, and couple the TOF spectrometer with the LC system. Use a mobile-phase gradient as follows: 0-2 min, 85% solvent B; 3-5 min, 80% solvent B; 6-7 min, 75% solvent B; 8-9 min, 70% solvent B; 10-11.1 min, 50% solvent B; 11.1-14 min, 20% solvent B; and 14.1-24 min, 5% solvent B; end with a 10 min re-equilibration period at 85% solvent B and a flow rate of 0.4 mL min-1.\nUsing an isocratic pump, infuse a reference mass solution with the run to allow for simultaneous mass axis calibration.",
    "NOTE: This step is based on the standard TOF spectrometer manual.\n\t\nUse the mixture of acetic acid D4 and hexakis (1H,1H,3H-tetrafluoropropoxy) phosphazine as the reference mass solution to perform the real-time calibration. Use the isocratic pump with the flow rate of 2.5 mL min-1 for the infusion.\n8. Batch Correction of Ion Counts\nDesignate any sample to serve as a reference sample for batch correction (e.g., wild-type, replicate 1).\nCalculate the sum of the ion counts for all metabolites within the reference sample. Repeat this calculation for all samples.\nDivide the total ion count of each sample by the total ion count of the reference sample to generate a ratio.\nDivide the ion count for each metabolite within a sample by the sample/reference ratio to obtain a batch-corrected ion count for each metabolite.\n9. Peptide Normalization\nDivide the batch-corrected ion count values for each sample obtained in step 8 by the peptide concentration determined with the BCA assay in step 6 to yield a normalized value for each metabolite.\n\tNOTE: The normalized, batch-batch corrected ion counts for each metabolite obtained in step 9.1 can be directly compared between strains and subjected to statistical analysis (e.g., a Mann-Whitney U-test). Alternatively, a metabolite known to be unchanged either by the treatment or genetic background may be used as a normalizer to detect changes due to metabolite decomposition. The inclusion of a known amount of L-norvaline or gluraric acid in the extraction buffer can be used to correct for loss during sample processing34.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}