{
  "id": 8961,
  "origin_website": "Jove",
  "title": "Assessment of Hippocampal Dendritic Complexity in Aged Mice Using the Golgi-Cox Method",
  "procedures": [
    "Experiments were conducted in accordance with the ethical standards approved by the Institutional Animal Care and Use Committee at UAMS.\n1. Animals and 5-Fu Injection Paradigm\nPurchase 6-month-old male C57Bl6/J wild-type mice and house them under a constant 12 h light/dark cycle until they reach 1 year of age.\nDilute the 5-Fu in 0.9% sterile saline. Use 60 mg/kg as the required dose per mouse.\nGive the intraperitoneal injections of the 5-Fu (once per week for three weeks).\nGive the intraperitoneal injections around the same time on each day. For example, between 0900-1200 h.\nEuthanize the animals and extract the brains 30 days after the final injection.\n2. Euthanasia Procedure and Brain Extraction\nRestrain the rodent and grab the base of the tail. With the other hand, place the thumb or first finger at the base of the rodent's neck. Quickly put pressure on the rodent's neck and push forward while the other hand holding the tail pulls backwards.\nHold the rodent with one hand and the large surgical scissors with the other. Place the rodent's neck between the two blades and quickly decapitate the head.\nTake the severed mouse head, and use the fine scissors to trim the fur above the skull, up to the eyes. Next, place the tips of the scissors into each eye socket and close the scissors with slight force.\nUse spring scissors to cut the skull to the left and right of the cerebellum.\nUse forceps to lift the portion of the skull surrounding the cerebellum directly up and off.\nUse the spring scissors to cut along the midsagittal line of the skull.\nUse the forceps to lift the remaining portion of the skull off the brain.",
    "Use a spatula and a probe to scoop out the brain into the desired container. Using a stainless steel blade, cut each brain along the midsagittal plane. Perform the following Golgi-Cox method on the right hemispheres.\n3. Golgi Staining and Tissue Preparation\nImmerse the freshly harvested half-brains into 5 mL mercuric chloride-based solution (solution A from the kit) in a 10 mL conical tube. The mercuric chloride solution is light-sensitive; cover the tube with foil. Store the sample in the dark at room temperature.\n\tNOTE: Solution A is provided in the kit that is listed in the table of materials. Caution! Solution A (also called mercuric chloride solution) contains toxic reagents such as potassium dichromate, mercuric chloride, and potassium chromate. Wear protective gloves and work in a fume hood.\nAfter 1 day, slowly decant the solution into a temporary container (such as a large weigh boat), and dispose of it in a biohazard waste container. Immerse the brains (still in the original 10 mL conical tubes) with 5 mL of the mercuric chloride solution, and return the sample to the dark at room temperature for 13 more days.\nAdd 30 g post-impregnation buffer to 90 mL distilled or deionized water (dH2O). Fill each well of a 6-well plate with 6.5 mL of the post-impregnation buffer, one well per brain\n\tNOTE: Post-impregnation buffer is provided in the kit that is listed in the table of materials.\n\t\nAfter 14 days (in total) in the mercuric chloride solution, rinse the tissue with dH2O, then transfer them into 6-well plates with post-impregnation buffer. Cover the plates with foil and store them at room temperature in the dark.",
    "Pipette out the post-impregnation buffer after 1 day of immersion and renew with fresh post-impregnation buffer; store for 1 day in the dark at room temperature. If required, store this at 4 °C for up to 1 month22.\n4. Sectioning\nLabel the 12-well plates on their lids with numbers in ascending order from left-to-right and up-to-down.\nPrepare two or three 12-well plates per brain if sectioning the entire brain.\nLabel the top of each 12-well plate lid with the identification number of the brain sectioned.\nPipette 2 mL of 1x PBS into each well of each plate.\nSet up the stage and turn on the vibratome; ensure that there is enough 1x PBS in the container to cover the tissue.\nCut two pieces of plastic paraffin film and fold them over twice. Place them over the holes for the specimen holder knobs to prevent 1x PBS from leaking onto the counter.\nPut tape down on the tissue block of the specimen holder and then put cyanoacrylate adhesive glue (see table of materials) on it.\nRemove the brain from the 6-well plate and place it on a plastic or glass dish. Use the stainless steel double-edged blade to cut off about half of the cerebellum.\nCut the cerebellum caudally. Make sure that the portion of the cerebellum remaining is even.\nImmediately place the flat surface of the remaining cerebellum on the glue.\n\tNOTE: The dorsal part of the tissue (the cerebral cortex) should be facing left or right relative to the blade. The rostral end that previously contained the olfactory bulb attached should face upwards.\n\t\nWait at least a few minutes to make sure that the glue fully dries.",
    "While the glue that is holding the brain in place is drying, pour 1x PBS into the specimen bath. After the glue is dry, place the specimen holder with the tissue into the specimen bath.\nIf the tissue sample is not fully covered, pour more 1x PBS into the specimen bath.\nAttach the blade to the blade holder of the vibratome and slowly lower the blade into the specimen bath until it is fully submerged in 1x PBS. Continue lowering the blade until it is slightly below the top of the tissue.\nSet the vibratome speed to 7, the amplitude to 6, and the cutting angle to 12° (see table of materials for vibratome model). Start the vibration and cut 200 µm sections23.\nUse a large paintbrush to move the tissue sections from the specimen bath into each designated well of the 12-well plates.\nContinue to cut the tissue until the desired number of tissue sections is reached.\n5. Post-staining\nFor each of the following staining steps and rinses, use 2 mL of the indicated solution per well. Use a motorized pipet filler (see table of materials) to transfer the solutions into the wells. Use a transfer pipette (see table of materials) to transfer solutions out of the wells and into the proper waste containers.\nRinse the sections in one 30 min wash of 0.01 M PBS-T (add 3.0 mL of detergent (see table of materials) to 1,000 mL 0.01 M PBS).\nDilute ammonium hydroxide solution (Caution) 3:5 by volume with dH2O immediately before use. Stain the sections in the diluted ammonium hydroxide solution for 19-21 min.\nProtect the light-sensitive ammonium hydroxide solution with foil.",
    "NOTE: Ammonium hydroxide within solution has a concentration of ~10% and it is classified as \"hazardous.\" Ammonium hydroxide solution may produce burns if it contacts the skin. It may cause respiratory tract irritation if inhaled. Wear protective gloves and work in a fume hood.\nStain the sections in the post-staining buffer (add 90 g of reagent D in 500 mL dH2O) for 19-21 min. The post-staining buffer is light-sensitive; protect it with foil22.\nRinse the sections in three, 5-10 min washes of 0.01 M PBS-T.\n6. Mounting, Cleaning, and Covering\nMount the sections on 1% gelatin-coated slides with the large paintbrush. Allow them to dry for 20-30 min at room temperature, and then place them in a Coplin jar overnight.\nRemove the slides with gloved hands from the Coplin jar and place them in a plastic rack (see table of materials). Place the plastic rack in the staining dish (see table of materials) containing 100% ethanol. Dehydrate them with three 5 min washes.\nWash the slides twice for 5 min each in 99% xylene. Place the slides in a glass rack and lower the rack into a glass staining dish containing xylene with a metal handle (see table of materials).\n\tNOTE: Caution, Xylene is harmful if inhaled and causes irritation if it touches the skin. It is highly flammable in liquid and vapor states. Wear protective gloves and work in a fume hood.\nRemove the slides from the xylene one at a time and quickly cover the tissue with ~0.25 mL of mounting media (see Material Table). Next, take the slide covers and lay them over the media.\nPush any trapped air bubbles underneath the slide covers to the edge with a blunt object, such as the end of a paintbrush.",
    "Place the slides in an area away from sunlight and allow them to dry for 2-3 days.\nProceed to acquiring images using a microscope and analyzing with the appropriate software.\n7. Acquire Image Stack\nOpen the imaging program (see Materials Table). Place the slide onto the stage of the microscope. On the menu at the top of the program, click \"Acquisition\" and then click \"Live Image.\"\nSet the microscope to 10X. Identify the neuron of preference and then bring the cursor, which appears like a red X, onto the center of the soma. Left click to set the reference point.\nSet the microscope to 40X. Click \"Move\" from the menu at the top of the program and then click \"To Reference Point.\"\nBegin creating the image stack by manually scrolling with the fine objective above the tissue until it is slightly out of focus.\nClick \"Set Top\" in the bottom right hand corner of the program under the heading \"Image Acquisition.\"\nScroll slightly under the tissue until it is slightly out of focus and then click \"Set Bottom\" under \"Image Acquisition.\" Next, click \"Acquire Image Stack.\"\nAfter the image stack is acquired, type the desired name for image file in the window that appears. Save as \"MBF Ascii file.\"\nWhen prompted, select the file type as \"MBF JPEG2000 stack file\" and then click \"Save.\"\n8. Neuronal Tracing\nIn the toolbar underneath the menu, click the box titled \"Contour Name.\" Select \"Soma\" from the drop down menu.\nManually trace the soma. Then right click and select \"Finish Cell Body\" when tracing is complete.\nSelect \"AutoNeuron\" to bring up another tab titled \"AutoNeuron Workflow.\"\nUnder \"Configuration Type,\" select \"New.\" Set the parameters and then click \"Next Step\" to bring up \"Soma Detection\" subheading.",
    "To set the parameters, select \"Brightfield\". Next, under \"Max Process Diameter\", click \"Start Measuring\". Using the cursor, go to the base of the dendrite and manually set the diameter.\nClick \"Yes\" in the window that requests the user to trace the entire image. Manually trace the soma. Unclick and then click \"Next step\" to bring up \"Seed Placement\" subheading.\nClick \"Validate Seeds\" and then click \"Next Step\" to bring up \"Neuron Reconstruction\" subheading.\nUnder \"Neuron\", click \"Interactive.\" Perform interactive tracing by following the direction from the program of the dendrites and right-clicking to complete the highlighted area traced by the program. After tracing all the dendrites, click \"Next Step.\"\nAfter a new window appears, save the new configuration with a desired title. Click \"Save.\"\n9. Analysis\nOpen the analysis program (see the table of materials).\nClick \"File\" from the top menu and then click \"Open Data File\". Select the file of interest.\nUnder the analysis subheading, select \"Sholl Analysis.\"\nIn the \"Sholl Analysis\" window, set the starting radius to 10 µm. Under \"Analysis,\" click the boxes \"Dendrites\" and \"Branch Orders.\"\nRight click the newly opened windows and click \"Excel Export.\" Click \"Save.\"\nUnder the analysis, click \"Branched Structure Analyses.\" Select \"All Possible Analyses.\"\nRight click the newly opened window and click \"Excel Export\"24.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}