{
  "id": 18601,
  "origin_website": "Jove",
  "title": "Remote Limb Ischemic Preconditioning:  A Neuroprotective Technique in Rodents",
  "procedures": [
    "Ethics statement: The protocol follows the animal care guidelines of University of Sydney, AEC #5657. Anaesthesia was approved by animal ethics committee (University of Sydney, AEC #5657).\n1. Equipment Preparation\nUse real time skin temperature tracking. Switch on computer, and data acquisition hardware.\nOpen temperature recording software and adjust temperature setting to between 30-35 °C and the frequency of sampling to every 100 msec.\nOptional: Insert rectal thermometer to ensure core temperature remains stable at 37.5 °C.\n2. Calibration of the Manual Sphygmomanometer\nConnect neonatal arm cuff to sphygmomanometer.Use a size 2 cuff for a 250-550 g rat. An adaptor may be necessary to connect the cuff tubing to the sphygmomanometer.\nDeflate the cuff by either loosening the air release valve or disconnecting the cuff tubing from the adaptor. Ensure no pressure remains in the tubing and the manometer needle rests at zero inside the oval/rectangle.\nCheck the pressure between tubing, manometer and cuff. Inflate the cuff with gentle pumps of the inflation bulb until it reads 100 mmHg on the manometer. Ensure the pressure remains constant. Deflate the cuff by slowly opening the air release value.\n3. Animal Preparation\nNote: Animals that are to undergo light injury require dark adaption the night before remote ischemia. Animals undergoing light damage require dark rearing (12 hr light:dark cycle (5 lux))\nPerform remote ischemia in either awake or anesthetised rodents. Ensure that animals have a healthy muscle tone. Ensure this by pinching the upper hind limb to confirm there is adequate muscle present. RIP-induced protection against light injury has been tested in sedentary rats up to 6 months of age.\nAnesthetised preparation for RIP",
    "Inject rats with an intraperitoneal injection of 60 mg/kg ketamine and 5 mg/kg xylazine. Check the depth of anaesthesia by extending the leg and pinching the skin on the underside of the foot. The animal has no reflex if it is deeply anesthetised. Apply artificial tears to avoid corneal dryness whilst under anaesthesia.\nPlace rats on either a heat pad or circulating water heater tubing to maintain a constant body temperature of 37.5 °C. Position the rat in the prone position with the lower limbs’ foot pads facing up. Either the right or left limb may undergo remote ischemia.\nAwake preparation for RIPNote: Awake animal experimentation requires two people. One person restrains the animal and the second person operates the manual sphygmomanometer. The experimenters must be confident to perform the procedure as restraint increases the risk of injury to handlers. The rats undergoing remote ischemia must be conditioned to manual restraint. Depending on intuitional guidelines manual restraint should be progress from 30 sEC to a maximum of 5 min over a number of weeks. Timid animals that fail to acclimatise to manual restraint should be excluded from awake experimentation. Lastly, manual restraint is likely to cause stress (and potentially introduce confounds to the study) to animals and a sham cohort (placement of cuff without inflammation) must be used to accurately interpret RIP study results.\n\t\nCut a towel into a 15 cm x 30-50 cm piece and place the short edge perpendicular to the rat’s spine, covering the head to the top of the hind limbs.",
    "Tuck the short edge under the rat’s torso tightly and begin to wrap the rat with the remaining long edge of towel. Secure the wrapped animal under the arm in a supine position. If the rat is held under the left arm, free the rat’s right limb from the towel.\n4. Application of Skin Temperature Probe\nExtend the leg of the rat which is to undergo ischemia and place the skin probe on the footpad. Position the skin probe to maximise contact between the temperature probe and the skin. Firmly push the probe into the footpad and affix the probe with paper tape.\nCheck the skin probe placement by tracking the temperature on temperature recording software. Ensure that the skin temperature is between 30-34 °C and remains stable. Track the skin temperature for 1-2 min. Adjust the skin probe if the temperature is unstable or below 30 °C.\n5. Remote Ischemia\nDeflate the cuff and ensure the air pressure valve is closed. Extend the leg and loosely encircle the cuff on the upper hind limb. Use the forefinger and thumb to extend the leg and the lower digits to keep the loosened cuff in position.\nRaise the anesthetised animal’s cuff pressure to 160 mmHg, and in awake animals increase the cuff pressure to 180 mmHg.\n\tNote: The anesthetised blood pressure of rats ranges from 120-140 mmHg and rises to 160 mmHg when conscious. Commence the timer and foot temperature recordings once the correct pressure is reached.\n\tNote: The foot temperature should drop by 2 °C after 5 min of constant pressure.\nMaintain the position of the cuff above the animal’s “knee” throughout the ischemia. Cuff pressure will begin to drop after a few minutes, or if the rat’s limb is moving.",
    "Repeatedly pump the inflation bulb in short bursts to maintain the desired cuff pressure repetitive short burst of pumping\nRemote ischemia can be delivered continuously for between 5 and 15 min. The ischemia reperfusion protocol includes 2 periods of 5 min ischemia with an intervening 5 min reperfusion.\nDeflate the cuff pressure by loosening the air pressure valve. Check the temperature change over the course of the ischemia protocol. Release the cuff.\nContinue with injury experimentation. Animals under the effect of anaesthesia will need to be placed on a heat pad. Continue to monitor animals until ambulatory. Animals cannot be returned to housing until walking.\n6. Light Injury - Retinal Degeneration Model\nDark adapt the animals overnight (12-15 hr). Immediately following remote ischemia conditioning or sham remote ischemia (animal restraint) place animals in Perspex housing with food and water.\nSwitch on fluorescent lighting (1,000 lux) located above Perspex housing at 9 am for 24 hr. Following light exposure, return the animals to dim cyclic lighting for 7 days. \n7. Post-remote Ischemia Procedures\nVision assessment with Electroretinogram (ERG):\n\tNote: The ERG set-up and flash protocol followed Brandli and Stone26.\n\t\nDark adapt animals overnight (12-15 hr). Under dim red illumination anesthetize the animals by intraperitoneal injection of ketamine and xylazine (60 mg/kg and 5 mg/kg, respectively). Mydriatic (atropine sulphate 1.0%), corneal anaesthetic (proxymetacaine 0.5%).\nApply corneal hydration (Carbomer polymer) eye drops immediately to the cornea. Apply eye gel at 20 min intervals to maintain corneal hydration.\nDraw a loosely tied thread around the eyeball to aid stable ERG recordings. Monitor temperature using a rectal probe and maintain animal’s body temperature at 37-37.5 °C.\nPosition the head inside a Ganzfeld integrating sphere.\n\t\tNote: The Ganzfeld is a fully programmable light stimulus that delivers uniform whit flashes from LEDs to the eye.",
    "Record the electroretinogram using a custom-made 4 mm platinum positive electrode lightly touching the cornea and a 2 mm diameter Ag/AgCl pellet electrode inserted into the mouth. Reference both electrodes to a stainless steel needle inserted subcutaneously into the rump.\nRecord signals with band-pass setting of 0.3-1,000 Hz (-3 dB), with a 2 kHz acquisition rate (AD Instruments). After a stable ERG recording is established subject the animal to a 10 min dark adaptation before commencing recordings.\nFollow the flash protocol as previously described by Brandli and Stone26.\n\t\t\nProgram the duration of the flash (we used flashes 1-2 msec in duration), and set its intensity to -4.4 to 2.0 log scot cd.s.m-2. Use bright flashes (2.0 log scot cd.s.m-2, 1 ms) to measure the retinal function. In this study it is the comparison between control, light injury and light injury with RIP.\n8. TUNEL Assay\nEuthanize animals by intraperitoneal injection of phenobarbital overdose (100 mg/kg). Enucleate the eyes and fix in 4% paraformaldehyde.\nWash the eyes in PBS before cyroprotecting eyes overnight in sucrose 30% (w/v). Embed the eyes in OCT compound and cut into 20 µm sagittal sections using a cryostat.\nPerform the TUNEL assay on retinal sections with DAPI staining following the protocol of Maslim et al.27\nUse fluorescence microscopy for TUNEL counts of the retina. TUNEL cells were recorded from the outer nuclear layer (ONL); the outermost layer of the retina which contains photoreceptor nuclei. In this study, TUNEL counts were made in triplicate for each eye, with 5 eyes for each treatment group.\nUse one-way ANOVA to statistical compare group means of control, light injury, and light injury + RIP rats.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}