{
  "id": 5849,
  "origin_website": "Bio",
  "title": "Design and Direct Assembly of Synthesized Uracil-containing Non-clonal  DNA Fragments into Vectors by USER<sup>TM</sup> Cloning",
  "procedures": [
    "Design and order uracil-containing NCDFs for single fragment USER cloningFor cloning single uNCDFs into USER compatible vectors that have been generated by our lab, our generic 5’ and 3’ user tails are added to termini of the fragment to be inserted (5’ USER tail: 5’-GGCTTAAU, 3’ USER tail: 5’-GGTTTAAU) (for inserting into other USER compatible vectors please use the corresponding USER tails). When ordering synthesized DNA we typically codon optimize the sequence for the organism wherein the gene will be expressed. In an example below, we show how we ordered the gene AT1G15210 as a uNCDF from Thermo Fisher Scientific Geneart. As instructed by Geneart, we provided them with a word file containing sequences to be synthesized in FASTA format. At the beginning of the word document, we included general instructions to the synthesis company, which are given in italics belowDear synthesis company: Green marks a T in the top strand that must be replaced by a U. Turquoise marks an A, which is complementary to a T on the opposite strand that must be replaced by a U (i.e., it is the T on the opposite strand that must be replaced by a uracil). Yellow marks sequence that may not be altered. Non-marked sequence represents coding sequence, which may be changed to overcome synthesis challenges. The gene will be expressed in Xenopus laevis oocytes. Please use the appropriate codon preference table for codon optimization and alternations.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171116/20171116181534_2976.jpgNote: Punctuation marks approx. 2 kb of sequence that was included in the order but which has been omitted here for brevity. In this example, yellow sequence represents our standard 5’ and 3’ USER tails.Cloning single uNCDFs into linearized USER compatible vectorimgsrc:https://en-cdn.bio-protocol.org/attached/image/20171116/20171116181730_8197.jpgFigure 1. Overview of the USER cloning technique.",
    "A USER cassette in a USER-compatible vector (upper left corner) with a restriction site (PacI, light blue) in the middle, one variable nt surrounding it (different for each side, yellow and green), and oppositely oriented nicking sites (Nt.BbvCI, tan). The USER vector is digested with PacI and Nt.BbvCI to generate 8 nt overhangs. A DNA fragment (upper right corner) with uracils at appropriate positions can be generated by PCR as described previously or via synthesis as a uNCDF as described here. Fragment and vector are mixed with USERTM enzyme mix (excising deoxyuridines, pink) and the digested USER-compatible vector. Following brief incubation, the hybridized product can be used to transform E. coli without prior ligation. This figure has been reproduced with permission from (Nour-Eldin et al., 2006).Each fragment is to be surrounded by USER tails that enable insertion into a USER compatible vector. In this example, we use our X. laevis expression vector pNB1u (Nour-Eldin et al., 2006). uNCDFs are mixed directly with the digested pNB1u vector without prior PCR amplification (Figure1).Dilute each uNCDF to 100 ng/μl in H2O (or TE buffer pH 8). The USER-compatible pNB1u X. laevis oocyte expression vector is digested with PacI/Nt.BbvCI overnight, PCR purified and diluted to a concentration of ~50 ng/μl (as previously described [Nour-Eldin et al., 2006 and 2010]).Note: If a USER compatible vector is not available, it is possible to generate them via PCR. In that case, the vector backbone is treated as a DNA fragment to be assembled with DNA fragment of interest via USER fusion (please see below).For the USER reaction, mix 100 ng uNCDF with 50 ng digested pNB1u, 1 U USER enzyme (NEB), 2 µl 5x PCR reaction buffer and 5 µl H2O.",
    "Incubate the reaction at 37 °C for 25 min, and then for 25 min at room temperature. Transform 50 µl chemically competent E. coli cells with the reaction mixture by heat shock (5 min on ice, 30-45 sec at 42 °C and 5 min on ice).Plate the transformation mixture on LB-plates containing appropriate antibiotic selection (for pNB1u we use carbenicillin or ampicilin–containing LB plates). Select three colonies from the plates and grow overnight. Extract plasmids and analyze the extracted plasmids by gel-electrophoresis. Sequence the plasmids with an insert.Design and order uracil-containing NCDFs for USER fusion of multiple fragmentsFor fusion of multiple uNCDFs into USER compatible vectors overlap regions have to be selected and included in adjacent fragments. Overlap regions are selected as previously described by finding a T on the bottom strand and a T on the top strand 7-15 bases downstream of the first T. The pair of selected Ts should be within 20-30 bases distance to the junction site (Figure 2) (Geu-Flores et al., 2007; Nour-Eldin et al., 2010). These Ts will be the ones replaced by a U during synthesis. For insertion into the USER compatible vector, our generic 5’ and 3’ user tails are added to the terminal fragments. When ordering synthesized DNA we typically codon optimize the sequence for the organism wherein the gene will be expressed. In an example below, we show how we designed and ordered three fragments to be fused and inserted into a USER compatible vector by USER cloning. The full-length sequence (~7,200 bp) was split into three fragments (FAS1_A, FAS1_B and FAS1_C). The sequence of their termini is given below. In each fragment, the punctuation in the middle denotes approximately 2 kb of sequence, which was included in the order but has been omitted here for brevity.",
    "Each fragment was designed to include overlap regions to the adjacent fragment close to the junction sites. Please see below and see (Geu-Flores et al., 2007; Nour-Eldin et al., 2010) for more detailed information on how to design USER fusion overlap regions. Alternatively, the Amuser web server tool can deisgn overlap regions for any USER fusion approach (Genee et al., 2015). As instructed by Geneart we provided them with a Word file containing sequences to be synthesized in FASTA format. At the beginning of the Word document, we included general instructions to the synthesis company, which are given in italics below.Dear synthesis company:  Green marks a T in the top strand that must be replaced by a U. Turquoise marks an A, which is complementary to a T on the opposite strand that must be replaced by a U (i.e., it is the T on the opposite strand that must be replaced by a uracil). No alterations are allowed in any color shaded sequence. Non-marked sequence represents coding sequence, which may be changed to overcome synthesis challenges. The genes will be expressed in Xenopus laevis oocytes. Please use the appropriate codon preference table for codon optimization and alternations.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171116/20171116182254_5759.jpgNote: Only the sense strand is included in the ordering process but the result is a uracil-containing double stranded fragment. No alterations are allowed in any colored region during the codon optimization process. Yellow marks our standard 5’ USER tail. Green marks the T, which must be synthesized as U. Turquoise marks the A, whose complimentary T must be synthesized as U. Grey marks the overlap which will be exposed as a single stranded fragment upon USER treatment and which will hybridize to the complimentary single stranded overhang on the adjacent fragment (in this case FAS1_B).",
    "Once synthesized, the double stranded FAS1_A uNCDF will look as follows:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171116/20171116182503_3044.jpgUpon treatment with USER enzyme the double stranded FAS1_A uNCDF will loose sequences lying upstream of the uracils and look as follows:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171116/20171116182538_3057.jpgAs for FAS1_A only the sense strand is included in the ordering process. Green marks the T, which must be synthesized as U. Turquoise marks the A, whose complimentary T must be synthesized as U. Grey marks the overlaps which will be exposed as single stranded overhangs upon USER treatment and which will hybridize to the complimentary single stranded overhangs on the adjacent fragments (in this case the left ‘grey’ will hybridize to the overhang generated on FAS1_A, whereas the right ‘grey’ will hybridize to the overhang generated on FAS1_C). Once synthesized, the double stranded FAS1_B uNCDF will look as follows:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171116/20171116182739_7017.jpgUpon treatment with USER enzyme the double stranded FAS1_B uNCDF will loose sequences lying upstream of the uracils and look as follows:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171116/20171116182914_5872.jpgAs for FAS1_A only the sense strand is included in the ordering process. Green marks the T, which must be synthesized as U. Turquoise marks the A, whose complimentary T must be synthesized as U. Grey marks the overlap, which will be exposed as single stranded overhang upon USER treatment and which will hybridize to the complimentary single stranded overhangs on the adjacent fragment (in this case the rightmost ‘grey’ overlap region on FAS1_B). Once synthesized, the double stranded FAS1_B uNCDF will look as follows:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171116/20171116182956_1400.jpgUpon treatment with USER enzyme the double stranded FAS1_C uNCDF will loose sequences lying upstream of the uracils and look as follows:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171116/20171116183027_2320.jpgFusion and clone of multiple uNCDFs into linearized USER compatible vectorimgsrc:https://en-cdn.bio-protocol.org/attached/image/20171116/20171116183115_6529.jpgFigure 2. Overview of the USER fusion technique. Fragments X1, X2, and X3 are to be fused together. Overlap regions are marked in grey.",
    "Uracils can be inserted via PCR or as described here during synthesis. The DNA fragments are mixed with a pre-digested USER-compatible vector and treated with the deoxyuridine-excising USERTM enzyme mix. This generated 3’ overhangs that complement each other (indicated by arrows), while the outermost ones complemented the overhangs of the pre-digested vector. This design enables the formation of a stable circular hybridization product that can be transformed directly into E. coli without prior ligation. This figure has been reproduced with permission from (Geu-Flores et al., 2007).For fusing and cloning multiple uNCDFs into USER compatible vectors that have been generated by our lab, our generic 8 bp long 5’ and 3’ user tails are added to termini of the terminal fragments. At junction sites uracil-containing overlaps were included to allow seamless fusion upon mixing. When possible we strive to choose fusion overlaps of different lengths and composition to minimize mis-hybridization between fragments. In this example, we fuse and clone three fragments into our X. laevis expression vector pNB1u (Nour-Eldin et al., 2006). Each fragment contained a uracil at the appropriate location in each USER tail. The uracil was incorporated during synthesis. Thus, uNCDFs are mixed in equimolar ratios directly with the digested pNB1u vector without prior PCR amplification with uracil-containing primers.Dilute each uNCDFs to 50 ng/µl in H2O. The USER-compatible pNB1u X. laevis oocyte expression vector is digested with PacI/Nt.BbvCI overnight, PCR purified and diluted to a concentration of ~50 ng/µl (as previously described (Nour-Eldin et al., 2006 and 2010)). For the USER reaction, mix 100 ng of each uNCDFs with 50 ng digested pNB1u, 1 U USER enzyme (NEB), 2 µl 5x PCR reaction buffer and H2O to bring the total volume to 10 µl.",
    "Incubate the reaction at 37 °C for 25 min, and then for 25 min at room temperature. Transform 50 µl chemically competent E. coli cells (for example NEB10β by heat shock) with the reaction mixture (5 min on ice, 30-45 sec at 42 °C and 5 min on ice).Note: Typically the volume of added USER reaction mixture should not exceed 10% of the competent E. coli volume (i.e., max 5 µl reaction mixture to 50 µl E. coli volume, 10 µl reaction mixture to 100 µl E. coli volume etc. Exceeding this ration can reduce transformation efficiency.Plate the transformation mixture on LB-plates containing appropriate antibiotic selection (for pNB1u we used carbenicillin–containing LB plates). Select eight colonies from the plates and grow overnight. Extract plasmids and analyze the extracted plasmids by gel-electrophoresis. Sequence the plasmids with an insert."
  ],
  "subjectAreas": [
    "Plant Science",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}