{
  "id": 8412,
  "origin_website": "Jove",
  "title": "Automated Gait Analysis to Assess Functional Recovery in Rodents with Peripheral Nerve or Spinal Cord Contusion Injury",
  "procedures": [
    "The experimental protocol for all experiments was approved in advance by the Animal Protocol Review Board of the City Government of Vienna. All procedures were carried out in full accordance to the Helsinki Declaration on Animal Rights and the Guide for the Care and Use of Laboratory Animals of the National Institutes of Health.\n1. Animal housing\nHouse male rats (Lewis or Sprague Dawley) weighing 250–300 g under a 12 h light/dark cycle with ad libitum access to food and water.\nControl both room temperature (maintained at 20–22 °C) and humidity (45%–65 %) for adequate animal housing. For this work, male Lewis (PNIs) and Sprague Dawley (SCI) rats were used.\nProvide a new, cleaned cage twice per week. House rats in groups of two or three and closely monitor their social behavior and interaction. Allow the rats an acclimation period of at least 1 week before any surgical procedure or functional testing.\n\tNOTE: Rats require at least 5 days of daily training on the gait analysis apparatus prior to surgery, so calculate at least 2 weeks between arrival of the rats at the facility and the scheduled data for experimental surgery28.\n2. Induction of nerve injury\nNOTE: Wear personal protective equipment such as a surgical gown, gloves, and a mask. In case a sterile surgical gown is not available, a clean, laundered lab coat is also sufficient. Unless it becomes contaminated, the gown or coat does not need to be changed between animals but between surgery sessions. The use of sterile surgical gloves is recommended. In case such gloves are not available, examination gloves can also be used but should be washed prior to surgery using surgical disinfectant. Gloves should be changed between animals.",
    "On the day of surgery, try to minimize any amount of stress to the animals as this might interfere with the anesthesia, e.g., animals will require higher doses of anesthetics.\nOn the day of surgery, inject 0.05 mg Buprenorphine/kg bodyweight in suspension with 100-200 μL 0.9% NaCl subcutaneously using a 25 G canula 1 h prior to surgery to provide pre- and interoperative analgesia. If not indicated otherwise, the rat’s flank is the preferred site for injection.\nAnesthetize the rats by placing them in an anesthesia induction chamber connected to a sevoflurane vaporizer and an active chalk container to absorb the CO2. Anaesthetize the rat by flooding the anesthesia box with 4%–5% sevoflurane-oxygen mixture for about 5 min using an oxygen flow of 1.5 L/min (initiation phase). Connect a pulse oximetry clip to one of the paws to monitor the rodent’s blood oxygen saturation. Maintain the state of general anesthesia with 2.5%–4.5% sevoflurane-oxygen mixture.\n\tNOTE: For experimental surgery, general anesthesia is obligatory. Confirm general anesthesia by checking the lack of response to pinch stimulus of the tail or paws.\nWhen the rat has entered general anesthesia, shave the respective areal that is going to be operated on and disinfect the area by swiping it alternatingly with alcohol and skin disinfectant. The final swiping should be performed with skin disinfectant.\nPlace it on an adjustable heating pad in the required position (supine for the femoral nerve model, prone for the sciatic and SCI model). Insert a flexible thermometer probe in the rat’s rectum to monitor the animal’s temperature and maintaining it at around 37 °C during surgery. During anesthesia, protect the rat’s eyes from desiccation using eye ointment\n3. Surgical induction of nerve injury\nWhen performing surgical procedures, adhere strictly to the seven principles of Halsted29 as follows:",
    "Always handle the tissues gently when working with them. Avoid tearing or crushing the tissues.\n\t\tNOTE: Self-made30 or commercially available retractor systems are helpful to keep muscles and vessels out of the operating field.\nCarefully maintain the hemostasis using an electric hemostat to cauterize vessels or ligatures to guarantee careful hemostasis.\nAlways maintain blood supply to the tissues by dissecting them carefully and handling them delicately.\nMaintain strict asepsis by wearing a mask, a gown, and sterile gloves.\nAvoid tension on the tissues by applying sutures which are neither too tight nor too loose.\nMeticulously appose the tissues by bringing their respective edges together without any overlapping.\n\t\tNOTE: This is particularly important in the case of epineurial or perineurial neurorrhaphy. Perform all microsurgical procedures under 6x–16x magnification using an operating microscope. Ideally, the microscope provides two pairs of oculars to allow for observation of the operation by an assistant.\nAvoid creation of dead spaces by carefully suturing the different tissue layers.\nInduction of sciatic nerve neurotmesis of the right hindlimb\nExpose the right sciatic nerve at the midthigh level by performing a 5 cm long incision on the dorsal side of the hind limb with a #10 scalpel blade connected to a #3 scalpel handle and by dissecting the overlying musculature and soft tissue. Place a retractor inside the wound to keep the dissected musculature and skin out of the situs. Gently expose the nerve by removing the surrounding tissue using curved microsurgical scissors.\nRemove an 8 mm long nerve segment of the sciatic nerve 1–2 mm proximal to its trifurcation with straight microsurgical scissors.\nRotate the nerve segment 180°, place it between the proximal and distal stump of the transected sciatic nerve and perform epineurial neurorrhaphy at each site with two interrupted 10–0 sutures and a microsurgical needle holder.",
    "Induction of femoral nerve neurotmesis on the right hindlimb\nPerform a longitudinal 3–4 cm groin incision with a #10 scalpel blade connected to a #3 scalpel handle in order to expose the right femoral neurovascular bundle. Use surgical scissors for blunt dissection until the bifurcation of the femoral nerve is exposed. Place a retractor inside the wound to keep the dissected musculature and skin out of the situs.\nTransect the exposed motor and sensory branches distal to the bifurcation and excise a 6 mm long nerve segment of each branch, respectively, using straight microsurgical scissors.\nRotate both nerve segments 180°, place them between the proximal and distal stump of the transected femoral nerve branches and perform epineurial neurorrhaphy at each site with two interrupted 11–0 sutures and a microsurgical needle holder.\n\t\tNOTE: Perform a homotopic autologous nerve graft by grafting the motor graft to the original motor branch and the sensory graft to the original sensory branch. Alternatively, perform a heterotopic autologous nerve graft by grafting the motor graft to the original sensory branch and vice versa.\nInduction of thoracic spinal cord contusion injury\nPerform a skin incision across the thoracic spinal column with a #10 scalpel blade connected to a #3 scalpel handle followed by two muscle incisions parallel to the spinous processes to facilitate muscle retraction. Place a retractor inside the wound to keep the dissected musculature and skin out of the situs.\nIdentify the 11th thoracic vertebra (Th) and expose the lamina of the vertebral arch by removing overlying tissue as well as the spinous process using a rongeur.",
    "Perform a laminectomy using a micro drill and an appropriate burr to drill a small hole into the lamina, slightly larger than the tip of the impactor. To prevent damage to the spinal cord, only thin out the lamina while opening and enlarging the hole using a rongeur. If the periosteum is still intact, carefully remove it using a sharp pointed probe without damaging the dura mater.\nAfter ensuring a large enough hole is made without destabilizing the lamina, hold the animal’s spinal column in place by clamping it rostrally and caudally to Th11 with the impactor’s stabilizing forceps. Using the hand wheels at the front and the side, position the steel rod 3–5 mm above the laminectomy hole. Finally, subject all animals to an impact with a defined force of 150 kilodyne to induce a mild to moderate degree of spinal cord contusion injury4.\nPerform wound closure in anatomical layers using polyglactin 4–0 or 5–0 interrupted sutures and a surgical needle holder. Clean the wound thoroughly by gently wiping it with a gauze pad soaked in sterile 0.9% NaCl.\nAfter surgery, return the animals to their home cage and shelter them from light and sound exposure. Monitor the animals’ behavior closely until postoperative day (DPO) 7 and assure sufficient food and water intake. If needed, provide additional fluid by subcutaneous injections (e.g., 10 ml NaCl 0.9%).\nProvide post-operative analgesia for a minimum of 2 days by means of, e.g., opioids (0.05 mg/kg bodyweight Buprenorphine subcutaneously (s.c.)) and/or antipyretics (4 mg/kg bodyweight Carprofen s.c.). If required, and in the case of the SCI model, also provide postoperative antibiotic therapy (7.5 mg/kg bodyweight Enrofloxacin per os (p.o.)).\nIn case of spinal cord injury, manually empty the rat’s bladder until spontaneous urination returns.\n4. Recovery from surgical interventions prior to gait analysis",
    "NOTE: Rats with sciatic nerve injury show the tendency to gnaw on their hind paws due to onset of painful neuropathy following nerve injury. This form of automutilation can result in autoamputation of toes or parts of the respective hind paw. Prefer Lewis rats over other rat strains in case when using the sciatic nerve injury model, as this rat strain shows a smaller tendency for automutilation31. Rats with sciatic nerve injury also show the tendency to develop contractures of the operated limb, which might result in their exclusion from the study due to interference with data acquisition. Such adverse events occur far less common in rats with femoral injury.\nInspect operated animals daily following surgery with particular attention on the status of their limbs and paws, respectively.\n\tNOTE: In rats with SCI, at the height of Th11, penile or rectal prolapse might can occur due to the impairment of the animals’ natural capability to urinate and defecate. These events are commonly defined as human endpoints of the study and imply immediate exclusion of the affected animal from the study.\nContinue postoperative analgesia until rats cease to display any pain-related symptoms.\nIn case of persistent pain, administer gabapentin (30–120 mg/kg bodyweight) p.o. to treat neuropathic pain.\n5. Preparation prior to performing automated gait analysis\nNOTE: The gait analysis system’s methodology is based on recording the animals from below while crossing a glass plate, which is illuminated by a green LED light. When the animals’ paws contact the floor, the area of the paw print is illuminated and recorded by a high-speed video camera. This data is then sent via an Ethernet cable to a computer running the gait analysis software. While individual footprints can be classified manually by the experimenter, the latest software version also features automatic footprint classification.",
    "Perform all testing procedures in the dark and in the absence of disturbing noises. Since rats are able to perceive supersonic frequencies, also verify that no sources are emitting such sounds.\n\tNOTE: Perform gait analysis either weekly or every other week, but do not test rats too frequently as especially Lewis rats tend to lose interest in participating in the procedure over time when they are exposed to a certain exercise too frequently. It is, however, required to train rats daily for 5 days prior to surgery to acclimate them to the testing environment and procedure.\nDuring training sessions and on the test day, prepare the behavioral test room by turning off all light sources, which could otherwise interfere with the automated gait analysis device’s camera. Place the computer screen necessary for data acquisition away from the camera to prevent its light from interfering with the camera.\nMake sure the device is installed in a stable position and in a way that prevents any form of vibration, as this will seriously interfere with the data acquisition procedure.\nBring the rats to the behavioral test room and acclimate them in their own home cage for at least 30 min before the test.\n\tNOTE: Whenever handling the animals, wear personal protective equipment such as a surgical gown or lab coat, gloves, and a mask.\n6. Performing automated gait analysis\nTraining sessions\n\tNOTE: During training, animals will undergo a learning curve, so it is recommended to adjust the training schedule gradually. Use food rewards (e.g., 1–2 pieces of breakfast cereal) to reward the animals after successful completion of each training session.\n\t\nOn the first day of training, gently lift the animal by holding it underneath its trunk and gently carry it to the walkway entrance.",
    "Place the animal in the entrance area and let it explore the opening of the corridor without any interference from the person carrying out the testing procedure.\n\t\tNOTE: Do not scream, whistle, blow at or poke the animal in an attempt to motivate it to cross the walkway. All such behavior will severely stress the animal and further complicate the data acquisition procedure.\nWait until the animal voluntarily crosses the walkway to reach its home cage. Sometimes, especially in untrained animals, this can take up to several minutes. On the first training day, the animal is neither expected nor required to make uninterrupted runs with uniform walking speed. Instead it should acclimate itself with the testing apparatus and procedure.\nOn the second day of training, accustom animals to enter the walkway without hesitation and, also to return to their home cage without hesitation. Some animals will probably already have learned to cross the walkway without interruptions, but this is still not required at the end of the second day.\nOn the third day of training, ensure animals learn to cross the walkway without hesitation, sniffing, or otherwise explorative movements. Ensure they walk with uniform speed.\nOn the fourth and fifth day of training, repeat the previous exercise to consolidate the testing procedure.",
    "NOTE: In case an animal does not acquire the necessary skill to cross the walkway properly by the end of the 5-day training period, add 2 additional days of training (e.g., the weekend). Also, consider performing up to 3 training sessions a day, separated by at least 2 h of resting between individual session. In 95% of the cases, the animal will have acquired the required training experience by the end of this extended training period. In the rare case an animal has still not acquired this skill after 7 days of training, it is recommended to postpone the planned experimental surgery session for at least 1 week and to repeat the aforementioned training regime.\n7. Data acquisition\nNOTE: The gait analysis system visualizes each paw print while the animal is walking and automatically analyzes various gait parameters such as Paw Print Area, Paw Print Intensity, Paw Swing Time, and Paw Swing Speed (Table 1). As the gait analysis system records all data based on the intensity generated by the animals’ paw prints, make sure the camera settings are adjusted according to the rats’ weight and size. Additionally, make sure the walkway is dry and clean prior to data recording to prevent any influence on data acquisition.\nBefore acquisition of any data, clean the walkway using commercial glass cleaner and a squeegee. Spray the glass plate several times and then wipe it with the squeegee to remove any particles from its surface. Also, clean the underneath. Make sure to remove any fluid from the ends of the walkway since the animals could otherwise step on it, which would affect the recorded data.",
    "Repeat the cleaning procedure whenever necessary, e.g., contamination of the walkway and before recording of data of a rat from a different cage. This is thought to prevent the animal from being distracted by their conspecifics’ scent.\nPrior to the very first data acquisition, adjust the camera settings fitting the animals’ weight. Confirm this by putting the lightest and heaviest animal on the walkway and choose a camera setting that enables good data quality in both cases. Adjust the Camera Gain, Red Ceiling Light, Green Walkway Light, and Green Intensity Threshold (GIT) to ensure optimal paw print detection.\n\tNOTE: Do not change the chosen settings after data acquisition has begun as this will hinder comparability of the acquired data. As an exception, the GIT can be changed during data classification, but this must be done for all trials uniformly.\nDefine and calibrate the walkway using the provided calibration sheet.\nChoose a registered camera listed in the Setup tab.\nClick on the Open Acquisition button which can be found in the Acquire tab.\nTake a snapshot of the empty, cleaned walkway, which will be used as a reference throughout the following data acquisition procedure.\nNote the status changing from Waiting for Snapshot to Ready for Acquisition.\nClick on the Start Acquisition button and notice the status change from Ready for Acquisition to Waiting for Run to Start.\nPlace a rat on the walkway and follow the animal’s movement on the computer screen. Note the status change from Waiting for Run to Start to Recording Run.",
    "NOTE: The software will automatically classify runs it deems compliant according to preset run characteristics with a green symbol, while non-compliant runs will be marked with a red symbol. The software automatically stops data acquisition when three compliant runs were recorded, but data acquisition can be continued by clicking on the Start Acquisition button again.\n8. Data classification\nNOTE: Refer to Table 1 for a list of AGA outcome parameters. At least three compliant runs are needed in which the animal must cross the walkway steadily without hesitation27. Additionally, running speeds should match within the same categories as defined in the literature30.\nClick on the Classify button in the Experimental Explorer tab of the respective trials that are to be classified.\nPlay the acquired run with normal speed to get an impression whether the data conforms to the requirements listed before.\nIn the left-upper corner, click on the Auto Classify button for automatic classification of paw prints by the software.\n\tNOTE: Although the software has a high rate of correct paw classification, it sometimes fails to assign a paw to the prints or assigns the wrong paw. Therefore, always double check the auto-classified paw prints afterwards.\nFor correct calculation of Normal Step Sequence Patterns (NSSPs), make sure that the classifying algorithm is not confused by non-visible paw prints, leading to flawed NSSP (Figure 1A). Therefore, only include the paw prints that are detectable while the contralateral paw is also visible for NSSP calculations, e.g., the left front paw (LF) and the right hind paw (RH) (Figure 1B).\nimgsrc://cloudfront.jove.com/files/ftp_upload/61852/61852fig01.jpg",
    "Figure 1: Exemplary AGA data, demonstrating the need for manual double checking of correct data classification. In case a detected placement of a front paw is succeeded by the detected placement of another front paw (A) the AGA software might confuse this with an uncoordinated walking pattern since no hind paws have been detected. Therefore, it is recommended to always double check and select an initial paw print, which is detected when the contralateral paw is also visible (B). Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/61852/61852fig01large.jpg]\n9. Calculating statistics\nNOTE: To adjust run data for weight gain related changes over time, it is strongly recommended to calculate a ratio of the experimental paw with a non-experimental (e.g., control) paw. Additionally, calculate the ratio to preoperative values of this paw-to-paw comparison for consideration of individual differences in paw use.\nClick on the View Run Statistics button to get a comprehensive overview on the run statistics.\nSelect File and Export to either export run statistics or trial statistics into a spreadsheet software."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}