{
  "id": 8642,
  "origin_website": "Jove",
  "title": "Evaluation of Synaptic Multiplicity Using Whole-cell Patch-clamp Electrophysiology",
  "procedures": [
    "All animal experiments are approved by the Animal Care Committee of The University of Western Ontario in accordance with the Canadian Council on Animal Care Guidelines (AUP#2014-031).\n1. Solutions\nSlicing solution \nRefer to Table 1 for the composition of the slicing solution.\nPrepare a 20x stock solution in advance and store it at 4 °C for up to 1 month.\nFor 1x slicing solution, dissolve NaHCO3, glucose, and sucrose in ddH2O, and add the 20x stock. Ensure the osmolarity is between 315-320 mOsm and store the solution for no more than 1 week at 4 °C.\nFill two beakers with 100 mL of slicing solution and cover them with parafilm. Chill the solution in a freezer until the solution becomes partially frozen (approximately 20 min in -80 °C freezer). Using a gas dispersion tube, bubble both beakers of slicing solution with 95% O2/5% CO2 for 20 min on ice.\ntable:\n﻿0,1,2,3,4,5\n,Solution Concentrations (mM),Solution Concentrations (mM),Solution Concentrations (mM),Solution Concentrations (mM),Solution Concentrations (mM)\n,Slicing,Normal aCSF,Low Ca2+ aCSF,Sr+ aCSF,Pipette/Internal\nNaCl,87,126,126,126,-\nKCl,2.5,2.5,2.5,2.5,8\nCaCl2,0.5,2.5,0.5,-,-\nSrCl2,-,-,-,2.5,-\nMgCl2,7,1.5,2.5,1.5,2\nNaH2PO4,1.25,1.25,1.25,1.25,-\nNaHCO3,25,26,26,26,-\nGlucose,25,10,10,10,-\nSucrose,75,-,-,-,-\nK-gluconate,-,-,-,-,116\nNa-gluconate,-,-,-,-,12\nHEPES,-,-,-,-,10\nK2-EGTA,-,-,-,-,1\nK2ATP,-,-,-,-,4\nNa3GTP,-,-,-,-,0.3\nTable 1: The composition of various solutions.\naCSF (for slice recovery and maintenance)\nRefer to Table 1 for the composition of the aCSF.\nPrepare a 20x stock solution in advance and store it at 4 °C for up to 1 month.\nFor 1x aCSF, dissolve NaHCO3 and glucose in ddH2O and add the 20x stock. Ensure the osmolarity is between 298-300 mOsm. Use the solution within 1 day.\naCSF (low Ca2+ for recording) \nRefer to Table 1 for the composition of the low Ca2+ aCSF.\nPrepare a 20x stock solution in advance and store it at 4 °C for up to 1 month.",
    "For 1x low Ca2+ aCSF, dissolve NaHCO3 and glucose in ddH2O and add 20x (CaCl2 and MgCl2 free) stock, CaCl2 and MgCl2 to specified concentrations. Ensure the osmolarity is between 298-300. Use the solution within 1 day.\naCSF (Sr2+ for recording) \nRefer to Table 1 for the composition of the Sr2+ aCSF.\nPrepare a 20x stock solution in advance and store it at 4 °C for up to 1 month.\nFor 1x Sr2+ aCSF, dissolve NaHCO3 and glucose in ddH2O and add 20x (CaCl2 and MgCl2 free) stock, SrCl2 and MgCl2 to specified concentrations. Ensure the osmolarity is between 298-300. Use the solution within 1 day.\nInternal solution\nRefer to Table 1 for the composition of the K-gluconate based internal solution.\nTo make 20 mL of internal solution, add 15 mL of molecular biology grade water to a 50 mL tube. Perform the subsequent steps on the ice.\nPrepare the following solutions ahead of time to 1 M stock concentrations in molecular biology grade water. Add (in mL): 2.32 K-gluconate, 0.24 Na-gluconate, 0.20 HEPES, 0.16 KCl, 0.05 K2-EGTA, 0.04 MgCl2 to the 50 mL tube.\nAdd 100 µL of 0.3 M Na3GTP.\nWeigh 44.08 mg of K2ATP in a 2 mL microcentrifuge tube and add 1 mL of molecular biology grade water, then add to 50 mL tube.\nAdjust the pH to 7.2-7.4 with 1 M KOH. Ensure the osmolarity is between 283-289 mOsm.\n2. Slice Preparation\nPrepare tools\nAdd 200 mL of aCSF to the recovery chamber (constructed from a 250 mL beaker with 4 wells and netting) and place the recovery chamber in a water bath (35 °C).\nCover the chamber with a paraffin film and constantly bubble the aCSF with 95% O2/5% CO2 using a glass dispersion tube for at least 20 min.",
    "Prepare for the dissection by setting up the tools (scalpel, angled fine scissors, forceps, fine paint brush, plastic spoon).\nFill a 60 mL syringe with approximately 15 mL of the ice-cold slicing solution from step 1.1.4.\nPrepare the dissection platform by placing a filter paper on the lid of a well plate.\nPrepare the slicing chamber by placing it in the ice tray and filling the tray with ice.\nSet up the vibratome by securing a disposable blade in the blade holder.\nMake a transfer pipette by breaking the tip of a Pasteur pipette and placing a rubber bulb over the broken end.\nDissect mouse brain\nAnesthetize the animal in a chamber saturated with 4% isoflurane until spinal reflexes are absent.\nDecapitate the animal using a guillotine and quickly remove the brain.\n\t\t\nMake a midline incision with a No. 22 scalpel blade from rostral to caudal.\nLaterally peel the scalp on each side of the head.\nUse fine scissors to cut the skull on one side from caudal to rostral (including the side of the frontal bones), using caution not to damage the brain.\nUse forceps to lift the skull piece off the brain and quickly cool the brain with 15 mL of ice-cold slicing solution using the syringe from step 2.1.4.\nLift the brain out of the skull.\nPlace the brain in one of the beakers filled with ice-cold slicing solution (from step 1.1.4) bubbled with 95% O2/5% CO2.\nPrepare slices of mouse hypothalamus\nBlock the brain for the desired brain area and cut angle (e.g., for coronal hypothalamic slices, trim off the tissue rostral to the optic chiasm and caudal to the pons using a blade and ensure the caudal block has a flat surface perpendicular to the base of the brain).",
    "Using a cut piece of filter paper, pick up the brain from the anterior side and glue the posterior side to the holding plate using instant glue.\nQuickly place the holding plate into the slicing chamber and fill the chamber with slicing solution from the second beaker in step 1.1.4.\nSecure the slicing chamber and ice tray on the vibratome.\nDefine the slicing area (anterior and posterior to the brain) and begin slicing 250 µm thickness coronal slices. Recommended parameters: speed 0.10 mm/s, amplitude 2 mm.\nTrim the slices to the appropriate size for the desired brain area.\nRecover the slices at 35 °C for 30-45 min. Then, remove the recovery chamber from the warming bath and allow the slices to recover at room temperature for an additional 30 min. Keep slices at room temperature for the rest of the day and continue to bubble the bath constantly with 95% O2/5% CO2.\n3. Whole-cell Patch ClampRecording\nPull the patch pipettes\nUsing the suggested parameters for the whole-cell recording from the pipette puller’s manual, pull patch pipettes from thick walled glass to a pipette resistance of 3-5 MΩ.\nUsing a microsyringe (commercial or homemade), fill a pipette tip with filtered internal solution. To make a microsyringe, burn the tip of a 1 mL syringe and allow the tip to fall creating a long fine tip.\nObtain the whole-cell configuration\nPlace the recording pipette just above the slice and offset pipette current in the voltage clamp mode. Apply slight positive pressure to the pipette and lock the stopcock.\nSelect a healthy cell with an intact membrane and approach the cell with the pipette. The positive pressure should cause a slight disturbance in the tissue (i.e. a slow wave in the tissue when entering).",
    "Slowly continue to bring the pipette closer to the cell using a diagonal motion until the pipette forms a small dimple on the cell surface.\nRelease the positive pressure lock. The cell will begin to form a seal and the resistance will increase above 1 GΩ. In voltage clamp, hold the cell at -68 mV.\nSlightly pull away from the cell diagonally to remove excess pressure from the cell.\nCompensate for the fast and slow pipette capacitance.\nApply a brief suction through the tube connected to the pipette holder to break through the cell and obtain whole-cell configuration.\nSwitch to Cell mode on the membrane test window in an electrophysiology Data acquisition and analysis software (e.g., Clampex).\nBefore each voltage clamp recording, perform a membrane test using the same software and record the relevant parameters in a lab book (membrane resistance, access resistance, and capacitance).\nMaintain the temperature of the recording bath at 27–30 °C and the flow rate at 1.5–2.0 mL/min for subsequent experiments.\n4. Multiplicity Experiments\nExperiment 1: estimating multiplicity using 4-AP\nIn voltage clamp, hold the cell at -68 mV. Using the same software, record the sEPSCs while perfusing the bath with low Ca2+ aCSF. Record for at least 5 min after the start of whole-cell configuration to ensure a stable baseline recording as the synaptic activity may be high shortly after the breakthrough of the membrane.\nUsing a micropipette, add 4-AP to the aCSF and bath apply 30 µM 4-AP. Record sEPSCs for at least 10 min to obtain the full drug effect.\nAdd 0.5 µM TTX and 10 µM Cd2+ to the aCSF with 4-AP and record the mEPSCs for at least 10 min.",
    "For offline analysis, use the last 1 min of baseline immediately before the application of 4-AP (in low Ca2+ aCSF), the 10th min of 4-AP application and the 10th min of TTX application.\nExperiment 2: desynchronize vesicle release using Sr2+\nWhile perfusing the bath with normal Ca2+ aCSF (the same as the bath aCSF) record sEPSCs for at least 5 min.\nSwitch from the normal Ca2+ aCSF and begin perfusing Sr2+ aCSF (from step 1.4) and record sEPSCs.\nFor offline analysis, to determine whether the large amplitude sEPSCs are due to the synchronous release of vesicles, compare the last 1 min of baseline (in normal aCSF) to the 10th minute of Sr2+ aCSF application.\nExperiment 3: test for multivesicular release using γ-DGG\nIn low Ca2+ aCSF record sEPSCs for at least 5 min.\nAdd 30 µM 4-AP to the aCSF through the perfusion system. Record sEPSCs for at least 10 min.\nAdd 200 µM γ-DGG to the aCSF with 4-AP and record the sEPSCs for at least 10 min.\nAs a control experiment in a separate cell, perform steps 1-3 but apply a low concentration (125 nM) of DNQX instead of γ-DGG.\nFor offline analysis, analyze the last min of each drug application.\nExperiment 4: Stimulate afferent inputs to increase action potential firing. \nRecord sEPSCs in normal Ca2+ aCSF.\nStimulate the afferents using a monopolar glass electrode filled with aCSF at a rate of 20 Hz for 2 s and repeat 10 times with an inter-burst interval of 20 sec.\nFor analysis, use the 5,000 ms before the first stimulus as the baseline and compare to the 10-300 ms after the final stimulus and then take the average amplitude and frequency change over 10 trials.\n5. Analysis",
    "Analyze sEPSCs and mEPSCs using a program that detects and analyzes synaptic currents (e.g., Mini Analysis software).\n\t\nUsing this software, use the suggested detection parameters for detecting AMPA Receptor EPSCs (or GABA Receptor EPSCs if recording inhibitory currents).\nUse the Nonstop Analysis function to detect EPSCs in the recording.\nManually scan each recording to ensure the program is accurately detecting each event (e.g., ensure events are not being missed or counted twice).\nExport the event data by copying it to the clipboard and paste it into a data management software (e.g., Excel)\nCalculate the average frequency and/or amplitude for each drug treatment and perform the relevant statistical analyses.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}