{
  "id": 15876,
  "origin_website": "Jove",
  "title": "Measurement of Protein Turnover Rates in Senescent and Non-Dividing Cultured Cells with Metabolic Labeling and Mass Spectrometry",
  "procedures": [
    "1. Preparation of quiescent cells and cells rendered senescent by exposure to ionizing radiation (IR)\nNOTE: Cellular senescence and quiescence can be induced using multiple methods, as described in detail elsewhere33,34,35. The stimuli used to induce senescence and quiescence may depend on the cell type of interest and the biological question under investigation. The cells used in this study are commercially available.\nThaw human diploid IMR-90 fibroblasts (~1 x 106 cells) from a cryovial and plate them in 20 mL of DMEM supplemented with 10% Fetal Bovine Serum (FBS) (Table 1) on a 150 mm plate.\nGrow the cells at physiological oxygen conditions (3% O2, 5% CO2, 37 °C) and expand the cultures in 10% FBS-containing media until sufficient replicates for quiscent and senescent cells have been established (at least 3-5 replicates are recommended per condition).\n\tNOTE: Culturing cells at physiological (3%) oxygen is ideal for primary human fibroblast cells, but suitable culture conditions for other cell types may vary and should be determined on a case-by-case basis.\nGenerate senescent cells by exposing proliferating cells to 15 gray (Gy) of ionizing radiation (IR).\n\tNOTE: Intensity of radiation exposure may vary according to cell type. While 15 Gy is used here, 10 Gy is also a commonly used radiation dose for fibroblasts; other cells, such as monocytes, may require a dose as low as 5 Gy. The dose is generally determined empirically by weighing viability against senescence induction.\n\t\nExpose the cells at 40%-60% confluence to IR in media containing 10% FBS.\nAfter IR exposure, change to fresh media containing 10% FBS.\nChange media (20 mL, containing 10% FBS) every 2 days for 8 days.",
    "NOTE: Cells are exposed to IR at lower confluency because IR-treated cells will expand in culture before they cease growing. In this experiment, cells were not split cells during the establishment of senescence, and while they became more confluent, they still displayed senescent cell markers at harvest. In fibroblasts, the senescent phenotype develops within 7-10 days.\nGenerate quiescent control cells by changing the media on plated proliferating cells to media containing 0.2% FBS (serum starvation) (Table 1).\n\t\nContinue growing cells that will be used for the quiescence control in media containing 10% FBS until day 4 after senescent cells are exposed to IR, splitting when necessary.\nOn day 4 after IR, change the media of quiescent cells to 20 mL of media containing 0.2% FBS (Table 1) and continue growing for another 6 days, changing media every 2 days.\n\t\tNOTE: Even in media containing 0.2% FBS, fibroblasts will continue to grow somewhat and may appear confluent by the end of the harvest. As a rule of thumb, aim to collect quiescent cells when they have reached confluency similar to that of the senescent cell cultures.\n2. Labeling of cells for pulsed SILAC and harvest of lysates\nChange media on both senescent and quiescent cells (12 plates) to SILAC Light (Table 1) and grow for 2 days.\n\tNOTE: This labeling helps reduce background noise since there is a low natural abundance of 13C and 15N. This step can be skipped in reagent-limiting conditions but will result in a slight overestimation of new protein synthesis.\nReplace media with SILAC DMEM (Table 1) for metabolic labeling.\n\tNOTE: SILAC DMEM media are specially formulated to contain purely light or heavy isotopes of arginine and lysine for metabolic labeling. They must not be substituted with standard DMEM formulations in substeps 2.2.1 or 2.2.2.",
    "For three senescent and three quiescent plates, replace media with 30 mL of SILAC Light (Table 1) and grow for 3 days without changing media.\nFor a minimum of three senescent and three quiescent plates, replace the media with 30 mL of SILAC Heavy (Table 1) and grow for 3 days without changing media.\n\t\tNOTE: There is an option at this point to harvest what will be the light-labeled cells immediately, rather than label them for an additional 3 days. For a single time point, it is preferable to label heavy and light-labeled cells for the same period as is done in this protocol to minimize batch effects.\nDetach the cells from culture plates by adding 5 mL of pre-warmed trypsin reagent to each dish and incubating for 5 min at 37 °C.\nResuspend the detached cells in 5 mL of the same media used for culture (either SILAC Light or SILAC Heavy) to a total volume of 10 mL.\nHarvest the cells for extraction of lysates and validation of senescence markers.\n\t\nFor each suspension, aliquot 0.6 x 106 of cells into 2 mL of media containing 0.2% FBS in a 6-well dish (two dishes, one for SILAC Light cultured cells and one for SILAC Heavy cultured cells) and place at 37 °C for overnight incubation.\n\t\tNOTE: These plates (substep 2.5.1) will be used for the detection of senescence-associated β-galactosidase (SA-βGal) activity (step 3.1).\nFor each suspension, aliquot 1 x 106 of cells into a microcentrifuge tube and spin down in a tabletop centrifuge at full speed for 1 min. Remove the supernatant and resuspend the pellet in 1 mL of phenol; at this step, RNA can be fully purified as described in the phenol supplier's manual or stored long-term at -80 °C.",
    "CAUTION: Phenol is corrosive and should be handled exclusively in a hood with gloves and a lab coat.\n\t\t​NOTE: The extracted RNA will be used for the detection of mRNAs encoding SASP factors using reverse transcription (RT) followed by real-time, quantitative (q) PCR (RT-qPCR) analysis (step 3.2). Another reliable assay for senescence induction is a test for 5-ethynyl dihydroxy uridine (EdU) incorporation, which indicates the presence of proliferating cells. The absence of proliferation can be used to confirm quiescence and senescence.\nTransfer the remaining cells to ice and spin down at 300 x g and 4 °C.\nRemove the supernatant and wash the cells twice in 1 mL of cold PBS to remove media/trypsin and exogenous protein contamination from fetal bovine serum from the culture medium.\nSpin down the cells again, remove the supernatant, and proceed to lysis.\nResuspend the cell pellets in 150 µL of freshly prepared 8 M urea 50 mM ammonium bicarbonate Lysis Buffer (Table 1), and mix by pipetting up and down.\nSonicate the lysates in a water sonicator for 2.5 min with 30 s on/off at medium power at 4 °C.\nTransfer the lysates to a pre-heated 95 °C heat block and denature for 4 min.\nSpin down the lysates; lysates can now be stored at -80 °C or used immediately for quantification.\nMake a 30 µL stock of 1:10 dilutions for each lysate in Lysis Buffer.\nMeasure the protein concentration with the BCA Assay Kit using a standard curve prepared in 1/10x Lysis Buffer diluted in ddH2O. Lysates can now be stored at -80 °C indefinitely.\n3. Validation of senescence by senescence-associated β-Galactosidase (SA-βGal) activity and RT-qPCR analysis of senescence-associated mRNAs\nNOTE: The starting material for these steps is collected during step 2.5",
    "Starting from the 6-well plates that were set up in substep 2.5.1, analyze cells for SA-βGal activity using the Senescence β-Galactosidase Staining kit following the manufacturer's protocol. Visualize staining under brightfield with color enabled, as previously described36.\n\tNOTE: SA-βGal is quantified by comparing the percentage of positive cells (visible blue color) in senescent versus quiescent control conditions. A minimum of 70% of cells should be SA-βGal positive for successful confirmation of senescence. Quiescent control cells should be less than 10% positive for SA-βGal.\nExtract the RNA from phenol suspension (substep 2.5.2) and analyze using RT-qPCR for increased levels of mRNAs encoding SASP factors (IL6, CXCL8, IL1B), cell cycle markers (CDKN2A/p16, CDKN1A/p21), and other indicators of senescence (loss of LMNB1 and PCNA).\n\tNOTE: RNA is unstable and should therefore be handled with RNase-free equipment, fresh gloves, and on ice unless otherwise noted in the protocol.\n\t\nStarting from phenol suspension, add 200 µL of chloroform per 1 mL of phenol and spin down at 12,000 x g for 15 min at 4 °C.\nCarefully remove the aqueous phase and add 1:1 volume of isopropanol, 15 µg of glycogen co-precipitant, and then incubate at 4 °C for 10 min to precipitate RNA.\nAfter incubation, pellet the RNA by centrifugation at 12,000 x g for 20 min at 4 °C followed by a wash in 75% EtOH equal to 1 volume of phenol used. Resuspend the RNA in 50 µL of nuclease-free distilled water; RNA can be stored at -80 °C indefinitely.\nTo RNA samples, add 38 µL of nuclease-free distilled water, 10 µL of 10x DNAse reaction buffer, and 2 µL of DNase I followed by mixing.",
    "NOTE: Generating a common mix of all the reagents in substep 3.2.3 multiplied by the number of samples for treatment for equal distribution to samples is the best practice.\nIncubate DNase I-treated RNA samples at 37 °C for 30 min.\nRemove DNase from the samples using 1 volume of a phenol/chloroform/isoamyl alcohol (25:24:1) mixture by vortexing and spinning at max speed in a tabletop centrifuge for 5 min; the RNA will be contained in the aqueous phase.\nRepeat substeps 3.2.2 and 3.2.3 to precipitate RNA. Resuspend in 20 µL of nuclease-free distilled water; RNA can be stored at -80 °C indefinitely.\nGenerate cDNA from purified RNA by incubating 0.5-1.0 µg of purified RNA with 200 U of reverse transcriptase, 100 pMol random primers, and 10 mM of a dNTP mix in 1x reaction buffer supplied with the reverse transcriptase; incubate for 10 min at 25 °C, then for 30 min at 50 °C, with a final inactivation step at 85 °C for 5 min.\nAnalyze cDNA from the RT step (substep 3.2.3) from quiescent control and senescent cells using real-time, quantitative (q) PCR analysis to assess the level of mRNA markers known to be increased (CDKN2A/p16, CDKN1A/p21, IL1B, IL6, and CXCL8 mRNAs) or decreased (LMNB1 and PCNA mRNAs) with senescence as described elsewhere. ACTB mRNA, encoding the housekeeping protein β-Actin, is often a good mRNA to normalize differences in the input material. The primers used are in Table 2.\n\t\tNOTE: Relative RT-qPCR analysis is dependent on assumptions of equal binding efficiency between the target primer pairs and a reference primer pair. These assumptions should be tested for new primer sets as detailed elsewhere37. Additionally, reference markers should be constant between the cell types being compared, and several additional options for senescent cells have been previously identified38.\n4. In-solution trypsin digestion",
    "NOTE: From this point onward, it is critical to use mass spectrometry-grade buffers, solvents, and chemicals to prevent interference from impurities during mass spectrometry analysis. All buffers should be composed of ingredients suited to liquid chromatography tandem mass spectrometry analysis, including water and acetonitrile. Refer to the Table of Materials for a list of suitable chemicals and solvents.\nAliquot 50 µg of each protein sample into new tubes and bring to equal volumes with Lysis Buffer.\nTo each sample, add DTT to a final concentration of 20 mM to reduce disulfide bonds.\nIncubate the samples at 37 °C for 30 min with shaking, and then allow the samples to cool at room temperature (RT, ~10 min).\nAdd iodoacetamide to a final concentration of 40 mM to irreversibly alkylate the sulfhydryl groups that were reduced in the previous step. Incubate the samples at RT in the dark for 30 min.\nDilute each sample to below 1 M Urea with a buffer composed of 50 mM ammonium bicarbonate. Check whether the pH is approximately 8 by pipetting a small amount of sample on pH strips.\nAdd 1 µg of trypsin to each sample for 50 µg of starting protein, or at 1:50 trypsin:protein ratio, by mass, if digesting a different protein quantity. For example, 3 µg of trypsin would be added for the digestion of 150 µg of protein.\nIncubate the samples overnight at 37 °C with shaking to digest proteins into peptides.\nAdd formic acid to 1%, by volume, of each sample to quench the protein digestion.\n\t​NOTE: The experiment can be paused here. Freeze the samples at -80 °C and continue to the next step at a later date if necessary.\n5. Sample clean-up with solid-phase extraction (SPE)",
    "NOTE: This solid-phase extraction protocol requires solid-phase extraction cartridges and a vacuum manifold setup. Other equivalent solid-phase extraction (SPE) protocols can be carried out at the researcher's discretion prior to mass spectrometry analysis.\nPrepare for SPE by placing solid-phase extraction cartridges on a vacuum manifold, using one extraction cartridge for each sample.\n\tNOTE: Refer to the manufacturer's guidelines for the amount of sorbent to be used in the SPE protocol. For 50 µg of peptide samples, it is recommended to use 10 mg sorbent cartridges.\nCondition each SPE cartridge by adding 800 µL of SPE Elution Buffer (Table 1) and use vacuum suction to draw the solvent through the cartridge.\nRepeat step 5.2.\nEquilibrate each cartridge by adding 800 µL of SPE Wash Buffer (Table 1) and use vacuum suction to draw the buffer through the cartridges.\nRepeat step 5.4 two additional times for a total of three times.\nLoad the peptide samples into SPE cartridges and use vacuum suction to draw samples through the cartridges.\n\tNOTE: At this point, peptides are bound to the sorbent inside the cartridges.\nWash each cartridge with SPE Wash Buffer and use vacuum suction to draw the buffer through the cartridges.\nRepeat step 5.7 two additional times for a total of three washes.\nPrior to the elution step, arrange collection tubes within the vacuum manifold below each cartridge, carefully ensuring alignment between the collection tubes and cartridges.\nTo elute peptides, add 800 µL of SPE Elution Buffer to each cartridge and elute peptides into collection tubes with vacuum suction.\nRepeat step 5.10 with 400 µL of SPE Elution Buffer.\nRemove the peptide samples from the vacuum manifold and dry completely in a vacuum concentrator (drying takes approximately 3 h).",
    "​NOTE: The experiment can be paused here. Freeze samples at -80 °C and continue at a later date if necessary.\n6. Data-dependent acquisition (DDA) mass spectrometry analysis\nResuspend the peptide samples at a concentration of 400 ng/µL in a buffer composed of 0.2% formic acid in water.\nTo aid in re-solubilization of peptides, vortex the samples for 5 min. Then, sonicate the samples for 5 min in a water bath sonicator.\nPellet any insoluble materials by centrifuging samples at 15,000 x g for 15 min at 4 °C. Transfer the peptide supernatants into MS vials.\nAdd indexed retention time (iRT) peptide standards of choice to each sample at a concentration of 1:30 iRT:sample, by volume.\nSubmit the samples for proteomic analysis using liquid-chromatography tandem mass spectrometry (LC-MS/MS) analysis.\n\t\nUse LC-MS/MS settings recommended for untargeted analysis by the mass spectrometry facility. Example settings for analysis are shown in Figure 3, configured for analysis on an Orbitrap mass spectrometer coupled to a nano liquid chromatography system in nano-flow mode. An example protocol follows.\nLoad 1 µg (5 µL) of each sample onto a trap column (1 cm long x 100 µm diameter) and wash them with Loading Solvent (Table 1) at a flow rate of 10 µL/min for 5 min.\nLoad the samples onto an analytical column (50 cm long x 100 µm diameter) with a 400 nL/min flow rate.\nElute the peptides over a 90 min linear gradient with an organic solvent (0.2 % formic acid and 99.8% acetonitrile) and inorganic solvent (0.2% formic acid in 99.8% water), ranging from 5% to 35% organic solvent.",
    "Acquire mass spectrometry data in data-dependent mode with a continuous cycle of MS1 survey scans (60,000 resolution, 3e6 AGC target, 100 ms maximum accumulation time, and 400-1,600 m/z mass range) followed by 20 data-dependent MS2 scans (15,000 resolution, 1e5 AGC target, 25 ms maximum injection time, and 1.6 m/z width isolation windows) with HCD fragmentation (normalized collision energy of 27%).\nFollowing MS acquisition of all samples, import raw mass spectrometry files into a mass spectrometry proteomics analysis software tool for identification and quantification of peptide peak areas.\n\t​NOTE: For the identification of peptides and proteins in this experiment, the Mascot database searching tool was used with the reviewed UniProt human proteome sequence database (Proteome ID: UP000005640). The following search parameters were specified in Mascot:\n\t\nQuantitation: SILAC K+8 R+10 [MD] Enzyme: Trypsin/p Fixed modification: carbamidomethyl (C)\nVariable modifications: acetyl (Protein N-term), Gln->pyro-Glu (N-term Q), Oxidation (M), Label:13C(6)15N(2) (K), Label:13C(6)15N(4) (R)\nPeptide mass tolerance: 10 ppm\nFragment mass tolerance: 0.08 Da\nMax missed cleavages: 2\nAll the unspecified parameters were default\nQuantify the peptide peak areas for heavy and light peptides in proteome quantitation software tool. For the quantification of peak areas in this experiment, the free and open-source Skyline software platform was used39,40. Export heavy and light peptide peak areas for estimation of protein half-lives.\n7. Calculation of protein half-lives\nOpen the SILAC Analysis Workbook (Table 3) to the first sheet named 1) Raw Data and paste in UniProt IDs, gene names, heavy peak areas, and light peak areas into the indicated columns (SH = Senescent-Heavy, SL = Senescent-Light, CH = Control (quiescent)-Heavy, CL = Control (quiescent)-Light).",
    "Open sheets 2-4 and ensure that the UniProt ID and Gene columns match the number of proteins identified from the analysis (these experiments identified 841 proteins). The rest of the columns will automatically fill with data after they have been dragged to cover the identified proteins.\nOpen the fourth sheet named 4) Analysis and remove rows where columns G and H indicate that the sample is out of range; keep rows that read within range. The volcano plot in the fifth sheet will automatically populate."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}