{
  "id": 5876,
  "origin_website": "Bio",
  "title": "Mandibular Explant Assay for Investigating Extrinsic Stimuli on  Bone and Cartilage Development",
  "procedures": [
    "Embryos (E10.5-E11.5) extraction   Perform euthanization via CO2 followed by cervical dislocation on a pregnant female mouse (see Note 1). All animal procedures were approved by the Animal Welfare Committee (AWC-16-0068) at the University of Texas Health Science Center at Houston and followed the National Institute of Health guidelines as described by Metwalli et al., 2017.   Transfer the animal to a clean procedural room.   Spray ethanol (70%) on the abdominal area of the female.   Use scissors to cut the abdominal skin from the lower abdomen to the epigastric region. Perform the cut at the midline of the abdomen.   Pull the uterus out of the body and cut the connective tissue. This will separate the uterus from the fallopian tubes and ovaries.   Keep all embryos together in the uterus sack.   Place the sack in a Petri dish with cold 1x PBS (15-20 ml, see Recipe 1).   In a sterile hood, separate the embryos by cutting the uterus between the embryos.   Transfer all embryos to a new Petri dish with 1x PBS (15-20 ml) at RT to wash and remove excess blood.   Open the amniotic sac and separate the placenta from the embryos, severing the umbilical cord near the embryo.   Place the embryo in a 15 ml test tube.   Wash each embryo twice with 5 ml of 1x PBS (see Note 2).      Mandibular extraction   In a sterile cell culture hood, dissect the mandibular processes of the first pharyngeal arch under a stereomicroscope while in BGJb culture medium at RT.   Pre-warm BGJb culture medium and mandibular explant media (see Recipe 2) at 37 °C. Add 1-2 ml of PBS at RT to the exterior portion of the center-well organ dish and 0.5 ml of the mandibular explant media to the center-well of the organ dish.   Orient the embryos in a supine position.",
    "Using a scalpel, cut through the labial commissure of the mouth at each corner of the mouth in order to separate the mandibular process from the head of the embryo (see Figure 1).   imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171130/20171130015113_6225.jpg Figure 1. A murine embryo at E11.5 used for dissecting the mandibular process for ex-vivo assay. The first cut was done at the commissure of the mouth all the way to the hind-brain (A). The second cut was performed at the top of the neck to separate the mandibular process from the rest of the body (B).    Make another cut through each embryo’s neck using a scalpel to completely separate the mandibular process from the rest of the embryo.    Place a single stainless steel mesh across the center-well organ dish, so it is submerged in the mandibular explant media (see Figure 2 and see Note 3).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171130/20171130015317_3288.jpg Figure 2. Design of mandibular explant on organ-well culture plate    Lay filter paper on top of the metal mesh sheet and allow the filter paper to be submerged in the mandibular explant media (see Note 4).   Place explants in the center of the filter paper.   Place the Petri dish in a CO2 incubator at 37 °C.    Replace the media (0.5 ml) in the center-well with pre-warmed (37 °C) fresh mandibular explant media every 12 h for the first 24 h and then once a day after the first 24 h.    After 12 h of incubation, treat the mandibular sections with 100 mg/ml of 6-aminonicotinamide in mandibular explant media for 3 h. In our study, the 6-aminonicotinamide treatment was used in the experimental samples as a teratogen to the explant (see Note 5) in order to disturb proper tissue development.    After 3 h treatment, replace the media containing the teratogen with fresh pre-warmed (37 °C) mandibular explant media.",
    "In our case, after the teratogen treatment, the experimental mandible samples were treated with 2 mm-diameter agarose beads containing 0.1 μg/ml of endothelin-1 (Edn1) peptide for 8 h in the CO2 incubator at 37 °C (see Note 6). The Edn1 was applied to test whether Meckel’s cartilage and the surrounding tissues are responsive to this signaling molecule and if it would rescue the phenotype of genetic mutations.   After the 8 h treatment, remove the media and the agarose beads that contained Edn1 peptide.   Replace the media (0.5 ml) in the center-well with pre-warmed (37 °C) fresh mandibular explant media. After the first 24 h, replace the media once a day (see Note 7).    After 24-120 h, fix explants with 95% ethanol for 1-2 days at RT.    Replace the 95% ethanol with 2% KOH (see Recipe 4) for 2-4 h until the explant tissue becomes transparent.   Replace 2% KOH with Alcian Blue staining overnight at RT (see Recipe 5). Alcian Blue stains for acidic glycosaminoglycans found in cartilage.   Replace staining with 95% ethanol for 12-24 h at RT.   Replace the 95% ethanol with Alizarin Red staining (see Recipe 6) for 6 h (Figure 3) at RT. Alizarin Red will stain for calcium containing osteocytes.    Submerge explants in 20% glycerol and 1% KOH (see Recipe 7) to remove excess staining.    Replace solution with 100% glycerol to store at 4 °C. An antifungal such as Thymol may be added to the storing solution (optional).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171130/20171130015415_6547.jpg Figure 3. Ex-vivo mandibular explant models at E11.5. A. Embryonic mandibular explants extracted at E11.5 and cultured for two days. The image was taken from a side view. B. Alcian Blue stained mandibular explants for Meckel’s cartilage two days post-incubation. The image was taken from the top view of the mandible. C.",
    "Alcian blue and Alizarin red staining of mandibular explants after 4 days of incubation."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}