{
  "id": 6569,
  "origin_website": "Bio",
  "title": "<em>In vitro</em> Differentiation of Thymic T<sub>reg</sub> Cell Progenitors to Mature Thymic T<sub>reg</sub> Cells",
  "procedures": [
    "TregP cell isolationEuthanize mice by CO2 inhalation.Harvest thymi from mice into 5 ml Sort buffer in 6-well plates. The number of conditions tested and replicates determine the number of mice required for each experiment. In a simple experiment, 1 mouse can be used as this should provide 5-10 x 104 CD25+ and Foxp3lo TregP cells.Work in a clean biosafety cabinet from this point on.Mechanically dissociate thymi between frosted glass slides or favored method of mechanical dissociation.Transfer cells into 50 ml conical vial through 70 μm filter.Spin cells at 350 x g for 10 min, at 4 °C (keep thymi in individual 50 ml conical tubes).Resuspend cells in 1 ml depletion cocktail of biotin-labeled antibodies. This cocktail of antibodies should include anti-CD8 (1:200) and anti-Ter119 (1:200). However other optional depletion antibodies can be added to this cocktail such as anti-CD11b (1:200), anti-CD11c (1:200), anti-NK1.1 (1:200), anti-γδTCR (1:200) and anti-B220 (1:200).Incubate on ice for 20 min and cover to protect from light.Add 15 ml Sort buffer; spin cells at 350 x g for 5 min, at 4 °C.Count the cells and resuspend in Strepavidin microbead cocktail (~1 μl beads per 2-3 million cells diluted in Sort buffer to a final volume of ~400 μl/thymus).Incubate for 20 min at 4 °C (agitate by swirling tube gently after 10 min).Add 10 ml Sort buffer; spin cells at 350 x g for 5 min, at 4 °C.Pre-rinse LS columns (1 column/thymus) with 3 ml cold Sort Buffer.Resuspend cells in 2 ml Sort buffer.Apply cells from individual thymus to separate LS columns on QuadroMACS Miltenyi separator magnet through a filter (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190813/20190813094716_7762.jpgFigure 1. Schematic of in vitro TregP differentiation assay workflow. First, thymi are processed and enriched for CD4 single positive (CD4SP) thymocytes.",
    "This fraction is stained for surface markers then each TregP is isolated by FACS. Isolated TregP are stimulated with cytokine in 96-well plate for a pre-determined time. These cells are then harvested and analyzed by flow cytometry for upregulation of Foxp3 and/or CD25.Wash columns 3 times each with 3 ml cold Sort buffer.Collect unbound fraction in 15 ml conical vials; spin cells at 350 x g for 5 min, at 4 °C.Combine cells into a single 15 ml conical tube; apply surface staining cocktail [CD4 (1:200), Live-Dead (1:1,000), CD25 (1:200), CD73 (1:100) and Streptavidin-APC-eF780 (1:200)]. The Streptavidin-APC-eF780 is used to detect biotin-conjugated antibodies used for magnetic depletion, including CD8, Ter119 and any other optional antibodies included from Step 7 above.Incubate on ice for 20 min and cover to protect from light.Add 14 ml Sort buffer; spin cells at 350 x g for 5 min, at 4 °C.Resuspend cells in 1 ml Sort buffer and filter cells through a 70 μm filter into a new, pre-chilled 15 ml conical; wash the filter with Sort buffer to bring cells to appropriate final volume.Set up gates on FACS Aria II for sorting TregP cells as described in Figure 2.Collect CD25+ and/or Foxp3lo TregP cells into separate 5 ml round bottom tubes with 1.5 ml Catch buffer (1x PBS + 50% FBS).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190813/20190813095941_4018.jpgFigure 2. Flow cytometry gating strategy for sorting TregP. A. Flow cytometry gating scheme for sorting TregP from CD8/Ter119 depleted thymocytes. DUMP channel contains CD8, Ter119 (these are labeled with biotin conjugated antibodies during magnetic depletion that are probed with APC-eF780-conjugated streptavidin) and Live-Dead. CD73+ cells represent recirculating and long-term resident TregP and Treg. Thus sorting CD73- thymocytes ensures analysis of de novo developing TregP. B. Post-sort purity analysis of CD25+ TregP (top) and Foxp3lo TregP (bottom).",
    "Stimulation of TregP cellsMake stimulation media (example: 2 U/ml IL-2 in cRPMI for a final concentration of 1 U/ml).Plate 100 μl of stimulation media into each well of non-TC treated round bottom 96-well plate.Place the 96-well plate in 37 °C incubator.Fill 5 ml round bottom tubes containing sorted TregP cells with cRPMI, spin cells at 350 x g for 5 min, at 4 °C.Resuspend cells at 1-2 x 105 cells/ml in cRPMI.Add 100 μl of cells to 100 μl stimulation media in 96-well plates (plate 1-2 x 104 cells/well).Place the 96-well plates into 37 °C incubator.Incubate for 24-72 h (we perform these assays for 72 h typically but CD25 and/or Foxp3 upregulation can be observed at earlier timepoints).Analysis of in vitro TregP differentiation assayAdd 100 μl FACS buffer to each well of stimulated TregP.Spin cells at 350 x g for 5 min at 4 °C.Decant supernatant and add 200 μl FACS buffer.Spin cells at 350 x g for 5 min at 4 °C.Resuspend cells in 50 μl staining cocktail [anti-CD4 (1:200), anti-CD8 (1:200), anti-CD25 (1:200), Live-Dead (1:1,000)].Incubate on ice for 20 mins and cover to protect from light.Add 200 μl FACS buffer.Spin cells at 350 x g for 5 min at 4 °C.Resuspend each sample in FACS buffer/counting bead master mix (190 μl FACS buffer + 10 μl counting beads/sample).Analyze differentiation of TregP to mature Treg cells (typically co-expression of CD25 and Foxp3)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}