{
  "id": 3914,
  "origin_website": "Cell",
  "title": "Isolation of adult mouse microglia using their in vitro adherent properties",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIsolation of adult mouse brain\nTiming: [5–10 min]\nImmediately isolate the brain of a freshly culled adult C57/BL6J mouse, and dissect the brain region of interest from which you wish to culture microglia.\nQuickly euthanize adult mouse via cervical dislocation\nCritical: All animal handling and euthanasia must be conducted in accordance with guidelines approved by an animal ethics committee.\nNote: The following steps (2–4) should be carried out as quickly as possible (ideally <5 min), to minimize cell death.\nDecapitate the mouse, and immediately immerse the head in 80% ethanol for sterilization\nRemove the skin and skull using sterile dissection tools (Troubleshooting 1)\nCarefully remove the brain and place it into a petri dish containing ice-cold (4°C) dissection media\nRemove the meninges\nNote: Failure to remove meninges may result in contamination of cultures with unwanted cell types. Remove the meninges quickly using sharp forceps under the dissecting microscope. Other studies (Roqué and Costa, 2017[href=https://www.wicell.org#bib4]) have achieved this via rolling the tissue over sterile filter paper, albeit in neonatal brain tissues.\nDissect brain region of interest\nNote: Here we only collected forebrain tissues for culturing, removing, and discarding the mid- and hind-brain, as well as the hippocampus.\nDissociation of brain tissue\nTiming: [45 min]\nDissociate the tissue via mechanical and enzymatic dissociation, filter, and re-suspend tissue-containing media into a flask.\nNote: These steps must be carried out inside a biological safety hood.\nPlace tissue into a pre-weighed falcon tube containing ice cold HBSS and record weight of tissue\nTransfer tissue to a sterile petri dish and wash with ice cold HBSS\nDice the tissue into small cubes < 1 mm3 using a sterile scalpel",
    "Using 5 mL at a time, add enzyme digestion mixture to the diced tissue in the petri-dish, collecting the media containing tissue fragments, and transferring this to a sterile Falcon tube. Use 10 mL of enzyme digestion mix per gram of tissue.\nCritical: For ≤1 g of tissue, use a 10 mL Falcon tube, for ≥ 1 g of tissue, use a 50 mL Falcon tube. This is to ensure the tissue remains submerged in the enzyme digestion mixture during step 11.\nIncubate for 15 min at 37°C whilst applying gentle agitation\nNote: We routinely use a MACSmix™ Tube Rotator, although equivalents can be used.\nTriturate the mixture ∼10 times, and re-incubate for a further 15 min at 37°C with gentle rotation\nTriturate the mixture a further ∼10 times\nCritical: Use a 10 mL strip pipette, and avoid being too vigorous with triturations as this can cause a decrease in cell viability (Troubleshooting 2).\nAllow undigested tissue to settle to the bottom, and then collect 5 mL of tissue-containing media at a time, passing this through a sterile 70 μm Nylon mesh filter into another sterile 50 mL Falcon tube\nPass a further 10 mL of warm complete media (per 1g of tissue) through the filter to rinse, making a final volume of 20 mL per 1 g of tissue\nCentrifuge the cell suspension at 170 × g for 5 min\nRemove the supernatant by gentle pipetting\nRe-suspend in 10 or 15 mL of complete media, and transfer into a non-coated T25 or T75 tissue culture flask, respectively. Incubate cells at 37°C, 5% CO2",
    "Note: Depending on the weight of the brain, or if you are pooling brains in a single culture preparation, choose either a T25 or T75 flask to re-suspend the cells. For the isolation of cells from a single brain, we recommend using a T25 flask. For the isolation of cells from pooled brains (>2), we recommend using a T75 flask.\nIsolation of pure microglial cultures\nTiming: [15 min]\n∗6–10 h later∗\nIsolate microglia by repeated tapping to remove non-adherent cells, leaving a pure culture of adherent, adult mouse microglia.\nCheck the T25 or T75 flask for microglia adherence using a bright field microscope. Microglia will appear phase bright and adherent to the bottom of the flask\nNote: Microglia may not be visible in some cultures due to a large amount of debris. In these cases, perform 1–2 full media changes of the flask with warmed complete media before observing microglial adherence (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/637-Fig1.jpg\nFigure 1. Debris removal by media changing\nRepresentative images of cell culture before (A) and after (B) full media change. Images taken on Olympus CKX53 bright field inverted microscope, 10× objective. Scale bar, 200 μm.\nTap the flask firmly and repeatedly to dissociate non-microglial cells\nCritical: Be careful not to allow any fluid to get into the filter at the neck of the flask.\nCheck for any adherent cells which are not microglia (non-phase bright cells) under the microscope (Figure 2[href=https://www.wicell.org#fig2]A)\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/637-Fig2.jpg\nFigure 2. Tapping to remove non-adherent cells and achieve pure microglial cultures\nRepresentative phase-images of cultures prior to tapping (A) containing non phase-bright pericytes (red arrows) and phase-bright microglia (white arrows). Following tapping (B), only phase bright microglia are present (white arrows). Images taken on Olympus CKX53 bright field inverted microscope, 10× objective. Scale bar, 200 μm.",
    "Remove all media containing floating non-adherent cells, discard, and replace with fresh, warmed complete media\nRepeat step 20–22 until only phase bright microglia appear, with all cells adherent to the bottom of the flask (Figure 2[href=https://www.wicell.org#fig2]B)\nNote: Depending on the weight of tissue dissociated, this may take 2–5 washes to achieve a pure culture.\nCritical: The purity of the microglial cultures will be highly dependent on how rigorously this step is performed. Ensuring that all non-adherent cells are tapped and washed off prevents contamination of cultures with other cells such as pericytes, but slightly decreases overall yield. Therefore, this step can be adjusted based on priority of yield vs purity.\nIncubate pure microglia cultures for 2–5 days in fresh complete media at 37°C, 5% CO2\nNote: Microglial cultures in T25 or T75 flasks should not need media changing in this time-frame, but if media appears discolored, replace ½ of the media with fresh complete media.\nHarvesting and plating\nTiming: [30 min]\nAfter 2 days, observe microglia under the microscope to assess morphology prior to harvesting for plating. Cells can be harvested if the microglia have spread out into rod-like and ramified morphologies (Figure 3[href=https://www.wicell.org#fig3]B)\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/637-Fig3.jpg\nFigure 3. Microglia must reach rod-like and ramified morphologies before harvesting\nRepresentative images of microglia which are still rounded (white arrow) and not yet ready for harvesting (A), and cells which have spread out into rod-like and ramified morphologies (red arrow) (B) and may be harvested for experimental use. Images taken on Olympus CKX53 bright field inverted microscope, 10× objective. Scale bar, 200 μm.\nCritical: Harvesting microglia too early (Figure 3[href=https://www.wicell.org#fig3]A) may result in low yield or cell death during plating or use in assays (Troubleshooting 2).\nRemove all media from T25 or T75 flask",
    "Add 1 mL (T25) or 3 mL (T75) of 0.5% Trypsin-EDTA (warmed to 37°C) and incubate for 2 min at 37°C\nRepeatedly firmly tap flask to aid in microglial detachment\nNote: Observe microglial detachment under the microscope, and if microglia are still adherent to the flask, proceed to step 29. If all microglia appear detached, proceed to step 30.\nCritical: It is advised to use 0.5% Trypsin-EDTA at this step, rather than the more commonly used 0.05%–0.25% Trypsin-EDTA. This is due to the highly adherent nature of adult mouse microglia in culture. Use of stronger trypsin often completely negates the need for step 29 (cell scraping), which has adverse effects on cell yield.\nUsing a sterile rubber cell scraper, gently pass the scraper over the bottom of the flask. Check for microglial detachment under the microscope. If microglia are still adherent, pass the scraper over an additional time to detach these cells\nAdd 4mL (T25) or 7 mL (T75) of complete media to stop the Trypsin-EDTA reaction\nCollect the 5 or 10 mL media containing the microglial cell suspension, and transfer to a sterile falcon tube\nCentrifuge at 170 × g for 5 min\nRemove the supernatant and re-suspend the cell pellet. Cells can be counted at this point, and subsequently used for plating, flow cytometry, or other experimental assays\nNote: Isolated adult mouse microglia can be plated in 96, 48, 24 or 6 well plates with no poly-D-lysine (PDL) or matrigel coating required due to their adherent properties but appear healthier when plated in larger wells. We recommend plating in 48 well plates for functional assays, at a density between 1.6 × 104 and 3.2 × 104 cells/cm2.",
    "Note: Like adult human microglia, adult mouse microglia have a limited proliferative capacity in vitro with approximately 5.5% Edu+ microglia present over 48 h (Figure 4[href=https://www.wicell.org#fig4]). Therefore, these cells cannot be passaged or re-plated, but can remain in culture for 1–2 weeks depending on the purity of the original culture.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/637-Fig4.jpg\nFigure 4. Isolated adult mouse microglia have a low proliferative capacity in vitro\nRepresentative fluorescent images of microglial cultures following the addition of Edu for 48 h (A). White arrowheads represent PU.1 positive microglia, whilst white arrows represent PU.1+ Edu+, dividing microglia. Red arrowheads represent PU.1- cells, whilst red arrows represent PU.1- Edu+ dividing non-microglial cells, which are largely pericytes. Scale bar, 50 μm. Average percentage of Edu+ microglia (PU.1+) per case, n = 6 adult mouse brain isolations (B). All data are plotted as mean ± SEM."
  ],
  "subjectAreas": [
    "Cell Culture",
    "Cell Isolation",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology"
  ]
}