{
  "id": 9997,
  "origin_website": "Jove",
  "title": "Ex Vivo Perfusion Culture of Large Blood Vessels in a 3D Printed Bioreactor",
  "procedures": [
    "This protocol describes the assembly and use of a system composed of two EasyFlow (bioreactor) inserts: one representing the reaction chamber (C), containing the perfused artery sample, and one functioning as a medium reservoir (R) (Figure 1 and Figure 2A). Carotid arteries were obtained from 4-6-week-old male and female piglets (6-12 kg) at The Pirbright Institute, UK. Animal procedures were carried out under the Home Office Animals (Scientific Procedures) Act (1986) (ASPA) and approved by the Animal Welfare and Ethical Review Board (AWERB) at The Pirbright Institute. The animals were housed in accordance with the Code of Practice for the Housing and Care of Animals Bred. All procedures were conducted by Personal License holders who were trained and competent under Project License PPL70/8852. Piglets were culled according to the schedule one method under the ASPA.\n1. Insert manufacturing\nFabricate the insert by 3D printing, using the provided 3D model (Supplementary File 1).\n\tNOTE: 3D modeling enables easy changes to the design to adapt to new applications. Alternative materials and alternative manufacturing techniques can also be used to produce the insert. Due to the complex inner structure, selective laser sintering and stereolithography are appropriate alternatives15. Polyamide 12 (PA12; see Table of Materials) is a good material candidate due to its superior performance in terms of liquid retention and resistance to repeated heat sterilization cycles16.\nFabricate the silicon gaskets and polycarbonate washers by laser cutting17, using the designs provided in Supplementary File 2.\n\t​NOTE: Laser cutting is easily outsourced and a cheap manufacturing method. Washers can be manufactured from stainless steel, providing a more resistant component for repeated use. All other components are commercially available items. A complete list of the required materials is provided in Table 1. The commercial details of the items are included in the Table of Materials.",
    "2. Device sterilization, assembly, and priming\nSterilize all components following the instructions in Table 1.\nUnder laminar flow conditions, assemble two fabricated inserts (step 1), as shown in Figure 1A.\nAssemble the perfusion system as in Figure 2, following the steps below:\n\t\nAttach two connected three-way valves to the reservoir's R1 port (media exchange port).\nConnect the resulting outlet to the peristaltic pump's head using a tube equipped with a one-way valve (one-way valve tube).\nConnect the pump head to the reaction chamber's C4 port using system tubing equipped with a one-way valve.\n\t\tNOTE: This branch can optionally be equipped with a pressure sensor enabling constant monitoring.\nConnect the reaction chamber port C1 to soft wall tubing, and this to the resistance channel (small inner diameter).\n\t\tNOTE: The length of the resistance tubing will greatly influence the pressure present in the system. This should be further investigated to ensure adequate perfusion conditions.\nExtend the resistance channel with the system tubing, creating a return channel and closing the luminal circulation loop by connecting to the reservoir at R5 (Figure 2C).\nCreate an overflow channel by connecting the reaction chamber C3 to the reservoir R3 with system tubing.\nAttach a ventilation filter through R2.\nCreate a pressure dampener by connecting a syringe containing air and media to the reaction chamber C6.\n\t\tNOTE: The correct air-to-media ratio will depend on the required pressure dampening.\nPrime the system with perfusion medium (Dulbecco's modified eagle medium [DMEM] + 10% [v/v] fetal bovine serum [FBS] + 1% [v/v] penicillin-streptomycin + 1% [v/v] amphotericin B + 30% [v/v] dextran; see Table of Materials) through the media exchange ports and the reservoir.",
    "​NOTE: Priming the system reduces the risk of trapped bubbles in the system and identifies any potential leaks. The recommended volume of media is about 100-120 mL. The volume used will depend on the dead volume of the tubing used for experimentation.\n3. Sample harvesting and preparation\nCollect the left and right common carotid arteries, minimizing direct handling of the arterial tissue13.\nPlace the tissue in cold transport media (DMEM+ 20% [v/v] FBS + 2% [v/v] penicillin-streptomycin + 1% [v/v] amphotericin B, see Table of Materials) for transfer.\nIn a laminar flow cabinet, remove the excess connective tissue and trim the ends of the tissue using a scalpel blade. Wash the tissue twice in cold transport media.\nPlace tissue on an orbital shaker in transport media for at least 30 min for thorough washing.\nConnect a non-branching segment of the artery to the bioreactor system using two barbed luer connectors and fix it in place using a vessel bond (vascular silicone ties; Table 1).\n\tNOTE: The vessel bond provides the proper tension and retraction to secure the vessel. The oval section prevents tissue damage.\nGently flow media through the artery to verify patency.\nAfter securing the artery to the fabricated insert, fill the reaction space with perfusion media (step 2.4). Finally, gently fill the luminal circulation loop with media to eliminate any remaining air from the system.\nConnect the reaction space with the previously assembled perfusion system (section 2), completing the circulation.\n\t​NOTE: It is recommended to perform a quality check by immunohistochemistry of processed tissue. This identifies any damage due to excessive handling during preparation.\n4. Perfusion culture and media change\nPlace the perfusion system in a 37 °C incubator with 5% CO2 and then connect it to a peristaltic pump (see Table of Materials)",
    "Connect any additional (facultative) acquisition systems, such as pressure sensors (see Table of Materials).\nLeave the system to equilibrate overnight with a low media flow rate of ~10-15 mL/min.\n\tNOTE: Initial experiments to determine pump settings, media flow, system pressure, and optimal pressure dampeners/clamps settings are required to ensure appropriate conditions are met.\nThe next day, increase the flow incrementally (+1 rpm every hour, equivalent to a ~2.5 mL/min increase every hour, in the current system) until the final flow rate (35 mL/min) is achieved. Monitor the system periodically for leaks.\n\tNOTE: To calculate the accurate flowrate based on the peristaltic pump speed, users must first perform adequate pump calibration18. Using the formula (1), volumetric flow rate (Q) can be calculated based on the volume dispensed (V) within a given time (t). To calculate the estimated flow velocity (imgsrc://cloudfront.jove.com/files/ftp_upload/65465/65465eq03.jpg) we can use the previously calculated flow rate (Q) and the area of vessel cross-section (A), described in equation (2).\nimgsrc://cloudfront.jove.com/files/ftp_upload/65465/65465eq01.jpg    (1)\nimgsrc://cloudfront.jove.com/files/ftp_upload/65465/65465eq02.jpg    (2)\nEvery 3 days, exchange 50% of the media (~50 mL) by connecting one syringe filled with fresh media to the media exchange port closer to the pump and an empty syringe to the port closer to the reservoir to collect the spent medium (Figure 2).\n\tNOTE: Using two three-way valves as media exchange ports facilitates the continuous operation of the perfusion during the medium exchange.\nAt the end of the experiment, harvest the tissue from the reaction chamber by trimming the ends connected to the bioreactor using sterile surgical scissors.\nDismantle, clean, and sterilize the system for further use.\n5. Sample analysis\nFix the harvested sample in 4% paraformaldehyde (PFA) overnight at 4 °C.\nEmbed the tissue in optimal cutting temperature (OCT; see Table of Materials)19 and freeze by immersion in iso-pentane cooled in liquid nitrogen.",
    "Obtain cryo-sections of 3-5 mm thickness using a cryostat.\nPerform immunohistochemistry (haematoxylin and eosin [H&E]) and/or immunofluorescence. Follow the typical immunofluorescence protocol:\n\t\nBlock the slices for 1 h at room temperature with 20% [v/v] goat serum in phosphate-buffered saline (PBS; see Table of Materials).\nIncubate the slices overnight at 4 °C with primary rabbit antibody against CD31 diluted 1:50 in PBS (see Table of Materials).\nWash three times with PBS for 5 min.\nIncubate for 1 h at 37 °C with fluorescently labeled goat anti-rabbit secondary antibody diluted 1:200 in PBS and α-smooth muscle actin (SMA) directly conjugated fluorescent antibody diluted 1:200 in PBS (see Table of Materials).\nWash three times with PBS for 5 min.\nStain the nuclei with DAPI diluted 1:1,000 in PBS for 10 min at room temperature.\nIncubate with 0.1% (w/v) Sudan Black (see Table of Materials) in 70% (v/v) ethanol for 10 min at room temperature to reduce tissue autofluorescence.\nWash the tissue with abundant deionized water. Mount the slides in the mounting medium.\nImage the samples with a confocal laser scanning microscope.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}