{
  "id": 13333,
  "origin_website": "Jove",
  "title": "Place and Response Learning in the Open-field Tower Maze",
  "procedures": [
    "This protocol is approved by the Institutional Animal Care and Use Committee of Christopher Newport University.\n1. Construction of the OFTM Apparatus\nConstruct the boundary wall (40 cm high and 183 cm diameter) from three pieces of white laminate. Construct the circular maze floor (183 cm diameter) from black laminate and glue it to a plastic table top. Secure the boundary wall to the edge of the table with screws and glue.\nDecorate the interior surface of the boundary wall: Leave one quarter solid white; Paint one quarter solid black; Paint one quarter with black stripes; Paint one quarter with black circles.\nBuild four “food towers” (8 cm x 8 cm x 20 cm; Figure 1A) cut from a square-shaped white PVC post. Glue a piece of black laminate (8 cm x 8 cm) to the top of each tower. Secure them to the maze floor with crazy glue 54 cm apart from each other.\nBuild three “pre-training towers” (5 cm, 10 cm & 15 cm high respectively; Figure 1B) from a square-shaped white PVC post. Glue a piece of black laminate (8 cm x 8 cm) to the top of each tower. These towers are taped to the maze floor only during the pre-training phase (described below).\nGlue one black opaque plastic food cup with a screw-top lid (= a clear plastic bead container painted black; 1.75 cm high and 3.75 cm diameter) to the top of each food tower. Drill three small venting holes (3 mm diameter) in each lid. The holes ensure that the rat cannot locate the “correct” food tower using olfactory cues. The height of the training towers ensures that the rat cannot locate the “correct” tower using the uncapped food cup as a visual cue.\nimgsrc://cloudfront.jove.com/files/ftp_upload/53227/53227fig1.jpg",
    "Figure 1. Photographs of the Open-field Tower Maze (OFTM). (A) The rat is able to find and retrieve a food reward from only one reward-baited “training tower” during acquisition, as well as all subsequent training and testing. (B) Three “pre-training towers” are placed in the center of the maze arena during pre-training. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/53227/53227fig1large.jpg]\n2. The OFTM Maze Room\nUse a lamp with a 60 W light bulb (Lumens: 800) to dimly illuminate the maze room. The lamp is located 3 ft above the floor and 2 ft to the side of the maze, facing toward the ceiling. Play white noise in the background (~70 dB) using a sound machine.\nMount a digital video camera to the ceiling above the maze to transmit video to a computer. Hang an opaque curtain to separate the maze from the computer monitoring area.\n3. Rat Handling, Food Restriction & Housing\nHave each experimenter handle all rats for seven days (4 min per day) prior to pre-training.\nPlace rats on a food restricted diet (1 hr of free-feeding per day). This diet ensures that rats will be motivated to retrieve rewards during training, while maintaining a healthy weight (~90% of free-feeding weight).\nDouble-house rats (if using females) throughout the duration of the experiment. Pair-housed female rats are less anxious than single-housed female rats12.\n4. Pre-training Procedures\nBait each uncapped food cup on the seven towers with a food reward (e.g., one piece of fruit cereal) inside.\nPlace a rat into the maze in a random location until it finds and consumes all seven food rewards before it is removed.",
    "If the rat does not retrieve all of the food rewards within 10 min, then remove it from the maze and give pre-training procedures again the following day. Note: some rats will take longer than others to initially learn to retrieve the food rewards from the top of the towers.\nIf a rat does not retrieve and consume all seven food rewards from the towers within the first two days of pre-training, give it additional 30 min sessions in the OFTM until the food rewards are retrieved. Typically, the rat will find and consume all the food rewards after one or two of these 30 min sessions.\n5. Place-training & Response-training Procedures\nAssign each rat two of four start locations. Counterbalance the following: the start location release point within and between each training day; the type of learning (place vs response); the “correct tower” for all the place learners; and the turn each response-learner is trained to make (right vs. left).\nAt the start of each training day turn on the noise machine and open the video recording program. Bait all four towers and cover three out of the four food cups, leaving the food reward on the “correct” tower exposed.\nOn each given trial, start video recording (refer to manufacturer’s user manual for instructions), then place the rat in the maze at its assigned start location. Then, go behind the curtain to observe the rat’s behavior on a computer monitor. Remove the rat from the maze immediately after it retrieves the reward or after 3 min have passed and stop video recording.",
    "For place-learning rats, always use the same “correct” food tower, and place the rat in one of two start locations. A place-learner solves the OFTM by finding a specific location using the spatial cues provided in the maze. For example, bait tower D (= the “correct” tower) and release the rat from start location ‘2’ or ‘3’ (solid arrows in Figure 2A, left), or bait tower A and release a rat from start location '1' or '4' (dashed arrows in Figure 2A, left).\nFor response-learning rats, switch the “correct” food tower depending on the start location. Response-learners solve the OFTM by learning to make a specific turn (e.g., always turn right), regardless of its starting location in the maze. For example, bait tower D and release the rat from start location ‘3’, or bait tower B and release that same rat from a start location ‘2’ (solid arrows in Figure 2B, left). For a different rat, bait tower B and release the rat from location ‘1’, or bait tower A and release that rat from location ‘4’ (dashed arrows in Figure 2B, left).\nGive all rats a total of 48 training trials across 12 days (four trials per day).\nimgsrc://cloudfront.jove.com/files/ftp_upload/53227/53227fig2.jpg\nFigure 2. Overhead Schematic Showing Place- and Response-Training & Testing Procedures. This figure shows the start and food reward locations for training place-learners (A, Left) and response learners (B, Left), and also the start and reward locations used during the start location switch test for place-learners (A, Right) and response learners (B, Right). Numbers indicate a rat’s starting location; gray squares represent food towers; solid and dashed lines point to the baited food tower. Start locations are counterbalanced within each training condition. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/53227/53227fig2large.jpg]\n6. Start Location Switch Testing Procedures",
    "After all the rats perform at their asymptotic level (~80% of correct first choice responding) carry out a “Start Location Switch Test” to test the persistence of the learned behavior.\nCounterbalance the novel start locations (i.e., the start locations that have not been previously used for the rat).\nFollow the procedures for each training trial described in protocol section 5 with the new start locations.\n\t\nFor a place-learning rat that originally was released from location ‘2’ or ‘3’ and had tower D as its “correct” tower, place the rat in either of the new start location '1' or '4' , while still baiting tower D (Figure 2A, right).\nFor a response-learning rat that was originally released from location ‘2’ or ‘3’ and learned to turn right to receive the reward (on towers B and D, respectively), place the rat in either of the new start location ‘1’ or ‘4’ and bait either tower A or C, respectively (which would still require the rat to turn right in order to find the food reward) Figure 2B, right.\nAdminister all rats eight start location switch test trials across two days (four trials per day).\n7. Data Analysis\nHave an experimenter who has not trained rats and does not know the treatment of each rat score video-taped trials by counting the number of responses a rat makes to find the “correct” tower on each trial (indicated by the rat rearing up over the food cup).\nCalculate the percent of times that a rat finds the reward on its first choice (% of first choice correct responses) within each training day. Construct learning curves using the percent of first choice correct responses across training days. Use the percent of first choice correct response for the statistical analysis.",
    "Calculate the number of trials it took the rat to reach the a priori set criterion to acquire the task (i.e., first choice correct responding on 8 out of 10 consecutive trials). Exclude rats from analysis that do not reach the a priori criterion.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}