{
  "id": 1782,
  "origin_website": "Cell",
  "title": "Preclinical testing of oncolytic adenovirus sensitivity in patient-derived tumor organoids",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIn this protocol, we first detail quantification of OAd genomes as a readout of viral replication inside PDOs 5 days after infection. This is a step that can be performed to prove replication capabilities of designed OAds when fluorescent tags are not incorporated in the viral genome. To compare OAd infectivity and cytotoxicity among different PDOs, we explain two complementary approaches to assess PDO cell viability after viral infection: the CellTiter-Glo® 3D Cell Viability Assay and an organoid formation assay. To perform the organoid formation assay, a sublethal dose of OAd is needed to allow for formation of enough organoids to be counted, so previous cell viability experiments may be needed to establish optimal experimental conditions.\nOrganoid harvesting for infection\nTiming: 1 h\nEither to evaluate viral replication or effects on cell viability, organoids are infected as whole entities, since in our experience, when infected as single cells, they have significant problems to recover. Even though variability between biological replicates can be an issue, this can be minimized by performing a cell count using 2 additional wells (see ‘before you begin[href=https://www.wicell.org#before-you-begin]’) to estimate the number of cells to seed. Prior to harvesting, it is very important to check organoids under the microscope and confirm similar confluency between wells used for infection and seeding. At this point, organoid diameter should not exceed 200 μm, as bigger sizes can lead to higher variability (troubleshooting 1[href=https://www.wicell.org#sec7.1]). The density to be expected in organoid cultures harvested is usually of about 50,000–100,000 cells/well.\nNote: Organoid harvesting and infection times have been calculated for 1 PDO line infected with 2 doses of 2 different OAds to be compared.\nThaw Matrigel aliquots needed on ice.",
    "Note: For a 500-μL aliquot to be thawed, 30–45 min are needed, so by the end of the infection protocol Matrigel should already be a pipettable liquid. Calculate the volume of Matrigel needed to seed the experiment to minimize freeze-thaw cycles. See Table 1[href=https://www.wicell.org#tbl1] for orientation on how much Matrigel will be needed.\ntable:files/protocols_protocol_1233_4.csv\nDF = dilution factor. Numbers are given for 1 dose of 1 OAd to infect 1 PDO line.\nPre-cool a centrifuge to 4°C.\nCritical: All centrifugation steps need to be performed in a chilled centrifuge to ensure that Matrigel is removed from PDOs during washes with basal medium.\nPrepare 15 mL-tubes with 10 mL of cold basal medium and keep them on ice.\nNote: Due to Matrigel density, a maximum of 3 wells of a 24-well plate (containing 150,000–300,000 cells) can be harvested in a single tube. If more organoids need to be collected, split wells into different tubes to perform the first centrifugation step.\nCritical: Collect organoids used for cell count and organoids used for OAd infection in different tubes (tube 1 or tubes 2 to X, respectively) and process them in parallel. Tubes should always be kept on ice unless otherwise stated.\nTake an aliquot of basal medium to prepare OAd dilutions. This can be kept at room temperature (20°C–25°C) inside the cell culture hood during organoid processing until use.\nHarvest organoids. Tube 1: 2 wells for cell count Tubes 2-X: 2–3 wells per tube for organoid infection\nRemove organoid growth medium from the wells without touching the Matrigel dome.\nAdd 500 μL of basal medium from the corresponding tube to each well to disaggregate the Matrigel dome with the help of a P1000 pipette, and collect the content into the tube.",
    "Note: Either F12+++ or F12+++B basal media can be used for this step. BSA present in F12+++B helps prevent attachment of organoids to the walls of the tube, which can lead to loss of cells during the process.\nRepeat step 5b 2–3 times until removing most of Matrigel remainders inside the wells.\nCentrifuge at 100g 5 min at 4°C.\nRemove supernatant carefully, trying to remove as much Matrigel as possible but without touching the pellet.\nNote: If organoids are not cleanly pelleted under a Matrigel layer, remove medium leaving the Matrigel and add 10 mL of fresh basal medium to repeat centrifugation in step 5d at higher speed (400g, 5 min, 4°C).\nDisaggregate organoids.\nNote: Organoids that will be used for cell count (Tube 1) are dissociated to single cells using TrypLE, while those used for infection with OAd (Tube 2) are mechanically disaggregated. See Figure 4 in Driehuis et al. (2020)[href=https://www.wicell.org#bib2] for examples of how organoids look like before and after disaggregation.\nResuspend the pellet of organoids in Tube 1 (cell count) in 1 mL TrypLE Select by pipetting up and down 10–15 times with a P1000 pipette to facilitate disaggregation.\nIncubate Tube 1 for 5 min at 37°C.\nDuring the incubation step, disaggregate organoids in Tube 2 (infection) mechanically. For that, resuspend the pellet in 2 mL of basal medium and use a pre-narrowed, pre-wet (with F12+++B) sterile glass Pasteur pipette to pipette the volume up and down 8–10 times and keep the tube on ice. Try not to create bubbles when pipetting.",
    "Note: For preparation of pre-narrowed glass Pasteur pipettes, after lighting a Bunsen burner, hold the pipette horizontally with both hands and roll it 3–4 times while keeping the tip in the flame. Make sure that the tip is equally narrowed by all sides, and that it has been reshaped to a quarter of its original diameter. Narrowed tips should be sterilized by autoclaving before being used. For pictures on how pre-narrowed pipettes look like, refer to Driehuis et al. (2020)[href=https://www.wicell.org#bib2].\nCheck the suspension in Tube 1 under a microscope. If big organoids are still visible, pipette up and down a few times and incubate 5 min more at 37°C.\nAdd cold basal medium up to 13 mL to Tube 1, and up to 10 mL to Tube 2.\nCentrifuge at 100g 5 min at 4°C. Like before, repeat the centrifugation step at a higher speed if organoids are not nicely pelleted.\nNote: During this time, thaw ready-to-use virus aliquots (stored at −80°C) on ice, and label one 1.5-mL tube for each experimental condition. E.g., for infection of 1 PDO with 2 doses of 2 different OAds (+ non-infected control), prepare 5 tubes.\nRemove the supernatant of both tubes carefully and resuspend each pellet in 1 mL of basal medium.\nNote: If more than 3 wells were harvested for infection (more than 1 tube for infection), this is the moment to pool all organoids together in a single tube, maintaining a proportion of 2 wells/mL. It is very important to maintain the same concentration of organoids in Tube 1 and Tube 2 to have a comparable cell number that can be used for calculations of the volume needed for infection and seeding.\nCount cells and calculate the volume of organoid suspension needed for OAd infection (VPDO).",
    "Note: The number of cells to seed in each well and the type of multiwell plate used varies depending on the assay to be performed after infection. For viral genome quantification, we seed 25,000 cells/well in a 24-well plate. For cell viability assessment using CellTiter-Glo 3D or organoid formation assay, we seed 5000 cells/well in a white-walled (with either white or clear bottom) or transparent 96-well plate, respectively.\nNote: Doses used for infection vary depending on the experiment to be performed. Generally, doses used to infect PDOs lie in a range between 0.2 MOI and 20 MOI. However, for organoid formation assay a lower dose may be needed to allow for enough structures to grow after infection and re-seeding. Try to add similar volumes of viral dilution to each tube. For this, preparation of several serial dilutions is recommended.\nOrganoid infection and plating\nTiming: 15 min (preparation of OAd dilutions) + 30 min (incubation with OAds) + 15 min (plating)\nSince adenoviruses are not able to cross Matrigel, infection of PDOs is performed in the absence of extracellular matrix, which is added right before seeding.\nTo infect organoids, both cell homogenate-derived supernatants or purified OAds can be used. However, for experiments that will be compared, the virus source used should be the same. Calculate in advance the volume of virus dilution needed for PDO infection (VOAd), considering that it should not represent more than 20% of the total volume to seed. For this reason, purified, high-titer (∼1·1010–1.1011 PFU/mL) OAds are preferred.\nAdd the volume calculated in step 7 (VPDO) to each of the prepared 1.5-mL tubes.\nBring the volume up to 700–800 μL with basal medium.\nCentrifuge at 400g 5 min at 4°C.",
    "During this time, prepare virus dilutions in basal medium according to calculated viral titers and doses to be used for infection.\nCritical: To accurately prepare dilutions, pipette the volume thoroughly to ensure homogeneous distribution of the virus. Try not to pipette volumes smaller than 2 μL.\nRemove the supernatant carefully, leaving organoids in the volume of basal medium needed to infect. We generally perform infections in a final volume of 10 μL per well to seed.\nNote: Remember that basal medium will represent 20% of the total volume to be seeded (the remaining 80% is Matrigel, which is added after infection), that is, 2 μL per well. When calculating how much volume to leave in the tube, also subtract VOAd to the total volume to avoid excessive dilution of Matrigel and virus. This will ensure that all PDO infections are performed in the same volume, guaranteeing that the contact between organoids and viral particles will be equivalent, and thus comparable, in all the tested conditions.\nAdd VOAd to each 1.5-mL tube.\nMix well by tapping with the finger or by carefully pipetting up and down.\nNote: Use the same mixing method (tapping or pipetting) for all the Eppendorf tubes in the experiment to further ensure comparable PDO-OAd contacts.\nIncubate 30 min at 37°C.\nCritical: During incubation, chill tip boxes in the refrigerator (4°C). This will prevent premature Matrigel polymerization inside tips during seeding.\nAdd Matrigel to each tube and mix well by pipetting, avoiding bubble creation.\nNote: Once Matrigel has been added, put the tubes containing PDOs and OAds on ice to avoid premature polymerization of Matrigel.\nSeed organoid-containing Matrigel drops (10 μL in 96-well plates, 50 μL in 24-well plates) (troubleshooting 2[href=https://www.wicell.org#sec7.3]).\nSeed drops of 80% Matrigel (diluted in basal medium) in triplicate to read background signals.",
    "Let Matrigel solidify for > 15 min at 37°C (in the incubator).\nAdd 90 μL (96-well plate) or 450 μL (24-well plate) of organoid growth medium to each well.\nOptional: If white-bottom plates are used, a representative well per condition can be seeded in a transparent 96-well plate for visual inspection of infected organoids before cell viability assessment (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1233-Fig3.jpg\nFigure 3. Bright-field images of PDAC PDOs infected with OAd\nRepresentative images of PDAC organoids infected with increasing doses of an oncolytic adenovirus (5 days after infection). Arrowheads indicate dead organoids. Scale bar, 200 μm.\nViral yield quantification\nTiming: 5 days (incubation with OAds) + 30 min (organoid harvesting) + 1 h (DNA isolation) + 2.5 h (qPCR plate preparation + run)\nOAd replication inside organoids can be assessed through the quantification of viral genomes by qPCR amplification of the adenoviral hexon gene in infected organoids. To this end, organoids infected with known doses from OAd stock (passage 1, P1) are grown for 5 days and lysed by freeze and thaw to release viral particles. After centrifugation of the lysate, a fraction of the resulting virus-containing supernatant is used to infect new organoids (passage 2, P2) and proceed as with P1.\nFor viral yield quantification, supernatants from both P1 and P2 are analyzed by qPCR for the presence of viral genomes. The detection of viral genomes in the P2 supernatant is a further proof of viral replication in organoids. Before starting, and for absolute quantification of OAd genomes, a standard curve of known viral genome copies must be generated. See ‘quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis]’ for calculations and instructions on how to build the standard curve.\nFor this procedure, organoids should be infected in a 24-well format to guarantee obtention of enough DNA for qPCR amplification.",
    "Prepare a cooling bath by adding dry ice and ethanol to an appropriate container.\nNote: Alternatively, organoids can be frozen by storing them in a −80°C freezer (even though the freezing process will be slower).\nHarvest each well of infected organoids (passage 1, P1) in a 2-mL tube, and 1 well of non-infected organoids as explained in the section ‘organoid harvesting for infection[href=https://www.wicell.org#sec3.1]’.\nNote: In the case of P1 organoids, for the washing steps, bring the volume up to 1.9 mL with cold basal medium (instead of 10 mL used when harvesting organoids in 15-mL tubes). In addition, after the 1st centrifugation step, remove all the supernatant carefully to resuspend the pellet in the basal medium.\nAfter the 2nd centrifugation step, remove the supernatant carefully and resuspend the pellet in 150 μL of cold basal medium.\nCritical: Organoids infected with different OAds should be resuspended in the same volume to ensure that viral genome concentrations will be comparable.\nPerform 3 freeze-thaw cycles to release viral particles from cells.\nTo freeze, put the tubes in the cooling bath.\nTo thaw, submerge the tubes partially in a 37°C water bath with gentle agitation.\nPause point: Pelleted organoids can be left frozen at −80°C (before 1st freeze-thaw cycle) to continue the protocol in the following weeks.\nCentrifuge at 1000g 5 min to remove cell debris.\nTransfer 120 μL of P1 supernatant to a new 1.5-mL tube. Not taking the whole volume of supernatant will prevent the transfer of any cell debris. From this volume of supernatant:\nUse 10 μL to infect harvested, non-infected PDOs (P2) as explained in steps 8–19, treating this supernatant as VOAd. Add 10 μL of basal medium and 80 μL of Matrigel to perform a 1:2 split, seeding organoids in 2 wells of a 24-well plate.",
    "Save 25 μL of P1 supernatant to perform DNA extraction (step 27).\nPause point: Supernatants can be frozen at −20°C or −80°C to isolate DNA from P1 and P2 organoids in parallel.\nAfter 5 days, repeat the process described in steps 20–25 to obtain 120 μL of supernatant containing viral particles produced by P2 PDOs.\nOptional: The supernatant derived from P2 organoids can also be used to infect new PDOs (10 μL per well of PDOs growing in a 24-well plate) and obtain viral particles released in subsequent passages.\nIsolate DNA from P1 and P2 supernatants using the Blood DNA Isolation Mini Kit following the manufacturer's protocol. Since the starting volume required for this kit is 200 μL, bring the supernatant sample up to this volume by adding PBS.\nPause point: Isolated DNA can be stored at 4°C (a few days) or −20°C (months) for further qPCR analysis.\nQuantification of viral genomes by qPCR amplification of hexon gene.\nPrepare a qPCR master mix and add 9 μL to each well of a 384-well microplate. For each sample:\nqPCR master mix: 5 μL SYBR Green 2X + 0,3 μL Hexon Primer Mix 10 μM (Fw + Rv) + 3,7 μL Nuclease-Free H2O\nNote: Extra master mix volume should be prepared, considering that each sample needs to be run in triplicate. As a rule of thumb, make a master mix for 1 extra well for every 9 wells to be prepared.\nCritical: Protect the master mix from light with aluminum foil and keep it on ice while working.\nAdd 1 μL of isolated DNA into corresponding wells, trying to minimize bubble formation.\nCarefully seal the microplate with an optical adhesive film.\nOptional: Centrifuge the microplate briefly to ensure that the volume is correctly placed at the bottom of the wells.",
    "Insert the microplate in a qPCR system (e.g., ViiA 7 Real-Time PCR System).\nAssign samples and targets to corresponding wells and start the qPCR program:\ntable:files/protocols_protocol_1233_5.csv\nQuantify OAd genomes as explained in ‘quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis]’. Detection of OAd genomes in the different passages is indicative of OAd replication within cancer cells (Figure 2[href=https://www.wicell.org#fig2]).\nCell viability assessment\nTiming: 5 days (incubation with OAds) + 1 h (CellTiter-Glo 3D assay) or 24 h (Organoid formation assay)\nAdenoviruses complete their lytic infection cycle in 36 h. To observe effects on cell viability derived from the infection of organoids by newly formed viral particles, organoids are incubated with OAds for 5 days (120 h), allowing for the completion of 3 viral cycles (Figure 3[href=https://www.wicell.org#fig3]).\nCell viability (CellTiter-Glo® 3D Cell Viability Assay)\nNote: The protocol is based on the manufacturer's instructions, with minor modifications.\nCritical: Since this is an ATP-based assay, microbial contamination may alter results. For this reason, steps 30b–e should be performed in a cell culture hood and CellTiterGlo-3D should be handled with care. White-walled, 96-well plates must be used to reduce luminescence crosstalk.\nThaw CellTiter-Glo® 3D reagent at 4°C (for 2–48 h).\nEquilibrate the plate/s containing infected organoids, CellTiter-Glo® 3D reagent and basal medium (F12+++) for 30 min at room temperature (20°C–25°C).\nOptional: During this time, take brightfield pictures of organoids seeded in the transparent plate using an inverted microscope.\nPrepare a mix of basal medium and CellTiter-Glo® 3D at a 1:1 ratio.\nRemove medium from the wells of the plate containing infected organoids using a glass Pasteur pipette equipped with a 10 μL-tip, taking care not to disturb the Matrigel domes. Change the tip between different experimental conditions.\nOptional: If using white-walled, clear-bottom plates, this is the moment to carefully stick the sealing film to the bottom of the plate.",
    "Transfer the mix to a sterile plastic container and add 100 μL of it to each well using a multichannel pipette.\nMix the plate/s vigorously (450 rpm) in a microplate shaker for 5 min at room temperature (20°C–25°C) to lyse organoids.\nIncubate the plate for 25 min at room temperature (20°C–25°C).\nQuantify luminescence in a microplate reader (troubleshooting 3[href=https://www.wicell.org#sec7.5]).\nNote: We use a Biotek Synergy HT for quantification, programmed with the following features: Integration Time 0.1 s, Plate Costar 96w white opaque, Sensitivity 100.\nSubtract background (Matrigel) luminescence values and normalize values of infected organoids to non-infected organoids, which correspond to 100% viability (Figure 4[href=https://www.wicell.org#fig4], troubleshooting 4[href=https://www.wicell.org#sec7.7]).\nNote: See Table 2[href=https://www.wicell.org#tbl2] for approximate luminescence values expected under described conditions.\nOrganoid formation assay\nHarvest organoids as described in the ‘organoid harvesting for infection[href=https://www.wicell.org#sec3.1]’ section, performing gentle mechanical disaggregation after the first centrifugation step.\nNote: Pool 2 wells of every experimental condition into one tube. In this case, since they are seeded in a 96-well plate, smaller tubes (1.5 mL) can be used to harvest organoids. Wash wells carefully with basal medium to recover all organoids.\nAfter the second centrifugation step, carefully remove the supernatant to leave organoids in a final volume of 8 μL.\nAdd 32 μL of Matrigel, pipetting up and down to mix.\nSeed 10 μL drops in a new 96-well plate, performing a 1:2 split (if 2 wells were collected, seed 4).\nLet Matrigel drops solidify for > 15 min at 37°C.\nAdd 90 μL of organoid growth medium in each well.\nIncubate at 37°C for 24 h.\nAfter 24 h, take brightfield pictures of the wells seeded using an inverted microscope.\nNote: Take several pictures that include different fields so that the whole well can be observed for organoid count.",
    "Count organoids in the wells by visually inspecting the pictures (troubleshooting 5[href=https://www.wicell.org#sec7.9]).\nNote: Only organoids that have not been infected with OAd, or with a low viral progeny inside, will be able to reassemble and form a new, round-shaped organoid. For manual organoid count, we consider as viable organoids those structures that are rounded and have a diameter bigger than 20 μm (Figure 5[href=https://www.wicell.org#fig5]). Therefore, organoid count can be interpreted as a readout of cell viability, which is inversely correlated with sensitivity to the OAd.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1233-Fig4.jpg\nFigure 4. Comparison of sensitivity to oncolytic adenoviruses between PDOs\nTwo different PDOs were infected with 2 or 20 MOI of two different oncolytic adenoviruses (OAds) and assessed for viability using CellTiter-Glo 3D 5 days after infection. Data are represented as mean ± SEM (n ≥ 3). Luminescence units were normalized to values of non-infected (mock) organoids.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1233-Fig5.jpg\nFigure 5. Organoid formation assay for survival assessment after PDO infection\n(A) Representative bright-field images of non-infected (mock) or OAd-infected PDOs (0.02 MOI for 5 days) and re-seeded at a 1:2 split ratio. Examples of organoids (round-shaped, > 20 μm diameter) formed 24 h after reseeding are indicated with arrowheads.\n(B) Quantification of organoids formed 24 h after re-seeding. Data are represented as mean ± SEM (n ≥ 5).\ntable:files/protocols_protocol_1233_6.csv"
  ],
  "subjectAreas": [
    "Organoids",
    "Health Sciences",
    "Biotechnology And Bioengineering",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}