{
  "id": 3640,
  "origin_website": "Cell",
  "title": "Mapping protein networks in yeast mitochondria using proximity-dependent biotin identification coupled to proteomics",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTagging the protein of interest via homologous recombination\nTiming: 6 days\nThis step is required to genomically tag BirA∗ to the C-terminal of the protein of interest, using transfection mediated homologous recombination. Tagging is confirmed by Western blotting using anti-BirA antibody.\nGrow the yeast cell line of interest for 12–16 h in YP + 2% dextrose.\nDilute the culture to 0.2 OD in YP + 2% dextrose and incubate under shaking at 30°C until the culture reaches an OD of ∼1.0.\nHarvest 1.5 mL of cells by spinning at 3,000 × g for 5 min at ∼21°C.\nRemove supernatant.\nResuspend cells in 1 mL of sterile water and spin at 3,000 × g for 5 min at ∼21°C.\nRemove supernatant.\nPerform PCR-tagging via homologous recombination.\nResuspend the cells in 100 mM lithium acetate and shake them for 10 min at 30°C.\nPellet the cells at 3,000 × g for 5 min and resuspend them by vortexing in 360 μL of HR buffer that includes the DNA fragment for homologous recombination.\nIncubate the cells at 42°C for 45 min under constant shaking.\nSpin down the cells at 3,000 × g at ∼21°C for 5 min, remove supernatant and resuspend them in 1 mL of YP + 2% dextrose.\nIncubate the cells for 1 h at 30°C under constant shaking.\nSpin down the cells at 3,000 × g at ∼21°C for 5 min and resuspend them in 100 μL of water, and spread them on an appropriate selective agar plate.\nAfter three days (∼72 h), single-cell colonies should emerge on the plate.\nPause Point: the plates can be stored at 4°C for up to 2 weeks.\npick single colonies and streak them on a fresh selection plate and let them grow at 30°C for 36–48 h.",
    "Pause Point: the plates can be stored at 4°C for up to 2 weeks.\nInoculate the clones in YP + 2% dextrose and let them grow for 12–16 h at 30°C under constant shaking.\nPerform protein extraction.\nHarvest 1 OD of cells and spin them down.\nResuspend the cells in 0.2 mL of 0.1 M NaOH and incubate at ∼21°C for 5 min.\nSpin the cells down at 3,000 × g for 5 min at ∼21°C and remove supernatant.\nResuspend the cells in 30 μL of 1× SDS sample buffer.\nBoil the sample at 95°C for 5 min.\nLoad the sample on an SDS-PAGE gel.\nRun the gel according to the manufacturer instructions.\nTransfer the protein on a nitrocellulose membrane.\nStain the membrane with Ponceau S to confirm transfer.\nBlock the membrane with 5% skim milk powder in TBS for 1 h at ∼21°C.\nDecorate the membrane with the anti-BirA antibody (Diluted 1:500 in 5% skim milk powder in TBS) on a shaker for 12–16 h at 4°C.\nWash the membrane three times with TBS.\nExpose the membrane to the anti-mouse secondary antibody conjugated to HRP (Diluted 1:3,000 in 5% skim milk powder in TBS) for 1 h at ∼21°C.\nWash the membrane three times with TBS.\nIncubate the membrane with ECL mix and check for correct BirA∗ tagging of the protein of interest.\nLabeling cells with biotin and extracting crude mitochondria\nTiming: 3–4 days\nIn this step, biotin labeling of BirA∗-tagged cells and subsequently extract crude mitochondria is performed.\nNote: Perform three biological replicates for each strain.\nGrow the cell line containing the BirA∗-tagged version of the protein of interest in YP + 2% glycerol or galactose supplemented with 50 μM biotin.",
    "Start the culture in 20 mL in YP + 2% glycerol or galactose and grow 12–16 h at 30°C under shaking.\nIncrease the culture volume to 200 mL by supplementing YP + 2% glycerol or galactose.\nBring the volume to 2 liters, add biotin powder into the culture to reach a final concentration of 50 μM and let the culture grow for ∼15 h at 30°C under shaking.\nCritical: It is important to harvest the cells for mitochondrial extraction when they are in logarithmic growth phase. The duplication time might be influenced by the strain’s genetic background. In our hands, starting a 2 liters culture with an OD600∼ 0.025–0.05 typically results on an OD ∼1.5 after 15 h.\nWhen the OD600 is ∼1.5, harvest the cells by centrifuging at 3,000 × g for 5 min at ∼21°C.\nRemove supernatant.\nResuspend the cells with water.\nSpin down the cells at 2,900 × g at ∼21°C for 5 min. Remove supernatant.\nWeight the wet cell pellet, expected to be around 6 grams for a 2 liters culture harvested at OD600 ∼1.5.\nResuspend the cells in MP1 buffer and incubate at 30°C for 10 min under shaking.\nSpin down the cells at 2,900 × g at 21°C for 5 min and wash them with 1.2 M sorbitol.\nSpin down the cells at 2,900 × g at 21°C for 5 min and resuspend them in MP2 buffer for 1 h at 30°C under shaking.\nDisrupt the cells with a tight-fitting glass Dounce homogenizer.\nSpin down the cells at 3,000 × g at 4°C for 5 min and resuspend them in half of the required homogenization buffer.\nDounce 10 times.\nSpin down the homogenate for 5 min at 2,900 × g at 4°C and save the supernatant at 4°C.",
    "Resuspend the pellet with the second half of homogenization buffer.\nDounce 10 times.\nSpin down the homogenate for 5 min at 2,900 × g at 4°C and add this supernatant to the one saved before.\nSpin down the total supernatant at 2,900 × g for 5 min at 4°C.\nTransfer the supernatant in a fresh bottle.\nSpin down the supernatant at 17,500 × g for 15 min at 4°C and discard the supernatant.\nThe pellet contains crude mitochondrial extract. Resuspend them in SH buffer (∼10 mg/mL) and fast freeze in liquid nitrogen followed by storage at −80°C.\nPause Point: mitochondria can be stored at −80°C for up to 1 year.\nPurification of biotinylated proteins\nTiming: 2 days\nIn this step, total biotinylated proteins from the mitochondrial extract are purified using streptavidin magnetic beads and digested on-bead by trypsin. The peptides are then prepared for subsequent analysis by mass spectrometry.\nThaw mitochondria (3 mg of total protein per biological replicate) on ice or at 4°C.\nSpin down the mitochondria for 10 min at 10,000 × g at 4°C.\nRemove the supernatant and solubilize the mitochondria in 300 μL of 1% SDS, and incubate for 5 min at 50°C. Please see critical point below.\nCritical: This step is important as it will extract and denature all the proteins. This will reduce non-specific binding of proteins to streptavidin magnetic beads (step 43).\nDilute the mitochondrial lysate by adding 2,700 μL of RIPA buffer supplemented with 500 U of Benzonase and incubate for 30 min on ice (4°C).\nClarify the mitochondrial lysate by spinning at 16,000 × g for 5 min at 4°C.\nTransfer the supernatant into a fresh 15 mL tube.",
    "In the meanwhile, equilibrate streptavidin magnetic beads equivalent to 60 μL of beads slurry (to reach 50 μg protein/μL beads slurry) with 1 mL of RIPA buffer.\nSpin down the beads, remove the supernatant, and transfer the equilibrated beads into the 15 mL tube with the mitochondrial lysate.\nIncubate on a rotary shaker for 3 h at 4°C.\nAfter the incubation, remove the supernatant (not bound fraction) by either centrifugation at 3,000 × g for 5 min at ∼21°C or by using a magnet.\nCritical: Make sure all the beads have been spun to the bottom of the tube as a pellet. Presence of beads in the supernatant will give a brown tinge to the solution.\nAdd 1 mL of RIPA buffer to wash the beads.\nTransfer the beads in a fresh 1.5 mL tube and load onto a magnetic rack.\nNote: The magnet will attract the beads to one side of the tube.\nRemove the RIPA buffer by carefully pipetting.\nWash again with 1 mL of RIPA buffer.\nWash the beads twice with 1 mL of TAP lysis buffer.\nWash the beads three times with 1 mL of freshly made ABC buffer.\nResuspend the beads with 200 μL of ABC buffer.\nAdd 1 μg of sequencing grade modified trypsin.\nIncubate the tubes for 12–16 h at 37°C under constant shaking.\nAdd an additional 1 μg of sequence grade modified trypsin to the bead mixture, and incubate for 3 h at 37°C under constant shaking.\nHarvest the elution (clear supernatant without the beads).\nResuspend the beads twice in 150 μL of ABC buffer, and harvest the supernatant.\nMerge the three supernatants together (total volume= 500 μL).",
    "Ensure the high purity of the elution by keeping the tubes on the magnetic rack for 5 min, and transferring the elutions in a new tube.\nPause Point: The elutions can be stored at −80°C for weeks before proceeding to the next step.\nLyophilize the elutions by solvent removal in a SpeedVac vacuum concentrator.\nResuspend the digested proteins in 30 μL of 0.1% TFA and incubate for 10 min at 4°C.\nCheck the pH. It should be between 2 and 3, otherwise adjust with 1% TFA.\nPrepare StageTips with 2 layers of SDB-RPS per sample by piercing the SDB-RPS extraction disk with a 16-gauge Kel-F Hub Needle (90516 from Hamilton) and pushing the plugs down with a 1 mm OD metal wire into a 200 μL pipette tip, as described previously (Rappsilber et al., 2007[href=https://www.wicell.org#bib13]). Commercial alternatives are also available (Tips-RPS-M.T1.200 from Affinisep).\nPre-equilibrate the StageTips sequentially with 50 μL ACN, 50 μL of Conditioning Buffer 2 and 50 μL of Conditioning Buffer 3 by centrifugation for 5–8 min at 1,500 × g at ∼21°C, or until no liquid remains in the StageTip.\nLoad each sample into a StageTip.\nWash the StageTips sequentially with Wash Buffer 1 and Wash Buffer 2 by centrifugation for 5–8 min at 1,500 × g at ∼21°C, or until no liquid remains in the StageTip.\nElute the peptides with 60 μL of elution buffer and collect the peptides into a clean low protein binding tube by centrifugation for 5 min at 500 × g at ∼21°C, or until no liquid remains in the StageTip.\nLyophilize the elutions by solvent removal in a vacuum concentrator for 30 min at 45°C, or until ∼2 μL remains.\nAdd 15 μL of MS loading buffer (2% ACN, 0.3% TFA) and resuspend by sonication.",
    "Pause Point: The samples can be stored at −80°C for weeks before proceeding to the next step.\nMass spectrometry and MaxQuant analysis\nTiming: 1–3 days\nIn this step, the samples are processed by mass spectrometry and the raw data is analyzed by MaxQuant.\nPlace the samples in the LC autosampler cooled to 4–8°C and analyze 5 μL of each sample using the LC-MS setup as described in Material and Equipment.\nAnalyze the raw BioID data using MaxQuant (Cox and Mann, 2008[href=https://www.wicell.org#bib2]; Tyanova et al., 2016[href=https://www.wicell.org#bib20]) and perform the downstream bioinformatics analysis as described below.\nSpecify the parameters used for searching label-free BioID data using MaxQuant. Typical parameters for MQ 1.6.15.0 are described in the mqpar.xml file (https://github.com/wasimaftab/BioID_Proteomics/Example/MQ_param[href=https://github.com/wasimaftab/BioID_Proteomics/Example/MQ_param]). See (Tyanova et al., 2016[href=https://www.wicell.org#bib20]) for more details on MaxQuant settings.\nNote: The raw files of the proteomic results that we present in this manuscript was processed using MQ v1.5.2.8. Therefore, users attempting to reproduce the results with later versions of MQ might get slightly different results.\nStatistical quantification and generation of volcano plots\nTiming: 30–60 min\nIn this step, two-group statistical quantification analysis is done on the Maxquant output data using a code developed using R programming. The code also generates volcano plots for easy visualization. To implement this analysis in your workflow, refer to the Quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis] section for a step-by-step description.\nGeneration of protein-proximity networks\nTiming: 30–60 min\nIn this step, fold-change enrichments from multiple BioID analyses are combined to create a bait-prey-edge table that can be visually analyzed as a network in Cytoscape.\nGenerating bait-prey-edge table\nIf you run multiple two-group comparisons, you will end up creating multiple \"Results_timestamp\" folders. Inside each \"Results_timestamp\" folder there will be one \"timestamp_final_data.tsv\" file.\nCreate a folder in your preferred location and copy those \"timestamp_final_data.tsv\" into that folder.",
    "Run the \"automate_nw_tab_gen.R\" code in RStudio by clicking Source and select the folder where you copied the .tsv files (see Example/Limma_output/Final_tsvs folder).\nThe code will first ask users to specify a log fold-change cutoff. Then, for every .tsv file in that folder, it will print a list of iBAQ/LFQ column names and ask you to enter a bait name from that list. Here assumption is that iBAQ/LFQ columns will contain bait names.\nUsing that information, the code will create a virtual list of bait-prey interactions that have fold change ≥ cutoff (e.g., 1.5) and p < 0.05.\nAfter that, the code will print a message if that file is processed successfully.\nFinally, when all .tsv files are processed successfully, code will concatenate those virtual lists into a single one, print top 10 rows that list and save all the proximity interactions as \"Links.xlsx\" in the same directory where you copied .tsv files earlier (see Example/Limma_output/Final_tsvs/Links.xlsx).\nTo visualize a bait-prey interaction network, open Cytoscape and click File → Import → Network from File… and load \"Links.xlsx.\"\nFor “Bait” select Meaning: “Source Node” and Data type: “String.” For “Prey” select Meaning: “Target Node” and Data type: “String.” For “Fold change” select Meaning: “Edge attribute” and Data type: “Floating point.” Click “OK.”\nClick Edit → Remove Self-Loops… to remove self-interactions involving baits.\nThe network displayed represents Bait-prey undirected network which can be customized depending on the user preference.\nNote: Tutorials for navigating through Cytoscape applications are available on GitHub by following this link: https://github.com/cytoscape/cytoscape-tutorials/wiki[href=https://github.com/cytoscape/cytoscape-tutorials/wiki] .This section of the protocol was tested on Windows 10 (64 bit) using Cytoscape 3.7.2.\nOptional: Bait-prey edge table can also be generated manually in Microsoft Excel. The above code automates the process and eliminates the risk of human error."
  ],
  "subjectAreas": [
    "Proteomics",
    "Cell Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}