{
  "id": 13513,
  "origin_website": "Jove",
  "title": "A Standardized Method for Measuring Internal Lung Surface Area via Mouse Pneumonectomy and Prosthesis Implantation",
  "procedures": [
    "All procedures used in this protocol were carried out in accordance with the recommendations in the Guidelines for the Care and Use of Laboratory Animals of the National Institute of Biological Sciences, Beijing. 8 week-old CD-1 male mice were housed in a specific pathogen free (SPF) facility until the experiments were conducted. Surgeries were performed using completely anesthetized mice (i.e., without any toe pinch responses). After surgery, mice were kept in a warm, humid room with sufficient food and fresh water. Mice were sacrificed using an overdose of anesthetic delivered by intraperitoneal injection.\n1. Mouse PNX Surgery\nFully anesthetize the mice with sodium phenobarbital (120 mg / kg body weight) and buprenorphine (0.1 mg / kg body weight) via intraperitoneal (I.P.) injection. Perform surgery when mice no longer react to toe pinching.\nRemove hair on the left thorax of the mice with chemical depilatory treatment (~3 x 3 cm2 area).\nSecure each mouse on an intubation platform with its ventral side facing the operator (Figure 1A).\nPull out the mouse tongue and illuminate the vocal cords with a small animal laryngoscope containing a notch for guiding catheters18 (Figure 1A).\nDistinguish the vocal cords by observing the movements of the vocal cords during breathing. Gently insert a 20 G intravenous intubation cannula into the trachea at an anterior angle19.\nPlace mice in a right lateral recumbent position and connect the cannula to a mechanical ventilator (e.g., pressure controlled; see the Table of Materials). Check the insertion of the cannula into the trachea by observing the breathing movements of the mouse chest (Figure 1B).\nSet the inspiratory pressure of the ventilator to 12 cm H2O and set the respiratory rate to 120 breaths per min (Figure 1B).\nDecontaminate the skin in the surgical area with betadine and 70% ethanol.",
    "Make a 2 - 3 cm posterolateral thoracotomy incision in the space at the 5th intercostal space, cut through skin and muscles with Noyes Spring Scissors (cutting edge: 14 mm; tip diameter: 0.275 mm) (Figure 2B, C). Surgical instruments used for thoracotomy procedure are sterilized prior to use.\nMake a 1.5 cm incision at the 5th intercostal space to expose the left lung (Figure 2D, E). During the operation, use a high temperature cauterizer to stop bleeding.\nLift one-third of the left lung lobe from the chest with blunt tip forceps (Figure 2F), and then use a cotton swab to pull out the entire left lung (Figure 2G).\nIdentify the pulmonary artery and bronchi of the left lung lobe (Figure 2G).\nTightly ligate the bronchi and vessels at the hilum with a silk surgical suture and cut out the left lung lobe at 3 - 4 mm from the ligation (Figure 2H, I).\n\tNOTE: Be careful not to cut off the suture knots on the left hilum, which can cause pneumothorax (i.e., air or gas in the cavity of the thorax).\nClose the chest wall with 1 suture, and then stitch the muscle layer and the skin layer sequentially, using 5 - 6 interrupted sutures. Leave a 3 - 4 mm gap between each suture (Figure 2M, 2N).\n\tNOTE: Keep the surgical suture needle away from the heart; inadvertent cardiac puncture will result in immediate death.\nDisinfect the surgical area with povidone-iodine.\nAfter the surgical operation, place the mouse on a 38 °C thermal pad and connect the mouse to the ventilator until spontaneous breathing movements commence (Figure 2O).\n2. Prosthesis Implantation\nPerform steps 1.1 - 1.13 of the PNX procedure (that is, up to the point when the left lung lobe of the mouse is removed).",
    "Clamp the center of the silicone prosthesis (customer made, 12 mm in length, 3 mm in thickness, 7 mm in width, 0.2 g, ellipsoid-shape) using blunt forceps (Figure 2J). Sterilize silicone prosthesis prior to insertion.\nHold the rib with forceps with one hand to expose the thoracic cavity, and then insert the prosthesis into the left empty thoracic cavity with another hand.\n\tNOTE: The insertion angle is approximately 45 degrees between the frontal plane of the prosthesis and the thoracic surface (Figure 2K, L). Be very gentle when inserting the prosthesis. Excessive force will result in pleural rupture.\nAdjust the orientation of the prosthesis with blunt forceps to ensure that the prosthesis occupies the left empty thoracic cavity.\nPerform steps 1.14 - 1.16 of the mouse PNX procedure.\n3. Measurement of ILV\nPrepare a custom device (\"inflation tube\") that consists of a plunger removed from a disposable serological pipette (10 mL), a 40 cm long flexible tube with a needle adapter, a flow rate control valve, and an 18 G needle. After assembly, secure the pipette on a board with tape (Figure 3A). The distance between the top of the pipette and the experimental bench must be at least 30 cm.\nPrepare fresh 4% paraformaldehyde (PFA) fixation solution by dissolving 20 g PFA in 500 mL pre-heated 1x phosphate buffered saline (PBS) in a 55 °C water bath, shaking manually once every 10 min until the solution is clear. After cooling to room temperature, filter the solution with a 0.45 µm filter.\n\tCAUTION: Wear appropriate personal protective equipment (PPE) when handling PFA.\nSacrifice mice with an overdose injection of anesthetic (0.8% phenobarbital sodium, 1,000 U/mL heparin).\nSecure each mouse on a polystyrene dissection plate and spray it with 70% alcohol.",
    "Carefully open the mouse chest and cut out the sternum using scissors to thoroughly expose the lung lobes.\nRemove excessive tissue using scissors to expose the trachea. Make sure to separate the trachea from the esophagus.\nCut the abdominal aorta and insert a 25-gauge needle into the right ventricle of heart; connect the needle to a 20 mL syringe prior to this insertion. Slowly push 1x PBS into the heart to remove blood cells until lungs turn white. Typically, 5 - 10 mL PBS is required to clear the pulmonary blood vessels.\nFill the custom-constructed inflation tube with 4% fresh PFA and remove all the bubbles from the inflation tube.\nInsert the 18-gauge needle of the inflation tube into the trachea and clip the trachea with vessel clips to avoid fluid leakage.\nInflate lungs with 4% PFA at a constant transpulmonary pressure of 25 cm/H2O2,20. Incubate the lungs at room temperature for 2 h to achieve fully expanded lungs. This \"pre-fix\" step is critical for preserving lung morphology.\nBy monitoring the inflation tube, record the value of the initial 4% PFA volume and record the final volume. The internal lung volume equals the initial 4% PFA volume minus the final 4% PFA volume.\nLigate the trachea and using scissors, gently dissect out the lungs (keeping the lungs intact) from surrounding connective tissues. Be very gentle to avoid damaging the lungs.\nIncubate the lungs in a 50-mL conical tube filled with 4% PFA for 12 h at 4 °C with gentle shaking on an shaker (50 rpm). Proceed to tissue processing and staining (see section 4).\n4. Tissue Embedding, Sectioning, and Hematoxylin & Eosin (H&E) Staining",
    "After fixation, use Noyes Spring Scissors to trim the heart and excessive connective tissues off the lungs. Gently separate the individual lung lobes by cutting off the bronchus that connects the lung lobes to the trachea.\nExtensively wash the lung lobes 3 - 4 times in 50 mL 1x PBS (30 min/wash) on an orbital shaker (50 rpm).\nFollowing the final wash, cryoprotect the lung lobes by immersing them in a 30% sucrose solution (in 1x PBS) at 4 °C until the tissue sinks to the bottom of the 50-mL conical tubes (approximately 12 h).\nPrior to embedding and cryosectioning the tissues, remove the lung lobe samples from the tubes with forceps, retain the accessory lobes for the histological analysis, dab the remaining sucrose solution from the surface of the accessory lobe samples, and then thoroughly immerse the sample into a Petri dish containing optimal cutting temperature (O.C.T) compound for approximately 30 min.\nFreeze the O.C.T-embedded accessory lobe samples in liquid nitrogen using cryomolds. Position the largest surface area of the lobe parallel to the bottom of the mold.\nPrepare a total of three 10-µm-thick sections for each sample during cryosectioning for histological analysis. Discard the first 1 mm of tissue, collect one 10-µm-thick section, discard 0.5 mm of tissue, collect another section, discard 0.5 mm of tissue, and collect the third (final) section.\nAir dry the sections for 1 h before performing H&E staining.\nPerform H&E staining\nWash the sections in 3 - 4 changes of tap water and then stain the sections in fresh hematoxylin for 2 min; rinse the section under running tap water; immerse the section two times in a 1% HCl-70% ethanol solution to remove excess hematoxylin.",
    "Stain the section in fresh eosin for 3 min; dehydrate the sections with two successive 30 s washes in 95% ethanol and two 30 s washes with 100% ethanol; clear the sections in xylene for 30 s, repeat the clearing step once in fresh xylene; mount the slides with mounting medium using glass coverslips.\n5. Quantification of MLI\nAcquire digital images of the H&E stained accessory lobe sections (20X magnification) using a bright-field microscope.\nTo quantify the MLI, select a total of 15 non-overlapping views (1,000 µm x 1,000 µm) randomly from the suitable areas (without arteries and veins, major airways, and alveolar ducts) of 3 sections.\nPlace a grid with 10 evenly-distributed vertical lines and 10 equally-distributed horizontal lines of defined length (1,000 µm) on the chosen areas of view using a ruler tool; each line is thus spaced 100 µm apart (Figure 4B).\nDefine the value of one intercept as the linear length between two adjacent alveolar epithelia. Measure the values of all intercepts along each 1,000 µm length line.\nFor each grid, quantify the values of all intercepts among the 10 horizontal 1,000 µm length lines and the 10 vertical 1,000 µm length lines.\n\tNOTE: MLI is the average value of the intercept lengths from a total of 15 grids analyzed from among the 3 sections prepared for each of the accessory lobes.\n6. Calculation of ISA\nCalculate the ISA using Equation 1 (see the Introduction). Refer to section 3 for the measurement of ILV and refer to section 5 for the quantification of MLI.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}