{
  "id": 2298,
  "origin_website": "Cell",
  "title": "Tetrode recording of rat CA1 place cells in an observational spatial working memory task",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nBehavioral procedures\nTiming: 6–10 weeks\nThis behavioral protocol trains rats to engage in an observational working memory task. Behavioral procedures are split into three phases, followed by additional conditions. The demonstrator and observer rat should be cage mates (two male rats living in same cage). The purpose of the first phase is to familiarize all rats (including both demonstrator rats and observer rats) to the maze and reward acquisition, whereas the second and third phases focus on observational learning by an observer rat. During the second phase, the observer rat should learn to observe the demonstrator rat and poke the same side in the observation box during the defined time frame for a reward. During the third phase, the observer rat should learn to observe the demonstrator rat and poke the same side in the maze during the defined time frame for a reward. Training days need not be every weekday, but should not be spaced more than two days apart. The default position of the experimenter should be behind the rest box whenever not performing any experimental procedure.\nObservational working memory task (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1792-Fig3.jpg\nFigure 3. Task structure\n(A) Workflow of the task training procedure. Note that only observer rats after training are subject to test on other conditions.\n(B) Habituation. Rats learn to properly run in T-maze and obtain water reward.\n(C) Pre-training. Observer rat in observation box learns association between demonstrator rat’s direction choice and reward.\n(D) Training. Observer rat must make same decision as demonstrator rat in maze to obtain water reward.\n(E) Tetrode advancing. Tetrodes are advanced to CA1 pyramidal layer.\n(F) Recording. Tetrodes monitor LFP and spiking activity.",
    "Restrict all rats’ water consumption for three days (rats receive 5% of the weight of the rat in water per day). Maintain body weight at > 85% of the ad libitum level. Keep food available ad libitum at all times. Resume free water consumption if animal’s body weight drops below 85%.\nPhase 1: Habituation.\nEach trial starts with releasing the demonstrator rat from rest box (∼10 s in rest box between trials) onto T-maze such that it can run an outbound trajectory (move along central arm, make a free choice at choice point, and reach a water port in the maze).\nDemonstrator rat should poke at the water port in the maze to trigger water delivery (100 μL) as reward.\nAfter water consumption, the demonstrator rat should return from the corresponding side arm (inbound trajectory). Retain the demonstrator rat in the rest box for 10 s before starting next trial. Manage entry and exit from rest box through experimenter manually controlling sliding door. A successful trial will have the demonstrator rat run along the central arm, turn at choice point, poke water port in the maze for reward, and return along the same side into the rest box.\nNote: Ensure the demonstrator rat returns to rest box through side arms rather than turn around (see troubleshooting problem 1[href=https://www.wicell.org#sec7.1]).\nEach session lasts 20 trials or 20 min, whichever occurs first. Total phase one should be one session per day for 6 training days. Animals are considered familiarized when they can make > 10 successful runs each session.",
    "Critical: To avoid bias, if the demonstrator rat chooses same side for three trials in a row, halt water reward on that side until the demonstrator rat chooses the alternative side. This is achieved by setting the maximum number of consecutive water deliveries on the same side to be three in ABET II software.\nPhase 2: Pre-training.\nIn ABET II, change settings of water ports in the maze such that a nosepoke results in 7 pulses of water, each pulse lasting 0.7 s with a 3 s interval (total reward 250 μL).\nIn each trial, the demonstrator rat should run along the central arm, make a free choice, and obtain reward from one of the water port reward sites in the T-maze, and return to the rest box as described in Phase 1.\nDefine settings of water ports in observation box such that a nosepoke in the T-maze starts a 10 s window for poking in the observation box. A poke on the same side in the box as the demonstrator rat running in the T-maze during the 10 s window should start 4 pulses of water in a 7 s interval, each pulse 0.5 s, for total reward of 100 μL (Data S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1792-Mmc1.pdf]).\nTake two cage mate rats, place one in the observation box, and the other in the T-maze apparatus. Both rats should have gone through previous training phase.\nEach session should last 20 trials. Total Phase 2 should be one session per day for 2–3 weeks. Expected outcome is that observer rat poke times should move closer to demonstrator rat poke time (Figure 7[href=https://www.wicell.org#fig7]A). If an observer rat is rewarded in > 15 trials, it is ready for Phase 3.\nPhase 3: Training.",
    "In this phase, the procedure for the demonstrator rat is identical to Phase 2. However, after the demonstrator rat returns to the rest box, the observer rat should be transported from the observation box to the T-maze central arm (facing away from choice point). Experimenter should return to the default position of behind the rest box.\nNote: If the observer rat fails to poke the water port in the maze within the 10 s window, the current trial terminates. Transport the observer rat back to the box. Pause for ∼30 s before next trial begins.\nThe observer rat should get rewarded with 300 μL for poking the same water port in the maze the demonstrator rat poked.\nAfter obtaining reward, the observer rat should return towards the rest box along the same side arm he poked and be transported back to observation box on a plate.\nEach session should last > 30 trials (each ∼2 min), one session per day. Such sessions should continue until the percentage of correct trials is > 70% for at least 2 consecutive sessions.\nCritical: The experimenter’s movement and picking side from the observation box could give the observer visual cues and bias the observer’s choice of direction on the T-maze (e.g., the observer rat could choose the side from which it was picked up by the experimenter). To avoid potential bias by human cues, the experimenter should transport the observer rat out of and return to the observation box on the same side of the T-maze.\nNote: See troubleshooting[href=https://www.wicell.org#troubleshooting] section for potential issues and solutions.\nAdditional behavioral conditions: for observer rats that reached the desired performance level from Phase 3, test one of the following conditions (Figure 3[href=https://www.wicell.org#fig3]). Test only one condition per day.",
    "Object - This condition tests whether social cues are required for correct observer rat performance.\nReplace the demonstrator rat with a moving object (10 cm × 20 cm black rectangular plastic block attached to the end of a 1.5 m wood pole).\nControl pole to mimic Phase 3 demonstrator movements in the T-maze, including triggering water port in the maze and remaining at poking location for a comparable duration.\nProcedure for the observer rat remains identical to Phase 3.\nEmpty - This condition tests whether the observer rat’s performance requires the presence of a moving subject / object.\nLeave the T-maze empty during the demonstrator rat portion of trials. Rather, trigger water rewards every 2 min in the maze with a wood pole controlled by the experimenter. Ensure that the pole remains at the reward location for a comparable duration as the rats in Phase 3.\nNo lick - This condition tests whether the observer rat simply follows acoustic cues from licking.\nKeeping all else same as Phase 3, do not deliver water to the demonstrator rat following the nosepoke.\nMixed bedding - This condition tests whether the observer rat follows olfactory cues.\nKeeping all else same as Phase 3, lay regular cage bedding along the top half of the central arm as well as half of the left and right horizontal arms (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1792-Fig4.jpg\nFigure 4. Additional behavioral conditions\n(A) Mixed bedding. Regular cage bedding is laid along the top half of the central arm and half of left and right horizontal arms around the choice point. In each trail, after the demonstrator returns to the rest box, the bedding is scrambled thoroughly and evenly on both sides of the choice point.",
    "(B) Blocked-view. The front panel of the observation box is fully covered by a black cloth to block the observer’s visual access to the T-maze.\nAfter the demonstrator rat returns to the rest box, scramble the bedding thoroughly across both sides of the choice point prior to the observer rat’s run.\nBlocked-view - This condition tests whether vision plays a role in the observer rat’s performance.\nKeeping all else same as Phase 3, cover the front panel of the observation box with a black cloth such that the observer rat can no longer see the T-maze (Figure 4[href=https://www.wicell.org#fig4]B).\nNote: If multiple conditions were used for the same observer rat and the performance in the maze was below the criterion (>70% for at least 2 consecutive sessions) under one condition, re-train the observer rat back to criterion (Phase 3) before the next condition.\nSurgery and hyperdrive implantation\nTiming: 4–6 h\nWell-trained observer rats are subject to survival surgery to implant hyperdrive. Stop water restrictions two days before surgery. Surgical procedures should be conducted under aseptic conditions as described in other work (Haggerty and Ji, 2015[href=https://www.wicell.org#bib1]; Mou and Ji, 2016[href=https://www.wicell.org#bib2]; Wu et al., 2017[href=https://www.wicell.org#bib6]).\nImplant observer rats with a hyperdrive. Target hippocampal CA1 region at coordinates anteroposterior (AP) -3.8 mm and mediolateral (ML) 2.4 mm relative to the Bregma and the right dorsal anterior cingulate cortex at the coordinates AP 1.9–1.3 mm and ML 1.0 mm (Paxinos and Watson, 2006[href=https://www.wicell.org#bib5]).\nPrepare instruments and supplies for surgery.\nSurgical implantation of the hyperdrive.\nInject Buprenorphine (1.0 mg/kg, S.C.) 30 min prior to anesthesia.\nAnesthetize the animal with 2.5% isoflurane in oxygen (1.0 L/min flow rate) in an induction chamber. Ensure adequate depth of anesthesia by making sure there are no tail- or foot-pinch reflexes.\nShave the surgical region with a fur trimmer.",
    "Fix the animal in a stereotaxic frame under anesthesia by locking the incisor and inserting ear bar into the ear canals (Figure 5[href=https://www.wicell.org#fig5]A). Cover animal’s eyes with ophthalmic ointment to protect them from dryness and bright light.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1792-Fig5.jpg\nFigure 5. Surgery and hyperdrive implantation\n(A) Top view of a head fixed rat on stereotaxic apparatus. Fur at surgical region was trimmed.\n(B) Exposed skull with circular holes drilled for anchoring screws.\n(C) Small openings for recording cannulae. Dura mater was removed to allow tetrode penetration.\nDisinfect the skin of the surgical region with 70% ethanol and povidone-iodine three times.\nInject a 50/50 mix of 2% lidocaine and 0.5% bupivacaine diluted 1:20 in sterile saline (0.04 mL/10 g body weight) subcutaneously along the incision line.\nMake an incision with the scalpel to the scalp along the midline to expose the skull. Use blunt-end forceps to pull the skin to the sides and clean the skull with cotton swabs.\nMark the recording sites for dorsal hippocampal CA1 (anteroposterior – 3.8 mm, mediolateral 2.4 mm relative to the Bregma) and dorsal anterior cingulate cortex (AP 1.9–1.3 mm, ML 1.0 mm).\nDrill holes for ∼10 anchoring screws without touching the brain around the skull edge, typically 2 screws/bone piece (Figure 5[href=https://www.wicell.org#fig5]B). Tightly turn the anchoring screws into the holes.\nNote: The screws need to be further away from the recording site and should be as close to the skull edge as possible to cover a sufficiently large area of the skull.\nDrill circular holes slightly larger than the recording cannula while carefully removing bone residues with an air tube attached to the drill (Figure 5[href=https://www.wicell.org#fig5]C).\nUse a fine needle (27 gauge) to gently penetrate and remove the dura.",
    "Attach the hyperdrive to a drive holder mounted on the stereotaxic frame. Lower the hyperdrive slowly right above the brain. Apply silicone grease around the guide cannula to completely cover the hole.\nSecure the hyperdrive to the anchoring screws and the skull by applying dental acrylic.\nPull the skin closely around the hyperdrive and suture the opening, while leaving the hyperdrive in place. Add a protective cap to the top of the hyperdrive.\nTetrode placement and recording\nTiming: 3–6 weeks\nIn the 2–3 weeks following the surgery, advance tetrodes daily to CA1 pyramidal layer and monitor hippocampal local field potential (LFP) and cells’ spiking activity using a Digital Lynx acquisition system (Neuralynx, Bozeman, MT) as described in other articles (Haggerty and Ji, 2015[href=https://www.wicell.org#bib1]; Mou and Ji, 2016[href=https://www.wicell.org#bib2]; Wu et al., 2017[href=https://www.wicell.org#bib6]).\nNote: No restrictions are necessary immediately after surgery. Resume water restriction 1 week after surgery (as in step 1a) for implanted observer rats.\nIn the second to third week after surgery, re-train the implanted animal to Phase 3 procedure for 2–3 sessions, one session per day, to get rats accustomed to hyperdrive and overhead tethers.\nAfter characteristic sharp-wave ripple (100–250 Hz oscillation, Figure 6[href=https://www.wicell.org#fig6]B) on LFPs are observed and stable single unit spike clusters have formed (Figure 6[href=https://www.wicell.org#fig6]A) on half of the tetrodes (> 12 out of all 24 tetrodes), start recording the observer rat when it performs the observational working memory task under either the standard conditions or under the Object or Empty conditions described in step 2. Track animal’s head and body center positions with EthoVision XT system at 30 Hz.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1792-Fig6.jpg\nFigure 6. Representative spiking and LFP in the hippocampal CA1 at resting state",
    "(A) Spiking clusters on a tetrode in the CA1. Each window represents the combination of any two of the four channels of a tetrode. Each white dot represents the amplitude of an action potential sampled by the same two channels.\n(B) Top: spike raster of the active place cells replayed in example ripple events. Cells are ordered by their place field position on the Outbound (blue) or Inbound (red) trajectory. Bottom: ripple LFP for corresponding replay events on the top.\nNote: Start recording sessions after tetrodes have not been moved for at least 24 h.\nNote: Before and after each session, let the observer rat rest on an elevated flowerpot outside of the sleep box for 30 min to collect neural data in resting condition.\nRecord each observer rat for several weeks, one session per day. Before and after each training session, rest the observer rat in a sleep box with an elevated flowerpot (Figure 2[href=https://www.wicell.org#fig2]C) to rest for 30 min.\nHistology\nTiming: 1–2 days\nThis portion of the protocol verifies tetrode locations.\nAfter experiments, euthanize observer rats with Euthasol (200 mg/kg). Then, pass a 30 μA current for 10 s on each tetrode to generate a small lesion at each recording site.\nDissect the observer rat brain and store brain tissues in 4% formaldehyde solution at least 12 h before sectioning.\nSection the brain at 90 μm thickness with vibratome (VT1000S, Leica) and mount the sections on the glass slides.\nStain brain sections using 0.2% Cresyl violet and use coverslip for storage.\nIdentify tetrode locations by matching lesion sites with tetrode depths and their relative positions."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Model Organisms",
    "Behavior",
    "Cognitive Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Ecology & Environmental Biology"
  ]
}