{
  "id": 19998,
  "origin_website": "Wiley",
  "title": "Assessing Cell Competition in Human Pluripotent Stem Cell (hPSC) Cultures",
  "procedures": [
    "Prior to undertaking in vitro investigation of competitive behavior between two cell populations, one or preferably both of the cell lines of interest should be fluorescently labeled. Fluorescent labeling facilitates distinction between the respective cell populations in the assays described later in this article. This protocol is used to generate hPSC lines constitutively expressing a fluorescent protein under control of the CAG promoter (Liew, Draper, Walsh, Moore, & Andrews, 2007[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-bib-0010]).\nMaterials\nT12.5 flask of 40% confluent hPSCs\nmTeSR1 medium (STEMCELL Technologies, cat. no. 85850)\nGeltrex (Geltrex LDEV-Free Reduced Growth Factor Basement Membrane Matrix, Thermo Fisher Scientific, cat. no. A1413202)\nDulbecco's Modified Eagle's Medium/Nutrient Mixture F-12 Ham (DMEM/F12 medium; Merck Life Science, cat. no. D6421), 4°C\nMammalian expression vector [for expression of fluorescent marker driven by CAG promotor (Liew et al., 2007[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-bib-0010]); pCAG-H2B-RFP (Zhang et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-bib-0026]) and pCAG-H2B-GFP (Addgene, cat. no. 184777) plasmids recommended]\nY-27632 (Generon, cat. no. A11001-10)\nNeon Transfection System (Thermo Fisher Scientific, cat. no. MPK10025), including Neon tubes and tips, buffer E2, and buffer R\nPuromycin (Thermo Fisher Scientific, cat. no. A11138)\nT12.5 flasks (12.5-cm2 cell culture flasks)\n15-ml conical Falcon tubes\nNeon Transfection System pipet station (Thermo Fisher Scientific, cat. no. MPS100)\n1.5-ml Eppendorf tubes\n5-ml serological pipets\nInverted microscope\nAdditional reagents and equipment for preparing single-cell suspension (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0002])\nNOTE: The confluency and medium conditions of hPSCs prior to electroporation can strongly influence the efficiency of electroporation and the survival of the cells. We find that cell cultures of 60% to 70% confluency (∼225,000 cells/cm2 or 2.8 × 106 cells per T12.5 flask) that have been freshly fed yield good transfection efficiencies and display good survival post-transfection.\nDay before electroporation\n1. Feed a T12.5 flask of 40% confluent hPSCs with >6 ml mTeSR1 medium.\nDay of electroporation",
    "2. Coat two T12.5 flasks with Geltrex as per manufacturer's instructions:\n         \nThaw an aliquot of Geltrex on ice or overnight in the refrigerator (2° to 8°C).\nDilute Geltrex 1:100 in pre-chilled DMEM/F12 medium.\nCoat growth surface of each flask with 2.5 ml Geltrex (200 μl per cm2).\nIncubate Geltrex-coated flasks at 37°C for ≥1 hr.\n3. Defrost mammalian expression vector (e.g., pCAG-H2B-GFP) on ice.\nStock plasmid concentrations should ideally range between 2.0 and 5.0 μg/μl to minimize the volume added in step 8.\n4. Prepare 10 ml mTeSR1 medium supplemented with 10 μM Y-27632 in a 15-ml conical Falcon tube and pre-warm to 37°C.\n5. Set up Neon Transfection System for electroporation:\n         \na. Place Neon Transfection System pipet station inside a tissue culture hood and load with a Neon tube.\nb. Fill Neon tube with 3 ml buffer E2, ensuring that the electrode is completely immersed.\n6. Prepare a single-cell suspension from a T12.5 flask of hPSCs (see step 1) that are approximately 60% to 70% confluent, as described in Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0002]. At step 4 of Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0002], use 4 ml of the mTeSR1 supplemented with 10 μM Y-27632 prepared in step 4 of this protocol.\n7. Resuspend cells in buffer R at 2.5 × 106 cells/120 μl and transfer 120 μl per transfection to a 1.5-ml Eppendorf tube.\n8. Pipet 5 μg of the defrosted plasmid from step 3 into the 1.5-ml Eppendorf tube containing 120 μl cell suspension. Using a P200 pipet, gently mix cell and plasmid DNA by pipetting up and down 3 to 4 times, ensuring not to introduce any air bubbles.",
    "9. Load a Neon tip onto the Neon pipet and place toward bottom of the 1.5-ml Eppendorf tube containing the cell-DNA suspension. Slowly aspirate cell-DNA mixture into the Neon tip, ensuring that no air bubbles are present.\nThe presence of air bubbles within the Neon tip will prevent the electroporation from being run. If air bubbles are visible within the tip, gently pipet the solution back down into the 1.5-ml Eppendorf tube and allow for the air bubbles to rise to the surface of the cell-DNA suspension. Then, re-aspirate the cell-DNA suspension, taking care to ensure that the Neon tip is immersed while pipetting.\n10. Insert Neon pipet, with the metal head facing the electrode, into the Neon tube until a click sound is heard.\n11. Transfect cells using the following conditions: Voltage: 1600 V, Pulse width: 20 msec, Pulse #: 1.\n12. Remove Neon pipet from the pipet station and transfer electroporated cells to the remaining 6 ml mTeSR1 medium supplemented with 10 μM Y-27632.\n13. Aspirate excess Geltrex from the two pre-prepared T12.5 flasks (see step 2). Using a 5-ml serological pipet, seed 3 ml of the 6-ml cell suspension in each flask and label flasks appropriately.\n14. Place flasks in a 37°C, 5% CO2 incubator and manually agitate back and forth and side to side to evenly distribute cells across the growth surface. Incubate for 24 hr or overnight.\nDays after electroporation\n15. Day 1 (24 hr):\n         \nCheck for fluorescent marker expression in transfected cells using an inverted microscope.\nPrepare mTeSR1 supplemented with 0.5× the optimal concentration of puromycin and replace medium in each T12.5 flask with 4 ml of this medium.",
    "The puromycin concentration should be optimized for each hPSC line used by performing a kill curve for the cell line of interest. We find that a final concentration of 0.375 μg/ml works well for many hPSC lines. A stepwise increase in the concentration of puromycin post-electroporation (see steps 15 to 17) encourages the selection of stably transfected cells and minimizes their loss from the culture.\n16. Day 2 (48 hr): Prepare mTeSR1 supplemented with 0.75× the optimal concentration of puromycin and replace medium in each T12.5 flask with 4 ml of this medium.\n17. Day 3 (72 hr): Prepare mTeSR1 supplemented with the optimal concentration of puromycin and replace medium in each T12.5 flask with 4 ml of this medium.\n18. Every 48 hr, refresh medium in each flask with mTeSR1 supplemented with the optimal concentration of puromycin to maintain selection while stably transfected fluorescent colonies are established.\nConfirm expression of fluorescent marker in all cells of the surviving colonies during the period of culture while the cells are undergoing selection.\nOnce established, pick cultures containing entirely fluorescent colonies and expand for downstream applications. If a clonal fluorescent subline is required, follow Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0003] for single-cell cloning.",
    "Dissociation of hPSCs into a single-cell suspension is required in several of the protocols within this article. This support protocol outlines the steps required to disaggregate cells and isolate a sample for cell number quantification.\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0001])\nT12.5 flask of hPSCs\nDulbecco's phosphate-buffered saline (PBS), without calcium and magnesium chloride\nTrypLE Express Enzyme (Thermo Fisher Scientific, cat. no. 11528856)\nCulture medium, 37°C\nAutomated cell counter or Neubauer improved hemocytometer (Hawksley)\nStandard tabletop centrifuge\nAdditional reagents and equipment for counting cells (see Current Protocols article: Phelan & May, 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-bib-0017])\n1. Aspirate medium from the T12.5 flask of hPSCs.\n2. Wash hPSCs once with 5 ml PBS per T12.5 flask.\n3. Add 1 ml TrypLE Express Enzyme solution per T12.5 flask and incubate at 37°C for 3 to 4 min. Then, tap side of the flask gently to encourage cell dissociation. Assess progress of single-cell dissociation by checking the hPSC culture under an inverted microscope after 3 min of incubation.\n4. Dilute TrypLE with 4 ml culture medium. Using a 5-ml serological pipet, gently pipet cell suspension 3 to 4 times to form a single-cell suspension and then transfer single-cell suspension to a 15-ml conical Falcon tube.\n5. Pipet 10 μl of the single-cell suspension into the counting chamber of either an automated cell counter or a Neubauer improved hemocytometer (see Current Protocols article: Phelan & May, 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-bib-0017]).\n6. Pellet cells by centrifugation for 4 min at 250 × g at room temperature. Aspirate most of the supernatant and gently flick tube to redisperse the cells in the remaining supernatant.",
    "Following electroporation (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0001]), it is recommended to derive clonal populations of the fluorescently labeled hPSC lines of interest. The populations generated in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0001] will consist of cells with differing fluorescent intensities, which may cause issues with signal detection in later protocols. The process of generating clonal sublines involves sorting single cells into a 96-well plate using fluorescence-activated cell sorting (FACS). This process is followed by a culture phase to expand the cells and then subsequent screening to confirm the genotype of the clonal population.\nMaterials\nGeltrex (Geltrex LDEV-Reduced Growth Factor Basement Membrane Matrix, Thermo Fisher Scientific, cat. no. A1413202)\nDMEM/F12 medium (Merck Life Science, cat. no. D6421), 4°C and 37°C\nCloneR2 supplement (STEMCELL Technologies, cat. no. 100-0691)\nmTeSR Plus (STEMCELL Technologies, cat. no. 100-0276), 37°C\nGentamicin (Merck Life Science, cat. no. G1397) or another widely used cell culture antibiotic\nRainbow 8-peak alignment beads\nT12.5 flasks of unlabeled and fluorescently labeled hPSCs (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0001])\nmTESR Plus (STEMCELL Technologies, cat. no. 100-0276) supplemented with 10 μM Y-27632 (Generon, cat. no. A11001-10), 37°C\n8-channel multichannel pipet (capable of reverse pipetting)\nSterile reagent reservoirs (Starlab, cat. no. E2310-1010)\n96-well cell culture plates\nBD FACSJazz or another FACS machine\nInCell Analyzer (GE Healthcare) or another fluorescent microscopy platform\nStandard tabletop centrifuge with plate adapter\nInverted microscope\nGeltrex-coated 24-well cell culture plates (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0001], step 2)\nAdditional reagents and equipment for preparing single-cell suspension (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0002]), for expanding clonal lines and establishing frozen stocks, and for screening clonal lines for common genetic variants that arise during hPSC culture (see Current Protocols article: Laing, Halliwell, & Barbaric, 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-bib-0009])\n96-well plate preparation\n1. Prepare 12 ml Geltrex by diluting 1:100 in pre-chilled DMEM/F12 medium, as per manufacturer's instructions (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0001], step 2).",
    "2. Using an 8-channel multichannel pipet and a sterile reagent reservoir, coat each well of two 96-well cell culture plates with 60 μl Geltrex and incubate for ≥1 hr at 37°C.\n3. While the Geltrex-coated plates are incubating, prepare 12 ml single-cell cloning medium by adding 1.2 ml CloneR2 supplement to 10.8 ml mTeSR Plus. Supplement cloning medium with an appropriate concentration of gentamicin or another widely used cell culture antibiotic.\nInclusion of antibiotics is required if cell sorting (steps 10 to 15) is performed under non-sterile conditions.\n4. Following incubation, aspirate Geltrex from the wells of the 96-well plates.\n5. Add 50 μl single-cell cloning medium supplemented with antibiotics (see step 3) to Geltrex-coated wells. Place 96-well plates in a 37°C incubator until ready for cell sorting.\nFACS machine setup\n6. Set up a BD FACSJazz or another FACS machine for cell sorting by aligning lasers and setting drop delay.\n7. Using a clean, uncoated 96-well cell culture plate, align stream deflection so that droplets are deposited into the middle of the wells.\n8. Sort individual beads of uniform fluorescence (rainbow 8-peak alignment beads) into each well of the 96-well plate.\n9. Image wells using an InCell Analyzer or another fluorescent microscopy platform to verify that the deposition and placement of single beads are correct.\nSingle-cell sorting\n10. Prepare single-cell suspensions from T12.5 flasks of unlabeled and fluorescently labeled hPSCs as described in Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0002].\n11. Resuspend cells in DMEM/F12 at ∼1 × 106 cells/ml.\n12. Using the unlabeled hPSC cell line, set baseline fluorescence on the FACS machine.\n13. Analyze a proportion of the fluorescently labeled cell population and gate those of higher fluorescent intensity for cell sorting.",
    "14. Sort single cells across the wells of both pre-prepared 96-well plates (see step 5) using the following sort settings: Event rate: 500 eps, Sort setting: one drop single.\n15. Centrifuge plates 1 min at 200 × g and return to 37°C incubator.\nExpansion of clonal lines\n16. Incubate cells for 48 hr at 37°C, 5% CO2.\n17. Day 2: After 48 hr, feed cells with an additional 100 μl single-cell cloning medium supplemented with antibiotic solution per well. Culture cells for a further 4 days at 37°C.\n18. Day 6: Under an inverted microscope, screen plates for viable hPSC colonies, which should now be visible. In the wells containing a colony, remove 120 μl old medium and replace with 120 μl fresh mTeSR Plus.\nColonies not visible at Day 6 may continue to emerge over the next several days. It is recommended to continue checking the plates daily to spot new emerging colonies and to perform the medium changes described in steps 19 and 20 when appropriate.\n19. Replenish medium every 2 to 3 days, as required, until the colonies are of sufficient size to passage.\n20. When ready, manually passage individual colonies from within a 96-well plate using a P200 tip and transfer to a Geltrex-coated 24-well cell culture plate containing 0.5 ml mTESR Plus supplemented with 10 μM Y-27632.\nThe Y-27632 can be removed 24 hr after passaging.\n21. Continue to expand clonal lines and establish frozen stocks using the culture system of preference.\n22. Prior to use in the following protocols, screen clonal lines established above for common genetic variants that arise during hPSC culture (see Current Protocols article: Laing et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-bib-0009]).",
    "The first step in determining the presence or absence of cell competition between two hPSC sublines is to assess the growth rate of each cell population when cultured both in mono-culture (separately) and within a co-culture (mosaic) environment. The protocol requires at least one fluorescently labeled subline, generated in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0001], to facilitate distinguishing between the two cell populations in the co-culture condition. However, two sublines labeled with different fluorescent markers can also be used. To test as many cell-line pairings or culture conditions as possible, the protocol below uses a high-content 96-well format to maximize data acquisition. In its current format, the protocol describes the setup required to assess cell competition using a standard 3-day culture period with equal numbers of the two cell lines. The seeding densities and length of culture period can be adapted to suit your experimental setup. Each co-culture seeding density requires two separate culture density control conditions. In the first separate culture control, mono-cultures equivalent to the total number of cells in the co-culture condition (i.e., n° cells “cell line 1” + n° cells “cell line 2”) are plated. In the second separate culture control, a mono-culture equivalent to the total number of that respective population in the co-culture is seeded (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-fig-0002]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/6653617d-75d4-423b-9fed-a6f196dbf1fb/cpz1435-fig-0002-m.jpg</p>\nFigure 2\nWorkflow for the proliferation assays in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0004]. (A) Cultures of two hPSC populations of interest are harvested and plated into separate and co-culture conditions. (B) The cells are cultured for a further 96 hr, with regular medium changes and sample fixing every 24 hr. (C) Images are acquired and used to generate growth curves by calculating the number of cells from each population across separate and co-culture conditions.\nMaterials\nVitronectin (Thermo Fisher Scientific, cat. no. A14700)\nPBS, without calcium and magnesium chloride",
    "Essential 8 medium (Thermo Fisher Scientific, cat. no. A1517001) supplemented with 20 μM Y-27632 (Generon, cat. no. A11001-10), 37°C\nDMEM/F12 medium (Merck Life Science, cat. no. D6421), 37°C\nT12.5 flasks of two different hPSC populations, with at least one population fluorescently labeled (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0001])\nEssential 8 medium (Thermo Fisher Scientific, cat. no. A1517001), 37°C\n4% (w/v) paraformaldehyde (PFA) supplemented with 10 μg/ml Hoechst 33342 (Thermo Fisher Scientific, cat. no. H3570)\nSterile reagent reservoirs (Starlab, cat. no. E2310-1010)\n8-channel multichannel pipet (capable of reverse pipetting)\n96-well, flat-bottom, black, μ-clear® cell culture plates (Greiner Bio-one, cat. no. 655090)\n15-ml conical Falcon tubes\nInverted microscope\nInCell Analyzer (GE Healthcare) or another high-content microscopy platform\nAdditional reagents and equipment for preparing single-cell suspension (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0002])\nPlate preparation\n1. Prepare a working solution of 5 µg/ml vitronectin by diluting stock aliquots 1:100 in PBS and place into a sterile reagent reservoir.\n2. Using an 8-channel multichannel pipet, add 60 μl vitronectin working solution per well to inner 60 wells of each 96-well, flat-bottom, black, μ-clear® cell culture plate. Incubate at room temperature for ≥1 hr.\nThe electronic multichannel pipet can be used for all universal liquid handling steps.\n3. After incubation, aspirate vitronectin from the wells.\nThis step can be sped up by using sterile 10-μl tips connected to an 8-channel aspirator manifold (Merck Life Science, cat. no. BR704526).\n4. Add 50 μl Essential 8 medium supplemented with 20 μM Y-27632 to wells coated with vitronectin.\nIt is important that the wells coated with vitronectin do not dry out, as this can negatively affect cell seeding. Perform step 4 quickly and, if required, divide the number of plates being handled at one time, repeating steps 3 and 4 until all 96-well plates are completed.",
    "5. Add 150 μl DMEM/F12 medium to the outer 36 wells of each 96-well plate (which have not been coated with vitronectin). Place plates in a 37°C incubator until ready for cell seeding.\nCell harvesting and plating\n6. Create single-cell suspensions of both hPSC cultures from T12.5 flasks of two different hPSC populations, with at least one population fluorescently labeled, as outlined in Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0002].\n7. Resuspend cell pellets at 1 × 106 cells/ml in the appropriate volume of Essential 8 medium without Y-27632.\n8. Using the suspensions from step 8, prepare suspensions at a final cell density of 3 × 105 cells/ml.\nWe typically add 3 ml suspension at 1 × 106 cells/ml to Falcon tubes containing 7 ml Essential 8 medium and gently pipet up and down twice to ensure an even dispersion.\n9. Using the suspensions from step 9, prepare suspensions at a final cell density of 1.5 × 105 cells/ml.\nWe typically transfer 2.5 ml suspension at 3 × 105 cells/ml to Falcon tubes containing 2.5 ml Essential 8 medium and gently pipet up and down to evenly disperse.\n10. Create a mosaic cell suspension at a ratio of 50:50 by mixing 2.5 ml suspension at 3 × 105 cells/ml (see step 9) from each cell line in a pre-labeled “co-culture” 15-ml conical Falcon tube.\n11. Retrieve pre-prepared 96-well plates from the incubator (see step 5) and plate cells at densities of 4.4 × 104 cells/cm2 and 2.2 × 104 cells/cm2.\nThat is, plate 50 μl of the separate (steps 9 and 10) and co-culture (step 11) cell suspensions prepared above into their respective wells.\n12. Check cells after plating under an inverted microscope and incubate for 24 hr.\nDay 0 (24 hr after plating)",
    "13. Gently remove medium containing Y-27632 and wash with 100 μl DMEM/F12 per well.\n14. Replace medium within each well with 100 μl Essential 8 medium.\nMedium should be removed and added by slowing pipetting up or down the side of the wells to prevent the cells from lifting away from the surface of the culture plate.\n15. Fix one of the plates:\n         \nRemove all medium from wells containing cells and wash with 100 μl DMEM/F12 per well.\nRemove 70 μl DMEM/F12 from each well, leaving a thin layer of medium covering cells.\nAdd 100 μl of 4% PFA supplemented with 10 μg/ml Hoechst 33342 per well and incubate for 15 min at room temperature in the dark.\nRemove 100 μl fixative solution from each well and wash with 100 μl PBS for 5 min. Repeat three additional times.\nAspirate DMEM/F12 from outer wells and replace it with 150 μl PBS for storage.\nPlates can be sealed with parafilm and kept in the refrigerator (4°C), protected from light, for up to 2 weeks prior to imaging.\nThis post-plating time point is considered Day 0.\nDays 1 to 3 (48 to 96 hr after plating)\n16. Every 24 hr, repeat step 15, replacing culture medium with 100 μl fresh Essential 8 medium.\n17. Fix a plate of cells every 24 hr, as outlined in step 16, to establish regular time points post-plating.\nImaging\n18. After the experiment is complete, image plates using an InCell Analyzer or another high-content microscopy platform. Capture entire well or a minimum of 16 random fields within each well. Quantify resulting images using open-source software such as CellProfiler (Stirling et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-bib-0031]) or Fiji (Schindelin et al., 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-bib-0030]) to calculate the total and individual subline cell numbers.",
    "Following the use of proliferation assays to assess cell growth in separate cultures and co-culture (Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0004]), the next step in determining the presence of a competitive phenotype is to evaluate whether the levels of apoptosis are altered between separate and co-culture conditions. Increased levels of apoptosis in the loser population caused by the presence of the winner population are a signature of cell competition in many systems (Bowling et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-bib-0004]). A number of approaches may be taken to assess apoptosis, including the use of live-cell staining and in situ staining kits; however, we have found that the most consistent and versatile approach with hPSCs is to use flow cytometry. The protocol below, similar to the proliferation assays, involves establishing a co-culture condition as well as two separate culture conditions to control for density. Cells, including those that are apoptotic and detached from the culture surface, are harvested at time points of interest and subsequently fixed and stained for the apoptosis marker cleaved caspase-3.\nMaterials\nVitronectin (Thermo Fisher Scientific, cat. no. A14700) working solution (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0004], step 1)\nEssential 8 medium (Thermo Fisher Scientific, cat. no. A1517001) supplemented with 20 μM Y-27632 (Generon, cat. no. A11001-10), 37°C\nT12.5 flasks of two different hPSC populations, with at least one population fluorescently labeled (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0001])\nDMEM/F12 medium (Merck Life Science, cat. no. D6421), 37°C\nEssential 8 medium (Thermo Fisher Scientific, cat. no. A1517001), 37°C\n4% (w/v) PFA\nPBS, without calcium and magnesium chloride\nPBS supplemented with 0.5% (w/v) Triton X-100\nPBS supplemented with 1% (w/v) bovine serum albumin (BSA) and 0.3% (w/v) Triton X-100\nAnti-cleaved caspase-3 primary antibody (e.g., Cell Signaling Technology, cat. no. 9661)\nSecondary antibody (e.g., Goat Anti-Rabbit AffiniPure IgG+IgM H+L Alexa Fluor® 647, Stratech, cat. no. 111-605-003-JIR)\nT12.5 flasks (12.5-cm2 cell culture flasks)",
    "15-ml conical Falcon tubes\nInverted microscope\nStandard tabletop centrifuge\nTube shaker (optional)\nFACS tubes\nBD FACSJazz or similar flow cytometry analyzer\nAdditional reagents and equipment for preparing single-cell suspension (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0002]) and counting cells (see Current Protocols article: Phelan & May, 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-bib-0017])\nPlating of separate and co-culture conditions\n1. Prepare five T12.5 tissue culture flasks by coating them with 2 ml vitronectin working solution. After incubation at room temperature for 1 hr, remove vitronectin and replace with 3.5 ml Essential 8 medium supplemented with 10 μM Y-27632. Place flasks in a 37°C incubator until ready for cell seeding.\n2. Create single-cell suspensions of both hPSC cultures from T12.5 flasks of two different hPSC populations, with at least one population fluorescently labeled, as outlined in Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0002].\n3. Resuspend each hPSC subline at 1 ×106 cells/ml in Essential 8 medium supplemented with 10 μM Y-27632.\n4. Prepare a dilution of each subline at 5 × 105 cells/ml by adding 750 μl suspension at 1 × 106 cells/ml from step 3 to a fresh 15-ml conical Falcon tube containing 750 μl Essential 8 medium supplemented with 10 μM Y-27632.\n5. Create a mosaic cell suspension at a ratio of 50:50 by mixing 750 μl suspension at 1 × 106 cells/ml from each cell line (see step 3) in a pre-labeled “co-culture” 15-ml conical Falcon tube.\n6. Retrieve pre-prepared T12.5 flasks from the incubator (see step 1) and plate cells at densities of 4.4 × 104 cells/cm2 and 2.2 × 104 cells/cm2.\nThat is, plate 550 μl of the separate (steps 3 and 4) and co-culture (step 5) cell suspensions into their respective flasks.",
    "7. Check cells under an inverted microscope and then place flasks in a 37°C incubator and manually agitate back and forth and side to side to evenly distribute cells across the growth surface. Incubate for 24 hr.\n8. Twenty-four hours following plating, aspirate old medium containing Y-27632 and wash once with 4 ml DMEM/F12 medium. Replenish flasks with 4 ml Essential 8 medium without Y-27632 and return to incubator.\n9. Replace culture medium daily with 4 ml Essential 8 medium per flask.\nProcessing of hPSCs for cleaved caspase-3 staining\n10. At the time point of interest, collect culture medium containing apoptotic cells that have detached from the culture flask into a 15-ml conical Falcon tube.\n11. Dissociate attached cells into a single-cell suspension as described in Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0002].\n12. Combine single-cell suspension of previously attached cells from step 11 with the culture medium containing detached cells from step 10 and take a 10-μl sample to perform a cell count.\n13. Pellet combined sample by centrifugation for 5 min at 270 × g.\n14. Aspirate most of the supernatant and gently flick pellet to redisperse in the remaining supernatant. Resuspend in 4% PFA at density between 1 and 5 × 106 cells/ml and incubate at room temperature for 15 min.\nUse a cell density appropriate for the time point you are analyzing and the number of cells within your sample. We find that a cell suspension volume of ∼1 ml facilitates easy handling of buffer and antibody volumes in the subsequent steps. Proceed with the same cell density for the steps below.\n15. Add PBS to tube to reach a final volume of 10 ml. Centrifuge fixed cells for 5 min at 270 × g to re-pellet.",
    "Once fixed, samples can be stored in PBS prior to permeabilization for up to 2 weeks.\n16. Aspirate supernatant and resuspend in permeabilization solution of PBS supplemented with 0.5% Triton X-100 for 5 min. Centrifuge 5 min at 270 × g and carefully aspirate supernatant from the cell pellet.\n17. Resuspend cells in blocking solution comprising PBS supplemented with 1% BSA and 0.3% Triton X-100. Transfer one-quarter of cell suspension per sample to a fresh 15-ml conical Falcon tube.\nThis material is to be used for the secondary-only staining control and can be kept to the side until step 20.\n18. Incubate remaining cells with anti-cleaved caspase-3 primary antibody diluted in blocking solution for 1 hr at room temperature or overnight at 4°C with gentle agitation.\nThe antibody dilution for each batch of antibody should be determined by titration. In our experiments, anti-cleaved caspase-3 antibody was used at a dilution of 1:200 for flow cytometry.\n19. Following incubation with the primary antibody, wash cells with 4 ml blocking solution and incubate for 5 min at room temperature prior to centrifugation for 5 min at 270 × g. Repeat this step three additional times.\n20. Stain cells with secondary antibody in blocking solution for 1 hr at room temperature protected from light.\n21. Following incubation with the secondary antibody, wash cells with 4 ml blocking solution and incubate for 5 min prior to centrifugation for 5 min at 270 × g. Repeat this step two additional times.\n22. Resuspend cells in an appropriate volume of blocking solution and transfer to FACS tubes for analysis on a BD FACSJazz or similar flow cytometry analyzer.",
    "An increased death rate within the loser population that occurs due to co-culture with winner hPSCs could be mediated through cell-cell contacts and/or cells’ access to growth and survival factors. In this protocol, we describe how to set up a transwell assay with hPSCs that allows assessment of the contribution of secreted factors to a competitive phenotype. In a transwell setup, one cell population is grown on the bottom surface of a cell culture plate and the other on a permeable support that is suspended above the bottom of each well. The two cell populations are cultured in the same medium environment, allowing for exchange of secreted factors, but they remain physically separated for the duration of the experiment (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-fig-0003]). Staining for cleaved caspase-3 is performed on winner and loser hPSCs grown with either the same or the opposing cell type in the transwell above to determine the levels of cell death in each condition.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/f3656219-6c99-4f2a-8d43-56fe3bb2070f/cpz1435-fig-0003-m.jpg</p>\nFigure 3\nSetting up the transwell assay in Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0006]. (A) Prepare plates and culture inserts by seeding winner and loser hPSCs separately for 24 hr to facilitate attachment. (B) For each hPSC population, place half of the inserts into wells previously seeded with the same cell line (homotypic) and the other half into wells seeded with the opposing cell line (heterotypic). (C) Culture the spatially separated homotypic and heterotypic cultures to assess the impact of secreted factors on the competitive phenotype.\nMaterials\nVitronectin (Thermo Fisher Scientific, cat. no. A14700) working solution (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0004], step 1)\nEssential 8 medium (Thermo Fisher Scientific, cat. no. A1517001) supplemented with 20 μM Y-27632 (Generon, cat. no. A11001-10), 37°C\nT12.5 flasks of two different hPSC populations, with at least one population fluorescently labeled (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0001])",
    "Essential 8 medium (Thermo Fisher Scientific, cat. no. A1517001), 37°C\nDMEM/F12 medium (Merck Life Science, cat. no. D6421), 37°C\n4% (w/v) PFA\nTranswell inserts (Millicell Hanging Cell Culture Inserts, PET 8 μm for 24-well plate, Millipore, cat. no. PTEP24H48)\n24-well cell culture plates\nAdditional reagents and equipment for preparing single-cell suspension (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0002]) and immunohistochemistry and image quantification of events positive for cleaved caspase-3 (see Support Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0007])\n1. Place 12 transwell inserts into wells of a 24-well cell culture plate. Fill each well and transwell insert with 3 ml vitronectin working solution to prepare both culture surfaces. After 1 hr of incubation, remove inserts and place in a new 24-well cell culture plate.\n2. Aspirate vitronectin from the wells of the first 24-well plate and replace with 0.5 ml Essential 8 medium supplemented with 10 μM Y-27632.\n3. Remove vitronectin from the transwell inserts and replace with 0.5 ml Essential 8 medium supplemented with 10 μM Y-27632. Add a further 2 ml Essential 8 medium supplemented with 10 μM Y-27632 to well below the insert.\nThe volume of medium across the well and transwell insert will equilibrate over time, so the level of medium in the transwell may lower from that initially observed. Ensure that the level of medium does not drop to a level that exposes the vitronectin-coated transwell membrane, as this will negatively impact cell attachment.\n4. Place 24-well plates in a 37°C incubator until ready for cell seeding.\n5. Create single-cell suspensions of both hPSC cultures from T12.5 flasks of two different hPSC populations, with at least one population fluorescently labeled, as outlined in Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0002].\n6. Resuspend each hPSC subline at 1.0 × 105 cells/ml in Essential 8 medium supplemented with 10 μM Y-27632.",
    "7. Remove 24-well plates from step 4 from the incubator and seed 1.5 × 104 cells into both each coated well and each insert, with a total of six wells and inserts per cell line.\n8. Culture cells on the plate surface and in the inserts independently for 24 hr at 37°C to facilitate attachment.\n9. Aspirate medium containing Y-27632 and place inserts into the appropriate wells containing the corresponding cell line.\nThat is, for each cell line, place inserts into three wells corresponding to the same cell population and three inserts into wells corresponding to the opposing cell line.\n10. Add 2.5 ml fresh Essential 8 medium without Y-27632 to each insert-containing well.\n11. Culture cells at 37°C, replacing the medium daily for a further 3 days.\n12. Remove inserts from the wells and aspirate old culture medium. Wash each well once with 1 ml DMEM/F12 medium.\n13. Aspirate majority of DMEM/F12, leaving a thin layer of medium coating the cells, and fix with 2 ml of 4% PFA for 15 min at room temperature.\n14. Process for immunohistochemistry and image quantification of events positive for cleaved caspase-3 as described in Support Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0007].",
    "In Basic Protocols 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0006] to 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0009], the levels of apoptosis must be evaluated using an image analysis-based approach, as the application of flow cytometry (Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0005]) is not feasible. In this protocol, cells are fixed and subsequently stained for the apoptosis marker cleaved caspase-3 in situ. Following staining, the cells are imaged using a fluorescent microscopy platform and quantified using open-source software tools to calculate the proportion of apoptotic events.\nMaterials\nFixed hPSCs (see Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0006], 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0008], or 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0009])\nPBS supplemented with 0.5% (w/v) Triton X-100\nPBS supplemented with 1% (w/v) BSA and 0.3% (w/v) Triton X-100\nAnti-cleaved caspase-3 primary antibody (e.g., Cell Signaling Technology, cat. no. 9661)\nSecondary antibody (e.g., Goat Anti-Rabbit AffiniPure IgG+IgM H+L Alexa Fluor® 647, Stratech, cat. no. 111-605-003-JIR)\nHoechst 33342 (Thermo Fisher Scientific, cat. no. H3570)\nPBS, without calcium and magnesium chloride\nInCell Analyzer (GE Healthcare) or another fluorescent microscopy platform\n1. Following fixation, aspirate PFA and permeabilize fixed hPSCs in PBS supplemented with 0.5% Triton X-100 for 10 min at room temperature.\nIt is recommended that in the following steps, the volume of solution across the wells is no less than 150 μl/cm2.\n2. Remove permeabilization solution and block with PBS supplemented with 1% BSA and 0.3% Triton X-100 for ≥1 hr.\n3. After blocking, incubate with anti-cleaved caspase-3 primary antibody diluted in blocking solution for either 1 hr at room temperature or overnight at 4°C.\nThe antibody dilution for each batch of antibody should be determined by titration. In our experiments, anti-cleaved caspase-3 antibody was used at a dilution of 1:400 for immunohistochemistry.\n4. Remove primary antibody solution and perform three washes with blocking solution. Incubate for 5 min per wash.\n5. Prepare a secondary antibody solution containing an appropriate secondary antibody and 10 μg/ml Hoechst 33342 diluted in blocking solution.",
    "6. Incubate cells with secondary antibody solution for ≥1 hr at 4°C protected from light.\n7. Remove secondary antibody solution and perform another three washes with blocking solution. Incubate for 5 min per wash.\n8. Aspirate blocking solution and replace with PBS.\nPause point: Cells can be stored in PBS for up to 2 weeks at 4°C prior to imaging.\n9. Image cells using an InCell Analyzer or another fluorescent microscopy platform.\n10. Quantify number of cells and positive cleaved caspase-3 events using open-source software such as CellProfiler (Stirling et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-bib-0031]) or Fiji (Schindelin et al., 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-bib-0030]).",
    "The cell confrontation assay can be employed to distinguish between receptor-mediated cell competition and mechanical competition. Here, two cell populations are plated onto each side of a culture insert. Removal of the insert leaves a defined gap between the populations. As the cell populations expand and migrate, they meet at a defined border (Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-fig-0004]). The occurrence of apoptosis only at the border would be indicative of receptor-mediated cell competition, whereas apoptosis that occurs many cell diameters away suggests mechanical cell competition. This protocol again utilizes cleaved caspase-3 as a marker of apoptosis to identify the regions of cell death across the two cell populations after they have been cultured for a period of time following contact.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/57c964a8-510a-44a1-9b92-813cc1a31338/cpz1435-fig-0004-m.jpg</p>\nFigure 4\nSetting up the cell confrontation assay in Basic Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0008]. (A) Place a 2-well culture insert into a well of a 12-well plate. The inner wells of the insert are partially filled with medium supplemented with 10 μM Y-27632, as is the remaining area of the well. (B) Prepare a homotypic border by seeding unlabeled and fluorescently labeled versions of loser hPSCs into separate wells of the culture insert. (C) Prepare a heterotypic border by seeding unlabeled loser hPSCs in one well of the culture insert and fluorescently labeled winner hPSCs in the other well. After 24 hr, remove the culture inserts from (B) and (C) and culture the cells in the wells in medium without Y-27632 until the opposing cell fronts have been in contact for ∼48 hr.\nMaterials\nVitronectin (Thermo Fisher Scientific, cat. no. A14700) working solution (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0004], step 1)\nEssential 8 medium (Thermo Fisher Scientific, cat. no. A1517001) supplemented with 20 μM Y-27632 (Generon, cat. no. A11001-10), 37°C",
    "T12.5 flasks of unlabeled loser hPSCs and fluorescently labeled loser and winner hPSCs and (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0001])\nDMEM/F12 medium (Merck Life Science, cat. no. D6421), 37°C\nEssential 8 medium (Thermo Fisher Scientific, cat. no. A1517001), 37°C\n4% (w/v) PFA\n12-well cell culture plate\nSterile tweezers\n2-well silicone inserts (Ibidi, cat. no. 80209)\nInverted microscope\nAdditional reagents and equipment for preparing single-cell suspension (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0002]) and immunohistochemistry and image quantification of events positive for cleaved caspase-3 (see Support Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0007])\n1. Coat center two wells of a 12-well cell culture plate with 1 ml vitronectin working solution and incubate for 1 hr at room temperature.\n2. Aspirate vitronectin and, using sterile tweezers, place a 2-well silicone insert into center of each well. Gentle press down on corners of the inserts with either the tweezers or a sterile gloved fingertip to ensure that inserts have fully attached to the culture surface.\nIf you are struggling to attach the silicone inserts to the wells, it is most likely due to incomplete aspiration of the vitronectin. We have found that a second aspiration of vitronectin from the region of the well where you are trying to place the insert will usually improve the insert attachment.\n3. Add 25 μl Essential 8 medium supplemented with 10 μM Y-27632 to each chamber of the insert.\nEnsure that the medium covers the entire surface of the well inside the chamber, as this prevents the vitronectin-coated surface from drying out, which can negatively affect cell attachment.\n4. Using a P1000 pipet, gently add 500 μl Essential 8 medium supplemented with 10 μM Y-27632 to outer area of each well.\n5. Prepare single-cell suspensions from T12.5 flasks of unlabeled loser hPSCs and fluorescently labeled loser and winner hPSCs as described in Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0002].",
    "6. Resuspend each hPSC subline at 1.0 × 106 cells/ml in Essential 8 medium supplemented with 10 μM Y-27632.\n7. In one of the pre-prepared wells containing inserts from step 4, plate 5 × 104 unlabeled loser hPSCs in one well of the insert and 5 × 104 fluorescently labeled loser hPSCs in the other.\nThis condition creates a homotypic control border.\n8. In the other pre-prepared well, plate 5 × 104 unlabeled loser hPSCs in one well of the insert and 5 × 104 fluorescently labeled winner hPSCs in the other.\nThis condition creates a heterotypic border.\nPlate 5 × 104 cells, that is, 50 μl of the 1.0 × 106 cells/ml suspension per well of the silicone insert.\n9. Culture cells for 24 hr at 37°C to facilitate attachment.\n10. Check that cells have attached properly after plating under an inverted microscope and then gently remove 2-well silicone insert with sterile tweezers.\n11. Remove medium containing Y-27632 and wash cells once with 1 ml DMEM/F12 medium.\n12. Replace with 2 ml fresh Essential 8 medium without Y-27632 and replenish daily.\n13. Culture cells for ∼4 days, monitoring the progression of the cell fronts under an inverted microscope, until the opposing cell fronts have been in contact with each other for 48 hr.\n14. After the opposing cell fronts have been in contact for ∼48 hr, remove culture medium and wash once with 1 ml DMEM/F12.\n15. Aspirate majority of the DMEM/F12, leaving a thin layer of medium coating the cells, and fix with 2 ml of 4% PFA for 15 min at room temperature.\n16. Process for immunohistochemistry and image quantification of events positive for cleaved caspase-3 as described in Support Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0007].",
    "Mechanical cell competition is underpinned by differences in sensitivity to mechanical forces between two cell populations. For example, loser cells with higher sensitivity to cell crowding and compaction are unable to tolerate the higher densities achievable by the less sensitive winner population (Price et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-bib-0018]; Wagstaff et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-bib-0025]). In a co-culture scenario, this difference in compaction sensitivity leads to elimination of the loser cell population induced by cell crowding conditions. Using a compression assay originally described by Wagstaff et al. (2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-bib-0025]), it is possible to directly test a cell line's sensitivity to compaction. In this protocol, cells are seeded onto a polydimethylsiloxane (PDMS) membrane that has been stretched in the uniaxial direction. Release of the stretched membrane back to its resting length induces compression in the seeded cells. Through analysis of apoptosis levels in compressed cells compared to their unstretched counterparts, it is possible to determine any differences between winner and loser hPSCs in their response to cell compaction (Fig. 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-fig-0005]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/7bfd6e4a-468f-4f0a-a667-afd3e780f372/cpz1435-fig-0005-m.jpg</p>\nFigure 5",
    "Workflow for the cell compression assay in Basic Protocol 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0009]. (A) Stretch a four-well PDMS chamber by 35% relative to its resting length. The length of the chamber is defined as distance “A.” Winner and loser hPSC populations are seeded at high and low densities into wells of the stretched chamber in medium supplemented with 10 μM Y-27632 for 16 hr. (B) After 16 hr, the medium is exchanged to remove the Y-27632, and the cells are incubated for 4 hr. Subsequently, the stretched chamber is released back to its original length to induce compression in the winner and loser hPSC populations. (C) After 5 hr under compression, fix the cells and process them for cleaved caspase-3 immunohistochemistry analysis. Membranes from each well can be excised using a scalpel and mounted onto fresh glass slides for imaging.\nMaterials\nVitronectin (Thermo Fisher Scientific, cat. no. A14700) working solution (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0004], step 1)\nEssential 8 medium (Thermo Fisher Scientific, cat. no. A1517001) supplemented with 20 μM Y-27632 (Generon, cat. no. A11001-10), 37°C\nT12.5 flasks of two different hPSC populations (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0001])\nDMEM/F12 medium (Merck Life Science, cat. no. D6421), 37°C\nEssential 8 medium (Thermo Fisher Scientific, cat. no. A1517001), 37°C\n4% (w/v) PFA\nPBS, without calcium and magnesium chloride\nVectashield mounting medium (Vectashield Vibrance Antifade Mounting Medium, Vector Laboratories, cat. no. H-1700)\nAutoclave\nSterilization pouches\nFour-well PDMS stretch chambers (Strex, cat. no. STB-CH-4W)\nManual cell-stretching system (Strex, cat. no. STB-100-10)\nPetri dishes or culture plates\nCalipers, electronic or dial\nInverted microscope\nCeramic tiles or thick glass slides\nThin-bladed scalpel or razor blade\nGlass slides\nTweezers\nInCell Analyzer (GE Healthcare) or another fluorescent microscopy platform",
    "Additional reagents and equipment for preparing single-cell suspension (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0002]) and immunohistochemistry and image quantification of events positive for cleaved caspase-3 (see Support Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0007])\nPreparing the stretching chamber\n1. Autoclave two four-well PDMS stretch chambers in sterilization pouches prior to use.\n2. Load one four-well PDMS stretch chamber onto the manual cell-stretching system and place into a petri dish or culture plate. Using calipers, measure resting length of the chamber, shown as length “A” in Figure 5A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-fig-0005].\n3. Place other four-well PDMS stretch chamber into another petri dish or culture plate.\nThis membrane will not be stretched and is treated as an uncompressed control.\n4. Twist dial on the stretching system handle to stretch the PDMS chamber until it stretches by 35% relative to its resting length. Confirm correct increase in length “A” using calipers.\n5. Coat each well, in both the stretched and the unstretched chambers, with 1 ml vitronectin working solution and incubate for 1 hr at room temperature.\n6. Aspirate vitronectin and replace with 0.5 ml Essential 8 medium supplemented with 10 μM Y-27632.\nPlating cells onto PDMS membranes\n7. Create single-cell suspensions of both hPSC cultures from T12.5 flasks of two different hPSC populations, as outlined in Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0002].\n8. Resuspend each hPSC subline at 2 × 106 cells/ml in Essential 8 medium supplemented with 10 μM Y-27632.",
    "9. In each four-well PDMS chamber, seed two wells per cell line. Seed first well at a high density (between 4 × 105 cells/cm2 and 5 × 105 cells/cm2) to form a confluent monolayer. Seed second well at a low density (between 1 × 105 cells/cm2 and 1.25 × 105 cells/cm2, or 25% that plated in the high-density condition). Adjust volume in each well to a final volume of 1 ml with Essential 8 medium supplemented with 10 μM Y-27632.\nSeeding two wells for each population allows for both cell populations and both density conditions to be assessed in the same stretched chamber.\n10. Place lid on the petri dishes or culture plates and culture cells for 16 hr at 37°C.\nThe lids typically provide adequate protection from the incubator environment while allowing constant gas exchange. However, if required, antibiotics such as gentamicin or penicillin-streptomycin can also be included in the culture medium.\nInducing cell compression\n11. Check that cells have attached to the PDMS chambers using an inverted microscope before aspirating the medium and washing each well with 1 ml DMEM/F12 medium.\n12. Repeat wash as in step 11 so that the wells have been washed twice.\n13. Replace medium in each well with 1 ml Essential 8 medium without Y-27632 and incubate for a further 4 hr.\n14. Release stretch on the chamber under uniaxial load by unscrewing the dial on the stretching system until length “A” of the PDMS chamber is restored to its original resting distance.\nRelease of the stretch induces compaction in the seeded cells.\n15. Incubate compressed and control chambers for a further 5 hr.",
    "16. Remove majority of the medium with a P1000 pipet, taking care not to touch or damage the PDMS membrane and leaving behind a thin layer of medium coating the cells.\n17. Fix with 1 ml of 4% PFA for 15 min at room temperature.\n18. Process for immunohistochemistry for cleaved caspase-3 staining as outlined in Support Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0007].\nPreparation of PDMS membranes for image analysis\n19. After completing the secondary antibody washes in Support Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0007], step 7, cover a ceramic tile or thick glass slide with a thin layer of PBS before placing four-well PDMS stretch chamber on top.\nThe PBS layer prevents the PDMS membrane from sticking to the ceramic tile or glass slide during dissection of the wells in step 20.\n20. Using a thin-bladed scalpel or razor blade, cut around edge of the wells to dissect the PDMS membrane from the chamber walls.\n21. Dispense 20 μl Vectashield mounting medium onto a clean glass slide.\n22. Gently lift PDMS membrane away from the chamber wells using a pair of tweezers and lay onto mounting medium.\nMount the samples with the surface containing cells face down on the mounting medium.\n23. Store on a flat, dry surface for 2 hr in the dark.\n24. Capture 64 random fields from each PDMS membrane using the InCell Analyzer or another fluorescent microscopy platform. Quantify resulting using open-source software such as CellProfiler (Stirling et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-bib-0031]) or Fiji (Schindelin et al., 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-bib-0030]) to identify nuclei and positive cleaved caspase-3 signal.",
    "During mechanical competition, the compaction forces generated can also remove loser cells via mechanisms that do not require initial onset of cell death. Instead, increased compression forces caused by cell crowding can eliminate losers by extruding them from within the monolayer, after which the cells die by anoikis (Matamoro-Vidal & Levayer, 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-bib-0012]). The protocol below describes how to use confocal time-lapse imaging and live-cell caspase dyes to determine the timing and location of loser cell elimination during mechanical competition (Fig. 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-fig-0006]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/9d07c01b-094f-40a6-9f95-222c49ecdf31/cpz1435-fig-0006-m.jpg</p>\nFigure 6\nSchematic representation of Basic Protocol 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0010]. (A) Establish a co-culture of fluorescently labeled winner and loser hPSCs and culture until the time point of interest. Supplement the medium with live-cell caspase-3/7 dye and image on a confocal time-lapse microscope for 15 to 24 hr. (B) Assess the timing of cell death and the location of cells that undergo cell death. Activation of caspase-3/7 signal in eliminated cells prior to their removal from the culture monolayer indicates compression-induced cell death. Alternatively, extrusion of loser cells from the culture monolayer followed by subsequent activation of caspase-3/7 signal suggests elimination via anoikis.\nMaterials\nVitronectin (Thermo Fisher Scientific, cat. no. A14700) working solution (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0004], step 1)\nEssential 8 medium (Thermo Fisher Scientific, cat. no. A1517001) supplemented with 20 μM Y-27632 (Generon, cat. no. A11001-10), 37°C\nT12.5 cultures of fluorescently labeled loser and winner hPSCs (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0001])\nDMEM/F12 medium (Merck Life Science, cat. no. D6421), 37°C\nEssential 8 medium (Thermo Fisher Scientific, cat. no. A1517001), 37°C\nReverse-osmosis (RO) water\nEssential 8 medium (Thermo Fisher Scientific, cat. no. A1517001) containing Incucyte® Caspase-3/7 Red Dye for Apoptosis (Sartorius, cat. no. 4704) diluted at 1:200\nIbidi μ-Dish, 35 mm (Ibidi, cat. no. 81156)\n15-ml conical Falcon tubes\nInverted microscope",
    "Zeiss LSM 880 microscope, fitted with Airyscan detection unit, cell culture chamber, and ZEN software (Carl Zeiss AG), or another confocal microscope system\n500-ml bottle\nPlan-Apochromat 40×/1.3 Oil DIC UV-IR objective\narivis Vision4D or other appropriate software\nAdditional reagents and equipment for preparing single-cell suspension (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0002])\nPlating a co-culture condition for time-lapse\n1. Coat an Ibidi μ-Dish with 1 ml vitronectin working solution and incubate for 1 hr at room temperature.\n2. Aspirate vitronectin and replace with 0.5 ml Essential 8 medium supplemented with 10 μM Y-27632. Place dish in a 37°C incubator until ready for cell seeding.\n3. Prepare single-cell suspensions from T12.5 cultures of fluorescently labeled loser and winner hPSCs as described in Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.435#cpz1435-prot-0002].\n4. Resuspend each hPSC subline at 1.0 × 105 cells/ml in Essential 8 medium supplemented with 10 μM Y-27632.\n5. Create a mosaic cell suspension at a ratio of 50:50 by mixing equal volumes of the suspensions at 1 × 106 cells/ml suspensions from each hPSC subline in a pre-labeled “co-culture” 15-ml conical Falcon tube.\nA final cell suspension volume of ≥1 ml is recommended.\n6. Retrieve pre-prepared Ibidi μ-Dish from the incubator from step 1 and plate cells at a density of 4.4 × 104 cells/cm2.\nThat is, plate 157.5 μl of the mosaic cell suspension.\n7. Check cells under an inverted microscope and then place dish in a 37°C, 5% CO2 incubator and manually agitate back and forth and side to side to evenly distribute cells across the growth surface. Incubate for 24 hr.\n8. Twenty-four hours following plating, aspirate old medium containing Y-27632 and wash once with 1 ml DMEM/F12 medium. Replace with 1 ml Essential 8 medium without Y-27632 and return to incubator.\n9. Replenish culture medium daily until ready to start imaging.",
    "In our experimental setup using a 50:50 ratio at 4.4 × 104 cells/cm2, cells were cultured for a further 48 hr, until Day 2.\nDay before imaging\n10. Heat chamber and stage of the Zeiss LSM 880 microscope or another confocal microscope system to 37°C, place a 500-ml bottle of clean RO water at back of the chamber, and leave to stabilize overnight.\nIf it is not possible to stabilize overnight, leave for a minimum of 2 hr before mounting samples.\nDay of imaging\n11. Aspirate old culture medium and wash cells once with 1 ml DMEM/F12.\n12. Remove DMEM/F12 and feed cells with 1 ml fresh Essential 8 medium containing Incucyte® Caspase-3/7 Red Dye for Apoptosis diluted at 1:200.\nProtect the culture disk from light to prevent the caspase-3/7 dye from degrading.\n13. Load dish onto the microscope stage and supply with 5% CO2.\nTime-lapse imaging\n14. Using a Plan-Apochromat 40×/1.3 Oil DIC UV-IR objective, acquire a z-stack of 10 μm from positions of interest starting below the central position of the nucleus and finishing beyond the apical surface. Capture fields of interest every 10 min for a 15- to 24-hr period.\nThe acquisition mode settings we typically use are as follows: Airyscan mode = fast, scan mode = stack, zoom = 2.0, pixel dwell = 1.81 μs, scaling X = 0.092 μm, scaling Y = 0.092 μm, scaling Z = 0.534 μm, image size: x = 106.27 μm, y = 106.27 μm. Laser powers are usually kept <2% on channels detecting H2B-reporter fluorescence and <6% on the channel collecting live-cell caspase-3/7 dye signal, and the master gain = 780.\nIf available, it is recommended to use a definite focus system to prevent focal drift.\n15. Process raw Airyscan images in the microscope software using the auto-strength settings.",
    "Processing can be done parallel to acquisition using the online mode if available.\n16. Render processed data into a 4D movie using arivis Vision4D or other appropriate software."
  ],
  "subjectAreas": [
    "Stem Cell Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}