{
  "id": 13805,
  "origin_website": "Jove",
  "title": "Isolation and Enrichment of Human Adipose-derived Stromal Cells for Enhanced Osteogenesis",
  "procedures": [
    "NOTE: All patient samples were obtained with informed consent, and experimental protocols were reviewed and approved by Stanford University Institutional Review Board (Protocol #2188 and #9999).\n1. Cell Isolation and Culture:\nObtain human subcutaneous adipose tissue from healthy female patients undergoing elective lipoaspiration of the abdomen, flank, and/or thigh region under local/general anesthesia. Ensure that Institutional Review Board (IRB) approval has been obtained for the protocol of isolating ASCs from human tissues, and follow institutional safety precautions while working with such materials.\nTo obtain the SVF from the lipoaspirated adipose tissue, first wash the lipoaspirate three times with equal volumes of 1x sterile phosphate-buffered saline (PBS). Carefully aspirate and discard the bottom aqueous layer.\nPrepare the collagenase digestion buffer: 0.075% Type I collagenase in Hank’s Balanced Salt Solution (HBSS). Prepare FACS buffer: 2% FBS, 1% P188 and 1% Pen-Strep in PBS. Filter both solutions using a commercially available 0.22 μm pore size fast flow polyethersulfone filter.\nTo digest the washed adipose tissue, add an equal volume of collagenase digestion buffer and place digestion vessel securely in a shaking water bath for 60 min at 37 °C (approximately 180 shakes/min).\n\tNOTE: It is best to use a larger volume digestion vessel than required, as this allows for maximal digestion during shaking (i.e., 250 ml of collagenase digestion buffer, 250 ml of washed adipose tissue in a 1L sterile flask).\nNeutralize enzymatic activity by adding an equal volume of FACS buffer and allowing to sit at RT for 5 min. Next, centrifuge at 233 x g for 20 min at 4 °C.\nCarefully aspirate and discard the supernatant, taking care not to disturb the high-density SVF pellet.",
    "Resuspend the pellet in 5-10 ml of RT red cell lysis buffer, based on pellet size. Leave solution to sit at RT for 5 min and centrifuge at 233 x g for 5 min at RT.\nAspirate supernatant and resuspend the pellet by adding 5-10 ml of traditional growth media, based on pellet size (Dulbecco's Modified Eagle Medium [DMEM]/10% FBS/1% penicillin-streptomycin solution [pen-strep]).\nFilter the suspension through a 100 μm nylon cell strainer to remove cellular debris.\nCentrifuge at 233 x g for 5 min at 4 °C, and discard the supernatant without disrupting the pellet.\nResuspend the pellet in 5-10 ml of traditional growth media, based on pellet size.\nPlace 2 x 106 cells in a 15 cm standard culture dish and establish primary cultures O/N at 37 °C/21% O2, 5% CO2. Maintain at sub-confluent levels to prevent spontaneous differentiation at 37 °C/21% O2, 5% CO2 in growth media.\n\tNOTE: Cell density in a fully confluent 15 cm plate is approximately 4-6 x 106 cells.\n2. Staining\nCulture ASCs in traditional growth medium at 37 °C/21% O2, 5% CO2, for 36 hr before staining/sorting.\nLift ASCs from culture plates using Accutase (as per manufacturer’s protocol).\nWash cells once with FACS buffer (PBS with 2% FBS and 1% pen-strep).\nCentrifuge at 233 x g for 5 min at 4 °C.\nDiscard the supernatant without disrupting the pellet. Resuspend the cells in 0.5-1 ml of FACS buffer (depending on cell number and amount of antibody desired).\n\tNOTE: The volume of the cell suspension, in accordance with the FACS antibody manufacturer’s recommendations, determines antibody concentration. However, titration of antibody concentration, using a starting concentration of 1:100, is usually advised if it is the first time to use an antibody.\nCount the total number of cells using a hemocytometer.",
    "Reserve 100 ul aliquots in 1.5 ml centrifuge tubes to be used for an unstained sample and single-color controls (according to the number of fluorescent antibodies used).\nAdd the appropriate fluorescently-labeled monoclonal antibodies (at predetermined concentrations, per manufacturer’s instructions) and incubate for 20-30 min on ice, shielded from light.\n\t\nTo label osteogenic subpopulation: Dilute anti-CD90 (APC anti-human CD90 (Thy1)) or anti-CD105 (FITC anti-human CD105 (endoglin)) in FACS buffer to a concentration of 1:50.\nTo label other cell populations (e.g., hematopoietic and endothelial cells): Dilute anti-CD45 (Anti-Human CD45 Pacific Blue), anti-CD34 (Anti-Human CD34 APC), and/or anti-CD31 (Anti-Human CD31 PE) in FACS buffer to a concentration of 1:50.\nIf not using directly conjugated antibodies, use a biotinylated primary antibody with an appropriate streptavidin-conjugated secondary antibody, such as Streptavidin PE-Cy7, at a dilution of 1:100.\nAfter incubation, wash the cells twice: fill tubes with FACS buffer and centrifuge at 233 x g for 5 min at 4 °C, aspirating supernatant.\nResuspend the cells in 400-500 μl FACS buffer and filter samples through a 70 μm nylon cell strainer to remove cell clumps.\nTransfer labeled cells into FACS tubes with filter top and keep samples on ice for the duration of analysis.\n3. Fluorescence-activated Cell Sorting\nNOTE: The following steps mandate previous knowledge in fluorescence-activated cell sorting (FACS) or the assistance of a skilled technician.\nUsing the appropriate FACS software, design analysis plots to examine forward scatter (FSC), side scatter (SSC), Phycoerythrin (PE)-Texas Red, Pacific Blue, Fluorescein Isothiocyanate (FITC), Allophycocyanin (APC) and any other fluorophore used to label cells.\nPrior to loading into the cell sorter, briefly vortex each sample to resuspend the cells.\nCommence with analysis of the unstained sample in order to set gates for the total cell population, to exclude cellular debris, and to determine baseline autofluorescence.",
    "Add propidium iodide (PI) to the unstained sample and analyze it in order to visualize the population of live cells within the total cell population. Construct a gate around this population.\nAnalyze a single-color control sample for each fluorochrome in order to set fluorescence compensation.\nAnalyze the stained sample to set the position of gates for sorting.\nAdd PI to the stained sample in order to stain dead cells.\nSort the labeled cell populations. Sort into either 1.5 ml centrifuge tubes or conical tubes (15 ml) containing culture medium.\nManually cease sorting once the required quantity of cells has been obtained.\nUsing FACS, perform a purity check by analyzing a small fraction (e.g., 500 cells) of the acquired cell population.\n\tNOTE: This step confirms the purity of the sorted cell populations. Ideally, purity should be greater than 90-95%.\nCentrifuge cells at 233 x g for 5 min at 4 °C immediately following completion of sorting and resuspend in 1 ml of fresh medium containing 10% FBS.\n\tNOTE: The amount of media used may be increased based on the size of the cell pellet.\nPlate on gelatin-coated plates to improve cell viability. Depending on final cell yield, plate 300,000 cells per well in a 6-well plate, 100,000 cells per well in a 12-well plate.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}