{
  "id": 10660,
  "origin_website": "Jove",
  "title": "Biomechanical Analysis Methods to Assess Professional Badminton Players' Lunge Performance",
  "procedures": [
    "The experiment was approved by the Ethics Committee of the Faculty of Sports Science in Ningbo University. All the participants have signed written consents and were told about the requirements and process of the lunge experiment.\n1. Gait Laboratory Preparation\nWhen calibrating, remove or cover other potentially reflective items in the volume, avoid the effects of reflections from sunlight, light, and other reflective items on the identification, and ensure a reasonable fluorescent light in the laboratory.\nPlug the dongle into the PC and turn on the motion capture cameras, proprietary tracking software, force platform amplifiers, and the external analog-to-digital converter (ADC).\nPlace eight cameras on both sides of the simulated badminton court. Initialize the cameras. Select the Local System node from the System resources pane, and each of the camera nodes will display a green light if selected correctly.\n\t\nIn the Camera view pane, click Properties to adjust the camera parameters: set the Strobe Intensity to 0.95 to 1, the Threshold to 0.2 - 0.4, the Gain to times 1 (x1), the Grayscale mode to Auto, the Minimum circularity ratio to 0.5, the Max blob height to 50, and select Enable LEDs.\nSelect Camera in the Perspective pane and put the T-frame on the force plate. In the System resources pane, click the MX Cameras, and select multiple cameras to adjust the parameters.\n\t\nIn the Setting section, set the parameters of all selected cameras to ensure that data transmitted from each camera can be seen.\nSelect the 5 marker wand & T-frame in the drop-down menu of the T-frame and select all the cameras.\nClick the split screen button in the upper right corner of the Properties pane. Select the Camera Positions in the Option panel and click the Off button in the drop-down menu of the Extended Frustum.",
    "Wave the T-frame around the capture volume and stop until the blue light of the camera stops flashing.\nStart the calibration, which means the camera continuously collects the data of the markers and displays the collected valid data in the MX Cameras Calibration Feedback toolbar below the Tools pane. Finish the calibration; the progress bar returns to 0%. Ensure the value displayed in the Image Error is less than 0.3.\nPut the T-frame on the force plate (60 x 90 cm) with the axis along the edge of the plate. Ensure that the direction of the T-frame is in accordance with the experimental direction.\nEnsure that the origin of the T-frame is also that of capture volume. Click the Start button from the Set volume origin in the Tool pane to set the origin.\nAsk the subjects to stand on the force plate. Confirm that the direction of the ground reaction vector is upward. Ask the subjects step off the force plate.\nBefore starting the trials, click the Force, and select Zero Level. Find the valid data collected in the Wand Count and ensure that each camera collects at least 1,000 frames of valid data.\nPrepare 16 markers of 14 mm in diameter and paste double-sided tape on them in advance.\n2. Subject Preparation\nLet potential subjects fill in a questionnaire survey. Obtain written informed consent from the subjects that fulfill the inclusion criteria.\n\tNOTE: Questions: (i) How many years have you played badminton? (ii) Have you participated in professional national level badminton competitions? (iii) Have you suffered any sports injuries and received surgeries? Here, a total of 16 male participants took part in the study: eight professional badminton players and eight amateur badminton players.\nDetermine of the subjects meet the criteria.",
    "​NOTE: The criteria include the following items. All participants did not suffer from any injuries in the upper and lower limbs in the six months before the study; the subjects also did not take part in any high-intensity training or competition 2 d before the experiment; for all subjects, the right hand and leg were dominant. Half of the subjects were professional players, half were amateur players; this resulted in eight subjects who are professional badminton players (ages: 23.4 ± 1.3 years; height: 172.7 ± 3.8 cm; mass: 66.3 ± 3.9 kg; badminton-playing years: 9.7 ± 1.2 years) and have participated in professional national level competitions, and eight subjects who are amateur badminton players (ages: 22.5 ± 1.4 years; height: 173.2 ± 1.8 cm; mass: 67.5 ± 2.3 kg; badminton playing years: 3.2 ± 1.1 years).\nAsk the subjects to wear T-shirts and tight shorts.\nMeasure the subjects' height (mm) and weight (kg), as well as the length of both left and right leg (mm) from the superior iliac spine to the ankle internal condyle, the knee widths (mm) from the medial to the lateral knee condyle, and the ankle widths (mm) from the medial to the lateral ankle condyle.\nMark the skin areas of the anatomical bony landmarks to place the makers.\n\t\nShave body hair as needed and wipe the skin with alcohol.\n\t\tNOTE: The marker locations include spaces bilaterally located to the anterior-superior iliac spine, posterior-superior iliac spine (PSI), lateral thigh (THI), lateral knee (KNE), lateral tibia (TIB), lateral ankle (ANK), heel (HEE), and toe (TOE).\nPalpateto identify the anatomical landmarks. Paste the 16 markers on the lower limb.",
    "Ask the subjects to wear the same brand and series of badminton shoes; then, let them perform a right forward lunge naturally, and ensure the markers on their lower limbs are captured by the cameras.\nAsk the subjects to perform the right forward lunge at a comfortable low speed in the simulated court until they can perform the movement steadily, and instruct them to perform some auxiliary exercises (e.g., marching lunge leg stretch) to warm up.\nAsk the subjects to perform the right forward lunge at a comfortable high speed in the simulated court until they can perform the movement steadily at this speed; then, ask them to put their right leg in the designated area (position B in Figure 1) and underhand strike the shuttlecock to the backcourt (position C).\nInstruct the subjects to perform a maximal right forward lunge from start position A (Figure 1) and underhand strike the shuttlecock to the backcourt (position C), ensuring that their right leg naturally steps on and fully contacts the force platform as they pass, and the subjects must go back to start position A after striking the shuttlecock.\n3. Static Calibration\nOpen the Data Management to create a new database. Select the Location, type in the name, and select Based on | Clinical template; then, click on Create.\nSelect the subject's name and click on Open. Click on New patient classification | New patient | New session in order to create the subjects' information.\nAt the beginning of the trials, select Session to capture data. Return to the Nexus pane, click on Subjects, and then, click the New subject button. Rename the trials if necessary.\nClick on Go Live, select Split horizontally, and select Graph to view the Trajectory Count.",
    "Check the number of the markers, which is 16, indicating that there is no unwanted light pollution and all the markers have been captured.\nStart to capture static data. In the Subject Preparation section of the toolbar, select Subject Capture and click the Start button. Ask the subjects to stay still and capture 200 frames of images. Click the Stop button.\nClick on Run the reconstruct pipeline to construct markers data. Select Label, identify in the markers' list, and apply the labels to the corresponding markers. Click the Save button. Press the Esc key to exit.\nClick the Subject Preparation and select the Static plug-in gait in the Subject calibration drop-down menu.\nClick Option in the Frame range window that is newly displayed and select Left foot and Right foot in the pop-up window. Select the Start button and, then, save.\n4. Dynamic Trials\nAsk the subject to be in the proper start position.\nAfter creating the static template, click the Go Live button and select the Capture. Set the Trial Type and the Session in order. Type in a trial name, and the Description is optional.\nClick the Start button in the last option to start capturing and stop after finishing the process. Just repeat the process for each trial.\n\t\nIn order to conduct experiments, ask the subjects to perform the lunge fast and naturally. Ensure there is a 2 min interval between each trial.\nAsk the subjects the perform the right forward lunge, of which the last step is on the force plate. Require the subjects to perform the movement 6x. If the markers shift or drop, reattach them promptly and capture again.\nSelect Stop after the subjects perform a maximal right forward lunge and go back to position A (start/finish position).\n5. Postprocessing",
    "Use special software for postprocessing. Open Data management, double-click the x icon under Files, and click the Run the reconstruct pipeline and labels button; then, click Play under the Perspective pane to play the captured video.\nDrag the pointers on the progress bar under the Perspective pane to set the start and end time of the video.\nPlace the cursor within the progress bar, and right-click to select Zoom to Region-of-Interest.\nThe identification step is the same as the static identification process. Check the markers and click Fill. Check if all the markers are identified by observing their trajectories. Right-click on unlabeled markers and select Delete all unlabeled.\nClick Start, and the files will be exported in .csv format for postprocessing.\n6. Data Analysis\nFilter kinematic and kinetic data using low-pass Butterworth filters with frequencies at 10 Hz and 25 Hz.\nCalculate the ROMs of the knee and the ankle on sagittal, frontal, and horizontal planes, and obtain the knee and ankle moments through the approach of three-dimensional inverse dynamics.\n\tNOTE: The ROMs of the ankle and knee were obtained from the maximum and minimum joint angles on three-dimensional movement planes.\nDivide the lunge into four phases, which include the initial impact peak (I, 5% of the stance), the secondary impact peak (II, 20% of the stance), weight acceptance (III, 40% - 70% of the stance), and the drive-off (IV, 80% of the stance).\nStandardize all joint moment data by using the subjects' weights.\nCollect ground reaction forces and kinematic data at the same time. For each subject, use the mean values of the kinematic and kinetic data of six successful trials for statistical analysis.\n\tNOTE: The parameters include the joint (i.e., ankle, knee, and hip) three-dimensional ROMs and the knee and ankle moments.",
    "Transmit the data to the software for analysis.\n7. Statistical Analysis\nExamine the data of the captured ankle and knee ROMs and the joint moments, using independent-sampled t-tests between the professional players and the amateur players. Use a two-sample t-test to calculate the appropriate number of subjects. Indicate the joints' ROMs and moments by mean values. Set the significance level at p = 0.05.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}