{
  "id": 10534,
  "origin_website": "Jove",
  "title": "Rodent Behavioral Testing to Assess Functional Deficits Caused by Microelectrode Implantation in the Rat Motor Cortex",
  "procedures": [
    "All procedures and animal care practices were approved by and performed in accordance with the Louis Stokes Cleveland Department of Veterans Affairs Medical Center Institutional Animal Care and Use Committees.\nNOTE: To educate researchers on the decision about the use of a stab injury model as a control, it is recommended to review the work done by Potter et al.21.\n1. Microelectrode Implantation Surgical Procedure\nPre-surgical animal preparation\nAnesthetize the animal in an induction chamber using isoflurane (2 - 4%). While under anesthesia, continuously monitor the animal using a vital measurement system to monitor the heart rate and the blood-oxygen content.\nMove the animal to a nose cone to continue the anesthetic. Subcutaneously (SQ) inject a cephalosporin antibiotic, e.g. cefazolin (25 mg/kg) and a non-steroidal anti-inflammatory, e.g. carprofen (5 mg/kg) to prevent infection and manage the pain, respectively.\nLiberally apply ophthalmic ointment to the animal's eyes to prevent them from drying.\nUsing small animal nail clippers, trim the toenails to prevent the animal from scratching the sutures during the wound healing. Ensure that the nails are not clipped too short, as this can lead to pain and bleeding for the animal.\nShave the animal's head thoroughly from behind the ears to between the eyes using an electric razor trimmer.\nProvide a local analgesia with an SQ injection of bupivacaine (0.3 mL of 0.125% bupivacaine diluted from stock solution) at the top of the animal's head in the area of the incision.\nMount the animal on a stereotaxic frame, using ear bars to keep the head from moving during the surgery. Place a circulating water heating pad under the animal to maintain the animal's internal temperature. \nApply a sterile drape, e.g., institutionally-approved sterile plastic wrap, to isolate the surgical field.",
    "Scrub the surgical area using an alternating betadine solution and isopropanol scrubs.\nPerform a toe pinch according to the institutional protocol to ensure the animal is under the surgical plane.\nPrepare animal for implantation\nCreate an incision of approximately 1 in down midline exposing the skull using a No. 10 scalpel blade. Bluntly remove the periosteum using a cotton-tipped applicator, and stop any bleeding using a gauze pad. Retract the surrounding tissue using alligator clips and clean and dehydrate the skull with hydrogen peroxide.\nPlace a few drops of cyanoacrylate-based tissue adhesive on the exposed skull to improve the dental cement bonding in later steps.\nIn the chosen hemisphere, mark the region of the motor cortex corresponding to forepaw movement approximately 3 mm lateral to midline and 2 mm anterior to bregma by creating a nick in the bone.\nRemove a portion of the skull using a 1.75-mm rounded tip dental drill, taking special consideration not to drill too quickly or too deeply, and supporting one hand on the stereotaxic frame. The drill should be applied to the skull intermittently to avoid overheating31.\nReflect the dura using a fine hooked 45° dura pick.\nClean any bleeding using a cotton-tipped applicator and saline, taking care to not directly touch the brain surface.\nInsertion of microelectrode in motor cortex\nCarefully mount the sterilized microelectrode in the universal holder on the stereotaxic frame, taking caution not to bump the shank of the electrode. Ensure that the headstage interface connector of the electrode is firmly held by the holder.\n\t\tNOTE: Here, a non-functional Michigan-style silicon shank electrode measuring 2 mm x 123 µm x 15 µm was used, and the shank was inserted using fine forceps.\nUsing the micromanipulators on the stereotaxic frame, carefully position the tip of the electrode over the open craniotomy.",
    "Gently lower the electrode approximately 2 mm into the brain using the micromanipulators as a measurement guide (depending on the choice of electrode, an automated insertion at controlled rates may be required.) Take caution to avoid any visible vasculature whenever possible. Once the electrode is in place, carefully release the connector from the universal holder and retract the insertion arm.\nCarefully clean any bleeding from around the electrode using a cotton-tipped applicator and saline.\nSeal off the craniotomy around the implanted electrode using a silicone elastomer.\nFix the electrode to the skull using dental cement.\nOnce the cement is completely dry, bring the edges of the incision together at the front and back of the cement headcap and suture them shut.\nPost-operative care\nAllow the animal to recover on a circulating water heating pad while continuing to monitor its vital signs. Avoid using heat lamps as the temperature from lamps is more difficult to control and animals can overheat.\nOnce the animal is fully awake, move the animal to a clean cage with easy access to food and water.\nDuring post-operative days 1 - 3, provide the animals with SQ cephalosporin antibiotic (25 mg/kg) and a non-steroidal anti-inflammatory (5 mg/kg) to prevent infection and manage their pain.\nMonitor the animals daily for the signs of pain or discomfort, bleeding, weight change, or suture issues through at least post-operative day 5.\n2. Behavioral Testing",
    "For all behavior testing, test the animals 2x per test in the week prior to the electrode implantation surgery to calculate their pre-surgery baseline scores. Following the surgery, allow the animals to rest for 1 week before beginning behavior testing 2x per week on each test. Consistent testing conditions should be used throughout the study for both pre- and post-surgical testing to minimize the effects of stress on the performance, which could result in a measurement of anxiety.\n\t\nClean all testing equipment with a chlorine dioxide-based sterilant at the beginning of each testing session and after each animal.\nFilm the open field grid and ladder testing. These tests require a video camera (1080p, minimum of 15 fps, 78° diagonal field of view), a laptop, and room to store the video data.\nAt the beginning of each testing day, bring the animals to the testing room and allow them to acclimate for at least 20 min before beginning the testing. The room should be light and temperature-controlled, and the same personnel should complete all testing. Ideally, the same room will be used for all animals throughout the course of the testing with no changes to the room.\nUse food rewards to encourage the animals to complete the tasks, especially during the ladder training. Cereals or small pieces of banana chips or crackers make good rewards.\nNormalize all weekly testing performances to the pre-surgery scores for each individual animal (Equation 1).\nEquation 1: imgsrc://cloudfront.jove.com/files/ftp_upload/57829/57829eq1.jpg\nOpen field grid testing",
    "NOTE: The open field grid test was built in-house and has a running surface of 1 m2 with approximately 40-cm high opaque side walls. The bottom running surface of the grid is divided into 9 equal squares from the underside using tape (Figure 1A). The recording camera is permanently mounted above the center of the grid on scaffolding.\n\t\nTo begin open field grid testing, place the animal in the center of the grid facing away from the tester.\nAllow the animal to run freely for 3 min while recording a video.\nWhen the animal has completed testing, remove the animal from the grid and return it to the cage. Clean the grid thoroughly with chlorine dioxide-based sterilant.\nTest each animal 1x per testing day.\nAnalyze the number of gridlines crossed, the total distance traveled, and the maximum velocity of the animal as metrics of the gross motor function using a video tracking software.\n\t\tNOTE: The data presented here were quantified manually by trained researchers, but it is preferred to use a recently developed in-house tracking algorithm32.\nLadder testing\n\tNOTE: The ladder test was built in-house and consists of 2 clear acrylic side walls, each 1 m in length, connected by 3-mm diameter rungs spaced at 2 cm apart (Figure 2A). Ladder testing is a skilled test, and therefore requires 1 week of training prior to recording the pre-surgery baseline scores. The protocol for the training and testing is the same.\n\t\nMove the animal to a temporary clean holding cage to begin ladder testing.\nSet the ladder up so that it bridges 2 cages. The start end of the ladder rests on a clean cage, and the finish end rests on the animal's home cage to serve as a motivation to complete the run.",
    "Position the same (or similar) video camera on a tripod at the center of the ladder. The position of the camera should be at rung height and allow for the whole ladder to be seen.\nWith the video camera running, hold the animal to the starting line of the ladder, allowing their front paws to touch the first rung.\nAllow the animal to cross the ladder at their own pace. The time elapsed between the moment when the animal's paw touches the first rung and the finish line at the third to last rung will determine the animal's time to cross.\nIf the animal turns around on the ladder or does not move for a period of 20 s, consider the animal to have failed the run. Assign the animals a penalty score time for each failed run. Determine the penalty time by the slowest performance recorded during pre-surgery testing27.\nAllow each animal to cross the ladder 5x per testing day with approximately 1 min rest in between each run.\nAverage the fastest 3 runs per day as a metric of fine motor function. Additionally, record the number of times each of the front paws slips off the rungs using a video tracking software.\n\t\tNOTE: The data presented here were quantified manually by trained researchers, but it is preferred to use a recently developed in-house tracking algorithm using Dona et al.32.\nGrip strength testing\nCalibrate the grip strength meter before each testing session, and measure the strength in grams.\nPosition the grip strength meter on the edge of a counter with the grip handlebars extended over the floor.\nAllow the animal to grab the handlebars with both front paws while holding the animal by the base of the tail (Figure 3A).",
    "Once the animal has a firm grip with each paw, pull the animal away from the meter by the base of the tail with slow and steady force.\nRecord the maximum grip strength exerted by the animal which is displayed on the digital output by the grip strength meter.\nTest each animal 3x per testing day with approximately 2 min rest in between each test.\nAs a metric of fine motor function, record and average the maximum grip strength output from each of the 3 trials.\n3. Post-behavioral Protocol\nFollowing all behavioral testing (e.g, 8 - 16 weeks after the implantation), anesthetize the animals deeply using ketamine (160 mg/kg) and xylazine (20 mg/kg), transcardially perfuse them, harvest their brains and cryo-slice them, and stain the tissue using immunohistochemical markers to quantify the cellular response around the site of implantation33,34,35,36,37,38.\n4. Statistical Analysis\nNOTE: A prospective power analysis is strongly suggested for any studies seeking to answer a particular research question. The power analysis, which informs the number of animals required to achieve a statistical significance for a particular study design, should be based on the particular research hypothesis, the design of the experiment, the estimated effect size and variability of the intended treatments, as well the effect size required to achieve clinical or scientific relevance.\nConduct statistical analyses using common statistical software.\nTabulate the descriptive statistics and display them as Mean ± Standard Error.\nAnalyze the behavioral performance [in the open field grid (step 2.2), ladder (step 2.3), and grip strength testing (step 2.4)] at each weekly time point to compare the control vs. implanted groups using a two-sample t-test. Consider each weekly time point an independent measure.",
    "Quantify the longitudinal performance using a mixed effect linear model. The week and the group are fixed factors and an experimental animal is nested within the group as a random effect. An analysis of variance (ANOVA) is used to determine the factor effect with a significance level of p < 0.05.\nCompare the ladder performance with immunoglobin G (IgG) intensity using a linear regression analysis. Calculate the correlation coefficient by a Pearson's method.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}