{
  "id": 10393,
  "origin_website": "Jove",
  "title": "Lab-on-a-CD Platform for Generating Multicellular Three-dimensional Spheroids",
  "procedures": [
    "1. Centrifugal microfluidic-based spheroid (CMS) culture chip fabrication\nMake PC molds for the top and bottom layers of the CMS culture chip by CNC machining. Detailed dimensions of the chip are given in Figure 1.\nMix PDMS base and PDMS curing agent at a ratio of 10:1 (w/w) for 5 min and place in a desiccator for 1 h to remove air bubbles.\nAfter pouring the PDMS mixture into the molds of the CMS culture chip, remove air bubbles for 1 h more and cure in a heat chamber at 80 °C for 2 h.\nPlace them in the vacuumed plasma cleaner with the surfaces to be bonded facing up and expose them to air-assisted plasma at a power of 18 W for 30 s.\nBond the two layers of the CMS culture chip and place it in the heat chamber at 80 °C for 30 min to increase adhesion strength.\nSterilize the CMS culture chip in an autoclave sterilizer at 121 °C and 15 psi.\n2. Cell preparation\nThaw the 1 mL of the vial containing 5 × 105–1 × 106 hASCs or MRC-5s cells in a water bath at 36.5 °C for 2 min.\nAdd 1 mL of Dulbecco’s Modified Eagle Medium (DMEM) to a vial and gently mix with a 1,000 μL pipette.\nPut 15 mL of the DMEM prewarmed to 36.5 °C into a 150 mm diameter Petri dish using a pipette and add the cells from the vial.\nAfter 1 day, aspirate the DMEM and replace with 15 mL of fresh DMEM. Subsequently, change the media every 2 or 3 days.\nTo detach the cells from the Petri dish, add 4 mL of trypsin to the Petri dishes and place them in an incubator at 36.5 °C and 5% CO2 for 4 min.",
    "3. Monoculture spheroid formation\nPut 2.5 mL of 4% (w/v) pluronic F-127 solution into the inlet hole of the CMS culture chip (Figure 2A) while rotating the chip at 500–1,000 rpm and then rotate the chip at 4,000 rpm for 3 min using the CMS system (Figure 2B).\n\tNOTE:  The pluronic coating prevents cell attachment to the inlet port while the chip rotates. Make sure air is not trapped in the microwells.\nIncubate the CMS culture chip filled with pluronic solution overnight at 36.5 °C in 5% CO2.\nRemove the pluronic solution, wash out the remaining pluronic solution with DMEM, and dry the chip for 12 h on a clean bench.\nAdd 2.5 mL of DMEM to the CMS culture chip and rotate the chip at ~4,000 rpm for 3 min for prewetting the inside of the chip.\nStop the rotation and pull out 100 μL of DMEM to make room for injecting the cell suspension.\nAdd 100 μL of cell suspensions that contain either 5 × 105 hASCs or 8× 105 MRC-5s by pipetting Uniformly distribute the cells by pipetting 3–5x for resuspension.\nRotate the chip at 3,000 rpm for 3 min to trap cells in each microwell by centrifugal force.\n\tNOTE:  Excessive rotational speed can cause cell escape through solution ejection holes.\nCulture the cells for 3 days in the incubator at 36.5 °C, >95% humidity, and 5% CO2, rotating at 1,000–2,000 rpm. Change culture medium every day.\n4. Coculture spheroid formation\nConcentric spheroids formation",
    "Add the first cells, 2.5 × 105 hASCs, and rotate the chip at 3,000 rpm. After 3 min, add the second cells, 4 × 105 MRC-5s, and rotate the chip at 3,000 rpm for 3 min. Inject a total of 100 μL of cell suspensions by pipetting. When the cells are injected, shift the rotational speed to 500-1,000 rpm.\nCulture the cells in the incubator at 36.5 °C, >95% humidity%, and 5% CO2 by rotating at 1,000–2,000 rpm. The concentric spheroids are created within 24 h. For long-term culture, change the culture medium every day.\nJanus spheroid formation\nAdd 100 μL of cell suspensions containing the first cells, 2.5 × 105 hASCs, by pipetting while the chip rotates at 500–1,000 rpm. Then, rotate the chip at 3,000 rpm for 3 min.\nIncubate the chip at 36.5 °C, >95% humidity, and 5% CO2 by rotating at 1,000–2,000 rpm for 3 h.\nAdd 100 μL of the cell suspensions containing the second set of cells, 4 × 105 MRC-5s, by pipetting while the chip rotates at 500–1,000 rpm. Then, rotate the chip at 3,000 rpm for 3 min.\nCulture the cells in the incubator at 36.5 °C, >95% humidity, and 5% CO2 by rotating at 1,000–2,000 rpm. The Janus spheroids are created within 24 h. For long-term culture, change the culture medium every day.\nSandwich spheroid formation\nAdd 100 μL of cell suspensions containing the first cells, 1.5 × 105 hASCs, by pipetting while the chip rotates at 500–1,000 rpm. Then, rotate the chip at 3,000 rpm for 3 min.\nIncubate the chip at 36.5 °C, >95% humidity, and 5% CO2 by rotating at 1,000–2,000 rpm for 3 h.",
    "Add 100 μL of cell suspensions containing the second cells, 3 × 105 MRC-5s, by pipetting while the chip rotates at 500–1,000 rpm. Then, rotate the chip at 3,000 rpm for 3 min.\nIncubate the chip at 36.5 °C, >95% humidity%, and 5% CO2 by rotating at 1,000–2,000 rpm for 3 h.\nAdd 100 μL of cell suspensions containing the third cells, 1.5 × 105 hASCs, by pipetting while the chip rotates at 500–1,000 rpm. Then, rotate the chip at 3,000 rpm for 3 min.\nCulture the cells in the incubator at 36.5 °C, >95% humidity%, and 5% CO2 by rotating at 1,000–2,000 rpm. The sandwich spheroids are created within 12 h. For long-term culture, change the culture medium every day.\n5. Cell staining\nWarm the cell fluorescence dye to room temperature (20 °C).\nAdd 20 μL of anhydrous dimethylsulfoxide (DMSO) per vial to make a 1 mM solution.\nDilute the fluorescence to a final working concentration of 1 μM using DMEM.\nAdd the fluorescence to the cell suspension and gently resuspend using a pipette.\nIncubate 20 min at 36.5 °C, humidity of >95%, and 5% CO2.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}