{
  "id": 6368,
  "origin_website": "Bio",
  "title": "Adoptive Transfer of Monocytes Sorted from Bone Marrow",
  "procedures": [
    "Preparation of a bone-marrow single cell suspensionSacrifice a naive mouse and restrain it by pinning its paws into a foam surface using syringe needles. Disinfect the skin of the mouse with 70% ethanol (see Recipe 1). Make a parallel incision from the base of the tail up to the neck along the mouse’s abdomen and to the paws without puncturing the peritoneum. Gently pull back the skin and pin it to the foam surface to expose the hind limb (Figure 1A).Cut the hind limb free from the skin and the body by cutting in the pelvis just behind the femur-pelvis joint. Keep the femur and tibia whole. Try to remove as much excess tissue (muscles, fibers...) surrounding the bone as possible using scissors or with a scalpel (Figure 1B). Do this procedure gently in order to avoid breakage of the bones. Gently pull the hind paw from the limb by moving it back and forwards (Figure 1C). Clean the bone by submerging it in 70% ethanol and store the bone in 5 ml complete medium (see Recipe 2) in a 50 ml Falcon tube on ice.Repeat this action with the second hind limb.Detach the tibia from the femur and cut the fibula and patella away and put the bones in a Falcon standard tissue culture dish (Figures 1D, 1E and 1F).Insert a 27 G needle attached to a 10 ml syringe containing complete medium in the femur and gently flush the femur with 10 ml complete medium (Figures 1G and 1H). Before flushing, the tibia cut the ‘white’ bone that was adjacent to the paw away and insert the needle in the bone at the other side.",
    "If any resistance is perceived when flushing the bones, cut a small fraction of the bone from the end and reinsert the needle in the remaining bone. The flushing is complete when all the red bone marrow is in the plate, and red tissue can no longer be seen in the bone.Homogenize the bone-marrow by passing (aspirating and pressing) the medium containing bone-marrow two times through the 19 G needle (Figures 1I and 1J).Filter the bone-marrow suspensions through a 70 µm sterile nylon gauze into a sterile 50 ml conical tube and wash the culture plate and the gauze with 10 ml complete medium.Centrifuge the 50 ml tubes at 450 x g for 6 min at 4 °C and discard the supernatants (Figure 1K).Remove the red blood cells by resuspending the pellet in 5 ml erythrocyte lysis buffer (see Recipe 3) and leave at room temperature for 2 min. Neutralize by adding 15 ml complete medium, and transfer the suspension to a new 50 ml tube through a 70 µm sterile nylon gauze. Centrifuge the 50 ml tubes at 450 x g for 6 min at 4 °C and discard the supernatants (Figure 1L).Count the living cells using trypan blue and resuspend the cells in MACS buffer (see Recipe 4) at a concentration of 108 cells/ml. From the total bone marrow, in general, 10% to 15 % normally would constitute monocytes (varies slightly with age, mouse strain, and animal house type), which can be enriched/purified as explained below.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20181228/20181228011739_8785.jpgFigure 1. Bone-marrow single-cell preparation. A. Naive mouse. B. Hind limb with paw. C. Hind limb without paw. D. Cleaned hind limb without paw. E. Detaching of the tibia from the femur. F. Femur (left) and tibia (right). G. Flushing the bones. H. Bone marrow right after flushing. I.",
    "Homogenization of the bone marrow. J. Homogenized bone-marrow single cell suspension. K. Cell pellet before erythrocyte lysis buffer. L. Cell pellet after erythrocyte lysis buffer.Purification of Ly6Chigh monocytes from the bone marrowAdd a 5 µl aliquot of anti-CD11b magnetic microbeads per 107 cells and incubate for 20 min at 4 °C on an orbital shaker at 50 rpm.Wash by adding 10 ml MACS buffer, centrifuge at 450 x g for 6 min at 4 °C and discard the supernatants.Place an LS column in a MidiMACSTM Separator attached to a magnetic MultiStand and wash it by putting 3 ml MACS buffer on the top. The liquid passes the column by gravity.Resuspend the pelleted cells in 1 ml MACS buffer and pipette the labeled cell suspension on top of the LS separation column. When the cell suspension has passed through the column, wash the column by adding 3 x 3 ml MACS buffer.Remove the LS column from the separator, add 5 ml MACS buffer on top of the column and immediately flush the column by firmly pressing the provided plunger on the column to wash the magnetically labeled cells out in a sterile 15 ml tube.Incubate the CD11b+ cell suspension with rat anti-mouse CD16/CD32 (10 µg per 107 cells) on ice-cold water for 20 min, in order to block the Fc receptors present on the cells’ surface.Incubate the cell suspension with fluorescently labeled antibodies of interest (1 µg per 107 cells) for another 20 min on ice-cold water, protected from exposure to light. Wash by adding 10 ml MACS buffer, centrifuge at 450 x g for 6 min at 4 °C and discard the supernatants.Meanwhile, precoat 5 ml polypropylene round-bottom tubes and 15 ml tubes with heat-inactivated fetal calf serum, add respectively 1 ml or 2 ml heat-inactivated fetal calf serum.",
    "Shake the tubes gently by hand so that the heat-inactivated fetal calf serum covers the whole surface of the tube, and discard the excess of heat-inactivated fetal calf serum. This will prevent the cells to stick to the tubes and hence enhance the recovery of cells.Resuspend the pellet in 1 ml sorting buffer (see Recipe 5) per 107 cells and transfer into a sterile 5 ml polypropylene round-bottom tube precoated with heat-inactivated fetal calf serum.Ly6Chigh monocytes can be sorted on a BD FACS Aria as CD45pos CD11bpos Ly6Gneg Ly6Chigh MHC-IIneg cells (Laoui et al., 2016; Van Overmeire et al., 2016).Collect the sorted monocytes in 15 ml tubes precoated with heat-inactivated fetal calf serum containing 3 ml complete medium.Labeling of the monocytes for in vivo trackingOption I: Bone-marrow donor mice are wild-type mice (Laoui et al., 2016). Ideally, the donor and recipient differ in their CD45 allele (CD45.1 vs. CD45.2).Centrifuge the 15 ml tubes containing the sorted monocytes at 450 x g for 10 min at 4 °C and discard the supernatant.Resuspend the cell pellet in HBSS at a concentration of 106/ml and add 1 μl of CellTrace (see Recipe 6) to stain 1 ml cells (hence a 1:1,000 dilution). It is important that the labeling happens in a protein-free medium. Incubate the cell suspension for 20 min at 37 °C, protected from exposure to light.Wash by adding 10 ml HBSS, centrifuge at 450 x g for 6 min at 4 °C and discard the supernatant.Resuspend the cell pellet in HBSS at a concentration of 5 x 106/ml and keep on ice till entering the animal facility.Inject the recipient CD45.2 mice with 200 μl intravenously in the tail vein using a 25 G needle and a 1 ml syringe (Video 1).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Intravenously tail vein injection.",
    "(This video was made at Vrije Universiteit Brussels according to guidelines from the Belgian Council for Laboratory Animal Sciences and were approved by the Ethical Committee for Animal Experiments of the Vrije universiteit Brussels (license 15-220-2).The progeny of the monocytes can be traced as from one day, until 10 days after inoculation (ideally 48 to 72 h). The monocyte-derived cells can be traced in the Pacific Blue-channel (405 nm) by flow cytometry. In addition, CD45.1 and CD45.2 can be used as a complementary staining.Option II: Bone-marrow donor mice are Ubiquitin-GFP mice (Van Overmeire et al., 2016).Centrifuge the 15 ml tubes containing the sorted monocytes at 450 x g for 10 min at 4 °C and discard the supernatant.Resuspend the cell pellet in HBSS at a concentration of 5 x 106/ml and keep on ice till entering the animal facility.Inject the recipient CD45.2 mice with 200 μl of cells intravenously in the tail vein using a 25 G needle and a 1 ml syringe (Video 1).The progeny of the monocytes can be traced as from one day, until 10 days after inoculation (ideally 48 to 72 h). The monocyte-derived cells can be traced in the FITC-channel by flow cytometry."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}