{
  "id": 6261,
  "origin_website": "Bio",
  "title": "Zebrafish Embryo Xenograft and Metastasis Assay",
  "procedures": [
    "Preparing the embryosSet-up mating two days before the injection day (Day 1). Three males and three females in a 3 L mating box are usually enough.Collect embryos in the morning around 10:00 AM (Day 0) (The zebrafish mate when the lights turn on).Select healthy fertilized embryos and place on separate 10 cm dishes–50 embryos/dish in 25 ml of 1x E3 + 0.2 mM PTU (see Recipes). Place in a 33 °C incubator (no CO2!!) (Day 0).On the injection day (Day 2), dissect the embryos out from the chorion membrane with fine sharp forceps (e.g., Dumont No. 5), if necessary. Many of the 2 dpf embryos may have hatched spontaneously (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180911/20180911204555_3791.jpgFigure 1. An unhatched embryo encased by chorion membrane (above) and a hatched embryo (below). Scale bar: 1 mm.Anesthetize the embryos with 200 mg/L Tricaine (MS-222, 4 g/L stock solution) (see Recipes) for 5 min.Melt aliquots of 0.7% low-melting point agarose (see Recipes) at 95 °C heating block. Let the block cool down to 37 °C before the next step. Note: Low-melting point agarose stays liquid at 37 °C. Add 53 μl of 4 g/L Tricaine-stock solution into 1 ml of 0.7% low-melting point agarose (final concentration of agarose is 0.66%). Vortex briefly, and spin down. Place the tube back to 37 °C.Prepare mounting slide. Take a normal glass microscopy slide and wipe it clean. Draw a bigger ellipse with a PAP-pen (for embryos) and a small circle (for 10 μl of cells) (Figure 2). Allow PAP-smear to dry for a couple of minutes. These hydrophobic linings will help to keep liquids in the correct place on the glass slide.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180911/20180911204618_9496.jpgFigure 2. Glass microscope slide with PAP-pen smears (faint greenish color)Add 15 dechorionated and anesthetized embryos in the middle of the larger circle (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180911/20180911204633_0801.jpgFigure 3.",
    "Embryos in a droplet of E3 on the microscope slideAdd 200 μl of low-melting-point agarose and align the embryos gently using a gentle orientation tool (e.g., a pipette tip with a bit of attached nylon line) (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180911/20180911204647_1605.jpgFigure 4. Aligned embryos inside the agarose on a microscope slide. Orientation tool made of two pipette tips and a nylon line is in the front.Allow the agarose to solidify. (The embryos stay alive within the agarose.) Store mounted embryos in a large (150 mm) humidified Petri dish (Figure 5), until ready to inject.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180911/20180911204704_5045.jpgFigure 5. A humidified Petri dish. Wetted paper towel is placed on the bottom of the Petri dish and covered with a lid. To prevent drying, the microscope slides with mounted embryos are placed in this chamber.Preparing the cellsUse a 10 cm plate of GFP expressing tumor cells (50-90% confluent)/treatment.Wash cells 2 times with PBS.Aspirate PBS, add 3 ml of Trypsin-EDTA solution.Incubate for 5 min at 37 °C, or until cells have detached.Collect detached cells into a 15 ml Falcon tube and add 5 ml of DMEM + 10% FCS.Pellet cells (180 x g), 3 min and resuspend in 10 ml of PBS.Pellet cells (180 x g), 3 min and resuspend in 10 ml of PBS.Pellet cells (180 x g), 3 min and resuspend in 1 ml of PBS.Optional step, if using a cell line prone to clumping:Pipet the cell suspension into a FACS tube through a 40 μm mesh cap (BD Falcon).Pellet cells with a centrifuge for 3 min (180 x g).Aspirate all liquid and resuspend the cells in 20 μl of 2% PVP/PBS injection solution. (Addition of PVP is optional, but helps to maintain stable cell suspension during injections.)Count cell density (2 μl of cell suspension, 198 μl of PBS) using CEDEX XS cell counter.",
    "Dilute into a final concentration of 3-10 x 107 cells/ml. In 4 nl injection, this is 120-400 cells.Store cell suspensions on ice until ready to inject.Injection of tumor cells into embryosPlace an empty glass capillary needle (self-made capillary without filament, e.g., TW100-4, WPI) in CellTram injector. (Figure 6)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180911/20180911204725_8245.jpgFigure 6. Microinjection stationBreak a large enough opening so that cells can be easily expelled (> 25 μm, a larger tip helps to get more cells in embryo but generates more damage to the embryo and is harder to get through the skin of the embryo) (Video 1).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Breaking the capillary needle Gently rotate the oil outwards, until all air bubbles are out and oil comes out from the tip of the needle (Video 2). <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Expelling the air bubbles Gently touch the side of the tip with a paper tissue to absorb the excess oil. Note: The glass capillary is extremely fragile! Add 10 μl of cell suspension in the smaller circle on the slide. Go to the injection work station.Move the needle into cell suspension and draw some cell suspension into the needle (Video 3). Monitor under a stereomicroscope that some liquid and cells actually go into the needle and it doesn’t get stuck.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 3. Filling the capillary needle.  (Experimentation with zebrafish was performed under license ESAVI/9339/04.10.07/2016 issued by national Animal Experimentation Board (Regional State Administrative Agency for Southern Finland)).Next, inject the embryos (Video 4). Move the needle through the skin of the embryo. Try to hit an empty space around the heart (pericardial cavity). Expel a little bit of cell suspension into the cavity (one fine notch with CellTram). Look that some cells actually went into the embryo and then move the needle out (Figure 7).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 4.",
    "Injection of tumor cells into pericardiac space of the embryos.  (Experimentation with zebrafish was performed under license ESAVI/9339/04.10.07/2016 issued by national Animal Experimentation Board (Regional State Administrative Agency for Southern Finland)).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180911/20180911204743_7575.jpgFigure 7. Embryos right after injection with GFP labeled tumor cells. Often some tumor cells escape from the injection site when the needle is withdrawn. Scale bar: 1 mm.Move to the next embryo. Continue until all embryos are injected. In one session easily > 50 embryos can be injected.After injections, discard the needle carefully according to your institutional guidelines.Break the gel using fine forceps (Video 5) and by flushing the gel pieces into a dish with 1x E3-medium (Video 6) (see Recipes). Pipette up and down with a large bore Pasteur pipette to release the embryos from the gel (Video 7). Move the released embryos to a new Petri dish with fresh 1x E3 + 0.2 mM PTU (see Recipes).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 5. Breaking the gel with forceps.  (Experimentation with zebrafish was performed under license ESAVI/9339/04.10.07/2016 issued by national Animal Experimentation Board (Regional State Administrative Agency for Southern Finland)).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 6. Releasing the gel pieces from the microscope slide.  (Experimentation with zebrafish was performed under license ESAVI/9339/04.10.07/2016 issued by national Animal Experimentation Board (Regional State Administrative Agency for Southern Finland)).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 7. Releasing the embryos from the gel.  （Experimentation with zebrafish was performed under license ESAVI/9339/04.10.07/2016 issued by national Animal Experimentation Board (Regional State Administrative Agency for Southern Finland)）.Add antibiotics (1:100 Pen-strep) and incubate 50 embryos/dish at 33 °C until transplanted embryos are selected for the experiment.Notes: Culturing the embryos at a higher temperature (33 °C) than usually (28.5 °C) facilitates the growth of human tumor cells in this model.",
    "Without a separate animal experiment license, the experiment has to be ended at latest when the embryos are 5 days old !!! Consult your Animal Experiment Board for details.ImagingAt 1-day post-injection (1 dpi) anesthetize embryos with 200 mg/L Tricaine and select successfully transplanted and healthy embryos (Figure 8) under a stereomicroscope into the experiment.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180911/20180911204759_8370.jpgFigure 8. A healthy transplanted embryo. Scale bar: 1 mm.Place 1 embryo/well in a 12-well plate with 2 ml of E3 + Tricaine, orient gently with an orientation tool and image both on GFP and bright field channels. After all the embryos have been imaged, aspirate excess medium out carefully and place 2 ml of fresh 1x E3 + 0.2 mM PTU medium in the wells. (Do not let the embryos dry!)At 4 days post-injection anesthetize the embryos with tricaine again. Image embryos again using both GFP and bright field channels. (Figure 9)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180911/20180911204814_6242.jpgFigure 9. Timeline of the experiment and examples of the results. A. Time line of zebrafish xenograft experiments. B. Intravital fluorescence microscopy images of six dpf zebrafish embryos taken four days post injection (4 dpi). Fluorescence in GFP channel is shown. Scale bar, 500 µm. Inset shows magnification of the primary tumor. Tumor cells invading outside pericardial space are marked with an arrow, invading cells in the pericardial cavity with a triangle and unspecific fluorescence in eye and yolk sac with an asterisk (*). The outline of the pericardial cavity is depicted with dashed line. Figure and text reproduced and modified from Pekkonen et al. (2018)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}