{
  "id": 6228,
  "origin_website": "Bio",
  "title": "Analysis of the Effect of Sphingomyelinase on Rubella Virus Infectivity in Two Cell Lines",
  "procedures": [
    "Analysis of the effect of SMase treatment on viral infectivity in RK13 cells (Figure 1A).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180828/20180828003252_2311.jpgFigure 1. Experimental flow. A. Analysis of the effect of SMase on viral infectivity in RK13 cells. B. Analysis of the effect of SMase on viral infectivity in Vero cells. C. Analysis of the effect of SMase treatment on VLP infection.Seed 3 ml of a RK13 cell suspension at a concentration of 250,000 cells/ml into each well of a 6-well plate.Incubate the cells in a cell culture incubator at 37 °C with 5% CO2.After cells form a monolayer (3-4 days post seeding), wash the cells with DPBS once, and then add 1 ml of MEM containing 30 or 150 mU/ml of SMase or 1 ml of MEM as a non-treated control.Note: The higher concentrations (>150 mU/ml) caused cell damage. The lower concentrations (<30 mU/ml) also showed a dose-dependent effect, but it was difficult to set the perfect experimental condition for reproducing results. Incubate the cells for 1 h in a cell culture incubator at 37 °C with 5% CO2.Wash the cells with DPBS twice. (Remove the DPBS after washing)Add 0.1 ml of a RuV-containing solution at a concentration of 300-800 plaque-forming units/ml. Incubate the cells with the virus solution for 1 h at room temperature with gentle agitation every 15 min.Remove the virus solution, wash the cells with MEM twice to remove unbound viruses. (Remove the MEM after washing)Add 3 ml of MEM containing 2% BS and 0.5% agarose.Incubate the cells for 7 days in a cell culture incubator at 35 °C with 5% CO2.Add 1 ml of MEM containing 0.01% neutral red and 0.5% agarose.Incubate for 2 to 3 days in a cell culture incubator at 35 °C with 5% CO2.Count the number of plaques with the naked eye (Figure 2).",
    "Note: Usually, plaques are visible in 2 days, but they may become clearer after 3 days incubation.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180828/20180828003309_9939.jpgFigure 2. Effect of SMase treatment on RuV infection in RK13 cells. Plaque assays using RK13 cells, which were untreated or treated with 30 or 150 mU/ml of SMase for 1 h before infection. Plaques in cells at 9 days post-infection with the TO-336 vaccine strain (top) or RVi/Hiroshima.JPN/01.03 wild type strain (bottom) visualized by neutral red staining are shown (Otsuki et al., 2018).Analysis of the effect of SMase treatment on viral infectivity in Vero cells (Figure 1B).Seed 1 ml of a Vero cell suspension at a concentration of 300,000 cells/ml into each well of a 12-well plate.Incubate the cells in a cell culture incubator at 37 °C with 5% CO2.After cells form a monolayer (16-36 h post seeding), wash the cells with DPBS once, and then add 0.5 ml of DMEM containing 30 or 150 mU/ml of SMase or 0.5 ml of DMEM as a non-treated control. (Remove the DPBS after washing)Incubate the cells for 1 h in a cell culture incubator at 37 °C with 5% CO2.Wash the cells with DPBS twice. (Remove the DPBS after washing).Add 0.1 ml of a virus solution containing RuV rHS/p150-AG1, MeV-IC323/Ed-H-EGFP, or HMPV-rJPS02-76EGFP at a concentration of 300-1000 fluorescent focus-forming units/ml. Incubate the cells with the virus solution for 1 h at room temperature with gentle agitation every 20 min.Remove the virus solution, wash the cells with MEM twice to remove unbound viruses. (Remove the MEM after washing)Add 1 ml of MEM containing 2% FBS and 0.4% agarose.Incubate the cells for 6 days in a cell culture incubator at 35 °C with 5% CO2.Count the number of foci expressing AG1 or EGFP using a fluorescence microscope (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180828/20180828003326_4256.jpgFigure 3.",
    "Fluorescence images of Vero cells infected with recombinant viruses. Vero cells were infected with green fluorescent protein-expressing recombinant rubella virus (RuV-rHS/p150-AG1) (left), measles virus (MeV-IC323/Ed-H-EGFP) (center), or human metapneumovirus (HMPV-rJPS02-76EGFP) (right). Images were taken at 6 days post infection. Scale bars represent 50 μm.Analysis of the effect of SMase treatment on VLP infection (Figure 1C).Seed 0.5 ml of a Vero cell suspension at a concentration of 300,000 cells/ml into each well of a 24-well plate.Incubate the cells in a cell culture incubator at 37 °C with 5% CO2.After the cells form a monolayer (24 h post seeding), wash the cells with DMEM once. (Remove the DMEM after washing)Add 0.1 ml of a RuV-VLP-containing solution at a concentration of 50,000 fluorescent focus-forming units/ml.Incubate the cells with the RuV-VLP solution at 4 °C (on ice) for 2 h with gentle agitation every 30 min.Wash the cells with DMEM, which is precooled to 4 °C, twice. (Remove the DMEM after washing)Add 0.5 ml of DMEM.Incubate the cells in a cell culture incubator at 37 °C with 5% CO2.Immediately thereafter or after 20, 60 or 120 min, replace the culture media with 0.5 ml of DMEM supplemented with 150 mU/ml of SMase.Incubate the cells in a cell culture incubator at 35 °C with 5% CO2 for 3 days.Wash the cells with DPBS once and add 50 μl of lysis buffer. (Remove the DPBS after washing)Incubate at room temperature for 10 min.Transfer the cell lysate to a 1.5 ml tube.Prepare 50 μl of Renilla Luciferase Assay Reagent in a new 1.5 ml tube and add 10 μl of the cell lysate into the Renilla Luciferase Assay Reagent-containing tube.Mix quickly by flicking the tube with a finger.Place the tube in a luminometer to measure the luminescence."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}