{
  "id": 6528,
  "origin_website": "Bio",
  "title": "CRISPR/Cas9 + AAV-mediated Intra-embryonic Gene Knocking in Mice",
  "procedures": [
    "AAV vector plasmid constructionDesign your AAV vector plasmid and construct it by conventional molecular biological techniques (Green et al., 2012; Behringer et al., 2003). Empty backbone of AAV vector, pAAV-MCS2, is deposited to Addgene.Insert your knock-in cassette flanked by 5′ and 3′ homology arms into your gene of interest between AAV inverted terminal repeats (ITRs). We recommend 300-1,000 bp homology arms for each side, but 100 bp homology arms are still sufficient for the knock-in.Note: AAV genome size (sequence length between ITRs on both ends) should be smaller than 4.8 kb.AAV vector production, extraction and purificationDay 0: Seed 4.0-4.5 x 106 293T cells/10 cm dish with 10 ml DMEM supplemented with 10% FBS. Prepare 8 dishes.Incubate in a 37.0 °C, 10% CO2 incubator (or 5% incubator, alternatively).Day 1: Incubate sterile distilled water, 2.5 M CaCl2, 2x BBS in a 37.0 °C bath for 30-60 min. Vortex briefly.Add 80 μl AAV plasmid (1 mg/ml) and 200 μl pDGM6 (1 mg/ml) into 3,320 μl sterile distilled water in a 15 ml tube (10 μl AAV plasmid, 25 μl pDGM6, 415 μl sterile distilled water for one 10 cm dish transfection, respectively). Vortex briefly.Add 400 μl 2.5 M CaCl2 solution (50 μl for each 10 cm dish transfection) into the 15 ml tuble containting plasmids. Immediately vortex for 10 s.After vortexing, immediately add 4 ml 2x BBS (500 μl for one 10 cm dish transfection), and then shake the 15 ml tubes vigorously. Alternatively, add 2x BBS into the 15 ml tube under continuous vortexing.Incubate at RT for 20 min.Add 1 ml transfection solution (prepared on Procedure B Day 1: Steps 1 to 5) to each 10 cm dish.Incubate in a 37.0 °C, 3% CO2 incubator (or 5% incubator, alternatively).",
    "Day 2: Aspirate medium containing transfection solution, and add 5 ml DMEM supplemented with 10% FBS with a 5 ml pipette.Incubate in a 37.0 °C, 10% CO2 incubator (or 5% incubator, alternatively) until Day 4.Day 4: Add x1/80 volume of 0.5 M EDTA (pH 8.0) (62.5 μl into 5 ml medium per 10 cm dish).Incubate at RT for 10 min. The cells would be detached from the dish after incubation.Collect 293T cells and culture medium into a 50 ml tube with a 10 ml pipette.Centrifuge at 4 °C, 1,700-2,000 x g, 10 min.Aspirate supernatant.Centrifuge at 4 °C, 1,700-2,000 x g, 1 min to collect residual medium.Aspirate supernatant completely.Vortex the 50 ml tube and dissociate cell pellet.Add 4 ml AAV Extraction Solution A plus (0.5 ml for each 10 cm dish transfection).Vortex for 15 s.Incubate at RT for 5 min.Vortex again for 15 s.Incubate at RT for another 5 min.Vortex again for 15 s.Centrifuge the 50 ml tube at 4 °C, 9,000 x g, 10 min.Transfer the supernatant to a fresh 50 ml tube with a P1000 tip pipette.Add 400 μl AAV Extraction Solution B (10% volume of AAV Extraction Solution A plus), and mix it gently.Add 40 μl Cryonase Cold-active Nuclease (1% volume of AAV Extraction Solution A plus), and mix it gently.Incubate at 37.0 °C for 60 min.Add 400 μl Precipitator A (10% volume of AAV Extraction Solution A plus).Vortex for 10 s.Incubate at 37.0 °C for 30 min.Vortex for 10 s.Add 200 μl Precipitator B (5% volume of AAV Extraction Solution A plus).Vortex for 10 s.Centrifuge at 4 °C, 9,000 x g, 20 min.Transfer the supernatant to a fresh 50 ml tube with a P1000 tip pipette.Centrifuge again at 4 °C, 9,000 x g, 20 min.",
    "Transfer the supernatant to a 6-10 cm dish with a P1000 tip pipette (It might be difficult to aspirate the supernatant from the 50 ml tube directly with a 10 ml syringe).Aspirate the supernatant with a 10 ml syringe, and filtrate it with 0.45 μm PVDF filter into a 15 ml tube.Transfer the filtered supernatant into Amicon Ultra-4, 100 kDa.Centrifuge at 15 °C, 2,000 x g, 5 min.Discard flow-through, add 4 ml 1x PBS onto the filter-unit, and centrifuge at 15 °C, 2,000 x g, 5 min.Repeat the previous ultrafiltration step, 7 times.Collect AAV vector solution with a P200 pipette into a 1.5 ml tube. Approximately 100-120 μl of viral vector suspension would be recovered.Dilute AAV vector solution with 1x PBS up to 200 μl, and dispense 20 μl aliquots in 1.5 ml tubes.Store AAV vector solution at -80 °C.Estimation of AAV vector titerEstimate the AAV vector titer by qPCR (Lock et al., 2014; Werling et al., 2015).Preparation of pronuclear-stage mice embryosPrepare pronuclear-stage mice embryos as described previously (Behringer et al., 2003). Transfer embryos with a fine glass pipette.Administer 5 IU/mouse PMSG into B6D2F1 female mice by intraperitoneal injection at 15:00-18:00 PM.Forty-eight hours after PMSG administration, administer 5 IU/mouse hCG into B6D2F1 female mice by intraperitoneal injection.Immediately after hCG administration, mate female mice with C57BL/6N male mice.14-16 h after hCG injection, retrieve zygotes from oviduct, and remove surrounding cumulus cells by short-term culture and pipetting in 0.1% hyaluronidase-containing M2 media.Incubate zygotes in KSOM-AA medium at 37.0 °C in 5% CO2 in air atmosphere for 1-4 h.Collect two-pronuclear zygotes.Preparation of Cas9 RNP solutionReconstitute lyophilized crRNA and tracerRNA with Opti-MEM I medium at 100 μM each.Mix 10 μl of crRNA and an equal amount of tracrRNA in PCR tube.Anneal crRNA with tracrRNA in a PCR thermal cycler.",
    "Heat it 95 °C for 5 min, and cool it down to 25 °C by 5 °C/min, then keep it at 4 °C.Dilute 100 ng/μl (0.61 μM) Cas9 protein, 200 ng/μl (2.94 μM) annealed gRNA complex (crRNA + tracrRNA) in Opti-MEM I medium. Prepare enough amount of the Cas9 RNP solution; 20-30 μl to wash embryos before electroporation, and 5 μl/run on electroporation.Keep Cas9 RNP solution on ice until the electroporation.Preparation of embryo culture medium containing knock-in donor AAV vectorDilute knock-in donor AAV with KSOM-AA medium at 1 x 107-1 x 108 vg/ml. We recommend 3 x 107 vg/ml for the initial trial, but optimal AAV dose should be determined empirically in each laboratory.Prepare 100 μl drop of KSOM-AA medium containing AAV vector for embryo transduction, and three 100 μl drops of KSOM-AA medium without AAV for washing embryo after electroporation for every 40-60 embryos in a 35-mm non-treated culture dish. Cover it with mineral oil.Incubate the dish at 37.0 °C in 5% CO2 air atmosphere for more than 30 min.Cas9 RNP electroporation and donor AAV transductionConnect 1 mm gap electrode on stereoscopic microscope with the electroporator. DO NOT turn on the thermal plate of microscope during electroporation steps. Otherwise, electrode solution would evaporate immediately (Figure1A).Wash 1 mm gap electrode with 5 μl Opti-MEM I media, 3 times.Prepare 20-30 μl drop of Cas9 RNP solution on 35-mm non-treated culture dish for washing embryos.Wash 20-30 two-pronuclear zygotes with Cas9 RNP solution prepared on Step G3.Add 5 μl Cas9 RNP solution on 1 mm gap electrode.Immediately transfer 20-30 two-pronuclear zygotes on 1 mm gap electrode (Figure 1B).Perform electroporation within 1 min. Condition is as following: 25 V, 3 ms ON, 97 ms OFF, Pd Alt 3-4 times.Collect embryos on the electrode, and wash them with KSOM-AA medium three times.",
    "Transfer embryos into KSOM-AA medium containing AAV vector.Incubate embryos at 37.0 °C in 5% CO2 air atmosphere for 16-20 h.Repeat Steps G2-G10 for next run of electroporation. Cas9 RNP solution should be replaced with new 5 μl Cas9 RNP solution for the next 20-30 embryos.Prepare pseudopregnant female by mating proestrus stage ICR female mice with ICR male mice received vasectomy.Sixteen to twenty hours after electroporation, collect embryos at 2-cell stage.Wash embryos with M2 medium three times, and transfer to oviduct of E0.5 pseudopregnant females under anesthesia.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190701/20190701201418_1405.jpgFigure 1. Cas9 RNP electroporation of mice zygotes. A. Required equipment for zygote electroporation. The 1 mm gap electrode on the microscope is connected to the electroporator. B. Two-pronuclear zygotes on 1 mm gap electrode. Scale bar, 100 μm."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}