{
  "id": 14958,
  "origin_website": "Jove",
  "title": "Mapping Mammalian 3D Genome Interactions with Micro-C-XL",
  "procedures": [
    "1. Cell culture and crosslinking\nCulture cells according to the experimental needs to obtain a minimum of 1 x 107 cells. Here, the cells were grown at 37 °C with 5% CO2 in E14 medium (DMEM with pyruvate and L-glutamine, 15% FBS, 1x LIF, 1x NEAA, 1% pen-strep, 0.1 mM β-mercaptoethanol [see Table of Materials]) and passaged every second day.\n\tNOTE: This protocol has been successfully applied to various cell types from multiple species, such as Homo sapiens and Mus musculus. In this example, mouse embryonic stem (ES) cells were used.\nHarvest the cells at 70%-80% confluency by aspirating the medium. Wash once with 5 mL of DPBS, and incubate the cells with 3 mL of prewarmed 0.25% trypsin per 10 cm dish for 2-3 min at 37 °C.\nQuench the trypsin with 7 mL of prewarmed E14 medium and transfer the detached cells to a 50 mL tube.\nPellet the cells by centrifugation at 300 x g for 5 min at room temperature (RT). Discard the supernatant and resuspend the cell pellet in the medium. Count the cells with a cell counter.\n\tNOTE The protocol is robust to some variation in cell concentrations, and various cell counters have been used to quantify the cell numbers; however, be aware of the dynamic range of the cell counter used. This is typically between 1 x 105-1 x 107 cells/mL. While the centrifugation speed and duration have been tested for this cell type, different, smaller cells may require a higher centrifugation speed or longer spin times, and the centrifugation should be adjusted accordingly.",
    "Collect the cells by centrifugation at 300 x g for 5 min at RT and resuspend the cells in DPBS at a final concentration of 1 x 106 cells/mL. For example, if the yield is 1 x 107 cells, resuspend the cells in 10 mL of DPBS.\nFor the first crosslinking step, add 37% formaldehyde (FA) to a final concentration of 1% to the cell suspension, and incubate the cell suspension for 10 min at RT with rotation (15-20 rpm); as an example, if the yield is 1 x 107 cells, add 270 µL of FA to the 10 mL cell suspension.\n\tNOTE: The FA solution is typically stable at RT for up to 3 months after opening.\nQuench the reaction by adding 2.5 M glycine to a final concentration of 0.25 M and incubate for 5 min at RT with rotation (15-20 rpm). For example, if the yield is 1 x 107 cells, add 1.027 mL of 2.5 M glycine to the cell suspension.\nCollect the cells by centrifugation at 300 x g for 5 min at RT. Discard the supernatant and resuspend the cells in 5 mL of DPBS. Repeat the centrifugation step once and resuspend the pelleted cells in DPBS to 4 x 106 cells/mL. For example, if the yield is 1 x 107 cells, resuspend the cells in 2.5 mL of DPBS.",
    "For the second crosslinking step, prepare a 0.3 M stock solution of ethylene glycol bis-succinimidyl succinate (EGS) in DMSO (13.6 mg of EGS in 100 µL of DMSO). Add EGS at a final concentration of 3 mM to the cell suspension, and incubate at RT for 40 min with rotation (15-20 rpm). For example, if the yield is 1 x 107 cells, add 25 µL of 0.3 M EGS stock solution to 2.5 mL of the cell suspension.\n\tNOTE: Equilibrate the EGS to RT for at least 20 min before weighing for preparing the stock solution.\nQuench the reaction by adding 2.5 M glycine to a final concentration of 0.4 M, and incubate for 5 min at RT with rotation (15-20 rpm). For example, if the yield is 1 x 107 cells, add 400 µL of 2.5 M glycine to the cell suspension.\nCollect the cells by centrifugation at 1,000 x g for 5 min at RT, and resuspend the pelleted cells in DPBS to 5 x 106 cells/mL. Distribute 5 x 106 cells/tube for preparative libraries and 1 x 106 cells/tube for titration for MNase digestion.\n\tNOTE: It is suggested to titrate the optimal digestion degree for each cross-linked cell batch. Ideally, collect two to three aliquots of 1 x 106 cells for MNase titration experiments (step 2) and two to four aliquots of 5 x 106 cells for preparative experiments (step 3).\nCollect the cells by centrifugation at 1,000 x g for 5 min at RT and remove the supernatant. Snap-freeze the cell pellets in liquid nitrogen, and store them at −80 °C.\n\t​NOTE: Successful Micro-C libraries can be prepared from samples stored for up to 3 months.\n2. MNase titration",
    "NOTE: Performing an MNase titration is necessary to determine the optimal concentration of MNase before processing the double-crosslinked cells' preparative library.\nTo perform the MNase titration, thaw one pellet of 1 x 106 cells on ice for 10 min and resuspend the cells in 500 µL of DPBS (add 1x BSA if the cells stick to the wall). Incubate the cell suspension on ice for 20 min.\nCollect the cells by centrifugation at 10,000 x g for 5 min at RT, and remove the supernatant. Resuspend the pelleted cells in 500 µL of MB#1 buffer (50 mM NaCl, 10 mM Tris-HCl, 5 mM MgCl2, 1 mM CaCl2, 0.2% NP-40, 1x protease inhibitor [see Table of Materials], pH 7.4).\nCollect the cells by centrifugation at 10,000 x g for 5 min, and remove the supernatant. Resuspend the cells in 200 µL of MB#1 buffer, and split the sample into four tubes.\nThaw one vial of MNase (20 U/µL), and dilute with 10 mM Tris, pH 7.4, in a series of 1:2, 1:4, 1:4, and 1:4 to achieve concentrations of 10 U/µL, 2.5 U/µL, 0.625 U/µL, and 0.1256 U/µL respectively (one for each digestion condition). With appropriate time intervals (10-20 s), add 1 µL of MNase solution to one of the four samples, vortex, and incubate on a thermomixer at 37 °C for 10 min (800 rpm shaking). Continue with adding 1 µL from the remaining MNase dilutions to the remaining cell aliquots.",
    "Stop the Mnase digestion by adding 200 µL of freshly prepared STOP buffer (150 µL of 10 mM Tris, pH 7.4, 25 µL of 10 % SDS, 25 µL of 20 mg/mL proteinase K, 2 µL of 0.5 M EGTA) to each tube in the same order and with the same time interval that the MNase was added. Incubate at 65 °C for 2 h.\nAdd 500 µL of phenol-chloroform-isoamyl alcohol (PCI) to each sample, and mix thoroughly by vortexing. Centrifuge at 19,800 x g for 5 min at RT to separate the phases, and transfer the aqueous phase to new tubes (approximately 200 µL/sample).\n\tCAUTION: PCI contains numerous toxic components and should only be handled in a chemical safety hood. Please consult the manufacturer for more details.\nPurify the DNA using a commercial DNA purification kit (see Table of Materials) according to the manufacturer's instructions and elute the samples in 12 µL of elution buffer.\n\tNOTE: The SDS concentration from the deproteinization step (step 2.5) is inhibitory for some DNA purification kits. The DNA purification kit used here performs comparably to ethanol precipitation.\nAdd 2-5 µL of loading dye, and run the samples on a 1.5% agarose gel at 120 V for 30-50 min (until properly separated; Figure 1A).\nChoose the best degree of digestion for the experiment, and continue with the preparative MNase digestion. An optimal digestion degree displays little to no subnucleosomal fragments and a 70%-90 % mono- to di-nucleosome ratio.\n\t​NOTE: In this experiment, the digestion degree of Lane 4 in Figure 1A was determined to be the optimal digestion obtained with 0.625-1.25 U of Mnase for 2.5 x 105 cells (= 2.5-5 U of Mnase for 1 x 106 cells). For a detailed discussion, see the representative results.\n3. Preparative MNase digestion",
    "To fragment chromatin to the mono-nucleosomes via MNase digestion, thaw previously double cross-linked 5 x 106 cell aliquots, and resuspend in 1 mL of DPBS. Incubate on ice for 20 min (add 1x BSA if the cells stick to the tube wall).\nCollect the cells by centrifugation at 10,000 x g for 5 min at RT, and discard the supernatant. Resuspend the pellet in 500 µL of MB#1 buffer. Repeat the centrifugation step once. Resuspend the pellet in 1 mL of MB#1 buffer, and make 200 µL aliquots (1 x 106 cells per aliquot).\nBased on the MNase titration (described in step 2), digest the chromatin by adding the appropriate amount of MNase (usually 2.5-10 U/µL per 1 x 106 cells) to each aliquot. Mix well (vortex and spin quickly), and incubate on a thermomixer at 37 °C for 10 min with 800 rpm shaking.\nStop the MNase digestion by adding 1.6 µL of 0.5 M EGTA (final 4 mM) to each aliquot, and incubate on a thermomixer at 65 °C for 10 min with 800 rpm shaking.\nCollect the sample by centrifugation at 10,000 x g for 5 min at RT, and discard the supernatant. Resuspend the cell pellet in 500 µL of 1x NEBuffer 2.1.\nPool samples equivalent to an input of 5 x 106 cells or less for further processing.\n\tNOTE: If more than 5 x 106 cells are to be processed, process these samples in parallel, as the enzymatic conditions are optimized for 5 x 106 cells.",
    "Before proceeding to the proximity ligation steps, transfer 10% of the sample as an input control to control for the MNase digestion level. Add 150 µL of 10 mM Tris, pH 7.4, 25 µL of 10% SDS, and 25 µL of 20 mg/mL proteinase K to this sample, and incubate overnight at 65 °C.\n4. DNA end processing and proximity ligation\nCollect the remaining sample by centrifugation at 10,000 x g for 5 min at 4 °C, and discard the supernatant. Resuspend the pellet in 90 µL of freshly prepared Micro-C master mix 1 (Table 1), and incubate on a thermomixer for 15 min at 37 °C with 800 rpm shaking.\nAdd 10 µL of 5 U/µL Klenow Fragment, and incubate on a thermomixer for 15 min at 37 °C with 800 rpm shaking.\nAdd 100 µL of freshly prepared Micro-C master mix 2 (Table 2), and incubate on a thermomixer for 45 min at 25 °C with 800 rpm shaking. After incubation, quench the enzymatic reaction by adding EDTA to a final concentration of 30 mM. Incubate on a thermomixer for 20 min at 65 °C with 800 rpm shaking.\nCollect the sample by centrifugation at 10,000 x g for 5 min at 4 °C, and discard the supernatant. Resuspend the sample in 500 µL of freshly prepared Micro-C master mix 3 (Table 3), and incubate for 2.5 h at RT with rotation (15-20 rpm).\nCollect the sample by centrifugation at 10,000 x g for 5 min at 4 °C, and discard the supernatant. Resuspend the sample in 200 µL of freshly prepared Micro-C master mix 4 (Table 4), and incubate on a thermomixer for 15 min at 37 °C with 800 rpm shaking.",
    "For reverse crosslinking and deproteination, add 25 µL of 20 mg/mL proteinase K and 25 µL of 10% SDS to the sample, and incubate at 65 °C overnight with intermittent mixing.\n5. Di-nucleosomal DNA purification and size selection\nAdd 500 µL of PCI to the samples and input control, and mix by vortexing. Separate the phases by centrifugation at 19,800 x g for 5 min, and transfer the upper aqueous phase to a fresh tube.\nConcentrate the DNA either using a DNA purification kit or by ethanol precipitation. Elute the samples in 30 µL (step 5.3) and the input controls (step 3.11) in 15 µL, and run a 1.5 % agarose gel to separate the mono-nucleosomes and di-nucleosomes (Figure 1B).\n\tNOTE: The SDS concentration from the deproteinization step is inhibitory for some DNA purification kits. The DNA purification kit used here (see Table of Materials) performs comparably to ethanol precipitation. Depending on the number of cells used, the input can range from 100 ng to 10 µg. Typically, 1-5 µg of DNA is extracted from 5 x 106 cells.\nExcise the DNA fragments that have a di-nucleosomal size (approximately 300 bp). Use a commercially available DNA gel elution kit (see Table of Materials) to extract the DNA from the agarose gel, and elute in 150 µL.\n6. Preparation of the streptavidin beads\nTransfer 10 µL of streptavidin beads (see Table of Materials) per sample into a reaction tube.\nPlace it into an appropriate magnet for 1.5 mL tubes (see Table of Materials). After the solution clears (1-2 min), remove the supernatant, and resuspend the beads in 300 µL of 1x TBW (5 mM Tris-HCl, pH 7.5, 0.5 mM EDTA, 1 M NaCl, 0.05% Tween 20) per sample. Repeat this step once.",
    "Resuspend the beads in 150 µL of 2x B&W buffer (10 mM Tris-HCl, pH 7.5, 1 mM EDTA, 2 M NaCl) per sample processed in step 7.\n7. Streptavidin pull-down and on-bead library preparation\nAdd 150 µL of pre-prepared beads (step 6.3) to 150 µL of the sample (step 5.3). Incubate for 20 min at RT with rotation (15-20 rpm).\nPlace the tubes into an appropriate magnet, and wait until the solution clears (1-2 min). Remove the supernatant and resuspend the beads in 300 µL of 1x TBW. Repeat this step.\nPlace the tubes into an appropriate magnet and wait until the solution clears (1-2 min). Remove the supernatant and resuspend the beads in 100 µL of 0.1x TE (1 mM Tris, 0.1 mM EDTA, pH 8.0).\nPlace the tubes into an appropriate magnet and wait until the solution clears (1-2 min). Remove the supernatant, resuspend the beads in 50 µL of 0.1x TE, and transfer them to PCR tubes.\n\tNOTE: The volume of 0.1x TE used (50 µL) corresponds to the input volume of the DNA sequencing library preparation kit (see Table of Materials) used in this protocol. If a different kit or strategy is used, adjust the volume accordingly.\nPerform the DNA manipulation steps of the sequencing library preparation kit according to the manufacturer's protocol. These steps typically include DNA blunting, A-tailing, adaptor ligation, and U excision. The last step (U excision) is specific to the kit used in this study. If using that kit, follow the manufacturer's instructions from step 1 to step 2.6 in the kit protocol using non-diluted adaptors, and do not consider −20 °C storage after step 2.6.",
    "NOTE: The buffer changes required by the sequencing kits must be exchanged by the binding of the beads to a magnet and washes (steps 7.3 to 7.4), as DNA is still bound to the streptavidin beads. Additionally, because the DNA is bound to the magnetic beads, ignore any purification and size selection steps after adapter ligation from the kit protocol. Continue to step 7.6 (this protocol).\nAfter adapter ligation is completed, wash the sample as described in step 7.2. Discard the supernatant and resuspend the beads in 20 µL of 0.1x TE.\n8. Estimation of the required PCR cycles\nNOTE: Estimating the required PCR cycles for library amplification is advisable. Typically, a Micro-C library requires 8-15 cycles of PCR. Although the step is not essential, it helps avoid over-amplification and reduces the risk of PCR duplicates.\nTo define the minimum number of PCR cycles required, perform PCR with 1 µL of streptavidin-biotin-DNA sample (step 7.6). To do this, add PCR master mix (3.2 µL of H2O, 0.4 µL of i5 primer, 0.4 µL of i7 primer, and 5 µL of Q5 high-fidelity DNA polymerase) to the sample. Perform PCR with 16 cycles according to the manufacturer's instructions for the DNA library preparation kit used.\n\tNOTE: The primers used here are purchased in a separate kit (see Table of Materials) that needs to be compatible with the library preparation kit used.\nAfter the PCR, collect the beads with an appropriate magnet, and measure the DNA concentration of 1 µL of the supernatant using a high-sensitivity DNA quantification instrument (see Table of Materials). To obtain the total DNA concentration, multiply this value by 10 (total volume of the PCR reaction). Estimate the required number of PCR cycles as discussed in the representative results.",
    "Add 2 µL of 6x loading buffer to the remaining 9 µL of PCR mixture. Resolve the PCR amplified library on a 1% agarose gel to determine successful adaptor ligation, resulting in approximately 450 bp size (Figure 1C).\n\t​NOTE: The gel should show a distinct band of approximately 420 bp (Micro-C library plus adaptors). Bands of 120 bp represent adapter dimers and are indicative of low-complexity libraries. Bands of lower molecular weights may appear (less than 100 bp), and these are unused primers from the PCR reaction.\n9. Sequencing library amplification\nAdd PCR master mix (65 µL of H2O, 100 µL of Q5 high-fidelity DNA polymerase, 8 µL of i5 primer, 8 µL of i7 primer) to the remaining 19 µL of the streptavidin-biotin-DNA sample. Split the reaction mixture into 50-100 µL aliquots.\n\tNOTE: The optimal volume for the PCR depends on the PCR machine; typically, 50 µL offers the most reproducible amplification in common PCR machines.\nPerform PCR according to the manufacturer's instructions of the DNA library preparation kit with the number of cycles determined in step 8. If step 8 was omitted, 14 cycles are recommended for PCR.\nPurify the DNA with paramagnetic beads (see Table of Materials) at a ratio of 1:0.9 according to the manufacturer's protocol. Elute in 20 µL of 0.1% TE.\n\tNOTE: If adapter dimers are detected in step 8.5, perform purification twice using the same ratio.\nDetermine the DNA concentration and run the samples on a quality control system (see Table of Materials). Ensure good quality of the Micro-C library by the presence of a single precise band (Figure 1D).",
    "​NOTE: Adaptor dimers are uncommon in on-bead library preparations due to the sample washes before the PCR. Thus, the appearance of adaptor dimers indicates low library complexity. If adaptor dimers are observed, it is highly recommended to quality control the sample with low input sequencing.\n10. DNA sequencing and data processing\nSequence the Micro-C library with paired-end sequencing according to the sequencing provider's requirements.\n\tNOTE: Ideally, the samples are sequenced on a platform in paired-end mode with 50 bp per read. Older platforms that offer shorter read lengths, such as 2 x 35 bp, have also been used successfully. Importantly, if repetitive genomic regions are studied, it might be advisable to sequence with a longer read length.\nTo assess the quality of the Micro-C library, perform low input sequencing with 5 x 106 to 1 x 107 reads per sample.\nProcess the sequencing files (fastq files) with Distiller10. Map the reads against the appropriate reference genome, here mm10.\n\tNOTE: The sequencing files can be processed using various pipelines on local computers or computing clusters. For samples with low sequencing depths, larger bin sizes, such as 10,000 bp, 50,000 bp, 100,000 bp, and 500,000 bp, can reduce computing demands and file sizes. Distiller (used in this study) generates all the required file types to assess the quality of the Micro-C library. The generated *.stats file contains the information on the map rate, cis-trans ratios, and read orientation stratified by the distance between the read pairs. These parameters are visualized in Figure 2, and the assessment of the Micro-C library quality is discussed in the representative results. The processing software also generates mcool files that can be directly loaded into HiGlass (https://docs.higlass.io/) to generate interaction matrices9."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}