{
  "id": 13699,
  "origin_website": "Jove",
  "title": "Behavioral Phenotyping of Murine Disease Models with the Integrated Behavioral Station (INBEST)",
  "procedures": [
    "All procedures are approved by the McMaster University Animal Care Committee and performed in accordance to guidelines set out by the Canadian Council of Animal Care.\n1. General Procedures\nHabituate mice for 1-2 weeks to an existing 12 hr light/dark cycle (e.g., 8 AM – 8 PM). Perform all procedures and testing during the dark cycle, with RT, humidity and light intensity being relatively constant.\nMark or tail-tattoo all mice for easy, numerical identification over a prolonged period and handle them 1-2 hr daily over 5-7 days.\nRepeat daily measurements of rectal temperature, body weight and food/water intake to detect potential fever and/or malnutrition induced by aging or disease progress. Standard exclusion criteria include low body weight due to reduced food/water intake, hunched posture with ruffled fur, hydrocephalus, porphyrin discharge around eyes, etc.\nTo identify neurological deficits that may confound overall activity and performance, perform standard sensorimotor tests such as the hind limb clasping reflex 13, visual placing reflex 14, geotaxis test 15, basket test 16, beam walking test 17-19, Rotarod 20, and olfactory tests 21.\n\tNote: The results may also help in correlational analysis with INBEST measures, more careful selection of other procedures (e.g., Morris water maze if mice are blind, novel object test if mice are hyposmic/anosmic), reduction of within-group variability, and exclusion of mice with birth deficits or infection.\nClean the plastic and glass apparatus with disinfectant to remove urinary trails while testing mice from experimental and control groups in an alternating fashion.\n2. Integrated Behavioral Station (INBEST) Procedure\nHome-cage set up\n\t\nFill food dispensers with 20 mg mouse chow pellets.\nFill bottles with tap water.\n\t\tNote: A second bottle can be filled with a solution of interest, such as sucrose or saccharine solution for a preference test.",
    "Weigh bottles to calculate the volume consumed at the end of the session.\nInsert bottle spouts into the lickometers. Make sure the nozzle does not block the infrared sensor; if it does, reduce the length of the spout.\nPlace shelters in the selected corner of the home-cage.\nComputer set up\n\tNote: The software commands provided in steps 2.2-2.11 are relevant to the Ethovision XT 8.5 software package (specified in the List of Materials/Equipment) and testing conditions in our laboratory.\n\t\nIlluminate the room with diffuse, dim light that is sufficient for video-tracking, but does not reflect off the box, floor or walls.\nOpen a default video-tracking project and set up the Experiment Settings, by keying in relevant details (e.g., date/time of study, group assignment, room conditions etc.). Subsequently, choose the appropriate video source (Picolo Diligent grabber), number of arenas (4), tracking points (center-, nose- and tail-point), and units of measurement (centimeters, seconds, and degrees).\nAfter selecting the Trial List tab under Setup, define the number of trials by clicking the Add Trials button (1). Next, specify independent variables (e.g., mouse ID, gender, group assignment, strain) using the Add Variable button.\nClick the Arena Settings tab and capture the background image from the live video. Define the parameters of the individual arena by outlining the outer perimeter using the appropriate drawing tool (such as create rectangle/polyline/ellipse).\nNext, add zones of interest by clicking the Add Zone group button and outlining the various zones (e.g., floor, lickometers, food dispenser, climbing mesh etc.) in an identical manner. Add hidden zones for the areas where the mouse cannot be seen (e.g., shelter and running wheel, Figure 2) by clicking the Add Hidden Zone Group button. Ensure that an entry/exit is specified and linked to each hidden zone.",
    "Repeat steps 2.4-2.5 for each arena. Perform arena calibration by highlighting Calibration and using the appropriate tool (create calibration scale/axes) to provide arena width and length. Lastly, validate Arena settings by clicking the Validate Arena Settings button.\nHighlight the Trial Control Settings tab and specify start / stop conditions and trial length. Set the start condition to begin when the duration of the center-point exceeds 1 sec in the arena. Manipulate the trial duration by expanding the stop condition box and setting the trial to terminate after a delay, such as 10 hr.\nUnder the Detection Settings tab, highlight the appropriate detection methods (e.g., dynamic subtraction and model-based).\nNext, grab the reference image of the empty arena by clicking the Settings button in the Detection tab and pressing the Grab Current button.\nAdjust the range of contrast such that the center, nose and tail-based detection for each mouse are reliable, accurate and continuous. For albino mice, specify that the mouse is brighter than the background, and darker than the background if using a pigmented strain.\n\t\tNote: The subject size and video sample rate can be changed according to the distance between the overhead camera and the subject, as well as the processing speed of the PC used (e.g., 14.9 frames/sec).\nEnsure all changes are saved before exiting the detection settings module.\nTurn on the interface device, which is responsible for converting recorded analog events from input devices (e.g., interruption of infrared beam, movement of the running wheel etc.) into digital logs.\nData Acquisition\n\tNote: The following software commands are relevant to the custom-made Med PC IV routine (“wizard”) that provides step-by-step input of session parameters (e.g., 10 hr trial duration, mouse ID, group assignment etc.).\n\t\nPlace each mouse into the assigned box.",
    "Synchronize video- and event-tracking packages by simultaneously pressing the 'record' buttons.\nLeave the experimental room quietly.\nWhen the recording period expires (e.g., few hours, day, or weeks), remove mice and return them to their home-cages.\nMeasure bottle weights and save all digital recordings on digital media (hard drive, portable USB stick, DVD).\nTransfer raw data to a spreadsheet.\nSave the MPG files for subsequent scoring of infrequent behavioral acts (e.g., stereotypy, seizures)."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}