{
  "id": 18703,
  "origin_website": "Jove",
  "title": "A Novel Vertebral Stabilization Method for Producing  Contusive Spinal Cord Injury",
  "procedures": [
    "1. Exposure of the Cervical Spinal Laminae\nClean the surgical surface with 70% ethanol, pre-warmed with a heating pad. Cover the surface with a sterile surgical drape before placing sterile gauze, cotton swabs, and autoclaved surgical tools in the surgery area.  Use a microbead sterilizer for inter-surgery sterilization of surgical tools. \nAnesthetize the rat with ketamine (87.7 mg/kg)/xylazine (12.3 mg/kg) intraperitoneally (IP).  The proper plane of anaesthesia is reached when the animal ceases to respond to a toe pinch stimulus. Subcutaneously inject 0.01-0.05 mg/kg Buprenorphine and 5 mg/kg Carprofen prior to surgical procedure.  Buprenorphine should then be administered every 8-12 hr and Carprofen once daily, for the first 4-7 days following surgery.\n Apply protective ointment to the eyes of the animal to prevent corneal drying during surgery.\nShave the surgical area on the dorsal surface of the rat from the mid-thoracic region to the back of the head with clippers.  Remove shaved fur using a vacuum equipped with a HEPA filter.\nApply betadine solution to the shaved area as a surgical scrub then clean the area with 70% isopropyl alcohol wipes.\nUse a scalpel blade to perform a 3-4 cm midline incision in the skin from the base of the head caudally to mid-thorax.\nIdentify the midline of the fascia and subcutaneous muscles anterior to the hibernating gland at the lower neck; cut through the trapezius and other muscles along the midline to reduce hemorrhage.   \n Find the midline of two regions of adipose tissue underlying the muscles; cut the paraspinous muscles caudally strictly along the midline, and separate muscle layers using a small tissue retractor until the level of the thoracic T2 spinous process is reached.\nIdentify and cut away the muscle connected to the T2 spinous process to utilize this structure as an anatomic landmark.",
    "Remove the cartilaginous tip of the T2 spinous process to improve visibility of the cervical vertebrae.\n Separate the paraspinal muscles laterally from the spinous processes and laminae of C4-T1; however, spare the muscle covering on the C3 lamina to prevent bleeding.  \n Cut the muscles over the laminae from C4-T1 laterally towards the facets on both sides of the spinal column.\n After the spinal laminae are exposed, place the animal on its ventral surface in the U-shaped channel of the stabilizer.\n Identify the C5 vertebra by counting the spinous processes rostrally from the T2 landmark to T1, C7, C6, and finally C5.\n2. Stabilizing the Vertebrae and Performing the Impact Injury\nPosition the two stainless steel arms of the stabilizer to suspend the animal by placing the serrated edges of the arms underneath the lateral facets of the C5-6 vertebrae (Figure 1C).  After securing the arms with vertebrae in place (Figure 2B), adjust the stabilizing apparatus to ensure the vertebral column is level and centered.  Finally, lock the arms by tightening the thumbscrews of the stabilizer.\nCut the ligaments between the spinal processes and laminae at C4-5 and C5-6 to identify the margin of the C5 lamina.\nUsing a micro-rongeur, clip away the half of the lamina on the right at C5 as intended for SCI (Figure 5C-E).  After laminectomy, transport the animal with the stabilizer under the injury device.  Secure the animal together with stabilizer on a mount (Figure 3A-C) to precisely align the plunger on the spinal cord target using a lateral micro-manipulator (Figure 3).",
    "Under high magnification, locate the C5 and C6 dorsal root entry zones (DREZs) on the exposed dorsal spinal cord surface without durotomy.  Aim the plunger at the middle of the two identified DREZs and halfway between the midline and the lateral edge of the spinal cord (Figure 5B).\nUsing an NYU/MASCIS impactor device with a 2.5 mm diameter tip (Figure 3A & B), produce a C5 hemi-contusion  (Figure 5B & E) by a 10 g rod x 12.5 mm height drop (Figure 2A).\nVerify the injury visually by bruising on the spinal cord (Figure. 5E, arrow) and check the injury parameters provided by the NYU software12,17 (Figure 6).\nSuture muscles and soft tissue with sterile 4-0 vicryl suture, then close the skin incision with surgical staples (EZ Clips).\nApply antibacterial ointment to the surgical site.\nAdminister 5.0 ml of sterile 0.9% saline subcutaneously to the animal for hydration.\nPlace the animal in a heat-controlled environment (recirculating hot water padcage on a heating pad) ) with moist food provided on the bedding (changed daily), and a water bottle with a long spout for easy access placed on the floor of the cage.  Provide care to ensure adequate recovery before returning the animal to the home cage.\nAs this is a unilateral cervical contusive injury, the animal will likely lose function of the ipsilateral forelimb, transiently, which begins to recover during the first few weeks after injury.  However, contralateral function should remain intact, thus the animal should be able to eat and drink without impairment, and have only minor impairment in locomotion and grooming."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}