{
  "id": 4621,
  "origin_website": "Bio",
  "title": "Differentiation of Naturally Produced Extracellular Membrane Vesicles from Lipid Aggregation by Glucuronoxylomannan Immunogold Transmission Electron Microscopy in <em>Bacillus subtilis</em>",
  "procedures": [
    "Purification of GXM   Grow 1 L of YPD broth inoculated with C. neoformans strain H99 overnight at 37 °C with shaking (~18 h 200 rpm).   Spin out cells by centrifuging 15,000 x g for 20 min at 4 °C.   Filter cell-free supernatant with 0.22 μm Express PLUS Membrane Filters to remove debris.   Sequentially concentrate the cell-free supernatant with 100 kDa, 50 kDa, 10 kDa, and 1 kDa cut-off EMD Millipore Ultrafiltration Membranes. The jelly that forms on the filters is GXM (save jelly that is <10 kDa and >1 kDa) (see Figure 1 for concentrator set-up).      Purification of gram-positive extracellular vesicles   Inoculate 100 ml of BHI broth with fractionated GXM <10 kDa and B. subtilis strain 168.   Grow overnight at 37 °C with shaking (~18 h 200 rpm).   Centrifuge culture to remove cells at 15,000 x g for 20 m at 4 °C.   Filter cell-free supernatant with 0.22 μm Express PLUS Membrane Filters to remove debris.   Concentrate cell-free supernatant to small volumes (approximately 6 ml) with ultrafiltration system and 100 kDa cut-off EMD Millipore Ultrafiltration Membranes (Figure 1).   Ultracentrifuge concentrated supernatant at 100,000 x g for 1 h at 4 °C in thickwall, polyallomer, 3.5 ml, 13 x 51 mm tubes to pellet vesicles (Figure 2).   Wash/resuspend vesicle pellet with 500 μl PBS and repeat spin (repeat wash twice).   Remove supernatant from sample without disturbing pellet.   For sonication (production of disrupted/unnatural vesicles-positive control) resuspend pellet in PBS and sonicate (20 sec sonication and 30 sec incubation at 4 °C on ice, repeated 4 times at power 2).   Ultracentrifuge again to pellet vesicles and carefully remove supernatant.     Carefully add 4% paraformaldehyde, 0.1% glutaraldehyde in 0.1 M sodium cacodylate without disturbing pellet.   Incubate for 1 h at room temperature (RT).",
    "Sample preparation for immunogold labeling   After fixing for 1 h at RT, wash with 0.1 M sodium cacodylate 3 times.   Enrobe samples in 5% gelatin.    Dehydrate through a graded ethanol series in a RMC FS 7500; progressively lowering the temperature 5 °C /h from 4 °C to -50 °C.   Use Lowicryl HM-20 monostep resin to embed sample.    Polymerize embedded sample with UV light for 48 h at -50 °C.   Use Reichert Ultracut UCT to cut 80 nm ultrathin sections onto 200 mesh nickel grids.      Immunogold labeling of GXM in vesicle preparations   Block with Aurion Donkey Block for 1 h.   Incubate samples with the primary α-GXM mAb antibody, 18B7, in 0.1% BSA-c/PBS incubation buffer for ~18 h at 4 °C.   Wash samples with 0.1% BSA-c/PBS.   Incubate samples with the secondary donkey α-mouse IgG 10 nm immunogold-conjugated antibody for 2 h at RT.   Wash samples with BSA-C.   Post-fix samples for 5 m at 25 °C with 2% glutaraldehyde/PBS to stabilize the gold particles.   Counterstain samples for 15 min 25 °C with 4% uranyl acetate (aq).   Also make control samples with an irrelevant IgG antibodies and without the 1o antibody (18B7)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}