{
  "id": 9771,
  "origin_website": "Jove",
  "title": "Organotypic Hippocampal Slice Cultures",
  "procedures": [
    "1.  Before Starting the Preparation of Hippocampal Slices.\nPrepare the tissue slicer by placing a piece of Teflon sheet and mounting a new blade.\nWipe the tissue culture (TC) hood with 70% ethanol and set the dissecting microscope inside.  Sterilize the hood, microscope, tissue slicer and all dissecting instruments for 15 minutes with UV light.\nPrepare six well TC plates.  Add 750  μL slice culture media (SCM) per well and place cell culture inserts in each well.  Make sure the membranes are thoroughly wet with no bubbles underneath. Place the plates in incubator at 35°C gassed with 5% CO2 until needed.\nPour 50  mL low Na+ ACSF (dissecting solution) into a 100 mL beaker and place it on ice-salt mix.  Bubble the low Na+ ACSF with 5% CO2 / 95% O2 until color changes and ACSF forms a slurry mix of frozen and liquid solution (10-20 min).\nGet a P5-P7 rat pup. Up to three pups can be used.\n2.  Hippocampal Slices Preparation.\nCut the head of the animal with sharp utility scissors.   Cut the skin and expose the skull.  Open the skull by cutting from side to side along the interaural line and then along the sagittal suture with small scissors.  An optional cut from side to side in the front can be made to facilitate removing the bones and exposure of the brain.  Scoop out the brain quickly with a rounded spoon micro spatula and place it in the slurry of dissecting solution to chill for ~ 1 minute. Pour ~10  mL of ice cold dissecting solution onto a 60 mm dish and transfer the brain from the beaker to the dish. The brain should be covered with dissecting solution.",
    "Under the dissecting microscope: Place the brain and hold it at the midline with the dissecting forceps pressed to the bottom of the 60 mm dish. Use the hippocampus dissecting tool to separate the hemispheres leaving out the midbrain.   The hippocampi are then exposed on each hemisphere.  Then gently scoop the hippocampus out with the hippocampus dissecting tool.  Use the dissecting needle to completely isolate the hippocampus and clean it as much as possible.\nUsing a snipped tip of a P1000 filter pipette tip, gently aspirate the hippocampus and transfer it to the Teflon sheet on the tissue slicer.   Position the hippocampus on its concave side.\nAlign the hippocampi perpendicular to the blade to obtain coronal sections and drain excess of liquid.\nSlice the hippocampi every 400 μm.\nPour ~10  mL cold SCM into a 60 mm dish and transfer sliced hippocampi from the slicer using another snipped P1000 filter tip and cold SCM. Avoid making bubbles.\nWith the help of an iris spatula and a straight spatula gently separate the slices from each other.\nSeparate well defined and undamaged slices from damaged slices.\n3.  Hippocampal Slices Culture\nBring the six-well plates with SCM and cell culture inserts from the incubator. With the help of another snipped P1000 filter tip, transfer individual slices onto the membrane. Place 4-5 slices per membrane. Be careful not to place the slices either close to the insert wall or close to each other. When necessary, use iris spatula to separate slices.  Remove excess medium. Touch slices as little as possible once they are on the membrane.\nMove plate back to incubator and culture at 35°C and 5% CO2.",
    "Change SCM every 48 hours inside the TC hood by aspirating the SCM with a Pasteur pipette. Add 750  μL of fresh pre-warmed SCM per well. Make sure no bubbles are formed under the membrane.\n4.  Solutions\nLow Na+ ACSF - Dissecting Solution for slice cultures\nTo deionized and sterile H2O add:\ntable:\n﻿0,1,2,3\n,For 500 mL,For 1000 mL,Final Concentration\nCaCl2 (1 M),0.5 mL,1 mL,1 mM\nD-Glucose,0.901 g,1.802 g,10 mM\nKCl,0.149 g,0.298 g,4 mM\nMgCl2 (1 M),2.5 mL,5 mL,5 mM\nNaHCO3,1.092 g,2.184 g,26 mM\nSucrose,40 g,80 g,234 mM\nPhenol Red Solution 0.5% in DPBS,0.5 mL,1 mL,0.1% v/v\nMix ~30 min\nSterilize by passage through 0.22μm filter\nMake 50  mL aliquots and store at 4 °C no longer than 2 months.\nSlice Culture Medium (SCM)\ntable:\n﻿0,1,2,3\n,For 500 mL,For 1000 mL,Final Concentration\nMEM Eagle medium,4.2 g,8.4 g,8.4 g/l\nHorse serum heat inactivated,100 mL,200 mL,20%\nL-Glutamine (200 mM),2.5 mL,5 mL,1 mM\nCaCl2 (1 M),0.5 mL,1 mL,1 mM\nMgSO4 (1 M),1 mL,2 mL,2 mM\n\"Insulin (1 mg/ mL), dissolved in HCl 0.01 N\",0.5 mL,1 mL,1 mg/l\n\"Ascorbic Acid, solution (25% w/v)\",0.024 mL,0.048 mL,0.00125%\nD-Glucose,1.16g,2.32g,13 mM\nNaHCO3,0.22g,0.44g,5.2 mM\nHepes,3.58g,7.16g,30 mM\nMix until thoroughly dissolved and bring to room temperature.\nAdjust pH to 7.27-7.28 with 1 N NaOH\nMeasure osmolarity.  Adjust to 320 mmol/kg with deionized and sterilized H2O.  Expect to add approximately 25-40  mL.  Check osmolarity again.\n***pH may change slightly while adjusting osmolarity, this is ok, it is more important that the              osmolarity is in the correct range (317-323).\nSterilize by passage through 0.22 μm filter.\nMake 20  mL aliquots and store for up to two-three weeks at 4°C.\nGluatamine stock: prepare at a concentration of 200 mM and store at -20 °C in aliquots of 2.5  mL.",
    "Ascorbic acid stock: prepare at a concentration of 25% (w/v) and stored at -20 °C in aliquots of 100  μL.\n5.  Representative Results:\nSlices should look white under a dissecting scope without black spots and well defined and undamaged CA1, CA3, and Dentate gyrus regions. Bacterial contamination is easily seen as moving black specks in the medium or turbidity of the SCM.  When placed under the microscope, the surface of the slice should look clean after 4 days in culture with clear and discernibly cell bodies.  If no clear cell bodies are seen and much debris covers the surface after 4 days, then is not a healthy slice.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}