{
  "id": 2576,
  "origin_website": "Cell",
  "title": "Overexpression and ELISA-based detection of asprosin in cultured cells and mice",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nAsprosin-expressing Ad5 and AAV8 vector transduction in mice\nTiming: 15 min per mouse\nThis section describes the method for tail vein injection of asprosin coding- and empty-control adenoviral (Ad5) and Adeno-associated (serotype 8, AAV8) viral vectors in lean, male mice. This section further describes method for blood collection, food intake and body weight assessment of viral vector transduced mice.\nPrior to injection, warm animal (12-week-old C57BL/6J male mice) for 5–10 min to dilate the veins.\nNote: Mice may be warmed by placing the animal in a commercially available warming box, or by using a warm water circulating pad (37°C) placed under the cage. Overhead heat lamp can also be used, however extra care must be taken to prevent overheating the animal (Resch et al., 2019[href=https://www.wicell.org#bib9]; Yano et al., 2020[href=https://www.wicell.org#bib11]).\nPosition the tail on circulating heat pad with animal restrained on its side in a restrainer.\nNote: Topical oil of wintergreen can be applied to the tail to aid in vasodilation (Hrapkiewicz and Medina, 2007[href=https://www.wicell.org#bib5]).\nCritical: Orientation and location of the lateral tail vein must be ensured before performing injections. For a successful tail vein injection, it is critical to dilate the veins properly. Care should be taken to not overheat the tail, and to keep enough barrier paper towel layers between the heat pad and tail.\nInject each mouse with 150 μL of AAV8 vector.\nNote: Mice injected with AAV8-empty (1 × 1012 GC/mouse) will serve as control for experimental mice injected with AAV8-IL2sp-6His-Asprosin (1 × 1012 GC/mouse). AAV8 dilutions should be prepared as suggested in the section 4 of the protocol (Mishra et al., 2021[href=https://www.wicell.org#bib6], 2022[href=https://www.wicell.org#bib7]).\nAd5-hFBN1 (150 μL, 3.6 × 109 pfu/mouse) can also be used for asprosin overexpression in mice.",
    "Critical: It is critical to inject control mice with the same concentration of viral vectors as the experimental mice.\nNote: Mice injected with Ad5-empty (3.6 × 109 pfu/mouse) served as controls for experimental mice that received Ad5-hFBN1 viral vector (3.6 × 109 pfu/mouse) containing the human FBN1 coding region under control of a CMV promoter. Ad5 dilutions should be prepared as suggested in the section 4 of the protocol (Mishra et al., 2021[href=https://www.wicell.org#bib6], 2022[href=https://www.wicell.org#bib7]).\nClean the site of injection with 70% ethanol and place the mouse back with its littermates in the parent mouse cage, as approved by the institution’s biosafety committee.\nNote: The duration of the restraint should be kept to a minimum, and the equipment cleaned frequently to prevent pheromone-induced stress or cross contamination.\nProvide mice with food and water ad libitum throughout the experiment.\nMonitor changes in body weight and food intake.\nNote: Dustless pellet diet can be used for manual measurement of food intake. For experiments using AAV8, body weight and food intake can be monitored once weekly for 15 weeks or longer, while for experiments using Ad5 vectors, body weight and food intake can be measured every fourth day for up to twenty-five days.\nMice can be subjected to sub-mandibular bleeding or other institutional IACUC committee approved methods for blood collection and plasma extraction.\nNote: Anesthesia is not required for submandibular bleeding.\nSubject plasma samples to proteome purification as outlined in section 5a, iii-vi in “before you begin[href=https://www.wicell.org#before-you-begin]” of this protocol.\nDetect overexpressed asprosin as outlined in the section ‘ELISA detection of asprosin[href=https://www.wicell.org#sec4.3]’ below.",
    "Critical: It is critical to determine the appropriate amount of active/infectious Ad5 viral vector titers for successful in vivo overexpression of asprosin. If not enough virus is used, a significant overexpression of asprosin cannot be achieved. If too much is used, it will result in cytotoxicity or other undesired effects. It is advised to use the minimum Ad5 concentration that will result in 100% gene delivery. This optimal concentration differs dramatically between Ad5 preparations as the viral particles (vp) to pfu (plaque forming units) ratio differs for each Ad5 preparation. Optimal Ad5 concentrations should be established for each Ad5 preparation based on pilot in vitro and in vivo testing. Additionally, since tracking body weight and food intake is a reliable marker of successful asprosin overexpression, It is critical to use age-, sex- and weight-matched mice for the experiments.\nHEK293T cell transfection with asprosin-expressing plasmid\nTiming: 6 days\nThis section describes the method for collection of conditioned media from HEK293T cells transfected with human asprosin expressing mammalian expression plasmid (pcDNA3.1-IL2sp-6His-Asprosin) and empty-control plasmid (pcDNA3.1-control plasmid).\nPlate cells as detailed in section: preparation for culture of HEK293T cells[href=https://www.wicell.org#sec1.2] of the before you begin part of this protocol.\nTreat HEK293T cells with plasmid once cells are estimated to be 70% confluent.\nNote: It takes approximately 2 days (48 h) for cells to reach 70% confluency. Follow the Fugene HD transfection protocol for transfection of HEK293T cells with control and asprosin-overexpressing mammalian expression plasmids (https://www.promega.com/resources/protocols/technical-manuals/101/fugene-hd-transfection-reagent-protocol/[href=https://www.promega.com/resources/protocols/technical-manuals/101/fugene-hd-transfection-reagent-protocol/]).\nFor each 10 cm plate, add 10 μg of plasmid to 1 mL of serum free media, and add 30 μL of FuGENE® HD transfection reagent in a microcentrifuge tube.\nNote: For successful transfection of plasmid DNA into cultured cells, the ratio of 1:3 of FuGENE® HD Transfection Reagent:DNA is recommended.",
    "Incubate this solution at room temperature (18°C–22°C) for 15 min before adding it to the HEK293T cells.\nNote: HEK293T cells transfected with pcDNA3.1-control plasmid will serve as control for HEK293T cells transfected with pcDNA3.1-IL2sp-6His-Asprosin. A successful transfection is critical for asprosin overexpression.\nPlace the plate in 37°C incubator with humidified atmosphere of 5% CO2.\n24 h later, replace the media in 10 cm plate with 10 mL of fresh complete media.\nLeave the plate undisturbed in 37°C incubator with humidified atmosphere of 5% CO2 for the next 48 h.\nCollect conditioned media 72 h post transfection, and every 24 h following it if required.\nAdd 10 μL of 100× Halt protease inhibitor per mL of the conditioned media and store it at 4°C for short duration, or at −20°C or −80°C for longer duration, until subjected to asprosin detection ELISA.\nCritical: A successful transfection is critical for asprosin overexpression in HEK293T cell culture. Care should be taken to not add concentrated DNA plasmid directly to the FuGENE® HD transfection reagent. This can lead to precipitation of the DNA. It is advised to first dilute DNA in serum free media before addition of the FuGENE® HD transfection reagent.\nELISA detection of asprosin\nTiming: 48 h\nThis section describes a custom-built sandwich ELISA protocol for detection of overexpressed human asprosin in conditioned media from HEK293T cells transfected with asprosin-expressing plasmid. This protocol can also be used for detection of asprosin in plasma samples from mice transduced with human asprosin expressing and empty-control adenoviral (Ad5) and Adeno-associated (serotype 8, AAV8) viral vectors.\nPrepare reagents as outlined in step 6 of “before you begin[href=https://www.wicell.org#before-you-begin]” of this protocol.\nNote: Bring all reagents and samples to room temperature (18°C–22°C) before use.",
    "Critical: It is recommended that all standards and samples be run at least in duplicate in the same ELISA plate.\nSelect the number of wells required for running samples.\nAdd 100 μL of (1 ng/μL) anti-asprosin mouse monoclonal antibody in the selected wells.\nIncubate the plate 16–18 h at 4°C.\nAdd 250 μL of blocking solution and incubate the plate at room temperature (18°C–22°C) for 2 h.\nDiscard the solution and wash 3 times with 1× wash solution.\nNote: Wash by filling each well with wash buffer (350 μL) using a multi-channel Pipette or autowasher. Discard the wash buffer after 3–5 min incubation at room temperature (18°C–22°C).\nCritical: Complete removal of liquid at each step is essential to good performance. After the last wash, invert the plate and blot it against clean paper towels to remove any remaining wash buffer.\nFor detection of asprosin in DMEM media from in vitro studies, add 100 μL of each standard and media samples in duplicates to the respective wells.\nFor detection of asprosin from in vivo experiments, process 10 μL of plasma for proteome purification as indicated in steps 5a, iii-vi in “before you begin[href=https://www.wicell.org#before-you-begin]”.\nConcentrate the purified plasma filtrates to a volume of 40–50 μL as indicated in steps 5a, vii-viii in \"before you begin[href=https://www.wicell.org#before-you-begin]\"\nAdd processed plasma to the respective wells and make up the volume to 100 μL with blocking buffer.\nAdd 100 μL of blocking buffer to blank wells.\nIncubate the ELISA plate at 18°C–22°C for 3–4 h.\nAlternatives: The plate can be incubated at 4°C overnight (16–18 h).\nDiscard the solution and wash 3 times with 1× wash solution as described in step 25 above.\nAdd 100 μL of (1 ng/μL) anti-asprosin rabbit monoclonal antibody to all wells and incubate the plate at room temperature for 4 h.",
    "Alternatives: Incubate the plate at 4°C overnight (16–18 h).\nDiscard the solution and wash 3 times with 1× wash solution, as described in step 25 above.\nAdd 100 μL of HRP-labeled anti-Rabbit secondary antibody to each well and incubate the plate at room temperature (18°C–22°C) for 2 h.\nDiscard the solution and wash 3 times with 1× wash solution, as described in step 25 above.\nAdd 100 μL of substrate to each well. Cover wells and incubate for a maximum of 20 min at room temperature (18°C–22°C) in the dark with gentle shaking.\nAdd 100 μL of Stop Solution to each well.\nRead absorbance at 450 nm immediately.\nCritical: DMEM media collected from cell culture may have some cell debris contamination. HEK293T cells also express FBN1 and asprosin (data not shown), thus it is advised to subject cell media to a quick spin (1,000 rpm, 5 min on a fixed-angle rotors at 4°C) before addition of media to the ELISA plate. An intense yellow color development on addition of substrate may lead to dark blue precipitates on addition of stop solution. An absorbance read from such samples will not be a true reflection of asprosin concentration. Therefore, color development on the ELISA plate should be monitored frequently after addition of substrate. It is also critical to read the ELISA plate immediately (within two minutes) of adding stop solution."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Antibody",
    "Metabolism",
    "Neuroscience",
    "Molecular Biology",
    "Gene Expression"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}