{
  "id": 19057,
  "origin_website": "Jove",
  "title": "Mouse Model of Intraluminal MCAO: Cerebral Infarct Evaluation by Cresyl Violet Staining",
  "procedures": [
    "Transient Middle Cerebral Artery Occlusion (MCAO)\n1.  Surgery Procedure (Figure 1)\nTransient  middle cerebral artery occlusion (tMCAO) is performed on 2- to 3-month old male  C57Bl/6 mice (22-28g). This protocol was approved by the IRCM bioethics  committee animal care. Surgical tools were sterilized by autoclaving (121 °C at 15 psi  for 60 min). Between each animal, they were sterilized using the hot bead  sterilizer (15 sec). Surgery table and  other equipment are sanitized using 70% ethanol. \nTwo hours before  surgery, mice were analgesized with  buprenorphine (0.03 mg/kg b.w. i.p.). \nFigure 1A. \nDeeply anaesthetize mice  with isoflurane 5% and then maintain the anesthesia at 2.5% isoflurane. Body temperature  of the mice is maintained constant during surgery with a heating pad.\nDisinfect the fur and skin  with 70% ethanol or Betadine. Since shaving produces hair fragment release,  microabrasions and inflammation that may impact on stroke pathophysiology, we do  not shave mouse fur.\nMake a midline neck  incision and gently pull apart the soft tissues.\nUnder a stereo microscope (Stemi 2000, Zeiss), a  blunt dissection is performed to expose the trachea and retract the muscles to  locate the carotid artery.\nThe left common carotid  artery (CCA) is carefully dissected from surrounding tissue and the CCA is  temporarily occluded by a temporary suture (1) using 5-0 silk suture cut into  20 mm segments. Great care should be exercised not to harm the vagal nerve.\nSeparate the bifurcation of the left internal common carotid  artery (ICA) and external common carotid artery (ECA). A permanent suture (2) is placed  around the ECA, as distally as possible, and another temporary suture slightly  tight (3) is placed  on the ECA distal to the bifurcation.\nClip the left ICA (4) using a reverse-action  tweezers to avoid bleeding. Great  care should be exercised not to harm the vagal nerve.",
    "Cut a small hole into ECA (5)  between permanent (2) and temporary (3) sutures.\nFigure 1B. \nIntroduce a 12 mm-long 6-0 silicon-coated (about 9-10mm is coated  silicon) monofilament suture (Doccol Corporation)  into the ECA (6), completely cut the ECA distal to the permanent suture and  invert the occluder into the ICA. The suture is tightly tied around the monofilament  to prevent bleeding and the reverse-action tweezers are removed. \nThe occluder is introduced  to occlude the origin of the MCA in the circle of Willis. Stop its insertion around  9-10 mm beyond the bifurcation of ECA and CCA. The occluder is blocked and  cannot move anymore. Care must be exercised not to penetrate the pterygopalatine  artery. The suture (3) on the ECA is tightly tied to fix the monofilament in position.\nClose the skin with an autoclip wound closing system.\nInject 1 ml of saline solution  subcutaneously and place mice under an infrared  heating lamp during all the post-occlusion period (60 min).\n2. Restoration of Middle Cerebral Artery Blood Flow\nBefore reanesthesia, the neuroscore can be checked to evaluate the success of the surgery.\nAnesthetize the mice as  previously described and remove the autoclips.\nSlightly open the suture  (3) onto the ECA to allow monofilament withdrawal and blood reperfusion.\nPermanently tie off the temporary suture on the ECA to  prevent blood loss. The monofilament is kept for  reuse.\nRemove the temporary suture  (1) onto the CCA to allow blood recirculation.\nClose the wound. The mice should receive another 1 ml saline solution subcutaneously.",
    "Place the mice under the infrared heating lamp for 1 hr. After checking that the animal regains mobility, the  mouse is returned to its cage and left under the heating pad and towels for 72  hr. Note that only half of the cage is placed on the heating pad to allow  mice to choose their environment. Because post-surgical weight loss is generally observed, mashed food is placed in a Petri dish to encourage eating.\n        Twelve hours post-surgery, mice received another dose of buprenorphine (0.03 mg/kg b.w. i.p).\n3. Sham Operation\nFor sham operations, all  procedures are identical except that the occluder is not inserted.\n4. Neuroscore\nNeurological deficits allow  the evaluation of the success of tMCAO just after reperfusion and later the estimation  of the degree of severity of the injury. Neurological deficits are scored as  previously described 5 and performed at 1, 24, 48 and 72 hr post-reperfusion. An expanded six-point scale is used:\n0: normal.\n1: mild circling behavior with or without  inconsistent rotation when picked up by the tail, <50% attempts to rotate to  the contralateral side.\n2: mild consistent circling, >50% attempts to rotate  to the contralateral side.\n3: consistent strong and immediate circling, the mouse  holds a rotation position for more than 1-2 sec, with its nose almost reaching its  tail.\n4: severe rotation progressing into barreling, loss  of walking or righting reflex.\n5: comatose or moribund.\n5. Cresyl Violet Staining (Figure 2)",
    "Following PBS solution  perfusion, brains are quickly frozen in isopentane and stored at -80 °C. Mouse brains may be also perfused with 4% paraformaldehyde (PFA) depending  on the planned immunohistochemistry studies. Cryostat-cuts of coronal brain  sections (17 μm) are performed. One section out of every 30 is collected on the  same slide to have a representative cerebral injury. For volume quantification,  2 slides are stained by cresyl violet staining and an image analysis system  (Scion Corporation, Frederick, MD) was used to evaluate the lesion. The injury  volume was calculated in arbitrary units (pixels), and expressed as a  percentage of the contralateral non-lesioned area for each section. Other  slides are kept at -80 °C for immunohistochemistry studies. Alternatively, PFA-fixed brain can be cut at 30-50 μm  using vibratome and the infarct volume measured as recommended by  Han et al. (2009)6."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}