{
  "id": 3168,
  "origin_website": "Cell",
  "title": "Evaluating the function of murine quiescent hematopoietic stem cells following non-homologous end joining-based genome editing",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nMouse bone marrow preparation\nTiming: approximately 2-3 h, depending on the number of mice (for steps 1 to 26)\nThese steps describe the preparation of HSC from bone marrow.\nPrepare the adequate number of human ubiquitin C promoter (UBC)-GFP transgenic mice to obtain the HSCs you need.\nNote: Approximately 2,000–3,000 HSCs can be obtained from two femurs, two tibias, and two pelvises from 8 to 14-week-old male mice when a strict gating strategy is applied for cell sorting. As for culture, a total of 500 HSCs per well in a 96-well culture plate is suitable for analysis.\nOptional steps: CD45.1 congenic mice or other genetically-modified mice can be used according to your experimental purpose.\nEuthanize mice by CO2 euthanasia or cervical dislocation.\nSterilize the dissection area, dissection kit, and the fur of the mice with 70% ethanol.\nCut the skin of the abdomen and strip off the skin to the ankles.\nCut off the foot from the tibia just above the ankle (Figure 1[href=https://www.wicell.org#fig1]A) and strip off the triceps muscle and cut off the Achilles tendon (Figure 1[href=https://www.wicell.org#fig1]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2742-Fig1.jpg\nFigure 1. Cell isolation from mouse bone marrow\n(A–G) Cutting site is marked by red arrows (A–E). After removing the muscles and connected tissues (F), flush the femurs, tibiae, and pelvis with PBS + 2% FCS using a 21-gauge needle (G).\nCut the patella tendon and remove the quadriceps femoris and the biceps femoris muscles from the femur (Figure 1[href=https://www.wicell.org#fig1]C and 1D), and then dislocate the hind limb from the hip joint.\nDislocate femurs and tibiae at the patella and resect the pelvic bone (Figure 1[href=https://www.wicell.org#fig1]E).",
    "Remove residual muscles and connective tissues entirely on a paper towel using scissors (Figure 1[href=https://www.wicell.org#fig1]F), then place the bones into 20–30 mL of ice-cold PBS + 2% FCS in a 10 cm Petri dish (Greiner).\nFlush the femurs, tibiae, and pelvis with PBS + 2% FCS using a 21-gauge needle (Terumo) and a 10 mL syringe (Terumo) to collect the bone marrow plug and disperse the plug by refluxing through the needle (Figure 1[href=https://www.wicell.org#fig1]G).\nTransfer the cell suspension to a 50 mL conical tube.\nCentrifuge the supernatant at 400 × g for 5 min at 4°C.\nDiscard the supernatant by inverting the tube quickly and remove the droplets on the rim with a paper towel.\nAdd 5 mL per mouse of lysis buffer (0.17 M NH4Cl, 1 mM EDTA, 10 mM NaHCO3) and incubate on ice for 5 min.\nAdd 2 volumes of PBS + 2% FCS and centrifuge at 400 × g for 5 min at 4°C.\nDiscard the supernatant and resuspend cells in 10–20 mL of PBS + 2% FCS.\nFilter cell suspension through a 40 μm nylon mesh (BD Biosciences), and centrifuge at 400 × g for 5 min at 4°C.\nDiscard the supernatant and resuspend cells in 80 μL/mouse of PBS + 2% FCS.\nTransfer the cell suspension to a 1.5 mL tube.\nAdd anti-CD16/32 antibody for Fc-receptor block (2 μL/mouse) and incubate for 5 min at 4°C\nAdd anti-c-Kit magnetic beads (Miltenyi) at a 1/10 v/v ratio and incubate for 15 min at 4°C in the dark.\nAdd 500 μL to 1 mL of PBS + 2% FCS and centrifuge at 400 × g for 5 min at 4°C. Discard the supernatant.\nRepeat step 20.",
    "Resuspend cells with 2 mL of PBS + 2% FCS and filter the suspension with a 40 μm filter to avoid clogging the column and transfer to a 5 mL tube.\nAlternatives: Resuspend the filtered cell suspension with 5 mL of PBS + 2% FCS and transfer to a 15 mL tube when the number of mice is greater.\nEnrich c-Kit positive cells using Auto-MACS Pro (Miltenyi) with the Possel-d2 program.\nAlternatives: If Auto-MACS Pro is not available, Manual-MACS is an alternative method for cell separation\nTransfer the cell suspension of the positive fraction (2 mL) into two 1.5 mL tubes separately, centrifuge at 340 × g for 5 min, and discard the supernatant.\nCentrifuge the isolated cells once at 340 × g for 5 min at 4°C and aspirate the supernatant.\nAntibody staining\nTiming: 40–50 min\nThese steps describe antibody staining of HSC.\nLabel cells with an antibody cocktail as follows: lineage markers (CD4, CD8a, Gr-1, Mac-1, Ter-119, and B220)-PerCP-Cy5.5, c-Kit-APC-Cy7, Sca-1-PE-Cy7, CD150-BV421, CD48-PE, and Flt3-APC. Use 0.25 μL of antibody per mouse and mix with 20 μL PBS + 2% FCS. Incubate cells for 30 min at 4°C in the dark.\nAdd 1 mL of PBS +2% FCS and centrifuge at 340 × g for 5 min at 4°C. Discard the supernatant.\nResuspend cells in 0.5–2 mL of PBS + 2% FCS + 0.1% propidium iodide, , and transfer to a 5 mL tube.\nSorting of HSCs\nTiming: 5–10 min per mouse\nThese steps describe the sorting of HSC.\nLoad the sample tube on the FACS Aria IIIu and set gates as shown in Figure 2[href=https://www.wicell.org#fig2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2742-Fig2.jpg\nFigure 2. Gating strategy of HSCs",
    "Representative flow cytometric plot for sorting HSCs from UBC-GFP mice. HSCs were defined as CD150+CD48-Flt3- LSK cells. Multipotent progenitors (MPPs) were sub-fractionated into MPP1 (CD150-CD48-Flt3- LSK), MPP2 (CD150+CD48+Flt3- LSK), MPP3 (CD150-CD48+Flt3- LSK), and MPP4 (Flt3+ LSK).\nSort cells into a 1.5 mL tube containing 500 μL of culture medium with 4% w/v BSA.\nCentrifuge sorted cells at 340 × g for 5 min at 4°C, then discard the supernatant and aspirate the residue carefully not to disturb the pellet.\nKeep the cell pellet on ice until culture.\nPreculture before genome editing\nTiming: 16–24 h\nThese steps describe preculture before genome editing of HSC.\nPrepare the 4% BSA medium or StemSpan supplemented with 50 ng/mL of SCF and TPO (preculture medium).\nOptional: Separate some freshly-isolated HSCs and culture them under quiescence-maintaining conditions as a control of genome editing efficiency and transplantation.\nDissolve the cell pellet in preculture medium at a density lower than 1.0×105/mL (maximum 2.0×104 cells in 200 μL of preculture medium).\nIncubate in 20% O2 and 5% CO2 for 16–24 h.\nNote: Preculture improves RNP delivery into the nucleus.1[href=https://www.wicell.org#bib1] A shorter preculture time (< 16 h) and lower cytokine concentrations can lead to lower editing efficiency. A longer preculture time (> 24 h) does not improve editing efficiency and may promote differentiation of HSCs.\nNHEJ-based genome editing with CRISPR-Cas9\nTiming: 1-1.5 h\nThese steps describe gene editing procedure of HSC.\nPrepare the post-editing culture medium as described in “setting up culture medium for quiescence-maintaining and proliferative conditions[href=https://www.wicell.org#sec1.2]”.\nPrepare the RNP complex.\nThaw the sgRNA stock on ice.\nIncubate Cas9 protein (Thermo Fisher Scientific, TrueCut Cas9 Protein v2) and sgRNA (sgRNA stock) for 5–10 min at 25°C.\ntable:files/protocols_protocol_2742_8.csv\nKeep the RNP complex on ice until use.",
    "Harvest precultured HSCs from the plate and centrifuge at 340 × g for 5 min at 4°C. Discard the supernatant.\nResuspend cells in 30 μL of Buffer T.\nCritical: Because T-buffer is harmful to cells, electroporation should be performed immediately after resuspending HSCs with T-buffer if multiple gRNAs are tested. It is recommended to minimize the time from resuspension to starting post-editing culture after electroporation.\nAdd 6 μL of RNP to yield a total volume of 36 μL.\nGently pipet the mixture of cells and RNPs with a 10 μL Neon Tip.\nCritical: Gently pipetting the mixture of cells and RNP before electroporation is the most critical point to remove the bubbles within the new Neon Tip. Bubbles within the electroporation tube significantly decrease the transfection and genome editing efficiency.\nPerform electroporation three times using the Neon Transfection System (Thermo Fisher Scientific). The electroporation condition is as follows: 1700 V, 20 ms, and one pulse for mouse HSPCs. The stop time between each electroporation is from 30 s to 1 min.\nNote: A Neon Tip can be used for three serial electroporations without losing editing efficiency in our experience.\nTransfer 500 (-1000) electroporated HSCs directly into the post-editing culture medium (quiescence-maintaining or proliferative culture conditions).\nNote: For testing multiple post-editing conditions, harvest electroporated cells into the 4% BSA medium and transfer them to multiple culture wells with a 20 μL pipette or 8-channel pipette.\nPlace the culture plate in a humidified multi-gas incubator (Astec) at 37°C under 1% O2 and 5% CO2 conditions. Troubleshooting 2[href=https://www.wicell.org#troubleshooting].\nEvaluation of NHEJ-based genome editing efficiency\nTiming: 2 days\nThese steps describe how to evaluate the NHEJ-based genome editing efficiency.\nExtract genomic DNA from genome-edited cells 2–3 days after electroporation.",
    "Harvest edited cells from the culture well and centrifuge at 340 × g for 5 min at 4°C. Discard the supernatant. For DNA extraction, we usually prepare at least 10,000 cultured cells following gene editing.\nResuspend pellet in 100 μL of QuickExtract DNA Extraction Solution (Epicentre).\nKeep the tube at 65°C for 5–10 min and then at 98°C for 5–10 min.\nCool the tube at 25°C.\nPerform PCR using Q5 High-Fidelity DNA Polymerase (New England BioLabs), UBC-GFP Forward primer (GTTCACCTTGATGCCGTTCT), and UBC-GFP Reverse primer (CACCCGTTCTGTTGGCTTAT).\nCritical: Primer design is critical for performing TIDE analysis. Forward and reverse primers should be located at least 150–200 bp away from the expected cleavage site. For this, we usually design PCR primers to produce a 500–800 bp amplicon. Nested PCR is recommended to exclude PCR amplicons derived from non-target genomic regions (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2742-Fig3.jpg\nFigure 3. Primer design for evaluating genome editing efficiency\n(A) Design of sequence primer sets for sgRNA targeting of the UBC-GFP locus.\n(B) Representative Sanger sequencing results of non-edited and GFP-edited cells.\n(C) Results of a TIDE assay.\n(D) Results of ICE analysis.\n(E) Genome editing efficiency based on ICE positively correlated with GFP expression levels. The donor-derived peripheral blood cells from individual recipient mice in two independent transplant experiments were used for ICE analysis (mean ± SD, n = 10).\n(F) The ratio of genome editing efficiency at the transplant to genome editing efficiency at four months after transplant. The same data set is used as in Figure 2[href=https://www.wicell.org#fig2]E (mean ± SD, n = 10).\ntable:files/protocols_protocol_2742_9.csv\ntable:files/protocols_protocol_2742_10.csv\nPerform electrophoresis using the PCR products to check whether the PCR products are of the expected size.\nPurify PCR products using Wizard SV Gels and the PCR Clean-Up System (Promega) following the manufacturer’s instructions.",
    "Perform Sanger sequencing of each purified PCR product obtained from non-edited (control) and edited cells. Use a reverse primer as the sequencing primer.\nPerform TIDE analysis (https://tide.nki.nl[href=https://tide.nki.nl]) using both non-edited and edited Sanger sequence ab1 files (Figure 3[href=https://www.wicell.org#fig3]).4[href=https://www.wicell.org#bib4] Troubleshooting 3[href=https://www.wicell.org#troubleshooting] and 4[href=https://www.wicell.org#troubleshooting].\nCritical: To check genomic analysis, western blotting or quantitative PCR of target genes are required to confirm the optimal gene knock-out.\nAlternatives: For surface marker genes (e.g., CD45) or reporter genes (e.g., GFP), the knock-out levels can be easily evaluated using flow cytometry.\nAlternatives: You can also use ICE (https://ice.synthego.com[href=https://ice.synthego.com]) to calculate the editing efficiency.5[href=https://www.wicell.org#bib5] A representative ICE result is shown in Figure 3[href=https://www.wicell.org#fig3].\nBone marrow transplantation using genome-edited HSCs\nTiming: 5–6 h\nThese steps describe the procedure of bone marrow transplantation.\nThe protocol below describes transplantation after long-term ex vivo proliferative and quiescence-maintaining cultures. The following groups should be prepared as controls; fresh HSCs, mock-electroporated HSCs, and cultured HSCs without genome editing. More edited HSCs should be prepared than transplanted HSCs to evaluate the editing efficiency at transplantation.\nHarvest some HSCs that were electroporated together with HSCs for transplantation to evaluate editing efficiency at the transplant 3 days after electroporation. See “evaluation of NHEJ-based genome editing efficiency[href=https://www.wicell.org#sec2.6]”.\nNote: Editing efficiency at transplantation is critical for confirming that transplanted cells were efficiently edited as well as for precisely interpreting post-transplant chimerism. For this purpose, donor-derived genome-edited HSCs are prepared for the number of recipient mice plus one or two.\nOn the day before transplantation, lethally irradiate C57BL/6-Ly5.1 congenic recipient mice (8.5 Gy using an MBR-1520R instrument from Hitachi Power Solutions, 125 kV, 10 mA, 0.5 mm Al filter, and 0.2 mm Cu filter).\nPrepare competitor cells from CD45.1 congenic mice as a step of “ mouse bone marrow collection”.",
    "Count the number of competitor bone marrow mononuclear cells (BMMNC) after filtration.\nHarvest genome-edited HSCs.\nNote: Because HSCs may attach to the culture well in the long-term culture (> 7 days), complete harvest of edited HSCs from the culture well is important.\nAlternative: You can also perform transplantation on the day of genome editing. We prepare 500 genome-edited HSCs and 5.0×105 competitor cells for one recipient. Genome-edited HSCs 2–3 h after the proliferative condition (50–100 ng/mL of SCF and TPO) to promote cell recovery from electroporation.\nCentrifuge at 340 × g for 5 min at 4°C. Discard the supernatant.\nPrepare the cell mixture for one recipient by mixing 1000 genome-edited HSCs (equivalent number after the electroporation) and 5.0×105 competitor cells in 200 μL of PBS + 2% FCS.\nRetro-orbitally transplant cells.\nAnesthesia with sevoflurane.\nPipetting the cell mixture again.\nAspirate 200 μL of cell mixture into an insulin needle-syringe.\nInsert the needle at an angle of approximately 30° into the medical canthus. Be careful not to damage the cornea.\nSlowly and smoothly inject the cell mixture.\nSlowly and smoothly withdrawn the needle.\nCheck the full recovery of transplanted mice from anesthesia.\nAnalysis of donor-derived genome-edited chimerism in peripheral blood\nTiming: 3–4 h, depending on the number of transplanted mice\nThese steps describe how to analyze the donor-derived and genome-edited chimerism.\nCollect the peripheral blood at 1, 2, 3, and 4 months after transplantation. Before collecting the peripheral blood, anesthetize the mice by sevoflurane inhalation.\nCollect 40–80 μL of peripheral blood from the retro-orbital sinus using heparinized glass capillary tubes and suspend the sample in 1 mL of PBS + heparin (1 U/mL) in 1.5 mL tubes.",
    "Centrifuge the blood suspension at 340 × g for 3 min at 4°C. Discard the supernatant and resuspend the pellet in 1 mL of PBS + 1.2% w/v dextran (200 kDa) for 45 min at25°C.\nAlternatives: To remove red blood cells, you can use perform two red blood cell lysis as a time saving method.\nTransfer the supernatant to another 1.5 mL tube and centrifuge at 340 × g for 3 min.\nFor red blood cell lysis, resuspend the cells in 0.17 M NH4Cl for 5–10 min.\nCentrifuge the cell suspension at 340 × g for 3 min at 4°C. Resuspend the cells in 50 μL of staining buffer containing 0.3 μL of anti-mouse Fc-block. Incubate the sample at 4°C for 5 min.\nMake the following antibody premixture for surface marker staining: CD45.1-PE, CD45.2-BV421, CD4-PerCP-Cy5.5, CD8-PerCP-Cy5.5, B220-APC, Gr-1-PE-Cy7, and Mac-1-PE-Cy7. Use 0.3 μL of each antibody per sample.\nAdd the premixed antibodies and incubate the cells at 4°C for 15 min.\nWash once with 1 mL of PBS + 2% FCS and centrifuge at 340 × g for 5 min at 4°C.\nResuspend cells in 200 μL of PBS + 2% FCS + 0.1% propidium iodide and and transfer to a 5 mL tube.\nSet up the flow cytometer (FACS Aria IIIu).\nRecord data of donor-derived chimerism and sort donor-derived (Ly5.2+) cells.\nExtract DNA from donor-derived cells and perform TIDE analysis. See the section “evaluation of NHEJ-based genome editing efficiency[href=https://www.wicell.org#sec2.6]”.\nNote: Theoretically, the average editing efficiency from each recipient mouse is not changed compared to the editing efficiency at the transplant if the target genes are not functional (e.g., EGFP) (Figure 3[href=https://www.wicell.org#fig3]). The decrease in donor-derived genome-edited chimerism compared to the control group suggests that target genes are functional for HSC function.",
    "Export the data in FCS format for analysis using software such as FlowJo.\nCalculate the donor-derived genome-edited chimerism of each recipient mouse using the following formula:\nD\no\nn\no\nr\n−\nd\ne\nr\ni\nv\ne\nd\nc\nh\ni\nm\ne\nr\ni\ns\nm\n:\n100\nx\nd\no\nn\no\nr\n−\nd\ne\nr\ni\nv\ne\nd\n(\nL\ny\n5.2\n+\nL\ny\n5.1\n−\n)\nc\ne\nl\nl\ns\n(\n%\n)\n/\n(\nd\no\nn\no\nr\n−\nd\ne\nr\ni\nv\ne\nd\nc\ne\nl\nl\ns\n(\n%\n)\n+\nc\no\nm\np\ne\nt\ni\nt\no\nr\n−\no\nr\nr\ne\nc\ni\np\ni\ne\nn\nt\n−\nd\ne\nr\ni\nv\ne\nd\n(\nL\ny\n5.2\n−\nL\ny\n5.1\n+\n)\nc\ne\nl\nl\ns\n(\n%\n)\n)\nD\no\nn\no\nr\n−\nd\ne\nr\ni\nv\ne\nd\ng\ne\nn\no\nm\ne\n−\ne\nd\ni\nt\ne\nd\nc\nh\ni\nm\ne\nr\ni\ns\nm\n:\n100\nx\nD\no\nn\no\nr\n−\nd\ne\nr\ni\nv\ne\nd\nc\nh\ni\nm\ne\nr\ni\ns\nm\n(\n%\n)\nx\nG\ne\nn\no\nm\ne\ne\nd\ni\nt\ni\nn\ng\ne\nf\nf\ni\nc\ni\ne\nn\nc\ny\nNote: Genome editing efficiency is evaluated by one of the following: TIDE, ICE, and FACS-based protein expression levels (e.g., GFP). We confirmed that GFP expression levels can reflect the genome editing efficiency, suggesting that we can use the frequency of GFP-negative cells as the editing efficiency (Figure 3[href=https://www.wicell.org#fig3])."
  ],
  "subjectAreas": [
    "Stem Cells",
    "Crispr"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}