{
  "id": 3714,
  "origin_website": "Cell",
  "title": "Expression, purification, and characterization of a membrane-associated cyclic oligo-adenylate degrader from Sulfolobus islandicus",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nConstruction of the expression plasmid (pSiRe_0244)\nTiming: 3 days\nThis step is to construct the plasmid that expresses a target gene in S. islandicus based on shuttle vector pSeSD (Peng et al., 2012[href=https://www.wicell.org#bib7]). The vector contains an engineered arabinose promoter (Para) to drive the transcription of the target gene and sequences encoding two 6xHis tags, allowing either C-terminal or N-terminal His tag as desired (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/433-Fig1.jpg\nFigure 1. Sequences features of the arabinose promoter (Para) and multiple cloning sites (MCS) region of pSeSD\nThe sequences encoding the two 6xHis tags are indicated. SD, Shine-Dalgarno sequence.\nAmplify the gene encoding the membrane-associated DHH-DHHA1 family protein (SiRe_0244) by PCR with the genomic DNA of S. islandicus as template using Phanta Max Super-Fidelity DNA Polymerase (Vazyme, China) in T100 Thermo cycler (Bio-Rad, USA). The PCR reaction mixture and cycles are set up as below:\ntable:files/protocols_protocol_433_8.csv\ntable:files/protocols_protocol_433_9.csv\nPurify the PCR product with HiPure PCR Pure Mini Kit (Magen, China) following the manufacturer instruction. Digest the PCR product and the vector pSeSD with NdeI and SalI (Thermo Scientific, USA) in the following reaction mixture at 37°C for 2 h.\ntable:files/protocols_protocol_433_10.csv\nPurify the digested DNA fragments with HiPure PCR Pure Mini Kit and ligate them using T4 DNA Ligase (Thermo Scientific, USA) in the following reaction mixture at 22°C for 2 h.\ntable:files/protocols_protocol_433_11.csv\nTransform the ligated plasmid into E. coli DH5α cells using classical heat shock transformation procedure. Plate the cells onto LB-agar plates containing 100 μg/mL ampicillin.\nColony PCR verification.",
    "Pipette up a colony using a 1 mL tip and scatter the colony in 50 μL H2O by pipetting up and down. Use 1 μL of the cell suspension as template for PCR amplification with 2XTaq Master Mix (Vazyme, China) as below. Transfer the residual cell suspension into 1 mL LB medium containing 100 μg/mL ampicillin and culture the cells at 37°C for 6 h with shaking. Usually, 8 colonies are selected for PCR verification.\ntable:files/protocols_protocol_433_12.csv\ntable:files/protocols_protocol_433_13.csv\nRun agarose gel electrophoresis to analyze the PCR products. The expected size of the PCR product is ~1.1 kb.\nTransfer 0.5 mL of a validated cell suspension into a new EP tube and send the sample for Sanger sequencing (Tsingke, China). Transfer the left cell suspension into 5 mL LB medium containing 100 μg/mL ampicillin and grow the cells at 37°C for 16 h with shaking. Extract the plasmid, i.e., pSeSD-SiRe_0244, with HiPure Plasmid Micro Kit (Magen, China). The plasmid concentration is usually 300–500 ng/μL.\nNote: If the plasmid yield or quality is low, ethanol precipitation is recommended to concentrate and desalt the plasmid prior to being used in electroporation.\nElectroporation of the expression plasmid and validation of transformants\nTiming: ~2 weeks\nThaw a tube of competent cells and mix them with ~500 ng of pSeSD-SiRe_0244. Transfer the mixture into an 1 mm electroporation cuvette. Place the cuvette in the cuvetter chamber of Gene Pulser Xcell Electroporation System (Bio-Rad, USA) and apply electrical pulse at 1.2 kV, 25 μF, 600 Ω.\nNote: The pulse time should be ~13 ms. A short pulse time may indicate high electric conductivity in the mixture and lead to failed transformation.",
    "Resuspend the cells with 1 mL of pre-warmed incubation medium immediately after electrical pulse, and transfer the cell suspension into an EP tube. Incubate the cells at 75°C for ~1 h without shaking.\nPre-warm the solutions required for plating in 15 mL tubes, including 4 mL of 0.4% gelrite and 4 mL of 2× SCV for each plate. Pipette 1 μL and 10 μL of the cell suspension into tubes containing 2× SCV respectively. Pour 4 mL of 0.4% gelrite into each tube, mix them quickly, and pour the mixture onto a SCV plate.\nNote: If the expressed gene is not toxic for Sulfolobus, 1 μL of the cell suspension should generate enough colonies. However, plating of different volumes of the cell suspension is still recommended.\nNote: Simultaneously, electroporation of competent cells without any vector and empty vector (pSeSD) should be performed as controls.\nPlace the plates in a plastic box which should then be placed in a 75°C incubator. Maintain moisture inside the box to prevent the plates from drying.\nNote: We usually grow Sulfolobus cells on plates at 75°C to prevent plates from melting.\nAfter seven days, check the plates. (See Troubleshooting[href=https://www.wicell.org#troubleshooting] Problem 2[href=https://www.wicell.org#sec6.3] and 3[href=https://www.wicell.org#sec6.5]). If there are colonies like in Figure 2[href=https://www.wicell.org#fig2]A. Transfer 6–8 colonies onto new plates by the following procedure:\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/433-Fig2.jpg\nFigure 2. Representative results derived from electroporation and validation of the transformants\n(A) Examples of the plates on the 7th day after electroporation. pSeSD-SiRe_0244, pSeSD and H2O have been transformed into S. islandicus E233S1. The volumes of the cell suspensions used for plating are indicated above the image.\n(B) A representative plate on to which three colonies from (A) have been transferred.",
    "(C) A gel image of culture PCR to verify the strain containing pSeSD-SiRe_0244. The expected size of the PCR product is 1,091 bp. −, negative control with H2O as template; +, positive control with pSeSD-SiRe_0244 plasmid as template; 1–8, 8 transformants derived from (A).\nTransfer about 30 μL H2O in an EP tube. Pipette up a colony from the plate using a 1 mL tip and scatter the colony in the 30 μL H2O by pipetting up and down.\nTransfer the cell suspension onto a new SCV plate.\nAfter 3–5 days, the cells on the plate should form lawn as shown in Figure 2[href=https://www.wicell.org#fig2]B. Transfer each colony into 5 mL of SCV medium.\nAfter 2–3 days, verify the cultures using PCR by the following procedure:\nTransfer 300 μL culture into an EP tube. Centrifuge at 8,500 × g for 3 min to collect the cells.\nResuspend the cells with 500 μL H2O (the volume of H2O may vary depending on the amount of cells) and heat the cell suspension at 95°C for 10 min.\nCool the cell solution on ice and use 1 μL as template for PCR analysis. The PCR reaction mixture and cycle conditions should be the same as step 5.\nRun agarose gel electrophoresis to analyze the PCR products (Figure 2[href=https://www.wicell.org#fig2]C).\nPrepare cell mass for protein purification\nTiming: ~10 days\nTransfer a verified culture into 30 mL STV medium. After 1 or 2 days, at an OD600 of about 0.6–0.8, inoculate the strain into 100 mL STV medium (10 mL into 100 mL). After 1 or 2 days when the OD600 is about 0.6–0.8, transfer the 100 mL culture into 1 L STV medium.",
    "Note: Tryptone is richer than CAA and contains a trace amounts of uracil. Therefore, tryptone is not recommended for growth of transformants obtained through electroporation.\nAfter 1 or 2 days when the OD600 is about 0.6–0.8, transfer the 1 L culture into 8 L ATV medium containing 0.2% D-arabinose instead of sucrose.\nCollect cells from 8 L culture by centrifugation at 8,500 × g for 10 min, resuspend them with 100 mL of BufferA, and store the cell suspension at −80°C.\nPurification of SiRe_0244\nTiming: 2 days\nThis step is to purify His-tagged SiRe_0244 from the cell mass of step 16. The purification procedure includes two main steps: nickel affinity chromatography and size exclusion chromatography (SEC). Before that, the detergent n-Dodecyl-β-D-Maltopyranoside (DDM) is used to treat cell lysate to extract SiRe_0244 from the cell membrane.\nThaw the frozen cells in warm water and disrupt the cells by JN-02C French press (JNBIO, China) with the pressure of 1,200 bar.\nSupplement DDM into the cell lysate at a final concentration of 0.1% and incubate the lysate at 4°C for 16 h with gentle shaking.\nCentrifuge at 18,000 × g for 20 min at 4°C to remove undisrupted cells or cell debris.\nDuring the 20 min, wash Peristaltic Pump P-1 (Cytiva, USA) with 10 mL of 20% ethanol followed by 10 mL filtered water and connect HisTrap HP column (Cytiva, USA) with the pump as shown in Figure 3[href=https://www.wicell.org#fig3]. Wash the column with 10 mL filtered water and equilibrate the column with 20 mL BufferA1.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/433-Fig3.jpg\nFigure 3. How to connect the HisTrap column to Peristaltic Pump P-1\nFiltered water, BufferA1 or cell lysate can be poured into the beaker, then driven by the pump to flow through the column and finally collected by the tube.",
    "Note: Cytiva was previously a part of GE Healthcare Life Sciences.\nFilter the cleared lysate with 0.22 μm syringe filter and load the lysate onto the column at a speed of about 1 mL/min using Peristaltic Pump P-1. This step takes about 2 h.\nDuring the 2 h, equilibrate Superdex 200 Increase 10/300 GL column (Cytiva, USA) with BufferC1 using ÄKTA Pure 25 L Chromatography System (Cytiva, USA), and re-equilibrate the ÄKTA system with BufferA1.\nTurn on the ÄKTA system and open the UNICON software. Go to “Manual>Execute Manual Instructions” in the system control window, and use the “Manual instructions” dialog to wash both pumps (A and B) and the system with filtered water.\nConnect the Superdex 200 column with the ÄKTA system. Equilibrate the column with filtered water and then BufferC1 at the speed of about 0.5 mL/min until the values of UV, pressure, and conductivity are stable.\nRemove the Superdex 200 column from the ÄKTA system and wash pumpA and pumpB with BufferA1 and BufferB1 respectively.\nEquilibrate the ÄKTA system with BufferA1.\nNote: Operation of the ÄKTA system and the UNICON software should follow the manual instruction of the manufacturer.\nNote: Make sure that the end of buffer lines are in the right buffers and covered by the buffers at all time.",
    "After loading the lysate onto the HisTrap column, remove the column from Peristaltic Pump P-1 and connect it with the ÄKTA system. Wash the column with 100% BufferA1 (20 mM imidazole) for 50 mL, followed by 91% BufferA1 and 9% BufferB1 (63.2 mM imidazole) for 30 mL. Elute the bound proteins with 20 mL of 41% BufferA1 and 59% Buffer B1 (~300 mM imidazole), and wash the column with 5 mL of 100% BufferB1. Collect the fractions corresponding to the main peak and concentrate them to ~0.5 mL. The profile of the chromatography is shown in Figure 4[href=https://www.wicell.org#fig4].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/433-Fig4.jpg\nFigure 4. Nickel affinity chromatography profile\nThe HisTrap column is washed with 0%, 9%, 59%, and 100% BufferB1 successively. The fractions eluted by 51% BufferB1 (indicated by the red box) are collected for next step of purification.\nNote: To accomplish the purification procedure within one day, the fractions of the HisTrap chromatography are not analyzed by SDS-PAGE. However, it is recommended to save aliquots of the fractions for SDS-PAGE on the next day.\nCentrifuge the concentrated sample at 18,000 × g for 20 min at 4°C to remove protein aggregates.\nMeanwhile, remove the HisTrap column from the ÄKTA system, equilibrate the ÄKTA system with BufferC1 again, wash the injection loop with filtered water and then BufferC1, and connect the Superdex 200 column with the ÄKTA system.\nLoad the concentrated proteins into the injection loop with a 1 mL syringe, set the methods as shown in Figure 5[href=https://www.wicell.org#fig5]A and start running. The profile of the SEC is shown in Figure 5[href=https://www.wicell.org#fig5]B. (See Troubleshooting[href=https://www.wicell.org#troubleshooting] Problem 4[href=https://www.wicell.org#sec6.7] and 5[href=https://www.wicell.org#sec6.9])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/433-Fig5.jpg\nFigure 5. Methods and results of size exclusive chromatography (SEC)",
    "(A) An image of the “Manual instructions” dialog, showing the settings for SEC: flow rate, 0.5 mL/min; injection valve, inject; alarm pre-column pressure, 2.20 MPa; fraction volume, 1 mL; auto zero UV.\n(B) SEC profile.\nAfter running the methods, wash the columns with filtered water and fill them with 20% ethanol.\nNote: It is recommended to clean the HisTrap column following the instructions of the manufacturer if the column is clogged or discolored. In brief, the column is successively washed by 10 mL of stripping buffer (20 mM sodium phosphate, 0.5 M NaCl, 50 mM EDTA, pH 7.4) to strip off Ni2+ ions, 10 mL of distilled water, 10 mL of 1.5 M NaCl to remove ionically bound proteins, 10 mL of BufferA1, 10 mL of distilled water, 60 mL of 1 M NaOH to remove precipitated protein, 10 mL of BufferA1, 10 mL of distilled water, 60 mL of 0.5% Triton X-100 in 0.1 M acetic acid to remove lipids and lipoproteins and 10 mL of distilled water. Then, the column is recharged with 1 mL of 0.1 M NiSO4, washed by 10 mL of distilled water and filled with 20% ethanol. The washing is performed by the Peristaltic Pump P-1 at a flow rate of 1 mL/min.\nSDS-PAGE analysis of purified SiRe_0244\nTiming: ~6 h\nCast SDS-PAGE gels using Mini-PROTEAN Tetra Handcast System (Bio-Rad, USA). The components of resolving gel and stacking gel are shown in the table below.\ntable:files/protocols_protocol_433_14.csv\nCritical: Acrylamide is toxic. This step should be performed in a fume hood with standard laboratory nitrile gloves and lab coats.\nMix 20 μL of each fraction with 5 μL of 5× SDS-loading dye. Heat the mixture at 95°C for 5 min.",
    "Set up the Mini-PROTEAN Tetra Vertical Electrophoresis Cell (Bio-Rad, USA) for running the gel. Fill the tank with SDS-PAGE running buffer, load the samples into the wells and start running.\nStop running when the blue dye almost reaches the bottom of the gel. Carefully separate the gel from the glass plates and place it on a plastic plate. Stain the gel with gel staining solution for ~2 h at 22°C.\nDestain the gel with gel destaining solution. Change destaining solution several times until the bands in the gel are visible (Figure 6[href=https://www.wicell.org#fig6]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/433-Fig6.jpg\nFigure 6. Analysis of the fractions from SEC\n(A) SDS-PAGE analysis. The expected size of His-tagged SiRe_0244 is 38.7 kDa, corresponding to the band indicated the red arrow.\n(B) cOA degradation activity.\nThe volume of each fraction is indicated above the gels. 7.1, 7.1–8.0 mL.\nActivity assay of SiRe_0244\nTiming: 2 days\nPrepare a denaturing polyacrylamide gel.\nMix 1.5 mL of 10× TBE, 18 mL of 30% acrylamide and 12.6 g urea in a 50 mL tube. Invert the tube several times and place it in a 37°C incubator to accelerate dissolution of urea.\nSet up two glasses to gain the space for the gel using BG-verMIDI vertical electrophoresis system (Baijing, China).\nAfter urea is dissolved, add 150 μL APS and 10 μL TEMED into the mixture, mix them quickly, and pour the mixture into the space between the two glasses. Insert comb immediately.\nAfter the acrylamide is polymerized, remove the comb and wash the wells with 0.5× TBE, pre-run the gel in a PAGE tank at a voltage of 200 V for 30 min.",
    "Mix the reaction components as shown in the table below and divide it into 12 aliquots. Add 1 μL of each fraction from gel filtration chromatography into the aliquots and BufferC1 into the first one as control.\ntable:files/protocols_protocol_433_15.csv\nIncubate the reactions at 70°C for 4 min. Chill the tubes on ice immediately and add 10 μL of 2× RNA loading dye.\nHeat the samples at 95°C for 5 min and chill them on ice for 2 min immediately. Centrifuge for several seconds to collect the liquid at the bottom of the tube.\nNote: Step 34–36 can be accomplished during the time of gel polymerization and prerunning.\nWash the wells with 0.5× TBE again and load the samples into the well. Run the gel at a voltage of 300 V.\nWhen the bromophenol band reaches the middle of the gel, Stop running, remove the small glass from the gel, and adhere the gel to an equal-size filter paper. Cover the gel with cling film, place the gel in a cassette and cover the gel with Storage Phosphor Screen BAS-IP MS 2025 E (Cytiva, USA). Place the cassette in a freezer for 16 h.\nScan the screen with Fujifilm FLA-5100 (FUJIFILM Life Science, Japan) to obtain the image (Figure 6[href=https://www.wicell.org#fig6]B).\nQuantification analysis of the cOA cleavage assay by ImageJ\nTiming: ~1 h\nOpen the image from step 39 by ImageJ with the Fiji plugin (https://imagej.nih.gov[href=https://imagej.nih.gov]) and convert it to grayscale and 8-bit depth.\nDraw a rectangle that exactly includes all the species in the first lane and go to “Analyze>Gels>Select First Lane” to set up the first rectangle.\nMove the rectangle to next lane and go to “Analyze>Gels>Select Next Lane” until all lanes are included (Figure 7[href=https://www.wicell.org#fig7]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/433-Fig7.jpg\nFigure 7. Quantification of the cOA degradation activity with ImageJ",
    "(A) Determination of the area for quantification using the Rectangle tool. All the lanes have been included.\n(B) Examples of the quantification profiles of the 1st lane (control) and 8th lane (the 13-mL fraction). The three peaks, which are separated by four short lines, represent cOA, degradation product and ATP respectively.\n(C) Quantification data in an Excel spreadsheet. The percentage of product, i.e., [product]/([cOA]+[product]), has been calculated.\n(D) Histogram chart of the data from (C).\nLane 1, control; lanes 2–12, fractions from 7.1 mL to 17.1 mL.\nGo to “Analyze>Gels>Plot Lanes,” which generates a new window with a profile plot of each lane (Figure 7[href=https://www.wicell.org#fig7]B).\nChoose the Straight Line selection tool and draw short lines at both sides of a peak manually to enclose the area below it. The area represents the amount of each species of the lane (Figure 7[href=https://www.wicell.org#fig7]B). (If the peak appears to float above the baseline of the profile plot, draw a line at the bottom of the peak to remove background).\nChoose the Wand tracing tool. Click enclosed areas to measure peaks.\nCopy the results to an Excel spreadsheet. Calculate [product]/([cOA] + [product]) in each lane to evaluate the activity of SiRe_0244 from each fraction of the size exclusion chromatography (Figure 7[href=https://www.wicell.org#fig7]C). The data can be displayed in histogram chart (Figure 7[href=https://www.wicell.org#fig7]D) or in other forms as desired."
  ],
  "subjectAreas": [
    "Cell Membrane",
    "Crispr",
    "Microbiology",
    "Protein Expression And Purification",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}