{
  "id": 8456,
  "origin_website": "Jove",
  "title": "Flow Cytometry Approach to Characterize Phagocytic Properties of Acutely-Isolated Adult Microglia and Brain Macrophages In Vitro",
  "procedures": [
    "All mouse studies were conducted after obtaining approval from the Emory University’s Institutional Animal Care and Use Committee (IACUC), and in strict accordance with the Guide for the Care and Use of Laboratory Animals of the National Institutes of Health.\n1. Preparation on the day of isolation\nPrepare an ice bucket to keep all reagents, buffers, and cell suspensions cold throughout the isolation procedure.\nPlace the bottle of 1× phosphate-buffered saline (PBS) (at least 1 L) at 4 °C for 30 min to 1 h prior to perfusion and keep 1× PBS on ice during the perfusion and isolation procedure.\nPrepare working concentration of the density gradient medium (referred to as 35% SIP, see Table of Materials).\nLabel all the conical and flow cytometry tubes used in the experiment prior to cell isolation to avoid delays in processing times. Additionally, gather all other supplies necessary for the isolation prior to perfusion, such as 40 µm cell strainers, syringes, and needles.\n2. Acute isolation of adult mouse microglia\nAnesthetize an adult mouse by placing the mouse in a glass induction chamber with isoflurane (5 mL) until the mouse stops breathing and fails to respond to hindlimb paw pinch.\nUse a 26 G needle and 10 mL syringe to perform cardiac perfusion with 30 mL of ice-cold 1× PBS until there is no visual blood.\nDecapitate the mouse with surgical scissors. Use small scissors to cut the skin, exposing the skull. Remove the skull without damaging the brain tissue as described24. Remove the brain immediately and transfer to a sterile 40 µm cell strainer placed on top of a 50 mL conical tube.",
    "Use the backside of the plunger of a 3 mL syringe to push the brain through the strainer and mechanically dissociate the entire brain tissue. Wash the cell strainer and plunger intermittently during the dissociation with 2 mL of ice-cold 1× PBS each time to ensure all the tissue passes through the strainer.\nScrape the bottom of the cell strainer with the plunger to collect any residual suspension into the conical. Thoroughly flush the cell strainer with ice-cold 1× PBS and pour the suspension into the 50 mL conical tube.\n\tNOTE: When processing multiple animals in series, place the cell suspensions on ice until further processing.\nAdd ice-cold 1× PBS to bring the cell-suspension volume to 30 mL and centrifuge at 800 × g for 5 min at 4 °C.\nPour off the supernatant without disturbing the pellet and re-suspend the pellet in 6 mL of 35% SIP with a 10 mL serological pipette. Transfer the cell suspension + 35% SIP mixture to a new 15 mL conical tube and centrifuge at 800 × g for 25 min at 15 °C with no brake.\n\tCAUTION: Take special care to avoid introduction of bubbles during re-suspension. Excessive bubbles can be detrimental to cell yield.\nCarefully remove the 15 mL conical tube from the centrifuge without disturbing the layers and aspirate the top floating myelin layer.\nTransfer the cell suspension + 35% SIP mixture using a 10 mL serological pipette to a new 50 mL conical tube containing 30 mL of ice-cold 1× PBS and centrifuge at 800 × g for 5 min at 4 °C. Carefully pour the supernatant off, leaving behind the cell pellet along with 500‒800 µL of 1× PBS.",
    "Re-suspend the cell pellet by gently pipetting up and down with a p1000 pipette and transfer to a 5 mL round bottom tube. Add 2 mL of ice-cold 1× PBS to the round bottom tube and centrifuge at 1,400 × g for 2 min at 4 °C. Quickly pour off the supernatant, leaving the cell pellet containing CNS-MPs in about 100 µL of 1× PBS (Figure 1).\n3. Phagocytosis set-up and flow cytometric staining\nTransfer 20 µL (≈200,000 cells) of the re-suspended CNS-MPs to a fresh 5 mL round bottom tube and add 80 µL of ice-cold 1× PBS. Do not add any fluorescent substrates or flow cytometry antibodies to this tube. These cells serve as a negative control to determine background fluorescence of CNS-MPs for flow cytometry analyses.\nTo establish the viability of the isolated CNS-MPs, use amine-based live/dead dyes (e.g., Fixable Blue UV).\n\t\nResuspend the rest of the cell pellet in 500 µL of 1× PBS and add 1 µL of the reconstituted dye to each sample tube except the negative control.\nGently vortex, cover the tubes with foil, and incubate them at room temperature for 30 min. Subsequently, add 1 mL of 1× PBS to each tube and gently vortex.\nCentrifuge the cells at 1,400 × g for 2 min at 4 °C. Quickly pour off the supernatant and re-suspend the cell pellet in 100 µL of 1× PBS.\n\t\tNOTE: Amine-based dyes will bind to the extracellular Aβ fibrils confounding the results of phagocytosis. Other live/dead indicators might interfere with the fluorescence of Aβ fibrils/microspheres. Hence it is advised to used Live/dead indicator only in preliminary experiments to establish the viability of the isolated CNS-MPs.",
    "Thoroughly vortex the tube containing PE-polystyrene microspheres and add 2 µL (≈200 microspheres/cell) to 100 µL of cell suspension in flow tubes except for the negative control. Gently vortex each tube to ensure equal distribution of the substrate with the cells and place the round bottom tubes in a sterile humidified incubator for 30 min at 37 °C with 5% CO2.\n\t\nGently vortex and incubate the negative control tube to ensure similar experimental conditions between positive and negative samples.\n\t\tNOTE: If using Aβ fibrils instead of PE-microspheres, prepare fluorescent HiLyte488 Aβ fibrils as described previously9. The final concentration of Aβ fibrils is 200 µM which is then diluted to prepare fresh 20 µM stock in PBS of fluorescent Aβ monomers. Add 12.5 µL of the 20 µM stock Aβ monomers to each tube containing isolated cells.\nRemove the cells from the incubator and add 1 mL of 1× PBS to each tube and gently vortex. Centrifuge the cells at 1,400 × g for 2 min at 4 °C and quickly pour off the supernatant. Repeat the wash with 1 mL 1× PBS, centrifuge at 1,400 × g for 2 min, pour off the supernatant, and re-suspend the cell pellet in 100 µL of 1× PBS.\n\tNOTE: After each spin, it is important to keep the cells on ice to inhibit ongoing phagocytic uptake.\nVortex the flow-cytometry antibodies and centrifuge them in a microcentrifuge for 10 s. To each cell suspension tube add 1 µL each of CD11b-APC/Cy7 and CD45-PE/Cy7 for Aβ phagocytosis assay, or CD45-FITC for PE-microsphere phagocytosis. Gently vortex each tube and incubate in the dark for 30 min at room temperature.",
    "NOTE: Users can also include a separate tube containing potent phagocytic cells such as cultured BV2 microglia or peritoneal macrophages as positive control and treat them with PE-microspheres, and flow cytometric antibodies as described above. Data from this sample can be used to define the positive control denoting true phagocytosis in preliminary experiments.\nWhile the cells are in incubation, set up compensation tubes using four round bottom 5 mL flow tubes. Thoroughly vortex the compensation beads and add 1 drop to each tube. Add 1 µL of CD11b-APC/Cy7 to the first tube and CD45-FITC to second the tube. Add 1 µL of PE-polystyrene to the third tube and keep unstained compensation beads in fourth tube. Use this fourth tube as a negative control to set up a compensation panel on the flow cytometer.\n\tNOTE: When Aβ fibrils are used to study phagocytosis, add CD45-PECy7 to second tube instead of CD45-FITC. Add 1 µL of separate FITC tagged flow cytometry antibody or FITC-secondary antibody (any species) to the third compensation tube. This is important since the beads cannot bind to Aβ fibrils and will get washed away upon washing of the compensation tubes.\nAllow the compensation beads to incubate with their respective antibodies for at least 10 min. After incubation, add 1 mL of 1× PBS to each tube, centrifuge at 1,400 x g for 2 min at 4 °C, and quickly pour off the supernatant. Place the compensation tubes on ice and cover them with the foil until flow cytometry.",
    "Following incubation with flow-cytometry antibodies, wash the stained cells with 1 mL of 1× PBS. Gently vortex and centrifuge the cells at 1,400 × g for 2 min at 4 °C. Quickly pour off the supernatant and repeat the wash with 1 mL 1× PBS. After centrifugation, pour off the supernatant and re-suspend the cell pellet in 100 µL of 1× PBS.\nPlace the sample tubes on ice and cover them with the aluminum foil until flow cytometry.\n\tNOTE: Use 1× PBS (pH 7.0) without Ca2+/Mg2+ as flow buffer throughout the experiment. Ensure to exclude fetal bovine serum (FBS) in the flow buffer to avoid possible microglial activation.\n4. Flow cytometry and analysis\nInstrument set-up and compensation\n\tNOTE: The experiments in this manuscript were performed on a flow cytometer with ultra-violet, violet, blue, yellow-green and red lasers. This experiment can be also adapted to three-laser flow-cytometers with blue, yellow-green and red lasers only. Users need to undergo formal training before handling the instrument.\n\t\nRefill the flow sheath buffer tank and turn on the cytometer. “Prime” the cytometer with a 5 mL round bottom flow tube containing ddH2O. Log into the analysis software on the computer connected to the flow-cytometer. Create an “experiment” and select FSC, SSC, FITC, PECy7 and APC-Cy7 as the parameters. If using PE-microspheres, select PE instead of PECy7 in the parameter panel.\nCreate an appropriate compensation panel.\n\t\tNOTE: In our experiments, typically the FSC/SSC voltages for compensation beads is around 350/280, whereas FSC/SSC voltages for CNS-MPs is around 320/260. These values can vary between any two different cytometers and need to be calibrated prior to the actual experiment.",
    "Reconstitute each compensation and cell suspension tube with 500 µL of 1× PBS, briefly vortex, and place on ice. Run the negative control/unstained bead tube to set appropriate voltages such that the peak on each fluorophore histogram is below 102. Run the other single-color compensation tubes to identify their distinct positive peaks.\n\t\tNOTE: There should be at least half log (base 10) difference between the positive and negative peaks of each fluorophore.\nRecord 5000 events from each compensation tube to allow the computer to auto-calculate the compensation set-up. Link the compensation set-up to the current experiment25.\nCreate a new “tube” under the sample tab. Gently vortex and run the negative control tube containing unstained CNS-MPs. Adjust the forward and side scatter voltages to capture the population of interest. Record the events and sub-gate on the live CNS-MPs as mentioned below.\nCapture and record events from all subsequent tubes as separate files keeping the parameters and voltages consistent. Gently vortex each tube before running them on the flow-cytometer.\nGating strategy and measurement of phagocytosis\nDraw an initial mononuclear gate to capture all CNS-MPs. These live mononuclear cells must be gated in the following graph to include only single cells, excluding couplets and triplets.\nProject the gated single, live CNS-MPs population on a subsequent graph displaying CD11b and CD45 fluorophores.\n\t\tNOTE: Brain resident microglia are typically CD11b+CD45intermediate, whereas infiltrating macrophages are CD11b+CD45high. Additional markers such as Ly6c may be included in the panel to further confidently separate inflammatory monocytes (Ly6chigh and CD45high) from microglia (Ly6clow CD45intermediate).\nApply appropriate gates to further study phagocytosis in respective populations as shown in Figure 2F.",
    "NOTE: Phagocytosis in CNS-MPs is measured as a function of their Hilyte488/Alexa488 (Aβ) or PE (microsphere) fluorescence uptake. Distinct positive peak on their respective histograms indicate that the CNS-MPs have phagocytosed the substrate. Quantity of material phagocytosed is directly proportional to the intensity of the fluorescence. Hence, presence of multiple peaks must be interpreted as higher phagocytosis. These can be subsequently confirmed by immunohistochemistry.\nAfter recording all the sample tubes on the flow-cytometer, export the data files in .fcs format for further analysis.\nStatistical data analysis\nUse any flow-cytometry analysis software along with spreadsheets and statistical analysis software for all data analyses.\nAdd the .fcs files to analysis software and double click on the first file. A graph displaying all the recorded\n\t\tevents will appear. Follow similar gating strategy as shown in Figure 2 to subsequently gate single, live mononuclear cells and study phagocytosis on specific population, for example CD11b+CD45intermediate microglial cells (Figure 2H).\n\t\tNOTE: Phagocytic index is assessed based on the proportion of cells internalizing fluorescent Aβ fibrils or ≥1 microsphere(s). As defined previously, low-level phagocytosis is uptake of at least 1 microsphere and high-level phagocytosis is >1 bead uptake8,9. Based on prior experiments, inhibition of actin-dependent processes by cytochalasin D completely inhibits >1 bead uptake and partly inhibits 1 bead uptake9 as well as completely inhibits Aβ uptake, confirming actin-dependent phagocytic uptake rather than passive binding to the cell surface. Immunocytochemistry also confirms that each sequential peak in the microsphere assay is representative of a unitary increase in the numbers of beads phagocytosed8,9.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}