{
  "id": 20032,
  "origin_website": "Wiley",
  "title": "Culture of Rat Primary Cortical Cells for Microelectrode Array (MEA) Recordings to Screen for Acute and Developmental Neurotoxicity",
  "procedures": [
    "Primary cortical cultures closely resemble the complexity and diversity of cell types in the in vivo brain. Over time, cortical cultures form networks that exhibit spontaneous electrical activity, which makes for a robust screening model for (developmental) neurotoxicity testing. Here, we describe the isolation and culture of rat primary cortical cells, a procedure that takes at least 1 week and requires careful planning (see Strategic Planning). 48-well MEA plates need to be pretreated (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0002]) and precoated with 0.1% polyethyleneimine (PEI, see Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0003]) before the cell isolation takes place. On the day of isolation, cortices from postnatal day 0 to 1 Wistar rat pups are dissected, and cortical cells are isolated and seeded in glutamate-supplemented dissection medium on the 0.1% PEI−precoated 48-well MEA plate. To culture cells on the microelectrode array, the cell suspension is seeded in a droplet immediately on the electrode array and cells are allowed to attach to the array for 2 hr before the remaining medium is added. On DIV 4, glutamate-supplemented dissection medium is replaced with culture medium without glutamate. Within the first week of culture, the neuronal network develops spontaneous neuronal activity, reaching a plateau at DIV 9-11, after which the activity gradually decreases (Dingemans et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-bib-0014]). For long-term maintenance, 50% of the medium is exchanged every 3–4 days after volume adjustment with sterile water. Rat primary cortical cultures can be maintained at least up to DIV 28 without loss of neuronal activity (also see Understanding Results, which shows the development of neuronal activity of a rat primary cortical culture under control conditions).",
    "In some countries, the preparation and use of primary cultures may be restricted to a Biological Safety Level 1 (BSL-1)–approved laboratory environment. Unless otherwise indicated, all experiments should be performed under sterile conditions in a laminar flow hood. All reagents and biologicals must be sterilized by autoclaving or filter sterilization (0.2 μm filter) prior to use in cell culture, and must be maintained under sterile conditions during the duration of the experiment. All culture incubations are performed in a humidified 37°C/5% CO2 incubator.\nMaterials\nPhosphate-buffered saline (PBS; ThermoScientific GibcoTM, cat. no. 10010-023)\nDissection medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-rec-0005])\nWistar rat pups on postnatal day 0 to 1 (Envigo, Horst, the Netherlands)\n0.4% trypan blue solution (Sigma-Aldrich, cat. no. T8154)\nCulture medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-rec-0004])\nPolystyrene box (30 × 25 × 10 cm; length × width × height) to contain ice\nPetri dishes (10 cm diameter)\nSterile dissection tools (scissor, microdissection scissor, curved forceps, forceps with fine tips, spatula, scalpel)\nWater bath at 37°C\n50-ml conical polypropylene centrifuge tubes\nEASYstrainerTM (100 µm cell strainer; Greiner bio-one, cat. no. 542 000)\nSyringe (10 ml)\nDissection microscope\nBiological safety hood\nSerological pipettes (5, 10, and 25 ml)\nTabletop centrifuge\nHemocytometer (Bürker-Türk counting chamber) and light microscope, or automatic cell counter\n6- or 8-channel electronic pipettor (Integra Bioscience, Voyager)\nSterile sample container (125 ml; VWR, cat. no. 216-1823)\nPretreated and 0.1% PEI precoated 48-well MEA plates (Axion BioSystems, cat. no. M768-KAP-48; for pretreatment and precoating, see Support Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0002] and 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0003], respectively)\nAdditional reagents and equipment for cell culture techniques including counting cells (see Current Protocols article: Phelan & May, 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-bib-0034])\nPreparing for dissection and cell isolation",
    "Primary cells are very vulnerable. It is, therefore, recommended to dissect the cortices and to isolate cells as quickly as possible to ensure good quality of the final primary culture. To reduce procedural time, this section describes several preparation steps (see Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0002]-C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0002]) that should be done before starting the dissection and cell isolation.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/8c49e480-7b8d-429e-9941-be9c85026449/cpz1158-fig-0002-m.jpg</p>\nFigure 2\nRepresentative images of the different steps in the dissection of rat cortices and cell isolation. Preparation of the dissection area (A), the dissection tools (B), and the isolation area (C) are shown. Further images show steps of cortex dissection performed on ice (D-H), including craniums in the petri dish containing PBS (D), handling the head, opening the cranium to remove the brain (E), and dissected brains with dorsal site up (F). The red dotted line (F) indicates where to cut to separate the cortices from the midbrain in G. Then, the cortices are removed by peeling using curved forceps (H). The red arrow in image I shows the partly removed meninges, which are removed using forceps with thin tips (J). After removing the meninges, cortices are collected in the petri dish containing 20 ml dissection medium (K) and cut in small pieces using the scalpel (L). In the biological safety hood, the cells are isolated by pushing them through the cell strainer (M). After centrifugation, the cell pellet is obtained by removing the supernatant (N). Finally, the cell pellet is resuspended, the cell density is adjusted, and the cells are seeded onto a 0.1% PEI precoated 48-well MEA plate (O).\nPrepare the dissection area (Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0002])\n1. Fill the polystyrene box with ice.",
    "2. Add 30 ml of 4°C cold PBS to one 10-cm petri dish, and 20 and 30 ml of dissection medium to two other 10-cm petri dishes, respectively. Keep the petri dishes on ice in the polystyrene box.\n3. Place the sterile dissection tools next to the polystyrene box (Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0002]).\n4. Prewarm the remaining dissection medium to 37°C in a water bath.\nFor a litter of 7-10 rat pups, on average, 50 ml of dissection medium is needed for cell isolation and for adjusting the cell suspension to the desired cell density.\nPrepare for cell isolation in the biological safety hood (Fig. 2C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0002])\n5. Put the 100-µm sterile cell strainer on a 50-ml centrifuge tube.\n6. Place a 10-ml syringe next to the centrifuge tube.\nDissection of rat cortices\nThe pups are sacrificed and the cortices are dissected from the cranium, under sterile conditions (Fig. 2D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0002]-L[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0002]). For large litters (more than 10 pups), we recommend splitting the litter and performing the cortex dissection, cell isolation, and cell counting in two separate runs. After the desired cell density of 2 × 106 cells/ml is achieved, the cell suspensions can be combined and used for seeding.\n7. Sacrifice the pups by holding them above the petri dish containing PBS (on ice; see step 2) and decapitating them using scissors in such a way that the cranium drops into the PBS (Fig. 2D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0002]).\nSacrifice all the pups before continuing with the following steps. Keep the petri dish containing the crania in PBS on ice while proceeding with the cortex dissection of the single crania. During the dissection (from decapitating the pups until the cortices pieces are transferred to the cell strainer in step 15), everything should be kept on ice. This is done to reduce enzymatic degradation of the tissue.",
    "8. Hold the nose portion of the head with forceps. Use the microdissection scissors to gently cut the skin along the midline advancing toward the nose, plus a lateral cut on each side. Afterwards, cut the skull in the same manner (Fig. 2E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0002]).\nTake care not to damage the brain with the tip of the scissors.\n9. Remove the brain using the spatula and transfer the brain to the petri dish containing 30 ml of dissection medium prepared in step 2 (Fig. 2F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0002]).\nRemove the brains from all the crania (steps 8-9) before continuing with dissecting the cortices.\n10. With the brain dorsal side up, separate the cortices from the midbrain by cutting the tissue in a medial to lateral fashion (Fig. 2G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0002]; the red dotted line in Fig. 2F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0002] indicates where to cut).\n11. Hold the brain with curved forceps (or stick forceps in the midbrain) and remove the cortex by peeling with curved forceps (Fig. 2H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0002]).\n12. Remove residual parts of the midbrain and hippocampus area from the cortices using curved forceps (Fig. 2I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0002]; the red arrow in Fig. 2I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0002] points to the meninges, which need to be removed in step 13).\n13. Remove any residual meninges from the cortices using forceps with thin tips. Use a dissection microscope to better visualize the meninges (Fig. 2J[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0002]). Collect the cortices from all brains in the petri dish containing 20 ml of dissection medium prepared in step 2 (Fig. 2K[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0002]).\nRepeat the dissection of the cortices (steps 10-13) successively for all brains.\n14. Cut the cortices into smaller pieces (∼2 mm each) using a scalpel (Fig. 2L[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0002]), and transfer the petri dish to the biological safety hood.\nIsolation of primary cells from rat cortices\nWork under sterile conditions in a biological safety hood when isolating the primary cortical cells.",
    "15. Transfer the cortex pieces from the petri dish to the cell strainer on top of the 50-ml sterile polypropylene centrifuge tube from step 5 using a 10-ml serological pipette.\nSuck up all cortex pieces into the serological pipette, but make sure to leave a small volume (1-2 ml) of medium (without cortex pieces) in the petri dish, as this will be used to rinse the cell strainer in step 18. Before pipetting the cortex pieces into the strainer, wait a few seconds until the cortex pieces sediment in the pipette. In this way, you only need to pipette a small part of the volume in the serological pipette to transfer most of the cortex pieces to the strainer, thereby preventing overflow of the strainer.\n16. Mince the cortices in the strainer with the plunger from a 10-ml syringe (Fig. 2M[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0002]).\nThe cells go through the strainer and are collected in the 50-ml centrifuge tube.\n17. Repeat steps 15-16 as often as necessary to mince all the cortex pieces.\n18. Rinse the strainer with the remaining medium from the petri dish (from step 15).\n19. Centrifuge the cell suspension for 5 min at 100 × g in a tabletop centrifuge at room temperature.\n20. Remove the supernatant carefully, without disrupting the cell pellet (Fig. 2N[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0002]).\n21. Add 1 ml of prewarmed (37°C) dissection medium per brain (0.5 ml per cortex) to the cell pellet, and resuspend the pellet.\n22. Measure and note the total volume of the cell suspension.",
    "23. Determine the number of viable cells per ml in the suspension by mixing 90 µl of 0.4% trypan blue and 10 µl of the cell suspension in a 0.5-ml microcentrifuge tube, and using either a hemocytometer chamber (see Current Protocols article: Phelan & May, 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-bib-0034]) and a light microscope, or an automatic cell counter to count the cells.\nIn our experience, the cell number in the suspension generally amounts to 8−12 × 106 cells/ml.\n24. Adjust the cell density of the remaining suspension to 2 × 106 cells/ml by adding prewarmed (37°C) dissection medium.\nIf cortex dissection and cell isolation are performed in several runs, store the cell suspension from the first run in the water bath at 37°C until the second run is completed. After adjusting the cell suspension to the desired cell density, the cells are ready to be seeded.\nSeeding and culturing of primary rat cortical cells on 48-well MEA plates\nWork under sterile conditions in a biological safety hood when seeding the primary cortical cells. Refer to Current Protocols article Phelan & May (2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-bib-0034]) for basic cell culture techniques.\n25. Gently but thoroughly resuspend the cell suspension to ensure equal cell distribution. To use the 6- or 8-channel electronic pipettor for seeding, transfer the cell suspension to a 125-ml sterile sample container.\n26. Seed the cells by adding a 50-µl drop of the cell suspension to the center of the bottom of each well of a PEI-coated 48-well MEA plate (Fig. 2O[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0002]; see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0002] for the coating procedure). In each well, the final number of cells will be approximately 1 × 105, which is the optimal cell density for MEA recordings.",
    "Gently swing the sample container containing the cell suspension while seeding, to prevent deposition of cells, as that would lead to unequal seeding densities in the wells. Further, avoid touching the bottom surface of the well with the pipette tip, as this could damage the electrode array.\n27. Keep the cells for 2 hr in a humidified incubator at 37°C with 5% CO2, to allow them to attach to the array surface. Then, add 450 µl of prewarmed (37°C) dissection medium to each well.\nWhen adding the medium, select a slow dispense speed (6- or 8-channel electronic pipettor), to prevent cells from detaching.\n28. Culture the cells until DIV 4 in a humidified incubator at 37°C with 5% CO2.\n29. On DIV 4, replace 450 µl of the dissection medium with culture medium (dissection medium without l-glutamate).\nHigh glutamate concentrations can be toxic to cells; the medium with glutamate is used only up to DIV 4 to prevent overgrowth of astrocytes, thereby maintaining a more stable ratio between non-proliferative neurons and astrocytes. To avoid damage to the cells and electrodes, we recommend replacing 450 µl instead of the entire volume (500 µl) because, in this way, touching the bottom of the well with the tip of the pipette can be avoided.\n30. Keep the cells in a humidified incubator at 37°C with 5% CO2 until the start of the MEA experiment on DIV 7 (for developmental/chronic exposure, Alternate Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0006]) or DIV 9-11 (for acute or subchronic exposure, Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0004] or Alternate Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0005], respectively).",
    "In this protocol, the user will pretreat and wash 48-well MEA plates, which are required steps before the first use or reuse of a 48-well MEA plate. In our experience, cell survival and neuronal activity are improved when MEA plates are incubated in protein-containing medium before first use. While MEA plates are designed for single use, it can be cost-effective to reuse them. Note, however, that reusing plates can result in leakage of medium and serious damage to the hardware. Also, reusing MEA plates can cause damage to the electrode array, resulting in a decreased signal-to-noise ratio. In practice, MEA plates can be reused up to four more times.\nAfter the pretreatment, or to reuse MEA plates, the plates need to undergo a specific washing procedure, described in the steps below. In the case of reuse, MEA plates are first rinsed several times with demineralized water to remove the test compound(s). Detached cells or their debris are removed by incubating the plate with 0.5% trypsin/EDTA and further rinsing with demineralized water. Plates are sterilized by rinsing and incubating with 70% ethanol, then drying the plates at 55°C overnight. Afterwards, the labeling is removed from the plate lids and the plates are ready to be reused.\nMaterials\nProtein-containing culture medium\n               \nAny type of medium containing proteins (e.g., fetal bovine serum, B27 Plus supplement, etc., is suitable; see step 1).\nSterile laboratory-grade demineralized water\n0.5% trypsin-EDTA (10×; ThermoScientific GibcoTM, cat. no. 15400-054)\n70% ethanol\n6- or 8-channel electronic pipettor (Integra Bioscience, Voyager)\nNew or used 48-well MEA plates (Axion BioSystems, cat. no. M768-KAP-48)\n55°C oven\nPretreatment of 48-well MEA plates before first use\n1. Under sterile conditions, add 300 µl of protein-containing culture medium to each well and incubate the plate for at least 24 hr.",
    "Any type of medium containing proteins (fetal bovine serum, B27 Plus supplement, etc.) is suitable for pretreating the MEA plates. In our laboratory, where experiments with rat primary cortical cells are frequently performed, we use the leftover dissection medium from the previous cell isolation procedure.\nWashing of 48-well MEA plates (after pretreatment or for reuse of MEA plates)\nAll washing steps should be performed under sterile conditions to avoid bacterial, fungal, or other contamination.\n2. Rinse each well of the 48-well MEA plate with 300 µl of demineralized water three times.\n3. Fill the whole 48-well MEA plate (wells and inter-well space) with demineralized water.\nTo avoid oxidation of the electrode contacts, place paper towels below or between the 48-well MEA plates. In our laboratory, the MEA plates are kept in this state until a sufficiently large batch (usually around 20) of 48-well MEA plates is available, to more efficiently perform the subsequent washing steps for the entire batch of plates. Plates filled with demineralized water can be stored for up to 2 weeks.\n4. Rinse the plates three times with 300 µl of demineralized water.\n5. Add 100 µl of 0.5% trypsin-EDTA (10×) to each well.\nFor new 48-well MEA plates, incubation with trypsin is not necessary, and steps 5-7 can be skipped.\n6. Incubate the plates overnight at 37°C, with 5% CO2 and 95% air atmosphere.\nThe incubation time can be extended if more suitable for the time schedule. If plates are stacked one over the other, add paper towels between the plates to avoid oxidation of the electrodes. Check the plates for leakage.\n7. Rinse the plates three times with 300 µl of demineralized water.\n8. Rinse the plates three times with 300 µl of 70% ethanol.",
    "9. Fill up the whole 48-well MEA plate (wells and inter-well space) with 70% ethanol.\n10. Incubate the plates overnight at room temperature in a fume hood.\nThe incubation time can be extended if more suitable for the time schedule. Place paper towels below and between the plates to avoid oxidation of the electrode contacts. Check the plates for leakage.\n11. Rinse the plates two times with 300 µl of 70% ethanol.\n12. Discard the 70% ethanol and put the plates upside down on paper towels.\n13. Dry the plates for at least 16 hr (overnight) at 55°C in an oven.\n14. Clean the lids of the 48-well MEA plates with 70% ethanol.\nNote the number of uses on the plates. Take care not to contaminate the plates while handling. Check the plates for oxidized contact pins.",
    "Primary cells require a protein matrix to attach to, which is why plastic culture plates need to be coated before seeding the cells. For MEA plates, a coating with a 0.1% PEI solution is used to ensure adequate adhesion of the cortical cultures to the electrode array. The MEA plates need to be coated at least 1 day prior to the generation of the primary culture (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0001]). MEA plates coated with 0.1% PEI can be stored for up to 2 weeks at room temperature. Use a biological safety hood for the coating procedure to avoid bacterial, fungal, or other contamination.\nMaterials\n0.1% polyethyleneimine solution (0.1% PEI; see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-rec-0007])\nSterile laboratory-grade water\n48-well MEA plate (Axion BioSystems, cat. no. M768-KAP-48), pretreated as in Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0002]\n6- or 8-channel electronic pipettor (Integra Bioscience, Voyager)\n1. Add a droplet of 0.1% PEI solution (50 μl/well) on the bottom of every well.\nMake sure that the 50-µl drop is in the cavity at the bottom surface covering the entire microelectrode array.\n2. Incubate the 48-well MEA plate for 1 hr at room temperature.\n3. Aspirate the 0.1% PEI solution and rinse each well four times with 300 μl of sterile laboratory-grade water.\n4. Air-dry the 0.1% PEI-coated 48-well MEA plate overnight at room temperature.\nKeep the plates covered with the lids. That way, the plates can be moved to a non-sterile storage location without risking bacterial, fungal, or other contamination.",
    "In this protocol, the user will perform MEA measurements during acute exposure of rat cortical cells seeded on MEA plates (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0001]) to a (set of) test compound(s). These acute exposure experiments can be used to investigate if short-term exposure to a test compound affects spontaneous neuronal activity. Acute exposure experiments will be performed on DIV 9-11, since at this developmental stage, the neuronal networks already exhibit a high degree of activity (Dingemans et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-bib-0014]), including (network) burst behavior (Brown et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-bib-0008]). Users will first perform a 30-min baseline MEA measurement, followed by another 35-min MEA measurement in which the exposure to the test compound(s) takes place. Since the cells will not be cultured further after acute exposure experiments, the exposure does not have to be performed under sterile conditions. To ensure the robustness and reproducibility of MEA data, we recommend having a sample size of at least 20 wells per condition, spread out over three MEA plates. At the end of this protocol, the user will have MEA data output (.RAW files), which can be further analyzed using Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0008]: MEA data processing.\nMaterials\n48-well MEA plate (Axion BioSystems, cat. no. M768-KAP-48) with rat cortical cells cultured until DIV 9-11 (from Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0001])\nStock concentrations of test compound(s) in solvent (see Strategic Planning)\nCulture medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-rec-0004])\nMaestro Middleman (Axion BioSystems)\nComputer\nAxion Integrated Studio (AxIS) software (Axion BioSystems; version 2.5.2)\nMEA settings and recording\n1. Turn on the computer and the Maestro Middleman, and start the AxIS software on the computer.\n2. In the Environment Control module, turn ‘heater control’ on and set the temperature to 37°C.\nThe Maestro has an integrated heating system and temperature controller, and will continue warming up until it reaches the set temperature.",
    "3. Select the type of plate that will be measured at ‘Active Plate’ (top left of the screen).\nIn our experiments, we use Classic MEA 48 (incl. AccuSpot), but different plate types (e.g., CytoView or Lumos 48-wells plates) can be selected on the MEA device using the same procedure.\n4. In the ‘Experiment Setup Properties’ panel, select the appropriate settings for the Maestro. Right-click Maestro to change the settings. In the pop-up screen (see Fig. 3A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0003]), sampling frequency should be at 12.5 kHz (this is fixed); set Analog Settings to ’Neural: Spikes,’ which has a sample gain of 1200× and a band-pass filter of 200-5000 Hz. Low-pass filter is disabled when using ‘Neural: Spikes’ in Analog Settings. Referencing should be set to ‘median’ to reduce noise common to the electrode groups and improve detection of low amplitude signals.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/7a292d41-7779-4bf3-a636-9f4449255b8f/cpz1158-fig-0003-m.jpg</p>\nFigure 3\nIllustration depicting the settings for (A) Maestro data collection, (B) spike detector, and (C) burst detector.\n5. To visually inspect the activity of each plate before and during each recording, add the data processors ‘Spike Detector’ (to enable visualization of spikes) and ’Burst Detector’ (to enable visualization of (network) bursts). The output of the spike and burst detector should not be saved.\nTo add these extra data processors, right-click Maestro and add a spike detector by clicking ’Add processing’ and selecting ‘Spike Detector.’ In the pop-up screen, use the method ‘Adaptive Threshold Crossing’ and change the settings as in Figure 3B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0003]. These settings will be explained in more detail in Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0008]. Next, right-click Spike Detector and add a burst detector by clicking ‘Add processing’ and selecting ‘Burst Detector.’ In the pop-up screen, select the desired method to analyze bursts and change the settings as in Figure 3C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0003].",
    "6. Select the folder in which you want to save the experiment by clicking ‘Browse’ in the Experiment Folder field and name the experiment at ‘Continuous Streams.’ Provide additional information in the experiment description section if needed.\n7. In the Scheduled Recording Setup module, set the desired recording time and desired recording start time. For a single recording, select ‘Execute: Once.’\n8. When the set temperature for the MEA Maestro has been reached, place the 48-well MEA plate containing the primary cortical cells from Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0001], step 30, in the device by lifting the Maestro handle, placing the MEA plate into the docking bay, and gently lowering the handle to engage it to the system. Start live play by clicking the play button in the AxIS software.\n9. Allow the plate to equilibrate for ∼5 min.\n10. Start a 30-min baseline recording by clicking ‘Start schedule’ in the Scheduled Recording Setup panel.\nWe recommend measuring for 30 min during baseline recording, for statistical reasons. By using a 30-min time window, a sufficiently large number of spikes and bursts can be measured to reliably calculate any changes in activity. Furthermore, MEA data is known to have oscillations in activity, and measuring activity for 30 min captures several of these oscillations, which precludes measuring only a single maximum (or minimum) of oscillatory activity by chance in a too-narrow time window, which could then be erroneously interpreted as an effect.\n11. During baseline recording, prepare exposure solutions of the test compound(s) in culture medium. Prewarm the exposure solutions to 37°C. It is advisable to test a maximum of five conditions per plate, since this allows for eight replicates per condition.",
    "DMSO is toxic to the cells, and users should prepare working dilutions of the stock concentrations that ensure that the concentration of the solvent does not exceed 0.1% (v/v) in the final exposure solution. For instance, a user should prepare a 1000× stock solution of a test chemical in 100% DMSO (Strategic Planning). The user will then prepare (in this step) a working dilution of 1:100 of the stock solution, in culture medium. This dilution would now have 1% (v/v) DMSO. As can be seen in step 13, we typically add 55.5 µl of that working dilution to each well (which already contains 500 µl, see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0001], step 29), effectively diluting the test chemical solution once again, 10×. As such, the final concentration of DMSO would be 0.1% (v/v).\nTest conditions can include a concentration range covering five concentrations of the same test compound, but can also be a single concentration of five different test compounds, or anything in between, as long as you have eight replicates per condition. In our laboratory, we test one compound per plate. Notably, for prioritization of large numbers of chemicals for further testing, some researchers use four replicates per condition, although this is not recommended for establishing, for instance, concentration-effect curves.\n12. After ∼20 min of baseline recording, count the number of active electrodes per well at the Spike Plots module. Each field here represents a single electrode. If the number of active electrodes is less than four, do not expose the cells in this well to the test compound(s), since such a low number of electrodes will hinder proper detection of network bursts.",
    "13. Make an exposure schedule (for an example, see Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0004]). Since each plate is normalized to the average of its own controls, make sure to include enough control wells, in which the cell culture is exposed to a solvent (diluted just as the test compounds), water, or medium control. If you will be using different compounds diluted in different solvents, include sufficient control wells for each particular solvent. In our experience, the number of control wells should preferably be eight, but six at a minimum.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/3b2e9992-ff80-4687-8396-fa8228a8c023/cpz1158-fig-0004-m.jpg</p>\nFigure 4\nExample exposure diagram of a single MEA plate to five different conditions and one solvent. This exposure diagram can be used in acute, subchronic, and chronic exposure experiments.\n14. Start a 35-min exposure recording. Expose the culture by adding the appropriate exposure solution to each well during the first 5 min of the exposure recording.\nAdding small volumes of exposure solutions is preferred, since this limits (mechanical) disturbance of the cells. In our laboratory, we generally add 55.5 µl of culture medium with the desired test compound(s) and concentration(s) to each well (see step 11).\n15. After the MEA measurement, close the AxIS software, and turn off the Maestro MiddleMan and computer.\n16. Determine cell viability using the Alamar Blue assay (see Support Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0007]).\n17. After the cell viability assay, clean the MEA plate as described in Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0002] and proceed to MEA data processing (Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0008]).",
    "In this protocol, the user will perform MEA measurements during subchronic exposure of rat cortical cells seeded on MEA plates (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0001]) to a (set of) test compound(s). These subchronic exposure experiments will show the impact of exposure to a test compound(s) on neuronal function by recording spontaneous neuronal (network) activity at various time points during subchronic exposure: after 30 min (to reveal any acute effects), and after 24 and 48 hr exposure (to assess whether or not effects develop or aggravate over time).\nSubchronic exposure measurements will be performed on DIV 9-11, since at this developmental stage the neuronal networks exhibit a high and stable degree of activity (Dingemans et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-bib-0014]), including (network) burst behavior (Brown et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-bib-0008]; Zwartsen et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-bib-0050]). On DIV 9, users will perform a 30-min baseline MEA measurement, followed by exposure to the test compound(s) under sterile conditions in a biological safety hood to enable further culturing. Immediately after this exposure, users will perform another 30-min MEA measurement to determine acute effects. On DIV 10 (after 24 hr exposure) and DIV 11 (after 48 hr exposure), users will again perform 30-min MEA measurements. After the MEA measurement on DIV 11, users will determine cell viability (Support Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0007]: “Determination of cell viability after MEA experiments”). To ensure the robustness and reproducibility of MEA data, we recommend having a sample size of at least 20 wells per condition, spread out over three MEA plates. At the end of this protocol, the user will have MEA data output (.RAW files), which can be further analyzed following Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0008].\nFor materials, see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0004].\n1. Record baseline spontaneous neuronal activity as described in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0004], steps 1-10.",
    "2. Prepare exposure solutions during baseline recording (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0004], step 11). Prewarm the exposure solutions to 37°C. It is advisable to test a maximum of five conditions per plate, since this allows for eight replicates per condition.\nFor instance, test conditions can cover a range of five concentrations of the same compounds, can be a single concentration of five different compounds, or anything in between, as long as you have eight replicates per condition. In our laboratory, we test one compound per plate.\n3. After ∼20 min of baseline recording, count the number of active electrodes per well at the Spike Plots module. Each field here represents a single electrode. If the number of active electrodes is less than four, do not expose the cells in this well to the test compound(s), since such a low number of electrodes will hinder proper detection of network bursts.\n4. Make an exposure schedule (see Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0004]; Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0004], step 13). Since each plate is normalized to the average of its own controls, make sure to include enough control wells in which the culture is exposed to a solvent, water, or medium control, as appropriate. In our experience, the number of control wells should be at least six, but preferably eight.\n5. Expose the culture by adding 55.5 µl of exposure solution to each well under sterile conditions.\n6. Wait 30 min and record the spontaneous neuronal activity again (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0004], steps 1-10). This is timepoint ‘0.5 hr.’\n7. After completing the MEA recording, close the AxIS software, turn off the Maestro MiddleMan and computer, and incubate the exposed culture for 23 hr at 37°C, with 5% CO2 and 95% air atmosphere.",
    "8. Record the spontaneous neuronal activity for 30 min (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0004], steps 1-10). This is timepoint ‘24 hr.’ After the run, close the AxIS software, turn off the Maestro MiddleMan and computer, and incubate the exposed culture for another 23.5 hr at 37°C, with 5% CO2 and 95% air atmosphere.\n9. Record the spontaneous neuronal activity for 30 min (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0004], steps 1-10). This is timepoint ‘48 hr.’\n10. After the MEA measurement, close the AxIS software, and turn off the Maestro MiddleMan and computer.\n11. Determine cell viability using the Alamar Blue assay (see Support Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0007]).\n12. After the cell viability assay, clean the MEA plate as described in Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0002] and proceed to MEA data processing (Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0008]).",
    "In this protocol, the user will perform MEA measurements during chronic exposure of rat cortical cells seeded on MEA plates (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0001]) to a (set of) test compound(s). These chronic exposure experiments investigate the effect of a prolonged exposure on the development of spontaneous neuronal activity over time, i.e., developmental neurotoxicity. These chronic exposure experiments could, in principle, start at DIV 0, but in our laboratory, we start measuring at DIV 7, since at this time, neuronal networks have started developing and there is already spontaneous (network) activity (Dingemans et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-bib-0014]). On DIV 7, users will perform a 30-min baseline MEA measurement, followed by exposure to the test compound(s). To ensure that the exposure concentration remains constant over time, and to minimize disturbance to the cells, half medium changes will be done after each MEA measurement. In these half medium changes, half of the medium is removed from each well and replaced by fresh medium with the desired exposure concentration. Since the cells can be cultured and maintained for at least 28 days, exposures and half medium changes are performed under sterile conditions in a biological safety hood. On DIV 10, 14, 17, 21, and 24, users will again perform 30-min MEA measurements followed by a half medium changes. On DIV 28, users will perform the last 30-min MEA measurement, followed by a cell viability check (Support Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0007]). To ensure the robustness and reproducibility of MEA data, we recommend having a sample size of at least 20 wells per condition, spread out over three MEA plates. At the end of this protocol, the user will have MEA data output (.RAW files), which can be further analyzed using Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0008].\nFor materials, see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0004].",
    "1. Record the baseline spontaneous neuronal activity as described in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0004], steps 1-10.\n2. Prepare 2× exposure solutions during the baseline recording. Prewarm the exposure solutions to 37°C.\nSince only 50% of the medium will be replaced, for the first exposure, the concentration of the exposure solution should be double the amount of the desired exposure concentration. For example, if the intended exposure concentration is 1 µM, prepare a 2 µM exposure solution.\n3. After ∼20 min of baseline recording, count the number of active electrodes per well at the Spike Plots module. Each field here represents a single electrode. If the number of active electrodes is less than four, do not expose the cells in this well to the test compound(s), since such a low number of electrodes will hinder proper detection of network bursts.\n4. Make an exposure schedule (see Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0004]; Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0004], step 13). Since each plate is normalized to the average of its own controls, make sure to include enough control wells in which the culture is exposed to a solvent, water, or medium control. In our experience, the number of control wells should be eight at minimum for chronic MEA experiments, since some of the control wells may lose activity during the 28 days culture.\n5. After the baseline recording, remove the plate from the MEA Maestro.\n6. Perform the half medium change. First, correct the volume in each well, since this changes over time due to evaporation.\nNote that the values for volume adjustment can be different for different types of plates and laboratories. These volume adjustment values should thus be checked in advance. See Strategic Planning for a detailed explanation on how to do this.\n7. Carefully resuspend and remove 250 µl of the medium from each well.",
    "8. Gently add 250 µl of the 2× exposure solution at the concentrations of interest to the appropriate wells.\n9. Place the 48-well MEA plate in a humidified incubator at 37° with 5% CO2. Wait for 3 days, until DIV 10.\n10. Start another 30-min recording as described in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0004], steps 1-10. After the MEA measurement, close the AxIS software, and turn off the Maestro MiddleMan and computer.\n11. Prepare exposure solutions in culture medium. In this step, contrary to step 2, the concentration of the exposure solution should be equal to the desired exposure concentration (i.e., 1×). Warm the exposure solutions to 37°C and keep at this temperature until used.\n12. Repeat steps 6-9.\n13. At DIV 14, 17, 21, and 24, repeat steps 10-12.\n14. At DIV 28, start another 30-min recording. After the MEA measurement, close the AxIS software, and turn off the Maestro MiddleMan and computer.\n15. Determine cell viability using the Alamar Blue assay (see Support Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0007]).\n16. After the cell viability assay, clean the MEA plate as described in Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0002] and proceed to MEA data processing (Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0008]).",
    "Combining acute (Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0004]), subchronic (Alternate Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0005]), or chronic MEA (Alternate Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0006]) experiments with a fluorescence or colorimetric-based cell viability assay (e.g., Alamar Blue assay, WST-1 assay, MTT assay) enables distinguishing chemical-induced direct and functional neurotoxic effects from changes in neuronal activity that result from cytotoxicity (Wallace, Strickland, Valdivia, Mundy, & Shafer, 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-bib-0047]). The following protocol describes the evaluation of cell viability using the Alamar Blue assay, which is based on the reduction of the non-fluorescent, cell-permeable resazurin to highly fluorescent resorufin. After the (final) MEA recording is completed, the culture medium is replaced with prewarmed (37°C) Alamar Blue cell viability working solution, and cells are incubated for 1.5 hr. Afterwards, the Alamar Blue cell viability reagent is transferred to a transparent 96-well culture plate, and changes in cell viability can be assessed by measuring fluorescence. We further describe how to analyze the resulting data. The results will be expressed as mitochondrial activity (% of control), which is an indirect measure of viability.\nMaterials\n48-well MEA plate from acute-, subchronic-, or chronic-exposure MEA experiment (Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0004], step 17, Alternate Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0005], step 10, or Alternate Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0006], step 15, respectively)\n25 µM Alamar Blue cell viability working solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-rec-0002])\n6- or 8-channel electronic pipettor (Integra Bioscience, Voyager)\nTransparent 96-well plate suitable for the microplate reader\nMicroplate reader\nMeasuring metabolic activity\n1. At the end of the MEA measurement, replace culture medium with 300 µl of Alamar Blue cell viability reagent (25 µM).\n2. Incubate the plate for 1.5 hr at 37°C with 5% CO2 and 95% air atmosphere.",
    "Incubate the remaining Alamar Blue cell viability working solution for the same duration and under the same conditions as the 48-well MEA plate, as it can be used later on as blank control for the fluorescence measurement, to correct for background fluorescence.\n3. Transfer 200 µl of the Alamar Blue cell viability working solution from each well of the 48-well MEA plate to a well on a transparent 96-well culture plate. Include a minimum of four wells for the blank control (which consists of Alamar Blue cell viability working solution that has not been added to the 48-well MEA plate) per 96-well plate.\n4. Measure fluorescence using a microplate reader (excitation 540 nm and emission 590 nm).\nAfter the measurement, the 96-well plate can be discarded.\nData analysis\n5. Determine the mean blank value and subtract this value from all other fluorescence values.\n6. Determine the mean and SD for the control values and exclude values exceeding mean ± 2×SD, since these can be considered outliers.\n7. Normalize the fluorescence values for all wells to the mean fluorescence value of the control by using the following equation:\n         formula:\n$$empty$$\nHere, the mean control value is set to a metabolic activity of 100%.\n8. If applicable, combine data from different plates.\n9. For each condition, exclude values where the treatment ratio > mean ± 2×SD (for their respective condition), since these can be considered outliers. Do not do this again for control values as this has been performed already in step 6. The data is now ready for statistical analysis.\nAn example of the resulting data can be observed in Understanding Results.",
    "After the MEA recordings are completed (following Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0004], Alternate Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0005], or Alternate Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0006]), the Axion Integrated Studio (AxIS) software is used to generate AxIS Spike files (.spk files) from the .RAW files for further data analysis. In this step, a specific threshold is used to differentiate between spikes and background noise. The .spk files can be loaded into the NeuralMetrics Tool. In this software, further criteria are specified to identify bursts and network bursts in the recorded data. The NeuralMetrics Tool generates .CSV files, which contain the raw values for each parameter for each recording and will be used for analysis in Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0009] (for acute and subchronic exposure experiments) or Alternate Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0010] (for chronic exposure experiments).\nMaterials\nComputer\nAxion Integrated Studio (AxIS) software (Axion BioSystems; version 2.5.2)\nData from MEA experiments (.RAW files from Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0004], Alternate Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0005], or Alternate Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0006])\nNeuralMetric Tool (Axion BioSystems; version 3.1.7)\nObtaining .spk files\n1. Open the Axion software on the computer. Select the MEA output .RAW files that need to be pre-processed by clicking File → New batch process. In the pop-up screen, click Add → Select the files → OK.\nIt is possible to obtain .spk files from .RAW files one at a time, but generating .spk files takes time and is more efficient when several .RAW files are processed in a batch.\n2. Add a spike detection method. Right-click on the batch process, click on ‘Add processing,’ and select ‘Spike Detector.’",
    "3. In the pop-up screen (see Fig. 3B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0003]), use the method ‘Adaptive Threshold Crossing’ and set the threshold to the appropriate setting. Check the ‘Detect Only Crossings’ box. Set Coincident Event Removal to ‘none’ and ‘Spike counting interval’ to 1 s. Set the output file to ‘AxIS Spike’ and start the batch process.\nWe have determined that, in our laboratory, the optimal threshold setting for primary rat cortical neurons is 7 × standard deviation (SD) of the internal noise level with a pre/post-spike duration of 3.6/2.4 ms for each electrode. Note that these threshold criteria depend on the activity of the cells, and may need to be adjusted for different cell types. Selecting ‘Detect Only Crossings’ makes the signal return to below the threshold before detecting an additional spike. Do not check the ‘Allow Sample Overlap’ box. Coincident Event Removal is set to none, because the removal of coincident artifacts will be done at a later point in the analysis process.\nSpike train analysis with NeuralMetrics Tool\nThe .spk files generated can be analyzed by loading them into NeuralMetrics Tool (version 3.1.7, Axion Biosystems). The settings typically used in the NeuralMetrics Tool can be seen in Figure 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0005], but will also be explained in detail below.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/fa94721d-a222-443b-b1c2-9c7120dbb16d/cpz1158-fig-0005-m.jpg</p>\nFigure 5\nIllustration depicting the NeuralMetrics Tool settings for spike, burst, and network burst detection.\n4. Open the NeuralMetrics Tool on the computer.\n5. Set the file segment to 600 s (acute experiment) or 1200 s (chronic experiment) from the end of each measurement by selecting ‘End of File’ and setting the duration to 600 or 1200 s, respectively.",
    "This will make sure that only the last 10 (for acute exposure experiments) or 20 (for chronic exposure experiments) minutes of each recording (which is the most stable timeframe for stable exposure effects; see Hondebrink et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-bib-0024]) are used for the analysis. For each new compound tested, check whether the exposure effect is stable or only transient (short-lasting) by comparing results from different timeframes (e.g., from the first 10 minutes versus minutes 10-20 versus the last 10 minutes). If a transient exposure effect is found, a different optimal timeframe can be chosen by adjusting the time at ‘file segment.’\n6. Set the Active Electrode Criterion to 6 spikes/min and check the box ‘Remove coincident Artifacts,’ which are artificial spikes that are detected on multiple electrodes at the exact same time and may occur due to environmental interference.\n7. For burst parameters, select the same burst analysis settings as used during the MEA recording.\nIn our laboratory, we use the Poisson Surprise, with a minimum surprise of 10. This is a burst detection method that assumes neurons fire according to a Poisson distribution. Bursts are identified by assessing the ‘surprise’ of observing a collection of spikes at a given period of time compared to the expected collection of spikes under a Poisson distribution in that period of time. A higher minimum surprise will decrease the number of bursts identified (see Legendy & Salcman, 1985[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-bib-0028], for more information).\n8. Select ‘Adaptive’ under Network Burst. This separates the spikes by a maximum interval set automatically on a well-by-well basis based on the mean spike rate for each well. Set the minimum number of spikes (Min # of Spikes) to 40, and the minimum of electrodes per well (Min Electrodes (%)) to 15%.",
    "9. For Synchrony Parameters, set the synchrony window at 20 ms and additional synchrony metrics to ‘none.’\n10. Since there is no evoked stimulation, do not change any settings for stimulation parameters.\n11. Select the files that need to be loaded into NeuralMetrics Tool by clicking File → Batch process multiple files. In the pop-up screen, click OK after making sure the analysis and parameters settings are correct. In the next pop-up screen, click ‘Add Files’ to select the files. Make sure to set the timeframe in the pop-up screen to 600 s (for acute experiments) or 1200 s (for chronic experiments) from the end of each measurement. From the export options, select ‘Export Recommended Metrics to CSV.’\n12. Start the NeuralMetrics Tool process by clicking ‘Run Batch.’\nThe NeuralMetrics Tool produces .CSV files, which will be used in Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0009] (for acute and subchronic exposure experiments) or Alternate Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0010] (for chronic exposure experiments).",
    "For acute and subchronic MEA experiments, the .CSV files are combined into burst macro files using, for instance, a custom-made Excel macro. In this burst macro, the raw values for baseline and exposure recordings are grouped per condition. This step and the final pre-processing steps before statistical analysis, including normalization to control, combining experiments, and outlier analysis, are shown in Figure 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-fig-0006] and will be explained in detail below. At the end of this protocol, the user will have treatment ratios (defined as % change to control) for each specific parameter measured, which will show the effect of the exposure to the test compound(s) on neuronal activity. These treatment ratios can be used in statistical analyses and, for example, for concentration-response fitting.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/edcfbc06-dc41-4666-afd7-4738c08a9512/cpz1158-fig-0006-m.jpg</p>\nFigure 6\nSchematic diagram showing the different steps in the data analysis procedure for acute and subchronic MEA experiments. NoSP, number of spikes. NoB, number of bursts. NoNB, number of network bursts. SD, standard deviation.\nMaterials\nOutput from NeuralMetric Tools (.CSV files, from Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0008])\n1. The NeuralMetric Tool calculates the parameters of interest (see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-tbl-0001] for more information per parameter) per well prior to exposure (baseline activity) and after exposure. These values can be found in the .CSV files generated in Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0008]. Use these values to calculate a paired-comparison for each well. For each parameter of interest and each well, take the value at parameterexposure, divide this by the value at parameterbaseline, and multiply by 100. This expresses the parameterexposure as a percentage change compared to the parameterbaseline, and is the treatment ratio per well. In our lab, we do this paired-comparison with a custom-made Excel macro.",
    "We advise the user to first check the parameters that reflect the number of spikes and bursts, since these give a good overall indication of (changes in) general neuronal activity. Afterwards, look at number of spikes per (network) burst, mean inter-spike-interval (ISI) within a (network) burst, and (network) burst duration, since these are indicators of (network) burst structure and intensity. To check spike and (network) burst regularity, look at the ISI and the network inter-burst-interval IBI coefficient of variation, respectively. Finally, the user can check network synchronicity by looking at number of network bursts, (network) burst percentage, area under the normalized cross-correlation, and full width at half height of the normalized cross-correlation. For more information on MEA parameters, see Cotterill et al. (2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-bib-0012]); Kosnik et al. (2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-bib-0027]), Frank, Brown, Wallace, Mundy, & Shafer (2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-bib-0016]); Mack et al. (2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-bib-0029]).\nTable 1.\n                Definition of the Most Important Parameters Typically Measured During MEA Recordings (also see Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0009])\ntable:\n﻿Category,Metrics parameters,Description\nSpike parameters,Number of spikes ISI coefficient of variation,\"Total number of spikes over the duration of the analysis Standard deviation ISI (time between spikes) divided by the mean ISI. Measure for spike regularity: 0 indicates perfect spike distribution, >1 indicates bursting\"\nBurst parameters,Number of bursts,Total number of bursts over the duration of the analysis\n,Burst duration,\"Average time from the first spike in a burst till the last spike (s). Longer bursts indicate more excitation, as it takes longer to shut down a burst.\"\n,Number of spikes per burst,Average number of spikes occurring in a burst\n,Mean inter-spike interval (ISI) within burst,Mean inter-spike interval within a burst (s). Smaller values indicate more intense bursts.\n,Inter-burst interval (IBI),Time between the last spike of a burst and the first spike of a subsequent burst (s)",
    ",IBI coefficient of variation,Standard deviation of IBI divided by the mean IBI. Measure for burst regularity.\n,Burst percentage,Percentage of total number of spikes occurring in a burst\nNetwork burst parameters,Number of network bursts,Total number of network bursts over the duration of the analysis\n,Network burst duration,Average time from the first spike till the last spike in a network burst (s). Longer bursts indicate more excitation as it takes longer to shut down a burst.\n,Number of spikes per network burst,Average number of spikes occurring in a network burst\n,Mean ISI within network burst,Average of the mean ISIs within a network burst (s)\n,Network burst percentage,Percentage of total spikes occurring in a network burst\n,Network IBI coefficient of variation,Standard deviation of network IBI divided by the mean network IBI. Measure of network burst rhythmicity: value is small when bursts occur at a regular interval and increases when bursts occur more sporadically\nSynchronicity parameters,Area under normalized cross-correlation,\"Area under inter-electrode cross-correlation normalized to the auto-correlations. The higher the value, the greater the synchronicity of the network.\"\n,Full width at half height of normalized cross-correlation,\"Width at half height of the normalized cross-correlogram. Measure for network synchrony: the higher the value, the less synchronized the network.\"\n2. Exclude wells with less than four bursting electrodes in the baseline recording.\n3. Sort all treatment ratios per concentration per test compound.\n4. Remove outliers in the control values (value > mean ± 2×SD) and set the average control treatment ratio to 100% (which constitutes no change compared to baseline).\n5. Normalize the treatment ratios of individual exposed wells to the average treatment ratio of the control wells.",
    "Consider excluding parameter values where the treatment ratio is greater than the mean ± 2×SD (for their respective condition) of each respective parameter, since these can be considered outliers. Do not do this for the control values, as this has already been performed in step 4. The data is now ready for concentration-response fitting, for example, to derive IC50 values and benchmark response values, and for statistical analysis.\nAn example of the resulting data can be found in Understanding Results.",
    "For chronic MEA experiments that last up to DIV 28 (Alternate Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0006]), the NeuralMetrics Tool process described in Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0008] produces .CSV files for seven different measurements (time points). The user will need to combine the output files from these seven measurements, after which the final pre-processing steps before statistical analysis, including normalization to time-matched control, combining experiments, and outlier analysis, can be done. At the end of this protocol, the user will obtain treatment ratios (defined as % change to time-matched control) for each specific parameter measured, which will show the effect of the exposure to the test compound(s) on neuronal activity. These treatment ratios can be used in statistical analysis and, for example, for concentration-response fitting.\nMaterials\nOutput from NeuralMetric Tools (.CSV files from Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0008])\n1. The NeuralMetric Tool calculates the parameters of interest per well for each timepoint measured. These values can be found in the .CSV files generated in Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.158#cpz1158-prot-0008]. Each .CSV file contains the raw values for all parameters measured at a specific timepoint. Combine the values from all seven .CSV files to obtain a file that contains the raw values per parameter from all timepoints, grouped by condition. In our lab, we do this with a custom-made Excel macro, but any way of combining the values is appropriate.\n2. Exclude wells with less than four bursting electrodes in the baseline recording.\n3. Determine the mean and SD for the raw values of the control per parameter measured during the MEA recordings per time point and exclude values > mean ± 2×SD (of their respective timepoint), since these can be considered outliers.\n4. For each parameter, normalize the raw values per time point to their time-matched average control value to obtain treatment ratios.",
    "5. Set the time-matched average control treatment ratios to 100% (which constitutes no change compared to baseline).\n6. For each parameter, exclude exposure values in which the treatment ratio is greater than the mean ± 2×SD (of their respective timepoint), since these can be considered outliers. Do not do this again for control values, as this has been performed already in step 3. The data is now fit for statistical analysis.\nAn example of the resulting data can be found in Understanding Results."
  ],
  "subjectAreas": [
    "Toxicology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}