{
  "id": 17263,
  "origin_website": "Jove",
  "title": "An Apical Resection Model in the Adult Xenopus tropicalis Heart",
  "procedures": [
    "All the experimental protocols related to X. tropicalis were approved by the Jinan University Animal Care Committee.\n1. Surgery\nPreoperative preparation: Keep ready ophthalmic scissors, ophthalmic forceps, needle forceps, absorbent balls, filter paper, and surgical sutures/needles for apex resection in the hearts of X. tropicalis. Refer to the Table of Materials for detailed information. Before use, sterilize all the surgical instruments by autoclaving, and prepare an adequate quantity of ice for future use.\nAnesthetize an adult X. tropicalis with tricaine by placing it in 500 mL of tricaine solution (1 mg/mL) at room temperature for 4 min19, and then put it on a surface of ice on the operating table to ensure the frog does not wake up during the operating process.\n\t​CAUTION: The whole procedure requires 5-10 min; the time of anesthesia should not be too long, otherwise the X. tropicalis may not be able to wake up after the operation.\nThoracotomy\n\t\nPlace the anesthetized X. tropicalis abdomen up, and cover the abdomen of the frog with gauze presoaked in distilled water to avoid the drying of the animal's skin during the operation.\nGently press the chest with forceps, find the center of the chest parallel to the lower forelimb, lift the skin with ophthalmic scissors, and gently make a small incision of ~1 cm. Using ophthalmic scissors, pick up the muscle layer under the skin, and create a wound in the central chest muscle. As the heart is located in the upper position of the wound site, gently press the chest with the ophthalmic forceps to squeeze the heart out from the wound.",
    "CAUTION: As the skin of X. tropicalis can produce antimicrobial peptides, it is unnecessary to employ conventional disinfection procedures on the surgical site of the X. tropicalis. Any disinfectant will damage the skin of the X. tropicalis.\nVentricular apex resection\n\t\nGently clamp the pericardium with forceps, and gently break it using ophthalmic scissors near the apex of the heart. Wait for the pericardium to come off due to systolic blood pumping (Figure 1A, B).\nHold the tip of the heart with forceps in the non-dominant hand, and lift the heart slightly according to the cardiac contraction rhythm. When the heart contracts to recirculate blood through the blood vessels, quickly cut off the apex of the heart (~14% of the ventricle) (Figure 1C).\nTo ensure the amount of apex resection is approximately 14% of the whole heart, analyze the heart weight (HW) and surface area with or without resection20. Place the heart into the chest using forceps and an absorbent ball.\n\t\tNOTE: Do not press the heart directly with the forceps; otherwise, other parts of the heart will be punctured.\nSuture the skin with a 4-0 non-absorbent non-silk surgical thread suture (Figure 1D). Be careful to avoid suturing into the muscle layer to prevent postoperative mortality. Wait for the skin wound to naturally heal within 1 week following surgery.\nIn the sham operation group, perform the thoracotomy, open the pericardium, and suture, without performing the apex resection.\n2. Surgical recovery\nPlace the postoperative X. tropicalis with its abdomen facing up in a Petri dish containing a small quantity of deionized water (do not completely flood the animal). Wait for the X. tropicalis to wake up within ~10 min.",
    "Upon regaining consciousness, observe the animal's mobility and activity, as well as the wound suture during activity. Transfer the frogs that have regained their balance to a container filled with pure water for cultivation. Replace the water with pure water every day to avoid wound infection.\n\t​NOTE: With these measures, the survival rate could reach ~90%. A prolonged time of anesthesia and excessive bleeding during surgery both lead to death, which typically occurs on the day of surgery.\n3. Detection of the repair condition after cardiac injury\nCollect the hearts of X. tropicalis at multiple time points after surgery.\n\t\nAfter anesthetizing the X. tropicalis with tricaine, open the abdomen, and use forceps to remove the other internal organs and tissues to find the location of the heart.\n\t\tNOTE: Due to the apex resection, the heart is likely to develop alongside other tissues and organs during the repair process. Sometimes, it sticks to the muscle wall and is not easy to separate, so it needs to be handled carefully during collection.\nAfter finding the heart, use forceps to gently tear the other organs from the heart. Gently peel away the other tissues surrounding the heart to expose the heart. Use forceps to gently lift the heart, and cut it out using scissors. Place the heart immediately in PBS to remove any remaining blood, and photograph it with a stereoscope for documentation (Figure 2).\nGradient dehydration",
    "Blot the hearts with filter paper to dry the excess PBS residues, and place them in a 24-well cell culture dish. Use 1-2 ml of 4% paraformaldehyde to fix the heart tissues overnight. The following day, perform ethanol dehydration. First, use 70% ethanol overnight, followed by 80% ethanol, 90% ethanol, and 100% ethanol for gradient dehydration (1 h each time). Repeat the use of 100% ethanol three times.\nParaffin embedding\n\t\nTreat the dehydrated heart tissue with xylene for 6-8 min. Place the xylene-treated tissue in a glass container filled with paraffin wax at 65 °C for 2-3 h.\n\t\t​NOTE: It is essential to avoid air bubbles as they affect the section during the embedding process.\nFreeze the embedded tissue at −20 °C for 1 h, and section it.\nAfter sectioning the heart, perform standard hematoxylin and eosin (H&E) and Masson's trichrome staining techniques on the sections11.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}