{
  "id": 13168,
  "origin_website": "Jove",
  "title": "Electroporation-mediated RNA Interference Method in Odonata",
  "procedures": [
    "NOTE: The overall scheme of the protocols is shown in Figure 1.\n1. Preparation of larvae of dragonflies or damselflies.\nCollect larvae in the field using a hand net.\n\tNOTE: I. senegalensis larvae often cling onto water plants floating on the water surface, while P. zonata larvae often stay among leaf litter at the bottom. In Tsukuba City, the final instar larvae of I. senegalensis are found mainly from March to June, and those of P. zonata from May to June. I. senegalensis larvae can be reared from eggs in the laboratory14, but the larvae collected in the field have the clearly higher success rate of adult emergence.\nSpecies identification by restriction fragment length polymorphism (RFLP) of PCR-amplified products.\n\tNOTE: This step is only necessary if the species is difficult to identify from the appearance of the larvae, as in I. senegalensis.\n\t\nHold one of the caudal gills of a larva using forceps. Then, the larva falls off its caudal gill itself (causing autotomy).\n\t\tNOTE: Larvae of Zygopteran damselflies usually have three caudal gills (Figure 1A). When they are attacked by a predator, they can take off their own caudal gills to escape. If the caudal gill is not available, a portion of the leg is dissected.\nPut one caudal gill into 100 µL of PBS solution [0.8% NaCl, 0.02% KCl, 0.115% Na2HPO4, and 0.02% KH2PO4 (w/v)] and homogenize with a hand mixer using a deposit pestle.\nSpin down the mixture at 5,000 x g for 10 seconds, and subject 0.5 µL of the supernatant to PCR-amplification using DNA polymerase and primers to amplify the internal transcribed spacer 1 (ITS1) region of the nuclear DNA.",
    "NOTE: Perform the PCR according to the manufacturer's protocol. The combination of ITS-F0 (5'- GGA AAG ATG GCC AAA CTT GA -3') and 5.8S-AS1 (5'- GCC GGC CCT CAG CCA G -3') primers can amplify ITS1 region in almost all Odonata species19.\nIncubate the mixture of 1 µL of PCR-amplified product, 0.3 µL of 10x M Buffer, 0.1 µL of DraI restriction enzyme, and 1.6 µL of water at 37 °C for 1 h.\n\t\tNOTE: Select the best restriction enzymes, depending on the combination of species. If there are no restriction enzymes suitable for species identification, confirm by DNA sequencing.\nLoad 2 µL of the products with loading dye on 2% agarose gel and run electrophoresis.\n\t\tNOTE: It is difficult to identify species when using 1% or 1.5% agarose gel.\nCheck the electrophoresis pattern to identify the species (Figure 2).\n\t\tNOTE: RFLP patterns are species- and population-dependent. In Tsukuba population, I. asiatica has a major band of 400-500 bp, whereas I. senegalensis has a major band of approximately 200 bp and an additional band of less than 100 bp (an arrowhead in Figure 2). The ITS1 region exists in multiple copies in the genome, and in Ischnura species, microsatellite polymorphism within the ITS1 region is often present in the same individual, affecting the pattern of RFLPs.\nRear the collected larvae in the laboratory until use for RNAi.\n\t\nPlace each larva separately into each well of a 12-well plate with approximately 3 mL of water.\n\t\tNOTE: I. senegalensis larvae must be kept individually because they frequently cannibalize each other, while P. zonata larvae can be kept in a group because they rarely cannibalize.",
    "Feed I. senegalensis larvae with Artemia brine shrimp every day and P. zonata larvae with bloodworms and/or Tubifex worms at least twice a week until they grow to the suitable developmental stage for RNAi.\n\t\tNOTE: Frequent feeding is critical to increase the success rate of adult emergence.\nChange the water as soon as it becomes dirty with feces or leftovers.\n\t\tNOTE: Frequent water change is also important to increase the success rate of adult emergence.\nJudge the appropriate developmental stage for RNAi.\n\t\tNOTE: The final instar larvae of I. senegalensis can be classified into five developmental stages14,20. The first stage (stage A, before the wings begin to expand) or the second stage (stage B) of the final instar larvae is suitable for RNAi experiments, when considering the clear phenotype of RNAi after adult emergence (see Discussion). In P. zonata, the final instar larvae before wing expansion (corresponding to stage A of I. senegalensis) were used in this study.\n2. Preparation of dsRNA/siRNA solution and injection needles for RNAi.\nNOTE: Select either small interfering RNA (siRNA) (step 2.1) or double-stranded RNA (dsRNA) (step 2.2) as the solution for RNAi.\nPreparation of the siRNA solution\n\t\nDesign siRNA using siDirect program version 2.0 (http://sidirect2.rnai.jp/)21,following the guidelines previously reported in Lepidopteran insects22.\nObtain commercially synthesized siRNA.\n\t\tNOTE: The sequences of siRNA targeting MCO2 gene of I. senegalensis used in this study were as follows: 5'- GCA CUU UCC GUU AUC AAU AUA -3' for sense strand and 5'- UAU UGA UAA CGG AAA GUG CUC -3' for antisense strand. As a negative control, the sequences of siRNA targeting enhanced green fluorescent protein (EGFP) gene were as follows: 5'- GCA UCA AGG UGA ACU UCA AGA -3' for sense strand and 5'- UUG AAG UUC ACC UUG AUG CCG -3' for antisense strand11.",
    "Dilute the siRNA to 100 µM with injection buffer [100 mM CH3COOK, 2 mM Mg(CH3COO)2, 30 mM HEPES-KOH, pH 7.4]22.\nStore at -80 °C until use.\nPreparation of dsRNA solution.\n\t\nSelect a 300-400 bp region for dsRNA using primer3 program version 4.1.0 (http://bioinfo.ut.ee/primer3/)23 and design the primer sets. \nObtain commercially synthesized primer sets.\n\t\t​NOTE: To produce templates for dsRNA synthesis, the primer sets used in this study were as follows: (5'- GCC TGT CAG CTT TGT CTT CC -3' for forward primer and 5'- GGT GTC TGG CGG ACA ACT AT -3' for reverse primer) for MCO2 genes of I. senegalensis (IsMCO2, accession no. LC589180) and (5'- CCG CAC AGC TCA CTA TTC AA -3' for forward primer and 5'- GGA GGA TTC CTT CAT CGA CA -3' for reverse primer) for MCO2 genes of P. zonata (PzMCO2, accession no. LC589179). As a negative control, the primer set for dsRNA targeting β-lactamase (bla) gene on the cloning vector were (5'- CTA TGT GGC GCG GTA TTA T -3' for forward primer and 5'- CAG AAG TGG TCC TGC AAC T -3' for reverse primer).\nExtract RNA from Odonata larvae using a commercially available RNA extraction kit and perform cDNA synthesis using reverse transcriptase according to the manufacturer's protocol.\n\t\tNOTE: cDNA library prepared for RNA sequencing analysis can be also used.\nAmplify the target sequences using the synthesized cDNA and the designed primer set and clone them into the cloning vector using a commercial ligase according to the manufacturer's protocol.\nTransform the plasmid into E. coli competent cells and pick up a single colony after overnight incubation.\nPCR-amplify the insert region using primers on the vector.\nConfirm the cloned sequence by Sanger sequencing.\nPCR-amplify the insert using vector primers containing the T7 polymerase promoter sequence24, 25.",
    "NOTE: In this study, the following primers were used: T7-F (5' - TAA TAC GAC TCA CTA TAG GGA GAC TAG TCA TAT GGA T - 3') and T7-R (5'- TAA TAC GAC TCA CTA TAG GGA GAC CCG GGG ATC CGA T - 3') 25.\nPurify the PCR product using the PCR purification kit according to the manufacturer's protocol, elute the DNA with 50 µL of distilled water, and concentrate the eluted DNA solution to approximately 10 µL using a centrifugal evaporator.\nSynthesize dsRNA by in vitro transcription according to the manufacturer's protocol. Use a total of 1000 ng template DNA and elute synthesized dsRNA with 100 µL of elution buffer.\nMeasure the concentration of dsRNA using a spectrophotometer and confirm the quality of dsRNA by electrophoresis on a 1.5% agarose gel.\n\t\tNOTE: A single band can be seen when dsRNA synthesis is successful.\nDilute dsRNA to 1000 ng/µL with elution buffer and store at -20 °C until use.\nPreparation of injection needles\n\t\nPull a glass capillary by using a glass needle puller.\nPlace the tip of the pulled capillary onto a double-sided adhesive tape and break the tip of the capillary with forceps.\nSet the capillary to an injector.\n\t\tNOTE: It is easier to handle the capillary if you wear nitrile gloves.\nLoad siRNA/dsRNA solution to the prepared capillary.\n\t\tNOTE: Do not use the capillary repeatedly since the tip of the injected capillary may become clogged with dirt because the larvae collected in the field lived in the mud.\n3. siRNA/dsRNA injection\nNOTE: The procedure is slightly different for damselflies (step 3.1) and dragonflies (step 3.2).\nInjection to a Zygopteran (damselfly) larva (e.g., I. senegalensis).\n\t\nAnesthetize a larva covered with a wet paper on crushed ice for 50-70 seconds (Figure 3A-C).",
    "NOTE: Duration of ice-cold anesthesia depends on the condition of the larva; if the larva begins to move after 70 seconds of ice-cold anesthesia, an additional 70 seconds of ice-cold anesthesia is applied. For larvae that rarely move (e.g., P. zonata), this procedure is not essential.\nAttach two pins on both sides of the prothorax and fix the larva to a fixed stand (e.g., a piece of Styrofoam) (Figure 3D).\n\t\tNOTE: Adjust the position and number of pins, depending on the place of injection.\nStretch the inter-segmental membrane between the 7th and 8th abdominal segment for RNAi in the abdomen or between the prothorax and synthorax (fused mesothorax and metathorax) for RNAi in the thorax using hands and forceps.\nKeep the inter-segmental membrane stretched by hand.\nInsert the tip of the prepared capillary into the stretched inter-segmental membrane (Figure 3D, 3F).\nInject 1 µL of siRNA/dsRNA solution.\nInjection to an Anisopteran (dragonfly) larva (e.g., P. zonata).\n\t\nWipe the water off the larval surface with a paper towel.\nIf needed, attach two pins on both sides of the prothorax and fix the larva to a fixed stand (e.g., a piece of Styrofoam) (Figure 3H).\n\t\tNOTE: Adjust the position and number of pins, depending on the place of injection. In the case of P. zonata, it is not essential to fix the larvae with pins at this step.\nStretch the inter-segmental membrane between the 4th and 5th abdominal segment by hand.\nMake a small hole with a fine needle in the inter-segmental membrane between the 4th and 5th abdominal segment.\n\t\tNOTE: This procedure is necessary for many Anisopteran (dragonfly) species because the inter-segmental membrane is too hard to insert a glass capillary directly.\nInsert the tip of the prepared capillary into the prepared hole (Figure 3I).",
    "NOTE: As shown in Figure 3H, part of the dorsal side of the larvae corresponds to the ventral side of the adult, so the phenotype appears ventrally when treated as shown in Figure 3H-J.\nInject 1 µL of siRNA/dsRNA solution.\n4. in vivo electroporation\nIf needed, add more pins to fix the larva to a fixed stand (e.g., a piece of Styrofoam).\nFollowing the injection of the siRNA/dsRNA solution, apply two droplets of ultrasound gel on the larval surface using forceps.\nPlace electrodes on the ultrasound gel, with the positive electrode on the side injected with the siRNA/dsRNA solution and a negative electrode on the opposite side (Figure 3E, 3G, 3J).\n\tNOTE: Do not directly touch the epidermis of the larva to avoid the burning effect of electroporation.\nGenerate 10-times electroporation pulses (280 ms/s each) using an electroporator.\n\tNOTE: Adjust the voltage of electroporation, depending on the species, stages and tissues. In this study, 25 V was applied to I. senegalensis and 45 V to P. zonata.\nWipe off the remaining gel on the surface with a paper towel.\nKeep the treated larvae resting on a wet paper towel for approximately one day for recovery and transfer them to a rearing case on the following day.\n5. Site-specific phenotypic analysis\nKeep I. senegalensis individually in a Petri dish (5 cm in diameter) containing approximately 10 mL of water and a piece of paper towel, and keep P. zonata in a plastic cage with a disposable non-woven mesh (eclosion cage14).\nFor I. senegalensis, after the larvae stop eating, move them individually into a plastic cage with a disposable non-woven mesh.\n\tNOTE: Do not put two or more larvae in the same cage. Otherwise, they will cannibalize each other immediately after they become adults.",
    "After the emergence of the adult, observe and photograph the phenotype around the region where the positive electrode was placed for electroporation.\n\tNOTE: The phenotype appears only in patches. Phenotypes are often difficult to recognize immediately after emergence due to incomplete pigmentation.\nIn order to examine the efficiency of RNAi (e.g., quantitative RT-PCR), if the phenotype is visible, dissect the region and compare it with the region without the phenotype.\n\tNOTE: The levels of RNAi phenotype, namely size and location of the cuticle decolorization, often exhibit considerable variation between individuals (see Figure 4).\nKeep the emerged adults in 100% EtOH for future analyses.\n\tNOTE: Body color of Odonata species quickly fades after death, so it is important to store them in ethanol before they die. Ethanol sometimes discolors the insects, in such cases that the insects are frozen before they die."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}