{
  "id": 2379,
  "origin_website": "Cell",
  "title": "Protocols to culture and harvest hepatic tumor organoids for metabolic assays",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nEstablishment and culture of hepatic tumor organoids\nTiming: 1 month\nThis section describes the experimental steps required to establish, expand and culture hepatic tumor organoids from human and murine hepatic tumors. All experimental steps should be performed in a sterile environment, e.g., laminar flow hood, and sterile and autoclaved tools should be used when they are in contact with the tumor tissues.\nFor human HCC tissues\nObtain liver tumor biopsies from donors undergoing hepatectomy or liver transplantation. Liver biopsies are kept in at least 25 mL DMEM medium, high glucose (DMEM) in 50 mL centrifuge tube in ice before processing.\nInside a laminar flow hood, aspirate the medium without disturbing the tumor tissues and leave around 10 mL DMEM in the tube.\nNote: UV the tissue culture hood for 30 min. Disinfect the tissue culture hood and all the pipettes with 75% ethanol and swipe dry with paper towel.\nPour the tumor tissues together with the remaining DMEM into a 10-cm cell culture dish.\nCut out 1 cm3 tumor tissues with sterile blades and transfer to a 6-cm cell culture dish containing 3 mL fresh DMEM.\nAlternatives: Extra tissues can be snap frozen in liquid nitrogen or fixed in 4% paraformaldehyde.\nGo to step 12.\nFor murine HCC tissues\nAnesthetize the mice with CO2.\nOpen the abdomen of the mice with sterile surgical scissors to expose the liver.\nPerfuse the liver with perfusion buffer via the inferior vena cava to the portal vein to wash out blood.\nAfter perfusion, dissect the tumor nodules and cut out 1 cm3 with sterile blades.\nTransfer to a 6-cm cell culture dish containing 3 mL fresh DMEM.\nAlternatives: Extra tissues can be snap frozen in liquid nitrogen or fixed in 4% paraformaldehyde.\nGo to step 12.",
    "Dissociation of human and murine HCC tissues\nMince the tumor tissues together with the medium in 6-cm cell culture dish with sterile blades until the tissues becomes less than 1 mm in diameter.\nTransfer the tissue-medium mixture to 50 mL centrifuge tube with a sterile transfer pipette.\nAdd 10 mL human or murine liver digestion solution to the mixture.\nIncubate the mixture with digestion solution in 37°C water bath for 30 min with occasional swirling of the tube.\nAlternatives: Use a water bath with a shaker set at moderate speed.\nStop the digestion process by adding ice-cold neutralization buffer.\nFilter the mixture through a 70 μm cell strainer.\nCentrifuge at 180 × g for 5 min at 4°C. Discard the supernatant.\nCulture of human and murine HCC organoids\nResuspend dissociated cells in 5 mL complete organoid culture medium.\nCount the cell number with an automated cell counter or a hemocytometer.\nMix the dissociated single cells with Matrigel, growth factor reduced, phenol red-free (Matrigel) at a 1:4 v/v ratio.\nFor plating in each 24-well plate, we recommend 15,000 cells (or 30,000 cells depending on the proliferation rate; please refer to Figure 1[href=https://www.wicell.org#fig1] below) in 10 μL of medium to be mixed with 40 μL of Matrigel.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1866-Fig1.jpg\nFigure 1. Hepatic tumor organoids\nImages of organoids with varying proliferation capacities grown for 6 and 9 days. Scale bar = 100 μm.\nIf the concentration of the cells is too low for plating, centrifuge the cells at 800 × g for 5 min and resuspend in less volume of medium (at least 15,000 cells in 10 μL) according to the concentrations counted in step 20.\nCritical: Thaw and maintain Matrigel on ice. The cell-Matrigel mixture is kept on ice before plating.",
    "Dispense 50 μL of the cell-Matrigel mixture into each well of a 24-well plate.\nCritical: Pipette the cell-Matrigel mixture gently. Avoid introducing bubbles into the mixture.\nNote: The cell-Matrigel mixture should sit at the center of the well as a dome and should not spread.\nAfter dispensing the mixture into the required number of wells, put the plate in a 37°C, 5% CO2 incubator for at least 15 min.\nGently add 500 μL of complete culture medium to each well, with care taken to not disrupt the Matrigel mixture.\nNote: We recommend adding the medium against the wall of the wells to avoid touching the Matrigel droplet.\nIncubate the organoids in a 37°C, 5% CO2 incubator.\nChange fresh complete medium every three days, with care taken to not disturb the Matrigel droplet when aspirating or adding medium. Troubleshooting 1[href=https://www.wicell.org#troubleshooting].\nCulture the organoids for 9–14 days until the diameters of the organoids reach approximately 50–75 μm (Figure 1[href=https://www.wicell.org#fig1]). Troubleshooting 2[href=https://www.wicell.org#troubleshooting].\nCritical: The hepatic cells are very sticky and tend to be retained inside the pipette tips. It is critical to wet the inner wall of a new pipette tip each time before pipetting the cell suspension. Dip the pipette tip into organoid medium and pipetted up and down 2–3 times to rinse the tip. Alternatives include using low binding tips or using a sterile solution of PBS.\nNote: We do not recommend growing the organoids for more than 14 days in the same well without further passage. Matrigel will be more difficult to digest by TrypLE™ Express Enzyme (1×), no phenol red (TrypLE) or cell recovery solution for prolonged culture of organoids.",
    "Note: All the hepatic organoid lines derived using this protocol are morphologically similar that cells are densely packed and arranged to form compact and spherical organoids. Please refer to Figures 1[href=https://www.wicell.org#fig1] and 2[href=https://www.wicell.org#fig2] for representative images.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1866-Fig2.jpg\nFigure 2. Plating and attachment of hepatic tumor organoids\nLeft image showing successful plating and attachment of organoids without Matrigel. Organoids do not float in the medium and attach to the bottom of the well. Single cells appear at the peripheral of the organoid to aid with the attachment (inset). Right image showing unsuccessful attachment of organoids after plating. The organoids float in the medium and concentrate at the center of the well. The organoids have more clear and smooth boundaries and there are no single cells attached to the peripheral of the organoid (inset). Scale bar of large image = 100 μm. Scale bar of inset = 50 μm.\nNote: The growth rates of different hepatic organoid lines can vary (Figure 1[href=https://www.wicell.org#fig1]). For organoid lines that grow slower, the user may plate more cells (2 times the suggested cell number, i.e., 30,000 cells) inside one Matrigel droplet to enhance the growth of the organoids. For human HCC organoid lines, we cannot conclude on the growth rate differences observed among various lines as some patients harbor certain/multiple mutations while some do not. For murine HCC organoid lines derived from various mutations-driven tumors, we did observe that certain mutation could promote proliferation/certain organoid lines grow faster than others while carrying the mutation, i.e., beta-catenin activation.",
    "Note: Organoids grown too large have reduced viability that will result in more dead cells after dissociation. For the hepatic tumor organoid lines that we have tested, the optimal size of the organoids necessary for dissociation to perform functional assays is 50–75 μm in diameter. At this range of sizes, the single cells dissociated can keep up to 90% viability.\nNote: For organoid expansion, dissociation and passage are needed. The benchmark or the signals for passage of organoid lines include the following: 1) the medium changes to yellowish color the day after changing fresh medium, 2) organoids and cells are dislodged from the Matrigel droplet and floating in the medium, and 3) cells migrate through the edge of the Matrigel droplet and attach to the bottom of the well. The number of culture days before the next passage should be optimized for each organoid line.\nNote: There is not a referenced minimum number of times that the organoids should be passaged before performing the assay. We did passage the organoids to at least P2 (from P0) before performing assays, to make sure the cells are indeed expandable and proliferating after passage. We have not experienced organoid lines to stop growing after certain passage numbers. We and others have confirmed that hepatic tumor organoids are genetically stable for at least 3 months.\nNote: Regarding expanded details about hepatic organoid growth, maintenance, and passaging, users can also refer to the methods described in Broutier et al. (2017)[href=https://www.wicell.org#bib1], Hu et al. (2018)[href=https://www.wicell.org#bib3], Huch et al. (2015)[href=https://www.wicell.org#bib4] and Nuciforo et al. (2018)[href=https://www.wicell.org#bib6].\nHarvesting and plating dissociated organoids for metabolite/drug testing\nTiming: 45–60 min",
    "This section describes the experimental steps required to harvest hepatic tumor organoids and plate the dissociated single cells to measure viability under metabolite/drug treatment. In general, the basic steps necessary for harvesting and dissociation can be applied to any type of organoid.\nBefore harvesting the organoids, coat the 384-well plate with the required number of wells with 8 μL of Matrigel per well in a laminar flow hood.\nCritical: The plate and Matrigel are placed on an ice box to prevent oligomerization and solidification of the Matrigel while dispensing it. Since only 8 μL of Matrigel is added to each well, the surface tension of Matrigel is high, which prevents its spread across the surface of the well. Some cells could attach to the area without the Matrigel coating and grow 2-dimensionally without forming 3D organoids. It is important to tap the plate after adding Matrigel to ensure that Matrigel is evenly distributed and covers the entire surface of the well.\nPut the plate into a 37°C, 5% CO2 incubator for at least 15 min to solidify the Matrigel.\nTake out the cultured organoids from the incubator, and aspirate the medium in each well.\nAdd 500 μL of pre-warmed TrypLE to each well to recover organoids from the Matrigel.\nGently pipette TrypLE and Matrigel droplet mixture up and down 2–3 times to dislodge the Matrigel and the organoids from the well.\nTransfer the mixture into a new sterile 15-mL centrifuge tube with 1000 μL pipette tip.\nNote: Each 15-mL centrifuge tube can accommodate organoids from up to 8 wells (i.e., approximately 4–6 mL in volume).\nIncubate the mixture in a 37°C water bath for 5 min with occasional swirling of the tube to mix TrypLE with organoids.\nAlternatives: Use a water bath with a shaker set at moderate speed.",
    "Pipette the mixture rigorously for 20–30 times to mechanically disrupt and dissociate the organoids into single cells.\nNeutralize the TrypLE solution with the same volume of complete organoid medium.\nCentrifuge the tube at 800 × g for 5 min.\nAspirate the medium. Troubleshooting 3[href=https://www.wicell.org#troubleshooting].\nCritical: During aspiration, avoid touching the cell pellet, which can be dislodged easily.\nGently resuspend the dissociated cells are for 10 times in complete culture medium using 200 μL or 1000 μL pipette tips depending on the number of Matrigel drop and the medium volume. For each Matrigel drop, we recommend resuspending in 60 μL complete culture medium.\nAlternatives: To test the effect of depleting a metabolite/growth factor from the medium, the dissociated cells are resuspended in the medium without the addition of a particular metabolite/growth factor.\nCount the cell number with an automated cell counter or a hemocytometer, and calculate the number of 384-well plates and total cell numbers needed.\nFor each 384-well plate, we suggest plating 1,500 cells in 30 μL of medium per well.\nFor each experimental group, at least three technical replicates are highly recommended.\nDispensed 30 μL of solution containing 1,500 cells into each 384-well coated with Matrigel.\nCritical: Avoid touching the Matrigel while dispensing the cell solution. The cells may migrate through the crack of Matrigel and attach to the bottom of the well. Add the cell suspension against the wall of the wells.\nNote: A multichannel pipette is used to dispense the cell suspension to shorten the cell plating time and increase consistency.\nTo avoid edge effects, we recommend not using the peripheral wells of the plates and filling those wells with 100 μL of water.",
    "Incubate the organoids in 37°C, 5% CO2 incubator for 3 days without changing the medium to allow the single cells to grow into small organoids.\nAfter a 3-day incubation period, prepare the metabolites/drugs and respective controls to be tested at 2× concentration in 30 μL of medium (testing medium). The plating medium in each well is not changed or discarded. Add the testing medium to the wells so that the final concentration becomes 1×.\nAlternatives: To test the effect of depleting a metabolite/growth factor from the medium, go to step 46 after the 3-day incubation. The incubation can be extended beyond 3 days, but we recommend adding 30 μL of the testing medium on Day 3 to avoid drying out of the wells.\nIncubate for 3–6 days to measure the effects of metabolites/drugs to the organoid growth.\nNote: The incubation time can vary for different metabolites/drugs. We recommend testing the effects at multiple time points. The suggested time points for hepatic tumor organoids are 3, 6 and 9 days (Tong et al., 2021[href=https://www.wicell.org#bib8]).\nAfter incubation at specific time points, dispense 15 μL of CellTiter-Glo® 2.0 Luminescent Cell Viability Assay (CellTiter-Glo solution) into each well, and resuspend the mixture.\nIncubate the plate in the dark at room temperature for 30 min.\nMeasure the luminescence signal with a luminescence plate reader.\nCritical: The hepatic cells are very sticky and tend to be retained inside the pipette tips. It is critical to wet the inner wall of a new pipette tip each time before pipetting the cell suspension. The pipette tip was dipped into organoid medium and pipetted up and down 2–3 times to rinse the tip.\nOptional: Leftover cells after plating for metabolite/drug testing can be plated for propagation and expansion in a 24-well plate.",
    "Note: We recommend plating the cell-Matrigel mixture in 24-well rather than 384-well plates because the medium and the nutrients/drugs would not efficiently diffuse through the Matrigel and reach the organoids that are grown away from the surface of the Matrigel.\nNote: We do not recommend aspirating and changing the medium of the organoids after plating in 384-well plates, as this may disrupt and remove the organoids from the wells.\nNote: We recommend including negative control cells with only the organoid medium added as the background reading for this experiment.\nCoating plates, harvesting and plating 3D organoids for Seahorse assays\nThis section describes the experimental steps to 1) coat Seahorse microplates with poly-D-lysine hydrobromide (poly-D-lysine) to facilitate the attachment of 3D organoids, 2) harvest intact hepatic tumor organoids, and 3) plate the intact 3D organoids for Seahorse metabolic assays. The coating procedures can be applied to any type of tissue culture plate and are not limited to Seahorse microplates. Note that the organoids are not dissociated into single cells in this section.\nCoating Seahorse cell culture microplate with poly-D-lysine\nTiming: 1–1.5 h\nDay before the assay.\nPrepare working solution of poly-D-lysine at 50 μg/mL with sterile water.\nCoat the cell culture microplate with poly-D-lysine for 1 h at room temperature.\nFor the XFe96 cell culture microplate, we recommend adding 20 μL.\nFor the XFe24 cell culture microplate, we recommend adding 100 μL.\nAspirate the poly-D-lysine and wash the wells twice with 0.2 mL (XFe96) or 1 mL (XFe24) of sterile water. Air-dry the plate inside the laminar flow hood.\nAlternatives: Prepare the coated plate one day before plating the organoids. The plates are wrapped with parafilm, stored at 4°C in a refrigerator and brought to room temperature before use.",
    "Note: Seahorse XF poly-D-lysine (PDL)-coated cell culture microplates are also available. We recommend using self-coating poly-D-lysine, as the concentrations of poly-D-lysine used for coating can be adjusted and optimized for each organoid line.\nHarvesting and plating organoids for the Seahorse assay\nTiming: 45–60 min\nDay before the assay.\nAspirate the medium of the organoids in a 24-well plate.\nAdd 500 μL of ice-cold cell recovery solution to each well to recover organoids from the Matrigel.\nGently pipette the cells up and down 2–3 times to dislodge the Matrigel and organoids from the well.\nCritical: Do not pipette aggressively; this will disrupt the organoid structure.\nTransfer the mixture into a new sterile 15-mL centrifuge tube.\nNote: Each 15-mL centrifuge tube can accommodate organoids from up to 8 wells (i.e., approximately 4–6 mL in volume).\nPlace the tube in ice for 30 min and rotate it from end to end manually every 5 min.\nCritical: Do not mix with a vortex mixer to avoid disrupting the organoid structure.\nNeutralize the cell recovery solution with the same volume of complete organoid medium.\nCentrifuge the tube at 800 × g for 5 min.\nAspirate the medium. Troubleshooting 3[href=https://www.wicell.org#troubleshooting].\nCritical: During aspiration, avoid touching the organoids, which can be easily dislodged.\nGently resuspend the organoids in complete culture medium. For each well of organoids, we recommend resuspending with 200 μL of medium.\nPipette 10 μL of organoid suspension into any tissue culture plate. Place the plate under the microscope to count the number of organoids in a 10-μL volume.\nCalculate the required number of wells for the experiment and adjust the volume of organoid suspension to achieve the required concentration.\nFor the XFe96 cell culture microplate, we recommend plating 50 organoids in 80 μL of medium per well.",
    "For the XFe24 cell culture microplate, we recommend plating 250 organoids in 200 μL of medium per well.\nAdd the organoids with medium to the coated microplate. Leave the four wells at the corner as a background correction control. Fill those four wells with medium only.\nPlace the microplate at room temperature for an hour to facilitate even distribution of the organoids in the well.\nIncubate the organoids overnight in 37°C, 5% CO2 incubator, and check the plating of the organoids the next day (Figure 2[href=https://www.wicell.org#fig2]).\nNote: To preserve the 3D structure of the organoids, it is critical to pipette gently.\nNote: Matrigel is not added in this assay. Our testing experiment showed that the organoids embedded inside Matrigel did not respond to the test compounds, as no changes in the oxygen consumption rate (OCR) were observed over time.\nSeahorse metabolic assay\nTiming: ∼180 min\nThis section describes the procedures used to perform the Seahorse Cell Mito Stress assay. The general procedures can be applied to other Seahorse metabolic assays. The assay medium and test compounds vary for different metabolic assays; please refer to the manufacturer’s protocols for each assay.\nDay before the assay\nTurn on the Seahorse analyzer and warm the machine overnight.\nAliquot at least 20 mL of Seahorse XF Calibrant into a 50 mL conical tube. Place this XF Calibrant in a non-CO2 37°C incubator overnight.\nPlace the sensor cartridge upside down next to the utility plate.\nFill each well of the utility plate with 200 μL (XFe96) or 1 mL (XFe24) of sterile water.\nLower the sensor cartridge onto the utility plate, submerging the sensors in the water.\nVerify the water level is high enough to keep the sensors submerged.",
    "Place assembled sensor cartridge and utility plate in a non-CO2 37°C incubator overnight. To prevent evaporation of the water, verify that the incubator is properly humidified.\nNote: For details, please refer to the manufacturer’s protocol.\nhttps://www.agilent.com/cs/library/usermanuals/public/XFe96_DAY_BEFORE_CARTRIDGE_HYDRATION.pdf[href=https://www.agilent.com/cs/library/usermanuals/public/XFe96_DAY_BEFORE_CARTRIDGE_HYDRATION.pdf].\nDay of the assay\nPrepare the Cell Mito Stress Test assay medium for the Cell Mito Stress Test assay.\nWarm the assay medium to 37°C in a water bath for subsequent use.\nRemove the microplate with organoids from the 37°C, 5% CO2 incubator.\nCheck the attachment of the organoids under a microscope. Troubleshooting 4[href=https://www.wicell.org#troubleshooting].\nCarefully remove the organoid medium with a pipette.\nNote: We do not recommend using suction, as the organoids could be aspirated from the well.\nSlowly add 180 μL (XFe96) or 500 μL (XFe24) of Seahorse assay medium per well.\nCritical: The assay medium was added to the wall of the wells to prevent organoids from lifting off. Make sure the organoids are not dislodged after adding the medium under the microscope.\nNote: The testing metabolites/drugs and their respective controls can be added to the assay medium at this stage. We recommend at least three replicates for each testing group.\nPlace the microplate in a non-CO2 incubator at 37°C for an hour.\nPrepare stock and working solutions of Cell Mito Stress Test compounds.\nTake out the XF Calibrant and the hydrated sensor cartridge with utility plate from the incubator.\nPlace the sensor cartridge upside down next to the utility plate.\nAspirate the water from the utility plate.\nFill each well of the utility plate with 200 μL of the pre-warmed XF Calibrant.\nLower the sensor cartridge onto the utility plate, submerging the sensors in calibrant.\nPlace assembled sensor cartridge with utility plate in a non-CO2 37°C incubator for 45–60 min prior to loading the injection ports of the sensor cartridge.",
    "Take out the utility plate from the incubator.\nLoad the sensor cartridge with the aid of port loading guides (for XFe96) with working solutions of compounds according to the following table.\ntable:files/protocols_protocol_1866_11.csv\nFor the location of the ports, please refer to Figure 3[href=https://www.wicell.org#fig3].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1866-Fig3.jpg\nFigure 3. The arrangement of Ports A, B, C, and D in the sensor cartridge\nNote: For loading XFe96 sensor cartridge, we recommend using the A/D and B/C port loading guides provided inside the package of the sensor cartridge.\nNote: For details, please refer to the manufacturer’s protocol.\nhttps://www.agilent.com/cs/library/usermanuals/public/DAY%20OF%20LOADING%20CARTRIDGE%20XFe96-XF96.pdf[href=https://www.agilent.com/cs/library/usermanuals/public/DAY%20OF%20LOADING%20CARTRIDGE%20XFe96-XF96.pdf].\nSet up the assay program in the Wave software of Seahorse analyzer. In the assay program, assign the wells to each experimental group. Assign the wells at the four corners as blank.\nNote: We use the Cell Mito Stress Test assay template stored in the software for running the program.\nSave the assay program and click Start Run in the program.\nPlace the loaded sensor cartridge with the lid removed in the correct orientation with the triangular notch of the cartridge at the left-bottom corner.\nClick I’m ready in the program and calibrate the sensor cartridge. This step will take approximately 20–30 min.\nWhen prompted, replace the calibration plate with a cell culture microplate and remove the lid. Click I’m ready in the program. The standard Cell Mito Stress Test assay will take approximately 120 min.\nRemove the microplate and sensor cartridge after running the program.\nSave the experimental result file for subsequent analysis. Troubleshooting 5[href=https://www.wicell.org#troubleshooting].\nNote: For details of the operation of the Seahorse analyzer, please refer to the manufacturer’s protocol.\nhttps://www.agilent.com/cs/library/usermanuals/public/usermanual-xfe-analyzer-operating-manual-cell-analysis-S7804-90001-en-us-agilent.PDF[href=https://www.agilent.com/cs/library/usermanuals/public/usermanual-xfe-analyzer-operating-manual-cell-analysis-S7804-90001-en-us-agilent.PDF].\nNote: For details of the running of the Wave program, users may refer to the manufacturer’s protocol.\nhttps://www.agilent.com/cs/library/usermanuals/public/S7894-10000_Rev_C_Wave_2_6_User_Guide.pdf[href=https://www.agilent.com/cs/library/usermanuals/public/S7894-10000_Rev_C_Wave_2_6_User_Guide.pdf].\nProtein quantification for normalization\nTiming: 30–45 min",
    "This section describes the procedures for normalization based on protein quantification.\nAfter the assay, carefully remove the medium in the microplate with a pipette.\nNote: We do not recommend using suction, as the organoids could be easily dislodged after the assay.\nWash each well with 200 μL (XFe96) or 1 mL (XFe24) of ice-cold phosphate-buffered saline (PBS) once, and carefully discard the PBS with a pipette.\nCritical: The washing step was performed gently to prevent the organoids from lifting off.\nLyse the organoids for protein extraction by adding 10 μL (XFe96) or 50 μL (XFe24) of 1× RIPA buffer to each well. Pipette up and down for 10 times with 20 μL or 200 μL pipette tips to facilitate protein lysis.\nIncubate the microplate on ice for 20–30 min. Resuspend the mixture occasionally to facilitate protein lysis.\nCentrifuge the microplate at 3000 g at 4°C for 15 min.\nUse the supernatant for measurement of protein concentrations by standard Bradford protein assay.\nCalculate the protein concentrations of each well and normalize oxygen consumption rates (OCR) from the Seahorse assay result with the protein concentrations in Wave program.\nCalculate the basal respiration, ATP production and maximal respiration from the normalized OCR from the Seahorse analysis (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1866-Fig4.jpg\nFigure 4. Different metabolic parameters in the Seahorse Cell Mito Stress Test\nSchematic showing the metabolic profile and key parameters of mitochondrial functions from the Seahorse Cell Mito Stress Test.\nNote: For details of normalization of the assay result in the Wave program, users may refer to the manufacturer’s protocol.\nhttps://www.agilent.com/cs/library/usermanuals/public/S7894-10000_Rev_C_Wave_2_6_User_Guide.pdf[href=https://www.agilent.com/cs/library/usermanuals/public/S7894-10000_Rev_C_Wave_2_6_User_Guide.pdf].\nAlternatives: Other quantification methods, such as cell numbers and total DNA measurement, can be used for normalization purposes. For details, the user may refer to the manufacturer’s protocol.\nhttps://www.agilent.com/cs/library/technicaloverviews/public/Methods_and_Strategies_for_Normalizing_Tech_Overview_022118.pdf[href=https://www.agilent.com/cs/library/technicaloverviews/public/Methods_and_Strategies_for_Normalizing_Tech_Overview_022118.pdf]."
  ],
  "subjectAreas": [
    "Organoids",
    "Metabolism",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}