{
  "id": 15152,
  "origin_website": "Jove",
  "title": "Lentiviral Mediated Gene Silencing in Human Pseudoislet Prepared in Low Attachment Plates",
  "procedures": [
    "Prior to commencement of studies, a human subjects research determination was made by the University of Iowa Institutional Review Board, who determined that the study did not meet the criteria for human subjects research. Consult the local review board before the initiation of the study to determine if the source of islets and planned study requires prior approval.\nNOTE: Typically, 1,200−1,400 islet equivalent (IEQ) of human islets are required for the formation of 192 pseudoislets at the size of 3,000 cells/pseudoislets in a 96-well ultra-low attachment plate or 1,200 pseudoislets at the size of 500 cells/pseudoislets in a microwell culture plate. IEQ of islets required varies between different preparations of human islets as donor factors (age, health, weight), isolation efficiency, and culture conditions affect the yield of the single cell suspension. In this protocol, lentivirus containing shRNA targeting a gene of interest is used. The cytomegalovirus (CMV) and human phosphoglycerate kinase (hPGK) promoter based lentiviral vectors are reported to down-regulate gene efficiently in human pseudoislets5,15. The use of lentivirus requires precaution as biohazard16. Contact the local biosafety committee prior to the initiation of the use of lentivirus.\n1. Overnight Culture of Human Islets for Recovery After Shipment\nPrepare Connaught Medical Research Laboratories 1066 (CMRL-1066) medium supplemented with 1% human serum albumin (HSA) by combining 50 mL of CMRL-1066, 0.5 g of HSA, 0.5 mL of penicillin-streptomycin, and 0.5 mL of 100 mg/mL glutamine (1% HSA CMRL) in biological safety cabinet (BSC) and passing through a 0.2 μm filter for sterilization.\nGently swirl the shipping bottle to keep islets in suspension. Transfer the shipping medium containing islets to a 50 mL conical centrifuge tube. Let the tube sit in BSC for 15 min so that islets settle to the bottom of the tube.",
    "Remove shipping medium gently without disturbing the islet pellet using a 10 mL pipette. Re-suspend the islet pellet in 1% HSA CMRL to a concentration of 400 IEQ/mL.\nTransfer islets into a non-tissue culture treated dish. If islets are split into multiple dishes, keep islets evenly suspended in medium by gently swirling before splitting. Culture islets at 37 °C in a 5% CO2 incubator overnight.\nNOTE: The use of a non-tissue culture treated dish is required to prevent the attachment of islets to the plate.\n2. Preparation of Single Cell Suspension from Human Islets\nPrepare the following: CMRL-1066 medium with 10% heat-inactivated fetal bovine serum (HiFBS), penicillin-streptomycin, and glutamine (10% HiFBS CRML) at room temperature (RT), a 40 µm strainer, a 35 mm Petri dish, a 1 mL tuberculin syringe, and a hemocytometer.\nTransfer human islets after overnight culture into a 15 mL conical centrifuge tube. Centrifuge at 190 x g for 5 min in a swinging-bucket rotor. Aspirate medium with a 5 mL pipette without disturbing the islet pellet.\nWash the pellet by adding 10 mL of phosphate-buffered saline (PBS) into the tube, mix gently, and centrifuge at 190 x g for 5 min. Aspirate PBS without disturbing the islet pellet.\nRe-suspend the islet pellet in 0.5 mL of a pre-warmed proteolytic and collagenolytic enzyme mixture and pipette 5x using a P1000 pipette to mix islets. Incubate at 37 °C for 5 min. Mix by pipetting up and down gently 1−5 times.\nNOTE: Aggressive pipetting will increase cell loss.\nCheck for cloudiness (single cells) and the number of flakes (undigested islets). Add 2−3 min to 37 °C incubation depending on the extent of digestion judged by cloudiness and the number of flakes. Stop digestion when flakes are reduced to ~10% of predigestion and solution is cloudy.",
    "NOTE: Time required for digestion differs depending on the islet size distribution of each human islet preparation.\nPlace a 40 µm strainer in a 35 mm Petri dish and wet the strainer by adding 1 mL of 10% HiFBS CMRL and pressing with 1 mL syringe plunger. Transfer all the cell suspension on top of the strainer and collect the pass-through in a fresh 15 mL tube.\nWash the tube used for islet digestion with 0.5 mL of fresh CMRL medium to collect leftover cells and pass the wash through the strainer. Combine the pass-through in a 15 mL tube. Repeat once.\nNext, dissociate undigested islets remaining on the strainer by pressing the strainer placed in a 35 mm dish with 1 mL syringe plunger. Collect pass-through again and wash the strainer with fresh CMRL-1066 to remove all remaining digested islets from the strainer and the dish. A total ~3 mL of single cell suspension will now be in the 15 mL tube.\nRecord the total volume of the cell suspension and take 10 µL aliquot of cells to count the cell number on a hemocytometer.\nCentrifuge the cell suspension for 5 min at 200 x g. Remove medium without disturbing the pellet. Proceed to step 3.1.1 if using a 96-well ultra-low attachment plate or step 3.2.1 if using a 24 well microwell culture plate to reaggregate the cells.\n3. Pseudoislet Formation and Transduction by Lentivirus\nProtocol using a 96-well ultra-low attachment plate",
    "Determine the desired number of cells per pseudoislet and the number of pseudoislets to create. Typically, 1,000−3,000 cells are used for each pseudoislet for a 96-well ultra-low attachment plate. For 3,000 cells per pseudoislet, adjust the cell suspension to 1 x 105 cells/mL by resuspending the islet pellet from step 2.10 in 10% HiFBS CMRL so that 30 µL of cell suspension has 3,000 cells. Calculate the total volume of 1 x 105 cells/mL of single cell suspension (mL) required using the following equation:\n\t\tThe total volume of 1 x 105 cells/mL of single cell suspension (mL) = (number of cells per pseudoislet) x (number of pseudoislets being made) / 1 x 105.\nNOTE: Adjust the concentration of the cell suspension based on the desired number of cells per pseudoislet so that 30 µL of cell suspension makes one pseudoislet.\nTransfer the required volume (30 µL x number of pseudoislets being made) of single cell suspension to a fresh 15 mL tube. Add 250 transduction units (TU)/cell of lentivirus containing shRNA targeting a gene of interest or control.\nCAUTION: Lentivirus is classified as biosafety level 2 and can be integrated into DNA of infected cells.\nNOTE: Use concentrated lentivirus so that the volume of lentivirus added is minimal. Titer required per cell for efficient gene silencing may differ depending on the lentiviral construct.\nMix cell suspension with virus by pipetting gently 5x with a P1000 pipette. Transfer mixed cells into a 50 mL sterile reagent reservoir if using an 8-channel pipette.\nDispense 30 µL per well of single cell suspension mixed with lentivirus into each well using an 8-channel pipette or a P200 pipette depending on the number of the wells.",
    "Centrifuge the 96-well plate in a swinging-bucket plate centrifuge at 270 x g at RT for 7 min. Check whether cells are gathered in the center of each well. If not, centrifuge again as gathering of all cells in the center of the well is critical for pseudoislet formation. Culture at 37 °C in a humidified 5% CO2 incubator overnight.\nAdd 100 µL of pre-warmed 10% HiFBS CMRL per well next morning to avoid drying of cells during subsequent culture. Centrifuge at 270 x g, RT for 7 min. Culture at 37 °C in a 5% CO2 incubator. Pseudoislets will complete formation in 5−7 days.\nWhen harvesting pseudoislets, pre-warm the desired volume of 10% HiFBS CMRL (100 µL per islet), prepare one 50 mL sterile reservoir, one sterile 10 cm Petri dish, and one 8-channel pipette in BSC.\nRemove the 96-well plate from the incubator and place in BSC. Pipette 100 µL per islet of 10% HiFBS CMRL into a reservoir.\nPipette 100 µL per well of 10% HiFBS CMRL from a reservoir to pseudoislets and pipette up and down 2−3 times gently in the well to lift islets up. Then, aspirate medium in the well containing a pseudoislet and eject into a 10 cm Petri dish. Use of an 8-channel pipette allows transfer of 8 pseudoislets at one time.\nCheck the plate under a light microscope to ensure the complete removal of all the pseudoislets. Pseudoislets form firm aggregates and remain aggregated after lifting. The pseudoislets are now ready for downstream experiments.\nProtocol using a 24-well microwell culture plate\nWarm up the anti-adherence rinse solution (Table of Materials) to RT for efficient spheroid formation. Also, pre-warm plain CMRL-1066 and 10% HiFBS CMRL.",
    "Add 500 µL per well of the anti-adherence rinsing solution to each well of the 24-well microwell culture plate to be used for pseudoislets. Centrifuge at 1,300 x g for 5 min in a swinging-bucket plate centrifuge.\nObserve the plate under a microscope to ensure that air bubbles are removed from microwells. If air bubbles are trapped in microwells, centrifuge at 1,300 x g for 5 min again.\nAspirate the anti-adherence rinsing solution from the wells in a BSC. Rinse each well with 2 mL of warm plain CMRL-1066 once. Aspirate CMRL-1066. Add 0.5 mL/well of warm 10% HiFBS CMRL to each well planned for use. Wells are now ready for loading dispersed human islet cells prepared in step 2.10.\nDetermine the total number of cells needed for each well. One well of 24-well microwell culture plate contains 1,200 microwells and forms 1,200 pseudoislets. 500 cells per pseudoislet x 1200 microwells = 6 x 105 cells. Resuspend single cells from step 2.10 to 6 x 105 cells in 0.8 mL of 10% HiFBS CMRL in a sterile 1.5 mL tube.\nNOTE: The maximum volume per well is 2 mL. Volume of cell suspension should not exceed 1.5 mL. The protocol describes steps for creating one well of pseudoislet transduced by lentivirus. Scale up depending on the number of wells to be made for each lentivirus.\nFor viral transduction, add 125 TU/cell to the single cell suspension. Keep the volume of virus below 0.2 mL. Incubate the cell and virus mixture at 37 °C with occasional gentle mixing for 1 h to allow contact of cells with virus before condensation of cells in step 3.2.8.",
    "NOTE: Use concentrated lentivirus so that the volume of lentivirus added is minimum. Lower number of TU per cell is used for Protocol 2 compared with Protocol 1 as the total volume of medium per cell number is less. However, titer required per cell for efficient gene silencing may differ depending on the lentiviral construct and needs optimization.\nCAUTION: Lentivirus is classified as biosafety level 2 and can be integrated into DNA of infected cells.\nAfter 1 h, adjust the total volume of the islet cell and virus mixture to 1 mL by adding 10% HiFBS CMRL. If cells form clump after 1 h incubation, disperse into single cell suspension by gentle and quick pipetting 2−3 times. The pipetting is very important for even distribution of cells across microwells. Transfer cell suspension to one well of the 24-well microwell culture plate.\nImmediately following pipetting, centrifuge at 100 x g for 3 min at RT to capture cells into all microwells. Observe under a microscope to verify that cells are evenly distributed in all microwells.\nCulture the microwell culture plate at 37 °C in a 5% CO2 incubator. Pseudoislets will form in 24−48 h. Pseudoislets can be cultured without medium change for up to 7 days.\nWhen changing the medium for culture beyond 7 days, replace 50%−75% of medium for each medium change as follows. Slowly remove 0.5−1 mL of medium using a P1000 pipette from each well. Add 0.5−1 mL of fresh 10% HiFBS CMRL slowly by placing a tip to the wall of the well to avoid dislodging pseudoislets from the microwell culture plate.\nTo prepare for harvesting pseudoislets, warm up the 10% HiFBS CMRL medium. Pseudoislets tend to float up in serum free CMRL-1066 making it hard to pick them.",
    "Aspirate 0.5 mL of medium from well using a 1 mL pipette and dispense media forcefully back to plate surface to lift up pseudoislets from the microwell culture plate.\nGently aspirate dislodged pseudoislets using the 1 mL pipette and transfer islets into a non-tissue culture treated 6-well plate. Pass through a small 37 µm reversible strainer placed on a 15 mL conical tube. Pseudoislets will remain on the filter; any unincorporated single cells will flow through.\nNOTE: To avoid loss of smaller size pseudoislets through strainer, the strainer may be omitted.\nDispense 1 mL of 10% HiFBS CMRL across the entire surface of the well to dislodge any remaining pseudoislets, aspirate dislodged pseudoislets, and pass through the strainer. Repeat 3x to ensure complete collection of all pseudoislets from wells.\nObserve the microwell culture plate under an invert microscope to ensure that all pseudoislets are collected. Repeat the wash as in step 3.2.14 if pseudoislets remain.\n4. RNA Extraction for Evaluation of Gene Silencing Efficiency\nPick pseudoislets into the RNase free PBS in a 1.5 mL microcentrifuge tube and centrifuge at 300 x g for 3 min at 4 °C. Remove PBS without disturbing the islet pellet and wash once with PBS followed by centrifugation at 300 x g for 3 min at 4 °C.\nAspirate most of PBS using a P1000 pipette. Then, change to a P10 pipette to remove the rest of PBS without disturbing the islet pellet.\nAdd 0.5 mL of guanidinium thiocyanate RNA extraction reagent (Table of Materials) per tube. Homogenize the pseudoislets using a motor-driven pestle for 2−3 times. The homogenate in the guanidinium thiocyanate RNA extraction reagent can now be stored at -80 °C or processed for RNA purification.",
    "NOTE: 24 of the 3,000 cell-pseudoislets formed in a 96 well plate or 48 of the 500 cell-pseudoislets formed in a microwell culture plate are sufficient to obtain 0.5−1 µg of RNA.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}