{
  "id": 10893,
  "origin_website": "Jove",
  "title": "Viability of Bioprinted Cellular Constructs Using a Three Dispenser Cartesian Printer",
  "procedures": [
    "1. Preparation of Gelatin Containing Substrate for Three-Dimensional Bioprinting of Alginate Hydrogels\nPrepare the calcium/gelatin substrate following the calcium/gelatin substrate method described by Pataky et al11 to avoid reduced viability associated with high content. The calcium/gelatin substrate method is listed below.\n\t\nCombine calcium chloride dehydrate (1.5 wt%), sodium chloride (0.9 wt%), and porcine gelatin (2 wt%) in distilled water and boil for 2 min to create a 100 mM gelatin solution.\nPour 5 ml of the gelatin/calcium solution into 100 mm standard petri dishes, swirl the solution around to make an even coating on the surface, and place on a flat surface in the fridge to gel O/N (allow to gel at least 8 hr before use).\nTo increase the opacity of the substrate surface, add titanium dioxide (0.3 wt%) to the gelatin/CaCl2 solution. Stir for 10 min. Autoclave the gelatin/TiO2 solution on the liquids cycle for 30 min to sterilize it.\n\t\nAdd 3 ml of the gelatin/TiO2 solution to the surface of the previously prepared gelatin plates. Swirl the mixture to ensure it is spread evenly across the surface. Allow to gel in the 4 °C fridge O/N (allow to gel at least 8 hr before use). The substrates must be used within 3 days.\n2. Alginate Oxidation\nOxidize the sodium alginate bioink following the method for partially oxidized alginate by Bouhadir et al30 described below.\n\t\nTo make a 5% oxidized alginate solution, dissolve 1 g of sodium alginate in 100 ml of distilled water. Add an aqueous solution of sodium periodate (0.25 M, 0.25 mmol), the oxidizing agent, to produce a 5% oxidation solution. Stir for 19 hr at RT. Add 40 ml ethylene glycol to the solution after 24 hr to end the reaction.",
    "Dissolve 2.5 g of sodium chloride in the solution. Add an excess amount of ethyl alcohol (2:1 ratio) to precipitate the oxidized alginates. Centrifuge the solution at 1,000 x g to collect the precipitates and re-dissolve them in distilled water. Repeat the ethanol wash.\nFreeze-dry the oxidized alginate pellets and store at -20 °C until ready for use.\nDetermine the degree of oxidation by measuring the percentage of sodium periodate consumed before being terminated by the ethylene glycol.\n\t\nPrepare a potassium iodide solution (20% w/v, pH 7.0 sodium phosphate buffer) and a thyodene solution (10% w/v, pH 7.0 sodium phosphate buffer). Mix the two solutions with the oxidized alginate at RT.\nGradually drop the reacted alginate and sodium periodate solution into the mixture of potassium iodide and theodyne solutions. Measure the absorbance of the mixture spectrophotometrically at 426 nm. When it has reached a maximum, record the used volume of alginate and sodium periodate solution as V1.\nThe reaction is imgsrc://cloudfront.jove.com/files/ftp_upload/53156/53156eq1.jpg. The amount of unreacted sodium periodate is imgsrc://cloudfront.jove.com/files/ftp_upload/53156/53156eq1.5.jpg\nSubtract the amount of unreacted sodium periodate from the original concentration to determine the amount of sodium periodate consumed. Using the previous formula, determine the final oxidation degree of the alginate.\n3. Alginate Peptide Conjugation\nConjugate ligands with an exposed arginine-glycine-aspartate sequence ( peptide) into the previously prepared oxidized alginate by following the RGD-Alginate conjugation method by Rowley et al31described below to promote cell attachment and spreading.\nUse aqueous carbodiimide chemistry with G4RGDSPto conjugate31.\nDissolve 1 g of 5% oxidized alginate in a 0.1 M 2-(N-morpholino) ethanesulfonic acid (MES) buffer, pH = 4. Add 1-ethyl-(dimethylaminopropyl) carbodiimide (EDC, 0.54 mmol) and N-Hydroxysuccinimide (NHS, 0.27 mmol) at 2:1 ratio to form amide intermediate.\nAdd 0.28 mmol peptide, coupling to the backbone of the alginate polymer via the terminal amine. Stir at RT O/N.",
    "Stop the coupling reaction by adding 2.5 g sodium chloride to the solution. Add an excess amount of ethyl alcohol (2:1 ratio) to precipitate the oxidized alginates. Centrifuge the mixture at 4,000 x g for 5 min to collect the precipitates. Aspirate the media in the cell culture hood and re-dissolve the precipitates in distilled water. Repeat the ethanol wash.\nFreeze-dry the precipitates until it becomes completely dried (will appear as a white powdery substance) and store in the -20 °C fridge for later use.\n4. Human Adipose Tissue Stromal Cells (hADSC’s) Cell Culture\nCulture human adipose tissue stromal cells (hADSC’s) in 75 cm treated cell culture flasks (T75 flasks), covered with 15 ml low glucose DMEM with 10% fetal bovine serum and 1% penicillin-streptomycin, 1% glutamine, and 1% antimycin. Change the media, in the cell culture hood, every two days until they have reached confluency (80-90%).\nOnce confluent, transfer the T75 flasks to the cell culture hood and suspend the hADSC’s using the trypsin enzyme digestion method.\n\t\nIn the hood, aspirate all of the cell culture media off of the cells. Rinse with 5 ml of Dulbecco’s Phosphate-Buffered Saline with calcium and magnesium (DPBS ++). Aspirate the DPBS++ off of the cells.\nWhile in the hood, make a solution of trypsin and DPBS++ by mixing 1 ml trypsin and 4 ml DPBS++. Each flask requires 5 ml of the solution, so make the appropriate volume for the number of confluent flasks. Add 5 ml of the trypsin/DPBS++ to each flask and put them in the incubator for 2 min.",
    "After 2 min, remove the flasks and lightly tap the sides of them to loosen the cells from the bottoms. Look at each flask under a microscope to ensure the cells are suspended. Place the flasks back in the cell culture hood and add 3 ml of appropriate cell culture media to each flask. This ends the trypsin reaction.\nTransfer the cell-laden media from each flask and put in a 50 ml conical. Centrifuge them at 1,000 x g for 5 min. The cells should appear as a little white pellet in the bottom of the conical. Transfer back to the cell culture hood and aspirate the media. Resuspend the cells in 2 ml of cell culture media.\nCount the cells using a hemocytometer under the microscope. Once the cells have been counted, in the culture hood, aliquot the amount of media containing ~1.3 million cells and transfer to a 15 ml conical. Centrifuge the 15 ml conical containing the cells again for 5 min at 1,000 x g.\nIn the culture hood, reseed the remaining cells in multiple T-75 flasks, adding a concentration of ~350,000 cells to each flask. Add 15 ml of DMEM media and return to the incubator until confluent again.\nOnce the centrifuge cycle is complete, return the 15 ml conical to the cell culture. Aspirate the media from the cell pellet, and resuspend the cells in aqueous alginate solution at a concentration of 1.3 million cells per milliliter of bioink, terteriating the solution often so there is a homogeneous distribution of cells throughout the bioink. Load the cell-laden solution into a sterile printer-compatible 3 ml syringe and screw on the sterile 22 G plastic tip.\n5. Bioprinter Setup\nTurn on the bioprinter, each of the dispenser computers, and the recirculating water bath.",
    "Manually set the recirculating water bath temperature to for the gelation mechanism.\nManually set printing parameters for each dispenser on the correlating dispenser computer. Set the dispense volume to 230 nl, number of backsteps to 0, and the dispense rate to 10μl –sec.\nOpen the design software and the program for viewing the USB camera’s display on the computer.\n\t\nUsing the software, manually enter the coordinates for a 5 x 5 dot array with 2.4 mm spacing between drops.\nSet the printing parameters to be: distance between tip end and substrate surface = 0.1 mm; height syringe is lifted between depositions = 20 mm; the amount of time per deposition = 1 sec.\nSave the program and send it to the robot.\nPlace the gelatin/TiO2-containing Petri dish on the 4 °C printer stage. Close and lock the chamber door.\nUse the PLC to initialize the ultraviolet light sources, and sterilize the chamber for 90 sec.\nOnce sterilization is complete, open the chamber and load the syringe containing hADSC’s suspended in alginate into Gun 1. Close and lock the chamber door.\nUse the PLC to turn on the fan system, wait 30 sec for equilibrium internal pressure.\nOn the computer, run the program containing the geometrical pathway and printing parameters.\nThroughout the printing process, watch the USB camera’s display on the computer to confirm accurate and uniform printing.\nOnce printing has finished, allow the constructs to gel for 40 min.\n6. Cell Viability Assessment\nCover the constructs that are not going to be imaged immediately post-printing in DMEM and store in the incubator until time of imaging.\nTo quantify the viability of the constructs, stain them using a fluorescent-based viability/cytotoxicity assay, and image using confocal microscopy.",
    "Following the kit instructions, prepare a staining solution containing calcein AM and ethidium homodimer-1. To make 10 ml of staining solution, add 20 μl of the ethidium homodimer-1 and 5 μl of the calcein am to 10 ml of sterile, tissue culture-grade Dulbecco’s Phosphate-Buffered Saline (+magnesium, +calcium; DPBS++).\nImmerse the bioprinted constructs in the stain solution for 15 min in the dark.\nImage the stained constructs using a confocal microscope system at days 0 and 8. Take multiple pictures of each bioprinted construct, using Z-stack parameters of 30 optical slices over a 300 μm depth, and manually count the cells. If cells appear yellow or green count them as alive, and if red, count them as dead.\nCalculate the cell viability percentage as the number of live cells divided by the total number of cells in the construct; Cell Viability = number of live cells (green+yellow)/ number of total cells (green+yellow+red) x 100%.\nCalculate the amount of cell proliferation for each sample as the cell number of day 8 divided by the cell number on day 0; Cell Proliferation = live cell count on day 8/ live cell count on day 0 x 100%.\n7. RGD Peptide Conjugation Analysis\nTo analyze the success of RGD peptide conjugation on the alginate, compare RGD-conjugated alginate and non-conjugated alginate. To do this, image the printed constructs using (4’, 6-Diamidino-2-Phenylindole, Dihydrochloride) (DAPI) and phalloidin stains.\n\t\nMake the phalloidins working solution by diluting 5 μl of the methanolic stock solution with 200 μl of DPBS++. Store at -20 °C until use.",
    "Make a 300 μM stock solution of the DAPI stain following the equation: (0.10509 g/L)/(350.3 g/mol)=3 × 10-4 M=0.0003 M=0.300 mM=300 μM. Make the DAPI working solution by diluting the stock solution 1:100 in DPBS++ to obtain 3 μM solution. Store at -20 °C until use.\nCompletely submerge the sample in  4% paraformaldehyde. Incubate for 1 hr at RT. Wash three times with DPBS++, allowing the solution to sit for 5 min each wash. Transfer the gel sample from the well to a glass slide, flipping the gel over in the process. Immerse the gel in 0.1% Triton X-100 (0.1 g/ 100 ml) in DPBS++ for 10 min. Wash three times with DPBS++, allowing 5 min for each wash.\nStain the printed constructs with phalloidin by immersing them in the working solution. Cover with foil and incubate for 4 hr. Remove the phalloidin stain and wash three times with DPBS++. The first wash should be fast, the latter washes should sit for 5 min each.\nStain the printed constructs with DAPI by immersing them in the DAPI working solution. Cover with foil and incubate at RT for 30 min. Wash three times with DPBS++, allowing each wash to sit for 5 min. Observe and image the samples on a confocal microscope system.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}