{
  "id": 18878,
  "origin_website": "Jove",
  "title": "Dried Blood Spot Collection of Health Biomarkers to Maximize Participation in Population Studies",
  "procedures": [
    "The following protocol has been approved by the applicable institutional review board and was conducted in accordance with the Declaration of Helsinki.\n1. Before Beginning: Standard Precautions \nEnsure all sample collection staff have passed the NIOSH required Blood Borne Pathogen (BBP) Training.\nEngineering Controls\nUse Food and Drug Administration approved sharps disposal containers to dispose of used sterile, single-use lancets. Use a properly labeled biowaste barrel for any other material that comes in contact with possibly infected material.\nDo not overfill the sharps container. Only fill a sharps container to 3/4 capacity before replacing the container to prevent injury. There is an indicator for compartmental fullness on every sharps container.\nOnly dispose of sharps in the sharps container. Do not use the sharps container for any other waste.\nDispose of any nonsharp material that comes in contact with potential BBP in a properly labeled biowaste barrel.\nPersonal Protective Equipment (PPE)\nAlways properly use PPE to protect against infection from BBP. PPE used during collection of DBS include gloves, lab coats, eye protection, long pants and closed-toed shoes.\nWear gloves to handle blood or anything that has contacted blood or other potentially infectious materials (OPIMs). Gloves should not be too tight nor too loose, as this may impede the process of \"milking\" (to be described later). Do not wear rings while collecting blood spots as they could puncture the glove.\nWear a lab coat to protect skin and clothing from blood and OPIMs. A lab coat that has come in contact with a BBP should be laundered in a 10% bleach/water solution prior to reuse. Regardless of exposure, the lab coat should be laundered regularly to keep it clean.\nWear closed-toed shoes to protect feet against possible contact with blood and OPIMs.",
    "If desired, wear goggles to protect against possible contact with blood and OPIMs due to splatter.\nTo maintain the cleanliness of a workspace, remove all PPE before leaving the work area to avoid contaminating items outside of the lab area.\nWork Practice Controls\nWash hands with soap and warm water for 20 sec before and after physical contact with each participant. Use a towel to turn off the running water. If a sink is not available, use a hand sanitizer of at least 60% alcohol.\nRegardless of the opportunity to wash hands, use alcohol hand sanitizer before applying and after removing gloves. Use enough sanitizer to cover all surfaces of both hands and rub hands together until dry. Do not rinse or wipe hands dry with a towel as this will reduce the efficacy of the sanitizer.\nDo not eat or drink or apply makeup or contact lenses in blood collection areas. Personal exposure to BBPs could occur through these paths that are direct routes to mucous membranes.\nDo not handle biohazardous material without gloves and do not handle nonhazardous material with gloves that have previously touched biohazardous material.\nProper Housekeeping\n\tGood housekeeping will continue to help protect against exposure to a BBP and will prevent cross-contaminating the environment.\n\t\nUse virucidal microbial disinfectant wipes to properly clean areas contaminated during DBS collection.\nKeep biohazardous or contaminated waste separate from ordinary trash; contaminated materials are those that have visible blood or OPIM on them.\nExposure Response\n\tIf exposed to a BBP, respond in the following way.\n\t\nWash the exposed area immediately and thoroughly with soap and water. Quick action can reduce the risk of infection.\nIdentify the source and route of the exposure to be able to explain the situation to the field supervisor and/or the responding physician.",
    "Notify the on-call supervisor immediately after the exposure occurs. It is emphasized to get support from a field supervisor to understand the level of risk for infection so it can be assessed if immediate medical attention is necessary. Guidelines laid out in specific Exposure Control Plans (ECPs) must be provided to all those that are in danger of being exposed to BBP.\n2. Setup of Collection Room and Materials \nSelect a sample collection location that is NOT intended for eating, such as a breakroom, and that is free of all unrelated project equipment. One does not want to be in an area that is crowded; it is important to have ease of movement. The following describes how to set up the dried blood-spot collection (lab) area.\nSet up the biohazard waste barrel and line the interior with a biohazard waste bag. The waste barrel should be accessible while seated.\nClean the collection area thoroughly with disinfecting wipes or similar product. Dispose of all material used to clean the lab area in the biohazard waste barrel. Wear gloves during this step to protect skin from exposure to harmful chemicals.\nReplace gloves and set up remaining collection supplies.\n\t\nPlace gloves and alcohol hand sanitizer on the collection table.\nPlace the sharps container within reach of the collector's chair. The sharps container should be handled with gloves at all times and then properly disposed of when full.\nPlace all remaining materials required for DBS collection on a protective underpad in the collection area. Include a filter paper collection card, a few lancets, alcohol pads, gauze pads, and Band-Aids, but not too many so the area is cluttered. Do not set up more than what might be used for each participant.\n3. DBS Sample Cellection",
    "Always wear PPE (lab coat, gloves, long pants, closed-toed shoes and if desired, safety glasses) during collection and place a protective underpad (chux) on lap to protect one's street clothes.\nPreparing the participant:\nAfter obtaining consent, ask the participant if he/she would prefer to use the left or right hand for collection and select a finger for collection. Avoid heavily calloused or damaged (lacerated) fingers and any ringed fingers. Typically the pinky and thumb are not selected so as to minimize participant pain and facilitate collection, respectively. The sides of the finger tips are used as the collection site for consistency and ease of collection.\nHave the participant rub their hands together to warm their hands and stimulate blood flow. A hand warmer may be used, or the participant may run their hands under warm water if a sink is available. Another technique to stimulate blood flow would be to have the participant alternately clench and relax the target hand, then rest fully prior to the fingerstick.\nClean the selected finger with an alcohol pad and allow it to fully dry. Repeat with a second alcohol pad to fully remove any contaminates or hand lotions. The finger must be completely dry before proceeding with the finger stick or the alcohol will contaminate the blood sample. As with all used collection materials, immediately dispose of the alcohol wipes in the biohazard waste container.\nPreparing the puncture site on the participant's finger:\nSecure the participant's arm to prevent movement during collection and to relax the arm and hand muscles. Rest the participant's elbow on the edge of the table or on their lap. Keep the participant's hand positioned comfortably below heart level and their muscles relaxed to facilitate blood flow.",
    "Grasp the chosen finger between thumb and index finger and gently milk the finger by slowly and firmly squeezing the finger while moving the grasp from palm to fingertip to pull blood towards the fingertip.\nPress the micro-lancet firmly against the participant's finger perpendicular to the fingerprint and discharge the lancet. Do not puncture the center of the finger or close to the nail bed; instead aim between those two points, on the ulnar side of the finger. Immediately dispose of the used lancet in the sharps container.\nCollecting the blood spots:\nWipe the first drop of blood away with a sterile gauze pad to remove the tissue fluid from the sample and immediately dispose of the gauze into the biohazard waste barrel.\nWhile maintaining the participant's hand below their heart with a downward angle, gently milk the hand starting at the wrist and work down to the base of the finger to produce blood. Do not just squeeze the finger, as this will reduce blood flow. Milk the finger until a large drop is hanging from the fingertip.\nCollect spots using the collection paper.\n\t\t\nCarefully position the collection paper below the finger and allow the drop to fall of its own weight. This allows collection of blood spots of maximum volume. If blood pools on the filter paper, i.e. \"beads\", gently tap the card to encourage blood to saturate into the paper.",
    "If the blood is too viscous or drops are too small to fall of their own weight, slowly bring the collection paper into contact with the blood drop to absorb the blood away from the finger via capillary action without touching the finger. If the finger touches the collection paper, move to another spot on the paper as that collection area has been compromised. The participant's finger should never touch the filter paper.\nDo not place blood drops on top of one another, even If a blood spot does not fill the collection circle.\nDo not let the blood run down the finger or onto the fingernail as this makes collection of large spots more difficult.\nIf the participant's blood clots any time during the collection process, ask permission to prick another finger; then clean and bandage the initial puncture site and start over if the request is accepted.\n\t\t\nTo prevent clotting, continue milking the participant's finger to keep the blood flowing or try firmly wiping the puncture with sterile gauze to disrupt clot formation.\n\t\t\tNote: Subsequent finger-sticks may be necessary for a few reasons: A cold room may cause more rapid clotting; also the viscosity of participants' blood may not be ideal, or poor milking techniques can also impact blood flow. Hand warmers, or warm running water, used prior to puncture can reverse the effect of a cold room.\nOnce the DBS have been collected, or if the participant does not want subsequent finger-sticks, clean the puncture site of any extraneous blood.\nBandage the puncture site to prevent potential contamination once the participant leaves the sample collection area.\nFI Quality Control (QC) assessment:",
    "Upon completing sample collection, assess the samples for quality. Ensure spots are 1) at least 0.375 in in diameter as measured from the back of the collection area; 2) adequately soaked through the collection paper so as to be of similar size on both sides of the filter paper, spots not meeting this criterion indicate collection via contact of the finger to the collection paper and likely smearing; 3) not in contact with one another (overlapping areas of spots are not assayable).\nCompleting the sample collection\nFollowing guidelines described in step 1.1, dispose of any remaining contaminated collection materials, including any items that may have been in contact with potentially infectious materials.\nStand the collection paper on a protective underpad to dry. Space the collection cards to allow good airflow between them. The minimum amount of time to air dry is 15 min, preferably at least 30 min. To allow maximum air flow, it is important to fold the back of the collection card in a way that it can stand freely and provide air flow behind the samples on the collection paper.\nWith all steps complete, remove PPE.\nResponse to a subject feeling faint or not well\n\tAlthough unlikely, a participant may become dizzy, lightheaded, or faint during or after the finger stick. Be alert for signs such as pallor, perspiration on the face and forehead, complaints of blurring vision, drooping or fluttering eyelids, or complaints of nausea. The onset of these symptoms is often sudden; sample collectors must be prepared to respond quickly if any of the symptoms are visible. If any of these symptoms are present at any point during the procedure, react according to the following procedures.\n\t\nIf a participant is feeling faint, lightheaded, dizzy, or shows any signs of fainting, take the following actions:",
    "Stop the procedure.\nTake care that the participant does not fall or become injured.\nCalmly reassure the participant and if necessary, ask the participant to bend at the waist and put his/her head between his/her legs. If mobility is limited and the participant can be moved, an adjacent cushioned location can be used to rest.\nHave the participant rest for 10 min.\nResume the procedure if the participant consents to continue.\nIf a participant faints, take the following actions:\n\t\t\nStop the procedure.\nTake care that the participant does not fall or become injured.\nHave the participant lie on his/her back as quickly as possible with feet elevated.  The participant will be instructed to lie down directly from the seated position without standing up.\nAsk the participant to loosen any tight clothing.\nHave the participant rest for 10 min.\nBlood spot collection should not continue.\nIf the participant does not respond after 1 min, call 911.\nBreaking down the lab area:\n\tOnce the collection of blood spots has been completed, the collection area must be broken down and the area decontaminated to make certain that passer-bys will not be infected by BBP. The blood collection area, the equipment containers, collection materials, and waste containers must be clean of BBP. As always, wear PPE when handling potentially infectious materials.\n\t\nRemove from the collection area and repack all uncontaminated materials.\nDispose of any remaining contaminated waste material into the biowaste barrel.\nClose the sharps container and store it in an area that provides protection from contamination. If the sharps container is 3/4 full, appropriately dispose of it and replace with a new sharps container.\nWipe the entire sample collection area with virucidal microbial disinfecting wipes.",
    "Once all biohazardous material has been disposed of, the biohazard bag can be autoclaved. When removing the bag from the waste barrel, be cautious to only touch the outside of the bag and to seal the bag tightly. It is also good practice to use virucidal microbial wipes to clean the exterior of all equipment to prevent cross-contamination.\n4. Training to Collect DBS\nVerify any dried blood spot collector is certified by a qualified individual before performing the procedure on patients or research subjects. Ensure collectors demonstrate respect for participants, confidence and proficiency in the use of PPE and of blood collection supplies, in the collection of spots of sufficient volume, and in completing the procedure in a timely and efficient manner, ideally in under 10 min.\n5. Sample Packaging and Storage\nEnsure DBS samples have dried for a minimum 15 min before they are bagged for storage, a saturated card may take 30 min or longer to adequately dry. Close the collection card cover, ensuring the sample is completely dry to prevent smearing and contaminating the sample.\nTake a biohazard specimen bag and place a desiccant pouch into the specimen bag. Place the DBS sample into the biohazard specimen bag. Always wear gloves when handling DBS samples. Do not allow the blood samples to touch the outside of the specimen bag.\nPlace each sample in its own biohazard sample bag with a desiccant packet. Flatten the bag to remove excess air and then seal the bag tightly. Place the bagged sample in a storage cooler for transport or temporary storage. Avoid elevated temperatures.\nFreeze or assay DBS samples within two weeks of collection, as DBS samples may be typically stored at room temperature for two weeks without significant degradation depending on analyte7,2.\n6. Sample Transportation and Shipment",
    "Unless known to contain infectious agents, ship dried blood spot samples as exempt human specimens under U.S. Department of Transportation regulations and in accordance with Part 2, Chapter 6, §6.3.2.3.6 of the International Civil Aviation Organization (ICAO) Technical Instructions8.\nIf frozen, ship samples overnight on dry ice with the requisite extra precautions for hazardous substances, or with gelpaks frozen to -80 °C. Ship on Monday-Wednesday to avoid thaw in transit due to delays or weekends/holidays, with confirmation from the receiving site that they are expecting and ready to receive and freeze samples.\n7. Quality Control Assessment\nFollowing collection and prior to assay (preferably prior to freezing in order to minimize the number of freeze-thaw cycles) assess samples for quality.\nInclude the following criteria in assessment of sample quality; proper packaging, color-coded desiccant remaining intact (dry), saturation of spots, size of spots, proper collection methods including spots not overlapping or smeared on card indicating contact with subject finger.\n8. Freezer Storage\nAlthough degradation times differ by analyte, freeze DBS samples within two weeks of collection for best results. Freeze samples with desiccant in a laboratory-grade freezer. As with any biological specimen, minimize freeze-thaw cycles, although some assays in DBS samples have shown no evidence of degradation in up to six freeze-thaw cycles9-11."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}