{
  "id": 18083,
  "origin_website": "Jove",
  "title": "Genetic Analysis of Hereditary Transthyretin Ala97Ser Related Amyloidosis",
  "procedures": [
    "The testing performed in the laboratory was carried out in accordance with the requirements of the Clinical Laboratory Improvement Amendments (CLIA) of 1988, the regulations approved by the Institutional Review Board of Chang Gung Memorial Hospital and University (License no. 100-4470A3 and 104-2462A3). Informed consent was obtained from all patients.\n1. Blood Specimen Collection\nCollect whole blood into commercially available EDTA-treated tubes. Mix gently and store blood sample at 4 °C until processing.\n2. DNA Extraction from Peripheral Blood\nUse a DNA Extraction Kit for the genomic DNA extraction (see Table of Materials).\nAdd 10 mL of Solution 1 to the 4.0 mL blood sample. Incubate the sample on ice for 10 min.\nCentrifuge the sample at 2,000 x g for 5 min at 4 °C. Remove and discard supernatant carefully. Resuspend the pellet in 3 mL of Solution 1.\nCentrifuge the sample at 2,000 x g for 5 min at 4 °C again and discard supernatant. Resuspend the pellet in 3 mL of Solution 2.\nAdd 10 µL of pronase stock solution (225 mg/mL) to get a final concentration of 100 µg/mL and mix well. Incubate at 37 °C overnight.\nChill the tube on ice for 10 min. Add 0.8 mL of Solution 3 to the sample and invert 3 - 5 times. Place sample on ice for 5 min.\nCentrifuge the sample at 3,000 x g for 15 min at 4 °C. Carefully transfer the supernatant to a 15 mL sterile conical centrifuge tube.\nAdd 6 µL of RNase stock solution (10 mg/mL) to get a final concentration of 20 µg/mL. Incubate at 37 °C for 15 min.",
    "Add 2.5 mL of isopropyl alcohol and mix thoroughly by gently inverting several times to precipitate DNA (strands of white, flocculent material will form). Using a large-bore pipet, transfer the DNA precipitant to a new 1.5 mL centrifuge tube.\nCentrifuge at 12,000 x g for 3 min at 4 °C. Discard supernatant carefully. Wash DNA pellet by adding 500 µL of 70% ethanol.\nCentrifuge at 12,000 x g for 1 min and discard supernatant. Air dry DNA pellet at room temperature. Add 100 µL of ddH2O and incubate at 65 °C for 15 min to resuspend DNA.\n3. Genomic DNA Quantification\nUse a spectrophotometer (see Table of Materials) to detect the quantity and quality of the genomic DNA.\nLog into the computer attached to the spectrophotometer machine. Open the software.\nInitialize the spectrophotometer machine:\n\t\nClick \"Nucleic Acid\" on the spectrophotometer software.\nClean the pedestal with a disposable paper wipe and purified water.\nBlank the spectrophotometer:\n\t\nLoad 2 µL of purified water on the pedestal.\nLower the upper arm of the spectrophotometer and click \"Blank\" to calibrate it.\nWhen it is done, lift the upper arm and dry the pedestal with a wipe.\nMeasure the sample:\n\t\nClick \"DNA-50\" on Sample Type.\nLoad 2 µL of DNA sample on the pedestal.\nLower the upper arm and click \"Measure\" to measure the A260/A280 ratio and the concentration of the sample.\nClean the pedestal in between each run with a wipe and purified water.\nClick \"Print Screen\" to collect the data.\n4. Genetic analyses of mutations\nAmplify the target DNA with the PCR4. Perform PCR in a 25 µL reaction mixture using a DNA Polymerase kit (see Table of Materials). Table 1 shows the TTR gene intronic primers.\ntable:\n﻿0,1\ngene,Primer sequence\nExon1,F: 5’-TCAGATTGGCAGGGATAAGC-3’  R: 5’-GCAAAGCTGGAAGGAGTCAC-3’\nExon2,F: 5’-TCTTGTTTCGCTCCAGATTTC-3’  R: 5’-TCTACCAAGTGAGGGGCAAA-3’\nExon3,F: 5’-GTGTTAGTTGGTGGGGGTGT-3’  R: 5’-TGAGTAAAACTGTGCATTTCCTG-3’",
    "Exon4,F: 5’-GACTTCCGGTGGTCAGTCAT-3’  R: 5’-GCGTTCTGCCCAGATACTTT-3’\nTable 1. TTR gene intronic primers. (NCBI Reference Sequence: NC_000018.10)\nAdd the reagents in Table 2 to a 0.2 mL PCR tube.\ntable:\n﻿0,1,2\nComponents,Volume (µL),Final concentration\n10x Buffer,2.5,1x\nMgCl2 (25 mM),1.5,1.5 mM\n360 GC Enhancer,1,-\n360 DNA Polymerase,0.2,2 U/reaction\ndNTP Mix (25 mM each),2,2 mM each\nPrimer F (10 µM),1,0.4 µM\nPrimer R (10 µM),1,0.4 µM\nDNA (100 ng),2,\nPCR-grade water,13.8,-\nTotal Volume,25,-\nTable 2. PCR reaction conditions.\nMix gently and briefly centrifuge on a benchtop centrifuge to collect all components to the bottom of the tube. Place tube in a thermocycler.\nPerform PCR for 30 cycles. Each cycle consists of a denaturation step for 30 s at 94 °C, primer annealing for 30 s at 58 °C, and polymerase extension for 45 s at 72 °C (see Table 3).\ntable:\n﻿0,1,2,3\nStep,Temperature (°C),Time,cycle\nInitial denaturation,95,5 min,1\nDNA denaturation step,94,30 s,30 cycles\nPrimer annealing step,58,30 s,30 cycles\nPolymerase extension step,72,45 s,30 cycles\nPost elongation step,72,10 min,1\nEnd of PCR cycling,4,Indefinite,\nTable 3. Cycling conditions for amplifying PCR products.\nValidate the PCR product by visualizing with gel electrophoresis:\n\t\nPrepare a 1.2% agarose gel:\n\t\t\nMix 1.2 g of agarose powder with 100 mL of 0.5x TBE in a microwavable flask. Microwave for 2 min until the agarose is completely dissolved. Cool down the agarose mixture to 55 °C.\nAdd 2 µL of a ethidium bromide solution (10 mg/mL) to the agarose mixture and mix gently. Pour the agarose mixture into a gel tray to about 5 - 7 mm, then add the comb(s) in place. Allow it to solidify (at least 30 min) and carefully remove comb(s).\nLoad samples and run an agarose gel:\n\t\t\nPlace gel and tray into the electrophoresis cell. Fill the electrophoresis cell with 0.5x TBE until the gel is covered.",
    "Carefully load 2 µL of a 100 bp DNA ladder (see Table of Materials) into the one lane of the gel as molecular size marker. Load dye/sample mixture (5 µL of PCR product mix with 1 µL 6x loading dye) into the additional lanes.\nTurn on the power supply. Run the gel for 25 min at 100 V.\nRemove the gel from the electrophoresis cell. Visualize the DNA fragments under UV light in an imaging system.\n5. DNA sequencing\nPurify PCR products using a commercial kit and sequence commercially or with an automatic sequencer (see Table of Materials).\nSubmit nucleotide sequences to the NCBI BLAST server to compare the nucleotide query to the nucleotide databases10. After the results are displayed, perform sequence alignments and identify the expected mutation.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}