{
  "id": 19772,
  "origin_website": "Wiley",
  "title": "Three-Dimensional Vessels-on-a-Chip Based on hiPSC-derived Vascular Endothelial and Smooth Muscle Cells",
  "procedures": [
    "This protocol provides a method for efficient derivation of hiPSC-VSMCs through NC intermediates. It has previously proven robust and reproducible across multiple independent hiPSC lines (Halaidych et al., 2019a[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-bib-0012]; Vila Cuenca et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-bib-0030]). VSMC differentiation from hiPSCs is divided into three steps (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0001]). The first step is seeding and culture of hiPSCs followed by NC induction for 12 days (Fig. 1A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0001]). The initial seeding density of hiPSCs is critical for the differentiation efficiency. NC formation is induced by combining the inhibitor of glycogen synthase kinase 3, CHIR99021, to activate canonical WNT signaling with basic fibroblast growth factor and activin/nodal inhibitor SB431542. On day 12 (passage 0, P0), the differentiation efficiency can be assessed by flow cytometry analysis for reduced expression of the pluripotency marker SOX2 and increased expression of the NC marker CD271 (Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-prot-0002]). The second step is the further differentiation and expansion of the hiPSC-NC cells (hiPSC-NCCs) from P0 to P3 for 8-11 days using the same (defined) medium used for differentiation. At P3, flow cytometry analysis should show a high total yield of CD271+ NC cells and high reproducibility across different lines and batches (Fig. 1B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0001]). At this stage, the cells can be cryopreserved and thawed for further differentiation to VSMCs. The third step is VSMC induction for 12 days (Fig. 1C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0001]). Both fresh and cryopreserved hiPSC-NCCs (P3) can be used to differentiate VSMCs. The initial seeding density of hiPSC-NCCs is important for a high differentiation yield. Differentiation to VSMCs is induced using PDGF-BB and TGF-β3 for 12 days. Ideally, hiPSC-VSMCs are cryopreserved on day 8 of VSMC induction to make a large batch of cells from the same differentiation batch that can be used over long periods in multiple experiments.",
    "Cryopreserved vials can later be thawed for further differentiation until day 12 (Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-prot-0003]) for use in functional assays and characterization (Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-prot-0002]).",
    "<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/1a949402-1422-4e1d-807c-140df39df98f/cpz1564-fig-0001-m.jpg</p>\nFigure 1\nTimeline of Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-prot-0001] and Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-prot-0002] with representative images at right. (A) Bright-field images of cellular morphology for the NC differentiation procedure (days 0, 4, 6, 8, and 12). Colony centers on day 8 are indicated with a white arrow before (day 8a) and after (8b) elimination by scraping. (B) Characterization of hiPSC-NCCs (P0 and P3) by flow cytometry analysis for an NC-specific marker (CD271) and a pluripotency-specific marker (SOX2). (C) Bright-field images of initial cell density and cellular morphology for VSMC differentiation procedure (days 0, 2, 6, and 8). (D) Immunofluorescence images showing fully differentiated hiPSC-VSMCs (day 12) (F-actin; red, CNN1; green, SM22; magenta, ACTA2; grey, DAPI; blue). Scale bars: 200 μm in all bright-field images, 100 μm in immunofluorescence images. hiPSCs, human induced pluripotent stem cells; NC, neural crest; NCC, neural crest cells; VSMC, vascular smooth muscle cell.\nMaterials\nVitronectin-coated 6-well plate (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0032])\nTeSR™-E8™ Kit for hESC/hiPSC (Stemcell Technologies, cat. no. 05990)\nHuman induced pluripotent stem cells (hiPSCs):\n               \nLUMC0054 (LU54, generated from kidney epithelial cells isolated from cells in urine, http://hpscreg.eu/cell-line/LUMCi001-A[href=http://hpscreg.eu/cell-line/LUMCi001-A]; Halaidych et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-bib-0011])\nAllen Cell Collection line AICS-0016 (ACTB-mEGFP, generated from skin fibroblasts, https://hpscreg.eu/cell-line/UCSFi001-A-3[href=https://hpscreg.eu/cell-line/UCSFi001-A-3]; Roberts et al., 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-bib-0025])\nGentle Cell Dissociation Reagent (GCDR; Stemcell Technologies, cat. no. 07174)\nCell Adhere™ dilution buffer (Stemcell Technologies, cat. no. 07183)\nDulbecco's modified Eagle's medium/nutrient mixture F-12 (DMEM/F12) medium (Gibco™; Thermo Fisher Scientific, cat. no. 31331028)\nMatrigel-coated 6-well plate (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0018])\nB(P)EL medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0003])\nNC differentiation medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0021])\nDulbecco's phosphate-buffered saline (DPBS; Life Technologies, cat. no. 14190)\nTrypLE™ Express Enzyme (1×), no phenol red; Gibco™, Thermo Fisher Scientific, cat. no. 12604021)\nCryoStor® CS10 cryopreservation medium (Stemcell Technologies, cat. no. 07930)\nGelatin-coated 6-well plate (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0016])\nVSMC differentiation medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0033])\n6-well suspension plate (Greiner Bio-One, cat. no. 657185)",
    "Tissue culture incubator, 37°C, 5% CO2\n28-cm cell scraper, blue (Greiner Bio-One, cat. no. 541070)\n15-ml tubes (Greiner Bio-One, cat. no. 188271)\nStereomicroscope (Leica MZ6 or equivalent)\n6-well culture plate (Greiner Bio-One, cat. no. 657160)\nCryovials (Greiner Bio-One, cat. no. 123263)\nMr. Frosty™ Freezing Container\nPassaging of hiPSCs for maintenance\nPassage cells once a week when hiPSC colonies become relatively big and start to contact each other (∼90% confluency).\n1. Prewarm a vitronectin-coated 6-well suspension plate, or freshly coat two wells of a 6-well suspension plate with vitronectin (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0006]). Prewarm TeSR-E8 to room temperature.\n2. Before beginning cell dissociation, remove regions of spontaneous differentiation by scraping them off with a 200-μl pipet tip. Aspirate TeSR-E8 containing differentiated parts of the culture.\nSpontaneous differentiation can emerge in the edges of hiPSC colonies and can be identified by their heterogeneous morphology. Removing these regions is only necessary if it is >5% of the hiPSC colonies.\n3. Add 1 ml GCDR to each well of a fresh 6-well plate and incubate 3-6 min at room temperature.\nThe timing of GCDR dissociation varies depending on the hiPSC line/clone. Determine adequate incubation time by visual inspection. A prolonged dissociation time may lead to cell detachment.\n4. Aspirate the GCDR and add 1 ml TeSR-E8 to each plate well. Gently detach cell colonies by scraping them with a cell scraper.\n5. Transfer cell aggregates into a 15-ml tube using a 1000-µl pipet tip. Pipet up and down gently once or twice with a 1000-µl pipet tip to break up large aggregates.\nIt is critical to break up large pieces of colonies to increase their adherence and survival after seeding.\n6. Wash the vitronectin-coated 6-well plate (from step 1) with 1 ml Cell Adhere dilution buffer per well and then add 2 ml TeSR-E8.",
    "7. Add the small aggregates from step 5 to each well at a split ratio of 1:20-1:40. Move the plate in a cross-like pattern to distribute cells evenly, and place it the incubator at 37°C and 5% CO2.\nIt is important to ensure that the cell suspension is well mixed in the tube. To do so, gently tap the bottom of the 15-ml tube before taking up the cell suspension from step 5.\n8. Refresh cells with 2 ml TeSR-E8 once a day starting 24 hr after passaging.\nA larger amount of TeSR-E8 can be added when the cells become relatively dense 5-6 days after passaging.\nPassaging of hiPSCs for NC differentiation (day –2)\nPassage hiPSCs when they reach 90% confluency, as with the passaging for maintenance above.\n9. Prewarm a Matrigel-coated 6-well plate, or freshly coat two wells of a 6-well plate (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0018]). Prewarm TeSR-E8 medium to room temperature.\n10. Dissociate hiPSC colonies as described in steps 3-5.\n11. Aspirate Matrigel and add 2 ml TeSR-E8 to each well of 6-well plate.\n12. Add 20-25 μl of cell suspension (step 10) to each well at a split ratio of 1:30-1:40. Distribute cells evenly by moving the plate in a cross-like pattern, and place it in the incubator at 37°C and 5% CO2.\nThe seeding density of hiPSCs is important for their differentiation efficiency with low-density cultures showing more differentiation. When hiPSCs are dissociated from a partially confluent well, a lower split ratio (1:20) is recommended.\n13. Refresh each well with 2 ml TeSR-E8 after 24 hr (day –1).\nDifferentiation of hiPSC-NCCs (from day 0 to 12)\nIMPORTANT NOTE: Always prewarm medium to room temperature and add growth factors to the medium right before refreshing cells. Replace the cells in the 37°C, 5% CO2 incubator after refreshing.",
    "14. NC induction: 48 hr after passaging (step 12), aspirate TeSR-E8 medium and add 2 ml NC differentiation medium in each well of the 6-well plate (day 0).\nPrior to NC induction, using 20-30 colonies ranging from 200 to 400 µm in size on day 0 is expected to result in efficient differentiation.\n15. Refresh each well with 2 ml NC differentiation medium every 2 days until day 12.\nAt days 5-7, differentiated NCCs will start to migrate from the colony edges as a monolayer.\n16. Gently remove the cells in the centers of initial colonies by scraping them with a 200-μl pipet tip (day 8 or 9). This can be done under a stereomicroscope.\nAs more cells migrate, mechanical elimination of the cells in the center of the colonies improves the purification of a neural crest population. Representative images of a single colony center on day 8 are shown in Figure 1A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0001] pointing to the site of elimination (day 8a), as well as showing the “empty” colony center after elimination (day 8b).\n17. After removing the cells in the center of the colonies, refresh each well with 2 ml NC differentiation medium (day 8 or 9). Refresh each well again 2 days after mechanical elimination (day 10 or 11).\n18. Passage the cells with a split ratio of 1:2 when they reach 80% confluency (day 12) for further differentiation and expansion following steps 19-25.\nThe yield of differentiation is expected to be 2-3 million hiPSC-NCCs in total on day 12 (P0). In this step, the differentiation efficiency of hiPSC-NCCs can be determined by flow cytometry (Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-prot-0002]). More than 50% of hiPSC-NCCs should be CD271+ on day 12 (P0); lower percentages will result in less efficient expansion during later steps.",
    "Differentiation and expansion of hiPSC-NCCs P0–P3 (from day 12 to day 20 or 23)\n19. Prewarm a Matrigel-coated 6-well plate, or freshly coat four wells of a 6-well plate (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0018]). Prewarm B(P)EL medium to room temperature and freshly add the growth factors to prepare NC differentiation medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0021]).\n20. Aspirate NC differentiation medium and add 2 ml DPBS to each well of a 6-well plate.\n21. Aspirate DPBS and add 0.5 ml TrypLE™ to each well. Incubate for 3 min at room temperature.\n22. Add 1.5 ml of B(P)EL to each well to dilute TrypLE. Transfer cell suspension to a 15-ml tube using a 1000-µl pipet tip. Pipet up and down gently once or twice with a 1000-µl pipet tip to break up the cell aggregates.\n23. Centrifuge the tube 3 min at 300 × g, room temperature. Aspirate the supernatant.\n24. Resuspend the cell pellet in freshly prepared 8 ml NC differentiation medium.\n25. Aspirate Matrigel from four wells of 6-well plate and add 2 ml hiPSC-NCCs from step 24 to each well (for a split ratio of 1:2). Distribute the cells evenly by moving the plate in a cross-like pattern, and place it in the incubator at 37°C and 5% CO2.\nThe cell monolayer is expected to be confluent in 3-4 days.\n26. Follow the same steps for passaging to P2 and to P3.\nAfter the first passage, cells start to proliferate more rapidly; therefore, the split ratio of passaging should be modified. For P2, use a split ratio of 1:4 or 1:5, and for P3, a split ratio of 1:5 or 1:6.\nThe yield of hiPSC-NCCs at P3 is expected to be 40-60 million cells total, with >90% being CD271+.",
    "Efficient induction of hiPSC-NCC differentiation can also be assessed by immunofluorescence staining and gene expression analysis (Halaidych et al., 2019a[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-bib-0012]). hiPSC-NCCs can be passaged up to P7.\nCryopreservation of hiPSC-NCCs P1-P3\nNOTE: It is best to cryopreserve hiPSC-NCCs at P1-P3 in order to create batches from the same differentiation.\n27. Prechill a Mr. FrostyTM Freezing Container to 4°C. Label cryovials and place on ice.\n28. Dissociate hiPSC-NCCs as described in steps 20-23.\n29. Resuspend the cell pellet in cold CryoStor® CS10 cryopreservation medium (1 ml per 20 cm2 growth surface). Transfer 500 µl of cell suspension to each cryovial (10 cm2 per cryovial).\nhiPSC-NCCs and CS10 cryopreservation medium should be kept on ice. Cryovials should be kept on ice during transferring the cells.\n30. Place all cryovials into a Mr. Frosty™ Freezing Container and leave at −80°C for 24 hr. Transfer all cryovials into liquid nitrogen for prolonged storage.\nDifferentiation at the scale described in this protocol should yield 80-120 vials that can be cryopreserved at P3 (500,000 cells per vial).\nDifferentiation of VSMCs from hiPSC-NCCs in 12 days (days 0-12)\nNOTE: VSMC differentiation steps can be followed by using either a cryopreserved vial or fresh hiPSC-NCCs at P3 from step 26.\n31. On day –1, prewarm a 0.1% gelatin-coated 6-well plate, or freshly coat two wells of a 6-well plate. Prewarm B(P)EL medium to room temperature and add the growth factors to prepare NC or VSMC differentiation medium.\n32. If using cryopreserved hiPSC-NCCs, remove cryovial (P3) from liquid nitrogen and thaw in a water bath at 37°C until only a small ice crystal remains. Transfer the cells into a 15-ml tube containing 5 ml B(P)EL. Wash cryovial once with 1 ml B(P)EL to collect remaining cells.",
    "The thawing procedure should be performed as quickly as possible. Move the cryovial in the water bath in a circle to thaw. Pipet cells gently to reduce mechanical stress.\n33. Gently homogenize the cell suspension with a 5-ml pipet and take a small aliquot to use in counting cells. Centrifuge the 15-ml tube 3 min at 300 × ɡ, room temperature. Aspirate supernatant.\n34. Resuspend the cell pellet in NC differentiation medium to reach 1.25 × 105 cells/ml.\n35. Aspirate gelatin from two wells of a 6-well plate and add 2 ml cell suspension to each well. Distribute the cells evenly by moving the plate in a cross-like pattern, and place it in the incubator at 37°C and 5% CO2 (day –1).\n36. At 24 hr after seeding, start VSMC differentiation. Refresh each well with 2 ml VSMC differentiation medium (day 0).\n24 hr after seeding (day 0), hiPSC-NCCs should have a density approximating that shown in Figure 1C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0001]. This is the optimal density to start VSMC differentiation.\n37. On day 2, refresh each well with 2 ml VSMC differentiation medium.\n38. Passage the cells at a split ratio of 1:4 (day 4). Prewarm 0.1% gelatin-coated 6-well suspension plates, or freshly coat eight wells.\n39. Aspirate VSMC differentiation medium and add 2 ml DPBS to each well of a 6-well plate.\n40. Aspirate DPBS and add 0.5 ml TrypLE™ to each well. Incubate 3 min at room temperature.\n41. Add 1.5 ml B(P)EL to each well to dilute TrypLE™. Transfer cell suspension to a 15-ml tube using a 1000-µl pipet tip. Pipet up and down gently once or twice with a 1000-µl pipet tip to dissociate the large aggregates.\n42. Centrifuge the tube 3 min at 300 × g, room temperature. Aspirate the supernatant.",
    "43. Resuspend the cell pellet in 16 ml VSMC differentiation medium.\n44. Aspirate gelatin from eight wells of 6-well suspension plates and add 2 ml cell suspension to each well (at a split ratio of 1:4). Distribute the cells evenly by moving the plates in a cross-like pattern, and place them in the incubator at 37°C and 5% CO2.\n45. On day 6, refresh each well with 2 ml VSMC differentiation medium.\nIt is best to cryopreserve VSMCs on day 8 to make a batch of cells from the same differentiation for multiple experiments. Cryovials can be thawed and further differentiated in VSMC differentiation medium until day 12 (Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-prot-0003], steps 1-6).\n46. Alternatively, on day 8, passage VSMCs as described in steps 39-44.\n47. On day 10, refresh each well with 2 ml VSMC differentiation medium.\nOn day 12, hiPSC-VSMCs are expected to be fully differentiated and ready for use in functional assays.\nCryopreservation of VSMCs (day 8)\n48. Prechill a Mr. FrostyTM Freezing Container to 4°C. Label cryovials from each differentiation and place on ice.\n49. Dissociate hiPSC-VSMCs as described in steps 39-42.\n50. Resuspend the cell pellet in cold CryoStor® CS10 cryopreservation medium to get a final concentration of 20 cm2/ml. Transfer 500 µl of cell suspension to each cryovial (10 cm2 per cryovial).\nhiPSC-VSMCs and CS10 cryopreservation medium should be kept on ice. Cryovials should be kept on ice during transfer of the cells.\n51. Place all cryovials in a Mr. Frosty™ Freezing Container and leave at −80°C for 24 hr. Then transfer all cryovials into liquid nitrogen for prolonged storage.",
    "This protocol describes characterization of hiPSC-NCCs and hiPSC-VSMCs. On day 12 of NC induction (P0), the efficiency of differentiation can be determined through flow cytometry by assessing the expression of pluripotency markers (e.g., SOX2) and NC markers (e.g., CD271). More than 50% of the cells should be CD271+ NCCs. The analysis should be repeated at P3 (day 20 or 23), when the total CD271+ yield is expected to be higher (>90%) and the expression of SOX2 lower than at P0 (Fig. 1B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0001]). hiPSC-NCCs at P3 can be cryopreserved and thawed for VSMC induction. On day 12 of VSMC induction, hiPSC-VSMCs are fully differentiated and ready for functional characterization. At this stage, hiPSC-VSMCs exhibit increased expression of contractile proteins calponin 1 (CNN1), α-smooth muscle actin (αSMA; ACTA2), and SM22 (TAGLN), which can be assessed by immunofluorescence staining (Fig. 1D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0001]).\nMaterials\nP3 hiPSC-NCCs (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-prot-0001], step 24)\nDulbecco's phosphate-buffered saline (DPBS; Life Technologies, cat. no. 14190)\nTrypLE™ Express Enzyme (1×), no phenol red (Gibco™; Thermo Fisher Scientific, cat. no. 12604021)\nFluorescence-activated cell sorting buffer (FACSB; see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0015])\nBD Cytofix/Cytoperm kit (BD Biosciences, cat. no. 554714)\nFluorescent-conjugated antibodies:\n               \nAnti-human CD271, BV421 conjugated (used at 1:100 dilution; BD Biosciences, cat. no. 562562)\nAnti-human SOX2, A488 conjugated (used at 1:50 dilution; eBiosciences, cat. no. 53-9811-80)\nDay 12 hiPSC-VSMCs (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-prot-0001], step 47, or Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-prot-0003], step 6)\nB(P)EL (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0003])\n4% (w/v) PFA (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0023])\n0.1% (v/v) Triton X-100 (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0030])\n1% (w/v) BSA in DPBS (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0004])\nPrimary antibodies:\n               \nAnti-human Calponin, Mouse (used at 1:200 dilution; Sigma-Aldrich, cat. no. C2687)\nAnti-human Smooth Muscle Actin 1A4, Mouse (used at 1:200 dilution; Sigma-Aldrich, cat. no. A2547)\nAnti-human SM22 (TAGLIN/Transgelin), Rabbit (used at 1:200 dilution; Abcam, cat. no. AB14106)\n100-μm sterile filters (CellTrics, cat. no. 04-004-2328)",
    "5-ml round-bottom FACS tube (BD Biosciences, cat. no. 352058)\nMACSQuant® VYB Flow Cytometer (Miltenyi Biotec, cat. no. 130-096-116)\nTissue culture incubator, 37°C, 5% CO2\n96-well plate\nFalcon® 96-well Black/Clear Imaging Microplate (Corning Life Sciences, cat. no. 353219)\nSealing film, 10 cm × 38 m (Parafilm M, cat. no. 291-1213)\nEVOS M7000 imaging system (Thermo Fisher Scientific, cat. no. AMF7000)\nCharacterization of hiPSC-NCCs by flow cytometry (P0 and P3)\n1. Aspirate NC differentiation medium from hiPSC-NCCs (P0 or P3) in 6-well plates and add 2 ml DPBS to each well.\n2. Aspirate DPBS and add 0.5 ml TrypLE™ to each well. Incubate 3 min at room temperature.\n3. Add 1 ml FACSB to each well to stop the dissociation, and wash the cells by pipetting up and down once or twice.\n4. Place a 100-μm CellTrics sterile filter on top of a 5-ml FACS tube. Transfer an aliquot of hiPSC-NCC suspension into a 5-ml FACS tube for analysis. Centrifuge the tube 3 min at 300 × g, room temperature.\n5. Wash the cell suspension with 1 ml FACSB and centrifuge the tube 3 min at 300 × g, room temperature. Aspirate the supernatant and leave around 50 µl FACSB with the cell pellet.\n6. Add fluorescent-conjugated FACS antibodies to the cell suspension to the desired working concentration in FACSB. Resuspend cells by flicking the bottom of the tube. Incubate in the dark for 60 min at 4°C.\nCD271 antibody is used for the characterization of NCCs. Details of the antibodies are given in the Materials list.\n7. Turn off the light of the cell culture hood. Wash the cell suspension with 1 ml FACSB and centrifuge the tube 3 min at 300 × g, room temperature.",
    "For intracellular staining, fixation and permeabilization steps are required, e.g., using the BD Cytofix/Cytoperm™ Fixation/Permeabilization Kit.\n8. Aspirate the supernatant but leave ∼50 μl in the tube. Add 250 μl Fixation/Permeabilization solution (from BD Cytofix/Cytoperm kit). Resuspend the cells by flicking the bottom of the tube. Incubate in the dark for 20 min at 4°C.\n9. Wash the cells once with 1 ml 1× BD Perm/Wash™ buffer (from kit) and centrifuge the tube 3 min at 300 × g, room temperature. Aspirate the supernatant but leave ∼50 μl in the tube.\n10. Add fluorescent-conjugated FACS antibodies to the cell suspension to the desired working concentration in 1× BD Perm/Wash™ buffer. Resuspend the cells by flicking the bottom of the tube. Incubate in the dark for 20 min at 4°C.\nIntracellular staining with SOX2 antibody is used to determine whether residual undifferentiated hiPSCs are present. Details of the antibodies are listed in the Materials section.\n11. Wash the cells once with 1 ml 1× BD Perm/Wash™ buffer and centrifuge the tube for 3 min at 300 × g, room temperature. Resuspend the cells in 1 ml 1× BD Perm/Wash™ buffer.\n12. Analyze the samples by flow cytometry immediately or the next day.\nWe used the MACSQuant VYB flow cytometer with the following instrument settings: Blue/488 FITC, A488: 525/50; yellow/561 PE: 586/15; APC: 661/20; APC-Cy7: 750LP. FlowJo software was used for data analysis.\nThe MACSQuant VYB laser setup may require compensation between PE and APC channels. Extra sample tubes are required for a compensation run before the analysis. Checking the setup and compensation procedure provided in the manual of the flow cytometer is recommended.\nSample data of Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-prot-0002] are shown in Figure 1B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0001].\nCharacterization of hiPSC-VSMCs using immunofluorescence staining",
    "13. Freshly coat the required number of wells of a 96-well Black/Clear Imaging Microplate with fibronectin (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0014]). Prewarm B(P)EL medium to room temperature.\n14. Dissociate hiPSC-VSMCs (day 12) as described in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-prot-0001], steps 39-42. Resuspend the cell pellet in B(P)EL to 7.5 × 104 cells per ml.\n15. Aspirate fibronectin and add 200 µl cell suspension to each well. Distribute the cells evenly by moving the plate in a cross-like pattern and place in the incubator at 37°C and 5% CO2.\n16. After 24 hr, aspirate B(P)EL and add 200 µl of 4% (w/v) PFA to each well to fix the cells. Incubate for 10 min at room temperature.\n17. Wash the cells three times with DPBS, 5 min per wash, at room temperature.\nThe fixed cells can be stored in DPBS for up to 2 weeks at 4˚C.\n18. Add 200 µl 0.1% (v/v) Triton-X 100 in DPBS to each well to permeabilize the cells. Incubate 5 min at room temperature.\n19. Add 200 µl 1% (w/v) BSA in DPBS to each well to block nonspecific sites. Incubate 1 hr at room temperature.\n20. Dilute the primary antibodies in 1% (w/v) BSA in DPBS and add it to the corresponding wells. Incubate overnight at 4°C.\nPrimary antibodies used for characterization of hiPSC-VSMCs include those for ACTA2, CNN1, and SM22. Details of the antibodies are given in the Materials list.\n21. Wash the cells three times with DPBS for 10 min per wash at room temperature.\n22. Dilute the secondary antibodies in 1% (w/v) BSA in DPBS and add to the corresponding wells. Incubate 2 hr at room temperature.\nThe selection of secondary antibodies can vary between users, and the dilutions should be empirically derived depending on the specific antibody, incubation time and temperature.",
    "23. Wash the cells three times with DPBS for 15 min per wash at room temperature. Seal the plates with Parafilm and store in the dark at 4°C until microscopic imaging.\nThe plates can be stored for prolonged periods in the cold and dark, although the highest quality images are obtained within 1-2 weeks.",
    "Vascular cells can be derived from hiPSCs using the protocols above and cryopreserved for further functional experiments. It is important to generate large batches of cells from the same differentiation for use in multiple VoC experiments. In this protocol, we describe how to prepare hiPSC vascular cells prior to VoC culture and functional assays. We previously described the cryopreservation of hiPSC-VSMCs on day 8 of differentiation. Cryopreserved hiPSC-VSMCs are thawed and cultured in VSMC differentiation medium for 4 days to reach the fully differentiated state (Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0002]). Additionally, hiPSC-ECs are produced efficiently and cryopreserved in their fully differentiated state in large batches using the robust protocol we reported previously (Orlova et al., 2014b[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-bib-0019]). hiPSC-ECs are thawed and expanded in Endothelial Cell Complete Growth Medium (EC-CGM) for 4 days. Both cell types reach >90% confluency after 4 days and are then ready to be integrated in the collagen lumenized scaffolds created following Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-prot-0004].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/a56992a2-260d-4bd9-beb9-0376ab174e12/cpz1564-fig-0002-m.jpg</p>\nFigure 2",
    "Timeline of Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-prot-0004] and Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-prot-0003] with representative images at right. (A) Bright-field images of cellular morphology and culture of thawed hiPSC-ECs (days 2 and 4) and hiPSC-VSMCs (days 10 and 12). (B) Images of microfluidic device fabrication procedure showing the SU-8 mold, cured PDMS (I), and assembled microfluidic device (II). (C) Final collagen I solution (pH ∼7.4; pink) in a tube (I) together with the patterned devices (II). Representative 2P-SHG image of collagen I showing the patterned 3D lumen scaffold (III) and collagen fibers inside the lumen (IV). (D) Representative immunofluorescence images showing the cell seeding procedure (day 0) for hiPSC-VSMCs (I and II) and hiPSC-ECs (III). The resulting 3D-engineered vessel is shown on day 1 (IV). hiPSC-VSMCs (ACTB; green) and hiPSC-ECs (mCherry; red). Scale bars: 100 μm in all bright-field images and 2P-SHG images, 200 μm in immunofluorescence images of cell seeding procedure. hiPSCs, human induced pluripotent stem cells; ECs, endothelial cells; VSMCs, vascular smooth muscle cells; PDMS, polydimethylsiloxane; 2P-SHG, 2-photon second harmonic generation.\nMaterials\nGelatin-coated 6-well plate (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0016])\nCryopreserved hiPSC-derived VSMCs on day 8 (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-prot-0001], step 51)\nB(P)EL (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0003])\nVSMC differentiation medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0033])\nCryopreserved hiPSC-derived ECs (Orlova et al., 2014b[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-bib-0019])\nEndothelial Cell Complete Growth Medium (EC-CGM; see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0011])\n6-well culture plate (Greiner Bio-One, cat. no. 657160)\n15-ml tubes (Greiner Bio-One, cat. no. 188271)\nTissue culture incubator, 37°C, 5% CO2\nFurther differentiation of hiPSC-VSMCs in 4 days (from day 8 to 12)\n1. Prewarm a 0.1% gelatin-coated 6-well plate, or freshly coat four wells of a 6-well plate. Prewarm B(P)EL to room temperature, and freshly add the growth factors to prepare VSMC differentiation medium.",
    "2. Thaw the cryopreserved vial from day 8 of differentiation in a water bath at 37°C by swirling the cryovial until only a small ice crystal remains.\n3. Transfer all cell suspension in the cryovial to a 15-ml tube containing 5 ml B(P)EL. Centrifuge 3 min at 300 × g, room temperature. Aspirate the supernatant.\n4. Resuspend the cell pellet in 8 ml VSMC differentiation medium.\n5. Aspirate 0.1% gelatin from four wells of the 6-well plate and add 2 ml cell suspension to each well (with a split ratio of 1:4). Distribute the cells evenly by moving the plate in a cross-like pattern and place the plates in the incubator at 37°C and 5% CO2 (day 8).\n6. Refresh each well with 2 ml VSMC differentiation medium (day 10).\nOn day 12 of differentiation, hiPSC-VSMCs are expected to become fully differentiated and should be >90% confluent with a yield of 700,000-800,000 cells per well.\nExpansion of hiPSC-ECs in 4 days (from day 0 to 4)\n7. Prewarm a 0.1% gelatin-coated 6-well plate, or freshly coat six wells of a 6-well plate (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0016]). Prewarm EC-SFM and EC-CGM to room temperature.\n8. Thaw the vial of cryopreserved cells in a water bath at 37°C by swirling the cryovial until only a small ice crystal remains.\n9. Transfer all cell suspension in the cryovial into a 15-ml tube containing 8 ml EC-SFM. Centrifuge 3 min at 300 × g, room temperature. Aspirate supernatant.\n10. Resuspend the cell pellet in 12 ml EC-CGM.\n11. Aspirate 0.1% gelatin and add 2 ml cell suspension to each well (with a split ratio of 1:6). Distribute the cells evenly by moving the plate in a cross-like pattern and place the plates in the incubator at 37°C and 5% CO2 (day 0).",
    "12. Refresh the cells with EC-CGM (day 3).\nOn day 4 of expansion, hiPSC-ECs should be >90% confluent with a yield of 250,000-300,000 cells per well.",
    "This protocol describes the generation of 3D-engineered vessels composed of hiPSC-ECs and hiPSC-VSMCs inside a PDMS microfluidic chip. The protocol is divided into three steps (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0002]). The first step is fabricating the devices by casting polydimethylsiloxane (PDMS) silicone elastomer on a customized SU-8 master mold using soft lithography. The master mold serves as a template to generate four straight microfluidic channels with fixed dimensions 0.5 mm (w) × 0.5 mm (h) × 10 mm (l) (Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0002] and 2I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0002]). After curing, PDMS is carefully peeled off, single devices are cut out, and the inlet/outlet ports of the microchannels are punched using biopsy puncher (1.2 mm) (Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0002], II[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0002]). To achieve watertight microfluidic channels, single devices are contact bonded with PDMS-coated coverslips and then treated with air plasma. Subsequently, the PDMS surface is functionalized by polydopamine (PDA) to promote the binding of collagen type I. The second step is patterning the lumens inside the collagen type I in the microfluidic channels using viscous finger patterning (VFP; de Graaf et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-bib-0008]), which is illustrated in Figure 3A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0003]. The success rate of the second step is >95% if the details outlined in the Critical Parameters are applied exactly. If necessary, 3D collagen scaffolds can be imaged at this point and analyzed using two-photon second-harmonic generation (2P-SHG; Fig. 2C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0002], III[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0002], and IV[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0002]). The last step is the sequential seeding of hiPSC-derived vascular cells into the collagen I lumen scaffolds, illustrated in Figure 3A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0003]. hiPSC-VSMCs and hiPSC-ECs are prepared as described in Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-prot-0003] (Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0002]) and subsequently seeded by injecting the cells into the lumen via the inlet port (Fig. 2D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0002], I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0002]-III[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0002]). After each seeding step, the devices are slowly rotated to promote even coverage of the lumen scaffold.",
    "On day 1, a confluent hiPSC-EC monolayer is formed that is surrounded by abluminal hiPSC-VSMCs (Fig. 2D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0002], IV[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0002]). Functional assays can be performed on day 2 or 3 after cell seeding. Continuous and controlled perfusion can be done upon connection to the microfluidic pumps. Structural analysis in 3D is performed following Support Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-prot-0005], which reveals cell-cell interactions in 3D (Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0004]). More details about expected results are described in the Understanding Results section.",
    "<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/105264aa-82c6-43f4-a2d6-a86c9e5302c1/cpz1564-fig-0003-m.jpg</p>\nFigure 3\nSchematic representation of collagen I patterning and cell seeding procedure. (A) VFP (I-IV) and cell seeding (V-VIII) protocols. (B) Left, correct handling practice for injecting cells via medium reservoirs (I) and for removing air bubbles from ports using gel-load filter tips (II). Right, examples of poor handling practice, showing the potential ways that air bubbles may be injected (III and IV). (C) Representative fluorescence images showing initial hiPSC-EC seeding density (day 0) for optimal density (I) and low seeding density (II) and the resulting hiPSC-EC barrier (day 1) for optimal density (III) and low density (IV). hiPSC-ECs (mCherry; red). Scale bars, 200 μm. VFP, viscous finger patterning; hiPSCs, human induced pluripotent stem cells; ECs, endothelial cells; VSMCs, vascular smooth muscle cells.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/36d0f0f6-bf79-4624-a119-7cc59f3fd079/cpz1564-fig-0004-m.jpg</p>\nFigure 4\nStructural characterization of 3D VoC model (Support Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-prot-0005]). Representative confocal images of 3D vessels (day 3) showing hiPSC-EC barrier (VE-cadherin; red) and surrounding hiPSC-VSMCs (SM22; green). A maximum projection of the halved z-stack was made to visualize the bottom layer of the 3D vessel (I, II, and III). 3D reconstruction of full z-stack shows the close interactions of hiPSC-ECs (VE-cadherin; red) and hiPSC-VSMCs (SM22; green) (IV and V). Scale bar, 100 μm. hiPSCs, human induced pluripotent stem cells; ECs, endothelial cells; VSMC, vascular smooth muscle cell.\nMaterials\nPolydimethylsiloxane (PDMS) SYLGARD™ 184 Silicone Elastomer Kit (Dow Corning, cat. no. 101697)\n2 mg/ml (w/v) poly(dopamine) (PDA; see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0026])\nDistilled water (dH2O; Gibco™; Thermo Fisher Scientific, cat. no. 15230089)\n5 mg/ml collagen type I, pH ∼7.4 (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0009])\nDulbecco's phosphate-buffered saline (DPBS; Life Technologies, cat. no. 14190)\nEndothelial Cell Growth Medium 2 Kit (EGM-2; Promocell, cat. no. C-22111; see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0013])\nDay 12 hiPSC-VSMCs (Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-prot-0003], step 6), derived from Allen Cell Collection hiPSC line AICS-0016 (ACTB-mEGFP, generated from skin fibroblasts, https://hpscreg.eu/cell-line/UCSFi001-A-3[href=https://hpscreg.eu/cell-line/UCSFi001-A-3])",
    "Day 4 hiPSC-ECs (Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-prot-0003], step 12), derived from NCRM1 hiPSC line (NIH Center for Regenerative Medicine hiPSC line, https://hpscreg.eu/cell-line/CRMi003-A[href=https://hpscreg.eu/cell-line/CRMi003-A]) engineered to express mCherry fluorescent protein under the control of the human cytomegalovirus (hCMV) early enhancer/chicken β-actin (CAG) promoter (de Graaf et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-bib-0008])\nTrypLE Express Enzyme (1×), no phenol red (Gibco™; Thermo Fisher Scientific, cat. no. 12604021)\nHuman VEGF (165) IS, premium grade (Miltenyi Biotec, cat. no. 130-109-386)\nVacuum desiccator (Fisher Scientific, cat. no. 467-0090)\nCustom-made SU-8 master-mold\nOven (80°C)\nRound cover glass, ø 35 mm #1 (Thermo Fisher Scientific, 11887902)\nLaurell WS-650HZ-23NPP/UD2 spin coater\nRazor blades (GEM Scientific, cat. no. 233-1094)\nHarris Uni-Core punch Ø: 1.2 mm plus cutting mat (Merck, cat. no. WHAWB100028)\n3M Scotch Magic Tape 810 (Lyreco, 3339099)\nCUTE Vacuum Plasma System 220-240V (Femto Science, serial no. FT20-045, cat. no. CUTE-1MPR)\nPetri dish (100 mm; Greiner Bio-One, cat. no. 664160)\nPressured nitrogen-gas flow\nCoolCLAVE Plus Ozone and UV Personal Sterilizer, 220V (Amsbio, E330220)\nLaminar-flow hood\nTissue culture incubator, 37°C, 5% CO2\nP10 pipet tips (Greiner Bio-One, cat. no. 741015)\nCut 10-μl pipet tips (7 mm; see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0010])\n1.5-ml reaction tube (Greiner Bio-One, cat. no. 616201)\nLuer-Lok™ 1-ml syringe (BD, cat. no. 309628), prechilled on ice\nPlastic needle, 20 AWG × 1.5 in., yellow (OK International Ltd., cat. no. TS20P-1-1/2PK), prechilled on ice\nElectronic multi-dispenser pipet (Multipette® E3; Eppendorf, cat. no. 4987000010)\nCombitips® advanced, Biopur®, 0.2 ml (Eppendorf, cat. no. 0030089626)\nForceps, blunt tip\nP1000 pipet tip (Greiner Bio-One, cat. no. 740295)\nMedium reservoirs for microchannels (cut 1000-μl pipet tip; see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0019])\n20-µl Gel-Load filter pipet tips (Greiner Bio-One, cat. no. 775288)\nGrant Instruments™ PTR-35 rotator (Fisher Scientific, cat. no. 11481068)\nFabrication of PDMS devices (day –2 or earlier)",
    "1. Mix PDMS elastomer base and curing agent thoroughly in a 10:1 ratio and degas in a vacuum desiccator at room temperature.\n2. Pour uncured PDMS mixture onto the SU-8 master mold to a thickness of ∼5 mm.\n3. Degas the PDMS until air bubbles are completely removed. Cure overnight in oven at 80°C.\n4. Coat the cover glasses with a thin layer of PDMS using a spin-coater (5 s at 1000 rpm, 30 s at 4000 rpm). Cure for at least 3 hr at 80°C.\n5. Cool the mold to room temperature. Remove PDMS carefully in a direction parallel to the microchannels.\n6. Cut out the individual chips using razor blades. Punch inlet and outlet ports at the opposite ends of the microchannels using a 1.2-mm biopsy punch. Clean the PDMS surface with 3M Scotch® tape and store dust-free.\nDust particles should be cleaned before contact bonding of PDMS.\n7. Place PDMS device (channel side up) and spin-coated cover glass (coated side up) in a vacuum plasma system. Treat the surfaces with air-plasma for 45 s at 50 W, 50 kHz.\n8. Immediately bond the air-plasma-treated surfaces by pressing gently and evenly with fingers. Avoid breaking the cover glass.\nOptionally, the devices can be placed in the 80°C oven shortly to enhance the bonding. However, heat accelerates the hydrophobic recovery of the PDMS. The equipment and settings indicated in this protocol are sufficient to create a permanent contact bonding; enhancement by heating is not necessary.\nAssembled devices can be stored dry and dust-free for up to 3 months at room temperature.\nSurface functionalization of the microfluidic channels to promote attachment of collagen I (day –2 or earlier)",
    "9. Inject 10 µl PDA solution into the microchannels. Incubate 1 hr at room temperature. Wash the microchannels thoroughly with dH2O in a Petri dish. Dry completely using pressured nitrogen-gas flow.\nThe PDA solution darkens in color over time. A lack of color change might indicate ineffective reaction. If incubated for too long, PDA can hinder the optical transparency of PDMS.\nPartially wet channels will fail to efficiently attach to the collagen gel.\n10. Sterilize the devices in CoolClave Ozone+UV chamber using the “UV” setting (30 min). The devices can be stored dry and in the dark up to 1 week at room temperature.\nPatterning of collagen I lumens using VFP technique (day –1)\nNOTE: Follow aseptic techniques under sterile laminar hood. Use sterilized microfluidic devices and pipet tips.\n11. Place 5 ml EGM-2 medium in a slightly opened 15-ml tube in the incubator at 37°C with 5% CO2 for at least 2 hr.\nEquilibrating the medium and devices inside the incubator prevents air bubbles emerging due to temperature differences.\n12. Insert a cut 10-μl pipet tip (7 mm) into the outlet port and an uncut 10-μl pipet tip into the inlet port of the microchannel. Press the tips lightly until they reach the coverslip.\n13. Prepare 5 mg/ml collagen I solution, pH ∼7.4 (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0008] ).",
    "Mix thoroughly until a homogeneous pink color is attained, indicating a near-neutral pH of ∼7.4 (Fig. 2C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0002] and 2I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0002]). The color of the solution is the indication of pH, as 10× M199, a solution component, is supplemented with phenol red. Care should be taken in this step, as the pH defines mechanical property of collagen fibers and is crucial for cell viability. This procedure is reproducible given that adequate quantities of the reagents were used and were well mixed. Final solutions in the alkaline range, pH > 7.5 (purple in color), should be discarded. If the final solution is in acidic range, pH < 7.4 (yellow in color), pH can be adjusted to ∼7.4 (pink in color) by slowly adding droplet(s) of 1 M NaOH.\nIf using collagen I stock solution from a different manufacturer, follow the instructions provided by the manufacturer.\n14. Spin down the collagen solution for 10 s to remove air bubbles. Immediately place the solution back on ice. Take up the collagen solution in a prechilled 1-ml syringe with a plastic needle.\n15. Immediately inject the collagen solution steadily into the microchannels via the uncut 10-μl pipet tip (inlet) until a meniscus forms on the cut 10-μl pipet tip (outlet). Add a 3-µl droplet of DPBS on top of the collagen I meniscus (outlet). Place the devices in the incubator at 37°C and 5% CO2 for 30 min to allow collagen polymerization.\nThis step should be performed as quickly as possible. Limit the number of microchannels to pattern in each round and discard the collagen gel after 5 min. The yield of patterning drops dramatically when the same collagen gel is used for a long time.",
    "We recommend using a multi-dispenser pipet to pattern several lumens at the same time. This way 24 microchannels can be patterned within 5 min. Alternatively, manual pipetting can be used and 12 channels can be patterned within 5 min.\n16. Add 50 µl equilibrated EGM-2 on top of the polymerized collagen via the uncut 10-μl pipet tip (inlet). Place the devices in the incubator at 37°C with 5% CO2.\n17. The next day, carefully remove the cut 10-μl pipet tip from the outlet port in a smooth twisting motion using blunt-tip forceps.\nIt is critical to remove the tips gently in a twisting motion to prevent the deformation of the patterned lumens.\n18. Insert a medium reservoir (cut 1000-μl pipet tip) into the outlet port, and add 20 µl of equilibrated EGM-2 to the medium reservoir using gel-load filter tips.\nCheck the ports of microchannels for air bubbles, which might emerge after removal of cut 10-μl pipet tips. Remove the air bubbles with gel-load filter tips as illustrated in Figure 3B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0003], II[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0003].\n19. Remove the uncut 10-μl pipet tip from the inlet port in a smooth twisting motion using blunt-tip forceps.\n20. Insert a medium reservoir into the inlet port and proceed to cell seeding.\nIt is advisable to use the patterned lumens for cell seeding the next day. Alternatively, the patterned lumens can be kept inside the incubator for up to 3 days before cell seeding.\nSeeding cells in 3D lumen scaffolds (day 0)\nIn the following steps, the confluent monolayers of hiPSC-VSMCs (from Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-prot-0003]; step 6) and hiPSC-ECs (from Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-prot-0003]; step 12) are dissociated sequentially.",
    "21. Prewarm B(P)EL and EC-SFM to room temperature. Place 5 ml EGM-2 in a slightly opened 15-ml tube in the incubator at 37°C with 5% CO2 and incubate at least 2 hr.\n22. Dissociate the monolayer of hiPSC-VSMCs in 6-well plate as described in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-prot-0001], steps 39-42.\n23. Resuspend the cell pellet in EGM-2 to obtain 2 × 106 cells/ml. Pipet the cell suspension up and down gently once or twice with a 200-µl pipet tip before injecting into each lumen.\nEnsure that the cell suspension is well mixed to achieve a consistent cell density between channels.\n24. Take up 10 µl of cell suspension in a 10-µl pipet tip. Insert the tip into the outlet medium reservoir with a light pressure.\n25. Inject the cell suspension slowly and steadily until equal levels are reached across medium reservoirs and flow stops.\nEnsure that there is no air trapped inside the pipet tip, as the collagen scaffold can be deformed by injection of air bubbles. See Figure 3B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0003] illustrating how to inject the cell suspension correctly via medium reservoirs (I), and the examples of poor handling practice causing injection of air bubbles (III and IV).\n26. Place the devices on a cell culture rotator (channel longitudinal axis in line with rotating axis). Rotate the devices for 1 hr at 1 rpm in the incubator at 37°C with 5% CO2.\n27. Add 25 µl EGM-2 to the outlet medium reservoir and 50 µl EGM-2 to the inlet medium reservoir.\n28. Dissociate hiPSC-ECs in 6-well plates from Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-prot-0003], step 12. Aspirate EC-CGM and add 2 ml DPBS to each well.\n29. Aspirate DPBS and add 0.5 ml TrypLE™ to each well. Incubate 3 min at room temperature.",
    "30. Add 1.5 ml of EC-SFM to each well to dilute TrypLE™. Transfer cell suspension to a 15-ml tube using a 1000-µl pipet tip. Pipet up and down gently once or twice.\n31. Count the cells and centrifuge 3 min at 1100 rpm (300 × g) at room temperature. Aspirate the supernatant.\n32. Resuspend the cell pellet in EGM-2 supplemented with 50 ng/ml VEGF to reach 1 × 107 cells/ml. Pipet the cell suspension up and down gently once or twice with a 200-µl pipet tip before injecting into each lumen.\nThe initial seeding density of ECs is critical for generating a confluent vessel barrier. Lower cell density results in gaps in the barrier (Fig. 3C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0003], II[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0003] and IV[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-fig-0003]).\n33. Remove any excess medium from medium reservoirs using a 10-µl pipet tip. Leave ∼10 µl medium in the reservoir to avoid injecting air bubbles.\n34. Take up 5 µl of hiPSC-EC suspension in a 10-µl pipet tip. Insert the tip into the outlet medium reservoir with a light pressure.\n35. Inject the cell suspension into microchannels as described in step 25.\n36. Place the devices on a cell culture rotator (channel longitudinal axis in line with rotating axis). Rotate the devices for 4 hr at 1 rpm inside the 37°C, 5% CO2 incubator.\n37. Add 25 µl EGM-2 supplemented with 50 ng/ml VEGF to the outlet medium reservoir and 50 µl to the inlet medium reservoir to create transient gravity-driven flow (day 0).\nRefresh the vessel lumens daily with EGM-2. The vessels can be used for functional assays or fixed on day 2 or 3.",
    "38. Remove 30 µl EGM-2 from each reservoir with 200-µl pipet tip. Add 25 µl EGM-2 to the outlet medium reservoir and 50 µl to the inlet medium reservoir to create transient gravity-driven flow (days 1-3).",
    "3D-engineered vessels generated following Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-prot-0004] can be characterized on day 2 or 3. Here we describe the structural characterization of the 3D vessels using immunofluorescence staining. The fixed vessels are first permeabilized for intracellular staining followed by blocking for at least 1 hr to avoid nonspecific binding of the primary antibody. In this protocol, we use primary antibodies against VE-cadherin to visualize the EC cell junctions, and against contractile protein SM22 to visualize VSMC cell morphology. The secondary antibodies should be selected considering the host and target species of primary antibodies. The selection of specific fluorophores can vary between users and dilutions should be derived from manufacturer's recommendations. The stained 3D vessels are compatible with high-resolution imaging using advanced microscopy.\nNOTE: Always follow the same sequence for adding solutions into the vessel lumens (Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-prot-0004], step 38).\nMaterials\n3D-engineered vessels (Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-prot-0004])\n4% (w/v) PFA (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0023])\n0.1% (v/v) Triton X-100 in DPBS (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0006])\n1% (w/v) BSA in DPBS (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.564#cpz1564-rec-0004])\nDulbecco's phosphate-buffered saline (DPBS; Life Technologies, cat. no. 14190)\nPrimary antibodies:\n               \nAnti-human VE-cadherin, Rabbit, 1:200 (Cell Signaling, cat. no. 2158S)\nAnti-human SM22 (TAGLIN/Transgelin), Rabbit, 1:200 (Abcam, cat. no. AB14106)\nParafilm sealing film, 10 cm × 38 m (Parafilm M, cat. no. 291-1213)\nLeica SP8 microscope, Dragonfly® spinning disk (Andor)\nImaris 9.5 software (Bitplane, Oxford Instruments)\n1. Aspirate EGM-2 from 3D vessels and add 4% (w/v) PFA to the medium reservoirs to fix the cells inside the lumens. Incubate 15 min at room temperature. Wash the lumens three times with DPBS, 10 min per wash, at room temperature.\nThe fixed vessels can be stored in DPBS for up to 2 weeks at 4°C in a Parafilm-sealed Petri dish. Prolonged storage increases the chance of evaporation and contamination.",
    "2. Add 0.1% (v/v) Triton-X 100 in DPBS to each lumen to permeabilize the cells. Incubate 15 min at room temperature.\n3. Add 1% (w/v) BSA in DPBS to each lumen to block nonspecific binding sites. Incubate 1 hr at room temperature.\n4. Dilute the primary antibodies in 1% (w/v) BSA in DPBS and add it to the corresponding lumens. Incubate overnight at 4°C.\nPrimary antibodies used for characterization of vascular barrier and cell-cell junctions include those for VE-Cad and SM22.\n5. Wash the lumens three times with DPBS, 15 min per wash, at room temperature.\n6. Dilute the secondary antibodies in 1% (w/v) BSA in DPBS and add to the corresponding lumens. Incubate 2 hr at room temperature.\nThe selection of secondary antibodies can vary between users, and the dilutions should be empirically determined depending on the specific antibody, incubation time, and temperature.\n7. Wash the lumens three times with DPBS, 15 min per wash, at room temperature. Store the devices at 4°C in a Parafilm-sealed Petri dish in the dark until microscopic imaging.\nThe devices can be stored for prolonged periods in the dark and cold, although the highest-quality images can be obtained within the first 1-2 weeks. The reservoirs should be checked monthly for DPBS levels and refreshed regularly to prevent drying."
  ],
  "subjectAreas": [
    "Human Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}