{
  "id": 10887,
  "origin_website": "Jove",
  "title": "Culturing Mouse Cardiac Valves in the Miniature Tissue Culture System",
  "procedures": [
    "This protocol follows the LUMC guidelines of the animal research ethics committee.\n1. Preparation of Instruments, Culture Medium, and MTCS\nNote: Perform all preparations in the laminar flow hood. The MTCS perfusion chamber, bubble trap and stand are described in Lieber et al., 201011.\nDisinfect the forceps and micro scissors with 70% ethanol. Prepare a 5 ml syringe with 21G needle with sterile Tyrode’s Buffer (130 mM NaCl, 5.4 mM KCl, 6.0 mM Hepes, 1.2 mM MgSO4, 1.2 mM KH2PO4, 20 mM Glucose, 1.5 mM CaCl2.2H2O, pH=7.2). Prepare a 5 ml syringe with 21G needle with sterile KCl solution (100 mM).\nPrepare 65 ml of medium per heart: DMEM supplemented with 10% Fetal Calf Serum, antibiotic/antimycotic (A/A; 100 units of penicillin,100 μg of streptomycin, and 0.25 ug of amphotericin B/ml), Insulin-Transferrin-Selenium (ITS; 10 μg/ml insulin, 5.5 μg/ml Transferrin, 6.7 ng/ml sodium selenite) and filter sterilize.\nSterilize the perfusion chamber and bubble trap by spraying with 70% ethanol and dry with paper towel. Assemble the MTCS (Figure 1D), however, initially without the perfusion chamber. Position the bubble trap on the stand. Use a peristaltic roller pump with easy-load pump heads.\n\t\nUsing silicon tubing make connections between the reservoir (50 ml tube) and the pump, the pump and the bubble trap, the bubble trap and reservoir (see Figure 1D). Make the tubing inside the incubator long enough to allow medium to reach gas equilibrium with the gas in the incubator through the gas permeable silicon tubing (1 m) and the tubing outside the incubator as short as possible.",
    "Fill the 50 ml tube with 70% ethanol, turn on the pump (flow speed around 1 ml/min to allow proper circulation) and let the ethanol circulate for 30 min to sterilize all tubing. Remove the ethanol by emptying the reservoir and pumping out the ethanol from the system.\nFill the 50 ml tube with sterile distilled water, turn on the pump and let the water circulate for 30 min to get rid of remaining ethanol. Remove the water by emptying the reservoir and pumping out the water from the system.\nFill the 50 ml tube with 45 ml of medium, put the stand in the incubator. Turn on the pump (flow speed around 1 ml/min) and circulate the medium to fill all tubing, remove all air bubbles and allow the medium to adapt to the gas composition in the incubator for at least 1 hr. Maintain the incubator at standard tissue-culture conditions (5% CO2 and 37 °C). Ensure that no bubbles are present in the tubing.\n2. Isolation of Mouse Heart\nInject the mouse with 500 units of Heparin. This will prevent the blood from clotting and allows the removal of blood from the heart. After 10 min, anesthetize the mouse in an induction chamber with 4% isoflurane using a precision vaporizer. The anesthesia is sufficient when the mouse is unresponsive to toe pinch.\nTransfer the mouse to a dissection board and maintain anesthesia by means of a facemask connected to a coaxial circuit. Disinfect the fur of the mouse with 70% alcohol. Using scissors open the abdominal cavity to expose the vena cava and diaphragm.",
    "To expose the heart, make lateral incisions starting from the last to the first ribs and reflect the thoracic cage over mouse’s head. Stop the anesthesia as mouse is not breathing anymore. Observe the heart beating.\nInsert the 21G needle attached to a 5 ml syringe containing sterile Tyrode’s Buffer into the inferior vena cava from the abdominal into the thoracic cavity (through diaphragm). Make sure that blood can exit from the vena cava caudal from the needle insertion. Perfuse the Tyrode’s Buffer gently and with constant pressure into the vena cava until the heart loses partly its red color. Note: The heart remains beating allowing the removal of the blood from the heart.\nReplace the needle with the 21G needle attached to a 5 ml syringe containing sterile KCl solution. Gently perfuse the KCl solution into the vena cava until the heart stops beating and remove the needle. Note: The KCl solution preserves the heart in the relaxed diastolic phase, which will allow easier insertion of the perfusion needles and perfusion of the coronary system.\nSlightly lift the heart using curved forceps and using scissors dissect the heart free from surrounding tissue but leave arteries and veins proximal to the heart intact and attached to the heart. Transfer the heart to a 15 ml tube containing ice-cold PBS supplemented with antibiotic/antimycotic (A/A). Store the heart in ice-cold PBS for up to 3 hr.\n3. Cannulation of the Mouse Hearts in the Perfusion Chamber\nPerform all procedures in laminar flow hood. Transfer the isolated heart from the 15 ml tube to a 10 cm Petri dish and add PBS supplemented with A/A.",
    "Under a dissecting microscope, use the micro scissor and forceps to remove all non-cardiac tissue but preserve the ascending aorta to at least the bifurcation with the brachiocephalic artery and the pulmonary veins, 2 mm proximal to the heart. Cut off the tip of the apex of the heart to create access to the left ventricular lumen (typically 2 mm). Place the perfusion chamber in the flow hood under the dissecting microscope.\nAttach a 5 ml syringe with medium to the insert needle using the silicone tubing. Fill the perfusion chamber with 20 ml medium and put the heart on the rotation stage in between the 2 blunted needles in the perfusion chamber (Figure 1). Adjust the height of the rotation stage so the heart is positioned in front of the needles.\n4. Ligation for Culturing the Mitral Valve (see Figure 1)\nLigate the aorta with suture (silk 7.0). Ligate the left atrial appendage with suture. Insert the needle (nr. 1 in Figure 1) through the pulmonary vein into the left atrium and ligate with suture proximal to its entry in the left atrium. Make sure the needle is not too far into the left atrium as this would damage the mitral valve.\nInsert the needle (nr.2 in Figure 1) with linear motion into the left ventricle. Transfer the medium from the perfusion chamber to a 50 ml tube. Seal the needle to the myocardium with biocompatible glue.\nAfter the glue has dried, carefully inject medium into heart by connecting a medium-filled syringe to needle nr.1 and check if there is any leakage. Ensure that medium exits from needle nr.2 and the last remaining blood is perfused out of the heart.\n5. Ligation for Culturing the Aortic Valve (see Figure 1)",
    "Insert the needle (nr.1 in Figure 1) in the aorta and ligate with suture. Make sure the needle is not too far into the aorta as this would damage the aortic valve. Insert the needle (nr.2 in Figure 1) with linear motion into the left ventricle. Transfer the medium from the perfusion chamber to a 50 ml tube. Seal the needle to the myocardium with biocompatible glue.\nAfter the glue has dried, carefully inject medium into the heart by connecting a medium-filled syringe to needle nr.2 and check if there is any leakage. Ensure that medium exits from needle nr.1 and the last remaining blood is perfused out of the heart.\n6. Place Perfusion Chamber on Stand\nFill up perfusion chamber with the 20 ml transferred medium. Place gasket and lid on the chamber and tighten with washer and screws.\nRemove the assembled MTCS from the incubator. Attach the perfusion chamber on the stand. Connect the tubing (see Figure 1D). Place the stand in the incubator (5% CO2 and 37 °C). Connect the tubing to the pump. Turn on the pump with flow speed around 600 μl/min.\nMake sure that in the reservoir and/or the bubble trap the level of the medium allows the visualizations of the presence of the flow by the falling of the incoming medium drops. After culture, the heart is removed from the system, fixed and processed for histological examination.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}