{
  "id": 10183,
  "origin_website": "Jove",
  "title": "Online Explorative Study on the Learning Uses of Virtual Reality Among Early Adopters",
  "procedures": [
    "The protocol was submitted to the Scientific and Ethical Committee of the Nebrija University, in which a group of external experts reviewed and validated the process. To be able to participate in the study, we required a written acceptance informed consent as recommended by the Declaration of Helsinki17, and it was made clear to the participants that they were not going to be involved in any experimental condition.\n1. Design of the research instrument\nDesign a first draft of the questionnaire to meet the goals of the study (see a sample draft of the questionnaire provided as Supplementary File 1).\n\tNOTE: The draft is created with Microsoft Word so it can be easily shared and modified. Questions included single, multiple, and open answers that were grouped in different thematic pages:\nPage 1: Accept a written informed consent obligatorily.\nPage 2: Demographic and social data of participants.\nPage 3: Descriptive information of previous VR experience as well as frequency of usage.\nPage 4: Subjective opinions and attitudes regarding VR.\nPage 5: Beliefs about the future of VR in education3.\nSend a draft to three social scientists and experts in technology that are external to the research team. The task of this committee is to review the experimental design, including ethical aspects and study design according to scientific guidelines. Also, they must validate the tool, considering aspects such as item comprehension (both questions and possible answers) in relation to the research goals.\nDesign a definitive version of the questionnaire (see Supplementary File 2), considering the suggestions made by the group of experts, so it can be submitted to a scientific and ethical committee along with a research report of the project.",
    "NOTE: We obtained a positive evaluation both in the scientific and ethical areas of the Nebrija University committee (see the positive evaluation of the Nebrija University committee provided as Supplementary File 3). Also, there was a follow-up of the entire research process conducted by the same committee.\n2. Adapting the questionnaire to the online specification of a secure server\nGo to the main page of the software as a service (SaaS) with a private server (see Table of Materials) as a registered user of the platform (a registration process that must be done previously by adding personal data) and select Create your survey from scratch (see Figure 1).\nimgsrc://cloudfront.jove.com/files/ftp_upload/60188/60188fig1.jpg\nFigure 1: How to create the questionnaire from scratch. (1) Click on New Survey icon; (2) Select Create Your Survey from Scratch. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/60188/60188fig1large.jpg]\nCreate several pages of the questionnaire with the questions as well as with possible answers through the SaaS with a private server.\n\tNOTE: In this step it is important to follow the recommendations received during the validation process by the group of experts. Also, in the instructions to the participants explain the question posed correctly and the type of answer (e.g., open, closed, one- or multiple-choice, etc.) that must be filled out (see Figure 2).\nimgsrc://cloudfront.jove.com/files/ftp_upload/60188/60188fig2.jpg\nFigure 2: How to design the questionnaire. (1) Edit the survey; (2) Add and configure pages and questions; (3–5) Develop pages, questions, and answers. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/60188/60188fig2large.jpg]",
    "Once the survey is created and saved (see the final questionnaire in Supplemental File 2), return to the main menu of the platform, select the questionnaire, and click on the icon Open | Close Public Survey to make it available to participants. After that, click on the icon Obtain a Link to the Survey, choosing one of several options by which participants will access the survey (e.g., a link embedded in an email or in a website, an iframe in a website, a pop up in a website, a link to computers of a call center, see Figure 3).\n\tNOTE: The criterion to develop the final tool were that (1) the questionnaire had to be completed with any electronic device with Internet access (e.g., tablets, personal computers, smartphones); (2) participants had to fill out the questionnaire just one time (to this end, the chosen system must be able to keep the information of users who have already participated by identifying the IP of the device that was used to access and complete the survey); (3) the selected system had to guarantee the anonymity of the participants at all times, allowing the data to be stored on a secure private server.\nimgsrc://cloudfront.jove.com/files/ftp_upload/60188/60188fig3.jpg\nFigure 3: How to obtain a link to the survey. (1) Open the survey; (2) Click on Obtain a Link to the Survey icon; (3) Select the chosen method. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/60188/60188fig3large.jpg]\n3. Sampling method\nGo to the internet portal as a registered user (registration that must be done before completing all the personal data) and create a thread in the VR forum to detail the study (see Table of Materials). Post a hyperlink to the survey hosted in the online private server (see Figure 4).\nimgsrc://cloudfront.jove.com/files/ftp_upload/60188/60188fig4.jpg",
    "Figure 4: How to launch a thread in the VR forum. (1) Click on the Sistemas VR icon; (2) Click on NUEVO HILO icon; (3,4) Write a post with the questionnaire link included. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/60188/60188fig4large.jpg]\nGo to the main page of the SaaS as a registered user of the platform, select the questionnaire created, and click on Results. On the pop-up menu, click on the icon Questionnaire to access the filled-out questionnaires directly. Eliminate all the incomplete or erroneous questionnaires through the SaaS (see Figure 5).\nimgsrc://cloudfront.jove.com/files/ftp_upload/60188/60188fig5.jpg\nFigure 5: How to eliminate all the incomplete or erroneous questionnaires. (1) Click on Results icon; (2) click on Export icon; (3) Eliminate all the incomplete or erroneous questionnaires. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/60188/60188fig5large.jpg]\nOnce the questionnaires reach the minimum number of participants (>100) after excluding incomplete questionnaires, go to the main page of the SaaS as a registered user of the platform, select the questionnaire, and click on the icon Open/Close Public Survey to finish the survey, so no one else can participate again (see step 1 in Figure 3 again).\n\tNOTE: The participants of this study were 117 VR users (21 females and 96 males) who owned a VR HMD (any available in Spain). Note that the final sample of 117 participants resulted from a screening and filtering of 578 questionnaires, of which we excluded many undelivered cases, as well as 36 questionnaires that were incomplete, without applying any other filter to the data. As for the mean age of the participants, μ = 36.91 years old with a standard deviation of σX = 6.39 (μ = 36.19 and σX = 7.50 for females, and μ = 37.07 and σX = 6.15 for males).",
    "4. Statistical analyses\nGo to the main page of the SaaS as a registered user of the platform, select the survey created and click on the icon Results. On the pop-up menu, click on Export and select the pop-up options of the report detailed (advanced spreadsheet format), in Text and with .csv extension (see Figure 6). Once the questionnaires are completed by the participants, export them to an email account in .csv format, so these can be kept in a safe, private, and protected place.\nimgsrc://cloudfront.jove.com/files/ftp_upload/60188/60188fig6.jpg\nFigure 6: How to export data to use in the statistical software package. (1) Click on Results icon; (2) Click on Questionnaires icon; (3) Select Text and csv in the Detailed option. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/60188/60188fig6large.jpg]\nOpen the statistical software (see Table of Materials) and select File Menu | Import Data | CSV Data. Select the.csv file previously saved. This process allows transformation of the anonymous data into the analysis format required by the statistical software package (see Figure 7).\nimgsrc://cloudfront.jove.com/files/ftp_upload/60188/60188fig7.jpg\nFigure 7: How to import data in the statistical software package. Select File Menu | Import Data | CSV Data. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/60188/60188fig7large.jpg]\nSelect the variables to analyze statistically (\"Gender\", \"Age\", \"Educational Qualification\", \"Current Direct Relationship with Formal Education\", \"Previous Experiences with Sophisticated VR HMD\", \"Level of the Private VR HMD\", \"Number of Years Using VR\", \"Usage Frequency\", \"VR Usage for Educational Purposes\", \"Interest in VR for Educational Purposes\", \"Optimism Regarding the Future Pedagogical Possibilities of Virtual Reality\" and \"Optimism Regarding the Future Pedagogical Possibilities of Virtual Reality\") and delete the rest of the information imported by the .sav file generated by the statistical software package.",
    "Assess the internal consistency of the questionnaire with the Alpha's Cronbach with the statistical software package. To this end, select the Analyze Menu | Scale | Reliability Analysis, and transfer all the variables to the Reliability Analysis dialogue box. Finally, click on the OK icon to generate the desired output (see Figure 8).\n\tNOTE: The questionnaire had a high reliability and internal consistency, measured through the Alpha's Cronbach (α = 0.826).\nimgsrc://cloudfront.jove.com/files/ftp_upload/60188/60188fig8.jpg\nFigure 8: How to assess the internal consistency of the questionnaire. Select Analyze Menu | Scale | Reliability Analysis. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/60188/60188fig8large.jpg]\nCarry out the descriptive analysis with the statistical software package. Explore descriptive statistics such as the arithmetic mean and the standard deviation for the quantitative variable \"Age\". Study frequency distribution in the rest of the variables. To carry this analysis out, select Analyze Menu | Descriptive Statistics | Frequencies and, after the output, Analyze | Descriptive Statistics | Descriptive (see Figure 9).\nimgsrc://cloudfront.jove.com/files/ftp_upload/60188/60188fig9.jpg\nFigure 9: How to carry out the descriptive analysis of the data. Select Analyze Menu | Descriptive Statistics | Frequencies and, after the output, Analyze | Descriptive Statistics | Descriptive. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/60188/60188fig9large.jpg]\nConduct One-Way ANOVA analysis with the statistical software package. To this end, select Analyze Menu | Compare Means | One-Way ANOVA, and in the One-Way ANOVA dialogue box put \"Age\" as the factor and the rest of the variables as dependent variables (see Figure 10).",
    "NOTE: This process should be done for each of the nominal (\"Gender\", \"Current Direct Relationship with Formal Education\", \"Previous Experiences with Sophisticated VR HMD\", \"VR Usage for Educational Purposes\", \"Interest in VR for Educational Purposes\", \"Optimism Regarding the Future Pedagogical Possibilities of Virtual Reality\", and \"Optimism Regarding the Future Pedagogical Possibilities of Virtual Reality\") and ordinal variables (\"Educational Qualification\", \"Level of the Private VR HMD\", \"Number of Years Using VR\", and \"Usage Frequency\"). The output shows the statistical significance of \"Age\" as a discrete quantitative variable by comparing means with the Snedecor's F distribution (non-considering equality of variances).\nimgsrc://cloudfront.jove.com/files/ftp_upload/60188/60188fig10.jpg\nFigure 10: How to conduct One-Way ANOVA analysis. Select Analyze Menu | Compare Means | One-Way ANOVA. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/60188/60188fig10large.jpg]\nConduct the Chi-squared test on contingency tables to test whether or not there is a relationship between the variables, and Somers' d to reflect the strength and direction of the associations. To this end, go to Analyze menu | Descriptive Statistics | Crosstabs and, in the Crosstabs dialogue box, click on Statistics and select options Chi-squared and Somers' d and click on Continue (see Figure 11).\nIn the Crosstabs dialogue box, transfer one of the nominal or ordinal variables as rows and the rest as columns. This process must be repeated for each of the variables in the rows, eliminating the ones already analyzed, to obtain all the correlations between them.\nimgsrc://cloudfront.jove.com/files/ftp_upload/60188/60188fig11.jpg\nFigure 11: How to conduct Chi-squared and Somers d test. (1) Select Analyze Menu | Descriptive Statistics | Crosstabs; (2) Select Chi-squared and Somers' d options. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/60188/60188fig11large.jpg]Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}