{
  "id": 17525,
  "origin_website": "Jove",
  "title": "An Intact Pericardium Ischemic Rodent Model",
  "procedures": [
    "Male and female C57BL/6J mice between 8-14 weeks of age were used for these experiments. This protocol has received ethical approval from the Animal Care Committee at the University of Calgary and follows all animal care guidelines.\n1. Mouse preparation and surgery\nSterilize surgical tools (via bead sterilizer or autoclave).\nWeigh mouse for presurgical weight and analgesic dose.\nPlace the mouse in an induction box with 4% isoflurane and 800 mL/min of oxygen. Confirm the anesthetic plane by pinching the toes and observing the animal for lack of reflex.\nInject analgesic subcutaneously (0.1 mg/kg of Buprenorphine) (see Table of Materials).\nPlace the mouse on a heated surgical pad during surgery and maintain anesthesia with 3% isoflurane delivered via nose cone. Apply ophthalmic ointment to avoid dry eyes to each eye.\nShave the hair from the chest and neck surgical areas.\nRestrain the paws of the mouse and position them on the surgical table.\nIntubate the mouse by inserting a smooth tipped 23 G catheter into the trachea through the mouth and the pharynx.\n\t\nVentilate the mouse following intubation with 2% isoflurane and 100% oxygen as a carrier gas using a commercial Ventilator (see Table of Materials) set at a rate of 110 breaths/min, a tidal volume of 250 µL, and positive end-expiratory pressure (PEEP) of 4 mmHg.\nRoll the mouse 30% on its right side to position the left side of the chest for surgery.\nClean the surgical area with 3 alternating scrubs of 70% ethanol and betadine in a circular motion(seeTable of Materials). Place sterile surgical drapes around the surgical area.",
    "Make a 2-3 cm lateral incision in the skin of the chest to visualize the pectoralis muscles on the left side. Cut the pectoralis major and minor using a 1 cm incision from the midline outward to visualize the intercostal muscles between the third and fourth ribs.\n\tNOTE: Care should be taken to avoid excess bleeding from the pectoralis muscle through cauterization of bleeding vessels.\nMake a 2 cm incision in the left intercostal muscle to introduce air (by passive air movement) into the chest cavity to allow the heart and lungs to fall away from the surgical incision. Further, expand the opening with the help of a cautery device (see Table of Materials) to incise the intercostal and prevent bleeding\n\tNOTE: The ventilator should be temporarily stopped during the period of cauterization to avoid explosive reactions with oxygen. Care is taken not to damage the pericardial sac.\nUsing retractors, retract the ribs to expose the heart.\nObserve the pericardium and the underlying heart under a stereomicroscope.\n\tNOTE: The mouse pericardium is thin enough to visualize the vasculature of the heart.\nGently place forceps on the surface of the pericardium to reduce its movement and that of the underlying heart.\nVisually landmark the left anterior descending (LAD) coronary artery by tracing its emergence from under the left appendage.\nUsing the micro-needle driver, guide an appropriate suture (see Table of Materials) through the pericardium, under the LAD, with the suture emerging on the other side of the LAD and pericardium. Tie the suture to restrict the blood flow through the coronary artery and trim the excess suture with the help of scissors (Figure 1A).",
    "NOTE: Upon restricting blood flow to the coronary artery, blanching of the anterior portion of the left ventricle should be visible. This procedure represents a permanent ligation model. However, a transient ligation approach with different ischemia periods could also be applied at this stage.\nBelow the incision site within the sterile area, introduce a 24 G catheter percutaneously into the chest (remove the guide needle after entering the chest cavity). Then, close the ribs followed by muscle layers and skin using an appropriate suture (a taper needle for muscle, conventional cutting needle for skin).\nOnce the chest is closed, evacuate the remaining air from the chest cavity via the 24 G catheter using gentle suction with a 3 mL syringe and chest compressions. Once the air is removed, withdraw the 24 G catheter.\nReduce the isoflurane to 1%.\nTurn off the isoflurane while maintaining ventilation with oxygen to allow the mouse to recover from anesthesia. Once the animal shows signs of breathing independently, remove the 23 G tracheal tube from the mouth and place the mouse in a recovery cage to be monitored for resumption of normal breathing.\nAllow the mouse to recover in the cage with a portion of the cage placed on a warming pad to provide an external heat source.\nProvide maintenance injections of analgesic (Buprenorphine 0.1 mg/kg, subcutaneously) every 12 h for 72 h post-surgery.\nMonitor the health status of mice daily for 7 days, which includes evaluating incisions and animal discomfort.\n\t​NOTE: Due to the invasiveness of this procedure (thoracotomy), the administration of antibiotics may be necessary.\n2. Functional assessment of cardiac function by echocardiography (ECG)\nInduce and maintain the mouse under general anesthesia with 1.5-2% isoflurane and 800 mL/min of oxygen.",
    "Place mouse in a supine position on a heated stage platform and attach the paws to the ECG leads.\nShave the chest of the mouse.\nAcquire echocardiography images using a 40 MHz linear transducer probe and contact gel and analyze with the appropriate software (see Table of Materials).\nTurn off the isoflurane and allow the mouse to recover on the heating platform before returning the cage to an active state.\n\t​NOTE: Echocardiography assessment is non-invasive and thus can be performed longitudinally throughout the experiment to determine changes before and after coronary ligation.\n3. Heart tissue collection for fibrosis staining\nSacrifice the mice with inhalation of 100% CO2 and carefully dissect out the heart.\n\tNOTE: Using scissors and forceps, this is achieved by cutting through the large vessels entering (vena cava, pulmonary vein) and exiting (pulmonary artery, aorta) the heart to release it from the circulatory system in the thoracic cavity.\nFix the heart in 10% formalin for at least 24 h.\nCut samples using a straight razor blade through the right ventricle, interventricular septum, and left ventricle, ensuring that the incision went through the center of the infarct zone. Samples are then sent to the core facility for paraffin embedding.\nCut tissue sections of 5 µm thickness with a microtome and place them on glass slides for staining.\nDeparaffinize using commercial xylene and graded alcohol washes (2x 99%, 1x 95%, 1x 70%) with deionized water, then rehydrate.\nStain with 0.1% Sirius red in picric acid for 2 h at room temperature.\nWash sections with 0.5% acetic acid for 3 min and rinse with 70% ethanol for 1 min.\nDehydrate the sections using the reverse order of washes outlined in 3.4, with increasing and graded ethanol concentrations then xylene.",
    "Mount tissue sections with a mounting solution (see Table of Materials) for microscopic evaluation.\n4. Flow cytometry of heart and pericardial cavity lavage\nSacrifice the mice with inhalation of 100% CO2 to effect.\nPlace the mouse on its back and fix the arms and legs to a surgical board using tape.\nCarefully open the left side (right side from the experimenter view) of the thoracic cavity, starting with cutting the diaphragm to about the midpoint and subsequently cutting through the outside ribs towards the sternum.\n\tNOTE: Avoid nicking large blood vessels, particularly those that run parallel to the sternum.\nRetract the ribs using a hemostat to expose the underlying heart and pericardium.\n\tNOTE: The pericardium is very fragile, so be sure not to catch it with scissors during the cutting.\nUsing a PE-10 tubing (see Table of Materials) catheter inserted into the pericardial space near the junction of the left atrium and left ventricle, inject 100 µL of sterile saline into the pericardial cavity.\n\t\nAllow saline to pool and collect from the posterior side of the heart, being careful not to puncture or tear the pericardium in the process. Repeat this step twice and place lavage fluid on ice while processing the heart.\nExcise the heart by cutting the major vessels (aorta, pulmonary artery, vein, and vena cava) entering and exiting the heart. Remove the right and left atria and weigh the ventricular heart tissue.\nMince the tissue in small 1 mm2 pieces using scissors and place in 10 mL of digestion buffer containing 450 U/mL of collagenase I, 125 U/mL of collagenase XI, 60 U/mL of DNase I, and 60 U/mL of hyaluronidase in PBS for 1 h at 37 °C on an orbital shaker.",
    "Pass heart tissue homogenates through a 70 µm cell strainer (see Table of Materials) and spin down at 60 x g for 5 min at 4 °C to remove cardiac parenchymal cells.\nCollect the supernatant, pass through a 40 µm cell strainer (see Table of Materials) for a single cell suspension, and spin down at 400 x g for 5 min at 4 °C to pellet the cells.\nPerform fragment crystallizable (Fc) receptor blocking and staining of cellular markers on pericardial and cardiac cells as previously described8.\nRun samples on a flow cytometer.\n5. Labeling pericardial macrophage using the Intercostal Approach to the Pleural Space (ICAPS) method9\nSterilize surgical tools (via bead sterilizer or autoclave) and spray 70% ethanol before commencing.\nInduce and maintain the mouse under general anesthesia with 1.5-2% isoflurane and 800 mL/min of oxygen. Confirm the anesthetic plane by pinching the toes and observing the animal for lack of reflex.\nInject analgesic subcutaneously (Buprenorphine 0.1 mg/Kg).\nPlace the mouse on a heated surgical pad during surgery.\nShave the right anterolateral thoracic area.\nClean the surgical area with ethanol and betadine.\nMake a 3 cm long incision in the skin, and with forceps expose the rib cage.\nLoad 5 µL of fluorescent beads (commercially available fluorescent microspheres, 1 µm, see Table of Materials) and 45 µL of saline into a PE-10 tubing syringe catheter with a beveled tip.\nGuide the catheter into the intercostal space as previously described9, slowly inject the bead solution and remove the catheter in one motion.\nClose the skin using staples.\n\tNOTE: Staples are used in place of sutures to minimize potential re-opening of the incision.\nTurn off the isoflurane, place the mouse in the recovery cage and monitor for complications over the first 24 h.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}