{
  "id": 11028,
  "origin_website": "Jove",
  "title": "Harmonic Nanoparticles for Regenerative Research",
  "procedures": [
    "1. Culture and Expansion of Human ESC\nPrepare the cell propagation medium (called PM) containing Knockout DMEM supplemented with 20% Knockout Serum, 1% MEM Non-Essential Amino Acids, 1% L-glutamine 200 mM, 1% penicillin-streptomycin, and 3.5 µl β-mercaptoethanol.\nThaw human ESC (hESC) in 8 ml PM medium and centrifuge them 5 min at 115 x g to discard DMSO-supplemented freezing medium.\nAdd 1 ml of PM medium containing 10 mM Rock inhibitor to prevent apoptosis and improve cell survival upon thawing (24 hr incubation only).\nAdd basic fibroblast growth factor (bFGF) to the PM at the desired concentration (4-10 ng/ml) for maintenance of pluripotency.\nPlate the hESC on irradiated human foreskin feeder cells (γHFF) (Figure 1A), previously plated at a concentration of 2 x 104 cells/cm2.\nChange medium daily and, when necessary, remove portions of colonies starting to differentiate by aspiration using an elongated sharply cut Pasteur pipette.\nOnce a week, passage colonies enzymatically:\n\t\nRemove medium and wash colonies with 2 ml PBS.\nRemove PBS and incubate them with 0.5 ml per well of warm collagenase IV at 1 mg/ml for 10 min at 37 °C, 5% CO2.\nCollect colony fragments in 2 ml new PM and centrifuge at 115 x g for 3 min.\nAlternatively, colonies can be passaged mechanically by scraping:\n\t\nRemove medium and wash colonies with 2 ml PBS.\nManually scrape colonies using the StemPro EZPassage roller scraper tool (Figure 1B).\nCollect colony fragments and centrifuge then for 3 min at 115 x g to remove the supernatant.\nPlate fragments on γHFF or process them for differentiation into embryoid bodies (EBs).\n2. Human ESC Differentiation Protocol\nPrepare the differentiation medium (DM) using Knockout DMEM supplemented with 2% Hyclone serum, 1.0% MEM Non-Essential Amino Acids, 1.0% L-glutamine 200 mM, 1% penicillin-streptomycin, 3.5 µl β-mercaptoethanol.",
    "Remove medium and wash colonies with 2 ml PBS.\nEB formation of colony fragments in suspension:\n\t\nRemove PBS and incubate them with 0.5 ml per well of warm collagenase IV at 1 mg/ml for 10 min at 37 °C, 5% CO2.\nCollect colony fragments in 2 ml new DM and centrifuge at 115 x g for 3 min.\nCulture them in suspension in ultra-low attachment 6-well plates (2 ml per well) for 4 days (Figure 1C).\nCollect and plate the newly formed EBs on 0.1% gelatin-coated 24-well plates (about 3 EBs/well) (Figure 1D).\nAlternatively, forced aggregation of single cells into EBs using the Aggrewell plate:\n\t\nRemove PBS and dissociate colonies into single cells using accutase (0.5 ml/well).\nCentrifuge and resuspend cells in DM at 1.2 x 106/ml.\nAdd 2 ml per Aggrewell chamber for 1 day (Figure 1B').\nCollect newly formed EBs (Figure 1C') and plate them on 0.1% gelatin-coated 24-well plates (about 3 EBs/well).\nChange DM every 2-3 days until the appearance of beating clusters of cardiomyocytes (15-30 days).\n3. Air-liquid 3D Cultures of Beating Clusters and Labeling with HNPs\nIdentify and manually dissect clusters of beating cardiomyocytes (Figure 1D), normally appearing after 2-4 weeks of culture, using an elongated sharply cut Pasteur pipette.\nDeposit 4 PTFE filters per insert that will be placed on a 6-well plate (Figure 1F).\nAdd 1 ml of DM medium on top of each well.\nAdd one dissected beating cluster on each PTFE filter (Figure 1E), maximum 4/well, i.e. 24 aggregates per plate (Figure 1F').\nChange DM medium every 2-3 days.\nTo label the clusters, remove the PTFE filter containing the beating cluster and put it on 3.5 cm glass bottom dish (170 µm thick).\nAdd 1 ml of HNP at a concentration of 50 µg/ml for 30 min.\n4. Non-linear Optical Imaging",
    "Sample preparation. After HNP labeling (see Step 3.6), transfer either whole differentiating early hEBs or cardiac beating clusters (dissected upon contraction appearance) on PTFE filters over a 170 µm thick glass-bottom dish compatible with the working distance of high numerical aperture objectives. Alternatively, apply a direct coating of beating clusters to the glass-bottom dish pre-coated with 0.1% gelatin.\nTransfer samples to an all-in-one microscope equipped with incubating chamber ensuring stable temperature, humidity and CO2 control over extended periods of time.\nAfter initial inspection, image the sample via wide-field imaging under white light illumination to identify structures of interest within differentiated EBs or active beating clusters that will be selected for further investigations.\nIf cell autofluorescence from NADH and SH from HNPs have to be simultaneously acquired, set a shorter laser excitation wavelength (i.e. 720 nm) to match the molecular absorption. Use one narrow band-pass spectral filter centered at half the excitation wavelength (i.e., λ = 360 ± 10 nm) to detect SH, and another one to detect autofluorescence.\nFirstly perform a fast, low resolution, three-dimensional scan to rebuild the overall morphology of the cardiac cluster and select an image plane within the cluster volume with several visible HNPs.\nIf necessary, change the excitation wavelength freely to best match the sample's optical properties or to avoid photobleaching, photo damage and to image deeper into tissues with an IR wavelength (i.e., 790 nm) and replace the second harmonic filter accordingly (i.e., 395 nm). Optimize the settings of the laser pulse pre-compressor at the working wavelength of choice by maximizing the second harmonic signal of HNPs deposited on the sample.\nTo monitor in real time the cardiac cluster contractions, set the microscope optical scanner in the fastest mode such as resonant mode, allowing high speed acquisition of two-dimensional images.",
    "Choose the settings as best compromise between image contrast and acquisition speed, such as:\n\t\nScan averaging: 4\nPixel dwell time: 0.1 µsec\nImage rate: 3.75 frames per sec (fps)\nLaser power is adjusted according to focal spot size and scanning speed. 50 mW (measured at the entrance of the objective) is a typical value for 0.1 µsec pixel dwell time and Plan APO 20X N.A. 0.75 objective preserving cell viability.\n5. Image Analysis\nAxial calibration procedure. Select a single HNP deposited on a bare substrate. Adjust the focus (i.e. the axial position of the nanoparticle) for maximizing the SH intensity. Vary in a controlled way the axial position of the microscope stage to obtain the calibration curve relating SH intensity as a function of the HNP offset from the focal plane. The output of this calibration procedure for the Plan APO 20X N.A. 0.75 objective is reported in Figure 4C.\nSelect HNPs present in all video frames and determine their periodic movements. This procedure can be easily automated, for example by a custom code seeking for signal maximum intensity spots in a defined region of interest and connecting them among different frames (an example code written in Matlab R2009 b using the function 'region props' of the Image Processing Toolbox is presented).\nAssess the quantification of the out-of-plane displacements, associated with non-continuously traceable HNPs moving along the optical axis, by converting their intensity modulations throughout different frames into axial displacement using the calibration curve established at Step 5.1. Note that this procedure gives access to axial movements but cannot be used to determine the absolute direction (upwards or downwards).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}