{
  "id": 8434,
  "origin_website": "Jove",
  "title": "Double Direct Injection of Blood into the Cisterna Magna as a Model of Subarachnoid Hemorrhage",
  "procedures": [
    "All procedures were performed under the supervision of H. Castel in accordance with the French Ethical Committee and guidelines of European Parliament Directive 2010/63/EU and the Council for the Protection of Animals Used for Scientific Purposes. This project was approved by the local CENOMEXA and the national ethic committees on animal research and testing. Male C57Bl/6J Rj mice (Janvier), aged 8–12 weeks, were housed under controlled standard environmental conditions: 22 °C ± 1 °C, 12 hours/12 hours light/dark cycle, and water and food available ad libitum.\n1. Setup of SAH surgery and preparation for injection\nBefore the beginning of surgery, pull an adequate number of glass capillaries by using a micropipette puller. The injection pipette should exhibit an inner diameter of 0.86 mm and outer diameter of 1.5 mm.\nPrepare the artificial cerebrospinal fluid (aCSF) for the sham condition.\n\t\nPrepare a solution with 119 mM NaCl, 2.5 mM KCl, 1 mM NaH2PO4, 1.3 mM MgCl2, 10 mM glucose, 26.2 mM NaHCO3 in H2O, pH 7.4.\nGas aCSF with 95% O2 and 5% CO2 for 15 min, and then add 2.5 mM CaCl2.\nSterilize the oxygenated aCSF with a 0.22 µm filter apparatus. The aCSF solution can be stable for 3-4 weeks at 4 °C. If contamination (solution becoming cloudy) or a deposit formation has appeared, discard and make fresh aCSF.\nCollection of blood from a homologous mouse donor\n\t\nIsolate the carotid artery along the trachea and collect the maximum amount of blood by puncture of the carotid artery.\nIn practice, place the mouse into an anesthesia chamber and load the chamber with 5% isoflurane until the animal loses consciousness.\nCheck the lack of reflexes by clamping one of two hind limbs to allow the setting of the surgical experimental procedure.",
    "Coat a 1 mL syringe with a heparin solution by using a 26 G needle (heparin sodium). This will prevent blood coagulation during the next steps.\nInstall the animal positioned in dorsal decubitus with legs apart, and the nose in an anesthesia mask (anesthesia maintenance with 2 to 2.5% isoflurane).\nIsolate the carotid artery along the trachea by dissecting the omohyoid muscle longitudinally. Once artery isolated, insert the needle towards the heart with the help of the microdissecting hook and forceps and collect the maximum of blood via puncture of the carotid artery (60 µL is needed per SAH mouse).\nSacrifice the anesthetized donor mouse immediately after blood collection by using cervical dislocation.\n2. Animal (8-10-week-old C57BL/6J male mice) preparation\nWeigh each mouse precisely using an electronic balance. In the current study, mice would have body weight within the range of 20 to 25 grams just before surgery.\nAs previously explained (see steps 1.3.2 and 1.3.3), induce anesthesia of mice to be operated.\nShave the neck and the space between the ears with a suitable electric clipper.\nInstall the animal positioned in ventral decubitus with legs apart and the nose in an anesthesia mask (anesthesia maintenance with 2 and 2.5% isoflurane) on a stereotactic frame.\nCheck that the mouse is sleeping and that his head is properly blocked.\nSubcutaneously inject 100 µL of buprenorphine (0.1 mg/kg) with a 26 G needle in the lower back, to avoid pain after awakening.\nPrevent dry eyes by using protective liquid gel and maintain an intrarectal temperature of 37 °C by using an auto-regulated electric blanket.\nTreat the posterior neck shaved area with an antiseptic solution (povidone-iodine or chlorhexidine by using a sterile cotton road).\nPre-sterilize all instruments touching the prepared skin/subcutaneous tissue (heating to 200 °C for 2 hours) and handle aseptically.",
    "3. SAH induction\nOn the first day (D-1)\n\t\nCut a 1 cm incision with thin scissors in the posterior neck, followed by the separation of muscles along the midline to access the cisterna magna.\nCut the tip of the empty glass pipette with thin scissors. Then, adapt to a syringe connected to a flexible silicone connector.\nTransfer 60 µL of blood or aCSF (for SAH or sham condition, respectively) in a 0.5 mL tube using a precision micropipette.\nSuck into the glass pipette the 60 µL of blood for the SAH condition or 60 µL of aCSF for the sham condition.\nFor injection, install the pipette on the stereotactic frame using a ring or blue-tack and slowly bring the pipette tip to the membrane at the interface with the cisterna magna.\nSlowly insert the pipette tip through the atlanto-occipital membrane into the cisterna magna, using a micro-manipulator of the stereotactic frame.\nConnect the pipette previously filled with blood or aCSF to the syringe ready for pressure induction.\nInject by pressing the plunger at a low rate around 10 µL/min, to avoid acute intracranial pressure.\nDuring injection, closely monitor the respiratory rate and the rectal temperature.\nAt the end of the injection, carefully take off the pipette via the micro-manipulator and visually ensure that there is no leak during withdrawal.\nAchieve hemostasis using an absorbable hemostat and run two sutures with braided non-absorbable suturing thread.\nImmediately after surgery, isolate and position the mouse in decline decubitus and cover it with a survival blanket in an open box for the duration of recovery.\nSecond day of induction (D0)\n\t\nAfter 24 hours, induce anesthesia (see steps 1.3.2 and 1.3.3). Subcutaneously inject 100 µL of buprenorphine again (0.1 mg/kg) and prevent dry eyes by using protective liquid gel (see steps 2.7 and 2.8).",
    "Install the animal on the stereotactic frame as the day before.\nCarefully remove the sutures with microscissors.\nPrepare the atlanto-occipital membrane as before and apply antiseptic preparation on the shaved area of the neck with a sterile cotton rod.\nInject 30 µL of blood or aCSF at a low rate (see steps 3.1.2 to 3.1.8). Monitor the respiratory rate and the rectal temperature.\nAt the end of the injection, carefully take off the pipette and control the absence of blood leak during withdrawal.\nAchieve hemostasis and run two sutures with braided absorbable suturing thread.\n4. Postoperative follow-up and end of the experiment\nImmediately after surgery, isolate and position the mouse in decline decubitus with a survival blanket on its back in an open box during recovery.\nWeigh and carefully observe daily the behavior of each mouse until sacrifice (e.g., D7 post-surgery).\nAmong humane endpoints, a significant weight loss (>15% of the weight) is classically noticed. A \"hunched back\" posture, slow movements, prostration, abnormal vocalizations of hurt and/or significant aggressive behavior are also important signs of animal suffering. If any of these signs or a combination of signs appears, the monitoring of the animal is reinforced within hours of their appearance. If the animal's welfare worsens or does not improve within 48 hours, it will be considered that a level of intolerable suffering is reached, and euthanasia is carried out.\nAt the time of choice, sacrifice anesthetized mice by decapitation, and harvest brains for further analyses.\nPerform euthanasia (decapitation) after isoflurane anesthesia (5%).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}