{
  "id": 14588,
  "origin_website": "Jove",
  "title": "The Crossmodal Congruency Task as a Means to Obtain an Objective Behavioral Measure in the Rubber Hand Illusion Paradigm",
  "procedures": [
    "1. Experimental Setup\nMaterial and Setup for the Rubber Hand Illusion Setup\nUse a box for the RHI paradigm which includes a cover for the participants own hand. Use a gown to also cover the shoulder and arm of the participant as well as the part of the rubber hand which goes up to the wrist.\nObtain an artificial hand. This hand does not necessarily have to be made out of rubber (the name 'rubber hand illusion' was given because a rubber hand was used in seminal work 7). For example prostheses can be used.\nUse two soft brushes to deliver brush strokes in the RHI.\nUse a metronome, a pre-recorded sound file or experimental software to provide timing signals for the experimenter who delivers the brush strokes.\nExperimental Setup - Material and Setup for the Crossmodal Congruency Task\nFor the crossmodal congruency task, use tactors to deliver tactile stimuli. For example small speakers, bone conductors (from hearing aids) or electromagnetic solenoid-type stimulators can be employed. Use 'dummy tactors' for the rubber hand.\nControl tactile stimulus delivery via the computer sound output, via an interface card or TTL pulses.\nFix the position of the speakers in the box.\nUse for example light emitting diodes (LEDs) to deliver visual stimuli. These can be controlled with TTL pulses from a computer parallel card and powered for example using an USB port or batteries.\nUse experimental software to program stimulus presentation.\nBlock any potential sound which could arise during the delivery of tactile stimuli. For example use headphones and white noise.\nRecord responses for example using a response box, a computer mouse or a keyboard.\n2. Participants",
    "All aspects of the experiment are in accord with the ethical standards laid down in the 1964 Declaration of Helsinki and have been approved by our local ethics committee (Macquarie University Human Research Ethics Committee, Australia).\nObtain written informed consent for participation prior to the start of the experiment.\nParticipants with visual or tactile deficits especially for the stimulated locations need to be excluded.\n3. Experimental Procedure\nEnsure that participants are sitting in a comfortable position.\nEnsure participants can see the rubber hand and not their own hand.\nInclude training blocks so participants become familiar with the crossmodal congruency task. Ideally first use practice trials without crossmodal visual stimuli in order to accustom participants to the tactile targets and then use practice trials with visual stimulus presentation and no-go trials (see below).\nOn each crossmodal congruency trial present one tactile stimulus and one visual stimulus to one of the locations, either in spatially congruent locations (same fingers) or incongruent locations (different fingers).\nInstruct participants to respond and discriminate the location of the tactile targets as fast as and as accurately as possible.\nLocate a fixation point between the lights which participants should fixate throughout the experiment.\nUse no-go trials in order to ensure that participants are looking at the stimuli. For example ask participants to withhold their response if the lights in both locations turn on at the same time. When participants regularly press a button during these trials, then this can indicate that they are not looking at the lights.\nUse supra-threshold stimuli and make sure participants can see/feel the stimuli.\nIntroduce a short delay (150-250 msec) between visuotactile crossmodal stimuli in order to reduce interference of these stimuli on the RHI itself.\nInclude sufficient number of congruent and incongruent trials for each condition (about 60-100 trials).",
    "Present congruent and incongruent trials in different locations in a randomized sequence.\nKeep in mind that response requirements and mappings might affect the CCE magnitude 24.\nIn order to induce the RHI use brush stroking for 1 to 3 min before the crossmodal congruency task and then stroke once before every crossmodal congruency trial.\nTo induce the RHI illusion use synchronous brush stroking, where both hands should be touched at the same time and in the same location.\nUse asynchronous stroking as a control condition, where both hands should be stroked with a temporal offset.\nMake sure the experimenter can comfortably perform the stroking.\nYou can also use RHI rating scales to monitor subjective experiences during the RHI paradigm. Some researcher suggest to use both objective and subjective measures for the rubber hand illusion paradigm for example 25. Obtain the rating responses after the task block if you would like to compare it to CCE effects because the task itself may modulate the RHI experience.\n4. Data Analysis\nTrials in which participants responded too soon (e.g. faster than 200 msec after stimulus onset) or too slow (e.g. later than 1,500 msec) should be discarded from the analysis: check for potential significant differences between conditions for number of discarded trials.\nAnalyze the number of false alarms in no-go trials: check for potential significant differences between conditions for number of false alarms.\nObtain the average or median for performance measures (response time for speed and response error for accuracy) for each participant and each condition.\nOnly use response times for correct trials.\nIt is also possible to combine response time and error to a single measure: Inverse Efficiency (IE) = Response time/Error 17.\nCalculate and depict crossmodal congruency effects = performance on incongruent minus congruent trials for every trial and condition.",
    "Use statistical tests in order to assess the statistical significance of condition differences (e.g. ANOVA, t-tests)."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}