{
  "id": 7480,
  "origin_website": "Bio",
  "title": "Induction of Acute or Disseminating Bacterial Pneumonia in Mice and Sampling of Infected Organs for Studying the Host Response to Bacterial Pneumonia",
  "procedures": [
    "Note: Perform all the procedures in a biosafety level 2 laboratory. Moreover, apply aseptic conditions during all procedures. Induction of acute pneumonia by P. aeruginosa and sampling of organsPreparation of P. aeruginosa inoculumTransfer one glass bead with P. aeruginosa PAK bacteria from a frozen stock into a flask with 50 mL of liquid LB medium and culture at 37°C overnight, in a bacterial incubator with agitation at 200 rpm.Transfer 1 mL of the overnight grown bacterial culture into 100 mL of fresh LB broth. Culture the bacteria at 37°C with agitation at 200 rpm for about 3 h. Measure the OD620nm using a spectrophotometer and place the bacterial culture on ice when the OD620nm reaches 0.5.Collect 100 mL of the bacteria into two 50 mL tubes and centrifugate at 4,000 × g for 10 min at 4°C, with brake of 5.Wash bacteria two times with cold sterile 0.9% saline and resuspend the bacterial pellet in 10 mL of 0.9% saline. Adjust the final volume of 0.9% saline if the OD620nm was not 0.5 according to formula: final volume (mL)= 10 × OD620/0.5.Dilute the bacteria 10-fold in cold saline to obtain a final concentration of 1 × 109 colony-forming units (CFU)/mL (i.e., 5 × 106 CFU/50 µL). Use the bacteria immediately after preparation, and keep bacteria on ice while transfering to the mice facility.To verify the bacterial concentration of the inoculum, take an aliquot of the inoculum and dilute 10-, 100- and 1000-fold in sterile 0.9% saline. Plate 50 µL of the dilutions on a blood agar (BA) plate using an L-shaped spreader and plate each dilution in triplicate. Culture overnight at 37°C and count the colonies on each plate.",
    "Calculate the actual bacterial concentration of the inoculum: average CFU of the 10-, 100- or 1,000-fold dilution multiplied by the dilution = CFU/50 µL = CFU/mouse.Other P. aeruginosa strains are prepared in a similar manner.Induction of pneumonia (Figure 1A)Anesthetize mice via inhalation of 2-3% isoflurane (carrier gas O2, 2 L/min) for around 2 min. Check if each mouse is properly anesthetized.Flip the mouse onto its back, place it in the palm of left hand and fixate the head gently between thumb and index finger. Hold the mouse at a 45° angle.Take 50 μL of the bacterial suspension with a 100 μL pipette. Put the tip close to one of the nostrils of the mouse. Slowly pipette inoculation onto the nostril and wait until the bacterial suspension is completely inhaled.After the liquid is inhaled, put the mouse back in the cage.Check that the mice recover from the procedure after several minutes.Note: When infection lasts for a short time period (i.e., less than 6 hours), wait for 3 min before infecting the next mouse, and mark all the mice to keep track of the order of mice that were infected. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4287/bioprotoc-12-01-4287-g001.jpgFigure 1. Schematic overview of the procedure for induction of acute pneumonia by P. aeruginosa and sampling of organs. A. Induction of acute pneumonia by infecting mice with 5 million P. aeruginosa via the airways. B. Sampling of organs. 1. Put a silk suture around the left bronchus just above the left lung lobe; 2. Collect bronchoalveolar lavage fluid (BALF) using a plastic IV cannula; 3. Perform a bronchial brush with a short roughened PE50 tubing. C-D. Sample processing and measurements. For detailed steps see procedure A.Sampling of organs (Figure 1B)Note: Perform all the procedure in a bio-safety cabinet. The sampling of all organs from each mouse will take around 3 min.",
    "When mice are infected for shorter than 6 h, mice need to be sacrificed in the same order and timing as during inoculation. At 2, 6, or 24 h after inoculation, mice are anesthetized by intraperitoneal injection with 200 µL of ketamine/dexmedetomidine solution.After complete sedation (usually takes about 3 min), place the animal on its back on a surgical plate, and spray 70% ethanol on the neck and belly to disinfect the skin.Collect blood via cardiopuncture using a 1 mL-syringe and 25 G needle.Open the thorax using forceps and scissors to expose the lungs and the trachea.Collect BALF from right lung lobes (Figure 1B1-2)To prevent lavage fluid from entering the left lung lobe, place a silk suture around the left bronchus just above the left lung lobe using a pair of forceps.Carefully cut a small hole on the upper part of the trachea using a small scissor. Take care not to damage the trachea any further.Carefully insert a plastic IV cannula needle (discard the metal inner needle) into the trachea, until the right branch of the airway. Ensure that the catheter is not inserted too far down into the trachea, to keep the integrity of the lung structure.Stabilize the catheter by tying the trachea around the catheter using a silk suture or with a pair of forceps.Connect a 1 mL syringe filled with 0.5 mL of cold and sterile PBS supplemented with 2 mM EDTA to the end of the plastic cannula.Carefully and slowly inject the solution into the lungs. After 1 min, slowly aspirate the solution while gently massaging the lung.Collect the liquid in a 2 mL tube and place on ice.Repeat Steps v and vii with another 0.5 mL of PBS-EDTA solutionPool the two lavage samples together and keep the BALF on ice until further processing.",
    "Collect lung brushes (Figure 1B3)Prepare bronchial brushes ahead of organ sampling. Cut PE50 tubing into 3 cm-long pieces. Roughen the surface of the tubing with sandpaper and treat the roughened tubing with RNaseZap. Dry the tubes by placing them in a UV-cleaner box for 30 min.Insert the short roughened PE50 tubing (bronchial brush) into the right main bronchus with gentle brushing (twisting) and immediately place the bronchial brush in a 2 mL Eppendorf tube containing 750 μL of RA1 buffer from the RNA isolation kit for RNA isolation.Vortex the tubes thoroughly and place on ice. Transfer to -80°C after returning to the laboratory and store until RNA isolation.Collect the left lung lobe. Carefully harvest the left lung lobe by cutting the left branch of the bronchia with a scissor, and place it in a pathology cassette. Fix the tissue by putting the pathology cassette into a container with freshly prepared 4% formaldehyde overnight, for histochemical analysis.Mouse cadavers are disposed according to national guidelines for disposal of (genetically modified) mice and pathogens.Sample processing and measurements (Figure 1C and 1D)Evaluation of bacterial burden in alveolar spacesUsing a P300 multichannel pipet, fill 64 wells of a 96-well U-bottom plate from columns 1 to 8 with sterile cold PBS (180 µL/well).Vortex BALF samples and add 20 μL of BALF fluid to 180 μL of PBS in the first column of the plate for a 10-fold serial dilution. Mix well by pipetting up and down for 10 times. Using a P50 multichannel pipet, transfer 20 μL of the first column to the second column containing 180 μL of PBS, and repeat the dilution steps up to 8 times.",
    "Using a P50 multichannel pipet, spot 50 μL of 4 diluents onto blood agar plates and immediately tilt the plate to a 45° angle to allow the fluid to flow about 3-4 cm long. Two plates will be needed for 8 dilutions from one BALF sample. Incubate the plates at 37°C overnight (or for 14 h), and count the colonies.Detection of soluble mediators in the alveolar compartmentTransfer 500 μL of BALF sample from each mouse to a new 1.5 mL Eppendorf tube and centrifuge the tube at 400 × g for 8 min at 4°C.Carefully transfer the BALF supernatant using a 1 mL pipette without touching the cell pellet into a new 1 mL microtubes, and store the BALF samples at -20°C until use. (See below for processing of the cell pellet).Inflammatory mediators [cytokines such as interleukin (IL)-1β, IL-6, Tumor necrosis factor (TNF)-α and chemokines such as chemokine (C-X-C motif) ligand (CXCL)-1, CXCL-2, CXCL-5, Chemokine (C-C motif) ligand 20], neutrophil degranulation products (myeloperoxidase and elastase) or other soluble mediators in the BALF can be detected by ELISALung damage indictors such as albumin and IgM in the BALF can be measured by ELISA. Total protein concentration in BALF can be measured by BCA.Detection of leukocyte influx by flow cytometryResuspend the cell pellet (from Step 4bii) with 1 mL of cold PBS and centrifuge at 400 × g for 8 min at 4°C. Discard the supernatant and repeat this step another time.Resuspend the cell pellet in 100 μL of cold PBS and stain the cells with an antibody cocktail for flow cytometric analysis (e.g., anti-Siglec-F and anti-CD11c for alveolar macrophages, anti-Ly6G and anti-CD11b for neutrophils, or anti-Ly6C and anti-CD11b for monocytes).",
    "After 30 min incubation at 4°C in the dark, wash the cells with cold PBS, centrifuge 500 × g for 5 min at 4°C, and resuspend in exactly 100 µL of PBS. Vigorously vortex the counting beads. Add exactly 10 μL of counting beads (10,000 beads) to each sample and mix thoroughly with a multichannel pipette. Analyze cells by flow cytometry. Populations of innate immune cells can be detected based on their surface markers; alveolar macrophages Siglec-F+CD11c+, neutrophils Ly6G+CD11b+, and monocytes, either Ly6G-CD11b+Ly6Chigh or Ly6G-CD11b+Ly6Clow. Acquire cells and a sufficient number of beads (e.g., 3,000-5,000 beads).Numbers of total BALF cells and of each of the cell populations can be calculated based on the numbers of counting beads used, and the proportion of cells and beads in the flow cytometric analysis.Detection of gene expression in airway epithelial cellsRNA is isolated from bronchial brushes with NucleoSpin columns RNA isolation kit according to the manufacturer's instructions[href=https://www.mn-net.com/media/pdf/b0/51/ee/Instruction-NucleoSpin-RNA.pdf].cDNA is then synthesized from RNA using MMLV reverse transcriptase according to the manufacturer’s instructions[href=https://www.promega.ca/-/media/files/resources/protocols/product-information-sheets/g/m-mlv-reverse-transcriptase-protocol.pdf?rev=9e0bafab791145b9928f4231d4b6eacf&sc_lang=en].RT-qPCR is performed for measuring the expression of epithelial cell specific genes (such as coding genes of chemokines and epithelial barrier proteins as described in Qin et al., 2021a and 2021b) that are important for lung innate immunity.Pathologic analysis of lung tissuesAfter overnight fixation in formalin, the lung lobe is embedded in paraffin.Sections of 4 µm thickness are cut on a microtome and stained with hematoxylin and eosin according to standard histological procedures (Fischer et al., 2008).Lung sections are scored by a pathologist blinded for treatment or genotype, as described (Meijer et al., 2021).Induction of disseminating pneumonia by K. pneumoniae and sampling of organsPreparation of K. pneumoniae inoculumTake one glass bead with K. pneumoniae bacteria from a frozen stock and transfer into a flask with 50 mL of liquid TSB medium.",
    "Culture the bacteria at 37°C for overnight in a bacterial incubator without shaking.Transfer 1 mL of the overnight grown bacterial culture into 100 mL of fresh warm TSB liquid medium. Culture the bacteria at 37°C for about 2.5 h until the OD620nm reaches 1.0.Transfer 10 mL of the bacterial culture into a 50 mL tubes and add 40 mL of cold sterile 0.9% saline. Centrifuge at 4,000 × g for 10 min at 4°C, with brake of 0.Carefully remove the supernatant from the ‘loose’ bacterial cell pellet. Wash the bacteria twice with cold saline, and resuspend the bacterial pellet with 10 mL of saline. Adjust the final volume of 0.9% saline if the OD620nm was not 1.0 according to the formula: final volume (mL) = 10 × OD620/1.0.Dilute the bacteria 2,000 times to the final concentration of 200,000 CFU/mL (i.e., 10,000 CFU/50 μL) in cold saline. Use the bacteria immediately after preparation, and keep bacteria on ice during transfer to the mice facility.To verify the bacterial concentration of the inoculum, take an aliquot of the inoculum, and dilute 10-, 100- and 1,000-fold in sterile 0.9% saline. Plate 50 µL of the dilutions on BA plates in triple and spread bacteria on agar surfaces with a disposable L-shaped spreader. Culture overnight at 37°C and count the colonies. Calculate the actual bacterial concentration of the inoculum.Induction of disseminating pneumonia (Figure 2A). The procedure is the same as described above in Step A2. Check for animal discomfort (overall behavior) every 12 h or more frequently to ensure that discomfort remains within the predefined humane endpoint.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4287/bioprotoc-12-01-4287-g002.jpgFigure 2. Schematic overview of the procedure for induction of disseminating pneumonia by K. pneumoniae and sampling of organs. A. Induction of pneumonia and pneumonia derived sepsis by infecting mice with 10,000 CFU of K. pneumoniae through the airway.",
    "B-C. Sampling and processing of organs (blood, lung, spleen, and liver). D. Measurements (pathological change in lung, liver, and spleen; bacterial burden in blood, lung, liver, and spleen; cytokine and chemokine production in blood, lung, liver, and spleen detected by ELISA). 4V saline: 4 volumes of saline; CLB: Cell lysis buffer.Sampling organs (Figure 2B)At 12, 24, or 42 h after inoculation, mice are anesthetized by intraperitoneal injection with 200 µL of ketamine/dexmedetomidine solution.After complete sedation (usually takes about 3 min), place the animal on its back on a surgical plate, and spray 70% ethanol on the neck and belly to disinfect the skin.Collect blood via cardiopuncture using a 1 mL-syringe and 25 G needle. Transfer 500 µL of blood into each heparin coated minicollect tube, gently shake, and place on ice. Around 700 µL of blood can be obtained from one mouse.Collect organ tissues:Open the abdomen and thorax using forceps and scissors to expose the lung, the liver, and the spleen.Collect right lung lobes, half of the spleen, and a small piece of liver; place them separately in three 4 mL polypropylene tubes, marked on the top with blue (lung), red (spleen), and green (liver) colors respectively, and mouse ID on the side of the tubes.Weigh the tissues (mg) and add 4 times the weight of cold PBS (in microliters). Verify that organs are on the bottom of the tubes submerged in PBS. Place the tubes on ice.Collect the left lung lobe, the remaining half of spleen and a small piece of liver and put in a pathology cassette marked with mouse ID. Transfer the pathology cassette into container with freshly prepared 4% formalin for pathologic (histology) analysis later.Alternatively, instead of pathology analysis, BALF and BALF cells can be collected as described above in procedure A.",
    "Sample processing and measurements (Figure 2C and 2D)Evaluation of bacterial burden in blood and organs:Homogenate organs with a homogenizer for 10 s at maximum speed. Immediately place homogenates on ice after the homogenizationClean the homogenizer after each homogenization by immersion of the tip in 50 mL tubes with 25 mL saline, 25 mL 70% alcohol, and 25 mL saline, respectively. Wash the tip in each solution for 10 s, and dry the homogenizer with tissues after the final wash with saline.Perform serial dilution of blood and homogenized organs, plating of samples on BA plates and growing of bacterial colonies as described in procedure A, paragraph 4ai-iii.Detection of soluble mediators in plasma and organ homogenatesCentrifuge blood samples at 3,000 × g for 10 min at 4°C. Carefully, collect the plasma with a 200 µL pipette and transfer it to micronic tubes (with mouse ID). Store plasma at -20°C until use.Dilute organ homogenates with the same volume of 2× CLB supplemented with protease inhibitor (using the concentration suggested by the manufacturer[href=https://www.sigmaaldrich.com/CA/en/product/roche/coro]), vortex vigorously at maximal speed for 5 s, and incubate for 30 min on ice. Centrifuge the tissue lysates at 3,000 × g, at 4°C for 10 min. Carefully collect the supernatants in micronic tubes (labeled with mouse ID), and store at -20°C until analysisInflammatory mediators (cytokines and chemokines) and neutrophil products (myeloperoxidase and elastase) in the plasma and tissue homogenates can be detected by CBA kit or commercial ELISAs.Markers of organ damage, including liver damage markers [alanine aminotransferase (ALT) and aspartate transaminase (AST)], kidney damage markers (blood urea and creatinine) and general damage [lactate dehydrogenase (LDH)] in the plasma of mice can be measured by routine clinical chemistry.Pathologic analysis of organs.For paraffin embedding, sectioning and histological staining, see procedure A paragraph 4e above.",
    "Pathological changes in lung, spleen and liver are scored by a pathologist blinded for treatment or genotype of the mice, as described (Meijer et al., 2021)."
  ],
  "subjectAreas": [
    "Microbiology",
    "Immunology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}