{
  "id": 8660,
  "origin_website": "Jove",
  "title": "Autoradiography as a Simple and Powerful Method for Visualization and Characterization of Pharmacological Targets",
  "procedures": [
    "All animal handling was performed in compliance with the guidelines from The Danish Animal Experimentation Inspectorate.\nNOTE: The protocol described here covers tissue preparation (i.e., mouse brain tissue), the in vitro autoradiographic assay in sufficient detail for setting up the method in a new lab, the exposure to phosphor imaging plates as well as subsequent densitometric analysis of autoradiograms (Figure 2) with the aim of localizing and quantifying radioligand binding in distinct anatomical structures. For histological comparison, a protocol for cresyl violet staining is included. Moreover, the determination of non-specific binding with a competing ligand is included within the protocol. For a detailed description on how to determine Kd, Bmax or Ki, see previous publication4.\n1. Tissue Preparation by Cryosectioning\nEuthanize the mouse by cervical dislocation and immediately dissect out the brain using scissors and forceps. Directly proceed to the next step to avoid tissue damage.\nSnap-freeze the tissue by submersion in powdered dry ice, gaseous CO2 or isopentane. Directly transfer the frozen tissue to a cryostat with the temperature set to -20 °C. Alternatively, store the tissue at -80 °C until processing.\n\tNOTE: Avoid repeated thawing/freezing to reduce tissue damage.\nLet the tissue acclimate to -20 °C in the cryostat for 20 min before further processing to avoid tissue shattering.\nCover the tissue holder with embedding medium outside the cryostat and quickly place the frozen tissue specimen in the desired orientation while the embedding medium is still liquid. For instance, place the mouse brain vertically onto cerebellum in order to achieve rostral coronal sections. Transfer the tissue holder back to the cryostat and expose the embedding medium to temperatures below -10 °C for hardening.\n\tNOTE: Fragile tissue specimen should be coated in embedding medium within the tissue molds prior to mounting.",
    "Position the tissue holder in the microtome of the cryostat. Adjust the orientation of the tissue to avoid sloped sections.\nCut the tissue with the guidance of a stereotaxic atlas18 in sections of desired thickness (12 µm recommended for [3H] labelled ligands). Carefully straighten and unfold the section with a brush of small size if necessary and thaw-mount the section onto a microscope slide. Sequentially collect the sections from the region of interest for desired technical replication (e.g., 4 sections per slide).\nAllow the sections on the slides to air-dry for 1 h before further handling.\n\tNOTE: Addition of desiccant material to slide boxes minimizes moisture build up on the tissue sections. Procotol can be paused here by storing sections long-term in slide boxes at -80 °C.\n2. In vitro Autoradiography\nCAUTION: Radioactivity. Work in a certified laboratory according to local regulations. Wear protective clothing. Dispose in accordance with radioactive decay or outsource to a certified company.\nThaw the sections for at least 30 min at room temperature (RT). Label the slides with experimental conditions. Use a pencil because the slides will be bathed in ethanol during subsequent staining.\nPlace the slides horizontally in plastic trays.\n\tNOTE: Positioning slides on an elevated platform within plastic trays facilitates their handling.\nPre-incubate the sections mounted on the slides in assay buffer adjusted to target in question (for GHB protocol, 50 mM KHPO4 buffer pH 6.0 is used) by carefully applying an appropriate volume onto the slide (700 µL for 3-4 rodent coronal sections).\n\tNOTE: Make sure that every section is covered completely with liquid.\n\t\nCover the plastic trays with a lid in order to avoid evaporation and pre-incubate at relevant temperature (for GHB protocol pre-incubate for 30 min at RT) under constant gentle (20 rpm) shaking on a plate shaker.",
    "For the determination of non-specific binding, supplement assay buffer with relevant concentration of unlabelled compound (for GHB protocol, 1 mM GHB).\n\t\tNOTE: Pre-incubation may not be necessary.\nPour off pre-incubation liquid from each slide and transfer the slides back to the plastic tray.\nTo avoid dehydration, immediately incubate the sections with relevant concentration of radioligand in assay buffer under desired conditions (for GHB protocol, 1 nM [3H]HOCPCA for 1 h at RT) by covering the sections completely with the radioligand solution (700 µL for 3-4 rodent coronal sections).\n\t\nIncubate under under constant gentle (20 rpm) shaking of plastic trays with closed lid.\n\t\tNOTE: The radioligand concentration can be validated by counting an aliquot in a liquid scintillation counter.\nRemove the incubation solution by pouring off the liquid and transfer the slides into a microscope slide rack. Immediately proceed to the next step to avoid section dehydration.\nWash the slides. For the GHB protocol, wash with ice-cold assay buffer twice for 20 s and then rinse twice by dipping the slide rack into the trays filled with ice-cold distilled water to remove salts. Position the slides vertically in racks for air-drying for at least 1 h at RT or dry the slides for 5 min with a blower set to cold temperature.\n\tNOTE: Washing must be optimized, e.g., extensive washing may be useful for decreasing non-specific binding.\nTransfer the slides to a fixator containing paraformaldehyde (PFA) powder for overnight fixation with PFA vapours at RT in order to protect the integrity of the ligand-target complex.\n\tCAUTION: PFA is toxic. Positionthe fixator in fume hood and avoid skin/eye contact with PFA.\nThe following day, transfer the slides to a desiccator box containing silica gel for 3 h at RT to eliminate moisture.\n3. Exposure to Phosphor Imaging Plates and Scanning",
    "Place the sections in a radiation-shielded imaging plate cassette with the tissue facing up. For subsequent quantification of radioligand binding, include a [3H]microscale in every cassette. Arrange the sections randomly and expose the sections for direct comparison in the same cassette.\nErase the tritium-sensitive phosphor imaging plate immediately before usage in order to remove accumulated signals from storage and to eliminate background signals. Therefore, load the plate into phosphor imaging machine and expose it to visible/infrared light according to the instructions of the manufacturer.\nRemove the plate from phosphor imaging machine and immediately place it onto the sections in the cassette. Make sure that the cassette is closed completely. Expose the sections to the phosphor imaging plate for 3 days at RT shielded from light.\nBecause light erases signal from the imaging plate, carefully open the cassette in the dark and immediately transfer the imaging plate into the dark box of a phosphor imager or place the phosphor imager in a dark room.\n\tNOTE: Make sure to notate the spatial arrangement of the slides during exposure in order to identify individual specimen on the digital image after analysis. Therefore, phosphor imaging plates also display one corner cut in a distinct angle in order to identify the correct orientation of the plate on the digital picture.\nScan the plate at the highest resolution possible to obtain a digital image.\n4. Optional: Cresyl Violet Staining of Tissue Sections\nPrepare 1% cresyl violet solution by mixing 5 g of cresyl violet acetate in 500 mL of deionized water (dH2O) until dissolved (approximately 2 h). Filter through a filter paper using a funnel into a new 500 mL bottle. Adjust pH to 3.5-3.8.\nPosition the slide staining set under fume hood. Prepare trays with the following solutions in white polypropylene trays (except for xylene):",
    "a. 50% ethanol/50% dH2O\n\tb. 70% ethanol/30% dH2O\n\tc. 100% ethanol\n\td. 100% ethanol\n\te. 100% dH2O\n\tf. 1% cresyl violet\n\tg. 0.07% acetic acid (add 175 µL of acetic acid to 250 mL of dH2O).\n\th. 100% xylene in green solvent-resistant trays\n\ti. 100% xylene in green solvent-resistant trays\nTransfer the slides to the fume hood and place them in a slide rack.\nDissolve the lipids through increasing graded series of ethanol in dH2O into 100% ethanol (tray a-d) by dipping the slides for 1 min.\nRehydrate the specimens to dH2O through descending concentrations of ethanol (tray a-d in reverse order, followed by tray e) by dipping the slides for 1 min.\nImmerse the specimens in cresyl violet solution for 10 min.\nRinse the specimens in 0.07% acetic acid by lifting the slides up and down gently for 4-8 s. Wash the slides by dipping in dH2O for 1 min.\nDehydrate the specimens by immersion of the slides for 30 s in ascending concentrations of ethanol (tray a-d).\nTransfer the specimens through two trays of 100% xylene (tray h and i) to quench the ethanol.\nRehydrate the specimens to dH2O through descending concentrations of ethanol (tray a-d in reverse order, followed by tray e) by dipping the slides for 1 min.\nRemove the slides from saline with forceps. Add a few drops of organic solvent mounting media per slide and add a 24 x 60 mm coverslip on top to protect specimens. Remove air bubbles between the specimen and coverslip by gently pressing onto the coverslip.\n\tNOTE: Keep the remaining slides in xylene during mounting to prevent drying.\nDry the slides overnight in a fume hood at RT.\nObtain a picture of specimen with a microscope and 1.25X objective.\n5. Densitometric Analysis of Digital Image",
    "Measure relative optical densities (RODs) of each calibration standard from the [3H]microscale with an image analysis software.\n\t\nSelect an area of equal size for each point of the [3H]microscale using a tool for Region creation from the menu item Region determination. Assign a number to each selected area by clicking on Number under the menu item Label.\nExport OD values for each point of the calibration standard by clicking File | Export | 2D region report. Transfer ROD values to a spreadsheet and normalize by the size of the selected area. Perform linear regression to obtain a standard curve for further densitometric analysis.\n\t\tNOTE: Make sure that the selected areas are labelled in order to identify matching ROD values and samples.\nPerform quantification of autoradiograms using the proprietary imaging software by selecting the region of interest (ROI) using a Region creation tool in every section and measuring its ODs. Select the same region in every section by creating a template for the region of interest, which is copied and manually adjusted to minor variations in brain anatomy for each autoradiogram. Identify the anatomy of the ROI by comparison of autoradiograms with a brain atlas18. When multiple treatments are compared, perform the analysis blinded and randomized in order to avoid biased selection of ROIs.\nExport ROD values and sizes of selected areas into a spreadsheet by clicking File | Export | 2D region report.\nDivide the measured ROD of the selected ROI by its area to obtain the density per specific area.\nMeasure the ROD of the background of the plate and export corresponding ROD values and area size into a spreadsheet. Subtract the average background signal from every ROD value of each ROI.\nAverage the RODs of technical replicates, i.e., section replicates using tissue from the same animal.",
    "Use the standard curve to convert RODs into units of radioligand binding, i.e., nCi/mg tissue equivalents (TE).\n\tNOTE: The term TE is used because standards are generated with materials simulating tissue.\nExpress binding by conversion of nCi/mg to nmol/mg TE according to the specific activity of the radioligand (Equation 1).\nimgsrc://cloudfront.jove.com/files/ftp_upload/58879/58879eq1v2.jpg (1)\nTo obtain specific binding values, subtract non-specific binding from total binding.\nAverage the binding of every biological replicate by using the average of the technical replicates of each animal (obtained in Step 5.6).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}