{
  "id": 11796,
  "origin_website": "Jove",
  "title": "Non-Invasive Ultrasound Assessment of Endometrial Cancer Progression in Pax8-Directed Deletion of the Tumor Suppressors Arid1a and Pten in Mice",
  "procedures": [
    "All procedures and experiments involving mice were performed according to protocols approved by Johns Hopkins Animal Care and Use Committee. For all procedures, appropriate PPE was worn, including gloves and disposable isolation gowns. Precautions were taken when handling sharps, which were properly disposed of in red box sharps containers immediately after use. See the Table of Materials for details about all the materials and equipment used in this protocol.\n1. Induction of endometrial cancer in iPAD (inducible Pten, Arid1a double deletion) mice with doxycycline\nMaintain 10 Pax8-Cre-Arid1a-Pten double deletion (iPAD) transgenic mice (Figure 1) on a mixed genetic background (129S, BALB/C, C57BL/6), as previously described14.\nCollect baseline ultrasound (2D) images of the ovaries, oviduct, and uterus of each mouse before doxycycline treatment.\nProvide exclusively doxycycline-containing mouse chow diets (doxycycline hyclate at 625 mg/kg of feed) to the female iPAD mice for a minimum of 2 weeks starting at 7-8 weeks of age to induce gene deletion.\n2. Equipment setup\nTurn on the heating pad, and cover with a clean absorbent pad (target temperature: 38 °C).\nConfirm that the isoflurane vaporizer and O2 tank are adequately filled. Refill and replace if the contents are low.\nConnect the induction chamber, nose cone, and scavenging system to the vaporizer.\nSet up the ultrasound machine.\n\t\nSelect a transducer (probe) with a range of 32-56 MHz or up to 70 MHz for imaging of the uterus or ovary, respectively.\nAttach the probe, and power on the machine.\nAfter system boot-up, use the control panel to log in with the user credentials and access the home screen.\nFrom the home screen, go to the Applications tab, and select Mouse (small) abdomen mode.\nClick on Scan to return to the home screen, and wait for a live image to be displayed.",
    "Select B-Mode from the options on the left tool bar.\nClick on More Controls to view additional tools for image refinement, such as image gain and depth, or to adjust the clip acquisition settings, such as the number of frames per second.\nOnce the image settings are selected, return to the home screen by clicking on Scan.\nTurn on the O2 tank, direct the flow to the induction chamber, and set the flow rate to 1 L/min.\n3. Preparation of mice for ultrasound screening, including hair removal\nPlace a mouse in the induction chamber. Set the isoflurane vaporizer to 2%-3% vol/vol for the induction of anesthesia.\nDetermine the appropriate depth of anesthesia by a lack of response to toe pinch and a respiratory rate around 1-2 breaths/s.\nApply sterile ophthalmic lubricant to each eye. Remove the fur from the dorsum and ventrum between the last rib and pelvis with appropriately sized clippers.\nApply a thin layer of depilatory cream to the ventral and dorsal regions to be imaged (if needed).\nPlace the mouse back in the induction chamber for approximately 3-5 min to maintain the appropriate depth of anesthesia while the depilatory cream works to remove the hair. After ≤4 minutes, gently wipe away the cream with a clean moist paper towel.\n\t​NOTE: Longer exposure to depilatory cream is irritating and may cause skin lesions.\n4. Intraperitoneal injection of fluid to increase the contrast between organs\nWarm a 3-10 mL syringe filled with sterile isotonic fluid solution (e.g., sterile 0.9% NaCl or Lactated Ringers Solution) to 35-40 °C by placing it between a heating pad and an absorbent pad for several minutes. Place a bottle of ultrasound gel on the heating pad if the machine does not have a warmer.",
    "For a 20-25 g mouse, inject 1-2 mL of solution into the peritoneal cavity.\n\t\nSecure the mouse by the scruff in one hand, exposing the ventrum.\nHold the mouse at a ~20° angle, with the nose pointed to the floor to direct the organs cranially due to gravity.\nUsing a small gauge needle (25 G, 5/8 in length, tuberculin syringe), puncture through the skin and abdominal wall of the caudal right quadrant of the abdomen.\nBefore the injection of fluids, to avoid injection into the vasculature or the GI tract, pull back with minimal pressure. If blood or other material enters the syringe, remove the needle. Use a new needle and syringe, and try again at a slightly different position.\nIf the mouse wakes up during the injections, place it back in the small induction chamber for anesthesia with 2%-3% vol/vol isoflurane.\n5. Ultrasound imaging from a dorsal approach\nPosition the mouse in ventral recumbency on the absorbent pad over a heating pad (Figure 2A-C).\nPlace a rodent nose cone securely over the mouse's nose and muzzle. Maintain the anesthetic depth with isoflurane delivered through the nose cone at 1%-2% vol/vol in 100% O2. Apply sterile ophthalmic lubricant, as needed, to each eye.\nMonitor the mouse for a regular respiratory rate (1-2/s) and a lack of toe pinch response to indicate if the anesthesia needs to be adjusted.\nPlace a small amount (~0.5-1 mL) of prewarmed ultrasound gel abaxial (lateral) to the spine on either side of the anesthetized mouse, between the last rib and pelvis.\nPut a small amount of gel on the ultrasound probe.",
    "Place the probe parallel to the vertebrae with the front of the probe on the cranial side. An indicator mark is present on the probe head to indicate the proper probe orientation. Record the day, time, animal ID, probe orientation, and animal side (right, left, dorsal, ventral) for each new set of images being collected.\nWith a mouse in ventral recumbency (dorsum skin touching the probe), slowly scan the area for the kidney landmark (Figure 2B and Figure 3). With the kidney in view, pull the probe caudal to find the ovary-a slightly hyperechoic oval to round structure (Figure 4A, B) within a very hyperechoic ovarian fat pad that is bordered cranio-ventrally by the kidney and dorso-laterally by the dorsal abdominal wall.\n\tNOTE: Pressure caudal and lateral to the ovary can direct the ovary closer to the abdominal wall and away from the loops of the intestine. The ovary is anatomically positioned up against the dorsal abdominal wall, just ventral and lateral to the epaxial muscles and caudal to the kidney.\nAdjust the signal gain using the slider at the bottom of the control screen to improve the image contrast.\nTo improve the imaging of the kidney, apply pressure with a finger to the contralateral abdomen. Vary the pressure and angle from directly parallel to the spine to ~20° ventral.\nOnce the organ of interest is in view, collect a video by clicking on Save Clip or Start Recording and then Stop Recording when done to retain images at a preset number of frames.\nSave single frames from either a live image or recording with the Save Frame button.",
    "To image the uterus, pull the probe caudally until the ovary is in the most cranial aspect of the field of view. Vary the probe pressure and angle until the uterus is in view.\nRepeat video and frame collection for each organ of interest.\nFind the uterus running longitudinal along the dorsal abdominal wall with the lateral leg musculature also in view (Figure 4B).\n\tNOTE: The uterus size and lumen diameter may vary with the phase of estrus and disease state.\nMonitor the tissue for peristaltic motion to differentiate the intestinal loops from the uterine stationary horns.\n6. Collect images from a ventral approach\nPlace the mouse in dorsal recumbency, and check that the eye lubrication is sufficient and the muzzle is securely in the nose cone (Figure 2A).\nApply a small amount (~0.5-1 mL) of prewarmed ultrasound gel to the ventral abdomen, and apply the probe at the midline just cranial of the pubis to locate the bladder as a hypoechoic landmark (Figure 5).\n\tNOTE: If the bladder is too large and obscures the uterus imaging, gentle pressure can be placed on the lower abdomen to express urine.\nPull the probe lateral to the bladder to find the uterine horns. Apply light digital pressure from either or both sides of the mouse to bring the horns into the field of view. Hold the probe perpendicular to the mouse, and scan both sides of the abdomen to capture transverse views (cross-sections) of both horns. Rotate the probe to capture sagittal views.\nAfter the ultrasound, wipe the mouse clean of gel with a paper towel, and return it to its cage to recover. Mice are fully awake in 2-5 min. Once it is fully awake and ambulatory, return the mouse to the animal room.",
    "NOTE: A heating pad on a low heat can be placed under the cage to warm the cage for recovery.\nAt the experimental or humane endpoint, euthanize the mouse. Ideally, euthanize the mouse in the home cage to reduce stress; alternatively, place the mouse in a clean chamber. Deliver pressurized CO2 at a displacement rate of 10%-30% of the chamber volume per minute. After approximately 5 min of no visible respiration, verify death by cervical dislocation. Proceed with abdominal necropsy for tumor harvest.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}