{
  "id": 6035,
  "origin_website": "Bio",
  "title": "Bacterial Competition Assay Based on Extracellular D-amino Acid Production",
  "procedures": [
    "Bacterial co-cultivationNote: All steps need to be performed under sterile conditions, working by the flame or inside a laminar flow cabinet. Streak V. cholerae cells from the freezer stock onto an LB agar plate and incubate upside-down for 16 h at 37 °C. V. cholerae lacZ+ wild-type and V. cholerae lacZ- ΔbsrV can be used to assess the role of BsrV in D-amino acid production.Streak C. crescentus cells from the freezer stock onto a PYE agar plate and incubate upside-down for 48 h at 28 °C.Note: Any combination of bacteria (ideally one of them a D-amino acid producer) can be used in this protocol, as long as both can grow in compatible conditions.Pick a single colony of each strain from the agar plates with a sterile wired-loop and inoculate 2 ml liquid PYE medium in a 15 ml test tube. Grow liquid bacterial cultures overnight (16-18 h) at 28 °C, with shaking at 150 rpm. Note: Temperature and shaking may vary depending on the bacterial species used in the competition assay.Determine the OD600 of the cultures: dilute 100 µl overnight culture in 900 µl fresh PYE medium, transfer to a cuvette and read absorbance at 600 nm using a spectrophotometer. Use a cuvette filled with 1 ml fresh PYE as blank.Dilute the bacterial suspension in 10 ml PYE medium to a starting concentration of OD600 = 0.01. Depending on the bacterial strain used, the OD600 to CFU ml-1 ratio will differ and needs to be determined for each strain: for example, for the V. cholerae wild type strain, OD600 0.01 = ~107 cells ml-1.Stericup filtration units are used as co-cultivation chambers. Fill the upper part, which we called compartment A, with 100 ml fresh PYE medium.",
    "Fill the lower part, which we called compartment B, with 200 ml fresh PYE medium. Tightly attach both compartments. Use Parafilm and adhesive tape to firmly seal the lid of compartment A and avoid leakage and place the co-cultivation chamber horizontally. With a hot needle, make a small hole in the top of each compartment to allow inoculation and sample collection; this hole can be sealed with adhesive tape (Figure 1A).Note: Make sure the co-cultivation chambers are placed horizontally with the hole facing the top, to minimize sample spilling. Here we use 100 ml medium in compartment A and 200 ml medium in compartment B because the size of both parts is different; ideally both compartments should have the same size, shape and medium volume.L-amino acid supplementation: with a 10 ml syringe and a needle, add 2.5 ml and 5 ml L-arginine (200 mM sterile stock solution) to compartments A and B, respectively (final L-amino acid concentration is 5 mM in each compartment). Use non-supplemented co-cultivation chambers to assess growth in absence of L- or D-amino acids (Figure 1B).With a 1 ml syringe and a needle, inoculate the bacteria into the co-cultivation chambers: 100 µl V. cholerae (OD600 = 0.01) is inoculated into compartment A; 500 µl C. crescentus (OD600 = 0.01) is inoculated into compartment B. Use non-inoculated chambers as a control of contamination and growth in absence of a competitor bacteria (Figure 1B).Note: Determination of the growth rate of the bacteria in competition should be assessed beforehand, including the growing condition (medium and temperature) compatibility. We use 2.5-fold C. crescentus inoculum to compensate for the very different growth rates of V. cholerae and C. crescentus in PYE medium. V. cholerae lacZ+ wild-type is used as D-amino acid producing bacteria. V.",
    "cholerae lacZ- ΔbsrV is used as D-amino acid non-producer. A 1:1 mixture of V. cholerae lacZ+ wild-type and V. cholerae lacZ- ΔbsrV is used to demonstrate the metabolic cooperation between producers and non-producers to outcompete other bacteria.Incubate the co-cultivation chambers at 28 °C with mild agitation (100 rpm). Place the holes used for inoculation on the top to minimize sample spilling (Figure 1C). Samples from both compartments will be collected at different time points: 0, 24, 48 and 72 h.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180329/20180329035648_9170.jpgFigure 1. Preparation of the co-cultivation chambers. A. Fill both compartments of the Stericup filtration unit with the appropriate media. Attach and seal both parts and add the L-amino acid to a final concentration of 5 mM. Finally inoculate the compartments with the competing bacteria. B. Media and bacteria combinations for a complete competition experiment, including controls (C) and test samples (Test). Vc: V. cholerae. Cc: C. crescentus. C. Co-cultivation chamber.At the desired time points, use 1 ml syringes and needles to collect 500 μl culture samples from each compartment and co-cultivation chamber and transfer to previously labeled microtubes.Viable cell count is performed immediately (see Procedure B). Transfer 200 μl of freshly collected samples from compartment A (V. cholerae) and B (C. crescentus) to a sterile 96-well plate.Determination of D-amino acid concentration is performed at the end of the whole experiment (see Procedure C). Centrifuge the remaining 300 μl sample at 21,000 x g for 5 min at room temperature using a microcentrifuge. Carefully transfer the supernatant (300 μl) to new microtubes and store samples at -20 °C until the end of the experiment. Make sure no cell pellet is transferred to the new tube.Viable cell countNote: All steps need to be performed under sterile conditions, working by the flame or inside a laminar flow cabinet.",
    "To determine the viable cell count of V. cholerae and C. crescentus, serially dilute cells 1:10. Transfer 20 μl from the previous dilution to a new well and add 180 μl of fresh medium (LB for V. cholerae, PYE for C. crescentus), thoroughly pipetting to make the mixture homogeneous. Following this procedure, dilute the cultures 9 times. Make sure to change the tips in every dilution step.Plate 100 μl of each dilution on agar plates (LB for V. cholerae, PYE for C. crescentus), for CFU count. First, add 6-10 sterile glass beads to each plate and then carefully pipette the bacterial culture. Then, close the lid and agitate the plates to homogeneously distribute the cell culture and let it dry. Remove the glass beads by carefully tilting the plates. Glass beads can be reused after decontamination, washing and sterilization. Incubate CFU count plates upside-down for 16 h at 37 °C for V. cholerae and 48 h at 28 °C for C. crescentus.Once grown, count colonies on the agar plates and calculate the viable CFU per ml based on the dilution factors applied (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180329/20180329035837_8461.jpgFigure 2. Viable cell count. A. C. crescentus growth expressed as CFU ml-1; B. Alternative representation using the relative growth compared to the control. -: C. crescentus control, WT: competition C. crescentus vs. V. cholerae lacZ+ wild-type, ΔbsrV: competition C. crescentus vs. V. cholerae lacZ- ΔbsrV, MIX: competition C. crescentus vs. a 1:1 mixture of V. cholerae lacZ+ wild-type and V. cholerae lacZ- ΔbsrV.Determination of total D-amino acid concentration: DAAO assayNote: No sterile conditions are required.",
    "In this two-step assay, DAAO produces α-ketoacid, NH3 and H2O2 from D-amino acids; peroxidase reduces H2O2 releasing free O2 that reacts with OPD, leading to the production of 2,3-diaminophenazine, a colorimetric product that can be detected using a spectrophotometer (Alvarez et al., 2018; Espaillat et al., 2014). D-amino acid standard curve: prepare D-arginine dilutions at 0.05, 0.1, 0.25, 0.5, 1, 1.5 and 2 mM concentration in MilliQ water. Transfer 20 μl of each dilution to a clear flat-bottom 96-well plate. Transfer 20 µl of MilliQ water to another well to be used as a blank. For reproducibility, prepare triplicate standard curves and blanks.Supernatant samples: completely thaw the supernatant samples kept at -20 °C (let them stand on ice for 20 min). Prepare 1:2, 1:5 and 1:10 dilutions in new microtubes using MilliQ water. Transfer 20 μl of each sample (non-diluted, 1:2, 1:5 and 1:10) to the clear flat-bottom 96-well plate. For reproducibility, prepare triplicate reactions. Prepare the DAAO reaction buffer (see Recipes) and add 60 μl to each well using a multichannel pipette. Final reaction volume will be 80 μl.Close the 96-well plate lid to avoid evaporation and incubate for 1 h at 37 °C with vigorous shaking (400 rpm). Positive reactions will turn yellow.Using a multichannel pipette, add 2 volumes (160 μl) of 2 N HCl to each well to inactivate the reaction. The yellow color will turn orange.Read the absorbance at 492 nm using a microplate reader."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}