{
  "id": 13172,
  "origin_website": "Jove",
  "title": "Drosophila Embryo Preparation and Microinjection for Live Cell Microscopy Performed using an Automated High Content Analyzer",
  "procedures": [
    "NOTE: Refer to Table 1 for recipes of media and solution.\n1. Setting up and maintaining an embryo collection cage for live analysis21\nPopulate a fresh embryo collection cage with fresh flies.\n\tNOTE: While commercially available collection cages are recommended, collection cages can be easily constructed from empty fly bottles21.\n\t\nDiscard or transfer adult flies from bottles when many pupae begin darkening at stage p14; at 20 °C this occurs approximately 14 days after the eggs have been laid22.\nAllow pupae to hatch and populate the bottles for 12-24 h.  \nTransfer fresh flies into a small collection cage using a small funnel over the collection cage opening to prevent flies from escaping. Combine up to 3 bottles to produce a densely populated cage containing 200 to 500 flies.\nTransfer flies into the collection cage by tapping a fly bottle against a hard surface repeatedly (to stun the flies). Then open and invert the fly bottle over the collection cage funnel. Tap the open bottle onto the collection cage a few times to drop flies into the collection cage.\nClose the open fly bottle by quickly setting it down onto its plug. While transferring the open fly bottle from the funnel to its plug, ensure that the bottle opening points downward as flies tend to crawl up away from the source of the tapping.  \nPress the funnel against the fly cage opening and tap the cage repeatedly on a hard surface to stun the flies inside. Immediately remove the funnel and secure a fresh grape plate to the fly cage opening. Use labeling tape to secure the grape plate. Repeat this process to combine up to 3 bottles to produce a densely populated collection cage.",
    "NOTE: Alternatively, flies can be anesthetize using CO2 or other fly sleeping agents; however, this will increase the acclimation period in the step 1.2.\nAcclimate the new collection cage for 24-48 h. If CO2 or any other sleeping agents were used, acclimate the collection cage for at least 48 h.\n\t\nReplace the grape plate in the collection cage with a fresh one containing yeast paste twice a day, 8-10 h apart.\nSetup a fresh collection cage every 5 days.\n2. Collecting and preparing embryos for imaging\nObtaining embryos with synchronized development\n\t\nExchange the grape plate on the collection cage with a fresh one containing a dab of yeast paste at the center. Allow flies to lay embryos for 1 h. Toss the old grape plate.\n\t\tNOTE: Flies can fertilize embryos prior to laying them. The first collection plate will contain many of these predeveloped embryos. Allowing flies to dump old embryos first will improve developmental synchronization between embryos.\nExchange the grape plate for a fresh one containing a dab of yeast paste at the center and let flies lay embryos for 10 min. Toss the old grape plate.\n\t\tNOTE: To avoid slowing down embryonic development on cold plates, warm the grape plate and yeast paste to room temperature prior to use.\nExchange the grape plate with a fresh one (without yeast paste) and save the old grape plate, it has the embryos for imaging. If necessary, continue collecting embryos from this cage by repeating step 2.1.2 and 2.1.3.\nAge collect embryos for 30-45 min to image syncytial divisions23.",
    "NOTE: To image the syncytial blastoderm stage in embryonic development, the embryos must be mounted and on the microscope within 90 min of collection. When attempting this protocol for the first time, age embryos 10-20 min in step 2.2 to provide extra time to set up between steps.\nDechorionate embryos with 50% bleach in DI water.\n\t\nTransfer aged embryos from step 2.2 into a 140 nm sieve by filling the grape plate with DI water, gently dislodging the embryos with a paint brush, and pouring the water with embryos into the 140 nm sieve (Figure 1A).\n\t\tNOTE: This can be done over a sink or 1,000 mL beaker.\nVigorously rinse embryos with a DI water using a squirt bottle. Dry embryos by blotting the sieve on a dry paper towel. Blot the sieve until it stops leaving water marks on the paper towel (Figure 1B).\n\t\tNOTE: Remove all yeast paste from embryos as it can render bleach treatment ineffective in the next step.\nFill an empty 10 cm plate with freshly prepared 50% bleach diluted with DI water (1:1 bleach: DI water). Dip the sieve into 50% bleach for 2 min 45 s. Start a stopwatch as soon as the sieve touches the 50% bleach. Blot the sieve in and out of the 50% bleach 3-4x in the first 15 s to breakup embryo clumps (Figure 1C).\nVigorously rinse embryos with DI water using a squirt bottle. Dry the embryos by blotting the sieve on a dry paper towel. Repeat vigorous rinse and blot drying process for 5x (Figure 1D).\n\t\tNOTE: This is the most important step for removing left over chorion. Use a full DI squirt bottle and use half of the bottle in this step.",
    "Transfer the blot dried embryos from the sieve to a 10 cm grape plates using a paint brush21 (Figure 1E)\n\t\tNOTE: Manual dichlorination can be used as an alternative to bleach decorination24.\nimgsrc://cloudfront.jove.com/files/ftp_upload/61589/61589fig1.jpg\nFigure 1: Embryo dechorionation. (A) Embryos were collected using a DI H20 squirt bottle, paint brush, and 140 nm sieve. (B) Embryos were rinsed vigorously using a DI H20 squirt bottle and blot dry over a paper towel. (C) Dechorionation of embryos was performed in 50% bleach for 2 min and 45 s. (D) Embryos were rinsed vigorously using a DI H20 squirt bottle and blot dry over a paper towel. This was repeated 4 times to remove excess chorion. (E) Embryos were then transferred to 10 cm grape plate using a paint brush. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/61589/61589fig1large.jpg]\n3. Mounting embryos to coverslips\nUnder a stereomicroscope equipped with overhead goose neck lighting, organize two rows of 15-20 embryos on a clean section of grape plate using an egg picker tool. Align the embryos on their ventral side in the same orientation with respect to anterior and posteriors ends. To make egg pickers bend fine tip stainless steel tweezers to 45° angle. To review D/V embryos orientation see Campos-Ortega et al.20.\n\tNOTE: It is important for the ventral surface to sit on the grape plate as the embryos will be pressed onto a cover slip in step 3.5, exposing the dorsal surface for imaging. Since the dorsal surface is much flatter than the ventral surface, imaging the dorsal side surface increases the number of nuclei present within a single Z plane.\nPrepare 75 mm x 25 mm silicone spacer coverslip.",
    "NOTE: This can be prepared ahead of time. Prepare several coverslips and store them in a slide box to keep them clean.\n\t\nTrace the outline of a 75 mm x 25 mm coverslip onto a 1.6 mm thick silicone spacer sheet and cut out the silicone spacer using scissors (Figure 2A).\nUsing a razor blade, cut out a 40 mm x 15 mm inset from the spacer (Figure 2A).\nAdhere the spacer onto the coverslip and streak 10 µL of heptane glue down the exposed coverslip glass inset (Figure 2A).\n\t\tNOTE: Putting down and even streak will ensure imaging embryos on the same z plane. \nWhile the heptane glue from step 3.2.3 dries, cutout a rectangular section of grape plate containing the embryos from step 3.1.\n\t\nUse a razor blade to cut a rectangle (smaller than 40 mm x 15 mm) around the two rows of embryos. Do not remove the rectangle yet.\nCut out a second rectangle next to the first. Remove the second rectangle using the straight edge side of a stainless-steel spatula.\nCarefully slide the straight edge of a stainless-steel spatula under the first rectangle and remove it (Figure 2B).\nPlace the grape plate cutout with embryos on the external side of a 3.5 cm dish (Figure 2C).\nUnder a stereomicroscope, lower a prepared coverslip over the embryos and gently press the two rows of embryos onto the glue (Figure 2D).\nIf microinjecting embryos, skip to step 4.1. If not microinjecting continue to step 3.7. \nCover embryos by filling the silicone spacer (halfway to the top) with 1:1 - halocarbon oil 700: halocarbon oil 27.",
    "Line the bottom edges of a 4-slide plate adapter with double sided tape to prevent the cover slip from moving but ensure not to place the tape in the path of the objective lens. This tape is critical. If the coverslip is only sitting on the adapter, it will move throughout the acquisition. Mount the cover slip on the 4 slide plate adapter.\nimgsrc://cloudfront.jove.com/files/ftp_upload/61589/61589fig2.jpg\nFigure 2: Coverslip preparation and mounting. (A) An outline of 75 mm x 25 mm coverslip was traced onto a 1.6 mm thick silicone sheet. Use scissors to cut out the outline. 40 mm x 15 mm inset were cut out from the silicone spacer and then mounted onto the coverslip. Streaked 15 µL down the center of the inset. (B) Two rows of 15-20 embryos were organized on a grape plate in an area smaller than 40 mm x 15 mm, then that area was cut out using a razor and stainless-steel spatula. (C) Grape plate cut out were placed on the top of an empty 3.5 cm dish. (D) Under a stereomicroscope, the coverslip from (A) was lowered and the embryos were stuck onto the streak of glue. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/61589/61589fig2large.jpg]\n4. Desiccating and microinjecting embryos\nPlace the coverslip with embryos over a slide to prevent the bottom of the coverslip from becoming dirty during desiccation and microinjection.\n\tNOTE: The cover slip will be imaged without a slide attached to it. Therefore, an inverted microscope is necessary for imaging.\nDesiccate embryos for 5-10 min, depending on the temperature of the room. The embryos used for imaging in the representative results were desiccated for 7 min at 20 °C in a chamber containing a 1:1 layer of silica gel beads over a drying agent (Figure 3A).",
    "Immediately after desiccation, cover embryos with 1:1 - halocarbon oil 700: halocarbon oil 27. Fill the silicone spacer halfway to the top.\n\tNOTE: It is important to mix a high viscosity halocarbon oil with a low viscosity halocarbon oil. Pure halocarbon oil 700 (high viscosity) slows down cell cycles progression 30 min post application. A 1:1 mixture of halocarbon oil 700 and halocarbon oil 27 fixed this artifact.\nLoad microinjection needles with injectant, then mount one to the microinjector and cut it open under pressure.\n\tNOTE: Practice step 4.4 a few times before performing the full assay with any valuable reagents. This is the most difficult step in the microinjection process.\n\t\nLoad microinjection needles with 2 μL of injectant using an extended loading tip. Only one microinjection needle is required, but it is good to have spare loaded needles close by so prepare 2 or 3 needles.\n\t\tNOTE: Refer to the Table of Materials for specifications on extended loading tips. Microinjection needles cannot be loaded without extended loading tips due to the unique nature of our microinjection technique, which relies on building air pressure inside of a sealed and loaded needle prior to opening its tip.\nMount a needle onto the microinjector and depress the plunger halfway to the tip. The goal is to increase air pressure inside of the glass capillary (Figure 4A).  \n\t\tNOTE: Use a plunger mineral oil based microinjector without mineral oil. Instead of building pressure with mineral oil, use the plunger to build air pressure.",
    "Lower the glass needle onto a glass slide and cut the tip of the needle open using a new #9 razor. Cut the needle at a 45° angle to produce a sharp open tip. The injectant should flow down to the bottom of the tip without flowing out of the needle. Carefully add 20 μL of halocarbon oil over the tip of the needle and re-cut it open at 45°. The injectant should begin to flow rapidly.\nImmediately lower air pressure by retracting the plunger but ensure to maintain a continuous flow rate to prevent the needle from clogging with embryo membrane between injections. (Figure 4B).\n\t\tNOTE: If the injectant is clear, view the injectant flow rate by lifting the microinjection needle in and out of halocarbon oil and observing the rate of formation for injectant droplets under a stereomicroscope. Adjust air pressure by depressing the plunger a few clicks at a time, then dip the microinjection tip in and out of halocarbon oil to view the rate of formation for new droplets post adjustment.\nUse the micromanipulator to position the needle at the center of the field of view, then lift the needle using the micromanipulator and remove the glass slide from under it. The needle is now calibrated for injection.\nimgsrc://cloudfront.jove.com/files/ftp_upload/61589/61589fig3.jpg\nFigure 3: Desiccation chamber diagram. (A) This is a diagram of a desiccation chamber. The chamber consists of a 1:1 layer of silica gel beads over a layer of drierite. To perform desiccation, embryos were placed on top of a single well plate lid. The desiccation chamber was closed 7 min. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/61589/61589fig3large.jpg]\nMicroinject embryos\n\t\nPlace the embryos on the stereomicroscope stage under microinjection needle but do not lower the needle.\nFocus on embryos at 50x magnification.",
    "Lower the needle until it comes into the same focus plane as the embryos. Moving the slide with one hand and operating the microinjector with the other, inject one row of embryos.\nRaise the needle and rotate the slide 180° to expose the second row of embryos to the microinjection needle. Lower the needle and inject the second row of embryos.\n\t\tNOTE: Try to do this in under 10 min. Leave some un-injected embryos to be used as controls.\nimgsrc://cloudfront.jove.com/files/ftp_upload/61589/61589fig4.jpg\nFigure 4: Microinjection needle preparation. (A) In this illustration, the intensity of magenta in needle is representative for air pressure. A loaded needle was mounted onto the microinjector and the plunger was extended 50% to increase air pressure inside of the needle. Make sure the plunger is maximally retracted prior to mounting. (B) The needle tip was cut under pressure and the plunger was retracted to decrease air pressure and the flow rate. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/61589/61589fig4large.jpg]\n5. Imaging on a high content analyzer\nPrior to running this assay create a plate map for a slide adapter. Use the plate holder editor found in Plate Map Manager menu to enter the dimension for a custom plate adapter.\n\tNOTE: A custom plate map was made for the commercially available plate adapter (see Table of Materials). The plate map contains the following settings; Slide thickness: 1000 µm, Bottom height: 1.607 mm, bottom height variability: 100 µm, substrate material: glass, coverslip thickness: 150 µm, coverslip position: bottom – rows: 1 – spacing: 56.987 mm, columns: 4 – spacing 28.391, size and shape: rectangle, width 23.00 mm, height: 73.00 mm, offset to A1 21.29 mm – 42.74 mm)",
    "Load the slide adapter on the microscope and use the Preview feature to tile a brightfield 10x image of the coverslip.\nSelect an embryo from the top or bottom of a row, then select Objective and switch to 60x (NA 0.95). Determine an appropriate exposure for the desired fluorescence channel. \n\tNOTE: Maintain the laser intensity under 25% for live cell imaging.\nOn the main dashboard, use the Preview feature to tile a fluorescent 60x image containing both rows of embryos.\nOn the main dashboard, select the Binning drop down menu and set the binning to 1 x 1 for optimal resolution.\nUse the z Stack Setup tab to define parameters for z stacks.\n\t\nIn the z Stack Setup tab, use the Up and Down arrows to find then define top and bottom z stack limits. Once the top and bottom limits are defined, select the Green Pencil Icon to save the z stack position. Note the z stack position as it will be used in step 5.6.5.\nIn the z Stack Setup tab, use the z Step input box define spacing between z slices. \n\t\tNOTE: The total number of slices is determined by modulating step 5.6.1 and 5.6.2.\nOn the main dashboard, right click on the Fluorescent Channel and use the Image Mode drop down menu to set the imaging mode to 3D.\nOn the main dashboard, select the Laser Autofocus Box to disable autofocus.\nOn the main dashboard, define the Initial Focus with the z-stack position from step 5.6.1 then select the Initial Focus Box to disable the “Refocus at each Time Point” feature.\nIn the Fields tab, use the Field placement drop down menu to enable Custom Points, then use the Arrows to select points for imaging.",
    "NOTE: The time interval between acquisitions (step 5.8) will determine how many custom points can be imaged simultaneously.\nIn the Time Series tab, select the Acquire Time Series box to enable the time series feature, then define the total number of time points.\n\tNOTE: 6 custom points x 5 z slices x 80 stacks = 2,400 images, 2,400 images x 8.2 MB per image = 19.68 GB disk space.\nOn the main dashboard, use the Name Input Box to name the acquisition settings then select File and Save to save the acquisition settings.\nOn the main dashboard, select the Scan button to run the acquisition.  \n6. Post image processing\nDrag and drop the xdce file into Fiji to open the image series as a multidimensional hyperstack.\nSave the hyperstack as a tif file.\nCreate max intensity projections and save them as a tif files.\nAssemble a library of max intensity projections and build a pipeline for data extraction and analysis."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}