{
  "id": 13650,
  "origin_website": "Jove",
  "title": "Prediction and Validation of Gene Regulatory Elements Activated During Retinoic Acid Induced Embryonic Stem Cell Differentiation",
  "procedures": [
    "1. Enhancer Selection Based on Chip-seq Analysis\nDownload the RXR ChIP-seq raw data fastq file (mm_ES_RXR_24h_ATRA.fastq.gz) from http://ngsdebftp.med.unideb.hu/bioinformatics/\nDownload and extract the required BWA index file for the alignment (in our case: Mus_musculus_UCSC_mm10).(ftp://igenome:G3nom3s4u@ussd-ftp.illumina.com/Mus_musculus/UCSC/mm10/Mus_musculus_UCSC_mm10.tar.gz\n\tNOTE: Visit to https://github.com/ahorvath/Bioinformatics_scripts for more information regarding the steps of bioinformatics analysis and to download the scripts used below.\nAlign the example fastq file to mm10 genome (use the script: perform_alignment.sh). This will create a folder with a .bam file and statistics of the alignment. Aligned RXR ChIP-seq data (mm_ES_RXR_24h_ATRA.bam), and the corresponding index file (.bai) are available here:\n\thttp://ngsdebftp.med.unideb.hu/bioinformatics/\n\tNOTE: BWA is a software package that aligns relatively short sequences (e.g., ChIP-seq results) to a sequence database, such as the mouse reference genome (e.g., mm10) 13.\nRun the script (callpeaks.sh) for peak calling and de novo motif analysis. Use the .bam file as the input. The script is based on Homer findPeaks 14.\n\tNOTE: The output files give us information about the total number of peaks, enrichment of the motifs, the percentage of the background, and the target sequences with motifs, etc. (Figure 1). Typically several motifs are listed in order of their significance.\nRemap the #1 ranked motif (NR half `AGGTCA`) (use the script: remap_motif.sh)\n\tNOTE: As the result, the script generates a .bed file that will show which ChIP-peaks are covering genomic regions that contain the canonical binding site of the transcription factor of interest.\nDownload and visualize results of the aligned RXR ChIP-seq reads (mm_ES_RXR_24h_ATRA.bam (also download the .bai)) and the AGGTCA motif occurrences (mm_ES_RXR_24h_ATRA_homerpeaks_motif1_mm10s_200_remaped_mbed.bed) by Integrative Genomics Viewer (IGV)15 to identify putative RAR/RXR binding sites (Figure 2 and Figure 3).",
    "NOTE: Integration of various ChIP-seq data will help to more precisely predict good candidate enhancers16,17. Recent studies revealed that active enhancers are typically enriched for P300 and correlate with H3K4me1 and H3K27ac, and are located in open chromatin regions, thereby displaying DNase-I hypersensitivity is also recommended 18-21.\nUse the \"Define a region of interest\" in IGV 15 to obtain 200 - 400 bp sequence of the selected genomic region and use these sequences for subsequent primer designs.\n2. Reporter Assay\nNOTE: The luciferin/luciferase system is used as a very sensitive reporter assay for transcriptional regulation. Depending on the enhancer activity luciferase enzyme is produced that will catalyze the oxidation of luciferin to oxyluciferin resulting in bioluminescense, which can be detected. As a first step, identified putative enhancer sequences should be subcloned into a reporter vector (e.g., TK-Luciferase 22, pGL3 or NanoLuc).\nPrimer Design\nDesign PCR primers for amplification of 200 - 400 bp of putative enhancer regions by Primer3 (available here: http://bioinfo.ut.ee/primer3/)23\nCopy-paste the genomic sequence from IGV that includes the putative binding site into Primer3 (see step 1.7). Set product size range to 250 - 300 bp in Primer3.\nValidate the PCR primers using the UCSC Genome Browser's In silico PCR tool (https://genome.ucsc.edu/cgi-bin/hgPcr)24\n\t\tNOTE: This protocol in a later step uses HindIII and BamHI restriction enzymes for cloning. Check whether the PCR amplified sequence as predicted by the UCSC In-silico PCR tool will contain AAGCTT or GGATCC restriction sites (e.g.,  http://nc2.neb.com/NEBcutter2/).\nObtain the required primers from a commercial vendor.\nPCR Amplification of Enhancer Sequence from Genomic DNA\nPurify template genomic DNA from primary cells (e.g., primary embryonic fibroblasts). Use commercial kit for gDNA isolation and follow the manufacturer's instructions.",
    "NOTE: High quality of gDNA is essential for successful PCR amplification. Appropriate BAC clones can be used if PCR is not easy from gDNA.\nPrepare 50 µl PCR reaction containing 100 ng gDNA, 5 µl 10x buffer, 3 µl MgSO4 (25 mM), 5 µl dNTP (2 mM each), 1.5 µl Fwd primer (10 µM), 1.5 µl Rev primer (10 µM), 1 µl DNA polymerase\n\t\tNOTE: Use high-fidelity DNA polymerase with a low error rate for the PCR reactions.\nSet the PCR cycle (2 min 95 °C, (20 sec 95 °C, 10 sec 58 - 65 °C, 18 sec 70 °C) x25 repeat, 2 min 70 °C, forever 4 °C). Set annealing temperature with the consideration of the primer's predicted Tm values.\nPurify the PCR product with a commercial PCR purification kit and follow the manufacturer's instructions.\nIntroduce the restriction sites for cloning by repeating the PCR with primers as used above, but adding overhangs on their 5' ends (e.g., Fwd: 5'-ATATAAGCTTxxxxxxxxxxxxxxxxxxxx-3' (HindIII), Rev: 5'-TATAGGATCCxxxxxxxxxxxxxxxxxxxx-3' (BamHI)).\nRun 5 µl of the PCR product on agarose gel to check for unspecific PCR products.\n\t\tNOTE: If more bands are detected, run the entire PCR product and purify the appropriate band by a commercial gel extraction kit.\nRestriction\n\tNOTE: To clone insert upstream of TK promoter22 the purified PCR product and the vector (e.g., TK-Luc) should be digested with HindIII and BamHI.\n\t\nPrepare a 50 µl reaction mixture containing 1 µg purified PCR product, 1 µl HindIII (20 U/µl), 1 µl BamHI (20 U/µl) and 5 µl 10x buffer.\nPrepare a 250 µl reaction mixture containing 5µg vector (TK Luc, or alternative reporter vector), 5 µl HindIII (20 U/µl), 5 µl BamHI (20 U/µl), 5 µl thermosensitive Alkaline Phosphatase (1 U/µl) and 25 µl 10x buffer.",
    "NOTE: AP treatment of the vector greatly decreases the self-ligation of single-digested vector and thus the background.\nIncubate the reaction mixtures for 4 hr at 37 °C, then purify the digested PCR products and the vector with a commercial PCR purification kit.\nLigation\nSet up the reaction for ligation in PCR tubes including 2 µl 10x T4 DNA ligase buffer, 10 ng TK-Luc vector, 50 ng insert (digested PCR product), 1 µl T4 DNA ligase (400 U/µl) and nuclease-free water up to 20 µl.\n\t\tNOTE: Prepare a negative control where the reaction does not contain insert.\nGently mix the reaction by pipetting up and down, spin down briefly the PCR tubes using mini-centrifuge and then incubate at RT for 10 min.\nHeat inactivate at 65 °C for 10 min then chill on ice and use 5 µl of the product for transformation into 50 µl competent cells (e.g., DH5α).\nUse standard heat shock procedure to transform bacteria, pick up colonies and isolate plasmid DNA with a commercial kit. Validate all constructs by sequencing prior to the next steps.\nTransfection of ES Cells\nUse 48-well plates. Add 200 µl 0.1% gelatin solution/well 30 min prior to cell plating.\nPlate embryonic stem (ES) cells a day before transfection. Use feeder-free ES cells and plate at a density of 3 x 104 cells per well in 250 µl ES media/well.\nPrepare the plasmid mixes (each mix is calculated for 8 wells, 4 untreated and 4 retinoic acid-treated). Mix 1: 1,250 ng TK-Luc Empty (negative control), 950 ng β-Galactosidase coding vector (βGal), Mix 2: 1,250 ng TK-Luc Hoxa1 enhancer (positive control), 950 ng βGal, Mix 3: 1,250 ng TK-Luc PRMT8 enhancer (region of interest), 950 ng βGal.",
    "NOTE: ES cells express the desired transcription factors (RAR/RXR). Leave wells untransfected to determine base values later during the luciferase and β-galactosidase measurements.\nAdd transfection quality reduced serum media to each plasmid mix up to 106 µl total volume (enough for 8 wells).\nAdd 4.5 µl ES quality transfection reagent then mix carefully by pipetting 15 times up and down. Incubate the transfection mix for 10 min at RT.\nAdd 13 µl of the transfection mix to the cells per well, mix thoroughly by pipetting. Place the cells back into the incubator (37 °C) O/N before ligand treatment.\nRemove media carefully by aspiration from cells and add 250 µl fresh media/well containing 0.01 - 1 µM all-trans retinoic acid (RA) as final concentration or DMSO as vehicle. Incubate cells for 24 - 48 hr.\n\t\tNOTE: Retinoic acid is light sensitive.\nPreparation of Cell Lysates\nDilute 5x Lysis Buffer (1.25 ml 0.5 M Tris pH = 7.8, 1 ml 1 M dithiothreitol (DTT) (in H2O), 10 ml 0.1 M EDTA pH = 8.0, 50 ml glycerol, 5 ml Triton X-100, sterile water up to 100 ml) to 1x using sterile water, add 20 µl 1 M DTT/10 ml and equilibrate to RT before use. Prepare 10 ml for a 48-well plate on the day of the assay.\nRemove media carefully by aspiration from cells. Rinse cells once with 1x PBS. Add 200 µl 1x Lysis Buffer/well directly to the cells.\nShake for 2 hr at RT (chemical lysis). Freeze the cell lysates on the plate at -80 °C (mechanical lysis). Lysates can be stored at -80 °C for several days.",
    "Thaw the lysates. After complete thawing, transfer cell lysates to a 96-well plate using an electronic multichannel pipette. Transfer 80 µl of the cell lysate to 96-well clear plate for β-galactosidase assay and 40 µl of the cell lysate to a white plate for luciferase measurement. Avoid forming any bubbles.\nβ-galactosidase Assay\n\tNOTE: Beta galactosidase or alternative second reporters should be used as an internal control to account for non-specific experimental variations.\n\t\nPrepare β-galactosidase substrate buffer: 80.0 g Na2HPO4•7H2O, 3.8 g NaH2PO4•H2O, 30.0 g KCl, 1.0 g MgSO4•7H2O, make up to 1,000 ml with sterile water. Adjust pH to 7.4. Filter Sterilize (0.2 micron) and store at 4 °C\nMix 1 ml β-galactosidase substrate buffer with 4 mg ONPG (o-nitrophenyl-β-D-galactosidase). Add 3.5 µl of 2-Mercaptoethanol (βME) per 1 ml of buffer just before use. Add 100 µl β-galactosidase substrate buffer to 80 µl cell lysate.\nIncubate the reactions at 37 °C until a faint yellow color has developed. Read absorbance at OD 420 nm on a plate reader and export data.\n\t\tNOTE: The time varies depending on the transfection efficiency, usually no longer than 30 min.\nLuciferase Assay\nPrepare 50 ml luciferin substrate reagent: 15.1 mg D-luciferin salt, 82.7 mg ATP salt, 185 mg MgSO4•7H2O, add to 50 ml polypropylene tube, then add 1.5 ml 1 M HEPES buffer, 48.5 ml ATP free water, vortex, make sure all compounds dissolve completely. Keep 5 - 10 ml aliquots at -80 °C.\nWarm 5 ml luciferin substrate reagent to RT before starting. Pipette 100 µl substrate reagent to each well of the white plate containing the 40 µl of the cell lysate and measure the signal immediately using a luminescent counter machine.\nObtain activities from at least three independent experiments in triplicate transfections.",
    "Calculate first the base normalized luciferase activity and base normalized β-galactosidase values for each well by subtracting the average values measured for non-transfected cells from each value measured. Then calculate the ratio of luciferase/β-galactosidase activity.\n3. Characterization of Enhancer RNA\nNOTE: A more direct indicator of enhancer activity has emerged from recent genome-wide studies that identified many short non-coding RNAs, ranging in size from 50 to 2,000 nt, which are transcribed from enhancers, and are termed enhancer RNAs (eRNAs)16,25,26 (Figure 4). eRNA induction highly correlates with the induction of adjacent exon-coding genes. Thus, signal-dependent enhancer activity can be quantified in vivo by comparing eRNA production between various conditions by RT-qPCR.\nGuidelines for Primer Design for eRNA detection by RT-qPCR\nSelect genomic regions for eRNA measurements that are at least 1.5 - 2 kb away from annotated transcription start sites.\n\t\tNOTE: Importantly, high levels of mRNA transcription across intragenic enhancers prevent accurate quantification of eRNA in the sense orientation, antisense eRNAs at intragenic enhancers are detectable and are similar in level to eRNAs at extragenic enhancers.\nAs a general rule, use regions 200 - 1,000 bp from the center of the transcription factor binding site of interest for primer design either on the sense or anti-sense strand (Figure 4 and Figure 6).\n\t\tNOTE: If GRO-seq, DNase-seq, H3K4me1, H3K4me3 or H3K27ac ChIP-seq data are available from the desired cell types and conditions it can be used for more accurate primer design. eRNAs are transcribed from putative enhancer regions characterized by high levels of H3K4me1 and me3. Expression of eRNAs positively correlates with the enrichment of activated enhancer histone mark H3K27ac.",
    "Design PCR primers for fluorescent dye-based RT-qPCR measurement of eRNAs by Primer3 (http://bioinfo.ut.ee/primer3/)23Generate anti-sense sequence (reverse complement of the sense strand) for primer design as per: http://www.bioinformatics.org/sms/rev_comp.html. Insert 200 - 300 bp of sense or anti-sense sequence for primer design.\nMeasurement of eRNA Transcription\nIsolate total RNA from treated cells with commercial acidic phenol/chloroform-based extraction reagent according to the manufacturer's recommendations.\nUse DNaseI to treat isolated RNA prior to using them in reverse transcription reaction. Inactivate DNase according to the manufacturer's recommendation prior to reverse transcription.\nMeasure RNA concentration after DNase I treatment and use 1,000 ng per RT reaction. Use high quality reverse transcriptase.\n\t\tNOTE: As large number of eRNAs may not be polyadenylated, reverse transcription requires the use of random primers.\nDetect reverse transcribed eRNA by RT-qPCR using standard procedure. Measure a non-treatment-dependent mRNA for normalization (e.g., 36B4, Ppia, Gapdh, Actb).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}