{
  "id": 2881,
  "origin_website": "Cell",
  "title": "Protocol using lentivirus to establish THP-1 suspension cell lines for immunostaining and confocal microscopy",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nHEK293T cells seeding and transfection\nTiming: 2 d\nThis step is to seed and transfect HEK293T cells for the production of high titer lentivirus, which is critical for subsequent cell line screening. The volumes used here are for 10 cm cell culture dish. We choose STING as an example, and you may set your own gene according to your study design.\nHEK293T cells seeding.\nAfter HEK293T cells reached 100% confluence (incubation at 37°C, 5% CO2), remove and discard culture medium. Then, briefly rinse the HEK293T cells with 5 mL PBS (phosphate-buffered saline) to remove all traces of serum which will inhibit the function of trypsin.\nAdd 2–3 mL of 0.05% (w/v) trypsin - 0.53 mM EDTA solution to dish, then waiting for 2–5 min at room temperature (20°C–25°C) until cell layer is dispersed.\nNote: In this step, 0.25% trypsin is not recommended.\nAdd 5 mL complete growth medium, then aspirate cells by gently pipetting.\nAdd appropriate cell (3.5–3.8×106 cells) suspension to new 10 cm cell culture dish, and ensure that cells can achieve 80% confluence after 24 h (Figure 1[href=https://www.wicell.org#fig1]). Incubate cells at 37°C, 5% CO2.\nHEK293T cells transfection.\nAdd 6 μg retroviral vector (control or gene of interest for KO (here STING)), 6 μg psPAX2 and 3 μg pCMV-VSV-G to 1.5 mL centrifugation tube, then mix them with 400 μL serum-free DMEM (Dulbecco’s modified Eagle medium). This tube is named as tube A.\nNote: For the details of the retroviral vector construction, you could refer to these publications.7[href=https://www.wicell.org#bib7],8[href=https://www.wicell.org#bib8]\nAdd 60 μL PEI (polyethylenimine, 1 mg/mL) to 1.5 mL centrifugation tube, then mix it with 400 μL serum-free DMEM. This tube is named as tube B.\nAdd the mixture from tube B to tube A, then mix thoroughly by pipetting with 1 mL pipette.",
    "Note: To ensure high transfection efficiency, we should add the mixture of tube B to A, and the reverse is not advisable.\nIncubate for 20 min at room temperature (20°C–25°C), then add the mixture to 10 cm cell culture dish, which contains HEK293T cells (80% confluence) to be transfected.\nNote: To ensure even distribution of the mixture, gently swirl the dish for several times.\nThen incubate cells at 37°C, 5% CO2.\nAfter 6 h, replace the medium with 10 mL prewarmed DMEM with 10% FBS (fetal bovine serum).\nLet the cells growth for 2 d.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2385-Fig1.jpg\nFigure 1. The appropriate cell confluence of HEK293T cells before transfection\nPhrase contrast microscopy (objective magnification) images was shown. Scale bar: 100 μm.\nLentivirus collection and concentration\nTiming: 2 d\nIn this part, we describe the protocol for the collection of the virus released into the supernatant. Then, we concentrate the virus by ViraTrap™ Lentivirus Concentration Reagent (Biomiga). With this procedure, the titer of the virus can be increased about ten-fold, which can greatly improve the efficiency of infection.\nAfter virus production for 2 d, transfer the supernatant (10 mL) into a 15 mL centrifugation tube, then centrifuge (160×g) at 4°C for 15 min.\nCarefully transfer the supernatant to a new 15 mL centrifugation tube, and filter it with 0.22 μm filters.\nNote: All virus-related experiments need to be done in the biological safety cabinet.\nAdd the ViraTrap™ Lentivirus Concentration Reagent (2.5 mL) to the tube, then mix thoroughly by pipetting. Subsequently, incubate the mixture at 4°C for 8–16 h.\nCentrifuge the mixture (650×g) at 4°C for 20 min.\nNote: In this step, you can observe the significant white pellet at the bottom of the 15 mL centrifugation tube.",
    "Remove supernatant, leaving the white pellet at the bottom of the 15 mL centrifugation tube (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2385-Fig2.jpg\nFigure 2. Virus concentration using ViraTrap™ Lentivirus Concentration Reagent\nThe red arrow indicated the white pellet containing the virus.\nRepeat step 6 and 7.\nResuspend the white pellet using 0.5–1.0 mL Roswell Park Memorial Institute (RPMI)-1640 medium with 10% FBS.\nThe concentrated virus can be directly used to infect cells (THP-1) or can be stored at −80°C.\nCritical: Avoid multiple freeze/thaw cycles.\nTHP-1 cells infection and selection\nTiming: 20–30 d\nThis is the final step of THP-1 cell line generation. THP-1 cells are infected with lentivirus, then selected with puromycin.\nResuspend THP-1 cells (3×105 cells) with 1 mL RPMI-1640 containing concentrated virus, then transfer them (1 mL) to 12 well plate. Incubate the mixture at 37°C, 5% CO2 for 6 h.\nReplace the medium with the prewarmed complete RPMI-1640 medium.\nNote: The replaced medium containing the virus needs to be deactivated by soaking in a solution of sodium hypochlorite (0.02–0.05%).\nAfter 48 h, replace the medium with the prewarmed complete RPMI-1640 medium, which contains 2 μg/mL puromycin. Incubate the mixture at 37°C, 5% CO2.\nNote: Here, it is important to choose the appropriate concentration of the puromycin. For THP-1 cells, we normally choose 1–2μg/mL puromycin.\nWaiting for the completion of cell screening, which takes approximately 7–10 d. troubleshooting 1[href=https://www.wicell.org#sec6.1].\nNote: If necessary, we can change fresh medium 2–3 times in this process.\nWhen the cells proliferate normally, monoclonal cell line generation is performed by limited dilution method. troubleshooting 2[href=https://www.wicell.org#sec6.3].\nNote: If the knockout effect is excellent (the target protein could not be detected) prior to monoclonal cell line generation, then the monoclonal cell line generation step can be omitted.",
    "After 15–20 d, the monoclonal cells are validated by Western Blot (Figure 3[href=https://www.wicell.org#fig3]). troubleshooting 3[href=https://www.wicell.org#sec6.5].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2385-Fig3.jpg\nFigure 3. The expression of STING was detected in STING knockout THP-1 cell lines\nThe levels of STING in WT (wild type) and STING knockout THP-1 cells were detected by western blotting. Representative blots from three biologically independent replicates with similar results are shown.\nCritical: In this part, the viability of THP-1 cells is critical for the successful completion of the experiment. To ensure the THP-1 cells viability, make sure that the cells are growth in an appropriate density (3 × 105–8×105/mL). Furthermore, high quality FBS is also essential.\nFixing THP-1 cells to the glass coverslip\nTiming: 2 h\nIn this section, we describe the protocol for fixing THP-1 cells (growing in suspension) to the glass coverslip. This is the difficult part for performing confocal microscopy in suspension cells. This protocol is generally useful for other suspension cells.\nPlace the glass coverslip in a 12 well plate, then add 1 mL THP-1 cells (2×106 cells).\nNote: Before centrifugation, ensure the glass coverslip is fully attached to the bottom of the 12 well plate.\nCentrifuge the 12 well plate at 120×g for 20min.\nGently remove the 12 well plate from centrifuge and wash 3–5 times using PBS.\nCritical: Shaking is not recommended during washing.\nAdd 1 mL 4% paraformaldehyde, then fix cells at 120×g for 20min.\nAspirate 4% paraformaldehyde carefully.\nNote: After this step, cells fixed to the coverslips are relatively stable.\nAdd 1 mL 0.1% Triton X-100, and permeabilize cells at 120×g for 10 min.\nGently remove the 12 well plate from centrifuge and wash 3–5 times using PBS (Figure 4[href=https://www.wicell.org#fig4]). troubleshooting 4[href=https://www.wicell.org#sec6.7].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2385-Fig4.jpg\nFigure 4. Example of fixed THP-1 cells to the glass coverslip",
    "The phase-contrast images of THP-1 cells morphology, fixing to the glass coverslip, were shown. The magnification on the right is twice that on the left. Scale bar: 100 μm.\nCritical: In this fixing progress, it is inevitable that a part of cells will fall off from the coverslip. Thus, we need to provide enough cells in the beginning (approximately 2–3×106 cells/well). Certainly, too many cells are also undesirable, which will influence the following experiments including immunostaining and confocal microscopy.\nImmunostaining and confocal microscopy\nTiming: 10 h\nThis step describes the approach to probe STING with immunostaining. Subsequently, capture the images with confocal microscopy. You can analyze different proteins according to your study design, which can be completed by choosing different primary antibody and secondary antibody.\nAdd 1 mL 3% BSA (bovine serum albumin) to the 12 well plate, which contains the fixed THP-1 cells.\nIncubate at room temperature (20°C–25°C) for 2 h.\nNote: In this step, you can also choose to incubate overnight (12–16 h) at 4°C.\nWash 2 times using PBS.\nAdd 400μL primary antibody (anti-STING, Proteintech, 19851-1-AP, 1:100), and incubate at room temperature (20°C–25°C) for 2 h.\nWash 4–5 times using PBS.\nAdd 400 μL TRITC-conjugated donkey anti-rabbit IgG (Jackson ImmunoResearch Laboratories, 1:100).\nIncubate at room temperature (20°C–25°C) for 2 h, protected from light.\nNote: In this part, it is indispensable to protect from light since this step.\nWash 4–5 times using PBS.\nMount the coverslips onto the glass slides using antifade mounting medium with DAPI.\nNote: If necessary, antifade mounting medium without DAPI is also available, thus you can use the blue fluorescence to stain you own protein.\nCritical: The volume of the antifade mounting medium can severely affect the quality of your sample. Normally, 3–5 μL is the best choice.",
    "Capture the images with the Leica TCS SP5 confocal laser scanning microscope (Figure 5[href=https://www.wicell.org#fig5]). troubleshooting 5[href=https://www.wicell.org#sec6.9].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2385-Fig5.jpg\nFigure 5. Confocal microscopy analysis of the endogenous STING in THP-1 cells\n(A and B) THP-1 cells were treated without (A) or with (B) cGAMP, then endogenous STING was immunostained by anti-STING antibody and TRITC-conjugated secondary antibody, followed by detection with confocal microscopy. Scale bars: 10 μm. Representative data from one experiment are shown (n = 3 biologically independent experiments)."
  ],
  "subjectAreas": [
    "Immunology",
    "Microscopy",
    "Cell Culture",
    "Cell Biology",
    "Cell-Based Assays",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}