{
  "id": 4052,
  "origin_website": "Cell",
  "title": "Protocol for improving diffraction quality of leucyl-tRNA synthetase 1 with methylation and post-crystallization soaking and cooling in cryoprotectants",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPurification of leucyl-tRNA synthetase 1 (LARS 1)\nTiming: 2 days\nIn this step, the frozen cells obtained from the bacterial expression of LARS1 are purified by affinity chromatography, ion chromatography, and gel filtration chromatography.\nPreparation of cell lysate.\nThaw the frozen cells on ice.\nResuspend the cells in 50 mL lysis Buffer A per L cell culture.\nTransfer the resuspended cells into a beaker placed on ice.\nSonicate cells for 6 min at 60 amplitudes with intervals of 2 s on and 6 s off.\nCritical: It is critical to maintain cells at a low temperature. Keep the cells on ice.\nCentrifuge the cell lysate at 24,878 × g for 1 h at 4°C.\nFilter the supernatants through 0.45 μm pore-sized Millex-HV Syringe Filter.\nAffinity Chromatography based on His tag (Figure 2[href=https://www.wicell.org#fig2]A)\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/764-Fig2.jpg\nFigure 2. Elution profile after each step purification of LARS1\n(A) Elution profile at 280 nm after Histrap chromatography of LARS1.\n(B) Elution profile at 280 nm after HiTrap Q FF chromatography of LARS1\nWash a Ni2+-affinity column (HisTrap HP 5 mL) with 50 mL Histrap elution buffer A using a GE Healthcare AKTA prime plus FPLC System.\nEquilibrate the Ni2+-affinity column with 50 mL Histrap binding buffer A.\nInject supernatants onto a Ni2+-affinity column at 3 mL/min at 4°C.\nWash the column with 50 mL Histrap wash buffer A to remove impurities.\nElute bound protein using a linear gradient of 4%–100% of Histrap elution buffer A.\nAnalyze eluted proteins by 12% SDS-polyacrylamide gel electrophoresis (SDS-PAGE) and pool the fractions.\nIon Chromatography (Figure 2[href=https://www.wicell.org#fig2]B)\nDilute eluted proteins with Q binding buffer A up to 10-fold.\nWash an ion-exchange column (HiTrap Q FF) with 50 mL Q elution buffer A using a GE Healthcare AKTA prime plus FPLC system.",
    "Equilibrate the ion-exchange column with 50 mL Q binding buffer A.\nInject the protein onto the ion-exchange column at 3 mL/min at 4°C.\nWash the column with 100 mL Q binding buffer A.\nElute the protein with a linear gradient of 0%–100% of Q elution buffer A.\nAnalyze the eluted proteins by 12% SDS-PAGE and pool the fractions.\nConcentrate the protein to 2 mL with Amicon Ultra-15 Centrifugal Filter; 30 kDa cutoff.\nGel-filtration Chromatography\nEquilibrate a HiLoad 26/600 Superdex 200 pg gel-filtration column with 120 mL gel-filtration buffer at 1 mL/min using a GE AKTA Purifier 100 FPLC System.\nCentrifuge the protein preparation at 24,878 × g for 15 min at 4°C.\nInject 2 mL of protein solution onto the gel-filtration column at 1 mL/min at 4°C.\nFlow with gel-filtration buffer at 1 mL/min at 4°C until the target protein is eluted.\nAnalyze the purified protein by 12% SDS PAGE and pool the fractions.\nConcentrate the protein to ∼25 mg/mL with Amicon Ultra-15 Centrifugal Filter; 30 kDa cutoff.\nStore at −80°C.\nCritical: It is critical to maintain perform all the steps of protein purification at 4°C.\nPurification of LARS1 using reductive methylation\nTiming: 3 days\nIn this step, we perform reductive methylation of LARS1 between the ion chromatography and the gel-filtration chromatography steps.\nThe affinity chromatography and ion chromatography were performed the same as in previous sections 1 to 3. Please use the HEPES buffer instead of Tris buffer for reductive methylation.\nReductive methylation\nTransfer 1 mL of protein at a concentration of 1 mg/mL to a microcentrifuge tube.\nWrap the tube containing protein in aluminum foil.\nAdd 20 μL of 1 M DMAB solution and 40 μL of 1 M formaldehyde solution to the protein at 4°C.",
    "Shake the tube at 4°C in the dark on a gel shaker maintained at 100 rpm for 2 h.\nThen, add again 20 μL of 1 M DMAB solution and 40 μL of 1 M formaldehyde solution to the protein at 4°C.\nShake the tube at 4°C in the dark on a gel shaker maintained at 100 rpm for 2 h, again.\nAdd 10 μL of 1 M DMAB solution and shake the tube at 4°C for 12–18 h.\nAdd 125 μL of 1 M Tris-HCl pH 7.5 to quench the reaction.\nSubsequently, add 50 mM DTT to a final concentration of 1–5 mM to stabilize the protein.\nCritical: All operations should be performed with ice-cold reagents and samples, working either out of an ice bucket or in a cold room. Keep the samples tightly wrapped in aluminum foil between manipulations. HEPES or phosphate buffer are appropriate. The buffer should not contain amino groups and/or alcohols because such groups interfere with methylation of the sample. If necessary, additional salts (sodium chloride), polyols (glycerol), and other additives may be included to maintain protein stability, homogeneity, and solubility because they do not interfere with the reaction. This has proven successful with buffers of pH 6.0–8.0. The reaction is expected to proceed faster at higher pH values.\nGel-filtration Chromatography (Figure 3[href=https://www.wicell.org#fig3])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/764-Fig3.jpg\nFigure 3. Elution profile at 280 nm after S200 gel filtration chromatography of LARS1 and methylated LARS1\nThe mass of methylated LARS1 (LARS1methyl) is increased compared to the mass of LARS1 because reductive methylation elevates the mass of the protein by 28 Da for each lysine residue present or could impact the conformation of LARS1 leading to a more extended conformer that elutes earlier then unmethylated LARS1.",
    "Equilibrate a HiLoad 26/600 Superdex 200 pg gel-filtration column with 120 mL gel- filtration buffer at 1 mL/min.\nReduce the volume of the methylated protein to 2 mL with Amicon Ultra-15 Centrifugal Filter; 30 kDa cutoff.\nCentrifuge the protein at 24,878 × g for 15 min at 4°C.\nInject the protein onto the gel-filtration column at 1 mL/min at 4°C.\nFlow with gel-filtration buffer at 1 mL/min at 4°C until the target protein has eluted.\nAnalyze the purified protein by 12% SDS PAGE and pool the fractions.\nConcentrate the protein to ∼25 mg/mL with Amicon Ultra-15 Centrifugal Filter; 30 kDa cutoff.\nStore at −80°C.\nMeasurement of binding affinity of leucine for LARS1 by microscale thermophoresis\nTiming: 1 day\nMicroscale thermophoresis (MST) is a technology used for the biophysical analysis of interactions between molecules. It is used to monitor the movement of fluorescent molecules via a microscopic temperature gradient (Asmari et al., 2018[href=https://www.wicell.org#bib2]). Overall, it is a frequently used method for quantitative characterization of intermolecular interactions and has many advantages such as low sample consumption, fast and cost-effective labeling (Bartoschik et al., 2018[href=https://www.wicell.org#bib3]; Wienken et al., 2010[href=https://www.wicell.org#bib16]).\nIn this step, we measure the binding affinity of leucine for LARS1 using a Monolith NT.115 instrument (Nano Temper Technologies) and then sought to co-crystalize LARS1 with leucine.\nPurified LARS1 is diluted to a concentration of 400 nM in a volume of 100 μL with a buffer containing Tris-HCl pH 7.5, 150 mM NaCl, 2 mM DTT, 5 mM MgCl2, 0.1% Tween-20, and 0.05% BSA.\nMix 100 μL of LARS1 (400 nM) and 100 μL of RED-tris-NTA 2nd Generation-dye (100 nM, Cat#MO-L018 in key resources table) to prepare Fluorescently-labeled LARS1.\nIncubate for 30 min at 20–22°C.\nCentrifuge the sample at 24,878 × g for 10 min at 4°C.",
    "Critical: Centrifuge the sample to avoid aggregation.\nPrepare 25 μL of 10 mM leucine (final concentration 5 mM).\nAdd 10 μL of PBS buffer with 0.05% Tween-20 to PCR tubes 2–16.\nCritical: Prepare small microreaction tubes. Tubes with a volume of 200 μL or less were found to be suitable.\nThus, the effect of buffer dilution was avoided. The buffers in all tubes 1 to 16 were identical. Gradients of salt, DMSO, or other additives may interfere with the results.\nTransfer 20 μL of leucine into PCR tube 1.\nTransfer 10 μL of leucine from PCR tube 1 to PCR tube 2 and mix by pipetting up and down 3–4 times. Repeat for PCR tubes 3–16. Discard the extra 10 μL from PCR tube 16.\nCritical: Pipet up and down carefully to avoid bubbles or droplets.\nAdd 10 μL of labeled LARS1 to each PCR tube (1–16) and mix by pipetting. The final LARS1 concentration is 100 nM. This concentration is used to calculate the Kd value.\nLoad the samples into capillaries by capillary action and place in a tray.\nMeasure the samples at 80% LED power using a green filter and 40% MST power.\nThe Kd is determined using the MO.Affinity Analysis Kd fit (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/764-Fig4.jpg\nFigure 4. Binding affinity of leucine for LARS1\nBinding affinity of leucine for LARS1 was determined using MST. The extract Kd values are listed in Figure 2[href=https://www.wicell.org#fig2] (n = 3; means ± SD). LARS1 WT binds to leucine, whereas LARS1 Y52A/Y54A/H91A does not bind to leucine. Figure reprinted with permission from Kim et al. (2021)[href=https://www.wicell.org#bib7].\nMeasurement inflection temperature (Ti) of LARS1\nTiming: 1 h\nDifferential Scanning Fluorimetry (DSF) measures protein unfolding by monitory changes in fluorescence as a function of temperature. DSF measures the Tryptophan fluorescence.",
    "Dilute the purified LARS1 to a concentration of 1 mg/mL with a buffer containing Tris-HCl pH 7.5, 150 mM NaCl, 2 mM DTT, 5 mM MgCl2, 0.1% Tween-20.\nTransfer 20 μL LARS1 of into a PCR tube.\nAdd leucine to PCR tubes 2–5 at final concentrations of 2 mM, 5 mM, 10 mM, and 20 mM, respectively, and mix with LARS1.\nIncubate 30 min at 4°C.\nLoad the samples into capillaries by capillary action and place in a tray.\nIntrinsic fluorescence was recorded at 330 nm and 350 nm while heating the sample from 35 to 95°C at rate 3°C/min. The ratio of fluorescence (350/330 nm) and the Ti were calculated by Tycho NT. 6 (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/764-Fig5.jpg\nFigure 5. Inflection temperature (Ti) of LARS1 with leucine\nThe first derivatives of the fluorescence ratio (350–330 nm) are plotted. LARS1 was incubated with leucine and the inflection temperature (Ti) was measured. The extracted Ti values are listed in Figure 3[href=https://www.wicell.org#fig3]. Figure reprinted with permission from Kim et al. (2021)[href=https://www.wicell.org#bib7].\nLARS1 post-crystallization soaking and cooling in cryoprotectants at −20°C and structure determination step\nTiming: 7–14 days\nIn this step, we obtain crystals of LARS1-Leusyn, LARS1-ATPsyn, LARS1-Leu-AMSsyn, and LARS1methyl-Leu-AMSsyn (Kim et al., 2021[href=https://www.wicell.org#bib7]). And then, we performed the post-crystallization soaking and cooling in cryoprotectants at −20°C (Rould et al., 1991[href=https://www.wicell.org#bib14]; Heras and Martin, 2005[href=https://www.wicell.org#bib6]). Finally, we collected the X-ray data and performed the structure determination by Phenix (Liebschner et al., 2019[href=https://www.wicell.org#bib10]).\nInitial crystallization was performed at 20°C using the sitting-drop vapor diffusion method with an MRC 2-well crystallization plate and index kit (Hampton Research).\nThaw purified and frozen LAS1 and methylated LARS1 on ice.",
    "Incubate LARS1 with different molecules (2 mM leucine for LARS1-Leusyn), (2 mM leucine and 1 mM ATP for LARS1-ATPsyn), (2 mM leucine and 1 mM Leu-AMS for LARS1-Leu-AMSsyn) and incubate the methylated LARS1 with (2 mM leucine and 1 mM Leu-AMS for LARS1methyl-Leu-AMSsyn) for 1 h prior to crystallization.\nLARS1-Leusyn crystals are obtained by mixing 1 μL of ∼25 mg/mL LARS1 with 1 μL of a reservoir solution containing 0.1 M bis-tris pH 6.5, and 1.6 M ammonium sulfate at 20°C using the hanging-drop vapor diffusion method within 2–3 days. Crystals of LARS1-ATPsyn, LARS1-Leu-AMSsyn, and LARS1methyl-Leu-AMSsyn are obtained by mixing 1 μL of ∼17 mg/mL LARS1 or methylated LARS1 with 1 μL of reservoir solution containing 0.1 M HEPES pH 7.1, 0.42 M ammonium sulfate and 24% PEG 3350 at 20°C using the hanging-drop vapor diffusion method over 5 days.\nTransfer the LARS1-Leusyn crystals to a 9 Well Glass Plate filled with 20 μL of cryoprotectant solution containing 25% glycerol and 2 mM leucine in the reservoir using a cryoloop and seal with Crystal Clear sealing tape.\nImmediately put the 9 Well Glass Plate in the −20°C freezer and then store for 1 day to stabilize.\nRemove the plate with LARS1-Leusyn crystals from the freezer.\nTransfer LARS1-Leusyn crystals to a Uni-Puck under liquid nitrogen using the cryoloop.\nTransfer the Uni-Puck with LARS1-Leusyn crystals to a dry shipper filled with liquid nitrogen and flash-freeze until X-ray diffraction data collection (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/764-Fig6.jpg\nFigure 6. Post-Crystallization Soaking & Cooling in cryoprotectant of LARS1-Leusyn crystals\n(A) Pick up the LARS1-Leusyn crystals with a cryoloop.\n(B) Transfer the LARS1-Leusyn crystals to 9 Well Glass Plate filled with 20 μL of cryoprotectant solution and seal with Crystal Clear sealing tape. Stabilize at −20°C for 1 day.",
    "(C) Transfer the LARS1-Leusyn crystals to a Uni-Puck under liquid nitrogen.\n(D) Transfer the Uni-Puck to a dry shipper filled with liquid nitrogen until X-ray diffraction data collection.\nThis method was used to prepare LARS1-Leusyn crystals subsequently deposited in PDB with the code 6KQY.\nCritical: This step should be performed rapidly in a cold room (4°C). The crystals can be damaged at 20°C.\nTransfer the crystals of LARS1-ATPsyn, LARS1-Leu-AMSsyn, and LARS1methyl-Leu-AMSsyn to a cryoprotectant solution containing 25% glycerol in reservoir solution and then immediately flash-freeze in liquid nitrogen.\nCollect diffraction datasets at a synchrotron.\nIndex, integrate, and scale the images using HKL2000 (Otwinowski and Minor, 1997[href=https://www.wicell.org#bib12]).\nObtain initial phases by molecular replacement (MR) using a search model (PDB entry: 1WKB) as an initial model, which was performed using Phaser (Murshudov et al., 1997[href=https://www.wicell.org#bib11]). We found one molecule in asymmetric unit.\nDensity modification, including averaging and solvent flipping, are conducted using Solomon in CCP4i Suite, followed by automated model building based on density-modified data with the Autobuild module in PHENIX (Liebschner et al., 2019[href=https://www.wicell.org#bib10]).\nThe all structures were refined with PHENIX (Liebschner et al., 2019[href=https://www.wicell.org#bib10]).\nThe remaining residues are built manually using Coot (Emsley and Cowtan, 2004[href=https://www.wicell.org#bib4])."
  ],
  "subjectAreas": [
    "X-Ray Crystallography",
    "Structural Biology",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}