{
  "id": 19632,
  "origin_website": "Jove",
  "title": "Automatic Identification of Dendritic Branches and their Orientation",
  "procedures": [
    "NOTE: The Israeli Ministry of Health approved the use of mice under protocol IL-218-01-21 for the ethical use of experimental animals. SOA is only compatible with Windows 10 and Python 3.9. It is available as an open-source code: https://github.com/inbar2748/DendriteProject. At this link, there is also a README.DM file that has directions for downloading the software, a link to the software's website, and a requirements file containing information on the required versions of all the packages. Additional examples of analysis performed using the software have been provided there as well. \nimgsrc://cloudfront.jove.com/files/ftp_upload/62679/62679fig01.jpg\nFigure 1: SOA workflow for segmentation and growth direction analysis. Shown are the processing steps of fluorescent images of dendritic networks and data analysis. The 2D image is uploaded, segmented (in two steps: dendritic branches are detected as lines, and then the relevant lines are merged), and the spatial information of each dendritic branch is obtained. The data are collected for all the dendritic branches in the image. Finally, the data are analyzed to give the desired morphological parameters. Abbreviation: SOA = segmentation and orientation analysis. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62679/62679fig01large.jpg]\n1. Open the SOA application.\nOpen the URL address: https://mega.nz/folder/bKZhmY4I#4WAaec4biiGt4_1lJlL4WA, find the SOA.zip zipped folder, and download the ZIP file by double-clicking.\nUnzip the folder by right-clicking on SOA.zip and choose Extract Files. Observe the Extraction Path and Options window that opens and the Destination Address text box that displays the path for the extracted files. To extract to a different location, click on one of the folders in the window's right panel to make it the destination folder. Click OK to extract the files to that folder.\nOpen the extracted SOA file and double-click on SOA.exe. Wait for a black window to open, after which the application will appear.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62679/62679fig02.jpg",
    "Figure 2: Example of a workflow using the SOA's GUI. Left column: GUI sections of the workflow. Middle column: image of a dendritic network, processed during the workflow (Scale bar: 20 µm). Right column: magnification of the area marked by a red rectangle in the images of the middle column (Scale bar: 4 µm). Step 1: Selection and uploading of an image. Step 2: The first stage of segmentation is the detection of lines that represent the identified dendritic branches. Step 3: The second stage of segmentation is the proximity-based merger of segment lining in individual dendritic branches. The settings of all steps can be modified. Abbreviations: SOA = segmentation and orientation analysis; GUI = graphical user interface. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62679/62679fig02large.jpg]\n2. Open an image to analyze.\nIn the SOA Viewer Upload menu bar | select Choose File | choose an image from the computer files | click on it (.png .jpg .tif .bmp files only) | Open | observe the path of the file | Next.\n3. Segmentation optimization\nNOTE: In the SOA Viewer Properties menu bar, change the values of the selected parameters to adjust the segmentation process settings. A detailed description of the parameters, such as the Threshold, is given in the Supplemental Material.\nIn Edges, adjust the threshold for the display by selecting the Threshold and entering a number.\n\tNOTE: The lower the number for the threshold, the more lines are detected. Threshold is a number that ranges from 0 to 255. The default value has been set to 0.\nIn Merge Lines:\n\t\nAdjust the minimum distance to merge for the display by selecting the Min distance to merge and entering a number.",
    "NOTE: The Min distance to merge ranges from 0 to 30 pixels. The default value is set to 20.\nAdjust the minimum angle to merge for the display by selecting the Min angle to merge and entering a number.\n\t\tNOTE: The Min angle to merge ranges from 0 to 30°. The default value is set to 10.\nClick on Create Preview Segmentation Image.\n\tNOTE: A preview image of the segmentation results will be displayed according to the updated values. In addition, the number of lines before merging and the number of lines after merging will be displayed.\nChange the parameters to achieve maximum identification of segments. If there is a need to change the Properties, click on the Close window button and follow steps 3.1-3.4.\n4. Create the output files.\nPress OK to visualize the segmentation images and the analyzing graphs. Observe the window that appears for selecting a location where the .xlsx file will be saved.\ninsert a file name | Choose Save | wait for the .xlsx file with data to be created and saved.\n\t​NOTE: In addition to the .xlsx file, the following files will be automatically displayed: a file that presents the original image, the line recognition image, the final image of the segmentation, and three analysis graphs.\n5. Navigation toolbar\nNOTE: A navigation toolbar is included in all figure windows and can be used to navigate through the data set. Each of the buttons at the bottom of the toolbar is described below.\nTo navigate back and forth between previously defined views, use the Forward and Back buttons.\n\tNOTE: The Home, Forward, and Back buttons are similar to the Home, Forward, and Back controls on a web browser. Home returns to the default screen, the original image.",
    "Use the Zoom button to pan and zoom. To activate panning and zooming, press the Zoom button, then move the mouse to a desired location in the image.\n\t\nTo pan the figure, press and hold the left mouse button while dragging it to a new position. Release the mouse button, and the selected point in the image will appear in the new position. While panning, hold down the x or y keys to restrict the motion to the x or y axes, respectively.\nTo zoom, hold down the right mouse button and drag it to a new location. Move right to zoom in on the x-axis and move left to zoom out on the x-axis. Do the same for the y-axis and up/down motions. When zooming, note that the point under the mouse remains stationary, allowing to zoom in or out around that point. Use the modifier keys x, y, or CONTROL to limit the zoom to the x, y, or aspect ratio preserve, respectively.\nTo activate the Zoom-to-rectangle mode, click the Zoom-to-rectangle button. Place the cursor over the image and press the left mouse button. Drag the mouse to a new location while holding the button to define a rectangular region.\n\tNOTE: The axes view limits will be zoomed to the defined region when the left mouse button is pressed. The axes view limits will be zoomed out when the right mouse button is pressed, placing the original axes in the defined region.\nUse the Subplot-configuration tool to configure the appearance of the subplot.\n\tNOTE: The left, right, top, and bottom sides of the subplot, as well as the space between rows and columns, can be stretched or compressed.",
    "To open a file save dialog, click the Save button and save the file in the following formats: .png, .ps, .eps, .svg, or .pdf.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}