{
  "id": 10269,
  "origin_website": "Jove",
  "title": "Generation of Self-assembled Vascularized Human Skin Equivalents",
  "procedures": [
    "1. Preparation for 3D culture\nPrepare rat tail collagen stock at 8 mg/mL, using established protocols50,51,52. Alternatively, rat tail collagen can be purchased from vendors (see materials list) at appropriate concentrations.\n\tNOTE: Collagen can be prepared or purchased at different concentrations in the range of 3-10 mg/mL, or higher50,51,52. The calculations in the protocol assume an 8 mg/mL concentration but can be adjusted based on the needs of the researcher.\nExpand cell lines: Endothelial and fibroblast cells need to be ready for seeding at the start of 3D collagen dermal component generation (step 2). Keratinocytes need to be ready on day 7 of 3D culture. One complete VHSE construct requires 7.5 x 105 endothelial cells; 7.5 x 104 fibroblasts; and 1.7 x 105 keratinocytes for generation (Table 1).\n\tNOTE: These densities are appropriate for 12-well size permeable tissue culture inserts or equivalent. Cell density and format can be scaled up or down based on the needs of the researcher. To clarify, this amount of endothelial and fibroblast cells will seed 1-3 dermal components, while each epidermal component requires 1.7 x 105 keratinocytes.\nPerform all cell centrifugation in this protocol for 5 min at 300 x g, but this may be decreased for more fragile cell types.\n2. Generation of 3D collagen dermal component\nNOTE: Step 2 is a time sensitive procedure and must be completed in one setting. It is advised to complete a quality check of the collagen stock to ensure proper gelation and homogeneity before beginning dermal component seeding, see troubleshooting in discussion.\nAcellular collagen layer preparation and seeding",
    "Prepare two 1.7 mL capped microcentrifuge tubes, one for the acellular support and one for the cellular dermis. Amounts given in this step will prepare 1 mL of 3 mg/mL collagen (target collagen concentration), sufficient for (3) 12-well size VHSEs. Equations are listed if adjustment is necessary. Both volume and density can be scaled based on the needs of the researcher (common reference numbers are given in Table 2).\nTo each tube, add 100 µL of culture grade 10x Phosphate-buffered saline (PBS) (one tube will yield 3 VHSEs) and add 8.6 µL of 1 N NaOH. Place capped tubes on wet ice to chill for at least 10 min.\nCs = Collagen Stock Concentration\n\t\tVf = Final Volume of Collagen Needed\n\t\tCt = Target Collagen Concentration\n\t\tVs = Volume of stock collagen necessary for desired amount (Vf)\n\t\tVpbs = Volume of 10X PBS needed for target collagen concentration (Ct)\n\t\tVNaOH = Volume of 1N NaOH needed for Ct\n\t\tVmedia = Volume of media, call suspension, or ddH2O needed for Ct\nimgsrc://cloudfront.jove.com/files/ftp_upload/62125/62125eq01.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/62125/62125eq02.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/62125/62125eq03.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/62125/62125eq04.jpg\nPrepare 1000 and 250 µL positive displacement pipettes for use and set aside. As later steps are time sensitive, it is convenient to load pipette tips and set volumes (375 µL and 125 µL, respectively). Additionally, setup a normal 1000 µL pipette for 516 µL.\n\t\tNOTE: Positive displacement pipettes can be substituted with normal pipettes if necessary, but because of the high viscosity of collagen and the time/temperature sensitivity of this procedure, positive displacement pipettes are recommended to help produce consistent seeding results. If using normal pipettes, use slow movements.\nPrepare culture insert well plates: Use sterile forceps to place three 12-well size culture inserts into a sterile 12-well tissue culture plate, place into the center columns.",
    "Set out cold media appropriate for fibroblast and endothelial cell types.\nAfter cooling of capped tubes, place one tube (for the acellular support) on a rack with the contents visible. Leave the other tube (for the cellular dermis) on ice.\nRemove 8 mg/mL collagen stock from refrigeration and place on wet ice.\n\t\tNOTE: Do not use freezer ice or -20 °C benchtop coolers, as this will freeze the collagen.\nTo the cold capped tube, add 516 µL of media and immediately add 375 µL of cold collagen using the 1000 µL positive displacement pipette. Dispense collagen into the solution (not to side of the tube). Immediately remove the empty pipette tip and switch to the prepared 250 µL positive displacement pipette to mix.\n\t\t\nMix quickly but gently to prevent bubble formation, do not remove tip from the solution, if possible. Mix until the solution is of homogenous color, which typically takes about 5 pipette cycles or 10 s (if using media with phenol red, the color will become lighter and uniform). When mixing, be sure to draw from different positions of the tube (bottom and top) for uniform mixing.\n\t\t\tNOTE: This can be performed with 516 µL of cell culture grade water or other cell culture grade liquid, however, phenol red of most media is a good indicator of the mixing. Use either fibroblast or endothelial media that was used for 2D expansions.",
    "Immediately disperse 125 µL of acellular collagen onto the membrane of each of the three 12-well culture inserts. To ensure uniform coverage of the acellular collagen gel, rock the dish; if that does not create uniform membrane coverage then use the pipette tip to essentially paint the membrane by gently spreading collagen around; avoid applying pressure to the membrane. Gelation begins almost immediately; perform this step quickly to ensure even coverage.\n\t\tNOTE: There will be excess acellular collagen. The volume can be reduced, however, preparing less than 1 mL of collagen suspension can result in difficulties mixing the solution and insufficient gelation.\nImmediately move the 12-well plate to a 37 °C cell culture incubator to let it gel for at least 20 min (acellular collagen can gel for longer if needed; during this gelation time, proceed to step 2.2). Remove the collagen suspension from ice and place back into refrigeration (collagen is most stable at 4 °C).\nCell suspension & seeding preparation\n\tNOTE: For the culture timeline of this protocol, this corresponds to Submersion Day 1 (SD1)\n\t\nDuring gelation of the acellular collagen support, trypsinize and count the endothelial and fibroblast cell lines.\nSuspend 7.5 x 105 endothelial cells and 7.5 x 104 fibroblasts in 258 µL of their respective medias and combine cell suspensions to create a 516 µL aliquot. Maintain the cell suspensions on wet ice until use.\nPrepare 1000 and 250 µL positive displacement pipettes for use and set aside. As later steps are time sensitive, it is convenient to load pipette tips and set volumes (375 µL and 250 µL, respectively). Additionally, setup a normal 1000 µL pipette for 516 µL.\nCell laden collagen seeding of dermal compartment\n\t\nAfter the gelation period, remove the 12 well plate of acellular collagen from the incubator.",
    "NOTE: If this collagen is not gelled after 30 min, do not continue the procedure as there was likely a mistake during seeding or the collagen stock may have a problem (see troubleshooting in discussion).\nRemove the 1.7 mL capped tube from wet ice (contains 10x PBS and NaOH). Place the tube in a rack so that the contents are visible. Loosen/open all caps (cell suspension, cold capped tube).\nRemove the stock collagen (8 mg/mL) from 4 °C refrigeration and place it on wet ice. Leave the cap open.\nAdd the 516 µL of cooled cell suspension to the cold capped tube. Use the 1000 µL positive displacement pipette to immediately pipette 375 µL of cold collagen solution directly into the solution of the capped tube.\nExpel all collagen from pipette into the tube and discard the positive displacement pipette tip. Immediately switch to the 250 µL positive displacement pipette and mix the collagen solution.\nMix the collagen solution as completed previously (quickly but gently to prevent bubble formation), do not remove tip from gel if possible. Mix until solution is homogenous (about 5 pipette cycles or 10 s). When mixing be sure to draw from different positions of the tube (bottom and top) for uniform mixing.\nOnce mixed, immediately transfer 250 µL of cellular collagen solution onto the acellular collagen supports in each of the three 12-well culture inserts. To ensure uniform coverage of the acellular collagen support, rock the dish and/or use the positive displacement pipette to gently move the freshly seeded cellular collagen around without disturbing the acellular layer.\nImmediately move the 12-well plate to 37 °C cell culture incubator to let it gel for at least 30 min. Place collagen back into 4 °C refrigeration after use.",
    "After the 30-minute gel time, gently tilt the plate to assess the gelation. Ensure the collagen is solidified.\nAdd 500 µL and 1000 µL of blend media (half endothelial and half fibroblast maintenance media) to the upper chamber and lower chamber of the insert, respectively (top first, then bottom to prevent hydrostatic pressure from pushing collagen up). Add media slowly to the side of the well, not directly onto collagen gel, to minimize disruption of the collagen.\n\t\t\nEnsure that the collagen gel is submerged, add more media if necessary. Place the well plate in the cell incubator for overnight incubation. At this stage, media contains 10% FBS; the normal maintenance media for each cell line (timeline and schematic given in Figure 1, A).\n\t\t\tNOTE: Media throughout VHSE culture can be adapted for custom cell types; some optimization may be necessary.\nSubmersion Day 2 (SD2) media change\n\t\nChange 10% FBS media in VHSE wells to 5% FBS half fibroblast, half endothelial media supplemented with 100 µg/mL L-Ascorbic Acid. Add 500 µL to upper chamber of the culture insert at the side of the well (again, add carefully to the sidewall to minimize disruption of the collagen) and add 1000 µL to lower chamber.\nRenew media every 2 days (SD4 and SD6) until Submersion Day 7 (SD7).\nUse a manual pipette to remove media from the wells. Using an aspirator is possible but can result in damage or destruction of the construct.",
    "NOTE: L-ascorbic acid must be made up fresh every 2-3 days (it oxidizes in solution to produce hydrogen peroxide thus, inducing oxidative stress and eventually cellular damage53). Thus, media must be changed every 2-3 days from SD2 until the end of the VHSE culture since L-ascorbic acid is present. It is easiest to make a stock of media and add a freshly prepared amount of L-ascorbic acid to a media aliquot every feeding day. Use culture grade water or media as a solvent and prepare fresh L-ascorbic acid at 100 mg/mL. L-ascorbic acid stimulates collagen synthesis by fibroblasts at an appropriate rate and promotes collagen stability54,55,56; it also decreases endothelial permeability and maintains vessel wall integrity56,57 and additionally contributes to epidermal barrier formation6,58.\n3. Seeding of epidermal component and stratification induction\nSubmersion Day 7 (SD7): seed keratinocytes\n\tNOTE: Seed keratinocytes to establish the epidermis on SD7. This time point can be shifted based on the needs of the researcher. Duration of submersion culture without keratinocytes should not exceed 9 days, as a longer submersion often leads to increased dermal contraction. If contraction occurs before SD7, it is recommended to shorten the submersion period to 5 days and seed epidermis on SD5. Optimize the submersion period as required for specific experiments (see troubleshooting in discussion).\n\t\nCulture keratinocytes (N/TERT-120,59 or other appropriate cells) to their confluency limit before trypsinization and seeding onto VHSEs. For N/TERT-1 cells, confluency should not significantly exceed 30% to prevent un-wanted differentiation of keratinocytes in 2D culture59. For other appropriate cell lines, such as primary human epidermal keratinocytes, a confluency limit of 75-80% is generally used60.\nAfter trypsinization, count and suspend 510,000 cells in 600 µL of Human Skin Equivalent (HSE) Differentiation media supplemented with 5% FBS (Table 1).",
    "NOTE: 510,000 cells in 600 µL allows 170,000 cells/construct when seeding 200 µL per construct (3 VHSEs).\nUsing a manual pipette, collect and discard media currently in the bottom and top chamber for each construct well. Be sure to collect as much media as possible. Collect media that may be stuck directly under the permeable membrane by gently placing the pipette tip under the culture insert membrane and knocking the insert out of place temporarily. Media may have been stuck due to surface tension. Be sure that the inserts sit flat in their wells before proceeding. Using an aspirator is possible but can result in damage or destruction of the construct.\nAdd 1 mL of HSE media supplemented with 5% FBS to the lower chamber of each well. Then add 200 µL of cell suspension to the top chamber of each well. Seed directly onto the dermal construct surface. Let keratinocytes settle for 2 h in the incubator.\nTwo h after seeding the keratinocytes, carefully add 300 µL of HSE media supplemented with 5% FBS to the top chamber of each construct well; slowly pipette media onto side of culture insert. Load media into the top chamber very carefully as to not disturb settled keratinocytes that may not have adhered tightly to the underlying collagen gel yet.\nAfter loading the media, place construct back into the incubator.\nSubmersion Day 8/9 (SD8 or SD9)\n\t\nMake up HSE media supplemented with 1% FBS and 100 µg/mL L-ascorbic acid.\nRemove media from both the upper and the lower chambers with a manual pipettor.\nAdd 500 µL media into the top chamber first and then 1 mL into the bottom chamber. (This step can be done on SD8 or SD9)\nSubmersion Day 9/10 (SD9 or SD10, this should be the day after step 3.2)",
    "Make up serum free HSE differentiation media with 100 µg/mL L-ascorbic acid.\nRemove media from both the upper and the lower chambers with a manual pipettor.\nLoad 500 µL into the upper chamber and 1 mL in the lower chamber.\nAir-Liquid Interface Day 1 (ALI1)\n\tNOTE: ALI is performed the day after step 3.3.\n\t\nLift each construct to air-liquid interface (ALI) by removing media waste from the upper chamber only. Use a manual pipette to get as close to the epidermal layer as possible without touching or damaging it.\nTilt the plate slightly at different angles to collect the media. Remove as much media as possible in this step. Add approximately 2 mL of sterile water to the surrounding wells in the plate to maintain consistent humidity; keep the wells filled with water throughout culture.\nCheck the plate a few h later to make sure the keratinocytes are still at the air-liquid interface. If there is media in the upper chamber remove it. Keep track of how much media is removed for each VHSE well, (The initial volume of upper and lower chambers (1500 µL) - media removed = a good starting point for ALI feeding).\n\t\tNOTE: VHSEs do not necessarily require the same media level for air lift; usually if the VHSEs are seeded together then they need about the same level of media for air lift, but this is not always the case. Adjust the volumes as needed to maintain ALI but ensure that the media levels are not so low that the VHSEs dry out. It is safer to be cautious and remove small media amounts daily until a balance between air lift and hydration has been met.\nALI Day 2 (ALI2)",
    "From this point on, only use serum free HSE media supplemented with 100 µg/mL L-ascorbic acid. Change media on ALI Day 2 (ALI2). If there is media in the top chamber, remove it and add it to the amount of removed media recorded previously. Calculate the volume of media needed using the equation in the previous step. For example: If 200 µL of media was removed from the upper chamber then add 1300 µL to establish ALI (as 1500 µL - 200 µL = 1300 µL)\nUse the volume calculated to load into the bottom chamber of each well, then place the plate back into the cell incubator. Keep track of the volume used per day. When using the recommended collagen amounts in 12-well culture inserts, the usual range of ALI values falls between 750 µL and 1300 µL. Typically, the volume decreases over culture maturation and becomes consistent around week 2/3 of ALI. Depending on the culture specifics, this number may change and must be optimized (as described in 3.4.2 - 4.1).\n4. Routine maintenance of vascular human skin equivalent\nFrom ALI Day 3 (ALI3) through culture endpoint: Renew media of the lower chamber every 2-3 days using serum free HSE media with 100 µg/mL L-ascorbic acid. Continue to adjust and track the media level needed in the bottom chamber for ALI as described in Step 3.5.2.",
    "As the epidermal surface must remain in contact with the air, check and adjust the media level daily until consistent ALI levels are established. The epidermal layer should look hydrated, not dry, but there should not be media pooled on top of the construct. Cultures with 8 weeks of ALI have provided the most consistent morphology and expression; however, depending on the application, cultures of 4 to 12 weeks may be appropriate. Culture duration for different cell and culture conditions may need to be optimized.\n\tNOTE: Changing media Monday, Wednesday, Friday is a good practice. The VHSEs are healthy over the weekend, but media should be changed early on Monday and late on Friday. After entirely completing steps 1-4, the generation of a VHSE is complete. Steps 5-end of the protocol are optional processing and imaging techniques that have been optimized for this type of 3D construct.\n5. Fixation and permeabilization of 3D constructs\nNOTE: Step 5 has been optimized for imaging techniques specific to this 3D construct that are outlined in the remainder of the protocol. The following steps are not necessary for generating a VHSE.\nFixation/permeabilization\n\t\nCarefully remove all media from upper and lower chambers of each well at the end point of the culture period.\n\t\tNOTE: The epidermal layer is possibly fragile, handle with care and do not agitate the epidermis with aggressive pipetting.\nAdd 4% paraformaldehyde (PFA) in PBS (pH 6.9) to the upper chamber wall (not directly on the construct) and then to the lower chamber, to pre-fix each construct. Add 1 mL per chamber and expose for 5 min at room temperature.\n\t\tCAUTION: PFA is dangerous and should be handled with care and appropriate personal protection equipment (PPE), including eye protection.",
    "Remove 4% PFA solution after 5 min and add the 0.5% Triton X 100 in 4% PFA solution to the upper and lower chambers as described in the previous step. Expose for 1 hour at room temperature; VHSE construct does not require a sterile environment from now on.\nAfter 1 hour, carefully remove the permeabilization/fixation solution from both the chambers and wash the sample 3 times with 1x PBS.\nStore samples in PBS in 4 °C refrigeration or immediately stain. To store the samples, wrap the dish in a plastic wrap and then foil to minimize evaporation and light exposure\n\t\tNOTE: Pause point - After fixation and permeabilization, this procedure can be paused since the samples are stable for several weeks if prepared as outlined in step 5.1.5. Alternatively, staining (as described in step 6) can be completed immediately following step 5.\n6. Immunofluorescent staining of 3D constructs\nConstruct Preparation\n\tNOTE: VHSEs stain well when separated from porous membrane of the culture insert; separation from the membrane is also necessary for un-obstructed imaging and enable reduced volumes for staining.\n\t\nTo prepare the construct for immunofluorescent staining, turn an insert upside down and place it over its well on the well plate (if the VHSE falls, it will fall into the well with PBS) (Supplemental Figure 1A).\nStabilize the insert with one hand over the well while using fine tip forceps and/or an precision knife to cut about half of the circumference of the insert membrane. Cut as close to the plastic housing as possible with a gentle hand to prevent damage of the VHSE construct.",
    "Using the fine tip forceps, grab the edge of the cut membrane flap and gently peel the porous membrane off the insert as well as the VHSE construct. Do this very carefully and slowly to prevent damage to the VHSE construct structure. If the VHSE construct separates easily then it should fall into the well below, if it gets stuck on the side of the chamber then use the fine tip forceps or a small scoopula to move it to the well. Be very mindful of the epidermal layer as it is usually fragile (Supplemental Figure 1A).\n\t\tNOTE: Sometimes the membrane does not come off easily or comes off in pieces, if this happens use the tools to carefully pull the membrane and VHSE construct apart. Ensure the VHSEs do not dry out during this process by dipping in PBS, if necessary.\nOnce the VHSE is in the well, discard any remaining pieces of the insert membrane and keep the culture insert housing in each well to hold the VHSEs in a submerged position during staining.\nStaining\n\tNOTE: Staining and associated handling/manipulation and washes should be performed as gently as possible since VHSEs can be fragile. If portions of the epidermis lift off, the pieces can be stained separately; upper layers of the epidermis are fragile and go through natural desquamation4, but for analysis it is important to maintain integrity as much as possible.",
    "Prepare the chosen primary antibody stains in 700 µL of blocking buffer per construct well (typically, all primary antibodies can be in the same staining solution, but this should be confirmed for new antibodies). 700 µL works for 12-well size, but may be adjusted for other culture formats. Recommended concentrations of primary and secondary antibodies with blocking buffer recipe are given in Table 3 (optimization may be required).\nRemove any PBS from the well using a manual pipette, be careful to pipette away from VHSEs (as VHSEs are floating, vacuum aspiration is not recommended).\nAdd the primary stain solution to each well and place the culture insert housing into the well to keep the VHSE submerged in fluid (Supplemental Figure 1B). Wrap the well plate with plastic wrap. Foil and stain for 48 h in 4 °C refrigeration without agitation or rocking (rocking may damage the VHSE construct).\nAfter 48 h, prepare secondary antibodies and chemical stains in 700 µL of blocking buffer (per well).\nRemove the culture insert housing and the primary stain solution and wash with 1x PBS, 3x for 5 min before adding the secondary stain solution. Place the culture insert housing back into the well to keep VHSE construct submerged (Supplemental Figure 1B). Expose for 48 h in 4 °C refrigeration without agitation or rocking.\nAfter 48 h exposure, remove the stain solution with a manual pipettor and gently wash 3x with PBS; do not pipette fluid straight onto the VHSEs as they may be fragile. Rehydrate with excess PBS and place the culture insert housing back into the well to keep the VHSE submerged and hydrated during storage (store by wrapping in plastic wrap and foil to minimize evaporation and light exposure)\nClearing (optional & terminal)",
    "NOTE: Clearing is optional for imaging. If completed, it should be done after staining/imaging the sample completely since clearing prevents further staining, may alter fluorophore performance, and may damage VHSE structure. Multiple tissue clearing methods exist49,61,62 and can be optimized for specific projects. Methyl salicylate clearing, described below, is both simple and effective for VHSE. The following clearing technique must be completed in glass containers and pipette tips must be glass or polypropylene (polystyrene will dissolve in contact with methyl salicylate). Complete all clearing procedure in a well-ventilated area or fume hood.\n\t\nAdd 100% methanol to a small shallow glass container (glass Petri dishes work well). Use the smallest possible container that will fit the construct (to minimize reagent waste).\nRemove the construct from the well plate using forceps/scoopula (Supplemental Figure 1C) and place in the methanol filled container. Add more methanol if construct is not submerged.\nDehydrate the VHSE construct in methanol for 3 x 10 min immersions; fully replace methanol after each immersion and promptly remove methanol after the last bath. Over the course of this procedure, the construct may become more opaque and shrink slightly.\n\t\tNOTE: These durations and repetitions have been optimized but methanol and the following methyl salicylate procedures may need to be customized, depending on the specific culture format and stains.\nImmediately after removing methanol, add methyl salicylate and submerge the VHSE in 5 x 5 min immersions. Fully replace the reagent after each immersion and leave the VHSE in the 5th immersion solution for storage. Over the course of this procedure, the construct becomes transparent.",
    "Image the construct or store at 4 °C. After clearing, complete all imaging as soon as possible, as the fluorophores may degrade in methyl salicylate within days. Clearing causes the constructs to become brittle and the extended storage, while not recommended, needs a regular check to ensure that there is a sufficient amount of methyl salicylate.\n7. Confocal Imaging of 3D constructs\nNOTE: Imaging through tissue culture plastic will not yield the same quality of image as imaging through coverslip glass, this method describes fabrication of a custom glass-bottom well to prevent drying during confocal imaging. Typically, this is sufficient for at least 3 h of imaging.\nTwo days before imaging: prepare polydimethylsiloxane (PDMS)\n\t\nPrepare PDMS48,63,64 at a suggested concentration of [9:1], base: crosslinker. Prepare 30 g of PDMS total: 27 g of base component and 3 g of crosslinker. Place any clean mixing vessel on a weighing balance and tare the scale. Add the base (27 g) and then add the crosslinker (3 g) to achieve a total of 30 g. Always add base prior to crosslinker.\nStir the solution vigorously for at least 4 min; this will create small bubbles. After sufficient mixing, pour the PDMS into a 100-mm Petri dish, or similar flat bottom heat resistant container.\nDe-gas the PDMS in a vacuum chamber until all bubbles from mixing disappear and PDMS is clear. Release the vacuum slowly and remove the PDMS (slowly). Place the dish into an oven to cure overnight (50-60 °C); ensure the dish is sitting flat for PDMS to cure evenly.\n\t\tNOTE: After curing, PDMS should be clear and the surface should be smooth and not sticky (stickiness may indicate inadequate mixing).\nOne day before imaging: PDMS well preparation",
    "Using a steel punch or handheld precision knife, punch or cut out a circular well from the PDMS sheet prepared in 7.1. The well should be around the same size as the VHSE construct. Cut a square patch around the circular well to create a single PDMS well. The 30 g PDMS amount prepared should yield at least four custom wells.\n\t\tNOTE: The PDMS well must be close to the size of the VHSE construct. It must constrict sample motion during imaging. Multiple wells can be fabricated at once and stored indefinitely in a clean container.\nUsing a glass coverslip of a similar size to the PDMS well, add cyanoacrylate glue (e.g., super glue) to the bottom surface of the PDMS (the smooth surface that was in contact with the Petri dish) and smear evenly with a disposable pipette tip. Center, and press the PDMS well onto the glass while leaving a clear glass window within the punched circle (ensure the glue is not smeared over the viewing window).\n\t\tNOTE: If available, plasma bonding of the PDMS to the coverslip is an alternative65,66,67.\nLet the glue dry for several hours, or overnight, before using. These are reusable until they break from normal wear and tear.\n\t\tNOTE: It is not recommended to stain the samples in the glued PDMS well used for imaging. These wells hold fluid for several hours but can leak during longer staining.\nVHSE imaging\n\tNOTE: If imaging uncleared samples, use PBS as imaging solution. If imaging with cleared samples, use methyl salicylate (or the chosen clearing solution) as the imaging solution.\n\t\nAdd a few drops of imaging solution into the PDMS well and check for leaks (if there is a leak, repair it with a dot/smear of cyanoacrylate super glue or use another well).",
    "Keep the imaging solution in the PDMS well when adding the VHSE. Using scoopula or fine tip forceps (Supplemental Figure 1C), remove construct from 12-well plate and place into the PDMS well onto the glass coverslip. Place construct with the orientation of interest facing toward the objective. For example, to image the epidermis using an inverted microscope, make sure the epidermis is facing down, toward the glass.\n\t\t\nAlternatively, for an upright microscope, face the epidermis up. The below imaging procedures are described for an inverted microscope, but could be readily adapted for an upright.\n\t\t\tNOTE: Be cautious when manipulating the VHSE to avoid damage. Transfer over the well plate in case the VHSE falls. A bent, flat tip scoopula is the easiest way to transfer the construct (Supplemental Figure 1C).\nMake sure the sample is sitting flat in the well and that no portions of the epidermis or dermis are folded under the sample. If folding occurs, gently manipulate the sample with forceps or a scoopula; adding extra imaging solution temporarily to float the VHSE may help it straighten out. Folding or wrinkling of the sample can be seen by eye or using the microscope.\nFill the well with imaging solution, using just enough fluid to keep sample hydrated; too much fluid will float the sample, resulting in motion during imaging. The construct should be sitting on the glass viewing window; test for movement by tilting the PDMS well. If there is movement, remove some fluid; add and remove fluid drop wise until the movement stops.\nPlace a glass slide over the well to minimize evaporation during imaging (Supplemental Figure 1D). For longer imaging sessions, check sample frequently to ensure proper fluid levels. If accessible, a humidified chamber during imaging can be used (although it is typically not necessary).",
    "Place sample on the microscope stage and image through the glass coverslip window (Supplemental Figure 1D). This technique allows for at least 3 h of continuous confocal imaging, but the hydration of the sample should be checked regularly, with imaging solution added when needed.\n\t\tNOTE: If sample is cleared, methyl salicylate will degrade the glue over time. The glue bonding the PDMS can be re-applied between imaging runs; or the sample can be transferred to new wells periodically. In wells with plasma bonding, this will not be an issue.\nAfter imaging, float the sample with imaging fluid as much as possible in the well. Use a scoopula or fine tip forceps to transfer the sample into its storage well. Perform the transfer over a well plate in case the sample falls.\nEach PDMS well and top glass coverslip can be re-used until they break. Clean bottom glass before imaging, both inside and outside the well. Before re-using, always check for leaks and repair with glue, as necessary.\nStore samples as described in step 6.3.6 and add PBS every few months to maintain; if samples are cleared, store in glass using methyl salicylate and check the levels regularly. Cleared samples may degrade rapidly (within days) and should be imaged as soon as possible."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}