{
  "id": 5946,
  "origin_website": "Bio",
  "title": "Measuring Mitochondrial ROS in Mammalian Cells with a Genetically Encoded Protein Sensor",
  "procedures": [
    "Day 1: Cell culture and seedingThis protocol is exemplary for adherent cells, which can be transfected with reagents such as Fugene® HD. For cell lines which are difficult to transfect, we recommend an alternative transfection method (e.g., nucleofection by electroporation). If stable cells expressing the desired sensors are available, they can also be used for the imaging experiment as described in this protocol.Culture the cells with their corresponding growth medium until they reach a confluency of around 70%. Remove the growth medium, wash the cells once with 5 ml DPBS and detach the cells by incubating them with 1 ml trypsin or 1 ml accutase (as used for their normal cultivation) at room temperature.Suspend the cells in growth medium and dilute 100 µl of the suspension with DPBS to a ratio of 1:100 in a total volume of 10 ml. Determine the concentration of cells in the dilution with a Z1 cell counter or hemocytometer.Place autoclaved glass coverslips into a 6-well plate and seed 400,000 cells (in this example HEK293 cells) for each well in 2 ml of growth medium. Place the plate in a humidified cell culture incubator (37 °C, 5% CO2) and incubate overnight.Day 2: TransfectionRemove the Opti-MEM medium and Fugene® HD solutions from the freezer and equilibrate both at room temperature for several minutes. Mix 100 µl of Opti-MEM medium with 4 to 10 µl of Fugene® HD solution (according to the manufacturer’s protocol), add the suggested amount of plasmid DNA (1 µg/µl endotoxin-free stock solution) to the mixture (1 µg/well is recommended, but the optimal amount can vary and depends on the cell type and plasmid). Pipette the mix up and down 15 times. Note: The optimal transfection conditions e.g.",
    ", cell density, DNA amount, DNA:Fugene® HD ratio might need optimization for the cell line of choice.Wait for 15 min at room temperature, then add 100 µl of the transfection mixture to each well. Notes:  If your cell growth medium contains antibiotics, it is advisable to change this before the transfection to growth medium without antibiotics, because they might reduce the transfection efficiency; otherwise, it is not necessary to change the growth medium before the transfection mixture is added. Since mitoHyPer and mitoSypHer have the same spectrum features, they should be transfected separately (in different wells).The cells are incubated in a humidified cell culture incubator (37 °C, 5% CO2). Change the medium in the transfected wells after 6 h with fresh cell growth medium. Keep the cells in the incubator until ready for imaging (37 °C, 5% CO2), for about 24-48 h.Day 3 or 4: ImagingImaging is performed with a Zeiss Cell Observer.Z1 setup with temperature, CO2 controlling unit, gas chamber and perfusion system (Figure 1).Gently remove a cell-covered coverslip with a pair of delicate tweezers (avoiding the scrapping of cells in the central imaging area of the coverslip). Add Baysilone-paste on the edge of the bottom of the perfusion chamber plastic insert (self-made) and attach it to the coverslip (cells-facing-up). Fix a 12 mm coverslip with Baysilone-paste on the upper part of the plastic insert in order to create a small perfusion channel. Then fix the plastic insert (holding the coverslips) with the knobs and place the assembled chamber into the metal imaging chamber (see Figure 2A). Note: If simple experiments are performed (e.g.",
    ", analyzing the resting levels with subsequent addition of saturating H2O2) it might be sufficient to use standard imaging chambers or glass-bottom plates and stimulate the signal changes by addition of the agents carefully with a pipette. However, for more experiments involving, multiple additions or washing-out experiments, a perfusion system is recommended.Place the imaging chamber on the microscope stage and attach the solution containing perfusion tubes (to avoid air in the system), on opposite sides of the chamber (as shown in Figure 2B). Perfuse gently with 2 ml Ringer solution (see Recipes) to wash away detached cells. Wait for 5 min to reach a CO2 (5 %) and temperature (37 °C) equilibrium before additional handling. Note: CO2 and temperature are controlled and monitored by the imaging system with the corresponding controlling units. Our perfusion system has on one side a syringe to apply the Ringer solution by hand and on the other side a suction pump to remove the waste.Using a 40x objective, search for a proper field of view that allows you to assess separate and well attached cells. Set the LED strength in order to get a proper signal, but not too high to avoid photobleaching of the sensor. Optimize the exposure time to obtain good image quality (signal over background) and keep the ratio of exposure time for both channels (420 nm vs. 505 nm) as a constant for all experiments. This part of the procedure will require some time to optimize, based on the cell types used and on the equipment available, since the light source and camera can vary.",
    "Start the experiment by measuring the resting level of H2O2 in the cells every 1 sec for at least 10 sec, then add stimulating substances through the perfusion system and record until the signal stabilizes (or according to the stimulation protocol). The frame number per minute and total imaging time should be optimized to achieve proper temporal resolution but also to avoid photobleaching. Note: The stimulating substances leading to the production of ROS from mitochondria vary depending on the scientific question and the cell type. For other scientific questions, only the resting redox level (e.g., the physiological H2O2 concentration under normal conditions) might be of interest.At the end of each measurement, a single dose of saturating H2O2 (e.g., 1 mM) should be added as a positive control and to determine the maximal intensity of the sensor (this might be needed for calibrating the system). To detect the fluorescence intensity of a fully reduced sensor (which will indicate if the sensor is already oxidized during resting conditions and provide the minimum value for calibration), we advise adding a reducing agent (e.g., 2 mM DTT) at the end of the experiment. Perform the same imaging procedure with the mitoSypHer sensor as an imaging control, since the HyPer sensor can be affected by changes in pH. Note: If the signal (or ratio change) obtained during the experiment with the HyPer sensor is due to oxidation, you will not see any changes in the SypHer signal during the same experimental conditions. If the pH influences your results, you will see also changes in the ratio of the SypHer sensor. Since HyPer is a pH-dependent sensor, this control is mandatory in order to discuss the data regarding redox changes."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}