{
  "id": 7825,
  "origin_website": "Bio",
  "title": "Assessment of Chemosensory Response to Volatile Compounds in Healthy, Aged, and Neurodegenerative <em>Caenorhabditis elegans</em> Models",
  "procedures": [
    "C. elegans maintenance Inoculate an E. coli OP50 colony into 50 mL of Luria-Bertani (LB) broth in a 200 mL flask and incubate with gentle agitation at 37 °C overnight.Seed approximately 200 μL of E. coli OP50 overnight culture (1 × 108 CFU/mL) to a 60 mm NGM agar plate. Incubate plates at 37 °C overnight before use.Transfer 50–100 mixed-stage larval worms (N2, CL2122, and CL2355 strains) to a new E. coli OP50-seeded NGM agar plate using a heat-sterilized platinum wire pick. Keep worms at 20 °C.Repeat step A3 every 2–3 days for maintenance.C. elegans synchronization by bleaching Allow worms to grow until adult stage.Recover gravid adults in 15 mL tubes by washing plates with M9 buffer (see Recipe 1).Pellet worms by centrifuging for 2 min at 400 × g (~1,500 rpm on a standard table centrifuge) at room-temperature and discard supernatant.Perform 1–3 washes until the buffer appears clear of bacteria (lack of turbidity).Add 5 mL of bleaching solution (see Recipe 8) into the tube and shake vigorously at room temperature for up to 5 min. Bleaching longer than 5 min will kill the eggs.Dilute the reaction by adding 10 mL of S-basal buffer to the 15 mL centrifuge tube.Quickly centrifuge (since treatment may still be active) for 1 min at 400 × g and discard supernatant.Wash pellet three more times by filling the tube with S-basal buffer. Check using a dissecting microscope.Place the eggs to unseeded NGM plates and incubate for 18–24 h at 20 °C. Proper aeration should be provided to obtain all animals in stage L1.Wash each NGM plate with 1 mL of S-basal buffer, transfer the L1 population to NGM agar plates seeded with the corresponding bacterial food, and incubate until they reach the young-adult stage (1-day-old L4), approximately 48 h later. Most of the C.",
    "elegans strains are maintained at 20 °C on NGM media seeded with E. coli OP50 or B. subtilis NCIB3610.Behavior assay Feed C. elegans N2, CL2122, and CL2355 strains on E. coli OP50 or B. subtilis NCIB3610 bacterial cells from the L1-larval stage to adulthood at 20 °C.Repulsion and attraction behavioral assays are performed using octanol or DA as repellent or attractant agents, respectively.Wash E. coli OP50 or B. subtilis NCIB3610 strain-fed adult worms of different ages three times with M9 buffer to remove any residual bacteria and place them in NGM plates without food.For the repellent assay, 1 h after food starvation, place a paintbrush hair previously dipped in 100% octanol solution in front of a moving animal.Score the escape response time to octanol as the time (s) from exposure to the repellent to the initiation of a backward or escape movement.To measure the reaction time against octanol, use a timer that is stopped when the worm begins its regression, making a movement backwards (Figures 3 and 4).For the attractant assay, 1 h after food starvation, place a paintbrush hair previously dipped in 0.5% DA in ethanol 1.5 cm in front of a moving animal.Note: Mark the distance of 1.5 cm (with two dots or lines, one for the place where the brush is and another where the worms will be) outside the Petri dish in the attraction test so that the test is reproducible (Figure 2). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20230427/20230427232208_0438.jpgFigure 2. Scheme of the response time assay of C. elegans against the repellent octanol or the attractive diacetyl (DA). In the repellent assay, put the paintbrush dipped in octanol in front of the worm’s head and start the chronometer. Stop it when the worm begins its regression.",
    "Do the same for the attraction assay, but in this case put the paintbrush dipped in DA 1.5 cm in front of the worm and stop the chronometer when the worm initiates its forward movement in the direction of DA. The movement of the worm can be visualized in the following link: https://www.youtube.com/watch?v=klOJb0DDGGU&amp;ab_channel=NeuroAIUWLaboratory.[href=https://www.youtube.com/watch?v=klOJb0DDGGU&amp;ab_channel=NeuroAIUWLaboratory.] As can be seen in the video, ALM+AVM neural stimulus is capable of generating the avoidance behavior; the stimulus disturbs forward locomotion and initiates backward locomotion. Inspection of neural activity of motor neurons (DB neurons are anterior -> posterior ordered) indicates that the stimulus induces a change in the directionality of neural activity traveling wave, from anterior -> posterior to posterior -> anterior. The transition is marked through high constant activity in the anterior motor neurons.Score the DA response time as the time (s) from the DA presentation to the initiation of a forward movement in the direction of DA (Figure 3 and 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20230427/20230427232251_7007.jpgFigure 3. B. subtilis-mediated cognitive improvement during C. elegans aging. Average response times (in seconds, y-axis) of OP50- and NCIB3610-colonized N2 worms (red and green columns, respectively) of different ages (in days, x-axis) to repellent (octanol, left) and attractant [diacetyl (DA), right] exposition. Results represent mean ± standard deviation of three independent experiments performed in duplicate. A typical result from one of the three independent experiments performed in duplicate is presented (mean ± S.E.M). From Cogliati et al. (2020).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20230427/20230427232329_5838.jpgFigure 4. B. subtilis improved the behavioral response of C. elegans expressing pan-neuronal Aβ aggregates.",
    "Time of response of OP50- and NCIB3610-colonized (red and green columns, respectively) CL2122 (control or CL2122 wt, left) and CL2355 [CL2355 Alzheimer’s disease (AD) model expressing the pan-neuronal Aβ1-42, right] worms to 100% octanol (repellent), and CL2122 (control or CL2122 wt, left) and CL2355 (AD model expressing the pan-neuronal Aβ1-42, right) worms to 0.5% diacetyl (DA, attractant). A typical result out of three independent experiments (performed in duplicate) is presented (mean ± standard deviation). Asterisks indicate statistical significance (*p < 0.1; ***p < 0.001; ns, no significant difference, p > 0.5).Data analysis and interpretation All assays were performed at least three times in duplicate. In the repellent assay, put the paintbrush dipped in octanol in front of the worm’s head and start the chronometer. Stop it when the worms begin their regression. This represents the time of repellent response in seconds. Do the same for the attraction assay, but in this case put the paintbrush dipped in DA 1.5 cm in front of the worm and stop the chronometer when the worms initiate its forward movement in the direction of DA. This represents the time of attraction response in seconds. Calculate the time of attraction response and the time of repellent response and plot the data in Microsoft Excel. Use GraphPad Prism 8 for statistical analysis of data. Combine data from three independent experiments and calculate the mean and standard deviation. Apply a Student’s t-test with a significance cut-off level of P < 0.05 for comparisons between two groups for attraction and repellent time."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}