{
  "id": 15029,
  "origin_website": "Jove",
  "title": "Culture and Assay of Large-Scale Mixed-Stage Caenorhabditis elegans Populations",
  "procedures": [
    "1. Sterilize LSCP and equipment\nPrepare glass LSCPs by handwashing, followed by dishwashing, and subsequent autoclaving to ensure glassware is free of contaminants before starting the experiment. Store autoclaved LSCPs in a clean dry location until in use.\n\tNOTE: Ensure LSCPs are dishwasher and autoclave safe. Ensure the LSCP lids are dishwasher safe.\nPrepare LSCP lids by handwashing followed by dishwashing. Store LSCP lids in a clean bin until needed.\nOn the day Nematode Growth Media Agarose (NGMA) is prepped, wipe LSCP lids with 10% bleach solution twice, followed by 70% ethanol. Once wiped down with 10% bleach and 70% ethanol, keep LSCP lids in a clean bin in the laminar flow hood where the NGMA will be prepped.\n2. Prepare nematode growth media agarose (NGMA)\nPrepare NGMA by combining the following reagents into an autoclaved 2 L Erlenmeyer flask with stir bar on a stir plate: 2.5 g peptone, 3 g NaCl, 7 g agarose, 10 g agar, and 975 mL sterile water16. Ensure that the total volume equals 1 L. Tape a foil cap to the flask.\n\tNOTE: The preparation steps for the NGMA as described here will yield enough material for 2.5 LSCPs. The protocol can be tailored to the needed LSCP batch size in a given experiment.\nAutoclave on liquid cycle at 121 °C and 21 p.s.i. for 45 min.\nTurn on the water bath and set to 50 °C. Bring the autoclaved NGMA to the water bath to cool to 50 °C.\nBring 2 L Erlenmeyer flask of NGMA into the hood or cleaned space and set on a stir plate. Use a thermometer to track NGMA temperature.",
    "After the NGMA has reached 50 °C, add the following in the order listed with a sterile disposable pipette inside the hood or cleaned space: 25 mL of 1 M KH2PO4 (K phosphate buffer), 1 mL of cholesterol (5mg/mL in ethanol), 1 mL of 1 M CaCl2, 1 mL of 1 M MgSO4, 1 mL of nystatin (10mg/mL), and 1 mL of streptomycin (100 mg/mL)16.\nPour 400 mL of NGMA into a sterile glass LSCP, approximately 1.3 cm deep, allow the LSCP to solidify on flat surface in the hood and place the autoclaved foil lid back on the LSCP.\nOnce agar is set, remove the foil, and place a clean air-tight lid onto LSCP and move to 4 °C for storage. Store NGMA in LSCPs at 4 °C until in use and use within 5 days.\n3. Generate E. coli food for NGMA on LSCP\nTo generate a stable food source, generate batches of HT115 (DE3) E. coli using a small batch averaging concept consistent with the central limit theorem17. Store at -80 °C. When needed pull E. coli bacterial stock(s) from -80 °C to thaw18.\n\tNOTE: In this protocol, E. coli bacterial stocks were grown in a bioreactor. At the end of the culture growth, the culture was diluted 1:50, and the measured OD600 was 0.4. Thus, the culture had an effective OD600 of 20. Bacteria were pelleted, weighed, and resuspended in K medium at a concentration of 0.5 g/mL (wet weight), transferred into 2 mL aliquots, and frozen19.\n4. Bacterial lawn on NGMA\nBring NGMA LSCPs out of 4 °C to room temperature (RT) for several hours before spreading the bacterial lawn to allow the entire LSCP to reach RT.\nPull out needed E. coli bacterial stock(s) from -80 °C to thaw18.",
    "Dilute E. coli bacterial stock(s) with 2 mL of sterile K-medium to achieve 0.5 g E. coli in 4 mL per NGMA LSCP. Carefully pipette 4 mL of E. coli in the middle of the NGMA LSCP.\nUse a sterile spreader to spread bacteria into a rectangle leaving approximately 3.8 cm of room around the edges of the NGMA E. coli free.\nLeave the NGMA LSCP with E. coli in the hood with the fan on for 1 h to ensure the E. coli suspension fully dries.\nOnce the bacterial lawn is dry, push the lid on tightly and store at 4 °C until used.\n5. Chunk worms to reduce stress and age variability across samples\nStreak worms from a frozen worm stock to a newly seeded 6 cm plate4. This plate will serve as the “master chunk” plate.\n\tNOTE: Chunking is an optimal method to transfer worms from a homozygous strain20. If a strain is heterozygous or needs to be maintained by picking and mating, chunking is not advisable. Chunking frequency may need to be optimized depending on worm genotypes used, temperature chosen for growth, and downstream steps.\nAfter the master chunk plate is full of healthy gravid adults (approximately 3 days) with plenty of E. coli lawn still present, follow standard C. elegans chunking guidelines as described in WormBook to produce four total chunk plates4.\nStore all chunk plates in a controlled temperature (CT) room at 20 °C unless otherwise specified for growth.",
    "NOTE: If users of this protocol do not have access to a CT room as described here it is recommended to use either a small incubator where the temperature can be controlled or a designated room where environmental conditions can be controlled as much as possible. If neither of these alternate options are available, note that variation in sample growth may be greater.\nOnce many gravid adults are observed in the 4th chunk plate, move on to Step 6.\n6. Spot bleaching gravid adults onto LSCP\nNOTE: This bleaching technique is used to eradicate most contaminants and dissolve the cuticle of the hermaphrodites releasing embryos from the adult worm. The bleach solution will soak into the NGMA prior to the embryos hatching.\nBring LSCPs out to RT for several hours prior to spot bleaching worms.\nPrepare a 7:2:1 ratio of ddH2O : bleach : 5 M NaOH. Make this alkaline hypochlorite solution fresh just before use.\n\tNOTE: Use the same stock of bleach and NaOH throughout the duration of a given experiment to avoid bleach batch affects. Bleach used in this protocol was 5-10% sodium hypochlorite.\nLight a Bunsen burner and flame a worm pick before proceeding. Scoop fresh E. coli onto a sterile pick from the edge of the bacterial lawn on the LSCP.\nPick a single gravid adult from the 4th chunk plate for spot bleaching.\nPipette 5 μL of the alkaline hypochlorite solution into one corner of the LSCP away from the E. coli lawn.\nPlace the picked gravid adult into the 5 μL alkaline hypochlorite solution. Tap the nematode to help disrupt the cuticle and release eggs.",
    "Repeat steps 6.4 – 6.6 for a total of 4x and place 5 gravid adults evenly around the E. coli lawn. Pick all 5 gravid adults from the same 4th chunk plate to ensure nearly genetically isogenic individuals are added to a given sample.\nPlace the lid back onto the LSCP.\nRepeat steps for all LSCPs.\n7. Worm growth in controlled temperature (CT) room\nFollowing spot bleaching, place the lid tightly onto the LSCP and place in the CT room set to 20 °C with constant airflow and a 12L:12D photoperiod (12 h light and 12 h darkness).\nNote the time and position where the sample was placed in CT room.\n\tNOTE: Position within the room should always be documented to record any environmental differences that samples that could potentially encounter while growing. Once the sample is in the CT room, it should remain in its assigned spot undisturbed. Do not open the lid of the LSCP in the CT room to decrease the chance of contamination.\nTake the LSCP to a microscope, outside of the CT room, to observe the population growth and density.\n\tNOTE: Each C. elegans strain and sample will vary in its growth, so monitor samples closely. While it is recommended to not disturb the growth of the LSCP while in the CT room, LSCPs were transported out of the CT room and lids were opened every 2 days to monitor sample growth. Taking the sealed lids off the LSCPs every 2 days also allows for O2 to flow into the LSCP.\nBefore harvesting ensure that the LSCP has become full of a large population of worms. Use the following criteria to decide if the LSCP is ready to be collected.\n\t\nEnsure that the LSCP is full of gravid adult worms.",
    "Ensure that the plate contains a large population size (i.e., worms cover the entire surface of the agar).\nEnsure that the plate does not have many eggs on the surface of the agar (i.e., the maximum number of worms should have hatched).\nEnsure that the plate has minimal to no E. coli left, indicating that the worms would starve and generate dauer larvae if left on the plate for an additional two days.\n\t\tNOTE: Although most LSCPs are ready to harvest between 10 to 20 days, depending on strain and sample, check each LSCP frequently upon establishing this protocol to determine normal harvest times.\nClean gloves and area with 70% ethanol between handling LSCPs to avoid cross contamination between strains.\n8. Harvesting the LSCP sample\nTurn on and allow the centrifuge to cool to 4 °C prior to harvesting samples.\nPrepare three 50 mL conical tubes with 50 mL of M9 solution per LSCP to be harvested.\nLabel one 15 mL conical tube per LSCP.\n\tNOTE: All centrifugation steps are performed in the 15 mL conical tube, because worms tend to pellet well in these tubes.\nPour 50 mL of M9 solution (from one 50 mL conical tube in Step 8.2) onto the LSCP surface and swirl around to ensure that M9 covers the entire NGMA surface.\nWhile M9 sits on the LSCP surface, prime a sterile serological pipette with M9.\n\tNOTE: By priming the sterile serological pipette with M9 this ensures that less worms stick to the inside of the plastic pipette, preventing sample loss.\nTilt the LSCP so M9 and the worm population gather in one corner of the LSCP.\n\tNOTE: The mixture of M9 solution and worms from the LSCP will be referred to as the “worm suspension” in downstream steps.",
    "Using a primed serological pipette with an automatic pipettor, pipette worm suspension and place into the original 50 mL conical tube. Once 50 mL of worm suspension is collected, place the conical tube on a rocker to disrupt bacteria clumps and debris.\nRepeat steps 8.4 - 8.7 collecting 150 mL of worm suspension per LSCP.\nTransfer 15 mL of worm suspension, from one of the three 50 mL conical tubes, by pouring into a labeled 15 mL conical tube set aside in step 8.3. Centrifuge the 15 mL conical tube at 884 x g for 1 min at 4 °C. The majority of worms will pellet at the bottom of the tube.\nAspirate off the supernatant ensuring to not disturb the worm pellet.\nContinue adding approximately 13 mL of worm suspension to the same 15 mL conical tube repeating steps 8.9 and 8.10 until all 150 mL of worm suspension are consumed. Invert the tube and disturb the pellet between centrifugations to wash and aspirate off as much bacteria and debris as possible.\n\tNOTE: At this step, the contents from all three 50 mL conical tubes are condensed in a single 15 mL tube.\nAdd 10 mL of clean M9 to the 15 mL conical tube and agitate the worm pellet by inverting. Centrifuge the 15 mL conical tube at 884 x g for 1 min at 4 °C. Aspirate off the supernatant ensuring to not disturb the worm pellet. Repeat twice.\n\tNOTE: If there is a great amount of debris or bacteria in sample, repeat step 8.12 until the sample is clean.",
    "Once the sample is clean, add ddH2O to the worm pellet for a total of 10 mL of ddH2O and worms. Agitate the worm pellet by inverting. Move quickly into step 9.1, as worms must remain in ddH2O for 5 min or less to avoid osmotic stress.\n\tNOTE: Suspending worm pellets in ddH2O is the preferred solvent for downstream -omics steps. Worms can be suspended in other solvents or buffers if they are compatible with a given experimental workflow.\n9. Estimate population size\nNOTE: Move through Steps 9.1 – 9.7 quickly. The mixture of ddH2O and worms from step 8.13 are referred to as the “worm sample” in subsequent steps.\nPrior to pipetting the worm sample, prime pipette tip to be used with M9 to avoid worms sticking to the inside of the plastic pipette preventing sample loss and reducing count variation.\nTake a 100 μL aliquot of worm sample and dilute it into 900 μL of M9. Mix well and make a serial dilution (1:10, 1:100, 1:1000). Repeat this step twice to achieve a total of three sets of aliquot replicates.\n\tNOTE: Pipetting worms can cause high variability in sample population counts. Ensure that the worm sample is homogenous prior to pipetting the desired aliquot.\nSet the 15 mL conical tube on a rocker to continue moving culture while aliquots are counted.\nEnsure the worm sample is well mixed and homogenous. Pipette 5 μL from the 1:10 worm sample, dispense it onto a microscopy slide, and count the number of worms. If this number is less than approximately 50 worms, then also count the 1:100 and 1:1000 dilutions. If it is more than 50, move to the next serial dilution.\n\tNOTE: If too many worms cannot be accurately counted, use the next serial dilution for counting instead.",
    "Count each aliquot replicate of each dilution 3x. At the end of counting, for most cultures, 9 total counts will be documented (i.e., 3 total counts for each aliquot replicate).\nAverage the dilution counts to determine the estimated population size of the worm sample. These dilution counts will determine the volume of worm sample needed to create desired aliquot size for -omics steps.\n\tNOTE: In this experiment, aliquots of approximately 200,000 mixed-stage worms were generated. In addition, one aliquot of approximately 50,000 mixed-stage worms was set aside for sorting in a large particle flow cytometer (described in Step 10).\nOnce the worm sample has been split into appropriate aliquots, flash freeze in liquid nitrogen and store the sample at -80 °C.\n\tNOTE: Do not freeze the aliquot intended for large particle flow cytometry.\n10. (Optional) Prepping sample for large particle flow cytometry\nNOTE: Steps 10, 11, and 12 are the authors’ preferred method to record sample growth (i.e., population size and population distribution of C. elegans life cycle stages) and determine success of a culture. Users of this protocol can substitute optional Steps 10, 11, and 12 with their own metrics of growth success. Steps 10, 11, and 12 are described here for two reasons; first, so users who have equipment used in Steps 10, 11, and 12 can replicate these steps and second, to show validation of this growth method. Step 9 above provides a good estimation of total number of worms to determine aliquot sizes, and step 10 is a more quantitative metric to estimate the number and population distribution of worms in a given sample.\nBring the aliquot of approximately 50,000 mixed-stage worms (set aside in Step 9.6) up to 10 mL total volume in M9 solution.",
    "Make a solution composed of 1 mg/mL of E. coli and a 1:50 dilution of 0.5 μM red fluorescent microspheres19.\nAdd 200 μL of this solution to the 10 mL of mixed-stage worms in M9 and incubate while rocking for 20 min.\nAfter 20 min, centrifuge the 15 mL conical tube at 884 x g for 1 min at 4 °C.\nAspirate off the supernatant ensuring to not disturb the worm pellet.\nWash the worm pellet twice with M9 solution to eliminate excess bacteria and red fluorescent microspheres.\nAdd 5 mL of M9 to the worm pellet and ensure that the pellet looks clean. If the pellet is clean, add 5 mL of M9 with 50 mM sodium azide to both straighten and kill the worms for accurate counting and sizing21.\nDocument time and date when sodium azide is added to sample.\nSet the sample aside on rocker until needed for large particle flow cytometry.\n\tNOTE: Sodium azide is known to affect nematode physiology (i.e., body length, metabolism, and thermotolerance). Therefore, it is critical to note the time worms are exposed to sodium azide as many of these physiological affects happen within a matter of minutes22. Due to the known physiological effects of sodium azide on worms, this treatment will affect downstream image quality and should be considered.\n11. (Optional) Documenting population distribution and prepping 384-well plate for imaging\nNOTE: Step 11 uses a large particle flow cytometer (LPFC). Basic knowledge of a LPFC is assumed in this protocol. Other methods can be substituted to document the growth and population distribution of samples. Steps documented here are for users who plan to use a LPFC in their pipeline23.\nTurn on, clean and prime the LPFC, and allow laser(s) to warm for 1 h prior to sorting samples.",
    "After the laser has warmed, open the “Histogram” profile and scale to a Time of Flight (TOF) of 2050.\nAdd a bar region to the “Histogram” spanning a TOF range of 100. The first bar region covers a TOF of 50-150.\nContinue to create twenty bar regions each spanning a TOF range of 100. These bar regions will span the entire TOF range from 50 – 2050. See Supplementary Table 1 for the exact gated regions to use across the TOF distribution.\nSave this Histogram set up as an “Experiment” to use in future LPFC runs.\nSelect calibrated 384-well plate or calibrate instrument to a 384-well plate to dispense objects into.\nOnce in the calibrated 384-well plate template, set template to dispense 20 gated objects into four wells (four technical replicates of each gated region) for each of the 20 bar regions created during Steps 11.3-4. See Supplementary Table 2 for an example layout of how to dispense worms into the 384-well plate.\nTransfer sample from step 10.9 into a 50 mL conical tube and add additional M9 solution to achieve approximately 40 mL total volume.\nStart automatically sorting the sample per the parameters set in step 11.7 while continuously stirring the sample to prevent settling and simultaneously dispensing objects from the sample into the calibrated 384-well plate.\n\tNOTE: Ensure the flow rate of the LPFC is operating between 15-20 objects per second and specify no doubles to be sorted.\nOnce entire sample has been sorted and the maximum number of gated regions have been dispensed into the 384-well plate, take the sample off LPFC and clean instrument.",
    "NOTE: When larger TOF regions are reached, it may become challenging to continue to fill the 384-well plate due to low event counts in that TOF region. Fill as many of the gated regions as possible to get the best idea of where C. elegans life-stages fall within the LPFC distribution prior to running out of sample.\nPlace a sealing film on top of the 384-well plate until imaged.\n\tNOTE: Image plate as quickly as possible after sorting because samples are treated with sodium azide22. Red fluorescent microspheres can be seen in the collected LPFC data files (i.e. PH Red data in output text file) based on the level of red fluorescence emitted in each sorted object to help identify which objects are alive worms, dead worms, dauers, or junk24.\n12. (Optional) Imaging 384-well plate\nNOTE: Step 12 uses a plate-reading micro confocal microscope. Basic knowledge of a micro confocal microscope is assumed in this protocol. Other methods can be substituted to document the growth and population distribution of samples.\nUsing a plate-reading micro confocal microscope with a 20x lens.\nOpen the “Objective and Camera” tab and set to “10x Plan ApoLambda” mode.\nOpen the “Camera Binning” tab and set to “2”.\nOpen the “Sites to Visit on Plate” tab and set to “4” sites per well and “overlap sites 10%” to later stitch together images.\nOpen “Wavelength” tab and set to “Brightfield 1”.\nOpen “Illumination” tab and set to “Transmitted light, bright sample”.\nPlace the 384-well plate in the microscope and set the “Z Stack” to “Calculate Offset” and find the proper focal plane for the samples in the 384-well plate.\nRun the 384-well plate on the micro confocal microscope collecting four images per well.\nMontage the four images together to create one image per well."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}