{
  "id": 1713,
  "origin_website": "Cell",
  "title": "Immunoaffinity purification of endogenous proteins from S. cerevisiae for post-translational modification and protein interaction analysis",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nGrow and harvest yeast cultures expressing FLAG-tagged protein\nTiming: 2 days\nGrow sufficient amounts of yeast cells expressing the FLAG-tagged methyltransferase to perform the immunoprecipitation. Cells are frozen in droplets in lysis buffer and can be stored at −80°C prior to lysate preparation.\nGrow appropriate yeast strains (tagged and untagged control, for example yEG001 and yEG401) in YPD for harvesting cell pellets.\nInoculate 20 mL of YPD medium with a single colony and grow at 30°C for 16–18 h in a shaking incubator at 220 rpm until saturated.\nThe next day, measure the optical density at 600 nm (OD600) of the yeast culture using a spectrophotometer. Dilute the culture to an OD600 = 0.2 in 2 L of sterile YPD medium in a new flask.\nThe volume (V) of saturated culture that is used for inoculation of 2 L is calculated using this formula: Volume (L) = (0.2 OD X 2 L)/OD600 saturated culture\nGrow at 30°C until the cells reach OD600 ∼1.0 (5–6 h).\nHarvest cells by centrifugation.\nPellet culture in 500 mL bottles by centrifugation (Allegra X014R) at 4300 × g for 30 min at 4°C. Pour off supernatant.\nWash pellet by resuspending in 40 mL ice-cold sterile, deionized water. Transfer to a 50 mL conical centrifuge tube.\nCentrifuge at 2850 × g for 5 min at 4°C. Pour off supernatant.\nResuspend cells in a volume of lysis buffer equivalent to the approximate size of the pellet (e.g., If the pellet is ∼5 mL, resuspend in 5 mL of buffer), as shown in Figure 1[href=https://www.wicell.org#fig1]A.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1170-Fig1.jpg\nFigure 1. Harvesting yeast cells and making yeast suspension beads\n(A) Yeast cell pellet in 50 mL conical tube.\n(B) Yeast suspension beads collected in a metal mesh strainer after being frozen in liquid nitrogen.",
    "Note: After centrifugation, the cells will be pelleted at the bottom of the conical centrifuge tube. The graduation marking for volume on the conical tube can be used as an approximation for the size of the pellet.\nUsing a 10 mL serological pipette, add the cell suspension drop-wise into liquid nitrogen in a douer or ice bucket, as shown in Methods video S1[href=https://www.wicell.org#mmc1].\nUse a metal strainer or pipette tip rack insert to collect the yeast suspension beads from the liquid nitrogen (Figure 1[href=https://www.wicell.org#fig1]B) and transfer them to a 50 mL conical tube. Immediately store the tube at −80°C.\nPause point: The yeast suspension beads can be stored at −80°C for up to 3 weeks prior to use. (Longer storage may also be feasible but has not been tested in our lab.)\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Preparation of yeast suspension beads from cell lysate by dropping from a pipette into liquid nitrogen in an ice bucket, related to step 4\nPrepare the yeast lysate for immunoprecipitation\nTiming: 3–4 h\nIn the following steps, the yeast cells were lysed and the extract is clarified prior to performing the immunoprecipitation.\nCritical: During the lysate preparation, all steps are performed with ice-cold buffers (stored at 4°C and placed on ice prior to use) and the lysate should be kept cold at all times in an ice bucket and/or in a cold room.\nIn the cold room, fill a pre-chilled coffee grinder with a few pellets of dry ice. Add the yeast suspension beads and grind for 1 min until it is a fine powder (Figures 2[href=https://www.wicell.org#fig2]A and 2B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1170-Fig2.jpg\nFigure 2. Grinding yeast suspension beads to prepare lysate\n(A) Coffee grinder with small pellets of dry ice and yeast suspension beads.",
    "(B) Ground powder of yeast suspension beads and dry ice after 1 min of processing in the coffee grinder.\nPour/scrape the ground cells into a 14 mL polypropylene centrifuge tube. Place the tube on ice and allow the dry ice to evaporate.\nNote: A similar approach can also be performed with a metal, steel blade blender, although we have found these are more prone to freezing during lysis. If dry ice is not available, liquid nitrogen can also be used, as described elsewhere (DeCaprio and Kohl, 2020[href=https://www.wicell.org#bib1]).\nCritical: For a 5 mL pellet volume, two 1.5 cm long pieces of dry ice work well. The dry ice evaporation time can vary from 60 to 90 min at 4°C. Occasional swirling speeds up the process.\nOnce the extract is mostly liquid, add protease and phosphatase inhibitors and detergent as described:\nAdd 1 mM PMSF and 1× EZBlock Protease Inhibitor Cocktail IV (1:1000 dilution of the stock solution).\nAdd 1× PhosSTOP phosphatase inhibitor to the lysate from a 10× stock solution following recommendations from the commercial vendor.\nAdd NP-40 to a final concentration of 0.4% and invert 10 times to mix well.\nNote: A 10× stock solution of the PhosSTOP phosphatase inhibitors can be obtained by dissolving one tablet in 1 mL of deionized water. This can be stored at 4°C for 1 month or −20°C for 6 months. Alternatively, the tablet can be directly dissolved into the lysate. To speed the process, the PhosSTOP tablet can be placed on a piece of parafilm and cut into smaller pieces with a clean razor blade before adding to the lysate. One tablet gives a 1× concentration of phosphatase inhibitors in 10 mL of buffer.",
    "Optional: To shear nucleic acids in the lysate, sonicate lysates 3 times for 30 seconds each at 15% output with at least 1 minute on ice between each round of sonication. This is recommended for proteins that interact with chromatin or other nucleic acid complexes that may be insoluble following lysate clarification and was performed for the FLAG-Set5 purification used as an example.\nClarify the lysate by centrifugation at 3094 × g for 10 min at 4°C.\nDuring the centrifugation, prepare the anti-FLAG magnetic beads as follows:\nPipet 75 μL (per IP) of 50/50 bead slurry into a microfuge tube (for 2 IPs, use 150 μL).\nAdd 1 mL of yeast lysis buffer to the tube and mix by inverting 5–6 times.\nPlace the tube in the magnetic stand and allow beads to collect against the wall of the tube.\nRemove supernatant and repeat wash with 1 mL of lysis buffer, mix by inversion. Place it back on the magnetic stand, allow the beads to collect on the wall of the tube, and remove supernatant.\nAfter the final wash, resuspend beads in a bead-equivalent volume of lysis buffer to generate a 50/50 slurry.\nNote: If performing more than 2 IPs, use 15 mL conical tubes for bead washes with 3 mL of wash buffer for each wash.\nCritical: When pipetting beads, use wide-bore, low-retention tips. Also, do not vortex beads. Always use gentle inversion or a rotator for resuspending beads\nTransfer the supernatant to a 15 mL conical tube and place clarified lysate on ice in an ice bucket.\nSet up the immunoprecipitation (IP)\nTiming: 4 h\nThe protein concentration of the lysates is measured to standardize the concentration within the immunoprecipitations (IPs) and the lysates are incubated with the washed anti-FLAG magnetic beads.",
    "Determine the protein concentration of the lysate using a Bradford assay.\nAdd 1 mL of Bradford reagent to disposable cuvettes for each protein sample to be tested including a blank control.\nAdd 1 μL of lysate to the cuvette, cover the top of each cuvette with a small piece of parafilm, and invert the cuvettes 4–6 times to mix the solution well. Incubate the cuvettes at 25°C for 10 min.\nUsing a visible light spectrophotometer, measure the absorbance at 595 nm for each sample.\nBased on the standard curve and the dilution factor used (1:1000), use the absorbance values to calculate the protein concentration for each of the lysates.\nNote: A standard curve should be developed using BSA or other protein of known quantity. The standard curve should encompass protein concentrations in the range of 4 mg/mL to 40 mg/mL and the absorbance measured in yeast lysis buffer used for preparing the IPs.\nNormalize the protein concentration for tagged and untagged protein lysate and make up additional volume with the yeast lysis buffer if needed.\nRemove 100 μL from the lysate to use as a total lysate sample for future western blot analysis. Add 25 μL of 5× SDS sample buffer, boil for 5 min, and store at −20°C.\nNote: Using the protocol as outlined above, an expected lysate concentration is approximately 20 μg/μL. All lysates used for IPs should be normalized to the same concentration in a volume of 10–13 mL. In this case, the total protein used per IP ranges from 200–260 mg.\nAdd 75 μL of the washed 50/50 slurry of the FLAG magnetic beads to the normalized lysate in 15 mL conical tubes. Rotate the samples on a tube rotator at 8 rpm for 3 h at 4°C.",
    "Wash IPs and elute tagged protein using 3xFLAG peptide\nTiming: 3–4 h\nFollowing the IP, the beads are washed to remove proteins non-specifically bound to the beads and the FLAG-tagged protein is natively-eluted using 3x FLAG peptide.\nAfter 3 h of incubation, place the tubes in the magnetic stand and allow the beads to collect on the wall of the tube. Remove supernatant (flow-through) by pipetting. Save a 100 μL aliquot for western blot analysis.\nWash the beads 3 times with yeast lysis buffer.\nAdd 5 mL of cold yeast lysis buffer to the beads. Rotate for 5 min at 4°C.\nPlace the tubes in the magnetic stand, allow the beads to collect, and remove the supernatant.\nRepeat the wash with 5 mL of yeast lysis buffer.\nRepeat the wash as described above except use 5 mL of yeast lysis buffer supplemented with 0.5% NP-40.\nTransfer the beads to a new microfuge tube using 500 μL of yeast lysis buffer + 0.5% NP-40. Wash the old tube and pipette tip with an additional 500 μL of buffer and add the buffer and any more beads collected to the new tube.\nPlace the tubes in the magnetic stand, allow the beads to collect, and remove the supernatant.\nCritical: Use wide-bore, low-retention tips to completely collect all beads and transfer to a new tube.\nPrepare elution buffer by adding 0.2 mg/mL 3xFLAG peptide (from a 5 mg/mL stock of 3xFLAG peptide) to yeast lysis buffer.\nCritical: Always prepare the FLAG elution buffer just before use.\nAdd 50 μL of FLAG elution buffer to the tube with FLAG magnetic beads from Step 13. Rotate the samples on a tube rotator at 8 rpm for 30 min at 4°C.",
    "Place the tubes in the magnetic stand, allow the beads to collect on the side of the tube, and carefully transfer the supernatant to a new tube, avoiding disturbing the beads. This is FLAG eluate #1.\nPerform a second elution by adding 50 μL of FLAG elution buffer to the beads and rotate at 4°C for 30 min.\nPlace the tubes in the magnetic stand, allow the beads to collect on the side of the tube, and carefully transfer the supernatant to a new tube, avoiding disturbing the beads. This is FLAG eluate #2.\nRemove 15 μL of Eluate #1 and #2 into new tubes. Add 3.8 μL of 5× SDS sample buffer, boil for 5 min, and store at −20°C for use in SDS-PAGE followed by silver stain or western blotting. Freeze the remaining sample in liquid nitrogen and store at −80°C until mass spectrometry is performed.\nPause point: The gel analysis samples can be stored at −20°C prior to performing SDS-PAGE and the samples for mass spectrometry can be stored at −80°C prior to processing for mass spectrometry.\nSDS-polyacrylamide gel electrophoresis (PAGE) and protein detection by silver stain\nTiming: 3–4 h\nTo verify that the FLAG-tagged protein has been eluted from the beads, use SDS-PAGE followed by silver stain (using Invitrogen SilverQuest Silver staining kit or similar) or other staining procedure for detecting low quantities of protein. A western blot with anti-FLAG antibody can also be performed, however it may not accurately reflect the quantity of protein nor indicate the presence of co-precipitating proteins. This protocol outlines the procedure for hand-casting gels, however commercial pre-cast gels can also be used.\nSet up the glass plates and casting apparatus for pouring the polyacrylamide gel based on the manufacturer’s instructions associated with the gel apparatus and running box.",
    "Prepare an 8% resolving gel mixture in a 15 mL conical tube using the recipe outlined in the Materials and Equipment section.\nNote: The acrylamide percentage of the resolving gel depends on the molecular weight of the target protein. Depending upon the size of the protein one can use a higher or lower percentage resolving gel.\nPrepare the resolving gel by quickly pouring the mixture from the conical tubes between the glass plates in the casting apparatus, leaving approximately 3 cm space below the top of the short glass plate. This will use approximately 4.5 mL of the gel mixture.\nCarefully pour a layer of isopropanol over the top of the resolving gel to level out the top of the resolving gel.\nLet the resolving gel stand for 20–30 min until it is polymerized.\nOnce the resolving gel has polymerized, prepare the 4% stacking gel mixture.\nTo make the stacking gel, carefully remove the isopropanol layer by pouring, performing a quick wash with 1 mL of deionized water, and wick the space to remove any residual isopropanol using a Kimwipe or similar.\nUsing a pipette, add the stacking gel mixture on top of the resolving gel between the glass plates. Use enough stacking gel mixture to completely fill the gap between the plates.\nQuickly place a 10-well comb between the plates and allow the gel to polymerize for approximately 20 min.\nPause point: The polyacrylamide gels can be poured ahead of time and stored at 4°C or used right away. To store the gel, wrap it in a damp paper towel and then wrap again in plastic wrap, completely sealing all edges so that it does not dry out. Store at 4°C for up to one week.",
    "When ready to run the SDS-PAGE, assemble the gel electrophoresis unit and place it in the buffer tank.\nMake 1 L of 1× SDS running buffer by diluting the 10× SDS running buffer with deionized water. Pour buffer in the chamber until the wells of the gel are covered and to the level indicated on the gel box by the manufacturer.\nLoad 18 μL of the IP samples in SDS sample buffer and 3 μL of the molecular weight marker.\nAttach the gel box to the power supply and run the gel at a constant 200 V for approximately 45 min, or until the dye front reaches the bottom of the gel.\nRemove the gel from the running apparatus and carefully open the glass plates. Use a plastic spatula to trim off the stacking gel and, if desired, to remove excess gel outside of the lanes of interest.\nPlace the gel in a clean staining box and rinse briefly with deionized water.\nNote: The Nalgene staining box recommended here contains an LDPE plug at the bottom for easy drainage of solutions without having to handle the gel during staining.\nFollow the steps for silver staining as described in the SilverQuest™ Silver Staining Kit protocol.\nFollowing the staining procedure, the gel can be washed several times in deionized water and imaged on a white light imaging platform or dried and stored for future reference.\nCritical: The silver nitrate in the silver staining kit is hazardous and may cause skin or eye irritation if exposed. In addition, it should be disposed of using proper waste handling procedures according to local and state regulations. It should not be discarded in the sink.",
    "Note: Once elution of the target protein has been confirmed by SDS-PAGE, the samples can be prepared for and subjected to mass spectrometry following protocols relevant to the available facilities and instrumentation. In addition, the goal of identifying phosphosites or other post-translational modifications or protein interaction partners should be considered when choosing conditions for protein digestion and other steps required prior to mass spectrometry. Examples of appropriate methods and protocols are described elsewhere (Jaiswal et al., 2020[href=https://www.wicell.org#bib2]; Separovich et al., 2021[href=https://www.wicell.org#bib7])."
  ],
  "subjectAreas": [
    "Model Organisms",
    "Proteomics",
    "Signal Transduction",
    "Protein Expression And Purification",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}