{
  "id": 9363,
  "origin_website": "Jove",
  "title": "Dissection and Lateral Mounting of Zebrafish Embryos: Analysis of Spinal Cord Development",
  "procedures": [
    "1. Mounting Embryos (Upon Completion of Selected Visualization Technique, such as Immunocytochemistry, in situ Hybridization, etc.)\nPlace embryos in a 35 mm Petri dish filled with buffer of choice (Figure 1A). The choice of buffer is based on the labeling procedure. Typically PBS-based buffers are suitable.\nUnder a dissecting microscope, and using forceps, secure the head with one pair of forceps while pulling the yolk away with the other pair (Figure 1B). Alternatively, use an insect pin in an insect pin holder to gently pull away the yolk.\nUsing the embryo poker (fishing line (0.41 mm diameter) glued to either a capillary tube or a Pasteur pipette) move the embryos to a part of the Petri dish that does not have a lot of yolk debris (Figures 1C-D).\nUsing a glass Pasteur pipette, aspirate the embryos in as little liquid as possible, and gently pipette them onto a slide (Figure 1E).\nGently wick away excess liquid using a laboratory wipe. Avoid contact with embryos.\nAdd one drop of mounting medium to embryos. For fluorescent labels, use an antifade reagent of choice. For colorimetric signals, 70% glycerol may be used as a mounting medium.\nUsing the embryo poker, orient the embryos on their sides in rows (Figure 1F).\nAdd one \"dab\" of petroleum jelly or high vacuum grease to each corner of a coverslip (Figure 1G). This prevents damage of embryo from excessive compression.\nPlace coverslip (petroleum jelly side down) on top of embryos (Figure 1H).\nGently tap the coverslip on each corner until the mounting media (70% glycerol or anti-fade mounting reagent) is touching the coverslip (Figure 1H).\nIf necessary, add more mounting media by pipetting right next to the coverslip, using a pipettor in the range of 20-200 ml. It will wick under.",
    "Using a laboratory wipe, completely clean around the coverslip. Be certain to not apply pressure to the coverslip, as this will damage embryos. This area must be dry and have no petroleum jelly or mounting media on it.\nUse nail polish to seal around the edge of the coverslip (Figure 1I)."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}