{
  "id": 13535,
  "origin_website": "Jove",
  "title": "Transfer of Mammary Gland-forming Ability Between Mammary Basal Epithelial Cells and Mammary Luminal Cells via Extracellular Vesicles/Exosomes",
  "procedures": [
    "All research involving animals complied with protocols approved by the Institutional Committee on Animal Care.\n1. Extracellular Vesicle/exosome Isolation and Validation\nCulture mammary epithelial basal cells, NAMECs4, with fresh, serum-free medium made of 500 mL of MCDB 170, pH 7.4 + 500 mL of DMEM/F12 with sodium bicarbonate (0.2438%); EGF (5 ng/mL); hydrocoritisone (0.5 µg/mL); insulin (5 µg/mL); bovine pituitary extract (BPE; 35 µg/mL); and GW627368X (1 µg/mL) in 15 cm dishes.\nAfter counting the cells with a hemocytometer, seed 1.2 x 106 cells in 12 mL of medium per 15-cm dish on day 0 for 4 days4.\nAfter 4 days in culture, centrifuge the culture medium at 300 x g for 5 min using a table-top centrifuge. Transfer the supernatant to a conical tube (Figure 1).\nCentrifuge the supernatant at 2,000 x g for 20 min in a table-top centrifuge. Transfer the supernatant to an ultracentrifuge tube and leave the dead cells and cell debris (Figure 1).\nCentrifuge the supernatant at 10,000 x g for 30 min at 4 °C. Transfer the supernatant to a new ultracentrifuge tube (Figure 1).\nCentrifuge the supernatant at 110,000 x g for 60 min at 4 °C. Remove the supernatant and resuspend the EV/exosome pellet in PBS (Figure 1).\nCentrifuge the supernatant at 110,000 x g for 60 min at 4 °C. Remove the supernatant. Resuspend the EV/exosome pellet in PBS (Figure 1). Resuspend the pellet isolated from 240-480 mL of NAMEC-conditioned medium in 100 µL.\nMeasure the protein concentration of the EV suspension with the BCA protein assay. Ensure that the concentration is around 20-40 µg/100 µL. Store at -20 °C for further analysis.",
    "Measure the concentration and size of the EVs/exosomes by nanoparticle tracking analysis (NTA), as described previously by Gardiner et al.11. Dilute the EVs/exosomes (20 µg/100 µL) with PBS to 10,000-fold for NTA analysis.\n\tNOTE: The result of NTA analysis reflects the number and size of the vesicles analyzed.\nImage the EVs/exosomes with transmissionelectron microscopy (TEM), as described previously by Lin et al4.\n2. Exosome Purification Using a Density Gradient\nResuspend the 110,000 g pellet from step 1.7 in 40% (w/v) iodixanol in PBS (2 mL). Overlay the mixture in sequence with aliquots of 30%, 20%, 10%, and 5% (w/v) iodixanol in PBS (2 mL each) to form a density gradient in an ultracentrifuge tube.\nCentrifuge the mixture at 200,000 x g for 8 h at 4 °C.\nCollect each gradient fraction (10 fractions; 1 mL/fraction) with a pipette from the top of the tube.\nAnalyze the presence of exosome markers (e.g., CD81, CD9, CD63, and Tsg101) in each fraction by SDS-PAGE12 and Western blot. Load 50-µL suspensions of each fraction onto a 10% gel containing 0.1% (w/v) SDS and separate the proteins in fractions with gel electrophoresis.\nTransfer the proteins from a gel to a PVDF membrane and incubate the membrane with antibodies against the exosome markers (e.g., CD81, CD9, CD63, and Tsg101) and housekeeping protein GAPDH overnight (Table of Materials) at 4 °C.\n\tNOTE: The result identifies the fraction containing exosomes.\n3. Extracellular Vesicle/Exosome Labeling\nSuspend the EVs/exosomes, obtained in step 1.7, in 10 µM carboxyfluorescein succinimidyl diacetate ester (CFSE) at 20 µg of exosomal protein/100 µL. Prepare a parallel sample containing only CFSE and PBS, processed in the same manner, as a negative control for the later EV/exosome uptake assays. Leave the mixtures at 37 °C for 30 min.",
    "Suspend the EVs/exosomes in 50x volume of PBS and centrifuge the suspension at 110,000 x g for 60 min at 4 °C. Remove the supernatant and resuspend the EV/exosome pellet in PBS. Repeat step 3.2 once.\nSuspend the EVs/exosomes in PBS at a concentration of 20 µg of exosomal protein/100 µL and then filter the EVs/exosomes through 0.22-µm membranes before adding the EVs/exosomes to the cells.\n4. Extracellular Vesicle/Exosome Uptake Assay\nTo make culture medium, mix 500 mL of MCDB 170, pH 7.4 + 500 mL of DMEM/F12 with sodium bicarbonate (0.2438%); EGF (5 ng/mL); hydrocoritisone (0.5 µg/mL); insulin (5 µg/mL); and BPE (35 µg/mL)4. Plate the human mammary epithelial HMLE cells in 6-well dishes (1 x 106 cells/well) one day before EV/exosome treatment. Add 2 µg/mL CFSE fluorescence-labeled EVs/exosome, obtained in step 3.3, to the culture medium of the HMLE cells for 2-6 h. Treat the HMLE cells of the negative control group with the parallel preparation, described in step 3.1.\nAfter the 2- to 6-h incubation, wash the cells twice with 4 mL of PBS at room temperature.\nDetach the cells with 0.25% trypsin for 10 min and re-suspend the cells in PBS containing 0.2% FBS. Measure the EV/exosome uptake from the fluorescence intensity in the cells using a fluorescence cell analyzer4. Image the cells treated with EVs/exosomes or the negative control using confocal microscopy.\n\tNOTE: The green fluorescence in the cells is caused by the EV/exosome uptake. See the legend of Figure 6 for the microscope settings.\n5. Isolation of Primary Mouse Mammary Epithelial Cells",
    "Prepare gelatin-coated dishes by adding 12 mL of 0.1% gelatin solution to 10 cm dishes. Place the plates in a 37 °C incubator for 30 min. Remove the gelatin solution and leave the lids off the dishes in a laminar flow hood for 4 h until the gelatin coating has dried.\nDissect the number 2, 3, 4, and 5 mammary glands (Figure 2) from 12-week-old virgin female C57BL/6 mice using scissors and cut the glands into small pieces (2 mm2) using a razor.\nFurther dissociate the slurry of mammary glands (from 10 mice) for 60 min at 37 °C, 120 rpm agitation with 50 mL of DMEM/F12 containing 0.2% collagenase type IV, 0.2% trypsin, 5% FBS, 5 µg/mL gentamycin, and 1x pen-strep.\nPellet down the epithelial organoids from the mixture by centrifugation at 350 x g for 10 min.\nSuspend the epithelial organoids in 4 mL of DMEM/F12 with 0.1 mg/mL DNase I for 5 min at room temperature. Add 6 mL of DMEM/F12 to a final volume of 10 mL.\nCentrifuge the suspension at 400 x g for 10 min at room temperature and discard the supernatant.\nResuspend the pellet in 10 mL of DMEM/F12. Centrifuge the suspension but hit the brake when the speed reaches 400 x g. Discard the supernatant.\n\tNOTE: By hitting the brake, epithelial organoids are quickly pelleted down, while fibroblasts, as single cells, still stay in the supernatant.\nRepeat step 5.6 and 5.7 5-7 times. Add a drop of the suspension to a hemocytometer and then check the clearance of fibroblasts from the organoid mixture under microscopy after each round of centrifugation (Figure 3).\nPlate the organoids in the gelatin-coated dish, obtained in step 5.1, for 48 h with DMEM/F12 containing 1x ITS, 5% FBS, 50 µg/mL gentamycin, 10 ng/mL EGF, and 1x pen-strep.",
    "After 48 h, remove the floating cells in the culture by replacing the medium with fresh culture medium without FBS (DMEM/F12 containing 1x ITS, 50 µg/mL gentamycin, 10 ng/mL EGF, and 1x pen-strep).\nConfirm that a monolayer of mammary epithelial cells migrates and grows out from the attached epithelial organoids in 3 days.\n6. Separation of Primary Mouse Basal/Luminal Mammary Epithelial Cells\nAfter the 3-day culture, detach the mouse primary mammary cells with a natural enzyme mixture with proteolytic and collagenolytic enzyme activity for 20 min. Neutralize the enzyme activity with 5% FBS in PBS.\nCentrifuge the suspension at 450 x g for 10 min at room temperature and discard the supernatant. Resuspend the cell pellet in 5 mg/mL dispase for 20 min. Neutralize the enzyme activity with 5% FBS in PBS.\nCentrifuge the suspension at 450 x g for 10 min at room temperature and discard the supernatant.\nRe-suspended the cells in 100 µL PBS with 0.2% FBS at a concentration of 107 cells/mL with the diluted anti-CD49f and anti-EpCAM antibodies on ice for 1 h in the dark.\nWash the cells with PBS and then incubate the cells with fluorophore-conjugated secondary antibody on ice for 30 min in the dark.\nWash and re-suspend the cells in PBS with 0.2% FBS.\nSort the EpCAMhi/CD49flo luminal mammary epithelial cells on a cell sorter4.\n7. Extracellular Vesicle/Exosome Treatment\nSeed the sorted EpCAMhi/CD49flo luminal mammary epithelial cells from step 6.7 on gelatin-coated 6-well dishes (2 x 105 cell/well) and then treat them with PBS or the 2 µg/mL NAMEC-derived EVs/exosomes obtained in step 1.7.",
    "To ensure the biological efficacy of the EVs/exosomes in long-term culture treatment, replace the cell culture medium with fresh medium containing PBS or 2 µg/mL NAMEC-derived EVs/exosomes every two days. Do not split the mouse primary luminal cells during the 10-day treatment.\n8. Fat Pad Injection of Mammary Epithelial Cells\nAnesthetize a 3-week-old female C57BL/6 mice with isofluorane 2-3% inhalant.\nPlace the anesthetized mouse on its back. Remove the fur on the mid-abdomen with a razor/hair cream and clean the surgery site with three alternating cycles of 70% alcohol and povidone-iodine.\nMake a 1.5 cm vertical incision through the skin along the ventral thoracic-inguinal region with scissors and then alternately expose the right and left 4th mammary fat pads.\nClear each fat pad by removing gland parenchyma with scissors. Locate the lymph node in the fat pad and then remove the whole gland parenchyma below the lymph node.\n\tNOTE: Two-thirds of the fat pad should remain in place.\nDetach the cells obtained from step 7.2 with a natural enzyme mixture (see the Table of Materials) with proteolytic and collagenolytic enzyme activity for 10 min. Neutralize the enzyme activity with 5% FBS in PBS.\nCentrifuge the suspension at 450 x g for 10 min at room temperature and discard the supernatant. Count the cells with a hemocytometer and suspend the cells in PBS at a concentration such that 15 µL contains the desired cell dose (104-102 cell/pad).\nInject 15 µL of mammary epithelial cell suspension into a fat pad using a 100 µL glass syringe attached to a 27G needle.\nRepeat steps 8.4-8.7 for the fat pad on the other side.\nClose the skin with wound clips.\n9. Mammary Gland Whole Mount\nEuthanize the mouse with CO2 plus cervical dislocation at 8 weeks after the cell injection (Step 8.7).",
    "Make a vertical incision through the skin layer from the thoracic region to the inguinal region using scissors and then expose both the right and left 4th mammary fat pads. Remove the 4th mammary glands (Figure 2).\nSpread the fat pads on glass microscope slides and fix the fat pads with Kahle's fixative (4% formaldehyde, 30% EtOH, and 2% glacial acetic acid) at room temperature overnight.\n\tCaution: Kahle's fixative is an irritant. Perform this step in a chemical hood.\nWash the fat pads in 250 mL of 70% EtOH for 15 min and then in 250 mL of dH2O for 5 min. Stain the fat pads with carmine alum (1 g of carmine and 2.5 g of aluminum potassium sulfate in 500 mL of dH2O) at room temperature overnight.\nWash the fat pads with 250 mL of 70% EtOH for 15 min, 250 mL of 95% EtOH for 15 min, and 250 mL of 100% EtOH for 15 min.\nClean the fat pads in xylene for days and stop the xylene incubation when the fat pads become transparent.\n\tCaution: Xylene is an irritant. Perform this step in a chemical hood.\nMount the slides with mounting medium and take images (2,400 dpi) of the fat pads using a digital slide scanner.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}