{
  "id": 3134,
  "origin_website": "Cell",
  "title": "Protocol to determine the subcellular localization of protein interactions in murine keratinocytes",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nNucleus/cytoplasm fractionation\nTiming: 2 h\nIn this step the author describes in detail the nucleus/cytoplasm fractionation of proteins (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2704-Fig1.jpg\nFigure 1. Workflow of nucleus/cytoplasm fractionation of proteins\nCreated with biorender.com[href=http://biorender.com].\nCritical: All preparation steps must be performed on ice for the following reasons: (1) most proteins are very sensitive to temperature increase and higher temperatures can cause proteins to precipitate (prevention of denaturation is necessary), (2) elevated temperatures increase the activity rate of proteases (prevention of proteolysis is necessary), and (3) elevated temperatures increase the activity rate of phosphatases (prevention of dephosphorylation is necessary). To avoid denaturation, proteolysis, or dephosphorylation, keep all solutions and samples on ice, e.g.in styrofoam ice boxes. The author performed all preparation steps at a 20°C–25°C bench. Perform incubation on an overhead rotator at +4°C in a cold room.\nAspirate the growth medium from the tissue culture dish.\nWash the cells three times with ice-cold 1× PBS.\nAspirate the last of PBS.\nAdd to each dish 800 μL of the hypotonic buffer to lyse the cells.\nRight before use, add protease and phosphatase inhibitor cocktail to a 1× final concentration to the hypotonic buffer.\nRight before use, add DTT to a final concentration of 0.5 mM to the hypotonic buffer.\nNote: The author used a protease and phosphatase inhibitor cocktail from a company (see key resources table[href=https://www.wicell.org#key-resources-table]), which is stored at +4°C. This avoids repeated freeze/thaw cycles. Add 8 μL of the 100× protease and phosphatase inhibitor cocktail to 800 μL hypotonic buffer to produce a 1× final concentration.",
    "Note: The author used a 100 mM stock solution of DTT in water from a company (see key resources table[href=https://www.wicell.org#key-resources-table]), which is stored in small aliquots at −20°C. The author recommends using DTT stocks within three months to prevent loss of potency. Add 4 μL of the 100 mM DTT stock solution to 800 μL hypotonic buffer to a final concentration of 0.5 mM.\nNote: DTT is a reducing agent, which maintains the thiol groups of cytosolic proteins and prevents them from oxidation to disulfide bridges.\nNote: The volume of 800 μL hypotonic buffer is sufficient to perform cytoplasmic fractionation of 6 × 105 cells. Although this protocol was optimized for the use of non-transformed murine keratinocytes, it should be applicable to other cell lines as well. However, optimal incubation conditions and amounts of buffers may vary between cell lines.\nDetach the cells from the tissue culture dish with a cell scraper.\nNote: No sterilization of the cell scraper by autoclaving is needed. The author recommends cleaning with 90% ethanol and subsequent air drying right before use.\nPlace the cell suspension in a 1.5 mL centrifuge tube kept on ice.\nIncubate the lysate for 10 min at +4°C on an overhead rotator.\nAdd IGEPAL CA-630 to a final concentration of 3%, e.g., add 24 μL IGEPAL CA-630 when performing the fragmentation with 800 μL hypotonic buffer/lysate.",
    "Alternatives: IGEPAL CA-630 is a mild detergent, which can be used to dissolve proteins without denaturing them. The use of detergents allows the extraction of proteins based on their relative solubility. Other nonionic detergents, e.g. Nonidet P-40 or Triton X-100, can also be applied prior to homogenization.9[href=https://www.wicell.org#bib9] In addition, you can change the detergent concentration to match the solubility of your protein of interest. Keep in mind that detergents which are milder than IGEPAL CA-630 or Nonidet P-40 can result in lower efficiency of fractionation.10[href=https://www.wicell.org#bib10] Higher concentrations may result in a loss of protein-protein interactions.\nCritical: IGEPAL CA-630 is a highly viscous liquid. The author recommends dropwise pipetting of the total volume into the lysate. Vortex the lysate-IGEPAL CA-630 mix very well until IGEPAL CA-630 is completely dissolved.\nIncubate the lysate for 10 min on ice.\nVortex the lysate-IGEPAL CA-630 mix for 10 s three times during the incubation step.\nHomogenize the cells.",
    "Note: The author recommends homogenization of cells using hypodermic needles by about ten iterations of up and down of the syringe. A syringe with a volume of 1 mL is sufficient for the indicated buffer volume. In this method, cells are lysed by forcing them through the narrow lumen of the needle. Upon exit, the cells are subjected to shear forces, which leads to their lysis. The author used disposable hypodermic needles with a thickness of 26 gauges (0.45 × 25 mm) for keratinocytes cultured under conditions to prevent cell-cell contact formation. The author recommends needles with a thickness of 21 gauges (0.8 × 40 mm) for homogenization of bigger cells with increased numbers of cell-cell contacts, e.g. squamous epithelial cells of the oral mucosa, ovarian follicle cells, or keratinocytes maintained in medium with calcium which induces cell-cell contact formation. Although this protocol was optimized for the use of non-transformed murine keratinocytes, it should be applicable for other cell lines as well. Optimal homogenization methods may vary depending on the cell line used.\nNote: At this point you may want to control cytoplasmic lysis by microscopy. Apply a small volume of the lysate (1–2 μL) on a slide and check for lysed cells but intact nuclei using a phase-contrast microscope. The author used the objective LD Plan-Achromat 40×/0.5 Ph2 for Primo (WD = 2.7 mm at D = 1 mm) to visualize cell lysis (see key resources table[href=https://www.wicell.org#key-resources-table]).\nClear the lysates by centrifugation for 30 s at 14,000 × g and +4°C.\nNote: Mid speed centrifugation results in a huge pellet that contains cell debris, unbroken cells, some large subcellular components (cytoskeleton, mitochondria) and intact nuclei. The supernatant will contain the cytosol and the organelles in free suspension.11[href=https://www.wicell.org#bib11]",
    "Collect the supernatant as the cytoplasmic fraction in a new 1.5 mL centrifuge tube kept on ice.\nTo 40 μL of the cytoplasmic fraction add 13.3 μL of 4× SDS loading buffer.\nBoil lysate at 95°C for 5 min on a heating thermo shaker.\nStore the lysates at −20°C until loading the SDS-PAGE gel for immunoblotting.\nNote: This sample is the cytoplasmic fraction input of the immunoprecipitation reaction.\nStore the remaining volume (760 μL) of the cytoplasmic fraction at −20°C for later use or keep on ice for immediate performance of the immunoprecipitation. This sample will be used for the immunoprecipitation reaction.\nWash the pellet three times in hypotonic buffer by centrifugation for 1 min at 14,000 × g and +4°C.\nRight before use, add protease and phosphatase inhibitor cocktail to a 1× final concentration to the hypotonic buffer.\nRight before use, add DTT to a final concentration of 0.5 mM to the hypotonic buffer.\nNote: The author recommends washing the pellet by adding approximately 500 μL of hypotonic buffer to the cell pellet and vortexing at low speed until the pellet detaches from the bottom of the centrifuge tube. Be careful not to resuspend the pellet.\nNote: The author used a protease and phosphatase inhibitor cocktail from a company (see key resources table[href=https://www.wicell.org#key-resources-table]). Add 5 μL of the 100× protease and phosphatase inhibitor cocktail to 500 μL hypotonic buffer to produce a 1× final concentration.\nNote: The author used a 100 mM stock solution of DTT in water. Add 2.5 μL of the 100 mM DTT stock solution to 500 μL hypotonic buffer to a final concentration of 0.5 mM.",
    "Critical: Carefully remove the wash hypotonic buffer through a hypodermic needle or pipette tip. Aspiration of the supernatant with the help of a pump may cause the loss of the pellet. Be careful not to lose the pellet.\nRemove the last of hypotonic buffer.\nAdd to each pellet 400 μL of the hypertonic buffer to lyse the nuclei.\nRight before use, add protease and phosphatase inhibitor cocktail to a final 1× concentration to the hypertonic buffer.\nRight before use, add DTT to a final concentration of 0.5 mM to the hypertonic buffer.\nNote: The volume of 400 μL hypertonic buffer is sufficient to perform nuclear fractionation of 6 × 105 cells. This protocol was optimized for the use of non-transformed murine keratinocytes. However, it should be applicable for other cell lines as well. Optimal incubation conditions and amounts of buffers may vary between cell lines.\nNote: The author used a protease and phosphatase inhibitor cocktail from a company (see key resources table[href=https://www.wicell.org#key-resources-table]). Add 4 μL of the 100× protease and phosphatase inhibitor cocktail to 400 μL hypertonic buffer to produce a 1× final concentration.\nNote: The author used a 100 mM stock solution of DTT in water. Add 2 μL of the 100 mM DTT stock solution to 400 μL hypertonic buffer to a final concentration of 0.5 mM.\nIncubate the pellet in hypertonic buffer for 30 min at +4°C on an overhead rotator.\nNote: At this point you may want to control nuclear lysis by microscopy. Apply a small volume of the lysate (1–2 μL) on a slide and check for intact nuclei using a phase-contrast microscope.\nClear the lysate by centrifugation for 30 min at 18,000 × g and +4°C.",
    "Note: High speed centrifugation results in a small pellet that contains nuclei debris, unbroken nuclei and insoluble intermediate filaments. The supernatant will contain the nucleoplasm and the DNA in free solution.\nCollect the supernatant as the nuclear fraction in a new 1.5 mL centrifuge tube kept on ice.\nTo 40 μL of the nuclear fraction add 13.3 μL of 4× SDS loading buffer.\nBoil lysate at 95°C for 5 min on a heating thermo shaker.\nStore the lysates at −20°C until loading on a SDS-PAGE gel for immunoblotting.\nNote: This sample is the nuclear fraction input of the immunoprecipitation reaction.\nStore the remaining volume (360 μL) of the nuclear fraction at −20°C for later use or keep on ice when immediately performing the immunoprecipitation. This sample will be used for the immunoprecipitation reaction.\nAlternatives: When performing nucleus/cytoplasm fractionation without an additional immunoprecipitation, add the required quantity of 4× SDS loading buffer to both fraction samples (800 μL cytoplasmic fraction, 400 μL nuclear fraction). Boil lysate at 95°C for 5 min and store at −20°C until use for SDS-PAGE and immunoblotting.\nPause point: When not immediately performing the immunoprecipitation, store both fraction samples at −20°C for later use (for up to one week).\nImmunoprecipitation\nTiming: 90 min\nIn this step the author describes in detail the immunoprecipitation from cytoplasmic and nuclear fractions using GFP-Trap agarose beads (Figure 2[href=https://www.wicell.org#fig2]). GFP-Trap agarose is an anti-GFP Nanobody conjugated to beads, which can be used for immunoprecipitation of GFP-fusion proteins and their interacting factors. Hence, the incubation step required for coupling antibodies to protein A/G agarose beads is omitted.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2704-Fig2.jpg\nFigure 2. Workflow of GFP-Trap immunoprecipitation\nCreated with biorender.com[href=http://biorender.com].",
    "Alternatives: Immunoprecipitation of GFP-fusion proteins can also be performed using an anti-GFP rabbit polyclonal antibody and protein A agarose beads (see key resources table[href=https://www.wicell.org#key-resources-table], respectively). Use 50 μL of settled protein A agarose (100 μL resin slurry). This amount of resin is sufficient to bind 25–250 μg of antibody (the amount may vary depending on the source of the protein A agarose). First, incubate the cytoplasmic and nuclear fraction sample with the appropriate amount of anti-GFP antibody at +4°C on an overhead rotator. The incubation time may vary between 2 h and 16 h–24 h. Next, wash the protein A agarose beads three times in immunoprecipitation buffer. Add 100 μL of the protein A resin slurry to the cytoplasmic and nuclear fractions containing the preformed antibody-complexes. Incubate for 4 h at +4°C on an overhead rotator. Collect and wash the beads by centrifugation. Discard the supernatant and elute the antibody-antigen complex from the resin by adding 70 μL of 1× SDS loading buffer to each sample. Boil the beads at 95°C for 5 min on a heating thermo shaker and store at −20°C until performing SDS-PAGE and immunoblotting.\nAlternatives: Immunoprecipitation can also be performed in the absence of GFP-fusion proteins. Instead of the pull-down assay using GFP-Trap agarose beads or protein agarose beads in combination with anti-GFP antibody, perform immunoprecipitation of endogenously expressed proteins. Affinity purify antigens using a specific antibody. Use appropriate protein A, protein G or protein A/G agarose beads, which depends on the optimal binding affinity of the antibody used for immunoprecipitation.3[href=https://www.wicell.org#bib3],4[href=https://www.wicell.org#bib4] Incubate the antibody with the cytoplasmic or nuclear fraction sample followed by incubation with the beads to capture your protein of interest and its interacting factors.",
    "Critical: To avoid denaturation, proteolysis, or dephosphorylation of proteins, keep all solutions and samples on ice e.g.in styrofoam ice boxes. The author performed all preparation steps at a 20°C–25°C bench. Perform incubation on an overhead rotator at 4°C in a cold room.\nThaw the samples of the cytoplasmic and nuclear fraction on ice.\nAlternatives: Store the samples on ice (step 12b and step 18b) to avoid freeze/thaw cycles. The activity of some enzymes is sensitive to repeated freeze/thaw cycles.\nPlace appropriate amounts of GFP-Trap Agarose beads in new 1.5 mL centrifuge tubes.\nCritical: Beads will tend to stick to the sides of the pipette tip. Cut 5 mm from the tip end to minimize the loss of beads in the tip and to facilitate pipetting.\nNote: The author routinely uses 15 μL of the GFP-Trap Agarose bead slurry for every immunoprecipitation reaction. The author used GFP-Trap Agarose beads, which have a binding capacity of 15–18 μg of recombinant GFP per 15 μL bead slurry. When performing more immunoprecipitation reactions, the author recommends generating a master mix. Multiply 15 μL of the GFP-Trap Agarose bead slurry with the number of the samples (and add two more samples as a reserve). For example, for six immunoprecipitation reactions, use 120 μL GFP-Trap Agarose bead slurry.\nWash the beads three times in immunoprecipitation buffer by centrifugation for 1 min at 4,000 × g and +4°C.\nRight before use, add protease and phosphatase inhibitor cocktail to a final 1× concentration to the immunoprecipitation buffer.\nNote: The author routinely uses 150 μL of immunoprecipitation buffer for each washing step of 15 μL GFP-Trap Agarose bead slurry.",
    "Note: The author used a protease and phosphatase inhibitor cocktail from a company (see key resources table[href=https://www.wicell.org#key-resources-table]). Add 1.5 μL of the 100× protease and phosphatase inhibitor cocktail to 150 μL immunoprecipitation buffer to produce a 1× final concentration.\nNote: Washing of the GFP-Trap Agarose beads minimizes nonspecific binding. The author recommends washing the beads by adding the immunoprecipitation buffer and vortexing at low speed until the bead pellet detaches from the bottom of the centrifuge tube. Be sure to fully resuspend the beads in immunoprecipitation buffer. Centrifuge at low speed to avoid crashing the beads.\nCritical: Remove the immunoprecipitation buffer. Be careful not to touch and/or lose the pellet. This is easily avoided using a hypodermic needle. Slowly lower the opening of the side of the tube opposite the pellet and aspirate the buffer. Aspiration of the supernatant with the help of a pump may cause the loss of beads.\nRemove the last of immunoprecipitation buffer.\nAdd immunoprecipitation buffer to the GFP-Trap Agarose beads.\nNote: The author recommends adding immunoprecipitation buffer to a final volume of 100 μL for each 15 μL GFP-Trap Agarose bead slurry. When generating a master mix in step 20, multiply 100 μL of immunoprecipitation buffer with the appropriate number. For example, for six immunoprecipitation reactions, 120 μL GFP-Trap Agarose bead slurry were washed. Add immunoprecipitation buffer to a final volume of 800 μL (orient yourself by the marking on the centrifuge tube).\nAdd 100 μL GFP-Trap Agarose bead-immunoprecipitation buffer mix to the cytoplasmic and nuclear fraction samples.\nIncubate for 1 h at +4°C on an overhead rotator.\nCollect the agarose beads by centrifugation for 3 min at 4,000 × g and +4°C.\nWash the beads three times in immunoprecipitation buffer by centrifugation for 1 min at 4,000 × g and +4°C.",
    "Note: The author recommends washing the beads by adding approximately 500 μL of immunoprecipitation buffer and vortexing at low speed until the bead pellet detaches from the bottom of the centrifuge tube. Be sure to fully resuspend the beads in immunoprecipitation buffer.\nCritical: Remove the immunoprecipitation buffer through a hypodermic needle. Be careful not to lose the pellet.\nRemove the last of immunoprecipitation buffer using a hypodermic needle.\nAdd 70 μL of 1× SDS loading buffer to each sample.\nBoil the beads at 95°C for 5 min on a heating thermo shaker.\nStore at −20°C until performing SDS-PAGE and immunoblotting.\nNote: The entire 70 μL sample is the eluate of the immunoprecipitation reaction. For SDS-PAGE, 15–20 μL of each sample will be loaded onto the stacking gel. Accordingly, 70 μL of the eluate sample is sufficient for 3–4 SDS-PAGE gels.\nSDS-PAGE and immunoblotting\nTiming: 2 days\nIn this step the author describes in short SDS-PAGE and immunoblotting[href=https://www.wicell.org#sec3.3] procedures, which are used to detect and characterize precipitated proteins from cytoplasmic and nuclear fractions. The protocol was adapted from Mahmood and Yang (2021).12[href=https://www.wicell.org#bib12] If not mentioned otherwise, all steps can be performed at 20°C–25°C.\nPerform SDS-PAGE to separate proteins under denaturing conditions.\nFill the buffer tank with SDS electrophoresis buffer.\nLoad 15–20 μL of each sample in pockets of the stacking gel.\nLoad 4 μL of a protein standard in one pocket.\nRun the gel with 80 V for 30 min and 100 V for approximately 2–3 h (depending on the size of the gel and acrylamide concentration).\nTransfer proteins to a nitrocellulose blotting membrane using Mini Trans-Blot cells for a wet blot approach at 110 V for 70 min.\nNote: The required transfer time may vary depending on the size of your protein.",
    "Stain the membrane in Ponceau S solution for 5 min.\nDestain the membrane in ddH2O for 5 min.\nDocument the stained membrane using a scanner.\nNote: Ponceau S staining is not mandatory. The author recommends performing Ponceau S staining to quickly detect protein bands on the immunoblot membrane. This is helpful to control the efficiency of the transfer and for total protein normalization.\nWash the membrane in 1× TBST until completely destained (approximately 3 min).\nNote: Perform all washing and antibody incubation steps on a rocking shaker to ensure even agitation.\nBlock the membrane in 3% skimmed milk/1× TBST or 3% BSA/1× TBST on a rocking shaker for 30 min.\nNote: Using milk or BSA depends on the primary antibody. Different antibodies have different binding strengths. The author routinely uses the dilution and blocking solution recommended by the company from which the antibody was purchased.\nProbe the membrane with the appropriate primary antibody on an overhead rotator at +4°C for 16 h–24 h in a cold room.\ntable:files/protocols_protocol_2704_13.csv\nNext day, wash membranes in 1× TBST three times for 10 min.\nIncubate membranes with the appropriate horseradish peroxidase-conjugated secondary antibody (diluted in 3% skimmed milk/1× TBST) for 1 h.\ntable:files/protocols_protocol_2704_14.csv\nWash membranes twice in 1× TBST for 10 min.\nWash membranes once in 1× TBS (without detergent) for 10 min.\nTreat membranes with enhanced chemiluminescence western blotting substrate (equal parts chemiluminescence solution 1 and 2) or ultra-sensitive substrate from a company (see key resources table[href=https://www.wicell.org#key-resources-table]).\nDetect signals using an imaging system."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Cell Biology",
    "Cell Separation/Fractionation"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}