{
  "id": 18770,
  "origin_website": "Jove",
  "title": "Slow-release Drug Delivery through Elvax 40W to the Rat Retina: Implications for the Treatment of Chronic Conditions",
  "procedures": [
    "All experiments conducted were in accordance with the ARVO Statement for the Use of Animals in Ophthalmic and Vision Research, and with the approval of the University of L’Aquila Animal Ethics Committee and the Australian National University Animal Experimentation Ethics Committee. Adult rats (P100-200) were used throughout this study.\n1. Prepare the Copolymer Resin Pellets\nPlace 20 Elvax 40W pellets into a small glass beaker in the fume cupboard.\nFill the beaker with 100% ethanol ensuring to cover all pellets.\nCover the beaker with Parafilm, and soak the pellets in 100% ethanol at room temperature for 7-10 days. NOTE: From this step onwards, do not use metal or plastic to handle or store the resin.\n2. Prepare the Drug Solution for Loading\nDissolve the drug of choice in 0.1% dimethyl sulfoxide (DMSO). Make the drug solution up to 40 µl in volume. Load the resin with three times the concentration of the drug that would be given in a single dose.\n3. Prepare and Load the Drug-resin Complex\nTransfer the 20 washed pellets to another small glass beaker. Dissolve the pellets in 4 ml dichloromethane for approximately 45 min. Cover the beaker with Parafilm while the pellets are dissolving.\nPrepare a solution of Fast Green FCF by dissolving it in 0.1% DMSO to a concentration of 0.001 mg/ml.\nTake one pipette, and draw up 40 µl of the drug solution prepared earlier. Load another pipette with 40 µl of Fast Green solution.\nAdd the two solutions simultaneously into the beaker. Mix rapidly using a glass stirring rod until the green dye is uniformly distributed throughout the mixture.\nPromptly transfer the beaker onto dry ice for 10 min to fast freeze the resin.",
    "Set up an “evaporative chamber” to evaporate the solvent. Fill a larger container up to one-third with calcium sulfate pebbles. Create a well in the pebbles, and carefully place the beaker in the well so that the pebbles reach up to half of the beaker, to stabilize the beaker in the chamber.\nCover the larger outside container with Parafilm.\nTransfer the evaporative chamber to the freezer. Keep at -20 °C for 2-3 weeks.\n4. Prepare the Drug-resin Complex for Surgical Implantation\nRemove the evaporative chamber from the freezer. Transfer the solid drug-resin block to a glass dish kept on ice.\nWith the aid of a microscope or loupe, cut a piece approximately 0.05 mm in diameter and 0.1 mm in length from the block using a trephine or punch tool.\nWrap the remainder of the block in freeze-proof material (e.g., aluminum foil) and keep at -20 °C until required.\n5. Surgically Implant the Drug-resin Complex into the Rat Eye\nPrepare the animal for surgery. Anesthetize using an intraperitoneal injection of a mixture of ketamine (100 mg/kg body weight) and xylazine (12 mg/kg body weight). Observe the animal until full anesthesia is achieved. NOTE: The animal should have a loss of movements (except breathing), and a loss of corneal and toe pinch reflexes.\nTransfer the fully anesthetized animal to the surgery table. Use mydriaticum (e.g., atropine sulphate), and local anesthetic (e.g., tetracaine hydrochloride) drops on the eye(s) undergoing surgery. Apply artificial tears to keep the cornea moist during surgery. Use disposable needles and sterile instruments throughout the surgery.\nStabilize the eye using a pair of blunt curved forceps after the pupil is fully dilated. Use an operating microscope to make a full depth puncture wound to reach the vitreous, approximately 2 mm from the limbus using a 25 G needle.",
    "Insert the prepared piece of the drug-resin complex into the puncture wound using a pair of fine, pointy forceps (e.g., tweezers) that are able to penetrate the puncture site.\nAs prophylaxis for bacterial infection, apply antibiotic ointment to the eye, to prevent inflammation as well as preventing corneal dryness while the animal is recovering.\nObserve the animal until full recovery. Do not leave the animal unattended until it has regained consciousness. Do not return the animal to the company of other animals until fully recovered. If the animal shows signs of stress or discomfort, analgesics should be used according to the approved ethics protocol.\nFollow the usual experimental procedures for collection and analysis of the tissue.\nAt the completion of experiments, euthanize the animal with an intraperitoneal injection of a pentobarbital (60 mg/kg body weight) 2% lidocaine hydrochloride solution.\nNOTE: Lignocaine Hydrochloride minimizes local discomfort.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}