{
  "id": 4814,
  "origin_website": "Bio",
  "title": "Infection Assay of Cyst Nematodes on <em>Arabidopsis</em> Roots",
  "procedures": [
    "Arabidopsis and mustard seed sterilization:Immerse seeds for 10 min in 5% calcium hypochlorite with 0.1% Tween 20, shake a few times.Pour off the solution and add 70% ethanol, incubate for 5 min.Wash 3 times in sterile water.Dry the seeds in a clean bench in a sterile Petri dish.Stock culture of H. schachtii:Prepare 14.5 cm 0.7% water agar plates.Prepare 14.5 cm Knop agar plates.Place 20 sterile mustard seeds on 0.7% water agar plate.Seal the plates with Nescofilm.Store in a dark place at RT for 3-4 days.Transfer 3 seedlings onto a 14.5 cm Knop agar plate and seal the plates with Nescofilm.Store in a dark place at RT for about 10 days.Infect the roots with nematodes (3-4 drops per root); it is convenient to use J2 that are left over from an infection test.Keep the plates in a dark place at room temperature until the cysts are needed. It takes approximately 2 months until the cysts can be harvested. It is possible to store the plates for up to 1 year. However, if the agar in the plates becomes too dry it may be more difficult to pick out the cysts.Preparation of H. schachtii inoculum:Prepare a funnel:Assemble the funnel as shown in Figure 1 with a 100 µm sieve.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150917/20150917023923_9270.jpgFigure 1. Funnel for hatching. Glass beakers, funnels, silicone tubes, and clips can be bought from local suppliers.Cover the funnel with aluminum foil.Sterilize by autoclaving for 20 min at 120 °C.Prepare 15 µm and 100 µm sieves (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150917/20150917023950_1974.jpgFigure 2. 15 µm and 100 µm sieves are needed for sterilization of J2s. Only the 100 µm sieves are shown on this picture.Cut off 1 cm high rings from a 50 ml syringe.Heat one side of the ring and glue it to a piece of PVC membrane (15 µm or 100 µm mesh).",
    "Sterilize by autoclaving for 20 min at 120 °C.Prepare 0.7% gelrite: Add 1.4 g gelrite to 200 ml distilled water, cook until the solution becomes clear.Autoclave for 20 min at 120 °C.Pour 5 ml into 15 ml tubes (becomes solid at RT).Pick cysts from the stock culture on mustard.Place the cysts into the 100 µm sieve sitting in a 50 ml glass beaker.Soak the cysts in 5% calcium hypochlorite with 0.1% Tween 20 for 10 min.Wash 4 times with sterile distilled water.Put the sieve with the cysts into the hatching funnel (Figure 1).Fill the funnel with 3 mM ZnCl2 (stimulates hatching of the J2).Keep the hatching funnel in darkness at RT.The hatched larvae move through the 100 µm sieve into the silicone tube and can be collected from the silicone tube (Figure 1) by briefly opening the clip after 3-5 days into a 15 µm sieve.Sterilize the J2 for 2 min by putting the 15 µm sieve with the J2 into a beaker containing 0.05% HgCl2.Wash four times by transferring the 15 µm sieve with the J2 into a beaker with sterile distilled water.Resuspend the J2 in 0.7% gelrite prior to inoculation.Adjust the concentration of the inoculum to 20 J2 per drop of gelrite using a pipette by counting the J2 in the drops under a stereo microscope.The J2 can be stored for 2-3 days in a fridge at 4 °C without loosing their infectivity.Arabidopsis cultivation:Prepare 9 cm Knop agar plates.Grow the Arabidopsis plants:Place sterile seeds on Knop agar plate (Figure 3). Use 10 seeds per plate.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150917/20150917024016_9982.jpgFigure 3. Template for Arabidopsis seedsIncubate the plates for 4 days at 4 °C to ensure uniform germination.Place the plates horizontally in the growth chamber for 2 days.",
    "Tilt the plates to approximately 20 degrees so that the roots will grow to the bottom of the plates between the agar and the Petri dish.Inoculation of Arabidopsis plants:Inoculate 12-d-old Arabidopsis roots with 60 J2 per plant by putting 3 drops of gelrite containing the J2 on different parts of the root.Incubate horizontally in the dark over night at RT.Put the plates back into the light.Analysis of the nematode infection:Take pictures of syncytia with female nematodes at 13 dpi.(We use an Axiovert 200M inverse microscope with an integrated camera) at 14 dpi count the numbers of male and female nematodes (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150917/20150917024053_0811.jpgFigure 4. Male (A), female (B) nematode and the cyst (C)Size measurement of syncytia and cysts (females):Select 10 syncytia/cysts at random.Outline the cysts and the syncytia [we use the Contour tool of the AxioVision software and the software will calculate the size (Figure 5)].imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150917/20150917024126_2000.jpgFigure 5. Size measurement of female nematodes and syncytia. Numbers are the sizes calculated by the contour tool of the AxioVision software for nematodes (blue) and syncytia (red). Shown are syncytia induced in transgenic lines overexpressing a WRKY gene and the wild type (Col) [from Ali et al. (2014)]Analyze the significance of the results using analysis of variance (ANOVA) (P < 0.05) (we use SPSS 12.0).Counting the nematodes:Use a stereo microscope.Invert the plates and use waterproof markers with different colors to mark males and females by placing a dot besides the nematodes.Count the dots for males and females.Calculate the total number of males and females for each line per plant or root length. From these data calculate the male/female ratio.If there is a difference in the growth (size) of control and test (mutants, transgenic lines) lines at the time of inoculation classify the lines on the Petri dishes according to Figure 6.",
    "Analyze the significance of the results using analysis of variance (ANOVA) (P < 0.05) (we use SPSS 12.0).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150917/20150917024155_4656.jpgFigure 6. Growth classes of Arabidopsis plants. This figure can be used to classify the Arabidopsis lines if there are differences in plant growth to adjust the number of nematodes [from Jürgensen (2001)]."
  ],
  "subjectAreas": [
    "Microbiology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}