{
  "id": 8197,
  "origin_website": "Bio",
  "title": "Generation of Mouse Spinal Cord Injury ",
  "procedures": [
    "Autoclave Impactor tip, spinal cord stabilizing forceps, dissecting forceps, AUTOCLIP wound clips and applier prior to surgery.Set up surgical area Impactor with computer should be placed on lab bench near surgery area (Figure 1). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130827/20130827223021_9376.jpgFigure 1. Impactor and computer setup. Computer running IH-0400 software. A is setup on lab bench next to Impactor apparatus. B. The lab bench is direclty opposite the surgical site (not shown) to facilitate movement of mouse. Screw in Impactor tip of desired size into Impactor machine.Reassemble support arms on Impactor stage each time to ensure smooth function. Screw in spinal cord stabilizing forceps (Figure 2). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130827/20130827223146_4897.jpgFigure 2. Impactor setup. (A) Impactor tip is screwed into Impactor rod. (B) Spinal cord stabilizing forceps are screwed into support arms. Mouse is placed on Impactor stage after laminectomy and prior to impaction. Anesthetize one 8 weeks old mouse with 2.5% isoflurane in 100% O2. Until indicated, all steps below are performed under anesthesia.Use a razor blade to shave the fur to expose the skin above the thoracic and few segments of the lumbar vertebrae. Disinfect surfaces with surgical iodine followed by 70% ethanol.Administer 2.5 mg/kg Baytril (diluted in 0.9% NaCl – see Recipes) subcutaneously (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130827/20130827223243_3674.jpgFigure 3. Preparing mouse for surgery. After anaesthesia induction, dorsal fur is removed and sterilzed with surgical iodine and 70% ethanol. Prior to incision, 2.5 mg/kg Baytril is injected subcutaneously. Make an incision in overlying skin, fascia and muscle to expose vertebral column. This is performed in the laminar flow hood to maintain sterility.With dissecting forceps and scissors, perform a laminectomy of T10 to T12 to expose the spinal cord. Sterile cotton tip applicators may be used to gently remove debris and clean area.",
    "Note: When the animal is in the lying flat with dorsal-side up, T12 is located at the apex of the vertebral curvature and T10 is located two vertebrae rostral (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130827/20130827223332_9599.jpgFigure 4. Laminectomy site identification. After skin is removed, muscle overlying vertebral column is exposed. T12 can be identified at the apex of the dorsal aspect of the vertebral curvature (arrow). T10 is two vertebral segments rostral. Overlying muscle and fascia will need to be removed to visualize segments.Position the mouse on the Impactor stage with front and hind limbs extended.Apply spinal cord stabilizing forceps to the lateral processes of the vertebral column immediately rostral and caudal to the laminectomy site. Ensure that the dorsal surface of the spinal cord is parallel to the surface of the Impactor tip (Figure 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130827/20130827223434_1900.jpgFigure 5. Impaction setup. After laminectomy, mouse is placed on Impactor stage. Spinal cord stabilizing forceps (A) are placed rostral and caudal to laminectomy site. Vertebral column must be positioned such that the dorsal surface of the spinal cord is parallel to Impactor tip surface (B). Lower Impactor tip to a few millimeters above spinal cord tissue to ensure that it is properly centered above T11. Set injury parameters accordingly in the software. For severe SCI in C57BL/6 mice, “Experiment Mode” = Force, “Force” = 70, “Velocity” = 1 and “Dwell Time” = 60. Note: For other strains, ages, or injury severities, Force and Dwell Time may need to be adjusted. For example a lesser Force will be needed to produce a mild or moderate SCI. As CD-1 mice are typically larger than C57BL/6, a larger diameter Impactor tip may be necessary to fully impact the spinal cord at T11.Conversely, younger mice may require a smaller Impactor tip and less impaction force to produce severe injuries.Click “Start Experiment”.",
    "Wait for impaction to finish. “Displacement v Time” and “Force v Time” graphs will appear with data from the actual impaction (see Figure 6 for an example).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130828/20130828185334_3569.jpgFigure 6. Example readout after aumotaed SCI. Data from the tip sensor will be displayed as “Displacement vs. Time” and “Force vs. Time” graphs. The set paraments (in this case Force = 70, Velocity = 1 and Dwell Time = 60) as well as the actual values are also displayed. Raise Impactor tip and gently release spinal cord stabilizing forceps from vertebral column.Suture skin using 9 mm AUTOCLIPS.Administer 0.05 mg/kg Buprenex (diluted in 0.9% NaCl – see Recipes) subcutaneously.Remove mouse from anesthesia and place in a mouse cage on highly absorbent soft bedding warmed by electrical heating pad (Figure 7). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130827/20130827223630_5974.jpgFigure 7. Post-impaction care. After impaction is complete, skin is sutured using AUTOCLIPS. Mouse is removed from anaesthesia and placed on soft-bedding warmed by an electric heating pad. After mouse is conscious, further post-operative care is carried out (see step 19). Monitor mouse and provide post-operative care. Post-operative care includes monitoring animals for pain and infection, providing heat support (with heating pad) until animals are ambulatory, and diet gel liquid food packs for easy consumption. Water bottles should also be placed in cage with long sipper tubes to facilitate hydration. Animals are given 2.5 mg/kg Baytril once daily for seven days, and longer as needed. 0.05 mg/kg Buprenex for the first 48 h post-surgery and thereafter, as needed. Bladders must be manually expressed twice daily until animals can self-void. Urine should be clear to yellow in appearance. If there are signs of infection (cloudy, red-tinged), Baytril is given for five days or until infection is cleared, whichever is longer."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}