{
  "id": 19081,
  "origin_website": "Jove",
  "title": "Protocol for Long Duration Whole Body Hyperthermia in Mice",
  "procedures": [
    "1. Animal Ethics\nBefore performing the long duration hyperthermia on mice make sure that the procedure has been approved by Institutional Animal Care and Use Committee. All the procedures discussed in this paper and shown in the accompanying video were approved by the Institutional Animal Ethics Committee of the National Institute of Immunology.\n2. Understanding Hyperthermia\nWhole Body Hyperthermia (WBH) is delivered by placing the animals in prewarmed cages that are placed in incubator maintained at 39.5°C. During the standardization of protocol, a temperature sensor was surgically implanted in the mice and their body temperature was monitored in different experimental conditions. It was observed that upon placing the animals in heated environment, their temperature gradually increased from 37 °C to up to 42 °C over the duration of 100 min (Figure 1). The resulting \"spike\" in temperature is intriguing as the internal body temperature shot even higher than the external environmental temperature. \nWhen the body temperature exceeded 40 °C, the animal would show signs of stress and dehydration such as wetting around the snout. Increase the body temperature beyond 40 °C, will lead to wetting and irreversible stress or even death of animals due to heat stress. So it is important to prevent the temperature spikes during the course of hyperthermia. \nThis phenomenon of high temperature spikes is associated with the physical hyperactivity of animal during hyperthermia exposure. Similar temperature spikes were observed by other groups too and were associated with the physical hyperactivity of the animal upon being introduced to environment having higher temperatures 10. \nIn our protocol, mice are immobilized during the hyperthermia exposure. As shown in Figure 2, immobilization of animal prevents the temperature spikes.",
    "We have used 8-12 weeks old BALB/Cj mice for demonstrating this protocol. The protocol is not restricted to a particular type/strain of the mice.\n3. Preparing for the Experiment\n3.1 Incubator\nThis experiment can be performed in a normal CO2 incubator as they have a good temperature control. Disconnect CO2 gas supply and remove water holding tray of the  CO2 incubator. In some models of incubators it is possible to switch off the CO2 controller. Arrange shelves of the incubator so that a mice cage could be placed conveniently inside. Set the temperature of the incubator at 39.5 °C.\n3.2 Cages\nTypically, the hyperthermia experiment is performed on 4 mice at a time. Two cages are required; one is placed inside the incubator and the other is placed outside at room temperature. Bedding of cages is avoided, as the patches of bedding become wet with time which results in non-uniform temperature inside the cage. The outside cage should have food pellets and water bottle. \n3.3 Mice immobilization tubes\nDuring the course of first 4 cycles of hyperthermia mice are immobilized in perforated tubes. These immobilization tubes can be made from 50 ml 'centrifuge' tubes by piercing 3 mm holes all over its body and four of such tubes will be required. The 50ml tube can conveniently immobilize BALB/Cj mice which are older than 8 weeks.  Tubes of appropriate sizes may be required for some unusually different strain of mice or for mice which are very young or older than 50 weeks.\nPlace immobilization tubes and a cage inside the incubator maintained at 39.5 °C. Wait for at least 2 hour so that the cage and immobilization tubes attain the temperature of the incubator.  \n4.  First cycle of the Hyperthermia",
    "Mice may experience dehydration during the hyperthermia exposure. Therefore before beginning the experiment, administer 0.5 ml normal saline intraperitoneally to every mouse.  Use a 26 G needle with 1 ml syringe.\nQuickly take out the cage placed in the incubator, place one animal in each immobilization tubes and place the cage back in the incubator. Record the time. It is essential to keep the cage at the same place in the incubator every time.\nAfter 90 min, take out the cage from the incubator. Release animals from the immobilization tubes and place them in the cage at normal temperature with easy access to food and water. Place empty immobilization tubes back in the incubator. \nAfter 15 min, the second cycle of hyperthermia is started by delivering 0.5 ml saline intraperitoneally to every mouse. \nThey are then immobilized in 50 ml perforated immobilization tubes and placed in the incubator. \n5. Subsequent Hyperthermia Cycles\nFor first 4 cycles, it is essential to immobilize mice during the hyperthermia exposure and for the first two cycles, saline injection is given before beginning the hyperthermia period. \nAfter these cycles of hyperthermia followed by rest are completed, mice get acclimatize and do not become hyperactive during the hyperthermia exposure. The intraperitoneal injection of saline may not be necessary if mice readily take food and water during the resting time.\n6. After All the Cycles Completed, the Final Step is to Examine the Animals",
    "There should not be any death during the hyperthermia cycles. Every animal has to be watched very carefully in the first few cycles. Rapidly look for any wetting around the snout. This symptom is a signature of dehydration. Mice with such symptoms should immediately be given 0.5 ml normal saline i.p and rest at room temperature.  Most of the immobilized mice will not require any additional care and will successfully bear the stress the hyperthermia. \nAfter completing required cycles, animals may look weak and dehydrated but they will quickly recover within few hours. \nimgsrc://cloudfront.jove.com/files/ftp_upload/3801/3801fig1.jpg\nFigure 1.  Variation of the core body temperature of Mice when the cage was placed in an incubator at 39.5 °C. After 90 min the cage was removed from the incubator and placed at 25 °C. Red circles indicate high temperature spikes.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3801/3801fig2.jpg\nFigure 2.  Variation of the core body temperature of an immobilized Mice during the hyperthermia cycles. After immobilizing the animal, high temperatures spikes were not observe when the cage was placed at 39.5 °C.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}