{
  "id": 18522,
  "origin_website": "Jove",
  "title": "A Method of Trigonometric Modelling of Seasonal Variation Demonstrated with Multiple Sclerosis Relapse Data",
  "procedures": [
    "NOTE: Each step described corresponds to a section of Stata code with the same number in the code file provided. Stata command names have been italicised in the following protocol.\n1. Prepare and Plot the Observed Relapse Onset Data\nOpen a do file by clicking on the \"New Do-file Editor\" button and use the generate command to calculate the number of relapse onsets dated to each of the twelve calendar months for each of the three geographic levels to be modelled: location, hemisphere and global. Action command by clicking the \"Execute (do)\" do-file action button in the do-file.\nUse the swilk orsktest command to test the underlying distribution of relapse counts for normality using a Shapiro-Wilk or modified Jarque-Bera test for location aggregate relapse data or disaggregate patient level relapse data respectively. Select code and click \"Execute (do)\".\n\tNOTE: In the presence of significant skew, apply a natural log transformation and subsequently test the log-transformed relapse count variable for approximate normality by reapplying the Shapiro-Wilk or modified Jarque-Bera test as appropriate.38,39\nUse the generate command to create a new variable \"north_month\" for southern hemisphere calendar months offset by +6 to allow plotting of both northern and southern hemisphere relapses by season along the same horizontal axis. Select code and click \"Execute (do)\".\n\t\nGraph a scatterplot of observed monthly relapse onsets with relapse frequency on the y-axis and calendar month on the x-axis for each hemisphere using the twoway scatter command. Repeat for each location. Observe pattern of peaks and troughs in relapse onset over the calendar year by viewing each plot in the graph viewer the automatically opens to screen.",
    "Use the radar command to draw radar plots of the distribution of relapse frequency by calendar month with each radar axis capturing a single month ordered in a clockwise manner. Select code and click \"Execute (do)\".\n\t\nRepeat for all sites. Observe pattern of peaks and troughs in relapse onset over the calendar year by viewing each plot in the graph viewer the automatically opens to screen.\nRun the seast command to apply an Edward's test of seasonality across the observed relapse data.40-42 Repeat for all geographic levels.\n2. Model Building and Selection\nUse the generate command to specify the annual cycle sine and cosine trigonometric functions to be used in the regression. Select code and click \"Execute (do)\".\nUse the regress command specify the form of the base model with relapse count as the dependent outcome variable and the sine and cosine terms calculated in step 2.1 as the primary explanatory variables.\n\t\nAdd location-specific UVR37 to the base model as an additional adjusting covariate and use the analytic weight aweight option to weight the model for the number of patients contributed by each location. Select code and click \"Execute (do)\".\n\t\tNOTE: Record the model coefficient of determination (R2) and the residual error in the results window that automatically opens to screen. Ultraviolet radiation: Daily average erythemally-weighted ambient UVR for each month from 1979 to 2004 inclusive was sourced from the National Aeronautics and Space Administration Earth Probe Total Ozone Mapping Spectrometer for all individual locations included in the analysis. 37\nStore the model predicted monthly log(relapse) using the predict command. Convert log relapses back to integer relapse counts by exponentiating the log(relapse) term using the generate command. Select code and click \"Execute (do)\". Repeat for all sites.",
    "Overlay the exponentiated predicted monthly relapse estimates from 2.3 over the observed monthly relapse data using the twoway scatter command. Select code and click \"Execute (do)\".\n\t\nRepeat for all sites. View each plot in the graph viewer.\nUse the regress command to expand the model specified in 2.2 by adding an additional harmonic sine/cosine pair. Select code and click \"Execute (do)\".\n\tNOTE: Record the residual error and the coefficient of determination. Save and transform model estimates as per 2.3 and plot model estimates over observed data as per 2.4. Repeat for all sites.\nUse the regress command to further expand the model specified in 2.2 by adding two additional harmonic sine/cosine pairs. Select code and click \"Execute (do)\".\n\tNOTE: Record the residuals and the coefficient of determination. Compare this model directly with the base model using a likelihood ratio test. Use the estat ic post-estimation command to generate Akaike and Bayesian Information Criteria. Save and transform model estimates as per 2.3 and plot model estimates over observed data as per 2.4. Repeat for all geographic levels.\n3. Estimating Peak Relapse Probability\nUse the non-linear combination of estimators function (nlcom) to calculate the point estimate and 95% confidence interval for the phase-shift, using the best-fitting model identified from steps 2.1 through 2.6. Select code and click \"Execute (do)\".\n\t\nConvert these point estimates and associated confidence intervals to numbers representing calendar dates of peak relapse frequency (Tmax) and trough relapse frequency (Tmin) , where 1=1st January and 365=31st December and Tmax = phase-shift + (365/4) and Tmin = phase-shift + ((365/4)*3). Repeat for all geographic levels. Match Tmax and Tmin to a calendar date via the Excel look-up file.",
    "Use the generate command to calculate peak-to-trough difference (Tmax minus Tmin) for each location, standardized for every 100 patients per site. Use a Wilcoxon rank-sum test to compare standardized peak-to-trough difference by latitude range. Select code and click \"Execute (do)\".\n4. Modelling Ultraviolet Radiation Data\nRun use command to load the UVR data. Calculate median monthly UVR for each location using the egen command. Select code and click \"Execute (do)\".\nGraph a scatterplot of monthly UVR (y-axis) by calendar month (x-axis) for each location using the twoway scatter function. View each plot in the graph viewer the automatically opens to screen.\nRepeat step 1.2 for the UVR data and use the regress command to specify a base model of location-level annual UVR trend where monthly UVR is specified as the dependent outcome variables and the sine and cosine trigonometric functions specified in step 2.1 are incorporated into the model as the explanatory variables.\nRepeat steps 2.4 through 2.6 for the UVR model and limited to the location-specific models only. This involves rerunning the twoway scatter command to overlay predicted estimates on observed data and using the regress command to run the expanded harmonic model alternatives.\nUsing the best-fitting model of location-specific monthly UVR identified in steps 4.2 through 4.4 use the generate command to calculate the phase-shift point estimate and associated 95% confidence interval for UVR by again applying the double-angle formulae specified in step 3.1. Calculate Tmin (date of trough UVR) for each location using the formula described in step 3.1. Select code and click \"Execute (do)\".\n5. Modelling UVR-trough-to-relapse-peak Lag",
    "Append the model-estimated dates of seasonal UVR trough from step 4.5 and relapse peak dates from step 3.1 for each location using the merge command. Use the generate command to calculate the time lapsed in months between UVR trough date and subsequent relapse peak date. Select code and click \"Execute (do)\".\nUse the sktest command to test the UVR-trough-to-relapse-peak lag variable for significant departures from normality using a Shapiro-Wilk test Select code and click \"Execute (do)\".\nAppend location-level latitude data to dataset using the merge command. Convert relative latitude to absolute latitude using the abs(x) function. Select code and click \"Execute (do)\".\nUsing the regress command, test the linearity of the relationship between lag and absolute latitude by running both linear and quadratic regressions and comparing residuals. Select code and click \"Execute (do)\".\nUsing regress, specify a linear mean regression model with UVR-trough-to-relapse-peak lag as the dependent outcome variable and absolute latitude in units of 10 degrees as the predictor variable. Weight the model for the number of patients contributed by each location using the aweights regress option. Select code and click \"Execute (do)\".\nUse the twoway scatter command to plot absolute latitude on the y-axis against UVR-trough-to-relapse-lag in months on the x-axis. Overlay a line of best fit using lfit graph option. Visualise the relative patient weights of each location using the aweight analytical weights option. Select code and click \"Execute (do)\".\n6. Sensitivity Analyses of Patient-level Relapse Propensities",
    "Use the mepossion command to specify a mixed-effects Poisson regression where monthly relapse count is the dependent outcome variable, the sine and cosine trigonometric functions specified in step 2.1 are again incorporated into the model as the fixed variables, baseline EDSS, age at MS onset and prior exposure to MS specific disease-modifying treatment are included as potential confounders and unique patient identifier is specified as a random effect. Select code and click \"Execute (do)\".\nRepeat steps 2.4 through 2.6 to identify the best-fitting Poisson model. This involves rerunning the twoway scatter command to overlay predicted estimates on observed data and using the regress command to run the expanded harmonic model alternatives.\nUse the non-linear combination of estimators function (nlcom) to calculate the point estimate and 95% confidence interval for the phase-shift and calculate the date of peak relapse frequency. Compare results with the primary analysis.\nUse the generate command to recalculate UVR-trough-to-relapse-peak lag in months for each location as described in step 5.1, using the patient-level Poisson model estimates of peak relapse date derived in step 6.3. Select code and click \"Execute (do)\".\nUse the regress command to remodel absolute latitude as a predictor of lag as described in step 5.5 and compare results with the primary analysis. Select code and click \"Execute (do)\".\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}