{
  "id": 4755,
  "origin_website": "Bio",
  "title": "Nanofluidic Proteomic Immunoassay",
  "procedures": [
    "Cell culture and lysate preparationCulture cells (such as HeLa or HCT116 cells) in DMEM or McCoy’s 5A medium supplemented with 10% FBS to 80-90% confluence in 10 cm plates. Treat cells as required.Gently wash cells in plates with 10 ml ice-cold PBS. Aspirate PBS thoroughly. Add 400 μl ice-cold RIPA or Bicine/CHAPS lysis buffer supplemented with both aqueous and DMSO protease/phosphatase inhibitor mix to each 10 cm plate on ice. Gently swirl plates to ensure good coverage and incubate for 10 min on ice. Scrape cells thoroughly. Pipet up and down to mix. Transfer buffer and cells to a 1.5 ml microfuge tube and incubate for additional 20 min on ice. Vortex the tube briefly every 5 min.Clarify by centrifugation (14,000 x g, 10 min) at 4 °C.Transfer supernatant to a fresh microfuge tube. Immediately aliquot supernatant (10-30 μl per aliquot) on ice and store at -80 °C.Measure protein concentrations using the BCA protein assay kit.Sample preparation for loading (for 12 lysates)In a microfuge tube, combine 110 µl premix G2 pH5-6, 110 µl premix G2 Servalyte pH5-8, 3.95 µl ladder 3, 1 µl Standard 5.5, and 4.5 µl DMSO protease/phosphatase inhibitor.Vortex for at least 15 sec to mix thoroughly. Aliquot 19 µl of the mix to each of 12 microfuge tubes. Dilute 5 μg of high concentration lysate with sample diluent or Bicine/CHAPS buffer to a final volume of 6 µl.Add the 6 µl of diluted lysate into one of the 12 tubes with 19 µl of the mix. The final protein concentration in capillary is 0.2 µg/µl.Add 10 µl of lysate mix into wells in row A (see Table 2).Primary antibody preparationPrepare primary antibodies at 1:50 dilution with antibody diluent (from the secondary antibody detection kit) in microfuge tubes.",
    "Add 10-20 μl of diluted primary antibodies into appropriate wells of 384-well assay plate (see Table 2).Secondary antibody preparationPrepare secondary antibodies at 1:100 dilution with antibody diluent in microfuge tubes.Add 10-20 μl of diluted secondary antibodies into appropriate wells of 384-well assay plate (see Table 2).Streptavidin-HRP preparationPrepare SA-HRP at 1:100 dilution with antibody diluent.Add 10-20 μl of diluted SA-HRP into appropriate wells of 384-well assay plate (see Table 2).Peroxide/Luminol preparationCombine 120 µl XDR peroxide and 120 µl luminol, mix well, and then add 10-20 μl of the mix into appropriate wells of the assay plate (see Table 2).Centrifuge the assay plate at 2,500 x g for 5 min to spin down the liquid and eliminate bubbles. Protect the plate from light before loading into the equipment.While the plate is spinning, create the assay file in Compass software. Set up as below for AKT assay. Table 1. Parameters of instrument settings table:",
    "﻿0,1\nInstrument setting,Parameters\nSample loading time,25 sec\nSeparation conditions,\"40,000 μW, 40 min\"\nUV immobilization time,60 sec\nWash 1,\"2 washes, 150 sec each (default)\"\nPrimary antibody incubation,120 min (default)\nWash 2,\"2 washes, 150 sec each (default)\"\nSecondary antibody incubation,60 min (default)\nWash 3,\"2 washes, 150 sec each (default)\"\nChemiluminescence exposure time,\"30, 60, 120, 240 and 480 sec\"\nTable 2. An example of an assay layout. Assays are set up in 384-well plates. Table 2 was an example of an assay layout for 12 samples and 6 antibodies. Lysates were added into wells in row A from A1 to A12, respectively. Diluted primary antibodies were added into wells in row B (B1 to B12) to row G. Diluted secondary antibodies were added in row H (H1 to H12). Streptavidin-HRP was added into row I (I1 to I12). To avoid possible contamination between streptavidin-HRP and detection reagents in the plate, Lumino/Peroxide XDR was added into row A (A13 to A24) away from streptavidin-HRP.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150718/20150718005554_5605.pngStart the runLaunch the Start Run Wizard: Empty waste bottle and fill wash bottle with fresh ultrapure water.Replace sponge.Fill the wash buffer, Anolyte and Catholyte cups.Put capillary box in the primary capillary box position.Load sample plate. Click the “RUN” button to start the assay.Data analysisData analysis is performed with the Compass software provided by ProteinSimple.In Image Analysis Settings, view data for different exposures in the Analysis screen. Choose the best exposure time according to the intensity of the signals.In Peak Fit Analysis Setting, set up Range (for AKT): minimum: 4.5, Maximum: 7.0.In Standard Analysis Settings, choose Std. Ladder 3 (premix pI 5-8) and add Standard 5.5 to the pI column and enter 500 in the Position column of the Fluorescent Peaks table. Select 4.9 and 7.0 for capillary registration by clicking the checkbox in the Registration column."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}