{
  "id": 13696,
  "origin_website": "Jove",
  "title": "Accurate and Phenol Free DNA Sexing of Day 30 Porcine Embryos by PCR",
  "procedures": [
    "In accordance with the Canadian Council on Animal Care guidelines and with approval of the Faculty Animal Policy and Welfare Committee - Livestock of the University of Alberta, pregnant sows were euthanized by trained staffs at approximately Day 30 of pregnancy and embryos were collected. Use examination gloves at all times during the procedures.\n1. Sample Collection and Sample Storage\nEuthanize sow using captive bolt followed by exsanguination. Wear examination gloves to collect the reproductive tracts and embryos from each euthanized sow.\n\tNote: Rapid collection of samples and transfer embryos to dry ice or liquid nitrogen will result in higher quality tissues for other molecular works such as microarray and qPCR.\nDissect the uterus and gently separate all the embryos within their extraembryonic placental membranes from the underlying uterine wall21. Make sure there is no maternal tissue contamination.\nRecord length and weight of all viable embryos prior to freezing.\nCollect each individual embryo and immediately wrap it up in an aluminum foil before snap freezing with liquid nitrogen.\nTransfer the frozen embryos from liquid nitrogen directly to a -80 °C freezer.\n2. Grinding Embryos\nLabel all sample tubes (15 ml) with the sample ID needed for the number of samples to be analyzed.\nFill thermal container with dry ice to half full and insert the pre-labelled sample tube in the dry ice.\nWear winter gloves with another pair of examination gloves on top for transferring the pre-chilled mortars and pestles from -80 °C freezer to dry ice container.\nPlace the frozen embryo inside the mortar on the dry ice.\nPour adequate liquid nitrogen to cover the embryo and grind it with the pestle into a fine powder.\nTransfer the embryo powder to a pre-labeled sample tube with a microspatula (Figure 1) and place the tube in a -80 °C freezer.",
    "Use a clean pre-chilled mortar and pestle for each embryo and change the examination gloves after grinding each embryo to avoid cross contamination between samples.\n3. Genomic DNA Preparation using Modified Sodium Hydroxide Method\nLabel all the microcentrifuge tubes (1.5 ml) needed for the number of samples to be analyzed.\nTransfer the sample tubes containing embryo powder from the -80 °C freezer to a container with dry ice prior to starting.\nPipette 180 µl of 50 mM NaOH (sodium hydroxide) into each pre-labelled microcentrifuge tube.\nTurn on an incubator and pre-heat to 95 °C.\nUse a toothpick to transfer the correct amount of embryo powder (about 5-10 mg) (Figure 2) from the sample tube into a pre-labelled microcentrifuge tube containing the 50 mM NaOH solution.\nPull up the same toothpick slowly to visualize the DNA lysate as a sticky, gooey, white transparent-like substance (Figure 3).\nTransfer the microcentrifuge tubes with DNA lysate to the pre-heated incubator at 95 °C for five minutes. Immediately transfer the tube to a styrofoam box filled with ice.\nAdd 20 µl of 1 M Tris-HCl directly into the microcentrifuge tube and mix it by gently tapping the tube. Use a pH paper to ensure the pH is approximately 8.0 (Figure 4) prior to centrifugation.\n\tNote: When dealing with a large number of sample preparations, it is acceptable to randomly pick few samples to check the pH.\nCentrifuge the tube with the DNA lysate at 2,000 x g in a microcentrifuge for two min at room temperature to remove undissolved tissue debris.\nTransfer 150 µl of the top clear supernatant into a new tube or 96 well plates.",
    "Note: The clear DNA lysate is ready to use as a template in PCR reaction and it is stable at 4 °C for two weeks, or it can be kept at -20 °C for a year.\n4. Design Sex-specific PCR Primers\nObtain accession numbers for Porcine sex determining region Y (SRY) (NM_214452.3) and and zinc finger protein X-linked (ZFX) genes (XM_005673501.1) from NCBI website http://www.ncbi.nlm.nih.gov/.\nCopy and paste these NCBI accession numbers to an online primer design tool.\n\tNote: The best primers information including length, Tm and GC% as well as PCR product size (bp) will be generated on the computer screen (Figure 5).\nValidate the specificity of these primers using nucleotide Blast program (Blastn) against the current porcine genomic database 104 to ensure these sequences are only located on X and Y chromosome for SRY and ZFX respectively (Figure 6).\n5. Genomic DNA PCR Directly from DNA Lysates\nUse only 1 µl of the DNA lysate as a template for a 15 µl PCR reaction.\n\tNote: A high throughput screening method for 96-well plates PCR can be performed in similar way using a multichannel pipette.\nDo the following just for the first PCR: prepare one PCR tube for the no template negative control and two additional tubes for positive controls by adding 1 µl (0.5 ng) of commercially obtained known sex porcine genomic DNA. Later, include a sample from the last successful sexing analysis as a positive control and run together with the new PCR reaction for sex determination.",
    "Use any HotStart ready mix PCR enzyme and prepare a master mix by adding primers and nuclease free water depending on the total number of PCR reactions. Add 1 µl of the DNA lysate into a pre-existing PCR tube with 14 µl of the PCR master mix. Add primers such that the final concentration of the primers from two sex-specific genes is 0.3 µM in total of 15 µl PCR reaction.\nSet up the following PCR program in a thermal cycler: 95 °C for 3 min, 35 cycles each with a 20 sec melting step 98 °C, followed by a 15 sec annealing step at 65 °C, followed by a 15 sec elongation step at 72 °C. In a final step, incubate the reactions for 1 min at 72 °C and continue to incubate at 4 °C until removal of the PCR tube for gel electrophoresis verification to determine the sex.\n\tNote: PCR conditions and optimization are according to the manual of the PCR kit mentioned in the Materials Table.\nAdd the appropriate amount of non-toxic green- fluorescent SYBR DNA gel stain when preparing a 2% TBE agarose gel.\n\tNote: Ethidium bromide can be substituted for green- fluorescent stain if it is not available.\nAdd 1.5 µl of the loading dye (10x) into the PCR tube and mix well by pipetting the PCR reaction buffer up-and-down.\nLoad 10 µl of the sample into the well and run the agarose gel with appropriate voltage settings (small gel apparatus at 100 V, 96-well gel apparatus at 150 V until the dye band runs half way through the gel).\nObserve and adjust the bands intensities under the fluorescent light setting using a laser scanner and capture an image of the gel. Note: Common gel imager can be substituted for the ethidium bromide gel.",
    "Determine the sex of the porcine embryos by identifying embryos with one band as a female and two bands as a male (Figure 7).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}