{
  "id": 14865,
  "origin_website": "Jove",
  "title": "Chemical Affinity-Based Isolation of Extracellular Vesicles from Biofluids for Proteomics and Phosphoproteomics Analysis",
  "procedures": [
    "All urine samples were collected from healthy individuals after informed consent. The experiments were compliant with all ethical standards involving human samples and conform to the guidelines from Purdue University Human Research Protection Program.\n1. Sample collection\nCentrifuge 12 mL of urine sample in a 15 mL conical centrifuge tube for 10 min at 2,500 x g, 4 °C to remove cell debris and large apoptotic bodies.\nTransfer 10 mL of the supernatant into a new 15 mL tube and proceed with EV isolation.\n\t​NOTE: The protocol can be paused here, and the samples can be stored at -80 °C and thawed at 37 °C upon use.\n2. EV isolation using the EVtrap approach\nAdd 0.5 mL of loading buffer (1:10 v/v ratio) and 100 µL of EVtrap bead slurry (1:50 v/v ratio) to the sample according to the manufacturer's instructions.\nIncubate the sample by end-over-end rotation for 30 min at room temperature.\nPellet the sample by placing the 15 mL conical tube on a magnetic separator rack. Remove the supernatant.\nResuspend the beads in 1 mL of washing buffer and transfer the suspension to a 1.5 mL microcentrifuge tube. Gently pipette to resuspend the EV-bound beads.\nPlace the tube on a 1.5 mL microcentrifuge tube magnetic separator rack and aspirate the supernatant. Use a P200 pipette to completely aspirate the supernatant and avoid aspirating the beads.\nWash the beads with 1 mL of washing buffer. Add the buffer immediately after aspirating the supernatant to prevent the beads from drying out.\nWash the beads 2x with 1 mL of phosphate-buffered saline (PBS) at room temperature.\nIncubate the beads with 100 µL of freshly prepared 100 mM triethylamine for 10 min at room temperature and collect the eluted solution containing EVs using a 1.5 mL microcentrifuge tube magnetic separator rack.",
    "NOTE: To prepare 1 mL of 100 mM triethylamine, dilute 14 µL of triethylamine solution in water.\nRepeat Step 2.8 and combine the eluted solutions. Dry the eluate using a vacuum centrifuge concentrator at 4 °C.\n\tNOTE: The experiment can be paused here. Dried EV samples can be stored at -80 °C for several months without adverse effects on the following steps or the results.\n3. Characterization of EVs by western blotting\nResuspend 5% of the dried EV sample (equivalent to 0.5 mL of the urine sample) in 20 µL of 1x lithium dodecyl sulfate (LDS) sample buffer with 10 mM dithiothreitol (DTT).\n\tNOTE: EVs from 0.5 mL of urine are enough for detecting CD9 (an EV marker24) signal in western blotting.\nBoil the sample for 5 min at 95 °C. Load the sample on a polyacrylamide gel and perform electrophoresis and immunoblotting following standard protocols25.\nAfter transferring the proteins onto a low-fluorescence polyvinylidene fluoride (PVDF) membrane, block the membrane with 1% bovine serum albumin (BSA) in tris-buffered saline tween-20 (TBST) for 1 h at room temperature. To prepare 1 L of TBST buffer, add 19 mM Tris base, 137 mM NaCl, and 1 mL of Tween-20; adjust pH to 7.4 using HCl.\nIncubate membrane with rabbit anti-CD9 antibody at 1:5,000 ratio in 1% BSA in TBST at 4 °C overnight or for 2 h at room temperature.\nWash the membrane 3x for 5 min each with TBST. Incubate the membrane with anti-rabbit IgG, HRP-linked secondary antibody at 1:5000 ratio in 1% BSA in TBST for 1 h at room temperature.\nWash the membrane 3x for 5 min each with TBST. Add the commercially obtained enhanced chemiluminescence (ECL) substrates (1:1 ratio) onto the membrane and detect signals on a chemiluminescence imaging system.\n4. Sample preparation for proteomics and phosphoproteomics analysis",
    "Prepare fresh lysis buffer containing 12 mM sodium deoxycholate (SDC), 12 mM sodium lauroyl sarcosinate (SLS), 100 mM triethylammonium bicarbonate buffer (TEAB), 10 mM tris-(2-carboxyethyl)phosphine (TCEP), 40 mM chloroacetamide (CAA), and 1x phosphatase inhibitor cocktails.\n\tNOTE: The stock solutions are listed in the description of the Table of Materials. The lysis buffer is prepared by adding the stock solutions to achieve the desired concentrations depending on the required volume.\nSolubilize the dried EV sample in 100 µL of lysis buffer and heat the sample for 10 min at 95 °C with shaking at 1,100 rpm.\nAfter cooling the sample to room temperature, dilute it five-fold by adding 400 µL of 50 mM TEAB.\nMeasure the protein concentration using a BCA assay kit as per the manufacturer's instructions. Use the lysis buffer diluted five-fold with 50 mM TEAB as blank.\nAdd trypsin/Lys-C mix at 1:50 w/w enzyme-to-protein ratio and incubate the sample at 37 °C overnight with shaking at 1,100 rpm.\nAdd 50 µL of 10% trifluoroacetic acid (TFA) to acidify the sample.\nAdd 600 µL of ethyl acetate to the samples and vortex the mixture for 2 min.\nCentrifuge the sample for 3 min at 20,000 x g and remove the upper layer (organic layer). Avoid disturbing the interface during aspiration.\nRepeat steps 4.7-4.8. Dry the aqueous phase using a vacuum centrifuge concentrator.",
    "Resuspend the dried sample in 200 µL of 0.1% TFA to acidify peptides and desalt the sample using a C18 desalting tip according to the manufacturer's instructions. Condition the tip with 200 µL of 0.1% TFA in 80% acetonitrile, followed by 2x with 200 µL of 0.1% TFA. Load the acidified peptide sample into the tip and then wash the tip 3x with 200 µL of 0.1% TFA. Elute the peptides with 200 µL of 0.1% TFA in 80% acetonitrile.\nDry the eluate using a vacuum centrifuge concentrator. Dry 2% of the peptide sample (equivalent to 0.2 mL of the urine sample) separately for proteomics analysis. Use the rest (98%) of the sample for phosphoproteomics analysis.\nEnrich phosphopeptides from the sample using a phosphopeptide enrichment kit according to the manufacturer's instructions. Perform the steps described below for enrichment.\n\t\nResuspend the dried sample in 200 µL of loading buffer. Add 50 µL of the beads to the sample and shake vigorously for 20 min at room temperature. Load the sample with the beads to the fritted tip and centrifuge for 1 min at 100 x g.\nWash the tip with 200 µL of loading buffer, followed by washing buffer 1, then washing buffer 2. Perform all three washing steps by centrifuging once for 2 min at 20 x g and once for 1 min at 100 x g.\nPut the tip with beads into a new tube to collect the eluted phosphopeptides. Add 50 µL of elution buffer to the tip and centrifuge once for 2 min at 20 x g. Add another 50 µL of elution buffer to the tip and centrifuge once for 2 min at 20 x g. Centrifuge one final time for 1 min at 100 x g.\nDry the eluted phosphopeptides using a vacuum centrifuge concentrator.",
    "5. LC-MS/MS analysis\nNOTE: Different LC-MS/MS systems/settings and data-acquisition methods, such as data-dependent acquisition (DDA) can be used.\nResuspend the dried proteome/phosphoproteome samples in 0.1% formic acid (solvent A) and load the samples according to the manufacturer's instructions.\nInject the samples into trapped ion-mobility time-of-flight MS through the liquid chromatography (LC) system and use the preset standardized Whisper 40 samples per day method. Peptides are separated on a 15 cm C18 column (75 µm inner diameter, 1.9 µm particle size) as mentioned in the Table of Materials.\nFor proteomics analysis, acquire data using a parallel accumulation-serial fragmentation combined with data-independent acquisition (dia-PASEF) acquisition method with a mass range per ramp spanning from 300-1200 m/z and from 0.6-1.50 1/K0 with a cycle time of 1.38 s.\nFor phosphoproteomics analysis, acquire data using a dia-PASEF acquisition method with a mass range per ramp spanning from 400-1550 m/z and 0.6-1.50 1/K0 with a cycle time of 1.38 s.\nLoad the raw files into proteomics software and perform signal extraction, identification, and quantitation using a library-free data independent acquisition workflow.\n\t\nFor search settings, use Homo sapiens database, specific digest types with trypsin/P enzymes, 7 minimal peptide length, 52 maximum peptide length, two missed cleavage, carbamidomethyl at cysteine as fixed modification, acetyl protein N-term, oxidation at methionine, and phosphorylation at serine, threonine, and tyrosine (for phosphoproteomics analysis) as variable modifications, and 5 as maximum variable modifications. Set the FDR at PSM, peptide, and protein group to 0.01.\n\t\tNOTE: Spectronaut software was used in this protocol. Other DIA data searching software such as DIA-NN and PEAKS are also commonly used. If data was acquired in DDA mode, software such as MaxQuant and Proteome Discoverer are applicable.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}