{
  "id": 1630,
  "origin_website": "Cell",
  "title": "Protocol to Generate Senescent Cells from the Mouse Hepatic Cell Line AML12 to Study Hepatic Aging",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nSeeding Cells (Day 0)\nTiming: approximately 30 min\nThis step describes how to seed AML12 cells\nRemove and discard culture medium from the precultured AML12 flask.\nBriefly rinse the cell layer with prewarmed 1× autoclaved PBS to remove all traces of serum.\nAdd 2.0 mL of TrypLE™ to T25 flask, incubate at 37°C for 3–5 min and observe cells under an inverted microscope. Extend incubation time (if required) so that the cell monolayer is dispersed (usually within 5–10 min).\nNote: Do not agitate the cells by hitting or shaking the flask to avoid clumping.\nAs TrypLE™ is a proprietary product and concentration is not disclosed, it is used as 1× final concentration. Alternatively, 0.05% Trypsin-EDTA solution can be used for 5–15 min.\nAdd 8.0 mL of complete growth medium and aspirate cells by gently pipetting.\nTransfer cell suspension to a 15 mL conical centrifuge tube and centrifuge at 250 x g for 5 min.\nNote: Do not use higher x g for centrifugation to avoid clumping.\nSuspend cell pellet in 1.0 mL complete medium and check cell number using cell counter.\nSeed 4 × 106 cell in 20 mL complete medium into one T175 flask.\nCritical: Do not use >4 × 106 cells while seeding to avoid >50% confluency next day (day 1).\nSenescence Induction (Day 1)\nTiming: 1–1.5 h\nThis step describes how using high dose H2O2 treatment induces senescence.\nCheck T175 flask containing AML12 under inverted microscope to make sure they have reached approximately 50% confluency as shown in Figure 1[href=https://www.wicell.org#fig1]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/107-Fig1.jpg\nFigure 1. Confluency of AML 12 Cells before H2O2 Treatment",
    "Left panel represents an appropriate confluency (approximately 50%) to start H2O2 treatment for senescence induction. Right panel represents that cells are fully confluent and cannot be used for senescence induction. Scale bars as 100 μm.\nIf cells are appropriately confluent, change complete growth media from the flask to prewarmed basal media containing 1.0 mM H2O2.\nIncubate the cells for 1 h in cell culture incubator at 37°C.\nAfter 1 h, change the basal media to complete growth media for recovery and incubate cells in cell culture incubator at 37°C for next 23 h.\nNote: If cells are less confluent and look sparse, wait until cells reach approximately 50% confluency. If cells are, or almost are confluent (>75%), split and reseed cells as described in day 0.\nCritical: Appropriate confluency (about 50%–60%) is important to achieve senescence-induced morphological changes in cells such as cellular hypertrophy shown in Figure 2[href=https://www.wicell.org#fig2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/107-Fig2.jpg\nFigure 2. Schematic Representation of H2O2 Treatment for Senescence Induction in AML12 Cells\nShown are morphological changes during senescence induction, and the effect on cell number for 3 days after the last re-seeding of senescent AML12 cells. Scale bars as 100 μm.\nSenescence Induction (Days 2–6)\nTiming: 1–1.5 h each day\nPeriodic treatment of low dose H2O2 from day 2 to day 6 for senescence induction\nCheck flask containing AML12 under inverted microscope for cell health.\nChange complete growth media from the flask to prewarmed basal media containing 750 μM H2O2.\nIncubate the cell for 1 h in cell culture incubator at 37°C.\nAfter 1 h, change the basal media complete growth media for recovery, and incubate cells in cell culture incubator at 37°C for the next 23 h.\nRepeat the steps 12–15 4 times until day 6.",
    "Critical: If cells become confluent at day 3 or 4, they need to be sub-cultured at 1:3 (if it is day 2) or 1:2 (if it is day 4) ratio as described in the day 0 section, steps 1–5 followed by suspending the cell pellet in 60 or 40 mL of complete growth media and seeding 20 mL in each T175 flask. This plating density will allow the cells to achieve senescence-induced hypertrophy.\nNote: The time of the H2O2 treatment should be kept the same each day to allow sufficient recovery time (22–24 h) to induce senescence successfully.\nNote: A change in the media color (from reddish/orange to more orange/yellow) can be visualized when senescence progresses each day of senescence induction (as shown in Figure 2[href=https://www.wicell.org#fig2]). Senescent cells are metabolically more active for anaerobic glycolysis and generate lactic acid. Therefore, the media becomes more acidic as senescence progresses.\nNote: For ease, notes can be written on the flask as shown on Figure 3[href=https://www.wicell.org#fig3].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/107-Fig3.jpg\nFigure 3. Marking the Date and Time of H2O2 Treatments on the Flask\nSplitting Senescent Cells (Day 7)\nTiming: ∼1 h\nSub-culturing/seeding of senescent cells for experiments\nCheck flask containing senescent AML12 under inverted microscope for cell health and morphological changes as shown in Figure 2[href=https://www.wicell.org#fig2].\nRemove and discard culture medium from the flask.\nBriefly rinse the cell layer with prewarmed 1× autoclaved PBS to remove all traces of serum.\nAdd 2.0 to 3.0 mL of TrypLE™ to a flask, incubate at 37°C for 3–5 min and observe cells under an inverted microscope. Extend incubation time (if required) so that the cell monolayer is dispersed (usually within 5–10 min).\nNote: Do not agitate the cells by hitting or shaking the flask to avoid clumping.",
    "Add 6.0 to 8.0 mL of complete growth medium and aspirate cells by gently pipetting.\nTransfer cell suspension to a 15 mL conical centrifuge tube and centrifuge at 250 x g for 5 min at 4°C.\nNote: Do not centrifuge at higher than 250 x g to avoid clumping.\nSuspend the cell pellet in 1.0 mL complete medium and check cell number using a cell counter.\nSeed the cells in appropriate cultureware (6-well plate, chambered slides, culture dishes, etc.) according to experimental requirements.\nCritical: Senescent cells exhibit cellular hypertrophy as a morphological change. Thus, a smaller number of senescent cells than control cells (non-senescent cells) are required for seeding if the experiment will be performed the next day. However, if the experiment needs several days to be completed, more senescent cells than controls cells will need to be seeded, since senescent cells have a lower population doubling time compared to control non-senescent AML12 cells (shown in Figure 2[href=https://www.wicell.org#fig2]). Final results should be normalized appropriately to either protein content or cell number.\nPause Point: These senescent cells can be cryopreserved for future experiments at this point. Details for cryopreservation can be found https://www.atcc.org/Products/All/CRL-2254.aspx[href=https://www.atcc.org/Products/All/CRL-2254.aspx]."
  ],
  "subjectAreas": [
    "Cell Culture",
    "Metabolism",
    "Cell Biology"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}