{
  "id": 3511,
  "origin_website": "Cell",
  "title": "Protocol for screening cellular outputs activated by optogenetically controlled temporal PI3K signaling activation patterns",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nEstablishment of cells stably expressing PPAP2 by lentivirus\nTiming: 3 weeks (for steps 1 to 6)\nLentivirus allowed us to establish PPAP2-stable cell lines such as melanoma (A375), glioblastoma (U87), and colorectal cancer (SW620), as shown in.1[href=https://www.wicell.org#bib1] Here, A375 cells are shown as an example, termed A375-PPAP2.\nObtain vectors for expressing lentivirus.\nNote: Our previous study used the Lenti-pCSII vector cloning PPAP2 (pCSII-PPAP2) (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3083-Fig3.jpg\nFigure 3. The vector map for PSII-PPAP2.2\nObtain Lenti-pCSII-CMV vector (#RDB04377) from RIKEN-BRC.\nInsert IRES and puromycin cassettes into this vector.\nInsert iSH-SspB-mCherry-P2AT2A-iLID-CAAX into this vector, resulting in its designation as pCSII-PPAP2.2.\nAmplify this plasmid, pCAG-HIVgp (#RDB04394), and pCMV-VSV-G-RSV-Rev (#RDB04393) into DH5α E. coli.\nPurify plasmids from 80 mL of E. coli by the QIAGEN Plasmid Plus Midi Kit (QIAGEN).\nGeneration of lentivirus.\nSeed HEK293T cells, as virus packaging cells, in 10-cm dishes and culture until 60–70% confluency in DMEM supplemented with 10% FBS and 1% PS (DMEM+).\nAfter 24 h, transfect the cells with a mixture of 3.5 mL of Opti-MEM, 35 μL of Lipofectamine 3000 reagent, 70 μL of P3000 reagent, 17 μg of pCSII-PPAP2 vector, and 10 μg of pCAG-HIVgp and pCMV-VSV-G-RSV-Rev in 4.5 mL with DMEM+ using Lipofectamine 3000.\nAfter 12 h, replace the medium with DMEM+ containing 10 μM forskolin.\nAt 48 h after transfection, collect DMEM+ containing PPAP2 lentiviral particles.\nFilter the virus particle-containing medium through 0.45 μm filters.\nMeasure the lentivirus titers using the Lenti-X qRT-PCR Titration Kit.\nNote: The titers fell within the range of 107∼108 copies/mL.\nStore the virus solution at 4°C for use within 3 days. For long-term storage, freeze aliquots at -80°C after being treated with liquid nitrogen.\nLentivirus infection.\nCulture A375 cells until 20% confluence in a 12-well plate 24 h before lentivirus infection.",
    "Mix the lentivirus-containing medium 1:1 with DMEM+ and then add it to A375 cells.\nSelection of virus-infected cells.\nTwenty-four hours after lentiviral infection, replace the medium with 1 mL of DMEM+ including 2 μg/mL puromycin.\nCulture these cells for 3–4 days.\nAnalysis of PPAP2-positive cells.\nAfter 3–4 days, check mVenus- and mCherry-positive cells for PPAP2.1 and PPAP2.2 under fluorescence microscopes, respectively (CKX53, Evident/formerly Olympus).\nNote: For the microscopy setup, a mercury lamp is used to emit light. U-MWIG3 and U-MNIGA3 filters (Evident/formerly Olympus) were employed to observe mVenus and mCherry fluorescence, respectively. The cell images were observed using the MXPLFLN20X objective lens (Evident/formerly Olympus). After selection with puromycin, nearly 100% of the cells exhibited fluorescence positivity.\nDetermination of whether PPAP is effective.\nPPAP2.1:\nEvaluate the increase in Akt phosphorylation at Thr308 and/or Ser473 at 5 min after blue light irradiation by western blotting.\nNote: All antibodies were diluted 1:1000 in Tris(hydroxymethyl) aminomethane solution containing 0.1% Tween20.\nCheck whether cell membrane dynamics, such as membrane ruffles, are observed after blue light irradiation with time-lapse imaging as shown in the following images (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3083-Fig4.jpg\nFigure 4. Time-lapse imaging of cell membrane dynamics induced by PPAP2.1\nBlue light was used to irradiate a local region highlighted by a blue rectangle. White bar = 20 μm.\nNote: To locally activate PPAP2.1, the region of interest in a blue square is irradiated with a 458 nm laser. Images of mVenus fluorescence were taken by a 515 nm laser under laser scanning fluorescence microscopy.\nCheck whether a PIP3-binding fluorescence probe translocates to the plasma membrane after blue light irradiation.",
    "Note: A PH domain that specifically binds to PIP3 was utilized for PIP3 detection (Figure 5[href=https://www.wicell.org#fig5]). In PPAP2-expressing A375 cells, near-infrared fluorescent protein (iRFP)-tagged tandem PH domains (PH(x2)-iRFP) were expressed. Prior to blue light irradiation, this probe was localized in the cytoplasm. Under blue light irradiation, the probe rapidly translocated to the plasma membrane, as depicted in the subsequent images.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3083-Fig5.jpg\nFigure 5. Detection of PIP3 production by a PIP3 fluorescence probe (PH(x2)-iRFP) after PI3K signaling activation by PPAP2.2\nWhite bar = 20 μm.\nPPAP2.2:\nSimilar to PPAP2.1, check whether iRFP translocation of PH(x2)-iRFP to the plasma membrane is observed after blue light irradiation under fluorescence microscopy.\nNote: For step 3, a filtration step is necessary to remove living HEK293T cells.\nNote: For step 4, in the selection of virus-infected cells, a concentration of 2 μg/mL puromycin was found to be suitable for A375 cells. However, since the optimal concentration varies depending on the cell type, the concentration can be adjusted for the cells in use.\nNote: For step 4, long-term passage leads to dilution of PPAP2 expression levels due to gene silencing and/or deletion from genomes. Aliquots should be stocked as much as possible.",
    "Note: For step 6, there are several options to confirm that PPAP2 works appropriately. Regarding a-ii, specific laser wavelengths such as 515 nm are needed to observe mVenus fluorescence without activating PPAP2.1. Additionally, photostimulating lasers with wavelengths of 458 nm and 488 nm, which are different from the lasers used for observation, are necessary for local blue light irradiation. For a-iii and b, an iRFP fluorescence excitation and acquisition system is needed, in which the excitation laser and acquisition wavelengths are 633 nm and 705 ± 50 nm, respectively. Additionally, regarding b, it would be better to prevent bleed-through of mCherry fluorescence to an iRFP fluorescence channel because mCherry also translocates to the plasma membrane after blue light irradiation, causing false-positive signals.\nProbe expression in A375-PPAP2 cells in 96-well plates\nTiming: 48 h\nSeeding of A375-PPAP2 cells.\nSeed a total of 2 × 104 A375-PPAP2 cells in each well of a 96-well plate.\nTransfection of a probe for monitoring translation activity (Cap-rLuc-IRES-fLuc) by Lipofectamine 3000.\nTwenty-four hours later, prepare transfection solution for a total of 36 wells (32 wells for blue-light conditions and 4 wells for dark conditions) as a mixture of 675 μL of Opti-MEM, 18 μL of Lipofectamine 3000 reagent, 31.5 μL of P3000 reagent, and 18 μg of plasmid DNA in 4.5 mL of DMEM+.\nDispense one hundred microliters of the solution in each well with a multichannel pipette.\nSix hours later, replace the medium with normal DMEM+.\nNote: A Cap-rLuc-IRES-fLuc probe was transfected after A375-PPAP2 cells were seeded in 96-well plates to prevent dilution of the probe concentration.\nBlue light irradiation of A375-PPAP2 cells\nTiming: 27 h\nIrradiation of various temporal blue light patterns.\nReplace the medium with DMEM containing 1% FBS and 1% PS for serum starvation 3 h before blue light irradiation.",
    "Place the 96-well plate on the LED illumination plate, and then, stimulate the cells with various patterns of blue light irradiation (time: 6, 24 h, frequency: pulse, continuous).\nNote: Blue light sometimes causes cytotoxicity, indicated by measurements such as a decrease in cell number. As shown in troubleshooting, the FUJIFILM neutral density filter (ND filter) can reduce the intensity of blue light. Alternatively, black 96-well plates can be inserted between cells and LEDs.\nAnalysis of translation activity\nTiming: 2 h\nDetection of fLuc and rLuc signals with a luminescence plate reader.\nChange the medium in the plate to HBSS including 20 μM D-luciferin as a substrate for firefly luciferase (fLuc).\nTransfer the plate to multiple plate readers (TriStar LB941, Berthold), and then, measure fLuc luminescence.\nChange the medium to HBSS containing 5 μM coelenterazine h.\nTransfer the plate to multiple plate readers, and then, measure rLuc luminescence.\nFor analysis, obtain rLuc/fLuc values, which are calculated by dividing the rLuc signal by the fLuc signal.\nNote: Under dark conditions, the typical signal counts for fLuc and rLuc are 70 and 200, respectively, with a counting time of 0.5 seconds. Under blue light irradiation, the fLuc signal decreases to 55 counts, while the rLuc signal increases to 240 counts.\nAnalyze these data and make graphs using GraphPad Prism 6 software.\nNote: Regarding the assay order, fLuc should be acquired first because the rLuc signal is much stronger than the fLuc signal.\nNote: All experiments were performed at room temperature."
  ],
  "subjectAreas": [
    "Cell Membrane",
    "Cell Biology",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}