{
  "id": 5421,
  "origin_website": "Bio",
  "title": "Adoptive Transfer of Lung Antigen Presenting Cells",
  "procedures": [
    "Preparing single cell suspension from the lungs of donor miceEuthanize mice with CO2. Cut the rib cage to expose both the heart and lungs (Figures 1A and 1B).To remove blood cells from the lung, perfuse the lungs with 3-5 ml PBS using a 23 gauge needle via the right ventricle of the heart (Figure 1C). Gently inject PBS till the color of lungs turns to white. Note that redness may maintain throughout perfusion in areas inflamed or injured.Excise the lung lobes (total 5 per mouse, Figure 1D) and place them in a 60 x 15 mm Petri dish with approximately 1 ml cold PBS and store on ice until all the lungs are harvested from all the mice.Remove lungs from PBS and mince with scissors in the lid of the Petri dish until the consistency of applesauce; keep lungs from each mouse separate (Figure 1E).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170314/20170314071448_3529.jpgFigure 1. Preparing lung tissue. A. Pin a euthanized mouse on a plastic foam board. B. Cut the rib cage to expose both the heart (H) and the lungs (L). C. Perfuse the lungs by injecting PBS into the right ventricle of the heart. The black arrow points to the needle inserting into the heart. D. Lung lobes (5) are removed and placed in a Petri dish with cold PBS. E. The lungs are minced.Rinse the scissors and the Petri dish with 15 ml collagenase digest solution (see Recipes below) and place into a 50 ml conical centrifuge tube.Close the tubes and incubate the tubes for 5 min in a 37 °C water bath and then for 30 min in a 37 °C incubator on a rocker.Using a 10 ml slip tip syringe, draw the sample up and down 20 times to disperse cells.Centrifuge for 10 min at 200 x g (i.e.",
    ", 1,000 rpm) in a swing bucket centrifuge. Aspirate the supernatant and discard; break up the pellet by vortexing gently.Add 3 ml cold RBC lysis buffer (NH4Cl, see Recipes below) per sample to lyse red blood cells, incubate on ice 2-3 min.Add 10 ml cold complete media (see Recipes) to each tube to stop lysis and pellet again at 200 x g for 10 min at 4 °C.Aspirate supernatant, break up the pellet, and add 5 ml serum-free media (see Recipes) to resuspend the cells.Cut tip off syringe tip cap with razor blade and place it on a 10 ml slip tip syringe (this is to make the syringe tip a little longer for dispersing the volume smaller than 5 ml. Draw the sample up and down 20 times to disperse cells.Draw up the solution into the syringe and filter through a sterile 100 µm nylon screen. Rinse the screen with an additional 5 ml of complete media.Add 10 ml 40% Percoll in complete media. Mix well by inverting the tubes 5 times and centrifuge for 20 min at 1,800 x g (i.e., 3,000 rpm), turn off brake.Aspirate supernatant and discard; break up pellet with 10 ml of complete media. Count cells with trypan blue exclusion on a hemocytometer. Note: We usually recover 16-17 million cells/naïve mouse.Lung APC enrichmentNote: In our hands, the yield of lung APCs is usually about 5% of total cells in the lung single cell suspension. One may roughly calculate a starting total lung cell number in order to obtain enough lung APCs for his/her experiments.Centrifuge single cell suspension for 10 min at 200 x g and aspirate supernatant and discard.",
    "Resuspend cell pellet in 400 µl of cold MACS buffer (see Recipes) for less than or equal to 108 total lung cells and add 100 µl of CD11c MicroBeads. Scale up buffer and beads if more than 108 total cells.Mix well and incubate for 15 min in the refrigerator (2-8 °C). Note that working on ice may require a longer incubation time.Wash cells with 10 ml cold MACS buffer per 108 cells and centrifuge at 200 x g for 10 min at 4 °C.Aspirate supernatant and then resuspend cell pellet in 500 µl of MACS buffer. Place column in the magnetic field of a MACS LS column. Prepare column by rinsing with 3 ml MACS buffer.Place a sterile 100 µm nylon screen on the column. Apply cell suspension onto the column by filtering through the nylon screen. Collect flow-through containing unlabeled cells in a 15 ml conical centrifuge tube.Wash column with 3 ml of MACs buffer and collect unlabeled flow-through cells. Wash 3 times.Remove column from the separator and place it over a new 15 ml conical centrifuge tube. Pipette 5 ml of buffer on the column. Immediately flush out the magnetically labelled cells by firmly pushing the plunger into the column.Centrifuge enriched CD11c+ cells at 200 x g for 10 min and discard supernatant.Wash cells by gently breaking up the pellet with 10 ml serum free medium. Count cells with trypan blue exclusion on a hemocytometer. Note, usually recover 1-2 million APCs/mouse.Centrifuge at 200 x g for 10 min and discard supernatant. Resuspend cells in appropriate volume of serum-free medium to reach a final concentration of 1 x 106 cells per 200 µl.",
    "Adoptive transfer of lung APCs into recipients via intravenous injectionNote: Adoptive transfer can also be achieved by intratracheal administration (for detailed protocol of intratracheal administration, please refer to Ortiz-Muñoz and Looney, 2015, Bio-protocol).Load cell suspension into a 1 ml syringe with 26 G needle. Make sure to remove air bubbles.Place recipient mouse in a plastic mouse restrainer and warm the tail with a heat lamp for about one minute (Figure 2A).Immobilize the tail with gentle traction (Figure 2A). Spray the tail with 70% ethanol to visualize the lateral tail vein and rotate the tail ¼ turn for easier injection.At the distal portion of the tail, insert needle parallel to the vein 2 to 5 mm into to the lumen (Figure 2B).Inject 1 x 106 cells in 200 µl per mouse. Inject the cell suspension slowly. The cell suspension should flow easily if needle is properly located. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170314/20170314071953_7885.jpgFigure 2. Tail vein injection. A. A recipient mouse is placed in a restrainer. B. Insert a needle into a mouse tail vein to inject cells.Withdraw the needle and apply pressure to prevent bleeding.Place the recipient mouse back into its cage. Mice may then receive designated treatments and can be analyzed at appropriate time points."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}