{
  "id": 10834,
  "origin_website": "Jove",
  "title": "Microfluidic Flow Chambers Using Reconstituted Blood to Model Hemostasis and Platelet Transfusion In Vitro",
  "procedures": [
    "This protocol follows the institutional ethical guidelines for research on human samples and informed consent was obtained from all donors involved. Approval for the experiments described here was obtained from the institutional review board of the Antwerp University Hospital.\nNote: Temperature indications are always room temperature, unless specified.\n1. Preparation Flow Chamber Setup\nPreparing Lanes, Tubing and Pins\n\t\nVortex the collagen suspension vigorously and dilute 1/20 in the isotonic glucose solution supplied by the provider to a final concentration of 50 µg/ml.\n\t\tNote: We use equine tendon collagen, mainly made up of type I fibrils. The equine collagen type I is often referred to as \"Horm\" collagen and is the golden standard for this type of assay9 for both historical as well as biological reasons. Human type III collagen can also be used, but the fibrils coat less well and the platelet response is not as strong. Other coating surfaces can also be used, for example von Willebrand Factor (VWF), fibrinogen, fibronectin, laminin, vitronectin, thrombospondin-1 or combinations of these16.\nTake a new disposable biochip from the provider's container. The dimensions of the biochips used here are 0.4W x 0.1H x 20L in mm3.\nPipet 0.8 µl into the lane(s) of the microfluidic biochip on one end of the chip and mark as outlet. Make sure that the lane is filled 5/6th with the collagen containing coating solution prepared in 1.1.1. Ensure that there are no air bubbles.\n\t\tNote: Channels are partially coated to avoid accumulation of collagen fibers at the entrance of the channel (see discussion).\nIncubate at 4 °C for 4 hr or overnight in a humidified and closed container.",
    "Block the coated channels by pipetting blocking buffer (1.0% (w/v) bovine serum albumin and 0.1% (w/v) glucose in 10 mM 4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid (HEPES) buffered saline (HBS; 0.9% (w/v) NaCl, pH 7.4) at the other end and mark as inlet. Make sure that the lane is completely filled with the blocking buffer avoiding air bubbles.\nCut tubing at equal length (12 cm). Use one per lane and connect each tubing with a pin. For example, an experiment comparing two conditions, run in duplicate will require four tubing stretches and four pins to be prepared.\nRinse the tubing with distilled water using a syringe and a 26 G needle or the accompanying connectors.\nSaturate the tubing with blocking buffer. Store in a closed and humidified container for a minimum of 1 hr.\nPreparing Pump and Manifold\n\t\nRinse the pump and manifold with distilled water, remove air bubbles.\nAspirate the blocking buffer out of the biochip lane(s) using the fixed 10 µl tip at the outlet. Clean the surface of the biochip with a precision dust free wipe and denaturated alcohol to remove prints and dust.\nFix the biochip on an automated microscope stage. If more than one lane is used simultaneously in one run, connect the eight-lane manifold splitter to the biochip outlet.\n\t\tNote: The eight-lane manifold splitter is a piece of hardware (Figure S1) connected to the pump and the biochip. It allows operation of all available (eight) lanes on a biochip or a combination of lanes which can be operator-defined in the accompanying software.",
    "Use the pins in the tubing to fix them in the biochip inlet. Place the other end of the tubing (without pin) in a 1.5 ml conical test tube filled with HBS. Rinse all tubing and their connected lanes with 1 ml HBS using the pump, so as to remove remainder blocking buffer and poorly adhering collagen.\n2. Preparation of Blood Samples\nCollection and separation of fresh whole blood from a healthy volunteer.17\nCollect the first milliliters of blood in an evacuated tube containing Ethylenediaminetetraacetic acid (EDTA) as an anticoagulant and exclusively use this sample for complete blood count (CBC) with an automated hematology analyzer.\nCollect a volume of blood in a suitable anticoagulant using evacuated tubes. Standard anticoagulants for flow chamber experiments are heparin or hirudin when fibrin formation is not part of the study protocol and sodium citrate when it is.\n\t\tNote: Heparin was used as an anticoagulant for all the experiments described in the results.\n\t\tNote: The amount of blood depends on the number of experiments to be performed. Approximately 1 tube (7 ml) for 3 lanes.\nPlace the tubes on a rotator pending blood reconstitution.\n\t\tNote: The assay should be completed within 3 hr of phlebotomy.\nCentrifuge for 15 min at 250 g to prepare platelet rich plasma (PRP). Do not use the centrifuge break to prevent disturbance of the loosely packed pellet.\n\t\t\nWhen more than one tube was collected, pool the blood in a single conical centrifugation tube.\n\t\t\tNote: Centrifugation can be done more slowly or less long, depending on the PRP yield and differential cell \"contamination\" preferred.\nRemove and discard the PRP and buffy coat yielding packed red blood cells with few platelets.",
    "Note: The platelet count in the packed red cell fraction is 13 ±5 x 103 per µl (mean ±SD, n = 12) on average in our hands.\nBlood Reconstitution\n\t\nThaw blood group AB (Rhesus D negative) plasma at 37 °C for 5 min and 20 sec per 4 ml.\nDetermine the hematocrit of the packed red blood cells prepared in 2.1.5 using an automated hematology analyzer.\nDetermine the platelet concentration in the blood bank prepared platelet concentrate that will be used to reconstitute the red cell fraction above.\nCalculate the volume of packed red blood cells and platelet concentrate that will yield 40% hematocrit and 250 x 10³ platelets/µl in a 1 ml sample.\n\t\tNote: Other target titers of cells can be set arbitrarily, depending on the study protocol.\nTransfer packed red blood cells and plasma into a fresh tube using a clipped pipet tip and add platelet concentrate until a sample volume of 1 ml is reached.\n\t\tNote: Depending on the variables studied, the plasma fraction should be equal in all reconstituted samples because plasma has a significant influence on thrombus formation rate. For instance, repeated freeze-thawing or plasma taken from different donors or on different anticoagulants may influence the result.\nMix the reconstituted blood gently by inverting and perform a CBC.\nPrepare a \"blank\" control sample in which the volume of platelet fraction is replaced by the same volume of 0.9% (m/v) sodium chloride in water to determine the concentration of endogenous platelets (i.e. non-blood bank platelets) in the reconstituted blood using a CBC.\nLabeling\n\t\nPipet 1 ml reconstituted blood in a test tube containing 1 µl 5 mM Calcein AM (5 µM final concentration).\n\t\tNote: Other cell dyes can be used14.\nMix gently by inverting.\nIncubate for 5 min at 37 °C prior to use.",
    "3. Perfusion Assay\nFocus the objective on the collagen fibers adhered at the bottom of the lanes. Ideally, use phase-contrast or differential interference contrast (DIC) settings for this focusing strategy. Select ‘Set current Z for selected tile regions’ in the experiment software to digitally fix the selected Z-positions.\nSelect a region of interest (ROI) in the lane (xy) in the experiment software of the microscope that will be recorded during the experiment.\n\tNote: The ROI can be any surface area arbitrarily chosen within a perfusion lane. It is advisable not to analyze thrombus formation close to the in- and outlet of a lane so to avoid side effects of the variable flow profile in that region, even though this is relatively small. The ROI surface area should contain a significant number of platelets or thrombi to allow leveling of the signal. In this protocol the ROI is a digitally stitched aggregate of three equally sized side-by-side images resulting in 0.62 mm2 in the middle of the 2 cm long lane.\nMix the samples gently by inverting and position these next to the biochip on the automated stage.\nPlace the tubing that is connected with the inlet of the biochip in the test tubes containing the reconstituted blood samples.\nLaunch the pump at 50 dyne/cm2 (or other shear stresses as desired) for those channels linked to test tubes containing the reconstituted blood samples using the software of the pump.\n\tNote: Other shear stresses can be used.\nRecord images every 15 sec for 5 min in real-time using the acquisition and experiment software of the microscope.\n\tNote: Other time series can be used depending on the experimental set-up.\n\tNote: We generally use a 100X magnification (10X objective and 10X lenses), but higher (or lower) magnification can easily be used as an alternative.",
    "4. Wash Out\nWash out all tubing attached to the outlet and connected to the multichannel manifold or pump using distilled water, followed by sodium hypochlorite (bleach) 0.5% (v/v) and finally 0.1 M NaOH in water. Discard the tubing pinned to the biochip inlet as hazardous waste.\n5. Data Analysis\nDetermine thrombus growth kinetics with the image analysis software. The following commands are specific for ZEN2012.\n\t\nOpen the plugin Image Analysis to determine the surface coverage of the platelets.\nSet the fluorescence threshold in the Analyze Interactive tab to define the pixel intensity that correlates with a positive signal, i.e. an adhered platelet or adhering platelets.\nUse Create Tables to automatically generate a spreadsheet that will contain the separate surface areas (in µm2) of those \"objects\" containing pixels with a signal between the selected thresholds. This is performed for each time point.\n\t\tNote: Once fluorescence thresholds have been chose, the analysis software automatically detects 'objects' in the view field that fulfill the criteria. These objects are thrombi, small platelet aggregates or single platelets and cover a number of pixels. Every object is listed in the spreadsheet separately.\nSave these spreadsheets in xml format and open them in a spreadsheet program for further calculations.\nTotal the surface areas of the selected objects by summation and divide the result by the total area of the measurement field (µm2). This will yield the relative surface coverage (%). Do so for every time point.\nPlot these surface coverages in function of the perfusion time and calculate the slope by linear regression, yielding the thrombus growth kinetic of that particular condition.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}