{
  "id": 2585,
  "origin_website": "Cell",
  "title": "Generation of cell-type-specific proteomes of neurodevelopment from human cerebral organoids",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nOrganoid dissociation\nTiming: 2 h\nThis section describes a step-by-step protocol for the enzymatic dissociation of cerebral organoids into a single cell suspension for downstream analysis. The exact timepoint to take organoids out of the culture will depend on the expression levels of the peptides of interest. In our work, we have used cerebral organoids that were 4–8 weeks old (Melliou et al., 2022[href=https://www.wicell.org#bib8]). However, we have tested our protocol for organoid cultures up to 10 weeks old. Interestingly, we found that the DCX positive compartment show more dynamic temporal changes than the SOX2 positive populations across the collected 2-week intervals. This observation will vary according to the cell biology of the specific population/marker chosen.\nTransfer the cerebral organoids from the 6-well plate used for culturing to a 5 mL falcon tube, separated by condition.\nCritical: Only healthy organoids should be used for organoid dissociation and further analysis. Ensure that hESCs show healthy stem cell morphology and are 70%–80% confluent before seeding. In addition, observe cultures regularly under light microscope and monitor the growth and development of cerebral organoids after every critical step (embryoid body formation, neuroepithelium induction, organoid formation, etc.) as it is previously discussed in (Lancaster and Knoblich, 2014[href=https://www.wicell.org#bib6]), (Figure 1[href=https://www.wicell.org#fig1]). Although, cerebral organoids can be variable within and between the batches, proper formation is necessary in order to better investigate their molecular proteomic patterns in a reproducible manner (Problem 1[href=https://www.wicell.org#sec7.1]).\nNote: This step should be performed using a cut 1,000 μL tip, to avoid disruption of the organoid.\nNote: You can use 5–7 organoids per falcon tube, depending on their size and age. In our experience, organoids growing for more than 10 weeks are harder to dissociate with the conditions described in this section (Problem 2[href=https://www.wicell.org#sec7.3]).",
    "Remove excess medium from each tube and wash with cold PBS (1×) three times.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2086-Fig1.jpg\nFigure 1. Proper formation and differentiation of cerebral organoids\nExamples of appropriate and poor cultures at different stages.\n(A) Brightfield image of a healthy (top) and unhealthy (bottom) hESC colony prior to seeding. The scale bar represents 460 μm.\n(B) Brightfield image of successful (top) and failed (bottom) formation of embryoid body 5 days after plating into single cell suspension. The scale bar represents 180 μm and 360 μm respectively.\n(C) Brightfield image demonstrating an example of an acceptable organoid (top) for further analysis, and a failed organoid, that lacked to produce neuroepithelium and showed large fluid cysts structures (bottom). The scale bar represents 960 μm.\nNote: Using cold PBS serves as an effective way not only to remove traces of culture medium, but also to mechanically remove the extracellular matrix (Matrigel) that surrounds cerebral organoids and reduces peptide degradation. Remaining matrix may interfere with peptide extraction and LC-MS/MS. Thus, cerebral organoids are advised to be washed with ice-cold PBS until no visible matrix remains (normally 2–3 times).\nAlternatives: Other experimental approaches to eliminate interference of Matrigel contaminants efficiently can be used for proteomic sample preparation of organoids (Wang et al., 2022[href=https://www.wicell.org#bib11]).\nRemove PBS and add 1 mL TrypLE in each tube. Place all the tubes in a 360° rotating shaker for 30 min and incubate at 37°C with 5% CO2.\nUsing a 1,000 μL tip, pipette up and down vigorously to break the cerebral organoid in cell clumps and individual cells.\nIncubate for another 15 min.\nNote: The incubation time with TrypLE varies and depends on the age and complexity of the organoid cultures (Problem 2[href=https://www.wicell.org#sec7.3]). Alternative enzymes or commercially available dissociation kits with similar features should be suitable after optimization.",
    "Add 2 mL of FACS buffer, containing PBS/FBS 98/2 (v/v) to stop the enzymatic reaction and pipette up and down to break down the last clumps with a 1,000 μL pipette tip.\nSpin down the tubes (5 min in 200 × g at room temperature; 20°C–23°C). Resuspend the cell pellet in 1 mL of FACS buffer.\nTo remove remaining cell aggregates and non-dissociated tissue, pass the cell suspension through a 37 μm strainer.\nMoisture the strainer with 200 μL of FACS buffer before loading the cell suspension.\nAspirate the resuspended cells in FACS buffer and dispense it over the top of the strainer and into the flow tube.\nNote: It is important to add the solution in parts and push down on the mesh strainer slowly so you won’t damage the strainer. It is also advised to tap and slowly pipette if needed before adding more of the solution.\nPerform a viable cell count using trypan blue.\nNote: To proceed with downstream analysis, it’s advised to have more than 80% viability in all cell samples (Problem 3[href=https://www.wicell.org#sec7.5]).\nCell sorting and lysis\nTiming: 1 h/sample\nThese next steps describe how to set the compensation parameters and appropriate gates for multicolor FACS to isolate the cerebral organoid–derived cells by cell type (neurons and neural progenitors) based on their fluorescent reporters. In addition, we describe the subsequent lysis with 8 M urea for the downstream proteomic analysis.\nUse unstained organoids as a negative control to determine optimal settings for gating and discerning positive from negative cells.\nNote: Unstained control samples should be processed exactly as the stained ones, using the protocol described in the previous section.\nAdd a viability dye (such as DAPI, 1:100) in all samples, including the controls, to separate live from dead cells during cell sorting.",
    "Note: The use of a viability marker is important since it could reduce noise and improves separation of cell populations.\nFollow manufacturer instruction regarding use of cell sorters and sort the enriched (i.e., YFP+) and depleted (i.e., YFP-) populations. Certain parameters are also mentioned in Table 1[href=https://www.wicell.org#tbl1].\nAlternatives: Alternative tagged lines or fluorophores can be used to identify more than one cell population at a time. However, it is strongly recommended to optimize all the parameters and use all the necessary controls.\nCollect cells in 15 mL falcon tubes with sorting efficiency of 90% or higher (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2086-Fig2.jpg\nFigure 2. FACS analysis of single cells after dissociation using trypLE\nRepresentative sort layout from 500k events, showing data from cerebral organoids expressing YFP. Single cells were selected based on their side scatter (SSC) and forward scatter (FSC) (top row) and live single cells were further isolated from dead cells and debris based on DAPI fluorescence as indicated. Cells were further distinguished from non-fluorescent negative (YFP-) cells (bottom row).\nNote: The number of organoids required for fluorescence-activated cell sorting (FACS) must be determined based on the cell population(s) of interest; we recommend collecting >100,000 cells per sample for the downstream proteomic analysis (Problem 4[href=https://www.wicell.org#sec7.7]).\nWash samples.\nCentrifuge at 1,000 × g for 3 min at 4°C.\nRemove supernatant without disturbing the pellet and wash with cold PBS.\nCentrifuge at 1,000 × g for 3 min at 4°C (optional to spin supernatant as well).\nTransfer samples to Eppendorf tubes.\nCentrifuge at 1,000 × g for 10 min at 4°C.\nCell lysis.\nRemove supernatant.\nAdd around 200 μL of UREA lysis buffer.\nIncubate for 30 min in ice.\nSnap freeze in liquid nitrogen.",
    "Note: Upon cell lysis, urea is the preferred cell lysis reagent because of its low cost (compared to RapiGest) and its high compatibility for mass spectrometry workflows. Indeed, it has been previously shown that users are able to achieve higher protein yields using Urea compared to RIPA for cell lysis (Ngoka, 2008[href=https://www.wicell.org#bib10]).\nPause point: Samples can be frozen at −80°C until ready to continue with peptide extraction.\nPeptide extraction\nTiming: 2 days\nThis method describes peptide extraction of lysed and sorted cells derived from cerebral organoids.\nDefrost the samples on ice.\nSonicate the samples, using a water bath sonicator (Bioruptor Pico) at 4°C to allow complete cell disruption and lysis.\nNote: For this step we have followed a protocol with ultra-high (ultrasonic wave frequency 20–60 kHz), 30 s on, 30 s off for 30 min.\nCentrifuge at 12,000 × g for 15 min at 4°C and transfer the supernatant to a clean Eppendorf tube.\nNote: It is advised to keep the samples in ice at all times before proceeding with protein purification.\nQuantitate the total protein by sample by running a BCA assay as per manufacturer instructions[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0011430_Pierce_BCA_Protein_Asy_UG.pdf].\nNote: It is required to have a minimum of 12 μg of protein concentration per sample for further analysis.\nTop up the sample volumes to 100 μL with 50 mM ammonium bicarbonate.\nAdd 10 μL of 60 mM DTT in 50 mM ammonium bicarbonate for protein denaturation, to a final concentration of 6 mM.\nNote: This solution is prepared fresh immediately before use. For its preparation personal protective equipment and the use of fume hood is required.\nIncubate the samples on a thermoblock at 1,200 × g for 45 min at 45°C.",
    "Add 11 μL of 100 mM iodoacetamide in 50 mM of ammonium bicarbonate for protein alkylation, to a final concentration of 18 mM.\nCritical: Iodoacetamide is unstable and light sensitive. Thus, this solution is prepared fresh immediately before use, and it is advised to perform alkylation in the dark.\nIncubate the samples on a thermoblock at 1,200 × g for 45 min at room temperature in the dark.\nTrypsinize all samples by adding Trypsin/Lys-C Mix, Mass Spec Grade (1:25 protein ratio).\nIncubate the samples overnight (around 5–8 h in total) on a thermoblock at 1,200 × g at room temperature.\nDilute the samples with 13.8 μL of 10% trifluoroacetic acid (TFA) in 50 mM ammonium bicarbonate, for a final concentration of 1% (v/v).\nCritical: TFA is toxic and volatile. Therefore, use the fume hood when preparing the solution by adding the TFA first and then the ammonium bicarbonate.\nIncubate the samples on a thermoblock at 1,200 × g for 20 min at room temperature.\nCentrifuge at 13,000 × g for 10 min and transfer the supernatant to a clean Eppendorf tube.\nBy using Pierce C18 zip tip pipette tips, as per manufacturer instructions[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0011713_Pierce_C18_Tip_UG.pdf], the salts, lipids, DNA, and other contaminants are removed.\nElute the bound peptides with 3 μL of ACN/H2O 65/35 (v/v) + 0.1% TFA.\nDilute the samples in 42 μL with H2O + 0.1% TFA.\nProteomic analysis by LC-MS/MS\nTiming: 90 min per sample\nThis step describes sample data acquisition of trypsinized samples by LC-MS/MS analysis. The samples are analyzed using a Thermo Fisher nano liquid chromatography setup that was coupled to Q Exactive HFX (Thermo Fisher Scientific) mass spectrometer using a nanoelectrospray ionization source. The analytical parameters are stated previously in Table 2[href=https://www.wicell.org#tbl2].",
    "Prior to injection onto the liquid chromatography system, centrifuge samples at 3,500 × g for 10 min.\nInject samples onto LC-MS/MS system for analysis.\nNote: It is recommended to load a volume of 40 μL per sample, in order to have two technical replicates (18 μL per injection)."
  ],
  "subjectAreas": [
    "Cell Isolation",
    "Flow Cytometry",
    "Proteomics",
    "Mass Spectrometry",
    "Neuroscience",
    "Organoids"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}