{
  "id": 19631,
  "origin_website": "Jove",
  "title": "Dissipative Microgravimetry to Study the Binding Dynamics of the Phospholipid Binding Protein Annexin A2 to Solid-supported Lipid Bilayers Using a Quartz Resonator",
  "procedures": [
    "NOTE: Buffers should be filtered using a 0.22-µm filter and degassed by a vacuum for 1 h.\n1. Lipid Vesicle Preparation\nUse 2-mL glass tubes. Dissolve each lipid, 1,2-dioleoyl-sn-glycero-3-phosphocholine (DOPC), 1-palmitoyl-2-oleoyl-sn-glycero-3-phosphocholine (POPC), 1-palmitoyl-2-oleoyl-sn-glycero-3-phospho-L-serine (POPS), and cholesterol (Chol), in a mixture of chloroform/methanol (50:50 v/v) to prepare a clear 5 mM lipid solution. Dissolve 1,2-dioleoyl-sn-glycero-3-phospho-(1'-myo-inositol-4',5'-bisphosphate) (PI(4,5)P2) in a mixture of chloroform/methanol/water (20:9:1 v/v).\nCombine the dissolved lipids in the desired molar ratio of POPC/POPS (80/20), POPC/PI(4,5)P2 (95/5), POPC/POPS/Chol (60/20/20), POPC/POPS/PI(4,5)P2/Chol (60/17/3/20), and POPC/DOPC/POPS/PI(4,5)P2/Chol (37/20/20/3/20) (Table 1) in 10-mL glass tubes.\n\tNOTE: The final amount of total lipid is 500 µg.\nEvaporate the organic solvents using a dry stream of nitrogen. Leave the lipid mixture on a high vacuum (lyophilization) system for 3 h to remove any residual traces of the solvents.\n\tNOTE: This results in a dry clear film.\nResuspend the lipid film in 1 mL of citrate buffer (10 mM trisodium-citrate, 150 mM NaCl, pH 4.6). Incubate the lipid suspension at 60 °C (this temperature is around 10 °C above the phase transition temperature of the highest melting lipid in the mixture) for 30 min in a water bath, and vortex it vigorously every 5 min.\n\tNOTE: This results in the formation of large, multilamellar vesicles (MLVs). Keep the suspension above the transition temperature.\nPreheat the extruder (at 60 °C in this case) equipped with a 50-nm diameter pore-size polycarbonate membrane above the transition temperature (which is 40 - 50 °C here) for 30 min.\nLoad the MLV suspension into the preheated extruder and gently pass the mixture 31x through the polycarbonate membrane to form small unilamellar vesicles (SUVs)14. Keep the temperature above the transition temperature.",
    "Transfer the SUV suspension to a 2 mL plastic reaction vessel and add the citrate buffer (see step 1.4) to bring the final volume to 2 mL.\n\tNOTE: This will yield a final lipid concentration of 250 µg/mL.\n2. Handling the Quartz Sensors\nNOTE: Always handle the quartz sensors with a tweezer.\nIncubate four sensors inserted in a polytetrafluoroethylene holder in a 2% SDS solution for ≥ 30 min. Wash them extensively with ultra-pure water to completely remove the SDS and let them dry using a stream of dry argon or nitrogen.\nUse a plasma-cleaning system to completely remove any contaminants. Insert the dry sensors in the plasma-cleaning chamber, evacuate the chamber, and flush it 3x with oxygen. Turn the plasma cleaner on. Use the following process parameters: 1 x 10-4 Torr pressure, high radio frequency (RF) power, and 10 min of process time. Turn off the machine and take out the sensors.\n3. Microbalance Operation\nNOTE: A microbalance system with four temperature-controlled flow chambers in a parallel configuration, connected to a peristaltic pump and set to a flow rate of 80 µL/min, was used. In the open flow mode, the buffer was pumped from the feeder reservoir into the receiving tank. In the loop mode, the receiving tank was connected with the feeder reservoir to generate a closed loop. The temperature was set to 20 °C.\nCarefully dock the plasma-cleaned sensors into the 4 flow chambers, using tweezers. Avoid any pressure on or torsion of the chambers and the tubes that might cause leaking.\nFlush the system with citrate buffer (10 mM trisodium-citrate, 150 mM NaCl, pH 4.6) in the open-flow mode for 10 min.\n\tNOTE: This requires exactly 3.2 mL of buffer, but it is advisable to use an excess of buffer (10 mL).",
    "Launch the program. Start recording any changes in the frequency and dissipation of the first fundamental tone (n = 1st) and overtones (n = 3rd - 13th) using the software, until the frequency and dissipation baselines are stable (this will take around 40 - 60 min).\n\tNOTE: Frequency noise levels (peak-to-peak) should be lower than 0.5 Hz and, for the dissipation, lower than 0.1·10-6, with a maximal drift (in aqueous solution) of 1 Hz/h in frequency and 0.3·10-6/h in dissipation.\nWhen the baselines are stable, apply the SUV suspension in citrate buffer (2 mL in a small tube). Using a reaction vessel, remove 1.5 mL of the dead volume. Then close the system in the loop-flow mode. Record the frequency/dissipation shift for another 10 minutes.\n\tNOTE: During this time, the vesicles will spread onto the SiO2 surface and fuse to form a continuous bilayer15,16 (step 2 in Figures 1, Figure 2, and Figure 3). The SUVs adsorption on the surface of the sensor is two-phasic and has a typical frequency minimum and maximum in the dissipation. A stable new frequency/dissipation baseline with a characteristic frequency shift (depending on the lipid composition) from 26 - 29 Hz (see Table 1) indicates a continuous bilayer on the surface.\nWhen the SLB is stable (see step 3.4), equilibrate the system with the running buffer (10 mM HEPES, 150 mM NaCl, pH 7.4) at the required Ca2+ concentrations (ranging from 50 µM up to 1 mM CaCl2, depending on the experiment) in an open flow mode for 40 min.\nAdd the protein (here, AnxA2) to the running buffer containing Ca2+ (see step 3.5). Perform the application of the protein in a loop-flow mode until an equilibrium steady state is reached (step 3 in Figure 1, Figure 2, and Figure 3).",
    "NOTE: The protein concentration may range from 1 to 400 nM. Protein adsorption results in a concentration-dependent frequency shift reflecting the mass (protein) adsorption.\nDissociate the bound protein by chelating Ca2+ ions with 5 mM EGTA in the running buffer in open flow mode (step 4 in Figures 1 and Figure 2).\n\tNOTE: A recovery of the frequency and dissipation to the SLB baseline indicates a total reversibility of protein binding. Association-dissociation cycles can be repeated to compare different concentrations or proteins.\n4. Microbalance Cleaning\nNOTE: Perform a minimal cleaning procedure after each measurement.\nRegenerate the microbalance system with 50 mL of ddH2O in a continuous open flow mode, remove the tubes from the water container, and let the system run dry.\nCarefully remove the crystal sensor and clean it with the 2% SDS solution using the polytetrafluoroethylene holder (see step 2.1).\nDry the visible parts of the flow module interior where the sensor was placed.\n\tNOTE: Perform an intensive cleaning procedure after a series of 10 measurements.\nClean the system with a 2% SDS solution (50 mL) at 40 °C (setup in the software) in a continuous open flow (tube) mode, using a flow rate of 20 µL/min for extended contact with the detergent.\nClean with 250 mL of ddH2O in continuous open flow mode at a flow rate of 160 µL/min.\n\tNOTE: After 4 months, carry out an extensive cleaning procedure according to the manufacturer's manual."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}