{
  "id": 6836,
  "origin_website": "Bio",
  "title": "Rapid Generation of Human Neuronal Cell Models Enabling Inducible Expression of Proteins-of-interest for Functional Studies",
  "procedures": [
    "The protocol is designed to enable the generation of neural cell models for functional analyses of proteins-of-interest in less than a month (Figure 2). The system is scalable by parallelization of procedures.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200428/20200428004431_4592.jpgFigure 2. Time-line for the execution of procedures described in this protocol. All steps described in the protocol take approximately one month to implement. The generation of vectors coding for the inducible expression of a protein-of-interest can be completed in approximately one week. Once positive clones have been selected and validated, cell-based and biochemical analyses can be undertaken in parallel. Naturally, the one-month timeline will be exceeded, if complex follow-on downstream analyses are planned.Week 1. Cloning a gene of interest into the IEXNotes:Cloning strategies can be simulated, verified, and visualized using Snapgene and Snapgene Viewer. The coding sequence (CDS) of a new protein-of-interest can be cloned into the IEX using the unique restriction enzyme sites BbvCI and KpnI: BbvCI: located 5’ of the start codon of new CDS. KpnI: present in the linker region connecting EGFP to the C-terminus of the new protein. Multiple other unique restriction enzyme sites (e.g., NheI, BstBI, KflI, etc.) may also be used. Order primers to append BbvCI and KpnI restriction enzyme sites to the 5’ and 3’ ends of the CDS of the protein-of-interest, respectively.Example:table:\n﻿0,1\nPrimer name,Sequence\nInsert BbvCI site 5′…CCV TCAGC…3′,5′ N8CCTCAGCGCCACCATGX20-25 3′\nInsert KpnI site 5′…GGTAV CC…3′,5′ N8GGTACCX20-25 3′",
    "N8 represent 8 random nucleotides to serve as overhangs required by restriction enzymes for efficient digestion.X20-25 represent sequences of the CDS of the protein-of-interest.Blue: Kozak sequence, including the ATG start codon, required for translation.Do not include a stop codon in the X20-25 sequence used for designing the ‘Insert KpnI’ primer if the new protein is to be expressed as an EGFP fusion protein.Determine the annealing temperature of primers using the New England Biolabs Tm Calculator tool, which returns this information when primer sequences are entered into the online form field at: https://tmcalculator.neb.com/#!/main[href=https://tmcalculator.neb.com/#!/main].Day 1. Cloning Perform PCR to append BbvCI and KpnI sites to CDS of protein-of-interest using the following PCR reaction:table:\n﻿0,1,2\nReagents,50 μl reaction (µl),Final concentration\nQ5 HiFi Hot start master mix (2x),25,1x\nTemplate DNA (20 ng),Calculate,\n‘Insert BbvCI’ primer (10 μM),2.5,0.5 µM\n‘Insert KpnI’ primer (10 μM),2.5,0.5 µM\nNuclease-free H2O,Add to 50,\nTotal,50,\nPerform the following PCR cycles:table:\n﻿0,1,2,3\n,Step,Temperature (°C),Time\n,Initial denaturation,98,30 s\n,Denaturation,98,10 s\n30 cycles,Annealing,To be determined,30 s\n,Extension,72,10-20 s/kb\n,Final extension,72,2 min\n,Hold,4,Until sample storage\nProceed to PCR purification per manufacturer’s protocol. Measure DNA concentration on NanoDrop 1000 as per the manufacturer’s protocol. Set up restriction digest of IEX vector and new CDS insert using the following reactions:table:\n﻿0,1,2\nReagents,IEX vector,New CDS insert\nBbvCI,4 µl,4 µl\nKpnI,4 µl,4 µl\nCutSmart buffer (10x),5 µl,5 µl\nAlkaline phosphatase,1 µl,--\nDNA,Up to 5 µg,Up to 5 µg\nNuclease-free H2O,Add to 50 µl,Add to 50 µl\nTotal,50 µl,50 µl",
    "Incubate at 37 °C for 1 h.During incubation, cast a 1% agarose gel to be used for isolating the digested products.Undertake gel electrophoresis with the entire volume of the restriction digest mixture.Troubleshoot: it is advised to include a sample of the uncut and singly-cut IEX vector as controls.Excise the doubly digested IEX vector (7.0 kb) and new CDS insert.Proceed to gel extraction purification per manufacturer’s protocol. Measure DNA concentration.Day 1. Ligation of new CDS insert into doubly digested IEX vector Determine the appropriate vector: insert mass ratios to achieve an approximate 1:1 molar ratio. This task can be simplified by using online algorithms, including the NEBioCalculator tool (version 1.10.0; https://nebiocalculator.neb.com/#!/ligation[href=https://nebiocalculator.neb.com/#!/ligation]).Set up the following ligation reactions:table:\n﻿0,1,2\nReagents,Vector-only control (µl),Vector + Insert (µl)\nT4 DNA ligation buffer (10x),2,2\nT4 DNA ligase,2,2\nVector (100 ng),Calculate,Calculate\n\"Insert (x ng, depends on ratio)\",--,Calculate\nNuclease-free H2O,Add to 20,Add to 20\nTotal,20,20",
    "Incubate at room temperature for 15 min.Proceed to bacterial transformation per manufacturer’s protocol.Plate bacteria on agar plates with 100 µg/ml ampicillin (the same concentration is used for all applications involving ampicillin), incubate plates upside down at 30 °C overnight.Endura chemically competent cells are used to minimize truncation of complex plasmids at 30 °C growth temperature on agar. Agar plates are incubated upside down to reduce evaporation of moisture from the agar during overnight incubations.Day 2. Pick transformant colonies Compare the number of colonies on the ‘vector-only’ control plate, which should have none to very few colonies, and the ‘vector plus insert’ plate, which should have many colonies.Pick 6-10 colonies from the ‘vector plus insert’ plate to grow in 3 ml of LB medium with ampicillin with shaking at 225 rpm overnight at 37 °C.Day 3. Extract DNA for sequencing Save 500 µl of the overnight bacteria culture as a glycerol stock.Extract the DNA from the remaining bacteria culture by the miniprep method as per manufacturer’s protocol.Measure the DNA concentration and send the purified DNA plasmid for sequencing.If additional site-directed mutagenesis is required, perform the reaction using the Q5® Site-directed mutagenesis kit according to manufacturer’s protocol.Days 4-5. Maxiprep new IEX and iCre vectors for transfection Use the bacteria stock with the correct sequencing result to grow in a 125-250 ml culture with ampicillin, then undertake a DNA maxiprep following manufacturer instructions.Note: It is important to use a maxiprep kit that removes endotoxins from the bacteria to minimize undesired cellular toxicity during future transfections. At the same time, maxiprep the iCre vector for future transfections.Week 2. Generating inducible cells with new IEX vectorNext steps are designed to create inducible cells by co-transfection of the IEX vector and the iCre vector, followed by puromycin selection and confirmation of inducibility by doxycycline (Dox) treatment.",
    "Ahead of Day 8 Culture target cells in cell culture incubators at 37 °C, 95% moisture, and 5% CO2.Perform all protocols involving mammalian cells in certified biosafety cabinets to prevent contamination and adhere to biosafety rules and regulations.Passage at least once before transfection to check that cells are growing normally as they can be quite fragile after thawing. See ‘Auxiliary information–Cell culture’ section for instructions on regular cell culture, passaging, and saving stocks.Determine the appropriate puromycin concentration to use for selection for each cell line by treating cells at various concentrations (e.g., 0.0, 0.2, 0.5, 1.0, 2.0, 5.0, and 10 µg/ml) of puromycin and selecting the lowest concentration that kills 100% of cells in 3 days.Day 8. Plate cells for transfection Plate all cells in media without antibiotics or antimycotics.For ReN VM cells, plate ~135,000 cells/well on Matrigel-coated 12-well plates in proliferation media without heparin. Cells should be ~50% confluent the next day.For cells that do not need to be plated on coated cell culture dishes, plate ~350,000 cells/well on 6-well plates with the expectation that they are ~80% confluent the next day.Set 1-2 wells aside as controls for effective puromycin selection; they will not be transfected.Day 9. Transfection Transfect cells using a ratio of 1 iCre vector: 4 IEX vectors with desired insert.A ratio of 1 iCre vector: 1-3 IEX vectors have also worked.For ReN VM cells, use a total of 1.0 μg of DNA with 1 µl of TransfeX transfection reagent per well following manufacturer’s instructions.Use proliferation media without heparin during the transfection because heparin may compromise effectiveness.For most other cells, use a total of 3 µg of DNA with jetPrime transfection reagent per well following manufacturer’s instructions.For IMR-32 cells, use a ratio of 1 µg DNA:3 µl jetPrime.",
    "For HEK-293 cells, use a ratio of 1 µg DNA:2 µl jetPrime.To minimize toxicity change media 4 h after transfection to regular proliferation media.Week 3. Puromycin selection and Dox treatmentPassage transfected cells onto a few larger plates and add the appropriate amount of puromycin and 2.0 µg/ml of Dox.One may check for induction levels 24 h post Dox addition on a fluorescence microscope.Continue puromycin selection until all cells in the control wells have died.Note: It is recommended to refresh puromycin and Dox every other day to keep the inducible transgene transcriptionally active. Allow surviving cells to proliferate to sizable colonies of > 100 cells/colony.Induce cells with 2.0 µg/ml Dox; check on the fluorescence microscope for successfully induced colonies.Caution: Induction in ReN VM cells may not be homogenous even within the same clone and may lose induction during the course of differentiation. This is because endogenous epigenetic silencing may cause variable and mosaic expression of inducible constructs (Chanda et al., 2017). Also, if differentiation is desired, induction of ReN VM cells and other neural progenitor cell lines may be improved by beginning induction 2-4 days during the proliferation stage before the start of differentiation. Mark and transfer selected colonies with desired level of induction to new wells. Expand them to save as stocks and to validate the inducibility and identity of the protein-of-interest by Western blot.If removal of the PuroR gene is desired, transfect cells with the ‘Flpo’ optimized Flippase vector.Select cells that have lost puromycin resistance by plating duplicates of the same cell clone, one of them puromycin treated the other left untreated.In ReN VM cells, retaining PuroR may help with keeping the inducible transgene region transcriptionally active.Week 4.",
    "Preparing inducible cells for mass spectrometry-based interactome studiesNote: The following steps are designed to capture EGFP-tagged inducible protein and its interactors using GFP nanotrap for downstream analysis in mass spectrometer.Culture inducible protein-of-interest-EGFP fusion cells in biological triplicates on 15-cm plates along with cells inducibly expressing EGFP only as a control against unspecific binding to the GFP nanotrap matrix.Note: If induced expression is very low, scale up accordingly. Induce cells for the desired length of time.Follow manufacturer’s protocol on using GFP nanotrap for affinity capture experiments.All procedures should be performed at 4 °C to prevent protein degradation.Cells may be lysed in RIPA buffer as per manufacturer’s protocol or buffer composed of 0.5% NP-40 and 0.25% DOC (Recipe 4).Remove cellular debris by centrifugation at 3,000 x g for 5 min at 4 °C.Due to its high binding capacity, 20 μl of GFP nanotrap bead slurry/biological replicate should be sufficient for mass spectrometry-based interactome studies.EGFP fusion proteins or EGFP alone may be captured on GFP nanotrap beads during 2 h incubations at 4 °C with continuous mixing with the lysate.Shorter nanotrap bead incubations of 5 min followed by light centrifugation may be sufficient to visualize the capture of EGFP fusion proteins.Centrifuge at 100 x g at 4 °C to collect agarose-conjugated GFP nanotrap beads and bait proteins.Wash beads 5 times in Wash buffer. Washing procedures should be done within 2 h to minimize loss of interactors.First 3 times in Washing buffer (Recipe 5). NaCl salt concentration of 150-500 mM can be used during these washing steps, depending on desired stringency.The last two washes should be 25 mM HEPES (pH 7.0) and 10 mM HEPES (pH 7.0). Tris-HCl must not be used.Elute in 0.2% trifluoroacetic acid with 20% acetonitrile in water (pH 1.9).",
    "Immediately save and flash freeze or pH neutralize a portion of the eluates (e.g., 25% of total) for downstream validation of bait protein complexes by Western blot.A delay in the collection of the eluate material dedicated to Western blot analysis can lead to precipitation of eluate proteins in the pH 1.9 environment, thereby compromising the Western blot analysis.Other special considerations:One may use BCA to adjust for equal protein content before affinity capture.Remember to save a fraction of the cellular lysates as ‘input’ and ‘unbound’ for Western blot analyses.Auxiliary informationCell culture After thawing cells at 37 °C, remove DMSO content from the cell stock by diluting the cell stock in 4 ml of proliferation media and centrifuging cells at 100 x g for 3 minutes at 25 °C. Remove the supernatant to retain only the cell pellet. DMSO may be toxic to cells in regular culture.Culture cells in the appropriate proliferation media for about one week to allow recovery from thawing.For ReN VM cells, do not include antibiotics or antimycotics in the proliferation media, as they will cause cell death.For ReN VM cells, please coat the tissue-culture plates with Matrigel according to the manufacturer’s protocol at least 2 h before seeding cells onto the plates. 2 h is needed for Matrigel to solidify at 37 °C in a humidified incubator.Passage cells regularly before they reach 90% confluency to prevent the adverse effects of overgrowing with the appropriate dissociation reagent. For ReN VM cells, use Accutase. For most other cell types, use trypsin.Remember to save a portion of the cells, especially valuable clones, as stocks and while using the rest for experiments or regular culture.For preserving cell stocks, resuspend cells in Cell Freezing Media in labelled cryovials.",
    "Transfer cells to -80 °C immediately and store at -80 °C for 1 day before transferring into liquid nitrogen for long term storage."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Biochemistry",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}