{
  "id": 9304,
  "origin_website": "Jove",
  "title": "Assessment of Morphine-induced Hyperalgesia and Analgesic Tolerance in Mice Using Thermal and Mechanical Nociceptive Modalities",
  "procedures": [
    "All experiments were carried out in strict accordance with the European guidelines for the care of laboratory animals (European Communities Council Directive 86/609/ECC) and the ethical guidelines for investigation of experimental pain in conscious animals13. Male C57BL6/N Tac mice (10 weeks, 25 - 30 g) were housed in an institutional animal facility with a care staff in charge of operating the facility in compliance with environmental standards. Animals were housed in groups (maximum five mice per cage) under a 12 hr / 12 hr light / dark cycle at a constant temperature (21 ± 1 °C) with free access to food and water. All experiments were performed at the same period of the day (10:00 am to 4:00 pm) using a cohort of 16 mice. Specific materials and equipment are indicated in the Materials table.\nA five-step procedure to monitor morphine induced-hyperalgesia and tolerance\nThe protocol is divided into five sequential steps (A-E) over a duration of 15 days Figure 1.\n1. Mice Handling (Step A; d-7 to d-5)\nHandle mice and habituate them to freely enter into the restrainer. This preliminary step reduces stress - thus minimizing any confusion with stress-induced analgesia - and allows the animals to be accustomed to the investigator, handling and manipulation into the mouse restrainer. Each mouse is gently handled for 5 min every day.\n2. Basal Nociceptive Response (Step B; d-4 to d-1)\nMeasure tail withdrawal latencies using the Tail Immersion Test (TIT):\n\t\nSet the thermostat to 48 °C.\nGently introduce the mouse into the restrainer. Dip the protruding 2/3 end of its tail into the water bath and start the chronometer.",
    "Stop the chronometer as soon as the mouse withdraws its tail from the hot water and record the latency time (in sec). In the absence of any nociceptive reaction, a 25 sec cut-off is used to prevent tissue damage.\nReplace the mouse in its cage and test the next one until the end of the series.\nRepeat the nociceptive response measurements two more times, taking measurements from the animals in the same order. The nociceptive response latency (sec) for each mouse is determined as the mean value for three successive determinations.\nMeasure mechanical responses using the Tail Pressure Test (TPT)\n\t\nGently introduce the mouse into the restrainer and position its tail under the conic tip of the analgesimeter.\nPress the foot-switch to apply uniformly increasing pressure onto the proximal part of the tail until the first nociceptive reaction (struggling, squeaking) occurs. At the moment the animal reacts, record the current force (in grams) that elicits the nociceptive response. In the absence of any reaction, a 600 g cut-off value is used to avoid tissue damage.\nRepeat this measure on the median and distal parts of the tail of the same mouse. An interval of at least 30 sec is observed between measures on a given mouse to avoid adaptation or stress bias. Replace the mouse in its cage and test the next animal until the end of the series (i.e. all mice are tested). The nociceptive value (grams) for each mouse is taken as the mean value for three measurements (i.e. proximal, median and distal parts of the tail of each animal).\nRepeat nociceptive testing (all the procedures outlined under step 2) on subsequent days, d-3 to d-1.\n3. Measurement of Morphine Analgesia (Step C; d0)",
    "Define the best combination of animals that allows the selection of two groups (n=8 per group) of mice with stable and comparable average nociceptive values, whichever nociceptive modality (TIT or TPT) is considered. This value will be taken as the basal nociceptive response of reference for future ‘Saline’ and ‘Morphine’ groups.\nMeasure the body weight of each animal.\nPrepare a morphine solution (0.5 mg morphine per ml) in sterile physiological saline (NaCl 0.9%) for subcutaneous administration (5 mg morphine per kg of animal’s body weight).\nMeasure the nociceptive response latency (taken as time point 0) for each mouse of both ‘Saline’ and ‘Morphine’ groups in the TIT (all steps under 2.1 above). Then measure nociception in the TPT (all steps under 2.2 above).\nInject subcutaneously morphine (typically 0.25 ml of a 0.5 mg/ml morphine solution per 25 g mouse weight) and saline (0.25 ml per 25 g mouse weight) to the ‘morphine’ and ‘saline’ groups, respectively.\nMeasure nociceptive values on the TIT and TPT (all procedures outlined above under steps 2.1 and 2.2, respectively) over a time-course (at 30 min interval) to assess morphine (5 mg/kg)-induced analgesia:\n\t\nAfter 30 min post-injection, measure the nociceptive response (single determination) for each mouse of the ‘Saline’ and ‘Morphine’ groups, using the TIT then the TPT.\nThen measure nociceptive response values (TIT and TPT) in all mice at time points (in hr): 1-1.5-2-2.5-3 and 3.5 post-injection.\n4. Chronic Morphine Treatment - Morphine-induced Hyperalgesia (Step D; d1 to d6)\nOn Day: d1\n\t\nMeasure nociceptive response values on the TIT and TPT as described above (steps 2.1 and 2.2). Carefully annotate withdrawal latencies and pressure limits for each animal.\nPrepare a fresh morphine solution as detailed in step 3.2.",
    "Inject subcutaneously morphine (5 mg/kg b.w.) to the entire ‘Morphine’ group and physiological saline (0.25 ml per 25 g mouse weight) to the ‘Saline’ group. Let the animals rest until the next day.\nOn Days: d2, d3, d4, d5 and d6 repeat the operations described under Section 4.1\n5. Evidence for Analgesic Tolerance (Step E; d7)\nEvaluate morphine-induced analgesia according to the time-course paradigm already detailed in Section 3.\n6. Data Acquisition and Statistical Analyses\nAssessment of Basal Nociceptive Response Values (Step B)\n\t\nCalculate for each day (over the d-4 to d-1 period) the mean ± SEM values (n=8) for basal nociceptive responses as afforded from TIT and TPT within the ‘Saline’ and ‘Morphine’ groups.\nPlot mean basal nociceptive values as a function of time (day) for both groups Figure 2.\nAnalysis of Morphine Analgesia Time-course at Days d0 (Step C) and d7 (Step E)\n\t\nCalculate, at each time point after morphine injection, the mean ± SEM values (n=8) for nociceptive responses as afforded from TIT (in sec) and TPT (in g) in each group.\nPlot mean nociceptive response values as a function of time for the ‘Saline’ and ‘Morphine’ groups at day 0 Figure 3 and day 7 Figure 5.\nDevelopment of Morphine-induced Hyperalgesia (Step D)\n\t\nCalculate for each day (over the d0-d7 treatment period) the mean ± SEM values (n=8) for basal nociceptive response values as afforded from TIT and TPT within the ‘Saline-treated’ and ‘Morphine-treated’ groups.\nPlot mean basal nociceptive response values as a function of time (day) for the ‘Saline-treated’ and ‘Morphine-treated’ groups Figure 4.\nEvidence for Analgesic Tolerance (Steps C and E)\n\t\nDetermine from the morphine time-course experiment performed at d0 Figure 3 the time value (or time range) required for morphine to induce a maximal analgesic response.",
    "Take this value (usually 30 min) as the reference time to estimate at d7 Figure 5 the nociception baseline value (saline-treated group) and the actual analgesic response (morphine-treated group) to acute morphine.\nNociceptive values taken at time point 30 min from morphine time-course experiments performed at d0 and d7 for the saline-treated and morphine-treated groups, are presented as histograms Figure 6.\nStatistics: Analyze data using one-way repeated measures ANOVA. The factors of variation were treatment (between subjects) and time (within subject). To check differences separately in each group, repeated measures ANOVA was performed. Comparisons between two groups were performed using unpaired t-test or paired t-test when appropriate.\nThe Level of Significance is Set at P<0.05. All Statistical Analyses are Carried out using the STATview Software."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}