{
  "id": 7169,
  "origin_website": "Bio",
  "title": "Imaging Microtubules <em>in vitro</em> at High Resolution while Preserving their Structure",
  "procedures": [
    "Flow chamber preparationNote: This procedure is adapted from Portran et al. (2013) and Leslie et al. (2013). Cover glasses are used to make both sides of the perfusion chambers. Cover glasses are handled with tweezers or by hand with non-powdered gloves on the edges when drying with airflow so as not to damage their surface by more than 1 cm. Glass cleaningImmerge the cover glasses in a clean glass staining dish (105 × 85 × 70 mm) filled with 200-250 ml acetone and sonicate for 30 min in sweep mode.Note: 6 cover glasses are required to make 10 flow chambers, but some glass breakage may occur during the procedure, so it is advisable to start with a little more cover glasses. Replace acetone and incubate for an additional 30 min with orbital shaking (80 rpm).Note: Acetone from the second bath can be recycled for the first bath of the next cleaning procedure. Incubate 15 min with ethanol and rinse 10 times with deionized filtered water.Incubate 2 h in prewarmed (60 °C) 2% (v/v) Hellmanex on an orbital shaker (80 rpm), then rinse 10 times with deionized filtered water.Sonicate 15 min in 1 M NaOH solution.Rinse 10 times with deionized filtered water.Sonicate 15 min in ethanol and rinse each coverslip 10 times in a large volume (2 × 2 L) of deionized filtered water.Dry the cover glasses with a clean air flow (nitrogen gas).Dispense the glasses into two clean, dry glass staining tray for activation and silanization (see the next step below).Note: 5 silane-PEG-biotin-coated glasses and 1 silane-PEG-coated glass are used to prepare 10 perfusion chambers (see below paragraph 3). Glasses activation and silanizationPlasma activate the glasses for 3 min at 80% of maximum power at a pressure of 0.7 mbar.",
    "Rapidly immerge the glasses in either silane-PEG-biotin or silane-PEG solutions and incubate overnight on an orbital shaker.Note: Identify the glass staining dishes containing either silane-PEG-biotin or silane-PEG to avoid mistakes. Recover the coating solutions (they can be reused for several months as long as they remain clean) and replace them with ethanol (Figure 1A).Wash each coating slide 10 times in a beaker containing ethanol (Figure 1B) and 10 times in a large volume (2 × 2 L) of water (Figure 1C, 1D).Note: We recommend to wash first the silane-PEG slides then the silane-PEG-biotin ones to avoid potential silane-PEG-biotin binding to silane-PEG slides. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3968/bioprotoc-11-07-3968-g001.jpgFigure 1. Washing of coated slides. In A we have coated slides in ethanol. B contains ethanol. C and D contain deionized filtered water. E containing deionized filtered water is used to keep rinsed slides before drying.Dry the coverglasses with a stream of nitrogen.Store the silanized lamellae at 4 °C in a plastic box sealed with plastic film for a maximum of one week.Construction of the flow chamberNote: When handling the silanized cover glasses, make sure that the face inside the chamber remains clean and un-touched. Transfer 1 silane-PEG-biotin-coated slide to a clean Petri dish and, using the diamond pencil, cut the glass into four parts (approx. 19/26 mm) (Figures 2A, 2B).Note: When cutting with the diamond pencil, the Petri dish bottom bends leading to slide breaking. To avoid this, we use a thin plastic that we put under the Petri dish (Figure 2A). Similarly, transfer the silane-PEG-coated slide to another Petri dish and cut them into 7 parts of about 11 mm width. Discard the two end parts and cut the others in half to make fourteen 11 × 13 mm pieces (Figures 2C, 2D).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3968/bioprotoc-11-07-3968-g002.jpgFigure 2. Cutting coated slides. A.",
    "From left to right, diamond pencil, plastic to avoid breaking, Petri dish containing silane-PEG-biotin slide, tweezers. B. The slide is cut in four equal parts. C. A silane-PEG slide is cut in 7 parts. D. Each part is cut in half.Place two pieces of double-sided adhesive tape, 5 mm apart, in the center of a piece of silane-PEG-biotin coated coverslips (Figure 3A).Tape one piece of PEG-silane-coated strips above the two pieces of tape (the volume of the chamber is about 5 µl) (Figure 3B).Note: Carefully press the silane-PEG-coated strip on the tape to ensure correct sealing. You might gently remove excess tape (Figure 3D). imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3968/bioprotoc-11-07-3968-g003.jpgFigure 3. Construction of the flow chamber. A. One piece of silane-PEG-biotin is put in a Petri dish. B. Adhesive tape is stuck to the slide. C. Protective plastic above the tape is removed and one piece of silane-PEG slide is placed onto the tape. D. Excessive tape is cut and removed.Preparation of GMPCCP seedsNote: GMPCPP seeds tend to depolymerize at low temperatures, try to keep them warm all along the procedure. Prepare a mix of freshly thawed ATTO-565 tubulin and biotinylated tubulin at a 1:1 molar ratio for a final concentration of 10 µM tubulin in BRB80 supplemented with 0.5 mM GMPCPP.Note: Usually, 300 µl of seeds are necessary for at least 500 experiments. The mix is placed at 35 °C in a water-bath during 1 h to allow polymerization.Spin down the GMPCPP seeds at 130,000 × g using a TLA 100 rotor during 5 min at 35 °C.Discard supernatant and gently rinse with 2 × 100 µl of prewarmed BRB80.Note: After the centrifugation, the red seeds are visible in the pellet. Avoid resuspending the pellet during washing steps. Gently resuspend the pellet in prewarmed BRB80 containing 1 mM GMPCPP.",
    "Note: Resuspending might take some time. For 300 µl of polymerization solution, resuspend the pellet in 500 µl. Aliquot by 1-2 µl in 0.5 ml Eppendorf and quickly freeze in liquid nitrogen.Store in liquid nitrogen up to one year.Microtubule polymerization and fixationNote: The perfusion is performed by loading the solution into one side of the chamber while wiping the other side with a piece of paper (Figure 4). imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3968/bioprotoc-11-07-3968-g004.jpgFigure 4. Perfusion in flow chamber. From A to D are sequential images of perfusion of the desired solution into the flow chamber.GMPCPP seeds immobilization in the flow chamberPerfuse 10 µl of Neutravidin (25 µg/ml in 1% (w/v) BSA/BRB80) in the flow chamber and wait for 2 min.Perfuse 30 µl of PLL-PEG (0.1 mg/ml in 10 mM HEPES, pH 7.4) and wait for 30 s.Wash by perfusing 60 µl of 1% (w/v) pluronic in 1% (w/v) BSA/BRB80.Wash by perfusing 2 times with 70 µl 1% (w/v) BSA/BRB80.Quickly thaw GMPCPP seeds and dilute in 1% (w/v) BSA/BRB80.Note: Adjust seeds dilution if needed, usually start with a 1/100 to 1/500 dilution. Perfuse 30 µl of diluted GMPCPP seeds and let them adhere for 5 min at RT.Wash unbound seeds 3 times with 70 µl 1% (w/v) BSA/BRB80.Microtubule polymerization and fixationPerfuse freshly prepared polymerization mix (Recipe 19).Note: Adjust tubulin/associated proteins concentration if needed. It depends on the affinity and effects of the associated proteins of interest. For tubulin, a concentration of 5 to 20 µM is a good start and for associated proteins from 5 nM to 500 nM should be informative. Put the flow chamber in a warm (32-35 °C) place with a water-saturated atmosphere to avoid desiccation for MT polymerization (usually at least 30 min).After polymerization, fix MTs by gently perfusing approximately 30 µl of 0.1% Methyl cellulose 1,500 cP, 0.",
    "5% (v/v) Glutaraldehyde/BRB80.Note: Critical step, fast perfusion will alter MT structure. Put the chamber inside a Petri dish (you might use tape to prevent it from moving). Then, slightly tilt the Petri dish and add drop by drop the fixing buffer at the top of the chamber. The solution will slowly flow down the chamber. You can use blotting paper to clean excess liquid. The fixation buffer should be at least 3 min inside the chamber for proper fixation. Even if the fixation occurs rapidly, dilution might induce MT depolymerization. To overcome this issue, use MT stabilizing compounds such as taxol (taxol affects MT persistence length) or grow MT longer. Wash fixation buffer with 50 µl of 0.1% (v/v) Methyl cellulose 1,500 cP/BRB80.Perfuse imaging buffer (BRB80 supplemented with 0.1% Methyl cellulose 1,500 cP, 2 mg/ml glucose, 1mg/ml glucose oxidase and 150 µg/ml catalase).Seal the flow chamber with the siligum wax.Note: Imaging of the chambers should be done within one week. Imaging of the microtubulesControl fixation: TIRF MicroscopyNote: To estimate the effect of the fixation process on the sample, it is necessary to compare the sample before/after fixation. Place the flow chamber on the inverted microscope.Note: For imaging before fixation, set the temperature of the stage at 35 °C to avoid MT depolymerization. Adjust laser intensity, exposure and focus in order to observe the microtubules.Acquire images both before (Figure 5A) and after fixation (Figure 5B) of the sample.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3968/bioprotoc-11-07-3968-g005.jpgFigure 5. Structure of helical microtubules is not altered by the fixation process. TIRFM image of a helical MT before (A) and after (B) fixation. MTs were grown from GMPCPP seeds with 12 µM tubulin (9:1 non-labeled tubulin:ATTO-565 labelled tubulin) with 200 nM MAP6-N-GFP. At this concentration, MAP6-N-GFP induces microtubule coiling. Scale bar: 5 µm.",
    "Confocal imaging with Airyscan processingPlace the chamber above the objective.Adjust focus and laser intensity in order to observe MTs.Perform acquisition (z-stack series using 220 nm step-size).Use Zen built-in Airyscan processing. See Figure 6 for TIRF versus confocal imaging with Airyscan processing of helical MT. Figure 7 shows the advantage of performing z-stacks on MTs with a particular shape.Analyse images using Zen Blue.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3968/bioprotoc-11-07-3968-g006.jpgFigure 6. Observation of helical MTs with TIRFM or confocal Airyscan. MTs were grown as in Figure 5 and fixed using the described protocol. A. Fixed helical MTs observed using TIRF microscopy. B. z-projection of a fixed helical MT observed using confocal microscope followed by Airyscan processing. Scale bar: 5 µm.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3968/bioprotoc-11-07-3968-g007.jpgFigure 7. z-stack of a helical MT observed using confocal imaging with Airyscan processing. Images of the z-stack of the same MT as in Figure 6B, with a step of 220 nm between each plane. Scale bar: 5 µm."
  ],
  "subjectAreas": [
    "Biochemistry",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}