{
  "id": 7452,
  "origin_website": "Bio",
  "title": "Copper Based Site-directed Spin Labeling of Proteins for Use in Pulsed and Continuous Wave EPR Spectroscopy",
  "procedures": [
    "All solutions are made in deionized water unless otherwise stated. Any pH adjustments were done using 1 M HCl or 1 M NaOH solutions. Practically, we have found that a variety of buffers, such as phosphate, HEPES (4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid), MOPS (3-(N-morpholino)propanesulfonic acid), and NEM (N-ethylmorpholine) buffers can be used. However, the use of Tris buffer degrades labeling. Of the buffers listed above, MOPS allowed for the highest Cu(II)NTA labeling efficiency (Gamble      Jarvi et al., 2020a). Therefore, all experiments described here were done in MOPS buffer. Nonetheless, the differences between most buffers are small, so another buffer may be used if it is imperative for the system. In addition, the protocol provides conditions for labeling at pH = 7.4, but the labeling is tolerant to pH between 6.4 and 8.4, and the presence of competing ions such as Zn(II)NTA (Wort et al., 2021b). The step-by-step EPR spectrometer protocol is available elsewhere (Vicino et al., 2021), as well as in the Bruker manual that comes with the EPR spectrometer. Therefore, we provide parameters and steps specific for Cu(II) in the following protocol. The EPR experiments discussed use relevant parameters for X-band frequencies (roughly 9.8 GHz). While each individual EPR experiment should be completed in one sitting, the CW-EPR, 3-pulsed ESEEM, and DEER do not have to be performed back-to-back.Preparation of Cu(II)NTACu(II)NTA SynthesisPreparation of the stock solution of Cu(II)NTA complex is modified from previously published literature (Mehlenbacher et al., 2015). This synthesis is not time sensitive and can be performed with breaks in between each step.Adjust the pH of approximately 5 ml deionized water (DI) water to 12.00 in a 15 ml conical tube. Prepare a 100 mM NTA stock solution by dissolving 23.49 mg of NTA per 1 ml of pH = 12.00 DI water (117.46 mg/5 ml).",
    "The NTA is acidic and alters the pH of the solution, so be sure to maintain a pH of 12 by adding NaOH to ensure the NTA dissolves.In a separate 15 ml conical tube, adjust the pH of 5 ml of DI water to 2.00. Dissolve Cu(II)SO4·5H2O in the pH = 2.00 DI water at a ratio of 4.99 mg per 1 ml of DI water (24.95 mg/5 ml). This is the 20 mM Cu(II)SO4 stock solution.In a separate 15 ml conical tube, dilute a 1 ml aliquot of the 100 mM NTA stock to 5 ml (20 mM NTA) using the MOPS buffer (see Recipes). Slowly add in 5 ml of the 20 mM Cu(II)SO4 stock solution. This makes the 10 mM Cu(II)NTA stock solution. The Cu(II)NTA solution is a deeper blue color than the Cu(II)SO4, as seen in Figure 1A. If the Cu(II)NTA solution has a blue precipitate in it, then the synthesis was unsuccessful and more care should be taken with pH adjustments.Cu(II)NTA does not last forever. Either a new stock should be made every couple of months or aliquots should be frozen for long-term storage. Periodically check the CW-EPR spectrum for any observable changes, which might indicate that the Cu(II)NTA stock has degraded (see next section on CW-EPR setup). If any precipitate forms in the Cu(II)NTA solution, prepare or thaw a fresh batch and check the CW-EPR spectrum.CW-EPR of Cu(II)NTA ComplexSample PreparationIn a 1.5 ml Eppendorf tube, prepare 100 μl of 200 μM Cu(II)NTA in MOPS buffer. Add 20 μl glycerol to serve as a cryoprotectant. Vortex the Eppendorf tube to mix the solution.In a separate Eppendorf tube, prepare 100 μl of 200 μM Cu(II)SO4 in MOPS buffer. Add 20 μl glycerol and vortex.",
    "Pipette all 120 μl the Cu(II)NTA and Cu(II)SO4 sample into separate quartz EPR tubes. Alternatively, the sample can be transferred to the EPR tube using a Hamilton syringe combined with PTFE tubing via a Luer lock attachment. Unlike with nitroxide radicals, the quartz background is easily distinguishable from the Cu(II) spectra. Furthermore, the use of quartz over borosilicate is due to quartz being less prone to shattering.Carefully shake the EPR tubes until the solutions are settled at the bottom.Optional: Cover the open end of the EPR tube with a thin layer PTFE tape. This helps prevent ice build-up inside the EPR tube due to atmospheric water. This can also help prevent the sample from getting stuck in the resonator. Alternatively, the tube can be capped with a precision seal rubber septum.Pour enough liquid nitrogen into the 350 ml dewar to submerge the EPR sample solution. Freeze the EPR samples by placing them in liquid nitrogen. Note that using liquid nitrogen to freeze samples is slow and, therefore, faster procedures that reduce changes of protein conformation and/or dynamics are recommended for biomacromolecules (see Step B2e below). Despite adding glycerol as a cryoprotectant, the EPR tube can shatter when freezing, and therefore proper PPE (goggles and cryogen protecting gloves) is advised. The risk of tube shattering is decreased for samples with a higher percentage of cryoprotectant. Once the sample is frozen, it can be placed in a -80°C freezer for long term storage or run immediately.CW-EPRCool the MD5 resonator down to 80 K using liquid nitrogen. Refer to the Bruker manual supplied with ElexSys E680 EPR spectrometer to tune and set up the CW-EPR experiment. Insert the Cu(II)SO4 sample into the resonator and tune the spectrometer.",
    "After the EPR instrument is cooled to 80 K and tuned, set the parameters to:1）Modulation frequency = 100 kHz2）Modulation amplitude = 4 G3）Modulation phase = determine in next step, start with 04）Harmonic = 15）Smooth points = 06）Receiver gain = 60 dB7）Conversion time = 20.48 ms8）Center field = 3100 G, note that different microwave frequencies might require a different center field to have adequate baseline around the spectrum9）Sweep width = 2000 G10）If possible, turn on quadrature detection First, determine the modulation phase. Run a quick CW-EPR experiment. If quadrature detection is on, phase the spectrum until the signal is real, i.e., the signal in the imaginary is minimized (Processing → Transformations → Phase). Insert this phase into the modulation phase mentioned in Step A2b.ii.3). If quadrature detection is off, run the CW-EPR experiment at various phases, until the spectrum signal is minimized (this means everything is in the imaginary). Then, change the phase by 90° to have the signal be 100% real. If the signal is negative, then change the phase by another 180°.Once the spectrum is phased, signal average the CW-EPR experiment until an acceptable level of signal to noise. For reference, the data in Figure 1 was acquired for 60 scans or roughly 20 min.Detune and remove the Cu(II)SO4 sample, as outlined in the Bruker manual. Repeat Steps A2b.i-iv. for the Cu(II)NTA sample.Detune and remove the Cu(II)NTA sample. Repeat Steps A2b.i-iv with a blank sample. In this case, the blank contained 100 μl MOPS buffer and 20 μl glycerol. The noise level of the blank CW-EPR spectrum should be equivalent or less than the other spectra.Background subtract the two EPR spectra.1）Set the Cu(II)SO4< spectrum as the primary and the background as the secondary spectrum.2）Align the background with similar features observed in the Cu(II) spectra.",
    "To align in XEPR, go to Processing → Transformations → Left/Right Shift. This is necessary, since subtle differences in frequency can cause the spectra to shift relative to one another. Figure 1C shows the aligned background signal.3）Change the intensity of the background such that the intensity of background peaks matches those observed in the Cu(II)SO4 spectra. Go to Processing → Algebra → Constant Operation.4）Subtract the background signal from the Cu(II)SO4. Go to Processing → Algebra → Primary - Secondary.5）On the left of the XEPR window, go to Baseline Correction → Polynomial → Define Region. Highlight the baseline on the left and right of the Cu(II)SO4 signal. Choose the smallest order polynomial that gives a good fit to the background and click Subtract Line. Figure 1D contains the background and baseline subtracted CW-EPR Cu(II) spectra.6）If using quadrature detection, extract the real component Processing → Complex → Real Part. This is the CW-EPR spectrum that will be used for all analysis.7）Repeat Steps 1)-6) with the Cu(II)NTA sample.8）The two spectra should look different from each other. If the Cu(II)NTA looks similar to the Cu(II)SO4 after background subtraction, then the Cu(II)NTA synthesis was incomplete and needs to be redone. See section A of Data analysis to simulate the CW-EPR spectra.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4258/bioprotoc-11-24-4258-g001.jpgFigure 1. Preliminary Cu(II)NTA observations. A. 10 mM Cu(II)NTA compared to 50 mM Cu(II)SO4. Despite being a lower concentration, Cu(II)NTA has a deeper blue color than Cu(II)SO4. This is an easy and crude way to confirm that the complexation has worked. B. Example positioning of the dHis motif is shown for an α-helical site (residues i and i+4) and a β-sheet site (residues i and i+2). The protein GB1 (pdb: 2QMT) was used for all sample data involving Cu(II)NTA labeled dHis. C.",
    "The raw CW-EPR spectra of Cu(II)NTA before any background subtraction is at the top (gray) with the blank sample CW-EPR below (black dashed). The black solid line overlayed with the Cu(II)NTA spectrum is the minimized imaginary component. Resonator signals are marked with pentagons and the quartz EPR tube signal is marked with a star. Note that, when annealed properly, higher purity quartz will have a less intense signal. The background spectra was shifted so these features are aligned. The Cu(II)NTA spectrum ranges from roughly 2,700 to 3,500 G. This is broader than a nitroxide spectra, therefore it is important to have a longer baseline on either side of the Cu(II) signal for adequate background subtraction. D. The background subtracted CW-EPR spectra for Cu(II)NTA ± dHis and Cu(II)SO4 are shown. Note that the background subtraction is rarely perfect, due to subtle differences in the q-factor, experimental frequencies, and the fact that each sample uses a different quartz tube. However, the background subtraction should be as optimal as possible to avoid difficulties during analysis. The inset on the right points out two important features of any Cu(II) CW-EPR spectrum, gII (inversely proportional to the magnetic field) and the AII splitting (in Gauss).Protein Labeling and Sample PreparationGenerate a mutant protein with one or two dHis mutations. To design a mutant protein, the secondary structure of the protein must be known. For α-helical sites, histidine mutations must be positioned on amino acid residues i and i+4. For β-sheet sites, histidine mutations are positioned on residues i and i+2 (Figure 1B). If the goal is to do dynamics measurements, then have one dHis mutation on the protein. For distance measurements between two sites, two dHis mutations are necessary, unless the protein forms an oligomer.",
    "Refer to previous work regarding expression and purification of proteins (Gräslund et al., 2008).Protein labelingIn a 1.5 ml Eppendorf tube, prepare a 100 μl sample containing 200 μM Cu(II)NTA and 200 μM dHis (for example, 100 μM monomer with two dHis sties) in MOPS buffer. To determine protein concentration, a simple way to estimate the molar absorptivity can be found online (https://web.expasy.org/protparam/[href=https://web.expasy.org/protparam/]). Since the labeling reaction is exothermic (Wort et al., 2019), it is important to incubate at 4°C for about 30 min. The labeling time may be influenced by the labeling site and can be accurately determined by UV-Vis spectroscopy (Gamble            Jarvi et al., 2020a).Add 20 μl glycerol and vortex. The glycerol prevents crystallization during freezing. In addition to preventing the EPR tube from shattering, glycerol allows the sample to freeze in a glass-like state which allows for longer Tm relaxation times (Casto et al., 2021).Use a micropipette or Hamilton syringe with PTFE tubing to transfer the 120 μl protein sample into separate EPR tubes. Carefully shake the EPR tubes until the solution is settled at the bottom.Optional: Cover the open end of the EPR tube with PTFE tape or a precision seal rubber septum.Freeze the sample in precooled propylene + propane (MAP-Pro), see Figure 2 for freezing setup. This freezes the sample faster than submerging in liquid nitrogen for two reasons. Firstly, liquid nitrogen will always be at its boiling temperature. As such, anything warmer when submerged in liquid nitrogen will cause the nitrogen to boil. This creates a gas shield that provides poor thermal contact with the sample, known as the Leidenfrost effect (Walker, 2010). Because MAP-Pro is cooled below its boiling point, it will not boil when a warm sample is submerged in it. Furthermore, MAP-Pro has a similar heat capacity to liquid nitrogen.",
    "Alternatively, the sample can be cooled in liquid nitrogen, but this is a slower process and can allow the protein to adopt its most stable conformation, rather than all conformations at physiological temperatures (Georgieva et al., 2012). Faster freezing methods, such as submerging in liquified ethane (Russo et al., 2016), or rapid freeze-quench (Hett et al., 2021), also eliminate this concern.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4258/bioprotoc-11-24-4258-g002.jpgFigure 2. The EPR tube sample freezing setup. See Video 1 for more information on the freezing protocol. A. MAP-Pro gas cylinder with RP3E gas regulator. Attached is the 5/16” I.D. tubing with a pipette tip inserted. B. Metal cylinder with blind hole used to freeze the sample. A metal wire is wound around the metal cylinder and used as a handle to safely move the cold metal. C. The metal cylinder is pre-cooled in liquid nitrogen. Wait for the nitrogen to stop rapid boiling before introducing MAP-Pro. Be sure that any liquid nitrogen on the inside of the metal cylinder is emptied as well. D. Open the MAP-Pro gas canister until gas is coming out. Be mindful of the gas flow rate: too slow of a flow rate will cause too much time to pass before enough MAP-Pro is liquified, and result in the MAP-Pro freezing in the metal cylinder; too fast of a flow rate will cause a large excess of gas to be pumped into the atmosphere; a good flow rate will cause a cloud to barely obstruct the view of the hole in the metal cylinder, as seen in the Figure above. Insert the MAP-Pro gas into the hole and blow or wave away the cloud to see the cylinder. Once the cylinder is filled with liquid, around 30 s at most, insert the EPR sample for about one second.",
    "Remove the frozen EPR sample and place into a separate dewar filled with liquid nitrogen.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Flash freezing the EPR sample. EPR Experiments on Cu(II)NTA labeled proteinObtaining Anisotropic CW-EPR SpectrumFollow the protocol from Step A2b.Expected gII and AII values for Cu(II)NTA bound to dHis in MOPS are outlined in section A of Data analysis. Note that these values can change when Cu(II)NTA is in different buffers (Gamble            Jarvi et al., 2020a). Go to section A of Data analysis to simulate the CW-EPR spectrum. Obtain the labeling efficiency by simulating the CW-EPR spectrum with free and bound Cu(II)NTA. The labeling efficiency can be calculated from the simulated spectrum using the following equation:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20211215/20211215231306_0083.png Alternatively, the labeling efficiency can be calculated from the DEER modulation depth (Lawless et al., 2017; Gamble            Jarvi et al., 2020b). Labeling efficiency can also be obtained from KD curves obtained from UV-Vis (Gamble            Jarvi et al., 2020a) and RIDME pulsed EPR experiments (Wort et al., 2021a).Pulsed EPR preliminary experimentsCool the MD5 resonator down to 80 K with liquid nitrogen.Refer to the Bruker manual on pulsed experiment setup. Additionally, a useful protocol including preliminary pulsed experiments outlined in more detail was previously published (Vicino et al., 2021). Run a field-swept spectrum with the center field and sweep width equal 3,100 G and 2,000 G (Figure 3A).Run a nutation experiment at the field of maximum intensity, to determine the optimal pulse lengths for future experiments (Figure 3B). Xepr can only do even length pulses, so change the attenuation until the π/2 pulse length is even.Run an echo decay experiment, also known as a 2-pulsed ESEEM experiment (Figure 3C). If ESEEM modulations do not dominate the signal, then fit the time domain signal to a stretched exponential decay to obtain the Tm relaxation time.",
    "In the PulseSPEL window, load the inversion recovery experiment (InvRec_ESE.exp) in the following folder:xeprFiles/PulseSPEL/shared/Standard/Spel2009/RelaxationUse the following parameters for the inversion recovery experiment (units are in ns unless otherwise stated): n = 1, d30 = 2000, d1 = 200, d2 = 1000, SRT = 1500 us, h = 10, p0 = π/2 pulse length determined in Step C2c, p1 = π pulse length determined in Step C2c, p2 = π pulse length, d0 and pg determination are outlined by           Vicino et al. (2021)          .After the inversion recovery is finished, calculate T1 following the information in Figure 3D. The shot rep time (SRT) used in all other 80 K pulsed experiments is equal to 5 × T1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4258/bioprotoc-11-24-4258-g003.jpgFigure 3. Pulsed EPR data necessary for all other pulsed techniques. A. The echo detected field-swept spectra of Cu(II)NTA bound to dHis. Experiments are performed at the maximum intensity of approximately 3,350 G. B. Nutation experiment to determine the optimal pulse lengths for efficient spin inversion. The first of the minima is the π-pulse length, in this case 12 ns. The π/2 pulse length is therefore 6 ns. C. The echo decay (2pESEEM) time domain signal is shown. This experiment is useful to determine the maximum dipolar evolution time allowed in DEER experiments due to Tm, the phase memory relaxation time. Make note of when the echo decay is at a baseline, as this represents the time limit of the DEER pulse sequence. For this sample, the baseline is around 3 μs. Therefore, pulse sequences longer than 3 μs are unlikely to produce an adequate echo in DEER. Unlike with nitroxide radicals, nitrogen ESEEM often dominates the echo decay, so fitting with a stretched exponential decay to determine Tm can be difficult.",
    "If Tm is desired, one way to overcome this issue is to use softer pulses to weaken the ESEEM modulations. D. The inversion recovery sequence for Cu(II)NTA at 80 K is shown. This experiment is important to measure the necessary SRT used in future experiments. The SRT applies a delay between every measured data point to ensure spin relax back to equilibrium. An SRT equal to 5 times the longitudinal relaxation time (T1) allows for 99% of the spin magnetization to recover between each experiment. T1 can be determined by fitting the inversion recovery to the following equation:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20211217/4258e1.png. A is the amplitude, γ is a stretch parameter between 0 and 1, and τ is the pulse separation (the x-axis variable in the time domain signal). Vary A, T1, and γ until the fit is optimal. The EPR instrument has a minimum SRT, so if the measured SRT is too short, lengthen the SRT until the error message disappears. The above data was acquired with an SRT = 400 μs.Three Pulsed Electron Spin Echo Envelop Modulation (3pESEEM)Download the ESEEM program and parameters file from GitHub (see Software).In the acquisition tab of the parameters window, check “Run from PulseSPEL” and open the PulseSPEL window.Click “Load Var. Def.” and load the variable definitions file “ESEEMvar.def” downloaded in Step C3a. Click “Compile” in the PulseSPEL window. Then click “Load Program” and load the 3pESEEM.exp file. Click “Compile” again.In the Parameters window, set both the experiment and phase cycling to “3pESEEM setup”. Enter in the following parameters into the PulseSPEL variable textbox (units default to ns unless otherwise stated).d0 = 0pg = 0d1 ≈ 148, depending on the magnetic field. This value is important in running experiments at the hydrogen blind spot. To calculate the optimal d1, download the excel document located on GitHub.",
    "Note that pulses are nonideal, in other words, have a nonzero duration and therefore a finite frequency bandwidth. As such, it may be necessary to try a few values around the calculated d1 to optimize the hydrogen ESEEM suppression.d2 = 288dx = 0, dy = 0d30 = 16p1 is the π pulse length determined in Step C2c.p0 is half of p1. Both of these numbers need to be even.SRT is determined in Step C2e. Be sure to add “us” after the number since the units are not in ns (for example: 500 us).n = 1a = 1024h = 100In the PulseSPEL window, click Validate. If no errors appear, then run the setup experiment. Errors usually appear if the experiment was not switched to PulseSPEL mode (Step C3b) or if the program detects parameters which are illogical. Be sure that everything is input correctly. Another possible error can occur if the pulse sequence exceeds the memory of the spectrometer. This can be solved by lowering the step size, d30, or decreasing the number of points at the top of the script.Check the phase of the 3pESEEM echo. If the echo is not phased, change the signal phase in the FT Bridge window under the Receiver Unit tab. Continue to change the phase and rerun the setup until everything is real and positive. Find the start of the echo (d0) and the width of the echo (pg). Set these values in the PulseSPEL variable textbox.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4258/bioprotoc-11-24-4258-g004.jpgFigure 4. The real and imaginary phase for the 3pESEEM time domain signal. The real component (black) is what should be used in all future experiments. The imaginary component (gray) should be phased such that no modulations are present.Change the experiment and phase cycling to “3pESEEM”. Click validate in the PulseSPEL window.",
    "If no errors appear, then set the number of scans (n) to an arbitrarily large value (for example n = 10000) and run the 3pESEEM experiment. If an error appears, go back and be sure that all parameters are entered in correctly. The 3pESEEM experiment takes roughly 12 h to acquire adequate signal to noise at 80 K, but might be shorter or longer depending on labeling efficiency, the total number of Cu(II) atoms, and the pulse length. Alternatively, the 3pESEEM can be obtained at 18 K, usually in under 1 h.Once the 3pESEEM is ready to be stopped, set n to be 1 higher than the current number of scans. This allows the current scan to finish without interruption. Phase the time domain signal such that all the modulations are in the real phase. Sometimes, the phasing is not perfect and signal remains in the imaginary component (Figure 4). If this is the case, then the Fourier transform will show an intense peak at zero frequency. To prevent this, go to Processing → Complex → Real part.See section B under Data analysis for more information on 3pESEEM.Double Electron-Electron Resonance (DEER)/Pulsed Electron Double Resonance (PELDOR)The DEER setup and analysis was previously outlined (Vicino et al., 2021). This protocol will only discuss differences in setup from the work described on nitroxide radicals. For proteins that are unstable at higher concentrations, distance measurements from relaxation-induced dipolar modulation enhancement (RIDME) can be obtained at sub-micromolar concentrations (Ackermann et al., 2021).Cool the MD5 resonator down to 18 K with liquid helium.Insert the EPR sample into the MD5 resonator and tune following the Bruker manual.Follow Steps C2b-e at 18 K before setting up the DEER experiment.Set the center field to the maximum intensity observed in the field-swept spectrum, roughly 3,350 G.",
    "Run nutation experiments at two frequencies that are 150 MHz apart. The lower frequency will be the pump frequency (νB) and the higher frequency is the observer frequency (νA). These pulses should be as short as possible, to maximize the excitation bandwidth of the pulse.Rerun the field-swept spectrum at νB. Set the center field to the maximum intensity. Then change the frequency to νA.Continue to follow the protocol by Vicino et al. (2021) to run the DEER experiment. When setting up the DEER, be sure to account for the maximum allowed dipolar evolution time determined from the echo decay experiment (Step C2d).Room Temperature Dynamics MeasurementsPrepare 25 μl of 300 μM Cu(II)NTA and 900 μM protein in MOPS. Underloading the protein with Cu(II)NTA ensures that the resulting CW-EPR spectra has a negligible component of free Cu(II)NTA. For smaller proteins (<50 kDa), the sample can contain 25% w/v Ficoll in order to slow down global tumbling and minimize its influence on the CW-EPR lineshape (López et al., 2009).Draw up the solution into the quartz capillary tube via capillary action and seal the same end with capillary tube sealant. Insert the capillary into the 250 mm length quartz tube and insert this into the SHQE high resolution resonator.Setup and tune the spectrometer following the Bruker manual.Set the CW-EPR parameters to:Modulation frequency = 100 kHzModulation amplitude = 6 GModulation phase = determine in next step, start with 0Harmonic = 1Smooth points = 0Receiver gain = 60 dBConversion time = 20.48 msCenter field = 3200 G, note that different microwave frequencies might require a different center field to have adequate baseline around the spectrumSweep width = 1600 GIf possible, turn on quadrature detectionSimilar to Step A2b.iii, determine the modulation phase.",
    "If the signal is too weak to quickly find the modulation phase, then run the experiment at phase = 0 and phase afterwards.Run the CW-EPR experiment until adequate signal to noise ratio, roughly 12 h.Repeat Steps C5a-C5f with MOPS buffer to obtain a background spectrum.Follow Steps A2b.vii to background subtract the CW-EPR spectrum. Repeat these steps with free Cu(II)NTA or Cu(II)NTA + wild type protein to confirm that acquired spectrum contains dHis-bound Cu(II)NTA.See section C of Data analysis to simulate the room temperature CW-EPR spectra."
  ],
  "subjectAreas": [
    "Biophysics",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}