{
  "id": 4888,
  "origin_website": "Bio",
  "title": "Establishing a Biofilm Co-culture of <em>Pseudomonas</em> and <em>Aspergillus</em> for Metabolite Extraction",
  "procedures": [
    "Biofilm co-culture of Pseudomonas and AspergillusPseudomonas aeruginosa culture preparationStreak-inoculate Pseudomonas aeruginosa PA14 strain from -80 °C glycerol stock onto solid LB medium in a 100 x 15 mm Petri dish and incubate at 37 °C for 24 h.Immediately prior to use for co-culture experiments, inoculate 5 ml of liquid LB medium in a 15 ml glass culture tube with a single colony from PA14 LB solid medium culture in step A1a and incubate at 37 °C, 225 rpm for 14 h to early stationary phase.Aspergillus fumigatus conidia preparationTake a ~10 μl plug from the -80 °C glycerol stock of Aspergillus fumigatus AF293 using a sterile inoculating needle and streak onto solid glucose minimal medium (GMM) in a 100 x 15 mm Petri dish and incubate at 37 °C for 5 days (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20151204/20151204015138_7254.jpgFigure 2. Example of A. fumigatus AF293 streak culture after 5 days of incubation at 37 °CImmediately prior to use, add 5 ml of phosphate buffered saline (PBS) -0.01% Tween 20 buffer (pH 7.2) to the fungal plate and gently scrap the surface of fungal colony with a sterile, plastic spreader. Collect the conidia suspension from Petri dish and transfer into a 15 ml Falcon tube. Centrifuge the conidia suspension at 5,000 x g for 5 min. Discard supernatant and re-suspend conidia pellet with 5 ml of PBS-0.01% Tween 20 buffer. Dilute the conidia suspension with PBS-0.01% Tween 20 buffer to a final concentration between 1 to 2 x 106 conidia/ml. Quantify the number of conidia using a hemocytometer (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20151204/20151204015207_9130.jpgFigure 3. Example of A. fumigatus conidia under microscopePseudomonas and Aspergillus co-culture biofilm preparationPour 10 ml of autoclaved YPD solid medium (1.6% agar) (bottom layer) into a 60 x 15 mm Petri dish and solidify at room temperature.",
    "Note: Prepare multiple YPD agar plates for different co-culture time points and replicates.Autoclave YPD solid medium (0.5% agar) (top layer) and cool in 50 °C water bath for 15 min.After YPD top layer is cooled, inoculate with freshly prepared and vortex-mixed Aspergillus conidia suspension to a final concentration of 3.33 x 105 conidia/ml.Mix the YPD top layer containing conidia thoroughly and pour 3 ml of the mixed top layer onto the solidified bottom layer.Note: High temperature of autoclaved agar will kill Aspergillus conidia. Thus, it is critical to ensure that the temperature of YPD top layer is cooled enough to the extent that medium bottle can be held with hands. In the meanwhile, agar will solidify if the temperature drops too much. Steps A3c-d should be done as quickly as possible.Once the top layer is solidified, incubate the plate (fungal biofilm facing up) at 25 °C for 12 h.Note: A. fumigatus grows slower than P. aeruginosa. 12 h pre-culture is necessary to avoid overwhelming bacterial growth.Spot-inoculate 10 μl aliquots of freshly prepared early stationary phase P. aeruginosa PA14 LB liquid culture in the center of the performed fungal lawn.Incubate the co-culture biofilm (co-culture biofilm facing up) at 25 °C for an additional 7 days.Notes: See Figure 5 for an example of the co-culture biofilm.It is critical to synchronize the growth of P. aeruginosa (24 h) and A. fumigatus (5 d) prior to the preparation of co-culture biofilm. Metabolite extractionAfter different periods of growth (for example, every two days after inoculation), cut the co-culture biofilm with a sterile steel corer (38.1 mm in diameter), which encompasses the co-culture biofilm.Cut the 38.1 mm diameter extraction core into four, equal quarters using a sterile blade.Transfer one quarter (about 285 mm2 of surface) to a glass culture tube.",
    "Note: Transfer both co-culture biofilm and supporting agar (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20151204/20151204015237_8963.jpgFigure 4. Example of cutting co-culture plate for extractionAdd 4 ml milli-Q water and homogenize using a pestle.Add 4 ml chloroform, cap the tube, and vortex vigorously for 15 min.Transfer the mixture to a 15 ml glass centrifuge tube.Centrifuge at 500 x g for 10 min.Collect water phase supernatant and filter through a 0.2 μm-pore-size hydrophilic filter.Collect 1.5 ml of chloroform phase to a 10 ml glass vial.Evaporate chloroform to dryness by using a gentle flow of nitrogen.Re-dissolve the dried extract with 1.5 ml mixture of 50/50% acetonitrile/water solution. Note: This dissolution solvent can be used for the assessment of metabolites that have similar chemical property as Pseudomonas phenazines, which were analyzed in Zheng et al. (2015).If extracted sample contains metabolites that are unstable in acetonitrile such as 5-methoxy-phenazine-1-carboxylic acid (5-Me-PCA), collect another 1.5 ml aliquot of chloroform phase after step B9, evaporate to dryness under a gentle flow of nitrogen and re-dissolve in 1.5 ml milli-Q water.Note: Most bacterial and fungal metabolites are light sensitive, thus, it is strongly suggested to protect extracts from light by wrapping all containers with aluminum foil."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}