{
  "id": 4929,
  "origin_website": "Bio",
  "title": "A Technique for the Measurement of <EM>in vitro</EM> Phospholipid Synthesis via Radioactive Labeling",
  "procedures": [
    "Note: To determine under which conditions lipid synthesis is linear with time, prepare different tubes and carry out the reaction at 37 °C for different times. If you are evaluating the capacity of modifying lipid synthesis of a given protein, you must also determine under which conditions lipid synthesis is linear with the concentration of your protein of interest. The person that will carry on the experiments must have strict training with radioactive working, according to rules and governing laws. Incorporation of radioactive 32P into cell/tissue homogenatesGrow the desired cell line with the required culture medium on a 10 cm dish until reaching 90% confluence. Note: At this point, if you need your cells to be cultured under special conditions or subjected to a particular treatment, you should adequate the protocol to fit your needs.Harvest cells with 300 µl of milliQ water or use a homogenizer or ULTRA-TURRAX® if the sample is obtained from a tissue, to obtain the protein homogenates according to experimental requirements.Sonicate on ice and measure total protein concentration using Bradford method or a similar one. Maintain samples on ice all the time.Prepare the reaction tubes. Each of them must contain a final volume of 80 µl, with 1x reaction buffer, 3 μCi of [γ32P] ATP and a protein concentration of 1.25 mg/ml. Consider that the samples must be measured at least in triplicate. For this, first aliquot in a Kahn tube the amount of protein homogenate necessary to reach the required protein concentration. Then, add the adequate volumes of the reaction buffer and the [γ32P] ATP to reach the concentrations mentioned above.",
    "As normally there are several conditions to be measured, and taking into account that they must be performed at least in triplicate, we find it convenient to prepare a master mix for all the tubes to avoid pipetting mistakes. For this, first aliquot the protein homogenate in the different tubes, then prepare a master mix with the adequate amounts of reaction buffer and [γ32P] ATP and aliquot it in the tubes. Finally, add enough milliQ water to reach the final volume. Note: To simplify, it would help to normalize the protein concentration of all the samples so the volume of the master mix to be added is the same for all the tubes. Also, prepare a volume a bit larger of the master mix than the theoretical requirement, to compensate small volume losses or pipette miscalibrations. Adjust the final volume with milliQ water.Vortex for 10 sec.Carry out the reaction at 37 °C for 60 min. Note: At this time you can stop the reaction by freezing or you can continue with the purification steps. If you stop the reaction by freezing, the sample must be put in a bunker to avoid irradiation, according to working conditions with radioactive material.Add 80 μl of TCA-PTA 10-1 (% w/v) to precipitate lipids and proteins. At this point, you should start seeing the imminent formation of a white precipitate. Vortex for 10 sec and centrifuge for 10 min at 3,500 rpm.Lipids precipitation and purification Discard the supernatant, which contains the free [γ32P] ATP that has not been incorporated, and vortex until the pellet is disaggregated. Add 1 ml of TCA-PTA 5-0.5 (% w/v) and vortex again for 10 sec. Centrifuge and repeat the pellet wash four times. Discard the supernatant after each round.",
    "Note: If the amount of precipitate is too small, you can add 5 µl of brain homogenate, which will function as a carrier (see Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160119/20160119180657_2356.jpgFigure 2. Example of the expected amount of precipitate (right tube) after adding the carrier brain homogenate. The tube on the left shows a precipitate considered too small. Carry on a final wash with milliQ water, to favor lipid dissolution in the organic solvent (step B12). After centrifugation, discard the water supernatant of the last wash and vortex until the pellet is disaggregated.Add 1.5 ml of chloroform:methanol 2:1 and vortex for 10 sec. The chloroform dissolves the lipids and the methanol maintains the proteins precipitated.Centrifuge 10 min at 3,500 rpm to allow protein precipitation and separation from soluble lipids. Transfer 1.3 ml of the supernatant containing the marked lipids to a vial and dry in a water bath at 90 °C for 3 h or at room temperature overnight. When transferring the supernatant, be careful and do not pull precipitated proteins that may be marked with 32P. Caution: As this step involves the transfer of a chloroform containing solution, glass pipettes previously equilibrated with chloroform should be used to avoid sample loss. Note: There is a loss of 0.2 ml when transferring the supernatant to avoid disturbing the pellet. Measurement of 32P content in purified lipidsAdd 1 ml of non-aqueous scintillation cocktail, tap and vortex for 10 sec. Determine the levels of incorporated 32P in the lipids using a liquid scintillation counter. The reactions must be performed in triplicate, as minimum.Data analysisThe results can be expressed as absolute values (as shown in Figure 3) or as relative values respect to a control condition taken as 100% of incorporation."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Biochemistry",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}