{
  "id": 18722,
  "origin_website": "Jove",
  "title": "A Neuroscientific Approach to the Examination of Concussions in Student-Athletes",
  "procedures": [
    "All the procedures described below have been approved by the Elon’s Institutional Review Board.\n1. Computerized Neurocognitive Testing\nAsk the participants to be seated in front of the computer. Log participants on to system and instruct them to complete the computerized neuropsychological test which consists a demographic and background information section, self-reported symptom checklist, and 6 modules (word discrimination, design memory, X’s and O’s, symbol matching, color match, and three letters).\nDownload summary report and enter four composite scores for verbal memory, visual memory, reaction time and motor processing speed.\n2. Event Related Potentials\nMeasure head circumference using a measuring tape to determine size of EEG net to be used. Determine placement of the EEG net by measuring anatomical landmarks.\nSoak the EEG net in solution of sodium chloride and baby shampoo for 5 min.\nPlace the EEG net on the head of the participant. The system that we use includes 32 channels.\nCheck impedance levels of the sites on the computer. For our system, an impedance below 100 kohm is deemed acceptable.\nExplain the cognitive tasks and let the participant practice each of the tasks.\n\t\nAuditory Oddball Task: Instruct the participant to put on headphones and sit comfortably at a table. Inform them that they will hear a series of low and high tones and to respond as quickly and accurately as possible by clicking a button to a high frequency auditory tone.\nFlanker Task: Instruct participant to sit in front of a computer screen where they will be given a series of arrows projected onto a screen. Instruct participants to respond to the direction of the middle arrow by clicking the left mouse button if it was pointing left or clicking the right mouse button if it was pointing right as quickly and accurately as possible.",
    "Instruct participant to complete two trials of both the auditory oddball task and the flanker task.\nRemove the EEG net from the participant and clean the EEG net by soaking in germicide disinfectant for 10 min.\n3. Somatosensory Perceptual Responses\nSeat the participant comfortably with their left hand in a prone position resting on the sensory stimulus device and their fingers positioned along the contour of the device with the padded tips of digits 2 and 3 placed in contact with the stimulus probes.23\nAsk the participant to view task related instructions and cues on a computer monitor and enter responses using a two button computer mouse. Project 5 different tests: 2 simple single site reaction time tasks, a dual site amplitude discrimination,24 a dual site amplitude task with a single site adapting stimulus,24 and a temporal order judgment task.25  \nPrior to the start of each test run, the cues on the computer will instruct the participant to complete practice trials to familiarize themselves with the task. The computer will give the participants performance feedback after each test (e.g. correct; incorrect).\n4. Balance Protocol\nInstruct participants to put on slip-resistant socks and then stand on the balance system to become acquainted with instrument.\nInstruct participants to stand in a comfortable position, matching the center of pressure dot with the center dot on the screen. Researchers record this comfortable starting position such that all tests take place with the same foot position while standing on the device.\nAsk the participant to stand for 30 sec for each of the four conditions (eyes open/firm surface, eyes closed/firm surface, eyes open/foam surface, eyes closed/foam surface). Provide the participants a 10 sec rest between each condition and a 3 sec countdown before beginning of each recording.",
    "Repeat each of the conditions while completing a secondary task. Instruct them to count backwards by 7 starting from a random 3 digit number given to them (e.g., 843).\nRecord a sway index score, a measure of the standard deviation of the amount of sway for each condition and center of pressure data to use later for further analysis.\n5. Gait Assessment\nAssess participants’ gait using a portable 15’ long carpet instrumented gait analysis system with pressure sensors present throughout the length of the carpet to detect the participant’s footfalls.\n\tAsk the participants to walk across mat barefoot at a comfortable speed five times starting from a distance of 3’ before the start of the mat and 3’ after leaving the mat.\n\t\n\tInstruct the participants to complete five additional walking trials while counting backwards by seven from a random 3 digit number as a concurrent cognitive dual task.\n\t\nThe dependent variables obtained as output from gait analysis include absolute and variability measures of several spatiotemporal parameters like velocity, cadence and step length.\n6. Genetics\nAsk the participant to carefully remove the swab stick from its sterile container (being careful to only touch the stick end of the swab stick), move the swab into their mouth, and vigorously rub the swab inside of both cheeks for a total of 20 sec.\nHand the swab stick to the technician who is wearing latex or nitrile gloves. Only hold the stick end and then place the swab tip into a sterile 1.7 ml tube (labeled with an identification number only), which is immediately placed on ice.\nWithin 24 hr transfer the samples are to a -20 °C freezer.",
    "Extract DNA using a standard DNA Purification Kit according to the manufacturer’s protocol. To obtain a more concentrated sample, after extraction, perform an isopropanol precipitation step and rehydrate DNA in 20 µl of EDTA buffer (pH 8.0).\nStore the extracted DNA at -80 °C until genotyping analysis using standard polymerase chain reaction (PCR) assays with fluorescent tags.\n“Call” the genotypes by PCR software and then verify manually by viewing PCR amplification plots.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}