{
  "id": 5449,
  "origin_website": "Bio",
  "title": "ARP2/3 Phosphorylation Assay in the Presence of Recombinant Bacterial Effectors",
  "procedures": [
    "Production and extraction of bacterial protein kinaseTo test the ability of a protein kinase to phosphorylate ARP2/3 complex, the protein must be overexpressed in the appropriate cell expression system and purified. For example, the gene encoding a protein kinase may be cloned in pGEX-6P-3 plasmid to produce a fusion protein with an N-terminal GST tag (the BamHI/SalI restriction sites can be often used in our cases). A catalytic variant of the protein kinase, with amino acid substitutions that abolish the kinase activity, should be generated from the same construct and used as a control. Mutagenesis may be accomplished using the QuikChange II site-directed mutagenesis kit (Stratagene), per the manufacturer’s instructions, to substitute the invariant lysine essential for donor-ATP binding with a methionine. The genetic constructs are then transformed in BL21 (pREP4-groESL) E.coli strain, which expresses the GroES and GroEL chaperon proteins to promote folding of the overproduced fusion protein of interest, here the GST-protein kinase.Note: The pGEX-6P-3 plasmid is not always adaptable for the cloning and expression of your protein. In such cases, the pQE30 plasmid can also be used to generate a 6His affinity-tagged protein kinase. The purification protocol should then be adapted to include purification by immobilized metal affinity media (i.e., nickel beads).Inoculate 5 ml of LB medium containing 100 µg/ml of ampicillin and 25 µg/ml of kanamycin with one colony of the overproducing strain described above.Incubate the culture overnight at 37 °C with agitation.Inoculate 100 ml of LB + ampicillin + kanamycin with 2 ml of overnight bacterial culture (dilution 1/50).Incubate the culture at 37 °C with agitation until the optical density reaches an OD600 nm of 0.7.Add 1 ml of 0.1 M IPTG (1 mM final concentration) in the culture to induce the overproduction of recombinant protein.",
    "Incubate for additional 4 h at 20 °C with agitation.Split the culture content equally in two conical tubes of 50 ml.Note: For all remaining steps, the samples should be kept on in ice. Centrifuge the two tubes at 6,000 x g for 10 min at 4 °C.Decant the supernatants.Wash each bacteria pellet with 10 ml of prechilled dH2O.Pool the two pellets in one conical tube.Centrifuge at 6,000 x g for 10 min at 4 °C.Decant the supernatant.Resuspend the bacteria with 5 ml of prechilled 1x PBS and 50 µl of protease inhibitor cocktail. Lyse the bacteria by two passages through a French press.Centrifuge the extract for 30 min at 14,000 x g at 4 °C.Collect the supernatant that contains the soluble overproduced proteins.Purification of bacterial protein kinaseEquilibrate the glutathione agarose-4B resin:Pipette 250 µl resin in a microtube for each protein kinase to purify.Centrifuge 5 min at 1,000 x g.Discard the supernatants.Add 1 ml of 1x PBS. Gently invert the resins until well resuspended.Centrifuge 5 min at 1,000 x g.Repeat washing with 1x PBS 3 times.Load the supernatant containing overproduced proteins on the equilibrated glutathione resin. Incubate the proteins/resin mix for 4 h at 4 °C with gentle rotation.Load the proteins/resin mix on a column and allow the column to empty by gravity flow to separate the resin from the flow-through.Collect the flow-through and load into the column a second time to collect as much recombinant protein as possible.Wash the resin with 5 ml of 1x PBS. Allow PBS to move through the column by gravity flow. Repeat this washing step 3 times.Elute the GST tagged protein kinase with 1 ml of GST elution buffer twice and keep the sample in ice.Dialyze the eluate using a dialysis membrane:Cut the appropriate length of dialysis membrane.",
    "Incubate the membrane for 1 h in dH2O with gentle agitation to rinse.Place the eluate in a microtube, puncture a large hole in the cap and replace with the dialysis membrane.Invert the microtube (with dialysis membrane towards the buffer) in 1,000 volumes of dialysis buffer and dialyze overnight at 4 °C.Determine the protein concentration with a NanoDrop assay.Note: Any method to determine the protein concentration may be used.Dispense 100 µl aliquots of the protein into 1.5 ml prechilled microfuge tubes.Add 25 µl of glycerol (20% final).Store the proteins at -80 °C until needed.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170327/20170327191651_3712.jpgFigure 1. Example of purified bacterial protein kinase. Coomassie staining of SDS-PAGE gel with an overexpressed and purified bacterial protein kinase from the Legionella pneumophila bacterium, GST-LegK2. MW: molecular weight, NI: non-induced fraction of bacteria, I: induced fraction of bacteria, E: eluted fraction.Purification of ARP2/3 complexAll reagents and the purification of ARP2/3 complex must be performed at 4 °C.Equilibrate a 1 ml polypropylene column containing VCA-coupled Sepharose with buffer A. Apply actin-depleted extracts of Acanthamoeba castellanii to the column at 4 °C.Note: Actin-depleted extracts of Acanthamoeba castellanii prepared as previously described in Zuchero (2007). In vitro actin assembly assays and purification from Acanthamoeba. Methods Mol Biol 370: 213-226.Wash with 20 column volumes of buffer A.Elute ARP2/3 with ARP2/3 elution buffer.Pass ARP2/3 enriched fractions over a 1 ml phenyl Sepharose column equilibrated in elution buffer followed by 1.5 column volumes of elution buffer.Collect the filtrate and identify fractions enriched in ARP2/3 by SDS-PAGE.Exchange ARP2/3 complex enriched fractions into ARP2/3 storage buffer using a PD10 column or dialysis.Aliquot ARP2/3 complex, flash freeze in liquid N2 and store at -80 °C.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170327/20170327191810_2628.jpgFigure 2. Purified ARP2/3 complex. Coomassie staining of SDS-PAGE gel with ARP2/3 complex purified from Acanthamoeba castellanii. MW: molecular weight.",
    "Dephosphorylation of ARP2/3 complexDilute ARP2/3 complex 1:1 with 2 mM Tris pH 8.0 and combine with HipH buffer containing 1 U Antarctic phosphatase. Incubate at 30 °C for 1.5 h.Mock-treated controls should be incubated with heat-inactivated phosphatase at 65 °C for 30 min. Affinity purify dephosphorylated ARP2/3 complex using N-WASP VCA-coupled to activated CH-Sepharose.Elute ARP2/3 complex from Sepharose with ARP2/3 elution buffer. Dialyze ARP2/3 against buffer A overnight at 4 °C.In vitro phosphorylation assaysPrepare the following reactions in duplicate in 1.5 ml microtubes:Table 1. Reactions for the phosphorylation assaysimgsrc:https://en-cdn.bio-protocol.org/attached/image/20170327/20170327202759_8364.jpgIncubate the reactions for 30 min at 37 °C in water bath. In the phosphatase test tubes, add 2 µl of Antarctic phosphatase at 5,000 U/ml (10 U final) with 5 µl of its 5x HipH buffer and incubate for an additional 1 h at 30 °C in water bath.Stop the reactions by the addition of 5 µl of 5x Laemmli loading buffer. Detection of phosphorylation level by Western blot with an anti-phosphothreonine antibodyPrepare two SDS-PAGE gels at 12%.Heat the samples for 5 min at 100 °C in dry block heater.Load 20 µl of heated samples and 5 µl of protein ladder in gel and electrophoresis in SDS-PAGE migration buffer at 35 mA by gel for approximately 45 min.Note: The amperage and time of migration are dependent of the gel size. Stain one of the gels with Coomassie blue in a Petri dish.Stain the gel for 20 min in staining solution with gentle agitation.Wash the gel for 30 min to 1 h with gentle agitation in destaining solution.Analyze the different fractions.Perform a Western blot with the second gel.Transfer the proteins from the second gel to a nitrocellulose membrane in semi-dry conditions with 0.8 mA/cm2 for 1 h.Place the membrane in a dish adapted for agitation or a conical tube.",
    "The side of membrane with proteins must not be in contact with the container and the solutions must completely cover the membrane.Block the membrane for 1 h at room temperature with gentle rotation in TBS-5% BSA.Wash the membrane 3 x 5 min in TBS-0.1% Tween 20.Incubate the membrane for 1 h at room temperature with gentle rotation in anti-phosphothreonine antibodies solution.Note: Following this protocol, we detect threonine phosphorylation level. Tyrosine phosphorylation level of ARP2/3 complex can also be detected using an anti-phosphotyrosine antibody (EMD Millipore, catalog number:  AB1607  ) or another anti-phosphotyrosine antibody, adjust the procedure to follow the manufacturer’s recommendations if necessary.Wash the membrane 3 x 5 min in TBS-0.1% Tween 20.Incubate the membrane for 1 h at room temperature with gentle rotation in anti-mouse-peroxidase antibody solution.Wash the membrane 3 x 5 min in TBS-0.1% Tween 20.Wash the membrane with TBS.Detect the anti-phosphothreonine labeling with SuperSignal West Pico Chemiluminescent Substrate Kit.Place 1 ml of chemiluminescent substrate (500 µl of stable peroxide solution + 500 µl of Luminol/Enhancer solution) on a sheet of Parafilm.Place the membrane on the chemiluminescent substrate directly so that the proteins are in direct contact with the peroxidase substrate.Note: Caution, remove any bubbles that are present between the membrane and the substrate.Incubate 5 min in the dark.Drain the solution from the membrane and place it on a support.Cover the membrane with plastic wrap to prevent drying.Image membrane at different exposures with a ChemiStart or appropriate detection system.Notes: Other methods for detecting the chemiluminescent signal may be used according to recommendations by the equipment manufacturer.You may also detect the autophosphorylation state of your protein kinase. However, we suggest that the analysis be performed at a different polyacrylamide concentration if the molecular weights of the kinase and its substrates are substantially different.",
    "The original publication describing ARP2/3 phosphorylation can also be help to set the conditions and for the analysis: LeClaire, L. L. 3rd, Baumgartner, M., Iwasa, J. H., Mullins, R. D., Barber, D. L. (2008). Phosphorylation of the Arp2/3 complex is necessary to nucleate actin filaments. J Cell Biol 182(4):647-54."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}