{
  "id": 14399,
  "origin_website": "Jove",
  "title": "An Alternative to the Traditional Cold Pressor Test: The Cold Pressor Arm Wrap",
  "procedures": [
    "1. CPAW Creation\nNote: the CPAW is versatile in its components and construction. While this protocol represents the approach taken by the author, alternative approaches are possible.\nAffix two to three pieces of Velcro (each about 4 in x 1 in) to each of the two gelpacs (6 in x 12 in size) using rubber cement, equally spaced. Allow 24 hr to dry.\nObtain a piece of thick fabric approximately 12 in x 16 in in size, fold in half lengthwise. The example 6 in x 12 in gelpacs will run lengthwise along each inner half of the folded fabric.\nAffix the complementary side of each Velcro piece (from step 1.1) to the inner sides of the fabric, spaced so that they will match placement of the Velcro on the gelpacs. Rubber cement or needle and thread may be used. This will allow gelpacs to be easily removed for cleaning and reattached for storage.\nObtain two larger pieces of Velcro (approximately 2 in x 10 in). Separate. Cut one side to about a quarter of its original size (and discard the remainder) while keeping the other at the original 2 in x 10 in size.\nAffix the small piece of Velcro to the front and back of the outer portion of the fabric on the same side. Finally, affix the longer part of the Velcro to the analogous locations on the outer portion of the opposite side of the fabric. After this is completed, it should be possible to wrap the fabric around one's forearm and hand and fasten it in place using the Velcro straps.\n2. CPAW Usage and Safety Precautions",
    "Inform participants in studies using CPAW multiple times, during consent and prior to CPAW administration, that they are free to withdraw and end the procedure at any time. Three discrete withdrawal statements are recommended. Additionally, be prepared to end the procedure if the participant becomes distressed.\nExample Instructional Text: \"In this study, we may ask you to participate in a stress procedure that involves placing an arm wrap made of cold gelpacs to your arm for a period of time. The wrap is designed to be stressful, and will thus be highly uncomfortable. It is important that you understand that it is your right to end the procedure and experiment at any time for any reason, whether the arm wrap is currently on your arm or not. To do this once in the MRI you may tell me verbally, you may kick your foot vigorously, or if necessary you may use the emergency squeeze-ball we will give you. Do you understand? Are you willing to continue?\". Thereafter, it is advised that the participant be reminded twice more before MRI scanning with the statement, \"Remember, we will remove the arm wrap and end the experiment at your request at any time\".\nStore CPAW in a freezer with a carefully monitored temperature. If the freezer cannot beset to a specific temperature (e.g. between 0-5 °C) and is below 0 °C, allow time for CPAW to warm to a safe temperature (no less than 0 °C) after removing it from storage. Otherwise, the potential exists for a participant to experience a cold burn.",
    "Prior to employing CPAW, cover the gelpacs with a layer of plastic sheeting to avoid direct contact between gelpacs and the participant's skin. Measure the surface temperature of each gelpac (covered by the plastic sheeting) using an infrared thermometer in two-to-three locations along its length to ensure a safe temperature. If the temperature is too low, allow additional time to pass and measure again.\nWhen the desired temperature is reached, wrap CPAW around the participants forearm and hand affixing it in place with the aforementioned Velcro straps. Leave CPAW in place for the desired period of time (2 min is recommended). Remove it immediately upon the participant's request or after that time has elapsed."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}