{
  "id": 20019,
  "origin_website": "Wiley",
  "title": "Live Cell Monitoring and Enrichment of Stem Cell-Derived β Cells Using Intracellular Zinc Content as a Population Marker",
  "procedures": [
    "Protocols to generate SC-β cells have been successfully performed in a number of laboratories (Nostro et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.99#cpsc99-bib-0007]; Pagliuca et al., 2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.99#cpsc99-bib-0008]; Rezania et al., 2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.99#cpsc99-bib-0009]; Russ et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.99#cpsc99-bib-0010]). These cells share a glucose responsiveness profile and similarity in gene expression to human cadaveric islets (Pagliuca et al., 2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.99#cpsc99-bib-0008]; Veres et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.99#cpsc99-bib-0011]). These protocols yield mixed populations of α, β, δ, and other cells types of the islet, as well as undifferentiated progenitors or smaller populations of undesired cells.\nInsulin comprises approximately 10% of the total protein content within the β cell (Weir & Bonner-Weir, 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.99#cpsc99-bib-0012]). This abundance of insulin requires efficient packing and storage in secretory vesicles, which is achieved in SC-β cells (Pagliuca et al., 2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.99#cpsc99-bib-0008]). Organization of insulin into dense core granules is facilitated by crystallization, seeded by two zinc ions at the center of each hexamer within the secretory vesicle (Dodson & Steiner, 1998[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.99#cpsc99-bib-0002]). Thus, β cells have high levels of intracellular zinc and high expression of zinc transporters. Appropriate expression of zinc transporters and packaging of insulin have previously been confirmed in the SC-β population (Pagliuca et al., 2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.99#cpsc99-bib-0008]), and high intracellular zinc has been used to image and isolate the islet β cell population (Burdette, Frederickson, Bu, & Lippard, 2003[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.99#cpsc99-bib-0001]; Latif, Noel, & Alejandro, 1988[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.99#cpsc99-bib-0003]; Lukowiak et al., 2001[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.99#cpsc99-bib-0004]; Meeusen, Tomasiewicz, Nowakowski, & Petering, 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.99#cpsc99-bib-0005]). Here, we describe the use of live-cell zinc dyes for isolation and monitoring of SC-β cells. Recent reports have also suggested that enrichment of the SC-β population for extended culture may improve insulin secretory profiles of SC-β cells using genetic reporters (Nair et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.99#cpsc99-bib-0006]; Veres et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.99#cpsc99-bib-0011]). Here, we describe a method to enrich SC-β cells without the need for gene editing, allowing studies of SC-β biology across multiple genetic backgrounds and human islets.",
    "The dye N-(6-methoxy-8-quinolyl)-p-toluenesulfonamide (TSQ) offers a simple, broadly applicable method to analyze the SC-β population across multiple backgrounds, as the TSQ+ population labels a large fraction (>80%) of the insulin+ population. This was measured using a differentiated genetic knock-in reporter line, INSmCherry, for insulin expression, as analyzed by flow cytometry (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.99#cpsc99-fig-0001]A,B). Furthermore, reaggregation after sorting allows for homogenous clusters of similar size and intracellular zinc content to human islets (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.99#cpsc99-fig-0001]C). These cells can be cultured in 96-well format, allowing large-scale experiments with multiple conditions and a defined number of cells in each cluster.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/134fd36d-287f-4f06-9663-6a72530050fd/cpsc99-fig-0001-m.jpg</p>\nFigure 1\nAnalysis of SC-β cells before and after enrichment and reaggregation using TSQ-based FACS. (A) Flow cytometry analysis of 1016 INSmCherry knock-in reporter line without sorting for mCherry expression (left) and TSQ live cell staining (right). (B) Analysis of mCherry expression in TSQ High (left) and TSQ Low (right) subpopulations. (C) Dithiazone staining of human cadaveric islets (left), unsorted SC-β cells (middle), and reaggregated, TSQ-enriched SC-β cells (right) 72 hr post-sort. Light microscopy images were taken at 2.5× on a dissecting light microscope."
  ],
  "subjectAreas": [
    "Stem Cell Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}