{
  "id": 15398,
  "origin_website": "Jove",
  "title": "The Visual Colorimetric Detection of Multi-nucleotide Polymorphisms on a Pneumatic Droplet Manipulation Platform",
  "procedures": [
    "1. Method to Detect MNP\nNote: This section describes the procedure to detect the MNP based on the hybridization-mediated growth of gold nanoparticles.\nPrepare the probe DNA (5'-thiol-GAGCTGGTGGCGTAGGCAAG-3') solution at a concentration 100 µM.\nPrepare the probe DNA-modified AuNP (AuNP probe) particles.21\n\tNote: The volume used here depends on the requirement of probe DNA-modified AuNP (AuNP probe) particles. It is hence dependent on the number of experiments to be conducted. We typically prepare excess AuNP probe particles as spares. The volume used in these steps is adjustable and flexible.\n\t\nAdd probe DNA (100 µM, prepared in step 1.1) to a solution of gold nanoparticles (13 nm, 17 nM) at concentration 1 OD/ml.\nBring the final concentrations of sodium dodecyl sulfate (NaC12H25SO4, SDS) and phosphate buffer (PBS) to 0.01% and 0.01 M, respectively.\nAfter 20 min, bring the concentration of sodium chloride (NaCl) to 0.05 M with a solution of NaCl (2 M) and PBS (0.01 M) while maintaining SDS at 0.01% and incubate for 20 min.\nIncrease the NaCl concentration in increments of 0.1 M to a final concentration of 1 M over 20 min intervals.\nIncubate overnight with shaking on a vortex mixer at 23 °C. The shaking speed does not affect the experiment as long as the DNA samples and AuNP probes become hybridized.\nCentrifuge the gold nanoparticles at 7,000 x g for 30 sec and remove the supernatant.\nAdd AuNP probe particles into deionized water (DI water) at a concentration of 25 nM (AuNP probe solution).\nPrepare target DNA samples (fully complementary: 5'-CTTGCCTACGCCACCAGCTC-3'; three base-pair mismatched: 5'-CTTGCCTACTTTACCAGCTC-3'; six base-pair mismatched: 5'-CTTGCCTTTTTTTCCAGCTC-3') at concentrations of 0.06, 0.11, 0.17, 0.20, 0.30, 0.50 µM, respectively.\nAdd AuNP probe solution (6 µl, 25 nM) into the DNA samples (350 µl) with NaCl (14 µM).",
    "Shake the mixture of DNA samples and AuNP probes with a vortex mixer at 23 °C for 5 min for DNA hybridization.\nFor AuNP growth, add NH2OH (6 µl, 400 mM) and HAuCl4 (6 µl, 25.4 mM) to the solution (the mixture of DNA samples and AuNP probes). The growth of AuNP takes approximately 30 sec for completion. The steady change of coloration maintains more than 1 hr.\n\tCAUTION: Skin contact with HAuCl4 might produce severe toxic effects. Please consult the material safety data sheets (MSDS) before use. Please wear gloves and use a fume cupboard when using HAuCl4.\n2. Fabrication of a Pneumatic Droplet Manipulation Platform\nNote: The PDMS-based droplet manipulation platform comprises two components: a PDMS membrane (100 µm) with a super-hydrophobic surface and an air-channel layer (5 mm). Without a MEMS process, the common machining processes were utilized to fabricate this device, which includes computer-numerical control (CNC) micromachining for making a mold, PDMS casting and replication for rapid prototyping of the microfluidic components, and laser micromachining for the fabrication of a super-hydrophobic surface (see Figure 3).\nUse the CNC machine equipped with a drill bit (0.5 mm) to produce PMMA-based master molds (see Figure 3) with microstructures. Use a feed speed of the drill bit 7 mm/sec and a rate of rotation 26,000 rpm. Use an air blower and DI water to remove the PMMA scrap and to clean the surface of the master molds.\nPrepare a mixture of the PDMS base and the curing agent in ratio 10:1. Degas the mixture inside a desiccator for 30 min, or until all air bubbles are removed.",
    "Pour the PDMS into the master mold and bake the PDMS for 3 hr at 60 °C in the oven to obtain the inverse microstructures of the air chambers (PDMS membrane) and air channels (PDMS layer).\nRemove the PDMS layer from the master mold (by hand). Punch holes on the PDMS layer for air-suction inlets.\nPut the PDMS membrane, the PDMS layer and the glass substrate into the chamber of the oxygen-plasma treatment system. After oxygen-plasma treatment, bond the PDMS membrane, the PDMS layer and the glass substrate together on a hotplate (90 °C) for 10 min.\nPut the composite chip into the laser-cutting machine (PDMS membrane side up). Import the .dwg file to define the superhydrophobic area (15 mm × 12 mm). See Figure 3. Directly engrave the PDMS membrane with a CO2-laser machine to create the superhydrophobic area on the PDMS membrane (power 12 W, scanning velocity 106.68 mm/sec).\nClean the superhydrophobic surface with DI water to wash away the carbonized residues on the surface.\nConnect the air-suction inlet and vacuum pump through a solenoid valve (see Figure 4). Connect the solenoid valve to the computer and control with a digital I/O USB module.\n3. Operation for Detection of MNP on the Pneumatic Platform\nNote: This section describes the operation to identify colorimetrically and rapidly the MNP on the pneumatic droplet manipulation platform (see Figure 5). All steps take place at 23 °C (ambient temperature) and relative humidity 85%.\nPlace the target DNA sample droplet (10 µl, 0.5 µM) on the superhydrophobic area of the pneumatic droplet manipulation platform.\nPlace the AuNP probe droplet (10 µl, 25 nM) on the superhydrophobic area of the pneumatic droplet manipulation platform.",
    "Control the air suction to cause the deflection of the PDMS membrane with a solenoid valve and a simple program (e.g., Labview). Provide air suction in each air chamber along the migration path of the droplets (containing target DNA and AuNP probes respectively) on the PDMS membrane such that the droplets collide with each other and coalesce. Use a working pressure of the vacuum pump of -80 kPa (gauge pressure).\n\t\nAlternatively, control the air suction manually as long as the droplet is fully mixed. By hand, connect or disconnect the vacuum pump and inlets of air chamber with tubes in the early stages of testing.\nControl the air suction to roll the coalesced droplet forward and backward to enhance the mixing efficiency for 3 min using the controlling system of the solenoid valve. The target DNA and AuNP probes become well mixed and hybridized within 3 min. Use a driving frequency and a working pressure of 5 Hz and -80 kPa (gauge pressure), respectively.\nPlace a droplet containing NH2OH (2 µl, 400 mM) and HAuCl4 (2 µl, 25.4 mM) on the superhydrophobic area of the pneumatic droplet manipulation platform.\nControl the air suction (-80 kPa gauge pressure) to let the droplets collide with each other and coalesce. Then control the air suction (5 Hz and -80 kPa gauge pressure) to let the coalesced droplet roll forward and backward to enhance the mixing efficiency for 1 min.\nMeasure and record the color of the coalesced droplet with the naked eye.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}