{
  "id": 18934,
  "origin_website": "Jove",
  "title": "MR Molecular Imaging of Prostate Cancer with a Small Molecular CLT1 Peptide Targeted Contrast Agent",
  "procedures": [
    "Protocol adapted from a prior study11.\n1. Conjugation of Gd-DOTA to CLT1 Peptide\nUsing standard solid-phase peptide   synthesis, synthesize CLT1 peptide (CGLIIQKNEC) from Fmoc-protected amino acids on a 2-chlorotrityl chloride resin (1.0 mmol).\nAfter adding final amino acid, cyclize the linear peptide on-resin with thallium(III) trifluoroacetate (1.09 g, 2.0 mmol, 2 equivalents) in DMF (20 ml) at 0 °C for 2 hr.\nNext, conjugate PEG and lysine sequentially to the N-terminus of CLT1 peptide (1.0 mmol) on resin by reacting sequentially with Fmoc-NH-PEG-COOH (3.0 mmol), Fmoc-Lys(Fmoc)-OH (3.0 mmol), and a second batch of Fmoc-Lys(Fmoc)-OH (6 mmol).\nRemove Fmoc with piperidine. Add DOTA-tris(t-Bu) (4.58 g, 8.0 mmol, 2 equivalents to each amino group) to react with the four free amines from the lysine dendrimer on the resin for 2 hr.\nFinally, cleave and deprotect the product from the resin by treating with a cocktail of trifluoroacetic acid, water, and triisobutylsilane (TIS) (20 ml, 95/2.5/2.5) for 8 hr at RT. Remove the resin by filtration followed by washing with trifluoroacetic acid (TFA). Add the combined filtrates dropwise to cold ethyl ether (200 ml), centrifuge, and wash with ethyl ether 4x. Dry under vacuum to give a colorless solid (1.99 g, 61% yield).\nPurify the crude product with preparative HPLC using a gradient of 0-40% solvent B (0.1% TFA in acetonitrile) in solvent A (0.1% TFA aqueous solution) for 20 min and 40-90% solvent B in solvent A for 10 min.\nDissolve CLT1-dL-(DOTA)4 (250 mg, 0.077 mmol) in DI water (15 ml) and adjust the pH to 6 using 1 M NaOH. Add Gd(OAc)3.4H2O (472 mg, 0.462 mmol, 1.5 equivalents to DOTA monoamide) in portions to the solution, while maintaining the pH at 6 using 1 M NaOH. Stir the reaction solution at RT for 48 hr.",
    "Complex the residual Gd(III) with ethylenediaminetetraacetic acid (EDTA) (90 mg, 0.31 mmol), and purify the crude product with a size exclusion column to give the final product CLT1-dL-(Gd-DOTA)4 (169 mg, 57%).\n2. Characterization of Contrast Agents\nMeasure Gd(III) content with inductively coupled plasma-optical emission spectroscopy.\nAcquire matrix-assisted laser desorption/ionization time-of-flight (MALDI-TOF) mass spectra in linear mode with 2,5-dihydroxybenzoic acid (2,5-DHB) as a matrix.\nMeasure relaxation times of the aqueous solution of the contrast agents of CLT1-dL-(Gd-DOTA)4 and a nontargeted control agent sCLT1-dL-(Gd-DOTA)4 with different concentrations at 60 MHz (1.5 T) with a relaxometer at 37 °C. Use an inversion-recovery pulse sequence to measure T1 and a Carr-Purcell-Meiboom-Gill sequence with 500 echoes to measure T2. Calculate T1 and T2 relaxivities of the agents from the slopes of the plots of 1/T1 and 1/T2 versus the Gd concentrations.\n3. Cell Culture and Development of Animal Model with Orthotopic PC3 Prostate Tumor\nCulture PC3 prostate cancer cells with constitutive expression of green fluorescence protein (GFP) in RPMI medium supplemented with 5% fetal bovine serum and penicillin/streptomycin/fungizone, harvest by trypsinization and resuspend at density of 2.5 x 104 cells/μl PBS.\nMaintain male NIH athymic nude mice (4-5 weeks old) at the Athymic Animal Core Facility, Case Western Reserve University (CWRU) according to an animal protocol approved by the CWRU Institutional Animal Care and Use Committee.\nThe surgical surfaces were sprayed with 2% chlorhexidine solution and then covered with absorbent drapes. Sterile surgical gloves were worn during the procedure. Before animal surgery, i.p. inject Avertin (250 mg/kg) to anesthetize the mice. Alternatively, ketamine/xylazine /acepromazine can be used at a concentration of 50/5/1 mg/kg. Ophthalmic ointment was applied to the mouse to maintain adequate moisture during the anesthesia.",
    "Start the surgery by cutting a small incision through the skin and peritoneum along the lower midline at a length of about 1 cm using a sterile scalpel. A sterile surgical drape was covered around the incision site during survival surgeries.\nGently exteriorize and stabilize the prostate dorsal lobes to expose the prostate. Inject the suspension of PC3-GFP cells in PBS (20 μl) into the prostate with a 30 gauge needle. Finally close the incision with wound autoclip12.\nFor post-procedure monitoring, monitor animals twice per day for 1 week. Signs of illness include lack of eating, dark urine collecting around urethra, and unsteady gait which could indicate infection or occlusion of the bladder in the staples.\nAfter 10 days, remove the staples using a staple remover. Monitor the animals daily to assess tumor size and any evidence of pain such as weight loss, behavioral deviations, and motor defects. Euthanize the animals which showed a tumor size exceeding the ethically allowed limit or evidence of pain during tumor growth.\n4. Confirmation of Tumor Binding Specificity of the Peptides with Fluorescence Imaging and Histology\nAfter tumor cell inoculation, allow approximately 4 weeks of tumor growth before beginning with the imaging. Prior to injection of the peptide probes, acquire GFP fluorescence images with live mice on a fluorescence imager to verify the presence of tumor.\nI.v. inject Texas Red labeled peptides to the tumor bearing mice at a dose of 10 nmol/mouse.",
    "Sacrifice the mice 2 hr later by cervical dislocation, collect the tumor and major organs, and immediately image on a fluorescence imager. Use green light filters for GFP (excitation: 444-490 nm; emission: 515 nm long-pass filter; acquisition settings: 500-720 in 10 nm steps) and red light filters for Texas Red (excitation: 576-621 nm; emission: 635 nm long-pass filter; acquisition settings: 630-800 in 10 nm steps). 10 msec exposure time for GFP and 150 msec for Texas Red.\nImmediately after measurement of whole tissue fluorescence, collect tumor tissues, fix with formalin, and cryosection into 5-μm slices.\nAfter rinsing with PBS, mount with 1 drop of mounting medium containing 4',6-diamidino-2-phenylindole (DAPI), image immediately on a confocal laser scanning microscope.\n5. Magnetic Resonance Imaging (MRI)\nApproximately 4 weeks after tumor cell inoculation, allow the tumors to grow up to 0.3-0.6 cm in diameter. Use a 7 T MRI scanner with a volume radio frequency (RF) coil for MRI study.\nAnesthetize the mouse with a 2% isoflurane-oxygen mixture in an isoflurane induction chamber. Ophthalmic ointment was applied to the mouse to maintain adequate moisture during the anesthesia.\nInsert a 30 gauge needle into a 1.0 m long tubing filled with heparinized saline. Place the self-made catheter in the mouse tail vein.\nPlace the mouse into the magnet and keep under inhalation anesthesia with 1.5% isoflurane-oxygen via a nose cone.\nPlace a respiratory sensor connected to a monitoring system on the abdomen to monitor rate and depth of respiration. Maintain the body temperature at 37 °C by blowing hot air into the magnet through a feedback control system.",
    "Begin with sagittal section images using a localizing sequence to identify the tumor location (TR/TE = 200/3.7 msec, FOV = 3.0 cm, slice thickness = 2.2 mm, slice number = 16, average = 2, flip angle = 45°, matrix = 128 x 128).\nUse a 2D T1-weighted gradient fat suppression sequence to acquire 2D axial images for CE-MRI (TR/TE = 151.2/1.9 msec, FOV = 3.0 cm x 3.0 cm, slice thickness = 1.2 mm, slice number = 12, average = 1, flip angle = 80°, matrix = 128 x 128).\nAfter pre-injection baseline MR image acquisition, begin to inject the targeted agent or control agent at a dose of 0.03 mmol Gd/kg by flushing with 200 μl of saline.\nContinue to acquire CE-MRI images at different time points for up to 30 min.\n6. Image Processing and Analysis\nUse imaging software for image analysis.\nDraw the regions of interest (ROIs) over the whole tumor and the kidneys in the two-dimensional imaging plane and measure average signal intensity.\nTo quantify the CE-MRI data, measure tumor or kidney contrast enhancement (ΔSNR) by calculation of the increase in post-contrast SNR over pre-contrast SNR using the following equation: ΔSNR = (St/σt) - (S0/σ0), where S0 and St denote the signal in the tumor or the kidneys before and after contrast, and σ0 and σt are the standard deviation of noise measured from the background air before and after contrast.\nCalculate the p values using the student's two-tailed t-test, assuming statistical significance at p<0.05.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}