{
  "id": 4938,
  "origin_website": "Bio",
  "title": "Analysis of Starch Synthase Activities in Wheat Grains using Native-PAGE",
  "procedures": [
    "Prepare 8% Native-PAGE gelsPreparing gel cassettesBoth commercial cassettes and self assembled cassettes with glass plates can be used. If not using commercial cassettes, glass plates, 1 mm spacers and combs need to be thoroughly cleaned with MilliQ water and then with 70% ethanol (use of 1 mm gels gives better resolution than 1.5 mm gels). Glass plates need to be secured with clamps - don’t take clamps past inside of spacers. The bottom of plates is sealed by standing plates in molten 1 ml of 2% agarose in 0.3 M Tris/HCl, pH 8.8 poured onto Glad-wrap.Preparing separating gel layer (8% Native-PAGE) as Table 1First dissolve 34.5 mg glycogen from oyster in 3.473 ml water (for 1 gel) or 69 mg glycogen in 6.945 ml water (for 2 gels) in a 15 ml blue cap Falcon tube.Add 1 M Tris/HCl, pH 8.8 and 40% acrylamide (37.5:1).Degas the gel solution for 5 min to remove air using water tap vacuum.Add TEMED and 10% APS.Table 1. Chemicals and solutions for separating gelstable:\n﻿0,1,2\n,1 gel (7.5 ml),2 gels (15 ml)\nGlycogen from oyster,34.5 mg,69 mg\nH2O,3.473 ml,6.945 ml\n\"1 M Tris/HCl, pH 8.8\",2.475 ml,4.95 ml\n40% acrylamide (37.5:1),1.5 ml,3 ml\nAdd items below last for polymerizing gel,,\nAdd items below last for polymerizing gel,,\nTEMED,7.5 μl,15 μl\n10% APS,45 μl,90 μl",
    "Notes:*Tips and tubes used for acrylamide solution need to be discarded in the acrylamide waste bin for toxic waste management.10% APS: Make 500 μl solution and aliquot to 65 μl per tube and store at -20 °C. Take one tube out of -20 °C freezer each time to use. The same tube should only be used for 1 week after thawing and storing at 4 °C. Discard the tube more than 1 week after thawing. Pour the gel mix into the cassette to 1-1.5 cm below the bottom of the comb using 1 ml pipette. Add 0.5 ml of isopropanol on the top of the gel mix inside of the cassette to level the top of the gel and to aid in the gel polymerisation. Leave the gel mix for polymerisation for ~30 min at room temperature.Before adding stacking gel layer, pour off isopropanol and wash at least twice with MilliQ H2O. Carefully wipe MilliQ H2O between the two plates with a Kimwipe to remove as much excess MilliQ H2O as possible without touching the gel.Preparing stacking gel layer Make stacking gel mix in a 15 ml blue cap Falcon tube as Table 2.Table 2. Solutions for stacking gelstable:\n﻿0,1,2\n,1 gel (2.5 ml),2 gels (5 ml)\n0.5 M Tris/HCl (pH 6.8),650 μl,1.3 ml\n40% acrylamide (37.5:1),285 μl,570 μl\nH2O,1.5475 ml,3.095 ml\nAdd items below last for polymerizing gel,,\nAdd items below last for polymerizing gel,,\nTEMED,2.5 μl,5 μl\n10% APS,15 μl,30 μl",
    "Pour the stacking gel into the cassette and add a comb. If pouring more than one gel, add the comb to the stacking gel of the first gel poured before pouring the second gel. Leave the stacking gel mix for another ~30 min for polymerization.If it has been planned to run the gel the next day, the gel needs to be covered with Glad-wrap and stored at 4 °C.Prepare protein samplesProtein extractionThe following steps for protein extraction need to be processed on ice or 4 °C to avoid protein degradation. Take 1-2 developing endosperms (12 to 15 days after anthesis) and place in an Eppendorf tube, and then weigh. Add 100 μl of extraction buffer (see Recipes) per 100 mg tissue.Grind seeds to a pulp using an epipestle, spin at 14,000 x g for 15 min at 4 °C.Transfer supernatant into a new Eppendorf tube.If sediment materials are mixed with supernatant, spin for 5-10 min at 4 °C again and transfer supernatant into another new Eppendorf tube.Protein quantificationPrepare a protein concentration standard curvePrepare BSA solution (0.25 mg/ml) by diluting BSA solution (1 mg/ml) in a ratio of 1:4 with MilliQ H2O.Construct a standard curve for protein concentration using BSA (0.25 mg/ml) as in Table 3 for 1 ml cuvette or Table 4 for 96 well UV microplate.Table 3. Preparation of protein standards for 1 ml cuvettetable:\n﻿0,1,2,3\n\"Protein concentration (μg/1,100 μl)\",BSA volume (μl),H2O (μl),Coommassie plus protein assay reagent (μl)\n0,0,100,900\n5,20,80,900\n10,40,60,900\n15,60,40,900\n20,80,20,900\n25,100,0,900\nTable 4. Preparation of protein standards for 96 well UV microplatetable:\n﻿0,1,2,3\nProtein concentration (μg/220 μl),BSA volume (μl),H2O (μl),Coommassie plus protein assay reagent (μl)\n0,0,20,180\n5,4,16,180\n10,8,12,180\n15,12,8,180\n20,16,4,180\n25,20,0,180",
    "Preparation of samplesFor 1 ml cuvette, add 3 μl of sample to 97 μl H2O and 900 μl of Coomassie Plus Protein Assay Reagent.For 96 well plate, add 1 μl (or less) of sample to 19 μl H2O (or more) and 180 μl of Coomassie Plus Protein Assay Reagent.Measure the protein absorbance with a spectrophotometer for cuvettes or a microplate reader for 96 well UV microplateAssay protein standards and samples on a spectrophotometer or a microplate reader.Read absorbance at 595 nm.Match absorbance against a standard curve. Divide μg in sample by number of μl added, in this case 3, to give final concentration in μg/μl.Check that color falls within color range of standards. If not, reduce or increase amount of sample accordingly.Store protein samples by freezing samples in liquid nitrogen and storing at -80 °C.Notes:Read absorbance for protein standards and samples at the same time.Construct protein standard curve in Excel as Figure 1:Construct scatter chart.Select data in the Excel sheet, click “Insert” tab, then “Charts” tab, click “Scatter” icon, and add “Trendline”.Under the Type tab, select “Linear”.Check “Set Intercept = 0” and check “Display equation on chart” and “Display R-squared value on chart”.Use the equation to determine protein content of samples (Don’t forget to divide by the number of μl of sample added to give concentration in μg/μl).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160119/20160119224308_1151.jpgFigure 1. A standard curve for measuring protein concentration using BSA as protein standard. The X-axis is the protein concentration and the Y-axis is the absorbance measured at 595 nm.Gel electrophoresisAssemble gels.Pour 800 ml 1x electrophoresis buffer into gel tank. Add the loading buffer to protein sample solution on ice.Perform following steps in fume hood:To each 100 μl of protein sample solution, add:10 μl 0.5 M Tris-HCl (pH 6.8)10 μl β-mercaptoethanol5 μl 0.",
    "6% bromophenol blue in 80% glycerolRe-calculate concentration to allow for addition of above denaturing buffer to proteins. New final concentration= (initial volume/final volume) x initial concentration.Load 100 μg total protein for each sample in each well.If space permits, leave a lane between ladder and samples.Run gels at a maximum voltage at 100 V (or a maximum ampere at 15 mA per gel).Running gels until the bromophenol blue dye reaches the bottom of the gel.Assay starch synthase activityPrepare starch synthase assay buffer as Table 5.Table 5. Starch synthase assay buffertable:",
    "﻿0,1,2,3\n,10 ml,15 ml,Note\n10x Tris-Glycine (10x running buffer),1 ml,1.5 ml,\n2 M (NH4)2SO4,667 μl,1 ml,\n2 M MgCl2,37μl,55 μl,\nBSA (dried),6.7 mg (0.0067 g),10 mg (0.010 g),\nβ-mercaptoethanol,47 μl,70 μl,\n360 mM ADPG (-20 °C),34 μl,51 μl,Add last as it goes off quickly\nH2O,8.22 ml,12.32 ml,\n table:\n﻿0,1\n2 M MgCl2,2 M (NH4)2SO4\nMW=203.3 g 2 M= 4.066 g/10 ml,MW= 132.13 g 2 M= 2.643 g/10 ml\nNote: 360 mM ADPG needs to be kept as 34 μl aliquot and kept at -20 °C. Take out one tube for each gel from freezer before use.Incubate the gel(s) with starch synthase assay buffer overnight at room temperature (~22 °C).Wash gel(s) two times with MilliQ H2O.Stain gel(s) with iodine solution (containing 2% KI, 0.2% I2) until brown bands appear as Figure 2, usually about 10 min. Change iodine solution after 10 min if necessary.The gels can be kept in iodine solution if needed."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}