{
  "id": 8422,
  "origin_website": "Jove",
  "title": "Quantitative Approaches for Scoring in vivo Neuronal Aggregate and Organelle Extrusion in Large Exopher Vesicles in C. elegans",
  "procedures": [
    "1. Strains useful for exopher detection\nSelect a strain that expresses fluorescent cargoes within the neurons of C. elegans to readily visualize exophers.\n\tNOTE: Table 1 lists strains that have been used to visualize exophers produced in touch receptor neurons5,11,12. In principle, any cell or neuronal type can be tested for exopher production by using a cell or tissue specific promoter to drive expression of a fluorescent protein that aggregates or is otherwise selected for extrusion.\nAlternatively, use a dye-filling assay to visualize exophers in the amphid head neurons, which are open to the environment and amenable to backfilling5,13.\n2. Growth media\nPrepare standard nematode growth media (NGM) to culture strains according to standard methods14,15.\n\tNOTE: Lack of food, or fluoro-deoxyuridine (FuDR), used commonly to block progeny production, and can dramatically affect exopher production. Keep the population continuously fed (avoid even short periods of bacterial food exhaustion) and maintain animals at a constant temperature.\n3. Animal husbandry critical for consistent exopher production\nRaise animals on consistent media and with consistent bacterial food sources. Animals must not run out of bacterial food, even for short periods of time since food limitation can dramatically change exopher production levels.\nKeep media recipes and preparation uniform throughout a study.\n\tNOTE: Changing media can affect basal levels of exopher production. Agar batches can influence baseline exopher levels, so when supply lots change, make a note of the date. Throw out stock plates after two weeks to ensure healthy bacterial food and to prevent dried agar, which causes changes in agar osmolarity that influence exopher levels.\nFor basal conditions, keep animals at a constant temperature of 20 °C. Rearing animals at variable temperatures (even temporary changes in temperature) can cause variations in the timing of maximal exopher production.",
    "NOTE: Temperature variability is not limited to culture conditions. Temperatures variations during experiments or at the lab bench can be impactful. For example, temperatures within a microscope room should not differ dramatically from the culture incubator or lab bench.\nDo not use pharmacological anti-fertility interventions because fertilized eggs are critical for early adult production of exophers.\n\tNOTE: Use of Fluoro-deoxyuridine (FuDR)16 or C2217, must be avoided. When performing life-span or old-aged animal experiments, age-synchronized populations should be maintained by physically removing adults from their smaller progeny by picking them onto fresh plates spread with bacteria rather than using common pharmacological anti-fertility interventions.\nDo not use contaminated cultures; reinitiate experiments in the event of biological compromise of the population or the plate. Bacterial or fungal contamination can induce stresses and metabolic changes in animals and must be absent from experimental populations.\n\t\nTo maximize reproducible results, maintain cultures for at least two healthy, well-fed, contamination-free generations at 20 °C before experimentation to avoid potential environmentally-induced epigenetic changes.\n4. Age synchronization for exopher scoring by bleaching, sucrose flotation, or L4 larvae picking\nKeep experimental populations the same biological age, as exopher detection patterns vary with adult age and comparison of animals of mixed age populations can confound results. Always ensure successful synchronization of experimental animal populations by checking for the “white crescent” vulva morphology at the L4 stage.\n\tNOTE: Generally, peak exopher production for C. elegans mechanosensory ALMR neurons occurs on adult day 2-3 (Figure 3D), as measured from days post L4 stage. Adult day 1 is 24 hours after the L4 larval stage that is distinguished by “white crescent” vulva morphology (Figure 5E).\nPrepare synchronized egg populations by bleaching gravid adults.",
    "Collect gravid adults filled with eggs by washing animals growing on an NGM plate. To wash, flood the plate with 1 mL of M9 buffer, pipet up and down to collect liquid with suspended animals and pipet into a 1.5 mL microcentrifuge tube. Pellet animals by gravitational settling or gentle centrifugation with a mini centrifuge and remove the supernatant.\nAdd 150 µL of 5M NaOH and 150 µL of 6% sodium hypochlorite (bleach) in 1 mL in H2O and mix by inversion for approximately 5 minutes.\n\t\tNOTE: Fresh bleaching solution ensures that the animal cuticle can be disrupted for egg-harvest. Progress in disrupting the cuticle can be monitored under a dissecting microscope; adults should break and release eggs at the point that bleaching should be stopped.\nGently centrifuge with a minicentrifuge tube for 20 s and remove the supernatant. Add 1 mL of M9 buffer and centrifuge again, leaving about 100 µL on top of the pellet.\nRepeat steps 4.2.3 twice to remove traces of bleach solution. \nResuspend the eggs in the remaining volume and transfer to a fresh seeded NGM plate. Adults will be lysed, but many viable eggs should be in the preparation.\nPrepare synchronized populations by timed egg-lay. \n\t\nPick 20 gravid adults to a seeded NGM plate using standard transfer protocols14. \nAllow animals to freely crawl and lay eggs for 1.5 h (mutant strains with low brood sizes may require the introduction of more adult animals).\nRemove all adult animals from the plate by picking, leaving the synchronized egg population behind. Check plates a few hours later to verify that no viable adults have been missed during adult removal. \nPrepare synchronized egg populations by sucrose flotation selection of eggs.",
    "Collect animals and eggs from five NGM plates upon which gravid animals have been laying eggs for at least 24 hours by flooding plates with M9 solution with 0.1% detergent (such as Tween 20 or Triton X-100) and collecting into a 15 mL tube. Pellet adults by gentle centrifugation at room temperature (2,000 x g for 30 s).\nRemove supernatant and wash animals in 15 mL of fresh M9 three times, discarding the supernatant after each wash, being sure to keep the pellet enriched in animals and eggs.\nRetain 2 mL of supernatant and resuspend the pellet. Add 2 mL of 60% weight by volume sucrose.\nCentrifuge at 2000 x g for 5 min. The solution will now display an upper phase highly enriched in eggs.\nTransfer about 2.5 mL of the upper phase to a new 15 mL tube and add 10 mL of M9.\nMix by inversion for 1 min, and then centrifuge 2000 x g for 1 min.\nRemove the supernatant and wash the egg-enriched pellet in M9. 10-15 µL of the egg-pellet can be distributed to a fresh OP50-seeded NGM plate.\n\t\tNOTE: This method prepares a great number of eggs; do not allow collected animals to run out of OP50 E. coli food.\nPrepare synchronized populations by picking animals at the L4 stage of development.\n\t\nGrow animals on seeded NGM plates as described above.\n\t\tNOTE: C. elegans develop in four discrete stages. At 20 °C, a newly laid egg takes about 9 hours to hatch (Figure 5A). Post hatch, an animal passes through larval stage 1 (L1) to larval stage 4 (L4), with each stage lasting 8-12 hours between each molt (Figure 5A-F). Therefore, a plate prepared by inoculating with eggs should have many L4 animals to pick about 40 hours after eggs are introduced.",
    "Identify L4-staged animals by locating the white half-moon crescent shape of the developing vulva (Figure 5E).\n\t\tNOTE: Animals at the L4 stage are uniform in size and in body pigmentation. Pick animals with the white crescent to a fresh growth plate for examination of staged animals. The following day (~ 24 hours later) should be counted as adult day 1.\nScore a population of animals daily on adult day 2.\n\t\tNOTE: Exophers are typically scored at day 2 of adulthood, which is the peak exopher production under basal conditions. However, because the exophergenesis peak and timing may be shifted by environmental or genetic changes that are being studied, it is advised to score a population of adult animals daily over four days to generate the most comprehensive picture (Figure 3D).\n5. Detection of exophers using a fluorescent microscope\nObserve exophers using a high-magnification pseudo-stereo dissecting microscope that is outfitted for fluorescence microscopy.\nImmobilize animals on NGM plates by pipetting 100-200 µL of 10-100 mM levamisole/tetramisole solution onto the NGM agar plate surface. After 2-4 minutes, the animals become paralyzed and can be observed directly on the agar plate.\n\tNOTE: Immobilization treatments are not absolutely required, such that with a trained eye, neuronal identification and exopher presence can be scored by visually following crawling animals under the microscope on the plate when determining whether or not an exopher has been produced.\nObserve fluorescent neurons using a total magnification of 100x to accomplish dissecting microscope detection of exophers.\n\tNOTE: Scoring exopher events using dissection microscopy allows for the observation of large numbers of animals with relative ease directly on the agar plates on which they are reared.\nLive imaging and mounting reporter strains for exopher studies using confocal microscopy\n\t\nUse a confocal microscope to live-image intracellular dynamics and characteristics of exophergenesis.",
    "NOTE: Live imaging is an advantageous approach for observing subtle details of exopher production because exopher production is a dynamic process.\nRestrict animal movement for high resolution live imaging using convenient methods, including utilization of levamisole or tetramisole at 10-100 mM or the application of hydrogel polystyrene microbeads (with diameters of 15 µm, 30 µm or 40 µm)18.\nSlide preparation for compound and confocal microscopy\n\t\nMount 20-50 animals into an immobilizing agent on a microscope slide. Reusable ringed cytology slides painted with 13 mm diameter raised-rings are useful for mounting.\nPick live animals into 5-20 µL of a paralytic such as 10-100 mM levamisole or tetramisole within the painted circle or on the agar pad.\nWait 4 minutes for paralysis, and then cover the slide with a coverslip (recommend No. 1½ (0.16 – 0.19 mm) or No. 2 (0.17 - 0.25 mm).\nMounting small numbers of animals\n\t\nDo not crush mounted animals; when observing only a few (less than 20) animals per slide, there is a risk of crushing some of the animals due to unequal pressure of the coverslip. This risk can be minimized by using a low percentage agarose pad for mounting.\nMake a 2-4% agarose pad slide, and then add 2-15 µL of paralytic solution to the pad. Keep in mind levamisole and tetramisole diffuse into the pad, decreasing their effective concentration.\nMount by picking animals into a 2-15 µL drop of paralytic solution or microbeads resting on the agar pad. Place the coverslip on top and check that the animals are intact18.\nAgar pad preparation\n\t\nTo prepare 2% agar pads, heat 2% agarose in M9 solution and microwave until the agarose is in a homogeneous and molten state.",
    "To achieve an agar pad of sufficient quality, alternate mixing and microwaving at low power for less than 20 seconds. Avoid the inclusion of air bubbles within the pad by placing boiling agar on a heating block and allowing the bubbles to rise to the surface.\nUse a Pasteur pipette to draw agar from deep within the molten solution below the risen bubbles.\nPrepare two taped slides and place on either side of a clean glass microscope slide upon a flat surface. To make the taped slides place two 5 cm strips of laboratory tape upon each slide (Figure 6A).\nUsing a Pasteur pipet, place a single drop of agar upon the clean microscope slide sandwiched between the taped slides (Figure 6B).\nCarefully and quickly, cover the drop of molten agar with a fourth clean slide by placing in across the taped slides (Figure 6Cc).\n\t\tNOTE: The slide should gently press the molten agar into a flattened circle about 0.4 mm thick (the thickness of the tape) (Figure 6D). The agar should quickly cool.\nRemove the top slide by sliding it off (Figure 6E). Agar pads dry quickly and are best used within minutes. Once the top slide is removed, use the gel pad immediately for mounting animals. Avoid using pads with air bubbles.\nStore agar pads up to 30 minutes encased between the two glass slides. Dried agar causes animals to clump together and desiccate. Mount animals within 2-15 µL of paralytic solution or microbeads and cover with coverslip; screen the slide within 20 minutes of paralysis and mounting (Figure 6).\n\t\tNOTE: Because stress conditions can alter exopher rates, avoid paralytics that can induce oxidative stress (ex: sodium azide) when screening for exophers.\nDetection of exophers using a spinning-disk confocal microscope",
    "Observe cell biological features such as organelles and other contents with 1.4 numerical aperture objectives at 63x and 100x.\nUse software capable of stage-control and image acquisition utilizing the multidimensional acquisition. Microscopes and image processing software should also be suitable for imaging and data collection as these steps involve standard imaging approaches. \n6. Identifying touch neurons and scoring for exophers with mounted animals\nMount paralyzed adult animal (Figure 6).\nIdentify the desired Z-plane. Use low magnification bright-field (10-40x) to identify the suitable Z-plane of the animal, taking note of the positioning of the animal, head-tail orientation, and location of the vulva - which are landmarks for later neuronal and exopher identification (Figure 3A & Figure 5E).\nFocus on the fluorescence signal of the chosen reporter. Staying in the same Z-plane, switch to widefield fluorescence viewing at 10-40x for the chosen cytosolic reporter.\n\tNOTE: In this example fluorescent expression is driven by the mec-4 mechanosensory touch neuron-specific promoter. High copy arrays, and different fluorophores have variability in expression and therefore variable fluorescent intensity. Adjust if needed.\nScroll within the Z axis to observe the depth of the animal and fluorescent expression in the focal plane. While doing so, confirm the head-tail orientation; the head/pharynx will have the fluorescent nerve ring and in this case, the tail will contain 1-2 visible PLM somas (Figure 3A).\nIdentify touch neurons \n\t\nIdentify whether the animal is mounted on the left or the right side (Figure 3A).\n\t\tNOTE: Considering the 3-dimensionality of the animal, the best imaging resolution is accomplished on the side closest to the optics.\nIdentify the soma (ALM, ALMR, AVM) by observing - start at the head to identify the nerve ring and lateral neuronal processes.\nAt 10-40x magnification, slowly scroll through the Z-axis to identify the attached process.",
    "Once the process is identified, follow it laterally in the posterior direction towards the vulva, where the soma will be apparent, marked by a round cell body at the end of the process. Once the most in-focus neuronal soma is found, it can be identified by using other neuronal landmarks as follows:\nUse the AVM, a nearby ventral neuron, to help assign animal orientation. If the AVM neuron is in the same plane as the ALM then the animal is resting upon its side and the neuron outside that plane is the ALMR . If the AVM neuron is not in the same plane as the ALM in question, the closest touch neuron to the focal plane is ALML.\nIdentify the PVM neuron, another ventral touch neuron located near the tail, to indicate whether the anterior touch neuron is in the same plane. If so, the touch neuron observed is ALML. \nGet a sense of the position of other soma bodies, near the area of interest (fluorescent neurons located on either side of the soma), and in all Z-planes, even if it is not possible to get the deepest neuron set in clear focus.\n\t\tNOTE: The identification of all touch neuron somas is important because out-of-focus soma can be mistaken for exophers. \n7. Identifying and scoring for exophers\nOnce a touch neuron is found, inspect it for large protrusions (exopher domains) large enough to be considered a bud exopher, (reaching at least 1/5th the size of the originating soma) (Figure 1C).\n\tNOTE: The average exopher measures around 2-8 µm in diameter, while the average soma of a (ZB4065 bzIs166[Pmec-4::mCherry]) animal measures 6-10 µm in day 2 adults (Figure 7B).",
    "If no bud or exopher domain is observed, inspect the neuronal soma for an attached thin filament emanating from the soma. Attached exophers tend to be located closer to the originating soma and in a similar Z-plane. \n\tNOTE: Exophers do not always remain attached to the soma. The detection of an attached filament is a definitive indication that the object is an exopher.\nTo identify an unattached exopher, look for the contents of an exopher. Exophers can concentrate expelled fluorescent proteins and are therefore often brighter than the soma.\n\tNOTE: The contents of exophers are heterogeneous and variable. Cellular organelles such as lysosomes and mitochondria can also be extruded within exophers (Figure 4C-E).\nLook for unattached exophers in different focal planes than the plane in which the originating soma was found. Although exophers have been seen to protrude from the ALM soma in any direction, it is typical that exophers protrude away from the soma, in a posterior direction from the neuronal process. \nCheck for large, spherical objects that are not positioned and identified as neuronal somas. Exophers can be irregularly shaped but are typically spherical structures. Exophers become degraded over time, so older exophers tend to have a more irregular shape.\n\tNOTE: Mature or older exophers are distinguished from the dispersed \"starry night\" stage via the brighter fluorescence intensity of exophers and their spherical shape.\nInvestigate the “starry night” phenotype as evidence of earlier exophergenesis. Exophers progress into a “starry night” stage as the exopher breaks up into smaller vesicles and the surrounding hypodermis attempts to degrade the exopher contents (Figure 1G, 2B, 3B & 7A).",
    "NOTE: The starry night stage is marked by fragmented and scattered (sometimes networked) fluorescent entities that have lost structural integrity and displays a dim fluorescence in comparison to the touch neurons and exopher structures.\nLook for instances of “multiple exopher events”. Exophers are usually produced as a singular occurrence (1 exopher emanating from 1 soma) but under some circumstances more than one exopher can be released from a single soma (Figure 7D).\n\tNOTE: Mature exophers can degrade into multiple vesicles as they are degraded in the hypodermis. Distinguishing whether each exopher was generated by an independent exophergenesis event or whether one original exopher split to create an additional vesicle can only be determined by time-lapse observation.\nKeep in mind that not all morphological abnormalities mature into exophers.\n\t\nDo not score a distended soma as an exopher. An extended or pointed soma can be observed on occasion (especially with age or under stress), but an extension without a clear constriction site is not scored as an exopher.\nReject small resolved buds that do not attain 1/5th the size of the soma in exopher event quantification.\nDo not count neurite outgrowths as exophers. Mature neurites can extend dramatically with age (usually in the opposite direction of the neuronal process) and fluorescent protein can migrate into the distal end of such structures19.\n\t\tNOTE: These neurite outgrowths are not exophers as they have a distinct developmental pattern over days and weeks, do not form buds, and do not detach (Figure 7E).\nIdentify fluorescent entities that are not exophers.\n\tNOTE: It is important to get an idea of background fluorescence to ensure correct identification of the extruded fluorescent entity vs. autofluorescence.",
    "Transgenic fluorescent expression vs autofluorescence. Do not mistake autofluorescence for transgenic expression. The true exopher signal will not be in the intestine or gut (DIC confirmation can be used to identify these tissues) and exopher signal will be significantly brighter than background autofluorescence. \n\t\tNOTE: Autofluorescence is caused by gut granule intestinal fluorescent pigmentation and accumulates with age. It is heterogenous, especially as viewed with different wavelengths.\nSignal from embryos. Do not mistake embryo signal for exophergenesis. Confirm suspicions of embryo signal by switching from fluorescence to brightfield illumination and checking for associations of signal with eggs in the uterus.\nOut of plane or nearby soma bodies. Avoid mistaking an out of plane soma for an exopher by identifying all nearby soma bodies, even out-of-focus somas at the start of the observation.\n\t\tNOTE: If scoring for exophers from ALMR, identify and account for the location of AVM and ALMR somas. More details on soma body identification are described in Figure 3A.\n8. Scoring and statistics\nScore exophers as binary (yes, there is an exopher/no, there is not an exopher).\nConsider exopher detection as an \"exopher-event\" for a given neuron. An exopher event can constitute observation of a single exopher near a soma or multiple exophers.\n\tNOTE: To quantify numbers of individual exophergenesis events use time-lapse observation.\nCount exopher events per a particular identified cell because different cells do not produce exophers at the same rate (see for example Figure 3C). ALMR neurons produce the most baseline exophers in the strains described herein and thus often this is the cell selected for exopher quantification from touch receptor neurons.\nFor statistics, in general, conduct at least 3 biological trials, of at least 30 animals scored per trial with the corresponding number of observations required for analysis of the disruption.",
    "For multiple trials involving one or two mutants/treatments compared to control, the Cochran-Mantel-Haenszel test is appropriate to determine p values.\nFor trials involving more than two mutants of treatments compared to control, it is also appropriate to use a binary logistic regression analysis to evaluate significance for any number of categorical predictors."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}