{
  "id": 4612,
  "origin_website": "Bio",
  "title": "Phenol-based Total Protein Extraction from Lily Plant Tissues",
  "procedures": [
    "Lily plant tissue collectionVarious vegetative and floral organs of young lily plants, including          flower buds with a length around 4 cm were collected. The first three          whorls of young leaves around the buds, plus the entire roots          (approximately 8 cm from the apex) were also collected.Each organ was dissected from lily plants in the field and immediately frozen in liquid nitrogen and stored at -80 °C.HomogenizationWork in the fume hood. Add liquid nitrogen into a mortar (12.5 cm) and pestle and keep them frozen.Add and grind 1 g of fresh or frozen tissue into powder in the          frozen mortar and pestle in liquid nitrogen. Keep the sample frozen at          all times. Add 5 ml of water-saturated phenol and 5 ml of extraction buffer to the sample powder.Add more liquid nitrogen into the mortar for easy grinding and mixing of the plant sample. Repeat one more time.Leave the frozen sample mix in the mortar until it melts and turns into a slurry. Grind the sample mix vigorously as soon as it turns into slurry.    <p>imgsrc:https://bio-protocol.org/javascript:;</p>   Video 1. Homogenization of lily plant tissues  Transfer the melting solution into a glass beaker (25 or 50 ml in          volume) and gently mix with a stir bar for 30 min at room temperature.Phase separation-partition of protein into the phenol phase Transfer the sample mixture into a COREX® tube.Centrifuge at 10,000 rpm for 10 min at 4 °C.Transfer the upper phase (phenol phase) into a new 50 ml tube.Add an equal volume of phenol to the aqueous phase.Mix thoroughly by vigorous vortexing for 1 min.Centrifuge at 10,000 rpm for 10 min at 4 °C.Remove and pool the upper phase (phenol phase).Phase separation-repetitive removal of contaminants from the phenol phaseAdd an equal volume of extraction buffer to the pooled phenol phase.",
    "Centrifuge at 10,000 rpm for 10 min at 4 °C.Transfer the upper phase (phenol phase) into a new 50 ml tube.Protein precipitationAdd 5x volume of 0.1 M NH4OAc in 100% MeOH (cold) and mix well by vortexing for 1 min.Precipitate protein at -20 °C for 2 h or overnight (approximately 16 h) (Note 2).Centrifuge at 10,000 rpm for 10 min at 4 °C.Decant the supernatant.Protein washThe protein pellet is added with 10 ml of 0.1 M NH4OAc in 100% MeOH (cold).Wash the pellet by vigorous vortexing.Centrifuge at 10,000 rpm for 10 min at 4 °C. Repeat the washing step twice.Decant the supernatant. Add 10 ml of acetone.Centrifuge at 10,000 rpm for 10 min at 4 °C.Repeat the washing step twice.The pellet is shortly dried by speed vacuum for 30-60 sec.Dissolve the pellet in 300-500 μl (Note 3) of dissolving buffer and          mix constantly by vortexing for 30 min. If the pellet is big, break it          down into small pieces with a glass bar in order to increase protein          solubility. Centrifuge at 10,000 rpm for 10 min at 4 °C.Collect supernatant (protein). The pellet (Note 4) in the tube is redissolved in 300-500 μl of dissolving buffer.This process of protein dissolution may be repeated several times          until the concentration of protein in the dissolving buffer becomes          insignificant.The collected supernatant may be pooled together."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}