{
  "id": 17452,
  "origin_website": "Jove",
  "title": "Left Lung Orthotopic Transplantation in a Juvenile Porcine Model for ESLP",
  "procedures": [
    "All the procedures were performed in compliance with the guidelines of the Canadian Council on Animal Care and the guide for the care and use of laboratory animals. The protocols were approved by the institutional animal care committee of the University of Alberta. This protocol has been applied in female juvenile Yorkshire pigs between 35-50 kg. Pigs are pathogen-free, food-grade specimens. They are purchased from the Swine Research and Technology Centre in Edmonton, AB, Canada (https://srtc.ualberta.ca). All individuals involved in ESLP procedures had received proper biosafety training.\n1. Pre-surgical preparations and anesthesia\nNOTE: Pigs are fasted overnight prior to surgery for a maximum duration of 12 h.\nAdminister intramuscular injections of ketamine (20 mg/kg) and atropine (0.05 mg/kg) as premedication for the recipient pig in the operating room.\nPlace the pig supine on a heated operating table to maintain normothermia and proceed with mask induction.\nTitrate oxygen flow rate according to animal weight and the anesthetic system.\n\tNOTE: Oxygen flow should be 20-40 mL/kg.\nAdminister isoflurane at 4%-5% and reduce to 3% after 1-2 min.\nEvaluate the depth of anesthesia, ensure the pig has no withdrawal reflex in response to a noxious stimulus. Repeat every 5 min.\n\tNOTE: If a pain response is present, increase the percentage of isoflurane administration until the appropriate depth of anesthesia is achieved. See step 10 of this section for further details on maintenance analgesia with ketamine and hydromorphone. No paralytics are administered. This allows for assessment of a withdrawal reflex. A nose pinch is used as a noxious stimulus.\nIntubate the pig once the correct depth of anesthesia is confirmed. Use a custom 10 inch, flat blade laryngoscope and size 9 or 10 endotracheal tubes for pigs 40-50 kg.",
    "Place a pulse oximeter probe on the tongue (preferred) or ear and target an oxygen saturation above 90%.\n\tNOTE: Temperature is monitored via a nasal probe. A heating pad is used to maintain normothermia.\nTo maintain the anesthesia, adjust oxygen flow (20-40 mL/kg) and inhalant gas rate (1%-3%).\nKeep the ventilator settings at a respiratory rate of 12-30 breaths/min, TV of 6-10 mL/kg, PEEP of 5 cm H2O, and Peak Pressure of 20 cm H2O.\n\tNOTE: A standard ICU style positive pressure ventilator is used to create a closed system for anesthesia and ventilation. Vitals are continuously monitored and recorded at 15 min intervals. ABG’s are drawn every 15-60 min, depending on the stability of the animal. Although TVs are targeted as high as 10 mL/kg, 6-8 mL/kg are achieved. Figure 1 provides a schematic overview of the negative pressure ventilation (NPV)-ESLP for the transplant protocol applied in the lab.\nShave, wash and aseptically prepare the incision site using povidone iodine.\n\t​NOTE: Following sedation with Ketamine/Atropine, the analgesic regime involves administering 3mg/kg Ketamine IV q 1 h (range 1-3 mg/kg depending on patient parameters) and Hydromorphone 0.05 mg/kg IM q 2 h via a peripherally inserted IV line in an ear vein. Any longer duration between doses results in breakthrough pain response, such as elevated heart rate and abnormal breathing patterns / abdominal muscle movement.\n2. Insertion of central venous and arterial lines\nInsert a central line for fluid and heparin administration.\n\tNOTE: Total IV fluid administration is calculated to 1 mL/kg/h, and fluid boluses are administered PRN to maintain a MAP >60 mmHg. Central line is also used to administer steroids, antibiotics, vasopressors, and inotropes. See Figure 2A for line positioning.",
    "Prep the skin using a povidone iodine prep solution and allow to dry completely. Use electrocautery to make a 5-8 cm midline incision centered over the trachea and extend cranially from the sternal notch.\nDivide the skin and subcutaneous fat using cautery.\nDivide the midline plane between the strap muscles, and then divide the connective tissue layers to identify the left or right carotid intravascular bundle lateral to the trachea.\nObtain proximal and distal control of the jugular vein using silk ties (size 2-0) as vessel loops.\nTie the cranial encircling tie and retract upwards on the proximal tie to control blood flow.\nMake a small incision in the vein using Metzenbaum scissors (see Table of Materials) to accommodate a two-port, 7 Fr central line (~1/3 the vessel's circumference).\nSimultaneously, release the tension on the proximal vessel loop, cannulate the vein, and then tie down to secure the cannula in the vein at a depth of 10 cm.\nFlush the line with heparin, connect to an IV line of 0.9% normal saline, and administer fluid if the pig is intravascularly depleted from dehydration.\n\t\tNOTE: Heparin lock any unused ports.\nAdminister 500 mg of methylprednisone and 1 g of cefazolin IV.\nFollow the same techniques to cannulate the common carotid artery using a 7 Fr arterial line for accurate blood pressure management.\n3. Left lung procurement\nPosition the pig in a right lateral decubitus position.\nPerform a left anterolateral thoracotomy (Figure 2).\n\t\nPrep the skin using a povidone iodine prep solution and allow to dry completely. Mark the thoracotomy incision (20 cm) using the following landmarks: use palpation to identify the tip of the left scapula; likewise, identify the xiphoid process inferior to the sternum with palpation. Connect the two as shown in Figure 2B.",
    "Inject a total of 10 mL of 0.25% bupivacaine into the incisional line and two rib spaces above and below the incision.\nUse electrocautery to dissect the skin, subcutaneous layers, and muscle layers. The latissimus dorsi must be divided. Identify the rib immediately below the incision and cauterize on top of the rib to expose the intercostal muscles while avoiding the intercostal neurovascular bundle.\nUse a mosquito hemostat to puncture the intercostal muscles immediately above the rib, and then feel inside the chest for adhesions using a finger. Push the lung away using a Yankauer suction or finger (see Table of Materials) as you cauterize along the top edge of the rib to extend the thoracotomy.\n\t\t\nExtend the thoracotomy anteriorly until 1 inch away from the sternum. Extend the thoracotomy posteriorly to the paraspinal muscles.\nInsert a Cooley sternal retractor (see Table of Materials) to open the thoracotomy wide (10 cm) (Figure 2C). Retract the lung to expose the left hemi-azygous vein (Figure 2D).\nCircumferentially dissect the left hemiazygos vein using Metzenbaum scissors and a fine Lauer. Encircle the vessel with silk ties, and then ligate and transect it (Figure 2E). Keep a silk tie on the proximal stump for added control.\n\t\tNOTE: Lauer is a right angle clamp or a celiac clamp used for tissue dissection.\nDissect out the left pulmonary artery (PA) and left pulmonary veins (PV). Encircle the veins in silk ties for control (Figure 2F).\n\t\tNOTE: The superior PVs are very small and are suture ligated at their branch points or common trunk, depending on the individual anatomy. The left mainstem bronchus is deep to the PA and LA (left atrium), so occasionally, it cannot be dissected easily until the artery and veins have been clamped and transected (Figure 2G).",
    "Administer 5000 units of heparin IV 5 min before clamping the PA.\n\t\tNOTE: Heparin 5000 units IV is also administered 5 min before unclamping the PA. For every hour after that, 1000 units of IV heparin is administered.\nClamp the PA (DeBakey cross-clamp), left inferior pulmonary vein (Satinsky clamp), and the left bronchus (Spoon Potts clamp) individually (see Table of Materials). Decrease tidal volumes to 5 mL/kg once the left bronchus is clamped.\nTransect the PA, left inferior pulmonary vein, and the left bronchus. Leave at least 0.5 cm of tissue cuff to sew. Divide the left inferior pulmonary ligament and remove the left lung.\n\t\tNOTE: The left lung can be discarded or kept for control histology.\n4. Termination of ESLP, division of left lung, and flushing with electrolyte solution\nClamp the ventilation tubing at maximal inspiration, terminate perfusion and ventilation, and disconnect the lungs from the ESLP device.\nWeigh the lungs to determine the amount of edema formation.\n\tNOTE: Edema is tissue swelling due to the accumulation of excess fluid.\nTake a tissue biopsy of the accessory lobe, divide it into three equal pieces, and place one piece into each of the following: optimum cutting temperature (OCT) gel, formalin, and snap freeze in liquid nitrogen.\n\tNOTE: This step is typically followed in the author's lab. The samples are then stored for future analysis: OCT and snap-frozen samples are kept in a -80 °C freezer, and formalin-stored samples are placed in a properly sealed container and stored in 4 °C refrigerators. Details of the specific ESLP protocol and tissue analysis are published elsewhere16.",
    "Divide the left donor lung from the right lung. Leave 1 cm of donor PA, 1 cm of donor bronchus, and adequate donor LA cuff (~0.5 cm circumferentially) to sew to the recipient LA (Figure 2H). Leave the left inferior PV and left superior PVs in continuity with the donor LA wall to facilitate later anastomoses.\nWeigh the left lung.\nCannulate the donor left PA using a drop sucker connected to an IV line and flush 500 mL of extracellular, low potassium, dextran-based electrolyte preservation solution antegrade through the lung vasculature. Secure the cannula in the PA with a silk tie during the flush, and release when the flush is complete.\n\t​NOTE: The steps mentioned pertain to the specific ESLP device utilized for this work and may not be directly applicable to other devices.\n5. Left lung transplantation\nInsert the donor lung into the recipient's chest, beginning with the lower lobe. Do not force the lung into place.\n\tNOTE: The lower ribcage may need to be lifted upwards to accommodate the donor lung by torquing on the sternal retractor. Ideally, the recipient is a few kilograms larger than the donor to facilitate a size match.\nPerform the bronchial anastomosis first using 4-0 prolene on a TF needle (Figure 2I).\n\tNOTE: A running, end-to-end anastomosis works well. Trim any excess length from the two anastomotic ends before sewing to avoid kinking caused by redundant tissue.\nPerform the LA anastomosis second with 6-0 prolene on BV-1 needles using a running, end-to-end anastomosis. Again, trim excess tissue to avoid kinking.\n\tNOTE: The LA is friable and benefits from the small BV-1 needle. Horizontal bites on the donor may be required to purchase adequate tissue and correct the size mismatched caused by sewing the donor IPV and SPV to the recipient IPV/LA opening.",
    "Incorporate the donor SPVs into the inferior PV and LA anastomosis to allow left upper lung lobe venous drainage (Figure 2J).\n\tNOTE: The branch superior pulmonary veins (SPVs) are less than 0.5 cm in diameter. The common SPV trunk is variable in length and is not routinely present, making direct anastomosis between the donor and recipient SPVs a poor option.\nComplete the PA anastomosis with 6-0 prolene on BV-1 needles using a running, end-to-end anastomosis. Again, trim excess tissue to avoid kinking.\nRemove the bronchial clamp and increase TVs to target 10 mL/kg.\nConfirm heparinization, administer a potassium shift (40 mg of furosemide, 10 units of insulin, 100 mL of 25% dextrose solution), open the PA clamp partially, de-air, and tie the PA suture. Completely release the PA clamp after 10 min.\nMeanwhile, de-air the LA, tie the sutures, and remove the LA clamp.\nTake a reperfusion blood gas from the central line and a reperfusion tissue biopsy from the left middle lobe.\n\tNOTE: To take a tissue biopsy, use a size 0-silk tie to encircle a 1 cm portion of the middle lobe apex, tie-down to ensnare the tissue, and then cut the isolated portion with Metzenbaum scissors. Divide the biopsy into three equal portions and manage as previously described.\nPerform a left and right lung bronchoscopy to assess the bronchial anastomosis and to suction secretions. Insert a bronchoscope into the endotracheal tube using an adaptor connection.\n\t\nConnect the scope to suction. Advance the bronchoscope into the left bronchus. Inspect the bronchial anastomosis (Figure 2N). Advance the scope down the bronchioles and suction any fluid. Repeat on the right side.",
    "NOTE: Do not allow the oxygen saturation to fall below 90%. If saturations fall below this level, remove the scope and allow the pig a few minutes of uninterrupted ventilation to recover.\nInsert a 20 Fr malleable chest tube (Figure 2L), close the thoracotomy in three layers (Figure 2M), and prone the pig as soon as the arterial blood gases (ABGs) are stable (Figure 2O).\nMonitor the pig over 4 h in the prone position. Perform an ABG analysis every 30 min. Administer 1000 units of heparin every hour after reperfusion.\n\t\nTake a 10 mL blood sample every hour for centrifugation and enzyme-linked immunosorbent assay (ELISA) analysis of inflammatory markers16.\n\t\t​NOTE: Centrifugation parameters are detailed later.\n6. Isolated Left Lung Assessment\nPosition the pig supine and re-prep the sternum using povidone iodine prep solution. Perform a midline sternotomy for final isolated left lung assessment (Figure 2P).\nOpen the left pleura using Metzenbaum scissors and take a tissue biopsy from the left lower lobe as previously described (NOTE to step 5.9).\nOpen the accessory lobe pleura and dissect out the common vein using Metzenbaum scissors.\n\tNOTE: This will be clamped later on.\nTake a blood sample from the LA anastomosis using a 21 G needle. Direct the needle toward the left pulmonary veins and away from the common left atrium or accessory lobe trunk.\nOpen the right pleura to create space for the right hilar clamps (see Table of Materials). Dissect the right inferior pulmonary ligament up to the hilum. Ensure that a clamp can be placed around the hilum superiorly, inferiorly, and anteriorly.",
    "NOTE: This ensures that the hilum is occluded, and all oxygenation is dependent on the left lung. The right lung will not ventilate at this time, which should be evident by a lack of inflation/deflation with ventilator respirations. The right lower lobe can be lifted out of the chest to accomplish this.\nClamp the accessory lobe vein using a DeBakey aortic cross-clamp (see Table of Materials) to occlude any accessory lobe drainage into the LA (Figure 2Q).\nClamp the right hilium and take the following serial blood samples from the left PV anastomosis with a 21 G needle directed toward the left lung: 0 min, 1 min, 2 min, 5 min, and 10 min after clamping.\n\tNOTE: Five samples are taken to monitor for any trend in partial pressure of oxygen (PaO2) (Figure 2R). The PaO2 should remain relatively stable to represent proper left lung function. Five samples also provide insurance of a quality assessment if there is an issue with clotting of any samples or a problem arises with ABG analysis.\nTransect the anastomoses, and remove the left lung. Transect the IVC to expedite euthanasia under anesthesia via exsanguination.\n\tNOTE: Total anesthesia time for the recipient pig is 8 h.\nWeigh the donor lung to assess for edema formation and inspect it for overall appearance. Inspect the PA, bronchus, and LA cuff for signs of clot or other pathology within the donor lung and the recipient mediastinum.\nRun the final gas analyses, centrifuge the perfusate samples, and store the tissue biopsies as previously described (NOTE to step 4.3).\n\tNOTE: The centrifugation settings are: 112 x g, 9 acceleration, 9 deceleration, 4 °C, and 15 min duration.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}