{
  "id": 16721,
  "origin_website": "Jove",
  "title": "RIBO-seq in Bacteria: a Sample Collection and Library Preparation Protocol for NGS Sequencing",
  "procedures": [
    "1. Sample collection\nPrepare a bacterial culture. We recommend a culture volume of 100 mL per sample.\nPrepare equipment and reagents for sample collection: two scoopulas per sample, sterile 0.45 µm mixed cellulose esters membrane (MCE) filters, 50 mL sterile tubes, liquid nitrogen, 50 mg/mL chloramphenicol in 70% (vol/vol) ethanol (optional). Puncture the lid of 50 mL tubes to allow liquid nitrogen evaporation and prevent the explosion of closed tubes. Decontaminate scoopulas with laboratory detergent and 70% ethanol.\nPrewarm the filtering equipment and one of the scoopulas to growth temperature of the bacterial culture.\n\tNOTE: We recommend an all-glass filtration apparatus with a funnel, a fritted base, a ground joint flask and a 47 mm Ø spring clamp.\nBefore sample harvesting, add chloramphenicol into the bacterial culture to the final concentration of 100 µg/mL and incubate 1 minute (optional).\nPour liquid nitrogen into 50 mL sterile tube and place the second scoopula inside the tube to cool.\n\tCAUTION! Liquid nitrogen can cause closed containers to explode due to the pressure change upon evaporation. To prevent this, it is necessary to create a few holes in the lid of 50 mL tubes to allow liquid nitrogen evaporation.\nCollect cells by filtration. Stop filtering when medium has passed through the membrane, but do not allow the filter to dry completely.\nCollect bacterial pellets by rapidly scraping the cells off of the filter disc using a prewarmed scoopula. Immediately place the entire scoopula with the harvested cells in the 50 mL tube filled with liquid nitrogen. The harvested pellet should be completely covered in liquid nitrogen.\nLet the pellet freeze thoroughly and dislodge frozen cells using a previously cooled second scoopula. Close the punctured lid and transfer the tube to -80°C. STOP point\n\t​NOTE: Disinfect scoopulas after each sample harvesting.\n2. Cell lysis",
    "Prepare 0.1 M GMP-PNP in 10 mM Tris pH 8, DNase I and 1.5 mL reaction tubes for lysates and keep them on ice. Cool the centrifuge to 4 °C.\nPrepare lysis buffer (20 mM TRIS pH 7.6, 10 mM MgAcet, 150 mM KAcet, 0.4% TRITON X-100, 6 mM β-mercaptoethanol, 5 mM CaCl2 and optional 1 mM chloramphenicol). Aliquot 500 µL of the lysis buffer per sample into 1.5 mL reaction tubes and place them on ice.\nDecontaminate mortar and pestle with a laboratory detergent and 70% ethanol, and dry them. Cool mortar and pestle by pouring liquid nitrogen into the mortar.\nTransfer frozen pellet into the pre-chilled mortar and grind it to a powder. With a spatula, add approximately 1 volume of aluminum oxide and continue grinding. Keep mortar, pestle and cells cool by pouring liquid nitrogen when needed, do not let the contents of the mortar to thaw.\nJust before using lysis buffer, add GMP-PNP and DNase I into the lysis buffer aliquot to the final concentration of 2 mM and 100 U/mL respectively. Transfer the solution into the mortar with cells and aluminum oxide and continue grinding. Let the lysate thaw slowly while grinding and transfer the mixture into the pre-cooled 1.5 mL reaction tube and immediately place on ice.\nCentrifuge lysates at 20 000 x g for 5 minutes at 4 °C. Transfer supernatants into new, pre-cooled 1,5 mL reaction tubes and keep them on ice.\nMeasure the RNA concentration in each sample with a NanoDrop. Use 1:10 dilutions of samples and 1:10 dilution of lysis buffer in nuclease-free water as a blank.\n\tNOTE: Be aware that chloramphenicol shows significant absorption at 260 nm.\nDivide each lysate into two portions: one for RIBO-seq (0.5 - 1 mg of RNA) and the second for RNA-seq (the rest).",
    "Clean the samples for RNA-seq using a commercially available RNA clean-up kit according to the manufacturer's protocol.\n\t​NOTE: We recommend using Zymo RNA Clean & Concentrate -25 kit (see Table of Materials). We also recommend adding 4.5 volumes of ethanol (compared to sample volume) into the mix of sample and Binding Buffer for ribosomal footprints and fragmented mRNA, in order to increase the purification efficiency of short RNA fragments.\nStore the samples intended for RNA-seq at -80 °C. The procedure for RNA-seq will continue from step 5.\n3. MNase digestion of samples for RIBO-seq\nTo 1 mg of RNA add 3.8 µL of 187.5 U/µL MNase in 10 mM Tris pH 8 and top it up with lysis buffer to the total volume of 500 µL.\nIncubate at 25 °C, 300 RPM, for 45 minutes in a thermomixer.\nClean the samples with a commercially available RNA clean up kit (as in step 2.9).\nStore the samples for RIBO-seq at -80 °C (STOP point) or proceed to size selection.\n4. Polyacrylamide gel electrophoresis (PAGE) and size selection of samples for RIBO-seq\nPrepare a 15% polyacrylamide-TBE gel with 8 M urea and place it in a tank with TBE buffer. Pre-run for minimum 10 minutes at a constant voltage of 200 V.\nMix samples with TBE-Urea Sample Buffer, denature at 95 °C for 1 minute and place them immediately on ice.\nWash out the urea by injecting TBE buffer into gel wells using a syringe. Load the samples leaving one well space between them to separate each sample and prevent cross-contamination. Use 29 nt oligonucleotide and a mix of 26 nt and 32 nt oligonucleotides as markers. Run electrophoresis at a constant voltage of 180 V.\nPrepare sterile buffer for overnight incubation (5 mM EDTA, 10 mM NaOAc pH 5).",
    "After electrophoresis, stain the gel in a SYBR Gold-bath for about 2-3 minutes and rinse the gel with nuclease-free water.\nExcise fragments of gel between 26 and 32 nt with the sterile needles or the razor blades and place the gel fragments in separate 1.5 mL tubes for each sample. Change the needle or the razor blade between the samples.\nAdd 200 µL of the overnight incubation buffer to each reaction tube.\nIncubate the samples at 10 °C, 1000 RPM overnight in a thermomixer.\nThe next day, clean the samples as in step 2.9. Elute the footprints in 80 µL of nuclease-free water.\nStore the samples at -80 °C. STOP point. The procedure for RIBO-seq will continue from step 7.\n5. Purification of bacterial mRNA by rRNA depletion from samples for RNA-seq\nRemove rRNA from samples with a bacterial mRNA purification kit (e.g., Invitrogen MICROBExpress). Follow the manufacturer's protocol.\nClean the samples as in step 2.9. Elute the mRNA in 50 µL of nuclease-free water.\nStore the samples for RNA-seq at -80 °C (STOP point) or continue to alkaline fragmentation.\n6. Alkaline fragmentation of samples for RNA-seq\nPrepare alkaline hydrolysis buffer (mix 220 µL of 0.1 M NaHCO3, 30 µL of 0.1 M Na2CO3 and 1 µL of 0.5 M EDTA). Mix 1 volume (50 µL) of alkaline buffer with 1 volume (50 µL) of the sample and incubate at 95 °C for 25 minutes.\nAdd 5 µL of 3 M NaOAc pH 5.5 to stop the reaction.\nClean the samples as in step 2.9 and elute the samples in 80 µL of nuclease-free water.\nPossible STOP point: store RNA-seq samples at -80 °C. However, we recommend to go directly to step 7 in order to avoid unnecessary freezing and thawing.",
    "7. Dephosphorylation and phosphorylation of samples for both RNA- and RIBO-seq\nAdd 10 µL of 10x reaction buffer PNK and 5 µL T4 PNK to each sample. Incubate at 37 °C for 1.5 hour in order to dephosphorylate the 3' ends.\nAdd 3 µL of 1 mM ATP and incubate at 37 °C for 1 hour in order to phosphorylate the 5' ends.\nClean the samples as in step 2.9, elute in 30 µL nuclease-free water.\nStore the samples at -80 °C. STOP point.\n8. Library preparation using NEBNext Multiplex Small RNA Library Prep Set for Illumina\nPrepare 100-1000 ng of input RNA (obtained mRNA fragments and ribosomal footprints) in 6 µL of nuclease-free water and add 1 µL of 3' SR Adaptor. Incubate according to the manufacturer's protocol.\nAdd 10 µL of 3' Ligation Reaction Buffer (2X) and 3 µL of 3' Ligation Enzyme Mix and incubate at 37 °C for 2.5 hour, instead of 1 hour at 25 °C as the manufacturer's protocol specifies.\nHybridize the Reverse Transcription Primer according to the manufacturer's protocol with a modified program: 5 minutes at 75 °C, 30 minutes at 37 °C and hold at 4 °C.\nLigate the 5´ SR Adaptor. Follow the manufacturer's protocol with one change: perform the incubation at 37 °C for 2.5 hour, instead of 1 hour at 25 °C.\nPerform Reverse Transcription according to the manufacturer's protocol.\nPossible STOP point: incubate the samples containing synthesized cDNAs at 70 °C for 15 minutes to inactivate the reverse transcriptase and store them at -80 °C. However, we recommend to proceed directly to the next steps to avoid unnecessary freezing and thawing of the samples.\nStore half of each cDNA library at -80 °C as a back-up.",
    "Perform PCR amplification according to the manufacturer's protocol. Use half of the reaction mix. Store the obtained libraries at -80 °C. STOP point.\n9. Size selection of cDNA libraries using PAGE\nPrepare 6% polyacrylamide-TBE gel and place it in a tank with TBE buffer. Pre-run for minimum 10 minutes at a constant voltage of 200 V.\nMix the samples with Gel Loading Dye, Blue (6X) and load them on the gel. Use Quick-Load pBR322 DNA-MspI Digest as a ladder. At the beginning, run electrophoresis at a constant voltage of 120 V to allow DNA to enter the gel and then change the voltage to 180 V.\nWhen electrophoresis is finished, stain the gel in a SYBR Gold-bath for about 2-3 minutes and rinse the gel with nuclease-free water.\nExcise gel fragments containing the libraries. For RNA-seq samples excise between 135-180 nt and for RIBO-seq between 135-170 nt. Use sterile needle or razor blade and place the excised gel fragments in separate 1.5 mL reaction tubes. Remember to change the needle or razor blade between the samples.\n\tNOTE: The adapters and barcode from NEBNext Multiplex Small RNA Library Prep Set for Illumina have 119 nt in total which determines the lower excision cut-off.\nAdd 100 µL of nuclease-free water to each excised gel fragment.\nIncubate the gel fragments at 10 °C, 450 RPM overnight in a thermomixer.\nClean and concentrate the cDNA libraries with a commercial DNA clean-up kit according to the manufacturer's protocol.\n\tNOTE: We recommend using Zymo DNA Clean & Concentrate -5 kit (see Table of Materials).\nStore purified cDNA libraries at -80 °C. STOP point.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}