{
  "id": 13033,
  "origin_website": "Jove",
  "title": "An Experimental Analysis of Children's Ability to Provide a False Report about a Crime",
  "procedures": [
    "NOTE: The following protocol was developed in accordance with the ethical standards approved by the McGill University Research Ethics Board. For all studies with children and involving deception, it is required to obtain Ethics Approval from the university or institution. Please note that different Ethics Boards may have different requirements.\n1. Preparation for the Experiment\nInstruct E1 to memorize the necessary dialogue for each experimental condition (Appendix B), and E2 should become familiar with the questions in the interview protocol (Appendix A). Please click here to download Appendix A.[href=https://www.jove.com/files/ftp_upload/53773/JOVE_Appendix_A.docx] Please click here to download Appendix B.[href=https://www.jove.com/files/ftp_upload/53773/JOVE_Appendix_B.docx]\nTest only one participant at a time. Use three separate rooms for the current study: testing room, interview room, common room.\nUse a testing room for the interactions between E1 and the child participants.\nPlace the necessary protocols and materials for the filler-activities, and the wallet in the testing room. Position the wallet in a concealed location, such as behind a flowerpot on a table. Please ensure that the child does not see the wallet before the theft situation with E1.\nPut twenty-dollars inside the wallet. Also, place fake identification cards (e.g., an old bus pass and ID cards) in the wallet to give the impression to the participant that the wallet belongs to someone else.\nPlace a jacket (or other item) near the wallet to be retrieved by E1 immediately prior to the theft situation.\nPlace \"Testing in Progress\" sign on the door of the testing room to avoid disturbances.\nUse an interview room for the interview with E2 and the child participant; ensure that the room has a table, two-chairs and hidden cameras that record the interview.\n\t\nPrepare the interview room to include a table with two chairs facing each other.",
    "NOTE: The interview protocol and clipboard should not be in the interview room because immediately prior to the interview between E2 and the child participant, E2 states that they are going with E1 to the testing room to get their clipboard with the interview questions. However, E2 is permitted to use the interview script during the interview.\nEnsure that the video-recording devices in the interview room can be easily activated when the interview begins.\nInstruct the parents and other family members to remain in a common room for the duration of the study.\n\tNOTE: The child participants are in this room at the beginning of the study when parents are completing the consent form. After the consent form is completed, child participants will not return to this room or interact with their parents or family until the end of the study.\nPlace the consent and demographics forms on a clipboard in the common room.\n2. Participants\nWhen recruiting participants, instruct the recruiters to provide the legal guardians of the participants with a detailed explanation of the study.\n\tNOTE: To avoid influencing participant behavior during the study, parents should be discouraged from disclosing details about the theft and interview to the children. Child participants must be fluent in the language of the protocols, and have no experience participating in any other studies (e.g., lie-telling research) that could lead them to identify the experimental nature of the theft and interview situations. Furthermore, children with physical, intellectual and/or developmental disabilities that prevent them from discerning the differences between truths and lies should not be recruited for this study.\nInstruct the researcher who is the instigator of the theft (E1) to select the experimental condition for the child participant.\n\t\nSelect the condition before the study begins.",
    "Consider the age and gender of the participant when selecting the conditions; thus, ensure that each condition has a similar number of participants from each age and gender groups.\n\t\tNOTE: Within each age and gender groups, counter-balance the conditions. For example, if E1 selects the FD condition for a male participant in the 6-7 year old age group, this condition cannot be used again for this age or gender group until the other three conditions have been selected. Ensure that the interviewer (E2) is not aware of the experimental condition to avoid influencing their behavior during the interview.\n\t\tNOTE: Do not change conditions once the study begins. Only in extraordinary circumstances should E1 be instructed to change the condition, such as believing that a particular child will experience severe emotional distress from witnessing a theft and/or being asked to lie. In this situation, E1 should be asked to change the condition to true denial, whereby the child is asked to tell the truth and does not witness a theft.\nPrior to commencing the study, ask the legal guardians to complete a consent form that explains the procedures and purpose of the research.\n\tNOTE: The true nature of the experiment should not be disclosed to the child participant until the end of the study.\nInstruct the parents to complete a demographics form that provides any demographic information that is needed for the study.\n3. Filler Activities\nAfter the parents have completed the consent form, instruct E1 to ask the child participant to go with them to the testing room.\nPrior to commencing the filler activities, notify the child that they will engage in some games with E1, and that they are free to stop the study at any time if they feel uncomfortable or upset.",
    "If a child shows or articulates emotional distress at any time during the study, instruct the researchers (E1 and E2) to stop the study immediately and return the child to their parents to be debriefed about the true nature of the study.\nBegin the filler-activities after the child provides verbal assent that they understand the instructions of the study.  \n\tNOTE: The filler-activities should take between 30-40 min. The purpose of the activities is to help build rapport between E1 and the child participants, as well as to disguise the true nature of the study.\n\tNOTE: Filler activities can include a series of cognitive tasks (e.g., standardized verbal ability task) or they can be a game. The purpose of these tasks is to engage the child, and for E1 to develop a rapport with the child.\n4. Theft Situation\nAfter completing the filler activities, instruct E1 to grab his or her jacket (or another item) before going with the child to the interview room. \n\t\nLocate the wallet near the jacket. Open the wallet, and notify the child that the wallet belongs to another researcher.\nRemove twenty-dollars from the wallet, and depending on the condition the child was placed in, either take the money or place it back in the wallet.\nDuring the theft situation, if the child appears distracted, instruct E1 to get the child's attention before engaging with the wallet.\nPlace the wallet back in its original position. Discourage E1 from giving any additional information about the wallet or their rationale for taking or leaving the money. If the child asks about the wallet, divert the conversation, such as by praising the child's performance on the filler tasks.",
    "After the wallet situation, go with the child to the interview room. Leave the jacket or other item (that E1 was looking for) in the testing room.\n5. Setting the Experimental Condition\nIn the interview room, instruct E2 to greet E1 and the child. Next, have E1 introduce the child to E2. Instruct E1 to state that they forgot their jacket in the testing room. At this time, E2 should indicate that they forgot their clipboard with the interview questions in the same room. Have E2 go with E1 to the testing room to get the questions.\n\tNOTE: Later, the child learns that E2 thought that E1 stole money from the wallet; thus, the purpose of the interaction between E1 and E2 is to help the child acknowledge how E2 became aware of the situation with the wallet.\nPrior to E2 leaving the room with E1, instruct the child to complete a filler activity (e.g., a puzzle) while they are gone.\nAfter 2 min, instruct E1 to return to the interview room without E2. During this time, have E1 ask the child to tell a truth or a lie about the situation with the wallet. Refer to Appendix B for the dialogue used by E1 for setting each condition.\n\t\nFalse Accusation Condition (FA)\n\t\t\nHave children witness E1 leave the money in the wallet; however, ask them to tell a lie to E2 by falsely accusing E1 of taking the money.\nFalse Denial Condition (FD)\n\t\t\nTake the money from the wallet, but ask the children to falsely deny the theft to E2 by saying that E1 did not take the money.\nTrue Accusation Condition (TA)\n\t\t\nHave children witness E1 take the money from the wallet, and ask them to truthfully accuse E1 of taking the money.\nTrue Denial Condition (TD)",
    "Do not take the money from the wallet. Ask the children to truthfully deny the theft to E2.\n\t\t\tNOTE: By the end of the interaction with E1, the child should understand what E1 is asking them to do by repeating the instructions of their condition. If the child does not appear to understand what is asked of them, ask E1 to repeat the instructions of the condition to them. Discourage E1 from providing any additional information about the theft situation or the condition.\n\t\t\tNOTE: The child does not have to agree to comply with the instructions for each condition. For example, discourage E1 from further persuading the child if they state that they are unwilling to lie for them.\nInstruct E1 to leave the room after setting the condition.\nOne min after E1 sets the condition and leaves the room, instruct E2 to return to interview the child about the events with E1.\n6. Interview\nIf the child wants to talk about the wallet situation before the interview, instruct E2 to divert the conversation.\nAfter the child completes the activity (e.g., puzzle), begin the interview with the child. Refer to Appendix A for the interview script.\n\t\nAsk baseline questions (n = 2) at the beginning of the interview to build rapport between E2 and the child, as well as to provide baseline data regarding each child's verbal ability and/or willingness to disclose information.\nUse open-ended questions (n = 3) throughout the interview to encourage children to describe their experiences with E1 in their own words. Moreover, use prompts after each question (e.g., “Can you tell me more?”) to provide the children with additional opportunities to disclose information. Below are the types of open-ended questions that are used:",
    "Ask two free-recall questions that require the children to describe in as much detail as possible everything they remembered from their experiences with E1. Ask one free-recall question immediately after the baseline questions, and ask the second one at the end of the interview.\nAsk children to describe everything they remembered from their time with E1, but in reverse-order. Describing events in several orders has shown to increase the cognitive effort required to maintain a lie34, 37.\nAsk closed-ended questions (n = 7) to encourage children to provide short and direct information about the wallet situation.\nTo maintain consistent interview protocols for all participants, discourage E2 from rephrasing or altering the information provided in the interview script.\nIf the child does not understand a question, restate the question to them.\nTo avoid influencing the length, veracity and quality of the child's testimony, do not allow E2 to provide any additional prompts (outside of those in the script) and/or reinforcements for the child's responses. For this reason, instruct E2 to maintain a consistent tone of voice throughout the interview, and to avoid using non-verbal behaviors that could reinforce a response, such as nodding or shaking of the head.\n7. Concluding the Study\nAfter completing the interview, bring the child into the common-room. Next, instruct E1 and E2 to debrief the child about the deceptive nature of the study, and to tell him or her that the theft was pretend and did not actually occur.\n\tNOTE: Furthermore, ensure that E1 or E2 tells the child that their involvement in the study may help other children in the future, and that they should tell their guardians if they are ever asked to lie by another adult.\nAfter the debriefing, compensate the participants and thank them for their involvement in the study.",
    "8. Preparation of Interview Transcripts\nCreate written manuscripts of each child's verbal responses and non-verbal behaviors throughout the interview based on the video-recordings.\nTranscribe all information provided by the child, even if they repeat certain details multiple times.\nDo not use acronyms or symbols (e.g., numbers) when transcribing the video-recordings.\nInstruct the transcribers to record participant responses below the appropriate question being asked. Tell them to only record the behaviors and statements of the interviewer if they differ considerably from the interview script.\n9. Coding Children's Open-ended Responses\nEvaluate the amount and type of information children disclose on the 3 open-ended questions.\n\tNOTE: Ensure that the three coders are blind to the experimental condition of the child they are evaluating.\nCalculate the children's total number of words (Response length) and details about the wallet and theft situation (Event Details).\n\tNOTE: Response Length is the number of words the child uses across the three open-ended questions. A word processing program can be used to determine the child's response length.\n\tNOTE: Event Details includes information that the child discloses about the situation with the wallet in their three open-ended responses. Record each individual and new detail about the wallet situation. For example, the sentence, \"E1 took the money from inside the wallet\", contains five event details. However, if the child says in a later question, \"E1 took twenty dollars from inside the wallet\", then only two new event details were provided.\nInstruct the coders to evaluate the Event Details of each script independently from the other coders to avoid any potential biases in the coding of the scripts. Use the mean number of words and event details from the three coders for statistical analyses.\n10. Coding Children's Closed-ended Responses",
    "Instruct one coder to evaluate the children's abilities to maintain their stories across the 4 closed-ended questions listed in Appendix C. Refer to Appendix C for the coding measures used to evaluate children's maintenance of their story in the four experimental conditions. Please click here to download Appendix C.[href=https://www.jove.com/files/ftp_upload/53773/JOVE-Appendix_C(Feb_25,_2016).docx]\nFirst, determine if the child told a truth or lie during the interview.\n\t\nUse the final closed-ended question (\"Did E1 take the money from the wallet?\") to determine if a child is telling a truth (scored as 0) or a lie (scored as 1) about the potential theft.\n\t\tNOTE: Children who provide reports that do not comply with their condition should not be included in the maintenance of story assessment. Thus, children who tell the truth in the lie-telling conditions or a lie in the truth conditions are excluded from this analysis.\nGive children one-point for each closed-ended response that supports their true or false report (total possible maintenance score of 4).\nUse statistical tests to analyze data from the study. For example, perform chi-square or logistic regressions for children's willingness to lie data, and linear regressions on children's maintenance scores.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}