{
  "id": 19221,
  "origin_website": "Jove",
  "title": "Single Liposome Measurements for the Study of Proton-Pumping Membrane Enzymes Using Electrochemistry and Fluorescent Microscopy",
  "procedures": [
    "1. Preparation of a Lipid/UQ-10/FDLL Mix\nNOTE: E. coli lipids used for the liposomes’ preparation should be aliquoted and thoroughly mixed with ubiquinone-10 (enzyme substrate) and long-wavelength fluorescent dye-labeled lipids (for liposomes size determination) prior to the reconstitution.\nUsing a glass syringe, transfer 200 µL of chloroform stock of lipid polar extract from Escherichia coli (25 mg/mL) into glass vials to make 5 mg aliquots.\nAdd 50 µL of 1 mg/mL ubiquinone-10 (UQ-10; in chloroform) to the lipids to make the final ratio of UQ-10: lipids 1:100 (1% w/w).\nAdd 20 µL of 1 mg/mL (0.4% w/w) of a long-wavelength fluorescent dye-labeled lipid (FDLL) to the lipids/UQ-10 mix.\nHomogenize the chloroform solution by short vortexing and evaporate most of the chloroform under a gentle nitrogen or argon flow. Remove the chloroform traces entirely by further evaporation under vacuum for at least 1 h.\n\tNOTE: Lipid aliquots can be stored under an inert atmosphere at -20 °C for several months.\n2. Reconstitution of Cytochrome bo3\nNOTE: For the purification of cytochrome bo3 from E. coli, follow the protocol from Rumbley et al.15 To ensure high purity of natively-folded enzyme samples, add size-exclusion chromatography after the affinity purification step described by Rumbley et al. 15\nAdd 312.5 µL of 40 mM MOPS-KOH/60 mM K2SO4, pH 7.4, to one aliquot of lipids/UQ-10/FDLL dry mix (5 mg, step 1.4) and mix with vortex till the lipid film is fully resuspended, followed by 2 min of treatment in an ultrasonic bath.\nAdd 125 µL of 25 mM 8-hydroxypyrene-1,3,6-trisulphonic acid (HPTS), a pH-sensitive fluorescent dye that needs to be encapsulated inside the liposomes.",
    "Add 137.5 µL of 250 mM n-octyl β-D-glucopyranoside (OGP) surfactant, mix using vortex and sonicate in an ultrasonic water bath for 10 min to ensure all lipids are solubilized into surfactant micelles. Transfer the dispersion into a 1.5 mL plastic tube.\n\tNOTE: Cloudy suspension of lipids should become transparent after the solubilization with surfactant.\nAdd the required amount of cytochrome bo3 (see the note below) and add ultrapure water to make a total volume of 50 µL (cytochrome bo3 solution plus water). Incubate at 4 °C for 10 min on a roller mixer.\n\tNOTE: Typical amount for single enzyme conditions is 0.1 – 0.2% (w/w protein-to-lipid, i.e. 5 – 10 µg of protein), although it can be increased till 1 – 2% (50 – 100 µg of protein) if the goal is to observe only the electrochemical activity (see below). As a negative control, liposomes without cytochrome bo3 can be prepared.\nWeigh 2x 50 mg and 2x 100 mg of polystyrene microbeads into four 1.5 mL-tube caps and close with paraffin film to prevent drying.\n\tNOTE: Before use, polystyrene microbeads should be washed with methanol, water and stored in water according to the manufacturer’s manual.\n\tNOTE: If a water/microbead mixture is used, polystyrene microbeads can conveniently be transferred to the cap with a micropipette with a wide tip. Water can then be removed from the microbeads using a micropipette with a thin tip.\nAdd the 1st 50 mg of polystyrene microbeads into the reconstitution mixture (step 2.4) by putting the cap with polystyrene microbeads on the 1.5 mL-plastic tube with dispersion and performing a short spin for a couple of seconds. Incubate at 4 °C on a roller mixer for polystyrene microbeads to adsorb the surfactant for 30 min.",
    "Repeat the additions of polystyrene microbeads and incubations as follows: add 50 mg of microbeads for 60 min of incubation; add 100 mg of microbeads for 60 min of incubation; and add 100 mg of microbeads for 120 min of incubation.\n\t\tNOTE: The solution above the settled microbeads will turn translucent during step 2.6 as proteoliposomes are formed.\nSeparate the proteoliposome solution from the polystyrene microbeads using a micropipette with a thin tip. Dilute the dispersion in 90 mL of 20 mM MOPS-KOH/30 mM K2SO4, pH 7.4 (MOPS buffer) and transfer in a Ti45 ultracentrifuge tube.\nUltracentrifuge the dispersion using Type 45 Ti rotor at 125,000 x g (at rmax) for 1 h to pellet the proteoliposomes.\n\tNOTE: Smaller centrifuge tubes can be used although the dilution in large buffer volume helps to reduce the concentration of the non-encapsulated HPTS in the final suspension.\nDiscard the supernatant, rinse the pellets with 20 mM MOPS-KOH/30 mM K2SO4, pH 7.4 buffer (without resuspending the pellet). After discarding the rinsing buffer, re-suspend the proteoliposomes in 500 µL of MOPS buffer by pipetting it back and forth with thin tip micropipette. Then transfer to a 1.5 mL plastic tube.\nCentrifuge the suspension for 5 min at 12,000 x g to remove the debris. Transfer the supernatant (reconstituted proteoliposomes) into a new vial.\nStore the reconstituted proteoliposomes dispersion at 4 °C overnight and use within 2 days.\n3. Fabrication of Semi-Transparent Gold Electrodes",
    "NOTE: The smooth gold surface is obtained by a template stripping method of a 30 nm-thick layer of 99.99% gold from an atomically smooth silicon wafer. The small thickness of the gold layer is important since it must be semi-transparent to permit fluorescence observation. Details of gold evaporation (physical vapor deposition, PVD) can be find elsewhere16 and only template-stripping is covered here. Alternatively, ultra-smooth gold chips can be purchased elsewhere (see Table of Materials).\nGlue up to 9 glass cover slips (0.17 mm thick) onto the evaporated gold surface using bi-component low-fluorescence epoxy. Cure the glue at 80 °C for 4 h.\nJust before modification with a self-assembled monolayer (step 4), detach the glass cover slips from the silicon wafers with a blade. Due to the thinness of the cover slips, take care when detaching the cover slips to not crack or break the glass slides.\n4. Modification of the Gold Surface with Self-Assembled Monolayer (SAM)\nPrepare 5 mL of water solution of 1 mM 6-mercaptohexanol (6MH).\nDip freshly detached gold-coated cover slips (step 3.1) into 6MH solution and leave at 20 – 25 °C overnight (>16 h) to form the SAM.\n\tNOTE: Thiol solutions have an unpleasant smell, so a closed vessel should be used when incubating the gold-coated cover slip.\nThe next day, remove the gold-coated cover slip from the 6MH solution, wash briefly with water or methanol and then with isopropanol. Dry under a gentle gas flow.\n5. Electrochemical Testing of Proteoliposomes Activity\nNOTE: The electrochemical activity of enzyme is first verified on a closely packed liposomes layer (step 5) and lower vesicle coverages are used in single vesicles experiment to measure pH changes in the lumen of the liposomes (step 6).",
    "Assemble the gold-coated cover slip in a spectro-electrochemical cell (see Figure 1). Make contact to the gold with a flat wire outside an area defined by a rubber O-ring.\nAdd 2 mL of the electrolyte buffer solution and place the reference and auxiliary electrodes in the cell.\n\tNOTE: As further discussed in the Discussion section, references electrodes without chloride are preferred to prevent formation of Au(I)Cl during electrochemistry. Here, a Hg/Hg2SO4 (sat. K2SO4) reference electrode is used and potentials are given versus Standard Hydrogen Electrode (SHE) using 0.658 V vs SHE for the Hg/Hg2SO4 (sat. K2SO4).\nRun electrochemical impedance spectroscopy (0.1 Hz – 100 kHz) at open cell potential (OCP) potential to assess the quality of SAM. Convert impedance values to admittance and divide by 2πω to plot a Cole-Cole plot, where ω is the frequency (see the following references16,17,18 for details on converting and interpreting impedance spectra).\n\tNOTE: Compact and dense SAMs of 6MH should give a close to semi-circle Cole-Cole plot and give capacitance values in the range 2.5-3.0 µF/cm2 (Figure 2A). If significant deviation from semi-circle shape or out-of-range capacitance values are obtained, change the electrode.\nRun blank cyclic voltammograms (CVs) with scan rates 100 and 10 mV/s in the potential region -0.3 – 0.8 V. A typical CV is shown on (Figure 2B, dashed line).\n\tNOTE: This should demonstrate almost pure capacitive behavior and an absence of significant faradaic current, even under ambient oxygen conditions as used here.\nAdd proteoliposomes (0.5 mg/mL final lipids concentration, 1-2% (w/w) ratio of cytochrome bo3 to lipid) to the electrochemical cell and mix slightly with a pipette. Wait until the adsorption of proteoliposomes on the electrode surface is finished (30-60 min at room temperature).",
    "NOTE: Cyclic voltammograms (CVs) at 10 mV/s can be run during the proteoliposomes adsorption to follow the process. The adsorption is finished when consecutive CVs stop changing. Information about CV techniques can be found in the following textbooks.19,20\nWash the cell by changing the buffer solution at least 10 times but avoid leaving the electrode surface completely dry.\nRun the electrochemical impedance spectroscopy at OCP (Figure 2A, blue line) to confirm the SAM on the gold electrode remains unchanged and CVs with scan rates 10 and 100 mV/s to observe catalytic ubiquinol oxidation (and oxygen reduction) by cytochrome bo3 at onset potentials of electrochemical quinone reduction about 0 V vs SHE) (Figure 2B).\n6. Detection of Enzymatic Proton Pumping by Fluorescence Microscopy\nModify the gold electrode as in step 5 but using 100x less proteoliposomes compared to step 5.5 (i.e., 5 µg/mL). For single enzyme studies, reduce the cytochrome bo3 to lipid ratio to 0.1-0.2% (w/w).\n\tNOTE: Liposomes will sparsely adsorb on the electrode surface enabling single vesicle monitoring by fluorescence microscopy. Under these single-enzyme conditions, the amount of enzyme immobilized on the electrode surface is insufficient for the observation of a catalytic current.\nPlace the electrochemical cell on the oil objective (60X) of an inverted fluorescence microscope with a drop of immersion oil. Using appropriate filters for FDLL fluorescence, focus on the electrode surface. Single liposomes should appear as bright spots at the diffraction limit of the microscope/objective. Take an image of FDLL fluorescence.\nSwitch to the one of HPTS fluorescence filter sets on the microscope to verify that HPTS fluorescence is clearly visible and distinguishable from the background (at the chosen exposure time, see step 6.4). Increase the light intensity if it is not the case.",
    "Program the microscope software to perform a timed image acquisition by alternating two HPTS filter sets (menu Applications | Define/Run ND Acquisition). Set the delay between image acquisitions at minimum. In this experiment, use a 1 s exposure and 0.3 s delay (due to the turret movement).\n\tNOTE: The ratio between fluorescence intensities at these two channels will be later converted to pH inside the liposomes at each time point. The duration of the acquisition can vary according to the expected pH change rate; 5 min is used in this article.\nAdjust the settings of the potentiostat to change the potential during the image acquisition. For example, in this experiment, use the following sequence: 0 – 60 s: no potential applied (i.e. OCP); 60 – 180 s: -0.2 V (vs SHE); 180 – 300 s: 0.4 V (vs SHE). In this case, only the applied potential in the second phase (-0.2 V vs SHE) is sufficient to efficiently reduce the quinone pool.\nRun simultaneously the timed images acquisition (microscope) and the potential sequence (potentiostat) by manually starting both measurements at the same time.\n\tNOTE: The experiment can be repeated on the same electrode several time by moving the microscope stage to a different area on the surface. The delay between the acquisitions should be at least 5-10 min to insure complete pH equilibration of liposomes on the surface. Different durations and potential patterns can be applied depending on the need, although imaging time is limited due to photobleaching of HPTS during acquisition.\n7. Analysis of Fluorescence Images",
    "NOTE: A typical experiment produces a set of images with a time step (e.g., 2.6 s) for each of the two channels, i.e., (duration * 2 / 2.6) images. An example of such image set recorded during a single enzyme experiment can be accessed via the Research Data Leeds repository21. An image treatment consists of several steps by using Fiji (ImageJ) and high-level mathematical analysis programming language software (henceforth referred to as scripting software, see Table of Materials for details).\nUse Fiji to separate time lapse file, align images and save as separate channels and timeframes.\n\t\nOpen time lapse file using the Bioformats importer provided within Fiji (macro command: run (\"Bio-Formats Importer\")).\nUse the plugin StackReg to align each frame to the first one to account for possible stage movements or thermal drift occurred during the acquisition (macro command: run(\"StackReg \", \"transformation=Translation\")).\nSave separate uncompressed image files for each channel and each time step in TIFF format into a single folder.\nExtract the exact time stamps for each frame from the time lapse file metadata and save them as a CSV-file in the same folder as the images. Alternatively, extract time stamps using the acquisition software and save manually into a CSV-file using a spreadsheet software.\n\t\tNOTE: The folder with images and time stamps is now ready to be analyzed by the scripting software. Steps 7.1.1. – 7.1.4. can be automatized using a Fiji script (a script written in Python for batch processing of time lapse files is provided, use “Ctrl-Shift-N” (in Windows), then File | Open to load the script).\nUse scripting software for automatized processing of the images. Load the provided code to the software and click Run to end. When prompted, select the folder containing the images from step 7.1.",
    "NOTE: A script for analysis is provided as mlx-format live script, with extensive comments, to identify single liposomes, fit them to 2D-Gaussian function, filter them and quantify the pH values at each point of time. The following sub-steps are executed automatically by the script.\n\t\nLoad all time frames images for a single experiment into the memory.\nAverage all images for a single channel (select the channel with the highest fluorescence intensity) and use the averaged image to identify all maximums that might correspond to the single liposomes.\nFit the identified maximums on the averaged image to the 2D-Gaussian function and save the resulted fit parameters for each liposome (see Figure 4A for fitted liposome example).\nFilter the maximums according to the expected single liposomes criteria, such as size, circularity and intensity. Reject liposomes that are poorly fitted due to low signal to noise, closely neighboring liposome or being too close to the image edge.\nLoad time stamps from the external file and fit each filtered liposome to the 2D-gaussian function on each time frame image separately.\n\t\tNOTE: The use of parallel programming and multicore CPU can significantly enhance the calculation speed at this stage.\nFilter the liposomes again according to the similar criteria as in step 7.2.4 but applied to each time frame.\nOn each time step, define the fluorescence intensity ratio of a liposome as the ratio of volumes enclosed by fitted 2D-Gaussian function at two channels. Calculate the pH values from the ratio of intensities determined from the two HPTS channels and using a calibration curve (step 8). Plot resulting pH-time curves for the liposomes and observe their pH change when the potential is applied.\n8. Performing a Calibration Curve of HPTS Fluorescence",
    "NOTE: To convert HPTS fluorescence ratio to an intravesicular pH, a calibration curve must be first established that would take into account particular conditions of experiments such as gold transmittance, filters quality, etc. This step has to be performed only once or twice and the calibration data can be used as long as the setup and measurement parameters remain the same in step 6.\nPrepare an electrode with sparsely adsorbed liposomes (without cytochrome bo3 as described in Steps 5 and 6.1).\nAdd 2 µL of 0.1 mg/mL gramicidin solution in ethanol to 2 mL of buffer to create the concentration 100 ng/mL.\nCapture two fluorescence images for the two HPTS channels.\nChange the pH of the cell by addition of small aliquots of 1 M HCl or 1 M H2SO4. Measure the pH of the buffer with a standard pH meter and capture two fluorescence images for the two HPTS channels.\nRepeat steps 8.4 for the pH range 6 to 9.\nUsing the algorithm from 7.2, fit, filter and calculate the average HPTS fluorescence ratio of individual liposomes at every pH. Take the HPTS ratio average over all liposomes.\nFit the resulting pH-ratio dependence to the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/58896/58896eq1.jpg, where pKa, Ra and Rb are fitting parameters.\nUse pKa, Ra and Rb to convert the HPTS ratio of individual liposomes in step 7.2.7. to pH values.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}