{
  "id": 17065,
  "origin_website": "Jove",
  "title": "Cryo-EM and Single-Particle Analysis with Scipion",
  "procedures": [
    "1. Creating a project in Scipion and importing the data\nOpen Scipion and click on Create Project, specify the name for the project and the location where it will be saved (Supplemental Figure 1). Scipion will open the project window showing a canvas with, on the left side, a panel with a list of available methods, each of them represents one image processing tool that can be used to manage data.\n\tNOTE: Ctrl+F can be used to find a method if it does not appear in the list.\nTo import the movies taken by the microscope select the pwem - import movies on the left panel (or type it when pressing Ctrl+F).\nA new window will be opened (Supplemental Figure 2). There, include the path to the data, and the acquisition parameters. In this example, use the following setup: Microscope voltage 300 kV, Spherical aberration 2.0 mm, Amplitude Contrast 0.1, Magnification rate 50000, Sampling rate mode to From image, and Pixel size 1.34 Å. When all the parameters in the form are filled, click on the Execute button.\n\tNOTE: When a method starts, a box appears in the canvas in yellow color labeled as running. When a method finishes, the box changes to green, and the label changes to finished. In case of an error during the execution of a method, the box will appear in red, labeled as failed. In that case, check the bottom part of the canvas, in the Output Log tab an explanation of the error will appear.",
    "When the method finishes, check the results in the bottom part of the canvas in the Summary tab. Here, the outputs generated by the method are presented, in this case, the set of movies. Click on Analyze Results button and a new window will appear with the list of movies.\n2. Movie alignment: from movies to micrographs\nUse the method xmipp3 - optical alignment which implements Optical flow19. Use the following parameters to fill in the form (Supplemental Figure 3): the Input Movies are those obtained in step 1, the range in Frames to ALIGN is from 2 to 13, the other options stay with the default values. Execute the program.\n\tNOTE: The parameters in bold in a form must be always filled. The others will have a default value or will not be obligatorily required. In the upper part of the form window, the fields where the computational resources are distributed can be found, as threads, MPIs, or GPUs.\nClick on Analyze Results to check the obtained micrographs and the trajectory of the estimated shifts (Figure 1). For every micrograph seen: look at the power spectral density (PSD), the trajectories obtained to align the movie (one point per frame) in cartesian and polar coordinates, and the file name of the obtained micrograph (clicking on it, the micrograph can be inspected). Notice that the particles of the specimen are much more visible in the micrograph, as compared to a single frame of the movie.\n3. CTF estimation: calculating the aberrations of the microscope",
    "First, use the method grigoriefflab - ctffind15. The setup is: the Input Micrographs are the output of step 2, the Manual CTF Downsampling factor is set to 1.5, and the Resolution range goes from 0.06 to 0.42. Moreover, in the Advanced options (that can be found by selecting this choice in the Expert Level of the form), set the Window size to 256. The remaining parameters stay with the default values (Supplemental Figure 4).\n\tNOTE: In most of the methods in Scipion the Advanced option shows more configuration parameters. Use these options carefully, when the program to be launched is completely known and the meaning of the parameters is understood. Some parameters can be difficult to fill without having a look at the data; in that case, Scipion shows a magic wand on the right side that will show a wizard window (Supplemental Figure 5). For example, in the Resolution field of this form is especially useful, as these values should be selected to approximately cover the region from the first zero to the last noticeable ring of the PSD.\nClick on Execute and on Analyze Results (Figure 2) when the method finishes. Check that the estimated CTF matches with the experimental one. To that end, look at the PSD and compare the estimated rings in the corner with the ones coming from the data. Also check the obtained defocus values to find any unexpected values and respective micrographs can be discarded or recalculated. In this example, the whole set of micrographs can be used.\n\tNOTE: Use the buttons in the bottom part of the window to make a subset of micrographs (with Micrographs red button) and to recalculate a CTF (with Recalculate CTFs red button), in case of needing.",
    "To refine the previous estimation, use xmipp3 - ctf estimation20. Select as Input Micrographs the output of step 2, select the option Use defoci from a previous CTF estimation, as Previous CTF estimation choose the output of grigoriefflab - ctffind, and, in the Advanced level, change the Window size to 256 (Supplemental Figure 6). Run it.\nClick on Analyze Results to check the obtained CTFs. With this method, more data is estimated and represented in some extra columns. As none of them show incorrect estimated values, all the micrographs will be used in the following steps.\n4. Particle picking: finding particles in the micrographs\nBefore starting the picking, carry out a preprocess of the micrographs. Open xmipp3 - preprocess micrographs, set as Input micrographs those obtained in step 2 and select the options Remove bad pixels? with Multiple of Stddev to 5, and Downsample micrographs? with a Downsampling factor of 2 (Supplemental Figure 7). Click on Execute and check that the size of the resulting micrographs has been reduced.\nFor the picking use xmipp3 - manual-picking (step 1) and xmipp3 - auto-picking (step 2)21. The manual picking allows to manually prepare a set of particles with which the auto-picking step will learn and generate the complete set of particles. First, run xmipp3 - manual-picking (step 1) with Input Micrographs as the micrographs obtained in the previous preprocess. Click on Execute and a new interactive window will appear (Figure 3).",
    "In this window a list of the micrographs (Figure 3a) and other options is presented. Change Size (px) to 150, this will be the size of the box containing each particle. The selected micrograph appears in a bigger window. Choose a region and pick all the visible particles in it (Figure 3b). Then, click on Activate Training to start the learning. The remaining regions of the micrograph are automatically picked (Figure 3c). Check the picked particles and include more by clicking on it, or remove the incorrect ones with shift+clicking, if necessary.\nSelect the next micrograph in the first window. The micrograph will be automatically picked. Check again to include or remove some particles, if necessary. Repeat this step with, approximately, 5 micrographs to create a representative training set.\nOnce this is done, click on Coordinates in the main window to save the coordinates of all the picked particles. The training set of particles is ready to go to the auto picking to complete the process for all micrographs.\nOpen xmipp3 - auto-picking (step 2) indicating in Xmipp particle picking run the previous manual picking, and Micrographs to pick as Same as supervised. Click on Execute. This method will generate as output a set of around 100000 coordinates.\nApply a consensus approach, so carry out a second picking method to select the particles in which both methods agree. Open sphire - cryolo picking14 and select the preprocessed micrographs as Input Micrographs, Use general model? to Yes, with a Confidence threshold of 0.3, and a Box Size of 150 (Supplemental Figure 8). Run it. This method should generate also around 100000 coordinates.",
    "Run xmipp3 - deep consensus picking22. As Input coordinates include the output of sphire - cryolo picking (step 4.7) and xmipp3 - auto-picking (step 4.6), set Select model type to Pretrained, and Skip training and score directly with pretrained model? To Yes (Supplemental Figure 9). Run it.\nClick on Analyze Results and, in the new window, on the eye icon next to Select particles/coordinates with high 'zScoreDeepLearning1' values. A new window will be opened with a list of all particles (Figure 4). The zScore values in the column give an insight into the quality of a particle, low values mean bad quality.\n\t\nClick on the label_xmipp_zScoreDeepLearning to order the particles from highest to lowest zScore. Select the particles with zScore higher than 0.75 and click on Coordinates to create the new subset. This should create a subset with approximately 50000 coordinates.\nOpen xmipp3 - deep micrograph cleaner. Select as Input coordinates the subset obtained in the previous step, Micrographs source as same as coordinates, and keep Threshold at 0.75. Run it. Check in the Summary tab that the number of coordinates has been reduced, although in this case, only few coordinates are removed.\n\tNOTE: This step is able to additionally clean the set of coordinates and could be very useful in cleaning other datasets with more movie artifacts as carbon zones or large impurities.\nRun xmipp3 - extract particles (Supplemental Figure 10). Indicate as Input coordinates the coordinates obtained after the previous step, Micrographs source as other, Input micrographs as the output of step 2, CTF estimation as the output of the xmipp3 - ctf estimation, Downsampling factor to 3, and Particle box size to 100. In the Preprocess tab of the form select Yes to all. Run it.",
    "Check that the output should contain the particles in reduced size of 100x100 pixels and a pixel size of 4.02Å/px.\nRun again xmipp3 - extract particles changing the following parameters: Downsampling factor to 1, and Particle box size to 300. Check that the output is the same set of particles but now at the full resolution.\n5. 2D classification: grouping similar particles together\nOpen the method cryosparc2 - 2d classification11 with Input particles as those obtained in step 4.11 and, in the 2D Classification tab, the Number of classes to 128, keep all the other parameters with the default values. Run it.\nClick on Analyze Results and then on the eye icon next to Display particle classes with Scipion (Figure 5). This classification will help to clean the set of particles, as several classes will appear noisy or with artifacts. Select the classes containing good views. Click on Particles (red button in the lower part of the window) to create the cleaner subset.\nNow, open xmipp3 - cl2d23 and set as Input images the images obtained in the previous step and Number of classes as 128. Click on Execute.\n\tNOTE: This second classification is used as additional cleaning step of the set of particles. Usually is useful to remove as much noisy particles as it is possible. However, if a simpler workflow is desired, only one 2D classification method can be used.",
    "When the method finishes, check the 128 generated classes by clicking on Analyze Results and on What to show: classes. Most of the generated classes show a projection of the macromolecule with some level of detail. However, some of them appear noisy (in this example approximately 10 classes). Select all the good classes and click on the Classes button to generate a new subset with only the good ones. This subset will be used as input to one of the methods to generate an initial volume. With the same selected classes click on Particles to create a cleaner subset after removing those belonging to the bad classes.\nOpen pwem - subset with Full set of items as the output of 4.13 (all particles at the full size), Make random subset to No, Other set as the subset of particles created in the previous step, and Set operation as intersection. This will extract the previous subset from the particles at full resolution.\n6. Initial volume estimation: building the first guess of the 3D volume\nIn this step, estimate two initial volumes with different methods and then use a consensus tool to generate the final estimated 3D volume. Open xmipp3 - reconstruct significant24 method with Input classes as those obtained after step 5, Symmetry group as c1, and keep the remaining parameters with their default values (Supplemental Figure 11). Execute it.\nClick on Analyze Results. Check that a low resolution volume of size 100x100x100 pixels and a pixel size of 4.02Å/px is obtained.",
    "Open xmipp3 - crop/resize volumes (Supplemental Figure 12) using as Input Volumes the one obtained in the previous step, Resize volumes? to Yes, Resize option to Sampling Rate, and Resize sampling rate to 1.34 Å/px. Run it. Check in the Summary tab that the output volume has the correct size.\nNow, create the second initial volume. Open relion - 3D initial model10, as Input particles use the good particles at full resolution (output of 5.5) and set Particle mask diameter to 402Å, keep the remaining parameters with the default values. Run it.\nClick on Analyze Results and then in Display volume with: slices. Check that a low resolution volume but with the main shape of the structure is obtained (Supplemental Figure 13).\nNow, open pwem - join sets to combine the two generated initial volumes to create the input to the consensus method. Just indicate Volumes as Input type and select the two initial volumes in Input set. Run it. The output should be a set containing two items with both volumes.\nThe consensus tool is the one included in xmipp3 - swarm consensus25. Open it. Use as Full-size Images the good particles at full resolution (output of 5.5), as Initial volumes the set with two items generated in the previous step, and be sure that Symmetry group is c1. Click on Execute.\nClick on Analyze Results. Check that a more detailed output volume is obtained (Figure 6). Although there is more noise surrounding the structure, to have more details in the structure map will help the following refinement steps to avoid local minima.\n\tNOTE: If UCSF Chimera26 is available, use the last icon in the upper part of the window to make a 3D visualization of the obtained volume.",
    "Open and execute relion - 3D auto-refine10 to make a first 3D angular assignment of the particles. Select as Input particles the output of 5.5, and set Particle mask diameter to 402Å. In Reference 3D map tab, select as Input volume the one obtained in the previous step, Symmetry as c1, and Initial low-pass filter to 30Å (Supplemental Figure 14).\nClick on Analyze Results. In the new window select final as Volume to visualize and click on Display volume with: slices to see the obtained volume. Check also the Fourier shell correlation (FSC) by clicking on Display resolution plots in the results window and the angular coverage in Display angular distribution: 2D plot (Figure 7). The reconstructed volume contains much more details (probably with some blurred areas in the outer part of the structure), and the FSC crosses the threshold of 0.143 around 4.5Å. The angular coverage covers the whole 3D sphere.\n7. 3D classification: discovering conformational states\nUsing a consensus approach, if different conformational states are in the data can be discovered. Open relion - 3D classification10 (Supplemental Figure 15). As Input particles use those just obtained in 6.10, and set Particle mask diameter to 402Å. In the Reference 3D map tab, use as Input volume the one obtained after step 6.10, set Symmetry to c1, and Initial low-pass filter to 15Å. Finally, in Optimization tab, set the Number of classes to 3. Run it.",
    "Check the results by clicking on Analyze Results, select Show classification in Scipion. The three generated classes and some interesting measures are shown. The first two classes should have a similar number of assigned images (size column) and look very similar, whilst the third one has fewer images and a more blurred appearance. Also, the rlnAccuracyRotations and rlnAccuracyTranslations should be clearly better for the first two classes. Select the two best classes and click on the Classes button to generate a subset containing them.\nRepeat steps 7.1 and 7.2 to generate a second group of good classes. Both will be the input of the consensus tool.\nOpen and run xmipp3 - consensus classes 3D and select as Input Classes the two subsets generated in the previous steps.\nClick on Analyze Results. The number of coincident particles between classes is presented: the first value is the number of coincident particles in the first class of subset 1 and the first class of subset 2, the second value is the number of coincident particles in the first class of subset 1 and the second class of subset 2, etc. Check that the particles are randomly assigned to classes one or two, which means that the 3D classification method is not able to find conformational changes. Given this result, the whole set of particles will be used to continue processing.\n8. 3D refinement: refining angular assignments of a homogeneous population\nAgain, apply a consensus approach in this step. First, open and run pwem - subset with Full set of items as the output of 6.9, Make random subset to Yes, and Number of elements to 5000. With this, a subset of images with a previous alignment to train the method used in the following step is created.",
    "Open xmipp3 - deep align, set Input images as the output of good particles obtained in 5.5, Volume as the one obtained after 6.10, Input training set as the one created in the previous step, Target resolution to 10Å, and keep the remaining parameters with the default values (Supplemental Figure 16). Click on Execute.\nClick on Analyze Results to check the obtained angular distribution, where there are no missing directions and the angular coverage slightly improves compared to the one of 6.10 (Figure 8).\nOpen and execute xmipp3 - compare angles and select as Input particles 1 the output of 6.9 and Input particles 2 the output of 8.2, make sure that the Symmetry group is c1. This method calculates the agreement between xmipp3 - deep align and relion - 3D auto refine.\nClick on Analyze Results, the list of particles, with the obtained differences in shifts and angles, is shown. Click on the bar icon in the upper part of the window, another window will be opened that allows making plots of the calculated variables. Select _xmipp_angleDiff and click on Plot to see a representation of the angular differences per particle. Do the same with _xmipp_shiftDiff. In these figures, approximately in half of the particles both methods agree (Figure 9). Select the particles with angular differences lower than 10º and create a new subset.\nNow, open xmipp3 - highres27 to make a local refinement of the assigned angles. First, select as Full-size Images the images obtained in the previous step, and as Initial volumes the output of 6.9, set Radius of particle to 150 pixels, and Symmetry group as c1. In the Angular assignment tab, set the Image alignment to Local, Number of iterations to 1, and Max. Target Resolution as 5Å/px (Supplemental Figure 17). Run it.",
    "In the Summary tab check that the output volume is smaller than 300x300x300 pixels and with slightly higher pixel size.\nClick on Analyze Results to see the obtained results. Click on Display resolution plots to see the FSC, and on Display volume: Reconstructed to see the obtained volume (Supplemental Figure 18). A good resolution volume close to 4-3.5Å is obtained.\nClick on Display output particles and, in the window with the list of particles, click on the bar icon. In the new window, select Type as Histogram, with 100 Bins, select _xmipp_cost label, and finally press Plot (Supplemental Figure 19). This way, the histogram of the cost label is presented, which contains the correlation of the particle with the projection direction selected for it. In this case, a unimodal density function is obtained, which is a sign of not having different populations in the set of particles. Thus all of them will be used to continue the refinement\n\tNOTE: In case of seeing a multimodal density function, the set of particles belonging to the higher maximum should be selected to continue the workflow only with them.\nOpen and execute again xmipp3 - highres with Continue from a previous run? to Yes, set as Full-size Images those obtained after 8.5, and Select previous run with the previous execution of Xmipp Highres. In the Angular assignment tab, set the Image alignment to Local, with 1 iteration and 2.6Å/px as target resolution (full resolution).\nNow the output should contain a volume at full resolution (size 300x300x300 pixels). Click on Analyze Results to check again the obtained volume and the FSC, which now should be a high resolution volume at around 3Å (Figure 10).\n9. Evaluation and post-processing",
    "Open xmipp3 - local MonoRes28. This method will calculate the resolution locally. Set as Input Volume the one obtained after 8.10, set Would you like to use half volumes? to Yes, and Resolution Range from 1 to 10Å. Run it.\nClick on Analyze Results and select Show resolution histogram and Show colored slices (Figure 11). The resolution in the different parts of the volume is shown. Most of the voxels of the central part of the structure should present resolutions around 3Å, whilst the worst resolutions are achieved in the outer parts. Also, a histogram of the resolutions per voxel is shown with a peak around (even below) 3Å.\nOpen and run xmipp3 - localdeblur sharpening29 to apply a sharpening. Select as Input Map the one obtained in 8.10, and as Resolution Map the one obtained in the previous step with MonoRes.\nClick on Analyze Results to check the obtained volumes. Open the last one, corresponding to the last iteration of the algorithm. It is recommend opening the volume with other tools, such as UCSF Chimera26, to see better the features of the volume in 3D (Figure 12).\nFinally, open the validation tool included in xmipp3 - validate overfitting30 that will show how the resolution changes with the number of particles. Open it and include as Input particles the particles obtained in step 8.5, set Calculate the noise bound for resolution? to Yes, with Initial 3D reference volume as the output of 8.10. In Advanced options, set the Number of particles to \"500 1000 1500 2000 3000 5000 10000 15000 20000\" (Supplemental Figure 20). Run it.",
    "Click on Analyze results. Two plots will appear (Figure 13) with the evolution of the resolution, in the green line, as the number of particles used in the reconstruction grows. The red line represents the resolution achieved with a reconstruction of aligned Gaussian noise. The resolution improves with the number of particles and a great difference of the reconstruction from particles compared to the one from noise is observed, which is an indicator of having particles with good structural information.\nFrom the previous results, a fitting of a model in the post-processed volume could be carried out, which would allow discovering the biological structures of the macromolecule."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}