{
  "id": 9904,
  "origin_website": "Jove",
  "title": "Structural Information from Single-molecule FRET Experiments Using the Fast Nano-positioning System",
  "procedures": [
    "1. Prerequisites and Lab Equipment\nNOTE: The assembly of the measurement chamber is depicted in Figure 3. The sandwich-design of the measurement chamber comprises three major components: a quartz glass (fused silica) slide, a sealing film and a coverslip that seals the flow chamber. The measurement chamber is mounted onto a customized sample holder. The dimensions of the sample chamber and the metal holder are geared to fit to a standard microscopy quartz glass slide (76 mm x 26 mm).\nCut quartz glass slides using a diamond drill (0.75 mm) at positions indicated in Figure 4. The design of the quartz glass slides is asymmetric in order to differentiate between the two sides of each slide.\n\tNOTE: The quartz slides can be re-used after the measurement until the surface becomes scratched.\nTo mount the chambers, use customized metal sample holders as depicted in Figure 5. The sample holders contain two threads (M4) in order to connect an inlet and an outlet tubing for the flow chamber. Furthermore, use threads (M3) to mount the sample chamber onto the metal holder as well as threads (M3) to fix the prism holder onto to the lower half of the metal holder.\nPerform the smFRET measurements on a prism type total internal reflection fluorescence microscope (TIRFM) (Figure 6).",
    "NOTE: The TIRFM features three lasers: A green (532 nm, Nd:YAG laser) and a red laser (643 nm, diode laser) for the excitation of the donor and the acceptor dye molecules as well as a blue laser (491 nm, diode-pumped solid-state laser) for bleaching the background fluorescent impurities on the sample chamber prior to the smFRET measurement. The three laser beams are spatially combined and can be selected via an acousto-optic tunable filter (AOTF). The fluorescence light is collected by a high aperture objective, split into a donor and an acceptor channel by using a dichroic mirror and projected onto two EM-CCD cameras. The sample chamber is attached to a micrometer stage allowing movement in x- and y-direction with two stepper motors. A third piezo motor is used together with an IR-laser and a position sensitive detector to build an auto-focus system to ensure optimal focus throughout the experiment.\n\t\nUse alternating laser excitation (ALEX) when dynamics in the FRET time trajectories are observed25. Such dynamics can be caused by either conformational changes within the molecules or by fluctuations in acceptor brightness and acceptor blinking.\n\t\tNOTE: ALEX allows for the discrimination between these two possible causes and prevents misinterpretation of dynamic FRET trajectories. However, for reasons of simplicity, the protocol part is restricted to the analysis of movies taken without ALEX.\n\t\tCaution: Class 3B lasers are used in the single-molecule fluorescence setup. Ensure that adequate laser safety precautions, according to local government regulations, have been taken before the system is operated.\nPerform the absorption measurement used for determining the quantum yield on a UV-VIS spectrometer (see Materials and Methods).\nPerform the measurement of the donor fluorescence emission spectrum, the acceptor absorption spectrum and the fluorescence anisotropy on a fluorescence spectrometer (see Materials and Methods).",
    "Prepare sample chambers according to published procedures33. Alternatively, the procedure described in [34] can be used.\nLabel the investigated samples with a donor-acceptor dye molecule pair suited for smFRET and ensure that there is a biotin moiety for the immobilization on the surface of the sample chamber.\n\tNOTE: In order to localize an unknown antenna dye position with the Fast-NPS software different sample constructs are needed. Every construct needs to have one label at the unknown antenna dye position and one label at a satellite position known from the crystal structure. At least three different constructs with dyes attached to the antenna position and three different satellite positions are required for accurate results. Measurements between antennas as well as between satellites are also useful to improve the accuracy, however, this requires exchange of dye molecules which needs to be correctly entered in the analysis.\n2. Mounting of Flow Chambers in a Custom Holder\nPull silicone tubing (0.8 mm ID, 2.4 mm OD) into hollow tab screws (M4) and cut the tubing on both ends straight leaving an overhang of 1 cm on both sides by using a sharp razor blade. Adjust the overhang of the tubing to about 2 mm on one side of the tab screw.\nMount the flow chamber into the sample holder in a way that the holes in the quartz glass slide match the threads in the sample holder. Tighten inlet and outlet screws gently to ensure that the inlet and outlet of the sample chamber are still penetrable. Gently tighten the four screws of the acrylic glass holder to fix the position of the flow chamber.",
    "Cut silicone tubing (0.58 mm ID, 0.96 mm OD) into 20 cm long pieces. Insert one of the pieces to the inlet and the outlet screw of the measurement chamber. Close the inlet and outlet tubing by using a clamp.\n\tNOTE: The assembled sample chambers can be stored at room temperature for up to two weeks.\n3. smFRET Measurement on the TIRF Microscope\nUse a syringe to wash the sample chamber with 500 µL of PBS. Prevent air bubbles from entering the sample chamber at all times by creating a droplet at the end of the inlet tubing before changing to a different buffer solution.\nFlush the sample chamber with 100 µL neutravidin (0.5 mg/mL in PBS) solution and incubate 15 min at room temperature.\nWash out the neutravidin solution with 500 µL of PBS.\nScrew the metal holder for the prism onto the sample chamber.\nMount the sample chamber to the micrometer stage of the TIRF-microscope. Make sure to mount the sample chamber horizontally as straight as possible in front of the objective to avoid defocusing during scanning process.\nStart the software controlling the EM-CCD cameras and the software for controlling the piezo-motors of the stage.\nAdjust the focus of the microscope objective by looking at the reflections of the IR laser.\nPlace the prism (PS991, n = 1.52) on top of the metal prism holder. Adjust the lateral position of the prism to make sure that the laser beams hit the prism then use an adhesive and incubate with UV light for 5 min.\n\tNOTE: Mounted prism can be reused by cleaning.",
    "In the camera control software click \"Setup Acquisition\" and define the following acquisition parameters: 100 ms integration time, 401 frames/movie (green camera), 400 frames/movie (red camera), electron multiplier gain 225, pre-amplifier gain 5x and readout rate 3 MHz at 14 bit.\nCreate a folder on the local hard drive for the measurement. Choose a desired name for the measurement files, e.g., Year-Month-Day. In the software settings go to the \"Auto-Save\" rider, enable \"Auto save\" and choose file format *.sif for movie acquisition. Select the folder on the hard disk. Use the folder name as filestem.\nEnable the \"AutoIncrement\" function (set start value to 1). Enable the attachment of an operator to the filename. Use \"DON\" and \"ACC\" for the donor and the acceptor channel, respectively. Choose \"_\" as separator.\nIn the camera control software click on \"Video\" to start the live image of the camera and bleach background fluorescence by scanning the sample chamber using maximum laser intensity of all three lasers (combined ≈3,000 W/cm2 for 10 s per field of view).\nSwitch off the blue laser. Decrease the intensity of the green laser to around 200 W/cm2 and to around 40 mW/cm2 for the red laser if alternating laser excitation (ALEX) is used.\nDilute the biotinylated fluorescent sample to a concentration of 50-100 pM. Load 100 µL of the solution. The sample is immobilized on the chamber surface upon binding.\n\tNOTE: Make sure not to overload the chamber. Neighboring molecules must be separated from each other.\nIf necessary, load an additional 100 µL of a 2x more concentrated sample to the chamber.\nSeal the inlet and outlet tubing of the measurement chamber using clamps after loading is completed.\nSwitch off all lasers and use the piezo-motors to move the flow chamber two fields of view further.",
    "In the camera control software click on \"Take signal\" to start movie recording and switch on the laser at the same time. Ensure that more than 80% of the molecules are bleached by the end of the movie by adjusting the laser power.\nRepeat steps 3.17 and 3.18 for the whole prebleached sample chamber region.\n4. Acquisition of the Transformation Map (\"beadmap\")\nPrepare a flow chamber as described in Sections 1.1, 1.2 and 2.\nUse avidin-coated fluorescent multispectral beads which show fluorescence emission in the donor and the acceptor channel. Vortex the stock for 1 min, then dilute 50 µL of the stock in 50 µL ddH2O. Vortex again for 1 min, sonicate 1-2 min, then vortex another 10 s.\nCarry out steps described for smFRET measurements (Section 3.5-3.10).\nLoad 100 µL (1 chamber volume) of the 1:2 diluted fluorescent beads into the flow chamber. Wait 10 min for the fluorescent beads to bind to the surface.\nUse the acquisition parameters in 3.9 but change movie length to 26 (green camera) and 25 (red camera) and the electron multiplier gain to 10.\nSet the intensity of the green laser to a value of 20 W/cm2.\nTake one movie at a field of view with approximately 50-100 beads.\n5. Processing and Analysis of smFRET Data\nUse the custom written software SM FRET for the analysis of the beadmap (see Materials and Methods) and the acquired movies. Start the program viewPlot1.m.\nClick on Analysis|Batch Analysis, uncheck the option \"ALEX\" if it has not been used. For best performance choose the threshold for peak finding \"high\". Press \"OK\".\nChoose \"NO\" when asked if a beadmap has already been analyzed. Browse the folder containing the acquired beadmap and select the *.sif file (by double-clicking on it). In the next dialogue window press \"OK\".",
    "NOTE: If a beadmap has already analyzed in a previous measurement, choose \"YES\" here and select the saved beadmap by browsing to the correct folder and double clicking on the beadmap *.map file. Continue with step 5.8.\nChoose two single beads positioned in opposite corners of the field of view. The pixel intensities are color-coded from dark blue (low intensity) to dark red (high intensity).\nClick on the center of the first bead. If the center of the molecule can be located clearly by the color-coding, choose \"YES\" or else click \"NO\" and choose a different molecule pair.\nPosition the crosshair on the pixel showing the maximum intensity and press \"KEEP\". Repeat the process with the second channel.\nClick on the molecule in the opposite corner and repeat steps 5.5 and 5.6.\n\tNOTE: The relative pixel shift of the two channels is displayed in the command window and the transformation map is automatically saved as *.map file into the folder containing the beadmap *.sif file.\nTo load the donor and acceptor movies (*.sif) for the \"batch analysis\", browse to the folder, select all movies that shall be analyzed and click on \"OK\". In the next dialogue window, press \"OK\".\n\tNOTE: The batch analysis is finished when the last lane displayed in the command window starts with \"Finished analyzing…\". The detected molecules are displayed in a new window, which also indicates the relative shift of the donor and the acceptor channel determined from the transformation map.\nTo load the batched movie files click on File|Load. Uncheck the option \"ALEX\" if it has not been used. Set the smoothwidth to 10 and click \"OK\". Choose the folder containing the *.ttr files and click on \"select all\" and \"OK\" in the next context menu.",
    "If the displayed trace features the characteristic smFRET phases (Figure 2) press on the toggle button \"Not selected\" and first select the time point of the beginning of the FRET event by moving the line with the mouse cursor and clicking the left mouse button. Next select the time point of the bleaching of the acceptor molecule and finally the time point of the bleaching of the donor molecule.\nIn the next window the FRET efficiency is plotted in blue. To select the trace press the \"Yes\" button otherwise choose \"No\". To re-access a time trace click the \"Prev\" button.\nRepeat the procedure until the last molecule of the movie.\nAfter analyzing the last molecule in a movie save the selected traces by clicking on \"File|Save\". Save the selected traces in the same folder as the *.sif files.\nRepeat steps 5.10-5.13 for all acquired movies.\nExecute the program combine_fret_results.m. Select the folder containing the *.res files and all the *.FRETonly_trace files. Save the molecule-wise FRET and frame-wise FRET files as MW.dat and FRW.dat, respectively.\n\tNOTE: The *.dat files are saved as ASCII files. The FRW.dat file contains six columns and one row for each FRET-frame. The sixth column contains the corrected frame-wise FRET efficiency. The MW.dat file contains 21 columns and one row per selected FRET molecule. The third column contains the molecule-wise FRET efficiency.\n6. Displaying smFRET Data in Histograms\nNOTE: In order to extract the mean smFRET efficiency of all recorded smFRET data the frame-wise data or the molecule-wise data are plotted in histograms and analyzed using Gaussian fits to (multiple) peaks. In the following, the protocol uses a commercial data analysis software (see Materials List). However, any other available software can be used instead.",
    "Open a data analysis software (see Materials List). Click on File|Import|multiple ASCII. Select the folder containing the FRW.dat file. Select the file and press \"OK\". Accept the input option with \"OK\" without a change.\nSelect the third column C(Y) containing the corrected FRET efficiencies, right-click on the column and select Plot|Statistics|Histogram. In the histogram window double-click on the columns and deselect \"automatic binning\" and select a desired bin-size, e.g., 0.05. Also choose beginning and end values, e.g., -0.025 and 1.025.\nSelect the columns of the histogram by left-clicking on them. Then right-click and choose \"go to Bin Worksheet\". Select the \"Counts\" column by left-clicking on it and then right-click and select Plot|Column/Bar/Pie|Column.\nIn the column bar plot go to Analysis|Fitting|Nonlinear curve fit|Open dialog. Choose \"Gaussian\" under Function then go to the \"Parameter\" rider. Deselect auto parameter initialization. Fix the offset value (y0) at 0. Click on \"Fit\".\n\tNOTE: The fit function as well as the fitting details are now displayed in the column plot. The \"xc\" value gives the center of the fit function, i.e., the mean FRET efficiency that serves as the input parameter for the NPS software.\n7. Measurement of the Quantum Yield\nPerform quantum yield determination with the relative method similar to the procedure described by Würth et al.35, using Rhodamine 101 dissolved in ethanol (QY = 91.5%) as a standard.\nRecord absorption spectra at a UV-VIS spectrometer using an 80 µL volume in an absorption cuvette of 1 cm path length. The absorbance at the wavelength which will be used for fluorescence excitation has to be ≤ 0.05.",
    "Record emission spectra on a lamp-calibrated spectrometer operated in photon-counting mode. Perform the measurements with Glan-Thompson polarizers in the excitation (0°) and emission (54.7°) path (magic angle conditions) using a spectral bandwidth of about 5 nm and 2.5 nm for the excitation and emission monochromator, respectively. Measure samples after transferring them to a fluorescence cuvette with 3 mm path length taking care that the count rate does not exceed 106 s-1.\n\t\nCalculate quantum yield according to\nimgsrc://cloudfront.jove.com/files/ftp_upload/54782/54782eq6.jpg\nwhere n and nStd are the refractive indices of the solvent of the sample and the standard, respectively. f(λ) and f_Std (λ) are the fluorescence intensities of the sample and the standard at the wavelength λ. A(λex) and Astd (λex) are the absorbance of the sample and reference at the excitation wavelength and Φstd is the quantum yield of the standard.\n8. Calculation of the Isotropic Förster Radius\nCalculate the isotropic Förster radius (imgsrc://cloudfront.jove.com/files/ftp_upload/54782/54782eq5.jpg) from the emission spectrum of the donor molecule, the absorption spectrum of the acceptor molecule, the quantum yield of the donor and the refractive index of the medium. Use the freeware PhotochemCAD for the calculation of imgsrc://cloudfront.jove.com/files/ftp_upload/54782/54782eq5.jpg. However any other available software can be used instead36.\n9. Measurement of the Anisotropies\nDetermine steady-state fluorescence anisotropies from recordings of fluorescence spectra with various excitation/emission polarizer settings (V/V, V/H, H/V, H/H)36.\nCalculate the G-factor, which corrects for polarization artefacts of the instrument, for each wavelength from the ratio\nimgsrc://cloudfront.jove.com/files/ftp_upload/54782/54782eq9.jpg\n      and use it to calculate the anisotropy value for each wavelength:\nimgsrc://cloudfront.jove.com/files/ftp_upload/54782/54782eq10.jpg\n      where Ixy indicates the intensity for excitation polarization x and emission polarization y.\nAverage the values across the emission spectral range to calculate the steady-state fluorescence anisotropy.\n10. Installation of Fast-NPS Software\nDownload UCSF Chimera from http://www.cgl.ucsf.edu/chimera and follow the installation guide.",
    "Go to the website of the \"Institute of Biophysics\" at Ulm University: https://www.uni-ulm.de/en/nawi/institute-of-biophysics/software.html. Download the current version of Fast-NPS and extract it to a folder of choice. Open the subfolder “Redistributable” and install the Visual C++ Redistributable which is appropriate for the system.\n11. Centering the pdb File\nOpen the pdb file(s) of interest in Chimera. Select all atoms of the macromolecular complex and calculate the coordinates of the centroid (Tools|Structure Analysis|Axes/Planes/Centroids|Define centroid…|Ok).\nOpen the Reply Log (Favorites|Reply Log) and the Transformation Tool (Tools|Movement|Transform Coordinates). Enter the coordinates of the centroid shown in the Reply Log into the textbox \"Shift\" of the Transform Coordinates window and change the sign of every coordinate. Press \"Apply\" and save the file with \"Save PDB\" (File|Save PDB).\n12. Setting up the Position Priors\nNOTE: All values are considered in angstrom.\nStart the technical computing language and change the current folder to the local Fast-NPS folder. Enter in the command window: FastNPS.\nCreate a new jobfile in the Project Manager (Project|New).\nSet up the position prior (Tools|Model dye prior).\nIn the panel \"prior basics\" define the spatial resolution of the position prior by entering its value (2 is recommended).\nExclude the interior of the macromolecule by activating the check box and clicking on the \"load PDB\" button. Select and load the centered pdb file as described in Section 11.\nSpecify the approximate diameter (13 Å is recommended, see discussion) of the dye by entering its value.\nEnter a skeletonization distance, i.e., the distance the dye molecule may penetrate into the macromolecule (2 Å is recommended).\nIn the panel \"maximum prior size\" enter the minimal and maximal coordinates of the position prior (recommended: x in [-150,150], y in [-150,150] and z in [-150,150]).",
    "When defining a satellite, activate the checkbox \"attachment via flexible linker\" in the panel \"prior basics\" and enter in the panel \"linker\" the coordinates of the atom (in the centered pdb file) at which the dye molecule is attached. Further, specify the length and the diameter of the linker by entering their values (13 Å and 4.5 Å are recommended, see discussion). In case of an antenna skip this point.\nPress the button \"calculate accessible volume\".\nSave the position prior and optionally export it for visualization purposes using software such as Chimera.\n13. Defining the Network Geometry\nOpen the Define Measurement Window (Mode|Edit Geometry).\nCreate a new dye molecule by pressing the button \"New\" in the panel \"Dyes\".\nSet its fluorescence anisotropy (Section 9) by entering a value and select a dye model within the dropdown menu \"Dye model\".\nPress the button \"Load\", select the corresponding position prior and check the activate check box of the dye. Repeat this procedure for all dyes, i.e., for all antennas as well as for all satellites.\nAfter creating all dyes, define the measurements. Create a new measurement by clicking \"New\" in the panel \"Measurements\".\nSelect its FRET partners in the dropdown menus \"Dye1\" and \"Dye2\" below.\nEnter the smFRET efficiency with error and the isotropic Förster radius of this dye pair.\nFinally, check the activate check box of the measurement. Repeat this procedure for all measurements.\n\tNOTE: Oftentimes the network becomes increasingly complex, so that the user might get confused. In order to prevent mistakes, check the network visually by pressing the \"Check Network\" button. The figure displays the activated dyes and indicates measurements via lines interconnecting the FRET dyes.\n14. Calculation\nOpen the Calculation Window (Mode|Calculation).",
    "If every dye in the network has a specific model assigned, select \"User defined\" and start the calculation by pressing \"Calculation\". To have all dyes in the same model, select one of the five models (classic, iso, meanpos-iso, var-meanpos-iso and var-meanpos) and continue.\n\tNOTE: The command window will indicate the progress of the calculation. Fast-NPS will do so with a pop-up message, when the calculation has been completed.\n15. Visualization of Results\nIn order to export the credible volumes of the dyes, open the View Results Window (Model|View Results).\nExport dye densities:\n\t\nExport dyes singly or all simultaneously. In order to export a single dye select it in the panel \"Displayed Dyes\" and press \"Export Density\". Enter a resolution (2 is recommended) and choose a file type for exportation. On the right the density is previewed and some of its mathematical characteristics are shown.\nIn order to export all dyes simultaneously push \"Batch Export\".\nOpen the resulting density files in Chimera.\n16. Consistency Check of Chosen Model Combination\nOpen the View Results Window (Model|View Results). If in the panel \"Calculation Info\" the text box \"Consistency\" displays a value lower than 90% the current model does not represent the measured smFRET efficiencies sufficiently and is thus inconsistent.\nIn case of inconsistency push the button \"Detailed Consistency\". Search for the measurements that have a value below 90%. If one or more dyes are predominantly involved in these measurements, their models are likely to cause the inconsistency. Consider different dye models for these dyes and rerun the Fast-NPS calculation."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}