{
  "id": 14974,
  "origin_website": "Jove",
  "title": "Chromatin Immunoprecipitation in the Cnidarian Model System Exaiptasia diaphana",
  "procedures": [
    "A procedural overview is provided in Figure 1. The ChIP-Seq data are available in the NCBI Sequence Read Archive (SRA) under BioProject code PRJNA931730 (https://www.ncbi.nlm.nih.gov/bioproject/PRJNA931730).\nimgsrc://cloudfront.jove.com/files/ftp_upload/64817/64817fig01v2.jpg\nFigure 1: ChIP protocol workflow. Overview of the ChIP protocol workflow, including the estimated duration of each step and optional stop points. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64817/64817fig01largev2.jpg]\n1. Animal collection\nUsing a plastic spatula, gently detach 20 symbiotic E. diaphana (strain CC7) with a ~5 mm pedal diameter or larger from the aquarium walls, and pipette them into a 15 mL tube.\n\t​NOTE: Optimization of the number of anemones based on their size and how many IPs are intended is recommended. Anemones can be flash-frozen in liquid nitrogen (LN2) and stored at −80 °C for at least 1 month before starting the ChIP. Otherwise, proceeding straight away is recommended to prevent the anemones from settling on the walls of the 15 mL tube.\n2. Cross-linking\nPrepare 10 mL of 0.5% cross-linking buffer (Table 1).\nLet the anemones settle to the bottom of the tube, or spin them in a centrifuge for a few seconds, going up to ~3,500 x g at room temperature, and then remove excess seawater with a vacuum pump. Wash them in 1x DPBS by suspending them, and then remove the DPBS.\nTransfer the anemones into the 0.5% cross-linking buffer using tweezers or a plastic spatula to avoid transferring the superfluous buffer. Incubate on a rotator at 12 rpm and 4 °C for 1 h.\nMeanwhile, prepare 10 mL of 1% cross-linking buffer (Table 1).\nAs in step 2.2, remove the 0.5% buffer, and refill the tube with the 1% cross-linking buffer. Incubate on a rotator at 12 rpm and 4 °C overnight.",
    "NOTE: Ensure all the anemones are suspended and not adhering to each other by inverting the tube gently.\nThe next day, prepare 10 mL of quenching buffer from a 2 M glycine stock (Table 1).\nRemove the 1% cross-linking buffer as in step 2.2, and suspend the anemones in the quenching buffer to stop the cross-linking reaction. Incubate on a rotator at 12 rpm and 4 °C for 20 min.\nRemove the quenching buffer as in step 2.2, and wash the anemones twice in DPBS. If handling several samples, keep the anemones suspended in DPBS while working through steps 3.2-3.4 sample by sample.\n\tNOTE: The experiment can be paused by snap-freezing the sample and storing it at −80 °C for at most 1 month at this point. Remove any excess DPBS by emptying the tube onto a paper tissue before freezing and storage.\nTable 1: Solutions and buffers used in the ChIP protocol. The ingredients and their respective concentrations are listed for each buffer used in the protocol. Please click here to download this Table.[href=https://www.jove.com/files/ftp_upload/64817/64817_Table 1.xlsx]\n3. Homogenization and lysis\nPrepare the lysis buffer (Table 1) fresh on the day (2 mL per sample), and add 100x protease inhibitor cocktail (PIC, see Table of Materials) to a final concentration of 1x. Clean a porcelain mortar and pestle with ethanol, and start cooling all the tools with LN2.\nDecant the DPBS, and empty the anemones onto a paper tissue to remove as much liquid as possible. Pour some LN2 into the mortar, and transfer the anemones using tweezers.\nUsing the pestle, start by carefully breaking up the tissue, and then grind until the sample is a fine powder. Keep topping up with LN2 as needed to prevent defrosting.",
    "Place 2 mL of lysis buffer in a 5 mL tube on ice. Collect the sample using a spatula, and transfer it into the lysis buffer, ensuring the sample dissolves in the buffer. Let the sample rest on ice for 1 min, and then mix by inversion. Repeat steps 3.2-3.4 for all the other samples, thoroughly cleaning all the equipment with ethanol between samples.\n\tNOTE: Minimize the loss of sample as much as possible in this step.\nWash a Dounce tissue grinder (see Table of Materials) with lysis buffer, transfer the sample, and dounce 20-30 times with a tight pestle.\nTransfer the sample back into its tube, wash the tissue grinder with ethanol and distilled water, and repeat step 3.5 for all samples.\nIncubate the samples on a rotator at ~14 rpm and 4 °C overnight.\nUse Trypan blue to check for successful lysis under the microscope (20x magnification) by mixing it with 10 µL of sample at a 1:1 ratio. If the dye penetrates the nuclei, the lysis is successful.\n\tNOTE: The experiment can be paused at this point by storing the sample at −80 °C for up to 2 months.\n4. Sonication\nBriefly spin the sample in a centrifuge at ~2,000 x g for 3-5 s at room temperature to remove any liquid from the cap and walls.\nPass the lysate through a 25 G needle and 1 mL syringe 10 times to break up any aggregates.\nPlace the sample in an ice bath to keep it as cool as possible during the sonication.\nClean the sonication needle with ethanol. Place the sample in the sonicator (see Table of Materials) with the needle 1 cm above the bottom of the tube and not touching the walls.",
    "Set the duty cycle to 50% and the output to 0. Start the sonicator, and ensure no foam is being produced in the sample (otherwise, stop and readjust the needle position). Slowly increase the output power to 2, and then sonicate for 2 min.\nSwitch the sonicator off, set the output power back to 0, and let the sample rest and cool down for 2 min.\nRepeat steps 4.5-4.6 for a total of four sonication and cool-down sets per sample. Remove the sample, store it on ice, and then repeat with other samples. Clean the sonicator needle with ethanol between samples and at the end.\n\t​NOTE: The sonication intensity and cycle number may need to be optimized to reach the lowest sonication intensity while yielding fragments of 150-500 bp in size.\n5. DNA extraction and fragment size check\nNOTE: Before moving on to the IP, the size of the fragments needs to be checked. If the fragments are too large (>500 bp), the number of sonication cycles and/or the sonication intensity must be increased; if they are too small (<150 bp), the sonication time and/or intensity must be reduced.\nKeep the sample on ice while performing the fragment size check on a subset of the sample. Transfer a 100 µL subset into a fresh 1.5 mL tube.\nAdd 8 µL of RNase cocktail (see Table of Materials), and incubate at 42 °C for 30 min while shaking at 700 rpm.\nAdd 2 µL of proteinase K (see Table of Materials). and incubate at 55 °C for 1 h while shaking at 700 rpm.\nReverse cross-link the sample by incubating it at 95 °C for at least 1 h while shaking at 700 rpm.",
    "Prepare a 1% agarose gel with 1x TAE buffer and 0.01% ethidium bromide (see Table of Materials) or an alternative gel stain.\nExtract the DNA from the sample using a purification kit following the manufacturer's instructions (see Table of Materials).\nTo check the fragmentation size of the extracted DNA, load the agarose gel with a ladder and sample. Mix 4 µL of 1 kbp ladder with 1 µL of 6x purple loading dye, and place it into one well of the agarose gel. Mix 20 µL of DNA with 4 µL of 6x purple loading dye for a final concentration of 1x, and pipette into a well. Repeat for all the samples.\nRun the gel at 100 V for about 30 min, and then image the gel by loading it onto a tray, placing it in the gel imaging system, and following the instructions of the respective system's software (see Table of Materials). Decide whether to move on based on the fragmentation sizes, which should be between 150-500 bp on average (Figure 2).\nimgsrc://cloudfront.jove.com/files/ftp_upload/64817/64817fig02v2.jpg\nFigure 2: Fragment size check. Following the sonication, a subset of the sample is de-crosslinked, purified, and run on an agarose gel to ensure that the chromatin has been sheared to fragment sizes between 150-500 bp. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64817/64817fig02large.jpg]\n6. Immunoprecipitation (IP)\nUsing a pipette, check the volume of the main sample that was kept on ice during the DNA extraction. Add 10% Triton X-100 to a final concentration of 1%.\nSpin the sample at 20,000 x g at 4 °C for 10 min, and then transfer the supernatant into a clean tube using a pipette.",
    "NOTE: The experiment can be paused here by freezing the sample at −80 °C for up to 2 months. The details of the following IP steps will need to be adjusted and optimized for each experiment. The amount of antibody per IP may need to be optimized.\nUsing lysis buffer as a blank, measure the chromatin concentration following the instructions of an available DNA concentration measurement system (see Table of Materials).\nDepending on the sample volume and number of IPs planned, increase the total volume of the sample by adding 10% Triton X-100 and 100x PIC (see Table of Materials) to final concentrations of 1% and 1x, respectively. It is recommended to use 100 µg of chromatin in a total volume of 1,000 µL.\nDistribute the volume for each IP into a separate low-retention 1.5 mL tube (see Table of Materials). For ChIP-qPCR, place the equivalent volume of sample into another 1.5 mL tube as a mock control. Take 10% of the volume of the IPs as the input control, and store it at −20 °C.\nAdd 4 µg of antibody (here, H3K4me3 antibody, see Table of Materials) to each respective IP. Add nothing to the mock. Incubate the IP reactions and the mock on the tube rotator at 12 rpm and at 4 °C overnight.\n7. Recovery of the immunocomplexes with magnetic beads\nNOTE: Always avoid drying out the magnetic beads; keep them covered with liquid, or replenish the solutions as quickly as possible. Always work on one sample after the other.\nGently invert the magnetic beads (see Table of Materials) to mix.\nPrepare 10 mL of blocking solution (Table 1) fresh on the day, and mix gently.",
    "Cut off the tip of a pipette tip to increase the diameter, and transfer 50 µL of magnetic beads into separate tubes (one tube per IP and one for the mock).\nAdd 1 mL of blocking solution to each tube, and incubate them on a rotator at 12 rpm and 4 °C for 30 min.\nPlace the beads in the blocking solution on a magnetic rack, and wait for separation. Meanwhile, spin down the IP reactions at 2,000 x g for 3-5 s at room temperature to remove any residue from the walls.\nUsing a pipette, remove and discard the blocking solution supernatant, and then flush the beads off the wall with one of the samples or the mock. Place the mix back into the respective low-retention tube, and then move on to the next sample.\nIncubate all the tubes on a rotator at 12 rpm and 4 °C for 3 h.\n8. Wash, elution, and cross-link reversal\nPrepare the wash buffers and TE salt buffer (Table 1) during the immunocomplex recovery incubation.\nAfter the incubation, place the IPs and mock on the magnetic rack, and wait about 10-20 s for the magnets to separate.\nDiscard the supernatant, and add 1 mL of wash buffer with low salt. Repeat with all the reactions, and then remove the tubes from the magnetic rack and mix until the beads are suspended.\nIncubate on a rotator at 12 rpm and 4 °C for 5 min.\nPlace the tubes on the magnetic rack, remove the wash buffer with low salt, then add 1 mL of wash buffer with high salt, and incubate as in step 8.4.\nRepeat steps 8.3-8.5 once more for a total of four washes using low and high salt alternately.",
    "NOTE: The wash buffer with high salt is very harsh and should only be used for precisely 5 min in each wash step.\nRemove and discard the supernatant using a pipette, and wash with 1 mL of TE salt buffer; repeat once more. After the second wash, flush out any beads from the tube cap.\nMake the elution buffer (Table 1) during the washes. After discarding the second TE salt buffer wash, add 210 µL of elution buffer to each reaction.\nSuspend the magnetic beads, and elute at 65 °C, shaking at 700 rpm for 15 min.\nPlace the reactions on the magnetic rack, collect the eluate, and place it in a fresh 1.5 mL tube.\nRepeat the elution process with another 210 µL of elution buffer, and add the eluate to the first batch for a final volume of 420 µL of elute per IP and mock.\nRemove the input from the freezer, and add elution buffer to a total volume of 420 µL.\nReverse cross-link all the eluates and the input by incubating them at 65 °C and 700 rpm overnight.\n9. Protein and RNA digestion and DNA purification\nDilute the SDS (see Table of Materials) concentration to 0.5% by adding 420 µL of TE salt buffer to the eluate and input.\nFor the RNA digestion, add 10 µL of RNase cocktail (see Table of Materials), and incubate at 42 °C at 700 rpm for 30 min.\nFor protein digestion, add 8 µL of proteinase K (see Table of Materials) to all, and incubate at 55 °C at 700 rpm for 1 h.\nFor DNA purification, follow the \"Ren Lab ENCODE Tissue Fixation and Sonication Protocol for MicroChIP\"23 with some adjustments:",
    "Prepare tubes with Phase Lock gel (see Table of Materials) by spinning down the gel to the bottom of the tube at 20,000 x g for 1 min at room temperature.\nUnder a fume hood, add one sample and the same volume of phenol:chloroform:isoamyl alcohol (25:24:1) to each tube. Shake the tubes vigorously, and vortex them briefly until they form a frothy white layer.\n\t\tCAUTION: The mixture is toxic, corrosive, and a health hazard.\nSpin for 10 min at 4 °C and 20,000 x g. Check that the aqueous phase is clear.\nTransfer the aqueous phase into a fresh tube using a pipette. Two fresh tubes per sample are required depending on the likely sample volume. In that case, transfer half of the sample from the first into a second tube.\nAdd 1/10 of the volume in 3 M sodium acetate (NaAc, e.g., 40 µL for a 400 µL sample) and 10 µL of 5 mg/mL linear acrylamide to each sample, and invert to mix.\nAdd 2x the sample volume in 100% ethanol (e.g., 800 µL for a 400 µL sample), and shake vigorously. Do not vortex, as this may damage the DNA.\nIncubate at −20 °C overnight or at −80 °C for 30 min.\nCool down the centrifuge to 4 °C, and then spin the samples for 30 min at 15,000 x g to pellet the DNA.\nCarefully decant and then wash the pellets with 1 mL of 70% EtOH. Spin at maximum speed for 5 min at 4 °C.\nCarefully decant, and then spin again for a few seconds. Use a pipette to remove all the ethanol. If there is a small bit left, it may help to spin again.\nResuspend the pellets in 30 µL of nuclease-free water (see Table of Materials).",
    "NOTE: If there are several tubes per sample, resuspend one pellet in 30 µL, transfer to the next tube, and resuspend the next pellet in the same 30 µL.\nMeasure the DNA concentration, and then store the sample at −20 °C."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}