{
  "id": 6500,
  "origin_website": "Bio",
  "title": "Measurement of Sleep and Arousal in <em>Drosophila</em>",
  "procedures": [
    "Fly stock maintenanceMaintain stocks at 18 °C and 50% relative humidity (RH) under a 12:12 h light/dark cycle in standard fly food vials containing dextrose media (see Fly Food Recipe). Stocks that were sick and not laying enough eggs were transferred to fly media containing molasses (see Fly Food Recipe). Flip stock flies onto fresh food at least once per month.Fly collection for sleep assaysCollect 32 male flies on a CO2 fly pad under a stereo microscope and place into a standard food vial. Maintain collected flies at 21-25 °C under the same 12:12 h light/dark cycle and 50% RH for at least two days prior to the sleep assay.Virgin and mated female flies sleep differently and to prevent female flies from laying eggs in the tube we only test virgin female flies. However, this difference can vary depending on genotype and genetic background. Several studies also use sleep tubes containing 5% sucrose and 1% agarose as it prevents egg-laying.Use adult flies that are age-matched and in the range of 3-7 days post-eclosion for sleep assays.Preparation of Sleep TubesOne day before the trial is to be loaded, make sleep tubes to ensure that the food has appropriate moisture and hardness for 3-7 days of sleep recordings (see Recipes). Wrap a rubber band around bundles of 32 sleep tubes; one bundle will be needed per DAM being loaded (can be done in advance, see Figure 1A). While fly media is still hot, pour ~100 ml into each Petri dish. Immediately place bundles of sleep tubes upright into the Sleep Food such that the bundle stands independently with the open ends of the tubes submerged. The submerged portions of the tube will be filled with fly media, which will serve as a food and water source during the experiment.",
    "Ensure that tubes are not standing at an angle, as this will result in uneven food levels. Up to seven bundles will fit into each Petri dish. Cover drying sleep tube bundles with cheesecloth.When the media in the tube is solidified at room temperature (~30 min), remove the cheesecloth and carefully remove sleep tube bundles from the Sleep Food, ensuring that a plug of agarose remains in each tube. Remove the rubber band and clean the media from the sides of the sleep tubes with a paper towel. Dip the food-containing end of each sleep tube into paraffin wax two to three times to coat this end completely. It is not necessary to wait for the wax to dry between dips, but allow wax to solidify after all dips for approximately 5 s. If wax drips off the end leaving the food exposed, dip again until the food is completely covered. Place waxed tubes onto paper towels to dry at room temperature.Note: Store dry waxed tubes overnight in a refrigerator in a sealed container with a damp paper towel to maintain humidity. Tubes stored for more than one day may dry out and be unusable. Remove tubes from the refrigerator at least 2 h before their use to ensure there is no condensation inside and let them equilibrate to room temperature before loading flies.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190616/20190616195225_7457.jpgFigure 1. Preparation and loading of sleep tubes in the activity monitor. A. Sleep tubes (5 in x 65 mm) for loading food/desired nutritional substrate. B. Sleep tubes with flies loaded on the monitor. C. Monitors connected to the power supply unit and computer by 2 or 10” cables in the incubator. D. Food filled tube with paraffin wax seal on one end and a pipe cleaner on the other.",
    "Loading Activity MonitorsCut pipe cleaners into approximately 0.5 cm length, one piece per glass tube to be used.Place collected flies onto CO2 pad and use a paint brush to place one fly into the open end of the waxed sleep tube. With the fly inside, cap the open, non-waxed end with a piece of pipe cleaner. Place loaded tubes aside until 32 tubes have been filled.Place sleep tubes into the far right and far left columns of the monitor first (see Figure 1B). Push each tube into the holes of the monitor such that the pipe-cleaner end is protruding more than the waxed end.Place a rubber band around the top two rows of tubes (see Figure 1B). Do the same for the bottom two rows.Place the remaining tubes alternately above and below the rubber band so that they fit snugly and do not move freely (see Figures 1A-1D).When all tubes are loaded, align all tubes such that the center of the tube is in the center of the DAM. Align tubes by pressing the loaded DAM onto an even surface, like the tabletop, with the pipe-cleaner side down until the center of all tubes aligns with the center of the monitor. Note that this is the reason that the tubes were pushed further in the pipe cleaner direction in Step D3.After loading all DAMs with sleep tubes, place DAMs into a 21 °C incubator set to 50% RH and the desired 12:12 h light/dark cycle the flies were entrained on previously.Open DAM Software on the computer and enter monitor range. While you can load up to 120 monitors this is not recommended for sleep experiments as an activity reading has to be made every minute and loading more than 40 monitors can delay reading and cause errors in sleep measurements.",
    "Plug the monitors into the power supply unit that plugs into the computer that records monitor data as described in (Chiu et al., 2010).Ensure that the monitor numbers which are plugged in appear yellow at first pass, then green as they are automatically scanned by the DAMFileScan software.Leave monitors undisturbed in the incubator until the conclusion of the trial, changing the temperature if needed. For temperature-sensitive mutations, such as dTRP and Shibire (Kitamoto, 2001; Hamada et al., 2008), typically the temperature will be 21 °C during Day 1, raised to 29 °C at 9:30 AM (lights on) on Day 2, and lowered back to 21 °C at 9:30 AM on Day 3. Typical constant temperature experiments last five days in the incubator at 21 °C or 25 °C."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}