{
  "id": 4627,
  "origin_website": "Bio",
  "title": "Measurement of Cellular Redox in Pollen with Redox-Sensitive GFP (roGFP) Using Live Cell Imaging",
  "procedures": [
    "The method consists of harvesting pollen grains, incubating them in liquid germination medium, performing live cell imaging and making ratiometric analysis. Pollen will start to germinate at about 30 min. Then ratiometric imaging using a confocal microscope is performed. This can be achieved in a few minutes. Ratiometric image analysis can be performed at a later time point.In vitro pollen tube germination2-10 mg mature pollen of tomato or tobacco is obtained by vibrating anthers of open flowers with a biovortexer for about 5 seconds each (Figure 1 A-C). Note: Plant growth conditions affect pollen quality, especially for tomato. For example, appropriate temperature and enough sunshine are important factors required for proper pollen development. Moreover, infection with pathogens usually results in poor pollen yield and quality. Generally speaking, newly opened flowers contain pollen with greater vitality.Dilute the pollen with pollen germination medium to a final concentration of 0.5-2 mg/ml. Transfer them to 6 or 24 well cell culture plates and incubate at 25-28 °C on an orbital shaker. Tomato and tobacco pollen are rotated horizontally at 60 and 140 rpm, respectively (Figure 1D). Pollen grains hydrate immediately and germinate at around 30 min after incubation. It is recommended to observe pollen tubes within 8 hours while they maintain normal growth.Note: Temperature is critical for in vitro pollen tube growth and has a nonnegligible impact on the redox potential of growing pollen tubes. It is important to keep the pollen medium at a constant temperature throughout the experiment.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150302/20150302192326_1891.jpgFigure 1. Pollen collection and liquid germination assay. A. An image of a biovortexer. B-C. Mature pollen of tobacco (B) or tomato (C) was collected by vibrating using a biovortexer. D. Pollen in germination medium was transferred to a 6 well culture plate (~2 ml/well) or a 24 well culture plate (0.",
    "5 ml/well) and germinated on an orbital shaker under fixed room temperature.Microscope settingsDetailed parameters for an Olympus FV1000 are listed below. Other instruments need to be set to similar parameters.Chose the “multi-track mode”. In track 1, the excitation wavelength is 405 nm. In track 2, the excitation wavelength is 488 nm. Emission for both tracks is collected with a band-pass filter of 505-530 nm. A transmission image can be collected synchronously in either track 1 or track 2.Setting options.table:",
    "﻿0,1\nScan mode,XY\nScan direction,One way\nImage size,800 * 800\nBits/pixel,12 Bits\nSampling speed,4.0 μs/Pixel\nC. A.,80-120 μm\nIntegration type,Line Kalman\nIntegration count,4",
    "Note: The images should be taken in line mode to guarantee correct ratiometric analysis (Meyer and Brach, 2009). Other settings, including laser power, gain setting, sampling speed, pinhole size (C. A.), integration count, can be optimized empirically, but only images taken with identical settings are compared. In our study, Images were acquired with a 20x lens (UPLSAPO; NA0.75) with a bit depth of 212. Calibration of roGFP can be done to determine the absolute value of the redox potential and to see the redox dependent change dynamics. While we hadn’t attempt to calibrate the roGFP intensity in Huang et al. (2014), readers can refer to Meyer and Brach (2009). Redox-Sensitive GFP ImagingHydrating pollen grain or growing pollen tubes can readily be imaged with confocal microscope. Note: The cellular redox states in germinating pollen or growing pollen tubes at different time points are highly dynamic. It is important to compare two successive samples within a short periods of time (i.e., within 0.5 h).Add about 40 μl sample on a microscope slide, cover the sample softly with a cover slip and leave them for about 2 min.Place the slide on the microscope. Use the ‘fast’ scanning in both tracks to adjust the laser intensities and gain settings for roGFP-expressing pollen tubes. Avoid images that are too dim or overexposed. Do not change the laser intensity and gain setting once they are determined.Start collecting images.Image processing and ratiometric analysisOpen the combined images with Olympus Fluoview version 3.0a.Click “Ratio/Concentration” tool. Set appropriate ratio range and dividing the 405 nm excitation image (Figure 2B) by the 488 excitation image (Figure 2C) on a pixel-by-pixel basis. A resultant image (12 bit) and the color bar are shown in Figure 1D.Select the “Hi-Lo” pseudocolor scheme for both 405 and 488 channels in the lookup-table (LUT settings).",
    "In this color scheme, dim pixels are displayed in blue (Figure 2I, ROI3) while overexposed pixels are displayed in red (Figure 2G, ROI2).Draw a region-of-interest (ROI) for ratiometric analysis using the ROI toolbar. Avoid areas that are too dim (ROI3 in Figure 2I) or are overexposed (ROI2 in Figure 2G).Select “Intensity profile” tool and measure the signal intensities of ROI1 in both 405 and 488 channels. Save the intensity information to an Excel file.Mask out pixels with low signal intensities [a threshold of 100 was used in Huang et al. (2014)] before calculating the average intensities for each channel. Final ratio for statistic analysis is obtained by dividing the average intensity of 405 channel by that of 488 channel. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150302/20150302192407_0612.jpgFigure 2. Redox-dependent fluorescence of roGFP1 in the cytosol of a representative tomato pollen tube. A. Bright field. B. The 505-530 nm emission signal after 405 nm excitation. C. The 505-530 nm emission signal after 488 nm excitation. D. The 405/488 ratio of roGFP1 fluorescence. The inset showed the color scale for the ratio values. E. Three ROIs (Region of Interest) on the bright field image. F-I. Fluorescent images pseudo colored in green F-H or in the “Hi-Lo” scheme G-I. Bar = 10 μm"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}