{
  "id": 5732,
  "origin_website": "Bio",
  "title": "Assessment of Thermal Pain Sensation in Rats and Mice Using the Hargreaves Test",
  "procedures": [
    "Note: All of the following animal procedures were conducted in accordance with the United Kingdom Animals (Scientific Procedures) Act 1986. Please check with local/national regulations before starting the protocol. Choose a suitable room for behavioral assessment.Note: External stimuli such as noise and vibration in the environment can cause anxiety in the animals. They may exhibit excessive movements if they are anxious or freeze if they are frightened. In either case, this would make progressing with the test difficult. It is recommended to choose a calm and quiet room for the test, and preferably somewhere without any disruptions during the test.Set up the equipment as shown in Figure 1.Habituate the animals to the testing chamber.Transfer the animals from the holding room to the behavioral room in a calm manner.Gently place each animal into its own compartment of the enclosure.Acclimatize the animals to the enclosure for 30-60 min.Note: The animals may show curiosity to the new environment by moving around in the enclosure for the first 10-15 min, after which they should calm down. Placing sucrose/food pellets in the enclosure may be helpful in calming them down.Return the animals back to the holding room and repeat the habituation step for at least 2 days before performing the actual Hargreaves test.Thoroughly clean the enclosure and framed glass panel after each use.Perform the Hargreaves test.It is recommended that a baseline reading be obtained before starting the experiment. This step also allows the experimenter to optimize the test for each particular experiment and animal strain.Transfer the animals from the holding room to the enclosure as before.Acclimatize the animals in the enclosure for 15-20 min or until they are calm.Note: The animals may fall asleep while being acclimatized or during the test. Gently tap the enclosure to wake them up before performing the test if necessary.",
    "Set the desired infrared intensity (Figure 4).Note: This may require optimization before starting the experiment. 48 units was used for our experiment with adult male Lewis rats.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170810/20170810181742_1761.jpgFigure 4. Controller. The controller contains a display for reaction time in seconds, the START button and adjustable infrared intensity.Position the infrared emitter/detector on the vessel to directly underneath the center of the paw being tested (Figures 5-6).Note: The guiding lines on the vessel should be very useful for this step and there must be proper plantar placement of the paw for the test to be valid.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170810/20170810181932_7013.jpgFigure 5. Emitter/detector vessel. The guiding lines on the vessel are useful in positioning the infrared emitter/detector directly underneath the center of the paw.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170810/20170810182020_6995.jpgFigure 6. The correct positioning of the paw. The infrared emitter/detector should be positioned directly underneath the center of the paw (white arrows). There must be proper plantar placement of the paw for the test to be valid.Start the test by pressing the START button.Note: The timer should start automatically at the same time as the infrared light is being switched on.Observe the animal’s paw until the animal elicits a withdrawal response due to sensing of thermal heat.Note: Movement of the paw will be detected by the vessel, and the controller will automatically switch off the infrared light and stop the timer altogether. If the animal moves the paw voluntarily (not as a reaction to the heat), this is not a withdrawal response and the particular trial should not be included. Typical withdrawal response due to the heat should be accompanied by the animal checking/observing or licking their paw. (Video 1)<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Typical withdrawal response in rats. This video clip shows two different withdrawal scenarios of a rat that can occur whilst the animal is in the testing apparatus.",
    "The first example shows a proper withdrawal response in which the animal removes its paw from the heat and immediately licks its paw as a reflex. The second example shows removal of the paw from the heat source which is not due to the heat but rather is voluntary movement of the paw. In the second example there is no licking of the paw or acknowledgement of the heat and should therefore not be included as a proper withdrawal response.Record the reaction time.Note: Depending on local/national regulations, it is recommended that the trial should be terminated if the animal fails to respond within 20 sec to avoid potential burn injury.Repeat the test for at least 3 trials* to obtain an average reaction time.Notes: *If time permits, 5 trials are recommended. In this case, the lowest and highest values can then be discounted to remove outlying values.Allow for approximately 5 min of interval time before repeating the test on the same animal. The experimenter can test other animals in the enclosure during this interval.Carefully return the animals back to the holding room.Thoroughly clean the enclosure and framed glass panel after each use. Repeat steps 4a-4j at the next experimental data point if required."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}