{
  "id": 2026,
  "origin_website": "Cell",
  "title": "Protocol for assessing auditory brainstem response in mice using a four-channel recording system",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTiming: 4 h\nThis section describes the procedures to perform ABR testing using click stimuli and stimuli with varied frequency and SPL. Personal protection equipment should be worn throughout the procedures.\nTurn on the computer and open the Giant ABR recording software (provided by the manufacturer).\nAnesthetize 4 mice by using intraperitoneal injection of Avertin at the dose of 300 mg/kg body weight. Make sure the mice are deeply anesthetized (e.g., lack of response to toe pinch).\nNote: Wear a laboratory coat, protective gloves and face mask when working with mice.\nPlace the animals on a non-electric heating pad in a soundproof chamber (see also troubleshooting[href=https://www.wicell.org#troubleshooting]), maintain the animals' body temperature at 36.5°C–38.0°C (see also troubleshooting[href=https://www.wicell.org#troubleshooting]).\nCritical: Throughout the experiment, check the rectal thermometer from time to time to make sure the body temperatures are in the normal range.\nCritical: To prevent the drying of the cornea, add a drop of artificial tear to each eye.\nPlace the ABR electrodes to the vertex (active), the ipsilateral ear (reference), and the ipsilateral hindlimb (ground) (Figure 2[href=https://www.wicell.org#fig2]).\nCritical: Make sure that the electrode wires are tension-free. It is ideal that the needle electrode impedance should be less than 5 kΩ, and that the impedances of the electrodes are comparable.\nTurn on the ABR recording system. Close the soundproof chamber (see also troubleshooting[href=https://www.wicell.org#troubleshooting]).\nUse the Shenzhen Giant software provided with the ABR system to coordinate loudspeaker control as well as ABR acquisition, processing, averaging and data management. Sound signals are generated by a generator unit controlled by the software. Open the acquisition program and start data collection.",
    "Start the click stimulation procedure. Recording auditory brainstem responses to 512 click stimuli. Standardize the click stimulus at 100 μsec duration, 20/s, with a decreasing level from 90 dB SPL to 10 dB SPL in 10-dB SPL steps.\nOnce the click recording is completed, start the tone burst (20 ms duration with 1 ms rise and fall time, as well as 47 ms interval) stimulation protocol within the range of interest (e.g., 4–48 kHz).\nIdentify auditory thresholds for each stimulus by decreasing the SPL in 10-dB steps.\nContinue recording ABR until waves I, II, III and IV cannot be discerned.\nAdjust the sound pressure level up and down in 5-dB steps to identify the lowest level.\nRecord the response to each stimulus and obtain the mean response value over 512 measurements.\nNote: If it takes more than 45 min to carry out the ABR, or, after testing the first ear, the other ear needs to be assessed, temporarily suspend the test and inject an extra amount of Avertin (1/3 of the initial dose) to maintain a proper level of anesthesia in mice (see also troubleshooting[href=https://www.wicell.org#troubleshooting]).\nOnce the recording is completed, carefully remove the needle electrodes from the mice. Place the animals in a warm cage until they are fully recovered.\nWhen all tests are finished, soak the needle electrodes in a povidone iodine solution for 1 h. The electrodes were then rinsed with 75% ethanol, and kept in a sterile container.\nCritical: No electronics using A.C. should be utilized in the soundproof chamber when recording ABR."
  ],
  "subjectAreas": [
    "Health Sciences",
    "Neuroscience",
    "Model Organisms",
    "Behavior"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Ecology & Environmental Biology"
  ]
}