{
  "id": 19156,
  "origin_website": "Jove",
  "title": "Utilizing Transcranial Magnetic Stimulation to Study the Human Neuromuscular System",
  "procedures": [
    "1. Single and Paired-Pulse TMS of the FCR and ES Muscles\nBasic Safety Precautions: Prior to performing TMS on a human subject it is necessary to first screen them for basic safety precautions as it pertains to exposure to a magnetic field. In our laboratory we follow the screening guidelines set forth by the Institute for Magnetic Resonance Safety, Education and Research 10. In our laboratory we also routinely exclude individuals with a family history of epilepsy seizures. We also require subjects undergoing TMS of the ES muscles to wear earplugs and a mouth guard due to the less focal and stronger stimulation intensities.\nElectrical Recordings: To examine TMS responses in the motor system it is necessary to record electromyographic (EMG) signals from skeletal muscles. For the FCR muscle we place surface electrodes on the forearm using a bipolar electrode arrangement located longitudinally over the muscle on shaved and abraded skin as we have previously described 7,11. For the erector spinae muscles we use a similar electrode arrangement located longitudinally over the muscles at the L3-L5 vertebral level on shaved and abraded skin 8.",
    "TMS Coil Orientation: To predominantly activate corticospinal neurons transsynaptically it is necessary to position the TMS coil appropriately 12. For the FCR muscles we place a 70-mm figure-of-eight TMS coil tangential to the scalp and 45-degrees to the midline so that the induced current flows in a lateral-posterior to medial-anterior direction. For the ES muscles we use a double-cone coil that has greater penetration depth and is needed due to the representation of these muscles being deeper in the homunculus. Here, the coil is positioned such that the current flows in an anterior to posterior direction. We have custom-modified our coil with a laser attachment system to assist us in subsequent re-positioning of the double cone coil.\nIdentifying 'Hotspot': It is necessary to determine the stimulation location that elicits the largest motor evoked potential. For the FCR muscle we do this by subtly moving the TMS coil around in very small increments and determining where we observe the largest motor evoked potential amplitude. Once located we note this area with indelible ink on either the scalp or a lycra cap. TMS of the ES muscles is considerably more uncomfortable to human subjects than TMS of upper limb muscles. Accordingly, we have streamlined our TMS protocol for the ES muscles to increase it's tolerability and feasibility. Here, instead of locating the \"hotspot\" we use anthropometric measurements to identify the vertex of the skull. Specifically, we identify the vertex as the intersection of the skull in the sagittal (between the nasinon and inion) and coronal (between the tragus) planes.",
    "Biomechanical Positioning: In our laboratory when we perform TMS of the FCR muscles subjects are seated with the arm resting in an extended position in a BioDex System 4 Dynamometer (Figure 2). However, we should note that this is only an example of one possible set-up for measuring exerted forces. For the ES muscles subjects are asked to sit with an upright posture while their hands rest in their lap (Figure 3). They are seated in a swivel base chair with the thigh at 90° relative to the trunk, the lower leg at ~45° relative to the thigh, and the lumbar spine in a neutral posture8.\nQuantifying Motor Threshold: For the FCR, we determine motor threshold (MT) by delivering single pulses at gradually increasing stimulation intensities until motor evoked potentials have peak-to-peak amplitudes greater than 50 microvolts in more than 50% of trials (Figure 4). To streamline the TMS protocol and increase tolerability and feasibility we do not determine motor threshold in the ES muscles with the same precision as when we test the upper limb musculature. Rather, we begin the TMS protocol by delivering an initial single pulse at 50% of the maximum stimulator output to determine if this stimulus intensity is above or below motor threshold. If an MEP is observed at this stimulus intensity-defined as discernable MEP relative to the level of the background EMG-the intensity is reduced to 40% of stimulator output to determine if this stimulus intensity is sub- or supra-threshold 8.",
    "Quantifying MEP Amplitude using Single-Pulse TMS: To examine the motor evoked potential amplitude of the FCR we deliver a single TMS pulse to the 'hotspot' at an intensity equal to 130% of motor threshold, and calculate the peak-to-peak amplitude. Generally, we normalize this outcome to the maximal compound muscle fiber action potential observed following supramaximal electrical stimulation of the median nerve. We should note that the MEP size is very dependent on the degree of cortical excitability. Accordingly, when the TMS pulse is delivered during a background contraction, when cortical excitability is increased, the MEP size will dramatically increase. For the ES muscles, we deliver a single TMS pulse to the vertex at an intensity 40 or 50% above the sub-motor threshold intensity 8. Unfortunately, because peripheral nerves innervating the ES muscles are not accessible to electrical stimulation we are not able to normalize these motor evoked potentials to the compound muscle fiber action potential.\nQuantifying Silent Period Duration using Single-Pulse TMS: When a TMS pulse to the cortex is delivered during a muscle contraction it will produce a motor evoked potential followed by electrical quiescence before activity resumes that is indicative of corticospinal inhibition and commonly referred to as the silent period 13 (Figure 5). To quantify the silent period we deliver a single TMS pulse to the 'hotspot' at an intensity equal to 130% of motor threshold while the study participant is performing a wrist flexion muscle contraction at 15% of their maximal strength. We have not previously quantified the silent period duration of the ES muscles; however, we should note that we have anecdotally observed its existence in this muscle group when the TMS pulse id delivered during a background contraction.",
    "Quantifying Intracortical Facilitation using Paired-Pulse TMS: We use paired-pulse TMS to quantify intracortical facilitation 6,7 (Figure 6 and 7 represents this measurement for the FCR and ES muscles, respectively). For the FCR muscle we first determine the stimulus intensity needed to elicit a motor evoked potential that is between 0.5-1.0 mV. Next, we deliver a subthreshold conditioning pulse-which in our laboratory is commonly set equal to 70% of motor threshold- 15-msec before the suprathreshold test pulse. This conditioning pulse delivered at this time period prior to the test pulse will increase, or facilitate, the amplitude of the motor evoked potential more than a single unconditioned pulse of the same intensity. For the ES muscle group the conditioning pulse intensity is set to the observed sub-motor threshold intensity (either 40% or 50% of stimulator output) and the test pulse intensity is set to 40% above the sub-motor threshold level (80% or 90% of stimulator output)8. We should note that the intensity of the conditioning pulses could be varied depending on the objective of the study. Similarly, the pulse intervals can vary depending on the muscle and its location relative to the cortex.\nQuantifying Short-Interval Intracortical Inhibition using Paired-Pulse TMS: We also use paired-pulse TMS to quantify short-interval intracortical inhibition 6,7 (Figure 6 and 7 represents this measurement for the FCR and ES muscles, respectively). Here, for both the FCR and ES muscles, the procedures are the same as described for measuring intracortical facilitation with the exception that the interstimulus interval between the two pulses is reduced to 3 msec. This conditioning pulse delivered at this time period prior to the test pulse will decrease, or inhibit, the amplitude of the motor evoked potential more than a single unconditioned pulse of the same intensity.",
    "Quantifying Long-Interval Intracortical Inhibition using Paired-Pulse TMS: Delivering two identical suprathreshold test pulses that are separated by 100 milliseconds can also be used to assess long-interval intracortical inhibition 6,7. In this case-for the FCR muscle- the motor evoked potential associated with the second pulse will be smaller, or inhibited more, than that associated with the first (Figure 8). We have not previously quantified long-interval intracortical inhibition in the ES muscles due to concerns over subject tolerability.\n2. Representative Results:\nFollowing the delivery of a suprathreshold TMS pulse, the muscles being stimulated should demonstrate an easily observable EMG response (the MEP) (illustrated in Figures 4-8). The latency between the stimulus onset and the MEP will vary between the muscle groups being examined, but for the FCR it is generally 16-19 msec (Figure 6) and for the ES it is 17-22 msec (Figure 7; although it should be noted that in some subjects definitive MEP onset in the ES muscles is more difficult to visually identify). It should be noted that when testing the ES muscle group several other muscle groups are also visibly and dramatically stimulated concomitantly (including the muscles of the lower extremity, which are represented within the same general region of the homunculus). During the measurement of intracortical facilitation the MEP amplitude is generally larger than that observed with a single unconditioned pulse (Figure 6 and 7). However, it is our experience that the degree of facilitation varies between muscles groups with some muscle groups-such as the FCR- showing only modest facilitation in many subjects. For the measurement of short-interval and long-interval intracortical inhibition a decrease in the MEP amplitude is generally observed in comparison to a single unconditioned pulse of the same intensity (Figures 6-8).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3387/3387fig1.jpg",
    "Figure 1. The basic mechanisms of TMS. The TMS coil induces a magnetic field, which penetrates the scalp and induces an Eddy current within the motor cortex. This eddy current is then able to stimulate neurons within the brain. Figure reprinted from McGinley and Clark, In Press14.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3387/3387fig2.jpg\nFigure 2. Setup for performing TMS on the FCR muscle. Note the recording of electromyogram (EMG) signals from the forearm, and the TMS paddle over the motor cortex. We generally also record muscle forces, and use electrical peripheral nerve stimulation to obtain the maximal compound muscle fiber action potential, as this is useful in interpreting amplitude values (e.g., one can express and MEP relative to the maximal muscle response as opposed to a absolute mV value which can be heavily influenced by non-physiologic factors such as subcutaneous adipose tissue). Figure reprinted from the following: Clark et al. 20089, Clark et al., 20106, and McGinley et al. 20107.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3387/3387fig3.jpg\nFigure 3.  Setup for performing TMS on the erector spinale muscles. Figure reprinted from Goss et al. 20118.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3387/3387fig4.jpg\nFigure 4. Example of the motor threshold determination. The EMG traces represent the motor evoked potential (MEP) response to gradually increasing stimulus intensities (represented as a percentage of stimulator output (SO)). Note that at the lower intensities (28-30% of SO) very small MEPs were elicited (sub-threshold), but that at 32% SO a MEP was elicited that reached motor threshold (typically defined as an MEP with a p-p amplitude > 50 μV).\nFigure reprinted from McGinley and Clark, In Press14.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3387/3387fig5.jpg",
    "Figure 5. TMS during a contraction: motor evoked potential & silent period. The silent period is observed when a subject performs a slight contraction and a single stimulus is applied to the motor cortex. The first part of the silent period is due to spinal cord inhibition and the latter part is attributed to cortical inhibition, specifically GABAB receptors. There is no consensus way to quantify the duration of the silent period, but our findings indicate that either defining it from stimulus onset or MEP onset to the return of the voluntary interference electromyogram signal is the most reliable15.\nFigure reprinted from Clark and Quick, 201116, and McGinley and Clark, In Press14.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3387/3387fig6.jpg\nFigure 6. Change in motor evoked potential sized ith paired pulse TMS of the FCR muscle. Measurement of short-interval intracortical inhibition (SICI) and intracortical facilitation (ICF). To quantify SICI and ICF the conditioning pulse (CP) is set below motor threshold, and the test pulse (TP) is set to evoke MEP's between 0.5-1 mV. At short interstimulus intervals (e.g., 3-msec) the CP inhibits the MEP in comparison to the TP only (SICI), whereas at longer interstimulus intervals (e.g., 15-msec) it facilitates the MEP (ICF).\nCP: conditioning pulse, TP: test pulse Figure reprinted from Clark et al., 20106, McGinley et al. 201014, Clark and Quick, 201116, and McGinley and Clark, In Press14.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3387/3387fig7.jpg\nFigure 7. Change in motor evoked potential sized with paired pulse TMS of the ES muscle. Example of EMG traces from the erector spinae muscles and the measurement of short-interval intracortical inhibition (SICI) and intracortical facilitation (ICF).\nFigure reprinted from Goss et al. 20118.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3387/3387fig8.jpg",
    "Figure 8. Change in motor evoked potential sized with paired pulse TMS. Measurement of long-interval intracortical inhibition (LICI). To quantify LICI two test pulses are delivered at an interstimulus interval of 100-msec. This results in the second MEP being inhibited in comparison to the first MEP.\nFigure reprinted from Clark et al., 20106, McGinley et al. 20107 and McGinley and Clark, In Press14.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}