{
  "id": 4403,
  "origin_website": "Bio",
  "title": "<em>In organello</em> Protein Synthesis",
  "procedures": [
    "Isolation of mitochondria from leaves of Arabidopsis by a modification of the method described by Lister et al., (2007).Note: All subsequent steps perform at 4 °C in sterile conditions. Prepare 10% chlorox solution and store in cold room.Immediately prior to isolation, freshly add the following ingredients to previously prepared (see Recipe 2 below) Grinding medium and 2x wash buffer.table:\n﻿0,1\nGrinding medium,300 ml\n1% (w/v) BSA,3.00 g\n18 mM sodium ascorbate,1.06 g\n20 mM L-cysteine,0.74 g\n2 x wash buffer,150 ml\n0.2% (w/v) BSA,0.30 g\nThe remaining 50 ml of prepared 2x wash buffer (see Recipe 3 below) leave without BSA.Put these buffers in the cold room.Prepare heavy and light gradient solutions (35 ml). These recipes are sufficient for 4 gradient tubes.HEAVY (4.4% PVP-40)  table:\n﻿0,1\n2x wash buffer,17.5 ml\nPercoll,9.8 ml\n20% (w/v) PVP-40),7.7 ml\nLIGHT (0% PVP-40)      table:\n﻿0,1\n2x wash buffer,17.5 ml\nPercoll,9.8 ml\nMiliQ water,7.7 ml",
    "Put these solutions in the cold room.Immediately after making a heavy and light gradient solutions prepare 1x wash buffer with BSA. For this purpose mix the residual volume of 2x wash buffer with BSA with the same volume of MiliQ water to obtain 1x wash buffer with BSA. Store this buffer in cold room. Weigh 25 g youngest leaves harvested from 9- to 10-week-old Arabidopsis thaliana growing under short-day conditions (SD, 22 °C) per sample. Sterilize leaves for 5 min in 10% cold chlorox solution. Then rinse the leaves 2-3 times for 1 min in cold sterile MiliQ water. Store leaves on ice, in dark.Note: Store leaves in dark avoid activation of photosynthesis inside chloroplasts (which can hamper the isolation of purified mitochondria).Put the leaves in 100 ml Grinding medium and cut the leaves with scissors. Then add 2.5 g of sterile sand (50-70 mesh particle size) and grind leaves energetically in a mortar for 30 sec.Filter homogenate through four layers of Miracloth into a conical flask.Transfer filtered homogenate (volume of Grinding medium + volume of grinding tissue) to 2 pre-chilled plastic centrifuge tubes (volume of tubes 90 ml). Centrifuge for 5 min at 2,450 x g at 4 °C → pellets cell debris and nuclei (general scheme of isolation mitochondria is presented in Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140621/20140621002410_3997.jpgFigure 1. Scheme for the isolation of mitochondria from leaves of Arabidopsis thalianaTransfer supernatant to new tubes (volume of tubes 90 ml) and centrifuge for 12 min at 17,400 x g at 4 °C → pellets mitochondria, peroxisomes, etc.Discard supernatant and resuspend pellets in residual supernatant using a pre-wet with Grinding medium small paintbrush. Gently mix the residual supernatant touching with use of paintbrush the bottom of the tubes (volume of tubes 90 ml) to completely dissolve the pellet of mitochondria.",
    "Fill the tubes with 1x wash buffer with BSA and repeat centrifuge from steps 10-11 in order to pellet purified mitochondria.In the meantime make PVP-40 gradients in pre-chilled centrifuge tubes (volume of tubes 30 ml) using a gradient former model 485 (see Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140706/20140706203837_9944.jpgFigure 2. Preparation of linear PVP-40 gradient with a gradient former. Set up tubes on ice and tape outflow tubes (TO) to the inside of the tubes. Close off the connection (TAP) between chambers. Pour 8,75 ml light gradient solution into chamber without tubing outlet. Pour 8,75 ml heavy gradient solution into chamber with tubing outlet and place a small magnetic stir bar (MSB) in this chamber, place gradient former on stirring block (SB). A magnetic stir bar should rotate at a speed sufficient to ensure complete mixing. Set peristaltic pump and allow for a moment only heavy solution to run. Open connection (TAP) between the chambers and allow solution to mix. It is important that the end of the outflow tube (TO) is held below the level of the gradient former so that solution will flow by gravity to down the side of a tubes held below the apparatus. After centrifugation from step 13 discard supernatant and resuspend pellets in 1.75 ml of 1x wash buffer with BSA using a small paintbrush. Combine the two resuspended pellets of the same type to one tube.Load sample carefully on PVP-40 gradient. Balance tubes and centrifuge for 20 min at 28,000 x g at 4 °C with the brakes off → separation of mitochondria from chloroplasts and thylakoids.After centrifugation mitochondria should form a light yellow/grey clouds at the bottom of the tubes. Carefully remove and discard the layer above the mitochondrial fraction by aspiration with a pasteur pipette.",
    "Collect mitochondrial fraction with use of truncated tip to a six 1.5 ml Eppendorf tubes filling with 1 ml of 1x wash buffer with BSA. To each tube collect 2 x 200 µl of mitochondrial fractions.Note: Use of truncated tips allow to collect dense and cloudy mitochondrial fractions. Centrifuge for 12 min at 21,000 x g at 4 °C.Remove supernatant carefully by pipette. Pellet might sit very loose.Resuspend gently pellets in all Eppendorf tubes in the remaining medium by snapping the tube. Combine the resuspended pellets of the same type to two arbitrarily chosen tubes. Fill these two tubes with 1x wash buffer without BSA and centrifuge for 12 min at 21,000 x g at 4 °C.Remove supernatant and resuspend pellets in the remaining medium by gently snapping the tube. Combine the two resuspended pellets of the same type to one tube.Note: The purpose of this step was purification of isolated mitochondria from Percoll. First the washes in more Eppendorf tubes allowed to discard the remaining contamination from gradients. In the next centrifugation steps the number of Eppendorf tubes were reduced to the one, containing purified mitochondria.Fill final tube with 1x wash buffer without BSA-centrifuge for 12 min at 21,000 x g at 4 °C.Remove supernatant and resuspended mitochondria in 30 µl of 1x wash buffer without BSA.Keep mitochondrial fraction on ice to use immediately in the in organello protein synthesis.Protein assayDetermine the mitochondrial protein levels by DC Protein Assay Kit II, follow the instructions provided by the manufacturer. Estimate the protein concentrations for two independent amount of sample by comparison to a standard curve generated by the measurement of BSA of known concentrations. Using standard procedure, the assay is used with samples having protein concentrations between 0.2 and 1.5 mg/ml.",
    "The concentrations of mitochondrial proteins which we obtained are  between 20-25 µg/µl (mitochondrial fraction dissolved in 30 µl of 1x wash buffer).In organello protein synthesisFor each mitochondrial preparation, set up two labeling reactions: one for the synthesis mix and one for control synthesis mix, to estimate the bacterial contamination. Use sodium acetate in control reactions instead of malic acid and pyruvate. Sodium acetate is a nonoxidizable substrate that can be utilized by bacteria but not by mitochondria, hence amino acid incorporation in its presence gives an indication of bacterial contamination.Prepare pre-chilled disposable, sterile 3.5 ml tubes with round bottom .Add 25 µl amino acids (without L-methionine) and 1 mg BSA to 1 ml of Synthesis Mix with malic acid and pyruvate or 1 ml of Control Synthesis Mix with sodium acetate. BSA protects the freshly isolated mitochondria. Keep on ice.Pipette to the pre-chilled tubes 100 µl of Synthesis Mix or 100 µl Control Synthesis Mix.Add to each tubes 150 µg of freshly isolated mitochondrial fractions.Add 30 µCi 35S L-methionine -1.5 µl (20 mCi/ml) per sample and incubate at 25 °C for 30 or 60 min in incubator shaker (speed 180 rpm).Note: During the assay keep the mitochondria well oxygenated using a shaker, to avoid the risk of anoxia due to their sedimentation to the bottom of the tube. In our experience, increasing the incubation times beyond 60 min does not increase the labeling of mitochondrial products.Following incubation reactions are stopped by addition 350 µl of ice cold 1x Wash buffer without BSA containing 10 mM unlabelled L-methionine and puromycin (50 µg/ml).Mix using pipette and transfer sample to new 1.5 ml Eppendorf tubes. Keep on ice.Pellet the mitochondrial fractions at 21,000 x g for 5 min in centrifuge at 4 °C.",
    "Remove the supernatant (containing the free 35S-methionine) and resuspend the mitochondrial pellet in 30 µl of 1x wash buffer without BSA. Mitochondria may be frozen on dry ice and stored at -80 °C or resuspended in 20-30 µl of electrophoresis sample buffer for immediate SDS-PAGE analysis (see D).SDS-Polyacrylamide gel electrophoresis and autoradiographySolubilize entire mitochondrial sample in a 1x solubilzation buffer  by heating for 5 min at 95 °C. Analyse the samples on 12% SDS-polyacrylamide gel (Leammli electrophoresis system).After electrophoresis gently agitate gel on a platform shaker in isopropanol fixing solution for 15 min.Discard fixing solution and gently agitate gel in Rapid Commasie Blue G-250 staining solution for 30 min.Remove staining solution and gently agitate gel in destaining solution for 40-60 min until a clear background with blue protein bands appears.Agitate gel in water 3 times for 5 min.After rinsing agitate gel in water containing 5% (v/v) of glycerol for 7 min. Agitation the gel in water containing glycerol may protect gel before cracking during drying.Dry gel onto a Whatman 3 MM paper using gel dryer, and expose for minimum 3 days to a Kodak BioMax MR film."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}