{
  "id": 5578,
  "origin_website": "Bio",
  "title": "A Reliable Assay to Evaluate the Virulence of <em>Aspergillus nidulans</em> Using the  Alternative Animal Model <em>Galleria mellonella</em> (Lepidoptera)",
  "procedures": [
    "Fungal growth and conidia isolationPrepare the culture media (solid YUU media) for A. nidulans growth and heat-sterilize by autoclaving at 121 °C for 20 min. Cool the media at room temperature until it turns pleasant to touch. Transfer approximately 15 ml of the melted culture media to a sterile Petri dish. Let the agar plate solidify and air-dry for 20 min at room temperature.Note: From this step to the end of Procedure B, it is recommended to work in a laminar flow cabinet.From a stock culture (usually stored in slant culture tubes or Petri dishes containing solid media), pick a small quantity of fungal mycelia using a sterile inoculation loop or a sterile toothpick. Transfer the loop/toothpick content to solid YUU media (prepared in step A2) by gently streaking back and forth. Make sure that mycelium is equally distributed throughout the plate, instead of performing streak plating procedure. Incubate the culture at 37 °C for 2 days or until colonies are grown.Transfer 1 ml of PBS buffer to the surface of A. nidulans culture grown in solid YUU media (after step A3). Using the pipette tip, suspend the fungal cells and transfer the suspension to a sterile 15 ml conical tube. To obtain enough conidia, repeat this step with fresh PBS buffer at least 5 times, increasing the suspension volume to ≥ 5 ml. Fill a 250 ml beaker with approximately 200 ml of 70% ethanol solution. Immerse the tweezer in ethanol solution and carefully flame it in a Bunsen burner or in a lighter. Repeat this procedure 3 x and cool the tweezer for 2-3 min at room temperature.Using the flamed tweezer, insert a Miracloth filter or a small amount of the glass wool into the end of a sterile 20 ml syringe and isolate A.",
    "nidulans conidia by filtering the fungal suspension. Collect the filtrate in a new and sterile 15 ml conical tube.Note: The steps A3-A6 are shown in the Video 1 (Aspergillus growth and conidia isolation). <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Manipulation of A. nidulans for growth and isolation of conidia. This video shows step-by-step the manipulation of A. nidulans for growth and recovery in YUU (solid media), and isolation of the conidia by filtration using a syringe containing Miracloth filter or glass wool.Transfer 10 µl of the conidial suspension to a hemocytometer and, under a 100x objective of an optical microscope, count the number of A. nidulans conidia. The concentration of conidia/ml can be estimated through the sum of cells x 10,000/number of counted squares.Notes: Conidia should be uniformly distributed throughout the hemocytometer and the suspension should be diluted enough in order that cells do not overlap on the grids. The fungal suspension should contain at least 108 conidia/ml, so the volume of fungal suspension used is ≤ 10 µl. This is required to maintain the volume of G. mellonella hemolymph nearly to constant, as fungal suspension will be injected in larva body cavity (as described in Procedure B). If the conidial concentration obtained is inferior to 108 conidia/ml, harvest more A. nidulans mycelia (described in step A4) and repeat the filtration and counting.Use 106 A. nidulans conidia to each larva infection. Transfer the volume of conidial suspension containing 106 conidia x the number of larvae in the experimental group to a new 1.5 ml microcentrifuge tube. Reserve an equivalent volume of PBS to the control group.Injection of Aspergillus nidulans conidia in Galleria mellonella larvaeObtain the G. mellonella larvae after oviposition of the adult moths reared at the insectarium. Insects should be maintained inside plastic boxes, with small holes on its cover.",
    "Provide enough artificial diet (ad libitum) for the larvae to be able to dig their tunnels within the diet (Figures 1A and 1B). The development of instars (shown in Figure 1C) should occur after 20-30 days at 21 °C and in the dark.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170530/20170530203143_0955.jpgFigure 1. Maintenance and development of G. mellonella instars include incubation in aerated plastic boxes containing ad libitum artificial dietUsing gloves to avoid bacterial contamination and a blunt tipped tweezer, manually select 10-20 healthy G. mellonella larvae, from the last instar with similar size (15-20 mm) and weight (approximately 0.2 g) for each experimental group. Place up to 10 larvae into a sterile 100 x 10 mm Petri dish without any food. Notes: Creamy colored insects, which do not exhibit any grey pigmentation and are responsive to the tweezer touch, can be defined as healthy. Grey colored larvae should be discarded.Provide enough larvae for the experimental conditions and for two different control groups. The first control group may include larvae that are inoculated with PBS buffer, to monitor deaths provoked by physical injury. The insects of the second control group should not receive any injection.Wash the 10 µl Hamilton syringe by aspirating and discarding the 70% ethanol solution. Repeat this procedure at least 3 times.Remove the residual ethanol by washing the syringe with room temperature sterile water. Using the Hamilton syringe, aspirate 10 µl of fungal suspension, which contains 106 A. nidulans conidia (obtained in the step A8). Gently, pick a G. mellonella larva with one hand and firmly hold it by its back using your index and thumb fingers (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170530/20170530203404_1696.jpgFigure 2. Handling G. mellonella larva for A. nidulans infectionCarefully insert the needle of the Hamilton syringe into the larva last left pro-leg and slowly inject the volume corresponding to 106 A.",
    "nidulans conidia in the insect hemolymph (Figure 3).Notes: Avoid using too much force not to puncture the larva and leak the hemolymph. In such situation, select another larva.The steps B3-B7 are shown in the Video 2 (Injecting A. nidulans conidia in G. mellonella larvae) imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170530/20170530203534_7038.jpgFigure 3. Inoculation of G. mellonella by injection of fungal suspension in the larval last left pro-leg<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. G. mellonella infection with A. nidulans conidia. This video shows all steps, from the washing of Hamilton syringe to inoculation by A. nidulans conidia injection. In all experiments, inoculation was performed in the last left pro-leg.Place the larvae of each experimental group in a new sterile Petri dish. After manipulating all larvae, incubate them in the dark at 28 °C. Note: Larvae can also be incubated at 37 °C to mimic human body temperature.After 24 h of infection, gently touch the larvae with the blunt tipped tweezers to evaluate survival. Alive larvae (shown in Figure 4A) should respond quickly to touch, while absence of movement associated with a grey/dark pigmentation characterize dead larvae (present in 4B). Record the number of alive and dead larvae every 24 h in each experimental group. After approximately 10 days, larvae turn into pupa.Notes: Disposal of all animals used in the experiment should be done after autoclaving/decontamination of the Petri dishes containing the larvae.This step is shown in the Video 3 (Analysis of larvae survival).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170530/20170530203717_7231.jpgFigure 4. Analysis of the larvae survival after A. nidulans infection. Alive instars (panel A) exhibit creamy pigmentation and show movement response under stimulation. Dead instars exhibit grey/dark pigmentation and are unresponsive to touch.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 3. Evaluation of G. mellonella survival after A. nidulans infection. After A. nidulans inoculation, G. mellonella larvae were daily analyzed for unresponsiveness to stimulation (dead larvae)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}