{
  "id": 10443,
  "origin_website": "Jove",
  "title": "Material Formation of Recombinant Spider Silks through Aqueous Solvation using Heat and Pressure",
  "procedures": [
    "1. Recombinant spider silk mixture preparation from lyophilized protein stocks\nDetermine the necessary formulation and volume required for the intended material formations. Typical formulations range from 3% (w/v) up to 15% (w/v). Using this selection, calculate the appropriate rSSp, concentrations, and ratios.\n\t\nUse the following respective formulations to prepare each material described in this protocol: hydrogels/sponges/lyogels, 6% (w/v) 50:50 MaSp1:MaSp2; films/coatings, 5% (w/v) 80:20 MaSp1:MaSp2; adhesives, 12% (w/v) 50:50 MaSp1:MaSp2; fibers, 12.5% (w/v) 80:20 MaSp1:MaSp2.\n\t\tNOTE: Even though most formulations are better fitted for specific forms and materials, there is a wide range of formulations that can often overlap. Additionally, the final rSSp materials can also be tailored during formation and processing to produce the desired properties. Generally, each protein will require investigation into appropriate or useful parameters.\nSelect a clean and new 8 mL autoclavable borosilicate glass culture vial with a rubber lined screw cap.\nRemove the cap and place the empty vial on an analytical balance. Tare the mass of the empty vial so that the balance reads zero mass.\nAdd the desired lyophilized rSSp powder to the empty vial for each specific material.\n\t\nUse these specific masses of each protein type for each material, when preparing a 2 mL of solution: hydrogels/sponges/lyogels, 60 mg of MaSp1 and 60 mg of MaSp2; films/coatings, 80 mg of MaSp1 and 20 mg of MaSp2; adhesives, 120 mg of MaSp1 and 120 mg of MaSp2; fibers, 200 mg of MaSp1 and 50 mg of MaSp2.\nAdd the desired amount of ultrapure water, at least 2 mL, to the vial that already contains the weighted rSSp powders.\n\tNOTE: A minimal volume of 2 mL is recommended for all solvation procedures.",
    "Seal the vial cap and briskly vortex the contents to create a dispersed, and homogenous, rSSp mixture that is now ready for the solvation procedure. Additional homogenization approaches such as sonication or impeller mixing can be employed with, or in addition, the vortex mixing.\n2. Recombinant spider silk solvation\nCAUTION: High heats and pressures are generated during the solvation procedure. Proper personal protective equipment, especially goggles, long sleeves, and heat resistant gloves are required for this process.\nPerform a final check of the vial, or vessel, cap to ensure that it has been firmly and securely tightened. Then transfer the suspended rSSp mixture to a conventional microwave oven.\n\tNOTE: Microwave units within the power range of 700 to 1,500 Watts, possessing smaller internal chamber capacities, and rotating platforms are recommended to provide better solvation conditions.\nBegin operation of the microwave with 5 s bursts at full power. After each burst briefly open the door and carefully mix/swirl the vial to prevent settling and maintain the suspended mixture.\nRepeat this microwave process until the mixture and/or solution has obtained a temperature of at least 130 °C, when measured with an infrared thermometer directly against the solution containing portions of the vial. Repeat this process until all of the solid particulates have been completely dissolved and are no longer visible.\n\tNOTE: It is suggested to allow the vial and solution to cool occasionally, especially if the formulation has a high concentration of rSSp present. Temperatures exceeding 200 °C increase the risk of vial seal failure. Special attention must also be given to prevent the superheated mixture/solution from touching the seal, which will also result in vial containment failure.",
    "After successfully solvating the rSSp mixture into a solution allow the temperature of the solution and the vial cap to cool below 100 °C (boiling point) before opening.\n3. Hydrogels\nPrepare a hydrogel from the solution after removing it from the microwave and allowing it to cool and set. Cast the hydrogel into specific geometries prior to allowing it to fully cool.\n\tNOTE: Different rSSps will require varied amounts of times to transition to a hydrogel. For example, MaSp2-like sequences tend to form hydrogels more rapidly in comparison to MaSp1-like sequences. Protein concentrations, salinity, and pH also directly affect the rate of transition to a hydrogel.\n4. Sponges\nPrepare a rSSp sponges by first allowing the primary solvated solution to form a hydrogel.\nPlace the hydrogel in a water bath, place this bath in the freezer at -20 °C, and wait until the bath is frozen completely.\nComplete the sponge formation process by removing the frozen hydrogel and water bath from the freezer and thawing at 25 °C. The resultant sponge can now be removed from the thawed water.\n5. Lyogel\nPrepare a rSSp lyogel by directly freezing a formed hydrogel, either with or without a water bath, and transferring the frozen hydrogel sample to a lyophilizer (freeze dryer).\nRemove the final lyophilized gel material from the vessel that the moisture sublimation occurred in.\n6. Films and coatings\nUse one of the three following methods: solution casting, solution spraying, or dip coating to produce films or coatings of rSSp.\n\t\nCast the solubilized silk solution into/onto PDMS forms of the desired shape.\nPour and spread 200 µL of the film solution and allow this to dry before peeling them off of the PDMS substrate for testing or treatment.",
    "After allowing these to dry, remove the formed films for mechanical testing or post-treat the films to improve the mechanical properties.\nTo prepare a coating, or a film that cannot be removed from the substrate, use either spray or dip coating to produce a thin film layer.\n\tNOTE: To spray coat, this protocol has found success with a master airbrush model paint sprayer.\n\t\nForm a dip coating by simply submerging the substrate of choice into the solubilized rSSp and repeat after drying to achieve the desired thickness.\nPerform an initial spray coat before applying a dip coat to increase the consistency and effectiveness of the final coating.\n7. Adhesives\nNOTE: The formation of adhesives is achieved through one of the following methods.\nDirectly add the solubilized rSSp onto a substrate and then apply a second substrate over the top of the solution. Firmly clamp the pieces together and then dry the samples in an oven with a minimal temperature of 25 °C for at least 16 h.\nAlternatively, spray the two substrate surfaces with a spray coating and then clamp the substrates together.\nApplying the rSSp through the dip method of coating the substrates and sticking the substrates can also be used to prepare and adhesive.\n8. Wet-Spun fibers\nLoad the solubilized dope solution into a concentric syringe with Luer-Lok tip through a 19 G glide needle. Eject air bubbles and let the dope sit at the Luer-Lok end of the syringe.\nInsert at least 25 mm of PEEK tubing, internal diameter 0.01 inch, into the PEEK tubing’s one-piece finger tight Fittings for 1/16 inch OD and 10/32 cone. Attach this fitting to a PEEK tubing to Luer-Lok female adapter.\n\t\nReplace the 19 gauge needle with this set up on the loaded syringe.",
    "Fill a tall, clear glass bath with 99% pure isopropanol to use for coagulation bath.\n\t\nFill the stretch baths, located below the stretch godets. These will have 80:20 isopropanol: distilled water in the first stretch bath, and 20:80 isopropanol: distilled water in the second stretch bath.\nSet the godet stretch system such that the first godet after the coagulation bath and the first godet in the first stretch bath are rotating at the same speed.\n\t\nInitiate the first stretch by adjusting the speeds of the final godet in stretch bath 1, the middle upper godet, and the first godet in stretch bath 2 to the same speed. This speed will be 2x as fast as the initial fiber removal speed.\nInitiate the second stretch by adjusting the speeds of the final godet in stretch bath 2, the last upper godet, and the winder to the same speed. This speed will be 2x as fast as the speed used for the first stretch or 4x the initial fibers removal speed.\nPlace nitrile gloves on the outside of the intermediate godets to keep the fiber from slipping.\nStart to slowly extrude the solution into the coagulation bath. In an automated system set the extrusion rate to match a removal speed of 10 mm/s.\n\t\nAllow fiber extrusion to become uniform before pulling the fibers out of the bath using with a thin metal hook or forceps. Verify removing the fiber from the bath created a loop between the PEEK tubing tip and path the fiber leaving the bath the bath.",
    "Guide the retrieved fiber through the series of godets such that the fiber is submerged in the stretch baths but drying in the air between the stretch baths and before going onto a spool. This drying is achieved by the higher placed intermediate godets.\n\tNOTE: The fiber removal rate and/or extrusion rate will need to be adjusted based upon the protein concentration, additives, and protein type to allow ample coagulation time without pooling fibers on the bottom of the coagulation bath.\nAttach the fully stretched fiber to the spool on the winder mechanism using tape.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}