{
  "id": 12250,
  "origin_website": "Jove",
  "title": "A General Method for Detecting Nitrosamide Formation in the In Vitro Metabolism of Nitrosamines by Cytochrome P450s",
  "procedures": [
    "1. Materials and general procedures\nSynthesize NNN as previously described15. Obtain norcotinine, P450 2A6 Baculosomes, NADPH regeneration system, 0.5x reaction buffer, and all other chemicals or solvents from commercial sources in reagent grade.\nRecord NMR spectra on a 500 MHz spectrometer. Report chemical shifts as parts per million (ppm). Use residual solvent peaks as internal references for 1H-NMR (7.26 ppm CDCl3) and 13C-NMR (77.2 ppm CDCl3).\n\tNOTE: Peak splitting used the following abbreviations: s = singlet, d = doublet, dd = doublet of doublets, dt = doublet of triplets, dq = doublet of quartets, ddd = doublet of doublet of doublets, and m = multiplet.\nPerform high resolution mass spectrometry (HRMS) for selected compounds on an LTQ Orbitrap Velos and report data as m/z.\nUse polygram pre-coated silica gel TLC plates (40 mm x 80 mm, 0.2 mm thick) with 254 nm fluorescent indicator for thin-layer chromatography (TLC). Visualize TLC plates by UV lamp irradiation.\nPerform flash chromatography on a 60 Å, 70-150 mesh silica gel using a 1.5 cm x 15 cm glass column.\n2. Preparation of nitrosamide positive control (N′-nitrosonorcotinine, NNC)\nDry, in an oven overnight (16 h, ~140 °C), a 25 mL, round-bottom flask containing a magnetic stir bar. In the morning, cool the flask under a stream of N2 while using an oil bubbler to keep the N2 flow rate under one bubble per second.\n\tNOTE: After cooling, no precautions to keep the flask under N2 are required.\nIn a fume hood, add norcotinine (31.8 mg, 0.196 mmol), acetic anhydride (5 mL), and acetic acid (1 mL) to the cooled flask. Stir this mixture continuously while cooling to 0 °C with a water-ice bath.\nCaution: Acetic anhydride and acetic acid are corrosive.",
    "Add NaNO2 (33.3 mg, 0.483 mmol) in one portion and continuously stir the mixture for 2.5 h. Monitor reaction progress by TLC (100% EtOAc, Rf = 0.19, see step 1.4).\n\tNOTE: Over this time, the mixture will become increasingly yellow with occasional bubbling.\nQuench the reaction by pouring the mixture into ice-cold H2O (18 mL). Immediately extract the aqueous solution with 18 mL of CH2Cl2 in a 100 mL separatory funnel. Extract the aqueous layer at least 2 additional times with CH2Cl2 (9 mL each).\nDry the pooled organics over ~100 mg of MgSO4 for 2 min. Filter and concentrate the solution by rotary evaporation to yield a crude, yellow oil. Heat the water bath to 30 °C during evaporation to remove the residual acetic acid.\n\tNOTE: The protocol can be paused here if the compound is dissolved in CH2Cl2 and the solution stored in the dark at 2 - 8 °C.\nPurify the crude compound by column chromatography (see step 1.5) using silica gel as the stationary phase and 100% EtOAc as the eluent16.\nCaution: NNC and related nitrosamides should be handled with care as they are assumed to be human carcinogens.\nDissolve the pure compound in CDCl3 and use NMR (see step 1.2) to confirm the structure and determine the molarity of this solution17. Store this solution in the dark at 2 - 8 °C until needed.\n\tNOTE: This solution will be used as the positive control in the in vitro assay (step 3.5). NMR spectra and chemical shifts are available in the Supporting Information.\nWith a pure NNC solution, confirm the accurate parent mass and determine product ion masses by direct infusion on a high-resolution mass spectrometer (HRMS) under parameters described in steps 1.3 and 4.3.",
    "NOTE: Product masses will be used for detecting this compound in the in vitro metabolism assay (step 4.3).\n3. An example nitrosamine-P450  in vitro incubation\nRemove P450 2A6 Baculosomes, Vivid-NADPH-Regeneration System, and 10 mM NADP+ Stock Solution from a -80 °C freezer and let them thaw on ice. Once thawed, dilute the Baculosomes and NADPH-Regeneration System 1:10 and 1:50, respectively, into a single 1 mL tube with 0.5X reaction Buffer. Similarly, add 3 μL of the NADP+ Stock Solution to 97 μL of 0.5X Reaction Buffer.\n\tNOTE: NADP+ is light sensitive. Keep this solution protected by wrapping its container in aluminum foil. Enzyme solutions are sensitive to freeze-thaw cycles; limit this to no more than 2 cycles. Prepare aliquots as necessary for future experiments.\nFor each incubation, add 50 μL of enzyme solution (containing 5 pmol P450) to a 1 mL tube containing 40 μL of 4 μM NNN solution made with Reaction Buffer. Pre-incubate this new mixture for 2 min at 37 °C using a water bath and then add 10 μL of diluted NADP+ solution. Incubate the full system for 1 - 30 min at 37 °C.\n\tNOTE: Using 5-min intervals for incubation times (e.g. 5, 10, 15 min, etc.) will provide a sufficient nitrosamide formation time course.\nAfter the desired incubation time, quench by first adding 10 μl of 3.0 N ZnSO4 and then 10 μL of 3.0 N Ba(OH)2. Vortex this solution and a white precipitate will form. Centrifuge the sample at 8000 x g for 4 min to pellet the precipitate.\n\tNOTE: The procedure must not pause at this step as the formed nitrosamides have limited stability in aqueous solutions. Long pauses may result in false negatives.",
    "Immediately pipette the supernatant and analyze 2 μL by liquid chromatography positive nanoelectrospray-ionization high-resolution tandem mass spectrometry (LC-NSI+-HRMS/MS, Steps 4.1 - 4.3).\nFor positive control incubations, evaporate an aliquot containing 100 fmol of synthesized NNC solution into a 1 mL tube under a stream of N2. To this vial, add the full enzyme system from step 3.2 and proceed as described for steps 3.3 - 3.4.\nFor negative control incubations, perform the experiment as described (steps 3.2 - 3.4) except replace the 50 μL enzyme solution with 0.5X reaction buffer.\n4. Example parameters for nitrosamide detection by LC-NSI+-HRMS/MS\nFor the LC component, apply the following multi-step gradient in step 4.2 to a UPLC system using a commercial, hand-packed18 C18 (5 μm), 100 mm x 75 μm, 15 μm orifice capillary column.\nUsing 5 mM NH4OAc as solvent A and MeCN as solvent B, load the sample onto the column by running at 5% B at 1 μL/min from 0 - 5 min, and then slowing the flow rate to 0.3 μL/min afterwards. Next, run a gradient from 5 to 20% B over 4 min, followed by a ramp to 55% B over 10 min, and then re-equilibration to 5% B.\nPerform the LC-NSI+-HRMS/MS on a LTQ Orbitrap. Monitor for NNC by both full scan and MS2 fragmentation. Perform full scan at a resolution of 60,000 and extract the accurate parent mass (192.07670) at a mass tolerance of 5 ppm. Use MS2 fragmentation to isolate parent ions (2.0 amu) and fragment by collision-induced dissociation (CID) with a collision energy of 25 eV, resolution of 15,000, and scan time of 30 ms. Extract the accurate masses for product ions of NNC (m/z 192 m/z 134.04739 and 162.07874) at a mass tolerance of 5 ppm.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}