{
  "id": 5116,
  "origin_website": "Bio",
  "title": "Analytical Gel Filtration for Probing Heavy Metal Transfer between Proteins",
  "procedures": [
    "Required amount of proteinThe required amount of protein depends on how much metal donor and acceptor protein bind relative to their molecular weight. Using 100 nM of each donor and acceptor protein (1:1 stoichiometry) is a solid starting point. Lower amounts can be used, but accuracy will decrease.Protein oxidation stateCheck the putative protein metal binding sites of donor and acceptor proteins for oxidation sensitivity: Monovalent copper (amongst other heavy metal ion species) is often coordinated via cysteine thiols, which is prone to oxidation during protein preparation. In our example, the donor protein, MBD2, as well as the acceptor protein CopA feature copper binding sites involving oxidation-sensitive cysteines (Fan and Rosen, 2002; Fan et al., 2001). In case of oxidation sensitivity of either protein, add DTT from a 1 M stock solution (one may alternatively try 2-mercaptoethanol or TCEP, but we have not tested these) to a concentration of 5-20 mM and incubate for 1 h. Subsequently remove all the DTT by buffer exchange via desalting chromatography using NAP5 columns (alternatively, HiTrap desalt or PD10 columns will work as well). The handling should be performed according to manufacturer’s instructions. In addition, it is crucial to use freshly degassed buffer (e.g., use the storage buffer established for your protein of interest, or buffer A) to avoid reoxidation. After desalting, proceed immediately with your experiment, or flash-freeze the pre-treated protein in liquid nitrogen.Load the donor protein with metal (workflow illustrated in Figure 1)Copper in its divalent state (such as in CuSO4) is detrimental for proteins as it adsorbs to biosurfaces and oxidizes amide bonds. Hence, protein precipitation is often observed in the presence of Cu(II) salts. On the contrary, Cu(I) salts are highly redox-active and are almost insoluble in aqueous media.",
    "It is therefore recommended to load the donor protein by means of a colored low affinity organo-copper complex, such as [BCA2-Cu(I)]3-. The donor protein is therefore titrated with BCA-copper buffer until the mixture does not destain any longer and retains the characteristic violet color.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160727/20160727235531_1973.jpgFigure 1. Workflow for preparation of metal-loaded donor protein. A solution of the donor protein in apo state is titrated with a metal buffer, in this case a BCA-copper buffer. This indirect loading procedure avoids direct contact of the protein with excess copper and thereby protects it from metal-caused damage. Titrating little steps is advantageous because it allows monitoring the loading process. In case there is no destaining in the first titration steps, the donor protein may have suffered damage or is not receptive for metal loading at all. As soon as an excess of metal buffer is present in the protein solution, the mixture is loaded onto a size exclusion/desalting column (e.g., a NAP-5 column, used after manufacturer’s instructions) to yield the metal-loaded donor protein without contamination of free metal or metal chelator.Repurify donor proteinTo remove excess BCA, repurify the donor protein using a buffer exchange column (as in step 2c) equilibrated with buffer A. The eluted protein must not contain any blue stain (measure absorbance at 562 nm).Spectroscopic determination of protein concentrationMeasure the concentration of the loaded donor protein using a NanoDrop spectrophotometer and an experimental or predicted absorption coefficient (Pace et al., 1995).In case the concentration of the acceptor protein is unknown, it should be quantified likewise at this point.(Optional) Lipid emulsion preparationIn case of CopA, we experienced that reconstitution into lipid phase may be required for metal receptivity. Other membrane proteins (González-Guerrero et al., 2009) or soluble proteins may not require this step.",
    "Optimum conditions for reconstitution may vary and require testing for each individual case. For the presented procedure, a uniform vesicle size is advisable. Therefore, 10 % (w/v) lipid suspensions of phosphatidylcholine were emulsified by sonication for 10 min (ultrasonic homogenizer, low intensity dipped probe). The particle size distribution may be facultatively checked by means of a dynamic light scattering instrument.(Optional) Lipid reconstitutionAdd a 10 fold (w/w) excess of the 10 % lipid suspension to a defined amount of protein and incubate at 37 °C for 20 min and gentle agitation.Equilibration of the columnEquilibrate gel filtration column with 2 column volumes of buffer A. Meanwhile store donor and acceptor protein on ice. Ion transferMix donor and acceptor protein in molar ratio of 1:1 to 2:1 and incubate for 5 min at room temperature, then add buffer A to a total of 500 µl (for GE Healthcare Tricorn 10/300 columns).ChromatographyApply protein mixture to the chromatography column using the autoinjector of the unit (500 µl in 1 ml sample loop) and start the elution using a flow rate of 0.2 ml min-1 and a fraction size of 1 ml over 30 ml. An increased flow rate will work fine as well, although leading to higher dilution of the proteins.Save the chromatogram UV and (if available) conductivity traces; it should look like the diagram in Figure 2A. Collect fractions exhibiting UV absorption and store for the later analysis of copper content (see below). Electrophoretic control of separation10-50 µl samples can be drawn from each fraction for electrophoretic analysis of separation (perform electrophoresis according to manufacturer’s instructions).If donor and acceptor proteins form a stable complex during chromatography, incomplete dissociation should be observed.In case of transient interaction during transfer, both proteins are well separated (see Figure 2B).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160728/20160728000127_8774.jpgFigure 2. Exemplary Data on gel filtration and electrophoresis. A.",
    "Typical UV absorption (black trace) and conductivity (gray trace) data read-out of the automated chromatography unit. The example shows a separation of MBD2 (donor) and lipid-reconstituted CopA (acceptor) using a Superose 6 column. Relevant peaks are labeled with respect to their content. B. SDS-PAGE for testing effective separation between donor and acceptor proteins is an important control experiment to rule out complex formation between donor (B-fractions) and acceptor (A-fractions).Transfer fractions to 1.5 ml polypropylene vials and add 40 µl of SDS-solution [1% SDS (w/v) final concentration] to each fraction. Incubate at 65 °C and slight agitation until protein or lipid-protein emulsions are completely homogenized and the solutions appear clear. This can take up to 1 h. Cool down the samples and centrifuge for 1 min at 1,000 x g to collect the entire liquid at the bottom of the tube.Record UV-spectra of each sample.Check for the absence of a non-desired scattering curve underneath the protein absorbance spectrum. In case of scattering, add another 40 µl of SDS solution, incubate for 1 h and re-measure.(Optional) In case the expected metal concentrations are low, samples can be concentrated using a centrifugal evaporator (“Speed Vac”) to increase sensitivity. We experienced that concentrating to 300 µl does not cause any precipitation, but the actual level to which a sample volume can be reduced really depends on the particular experiment.Volume determinationMeasure the exact volume of each sample, either volumetrically by using a calibrated micropipette or gravimetrically with an analytical balance [assumed density 1.02 (500 mM NaCl solution), error due to density mismatch and the precision of the pipette are in the same range].Detection of metal contentNote that many colorimetric quantification methods for different metal ions are described, some of which are mentioned in the review by Xiao and Wedd (2010).",
    "For copper, we chose to use BCS because it has a high extinction coefficient in the visible light range. Add 1% ascorbate (v/v) and 5% BCS solution (v/v) to each sample and incubate 5 min at room temperature.Measure the absorbance of each sample at 482 nm.Data analysisCalculate protein concentrations using either the computed (Pace et al., 1995) or experimental extinction coefficients.Calculate the exact metal concentration using the extinction coefficient of the [BCS2-Cu(I)]3--complex of 13,000 M-1 cm-1 (Xiao et al., 2011). Take into account all dilution steps.Sum up total molar protein and copper concentrations in donor and acceptor fractions and calculate their ratios to determine the ion transfer efficiency.Note that in case of a reconstituted membrane protein, a 100% efficiency is very unlikely and has never been reached in our experiments. This is due to anisotropic integration of the CopA acceptor protein into the lipid phase and the resulting inaccessibility to the metal donor protein. With soluble proteins, transfer efficiencies of over 90% can be observed."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}