{
  "id": 3718,
  "origin_website": "Cell",
  "title": "Optimized protocol for gene editing in adipocytes using CRISPR-Cas9 technology",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation of lentiCRISPR-sgRNA vector\nTiming: 3 days\nAlternatives: sgRNA can also be delivered by retrovirus or by electroporation. If you already have the established retroviral vector, directly jump to step 6 of the sgRNA screening part for instructions on how to screening sgRNAs with high editing activity. Skip the part on lentiviruses preparation and infection (steps 4–6), if you are preparing to deliver genes via electroporation.\nDay 1. Part One-Preparation of sgRNA oligonucleotide inserts.\nDissolve the sgRNA oligonucleotides in ddH2O and dilute to a final concentration of 10 μM. Set up the following reaction for each pair of sgRNA oligonucleotides:\ntable:files/protocols_protocol_438_5.csv\nNote: The KOD buffer is from the KOD-Plus-Neo kit (TOYOBO, # KOD-401).\nAnneal these sgRNA oligonucleotides at 95°C for 5 min, and cool the mixture to room temperature (∼25°C).\nDay 1. Part Two-Digestion of the lentiCRISPRv2 plasmid.\nNote: This step can also be done before step 1.\nThe lentiCRISPRv2 plasmid is obtained as a gift from Feng Zhang (Addgene plasmid #52961; RRID: Addgene_52961): Digest the lentiCRISPRv2 plasmid (1 μg) with 0.5 μL BsmBI enzyme at 55°C for 1 h. Run samples on 1% (wt/vol) agarose gel to verify the appropriately sized fragment (12,994-nt DNA fragment). Successful digestion should yield 12,994-nt and 1,879-nt DNA fragment.\ntable:files/protocols_protocol_438_6.csv\nDay 1. Part Three-Cloning of sgRNA into the lentiCRISPRv2 vector.\nSet up the ligation reaction for each sgRNA as following:\ntable:files/protocols_protocol_438_7.csv\nIncubate the ligation reaction at room temperature (∼25°C) for 2 h.\nTransform the ligation reaction into a Trans5α chemically competent cell. Incubate the mixture on ice for 30 min, followed by heat shock at 42°C for 30 s, and immediately re-incubate on ice for 2 min.",
    "Note: It is recommended to transform the lentiviral plasmids in NEB Stable competent cell or One Shot StbI3 chemically competent cell (Invitrogen) to reduce potential homologous recombination.\nAdd 100 μL LB buffer to the ligation mixture from step 3c, then incubate the mixture at 37°C for 1 h in a shaker.\nAdd the mixture from step 3d onto an LB plate with 100 μg/mL ampicillin. Incubate the LB plate at 37°C for 12–16 h.\nCritical: Prepare a negative control plate (ligation of BsmBI-digested lentiCRISPRv2 alone without annealed sgRNA oligo insert).\nDay 2: Assess the plate for colony growth. Typically, multiple colonies should grow on the lentiCRISPR-sgRNA (sgRNA inserted into lentiCRISPRv2 plasmid) plate, and the negative control plate should not have colony growth.\nSelect two or three colonies from the lentiCRISPR-sgRNA plate to confirm the insertion of sgRNA into lentiCRISPRv2 vector. Grow each single colony in 3 mL LB buffer with 100 μg/mL ampicillin and shake the LB buffer at 37°C for 6 h.\nNote: The time for incubation is flexible.\nIsolate plasmid DNA from the bacterial cultures using a TIANprep Mini Plasmid Kit, according to the manufacturer’s instructions (https://www.tiangen.com/asset/imsupload/up0062501001604555834.pdf[href=https://www.tiangen.com/asset/imsupload/up0062501001604555834.pdf]).\nDay 3. Verify the CRISPR vector, designated as lentiCRISPR-sgRNA1, by sequencing. Sequence each colony from the U6 promoter using the U6 primer. The 20-bp sgRNA sequence should be inserted between the U6 promoter and the remainder of the sgRNA scaffold. Further details and sequence of the lentiCRISPRv2 vector can be found at http://n2t.net/addgene:52961[href=http://n2t.net/addgene:52961].\nScreening sgRNAs with high editing activity\nTiming: 11 days\nNote: It is recommended to screen for sgRNAs with high editing activity in HEK293T cells (for gene editing in human cells) and NIH3T3 cells (for gene editing in mouse cells).\nPreparation of lentiCRISPR-sgRNA virus\nTiming: 5 days",
    "HEK293T cells culture. Culture cells in DMEM supplemented with 10% FBS at 37°C and 5% CO2.\nDay 1. Prepare cells for transfection. Plate HEK293T cells onto 10-cm plates in DMEM supplemented with 10% FBS 16–24 h prior to transfection. Typically, plate ∼4 × 106 cells in a 10-cm plate (∼5 × 104 cells/cm2).\nNote: It is recommended to transfect the plasmid mix when cells are 80%–90% confluent.\nDay 2. On the day of transfection, replace the growth medium with 6–8 mL DMEM 4–6 h before transfection. Prepare polyethylenimine (PEI) transfection reagents for each 10-cm plate as following:\nCritical: It is important to perform this step gently and carefully because HEK293T cells can be easily detached. It is also recommended to pre-coat cell culture plates with poly-L-lysine or collagen to prevent cell detachment.\nAlternatives: PEI-based transfection can be replaced with calcium phosphate or lipofection-based approaches.\nMix the lentiviral plasmid with the packaging vectors (total ∼25 μg plasmid DNA), and subsequently dilute the mixture in 300 μL DMEM by pipetting up and down for a few times.\ntable:files/protocols_protocol_438_8.csv\nMix the PEI stock gently before use. Thereafter, add 75 μL PEI (the ratio of PEI volume (μL) to the amount of total DNA (μg) is 1:3) to 300 μL DMEM and mix gently by pipetting up and down for a few times.\nAdd the PEI/DMEM solution (375 μL) to the diluted DNA/DMEM mixture and mix immediately by pipetting up and down for a few times or vortexing.\nIncubate the mixture at room temperature (∼25°C) for 15 min, and add the mixture to each plate with gentle rocking for 2 or 3 times.\nAfter 4–6 h, replace DMEM with growth medium.",
    "Days 4 and 5. Collect the virus-containing medium 48 h and 72 h after transfection. Thereafter, filter the medium with a 0.45 μm vacuum filter, and store the virus-containing medium at 4°C for immediate use. For longer term storage at −80°C, the virus-containing medium can be concentrated by centrifugation with a Beckman JA25.50 rotor (capacity for eight tubes) at 48,384 × g for 2 h at 4°C.\nNote: Lentivirus can be dissolved in cold PBS or DMEM. Usually, for one 50 mL tube, it is recommended to dissolve the virus with 200 μL cold PBS or DMEM. For more detailed information about the production and purification of lentiviruses, please refer to (Tiscornia et al., 2006[href=https://www.wicell.org#bib9], Dull et al., 1998[href=https://www.wicell.org#bib2]).\nAlternatives: Lentivirus can also be concentrated via polyethylene glycol (PEG)-based system (Larcombe et al., 2019[href=https://www.wicell.org#bib4]). Troubleshooting 1 (Low titers of lentiviruses)\nTiming: 2–3 h\nLentivirus titration (: Titer the concentrated lentivirus with a commercial qPCR Lentivirus Titration Kit, according to the manufacturer’s instructions (https://www.abmgood.com/pub/media/productdocument/document//l/v/lv900_datasheet_v18.pdf[href=https://www.abmgood.com/pub/media/productdocument/document//l/v/lv900_datasheet_v18.pdf]). Typically, the lentivirus titer of a 10-cm plate is ∼1 × 107 pfu.\nLentiviruses transduction in NIH3T3 cells\nTiming: 6 days\nDay 1. Plate NIH3T3 cells in a 12-well plate 1 day before transduction.\nDay 2. Infect cells with lentiviruses at a MOI of ∼30 and allow lentivirus-infected cells to grow for another 2 days.\nDay 4. Treat cells with 3.5 μg/μL puromycin for 2 days to remove non-infected cells.\nDay 6. Collect cells for genomic DNA extraction.\nNote: Polybrene can be added to increase transduction efficiency.\nCritical: Do not forget to set up control groups (cells infected with lentiviruses that carry no sgRNA or express only GFP). At least include one of them as a control, and it is recommended to include both as controls.\nSurveyor assay to validate sgRNA function\nTiming: 1 day",
    "Note: The Cas9 and sgRNA in cells can cause genomic insertion or deletion (indel) mutations, which can be detected via either the surveyor assay or sequencing. The surveyor primers can be designed via the online Primer Design Tool. For example, Primer 3.0 Web (http://primer3.ut.ee[href=http://primer3.ut.ee]).\nExtract genomic DNA from different group cells using the TIANamp Genomic DNA Kit, according to the manufacturers’ instruction (https://www.tiangen.com/asset/imsupload/up0484377001604554551.pdf[href=https://www.tiangen.com/asset/imsupload/up0484377001604554551.pdf]).\nSet up the PCR reaction as follows:\ntable:files/protocols_protocol_438_9.csv\nNote: Design PCR primers for amplification (Surveyor-F/R) of the target region with the predicted SpCas9 cut site in the center. It is recommended to design a primer pair that will produce a ∼600 bp band.\nThen perform PCR using the following cycling conditions:\ntable:files/protocols_protocol_438_10.csv\nNote: The time for extension is mainly determined by the length of DNA product and the DNA polymerase used.\nRun the PCR products on a 1% (wt/vol) agarose gel. Purify the PCR product using a Gel Extraction Kit, according to the manufacturers’ instruction (https://www.cwbiotech.com/uploads/websitepdf/216c4037-3eae-4ac2-b86a-762277a7adc1.pdf[href=https://www.cwbiotech.com/uploads/websitepdf/216c4037-3eae-4ac2-b86a-762277a7adc1.pdf]).\nAnneal the PCR products as follows:\ntable:files/protocols_protocol_438_11.csv\nNote: Put the mixture at 95°C for 5 min.\nNote: Take equal amounts of DNA product from different lentiviruses-treated cells (lentiviruses carrying sgRNA or no sgRNA) for analysis.\nDigest the annealed DNA fragments with 0.5 μL T7 Endonuclease I (T7EI) enzyme at 37°C for 1 h.\nRun samples on a 1% (wt/vol) agarose gel.\nDetermine the cleavage efficiency by quantifying gel bands without overexposing them. A high-efficiency sgRNA will result in obvious cleavage bands, whereas the negative controls should have no cleavage bands. Troubleshooting 4 (No obvious cleavage bands after T7 endonuclease I digestion).\nOptional steps\nTiming: 5 days\nTwo sgRNAs can be cloned into one lentiCRISPRv2 vector. The lentiCRISPRv2 vector can be modified to target two different genes simultaneously.",
    "Day 1. Prepare the following reaction mixture to digest 1 μg of pUC57-MU6-gRNA plasmid DNA:\ntable:files/protocols_protocol_438_12.csv\nDigest the pUC57-MU6-gRNA plasmid with 0.5 μL BbsI enzyme at 37°C for 2.5 h and run the product on a 1% (wt/vol) agarose gel to verify successful fragment.\nNote: The pUC57-MU6-gRNA plasmid can also be digested with BbsI enzyme at 37°C for 8–12 h.\nDays 1–3. Clone another sgRNA into the pUC57-MU6-gRNA plasmid, which is called pUC57-sgRNA2. The protocol is identical to that in step 3.\nDay 3. Part One. Digest the pUC57-sgRNA2 vector with EcoRI enzyme at 37°C for 1 h. Run samples on a 1% (wt/vol) agarose gel to verify successful fragment (the 430-bp-long product), which is designated as Mouse U6-sgRNA2. Successful reactions should yield a 430-bp fragment and a 2,713-bp fragment.\nDay 3. Part Two. Digest the lentiCRISPR-sgRNA1 vector (from step 3) with EcoRI enzyme at 37°C for 1 h. Run samples on a 1% (wt/vol) agarose gel to verify successful fragment.\nDay 3. Part Three. Ligate the Mouse U6-sgRNA2 fragment from step 8c into the digested lentiCRISPR-sgRNA1 from step 8d. Set up the ligation reaction as follows:\ntable:files/protocols_protocol_438_13.csv\nDays 3–5. All other steps are identical to step 3.\nNote: It can also be achieved by delivering two sgRNAs from two separate viruses when using higher MOI for infection to simultaneously knockout two genes in one cell.\nLentiviral transfection of adipocytes\nTiming: 5 days + differentiation\nPre-adipocytes culture and transduction\nTiming: 5 days",
    "Note: This protocol does not consider the effect of a specific gene on adipocytes differentiation. To exclude possible effect of a gene during adipocyte differentiation, we recommend the use of inducible CRISPR/Cas9 system, for example, the pCW-Cas9 (Addgene, #50661), to start gene editing after adipocyte differentiation in mature adipocytes. Infect pre-adipocytes with the inducible CRISPR/Cas9 system to introduce the Cas9 and sgRNA cassettes to cells, and induce the Cas9 expression with doxycycline after differentiation to knockout certain genes of interest.\nMaintain brown pre-adipocytes and white pre-adipocytes in DMEM supplemented with 20% FBS at 37°C and 5% CO2. Passage the cells at 1:6 or more every 2 days.\nNote: Plates can be pre-coated with 0.1% gelatin to prevent cell detachment. The volume of 0.1% gelatin added is as follows: 12-well plate, 1 mL/well, 6-well plate, 1.5 mL/well, and 10-cm culture dish, 6 mL/dish.\nPlate pre-adipocytes in 6-well plates for lentiviral infection. After approximately 8 h, add lentiviruses (carry sgRNA) to cells (day 1). Add ∼6 × 105 viral particles to 2 × 105 cells, which typically resulted in 20%–30% of cells infected (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/438-Fig1.jpg\nFigure 1. Lentiviral infection and puromycin treatment\nRepresentative images show the density variation of brown pre-adipocytes after lentiviral infection from day 1 to day 3 (A); or after puromycin treatment from day 4 to day 6 (B). The lentiCRISPRv2 vector contains the puromycin cassette while the lenti-GFP vector does not. Thus, cells infected with lentiCRISPRv2 viruses are resistant to puromycin treatment, and cells infected with lenti-GFP viruses are puromycin-irresistant. Scale bar, 200 μm.\nCritical: It is recommended to set up control groups (cells infected with lentiviruses that carry no sgRNA or express GFP).\nNote: Polybrene (8 μg/mL) can be added to increase transduction efficiency.",
    "After 48 h of transduction, treat cells with 1.5 μg/μL puromycin for 2 days to remove non-infected cells (Figure 1[href=https://www.wicell.org#fig1]B).\nAfter 2 days of puromycin treatment, collect cells and plate cells in a new 12-well plate for differentiation. Troubleshooting 2 (The number of infected pre-adipocytes might be variable, thereby resulting in experimental variability)\nNote: It is recommended to allow these infected cells to grow in growth medium for one more day before differentiation.\nAdipocyte differentiation.\nNote: The protocol for the differentiation of white pre-adipocytes is similar to that for the differentiation of brown pre-adipocytes, with the exception that no T3 and 5 μg/mL insulin is used during the whole differentiation process (Qiu et al., 2018[href=https://www.wicell.org#bib5], Feng et al., 2019[href=https://www.wicell.org#bib3]). Thus, this protocol mainly describes the brown pre-adipocytes differentiation.\nCritical: Prepare all reagents for adipocyte differentiation before use. Aliquot stock solutions into small volumes. Avoid repeatedly freezing and thawing.\nWhen brown pre-adipocytes grow confluent (termed “day 0”), remove the growth medium and add induction medium to induce adipogenesis.\nNote: The induction medium should be freshly prepared before use.\nOn day 3, remove the induction medium and add the maintenance medium.\nNote: Do not wash cells with PBS. The maintenance medium should be freshly prepared before use.\nChange the maintenance medium every 2 days. On day 6 or 7, Typically more than 90% of cells are differentiated. Troubleshooting 3 (Low differentiation potential of pre-adipocytes)\nNote: Change the maintenance medium daily if it appears yellow.\nFunctional validation of sgRNAs\nTiming: 1–2 days\nFunctional testing for the detection of indel mutations by surveyor assay (Timing: 1 day): Confirm the function of sgRNA in adipocytes by detecting the indel mutations generated by specific sgRNAs. The protocol is identical to that in step 7. Troubleshooting 4 (No obvious cleavage bands after T7 endonuclease I digestion)",
    "Functional testing to determine protein expression\nTiming: 2 days\nCollect the well-differentiated adipocytes in 1.5 mL tube. For one well of 12-well plate, add 60 μL RIPA buffer into the tube, mix gently by pipetting up and down for a few times, and put the mixture on ice for 15 min.\nNote: The volume of RIPA buffer can be flexible. For one well of 12-well plate, it is recommended to add 60 μL RIPA buffer to lysis cells.\nCentrifuge 15 min at 15,294 × g, and transfer the lysis buffer (middle layer) to a new 1.5 mL tube (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/438-Fig2.jpg\nFigure 2. Schematic view of the layers after centrifugation (step 12b)\nThe upper layer is lipid, the middle layer is the lysis buffer, and the lower layer is the cell debris.\nNote: This step can be repeated to remove lipids. Troubleshooting 5 (Lipid droplets in mature adipocytes reduce protein extraction efficiency)\nAdd 3× SDS-PAGE loading buffer to each tube, and incubate the mixture at 95°C for 5 min.\nNote: The volume of 3× SDS-PAGE loading buffer depends on the volume of RIPA buffer in step 12a. For 60 μL RIPA buffer, add 30 μL 3× SDS-PAGE loading buffer.\nPlace the solution on ice for immediate use or store the solution at −20°C or −80°C for future use.\nRun the protein samples on a SDS-PAGE gel, and detect the target protein expression using corresponding antibodies."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Cell Culture",
    "Metabolism",
    "Crispr"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}