{
  "id": 4711,
  "origin_website": "Bio",
  "title": "Cytokine-Stimulated Phosphoflow of Whole Blood Using CyTOF Mass Cytometry",
  "procedures": [
    "Prepare stimulations in cluster tubesPrepare cytokines at 5x concentrations in Complete RPMI, with enough volume to pipette 50 µl into a well for each sample and control. See chart below for dilution for a full plate.The Cluster tubes with the aliquoted stimulants can be frozen away at -80 °C until further use.Example of a full plateimgsrc:https://en-cdn.bio-protocol.org/attached/image/20150604/20150604023643_1902.jpgExample of cytokine stimulationsIFNα: Final concentration of stimulation used=10,000 units/ mlIFNγ2: Final concentration of stimulation used= 50 ng/ mlIL6: Final concentration of stimulation used= 50 ng/ mlIL7: Final concentration of stimulation used= 50 ng/ mlIL10: Final concentration of stimulation used= 50 ng/ mlIL21: Final concentration of stimulation used= 50 ng/ mlIL2: Final concentration of stimulation used= 50 ng/ mlCD3 = 2.5 μl in 990 ul (Final concentration 500 ng/ml) CD28 = 10 μl in above media (Final concentration 2,000 ng/ml) LPS: Final concentration of stimulation used= 1 μg/ mlPMA: 10 ng/ml final concentration /mlIonomycin: 1,000 ng/ml final concentration /mlIL5: Final concentration of stimulation used= 10 ng/ mlIL17A: Final concentration of stimulation used= 50 ng/ mlIL17E: Final concentration of stimulation used= 50 ng/ mlStimulation Rest the blood collected from donors in incubator at 37 °C in CO2 incubator for 1 h. Just before use, take out the required number of cluster tubes with the stimulant from the -80 °C freezer and let warm at 37 °C water bath for 5-10 min. Aliquot 200 μl of whole blood into column 1 of the cluster tube plate using a multichannel pipette. Change tips between each patient.Repeat with all the columns of tubes depending on the number of donors.Work as rapidly as possible.Tap plate to mix, and incubate 15 min at 37 °C in CO2 incubator.",
    "Remove stimulated whole blood from incubator at 15 min and using a multichannel pipette, add 250 µl of 1x Proteomic Stabilizer to each column of patient samples in the Cluster tube block. Pipette up and down to mix for each patient. Change tips between patients. Add the stabilizer in the same order that you added the whole blood for stimulation.Incubate for 10 min at room temperature. At this point it can be frozen away at -80 °C until it is ready to be Thaw-lysed and surface stained.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150604/20150604023722_2214.jpgFigure 1. A flow chart of the steps described in our procedureSurface stainingTake out the required number of frozen stimulated cluster tubes with whole blood as can be comfortably run on the CyTOF in 1 day. (You can run 3-4 cluster or strip of samples in one day by CyTOF. One cluster or strip has 8 wells). Thaw in cold water for about 15 min.Using a pipette, transfer the fixed whole blood sample (450 μl) into a labeled deep well plate with 1.2 ml of 1x Thaw-Lyse and let it sit for 10 min at room temperature.Centrifuge cells at 548 rcf (x g) for 10 min at room temperature. Aspirate supernatant from the cells.Vortex the pellet and add 1.6 ml, 1x Thaw-Lyse, and let it sit for 5-10 min at room temperature. Centrifuge cells at 548 rcf (x g) for 10 min at room temperature. Aspirate supernatant from the cells.Vortex and wash the pellet with ~1.8 ml CyFACS.Centrifuge cells at 974 rcf (x g) for 10 min at 4 °C. Aspirate supernatant from the cells so that about 50 ul remains at the bottom of each well. Make cocktail in phosphate buffered saline of metal-chelating polymer-labeled surface antibodies according to previously determined titration.",
    "Make sufficient volume for each well to have 20 μl of cocktail. Pipet into 0.1 μm spin filter and centrifuge in a tabletop microcentrifuge (RCF=14,000) for 2 min at room temperature. This ensures even staining. Add 20 μl of antibody cocktail to the cells in the deep well plate, vortex to mix and let it incubate at room temperature for 30 min. Wash cells with 1.8 ml phosphate buffered saline and centrifuge cells at 974 rcf (x g) for 10 min at 4 °C. Aspirate.Permeabilize the cells by adding 600 µl cold methanol to each well of the deep well block using a multichannel pipette. Pipette up and down to mix for each patient. Change tips between patients. Cells are stored overnight at this point at -80 °C. This is done for convenience of work flow.Remove samples from freezer. Add 1.0 ml of CyFACS. Centrifuge cells at 974 rcf (x g) for 10 min at 4 °C. Aspirate so that about 100 μl remains in the wells. Wash in 1.8 ml/ well CyFACS buffer.Centrifuge cells at 974 rcf (x g) for 10 min at 4 °C. Discard supernatant by aspiration.Intracellular stainingMake cocktail in PBS of metal-chelating polymer-labeled intracellular antibodies according to previously determined titration. Make sufficient volume for each sample to have 20 μl of cocktail. Pipet into 0.1 μm spin filter and centrifuge in tabletop microcentrifuge (RCF=14,000) for 2 min at room temperature.Add 20 μl of antibody cocktail to the cells in the deep well plate, vortex to mix and let it incubate at room temperature for 30 min.Add 1.6 ml of PBS. Centrifuge cells at 974 rcf (x g) for 10 min at 4 °C. Discard supernatant by aspiration.Make 1:200 dilution in PBS of Ir-intercalator. Add 20 μl of diluted Ir-intercalator solution to each sample, pipet to mix.",
    "Incubate on ice for 20 min. Wash 3 times in MilliQ water. Centrifuge cells at 974 rcf (x g) for 10 min at 4 °C. Discard supernatant by aspiration.Bring up the samples in 1 ml of MilliQ water and filter samples through a cell strainer. Acquire samples on the Cytof, after standard instrument setup procedures."
  ],
  "subjectAreas": [
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}