{
  "id": 12087,
  "origin_website": "Jove",
  "title": "The Application of 1% Methylene Blue Dye As a Single Technique in Breast Cancer Sentinel Node Biopsy",
  "procedures": [
    "All procedures including human subjects have been approved by Dharmais Cancer Hospital Ethics Committee with certificate number of 040/KEPK/VII/2017. All patients signed the consent forms and expressed agreement to participate in this study.\nNOTE: The inclusion criteria are patients with diagnosis of early breast cancer, with tumor stage T1-T2 without palpable and ultrasonography lymph nodes enlargement (cNo). The exclusion criteria are locally advanced breast cancer, received neo adjuvant chemo or hormonal therapy, and pregnancy.\n1. Preparation of 1% methylene blue dye and the injection technique\nSterilize the surgical field after anesthetizing the patient.\nAspirate 2 mL of 1% methylene blue dye from its vial with a 3 mL syringe.\nDraw a line to mark the lower axillary hairline below the lateral border of pectoralis major muscle.\nInject 2 mL of 1% methylene blue dye into the subareolar space of the breast.\nIf there is a scar in the upper outer quadrant of the breast or NAC, inject 2 mL of 1% methylene blue dye peritumorally into the breast parenchyma at the lateral side of the scar towards the axilla with a 23G needle under ultrasound guidance with a linear probe (12 MHz).\nMassage the breast circularly at the injection site for 5 min, and then continue to perform surgery.\n2. Sentinel node biopsy technique in breast conserving surgery (BCS)\nNOTE: The surgery is performed in a patient who underwent BCS and SNB.\nPrepare the surgical tools: monopolar electrocautery, DeBakey forceps/anatomical forceps, and retractors.\nIncise the skin, subcutaneous tissue, and fascia.\nFind the blue nodes or blue lymphatic tracts. Follow the blue tracts until the blue nodes or non-blue nodes with lymphatic blue tracts are identifiable.\nSearch for the sentinel nodes along the intercostobrachial nerve and lateral thoracic vein if the blue nodes or blue lymphatic tracts cannot be found.",
    "Resect the sentinel nodes carefully and avoid damaging the nodes.\nPalpate the axillary space to find additional suspicious malignant lymph node enlargement.\n3. Sentinel node biopsy technique in mastectomy\nNOTE: The surgery is done in a patient who underwent mastectomy and SNB.\nIncise the skin and subcutaneous tissue.\nCreate skin flaps.\nRemove the breast from pectoralis major until axillary fossa can be fully exposed.\nIncise the clavicopectoral fascia to find the sentinel node.\nIf the blue lymphatic tracts cannot be found, find the sentinel node along the intercostobrachial nerve and lateral thoracic vein area.\nRemove the sentinel node.\nLook for additional suspicious lymph nodes by palpation.\n4. Intraoperative examination\nSlice the lymph nodes no thicker than 2 mm, parallel to the long axis.\nMake touch imprint cytology from each node.\nPlace the surgical specimen on a metal tissue disc and embed in a gel-like medium with the same density as frozen tissue.\nSubmit all of the nodes for frozen section (FS) examination.\nCategorize the metastatic status of sentinel nodes into positive or negative, and report it to the surgeon during the surgery.\n5. Pathological examination\nPerform the final pathologic evaluation of the sentinel nodes on formalin-fixed and paraffin-embedded tissue sections.\nClassify the sentinel nodes metastasis according to the 6th edition of American Joint Committee on Cancer (AJCC) manual. Macrometastasis (MAC) is defined as tumor deposits larger than 2 mm, micrometastasis (MiC) is defined as tumor deposits between 0.2 and 2 mm, isolated tumor cells (ITC) are defined as cell clusters no larger than 0.2 mm.\nPerform the serial sectioning and immunohistochemistry analysis for cytokeratin when there are doubts over defining ITC.\nExamine the rest of axillary lymph nodes in a similar manner.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}