{
  "id": 6199,
  "origin_website": "Bio",
  "title": "Inositol Phosphates Purification Using Titanium Dioxide Beads",
  "procedures": [
    "Before starting the extractionSwitch on the cooled centrifuge and centrifugal evaporator.Prepare 2.5% ammonium hydroxide and 1 M perchloric acid. Cool to 4 °C before use.Note: The dilute ammonium hydroxide solution can be made in advance and stored at room temperature or 4 °C indefinitely. Check that the pH is > 10 and vortex mix before using. Weigh titanium dioxide beads, 4 mg/sample, into an Eppendorf. Suspend all the beads together in 1 ml ddH2O by pipetting or vortexing, then centrifuge at 3,500 x g for 1 min at 4 °C. Remove supernatant and wash again using 1 ml 1 M perchloric acid. Remove supernatant and suspend beads in 50 µl 1 M perchloric acid per sample, then aliquot into the correct number of Eppendorfs. Note: Beads can be mixed by pipetting or vortexing. They will not stay in suspension so mix frequently when aliquotting. The beads are not damaged by shear stress; standard pipette tips can be used for this protocol.Preparing the cellsCulture the cell line of interest under standard conditions, for example in a 37 °C humidified incubator with 5% CO2. Note: For PAGE analysis after titanium dioxide purification, prepare enough cells for 10 mg equivalent total protein per condition. Titanium dioxide purification with PAGE analysis has been validated in many cell types (Wilson et al., 2015). Depending on IPs of interest, cell type, or analysis method, more or fewer cells may be required. Wash once with warm PBS then incubate in trypsin-EDTA until the cells have detached. Collect them into a Falcon tube and centrifuge at 200 x g for 3 min. Remove supernatant.Resuspend cells in 1 ml cold PBS and transfer to Eppendorfs on ice. Adjust the volumes so all samples have approximately the same volume, then remove 40 µl into a separate Eppendorf.",
    "These cells are for normalization; they can be counted now or, for example, extracted to quantify protein concentration.Centrifuge the cells at 200 x g for 3 min and remove supernatant. Samples can be processed immediately or frozen at -80 °C.Perchloric acid extractionResuspend the pelleted cells in 1 ml cold 1 M perchloric acid. Mix by pipetting until fully suspended. The samples will immediately become white and cloudy as proteins precipitate. Note: When using frozen cells, there is no need to defrost the samples before adding perchloric acid. Incubate the samples on ice for 10-15 min, with frequent 2-5 sec vortex intervals. Note: Many inositol phosphate species, especially inositol pyrophosphates, are labile under acidic conditions. Therefore all steps before addition of ammonium hydroxide should be performed at 4 °C to minimize degradation, and the acid incubation time should be kept to a minimum. Extraction from certain sample types may require longer incubation. Centrifuge at 18,000 x g for 5 min at 4 °C. The pellet will contain membranes and proteins. Small polar molecules such as IPs will be in the supernatant.Titanium dioxide beads purificationTransfer the supernatants from Step C3 to the Eppendorfs containing titanium dioxide beads prepared in Step A3. Vortex briefly to mix.Rotate samples at 4 °C for 15-20 min.Centrifuge samples at 3,500 x g for 1 min at 4 °C. Carefully discard supernatants as IPs will be bound to the titanium dioxide beads. Note: Inositol pyrophosphates can be degraded by adsorption onto the beads as well as by acidic conditions. The protocol should take 1.5-2 h depending on sample number, excluding time taken for centrifugal evaporation. Wash the beads by resuspending in 500 µl cold 1 M perchloric acid, centrifuging at 3,500 x g for 1 min at 4 °C, then removing supernatant. Repeat this step.",
    "Resuspend the beads in 200 µl ~2.8% ammonium hydroxide to elute IPs. Vortex or pipette mix, then rotate samples for 5 min.Centrifuge at 3,500 x g for 1 min. Transfer the supernatant to a new Eppendorf.Elute again with another 200 µl ammonium hydroxide. After rotation and centrifugation, combine that supernatant with the first, for 400 µl sample volume.Use the centrifugal evaporator to reduce the sample volume to 20-60 µl, or until the pH is 7-8. Do not store the samples until they reach neutral pH. The samples can be heated up to 60 °C during this process to speed up evaporation. If samples are accidentally dried, resuspend in ddH2O. Note: Test pH of samples by spotting 1-2 µl onto pH test strips. Store the neutralized samples at 4 °C. They are quite stable, and can be kept for a few weeks before analysis."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}