{
  "id": 18903,
  "origin_website": "Jove",
  "title": "High-throughput Flow Cytometry Cell-based Assay to Detect Antibodies to N-Methyl-D-aspartate Receptor or Dopamine-2 Receptor in Human Serum",
  "procedures": [
    "1. Subcloning Strategy to Construct pIRES2-EGFP Vector Encoding D2R or NMDAR\nObtain full-length cDNA clone of human D2R or NMDAR subunit 1 (NR1).\nChoose an expression vector, such as pIRES2-EGFP, which is suitable for expression of transmembrane proteins with an enhanced green fluorescent protein (GFP) reporter under control of an internal ribosome entry site (IRES), enabling both antigens and GFP to be coexpressed in cells separately.\nSubclone human cDNA within pIRES2-EGFP vector.\n\t\nTo subclone cDNA, use appropriate restriction enzymes (for example NheI and XhoI for human D2R cDNA).\nLigate cut cDNA insert within restricted pIRES2-EGFP vector.\nSequence ligated pIRES2-EGFP D2R or NMDAR vector to check whether the vector contains the correct sequence.\nPurify and amplify pIRES2-EGFP D2R or NMDAR vector for later use in transfection.\n2. HEK293 Cell Transfection for Expression of Neuronal Antigen\nCulture HEK293 cells in tissue culture flasks with fresh Dulbecco’s Modified Eagle Medium (1x) (DMEM) complete with 4.5 g/L D-glucose, L-glutamine and 110 mg/L sodium pyruvate supplemented with 10% fetal bovine serum (FBS), 2 mM GlutaMAX, and 50 μg/ml Gentamicin.\nDetach HEK293 cells using trypsin and transfer to a conical tube.\n\t\nWash by centrifuging cells at 250 x g for 6 min and resuspend the cell pellet in fresh complete DMEM.\nCount the cells and seed 6 well plates at around 8 x 105 cells/well and culture overnight in 2ml DMEM at 37 °C and 5% CO2 in an incubator.\nOnce they have reached around 70% confluency, transfect the HEK293 cells with pIRES2-EGFP NR1 (HEK293NMDAR+ cells), pIRES2-EGFP D2R (HEK293D2R+ cells), and pIRES2-EGFP (HEK293CTL cells; vector control) as follows. Keep some untransfected HEK293 cells for compensation later on.\n\t\nPrepare the required volume of transfection mix comprising 2.5 μg DNA, 200 μl 0.9% sodium chloride and 4 μg/ml polyethylenimine/well (each containing 2 ml fresh complete DMEM).",
    "Immediately vortex the mix for 10 sec and incubate at room temperature (RT) for 10 min, before adding volume of transfection mix to the appropriate wells.\nCover the plate, wrap the sides with Parafilm, and centrifuge at 280 x g for 5 min to aid cell transfection.\nRemove the Parafilm and then place in the incubator to culture at 37 °C.\nReplace culture media 18 hr later with fresh complete DMEM, and maintain in culture for another 72 hr.\nOptional: 72 hr post-transfection, transfected cells can be selected by culture in complete DMEM supplemented with 250 μg/ml Geneticin, in order to obtain a polyclonal stable transfectant.\n3. Flow Cytometry Cell-based Assay for Detection of Antibody to Surface Neuronal Antigens\nDetach HEK293NMDAR+, HEK293D2R+, and HEK293CTL cells by incubation with 500 μl/well Versene for approximately 5 min at 37 °C.\n\t\nResuspend in 2ml/well of PBS (-Ca2+/-Mg2+) supplemented with 2% FBS (PBS/FBS) and transfer to a 15 ml or 50 ml conical tube.\nWash cells by centrifuging at 250 x g for 6 min and resuspend the cell pellet in 15-50 ml PBS/FBS. Repeat wash 2x.\nCount the cells and then resuspend in PBS/FBS at 1 x 106 cells/ml.\nDesign the 96-well template for flow cytometry acquisition, considering that HEK293D2R+ or HEK293NMDAR+ cells, as well as HEK293CTL cells will have to be incubated with each patient sample or primary antibody.\nSeed cells in a V-bottom 96-well plate at 50,000 cells/well according to the flow cytometry acquisition template.\nPellet the cells by centrifuging the 96-well plate at 450 x g for 5 min and gently remove the supernatant using an electronic or manual multichannel pipette, tilting the plate on an angle and taking care not to aspirate the cell pellet.",
    "Incubate HEK293D2R+, HEK293NMDAR+, and HEK293CTL cells for 1 hr at RT in the dark with:\n\t\nSerial dilutions of primary antibody in order to assess antigen surface expression.\nPatient samples in order to detect antibody.\nUse appropriate flow cytometry compensation controls, e.g. unstained untransfected HEK293 cells, GFP+ HEK293 cells (AF647-), and untransfected AF647+ HEK293 cells (GFP).\nWash cells by centrifuging at 450 x g for 5 min and resuspend the cell pellet in 170 μl PBS/FBS. Repeat wash step two more times.\nIncubate cells for 1 hr at RT in the dark with 1:100 dilution of AF647-conjugated secondary antibody (anti-human IgG for patient serum and anti-mouse IgG for anti-NR1 or anti-D2R primary antibodies).\nWash the cells three times, as in step 3.7, and resuspend in 35 μl PBS/FBS for flow cytometry cell acquisition.\nSet up the high-throughput sampler (HTS) on the flow cytometer (BDLSRII).\nAcquire 10,000 events/well according to the flow cytometry acquisition template.\nExport and then analyze data for analysis using a flow cytometry software package, such as FlowJo v7.5:\n\t\nFirst, gate the live HEK293 cells based on forward (size) and side (granularity) scatters.\nFurther gate live HEK293 cells based on high GFP-positivity to analyse only the transfected cells.\nDetermine the mean fluorescence intensity (MFI) of the AF647 channel within the live GFP-positive cells.\nExport data into Excel or Prism for analysis:\n\t\t\nPlot concentrations of primary antibody (anti-NMDAR or anti-D2R antibody) versus the MFI obtained from the cells incubated with these antibodies.\nFor each patient and control sample, determine the ΔMFI by subtracting the MFI of the HEK293CTL cells from the MFI of the HEK293D2R+ or HEK293NMDAR+ cells, respectively.\nCalculate the threshold of antibody positivity by adding three standard deviations above the mean ΔMFI of the control cohort.",
    "Plot individual samples grouped according to their serum type on a graph and represent the threshold as a line.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}