{
  "id": 4006,
  "origin_website": "Cell",
  "title": "Constructing a gnotobiotic mouse model with a synthetic human gut microbiome to study host–microbe cross talk",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPart A: Preparation of complete mYCFA bacterial culture medium\nTiming: Preparation 30 min. Oxygen-reduction 24 h.\nPrepared mYCFA medium should not be stored for more than 72 h due to volatility of some of its components, especially SCFAs. When following the culturing instructions described in this protocol, a total of 400 mL of mYCFA is needed to culture 14 strains during a period of 5 days. Thus, we recommend to prepare 200 mL one day prior to initial inoculation (initial inoculation on “d 1” in Figure 2[href=https://www.wicell.org#fig2]) and another 200 mL one day before initial gavage (initial gavage on “d 4” in Figure 2[href=https://www.wicell.org#fig2]).\nIn this step, mYCFA kit components 1 to 5 (see “Before You Begin”) will be used to generate the complete mYCFA medium. In the following instructions, we describe the generation of 100 mL of medium.\nDissolve 1 aliquot of the mYCFA basic component mix (kit component 1) in 50 mL ddH2O.\nNote: Color turns blue immediately (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/722-Fig3.jpg\nFigure 3. Visual appearance of mYCFA medium during different steps of preparation\n(A) Blue color of mYCFA basic component mix (kit component 1) dissolved in 50 mL ddH20.\n(B) Purple color of mYCFA after addition of SCFA.\n(C) Pink color after pH adjustment to pH 6.8.\n(D) Oxygen-reduced yellow mYCFA medium, 24 h after transfer into an anaerobic chamber.\nTransfer the 50 mL into a 200 mL glass bottle.\nRinse the 50 mL Falcon tube of the mYCFA basic component mix with an additional 50 mL ddH2O and transfer this volume to the glass bottle to achieve a 100 mL solution.\nAdd 1 aliquot of mYCFA SCFA mix (kit component 2).\nNote: Color turns purple and bubbles arise (Figure 3[href=https://www.wicell.org#fig3]B).\nAdd 1 aliquot of mYCFA vitamin mix (kit component 3).",
    "Add 1 aliquot of mYCFA D-glucose solution (kit component 4).\nAdd 1 aliquot of mYCFA N-acetyl-D-glucosamine solution (kit component 5).\nAdd 444 μL of 60% sodium lactate solution.\nAdjust pH value to 6.8. Color turns pink (Figure 3[href=https://www.wicell.org#fig3]C)\nFilter-sterilize the complete mYCFA medium using a 0.22 μm filter.\nTransfer the mYCFA medium into an anaerobic chamber for at least 24 h for oxygen reduction and use the medium within 72 h. Inside the anaerobic chamber, leave the screw cap slightly loosened to aid in oxygen reduction. Once the oxygen is reduced (color change to yellow), the cap can be tightened.\nNote: Color of the medium turns from pink to yellow when solution is properly oxygen-reduced and ready to use (Figure 3[href=https://www.wicell.org#fig3]D).\nNote: The medium contains a compound that is very sensitive to oxygen. Upon contact with oxygen, the solution will turn back to pink immediately. This feature allows for easy visual verification of proper anaerobic conditions.",
    "Figure 4[href=https://www.wicell.org#fig4] depicts example growth curves for all 14 strains in 200 μL mYCFA medium in a 96 well plate, illustrating that all 14 of these human commensals can be properly and efficiently cultured in this medium. To demonstrate proper culturability of all strains, we inoculated 50 μL of the cryostocks of each strain into 2.5 mL mYCFA medium and incubated them for 16 h and 37°C under anaerobic conditions. Next, we detected optical density of these over-night cultures by measuring OD600 of 200 μL of each suspension in a transparent 96-well flat bottom plate. After calculation of dilution factors for each culture to achieve an OD600 of 0.01, 200 μL of mYCFA was inoculated with the calculated volume of each over-night culture in technical triplicates and incubated for 20 h at 37°C under anaerobic conditions. OD600 of non-inoculated mYCFA was used as a BLANK control. Although not all strains grow to the same OD, the resulting growth curves (Figure 4[href=https://www.wicell.org#fig4]) demonstrate proper culturability of all strains in mYCFA medium.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/722-Fig4.jpg\nFigure 4. Example growth curves for all 14 strains in mYCFA medium\nOD at 600 nm depicted as a function of time [h]. Curves were measured by detection of OD at 600 nm (every 2 min) in a 96 well plate and 200 μL mYCFA with equal start ODs of 0.01 at t = 0 for each strain. Blue lines represent mean ODs of 3 independent experiments with shaded blue area indicating SD. Range of x-axis is identical for each panel. For details on bacterial strain abbreviations, see Table 1[href=https://www.wicell.org#tbl1]. Note that ODs of the individual strains could be higher when grown in larger volumes in culture tubes.\nPart B: Bacterial culturing in complete mYCFA medium\nTiming: 30 min daily for a period of 3 days",
    "In this step, bacterial suspensions will be cultured from bacterial cryostocks, which are stored at −80°C. Since bacterial growth is strain- and aliquot-dependent, definite growth rates are impossible to precisely predict. Thus, we established a culturing flow chart (Figure 5[href=https://www.wicell.org#fig5]), which allows for proper cultivation of all 14 strains described in this protocol, independent of individual differences. To ensure sufficient availability of all cultured strains at the day of the intragastric gavage, we recommend starting bacterial cultivation 3 d prior to day 1 of gavage (DOG1).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/722-Fig5.jpg\nFigure 5. Flowchart for cultivation of 14 human commensals in mYCFA medium\nNote that the flasks shown in the figures are only for the representative purpose; we used 23 mL culturing tubes with a plastic cap.\n(A) Inoculation of 50 μL cryo-preserved bacterial stock solution into 2.5 mL mYCFA, followed by 24 h anaerobic incubation at 37°C. Resulting bacterial culture is named “culture #1”.\n(B) Check OD at 600 nm for every “culture #1” with further actions depending on resulting OD. If OD600 is lower than 0.4, culture #1 needs to be incubated for another 24 h (lower panel). If OD600 is higher than 0.4, 50 μL of culture #1 is inoculated into 5 mL of fresh mYCFA medium and incubated for 24 h, resulting in “culture #2” (upper panel). Discard culture #1 of these strains.\n(C) Inoculate 50 μL of “culture #2” into 5 mL of fresh mYCFA medium and incubate for 24 h, resulting in culture “DOG1” (upper panel). Check the OD600 of the remaining “culture #1” suspensions. If OD600 is higher than 0.4 inoculate 50 μL into 5 mL of fresh mYCFA medium and incubate for 18 h. Also name this culture “DOG1”. If OD600 is lower than 0.4 (unlikely), culture should be discarded and not used further.",
    "(D) At the day of first gavage, check OD600 of all cultures labeled “DOG1”. The target OD of all cultures for the final gavage mix is 0.5 ≤ OD600 ≤ 2.0. Thus, all DOG1 cultures providing an OD600 of > 1.5 should be diluted and cultured for 4 more hours and be named “DOG2” with their corresponding DOG1 cultures being discarded. All remaining DOG1 cultures will be further incubated for the same 4 h. At the end of this 4 h incubation time, OD600 of all DOG2 and remaining DOG1 cultures should be measured to verify that none of these cultures provide an OD600 of more than 2.0 or less than 0.5. To prepare cultures for the second gavage mix on the following day, 50 μL of all DOG2 and DOG1 cultures used to prepare gavage mix 1 are to be inoculated into 5 mL and incubated for another 18 h.\n(E) Repeat steps as explained in (D).\nCritical: To avoid any potential cross-contamination, we recommend to properly clean all pipettes and the gloves with a suitable disinfectant before handling the cultures and in between handling different cultures.\n3 d prior to intragastric gavage (Figure 5[href=https://www.wicell.org#fig5]A):\nTransfer bacterial cryostocks into anaerobic chamber.\nVerify that complete mYCFA medium displays a yellow color, indicating proper oxygen-reduction.\nDistribute 2.5 mL of mYCFA into sterile bacterial culturing tubes (one culture tube for each strain). Prepare an additional tube containing only medium without adding any bacteria (BLANK control for OD detection).\nLabel tubes properly (“culture #1”) and inoculate each tube with 50 μL of the respective bacterial cryostock.\nVortex tubes briefly and incubate at 37°C for 24 h.\n2 d prior to intragastric gavage (Figure 5[href=https://www.wicell.org#fig5]B):",
    "After 24 h of incubation, check the OD of culture #1 at 600 nm using the non-inoculated tube as a BLANK control. Please note that all ODs mentioned in the example below were detected using a “Biochrom Ultrospec 10 cell density meter”, which is suitable to directly detect ODs in 23 mL glass culture tubes. In case other photometers are used, i.e., photometers that require transferring bacterial suspensions to a detection cuvette, resulting ODs might be slightly different. However, for detection of ODs using a cuvette with a 1 cm light path, all the threshold ODs recommended below remain valid. We do not recommend determining threshold ODs using a 96-well plate and a plate-reader due to heavily different light path lengths and thus restricted comparability to the threshold ODs listed in this protocol.\nThe subsequent steps for each culture depend on the detected OD600 of culture #1 (Example: See Figure 6[href=https://www.wicell.org#fig6] and Table 6[href=https://www.wicell.org#tbl6] for example results).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/722-Fig6.jpg\nFigure 6. Optical densities of bacterial cultures during culturing procedure according to flowchart in Figure 5[href=https://www.wicell.org#fig5]\nHeatmaps of the optical densities at 600 nm (OD600) of “culture #1”, “culture #2”, “DOG1”, “DOG2”, “DOG3” and “DOG4”. Culturing of all 14 depicted strains was performed according to the flowchart in Figure 5[href=https://www.wicell.org#fig5] and the same culture nomenclature was used. Underlying primary data are listed in Table 5[href=https://www.wicell.org#tbl5].\n(A) OD600 of all 14 bacterial cultures 2 days (d) and 1 d before first gavage. OD600 ≤ 0.4 are pictured in yellow shades, while OD600 > 0.4 are shown in blue shades.",
    "(B) OD600 of all 14 bacterial cultures on the days of first and second gavage. OD600 values of 0.5 < OD600 ≤ 1.5 are pictured in yellow shades, while OD600 > 1.5 are depicted in blue shades. OD600 < 0.5 would be indicated in gray (criterion for not using culture for a gavage mix). In both panels, a black cross on white background indicates that no culture (NC) was generated due to the OD thresholds mentioned in Figure 5[href=https://www.wicell.org#fig5].\ntable:files/protocols_protocol_722_6.csv\nCulture abbreviations refer to abbreviations used in Figure 5[href=https://www.wicell.org#fig5]. (NC = not cultured). See Figure 6[href=https://www.wicell.org#fig6] for graphical illustration of these values.\nOD600 of culture #1 is higher than 0.4:\nTake 50 μL of culture #1 and add to 5 mL of fresh, oxygen-reduced mYCFA medium. Label this culture as “culture #2” and discard the remainder of culture #1. Incubate culture #2 for 24 h.\n(Example: According to Figure 6[href=https://www.wicell.org#fig6] and Table 6[href=https://www.wicell.org#tbl6], this step was applied to cultures of the following strains: AM, BC, BI, BO, BT, BU, CA, CS, and EC)\nOD600 of culture #1 is lower than 0.4:\nIncubate this culture for another 24 h without addition of medium.\n(Example: According to Figure 6[href=https://www.wicell.org#fig6] and Table 6[href=https://www.wicell.org#tbl6], this step was applied to cultures of the following strains: DP, ER, FP, MF and RI)\n1 d prior to intragastric gavage (Figure 5[href=https://www.wicell.org#fig5]C):\nAfter 24 h of incubation, check the OD600 of culture #1 for strains treated as described in step 18b. OD600 of culture #2 for strains treated as described in step 18a do not need to be checked since proper growth of this strain was already validated the day before. Again, use the non-inoculated tube as a BLANK control.\nThe subsequent steps are dependent on the culture’s absorbance value:",
    "culture #1 (example: DP, ER, FP, MF and RI) Verify that these cultures, which have been incubating for 2 d, finally reach a threshold OD600 of 0.4. (See Figure 6[href=https://www.wicell.org#fig6]A and Table 6[href=https://www.wicell.org#tbl6] for example results. In this example, culture #1 of ER, FP, MF and RI have reached the threshold OD600. DP has not yet reached this threshold.) Add 50 μL of culture #1 and to 5 mL fresh complete mYCFA medium (Figure 5[href=https://www.wicell.org#fig5]C, lower panel). Label the new culture as DOG1 and incubate for 18 h.\nNote: Culturing of DP to an OD600 of > 0.4 can take up to 3 d. In case DP has not yet reached OD600 = 0.4 at this stage, continue incubation of DP culture #1 until day of gavage.\nIn case any culture #1, other than DP, still yields an OD600 < 0.4, these cultures should be discarded and fresh inoculation with a new cryostock should be performed (see also: troubleshooting 1[href=https://www.wicell.org#troubleshooting])\nculture #2 (example: AM, BC, BI, BO, BT, BU, CA, CS and EC; Figure 6[href=https://www.wicell.org#fig6]A). Add 50 μL of culture #2 and to 5 mL fresh complete mYCFA medium (Figure 5[href=https://www.wicell.org#fig5]C, upper panel). Label culture as DOG1 and incubate for 18 h.\nFirst day of gavage (Figure 5[href=https://www.wicell.org#fig5]D):\nAfter 18 h of incubation, check the OD600 of culture DOG1 using the non-inoculated mYCFA tube as a BLANK control. Subsequent steps depend on the detected OD600 of culture DOG1. See Figure 6[href=https://www.wicell.org#fig6]B and Table 6[href=https://www.wicell.org#tbl6] for example values.\nOD600 of culture DOG1 > 1.5: (example: BC, BO, BT, BU and CA; Figure 6[href=https://www.wicell.org#fig6]B) Add 500 μL of culture DOG1 and to 4.5 mL fresh complete mYCFA medium (Figure 5[href=https://www.wicell.org#fig5]D, upper panel). Label the culture as DOG2 and incubate for 4 h.",
    "OD600 of culture DOG1 < 1.5: (example: AM, BI, CS, DP, EC, ER, FP, MF and RI; Figure 6[href=https://www.wicell.org#fig6]B). No further dilution. Incubate culture DOG1 for 4 more hours.\nAfter 4 h of incubation, check the OD600 of DOG1 and DOG2 using the non-inoculated tube as a BLANK control. Cultures should yield an OD600 between 0.6 and 1.5.\nFor each mouse to be gavaged, determine the volume of gavage mix per individual (VG).\nNote: For mice aged 6 weeks or older, we recommend to use 0.2 mL for gavage per mouse (VG = 0.2 mL), based on a minimum animal weight of 20 g. However, the gavage volume for each individual mouse can deviate from the recommended 0.2 mL, depending on the weight of the mice and/or local regulations. Nevertheless, changing the volume of the gavage mix by ± 50% is not expected to negatively affect the colonization efficiency.\nCalculate the required total volume of gavage mix needed (V1) using the following equation, with VG = gavage volume per mouse in mL and n = number of mice to be gavaged:\n   V 1    [  m L  ]  =  (   V G   x  n  )  + 2  \n(Example: for 15 mice to be gavaged, prepare:\n   V 1  =  (  0.2  x  15  )  + 2 = 5.0  m L  \nof the gavage mix)\nPrepare a mix containing equal volumes of all bacterial cultures.\nNote: Adjusting the required volumes for each culture according to the detected OD600 is not necessary. We could previously confirm that varying bacterial numbers in different gavage mixes result in comparable relative abundances of all gavaged strains in mice with the same genetic background when following the protocol described above.",
    "Calculate the required volume of each culture (V2) using the following formula with z = number of strains to be gavaged and V1 which was determined in step 23.\n   V 2   [  m L  ]  =    V 1  z   \n (Example: for 14 strains to be gavaged into 15 mice, prepare:\n   V 2   [  m L  ]  =    5.0  m L  14  = 0.357  m L = 357  μ L  \n of each culture)\nAdd the volume to be used from each DOG2 culture (V2) into a single sterile 15 mL (or 50 mL) tube. Use the respective DOG1 culture when no culture DOG2 was prepared (according to criteria mentioned in step 20). See Table 7[href=https://www.wicell.org#tbl7] for examples.\ntable:files/protocols_protocol_722_7.csv\nTransfer the gavage mix into a gnotobiotic facility.\nNote: It is not necessary to perform the transport of the gavage mix tube under anaerobic conditions. However, the gavage mix should be gavaged as soon as possible after its preparation and removal from the anaerobic chamber.\nPerform the first intragastric gavage as described below:\nNote: Freeze the remaining gavage mix at −20°C so that the composition of the gavage mix can be checked or verified.\nTransfer the gavage mix, a gavage needle (gauge 20, straight 38 mm) and sterile 1 mL plastic syringes into the gnotobiotic animal facility.\nDetermine weight of each mouse prior to performing the gavage in order to monitor possible weight loss due to complications during the gavage.\nAttach the gavage needle onto the 1 mL syringe and fill the syringe with 0.6 mL of bacterial suspension (sufficient to gavage three animals).\nNote: The bacterial gavage mix will change color when exposed to oxygen and might therefore turn purple when tube is opened under the laminar flow.\nRestrain the mouse and gavage 0.2 mL of the bacterial gavage mix intragastrically.",
    "Add 500 μL of each bacterial culture (DOG1 or DOG2), which was used for preparation of the gavage mix for the first intragastric gavage, to 4.5 mL of fresh mYCFA medium. Label the culture as DOG3 and incubate for 18 h.\nSecond day of gavage (Figure 5[href=https://www.wicell.org#fig5]E)\nAfter 18 h of incubation, check OD600 of culture DOG3 using the non-inoculated mYCFA tube as a BLANK control. Subsequent steps depend on the detected OD600 of culture DOG3. See Figure 6[href=https://www.wicell.org#fig6]B and Table 6[href=https://www.wicell.org#tbl6] for example values.\nOD600 of culture DOG3 > 1.5: (example: AM, BC, BI, BO, BT, BU, EC, and FP; Figure 6[href=https://www.wicell.org#fig6]B) Add 500 μL of culture DOG3 and to 4.5 mL fresh complete mYCFA medium (Figure 5[href=https://www.wicell.org#fig5]D, upper panel). Label the culture as DOG4 and incubate for 4 h.\nOD600 of culture DOG3 < 1.5: (example: CA, CS, DP, ER, MF and RI; Figure 6[href=https://www.wicell.org#fig6]B). No further dilution. Incubate culture DOG3 for 4 more hours.\nAfter 4 h of incubation, check the OD600 of DOG1 and DOG2 using the non-inoculated tube as a BLANK control. Cultures should yield an OD600 between 0.6 and 1.5. Repeat steps 22 to 26 as described above.\nPart C: Evaluation of colonization success\nAlthough establishing a relatively stable microbiota composition will take up to 20 d, it is possible to evaluate the success of bacterial colonization as early as 5 days after initial gavage by collecting fecal samples from gavaged mice and isolating the bacterial DNA as described below.\nPrepare one sterile, DNase-free 2 mL screw cap tube for each gavaged mouse.\nCollect at least 1 fecal pellet of roughly 20 mg per mouse.\nFreeze the collected fecal samples at −20°C or directly proceed with step 33.",
    "Pause Point: The following steps describe the extraction of bacterial DNA from mouse fecal samples using phenol:chloroform:isoamyl alcohol (25:24:1), followed by purification of DNA with the QIAGEN DNeasy Blood & Tissue kit. We recommend isolating bacterial DNA from fecal samples as described below. However, use of other commercially available kits could also be used in place of steps 37 to 55, provided that the replacement protocol can reliably isolate bacterial DNA from mouse fecal samples.\nBefore starting the extraction procedure, prepare 3 × 1.5 mL sterile Eppendorf tubes for each fecal sample.\nCritical: All steps using phenol:chloroform:isoamyl alcohol (25:24:1) or chloroform must be performed under a laboratory fume hood.\nIf not done previously, transfer each fecal sample to a 2 mL screwcap tube and add:\nThe equivalent of roughly 250 μL of acid-washed glass beads (212–300 μm)\n500 μL buffer A (DNA extraction component 1)\n210 μL 20% SDS (DNA extraction component 2)\n500 μL phenol:chloroform:isoamyl alcohol (25:24:1), pH 8.0\nNote: Pre-combine Buffer A and 20% SDS in the appropriate ratio, mix well and then add 710 μL of the buffer A/SDS mixture to each tube.\nBead-beat the mixture on the highest frequency (30 Hz) for 3 min using a bead mill (make sure to balance rotor with a minimum of 4 tubes).\nCentrifuge at 18000 × g and 4°C for 3 min.\nTransfer the aqueous phase (phase on the top) into a new 1.5 mL sterile Eppendorf tube.\nAdd 500 μL phenol:chloroform:isoamyl alcohol (25:24:1) and mix tube by inversion.\nCentrifuge at 18000 × g and 4°C for 3 min.\nTransfer the aqueous phase (phase on the top) into a new 1.5 mL sterile Eppendorf tube.\nAdd 500 μL of 100% chloroform and mix by inversion.\nCentrifuge at 18000 × g and 4°C for 3 min.",
    "Transfer aqueous phase (top one) into a new 1.5 mL sterile Eppendorf tube\nAdd 60 μL 3 M sodium acetate pH 5.5 (DNA extraction component 3)\nAdd 600 μL 100% isopropanol\nMix by inversion and incubate at −20°C for at least 1 h to precipitate DNA.\nNote: To save time, incubate samples at −80°C for at least 20 minutes instead.\nPause Point: It is possible to store samples at −20°C for up to 24 h.\nCentrifuge at maximum speed (21000 × g) and 4°C for 20 min.\nDiscard supernatant into the sink or a liquid waste container by inverting the tube.\nNote: In case the pellet detaches from the tube bottom, use a pipette to carefully remove supernatant.\nAdd 1 mL of 70% ethanol.\nCentrifuge at 18000 × g and 4°C for 3 min.\nDiscard supernatant as described in step 47.\nDry the pellet for 1 h at RT.\nResuspend dried pellet in 100 μL of nuclease-free water (Carl Roth).\nStore at −20°C until further use or continue with step 54.\nExtracted DNA samples will now be purified to remove remaining RNA and proteins for further downstream applications. For this purpose, we recommend using the QIAGEN DNeasy Blood & Tissue kit with some modifications as outlined below:\nAdd 300 μL QIAGEN Buffer ATL and 4 μL RNase A to the 100 μL DNA solution (see step 52).\nIncubate at RT for 2 min.\nAdd 400 μL Buffer AL.\nAdd 40 μL QIAGEN proteinase K.\nIncubate at 56°C for 30 min.\nAdd 40 μL 3 M sodium acetate pH 5.5.\nAdd 440 μL 100% ethanol.\nMix well by pipetting and transfer 750 μL on a QIAGEN DNeasy column.\nCentrifuge at 8000 × g for 1 min and discard flow-through.\nTransfer the remaining volume onto the same QIAGEN DNeasy column.",
    "Centrifuge at 8000 × g for 1 min and discard the flow-through.\nAdd 500 μL buffer AW1 and centrifuge 8000 × g for 1 min and discard flow-through.\nAdd 500 μL buffer AW2, centrifuge at maximum speed for 3 min and discard the flow-through.\nOptional: Repeat centrifugation without addition of any buffer at max speed to remove remaining ethanol from the samples.\nDiscard the collection tube and place the column on a new 1.5 mL tube.\nAdd 50 μL of DNase & RNase free water onto the column membrane.\nCentrifuge at 8000 × g for 1 min.\nResulting purified fecal DNA solutions can be stored at −20°C for at least 6 months.\nFor subsequent determination of relative abundances of bacterial strains present in the fecal samples, generation of standards of purified DNA from each strain is required.\nInoculate 50 μL of each strain into separate tubes containing 2.5 mL of mYCFA medium and incubate for 24 h at 37°C under anaerobic conditions (see steps 12 to 16).\nAfter 24 h of incubation, check OD of all cultures at 600 nm using the non-inoculated tube as a BLANK control.\nThe subsequent steps to be carried out for each culture depend on the detected OD600\nOD600 > 0.4: Add 50 μL of culture #1 and to 5 mL of fresh, oxygen-reduced mYCFA medium. Incubate for 24 h.\nOD600 < 0.4: Incubate the culture for another 24 h without further dilution\nAfter 24 h of incubation, verify that OD600 is > 1.0 for all cultures. If not, continue incubation for another 24 h without dilution.\nNote: From this step on, working under anaerobic conditions is not necessary.\nCentrifuge bacterial cultures for 10 min at 10000 × g.\nDiscard supernatant and resuspend pellet in 500 μL of buffer A.",
    "Isolate DNA by following the instructions described in steps 33 to 55.\nDetect DNA concentration, e.g., using Nanodrop, and create 4 standards with specific DNA concentrations as listed in Table 8[href=https://www.wicell.org#tbl8].\ntable:files/protocols_protocol_722_8.csv\nStandards can be stored at −20°C for at least 6 months.\nThe DNA extraction is followed by qPCR for detection and quantification of 14 bacterial strains using strain-specific primer pairs. For details on strain-specific primer sequences, see Table 9[href=https://www.wicell.org#tbl9].\ntable:files/protocols_protocol_722_9.csv\nNote: Primers are specific to regions that only occur once in the respective bacterial genome, resulting in an amplicon-to-genome ratio of 1:1. Target genes for each primer pair are listed in Table 10[href=https://www.wicell.org#tbl10].\nThe following protocol describes how to perform the qPCR using SYBR Green. However, other detection systems can be used instead, according to the researcher’s preference.\nDetect DNA concentrations in the fecal DNA solutions obtained from step 55. Dilute samples to a concentration of 20 ng μL−1 with ddH2O.\nUsing Platinum Taq DNA polymerase and SYBR Green, prepare the reaction mix for each standard dilution and each sample according to the pipetting scheme in Table 11[href=https://www.wicell.org#tbl11]. See Table 12[href=https://www.wicell.org#tbl12] for qPCR specifications and Table 13[href=https://www.wicell.org#tbl13] for an example of complete detection of all standards and 1 sample (Fecal 1) and the corresponding Cq values (see quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis]). See Figure 7[href=https://www.wicell.org#fig7] for example melting curves of resulting amplicons.\ntable:files/protocols_protocol_722_10.csv\n1For fecal DNA solutions: use 20 ng μL−1. For bacterial DNA standards, use the concentrations mentioned in Table 7[href=https://www.wicell.org#tbl7].\ntable:files/protocols_protocol_722_11.csv\ntable:files/protocols_protocol_722_12.csv\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/722-Fig7.jpg\nFigure 7. qPCR melting curves using strain-specific primer pairs",
    "Fecal samples of gnotobiotic mice colonized with 14 different human commensals were subjected to DNA isolation followed by qPCR using strain-specific primer pairs (see also Table 9[href=https://www.wicell.org#tbl9]). Representative melting curves of amplicons corresponding to each primer pair are shown. Table 9[href=https://www.wicell.org#tbl9] also lists an overview of reference melting temperatures for each amplicon.\nRun the qPCR with the specifications as listed in Table 12[href=https://www.wicell.org#tbl12].\ntable:files/protocols_protocol_722_13.csv"
  ],
  "subjectAreas": [
    "Model Organisms",
    "Immunology",
    "Microbiology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}