{
  "id": 17075,
  "origin_website": "Jove",
  "title": "Optic Nerve Sheath Point of Care Ultrasound: Image Acquisition",
  "procedures": [
    "This procedure is in accordance with the ethical standards of the institutional committee on human experimentation and with the Helsinki Declaration of 1975. Ultrasound is considered minimal risk procedure, so written consent from the patient is not required.\n1. Probe selection\nNOTE: ONSD POCUS can be performed with a multitude of different transducers. To evaluate abnormalities in suspected cases of increased ICP, choose a linear high-frequency (5-14 MHz) probe to evaluate ONSD. The probe nomenclature varies by manufacturer; however, the linear probe will be flat and usually have an L in the probe name. Choose a probe 37 mm long or smaller. Almost any probe size can be used to obtain transverse images of the optic nerve. However, sagittal views are difficult to obtain with larger probe sizes. Using a probe 37 mm long consistently allows both transverse and sagittal images in adults, while a 55 mm probe can be used in some adults but not all. Some representative probe heads are shown in Figure 1.\nPress the Select Scanner tab\nChoose a linear high-frequency probe. On this machine, choose L7HD.\nAllow the probe to connect wirelessly\n2. Ultrasound setup\nGo to presets, and choose Ocular if available. If not, choose Small Parts.\nCheck the frequency. With the scanner used in this demonstration, the frequency is visible on the lower-left side of the screen next to the frame rate. A frequency of 10 MHz can be found with most bedside linear scanners in an intensive care unit, but frequencies from 5-14 MHz can be used.\nSet the depth to 4 cm for most adult patients. The depth is seen on the right side of the image and can be adjusted on this model by scrolling up or down with a finger on the touchscreen.",
    "Set the focal zone to 2.5 cm. This is noted by the arrow on the depth ruler.\nCheck the Mechanical Index (MI) and Thermal Index (TI). If using an ophthalmic setting, these will display on the image. Ensure to keep the MI < 0.23 and the TI < 1.0. Further, ensure that the acoustic output (AO) is in the range of 20%-25% power.\n\tNOTE: One key difference from cardiac or abdominal scanning is the lower power that should be used in ophthalmic scanning. While little attention is paid to MI and TI in most point-of-care ultrasound applications, it is important in ophthalmic imaging. To avoid damage to the delicate ocular structures, the MI and TI must be kept below the levels described above. If an ophthalmic preset is available, this will be the default. If it is not available on the scanner, the small parts setting can be used.\nSet the length of the video capture to at least 4 s.\nSet the mode to B-mode, 2-dimensional greyscale ultrasound.\n\t​NOTE: Although A-mode (1-dimensional) scans are traditionally used for ocular scans involving melanoma and retinal detachments, the measurement of the ONSD is best done in B-mode. Additionally, the motion (M) mode is not valuable for measuring the ONSD.\n3. Patient selection\nInclusion criteria: Include patients with a concern for intracranial hypertension, such as severe traumatic brain injury with a Glasgow Coma Score of less than 8 or other signs of traumatic brain injury.\nExclusion criteria: The only real exclusion criterion is ocular trauma. Exclude patients with ocular trauma.\n4. Patient positioning\nPosition the patient in the default position with the head of the bed at 30°, since most patients are in the ICU. However, the exam can be performed with the patient sitting up or supine.",
    "​NOTE: In the ophthalmology office, when patients are being scanned for other indications, the patient is asked to move their eye to straighten out the optic nerve so that it heads directly posterior from the eye. However, for the indication of severe traumatic brain injury, the patient will not be able to cooperate.\n5. Scanning technique\nApply the ultrasound gel to cover the length of the transducer, which is usually several milliliters.\nClose the eyelid of the patient, and use a transparent film dressing to hold the eyelid closed to prevent corneal abrasion or other damage to the eye during the exam. See Figure 2.\n\tNOTE: In an emergency, gel can be applied directly to the eyelid while it is held closed, but this should be avoided when possible.\nPosition the probe for the transverse view. See Figure 3. Center the probe over the pupil, and sweep or fan the probe over the eye to bring the nerve into view. The globe is very hypoechoic with a distinct transition visible at the back of the eye. The optic nerve will be visible as a linear hypoechoic structure posterior to the globe. The sheath will be visible as a hyperechoic boundary of the nerve.\n\tNOTE: Commonly, the probe will need to be angled about 10°-15° medially to find where the optic nerve contacts the back of the globe.\nObtain an adequate view.\n\t\nAttempt to obtain a view with the nerve headed directly posterior from the back of the eye. This may not be possible in patients unable to cooperate in terms of adjusting the position of their eye.\nEnsure that the nerve is visible 3 mm posterior to the globe.\nOnce an adequate view is acquired, take a video.",
    "Scroll back on the video until the maximum diameter of the optic nerve sheath is seen.\nAlternatively, press the Freeze button when at the maximum ONSD, and use the review slider to ensure that the maximum ONSD has been captured. The Freeze button looks like a snowflake.\nMeasure the nerve.\n\t\nPress the Annotation button. Choose the Distance caliper. Using the caliper function, measure 3 mm posterior from where the optic nerve attaches to the retina (Figure 4).\nPress the Distance caliper again. Measure the outermost lateral borders of the optic nerve sheath. The sheath is what tends to increase in size with increasing intracranial pressure, so measuring the outer diameter of the sheath is important.\nSave the annotated image by pressing the Save button on the bottom right of the screen. This button looks like a camera for this brand.\nObtain a sagittal view.\n\t\nCenter the probe on the eye, as seen in Figure 3B.\n\t\tNOTE: The added benefits of measuring in the sagittal plane are unclear, but it is easy to do and has a negligible risk to the patient, so it is recommended to obtain the maximum information to guide clinical decision-making if possible. Some authors9 average the transverse and sagittal measurements to minimize the impact of technique variability.\nUse the same steps as for the transverse view, specifically steps 5.3-5.8, to obtain an adequate image and measure the ONSD. It may not be possible to obtain a sagittal view if the probe is greater than 37 mm in length.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}