{
  "id": 12299,
  "origin_website": "Jove",
  "title": "Reducing State Anxiety Using Working Memory Maintenance",
  "procedures": [
    "All participants gave written informed consent approved by the National Institute of Mental Health (NIMH) Combined Neuroscience Institutional Review Board (IRB) and were compensated for participating.\n1. Set Up the Equipment\nNOTE: Set up the equipment as described below (see Figure 1A)3.\nIn the control room, set up two computers, one to administer the experiment, and one to record the physiological data.\nIn the subject room, set up a standard 19 in liquid crystal display monitor and keyboard (or button box) to display stimuli to the participant and to record participant responses, respectively.\nTo record the psychophysiology, connect the recording computer to the psychophysiology monitoring hardware using an Ethernet to USB adapter.\nTo split the Transistor-Transistor Logic (TTL) signals between the recording and stimulus delivery hardware, connect the parallel port of the experiment computer to the breakout box using a ribbon cable.\nTo pass the TTL signals to the psychophysiology monitoring hardware, connect the breakout box to the hardware using a ribbon cable.\nTo pass the TTL pulses to the stimulus delivery hardware, connect the breakout box to the signal generator using a Bayonet Neill-Concelman (BNC) cable.\nTo generate a control signal for the shock device, connect the signal generator to the shock device using a BNC cable.\nSet the signal generator and shock device to deliver a 100 ms, 200 Hz shock. See Figure 1B and C for all settings.\n2. Program the Experiment Using Available Software\nNOTE: A neurobehavioral systems software (here referred to as the experimental software; see the Table of Materials) was used. Other equivalent software can be used.\nProgram four testing phases using the parameters described below and the supplementary code files provided (see the supplemental code for details).\nFor each phase, program 26 trials.",
    "Divide the trials into 4 alternating blocks of threat and safety, with 6 trials per block.\nAt the beginning of each trial, present a cue indicating how many letters will be presented for 2,000 ms each.\nAfter the cue, present the encoding letter sequence for 2,500 ±1,000 ms.\nOn low-load trials, present 5 letters sequentially, one after the other.\nOn high-load trials, present 8 letters sequentially, one after the other.\nProgram a maintenance period following the encoding phase for 9,000 ±1,000 ms.\nAt the end of the maintenance period, present a response prompt for 2,000 ms.\nProgram the response prompt to display a letter on the left side and a number on the right side of the monitor, with the letter representing a letter from the encoding sequence, and the number referring to a position in the sequence.\nUnderneath the letter and number, display the words \"match/mismatch,\" referring to if the letter matched or mismatched the position number.\nProgram the experiment so that half of the trials match and half mismatch.\nUse a keyboard or button box to record responses.\nSeparate the trials by a variable-duration intertrial interval (ITI) that is dependent upon the timing of the within-trial events such that each trial is 23 s long.\nVary the durations of the encoding, maintenance, and ITI periods across trials by selecting a random duration (in ms) between the ceiling and floor values for each period.\nCounterbalance the experiments to have half of the participants start in a safe block and half of the participants start in a threat block.",
    "In each run, present between 0 and 2 pseudorandom shocks during each of the threat blocks for a total of 3 shock presentations per run. Make sure to include an extra (dummy) trial for each shock to ensure that the same number of trials are included in the safe and threat blocks.\nAt the beginning of each run, present five 40 ms bursts of 103 dB white noise (near-instantaneous rise/fall times) over headphones to habituate the startle response.\nDuring each run, present 3 presentations of the white noise during the following conditions to probe the startle response (see Figure 3): safe versus threat, low load versus high load, and maintenance period versus ITI.\nSpace the probes so that they occur with a minimum interprobe interval of at least 17 s to avoid the short-term habituation of the startle response.\nFor maintenance period trials, present probes no less than 1 s after the offset of the letter series.\nFor ITI trials, present probes no less than 4 s after the offset of the response prompt.\nSet up the equipment for physiological monitoring using the associated software package, as per the manufacturer's instructions.\n3. Run the Experiment\nEscort the participants to the study room.\nAdminister informed consent.\nGive the participants the State-Trait Anxiety Inventory Y-1 (STAI-Y1)25, the Beck Anxiety Inventory (BAI)26, the Beck Depression Inventory (BDI)27, and the Anxiety Sensitivity Index (ASI)28 to fill out prior to task instructions and set up.\nInform the participants that they will see 2 types of trials and will respond to those trials based on the following details.\nDuring the low-load trials, instruct the participants to maintain a series of 5 letters in their memory in the order in which they are presented.",
    "During the high-load trials, instruct the participants to maintain a series of 8 letters in their memory in the order in which they are presented.\nInform the participants that, after a delay, they will be prompted with a letter and a number that refers to the position in the sequence.\nInstruct the participants to indicate whether the letter and position number match or mismatch the trial sequence using the left or right arrow key, respectively.\nInform the participants that trials will occur during periods of safety and periods of threat, when they are at risk of receiving unpredictable mild electrical shocks to the wrist.\nInform the participants that they will hear acoustic startle probes throughout the experiment, in both the safe and threat conditions.\nClean and attach electrodes to each participant, based on the diagram in Figure 2.\nPlace two disposable 11 mm silver-silver chloride (Ag-AgCl) electrodes on the palm of the left hand, about 2 cm apart, to monitor skin conductance.\nPlace two disposable 11 mm Ag-AgCl electrodes on the inner wrist of the left hand, about 3 cm apart, to administer the electrical stimulation.\nPlace one disposable 11 mm Ag-AgCl electrode on the inside of the left arm, just above the elbow, and one disposable electrode just under the right clavicle to monitor the heart rate.\nAttach two 4 mm Ag-AgCl cup electrodes to the lower side of the left orbicularis oculi muscle to measure the startle response.\nSecure all electrodes with biomedical tape.\nAttach leads to the electrodes on the palm and plug them into the EDA channel of the psychophysiology monitoring hardware.\nAttach leads to the electrodes on the wrist and plug them into the shock device.",
    "Attach leads to the electrodes on the arm and clavicle and plug them into the ECG channel of the psychophysiology monitoring hardware.\nPlug the cup electrodes attached to the orbicularis oculi muscle into the electromyography (EMG) channel of the psychophysiology monitoring hardware.\nShock calibration.\nPrior to the start of the experiment, have the participants rate a series of 100-ms sample electrical stimulations to identify an intensity level that is unpleasant and uncomfortable, but not painful.\n\t\t\nAdminister a series presentation (~5-10) of the 100 ms shock stimulus to the wrist using the experimental software package (see supplemental code files and the Table of Materials).\nAfter each presentation, have participants verbally rate each presentation on a scale from 1 (not uncomfortable at all) to 10 (uncomfortable but not painful).\nUsing the mA scale on the shock device, gradually increase the intensity of the shock and continue the series of stimulations the until subject rates the stimulation as a \"10.\"\nRecord the intensity value on the participant detail packet.\n\t\t\tNOTE: During the study, present the shocks at the determined intensity.\nTo start the experiment, enter the participant ID number, counterbalance condition, and run number into the run box, as prompted by the experiment software.\n\tNOTE: Create two counterbalanced conditions. The first counterbalance will start the experiment in a threat block, and the second counterbalance will start the experiment in a safe block. See section 2.\nClick \"start\" on the psychophysiology monitoring recording.\nPress \"enter\" on the experimental software prompt box to start the experiment.\nAllow the subject to complete 4 runs of the experiment. Have the participant select the left or right arrow key if the letter and position number match or mismatch the trial sequence, respectively (steps 3.7 and 3.8).",
    "NOTE: Program each run length to last between 6 and 7 min. Program the shocks to be delivered pseudo-randomly between 0-2 times/run. See section 2.\nAfter each run, have the subject verbally rate their anxiety level on a scale from 0 (not anxious) - 10 (extremely anxious) during the safe and threat blocks of the run they just completed.\nHave the subjects verbally rate the intensity of the shocks presented during the previous run on the same 0-10 scale used in the initial calibration procedure (section 3.17).\n4. Analyze the Performance\nNOTE: Analyze the performance data for a single participant using the following instructions.\nOpen the output file created from the experiment software.\nTo average the correct responses across the different conditions, first separate the data into safe versus threat and low load versus high load to yield 4 unique conditions of response data.\nCount the correct trials for each of the 4 conditions and divide this number by the total number of trials in each condition.\nTo average the reaction time across the different conditions, separate the data as in step 4.1.1.\nSum all the reaction times for each condition and divide this number by the number of trials in each condition.\n\t\tNOTE: Omit trials that include a shock presentation, as indicated in the experimental software output.\nAt the group level, perform a 2 (safe versus threat) x 2 (low load versus high load) ANOVA across subjects to identify differences in behavioral performance and reaction times29.\n5. Analyze Startle\nPrepare the raw EMG data for analysis using psychophysiology analysis software30. See Figure 4A.\nSelect \"Transform\" >> Digital Filters >> FIR >> Bandpass from the psychophysiology analysis software to apply a digital bandpass filter (30-300 Hz passband), smoothing the raw EMG channel (see Figure 4B).",
    "Select Analysis >> Electromyography >> Derive Average Rectified EMG from the psychophysiology analysis software to rectify the smoothed EMG signal using a time-windowed mean of 20 ms (see Figure 4C).\nSelect Analysis >> Stim-Response >> Digital Input to Stim Events from the psychophysiology analysis software to label the stimulus events that correspond to the digital inputs for each trial type.\n\tNOTE: For example, trial types include safe versus threat, low load versus high load, and maintenance period versus ITI period.\nExtract the blink magnitude around each stimulus event30.\nSelect Analysis >> Stim-Response >> Stim-Response Analysis and specify the Mean of Channel (i.e., the channel number corresponding to the processed EMG) from the psychophysiology analysis software to extract the mean baseline activity in a fixed window of -50 to 0 ms preceding the onset of the white noise.\nSelect Analysis >> Stim-Response >> Stim-Response Analysis and specify the Max of Channel (i.e., the channel number corresponding to the processed EMG) from the psychophysiology analysis software to identify the blink onset and peak in a fixed window of 20 to 100 ms following the onset of the white noise.\nExclude trials with excessive noise on the EMG channel30.\n\tNOTE: The acoustic startle responses must be reliably distinguished from excessive background EMG activity or other sources of contamination (e.g., movement artifacts or voluntary and spontaneous blinks immediately preceding auditory probes; see Figure 4D).\nAnalyze the trial-by-trial blink responses using a standard spreadsheet software.\nNormalize the blink magnitudes into z-scores (optional).\nConvert the z-scores to t-scores for further analysis (t = 10x + 50; optional).\nAverage the t-scores and/or raw scores across trials for each trial type and calculate the APS (threat versus safe) for each condition (e.g., low load versus high load and maintenance period versus ITI period).",
    "At the group level, perform a 2 (safe versus threat) x 2 (maintenance period versus ITI) ANOVA across subjects to identify the effect of WM maintenance on APS.\n6. Analyze the Self-report Data\nAverage the anxiety ratings across runs for the safe and threat conditions.\nAt the group level, perform a threat versus safe t-test to determine the effectiveness of the threat manipulation."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}