{
  "id": 17736,
  "origin_website": "Jove",
  "title": "Osteoarthritis Pain Model Induced by Intra-Articular Injection of Mono-Iodoacetate in Rats",
  "procedures": [
    "Procedures involving animal subjects have been approved by the Medical Norms and Ethics Committee of Zhejiang Chinese Medical University and are in accordance with the China legislation on the use and care of laboratory animals.\n1. Intra-articular injection of mono-iodoacetate in the knee\nAfter one-week of acclimation, randomly and equally divide 40 male Sprague-Dawley rats weighing 180−200 g (4−5 weeks old) into four groups (n = 10 rats/group).\n\tNOTE: Rats in the control group will be intra-articularly injected with 50 µL of saline, while rats in the experimental groups will be treated with 0.5, 1.5 or 3 mg of MIA dissolved in 50 µL of saline, respectively.\nOn the day of injection, freshly prepare the solution of MIA in sterile saline (0.9% NaCl) at 15, 30 and 60 mg/mL concentration and 10% pentobarbital solution in sterile saline (0.9% NaCl).\n\tCAUTION: MIA has an extremely destructive effect on the mucous membrane, the upper respiratory tract, the eye and the skin and other tissue. Therefore, mask and gloves are recommended when preparing a solution.\nAnesthetize rats by intraperitoneal injection of ketamine at 60 mg/kg and xylazine at 5 mg/kg (both prepared in saline). Gently clamp the toes of the rat with a tweezer to confirm anesthesia.\nPlace the rat with its back facing down. Shave the knee and wipe the area surrounding the knee joint with alcohol.\nKeep the knee at a 90° angle and reveal the white patellar tendon below the patella. Press the patellar tendon with the fingertip to find the gap beneath the patella.\nChoose the junction of the gap and the lateral patellar tendon as the injection site. Then, insert the 26 G needle vertically into the site about 5 mm. No resistance should be felt when the needle is in the articular space.",
    "NOTE: It is important to keep the needle perpendicular to the injection site.\nInject 50 µL of saline or MIA solution into the joint cavity. Slowly pull out the needle and wrap a piece of gauze around the injection site to minimize reflux and leakage. After anesthesia recovery, remove the gauze.\nTest pain-related behavior at 1, 7, 14, 21, 28 and 35 days after injections as described in section 2.\n2. Behavioral assessments\nMechanical withdrawal threshold (MWT)\n\tNOTE: The MWT was measured by the von Frey test13 and the observer was blinded to the injections that the animals had received.\n\t\nPlace a rat in an elevated plastic cage (17 cm x 11 cm x 13 cm) with a wire mesh base suspended 50 cm above a table. Ensure the testing environment is quiet and give the rat 30 min to adapt to the environment.\nPress the von Frey needle perpendicularly on the plantar surface of each rat’s hind paw. Increase the pressure gradually (approximately 20 g/s) and linearly until paw lifting or paw licking occurs.\nUse a force lower than the previous threshold to ensure that the threshold is the minimum withdrawal force. Test each rat more than three times, at least 3−5 min apart.\nRecord the minimal force eliciting a paw withdrawal reflex. Average the data as the MWT of rats.\nThermal withdrawal latency (TWL)\n\tNOTE: The TWL was measured using the plantar test apparatus (Table of Materials) and the observer was blinded to the injections that the animals had received.\n\t\nPlace a plexiglass box (60 cm x 20 cm x 14 cm, divided into 6 compartments) on a 3 mm thick glass plate, and put rats into the box (one in each compartment). Ensure the environment is quiet and the room temperature is constant.",
    "Give rats 30 min to adapt to the testing environment.\nCalibrate the thermal stimulus via the infrared radiometer. Set the desired infrared intensity at 70 units.\nPlace the infrared emitter/detector on the container directly under the center of the paw being tested.\nPressing the START button. The timer will start automatically. The controller will automatically turn off the infrared light and stop the timer altogether as soon as movement of the paw occurs.\nRecord the reaction time when the appearance of paw withdrawal and paw licking.\n\t\tNOTE: A positive response for the test is regarded as paw withdrawal and paw licking. If only paw withdrawal occurs, it should be regarded as a voluntary movement of the rat rather than a positive response.\nRepeat the test more than three times. Average the data as the TWL of rats.\n\t\tNOTE: Each exposure of radiant heat should not exceed 20 s. Infrared stimulations on the same hind paw should be at least 3−5 min apart.\nGait pattern analyses\n\tNOTE: The gait pattern analyses were measured using an imaging system (Table of Materials) and the observer was blinded to the injections that the animals had received.\n\t\nAdjust the length of the walking compartment by using the knobs at both ends of the walking compartment to suitable length for rats (e.g., 61 cm).\nPlace a rat into the walking compartment and train rats to make uninterrupted runs for at least 5 step-cycles at a speed of at 18 cm/s before the formal experiment.",
    "NOTE: When a rat is first placed in the walking compartment, the speed can be set to about 20 cm/s and shut off when running around 2 s. Then set the speed to 18 cm/s. Gently tap the back of the rat with the partition, if the rat pauses or retreats during walking. Try to reduce the speed gradually from 18 cm/s to 10 cm/s. If the rat eventually fails to perform the test, it is acceptable to choose another rat for the test.\nSlowly increase the speed of the treadmill until it reaches the target speed (18 cm/s). Capture at least 5 s video of continuous movement of the rat with the high-speed digital video camera mounted below the transparent treadmill belt.\nTest each rat at least 5 min apart to obtain at least three uninterrupted runs.\nDraw a “bounding box” to define the boundary of animal walking image in the imaging software and enter the run speed for each video. Select videos as a group and process videos automatically by the software. After processing videos, the software will output several spreadsheets to report gait indices, including stance, swing, braking, propulsion, cadence, step sequence, etc.\nCalculate total paw area (cm2), average stride length (cm), and unite stride length.\n\t\tNOTE: Total paw area is the mean of the total area of four paws of each group of rats and paw area is defined as the maximal paw area in contact with the treadmill during the stance phase of the step cycle. Stride length is the distance between initial contacts of the same paw in one complete stride. Unit stride length = average stride length (cm)/body length (cm). \n3. Histopathological and immunohistochemical analyses",
    "Euthanize rats by intraperitoneal injection of pentobarbital sodium at 150 mg/kg (prepared in saline). Resect the knee joints immediately for the histologic analyses.\nFix the joints in 10% formalin for 24 h, decalcify with 10% EDTA in phosphate buffered saline (PBS) for 8 weeks, and then embed joints in paraffin.\n\tCAUTION: Formalin can cause eye, skin, and respiratory tract irritation. It should be handled in a hood.\nSection the paraffin embedded joints at 3 mm thickness with a microtome and float in a 40 °C water bath containing distilled water.\nTransfer sections onto glass slides. Dry slides overnight and store slides at room temperature (RT) to continue the following staining.\nPlace slides in a 60 °C oven for 4 h to deparaffinize.\nImmerse the slides successively in xylene, xylene, 100% ethanol, 100% ethanol, 95% ethanol, 80% ethanol and 75% ethanol for 5 min, respectively, at RT.\nStain sections with hematoxylin and eosin (H&E), safranin-O (SO) and Alcian blue hematoxylin (ABH) as well as antibodies against rat type II collagen (Col2), type X collagen (Col10) and matrix metalloproteinase 13 (MMP13), as described in steps 3.8−3.12.\nH&E staining\n\t\nRinse slides with deionized H2O for 3 min. Stain slides with hematoxylin for 3−5 min.\nRinse slides with deionized H2O 3x, 1 min each, until no hematoxylin remains on the surface.\nStain slides with eosin for 30 s. Then, rinse slides with deionized H2O 3x, 1 min each, until no eosin remains on the surface.\nImmerse slides in 0.1% ammonia for 10−20 s. Then, rinse slides with deionized H2O 3x, 1 min each.\nImmerse slides successively in 95% ethanol, 100% ethanol, xylene, xylene and xylene for 1 min, respectively.\nCoverslip the slides by neutral resin.\nSO staining\n\t\nRinse slides with deionized H2O for 3 min. Stain slides with hematoxylin for 3−5 min.",
    "Differentiate quickly in 1% acid alcohol (about 3 s). Then, rinse slides with deionized H2O 3x, 1 min each, until no hematoxylin remains on the surface.\nStain slides with Fast Green (FCF) solution for 5 min. Then, rinse slides with deionized H2O 3x, 1 min each.\nStain slides with SO for 1−2 min. Then, rinse slides with deionized H2O 3x, 1 min each.\nRinse slides with 1% acetic acid for 1−2 min to remove the residual FCF. Rinse slides with deionized H2O for 1 min.\nImmerse slides successively in 95% ethanol, 100% ethanol, xylene, xylene and xylene for 1 min, respectively.\nCoverslip the slides by neutral resin.\nABH staining\n\t\nRinse slides with deionized H2O for 3 min. Immerse slides in 1% acid alcohol for 30 s and drain briefly on a paper towel (do not rinse).\nImmerse slides in ABH for 1 h. Then, rinse slides with deionized H2O 3x, 1 min each, until no ABH remains on the surface.\nDifferentiate quickly in 1% acid alcohol (about 3 s). Rinse slides with deionized H2O 3x, 1 min each.\nImmerse slides in 0.5% ammonium water for 15 s. Then, rinse slides with deionized H2O 3x, 1 min each.\nImmerse slides in 95% ethanol for 1 min. Immerse slides in eosin/orange G solution for 1.5 min.\nImmerse slides successively in 95% ethanol, 100% ethanol, xylene, xylene and xylene for 1 min, respectively.\nCoverslip the slides by neutral resin.\nExamine all slides under a microscope and statistically grade on a scale of 0−13 by double-blind observation, according to Mankin’s scoring system14.\nImmunohistochemistry\n\t\nRinse slides with deionized H2O for 3 min.\nImmerse slides in 0.1 M sodium citrate and place slides in a 60 °C oven for 4 h to retrieve the antigen.",
    "Immerse slides in 0.3% Triton X-100 in PBS for 10 min. Then, rinse slides with PBS 2x, 3 min each.\nIncubate sections in 3% H2O2 solution in methanol at RT for 10 min to block endogenous peroxidase activity. Rinse slides with PBS 2x, 3 min each.\nIncubate sections with 5% goat serum in PBS for 30 min at RT to block any non-specific binding. Rinse slides with PBS 2x, 3 min each.\nIncubate sections overnight at 4 °C with 100 µL of PBS-diluted (1:1,000) primary antibodies against rat type II collagen (Col2), type X collagen (Col10) and matrix metalloproteinase 13 (MMP13). Rinse slides with PBS 2x, 3 min each.\nIncubate sections with 100 µL of PBS-diluted (1:1,000) secondary antibody (goat anti-mouse secondary or goat anti-mouse secondary) for 20 min at RT. Rinse slides with PBS 2x, 3 min each.\nIncubate sections with 100 µL of 3,3′-diaminobenzidine (DAB) working solution. Monitor the reaction as the chromogenic reaction turns the epitope sites brown.\n\t\tCAUTION: DAB is a carcinogen. Always wear gloves and work in a hood when working with DAB.\n\t\tNOTE: The time of color development may vary from a few seconds to 10 min.\nAs soon as a brown color develops on the sections, rinse slides with deionized H2O 2x, 3 min each.\nImmerse slides in hematoxylin for 1−2 min to counterstain slides. Then, rinse slides with deionized H2O 3x, 1 min each.\nImmerse slides successively in 95% ethanol, 100% ethanol, xylene, xylene and xylene for 1 min, respectively.\nCoverslip the slides by neutral resin.\nObserve the color of the antibody staining in the sections under a microscope.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}