{
  "id": 6925,
  "origin_website": "Bio",
  "title": "Development of the Deoxycorticosterone Acetate (DOCA)-salt Hypertensive Rat Model",
  "procedures": [
    "Unilateral nephrectomy and transmitter implantationInstruments and other materials used for surgeries must be sterile. There are several methods of sterilization. We recommend for this protocol steam sterilization (autoclaving) of all instruments. Rats should be weighed and doses of anesthetics and medications given according to individual body weight.Anesthesia and Pre-Surgical proceduresFast the rats the night before the surgical procedures (approximately 8 h before).Place the rats in an induction chamber in which isoflurane is delivered in 100% oxygen. The induction must start at 0.5% of isoflurane every 5 min, until the gas induction reaches 5% (for more details see Reference 9).Apply eye ointment to the eyes for lubrication.When the animals have reached a surgical plane of anesthesia, remove from the chamber and placed on the heating pad (make sure it has circulating warm water) and secure the rats with tape and position them in dorsal recumbency.Pull the rat's tongue to the side of the mouth to maintain an open airway.Maintain a state of deep anesthesia by using a nose cone administering isoflurane at 2% in oxygen.Provide pre-operative doses of atropine (0.5 mg/kg; intramuscular), gentamicin (6 mg/kg; subcutaneously) and ketoprofen (2.5 mg/Kg; subcutaneously).Maintain all rats on a heating pad during surgery and postoperative recovery.Once fully anesthetized animals, characterized by lack of response to clamping pressure with fingers applied to the distal tail, shave the rats (clipping) in the areas needed for the surgical procedure (Figure 3) and scrub the surgical site 3 times with iodine antiseptic solution, then 70% alcohol as recommended by Institutional Animal Care and Use Committee (IACUC) and Research Animal Resources (RAR).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200731/20200731034326_3118.jpgFigure 3. Schematic of rat’s preparation for the surgical procedures. Area to be shaved (A). Incision (B) and opening of the abdominal cavity (C).Note: Perform both surgeries at the same time on each rat.",
    "Using sterile gloves, drape the surgical area to prevent contamination of the disinfected site, cute a hole in the drape. In the case of multiple surgeries, it is recommended no more than 6 animals may be done with the one set of instruments, and between one and another clean and sterile instruments. In addition, new sterile gloves must be donned.Approximately 10 min before the surgical procedure, open transmitter package, record the serial number and ensure the device has been identified with the animal in which it will be implanted.Surgeries (Figure 4)Unilateral nephrectomy surgery (Zwemer, 1999 provides more detailed step by step instructions of this procedure):imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200731/20200731034358_8305.jpgFigure 4. Schematic of surgeries procedures and experimental timeline. Unilateral nephrectomy (A). Pressure transmitter implantation (B). Perform both surgeries at the same time in each rat approximately 19 days before the DOCA or sham pellet implantation. After the surgical procedures provide 14 days of recovery before the next procedure, allowing for compensatory renal hypertrophy associated with the unilateral nephrectomy. During this recovery period, the animals are housed in normal cages and have access to standard rat chow and water ad libitum. After the 2 weeks of recovery, transfer all rats to individual metabolic cages and provide 0.1% NaCl diet and ad libitum 0.9% NaCl drinking solution. Daily, during 5 control days, measure water and food intake as well as urine output, blood pressure and heart rate. After this control period perform surgery (C) for subcutaneous implantation of DOCA or sham pellets. During 21 days after DOCA or sham pellet implantation perform daily measurements of blood pressure, heart rate, food and water intake and urine output. At the end of the experiment, euthanize the rats deeply with a lethal dose of pentobarbital sodium.Transmitter implantation (Figure 5; Reference 4 and Cesarovic et al.",
    ", 2011 provides more detailed step by step instructions of this procedure):Make a 4-6 cm midline incision using a sterile number 10 scalpel blade through the skin gently dissecting from the abdominal wall.Cut abdominal muscles along the midline linea alba using sharp scissors to expose the contents of the abdomen (stomach, small bowel, large bowel, spleen, pancreas, and mesenteric arteries and veins).For better visualization, the kidneys can be exposed by gently pulling on the viscera and releasing them out of the abdomen and pushing them to the right side of the animal.Identify and isolate the renal blood supply using two ligatures. Tie off artery and vein together at the hilus of the kidney using sterile 3-0 silk suture. The right ureter is connected to the renal hilus and should be tied off as well. Cut the vessels and ureter using iris scissors (Figure 2, instrument A8) close to the hilus.Carefully isolate the fat and connective tissue surrounding the right kidney to avoid damaging the adjacent adrenal gland and remove the kidney.Transmitter implantation (Figure 5; Reference 4 and Cesarovic et al., 2011 provides more detailed step by step instructions of this procedure):imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200731/20200731034424_4970.jpgFigure 5. Schematic of transmitter implantation. The catheter is placed into the abdominals aorta between the renal arteries and the iliac bifurcation. The telemetry device is anchored to the abdominal wall closure (modified by Reference 4).Using moistened cotton applicators, gently part the intestines to allow visualization of the descending aorta located along the dorsal body wall. Retract the intestines using moistened gauze sponges.Next, the descending aorta must be visualized. Using sterile cotton applicators, dissect carefully and completely the surrounding fat and connective tissue from the aorta.Before the catheterization, clear excess tissue from the ventral surface of aorta. This ensures good hemostasis.",
    "Once everything is ready for the implantation, clamp the aorta just distal to the renal arteries (Figure 2, instrument A13) and puncture with a bent 21-gauge needle distal to the clamp (just proximal to the distal aortic bifurcation).Note: At this point, the time for catheter placement is limited due to potential ischemia caused by clamping. Insert the tip of the telemetric device catheter (Data Science International, St. Paul, MN) into the abdominal aorta and guide upstream (using forceps A17), cranially approximately 1 cm. Apply a small drop of tissue adhesive (Vetbond surgical adhesive) and a surgical patch (Data Science International) to secure the catheter and obtain hemostasis.Wait approximately 30 s for the adhesive to bond and remove the clamp.The transmitter placement in the aorta can be verified after the clamp is removed because the device transmits an AM radio frequency and can be heard on small AM radio situated near the body of the transmitter (Video 1).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. The transmitter placement in the aorta Place the body of the telemetric device in the abdominal cavity and suture it in the abdominal musculature using sterile 3-0 silk suture.Gently replace the abdominal contents in rats and close the laparotomy in layers (close abdominal musculature and skin individually) using sterile 3-0 silk suture.Upon completion of surgery, place the animals in individual cages, with half of the cage on the heating pad until rats are awake.Using a small scissor remove the suture and staples approximately 7-10 after the surgeries.Post-surgical treatment: Provide buprenorphine for 3 days Bis In Die (B.I.D; 0.05-0.1 mg/kg; subcutaneously) and access to normal rat chow and water ad libitum.Monitor the rats daily for BARG signs (bright, alert, responsive and grooming) of good health.",
    "If the animals do not show BARG signs it is recommended to contact the veterinarians to assess their condition and if they are viable for use in the experiment.Give approximately 14 days to recover in standard cages before the next procedure, allowing for compensatory renal hypertrophy associated with the unilateral nephrectomy.Metabolic cages (Figure 6): assessment of daily water and food intake, and urine outputimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200731/20200731034503_8643.jpgFigure 6. Individual metabolic cage (Nalgene Nunc, Rochester NY). Metabolic cages for rodents are an important tool for studies in which it is necessary to measure water/food intake, feces and urine output. In general, all components are dismountable and washable. The containers for water and urine (1 and 2) and urine (3) are cylindrical plastic tubes that facilitate accurate measurements of consumption and output, respectively. The food is stored in a plastic drawer (4) that easily slides without disturbing the animal. Feeder Chamber (5), located outside cage. A collection funnel and separating cone (6) provide complete separation of feces and urine (For more information we recommend to consult Ancare website[href=http://www.ancare.com/products/cages-and-caging-equipment/metabolic-cages/nalgene-metabolic-cage-rats-and-mice]).After 2 weeks of recovery, keep all rats housed individually in metabolic cages (Nalgene Nunc, Rochester, NY), provide 0.1% NaCl diet and ad libitum 0.9% NaCl drinking solution.During this period measure 24-h water and food intake. These measures are obtained by subtracting the amount of water/food offered by the amount of water/food remaining on the following day at the same time.To measure the urine output, note the volume contained in the specific cylinder located under the cage.Calculate sodium intake as the sum of the sodium received from saline intake (0.154 meq/ml) plus the product of the food intake and the sodium content of the food (0.1% NaCl, 3570.0175 mmol/g).",
    "Calculate the daily sodium and water balances as the difference between intake and urinary excretion of sodium and water, respectively.DOCA or sham pellets implant surgeryMake the DOCA and sham silicone implants at least 72 h prior to surgical implantation.Pellet preparationWeigh 100 mg of DOCA into one small weigh boat (see Figure 2; B2). Repeat for as many needed within the week.Draw up 2 ml of Part A of Sylgard 184 Silicone in 3 ml syringe, and add to the weigh boat with the pre-weighed DOCA. Mix thoroughly will spatula for ~30-45 s. Be sure to break up any small clumps, as homogeneity is extremely important to the quality of the pellet*.Note: *This is a critical step in the preparation of pellets. If these are not well homogenized absorption rate is not consistent and the results may be confounded due to variability. Draw up 0.2 ml of curing agent from the silicone kit in a 1 ml syringe, and add the 0.2 ml to the silicone mixture. Mix thoroughly again for ~30-45 s.Cover with pre-labeled aluminum foil (i.e., 100 mg DOCA and date), and set aside to cure for 24 h at room temperature.Let the DOCA implants cure at room temperature for 24 h and then refrigerate at 4 °C until the day of the surgical implantation.The sham pellets are prepared as a vehicle identically as described above without the addition of the DOCA.Implantation: This procedure must be performed after 5 control days after the 2 weeks recovery period (see Figure 4).Prior to surgery, use a sterile scalpel to slice DOCA pellet into ~1-2 mm3 pieces, and transfer contents to large, ethanol-cleaned spatula.After anesthetizing all rats and providing pre-surgical treatments and disinfection procedures as described above, implant DOCA or sham pellets.Shave and clean the left flank.",
    "Make a skin incision (~3-4 cm), and use a mayo scissors to form a subcutaneous pocket.Insert spatula into opening, and push the pellet (one per rat) into pocket.Close surgical site with staples or suture.As describe above, after surgery keep the animals in individual cages, half of the cage must be kept on the heating pad until they return from anesthesia.Note: Pellets will likely stick or pile up, so be sure to flatten and disperse with finger pressure once the surgical opening is closed. Return rats to their home cages upon recovery and provide analgesia to the rats with ketoprofen (2.5 mg/kg IP) once daily for 3 days post-surgery. Continue to provide ad libitum access to their 0.1% NaCl powdered food and 0.9% NaCl drinking solution.Maintain the rats individually housed in respective metabolic cage, which are positioned on the receiver (set up DSI monitoring equipment [Figure 1], 500 Hz for 10 s/min) and make daily measurements of mean arterial pressure (MAP) and heart rate (HR), food and water intake and urine output for 21 days after DOCA implantation.Note: After placing the animals in the individual metabolic cages located on the receivers, it is important to wait 15-25 min for the cardiac parameters to return to baseline levels. Euthanasia At the end of the experiment, euthanize the rats deeply with a lethal dose of pentobarbital sodium (65 mg/kg, intraperitoneal)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}