{
  "id": 8460,
  "origin_website": "Jove",
  "title": "Ex Vivo Myelination and Remyelination in Cerebellar Slice Cultures as a Quantitative Model for Developmental and Disease-Relevant Manipulations",
  "procedures": [
    "All animal studies were authorized and approved by the Genentech Institutional Animal Care and Use Committee.\n1. Preparation of media and supplies for dissection (~30–45 min)\nPrepare and sterile filter slice culture medium (SCM) and dissection medium (DM) as detailed in Table 1. Store at 4 °C. If any factors are being tested for the myelination assay, add them to the SCM just before use.\nPipette 1 mL of SCM into each well of 6 well plate.\nUsing sterile forceps, place an organotypic insert into each well, ensuring no bubbles are trapped under the membrane. Warm the plate with media at 37 °C in 7.5% CO2 incubator.\n2. Preparation of the dissection area (~5–10 min)\nPerform procedures in a sterile laminar flow hood or on the benchtop with adequate aseptic techniques for all steps of the procedure. Wipe all areas clean with 70% ethanol.\nPlace a new blade and silicone cutting stage on the tissue chopper. Pipette ~300 µL of sterile water or 70% ethanol under the cutting stage to ensure it stays in place.\nUse a cotton swab to gently wipe the tissue chopper blade and cutting stage with 70% ethanol. Dry before using the tissue chopper.\nSpray all dissection tools with 70% ethanol and dry prior to the dissection.\nPrepare two 10 cm Petri dishes: one with 15–20 mL of DM, one with 10 mL of SCM. Store on ice. Keep all media and Petri dishes on ice when not dissecting.\n3. Cerebellar slice culture dissection (~15–20 min per pup)\nPlace the Petri dish with DM on a dissecting microscope.\nEuthanize a mouse pup, postnatal day P0–2, by swift decapitation with sharp scissors.\nPlace the head in the Petri dish with DM under the dissecting microscope to clear blood.",
    "Using fine scissors, cut once on each lateral edge at the base of the skull.\nWith the head placed upside down in DM, press down firmly on the underside of the skull using #5/45 forceps, forcing the undamaged hindbrain through the hole in the skull.\nUnder the dissecting microscope, cut away excess tissue using two #11 scalpels. Ensure the cerebellum remains attached to the underlying piece of hindbrain. See Figure 1A for a detailed diagram.\nUsing the spatula, transfer the cerebellum to the cutting stage of the tissue chopper with the tissue resting on the rostral face of the hindbrain and the caudal face of the hindbrain facing the researcher. Ensure that the medial plane of the brain is exactly parallel to the tissue chopper blade.\nUsing the P200 pipette, remove excess medium around the tissue, ensuring that it is still moist but not floating or surrounded by liquid.\nSwap the Petri dish containing DM with the Petri dish containing SCM under the dissecting microscope.\nCut the tissue into 350 µm thick slices using the tissue chopper.\n\tNOTE: The blade speed (e.g., roughly one cut per second) and force need to be optimized to ensure optimal cutting conditions. In rare instances, the tissue will get caught on the blade. To minimize loss of tissue sections, keep the thumb on the power button to quickly turn off the tissue chopper if needed.\nGently pipette 100 µL of SCM under the tissue, so the slices are floating. Transfer the sliced tissue using the spatula to the Petri dish with SCM under a dissecting microscope.\nUse a cotton swab to gently wipe the tissue chopper blade and cutting stage with 70% ethanol.",
    "Using the scalpels (blunt side), gently separate the slices under the dissecting microscope. Using a scalpel and spatula, transfer slices to the membrane in the 6 well plate with SCM.\n\tNOTE: The most medial sections will often have the best myelination and tissue integrity. On average, 4–6 slices can be dissected from one mouse brain.\nIncubate slices in SCM at 37 °C in 7.5% CO2.\n4. Culture and media changes (~15–30 min)\nReplace the SCM every other day.\nPipette 1 mL of fresh medium into each well of a new 6 well plate and warm in an incubator. Using sterile forceps, transfer membranes to the new plate, ensuring no bubbles are underneath. Return plates to the incubator.\n5. Standard myelination and remyelination\nStandard myelination protocol (Figure 1B).\n\t\nCulture slices dissected in section 3 from 0–12 days in vitro (DIV). If the effect of any factor on myelination is being tested, add it to the medium at the time of culturing (0 DIV) and replenish it with each media change.\nFix at 12 DIV (step 7.1), a timepoint optimized for incomplete myelination11,12,13. This allows for the detection of any enhancing or blocking effects on myelination due to the factor added to the medium. A representative positive result with the addition of 100 ng/mL Activin A is shown in Figure 2.\nRemyelination protocol (Figure 1C)\n\t\nFollow the standard myelination protocol described in section 5.1 with no additional factors until 14 DIV, the timepoint when the slices are fully myelinated11,12,13.\nPrepare lysolecithin stock (125 mg/mL) as detailed in Table 1. Pipette 1 mL of 0.5% lysolecithin in SCM into each well of a new 6 well plate and warm in an incubator.\nTransfer membranes to a lysolecithin plate and place in an incubator overnight for 16–18 h.",
    "The next day, prepare new plates with fresh SCM, adding any factor(s) being tested for remyelination effects if needed. Warm plates in an incubator.\nFor the media change, gently tap the membrane on the side of the well to ensure all the lysolecithin medium is removed. Replenish the factor(s) being tested at each media change (section 4).\nFix slices at 28 DIV (step 7.1), a timepoint optimized for incomplete remyelination. This allows for the detection of enhancement or blocking of remyelination due to the factor added to the medium. A representative positive result with the addition of 0.1 µM XAV939 is presented in Figure 3.\n6. Variations to the myelination and remyelination protocol\nHypoxia-induced hypomyelination protocol (Figure 1D)11,13.\n\tNOTE: This is presented as a variation of the standard myelination protocol presented in section 5.1.\n\t\nPlate slices in SCM without factors.\nTransfer slice plates to a hypoxic incubator (2% FiO2) for 24 h between 2–3 DIV.\nThe next day, prepare new plates with fresh SCM, adding any factor(s) being tested for myelination potential if needed. Warm plates in an incubator.\nFollowing culture in hypoxia, change medium (section 4) and return cultures to a standard culture incubator (37 °C, 7.5% CO2). Replenish any factors being tested with each subsequent media change (section 4).\nFix at 12 DIV (step 7.1).\nGenetic manipulation protocol (Figure 1E)13\nIsolate tissue from transgenic mice for dissection as in section 3.\nWith inducible transgenic mouse lines, tamoxifen (100 nM, a dose that does not induce myelination or OPC differentiation) or an Ad-Cre adenovirus can be added to SCM during media changes done at 1 DIV and 3 DIV.\nFollowing the genetic manipulation with tamoxifen or Ad-Cre adenovirus, continue media changes every other day as in section 4 (with factors added if needed).",
    "NOTES: All slices from one mouse will fit on one membrane, allowing for genotyping after dissection, thus making it simple to do experiments with transgenic mice.\n7. Tissue processing and analysis\nFix slices by submerging the membrane gently in 4% paraformaldehyde for 1 h at room temperature (RT).\nRinse gently by submerging in phosphate buffered saline (PBS). Then, submerge in PBS in a 6 well plate.\n\tNOTE: The protocol can be paused here. Fixed slices can be stored in PBS at 4 °C for up to a month. If not storing slices, rinse 2x in PBS for 5 min before proceeding.\nUse a scalpel to cut out the membrane from the ring and proceed with staining in a 6 well plate. Be sure to keep slices facing up (membrane-side down) for staining and subsequent mounting on slides.\nBlock for 1 h at RT in block solution (3% heat-inactivated horse serum, 2% bovine serum albumin, and 0.25% Triton-X 100 diluted in PBS).\n\tNOTE: If antigen retrieval is needed for antibody staining (e.g., CC1/Olig2), this can be done in glass Petri dishes.\nWrap plates in paraffin film and incubate overnight at 4 °C in primary antibody diluted in blocking solution.\nWash 3x in blocking solution: 1) brief rinse, 2) 15 min wash, and 3) 1 h wash. For brief rinse, fill a small Petri dish with solution and gently submerge membrane using forceps before transferring to fresh solution. For longer washes (i.e., 15 min and 1 h), submerge membrane in solution in a 6 well plate and place on a gentle rocker.\nIncubate covered from light for 2 h at RT in secondary antibodies diluted 1:500 in PBS.\nWash 3x in PBS: 1) brief rinse, 2) 15 min wash, and 3) 1 h wash.",
    "If DAPI staining is needed, submerge in 1:1,000 DAPI solution for 7 min at RT. Rinse briefly and then wash for 15 min in PBS.\nRinse in double-distilled water.\nMount membranes on a slide with slices facing up (membrane-side down).\n\tNOTE: Mounted slices can be stored at 4 °C. Imaging on a confocal microscope is best done within 1 week, before the membrane becomes opaque and difficult to image.\nImage slices using confocal microscopy and quantify as described previously11,12,13."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}