{
  "id": 7104,
  "origin_website": "Bio",
  "title": "Reverse Phase-high-performance Liquid Chromatography (RP-HPLC) Analysis of Globin Chains from Human Erythroid Cells",
  "procedures": [
    "Sample preparationThe preparation of samples can be performed in a BSL-1 (biosafety level 1) laboratory. However, we recommend to prepare potentially infectious samples under a laminar flow hood in a BSL2 lab. The quality of the chromatograph depends on sample preparation and storage. We recommend to use freshly prepared samples, when possible.Lyphochek Hemoglobin A2 control (Bio-Rad)This product is prepared from human whole blood and contains different forms of hemoglobin (A, A2, F, and S). It is used to generate quality and elution control profiles for each globin chain.Reconstitute the lyophilized product in 500 µl of MilliQ deionized water and let it stand for 10 min, swirling every 3 min.Gently invert the vial several times to obtain a homogeneous solution.Prepare aliquots of 5 μl of the solution mixed with 575 μl of MilliQ deionized water in a 1.5-ml Eppendorf tube.Store aliquots at -80 °C for long term-use.Thaw at RT a new aliquot for each HPLC run. After ~10 min, vortex and keep the aliquot on ice.Dilute 1:10 with ice-cold MilliQ deionized water.Put 50 μl of the diluted control in an HPLC loading tube.Storage: The solution is stable at -80 °C for long-term use and stable at 4 °C for 7 d.Whole bloodCentrifuge 100 μl of blood 5 min at 300 x g in a 1.5-ml Eppendorf tube.Discard the supernatant.Add 900 μl of ice-cold MilliQ deionized water to the RBC pellet.Vortex the samples in order to favor RBC lysis.Centrifuge 10 min at 9,500 x g 4 °C.Collect the supernatant and dilute 1:100 in ice-cold MilliQ deionized water in an HPLC loading tube.Storage: RBC pellets can be stored at 4 °C for 7 d for short-term use or at -80 °C for long-term use.In vitro differentiated RBCs (from 250,000 to 1,000,000 cells) and BFU-E (from 20 to 50 colonies).",
    "This protocol requires a minimal number of 250,000 in vitro differentiated RBCs or 20 BFU-E to obtain evaluable HPLC peaks.Resuspend pellet in 50 μl of ice-cold MilliQ deionized water in a 1.5-ml Eppendorf tube.Vortex samples in order to favor RBC lysis.Centrifuge 10 min at 9,500 x g 4 °C.Put 40 μl of the lysate in an HPLC loading tube.Storage: Lysed differentiated RBCs or BFU-E can be stored at 4 °C for 7 d for short-term use or at -80 °C for long-term use.Mobile phase preparationThe preparation of the mobile phases must be performed under a chemical fume hood. Mobile phases are composed by HPLC grade acetonitrile (ACN), creating a hydrophobic environment and Trifluoroacetic acid (TFA) that breaks the heme group within the Hb tetramers, releasing each globin chain:Solution A: 5% ACN, 0.1% TFA in MilliQ deionized waterSolution B: 95% ACN, 0.1% TFA in MilliQ deionized waterNote: Percentage indicates the volume percent (v/v %). The protocol for the preparation of the mobile phase is reported in the paragraph “Recipes”. HPLC: cleaning procedureBefore each run, rinse the LC column using the following procedure:Put in the two solution reservoirs 100% MilliQ deionizedwater and 100% ACN, respectively.Rinse the column using a slow gradient (1-2%/min) from 5% to 95% ACN and back to 5% ACN.HPLC: acquisition procedurePut solution A and solution B in the two solvent reservoirs.Put the HPLC tubes samples in the tray of the sub-unit SIL-30AC.Check that the four components of the HPLC machine (LC-30AD; SIL-30AC, CTO-20A, SPD-20AV) are correctly switched on.Open the Labsolutions software, select “Instruments” from the menu bar, and double-click on the Instrument logo (Figure 1A).Click on the Main assistant menu bar on the left and select “Realtime batch” to open the Realtime Batch window (Figure 1B).",
    "Complete the Realtime Batch table by filling one line for each sample (Figure 1C):Vial#: Select the number corresponding to the position of the sample in the tray of the HPLC sub-unit SIL30AC. The first 2 samples to be injected will be “blanks” (samples containing the solution without the analytes of interest) to place the chromatograph baseline. For blanks, there is no need to prepare HPLC tubes containing only the mobile phase: by selecting -1 as Vial#, only the mobile phase will be injected directly from the solution reservoir.Tray name: Select 0 for blanks and 1 for the other samples.Sample name: Write the name of each sample.Sample type: Select “0:Unknown” for all the samples.Method file: Select the .lcm file containing the method for globin chain detection. Apply a flow rate of 1.0 ml/min with a gradient of solution A and solution B (increasing over time the hydrophobicity) following the parameters reported in Table 1.Table 1. RP-HPLC gradient scheme for globin chains analysis. The gradient is designed with a high percentage of solution A at the beginning and ends with 100% of solution B percentage (74-82 min) at a flow rate of 1.0 ml/min. The acquisition lasts 95 min per sample. 57.5 ml of solution A and 37 ml of solution B are used per sample, therefore a larger amount of solution A compared to solution B should be prepared.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210117/20210117220655_7666.jpgData file: Select (Auto Filename), the file containing the data will be automatically saved.Level#: Select 0 for all the samples.Injection volume: Write the volume (μl) that needs to be injected. Inject 5 μl for blanks and 35 μl for the remaining samples.",
    "Injection of 35 μl is optimal for the Lyphochek Hemoglobin A2 control and for extracts prepared as described above from whole blood, from 500,000 in vitro differentiated RBCs and from 25 BFU-E. If a different volume of whole blood or a different number of RBCs or BFU-E is used, reduce or increase the injection volume (from 1 µl to 45 µl).Report output: tick the box to automatically print out the analysis report. It is not necessary to tick the box if you manually export the data (as described below).Select from the menu bar “Save Batch File as” to save the file in a dedicated folder in the computer and enter the .lcb file name (Figure 1D).Start the acquisition by selecting “Start Realtime Batch” from the Main assistant menu bar (Figure 1E). The acquisition lasts 95 min for each sample.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3899/bioprotoc-11-02-3899-g001.jpgFigure 1. Flow chart describing the steps of the RP-HPLC acquisition procedure using the LabSolutions software"
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}