{
  "id": 8876,
  "origin_website": "Jove",
  "title": "Fabrication of Fine Electrodes on the Tip of Hypodermic Needle Using Photoresist Spray Coating and Flexible Photomask for Biomedical Applications",
  "procedures": [
    "1. Electrical Insulation of Hypodermic Needle\nNOTE: A transparent heat shrink tube (HST) is employed for the electrical insulation of a hypodermic needle that is 720 µm in diameter and 32 mm in length. The HST is made of polyethylene terephthalate (PET), which shows good chemical resistance to most acids and bases, excellent mechanical durability, and biocompatibility. The initial inner diameter and wall thickness of the HST are 840 µm and 25 µm, respectively. The diameter of the HST tends to be reduced by more than 50% at a temperature of 100 °C, with even greater reduction at higher temperatures up to 190 °C. Note that PET HST is a thermosetting material that has the property of becoming permanently hard and rigid when cured. The size of the hypodermic needle and shrink tube can be adjusted depending on the research purpose and applications. The overall fabrication process is graphically summarized in Figure 1.\nCut the HST to a length of 3 cm. Adjust the length of the tube depending on the penetration depth of the hypodermic needle.\nInsert the hypodermic needle into the cut HST.\nShrink the tube using a heat gun at a temperature of 150 °C, which is set to prevent unwanted additional contraction when dehydration is carried out at 105 °C in the cleaning process (in step 1.6).\nSeparate the hypodermic needle from its hub.\nClean the hypodermic needle insulated by the HST in a deionized (DI) water bath (20 °C) with ultrasonic agitation at 30 kHz and 350 W power.\nDehydrate the hypodermic needle insulated by the HST on a hotplate at 105 °C for 10 min.\n2. Au Deposition Using Sputtering",
    "NOTE: In this study, the sputtering process that is available is used to deposit an Au layer for electrodes, although an e-beam evaporation process can be an alternative method. It has been confirmed that the temperature rise induced in the sputtering process rarely causes additional shrinkage of the HST. However, a process that continues for more than several minutes might heat the HST above the initial shrinkage temperature. This can cause additional shrinkage of the HST, resulting in an increase in the fabrication margin from the tip.\nArrange the cleaned hypodermic needles insulated by the HST side by side on a glass slide using double-sided tape for Cr/Au deposition.\nUsing sputtering equipment, deposit Cr/Au on the cleaned hypodermic needles insulated by the HST.\n\tNOTE: In this case, the thicknesses of Cr and Au were 10 nm and 100 nm, respectively (Cr was used for the adhesion layer between the HST and the Au layer).\n\t\nArrange as many needles as possible in order to reduce production cost and production time. Use the sputtering conditions below to deposit 10 nm Cr and 100 nm Au.\nFor Cr sputtering, set Cr target diameter: 4 inch, RF power: 300 W, argon pressure: 5 mTorr, and shutter open time: 20 s (10 nm).\nFor Au sputtering, use Au target diameter: 4 inch, DC power: 300 W, argon pressure: 10 mTorr, and shutter open time: 80 s (100 nm).\n3. Spray Coating\nNOTE: A low-viscosity (14 cp) photoresist is used in the spray coating process to increase spray efficiency. The photoresist can be easily coated on the Au-sputtered needle only when the needle is heated.\nFix one of the Au-sputtered hypodermic needles on a glass slide using double-sided tape.",
    "Place the slide glass on a chuck of the spray coater that is being heated at 100 °C. Wait 2 - 3 min until the needle is sufficiently heated.\nSpray the photoresist on the Au-sputtered needle while heating the needle at 100 °C. Perform the spray-coating process using the following conditions. Set nozzle diameter: 400 µm, nozzle moving speed: 70 mm/s, spray pressure: 500 kPa, and distance between chuck and nozzle: 13.5 cm.\nAfter spray coating is finished, leave the glass slide on the chuck at 100 °C for 3 min to perform a soft baking process.\nInspect the result using a microscope set to 100X magnification to determine whether the photoresist is uniformly coated on the Au-sputtered needle.\n4. UV Exposure and Developing\nNOTE: In general, prior to UV exposure, a flexible film photomask is attached to a flat transparent plate to remove the air gap between the photomask and the sample to be exposed to UV light. However, in this study, the photomask is used without the flat transparent plate to realize direct metal patterning on the curved surface of the hypodermic needle. The photomask can conformably bent along the curve of the hypodermic needle to achieve the best patterning resolution feasible with the contact aligner. The bending allows the flexible photomask to keep the contact area between the photomask and the curved surface of the hypodermic needle as large as possible. Taking a wet etching process (not a lift-off process) for metal patterning into consideration, the use of a positive photoresist is more advantageous than the use of a negative photoresist. This is because the entire area except the electrode pattern is transparent, thereby providing a wide field of view to readily align the electrode pattern with the center of the needle.",
    "To minimize wedge error, slowly lift a freely movable sample-holding plate until it fully contacts the fixed photomask-holding plate. Then, fix the sample-holding plate using a pneumatic pump.\nCarry out this process to possibly avoid undesirable patterns, which may be formed by the scattering of UV light in the air gap, and caused by the incomplete contact between the sample and photomask.\n\t\tNOTE: In addition, the minimization of wedge error ensures that the photoresist-coated hypodermic needle does not move when it contacts a film photomask in the next alignment step, even though the contact surface of the hypodermic needle has a round shape.\nPlace the photoresist-coated hypodermic needle on the sample-holding plate of the aligner.\nAlign the projected image of the photoresist-coated hypodermic needle with the alignment pattern of the film photomask.\n\tNOTE: In this case, the alignment pattern of the film photomask was designed as two parallel lines at a distance of 800 µm, considering the thickness of the HST and coated photoresist.\n\t\nAlign two boundary lines of the projected image with two parallel alignment lines of the photomask (Figure 1e); thus, the photoresist-coated hypodermic needle can be positioned at the center of two parallel alignment lines, with an alignment error of 10 µm or less.\nMonitor the alignment process in real-time through the display monitor connected to the charge-coupled device (CCD) camera and microscope.\nBring the photoresist-coated hypodermic needle into contact with the fixed flexible photomask by slowly lifting the needle towards the photomask.\nCarry out UV exposure for 30 s (UV intensity: 15 mJ/cm2) and follow this by the developing process for 3 min.\nRinse the developer out of the sample using DI water.",
    "Inspect the result through a microscope set to 200X magnification to determine whether the photoresist is clearly patterned on the Au-sputtered hypodermic needle. If the exposed photoresist is not perfectly removed after the developing process, repeat the developing process at 30 s intervals.\n5. Cr/Au Wet Etching\nCAUTION: Avoid skin/eye contact with the Cr and Au wet etchants.\nUse a tweezer to detach the sample (photoresist-patterned hypodermic needle) fixed on the glass slide.\nImmerse the sample into the Au wet etchant for 1 min.\nRinse the Au etchant out of the sample using DI water.\nInspect the result through a microscope set to 200X magnification. If the gold to be removed still remains, repeat the wet etching process at 10 s intervals. Excessively long wet etching time makes the interdigitated electrode (IDE) thinner.\nImmerse the sample into the Cr etchant for 30 s.\nRinse the Cr etchant out of the sample using DI water.\n6. Removal of Residual Photoresist and Passivation\nImmerse the sample (metal-patterned hypodermic needle) into an acetone solution for 1 min.\nRinse the sample with DI water and dehydrate it on a hot plate at 105 °C for 10 min.\nFor electrical passivation of the connection lines, cut the shrink tube so that it is 2 - 3 mm longer than the electrode (20 mm, the maximum depth to penetrate), as shown in Figure 2, because the length of the HST will be reduced after the HST shrinks.\nAfter positioning the HST as far as possible from the end of the IDE, raise the temperature of the HST using a heat gun at 150 °C to tightly passivate the needle.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}