{
  "id": 17737,
  "origin_website": "Jove",
  "title": "An Image Guided Transapical Mitral Valve Leaflet Puncture Model of Controlled Volume Overload from Mitral Regurgitation in the Rat",
  "procedures": [
    "Procedures were approved by the Animal Care and Use Program at Emory University under the protocol number EM63Rr, approval date 06/06/2017.\n1. Pre-surgical preparation\nSteam sterilize surgical instruments prior to the procedure.\nOn the procedure day, transfer rats from housing to surgery, and weigh them.\nDraw pre-operative and post-operative drugs according to the weight: two doses of Carprofen (2.5 mg/kg each), one dose of Gentamycin (6 mg/kg), and one dose of Buprenorphine (0.02 mg/kg).\nEnsure adequate volume of isoflurane in the gas mixer, and oxygen in the tanks are available for the surgery. One full tank of oxygen (24 ft3) is often adequate.\n2. Animal preparation\nNOTE: Adult Sprague-Dawley male rats weighing 350-400 g were used in this study. The surgical techniques are amenable to slightly smaller or larger animals, if desired.\nSedate the rat in an induction chamber with 5% isoflurane mixed in 1 LPM (liter per minute) of 100% oxygen. Determine adequate level of sedation from a slower respiratory rate under visual observation, and loss of twitch upon pinching the rat's toe.\nIntubate the rat with a 16 G angiocath, fitted for use as an endotracheal tube.\n\t\nVisualize the trachea and vocal cords using an otoscope, and use a cotton tip applicator to clear pharyngeal secretions.\nIntroduce the endotracheal tube on a 0.034-inch guidewire, into the vocal cords. Once the tube is appropriately placed in the trachea, push the tube inwards and withdraw the wire (Figure1).\nPlace the rat on the heated surgical pad maintained at 37 °C and connect the endotracheal tube to a mechanical ventilator. Input the weight of the rat into the ventilator control software, which calculates the ventilation rate and tidal volume. 66 breaths per minute with a tidal volume of 1 mL/100 g body weight were used in this study (Figure 1D).",
    "Use 100% oxygen (1 LPM) mixed with 2-2.5% isoflurane as inhalant anesthetic and confirm the level of anesthesia with loss of jaw tone and loss of response to toe pinch.\nNote that if properly intubated, chest motion should synchronize with the ventilator.\nIf improperly intubated, chest motion will not synchronize with the ventilator. To test for improper intubation, compress the abdomen of rat, which creates backpressure on the ventilator, generating an over-pressure alarm. In this scenario, retract the angiocath gently, and return the rat to the induction chamber with 5% isoflurane for few minutes to ensure the rat is sufficiently anesthetized and re-intubate the rat.\nOnce properly intubated, secure the endotracheal tube by suturing the proximal end of the tube to the cheek of the rat with a 4-0 silk suture to avoid extubation during the procedure.\nInsert a rectal temperature probe to monitor body temperature, and a four-terminal electrocardiogram to monitor ECG during the entire procedure.\n\t\nUse an overhead heating lamp if heat from the surgical platform is insufficient. Turn off lamp if body temperature rises above 37 °C.\nVisually assess the electrocardiogram for any arrhythmias or signs of myocardial ischemia. If none are present, record the baseline electrocardiogram.\nPerform transthoracic echocardiography (TTE) for baseline cardiac function (Figure 2A).\n\t\nTurn the rat to a supine position and shave the left side of the thorax. To obtain clear echo views, remove hair using a depilatory cream.\nUse any ultrasound system with adequate frequency for high heart rate imaging. In this study we used the Visualsonics 2100 system with a 21 MHz probe, which is appropriate for cardiac imaging in rats.\nObtain B-mode images in the parasternal long-axis plane, to calculate the left ventricular volumes. In the same plane, obtain M-mode images to measure wall dimensions.",
    "Turn the probe by 90°, and obtain B-mode and M-mode parasternal short-axis views at the mid-papillary level to measure cross-sectional wall dimensions.\nPerform transesophageal echocardiography (TEE) for baseline imaging (Figure 2B).\n\t\nPlace the rat in the right decubitus position and insert an 8 Fr intracardiac ultrasound probe (8 MHz) into the esophagus of the rat with a small amount of gel applied to the tip. The frequency of the ICE (intracardiac echocardiography) probe is sufficient to obtain 4-6 frames per heartbeat, which are adequate to visualize the valve motion.\n\t\tNOTE: A GE Vivid I or Siemens SC2000 prime system can be used for ICE imaging.\nObtain a high esophageal view to obtain a two-chamber view of the left side of the heart. This view is ideal to visualize the left atrium, mitral valve, and left ventricle. Position the probe such that anterior and posterior leaflets are visualized and coaptation is central. This angle also allows Doppler measurements across the mitral valve, without angle correction.\nMeasure left atrial area and mitral valve annulus dimensions in this view.\nPerform color Doppler imaging to confirm valve competence and lack of MR at baseline. Perform pulsed wave and continuous wave Doppler imaging to quantify mitral inflow and confirm lack of regurgitant flow.\nPerform B-mode and pulsed wave Doppler imaging of the aorta to measure the aortic root diameter and calculate aortic flow.\nPerform pulsed wave Doppler imaging of the pulmonary vein to measure pulmonary venous flow.\nInject a single dose of Carprofen (2.5 mg/kg, SQ, non-steroidal anti-inflammatory), Gentamycin (6 mg/kg, SQ, antibiotic), and sterile saline (1 mL, SQ) to pre-emptively compensate for blood loss during the procedure.",
    "Shave the left side of the thorax as needed to remove any remaining hair from the surgical field. Shaving from the lower neck region to the xyphoid, and from the left arm down to the mid-sternum should be sufficient to ensure a field that is devoid of hair and reduce the risk of surgical site contamination.\nScrub the surgical area with a gauze soaked in Betadine, followed by a gauze soaked in 70% ethanol. Scrub the area in circular motions on the skin, such that the gauze does not contact a previously scrubbed area.\nRepeat this step three times to achieve an adequately sterile field for surgery.\nDrape the animal with sterile covers, opening a window to access the sterile surgical area.\n3. Left thoracotomy\nPerform the entire surgical procedure using aseptic techniques, with isoflurane maintained at 2-2.5% in 1 LPM of oxygen. Place all the instruments in a sterile tray, and place back in the tray after each use.\nWear sterile gloves, a mask and a surgical cap by the surgeon for the entire procedure. A sterile surgical gown may be worn as well, but it is optional unless contamination is expected.\nUse a surgical scalpel with a No #15 blade to make a skin incision on the left side of the thorax, approximately 1 cm proximal to the xyphoid. Use a blunted dissecting tip scissors to separate the skin layer from the muscle layer and make a longitudinal incision.\nDissect the muscle layers in the same manner until the ribs are exposed.\nCarefully make a 2-3 cm longitudinal incision in the fifth intercostal space, adequate to insert retractors and expose the heart.",
    "Use fine tipped forceps to lift the pericardium, and micro scissors to excise it in the region surrounding the apex of the heart. This step helps to avoid post-surgical adhesions of the heart to the chest walls and diaphragm.\n\tNOTE: Avoid surgical incisions close to the sternum to minimize bleeding. Transecting the internal mammary arteries that run along the sternum, may cause excessive bleeding. If encountered with such bleeding, identify the bleeder and cauterize it.\n4. Echo guided MR procedure (Figure 3 & Figure 4)\nUse a 6-0 prolene suture and a microneedle holder, to place a purse string suture on the apex of the left ventricle. If required, use micro forceps to stabilize the heart.\nGently tether the apical suture to stabilize the apex and insert a 23 G needle (flushed with saline, and with a stopcock at its distal end) in the center of the purse string suture, into the left ventricular cavity.\nUse one hand to stably hold and guide the needle, and the other hand to simultaneously manipulate the transesophageal echo probe to achieve an optimal echo view to visualize the needle, as described above.\nWith real time ultrasound guidance, advance the needle toward the ventricular side of the anterior mitral leaflet. Once the needle position is confirmed on ultrasound, advance the needle in one fine motion through the valve leaflet. If a resistance is felt, twist the needle as it is advanced into the leaflet to perforate it.\n\tNOTE: Advancing the needle too far into the left atrium could result in left atrial perforation, causing excessive bleeding and animal death. The needle should be visualized on ultrasound at all times.\nRetract the needle into the left ventricular chamber, away from the mitral valve, and confirm MR by turning on color Doppler imaging.",
    "If MR is not seen on color Doppler imaging, repeat steps 4.4 and 4.5. Adjust the echo probe if required to obtain a better view. After practice in few rats, it is possible to induce a leaflet puncture in one motion of the needle, inducing a hole that is the size of the outer diameter of the needle. This was confirmed after necropsy of the rat hearts.\nOnce MR is confirmed, retract the needle out of the left ventricular cavity and gently tie the purse string suture.\nUse a sterile gauze to soak any blood on the apex and in the thoracic cavity.\n\tNOTE: Touching the echo probe with the surgical gloves may result in contamination of the sterile environment. Spray your gloves with 70% ethanol or replace the gloves with new ones, appropriately.\n5. Animal recovery and post-operative care\nAfter 5-10 minutes of stable cardiac function (normal ECG and heart rate), close the thoracotomy in layers with 4-0 vicryl, while reducing isoflurane in steps.\nUse an interrupted suture to approximate the ribs, with isoflurane maintained at 2%. Insert a chest tube into the sixth intercostal space and secure it to the sterile drapes to avoid inadvertent advancement of the tube into the thoracic cavity.\nUse a continuous suture to close the muscle layer with isoflurane maintained at 1.5%.\nUse a continuous suture to close the skin layer with isoflurane maintained at 1%.\nConnect a 10 mL Luer-lock valve tipped syringe to the chest tube and drain 10-12 mL of air from the chest cavity and then remove the chest tube.\nAdminister a final dose of Carprofen (2.5 mg/kg, SQ) and turn off isoflurane.",
    "Continue mechanical ventilation while rat weans from anesthesia, monitoring vital signs (SpO2 and heart rate). At the onset of spontaneous breathing, turn off ventilation to test the ability of the rat to maintain such breathing and good SpO2.\nIf SpO2 levels start to fall below 90%, turn on the ventilator. Once the rat is able to maintain SpO2 levels without ventilation, the anchoring suture to the endotracheal tube is cut, and the animal is prepared for extubation.\nOnce the rat shows signs of alertness including whisker or eye movements, extubate the animal.\nPlace a nose cone with 100% oxygen until the rat is ambulatory.\nTransfer rat to a clean cage with minimal bedding and continue to monitor vital signs using a handheld SpO2 monitor, placed on the rat's foot or tail, until rat is ambulatory.\n\tNOTE:  If adverse effects from the surgery are observed, animals may have a longer recovery time and may take longer to hold high SpO2 levels. If this occurs, a nose cone with 100% oxygen can be applied until SpO2 levels are stable.  \nTo reduce the risk of injury to the surgical site and avoid the risk of infection, single house rats after surgery.\nAdminister Buprenorphine within 3 h after the rat is awake and sufficiently ambulatory. Buprenorphine may cause respiratory distress when administered early in the perioperative recovery period, thus delay it until the rat is breathing without difficulty.\nAfter surgery, all animals receive the following medications: gentamicin (6 mg/kg, SQ, SID POD 1-3) and rimadyl (5 mg/kg, SQ, SID POD 1-3). All animals are observed once daily for five days after surgery for examination of incision sites, and once daily for the first two weeks after surgery for pain assessment. \n6. Validation of MR severity with echocardiography (Figure 5)",
    "Repeat TEE at two weeks after surgery, using the same steps specified in section 2.7. Two weeks post-surgery is adequate time for the hemodynamics to stabilize.\nObtain color Doppler imaging on a 2-chamber view using transesophageal ultrasound imaging, visualizing the left ventricle and left atrium. Measure the area of the left atrium and MR jet. Calculate the MR jet area fraction using\nimgsrc://cloudfront.jove.com/files/ftp_upload/61029/61029eq1.jpg (1)\n\tSevere MR is defined as MR jet area ≥ 30%.\nApproximate the area of the regurgitant orifice by calculating the area of 23 G needle, using the outer diameter of the needle. This equation assumes that the area of the regurgitant orifice is equal to the area of the 23G needle.\nimgsrc://cloudfront.jove.com/files/ftp_upload/61029/61029eq2.jpg (2)\nObtain continuous-wave Doppler imaging with the Doppler gate at the orifice of the regurgitant jet. Trace the waveform to compute VTI of the regurgitant jet. MR volume can be estimated using\nimgsrc://cloudfront.jove.com/files/ftp_upload/61029/61029eq3.jpg (3)\n\tSevere MR is defined as MR volume ≥ 95 µL.\nObtain pulse wave Doppler imaging of the pulmonary vein by rotating the echo probe laterally, clockwise. Measure the systolic and diastolic wave velocities and use the following equation to calculate the ratio.\nimgsrc://cloudfront.jove.com/files/ftp_upload/61029/61029eq4a.jpg (4)\n\tA negative pulmonary flow ratio indicates severe MR.\n7. Sham surgery\nPerform sections 1-3 as described.\nModify section 4 was modified such that the 23 G needle is inserted into the left ventricular chamber, through a purse string suture on the left ventricular apex, but not advanced into the mitral valve to create MR. Insert the needle into the left ventricular chamber and retract immediately, following by tightening and closure of the ventricular apex.\nPerform section 5 as described.\nPerform mitral valve assessment as described in section 6. However, MR should not be present in any of the animals, thus quantification as described is not necessary.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}