{
  "id": 3018,
  "origin_website": "Cell",
  "title": "An optimized protocol to detect protein ubiquitination and activation by ubiquitination assay in vivo and CCK-8 assay",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nSeeding and transfection cells\nTiming: 1 h (Seeding), 8 h (transfection)\nThe following steps describe the detailed procedure to seed cells, and to efficiently transfect His-Ub and Flag-FBXO45 plasmids with HA-IGF2BP1, HA-IGF2BP1 (K190A), or HA-IGF2BP1 (K450A) plasmids by using Lipofectamine® 2000 Reagent.\nSeed cells 16–18 h before transfection.\nFollow the “before you begin[href=https://www.wicell.org#before-you-begin]” step 5 to seed cells.\nSeed HEK293T cells into 10 cm dishes with 60% confluent for ubiquitination assay.\nTransfect with plasmids in the next morning.\nCell morphology and density are observed under a microscope. Once the cells are 70% confluent, transfect them with the indicated plasmids.\nAdd pre-warmed 500 μL Opti-MEM in the tube A and tube B. Add indicated plasmids (Amount of plasmids refer to Table1[href=https://www.wicell.org#tbl1] ) in tube A and mix well. Add 30 μL Lipofectamine® Reagent in tube B and mix gently.\ntable:files/protocols_protocol_2561_14.csv\nAdd diluted DNA of tube A to tube B and incubate DNA-lipid complex at 20°C–25°C for 5 min.\nAdd the mixture dropwise to cells. Change to complete culture medium after 6-8 h transfection.\nAfter 72 h transfection, cells are harvested for ubiquitination in vivo assay (see troubleshooting 1[href=https://www.wicell.org#sec6.1], 2[href=https://www.wicell.org#sec6.3]).\nAssay for protein ubiquitination in vivo\nTiming: 3 days\nF-box/SPRY domain-containing protein 1 (FBXO45) is an atypical E3 ubiquitin ligase,8[href=https://www.wicell.org#bib8] and is critical in the UPS for specific proteins degradation, such as PAR4 (prostate apoptosis response protein 4),9[href=https://www.wicell.org#bib9] p73,10[href=https://www.wicell.org#bib10] and ZEB1.11[href=https://www.wicell.org#bib11] Here, the following steps describe the detailed procedure to determine IGF2BP1 as a novel substrate of FBXO45. IGF2BP1 can be polyubiquitinated in an in vivo system containing FBXO45(E3), HA-IGF2BP1 (substrate), and His-Ub in HEK293T cells. Proteins were separated by SDS-PAGE, and ubiquitinated IGF2BP1 was detected by HA antibody.\nMG132 treatment.\nAdd MG132 at final concentration of 10 μM, mix gently.",
    "Incubate the dishes in a 37°C incubator for 3–4 h to block protein degradation before cell collection.\nCell collection, cell lysis and Ni-NTA beads pull down.\nBefore starting, pre-warm a water bath/heat block to 100°C.\nWash the cells twice with 5 mL of ice-cold 1XPBS.\nScrape cells off using a plastic scraper and transfer them into 1.5 mL EP tubes.\nNote: One portion of cells are used as Whole Cell Extract group. The other are used for ubiquitination group.\nCentrifuge at 900 × g for 5 min at 4°C. Discard the supernatant and place the cell pellets on the ice.\nFor the Whole Cell Extract group, add 200 μL RIPA buffer on ice for 15 min and centrifuge at 14,000 × g for 10 min at 4°C.\nMeasure the concentration of proteins with a BCA protein assay kit (Beyotime, China).\nMix 20–30 μg protein from each sample with 2× loading buffer and boil for 10–15 min at 100°C.\nStore whole extract proteins at −20°C until use.\nFor the ubiquitination group, add 1 mL ice-cold lysis buffer A1 to the pellet and pipette the mixture up and down to lyse the cells (see troubleshooting 3[href=https://www.wicell.org#sec6.5]). Incubate lysis solution on the ice for 30 min.\nNote: This step is considerably critical. It is important to ensure cells completely lysis. If the cells are still viscous after blowing, Ultrasonic Homogenizer (SCIENTZ, China) can be used to disrupt the cells continually.\nAdd 50 μL Ni-NTA beads (Qiagen, Germany) to each sample. Incubate and shake the mixture gently at 2–8°C for 16 h.\nNote: Resuspend the bead slurry by vortexing or mixing before use.\nPerform in vivo assay of protein ubiquitination.\nCentrifuge the beads at 600 × g for 5 min at 4°C.",
    "Discard the supernatant, the beads-protein complex is then washed as above (a) with buffer A1, B1, C1 and C2, respectively (see troubleshooting 4[href=https://www.wicell.org#sec6.7]).\nNote: To reduce the loss of beads during the washing steps, we recommend to aspirate most of the supernatant with the pipette along the wall of the tube, and keep 50 μL of liquid at the bottom of the 1.5 mL tube.\nAfter washing, the His∗6-tagged ubiquitinated proteins are eluted with 50 μL 1× elution buffer.\nBoil for 5 min at 100°C, and centrifuge at 16,000 × g at 20–25°C for 1–2 min to collect solution, then store at −20°C freezer for ubiquitination analysis using Western blot.\nPause point: After sample boiling, whole cell extract proteins (step 4e) and ubiquitination proteins (step 5d) can be stored at −20°C until SDS-PAGE.\nPrepare SDS-PAGE gels.\nPrepare the separation gel (10%). Mix in the following order as above. Pour gel, leaving ∼2 cm below the bottom of the comb for the stacking gel. Make sure to remove bubbles.\nLayer the top of the gel with isopropanol to remove bubbles at the top of the gel.\nNote: In ∼30 min, the gel should be completely polymerized.\nRemove the isopropanol and wash out the remaining traces of isopropanol with distilled water.\nPrepare the stacking gel (5 %). Mix in the following order as above. Pour stacking gel on top of the separation gel.\nAdd combs to make wells. In ∼30 min, the stacking gel should become completely polymerized.\nClamp gel into apparatus, and fill buffer chambers with gel running buffer.\nLoad whole extract proteins (∼15–30 μg), ubiquitinated proteins (∼100–150 μg) and molecular mass protein markers into wells for separation by electrophoresis.\nNote: The Western blot loading amounts have to be sufficient for the detection of protein of interest.",
    "Run gel and Protein transfer from gel to membrane[href=https://www.novusbio.com/support/support-by-application/protein-transfer-gel].\nRun the gels at 60–80 V constant voltage for stacking gel (30 min) and then 100–150 V for separating gel (1 h).\nAfter electrophoresis, remove the gel from the electrophoresis apparatus and equilibrate it by soaking in 1× Transfer Buffer for 10 min.\nWhen performing a wet transfer, the gel is first equilibrated in transfer buffer. The gel is then placed in the “transfer sandwich” (filter paper-gel-membrane-filter paper), cushioned by pads and pressed together by a support grid. The detailed procedure can follow Prisco’s protocol step 82.12[href=https://www.wicell.org#bib12]\nRun at 80 V constant voltage for 2 h or at 100 V for 90 min on the ice. Proteins are transferred from gel to PVDF membrane.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2561-Fig2.jpg\nFigure 2. FBXO45 promotes IGF2BP1 polyubiquitination at the Lys190 and Lys450 sites\nIGF2BP1 was polyubiquitylated by FBXO45, and K190 or K450 mutation partly blocked this effect. HEK293T cells were transfected with the indicated plasmids, followed by pull-down using Ni-NTA beads or direct Western blotting with the indicated antibodies. Data is reproduced from Lin et al.1[href=https://www.wicell.org#bib1].\nDetect proteins.\nPrepare blocking buffer (refer to materials and equipment[href=https://www.wicell.org#materials-and-equipment] above) and block the membrane for 1 h at 20–25°C using blocking buffer.\nAdd a primary antibody diluted in 10 mL blocking buffer. Incubate for 16–18 h at 4°C (see troubleshooting 5[href=https://www.wicell.org#sec6.9]).\nAlternatives: Membranes can also be incubated with shaking at 20–25°C for 1 h.\nWash the membranes three times with 1 X TBST buffer at 10 min for each time.\nAdd secondary antibody in 10 mL blocking buffer. Shake gently at 20–25°C for 1 h.\nWash the membranes three times with 1 X TBST buffer at 10 min for each time.",
    "Add developing reagent on the membrane, monitoring development using ChemiDocTM XRS+. Image is analyzed using LabTM Software (Bio-Rad, USA). A typical IGF2BP1 ubiquitination blot is shown in Figure 2[href=https://www.wicell.org#fig2] (see troubleshooting 6[href=https://www.wicell.org#sec6.11]).\nAssay for ubiquitinated protein activation analysis\nTiming: 3 h\nThe following steps describe the procedure to validate whether FBXO45 increased IGF2BP1 activity via polyubiquitination at K190 and K450, the effect of FBXO45 and its mutants on cell proliferation was analyzed by CCK-8 assay.\ntable:files/protocols_protocol_2561_15.csv\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2561-Fig3.jpg\nFigure 3. FBXO45 promotes IGF2BP1 cell proliferation at the Lys190 and Lys450 sites\n(A and B) HepG2 and HCCLM3 cells were co-transfected with indicated plasmids for 48 h, followed by CCK-8 assay. Data are represented as the mean ± SEM, n = 6 (HCCLM3), n = 5 (HepG2), ∗∗p ≤ 0.01, ∗∗∗p ≤ 0.001, ∗∗∗∗p ≤ 0.0001. Data is reproduced from Lin et al.1[href=https://www.wicell.org#bib1].\nCell Proliferation Assay.\nSeed HepG2 and HCCLM3 cells in 96-well plates at a density of 3,000 cells per well in 100 μL fresh DMEM medium for CCK-8 assay.\nTransfect cells with the indicated plasmids (same step as shown in the step 2 section). Dose of plasmids and transfection reagents refer to Table 2[href=https://www.wicell.org#tbl2] for CCK-8 assay.\nAfter 48 h transfection, add 10 μL the CCK-8 solution to each well of 96-well pate.\nNote: Pay attention not to introduce bubbles in the well.\nIncubate the plate in a 37°C incubator for 2–3 h.\nMeasure absorbance at 450 nm using a Microplate Reader (Thermo Scientific, USA). The results of cell proliferation are shown in Figure 3[href=https://www.wicell.org#fig3]."
  ],
  "subjectAreas": [
    "Cell Culture",
    "Cell Biology",
    "Cell-Based Assays",
    "Molecular Biology",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}