{
  "id": 19207,
  "origin_website": "Jove",
  "title": "In vivo Near Infrared Fluorescence (NIRF) Intravascular Molecular Imaging of Inflammatory Plaque, a Multimodal Approach to Imaging of Atherosclerosis",
  "procedures": [
    "In vivo Animal Model: Generation of Experimental AortoIliac Atherosclerosis\n1) Baseline Angiography and Balloon Denudation\nPrior to obtaining baseline angiography and balloon denudation, a New Zealand white rabbit is fed a high cholesterol (1%) diet for 1 week. This animal is utilized for translational relevance as 1) the aorto-iliacs vessels in rabbits are the same caliber as human coronary arteries (2.5-3.5mm) and 2) the hyperlipidemic, balloon-injury model generates inflamed atherosclerosis bearing similar inflammatory cells (macrophages) and molecules (cathepsins) as in human atherosclerosis.\nFollowing cholesterol feeding, the animal is anesthetized with propofol and ketamine. A one-inch ventral midline neck incision is made using using a size 15-scalpel blade. Using blunt dissection techniques, the muscles underneath the fascia on the right side of the trachea is exposed. The left sternocephalicus muscle is separated along its connective tissue junction, and the right common carotid artery is exposed. The artery is separated from the vagus nerve. Proximal and distal suture loops are placed on the artery to allow for retraction and occlusion. A 1 to 2mm beveled arteriotomy is made through which a 5 French (outer diameter 1.67mm) vascular sheath is inserted and heparin (1000μ/mL, ~150units/kg) is administered intra-arterially via the sheath.\nContrast dye (Ultravist) is then injected (1 to 2mL) over a 2 second period to obtain a control angiogram of the distal aorta and both iliac arteries.",
    "The iliofemoral arteries and aorta are then injured by endothelial denudation. Using standard fluoroscopy methods, a 3Fr Fogarty embolectomy catheter is placed in the distal iliofemoral artery and inflated with 0.3 to 0.5 cc of contrast (50% contrast/50% saline) or air. The catheter is then withdrawn proximally in its inflated state a distance along the right iliac and distal aorta up to the take-off of the left renal artery. Following the balloon denudation, angiography is repeated to document vessel patency. Following angiography, all catheters and sheaths are removed and the proximal right common carotid artery is ligated, the muscle and fascia are sutured with a 4/0 absorbable suture, and the skin incision closed with a 4/0 non-absorbable suture.\nThe animal is then allowed to recover with administration of one dose antibiotics (Cephazolin, 0.5 grams IM). Pain medications including 0.01 mg/kg buprenorphine IM (twice a day as needed). Animals are then continued on 1% cholesterol for 4 weeks post-balloon denudation. At week 5, animals are transitioned to 0.3% cholesterol diet.\nIntegrated Multi-modal Imaging of Rabbit Atheromata\n2) Labeling of proteolytically active inflamed plaque using injectable nanosensor; Angiography, intravascular ultrasound (IVUS), and in vivo intravascular NIRF imaging of Rabbit Atheroma\nEight weeks following balloon injury and 24 hours prior to imaging, the rabbit is injected with intravenous 500 nmol/kg Prosense/VM110 (PerkinElmer) via ear vein.\nTwenty-four hours after injection, animals are anesthetized and arterial access is obtained via left common carotid artery (see step 1.2). Intra-arterial heparin is administered (150 units/kg). Baseline angiography is obtained as above.",
    "An IVUS catheter is loaded onto a clinical coronary artery capable 0.014 inch wire and inserted into the sheath. Using fluoroscopic guidance, the radiopaque tip of the wire is positioned distally into the right iliac artery. The IVUS catheter is then advanced into the proximal iliac artery using a standard clinical monorail technique.\nA 100 mm pullback is initiated and images are recorded. Longitudinal reconstruction of the vessel is obtained and luminal plaque is identified.\nThe NIRF catheter11,12 is loaded onto the 0.014 inch wire (monorail system), and the catheter is carefully inserted into the sheath and imaging head is positioned distally into right iliac artery.\nMultiple automated pullbacks (1 mm/sec longitudinal pullback, 30 rounds per minute) are performed and fluorescence signals within zones of atherosclerosis are noted. Images are recorded and further processing with appropriate scaling and windowing based on range of signal is achieved.\n3) Euthanasia and isolation of ex vivo aorto-iliac tissue\nEuthanasia is accomplished with 1cc of euthanasia agent (solution of 390mg sodium pentobarbital and 50mg phenytoin sodium), intravenous, single injection.\nThe arterial tree is perfused with 0.9% normal saline until the inferior vena cava is clear of blood. The atherosclerotic aorta and iliac arteries are identified and dissected free from the surrounding tissues. In addition, small 2 x 2 cm pieces of liver, kidney, spleen and heart are also obtained.\nEx vivo NIRF imaging with the intravascular NIRF imaging catheter can be done at this stage. The vessel is elongated and the NIRF catheter is re-inserted into proximal aorta until the imaging head is positioned at the right iliac artery or bifurcation. Multiple automated pullbacks are performed as above (see 2.6).\n4) Ex vivo Fluorescence Reflectance Imaging (FRI) of dissected aorta and iliac arteries",
    "Dissected tissue is placed in 10-20 cc of normal saline and transported for FRI analyses (Kodak Image Station 4000MM Pro, Carestream Health, Inc.).\nAorta, iliac vessels are elongated to approximate real-time lengths and images are obtained at multiple wavelengths [white light, green fluorescent channel (ex 495 nm, em 515 nm), Cy5 (ex 565 nm, em 670 nm) and Cy7 (ex 650 nm, em 760 nm)] channels. A series of exposure times are utilized for each wavelength (0.1-30sec) and acquired images are exported as DICOM or 16-bit unscaled TIFF files for further analyses. As positive and negative controls, organs (liver, spleen, kidney and heart) are imaged at similar channels and exposure times.\nAreas of increased signal in the near-infrared channel (780nm+) are noted in atherosclerotic arteries.\n5) Tissue Embedding for Sectioning and immunohistochemical analysis\nAreas of normal (non-injured tissue; i.e. left iliac artery) and areas of plaque are identified and small 5-10 mm rings of tissue are embedded in OCT (Optimal Cutting Temperature) media. Blocks are stored at -80 C until sectioning.\nStandard techniques for sectioning and immunohistochemical analyses are performed. Hematoxylin and eosin stain, Ram-11 and Cathepsin B staining are performed.\nAnalyses and Integration of multi-modal Images (Angiography, IVUS, NIRF and FRI)\n6) Processing of NIRF and FRI images\nDICOM files containing imaging data from NIRF and FRI (taken at near infrared 780 nm channel) pullbacks are processed using MATLAB and Osirix software, respectively. Proper windowing to display full range of signal intensity is achieved. Final images are exported as TIFF files.\nFiles are imported into standard image processing software (Keynote can be used). Images are aligned based on reference points (i.e. vertebrae on angiogram, iliac bifurcation, and renal artery). Areas of normal vessel and plaque are identified.",
    "Regions of interest (ROI) are manually traced (for normal tissue and areas of plaque) and mean signal intensities are acquired using Osirix and MATLAB, respectively for both FRI and NIRF images. To guide appropriate tracing, the longitudinal IVUS image of the vessel is used and identification of normal vessel and plaque are easily identified.\nTarget-to background (TBR) ratios are calculated for plaque zones.\nRepresentative Results:\nUpon completion of above protocol, we can identify and characterize areas of augmented cathepsin protease activity in inflammatory plaque within the aorta and iliac vessels. Injection of an activatable nanosensor (Prosense/VM110) allows us to identify proteolytically active plaque. These appear as bright or signal intense zones when imaged using FRI in the near infrared channel (750 nm). The NIRF pullbacks correlate with increased signal intensity by FRI and alignments with IVUS which allow anatomical registration of NIRF signals. Calculated plaque TBR's obtained from FRI and NIRF were similar (see Figure 3: mean NIRF TBR 4.2, mean FRI TBR 2.9). Immunohistochemical analysis of bright plaque confirms intense presence of RAM-11 and Cathepsin B activity in areas of plaque (data not shown).\nimgsrc://cloudfront.jove.com/files/ftp_upload/2257/2257fig1.jpg\nFigure 1. Schematic of 2D NIRF Catheter To extend the clinical potential of a 1D NIRF sensing approach6, we constructed a novel 2-D NIRF-catheter for intravascular imaging.11,12 The custom-built catheter consists of an optical fiber (125 micron diameter housed in polyethylene tubing: 2.9F) that illuminates using a 750 nm laser excitation source. Laser light is emitted at a 90 degree angle relative to fiber axis. The system utilizes two automated motors (rotational and translational) to enable concomitant 360 degree imaging and longitudinal pullback to obtain true 2D imaging. Images used with permission from reference 11.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2257/2257fig2.jpg\nFigure 2. Schematic demonstrating protease-mediated activation of the nanosensor, Prosense/VM110. Image used with permission from reference 10.\n \nimgsrc://cloudfront.jove.com/files/ftp_upload/2257/2257table1.jpg",
    "Figure 3. In vivo and ex vivo Plaque TBRs (target-to background ratios)Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}