{
  "id": 11782,
  "origin_website": "Jove",
  "title": "Somatic Genome-Engineered Mouse Models Using In Vivo Microinjection and Electroporation",
  "procedures": [
    "Animals were housed in static microisolation cages with filter tops, located in a dedicated room containing a type II biosafety cabinet. All animal work was performed in accordance with institutional guidelines and was approved by McGill University's Faculty of Medicine and Health Sciences Animal Care Committee (AUP #7843).\n1. Microinjection needle preparation\nPull a glass capillary tube into a sharp point using a micropipette puller with the following program: P = 500, Heat = 576, PULL = 50, VEL = 80, DEL = 70.\nUsing a pair of tapered ultrafine tip forceps, snip the pointed end of the pulled capillary tube under a dissecting microscope to create an opening, as shown in Figure 1A,B. Make sure that the opening is not too large, as this will damage the oviduct and prevent slow injection.\nimgsrc://cloudfront.jove.com/files/ftp_upload/65131/65131fig01.jpg\nFigure 1: Microinjection needle preparation. (A,B) Pulled capillary tube with a pointed end (A) that was snipped to create an opening (B). Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/65131/65131fig01large.jpg]\n2. Preparing the anesthetic for intraperitoneal injection\nPrepare filtered, diluted avertin on the day of surgery. Avertin (2,2,2-tribromoethanol) stock solution is prepared at a concentration of 1.6 g/mL in tert-amyl alcohol by vigorous stirring and stored in the dark.\nDilute the avertin stock solution with 1.25% v/v isotonic saline to a final concentration of 20 mg/mL inside a fume hood. Vortex the diluted avertin and filter through a 0.22 µm sterile filter. Keep in the dark.\n3. Preparing the surgery area\nThe surgery area should be a dedicated sterile environment, preferably a clean bench or biosafety cabinet. Arrange the sterile surgery equipment, microscope, micromanipulator, and electroporator as needed. An example of this is shown in Figure 2.",
    "Heat up the heating pad/disc and place it underneath a clean, fully equipped cage. This cage will be used to house the mice following the surgery.\nPour sterile 1x phosphate buffered saline (PBS) into a sterile petri dish. Use a pair of clean scissors to cut absorbent paper into squares, with approximate dimensions of 1 cm x 1 cm. Drop these pieces of absorbent paper into the 1x PBS to soak them.\n4. Preparing the solution and needle for injection\nPrepare the injection solution on the day of the surgery. Mix the DNA/RNA/RNPs with filtered trypan blue to a minimum final concentration of 200 ng/µL each and 5%, respectively. Store at room temperature prior to injection.\n\t​NOTE: Use a 1 mL syringe to take up 100% trypan blue and filter through a 0.22 µm sterile filter prior to use.\nAttach the pulled capillary needle, henceforth called a microinjection needle, to the clamp mount micromanipulator stabilized by a magnetic mount (setup shown in Figure 2B).\nPipette 2 µL of the injection solution onto a sterile Petri dish. While observing under the microscope, slowly take up 1-2 µL of this solution into the microinjection needle using the air pressured syringe attached to the micromanipulator. Avoid bubbles/taking up bubbles into the microinjection needle.\nimgsrc://cloudfront.jove.com/files/ftp_upload/65131/65131fig02.jpg\nFigure 2: Surgery area preparation. (A) Surgery area setup inside a clean bench. (B) Dissection microscope and micromanipulator setup for a right-handed individual. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/65131/65131fig02large.jpg]\n5. Exposing the female reproductive tract\nAnesthetize a 6-8-week-old female mouse by administering filtered, diluted avertin (anesthetic) intraperitoneally at a dose of 0.25-0.5 mg/g. Following this, administer carprofen (preemptive analgesic) subcutaneously at a dose of 5 mg/kg.\n\tNOTE: Other alternatives that can be used as an anesthetic are isoflurane or ketamine/xylazine.",
    "Place absorbent paper on a clean, heated pad/disc. Then, place the anesthetized mouse on this heated absorbent paper with the dorsal side facing up. Apply eye lubricant to each eye to prevent drying during the surgery.\n\tNOTE: Confirm that the heating pad/disc is slightly warm to the touch by testing with the back of the hand.\nTest for deep anesthetic arrest by pinching the toe of the anesthetized mouse with a pair of forceps. Remove dorsal fur around the prospective incision site (location shown in Figure 3A) and wipe the bare skin with antiseptic.\nUse a pair of straight blunt forceps to pinch the bare skin and create a 1 cm long incision along the body midline using a pair of sterile sharp blunt scissors. Clean the area around the incision with antiseptic.\nPinch and hold up one side of the cut site using a pair of sterile Adson forceps. Then, using a pair of sterile curved serrated forceps, gently separate the skin from the body wall, starting at the midline incision and moving laterally.\nLocate the fat pad below the kidney. Using a pair of sterile straight blunt forceps, pinch the body wall directly above the fat pad. Create a small incision in the body wall using a pair of sterile sharp-pointed dissecting scissors, taking care to avoid blood vessels.\nWhile still pinching the body wall with straight blunt forceps, insert a pair of sterile blunt curved forceps into the incision and widen the incision created in the body wall.\nGrab the visible fat pad with the blunt curved forceps and pull it out of the hole to expose the ovary, oviduct, and uterus.\nTo keep the reproductive tract exposed, clamp the fat pad with a sterile bulldog clamp, as shown in Figure 3B.",
    "6. In vivo oviduct injection and electroporation\nCarefully place the heated absorbent paper and anesthetized mouse with the reproductive tract exposed on the stage of a dissecting microscope, such that the tract can be observed. An example of the view as observed under the microscope is shown in Figure 3B.\nAdjust the micromanipulator so that the injection needle with solution can also be observed under the microscope.\nUsing a pair of sterile tapered ultrafine tip forceps, hold the region of the oviduct that is to be injected steady. The region to be injected must be in line with the direction of the microinjection needle.\n\tNOTE: Use the bulldog clamp anchoring the fat pad and reproductive tract to gently turn/move the tract to an optimal position, if needed.\nAdjust the micromanipulator to puncture the oviduct with the microinjection needle, while simultaneously feeding the oviduct onto the needle using the tapered ultrafine tip forceps. Gently move the microinjection needle to confirm that it has been inserted into the oviduct.\n\tNOTE: Insert the microinjection needle into a straight segment instead of into a turning point of the coiled oviduct to prevent multiple punctures and leakage of injection solution.\nSlowly inject up to 1 µL of solution into the oviduct, while observing the movement of the blue solution and expansion of the oviduct lumen under the microscope. Take care not to introduce any bubbles into the lumen. Representative images of oviducts injected with 100% trypan blue are shown in Figure 3C,D.\nRemove the needle from the oviduct. Cover the area to be targeted with a piece of absorbent paper presoaked in sterile 1x PBS (from step 3.3).",
    "Grasp the presoaked paper and the area/region to be targeted with a pair of electrode tweezers (1 mm, 3 mm, or 5 mm, depending on the size of the region to be targeted) and pull away from the body, before electroporating using these settings on the pulse generator/electroporator: 30 V, three pulses, 1 s interval, 50 ms pulse length, unipolar.\n\tNOTE: The distance between the electrodes should be set such that the electrodes can clamp onto the targeted region without deforming the oviduct. The recommended distance is around 1 mm.\nAfter electroporation, remove the absorbent paper and place the mouse (with the heated absorbent paper underneath) back onto a heat pad. Unclamp the bulldog clamp and carefully push the exposed reproductive tract back under the body wall. Repeat section 5 to expose the reproductive tract on the other side.\n\tNOTE: Electroporation is successful regardless of the mouse estrous stage as long as the lumen is filled with the solution.\nCover the exposed tract with absorbent paper presoaked in sterile 1x PBS to prevent it from drying out, then prepare the microinjection needle for the second injection by repeating steps 4.2 and 4.3.\n\tNOTE: Replace the microinjection needle as needed. Prevent drying of the exposed tissue by applying sterile 1x PBS when required.\nRepeat the steps above to inject and electroporate the oviduct on the opposing side.\n\t​NOTE: Reapply the eye lubricant as needed during and after the surgery.",
    "After both oviducts have been electroporated and placed back under the body wall, suture or staple the dorsal incision site. For suturing, use a hemostat to grasp the needle of the silk braided sutures (3/8 circle; gauge: 5-0; needle size: 18 mm; thread length: 75 cm). Pinch and hold up one side of the cut site using a pair of sterile curved serrated forceps, then use the hemostat to manipulate the suture to close the wound.\nMove the mouse into a clean cage that is placed on top of a heated pad/disc (from step 3.2) and monitor until the mouse is active.\nAdminister 5 mg/kg carprofen subcutaneously every 24 h for the next 3 days and monitor over the next 10 days.\nimgsrc://cloudfront.jove.com/files/ftp_upload/65131/65131fig03.jpg\nFigure 3: Female reproductive tract exposure and microinjection. (A) Location of midline incision (shown as a yellow line) on the dorsal side of a Rosa-LSLtdTomato mouse. (B) Female reproductive tract exposure. The fat pad was clamped using a sterile bulldog clamp to anchor the tract and keep it exposed. (C,D) Representative images of in vivo oviduct injection. A microinjection needle was inserted into the distal ampulla (labelled AMP), and filtered 100% trypan blue was injected into the oviduct lumen while the tract was exposed (C). Representative image of a dissected oviduct, demonstrating that injected trypan blue solution distributes throughout the distal and proximal oviduct lumen (D). Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/65131/65131fig03large.jpg]"
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}