{
  "id": 6832,
  "origin_website": "Bio",
  "title": "Colorimetric RhoB GTPase Activity Assay",
  "procedures": [
    "Collagen I coating and cell seedingCoat the 6-well plate with 1 ml rat-tail collagen I diluted in PBS (25 µg/ml).Incubate the 6-well plate coated with 1 ml collagen I at 37 °C, for 1 h.Wash the 6-well plate twice with 1 ml PBS and aspirate off PBS buffer.Put 1 x 106 HeLa cells/well in 3 ml DMEM with 10% FBS and Incubate the 6-well plate at 37 °C for at least 24 h.Wash twice with 1 ml PBS, aspirate off and add 3 ml media (0% serum), then incubate overnight at 37 °C.Add HGF at 0.5 nM (or any other growth factor) to stimulate the cells at different times and to measure the kinetics of activation of RhoB.Note: Collagen I and HGF must be kept on ice. Transfected cells with constitutively active form of RhoB (RhoBV14) could be used as positive control and an unstimulated condition for each analytical experiment is needed as a negative control.Cell washingRetrieve culture plate from the incubator, immediately place on ice, aspirate off media, and wash twice cells each with 1 ml ice-cold PBS.Aspirate off all PBS buffer.Cell LysisLyse cells for 15 min in ice-cold cell lysis buffer, 50 μl per well.Harvest cell lysates with a cell scraper.Transfer lysates into pre-chilled 1.5 ml microfuge tubes on ice.Centrifuge cell lysates at 10,000 x g, 4 °C for 10 min.Transfer supernatant (cell lysates fraction) into a new pre-labeled and pre-chilled 1.5 ml microfuge tubes on ice.Note: All these steps must be performed on ice or in a 4 °C cold room.Quantification of total protein concentrationPerform a Bradford protein assay by diluting 2 µl of the cell lysate, the undiluted lysates we obtained by this protocol are typically around 5 µg/µl. Protein solutions are normally assayed in duplicate.Measure absorbance at 595 nm.",
    "Small G-LISA Assay preparationReconstitute all lyophilized components provided in the kit of Small G-LISA Assay, as indicated in Table 2 of the G-LISA Activation Assay Technical Guide.Vortex 15 s for mixing Binding Buffer solutions. Keep on ice.Small G-LISA Assay Protocol (Figure 2)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200428/20200428015024_3388.jpgFigure 2. Colorimetric RhoB GTPase activity assay overview. A. Experimental procedure. Step 1: Seed cells in collagen I coated 6-well plate. Stimulate cells with HGF (or any other growth factors) at different time points. Step 2: Lyse cells with lysis buffer, harvest cell lysates with a cell scraper and transfer cell lysates into pre-chilled microfuge tubes. Quantify the total protein concentration. Step 3: Prepare reagents and incubate cell lysates in a Rho-GTP affinity plate. Step 4: For the colorimetric immunodetection, add RhoB primary antibody, rinse, and add HRP secondary antibody, and rinse. Step 5: To measure the GTPase activity, add HRP detection reagent and read the signal by measuring absorbance at 490 nm using the microplate spectrophotometer. B. Data analyses. Use the Lysis Buffer wells as reference blank. Three replicates of each sample should be made. Read the signal by measuring absorbance at 490 nm using the microplate spectrophotometer. When the data are “Lysis Buffer subtracted”, import them into a simple graph software such as Excel.Prepare the blank buffer by mixing 60 μl lysis buffer with 60 μl ice-cold Binding Buffer and put on ice.Take a number of strips required from Rho plate and place in a strip holder, and then put on ice.Keep the plate on ice and add 100 μl ice-cold water in each well to dissolve the powder coat, covering the bottom of the well. Tap pellets to the bottom of the wells prior to resuspension.Aliquot cell lysate for duplicate (60 μl) or triplicate (90 μl) assays into fresh ice-cold microcentrifuge tubes.",
    "Add an equal volume of ice-cold Binding Buffer to each tube. Vortex each tube for 3-5 s on a high setting and return tubes to ice.Remove completely the water from the microplate wells by flicking it vigorously, followed by a series of 5 pats on paper towels.Return the plate to ice. Immediately add 50 μl of equalized cell lysate to wells.Pipette 50 μl of buffer blank control into duplicate wells.Pipette 50 μl of RhoA positive control into duplicate wells.Immediately place the plate on an orbital microplate shaker (250 rpm) at 4 °C for exactly, 30 min.Dilute anti-RhoB primary antibody to 1/100 in Antibody Dilution Buffer.After 30 min, remove the solution from the wells and wash twice each with 200 μl Wash Buffer at room temperature using a multi-channel pipette. Do not leave the plate unattended at this time. Remove the Wash Buffer completely after each wash as described in Step F6.Pipette immediately 200 µl of room temperature Antigen Presenting Buffer into each well using a multi-channel pipettor and incubate at room temperature for exactly 2 min.Flick out vigorously the Antigen Presenting Buffer and wash the wells three times each with 200 µl of room temperature Wash Buffer as described in Step F6 (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200428/20200428015050_8850.jpgFigure 3. Flicking procedure. As described in Step F6, the plate should be vigorously flicked on a paper towel to completely remove the solution in the wells. The flicking should be repeated 5 times.Add 50 µl of diluted anti-RhoB primary antibody to each well and leave the plate on the orbital microplate shaker (250 rpm) at room temperature for 45 min.Dilute the secondary HRP labeled antibody to 1/62.5 in Antibody Dilution Buffer.Vigorously flick out the anti-RhoB primary antibody as described in Step F6.",
    "Wash the wells three times each with 200 µl of room temperature Wash Buffer as described in Step F6.Add 50 µl of diluted secondary antibody to each well and leave the plate on a microplate shaker (250 rpm) at room temperature for 45 min.Prepare an aliquot of HRP detection reagents A and B. Do not mix.Flick out the secondary antibody and wash the wells three times each with 200 µl of room temperature Wash Buffer as described in Step F6.Pipette 50 µl of the mixed HRP detection reagent into each well and incubate at 37 °C for 10 min.Add 50 µl of HRP Stop Buffer to each well and check that the wells are free of bubbles.Read the signal by measuring absorbance at 490 nm using the microplate spectrophotometer. At least three readings are recommended to capture the maximum signal of absorbance."
  ],
  "subjectAreas": [
    "Biochemistry",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}