{
  "id": 3487,
  "origin_website": "Cell",
  "title": "Protocol to study molecule exchange between venous blood and CSF in live mice using transcranial bioluminescence imaging",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nBioluminescence microscopy imaging set-up\nTiming: 10 min\nThis section describes the steps required for bioluminescence microscopy imaging.\nTurn on the microscope xyz stage controller, PC, light-source, and microscope camera for BLI imaging.\nSet imaging settings in NIS-Elements.\nFormat 512 × 512 pixels.\nSpeed 1 Hz (1 s exposure time).\nGain 300, Gain multiplier 3×.\nNote: Depending on the microscope magnification might not be protocoled in the image file properties automatically.\nUse a ruler to determine the correct pixel size with the given settings.\nThe AZ100M has a manual zoom magnification system with a ratio of 8:1.\nNote the magnification of the microscope as it is not automatically transferred to the software.\nPrepare the syringe pump.\nUse the needle holder to break off the sharp tip of a 30G dental needle.\nInsert the sharp tip into 25 cm length of PE10 tubing.\nFlush the long tubing and attached cannula with aCSF using a 1 mL syringe fitted with a 30G needle.\nRemove the syringe leaving the 30G cannula attached to the rear end of the tubing.\nFit the cannula onto a 100 μL syringe filled with distilled water.\nConnect the 100 μL syringe to a syringe pump.\nSurgery preparation\nTiming: 15–20 min/mouse\nThis section explains how to anesthetize and prepare the mouse prior to initiating surgery.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3061-Fig1.jpg\nFigure 1. Surgery preparation and thin skull window\n(A) Before you begin: Autoclave tools and ensure clean, sterile environment.\n(B) Shave the mouse, clean the skin with ethanol, chlorhexidine, and iodine solution. Cut the skin exposing the skull.\n(C) Right: Headplate the animal by applying small drops of cyanoacrylate glue to the edges of the headplate. Left: Custom headplate with dimensions.\n(D) Rest your hand on an approx. 5 cm tall box to ensure appropriate angle when drilling.",
    "(E) Check vascular visibility throughout the drilling process by adjusting the overhead light.\n(F) When satisfied with the skull thickness apply a thin layer of glue and distribute with a spatula.\nNote: Autoclave all your surgical tools and ensure a clean sterile environment before you begin (Figure 1[href=https://www.wicell.org#fig1]A).\nWeigh the mouse (15 g–40 g) and anesthetize it via an intraperitoneal injection of a mixture of ketamine (100 mg/kg) and xylazine (10 mg/kg). Re-dose with half a dose of ketamine (50 mg/kg) and xylazine (5 mg/kg) when necessary, throughout the surgical procedure as noted below. Usually once every 40 min.\nNote: It is also possible to use alternative anesthesia such as isoflurane. We use KX to avoid the vasodilatory effects of isoflurane.\nInject buprenorphine (0.05 mg/kg) subcutaneously for systemic analgesia.\nWait 5–10 min. Once toe pinch reflexes cease, place the animal on a heating pad set to 37°C covered with absorbent pad.\nCritical: Pinch the toes with surgical tweezers to ensure that the animal is fully anesthetized throughout the surgical procedure and monitor respiration and eye movement reflexes.\nShave the head and the neck of the mouse.\nRemove excess fur.\nSterilize the exposed skin first using an ethanol swab, and then chlorhexidine and iodine solution.\nRepeat this three times.\nApply eye ointment.\nInject 0.5 mL of lidocaine (0.2 mg/mL) subcutaneously near the neck region and 0.5 mL near the scalp; a small bulge will appear.\nPause point: Wait 2 min for the lidocaine to exert its effect.\nThinned skull transcranial window\nTiming: 30 min/mouse\nThe following section explains the procedure to thin the skull for transcranial imaging.\nUse the scalpel to perform a midline incision along the scalp which descends from the frontal region of the head (between the eyes) to the neck region (between the ears).",
    "Expose the neck muscle using a tweezer and scissors.\nNote: This is to ensure access to both the skull and the cisterna magna.\nGently pull the skin to the sides of the skull using tweezers to expose the skull (Figure 1[href=https://www.wicell.org#fig1]B).\nCritical: Dry the skull and remove the periosteum with a cotton swab. Use an ethanol swab to clean the skull followed by a swab of 10% solution of ferric chloride. Failure to remove the membranes can result in unstable head plate placement.\nPlace a thin layer of transparent cyanoacrylate superglue around the viewing window on one side of the headplate.\nTurn the headplate such that the front faces the back.\nNote: This creates space for the following cisterna magna cannulation.\nCarefully place the glue-coated headplate on top of the mouse’s head such that the viewing window of the headplate falls above the region of interest.\nNote: For the SLYM study the region of interest was the caudal part of the brain specifically around the transverse sinus. However, the region of interest can be adjusted depending on the study.\nApply light pressure to ensure the headplate lies flat onto the head (Figure 1[href=https://www.wicell.org#fig1]C).\nApply a small drop of acrylate along the edges of the headplate to bond the glue.\nCheck the stability of the headplate by gently and lightly probing it with the forceps.\nPlace the animal with the heating pad into the MAG-1 holder.\nEnsure that the head is tightly secured into the holder by gently probing the headplate with forceps under the microscope. There should be no movement (Figure 1[href=https://www.wicell.org#fig1]C).\nDry the skull again using a dry cotton swab and compressed air.\nUse the drill to gently begin thinning the skull (Figure 1[href=https://www.wicell.org#fig1]D).",
    "The diameter of the window depends on your region of interest. In this protocol, we will focus on the area near the lambda region right around the transverse sinus (Figure 1[href=https://www.wicell.org#fig1]F).\nUse only light sweeping motions almost parallel to the skull with no direct downward pressure to penetrate the skull.\nRest your hand on an approx. 5 cm high box while drilling. This helps provide the appropriate drilling angle (Figure 1[href=https://www.wicell.org#fig1]D).\nNote: Alternate between drilling and removing debris with a compressed air bottle (or other sources of compressed air). This allows for a better field of view and working area but more importantly avoids generating too much heat on the skull.\nTest the thickness of the skull with blunt end forceps. The surface will indent slightly with pressure. Optimal skull thickness is around 20 μm.\nOptional: Carefully manipulate the light (by moving your source slightly) to test whether the vasculature beneath the skull is visible (Figure 1[href=https://www.wicell.org#fig1]E).\nWhen satisfied with the thickness and transparency, clean the skull by removing debris and wash with 0.9% saline.\nNote: Make sure to dry the skull adequately. If the skull remains wet before glue application the field of view might be obstructed when imaging.\nApply a small drop of cyanoacrylate glue at the caudal end of the brain.\nUse a spatula to immediately distribute the glue creating a thin layer covering the entire skull (Figure 1[href=https://www.wicell.org#fig1]F).\nNote: The glue will increase transparency of the thinned skull and increase image quality.\nPause point: Wait 5 min for the glue to dry.\nCisterna magna cannulation\nTiming: 20 min/mouse\nThe following section explains the procedure to introduce a cannula into the cisterna magna for infusion of substrate.\nPrepare the cannula and tubing.\nUse a needle holder to break off the beveled tip of a 30G dental needle.",
    "Insert the beveled needle into 4 cm length of PE10 tubing.\nFlush this short tubing and cannula with aCSF using a 1 mL syringe fitted with a 30G needle.\nNote: Take care not to detach/cut skin-glue connection from the previous procedure to keep the headplate in place.\nOnce the glue has dried from the thin skull preparation, re-dose with ketamine/xylazine if necessary.\nRemove the animal from the MAG-1 holder and restrain into a stereotaxic frame.\nTilt the head slightly to create a 120° angle (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3061-Fig2.jpg\nFigure 2. Cisterna magna infusion and imaging\n(A) Expose the cisterna magna using a pair of forceps to separate the neck muscles.\n(B) Pierce the cisterna magna at the center of the triangle. Illustration adapted with permission from Xavier et al.6[href=https://www.wicell.org#bib7]\n(C) Secure the cannulation by adding a drop of cyanoacrylate glue to the area surrounding the point of entry. Cover the needle and the surrounding area with dental cement.\n(D) Place the animal on the imaging stage ensuring tubing from pump can reach it.\n(E) Attach the syringe pump tubing to the cannula and infuse the enzyme (note example image tracer in this tubing is not the same color as the enzyme).\n(F) Retro-orbitally inject the substrate at an approximately 30° angle.\nLift the skin immediately above the neck muscle using fine tweezers and cut approximately 1 cm above the midline using a pair of scissors.\nUse surgical eye spears or cotton swabs to dry the newly exposed area.\nUse surgical tweezers to gently remove the connective tissue above the neck muscles.\nWith a pair of forceps in each hand, carefully separate the neck muscles along the midline exposing the cisterna magna (CM) (Figure 2[href=https://www.wicell.org#fig2]A).",
    "Note: The CM forms a triangle just below the skull that often appears as a dark triangle (Figure 2[href=https://www.wicell.org#fig2]B).\nWipe the dural membrane above the CM using a cotton swab.\nRetrieve the short tubing prepared in the previous steps (Step 24).\nRemove the attached syringe and 30G needle from the tubing.\nEnsure that the tubing remains filled with aCSF and no air bubbles are present.\nUsing a pair of curved tweezers, hold onto the tubing covered end of the needle, resting your dominant hand onto the other.\nIdentify the area of the CM often seen through dura as a triangle (Figure 2[href=https://www.wicell.org#fig2]B) and insert approx. 1 mm of the cannula into the center at a 45° angle to the head.\nThe dura is slightly tough to penetrate so be careful but use adequate force.\nPlace the needle at the center of the triangle and gently move it from side to side to loosen the entry point before piercing it.\nNote: Be careful not to penetrate the medulla or cerebellum.\nLet go of the needle, resting the tubing on your dominant hand.\nUse a surgical eye spear to dry up any CSF.\nApply 1–2 drops of cyanoacrylate glue to the area where you have inserted the cannula.\nThen immediately, apply a drop of glue accelerator.\nRemove your resting hand and the cannula should remain in place.\nCover the needle and the surrounding area reaching up to the caudal end of the headplate with a mixture of dental cement and cyanoacrylate glue (2 drops) for extra support.\nApply a drop of glue accelerator (Figure 2[href=https://www.wicell.org#fig2]C).\nSeal the tubing with a surgical cauterizer to maintain intracranial pressure (ICP) levels during transport of the animal to the imaging area.",
    "Pause point: The mouse can be kept in a plastic container on a 37°C heating pad for up to an hour. Maintain anesthesia throughout this time.\nPlace the pump and now attached syringe and tubing right next to the imaging stage.\nEnsure that the tubing can reach the animal on its MAG-1 holder (Figure 2[href=https://www.wicell.org#fig2]D).\nBioluminescence imaging and cisterna magna infusion\nTiming: 45–60 min/mouse\nThe following section explains the procedure to infuse CSF with enzyme GeNL luciferase and image the bioluminescence reaction following the i.v. retro-orbital injection of the FFz substrate.\nMove the mouse to the imaging area and head fix onto a MAG-1 holder with a heating pad under the macroscope (Figure 2[href=https://www.wicell.org#fig2]D).\nNote: Place the mouse holder such that you can perform retro-orbital injection of the substrate while the mouse is placed under the setup without moving it.\nUsing the syringe pump, withdraw a bit of air to insert a small 1 cm (about 0.39 in) air bubble into the long tubing.\nThen withdraw 12 μL of the purified GeNL.\nCritical: Ensure that no air bubble is present between the tubing and cannula by infusing a small amount until you see a bit of GeNL at the needle tip.\nCut 1 mm of the short tubing attached to the cannula on the mouse.\nUse a needle holder to gently insert the long tubing with the sharp dental needle into the small cannula on the mice (Figure 2[href=https://www.wicell.org#fig2]E).\nNote: Be careful not to move the cannula in the CM out of place.\nUse a lamp or similar source to shine white light on the skull of the animal.\nSet the magnification and focus on the macroscope that allows the appropriate visualization of your area of interest.\nRecord for 1 min under white light.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3061-Fig3.jpg\nFigure 3. Bioluminescence imaging",
    "(A) White-light image recorded at 10 ms exposure time and EM gain multiplier of 3×.\n(B) mNeongreen fluorescence recorded using FITC/Cy5 dual-band filter at 490 nm excitation after 30 min of infusion start.\n(C) Background intensity recorded in darkness with no filter using 1 s exposure time per frame, 512 × 512 pixel, EM gain 17 MHZ at 16-bit, Conversion Gain 3×, EM gain multiplier 300×.\n(D) 5 min bioluminescence signal recorded using same settings as the baseline.\n(E) Scheme of the molecular exchange between the venous blood and CSF, fluorescence intensity image of the luciferase distribution and bioluminescence intensity image after i.v. injection of the substrate. The dashed white lines outline the vasculature drawn based on inverted GeNL signal. Figure adapted with permission from Møllgård et al.1[href=https://www.wicell.org#bib1]\nNote: This allows you to visualize any damage to the skull that might interfere with your later analysis as well as to localize brain structures/vasculature (Figure 3[href=https://www.wicell.org#fig3]A).\nNote: When using white light or fluorescence excitation adjust exposure time and EM Gain Multiplier to avoid oversaturation of the camera chip. We recommend 10 ms exposure time and EM Gain Multiplier of 3×.\nStart the pump infusing 1 μL/min for 10 min.\nAllow the GeNL to circulate for another 20 min.\nCheck anesthetic depth of the animal and consider re-dosing the animal if necessary.\nClose the curtains/cover around the imaging area to ensure complete darkness before imaging.\nChange the filter to FITC/Cy5 and verify the distribution of the enzyme by imaging of the mNeongreen fluorescent signal at 490 nm excitation.\nRecord a representative image (Figure 3[href=https://www.wicell.org#fig3]B).\nRemove all filters and record the background intensity for 1 min.",
    "We recommend using the following camera settings: 1 s exposure time per frame, 512 × 512 pixel resolution, EM Gain 17 MHz at 16-bit, Conversion Gain 3×, EM Gain Multiplier 300× (Figure 3[href=https://www.wicell.org#fig3]C).\nNote: The bioluminescence signal is very dim. Therefore, the camera used should be set to maximum sensitivity and any excitation, dichroic, and emission filter should be removed from the light path.\nDilute 25 μL of FFz in 75 μL PBS in a 1.5 mL Eppendorf tube.\nUsing a 0.5 mL insulin needle and syringe, withdraw a total volume of 100 μL of the diluted FFz.\nEnsure that all your imaging settings are appropriate, that you will be able to easily close the curtains after the following steps, and that you will be able to start the recording immediately after.\nNote: The bioluminescence reaction happens within a few milliseconds following the next steps so make sure things are ready prior to retro-orbital injection.\nCarefully introduce the cannula at an approximately 30° angle into the medial canthus of the eye with the bevel of the needle facing down (Figure 2[href=https://www.wicell.org#fig2]F).\nUse the needle to gently follow the eyeball down until the needle tip is at the base of the eye.\nSlowly press down the syringe injecting the substrate.\nSmoothly withdraw the syringe and immediately close the curtains ensuring darkness.\nImmediately start the 5-min bioluminescence recording using the same settings as for baseline recording (Figure 3[href=https://www.wicell.org#fig3]D).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3061-Fig4.jpg\nFigure 4. Bioluminescence analysis\n(A) Top panel: GeNL fluorescence with outline of vasculature based on inverted GeNL signal, bottom panel: bioluminescence signal (BLI) after substrate injection.\n(B) Top panel: Inverted GeNL signal outlining vasculature, bottom panel: BLI signal overlayed inverted GeNL image (shadow image) with three representative regions of interest (ROIs) selected at areas along the transverse and sagittal sinus.",
    "(C) Top panel: TMR dextran for additional visualization of vasculature, bottom panel BLI signal overlayed TMR outlined vasculature.\n(D) Top panel: Selection of ROIs along transverse and sagittal sinus using shadow image, bottom panel: center point from the vessel wall is defined where the increased normalized BLI signal meets the decreasing normalized tracer intensity from the shadow image.\n(E) Top panel: average intensity distribution of the BLI signal and inverted GeNL signal after normalization, lower panel: Bar plot representation of the fluorescence intensity from the BLI and shadow image intersection (Two-tailed unpaired t-test, p < 0.0001, n = 8).\nOptional: It can be useful to stain the vasculature with a fluorescent i.v. tracer. This helps to identify vessel wall borders but is not necessary for analysis (Figure 4[href=https://www.wicell.org#fig4]C).\nAfter the recording, retro-orbitally inject 100 μL of tetramethyl rhodamine dextran (TMR) (see steps 52–57).\nChange the filter set of the microscope to DAPI/TRITC and record the tracer distribution at 500 nm excitation of 1 min to visualize the vasculature."
  ],
  "subjectAreas": [
    "Health Sciences",
    "Microscopy",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology"
  ]
}