{
  "id": 8709,
  "origin_website": "Jove",
  "title": "A Micro-CT-based Method for Characterizing Lesions and Locating Electrodes in Small Animal Brains",
  "procedures": [
    "All care and experimental manipulation of animals were reviewed and approved by the Harvard Institutional Animal Care and Use Committee. The perfusion described here is specific for rats, but the procedure is applicable to any animals with smaller or similarly sized brains.\n1. Perfusion\nPrepare 1x phosphate-buffered saline (PBS). For a rat (age: 0.5–1.5 years old, weight: 250–600 g), 800–1,000 mL should be sufficient. Use 400 mL to perfuse the animal and an additional 400 mL to dilute the fixative.\nPrepare the fixative consisting of 2% (w/v) paraformaldehyde (PFA) and 2.5% (w/v) glutaraldehyde (GA) in 1x PBS. For a rat, 400 mL is sufficient. Save 50 mL in a 50 mL conical tube for post-fixation of the brain after perfusion.\nAnesthetize the rat with 4–5% isoflurane gas (at 0.8 L/min O2 at 1.0 bar at 21 °C) for 15 min.\nInject a lethal dose of sodium pentobarbital intraperitoneally (180 mg/kg).\nTest for reflex loss in the animal by conducting a toe-pinch reflex exam. Wait to begin the perfusion until the animal has lost its reflex response.\nFollow the previously described intracardial perfusion and brain extraction protocol14 with the following solutions: perfuse the animal with 400 mL of 1x PBS at 125 mm Hg to remove the blood. Once all blood has been removed and replaced with 1x PBS, begin perfusing with 400 mL of a solution of 2% PFA and 2.5% GA dissolved in 1x PBS at 125 mm Hg.\n\tNOTE: If the procedure is being conducted in an animal that is not a rat, the only important components of the perfusion procedure are the use of 1x PBS and 2% PFA, 2.5% GA in 1x PBS. The solution volumes and perfusion pressure may be adjusted according to the species.\n2. Post-fixation",
    "Place the extracted brain in 2% PFA, 2.5% GA in 1x PBS solution (same solution used to perfuse the animal previously). Ensure that the solution volume is at least 10x the volume of the brain. For rats, place the brain in a 50 mL conical tube with 50 mL of solution. Store the sample in post-fixation for 2–3 days, shaking lightly at 4 °C.\n\tNOTE: If the sample is in a 50 mL conical tube, placing it horizontally on an orbital shaker will ensure the best results.\nAfter the sample has been post-fixed for long enough, wash the sample in double-distilled water (ddH2O), de-ionized water (diH2O), or ultrapure water (see Table of Materials) four times for the following durations: 1, 1, 1, and 15 min.\n\tNOTE: For this protocol, ddH2O, diH2O, or ultrapure water should be interchangeable. For simplicity, ddH2O will be used to refer to purified water henceforth.\n3. Staining\nCAUTION: For this step, conduct all solution preparations under a hood while using gloves.\nPrepare at least 10x the brain volume of staining solution. For rat brains, prepare 50 mL of 2% (w/v) osmium tetroxide (OsO4) in ddH2O by combining 25 mL of stock 4% OsO4 solution and 25 mL of ddH2O.\n\tCAUTION: Osmium tetroxide is volatile and may cause temporary blindness and respiratory problems if not handled appropriately. Discard all materials that contact the osmium tetroxide in an appropriate chemical hazard container within a secondary container.\nPlace the brain in a new 50 mL conical tube and add the OsO4 solution. The brain should begin to turn brown as OsO4 reacts with lipids in the tissue.\nClose the tube and seal it thoroughly with paraffin film (see Table of Materials) to ensure that it does not leak during incubation.",
    "NOTE: The osmium is volatile and will react mildly with the plastic of the tube, so sealing the tube properly is very important. The tube may be wrapped with aluminum foil for added protection.\nStore the sealed tube at 4 °C, shaking lightly on an orbital shaker at 50 rpm for 2 weeks. Place the tube horizontally to ensure the best mixing. Ensure that the sample is fully submerged in the solution while shaking.\n\tNOTE: If the osmium is not allowed to circulate continuously, it may not fully penetrate the sample, so horizontal placement on the shaker is very important.\n4. Embedding\nAfter the sample has been incubated in OsO4 for 2 weeks, wash it with ddH2O 5 times at room temperature (RT) for the following durations: 1, 1, 1, 15, and 60 min to remove all the unbound OsO4 in the sample.\n\tNOTE: The multiple exchanges, including the last 60 min exchange, are necessary to allow all the osmium in the circulatory system to diffuse out.\nWash the sample with ddH2O for 30 min at 4 °C.\n\t​NOTE: Osmium may continue to diffuse out of the sample, but its quantity should be greatly reduced from the previous step.\nDehydrate the sample with ethanol to eventually infiltrate it with resin. To dehydrate, replace the ddH2O with 10–20 mL of the following ethanol dilutions (for 30 min each at 4 °C): 20% (v/v) ethanol and 80% (v/v) ddH2O; 50% (v/v) ethanol and 50% (v/v) ddH2O; 70% (v/v) ethanol and 30% (v/v) ddH2O; 90% (v/v) ethanol and 10% (v/v) ddH2O; 100% ethanol.\nPrepare the acetone/resin dilutions as follows.\n\t\nPrepare 100 mL of the resin for embedding (see Table of Materials) as per the manufacturer's instructions.",
    "To make the 33% (v/v) resin-67% acetone solution, pour 15 mL of resin into a 50 mL conical tube and add 30 mL of 100% glass-distilled acetone.\nTo make the 50% (v/v) resin-50% acetone, pour 22.5 mL of resin into a 50 mL conical tube and add 22.5 mL of 100% glass-distilled acetone.\nTo make the 67% (v/v) resin-33% acetone solution, pour 30 mL of resin into a 50 mL conical tube and add 15 mL of 100% glass-distilled acetone.\nUse the remaining 32.5 mL of resin as the first solution of 100% resin below.\nBegin the resin infiltration process by moving the sample through 10-20 mL of the following acetone and acetone/resin dilutions: 100% acetone for 30 min at 4 °C; 100% acetone for 30 min at 4 °C; and 100% acetone for 30 min at room temperature (RT).\n\tNOTE: The rest of the infiltration process will take place at RT.\nImmerse the sample in 33% (v/v) resin 67% acetone for 3 h at RT, then 50% (v/v) resin-50% acetone for 3 h at RT, 67% (v/v) resin 33% acetone for 3 h at RT, and 100% resin for 12 h at RT.\nMake a fresh 50 mL batch of resin following the instructions on the bottle. Transfer the sample to the container in which it will be cured (e.g., the disposable molds described in Table of Materials). Infuse the sample with fresh 100% resin for 4 hours at RT.\n\tNOTE: If fresh resin is not used, the resin made the previous day will begin to harden prematurely, and the sample will be hard to manipulate.\nDegas the sample in a vacuum oven for 15 min at 45 °C.",
    "NOTE: This step will help remove any trapped air bubbles within the sample, but it is non-essential and will not affect quality of the data.\nFinally, cure the sample in an oven for 48 h at 60 °C.\n5. micro-CT\nOnce the sample has been cured, peel off the disposable mold and scan it with the micro-CT machine.\n\tNOTE: Depending on the machine used, the settings will be different. For the scanner used by the authors listed in the Table of Materials, the recommended settings are 130 kV, 135 µA with a 0.1 mm copper filter and a molybdenum source, a 1-second exposure, and an average of 4 frames per projection. However, experimenters should calibrate the scanner individually, as many factors will affect optimal settings during a particular session.\nOnce the scan is completed, reconstruct the sample with the recommended parameters for the experimenter's scanner/software combination on a computer with the scanner software.\nFinally, visualize and analyze the reconstructed digital volume using the experimenter's software of choice (see Table of Materials for examples).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}