{
  "id": 13707,
  "origin_website": "Jove",
  "title": "Generating Primary Fibroblast Cultures from Mouse Ear and Tail Tissues",
  "procedures": [
    "Mice were housed in pathogen-free conditions in compliance with the institutional guidelines until euthanization (The Institutional Animal Care and Use Committee (IACUC) guidelines at the National University of Singapore and the National Advisory Committee for Laboratory Animal Research (NACLAR) guidelines).\n1. Mice\nOrder one mouse of the appropriate genetic background. This protocol is based on tissue derived from one C57BL/6 mouse.\n2. Preparation of Complete Medium\nPrepare complete medium by adding the following components to Roswell Park Memorial Institute (RPMI) 1640 medium: 10% fetal calf serum (FCS), 50 µM 2-mercaptoethanol, 100 µM asparagine, 2 mM glutamine, 1% penicillin-streptomycin solution.\n3. Preparation of Enzyme Solutions\nPrepare collagenase D solution in a 15 ml conical bottom tube.\n\t\nWeigh 10 mg of collagenase D. Dissolve collagenase D in 4 ml complete medium.\nPrepare pronase solution in a 1.7 ml microcentrifuge tube.\n\t\nWeigh 10 mg of pronase.\nAdd 5 µl of 1 M Tris buffer (pH 8.0). Add 1 µl of 0.5 M EDTA (pH 8.0).\nTop up with 494 µl of sterile water.\nIncubate the pronase solution at 37 °C in a water bath for 30 min.\n4. Preparation of Collagenase D-pronase Mix (≤2 Tails)\nNote: Perform the subsequent steps in a sterile cell culture hood.\nAdd 250 µl of pronase solution to 4 ml of collagenase D solution.\nPass the collagenase D-pronase mixture through a 0.2 µm syringe filter into a sterile 15 ml conical bottom tube.\n5. Extraction of Fibroblasts from Ear and Tail Tissues\nEuthanize mice according to the appropriate institutional guidelines.\nPlace autoclaved surgical instruments (scissors and forceps) in the cell culture hood.\nAdd 10 ml complete medium into two 10 cm cell culture dishes each.",
    "Cut ears (~1 cm radius) and 5 cm of tail (from the tip of the tail) of a mouse with scissors and incubate for 5 min in 40 ml 70% ethanol in a sterile 50 ml conical bottom tube.\nAir-dry ears and tail by placing them in an open 10 cm cell culture dish in the hood for 5 min. Once dried, transfer ear and tail pieces to two culture dishes labelled \"ears\" and \"tail\" containing 10 ml complete medium as described in step 5.3.\nRemove hair from the ears and tail using scissors.\nCut ears and tail into pieces smaller than 3 mm in size using scissors.\nTransfer the cut tissues into 1.8 ml cryotube vials labelled \"ears\" and \"tail\" and add sufficient collagenase D-pronase solution for the volume to reach the 1.8 ml mark on the vial.\nPlace the cryotube vials horizontally on a shaker and shake the samples at 200 rpm for 90 min at 37 °C.\nAfter 90 min incubation, remove the cryotube vials from the shaker and place the vials in the hood.\nAdd 10 ml complete medium into two 10 cm cell culture dishes, labelled \"ears\" and \"tail\" each, and put a 70 µm cell strainer in each dish.\nPlace the digested ear and tail tissues in the 70 µm cell strainer in the accordingly labelled dishes prepared in step 5.11 and forcefully grind the tissues using a 10 ml syringe plunger for >5 min. Shake the cell strainer occasionally in the medium to wash cells out of the cell strainer.\nPipette the cell suspension from each dish into two 15 ml conical bottom tubes labelled \"ears\" and \"tail\". Wash the dish and strainer with additional 10 ml complete medium and add the medium to the appropriate 15 ml conical bottom tubes.",
    "Spin down the cell suspension for 7 min at ~580 x g and 4 °C using a refrigerated cell centrifuge.\nRemove supernatant, add 10 ml complete medium to the cell pellet in the 15 ml conical bottom tube and resuspend the cells.\nRepeat step 5.14 and 5.15.\n6. Culturing of Cell Mixture\nRemove supernatant. Ensure that the cell pellet remains undisturbed.\nRe-suspend cells in 10 ml complete medium and add the respective mixture to two 10 cm cell culture dishes labelled \"ears\" and \"tail\".\nAdd 10 µl amphotericin B solution (stock solution: 250 µg/ml) to the culture.\nIncubate cells at 37 °C in a humidified 5% CO2 incubator.\nOn the third day, replace the medium with 10 ml fresh complete medium containing 10 µl of amphotericin B to remove debris (Figures 1 and 2).\n7. Sub-culture of Fibroblasts\nWhen culture reaches around 70% confluency (day 3-4 of culture) remove the medium and wash the cells with 5 ml sterile 1x phosphate buffered saline (PBS).\nRemove PBS and add 2 ml sterile 1x trypsin-EDTA solution to the cells.\nIncubate the cells for 5 min at 37 °C in a humidified 5% CO2 incubator.\nAfter 5 min, gently tap the culture dish and add 6 ml complete medium to the cells.\nTransfer the cell suspension to a 15 ml conical bottom tube and spin the tube for 5 min at ~450 x g and 4 °C using a refrigerated cell centrifuge.\nRemove supernatant, and gently re-suspend the cell pellet in 5 ml complete medium.\nSeed 2 x 105 cells in a 10 cm cell culture dish and incubate the cells at 37 °C in a humidified 5% CO2 incubator for 3-4 days before repeating steps 7.1 to 7.6.\n8. Preparation of Ears for Shipment",
    "Note: Perform the subsequent steps in a sterile cell culture hood.\nEuthanize mice according to the appropriate institutional guidelines.\nPlace autoclaved scissors and forceps into the cell culture hood.\nAdd 50 ml complete medium into a 50 ml conical bottom tube.\nCut ears (~1 cm radius) of a mouse with scissors.\nTransfer the ears into the 50 ml conical bottom tube (as prepared in step 3) using forceps.\nSeal the 50 ml conical bottom tube with parafilm before shipping at RT in an appropriate box.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}