{
  "id": 7121,
  "origin_website": "Bio",
  "title": "<em>In vitro</em> Measurement of Membrane Attack Complex in RPE Cells",
  "procedures": [
    "Transwell preparationCoat 0.4 μm polyester transwell inserts with 100 μg/ml of collagen IV in PBS by pipetting the appropriate volume of collagen onto the apical side of the transwell filter.Leave the transwell filters to air dry with the lid off in a cell culture grade biosafety cabinet.Gently aspirate off any additional collagen from each transwell filter.Wash each filter twice in PBS prior to cell seeding.Cell seeding ARPE-19ARPE-19 cells are maintained in DMEM/F-12 Ham with 10% FBS and 1% PS in T75 cell culture flasks. Cells are passaged at 80% confluency (we have used them up to passage 30).Aspirate medium from T75 flask and wash cell monolayer twice with 5 ml of sterile PBS.Add 3 ml of pre-warmed trypsin and incubate at 37 °C for 5 min until cells begin to detach.Add 3 ml of DMEM F-12.Use a 10 ml stripette to aspirate 6 ml of trypsin/media and flush the bottom wall of the T75 to remove all attached cells.Transfer cell suspension to a 15 ml conical tube.Pellet cells by centrifugation at 205 × g for 5 min.Gently aspirate media.Resuspend cell pellet in 1 ml of fresh media.Count cells using a hemocytometer.Pipette 600 μl of DMEM/F-12 Ham containing 10% FBS into the basolateral side of the transwell filter.Seed cells at a density of 1.7 × 105 cells per cm2 in the upper transwell chamber in 200 μl of DMEM/F-12 Ham containing 10% FBS, (transwell surface area 0.33 cm2 per well).Two days later replace media with DMEM/F-12 containing 1% FBS.Replace media every Monday, Wednesday and Friday for 4 weeks (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3916/bioprotoc-11-04-3916-g002.jpgFigure 2. Polarization of RPE cells grown on transwell filters. A. Schematic representation of the RPE. Polarised RPE cells display apical microvilli and ZO-1 tight junction protein expression. B.",
    "RPE cells seeded on the apical side of a transmembrane filter and maintained for at least 4 weeks form polarised monolayers as indicated by defined ZO-1 immunohistochemistry in both (C) ARPE-19 cells and (D) primary hfRPE cells. Scale bars = 20 µm.Cell seeding primary human fetal RPE (hfRPE) cellsCells were kindly provided by Dr. Arvydas Maminishkis from the National Eye Institute (NEI), Bethesda, USA, and were received as a confluent monolayer of P-0 (Maminishkis et al., 2006).hfRPE cells are received in a T25 with filled with media.After receiving gently aspirate all media from the cell monolayer.Add 5 ml of fresh media Alpha MEM (w/o L-glutamine Lonza BE12-169F), plus Pen/strep + L-glutamine, 5% FBS.Leave cells to rest for at least 1 day prior to plating.Aspirate cell culture media.Wash cells with 50 ml of PBS.Note: This will fill the entire flask. Remove 50 ml of PBS and repeat for a second wash step.Pipette 5 ml of warm trypsin-EDTA into the flask.Place flask in the incubator for 15 min.Use a spinal needle with a 3 ml syringe to aspirate the trypsin from the RPE monolayer.Direct the flow of the needle against the wall of the flask which has adherent cells.Press down on the syringe to stream wash the cells from the wall of the flask.Use a 5 ml pipette to collect the cell suspension into a sterile conical tube.Immediately add RPE media containing 15% FBS to the cells in the conical tube.Repeat steps 9-15 a second time to ensure all cells are dislodged.Pellet cells by centrifugation at 205 × g for 5 min.Gently aspirate media.Resuspend cell pellet in 1 ml of fresh media (no need for FCS).Count cells using a hemocytometer.Add 600 μl of RPE media containing 15% FCS to the basolateral well of each transwell.",
    "Seed cells at a density of 100 × 103 cells per cm2 into the apical transwell chamber in 200 μl of RPE media containing 15% FCS, transwell surface area 0.33 cm2 per well.48 h later aspirate media from both apical and basolateral transwell chambers.Pipette 200 μl of RPE media containing 5% FCS into the apical and 600 μl into the basolateral chamber.Continue to change RPE media every Monday, Wednesday and Friday for 4 weeks.Validation of tight junction formationNote: Validation of tight junction formation can be conducted in parallel with the MAC formation assay. After 4 weeks in culture RPE cells on transwell inserts are fixed by adding 200 μl of 4% paraformaldehyde (PFA) to the apical membrane and 600 μl of 4% PFA to the basolateral chamber.Cells are incubated in PFA for 10 min at room temperate.Gently aspirate PFA taking care not to poke a hole in the transwell filter or disturb the cells.Wash cells on filter 3 times for 5 min with 200 μl of PBS in the apical compartment and 600 μl on the basolateral side.Pipette 200 μl or 600 μl of 0.05% Triton X-100 into the apical and basolateral chambers respectively.Cells are incubated in 0.05% Triton X-100 for 10 min at room temperature to permeabilize the cell membrane.Aspirate Triton X-100.Pipette 200 μl or 600 μl of 5% normal goat serum (NGS) into the apical and basolateral chambers respectively.Block cells in NGS for 1 h at room temperature.Aspirate 5% NGS.Pipette 100 μl of ZO-1 antibody (1:100 in 5% NGS) into the apical side of the transwell filter.100 μl of antibody was pipetted into the bottom of an empty 6-well plate and the transwell inserts were placed to sit directly on the antibody.Inserts were incubated overnight at 4 °C.Aspirate antibody from apical chamber.",
    "Place transwell into a new plate with 600 μl of PBS in the basolateral chamber and pipette 100 μl of PBS into the apical side.Repeat this wash step 3 times.Pipette 100 μl or 600 μl of PBS with goat anti-rabbit 488 (1:500) into the apical and basolateral chambers respectively.Incubate transwells in secondary antibody for 2 h at room temperature.Aspirate off secondary antibody.Pipette 200 μl or 600 μl of PBS into the apical and basolateral chambers respectively.Repeat PBS wash 3 times.Aspirate off last PBSAdd 200 μl of Hoechst (1:10,000) to the apical transwell.Incubate transwell for 2 min.Wash transwells 3 times in PBS.Gently remove all liquid from the transwell filter.Turn the transwell upside down on a clean surface.Gently use a sterile scalpel to cut around the circumference of the membrane.Use a sterile tweezer to grip one side of the filter after the first incision.Gently use the tweezers to loosen the membrane as you continue to cut slowly with the blade. Take care not to scratch the cell monolayer with the tweezers.Once the membrane is cut free use the tweezers to mount the membrane basolateral side down on to a polylysine coated slide. i.e., cells should be facing up on top of the slide.Pipette 50-100 μl of Mowiol® 4-88 mounting media onto the membrane and cover with cover slip.MAC formation Assay48 h prior to MAC formation assay remove all RPE media from both apical and basolateral transwell chambers.Pipette 600 μl of serum free DMEM/F-12 Ham into the basolateral transwell chamber.Pipette 200 μl of serum free DMEM/F-12 Ham into the apical chamber.Thaw stock bottle of normal human serum (NHS) rapidly at 37 °C.Aliquot NHS into single use aliquots (300-500 μl).Store aliquoted NHS at -80 °C.On the day of the MAC assay remove two aliquots of NHS from -80 °C.Thaw aliquots on ice.",
    "Heat inactivate one aliquot of NHS by placing in either a heat block or water bath set to 56 °C.Incubate serum for 30 min at 56 °C inverting the tube every 10 min.Allow the heat inactivated serum to cool to room temperature.Designate which transwells will be used for apical or basolateral MAC formation.Aspirate media from transwells.Add 600 μl of serum free media to the basolateral chamber and 180 μl of serum free media to the apical chamber of wells designated for apical MAC assessment.Add 540 μl of serum free media to the basolateral chamber and 200 μl of serum free media to the apical chamber of wells designated for basolateral MAC assessment.Pipette 20 μl of either NHS or heat-inactivated (Hi) HiNHS to the apical chamber of wells containing 180 μl of media.Pipette 60 μl of either NHS or HiNHS to the basolateral chamber of wells containing 540 μl of media.Incubate RPE with NHS or HiNHS for 2-24 h.After 24 h fix cells by adding 200 μl of 4% PFA to the apical membrane and 600 μl of 4% PFA basolateral chamber.Incubate cells in PFA for 10 min at room temperature.Gently aspirate PFA taking care not to poke a hole in the transwell filter or disturb the cells.Wash cells on filter 3 times for 5 min with 200 μl of PBS in the apical compartment and 600 μl on the basolateral side.Pipette 200 μl or 600 μl of 5% bovine serum albumin (BSA) into the apical and basolateral chambers respectively.Block cells in BSA for 1 h at room temperature.Aspirate 5% BSA.Pipette 100 μl of C5b-9 MAC antibody (1:25 in 5% BSA) into the apical side of the transwell filter.",
    "100 μl of antibody was pipetted into the bottom of an empty 6-well plate and the transwell inserts were placed to sit directly on the antibody, the plate is lidded and sealed with parafilm.Inserts were incubated overnight at 4 °C in a fridge.Aspirate antibody from apical chamber.Place transwell into a new plate with 600 μl of PBS in the basolateral chamber and pipette 100 μl of PBS into the apical side.Repeat this wash step 3 times.Pipette 100 μl or 600 μl of PBS with goat anti-mouse 647 (1:500) and phalloidin (1:500) into the apical and basolateral chambers respectively.Incubate transwells in secondary antibody for 2 h at room temperature.Aspirate off secondary antibody.Pipette 200 μl or 600 μl of PBS into the apical and basolateral chambers respectively.Repeat PBS wash 3 times.Aspirate off last PBSAdd 200 μl of Hoechst (1:10,000) to the apical transwell.Incubate transwell for 2 min.Wash transwells 3 times in PBS.Gently remove all liquid from the transwell filter.Turn the transwell upside down on a clean surface.Gently use a sterile scalpel to cut around the circumference of the membrane.Use a sterile tweezer to grip one side of the filter after the first incision.Gently use the tweezers to loosen the membrane as you continue to cut slowly with the blade. Take care not to scratch the cell monolayer with the tweezers.Once the membrane is cut free use the tweezers to mount the membrane on to a polylysine coated slide (Thermo Scientific).Pipette 50-100 μl of Mowiol® 4-88 mounting media onto the membrane and cover with cover slip.MAC formation on ARPE-19 cells (Figure 3) and hfRPE cells (Figure 4) was imaged using a confocal laser scanning microscope.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3916/bioprotoc-11-04-3916-g003.jpgFigure 3. MAC assay on ARPE-19 cells.",
    "MAC formation (red) was observed in ARPE-19 cells stimulated with CEP (that induces the alternative complement pathway) and 10% NHS as a source of complement for 24 h. No staining was observed in the NHS alone or HiNHS control. Scale bar = 20 μm.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210217/20210217232127_7881.jpgFigure 4. MAC Assay on hfRPE. MAC formation (green) was observed in hfRPE cells stimulated with CEP and 10% NHS as a source of complement for 2 h. No staining was observed in the NHS alone or HiNHS controls. Scale bar = 20 μm."
  ],
  "subjectAreas": [
    "Immunology",
    "Molecular Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}