{
  "id": 17274,
  "origin_website": "Jove",
  "title": "Early Pathological and Magnetic Resonance Detection of Cerebral Injury Using a Rat Model of Neonatal Hypoxic Ischemic Encephalopathy",
  "procedures": [
    "All the experimental procedures were approved by the Oklahoma Medical Research Foundation (OMRF) Institutional Animal Care and Use Committee (protocol IACUC #17-17). Pregnant female Sprague-Dawley rat pups at E14 were used for the present study. The animals were obtained from a commercial source (see Table of Materials).\n1. Animal preparation\nAcclimatize the animals in the animal facility prior to delivery of the litters.\nMaintain all rats on a12 h light/darkcycleand feed standard ratchow.\nAfter delivery of the litters, keep the pups with their respective dams. Use both sexes for the experiments.\nAt postnatal age 10 (P10), randomize the pups to either sham or HIE groups.\n\t​NOTE: The experimental timeline is depicted in Figure 1. All the experiments were performed on the same day at P10.\n2. Carotid artery ligation (CAL) for the experimental HIE group\nPlace the rat pups on a warming pad.\nInitiate anesthesia with 4% isoflurane in oxygen (0.6 LPM) using a nasal cone until the pinch reflex disappears. Drop the flow of gas to 0.5%-2% for the maintenance of anesthesia. Ensure the pups are unconscious without suppressing the respiratory drive.\nMark the pups on the tail for identification and gently restrain them with tape on all four limbs.\nShave the neck area and sterilize with 70% iodine-povidone solution swabs (see Table of Materials).\nUsing an #11 blade, make a 1 cm midline neck incision through the skin. Carefully dissect the left parotid gland and fascia until the left carotid artery is exposed. Gently mobilize the vessel using hemostats to free it from the fascia.\nUsing a small hemostat, carefully pass two 5-0 sutures (see Table of materials) around the vessel, 0.5 cm apart, and tie them tightly.",
    "Using small scissors, cut the artery in between the two sutures to ensure the discontinuity of blood flow. Close the skin and fascia with 5-0 silk sutures (see Table of Materials).\nInject buprenorphine (10 units in 800 μL of sterile normal saline) intraperitoneally and another 800 μL of normal saline subcutaneously in the back of the neck to prevent dehydration.\n\tNOTE: The procedure must be completed within 10-12 min.\nReturn the pups to the cages with their dams and allow the pups to awaken and recover for 1-2 h.\n3. Sham surgical procedure for the control group\nPlace the rat pups on a warming pad.\nInitiate anesthesia with 4% isoflurane in oxygen (0.6 LPM) using a nasal cone until the pinch reflex disappears. Drop the flow of gas to 0.5%-2% for the maintenance of anesthesia. Ensure the pups are unconscious without suppressing the respiratory drive.\nMark the pups on the tail for identification and gently restrain them with tape on all four limbs.\nShave the neck area and sterilize with 70% iodine-povidone solution swabs.\nUsing an #11 blade, make a 1 cm midline neck incision through the skin and then close it with 5-0 silk sutures.\nFollow the same hydration, analgesia, and postoperative care as for the HI group (steps 2.8-2.9).\n4. Hypoxia exposure for both the CAL and sham groups\nPrepare the clear plexiglass hypoxia chamber (see Table of Materials) by attaching tubing to the chamber lid to provide continuous airflow of 6 LPM of the hypoxia gas mixture (8% oxygen, 92% nitrogen).\nPlace a blue absorbent pad in the chamber and immediately place the rat pups from both groups in the chamber. Allow the pups to remain in the hypoxia chamber for 45 min.",
    "Immerse the chamber in a water bath with continuously flowing warm water to keep the temperature set at 37 °C inside the chamber.\nHydrate the pups with an oral saline solution via gavage of 600 μL before being placed in the hypoxia chamber and 600 μL at the end of the 45 min.\nRemove all the pups to the cages with their dams (experimental and sham) and allow them to recover for 2 h in a room next to the small animal imaging facility.\n5. Magnetic resonance imaging and spectroscopy\nPerform MRI and MRS to identify and evaluate the radiological and metabolic markers 4 h after the end of carotid artery ligation. Perform the procedure under anesthesia with continuous cardiovascular monitoring at the small animal imaging facility.\nAnesthetize each animal (with 1.5% isoflurane and 0.7 L/min oxygen) and place it in the MR probe (see Table of Materials) in a supine position on a blue absorbent pad covering a heating pad. Monitor the respiration rate of the animals continuously using an abdominal pneumatic pillow (see Table of Materials).\nUse a head surface coil as a signal receiver and transmit radiofrequency pulses to the sample through a quadrature volume coil (72 mm inner diameter, see Table of Materials).\nPerform MRI to evaluate both the changes in cerebral blood flow (CBF) and the changes in water diffusion constants (ADC) following previously published methods15,16,17. Perform MRI morphology (T1 and T2), diffusion, and perfusion to determine the brain's most affected and least perfused areas.\n\tNOTE: The mean values for perfusion and diffusion (ADC) in each group are compared between the ligated side and the control side (intact carotid artery side).\nPerform MRS following previously published methods15,17 and analyze using an in-house coded program using Mathematica software (see Table of Materials).",
    "Scale the MR spectra in parts per million (ppm) by calibrating against the water peak (4.78 ppm). Identify the major brain metabolic peaks as N-acetylaspartate (NAA) at 2.02 ppm, choline (Cho) at 3.22 ppm, creatine (Cr) at 3.02 ppm, and myo-inositol at 3.53 ppm.\n\t​NOTE: The peak area measurements of the metabolites are used to calculate the following ratios: NAA to Cho (NAA/Cho), Cr to Cho (Cr/Cho), and Myo-Ins to Cho (Myo-Ins/Cho)15.\n6. Serum and cerebral tissue analysis\nPerform blood sampling at 5.5 h following the carotid artery ligation or sham procedure according to previously published methods18.\nAnesthetize the pups again with 4% isoflurane.\nUsing a sharp #11 blade, make an abdominal incision, followed by a diaphragmatic incision to expose the heart.\nPerform blood sampling via cardiac puncture as previously described18. Briefly, insert a 32 G needle on a 1 mL syringe into the right heart chamber and gently aspirate 1 mL of blood.\nAllow the whole blood to coagulate, followed by centrifugation at 1,000 x g for 15 min at 4 °C. The serum gets separated into clean microcentrifuge tubes.\nDecapitate the whole pup head for the gross assessment of cerebral pathology and then immerse it in ice for 2 min.\nMake an incision on the dorsal scalp from the base of the skull to the tip of the nose and peel the skull bones from around the brain. Remove the intact whole brain into a clean Petri dish.\nMark the right side of the brain with a non-toxic marker. Position the brain with the cephalad surface upward so that both hemispheres are visible. Using an ice-cold razor blade, slice the brain into four equal sections parallel to the coronal plane.",
    "Immerse the brain sections in 2,3,5-triphenyltetrazolium chloride (TTC, see Table of Materials) solution in a Petri dish covered with foil to prevent photosensitization and incubate for 15 min at 37 °C.\n\tNOTE: Infarcted areas are delineated as white areas devoid of red TTC stain.\nIf infarcts are subtle or difficult to detect, inject 0.5-1 mL of TTC (1%) in phosphate-buffered saline directly into the right heart after abdominal incision and thoracotomy, and allow to perfuse for 2 min prior to the decapitation of the pup.\nStore the brain tissue and serum at −80 °C if further analysis is required.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}