{
  "id": 14543,
  "origin_website": "Jove",
  "title": "Assessing Forelimb Function after Unilateral Cervical SCI using Novel Tasks: Limb Step-alternation, Postural Instability and Pasta Handling",
  "procedures": [
    "All animal procedures were done in accordance with approved protocols with the internal IACUC at the University of Texas at Austin and under National Institutes of Health (NIH) guidelines.\nAnimals used in this study had a C3/C4 lateral contusion injury using an Infinite Horizon Impactor, or a C3/C4 lateral hemisection model and these methods can be applied more broadly to other models18. We recommend that researchers test animals for 2 weeks prior to injury, 3 days post injury and regularly (e.g. weekly) for the duration of the study. When performing behavioral tests on post surgical animals, especially at three days post surgery, care must be taken that the animals have recovered sufficiently from the surgery and that the behavioral testing procedures do not cause additional pain or stress to the animals.",
    "In general, 2-3 weeks of handling and pre-testing may be needed prior to surgery. This involves getting the animal comfortable to the testing environment by handling them in a similar way to how they will be handled during testing as well as allowing the animal to move around freely on the testing surface. It is also important to get the animal used to being held, this can be done by moving the animal on and near the testing surface in non-direct motions to acclimate the animal to handling. It is also important to relax the animals at the beginning and in between test sessions. To relax the animals, hold the animal on a tabletop in a forelimb-only bearing stance, in a \"wheelbarrow\" position and bounce the animal gently on the tabletop allowing the forelimbs to touch the surface. This teaches the animals to sense below them for a stable surface and is an important and necessary step in the procedure because it ensures that the animals are relaxed before testing begins. \n1. Forelimb Step-alternation Test\nTest Summary: Place the animals with both forelimbs touching the tabletop to determine whether they alternate the use of their forelimbs. Move the rat forward, shifting their center of gravity, forcing them to try to step. This test is repeated four times with each animal and if an animal shows ability to alternate at, or higher than, 75%, it is considered to be an alternator. This is a forced motion task, so animals that are considered non-alternators will repeatedly step with the same forelimb.\nHold an animal on a tabletop in a forelimb-only weight-bearing stance, in a \"wheelbarrow\" position with their body at nearly 90° from the table.\nOnce the animal appears relaxed, push the animal forward to move along the surface of the tabletop.",
    "Determine and record whether the rat alternates use of the forelimbs while moving across the surface.\nNote and record the forelimb that initiated the movement and whether the animal can alternate or not on the Forelimb Step-Alternation Test Score Sheet (provided).\nRepeat this test at least twice while holding the animal with one hand (right or left hand). Repeat at least twice again while holding the animal in the other hand. \nIf rats showed this ability, step-alternation can be tested again by introducing a 5 sec wait after the first step to determine if the pattern of alternation remains after a delay. Note the results and record in the score sheet.\nThis test can be used daily, and it is recommended that the animals be tested at least weekly for a repeated measures experiment.\nNote: It is important to alternate the experimenter's hand position since it may affect the alternation behavior of the test animals. The Step-alternation score sheet provided can be used to note paw position and use during stepping. Although we have not incorporated those data into our scoring system currently (we have only used alternation status to group the lesioned animals in the current study), users can readily include paw position data as part of the analysis depending on the specific project.\n2.\tPostural Instability Test\nTest Summary: For this behavioral test, hold rats in a similar position as for the forelimb alternation test, however, each forelimb should be tested individually. The tabletop should be covered with sandpaper (No. 220) to prevent slipping, bracing, or dragging of the forelimbs during the test.\n\t   \nIn this test, the distance it takes for the animal to take a step with the forelimb being examined to regain its balance will be recorded.",
    "Animals within a study group should be approximately the same weight, size and age as large differences in body weight can result in variation in the baseline distance needed for maintaining center of gravity for a given animal 19. A sham group should be included while using PIT to verify that changes in behavior are due to regeneration or recovery rather than age and weight gain.\nHold an animal on a tabletop in a comfortable stance and allow both forelimbs to reach the surface, the animal should comfortably be in a \"wheelbarrow\" position with their body at nearly 90° from the table. Note that it is important to hold the animal in a more vertical position. This will allow a more consistent distance needed to trigger a step to regain center of gravity.\nLightly restrain one forelimb against the animal's torso and align the rat's nose with the zero line as viewed from above.\nMove the rat forward. This will shift the animal's center of gravity forward stimulating the animal to step to regain its balance.\nRecord the new position of the nose after the rat steps twice and use the average of these two steps as the distance needed to trigger a step.\nTest each forelimb independently 5x, bringing the animal back to the 0 position and verifying that the animal continues to be relaxed in the experimenter's hands before continuing to ensure consistent results.\nRecord on the Postural Instability Test (PIT) Score Sheet, provided. This test can be performed daily, and it is recommended that the animals are tested at least weekly for the duration of the experiment.\n3.\tPasta Handling Test",
    "Test Summary: Use this test to determine the time it takes to eat a piece of pasta and the paw preference during a pasta-eating session. In this test, use 4.0 cm strands of dry pasta (thin spaghetti; diameter ~1.6 mm). The test should be administered at approximately the same time each testing day. Rodents generally eat dry pasta readily; however, 4-6 hours of food withdrawal is recommended before testing if this does not occur.\nBaseline measurements should be acquired 1-2 weeks prior to injury. Prior to baseline recordings, rats should be given the same type of pasta in their home cage to prepare them for testing. Then, allow the rats to eat pasta in a testing chamber and record the time to eat pasta. Pasta pieces should be placed near the front of the testing chamber where the use of forelimbs can be observed readily. Each pasta-eating session should include eating at least three pieces of pasta. Rats are considered proficient in eating pasta if their pasta-eating time is consistent for at least 3 days.\nAfter training the rats to eating pasta consistently in the testing chamber, place rats in recording chambers.\nPlace pasta pieces onto the floor near the front of the testing chamber and record time to eat a piece of pasta, forelimbs used, and the positions of the forelimbs, as seen on the Pasta Handling Score sheet.\nThis test can be performed daily, but it is recommended to perform it weekly while observing the animals' weight as to not over-feed the animals.",
    "Note: The Pasta Handling Score sheet provides space to record time to eat pasta and paw use, similar to the data included in this study. We have also included areas to record additional details of paw use during a pasta eating session, such as paw position."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}