{
  "id": 6952,
  "origin_website": "Bio",
  "title": "Quantitative Kinetic Analyses of Histone Turnover Using Imaging and Flow Cytometry",
  "procedures": [
    "The protocol contains five main processes: (i) Generation of the SNAP-tagged histone expression vector and stable expressing cell lines, (ii) Optimization of cell cycle synchronization, (iii) Detection of global and local histone incorporation using imaging, (iv) Detection of global histone incorporation using flow cytometry, (v) Analysis. Although the first process (i) explains general procedures for cloning and establishing stably expressing cell lines, we emphasize the tips on how to design the SNAP-tagged histone expression vector and isolation of stably expressing cells. This protocol mainly describes the procedures for the fluorescent labeling approaches to investigate histone turnover using microscope (iii) and flow cytometry (iv) (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200902/20200902002126_7729.jpgFigure 1. Workflow of protocol. Three sections of pipelines, Generation of constructs, Sample preparation for imaging and Sample preparation for flow cytometry, are shown as boxes.(i) Generation of the SNAP-tagged histone expression vector and stable expressing cell lines Protein tagging with a small epitope is valuable for detection of the protein of interest in various biochemical approaches. However, tagging a small peptide sometimes interferes with the biological function of the target protein and localization of the protein. In general, it is desirable to test whether the N-terminal or C-terminal tagging of protein alters its functions. The localization of the SNAP-tagged histone variant can be confirmed using immunofluorescence by comparing with the endogenous histone variant whether it is localized at the expected chromatin sites. Additionally, it may be necessary to test if the SNAP-tagged construct retains its specific function in chromatin.  To determine the precise turnover of histone variants, the generation of stably expressing cell lines is highly recommended, since expression level is expected to be altered after mitosis when a transiently transfected SNAP-tagged histone is used. Inserting the SNAP-tag sequence into the endogenous histone locus using CRISPR/Cas9 technology is ideal but not necessary.",
    "The SNAP-expressing vector is commercially available from NEB, which contains a neomycin selection gene. In the process of establishing stably expressing cell lines, titration of the drug concentration in your cells is required for the isolation of positive cells. If your cell line already obtains neomycin resistance, such as HEK 293T cell which is immortalized with the large T antigen with neomycin resistance, the neomycin selection marker needs to be replaced.  The expression level of the SNAP-tagged histone may also influence the timing of incorporation of histones. Since overexpression of histone variants may cause undesirable non-specific incorporation into chromatin, isolating a cell population with a moderate to lower expression of SNAP-tagging histones by Fluorescence-activated cell sorting (FACS) before the pulse-chase experiment is recommended. We also recommend testing the level of SNAP-histone variants compared with endogenous histone variants in purified chromatin fractions by western blotting after establishment of the cell line.(ii) Optimization of cell cycle synchronizationCell cycle synchronization is a common method to arrest the whole cell population into a particular cell cycle phase. Most cell cycle synchronization methods rely on the use of a drug which blocks a specific function required for cell cycle progression. While various cell cycle synchronization methods were established in the past (Table 1), the efficiency of synchronization with drug concentration might depend on the cell type used. Any cell synchronization methods can be used in this protocol after the optimization of drug treatment and staining scheme of pre-existing and newly incorporated histones. Here we introduce the protocol in HEK293T cells using a double thymidine block for synchronization at G1/S phase and mitotic shake-off for synchronization at G2/M phase (Figure 2). Both are widely utilized as general cell cycle synchronization methods.",
    "Successful cell synchronization and release should be confirmed by flow cytometry, western blotting or immunofluorescence (IF) with cell cycle indicators or markers such as co-expressing the Fucci cell cycle reporter (Sakaue-Sawano et al., 2008), DNA staining with Hoechst 33342, anti-phosphorylated Histone-3 at Serine-28 (M phase marker) or any other cell cycle markers.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200902/20200902002151_6118.jpgFigure 2. Workflow of cell synchronization and labeling of histones. Each step of cell synchronization methods (A. double thymidine block and B. mitotic shake-off) and timing of labeling of pre-existing histones are shown.Table 1. Common drug list for cell synchronizationimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200902/20200902005648_0752.jpg(iii) Detection of global and local histone incorporation using imagingA key procedure for imaging detection is to grow cells on coverslips. Specific procedures for coating of coverslips might be required for different cell types. Careful handling is important to keep the adherent cells attached to the coverslips during the entire procedure. Localization of the histone variant with specific chromatin structure can be addressed by colocalization analysis with a marker of desired chromatin structure using IF after the fixation of cells. In this case, carefully consider the choice of fluorophores and the filter setting of your microscope to avoid the incompatible bleed-through detection of fluorophores.Labeling of histone incorporation during S-G2 phase ● Timing 5 daysPlace coverslips in 12-well or 24-well plate and perform coating coverslips (e.g., 0.01% poly-L lysine, 0.01% collagen) at room temperature for 1 h. After washing 3 times with double distilled water, spread cells on coated coverslips and grow cells at least 24 h.Cell synchronization at the G1/S can be performed using double thymidine block methods (Jackman and O'Connor, 2001). Incubation time and drug concentrations must be optimized for each cell type.",
    "Synchronize the cells at the G1/S transition with a treatment of 2 mM thymidine for 16 h, release from thymidine for 9 h and treat again with 2 mM thymidine again for 17 h.? TROUBLESHOOTING (Table 2)Table 2. Troubleshooting Tableimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200902/20200902005904_8298.jpgLabel pre-existing SNAP-tagged histones with SNAP-Cell Oregon Green (1 µM) in culture medium for 30 min at 37 °C in 5% CO2.Block unlabeled pre-existing SNAP-tagged histones with non-fluorescent SNAP-substrates, SNAP-cell Block (10 µM) for 30 min in culture medium at 37 °C in 5% CO2.CRITICAL STEP: This step is important to avoid insufficient initial labeling of pre-existing histones that will result in inaccurate detection of newly incorporated histones. Add culture medium containing 10 μM of EdU and 10 μM RO-3306 and incubate for 12 h at 37 °C in 5% CO2.? TROUBLESHOOTING (Table 2)Label newly incorporated SNAP histones using SNAP-Cell TMR (1 µM) in culture medium with RO-3306 for 30 min at 37 °C in 5% CO2.Labeling of histone incorporation during G1 phase ● Timing 5 days To collect mitotic cells, a mitotic shake off can be performed.Spread cells in 100 mm dish.Synchronize the cells at S/G1 border with 2 mM thymidine for 24 h, then treat with 20-500 nM nocodazole for 12 h. Incubation time and drug concentrations must be optimized for each cell type.Check the cells forming rounding shape and weak attachment using light microscopy.CRITICAL STEP: If cells are not forming rounded shape, synchronizing at M phase is not successful.? TROUBLESHOOTING (Table 2)Gently shake the dish to collect mitotic cells into 1.5 ml Eppendorf tube or 15 ml Falcon tubes.Centrifuge the cells at 500 x g for 4 min and wash cells with a culture medium.Wash cells twice with culture medium and spread cells on pre-coated coverslips as described in Step 1.",
    "One to two hours later, check the cells if they attached to the coverslips.CRITICAL STEP: The cells must be attached to the cover glass. If not, releasing from nocodazole treatment is not successful.? TROUBLESHOOTING (Table 2)Label pre-existing SNAP-tagged histones with SNAP-Cell Oregon Green (1 µM) in culture medium for 30 min at 37 °C in 5% CO2.Block unlabeled pre-existing SNAP-tagged histones with non-fluorescent SNAP-substrates, SNAP-cell Block (10 µM) for 30 min in culture medium at 37 °C in 5% CO2.CRITICAL STEP: This step is important to avoid insufficient initial labeling of pre-existing histones that will result in inaccurate detection of newly incorporated histones. Add 10 µM of EdU and 2 mM thymidine in culture medium for 12-18 h at 37 °C in 5% CO2.Label newly incorporated SNAP histones using SNAP-Cell TMR (1 µM) in culture medium with 2 mM thymidine for 30 min at 37 °C in 5% CO2.Cell fixation, Permeabilization and Click-it EdU labeling ● Timing 2 daysFix cells with fixation buffer for 15 min at room temperature.PAUSE POINT: The fixed cells can be stored in PBS at 4 °C for up to 1 month.! CAUTION Paraformaldehyde is a hazardous solution and a cross-linking agent. Wear protective gloves and handle it under a fume hood. Permeabilize the cells with permeabilization buffer for 15 min at room temperature.Block cells using 1x PBS containing 3% BSA for 1 h and perform click-it EdU labeling as described in the manufacturer's instruction.(Optional) Immunofluorescence (IF) can be performed using the desired antibody if co-localization with histones needs to be addressed. However, cautious optimization is required for the microscope filter setup and wavelength range to avoid bleed-through from other fluorophores that co-labeled in the same cells.DNA staining with DAPI or Hoechst 33342.Mount coverslips using anti-Prolong Diamond Antifade Mountant.",
    "Detection using microscope ● Timing 1-2 daysImages can be acquired with an Olympus BX61 widefield, epifluorescent microscope using a 60x 1.4 PlanApo objective or equivalent. Filter sets for DAPI (Semrock), Cy3 (Chroma), FITC (Semrock), and Cy5 (Semrock), with an EXFO X-Cite Series 120 PC metal halide light source, Photometrics Cool SNAP HQ CCD camera, Olympus Type-F immersion oil (nd 1.516) and Molecular Devices Metamorph acquisition software or equivalent microscope set-ups are required. Images can be taken with optically sectioned using a 0.5 μm Z step, spanning a 6~10.0 μm Z depth in total depending on the thickness of each cell type. Exposure times of 10 to 200 ms are typically used to acquire each plane in the Cy3, Cy5, FITC and DAPI channels.(iv) Detection of global incorporation using flow cytometryWe also introduce the protocol addressing the global histone turnover using flow cytometry detection. Although this approach can determine the global histone kinetics, it is unable to detect the histone kinetics at specific genomic loci or chromatin architectures.Labeling of histone incorporationSpread cells in 12 of 35 mm or 60 mm dishes.Synchronize the cells at the G1/S transition by double thymidine block. Briefly, treated cells with 2 mM thymidine for 16 h, wash 3 times with 1x PBS, and release from thymidine by replacing culture medium for 9 h and treat with 2 mM thymidine again for 17 h.Label pre-existing SNAP-tagged histones with SNAP-Cell Oregon Green (1 µM) in culture medium for 30 min at 37 °C in 5% CO2.Treat cells with SNAP-cell Block (10 µM) for 30 min in culture medium at 37 °C in 5% CO2 to mask insufficient labeling of pre-existing SNAP-tagged histones with non-fluorescent SNAP-substrates.",
    "CRITICAL STEP: This step is important to avoid insufficient initial labeling of pre-existing histones that will result in inaccurate detection of newly incorporated histones. Release 6 dishes from cell synchronization for detection of 12- to 22-hour time points. Keep synchronizing other 6 dishes for detection of 2- to 12-hour time point.Incubate cells for 12 h.Release the other 6 dishes from cell synchronization for detection of 2- to 12-hour time point.Harvest cells every 2 h and store cells at -80 °C.PAUSE POINT: The frozen medium and protocol are depending on cell types. Thaw cells and wash one time with a pre-warmed medium.Label newly incorporated SNAP histones by adding culture medium with SNAP-JF646 (1 µM) to cell pellets. Pipet cells and incubate for 30 min at 37 °C water bath.Centrifuge the cells at 500 x g for 4 min at room temperature and wash twice with pre-warmed culture medium.(Optional) Commercially available Dyes detecting cell cycle (e.g., Hoechst 33342) are also optional instead of the Fucci cell cycle indicator.Detection of expression levels of Oregon green (Pre-existing histones), JF646 (newly incorporated histones), mCherry (S-G2 phase cell cycle indicator) and TagBFP (G1 phase cell cycle indicator) using Flow cytometry.BOX 1. Manual imaging Analysis workflow of global pre-existing and newly incorporated histones (see also Figure 3)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200902/20200902010258_7886.jpgFigure 3. Imaging analysis workflow. Outlines of imaging analysis to detect intensity of pre-existing, newly incorporated histones, nuclear staining (e.g., DAPI and Hoechst 33342) and EdU (S phase marker) are shown.Process all image sets to Maximum Intensity Z-projection using the batch process function as follows:Process/Batch/Macro.Choose the Input folder in \"Input…\".Choose the output folder in \"Output…\".(Optional) Put specific name in “File name contains:” if specific files in selected folder need to be processed.Put macro code “run(\"Z Project...\", \"projection=[Max Intensity]\");” in the script box.Click “Process”.",
    "It can be manually processed as follows:Open four images by dragging the files into the main interface of FIJI or following:File/Open/, then choose your image.Image/Stacks/Z Project/, then choose projection type “Max Intensity”.Define the region of interest (ROI) to measure the intensities of pre-existing and newly incorporated histones, and EdU incorporation by making a mask using nuclear staining such as DNA staining with DAPI.Duplicate the image displaying DNA staining such as DAPI.Select duplicated DAPI channel image.Image/Duplicate…  Define the nuclear area using the intensity of nuclear staining.Image/Adjust/Threshold; then choose suitable threshold method (Default can be chosen as a start), check “Dark background” and Apply.Process/Binary/Convert to Mask.(Optional) Process/Binary/Fill holes.(Optional) Process/Binary/Watershed (https://imagej.net/Nuclei_Watershed_Separation[href=https://imagej.net/Nuclei_Watershed_Separation]).Analyze/Set Measurements, check “Area”, “Mean gray value” and “Display label”, then OK.Analyze/Analyze Particles, add proper number to accomplish the selection of proper area into “Size (pixel^2)” and “Circularity”, check “Add to Manager”, then OK.Measure DAPI signal (DNA) in the masked area using Region of interest (ROI).Select channel image.Click “Measure” in ROI Manager.Measure Oregon green signal (Pre-existing histones) using ROI.Select Oregon green channel image.Click “Measure” in ROI Manager.Measure TMR-STAR signal (newly incorporated histones) signal using ROI.Select TMR-STAR channel image.Click “Measure” in ROI Manager.Measure EdU signal (Nascent DNA) using ROI.Select EdU channel image.Click “Measure” in ROI Manager.Save results and analyze.BOX 2. Analysis workflow of local pre-existing and newly incorporated histones using color profiler or RBG profiler (see also Figure 5A) Install the plugin in Fiji/ImageJ software.Open all image sets that will be compared by dragging the files into the main interface of FIJI or following:File/Open/, then choose your image.Merge these images into a single image.Image/Color/Merge Channels.Change the image type to RGB color.Image/Type/RGB color.Make a line to make a profile.Choose a line tool.Make a line.Plugins/RGB Profiler.Imaging analysis (~1 week)Steps 1-6, cell synchronization using double thymidine block and labeling pre-existing histones for imaging analysis: 4 days.",
    "Steps 7-17, cell synchronization using mitotic shake off, and labeling pre-existing and newly incorporated histones for imaging analysis: 4 days.Steps 18- 19, fixation and permeabilization of the cells: 1 h.Step 20, labeling of EdU using click-it kit: 1 h.Step 21, (optional) IF using the desired antibody to determine the histone deposition at specific chromatin architecture or factors: 3 h.Steps 22- 23, DNA staining and mount coverslips: Overnight.Step 24, microscopy imaging: 1 day.Flow cytometry analysis (~1 week)Step 25, Spread cells and cell synchronization using double thymidine block and labeling pre-existing histones: 4 days.Step 32, Release from cell synchronization and harvest cells: 2 days.Steps 34-37, labeling of newly incorporated cells and Flow cytometry analysis: 2 h."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}