{
  "id": 9981,
  "origin_website": "Jove",
  "title": "Multimodal Cross-Device and Marker-Free Co-Registration of Preclinical Imaging Modalities",
  "procedures": [
    "The software steps of the protocol are to be performed in Imalytics Preclinical, which is referred to as the \"analysis software\" (see Table of Materials). It can load volumes as two different layers called \"underlay\" and \"overlay\"18. The underlay rendering is usually used to inspect an anatomically detailed data set on which a segmentation may be based; the overlay, which can be rendered transparently, can be used to visualize additional information within the image. Usually, the signal distribution of a tracer-based modality is displayed in the overlay. The protocol requires switching the selected layer several times. This is the layer that will be affected by the editing operations. The currently selected layer is visible in the dropdown list in the top toolbar between the mouse and window icons. One can press tab to switch between underlay and overlay, or select the desired layer directly from the dropdown list. The protocol will refer to scans (or images) used to test self-consistency and determine a differential transformation as \"calibration scans\", in contrast to \"production scans\" which are subsequently used for content-generating imaging. The modalities used in the protocol are CT and PET. However, as described earlier, this method applies to all preclinical imaging modalities capable of acquiring volumetric data.\n1. Assembling the carrier and phantom\nNOTE: A suitable multimodal carrier, e.g., a mouse bed, must be available on which the phantom can be fixed. See the discussion for suggestions, frequent problems, and troubleshooting regarding this assembly.\nPrepare the fiducial markers in the phantom.\n\tNOTE: The specific preparation required varies depending on the modality and tracer used. For instance, many MRI phantoms contain cavities that need to be filled with water, whereas PET, as another example, requires a radioactive tracer.",
    "Place the phantom in the carrier and secure it with a material, such as tape, that will not impair image quality.\n\t​NOTE: The requirements for the phantom are detailed in the Introduction section.\n2. Performing calibration scans and checking self-consistency\nNOTE: This step needs to be repeated for each imaging device.\nAcquire two scans with different fields of view.\n\t\nPlace the carrier in the imaging device. Ensure it is placed in a reliable and reproducible manner.\nScan according to the device manufacturer's instructions, using a large field of view that covers the entire phantom. This image will be referred to as \"Image A\" in the following steps.\n\t\tNOTE: It is important to include all fiducials, as this scan will also be used to calculate the differential transformation matrix.\nRemove the carrier from the imaging device and replace it.\n\t\tNOTE: This step ensures the carrier's placement in the device is reliable.\nIf the imaging device does not support a limited field of view, i.e., always scans the entire field of view, one can reasonably assume self-consistency. Proceed directly to step 3.\nPerform a second scan according to the device manufacturer's instructions, this time using a significantly smaller field of view. This image will be called \"Image B\" in the following steps.\n\t\tNOTE: It is important to take two scans with different fields of view. The exact position of the field of view is not critical for image B, as long as some visible information, such as phantom structures or as many fiducials as possible, is included.\nLoad the underlay.\n\t\nOpen the analysis software.\nLoad image A as underlay: Menu File > Underlay > Load underlay. In the following dialog, choose the image file and click on open.\nIf the 3D view is not present, press [Alt + 3] to activate it.",
    "Adjust the windowing: Press [Ctrl + W] and adjust the left and right vertical bars in the following dialog so that the phantom, or depending on the modality, the tracers, can be clearly distinguished. Click on Okay to close the dialog.\nLoad the overlay.\n\t\nLoad image B as overlay: Menu File > Overlay > Load overlay. In the following dialog, choose the image file and click on open.\nChange the rendering method: Menu 3D-Rendering > Overlay mode > check Iso rendering.\n\t\tNOTE: Though tracer-based modalities like PET or SPECT are usually viewed with volume rendering, Iso rendering, in this case, allows for easier comparison of positions. The underlay was, by default, opened in Iso rendering.\nActivate the view of bounding boxes: Menu View > Show symbols > Show bounding box > Show underlay bounding box; Menu View > Show symbols > Show bounding box > Show overlay bounding box.\nCheck image alignment.\n\t\nPlace the mouse pointer on the 3D view and use [Ctrl + mouse wheel] to zoom the view so that both bounding boxes are fully visible. Hold [Alt + left mouse button] while moving the mouse pointer to rotate the view.\nSwitch the selected layer to overlay.\nAdjust the windowing and color table: Press [Ctrl + w]. In the dropdown list at the left of the following dialog, select Yellow. Adjust the range in the following dialog to a similar one that was chosen for the underlay, and then, change the setting in small steps until the yellow rendering is just visible within the white rendering. Click on Okay to close the dialog.",
    "NOTE: The rendering of Image A (underlay) is now depicted in white and surrounded by a red bounding box. The rendering of Image B (overlay) is depicted in yellow and surrounded by a yellow bounding box.\nVisually check if the imaging device and the method of placing the phantom are self-consistent as required. The phantom (or, depending on the modality, the tracers) should be fully aligned in underlay and overlay. The yellow rendering should be a subset of the white rendering.\n\t\t​NOTE: The yellow bounding box should be smaller and within the red bounding box. See the Representative Results section for visual examples. If the alignment does not match, refer to the discussion for common placement problems and troubleshooting.\n3. Calculation of the differential transformation\nLoad images of both modalities.\n\t\nOpen the analysis software.\nLoad the CT image A as underlay: Menu File > Underlay > Load underlay. In the following dialog, choose the image file and press open.\nLoad the PET image A as overlay: Menu File > Overlay > Load Overlay. In the following dialog, choose the image file and press open.\nShow multiple slice views: Press [Alt + A], [Alt + S], and [Alt + C] to show axial, sagittal, and coronal slice views.\n\t\tNOTE: While technically, one plane would be sufficient to find the fiducials, the simultaneous view of all the planes allows for better orientation and quicker navigation.\nPerform marker-based fusion.\n\tNOTE: Step 3.2 and step 3.3 are alternate methods to align underlay and overlay. Try step 3.2 first because it is easier to reproduce and potentially more accurate. Step 3.3 is a fallback if not enough markers are clearly discernible.",
    "Switch the view to only show the underlay: Menu View > Layer Settings > Layer Visibility > uncheck overlay; Menu View > Layer Settings > Layer Visibility > check underlay.\nSwitch the selected layer to the underlay.\nIf necessary, adjust the windowing: Press [Ctrl + W] and adjust the left and right vertical bars in the following dialog to better see the fiducials. Click on Okay to close the dialog.\nActivate the mouse action mode \"create marker\" by clicking the marker symbol on the vertical toolbar on the left side. The mouse pointer shows a marker symbol.\nPerform for each fiducial of the phantom: Navigate to a fiducial. To this end, place the mouse pointer over the view of a plane and use [Alt + mouse wheel] to slice through the planes. Place the mouse pointer on the center of the fiducial and left-click.\n\t\t\nThis opens a dialog in which the software will suggest a name with consecutive numbers. Keep the suggested name, e.g., \"Marker001,\" and click on ok to save the marker.\n\t\t\tNOTE: It is possible to use different names if you use the same marker names again for the overlay.\nAdjust the viewing settings to show the overlay: Menu View > Layer Settings > Layer Visibility > check overlay.\n\t\tNOTE: It is suggested to keep the view of the underlay activated, as it is helpful to stay orientated and be sure to identify the right marker in both modalities. If the two modalities are far out of sync or if the overlay is confusing, deactivate it: Menu View > Layer Settings > Layer Visibility > uncheck underlay.\nSwitch the selected layer to overlay.",
    "Adjust the windowing: If the fiducial markers are not clearly visible, press [Ctrl + W] and adjust the left and right vertical bars in the following dialog so that the fiducials can be located as best as possible. Click on Okay to close the dialog.\nPerform for each fiducial of the phantom: Navigate to a fiducial. To this end, place the mouse pointer over the view of a plane and use [Alt + mouse wheel] to slice through the planes. Place the mouse pointer on the center of the fiducial and left-click.\n\t\t\nThis opens a dialog in which the software will suggest a name with consecutive numbers. Keep the suggested name and click on ok to save the marker.\n\t\t\tNOTE: It is important to have the same name for matching software markers in underlay and overlay. This is ensured if you keep the suggested names and use the same order to create the markers in both modalities. If you change the names, make sure they match.\nActivate the views of both layers: Menu View > Layer Settings > Layer Visibility > check underlay; Menu View > Layer Settings > Layer Visibility > check overlay.\nAlign the markers of underlay and overlay: Menu Fusion > Register overlay to underlay > Compute rotation and translation (markers). The following dialog shows the residual of fusion. Note this measurement and click on ok.\nCheck the result of the alignment: The markers in the underlay and overlay should visually match. Check the discussion section for troubleshooting and notes on accuracy regarding the residual of fusion.\n\t\tNOTE: The transformation of the overlay has been changed. To display the details of the new overlay transformation, press [Ctrl + I].",
    "If marker-based fusion is not possible, perform interactive fusion. If step 3.2 is completed, directly proceed to step 3.4.\n\t\nActivate the views of both layers: Menu View > Layer Settings > Layer Visibility > check underlay; Menu View > Layer Settings > Layer Visibility > check overlay.\nActivate the mouse mode \"interactive image fusion\" by clicking on the symbol on the vertical toolbar on the left side. The symbol consists of three offset ellipses with a point in the common center. The mouse pointer now shows this symbol.\nEnsure that the settings toolbar for the mouse mode appears in the upper area below the permanent toolbar. There are three checkboxes for underlay, overlay, and segmentation. Check overlay. Uncheck underlay and segmentation.\nInteractively align the overlay to the underlay: Perform rotations and translations on the different views until the underlay and overlay are aligned as best as possible:\n\t\t\nRotation: Place the mouse pointer near the edge of a view (axial, coronal or sagittal); the mouse pointer symbol is now encircled by an arrow. Hold the left mouse button and move the mouse to rotate the overlay.\nTranslation: Place the mouse pointer near the center of a view. The mouse pointer is not encircled. Hold the left mouse button and move the mouse to move the overlay.\nCreate and save the differential transformation: Menu Fusion > Overlay transformation > Create and save differential transformation. In the following dialog, select the original overlay file and click on Open. In the second dialog, enter a file name for the differential transformation and press Save.\n\t​NOTE: The software needs the original overlay file to read the original transformation and then compute the differential transformation. We suggest saving the differential transformation matrix with a filename that specifies the imaging devices used.\n4. Production imaging",
    "Scan in both imaging devices.\n\t\nFix the sample (e.g., a sedated laboratory animal) on the carrier.\n\t\tNOTE: It is important to ensure that the position of the sample within the carrier does not change between the two scans. \nPlace the carrier in the CT device. Ensure to place the carrier in the same way as was done during the calibration scan.\nScan according to the instructions of the device's manufacturer.\nPlace the carrier in the PET device. Ensure to place the carrier in the same way as was done during the calibration scan.\nScan according to the instructions of the device's manufacturer.\nPerform application of the differential transformation.\n\t\nOpen the analysis software.\nLoad CT file as underlay: Menu File > Underlay > Load underlay. In the following dialog, choose the CT image file and press ok.\nLoad PET file as overlay: Menu File > Overlay > Load overlay. In the following dialog, choose the PET image file and press ok.\nActivate the views of both layers: Menu View > Layer Settings > Layer Visibility > check underlay; Menu View > Layer Settings > Layer Visibility > check overlay.\nLoad and apply the previously saved differential transformation matrix: Menu > Fusion > Overlay transformation > Load and apply transform. Select the file containing the differential transformation matrix you saved in the calibration process and press open.\n\t\tNOTE: This step changes the metadata of the overlay.\nSave the altered overlay: Menu > File > Overlay > Save overlay. In the following dialog, enter a name and click on save.\n\t\tNOTE: It is recommended to keep the unaltered original data and, therefore, save the overlay under a new name."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}