{
  "id": 19330,
  "origin_website": "Jove",
  "title": "Reconstruction of the Blood-Brain Barrier In Vitro to Model and Therapeutically Target Neurological Disease",
  "procedures": [
    "1. Differentiating iPSCs into iBBB cells\nNOTE: These differentiation protocols have been previously described in Mesentier-Louro et al.34.\nCoating cell culture plates\n\t\nThaw reduced growth factor (GF) membrane matrix overnight at 4 °C. Dilute 500 µL of basement membrane matrix in 49.5 mL of DMEM. Keep this solution cold to prevent premature polymerization of the coating solution.\nAdd 1-2 mL per well of a 6-well tissue culture-treated plate. Leave the coating solution on for at least 20 min at 37 °C before replacing it with the appropriate warmed culture medium.\nDifferentiation of Human iPSCs into ETV2-inducible endothelial cells\n\tTiming: 8 days\n\tNOTE: This protocol is adapted from Blanchard et al.24 and Qian et al.35. We use the doxycycline-inducible expression of the transcription factor ETV2, as described by Wang et al.36 to improve the yield. ETV2 was introduced via PiggyBac plasmid and the cells were then transfected.\n\t\nCulture iPSCs on reduced GF basement membrane matrix-coated plates in feeder-free pluripotent stem cell medium until the cells reach ~70% confluency.\n\t\tNOTE: We recommend the inducible iPSCs be maintained with selection for the PiggyBac plasmid (i.e., puromycin)\nDay 0: Dissociate the cells with a protease-collagenase mixture for 5 min. Transfer the dissociated cells into a conical tube with a 1:3 ratio of the protease-collagenase mixture to stem cell medium. Spin down cells at 300 × g for 3 min. Resuspend the cell pellet with stem cell medium and plate the cells at 20,800 cells/cm2 on reduced GF basement membrane matrix-coated plates in stem cell medium supplemented with 10 µM Y27632.\nDay 1: Replace the medium with DeSR1 [DMEM/F12 + glutamine supplement, 1x Minimum Essential Medium Non-Essential Amino Acids (MEM-NEAA), 1% penicillin-streptomycin (P/S)], supplemented with 10 ng/mL BMP4, 6 µM CHIR99021, and 5 µg/mL doxycycline.",
    "Day 3: Replace the medium with DeSR2 [DMEM/F12 + glutamine supplement, 1x MEM-NEAA, 1x N-2, 1x B-27, 1% P/S] supplemented with 5 µg/mL doxycycline.\nDay 5: Replace medium with hECSR [Human Endothelial Serum-Free Medium, 1x MEM-NEAA, 1x B-27, 1% P/S] supplemented with 50 ng/mL VEGF-A, 2 µM forskolin, and 5 µg/mL doxycycline.\nDay 7: Replace medium with hECSR supplemented with 50 ng/mL VEGF-A, 2 µM forskolin, and 5 µg/mL doxycycline.\nDay 8: Split ECs 1:3 with a protease-collagenase mixture and re-seed onto fresh reduced GF basement membrane matrix-coated plates in hECSR supplemented with 50 ng/mL VEGF-A and 5 µg/mL doxycycline.\n\t\tNOTE: This is the best time point to encapsulate ECs into iBBBs for uniform vasculature formation.\nDay 10+: Feed the cells every 2-3 days with hECSR supplemented with 50 ng/mL VEGF-A and 5 µg/mL doxycycline. Continue to split the cells 1:3 with a protease-collagenase mixture when the plates are confluent.\n\t\tNOTE: iPSC-derived ECs can be frozen at any point starting Day 8. Lift the cells, as if to passage. Resuspend the pellet in EC freezing medium [60% knockout serum replacement (KSR), 30% hECSR, 10% DMSO, 50 ng/mL VEGF-A, and 10 µM Y27632], splitting the cells 1:3, and freeze using a freezing container at -80 °C. Thaw onto reduced GF basement membrane matrix-coated plates in hECSR supplemented with 50 ng/mL VEGF-A, 5 µg/mL doxycycline.\nConfirm brain microvascular endothelial cell differentiation by immunocytochemistry using antibodies against CD31/PECAM1 or VE-cadherin (Figure 2A).\nDifferentiation of Human iPSCs into pericytes\n\tTiming: 6 days\n\tNOTE: This protocol was adapted from Patsch et al.36.\n\t\nCulture iPSCs on reduced GF basement membrane matrix-coated plates in feeder-free conditions in stem cell medium until the cells reach ~70% confluency.",
    "Day 0: Dissociate the cells with a protease-collagenase mixture for 5 min. Transfer the dissociated cells into a conical tube with a 1:3 ratio of the protease-collagenase mixture to stem cell medium. Spin down cells at 300 × g for 3 min. Resuspend the cell pellet with stem cell medium and plate the cells at 37,000-40,000 cells/cm2 (depending on the cell line) on reduced GF basement membrane matrix-coated plates in stem cell medium supplemented with 10 µM Y27632.\nDay 1: Replace the media with N2B27 [50% DMEM/F12 + glutamine supplement, 50% Neurobasal, 1x MEM-NEAA, 0.5x, glutamine supplement, 1x N-2, 1x- B-27, 1% P/S] supplemented with 25 ng/mL BMP4 and 8 uM CHIR99021.\nDays 3-4: Replace the media with N2B27 supplemented with 2 ng/mL Activin A and 10 ng/mL PDGF-BB, and feed daily.\nDay 5: Split PCs with a protease-collagenase mixture and seed onto 0.1% gelatin-coated plates at 35,000 cells/cm2 in N2B27 supplemented with 10 ng/mL PDGF-BB.\n\t\tNOTE: Only split cells once confluent. Some lines might require a few more days before they are ready to split; continue to change the media daily until cells are confluent.\nExpand PCs in N2B27 supplemented with 10 ng/mL PDGF-BB, changing media every 2-3 days. Remove PDGF-BB from the media after the cells once again reach confluency and undergo a second passage.\n\t\tNOTE: Pericytes are ready to be used in iBBBs after the second passage. Once expanded, PCs can be frozen. Lift the cells as if to passage, resuspend the cell pellet in freezing media [90% KSR and 10% DMSO] and freeze using a freezing container at -80 °C. Thaw onto 0.1% gelatin-coated plates at 35,000 cells/cm2 in N2B27.\nConfirm pericyte differentiation by immunocytochemistry using antibodies against PDGFRB and NG2 (Figure 2B).\nDifferentiation of Human iPSCs into neural progenitor cells (NPCs) and astrocytes",
    "Timing: 45 days total (15 days for NPCs followed by 30 days for astrocytes)\n\t​NOTE: The NPC differentiation protocol was adapted from Chambers et al.38, and the astrocyte differentiation is as described in TCW et al.39.\n\t\nCulture iPSCs on reduced GF basement membrane matrix-coated plates in feeder-free conditions in stem cell medium until the cells reach ~70% confluency.\nDissociate the cells with a protease-collagenase mixture for 5 min. Transfer the dissociated cells into a conical tube with a 1:3 ratio of the protease-collagenase mixture to stem cell medium. Spin down cells at 300 × g for 3 min. Resuspend the cell pellet with stem cell medium and plate the cells at 100,000 cells/cm2 on reduced GF basement membrane matrix-coated plates in stem cell medium supplemented with 10 µM Y27632.\nReplace the stem cell medium the following day. Continue to feed the cells every other day until they reach >95% confluency (3-4 days depending on the cell line).\nNPC Day 0: Replace the media with N2B27 [50% DMEM/F12 + glutamine supplement, 50% Neurobasal, 1x MEM-NEAA, 0.5x, glutamine supplement, 1x N-2, 1X- B-27, 1% P/S] supplemented with 10 µM SB43152 and 100 nM LDN193189.\nNPC Days 1-9: Feed the cells daily with N2B27 supplemented with 10 µM SB43152 and 100 nM LDN193189.\nNPC Day 10: Split NPCs 1:3 with the protease-collagenase mixture and seed onto fresh reduced GF basement membrane matrix-coated plates in N2B27 supplemented with 20 ng/mL FGF-basic and 10 µM Y27632.\nNPC Days 11 - 13: Feed NPCs daily with N2B27 supplemented with 20 ng/mL FGF-basic.\nNPC Day 14: Split NPCs 1:3 with the protease-collagenase mixture and reseed onto fresh reduced GF basement membrane matrix-coated plates in N2B27 supplemented with 20 ng/mL FGF-basic and 10 µM Y27632.",
    "NPC Day 15/Astrocyte Day 0: This is Day 0 of the astrocyte differentiation. Feed the cells with complete Astrocyte medium (AM).\n\t\tNOTE: NPCs can be maintained in N2B27 supplemented with 20 ng/mL FGF-basic and passaged when confluent. To freeze NPCs, resuspend the cell pellet in freezing media [90% KSR and 10% DMSO], split the cells 1:3, and freeze using a freezing container at -80 °C. Thaw onto reduced GF basement membrane matrix-coated plates in N2B27 supplemented with 20 ng/mL bFGF and 10 µM Y27632.\nAstrocyte Days 1-30: Feed the cells every 2-3 days with AM. When cells are >90% confluent, passage using the protease-collagenase mixture and plate at 15,000 cells/cm2 on fresh reduced GF basement membrane matrix-coated plates in AM.\n\t\tNOTE: Astrocytes should be fully differentiated in 30 days. Astrocytes can be frozen in freezing media [90% KSR and 10% DMSO] in a freezing container at -80 °C. Thaw onto reduced GF basement membrane matrix-coated plates in AM at 25,000-35,000 cells/cm2.\nConfirm NPC differentiation by immunocytochemistry using antibodies against Nestin and SOX2. Confirm astrocyte differentiation by immunocytochemistry using antibodies against S100B and CD44 (Figure 2C).\n2. Assembling the iBBB\nThaw reduced growth factor (GF) basement membrane matrix overnight at 4 °C. Do not dilute this matrix in DMEM as the iBBBs are encapsulated in 100% reduced GF basement membrane matrix. Each iBBB requires 50 µL of the matrix.\nDissociate the differentiated ECs with a protease-collagenase mixture at 37 °C for 5 min. Transfer the dissociated cells into a conical tube with a 1:3 ratio of the protease-collagenase mixture to hECSR (Human Endothelial Serum-Free Medium, 1x MEM-NEAA, 1x B-27, 1% P/S). Spin down cells at 300 × g for 3 min. Resuspend the cell pellet in hECSR.",
    "NOTE: Use a conical tube, either 15 mL or 50 mL, that is large enough to accommodate the volume of dissociated cells plus media. Cells can also be divided among multiple tubes and then recombined upon resuspension.\nDissociate the differentiated PCs with the protease-collagenase mixture at 37 °C for 5 min. Transfer the dissociated cells into a conical tube with a 1:3 ratio of the protease-collagenase mixture to N2B27 (50% DMEM/F12 + glutamine supplement, 50% Neurobasal, 1x MEM-NEAA, 0.5x glutamine supplement, 1x N-2, 1x B-27, 1% penicillin-streptomycin [P/S]). Spin down cells at 300 × g for 3 min. Resuspend the cell pellet in N2B27.\nDissociate the differentiated astrocytes with the protease-collagenase mixture at 37 °C for 5 min. Transfer the dissociated cells into a conical tube with a 1:3 ratio of the protease-collagenase mixture to complete Astrocyte Medium (AM). Spin down cells at 300 × g for 3 min. Resuspend the cell pellet in AM.\nUsing a hemocytometer, count each cell type. Dilute each type of cell suspension to a final concentration of 1 × 106 cells/mL in the appropriate medium.\nCombine the calculated number of cells for each cell type in a conical tube: 50 µL of iBBB requires 2.5 × 105 ECs, 5 × 104 PCs, and 5 × 104 astrocytes. Include 10% more than the calculated number of cells to account for pipetting errors. Spin down the cell mixture at 300 × g for 3 min.\n\tNOTE: It is highly recommended to plate some leftover cells of each cell type in 2D monocultures to fix and stain for quality control of the input cells. Plate each cell type at 35,000 cells/cm2 on previously prepared plates coated with reduced GF basement membrane matrix and fix after 3-4 days. See Table 1 for cell-type specific antibodies.",
    "Aspirate medium from the cell pellet leaving approximately 50 µL of the supernatant above the cell pellet. Using a P200, gently resuspend the cell pellet in residual medium to create a single-cell slurry.\nMix the cell slurry in enough reduced GF basement membrane matrix supplemented with 10 ng/mL VEGF-A for the desired number of iBBBs at 50 µL of reduced GF basement membrane matrix per iBBB, taking care to mix the cells homogeneously while not introducing any air bubbles.\n\tNOTE: It is critical to keep the cells and reduced GF basement membrane matrix on ice at this stage to prevent premature polymerization.\nPipette 50 µL of reduced GF basement membrane matrix mixture into the well of a 48-well glass-bottom culture dish. Distribute the volume evenly throughout the bottom of the dish (Figure 1C).\nIncubate the iBBBs at 37 °C for 30-40 min to allow the reduced GF basement membrane matrix to polymerize, encapsulating the cells in the matrix.\nAdd 500 µL of AM supplemented with 10 ng/mL VEGF-A, 5 µg/mL doxycycline, and 10 µM Y27632.\nChange the medium the following day to AM supplemented with 10 ng/mL VEGF-A. Continue to change the medium every 2-3 days. After 2 weeks, stop supplementing with VEGF-A; iBBBs are ready for downstream assays after 2 weeks.\n3. Inducing cerebral amyloid angiopathy (CAA) with Aβ fibrils\nPrepare stock solutions of amyloid-β1-40 and amyloid-β1-42 at 200 µM in PBS.\nAdd Aβ to iBBB medium on 2-week iBBBs to a final concentration of 20 nM. Incubate the cells in Aβ-supplemented medium for 96 h (4 days).\nAfter 96 h, remove the medium and continue with fixing (section 4).\n4. Fixing and staining the iBBB",
    "To fix the iBBB, remove the medium, wash in 1 mL of PBS, and incubate in 500 µL of 4% paraformaldehyde overnight at 4 °C.\nRemove the 4% paraformaldehyde solution, and rinse for 4 x (at least) 15 min in 1 mL of PBS.\nPermeabilize the samples in 0.3% PBST (PBS with 0.3% Triton X-100) for 1 h at room temperature with gentle shaking.\nIncubate the cultures in blocking buffer (5% Normal Serum in 0.3% PBST) at room temperature for at least 1 h with gentle shaking.\n\tNOTE: The type of serum used is dependent on the host species for the secondary antibodies used. For example, if the host species for the secondary antibodies is goat, use normal goat serum; if the host species is donkey, use normal donkey serum. This can also be done overnight at 4 °C with gentle shaking.\nDilute primary antibodies to the recommended or determined concentration in blocking buffer.\nReplace the blocking solution with the primary antibody dilution. Make sure that the iBBBs are fully submerged in antibody solution for even incubation; 100-150 µL is enough to cover a 50 µL iBBB in a 48-well glass-bottom culture dish. Incubate overnight at 4 °C with gentle shaking.\nRemove the primary antibody. Wash iBBBs for 3 x 10-20 min in 0.3% PBS.\nDilute the secondary antibody to the recommended or determined concentration in blocking buffer. Additionally, add a nuclear stain, such as Hoechst, to the secondary antibody solution at the recommended or determined concentration.\nReplace the last PBS wash with the secondary antibody dilution. Make sure that the iBBBs are fully submerged in antibody solution for even incubation; 100-150 µL is enough to cover a 50 µL iBBB in a 48-well glass-bottom culture dish. Incubate at room temperature for 2 h with gentle shaking.",
    "NOTE: This can also be done overnight at 4 °C with gentle shaking.\nWash iBBBs 4-5x for at least 1 h per wash in PBS. Store in PBS or anti-fading mounting media at 4 °C until the samples are imaged.\nTo image on an inverted microscope, keep iBBBs in glass-bottom plates or dishes. Place a glass coverslip over the glass well to keep the iBBBs in place (Figure 1D).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}