{
  "id": 9205,
  "origin_website": "Jove",
  "title": "Neural Activity Propagation in an Unfolded Hippocampal Preparation with a Penetrating Micro-electrode Array",
  "procedures": [
    "NOTE: Animal experimental protocols were reviewed and approved by the Institutional Animal Care and Use Committee at the university. CD1 mice of either sex at the age of P10 to P20 are used in this study.\n1. Solutions for Surgery and Experimental Recording\nPrepare normal artificial cerebrospinal fluid (aCSF) buffer containing (mM): NaCl 124, KCl 3.75, KH2PO4 1.25, MgSO4 2, NaHCO3 26, Dextrose 10, and CaCl2 2. Use this normal aCSF for tissue recovery after dissection, as well as for washing system at the beginning of the experiment.\nPrepare sucrose aCSF that is used during the hippocampus dissection and contains (mM): Sucrose 220, KCl 2.95, NaH2PO4 1.3, MgSO4 2, NaHCO3 26, Dextrose 10, and CaCl2 2. In order to induce epileptiform activity in the intact hippocampal tissue preparation, add 4-Aminopyridine (4-AP) to normal aCSF at the concentration of 100 µM.\n2. Surgical Procedure for the Intact Hippocampus Preparation\nDrop isoflurane (1 ml) into the chamber at the bottom of a desiccator glass jar (No.1 in Specific Materials and Equipment) and use a regular paper towel to cover the surface of the bottom stage so the animal does not get in contact with the liquid. Then, place the CD1 mouse into the jar and close the lid. Keep the animal in the closed jar for about 1 min to 2 min. When breath frequency is about one per second, remove the mouse from the jar.\nPlace the mouse on the surgery stage and decapitate with a suitable scissors. Immediately after decapitation, place the head into the ice-cold (3-4 °C), oxygenated sucrose aCSF for about 30 sec.",
    "Use fine scissors (No.5 in Specific Materials and Equipment) to remove the skin on top of the skull and to cut the skull along the middle line of the head as well as at two ends near the temporal lobe. Use forceps (No. 6 in Specific Materials and Equipment) to peel the cut skull towards each side of the head in order to expose the brain.\nInsert a micro lab spatula (No. 8 in Specific Materials and Equipment) into the gap between the parietal lobes of the brain and skull to carefully peel the brain from the bottom of the skull and then drop it onto a prepared ice-cold (3-4 °C) surgical stage covered with wet filter paper (No.2 in Specific Materials and Equipment). Remove the cerebellum with an ice-chilled blade and separate the two hemispheres by cutting the midline of the brain. Then, place the two separated hemispheres into a beaker filled with the ice-cold sucrose aCSF bubbled with 95% O2/ 5% CO2.\nTake one half of the hemisphere and place on the ice-cold filter paper stage. Place regular paper towels or filter paper around the brain to suck the extra solution. Use two fire-polished glass pipette tools (No. 10 in Materials and Equipment) to separate the cortex from the rest of the central part of the brain.\nAfter the hippocampus is exposed from inside of the cortex and put on the ice-cold stage, place two or three drops of ice-cold sucrose aCSF on the tissue and then remove extra solution around the hippocampus. Cut the connections with the cortex at two ends of the hippocampus. Then, dissect the hippocampus out of the brain with the fire polished glass tools and remove the remaining part of the brain.",
    "Separate the whole hippocampus with its alveus side facing up and hippocampal sulcus facing down. Quickly drop two or three drops of ice-cold sucrose aCSF on the tissue again and remove the extra solution around the tissue using a piece of paper towel. Use a fire polished glass tool to turn over the whole hippocampus to expose the sulcus (Figure 1B, C).\nUnder a normal optical microscope, insert a custom made glass needle (No. 11 in Specific Materials and Equipment) into one end of the sulcus and cut the fiber connections, from dentate gyrus (DG) to subiculum or the CA1 field, along the direction of sulcus (Figure 1C). Apply an ice-cold blade to trim the septal and temporal ends of the hippocampus if necessary. Insert a custom made metal wire loop (No. 12 in Specific Materials and Equipment) into the cut sulcus and pull over the DG away from the tissue while holding the subiculum/CA1 end of the hippocampus by a fire polished glass tool (Figure 1D).\nFollowing the unfolding procedure above, add another two or three drops of the ice-cold sucrose aCSF onto the tissue and remove the extra solution around the tissue. Then, trim the unfolded hippocampus with the ice-cold blade at the edges (Figure 1E) and place the preparation by a spatula into the recovering chamber filled with normal aCSF and bubbled with 95% O2/ 5% CO2 at RT (about 25 °C). Leave the unfolded hippocampus tissue to recover about 1 hr before placing it into the recording chamber.\nTake the other brain hemisphere and use it to go through steps from 2.5 to 2.9. Usually, take about 1 to 2 min to finish the whole procedure to unfold a single hippocampus and drop ice-cold sucrose aCSF continuously to keep the tissue oxygenated and hydrated.",
    "3. Experimental System Setup\nGlue a custom fabricated PMEA on a pin grid array (PGA) package and use micro wire bonding to connect each pad from a single microelectrode to the pad of a pin on the package (Figure 3B). Then, insert the package into the socket on a custom-made circuit board 13.\nIndividually connect each microelectrode to its filters with band pass cut-off frequency from 1 Hz to 4 KHz and amplifiers with gain of 100 on the custom made circuit board 13. Digitize the analog output from the circuit board by an A/D converting system, and acquire and store the data on a computer.\nGlue a custom-made plastic recording chamber around the array with inlet and outlet tubing for the solution flow (Figure 4A). Use at least two bottles to keep different solutions in the system, and join and control the output tubing of the bottles by a tri-valve. Connect the output of the tri-valve to a tubing system with an IV drip chamber which is guiding the solution into the recording chamber.\nBetween the tri-valve and the inlet of the recording chamber, add an electrical heater to heat the solution to a controlled temperature (35 °C) before the solution is guided to the recording chamber. Attach the outlet of the recording chamber to a vacuum tube to collect the solution into a vacuum tube connected flask. Do not recycle any solution in any experiment in this study.\n4. Placing the Unfolded Hippocampus onto the PMEA to Record the Neural Activity",
    "To prepare the experimental setup, fill one bottle with normal aCSF and another bottle with 4-AP aCSF. In both bottles, bubble 95% O2/ 5% CO2 from the very beginning of each experiment. Use a tri-valve connector to control which solution will be selected during an experiment. Connect a vacuum tube at the outlet of the chamber to pump the solution into a dust container. Heat the pipeline before delivering it into the recording chamber and keep the solution at a controlled temperature level (35 °C).\nWhen the inlet and outlet of recording chamber are closed, use a custom made glass pipette dropper to transfer and place the unfolded hippocampus into the recording chamber. Under the microscope, position the unfolded hippocampus using a regular small paint brush while the tissue is floating in the solution. Place the unfolded hippocampus with its alveus side facing down, CA3 area pointing away, and CA1 field pointing towards the researcher.\nCarefully suck away the solution in the chamber using a vacuum pipette from the edge of the recording chamber to lower the solution level until the chamber is dried and the tissue is lowered onto the array. Then, carefully place a custom made tissue anchor (Figure 4) (No. 14 in Specific Materials and Equipment) on top of the tissue to hold the unfolded hippocampus onto the array. Put a few drops of solution into the recording chamber to refill it, and gradually open the inlet and outlet to adjust flow rate to about two drops per second in the IV drip chamber.",
    "Incubate the tissue in the recording chamber with normal aCSF for about 1 min to recover, then switch the solution supply to 4-AP dissolved aCSF and adjust the flow rate properly. Incubate the tissue in 4-AP dissolved aCSF for about 5 to 10 min and then the researcher could start the software to record the signal when spontaneous activity appears.\n5. Removing the Tissue from the PMEA After an Experiment\nControl the tissue anchor by a micromanipulator and gradually lift the tissue from the recording chamber. Shut down both inlet and outlet to stop the flow in the recording chamber. The recording chamber should be full with solution or add a few drops of solution to fill the chamber if the recording chamber is not full.\nUse a small paint brush to lift each corner of the tissue. If the tissue is not floating in the solution, then employ the vacuum tube to dry the chamber carefully with the tissue still sitting on the array. Then carefully open the inlet to gradually refill the chamber and shut down the inlet to stop the flow when the recording chamber is full. Apply the small paint brush to lift each corner of the tissue again.\nRepeat step 5.2 until the tissue is detached from the array and floating in the solution. If the tissue is floating in the solution, then use the vacuum tube to suck the tissue away. Open the flow in the inlet and open the vacuum in the outlet. Wash the system with distilled water and dry it out.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}