{
  "id": 6091,
  "origin_website": "Bio",
  "title": "Quantification of Salicylic Acid (SA) and SA-glucosides in <em>Arabidopsis thaliana</em>",
  "procedures": [
    "Sample preparationHarvest and weigh 10 day-old Arabidopsis plantlets with fully developed cotyledons, leaf primordia, and hypocotyls, as shown in Figure 1. Transfer 400 mg fresh material (corresponding to ~250 plantlets) to a mortar, which was pre-cooled with liquid nitrogen, and grind to a fine powder under liquid nitrogen. Transfer this powder to a 2 ml microcentrifuge tube. Add 1.6 ml of 70% aqueous EtOH (v/v) and 32 µl o-anisic acid (OAA) stock solution (15.25 ng/µl; Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180514/20180514194727_6916.jpgFigure 1. Flowchart for the preparation of SA-containing samplesVortex for 1 min.Centrifuge in a microcentrifuge for 10 min at 10,000 x g at room temperature.Transfer supernatant to a 15 ml centrifuge tube.From now on, use a fume hood. Add 1.6 ml of 90% aqueous MeOH (v/v) to the remaining pellet.Vortex for 1 min for re-extraction.Centrifuge in a microcentrifuge for 10 min at 10,000 x g at room temperature.Add this supernatant to the previous supernatant in the 15 ml centrifuge tube from Step A4.The pooled, clear supernatants contain free SA and SA-glucosides (Figure 1).Extraction of free SATransfer 2 ml of the cleared supernatants to 2 ml microcentrifuge tubes (Figure 1).Evaporate alcohol (EtOH and MeOH) in a vacuum concentrator (without heating) for ~1.5 h.Transfer the remaining supernatant from the 15 ml centrifuge tube to the same 2 ml tube as used in Step A1.Continue evaporating the alcohol (EtOH and MeOH) in the vacuum concentrator for ~1.5 h.To the remaining aqueous solution (~600 µl) in the 2 ml microcentrifuge tube, add 65 µl of 20% aqueous TCA (w/v).Add 650 µl of a 1:1 (v/v) mixture of ethyl acetate and cyclohexane. Vortex for 30 sec.Centrifuge in a microcentrifuge for 2 min at 10,000 x g at room temperature for phase separation.Transfer the upper organic phase to a new 2 ml microcentrifuge tube.",
    "Re-extract the aqueous phase with 650 µl of the ethyl acetate-cyclohexane mixture.Centrifuge in a microcentrifuge for 2 min at 10,000 x g at room temperature for phase separation.Pool the organic phases in the new 2 ml centrifuge tube. They contain free, unconjugated SA. Store the aqueous phase for the treatment of SA-glucosides at 4 °C.Evaporate the solvents to dryness in a vacuum concentrator for ~30-45 min.Solubilize the dry residue in 100 µl of 10% aqueous MeOH (v/v) containing 0.1% aqueous TFA (v/v), vortex for 1 min. This fraction is ready for HPLC analysis (= free, unconjugated SA) (Figure 1).Extraction of hydrolyzable SATo the aqueous phase (B12; ~0.6 ml), add 0.5 volumes (~0.3 ml) of HCl (37%, 12 M) to obtain a final HCl concentration of 4 M (Figure 1).Secure the tubes with microcentrifuge tube locks and heat them for 1 h at 80 °C in a dry bath heating block. Let cool down to room temperature for 20 min.Add 0.02 volumes (18 µl) of 50x OAA stock solution.Add 1 volume (0.9 ml) of the 1:1 ethyl acetate–cyclohexane (v/v) mixture.Vortex for 30 sec.Centrifuge in a microcentrifuge for 2 min at 10,000 x g at room temperature for phase separation.Transfer the upper phase to a new 2 ml microcentrifuge tube.Re-extract the aqueous phase with 1 volume (0.9 ml) of the 1:1 (v/v) mixture of ethyl acetate and cyclohexane.Centrifuge in a microcentrifuge for 2 min at 10,000 x g at room temperature for phase separation.Pool the organic phases in the 2 ml centrifuge tube. They contain SA, which results from the acidic hydrolysis of SA-conjugates.Evaporate to dryness in a vacuum concentrator for ~30 min.Solubilize the dry residue in 100 µl of 10% aqueous MeOH (v/v) containing 0.1% aqueous TFA (v/v), vortex for 1 min.",
    "This fraction is ready for HPLC analysis (= total hydrolyzable SA) (Figure 1).SA quantification by HPLCSeparations by HPLC are performed on a C18 column (250 x 4.6 mm, 5 µm) using a linear aqueous MeOH gradient from 10% to 82% (v/v), at a flow rate of 1 ml/min, over 30.4 min. Solvents contain 0.1% TFA (v/v) to maintain the protonated form of carboxylic acids. The column is maintained in an oven set at 30 °C. Eluates pass first the diode array detector, then the fluorescence detector.Inject 20 µl samples (B14 and C12) into the HPLC system. SA elutes at 25 min, OAA at 20 min. Determine the presence of SA and the internal standard with peak validation according to typical UV spectra (Figures 2A and 2B). Quantify with fluorimetric detection (excitation at 305 nm; emission at 407 nm) and determine areas under the corresponding peaks (Figures 2C and 2D). Using the peak area, apply the standard curve and linear equation to determine the amount (ng) of SA and of OAA in the injected 20 µl. Determine the correction factor by comparing the theoretic amounts of OAA in the samples with the experimentally measured ones. Multiply the measured SA amounts with this correction factor, calculate SA amounts (before and after hydrolysis), and express them as ng (SA and SAG/SGE, respectively; Note 5) per gram of cotyledon fresh weight as shown by Quentin et al. (2016).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180514/20180514195202_9858.jpgFigure 2. UV spectra for SA (A) and OAA (B), and chromatograms of fluorescence-detected free SA (C) and SA-hydrolysates (D) in extracts from Arabidopsis seedlings, four days after inoculation with the Hyaloperonospora arabidopsidis isolate Waco 9Calibration curves for SA and OAAPrepare five solutions containing SA and OAA at different concentrations, ranging from 0.1 µg/ml to 5 µg/ml in 10% aqueous MeOH (v/v) containing 0.1% TFA (v/v).",
    "Inject 20 µl from each preparation, run the linear gradient and detect as described in Step D1. Repeat two times.Using the chromatography data system software, integrate the area under the peaks at 20 min (OAA) and 25 min (SA) for every concentration. Plot a graph of peak area versus ng of injected SA and OAA. Calculate the equation of the trend line using linear regression analysis (R2 must be > 0.98)."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}