{
  "id": 19967,
  "origin_website": "Wiley",
  "title": "Blue Native Polyacrylamide Gel Electrophoresis (BN-PAGE) for the Analysis of Protein Oligomers in Plants",
  "procedures": [
    "Oligomerization of proteins controls numerous biochemical features, such as the stability of proteins and the activity of enzymes, immune receptors, and ion channels (Gell, Grant, & Mackay, 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20107#cppb20107-bib-0005]). Gel filtration and blue native polyacrylamide gel electrophoresis (BN-PAGE) are the two principle approaches to studying native protein oligomerization in vitro and in vivo (Fiala, Schamel, & Blumenthal, 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20107#cppb20107-bib-0004]; see Current Protocols article; Irvine, 2001[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20107#cppb20107-bib-0006]; Wittig, Braun, & Schägger, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20107#cppb20107-bib-0012]). Compared to gel filtration, which requires special equipment and large quantities of protein, BN-PAGE is much more sensitive and uses easily available conventional protein gel electrophoresis equipment, while at the same time requiring lower protein quantities. In addition, BN-PAGE can be employed to detect dynamic protein oligomerization when the protein complexes are relatively stable upon different treatments.",
    "By taking advantage of Coomassie Brilliant Blue R-250 or G-250 dye to render a net negatively charged protein, BN-PAGE gel is able to separate proteins in their native conformations, regardless of the different isoelectric points of different proteins (Crichton, Harding, Ruprecht, Lee, & Kunji, 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20107#cppb20107-bib-0001]). Based on their sizes, the protein molecules or complexes migrate to a position where the pore sizes of the gradient gel become restrictive. Combined with a downstream immunodetection approach, this enables determination of the molecular weights and oligomeric states of native protein complexes in plants. In this protocol, we begin with a description of procedures for isolating proteins from transgenic Arabidopsis thaliana seedlings and analyzing them by BN-PAGE and direct western blotting. We use an intracellular immune receptor nucleotide-binding domain leucine-rich repeat (NLR) protein, RPP7, as an example to illustrate how one can monitor ligand-triggered protein oligomerization in plants by BN-PAGE (Li, Habring, Wang, & Weigel, 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20107#cppb20107-bib-0007]). We also describe two dimensional sodium dodecyl sulfide–polyacrylamide gel electrophoresis (2D SDS-PAGE), in which the protein molecules are separated according to molecular mass, as an alternative to direct western blotting for further protein-complex analyses.\nMaterials\nA. thaliana seeds (transgenic seeds expressing RPP7b-FLAG and HR4-HA proteins, referred to (Li et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20107#cppb20107-bib-0007]))\n70% (v/v) ethanol\nDeionized, distilled water (ddH2O), with or without autoclaving\n½ MS medium plates (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20107#cppb20107-rec-0001])\nAppropriate chemical for induction of gene expression and attendant protein expression\nLiquid nitrogen\nNative protein extraction buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20107#cppb20107-rec-0004]; make fresh), 4°C\nNativePAGE™ 5% G-250 Sample Additive (Thermo Fisher Scientific, cat. no. BN2004)\n20× NativePAGE™ Running Buffer (Thermo Fisher Scientific, cat. no. BN2001)\n20× NativePAGE™ Cathode Buffer Additive (Thermo Fisher Scientific, cat. no. BN2002)\nNativePAGE™ 3-12% Bis-Tris Protein Gel, 1.0 mm, 10-well (Thermo Fisher Scientific, cat. no. BN2001BOX)\nNativeMark™ Unstained Protein Standard (Thermo Fisher Scientific, cat. no. LC0725)",
    "Coomassie Brilliant Blue R-250 stain solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20107#cppb20107-rec-0003])\nCoomassie Brilliant Blue R-250 destain solution (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20107#cppb20107-rec-0002])\n20× NuPAGE™ Transfer Buffer (Thermo Fisher Scientific, cat. no. NP0006)\nMethanol\nPowdered milk (Roth, cat. no. T145)\nPhosphate-buffered saline with Tween 20 (PBST; see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20107#cppb20107-rec-0005])\n8% (v/v) acetic acid\nAnti-FLAG antibody (Sigma, cat. no. F1804)\nAnti-mouse IgG–peroxidase antibody (Sigma, cat. no. A4416)\nWestern blotting detection reagent (Amersham ECL™ Prime Western Blotting Detection Reagent, GE Healthcare, cat. no. RPN2232, or Amersham ECL™ Select Western Blotting Detection Reagent, GE Healthcare, cat. no. RPN2236)\n20× NuPAGE™ MOPS SDS Running Buffer (Thermo Fisher Scientific, cat. no. NP0001)\n4× protein loading buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20107#cppb20107-rec-0006])\n100 mM dithiothreitol (DTT)\nNuPAGE™ 4-12% Bis-Tris Protein Gels, 1.0 mm, 2D-well (Thermo Fisher Scientific, cat. no. NP0326BOX)\nPageRuler™ Prestained Protein Ladder, 10 to 180 kDa (Thermo Fisher Scientific, cat. no. 26616)\nAnti-HA antibody (Roche, cat. no. 12013819001)\n1.5-ml microcentrifuge tubes (Safe-Lock Tubes, Eppendorf, cat. no. 0030120086)\nMicropestle (Roth, cat. no. CXH7.1), pre-frozen in liquid nitrogen\nMicrocentrifuge (Eppendorf 5417R), 4°C\nGel-load filter tips (Greiner, cat. no. 775288)\nXCell SureLock™ Mini-Cell (Thermo Fisher Scientific, cat. no. EI0001)\nElectrophoresis power supply (EPS 301, GE Healthcare, cat. no. 18-1130-01, or similar instrument)\nGel knife (Thermo Fisher Scientific, cat. no. EI9010)\nPlatform shaker\nImmun-Blot® PVDF membrane (Bio-Rad, cat. no. 1620177)\nMini Trans-Blot Electrophoretic Transfer Cell (Bio-Rad, cat. no. 1703930), including gel holder cassette and foam pads\nBlotting papers, grade GB003 (GE Healthcare, cat. no. 10426892)\nMagnetic stir plate and stir bar\n6 × 10–cm container\nFilm (Hyperfilm MP, GE Healthcare, cat. no. 28906844)\nFilm processor (AGFA CP 1000 LC 50 or similar instrument)\nMicrowave\nAdditional reagents and equipment for immunoblotting following 2D SDS-PAGE (see Current Protocols article; Ni, Xu, Sabanayagam, & Gallagher, 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20107#cppb20107-bib-0008])\nPlant growth",
    "1. Sterilize ∼50 A. thaliana seeds per sample in 1 ml of 70% ethanol for 2 min and then wash seeds five times with 1 ml autoclaved ddH2O each. Stratify sterile seeds at 4°C for 2 days. Then, distribute seeds across two ½ MS medium plates (one for induced expression, the other for control) and cultivate under long-day conditions (16 hr of light/8 hr of dark) at 23°C for 9 days.\n2. Spray one plate with an appropriate chemical for induction of gene expression and attendant protein expression 12 hr before the intended harvest. Harvest eight seedlings from each sample into a 1.5-ml microcentrifuge tube. Freeze samples in liquid nitrogen immediately and store at −80°C until use.\nFor different inducible promoters and different proteins, the induction time may require adjustment. We have used an estradiol-inducible promoter (Zuo, Niu, & Chua, 2000[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20107#cppb20107-bib-0013]), for which 12 hr of induction is usually sufficient.\nProtein sample preparation from transgenic A. thaliana seedlings\n3. Grind frozen samples in each microcentrifuge tube using a clean, pre-cooled micropestle to mechanically homogenize the plant tissue until it becomes a fine powder (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20107#cppb20107-fig-0001]).\nIMPORTANT NOTE: Take care to keep the samples cold during all the sample preparation steps (steps 3 to 8).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/a8dc38e5-82a8-4344-8a70-6e6d4afe1b9f/cppb20107-fig-0001-m.jpg</p>\nFigure 1\nSchematic diagram of protein sample preparation from transgenic A. thaliana seedlings.\n4. Add 100 µl cold native protein extraction buffer to each sample.\n5. Incubate samples on ice for 10 min to allow the detergent to increase protein solubilization.\n6. Centrifuge samples for 15 min at 20,000 × g, 4°C. Transfer supernatant into a new 1.5-ml microcentrifuge tube.\nBe careful to avoid pipetting plant debris.\n7. Centrifuge samples again for 15 min at 20,000 × g, 4°C. Transfer supernatant into a new 1.5-ml microcentrifuge tube.",
    "Ensure that all visible remnants of plant material are removed.\nIMPORTANT NOTE: Do NOT heat the samples prior to running a BN-PAGE gel (see below). The samples can be directly frozen in liquid nitrogen and kept at −80°C for medium-term storage (∼2 weeks).\n8. Add 0.25% NativePAGE™ G-250 Sample Additive to samples, which contain 1% DDM detergent (see step 4) (Schägger, 2001[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20107#cppb20107-bib-0009]). Mix immediately by pipetting up and down and then immediately load samples onto a BN-PAGE gel (see step 13).\nPlease note that NativePAGE™ G-250 Sample Additive is supplied at a 5% stock concentration. Do NOT include the additive if you want to store the samples at −80°C.\nBN-PAGE\n9. Combine 50 ml of 20× NativePAGE™ Running Buffer and 950 ml ddH2O to prepare 1 L of 1× NativePAGE™ Anode Buffer. Mix well.\n10. Combine 190 ml buffer from step 9 and 10 ml of 20× NativePAGE™ Cathode Additive to prepare 200 ml NativePAGE™ Dark Blue Cathode Buffer. Mix well.\n11. Use 199 ml buffer from step 9 and 1 ml of 20× NativePAGE™ Cathode Additive to prepare 200 ml NativePAGE™ Light Blue Cathode Buffer. Mix well.\n12. Rinse wells of a NativePAGE™ 3-12% Bis-Tris Protein Gel with 1 ml NativePAGE™ Dark Blue Cathode Buffer (see step 10) twice. Fill wells with NativePAGE™ Dark Blue Cathode Buffer. Place gel in an XCell SureLock™ Mini-Cell (Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20107#cppb20107-fig-0002], first and second panels).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/c09992ba-f98c-4b6e-a59b-a011ca0acd8c/cppb20107-fig-0002-m.jpg</p>\nFigure 2\nSchematic diagram of the experimental setup of BN-PAGE (A) followed by direct western blotting (B) or 2D SDS-PAGE (C).\n13. Load 10 µl of each sample (see step 8) into each well of the gel using gel-load filter tips. Add 4 µl NativeMark™ Unstained Protein Standard to an empty well.",
    "Running buffer is added only after loading the samples (see step 14) because the buffer obscures visibility and may interfere with accurate loading (Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20107#cppb20107-fig-0002], third panel).\n14. Use ∼600 ml of 1× NativePAGE™ Anode Buffer (see step 9) to fill outer buffer chamber and use 200 ml NativePAGE™ Dark Blue Cathode Buffer (see step 10) to fill inner buffer chamber.\nAdd the NativePAGE™ Dark Blue Cathode Buffer slowly and carefully to avoid sample cross-contamination.\n15. To separate native proteins, using an electrophoresis power supply, run gel at 120 V for ∼30 min, or until the dye front reaches one-third the length of the gel. Then, replace NativePAGE™ Dark Blue Cathode Buffer with NativePAGE™ Light Blue Cathode Buffer (see step 11; Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20107#cppb20107-fig-0002], fourth panel).\n16. Continue running gel at 120 V for ∼2 hr to achieve separation of proteins.\n17. Carefully open gel cassette using a gel knife. To visualize the unstained marker, cut marker lane out as a strip and stain with 30 ml Coomassie Brilliant Blue R-250 stain solution.\nAlways carefully handle the gel from the bottom; the top of the gradient gel is fragile.\nStaining can be greatly accelerated by microwaving at highest power for 20 s.\n18. Remove stain solution and gently shake with 50 ml Coomassie Brilliant Blue R-250 destain solution on a platform shaker until background becomes transparent.\n19. For the sample lanes, perform direct western blotting (see steps 20a to 34a) or cut each lane out as a strip and use each strip in perpendicular orientation for 2D SDS-PAGE (see steps 20b to 27b).\nDirect western blotting after BN-PAGE\n20a. Prepare 1 L of 1× transfer buffer by dilution of 20× NuPAGE™ Transfer Buffer (50 ml of 20× NuPAGE™ Transfer Buffer in 950 ml ddH2O) and cool buffer to 4°C.",
    "The transfer buffer for direct western blotting after BN-PAGE does not contain methanol.\n21a. Submerge Immun-Blot® PVDF membrane in methanol for 30 s to activate the membrane.\n22a. Place materials for assembling the western blotting cassette (gel holder cassette and two foam pads from Mini Trans-Blot Electrophoretic Transfer Cell, two blotting papers, activated PVDF membrane, and gel from step 19) in 1× transfer buffer (Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20107#cppb20107-fig-0002]).\n23a. Assemble cassette, avoiding air bubbles between the gel and the PVDF membrane. Insert cassette into the Mini Trans-Blot Electrophoretic Transfer Cell.\n24a. Perform blotting at 110 V for 2 hr at 4°C.\nUse an ice box or a cooling unit to prevent heating during transfer.\n25a. Prepare blocking solution by completely dissolving 2.5 g powdered milk in 50 ml PBST using magnetic stirring and store at 4°C.\n26a. Disassemble cassette after the transfer step and incubate PVDF membrane in 20 ml of 8% acetic acid for 10 min on a platform shaker with gentle shaking to fix proteins.\nThe membrane will be stained with Coomassie Brilliant Blue R-250. This is normal and does not affect immunodetection.\n27a. Wash PVDF membrane in a 6 × 10–cm container for 5 min using 10 ml PBST.\n28a. Discard PBST and incubate PVDF membrane in 10 ml blocking solution (see step 25a) for 1 hr at room temperature or overnight at 4°C on a platform shaker with gentle shaking.\n29a. Discard blocking solution and wash PVDF membrane again for 5 s using 10 ml PBST.\n30a. Discard PBST and incubate PVDF membrane with a 1:5000 dilution of anti-FLAG antibody (2 µl in 10 ml blocking solution) for 1 hr at room temperature on a platform shaker with gentle shaking.",
    "31a. Discard primary antibody solution and wash PVDF membrane for 5 min using 20 ml PBST on a platform shaker with gentle shaking. Repeat wash three times in total.\n32a. Incubate PVDF membrane with a 1:8000 dilution of anti-mouse IgG–peroxidase antibody (1.25 µl in 10 ml blocking solution) for 45 min at room temperature on a platform shaker with gentle shaking.\n33a. Discard secondary antibody solution and wash PVDF membrane for 5 min using 20 ml PBST on a platform shaker with gentle shaking. Repeat wash three times in total.\n34a. Develop film using western blotting detection reagent and a film processor.\n2D SDS-PAGE after BN-PAGE\n20b. Prepare 1 L of 1× SDS running buffer by dilution of 20× NuPAGE™ MOPS SDS Running Buffer (50 ml of 20× NuPAGE™ MOPS SDS Running Buffer in 950 ml ddH2O) and store at room temperature.\n21b. Prepare 1× protein loading buffer by dilution of 4× protein loading buffer and addition of 100 mM dithiothreitol (DTT). Incubate gel strips from Basic Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20107#cppb20107-prot-0001], step 19, in 10 ml of 1× protein loading buffer each for 10 min on a platform shaker with gentle shaking.\nPrepare ∼15 ml of 1× protein loading buffer per gel strip.\n22b. Use a microwave to heat gel strips submerged in 1× protein loading buffer at maximum power for 20 s to denature proteins. Then, incubate heated gel strips in the heated buffer for 10 min on a platform shaker with gentle shaking at room temperature.\n23b. After rinsing once with 1× SDS running buffer (see step 20b), fill 2D well of a NuPAGE™ 4-12% Bis-Tris Protein Gel with 1× SDS running buffer.",
    "24b. Carefully insert a gel strip into empty 2D (wide) well to avoid trapping of air bubbles between the gel strip and the 2D SDS-PAGE gel. Load 5 µl PageRuler™ Prestained Protein Ladder into marker (narrow) well (Fig. 2C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20107#cppb20107-fig-0002]).\nCut the gel strip such that it easily fits into the 2D well. Mark the relevant positions corresponding to the expected protein sizes on the gel cassette.\n25b. Add 100 μl of 1× protein loading buffer on top of gel strip. Place gel in the XCell SureLock™ Mini-Cell and fill instrument with 1× SDS running buffer.\n26b. Run gel at 120 V for ∼2 hr to separate the denatured proteins by size.\n27b. Perform immunoblotting using a 1:5000 dilution of anti-FLAG antibody and a 1:3000 dilution of anti-HA antibody following previously described instructions (see Current Protocols article; Ni et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20107#cppb20107-bib-0008])."
  ],
  "subjectAreas": [
    "Plant Biology"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}