{
  "id": 1819,
  "origin_website": "Cell",
  "title": "Live imaging and quantitation of insect feeding-induced Ca2+ signal using GCaMP3-based system in Nicotiana benthamiana",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparing living leaves and aphids for imaging\nTiming: 26–28 h\nThe purpose of these steps is to prepare living leaves and aphids for analyzing Ca2+ signal response.\nFill each well of sterile polystyrene 96 well-flat bottom tissue culture plates with 0.2 mL solid MS nutrients (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1298-Fig1.jpg\nFigure 1. Preparing living leaves and aphids for imaging\n(A) Fill each well of sterile polystyrene 96 well-flat bottom tissue culture plate with 0.2 mL solid MS nutrients.\n(B–D) Both cotyledons were cut off from 8-day-old GCaMP3 seedlings.\n(E) The removed cotyledons were then carefully placed horizontally in each well of the 96 well-plate by sterile forceps.\n(F and G) Three starved apterous adult aphids from the plastic petri dish were gently transferred to the cotyledon surface in each well by soft lip brush and rapidly wrapped the 96-well plate in plastic wrap to prevent the aphids from escaping. Arrows indicate that the 96-well plate was wrapped with plastic wrap.\nBoth cotyledons were cut off from 8-day-old GCaMP3 seedlings by a sterile scalpel blade (Figures 1[href=https://www.wicell.org#fig1]B–1D).\nThe removed cotyledons were then carefully placed horizontally in each well of the 96 well-plate by sterile forceps (Figure 1[href=https://www.wicell.org#fig1]E).\nCover the 96-well plate with sterile plastic wrap.\nNote: Operations are performed in aseptic condition with ultra-clean benches.\nPlace the plates in the PRX-450D incubator at 24°C–26°C with a 16 h/8 h light/dark photoperiod for 24 h.\nCritical: Physical damage, including cutting, will transiently trigger the calcium flow in leaves and affect the follow-up observation. To eliminate this effect, the removed cotyledons should be maintained on MS medium in the incubator for at least 24h.",
    "After 24 h, take out the plates from the incubator and uncover the plastic wrap for 1 h to ventilate the plate and remove the water vapor from the cotyledon surface.\nApterous adult aphids from N. benthamiana were gently transferred into an empty plastic petri dish by the soft lip brush to get starvation treatment to increase the aphid’s sap-sucking frequency.\nCritical: To increase the aphid’s sap-sucking frequency, we often starved the aphids for 4 hours before observation.\nThree starved apterous adult aphids were gently transferred to the cotyledon surface in each well (except four wells as the control group) by soft lip brush and rapidly wrapped the 96-well plate in plastic wrap to prevent the aphids from escaping (Figures 1[href=https://www.wicell.org#fig1]F and 1G).\nDetecting calcium signals using LFSM\nTiming: 2–3 h\nIn this section, the settings and parameters of microscopy for detecting GFP fluorescent, which indicates Ca2+ signal dynamic in living cotyledons, are outlined in Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1298-Mmc1.pdf].\nFor imaging experiments, we use a Leica M205 FCA fluorescence stereo microscopes (LFSM) equipped with a pair of eyepieces 10×/23B, ET GFP filter, and “thunder” image processing system (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1298-Fig2.jpg\nFigure 2. Detecting calcium signals using LFSM\n(A) Leica M205 FCA fluorescence stereo microscopes (LFSM)\n(B) Shoot the paragraphs to record the fluorescence dynamics at the area of aphid’s bites. Scale bar = 1 mm.\nOpen Leica Application Suite X (LAS X) software and set the microscope parameters as follows (Methods video S1[href=https://www.wicell.org#mmc2]):\nAcquisition mode was xyt.\nSet the filter as ET GFP.\nImages were acquired at 16 bit and with 1024 × 1024 pixels (Image Format: 2 × 2 Binning).\nExposure time is 300 ms, and the gain is 2 (Gain List: low nose & high well).",
    "Select “TL light” or “SLI light” as optical mode (choose “SLI light” mode if the microscope stage was covered by dark black paper as shown in Methods video S1[href=https://www.wicell.org#mmc2]) to operate bright-field illumination. To avoid overexposure, the intensity of TL light or SLI light should be set to a minimum degree and then gradually increased. The illumination settings of the example dataset were acquired as follows:\nTL contrast mode is TL-DF with 53 positions.\nTL light intensity is 1000.\nPlace the 96-well plate with cotyledons and aphids on the microscope stage. Adjust the zoom lens to focus the view on the samples in one well under bright-field illumination (the zoom is about 2.0–3.0) and ensure the clear observation of the leaf in the control group (Methods video S2[href=https://www.wicell.org#mmc3]).\nDetect the GFP fluorescence of leaves in the control group, and GFP fluorescence represents the background fluorescence intensity of GCaMP3 leaves.\nOnce the parameters were set appropriately, gently move the 96-well plate to focus on the samples with aphids. Set the “Exposure time” as 300 ms and define the recording time (for example, 5 min or until the calcium flow vanishes). Capture the emitted fluorescence using a Leica DFC9000 GT digital camera (sCMOS) (Methods video S3[href=https://www.wicell.org#mmc4]). Shoot the paragraphs to record the fluorescence dynamics at the area of aphid’s bites (Figure 2[href=https://www.wicell.org#fig2]B).\nNote: Control group was used to adjust LFSM parameters for eliminating the background “noise”.",
    "Critical: Since the aphids need time to adapt to the new environment, it should be patient to wait for enough time before shooting. To precisely capture the moment of aphid’s bites, it’s better to observe the aphids’ moment and their antenna. Aphid always keeps moving except for sucking, and they would sway their antenna backward to bodies when they are biting the leaves. Therefore, these behavior signatures could indicate the following “bites”.\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Display the step-by-step operation of microscope, related to steps 9–11\n    Your browser does not support HTML5 video.\n  \nMethods video S2. Focus the view on the sample in one well under bright-field illumination, related to step 12\n    Your browser does not support HTML5 video.\n  \nMethods video S3. Shoot the paragraphs and capture the emitted fluorescence from leaf, related to steps 13–14\nExporting video and analyzing Ca2+ signaling using LFSM software\nTiming: 2–3 h\nThe purpose of these steps is to export video and quantify Ca2+ signaling using LFSM software.\nThe steps for generating and exporting a video by LFSM software are outlined below (Methods video S4[href=https://www.wicell.org#mmc5]):\nOpen the LAX software (3.3.0.16799), choose the “Standard Configuration” pattern, and click the “OK” button (Figure 3[href=https://www.wicell.org#fig3]A).\nIn the next window, select “Open Project” in settings and load files of interest with the suffix.lif (Figures 3[href=https://www.wicell.org#fig3]B and 3C).\nClick on “Process” – “Show Gallery” (status bar on the right) on the graphical user interface to view the captured images (Figures 3[href=https://www.wicell.org#fig3]D and 3E).\nClick on “Annotations” to add directive symbols on pictures (Figure 3[href=https://www.wicell.org#fig3]E).\nSelect the start image of the video, click on “Set Start” in the middle menu (Figure 3[href=https://www.wicell.org#fig3]F).\nIn the same way, select the last image and click on “Set End” (Figure 3[href=https://www.wicell.org#fig3]G).",
    "Note: To view an image clearly from the gallery, you can double click on the selected image to enlarge it (Figure 3[href=https://www.wicell.org#fig3]E).\nApplying the settings, a new file containing the frames from “start image” to “end image” was generated.\nRight-click on the new file and select “Export” - “As MPEG-4” - “Frames/sec” to export the video (Figures 3[href=https://www.wicell.org#fig3]H–3I and Methods video S5[href=https://www.wicell.org#mmc6]).\nNote: The larger number filled in “Frames/sec” would compress the file into a faster video.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1298-Fig3.jpg\nFigure 3. Overview of exporting videos using LFSM software\n(A–C) Open the LAX software and load files of interest with the suffix.lif.\n(D–G) Click on “Process” – “Show Gallery” to view the captured images. Select the start image of the video, click on “Set Start” in the middle menu. In the same way, select the last image and click on “Set End”. A new file containing the frames from “start image” to “end image” was generated.\n(H–I) Right-click on the new file and select “Export” - “As MPEG-4” - “Frames/sec” to export the video.\nThe steps for analyzing Ca2+ signaling by LFSM software are outlined below (Methods video S6[href=https://www.wicell.org#mmc7]):\nOpen the LAX software and load in the newly generated video (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1298-Fig4.jpg\nFigure 4. Overview of analyzing Ca2+ signaling by LFSM software\n(A) Open the LAX software and load in the newly generated video.\n(B) Click the “Stack profile” button in the pulldown menu of “Tools” and tick the box “All in one”. Therefore, any selected region would be marked in every frame at the same position, and the fluorescence value of the selected region in every frame would be analyzed, respectively.\n(C) Choose the shape of the selected region and select the aphid biting area.",
    "(D) Right-click on the curves and select “Export”, “Excel” to export all fluorescence values and its corresponding time data of the selected region in every frame as an excel file.\n(E) The [Ca2+]cyt signature variation in leaf during aphid feeding. Data are mean ± SD.\nDouble click the video in the left status bar and select the “Quantify” module. Then click the “Stack profile” button in the pulldown menu of “Tools” and tick the box “All in one”. Therefore, any selected region would be marked in every frame at the same position, and the fluorescence value of the selected area in every frame would be analyzed respectively (Figure 4[href=https://www.wicell.org#fig4]B).\nClick the Rectangle or Oval icon in the upper right toolbar to choose the shape of the selected region. Then, drag the mouse button to select an area, and the fluorescence value will be displayed in the selected region. Meanwhile, in the middle area of the interface, the mean intensity of fluorescence value of the selected region in every frame will be presented as a numerical point, and the points will be automatically linked as a curve with one color (Figure 4[href=https://www.wicell.org#fig4]C).\nThe repetitive operations should be done to select multiple regions (closed to Ca2+ flux occurring position). There will be multiple curves with different colors in the middle area of the interface. Right-click on the curves, select “Export” and “Excel”, and export all fluorescence values with its corresponding time data of the selected region in every frame as an excel file (Figure 4[href=https://www.wicell.org#fig4]D).",
    "To calculate the fractional fluorescence changes (ΔF/F), the equation ΔF/F = (F − F0)/F0 was used, where F0 denotes the average baseline fluorescence determined by the average of F over the first 5 frames of the recording before aphids feeding. “F” means the fluorescence value. Every single selected region owns a ΔF/F ratio. Average the ratios of multiple regions and collect the data.\nThose data would be analyzed and made into Ca2+ flux dynamic curve mode by Prism7 software (Figure 4[href=https://www.wicell.org#fig4]E).\n    Your browser does not support HTML5 video.\n  \nMethods video S4. Generate and export a video by LFSM software, related to step 15 and Figure 3\n    Your browser does not support HTML5 video.\n  \nMethods video S5. Lively imaging aphid’s piercing-sucking induced Ca2+ flux dynamic in GCaMP3 N. benthamiana leaves, related to step 15 and Figure 2B\n    Your browser does not support HTML5 video.\n  \nMethods video S6. Analyze Ca2+ signaling by LFSM software, related to step 16 and Figure 4"
  ],
  "subjectAreas": [
    "Signal Transduction",
    "Microscopy",
    "Plant Sciences",
    "Model Organisms"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Ecology & Environmental Biology",
    "Bioengineering & Technology"
  ]
}