{
  "id": 9200,
  "origin_website": "Jove",
  "title": "An Assay for Measuring the Effects of Ethanol on the Locomotion Speed of Caenorhabditis elegans",
  "procedures": [
    "1. Steps to Perform on the Day before the Assay\nPick L4 stage worms to fresh nematode growth medium (NGM) plates seeded with a lawn of OP50 E. coli, and culture them at 20 ˚C O/N. Each assay condition requires 10 worms; pick an excess of worms to allow for O/N loss of worms.\n\t\nOnly assay animals that are first-day adults; many mutants grow at a slower speed than wild type. Adjust the timing of picking for strains that have developmental delays so that all animals tested are first-day adults.\n2. Steps to Perform on the Day of the Assay\nPreparation for the assay:\n\t\nPerform assays on standard unseeded 60 x 15 mm NGM plates. Dry all of the plates to be used at 37 ˚C for 2 hr, with lids off. For each experimental trial, use four dried NGM plates; these will be the 0 mM and 400 mM ethanol assay plates and their accompanying acclimation plates.\n\t\tNOTE: The use of NGM plates is important here; differences in the composition of the plates, in particular their osmolarity, can strongly affect the dose response of ethanol on behavior, this is due, at least in part, to changes in the amount of ethanol accumulated by the animals20. NGM agar is 160 mOsm.\nAfter drying, weigh each of the unseeded NGM plates to be used in the assay and note the weight. Determine the volume of media in the plates based on the weight of an empty plate. To approximate the conversion of weight of the agar to volume, assume that the media weighs the same as an equal volume of water.",
    "NOTE: Our most consistent results have been found with NGM media that has dehydrated sufficiently that an original 10 ml volume has a post-drying volume between 8.3–8.9 ml. An alternative to the 2 hr dry time is to dry until the plates reach this volume range to account for differences in incubators.\nMelt 4 copper rings (inner diameter of 1.6 cm) into the surface of each of the plates to act as corrals for the different genotypes or treatment groups of worms.Grasp each ring with forceps, and heat in a flame (a strong flame from a Bunsen burner works well) for approximately 3 sec. Immediately place the ring on a plate while still holding the ring with the forceps to prevent it from ‘skipping’.\n\t\t\nEnsure that the ring rests flat against the surface of the agar by pressing down gently with the forceps at several points on the ring. When placing the ring, be careful to leave room for an additional three rings.\nMelt the three additional copper rings into the surface of the plate, taking care to place them as close together as possible so that all four will be in the field of view of the camera.\n\t\t\tNOTE: Making a good seal with the agar is essential to keep the worms in the rings during the assay. Rings that skip around on the plate are unlikely to make the correct seal with the agar and may scar the agar, which allows worms to burrow and interferes with visualizing the worms.\nFor each assay plate prepare an accompanying “acclimation” plate, which should be dried and unseeded and will receive no ethanol. Place four copper rings on these plates.",
    "Label the bottom of the plates next to each ring with the worm strain to be used in the ring, taking care to not write in the field of view of the ring itself. Match the labels on the assay plate with its accompanying acclimation plate.\nCalculate the amount of 100% ethanol to add to each assay plate so that the final concentration is 0 mM or 400 mM ethanol (weight to volume). For each experiment (n = 1), there will be one 0 mM and one 400 mM ethanol plate; acclimation plates do not receive ethanol. Add the ethanol, pipetting it around the surface of the plate. Use laboratory film to seal the plate and allow it to equilibrate on the bench top for 2 hr.\nWhen 1.5 hr has elapsed, begin the acclimation step of the assay, step 2.2.\nPerform locomotion assay: Assay plates\n\t\nCarefully transfer 10 worms of each experimental group to the center of a copper ring on the acclimation plate. Remove any food that is visible on the agar at this point by scraping gently with the worm pick. Vary the order in which the experimental groups are put on the plates across experimental trials so that the same strains are not put on the plates in the same order across trials.\n\t\tNOTE: The goal is to transfer the animals to the plate with minimal quantities of food, because if food on the acclimation plate is transferred to the assay plate the worms will aggregate around the food and the effect of the drug on locomotion will be obscured.\nBe careful not to break the surface of the agar with the pick, as this will allow the worms to burrow and will disrupt the assay. Incubate the worms at RT for 30 min.",
    "Ensure that there is an appropriate interval between the initiations of each plate. An experienced experimenter can move 40 animals, 10/ring for 4 rings in < 1.5 min, but any interval up to 2 min is acceptable. The standard assay has movies recording at 10-12 min and 30-32 min of exposure for both 0 mM and 400 mM ethanol.\nInitiate the acclimation plate for the 0 mM exposure and the acclimation plate for the 400 mM exposure approximately 2 min and 30 sec apart to allow for saving of the first movie file before the second movie must begin.\nAfter the 30-min acclimation period, transfer the worms from the acclimation plates to the assay plates. Transfer the worms to the assay plates (0 mM or 400 mM ethanol) in the same order that they were added to the acclimation plate, keeping track of the timing between the completions of each plate. Seal the plate with laboratory film to minimize loss of ethanol to vaporization.\nUse a scooping motion with a thin-edged flattened worm pick to collect worms on top of the flattened pick. Perform the transfer of worms from the unseeded acclimation plate to the assay plate without the use of bacteria, which is commonly used in transferring worms as it helps to glue the worm to the pick.\n\t\tNOTE: The speed at which animals are transferred at this step is very important because the first worms on the plate will be exposed to ethanol longer than the last worms added to the plate, and earlier time points may show some time-dependent effects. This is the major reason for rotating which strains are placed on a plate first across experimental replicates.\nPerform Locomotion Assay: Filming",
    "Use a microscope/camera combination that allows for simultaneous imaging of all four rings in the field of view (approximately 42x42 mm2 square), such as a 0.5x microscope objective, 0.8x magnification and a camera with a 2048x2048 7.4 µm pixel CCD.\nUse even illumination across the field of view, which aids in object recognition at the intensity threshold step (see below). A 3”x3” backlight works well.\nImage the worms on a plate positioned media-side up (lid down), which generates contrast that is lost when using the backlight compared with a traditional microscope transmitted light source.\nPrepare the image analysis software to capture time-lapse movies of the moving worms. Set the software to capture 12-bit gray-scale images every 1 sec, as a 2-min (120 frame) movie. To reduce the size of the output file, while still retaining sufficient image resolution, use a 2x2 binning mode to capture 1024x1024 pixel images.\nRecord the movies. Begin recording a 120-frame movie of the first plate (0 mM ethanol) 10 min after the last worms were placed on that plate. Save the movie file.\nRecord the second plate (400 mM ethanol). Repeat this process for both plates beginning 30 min after the last worms were placed on the first plate (0 mM ethanol) to capture the 30–32 min time points for each exposure.\n\t\tNOTE: Allow sufficient time to save the image files after each capture session before beginning recording of the next plate to be analyzed.\nFor future-proofing of archived movies and to allow these movies to be opened and analyzed by other public domain open source imaging software programs, such as ImageJ28, convert a copy of each movie to 8-bit 256 gray scale TIFF files.\n\t\tNOTE: The image analysis software described here uses a proprietary file format.\nAnalysis of movies using ImagePro software.",
    "Once captured, analyze the movies using Image-Pro Plus software or its equivalent.\n\t\tNOTE: A variety of other object tracking software is available that has been used to successfully track multiple C. elegans at one time29 and such software could reasonably substitute for that described here as the object identification steps are based on similar principles. The method described relates to Image-Pro Plus software versions 6.0-6.3 and 7.0, newer versions of Image-Pro Plus software may have minor differences.\nAnalyze movies in 2-min (120 frame) segments. First, apply a filter to the images to flatten the background and enhance the contrast of the worm objects. Select the filter as follows: Menu>Process>Filters>Enhancement>Flatten: Parameters: Background = Dark; Feature Width = 20 Pix.\nRe-save the movies after the filtering step but always retain the original movie in its unfiltered form.\n\t\t\nAnalyze the locomotion of animals in each ring separately with a circular region of interest (ROI) that is placed and sized to overlap with the copper ring. Identify and track the worms with the Menu>Measure>Track Objects… command; this brings up the Tracking Data Table window. The Tracking Options button allows specific tracks to be excluded and to limit any experimental artifacts.\nUnder the Auto Tracking tab, use the following parameters: Track Parameters: Velocity limit (search radius) = 400 µm/frame, Acceleration limit = Auto, Minimum total track length = 400 µm, Predominant motion type = chaotic; Objects in tracks parameters: Allow partial tracks = yes, Min length = 21 frames, Tracking prediction depth = 1 frame.",
    "To initiate the tracking process, click the Find All Tracks Automatically function button to bring up the Count/Size options dialog box and the Tracking dialog box. Select the Manual option for the Intensity Range Selection in the Count/Size dialog box, which provides the important threshold step that uses the gray-scale intensity of the worm pixels to highlight a worm object for analysis and to ignore the lighter background pixels.\n\t\t\nAdjust the intensity threshold sliders (one to set the upper limit, one to set the lower limit) to create an inclusive range that highlights all dark objects. A range of 0–1,500 on a scale of 0–4,095 is a good starting point for finer tuning.\nApply a size filter to exclude objects that are larger and smaller than a single worm object, such as the copper ring and any debris on the plates. Set two size parameters to do this that cover sizes for individual worms in a variety of postures with the Measure>Select Measurements menu item on the Count/Size options dialog box. (Area range: 28,000–120,000 µm2 and Perimeter range: 600–2,500 µm).\nIf a mutant strain is significantly smaller or larger than other animals on the plate to be analyzed, broaden the range of the filter settings for object recognition to accommodate the different sizes of the strains first before tracking animals so that settings do not need to be changed mid-analysis.\nComplete the tracking process by clicking Continue in the Tracking dialog box. Visually compare the output tracks with the progress of each worm in the movie to ensure that every worm is represented unless there is a valid reason to exclude it based on the automatic filter settings. Manually delete tracks that were produced by the presence of confirmed non-worm objects that met the size filter criteria.",
    "Use the software to calculate the velocity of each worm between each frame (distance traveled for the centroid of an object per 1 sec between frames) and display the average velocity for each track and the average velocity across all tracks for the population of worms in the copper ring. Consider this final average to be n = 1 in terms of experimental trials. Export the data to a spreadsheet program for statistical analyses and data archiving.\nOnce the data has been recorded for the first ring on the plate, move the ROI to the next ring and repeat the tracking process, without changing any of the parameters.\nCalculate relative speed of locomotion through:\nRelative speed (%) = treated (400 mM) speed/ untreated (0 mM) speed x 100.\n\t\tNOTE: Different genetic manipulations often alter the basal locomotion rate of animals. In order to determine the effect of ethanol on the locomotion speed of animals and to be able to compare these effects across different genotypes or conditions, calculate a relative speed.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}