{
  "id": 18296,
  "origin_website": "Jove",
  "title": "Nerve-sparing Mid-urethral Obstruction (NeMO) in Female Small Rodents",
  "procedures": [
    "The following experimental protocol was approved by the institution's animal care committee.\n1. NeMO in Female Rats\nPreparation\nPlace a female Sprague-Dawley rat weighing around 200 g under 3% isoflurane anesthesia, weigh the animal, and shave and disinfect the prepubic area 3 times using an iodine surgical scrub.\nOn a heating pad, tape hind limbs and tail down and catheterize the bladder with a 20-gauge angiocatheter, which is also gently taped down to prevent sliding.\nDissection\nUse a scalpel to perform an 8 mm longitudinal skin incision from the palpable pubic symphysis towards the urethral meatus. Lift off the skin on either side to facilitate later wound closure.\nDissect bluntly to identify the stented urethra by longitudinal spreading with fine scissors. Place fine self-retaining skin hooks to enhance exposure of the urethra.\nPerform some gentle longitudinal spreading using curved scissors dorsal to the urethra to develop the plane between urethra and vagina. Then, bluntly pass a 4-0 silk suture behind the urethra and prepare the double throw of a surgeon's knot.\nPartial urethral obstruction\nRemove the angiocatheter, place a 0.9 mm metal rod parallel to the urethra, and then tighten the knot around urethra and metal rod, so that the latter still slides out easily thereafter.\nSecure the knot with 3 more throws using gentle tension before removing the rod. Cut the suture ends about 3 mm long, or 4 mm if later release of obstruction is part of the experiment.\nWound closure\nApproximate the paraurethral glands using a buried single stitch of absorbable braided suture 4-0.",
    "Close the skin with a buried horizontal mattress stitch using the same absorbable suture. Note: While it may seem unconventional to use an absorbable suture for a skin-penetrating stitch, we did not encounter complications such as wound infections, and that suture removal can be avoided.  \nAfter care\nInject buprenorphine 0.1 mg/kg subcutaneously before placing the rat in a recovery cage.\nOffer some soft recovery diet for the first 24 h to the single housed rat. After this period, house animals again in the same pairs as before the procedure provided they are doing well and belong to the same treatment group.\nCheck the rats daily for bladder size and general well-being; record their weight at least weekly.\n2. NeMO in Female Mice\nPreparation\nPlace a female C57bl/6 mouse weighing around 18 g and proceed as detailed in step 1.1.1.\nProceed as detailed in step 1.1.2, except use a 24-gauge angiocatheter.\nDissection\nUse a scalpel to perform a 6 mm longitudinal skin incision from the palpable pubic symphysis towards the urethral meatus.\nDissect bluntly to identify the stented urethra by longitudinal spreading with fine scissors. Lift off the neuro-vascular bundle running ventrally on the urethra by analogous blunt dissection.\nPerform some gentle longitudinal spreading using curved scissors dorsal to the urethra to develop the plane between urethra and vagina. Then, bluntly pass a 5-0 non-absorbable braided suture behind the urethra and prepare the double throw of a surgeon's knot.\nPartial urethral obstruction\nConnect the angiocatheter with a 1 mL syringe and inject 0.1 mL of normal saline into the bladder.\nPlace a 26-gauge cannula parallel to the urethra. Gently tighten the knot around urethra and cannula while pulling back the angiocath.\nSecure the knot with 3 more throws using gentle tension before removing the cannula.",
    "Test for urine appearing at the meatus upon gentle pressure on the animal's bladder; loosen the tie if unable to express urine. Otherwise, cut the suture ends about 3 mm long.\nWound closure\nClose the skin with a buried horizontal mattress stitch using a 5-0 braided absorbable suture.\nAfter care\nInject 0.1 mg/kg buprenorphine subcutaneously before placing the mouse in a recovery cage.\nOffer some soft recovery diet for the first 48 h to the single housed mouse. After this period, house animals again in the same groups as before the procedure provided they are doing well and belong to the same treatment group.\n\t\tNOTE: Mice with a palpable distended bladder 24 h after the procedure that do not void when handled are over-obstructed and will die within the next 1 - 2 days unless taken back under anesthesia for removal of the obstructing ligature.\nCheck the mice daily for bladder size and general well-being; record their weight at least weekly.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}