{
  "id": 2127,
  "origin_website": "Cell",
  "title": "Protocol for printing 3D neural tissues using the BIO X equipped with a pneumatic printhead",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparing the BIO X with the bioink\nTiming: 15 min\nThis portion of the protocol includes instructions to load the BIO X printhead and complete the printer setup before printing. Proper preparation of the BIO X, including loading the printheads and using correct printer parameters, will result in production of 3D biological constructs with the highest viability and quality.\nNote: Methods video S1[href=https://www.wicell.org#mmc1] demonstrates the following steps for setting up the BIO X printer with the bioink.\nSet up the printhead (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1609-Fig3.jpg\nFigure 3. BIO X printhead and syringe setup\n(A) Pieces required for printhead syringe setup.\n(B) Syringe B with piece 1 (step 1a).\n(C) Setup required to fill syringe (step 1b).\n(D) Final set-up of syringe B (step 3).\n(E) Final set-up of syringe B and printhead (step 4).\nPlace ‘piece 1’ (Figure 3[href=https://www.wicell.org#fig3]A) into syringe B and use a thin spatula to push it to the bottom of the syringe (Figure 3[href=https://www.wicell.org#fig3]B).\nPiece 1 should be level inside the syringe and air should not be able to escape between the syringe and piece 1\nNote: Syringe B and piece 1 are the empty cartridges with end and tip caps in the key resources table[href=https://www.wicell.org#key-resources-table].\nAttach syringe A to syringe B via piece 2 (Figure 3[href=https://www.wicell.org#fig3]C).\nPour the bioink into syringe A.\nAvoid creating or adding bubbles into the syringe. Problem 1[href=https://www.wicell.org#sec6.1]: Air bubble formation.\nA small scraper can be used to remove the remaining bioink from the conical.\nUse the syringe plunger to push the bioink through piece 2 and into syringe B.\nRemove piece 2 and attach piece 3 to syringe B (Figure 3[href=https://www.wicell.org#fig3]D).\nNote: When printing into agarose, attach a blunt tip needle to syringe 2 instead of piece 3.",
    "Insert syringe B into the printhead, referred to as “Tool 1” on the BIO X (Figure 3[href=https://www.wicell.org#fig3]E).\nAttach syringe B to the pressure hose via the pressure connector above the printhead mount. Twist the pressure connecter to attach to syringe B.\nInsert syringe B into the printhead by pushing down until the syringe is fully inserted.\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Demonstration of BIO X printer setup with bioink, related to preparing the BIO X with the bioink steps 1–4\nChoosing a design and printing parameters\nTiming: 15 min\nSelect “Bioprint” on the BIO X touchscreen.\nChoose the desired model from the “Model” tab.\nShapes such as domes, cubes, and cylinders are recommended for structural integrity and printability.\nUp to three 10 × 10 mm cylinder prints at 25% infill can be printed using 1 mL of bioink and 3–5 mL of crosslinker.\nOptional: New designs can be uploaded to the BIO X using the USB port on the front panel of the printer.\nSelect the “Surface” tab and adjust the surface properties.\nChoose the desired printing surface (e.g., Petri dish, well plate), size, and vendor (if applicable).\nIf using a well plate, select the well plate icon to set the printing pattern and desired wells.\nIf printing into an agarose support bath, the 6 well culture plate is recommended.\nSelect the “Printer” tab and adjust the printing properties.\nSelect the printhead being used (e.g., Tool 1 if using the printhead on the far left).\nSet “Pneumatic 3 mL” as the tool type.\nSet Bioink profile to “CELLINK START”.\nEnsure Photo-crosslinking is set to “Off”.\nChoose a desired pressure and printing speed.",
    "When printing into an agarose support bath, a pressure of 10 kPa and a speed of 15 mm/s is suggested for the TissuePrint-HV kit.\nWhen printing directly into a cell culture plate and pre-crosslinking, a pressure of 5 kPa and a speed of 10 mm/s is suggested when printing with TissuePrint.\nSelect the “Layers” tab and adjust layer properties.\nChoose a desired layer profile.\n“Grid Lattice” is recommended.\nSelect a desired infill pattern.\nSet desired infill density.\nSelect the “Print” tab and confirm printing settings.\nPress “Save” to save printing parameters, if desired.\nPress “Print” to begin printing when satisfied with printing settings.\nNote: For images of the BIO X setup, refer to the BIO X user manual (BIO X user manual, 2019[href=https://www.wicell.org#bib3]).\nCalibrating the BIO X\nTiming: 15 min\nSelect “Calibrate” at the bottom of the screen.\nChoose “Manual Calibration” followed by the “Start” button.\nAdjust the parameters until the needle height is the desired distance from the printing surface and press “OK”.\nWhen printing into an agarose support bath, it is recommended to calibrate the needle tip to approximately 1 mm from the bottom of the well.\nWhen printing directly into a cell culture plate and pre-crosslinking, it is recommended to calibrate the nozzle tip to approximately 0.1 mm from the bottom of the well.\nTest pressure before beginning print to check extrusion.\nSelect “Pressure” from the menu.\nSelect pressure tab.\nHold down the “Test Flow” button to test extrusion.\nIf needed, adjust the pressure until the bioink extrudes at a rate of approximately 1 drop/second.\nNote: Clean off the nozzle after pressure and speed testing by gently wiping with a Kimwipe™ sprayed with ethanol before printing to remove any excess biomaterial.\nPress “Print”.",
    "Note: Refer to the BIO X User Manual for further information on printing parameters and calibration protocols manual (BIO X user manual, 2019[href=https://www.wicell.org#bib3]).\nPrinting constructs directly onto a cell culture plate and pre-crosslinking\nTiming: 20 min to 4 h\nThis step includes the instructions on how to print 3D tissue constructs directly onto cell culture plates. This method is suitable for more viscous materials that can hold their shape. Table 2[href=https://www.wicell.org#tbl2] presents the recommended printing parameters for this method.\ntable:files/protocols_protocol_1609_4.csv\nBegin the print by pressing “Print”.\nThe printhead tip should be just above (∼0.1 mm) the cell culture plate/Petri dish.\nAdjust the speed and pressure as needed to obtain a steady and even print. Problem 2[href=https://www.wicell.org#sec6.3]: Lack of or inconsistent material extrusion, problem 3[href=https://www.wicell.org#sec6.5]: Nozzle tip becomes clogged.\nOptional: If the printed construct does not hold its shape during printing, coat the well with crosslinker before printing. Troubleshooting 4[href=https://www.wicell.org#sec6.7]: Printed construct does not hold its shape during printing.\nWhen the print is finished, add crosslinker to the cell culture well using a pipette. Problem 5[href=https://www.wicell.org#sec6.9]: Nozzle tip leaks between prints.\nPipette crosslinker using a micropipette onto the edges of the well. Do not add crosslinker directly onto the 3D printed construct as this will distort the construct shape.\nAdd enough crosslinker to submerge the construct.\nLet the construct sit in the crosslinker for 2–3 min or until the printed construct has sufficiently crosslinked.\nNote: The printed construct is fully crosslinked when the material has gelled and holds its shape.\nNote: The crosslinking time may vary depending on the bioink formulation being used.\nRemove the crosslinker using a pipette.",
    "Transfer the construct to a new (pre-coated, if applicable) cell culture plate and fill the wells with cell culture media. If printing without cells, tris-buffered saline (TBS) can be used. Preparation of TBS has been previously outlined by our lab (Abelseth et al., 2019[href=https://www.wicell.org#bib1]).\nOptional: TBS or media can be added to the wells of the original cell culture plate instead of transferring the construct to a new plate if a pre-coated plate is not required .\nPrinting constructs into an agarose support bath\nTiming: 20 min to 4 h\nThis step includes the instructions on how to print 3D tissue constructs into an agarose support bath. This method is better suited for materials and structures that do not hold their shape well directly after printing. Table 3[href=https://www.wicell.org#tbl3] presents the recommended printing parameters for this method.\ntable:files/protocols_protocol_1609_5.csv\nFill the wells of a cell culture plate with agarose gel using a pipette.\nCalibrate the printhead so the needle tip sits submerged in the agarose near the bottom of the plate (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1609-Fig4.jpg\nFigure 4. The process of printing into an agarose support bath\n(A) Needle tip is calibrated to sit submerged in the agarose support bath.\n(B) The finished bioprinted construct should have distinct fibers and hold its shape.\n(C) When crosslinking, the needle should circle the construct as close as possible without compromising the shape of the print.\n(D) The fully crosslinked construct should hold its shape outside of the support bath and the individual fibers should be clearly visible.\nPrinting with a blunt tip needle is recommended.\nBegin the print by pressing “Print” (Figure 4[href=https://www.wicell.org#fig4]B).\nAdjust the speed and pressure as needed to obtain a steady and even print problem 2[href=https://www.wicell.org#sec6.3]: Lack of or inconsistent material extrusion, problem 3[href=https://www.wicell.org#sec6.5]: Nozzle tip becomes clogged.",
    "A speed of 15 mm/s and pressure of 11 kPa is recommended.\nFill a syringe with crosslinker attached to a blunt tip needle.\nSlowly inject crosslinker into the agarose gel surrounding the printed construct and into any empty spaces within the print (Figure 4[href=https://www.wicell.org#fig4]C).\nAllow it to sit for 2–3 min or until the construct has been sufficiently crosslinked. Problem 4[href=https://www.wicell.org#sec6.7]: Printed construct does not hold its shape during printing.\nNote: The printed construct is fully crosslinked when the material has gelled and holds its shape (Figure 4[href=https://www.wicell.org#fig4]D).\nUse a spatula to remove the print and transfer to an empty well. Problem 5[href=https://www.wicell.org#sec6.9]: Nozzle tip leaks between prints.\nUse a wash bottle filled with TBS to rinse excess agarose off the construct.\nTransfer construct to desired medium for further culturing.\nNote: Phenol red was used in the images for visibility.\nPrinting with Alg/gel\nTiming: 30 min\nTable 4[href=https://www.wicell.org#tbl4] presents the recommended printing parameters for printing with Alg/Gel or other more viscous bioinks.\ntable:files/protocols_protocol_1609_6.csv\nAlg/Gel is viscous enough to be printed without a support bath or pre-crosslinking.\nCalibrate the printhead so that the nozzle tip is approximately 0.1 mm away from the print surface.\nStart the print by pressing “Print”.\nA speed of 20 mm/s and a pressure of 20 kPa is recommended.\nAdjust the speed and pressure as desired.\nAfter printing, pipette 2% calcium chloride onto the print to crosslink.\nLeave print in crosslinker bath for 5 min to fully crosslink.\nNote: Constructs are fully crosslinked when they are firm and hold their shape. Fully crosslinked prints will expand and may double in size.\nWhen fully crosslinked, transfer construct to a conical or petri dish using a spatula.\nStore construct in TBS for up to 2 weeks.\nCulturing tissue constructs\nTiming: 30 min to 1 h",
    "Thaw desired media according to manufacturer’s protocol before use.\nPipette up the old media using a 1 mL pipette tip.\nPlace the pipette tip at the edge of the well furthest from the construct (if possible) to avoid taking up pieces of the construct.\nPipette slowly to avoid drawing the construct into the pipette tip.\nNote: It is normal for constructs to degrade overtime. If performing long-term cultures of 14 days or longer, constructs may degrade to the point that they could be sucked into the pipette. Pipetting gently and as far from the construct as possible will assist with minimizing additional degradation due to pipetting.\nRepeat for necessary wells.\nAdd desired media to well using a serological pipette.\nAdd enough media to completely cover the construct.\nAdd media at corner of well furthest from the construct (if possible) to avoid disrupting the construct.\nMedia changes should be performed every day, or according to culturing protocol."
  ],
  "subjectAreas": [
    "Material Sciences",
    "Stem Cells",
    "Biotechnology And Bioengineering",
    "Tissue Engineering",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}