{
  "id": 2407,
  "origin_website": "Cell",
  "title": "Protocol for the generation of HIV-1 genomic RNA with altered levels of N6-methyladenosine",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nGeneration of FTO or ALKBH5 KO HEK293T cells\nTiming: 5 weeks\nThe purpose of this step is to generate HIV-1 producer cells that do not express one of the m6A erasers, allowing for the production of HIV-1 containing elevated levels of m6A.\nProduce LentiCRISPR v2 lentiviral particles.\nPrepare plasmids using a commercially available kit such as Nucleobond Xtra Midi Kit according to the manufacturer’s protocol which can be found here: NuceloBond Xtra[href=https://www.mn-net.com/media/pdf/ed/82/0f/Instruction-NucleoBond-Xtra.pdf] Midi. Dissolve DNA pellet in 10 mM Tris, 1 mM EDTA pH 8.0.\nSeed 5 × 106 HEK293T cells per 10-cm diameter culture dish in 10 mL of complete medium. Seed one dish per lentiviral vector. Cells should be ∼70% confluent at the time of transfection (Figure 1[href=https://www.wicell.org#fig1]A).\nIncubate cells at 37°C, 5% CO2 for 16 h.\nTransfect cells.\nDilute DNA by adding three plasmids (maximum 15 μL) to 1.5 mL OPTI-MEM:\ntable:files/protocols_protocol_1893_9.csv\nDilute 1 mg/mL PEI solution by adding 70 μL PEI to 1.5 mL OPTI-MEM.\nAdd diluted DNA to diluted PEI, mix and incubate for 15 min at 22°C.\nTransfer cells from incubator to biosafety cabinet.\nGently add DNA:PEI mix dropwise to cells. Swirl gently to disperse the mixture evenly without disturbing the cell monolayer.\nIncubate cells at 37°C, 5% CO2 for 6 h.\nRemove the cell culture medium containing the transfection mixture and carefully replace with fresh complete medium.\nIncubate cells at 37°C, 5% CO2 for 48 h.\nCollect culture medium and transfer to a 15 mL conical tube.\nCentrifuge at 1,000 × g for 10 min at 22°C.\nPass supernatant through 0.45 μm syringe filter to remove remaining cellular debris.",
    "Use medium containing lentiviral particles immediately for transduction or aliquot 1 mL medium containing lentiviral particles per screw cap cryotube to freeze on dry ice for storage at −80°C.\nAlternatives: There may be batch-to-batch variability of transfection efficiency for different preparations of PEI. Therefore, the appropriate PEI:DNA (μg:μg) ratio should be determined empirically. Alternatively, any transfection reagent may be used. If desired, culture supernatants containing lentivirus may be collected at 48 and 72 h post-transfection and stored either separately or combined. If combining, supernatant collected at 48 h can be stored at 4°C and combined with culture supernatant collected at 72 h post-transfection.\nPause point: Lentivirus can be stored at −80°C until proceeding to the next step.\nTransduce HEK293T cells with LentiCRISPR v2 lentiviral particles and select transduced cells.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1893-Fig1.jpg\nFigure 1. Optimal cell confluency at the time of transfection\n(A) HEK293T cells were plated at a density of 5 × 106 cells per 10-cm diameter culture dish, resulting in ∼70% confluency 16 h after plating.\n(B) HEK293T cells were plated at a density of 3 × 106 cells per 10-cm diameter culture dish, resulting in ∼40% confluency 16 h after plating. Scale bars represent 100 μm.\nSeed 2 × 106 HEK293T cells per 6-cm diameter culture dish in 5 mL of complete medium. Cells should be ∼50% confluent at the time of transduction. Include a dish for mock transduction to be used as a selection control.\nIncubate cells at 37°C, 5% CO2 for 16 h.\nRemove culture medium.\nAdd 1 mL medium with lentiviral particles containing 8 μg/mL polybrene (or complete medium for mock).\nIncubate cells at 37°C, 5% CO2 for 2 h with occasional rocking back and forth.\nAdd 4 mL complete medium.\nIncubate cells at 37°C, 5% CO2 for 24 h.\nCarefully replace culture medium.",
    "Incubate cells at 37°C, 5% CO2 for 24 h.\nReplace culture medium with complete medium containing the appropriate concentration of puromycin. In our hands, 1 μg/mL puromycin kills all untransduced cells within 5 days. We recommend performing a kill curve using your HEK293T cells prior to selecting transduced cells to determine the optimal concentration for selection (0.5, 0.8, 1.0, 1.5, and 2.0 μg/mL puromycin). If cells are confluent, split the cells so that they are ∼80% confluent the next day and then add selective medium.\nContinue selection, replacing medium every other day with fresh puromycin until all cells in the mock transduced control dish are dead. Ideally selection will take 3–5 days.\nOnce selection is complete, freeze a batch of the polyclonal cell population prior to clonal selection.\nSelect clonal populations of KO cells.\nDilute cells to 5 cells/mL in complete growth medium containing puromycin.\nSeed each well of four 96-well dishes with 100 μL of the cell suspension.\nAs a positive control, seed one well with 1 × 104 cells. This will aid in focusing the microscope for quick scanning of wells that contain clones.\nAllow clones derived from single cells to grow out for ∼2 weeks; change the medium every 3–5 days if medium becomes yellow.\nCritical: Single clones should be monitored routinely and transferred to a larger well once confluence is reached. In addition to microscopic examination of cells, changes in the color of the culture medium can indicate clones that are ready to be transferred.\nOnce cells are confluent, expand each clone to one well of a 12-well dish.\nWhen 12-well is confluent, use half of the cells for Western blot analysis of m6A eraser expression. Keep the other half in culture and continue to amplify.",
    "Aim to screen ≥20 individual clones for KO of FTO or ALKBH5.\nScreen clonal populations of KO cells. (See step 8 for more details).\nPerform Western blot using cell lysate from each clone. Run control lysates from parental HEK293T cells on each gel to determine expression levels of erasers in unedited cells.\nDiscard clones that retain eraser expression.\nPrepare several vials of low passage frozen stocks of confirmed KO clones.\nGeneration of FTO or ALKBH5 OE HEK293T cells\nTiming: 3 days\nThe purpose of this step is to generate HIV-1 producer cells that overexpress one of the m6A erasers, allowing for the production of HIV-1 containing reduced levels of m6A.\nTransfect cells with FTO or ALKBH5 expression plasmids or vector control.\nSeed twenty 10-cm diameter cell culture dishes with 3 × 106 HEK293T cells in 10 mL of complete medium. Half of the cells will be transfected with vector control plasmid and half with eraser overexpression plasmid. Cells should be ∼40% confluent at the time of transfection (Figure 1[href=https://www.wicell.org#fig1]B).\nIncubate cells at 37°C, 5% CO2 for 16 h.\nTransfect cells. Refer to above section 1c for details. The numbers below are per 10-cm diameter dish. Make a master mix for multiple dishes. The number of dishes can be scaled up or down as necessary.\nDilute each plasmid DNA by adding 12 μg plasmid to 1.5 mL OPTI-MEM.\nDilute PEI by adding 60 μL PEI to 1.5 mL OPTI-MEM.\nAdd diluted DNA to diluted PEI and incubate for 15 min at 22°C.\nProceed immediately to step 6.\nHIV-1 production using FTO/ALKBH5 KO or FTO/ALKBH5 OE HEK293T cells\nTiming: 2–3 days\nThe purpose of this step is to produce HIV-1 containing altered levels of m6A.\nUse the Biosafety Precautions after transfection of cells with HIV-1 proviral DNA plasmid (pNL4-3).",
    "Transfect cells (5 × 106 per 10-cm diameter dish) with pNL4-3 proviral plasmid.\nRepeat steps 5c–5g with 12 μg pNL4-3 per dish. Cells should be ∼70% confluent at the time of pNL4-3 transfection.\nIncubate cells at 37°C, 5% CO2 for 48 h.\nCollect and clarify the virus-containing supernatant.\nCollect the media from cells and transfer to a 50 mL conical tube. Combine up to 40 mL supernatant (from four 10-cm diameter dishes) in a single tube.\nCentrifuge at 1,500 × g for 5 min at 22°C.\nPass supernatant through a 0.45 μm syringe filter into a fresh 50 mL conical tube.\nRemove 5 mL supernatant and save for p24 measurement and HIV-1 titer determination. For detailed protocols, please refer to (Janas and Wu, 2009[href=https://www.wicell.org#bib2]).\nCollect protein from one dish of cells per condition for Western blot analysis.\nWash cells once gently with 10 mL cold PBS.\nCompletely remove PBS wash.\nAdd 1 mL radioimmunoprecipitation assay (RIPA) buffer with protease inhibitor cocktail directly to dish.\nAlternatives: Commercially available or other detergent-based cell lysis buffers compatible with Western blot may be used as an alternative to RIPA buffer.\nUse cell lifter to scrape cells to one side of dish.\nTransfer cell lysate to a 1.5 mL tube on ice.\nRotate lysate at 10 rpm for 20 min at 4°C.\nCentrifuge at top speed (at least 13,200 × g) for 30 min at 4°C.\nTransfer supernatant to fresh 1.5 mL tube.\nPause point: Cell lysate can be stored at −80°C until performing bicinchoninic acid (BCA) protein assay and Western blot analysis.\nPerform BCA Protein Assay according to manufacturer’s protocol which can be found here: Pierce BCA Protein Assay[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0011430_Pierce_BCA_Protein_Asy_UG.pdf].\nUse 20 μg total protein per lane for Western blot analysis using standard protocol.\ntable:files/protocols_protocol_1893_10.csv",
    "Pellet the virus through a sucrose cushion to purify and concentrate.\nTransfer 3 mL of 25% Sucrose in TNE buffer to the bottom of a 38.5 mL thinwall ultracentrifuge tube.\nVery carefully add up to 35 mL of supernatant containing HIVNL4-3 (from step 7c) slowly down the side of the tube to the top of the sucrose cushion using a pipet aid. There should be a sharp demarcation between the layers of sucrose and supernatant. Handle tubes carefully to avoid mixing of the layers.\nPlace the ultracentrifuge tubes carefully in SW32Ti rotor buckets and affix lids. Weigh each bucket and record the weight to the 1/100th gram.\nBalance the weight of each tube using DMEM (without additives).\nPlace the tubes in sealed bucket and hang in pre-chilled SW32Ti rotor.\nCentrifuge at 28,000 rpm for 1.5 h at 4°C using slow acceleration and deceleration setting of the centrifuge to avoid disturbing the layers/pellet.\nCritical: Carefully read the manual for the ultracentrifuge and rotor prior to use. Ultracentrifuge tubes need to contain enough liquid volume to avoid collapsing during ultracentrifugation. Tubes containing less than 35 mL of virus-containing supernatant should be brought to 35 mL with DMEM without additives so that the total volume of sucrose and supernatant is 38 mL. If using a different ultracentrifuge rotor, compatible thinwall tubes must be used with the appropriate fill volume, adjusting the volume of sucrose cushion accordingly. Tubes contain infectious virus and should never be open outside of an appropriate biosafety cabinet. Tubes should be weighed on a balance while inside the swinging bucket with the lid on. Weight of opposing buckets should be exactly the same to avoid damage to the ultracentrifuge.\nCarefully remove the buckets from the rotor and transfer them to the biosafety cabinet.\nDiscard the supernatant by vacuum or decanting.",
    "Critical: Supernatant should be decontaminated in a final concentration of 10% bleach for 30 min (or according to institutional regulations) prior to disposal.\nInvert the tube on a paper towel for 1–2 min to completely remove all supernatant.\nAdd 150 μL DMEM (without additives) to the pellet.\nPause point: Samples can be stored at 4°C for 16–24 h. Do not exceed 24 h incubation.\nCombine rehydrated virions from identical samples (if applicable).\nRemove 100 μL for p24 measurement and HIV-1 infection assay (Janas and Wu, 2009[href=https://www.wicell.org#bib2]).\nDigest the virus with TURBO™ DNase for 30 min at 37°C.\ntable:files/protocols_protocol_1893_11.csv\nAdd 80 U (2 μL) RNaseOut™.\nStore at −80°C or use directly for RNA extraction.\nPause point: Samples can be stored at −80°C until proceeding to the next step.\nAlternatives: To confirm successful transfection and virus production, we routinely collect protein from one dish of HEK293T producer cells per condition for Western blot analysis of erasers and HIV-1 p24 expression (step 8). If the purified virus will be used for preparation of viral RNA only, DNase treatment can be performed after TRIzol™ purification rather than after resuspension of the virus pellet. In this case, TRIzol™ can be added directly to the ultracentrifuge tubes and all identical samples combined in 1 mL of TRIzol™. If generated HIV-1 stocks will be used for infections, perform DNase treatment as described in step 10 and freeze on dry ice and store in 20 μL aliquots at −80°C for future use. The virus titer decreases when using the stock after multiple freeze and thaw cycles. Thus, it is best to avoid multiple freeze and thaw cycles of virus stocks.\nHIV-1 RNA extraction\nTiming: 2 h\nThe purpose of this step is to extract HIV-1 genomic RNA from purified virions.",
    "Biosafety Precautions for work with HIV-1NL4-3 may be discontinued after addition of TRIzol™ to concentrated virus.\nPurify viral RNA using TRIzol™.\nAdd 1 mL of TRIzol™ Reagent to the centrifuge tube containing DNase-treated virions, pipet up and down several times to mix.\nIncubate for 5 min at 22°C.\nAdd 0.2 mL of chloroform and mix well by vigorous shaking for 15 s. Do not vortex.\nIncubate at 22°C for 15 min.\nCentrifuge at 13,200 × g for 15 min at 4°C.\nTransfer the colorless upper aqueous phase to a new tube.\nAdd 1 μL 20 mg/mL glycogen, mix.\nAdd 400 μL isopropanol, mix.\nIncubate for 10 min at 22°C.\nCentrifuge at 13,200 × g for 20 min at 4°C.\nCarefully discard the supernatant without disturbing the pellet.\nWash the pellet in 1 mL 75% ethanol.\nCentrifuge at 13,200 × g for 10 min at 4°C.\nDiscard the supernatant by decanting.\nPulse spin the tube to collect residual ethanol and remove using pipette.\nAir dry the RNA pellet for 5 min.\nRehydrate the RNA in 50 μL RNase-free H2O.\nDetermine the concentration of RNA by Nanodrop and store RNA in −80°C.\nPause point: Samples can be stored at −80°C until proceeding to the next step.\nHIV-1 RNA analysis by denaturing urea gel electrophoresis\nTiming: 2 days\nThe purpose of this assay is to directly visualize and examine the integrity of the full-length extracted HIV-1 RNA.\nPrepare electrophoresis reagents the day before electrophoresis.\nPrepare 700 mL 1 M urea electrophoresis buffer. See recipe in “materials and equipment[href=https://www.wicell.org#materials-and-equipment]” section.\nDissolve at ≤60°C for 3 h with mixing at 400 rpm.\nPrepare 8 M urea loading buffer. See recipe in “materials and equipment[href=https://www.wicell.org#materials-and-equipment]” section.\nVortex until dissolved.\nStore at 4°C for 16–24 h or use immediately if performing same day electrophoresis.",
    "Prepare 1 M urea/0.8% agarose gel the day of electrophoresis.\nAdd 0.8 g agarose to 94 mL 1× TAE. See recipe in “materials and equipment[href=https://www.wicell.org#materials-and-equipment]” section.\nDissolve in microwave and allow to cool to 60°C.\nAdd 6 g urea and mix 15 min to dissolve. The final volume will be 100 mL.\nPour into gel casting apparatus and allow to solidify.\nPrepare samples for electrophoresis.\nBring 500 ng RNA sample to 5 μL using RNase-free H2O. Sample volume can be scaled up if necessary, based on RNA concentration (See Alternatives below).\nPrepare Millenium™ ssRNA ladder by mixing 2 μL ladder with 3 μL RNase-free H2O.\nTo each sample and ladder add 20 μL 8 M urea loading buffer and 5 μL 6× Orange-G loading dye.\nDenature samples for 5 min at 90°C and place immediately on ice.\nRun denaturing urea agarose gel.\nPlace gel in buffer tank and immerse in electrophoresis buffer.\nLoad samples and run the gel until the loading dye (Orange-G) reaches 3/4 of the gel. (approximately 1.6 h at 85 V).\nRemove gel and wash twice for 5 min each in 1× TAE buffer.\nImmerse gel in ∼175 mL (1/4 volume of electrophoresis buffer used at step 12a) of 100 mM NaCl for 30 min.\nStain gel in SYBR Gold diluted 1:10,000 in 1× TAE for 30 min with gentle rocking and protected from light.\nImage the gel using 300 nm UV transilluminator.\nAlternatives: If visualization of RNA is the end-point assay, 500 ng RNA per well is sufficient. If the gel will also be used for Northern blot, 3 μg RNA should be loaded per well.",
    "Critical: It is critical to maintain an RNase-free experimental environment to maintain RNA integrity throughout the procedure. All solutions should be prepared with RNase-free water. The gel tray, electrophoresis tank, pipettes, etc. may be treated with a commercially available RNase decontamination solution such as RNase ZAP™ prior to use. Viral RNA that is found to be degraded should not be used for downstream assays.\nHIV-1 RNA analysis by northern blot (optional)\nTiming: 2 days\nThe purpose of this assay is to specifically detect HIV-1 genomic RNA and its length using Northern blot. This is an optional step depending on the use of HIV-1 RNA.\nPerform denaturing urea gel electrophoresis according to the previous section using 3 μg RNA per well.\nPerform Northern blot using the NorthernMax™ Kit (Thermo Fisher Scientific) according to the manufacturer’s protocol which can be found here: NorthernMax Kit[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0019828_NorthernMax_UG.pdf].\nPerform Nonisotopic probe detection using the Chemiluminescent Nucleic Acid Detection Module (Thermo Fisher Scientific) according to the manufacturer’s protocol which can be found here: Chemiluminescent Nucleic Acid Detection Module.\nAlternatives: Once the protocol is well-established it is not strictly necessary to perform Northern blotting for every experiment.\nHIV-1 RNA m6A detection by dot blot\nTiming: 1–2 days\nThe purpose of this assay is to specifically detect m6A modifications of HIV-1 genomic RNA using a semi-quantitative dot blot assay.\nImmobilize RNA to a nylon membrane.\nBring 220 ng RNA to 55 μL volume using of 1 mM EDTA pH 8.0.\nAdd 33 μL of 20× SSC buffer and 22 μL of 37% formaldehyde.\nMix and heat the samples at 65°C for 30 min. Transfer samples immediately to ice.\nUse dot blot apparatus as a guide to cut a nylon membrane to the appropriate size for the required number of wells.",
    "Soak the nylon membrane in 10× SSC buffer for 10 min.\nAssemble the membrane in the dot blot apparatus following the manufacturer’s instructions.\nAdd 200 μL of RNase-free water to each well to be used and pull through using vacuum.\nAdd 200 μL of 10× SSC buffer to each well to be used and pull through using vacuum.\nLoad 100 μL of each sample and pull through using vacuum.\nWash each well twice with 200 μL 10× SSC buffer.\nKeep the vacuum on and disassemble the instrument.\nPlace the membrane face up on a paper towel dampened with 10× SSC.\nPlace in the Stratalinker and perform autocrosslink (120,000 μJ/cm2) three times.\nCritical: Do not handle the membrane with gloved hands. Only use clean forceps to handle the membrane. Always carefully read and follow instructions for dot blot apparatus.\nStain membrane with methylene blue to visualize RNA samples, which serves as a loading control for quantification of m6A levels.\nTransfer the membrane to a small plastic dish.\nRinse the membrane in methylene blue stain for 1 min.\nRinse the membrane several times in ddH2O for ∼10 s each until background is de-stained and signal is appropriate for imaging.\nImage the membrane.\nPerform Western blot for m6A detection.\nBlock the membrane in 5% non-fat dry milk (NFDM) TBST for 60 min at 22°C.\nRemove blocking solution and replace with 2.5% NFDM containing m6A primary antibody at a final concentration of 0.1 μg/mL (1:10,000 dilution).\nIncubate for 60 min at 22°C or for 16–24 h at 4°C.\nPause point: Blot may be incubated with primary antibody for 16–24 h for convenience.\nWash the membrane in TBST three times for 5 min at 22°C.\nIncubate with goat anti-rabbit HRP-conjugated secondary antibody in 2.5% NFDM TBST at a final concentration of 0.2 μg/mL (1:5000 dilution).",
    "Wash the membrane in TBST five times for 5 min at 22°C.\nDevelop the membrane using SuperSignal™ West Femto Maximum Sensitivity Substrate according to manufacturer’s protocol which can be found here: SuperSignal West Femto Maximum Sensitivity Substrate[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0011345_SupSig_West_Femto_MaxSensi_Subs_UG.pdf].\nImage the membrane.\nUse ImageJ to quantify the relative levels of m6A signal for each sample, using methylene blue signal as a loading control for normalization.\nAlternatives: Antibody concentrations are for the specific antibodies listed in the key resources table[href=https://www.wicell.org#key-resources-table]. Any anti-rabbit HRP-conjugated secondary may be used; however, the optimal concentration would need to be determined empirically. Similarly, any chemiluminescent substrate system will work for development of signal from HRP-conjugated secondary antibodies. However, some substrates may not provide sufficient sensitivity to accurately quantify the m6A signal."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}