{
  "id": 13373,
  "origin_website": "Jove",
  "title": "A Familial Hypercholesterolemia Human Liver Chimeric Mouse Model Using Induced Pluripotent Stem Cell-derived Hepatocytes",
  "procedures": [
    "All methods described here that involve the use of animals have been approved by the Committee on the Use of Live Animals in Teaching and Research (CULATR) of the University of Hong Kong.\n1. Mouse Preparation and Phenotypic Testing\nGeneration of immunodeficient Ldlr knockout (KO) mice.\nUse the mice strains Ldlr-/-, Rag2-/-, and Il2rg-/- (see Table of Materials).\nCross Rag2-/- mice with Il2rg-/- mice to generate Rag2-/-/ Il2rg-/- mice, then cross Ldlr-/- mice with Rag2-/-/ Il2rg-/- mice to generate Ldlr-/-/Rag2-/-/Il2rg-/- (LRG) mice15. At the age of 3 to 4 weeks, collect genomic DNA from the ear to determine the genotype by PCR and sequencing.\nAt the age of 8 to 12 weeks, use male LRG mice as recipients for iHeps to generate human liver chimeric mice.\nFeed the mice with a high-fat and high-cholesterol (HFHC) diet 7 days before iHep transplantation to help them develop hypercholesterolemia.\nTo induce liver injury that facilitates the proliferation of engrafted iHeps in the liver, place the mice into a sterile container and irradiate them using a gamma irradiator with γ-rays at a dose of 3 Gy 24 h prior to engraftment. Then, return the mice to their housing cages. The healthy status of these irradiated mice can be monitored by measuring their weight.  Mice with 20% weight loss or greater will be euthanized.\n2. iHep Differentiation and Dissociation\nLDLR heterozygous KO (+/-) or homozygous KO (-/-) human iPSCs, or FH patient-iPSCs with heterozygous mutations in LDLR (FH iPSCs) are used to produce iHeps. The generation of LDLR +/- or -/- iPSCs and FH iPSCs is described in our previous report15.\nDirected differentiation of iPSCs into iHeps\n\tNOTE: The method for differentiation of human iPSCs into iHeps is modified from a previous report16.",
    "Three days prior to differentiation (day -3), seed the iPSCs onto extracellular matrix coated 6-well plates (see Table of Materials) at a density of 300,000 cells/well in 1.5 mL (also hereafter) of human iPSC maintenance medium (see Table of Materials) supplemented with 5 µM ROCK inhibitor (Y27632). Culture the cells at 37 °C in a 5% CO2 humidified incubator. Normally, iHeps from a 6-well plate are sufficient to engraft 5 mice.\n24 hours later (day -2) and 48 h later (day -1), change the medium to fresh human iPSC maintenance medium without ROCK inhibitor.\n\t\tNOTE: iPSCs before differentiation should express high levels of OCT4 and NANOG, which can be examined by quantitative RT-PCR, immunofluorescence, or flow cytometry.\nAt day 0 of differentiation, wash the cells with RPMI 1640 once and then add RPMI 1640 supplemented with 100 ng/mL Activin A and 25 ng/mL WNT3a.\nAt day 1 and day 2 of differentiation, change the medium for RPMI 1640 supplemented with 100 ng/mL Activin A.\n\t\tNOTE: If there is too much cell death at this stage (days 0–3), up to 0.5% fetal bovine serum (FBS) can be added to the medium to improve cell viability. However, we suggest testing the minimal amount of FBS to be added for each specific iPSC line, as excess FBS can also affect the differentiation.\nAt day 3, wash the cells with DMEM once and then switch to 2nd stage medium (20% serum replacement, 1x non-essential amino acids, 2 M L-glutamine, 0.1 M beta-mercaptoethanol, and 1% dimethyl sulfoxide in DMEM medium). Change the medium every other day until day 10.",
    "NOTE: On day 7, the cells should have reached confluence and display clear edges. There might be some undifferentiated areas appearing at this stage; ignore them if the percentage of these areas is small. If the percentage is high, reduce the confluence of iPSCs at day 0 and reduce the amount of FBS used in the first stage of differentiation.\nAt day 10, wash the cells with hepatocyte basal medium once and then switch to hepatocyte culture medium supplemented with 20 ng/mL human hepatic growth factor and 20 ng/mL oncostatin M to promote iHep maturation. Change the medium every other day.\n\t\tNOTE: At this stage, >90% of the cells should be positive for HNF4A, according to immunofluorescence staining or flow cytometry.\nAt day 15–17, the cells are ready for engraftment. Optionally, the supernatant of the cell culture may be collected and stored at -80 °C for quantifying the secreted albumin (ALB) by iHeps.\n\t\tNOTE: At this stage, >80% iHeps should be positive for HNF4A, ALB, and α1-antitrypsin (AAT) according to immunofluorescence staining. Around 60–70% of day 17 iHeps should be positive for ASGPR, as shown by flow cytometry. In our hands, iHeps at this period have optimal capacity to repopulate the mouse liver; iHeps may secrete higher levels of ALB in vitro but also become senescent if the engraftment is delayed.\nDissociation and loading of iHeps into an insulin syringe\nPrepare the required reagents and materials:\n\t\t\n24 h prior to engraftment, thaw the required amount (V = 40 µL * mice number) of extracellular matrix in an ice box in a cold room, and put the insulin syringe and a box of 200 µL tips into a 4 °C refrigerator.",
    "One hour prior to engraftment, warm the cell dissociation enzyme supplemented with 50 µg/mL DNase I to room temperature and place the RPMI 1640 medium supplemented with 20% serum replacement on ice.\nTake phase contrast images (100X and 200X) of iHeps to record their status, including cell morphology, growth, and cell density.\nWash iHeps with 2 mL/well of room temperature Ca2+ and Mg2+-free PBS twice, and then add 1 mL of cell dissociation enzyme supplemented with 50 µg/mL DNase I to each well. Put the cells back into the incubator for 8–10 min.\n\t\tNOTE: To improve cell dissociation with cell dissociation enzyme, wash the cells with Ca2+ and Mg2+-free PBS. To maximize cell viability, we suggest dissociating no more than 6 wells per batch at a time. Furthermore, we suggest restricting the cell dissociation enzyme treatment to less than 10 minutes.\nMonitor cell morphology under the microscope. When most of the cells become round, add an equal volume of cold RPMI 1640 supplemented with 20% serum replacement to each well, pipette the cells gently to detach from the plate, and transfer the cell suspension to a new 15 mL tube.\n\t\tNOTE: This step is critical for harvested cells' viability. If the cells are difficult to detach from the plate, it does not matter if some of the cells are left over. If the cells detach as large squares of monolayer, then pipette gently after centrifugation to obtain a single cell suspension.\nRepeat step 2.2.4 for each well until nearly all attached cells are collected. Centrifuge at 200 x g for 3 min at 4 °C.",
    "Remove the supernatant and resuspend cells with 2 mL of cold PBS in a 15 mL tube. Pipette the cells gently to obtain a single-cell suspension and then add cold PBS to a final volume of 1 mL * number of dissociated wells. Finally, pass the cells through a 40 µm cell strainer to remove aggregates.\n\t\tNOTE: Normally 1-2 x 106 cells/well can be harvested after filtering.\nAliquot 20 µL of cell suspension and add 20 µL of 0.4% trypan blue solution, then count the cells using an automated cell counter and record the concentration of cell suspension as \"C\". Calculate the required volume (V1 = [106 * (n+1)]/C, where n is the number of mice to be engrafted) of cell suspension (1 million/mouse) for intrasplenic injection.\nAliquot the required volume of cell suspension into 15 mL tubes and centrifuge at 200 x g for 3 min at 4 °C.\nRemove the supernatant, resuspend the cells in the appropriate volume of cold PBS to make the volume of cell suspension (n+1) * 55/2 µL (n = number of mice), and then add an equal volume of extracellular matrix to make the final volume of cell suspension (n+1) * 55 µL.\nPlace the cold insulin syringe on ice, unplug the piston, transfer 55 µL of cell suspension into the syringe and then put the piston back. Discharge bubbles carefully and put the syringe back on ice.\nRepeat 2.3.10 until all syringes have been loaded with the cells. The syringes are now ready for injection.\n\t\tNOTE: To maximize cell viability, we recommend keeping the cells on ice after dissociation. For the above steps 2.2.4–2.2.11, make sure all the reagents are kept at 2–8 °C before use.\n3. Intrasplenic Injection of iHeps",
    "Anesthetize the mice with ketamine (100 mg/kg) and xylazine (10 mg/kg) injected intraperitoneally. Put vet ointment on mice eyes to prevent dryness during the anesthesia procedure, and monitor their muscle reflexes to observe the anesthesia's effect and assess pain.\nOnce mice have lost muscle reflex to stimulation, place them in the right lateral decubitus position. Apply a thick layer of depilatory cream to the incision area in the left flank for 5–8 min. Then, remove the depilatory cream and hair by wiping the area with a water-moistened gauze pad.\nScrub the left flank with povidone-iodine or, alternatively, with 70% ethanol 3 times followed by a final soaking with povidone-iodine for disinfection.\nIn a level 2 biosafety cabinet, locate the position of the spleen, which can be visualized transparently in the left flank, and then incise the skin and abdominal wall for 0.5–1 cm. Exteriorize the spleen by pulling out the adipose tissue gently near it using pointy forceps. Stabilize the spleen using a swab gently.\nInsert the needle of the insulin syringe 3–4 mm into the parenchyma of the spleen and inject approximately 50 µL of cell suspension gently. Retract the needle and place a cotton swab over the injection site for 1 minute to prevent bleeding and spillage of material.\nReturn the spleen to the peritoneum and close the wound with 5–0 nylon sutures. Then, keep mice in a warm chamber/incubator for 3–16 h to return them to their normal body temperature and to revive them. Mice that have undergone surgery are not returned to the company of other animals until fully recovered.\nAdd meloxicam (26 μg/mL) to the drinking water and inject buprenorphine (50 μg/kg)  intramuscularly as anti-inflammatory drug and analgesic, respectively. Monitor surgical wounds daily to prevent any inflammation.",
    "NOTE: Make sure all the instruments and supplies used in steps 4-7 are sterile.\n4. Test of Plasma LDL-C Level\nAt days 0, 7, 14, 21, and 28 post-engraftment, restrain the LRG mice tightly to minimize side-to-side movement of the head using two-handed restrain method, then puncture the facial vein using the lancet. Blood will begin to flow after removal of the lancet. Collect around 50 µL of blood into 1.5 mL tubes containing 1 µL of EDTA.\n\tNOTE: If the grip is too tight, the collected blood volume may be reduced and mice may die because of breathing difficulty.\nMix the blood gently by inverting the tubes several times and then centrifuge at 950 x g for 15 min. Collect the supernatants and store them at -80 °C immediately.\nOnce all the samples are collected, thaw the plasma at room temperature and test the LDL-C level using a LDL-C detection kit according to the manufacturer's manual.\n5. In Vivo Drug Testing in Chimeric Mice Engrafted with LDLR  +/- and FH iHeps\nTo induce hypercholesterolemia, feed the mice a HFHC diet 7 days prior to engraftment.\nAt 7 days post-engraftment, treat each group of mice with vehicle (PBS, injected subcutaneously), 10 mg/kg/week PCSK9 antibodies (a clinical-grade formulation of PCSK9 monoclonal antibodies, injected subcutaneously too), 10 mg/kg/day simvastatin (40 mg/L mg/mL in drinking water), or combined PCSK9 antibodies and simvastatin.\nCollect mouse plasma at days 0 (the day of engraftment), 14, 21, and 28 post-engraftment. Store the samples at -80 °C immediately.\nOnce all the samples are available, test the plasma LDL level using a LDL-C detection kit, according to the manufacturer's manual.\n6. Endothelial Function Test",
    "Endothelial function is affected early in FH and can be tested in our mouse model as an indicator of the severity of the disease or to evaluate the improvement with different treatments. A stereomicrocope, dissection forceps, scissors, a wire myograph, acquisition hardware (see Table of Materials), and a computer are needed for this.\nSacrifice the mice by intraperitoneal injection of 100 mg/kg phenobarbital. Remove internal organs so that the descending aorta parallel to the spine is visible and can be dissected out by scissors together with adjacent tissue and heart. Dissect the aortae using fine scissors and place them in cold oxygenated Krebs solution (mM: 119 NaCl, 4.7 KCl, 2.5 CaCl2, 1 MgCl2, 25 NaHCO3, 1.2 KH2PO4, and 11 D-glucose).\nTransfer the aortae in Krebs solution to a silicone-coated petri dish. Pin the connective tissue to fix the aorta position without stretching it. Under a stereomicroscope, use fine forceps to spring the scissors and dissect the aorta free from the surrounding fat and adventitial tissue without damaging the vessel wall, then cut it into 1.5 to 2 mm length segments.\nCut an approximately 2 cm long and 40 μm thick stainless wire and gently put through the aorta lumen. Transfer the segment to the wire myograph chamber filled with oxygenated Krebs solution by holding the wire.\nTo measure the length of the aortae segments when studying contractility, place each segment perpendicularly in between the jaws and record the reading (D1) on the micrometer. Remove the segment and move the jaws together and record the reading (D0). The length of the segment would be L = D1-D0.\nFollow the user guide to clamp the wire and secure it with the screwdriver whilst placing the segment in between the jaws, but leave it unstretched.",
    "For normalization before the experiment, set the myograph to zero in the unstretched position. Then, slowly move the jaw apart and observe the aorta tension change until reaching 3 mN. After 15 minutes, drain the solution from the myograph chamber, and replace with fresh Krebs solution, wait for 15 min and adjust the tension to 3 mN again.\nChange the standard Krebs solution to 60 mM KCl-containing Krebs solution to induce a contraction for at least 15 min. Rinse with fresh Krebs solution 3 times.\nAdd increasing concentrations of phenylephrine (Phe; e.g., from 10 nM to 100 μM). Wash out with standard Krebs solution and add a single concentration of Phe at ~70% of maximal contraction from the previous contraction. When the contraction is stable, add increasing concentrations of acetylcholine (ACh; e.g., from 1 or 3 nM to 10 or 30 µM) to induce vasodilation. ACh is added at approximately 2 min interval.\n\tNOTE: In some aortic segments with small Phe-induced contraction, for example smaller than 30% of KCl induced contraction, U46619 (another vasoconstrictor) at a concentration from 1 nM to 30 nM can be used to induce a stable contraction that is bigger than 70% of KCl-induced contraction.\nClean the myograph according to the manufacturer's manual.\nUsing data analysis software (see Table of Materials), record the force (F) after every addition of drugs. Draw the marker to basal tension (Fbasal) for relative measurement, move the arrow to the highest point after Phe as FPhe, and then move to the lowest point after every addition of ACh as FACh. Calculate the ACh-induced endothelium-dependent vasodilation (EDV) by % relaxation = (FACh-Fbasal)/(FPhe-Fbasal) on the Y-axis. Prepare a concentration response curve on statistical software using log10 value of concentration in M on the X-axis.",
    "To analyze the statistical difference, use the area under curve of each segment from one mouse, and analyze the difference of the area under curve amongst groups using one-way ANOVA. Individual points can also be analyzed if needed.\n7. Evidence of iHep Repopulation in the Mouse Liver\nAt the endpoint, sacrifice the mice by injecting intraperitoneally 100 mg/kg phenobarbital.\nCollect plasma by cardiac puncture. Dissect lobes of liver using ophthalmic scissors, then put livers into a 10-cm peri-dish and wash twice with saline. Remove saline from the liver surface with absorbent paper, then cut the lobes into around 0.6-cm-length pieces. Fix the lobes of the liver in 10% formalin.\nEmbed the fixed livers in paraffin and section using a tissue processing system and a sliding microtome, respectively, according to manufacturer's instructions.\nHeat the slides to 60 °C for 1 h to melt the wax. Then, immerse the slides in xylene for 5 min twice, and rehydrate the tissue with 100%, 90%, and 70% ethanol successively.\nImmerse the slides into the slide-chamber containing around 50 mL of antigen retrieval solution, and then put the chamber into the pressure cooker, 120 °C for 1.5 min. Wash the slides gently with pipe water for 5 minutes.\nStain the sections with primary antibodies (around 100 µL/section) targeting human ALB (hALB) and human nuclei antigen (hNA). Then, stain with secondary antibodies conjugated with a fluorescent label or horseradish peroxidase (which reacts with the DAB detection kit).\nTo calculate the percentage of hALB+ areas and hNA+ cells, scan the slides stained with anti-hALB and anti-hNA and reacted with DAB using an automated slide scanning system to get whole section images.",
    "NOTE: Whole section-scanned images are helpful to calculate repopulated efficiency in an unbiased manner based on hALB+ areas or hNA+ cells in the immunohistochemistry-stained livers. As an alternative method to monitor iHep repopulation efficiency, plasma human albumin level can be tested using a human specific ALB ELISA kit.\nTake snapshot images to cover the whole slide using the associated digital slide viewing software under 5X view. To quantify the percentage of hALB+ areas, for each snapshot image, use the microscope imaging software to qualify the positive area (P) and the total area (T) of the image, and use Image J to qualify the blank area (B). The percentage of hALB+ areas is expressed as P/(T-B) *100%. For each group, at least 3 mice should be selected. And for each mouse, at least 4 sections from different positions of the liver should be selected.\nTo quantify the percentage of hNA+ cells, for each snapshot image, randomly select 1/16 of the area with an image processing software, and then manually count the number of total nuclei (T) and hNA+ nuclei (N). The percentage of hNA+ is expressed as N/T *100%. For each group, at least 3 mice should be selected. For each mouse, at least 4 sections from different positions of the liver should be selected.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}