{
  "id": 3443,
  "origin_website": "Cell",
  "title": "Establishment of Pancreatic Organoids from Normal Tissue and Tumors",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nProcessing of Normal and Tumor Tissue for Digestion\nTiming: 30–60 min, excluding transport time for tissue\nPatient-derived material can be obtained from pancreatic resections (partial pancreatic resections, whipple resections etc.), or core/fine needle biopsies (from either primary cancers or metastases)\nNote: Collection of human material must conform to all relevant institutional/ governmental regulations. Informed consent must be obtained from all subjects prior to collection of the primary human tissue material.\nFor resections, if possible, obtain tumor fragments from different tumor areas. As such, the chance that the resulting organoid culture represents the in vivo tumor heterogeneity (at the time of resection) is increased. Transfer the fresh patient material that will be used to generate organoids as soon as possible to collection medium ((Ad-DF+++) containing 50 ng/mL Primocin).\nFor needle biopsies, transfer all the material obtained to collection medium (Ad-DF+++ containing 50 ng/mL Primocin). For isolation from biopsies, be aware that establishment efficiency is generally lower for organoids derived from biopsies (+/- 30%) than from resections (+/- 70%) (Driehuis et al., 2019[href=https://www.wicell.org#bib3]). We hypothesize this is due to the low tumor cellularity present in the biopsied tissue. This might be especially relevant considering that pancreatic tumors generally contain many non-epithelial (stromal) cells. Therefore, try to obtain as much tissue as possible.\nCritical: Assure that patient material is submerged in collection medium. Therefore, use air-tight collection tubes that are completely filled with medium. Do not use tubes that are only half filled as this might result in drying out of the tissue when the material sticks to the side of the tube.\nPause Point: Patient-derived material can be stored in collection medium for a maximum of 48 h at 4°C. However, the longer tissue is stored before processing, the lower the outgrowth efficiency generally will be.",
    "Optional: 10 μM ROCK inhibitor can be added to the collection medium to prevent cell death by anoikis and enhance organoid outgrowth.\nTransfer the material to a 10 cm glass petri-dish. This can be done by carefully removing the collection medium from the collection tube and inverting the tube above a petri-dish once all media is removed. Alternatively, tweezers can be used to ‘fish’ material from the collection medium. Make sure that tissue does not dry out in the petri-dish, by covering it in 1–2 mL of collection medium.\nFor resections, remove tissue that is not pancreatic epithelium such as muscle, fat, or intestinal epithelium as much as possible before proceeding to tissue digestion. Do not do this for biopsies, as 1) due to the nature of a needle biopsy, different tissues are difficult to distinguish from each other and 2) too little material will remain.\nUsing scalpels, mince the tissue into small fragments of 1–2 mm3. The tissue can become viscous from this handling; this is not a problem.\nOptional: Collect 2–3 pieces from different areas for DNA isolation (store at −20°C), 2–3 pieces from different areas for RNA isolation (store at −80°C), and 2–3 fragments for histology (for fixation). We recommend at least collection of DNA, to allow SNP fingerprinting to confirm the identity of the organoid culture that will be established and exclude the possibility of culture swaps (that can occur during handling cultures derived from different patients). For more information on QC standards, see section ‘Quality control (QC)’ when establishing patient-derived organoid cultures.",
    "Transfer the tissue fragments to a 50 mL plastic tube by pipetting 5 mL of D-BSA in the petri-dish. Use a pre-wetted 5 mL serological pipette to transfer the material from the petri-dish to the 50 mL plastic tube. Wash the petri-dish with 5 mL of D-BSA and transfer to the 50 mL plastic tube. Rinse the used scalpels with D-BSA to assure all available material is collected for digestion.\nAdd 30 mL of D-BSA and pipette up and down the tissue fragments ten times using a pre-wetted 10 mL serological pipette.\nLet this tissue sediment by gravity to the bottom of the tube (this will take 2–3 min).\nAspirate the top 30 mL of D-BSA.\nRepeat steps 6–8 two more times.\nResuspend the tissue fragments in the remaining 10 mL D-BSA and transfer them to a 15 mL plastic tube. Let the tissue fragments settle by gravity.\nRemove supernatant by aspiration.\nFor normal/wildtype tissue: resuspend the tissue fragments in 5 mL of Digestion buffer for normal tissue (1× HBSS , 1 mg/mL collagenase type II, 10 μM ROCK inhibitor, 100 μg/mL Trypsin inhibitor and 5% glycerol, see section ‘Materials and Equipment’).\nFor tumor tissue: resuspend the tissue fragments in 5 mL of Digestion buffer for tumor tissue (Ad-DF+++, 5 mg/mL collagenase type II containing 10 μM ROCK inhibitor, see section ‘Materials and Equipment’).\nPlace the 15 mL plastic tube containing material in a 37°C incubator containing a shaker (140 rpm at a low angle (∼15˚)).\nNote: If a shaker is not available, place the tube in a 37°C water bath. When using a water bath, make sure to pipette up and down the material every 10 min, using a P1000 pipette with a low-retention tip.",
    "Note: Parafilm can be used to wrap the 15 mL plastic tube, to minimize contamination risk.\nTissue Digestion\nTiming: 3–25 h, including 2–24 h incubation time\nTissue digestion\nFor normal tissue, do not exceed a digestion of 2 h. Monitor the digestion at least every 30 min, using a bright-field microscope. When clusters of 5–10 cells are observed, digestion is complete. It is recommended to pipette up and down every 30 min using a pre-wetted 5 mL serological pipette to aid digestion.\nFor tumor tissue, digestion can be performed for a maximum of 24 h. Do not exceed 24 h digestion. Monitor every 30 min for the first 4 h of digestion. After the first 4 h of digestion, monitor at regular intervals (as much as schedule/working hours allow). Similar to the digestion of normal tissue, monitor the digestion of the tissue using a bright-field microscope. When clusters of 5–10 cells are observed, digestion is complete. It is recommended to pipette up and down every 30 min (or post 4 h of incubation, every time digestion is monitored) using a pre-wetted 5 mL serological pipette to aid digestion.\nTo stop digestion, add 1 mL FBS directly to the digestion mixture.\nAdd 7 mL of D-BSA using a 5 mL serological pipette.\nUsing the same pipette (that is now pre-wet by the D-BSA), pipette the tissue mixture up and down for 20 times vigorously.\nCentrifuge at 200 × g for 5 min at 8°C.\nCarefully aspirate the supernatant (we recommend the use of a P1000 for the last remaining liquid). 500 μL of liquid can be left on the pellet.\nAdd 10 mL D-BSA to the tube and spin at 450 × g for 5 min at 8˚C.",
    "Carefully aspirate the supernatant (we recommend the use of a P1000 for the last remaining liquid). 500 μL of liquid can be left on the pellet.\nResuspend the pellet in 7 mL D-BSA and filter over a 100 μm pore size filter. Collect flow-through in a clean 50 mL plastic tube.\nWash the filter with an additional 7 mL Ad-DF+++ and pool the flow-through with the cell suspension collected in step 21.\nCentrifuge at 200 × g for 5 min at 8°C.\nNote: Material that remains on the filter can be collected and stored, for example, to perform SNP validation of the established organoid culture later in time.\nCarefully aspirate the supernatant (we recommend the use of a P1000/P200 for the last remaining liquid).\nEstablishment of Pancreas Organoid Culture\nTiming: 50–80 min, including 40–45 min plate incubation\nResuspend the pellet in 25–30 μL of pancreatic normal (or tumor) medium and the appropriate amount of Matrigel/BME (as a rule of thumb, 200 μL Matrigel/BME for a cell pellet of approximately 50 μL can be used). Resuspend carefully to prevent the formation of air bubbles. Assure that cell pellet is mixed well with the Matrigel/BME. Assure that the percentage of Matrigel/BME stays > 80%.\nMake small droplets (5 to 10 μL each) of the Matrigel/organoid or BME/organoid mixture that was generated in the step above per well of a pre-warmed 24-well plate. Plate the droplets on the bottom of the plate. You can make 4–6 drops per well (for a total of ∼50 μL per well).\nInvert the plate and leave the plate for 5 min in the flow cabinet. The solidification of the Matrigel/BME will commence, which will make the Matrigel/BME droplets more stable before transporting the plate to the incubator.",
    "After 5–10 min, transfer the plate to a 37°C and 5% CO2 incubator. Leave the plate for 30 min, allowing the Matrigel/BME to solidify.\nCritical: Keep the plate inverted during this time to prevent the cells to sink to the bottom of the plate, which could result in 2D growth of the epithelial cells on the bottom of the wells. This phenomenon is not frequently observed in pancreatic organoid cultures but can nonetheless occur (Figure 7[href=https://www.wicell.org#fig7]D).\nPause Point: The specific organoid culture medium could be added at the end of day, since the tissue has been embedded in Matrigel/BME containing some organoid culture medium, therefore enough growth factors can support the growth and survival of the epithelial cells.\nAdd 500 μL organoid culture medium (pancreatic normal medium for normal tissue or the two different pancreatic tumor mediums for tumor samples) containing 10 μM ROCK Inhibitor to each of the wells that contain cells. Carefully add the media to the wells, using the side of the wells, to not disturb the formed Matrigel/BME droplets. For tumor samples, use one tumor medium for half of the plated wells, the other tumor medium for the other half of the wells.\nNote: In case both tumor medium (1 and 2) support organoid growth, authors recommend expanding and characterizing organoid established with both mediums to identify different tumor clones from the same tumor (Figure 3[href=https://www.wicell.org#fig3]D).",
    "Critical: Always carefully monitor freshly isolated cultures. Always check the culture plate 24 h after initial plating for (1) potential fungal or bacterial infections (Figure 1[href=https://www.wicell.org#fig1]) and (2) digestion of the Matrigel/BME. Some primary cultures digest the Matrigel/BME. If left unattended, the culture will not survive. When this occurs, collect material from the wells in a 15 mL plastic tube, centrifuge at 450 × g for 5 min at 8˚C. Carefully aspirate the supernatant and repeat steps 25–29, using a fresh pre-warmed 24-well plate. Figure 1[href=https://www.wicell.org#fig1] shows examples of bacterial (Figures 1[href=https://www.wicell.org#fig1]A and 1B) or fungal (Figure 1[href=https://www.wicell.org#fig1]C) contamination of a primary organoid culture. Bacteria can grow as colonies inside the Matrigel/BME domes (Figure 1[href=https://www.wicell.org#fig1]A), making their appearance somewhat similar to organoids to the inexperienced eye. If bacteria grow in the organoid media, they sediment to the bottom of the plate, where their presence is most notable around the edge of the Matrigel/BME domes (Figure 1[href=https://www.wicell.org#fig1]B). Fungal contamination can also occur, either by mold or yeast (as shown in Figure 1[href=https://www.wicell.org#fig1]C).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/302-Fig1.jpg\nFigure 1. Bacterial and Fungal Infections in Organoid Cultures\n(A) Bacterial infection in BME/Matrigel drop. Representative bright-field microscopy images of bacterial colonies (indicated by arrows) that grew inside the BME/Matrigel drops. Because of their shape, the round colonies can be interpreted by some as organoids if only look at briefly when quickly scanning a culture plate. In the BME droplet shown here, an organoid was also present (indicated by an asterisk). Scale bar, 500 μm left panel, 100 μm right panel.",
    "(B) Bacterial infection in organoid culture medium. Representative bright-field microscopy images of bacteria growth in culture organoid medium. In this case, a darker “halo” can often be observed around the BME/Matrigel droplet. This is where the bacteria accumulate. The media also can appear cloudy (because of the presence of bacteria). Scale bar, 500 μm left panel, 100 μm right panel.\n(C) Fungal (yeast) infection in an organoid culture. Representative bright-field microscopy images of yeast cell, which is much larger than a bacterium. Often, white “colonies” can be observed by the naked eye in the BME/Matrigel drops. Here, the yeast networks (arrows) mainly grew from organoids (asterisk), which can still be seen present hidden under the yeast. Scale bar, 100 μm left panel, 50 μm right panel.\nOrganoids will usually be visiable 2–4 days after plating. Normal organoids appear as cystic structures, whereas tumor organoids can appear as either cystic or dense structures. Figure 2[href=https://www.wicell.org#fig2] shows examples of these two different morphologies as seen through a bright-field microscope. Two cystic tumor organoid cultures are shown in Figure 2[href=https://www.wicell.org#fig2]A. Figure 2[href=https://www.wicell.org#fig2]B depicts two-tumor organoid cultures that display a dense phenotype. Some organoid cultures can show a mixed phenotype, showing both dense and cystic organoids. Refresh organoid media every 2–3 days to assure sufficient growth factors are supplied to the organoids. Keep ROCK inhibitor in the media for the first week after isolation. When removing media, carefully aspirate using a P1000 pipette without disturbing the Matrigel/BME droplets. Be aware that, over time, Matrigel/BME can disintegrate, making the droplets less stable and detach more easily from the well\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/302-Fig2.jpg\nFigure 2. Examples of the Cystic and Dense Morphologies of Pancreatic Organoid Cultures",
    "(A) Representative bright-field images of two patient-derived pancreatic tumor organoid cultures with cystic morphology. The top two panels show an organoid culture that has a cystic appearance similar to a normal culture; forming thin-walled large cysts. The bottom two panels show a cystic culture with a phenotype that is only observed in tumor cultures and not in normal (non-tumor) cultures. These cysts are thick-walled, appear dark, and often contain dead cells in the center of the structures. Although these organoids do not show an empty lumen, they are still clearly cystic, containing a (single- or multi-) layered row of epithelial cells that surround an internal compartment that does not contain epithelial cells. Scale bar left panels, 500 μm. Scale bar right panels, 100 μm.\n(B) Representative bright-field microscopy images of two patient-derived pancreatic tumor organoid cultures that show an overall dense morphology. In the dense structures, no lumen can be observed. However, in both cultures shown here, a fraction of the organoids of the culture showed a lumen, thereby representing a mixed phenotype. Organoids that form a lumen are indicated by an asterisk, whereas examples of dense organoids are indicated using an arrow. Such mixed phenotype cultures are commonly observed. Scale bar left panels, 500 μm. Scale bar right panels, 100 μm.\nNote: If Matrigel/BME drops detach and start to float, media changes become more difficult due to the increased risk of aspirating the organoids. In that case, re-seeding the organoids is highly recommended. For this, collect material from the culture plate and pool it in 15 mL plastic tube. Centrifuge at 450 × g for 5 min at 8˚C. Carefully aspirate the supernatant and repeat steps 25–29, using a fresh pre-warmed 24-well plate.\nPassaging Pancreas Organoid Cultures\nTiming: 30–60 min",
    "Depending on the amount of starting material and on the percentage of viable epithelial cells in the culture, outgrowth efficiency can vary. Some tumor samples grow equally well on both tumor mediums (as the culture shown in Figure 3[href=https://www.wicell.org#fig3]A). However, others grow better in only one of the tumor medium (such as the organoid culture sample 2 shown in Figure 3[href=https://www.wicell.org#fig3]B) or in neither of the tumor mediums (Figure 3[href=https://www.wicell.org#fig3]C). For a flowchart, for decision taking, on expansion of cultures on different mediums, see Figure 3[href=https://www.wicell.org#fig3]D. Growth rates between samples derived from different patients vary. For the first passage, wait until 80% of the organoids are larger than 50–70 μm before processing them for next passage. This usually takes around 14–21 days (Figure 3[href=https://www.wicell.org#fig3] shows organoids grown from isolated primary material that are ready to be passaged). To determine the split ratio and frequency of a newly established culture, as a rule of thumb, pancreatic normal organoids can generally be passaged 1:2–1:3 every 7–10 days. Pancreatic tumor organoids can be passaged 1:2–1:6 every 7–10 days. Work in a conservative way, rather plating the organoids dense (with a low split ratio) than seeding them too sparse. You can always dilute further once the organoids start growing and the density turns out to be too high. In general, organoid cultures (especially normal cultures) do not take it well when they are diluted too much. In newly established cultures, from which the passage rate is not yet determined, closely monitor the culture for the first days after passaging. If organoids in the center of Matrigel/BME drops are dying, this is an indication that the organoids were seeded too densely. Two examples of this are shown in Figure 4[href=https://www.wicell.org#fig4]A.",
    "If this phenomenon is observed, re-seed organoids in a larger volume of Matrigel/BME without passaging the organoids. Let the organoids grow until they reach the desired size before being disrupted for passaging. As mentioned above, organoid cultures derived from different patients differ in their growth rate and optimal passage density. However, to get a general idea of suitable passaging densities, Figures 4[href=https://www.wicell.org#fig4]B–4D show representative bright-field images of three different pancreatic tumor organoid cultures right after passaging. The second panel then shows the result of the plating after passaging. Figure 4[href=https://www.wicell.org#fig4]B shows a cystic culture that was plated at a density that was too low. Figures 4[href=https://www.wicell.org#fig4]C and 4D show examples of correct seeding densities for a cystic culture and a compact culture, respectively.",
    "imgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/302-Fig3.jpg\nFigure 3. Epithelial Cells Isolated from Tumor Resections Show Variable Outgrowth on the Different Tumor Organoid Media\n(A–C) Representative bright-field images showing the outgrowth of three samples (isolated from tumors of three different patients), when cultured in either tumor media 1 (TM1, left panels) or tumor media 2 (TM2, right panels). While sample 1 (S1) seemed to grow out equally well in both media, sample 2 (S2) showed a clear preference for TM2. Sample 3 (S3) did not grow in any of the two-tumor media. Scale bars, 100 μm.\n(D) Flowchart for helping decision taking when establishing organoid models using the different tumor media. S1, S2, and S3 indicated in the flowchart refer to the representative images shown in (A)–(C).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/302-Fig4.jpg\nFigure 4. Passaging of Organoid Cultures\n(A) Representative bright-field images of two organoid cultures that were plated too densely after passaging, resulting in death of organoid structures. Death can be observed mostly in the center of the BME/Matrigel dome, most likely because of lack of nutrients (that diffuse into the droplet from the media) and oxygen. Live organoids (enriched on the side of the drops) are indicated by arrows, whereas dead organoids (enriched on the center of the drops) are indicated with asterisks. Scale bar, 500 μm.\n(B–D) Representative bright-field microscopy images of three different organoid cultures split for passaging. The left panels show the appearance of the cultures right after shearing (d0). The right panels show the appearance of the cultures few days later (7–8 days) and right before they will be passaged.",
    "(B) Representative bright-field image of a culture that was plated with a density that was too low, as can be seen by the limited number of organoids that grew out after 7 days in culture. Here, the organoid culture was pooled (the material was collected and replated in a smaller volume of BME) to assure that organoids were in close proximity to each other. After that, when organoids grew big, the culture could be passaged again.\n(C and D) Representative images of a cystic (C) and dense (D) organoid culture that were split and subsequently passaged at a correct density. This density allowed efficient outgrowth of the organoids, without the cell death shown in Figure 4[href=https://www.wicell.org#fig4]A as can be observed in the right-side panels. Scale bar, 500 μm.\nFor passaging, pipette the culture medium present in the wells up and down to disrupt the Matrigel/BME drops.\nNote: If the organoid medium contains cell debris, do not resuspend using the culture medium. Carefully aspirate the culture medium and add fresh D-BSA to resuspend the Matrigel/BME drops in.\nCollect all material in a 15 mL plastic tube. Top off to a total of 12 mL with ice-cold D-BSA.\nNote: A maximum of a half plate (organoids embedded in ∼600 μL of Matrigel/BME) can be pooled in one 15 mL plastic tube. If more material is collected for passaging, divide it over multiple tubes.",
    "Pipette up and down 10 times using a serological 10 mL pipette. Centrifuge at 85 × g for 5 min at 8°C. After centrifugation, check if the organoid pellet is clean (clean meaning that no Matrigel/BME remnants are present on top of the organoid pellet and that all organoids are contained in the pellet, therefore organoids are not scattered in a layer of Matrigel/BME present above the organoid pellet). If clean, proceed.\nNote: If the pellet border is not clean and contains Matrigel/BME (containing or not organoids), remove supernatant only up to the border and wash the pellet again (adding 10 mL of D-BSA) and repeat centrifugation, now at 450 × g for 5 min at 8°C. If the pellet still contains a layer of Matrigel/BME, but this Matrigel/BME is devoid of organoids, this layer can be removed carefully by aspiration.\nCritical: Matrigel/BME plays an important role stimulating organoid growth, therefore remaining Matrigel/BME form previous passage must be removed and replaced by fresh Matrigel/BME.\nOnce all organoids are collected in a clean pellet, remove supernatant without disturbing the pellet. If organoids of the same organoid culture were collected in more than one tube (see step 32), pool the pellets by resuspending each pellet in 4 mL D-BSA, pooling the suspension in one tube and centrifuging at 85 × g for 5 min at 8°C. If organoids are not pelleted, repeat the spin at 1,500 rpm (450 × g) 5 min at 8°C.\nRemove supernatant without disrupting the pellet.\nNote: For passaging organoids, the method applied depends on the morphology of the organoid culture. For passaging cystic (normal or tumor) organoids, follow steps 36a–36e. For dense tumor organoids, follow steps 37a–37i.\nNote: Normal organoids should not appear dense. A dense morphology is an indication that you are growing tumor cells.",
    "Cystic organoids: When passaging pancreatic cystic organoids, the new passage will be generated from clumps of cells. Do not make the pancreatic cystic organoids too small (or shear to a single-cell level), since this will negatively impact outgrowth efficiency. Pancreatic cystic pancreatic organoids should be split by mechanical shearing (using a pre-narrowed glass Pasteur pipette) and can be passaged every 7–10 days. For cystic organoids, splitting ratio ranges between 1:2 and 1:3.\nAdd Ad-DF+++ up until 1 mL and resuspend the organoid pellet very carefully.\nUsing a flame, prepare a pre-narrowed and pre-wet (with Ad-DF+++) sterile glass Pasteur pipette. For this, keep the tip of the glass Pasteur pipette in the flame and roll the pipette in your hand, assuring all sides of the pipette are heated equally. This will narrow the opening of the pipette (Figure 5[href=https://www.wicell.org#fig5]A). Alternatively, a P1000 with a 1,250 μL retention filter tip fitted with either a 200 (yellow) μL or 10 (white) μL tip on top can be used (Figure 5[href=https://www.wicell.org#fig5]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/302-Fig5.jpg\nFigure 5. Technical Aspects of Passaging Organoid Cultures\n(A) Representative images from glass Pasteur pipettes before (indicated by an asterisk) and after (indicated by arrowheads) narrowing of the opening by a flame. The second panel shows a side view of a glass pipette before (asterisk) and after (arrowhead) narrowing by flame.\n(B) Representative image of a P1000 pipette with a 1,250 μL tip that holds a 10 μL pipette tip on top, which can be used as an alternative to the narrowed glass pipette to shear organoids during passaging. The smaller volume tip on top of the larger volume tips narrows the opening of the tip, allowing the shearing of organoids.",
    "(C) Representative image indicating how a 15 mL plastic tube containing the organoid culture suspension can be placed under the bright-field microscope to monitor the size of organoids during passaging.\nShear the resuspended organoids by pipetting up and down 3 times. Avoid creating foam. Assure that the tip of the (glass) pipette touches the wall of the plastic tube. This generates a mechanical force that will aid to shear the organoids. Monitor shearing of organoids using a bright-field microscope. If sheared, continue the protocol. If not sheared, repeat to pipette up and down for a maximum of 20 times. Check the organoids after every 5 times of shearing (Figure 5[href=https://www.wicell.org#fig5]C). If still not disrupted after 20 times, centrifuge at 450 × g for 5 min at 8°C, remove supernatant and proceed to the passaging of the organoids as described for dense organoids (see section below).\nTop up to a total of 12 mL using D-BSA. Pipette up and down several times and centrifuge at 85 × g for 5 min at 8°C.\nNote: If organoids are not pelleted, repeat the spin at 1,500 rpm (450 × g) 5 min at 8°C.\nRemove supernatant carefully, without disturbing the pellet.",
    "Dense organoids: The first time disrupting a pancreatic dense organoid culture after isolation, always try to disrupt it with mechanical shearing as described for cystic organoids. If the organoids are not disrupted after pipetting them 20 times (as described in the section above), then use enzymatic shearing as described in this section. Dense organoids are generated from tumor samples. For most dense tumor cultures, organoids can be disrupted to a single-cell level without compromising the growth of organoids in the next passage, however, it is always recomended not to reach single-cell level. Pancreatic dense organoids can usually be split every 7–10 days. For dense organoids, splitting ratio ranges usually between 1:2 and 1:5.\nAdd 750 μL of Ad-DF+++ to the cell pellet (see step 35) and resuspend. Add 250 μL of TrypLE. Add ROCK inhibitor to a final concentration of 10 μM. Place the tube for 30 s in the 37°C water bath. Vortex and check organoid shearing using a bright-field microscope. If organoids are disrupted, proceed to step 37g.\nNote: Both Ad-DF+++ and TrypLE need to be at room temperature (between 18°C and 22°C).\nNote: TrypLE is diluted with Ad-DF+++ to decrease its activity, thereby preventing that digestion occurs too quickly and results in a single-cell suspension.\nIf organoids are not sheared after the TrypLE incubation, prepare a pre-narrowed and pre-wet sterile Pasteur pipette (Figure 5[href=https://www.wicell.org#fig5]A), or a P1000 with a 1,250 μL retention filter tip with a 200 (yellow) μL or 10 (white) μL tip (Figure 5[href=https://www.wicell.org#fig5]B). Shear the organoids by pipetting the 1 mL suspension up and down at least five times. Avoid creating foam by keeping the tip immersed under liquid and pipetting up and down slowly.",
    "Check organoid shearing using a bright-field microscope (Figure 5[href=https://www.wicell.org#fig5]C). When sheared sufficiently, proceed to step 37g. If not, pipette up and down a maximum of 20 times. Check shearing after each five times of passaging. When sheared sufficiently, proceed to step 37g.\nIf the culture is difficult to disrupt and organoids are not sufficiently sheared, place the organoid suspension in a 37°C water bath and incubate for a maximum of 5 min, checking the organoids every 2 min.\nIf organoids are still not disrupted, add 250 μL of TrypLE and place the tube for 30 s in the 37°C water bath. Vortex and check organoid shearing using a bright-field microscope. If organoids are disrupted, proceed to step 37g.\nIf organoids are not sheared sufficiently, place organoid suspension in TrypLE solution in a water bath at 37°C. Incubate while revising the status of the organoids every 2 min under the bright-field microscope. Vortex the tube before checking the organoids.\nOnce organoids are disrupted, add Ad-DF+++ to a total of 12 mL.\nPipette up and down several times with a 5 mL plastic pipette and centrifuge at 85 × g for 5 min at 8°C.\nNote: If organoids are not pelleted, repeat the spin at 1,500 rpm (450 × g) 5 min at 8°C.\nRemove supernatant carefully, without disturbing the pellet.\nPlating Organoids\nTiming: 1 h, including 40 min plate incubation\nPancreatic organoid cultures derived from different donors can vary in growth rates. Even when properly cultured, tumor cultures can contain cells that show signs of cell death, even though the culture as a whole will survive over time. This might potentially be due to an increase in genomic instability (e.g., caused by loss of the tumor suppressor TP53) that can be observed in tumor cells.",
    "Resuspend the organoid pellet in 12 mL Ad-DF+++ to wash. Pipette up and down three times.\nCentrifuge at 85 × g for 5 min at 8°C. After centrifugation, check (using a bright-field microscope) if the border between the pellet and supernatant is clean.\nNote: If organoids are not pelleted, repeat the spin at 450 × g 5 min at 8°C.\nRemove supernatant as much as possible without disturbing the organoid pellet. Add a small amount of specific organoid medium (<30% of the pellet volume) and resuspend the cell pellet.\nEstimate the volume of the sheared organoids and the medium remaining in the tube. Resuspend the contents of the tube in 80% Matrigel/BME, dissolved in the organoid medium of choice (normal medium or tumor medium 1 or 2). As a rule of thumb 50 μL of cell suspension can be plated in 200 μL of Matrigel/BME.\nPlate a 5 μL drop in pre-warmed cell culture plate and check the organoid density. Dilute further if the density is too high (see Figure 4[href=https://www.wicell.org#fig4]A as example). If density is too low (Figure 4[href=https://www.wicell.org#fig4]B), wash and centrifuge to pellet the organoid fragments. After removing the supernatant, organoids can be plated in the required (smaller volume) of Matrigel/BME.\nOnce the correct organoid density has been reached, plate a maximum of 200 μL Matrigel/BME per well for a 6-well plate, 100 μL Matrigel/BME per well of a 12-well plate, or 50 μL per well of a 24-well plate in small drops (5–10 μL/drop). Making smaller droplets will improve the diffusion of growth factors into the Matrigel/BME. Avoid creating air bubbles while plating.\nInvert the plate, in one swift motion, and leave it in the hood for 5–10 min.\nNote: This will prevent the bigger organoids from sinking to the bottom of the well.",
    "Incubate the plate upside down in the corresponding incubator for 30–40 min.\nPause Point: The specific organoid culture medium could be added at the end of day, since the tissue has been embedded in Matrigel/BME containing some organoid culture medium, therefore enough growth factors can support the growth and survival of the organoid cells.\nAdd 2 mL (6-well plate), 1 mL (12-well plate), 500 μL (24-well plate) of the corresponding culture medium containing 10 μM ROCK inhibitor and place the plate in the incubator at 37°C and 5% CO2.\nRefresh medium every 2–3 days.\nPancreatic organoids are usually passaged every 5–10 days depending on their growth and density. Repeat passaging cycles until the desired amount of material is obtained for freezing.\nFreezing of Organoids\nTiming: 1–2 h for passaging, 30 min for collecting for freezing 1–3 days later\nPassage organoids according to their morphology, as described above. Be mindful that, when passaging for freezing, organoids should never be passaged until single-cell level.\nPlate the sheared organoids in 50% Matrigel/BME (1:1 diluted with the corresponding organoid culture medium) in a per-warmed culture plate. Plate a maximum of 200 μL Matrigel/BME per well for a 6-well plate, 100 μL Matrigel/BME per well of a 12-well plate, or 50 μL per well of a 24-well plate in small drops (5–10 μL per drop). Making smaller droplets will help improve the diffusion of growth factors into the Matrigel/BME. Avoid creating air bubbles while plating.\nInvert the plate and leave it in the hood for 5–10 min.\nNote: This will prevent the bigger organoids from sinking to the bottom of the well.\nIncubate the plate upside down in the corresponding incubator for 30–40 min.",
    "Add 2 mL (6-well plate), 1 mL (12-well plate), 500 μL (24-well plate) of the corresponding culture medium containing 10 μM ROCK inhibitor and place the plate in the incubator at 37°C and 5% CO2.\nMonitor the organoid culture daily. Organoids can be frozen when a minimum of 80% of the culture has reached a size > 30 μm. Generally, this occurs between 1 and 3 days after passaging, depending on the growth speed of the organoid culture. Figure 6[href=https://www.wicell.org#fig6] shows representative bright-field microscopy images of organoid cultures that are passaged in preparation of freezing (first panel), and their morphology on the day of freezing (second and third panel). Refresh medium every other day until the organoids are ready for freezing. ROCK inhibitor only needs to be added directly after passaging.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/302-Fig6.jpg\nFigure 6. Freezing of Pancreatic Tumor Organoid Cultures\nRepresentative bright-field images showing the morphology of three different pancreatic tumor organoid cultures in the passage for freezing. The left panels depict how the cultures looked directly after performing 1:1 passaging in preparation of the freezing of the culture. The panels on the right side show the morphology of the same cultures on the day they were frozen. The day of freezing is indicated on the left corner of the image. As can be seen in these images, different cultures (with different growth speeds) require a different amount of days before they reach the right size for freezing. Scale bar left and central panels, 500 μm. Scale bar right panels, 100 μm.\nCritical: It is essential that organoids are frozen when they are in an exponential growth phase. Therefore, first plating the organoid fragments and allowing them to form organoids containing proliferating cells increases cell recovery after thawing.",
    "When organoids have reached the correct size for freezing (see Figure 6[href=https://www.wicell.org#fig6] for examples), place the cryovials, freezing medium and 2 mL serological pipettes (in the original wrapping) that will be required on ice.\nUse a D-BSA pre-wetted P1000 pipette to collect organoids from the culture plate by resuspending the medium in the well and using it to break up the Matrigel/BME drops. Transfer the collected material to a 15 mL plastic tube.\nWash the emptied wells with 1 mL of Ad-DF+++ and transfer this to the 15 mL plastic tube to assure all material is collected.\nFill up the tube to a total of 12 mL with Ad-DF+++. Pipette up and down 5 times using a 10 mL serological pipette.\nCentrifuge the organoid suspension at 85 × g for 5 min at 8°C.\nNote: If organoids are not pelleted, repeat the spin at 450 × g for 5 min at 8°C.\nCarefully aspirate the supernatant without disturbing the organoid pellet.\nResuspend the pellet in 12 mL of Ad-DF+++ using a 10 mL serological pipette. Pipette up and down 5 times to wash the organoids.\nCentrifuge at 450 × g for 5 min at 8°C.\nConfirm organoids are pelleted using a bright-field microscope. If they are, carefully aspirate the supernatant, without disturbing the pellet. If not, repeat centrifugation.\nAdd the corresponding volume of freezing medium with a 10 mL serological pipette while keeping the organoid pellet on ice. Use 500 μL of freezing medium for each 100 μL of original volume of Matrigel/BME collected in step 56.\nOnce all the freezing medium is added, pipette up and down carefully with a precooled 5 mL serological pipette to resuspend all organoids in the freezing medium. Keep the tube(s) on ice.",
    "Aliquot 0.5 mL organoid suspension in each cryovial, using the precooled 2 mL serological pipette. To assure equal distribution of the collected organoids over the different cryovials, do not use larger volume pipettes at this point. Work quickly.\nTransfer the cryovials from ice into the appropriate precooled (precooled at least 12–16 h at 4°C) Coolcell and transfer the Coolcell to −80°C.\nPlace the Coolcell in a −80°C freezer.\nAfter >24 h, transfer the cryovials to the liquid nitrogen for long-term storage. Do not leave the cryovials in −80°C for >15 days.\nThawing of Cryopreserved Organoids\nTiming: 1–1.5 h, including 40 min plate incubation\nPre-warm 30 mL of Ad-DF+++ at 37°C in a 50 mL plastic tube. Place Matrigel/BME on ice at least 30 min before being used for plating organoids.\nCollect the cryovial that will be thawed from the liquid nitrogen container and transfer it to dry ice.\nThaw the cryovial rapidly by agitation in a 37°C water bath until only small fragments of frozen material remain. Thawing should not take longer than 2–3 min.\nWipe the cryovial with a tissue paper sprayed with 70% ethanol.\nDropwise, add 0.5 mL of the pre-warmed Ad-DF+++ to the contents of the cryovial.\nCarefully mix the content of the cryovial and transfer the organoid suspension to a 15 mL plastic tube.\nDropwise, add an additional 1 mL of warm Ad-DF+++ to the organoid suspension, while gently shaking the plastic tube (by tapping it with your pinky finger).\nAdd pre-warmed Ad-DF+++ up to a total of 12 mL dropwise, using a 10 mL serological pipette and resuspend organoids gently by pipetting up and down with a 10 mL sterile pipette.\nCentrifuge at 85 × g for 5 min at 8°C.",
    "Using a bright-field microscope, check if the organoid pellets contain remnants of Matrigel/BME. If there is either no Matrigel/BME, or the Matrigel/BME is free of organoids, aspirate the supernatant including the Matrigel/BME carefully, without disturbing the pellet. If there is Matrigel/BME present that contains organoids, centrifuge again at 450 × g for 5 min at 8°C and carefully remove the supernatant.\nAdd 10 mL of pre-warmed Ad-DF+++ and gently resuspend the organoid pellet.\nCentrifuge at 450 × g for 5 min at 8°C.\nCarefully aspirate the supernatant, without disturbing the pellet, and place the tube on ice.\nNote: Remove the remaining Ad-DF+++ using a P200 pipette with 200 μL filter tip.\nNote: Try to remove any remaining Matrigel/BME if it does not contain a significant number of organoids.\nResuspend the organoid pellet in the desired amount of ∼80% Matrigel/BME. For this, take the volume of the organoid pellet into account, when calculating how much of the corresponding organoid medium needs to be added to reach a ∼80% Matrigel/BME solution.\nNote: Resuspend the organoid pellet in the desired amount of organoid medium, before adding the Matrigel/BME. Mixing the pellet directly with 100% Matrigel/BME will be difficult, due to the viscosity of undiluted Matrigel/BME.\nMake a droplet of 5 μL Matrigel/BME and check if the organoid density is correct using a bright-field microscope.\nIf density is appropriate, continue plating. If density is too high, add more 80% Matrigel/BME.\nNote: Directly after thawing, organoid density should be high. This will help the organoids recover from the thawing process.",
    "Plate the organoid/Matrigel/BME mixture in a pre-warmed culture plate. Plate a maximum of 200 μL Matrigel/BME per well for a 6-well plate, 100 μL Matrigel/BME per well of a 12-well plate, or 50 μL per well of a 24-well plate in small drops (5–10 μL per drop). Making smaller droplets will help improve the diffusion of growth factors into the Matrigel/BME. Avoid creating air bubbles while plating.\nInvert the plate, in one swift motion, and leave it in the hood for 5–10 min.\nNote: This will prevent the bigger organoids from sinking to the bottom of the well.\nIncubate the plate upside down in the corresponding incubator for 30–40 min.\nAdd 2 mL (6-well plate), 1 mL (12-well plate), 500 μL (24-well plate) of the corresponding culture medium containing 10 μM ROCK inhibitor and place the plate in the incubator at 37°C and 5% CO2.\nRefresh the medium every 2–3 days. Once organoids have reached the correct size, passage them as previously described.\nIf organoids recover properly from thawing, passage them when they reach the right size to be processed (see relevant protocol).\nNote: This procedure can take place either 5 up to 15 days after thawing. This depends on the organoid culture used (cultures derived from different patients show different growth speeds) and size of the organoids when frozen."
  ],
  "subjectAreas": [
    "Organoids",
    "Stem Cells",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}