{
  "id": 4373,
  "origin_website": "Bio",
  "title": "ELISA on Virus-Infected Cells",
  "procedures": [
    "Part I. Considerations for the experimental designCells are fixed at 3 different stages in the viral entry process: (i) after virion binding at 4 °C, (ii) after cell entry at 37 °C for 1 h, and (iii) after cell entry at 37 °C for 2 h. For each of these conditions, a separate tissue culture plate is used.At least 6 wells should be infected for each experimental condition (virus, treatment, antibody etc.).On each plate, at least 6 wells should be left uninfected in order to determine the background signal for each virus-specific monoclonal antibody.If the assay is used to study the entry process of viruses pretreated with neutralizing antibodies, it might be necessary to use IgG subclass-specific secondary antibodies in order to avoid binding of the secondary antibody to the neutralizing antibody (Glauser et al., 2012a).Part II. Experimental procedure Day 1Passage and seed cellsGrow NMuMG cells in a 150 cm2 tissue culture flask until they form a 90-100% confluent monolayer. One 150 cm2 tissue culture flask yields approximately 2-3 x 107 cells, the experiment described below requires 6 x 106 cells. Wash cells 1x with 10 ml sterile PBS, then overlay with 5 ml Trypsin-EDTA and incubate for 10 min at 37 °C. Detach the cells by hitting the flask, then add 15 ml complete medium. Re-suspend cells by pipetting up and down, centrifuge 3 min at 350 x g at 4 °C and discard the supernatant. Re-suspend cells in 10 ml fresh complete medium, mix a small aliquot 1:1 with trypan blue and count with hemocytometer. Seed cells into 96-well tissue culture plates (20,000 cells in 100 µl complete medium/well) and incubate overnight at 37 °C.",
    "Day 2Binding of virus to cells (work in 4 °C cold room)Dilute virus (MOI of 5 PFU or 15 eGFP units/cell) in complete medium (83 µl/well) in 5 ml Bijoux tubes.Pre-cool the 96-well tissue culture plates containing the cells and the tubes containing the diluted viruses for 1 h on ice at 4 °C.Gently tap off the cell medium and overlay cells with 83 µl/well diluted viruses or complete medium (uninfected controls), incubate for 2 h on ice at 4 °C.Gently wash the cells 3x with ice-cold PBS (approximately 300 µl/well).Fixation of cells after cell binding at 4 °CTake one plate and overlay the cells with ice-cold PBS containing 4% formaldehyde (100 µl/well), incubate for 1 h at room temperature (RT).In order to stop the fixation, gently tap off the fixative and incubate the cells with PBS containing 0.1 M glycine (100 µl/well) for 15 min at RT.Wash the cells 3x with PBS (approximately 300 µl/well).Permeabilize the cells by incubation with PBS containing 0.1% Triton-X100 (100 µl/well) for 30 min at RT.Block the cells by overnight incubation with PBS containing 0.1% Tween 20 and 2% BSA (100 µl/well) at 4 °C.Fixation of cells after cell entry at 37 °CTake the remaining two plates and overlay the cells with ice-cold complete medium (83 µl/well), then incubate one plate for 1 h and the other for 2 h at 37 °C. Wash the cells 1x with ice-cold PBS (approximately 300 µl/well), then fix and treat as described in steps C1-5.Day 3Detection of virions by ELISARemark: For the primary antibodies use a concentration which gives a strong signal in immunofluorescence (IF). In our experience, hybridoma supernatants diluted 1:2 give good signals in IF and ELISA. Dilute primary antibodies (hybridoma supernatants) in PBS containing 0.",
    "1% Tween 20 and 2% BSA, add to cells (50 µl/well) and incubate 3 h at RT. Wash cells 3x with PBS containing 0.1% Tween 20 (approximately 300 µl/well).Centrifuge secondary antibody (alkaline phosphatase conjugate) for 10 min at 16,000 x g in a cooled tabletop microfuge (4 °C) to remove any potential antibody aggregates.Dilute secondary antibody 1:1,000 in PBS containing 0.1% Tween 20 and 2% BSA, add to cells (100 µl/well) and incubate 3 h at RT.Wash cells 6x with PBS containing 0.1% Tween 20 (approximately 300 µl/well).Dilute p-nitrophenyl phosphate in H2O according to manufacturer's instructions, add to cells (100 µl/well) and incubate overnight at RT and protected from light.Measure absorbance at 405 nm on an ELISA microplate reader. If the microplate reader can measure at a reference wavelenght, use 650 nm.Part III. Data interpretationThe absorbance values should not be considered an absolute measure of virion antigenicity, instead they should only be used to compare the antigenicity of virions between the different stages of virus entry, i.e., virus binding at 4 °C and virus entry at 37 °C for 1 or 2 h.The absorbance signal which is measured on uninfected cells can be considered the background signal of the respective monoclonal antibody and can be subtracted from the absorbance values measured on infected cells (for an example, see Figure 1A-B).If the aim of the experiment is to compare the virion antigenicity of a single virus at different entry stages, the absolute absorbance values can be shown (Glauser et al., 2012b).If the aim of the experiment is to compare the entry kinetics of different virus mutants (Glauser et al., 2013), the absorbance values for each virus mutant should be normalized to the values measured after virion binding at 4 °C (for an example, see Figure 1C).",
    "If the aim of the experiment is to compare the effect of different neutralizing antibodies on virus entry (Glauser et al., 2012a), the absorbance values for each virus-antibody combination should be normalized to the values measured after virion binding at 4 °C, because virus neutralization can either increase or decrease cell binding.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140510/20140510073303_4854.jpgFigure 1. Wild-type, mutant 1, mutant 2, and mutant 1 revertant MuHV-4 (MOI 15 eGFP units/cell) were bound to NMuMG cells for 2 h at 4 °C. After 3 washes with ice-cold PBS to remove unbound virions, the cells were either fixed directly or after further incubations at 37 °C to allow virion endocytosis. The cells were then incubated with mAb BN-1A7 recognizing the pre-fusion conformation of MuHV-4 glycoprotein B and bound antibody detected with an alkaline phosphatase-conjugated secondary antibody and incubation with p-nitrophenyl phosphate substrate. The bars show mean values from 6 wells ± standard error of the mean. (A) Mean absorbance readings at 405 nm (raw data). (B) The signal measured on uninfected cells was taken as background and subtracted from the signals measured on the infected cells. (C) After subtraction of the background signal, all values were normalized to the values measured after virus binding at 4 °C. This allows better comparison of the entry kinetics different virus mutants."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}