{
  "id": 16992,
  "origin_website": "Jove",
  "title": "Determining Gender-Based Differences in Retinal and Choroidal Thickness in Underweight Individuals via Swept-Source Optical Coherence Tomography",
  "procedures": [
    "This research was conducted at Huashan Hospital of Fudan University from January 2020 to October 2020. The study was approved by the Institutional Review Board of Huashan Hospital (No. KY2016-274), and all participating adults provided written informed consent.\n1. Selection of participants\nRecord all participants' demographic characteristics, such as age, gender, and a history of systemic diseases. Consider the following as the exclusion criteria: (1) age < 18 years or > 70 years old and (2) a history of systemic diseases related to retinal or choroidal thickness, including diabetes mellitus, hypertension, and thyroid disease.\n\t​NOTE: The elderly population, particularly those aged over 70 years, frequently experienced severe cataracts that could affect the quality of OCT images.\nLet all adult participants involved in the research undergo ophthalmic examinations. Consider the following as the exclusion criteria: (1) intraocular pressure (IOP) >21 mmHg; (2) best-corrected visual acuity (BCVA) worse than 0.1 LogMAR; (3) spherical equivalent more than ± 6 diopters; (4) a history of ocular diseases, including retinal disease, choroidal disease, and glaucoma; and (5) any previous ocular surgery.\n2. Body mass index calculation\nMeasure the participants' height and weight using a height-weight measuring instrument (see Table of Materials).\nCalculate the BMI using the formula: weight / (height x height) (kg/m2).\nClassify the subjects into two groups based on the World Health Organization International Classification28: the underweight group (BMI <18.50 kg/m2) and the normal group (18.50 ≤ BMI < 25.00 kg/m2).\n3. Swept-source optical coherence tomography scan\nTurn on the Power switch on the SS-OCT device (see Table of Materials) with a 1050 nm wavelength.\n\tNOTE: This SS-OCT system, capable of 1,00,000 scans/s, has recently undergone significant improvements, enhancing the visualization of the retina and choroid.\nClick on the Radial Dia.6.0mm Macula Overlap 4 button to access the scanning interface.",
    "Capture high-quality images for each eye of the participants during the scanning process.\n\tNOTE: The OCT scans were performed by experienced ophthalmologists between 8 and 10 a.m. daily to minimize diurnal variations29.\nGenerate a thickness map following the standard early treatment diabetic retinopathy study (ETDRS) grid.\nDefine retinal thickness (Figure 1A,B) and choroidal thickness (Figure 2A,B) as previously described27,30.\n\tNOTE: To ensure accurate measurements, it was imperative to manually review the segmented lines within the OCT scans27,30.\nExclude poor OCT images resulting from media opacity or unstable fixation.\n4. Statistical analysis\nLaunch the SPSS software (see Table of Materials). The analysis exclusively considered the right eye of the participants31.\n\tNOTE: Present continuous data as mean ± standard deviation (SD) and categorical data as frequency (percentage).\nPerform group comparison using a t-test for continuous variables and a Chi-square test for categorical variables. Conduct correlation analyses employing Pearson's correlation.\n\tNOTE: A significance level of P < 0.05 (two-tailed) was used to determine statistical significance.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}