{
  "id": 3486,
  "origin_website": "Cell",
  "title": "Protocol for the isolation of mouse muscle stem cells using fluorescence-activated cell sorting",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation of muscle digestion media\nTiming: ∼10 min\n      Enzymatic digestion of skeletal muscle is the essential first step. Ensure\n      that Digest mix 1 is stored on ice prior to step 8.\n    \n        Prepare Digest 1 mix containing 0.2% Collagenase Type II (285 U/mg)\n        dissolved in DMEM.\n        \n            Pass digest 1 solution through a filtered tissue culture bottle\n            (Thermo Scientific, Cat# 157-0020) and keep on ice until step 8.\n          \nExtraction of mice skeletal muscle\nTiming: ∼10–15 min per mouse\n    \n      This step details our strategy for extracting skeletal muscle from mice.\n      Maximizing your skeletal muscle amount at the beginning will increase your\n      yield of FACS isolated muscle stem cells at the end of the protocol.\n    \n        Prepare a de-contaminated dissection field on a benchtop by cleaning it\n        with 70% ethanol.\n      \n        Transfer 20 mL of Digest 1 mix into a tube labeled Digest 1. Prepare a\n        tube for each replicate mouse. Keep the tubes on ice.\n      \n        Euthanize mice according to your institution’s approved IACUC protocol.\n      \n        Spray down mouse with 70% ethanol, remove skin, and extract hindlimb (Figures 1[href=https://www.wicell.org#fig1]A and 1B), triceps (Figure 1[href=https://www.wicell.org#fig1]C), and abdominal (Figure 1[href=https://www.wicell.org#fig1]D) skeletal muscles and place muscles in tube containing ice-cold\n        Digest 1 mix.\n        \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3060-Fig1.jpg\n              Figure 1. Extraction of hindlimb, triceps, and abdominal skeletal\n              muscles from adult mice\n            \nMouse skeletal muscle dissection.\n              (A) Create a transverse incision along the waist and peel away\n              skin and underlying fascia to access (B) hindlimb, (C) forelimb,\n              and (D) abdominal skeletal muscles.\n            \n        Seal the tube containing Digest 1 and muscle with parafilm. Keep the\n        tube on ice until step 8.\n      \n        Repeat steps 4–6 for each additional replicate mouse. Disinfect\n        dissection tools and dissection platform between each mouse with 70%\n        ethanol to avoid cross-contamination of samples.\n      \nCritical: It may be necessary to wash",
    "skeletal muscle in a petri dish filled with PBS prior to step 6 to remove\n      excess blood from the dissection.\n    \n      Enzymatic and mechanical dissociation of skeletal muscle to release\n      mono-nuclear cells associated with skeletal muscle\n    \nTiming: ∼2 h for 1 mouse. Add 15–30 min\n      for each additional mouse.\n    \n      Enzymatic digestion of skeletal muscle loosens the connections between\n      bulk skeletal muscle fibers and mechanical dissociation releases single\n      fibers. Gravitational sedimentation is performed to separate interstitial\n      cells from single fibers containing MuSCs. Lastly, a second digestion step\n      releases MuSCs from underneath the basal lamina of myofibers prior to\n      FACS.\n    \n        Disinfect tubes with 70% ethanol and incubate tube(s) containing Digest\n        1 and muscle at 37°C in a shaking (55 RPM) water bath for 90 min.\n        \n            Use weighted rings to keep 50 mL conical tubes secured to the bottom\n            of the shaking bath.\n          \n        Prepare the following during Digest 1 incubation:\n        \n            Prepare glass tips (1 per mouse) for trituration by safely breaking\n            off the thin barrel of a glass Pasteur pipet. Attach a latex bulb\n            over the broken opening of the pipet (Figure 2[href=https://www.wicell.org#fig2]).\n            \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3060-Fig2.jpg\n                  Figure 2. Preparing glass Pasteur pipets for trituration\n                \n                  Safely cut Pasteur pipets at the dotted line and place a bulb\n                  on the cut end of the pipet. We note that the users can\n                  fire-polish the uncut end to create different size diameters\n                  which may help with the mincing step.\n                \nLabel 2 × 50 mL conical tubes per mouse.\n            Prepare 5 mL of Digest 1 stop solution (20% FBS or DBS in F10) for\n            each mouse.\n          \n        After Digest 1 incubation is complete, remove floating debris from\n        Digest 1 tubes by carefully decanting each tube.\n      \n        Inactivate Digest 1 by adding 5 mL of Digest 1 stop solution to each\n        tube.\n      \nGently swirl the tube(s) to mix.",
    "Carefully add 25 mL of PBS to each Digest 1 tube by pipetting to the\n        wall of the tube.\n        \n            Slowly decant the supernatant, leaving only a little liquid covering\n            the muscle.\n          \n        Repeat Step 13 two more times to remove residual Digest 1 Mix.\n        \nThe supernatant should become clearer with each wash.\n        After the third wash, pour all muscles into a petri dish that contains\n        25 mL of PBS to start the trituration process (Figure 3[href=https://www.wicell.org#fig3]A).\n        \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3060-Fig3.jpg\n              Figure 3. Mechanical dissociation of skeletal muscle to release\n              single fibers\n            \n              Trituration of skeletal muscle releases myofibers. (A) Digested\n              muscle is poured into a dish containing PBS and subsequently\n              triturated.\n            \n              (B) A gentle round of trituration releases myofibers, with (C) a\n              second round of trituration liberating additional myofibers from\n              muscle.\n            \n              (D) If optimally performed, the third round of trituration results\n              in muscles appearing paler and less opaque because of releasing\n              most of the myofibers. In a subsequent digestion step, MuSCs can\n              be released from the basal lamina of myofibers.\n            \n        Gently triturate the largest muscles (i.e., quadriceps and\n        gastrocnemius) first, mincing several times for each muscle. See\n        Methods video S1[href=https://www.wicell.org#mmc1] for an example of optimal\n        trituration cadence and technique (Methods video S1[href=https://www.wicell.org#mmc1]).\n        \n            During the first round of trituration, the PBS solution should turn\n            very cloudy from myofibers that are released into solution (Figure 3[href=https://www.wicell.org#fig3]B).\n          \n        Collect all the solution (including released myofibers which contain\n        MuSCs under their basal lamina) from the petri dish using a serological\n        pipet. Split the collected solution equally into two 50 mL collection\n        tubes for each mouse.\n      \nNote: After each successive round of\n      trituration, there will be a gradual decline in the cloudiness of the\n      supernatant in the petri dish.\n    \n        Add 25 mL of PBS into the petri dish for a second round of mincing.",
    "Triturate smaller muscles (i.e., triceps, tibialis anterior, and\n        abdominal muscles). Repeat step 16 (Figure 3[href=https://www.wicell.org#fig3]C).\n      \n        Add 25 mL of PBS into each dish for a third round of mincing. Triturate\n        all muscles. Repeat step 16. (Figure 3[href=https://www.wicell.org#fig3]D).\n      \n        Fill up each sedimentation collection tube to 50 mL with PBS. Place all\n        tubes upright in a stationary 37°C incubator for 25 min for\n        gravitational sedimentation to occur.\n      \nCritical: The sedimentation step\n      separates interstitial cells (low density) from myofibers (high density).\n      Tubes should be minimally perturbed through steps 19–26. Rough handling at\n      this stage will lead to myofibers being resuspended in the supernatant,\n      which will decrease the final MuSC yield.\n    \n        During the first sedimentation step, label one 50 mL conical tube per\n        mouse and keep the tube on ice.\n        \n            Collect the interstitial cells (ICs) (i.e., supernatant in\n            collection tubes), including MuSCs liberated early from myofibers\n            after Digest 1, and use them for single-color and\n            fluorescent-minus-one (FMOs) controls.\n          \n        After the first sedimentation step is complete, carefully remove the\n        collection tubes from the incubator.\n        \n            Collect 15 mL of supernatant from each tube and deposit the solution\n            into the ICs tube(s) and leave on ice.\n          \n            Subsequently, add 15 mL of fresh PBS to each sedimentation tube by\n            pipetting onto the side of the wall for each tube. Be careful to not\n            disturb the myofiber sediment at the bottom of the tube.\n          \n        Incubate the collection tubes for 15 min at 37°C (Figure 4[href=https://www.wicell.org#fig4]B).\n        \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3060-Fig4.jpg\n              Figure 4. Gravitational sedimentation of myofibers\n            \nPhases of gravitational sedimentation.\n              (A) Interstitial cells (ICs) are dispersed in the supernatant\n              after the first round of sedimentation.\n            \n              (B) By the second round, the supernatant becomes clearer, as IC\n              cells are progressively depleted from the supernatant.\n            \n              (C) By the third round of gravitational sedimentation, the\n              supernatant is visibly clear and myofibers are enriched at the",
    "bottom of the tube.\n            \n        During the second sedimentation step, prepare Digest 2 mix (0.0125%\n        Collagenase Type II (285 U/mg)/0.05% Dispase II (1.81 U/mg) in F10).\n        Keep Digest 2 mix at 37°C until needed in step 27.\n        \n            Filter Digest 2 mix through a filtered tissue culture bottle (Thermo\n            Scientific, Cat# 157-0020).\n          \n        Carefully remove 20 mL of supernatant from each sedimentation tube.\n        Gently add 20 mL of fresh PBS into the tube without disturbing sediment\n        at the bottom of the tube.\n      \n        Incubate the sedimentation tubes for 10 min at 37°C (Figure 4[href=https://www.wicell.org#fig4]C).\n      \n        Gently remove supernatant to the 15 mL mark for each tube and\n        immediately add 15 mL of pre-warmed Digest 2 mix to each tube.\n      \n        Seal each tube with parafilm and incubate tubes at 37°C in a shaking (55\n        RPM) water bath for 30 min.\n      \nCritical: Do not digest myofibers for\n      longer than 30 minutes. Over-digestion leads to excessive cleavage of cell\n      surface markers that are necessary for FACS-based isolation of MuSCs.\n      Thus, longer times in Digest 2 may decrease MuSC yield during\n      FACS-isolation.\n    \n        After 30 min, immediately inactivate Digest II by adding 2 mL of Fetal\n        Bovine Serum or Donor Bovine Serum (DBS) to each tube and gently swirl\n        the tube to mix.\n      \n        Release MuSCs from digested myofibers by quickly pipetting the digested\n        fibers up and down 10x times with a 25 mL serological pipet.\n      \n        Centrifuge tubes for 15 s (40 × g) at 4°C to sediment leftover\n        debris.\n      \n        Collect the supernatant from each tube and filter it through a 70 μm\n        cell strainer placed in a new 50 mL tube labeled according to each mouse\n        replicate.\n      \n        Centrifuge (400 × g) each tube for 5 min at 4°C.\n        \n            Remove supernatant and resuspend mono-nuclear cells in 0.5–1 mL of\n            SM to count cells on a hemocytometer.",
    "Count ICs for the single-color/Fluorescent minus one (FMO) control\n            samples at this step.\n          \nNote: If too many red blood cells are seen\n      in the pellet, perform an Ammonium Chloride Potassium (ACK lysis)\n      treatment to lyse them according to the manufacturer’s protocol\n      https://www.thermofisher.com/us/en/home/references/gibco-cell-culture-basics/cell-culture-protocols/red-blood-cell-lysis-using-ack-lysing-buffer.html[href=https://www.thermofisher.com/us/en/home/references/gibco-cell-culture-basics/cell-culture-protocols/red-blood-cell-lysis-using-ack-lysing-buffer.html].\n    \n        Your browser does not support HTML5 video.\n      \n          Methods video S1. Trituration of mouse skeletal muscle, related to\n          step 16\n        \n          Gently triturate large hindlimb muscles first, mincing several times\n          for each muscle. Optimal trituration cadence and technique aids the\n          release of muscle fibers from muscle tissue.\n        \n      Antibody staining of mono-nuclear cells associated with skeletal muscle\n    \nTiming: ∼2–2.5 h, depending on the\n      number of mice\n    \n      In this step you will use antibody staining to negatively exclude\n      fibro-adipogenic progenitors (FAPS), endothelial cells, and blood cells\n      while enriching for PAX7-positive MuSCs. In this protocol, we use positive\n      selection cell surface markers, CD29 (β1 Integrin) and CXCR4, which has\n      previously been shown to overlap with Vcam1 and Alpha-7 integrin/CD34 on\n      quiescent or early activated MuSCs.2[href=https://www.wicell.org#bib2]\n        Label 5 mL FACS tubes for unstained, single-color controls (SSC), and\n        fluorescence-minus-one (FMO) controls listed below:\n        \nUnstained.\nSSC-Propidium Iodine (PI).\nSSC-Calcein Blue (CB).\nSSC-APC.\nSSC-APC-Cy7.\nSSC-PE-Cy7.\nFMO-APC.\nFMO-APC-Cy7.\nFMO-PE-Cy7.\nLabel FACS tubes for each experimental sample.\nCritical: Keep a ratio of 1e6\n      cells per 100 μL of SM. We have carefully titrated our antibodies to work\n      optimally at this ratio.\n    \n        Transfer 4e6 cells to their respective FACS tubes in a final\n        volume of 400 μL of SM.\n      \n        Stain cells in control and experimental samples with fluorescently\n        conjugated antibodies according to our staining scheme to detect target\n        antigens (Table 1[href=https://www.wicell.org#tbl1]).\n        table:files/protocols_protocol_3060_5.csv\n          Primary Antibody Scheme of FACS Controls and Experimental Samples. ‘+’\n          indicates the addition of antibody; SCC = Single Color Control; FMO =\n          Fluorescence Minus One.\n        \n            Shield stained cells from light and keep tubes partially immersed in",
    "ice to prevent cells from internalizing antibodies.\n          \nIncubate stained cells on ice for 30 min.\n        Wash stained cells by adding 3 mL of SM to each FACS tube. Centrifuge\n        (360 × g) tubes for 5 min at 4°C. Decant the supernatant and\n        resuspend in 400 μL of SM.\n      \n        Incubate stained cells with PE-Cy7 Streptavidin antibody for 20 min and\n        keep on ice.\n      \n        Wash stained cells by adding 3 mL of SM to each tube. Centrifuge (360\n        × g) for 5 min at 4°C. Remove the supernatant and repeat the wash\n        step one additional time, for 2 washes in total.\n      \n        Filter cells through a 40 μm cell strainer and into freshly labeled FACS\n        tubes to prepare for FACS analysis. Keep stained cells in tubes immersed\n        on ice.\n      \n        15 min prior to FACS analysis, filter cells through a 40 μm cell\n        strainer.\n      \n        Add PI and Calcein Blue to corresponding tubes 15 min prior to FACS (Table 1[href=https://www.wicell.org#tbl1]).\n      \nFlow cytometry and FACS-based purification of MuSCs\nTiming: ∼2–4 h, depending on the number\n      of mice\n    \n      Using the appropriate single color and fluorescent-minus-one (FMO)\n      controls, we discuss the key steps and gating strategy for FACS-purifying\n      MuSCs (Figure 5[href=https://www.wicell.org#fig5]).\n    \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3060-Fig5.jpg\n          Figure 5. FACS gating plots of β1-integrin and CXCR4+ MuSCs\n        \nFACS gating strategy for sorting prospective MuSCs.\n(A) Debris are removed.\n(B) Single cells are isolated.\n(C) PI-negative and Calcein blue-positive cells (live) are gated.\n          (D) Muscle-resident FAPs (Sca1+), blood cells\n          (CD45+, CD11b+, TER119+) and\n          endothelial cells (CD31+) are excluded by negative\n          selection markers.\n        \n          (E) MuSCs are identified as double-positive for β1-integrin\n          and CXCR4.\n        \n        Set up the BD FACS Aria III cytometer as specified by the manufacturer.\n        \nUse a 70 μm nozzle with a flow rate of 2.0–4.0.\n        Run your unstained control to set the background voltage for each\n        channel.",
    "Run each single-color control (SCC) sample and set voltage for positive\n        cells and record events for the top 25% of expressing events for\n        fluorophore compensations.\n      \n        After compensation for all channels, run FMO samples to assist with\n        drawing negative gates for APC (CD45, CD11b, TER119, SCA1, CD31) and\n        positive gates for APC-Cy7 (β1 Integrin) and PE-Cy7 (CXCR4) (Figure 5[href=https://www.wicell.org#fig5]).\n      \n        Sort CD45-; Cd11b-; TER119-;\n        SCA1-; CD31-; β1 Integrin+; CXCR4+\n        MuSCs for further analysis.\n        \n            Freshly sorted MuSCs will appear as small, rounded cells that divide\n            over the next 48–72 h as they exit quiescence.\n          \nNote: This protocol can easily be used\n      with other positive enriching cell surface markers including Vcam1 and\n      α7-Integrin/CD34, which we previously showed enriches for a largely\n      overlapping PAX7-positive cell population when extracted from uninjured\n      skeletal muscle.2[href=https://www.wicell.org#bib2]\n      Downstream ex vivo and in vivo analysis of sorted MuSCs\n    \n      In this section we discuss downstream applications including cell culture,\n      immunofluorescence (IF), cell transduction, gene expression analysis, and\n      transplantation of MuSCs.\n    \n        Culturing and Passaging MuSCs (Time: 30–60 min to passage).\n        \n            Pre-coat wells with coating media (See\n            materials and equipment[href=https://www.wicell.org#materials-and-equipment]) for\n            24 h prior to FACS.\n          \n            Freshly isolated MuSCs can be sorted directly into pre-coated wells\n            that contain GM.\n            \n                Supplement cultured MuSCs with daily addition of 5 ng/mL bFGF\n                and incubate at 37°C with 5% CO2.\n              \n                Fresh MuSCs FACS-isolated from uninjured muscle will start to\n                divide in 48–72 h.\n              \n            After 3 days of culturing, we remove ½ the volume of GM and replaced\n            ½ the volume with fresh GM. We repeat this 3 times.\n            \nCritical: Do not remove media\n              completely within the first few days since MuSCs have low\n              adherence in the first 48 hours after FACS isolation.\n            \n            After 5 days of culturing, we passage the progeny of MuSCs (i.e.,\n            myoblasts) onto new tissue culture plates by performing the\n            following:",
    "Detach MuSCs from plates by removing ½ the volume of GM and\n                replacing it with an equal volume of warmed 5 mM EDTA and\n                incubate plates for 20 min at 37°C.\n              \n                Confirm that >90% of cells have been detached from the plate\n                under a microscope and then use a pipet to wash the bottom of\n                each plate to gently push cells into a cell suspension.\n              \n                Transfer the cell suspension to a labeled 15 mL conical tube and\n                centrifuge (360 × g) for 5 min at 4°C.\n              \n                Resuspend the resulting pellet in GM to count cells in the\n                suspension.\n              \n                Seed cells at the appropriate density and continue culturing in\n                GM.\n              \n                Supplement with daily additions of bFGF.\n                \nNote: We passage our cell\n                  cultures at 75%–80% confluent to prevent terminal\n                  differentiation. Re-fresh the media every 2–3 days, as in step\n                  50c.\n                \n        Differentiating MuSC-derived myoblasts into myotubes in culture (Time:\n        48–72 h).\n        \n            Seed MuSCs into pre-coated wells containing differentiation media\n            (DM).\n            \n                We perform differentiation assays in 96-well plates and thus\n                seed ∼8,000 cells into 96-wells containing DM and without bFGF.\n              \n            To differentiate myoblasts into fully formed myotubes, culture the\n            cells in DM for ∼48–72 h.\n          \n        Total RNA Extraction from freshly sorted MuSCs for analyzing Gene\n        Expression (Time: 15–30 min).\n        \n            Prepare an RNase-free environment on the lab bench and label 1.5 mL\n            microcentrifuge tubes.\n          \n            Aliquot 500 μL of TRIzol LS (Invitrogen, Cat #10296010) into each\n            tube prior to going to the FACS facility.\n          \n            Sort 1–50,000 MuSCs into 500 μL of TRIzol LS, immediately vortex\n            tube(s), and then add 250 μL of TRIzol LS to bring volume to 750 μL.\n          \nIncubate tubes with RNA/TRIzol for 5 min at 25°C.\nStore RNA in TRIzol LS at ‒80°C for up to 2–3 months.\n            Perform extraction of RNA according to the manufacturer’s protocol\n            (TRIzol LS)\n            https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2Ftrizol_ls_reagent.pdf[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2Ftrizol_ls_reagent.pdf].",
    "Immunofluorescence staining of fixed MuSCs (Time: 2 Days).\n        \n            Remove ½ the volume of GM from each well. Add back the same volume\n            with 8% paraformaldehyde (PFA) (4% PFA final concentration) and\n            incubate MuSCs at RT for 20 min.\n          \n            Stop fixation by washing cells with Phosphate Buffered Saline (PBS)\n            with 0.1% Tween 20 (PBST) 3 times for 5 min.\n          \nPermeabilize cells with 0.3% Triton-X for 20 min at 25°C.\nWash cells with PBST 3 times for 5 min.\n            Add blocking buffer (5% Normal Goat Serum, 3% BSA, 0.3% Triton-X in\n            PBS) for 2 h at RT.\n          \n            Without washing, add primary antibody in blocking buffer to each\n            well and incubate for ∼12 h at 4°C.\n          \n            Remove primary antibody solution and wash cells 4 times for 15 min\n            with PBST at 25°C.\n          \n            Add secondary antibody in blocking buffer to wells and incubate for\n            1 h at 25°C.\n          \n            Remove the secondary antibody from solution by washing cells with\n            PBST 4 times for 15 min at 25°C.\n          \n            Add Hoechst stain (1 μg/mL Hoechst in PBS) to cells and incubate for\n            15 min at 25°C. Alternatively, you can add Hoechst into the third\n            wash in step 53i.\n          \n            Remove Hoechst stain solution and wash cells with PBST for 5 min.\n          \n        Transduction of MuSCs with Lentivirus (Time: 2.5 h for transduction).\n        \n            We titrate our virus to determine the optimal density that gives\n            maximal transduction and minimal toxicity (anywhere from\n            1:100-1:500) as determined by a GFP fluorescence and/or antibiotic\n            selection.\n          \n            We make virus in 293T cells, concentrate virus with PEG-it viral\n            precipitation reagent (System Biosciences, Cat# LV810A-1), and then\n            resuspend in GM supplemented with 25 mM HEPES.\n          \n            Sort 3,000 MuSCs into coated wells of a 96 well plate containing\n            200 μL of GM.\n          \n            In a viral-only Biohazard class II biosafety cabinet, prepare",
    "diluted lentiviral stock by diluting lentivirus solution with\n            8 μg/mL Polybrene (Sigma-Aldrich, Cat. TR-1003-G) at the empirically\n            tested viral ratio.\n          \n            Remove ½ the volume of GM from each well and add back the same\n            volume with diluted viral media to get the desired ratio. Carefully,\n            pipet each well 5x times with a P200 pipet and incubate the plate\n            for 15 min at 37°C.\n          \n            Quickly parafilm plates shut to prevent spilling of virus while\n            spinning cells and centrifuge (930 × g) plates for 90 min at\n            32°C.\n          \n            Wash out virus by removing ½ volume (100 μL) and replacing ½ volume\n            (100 μL) with fresh GM 8 times.\n          \n            After the last wash, add bFGF to a final concentration of 5 ng/mL\n            before returning to 37°C to each well daily.\n          \nNote: Depending on your viral construct\n      (i.e., constitutive versus inducible) your protein of interest can be\n      expressed within 24–48 h.3[href=https://www.wicell.org#bib3]\n        Transplantation of MuSCs into pre-injured mice (Time: 2 h).\n        \n            Following your institution’s IACUC protocol, 24 h prior to\n            transplantation, inject a chemical agent into the Tibialis Anterior\n            (TA) muscle of mice to induce injury.\n            \nNote: We readily use 25 μL of\n              10 μM cardiotoxin (CTX) or 50 μL of 1.2% Barium Chloride\n              (BaCl2).\n            \n            Sort MuSCs at desired numbers into 500 μL of staining media (SM) in\n            Eppendorf tubes and keep on ice.\n          \n            Pellet cells by spinning them down at 400 × g for 5 min,\n            remove supernatant, and resuspend cells in ∼25 μL of saline.\n            \nNote: When transplanting a low\n              number of cells (less than 10K) you will likely not see a pellet.\n            \n            To prevent cells from sticking to the plastic walls of the syringe,\n            pre-coat the BD Biosciences syringe with FBS.\n          \n            Using a 31-gauge insulin syringe, take in 25 μL of cells (in saline)\n            into the syringe.",
    "Inject the needle at a 25° angle for a few cm, then reduce angle to\n            0° (parallel with the TA) for a few more cm such that the tip of the\n            needle is the mid belly of the TA.\n          \n            Inject the entire volume and slowly remove the needle from the TA\n            and dispose in a sharps bin.\n            \nCritical: Removing the needle\n              too quickly leads to leakage of cell volume from TA, and thus,\n              compromising your transplantation experiment."
  ],
  "subjectAreas": [
    "Antibody",
    "Stem Cells",
    "Cell Isolation",
    "Flow Cytometry",
    "Cell Differentiation",
    "Gene Expression"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}