{
  "id": 10193,
  "origin_website": "Jove",
  "title": "Labeling of Extracellular Vesicles for Monitoring Migration and Uptake in Cartilage Explants",
  "procedures": [
    "NOTE: Cartilage explants were obtained from the IdISBa Biobank (IB 1995/12 BIO) in compliance with institutional guidelines after ethical approval of the project by the CEI-IB (IB 3656118 PI).\n1. Column preparation\nEquilibrate columns following the manufacturer's instructions or as follows:\n\t\nRemove the column cap and equilibrate the column. Remove the storage buffer by elution.\nWash the column 3 times with 2.5 mL of phosphate-buffered saline (PBS). During each wash, wait for the column to absorb the whole volume.\n\t\t​NOTE: Do not let the column dry.\nCover the column with the cap after the last wash and until sample preparation.\n2. EV labeling\nNOTE: This EV labeling protocol uses a PL-EV sample previously isolated by size exclusion chromatography (SEC) with previously described conditions21,22. However, any EV sample from any source may be used with this protocol.\nConcentrate the EV sample and the control (PBS) using a concentrating tube.\n\t\nPlace the samples in a 15 mL or 500 µL concentrating tube, depending on the starting volume of the EV sample starting. Centrifuge the tubes according to the manufacturer's instructions until an almost-dry sample is obtained.\n\t\tNOTE: The control sample is necessary to check for any dye background. Although this method does not require any specific initial volume, it should be considered that around 10% of particles will be lost during purification steps. \nResuspend the concentrated samples with diluent C. Resuspend EV samples with 200 µL and the control group with 100 µL and transfer them to new 1.5 mL centrifuge tubes.\nSeparate the EV sample into two aliquots of 100 µL. Mark one with dye and use it as treatment (PKH-PL-EV); leave the other unmarked but process it (NTA-PL-EV) like the EV sample and use it to quantify the EV concentration by NTA.",
    "Prepare 2x dye solution, resulting in 8 µM PKH26 solution in diluent C.\nMix 1 µL of 1 mM PKH26 linker per 125 µL of diluent C in the sample. Prepare a volume required to add to the samples in a 1:1 ratio.\nAdd 2x dye solution to PKH-PL-EV and control samples in a 1:1 ratio to achieve 1x dye concentration and 4 µM PKH26 concentration. Add the same volume of PBS to the NTA-PL-EV sample. Incubate for 5 min at room temperature.\nAdd 5% bovine serum albumin-PBS solution to the samples in a 1:1 ratio and ensure that the final volume is ~400 µL.\n\tNOTE: This step allows the removal of nonspecific dye interactions or unbound dye.\nProceed to separate the labeled EVs from the unbound dye and nonspecific interactions of the dye with the column.\n3. Labeled-EV isolation\nRemove the cap from the column, add 400 µL of the sample (PKH-PL-EV, NTA-PL-EV, or control), and discard all eluted liquid.\nWait for the sample to enter the column completely before proceeding to the next step. Add 600 µL of PBS and discard all eluted liquid.\nWait for the PBS to enter the column completely before proceeding to the next step. Add 600 µL of PBS and collect a fraction of 600 µL in a 1.5. mL centrifuge tube (EVs or control).\n\tNOTE: These steps are needed to remove the excess dye from the samples. Another separation by column is needed to obtain purer EVs. Thus, the following steps should be performed in a new equilibrated column (step 4.1.) or the same column after an initial washing step (step 4.2).",
    "Prepare the column for a new EV separation step to obtain purer EVs. If it is a new column, repeat steps 2.1. and 2.2. If it is the same column, wash the column with 2.5 mL of 20% isopropanol and then repeat steps 2.1 and 2.2.\nAdd 600 µL of previously eluted EVs obtained in step 2.5 to the column and discard the eluted volume. Wait for the liquid to enter the column completely before proceeding to the next step.\nAdd 400 µL of PBS and discard all eluted volume. Wait for the liquid to enter the column completely before proceeding to the next step.\nAdd 600 µL of PBS and collect a fraction of 600 µL in a 1.5 mL centrifuge tube. Use the EVs and control samples for further analyses or store them overnight at 4 ᵒC.\nStore the used columns for future use.\n\t\nWash the column with 25 mL of 20% isopropanol and discard the eluted volume. Wash the column 3 times with 2.5 mL of PBS.\nAdd the storage buffer removed in step 1.1.1 and wait for the buffer to enter the column. Cover the column with the cap and store at 4 ᵒC until subsequent use.\n4. EV quantification\nPrepare 1:1,000 dilutions of the NTA-PL-EV sample and the initial PL-EV sample as described by the following two steps.\n\t\nPrepare 1 mL of 1:10 diluted NTA-PL-EV and 1 mL of 1:10 diluted initial PL-EV with PBS filtered through a 0.2 µm filter.\nPrepare 1 mL of a 1:100 dilution of the previous diluted samples with PBS filtered through a 0.2 µm filter.\nInject the 1:1,000 diluted NTA-PL-EV sample or the initial PL-EV sample using a sterile syringe into the NTA pump. Follow the manufacturer's instructions and recommendations for particle concentration and size distribution determination.",
    "​NOTE: As EV concentration depends on the sample starter volume, it may be necessary to read intermediate dilutions and make adjustments to obtain a correct NTA determination.\n5. EVs used as a treatment for inflammation-driven OA\nWash the cartilage twice with PBS and excise it using a 3 mm diameter biopsy punch under sterile conditions.\n\tNOTE: Perform the procedure from steps 5.1 to 5.6 in a cell culture hood.\nPlace the explants in 96-well culture plates with DMEM-F12 medium supplemented with 1% penicillin-streptomycin at 37 ᵒC, 5% CO2, and 80% humidity.\n\t\nTo establish an inflammation-driven OA model, supplement the cell culture medium with 10 ng/mL oncostatin M and 2 ng/mL tumor necrosis factor-alpha (TNFα).\nTreat the explants with 1 × 109 particles/well of labeled EVs (PKH-PL-EV) or control in cell culture medium supplemented with oncostatin M and TNFα.\n\tNOTE: Measure the volume of the sample containing 1 × 109 particles/well and use the same volume for the control.\nRemove the medium from the 96-well cell culture plates containing cartilage explants. Add 200 µL of the cell culture medium described in step 5.3 to each well.\n\tNOTE: If the 96-well plates have been in contact with fetal bovine serum (FBS), wash each well three times with 200 µL of PBS to remove any EVs from the FBS.\nStop the in vitro assay at different times: 0, 1, 2, 3, 4, and 5 h.\nWash the cell culture wells containing the cartilage explants twice with 200 µL of PBS.\nAdd 100 µL of 4% paraformaldehyde (PFA) to the tissue to fix it for 3 h at 4 ᵒC.\n\t​NOTE: Steps involving PFA should be performed in a fume hood following the Safety Data Sheet recommendations.",
    "Remove the PFA, add 100 µL of PBS, store the fixed tissue at 4 °C, and process the samples within 48 h.\n6. Microscopy preparation and visualization\nNOTE: This histological procedure consists of dehydration, paraffin embedding, and rehydration steps. These steps may reduce overall dye fluorescence (a limitation mentioned in the datasheet for PKH26). Therefore, other procedures, such as frozen sectioning, may be more suitable for EV visualization by confocal microscopy.\nEmbed the fixed tissues in paraffin blocks. Cut the tissue into 6 µm-thick sections.\nDeparaffinize the tissue sections.\n\tNOTE: All steps using xylene should be performed in a fume hood.\n\t\nImmerse the tissue sections in xylene for 30 min, 100% ethanol for 2 min, 96% ethanol for 2 min, 75% ethanol for 1 min, and finally in distilled water for 30 s.\nPermeabilize the tissue sections.\n\t\nPrepare a 0.1% Triton-0.1% sodium citrate solution to permeabilize the tissue. Add a 20 µL drop to each tissue section and incubate for 10 min at room temperature. Wash each section twice with 20 µL of PBS.\nOn a microscopic slide, add a drop of mounting medium containing 4′,6-diamidino-2-phenylindole (DAPI) with an aqueous mounting medium for preserving fluorescence. Cover the slide containing 3 tissue sections from step 6.3.1.\nIncubate the slides overnight at room temperature, protected from light.\nStore at 4 °C, protected from light until confocal microscopy.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}