{
  "id": 19099,
  "origin_website": "Jove",
  "title": "A Murine Closed-chest Model of Myocardial Ischemia and Reperfusion",
  "procedures": [
    "1. Induction of Anesthesia\nFor induction with isoflurane, place the mouse into an induction box which is connected to the vapor set to 3.0 Vol% and oxygen flow of 0.5 L/min.\nAfter unconsciousness is achieved with tactile stimulus failing to induce a response and the forelimb or hindlimb pedal withdrawal reflex being absent, place the mouse on a temperature-controlled operating table in a supine position. Maintain anesthesia over a nasal cone which is connected to the vapor via the induction box. Recline the head by fixing the upper incisors with a 5-0 nylon suture to facilitate intubation.\nInsert the rectal temperature probe to maintain body core temperature at 37 °C. Fix the extremities with tape. Cross the lower left leg over the right leg to open up the left chest and expose the heart better.\nApply depilatory cream to the neck and left chest. Wipe off the cream after 1 minute. Apply povidone-iodine for local skin disinfection. Inject buprenorphine 0.05 mg/kg body weight for pain relief subcutaneously.\nMake a midline neck skin incision with a small scissor. Blunt dissect the glands and muscles that cover the trachea. Turn on the ventilator. Ventilator settings should be adjusted to physiological parameters. We use a Minivent, Hugo Sachs Elektronik, Harvard Apparatus with a respiratory rate of 105/min and a tidal volume of 200 μl. Pull the tongue with a forceps and gently insert a 22 G metal tube. Confirm intubation by direct visualisation of the tube inside the trachea and chest movement.\nBypass the induction box by switching to waste gas tubing to prevent contamination of laboratory space. Adjust vapor to 2.0 Vol%.\n2. Thoracotomy",
    "Make a skin incision in the left midclavicular line. Blunt dissect the subcutaneous tissue towards the axilla. Identify the border of the major pectoralis muscle and blunt dissect it from the minor pectoralis muscle underneath. Pull the minor pectoralis muscle to the right. You will gain a direct view of the rib cage.\nIdentify and bluntly pentetrate the 4th intercostal space with a forceps. Let the tips of the forceps span the intercostal space to allow yourself to insert the retractors which are adjusted with rubber bands attached to the operation table. You should have a clear view of the heart including the left auricle. This access is usually achieved without any blood loss and thus without the need of electric coagulation.\n3. Preparation of the Heart\nGently pull off the pericardium without injuring the heart.\nIdentify the left anterior descending artery (LAD) by lifting off the left atrial auricle from the anterior wall of the left ventricle. LAD will be seen only over a short straight course with blurred borders and bright red color as compared to the veins.\n4. Coronary Artery Instrumentation\nPrepare an 8-0 prolene suture with a tapered needle tip by forming it into a U-shape. Pass the needle through the myocardium deep enough underneath the LAD.\nCut off the needle end of the suture to have 1 cm of suture at each side.\nCut off a 1 mm PE-10 tubing section as an occluder preventing any sharp corners. Allow the occluder to soak in alcoholic desinfection and tap out before use. Note: The tubing should be soaking in 100% ethanol for 24 hours to sterilize it appropriately4.\nThread both suture ends through the occluder.\nUse a size 3 Kalt suture needle to guide both suture ends out of the upper intercostal space.\n5. Chest Closure",
    "Tie the upper and lower rib of the opened intercostal space together with a 6-0 prolene suture. Before you close the chest you should proceed to 5.2.\nHyperinflate the lungs for a few respiratory cycles to open up atelectasis by clamping the expiratory tube. This maneuver may also depend on the type of ventilator you use. Set the tidal volume to 300 μl until the chest is closed.\nSet the ventilator tidal volume back to 200 μl.\nTie both ends of the 8-0 LAD ligation suture to have them form a loop.\nAttach an ECG.\nHook up the weights to the 8-0 loop and let the weights carefully hang. You should see a significant ST-elevation within a few heartbeats. Release the weights.  Note: These experiments use a total of 5.5 g of weight, but weight could vary based on strain and body weight of mice. \nPlace the loop in a subcutaneous pocket and close the skin with 6-0 single knot sutures.\nLet the mouse recover after extubation underneath a warming lamp.\n6. Myocardial Ischemia and Reperfusion\nAfter a recovery period of at least 5 days induce anesthesia with a mixture of ketamine, xylazine and atropine (4 ml/kg BW, ketamine 10 mg/ml, xylazine 2 mg/ml, atropine 0.06 mg/ml,1.\nIntubate and ventilate with room air for ischemia and reperfusion experiments.\nOpen the sutured skin of the chest. Prepare the 8-0 suture loop. Attach an ECG.\nHook up the weights and let them hang. Follow your ischemia protocol. Watch ECG for potential dissolution of ST-elevation 2.\nRelease the weights at the end of ischemia. Close the skin, extubate the mouse and let it recover.\n7. Infarct Size Assessment with Reperfusion Time up to 3 Days\nAnesthetize and intubate the mouse at the end of desired reperfusion time.",
    "Cut the chest skin in the midline to the xyphoid. Open the abdomen and cut the diaphragm below the rib cage. Cut the chest open on both sides of the midclavicular line.\nFix the flapped anterior chest wall with a suture to gain unobstructed access to the heart.\nCarefully prepare the 8-0 suture loop. Cut the loop and tie a knot to occlude the LAD.\nInject 10% phthalo blue into the left atrium. To prevent cardiac volume overload, inject dye slowly and aspirate from time to time.\nInject potassium chloride into the left atrium. This will arrest the heart in diastole for equal infarct size assessment.\nCut out the heart, leaving as much of extracardial tissue as possible to ease cutting the heart.\nWash the heart in phosphate buffer solution.\nFreeze the heart in isopentane and liquid nitrogen. Alternatively, hearts can be placed into a freezer until lightly frozen.\nCut the heart in 1 mm slices. We have a slicing device made of razor blades to cut the heart in equal slices (Figure 4). Make sure the heart is correctly aligned to cut perpendicular to the long axis of the heart.\nIncubate the slices in 1.5% TTC at 37 °C for 20 min. We use a 96 well plate where each slice is put into one well. This will save TTC and spare you the use of a Whatman filter to prevent artifacts.\nFix the slices with 4% formaldehyde overnight. This will shrink the slices but enhances contrast of the dye.\nPut the slice on a microscope slide. Cover with another slide. Use 1 mm metal spacers at each end of the slide and hold the slides together with paper clips.",
    "Take a digital image from both sides of each slice. Always use the same settings and do not zoom in for smaller slices.\nUse a software for planimetry. We use ImageJ by NIH. Always use the same criteria for infarcted areas, e.g. only white areas are infarcted. White pinkish areas are not infarcted. We have blinded investigators for interventions and planimetry as well.\n8. Alternative Heart Preparation for Histology\nFollow steps 7.1 to 7.2. and proceed to 8.2. Reliable infarct assessment with TTC staining can be done within 72 hours of reperfusion because of scar shrinkage.\nPrepare off any extracardial tissue and blunt dissect the thymus covering the aortic root.\nGrab the ascending aorta with the forceps and cut out the heart with as less extracardiac tissue as possible.\nWash and squeeze the heart gently in cardioplegic solution.\nPlace the heart into a p35 dish filled with cardioplegic solution.\nPrepare the ascending aorta.\nCannulate the ascending aorta with a cannula that is prefilled with formaldehyde. We use zinc-formalin fixative and a 24 G iv line 3.\nCut a hole between the left auricle and left atrium.\nInsert a 26 G catheter into the left atrium with a 16 cm long tubing attached to it. You can also use a PE50 tubing.\nPerfuse the heart for ten minutes with the formalin fixative.\nPlace the heart into a tube filled with fixative for a maximum of 24 hours at 7 °C.\nContinue with preparation for histology/immunohistochemistry.\n9. Representative Results",
    "Chronic coronary artery ligation is a complex technique with multiple pitfalls. However, once it is mastered it can be performed with very low mortality rates and highly reliable results. Optimal positioning of the mice and access to the heart are crucial for successful identification and instrumentation of the LAD. The position of the ligation will obviously influence infarct size, thus requiring to have a standardized ligation site. Also, if septal branches are affected this could lead to a bundle branch block instead of ST elevation. Bleeding from epimyocardial veins or from ventricle, if ligation is too deep, can occur and mice should be excluded if bleeding is excessive. Pericard should be removed as completely as possible. Leaving the pericard will aggravate pushing the needle into the myocard for ligation. Also, it will cause pericarditis, eventually induce adhesions and will make histological examination difficult. The PE-occluder should be as short as possible without any sharp corners to minimize trauma to myocard. Hyperinflation of the lungs is absolutely crucial to prevent tension pneumothorax after chest closure. There is no need for a chest drainage. Testing of a correct position of the ligation in the open chest by pulling the suture ends should be omitted because pulling tension is difficult to control. If instrumentation of the LAD fails, further attempts should be avoided because this will add trauma and edema to the myocardium.",
    "In order to achieve reliable results, protocol parameters should be standardized. Therefore, mice are intubated and ventilated with room air and body temperature is tightly controlled with a feedback system. The use of hanging weights has been already emphasized. Other pulling devices have the disadvantage of tension loss and non-standardized pulling tension. Ischemic pre- and postconditioning protocols with multiple cycles of reperfusion and occlusion are more easily performed with hanging weights because they just need to be lifted and let hung (Figure 1).\nInfarct areas (white) should be distinguishable from areas at risk (red) and non area at risks (blue) (Figure 2A-B). Infarct sizes are dependent on duration of ischemia. Reperfusion time should be at least 2 hours to allow successful TTC staining (Figure 1 and 2). Most importantly, cytokine RNA expression is low in sham operated animals which had all surgical procedures except ischemia and reperfusion as compared to animals which underwent myocardial infarction (Figure 3A-C).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3896/3896fig1.jpg\nFigure 1. Infarct size in percentage of area at risk (IS/AAR%). Mice underwent 30 minutes ischemia followed by 120 minutes of reperfusion (I/R, n=10). IPC: Ischemic postconditioning, mice underwent 30 minutes of ischemia followed by 3 cycles of reperfusion/occlusion 20 sec each (n=6, *indicates p<0.05).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3896/3896fig2A.jpg\nFigure 2A. Representative TTC-stained heart slice. White: infarct area, Red: area at risk, Blue: non-occluded area.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3896/3896fig2B.jpg\nFigure 2B. Representative slice of an infarcted (white) area. Note that due to the conical shape of the left ventricle close to the apex, the epimyocard will appear as plane area and should not be considered for planimetric measurement (pink/blue outer area). Red=TTC stained viable myocard.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3896/3896fig3A.jpg\nFigure 3A. No significant difference in myocardial TNF-α mRNA expression after 30 minutes ischemia and 120 minutes reperfusion. n=4-6 per group.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3896/3896fig3B.jpg",
    "Figure 3B. Myocardial IL-1β mRNA expression after 30 minutes ischemia and 120 minutes reperfusion (I/R). There is no significant difference between control (no surgery) and sham-operated (no ischemia/reperfusion) group. n=4-6 per group, *indicates p<0.05.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3896/3896fig3C.jpg\nFigure 3C. Myocardial IL-6 mRNA expression after 30 minutes ischemia and 120 minutes reperfusion (I/R). There is no significant difference between control (no surgery) and sham-operated (no ischemia/reperfusion) group. n=4-6 per group, *indicates p<0.05.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3896/3896fig4.jpg\nFigure 4A-C. Heart cutting device. A: closed with razor blades in cutting position. B: open, side view. C: open, front view. Heart will be aligned in the groove of the white plastic bed with its long axis perpendicular to the razor blades (arrow).Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}