{
  "id": 2777,
  "origin_website": "Cell",
  "title": "Chemically defined generation of human definitive hematopoietic stem and progenitor cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparing Matrigel-coated plates\nTiming: 1.5 h\nThese steps describe preparation of tissue culture plates for cell culture.4[href=https://www.wicell.org#bib4]\nPreparing Matrigel-coated plates.\nTransfer 32 mL of ice-cold DMEM/F-12 medium into a 50 mL conical tube.\nPrepare cell culture plates for coating. One aliquot of Matrigel solution (2.5 mg, approximately 0.25 mL) is enough for coating 5 plates.\nPlace the Matrigel on the ice after removing from the −80°C freezer.\nMatrigel was transferred into DMEM/F-12 medium using a P1000 pipette. Gently mix the Matrigel and DMEM/F-12 medium well using a 10 mL pipette.\nAdd 1 mL of Matrigel solution to each well of 6 well plate, 0.5 mL of Matrigel to each well of 12 well plate, and 0.25 mL of Matrigel solution to each well of 24 well plate using a P1000 pipette. Gently shake the plates (3 quick, short, side-to-side, and back-and-forth motions) to make sure the Matrigel solution fully cover the surface of the well.\nPlace the coated plates in a humidified incubator at 37°C for at least 30 min before cell culture.\nAdd extra DMEM/F-12 medium (0.5–1 mL) to prevent drying out 2–3 days after coating.\nNote: 1–2 mL of DMEM/F-12 medium is suggested to refill the well every 3–7 days. Other coating substrates, such as Synthemax II-SC and Cultrex, can also be used for routine hPSC maintenance.\nCritical: Matrigel-coated plates can be stored in the incubator (humidified, 5% CO2, 37°C), and these coated plates should be used within 12 days. For long-term storage, Matrigel-coated plates should be sealed by parafilm and stored at 4°C. If there are some dry spots in the coated plates due to DMEM/F-12 evaporation, they cannot be used for stem cell culture.\nThawing frozen human pluripotent stem cells\nTiming: 1 h",
    "These steps describe thawing of human pluripotent stem cell lines to recover healthy cells suitable for hematopoietic stem and progenitor cell differentiation.\nThawing of human pluripotent stem cells.\nWarm mTeSR Plus medium at room temperature for approximately 30 min.\nTransfer 5 mL of mTeSR Plus to a 15 mL conical tube using a 10 mL serological pipette.\nRemove a frozen cell cryovial of human pluripotent stem cells (passage number: 10–20) from a liquid nitrogen tank.\nImmerse the cryovial in a 37°C water bath without submerging the cap.\nGently swirl the cryovial for 2–3 min until the contents are completely thawed.\nSpray the cryovial with 70% (vol/vol) ethanol before placing it into a biosafety tissue culture cabinet. Gently transfer cell mixture from the cryovial to a sterile 15 mL conical tube containing 5 mL of prewarmed mTeSR Plus medium using a P1000 pipette.\nNote: Over-heating the cryovial in the water bath would reduce cell viability.\nCentrifuge the cell mixture at 200 × g for 5 min at room temperature.\nAspirate the supernatant from the 15-mL tube via vacuum aspiration and remove the Matrigel solution from the coated plate by a P1000 pipette or vacuum aspiration.\nGently resuspend the cell pellet in 2 mL of mTeSR Plus medium containing 5 μM Y27632 by a P1000 pipette, and transfer them into an empty Matrigel-coated well using the P1000 pipette.\nClearly label the plates with hPSC line, passage number, data frozen, data thawed, and initials.\nReturn the plate to the incubator (humidified, 5% CO2, 37°C) and gently shake the plate back and forth for a few times to evenly distribute the cells.\nCritical: Including ROCK inhibitors (Y27632) is essential for efficient attachment of human pluripotent stem cells after thawing.\nMaintenance of human pluripotent stem cells\nTiming: 45 min",
    "These steps describe daily maintenance and passage of human pluripotent stem cells. Human pluripotent stem cells split at a 1:6 ratio should be passaged at 70%–90% confluency approximately every 3–4 days. If split at a 1:12 ratio, these human pluripotent stem cells should be passaged approximately every 4–5 days.5[href=https://www.wicell.org#bib5]\nDaily maintenance of human pluripotent stem cells.\nWarm mTeSR Plus medium at room temperature for approximately 30 min.\nAspirate the old medium from each well of hPSC-containing 6-well plate and replace with 2 mL of fresh prewarmed mTeSR Plus medium. Repeat this step daily until cells are ready for passaging (∼80%–90% confluency).\nPassaging human pluripotent stem cells using Versene.\nWarm mTeSR Plus medium at room temperature for approximately 30 min.\nAspirate the old medium from each well of hPSC-containing 6-well plate and add 1 mL of room temperature Versene.\nIncubate the plate at an incubator (humidified, 5% CO2, 37°C) for 5 min.\nNote: Versene incubation time may vary for different hPSC lines. If cells do not detach easily from the bottom after incubation for 5 min, leave the plates longer (e.g., 7–10 min) in the incubator. If cells detach easily from the bottom, incubate the plate for less than 5 min (e.g., 3 or 4 min).\nDuring Versene incubation, add 2 mL of mTeSR Plus medium with 5 μM Y27632 into a new Matrigel-coated well after aspirating Matrigel solution.\nAspirate the Versene from the hPSC-containing plate.\nUsing a P1000 pipette, collect 1 mL of medium in step 4d and dispense this medium over the surface of the hPSC-containing well treated with Versene until all the colonies are detached (∼3 or 4 times) under a microscope with a 10× objective.\nAfter most cells (over 90% cells) are detached, gently pipette to mix the cell mixture using a P1000 pipette.",
    "Transfer ∼160 μL (at a ratio of 1:6) to the new Matrigel-coated well in step 4d.\nCritical: Human pluripotent stem cells should be gently passaged to reduce and avoid spontaneous differentiation. The split ratio is variable, and generally a ratio between 1:6 and 1:12 (or 20,000–40,000 cells per cm2) is appropriate when using Versene for passaging.\nReturn the plate to the incubator after plating the cells. Gently shake the plate in 3 quick, short, back- and front- and side-to-side motions to evenly disperse the cell across the surface of the wells.\nDirected differentiation of human pluripotent stem cells to definitive hematopoietic stem and progenitor cells\nTiming: 18 days\nThese steps describe the directed differentiation of human pluripotent stem cells to definitive hematopoietic stem and progenitor cells. For the background on the development of this protocol and differentiation to hematopoietic progenitor cells, please see.1[href=https://www.wicell.org#bib1],2[href=https://www.wicell.org#bib2] In this part of the protocol, we will describe differentiation of human pluripotent stem cells into hematopoietic cells in a full 24-well plate, which requires approximately 2.4 million human pluripotent stem cells or one well of 6-well plate with confluent cells. We denote Day 0 as the day when we treat cells with CHIR99021 to initiate the differentiation.\nDay -1.\nWarm mTeSR Plus medium at room temperature for approximately 30 min.\nAspirate the old medium from stem cell culture plate via vacuum aspiration, and add 1 mL of Accutase to the same well using a P1000 pipette.\nIncubate the plate at the incubator (37°C, 5% CO2, humidified) for 5 min.",
    "Gently pipette to dissociate all the cells from surface with a P1000 pipette, manually count the cells in a cell hemocytometer, and use a P1000 pipette to transfer 5 × 107 cells (about 1/3 of cell suspension) to a 15-mL conical tube containing 2 mL of mTeSR Plus as a quenching medium.\nCritical: Initial cell seeding density is critical for efficient hematopoietic stem and progenitor cell differentiation. We suggest a starting cell split ratio of 1:12 or 5× 105 cells/cm2. The cells may need to expand for 1 or 2 more days in mTeSR plus before CHIR99021 treatment if attached cell density (below 1 × 105 cells/cm2) on Day 0 was too low to initiate the differentiation.\nCentrifuge the cells at 200 × g for 5 min at room temperature.\nAfter centrifugation, the cells were resuspended in 12 mL of mTeSR Plus medium containing 5 μM Y27632 (ROCK inhibitor) and 0.5 μg/mL iMatrix-511 using a 10 mL serological pipette.\nNote: The concentration of iMatrix-511 is critical for cell attachment. We recommend using 0.5–1.5 μg/mL iMatrix-511.\nGently mix the cell mixture and transfer 0.5 mL into each well of a 24-well plate using a P1000 pipette or 5 mL serological pipette.\nPlace the plate with cells to an incubator (37°C, 5% CO2, humidified) and gently shake the plate back and forth for 2–3 times to evenly distribute the cells.\nDay 0.\nWarm DMEM/Vc medium in a 37°C water bath for approximately 30 min.\nPrepare a conical tube with 12 mL of DMEM/Vc medium containing 6 μM CHIR99021.\nAspirate the old mTeSR plus medium via vacuum aspiration, transfer 0.5 mL of DMEM/Vc with CHIR99021 in each well of the 24-well plate using a 5 mL serological pipette, and record the time.",
    "Critical: Recording the time of adding CHIR99021 is important as CHIR99021 treatment should be around 24 h for the cell lines we tested. 2-day CHIR99021 treatment in LaSR basal medium also works effectively.5[href=https://www.wicell.org#bib5] Optimization of CHIR99021 treatment may be needed for a different cell line.\nReturn the plate to the incubator (37°C, 5% CO2, humidified).\nDay 1.\nWarm LaSR Basal medium in a 37°C water bath for approximately 30 min.\nAspirate the old DMEM/Vc medium via vacuum aspiration, and transfer 0.5 mL LaSR Basal medium in each well of the plate using a 5 mL serological pipette.\nReturn the plate to the cell culture incubator (37°C, 5% CO2, humidified).\nDay 2.\nWarm LaSR Basal medium in a 37°C water bath for approximately 30 min.\nPrepare a conical tube with 12 mL of LaSR Basal medium containing 50 ng/mL VEGF.\nNote: While VEGF is not required for male hPSC lines,6[href=https://www.wicell.org#bib6] the addition of exogenous VEGF may reduce differentiation variability resulting from different initial cell seeding densities.\nAspirate the old medium via vacuum aspiration, and transfer 0.5 mL of the prepared medium in each well of the plate using a 5 mL serological pipette.\nReturn the plate to the cell culture incubator (37°C, 5% CO2, humidified).\nDay 3.\nWarm LaSR Basal medium in a 37°C water bath for approximately 30 min.\nPrepare a conical tube with 12 mL of LaSR Basal medium containing 50 ng/mL VEGF.\nAspirate the old medium via vacuum aspiration, and transfer 0.5 mL of the prepared medium in each well of the plate using a 5 mL serological pipette.\nReturn the plate to the cell culture incubator (37°C, 5% CO2, humidified).\nDay 4.\nWarm Stemline II medium in a 37°C water bath for approximately 30 min.",
    "Note: While we identified Stemline II as the optimal medium (about 80% HSPCs at day 15), StemSpan-XF also works effectively (about 70% HSPCs at day 15).\nPrepare a conical tube with 12 mL of Stemline II medium containing 50 ng/mL VEGF and 10 μM SB431542.\nAspirate the old medium via vacuum aspiration, and transfer 0.5 mL of the prepared medium in each well of the plate using a 5 mL serological pipette.\nReturn the plate to the cell culture incubator (37°C, 5% CO2, humidified).\nDay 6.\nWarm Stemline II medium in a 37°C water bath for approximately 30 min.\nPrepare a conical tube with 12 mL of Stemline II medium containing 50 ng/mL SCF and 50 ng/mL FLT3L.\nAspirate the old medium via vacuum aspiration, and transfer 0.5 mL of the prepared medium in each well of the plate using a 5 mL serological pipette.\nReturn the plate to the cell culture incubator (37°C, 5% CO2, humidified).\nDay 9.\nWarm Stemline II medium in a 37°C water bath for approximately 30 min.\nPrepare a conical tube with 12 mL of Stemline II medium containing 50 ng/mL SCF and 50 ng/mL FLT3L.\nAspirate top half of the old medium using a P1000 pipette, and transfer 0.5 mL of the prepared medium in each well of the plate using a P1000 pipette.\nCritical: Floating hematopoietic cells start to produce from day 9, and be careful when aspirating top half of the old medium. If many floating cells present in top half medium due to unexpected plate shaking during medium change, 0.5–1 mL fresh medium could be directly added to the differentiated wells without removing old medium.\nReturn the plate to the cell culture incubator (37°C, 5% CO2, humidified).\nDay 12.",
    "Warm Stemline II medium in a 37°C water bath for approximately 30 min.\nPrepare a conical tube with 12 mL of Stemline II medium containing 50 ng/mL SCF and 50 ng/mL FLT3L.\nAspirate top half of the old medium using a P1000 pipette, and transfer 0.5 mL of the prepared medium in each well of the plate using a 5 mL serological pipette.\nReturn the plate to the cell culture incubator (37°C, 5% CO2, humidified).\nPerform half-medium change every three days until day 18 or functional analysis (Figure 3[href=https://www.wicell.org#fig3]A).\nCharacterization of differentiated hematopoietic stem and progenitor cells\nTiming: 2 days (hand-on time: 1 h on first day and 30 min on second day, and additional time (1 h/plate) is needed for imaging) (for step 14)\nTiming: 1.5 h (for step 15)\nThese steps describe immunostaining and flow cytometry analysis on the differentiated cells.\nImmunostaining analysis.\nNote: We recommend staining 3 wells of a 24-well plate for each condition.\nAspirate the old medium from the differentiated well using a P1000 pipette. Gently wash the cells once with PBS solution and fix the cells with 0.2 mL of 4% PFA solution at room temperature for 15 min.\nAspirate PFA solution from the wells with a P1000 pipette and use 0.5 mL PBS to gently wash fixed cells twice. Fixed cells could be stored in PBS at 4°C for up to 2 weeks.\nAdd 200 μL blocking solution into each well using a P1000 pipette and incubated for 1 h at room temperature or 8–24 h at 4°C. PBS solution with 0.1% (vol/vol) Triton X-100 and 0.5% (wt/vol) dry milk or BSA could be used as blocking solution.\nDilute primary antibody at a ratio 1:50 to 1:100 in blocking solution.",
    "Remove the blocking solution from the wells using a P1000 pipette and add 200 μL diluted antibody solution to each well. Incubate the cell plate at room temperature for 1 h or 4°C for 8–24 h in dark.\nNote: The use of conjugated antibodies can shorten staining time compared with the 2-step primary and secondary antibody staining.\nAfter incubation, aspirate the primary antibody solution using a P1000 pipette and gently wash the cells with PBS solution twice.\nIf non-conjugated antibody is used, dilute appropriate secondary antibody in blocking solution at a ratio of 1:500 to 1:1,000 according the manufacturer’s instruction.\nAdd 200 μL diluted secondary antibody solution into the wells using a P1000 pipette.\nIncubate at room temperature in dark for 0.5 h or 4°C for 8–24 h.\nAspirate the secondary antibody solution with a P1000 pipette, and use PBS to gently wash the cells twice.\nAdd 200 μL of diluted 1 μg/mL Hoechst or DAPI solution to each well for nuclear staining and incubate the plate in the dark at room temperature for 5 min.\nNote: The incubation time or concentration of Hoechst or DAPI can be slightly increased for a stronger signal.\nAspirate the nuclear staining solution, and gently use PBS to wash twice. Use a P1000 pipette to add 500 μL of PBS solution to each well to avoid drying out.\nImage stained cells in a fluorescence microscope by selecting desired emission filter (e.g., FITC, DAPI, and CY7) and objective lens (e.g., 10× and 20×). Take and save the images after focusing, locating and centering the specimen.\nNote: We suggest imaging at a 10× or 20× magnification in a Leica DMi8 microscope according to the manufacturer’s instruction.\nProcess the fluorescent images using Fiji/ImageJ or a similar software according to the manufacturer’s instruction.",
    "Brightness/Contrast adjustment is usually applied to the fluorescence images to reduce signal noise and improve intensity visualization.\nImages from different channels are processed individually and also merged together (Figures 2[href=https://www.wicell.org#fig2]A and 2B).\nFlow cytometry analysis.\nNote: These steps describe the use of flow cytometry to quantify hPSC differentiation efficiency by analyzing hematopoietic markers, including CD34, CD45, CD43, Runx1c and CD44. For intracellular protein detection, cells will be first fixed in 1% (wt/vol) PFA for 20 min and permeabilized in ice cold 90% (vol/vol) methanol for half an hour.7[href=https://www.wicell.org#bib7] We also suggest at least 3 samples for each condition and 0.5 to 1 million cells for each sample.\nFor attached cells, e.g., day 6 endothelial cells, incubate them with 0.5 mL/well Accutase for 5–10 min in 37°C.\nUse a P1000 pipette to detach and singularize differentiated cells from the bottom.\nFor floating hematopoietic cells after day 6, use a P1000 pipette to collect and filter through a 70 μm strainer sitting on a 15 or 50-mL conical tube.\nFor Accutase-dissociated cells, equal volume of DMEM medium with 10% FBS is added for neutralizing.\nCentrifuge the cells at 200 × g for 5 min at room temperature.\nAspirate the supernatant via vacuum aspiration and wash pelleted cells with Flow buffer-1 solution twice to remove dead cells.\nPrepare 100 μL/sample of conjugated antibody solution at a ratio of 1:50 to 1:100 in Flow buffer-1 according to the key resources table[href=https://www.wicell.org#key-resources-table]. Incubate the cell and antibody mixture at room temperature in dark for half an hour or 4°C for 4–24 h.\nAdd 2 mL Flow buffer-1 solution to each tube using a 10 mL serological pipette, and centrifuge at 200 × g for 5 min at room temperature.",
    "Aspirate the supernatant via vacuum aspiration and wash the cell pellet once with 2 mL Flow buffer-1.\nAspirate the supernatant via vacuum aspiration, use a P1000 pipette to resuspend the cell pellet with 300 μL of Flow buffer-1, and transfer the cell mixture into a 5 mL FACS round bottom tube via the cap filter for flow cytometry analysis.\nNote: The FACS round bottom tube with a filter lid is recommended and the cells should be filtered right before flow analysis.\nKeep the prepared cells on ice until analysis. Run prepared samples in a BD Accuri C6 Plus flow cytometer according to the manufacturer’s instruction.\nOnce the flow machine is ready, select desired sample well, run settings (e.g., run unlimited or run with limits in events, volume or time) and fluidics (e.g., slow, medium or fast) in the instrumental panel under the Collect tab.\nBy default, a forward (FSC) vs side scatter (SSC) dot plot is created for data visualization, and other plot types (e.g., density plot and histogram) may be selected with x-axis and y-axis changed to desired filter channels (e.g., FITC, PE and APC). After setting is done, load the filtered sample, start and stop data acquisition.\nSave the collected data and exported as a .fcs file for further analysis.\nOpen the .fcs file in the FlowJo or a similar software (e.g., Accuri C6 itself can be used to visualize and analyze the data) to visualize and analyze collected flow data.\nUnder the FSC vs SSC plot, gate the live cell population and apply to desired channels (e.g., PE and APC in Figures 3[href=https://www.wicell.org#fig3]B and 3C) for quantitative analysis of targeted cells.\nPurification of differentiated hematopoietic stem and progenitor cells\nTiming: 2.5 h",
    "These steps describe the purification of differentiated hematopoietic stem and progenitor cells using magnetic activated cell sorting (MACS) (Figures 4[href=https://www.wicell.org#fig4]A–4D).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2287-Fig4.jpg\nFigure 4. Purification and analysis of hPSC-derived hematopoietic stem and progenitor cells\n(A) Schematic of the protocol for the purification of hPSC-derived hematopoietic stem and progenitor cells.\n(B) Representative flow cytometry plots of CD45 expression before and after purification.\n(C) Representative flow cytometry plots of CD43 and RUNX1c expression on the purified definitive hematopoietic cells derived from H9 Sox17-mCherry RUNX1c-GFP dual reporter.\n(D) Representative histogram plot of CD34 expression on the purified definitive hematopoietic cells.\nPurification of differentiated hematopoietic stem and progenitor cells.\nPipette differentiated day 12 to day 16 hematopoietic stem and progenitor cells about 10 times using a P1000 pipette, and filter the cells through a 40 μm cell strainer into a 50 mL conical tube containing 5 mL of DMEM medium with 10% FBS.\nCount the total cell number with a hemocytometer or automated cell counter, and centrifuge at 200 × g for 5 min at room temperature.\nAspirate the supernatant via vacuum aspiration and use 10 mL Flow buffer-1 solution to wash the cells.\nAspirate the supernatant after centrifuge, and resuspend the cells at a concentration of 107 cells/100 μL in Flow buffer-1 solution.\nAdd 2 μL CD45-FITC antibody per 100 μL cell mixture and incubate in dark at room temperature for 30 min.\nNote: Other FITC-conjugated antibodies, such as CD43-FITC and CD44-FITC, can also be used.\nAdd 2 mL Flow buffer-1 solution using a 5 mL serological pipette, centrifuge at 200 × g for 5 min at room temperature, and aspirate the supernatant via vacuum aspiration.",
    "Resuspend the cell pellet with Flow buffer-1 at a concentration of 107 cells/100 μL and add EasySep™ FITC Positive Selection Cocktail at 10 μL per 100 μL cell solution.\nGently mix the cell and selection cocktail solution using a P1000 pipette, and incubate at room temperature for 15 min.\nAdd well-mixed magnetic nanoparticles at 5 μL per 100 μL cell solution, mix well and incubate at room temperature for another 10 min.\nBring the cell suspension to a total volume of 2.5 mL Flow buffer-1 solution using a 5 mL serological pipette, mix well and transfer into a 5-mL round-bottom flow tube.\nPlace the flow tube (without cap) into the magnet and set aside for 5 min.\nPick up the magnet, and in one continuous motion invert the magnet and flow tube, pouring off the supernatant fraction. Leave the magnet and tube inverted for 2–3 s, and then return to the upright position.\nRemove the flow tube from the magnet, add 2.5 mL Flow buffer-1 solution using a 5 mL serological pipette, pipette up and down for 2–3 times to mix the cell suspension. Place the flow tube (without cap) back in the magnet and set aside for 5 min.\nRepeat step l and m two to three times, and then step l once more. Remove the flow tube from the magnet and resuspend cells in appropriate amount of desired medium for subsequent culture or other applications.\nColony-forming unit (CFU) assay to analyze hematopoietic stem and progenitor cells\nTiming: 17 days\nThese steps describe colony-forming unit assay for culturing and analyzing differentiated hematopoietic stem and progenitor cells (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2287-Fig5.jpg\nFigure 5. hPSC-derived hematopoietic cells were assessed for myeloid potential via the colony-forming unit (CFU) assay in methylcellulose medium",
    "After 2 weeks, the resulting hematopoietic colonies were scored for CFUs according to their morphologies: erythroid (E), granulocyte/macrophage (GM), macrophage (M), and multilineage progenitor (GEMM) colonies. Scale bars, 200 μm.\nColony-forming unit (CFU) assay on the differentiated hematopoietic stem and progenitor cells.\nThaw the complete MethoCult™ medium at room temperature (15°C–25°C) for half an hour or overnight (16–24 h) at 2°C–8°C.\nPrepare a 12-well plate for CFU assay by marking sample wells in the center and fill all neighboring wells with 2 mL sterile water to keep assayed wells under an appropriate moisture environment.\nNote: Only wells in the center of a 12-well plate are appropriate for CFU assay and sterile water should be used to fill the empty wells around the assayed wells.\nPrepare the cell solution for CFU assay by diluting the cells from step 16n with Stemline II medium at a concentration of 2 × 104 cells/mL.\nNote: The final cell concentration suitable for CFU assay is around 2,000 cells per well of a 12-well plate.\nAdd 50 μL of prepared cell solution into 2 mL of thawed MethoCult™ medium.\nVortex the tube vigorously for at least 4 s to mix the content thoroughly.\nLet stand for at least for 5 min to allow the bubbles to rise to the top.\nTransfer cell-containing MethoCult™ medium into the prepared 12 well plate.\nNote: Pipette tips can be used to break the bubbles generated during medium transfer.\nDistribute the medium evenly across the surface of the well and rotate the plate to allow MethoCult™ medium to attach to the wall of the well on all sides by gently shaking and rotating the plates.\nReturn the plate to a tissue-culture incubator (37°C, 5% CO2, humidified).",
    "After a 16-day incubation, image and count the CFU colonies at a magnification of 10× or 20× under a microscope (Figure 5[href=https://www.wicell.org#fig5]).\nExpansion of hematopoietic stem and progenitor cells with small molecules\nTiming: up to 16 days\nThese steps describe the expansion of differentiated hematopoietic stem and progenitor cells under a feeder-free system with various small molecules (Figures 6[href=https://www.wicell.org#fig6]A and 6B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2287-Fig6.jpg\nFigure 6. Expansion for hPSC-derived hematopoietic stem and progenitor cells\n(A) Schematic of the protocol for the expansion of hPSC-derived hematopoietic cells.\n(B) The fold expansion of hematopoietic cells after small molecule treatment was measured and quantified. ∗p < 0.05.\nExpansion of differentiated hematopoietic stem and progenitor cells under feeder-free conditions.\nPrepare fresh culture media with Stemline II, 50 ng/mL SCF, 50 ng/mL FLT3L, and different small molecules (750 nM SR-1, 250 nM UM171, 0.5 μM BIO, 5 μM TEPA, and 1 μM GW9962).\nSeed 2 × 105 hematopoietic stem and progenitor cells from step 16n per well of 24-well plate in 1 mL Stemline II medium with different small molecules.\nNote: For the 12-well plate, cells from step 16n should be resuspended in 2 mL culture medium at a density of 4 × 105 cells/well. StemSpan-XF medium could also be used to replace Stemline II medium.\nPerform half-medium change with small molecule-containing Stemline II medium every 3 days.\nAfter a 2-week expansion, gently pipette the cells up and down, collect all the cells and run flow cytometry analysis according to step 15 with CD34 and CD44 or other conjugated antibodies to count the total number of CD34+ HSPCs."
  ],
  "subjectAreas": [
    "Stem Cells",
    "Biotechnology And Bioengineering",
    "Cell Culture",
    "Cell Biology",
    "Cell-Based Assays",
    "Cell Differentiation"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}