{
  "id": 18891,
  "origin_website": "Jove",
  "title": "Implanting Glass Spinal Cord Windows in Adult Mice with Experimental Autoimmune Encephalomyelitis",
  "procedures": [
    "1. Window and Support Structure Preparation\nWindow preparation - prepare several windows of various sizes (width = 1.8-2.2 mm; length = 4.5-5.2 mm) for implantation.\n\t\nMaking the modified drill burr to cut the cover glass - using a generous amount of dental cement attach a drill burr to a shaft (in our case old Bulldog clamps). Be sure that the burr is ~45° relative to the shaft for easier handling.\n\t\tNote: diamond scribes also work well for cutting cover glass.\nMaking slide-A - using a standard microscope slide, tape a short piece of ruler paper (~2 cm) to the bottom of the slide so that you can see the ruler through the glass. Next, place a piece of tape along the edge of the 0 mm mark of the ruler to act as a fixture for the cover glass in the next step.\nUsing the modified drill burr, slide-A, and an unmodified microscope slide (slide-B), position a piece of cover glass (no. 1.5 thickness) to the 0 mm mark on slide-A. Use slide-B to hold the cover glass in place and as a jig for the intended cut line. Cut the cover glass into a long rectangle of approximately 5 x 22 mm. Rotate the cut glass 90° and cut the rectangle into smaller rectangle of ~2 x 5 mm.\nStaple modifications - two modified staples will be implanted to support and fix the window chamber to the vertebrae (see section 2.7-8).\n\t\nUsing a standard small staple (crown = 8 mm; leg = 4 mm), bend the middle of the crown ~90° so that the tips of the legs are nearly touching.\nBend the tips of the legs outwards ~45° at the half-way point, so that the distal half of the legs are parallel.",
    "Bend the distal half of the legs ~30° upward relative to the plane of the staple. Place the modified staples into ethanol prior to surgery for sterilization.\n\t\tNote: Staples can also be sterilized using ethylene oxide or autoclaved.\nPaperclip modifications - prepare one modified paperclip to be implanted as part of the chamber (see sections 2.9-10) and to act as a holding clip for surgery and imaging.\n\t\nUsing a standard 25 mm paperclip, remove the small bend leaving an elongated U-shape.\nUsing pliers or needle-drivers, reduce the diameter of the bend to ~2 mm while keeping the tips parallel.\nBend the tips outward ~90° at about 8-10 mm from the bend. Make any adjustments necessary so that it lies flat.\n2. Window Implantation\nNote: All surgical and animal care procedures were conducted in accordance with the European Communities Council Directive and were approved by the National Animal Studies Committee of France (authorization no. 13,300).\nAnesthetize the mouse (Ket/Xyl; induction dose: 120 mg/kg, 12 mg/kg; supplemental dose, 40 mg/kg, 4 mg/kg), apply eye ointment to the eyes.\nShave its back approximately ~2 cm wide by ~5 cm long, centered on the thoracic hump, and clean the exposed skin using iodine soap followed by iodine solution. Clean gloves by spraying with 90% ethanol. \nUsing tissue scissors cut the dorsal skin longitudinally over vertebrae T11 to L1 (~2 cm). Using a scalpel, make bilateral longitudinal incisions between the spinous and transverse processes from T11 to L1. Note: If gloves or instruments touch the fur or skin of the animal, reclean the gloves or instrument using a cold sterilizer such as 90% ethanol or Germ-X.",
    "Suspend the mouse in the spinal fork stereotaxic - Begin by clamping the top right spinal fork into position. Grasp T11 using Adson forceps and position the T11 transverse process over the fixed spinal fork. While holding the vertebra in place, fasten the contralateral spinal fork under the contralateral transverse process.\nUsing the same procedure as step 2.4, position L1 within the spinal fork.\nUsing a scalpel (no. 23), gently scrape away the muscles between the spinous and transverse processes from T11 to L1 so that the laminae are clearly visible. For a better view of the pedicles of T11, cut the tendon projecting rostrally from the tip of the transverse process.\nRinse the modified staples with PBS, and insert the tips of the staples lateral to the vertebral pedicles of T11 and L1 adjusting the distance between the tips so that they are lightly touching the pedicles.\n\tNote: Use only PBS containing dexamethasone (0.1%), penicillin (1,000 U/ml), and streptomycin (1 mg/ml), to reduce postsurgical inflammation and to improve window clarity.\nGlue the staples in place with a small drop of cyanoacrylate at each insertion point and remove the mouse from the spinal forks.\nApply a thin layer of cyanoacrylate to the cut edges of the skin and exposed muscles around the cleared vertebrae being careful to not glue the vertebrae. Bend the tips of the modified paperclip so that they enter under the protruding sections of the implanted staples and rest parallel to the long axis of the isolated vertebral column and leave in this position.\nStarting at the skin-muscle interface, apply several layers of dental cement to cover the entire opening except the exposed vertebrae, being sure to implant the paper clip securely within the dental cement.",
    "Once the dental cement is cured (5-15 min), attach the mouse to the 'clip holder' by the exposed portion of the implanted paper clip. Using forceps, remove the muscle and other soft tissue between the spinous processes and laminae of the exposed vertebrae.\n\tNote: Any device that can securely grasp the exposed portion of the paperclip without causing stress to the clip/chamber, and can be maneuvered to reorient the mouse throughout surgery can be used as a 'clip holder'.\nUsing the bone removal drill, thin the laminae of T12 and T13 bilaterally. To remove the dorsal bone, grasp the spinous process with blunt forceps and lift taking care to apply no downward force towards the spinal cord. If the bone does not easily come away, continue to thin the laminae until the spinous process can be easily removed.\nUsing the bone removal drill, continue to shape the lateral edges of the vertebrae to form a support structure for the window. Gently remove all of the small bone fragments touching the dura mater using blunt forceps. Be sure to maintain the humidity of the dura mater using PBS.\nChoose one of the prepared windows that is slightly wider than the laminectomy opening and test how well it rests on the exposed bone. Ideally, the window will rest bilaterally on both vertebrae so that the middle of the window touches the dura mater (Figure 1a). The window should not, however, compress the spinal cord even when pushing the window towards the spinal cord. If the window is unbalanced or rests above the dura, repeat step 2.13.\nOnce satisfied with the laminectomy, place a small piece of autoclaved tissue-paper soaked in PBS onto the spinal cord to prevent drying of the dura and set the mouse aside.",
    "Cleaning the window - place the window in a solution of window cleaner for several seconds. Using a piece of microscope lens tissue, wipe the window dry. With the surgical microscope verify that the window is clean, and repeat the cleaning process if not. Place the window in a clean area with easy access for rapid retrieval and placement of the window in step 2.19.\nRetrieve the mouse and remove the tissue paper. Gently remove any debris from the dura using blunt forceps and allow the dura to dry until slightly tacky.\nQuickly fill the silicone (Kwik-sil) mixer tube and extrude silicone onto a clean slide until there are no bubbles emerging from the tip. Immediately administer a small bead of silicone along the midline of the exposed spinal cord.\nRetrieve the cleaned windows using blunt forceps and immediately place over the silicone. Using the blunt forceps, apply a small amount of pressure to the window to spread the silicone to the edges of the window and hold in place for ~1 min.\n\tNote: Prior to mixing, silicone must be stored below 27 °C otherwise the cure-time can increase significantly and it will not adhere to the window or dura mater leading to reduced optical clarity.\nSlowly release pressure from the window. If the window does not move, proceed immediately to step 2.21. If, however, the window rises when the pressure is released (i.e. the vertebrae move), proceed to step 2.21 while maintaining pressure on the window to hold it in place.",
    "Apply cyanoacrylate rostral and caudal of the window. If the cyanoacrylate does not cover the rostral and caudal edges of the window, use a toothpick to guide some of the liquid cyanoacrylate over these edges. Next, guide the glue along the lateral edges of the window (Figure 1a) to cover all of the surrounding muscles. Note: The cyanoacrylate should cover the surface of the outer edges of the window. Too much cyanoacrylate can compromise optical clarity, not enough cyanoacrylate will result in air bubbles between the silicone and window.\nTo protect the cyanoacrylate and increase structural integrity of the chamber, apply dental cement to all regions covered with cyanoacrylate (Figure 1a). As with the cyanoacrylate, start at the rostral and caudal edges and use a small wood stick to guide the dental cement along the edges of the window.\n3. Postoperative Care, EAE Induction, and Window Maintenance\nInject Dexamethasone (0.2 mg/kg) and Rimadyl (5 mg/kg) s.q. over the pelvic regions. Transfer the mouse to a warm cage (~26 °C) with nesting material. Mice should be fully mobile, exploring their cage, and grooming after the effects of the anesthetic have fully subsided (usually 2-3 hr). House animals individually and make sure they have easy access to food and water for the first 1-2 days. Once the mouse begins to recover from anesthetic, inject buprenorphine (0.05 mg/kg) s.q. Following full recovery from anesthetic, the mouse should show no signs of pain. Note: Once fully recovered from anesthetic, any signs of pain or abnormal motor activity indicate that the window was not implanted correctly.",
    "Inject Dexamethasone(0.2 mg/kg) and Rimadyl (5 mg/kg) every 2 d for the first 10 d after surgery (Figure 1a). To inject mice with windows, lightly sedate the animal with isoflurane in an induction chamber (~1.75% isoflurane in air for 1-2 min). Remove the mouse from the chamber and immediately inject the drugs. The mouse should be fully awake in <1 min.\n\tNote: Do not scruff mice with implanted windows since this can cause separation of the skin from the implant. It is possible to inject mice i.p. without sedation by allowing them to grab a cage lid with their forepaws and gently raising their hindlimbs. However, in this position the mouse will sometimes pull away causing stress to the implanted window. This can lead to bleeding between the window and spinal cord, thus compromising optical clarity.\nEAE can be induced at 2-3 weeks after the cessation of anti-inflammatory treatment (~3-4 weeks after surgery). Lightly sedate the mouse as described in step 3.2. Remove the mouse from the induction chamber and maintain the sedation with an isoflurane mask placed over the nose.\nInject MOG35-55 peptide (75 µg in Freund's adjuvant containing 800 µg of mycobacterium tuberculosis) into 3 different s.q. locations (bilaterally over the femur, and at the base of the tail), and pertussis toxin (400 ng) i.p.14,15\n\tNote: Mice with EAE require supplemental care compared to mice with windows only. Weigh EAE mice every day and be sure that they have easy access to food and water at all times. Supplement with a 3% agarose jelly containing to maintain animal hydration and weight. Glucose (1-3%) can also be added to the jelly for additional calories.\nTwo days after EAE induction, repeat the sedation protocol outlined in step 3.2 and inject a second dose of pertussis toxin (400 ng) i.p.",
    "To image the spinal cord, first sedate the animal as described in step 3.2, and lightly anesthetize with ketamine/xylazine (100 mg/kg; 10 mg/kg) i.p. This will provide ~ 1 hr of imaging.\nFor imaging sessions lasting <2 hr, light anesthesia can be maintained with supplementary injections of ketamine/xylazine (50 mg/kg; 5 mg/kg) every 45-60 min. Alternatively, for longer imaging sessions, mice can be continuously sedated with isoflurane (0.75-1.25% isoflurane in humidified air).\n\tNote: windows can be cleaned under a surgical microscope by gently wiping away debris with the corner of a tissue or a cotton-tipped swab. Do not use alcohol to clean the window because it can degrade some types of dental cement and it can cool the spinal cord.\nOnce lightly anesthetized, the mouse is attached firmly to a clip holder by the exposed portion of the implanted paperclip (Figure 1b).\nThe spinal cord is aligned perpendicular to the objective lens by adjusting the positioning of the clip within the holder, adjusting the position of the holder, and adjusting the position of the stage. The dorsal surface of the spinal cord is rapidly imaged, and the dorsal vasculature is used to determine the orientation of the spinal cord.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}