{
  "id": 2049,
  "origin_website": "Cell",
  "title": "Detection of thermal shift in cellular Keap1 by protein-protein interaction inhibitors using immunoblot- and fluorescence microplate-based assays",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nProtocol A. Keap1-CETSA\nIn this section of the Keap1-CETSA protocol we will be using intact live cells that have been treated with either vehicle or the Keap1-Nrf2 protein-protein interaction inhibitor PRL-295 (Lazzara et al., 2020[href=https://www.wicell.org#bib4]) for 3 h to perform the cellular thermal shift assay (CETSA). This protocol can also be adapted for use with lysates derived from cells with a protein concentration of at least 1 mg/mL. In the case of the latter, cell lysates are prepared and incubated with the compound of interest for 1–3 h. Aliquots of the cell lysate are then heated at various temperatures. The use of intact cells over cell lysates has the advantage that it takes into account the ability of the compound to cross the cell membrane.\nCell culture and treatment of cells with compound\nTiming: 4–5 h\nPrepare the test compounds and thermocycler.\nSet a water bath to 25°C. This will be used for the cell lysate preparation steps. Prepare a float/container that can hold PCR strip tubes.\nNote: We use the plastics from the standard 96-well pipette tip racks from the tip boxes as a float for the tubes.\nWarm the cell culture medium to 37°C.\nPrepare stock solutions of the compounds, for example by dissolving in an organic solvent that is suitable for the compound of interest and dilute in the cell culture medium at a concentration that can be tolerated by the cells; for this protocol the PPI inhibitor PRL-295 was dissolved in dimethyl sulfoxide (DMSO). To avoid potential cytotoxicity, keep the concentration of the solvent when treating intact cells at 0.1% (v/v).",
    "Pre-program two protocols for the thermal cycler, with six temperature zones each (one with 40°C, 42.5°C, 45°C, 47.5°C, 50°C and 52.5°C, and another, with 55°C, 57.5°C, 60°C, 62.5°C, 65°C and 67.5°C) for 3 min, followed by 25°C for all for a further 3 min.\nNote: Two protocols are required due to space limitation in the thermocycler as it only contains six VeriFlex blocks which are independent temperature zones.\nCount the HL-60 cells, adjust to a cell density of 1–2 × 106 cells per mL, and plate 15 mL of cell suspension into each of six separate T75 flasks.\nNote: This step could be applied for adherent cells, however, the cells have to be trypsinized following incubation with the test compound to obtain a cell suspension which will then be subjected to heating.\nCritical: It is important to perform the experiment with the number of cells stated to be able to pellet the aggregated proteins in the subsequent steps.\nTo each of the first three flasks, add 15 μL of vehicle [DMSO used in the example below; final solvent concentration of 0.1% (v/v)]. To each of the other three flasks, add 15 μL of test compound [in this example PRL-295 stock concentration: 10 mM, final concentration 10 μM, is used]. Gently pipette the cell suspension to ensure that the solvent or the compound has been homogeneously mixed.\nIncubate the cells in a humidified 37°C with 5% CO2 incubator for a period of 1–3 h. The incubation time can vary depending on the compound of interest. For this protocol we treated the cells with either the vehicle or compound for 3 h.\nCell suspension preparation and heat treatment\nTiming: 2–4 h\nPrepare the cell suspension for heat treatment.",
    "Transfer the cell suspensions from each treatment group into their respectively labeled 50 mL centrifuge tubes.\nPellet the cells by centrifugation at 300 × g for 4 min at temperature between 20°C-25°C.\nAspirate the supernatant and gently flick the bottom of the tube to loosen the cell pellet before resuspending the cells in 20 mL of PBS.\nCritical: It is important to wash the cells with PBS to remove the serum present in the culture media as inadequate removal of the serum can affect the outcome of the immunoblotting process.\nPellet the cells by centrifugation at 300 × g for 4 min at temperature between 20°C-25°C. Repeat steps 5.c and 5.d once more.\nDuring the centrifugation process, prepare 10 mL of PBS supplemented with the protease inhibitor cocktail (PBS-PIC).\nNote: Only 9 mL of PBS-PIC is required, however, to account for losses during pipetting, 10 mL of solution is prepared.\n20× Protease Inhibitor Cocktail (PIC) Stock – Prepared on the day of experiment and kept at 4°C\ntable:files/protocols_protocol_1532_1.csv\nPBS with Protease Inhibitor Cocktail (PIC) (PBS-PIC) – Prepared on the day of experiment and kept at 20–25°C\ntable:files/protocols_protocol_1532_2.csv\nOnce the cells have been pelleted, aspirate all the supernatant carefully and gently resuspend the pellet in each tube with 1.5 mL of PBS-PIC and ensure that the cell suspension is homogeneous with no visible clumps.\nNote: Flick the tube containing the cell pellet gently to loosen it before resuspending in PBS-PIC.\nSubject the cells to heat treatment.\nAliquot the cell suspension from each treatment, by transferring 100 μL (∼1–2 million cells) into each of 12 separate 0.2 mL PCR tubes and place the caps onto the tubes.\nLabel the tubes according to their treatment and temperature (40°C–67.5°C, 2.5°C increments).",
    "Start the program on the thermal cycler that you have set up previously (step 1.d) and ensure that the temperature gradient has been established before placing the first set of tubes (40°C–52.5°C, 2.5°C increments) into the pre-heated thermocycler as shown below. Place the tubes in the thermocycler once the temperature has been reached (Figure 1[href=https://www.wicell.org#fig1]).\nCritical: Do not place the tubes in the thermal cycler during the temperature ramp-up stage to avoid exposure to incorrect temperatures.\nOnce the program has ended, remove the tubes from the PCR machine and let the tubes cool at temperature between 20°C-25°C for a further 3 min.\nSnap-freeze the tubes from step 6.d in liquid N2.\nRepeat steps 6.c and 6.d for the next set of tubes with the second thermocycler program (55°C–67.5°C, 2.5°C increments).\nSnap-freeze the tubes from step 6.f in liquid N2.\nCritical: Wear protective goggles and gloves when transferring tubes from liquid N2 as there is a possibility that the caps may pop out or the strip tubes may crack due to the extreme differences in temperature. To prevent this from happening, ensure that the container you are transferring your samples to is pre-chilled. Use forceps to transfer tubes from liquid N2 to prevent bodily injuries.\nPause point: The experiment can be paused at this point by transferring the tubes to the −80°C freezer for storage.\nObtain the soluble fraction from the heat-treated cells and prepare lysates for immunoblotting analysis.\nRemove the tubes from liquid N2 (or take out the tubes that have been stored in the −80°C freezer), place on a 96-well plastic float, and transfer to the 25°C water bath to thaw. Check the samples every minute until the samples are completely defrosted.",
    "Note: It usually takes 3–4 min for the samples to completely thaw. We use the plastic racks from standard 96-well pipette tip boxes as a float for the 0.2 mL tubes.\nOnce the lysates have thawed, vortex briefly with a few pulses before freezing them in liquid N2.\nRepeat the freeze-thaw cycle (steps 7a and 7b) three more times.\nTransfer all the lysate (∼100 μL) from each tube into a labeled 1.5 mL microcentrifuge tube.\nPlace all tubes into a centrifuge and spin the lysates at 17,000 × g for 40 min at 4°C.\nAfter the centrifugation has ended, carefully place all tubes on ice.\nCritical: Ensure that the ice in the bucket is not compacted. Transfer the tube from the centrifuge to the ice bucket very carefully to prevent the possibility of dislodging the pellet containing the cell debris and protein aggregates. Alternatively, use cold blocks (which fit 1.5 mL tubes) placed on ice.\nCarefully pipette 60 μL of the lysate from each tube without touching the pellet and sides of the tubes and transfer it into a fresh centrifuge tube containing 20 μL of the 4× LDS sample loading buffer and 4 μL of β-mercaptoethanol (β-ME).\nNote: SDS sample loading buffer could also be used as an alternative to LDS sample loading buffer. The reducing agent dithiothreitol (DTT) could be used instead of β-ME.\nBriefly vortex the tubes to mix all the contents in the tube and leave the tubes at temperature between 20°C-25°C for 30–60 min before gel loading.\nNote: Although typical gel electrophoresis protocols include a step where the denatured protein samples are heated to 95°C or boiled, we omit this step because it may cause uneven evaporation and, for some proteins, aggregation that interferes with the ability of the proteins to uniformly enter the gel.",
    "Pause point: The experiment can be paused at this point by transferring the tubes to the −80°C freezer for storage after incubation with the reducing agent, β-ME.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1532-Fig1.jpg\nFigure 1. Scheme of the thermocycler setup used for subjecting cells or cell lysates to heat treatment\nImmunoblotting analysis\nTiming: 2 days\nResolve the proteins in the soluble fractions using electrophoresis.\nLoad 13 μL of the samples into each well of a 26-well 4%–12% NuPAGETM BT midi gel along with pre-stained molecular weight markers using the NuPAGE midi gel running tank using the NuPAGETM 1× MOPS running buffer. Example sample loading sequence: Molecular weight (MW) marker, DMSO treated samples (12 samples from 40°C-67.5°C) and PRL-295-treated samples (12 samples from 40°C-67.5°C).\nRun the gel at 100 V for approximately 2 h 10 min and stop the run once the LDS loading dye reaches the bottom of the gel.\nCritical: The timing given is a guide and can vary with different gel running systems, therefore, it is important to frequently check the gel while it is running to ensure that the samples are separating well and to observe the dye front to monitor the progress of the electrophoresis.\nTransfer the resolved proteins from the gel to a nitrocellulose membrane.\nOnce the run has completed, place the gel into the transfer sandwich cassette where it is placed on the top of two pieces of Whatman 3MM filter paper and a sponge, both of which have been soaked in transfer buffer (see key resources table[href=https://www.wicell.org#key-resources-table]) at the cathode side. Use a roller to ensure that there are no bubbles trapped under the gel.",
    "Place a 0.45-μm nitrocellulose (NC) membrane that has been pre-soaked in transfer buffer on the top of the gel and use the roller to remove any bubbles trapped between the gel and the membrane.\nPlace two more pieces of transfer buffer-soaked filter paper on top of the NC membrane followed by a sponge which is placed towards the anode side of the cassette.\nNote: Use the roller to remove any bubbles trapped between the gel and the membrane right before securing the clasp of the transfer cassette.\nFit the transfer sandwich cassette in the Criterion Blotter transfer tank and insert an ice pack, fill the tank up with transfer buffer to the marked fill level and transfer at 70 V for 1 h 10 min at temperature between 20°C-25°C.\nOnce the transfer is complete, place the NC membrane in a clean container containing deionized water to rinse the blot briefly.\nStain the NC membrane with Ponceau S stain (see key resources table[href=https://www.wicell.org#key-resources-table]) and rinse with deionized water to visualize the transfer quality.\nTo remove the Ponceau S stain, wash the NC membrane with PBST for 3 min twice or until the stain has been completely removed.\nDetect Keap1 on the membrane by immunoblotting.\nBlock the NC membrane in PBST-Milk for 1 h at temperature between 20°C-25°C.\nIncubate the NC membrane for 16–20 h in the Keap1 primary antibody diluted 1:1,000 in PBST-Milk at 4°C.\nWash the NC membrane in PBST for 10 min and repeat this wash step twice.\nIncubate the NC membrane in the Goat anti-Rat IRDye 800 secondary antibody diluted 1:20,000 in PBST-Milk for 1 h at temperature between 20°C-25°C, protected from light.\nWash the NC membrane in PBST for 10 min at temperature between 20°C-25°C, protected from light, and repeat this wash step two more times.",
    "Scan the NC membrane using the Odyssey CLx scanner to visualize the bands corresponding to the Keap1 protein (∼65 kDa).\nMeasure the intensity of each band using the image analysis software Image StudioTM Lite and export the data to an excel spreadsheet.\nIn each group, normalize the intensity of the bands by setting the intensity of the band for the 40°C treatment to 100% and plot the values (relative to the 40°C treatment intensity) to form aggregation curves for the vehicle treated samples and the compound treated samples. Compare the two curves to observe whether there are differences in the thermostability profile of Keap1. An example of such plot is shown in Figure 2[href=https://www.wicell.org#fig2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1532-Fig2.jpg\nFigure 2. An example of data obtained with Keap1-CETSA (Protocol A) showing that PRL-295 increases the thermostability of Keap1 in intact live HL-60 cells\nThe top panel is a representative immunoblot of Keap1, where the Keap1-CETSA assay was performed using intact live HL-60 cells (1 × 106 cells per mL) treated for 3 h with 0.1% (v/v) DMSO or 10 μM PRL-295. In the bottom panel, each data point (the soluble fraction obtained from 1 × 106 cells) represents the fluorescence intensity of Keap1 normalized to the 40°C treatment from each condition. Shown are individual data points for three replicates for each condition. The data were plotted using GraphPad Prism 8.0 software, where the four parameter logistic (4PL) regression model was used to generate a sigmoidal curve represented with mean and error with 95% confidence interval (CI). Data from Dayalan Naidu et al., 2021[href=https://www.wicell.org#bib2].",
    "Note: For this immunoblotting protocol, any western blotting system can be used. For more detailed information on gel electrophoresis and electrophoretic transfer procedure, instructions from the manufacturer Bio-rad can be found at https://www.bio-rad.com/sites/default/files/webroot/web/pdf/lsr/literature/Bulletin_2895.pdf[href=https://www.bio-rad.com/sites/default/files/webroot/web/pdf/lsr/literature/Bulletin_2895.pdf]. We have only tested the fluorescently conjugated secondary antibodies (step 10.d) to measure the fluorescence intensities of the band and we suggest using this technique to measure the intensities. We have not tested the chemiluminescence-based detection method for this protocol.\nQuantification and statistical analysis for Keap1-CETSA\nQuantify the amount of Keap1 in each lane.\nObtain the fluorescence intensity of each band on the western blot image using the ‘Add Rectangle’ or ‘Draw Rectangle’ function found within the Analysis tab in the Image StudioTM Lite software.\nAfter obtaining the signal intensities of all the desired bands, either export the file or copy and paste the intensities (‘Signal’ column) found within the ‘Shapes’ tab into a Microsoft Excel file.\nLabel the treatment and temperature conditions of each of the acquired band intensities.\nNormalize the band intensity from each treatment to its respective 40°C temperature condition where the 40°C band intensity is set to 100%.\nUsing the Prism software, plot the normalized band intensity of Keap1 at each temperature and perform statistical analysis.\nMake the data table by choosing a XY Table Format where you will select ‘Enter or import data into a new table’. Click ‘Show the row titles’, where the x values (Numbers) are entered [Temperatures (oC)] and the y values [normalized band intensities (%)] are entered as 3 replicate values in side-by-side columns.\nPlot the relative band intensities calculated in Microsoft Excel on the y-axis from each temperature condition (x-axis) using the Prism software.",
    "View the graph made by software and under Analysis, choose the ‘Interpolate a standard curve’ option. To select a model, under ‘Standard curves to interpolate’ choose the ‘Sigmoidal, 4PL, X is log(concentration)’ equation with ‘No special handling for outliers’ and plot curve with ‘95% confidence bands’.\nA graph showing the curves generated for each treatment (DMSO or 10 μM PRL-295) will be displayed, where an example of such a plot is shown in Figure 2[href=https://www.wicell.org#fig2].\nTo determine statistical significance, from each temperature condition, compare the means of the treatment groups by performing a Student’s t-test.\nNote: There are various softwares and methods to analyze and plot the data, this is one example of how the data can be displayed.\nProtocol B. Keap1-Glow CETSA\nIn this protocol, the lysates of untreated cells expressing fluorescent Keap1-mCherry protein (KC-lysates) or a control mCherry protein (C-lysates) (see section “before you begin[href=https://www.wicell.org#before-you-begin]”) will be used for treatment with compounds/vehicle, followed by exposure to a temperature gradient, removal of aggregates and fluorescence-based measurements of the remaining soluble fractions.\nPreparation of cell pellets and thermocycler\nTiming: 1 h\nOnce the cells are expanded and induced with doxycycline, prepare the cell pellets as follows:\nWash each 15-cm dish thrice with PBS.\nAspirate the PBS and add 1 mL of PBS-PIC (PBS containing 1× Protease Inhibitor Cocktail; also see step 5e for PBS-PIC recipe).\nScrape the cells from each dish with a cell lifter and collect into 1.5 mL centrifuge tube.\nPellet the cells at 400 × g for 5 min using a microcentrifuge.\nAspirate the supernatant, leaving a very small amount of it (less than 10 μL) still in the tube.\nSnap-freeze the tubes with the cell pellets in liquid nitrogen (N2) and store at −80°C until use.",
    "Note: Steps 13.a–e are performed at temperature between 20°C-25°C. Large quantity of frozen cell pellets could be prepared in advance for a large-scale experiment or a series of experiments for added consistency.\nPre-program two protocols for the thermal cycler, with six temperature zones each (one with 39°C, 42°C, 45°C, 48°C, 51°C and 54°C and another with 57°C, 60°C, 63°C, 66°C, 69°C and 72°C) for 3 min, followed by 25°C for all for a further 3 min. Of note, two protocols are required due to space limitation in the thermocycler.\nCell lysis, compound treatment, heat treatment, and fluorescence measurement\nTiming: 1 day\nPrepare for cell lysis.\nSet a water bath to 25°C. This will be used for the cell lysate preparation steps.\nPre-warm a thermal shaker to 37°C. This will be used for the incubation of the lysate with the compounds.\nPrepare PBS-PIC, 1.5 mL per each cell pellet from a 15-cm dish.\nNote: If using cell culture dishes other than 15-cm diameter, scale the PBS-PIC amount proportionally to the surface area of the dish.\nPrepare a container with liquid N2.\nSet up the temperature of two microcentrifuges, one to 22°C and another, to 4°C.\nPrepare cell lysates.\nThaw the appropriate number of cell pellets required for the size of experiment (approximately one and a half pellet from a 15-cm dish or 3–4 × 107 cells of each cell type is required for each treatment or control).\nAdd 1.5 mL of PBS-PIC to each tube, resuspend well and separate into two 1.5 mL centrifuge tubes, approximately 750 μL each.\nNote: If using cell culture dishes other than 15-cm diameter, scale the PBS-PIC amount proportionally to the surface area of the dish.\nSnap-freeze the tubes in liquid N2 and leave in liquid N2 for at least 3 min.",
    "Place the samples into a foam float or a rack and transfer it to the 25°C water bath. Thaw for 4–8 min, or until completely thawed.\nVortex.\nRepeat steps 16.c–e three more times.\nPause point: The experiment can be paused before the last thawing step, and the tubes could be stored at −80°C for later use. In this case, on the day of continuing the experiment, repeat steps 16.d and 16.e before proceeding.\nSpin the tubes at 9,600 × g for 5 min at temperature between 20°C-25°C.\nCollect the supernatants, combining the supernatants from the same cell type together.\nSeparate supernatants into 650 μL aliquots, 3 aliquots of each cell type for each treatment or control.\nTreat the cell lysates with compounds.\nPrepare solutions of compounds of interest or vehicle such as DMSO, in PBS at concentration that is 131-fold higher than the desired final concentration, with the final volume in excess of 30 μL for each type of treatment or control.\nMix 5 μL of the compound solution prepared in step 17.a, or 5 μL of vehicle solution, with the 650 μL cell lysate in triplicates, for both cell types.\nIncubate at 37°C for 1 h.\nSubject the treated cell lysates to heat treatment.\nSeparate each mixture into 12 of 50-μL aliquots, into either 0.2 mL PCR tubes or individual wells of MicroAmp Optical 96-well reaction plates cut to be compatible with the thermal cycler. The pattern should correspond to the temperature zones in the thermal cycler to ensure that each aliquot from the same sample is heated at a different temperature (see example below). Please note that for the settings described here, two plates are required to accommodate the full range of temperatures. Example of sample pattern in the heating plates for Keap1-Glow CETSA.\ntable:files/protocols_protocol_1532_3.csv\ntable:files/protocols_protocol_1532_4.csv",
    "The sample names are abbreviated as follows: first 1–2 letters indicate cell type (KC for cells expressing Keap1-mCherry, C for cells expressing mCherry), followed by a replica number (out of 1, 2 or 3), the next letter (after dash) indicates treatment (D for drug/compound, V for vehicle) and the last two numbers (after dash) correspond to the heating temperature. The temperature zone at each position is indicated at the top.\nStart one of the pre-programmed protocols (39°C–54°C) on the thermal cycler and ensure that the temperature gradient has been established before placing the set of tubes into the preheated thermal cycler.\nCritical: Do not place the tubes in the thermal cycler during the temperature ramp-up stage.\nOnce the program has ended, remove the tubes/plate from the PCR machine and let them cool at temperature between 20°C-25°C for a further 3 min.\nRepeat steps 17.a–c for the next set of tubes/plate, using a second program (57°C–72°C).\nDetermine the amount of Keap1-mCherry and mCherry in the soluble fraction of the heated lysates by measuring the mCherry fluorescence.\nTransfer the lysates into pre-labeled 1.5 mL microcentrifuge tubes.\nCentrifuge the tubes at 17,000 × g for 40 min at 4°C.\nMove the tubes onto ice and transfer 40 μL of each lysate into a separate well of a 96-well clear plate (“holding” plate), in the pattern desired for measurements (see 19.d for an example).\nCritical: Do not touch the pellet and the side of the tube with the pelleted lysates.\nUsing a multi-channel pipette, fill white flat-bottom 96-well plate(s) with 65 μL (for KC- lysates) or 85 μL (for C-lysates) of PBS-PIC in a pattern desired for measurements (see example below).\nCritical: Include a row of “blanks” with 100 μL of PBS-PIC.\nExample of sample pattern in the measuring plates for Keap1-Glow CETSA.\ntable:files/protocols_protocol_1532_5.csv",
    "Sample abbreviations as in 18.a. For all rows except the last one, add 65 μL of PBS-PIC and 35 μL of indicated sample. For the last row, add 100 μL of PBS-PIC.\ntable:files/protocols_protocol_1532_6.csv\nSample abbreviations as in 18.a. For all rows except the last one, add 85 μL of PBS-PIC and 15 μL of indicated sample. For the last row, add 100 μL of PBS-PIC.\nUsing a multi-channel pipette, transfer 35 μL (for KC-lysates) or 15 μL (for C-lysates) from “holding” plate(s) to the pre-filled white 96 well plate(s).\nCritical: The volume of the lysates, and the corresponding volumes of PBS-PIC in steps 19.d and 19.e that bring the total volume in each well to 100 μL, need to be optimized for each cell line to achieve fluorescence intensities within the linear range of a plate reader. The fluorescence intensities will depend on the expression levels of Keap1-mCherry or mCherry and may vary between cell lines.\nSet up the plate reader. For the Spectramax M2 operated by SoftMax Pro 7.1 (Molecular Devices), select or type in Fluorescence tab within Settings: Excitation 580 nm, Cut off 590 nm, Emission 615 nm (corresponding to the fluorescence spectra of mCherry). In Plate tab, select “96-well standard opaque”.\nPlace the white plate into the plate drawer, on the top of an adaptor frame for 96-well plates.\nMeasure the mCherry fluorescence of the entire plate or in selected wells.\nQuantification and statistical analysis for Keap1-Glow CETSA\nAnalyze the data.\nSubtract the background calculated as an average fluorescence values of all PBS-PIC samples (“blanks”) in a particular plate, from all the other values in the same plate, to get the background-corrected fluorescence values for the samples.",
    "For each cell type, calculate the average background-corrected fluorescence of vehicle-treated samples that were heated at the lowest temperature (39°C), to get a normalization factor.\nNormalize the data by dividing each background-corrected fluorescence value by a normalization factor specific for each cell type. Use the same normalization factor for vehicle and compound-treated cells of the same type.\nPlot the normalized data against the heating temperature to visualize the aggregation curve. Optionally, the visualization can be enhanced by fitting the local polynomial regression curve to the data, using R or other suitable software. An example of such plot is shown in Figure 3[href=https://www.wicell.org#fig3].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1532-Fig3.jpg\nFigure 3. An example of data obtained with Keap1-Glow CETSA (Protocol B) showing that PRL-295 alters the thermostability of Keap1-mCherry, but not free mCherry measured at the same temperature range, in U2OS cell lysates\nTemperature-dependent aggregation curves in lysates from U2OS cells stably expressing Keap1-mCherry (left) or mCherry (right) pre-treated for 1 h with 15 μM of PRL-295 (red) or the same volume of vehicle (DMSO, blue) are displayed as mCherry fluorescence intensities that remained after removal of precipitated material from lysates heated to the indicated temperatures, normalized to that of vehicle-treated sample heated to 39°C (dots). The smoothing lines that represent local polynomial regressions fitted to the data are added to enhance visualization. Data from Dayalan Naidu et al., 2021[href=https://www.wicell.org#bib2]."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Cell Biology",
    "Cell-Based Assays",
    "Cell Culture"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}