{
  "id": 1676,
  "origin_website": "Cell",
  "title": "Liquid culture system for efficient depletion of the endogenous nutrients in Arabidopsis seedlings",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nLiquid culture system for glucose-TOR signaling study\nPreparation mitotic quiescent roots by sugar depletion\nTiming: 5 days\nPrepare sugar depletion seedlings with mitotic quiescent roots.\nAdd 1 mL of 1/2 MS sugar-free or sugar-containing (0.5% (w/v)) liquid medium to each well of a 6-well plate.\nNote: The volume of media in the 6-well plate should be 1 mL per well for ideal plant growth.\nNote: 6-well plates are highly recommended for this assay. To fit the experiments that need less or more plant materials, 12-well or 9 cm round plates could be also used. But the volume of media per well should be scaled down or up based on the well size.\nSow 10 surface-sterilized WT Arabidopsis seeds in each well.\nNote: The number of seeds for each well should be identical for each biological experiment, and no more than 15.\nGrow the seedlings in an environment-controlled growth room or chamber at 22°C, 65% humidity, and 75 μmol m –2 s –1 light intensity under a 12 h light/12 h dark photoperiod for up to 4 days after germination (DAG). Troubleshooting 1[href=https://www.wicell.org#sec7.1]\nShake the 6-well plates gently once by hand every day to help the uniform distribution of nutrients in the liquid medium.\nReplace the liquid medium in each well by 1 mL of fresh medium at day 4, or before any treatments.\nNote: DAG: Day After Germination. In this protocol, 4 DAG refers the 5th day after sowing because Arabidopsis seeds need one day to germinate in the medium.",
    "Note: Replacing the liquid medium at day 4 or before the treatments is critical. Replacing of the medium is to ensure that other nutrients are not exhausted during the incubation process. The final volume of medium in each well is exactly one milliliter, and all nutrients excepts for the glucose are the same among the different experimental samples.\nCritical: One milliliter, neither more nor less, of media in each well of 6-well plate is critical for depleting the plant’s endogenous sugar in this liquid culture system. Less than one milliliter will not efficiently block the carbon dioxide absorption by the plant seedlings, which may then trigger weak photosynthesis activity in the seedlings and cause insufficient sugar depletion. More than one milliliter medium in the well might cause undesired hypoxia responses.\nPhenotype observation and analysis of sugar depletion seedlings\nTiming: 2–4 days\nAnalysis the root growth phenotype in the sugar depletion seedlings\nCapture the photos of the seedlings growing in sugar-free or sugar-containing medium at 1 to 4 DAG (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1137-Fig1.jpg\nFigure 1. Glucose-TOR signaling regulates root meristem activity\n(A) Glucose depletion inhibited Arabidopsis primary root growth. DAG, day after germination. Scale bar: 5 mm.\n(B) Quantification of primary root length in (A). n ≥10. Data are means ± SD.\n(C) Root apical meristem activities, indicated by EdU staining, were gradually decreased by glucose depletion. Scale bar: 50 μm.\n(D) Quantification of EdU staining intensity in (C). n ≥10. Data are means ± SD.\n(E) Glucose re-activation of the quiescent root apical meristem required TOR kinase. 4 DAG seedlings were recovered for 2 h by 15 mM glucose (0.27% (w/v)) with or without Torin2 (5 μM). Scale bar: 50 μm.",
    "(F) Quantification of EdU staining intensity in (E). n ≥10. Data are means ± SD. ∗p< 0.05 (two-sided Student’s t test).\n(G) TOR kinase activity in the seedlings were decreased by glucose depletion, and could be quickly reactivated by resupplying 15 mM glucose (0.27% (w/v)) for 15 min 35S::S6K1-HA seedlings were germinated in sugar-free medium (without glucose) and were treated as indicated.\n(H) Seedlings grown in glucose-containing medium for the indicated DAG maintained relatively high and stable TOR kinase activity. 4 DAG of 35S::S6K1-HA seedlings were treated with Torin2 (5 μM) for 1 h.\nNote: The roots of the sugar depletion seedlings will stop growing at 3 to 4 DAG.\nAnalyze the primary root growth phenotype, e.g., measure the root length by software image J, observe the root apical meristem length or cell number by using a Leica DIC microscopy or examine the cell proliferation activity by EdU staining.\nComparison of the root length of seedlings grown in sugar-free or sugar-containing medium to evaluate tnitrogen starvation depletion on root growth (Figure 1[href=https://www.wicell.org#fig1]B).\nEdU staining (by Click-iT EdU alexa Fluor 488 HCS kit) to detect the proliferation activity of the root apical meristem cells\nTiming: 4–6 h\nEvaluate the cell proliferation activity in root apical meristem of the sugar depletion seedlings\nTreat the 1 to 4 DAG of WT seedlings grown in sugar-free or sugar-containing medium in a 6-well plate with 1 μM EdU (add 1 μL of 1 mM EdU in each well with 1 mL medium) for 30 min before sample collection.",
    "Note: In this step, 4 DAG glucose depletion seedlings pretreated with DMSO for 1 h before recovery with 15mM glucose (0.27% (w/v)), a concentration that is sufficient to fully substitute for the photosynthetic support of root meristem activation and the acceleration of root growth (Xiong et al., 2013[href=https://www.wicell.org#bib11]), for 2 h act as the positive treatment group. 4 DAG glucose depletion seedlings pretreated with 5 μM Torin2 (TOR kinase specific inhibitor) for 1 h before a 2 h glucose recovery is used as the negative control.\nNote: Since the chemicals need to be absorbed into the seedlings to inhibit TOR kinase activity, we recommend pretreating with the inhibitors for about an hour rather than adding inhibitor and glucose together at the same time so as to avoid the possible leakage activation effect.\nNote: Rapamycin and several secondary generation mTOR specific inhibitors (e.g. AZD-8055, Torin1 and Torin2), have been successfully used for plant TOR signaling studies (Fu et al., 2021[href=https://www.wicell.org#bib5]; Li et al., 2017[href=https://www.wicell.org#bib6]; Liu et al., 2021[href=https://www.wicell.org#bib7]; Montané and Menand, 2019[href=https://www.wicell.org#bib8]; Xiong et al., 2013[href=https://www.wicell.org#bib11]). The optimized treatment time and concentration for a specific inhibitor could be experimentally verified based on the experimental design and purposes (See an example in Extended Data Figure 2[href=https://www.wicell.org#fig2]C, (Fu et al., 2021[href=https://www.wicell.org#bib5])).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1137-Fig2.jpg\nFigure 2. Nitrogen-TOR signaling regulates shoot apexes cell division activity\n(A and B) Inorganic nitrogen (N) depletion inhibited Arabidopsis true leaf development and cell proliferation in leaf primordium, indicated by GUS staining of pCYCB1; 1::GUS seedling. DAG, day after germination. Scale bar: 1 mm (the first and second column of A), 250 μm (the third column in A), 50 μm (B).\n(C) Quantification of true leaf size and GUS staining area in (A) and (B); n ≥20. Data are means ± SD.",
    "(D) Nitrate activation of cell proliferation required TOR, indicated by GUS staining of pCYCB1; 1::GUS seedlings. Scale bar: 50 μm. pCYCB1; 1::GUS seedlings were grown in inorganic nitrogen-free medium for 9 DAG, then treated with 1 mM nitrate (0.01% (w/v)) for 6 h with or without Torin2 (pretreat for 1 h before nitrate recovery, 5 μM).\n(E) Quantification of GUS staining area in (D); n ≥15. Data are means ± SD; ∗p < 0.05 (two-sided Student’s t test).\n(F) TOR activity in shoot apices gradually decreased in response to inorganic nitrogen depletion (- N) and the decreased TOR activity could be quickly recovered by resupplying 1 mM nitrate (0.01% (w/v)) for 30 min in 9 DAG inorganic nitrogen depletion seedlings. 35S::S6K1-HA seedlings were germinated in inorganic nitrogen-free medium and were treated as indicated.\n(G) Seedlings grown in inorganic nitrogen-containing medium (+ N) for 4–12 DAG maintained relatively high and stable TOR kinase activity. 9 DAG of 35S::S6K1-HA seedlings were treated with 5 μM Torin2 for 1 h.\nFigure reprinted with permission from Liu et al. (2021)[href=https://www.wicell.org#bib7].\nCollect the seedlings into 1.5 mL Eppendorf tubes.\nFix the seedlings with fixer buffer (4% (v/v) formaldehyde solution in 1× PBS (pH 7.4) buffer with 0.1% (v/v) Triton X-100) for 30 min.\nDiscard the fixer and wash the seedlings with 1× PBS buffer 3 times, 10 min each time.\nPause point: This assay can be stopped after performing step 12. The fixed seedlings can be stored at 4°C in 1× PBS buffer for 7 days.\nIncubate in EdU detection cocktail for 30 min in the dark.\nDiscard the EdU detection cocktail and wash with PBS buffer three times, 10 min each time.",
    "Observe the root meristem cells and capture photos with a Leica DM6B fluorescence microscope under the channel with an L5 filter (excitation: around 488 nm). The settings of microscope and imaging are: 1) argon laser intensity (turn to maximum), 2) light mode: fluorescence intensity manager (FIM), 3) FIM intensity: 10%, IL-Fld: turn to full, 4) exposure time: 2.98 s, gain value: 3 (Figures 1[href=https://www.wicell.org#fig1]C and 1E). Troubleshooting 2[href=https://www.wicell.org#sec7.3]\nNote: EdU staining is a stable chemical labeling method. It is not necessary to observe the EdU signal right after the last washing step. But we recommend finishing the observation within 12 h.\nAnalyze the root meristem cell proliferation activity by measuring the fluorescent intensity and counting the number of EdU staining dots to evaluate tnitrogen starvation depletion on root meristem activity (Figures 1[href=https://www.wicell.org#fig1]D and 1F).\nNote: More detail information for the EdU staining assay please refer to https://www.thermofisher.cn/order/catalog/product/C10350#/C10350[href=https://www.thermofisher.cn/order/catalog/product/C10350].\nNote: Besides EdU staining, other optional methods could also be used to monitor the cell proliferation activity in the root apical meristem, such as using the cell cycle reporter lines pCYCB1; 1::GUS (Li et al., 2017[href=https://www.wicell.org#bib6]), or PlaCCI (Plant Cell Cycle Indica tor) (Desvoyes et al., 2020[href=https://www.wicell.org#bib3]).\nNote: In addition to the root apical meristem, the cell proliferation activity in the shoot apex is also decreased to a very low level in 4 DAG glucose depletion seedlings (Li et al., 2017[href=https://www.wicell.org#bib6]).\nLiquid culture system for Nitrogen-TOR signaling study\nPreparation mitotic quiescent shoots by inorganic nitrogen depletion\nTiming: 10 days\nPrepare inorganic nitrogen depletion seedlings with mitotic quiescent shoots.\nAdd 1 mL of 1/4 MS nitrogen-free or nitrogen-containing liquid medium in each well of 6-well plates.",
    "Note: 6-well plate is highly recommended for this assay. To fit the experiments that need less or more plant materials, 12-well or 9 cm round plates could also be used. But the volume of media per well should to be scaled up or down based on the size of the wells.\nPlant 10 surface-sterilized WT or pCYCB1; 1::GUS Arabidopsis seeds in each well.\nNote: The number of seeds for each well should be identical for each biological experiment and not exceed 15 seeds.\nGrow the plants in an environment-controlled growth room or chamber at 22°C, 65% humidity, and 75 μmol m –2 s –1 light intensity under a 12 h light/12 h dark photoperiod for up to 10 DAG. Troubleshooting 3[href=https://www.wicell.org#sec7.5]\nShake the 6-well plates gently once by hand every day to help the uniform distribution of nutrients in the liquid medium.\nRefresh the growth medium every 4 days during the incubation progress and refresh the medium before recovery or treatment assays.\nNote: The main purpose of refreshing the growth medium every 4 days is to ensure that glucose and other nutrients are not exhausted during this incubation process. Refreshing the medium before treatment is to make sure the final volume of growth medium in each well is exactly one milliliter, and all macro- and micro-nutrients excepts for nitrogen are the same among different experimental samples .\nPhenotype observation and analysis of nitrogen depletion seedlings\nTiming: 10 days\nAnalysis of shoot growth phenotype in the inorganic nitrogen depletion seedlings\nObserve the shoot phenotype every day and capture the photos of the seedlings growing in nitrogen-free or nitrogen-containing medium at 4 to 10 DAG under a Leica stereoscope microscope (Figure 2[href=https://www.wicell.org#fig2]A). Measure the first true leaf length by software image J.",
    "Note: The true leaf of seedlings grown in nitrogen-free medium will cease growing at 8 to 10 DAG.\nAnalyze the first true leaf length of seedlings to evaluate the effect of nitrogen depletion on shoot growth (Figure 2[href=https://www.wicell.org#fig2]C).\nGUS staining to detect the cell proliferation activity in the leaf primordium\nTiming: 2 days\nEvaluate the proliferation activity in the leaf primordium by detecting the pCYCB1; 1::GUS expression level in shoot apexes of the inorganic nitrogen depletion seedlings.\nDip the 4–10 DAG of pCYCB1; 1::GUS seedlings grown in nitrogen-free or nitrogen-containing medium in 3 mL GUS staining solution, and incubate at 37°C for 12 h in the dark.\nNote: In this step, 9 DAG nitrogen depletion seedlings are pretreated with DMSO for 1 h before recovery with 1 mM KNO3 (0.01% (w/v)) for 6 h. This is the set up for the positive control. 9 DAG nitrogen depletion seedlings pretreated with DMSO for 1 h before recovery with 1 mM KCl (0.0075% (w/v)), or pretreated with 5 μM Torin2 for 1 h before recovery with 1 mM KNO3 (0.01% (w/v)), respectively, are used as the negative controls.\nNote: For the quantification of GUS staining intensity, GUS staining time is important in this step. A shorter time may cause insufficient staining, longer time may lead to unspecific staining.\nDe-stain the seedlings with 75% (v/v) ethanol at room temperature (23°C–25°C), add 3 mL of 75% (v/v) ethanol in each well of 6-well plate and replace the ethanol every hour until the leaves of seedlings turn transparent and white.\nObserve the GUS staining in the shoot apexes and capture the photos using a Leica microscope (Figures 2[href=https://www.wicell.org#fig2]B and 2D). Troubleshooting 4[href=https://www.wicell.org#sec7.7]\nNote: The cell division activity in leaf primordium is continually decreased from 4 to 10 DAG.",
    "Note: In the sugar depletion system described above, both the root apical meristem activity and shoot apex cell division activity are decreased to a very low level after 4 DAG. However, for the inorganic nitrogen depletion system, only the shoot apex cell division activity is decreased to a very low level after 9 DAG. The root apical meristem cell division activity still remains at a relatively higher level, which might be caused by nitrogen nutrient remobilization between the shoot and root parts ( For details, see Figures 1[href=https://www.wicell.org#fig1]A–1D, (Liu et al., 2021[href=https://www.wicell.org#bib7])).\nAnalyze the GUS staining area in shoot apexes by software image J to evaluate the effect of nitrogen depletion on cell proliferation activity in the shoot apex (Figures 2[href=https://www.wicell.org#fig2]C and 2E).\nProtein blots analyses of TOR activity based on P-T449 level of S6K1\nTiming: 1–2 days\nTo investigate tnitrogen starvation /nitrogen starvation on endogenous TOR kinase activity, we monitored TOR kinase activity based on the phosphorylation of T449 in the TOR-conserved substrate ribosomal S6 kinase 1 (S6K1, (Xiong and Sheen, 2012[href=https://www.wicell.org#bib12]); Figures 1[href=https://www.wicell.org#fig1]G, 1H, 2[href=https://www.wicell.org#fig2]F, and 2G).\nPrepare sugar/ nitrogen depletion and sugar/ nitrogen recovery samples of 35S::S6K1-HA as described above.\nNote: 10 mg of plant powder is enough for 3 rounds of protein blots analyses. The collected samples can be stored at −80°C for up to 30 days.\nNote: The 35S::S6K1-HA transgenic line (in Col-0 background) shows no obvious phenotype compared with Col-0, and has been used to monitor the in vivo TOR kinase activity in multiple studies (Cai et al., 2017[href=https://www.wicell.org#bib1]; Fu et al., 2021[href=https://www.wicell.org#bib5]; Li et al., 2017[href=https://www.wicell.org#bib6]; Liu et al., 2021[href=https://www.wicell.org#bib7]; O'Leary et al., 2020[href=https://www.wicell.org#bib9]; Xiong et al., 2013[href=https://www.wicell.org#bib11]; Xiong and Sheen, 2012[href=https://www.wicell.org#bib12]; Zhang et al., 2019[href=https://www.wicell.org#bib14]).",
    "Note: In this step, positive controls, e.g. sugar/nitrogen recovery samples, and negative controls, e.g. 5 μM Torin2 (TOR kinase specific inhibitor) treatment samples are strongly recommended.\nNote: In addition to S6K1-pT449, as an alternative method, RPS6-pS240, a direct phosphorylation site of S6K1, was also used to monitor the endogenous TOR kinase activity in recent years (Dobrenel et al., 2016[href=https://www.wicell.org#bib4]).\nGrind the samples into fine powder with a mortar and pestle in liquid nitrogen.\nAdd 60 μL of 2× SDS protein extraction buffer in 10 mg plant powder and vortex for 15 s.\nBoil the protein extracts at 95°C for 5 min.\nSpin at 13523 X g for 2 min at 4°C.\nTake 20 μL of the supernatants and load onto an 8% SDS-PAGE gel. Run with constant voltage at 80 V for 15 min, then turn to constant voltage at 150 V for 40 min. The SDS-PAGE gel running is performed at room temperature (23°C–25°C). Transfer proteins to a PVDF membrane using standard western blot procedures.\nBlock the membrane with 5% (w/v) nonfat milk dissolving in TBST buffer for 1 h at 25°C with shaking.\nWash the membrane with TBST buffer 3 times with agitation (10 min each time), and incubate the membrane with the primary antibodies (S6K1 phosphorylation antibody P-T449, 1:2000 in 5% (w/v) BSA in TBST buffer; conjugated-HRP HA antibody, 1: 5000 in 5% (w/v) milk in TBST buffer; Tubulin antibody, 1:5000 in 5% (w/v) milk in TBST buffer) at 4°C for 12 h (overnight) with agitation.\nWash the membrane with TBST buffer 3 times with agitation (10 min each time), and incubate with the secondary antibodies in 5% (w/v) milk in TBST buffer (for S6K1-P-T449, with goat anti-rabbit antibody, 1:5000; for Tubulin, with rabbit anti-mouse antibody) for 1 h at 25°C with shaking.",
    "Note: The antibodies used in step 35 and 36 can be reused 10 to 15 times. The anti-HA antibody we used in step 35 is a conjugated-HRP anti-HA antibody. So it does not need to incubate with the secondary antibody before incubation with chemiluminescent subatrate.\nWash the membrane with TBST buffer 3 times with agitation (10 min each time), and incubate the blot with 2 mL SuperSignal West Pico PLUS chemiluminescent substrate for 5 min in the dark.\nExpose to film for 30 s to 1 min and develop the film in an ECOMAX X-Ray film processor with developing solution and fixing solution in the dark room. Troubleshooting 5[href=https://www.wicell.org#sec7.9]"
  ],
  "subjectAreas": [
    "Plant Sciences",
    "Cell Biology",
    "Signal Transduction",
    "Developmental Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology",
    "Molecular Biology & Genetics"
  ]
}