{
  "id": 9925,
  "origin_website": "Jove",
  "title": "Biomass Conversion to Produce Hydrocarbon Liquid Fuel Via Hot-vapor Filtered Fast Pyrolysis and Catalytic Hydrotreating",
  "procedures": [
    "1. Fast Pyrolysis with Hot Vapor Filtration\nBiomass feedstock preparation\nMill the biomass to a particle size of <2 mm. Store in a cool, dry place.\nAssemble pyrolysis system\nAssemble pyrolysis reactor.\nMount reactor inside furnace. Connect fluidizing nitrogen, auger nitrogen, and air lines to reactor. Insert auger into jacketed auger port. Connect cooling air to jacket.\nMount and connect auger motor.\nMount solid feeder 30 to 60 cm directly above the vertical opening of the auger port.\nMount lock hopper between the solid feeder outlet and the vertical opening of the auger port. Connect to the auger port with nylon-braid, reinforced vinyl tubing with an inner diameter of 25 mm. Secure the tubing to the auger port with a hose clamp. Connect to feeder with a light-weight, clear, loose plastic slip-fit.\nAssemble cyclone and hot filter.\nMount cyclone and connect cyclone inlet to reactor outlet. Close-couple receiver to cyclone.\nMount hot filter (made of stainless steel with a pore size of 2 μm) in the filter housing. Connect cyclone outlet to hot-filter inlet. Connect nitrogen purge and pressure relief to cyclone outlet.\nUse heat tape and insulating blankets to heat the trace from the cyclone inlet to the condenser inlet.\nAssemble condenser system.\n\t\tNOTE: Mount the pieces of the condenser system in a fume hood using laboratory-jacks, ring-stands, and laboratory clamps.",
    "For the first condenser, couple 15 to 30 cm of 1.2-cm (outer diameter) stainless steel tubing to borosilicate tubing with a standard taper joint. Connect the first condenser to a 500-ml, two-necked (standard taper), round-bottomed flask (receiver) placed in a container that will serve as an ice bath. Make connections between vessels downstream of this point with 9- to 12-mm clear vinyl tubing secured with hose clamps on ground glass joints, spherical joints, and hose barbs on the glassware.\nConnect the outlet of the first condenser flask to the lower side port (inlet) of the electrostatic precipitator (ESP).\nConnect the upper side port (outlet) of the ESP to the small upper connection of the dry-ice trap (cold-finger condenser).\nConnect a U-tube to line between the ESP and the dry-ice trap. Fill the U-tube half full with water.\nConnect the dry-ice trap to a 500-ml, two-necked, round-bottomed flask (receiver) placed in a container that will serve as a dry-ice bath.\nConnect the outlet of the 500-ml flask to the inlet (center port) of the housing of the coalescing filter.\nPlace a container for holding dry ice around the bottom of the filter housing.\nConnect the filter outlet to the dry-test meter and other gas analysis instruments (e.g., non-dispersive infra-red analyzers for CO, CO2, and CH4, thermal conductivity detector for hydrogen, and micro-gas chromatography (micro-GC) for CO, CO2, nitrogen, hydrogen, and C1-C4 hydrocarbons) and then to vent.\n\t\t\tNOTE: Schematic of the pyrolysis reactor system is shown in Figure 1. Pictures of the biomass feeder, pyrolyzer, cyclone, hot-vapor filter, and the condensers of the pyrolysis reactor system are shown in Figures S1 to S5 in the supplemental file.\nLoad pyrolysis reactor\nPour 200 ml of sand (330 g) into the reactor.\nPour 2 kg of ground biomass into the feed hopper.",
    "Leak check pyrolysis system\nCap off system at the condenser inlet.\nPressurize to 0.05 MPa or expected maximum operating pressure, whichever is higher. Ensure that the flow required to maintain the pressure is <200 ml/min. If not, locate and fix leak, and repeat this step.\nRelieve pressure, uncap system, connect condensation system, cap at exit end of condensation system.\nPressurize to 0.01 MPa. Ensure that a flow of <200 ml/min maintains the pressure. If not, locate and fix the leak, and repeat this step.\nDepressurize and reconnect the condensation system to instruments.\nHeat up reactor\nTurn on cooling air, set fluidizing nitrogen flow to 3 standard L/min and auger nitrogen flow to 1 standard L/min.\nSet furnace target temperature to 500 °C and other heaters to 400 to 500 °C.\nRamp temperature up to target temperatures at a rate of 1 to 10 °C/min.\nPrepare to operate\nIncrease fluidizing nitrogen flow rate to 14 standard L/min, auger nitrogen flow rate to 1.4 standard L/min, and introduce purge gas at a flow rate of 0.5 standard L/min. Most of the purge goes into the rupture-disk port on the cyclone outlet.\nFill bath under first condenser with ice. Fill dry-ice trap, container under its receiver, and container around coalescing filter with dry ice.\nMonitor temperature inside of coalescing filter with thermocouple placed on the surface of the filter and adjust dry-ice level so it is 0 °C.\nPerform pyrolysis experiment\nTurn on lock-hopper valves (use 4 second cycle) and auger.\nTurn on ESP. Set voltage to 5 to 10 kV as needed to observe an arc at least once every 2 sec.",
    "Use micro-GC to verify that no oxygen is present. Verify that turning on the auger and lock hopper did not cause a decrease in output gas flow rate, which would indicate the presence of a leak.\nTurn on feeder at 100 g/hr. Observe the bed temperature and increase the set point as needed to compensate for increased heat load.\nWhen temperature has recovered to within 2 °C of 500 °C, increase feed rate by 100 g/hr. Repeat this until a feed rate of 420 g/hr is reached.\nEvery 15 min, record bed temperature, feed rate on feeder controller, gas concentrations by micro-GC, dry test meter rate, and system pressures by pressure gauges. Verify that ESP is still arcing correctly. Respond to changes in any of these as needed. Refill ice and dry ice. Drain the ESP into a product collection jar as needed.\nShutdown\nAfter feeding 1 kg of biomass, stop feeding.\nAfter gas levels have decayed to less than 10% of steady-state values, turn off all heaters, turn down fluidizing flow to 3 standard L/min and auger flow to 1 standard L/min. Turn off ESP, lockhopper valves, and auger.\nAllow system to cool (4 to 6 hr) before opening the hot sections.\nCollect liquid products and char.\nWeigh all parts of the condenser system to obtain total liquid yield. Pour liquids from the condenser receivers into a common jar or bottle. Alternatively, use acetone to clean the glassware.\nEmpty char receiver into a jar. Remove hot filter, empty the housing, and brush off the filter into the char jar. Weigh the filter. Remove and weigh the bed material. Use a HEPA vacuum with a knock-out vessel for this service.\nOxidize the system.",
    "Seal the reactor, cyclone receiver, and cleaned hot filter. Check for leaks as described above in Section 1.4.\nInstall a metal line from the condenser inlet to the outlet of the coalescing filter to bypass the condensation system.\nHeat the reactor to 550 °C with 3 standard L/min nitrogen as the fluidizing gas and 1 standard L/min auger nitrogen flow.\nAdd air to the fluidizing gas. Start at 0.2 standard L/min and gradually increase to 4 L/min. Continue until CO + CO2 concentrations are less than 0.1%.\nCalculate yields.\nCalculate liquid yield as the total change in mass of the condensation system.\nCalculate char yield as the sum of the weight change in the bed, the weight change of the hot filter, and the char collected from the cyclone receiver and hot-filter housing.\n\t\tNOTE: Additional char could be estimated from the oxidation of the system, but this is usually unimportant.\nCalculate gas yield as the total weight of gaseous products from the gas concentrations measured on the GC and the flow rate of the dry test meter.\n2. Catalytic Hydrotreating of Bio-oil\nNote: The bio-oil samples produced at NREL were shipped to PNNL for catalytic hydrotreating on a hydrotreater system.\nHydrotreater system\nEnsure that the hydrotreater system is in operational condition by checking each component.\n\t\tNOTE: The hydrotreater reactor system used is configured as a single-pass, co-current, continuous, down-flow catalytic reactor. The system consists of three major components: 1) a gas and liquid feeding component, 2) a heated reactor, and 3) a gas−liquid product separation component (Figure 2). The system is designed to operate at up to 13.6 MPa (2,000 psig; maximum operating pressure) with a maximum catalyst temperature 500 °C (only the reactor is rated at this temperature).",
    "Ensure that the hydrotreater monitoring and controlling system and the safety control system are in operational condition.\n\t\tNOTE: The system is monitored and partially controlled by an in-house built computer program with various sensors. Sensors include thermocouples and pressure transducers for the reactor as well as hydrogen and ventilation sensors in the enclosure where the reactor is located. Data are recorded by the program to monitor the reactor. The outlet gas flow rate is measured by a flow meter, and data are recorded by its accompanying software. The program also controls the power supply of major equipment of the reactor. During an experiment, if the reactor undergoes an unwanted change in operating conditions in terms of specific pressure changes and/or temperature changes, or a combustible gas is present above the safety limit, and/or if the ventilation system fails, the program could automatically shut down the system to ensure safety. Pressure relief valves and a rupture disc also are installed in the hydrotreater system to protect against over-pressurization.\nCatalyst loading and pretreatment\nCatalyst preparation\nCrush both catalysts, Ru/C, as the stage-I catalyst and CoMo/Al2O3 as the stage-II catalyst, and sieve to retain 0.25 to 0.60 mm (30 to 60 mesh) grains.\n\t\t\tNOTE: Ru/C catalyst was prepared in-house and CoMo/Al2O3 catalyst was a commercial product.\nCatalyst loading into the reactor\nUse stainless steel tubes and screens as the support media for the catalyst beds. Slowly pour the stage-II catalyst grains, the stage-I catalyst grains, and the original stage-I catalyst extrudates, which were used as distributor, into the reactor sequentially while \"tapping\" on the outside of the reactor to form packed catalyst beds. Load 32 ml of each catalyst to form a two-stage catalyst bed with 24 ml of each catalyst located in the isothermal zone (Figure 3).",
    "Install the reactor to the hydrotreater system\nPlace the reactor into the hydrotreater system by installing the two heaters and then connecting the reactor to the gas and liquid feed component and the gas−liquid separation component.\n\t\t\tNOTE: Two heat tape-heated aluminum sheaths enclose the tubular reactor to provide heat. Each heated sheath is used independently to heat the portion of reactor during catalyst pretreatment and during hydrotreatment testing. Each aluminum sheath is wrapped with a high temperature heat tape and insulation and heated using a temperature controller. The tubular fixed-bed catalytic reactor is made of 316 stainless steel and with an inner diameter of 13 mm and a length of 64 cm. A thermocouple well (4.7 mm outside diameter) is located in the center of the reactor, and two thermocouples are placed in the well to measure the temperature of the catalyst beds.\nCheck the pressure of the hydrotreater system for leaks using 12.0 MPa nitrogen gas by keeping the system at the pressure and ensuring that the drop of pressure is lower than 1 psig per hour.\nCatalyst pretreatment. Sulfide the catalysts in situ in hydrogen and sulfiding agent flow.\nHeat both catalyst beds from room temperature to 150 °C at a rate of 120 °C/hr in hydrogen at 242 ml/min.\nMaintain both catalyst-bed temperatures at 150 °C for 2 hr in hydrogen at 242 ml/hr and sulfiding agent at 0.128 ml/min (35 wt% di-tert-butyldisulfide in decane fed by a feeding pump).",
    "Heat the stage-I bed from 150 to 250 °C at a rate of 83.3 °C/hr, and maintain at 250 °C for 5.8 hr. During the same period, heat the stage-II bed from 150 to 400 °C at a rate of 83.3 °C/hr, and maintain at 400 °C for 4 hr. During the procedure, keep the pressure of the reactor at 10.3 MPa, the sulfiding agent flow rate at 0.128 ml/min, and the hydrogen flow rate at 242 ml/min.\nStop the sulfiding agent flow and maintain hydrogen flow. Then set the temperature of each catalyst bed to the desired reaction temperature.\n\t\t\tNOTE: The sulfiding agent flow rate is determined by the amount of catalyst used and the sulfiding agent liquid hourly space velocity (LHSV) of 0.12 ml/ml-cat/hr for overall catalysts. The hydrogen flow rate is determined by the sulfiding agent flow rate and the hydrogen-to-sulfiding agent flow ratio at 1,890 ml hydrogen/ml sulfiding agent liquid. The gas and liquid feeding components of the hydrotreater system consist of two high-pressure syringe pumps. One of the two pumps is used to feed the sulfiding agent. The gas and sulfiding agent is introduced to the pre-reactor zone of the reactor where the liquid is mixed before they pass downward through the catalyst bed in the reactor.\nBio-oil hydrotreating\nAdjust the hydrogen flow to 152 ml/min and maintain the system pressure at 10.3 MPa. Set the temperatures of the stage-I catalyst bed and the stage-II catalyst bed to 220 and 400 °C, respectively.\n\t\tNOTE: The hydrogen flow rate is determined by the amount of catalyst used, the bio-oil LHSV of 0.20 ml/ml-cat/hr for each stage, and the hydrogen-to-bio-oil ratio of 1,900 ml hydrogen/ml bio-oil.\nRecord the bed temperature and hydrogen flow baselines when the temperature, pressure, and hydrogen flow become stable.",
    "Add di-tert-butyl disulfide to bio-oil feed at an amount equal to 150 ppm sulfur in bio-oil. Fill the bio-oil feed in one of the feeding pumps and purge the feeding line until a liquid flow that is free of air bubbles is achieved.\nPressurize the pump to 10.3 MPa, and then connect to the reactor by opening the connecting valves. Start feeding the bio-oil at a flow rate of 4.8 ml/hr. This action starts the bio-oil hydrotreating test.\n\t\tNOTE: Bio-oil flowrate is determined by the amount of catalyst used and the bio-oil LHSV of 0.20 ml/ml-cat/hr for each stage. The hydrogen gas and bio-oil are introduced to the pre-reactor zone of the reactor where the gas and liquid are mixed before they pass downward in an assumed trickle flow through the catalyst bed in the reactor.\nCheck the status of the reactor and record the parameters, such as temperature, pressure, flow rate, and volume, periodically. Ensure the catalyst-bed temperatures are within ±2 °C of the desired temperature, the gas and liquid flow rates are exactly the same as the desired settings, and reactor pressure is within ±0.15 MPa of the desired pressure. Ensure the pressure drop across the catalyst bed is <0.35 MPa.\n\t\tNOTE: The system is monitored and partially controlled by an in-house built computer program with various sensors. Sensors include thermocouples and pressure transducers for the reactor as well as hydrogen and ventilation sensors in the enclosure where the reactor is located.\nAnalyze outlet gas samples every 2 hr by directing the off-gas through an on-line micro-GC.\n\t\tNOTE: The micro-GC is an a four-channel micro-GC and calibrated using a calibration gas before each hydrotreating test.",
    "Collect liquid samples every 6 hours using the following procedure: switch the sampling trap to the bypass trap, reduce the pressure of the sampling trap, drain the liquid sample to collecting vials, purge the sampling trap with nitrogen, pressurize the sampling trap with nitrogen, and redirect product flow to the sampling trap. Operate a series of two- and three-way valves that divert the gases and products in the desired directions.\n\t\tNOTE: Once the reactants pass through the catalyst beds, the liquid products and unreacted liquids are separated from the gaseous products and unreacted gases in the gas-liquid separation system. The hot gases pass through one of two pressurized, chilled, liquid/gas cold traps (sample trap or bypass trap) placed in parallel downstream of the reactor system. The off-gas then passes through the back-pressure regulator where the pressure is reduced to atmospheric pressure. The off-gas is then passed through a gas meter to measure the flowrate.\nConduct the test for 60 hr on stream (time on stream [TOS]). Terminate the test by stopping the bio-oil feed. Set the reactor temperature to 100 °C and hydrogen flow rate to 100 ml/min.\n\t\tNOTE: The test could be operated for TOSs ranging from fifty to several hundred hours.\nPost-test procedure\nUse acetone to clean the feeding pump for feeding bio-oil. Load the cleaned feeding pump with acetone.\nPurge the catalyst bed with ∼400 ml acetone at an acetone flow rate of 10 to 40 ml/min and a hydrogen flow rate of 100 ml/min when the catalyst-bed temperatures are at 100 °C.\nShut off the heaters of the reactor, depressurize the system to ambient pressure, and purge the reactor with nitrogen for at least 24 hr.\nRemove the reactor from the system and remove the spent catalysts from the reactor.\nProduct processing and result analysis",
    "For liquid product processing, separate the two phases and weigh individually. The liquid products are normally in two phases, a light oil phase (oil product) and a heavy aqueous phase (aqueous product).\nConduct the following analyses of the oil product: density measurement; Karl Fischer titration for water content; elemental analysis (D5291/D5373, D5373mod, and D1552/D4239) for carbon, hydrogen, nitrogen, oxygen, and sulfur; semi-micro color indicator titration (D3339) for total acid number; inductively coupled plasma-optical emission spectroscopy for inorganic content; and simulated distillation (ASTM D2887) to assess the relative amounts of fuel products in the gasoline, diesel, jet fuel, and residual ranges. Conduct the following analyses of the aqueous products: Karl Fischer titration for water content and elemental analysis (D5291/D5373) for carbon, hydrogen, and nitrogen content15.\nCalculate the yields of produced oil product, aqueous product, and gaseous product; the hydrogen consumption; and the mass balance based on the inlet reactant flow rate and density, inlet hydrogen flowrate, outlet oil product weight, water content of the outlet oil product, outlet aqueous product weight, outlet gas flow rate, and outlet gas composition.\nAnalyze spent catalysts by inductively coupled plasma-optical emission spectroscopy15."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}