{
  "id": 3907,
  "origin_website": "Cell",
  "title": "Protocol for deciphering the electrical parameters of perovskite solar cells using immittance spectroscopy",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDevice fabrication\nTiming: (12–15 h)\nThe fabrication of planar perovskite solar cells device with the device architecture ITO/HTL/perovskites/ETL/Ag is depicted in Figure 1[href=https://www.wicell.org#fig1].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/630-Fig1.jpg\nFigure 1. Schematics of the deposition of HTL, synthesis of perovskites layer over HTL, and spin-casting the ETL and buffer layer on top of perovskites layer during the fabrication process of inverted perovskite solar cells\nSubstrate cleaning\nTiming: 2–3 h\nMark the back of ITO substrates (1.5 cm∗2 cm, as shown in Figure 2[href=https://www.wicell.org#fig2]A) at the corner (10 Ω per sq., Xop Glass, Spain) for identification, and put in the holder for further cleaning (Figure 2[href=https://www.wicell.org#fig2]B)\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/630-Fig2.jpg\nFigure 2. Perovskites solar cells fabrication and properties\n(A) Photographs of the ITO substrate, (B) polytetrafluoroethene(PTFE) holder for cleaning substrates, (C) perovskite films after heating treatment, (D) perovskite solar cell (marked part should be removed by cotton bar with DMF), (E) substrate holder with metal grid mask, (F) the absorbance of perovskite film, (G) top-view scanning electron microscope image of perovskite film, and (H) typical J-V curves of perovskite solar cells .\nUltrasonicate the substrates in 2% Hellmanex solution (by diluting in deionized water) for 20 min at 30°C.\nWash the substrates with deionized water.\nUltrasonicate the substrates in acetone for 20 min at 30°C and process can be repeated If necessary.\nCritical: Acetone with a low boiling point and ultrasonication machine working for a long time will cause the temperature of water to rise rapidly. It is recommended to change the water or add ice regularly.\nUltrasonicate the substrates in ethanol for 20 min at 30°C and repeat the process, if necessary.\nUltrasonicate the substrates in isopropanol for 20 min at 30°C and repeat the process, if necessary.\nDry the substrate rapidly with the help of dry air gun.",
    "Preparation of hole transporting layers (HTL)-Day 1\nTiming: 2–3 h\nPreparation of PEDOT:PSS film\nTreat the cleaned ITO substrates with UV-Ozone for 30 min.\nStir PEDOT:PSS for around 30 min and filter with a 0.22 μm nylon filter before use.\nNote: We did not find the correlation between stirring time and quality of PEDOT:PSS films, but the stirring time should be at least 15 min to make sure that the aggregates disperse homogeneously without precipitation.\nPlace 50 μL PEDOT:PSS solution on the center of the ITO substrate and wait for ~ 3 s to spread the solution all-over the substrate and spin-coat it at 5,000 rpm for 30 s with acceleration (2,500 rpm/s).\nCritical: UV-Ozone treatment will heat the substrate and raise the temperature. It is recommended to allow the substrates to cool down before the spin-casting of PEDOT:PSS precursor solution on it. If the substrate with PEDOT:PSS shows dots or radial stripes, it’s advisable to check if the substrate is clean or not, and filter the PEDO:PSS precursor solution again. In case of unsatisfactory results, please use new cleaned substrates.\nTransfer the deposited PEDOT:PSS films to a hot-plate for annealing at 150°C for 15 min. For further use transfer the PEDOT:PSS films into the glovebox immediately. Preparation of PTAA film\nPrepare the PTAA solution with a concentration of 5 × 10−3 g/mL in toluene and stir at 22°C−25°C for 2 h in glove box.\nCast 50 μL PTAA solution in the center of the ITO substrate and spin-coat at 5,000 rpm for 30 s with acceleration (2,500 rpm/s) and the PTAA film was left to anneal at 100°C for 5 min.",
    "Critical: The ambient temperature and humidity can change, which may affect the solvent volatilization and thickness of PTAA film. We recommend preparing PTAA films in dry air glovebox at a constant low temperature (around 20°C).\nFabrication of Perovskite active layer and electron selective contacts-Day 1\nTiming: 2 – 3 h\nDissolve 1 M PbI2 (600 mg/mL) in 1 mL dimethyl formamide (DMF) at 70°C and stir it at 400 rpm/s for 12 h. The mixed organic cation solution of MAI: MACl (50: 5 mg/mL) was dissolve in 1 mL IPA at 22°C−25°C and stir at 400 rpm/s for 12 h. Prepare PC61BM solution with a concentration of 10 mg/mL in chloroform and stir at room temperature for 2 h. Prepare BCP solution with a concentration of 0.5 mg/mL in IPA and stir it at room temperature for 24 h.\nFilter the PbI2 solution by a 0.45 μm PTFE filter and keep the solution at 70°C for further use. Before use filter also the mixed organic cation solution by a 0.45 μm PTFE filter.\nCast 30 μL hot PbI2 solution on the center of the ITO/HTL and spin-coat (See Figure 1[href=https://www.wicell.org#fig1]) at 4500 rpm for 20 s with acceleration (9,000 rpm/s), then 50 μL of the mixed organic cation solution was dynamically cast on the wet PbI2 film without stopping and continue the spin-coating at 4500 rpm for 30 s. The as-prepare film is annealed at 100°C for 5 min and the post anneal film is shown in Figure 2[href=https://www.wicell.org#fig2]C, record the absorbance and morphology of perovskite film as shown in Figures 2[href=https://www.wicell.org#fig2]F and 2G, respectively.",
    "Critical: To obtain uniform perovskite films, wettability of PTAA is essential, for this pre-wetting by DMF before casting PbI2 solution, dynamics casting of PbI2, or low molecular weight PTAA can overcome such issue. The prepare perovskite changes color from brown to dark within 2–4 s when the substrate is place on the hot plate, if this process is delay, it can due to the perovskite solvent. The DMF vapors should be clean at regular interval, during the continuous deposition of perovskite films. We recommend removing DMF vapors by purging the glovebox, and prepare less than 20 devices every time.\nCast 60 μL PC61BM solution on perovskite film to spin-coat at 1500 rpm for 30 s with acceleration (750 rpm/s).\nCritical: Chloroform is a low boiling point solvent, it is critical to control the temperature of the glovebox (below 30°C) during the preparation of PC61BM electron transporting layer. The alternative is replacing chloroform with chlorobenzene or more green solvent such as toluene to prepare PC61BM solution. The concentration of PC61BM in chlorobenzene/toluene should be increase to 20 mg/mL, and can be spin-coat on perovskite film at 4000 rpm for 30 s. Further, leave the as-prepare PC61BM film for around 2 h in the glovebox or keep it in vacuum condition for more than 30 min for full solvent volatilization.\nCast 60 μL BCP solution on top of PC61BM film and spin-coat at 4000 rpm for 30 s with acceleration (2,000 rpm/s).\nDeposition of top electrodes Day 1\nTiming: 6–8 h\nThe samples are left to rest for close to 2 h in a glovebox, to allow solvent evaporation, and then transfer in the thermal evaporation chamber to prepare for electrode outside of the glovebox.",
    "To prepare the anode, the perovskite film mark by a red rectangle in Figure 2[href=https://www.wicell.org#fig2]D was remove by scraping with a cotton bar with DMF (5 – 10 μL).\nClean the samples with an air gun to dry the solvent residues and remove unwanted dust particles before placing the samples into the substrate holder for evaporation (Figure 2[href=https://www.wicell.org#fig2]E).\nControl the rotation speed of the substrate holder to 20 rpm/s during the evaporation process.\nWhen the vacuum values reaches 5 × 10−6 mbar, the evaporation of the silver will be made in the following way: the first 5 nm with the speed of 0.1 Å/s and then at 1.0 Å/s up to 100 nm. The silver wire will melt first under the low heating current and start to evaporate with an increase in the current.\nIf the thickness monitor is not working or not installed, thickness of the silver layer can be deduce by the cross-sectional scanning electron microscope or profilometer, or spectroscopic ellipsometer.\nCritical: When removing the perovskites film, the minimum amount of DMF should be used and care needs to be taken not to accidentally remove the whole layer.\nCritical: The vacuum value needs to be less than 10−5 mbar, as the vacuum values can impact the increase in temperature during the evaporation process. The lower the vacuum degree, the higher the super-heating rate.\nCharacterization of devices\nTiming: (10–15 h)\nTesting of device performance-Day 2\nTiming: 30 min – 1 h\nThe current density characteristics of the devices was measure under AM 1.5G (100 mW cm−2) illumination at the ambient condition with (~ 25°C and ~ 40% relative humidity) with the help of AAA grade solar simulator (Newport) as shown in Figure 3[href=https://www.wicell.org#fig3].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/630-Fig3.jpg\nFigure 3. Illustrating the measurement of J-V characteristics of solar cells under illumination",
    "Before starting the J-V measurement, calibrate the light illumination by using standard Silicon (Si) cell. For this, the standard Si solar cell was kept at the center of the simulated xenon light source, at a similar height as of devices.\nThe shadow mask was adhered to the un-encapsulated solar cells to define the active area (0.09 cm2) to reduce the influence of scattered light.\nMeasure J-V curves under reverse scan: from 1.2 V to -0.1 V, scan-rate 100 mV s−1, delay time 100 ms, and pre-sweep delay: 10 s.\nCapacitance vs. frequency measurement-Day 3\nTiming: 8–10 h\nPerform C-f measurements at variable temperatures using Keysight precision LCR meter linked to a Linkam heating / cooling stage filled with liquid nitrogen (shown in Figure 4[href=https://www.wicell.org#fig4]). The temperature was control with the help of software. Firstly, cool down the devices to 150 K, and thereafter start measurements in the heating mode in the temperature range 150 K − 350 K.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/630-Fig4.jpg\nFigure 4. Experimental setup for the measurement of temperature dependence C-f spectra and impedance spectra\nPlace the sample inside the Linkam heating/cooling stage.\nConnect the probes to the top and bottom contact and check the connectivity from a multi-meter.\nFill the liquid nitrogen in DF2 Flask.\nSet the desire temperature and run the temperature controller with a ramp rate of 2°C/min.\nAfter acquiring the desire temperature, wait for a while (3–5 min) to stabilize the temperature of device and then measure the capacitance in the frequency range 100 mHz−2 MHz and repeat the same at different temperatures.\nCritical: If high variation in the measured spectra at different temperatures is observe, check VOC of the device under illumination, and in case of over 5% change in VOC replace the device.\nImpedance measurement -Day 4\nTiming: 2–3 h",
    "Carry out the impedance measurements in the desire frequency range (e.g., High frequency up to 2 MHz, low frequency 1 Hz − 10 mHz) under the perturbation of 10−30 mV ac signal using Biologic SP300 Potentiostat. If the select frequency range is not ideal, only part of spectra will display, as shown in Figures 5[href=https://www.wicell.org#fig5]A and 5B. Illuminate the device with a white LED and illumination intensity can be control by a controller and the range of light intensity for different photovoltage was c.a. 0.1 − 0.5 sun illumination. To minimize the noise and external interferences, we suggest using a faradaic chamber for sample measurements.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/630-Fig5.jpg\nFigure 5. Incomplete impedance spectra\nImpedance spectra showing incomplete measuring range (A) low frequency, (B) high frequency\nMeasuring IS under short circuit condition\nTurn on Biologic SP 300 Potentiostat and wait for 30 min to stabilize the system.\nPlace the sample inside the faradaic cage and connect the device electrodes with Biologic SP 300 Potentiostat.\nOpen EC Lab software and load setting for Potentiostatic Electrochemical Impedance Spectroscopy (PEIS).\nSet Ewe to E = 0 V vs. Ref, Scan frequency from fi = 2 MHz to ff = 0.1 Hz, with Nd = 10 points per decade in Logarithm spacing.\nSet AC perturbation Va = 20 mV, Wait for pw = 0.1 s period before each frequency measurement, average measure per frequency Na = 2 and corrects the drift of the system.\nRecord the impedance spectra in dark.\nTo record the IS under illumination, vary the current of LED and record the illumination intensity via Lux meter, thereafter measure the IS.\nMeasure J-V before and after IS measurement. Measuring IS under open circuit condition\nVary Ewe to E = 0.2 V to 0.8 V and keep other parameters as above.",
    "Record the IS in dark as well as under illumination.\nCritical: Measure J-V before and after IS measurement, if there is a variation of more than ±5% in VOC, replace the device\nCritical: AC perturbation has to be high enough to produce a noise-free signal but small enough to ensure linearity. For more detail please see the troubleshooting[href=https://www.wicell.org#troubleshooting] section and read the work by Pitarch-Tena et al., (2018)[href=https://www.wicell.org#bib7].\nCritical: There are different ways to reduce the noise in low-frequency impedance spectra either by increasing the AC perturbation, or by increase of the integration time, and/or the increase of the number of Integration cycles during the measurement.\nCritical: Vac should be maintained as such that it does not affect the linearity of the signal. As the perovskites are not electrically stable, thus increase of measurement time is not advisable.\nCritical: Give sufficient time interval (2−5 min) between two successive measurements for the stabilization of mobile ions.\nMott-Schottky measurement -Day 4 For this experiment, one should first identify the measuring frequency at which Mott-Schottky plot should be measure. The measuring frequency can be identified from the stable plateau region of the C-f spectra shown in Figure 6[href=https://www.wicell.org#fig6]A. The measurement steps are:\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/630-Fig6.jpg\nFigure 6. Immittance spectra\n(A) Temperature dependence C-f spectra, (B) Mott-Schottky plot, (C) Nyquist plot and (D) bode plot\nLoad setting for “staircase potentioal electrochemical impedance spectroscopy (SPEIS)” technique in EC Lab software.\nMeasure in single “single sine” mode.\nSet the scan voltage from −0.5 V to +1 V with adequate number of points.\nChoose the scan frequency (from C-f spectra).\nSet AC perturbation Va = 20 mV, Wait for pw = 0.1 s period before each frequency measurement, average measure per frequency Na = 2 and corrects the drift of the system.\nRecord Mott-Schottky plot.",
    "Critical: Occasionally, linear region in Mott-Schottky plot (Figure 6[href=https://www.wicell.org#fig6]B) is not visible thus we cannot determine the slope and offset voltage from it. This can occur due to higher ionic capacitance as compare to depletion capacitance. To avoid this, perform the measurement at low temperature where all ionic motion is diminished."
  ],
  "subjectAreas": [
    "Material Sciences",
    "Energy",
    "Molecular/Chemical Probes",
    "Microscopy"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}