{
  "id": 6874,
  "origin_website": "Bio",
  "title": "Assessments of HLA-I Specificities of Anti-HLA-I Monoclonal Antibodies Using Solid Phase Bead Arrays",
  "procedures": [
    "Biotinylation of W6/32Buffer exchange (via dialysis in a centricon filter) of W6/32 into PBS Buffer.Note: W6/32 can be purchased commercially in a purified form or can be purified from ascites fluid or cell supernatant derived with the Hybridoma line (ATCC, HB-95). Immediately before use, add 170 μl of ultrapure water to 2 mg of NHS-PEG4-Biotin to prepare a 20 mM stock solution.Add 13 μl of the NHS-PEG4-Biotin solution to 1 ml purified W6/32 at 2 mg/ml.Incubate the reaction on ice or at 4 °C for two hours.Remove non-reacted NHS-PEG4-Biotin by extensive dialysis (6-10 rounds of dilution to maximal volume followed by concentration to minimum specified volume) with a 15 ml 30 K MWCO centricon filter.Store antibody at 4 °C.Reagent set-upDilute 10x wash buffer to 1x with distilled water.Gently mix Labscreen Single Antigen HLA class-I Combination bead array suspension.Sample preparationNote: Follow procedure as described by OneLambda packet insert. Mix 20 μl of biotinylated anti-Bw4, biotinylated anti-Bw6, or biotinylated W6/32 at multiple dilutions ranging from 1/50 to 1/200 of the stock concentration of purified biotinylated antibodies that were prepared in-house (W6/32; 2 mg/ml) or through a commercial source (anti-Bw4 and anti-Bw6) with 5 μl Labscreen Single Antigen HLA class-I Combination bead array suspension.Incubate for 30 min at room temperature.Add 1 ml of 1x wash buffer, mix gently.Centrifuge tube at 9,300 x g for 2 min.Discard supernatant by aspirating sample.Repeat Steps C3-C5 two more times.Resuspend beads with 1:100 streptavidin-PE directly from the tube (made with 1x wash buffer).Incubate for 30 min at room temperature.Repeat Steps C3-C5 twice.Resuspend beads with 80 μl 1x wash buffer (proceed to Procedure D or store at 4 °C for up to 24 h).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200616/20200616210437_9400.jpgFigure 1. Labscreen Single Antigen Immunoaffinity protocol.",
    "Labscreen Single Antigen HLA class-I Combination bead (each labeled with identifiable fluorescent dye and HLA-I) suspension array is successively incubated with biotinylated antibody, washed, incubated with streptavidin-PE, washed, and finally measured on the Labscreen flow analyzer.Data acquisition on LabScanNote: Follow procedure as described by OneLambda packet insert. Requires an acquisition template, downloadable from OneLambda website https://www.onelambda.com/en/product/labscan.html[href=https://www.onelambda.com/en/product/labscan.html].Create a file name for the samples to be run.Confirm template settings.Sample Volume                                      50 μlSample Time-Out                                   80 sDouble discriminator gate Low Limit      8,000Double discriminator gate High Limit    16,000Number and ID of beads Minimum events collected                    100 events per beadEnter sample IDs.Load plate onto platform.Click start button to initiate.Save data output in a .csv file and export.Open Fusion OL software.Select the appropriate output .csv file.Select the appropriate Catalog ID file.Select the negative control.Click Import, then analyze each sample.Alternative Method: Flow CytometryThe assay can also be performed on a flow cytometer using FlowPRA Single Antigen Beads instead of Labscreen Single Antigen HLA class-I Combination bead array suspensions.Reagent set-upDilute 10x wash buffer to 1x with distilled water.Gently mix FlowPRA Single Antigen Beads.Sample preparation (follow procedure as described by OneLambda packet insert)Mix 20 μl of biotinylated anti-Bw4, biotinylated anti-Bw6, or biotinylated W6/32 at multiple dilutions (undiluted, 1:25, 1:50, and 1:100) with 5 μl FlowPRA Single Antigen Beads for each group and antibody respectively.Note: Fluorescently labeled antibodies can be used in place of biotinylated antibodies. Incubate for 30 min at room temperature.Add 1 ml of 1x wash buffer, mix gently.Centrifuge tube at 9,000 x g for 2 min.Discard supernatant by aspirating sample.Repeat Steps E2c to E2e two more times.Resuspend beads with 1:200 streptavidin-FITC (made with 1x wash buffer).Incubate for 30 min at room temperature.Repeat Steps E2c to E2e twice.",
    "Resuspend beads with 100 μl 1x wash buffer (proceed to Step E3 or store at 4 °C for up to 24 h after fixing samples).Acquire measurements for each group using a flow cytometer with at least two channels, a PE channel and a FITC channel.Note: The method of acquisition depends on the flow cytometer used. Gate on each bead population (known PE channel fluorescence intensity for each HLA-I-bead in the group as described in packet insert).Measure histogram of streptavidin-FITC geometric mean fluorescence intensity."
  ],
  "subjectAreas": [
    "Immunology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}