{
  "id": 19281,
  "origin_website": "Jove",
  "title": "Intra-Operative Behavioral Tasks in Awake Humans Undergoing Deep Brain Stimulation Surgery",
  "procedures": [
    "1.\tSubject Recruitment and Consent\nFollowing clinical evaluation and consent for subthalamic nucleus (STN) deep brain stimulation (DBS) for refractory Parkinson Disease, each patient's information is reviewed in order to determine if he/she meets the criteria for the intra-operative study (Defined in an Institutional Review Board approved protocol at the Massachusetts General Hospital).\nIf it is determined that the subject meets the study criteria, a physician member of the study group (not the operating surgeon) approaches the patient to discuss the possibility of participation in the study.\nThe consent form for participating in the study is then reviewed and explained to the subject.  Importantly, the explanation of the study stresses that participation in the study is voluntary and that at any point he/she has the option to withdraw from participation. Moreover, it is then emphasized that their discussion to participate or to withdraw in the study has no impact on the medical care he/she will receive.\nIf it is determined that the subject understands and agrees to participate in the study, he/she signs the approved informed consent and is enrolled in the study.\n2.\tBehavioral Training and Rig Setup\nAs a part of DBS surgery for Parkinson Disease, subjects are admitted to the hospital one day prior to surgery. Hence, this offers an opportunity to train the subject on the behavioral task.  This training is essential as it provides a time period during which the subject can learn to perform the task and develop comfort with its rules, removing \"learning effects\" confounds (Refer to discussion).\nA portable behavioral rig is brought to the subject's hospital room on the night prior to surgery.\nThis rig is equipped with the exact same behavioral task which the subject is required to perform on the day of the intra-operative study.",
    "In this example, the subject is asked to play a card game similar to the game of \"war\". In this game, the subject is required to bet (either $20 or $5) as to whether his or her card is higher than that of the computer. The intent of this task is to assay the role of reward and risk on neuronal encoding in the STN. In order to incentivize the subject they are told that they will be paid a proportion of their winnings.\nAs a means of reducing the potential combinations (and resulting confounds), only even-numbered cards of a single suit are used (e.g. 2, 4, 6, 8, and 10 of spades). As such, the potential outcomes and expectations of the task can be easily computed and analyzed.\nIn each trial, the subject first sees a screen depicting their randomly dealt card, and the back of the unknown computer's card.  The screen then shows the two wager options, $5 and $20.  Based on the relative strength of his/her card, the subject indicates the wager with a button push, after which the screen shows his/her card and the revealed computer's card.  The final screen explicitly depicts the amount won or lost.\nThe subject is allowed to play the game until they fully understand the rules of the game and perform at a comfortable level.\n3.\tIntra-operative - Experimental Setup\nOnce the subject has been positioned on the surgical table, the rig containing the behavioral, data acquisition and signal processing equipment is brought into the operating room. Rig positioning must take into consideration normal work flow and sterility issues related to the operating room setting.",
    "As components of these rigs are assembled and disassembled for each recording session, it is vital to check all equipment connections.  Therefore, as each component is connected to the data acquisition system, one must check the integrity of the data. These procedures should be done early in the surgery to prevent having to troubleshoot these issues during the critical recording time.\nFirst, boot the acquisition and the signal processing equipment. Connect the outputs of the signal processing rig to the inputs of the acquisition rig.  In the case of this study, we will be acquiring three extra-cellular action potential channels corresponding to three para-sagittally oriented electrodes that will be advanced into the subject's brain during the surgery. Turn on the amplifiers one at a time to ensure that the acquisition system is acquiring the signals.\nSecure the monitor to the OR table in comfortable viewing position using an appropriate adapter.\nIf an input device (joystick, button box, keypad, etc.) is employed, position this device, paying attention to laterality relative to the side of the brain from which recordings will be obtained.  Ensure that the subject's hand is comfortably positioned to operate the input device.  Consider asking the anesthesiologist to secure the pulse oxygenation monitor on the other hand to ensure proper operation of the device.  In this task we use a button box.\nBoot the behavioral system and ensure that behavioral event markers are being captured by the acquisition rig.\nStart the behavioral task and allow the subject to play a few trials of the task. During this time, ensure that the acquisition system is capturing the button box inputs and the behavioral markers generated by the behavioral rig.\nIf all the connections are functional, stop the behavioral task and acquisition rig.\n4.\tIsolation of Subthalamic Nucleus Neurons",
    "The objectives of the surgery are to place chronic DBS leads into the motor region of the STN. This placement is achieved through a combination of stereotactic imaging and neuophysiological recordings.\nDetails of the stereotactic planning and the surgical procedure itself will of course vary across institutions, but the general process is similar.  At our institution, a Cosman-Roberts-Wells stereotactic frame and fiducial cage is applied and a head CT scan obtained.  The CT with fiducials is merged with a previously obtained volumetric brain MRI on a neuro-navigation system (StealthStation, Medtronics, Minneapolis, MN; or BrainLab VectorVision, Feldkirchen, Germany).  The coordinates of the target brain region (STN in this case) are converted to frame-based coordinates.  In the operating room, the patient is positioned comfortably in a semi-reclined position, and prepped and draped using standard surgical technique.  The coordinates of the left STN are programmed into the frame, which is positioned on the patient.  The skin is incised and retracted.  Burr holes are placed, and a small dural opening created.  Cannulae attached to a microdrive are brought into position and advanced until the tip of the cannulae are 25 mm above target.\nOnce the cannulae are advanced into the brain, the internal stylets are removed and replaced with high-impedance (0.3 - 1 mega-Ohm) microelectrodes (FHC, Bowdoin, ME).  The signal processing rig's pre-amplifiers are connected to each electrode and the differential reference channel is connected to the outer cannula.\nOn the signal-processing rig the amplifiers are turned on and the extra-cellular signal is assessed.  In addition, the impedance for each electrode is checked before advancing further into the brain.",
    "The surgeon advances the electrodes slowly ( 0.05-0.4 mm steps) into the brain.   The electrodes are advanced starting 25mm from the calculated target towards the STN.  This trajectory results in the electrode passing through the caudate nucleus, the thalamus, the zona inserta, and finally into the STN.\nOnce the electrodes have entered the STN, the physiologist manipulates the patient's contralateral limbs as a means of establishing whether the neuronal signal is motor responsive.  When the surgeon and experimenter are satisfied with the electrodes' position, the behavioral task can be started.\n5.\tData Acquisition\nBefore starting the behavioral task, it is important to document the depth of the microelectrodes and the motor responsiveness of the isolated neuron(s).\nThe subject is then instructed that the task will begin.  Ensure that the button box is still comfortably positioned and that the monitor completely visible.\nStart the data acquisition and acquire baseline activity for at least 1 minute prior to starting the behavioral task.\nAs the subject performs the task it is important to monitor the captured data. With any disruption in the acquisition, the task should be stopped and the problem rectified.\nIn the current study, the subject is asked to perform 120 trials for each STN depth.\nThe tasks can be performed multiple times for each depth in the STN; however, there are limitations to the duration of these intra-operative studies (described further in the  discussion).  We limit experimental recording time to 30 minutes to prevent patient discomfort and undue prolongation of surgery. Moreover, the subject has the opportunity to reject further recordings at any time, in which case the behavioral task is stopped and surgery resumes.\nOnce the study is completed, the data is backed up and archived for subsequent analysis.\n6.\tData Analysis",
    "First, the neuronal signals are discriminated into individual spike timestamps using commercially available software.\nThe behavioral task codes are then parsed, and the neuronal activity timestamps are aligned using code scripted in Matlab.\nRepresentative Results:\nFigure 1 depicts representative results from a single STN neuron recorded during the War game described above.  The top panels depict rasters centered on four behaviorally relevant epochs in the task: the fixation period prior to each trial, presentation of the subject's card, the button press indicating the subject's wager, and presentation of the computer's card.  The bottom panels represent binned (50 ms bins) peri-stimulus time histograms (PSTHs).  This neuron does not respond robustly to presentation of the subject's card, but increases its firing significantly around the button push.  This activity lasts until the computer's card is revealed, at which point firing decreases to baseline levels.\n imgsrc://cloudfront.jove.com/files/ftp_upload/2156/2156fig1.jpg\nFigure 1. Representative STN neuron. Rasters (top panels) and peri-stimulus time histograms (PSTHs) centered on behaviorally relevant epochs are depicted for a representative single STN neuron. This neuron's firing increases significantly around the time of the button push indicating the subject's wager.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}