{
  "id": 18705,
  "origin_website": "Jove",
  "title": "High Throughput Characterization of Adult Stem Cells Engineered for Delivery of Therapeutic Factors for Neuroprotective Strategies",
  "procedures": [
    "1. Substrate Preparation for 96-well Plates\nCreate a map of the 96-well plate outlining the different substrates and cell-types to be examined (Figure 1).\nObtain the stock solutions of different substrates [poly-L-lysine, fibronectin, collagen type I, laminin, and entactin-collagen IV-laminin (ECL)], a 96-well multiwell plate and prepare a work station in a sterile cell culture hood.\nPrepare individual substrates by diluting stock in sterile phosphate buffered saline (PBS) to a final concentration of 5 µg/ml (this concentration was previously determined based on a substrate concentration-dependent assay for growth and proliferation of cells). Mix using a vortex before pouring into a sterile reservoir.\nAdd 100 µl of substrate solution into each well according to the 96-well map (Figure 1) (a 12- or 8-channel micropipette is convenient for micropipetting into a 96-well plate). Seal the lid to the 96-well plate using a strip of Parafilm and store overnight at 4 °C.\n2. Cell Plating and Time-lapse Imaging\nNOTE: Mouse MSCs were isolated from the bone marrow of adult C57BL/6 mice and maintained as an adherent cell line. MSCs were infected using lentiviral vectors to engineer them to secrete brain-derived neurotrophic factor (BDNF; human cDNA) and glial cell-derived neurotrophic factor (GDNF; human cDNA) using lentiviral vector’s encoding BDNF (LV-BDNF; CMV-BDNF-IRES-GFP), GDNF (LV-GDNF; CMV-GDNF-IRES-GFP), and green fluorescent protein (GFP, LV-GFP; CMV-GFP).\nNOTE: Culture media for mouse mesenchymal stem cells (MSCs) is Iscove's Modified Dulbecco's Medium containing 10% hybridoma-qualified fetal bovine serum, 10% equine serum, 2 mM L-glutamine, and 10,000 U/ml penicillin, 10 mg/ml streptomycin. The five different types of mouse MSCs (MSCs, GFP-MSCs, BDNF-GFP-MSCs, GDNF-GFP-MSCs and BDNF/GDNF-GFP-MSCs) were plated at about 30% confluence in T75 cell culture flasks.\nCell Plating",
    "On the following day, remove the substrate solutions by aspiration and rinse each well with approximately 200 µl of sterile PBS, twice. Add cell culture media (200 µl/well) to each well after the final PBS rinse. Place the 96-well plate into a cell culture incubator set at 37 °C and 5% CO2 for equilibration.\nWhile the 96-well plate is equilibrating in the incubator, harvest the cells (MSCs in T75 flasks should be approximately 70% confluent at time of harvesting/plating) by collecting the growth media (referred to as conditioned media) from the T75 flask and storing in a 15 ml conical tube under sterile conditions (this conditioned media will be used in step 2.1.4 below).\nAdd 8 ml of sterile PBS to the flask and gently swirl and then pipette off the PBS and add 1 ml of 0.05% trypsin and 0.01% EDTA solution to detach the cells from the culture surface of the T75 flask. Monitor cell detachment by viewing the flask using an inverted microscope equipped with phase contrast optics.\nWhen the cells have detached, immediately add 8 ml of the conditioned media (collected in step 2.1.2) to the flask. Collect the cell suspension and transfer to a 15 ml conical centrifuge tube and centrifuge for 4 min at 450 x g to pellet the cells.\nRemove the supernatant and resuspend the cell pellet in 200 µl of fresh and warmed (37 °C) cell culture media.\nDetermine the number of cells in the cell suspension by performing a trypan blue viable cell count using a hemocytometer. Plate the cells at a density of approximately 300 cells/well into the appropriate wells of the 96-well plate.\nRepeat these steps for each population of cells.\nTime-lapse Imaging",
    "Once all of the MSCs have been plated, place the 96-well plate into an incubator for 2 hr to allow the MSCs to attach to the substrate.\nStart the HCS system and wait for 2 hr for the system to equilibrate. Set the environmental controller to 37 °C and connect a mixed gas cylinder containing 5% CO2 in air to the HCS system environmental chamber supplying a constant air source.\nRemove the 96-well plate from the incubator following the 2 hr equilibration period and place directly into the cell growth chamber of the HCS system. Allow 30 min for equilibration to account for any heat-related expansion of the plate and then start the image acquisition and analysis software to configure the plate settings.\nSelect the 20X objective for imaging. Select two wells per condition [i.e., GFP-MSCs on Fibronectin etc. (6 substrates x 5 MSC subtypes for a total of 30 conditions x 2 replicates = 60 wells in total)] for setting up time-lapse imaging. Choose two sites for imaging within each well.\nChoose the correct light wavelengths for imaging.\n\t\tNOTE: Two different wavelengths (Phase contrast and GFP fluorescence) were selected for time-lapse imaging.\nFocus on the well bottom using laser autofocus and take test images for multiple sites and multiple wells to find an optimized focal plane.\nOnce the focus has been established, begin capturing images every 5 min for 48 hr for all 60 wells (120 sites).\nFeed the cells every 24 hr by removing the 96-well plate from the HCS system. Remove 75 µl of media from each well and add 100 µl of fresh media to each well (equilibrate this fresh media at 37 °C and 5% CO2).",
    "At the end of the time-lapse experiment, remove the 96-well plate from the HCS system. Under sterile conditions, collect the conditioned media samples from each well and transfer these samples to another 96-well plate.\n\t\tNOTE: These samples can be used for further analysis by performing ELISA for neurotrophic factors.\nPrepare the 96-well plate with cultured MSCs for additional assays such as Ki67 cell proliferation assay or propidium iodide live/dead staining assay (see details below).\nPerform time-lapse imaging analysis for cell migration/cell tracking as described in section 5 below.\n3. Ki67 Cell Proliferation and Propidium Iodide Live/Dead Assay\nKi67 Cell Proliferation Assay (Immunocytochemistry)\nRinse the cell cultures with 0.1 M phosphate (PO4) buffer for one minute two times. Fix the culture with 4% paraformaldehyde (PFA) for 20 min at room temperature. Remove the PFA and rinse the wells with PBS for seven minutes three times.\nAfter the final rinse, add 100 µl of blocker solution (phosphate buffer saline, 5% normal donkey serum, 0.4% bovine albumin serum, and 0.2% Triton X-100) to each well and incubate at room temperature for 1 hr. Prepare the primary antibody, rabbit anti-Ki67, by diluting in blocker solution at a working ratio of 1:200.\nRemove the blocker solution and apply 100 µl of the primary antibody solution to each well. Cover the 96-well plate and incubate the samples at 4 °C overnight.\nOn the following day, remove the antibody solution and rinse with PBS for 7 min, 3 times.",
    "Prepare the secondary antibody, donkey anti-rabbit Cy3 in blocking solution at a working ratio of 1:500. Add DAPI nuclear stain to the secondary antibody solution at a dilution of 1:100. After the removal of the last PBS rinse, apply 100 µl of the secondary antibody/DAPI solution to each well. Incubate at room temperature in the dark for 90 min.\nRemove the secondary antibody/DAPI solution and rinse each well with PBS for 7 min, 3 times. Cover the 96-well plate and store at 4 °C until imaging.\nPropidium Iodide Live/Dead Assay\nMeasure cell death by propidium iodide (PI) exclusion assay as described below.\nPrepare the propidium iodide stain solution at a concentration of 1.5 µM in culture media.\nAdd 100 µl of 70% ethanol to one well of the MSCs for 2 min with the intention of killing those cells. This well serves as a positive control for the PI stain. The majority of the MSCs will be PI-stained indicating cell death. Remove the ethanol solution.\nAdd 100 µl of propidium iodide stain solution to each well and incubate for 20 min at 37 °C in a 5% CO2 incubator.\nRinse the cells with 0.1 M phosphate buffer for 1 min, 2 times. Fix the cells with 4% PFA in 0.1 M P04 buffer for 20 min at room temperature. Remove the PFA and rinse with PBS three times for 7 min.\nIncubate with DAPI solution (1:50) diluted in blocker solution for 1 hr at room temperature. Rinse all wells with PBS for 7 min, 3 times.\nRemove the DAPI solution and rinse each well with PBS for 7 min, 3 times. Cover the 96-well plate and store at 4 °C until imaging.\n4. Automated Imaging and Multiwavelength Scoring Analysis",
    "Load a 96-well plate (previously processed for Ki67 immunolabeling or propidium iodide-stained) into the HCS system and allow the plate to equilibrate for 20 min Open the HCS system image acquisition and analysis software.\nChoose the acquisition settings for the 10X objective using camera binning at 1 and a gain setting of 2. Find the Z-plane in which the cells reside by utilizing the Auto Exposure function and calculate the offset for each wavelength of interest. For this analysis, capture images for DAPI (W1), Cy3 (W2), and FITC (W3). Choose the maximum intensity level at which the negative control wells show no signal for image acquisition. Confirm this setting is appropriate for the positive wells.\nAcquire plate. Capture images and store them in the image acquisition and analysis software’s database.\nOnce images have been acquired, open image acquisition and analysis offline software and review plate data from the images acquired above.\nSelect the Multi-wavelength scoring analysis. Configure the minimum and maximum intensities for each wavelength.\n\tNOTE: DAPI detection should mark the staining around each visible nucleus. Cy3 should detect the positive cells with Ki67 immunoreactivity (IR) and should not detect IR under the negative controls. For Cy3 Ki67 IR, the approximate minimum width was 7 µm, approximate maximum width was 30 µm, the intensity above the local background was 150 gray levels, and the minimum stained area was 50 µm2.\nRun analysis for all positions. Export the data to view in spreadsheet.\n5. Cell Tracking\nOpen image acquisition and analysis program and click on “Review Plate Data [DB]…”, selecting the plate of interest.\nView the data as “Time vs. Well”.",
    "Choose one of the sites from the “Sites” section by left clicking on the desired selection. Select “Transmitted…” under the “Wavelengths:”. Right click on the target well in the 96-well plate template and click on “Load Images”.\nTrack the cells by clicking on the “Apps” and then “Track Objects”.\nUse “Dynamic Data Exchange (DDE)” to choose the format to export the data, e.g., Microsoft Excel.\nChoose the tracking data to export, e.g., elapsed time, object number, distance, time interval, velocity, absolute angle, distance to origin, delta x and delta y.\nTag each cell of interest with “Ctrl key + left click” on target cells.\nTrack cells. If necessary, stop/change improper tracking of cells with the “Esc” key and then adjust the settings.\nAfter cell tracking is complete, save data with “Log Data”."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}