{
  "id": 3686,
  "origin_website": "Cell",
  "title": "Modulating organelle distribution using light-inducible heterodimerization in C.&nbsp;elegans",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPrepare imaging setup\nTiming: 10 min\nCritical: Very low levels of blue light are sufficient to activate LOVpep, so all environmental blue light that could reach the animals during culturing and sample preparation needs to be eliminated as much as practically feasible.\nStore the animals in a box that blocks environmental light, e.g., by wrapping the box in aluminum foil.\nIf the room used for sample preparation and imaging needs to be illuminated, use a light source filtered for blue light. If necessary, aluminum foil can be used to cover the microscope setup and blue light of monitors can be omitted by adjusting the hardware display settings.\nInsert optical (orange) filters in the light paths of the dissection scope and of the imaging microscope to remove LOVpep-activating wavelengths from the transmitted light used to handle samples.\nPrepare microscope settings for global and local light-induced heterodimerization\nTiming: 3–4 h\nCritical: The conditions used for light-induced activation need to be thoroughly optimized to ensure minimal activation before the experiment or outside the region of interest, especially since LOVpep activation requires very low light exposure.\nTo setup the microscope, use a strain in which heterodimerization is straightforward to score and where ePDZ is tagged with a red or far-red fluorophore so its distribution can be visualized without activating LOVpep.\nFor example, a strain expressing cytosolic ePDZ combined with a membrane anchored LOVpep allows for easy scoring of membrane recruitment of ePDZ-mCherry (De Henau et al., 2020[href=https://www.wicell.org#bib5]; Fielmich et al., 2018[href=https://www.wicell.org#bib9]) (Figure 3[href=https://www.wicell.org#fig3]A, Methods videos S1[href=https://www.wicell.org#mmc1] and S2[href=https://www.wicell.org#mmc2]). A cytosolic ePDZ combined with an organelle anchored LOVpep works equally well (Hallett et al., 2016[href=https://www.wicell.org#bib17]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/373-Fig3.jpg\nFigure 3. Quantification of light-induced relocalization\n(A) Scheme for the induced recruitment of ePDZ::mCherry to membrane-bound PH::eGFP::LOV.",
    "(B) Time-lapse images of a C. elegans zygote with membrane-bound PH::eGFP::LOV (not shown) and cytosolic ePDZ::mCherry, with local LOVpep activation (box). Arrow points to membrane recruitment of ePDZ::mCherry, asterisks indicate LOVpep activation outside the ROI in a neighboring embryo, likely due to light scattering. Calculating the ratio of fluorescence intensity in the activated membrane ROI and a cytosolic ROI of equal (or comparable) size allows to determine the maximum intensity ratio and activation half-life. LOVpep was activated using a 488 nm laser line with laser intensity at 0.01% and pixel dwell time of 8 ms, started at 0 s and was applied in between each time point (2 s interval). Anterior side of the zygote is to the left. Scale bar, 10 μm. Data are mean ± SEM (n = 4).\n                Your browser does not support HTML5 video.\n              \nMethods video S1. Representative time-lapse video of an embryo expressing membrane-bound PH::GFP::LOV (not shown) and cytosolic ePDZ::mCherry (white), related to Step-by-step method details point 4\nThe embryo is going through cytokinesis and is exposed to alternating dark and global activating (+488 nm light) conditions. “+488 nm” indicates that LOVpep was activated using a 488 nm laser line, with laser intensity at 0.001% (0.01 μW) and pixel dwell time of 8 ms, applied in between each time point (5 s interval). Frame rate video 15 fps, anterior to the left.\n                Your browser does not support HTML5 video.\n              \nMethods video S2. Representative time-lapse video of two zygotes expressing EGFR-TM::mTagBFP2::LOV (not shown) and ePDZ::mCherry (white), related to Step-by-step method details point 4",
    "(A) a zygote without and (B) a zygote with continuous anterior local LOV activation (box), as shown in Figure 6. Both zygotes are staged at the end of meiosis II, which can be seen by the local deformation at the anterior side (anaphase of meiosis II, and formation of the polar body) and subsequent membrane ruffling. LOVpep was continuously activated using a 488 nm laser line, with laser intensity at 0.01% (0.1 μW) and pixel dwell time of 8 ms, applied in between each time point (2 s interval). Frame rate video 20 fps, anterior to the left.\nAssess for unintended light-induced heterodimerization during sample preparation (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/373-Fig4.jpg\nFigure 4. Schematics of the steps to assess for unintended light-induced heterodimerization during sample preparation\nPrepare the sample for imaging, while preventing exposure to environmental blue light as described above.\nLocate the sample of interest using transmitted light that has been filtered for blue light and acquire a snapshot of the ePDZ fusion protein.\nExcite the entire field of view with 488 nm laser light (similar to the acquisition of an eGFP image) to induce global light-induced heterodimerization and immediately acquire a second snapshot of the ePDZ fusion protein.\nTo obtain a dark-state, non-activated condition, leave the sample on the microscope for approximately 5 min, shielding it from all environmental light. Afterwards, acquire a third snapshot of the mobile ePDZ fusion protein.\nCompare the snapshots to determine if unintended light-induced heterodimerization occurs during sample preparation. If needed, quantify the signal intensities of the ePDZ fusion protein outside and inside the area where the LOVpep fusion protein is localized (also see next point for how to quantify) (Troubleshooting 4[href=https://www.wicell.org#sec6.7]).",
    "Note: Global light-induced heterodimerization refers to applying 488 nm light to the entire cell/ field of view to activate all LOVpep within the sample, whereas local light-induced heterodimerization refers to applying 488 nm light to a defined region of interest (ROI) within the cell to activate LOVpep with subcellular resolution.\nDetermine 488 nm laser settings for light-induced heterodimerization\nCritical: Since LOVpep activation requires very low light exposure, the minimal amount of laser power required for LOVpep activation should be used during experiments. This is especially important for local photoactivation experiments, since excessive laser power combined with light scattering can cause significant activation outside the region of interest. In our hands, an excitation power of 2 iterations of 0.1–0.01 μW 488 nm laser light with a pixel dwell time of 8 μs every 2–5 s (i.e., in between every image acquisition) is sufficient to recruit ePDZ-mCherry to membrane-bound PH-LOV. This amount of excitation power is much lower than what is generally needed to excite and observe eGFP using confocal microscopy. The amount of power needed to maintain activation might increase upon longer time intervals (Hallett et al., 2016[href=https://www.wicell.org#bib17]).\nStarting with a dark-state, non-activated sample, set up a time-lapse experiment for local light-induced heterodimerization: excite a ROI with the 488 nm laser in between every acquisition of snapshots of the mobile ePDZ fusion protein. Because the reversion half-life of LOVpep-ePDZ is relatively fast (approximately 50 s) (Fielmich et al., 2018[href=https://www.wicell.org#bib9]; Hallett et al., 2016[href=https://www.wicell.org#bib17]), try to keep the time interval in between every 488 nm excitation as short as possible.",
    "Repeat this using different intensities, pixel dwell time, iterations, and time intervals for the 488 nm laser. Since high-intensity blue light may be cytotoxic and causes off-target activation, aim for lower power settings and shorter pixel dwell time and rather increase the number of iterations to achieve light activation. Try to find the lowest/shortest settings for these parameters for which you can still see ePDZ relocation and which are compatible with your experiments.\nTake along a negative control that only expresses the ePDZ fusion construct. No relocation or phenotype (e.g., light-induced toxicity) should be observable using the settings from (b).\nOptional: After acquisition, process the time-lapse images to reduce background noise and segment activated organelle/structure if needed for signal quantification.\nCalculate the ratio of fluorescence intensity inside the activated ROI to the intensity in a ROI of similar size outside the area of activation. This analysis produces a maximum intensity ratio as well as the activation half-life (Hallett et al., 2016[href=https://www.wicell.org#bib17]) (Figure 3[href=https://www.wicell.org#fig3]B).\nWith the results from the previous step, determine the minimal amount of power needed to achieve light-induced activation.\nOptional: Determine how much light-induced heterodimerization occurs surrounding/outside the area of activation and how this would affect your experiment. For example, light-induced activation outside the area of activation can be observed in a neighboring embryo in Figure 3[href=https://www.wicell.org#fig3]B (bottom image, asterisks), despite using very low levels of 488 nm laser light to activate a defined small area (Troubleshooting 5[href=https://www.wicell.org#sec6.9]).\nCritical: Because of variation in laser power over time, steps (a)–(g) should be repeated periodically using a reference strain to calibrate the amount of laser power required for local activation of LOVpep prior to experiments.\nUsing the minimal amount of power for light-induced activation, repeat this procedure with the LOVpep and ePDZ fusion constructs you will use in your experiments.",
    "Determine if continuous, transient, or pulsed light-induced activation is needed for the desired effect on organelle translocation. For example, we used continuous light activation to trap mitochondria at the cell membrane (De Henau et al., 2020[href=https://www.wicell.org#bib5]) (Figure 5[href=https://www.wicell.org#fig5]), while Nijenhuis et al. used pulsed activation to explore how organelles recover from light-induced mislocalization (Nijenhuis et al., 2020[href=https://www.wicell.org#bib25]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/373-Fig5.jpg\nFigure 5. Determining the effect of LOVpep activation on organelle distribution\n(A) Scheme for the induced recruitment of mitochondria with TOMM20::HALO::ePDZ to membrane EGFR-TM::mTagBFP2::LOV.\n(B) Representative time-lapse images of C. elegans zygotes with membrane EGFR-TM::mTagBFP2::LOV (not shown) and mitochondria with TOMM20::HALO::ePDZ without or with (box) local LOVpep activation.\n(C) Particle tracking analysis in C. elegans zygotes without or with LOV activation, with tracking performed in the same area as where activating light was used (zygotes with activation) or in a comparable region (zygotes without activation). Solid line is the mean of all tracked particles (n = 4 zygotes each). LOVpep was activated using a 488 nm laser line, with laser intensity at 0.01% and pixel dwell time of 8 ms, started at 0 s and was applied in between each time point (2 s interval). Zygotes were imaged following completion of meiosis II and treated with spd-2 RNAi to prevent mitochondrial streaming toward the future posterior side. Anterior side of the zygote is to the left. Scale bar, 10 μm. Figure reprinted with permission from De Henau et al. (2020)[href=https://www.wicell.org#bib5].",
    "Note: The sensitivity and activation and reversion kinetics of LOVpep-ePDZ dimerization following light illumination are important parameters to consider. They determine how often the proteins need to be exposed to blue light in order to induce, maintain, and turn off dimerization to get the desired experimental conditions. Light-induced dimerization of LOVpep-ePDZ occurs with a half-life of approximately 40 s and will revert to its original state in the dark with a reversion half-life of approximately 50 s (Fielmich et al., 2018[href=https://www.wicell.org#bib9]; Hallett et al., 2016[href=https://www.wicell.org#bib17]) (Figure 3[href=https://www.wicell.org#fig3]B). This is relatively fast and in practice means that photoactivation is carried out in between every image acquisition to maintain dimerization.\nAlso here, take along a negative control that only expresses the ePDZ fusion construct. No relocation should be observable using the settings used in (g).\nCritical: When designing and interpreting experiments keep in mind that also in the dark-state ePDZ will bind to LOVpep, although with an approximately 6-fold lower affinity compared to the photo-activated state (Hallett et al., 2016[href=https://www.wicell.org#bib17]).\nNote: Fusing LOVpep to different protein domains might influence activation efficiency or prevent ePDZ binding altogether (Hallett et al., 2016[href=https://www.wicell.org#bib17]). For example, we needed approximately 10 times more energy to activate LOVpep anchored to the membrane using a transmembrane region (Figure 6[href=https://www.wicell.org#fig6]), compared to when anchoring it using a pleckstrin homology domain (Figure 3[href=https://www.wicell.org#fig3]B) (De Henau et al., 2020[href=https://www.wicell.org#bib5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/373-Fig6.jpg\nFigure 6. Representative time-lapse images of C. elegans zygotes with membrane EGFR-TM::mTagBFP2::LOV (not shown) and cytosolic ePDZ::mCherry without or with LOVpep activation",
    "The zygote not exposed to blue light (left column) does not display membrane recruitment of ePDZ::mCherry. The zygote with local LOV activation (right column, box) shows successful local membrane recruitment of ePDZ::mCherry (arrow). LOVpep was activated using a 488 nm laser line, with laser intensity at 0.01% and pixel dwell time of 8 ms, started at 0 s and was applied in between each time point (2 s interval). Anterior side of the zygote is to the left. Scale bar, 10 μm. Figure reprinted with permission from De Henau et al. (2020)[href=https://www.wicell.org#bib5].\nPerform light-induced heterodimerization experiments\nUsing the settings for 488 nm light-induced activation determined in step 6, set up your imaging parameters.\nLocate the sample of interest using transmitted light that has been filtered for blue light.\nAs noted above, global light-induced heterodimerization can be achieved similar to acquiring GFP images, while local light-induced heterodimerization is achieved by exposing only the region of interest (ROI) with a 488 nm laser.\nAfterwards, determine if the light-induced heterodimerization of LOVpep and ePDZ has the desired effect on organelle relocation. For example, to determine if local activation of membrane LOVpep effectively trapped mitochondria labeled with ePDZ in the activated area, we used particle tracking analysis of the mitochondrial signal (Figure 5[href=https://www.wicell.org#fig5]C) (De Henau et al., 2020[href=https://www.wicell.org#bib5]). Alternatively, organelle redistribution dynamics can be quantified by comparing changes in total intensity in the activated and non-activated area (Nijenhuis et al., 2020[href=https://www.wicell.org#bib25]) (Troubleshooting 6[href=https://www.wicell.org#sec6.11]).",
    "Note: Trapping of an organelle, for example trapping of mitochondria near the cell membrane (Figure 5[href=https://www.wicell.org#fig5]) (De Henau et al., 2020[href=https://www.wicell.org#bib5]), will most likely result in only moderate organelle enrichment at the site of interest. Trapping also requires the organelle of interest to occasionally be present at the site of interest in order for LOV and ePDZ dimerization to be able to occur upon light activation. We therefore prefer to refer to this method as local trapping of an organelle rather than relocation."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Cell Biology",
    "Model Organisms",
    "Microscopy"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}