{
  "id": 7051,
  "origin_website": "Bio",
  "title": "Analysis of B Cell Migration by Intravital Microscopy",
  "procedures": [
    "B cell purificationNote: Before starting the Petri dish needs to be coated for 1 h with α-Thy1 monoclonal antibody ascites (NIM-R1) (1:10,000) (Chayen and Parkhouse, 1982). Euthanize female mice of 8-12 weeks by cervical dislocation. Place the mouse on its back on a dissecting board.Thoroughly soak the fur of the mouse with 70% ethanol. Transfer the board with the mouse to the tissue culture hood.Make an incision in the skin with scissors on the left side (from the perspective of the mouse, right when looking onto the mouse, compare Figure 1), then grab the skin with both hands and pull it away to expose the left side of the abdominal wall (the spleen is located between the stomach and the left side of the diaphragm of the mouse) (Figure 1). Use forceps to lift out the spleen and carefully resect it with scissors. The spleen should be removed intact.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3842/bioprotoc-10-23-3842-g001.jpgFigure 1. Schematic representation of the localization of relevant organs involved in the IVM of the LN. The trachea is shown here as a reference for the localization of the carotid artery, which is used for posterior catheterization. The localization of the spleen is shown for its resection in a donor mouse to isolate B cells. The two blue arrows in the lower part of the figure point to the right and left inguinal LN which are locally activated by injection of CXCL12 close to it. Both LN can be used for IVM.Submerge the spleen in 10 ml of PBS 1x in a Petri dish.Place the spleen on the top of a strainer of 40 µm (Falcon cell strainer) and disaggregate it by employing a syringe plunger and wash the strainer with up to 10 ml of PBS 1x. Collect the cell suspension in a 50 ml centrifuge tube.",
    "The cell suspension is transferred on top of a 15 ml tube containing 5 ml of Ficoll-Paque. Slowly pour the cell suspension on top of the Ficoll layer without disrupting the interphase between cell suspension and Ficoll). Centrifuge at 50 x g for 30 min at room temperature (with an acceleration and deceleration rate of 1 or no brake). Collect the thin white cell layer with a 1 ml pipette.Resuspend the cells in 5 ml of PBS 1x and centrifuge at 50 x g for 5 min at room temperature and repeat this washing step, then recollect the pellet of splenic mononuclear cells (MNC) in 10 ml of PBS 1x.Deposit the cell suspension in the Petri dish previously coated for 1 h with an α-Thy1 monoclonal antibody ascites (NIM-R1) (1:10,000) (Chayen and Parkhouse, 1982) (as mentioned at the beginning of this procedure) and incubates for 1 h at 37 °C with 5% of CO2, to allow adhesion of other MNC and enrichment of the B220+ cell population in the supernatant.After 1 h, carefully transfer the supernatant from the Petri dish into a 15 ml tube and centrifuge for 5 min at 50 x g twice at room temperature. Then, decant and resuspend the pellet in 2 ml of PBS 1x and analyze the purity of the population by flow cytometry using an anti-B220 monoclonal antibody. Purity should be over 90% (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3842/bioprotoc-10-23-3842-g002.jpgFigure 2. B cell enrichment and stimulation. A. After B cell enrichment, purity was assessed by flow cytometry employing a monoclonal antibody against B220 coupled to AF488. Typically, a purity over 90% is obtained using α-Thy1 antibody-coated Petri dishes. B. CD44 expression on B cells increases after stimulation with LPS and IL-4 for 48 h.",
    "Activation of B cellsStimulate 2 x 106 B cells in 2 ml of RPMI 1640 in one well of a 6-well cell culture plate, supplemented with 10% of fetal bovine serum (the supplemented medium should be at room temperature) by adding 10 µg/ml of LPS from Escherichia coli O55: B5 and 10 U/ml of IL-4.Incubate the cells at 37°C and 5% of CO2 for 48 h.Recover the cells with a 1 ml pipet, resuspend them gently by pipetting up and down a few times, and wash cells with 5 ml of PBS 1x twice. (centrifugation is done at 50 x g for 5 min at room temperature). Then, resuspend the B cells in 2 ml of PBS 1x in a 15 ml tube.B cell labelingPlace 1 x 107 activated B cells in a 50 ml tube containing 30 ml of RPMI1640 at room temperature without supplements and add 10 µl of Hoechst 33342 for 1 h.Note: Reconstitute Hoechst 33342 according to the manufacturer’s instructions; aliquot and store at -20 °C. Wash cells twice with RPMI 1640 without supplements and centrifuge at 50 x g for 10 min at room temperature.Resuspend cells in 200 µl of PBS 1x in an Eppendorf tube. Store cells on ice until use in experiments (not longer than 1 h).Note: An example of increased CD44 expression on B cells after LPS stimulation as measured by flow cytometry is shown in Figure 2B (This step is optional). Injection of CXCL12 into the host mouseGrab the mouse by the neck to handle it for the procedure.Hold the tail of the mouse with the fingers and locate the inguinal LN below the inguinal ligament and the bifurcation of the epigastric vein). The injection can be performed as previously described (Andorko et al., 2014).",
    "Inject the chemokine into the zone of the inguinal LN (prior to the administration, you can visualize the LN localization with a dissection microscope) with 200 µl of CXCL12 (25 ng/ml) using a 22 G syringe.Note: Be careful with this process as an incorrect puncture can damage the LN and can also cause alterations in the blood flux. Let the mouse rest for 1 h.Preparation of the catheter and the syringes needed during the procedureFill a 31 G syringe with 100 μl of a heparin solution diluted to a final concentration of 500 UI/ml (Use physiological saline to dilute the heparin).Cut an approximately 15 cm long PE tube. Cut the end of the tube in a 45° angle (like the tip of an injection needle).Insert the other end to the needle of the syringe (Use the forceps to facilitate its insertion).Purge the heparinized catheter (make sure no air bubbles are present in the syringe or the PE tube).In addition to the heparinized catheter, prepare another syringe with 300 μl of anesthesia (Ketamine hydrochloride 125 mg/kg/Xylazine 12.5 mg/kg) to be used to deliver additional anesthesia systemically during the procedure.Prepare an additional 31 G syringe. It will be employed to deliver the labeled B cells through the catheter.Carotid artery catheterizationClean and disinfect with 70% alcohol where the surgery is going to be performed.Anesthetize the mouse delivering intraperitoneally (IP) 10 ml/kg weight of the previously mentioned anesthetic mixtureExample: For a 20 g mouse, inject IP 200 μl of the anesthetics mixture. Wait 10 min; monitor pain reflexes of the mouse during induction to anesthesia by pinching the paws with forceps.Upon anesthesia, place the mouse on its back; fix the paws with adhesive tape in a dorsal position.",
    "Also, secure the head with a 5 cm thread positioned behind the teeth and fix it with tape. Both ends of the thread should be fixed in front of the nose of the mouse (Jacobs and Hopper-Borge, 2014).Optional: The carotid artery can be more accessible if a 1 ml pipette tip is positioned under the neck of the mouse before the catheterization. Place the mouse under the dissection microscope. Make sure all the material needed is accessible.Below the chin, make a small incision, introduce the scissors in a closed position between the skin and submaxillary glands and separate them by carefully opening the scissors; Make a 2 cm longitudinal cut through the skin of the neck.Once the submaxillary glands are exposed, separate them by cutting the connective tissue between them. Separate them gently by employing 2 curved forceps. After these, use the left forceps to separate the muscle from the trachea while inserting the right forceps next to the trachea and carefully dissecting the fascia that surrounds the carotid artery. Also, dissect the vagus nerve located next to the artery (This serves to completely isolate the artery which avoids mistakes when inserting the catheter).Cut approximately 8 cm of the polyester thread and bend it in a hairpin-like shape and with the forceps, draw it below the carotid artery and leave equal portions of the thread aside of the artery. Cut the thread so that two equal portions are located beneath the carotid artery. One portion should be towards the thorax while the other thread should be located towards the head (Figure 3A).Close the blood flux to the brain by firmly tying a knot as close as possible to the head (Figure 3B, red arrow).",
    "Leave the two extremes of the thread free; after catheterization, they are used for securing the catheter with a double knot.Make a loose knot in the farthest portion of the artery, in direction to the thorax (Figure 3B, black arrow). (This knot will remain loose and will serve for securing and fixing the catheter once it is inserted inside the artery).With the left forceps, slightly lift the carotid artery by pulling out the loose knot in a way that it does not loses its shape. With the right hand, use a clip applicator to place a straight clamp to the artery. This clamp should be placed after the loose knot (in direction to the thorax) (Figure 3C). Make sure enough space (approximately 1 cm length) is left to insert the catheter to the carotid artery.Once the clamp is securely placed, use the spring scissors to make a small incision close to the portion of the artery located towards the head of the mouse (Blood will be spilled as a consequence of this cut).Hold the tight knot to fix the artery with the right hand while inserting the catheter into the carotid artery. (Insert the catheter with the tip in an upward direction; this will avoid damaging the artery. Once the catheter is inside, tighten the loose knot to secure in place the catheter; fix the catheter with the threads located towards the head with a double knot (Figure 3D).Slowly release the clamp with a clip applicator. Blood will invade the inner part of the catheter. If it is correctly placed, blood pumping inside the catheter will be seen (Figure 3D) (Obstruction of the catheter can be tested by delivering a small amount of saline solution with a 31 G syringe. This is an optional step).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3842/bioprotoc-10-23-3842-g003.jpgFigure 3. Carotid artery catheterization. A.",
    "A hairpin-like polyester thread is drawn below the carotid artery: one thread is placed towards the thorax; the other one towards the head. B. Close the blood flow towards the brain with a double knot (red arrow); with the other thread, make a loose knot (black arrow). C. Place a straight clamp to close the artery. D. Catheterize the carotid artery; fix the catheter with two knots and release the clamp from the artery. Blood will invade the inner part of the catheter (black arrow). The double arrow indicates the orientation of the mouse.Labeled B cell injectionTransfer the labeled B cells (1 x 107 cells/200 μl) to a 31 G syringe. Avoid the presence of bubbles in the syringe.Unplug the heparinized syringe from the catheterized mouse and avoid drawing blood by pinching the catheter’s tube with forceps. Immediately, plug the syringe that contains the cell suspension.Note: Take the cells to room temperature before injection. Avoid light exposure of the cell suspension at any time. Slowly administer the cell suspension through the catheter.Unplug the syringe that contained the cell suspension. As before, immediately stop the blood return with forceps and plug a 31 G syringe with the mixture of anesthetics. Deliver 10 μl of anesthesia (This step serves two purposes: to maintain anesthesia and to wash the catheter).After administration of the B cell suspension, wait for 1 h to allow B cell interaction in the LN.Start to warm the PBS 1x superfusion system to 45 °C. (At this temperature, while the PBS 1x is superfused, it is naturally cooled down to 37 °C. This should be optimized in every laboratory).Inguinal LN dissectionAfter 30 min of B cell administration, check for pain reflexes in the pawn and if necessary, administrate more anesthesia.Carefully place the mouse on the animal stage.",
    "Secure the mouse by fixing the paws with tape. Note: Our animal stage (Figure 4) was designed with an area filled with silicon where one can fix the retracted skin by pins. Other options have been previously reported (Sellers and Payne, 2011). imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3842/bioprotoc-10-23-3842-g004.jpgFigure 4. Microscope set-up, superfusion system and customized animal stage. The superfusion system is composed of a hot stirring plate set at 45 °C to warm the superfusion buffer (PBS or 0.9% saline). With this setting, the buffer reaches the tissue at around 37 °C (this needs to be optimized in each laboratory). The buffer flask with an exit at the bottom is connected to a plastic tube that is fixed with regular tape to the 20x objective of the microscope. The customized animal stage is 25 cm long and 15 cm wide. This animal stage has the purpose of controlling the flow of PBS used to moisturize the exposed tissue. Additionally, it contains a little ring filled with silicon where the retracted skin can be fixed with needles (red arrow). This stage can be used for IVM of the LN, the cremaster muscle, and the mesentery. In the lower right part of the figure, an example of how the mouse is fixed to the animal stage is shown. Also, it exemplifies how the catheter should be fixed and how the mouse preparation should look prior IVM.Under the dissection microscope, make a small incision in the abdominal cavity and dissect the skin from the muscle by introducing the scissors in a closed position; then open them carefully. Enlarge to 2 cm the length of the skin incision and cut diagonally 1 cm of the skin towards the limbs; dissect the connective tissue and avoid disturbing the LN.",
    "Retract the skin enough to observe the inguinal LN and to make it accessible to the objectives of the microscope. Secure the skin by employing 2 pins (Figure 5A).Moisten the tissue with PBS 1x and dissect the connective tissue surrounding the inguinal LN.Clear the connective adipose tissue by using forceps until the microvasculature is exposed.Note: It is important to never touch or manipulate the vasculature. Also, too much tension while fixing the skin to the stage perturbs the blood flow. Since parameters such as rolling are quantified in this technique, it is fundamental to have intact blood flow. If necessary moisten the LN again (Figures 5B and 5C). imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3842/bioprotoc-10-23-3842-g005.jpgFigure 5. LN preparation. A and B. Secure the abdominal skin to the animal stage with two pins (black arrows); the inguinal LN should be visible (red arrows). C. Appearance of the LN after removal of surrounding connective and adipose tissue. HEV are clearly visible using a dissection microscope (black arrow).IVM of the inguinal LNPrepare the superfusion system and fix it with tape at the very end of the PE10 tube to the 20x objective.Place the animal under the microscope and locate the inguinal LN microvasculature. Start the PBS 1x superfusion in a way that the dropping keeps constant tissue moisture and objective immersion.Note: Constant moisture ensures correct focusing of the video. Localize the desired area of the microvasculature to record. Employ the 430-465 nm blue filter of the microscope. The desired area to record should contain HEV of 4 different calibers (Figure 6).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3842/bioprotoc-10-23-3842-g006.jpgFigure 6. Identification of HEVs. The number IV refers to the thinnest HEV, while the number I denotes the thickest HEV in the inguinal LN. The labeled B cells can be observed interacting with the HEV. (Objective 20x) Scale bar 50 µm.",
    "Record 4 or more videos of 5 min each at different time pointsNote: Maintain anesthesia during the whole procedure. Take a picture of the recorded area to locate the HEV for posterior quantification (Optional).After these steps, export the videos in AVI format and images in TIFF format."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}