{
  "id": 8910,
  "origin_website": "Jove",
  "title": "Focal Macropatch Recordings of Synaptic Currents from the Drosophila Larval Neuromuscular Junction",
  "procedures": [
    "1. Fabrication of Recording Electrodes\nPulling the glass electrodes\nUse the following protocol for the microelectrode puller (see Table of Materials):\n\t\t\nLine 1: Heat 510 Pull - Velocity 30 Time 250; Line 2: Heat 490 Pull - Velocity 30 Time 250.\n\t\t\tNOTE: Time units correspond to 0.5 ms per unit; the other units are relative. The value of the heat should be adjusted for every filament after the ramp test is performed.\nUse a microscope (35x magnification) to ensure that the inner diameter of the pulled electrode is in the range of 7 - 10 µm (Figure 1A). Store the capillaries in tightly closed containers to prevent dust accumulation.\nFire polishing\nFire polish capillaries (80 - 90% of the maximum heat value for 1 - 2 s) using a micro-forge (see Table of Materials). Ensure the final inner diameter of the polished electrode is 5 µm (Figure 1A)27.\nBending\n\tNOTE: Two bends are made in order to position the electrode on the top of the muscle under a high magnification objective.\n\t\nUse the apparatus shown in Figure 1B. Fix the electrode in the manipulator and position the tip over the filament, not touching it.\nSet heat value to 60 - 70% of the maximum and press the pedal of the micro-forge for 1 - 2 s (see Table of Materials) to heat the filament. Use an L-shaped needle to gently pull down the tip of the electrode (Figure 1B enlarged). Make the bend at approximately 90o (Figure 1C).\nHold the electrode over the flame of the torch by hand using forceps and make the second bend at a distance of 7 - 10 mm from the first bend and at an angle of approximately 120o (Figure 1C).\nimgsrc://cloudfront.jove.com/files/ftp_upload/56493/56493fig1.jpg",
    "Figure 1. Final steps of micropipette fabrication. (A) Electrode tips after pulling and fire polishing. (B.1) The setup for tip bending. (B.2) The boxed area is shown enlarged on the right. The electrode and the filament are fixed so that the electrode tip is positioned slightly above the wire and not touching. (C.1) The recording electrode. (C.2) The boxed area is shown enlarged on the right. The first bend has an angle of approximately 90°, and the distance between the first bend and the tip of the electrode is approximately 1 mm. Scale bar = 3 mm. Please click here to view a larger version of this figure.[href=https://www.jove.com//cloudfront.jove.com/files/ftp_upload/56493/56493fig1large.jpg]\n2. Additional Preparatory Steps\nPrepare heamolymph-like (HL3) solution (in mM): 70 NaCl, 5 KCl, 20 MgCl2, 10 NaHCO3, 5 trehalose, 115 sucrose, 5 HEPES, and 1 mM CaCl2; adjust the pH to 7.3 - 7.4. Keep the solution in the refrigerator and make it fresh every week.\nMake stimulation pipets the same way as recording glass pipets, except there is no need to bend them.\n\tNOTE: The preparation of stimulation electrodes is described in detail in 28 and 27. The final diameter after fire polishing should be in the range of 5 - 7 µm.\nInsert a stimulation pipette in a microelectrode holder connected to a syringe.\nManufacture dissection plates from small petri dishes (35 x 10 mm) coated with silicone rubber epoxy (see Table of Materials) as described in 28.\n\tNOTE: Silicone rubber should be completely hardened before use.\nPick a wandering third-instar larvae and dissect it as described in27,28,29,30.\n\tNOTE: To visualize boutons, use the fly strain CD8-GFP (see Table of Materials)\n\t\nUsing forceps (see Table of Materials), pick the 3rd instar larvae from a vial.",
    "Pin the larvae, placing the first pin posterior and another pin anterior (close to mouth hooks).\nAdd HL3 solution.\nMake a cut using spring scissors (see Table of Materials) all the way from the top pin to the bottom one on the dorsal side of the larvae.\nPin the larvae fillet, placing 2 additional pins on the left and right sides of the larvae.\nRemove the guts and tracheas using forceps.\nCut the nerves just outside the ventral nerve cord using spring scissors.\n3. Electrical recordings of EJCs\nimgsrc://cloudfront.jove.com/files/ftp_upload/56493/56493fig2.jpg\nFigure 2. The recording setup. The sample NMJ pinned to the silicon coated petri dish (arrow) is positioned over the movable stage of the upright compound microscope equipped with epifluorescence capabilities, a high magnification objective, and two micromanipulators. The microscope is stationed on an anti-vibration table. Please click here to view a larger version of this figure.[href=https://www.jove.com//cloudfront.jove.com/files/ftp_upload/56493/56493fig2large.jpg]\nRecording\nPlace the petri dish with the preparation on the microscope stage (Figure 2). Insert the reference electrode in the bath.\nFill the recording electrode with HL3 solution. Under the 10x objective (see Table of Materials), immerse the electrode into the bath and place it over muscles 6 and 7 of the abdominal segments 2, 3, or 4 using the micromanipulator (see Table of Materials) (Figure 3 A.1 and A.2).\nSwitch the objective to 60x (see Table of Materials). Focus on the area of interest using either epi-fluorescence or DIC optics. Place the tip of the electrode on top of synaptic bouton (Figure 3 B.1-3).\nPress the electrode very gently onto the muscle. Excessive pressure may damage the NMJ or induce an increase in spontaneous synaptic activity. Make sure the tip of the electrode is not clogged- if it is, replace it.\nSwitch on the amplifier, A/D board, and the computer.",
    "Choose the voltage clamp mode on the amplifier.\nStart acquisition software and choose the 'gap-free' mode.\nObserve the appearance of mEJCs on the computer screen.\nEnsure that the amplitude of the mEJCs is in the range of 0.2 - 0.7 nA.\n\t\tNOTE: Smaller EJCs indicate that the recording electrode has defects or that it is not positioned properly.\nimgsrc://cloudfront.jove.com/files/ftp_upload/56493/56493fig3.jpg\nFigure 3. Visualization of synaptic boutons. (A) A brightfield image of a hemi-segment under 10x magnification (A.1) and the enlarged boxed area showing muscles 6 and 7 (A.2, the arrow marks the recording electrode). Scale bar = 50 µm. (B) Synaptic boutons are visualized in a Drosophila line with a genetically encoded neuronal marker (CD8-GFP) using epi-fluorescence imaging (B.1) or DIC optics (B.2). Images are taken with the 60x objective and the filter cube for GFP imaging (see Table of Materials). Synaptic boutons are marked with arrows, and an overlay of fluorescent and DIC images is shown in B.3. Scale bar = 10 µm. Please click here to view a larger version of this figure.[href=https://www.jove.com//cloudfront.jove.com/files/ftp_upload/56493/56493fig3large.jpg]\nStimulation\nUsing a micromanipulator, under a visual control, place the stimulation electrode near the axon innervating abdominal segments 2 - 4.\nApply negative pressure by pulling the piston of the syringe connected to the electrode holder, so that the axon is pulled inside of the electrode (Figure 2).\nTurn on the stimulator. Turn the knob on the isolation unit (see Table of Materials) to set a zero current, and then gently increase it, until EJCs appear (or until the threshold is reached).\nPerform the stimulation in a suprathreshold regime, with the stimulation current increased approximately twice, compared to the threshold for the observation of EJCs.",
    "NOTE: In our experience, such stimulation intensity is optimal to avoid action potential failures and action potential firing. For example, if EJCs appear at the stimulation current of 0.2 mA, use a current of 0.4 mA throughout the experiment.\nSeal resistance\nMeasure the seal resistance of the recording macropatch electrode by turning the electrode resistance switch of the amplifier to \"seal test\" position. Observe that the value of seal resistance in GΩ will be displayed in the \"current\" window.\nMake sure the seal resistance is in the range of 0.5 - 2 MΩ. Values out of this range indicate that the electrode is not properly polished or not properly positioned.\nMonitor the seal resistance throughout the recording, making sure it remains constant throughout the experiment.\n4. Analysis\nAnalyze recordings employing customized software for analysis (see Table of Materials).\n\tNOTE: Our lab uses in-house software Quantan31, which is customized for the detection of EJCs and mEJCs recorded focally (Figure 4). This software includes a Gaussian digital filter and allows the detection of quantal peaks in overlapping multi-quantal events (Figure 4A). Other approaches are described in17.\nimgsrc://cloudfront.jove.com/files/ftp_upload/56493/56493fig4.jpg\nFigure 4. Quantal analysis. Detection of mEJCs (A) and EJCs (B) by Quantan software. The event area is marked in green, and peaks are marked by red arrowheads. Please click here to view a larger version of this figure.[href=https://www.jove.com//cloudfront.jove.com/files/ftp_upload/56493/56493fig4large.jpg]Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}