{
  "id": 19021,
  "origin_website": "Jove",
  "title": "Enrichment of Native Lipoprotein Particles with microRNA and Subsequent Determination of Their Absolute/Relative microRNA Content and Their Cellular Transfer Rate",
  "procedures": [
    "Blood donations have been approved by the Ethics Committee, Medical University of Vienna (EK-Nr. 511/2007, EK-Nr. 1414/2016). Nomenclature is according to the Minimum Information for Publication of Quantitative Real-Time PCR Experiments (MIQE)9 guidelines.\n1. Lipoprotein particle isolation from human blood\nPrecool an ultracentrifuge to 4 °C. Draw blood from healthy volunteers after overnight fasting.\n\tNOTE: Typically required are three donors, donating 80 mL each, and blood collection tubes containing ethylenediaminetetraacetic acid (EDTA) as anticoagulant.\nCentrifuge at 2,000 x g for 20 min at 4 °C and harvest plasma (upper phase); avoid shear forces. Determine the total volume V and adjust, if necessary, to a multiple of the centrifugation tube volume using phosphate-buffered saline (PBS). Measure the mass of 1 mL 3x and calculate the average density ρ.\nCalculate the required amount of potassium bromide (KBr) for density adjustment with the following equation10 (for desired density in grams/milliliter, use A = 1.019, and for the specific volume of KBr, use imgsrc://cloudfront.jove.com/files/ftp_upload/59573/59573eq1.jpg= 0.364 mL/g). Add KBr to the plasma and stir gently to avoid shear forces until KBr is totally dissolved.\nimgsrc://cloudfront.jove.com/files/ftp_upload/59573/59573eq2.jpg\nMeasure the density as described in step 1.2 and adjust again, if necessary, by adding more KBr. Fill and seal centrifuge tubes suitable for ultracentrifugation with plasma. Avoid any air bubbles; otherwise, the tube may collapse. Place the tubes in the rotor according to the manufacturer’s instructions and centrifuge at 214,000 x g for 20 h at 4 °C.\nOpen the tubes according to the manufacturer’s instructions and discard the upper phase containing VLDL and IDL. Determine the total volume V and adjust, if necessary, to a multiple of the centrifugation tube volume using PBS.",
    "Determine the density ρ of the bottom fraction. Calculate the required amount of KBr for density adjustment (use A = 1.063). Stir gently to avoid shear forces until KBr is dissolved. Repeat step 1.4.\nRemove and collect the upper phase containing LDL particles. Store the LDL particle solution under an inert gas atmosphere at 4 °C. Determine the total volume V and adjust, if necessary, to a multiple of the centrifugation tube volume using PBS. Determine the density ρ of the bottom fraction as described in step 1.2.\nCalculate the required amount of KBr for density adjustment (use A = 1.220) and add it. Stir gently to avoid shear forces until KBr is dissolved. Repeat step 1.4.\nRemove and collect the upper phase containing HDL particles. Determine its total volume V and adjust, if necessary, to a multiple of the centrifugation tube volume using PBS. Determine the density ρ. A second centrifugation step of the upper phase at 214,000 x g for 20 h at 4 °C is recommended to remove albumin. If required, repeat step 1.8. Remove and collect the upper phase containing HDL particles.\nPrepare and precool at least 20 L of dialysis buffer (0.9% NaCl, 0.1% EDTA [pH 7.4]) to 4 °C. Prewet dialysis tubes (molecular weight cut-off: 12–14 kDa) and add the LDL and HDL particle solution according to the manufacturer’s instructions. Dialyze against 5 L of dialysis buffer at 4 °C and change the buffer after 1, 2, and 4 h.\nAfter 24 h, recover the lipoprotein particle solutions from the dialysis tubes and determine the protein concentration using the Bradford assay11 or another appropriate one. Store the HDL and LDL particle solutions under inert gas atmosphere at 4 °C.\n2. Synthetic miRNA aliquots",
    "NOTE: When handling RNA oligonucleotides, work RNase-free. Work only with fresh, disposable plastic consumables and always wear gloves, which should be changed frequently. Use only nuclease-free solutions. Always work on ice.\nSpin down the vial acquired from the manufacturer at maximum force to form a pellet of the lyophilized synthetic miRNA. Add an appropriate volume of 10 mM Tris(hydroxymethyl) aminomethane (TRIS) buffer, pH 7.5, for a final concentration of 10 µM (stock concentration) miRNA.\nGently pipette up and down a couple of times for resuspension. Prepare aliquots of 100 µL each in sterile tubes. Store them at -20 °C if not used immediately. Avoid repeated thawing and freezing.\n3. Reconstitution of HDL particles\nDelipidation \nPrepare buffer A (150 mM NaCl, 0.01% EDTA, 10 mM Tris/HCl [pH 8.0]). Precool the centrifuge to -10 °C. Precool 100 mL of a mixture of ethanol:diethyl ether (3:2) at -20 °C.\n\t\tCAUTION: Wear appropriate personal protective equipment and work in a fume hood while handling diethyl ether as it is extremely flammable and harmful to the skin.\nMix a volume corresponding to 5 mg of HDL particles with 50 mL of the precooled ethanol:diethyl ether (3:2) mixture and incubate for 2 h at -20 °C. Centrifuge at 2,500 x g for 10 min at -10 °C.\nDiscard the supernatant, resuspend the pellet in 50 mL of precooled ethanol:diethyl ether mixture by vortexing, and incubate a second time for 2 h at -20 °C. Centrifuge again at 2,500 x g for 10 min at -10 °C.\n\t\tNOTE: If desired, lyophilize the supernatant for an analysis of the miRNA content in the lipid fraction of the HDL particles.",
    "Dry the pellet under N2 gas flow and resuspend it in 250 µL of buffer A (see step 3.1.1). Determine the protein concentration using the Bradford protein assay or another appropriate one and dilute to a final concentration of 1 mg of protein/250 µL of buffer A.\n\t\tNOTE: The protocol can be paused here. Store the solution overnight at 4 °C under inert gas atmosphere.\nReconstitution\nPrepare a phosphatidylcholine (PC) stock solution using a mixture of chloroform:methanol (2:1) at a concentration of 5.6 mg of PC/mL. Similarly, prepare stock solutions of cholesteryl oleate (5 mg of CO/mL) and cholesterol (5 mg of C/mL). Store all solutions at -20 °C.\nIn a clean glass tube, mix 500 µL of PC, 100 µL of CO, and 13.5 µL of C. These volumes correspond to an approximate molar ratio of 100 PC:22 CO:4.8 C. Dry the mixture under N2 gas flow while rotating the tube to yield a homogeneous surface layer.\n\t\tNOTE: The protocol can be paused here. Store the glass vial (if desired, stockpiling is possible) under inert gas atmosphere at -20 °C.\nPrepare a fresh 30 mM spermine solution in buffer A. Mix one aliquot (100 µL, 10 µM) of synthetic miRNA (see step 2.2) with 100 µL of spermine solution and incubate for 30 min at 30 °C.\n\t\tNOTE: For negative control experiments, replace the miRNA and/or spermine solution with the same volume of buffer A.\nDissolve a PC/CO/C master mix aliquot in the mixture from step 3.2.3.\nPrepare a solution of 30 mg/mL of sodium deoxycholate in buffer A and add 50 µL to the solution from step 3.2.4. Stir at 4 °C for 2 h.",
    "Add 250 µL of the delipidated HDL solution from step 3.1.4. This volume corresponds to an approximate molar ratio of 100 PC:22 CO:4.8 C:1 delipidated HDL proteins. Stir at 4 °C overnight.\nDialysis\nPrecool at least 15 L of PBS at 4 °C. Add 50 g of adsorbent beads to 800 mL of double distilled water (ddH2O) and stir for 1 min. Wait 15 min, decant the supernatant, and repeat the procedure with PBS.\nPrewet dialysis cassettes (molecular weight cut-off: 20 kDa) or appropriate dialysis tubes and add the solution from step 3.2.6, using a syringe according to the manufacturer’s instructions.\nAdd the adsorbent beads from step 3.3.1 to 3 L of PBS and dialyze at 4 °C. Change the buffer and the beads after 1 h and 2 h.\nAfter 24 h, recover the reconstituted HDL (rHDL) particle solution and determine the protein concentration using the Bradford assay. Store the rHDL particle solution under inert gas atmosphere at 4 °C.\n4. Labeling of LDL particles\nPrepare 10x LDL buffer (1.5 M NaCl, 3 mM EDTA, 1 mM ethylene glycol-bis(β-aminoethyl ether)-N,N,N',N'-tetraacetic acid [EGTA, pH 7.4]) and store it at room temperature.\nPrepare a fresh 30 mM spermine solution in RNase-free water. Mix an aliquot (100 µL, 10 µM) of synthetic miRNA (see step 2.2) with 100 µL of spermine solution and incubate for 30 min at 30 °C.\n\tNOTE: For negative control experiments, replace the miRNA and/or the spermine solution with the same volume of 1x LDL buffer.\nAdd 100 µL of DMSO to the miRNA/spermine solution from step 4.2 and dilute it further with 1.2 mL of 1x LDL buffer.",
    "Dilute the LDL particle solution to a final concentration of approximately 4 mg/mL with PBS and mix 450 µL with 50 µL of 10x LDL buffer. Incubate it for 10 min on ice.\nCombine the LDL particle solution from the previous step and the miRNA/spermine/DMSO solution (from step 4.3) and incubate it for 2 h at 40 °C.\nPerform dialysis similar as described in section 3.3 and store the labeled LDL particle solution accordingly.\n5. Quality control of reconstituted/labeled lipoprotein particles\nNOTE: For quality control, the diameter and general shape of lipoprotein particles can be determined using, for instance, AFM or electron microscopy (EM). Here, HS-AFM is used to measure the size distribution of native/reconstituted/labeled lipoprotein particles.\nDilute the HDL/LDL particle solution in PBS (1:100–1:1,000) and incubate it on freshly cleaved mica for 5 min. For cleaving the mica12, press adhesive tape against the substrate and remove the upper mica layers by pulling the tape off.\n\tNOTE: Depending on the particular AFM instrument, the observation area, and the initial concentration of particles, the dilution factor has to be adjusted to observe individual particles.\nAfter incubation, rinse the sample with PBS and perform HS-AFM imaging in PBS and in the tapping mode with cantilevers having spring constants of kcant < 0.2 N/m. It is recommended to use scan sizes <1 µm2 and to keep the imaging forces as low as possible.\nDetermine the height of the imaged particles with respect to the mica surface with suitable software.\n\t\nLoad the data into Gwyddion (freeware), detect the particles via grain analysis (Mark grains by threshold) and set the threshold above the substrate background. Flatten the image (Remove polynomial background) choosing the Exclude masked region option.",
    "Export the height values of the detected particles (Distribution of various grain characteristics) and repeat these steps for all recorded images. Perform statistical analysis by either creating histograms or calculating probability density functions of the obtained particle heights.\nRepeat steps 5.1–5.3 with native as well as reconstituted/labeled lipoprotein particles and compare the obtained results to verify particle quality. If observing debris and/or conglomerates, discard the sample.\n6. Cell culture\nGrow adherent cells according to an established protocol (e.g., ldlA7-SRBI13) until reaching confluency.\n\tNOTE: Several independent chambers depending on the number of experiments (recommended are two chambers per experimental setting) and negative control experiments (recommended are two chambers without the addition of lipoprotein particles) are needed. Additionally, two chambers are required for the determination of the cell number.\nGently wash the cells 3x with prewarmed Hank’s balanced salt solution (HBSS) to remove cell debris and cover the cell layer with an appropriate volume of serum-free growth medium. Add an appropriate volume of lipoprotein particle solution to reach a final concentration of 50 µg/mL lipoprotein particles. Incubate at 37 °C and 5% CO2 for 16 h.\n\tNOTE: Depending on the experimental design and cell line, the incubation time has to be adapted to achieve a sufficient (i.e., measurable) increase in the cellular miRNA level.\nGently wash the cells 3x with prewarmed (37 °C) HBSS to remove cell debris/lipoprotein particles and cover the cell layer with an appropriate volume of serum-free medium.\nDetermine the cell density using an appropriate method (e.g., hemocytometer, automated cell counter) in at least two independent chambers to calculate the number of cells in the sample volume from step 6.3. This number is used for normalization.\n7. miRNA extraction from cell and lipoprotein particle samples",
    "NOTE: The extraction of miRNA from cells is performed using the miRNA extraction kit with the following modifications.\nCell samples\nPrecool the centrifuge to 4 °C. Add 350 µL of lysis reagent each to two chambers containing cells. As a negative control experiment, use a chamber without cells.\n\t\tCAUTION: Wear appropriate personal protective equipment and work in a fume hood while handling lysis reagent as it contains phenol and thiocyanate.\nWait for 3–5 min (depending on the cell line) for cell detachment. If required, check for cell detachment with brightfield microscopy. Pool the contents of the two chambers in a 1.5 mL tube.\nUsing a 20 G needle and a 5 mL syringe, homogenize/disrupt the sample 5x–10x by aspiration and incubate for 5 min. Add 140 µL of chloroform (CHCl3), shake vigorously for 15 s, and incubate for 3 min.\nCentrifuge at 12,000 x g for 15 min at 4 °C. Afterward, stop cooling the centrifuge.\nTransfer the upper aqueous phase to a new 1.5 mL tube; avoid phase mixing/contamination as the interphase contains DNA and the lower phase contains proteins. Add 1.5x the volume of 100% ethanol and mix thoroughly by pipetting.\nPlace a spin column in a 2 mL collection tube and add 700 µL of the mixture from step 7.1.5. Centrifuge at 8,000 x g for 15 s at room temperature. Discard the flow-through and repeat this step with the residual sample volume.\nDiscard the flow through and add 700 µL of the first wash buffer to the spin column. Centrifuge it at 8,000 x g for 15 s at room temperature.",
    "Discard the flow through and add 500 µL of the second wash buffer to the spin column. Centrifuge it at 8,000 x g for 15 s at room temperature. Repeat this whole step a second time with 2 min of centrifugation time.\nPlace the spin column into a new 2 mL collection tube and centrifuge it at full speed for 1 min to dry the membrane.\nPlace the spin column into a 1.5 mL collection tube. Add 30 µL of RNase-free water at the center of the membrane for elution and centrifuge it at 8,000 x g for 1 min. Repeat this whole step a second time with the first flow through as elution solution. The reverse transcription step is done immediately after the extraction; otherwise, store the extracted miRNA samples at -20 °C.\nLipoprotein particles\nSet the volume of the sample with the lowest protein concentration to 100 µL (= maximum sample volume). Calculate the sample volumes of the other samples according to this normalization, inversely to their concentration. For negative control experiments, use 100 µL of RNase-free water.\n\t\tNOTE: Normalization is not required but simplifies the direct comparison of results during the qPCR step and analysis.\nPrecool the centrifuge to 4 °C. Add 700 µL of lysis reagent to the sample volume of step 7.2.1.\nPerform miRNA extraction according to steps 7.1.3–7.1.10.\n8. Reverse transcription\nNOTE: The reverse transcription of miRNA is performed using a reverse transcription kit with the following modifications.\nThaw the kit reagents and the reverse transcription primers on ice. Prepare the following master mix in a reaction tube on ice: 45.7 µL of RNase-free H2O, 16.5 µL of 10x reverse transcription buffer, 11 µL of reverse transcription enzyme, 2.1 µL of RNase inhibitor, and 1.7 µL of dNTP mix. Mix gently, do not vortex.",
    "NOTE: The scale depends on the sample quantity; here, it is calculated for 10 reactions.\nLabel 0.2 mL tubes accordingly and mix 7 µL of the master mix from step 8.1 with 5 µL of the extracted sample from step 7.1.10 and 3 µL of reverse transcription primer. Mix gently, centrifuge shortly, and store the mixture on ice.\nIn order to use the same cell number for each cell line, reduce the sample volume of the cell line with a higher overall cell number; use this as the residual volume to reach the total sample volume of 5 µL of RNase-free water.\n\tNOTE: The lipoprotein particle samples are already normalized in step 7.2.1. For standard curve preparation, dilute an aliquot of miRNA sequentially in RNase-free water and calculate the number of strands per sample volume. Required are at least five data points within the range of the resulting sample quantification cycle (cq) values. Usually, total dilution factors ranging from 102 to 106 are suitable.\nPlace tubes into the thermocycler machine and start the following program: 30 min at 16 °C (annealing step), 30 min at 42 °C (reverse transcription), 5 min at 85 °C (melting step), and pause at 4 °C (storage). Perform the qPCR step immediately after reverse transcription; otherwise, store the complementary DNA (cDNA) synthesized from the miRNA samples at -20 °C.\n9. qPCR\nPerform a qPCR of the cDNA (reverse transcribed from miRNA) using a commercially available assay (see the Table of Materials) with the following modifications.\nThaw all reagents (supermix, RNase-free H2O), cDNA samples (from step 8.4), and the primers on ice. Prepare the following master mix in a reaction tube on ice: 75 µL of supermix, 47.5 µL of RNase-free H2O, 7.56 µL of primer. Mix gently, do not vortex.",
    "NOTE: The scale depends on the sample quantity; here, it is calculated for 10 reactions.\nLabel 0.2 mL tubes accordingly and add 2 µL of the cDNA sample to 13 µL of the master mix and mix gently. In general, measure each sample 2x.\n\tNOTE: At least two negative control samples are required additionally—use RNase-free water as a sample. If the calibration curve is not determined in the same run as the sample, one sample from the calibration curve measurement is also required. It is used to calibrate each individual run to the same reaction efficiency.\nPlace the tubes in the PCR machine and start the following program: 2 min at 50 °C, 10 min at 95 °C, 15 s at 95 °C, and 60 s at 60 °C. Repeat the last two steps of the program up to 50x.\nFor an analysis of the cq values with the PCR machine’s software package, activate DynamicTube Normalization (for the compensation of different background levels using the second derivative of each sample trace) and Noise Slope Correction (normalization to the noise level).\n\tNOTE: The cq value of the negative control should be several cycles higher than the highest sample cq value.\n\t\nFor a calibration curve analysis, determine the threshold for the calculation of the cq for each miRNA from the standard curves of each miRNA individually, using the Auto-find threshold function of the software package, and keep it constant for each specific miRNA.\nFor sample analysis, if necessary, compensate for different reaction efficiencies of the sample run with the data point from the calibration curve sample. The software calculates the cq values of the samples from the threshold level of the respective calibration curve measurement.\n10. Calculation of miRNA content\nCalibration curve",
    "Calculate, from the initial number of miRNA strands per aliquot (100 µL of 10 µM miRNA, molecular weight from datasheet) and the subsequent serial dilution steps, the number of miRNA strands in the sample volume (the 5 µL sample volume from step 8.3).\n\t\tNOTE: Assuming a reverse transcription efficiency of 1, this number is equal to the number of cDNA strands.\nCalculate the number of cDNA strands in the sample volume of 2 µL from step 9.3. Consider thereby the additional dilution factor of 7.5 (the 2 µL sample volume from step 9.4 from the 15 µL sample volume from step 8.4).\nPlot the cq value from step 9.5.1 against the number of strands nstrands calculated in step 10.1.2 in a base-10 semilogarithmic plot, and fit the data points with the following regression curve (M = the slope of the linear regression curve, B = offset).\nimgsrc://cloudfront.jove.com/files/ftp_upload/59573/59573eq3.jpg\n\t\tConfirm that the correlation coefficient (R2) for the line is >0.99.\nLipoprotein particles\nCalculate the number of miRNA strands per sample volume using the measured sample cq value (step 9.5.2) and the following equation (M and B are the calibration curve parameters of the specific miRNA).\nimgsrc://cloudfront.jove.com/files/ftp_upload/59573/59573eq4.jpg",
    "Calculate the corresponding number of lipoprotein particles in the sample volume, starting from the volume in step 7.2.1 (100 µL), its known concentration, and the subsequent dilution steps (100 µL -> 30 µL sample volume in step 7.1.10 -> 5 µL [dilution 1:6] sample in the 15 µL total volume in step 8.4 -> 2 µL [dilution 1:7.5] in step 9.4). Assume a molecular weight of 250 kDa for HDL particles and 3 MDa for LDL particles and a 100% recovery of miRNA during the miRNA extraction step (ignoring any lipid contribution to the molecular weight yields a slight overestimation of the number of miRNA strands per lipoprotein particle).\nDivide the number of miRNA strands from step 10.2.1 by the number of particles calculated in the previous step to yield the number of miRNA strands per lipoprotein particle.\nCells\nCalculate the number of miRNA strands per sample volume according to step 10.2.1.\nCalculate the corresponding number of cells in the sample volume according to step 10.2.2, starting with the initial cell number concentration measured in step 6.4.\nDivide the number of miRNA strands from 10.3.1 by the number of cells calculated in the previous step to yield the number of miRNA strands per cell.\nCalculate the uptake rate of lipoprotein particles by dividing the total amount of miRNA strands from the previous step after correction for the background miRNA level of the cells obtained from a negative control experiment by the miRNA/particle ratio (step 10.2.3) and the incubation time (16 h, see step 6.2).\n11. Multiwell microfluidic arrays\nmiRNA extraction\nPerform miRNA extraction as described in step 7.\nReverse transcription",
    "Thaw the reverse transcription primers, the reverse transcription kit components, and MgCl2 (25 mM) on ice. For eight samples, mix 8 µL of reverse transcription primers (10x), 2.25 µL of dNTPs with dTTP (100 mM), 16.88 µL of reverse transcriptase (50 U/µL), 9.00 µL of 10x reverse transcription buffer, 10.12 µL of MgCl2, 1.12 µL of RNase inhibitor (20 U/µL), and 1 µL of nuclease-free water.\nMix gently and centrifuge briefly. Add 4.3 µL of reverse transcription reaction mix to 3.5 µL of extracted miRNA in a tube and mix, spin down, and incubate on ice for 5 min. Place the tubes in a thermocycler machine and start the following program: 16 °C for 2 min, 42 °C for 1 min, and 50 °C for 1 s repeated 40x in total, and then, as stop reaction, 85 °C for 5 min and hold at 4 °C until stopped.\nPreamplification\nThaw the primers on ice and invert and centrifuge briefly. Mix the preamplification master mix (2x) by swirling the bottle. Prepare the preamplification reaction mix according to the following instruction for eight samples: 112.5 µL of preamplification master mix (2x), 22.5 µL of preamplification primers, and 67.5 µL of nuclease-free water. Invert and centrifuge briefly.\nMix 2.5 µL of the reverse transcription reaction product from step 11.2.2 with 22.5 µL of preamplification reaction mix from the previous step and invert and centrifuge briefly. Incubate the samples on ice for 5 min.",
    "Place the tubes in a thermocycler machine and incubate at the following settings: enzyme activation at 95 °C for 10 min, annealing at 55 °C for 2 min, extending at 72 °C for 2 min, repeated 12x: denaturing at 95 °C for 15 s and annealing/extending at 60 °C for 4 min, enzyme inactivation at 99.9 °C for 10 min, and 4 °C on hold.\nSpin down, add 7.5 µL of 1x TE (pH 8.0) and 67.5 µL of nuclease-free water, invert, and centrifuge briefly. The samples can be stored at -20 °C for up to 1 week.\nqPCR\nMix the master mix by swirling the bottle. Prepare the PCR reaction mix for one card: 450 µL of master mix, 441 µL of nuclease-free water, and 9 µL of the preamplification sample from step 11.3.4. Invert and centrifuge briefly.\nLoad each fill reservoir of the multiwell microfluidic array card with 100 µL of prepared PCR reaction mix according to the manufacturer’s instructions and centrifuge 2x for 1 min at 3,000 x g. The acceleration during the two consecutive centrifugation steps is important for properly filling the card. Seal the card according to the manufacturer’s instructions.\nUse a PCR system with the following program: enzyme activation at 95 °C for 10 min and then, repeated 40x: denaturing at 95 °C for 15 s and annealing/extending at 60 °C for 1 min.",
    "Import the results file from the PCR system and calculate the RQ values using the system’s software package with the following analysis settings: a maximum allowable cq value of 40.0, maximum cq values in calculations included, and outliers among replicates excluded. Activate the Benjamini–Hochberg false discovery rate as option for p-value adjustment (correction of the occurrence of false positives14) and global normalization as normalization method (using a median threshold value for all samples15)."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}