{
  "id": 7232,
  "origin_website": "Bio",
  "title": "<em>In vivo</em> CD40 Silencing by siRNA Infusion in Rodents and Evaluation by Kidney Immunostaining",
  "procedures": [
    "Synthesis and preparation of siRNAsRequirements: Disposable gloves, heated water bath, microcentrifuge, automatic pipettes (1-10 μl, 20-200 μl), Jasco V-650 spectrophotometer, RNAase-free 1.5-ml polypropylene tubes, ice, nuclease-free water, annealing buffer (10 mM Tris pH 7.5, 20 mM NaCl), 3 M sodium acetate (pH 5.2), isopropanol, 70% ethanol, oligonucleotides.Design of anti-CD40 oligonucleotides.Analyze the target mRNA sequence (herein murine CD40, NCBI accession X60592.1) to select a number of sequences that comply with the following structure, 5’-GN17C-3’. Nine different sequences were generated to select an optimal target site (Pluvinet et al., 2004). General rules to improve the effectivity of siRNA silencing are: 1) presence of G/C at the 5’ end of the sense strand; 2) presence of A/U at the 5’ end of the antisense strand; 3) presence of at least 5 A/U residues in the first 7 bases of the 5’ end of the antisense strand; 4) no runs of more than 9 G/C residues should be allowed in the sequence (Ui-Tei el al., 2004); 5) secondary structure at the target site should be kept to a minimum (Bohula et al., 2003; Kretschmer-Kazemi Far and Sczakiel., 2003).Annealing of oligonucleotides to generate ds-siRNAs.For oligonucleotide annealing, mix equimolar amounts of complementary sense and antisense strands of the different anti-CD40 and control siRNAs by mixing:Oligonucleotide 1/sense strand (100 pmol/µl)………………………………………10 µlOligonucleotide 2/antisense strand (100 pmol/µl)……..…...……………………10 µl2x oligo annealing buffer (10 mM Tris, pH 7.5, 20 mM NaCl)…………………50 µlNuclease-free water (up to) ………………………………………..………………………100 µlHeat for 3 min at 90°C in a water bath and switch it off.Let the tubes cool down slowly in the water bath to room temperature (<60 min). The final concentration should be 100 pmol/µl ds-siRNA.Store the annealed ds-siRNA oligonucleotides at 4°C for immediate use or at -20°C for longer storage.Determination of the melting temperature (Tm) of the ds-siRNAs.",
    "Heat samples in the Jasco V-650 spectrophotometer using a linear temperature ramp of 0.5°C/min. Melting temperature is obtained as the maximum of the first derivative. The melting point of the unmodified CD40 ds-siRNA is 79°C and that of the cholesterol-derived CD40 ds-siRNA (antiCD40-siRNAChol) is 71°C.Alcohol precipitation of ds-siRNAs.Add a 0.1 volume of 3 M sodium acetate (pH 5.2) and 1 volume of isopropanol, mix.Keep on ice for 5 min and spin down at the top speed in a microcentrifuge for 10 min.Carefully aspirate the supernatant, wash the pellet with 0.5 ml cold 70% ethanol, and carefully remove all ethanol.Air-dry the pellet for no longer than 15 min at room temperature and resuspend the ds-siRNA in nuclease-free water in 2-5-times the original volume.Quantitate the siRNA concentration using a NanoDrop or equivalent. The final concentration should be 20-50 pmol/µl.Analyze the siRNA on a non-denaturing 12% polyacrylamide gel (see Recipes) for size and integrity, and store at -20°C or -70°C.Mix up to 5 μl oligonucleotides with 2 μl loading buffer (see Recipes).Load the sample on a non-denaturing 12% polyacrylamide gel and subject to electrophoresis at 200-250 V.Stop electrophoresis when the Bromophenol Blue dye front has migrated two-thirds of the way down the gel.Stain the gel for 2-5 min in a 1 μg/ml solution of ethidium bromide.Soak the gel for 2-5 min in water.Visualize the siRNA using a UV transilluminator.The siRNA should migrate as a 21-22 bp band that runs slightly behind the Bromophenol Blue dye front. A second, less intense band running behind the primary siRNA band may be apparent and represents one partially digested strand of siRNA. The underdigested RNA strand is 27 nt in length and does not create any non-specific effects when used to transfect cells.",
    "Determination of the silencing ability of anti-CD40-siRNAChol using the GeneEraser Luciferase Suppression-test systemRequirements: Disposable gloves, 96-well plates, automatic pipettes (1-10 μl, 20-200 μl), cell scrapers (Sarstedt AG & CO, Nümbrecht, GE, catalog number: 83.3950), microcentrifuge, ice, 0.5-ml polypropylene tubes, pTarget-luc-rCD40, Oligofectamine, HEK-293 cells, Polyfect transfection reagent, 70% ethanol, 1× phosphate-buffered saline (PBS), 1× lysis reagent, luciferase assay reagent, TD-20/20 luminometer.Generate the apTarget-luc-CD40 plasmid.A blunt-end 506 bp fragment corresponding to the partial rat CD40 cDNA sequence (coding sequence of nucleotides 41-547; GenBank Acc. No AF241231) was blunt-end cloned into the plasmid pTarget-luc at the 3'UTR of the luciferase gene.Transfect HEK-293 cells with siRNAs (100 nM).Prepare a 100 nM solution of the ds-siRNAs, transfect confluent HEK-293 cells using Oligofectamine according to the manufacturer’s instructions.After 6 h, transfect the above cells with 400 ng pTarget-luc-CD40 using Polyfect transfection reagent according to the manufacturer’s instructions. Normalize the transfection efficiency by co-transfecting 500 ng pCMV-bGal.Incubate the cells for 48 h at 37°C in a humidified atmosphere with 5% CO2.Prepare cell lysates for analysis.Remove the growth medium from the cultured cells.Rinse the cells in 1× PBS and remove as much as possible.In a 96-well plate, dispense 20 µl/well 1× lysis reagent (1× lysis reagent is prepared by adding 4 vol. water to 1 vol. 5× lysis reagent from the kit).Scrape the cells from the dish and transfer the solution to a microcentrifuge tube.Pellet the cell debris by brief centrifugation and transfer the supernatant to a new tube.Mix 20 µl cell lysate with 100 µl luciferase assay reagent and measure the light in the TD-20/20 luminometer.",
    "Bone marrow-derived dendritic cell (DC) extraction, culture, activation, and transfection with siRNAs in vitro Requirements: Disposable gloves, 50-ml Falcon conical tubes (Corning, catalog number: 45352054), 70-μm nylon cell strainers (BD Biosciences, catalog number: 45352350), autoclaved materials (forceps, scalpels, scissors), cell culture hood, ice, mice femurs and tibiae, hemocytometer, cell culture plates, sample collection tubes, Oligofectamine 2000, BD FACS lysing solution, complete RPMI 1640 medium (RPMI 1640 medium supplemented with 100 U/ml penicillin, 100 µg/ml streptomycin, 2 µM L-glutamine, 10% heat-inactivated FBS, and 20 ng/ml GM-CSF), Opti-MEM medium, propidium iodine (stock solution: 1.5 mM), siRNAs, LPS, cytometer.Euthanize ICR mice according to the institutional guidelines and extract the femurs and tibiae.Place each mouse onto a sterile surgical pad in a sterile hood.Spray the mouse with 70% ethanol to avoid contamination of the samples.Soak the femurs and tibiae in RPMI 1640 medium.Harvest the bone marrow (BMC).Note: All work should be performed under sterile conditions in a cell culture hood. Cut the femurs at both ends with sterile scissors.Transfer the bones to RPMI 1640 in a sterile Petri dish.Vigorously flush the inside of the bones with 1 ml ice-cold RPMI 1640 medium using a 1-ml pipette. Flush 2-3 times until the bones are completely white.Flush the bone marrow out onto a 70-μm nylon cell strainer placed in a 50-ml Falcon conical tube.Smash the bone marrow through the cell strainer using a 5-ml plunger, and wash the strainer with 5 ml RPMI.Centrifuge the cells at 250 × g for 8 min at 4°C and discard the supernatant.Resuspend the cell pellet in 1 ml RBC lysis buffer and incubate for 5 min at room temperature.Neutralize the lysis buffer by adding 5 ml FBS.Centrifuge the cells at 250 × g for 8 min at 4°C, discard the supernatant, and resuspend in 5 ml RPMI 1640 medium.",
    "Take out an aliquot of cell suspension to count.Determine the total number of cells obtained.a. Dilute 10 μl bone marrow suspension in 90 μl 1× BD FACS lysing solution (see above).b. Count 10 μl cell suspension using a hemocytometer.Grow 5 × 106 cells.Grow cells in 5 ml complete RPMI 1640 medium (see above) supplemented with 10 ng/ml IL-4 and 20 ng/ml GM-CSF in T25 flasks at 37°C in a humidified atmosphere with 5% CO2.After 24 h, some of the cells adhere to the plate but many others are suspended in the culture medium. Colonies appear after 72 h. The number of adherent cells gradually decreases over time and on day 5, the suspended cells with dendritic protrusions gradually increase. On day 7, the suspended cells begin to aggregate and the protrusions elongate.Change the culture medium on days 3 and 5.Remove the medium carefully so as not to disturb the growing cells.Briefly centrifuge (250 × g for 8 min) the removed volume of media since DCs are only loosely adherent. Resuspend the cell pellet in the same flask with 10 ml fresh RPMI 1640 supplemented with 20 ng/ml GM-CSF.Harvest BMDCs (day 8)Collect non-adherent cells by gently pipetting the culture medium, and transfer into sterile 50-ml centrifuge tubes. Discard the adherent cells that include macrophages.Loosely adherent BMDCs become easily dislodged into suspension by this process, while macrophages remain adhered to the Petri dish.Count the total number of cells obtained.Transfect with siRNAs on day 8.Incubate 1 × 106 immature BMDCs/ml with 2 µM unmodified siRNA-Cy5.5 or Chol-siRNA-Cy5.5 (see Section E of the Materials and Reagents section, above) using the cationic lipid Oligofectamine 2000 in Opti-MEM medium on 6-cm dishes.Treat immature BMDCs with 100 ng/ml LPS on day 9 for 12 h.Harvest BMDCsCollect all the cells (detach cells with a scraper).",
    "Centrifuge the cells at 250 × g for 8 min.Remove the supernatant and resuspend the cell pellet in 5 ml PBS (wash 1)Centrifuge the cells at 250 × g for 8 min.Remove the supernatant and resuspend the cell pellet in 5 ml PBS (wash 2)Centrifuge the cells at 250 × g for 8 min.Resuspend the cell pellet in 1 ml RPMI 1640 supplemented with 10% FBS and 20 mM penicillin/streptomycin.Count the cells.Stain the DCs with a final concentration of ≤1 μg/ml propidium iodide (PI).Prepare a 1 mg/ml (1.5 M) stock solution by dissolving solid PI in PBS. Protect from prolonged exposure to light.Whenever possible, prepare and use the stock solution on the same day. If the stock solution must be made in advance, aliquot and store in tightly sealed vials at -20°C (generally stable for up to 1 month).Resuspend 50 μl cell suspension in 50 μl flow cytometry staining buffer.Add 5 μl PI staining solution per 100 μl cell suspension. Do not wash the cells after the addition of PI.Incubate for 5–15 min on ice in the dark.Analyze the samples immediately by flow cytometry.Characterize the cell phenotype by flow cytometry.Block non-specific Fc-mediated interactions with 0.5 μg anti-mouse CD16/CD32 per 100 μl for 15 min at 4°C before staining.Antibody-binding kinetics are temperature dependent. Staining on ice may require longer incubation times.Aliquot 50 μl cell suspension to each tube (one per antibody).Combine the cell suspension with primary antibodies (the isotype control and the following antibodies: anti-CD11c (clone HL3), anti-CD11b (clone M1/70), anti-CD40 (clone HM40-3), anti-CD80 (clone 16-10A1), and anti-CD86 (clone GL1)) and the appropriate volume of flow cytometry staining buffer to reach a final staining volume of 100 μl. Vortex.Incubate for at least 30 min on ice. Protect from light.",
    "Wash the cells by adding 2 ml flow cytometry staining buffer to each tube.Repeat the wash step twice by centrifuging the cells at 250 × g for 8 min at room temperature.Remove the supernatant and resuspend the pellet in 100 μl flow cytometry staining buffer.Transfer the cell suspension to polypropylene tubes for flow cytometry.For storage of the samples before analysis, add 100 μl IC fixation buffer.Analyze the cells according to fluorescence intensity of the above markers and acquire representative images for subsequent analysis/quantitation.Evaluation of the silencing activity of antiCD40-siRNAChol in in vivo mouse modelsRequirements: Gloves, scalpels, scissors, syringes, towels, cotton, sample collection tubes, 23–25 G needles, mice, siRNAs, PS buffer (see Recipes), isoflurane, isoflurane chamber, portable liquid nitrogen container, liquid nitrogen, and blood collection tubes.Separate the mice into treatment and control groups.Study the in vivo effect of the systemic administration of chol-siRNAs: Use 6-8-week old male ICR mice (4 mice per group). Administer 50 µg antiCD40-siRNAChol or s/s-control siRNAChol via i.p. injection (10 ml/kg in 0.2-µm-filtered PBS). At predefined time points (days 0, 1, 3, 5, 7, and 9), administer single doses of 5 µg LPS from E. coli via i.p. injection. Euthanize animals 4 h post-administration of LPS.For the lupus nephritis study with 5-month-old NZB/NZW F1, set up the following groups:CYP: Administer 50 mg/kg i.p. every 10 days (n = 9).CTLA4: Administer 50 μg abatacept (Orencia, Bristol Myers Squibb) three times weekly (n = 9).siCD40-1w: Administer 50 μg anti-CD40-siRNAChol i.p. once weekly (n = 9).siCD40-2w: Administer 50 μg anti-CD40-siRNAChol i.p. twice weekly (n = 9).Control: Administer 50 μg s/s-control siRNAChol i.p. twice weekly (n = 15).For the atherosclerosis study with 8-week-old female ApoE-/- mice. Treat the mice twice weekly i.p. with 50 μg anti-CD40-siRNAChol, s/s-control siRNAChol, or vehicle (5 mice per group).",
    "Euthanize the animals at 8 weeks (basal group), 10 weeks, 14 weeks, or 24 weeks.Tissue collection: urine and venous blood.Place the animals in individual metabolic cages with water and the usual diet, and collect 24 h urine specimens before the onset of treatment and thereafter at monthly intervals.Note: If mice do not produce urine in the given time, repeat the procedure on the following day in a warmer room. Centrifuge the urine samples at 500 × g for 10 min. Collect the urine and retain the sediment for further studies; store the urine and sediment at -20°C.Determine the weight of the mice twice monthly.On a monthly basis, perform a non-terminal venous blood collection from the tail vein (without replacement of fluids) using short-term anesthesia by isoflurane inhalation.Important points to remember for animal comfort: Make the animal comfortable by maintaining the temperature at 24-27°C.DO NOT rub the tails from the base of the tip as this will result in leukocytosis. If the vein is not visible, dip the tail into warm water (40°C).Insert a 23-25 G needle into the blood vessel and collect blood using a capillary tube or syringe with a needle. In case of difficulties, cut a minimal surface of the skin, prick the vein with a bleeding lancet or needle and collect blood with a capillary tube or a syringe with a needle.DO NOT try to collect blood more than three times. The maximum collection volume should be 0.2 ml blood per mouse. The estimated blood volume in an adult animal is 55-70 ml/kg body weight (Parasuraman et al., 2010).After completing blood collection, stop the bleeding using pressure.Wash the restraint frequently to avoid pheromonal-induced stress or cross infection.At the end of the study, extract arterial blood by cardiac puncture.Perform terminal anesthesia of animals in an isoflurane chamber.",
    "Open the chest (thoracotomy) and obtain a blood sample directly from the ventricle, taking care not to collapse the heart.Tissue collection: liver and kidneysEuthanize all mice by inhalation of isoflurane.Dissect out the kidneys and liver through the abdomen and wash them by perfusing ice-cold 1× PBS via the left ventricle.Resect the kidneys. One kidney will be used for histological evaluation and the other for total RNA extraction.For histological analysis, remove the upper third of the kidney to ensure that both cortical and juxtamedullary glomeruli are present and fix the piece in 5 ml PS buffer at 4°C for 24-48 h.For immunofluorescence analysis, place a third of the kidney piece (to ensure that both cortical and medullary glomeruli are present) into the tissue mold and coat in OCT. Place it onto dry ice to freeze and store at -80°C.For protein and RNA extraction, place 3 × 2 mm3 pieces of kidney cortex and liver into 0.5 ml plastic tubes and snap freeze them in liquid N2. Store at -80°C. For long-term tissue storage for RNA extraction, place the tissue in five volumes of RNA stabilization reagent and store at -80°C.RNA extraction and purification from kidney tissue.Requirements: Disposable gloves, laboratory fume hood, RNase-free pipettes and pipette tips, sterile plasticware, cold TRIZolTM, rotor-stator homogenizer (ULTRA-TURRAXTM), ice, round-bottomed RNase-free tube for tissue homogenization, RNase-free water (water treated with DEPC, see Receips), tabletop centrifuge, 2 ml RNAase-free Eppendorf tubes, NanoDrop, PureLink RNA mini kit, chloroform, 70% ethanol (100% ethanol mixed with RNAse free water), vortex.Add 1 ml cold TRIzol to 50-100 mg renal tissue in a round-bottomed RNase-free tube, homogenize on ice. Avoid foaming by keeping the tip of the probe submerged in the lysis solution while holding the tip against the tube wall.",
    "Incubate for 5 min at room temperature to allow complete dissociation of the nucleoprotein complex.Add 0.2 ml chloroform and vortex.Incubate for 2-3 min at room temperature.Centrifugate the sample for 15 min at 12,000 × g, 4°C.The mixture separates into a lower red phenol-chloroform phase, an interphase, and a colorless upper aqueous phase. Carefully transfer the aqueous phase to a 2-ml Eppendorf tube (important: avoid transferring any of the interphase or organic layer).Add one volume 70% ethanol and vortex.Transfer ≤700 μl sample to the spin cartridge and purify total RNA according to the kit instructions (in this case the PureLink RNA mini kit).Quantify the total RNA using the NanoDrop.First strand DNA synthesis (reverse transcription).Requirements: Ice, RNase-free water, tabletop centrifuge, Eppendorf tubes, High-Capacity cDNA Reverse Transcription kit, thermal cycler, 70% ethanol, vortex.The reverse transcription reaction is performed according to the instructions of the kit used (in this case the High-Capacity cDNA Reverse Transcription) using 500 ng RNA.Determine CD40 mRNA expression in the kidney and liver by qPCR.Set up reactions with CD40 primers (Mn_00441891_m1; Taqman gene expression assays from ABI/ThermoFisher Scientific, Waltham, MA, USA).Analysis of anti-CD40-siRNAChol-directed cleavage products by 5’RACE.Requirements: Gloves, total RNA (from section C1), thermocycler, cDNA synthesis kit, 5’RACE kit.Synthesize first strand cDNA from 5 μg total RNA (kidney) using the High-Capacity cDNA RT Kit with the gene-specific primer #1 (GSP1): 5’-GCCGACTGGGCAGGGATGACAGACG.Ligate the adaptor oligonucleotide from the 5’RACE kit to the 5’ end of the cDNA.Specifically amplify cleavage products using a primer complementary to the adaptor (5’RACE kit) and the nested gene-specific primer #2 (GSP2): GSP2: 5’-AGCCAGGGATACAGGGCGTGTGC.",
    "Use the following PCR program: 1 m, 94°C × 60 s and 35 cycles of 94°C × 30 s, 55°C × 30 s and 72°C × 60 s, followed by a final extension of 72°C × 5 minCheck for the presence of a 310 bp amplification product, corresponding to CD40 mRNA specifically cleaved by the anti-CD40 siRNA.Use 20 μl PCR product for analysis on a 1% ethidium bromide-stained agarose gel by electrophoresis with a corresponding DNA molecular weight marker.Histological evaluation of renal lesions in siRNA-treated animals.In this section, we will prepare kidney samples for standard histological analysis (embedded in paraffin), immunofluorescence analysis (in OCT), and protein and RNA analysis (stored in RNA stabilization solution).Requirements: One of the kidneys obtained in section D2, gloves, ice-cold 1× PBS, tissue molds and cassettes, forceps, paraffin, paraffin dispenser, cold plate, PS buffer (see Recipes), 15% sucrose, 4% paraformaldehyde (PFA), OCT, dry ice, RNA stabilization reagent, high-density polyethylene (HDPE), 50% ethanol, 70% ethanol, 96% ethanol, absolute ethanol, deionized water (MilliQ or similar), microtome.For standard histological analysis.Remove the upper third of a kidney to ensure that both cortical and juxtamedullary glomeruli are present and fix the piece in 5 ml PS buffer at 4°C for 24-48 h. Place the tissue in a labeled cassette (use a pencil, as solvents will dissolve the ink) and prepare for paraffin embedding.Dip cassettes in a wide-mouth high-density polyethylene (HDPE) 1 L jar filled with 15% sucrose for 24 h before embedding in paraffin blocks.Dip in 50% ethanol for 2-3 days.Dip in 70% ethanol for a minimum of 3 h (but can be maintained for up to 7 days).Dip in 96% ethanol overnight.Dip in absolute ethanol for a minimum of 3 h.Wash with clearing agent (xylene) for 1 h at room temperature.Perform a first paraffin wax at 60°C overnight.",
    "Perform a second paraffin wax at 60°C for a minimum of 3 h.Place a small amount of molten paraffin in the mold (dispense from a paraffin reservoir). Use warm forceps, transfer the tissue into the mold cut side down, as it was placed in the cassette.Transfer the mold to a cold plate and gently press the tissue flat. Paraffin will solidify in a thin layer that holds the tissue position.When the tissue is in the desired orientation, add the labeled tissue cassette to the top of the mold as a backing. Press firmly.Hot paraffin is added to the mold from the paraffin dispenser. Be sure that there is enough paraffin to cover the face of the plastic cassette. If necessary, fill the cassette with paraffin while cooling, keeping the mold full until solid.Paraffin solidifies in 30 min. The paraffin block can then be removed and sectioned. If the wax cracks or the tissues are not well aligned, melt them again and start over. Tissue blocks can be stored at room temperature for years.Tissues are sectioned using a microtome (Leica RM 2155).Turn on the water bath and check that the temperature is 45°C. Use 1 L fresh deionized water and add 1 g jelly from porcine skin (G1890, Sigma-Aldrich, Sant Louis, MO, USA). Place a fresh blade on the microtome (blades may be used to section up to 10 blocks, but replace if sectioning becomes problematic). The blade should be angled at 5°. Blocks to be sectioned are placed face down for about 15 min on an ice block (cold wax allows thinner sections). After cutting, use forceps to pick up the ribbons of sections and float them on the surface of the water in the water bath to allow for expansion of the sample.",
    "Insert the block into the microtome with the wax block facing the blade, and align the vertical plane. Set the dial to cut 10-μm sections in order to plane the block; once cutting smoothly, set to 2–3 μm-thick sections. Face the block by cutting it down to the desired tissue plane and discard the paraffin ribbon.If the block is ribboning well, cut another four sections, pick them up with forceps or a fine paint brush, and float them on the surface of the water in the 45°C water bath. Float the sections onto the surface of clean glass slides.If the block is not ribboning well, place it back on the ice block to cool for a longer period to harden the wax.If the specimens are fragmented when placed in the water bath, then it may be too hot.Place the slides on the warming block in a 60°C oven for 10 min (so the wax starts to melt) to bond the tissue to the glass. Slides can be stored overnight at room temperature.For immunofluorescence analysis.Place the other pole of the kidney into a tissue mold, coat in OCT, and place it onto dry ice to freeze. Store at -80°C.Place a small amount of molten OCT (tissue freezing medium, Leica Ref = 14020108926, Leica Biosystems, Richmond, IL) in the mold.Using forceps, transfer the tissue to the mold, cut side down.Pour liquid N2 into a polystyrene box containing a 50-ml tube rack (do not submerge the tube rack in the liquid N2). Place the OCT mold on the tube rack and freeze using the vapor.Wrap with foil and snap freeze in liquid N2 until storage at -80°C.For protein and RNA extraction.Place 3 × 2 mm3 pieces of kidney cortex into 0.5-ml plastic tubes and snap freeze in liquid N2. Store at -80°C.",
    "For long-term tissue storage for RNA extraction, place the tissue in five volumes of RNA stabilization reagent and store at -80°C.Direct immunofluorescence analysis of IgG and C3 deposits in the kidney.Requirements: OCT-embedded kidney samples, gloves, ice-cold 1× PBS, cryostat, poly-L-lysine-coated slides (Merck KGaA, catalog number: P0425) or FLEX IHC microscope slides (Agilent, Ref. K8020, Santa Clara, CA, USA), 4% PFA (see Recipes), acetone, blocking solution, conjugated primary antibodies (FITC-conjugated goat anti-mouse IgG, FITC-conjugated goat anti-mouse C3), UltraCruz Tm mounting medium, and DRAQ5.Prepare the kidney slides for immunofluorescence analysis.Place the OCT compound mold containing frozen kidney (section D3) at -20°C for 2 h prior to sectioning. Ensure that the [cut] surface of the kidney is carefully placed against the bottom of the OCT mold to enable well-oriented tissue sections.Use a cryostat to cut 5 µm-thick sections and place them on the surface of poly-L-lysine-coated slides or FLEX IHC microscope slides. Ensure that there are no folds or holes in the tissue section, which can distort tissue morphology. As positive IF controls, use samples of human parotid glands or ganglions; and as negative controls, omit the primary antibodies from the staining process. For the isotypic control, use an irrelevant immunoglobulin of the same isotype, species, and concentration as the primary antibody.Upon removal from the cryostat, keep at room temperature for 20 min and then fix the slides by submerging into ice-cold pure acetone for 20 min.Wash the slides 3 times with 100 µl PBS for 10 min each.Wash the slides twice with distilled water for 5 min each.Incubate the slides in blocking solution (20% normal goat serum in 1× PBST + 0.2% jelly from porcine skin) overnight at 4°C.Wash the slides 3 times with 100 µl PBS for 10 min each.",
    "Incubate the sections with primary antibodies (FITC-conjugated goat anti-mouse IgG at 1:300, and FITC-conjugated goat anti-mouse C3 at 1:50) in PBST-jelly buffer containing 1% normal serum. Incubate the slides for 1 h at room temperature in a humidified chamber to avoid the tissue drying out, which would lead to non-specific binding and high background staining.Wash the slides 3 times in PBS for 5 min each. Primary antibodies can be saved for subsequent experiments.Mount the samples with a drop of mounting medium containing 1 µg/ml DRAQ5.Analysis of CD40 expression in the kidney by immunostaining with horseradish peroxidase (HRP).Requirements: Gloves, paraffin blocks, pressure cooker, timer, 1× PBS, 0.01 M citrate buffer pH 6, 1% Triton X-100 in PBS, 0.1% fish jelly, bovine serum albumin (BSA), xylene, absolute ethanol, primary antibodies (optimal dilutions and incubation times should be determined for each primary antibody prior to use), biotinylated secondary antibody (135 μl normal serum + 45 μl biotinylated secondary antibody from the ABC staining kit in 10 ml PBS), humidified chamber, ABC (avidin-biotin complex) peroxidase standard staining kit (prepare reagent 30 min before use), DPX mounting medium, DAB substrate.Controls: Prepare a negative control with diluent alone (without antibodies) and a positive control with a tissue known to contain the antigen of interest.Prepare kidney slides for HRP analysis.Deparaffinize the samples from section D5 by performing standard xylol-ethanol washes.Wash the slides 3 times in 1% PBS for 5 min each.Block endogenous peroxidase activity with a methanol wash (30% methanol in PBS + 1% peroxide hydrogen) for 10 min.Note: Place the slides on a flat surface. Do not allow the slides to touch each other. Do not allow the sections to dry out. Wash three times in 1% PBS for 5 min each.",
    "Facilitate antigen retrieval by heating the samples for 5 min in a pressure cooker (on a plastic rack for slides) containing 10 mM citrate buffer, pH 6. This will break protein cross-links after formalin fixation.Allow to cool slowly at room temperature for 30 min.Wash twice in 1% Triton X-100 in PBS (PBST) for 5 min each.To minimize cross-reactivity and reduce non-specific binding caused by hydrophobic interactions, pre-incubate with 20% normal goat (NGS) or horse serum in PBS-Triton + 0.2% jelly at 4°C for 2 h. Remove excess fluid from the slides using a brisk motion and carefully wipe each slide around the sections.Incubate with primary antibody (anti-CD40 at 1/100, anti-DC-SIGN at 1/50; anti-NF-κB at 1/1,000) in 1% normal goat serum. Apply 100 µl to each slide, covering the tissue sections; tilt each slide from side to side. Incubate in a humidity chamber overnight at 4°C.Keep at room temperature for 30 min.Wash 3 times in 1× PBST for 5 min each.Add 100 µl biotinylated secondary antibodies (at 1/200 + 1% NGS from the Vectastain ABC kit in PBST-jelly). Incubate in the humidified chamber for at least 45 min at room temperature. During this step, it is recommended to prepare the substrate mixture (reagent A = avidin + Reagent B = biotinylated HRP).Wash 3 times in PBST for 5 min each. Wash well to remove traces of sodium azide as this will inhibit peroxidase activity when developing.Add the substrate mixture at 1/100 and incubate for 45 min.Wash 3 times in PBST for 5 min each.Wash 3 times in PBS for 5 min each.Incubate the tissue sections with 50 µl Vector DAB substrate in the dark for 3 min or until the desired color reaction is observed when monitored under the microscope.",
    "Terminate the reaction before background staining appears in the negative controls by rinsing gently with distilled water from a wash bottle. Discharge DAB in the corresponding recipient. All plasticware that come into contact with DAB must be treated with diluted bleach.Wash in running tap water for 5 min.Wash in distilled water.Counterstain with hematoxylin:Add hematoxylin (1 vol. hematoxylin solution + 2 vol. distilled water).Wash with tap water for 5 min.Wash in distilled water.Wash with 70% ethanol for 5 min.Perform three washes with 96% ethanol for 5 min each.Perform three washes with absolute ethanol for 5 min each.Perform three washes with xylene for 5 min each.Mount with DPX.Microscope examination:Sections should be independently examined by two blinded pathologists, and at least 10 fields from each kidney section should be studied at high magnification.Determine the extent of renal damage. Assess typical glomerular active lesions of lupus nephritis: mesangial expansion, endocapillary proliferation, glomerular deposits, extracapillary proliferation, and interstitial infiltrates; as well as tubule-interstitial chronic lesions: tubular atrophy and interstitial fibrosis using a Zeiss SteREOLumar V12 microscope from Carl Zeiss AG (Oberkochen, Germany). Grade the lesions semi-quantitatively using a scoring system from 0 to 3 (0 = no changes, 1 = mild, 2 = moderate, and 3 = severe changes).Quantitate the number of positive cells for each of the markers studied using semi-quantitative evaluation of expression from 0 to 4 (0 = no staining, 1 = staining in <25% of the sample, 2 = staining in 25-50%, 3 = staining in 50–75%, and 4 = staining in 75-100%) in the different compartments of the kidney (glomeruli, vessels, and interstitium). NFκB p65 immunostaining was considered positive when located inside the nuclei.Evaluation of atherosclerotic lesions in mouse aortas.",
    "Requirements: ApoE-/- mice, isoflurane chamber, dissection tools (scissors: straight blunt-ended scissors, straight sharp fine scissors, and micro-dissecting spring scissors; tissue forceps: straight serrated-tip forceps, straight or curved serrated-tip fine forceps, and straight fine-tip forceps), syringes, 23 G and 27 G needles, tubes (one EDTA-coated tube, a serum tube, and two lithium heparin-coated tubes), ice-cold PBS, deionized water, RNAzap, 70% ethanol, ice, liquid N2, microscope, cork bed, pinning bed, needles, scalpel, Oil Red O, minutien pins 0.1-mm, Petri dishes, 6× magnification microscope.Check the extension of ATH lesions in the entire aorta length.Euthanize mice with isoflurane.Spray each mouse with 70% ethanol to avoid contamination of the samples.Excise whole aortas (as modified from Centa et al., 2019) and prepare samples for microscope analysis:Make a midline incision with scissors from the jugular notch to the pubic bone.Exsanguinate the mouse by cardiac puncture through the thorax wall (use a 23 G needle). This procedure usually yields 500 μl blood from a 20-week-old mouse. Collect 4 tubes (one EDTA-coated tube, a serum tube, and two lithium heparin-coated tubes). Keep them at room temperature.Open the abdominal cavity. Cut the parietal peritoneum with scissors in the midline and laterally on both sides.Open the diaphragm and the chest cavity (cut the rib cage as laterally as possible).Make an incision in the right auricle for perfusion fluid drainage. Insert a 27 G needle through the apex of the heart in the cranial direction. Keep the needle fixed in the left ventricle while slowly perfusing with 10 ml ice-cold PBS over a minimum of 2 min.Dissect the liver, spleen, and kidneys.Cut the trachea and oesophagus on the right side of the heart without damaging the aortic arch. Cut the diaphragm and structures attaching the viscera to the retroperitoneum. Leave the heart, aorta, and kidneys in situ.",
    "Fold away the lungs and viscera caudally and cover with a napkin to begin retroperitoneal microdissection of the abdominal aorta (perform microdissection under a microscope at 6× magnification).Dissect the aortic bifurcation (lift the surrounding tissue with forceps and cut under tension with scissors). Dissect the abdominal aorta cranially. Cut the abdominal branches from the aorta and free the aorta proximally through the aortic hiatus in the diaphragm.Remove the adipose tissue covering the thoracic aorta. Dissect dorsally of the thymus (carefully) to free the aortic arch with branches. Continue dissecting the carotid arteries as distally as possible in the thoracic cavity. Neck dissection should include carotid bifurcation.Clean the instruments by sequential rinses in deionized water, RNase decontamination solution, 70% ethanol, and PBS before cutting the aorta.Lift the heart by the apex with the forceps. Cut the aorta close to the heart and place the whole heart in a tube with PBS. The heart may be stored on ice for a couple of hours before continuing with processing and cryo-mounting of the aortic root.Cut the aortic arch and place half in a tube containing 1 ml 4% formaldehyde overnight at 4°C.Dissect the remaining descending aorta, place in a tube, and snap freeze in liquid N2 for RNA analysis.Place the heart on a cork bed with the ventral side facing up. Fix the heart to the cork with a needle through the apex. Hold the base of the heart with anatomical forceps. Cut away the apical 2/3 of the heart between the two auricles with a scalpel (angled 20° caudally in the sagittal plane and 20° cranially in the transversal plane).Embed the aortic root in OCT compound (see section F). Store the specimens in zip lock bags at 80°C until cryo-sectioning.“En face” analysis of the aortic arch and braquiocephalic artery.",
    "Clean the aorta from the remaining periadventitial adipose tissue under a microscope (since Oil Red O stains most hydrophobic and neutral lipids such as triglycerides, diacylglycerols, and cholesterol esters, it is crucial to remove all such tissue at this point). Use scissors and forceps without manipulating or damaging the aorta. Always keep the aorta moist by applying additional PBS when needed.Place the cleaned and fixed aorta in a 1.5-ml tube (one aorta per tube).Add 1 ml 78% methanol to each tube and place on a tilted roller with gentle movement for 5 min. Replace the methanol solution and repeat this step twice.Discard the methanol and add 1 ml fresh Oil Red O.Incubate the tube on the tilted roller for 50-60 min.Transfer the aorta to a clean tube and wash twice with 1 ml 78% methanol for 5 min each on the tilter roller.Discard the methanol and refill the tube with 1 ml PBS.Note: If necessary, at this step, aortas can be stored at 4°C.Prepare a pinning bed: Place a sheet of 25 × 25 mm paraffin-wax film, wrapped with black electrical insulation tape, on a cork bed to make a dark background for the aorta. Place a label on the backside of the pinning bed and use a lead pencil to write the mouse identification number (normal pen ink will disappear in the staining process).Transfer the fixed aortic arch to the pinning bed and place a drop of PBS on top.Remove any small stained remnants of adventitial fat (carefully by microscope examination).Cut open the aorta longitudinally to expose the intimal surface. Introduce the tips of a pair of micro-dissection spring scissors into the artery lumen and cut the outer curvature of the aortic arch from the ascending arch to the left subclavian artery.",
    "Begin to cut the outer curvature of the ascending arc in the distal direction and continue to cut open the branches, including the brachiocephalic artery. Continue to cut along the length of the thoracic aorta.Cut open the lesser curvature and fold open the aorta to display the intimal surface.Pin the open arch to the pinning bed using the blunt end of minutien insect pins. Gently bend the pins away from the specimen when in place. Pin the aorta flat on the bed without stretching the specimen. Store the pinned arch facing downwards in a Petri dish filled with PBS at 4°C.Acquire images with a Zeiss steREOLumar V12 microscope connected to a RGB camera (ProgRes C F scan). Place a ruler next to the aorta for calibration of the image.Quantitate the extension of atherosclerotic plaques.Use image analysis software (ImageJ) to determine the lesion area and total intima surface. Lesion quantitation should be performed in a blinded fashion, and it is advisable that a second investigator confirms the results.Calculate the total arch area: In ImageJ, select the “polygon selection” tool and encircle the total arch area by repetitive clicks. Select “measure” in the analyze menu to display the total arch area in the result window.Calculate the lesion-free area: In ImageJ, select the “freehand selection” tool and encircle all plaques (stained in an orange-red color) in the arch area while pressing the Alt key. Click “measure” in the analyze menu to display the lesion-free area in the result window.Calculate the relative lesion area by subtracting the lesion-free from the total arch area and dividing the result by the total arch area.Cryo-sectioning of the aortic root.Set the cryostat temperature at -20°C and section thickness to 10 μm.",
    "Mount the OCT block containing the aortic root on the specimen holder with the ventricular tissue facing outward. While starting to cut, fine-tune the alignment of the section surface to be parallel to the specimen holder.Remove the surrounding excess OCT to make it easier to collect the sections without folds. The aortic root should be positioned perpendicularly to the knife blade.Collect initial control sections on ordinary microscope slides and discard. The first sections should only contain heart muscle tissue. Progress the sectioning by 200 μm. Collect a section and check the progress under a light microscope.When getting closer to the left ventricle outflow tract, check every 100 μm under the microscope. When initial indications of a vessel wall are observed, slow down the pace to 50 μm. When the first aortic valve appears, this will be point zero for collecting sections. It can be difficult to see exactly when the valves appear, but an exact localization is crucial to perform comparations of lesions in the same region.Tilt the specimen toward the point zero valve to align the section plane with the two other valves. This is crucial for obtaining true cross-sections of the aorta. Make a drawing of the aortic root, indicating the valves as they appear, and count every 10-μm section that is cut from the point zero onward. When a second aortic valve appears, slightly tilt the specimen again from the valve to align the specimen with the third valve. The distance from where the first aortic valve leaflet appeared to where all 3 of the aortic valve leaflets appeared together did not exceed 80 μm. The first 5-μm thick section with the 3 aortic valve leaflets was mounted onto a glass slide.",
    "The adjoining 8 sections, including the first, were collected one by one onto 8 glass slides and marked in order from 1 to 8. The 9th section was collected onto the first glass slide, the 10th onto the second glass slide, and so forth, until each of the 8 glass slides held 8 sections. The 8 frozen sections collected on each glass slide covered a distance of 400 μm.Fix the sections collected for Oil Red O staining in 4% formaldehyde for 10 min and for immunohistochemistry or immunofluorescence with ice-cold pure acetone for 10 min. Dry at room temperature for 30 min. Store the sections at -20°C.Capture the images directly using an RGB camera (ProgRes C F scan) attached to a light microscope (NIKON E800). Save high resolution images, preferably in tagged image file (TIFF) format.Morphometric image analysis using ImageJ.The lesion quantitation should be performed in a blinded fashion, and it is advisable that a second investigator confirms the obtained results.Use the area quantitation feature in the image analysis software to define the total vessel area by encircling the external elastic lamina of the aortic vessel. In ImageJ, select the “polygon selection” tool and encircle the area by repetitive clicks. Then select “measure” in the analyze menu. The total vessel area is displayed in the result window.Continue to quantitate the ATH lesions in the intimal layer of the vessel, defined by the internal elastic lamina and the luminal boundary. Usually, lesions on the aortic valves are excluded from measurement. In ImageJ, select the “freehand selection” tool and encircle all plaques while pressing the Alt key. Select “measure” in the analyze menu to display the lesion-free vessel area in the result window.",
    "Calculate the relative lesion area by subtracting the lesion-free area from the total vessel area and dividing the result by the total vessel area. Calibrate the results in the image analysis software according to the magnification used in order to obtain the absolute lesion area in µm2."
  ],
  "subjectAreas": [
    "Immunology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}