{
  "id": 18285,
  "origin_website": "Jove",
  "title": "Comparing the Effects of Electronic Cigarette Vapor and Cigarette Smoke in a Novel In Vivo Exposure System",
  "procedures": [
    "The following protocol has been performed under the guidance and approval of the University of Michigan Institutional Animal Care and Use Committee (IACUC).\n1. Electronic Cigarette-vapor Chamber Assembly\nNOTE: The complete chamber should be placed in a fume hood during use. The chamber here was housed in a temperature controlled and filtered laboratory environment. Investigators may elect to monitor such aspects of the system to ensure consistency of the room air quality. As an option, covering the monitors with a metal cage can prevent rodent tampering while allowing the monitors to sample the interior chamber environment. \nAcquire an anesthesia chamber with air tight removable lid with volume of 20 L.\nUsing a jig saw fitted with a blade appropriate for cutting the material, cut a 10.2 cm diameter hole in the lid of the chamber approximately 7.6 cm from the back edge of the chamber.\nInsert the adjustable vent into the hole and mount into place with any caulk adhesive.\n\tNOTE: Ensure that the adhesive caulk is not accessible to the rodents in the chamber, as they may chew the caulk. To prevent this possible issue, apply the caulk to the outside of the chamber wall to mount the vent.\nCut silicone tubing into two 15 cm segments, and attach ends to either side of a T-connector.\n\tNOTE: Silicone tubing has the potential to react with some components of e-vapor or cigarette smoke. Thus, investigators may consider using non-reactive tubing.\nThread both of the silicone tubes through premade holes near the front of the chamber lid so that the T-connector is inside the chamber. Ensure that the tubing is secured to the lid with either adhesive caulk or electrical tape.",
    "Connect the free ends of the silicone tubing to the output ends of two micro air pumps. Pumps should be mounted to the lid of the chamber with double-sided adhesive tape or caulk.\n\tNOTE: The length of tubing connected to the output end of the pump should be short to limit the amount of vapor collection on the inside surface of the tubing during use.\nWith a new silicone tube, attach one end to the input side of one of the air pumps (Pump A in Figure 1), and cut this tube to approximately 4 cm in length. This is where the electronic cigarette will be inserted during chamber use. Ensure that the diameter of the tube allows for a snug fit around the end of the e-cig.\nWith a new silicone tube, attach one end to the input side of the other air pump (Pump B in Figure 1). This pump will introduce room air into the chamber. As such, the end of the tube must be placed outside the fume hood. The length of this tube is not critical, but should be as short as possible to limit airflow resistance.\nInside the chamber attach two small hooks with double-sided adhesive to hold oxygen and carbon monoxide gas monitors.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55672/55672fig1.jpg\nFigure 1. Schematic of Electronic Cigarette-vapor Chamber.",
    "Chamber is housed in fume hood (not shown). Room air pump (Pump B) introduces room air from outside the fume hood into chamber continuously at 2 L/min. E-cig pump (Pump A) puffs 133 mL of E-vapor over 4 s, with a 30 s rest interval. E-vapor and room air mix prior to being pumped into chamber. Gas monitors continuously measure carbon monoxide (CO) and oxygen (O2) concentrations inside the chamber. E-vapor is exhausted passively through vent into fume hood. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/55672/55672fig1large.jpg]\n2. Cigarette Smoke-chamber Assembly\nNOTE: Virtually any brand of cigarette can be used with this system, however standardized research cigarettes such as the University of Kentucky 1R6F Research Cigarette are cost-effective, reliable, and best for this application.\nFollow steps 1.1 - 1.6, & step 1.9.\nWith a new silicone tube, attach one end to the cigarette lighting device, and the other end to the input side of the air pump (Pump A in Figure 2). The cigarette lighting device should be placed inside the fume hood and outside the chamber during use.\n\tNote: Construction of the cigarette lighting device requires knowledge of metal fabrication and electrical engineering. While a step-by-step guide to construction will not be given here, see supplementary materials for plans.\nWith a new silicone tube, attach one end to the other air pump (Pump B in Figure 2). This pump will introduce room air into the chamber, thus the end of the tube must be placed outside the fume hood.",
    "Cut several 5 mm wide vertical slits in the front wall of the chamber, and mount a computer fan on the outside of the chamber so that it covers this opening. Ensure that the front of the fan is facing towards the chamber such that the fan will blow air into the chamber through this opening.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55672/55672fig2.jpg\nFigure 2. Schematic of Cigarette-smoke Chamber.\nRoom air pump (Pump B) introduces room air from outside the fume hood into chamber continuously at 2 L/min. Pump A draws on lit cigarette for 40 s with rate of 2 L/min, and 20 s later the computer fan evacuates the chamber over 3 min. Smoke and room air mix prior to being pumped into chamber. Gas monitors continuously measure carbon monoxide (CO) and oxygen (O2) chamber concentrations. Smoke is exhausted through vent into fume hood. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/55672/55672fig2large.jpg]\n3. Microcontroller Assembly and Software\nControl the pumping system of the E-cigarette vapor chamber and cigarette smoke chamber by separate microcontrollers. Download the microcontroller software and upload the operating codes provided in the Supplementary Materials[href=https://www.jove.com/files/ftp_upload/55672/supplementary_materials.zip]. The electronic cigarette vapor code will run the room air pump continuously and activate the E-cigarette pump for a 4 s duration every 30 s. The cigarette smoke code will run the room air pump continuously, activate the cigarette pump for 40 s, and activate the computer fan 20 s after the cigarette pump has stopped. The fan will shut off after running for 3 min.\n\tNote: The timing of the pumps and fan can be adjusted as needed. Reference manufacturer instructions on how to upload relevant codes to the microcontroller.",
    "To assemble the microcontroller, connect zip wires, diodes, resisters, and capacitors to the bread board as depicted in Figure 3 and attach alligator-clip wires to the corresponding air pumps (and computer fan for cigarette smoke chamber). House the microcontroller outside of the fume hood if possible.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55672/55672fig3.jpg\nFigure 3. Schematic of Microcontroller.\nSchematic of microcontroller and bread board to operate timing of air pumps and fan. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/55672/55672fig3large.jpg]\n4. Animals\nUse adult rats weighing 450 - 520 g.\nGroup rats according to exposure type (e.g., electronic cigarette, cigarette smoke, room air pumped into chamber).\nAt this time prior to exposure, collect 500 µL of blood in EDTA coated tubes from tail vein using syringe to measure baseline serum cotinine concentration.\nSpin down blood samples at 20,000 x g for 30 min at 4 ˚C and collect serum. Ensure that samples are chilled on ice throughout this process.\nFollowing the manufacturer protocol, assay for cotinine in the serum samples collected. Samples may also be stored at -80 ˚C for later use.\n5. Operating the Electronic cigarette Chamber\nClean the inside of the chamber with 70% ethanol, then with deionized water, and let air dry until the chamber is completely dry (or about 30 min).\nCalibrate gas monitors and mount entire monitor on the wall inside the chamber.\nPlace rats inside the chamber. Note that up to three animals can be exposed simultaneously.\nEnsure the E-cigarette is fully charged with adequate E-liquid and insert the E-cigarette  into input tube. It is critical to ensure that the E-cigarette battery and E-liquid levels are adequate throughout the duration of the 90-min exposure.\nTurn the air pumps on, and start the timer.",
    "During exposure observe the gas monitors to ensure chamber contains >20% O2 and 0 ppm CO.\n\tNote: If oxygen levels fall, the chamber may not be well ventilated or the oxygen monitor may not be appropriately calibrated.\nOnce the exposure time has reached 90 min, remove the E-cigarette and continue to run the gas pumps to vent the remaining vapor. Additionally, the top of the chamber can be lifted to hasten ventilation.\nOnce the vapor has cleared, remove the rats and clean the chamber.\nCollect 500 µL blood from tail vein from each rat approximately 1 h after exposure at the conclusion of the experimental protocol.\nFollow steps 4.4 - 4.5 to isolate serum and assay for cotinine.\n6. Operating the Tobacco Cigarette Chamber\nFollow steps 5.1 - 5.3.\nInsert cigarette into cigarette lighting device, with the end of the cigarette against the heating elements.\nTurn on the cigarette lighting device until cigarette butt begins to smolder (about 5 s).\nOnce the cigarette is lit, turn on the pumping system, start the timer, and observe the cigarette burn to completion (about 40 s).\nOnce the cigarette has burned, carefully remove the spent cigarette from the cigarette lighting device with forceps.\nEnsure that CO levels do not rise above 1000 ppm and O2 levels do not fall below 20%. Computer fan timing and duration is critical in preventing carbon monoxide accumulation.\nAfter 4 min turn the pumping system off and return to step 6.2 until rats are exposed to tobacco smoke for 90 min (or approximately 23 cigarettes).\n\tNOTE: Carbon monoxide levels 4 min following cigarette burning should fall below 400 ppm, otherwise carbon monoxide may begin to accumulate in chamber.",
    "When exposure is complete, continue to leave the pumping system on to ventilate residual smoke. When carbon monoxide falls below 100 ppm remove rats from chamber. This should take 5 - 10 min.\nRemove rats and clean the chamber.\nCollect 500 µL blood from tail vein approximately 1 h after exposure at the conclusion of the experimental protocol as with the E-cigarettes.\nFollow steps 4.4 - 4.5 to isolate serum and assay for cotinine.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}