{
  "id": 5394,
  "origin_website": "Bio",
  "title": "Protein Synthesis Rate Assessment by Fluorescence Recovery after Photobleaching (FRAP)",
  "procedures": [
    "Transgenic nematode generation and maintenanceTo implement the protocol described below, start by generating appropriate transgenic C. elegans strains expressing the fluorescent proteins of choice in the cells or tissues of interest, under the control of promoters active for the cell or tissues investigated. Both transcriptional and translational fusions can be used with this method. Various methods are available for introducing recombinant DNA into nematodes. A widely exercised technique is the microinjection of DNA into the gonadal syncytium of gravid adult hermaphrodite animals (Rieckher et al., 2009).Grow transgenic animals expressing the fluorophore in cells or tissues of interest on 60 mm plates seeded with OP50 (the E. coli strain used as C. elegans’ food source), at the standard temperature of 20 °C or other appropriate temperature (depends on genetic background and other experimental considerations such as the temperature sensitivity of animals examined). Unless an environmentally controlled chamber or room is available, the procedure of fluorescence photobleaching and recovery is performed at ambient temperature. Allow animals to equilibrate at this temperature for 2-3 h before photobleaching.Sample preparation, photobleaching and recoverySample preparationThe procedure can be performed either directly on a plate (step B1a) or on a coverslip (step B1b). When examining worms that express the fluorescent marker in individual cells, photographs of moving worms are hard to analyze. In this case follow step B1b, below. For worms expressing the fluorescent marker protein globally or in many tissues, the more convenient step B1a may be applicable. We generally avoid the use of anesthetics, especially the commonly used sodium azide, which blocks the mitochondrial respiratory chain, perturbs energy production and is likely to interfere with the fluorescence recovery process by hindering protein synthesis.",
    "To limit animal mobility (step B1a) we find particularly helpful the use of the dominant rol-6(su1006) allele as co-transformation marker (plasmid RF4), when constructing transgenic lines. This allele causes animals to roll instead of moving sinusoidally, which confines them in a relatively small area of the plate.Transfer single worms to fresh 35 mm plates, seeded with OP50 bacteria. A small bacterial spot in the center of the plate will make localization of the worm easier, while focusing the sample.Spot a drop of 15 μl M9 buffer on a microscope slide and place the worm on the drop with the help of an eyelash glued on a pick. Add a cover slip on the top of the drop. The weight of the cover slip is sufficient to keep the worm immobile during the procedure, without damaging it. Notes: M9 buffer instead of water ensures a favourable osmotic environment for the worm. Animals should not be allowed to dry out during photobleaching. Supply fresh M9 in the form of 5 μl drops applied to the side of the cover slip during lengthy photobleaching sessions. (CRITICAL STEP) Exercise caution when removing the cover slip to recover the animal. Accidentally pressing on the cover slip will crush the worms. (CRITICAL STEP)Photograph single animals before photobleaching Photograph single animals before photobleaching using a camera attached to the microscope (e.g., Axio Cam HR, Carl Zeiss). Images of fluorescent cells or tissues of interest are collected. Imaging parameters such as microscope and camera settings (lens and magnifier used, filters exposure time, resolution, etc.) should be documented.Perform photobleachingUse an epifluorescence, compound light microscope (e.g., Axioskop 2 Plus, Carl Zeiss) equipped with a high power light source (HBO 100; 100 Watt mercury arc lamp; Osram, Munich, Germany) and the appropriate excitation/emission filter sets to photobleach the animal.",
    "For the applications described here, 10 min of photobleaching reduce the initial emission intensity adequately (to within 30-50% of pre-bleach levels). The light intensity and the duration of the bleaching period are adjusted accordingly for the specific fluorophore, animal stage and cell or tissue under examination. Investigators should experimentally determine the appropriate duration of irradiation required to reach the extent of photobleaching, appropriate for different specimens (see Note 1).Notes: At least 20 individual animals should be processed for each experimental condition. The photobleaching period should be kept identical for all animals tested. CRITICAL STEP: Proper photobleaching conditions (light intensity, duration) should be set aiming to avoid injuring worms. The absolute level of fluorescence reduction by photobleaching is not important. We assess damage to worms by looking for apparent changes in behavior such as lethargy and movement defects or diminished responsiveness to touch, and for reduced fecundity in animals subjected to photobleaching. Animals showing signs of damage after photobleaching are excluded from further analysis.Fluorescence recovery Photograph each animal immediately after photobleaching. Collect several images of cells or tissues of interest. Move animals to fresh OP50-seeded NGM plates. Recover animals photobleached on a microscope slide by adding 100 μl of M9 at the edges of the cover slip and sliding off the cover slip. These worms are also returned to an OP50-seeded NGM plate for recovery. Recovery timing starts at this point. Note: All imaging parameters such as microscope and camera settings (lens and magnification used, filters exposure time, resolution, etc.) should be set as in step B2 above. (CRITICAL STEP)Photographing animals at defined time points after fluorescence recovery Follow fluorescence recovery by photographing animals at defined time points. We use 1 h intervals between successive photography sessions. A suitable time interval can be determined for each experimental application.",
    "Collect several images of cells or tissues of interest. As in step B4 above, it is critical that all imaging parameters (microscope and camera settings) are kept identical to those initially set in step B2 (see Note 2).Prepare a stock solution of cycloheximide by diluting in water to a concentration of 10 mg/ml. Keep refrigerated. Add cycloheximide on top of OP50-seeded, 35 mm NGM plates to 500 μg/ml final concentration in the agar volume and allow plates to dry. Notes:The antibiotic cycloheximide, a potent and specific inhibitor of mRNA translation can be used to discriminate between the contribution of new protein synthesis and protein diffusion in overall fluorescence recovery after photobleaching.Cycloheximide has significant, toxic side effects. Kill bacteria on plates before adding cycloheximide by exposing bacterial lawns on NGM plates to UV radiation. Irradiate at 254 nm for 10 min at 100 mJ/cm2 in a UV crosslinker (Garigan et al., 2002; Gems and Riddle, 2000) (such as the Stratalinker 2400; Statagene, La Jolla, USA). (CAUTION)Transfer animals onto cycloheximide-containing plates and incubate for 2 h, at the growth temperature. Prepare animals for photobleaching as in step B1a or B1b. Return worms in cycloheximide-containing plates during fluorescence recovery (see Note 3)."
  ],
  "subjectAreas": [
    "Developmental Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}