{
  "id": 11228,
  "origin_website": "Jove",
  "title": "Preparation of Intact Bovine Tail Intervertebral Discs for Organ Culture",
  "procedures": [
    "1. Intervertebral Disc Harvesting\nWhole length bovine tail is obtained from a local abattoir, if possible without skin since the presence of skin increases the chance of contamination (Fig 2).\nPrepare large cutting board and prepare sterile work station and instruments on top of a cutting board (Fig. 2).\nPrepare under the sterile laminar flow hood sterile gauze moistened with 0.9% sodium chloride containing 55mM sodium citrate and put into each well of the 6-well plate.\nPrepare a basin and dilute 1:100 Betadine solution with tap water.\nImmerse the whole bovine tail in a basin containing 1% Betadine solution for 5 min.\nBriefly dry tail with sterile gauze and place it on sterile work station.\nCarefully remove muscle around the tail with scalpel blade #22.\nChop away the parts of the tail which are not needed, usually both ends of the tail, which contain relatively large and very small IVDs (Fig. 3).\nTrim further the muscle and tendons around the IVD using scalpel blade #10. Beware not to cut the outer annulus of the discs.\nMark the anterior of the IVD with a surgical skin marker (this step is optional, it helps to determine the center for axial rotation in our bioreactor).\nLocate the IVD and vertebra connection point by moving the tail gently. Feel the border between IVD and bone with the dull side of a scalpel blade. The cleaving site should be 1-2 mm away of the IVD towards the vertebra. Place custom made industrial blade holder on the cleaving site (Fig. 4).\nCleave IVD and vertebra by hammering on top of the custom-made industrial blade holder (Fig. 3).\nRepeat on the other side of the IVD-vertebra connection.\nWrap isolated IVD with sterile gauze moistened with 0.9% sodium chloride containing 55mM sodium citrate.",
    "Continue the isolation of IVDs to the desired sample number (usually around 6 can be harvested with diameter between 10-20 mm).\nConnect the jet lavage system (Zimmer, inc.) with sterile Lactated Ringer's solution, 5L bags are a useful size (alternatively sterile PBS or 0.9% saline solution).\nHold the IVD with forceps and jet-lavage both sides of the endplate surface using Zimmer Pulsavac jet-lavage system (Fig. 1C). The jet gun should be shot on the endplate surface at an angle between 30 - 60° for about 30s on each side. (Figs. 1 and 7)\nPut the IVDs back to the 6-well plate and wrap with moistened gauze while jet washing another disc sample.\nIVDs are ready for organ culture and down-stream applications (e.g. cell viability, mechanical loading, organ culture) (Fig. 1D).\n2. Representative Results\nOutcome measurements to judge a successful intervertebral disc preparation can be a diffusion experiment where a small molecular weight fluorescent dye (e.g. procion red) is prepared as a 1% solution in PBS2. The IVD is then kept with at least 100 mL of dye solution and the dye is then allowed to diffuse passively into the IVD for 24h under free swelling. The IVD is then flash-frozen in liquid nitrogen and brought back to room temperature and dehydrated by a series of acetone transfers (first pre-cooled in -80 °C, then -20 °C, then 4 °C and finally to room temperature). The disc can then be embedded in poly-methyl-acrylate (PMMA) and cut with a sharp blade to produce 100 μm-thick sections. These sections can then be viewed by any standard brightfield microscope but preferentially by usage of fluorescence microscopy since procion red emits a red fluorescence (Figs. 5-6). The trabeculi of the bony surface appear very clean after the jet lavaging step (Fig. 7).",
    "Parameters for a successful organ culture are first of all the absence of contamination, maintained cell viability (Figs. 8-9), disc height and overall \"disc integrity\", measured with histological sections and safranin O/fast green stain or Meyer's Hematoxilin 3. We developed protocols and macros published elsewhere4,5 to stain live disc tissue and to scan cell viability in 3D using a confocal laser scanning microscope and the live/dead staining kit (Molecular Probes, Invitrogen, Basel, Switzerland). We further developed a macro and routine to perform automated cell counting to estimate cell viability in 3D tissue or 3D carriers using the NIH ImageJ platform4-6. Alternate protocols have been proposed to determine cell viability of disc cells by initial digestion using sequential digestion of the extracellular matrix using pronase and collagenase type 2 and then to stain the cell suspension7. An earlier version of the protocol involved an incubation step in PBS containing ten times more concentrated penicillin/streptomycin concentration for 10min after the harvesting of the discs prior organ culture. With the jet lavage step this step becomes obsolete since this step seems beneficial for culturing purposes.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3490/3490fig1.jpg\nFigure 1.  Overview of the methodological steps to prepare bovine coccygeal Intervertebral Discs with intact endplates and a thin layer (1-2mm) of bone. A) Schematic view of the intervertebral disc (IVD) and its nutritional pathways. B) Procedure to cut out the IVD with a customized blade-holder and an industrial sharp blade. C) Jet lavage step to ensure high cell viability and to enable nutrient exchange keeping the endplates and 1-2 mm of bone attached on both sides. D) Finally the IVD can be cultured in the specimen chamber of a bioreactor or be used for any down-stream application.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3490/3490fig2.jpg",
    "Figure 2.  TOP: Full length fresh bovine tail (ideally obtained within 2-3 hours post-mortem to ensure high cell viability. Bottom: X-ray image of a bovine tail aged around 6 months illustrating the existence of growth plates (GP), secondary center of ossification, between the bony endplates (EP) and the vertebra bodies (VB).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3490/3490fig3.jpg\nFigure 3.  A) Tools to dissect the bovine tail under sterile conditions. B) Customized blade-holder to cut-out motional segments from the bovine tail in action while cutting the intervertebral disc. C) Side-view of the customized blade-holder with a standard industrial blade (Lutz, Germany).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3490/3490fig4.jpg\nFigure 4.  Drawing and picture of the bovine tail after removing the surrounding muscle and ligament illustrating the cleaving sites to cut out the motional segments. Partial vertebra should be \"cracked\" with the custom-made blade holder ideally 1-2 mm away from the cartilaginous endplates to ensure full bone surface.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3490/3490fig5.jpg\nFigure 5.  Demonstration of the effective cleaning of the jet-lavage step before (A) and after (B). Notice the clean bony surfaces of the intervertebral disc segments after the spraying procedure.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3490/3490fig6.jpg\nFigure 6.  Free-swelling diffusion experiment of freshly prepared excised bovine tail intervertebral discs (IVDs) left for 24 hours in 1% procion red solution, demonstrating blockage effect by the growth plate. A digital X-ray sagittal view of a IVD still containing the growth plate and a second layer of bone fluorescent microscopy image of sagittal cut through the coccygeal bovine intervertebral disc explant with cartilaginous and bony endplate after 24h free diffusion. GP: growth plate, 2ndry CO: secondary center of ossification.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3490/3490fig7.jpg",
    "Figure 7.  Free-swelling experiment of freshly prepared excised bovine tail intervertebral discs (IVDs) left for 24 hours in 1% procion red solution, demonstrating cleaning effect of jet lavage treatment. Sagittal thick sections (~100 mm) of excised bovine IVDs with ~1.5-mmthick bony end plates that underwent jet lavage treatment (Left) control side without treatment (Right) jet-lavaged treatment. Inlet shows the spray pattern, which was used from the Zimmer wound debridement system 24h free diffusion experiments of bovine intervertebral disc explants in 1% procion red.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3490/3490fig8.jpg\nFigure 8.  Live/Dead Images of projections of confocal Imaging stacks ( ̃250μm) taken from bovine intervertebral disc segments prepared with this jet-lavage method kept under free-swelling for 0 and 14 days respectively for the nucleus pulposus (NP), the inner annulus fibrosus (IA) and the outer annulus fibrosus (OA). Green cells = live cells stained by calcein AM (acetyl methylester), red cells = dead cells nucleus stained by ethidium homodimer-1.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3490/3490fig9.jpg\nFigure 9.  Cell Viability of intervertebral disc using confocal laser scanning microscopy on live tissue and 3D stack scanning. Cell viability of Nucleus Pulposus (NP) and Annulus Fibrosis (AF) over the 21-day-culture under free-swelling condition. (Mean ± SEM, N=6) Statistical differences were tested using non-parametric Kruskal-Wallis signed rank sum test among groups. Significant differences were found between day 21 and all other time points in NP. While in AF significant differences were found between day 7 to day 0. (* p < 0.05, ** p < 0.01).Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}