{
  "id": 18073,
  "origin_website": "Jove",
  "title": "Murine Oropharyngeal Aspiration Model of Ventilator-associated and Hospital-acquired Bacterial Pneumonia",
  "procedures": [
    "All procedures involving animals must be approved by the researcher’s Institutional Animal Care and Use Committee (IACUC).\n1. Preparation of Bacterial Inoculum\nIsolate bacterial colonies.\n\t\nStreak a bacterial strain (e.g., A. baumannii “HUMC1”) on appropriate sterile agar medium (e.g., Tryptic soy agar), being careful to generate isolated colonies.\nIncubate at appropriate conditions (e.g., overnight at 37 °C).\nGrow overnight culture.\n\t\nSelect a representative, isolated colony from the agar plate with a sterile inoculating loop and use it to inoculate 10 mL of appropriate sterile broth medium (e.g., Tryptic soy broth).\nAllow the sample to reach the stationary phase at the proper conditions (e.g., 37 °C with shaking at 200 rpm overnight in a vented-cap, 50-mL conical vial).\nGrow the subculture.\n\t\nTransfer 100 μL of overnight culture to 10 mL of fresh sterile broth using a pipette.\nAllow to reach exponential/log phase at the proper conditions (e.g., 37 °C with shaking at 200 rpm for 3 h in a vented-cap, 50-mL conical vial).\nWash the subculture.\n\t\nRemove the subculture from its incubating environment.\nCentrifuge at 4,000 × g for 5 min to pellet the bacteria.\nAspirate and discard the supernatant.\nAdd 10 mL of sterile phosphate-buffered saline (PBS) to the pellet and vortex vigorously until fully resuspended.\nRepeat steps 1.4.2 - 1.4.4 twice, for a total of 3 washes.\nAdjust the concentration of bacterial suspension.\n\t\nUsing a spectrophotometer that measures optical density at 600 nm (OD600), measure the optical density of the bacterial suspension.\nAdd sterile PBS to the bacterial suspension until the optical density of the inoculum drops to an OD600 of 0.5, using the equation Ci×Vi = Cf×Vf, where “C” is concentration, “V” is volume, “i” is initial, and “f” is final. *Cf should always be 0.5; Vf is the variable to solve.",
    "If the bacterial suspension drops below an OD600 of 0.5, centrifuge it at 4,000 × g for 5 min to pellet the bacteria and remove an appropriate amount of the supernatant to reach an OD600 of 0.5.\nPerform serial dilutions in sterile PBS (e.g., three 1:100 dilutions to achieve 1 × 10-6) and plate on sterile agar to determine the correlation coefficient that reveals the bacterial concentration in colony-forming units per mL (CFUs/mL) at an OD600 of 0.5.\n\t\tNote: The value of this correlation coefficient will vary for each strain of each species and must be determined prior to inoculum preparation for an infection.\nAfter determining the correlation coefficient, use it to create an inoculum of the desired concentration (e.g., 2 × 108-  1 × 109 CFUs/mL); if the desired inoculum is greater than the OD600 of 0.5, centrifuge the bacterial suspension at 4,000 × g for 5 min to pellet the bacteria and remove an appropriate amount of the supernatant to reach the desired concentration.\nPerform in vivo pilot studies to determine the virulence of each bacterial isolate in each strain of mouse as these values will vary between bacterial isolates of the same species and mice of different genetic backgrounds. For various Gram-negative species, the LD100 in mice is generally 1 - 5 × 108 CFUs/mouse, although certain strains are lethal at lower inocula.\nFreeze identical aliquots for future use as on-demand, precise inocula, as previously published8 (optional).\n\t\nPrepare 1 L of bacterial inoculum as described above, transfer to two 500-mL conical vials, and centrifuge at 4,000 × g for 5 min.\nDiscard 450 mL of the supernatant from each conical vial and resuspend the pellets of bacteria in the remaining supernatant.",
    "Transfer the concentrated bacterial inoculum to a 250 mL beaker containing a magnetic stir bar and continuously mix on top of a stir plate at 300 rpm.\nCarefully transfer exactly 600 μL of concentrated bacterial inoculum (e.g., 1 × 1010 CFUs/mL) using a pipette to a 1.6-mL cryogenic vial containing exactly 300 μL of sterile H2O and 300 μL of sterile glycerol; mix and store at -80 °C.\n\t\tNote: The glycerol necessary for storage can confound the experimental results and cause excess mortality so it is necessary to wash it out.\nWhen ready for use, thaw the sample for 10 min at room temperature.\nTransfer 1 mL to a 50-mL conical vial, add 9 mL of sterile PBS, and centrifuge at 4,000 × g for 5 min to pellet the bacteria. Aspirate the supernatant and resuspend the pre-determined quantity of CFUs (1 mL × frozen stock concentration in CFUs/mL) in an appropriate volume of PBS to reach the desired concentration for the infectious inoculum.\n2. Anesthetizing Mice\nKetamine/Xylazine\n\tNote: Anesthesia with ketamine/xylazine has a long duration, which offers enough time for the researcher who is new at this technique to complete the inoculation procedure before the mouse awakens.\n\t\nPrepare 10 mL of injectable solution by combining 8.5 mL of pharmaceutifcal grade PBS, 1 mL of 100 mg/mL Ketamine stock solution (final concentration 10 mg/mL), and 0.5 mL of 20 mg/mL Xylazine stock solution (final concentration 10 mg/mL).\nAdminister 10 μL/g by intraperitoneal (IP) injection (e.g., 250 μL for a 25-g mouse).\nApply ophthalmic ointment to the eyes of the mice anesthetized with Ketamine/Xylazine because their eyes are prone to damage during extended periods of anesthesia.\nPlace the mouse in a cage and monitor until it wakes up from anesthesia.",
    "Note: The animal should not be left unattended until it has regained sufficient consciousness to maintain sternal recumbency.\nIsoflurane\n\tNote: Mice quickly wake up from isoflurane-induced anesthesia after being removed from the induction chamber, so this method of anesthesia should only be used after becoming proficient at the inoculation procedure.\n\t\nPlace the naïve mice in an appropriately sized induction chamber with oxygen flowing.\nAfter the chamber is sealed shut, anesthetize the mice using a precision vaporizer to add isoflurane at 4% (v/v) for at least 5 min; confirm the anesthesia by removing a mouse from the induction chamber and measuring how long it takes to wake up from anesthesia (~60 s).\n\t\tNote: Be aware that anesthesia times may vary based on institutional guidelines and some animals may require more than 5 min to become fully anesthetized.\nMaintain the anesthesia for up to 10 min by adjusting the isoflurane concentration to 2 - 3%; if total duration of anesthesia is >15 min, apply ophthalmic ointment to the eyes of anesthetized mice.\nPlace the mouse in a cage and monitor until it wakes up from anesthesia, as in step 2.1.\n3. Inoculating/Infecting Mice\nSuspend an anesthetized mouse, hanging it by its top incisors on a strong, thin string (e.g., dental floss) secured to a fixed object at a height approximately twice the mouse’s body length (e.g., 20 cm) above the operating surface (e.g., laboratory bench).\nGently pull the mouse's tongue out of its mouth using sterile, blunt-ended forceps. Transfer the tongue to a sterile, gloved finger to prevent accidental crushing of the mouse’s tongue. Hold the tongue outside of the mouth, allowing access to the oropharynx and preventing swallowing of the inoculum to the side.",
    "While holding the mouse’s tongue, place the 50-μL inoculum (bacterial suspension) into the oropharynx using a micropipette; the oropharynx is located at the junction of the oral cavity and the pharynx toward the back of the mouth.\n\tNote: It is very important to only deliver liquid by pipetting to the first stop on the micropipette. The mouse will stop breathing for a few seconds when the inoculum is placed in the oropharynx; eventually, reflexive aspiration will cause the mouse to inhale the bacterial suspension, indicated by the distinctive crackling noise of liquid entering the lungs, which results in pneumonia infection.\nIf the inoculum is not placed far back enough to block normal respiration, pinch the nares with forceps to force reflexive aspiration through the mouth and subsequent inhalation of the inoculum.\nAfter inoculation, release the tongue, remove the mouse from the suspension string, place it in a cage, and monitor until it wakes up from anesthesia, as in step 2.1.\n4. Monitoring Disease Progression\nNote: Due to animal suffering, various indicators should be used to indicate when mice become moribund; euthanasia should be performed following this determination, in accordance with a previously approved IACUC protocol; various markers of moribundity include body temperature, weight loss, appearance, gait, and other biomarkers that can be obtained from blood (e.g., via iSTAT)9,10,11,12,13,14,15,16.\nEuthanize the mice according to previously approved IACUC protocol (e.g., CO2 followed by cervical dislocation).\nRemove the lungs from euthanized mouse by cutting the trachea, pulmonary artery, and pulmonary vein close to the lungs.\n\t\nMicroscopy\n\t\t\nPlace the lungs (or portion) in a specimen mold.\nFill the specimen mold with Optimal Cutting Temperature (O.C.T.) compound, completely submerging the tissue.\nFreeze the sample at -80 °C.\nSend the sample to a pathology lab to section and mount on slides for microscopy.\nBacterial burden",
    "Weigh the lung tissue on an analytical balance.\nTransfer the lung tissue to 50-mL conical vial containing 2 - 5 mL of sterile PBS (depending on the size of the tissue).\nHomogenize the lung tissue with a tissue homogenizer.\nPerform serial dilutions of the homogenate in sterile PBS to achieve approximately 1,000 CFUs/mL, based on expected bacterial burden in lungs.\n\t\t\t\nFor example, if 1 × 109 CFUs/mg is expected, perform three 1:100 dilutions: Transfer 100 μL of homogenate to 9.9 mL of PBS and vortex; this is the first 1:100 dilution. Transfer 100 μL of the first 1:100 dilution to 9.9 mL of PBS and vortex; this is the second 1:100 dilution. Transfer 100 μL of the second 1:100 dilution to 9.9 mL of PBS and vortex; this is the third and final 1:100 dilution.\nIf bacterial burden in the lungs is unknown, perform a range of dilutions to capture the expected range.\nPlate dilution(s) on sterile agar.\n\t\t\t\nPrepare sterile Tryptic Soy Broth (TSB) with agar (TSA) plates: Combine 30 g of TSB, 15 g of agar, and 1 L of water, mix with a magnetic stirrer, and heat until boiling at ~100 °C for 5 min. Allow to cool and then autoclave on liquid cycle for 15 min. Allow to cool to ~55 °C, transfer 10 mL freshly autoclaved TSA to sterile Petri dishes, and allow to cool to room temperature. Let dry on benchtop for 2 - 5 d or uncovered under a biosafety cabinet for 10 min.\nTransfer 100 μL of the dilution to a Petri dish containing sterile TSA and spread across TSA using a spreader or glass beads.\nStore the Petri dish overnight at 37 °C in a humidified incubator (i.e., 37 °C incubator containing an uncovered 1-L beaker filled with water)",
    "Determine CFUs/mL lung homogenate based on agar plating (e.g., 100 CFUs on TSA plate with 100 μL of third and final dilution described above would be 100 CFUs/100 μL × 100dil#1 × 100dil#2 × 100dil#3 = 1×109 CFUs/mL).\nCalculate CFUs/mg lung tissue based by dividing CFUs/mL lung homogenate by mg lung tissue/mL homogenate (e.g., if sample described above used 100 mg of lung tissue homogenized in 5 mL of PBS, then 1 × 109 CFUs/mL ÷ 100 mg/5 mL = 5 × 107 CFUs/mg).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}