{
  "id": 4132,
  "origin_website": "Cell",
  "title": "A laser-mediated photo-manipulative toolbox for generation and real-time monitoring of DNA lesions",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nLasers can be used for inducing various types of DNA damage. In this protocol, we describe the detailed procedure for generating the following kinds of DNA damage, which can be implemented to any cell type growing in an anchorage-dependent manner, irrespective of their size or origin:\nDNA Double-Strand Breaks (DSBs)\nDNA Interstrand Cross Links (ICLs)\nDNA Single-Strand Breaks (SSBs)\nProtocol for studying double-strand break (DSB) repair:\nDNA DSBs are a highly cytotoxic form of DNA lesions, which, if stays unrepaired, leads to various cellular anomalies, including oncogenic transformation (Madhavan et al., 2021[href=https://www.wicell.org#bib15]). Moreover, all eukaryotic cells respond to DSBs by a series of events, namely DNA damage response (DDR), to detect, signal and repair the damage by either an error-free homologous recombination (HR), or via an error-prone non-homologous end joining (NHEJ) repair pathway (Branzei and Foiani, 2008[href=https://www.wicell.org#bib3]). DSBs lead to the activation of the DSB-sensing kinase (such as Ataxia Telangiectasia Mutated kinase; ATM). This activated sensor kinase then directs the recruitment of various DNA repair or auxiliary factors to the site of damage to timely repair the damage (Matsuoka et al., 2007[href=https://www.wicell.org#bib16]). Thus, on-demand activation of the DNA repair pathway plays an important role in preventing the most devastating diseases of western society, including neurodegeneration, organ fibrosis and cancer.\nProtocol to study recruitment and repair kinetics of factors involved in DNA DSB repair by live microscopy. DAY-1 (Estimated time required: <1 h)\nTo begin with, seed cells in the chambered slide (15μ slide 8-well) in phenol red-free DMEM medium in the evening. Seed around ∼2 × 104 (U2OS), or ∼3 × 104 (HeLa/A549) cells in 250 μL of indicated medium/well. Incubate under normal cell growth conditions such as temperature 37°C, 5% CO2, and 90%–95% relative humidity (RH).",
    "Alternatives: The glass bottom chambered slide or dish can also be purchased from any other vendor providing them with high-quality coverslip. Its growth surface needs to provide a suitable attachment of the applied cell type. Please ensure that the materials used do not affect the morphological and physiological properties of the study cells.\nDAY-2 (Estimated time required: 1–2 h)\nReplace the culture medium from each well with fresh medium DMEM medium (250 μL/well).\nSelecting the study plasmids and planning for transfection: Choosing the proper positive control depends on various aspects of the repair process you are studying. For DSB repair, we suggest using fluorescent-tagged early DNA damage sensing factor such as Nbs1 or nuclear sirtuins as a positive control. More importantly, Nbs1 recruits to the site of the damage within <1 s and stays there for a very long time; thus, if you plan to study the repair process for a long time or late stages of the repair, Nbs1 serve an excellent option. Similarly, nuclear sirtuin such as SIRT1, SIRT6 or SIRT7, also recruits to the site of the damage within 20 s, thus can serve a perfect positive control. The choice of a second plasmid depends on the experimental plans. For example, a cell uses two different pathways to complete long-range end-resection, such as (i) BLM-DNA2-RPA-MRN, or (ii) EXO1-BLM-RPA-MRN pathway; thus, to plan your study, respective markers of each pathway can be chosen from the Table 1[href=https://www.wicell.org#tbl1].\nNote: The empty vector backbone expressing (EGFP, RFP, mCherry, YFP, EBFP or any other) fluorescent tag alone can be used as a negative control of the experiment. This ensures the experimenter to distinguish between clear recruitment and exclusion (although very rare, but also from any passive diffusion) at the site of damage.",
    "Prepare the transfection mix as per table (Table 3[href=https://www.wicell.org#tbl3]). We used a Turbofect transfection reagent, but any other transfection reagent can be used for the transfection by following the manufacturer's instructions.\ntable:files/protocols_protocol_897_3.csv\nNote: The above table represents the condition we successfully tested in Hela, U2OS and A549 cells using Turbofect transfection reagent. However, for other cells, one needs to standardize the transfection conditions. Alternatively, follow the manufacturer’s instruction for other transfection reagents by keeping the ratio of the plasmid 1 and 2 as 1:1.\nPre-sensitization-cum-medium change: Six hours post-transfection, replace the culture medium with a phenol red-free complete DMEM medium supplemented with 10 μM BrdU (BrdU stock: 10 mM in H2O) in each well. Transfer as well as incubate them in a cell culture incubator for 24 h (Note down the time).\nNote: Pre-sensitization with BrdU, or any other halogenated thymidine analogs, increases the sensitivity of DNA to irradiation in many ways (Fujii, Genet et al., 2013[href=https://www.wicell.org#bib7]), but the generalized viewpoint states that upon UV irradiation, the single-strand break formation from BrdU radicals results in the formation of lethal DSBs. Therefore, this pre-sensitization step increases the frequency of laser-induced DSB formation.\nDAY-3 (Estimated time required: 2–4 h)\nAfter about 22 h of the last medium change, turn on the microscope incubator and set the incubator temperature to 37°C, CO2 to 5%, and relative humidity to 90%–95%. At this stage, one can also turn on the microscope, laser boxes, open the software and load the SIM settings/parameters described in “Equipment”. Now let the associated things warm up and monitor them.\nAfter 24 h of pre-sensitization, transfer chambered slide containing transfected cells onto the pre-warmed incubator-microscope stage.",
    "Locate, focus, and zoom-in (zoom factor 3-3.2×) over transfected cells (single or multiple cells). Check for intact nuclear morphology and uniform fluorescence in the nucleus, as shown for EGFP and mCherry channels (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/897-Fig4.jpg\nFigure 4. Uniform expression of fluorescently tagged repair factor\n(A) The representative image of focused, zoom-in of U2OS cell expressing EGFP-SIRT6 and vRAGE-mCherry showing the uniform fluorescence of these repair factors across the nuclei and nucleolus.\n(B) The representative image of one such cell expressing EGFP-tagged BLM helicase before (pre-) and after irradiation. The brightfield represents the morphology of the nucleus (Scale 10 μm).\nNote: Some factors show prominent normal sub-nuclear localization (BLM helicase in nucleolus). These cells can be used for laser-induced DNA damage studies without any issue, as shown (Figure 4[href=https://www.wicell.org#fig4]B).\nIn the SIM setting wizard (described in Figure 3[href=https://www.wicell.org#fig3]), load/write the parameters for laser settings (described in the Equipment section). As mentioned, we used a 63×/1.15 water to scan a straight line across a single plane, but not Z-stacks, of the nucleus of individual cells (zoom factor 3-3.2×) with a scan speed of 200 μs/pixel to yield a line of DNA damage of 0.3 μm width. The total time of cell exposure to laser radiation was 250 ms, with a total of about 8 frames scans. The recruitment kinetics was recorded over a gap of 15 s. The unirradiated scan (pre) served as an internal negative control.\nNote: For most of the factors, we successfully used an activation time of 250 ms. This condition was tested for U2OS, Hela, A549, HCT, HEK, Fibroblasts, and other primary cells.",
    "Now, decide the region of interest (ROI) shape and nuclear area you want to irradiate. Although it is possible to draw any shape like alphabets, squares, circles, and many other shapes to be irradiated by laser (Figure 2[href=https://www.wicell.org#fig2]), we recommend using a single straight line across the nucleus, as highlighted in Figure 2[href=https://www.wicell.org#fig2], marked in the green box. The laser irradiation will induce DNA damage in the respective area of these drawn shapes.\nNote: Several repair factors (Such as BLM, SIRT1, SIRT6, etc.) prominently localize to the nucleolus (as shown in Figure 4[href=https://www.wicell.org#fig4]B), forming a very intense nucleolar structure (can be circular or oval-shaped). Hence straight lines are much easier to distinguish from these nucleolar structures than an irradiated circle. In addition, the straight-line limits stress to a small region and create a clear structure at high contrast that is easy to detect.\nAfter ROI shape setup, next set the time interval and total duration of live microscopy. Adjust conditions for time-lapse imaging according to the dynamics of the sub-process studied. For example, Nbs1 serves as a DNA damage sensor, thus gets recruited to the site of the damage within 1 s. It stays there for a very long period, where other factors, such as SIRT6, SIRT1, vRAGE, come into play after Nbs1; therefore, while studying these factors along with NBS1, we use time interval 5–10 s post DNA damage. However, depending upon the study factor, one can change this parameter accordingly. While using FV1000/FV1200, one could even track the recruitment kinetics over an interval as low as 0.5 s.",
    "Critical: The total duration of the live-cell microscopy (number and interval between the time points) depends on the repair factor, a process to be studied and its role in DNA repair, supposed, you plan to study DNA damage sensor complex related factors (like Nbs1, MRE11, or RAD50). Their recruitment starts immediately after laser-induced DNA damage, thus this process can be tracked from 1- to 120-sec(s). The MRN (MRE11-RAD50-Nbs1) complex reaches its maximum saturation intensity within 10–90 s and stays as such over a very long time. Moreover, If you plan to study end-processing events like resection, then one can track the recruitment from 2–5 min (for short-range resection), or longer (for long-range resection). Keep in mind that both short and long-range resection may take hours to complete. Therefore, depending upon the test factor's potential role, the total duration of the post-damage studies can be designed accordingly.\nNow, start the acquisition and track the following changes.\nThe Laser-induced minor bleaching across the selected shape as shown in Figure 5[href=https://www.wicell.org#fig5]A.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/897-Fig5.jpg\nFigure 5. Recruitment kinetics of SIRT7 and vRAGE at the site of DNA DSBs\n(A) The minor photo-bleaching of SIRT7-EGFP expressed in U2OS cells induced by laser irradiation recovers within seconds. Subsequently, repair factors get recruited to the site of DSBs damage.\n(B) Representative time-points of the recruitment of EGFP-SIRT7 (green) and vRAGE-mCherry (red) at the site of DNA DSBs in BrdU pre-sensitized U2OS cells.\n(C) Quantification of the fluorescence intensity (measured at the place of damage) of EGFP-SIRT7, and mCherry-vRAGE before and after laser-induced DNA damage. The fluorescence intensity (in percentage) of the indicated factors in Figure 5[href=https://www.wicell.org#fig5]B of irradiated versus unirradiated regions are plotted as the relative fluorescence intensity at each time point (Error bars indicate SEM; n > 3. Scale 10 μm).",
    "Recruitment of positive control or any other established repair factor (Here, for DSB repair, we used EGFP-SIRT7) at the site of irradiation Figures 5[href=https://www.wicell.org#fig5]B and 5C.\nNow check the recruitment kinetics of the study factor (Here, for DSB repair, we used mCherry-vRAGE).\nSave the recorded video and process the data accordingly with ImageJ or any other comparative software. The following link can be used as a guide to arrange the video microscopy data with ImageJ (https://imagej.nih.gov/ij/docs/guide/[href=https://imagej.nih.gov/ij/docs/guide/]). To analyze the recruitment kinetics data, the fluorescence intensity values of the recruited factors can be evaluated. The recorded videos can be opened in ImageJ. Now select and draw a straight line precisely on the damaged area from ROI manager of the ImageJ. Now select the multi-measure (for all the slices) from the “more” window of ROI manager. Copy the result values in an excel file. Now repeat the measurements in the undamaged area for all the time points/slices. Repeat this for other cells too. For graphical presentation, the mean fluorescence intensity of irradiated region (ROIirr)/Fluorescence intensity of unirradiated (ROIunirr), then normalized with the fluorescence intensity at pre-damage (t=0) of the experiment. The final normalized values for each can be plotted against the time interval used during video microscopy. Representative still images and quantification of live recruitment EGFP-tagged human SIRT7 and mCherry-tagged human vRAGE for this DSB repair assay are shown in Figures 5[href=https://www.wicell.org#fig5]B and 5C. Moreover, to verify the application of this protocol in a different cell line, we also used A549 expressing EGFP-Nbs1 and vRAGE-mCherry, and the representative movie (Methods video S1[href=https://www.wicell.org#mmc1]) shows the DSBs-dependent recruitment kinetics of these factors.\n    Your browser does not support HTML5 video.",
    "Methods video S1. Representative video file showing the live recruitment kinetics of the indicated repair factors after laser mediated DNA DSBs in A549 cells, step 1 m\nHere green or red fluorescence represents EGFP-Nbs1, or mCherry-vRAGE, respectively.\nProtocol to study DNA DSBs repair by immunofluorescence (IF) staining method: This protocol describes the method to study DNA DSBs without tracking the live recruitment of repair factors. This protocol does not involve the transfection step but instead uses Paraformaldehyde (PFA, 4% in 1 × PBS) based fixation and IF staining with desired antibodies. DAY-1 (Estimated time required: <1 h)\nSeed cells in respective wells of the chambered slide (15μ slide 8-well Grid-500) in complete phenol red-free DMEM medium, supplemented with 10 μM BrdU in the morning. Seed around ∼2 × 104 (U2OS), or ∼3–4 × 104 (HeLa) cells in 250 μL of indicated medium/well. Incubate under normal cell growth conditions (temperature 37°C, 5% CO2, and 90%–95% relative humidity (RH), Note down the time). DAY-2 (Estimated time required: 2–3 h)\nAfter about 22–23 h of BrdU pre-sensitization, turn on the microscope incubator and set the incubator temperature to 37°C, CO2 to 5%, and relative humidity to 90%–95%. At this stage, you can also turn on the microscope, laser boxes and start the software and load the settings/parameters described in DSBs Protocol (step-f). Now let the environment chamber to warm up for at least an hour.\nAfter 24 h of BrdU pre-sensitization, transfer slide containing cells (Grid-500) onto the pre-warmed incubator-microscope stage.\nFocus and locate the well-grown areas of cells in the culture well. Now find the region of the chamber where cells are well spaced and healthy. Note down the lane markings in the surface grid, as shown in Figure 6[href=https://www.wicell.org#fig6].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/897-Fig6.jpg\nFigure 6. Bird’s eye view of a grid slide well",
    "The representative drawing of the Grid slide (15μ slide 8-well Grid-500) and individually zoomed well (zoom factor 3–3.2×), indicating the surface labels for quickly locating the region of irradiation.\nNote: Please do not forget to note the lane and well descriptions in the notebook (e.g., like well-5 lane 9D). Any error in noting can make it very difficult to locate the irradiated zone after immunofluorescence (IF) staining.\nNow, draw the line(s) to damage across the cell nucleus. One can target a single cell or multiple cells at a time, as described in Figure 7[href=https://www.wicell.org#fig7].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/897-Fig7.jpg\nFigure 7. Plan to irradiate individual or multiple cells\nThe images show two options of drawing the irradiation regions to either target single cells or multiple cells at a time. The Bright field images showing the representative unzoomed window view of U2OS cells. The red line(s) shows the selected ROIs for laser irradiation. Scale 10 μm.\nNote: To ensure the uniform damage and best tracking of the recruitment, we suggest using individual targeting or targeting a limited number of cells at a time.\nUse the laser settings described in DSBs Protocol (step-i) and activate the damage pulse for 250 ms.\nRepeat steps (steps- q to s) quickly to irradiate the desired number of cells in the same or other wells. The faster the irradiation can be carried out, the closer the timing of the induced phenotypes is.\nProcessing of the irradiated cells for fixation:\nThe time gap between the cells' irradiation and processing depends upon the repair factor/ step of DNA DSBs repair you are studying. For broad guidance, please refer to Table 4[href=https://www.wicell.org#tbl4].\ntable:files/protocols_protocol_897_4.csv",
    "After a suitable post-irradiation time slot, remove the cell culture medium from the irradiated well and wash the growth surface three times with 1× PBS. Now fix the cells using ice-cold PFA (250 μL/well), and incubate at 4°C for 15 min. Remove Paraformaldehyde (PFA), incubate/wash the fixed cells once with 50 mM Tris-Cl (pH=7.5; to inactivate the residual PFA), and then with 1× PBS for 5 min each time.\nNote: Suppose the expression of the factor studied is low or the intensity of its recruitment is weak, one can pre-extract the irradiated cells (before fixation) in the cytoskeleton extraction (CSK) buffer. CSK buffer treatment partially permeabilizes the live cells to release their unbound cytosolic/nucleoplasmic contents without affecting the factors bound to sub-cellular structures and chromatin. For more details on CSK mediated pre-extraction, please follow ((Sawasdichai et al., 2010[href=https://www.wicell.org#bib22]) #281). The recipe of the CSK buffer is provided in materials and equipment[href=https://www.wicell.org#materials-and-equipment] section. The time of CSK extraction needs to be empirically determined with the respective cell types used in the study. The following Triton X-100 concentration and time we successfully used for the indicated cells in our laboratory, such as fibroblasts (0.1%, 1–2 min), U2OS (0.2%, 3 min), Hela and A549 (0.3%, 4 min).\nDAY-3 (Estimated time required: 2–3 h)\nProceed with immunofluorescence (IF) staining protocol (Kumar et al., 2017[href=https://www.wicell.org#bib12]). After IF staining, locate (as noted in step-q), and image the irradiated cells.\nNote: Although the pre-extraction with CSK buffer is not mandatory, permeabilization associated with IF staining protocol is mandatory and is irrespective of CSK extractions.",
    "DNA Interstrand Cross-Link (ICLs) damage and repair DNA interstrand cross-links are highly cytotoxic forms of DNA lesions, leading to oncogenic transformations, premature aging, and death, if not repaired in time. The ICLs repair involves a Fanconi-anemia-dependent or an independent mechanism to repair the damage. Moreover, the molecular event that occurs after ICLs DNA damage can provide valuable information about novel factors that might be exploited to develop modern anti-cancer therapeutics. Therefore, a study involving the recruitment kinetics of known and potential repair factors plays an important role in better understanding ICLs repair pathways. This protocol involves many similar steps as described for DSBs studies, but it significantly differs at several points. Moreover, like DSBs repair, this method is also provided in two formats: one involves the live recruitment based analysis of the potential factors, whereas the other involves an antibody-based immunofluorescence staining approach. A detailed description of these methods is given below: Protocol to study recruitment and repair kinetics of factors involved in DNA ICL repair by live microscopy. DAY-1 (Estimated time required: < 1 h)\nSeed cells in the chambered slide (15μ slide 8-well) in complete phenol red-free DMEM medium in the evening. Seed around ∼1.5 × 104 (U2OS) or ∼2 × 104 (HeLa) cells in 250 μL of indicated medium/well. Incubate under normal cell growth conditions such as temperature 37°C, 5% CO2, and 90%–95% relative humidity (RH). DAY-2 (Estimated time required: 1–2 h)\nReplace the culture medium from each well with fresh medium DMEM medium (250 μL/well).",
    "Prepare and transfect the cells with control (consider Table 1[href=https://www.wicell.org#tbl1] for positive control suggestions) and desired study plasmid as per Table 3[href=https://www.wicell.org#tbl3]. We suggest using EGFP-FANCD2 or EGFP-SLX4 as a positive control to check if ICL repair is induced. These markers get recruited to the site of ICL within 15 s(s), therefore, serve as a very good positive control. The choice of the second plasmid depends upon one’s experimental plan; like experimenter can choose another ICL repair plasmid from Table 1[href=https://www.wicell.org#tbl1] and Table 4[href=https://www.wicell.org#tbl4], or it can be their own test factor.\nAfter 6 h of transfection, replace the medium with fresh phenol red-free DMEM and incubate the cells for 24–36 h in a cell culture incubator (since FANCD2 and SLX1/4 are very large proteins. Therefore, significant expression/intense fluorescence of these factors need at least 30–36 h post-transfection). DAY-3 (Estimated time required: 2–4 h)\nAfter 33–34 h of transfection, turn on the microscope incubator and set the incubator temperature to 37°C degrees, CO2 to 5%, and relative humidity to 90%–95%. At this stage, one can also turn on the microscope, laser boxes and start the microscope program software and load the settings/parameters described in “Equipment”. Now let the system warm-up.\nAfter 35–36 h post-transfection, prepare cells for ICL damage by pre-sensitizing them with 25 μM of TM-Psoralen for 30 min (Prepare TMP solution using DMSO as a solvent; discard the leftover solution as per disposal guidelines). Do not use a TMP solution older than 12 h.",
    "Note: Psoralen derivatives are planar cyclic compounds that can readily enter and intercalate in the DNA strands. Activation of intercalated psoralen molecules with UV irradiation (355–365 nm) forms covalent crosslinks/adducts by involving pyrimidine bases (mostly Thymidine; T) of the dsDNA and the reactive groups of psoralen. TM-psoralen has two reactive groups. Therefore, it simultaneously forms bifunctional adducts involving two DNA bases and prominently used for inducing ICLs.\nAfter TM-Psoralen pre-sensitization, transfer chambered slide with sensitized/transfected cells onto the microscope stage and select suitable cells expressing the EGFP and mCherry (or other fluorescent tags).\nNow fine focus and zoom-in (zoom factor 3-3.2×) to the respective well to locate an extended, well-grown cell with intact nuclear morphology and uniform fluorescence in the nucleus as described in DSBs Protocol (step-h).\nIn the SIM settings window, select the 355 nm laser and load/write the parameters for other settings described in DSBs Protocol (step-i). For ICL factors, we need an exposure time of 300–400 ms. These conditions have been thoroughly tested for U2OS, Hela, A549, HCT, HEK, fibroblasts, and other primary cells).\nNote: For laser-induced ICL damage, we need a pulsed 355 nm laser. Therefore, if you are planning to develop a new laser-induced DNA damage setup, please consider spending on an appropriate 355 nm laser instead of a 405 nm laser.\nNow, decide the shape and nuclear area you want to expose to radiation and draw the ROI as described in DSBs Protocol (step-j), as well as in Figure 2[href=https://www.wicell.org#fig2].",
    "After setting the region to irradiate, the next step is to set the time interval and total duration. FANCD2 gets recruited to the site of ICL damage within 10 s; therefore, to begin with, one can check the DNA ICL damage response/recruitment kinetics using an interval of 15–20 s for the desired duration (Table 4[href=https://www.wicell.org#tbl4]).\nNote: If the study intervals are very close, one can adopt the time and total duration settings accordingly.\nStart the time-lapse and track the recruitment kinetics of the ICL repair positive control and test factor in a similar way as described in DSBs Protocol (step-l). Here for representation, we have used EGFP-tagged human FANCD2 and mCherry-tagged human vRAGE for this ICL repair assay. Save the recorded video and arrange the data accordingly presented in DSBs Protocol (step-m). A representative movie and the still images of live recruitment EGFP-tagged human FANCD2 and mCherry-tagged human vRAGE for the ICL repair assay are shown in Figures 8[href=https://www.wicell.org#fig8]A and 8B and Methods video S2[href=https://www.wicell.org#mmc2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/897-Fig8.jpg\nFigure 8. Recruitment of ICLs repair factors at the site of damage\n(A) The representative still images of live microscopy showing time-dependent recruitment of FANCD2 and RAGE variant-V at the site of TMP mediated interstrand crosslink’s for ICLs repair in U2OS cells. The green fluorescence indicates GFP-tagged-FANCD2, whereas red fluorescence indicates mCherry tagged-vRAGE.\n(B) Quantification of the fluorescence intensity of EGFP-FANCD2 and mCherry-vRAGE before and after laser-induced DNA damage. The fluorescence intensity (in percentage) of the indicated factors in Figure 8[href=https://www.wicell.org#fig8]A of irradiated versus unirradiated regions were plotted as the relative fluorescence intensity at each time point (Error bars indicate SEM; n > 3. Scale 10 μm).\n    Your browser does not support HTML5 video.",
    "Methods video S2. Representative video file showing the live recruitment kinetics of the indicated repair factors after laser mediated DNA ICLs in U2OS cells, step 2 l\nHere green or red fluorescence represents EGFP-FANCD2, or mCherry-vRAGE, respectively.\nProtocol to study DNA ICL repair process by immunofluorescence (IF) staining method: This protocol describes the method to induce DNA ICLs, but it does not include live tracking of the repair process. It does not involve the transfection step but instead uses Paraformaldehyde (PFA) based fixation and later IF staining with the antibodies. DAY-1 (Estimated time required: <1 h)\nSeed cells in phenol red-free complete DMEM medium in the chambered slide (15μ slide 8-well Grid-500; 2–3 × 104 cells/well for U2OS and 3-4 × 104 cells/well for Hela cells, or Cellview culture dish 3 × 104 cells/well) in the evening (Note down the time). DAY-2 (Estimated time required: 2–4 h)\nNext morning, turn on the microscope incubator and set the incubator temperature to 37°C degrees, CO2 to 5%, and relative humidity to 90%–95%. At this stage, one can also turn on the microscope, laser boxes, and open the software and load the settings/parameters described in the instrumental setup. Now let the system warm-up.\nNow, pre-sensitize the growing cells with 25 μM of TM-Psoralen for 30 min as described in ICLs Protocol (step-f).\nFocus and zoom (zoom factor 3–3.2×) into the culture well and locate the region of the chamber where cells are well spaced and healthy. Note down the lane markings in the surface grid, as described in Figure 6[href=https://www.wicell.org#fig6].\nNote: Please ensure that you note down the lane and well description in the notebook (like 6D or 9H). Any error in noting can make it challenging to locate the irradiated cells after IF staining.",
    "In the settings, select the 355 nm laser and load/write the parameters, as described for ICL live microscopy in ICLs Protocol (step-i).\nNow, decide the shape and nuclear area you want to expose to radiation and draw the ROI accordingly and as described in Figures 2[href=https://www.wicell.org#fig2] and 7[href=https://www.wicell.org#fig7].\nLaser irradiates the cell as described in live-cell experiment ICLs Protocol (step-l).\nQuickly repeat steps from ICLs Protocol (step-q to t) for inducing the desired number of cells in the same or other wells in a very short time to keep the damage repair in the same time scale.\nAfter the empirically determined post-irradiation time (5, 10, 15, 30, or 60 min), process the irradiated cells as described earlier for DSBs in Protocol (step-u to v). In short, if you are planning to study the ICLs sensor signaling/recruitment (like SLX4), we recommend fixing the cells in 15 min, whereas if you are studying the nuclease mediated unhooking of the ICLs, and we suggest you to wait at least 30–45 min before fixation.\nStain the processed cells with respective antibodies and locate the irradiated cells using the noted Grid coordinates from ICLs Protocol (step-p). For the immunofluorescence staining guide, please refer to the details given in DSBs Protocol (step-v). Inspect and process the data with ImageJ or similar software.\nSingle-strand breaks (SSBs) and repair In this protocol, we describe the method to study single-strand breaks damage (SSBs damage). This protocol involves many similar steps as followed for DNA DSBs or ICLs, but differs at a few critical steps. As in the DSBs and ICL protocol, we divided this protocol into 2-sub categories. Protocol to study recruitment and repair kinetics of factors involved in single-strand breaks (SSBs) repair by live microscopy: DAY-1 (Estimated time required: <1 h)",
    "Seed cells in phenol red-free complete DMEM medium in the chambered slide (15μ slide 8-well; ∼3 × 104 (U2OS) or ∼4 × 104 (Hela) cells/well for Hela cells in 250 μL medium volume in the evening. DAY-2 (Estimated time required: 1–2 h)\nReplace the culture medium from each well with fresh medium DMEM medium (250 ul/well).\nPrepare the transfection mix with the study plasmids as shown in Tables 1[href=https://www.wicell.org#tbl1] and 3[href=https://www.wicell.org#tbl3]. We suggest using EGFP-PARP1 as a positive control. PARP1 gets recruited to SSBs within 10 s, therefore serving as a perfect positive control for SSBs. The choice of the second plasmid depends upon the experimental plan, as described in Table 1[href=https://www.wicell.org#tbl1].\nAbout 6 h of post-transfection, replace the medium with phenol red-free DMEM, and incubate the cell for 24 h. DAY-3 (Estimated time required: 2–4 h)\nAfter 22–23 h of the last medium change, turn on the microscope incubator, laser, and load the settings described in the method. Set the microscope incubator temperature to 37°C, 5% CO2, and RH to 90%–95%.\nAfter 24 h of post-transfection, transfer chambered slide containing transfected cells on the microscope stage and visualize the EGFP and other fluorescence mCherry, as shown in Figure 4[href=https://www.wicell.org#fig4].\nNow, focus as well as zoom in (zoom factor 3–3.2×) same as mentioned earlier into the well extended/grown cell with intact nuclear morphology and uniform fluorescence in the nucleus as described in Protocol 1 (step-h).\nIn the settings window, select 355 nm Laser and load/write the other settings' parameters. For most of the ssDNA damage factors, we need an exposure time of 100–150 ms (These conditions were tested U2OS, Hela, A549, HCT, HEK, fibroblasts, and other primary cells).",
    "Now, decide the shape and nuclear area you want to expose to radiation and draw the ROI as needed and described in DSBs Protocol (step-j).\nAfter setting the ROI, the next step is to set the time interval and total duration of live microscopy. PARP gets recruited to the site of the damage within 10–20 s(s); therefore, to begin with, you can check the DNA damage response/recruitment kinetics after every 15–20 s for the desired time (Table 4[href=https://www.wicell.org#tbl4]).\nNote: If the recruitment kinetics are very fast, one can adapt the time and total duration settings accordingly.\nNow, start the time-lapse and track the recruitment kinetics of the single-strand break repair positive control and test factor in a similar way as described in DSBs Protocol (step-l). For the representation, we have used mCherry tagged human PARP1 and EGFP-tagged human Cockayne syndrome group B (Csb).\nSave the recorded time-lapse and process the data accordingly with ImageJ or any other similar software as mentioned in DSBs Protocol (step-m). Here we show the representative still images of live recruitment EGFP-CSB and mCherry-PARP1 for the SSB repair assay are shown in Figure 9[href=https://www.wicell.org#fig9].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/897-Fig9.jpg\nFigure 9. Recruitment kinetics of PARP1 and CSB at the site of ssDNA breaks\nThe representative still images of live recruitment of PARP1-mCherry and CSB-EGFP at the site of SSBs in U2OS cells at indicated time points. The red fluorescence indicates mCherry tagged-PARP1, and the green fluorescence indicates EGFP tagged-CSB (Scale 10 μm).",
    "Protocol for studying the single-strand DNA damage and study the repair process by IF staining: This protocol describes the method to study ssDNA damage without tracking live recruitment studies. This protocol also can be implemented to any cell type. It does not involve the transfection step but instead uses Paraformaldehyde-based fixation and IF staining with the antibodies of interest. DAY-1 (Estimated time required: <1 h)\nSeed cells in Phenol red-free complete DMEM medium in the chambered slide (15μ slide 8-well Grid-500; 2–3 × 104 cells/well for U2OS and 3–4 × 104 cells/well for Hela cells, or Cellview culture dish 3 × 104 cells/well) in the evening (Note down the time). DAY-2 (Estimated time required: 2–4 h)\nTurn on the microscope, laser, and load settings/parameters as described in Equipment Setup. Set the microscope incubator temperature to 37°C degrees and RH to 90%–95%.\nTransfer chambered grid slide containing cells onto the microscope stage and focus and zoom-in (zoom factor 3–3.2×) to the well extended/grown cell with intact nuclear morphology as described in DSBs Protocol (step-h).\nIn the settings window, select 355 nm Laser and load/write the parameters described for live microscopy SSBs Protocol (step-h).\nNow, decide the shape and nuclear area you want to expose to radiation and draw the ROI as needed and described in DSBs Protocol (step-j).\nUse the laser settings described in ssDNA damage live microscopy protocol and irradiate the nuclei accordingly. Work quickly and repeat steps as per requirements.\nAfter a suitable post-irradiation time (as described for ss-DNA damage in Table 4[href=https://www.wicell.org#tbl4]), process the irradiated cells as described in DSBs Protocol (step-u to v) with or without CSK pre-extraction and proceed to IF staining with study markers."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Microscopy",
    "Cell Biology",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}