{
  "id": 13798,
  "origin_website": "Jove",
  "title": "Transfection, Selection, and Colony-picking of Human Induced Pluripotent Stem Cells TALEN-targeted with a GFP Gene into the AAVS1 Safe Harbor",
  "procedures": [
    "1. Preparation of Basement Membrane Matrix and Coating of Plasticware\nPlace the frozen basement membrane matrix stock from -20 °C onto ice and thaw overnight at 4 °C.\nAfter thawing, pipette 2 mg aliquots of basement membrane matrix into pre-chilled eppendorf tubes. Store these at -20 °C until needed.\nTo prepare basement membrane matrix-coated plates, thaw one aliquot on ice until the last piece of ice in the eppendorf tube disappears (usually within ~2 hr).\nAfter thawing, add basement membrane matrix to 12 ml of cold (4 °C) DMEM/F12 to make basement membrane matrix coating solution.\nAdd basement membrane matrix solution to the appropriate culture vessel. For a 6-well plate, dispense 1 ml per well. Swirl the plate to make sure the basement membrane matrix solution completely covers each well.\nParafilm seal the basement membrane matrix-coated plate/dish, and incubate at room temperature for 1 hour before use. Alternatively, store basement membrane matrix-coated plates/dishes at 4 °C and use within 2 weeks of coating.\n\tNOTE: Add extra DMEM/F12 to the basement membrane matrix-coated plate/dish to prevent drying. Before using 4 °C stored basement membrane matrix-coated plate/dish, place it in a biological safety cabinet and allow it to come to room temperature for at least 30 min.\nAspirate basement membrane matrix completely before the addition of medium and cells.\n2. Preparation of E8 medium\nPrepare E8 culture medium by thawing E8 supplement overnight at 4 °C.\nRemove 10 ml of E8 basal medium from the 500 ml stock and discard.\nPipette the entire 10 ml vial of E8 supplement directly into 490 ml of E8 basal medium. Do not warm complete E8 medium in a 37 °C water bath, as repeated temperature fluctuations can degrade the bFGF in the complete E8 medium.",
    "Use complete E8 medium within 2 weeks of addition of the supplement.\n3. Thawing of iPSCs\nRemove a vial of frozen iPSCs from liquid nitrogen and place on dry ice.\nRapidly thaw the vial in a 37 °C water bath; swirl the vial in the water bath until only a tiny fragment of ice remains.\nSpray the vial with 70% ethanol and transfer to a biological safety cabinet.\nAdd 1 ml of room temperature E8 medium dropwise directly to the vial.\nUsing a 2 ml pipette, transfer the cell suspension dropwise into 9 ml of E8 medium in a 15 ml conical tube. Swirl the tube frequently to ensure that the cells and medium mix well quickly.\nCentrifuge the cells at 200 x g for 5 min.\nAspirate the supernatant, and resuspend the cell pellet in an appropriate volume of E8 supplemented with 10 μM Y-27632.\nAdd the cells to an appropriate number of basement membrane matrix-coated wells, and place in a 37 °C, 5% CO2 incubator overnight. It is recommended to plate at least 0.2 x 106 iPSC per well of a 6-well plate to enable quick recovery after thawing.\n4. Maintenance and Routine Passaging of iPSCs\nRefresh E8 medium daily.\nMonitor the morphology and confluency of cells with an inverted microscope. iPSCs of high quality grow in flat colonies with distinct borders; individual colonies possess a “cobblestone-like” appearance.\nPassage the iPSCs cells when they reach ~70% confluency.\nPrepare an EDTA passaging solution by adding 0.9 g NaCl and 500 μl 0.5 M EDTA to 500 ml DPBS. Mix well to dissolve NaCl, and vacuum filter to sterilize. Warm an aliquot of the passaging solution in a 37 °C water bath prior to passaging.",
    "To passage, aspirate spent culture medium and wash cells once with an equal volume of warm passaging solution. Aspirate, and pipette enough EDTA passaging solution to coat the cells (1 ml per well of a 6-well plate).\nPlace the cells under an inverted microscope and observe the iPSC colonies. The appearance of holes within colonies and raised borders should become apparent within 2 to 5 min.\nCarefully aspirate the EDTA passaging solution.\nUsing a 10 ml pipette, dispense 4 ml of E8 medium (if using a 6-well plate) under high pressure directly into each well to be passaged.\nCollect the iPSC clumps, and split into an appropriate number of wells depending on the split ratio from 1:8 to 1:12. Do not over-pipette, as disaggregation of cell clumps will result in poor viability.\nPlace the plate in an incubator, and rock the plate back-and-forth and side-to-side several times to disperse the cells.\n5. Preparation of MEFs and iPSCs for Tansfection\n48 hr prior to transfection, passage iPSCs at ~1:6 into four or more wells of a basement membrane matrix-coated 6-well plate, so that they will be 70% confluent two days hence.\nThe next day, thaw DR4 MEFs into MEF medium consisting of DMEM (high glucose) supplemented with 10% FBS and 1x MEM-NEAA.\nPlate DR4 MEFs into two 10-cm dishes at ~ 2 x 104 cells/cm2 and incubate overnight at 37 °C.\nOn the day of transfection, change MEF medium to E8 supplemented with 10 μM Y-27632 30 min before performing transfection on iPSCs.\nOptional: If flow cytometric analysis of iPSCs post-transfection is desired, remove a basement membrane matrix-coated plate from 4 °C and place at room temp.\nOptional: 4 hr prior to transfection, supplement pre-transfection iPSC culture with Y-27632 at the final concentration of 10 μM.",
    "6. Gentle-cell Dissociation Reagent Treatment and Transfection of iPSCs using an Electroporation System\nRemove P3 primary cell transfection solution from 4 °C and allow it to come to room temperature for ~30 min. Add the entire 100 μl supplement to the transfection solution prior to use.\nWarm gentle-cell dissociation reagent in a 37 °C water bath.\nObtain AAVS1 TALENs (pZT-AAVS1-L1 and pZT-AAVS1-R1) and AAVS1-CAG-EGFP donor from -20 °C.\nRemove iPSCs from the incubator and wash once with DPBS.\nAdd 1 ml of gentle-cell dissociation reagent per well, and incubate iPSCs at 37 °C for 5 min, or until greater than 50% of the cells have dissociated from the culture vessel.\nPipette the cells up and down a few times using a p1000 pipette to dissociate any remaining cells from the culture vessel, and to break up iPSC clumps.\nAdd 2 ml of E8 medium to each well, and pipette up and down several times using a 10 ml pipette to further disaggregate cell clumps into single cells\n\tNOTE: Transfection efficiency declines significantly if cell clumps are not sufficiently disaggregated.\nCollect iPSCs in a 15 ml conical tube, and centrifuge at 100 x g for 3 min.\nAspirate supernatant, and resuspend cells in a minimal amount of E8 medium.\nCount the cells using a hemocytometer after application of a vital stain such as 0.4% Trypan blue. Ensure that cells are sufficiently dissociated while counting (1-3 cells per “clump”).\nDispense 3 x 106 cells into each of two 15 ml conical tubes, and spin down again at 100 x g for 3 min.\n\tNOTE: Low speed centrifugation reduces the cell stress and allows easy re-suspension of iPSCs before electroporation.\nSet the electroporation system to the cell-type specific program for the human embryonic stem cell line H9 (Program CB-150).",
    "After centrifugation, aspirate the supernatant from the cell pellets. To one pellet, add 10 μg of the HR donor as control sample. To the other pellet add 10 μg of the HR donor, along with 5 μg of each TALEN (pZT-AAVS1-L1 and pZT-AAVS1-R1) as experimental sample.\nResuspend each cell pellet in 100 μl of P3 primary cell transfection solution, and transfer to a cuvette.\nPerform the transfection and immediately add 500 μl of room temperature E8 medium to each cuvette.\nTransfer the transfected iPSCs dropwise to one 10-cm dish containing DR4 MEFs prepared in step 5.4.\nOptional: Add several drops from each experiment into one well of a basement membrane matrix-coated 6-well plate if flow cytometry anaylsis of transfection efficiency is desired.\nRepeat steps 6.15-6.17 to finish both samples. The following day, wash cells with DPBS twice and switch culture medium to NutriStem, which appears to support iPSC culture on feeders better than E8.\nTransient EGFP expression peaks at 48 to 72 hr post-transfection; assess transfection efficiency as desired.\n7. Puromycin Selection of Targeted iPSCs\nBegin puromycin selection 72 hr after transfection when the iPSCs reach 70% confluency.\nFor NCRM5 iPSCs, begin puromycin selection at 0.5 μg/ml puromycin (1/2 the full dose) diluted into NutriStem culture medium. The optimal puromycin concentration may vary from 0.25 to 1 μg/mlL for some iPSC lines.\nCulture iPSCs in NutriStem + 0.5 μg/ml puromycin for 3 days, refreshing the medium daily.\nAfter 3 days, increase the concentration of puromycin to 1 μg/ml.\nCulture iPSCs under 1 μg/ml puromycin selection for another 7 to 8 days, or until distinct colonies appear large enough for colony picking.\n8. Colony Picking and Expanding of Targeted iPSCs",
    "Use basement membrane matrix to coat a 96-well plate by dispensing 50 μl of basement membrane matrix coating solution (2 mg basement membrane matrix diluted into 12 ml DMEM/F12) into each well. Store the plate at 4 °C overnight before use.\nAfter allowing the basement membrane matrix-coated plate to come to room temperature, aspirate the basement membrane matrix and dispense 100 μl E8 supplemented with 10 μM Y-27632 into each well.\nPlace an inverted microscope into a biological safety cabinet, and spray lightly with 70% EtOH to sterilize.\nPull a glass Pasteur pipette over a Bunsen burner to obtain an ideal colony-picking tool that has a tiny “hook” at the tip. Sterilize with 70% EtOH, and place in the hood to dry.\nRemove the dish containing targeted iPSC colonies from the incubator, and place into the hood under the microscope.\nPick iPSCs by tracing a circle around the colony border with the colony-picking tool.\nUse the “hook” of the colony-picking tool to gently scrape and remove the iPSC colony from surface of the plate. For larger colonies, drawing an X with the colony-picking tool to quarter the colony will facilitate cell growth after re-plating.\nOnce cell clumps are detached and freely floating, use a p200 pipette set to ~30 μl to collect the iPSCs. Plate cells directly into the 96-well plate.",
    "Optional: use a p20 pipette set to ~5 μl to collect the iPSCs into a eppendorf tube, then add 50 μl gentle-cell dissociation reagent to digest for 5 min at 37 °C. After digestion, add 500 μl E8 medium into the eppendorf tube to dilute the gentle-cell dissociation reagent and spin down the cells at 200 x g in a standard table-top microcentrifuge for 5 min. Then aspirate most of the medium and leave ~30 μl to resuspend and transfer the cells into the 96-well plate.\n\tNOTE: This approach will facilitate the dissociation of the cell clump and quick expansion of picked colony.\nContinue colony picking until a sufficient number of iPSC colonies have been collected (roughly 20-30 colonies per experiment is recommended).\nAfter colony picking, place the 96-well plate in an incubator overnight. Refresh with complete E8 medium the following day, and culture until ~70% confluent.\nPassage cells from the 96-well into a 24-well, then into a 6-well, as described in steps 4.5-4.10.\n\tNOTE: the volumes of EDTA solution and E8 medium should be proportionally reduced when using wells smaller than a 6-well plate.\nAssess targeting success by junction PCR and Southern blot analysis to confirm targeted cassette integration and absence of randomly inserted vectors16.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}