{
  "id": 13114,
  "origin_website": "Jove",
  "title": "Generation of Induced Pluripotent Stem Cells from Turner Syndrome (45XO) Fetal Cells for Downstream Modelling of Neurological Deficits Associated with the Syndrome",
  "procedures": [
    "FCV were obtained from Manipal Hospital, Bengaluru, under Ethics Committee of Manipal Hospitals approval.\nNOTE: See Table 1 for composition of all buffers and solutions.\n1. Isolation of fibroblasts from fetal chorionic villi (FCV)\nSample collection and tissue disintegration in collagenase\nCollect FCV under sterile conditions in phosphate buffered saline (PBS) and transport (at room temperature) to the cell culture facility.\nTransfer the villi to a 60 mm Petri dish and wash several times (minimum 4 times) in PBS containing 1x Antibiotic Antimycotic solution (PBS-AA).Remove PBS-AA completely by pipetting.\nTreat the chorionic villi with 1 mL collagenase blend (5 mg/mL) for 5 min at 37 °C.\nNeutralize with cell culture medium containing 10% fetal bovine serum (FBS), transfer digest to a 15 mL tube and centrifuge at 225 x g for 5 minutes to collect the disintegrated villi and released cells as a pellet.\nSubculture and stock expansion\nPlate disintegrated villi along with released cells in a T25 culture flask containing 5 mL of complete media (e.g., AmnioMAX) and grow till a confluent fibroblast culture is obtained.\nExpand fibroblasts in culture to prepare stocks for use in subsequent transfection and characterization experiments as follows:\n\t\t\nAdd 2 mL of 0.05% trypsin to T25 flask containing FCV fibroblasts and incubate at 37 °C for 3-5 min to dissociate the cells.\nAfter incubation, neutralize trypsin by adding FBS (at the same volume as trypsin).\n\t\t\tNOTE: Culture medium containing FBS can also be used to neutralize trypsin, when added at a 1:3 trypsin: media ratio.\nCollect the dissociated cells in a 15 mL tube and centrifuge at 225 x g for 5 min to obtain cell pellet.\nDecant supernatant and resuspend cell pellet in 1 mL of complete media.",
    "Transfer 500 µL each to 60 mm tissue culture-treated dishes and make up the volume to 5 mL. This splitting ratio of 1:2, was also used for subsequent passages.\nCryopreservation\nPerform enzymatic dissociation using 0.05% trypsin as described in steps 1.2.2.1 - 1.2.2.3 and obtain cell pellet.\nDiscard the supernatant and resuspend the cell pellet in 1 mL of freezing mix, comprising 1:9 dimethyl sulfoxide (DMSO): FBS.\nTransfer contents to a sterile cryovial and place the vial in a freezing container.\nFreeze overnight at -80 °C and then transfer vials to liquid nitrogen (-196 °C) the next day.\n2. Plasmids DNA Isolation and verification\nBacterial Cell Preparation\nStreak glycerol stocks of E. coli containing the three individual plasmids pCXLE-hOCT3/4-shp53-F, pCXLE-hSK and pCXLE-hUL (from Addgene) on separate Luria Bertani-ampicillin agar plates.\nInoculate single colonies into starter cultures of 5 mL of Luria Bertani-ampicillin medium. Incubate for 8 hours at 37 °C with shaking (10 x g).\nInoculate 200 µL of this starter culture into 100 mL of Luria Bertani-ampicillin medium. Incubate overnight at 37 °C with shaking.\nHarvest overnight bacterial culture by centrifuging at 6000 x g for 15 min at 4 °C.\nPlasmid isolation with Midi Plasmid purification kit\nResuspend bacterial pellet in 4 mL resuspension buffer.\nAdd 4 mL of lysis buffer and mix thoroughly by vigorously inverting 4-6 times and incubate at room temperature for 5 min.\nAdd 4 mL of pre-chilled neutralization buffer and invert tube 4-6 times to mix thoroughly. Incubate on ice for 15 min.\nCentrifuge at ≥20,000 x g for 30 min at 4 °C. Collect supernatant in a fresh tube and re-centrifuge at ≥20,000 x g for 15 min at 4 °C.\nEquilibrate the column by applying 4 mL of equilibration buffer.\nApply the supernatant to the column.",
    "Wash the column twice with 10 mL of wash buffer.\nElute DNA with 5 mL of warm (65 °C) elution buffer.\nPrecipitate DNA by adding 3.5 mL of isopropanol to the eluted DNA. Mix well. Centrifuge at ≥15,000 x g for 30 min at 4 °C. Decant supernatant carefully.\nWash the DNA pellet with 2 mL of 70% ethanol and centrifuge at ≥15,000 x g for 10 min. Decant supernatant carefully.\nAir-dry pellet for 5-10 min and dissolve DNA in a suitable volume of PCR-grade water to obtain a final concentration of 1 µg/mL.\n\t\t​NOTE: Do not dissolve DNA in buffers as it is not suitable for electroporation. Old plasmid DNA preparation do not yield reprogrammed colonies.\nPlasmid Verification by EcoRI restriction digestion\nCombine 15 µL of nuclease-free water, 2 µL of 10x buffer, 1 µg of plasmid DNA and 1 µL of EcoRI enzyme. Mix gently.\nIncubate the mixture at 37 °C for 15 min in a heat block.\nMix the digested plasmid samples with 6x DNA gel loading dye and electrophorese on 1% agarose gel in 1x TAE buffer with 0.5 µg/mL of ethidium bromide. Include standard DNA ladder. Image the gel after the DNA has resolved appropriately. Expected EcoRI band sizes of pCXLE-hOCT3/ 4-shp53-F are 6,834 bp, 3,758 bp, and 1,108 bp; pCXLE-hUL are 10,200 bp and 1,900 bp; pCXLE-hSK are 10,200 bp and 2,500 bp.\n3. Nucleofection\nCell pelleting\nCulture the isolated fetal chorionic villi fibroblasts in T25 flask in 5 mL of complete media till 80-90% confluency.\nWash cells twice with PBS and trypsinize as described in steps 1.2.2.1 - 1.2.2.3.",
    "Remove the supernatant, resuspend pellet in 5 mL of reduced serum media (e.g., Opti-MEM). Count cells with hemocytometer and take 106 cells for nucleofection. Centrifuge at 225 x g for 5 min. Remove supernatant completely.\nReagent preparation and nucleofection\nPrepare nucleofector reagent by mixing 0.5 mL of supplement and 2.25 mL of nucleofector solution (both provided in the kit).\nAdd 100 µL of nucleofector solution in a 1.5 mL tube. Add 1µg each of pCXLE-hOCT3/4-shp53-F, pCXLE-hSK and pCXLE-hUL to the tube. Gently resuspend 106 cells (from step 3.1.2) in this mix.\nTransfer the cell-DNA suspension into cuvette, ensuring that the sample covers the bottom of the cuvette (provided in kit) without any air bubbles. Cap the cuvette and insert into the holder. Select the nucleofector Program U-23 (for high efficiency) and apply.\nRemove cuvette out of the holder and add 1 mL of complete media. Transfer the contents gently into a 60 mm tissue culture treated Petri dish filled with 4 mL of complete media (to a total of 5 mL of media). Incubate the cells in a humidified CO2 incubator at 37 °C.\nAfter 24 h, check if the cells have attached. Replace the medium completely.\n\t\tNOTE: The rate of cell death is high in nucleofection leaving few viable cells which attach.\nMaintain the cells in complete media for 10 days and shift to pluripotency media for the next 20 days.\n\t\t​NOTE: Visualize cells regularly to follow morphological changes occurring in the reprogramming cells (like epithelial morphology and compact colony formation) to confirm if the experiment is working. Around 25 iPSC colonies can be seen after 20 days of culture in pluripotency media.\n4. Picking and propagation of iPSC colonies\nPicking colony from reprogramming plate",
    "Manually dissect the embryonic stem cell-like colonies formed in the reprograming dish using pulled glass pipettes or 1 mL syringe needles and transfer to previously prepared plate with inactivated mouse embryonic fibroblast feeders with pluripotency medium or establish feeder free cultures on Matrigel coated plates with mTESR medium.\n\t\t​NOTE: Mouse embryonic fibroblasts (MEFs) were derived using enzymatic isolation from mouse embryos (dissected from 13-14 days pregnant female mice) and were mitotically inactivated by mitomycin C treatment. Establish single clone populations by growing single colonies from reprogramming plate in separate dishes or mixed clone populations by transferring many colonies from reprogramming plate to a single dish.\nMechanical transfer of emerging colonies to fresh feeders and passaging to establish stable iPSCs\nPropagate iPSCs in pluripotency medium by feeding every second day and split 1:3 every 5-7 days. Prepare stocks by cryopreserving in a freezing mix of KnockOut Serum Replacement and DMSO in the ratio 9:1.\n\t\tNOTE: KnockOut Serum Replacement is used in the freezing mix for cryopreservation of iPSCs instead of FBS as components in the FBS could induce differentiation of the pluripotent cells during long term preservation.\n5. Characterisation of iPSCs\nNOTE: Characterization studies including PCR and immunostaining for pluripotency biomarker were done after the fifth passage number. Karyotyping was performed at a later passage number.\nKaryotyping\nTreat a confluent 60 mm Petri dish of iPSCs with colcemid for 45 min in humidified CO2 incubator at 37 °C.\nHarvest by 0.05% trypsin treatment and centrifuge. Remove the supernatant and pipette the leftover traces of medium to loosen the cell pellet.\nAdd 5 mL of hypotonic solution. Mix by inverting tube and incubate for 20 minutes at 37 °C. Centrifuge at 225 x g for 5 min.\n\t\tNOTE: The obtained pellet should appear fluffy.",
    "Add 2.5 mL of Carnoy's fixative solution slowly, while tapping to loosen the pellet.\nPrepare spreads for karyotyping by dropping the cell suspension on clean glass slides.\nTreat the slides with 0.15% trypsin for 1 minute, and wash once with PBS. Then stain with Giemsa solution for 4 min and end with a distilled water wash. Acquire and process with appropriate software.\nDemonstration of transgene free status\nGenomic DNA Isolation\nPipette 20 µL of protease into the bottom of a 1.5 mL microcentrifuge tube.\nAdd 200 µL of TSiPSCs resuspended in PBS to the microcentrifuge tube.\nAdd 200 µL of Buffer AL to the sample and mix for 15 s by pulse-vortexing.\nIncubate for 10 min at 56 °C.\nBriefly centrifuge the microcentrifuge tube to remove drops from the inside of the lid.\nAdd 200 µL of ethanol (96-100%) to the sample, and mix again for 15 s by pulse-vortexing. After mixing, briefly centrifuge the tube to remove drops from the inside of the lid.\nCarefully apply the mixture from the previous step to the mini spin column (in a 2 mL collection tube) without wetting the rim. Close the cap, and centrifuge at 6000 x g for 1 min. Discard the tube containing the filtrate and place the mini spin column in a clean 2 mL collection tube.\nCarefully open the mini spin column and without wetting the rim, add 500 µL of Buffer AW1. Close the cap and centrifuge at 6000 x g for 1 min. Place the mini spin column in a clean 2 mL collection tube and discard the collection tube containing the filtrate.\nCarefully open the mini spin column and add 500 µL of Buffer AW2 without wetting the rim. Close the cap and centrifuge at full speed (20,000 x g) for 3 min.",
    "Place the mini spin column in a new 2 mL collection tube and discard the old collection tube with the filtrate. Centrifuge at full speed for 1 min to eliminate the chance of possible Buffer AW2 carryover.\nPlace the mini spin column in a clean 1.5 mL microcentrifuge tube, and discard the collection tube containing the filtrate. Carefully open the mini spin column and add 200 µL Buffer AE or distilled water. Incubate at room temperature (15-25 °C) for 5 min, and then centrifuge at 6000 x g for 1 min.\nTransgene-Free Status PCR (Using KAPA HiFi PCR Kit KR0368)\nEnsure that all reagents are properly thawed and mixed.\nPrepare a PCR master mix containing the appropriate volume of all reaction components based on Table 2 (set up reactions on ice).\nTransfer the appropriate volumes of PCR master mix, template and primer to individual PCR tubes.\nCap individual reactions, mix and centrifuge briefly.\nPerform PCR following Table 3.\nPluripotency biomarker identification\nAlkaline phosphatase (AP) staining\nPrepare a 1x AP live stain working solution by diluting 3 µL of 500x stock solution in 1.5 mL DMEM/F-12 for every 10 cm2 of culture area.\nRemove the medium from the iPSC culture dish. Wash the culture with DMEM/F-12 once. Add the 1x AP live stain solution onto the iPSCs. Incubate at 37 °C for 45 min.\nRemove the AP stain and wash twice with DMEM/F-12. Add fresh DMEM/F-12 and image under fluorescent microscope using a standard FITC filter within 30-90 min of staining.\nImmunostaining for pluripotency biomarkers\nFix confluent iPSC cultures with 4% paraformaldehyde overnight at 4 °C. Wash thrice with PBS Tween 20 (PBST), each wash for 5 min.\nPermeabilize the cells with 0.3% Triton X-100 in PBST for 15 minutes at room temperature. Wash thrice with PBST.",
    "​NOTE: Permeabilization should be done only for intracellular antigens.\nBlock cells with 3% bovine serum albumin (BSA) in PBST for 30 min at room temperature. Stain the cells with primary antibodies (diluted 1:1000 in 1% BSA) overnight. After primary antibody incubation, wash thrice with PBST.\nIncubate cells with the secondary antibody (diluted 1:1000 in 1% BSA) for 5 h at room temperature.Wash thrice with PBST.\nLabel the nuclei with 0.5 µg/mL 4',6-diamidino-2-phenylindole (DAPI) for 1 minute. Wash the cells once with PBST.\nCapture images under fluorescent microscope.\n6. ​In vitro differentiation assays\nEmbryoid Body (EB) Differentiation\nCut the iPSC colonies into small pieces, collect and plate in low attachment Petri dishes in embryoid body medium. Grow the cells for 15 days by replacing medium every 3 days.\n\t\tNOTE: The day 15 EBs can be used directly for detection of the three germ layer biomarkers. Alternatively, specific cell lineages can be induced with growth factors, followed by biomarker detection.\nEndoderm (Hepatocyte) differentiation\nGrow the iPSCs in monolayer cultures in pluripotency medium.\nOnce confluent, shift to RPMI 1640 media with 1x Insulin Transferrin Selenite and 100 ng/mL activin A for 2 days, followed by growth in RPMI 1640 media with 30 ng/mL bFGF and 20 ng/mL BMP4 for 9 days. Replace medium every 2 days.\nFrom day 10 onwards, supplement media with 0.1 µM dexamethasone. Terminate the experiment on day 20.\nMesoderm (Cardiomyocyte) differentiation\nPlate day 8 EBs on 0.5% Matrigel-coated plates in embryoid body medium. Allow the EBs to attach and collapse.\nSupplement media with 20 ng/mL BMP4 and grow for 20 days. Replace medium every 2-3 days. Terminate the experiment on day 20.\nEctoderm (Neuronal) differentiation\nPlate day 4 EBs on 2 µg/cm2 collagen type IV-coated plates in embryoid body medium.Allow the EBs to attach and collapse.",
    "Next day, shift medium to DMEM F-12 with 2mg/mL glucose, 1x Insulin Transferrin Selenite, and 2.5µg/mL fibronectin. Terminate the experiment on day 15.\nFormation of cerebral organoids\nGrow TSiPSCs in a 35 mm tissue culture dish on MEFs till 70-80% confluent. Cut the colonies and collect in a 15 mL tube. Centrifuge the cells at 225 x g for 5 min. Discard the supernatant.\nWash the pieces of colonies by resuspending in 2 mL of PBS and centrifuge to remove the supernatant.\nAdd 1 mL of 0.05% trypsin and tap the tube to dislodge the cells. Incubate the tube at 37 °C for 3-4 min to dissociate the colony pieces into a single cell suspension.\nNeutralize the trypsin by dilution with 4 mL of pluripotency media containing 10 µg/mL rho-associated protein kinase (ROCK) inhibitor Y-27632 dihydrochloride (ROCKi) to prevent dissociation induced cell death.\nCentrifuge to obtain a pellet. Discard the supernatant and resuspend the cells in 2mL embryoid body medium containing 10 µg/mL ROCKi.\nRemove 10 µL of cell suspension for cell counting. Add 10 µL of Trypan blue to detect dead cells. Count the cells using a hemocytometer.\nAdd appropriate volume of embryoid body medium with ROCKi to the cell suspension to obtain 9,000 live cells per 150 µL.\nPlate 150 µL in each well of a low-attachment 96-well plate and incubate in a humidified CO2 incubator at 37 °C. Check the plates for aggregation after 24 hours. On day 2 gently remove the medium and replace with fresh embryoid medium without ROCKi.",
    "On day 6, transfer EBs to wells of a low attachment 24 well plate containing 500 µL of neural induction medium composed of DMEM-F12 with 1% N2 supplement, 2 mM GlutaMAX supplement and 1 mM non-essential amino acids and 1 µg/mL heparin. Change the medium every 2 days.\nAfter 5 days in neural induction medium embed the neuroepithelial aggregates in Matrigel by layering a 2 cm x 2 cm square of parafilm over an empty tip tray of 200 µL tips. Press parafilm with gloved fingers over each hole in the tip tray to make small dents. Clean parafilm with 70% ethanol to sterilize.\nTransfer the parafilm square into a 60 mm dish. Use cut 200 µL tips to transfer the neuroepithelial aggregates onto the dents in parafilm. Remove excess medium by pipetting.\nAdd 30 µL of thawed Matrigel on the neuroepithlial aggregates and position the aggregate to the center of the Matrigel using a pipette tip. Place the 60 mm dish for 20-30 min in a 37 °C incubator for the Matrigel to polymerize.\nAdd 5 mL of cerebral organoid differentiation medium composed of 1:1 DMEM-F12: Neurobasal medium, 0.5% N2 supplement, 2.5 µg/mL of insulin, 2 mM GlutaMAX supplement, 0.5 mM NEAA, 1% B27 supplement and 2.5 mL of penicillin-streptomycin.\nUsing a sterile forceps turn the parafilm sheet over and agitate the dish until the Matrigel embedded aggregates fall off the sheet into the medium. Grow the embedded aggregates in a humidified CO2 incubator at 37 °C for 4 days giving media changes on alternate days.\nAfter 4 days of static culture place the 60 mm dishes onto an orbital shaker installed inside the incubator shaking at 50 rpm. Culture the organoids for 3 months giving complete media changes with cerebral organoid differentiation medium every 3 days.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}