{
  "id": 12034,
  "origin_website": "Jove",
  "title": "Isolation of Stem-like Cells from 3-Dimensional Spheroid Cultures",
  "procedures": [
    "All cell handling and media preparations should be performed with aseptic technique in a Class II biological safety cabinet (BSC).\n1. Culture and maintenance of HPrEC Cells in 2D\nCoat 100 mm culture dishes with 2 mL of 2.5 µg/cm2 fibronectin solution overnight at room temperature (RT). Aspirate the solution and let the culture dishes air dry in the BSC for 45 min. Fibronectin-coated culture dishes can be stored 2–4 weeks at 4 ˚C.\nAdd 9 mL of the prostate epithelial cell growth medium (e.g., PrEGM) to a fibronectin-coated 100 mm culture dish and keep the dish warm in a CO2 incubator at 37 ˚C.\nThaw one vial of frozen HPrEC cells (2 x 105/mL) in a 37 ˚C water bath and resuspend the cells in 10 mL of warm medium.\nCentrifuge the cell suspension at 500 x g for 5 min at RT. Aspirate and discard the supernatant.\nThoroughly resuspend the cells in 1 mL of the warm culture medium. Seed cells by pipetting 1 mL of the cell suspension directly into the fibronectin-coated 100 mm culture dish containing 9 mL of the prewarmed medium (total volume of medium and cells is 10 mL). Place culture dishes back into a CO2 incubator at 37 ˚C.\nReplenish the medium every 2 days. To do so, carefully aspirate all media and add 10 mL of fresh warm medium.\nIn about 5 days, ensure that the cultures are ~70–80% confluent. Perform the enzymatic digestion by incubating the cells with 3 mL of 0.05% Trypsin/EDTA at 37 ˚C for 5 min.\nStop the digestion by adding 3 mL of warm PBS containing 10% FBS.\nCollect the cells into a 50 mL centrifuge tube and centrifuge at 500 x g for 5 min at RT. Aspirate and discard the supernatant.",
    "Resuspend the cell pellet in 30 mL of warm medium and dispense it equally into three new fibronectin-coated 100 mm culture dishes for the next passage.\n\tNOTE: Primary HPrEC cells can be passaged ~3–5x without altering their basal epithelial cell characteristics. Epithelial phenotype is tested by expressions of basal epithelial cell markers cytokeratin 5 and p63 with immunocytochemistry/immunofluorescent (ICC/IF) assays.\n2. Labeling HPrEC with BrdU, CFSE, or Far Red pro-dyes\nNOTE: The cells can proceed either to step 2.1 or step 2.2 followed by the transfer to 3D prostasphere culture as described in step 3.1.\nSingle labeling of cells with BrdU\nCulture 2 x 105 HPrEC cells in fibronectin-coated 100 mm culture dishes with 10 mL of warm medium containing 1 µM of BrdU. Culture the cells for 10 days (over two passages) to ensure labeling of all cells including prostate stem and progenitor cells.\nAfter 10 days, carefully aspirate the PrEGM medium containing the BrdU and wash the cells with 5 mL of warm PBS. Repeat 1x.\nPerform the enzymatic digestion using 0.05% trypsin/EDTA as described in steps 1.7–1.8. Centrifuge the cells at 500 x g for 5 min at RT. Aspirate and discard the supernatant.\nResuspend the BrdU-labeled pelleted cells (5 x 104) in 500 µL of ice-cold (1:1) basement membrane matrix/medium and transfer to a 3D prostasphere culture (described in step 3.1) for 5 days to permit BrdU washout during the spheroid formation (~6 cell cycles).\nDouble labeling of cells with BrdU and CFSE or Far Red pro-dyes\nIf co-labeling for live cells is desired, take pre-labeled cells incubated with BrdU for 10 days from step 2.1 and co-label with 5 µM CFSE or Far Red live cell fluorescent pro-dyes for 30 min. Perform the co-labeling at Day 10.",
    "Carefully aspirate the medium containing BrdU and CFSE or Far Red pro-dyes. Wash the cells with 5 mL of warm PBS. Repeat the wash 1x.\nPerform enzymatic digestion using 0.05% trypsin/EDTA as described in steps 1.7–1.8. Centrifuge the cells at 500 x g for 5 min at RT. Remove and discard the supernatant.\nResuspend the co-labeled cells (5 x 104) in 500 µL of ice-cold (1:1) basement membrane matrix/medium and transfer to a 3D prostasphere culture (described in section 3.1) for 5 days to permit BrdU and CFSE or Far Red washout during the spheroid formation (~6 cell cycles).\nPerform detection of label-retaining cells in spheres (Day 5 prostaspheres) as described in steps 4.1, 4.2, 4.3, or 5.\n\tNOTE: Carboxyfluorescein diacetate succinimidyl ester (CFSE) and Far Red are long-lasting fluorescent pro-dyes and are well retained within the labeled cells. Intracellular esterase in live cells cleave the acetate groups that activate the green or red fluorescent molecules that are now membrane impermeant.\n3. Prostasphere formation in the 3D basement membrane culture system\nProstasphere culture in the 3D basement membrane matrix system\nThaw the basement membrane matrix at 4 ˚C overnight and keep on ice before use.\nGently add 1 mL of ice-cold basement membrane matrix into an equal volume of the ice-cold culture medium. Slowly mix by pipetting up and down, avoiding bubbles.\n\t\tNOTE: Pre-coat the bottom of 12 well culture plate wells with 100 µL of this solution. This will minimize the number of cells that fall through the matrix and grow as a monolayer.\nResuspend 5 x 104 HPrEC cells in ice-cold (1:1) basement membrane matrix/culture medium mix in a total volume of 500 µL.\nPipette 500 µL of this cell solution around the bottom rim of each well.",
    "Swirl the plate to evenly distribute the mixture around the rim of the well. Place the plate in a CO2 incubator at 37 ˚C for 30 min to allow the matrix to solidify.\nOnce the matrix has solidified, cover with 1 mL of warm culture medium per well. Do not disturb the basement membrane matrix ring. Carefully aim the pipette tip and dispense the culture medium to the center of the well.\n\t\tNOTE: The culture medium must be warmed to 37 ˚C when added to the solidified basement membrane matrix. The basement membrane matrix will lose its integrity and dissolve when exposed to cold/cool media.\nReplenish medium every 2 days. Carefully aspirate ~500 µL of spent medium and add 500 μL of fresh warm culture medium.\nMonitor the prostasphere formation and growth for 5–7 days using an inverted microscope.\nPassaging of prostaspheres\nHarvest prostaspheres from the matrix by carefully aspirating off as much media as possible. Avoid disturbing or picking up floating pieces of the solidified matrix.\nAdd 1 mL of dispase solution (basement membrane matrix:dispase at a 1:2 ratio). Mix thoroughly by pipetting up and down several times.\nIncubate the culture plates in a CO2 incubator at 37 ˚C for 30 min.\nTake images of prostaspheres that are at the bottom of the culture dish for sphere number counting and size measurements.\nCollect the sphere mixture into a 15 mL tube. Centrifuge the suspension at 500 x g for 5 min at RT to pellet the spheres. Aspirate and discard the supernatant.\nDisperse the spheres into single cells by digesting with 500 µL of warm 0.05% trypsin/EDTA and transferring the suspension into a 1.5 mL microcentrifuge tube.\nIncubate the microcentrifuge tube in a CO2 incubator at 37 ˚C for 5 min.",
    "Stop the trypsin action with 500 µL of warm PBS containing 10% FBS. Pass the digested sphere suspension through a 1 mL syringe with a 26 G needle 5x to dissociate the spheres into single cells.\nCentrifuge the suspension at 500 x g for 5 min to pellet the cells at RT. Aspirate the supernatant and discard.\nResuspend the cell pellet in 1 mL of warm culture medium and filter through a 40 µm pore size nylon cell strainer.\nCentrifuge the cell suspension at 500 x g for 5 min to pellet the cells at RT. Aspirate and discard the supernatant.\nResuspend the cell pellet in 1 mL of ice-cold (1:1) basement membrane matrix/culture medium and subculture in a 3D basement membrane matrix for the second passage of the prostasphere.\n4. Identification of BrdU-retaining prostate stem cells by immunofluorescent staining\nOutgrow the attached prostaspheres followed by immunofluorescent (IF) staining for prostate stem cell 2D imaging.\nHarvest prostaspheres by dispase digestion as described in steps 3.2.1–3.2.3. Centrifuge the spheres in a 1.5 mL microcentrifuge tube at 500 x g for 5 min. Discard the supernatant.\nResuspend spheres in 1 mL of warm culture medium.\nIncubate ~50 prostaspheres per well in 8 well chamber slides in 200 µL of culture medium in a 37 ˚C incubator overnight to allow for the attachment and outgrowth of spheres.\nOn Day 2, aspirate and discard the culture medium. Wash the outgrown spheres with 200 µL of PBS for 5 min.\nFix the spheres in 200 µL/well of ice-cold methanol at -20 ˚C for 20 min.\nWash the spheres with 200 µL/well of PBS for 5 min. Repeat 2x.\nAcid wash spheres with 200 µL/well of 2N HCl for 30 min at RT.\nWash the spheres with 200 µL/well of PBS for 5 min. Repeat 3x.",
    "Add 100 µL of blocking solution containing 5% normal goat serum in PBST (PBS with 0.25% Triton X-100) and incubate for 30 min at RT.\nAspirate off the blocking solution and add 100 µL of PBST containing 2% normal goat serum and primary mouse anti-human BrdU antibody (1:200) to each well and incubate in a humidified box at 4 ˚C overnight.\n\t\tNOTE: Mouse IgG antibody is used as a negative control.\nAspirate and remove the primary antibody solution. Wash the spheres with 200 µL of PBS for 5 min. Repeat 2x.\nAdd 100 µL of PBST containing 2% normal goat serum and secondary goat anti-mouse Alexa Fluor 488 antibody (1: 500) to each well and incubate at RT in the dark for 2 h.\nAspirate and remove the secondary antibody solution. Wash the spheres with 200 µL of PBS for 5 min. Repeat 3x.\nMount the slides with ~25-40 µL of aqueous mounting medium containing DAPI.\nObtain images of the stained spheres/cells with a fluorescent microscope and a color digital camera.\nWhole mount IF staining of prostaspheres for prostate stem cell 3D imaging\n\tNOTE: For whole mount IF staining, prostaspheres are handled using 1.5 mL microcentrifuge tubes.\n\t\nHarvest the prostaspheres by dispase digestion as described in steps 3.2.1–3.2.3. Centrifuge the spheres in a 1.5 mL microcentrifuge tube at 500 x g for 5 min. Aspirate the supernatant and discard.\nResuspend and fix the spheres with 1 mL of 4% paraformaldehyde at RT for 20 min. Centrifuge the spheres at 500 x g for 5 min. Aspirate the supernatant and discard.\nWash the spheres by resuspending the pellet in 1 mL of PBS. Centrifuge the spheres at 500 x g for 5 min. Aspirate the supernatant and discard. Repeat 1x.",
    "Acid wash the spheres by resuspending the pellet in 1 mL of 2N HCl for 30 min.\nWash the spheres with 1 mL of PBS for 5 min and centrifuge at 500 x g for 5 min. Aspirate the supernatant and discard. Repeat 3x.\nResuspend ~15–30 spheres in 100 µL of blocking solution containing 5% normal goat serum in PBST (PBS with 0.25% Triton X-100) and incubate for 30 min at RT.\nTo remove the blocking solution, centrifuge the spheres at 500 x g for 5 min. Aspirate and discard the supernatant.\nResuspend the spheres in 100 µL of PBST containing 2% normal goat serum and primary mouse anti-human BrdU antibody (1:200) and incubate at 4 ˚C overnight.\nWash the spheres by resuspending the pellet in 1 mL of PBS. Centrifuge the spheres at 500 x g for 5 min. Aspirate the supernatant and discard. Repeat 1x.\nResuspend the spheres in 100 µL of PBST containing 2% normal goat serum and secondary goat anti-mouse Alexa Fluor 488 antibody (1:1,000) and incubate at RT for 2 h.\nWash the spheres by resuspending the pellet in 1 mL of PBS. Centrifuge the spheres at 500 x g for 5 min. Aspirate the supernatant and discard. Repeat 1x.\nResuspend the spheres in 30–50 µL of aqueous mounting medium containing DAPI. To prevent flattening the spheres, dispense them into a well created from a 35 mm uncoated culture dish with a cover glass bottom. Then add a coverslip to the culture dish, covering the well.\nAcquire whole sphere Z-stack images using a transmitted light inverted fluorescent confocal microscope. Convert these Z-stack images into 3D images using an imaging software with freeform drawing capabilities.\n\t\tNOTE: Mouse IgG antibody is used as a negative control.\nPaired-cell analysis (4 day protocol)",
    "Culture the BrdU-labeled spheres to Day 5.\nDay 1: Harvest the spheres from a basement membrane matrix with 1 mL of dispase digestion. Disperse into single cells by 500 µL of warm 0.05% trypsin/EDTA in a 1.5 mL microcentrifuge tube as described in steps 3.2.1–3.2.11.\nResuspend the cells in 1 mL of warm culture medium.\nPlate the dispersed single cells (~300–500 per well) in 8 well chamber slides and culture in 200 µL/well culture medium overnight to allow for attachment.\nDay 2: Change culture medium with 200 µL of 2 µM cytochalasin D in the culture medium and incubate overnight at 37 ˚C to permit one cell division that pauses at late metaphase to anaphase.\nDay 3–4: Aspirate and discard the medium. Fix cells in 200 µL/well of ice-cold methanol at -20 ˚C for 20 min. Follow the immunostaining protocol for BrdU as described in steps 4.1.5–4.1.14.\nTake images of paired cells with a fluorescence microscope. Ensure that the distance between the two nuclei is less than 30 µm. Based on BrdU-retention, identify the paired stem cells as undergoing symmetric or asymmetric cell division.\n\t\tNOTE: BrdU label-retaining prostate stem cells undergo symmetric division to give rise to two daughter stem cells retaining an equal amount of BrdU, whereas stem cells undergoing asymmetric division give rise to one daughter stem cell retaining all the BrdU and the other daughter progenitor cell which has lost the BrdU label.\n5. Isolation of the CFSE label-retaining prostate stem cells by FACS sorting\nDay 5: Harvest the CFSE-labeled day 5 prostaspheres growing in 6 well culture plates in 3D culture by replacing the medium with 2 mL of dispase (basement membrane matrix: dispase at a 1:2 ratio). Pipette up and down several times to mix thoroughly.",
    "Incubate the plates in a CO2 incubator at 37 ˚C for 30 min to digest the matrix.\nCollect the sphere mixture into a 15 mL centrifuge tube. Centrifuge the spheres at 500 x g for 5 min at RT. Aspirate the supernatant and discard.\nResuspend the sphere pellet in 500 µL of warm 0.05% trypsin/EDTA, and transfer into a 1.5 mL microcentrifuge tube.\nIncubate the spheres in a CO2 incubator at 37 ˚C for 5 min. Add 500 µL of warm PBS containing 10% FBS.\nPass the spheres through a 1 mL syringe with a 26 G needle 5x to completely dissociate the spheres into single cells.\nCentrifuge the cells at 500 x g for 5 min at RT. Aspirate and discard the supernatant.\nResuspend the cells in 1 mL of warm culture medium containing 1 µg/mL propidium iodide (PI) to stain dead cells. Incubate for 1 min at RT.\nCentrifuge the cells at 500 x g for 5 min at RT. Aspirate and discard the supernatant.\nResuspend the cells in 1 mL of warm culture medium. Centrifuge the cells at 500 x g for 5 min at RT. Aspirate and discard the supernatant.\nResuspend the cells in 500 µL of warm culture medium and collect the cells in 5 mL polystyrene round bottom tubes by filtering them through 35 µm pore size cell strainer snap caps.\nPerform the analysis of trypsin-dispersed CFSE-labeled prostasphere cells with a single-channel FACS analyzer.\nGate the subpopulations of fractionated CFSEHi, CFSEMed, and CFSELo cells. Use the negative and positive controls for gating.",
    "NOTE: The presence of FACS sorted CFSE label-retaining prostate stem cells (see Hu et al.13) can be confirmed by green fluorescence microscopy and their larger cell size compared to non-retaining cells. This larger cell size is a property of prostate stem cells relative to progenitor cell populations. This may be different with other tissue types.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}