{
  "id": 6100,
  "origin_website": "Bio",
  "title": "<em>In vitro</em> Explant Cultures to Interrogate Signaling Pathways that  Regulate Mouse Lung Development",
  "procedures": [
    "Embryonic lung isolationTimed-pregnant mice (11.5-12.5 days post-coitum) are placed under general anesthesia by intraperitoneal injection of ketamine/xylazine (ketamine 100 mg/kg, xylazine 10 mg/kg) with 30 G needle according to the Institutional Animal Care and Use Committee-approved protocol (see Note 1).Once in a surgical plane (determined by lack of toe pinch and eye blink reflexes) the abdomen is rinsed with 70% ethanol (see Note 2).To collect uterus, grasp the skin with Graefe forceps and make an incision with Lahey scissors and manually open the incision. Open the peritoneal cavity, externalize the uterine structures containing embryo’s and surgically remove both uterine horns.Transfer the uterus to a 50 ml conical tube filled with cold PBS supplemented with P/S and rinse to remove blood.Transfer the uterus to a Petri dish filled with PBS supplemented with P/S and visualize using a stereo microscope with bright field fiber-optic illumination. Remove embryos from the uterus by manually opening the uterine wall with a pair of Dumont forceps. Collect and transfer the embryos with a perforated spoon to a new Petri dish kept on ice.Switch the microscope to the fluorescent mode and use GFP channel; from now on the dissection will be under fluorescent channels.Place each embryo on its left flank and visualize by epifluorescence using a 488 nm (GFP) filter (Figure 1A). Brain and limbs will be visible by auto-fluorescence. Use one pair of forceps to stabilize the embryo while gently removing skin tissue with a second pair of forceps. Remove the right forelimb first, then open the thorax along the right flank from the neck to abdomen (Figure 1B). The exposed lung and esophagus will show clear GFP fluorescence that is visible above background auto-fluorescence.",
    "The heart and the liver are removed to fully expose the lung and GI tract, all of which will are marked by GFP (Figures 1C-1D). Stomach and distal GI structures are removed and remaining GFP-positive tissue (lung and esophagus) removed using forceps to gently separate from surrounding connective tissue. Any remaining adventitial tissue should be carefully removed from the isolated lung (Figures 1E and 1F).Isolated lung tissue is transferred to individual wells of a 12-well plate containing embryonic lung culture medium with a sterile transfer pipet.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180516/20180516184406_0357.jpgFigure 1. Dissection of E12.5 embryonic lungs from ShhCre/+; RosamTmG/+ mice by fluorescence microscopy. A. Whole embryo view of E12.5 ShhCre/+; RosamTmG/+ mice with dual detection of GFP (green) and RFP (red) fluorescence. B. View after removing the right forelimb and exposure of the thoracic cavity along the right flank. C-D. View of lung and GI tract after removal of heart and liver. E. Lung and esophagus. F. Lung after removal of the esophagus. Scale bars = 500 µm.Embryonic lung cultureNote: From now on, every step should ideally be performed in a sterile environment such as a tissue culture hood. Add 2 ml of embryonic lung culture medium per well.Place a nuclepore polycarbonate (smooth side down) track-etch membrane suspended above media in each well (see Note 3).Use a sharp sterile razor blade to remove approximately 1.5 cm of a 200 μl pipet tip and use the resulting wide bore to gently capture one embryonic lung and transfer to the upper surface of the nuclepore polycarbonate track-etch membrane.Ensure that the lung is flat on the polycarbonate membrane by visualization under an inverted light microscope; gently adjust using fine forceps to ensure that it is flat.Image the lung as day 0 (Figure 2).Any treatment, including inhibitors, growth factors, siRNA etc.",
    ", should be included in culture media at this time.Transfer the 12-well plate to a humidified cell culture incubator at 37 °C and monitor the experiment by imaging at the desired time points (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180516/20180516184752_3890.jpgFigure 2. Potentiation of the hedgehog pathway by culturing in the presence of the smoothened receptor agonist SAG, induces mesodermal proliferation and blocks endoderm branching. Panels show whole-mount fluorescence images of embryonic lung endoderm (green) and mesoderm (red) cultured for 0-3 days in the presence of media containing DMSO vehicle (upper 4 panels) or media supplemented with 10 µM SAG (lower 4 panels). SAG treatment induces loss of branching and abnormal growth of mesodermal cells (red) indicative of roles played by Sonic Hedgehog signaling in the appropriate regulation of lung branching."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}