{
  "id": 17502,
  "origin_website": "Jove",
  "title": "Real-Time Dynamic Navigation System for the Precise Quad-Zygomatic Implant Placement in a Patient with a Severely Atrophic Maxilla",
  "procedures": [
    "All of the clinical protocols were approved by the Medical Ethics Review Committee of the Shanghai Ninth People's Hospital, Shanghai Jiao Tong University, School of Medicine (SH9H-2020-T29-3).\n1. Patient selection\nThe patient inclusion criteria were as follows (Table 1).\n\t\nEnsure that the patient presents a completely edentulous maxilla or partially edentulous maxilla with few extremely loose teeth (Figure 1A-G).\nEnsure that the patient has severe atrophy of the maxilla and insufficient bone volume for conventional implant placement in the anterior and/or posterior maxilla.\nEnsure that the patient is aged within 18-80 years and does not have systemic disease.\nEnsure that the patient has undergone cone beam computed tomography (CBCT) with analyzed DICOM data9.\n\t\tNOTE: The preoperative CBCT is obtained using a commercial instrument with the following scanning parameters: 7.1 mA, 96 kV, 0.4 mm voxel size, field of view of 23 cm (D) x 26 cm (H), and scan time of 18 s.\n\t\t\nUsing a planning software, confirm that the maxillary posterior bone height ranges from 1 to 3 mm in the premolar and molar regions (Cawood and Howell Class VI)11 (Table 2).\nEnsure that the measured anterior maxilla has an insufficient width to place regular implants of at least 3.75 mm diameter without additional bone grafting or insufficient height to allow the placement of implants shorter than 10 mm even with a titled approach7,12,13 (Figure 1G1-G6).\n\t\t\tNOTE: The bone thickness for placing the apex of the ZI should at least be 5.75 mm14 (Fig. 2A - B) (Table 1).\nThe patient exclusion criteria were as follows (Table 1).\n\t\nSufficient bone for conventional implant treatment.\nNarrow residual bone for which buccal bone graft is considered more appropriate.\nUntreated maxillary sinusitis or a maxillary sinus cyst.\nLocal or systemic contraindications for oral surgery and implant placement.",
    "For edentulous patients, the maxillary residual bone volume does not meet the standard of classes V or VI of the Cawood Howell classification11.\n2. Mini-screw implantation\nAdminister local anesthesia to anesthetize the patient's maxilla, bilateral maxillary tuberosity, midline palatine suture, and both sides of the anterior nasal spine.\nImplant seven to eight mini-screws (diameter: 1.0 mm, length: 9.0 mm, square cavity: 1.0 mm) in the remaining maxilla under local anesthesia to act as registration points before trajectories planning in the bilateral tubera maxillae, midline palatine suture, and nasospinale.\nSelect the bilateral maxillary tuberosity, midline palatine suture, and both sides of the anterior nasal spine as the bone anchorage areas for fiducials (Figure 3A-C).\n\tNOTE: To increase the navigation accuracy, the mini-screws should be evenly and dispersedly placed in the indicated area.\n3. Preoperative CBCT scanning for planning\nPerform CBCT using the following scanning parameters: 7.1 mA, 96 kV, 0.4 mm voxel size, field of view 23 cm (D) x 26 cm (H), and scan time of 18 s.\n4. Setting registration points\nImport CBCT data into the presurgical planning software through the DVD drive.\nMark all mini-screws as registration points for intraoperative imaging registration (Figure 3D).\n\t\nMark the points on the central surface of the titanium mini-screws; this has to be set in a certain sequence.",
    "NOTE: After the registration points are set, ensure that the intraoral coronal entrance points of the ZI are at or near the alveolar crest with the reference to the zygomatic anatomy-guided approach proposed by Carlos Aparicio15. The anterior ZI should be at the level of the lateral incisor/canine region and the posterior ZI in the second premolar/the first molar region. The apex of the mesial implant should be placed above that of the distal implant. According to the previous research, the posterosuperior region and the center of the zygoma were the ideal places for the apex of the mesial implant and the apex of the distal implant16. The length could only be chosen in the range of 30.0 to 52.5 mm. Cylindroid trajectories can be planned as the drilling path (Figure 3E-K).\n5. Planning for quad-ZI surgery\nNOTE: This protocol requires the navigation system.\n6. Surgical procedure\nLay the patient on the operating table in the supine position after general anesthesia.\n\tNOTE: It is best to situate the patient in this position before he or she is placed under general anesthesia. Otherwise, it is difficult to switch the position.\nFixed skull reference: Rigidly secure the skull reference base to the calvaria with a single self-tapping titanium screw of 1.5 x 6 mm. Secure the reference array to the base and assemble with three marked reflective spheres (Figure 4A-C). Place the navigation system camera in the 1 o'clock position to monitor the skull reference.\nRegistration: Specifically set the navigation system to the individual patient using a positioning probe with a tailor-made reflective ball to contact the outer surface of the mini-screws one after another. Then, display the available sagittal, coronal, axial, and 3D reconstruction images on the navigation screen (Figure 4D-E).",
    "NOTE: After the registration procedure, check every fiducial marker for precision. The result is acceptable if the error is mostly <1.0 mm. Otherwise, the registration procedure should be repeated until the error becomes acceptable.\nStandardization: Standardize the drilling before using it in the surgery. Use a calibration block with holes of different diameters to standardize the drill: diameter 2.5 mm (round bur), 2.9 mm (pilot drill), and 3.5 mm (expending drill). The drills should be straightly attached to the bottom of the block by the surgeon, and then the assistant needs to adjust the interface into the calibration module. The equipment will produce a sound once the process is complete.\nGingiva flap opening: Determine the extent of the incision with the guidance of surgical navigation. Lift the full thickness flap to allow an adequate view for exposing the planned implant sites.\n\tNOTE: The range of the periosteal elevation should contain the alveolar crest, lateral wall of the maxilla, and the inferior border of the zygomatic bone.\nEntrance point marking: First, find the entry point with the help of the navigation probe. Then, use the zygoma handpiece to fix the entry points. Next, find the entry of the zygomatic bone with the probe. Use the zygoma handpiece to prepare the entry point of the zygomatic bone (Figure 4F-G).\n\tNOTE: Ensure that both the operator and the assistants pay attention to the real surgical area to prevent errors made by the navigation system.\nInitial preparation: Perform the drilling procedure ensuring that it follows the trajectories from the entry to the exit point as planned. Use the 2.9 mm drill first to prepare the path from the entry point, which was located using the navigation probe, to the entry of the zygomatic bone. Prepare the mesial one first, followed by the distal one.",
    "NOTE: Check each step with the navigation probe to confirm that the path is correct according to the designed preoperative plan (Figure 4H-I).\nWiden the implant bed: Use the handpiece to extend the path from the entrance of the zygomatic bone to the terminal point designed at the surface of the zygomatic bone.\n\tNOTE: Ask the assistant to put a hand on the surface of the lateral orbital wall to ensure its safety. Ensure that the surgeon pays attention to the navigation screen rather than the surgical area.\nReadings and measurements: Enlarge the trajectory with an expanding drill having a 3.5 mm diameter. Use the measuring bar and navigation probe to check the direction and position of the trajectory. Identify the length of the implant using the measuring tool (Figure 4B).\n\tNOTE: If the depth does not meet the requirement of the planned length, it is better to prepare it to the set depth.\nImplantation: Implant the ZIs using a specific manual tool.\nSuturing: After ZI implantation, use the navigation probe to verify correct positioning. Place multi-unit abutments and healing caps on the implants and suture the incision with polypropylene 4-0 suture. The hairline incision should also be sutured after the reference frame is removed.\n7. Postoperative medication\nAdminister the patient a 5-day prescription of antibiotics, analgesics, and mouthwash solution (chlorhexidine 0.12%).\n8. Immediate restoration\nPerform immediate restoration in the patient within 72 h (Figure 5C-G).\n9. Image integration\nObtain postoperative CBCT scanning images and a panoramic radiograph to evaluate the ZI position within 72 h after surgery (Figure 5A-B). Export the postoperative data to the planning software to superimpose the image of the post-operative CBCT and the preoperative surgical plan comparing the location of the entrance point, end point, and angular deviation (Figure 5H-I, Table 4).",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}