{
  "id": 7510,
  "origin_website": "Bio",
  "title": "Studying Chemotactic Migration in Dunn Chamber: An Example Applied to Adherent Cancer Cells",
  "procedures": [
    "Collagen I coating Place a sterilised coverslip into each culture dish.Coat coverslips with 500 μL of Collagen-I solution (composition described below) for 1 h at 37°C, then wash gently with 2 mL of PBS.Immediately put 2 mL of DMEM S+ media (composition described below) in culture dishes, to prevent drying.Cell culture Use Human T47D cells at 70% confluency.Culture cells in DMEM S+ media.Wash cells twice with 1× PBS then add 1 mL of Trypsin. Incubate 5 min at 37°C.Add 2 mL of DMEM S+ media to inactivate Trypsin.Break down into individual cells by pipetting up and down gently, and then place them in 15 mL conical centrifuge tubes.Spin the cells down by centrifuging 3 min at 300× g. Aspirate supernatant and resuspend cells in 2 mL of DMEM S+ media.Mix 100 µL of cell suspension with an equal volume of Trypan Blue Solution, and count cells using Malassez counting cell.Put 105 resuspended cells in each well (when needed, cells may be transfected with a siRNA or a plasmid, before spreading).Incubate cells in cell culture incubator for two days, for optimal adherence and migration.Dunn migration assay Prewarm sterile Dunn chambers in cell culture incubator for 30 min [Dunn chamber is described at Chaubey et al. (2011) and Monypenny et al. (2009)].Warm-up DMEM S+ media in water bath.Put enough DMEM S+ media to cover the whole chamber, with the two wells and the bridge, forming a round-shaped drop.Change the media, to remove any dead cells, then pick the coverslip out of the well using the sterile injection needle and grip it with the flat tweezers.Invert the coverslip and lower it on the Dunn chamber, so that the seeded area is aligned with the wells. Leave a very tight opening (0.5 mm).",
    "Press gently but tightly on the outer edges of the coverslip, using sterile filter paper. Once the coverslip is dry, a barrier is created by media surface tension. At this stage, you should see Newton rings. Consequently, the coverslip strongly adheres to the chamber, during hours, with no air or media leakage.Empty the outer well through the tight opening using sterile filter paper. The media will be slowly drawn by capillarity.Fill the empty outer well with DMEM S+ media supplied with HRGβ1 at 10 nM.Cautiously push the coverslip 2-3 mm, just enough to seal the tight opening. The gradient will be stable for at least 8 h (Benseddik et al., 2013).See Note 1 for more information.Cell imaging Previously warm up the live-cell imaging microscope and its live-cell imaging environmental chamber for 1 h to equilibrate the temperature.Place the Dunn chamber on the stage and fix it with clips, then place it on the specimen chamber, and equilibrate the temperature for 15 min.Select fields with the annular bridge, with no more than seven single cells. Always include the outer border of the bridge in the microscope field, to identify the gradient direction.Use Metamorph® software or any cell tracking software for time lapse image acquisition, and set time-lapse imaging for 4 h with 1 frame each 4 min, using phase-contrast. Note that the frames and the total duration are set according to the speed (velocity) of each cell type.Save files and start time-lapse imaging. At the end of imaging, each field is saved in an individual folder that contains one image stack.See Note 2 for more information."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}