{
  "id": 7617,
  "origin_website": "Bio",
  "title": "Simple Methods for Permanent or Transient Denervation in Mouse Sciatic Nerve Injury Models",
  "procedures": [
    "Turn on the heating cabinet to allow anesthetized mice to recover properly after the procedure.Anesthetize mouse with Isoflurane. For this purpose, place the mouse in a clean induction chamber connected to the anesthesia device (Figure 1). Adjust the isoflurane to 3–4% and the oxygen flow to 0.8–1.5 L/min. Once anesthetized the mouse loses all its tonus [For a more detailed procedure, please refer to previously described protocols (Davis, 2008)].imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220530/20220530214951_2417.jpgFigure 1. Isoflurane anesthesia set-up. Cover Mouse cornea with a drop of Ocrygel® to prevent eyes from drying-up during the procedure.Anesthetize mouse using an intraperitoneal injection of Ketamine/xylazine mix (100 mg Ketamine/kg weight and 10 mg xylazine/ kg weight) previously diluted in a 10 mM phosphate buffered saline solution. Use a 25 G needle mounted on a 3 mL syringe.To prevent pain due to the surgical procedure, perform a subcutaneous injection of buprenorphine at the site of incision (0.1 mg/kg weight). Use a 25 G needle mounted on a 3 mL syringe.Place the mouse on the heating mat during the whole procedure to avoid any hypothermia.Shave the mouse at the hip (see Video 1 for the zone to shave).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Mouse Hair shaving process. Make a 3 mm incision in the skin over the trochanter (Figure 2A–2C) (see Video 2 to observe the approach to correctly identify the area to be incised).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220530/20220530215006_1138.jpgFigure 2. Sequential approaches to reach the sciatic nerve. <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Localization of the skin incision to correctly reach the sciatic nerve. Incise the conjunctive tissue just on the right of the hip to open a small breach through the conjunctive tissue (Figure 2D) (see Video 3 to observe the size area incised).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 3. Skin incision surgery.",
    "Push aside the muscular fascia in order to clearly visualize the nerve (see Video 4 to observe the extracted nerve) (Figure 2F–2E) (Caution: this must be done without any bleeding).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 4. Sciatic nerve isolation. Apply drops (2–3) of lurocaïne directly on the incised zone to perform a local anesthesia of the nerve. Wait at least 2 min to continue the procedure.For definitive denervation procedure Using a fine forceps (Moria N°5 or equivalent) in order to cut a small part of the nerve (1–3 mm) (Figure 3A) (see Video 5).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 5. Sciatic nerve section surgery. For a transient denervation (nerve crush procedure) Pinch for 30 s the exposed sciatic nerve with a hemostatic clip (Figure 3B) (see Video 6).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 6. Sciatic nerve crush surgery. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220530/20220530215025_0136.jpgFigure 3. Sequential approaches to reach the sciatic nerve. Stitch the skin with one or two sutures (Figure 3C–3D) (see Video 7).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 7. Skin stitching surgery.  Allow the mice to recover gently from anesthesia in the heating cabinet (25°C).Analysis of denervation effects can be appreciated by following NMJs structural changes on Tibialis anterior isolated muscle fibers. Using immunofluorescence approaches, 3 days post-surgery you will observe the absence of SV2B labeling on isolated fibers (Figure 4A–4B). Likewise, for the nerve crush procedure, you will observe the reinnervation after 15 days as SV2B staining’s begins to progressively reappear (Figure 4C–4D). Note that the overall cross section area (CSA) of muscle fibers will decreased rapidly in the course of denervation/regeneration (Ghasemizadeh et al., 2021). Alterations of the NMJs structure such as fragmentation of AchRs, disruption of NMJs area and/or decrease of synaptic myonuclei number above the NMJs can be tracked as previously described (Jones et al., 2016; Osseni et al., 2020; Ghasemizadeh et al., 2021).",
    "Analysis of transcriptional changes by monitoring gene expression along the regeneration processes also allow characterization of the time course of NMJs alterations. mRNA or proteins encoded by genes such as MyoD (Myoblast determination protein1), Myog (Myogenin), AchR-α,β,γ,δ,ϵ (Acetylcholine Receptor α,β,γ,δ,ϵ subunits), MITR (MEF2 interacting Transcription Repressor), NRG1-α,β (Neuregulin-α,β) and MusK (Muscle skeletal receptor tyrosine-protein kinase) will be key to determine the correct time course of denervation/reinnervation (Méjat et al., 2005; Thomas et al., 2015; Morano et al., 2018).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220530/20220530215040_4256.jpgFigure 4. Sciatic nerve denervation procedure effects. Isolated fibers of tibialis anterior muscle from 2-months-old WT double-stained with an antibody against synaptic vesicle glycoprotein 2B (SV2B, in green) to label the presynaptic domain of NMJs and with α-bungarotoxin–A594 (in red) to label the postsynaptic domain of NMJs. Representative immunofluorescence images of non-injured nerve (A), definitive denervation procedure (B) after 3 days and transient denervation procedure after 3 days (C) or 18 days (D). Scale bars, 10 µm."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}