{
  "id": 6745,
  "origin_website": "Bio",
  "title": "Identification of Target Protein for Bio-active Small Molecule Using Photo-cross Linked Beads and MALDI-TOF Mass Spectrometry",
  "procedures": [
    "UV stability check of compoundPut small amount (ca. 0.1-0.3 mg) of compound in glass vial.Dissolve compound with 20 μl of methanol (or soluble solvent with relatively low boiling point) and divide it into two vialsConcentrate and dry in vacuo with a high-performance rotary evaporator (Genevac) at 35 °C by “Med + Low BP mixture” solvent mode for 1 h.Irradiate one of the two vials with UV (365 nm; 4 J/cm2) with UV crosslinker.Dissolve both UV(+) and UV(-) compounds with methanol and analyze with LCMS.Compare LCMS chart of UV(+) and UV(-) compounds and check the stability of the compound against UV irradiation.Compound beads preparationWash 400 μl of NHS beads with 400 μl of 1 mM aq. HCl 3 times and subsequently with 400 μl of coupling buffer 3 times at room temperature. Briefly, add the washing solution, mix by pipetting using a pipet tip to suspend the beads totally, centrifuge in a desk-top centrifuge machine at 2,000 x g for one minute, remove and discard the supernatant.Dissolve 8.9 mg (18 μmol) of photoaffinity PEG linker in 400 μl of coupling buffer and add to the beads.Incubate the beads suspension under rotation (10 rpm) in Agilent Oven at 37 °C for 2 h.Wash beads with 400 μl of coupling buffer 3 times as with Step B1.Add 1 ml of blocking solution.Incubate beads suspension under rotation in Agilent Oven at 37 °C for 1 h.Wash beads with 400 μl of methanol 3 times and subsequently with 400 μl of MQ-water 3 times in a spin column. Briefly, add washing solution to the beads on the spin column, place the column in an Eppendorf tube, and centrifuge in a desk-top centrifuge machine at 2,000 x g for 1 min, following which the filtrate collected into the Eppendorf tube.",
    "Transfer the beads to a glass vial and add a methanol-based solution containing the compound (6 μmol/400 μl of methanol).Concentrate and dry in vacuo with high-performance rotary evaporator (Genevac) for 1 to 1.5 h (depends on solvent).Irradiate the beads with UV using UV crosslinker 4 J/cm2.Wash the free compounds with 400 μl of methanol (or soluble solvent) 15 times and subsequently with 400 μl of MQ-water 3 times in a spin column as in Step B7.Suspend the compound beads in 400 μl of PBS-1 mM NaN3 and store at 4 °C until use.Pull-down assayPreparation of cell lysatesCo-culture NIH3T3 cells and MCF7 cells (5:1; 2 x 106 and 0.4 x 106/15 cm dish, respectively) in D-MEM with 10% FCS containing penicillin and streptomycin for 48 h and harvest, wash with PBS, resuspend in wash/binding buffer containing protease inhibitors. (We usually use approximately 2 x 108 cells from 20 of 15 cm dishes and resuspend the cells in 10 ml of wash/binding buffer in 50 ml Falcon tubes. Sonicate the sample for 3 min (30 s on and 30 s off). Place the Falcon tubes on ice during sonication.)Discard the insoluble material by centrifugation at 4,400 x g for 20 min at 4 °C and transfer the supernatant into fresh falcon tubes. Typically, the concentration of the lysate used was about 16 mg/ml and we used lysates containing about 8 mg of protein for pull-down with 30 µl compound beads. The protein estimation was done using Pierce BCA protein assay kit according to their instruction.Aliquot 30 µl beads (conjugated with test compounds, negative compounds and naked) using wide bore-tip into fresh Eppendorf tubes.Wash the beads by adding 300 µl wash/binding buffer, mix gently and spin down at maximum speed for 30 s. Discard the supernatant carefully. Repeat this step twice.",
    "Add lysate containing 8 mg of protein in 500 µl of wash/binding buffer to each of the Eppendorf tube containing the beads. (Perform all the steps at 4 °C)Incubate the mixture containing beads and cell lysate at 4 °C under gentle rotating condition using a rotating mixer for at least 3 h.Spin down and discard the supernatant carefully. Wash the beads by adding 500 µl wash/binding buffer, mix gently and spin down. Discard the supernatant carefully. Repeat this step at least 3 times.After the last wash, carefully discard all the supernatant. Try not to leave any supernatant and also be careful not to displace the beads. Use loading tips for removing the supernatant. You may move the beads into fresh Eppendorf tubes if required.Add 30 µl 1x SDS buffer to the beads, keep the Eppendorf tubes at 100 °C for 5 min.Allow the sample to cool down and then load the supernatant onto a 10% SDS-PAGE gel using SDS-electrophoresis equipment (NIHON-EIDO NA-1010) and keep it for overnight staining using CBB stain. The gel was then washed in destaining solution for at least two hours. An example of stained gel is shown in Figure 1. The analyzed region is shown.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200115/20200115220900_7862.jpgFigure 1. NIH3T3 and MCF7 cells were co-cultured at a 5:1 ratio and their cell lysates were incubated with control beads, NPD8126 beads, or NPD8733 beads for 3 h. The reacted beads were washed, and the eluted proteins were separated using SDS-PAGE and stained by CBB. The protein specifically co-precipitated with NPD8733 beads was identified by MALDI-TOF-MS to be VCP (arrow). The red rectangular box indicates the approximate region of the gel portion cut out for protein identification.",
    "Identification of binding proteins by peptide mass fingerprinting using MALDI-TOF mass spectrometryCut the region of interest [usually 5 mm x 1 mm x 1 mm (thickness)] using a razor and transfer half of it (2.5 mm x 1 mm x 1 mm) into a clean Eppendorf tube. The other half is stored for backup.Wash the gel by adding 400 µl of water, incubate for 10 min and discard the supernatant. Repeat this step 5 times.Incubate with 100 µl of decolorant for 10 min at 37 °C.Wash the gel by adding 200 µl of acetonitrile, incubate for 10 min and discard the supernatant. Repeat this step twice.Dry in vacuo using SpeedVac concentrator at a machine-fixed rotation rate for about 45 min at room temperature (without heating). As dehydration proceeds, the gel usually becomes opaque.Add 50 µl of reduction solution to the dried gel and incubate at 56 °C for 30 min on a heat block.Add 100 µl of alkylating solution to the gel and incubate at 37 °C for 30 min covered with a cloth to protect from light.Wash the gel with 200 µl of 100 mM NH4HCO3 solution and discard the supernatant.Wash with 200 µl of acetonitrile twice for 10 min.Dry in vacuo using SpeedVac concentrator.Add 3 µl of digestion solution to the dried gel on ice for 30 min.Add 10 µl of 10 mM Tris-HCl (pH 8.8), and incubate at 37 °C overnight.Remove the supernatant to a new microtube. Add 10 µl of extraction solution 1 to the remaining gel bits and incubate for 10 min in an ultrasonic bath with ice-cold water at low power setting.Remove the supernatant and add it to the supernatant containing microtube from Step D13.",
    "Add 10 µl of extraction solution 2 to the remaining gel bits and incubate for 10 min in an ultrasonic bath with ice-cold water.Remove the supernatant into the supernatant containing microtube from Step D13.Repeat the Steps D15 and D16.Add 10 µl of acetonitrile to the remaining gel bits and incubate for 10 min in an ultrasonic bath with ice-cold water at low power setting.Remove the supernatant into the supernatant containing microtube from Step D13.Dry in vacuo using SpeedVac concentrator.Dissolve with 3 µl of 0.1% TFA including 5% acetonitrile.Mix 0.25 µl of the sample and equal volume of matrix solution on the target plate of a MALDI-TOF mass spectrometer.Analyze by operating a MALDI-TOF mass spectrometer in the positive ion reflector mode."
  ],
  "subjectAreas": [
    "Biochemistry",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}