{
  "id": 18807,
  "origin_website": "Jove",
  "title": "Setting-up an In Vitro Model of Rat Blood-brain Barrier (BBB): A Focus on BBB Impermeability and Receptor-mediated Transport",
  "procedures": [
    "1. Production of Rat Astrocytes\nFor each preparation use 10 neonatal Wistar rats of either sex.\nSacrifice the rats by cutting heads with a pair of scissors and transfer them immediately in a dry Petri dish under a laminar flow hood. Remove the brains from the skull without the cerebellum and transfer them immediately into a Petri dish containing cold dissection buffer: HBSS supplemented with 1% Bovine Serum Albumin (low level of endotoxin BSA), penicillin 100 units/ml and streptomycin 100 µg/ml.\nCut the brains in half, to separate the 2 cerebral hemispheres and transfer them into a clean Petri Dish with dissection buffer on ice. Cut the optic nerve and remove the meninges under a stereomicroscope.\nWash the cortical pieces extensively in 50 ml of cold dissection buffer.\nPlace the cortical pieces from 3 brains into a 15 ml Falcon tube and dissociate by pipetting up and down a couple of times with a 10 ml disposable pipette equipped with a blue tip into 6 ml of trypsin 0.05% - EDTA 0.02% for 5 min at 37 °C.\nAdd 24 ml of DMEM supplemented with 10% FBS and the following antibiotics, penicillin 100 units/ml and streptomycin 100 µg/ml, a media named glial cell media (GCM), and centrifuge at 300 x g for 5 min at RT. FBS batches were selected and validated for the growth and survival of astrocyte cutures.\nResuspend the pellet containing the dissociated cells in 10 ml GCM and plate into a 75 cm2 T-flask (T75). Change the medium the following day to remove the cell debris and DNA. Replace the culture media twice a week.",
    "After 1 week of proliferation, gently shake the glial cells with an orbital shaker at 60 rpm during 24 hr at 37 °C in GCM. If the T75 cannot be placed in an incubator with 5% CO2 / 95% air at 37 °C humidified atmosphere, supplement the media with 5 mM HEPES. Wash the cells twice to remove the non-adherent microglial cells.\nThree weeks after seeding, wash the cells twice with DPBS without calcium and magnesium. Add 3 ml of warm trypsin 0.05%-EDTA 0.02%, incubate at 37 °C and wait until the cell layer is dispersed (usually 5 min). Inhibit trypsin activity by adding 10 ml of GCM, transfer the cell suspension into a 15 ml Falcon tube and centrifuge at 120 x g for 8 min.\nResuspend the astrocyte pellet in 90% FBS – 10% DMSO, transfer them into cryovials (2 x 106 cells per cryovial) and store in liquid nitrogen.\n2. Isolation of Rat Brain Microvessels\nOur experimental procedures are approved by the Ethics Committee of the Medical Faculty of Marseille and conform to National and European regulations (EU directive No. 86/609). All efforts were made to minimize animal suffering and reduce the number of animals used.\nFor each preparation and for one experimenter, use 3 five week old Wistar rats.\nMonday of the first week, prepare 2 T75 flasks by coating with collagen type IV and fibronectin, both at 1 µg/cm2 in sterile culture water (10 ml per T75). Allow to adhere at 37 °C until microvessel seeding.",
    "Wednesday morning of the first week, euthanize the rats under an increasing flux of CO2 to induce drowsiness, loss of posture and breathing interruption, then followed by a cervical dislocation. Spray the heads with 70% ethanol. Cut the heads with a pair of scissors and transfer them into a dry Petri dish under a laminar flow hood.\nRemove the brains from the skull without the cerebellum and the optic nerves, then transfer them into a Petri dish cooled on ice and filled with cold dissection buffer (HBSS supplemented with 1% BSA, penicillin 100 units/ml and streptomycin 100 µg/ml).\nCut the brains in half to separate the 2 cerebral hemispheres and separate midbrain from forebrain. Transfer the forebrains into a clean Petri dish on ice with dissection buffer.\nTake a couple of hemispheres in a new Petri dish with cold dissection buffer to carefully remove the meninges from the forebrains under a stereomicroscope with N° 5 curved forceps. Then, clean the interior of the brain to remove the duvet of myelin and obtain a shell of cortex. These steps should not take more than 2 hr for tissue preservation and cell survival.\nDissociate the cortex from 3 brains into 6 ml of cold dissection buffer in a 7 ml dounce homogenizer by 10 up and down strokes with each of 2 pestles of different clearances, 71 µm followed by 20 µm.\nDivide the suspension to obtain the equivalent of 1 cortex in 1 ml of a 50 ml Falcon tube and centrifuge at 1,000 x g for 5 min at RT. Discard the supernatant.",
    "Digest the suspension from 1 cortex with 1 ml of an enzymatic solution containing a mix of collagenases / dispase (60 µg/ml – 0.3 U/ml), DNase type I (35 µg/ml – 20 K units/ml) and gentamicin (50 µg/ml) in a shaker for 30 min at 37 °C.\nMix the 1 ml digest from 1 cortex with 10 ml of 25 % BSA/HBSS 1X and separate by density dependent centrifugation at 3,600 x g for 15 min at RT. Carefully transfer the upper disk (myelin and brain parenchyma) and the supernatant into a clean 50 ml Falcon tube and repeat the centrifugation. Keep the resulting pellet containing the brain microvessels at 4 °C.\nCarefully discard the upper disk and the supernatant. Resuspend both resulting pellets containing the brain microvessels with 1 ml of cold HBSS 1X and transfer into a clean 50 ml Falcon tube.\nWash the microvessels by addition of 20 ml of cold HBSS 1X and centrifuge at 1,000 x g for 5 min. Discard the supernatant.\nFurther digest the microvessels from 1 cortex with 1 ml of the same enzymatic solution as described in step 2.9 during 1 hr at 37 °C in a shaker.\nThen, mix the digested microvessels from each of the 3 cortices into one tube and further separate into two 50 ml Falcon tubes to obtain microvessels extracted from the equivalent of one and a half (1.5) cortex per tube. Add 30 ml of cold dissection buffer and centrifuge at 1,000 x g for 5 min at RT.\nResuspend the microvessel pellet in 10 ml of DMEM/F12 supplemented with 20% bovine platelet poor plasma derived serum, basic fibroblast growth factor (bFGF, 2 ng/ml), heparin (100 µg/ml), gentamicin (50 µg/ml) and HEPES (2.5 mM), named endothelial cell media (ECM) supplemented with puromycin at 4 µg/ml.",
    "Take the 2 coated T75 flasks from the incubator, aspirate the excess of coating and plate the microvessels from each tube in one T75 flask (microvessels extracted from 1.5 cortex per T75 flask).\n3. Purification and Proliferation of RBEC Primocultures\nPurification: Wednesday to Friday, add puromycin at 4 µg/ml to the culture media. Change the medium on Thursday. On Friday, wash the cells and add puromycin at 2 µg/ml until Monday.\nProliferation: on Monday of the second week, wash the cells and add insulin, transferrin and sodium selenite supplement to the culture media until the cultures reach 90% confluence on Wednesday of the second week.\n4. Differentiation: Setting up the In Vitro BBB Model\nMonday of the second week, prepare filters (polyethylene, 12 wells, pore size 1.0 μm) by coating with a mix of collagen type IV and fibronectin both at 0.5µg/cm2 in sterile culture water (500 µl of mix in the upper compartment and 1.5 ml of sterile culture water in the lower compartment). Allow to adhere at 37 °C until RBEC seeding.\nMonday of the second week, five days before the establishment of the co-culture, thaw the astrocytes from cryovials at 37 °C and transfer in a 15 ml Falcon with 10 ml GCM. Centrifuge the suspension at 120 x g for 8 min at RT.\nResuspend the astrocyte pellet in GCM and plate at a density of 30 x 103 cells per cm2 in 12-well plates.\nWednesday of the second week, just before dissociation of RBEC with trypsin, wash twice the pre-coated filter with DMEM/F12 medium. Pre-fill the chambers with ECM: 1.5 ml in the lower compartment and 0.5 ml in the upper compartment.",
    "Wednesday of the second week, wash twice the RBEC with DPBS without calcium and magnesium. Add 4 ml of warm trypsin 0.05% - EDTA 0,02% solution at 37 °C per T75 flask during 30 sec exactly. Then remove 3.5 ml of trypsin solution and observe under the microscope. When the cell layer starts to detach from the matrix, help them by gently tapping the edge of the T75 flask until all the cells are floating.\nAdd 9 ml of ECM per T75 flask and transfer into a 15 ml Falcon tube. Very gently dissociate the cell suspension by pipetting up and down 4 times with a 10 ml pipette equipped with a yellow tip (avoid the production of bubbles in the solution). Count the cells in the suspension (approximately 3 x 106 cells/T75) and immediately plate on pre-coated and pre-filled filters at a high density (160 x 103 cells/filter hence approximately 18 filters/T75) (Figure 8). The following day (Thursday), change twice the medium of the upper compartment to remove cell debris.\nThursday of the second week, the day before the establishment of the co-culture, replace the astrocyte culture media by 1.5 ml of differentiation media (ECM with hydrocortisone at 500 nM) that can be supplemented with 1/3 conditioned medium from the basal compartment of a previous co-culture (3 days of contact between endothelial cells and astrocytes).\nFriday of the second week is defined as the day 0 of differentiation; replace the culture media from the filters containing the RBEC with differentiation media. Transfer the RBEC filters into the wells containing the astrocytes. Under these conditions, in vitro models differentiate and express junction-related proteins within 3 days.\nThe models keep their optimal differentiation during 3 more days, between Monday and Wednesday of the third week."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}