{
  "id": 8856,
  "origin_website": "Jove",
  "title": "Culturing In Vivo-like Murine Astrocytes Using the Fast, Simple, and Inexpensive AWESAM Protocol",
  "procedures": [
    "All animal experiments described here were performed in accordance with the guidelines for German animal welfare.\nNOTE: The timeline and main steps of the protocol are illustrated in Figure 1.\n1. Preparations\nPrepare the following solutions.\nPrepare DMEM+ for culturing polygonal MD astrocytes: DMEM with 10% FCS, 100 U penicillin and 100 µg/mL streptomycin.\nPrepare NB+H for culturing stellate astrocytes: neurobasal medium with 5 ng/mL HBEGF, 1x B-27 supplement, 1x glutamine supplement, 100 U penicillin and 100 µg/mL streptomycin.\n\t\tNOTE: Aliquots of higher concentrations of HBEGF can be prepared and stored at -20 °C to be added to the medium whenever needed.\nPrepare the dissection medium (10 mM HEPES in HBSS).\nPrepare aliquots of 6-7 mL of 0.05% trypsin-EDTA and 6-7 mL 0.25% trypsin-EDTA in 15 mL tubes. These can be stored at -20 °C and thawed in a 37 °C water bath.\nThe day before starting the protocol, coat 10 cm tissue culture-treated dishes with 5 mL of 0.04% polyethylenimine (PEI) each.\nThe next day, remove the PEI and wash the dishes with deionized, distilled water twice. Add 12 mL of DMEM+ to each plate and pre-equilibrate in the incubator at 37 °C and 5% CO2 for at least 30 min before plating cells.\nPrepare the dissection area: In a laminar flow dissection hood, place two 10 cm Petri dishes filled with dissection medium on ice. For each brain area to be isolated (e.g., cortex, hippocampus), prepare a 15-  tube filled with 14 mL dissection medium and keep on ice. Spray dissection tools (fine scissors, Dumont #3 and #5 forceps) with 70% ethanol and place next to dissection microscope in the hood.\n2. Rat or Mouse Brain Dissection",
    "NOTE: Both mice and rats can be used. Animals older than P8 may also be used (we tested up to P12), but removing the meninges will become increasingly difficult. Further, the cell yield and health will diminish, since brain cells from older animals will have formed intricate processes and connections that may break during tissue dissociation, leading to increased cell death. Cortical preparations are described here, but other brain regions can also be used.\nPlace 0.05% trypsin-EDTA in a 37 °C water bath.\nEuthanize animals (pregnant rats for E19 pups, or P0-P8 animals) by slowly raising CO2 concentration, and isolate the brains. The following steps require sterile technique.\nIf working with embryonic tissue, first remove the embryos from the uterus and open the embryonic sacs, then immediately cut off the heads with scissors. When all heads are cut off, transfer them into pre-cooled dissection medium.\nOnce the heads are submerged in the medium, open the skin and skull (both are very soft in young animals) with forceps and pinch off the cerebellum. Carefully lever the rest of the brain up and out of the skull.\n\t\tNOTE: Two to four E19 embryos yield enough tissue for at least eight 10 cm dishes of cortical astrocytes plated at 500,000 cells per dish on the day of dissection.\nFor newborn or older pups, cut off the heads with scissors, and isolate the brains by medially cutting the skin in a straight line from the back of the head to the tip of the nose. Pull the skin aside and carefully cut the skull left and right, then lift the skull bone up. Cut off the cerebellum, and lever the rest of the brain up and out of the skull.",
    "NOTE: Two to three P0-P8 pups yield enough tissue for at least eight 10 cm dishes of cortical astrocytes plated at 500,000 cells per dish on the day of dissection.\nSeparate the cortex from the underlying midbrain structure. Place the forceps within the longitudinal fissure between the hemispheres, then move the forceps in between the cortex and midbrain structures of one hemisphere (perpendicular to the longitudinal fissure) to pinch each hemisphere free.\nUsing the forceps, remove all meninges from each hemisphere (and its hippocampus), then separate the hippocampi. If hippocampal astrocytes are required, move each hippocampus into a 15 mL tube filled with 14 mL dissection medium on ice.\nRemove further areas from each hemisphere's cortex if specific regions are required (e.g., frontal cortex). Cut any cortical tissue to be used for generating astrocytes into pieces no larger than 1 mm3. Collect all pieces of cortical tissue in a separate 15-mL tube filled with dissection medium on ice.\n3. Tissue Digestion and Dissociation\nOnce all tissue pieces are collected, wait for them to settle to the bottom of the tube, then aspirate as much medium as possible.\nAdd 2-3 mL of 0.05% trypsin-EDTA using a serological pipette, and incubate the tubes in a 37 °C water bath for 20 min.\n\tNOTE: Release all trypsin-EDTA from the pipette swiftly to mix the tissue pieces and allow to settle again.\nCarefully aspirate the trypsin-EDTA, leaving tissue pieces in as little liquid as possible, at the bottom of the tube.\nAdd 5 mL of pre-cooled dissection medium to wash off the remaining trypsin-EDTA. Pipette to the side of the upper part of the tube to achieve mixing of the tissue pieces.",
    "Aspirate the dissection medium, and leave the tissue pieces in as little liquid as possible. Repeat this washing step with pre-cooled dissection medium twice more.\nAfter the final washing step, add 1 mL of DMEM+ (warmed to room temperature) using a 1,000 µL pipette tip, and triturate the tissue by pipetting up and down without introducing bubbles.\n\tNOTE: It is important to avoid producing bubbles, as this may change the pH of the solution, to which astrocytes are quite sensitive.\nPlace a 100 µm cell strainer in the opening of a 50-mL tube and pre-wet the filter with 4.5 mL of pre-cooled DMEM+.\nPipette the 1 mL of dissociated tissue suspension onto the cell strainer and add another 4.5 mL pre-cooled DMEM+ to wash the cells through the cell strainer.\n4. Cell Plating for Astrocyte Enrichment by Passaging\nCount the cells, e.g., by diluting 10 µL of the cell suspension with 10 µL trypan blue and pipetting the mix onto a hemocytometer.\nPlate 500,000 cells in 12 mL DMEM+ per 10-cm dish.\n\tNOTE: DMEM+ is helpful for astrocytic growth, more so than for neurons or microglia. During shaking, the physical forces acting on glass coverslips within wells are much stronger than those acting on the 10-cm dishes (without coverslips). If cells are shaken on 24-well plates, they become unhealthy or die. Only plate astrocytes on 24-well plates after shaking.\nKeep cell cultures in the incubator at 37 °C and 5% CO2 for seven days.\nOn day 6, the day before shaking and passaging cells, prepare the PEI-coated culture plates as described in step 5.\n5. Passaging Cells\nThe day before passaging, coat cell culture plates with 0.04% PEI.",
    "For immunocytochemistry, viral transduction, or plasmid transfection, use 24-well or 6-well plates (each containing a sterilized 12 mm or 25 mm glass coverslip, respectively).\nSterilize the glass coverslips by incubation in 70% ethanol for at least 1 h, then wash three times in deionized, distilled water before placing the coverslips in the wells.\nAdd at least 70 µL 0.04% PEI per 12-mm coverslip in 24-well plates, and 600 µL 0.04% PEI per 25 mm coverslip in 6-well plates.\nFor Western blot or RNA-Seq analysis, the 10 cm dishes already containing the cells after the dissection can continue to be used. Dishes only need to be shaken, then the cells are washed with 1x PBS and treated with NB+H (do not transfer to new dishes).\nOn day in vitro (DIV) 7 after the dissection, place the 10-cm dishes with cells in DMEM+ on a laboratory shaker in the incubator and shake the dishes at 110 rpm for 6 h.\nWash off the PEI from coated coverslips with deionized, distilled water twice. Add NB+H medium to the plates (500 µL per well for 24-well plates and 2 mL per well for 6-well plates). Pre-equilibrate the plates in the incubator at 37 °C and 5% CO2 while the 10 cm dishes are shaking, or for at least 30 min.\n20-30 min before the end of the 6 h shaking, pre-warm 1x PBS, DMEM+, NB+H, and 0.25% trypsin-EDTA to 37 °C in the water bath.\nAfter 6 h of shaking, take the culture dishes off the shaker and immediately replace the medium (that contains shaken-off neurons, oligodendrocytes, and microglia) with 10 mL pre-warmed 1x PBS per dish.\n\tNOTE: It is important to immediately aspirate the old medium containing detached cells to avoid the non-astrocytic cells re-attaching.",
    "Remove the PBS and add 3 mL pre-warmed trypsin-EDTA per dish. Incubate each dish for 4 min in the incubator at 37 °C and 5% CO2.\n\tNOTE: If preparing samples for Western blot or RNA-Seq, do not add trypsin-EDTA. Instead, replace the PBS with 12 mL pre-warmed NB+H, after which cultures can be placed back in the incubator.\nAdd 5 mL pre-warmed DMEM+ to the 3 mL trypsin-EDTA in each dish, pipette the cells off the dish using a 5 mL serological pipette, and collect the cell suspension in a 50 mL tube.\n\tNOTE: Pipette directly from the bottom of the dish - the floor of the dish should become clearer as the cells detach. Only use serum-containing medium (in place of DMEM+), as serum inactivates trypsin.\nCentrifuge the cell suspension at 3,220 x g at 20 °C for 4 min.\nRemove the supernatant and resuspend the cell pellet in 1 mL pre-warmed NB+H.\n6. Cell Plating for Final Astrocyte Cultures\nCount the cells.\nPlate 20,000 cells per well in 6-well plates (in 2 mL NB+H medium per well) or 5,000 cells per well in 24-well plates (in 500 µL NB+H medium per well).\nKeep the cell cultures in the incubator at 37 °C and 5% CO2 until further treatment or analysis.\nExchange half the medium once a week.\n\tNOTE: In low-nutrient environments, astrocytes stop proliferating but any remaining microglia will proliferate (although in our experience, no microglia appeared in AWESAM cultures). Exchanging half the medium once a week prevents enrichment of any potentially remaining microglia8, and the monocultures remain healthy for at least three weeks.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}