{
  "id": 13785,
  "origin_website": "Jove",
  "title": "Organotypic Slice Cultures for Studies of Postnatal Neurogenesis",
  "procedures": [
    "NOTE: All animal procedures conformed to the animal health and welfare guidelines of the Department of Comparative Medicine at the University of Toronto.\n1. Preparation of Hippocampal Slices\nSterilize the following instruments using the dry autoclave at 125 °C: Scalpel handle (#3) (2), Standard pattern forceps, large (1), Small dissector scissor (angled to side) (1), Micro spoon (spoon and flat spatula ends) (1), Micro-spatulas (rounded and rounded tapered ends) (2), Fine paintbrush (1), Fire polished Pasteur pipette (2), Gauze squares, 2 x 2 inches (5).\nWhen sterile, put the instruments into a sterile container and keep covered until use. Immediately before dissection, immerse instruments in a 70% ethanol solution.\nPrepare a 6-well culture plate with culture insert before beginning the dissection procedure by adding 1 ml of culture medium/well and storing the plate in the incubator at 35 °C and 5% CO2.\n2. Arrange Dissection Tools in Sterile Laminar Flow hood\nSpray the laminar flow hood with 70% ethanol and remove sterilized dissection instruments from alcohol. Allow the instruments to dry while resting on a sterile Petri dish to avoid contact between the alcohol and the dissected brain tissue.\nDeposit 5-7 ml of sterilized ice-cold dissecting solution in 2 large sterile Petri dishes. One dish will chill and clean the head (dirty), the other one for cooling and rinsing the scooped out brain (clean). Place a sterilized filter paper in one of the Petri dish lids for dissecting out the brain.\nPlace a small, sterilized filter paper in one of the small Petri dish lid for dissecting out the hippocampus. Deposit 3-5 ml of sterilized ice-cold dissecting solution in 2 small, sterile Petri dishes. One dish will hold the scooped out hippocampus, one will hold sections during separation of hippocampal sections under dissection microscope.",
    "Prepare the tissue chopper by taping a piece of sterilized filter paper to the cutting stage and mounting a sterile razor blade. Wet the filter paper with sterilized dissecting solution.\nSpray a clean bio-bag with alcohol and place it in laminar flow clean bench.\n3. Hippocampal Dissection\nSpray the P7 Sprague Dawley rat pup with 70% ethanol outside of the laminar flow clean bench and quickly decapitate the animal using large sterile surgical scissors inside the laminar flow bench. Let the head drop into ice-cold dissecting solution in one of the Petri dishes.\nIn the Petri dish, rinse off the blood and quickly transfer the head to sterilized filter paper, ventral side down.\nUsing the scalpel, cut along the dorsal surface in the sagittal plane to expose the underlying skull. Cut through the skin, but not the underlying bone, which is soft and easily penetrable in rats of this age. Set aside this “dirty” scalpel and do not use on brain tissue.\nUsing the small dissector scissors (angled to side) and forceps, cut open the skull along sagittal suture of the skull to bregma, the anatomical point on the skull where the coronal suture is intersected perpendicularly by the sagittal suture. Use forceps to pull skull flaps up and away from the midline of the skull.\nPlace the micro spoon on the underside of the brain, beneath the brain stem, to gently lift the brain out of the skull. Lift the brain to expose the optic nerves and olfactory bulb on basal surface of brain. Cut these structures with small scissors to fully detach the brain from skull. Remove and transfer the intact brain to the other large Petri dish containing ice-cold dissecting solution.",
    "Using the micro spoon, transfer the brain to a small Petri-dish lid containing sterile filter paper. With a sterile Pasteur pipette, rinse the brain with a few drops of dissecting solution to keep tissue moist.\nUsing a “clean” scalpel blade cut the two hemispheres apart. Transfer the left hemisphere back to large Petri dish with micro spoon and place hemisphere pia side down in ice-cold dissecting solution for subsequent use.\nView the medial face of the right hemisphere and identify the edge fornix, a prominent band of white matter along the medial edge of the hippocampus. Using a sterile scalpel, make a sagittal cut through the fornix, but take care because only 0.5 cm of the scalpel tip will be sufficient to cut the fornix.\nUsing 2 micro-spatulas, remove the first hippocampus from right hemisphere by placing the right-hand-spatula on the brain stem and lifting the overlying cortex with the left-hand spatula. Gently lift the cortex to reveal the lateral ventricle and medial surface of the hippocampus. A white curved line, the fimbria, should now be visible.\nAlign the curvature of spatula with the curvature of the fimbria and gently press the spatula under the fimbria. Slide the spatula left and ride along rostral-caudal axis and then lift spatula in dorsal direction to remove hippocampus.\nTransfer the hippocampus to a 2nd small Petri dish with ice-cold dissecting solution. Repeat the same procedure on the left hemisphere to remove the left hippocampus.\nUsing a micro spatula, carefully transfer the hippocampi to the tissue chopper stage. Arrange them adjacent and parallel to each other and perpendicular to the axis of the chopper blade. Use a paintbrush to position the tissue and add a few drops of the dissecting solution on top of the hippocampi.",
    "Cut the tissue in 400 μm slices without pausing to remove individual slices (usually they will not adhere to the blade). After the whole hippocampus has been cut, use the paintbrush to gently transfer the sections to a 2nd small Petri dish with dissection solution.\nUnder a dissecting microscope, carefully separate the floating slices using amicro-spatula and paintbrush.\nRemove the pre-prepared culture plate with culture insert from the incubator and place in a laminar flow hood.\nUsing a fire-polished Pasteur pipette, draw 4-5 slices into the pipette and transfer slices to the apical surface of culture insert membrane. Next, adjust the positioning with a paintbrush and leave space between individual sections and the border of the culture insert.\nUsing a sterile Pasteur pipette, remove the excess dissecting solution from apical surface of membrane.\n\tNOTE: While removing solution avoid drawing tissue sections into the pipette. Alternatively, use a regular pipette (P200 or P1000) with sterilized pipette tips to slowly remove solution.\nPlace the culture plate with serum-containing culture medium and the hippocampal slices back into the incubator at 35 °C and 5% CO2.\n\tNOTE: If experiment calls for generating cultures from multiple animals, thoroughly clean the laminar flow clean bench between dissections. Return instruments to alcohol solution and replace all Petri-dishes, filter papers and sterile razor blades prior to second dissection.\n4. Feeding and Maintaining Organotypic Slices\nFeed cultures in a sterile laminar flow clean bench.\nPerform the first feeding of the cultured sections 2 days post-dissection. Aspirate old culture medium using sterilized glass pipette.\nUse sterile 5 ml serological pipette to add 1 ml of fresh, sterile, serum-containing medium to the wells.\nGently replace the culture insert and take care to remove any air bubbles that may have formed underneath membrane surface.",
    "After the first feeding, change medium every other day.\n5. Incubating Tissue Slices with Thymidine Analogues to Label Newborn Neurons\nIn order to study the maturation and integration of dentate granule cells in the hippocampus, incubate the organotypic slices with a thymidine analogue, such as Bromodeoxyuridine (BrdU) or Chlorodeoxyuridine (CldU). Here, we use CldU because of its higher solubility in saline.\nAfter 3DIV, add 1 μl of 10 mg/ml CldU stock solution in saline to 1 ml of culture medium for a final concentration of 10 μg/ml. If BrdU is used, correct the concentration for differences in molecular weight. Add medium with CldU to culture wells and incubate tissue with CldU-containing medium for 2 hr at 35 °C.\nFollowing 2 hr of incubation at 35 °C, remove the CldU-containing medium and replace with regular feeding medium to resume normal feeding schedule (outlined above).\n6. Tissue Fixation and Storage\nEstablish a timeline for applying treatments and fixing tissue samples before starting culture experiments (Figure 2B).\nAt a predetermined day post-dissection, prepare the following in a laboratory fume hood: a 10-50 ml beaker containing 4% paraformaldehyde (PFA) in phosphate buffered saline (PBS); an empty beaker for discarded culture medium; small forceps; and a 1,000 ml pipette with disposable tips.\nRemove the culture plate(s) from incubation chamber and transfer to a fume hood. Tilt the individual well plate inserts with forceps. Next, use a pipette to remove culture medium and transfer to a disposal beaker. Tilt the culture plate at an angle to help ensure that all culture medium is removed.",
    "Finish removing medium for one culture plate at a time. When medium has been removed, add 1 ml of 4% PFA to each culture well and seal well plate with parafilm. Repeat for as many culture plates as necessary and transfer plates to refrigerator at 4 °C for 24 hr.\nAfter 24 hr, prepare the following in a fume hood: 10-50 ml beaker containing 0.1% Sodium Azide in PBS; an empty beaker for discarded PFA (follow safety precautions when discarding toxic substances); small forceps; and 1,000 ml pipette with disposable tips.\nFollow the procedure outlined in 6.4 for adding PFA, but add 1 ml of PBS with sodium azide instead. Once completely transferred, seal well plates for future use by wrapping edges in parafilm and storing in refrigerator at 4 °C.\n7. Sectioning Tissue for Immunohistochemistry\nPerform tissue sectioning using a vibratome. The following series of steps help maximize the yield of usable tissue sections from organotypic cultures.\n\tNOTE: Immediately following hippocampal dissection and plating of slices, the tissue has a thickness of approximately 400 μm. However, after 2-3 weeks in the incubation chamber, tissue slices will begin to flatten, resulting in a final section thickness of 150-300 μm.\nPrepare the following items to section cultured tissue: a #11 scalpel blade and handle, a glass Petri dish containing ice cold PBS, a micro-dissection forceps, and a clean vibratome cutting stage to mount tissue.\nUse a scalpel to carefully cut along the perimeter of the circular insert membrane so that it can be detached from the plastic insert housing. Leave ample space between the cultured slice and the scalpel.\nTransfer the detached insert membrane to a Petri dish containing PBS. After rinsing in PBS, use forceps to transfer the membrane to the vibratome mounting stage.",
    "Next, use the scalpel to eliminate excess membrane surrounding cultured slices and cut away excess material to create clean edges. This step will ensure the membrane is flat and can easily adhere to the cutting surface.\nPlace 1-2 drops of adhesive on the vibratome cutting stage and spread in even layer using a 22 G needle. Spread adhesive into a rectangular shape with the long edge parallel to the cutting blade of the vibratome. Perform this step quickly, to prevent the adhesive from drying.\nUse forceps to transfer the trimmed membrane containing hippocampal slices to the cutting stage and gently position the membrane on glue and ensure that there are no air bubbles.\nAs the superglue dries, transfer the vibratome stage with the glued membrane back to the PBS containing Petri dish. Prepare the vibratome blade and a 48 well plate containing sodium azide to store tissue sections.\nUse the vibratome to generate 30 μm sections of the organotypic slice tissue and transfer to a 48 well plate containing sodium azide for storage and subsequent immunohistochemical staining.\nRefer to pre-existing protocols for immunohistochemical staining26,29.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}