{
  "id": 10388,
  "origin_website": "Jove",
  "title": "Four-Dimensional CT Analysis Using Sequential 3D-3D Registration",
  "procedures": [
    "All methods described here have been approved by the Institutional Review Board of Keio University School of Medicine.\nNOTE: Joint kinematics are measured by reconstructing the motion of a moving bone around a fixed bone. For knee joint kinematics, the femur is defined as the fixed bone and the tibia is defined as the moving bone.\n1. CT imaging protocol\nSet up the CT machine. Acquire CT examinations with a 320-detector-row CT system to allow for multiple phases of 3D volume data with 160 mm craniocaudal coverage. For example, in the analysis of knee kinematics, the image acquisition consists of 51 volume scans with a rotation time of 0.275 s, and all images are reconstructed using half reconstruction, so that the temporal resolution is approximately 0.16 s.\nUse the following scanning parameters: peak tube voltage = 100 kVp; tube current = 40 mA; scan coverage = 160 mm; matrix size= 512 x 512 pixels; and reconstruction section thickness and section interval = 0.5 mm.\nPlace the target joint of the subject inside the CT gantry in the starting position of the 4DCT exam (Figure 1).\nBefore the CT exam, rehearse movements of the joint from the start position to the end position within the required examination time. Ask the subject to move the joint during the 10.275 s scan time and obtain a series of volume data. Store the sequential volume data in DICOM format.\nPerform static 3DCT of all the target bones and store the data in DICOM format.\n2. Surface reconstruction\nPerform semiautomatic segmentation of 3DCT data (Figure 2A).\n\t\nLoad CT DICOM data by selecting all DICOM files of the static 3DCT data.",
    "Open the label field by clicking Edit New Label Field and check which threshold CT attenuation value is appropriate to extract cortical bone from the source bone. Select materials with CT attenuation values above the threshold. For example, the bone cortex threshold for a young subject is set as 250. Check the label for bone cortex selection and manually modify the demarcation using an editing tool for consistency with the shape of the bone.\nGenerate the surface data (triangle meshes) from the labeled bone cortex position data (point cloud in the software). Store the surface data by exporting data in Standard Triangulated Language (STL) format.\nClick Generate Surface|Apply on the label of the cortical bone. Click File|Export Data As|STL Binary Little Endian to save the surface data in STL format.\nPerform automatic segmentation of 4DCT volume data (Figure 2B).\n\tNOTE: Each frame of the DICOM data includes the distribution of the CT attenuation values in the CT gantry.\n\t\nSet the threshold of the bone cortex as in static CT, and extract geometric data showing CT attenuation values above the threshold from all 51 frames of the 4DCT data using the DICOM reading module in the programming software. Adjust the threshold according to the bone density of the source bone. For example, for the osteoporotic bone, set the threshold lower.",
    "Translate all positional data that have already been obtained in the previous step into a format that can be interpreted by image processing software (e.g., Avizo). In the image processing software, reconstruct all surface data of the point cloud with higher CT attenuation values than the threshold for all 4DCT frames using a batch processing script. The image processing software contains the function to read the script and export the surface data from the DICOM series data automatically. The batch script is shown in the Supplemental Coding File.\n3. Image registration\nNOTE: In this step, reconstruct the motions of the moving bone with respect to the fixed bone from the raw 4DCT DICOM data.\nPerform surface registration from static 3DCT to the first frame of the 4DCT.\n\t\nTrim the bones in a static 3DCT into partial segment data that are included in all frames of 4DCT for use with the iterative closest point (ICP) algorithm11 in the 3D mesh editing software using the Selecting Face function (Figure 3A) by referring 4DCT movie data. The surface data from 4DCT are only partial segments that are included in each volume imagebecause surface registration requires that one surface data point is included in another surface.\nPick three landmarks in the fixed and moving bones that can be easily identified from the trimmed 3DCT surface and the surface data of the first frame of 4DCT in the 3D mesh editing software using the PickPoints function (Figure 3B).\nMatch the partial fixed and moving bones roughly on the first frame of the 4DCT surface data (Figure 3C) according to the picked landmarks in 3.1.2. Next, perform surface registration using the ICP algorithm11 using the open source software (e.g., VTK).",
    "NOTE: This process provides homogeneous transformation matrices of the fixed and moving bones from the static 3DCT to the first frame of 4DCT (Figure 3D). These matrices are 4 x 4 matrices consisting of rotation and translation, as shown in Figure 4. The transformation matrix causing the reverse action can also be calculated.\nPerform sequential surface registration (Figure 5).\n\t\nMatch the partial surfaces of the fixed and moving bone in the first 4DCT frame onto the surface data of the second frame. Next, match the partial surfaces of the ith frame onto the (i + 1)th frame of 4DCT sequentially. Repeat this process until the last frame of the 4DCT by programming with use of the ICP module in the open source software.\nCalculate transformation matrices from the static 3DCT to all frames in 4DCT according to the results of 3.1 and 3.2.\nReconstruct moving bone motion with respect to the fixed bone (Figure 6).\n\t\nReconstruct the kinematics of the moving bone with respect to the fixed bone from the matrices that represent the transformation from the static 3DCT to each 4DCT frame. Define the coordinate systems of the fixed and moving bones when the rotation parameters are measured (e.g., flexion angle or rotation angle calculated by the Euler/Cardan angle)12,13,14.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}