{
  "id": 5720,
  "origin_website": "Bio",
  "title": "A Quantitative Heterokaryon Assay to Measure the Nucleocytoplasmic Shuttling of Proteins",
  "procedures": [
    "See Figure 1 for an overview of the quantitative heterokaryon shuttling assay.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180827/20180827023635_8270.jpgFigure 1. Overview of the quantitative heterokaryon shuttling assay. Donor cells expressing a GFP-tagged nuclear RBP are seeded together with recipient cells expressing CAAX-mCherry tethered to their cell membranes. Cells are fused with PEG1500 in the presence of cycloheximide to block new protein synthesis, i.e., to avoid appearance of the RBP in the common cytoplasm not due to shuttling. After 3 h, cells are fixed and imaged by confocal microscopy. Heterokaryons suitable for analysis can be readily identified as they contain only two nuclei, at least one of which is green, and both are surrounded by a red membrane. Nuclei are imaged by confocal microscopy and GFP fluorescence is quantified in both the donor and the recipient nucleus. Given that shuttling is allowed to occur in the presence of a protein synthesis inhibitor (cycloheximide), any fluorescence in the recipient nucleus is due to shuttling of the RBP.Generate clonal transgenic donor and recipient cell linesGenerate a donor cell line expressing an eGFP-tagged RBP of interest from a BAC randomly integrated into the genome as described in Botti et al. (2017) and Poser et al. (2008) (see Notes 1-3).Generate a recipient cell line expressing a plasma membrane-localized marker of a different color (e.g., CAAX-mCherry) from a plasmid randomly integrated into the genome as described in Botti et al. (2017) (see Note 4).Using fluorescence activated cell sorting (FACS) or cloning discs, isolate clones with different fluorescence levels for the donor cell line and at least one clone with high fluorescence for the recipient cell line (see Note 5).If a specific antibody against the RBP of interest is available, estimate by Western blotting the expression levels of the eGFP-tagged RBP in different clones and select a clone with near-endogenous levels.",
    "Prepare individual cultures of donor and recipient cellsPassage donor and recipient cells onto separate 10-cm culture dishes to obtain nearly confluent cultures 1-3 days later.Mix and seed donor and recipient cells (Timing: 30 min) (see Note 6)For each combination of donor and recipient cells, place 4 sterile 18-mm coverslips into different wells of a 12-well plate. If using cell lines that normally require a pre-coated surface to increase their adherence, pre-coat the coverslips accordingly. For example, P19 cells require coating with PBS containing 0.1% gelatin, and we normally pre-coat the coverslips for 24 h at 37 °C when using this cell line.Estimate the confluence (e.g., 50%, 75%, 100%) of both donor and recipient cells.Aspirate medium and gently wash with 5 ml of pre-warmed sterile PBS. Aspirate the PBS thoroughly and add 1.5 ml of 0.05% Trypsin. Incubate for 3-5 min at RT or 37 °C (optimal conditions must be determined for each cell line).Help the cells detach from the dishes by tilting the plate in every direction.Add 3 ml of appropriate medium (e.g., DMEM) containing 10% FCS to inhibit trypsin activity. Critical Step: Disrupt the cell clumps by pipetting up and down 20 times in the cell culture dish using the fastest speed setting on your pipet controller. Make sure you obtain single cell suspensions of both donor and recipient cells by visual inspection under the microscope. Transfer each single cell suspension to a 15-ml tube.Calculate the concentration of both donor and recipient cell suspensions using a standard method (e.g., using a hemocytometer). Alternatively, use approximate values according to your cell line, culture dish (i.e., surface area) and confluence. For example, a 10-cm dish with HeLa cells grown at confluence contains approximately 8.",
    "8 x 106 cells, and following Steps C3 to C6, the corresponding cell suspension (in a volume of 4.5 ml) would contain approximately 2.0 x 106 cells/ml. In a 2-ml tube, prepare 2-ml of a 1:1 donor:recipient mixed cell suspension containing approximately 1 x 106 to 2 x 106 cells from each cell suspension. For example, if the donor cell culture was approximately 50% confluent (~4.4 x 106 cells per dish) and the recipient cell culture was approximately 100% confluent (~8.8 x 106 cells per dish), mix 1.333 ml of donor cell suspension (~9.8 x 105 cells/ml) with 0.667 ml of recipient cell suspension (~2.0 x 106 cells/ml) for a total of approximately 2.6 x 106 cells. Vortex the mixed cell suspension for 10 sec at medium speed.Transfer 1 ml of the mixed cell suspension to a 2-ml tube containing 1 ml of medium (2-fold dilution). Vortex for 10 sec at medium speed. This and the subsequent dilutions should help to obtain the optimal density for cell fusion and imaging (see Procedure I). Similarly, perform two more 2-fold serial dilutions (corresponding to 4-fold and 8-fold dilutions). The 8-fold dilution should contain approximately 2.5 x 105 to 5.0 x 105 cells.Transfer 1 ml of each mixed cell suspension (undiluted, 2-fold, 4-fold and 8-fold dilutions) onto a coverslip in a 12-well plate prepared at Step C1. Make sure the coverslips are not floating at the surface of the medium. If some of them do, help them sink at the bottom using a sterile tip. If the coverslips were pre-coated (e.g., with PBS containing 0.1% gelatin), aspirate the coating solution from each well just before adding the mixed cell suspension.Attachment of cells to coverslips (Timing: overnight [8-16 h])Incubate at 37 °C, 5% CO2 for 8-16 h.",
    "Critical Step: Incubate long enough to allow the cells to attach to the coverslips but briefly enough to avoid cell division. Recently divided cells readily fuse together, often resulting in heterokaryons containing more than two nuclei, which should not be used for shuttling quantification (see Procedure I and J). For example, mouse P19 cells divide every 16 h in the exponential growth phase, and we incubate for a maximum of 8 h at this step when using this cell line (see Note 6).Inhibition of protein synthesis (Timing: 2.5 h) (see Note 7)Critical Step: Some cell lines might not be tightly attached to the coverslips at this stage. To prevent the loss of cells, be very careful when performing each medium change or wash. This advice should be followed until the cells are fixed (Step H3). Always add medium or buffer on the sidewall of the well, not directly onto the coverslip.Aspirate medium and gently add 1 ml of medium containing 50 μg/ml cycloheximide (CHX). Incubate for 2 h at 37 °C with 5% CO2.Aspirate medium and gently add 1 ml of medium containing 100 μg/ml CHX. Incubate for 30 min at 37 °C with 5% CO2.Cell fusion (Timing: 30 min) (see Note 8)Aspirate medium and gently add 1 ml of pre-warmed PBS containing 100 μg/ml CHX.Start the timer for 2 min and 10 sec. Then, one coverslip at a time, aspirate PBS/CHX and gently add 0.25 ml of pre-warmed PEG 1500. Critical Step: Proceed swiftly (approx. 10 sec) from coverslip to coverslip. Each coverslip should be incubated for 2 min (± a few seconds). Hold the fluid aspiration device with one hand and the pipette controller with the other. For aspiration, use the same glass Pasteur pipette for all samples.",
    "To distribute PEG 1500, use the same 2-ml pipette for all samples. We do not recommend processing more than 12 coverslips within one batch. Without removing the PEG 1500, gently add 3 ml of PBS to each coverslip. Maintain a pace of about 10 sec per coverslip.Aspirate PBS and perform two more washes with 3 ml of PBS each.Aspirate PBS and gently add 1 ml of medium containing 100 μg/ml CHX.Optional: Briefly visually inspect the overall fusion efficiency under the microscope. Many cells containing several nuclei can be observed at this stage.Shuttling (Timing: 3 h)Incubate for 3 h at 37 °C with 5% CO2 (see Note 9).Cell fixation and preparation of microscope slides (Timing: 1.5 h, overnight)Aspirate medium containing 100 μg/ml CHX and add 1 ml of ice-cold PBS containing 100 μg/ml CHX.Perform a second wash with 1 ml of ice-cold PBS containing 100 μg/ml CHX.One coverslip at a time, aspirate PBS containing 100 μg/ml CHX and gently add 0.5 ml of ice-cold PBS containing 4% formaldehyde. Protect from light and incubate at RT for 20 min.Caution: Formaldehyde is toxic and should be handled in a fume hood. Wash twice each with 1 ml of PBS.Remove PBS and add 0.5 ml of TBST containing 0.25 μg/ml Hoechst 34580. Protect from light and incubate at RT for 30 min.Caution: Hoechst 34580 is potentially carcinogenic, so precautions should be taken for handling and disposal. Remove TBST containing 0.25 μg/ml Hoechst 34580 and wash twice each with 1 ml of PBS. Leave the coverslips in the PBS from the second wash.Using fine curved tweezers, retrieve each coverslip, remove as much PBS as possible by touching a napkin with the edge of the coverslip, and transfer (facing up) onto a sheet of paper.",
    "Label each coverslip by writing on the sheet of paper next to it.Protect from light and allow to dry completely (at least 15 min).One coverslip at a time, add 13.5 μl of ProLong® Diamond Antifade mounting reagent to a microscope slide, pick up the coverslip using tweezers and invert it onto the drop of mounting reagent. Critical: Avoid pipetting air bubbles onto the slide. Protect from light and incubate at RT for at least 16 h on a level surface. Pause Point: Slides may be stored up to 24 h at RT and then for several weeks at 4 °C until imaging. Imaging (Timing: 4-6 h per sample for 15 heterokaryons)Note: We recommend that the imaging settings (excitation/emission wavelengths, laser power, gain, offset, etc.) be optimized for each donor cell line (e.g., expressing an eGFP-tagged protein of interest) and recipient cell line (e.g., expressing CAAX-mCherry) grown separately on coverslips and processed in parallel with the samples. Make sure that the combination of fluorophores and settings do not generate any cross-talk.For each sample (i.e., for each pair of donor-recipient cell lines), choose the coverslip containing the optimal cell density by visual inspection of Hoechst fluorescence. Cell density should be high enough so that pairs of nuclei often appear in close proximity to each other but clearly separated from surrounding nuclei (see Notes 10-12).Move the objective toward the periphery of the coverslip until cell density is reduced and/or cells appear damaged, then move the objective back into the region suitable for analysis (see Note 13).Perform a systematic search for the desired cell fusion (donor-recipient) events using Hoechst fluorescence. Nuclei in fused cells are very close to each other and often display complementary shapes, although it is not always the case (see examples in Figures 2 and 3).",
    "When using cells from two different species (e.g., mouse and human), finding heterokaryons can sometimes be facilitated by the presence of distinct heterochromatin patterns specific to each species (Borer et al., 1989). Note that heterokaryons suitable for analysis (i.e., clearly containing only one donor and one recipient nuclei) constitute rare events (< 0.01% of the cells on the examined coverslip).Before imaging, confirm that both nuclei are surrounded by a common, red membrane in the mCherry channel (see Note 14).Using the confocal microscope acquisition settings, find the optimal focus (middle of the cells on the Z-axis), define the area to be imaged and take a picture in all three channels (mCherry, eGFP and Hoechst, see Figures 2 and 3). Use the same frame size and resolution for all pictures in a given analysis; according to our experience, imaging an area of 67.4 x 67.4 μm with a resolution of 1,024 x 1,024 pixels generates high-quality images with a reasonable scanning time and almost always allows us to include at least one nucleus from an unfused recipient cell (or at least part of it) for background subtraction.Acquire z-stacks of eGFP and Hoechst fluorescence with the same number of slices for all pictures in a given analysis. In our experience, 10 to 12 slices with an interval of 0.31 μm allow covering almost the entire nucleus in the Z-axis. To minimize scanning time and bleaching of eGFP fluorescence, we recommend imaging first all slices in the eGFP channel and then all slices in the Hoechst channel. We do not deem it necessary to acquire z-stacks of CAAX-mCherry as it significantly increases scanning time; however, make sure to keep the picture generated in Step I5) as evidence that the two nuclei originate from a fused donor-recipient cell.",
    "Resume the systematic search for desired donor-recipient cell fusion events and repeat Steps I4 to I6. We recommend imaging a minimum of 15 pairs of nuclei per sample for proper statistical analysis.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180827/20180827023659_3214.jpgFigure 2. Examples of clonal donor and recipient cell lines that can be used in quantitative heterokaryon assays. Upper left panel, mouse P19 cells expressing GFP-tagged SRSF5, an RBP with nucleocytoplasmic shuttling activity (Botti et al., 2017), are used as donor cells. SRSF5-GFP is expressed at near endogenous levels from a BAC randomly integrated into the genome, resulting in physiological localization of the protein throughout the nucleoplasm with enrichment in nuclear speckles. Note the highly similar GFP fluorescence levels in all cells due to the use of a clonal cell line. An inset shows the characteristic Hoechst staining pattern for mouse P19 cells. Upper right panel, human HeLa cells expressing CAAX-mCherry in their cell membranes are used as recipient cells. CAAX-mCherry is expressed at uniform levels in all recipient cells due to the selection of a high-expressing clone following random integration of plasmid TH0477 into the genome. An inset shows the characteristic Hoechst staining pattern for HeLa cells. Lower panel, donor and recipient cell lines shown in upper panels were used in the quantitative heterokaryon assay. The image shows a heterokaryon, i.e., a cell containing one nucleus from a donor P19 cell and one nucleus from a recipient HeLa cell, both surrounded by a common membrane marked with CAAX-mCherry. An inset shows the Hoechst staining patterns of both nuclei of the heterokaryon. The orange asterisk indicates an unfused HeLa cell and the yellow asterisk, an unfused P19 cell. Note the conspicuous presence of GFP signal in the recipient HeLa nucleus and its absence from the unfused HeLa nucleus (see also Figure 3).",
    "Also note the absence of CAAX-mCherry signal in membranes surrounding unfused P19 nuclei. Scale bars = 10 μm.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180827/20180827023714_5072.jpgFigure 3. Cell type-specific shuttling activity can be studied using quantitative heterokaryon assays. Left and middle panels, mouse P19 cells expressing SRSF5-GFP were used as donor cells before (left) and after (middle) 9 days of differentiation into neural cells. Right panel, a mouse NIH3T3 clonal cell line expressing SRSF5-GFP was used as donor cell line. SRSF5-GFP shuttles efficiently in pluripotent (P19) cells but poorly in differentiated (P19 and NIH3T3) cells. See Botti et al. (2017) for quantification and comparison of the shuttling activity of SRSF5 in these different cell types. Note the complete absence of GFP signal from unfused HeLa nuclei (indicated by orange asterisks). Scale bars: left panel = 5 µm; middle panel = 5 µm; right panel = 10 μm.Image analysis and quantification of fluorescence (Timing: 2-3 h for 15 images)Open Fiji (ImageJ Version 2.0.0-rc-43/1.51h or more recent).Open the Region Of Interest (ROI) Manager by selecting “Analyze → Tools → ROI Manager…”.Open image (select “View stack with: Hyperstack”, “Color mode: Composite” and “Autoscale”.Select “Image → Stacks → Z Project…”, “Start slice: 1”, “Stop slice: 10” (or 12, include all slices), “Projection type: Max Intensity”.Select “Image → Color → Split Channels”.Click on the picture generated in the Hoechst channel and select “Image → Lookup Tables → Grays”.Select “Image → Adjust → Brightness/Contrast” and make both the donor and recipient nuclei as visible as possible while still being able to distinguish them from each other.If the donor and recipient nuclei are in very close proximity to each other, draw a line between them using the Pencil Tool.Adjust the brightness and contrast to see the entire donor and recipient nuclei as clearly as possible.",
    "Zoom on the donor/recipient nuclei as much as possible so that they are entirely visible in the window. Using Freehand selections, draw the border of the donor cell.In the ROI Manager window, click “Add [t]”. This will generate an ROI with a specific number.In the list, click on the number corresponding to the ROI and select “Rename…” and then “Rename As: Image 1 donor”.Draw the border of the recipient nucleus, add to the ROI Manager and rename as “Image1 recipient”.Zoom out as necessary and zoom in on the nucleus of an unfused recipient cell.Draw the border of the nucleus from the unfused recipient cell, add to the ROI Manager and rename as “Image 1 background”.Click on the original (.czi) picture and select “Image → Stacks → Z Project…”, “Start slice: 1”, “Stop slice: 10” (or 12, include all slices), and “Projection type: Sum Slices” (see Note 15).Select “Image → Color → Split Channels.Click on the image of the eGFP fluorescence and select “Image → Type → 16-bit”.In the ROI Manager window, select the ROI corresponding to the donor nucleus and click on “Measure”. A Results window will open. Make sure the following data have been generated: Area, Mean, Min, Max and Slice.In the ROI Manager window, select the ROI corresponding to the recipient nucleus and click on “Measure”.Repeat for the background nucleus.Close all images and repeat Steps J3 to J21 with image 2.To save the ROIs for documentation, select in the ROI Manager “More >>… Save”.Save the results in a Microsoft Excel file by clicking on the Results window and selecting “File → Save As…”.Open the Excel File. For each image, subtract the mean pixel intensity (Mean) of the unfused recipient nucleus from that of both the donor and recipient nuclei.",
    "This yields the background subtracted mean pixel intensity for each nucleus.For both the donor and recipient nuclei, multiply the background subtracted mean pixel intensity by the area to obtain the total pixel intensity.Divide the total pixel intensity of the recipient nucleus by that of the donor nucleus and multiply by 100 to obtain the value of the Shuttling capacity (%)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}