{
  "id": 2238,
  "origin_website": "Cell",
  "title": "Co-culture Systems of Drug-Treated Acute Myeloid Leukemia Cells and T Cells for In Vitro and In Vivo Study",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nIsolation PBMCs from LRSCs\nTiming: 2 h\nLRSCs were used as sources of PBMCs in this protocol, and it can be adapted based on the different types of materials. Since aging has an impact on the reduced output of naïve T cells due to thymic involution, decreased T cell repertoire diversity, weak activation of T cells, and increased memory T cells (Salam et al., 2013[href=https://www.wicell.org#bib19]). Given the circumstances that a significant decline of thymopoiesis over 40 and is less than 10% for those over 50 years of age, LRSCs from younger donors would be preferable (Hakim et al., 2005[href=https://www.wicell.org#bib10]; Naylor et al., 2005[href=https://www.wicell.org#bib14]). The vast majority of our healthy donors are 25–50 years old.\nDisinfect the LRSC and tubing with 70% ethanol, and then cut each end of tubing to allow the blood flow into a 50 mL centrifuge tube.\nRinse the LRSC with 35 mL isolation buffer (2 mM EDTA in PBS) with a 10-mL syringe with a 22-gauge needle and mix well.\nAdd 15 mL pre-warmed 18°C–20°C Ficoll-Paque PLUS to the 50 mL centrifuge tube using a clean Pasteur pipette.\nCarefully layer 25 mL diluted blood sample onto the Ficoll-Paque PLUS by tilting the tube (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/171-Fig2.jpg\nFigure 2. Isolation of CD3+ T Cells from LRSCs\n(A) Gently layer the diluted LRSCs onto the Ficoll-Paque PLUS solution.\n(B) The different layers after density gradient centrifugation. The upper layer contains the plasma/platelets; while the PBMCs are located at the interface between plasma/platelets and Ficoll-Paque PLUS buffer.\n(C) Incubation of the PBMCs and CD3 magnetic microbeads.\n(D) Enrichment of CD3+ T cells via magnetic isolation.\nCritical: When layering the sample do not disturb the interface between Ficoll-Paque PLUS and the diluted blood sample.",
    "Alternatives: Other PBMC isolation tubes such as SepMate tubes from STEMCELL Technologies or Cellular Preparation Tubes from BD Biosciences could also be applicable.\nCentrifuge at 400 × g for 30–40 min at 18°C–20°C. Troubleshooting 1\nCritical: Use centrifuge with swing buckets and with the brake-off mode to minimize the perturbation among interface. The temperature should keep at 18°C–20°C. Higher temperatures will accelerate the sedimentation of cells leading to lower yield, while the lower temperature can taper the sedimentation of cells, causing contamination of PBMCs.\nAspirate the upper layer, leaving the mononuclear cell layer undisturbed at the interface (Figure 2[href=https://www.wicell.org#fig2]B).\nCarefully transfer the mononuclear cell layer to a new 50 mL conical tube.\nCritical: Remove all the interface material in a minimal volume. Transfer excessive supernatant will cause platelet contamination while removing redundant Ficoll-Paque PLUS could lead to granulocytes contamination.\nWash cells by bringing the volume up to 50 mL with the isolation buffer (at least three times of the volume), gently suspend the cells by drawing in and out of a Pasteur pipette, and centrifuge at 300 × g for 10 min at 18°C–20°C. Carefully remove the supernatant completely.\nResuspend the cell pellet in 50 mL isolation buffer, mix 10 μL cell suspension and 10 μL trypan blue staining, apply 10 μL mixture to an automatic cell counter and calculate the cell concentration and viability.\nPellet the cells at 200 × g for 10 min at 18°C–20°C. Aspirate supernatant completely and then proceed to CD3+ T cells isolation.\nNote: For one LRSC, the number of PBMCs by this step should be 0.5 × 109–2 × 109, half of which are CD3+ T cells. Determine the cell number of PBMCs used for the isolation and the rest could be cryopreserved.",
    "Optional: Add 15 mL ammonium chloride to lyse the red blood cells and incubate for 5 min at 20°C if the cell pellet is red. Then wash with the isolation buffer.\nOptional: Resuspend the cell pellet in freezing buffer to achieve a cell density of 10–50 × 106 cells per mL, and add 1 mL freezing mix to each cryovial. Immediately place the cryovials into a freezing container and store at −80°C. For long-term storage, transfer the cryovials to the liquid nitrogen the next day.\nPause Point: The PBMCs can be stored at −80°C for up to one month or liquid nitrogen for later separation.\nIsolate CD3+ T Cells Using Magnetic Beads Technique\nTiming: 2 h\nTo acquire optimal purity and cell viability, work fast, keep cell cold, and use pre-cool solutions. Pre-cool the centrifuge to 4°C. If working with cryopreserved PBMCs, pass the cells through a 30 μm mesh cell strainer to remove cell clumps. Alternatively, the thawed cell pellet can be incubated for 15 min at 37°C in 5 mL of RPMI 1640 complete medium with 20–200 U/mL DNase I to prevent unwanted cell clump.\nResuspend the cell pellet in 80 μL of MACS buffer per 10⁷ total cells in a 15 mL or 50 mL centrifuge tube.\nNote: For larger cell amount, scale up the volume. For example, resuspend 2 × 10⁷ cells in 160 μL MACS buffer.\nAdd 20 μL of CD3 MicroBeads per 10⁷ total cells. Mix well and incubate for 15 min in the refrigerator (2−8°C). Flick the bottom of the tube to mix up every 5 min (Figure 2[href=https://www.wicell.org#fig2]C).",
    "Wash cells by adding 1−2 mL of MACS buffer per 10⁷ cells, mix by drawing in and out of a pipette, and centrifuge at 300 × g for 10 min at 4°C. Discard the supernatant completely.\nResuspend the cell pellet gently in 500 μL of MACS buffer per 10⁸ cells, avoid air bubbles during pipetting.\nPlace LS column in the magnetic field of MACS Separator. Pre-wet the column with 3 mL MACS buffer.\nApply cell suspension onto the column. Collect flow-through containing unlabeled cells (Figure 2[href=https://www.wicell.org#fig2]D).\nWash column with 3 mL of MACS buffer for three times.\nCritical: Work gently, apply buffer with bubbles onto the column may clog the column. If bubbles appear on the surface, remove it with a pipette or a vacuum filter.\nRemove the column from the separator and place it on a 15 mL centrifuge tube.\nPipette 5 mL MACS buffer onto the column. Immediately flush out the magnetically labeled cells by firmly pushing the plunger into the column. Repeat it with another 5 mL MACS buffer.\nDetermine the cell number and centrifuge at 300 × g for 10 min at 4°C. Troubleshooting 2\nNote: More than half of the cells in PBMCs from LRSCs are CD3+ T cells. Hence, when working with 20 × 106 PBMCs, you will harvest around 5 - 10 × 106 T cells.\nNote: Take out the desired number of CD3+ T cells for downstream assays, and the rest of CD3+ T cells could be cryopreserved.",
    "Alternatives: Negative selection methods (such as the Dynabeads untouched human T cells kit from Thermo Fisher Scientific) can be used to enrich the untouched T cells, which will eliminate the potential risk to activate T cell receptor (TCR). While, in our present study, the T cells isolated by positive selection with CD3 microbeads will be activated immediately after isolation. Thus, the positive selection has little effect on this study to test T cell cytotoxicity.\nPerform flow cytometry to determine the proportion of CD3+, CD4+, and CD8+ T cells (Optional).\nPellet 2 × 106 T cells by centrifuge at 300 × g for 5 min at 4°C.\nResuspend T cells in 500 μL ice-cold flow cytometry staining buffer with 5 μL human Fc blocker (1:100) (BioScience Inc Cat#564219, RRID: AB_2728082), and then aliquot into five 1.5 mL EP tubes: one as unstained control, three as single staining, and the rest one as combined staining.\nTo the four tubes, add 1 μL anti-CD3-BV785 (BioLegend Cat#317330; RRID: AB_2563507), 1 μL anti-CD4-PE (BioLegend Cat#357404, RRID: AB_2562036), 1 μL anti-CD8-Pacific Blue (BioLegend Cat#344718, RRID: AB_10551438), and all of these three antibodies combo in sequence.\nMix well by pipetting up and down, and then incubate for 30 min at 4°C in the dark. Mix well every 10 min.\nWash the cells twice with 1 mL PBS and centrifuge at 300 × g for 5 min at 4°C.\nAdd 100 μL IC Fixation Buffer (eBioscience Cat# 00-8222-49) to cells in 100 μL flow staining buffer, gently agitate and store up to 3 days in 2°C–8°C in the dark.\nAlternatives: 2%–4% paraformaldehyde in PBS can be used to fix the cells.",
    "Transfer the cells to the flow tube with 300 μL PBS and record on a suitable flow cytometer. Examples of flow cytometry plots are shown in Figure 3[href=https://www.wicell.org#fig3].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/171-Fig3.jpg\nFigure 3. Representative Flow Cytometry Plots Showing the Percentage of CD3+, CD4+, and CD8+ T Cells Isolated from LRSCs Using the Magnetic Technique\nPause Point: The CD3+ T cells can be stored at −80°C up to one month or liquid nitrogen for long-term storage.\nNote: When executing the cryopreservation of CD3+ cells at a cooling rate of 1°C min−1 and thawing the cells rapidly (<1 min) in a 37°C water bath, the cell viability ranged from 80%–90%, and for those survived from the freeze-thaw process, the proliferation rate was unaffected (Baboo et al., 2019[href=https://www.wicell.org#bib2]).\nCritical: Most of the T cell subpopulations showed little difference in numbers during cryopreservation, however, the percentage of activated CD8+ CD38+ HLADR+ cell subtype decreased during cryopreservation (Weinberg et al., 2009[href=https://www.wicell.org#bib24]). Considering the variation between fresh and frozen T cells, it is highly recommended to use fresh T cells for studies.\nCD3+ T Cells Culture and Activation\nTiming: 1–2 weeks\nPrepare anti-CD3/CD28 Dynabeads for T cell activation, which mimic in vivo T cell activation from antigen-presenting cells. Wash Dynabeads before adding to the T cell culture medium. The concentration of beads is 4 × 107 beads/mL, and the ratio of beads to cells is 1:1.\nResuspend the Dynabeads in the vial by vortex for more than 30 s, or in a tilt and rotate manner for 5 min.\nTransfer the desired volume of Dynabeads (bead-to-cell ratio of 1:1) to a 1.5 mL EP tube and add at least 1 mL MACS buffer and mix well.\nPlace the tube on a DynaMag-2 magnet for 1 min and discard the supernatant.",
    "Remove the tube from the magnet and resuspend the washed Dynabeads in the same volume of culture medium as the initial volume of Dynabeads taken from the vial.\nCritical: Never use a less or excess recommended volume of Dynabeads, which may lead to insufficient activation or inhibition of expansion.\nResuspend the cells at a density of 1–1.5 × 106 cells/mL in RPMI 1640 complete medium supplemented with 50 U/mL IL-2, and anti-CD3/CD28 dynabeads in a 6-well or 12-well non-treated culture plate. Incubate the cells at 37°C and 5% CO2. Upon activation for 2 to 3 days, CD3+ T cells could strongly bind to the dynabeads and are ready for downstream applications.\nAlternatives: Other culture media, such as 45% RPMI 1640 and 45% Click’s Medium supplemented with 10% FBS, OpTmizer T Cell Expansion SFM, or other equivalent media could be used for T cell culture.\nNote: The T cells can be also activated by anti-CD3/CD28/CD137-coated beads. For activation and expansion of CD8+ T cells, add anti-CD3/CD28/CD137-coated beads, 10 ng/mL recombinant human IL-7, and 5 ng/mL recombinant human IL-15 for the homeostatic proliferation of CD8+ T cells and stimulation of memory CD8+ T cells (Wallace et al., 2006[href=https://www.wicell.org#bib23]). We did not observe a significant difference of the CD3+ T cells generated by anti-CD3/CD28 or anti-CD3/CD28/CD137-coated beads.\nCheck the cells daily and count the cells at least twice a week. When the medium turns yellow or the cell density exceeds 2.5 × 106 cells/mL, split the cells to a density of 0.5–1.0 × 106 cells/mL in culture medium supplemented with 50 U/mL IL-2.\nWhen the cells manifest signs of exhaustion, typically shrinkage of cell size, irregular elongated shape, and proliferation arrest, usually after 7–10 days of expansion, restimulate T cells with additional anti-CD3/CD28 Dynabeads. Troubleshooting 3[href=https://www.wicell.org#sec6.5]",
    "Thoroughly pipette the cell-beads mixture, then transfer the cells into a sterile tube.\nPlace the tube onto the magnet at least for 1 min.\nCollect the supernatant to a new tube and count the cell number.\nPellet the cells by centrifuge at 300 × g for 5 min at 20°C.\nCalculate the desired amount of Dynabeads, and repeat step 22.\nSeed the cells at a density of 0.5–1.0 × 106 cells/mL and replenish 50 U/mL IL-2.\nCheck the cells daily, and subculture the cells when the medium turns yellow or the cell density exceeds 2.5 × 106 cells/mL.\nNote: The T cells remain cytotoxic after restimulation. However, it should be noticed that repeated stimulation will upregulate the inhibitory factors, such as PD-1, LAG-3, TIM-3, CTLA-4, and the transcription factor TOX (Dunsford et al., 2020[href=https://www.wicell.org#bib7]). According to our experience, two rounds of stimulation with anti-CD3/CD28 have little effects on cytotoxic efficiency.\nCo-culture CD3+ T Cells with Drug Pre-treated Tumor Cells\nTiming: 1 day\nThis protocol aims to explore the combined effect of drug treatment and immunity. Under the circumstances that CD4+ T cells have been demonstrated to potentiate the function of CD8+ T cells, hence total CD3+ T cells are used to study the combined effects. Researchers can isolate CD8+ cells, activate them with anti-CD3/CD28 or CD3/CD28/CD137 dynabeads, and co-culture them with leukemia cells. Here, we label the tumor cells with GFP, then treat the cells with desired drug concentration for 48 h, and co-culture the drug pre-treated tumor cells with activated CD3+ T cells.\nSeed Mono Mac 6-GFP cells into a 6-well plate with 5 × 105 cells /well in 4 mL culture medium. Add the drugs and vehicle control accordingly, and incubate for 48 h.",
    "Note: The cell number, drug concentration, and incubation time should be optimized before co-culture. Here we used 0.1% DMSO, 30 nM CS1, 100 nM CS2 and 300 nM CS2.\nAfter 48 h, harvest the cells and centrifuge at 300 × g for 5 min and then resuspend in 1–2 mL culture medium.\nCount the cell numbers and adjust the cell concentration as 4 × 105 cells per mL.\nSeed 100 μL Mono Mac 6-GFP cells per well into a 48-well plate × 9 wells for each group.\nNote: A 96-well plate should be applicable.\nDetermine the effector-to-target (E: T) ratio. Here we used E: T ratios of 1:1 and 2:1. Adjust the T cells concentration as 4 × 105 cells/mL and 8 × 105 cells/mL and supplement with 100 U/mL IL2 (2×).\nNote: The effector-to-target ratios can be ranged from 1:2 to 50:1 or even higher. When working with higher E: T ratio (above 10:1), shorter co-culture time (4–6 h) is preferred, while working with relative lower E: T ratio (below 10:1), 12–18 h to 72 h co-culture period would be desirable (Deng et al., 2018[href=https://www.wicell.org#bib6]; Andersch et al., 2019[href=https://www.wicell.org#bib1]; Nelson et al., 2019[href=https://www.wicell.org#bib15]; Neubert et al., 2016[href=https://www.wicell.org#bib17]). In consideration of the varied magnitude of T cell-mediated cytotoxicity among different cell types, a pretest of co-culture duration is recommended.\nMix the tumor cells in step 29 with 100 μL CD3+ T cells from step 30 in triplicate wells accordingly. For the untreated well, add 100 uL culture medium with 50 U/mL IL2. Incubate at 37°C for 12–18 h.\nThe next day morning, transfer cells to the flow tube, wash each well with 200 μL PBS and transfer it to the corresponding tube.\nCount tumor cells by flow cytometry using CountBright absolute counting beads. Troubleshooting 4",
    "Completely resuspend the CountBright absolute counting beads suspension by gentle vortexing for 30 s.\nImmediately after vortexing, apply 50 μL bead suspensions (50,000 beads in 50 μL) to each flow tube.\nBriefly centrifuge to bring all of the leftovers on the lateral walls to the bottom of tubes.\nVortex well and then run on the flow cytometer.\nRecord at least 1000 beads event. An example of gating method is shown in Figure 4[href=https://www.wicell.org#fig4].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/171-Fig4.jpg\nFigure 4. Representative Data Showing How to Calculate T Cell Toxicity\n(A) Gating strategy of tumor cells and counting beads for the co-culture assay. The APC-Cy7-A was used to distinguish cells and counting beads.\n(B) Representative data showing the calculation of killing percentage based on the counting beads method.\nCritical: It is imperative to avoid cell loss at this step. Please DO NOT centrifuge the cells and wash them with PBS, which will lead to unexpected cell loss.\nCritical: Researchers should also confirm that the counting beads are mixed very well. The number of beads added into the flow tube will directly determine the number of leukemia cells.\nNote: A less volume of counting beads should also work. To minimize the error, dilute the beads with PBS in advance and then apply 100 μL diluted beads to each sample.\nCalculate the number of tumor cells in each sample using the following formula: imgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/171-Si1.jpg\nThe percentage of live GFP+ cells in the effectors-added group relative to the untreated group is subtracted from 100 and denoted as percent cytotoxicity. imgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/171-Si2.jpg imgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/171-Si3.jpg\nCombination of Drugs and CD3+ T cells In Vivo via Xenograft Model Transplanted with MA9.3ITD AML Cells\nTiming: 1–2 months",
    "The AML Xenograft model subjected to FTO inhibitors and T Cells treatment is employed to access the effects of targeting the FTO/m6A/LILRB4 axis on AML progression and immune invasion in vivo. Tumor progression is monitored and envisioned by in vivo bioluminescence imaging (BLI). MA9.3ITD cell lines are exemplified in this protocol, other AML cell lines with high endogenous FTO and LILRB4, such as Mono Mac 6, THP1, and MV4-11, also should be applicable. Given the immunocompromised microenvironment, it is not necessary to irradiate the NRGS mice before cell injection.\nInjection of luciferase-tagged MA9.3ITD cells into NRGS mice\nHarvest luciferase-tagged MA9.3ITD cells and pellet the cells by centrifuge at 300 × g for 5 min at 4°C.\nResuspend the pellet in 5 mL ice-cold PBS and count the cell number.\nPellet the cells by centrifuge at 300 × g for 5 min at 4°C.\nResuspend the pellet in PBS and adjust the cell concentration as 5 × 105 cells/mL. Keep the cells on the ice.\nRaise the mouse’s body temperature with an incandescent lamp to induce peripheral vasodilatation.\nPlace the NRGS mouse in a restrainer, rotate the tail to position the vein on top, and disinfect the tail with isopropanol.\nInject 200 μL cell suspensions (1 × 105 cells) per mouse into the vein using a 27–28 gauge needle size and a 1/2-mL syringe.\nAlternatives: A mouse tail illuminator restrainer can be used, which efficiently warms a mouse’s tail and minimize whole-body heat stress to a great extent.\nOne week post BMT, randomly allocate the mice into six groups, PBS, T cell, CS1, CS1 plus T cell, CS2, and CS2 plus T cell group.\nPrepare activated CD3+ T cells for injection.",
    "After activation CD3+ T cells using anti-CD3/CD28 Dynabeads for 2–3 days, harvest the cells and centrifuge at 300 × g for 5 min at 4°C.\nDiscard the supernatant, and resuspend the pellet in 5 mL ice-cold PBS, thoroughly pipette the cells/beads suspension, and then place the suspension onto a magnet separator until the beads have collected at the side of the tube (approximately 1 min).\nTransfer the supernatant to a new 15 mL centrifuge tube.\nWash the beads twice with PBS and each time thoroughly pipetting to increase cell recovery, capture the beads using the magnetic separator and transfer the supernatant to the centrifuge tube.\nDetermine the cell numbers using an automatic cell counter.\nPellet the cells by centrifuge at 300 × g for 5 min at 4°C.\nResuspend the CD3+ T cells in ice-cold PBS and adjust the cell concentration as 25 × 106 cells/mL. Keep the cells on the ice.\nFor the T cell treatment groups, each mouse receive 5 × 106 activated CD3+ T cells, which are suspended in 200 μL and administrated through tail vein injection on day 7 and 14 post BMT.\nNote: The injection amount of T cells and time may be varied in different xenograft models. The total amount of injected T cells can be up to 20 × 106 cells and can be injected weekly. To track the localization, T cells can be tagged with renilla luciferase and detected with benzyl coelenterazine as substrate (Vilalta et al., 2009[href=https://www.wicell.org#bib22]).\nAlternatives: Retro-orbital injection can be used instead of tail vein injection.\nBegin drug treatment one week after BMT, and each mouse is administrated every other day with PBS, 5 mg/kg/day CS1 or CS2 for 5 times in total.",
    "Note: The start time, dosage, and times of drug treatment should be optimized per xenograft mouse model.\nTo envision the leukemic progression, perform BLI weekly. Troubleshooting 5\nThaw 15 mg/mL D-Luciferin stock solution at 20°C.\nWeigh the mice, and inject intraperitoneally with 150 mg/kg D-Luciferin.\nNote: Inject 10 μL of Luciferin stock solution per gram of body weight. For example, inject 200 μL for 20 g body weight.\nNote: The injection site is located at the right low quadrant, the intersected point of the horizontal line drawn joining the upper border of two knees and the vertical paramedian line, which is 5–10 mm lateral to the midline.\nSet a timer for 10 min.\nCritical: Researchers should make sure that the time between D-Luciferin injection and luminescence image is equal for each mouse from each group. Otherwise, the luminescence signals are not comparable.\nNote: A kinetic study of luciferase should be performed in advance to evaluate the time of peak luciferase signal and plateau phase for different animal models. Usually, it takes 10–20 min to reach the peak signal after injection.\nAnesthetize the mice using isoflurane and place the sedated mice in a supine position into a black image chamber equipped with an anesthesia system.\nAfter 10-min injection, transfer the imaging chamber into the Lago X and capture the luminescence signal using the Aura imaging software with a consistent exposure time setting.\nTransfer the mice to the previous cages and wait for anesthesia recovery.\nMice were monitor closely and euthanized once they succumbed to signs of distress such as poor grooming, hunched posture, and hind-limb paralysis."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Immunology",
    "Cancer",
    "Genetics",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}