{
  "id": 4362,
  "origin_website": "Bio",
  "title": "Microfluidic-based Time-kill Kinetic Assay",
  "procedures": [
    "Microchannel molds (Figure 1) were prepared by depositing SU-8 2150 on silicon wafers using standard soft lithography techniques (Xia and Whitesides, 1998).Note: Stanford Microfluidics Foundry (http://www.stanford.edu/group/foundry/index.html[href=http://www.stanford.edu/group/foundry/index.html]) or the SIMTech Microfluidics Foundry in Singapore (http://www.simtech.a-star.edu.sg/smf/[href=http://www.simtech.a-star.edu.sg/smf/]) provide services for fabrication. The mask pattern is included as a pdf supplemental file.Microfluidic device assembly:Place the mold into a 150 mm x 15 mm petri dish with the patterned side facing up. Prepare 25 ml of the PDMS mixture. In a plastic weigh-boat, weigh 10 parts silicon elastomer then add 1 part curing agent. Mix thoroughly for at least one minute, and then pour over the silicon master.Place the dish in a desiccator and degas under vacuum for 1 h. It is important to remove all air bubbles from the PDMS before curing.Cure the PDMS for 24 h in a 37 °C incubator, or, alternatively, for 2 h at 65 °C.Note: Read the manufacturer’s suggestions for curing PDMS. The cured PDMS should be firm to the touch. Using a sharp blade (Exacto-knife or scalpel) carefully cut out all of the lanes in a single, rectangular piece. The patterned microchannels will be visible in the PDMS. Cover channels with cellophane tape to protect from dust particles and debris.Punch holes at the channel inlets and outlets with the 1.2 mm Harris Unicore hole punch. Take care that the PDMS plugs are removed. Remove cellophane tape. Thoroughly clean the PDMS device and a glass slide with 100% ethanol and lens paper to remove any debris. Place the glass slide and PDMS channel side up on a clean flat surface. Hold the hand-held corona generator approximately 1-2 cm above the surface. Treat for 30 sec uniformly over each surface. Carefully place the PDMS device on the treated glass slide, with the microchannel pattern facing the glass slide.",
    "Apply gentle, uniform pressure by hand to ensure a uniform seal. Care must be taken not to apply too much pressure, which can lead to channel collapse. After a final bonding step at 65 °C for 15 min, the device is ready to use.Prepare up to five 14 ml polystyrene culture tubes with 5 ml of 1% TB. Inoculate by carefully scraping the surface of the bacterial strain glycerol stock. For this device, 5 separate strains can be tested using the 10 microchannels. For each strain, one microchannel will serve as a control and the other will be used for an antimicrobial challenge. Place the cultures in a 37 °C incubator, shaking at 250 rpm overnight.Remove the culture from the incubator and prepare another 14 ml polystyrene culture tube with 5 ml of 1% TB. Inoculate the culture with 50 μl from the overnight culture.  Incubate in the 37 °C incubator, shaking at 250 rpm for approximately 4 h, monitoring until an OD600 of 0.5 is reached indicating mid-exponential phase. Use this time to sterilize the device.Dilute the culture to an OD600 of 0.0025 in 5 ml of 1% TB.Insert tubing in the inputs and outputs of each microchannel, applying enough pressure to force the tubing roughly half-way from the PDMS surface to the glass slide but carefully to avoid cracks in the PDMS inlet and outlets.  Attach the output tubing to a 5 ml syringe equipped with a BD 23G1 gauge needle for each microchannel. Place the syringes on to the syringe pump and mount the device onto the microscope stage (Figure 2). Set the diameter of the syringe on the syringe pump.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140427/20140427003238_5777.jpgFigure 2. Microfluidic device setup. The microfluidic device is mounted onto the microscope stage for the duration of the experiment.",
    "A syringe pump equipped with a 10-syringe holder withdraws fluid from the culture tube reservoirs, flowing it through each of the 10 channels run in parallel.Place the input tubing into a reservoir of 100% ethanol. Set the syringe pump to withdrawal. Sterilize the tubing and microchannels by flowing 100% ethanol into the channels for a minimum of 15 min and rinse with sterilized water. Note: Fluid is replaced in the reservoir by adding a separate line of tubing attached to a free syringe into the bottom of the reservoir. After stopping the flow, the fluid is manually removed and replaced by pipetting in new volume of fluid. This step facilitates exchange between fluids without introduction of air bubbles.Once the device is sterilized and rinsed, place the input tubing into each of the prepared cultures and start the syringe pump to withdraw the medium from the cultures at a flow rate of 25 μl/min. Withdraw at this rate for 15 min or until the culture medium has reached the microchannels.Set the flow rate to 0.5 μl/min for 18 h. This will facilitate attachment of P. aeruginosa, yielding a monolayer of cells.  Note: For longer time points, a more mature, thicker biofilm requires a confocal microscope for 3 dimensional quantification via z-stack reconstruction.After 18 h, replace the culture medium in the reservoir tubes with 3 ml of 1% TB. Wash each microchannel at a flow rate of 25 μl/min. Using the microscope stage/focus positioning software, program 3 fields of view for each microchannel. Include image capture every 5 min for 2 h using phase contrast and filter cubes corresponding to the excitation/emission wavelengths of Syto 9 and Propidium Iodide.Prepare the Syto 9/Propidium Iodide viability dye at a 1:1 ratio.",
    "Mix 6 μl of dye solution for 1 ml of dH2O to achieve the final working concentration of dye.  Note: After attempting several solvents, dH2O proved to be the most efficient. Other solvents such as 1% TB medium, 1x PBS, and nanopure H2O resulted in decreased binding of both dyes.Introduce the dye into the microchannel at a flow rate of 25 μl/min for approximately 15 min. Stop flow. Let the dye remain in the channel for 15-30 min. Note: For the next step, it is important to know when the antibiotic solution reaches the microchannel since time zero is a critical data point for the kill kinetics curve. This is simple to calculate by monitoring the time that it takes for the dye to reach the microchannel at the suggested flow rate. Make note of this time for the next step in the protocol.Prepare a solution of 20 μg/ml of colistin in 1% TB. Remove residual dye from the reservoir tubes for the microchannel inputs. For each strain, add 1 ml of the colistin solution to the first microchannel and 1 ml of dH2O to the second microchannel to serve as a control. Initiate flow at 25 μl/min and reduce flow rate to 0.5 μl/min once the antibiotic has reached the microchannel. Start the imaging software at time zero (point when the antibiotic reaches the microchannels) to record images at the designated fields of view. As cell death progresses, an increase in red cells will be observed for antibiotic susceptible cells and a decrease in green cells as propidium iodide quenches the Syto 9.The total number of dead cells in the biofilms for each time point can be quantified in ImageJ (Schneider et al., 2012) by converting the fluorescence image to an 8-bit binary image.",
    "Apply a constant threshold to each image to subtract background fluorescence. The final data can be expressed as a percentage of the total biofilm area (phase-contrast images) for each time point."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}