{
  "id": 9078,
  "origin_website": "Jove",
  "title": "Direct-current Stimulation and Multi-electrode Array Recording of Seizure-like Activity in Mice Brain Slice Preparation",
  "procedures": [
    "Procedures that involve animal subjects were approved by the Institutional Animal Care and Utilization Committee, Academia Sinica, Taipei, Taiwan.\n1. Preparing Experimental Solution and Equipment for Multielectrode Array Recording\nPrepare artificial cerebral spinal fluid (aCSF; 124 mM NaCl, 4.4 mM KCl, 1 mM NaH2PO3, 2 mM MgSO4, 2 mM CaCl2, 25 mM NaHCO3, and 10 mM glucose, bubbled with 95% O2 and 5% CO2).\nUse two types of MEA probes: 6 x 10 planar MEA and 8 x 8 MEA. The former probe covers the region that comprises the cortex, striatum, and thalamus. The latter probe covers only the cortical region.\nUse a 60-channel amplifier with a band-pass filter set between 0.1 Hz and 3 kHz at 1,200 amplification. Acquire data at a 10 kHz sampling rate.\nPlace two AgCl-coated silver wires inside the MEA chamber for DCS. Use the AgCl-coated silver wires to produce electric fields that are generated by an isolated stimulator.\nPlace a tungsten electrode (diameter, 127 µm; length, 7.62 cm; 8° AC tapered tip; resistance, 5 MΩ) for thalamic stimulation, and place the reference electrode in the MEA chamber. Deliver the tungsten electrode's currents using an isolated stimulator that is controlled by a pulse generator.\n2. Brain Slice Preparation\nUse male C57BL/6J mice, 4-8 weeks old. House the animals in an air-conditioned room (21-23 °C; 50% humidity; 12 hr/12 hr light /dark cycle, lights on at 8:00 AM) with free access to food and water.\nTake a 250 ml aliquot of the aCSF that was prepared in Step 1.1, and place it in a beaker that contains ice. At the same time, supply continuous gas that is composed of 95% O2 and 5% CO2.\nSurgery",
    "Anesthetize the animal with 4% isoflurane in a glass box for approximately 3 min. Once the animal reaches a surgical depth of anesthesia (indicated by the lack of a response to toe pinch), place it on a shallow tray that is filled with crushed ice, and remove the head using scissors.\nExpose the skull, and trim off the remaining muscle. Next, using rongeurs, peel away the dorsal surface of the skull from the brain. Trim away the sides of the skull using rongeurs. Sterilize all of the surgical instruments with a 75% ethanol solution.\nUsing a spatula, cut the olfactory bulbs and nerve connections along the ventral surface of the brain, and remove the brain. After decapitation, quickly transfer the brain to a beaker filled with ice-cold oxygenated aCSF.\nPreparation of Medial Thalamus (MT)-ACC Brain Slice\n\tNote: Prepare slices that contain the pathway from the MT to ACC13.\n\t\nHand-cut the brain block with two sagittal cuts 2.0 mm lateral to the midline in each hemisphere to display the subcortical anatomy. Then make two angled cuts. Make the first cross-cut parallel to the visible fiber tract in the striatum.\nMake the second cross-cut from the connection between the cerebellum and visual cortex to the midpoint between the anterior commissure and optic tract that are ventral and parallel to the thalamocingulate pathway.\nAttach the brain block to an angular plate (~120°) with cyanoacrylate adhesive, and make a cut just above the turning point of the pathway. Unfold the plate, flatten it, and glue it onto the chamber stage of a vibratome.\nMake medial thalamus-ACC brain slices (500 µm thick) and then immerse them in ice-cold oxygenated aCSF.Transfer slices to the recording chamber, and keep at 32 °C under continuous perfusion (12 ml/min) with oxygenated aCSF for 1 hr.",
    "3. Preparation of Perfusion Chamber for Multielectrode Array Recording\nPreparation of Perfusion Chamber\n\t\nPlace a MEA probe on a multi-channel system, and use two separate polyethylene tubes to connect the probe to a peristaltic pump. Use one tube to guide the aCSF into the MEA chamber and the other tube to guide the aCSF out of the chamber. Finally, continuously perfuse the preparation with warm (29-30 °C) oxygenated aCSF (8 ml/min).\nTransfer brain slice to MEA. Hold down the brain slice on the MEA using a wet cotton swab. Carefully move the brain slice to ensure the ACC is oriented above the electrodes.\nUse slice anchor kits and hold-downs to press the brain slice. This step ensures a good electrical connection between the slice and electrodes.\n4. Generation of Electric Fields by DCS\nNote: The definition of the electric field orientation was based on the direction of the axodendritic axis in the ACC. The orientations of dendrite and soma compartments were confirmed using Golgi staining12.\nPlace the AgCl electrode (defined as the anode) proximal to the ACC, and place the other electrode (defined as the cathode) distal to the ACC. Record the field strength that is generated by the two field orientations (parallel and perpendicular to the ACC axodendritic fibers) by the MEA, and deliver the currents of the electric fields using a stimulator.\nFix the distance of the AgCl electrodes (about 1.5-2 cm), and adjust the stimulator's current strength to make the DCS between 0.5 and 2 mA.\n5. Electrically-induced Cortical Synaptic Responses\nNote: Induce synaptic responses in the ACC by electrical stimulation in the MT, in which a programmable electrical stimulus generator produces rectangular biphasic current pulses.\nRepeat Section 3 above.",
    "Place a tungsten electrode in the MT, and deliver pulses from the stimulator to the thalamic region of the slices via bipolar tungsten electrodes.\nUse various current intensities to determine the threshold that elicits an ACC response. Here, use an intensity of ±150 µA and duration of 200 µsec, which elicited an 80% maximal response in the ACC in most slices.\nMove the tungsten electrode along the thalamocingulate pathway (from MT to corpus callosum) in the MT-ACC slice to obtain the optimal response profiles.\nMake 10-20 sweeps of ACC responses, and use the software to automatically average all of the ACC evoked by MT stimulation. The result iss the synaptic responses in ACC induced from MT stimulation by MT-ACC pathway.\n6. Electrically-induced Seizure-like Activity\nNote: Seizure-like activity was induced by the application of 4-aminopyridine (4-AP; 250 µM) and bicuculline (5 µM). Previous time-control studies showed that maximal and stable responses appeared 2-3 hr after drug application14.\nRepeat Section 5 above.\nAdd drugs to the perfusion solution. Use 4-AP (250 µM) and bicuculline (5 µM). Mix the drugs uniformly, and continue perfusion for 2-3 hr.\nTo facilitate seizure-like activity, maintain the perfusion pump at a relatively fast perfusion rate (8 ml/min), which can also help prevent the build-up of a pH gradient.\nPlace a tungsten electrode in the MT, and deliver electrical stimulation (150 µA, 200 µsec duration) to obtain ACC response profiles.\nMake 10-20 sweeps and average the responses.\nReplace the perfusion solution with fresh aCSF to wash out the drugs. Repeat Step 6.5.\n7. Testing Effect of DCS on Evoked Cortical Responses",
    "Repeat Sections 3 and 4. Ensure that uniform electric fields are generated by passing currents between two parallel AgCl-coated silver wires that are placed inside the MEA chamber. If there are no issues, the DCS stays between 0.5 and 2 mA.\nTurn off the DCS, and place a tungsten electrode to stimulate the thalamus (±150 µA, 200 µsec duration). To obtain maximal synaptic responses in the ACC, make 10-20 sweeps and average the responses.\nSimultaneously turn on the DCS (2 mV/mm DCS strength) and thalamic stimulation (350 µA, 200 µsec duration). Evaluate the changes of amplitude of the thalamic stimulation-evoked ACC response during DCS.\nTurn off the DCS, and add 4-AP (250 µM) and bicuculline (5 µM) to the perfusion solution. Then wait 2-3 hr. When the drugs affect the brain slice, the slice produces cortical seizure responses.\nMake 10-20 sweeps of ACC responses, and then measure the amplitude and duration of electrical evoked cortical seizure responses.\nAfter step 7.5, simultaneously turn on the DCS (2 mV/mm DCS strength) and thalamic stimulation (150 µA, 200 duration µsec). Evaluate changes in the amplitude and duration of evoked cortical seizure responses during DCS application.\nReplace the perfusion solution with fresh aCSF to wash out the drugs, and repeat steps 7.2 and 7.3.\nCollect all of the recording data, and group the data into the different experimental conditions. Evaluate the amplitude and duration of cortical seizure responses under different experimental conditions.\n8. Data Analysis\nUse software (e.g., MC Rack software) to automatically average the recorded responses, and export the raw data to a spreadsheet. Analyze the amplitude and duration of the raw data and generate color figures.",
    "To detect oscillatory seizure events, use software to measure the baseline value and standard deviations (SD). Set 3 SD of the noise level as the threshold. Amplitudes of the peaks during an oscillation event that surpass this threshold are automatically detected.\nPerform the statistical analysis using Student's t-test.\nExpress measurements and one-way analysis of variance (ANOVA) results in the text as mean ± SE, with n indicating the number of slices studied12.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}