{
  "id": 13556,
  "origin_website": "Jove",
  "title": "Dissection of Larval Zebrafish Gonadal Tissue",
  "procedures": [
    "Zebrafish experiments were approved by the Fudan University Institutional Animal Care and Use Committee. Zebrafish were raised and bred according to standard procedures20.\n1. Preparations\nCultivate 17 dpf and 25 dpf larval zebrafish\n\t\nTransfer 2 male and 2 female adult zebrafish (healthy, 3 to 6 months old, laboratory AB strain) to a crossing tank in the late afternoon before the crossing day. Separate the males and females with a barrier. The next morning, refresh the tank water and remove the barrier to allow them to mate. Collect eggs in 100 mm Petri dishes 1 to 2 h after fertilization.\nKeep about 40 embryos in a 100 mm plate with 40 mL embryo medium (EM) at 28.5 °C during the early development period (4 days) and refresh the EM twice a day. Transfer larvae to 1 L tanks (40 larvae to 300 mL system water) and feed with live rotifers (full supply, twice a day) after 5 dpf. Feed live brine shrimp instead of rotifer diet after 10 dpf. Transfer the fish into re-circulating water system at 14 dpf21.\nRaise larval zebrafish in the re-circulating water system till 17 dpf or 25 dpf. Ensure the light/dark cycle is 14/10 h and pH value of system water is about 7.2. Measure the body length of 17 dpf (5.5 to 6.8 mm) and 25 dpf (8 to 11 mm) larvae22.\nPrepare 2% agar plates for the dissection.\n\t\nAdd 4 g agar to 200 mL sterile water. Heat the mixture in a microwave oven until it turns transparent.\nCool the agar solution for about 15 min, then pour it into 60 mm diameter Petri dishes (approximately 1/3 volume of the plate). Store the solidified agar plates at 4 °C.\n2. Protocol 1: Dissect the Gonadal Tissue of 17 and 25 dpf Larvae",
    "Add crushed ice into the tank to anesthetize 17 dpf larvae. Transfer the anesthetized larvae to a 100 mm chilled Petri dish with 30 mL cold Ringer's solution. Keep the fish incubated in the chilled Ringer's solution for at least 15 min to fully anesthetize the larvae.\nTransfer the larvae to a precooled agar plate with a small plastic spoon. Submerge the entire fish body in 10 mL chilled Ringer's solution and gently lay it on its side.\nDo the following operations under the vision field of 25X stereo microscope. Clamp the fish trunk with tweezers for stabilization. Rip the abdomen longitudinally from the anus to the heart with another pair of tweezers. Gently remove the skin and muscles on one side of the body to expose the internal organs.\nRemove the mass of organs ventral to the swim bladder carefully. Avoid damaging the gonad attached to the swim bladder.\nCut off the connection between the swim bladder and anterior body. Pull out the entire swim bladder and gonadal tissue gently.\n\tNOTE: In most cases, the gonadal tissue at 17 dpf contains surrounding epithelial tissue and protonephridium. They are not easily separated from each other, but at 25 dpf it can be easily separated. The gonad is also connected to the anus. A junction with left and right gonad connected to each other at the anus will be clearly visible.\nUse tweezers to carefully separate the gonadal tissue from the swim bladder and clean up the surrounding adipose tissues.\nImmediately transfer the isolated gonadal tissue to a prechilled 1.5 mL centrifuge tube containing 200 µL Ringer's solution. Keep the tube on ice until all gonadal tissues are separated from the larvae.\nDissect the gonads of 25 dpf larvae as described in steps 2.1 -  2.7.",
    "3. Protocol 2: Analyze Gene Expression of the Isolated Gonadal Tissues\nExtract total RNA from the larval gonadal tissues.\n\t\nTransfer the isolated gonadal tissues to a new RNase-free 1.5 mL tube and remove Ringer's solution. Add 100 µL lysis solution. Vortex until the tissues are completely lysed.\nPerform the total RNA extraction procedure according to the manufacturer's instructions.\nAdd 1/10 volume of 10x DNase I buffer and 1 µL of DNase I to the RNA solution and mix gently. Incubate for 20 min at 37 °C.\nAdd 1/10 volume DNase inactivation reagent to the RNA solution. Incubate for 10 min at 70 °C. Measure the concentration of the total RNA using a spectrophotometer. Store at -20 °C.\nPerform first-strand cDNA synthesis\n\t\nUse an oligo(dT)-linker primer to perform first-strand cDNA synthesis following the manufacture's protocol. Add 1 to 2 µg of RNA to a total reaction volume to 20 µL.\nIncubate the reaction solution for 90 min at 45 °C. Terminate the reaction by heating at 70 °C for 5 min.\nAdd 1 µL RNase H to the cDNA solution to remove the residual RNA. Mix gently and centrifuge for 10 s at ~ 13,000 x g. Incubate for 20 min at 37 °C. Add 20 µl nuclease free water. Store at -70 °C.\nPerform fluorescent quantitative PCR\n\t\nPerform qPCR on a cycler system with a fluorescent dye. Use the following PCR cycling conditions: 35 cycles at 95 °C for 15 s, Tm-5 °C for 15 s, 68 °C for 30 s. Use primer sequences as follows: amh (fwd: GTGGATGGCAGCAGTACGAC; rev: GCGGAGAGGTGGAAGAGAGAATG), cyp19a1a (fwd: GTCCTGTTGTCTCCTACTGTCG; rev: CATTTGAGTTGAATATGATGCCCTG), nanos3 (fwd: GCTCGGTGTACGCCAAATCAACAT; rev: CCAAGTGAAAACACAACACCAGTGC), vasa (fwd: ATCGCATAGGAAGAACTGGACGCT; rev: CCAAGTGAAAACACAACACCAGTGC) and β-actin (fwd: AGTGCGACGTGGACATCCGTA; rev: GCACTTCCTGTGGACGATGGA)19.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}