{
  "id": 18827,
  "origin_website": "Jove",
  "title": "Image-guided Convection-enhanced Delivery into Agarose Gel Models of the Brain",
  "procedures": [
    "1. Preparation of Gel Phantoms and Dye\nPrepare 0.2% agarose gel by dissolving 2 g of 0.1% agarose powder in 1,000 ml of deionized water. Stir the solution for approximately 1 min to insure proper mixing; and immediately microwave the solution in 3 min intervals for 9 min or until clear, stirring between intervals.\nWhile the agarose gel is liquid, pour the solution into 5 cm x 5 cm x 5 cm containers. Allow space at the top of the container to add water and allow the agarose gel to cool and settle.\nOnce the agarose gel has solidified (approximately 1-2 hr), add 1 cm of water to the top of the gel and refrigerate. It is best to use the gel within 24-48 hr of mixing, but it can be stored for up to a week refrigerated10.\nPrepare a radio-contrast dye in a 60 ml syringe consisting of 50 ml of 0.017% bromophenol blue dye (BPB), and 2 mM of gadoteridol radio-contrast media.\n\t\nCombine 8.5 mg of BPB dye to 50 ml deionized water to create a 0.017% BPB solution.\nAdd 0.2 ml of stock 0.5 M gadoteridol to the 50 ml 0.017% BPB solution to create a 2 mM gadoteridol solution.\n2. Preparation of Infusion System\nSyringe pump infusion system (preferred method): For syringe pump preparation, attach the infusion catheter directly to the syringe through the pressure sensor, reducing the dead volume of the infusion line. The purge function of the syringe pump may be used to clear the line of air using a bolus greater than the priming volume of the catheter at a rate of 10 μl/min.",
    "Tube pump infusion system (alternate method): Connect the syringe containing the radio-contrast dye to the infusion pump. Attach the pressure sensor to the pump outlet with the transducer attached to the IV monitor. Attach a 16 G infusion catheter to the open end of the pressure sensor. Note: The tip of the 16 G infusion catheter has an inner diameter of 0.2 mm and an outer diameter of 0.35 mm. The tip is made of fused silica and the tip length is 3 mm. It increases to approximately 0.75 mm and continues for 15 mm, the catheter then steps up in a tapered fashion to 1.6 mm or 16 G.\nPrepare for infusion by purging the system for approximately 15 min at 16.667 μl/min to remove any air bubbles. Do not exceed the 16.667 μl/min flow rate, as the machine will cease infusion due to high line pressure. Following attaching the infusion catheter to the line exiting the infusion pump, purge lines of air by using the \"Bolus\" function on the infusion pump.\nAttach the infusion catheter mount and trajectory frame to the gel phantom container (5 cm x 5 cm x 5 cm) and place in the MRI.\n3. CED Gel Infusion and MR Scanning\nZero the pressure value (mmHg) recorded by the IV monitor before beginning the infusion.\nInsert the infusion catheter into the agarose gel with the infusion pump running at the lowest flow rate possible, in this case 1.667 μl/min.\nBegin the MR scan, using the parameters listed in Table 1, and continue infusing at a rate of 1.667 μl/min. Infuse the gel at a constant rate until the total volume infused reaches 60 μl (approximately 38 min).",
    "Scan the gel continuously in 3 min and 50 sec intervals. Record the pressure readings every 60 sec. Once the volume infused reaches 60 μl, turn off the infusion pump; and complete MR scanning while continuing to record pressure readings.\n4. MR Data Analysis\nFor analyzing the MR images, use an appropriate DICOM viewer with ROI segmentation functionality.\nSelect the correct frame in each scan marked by the cross section of the catheter as seen in Figure 1.\nUsing the \"ROI - rectangle\" tool, select the largest portion of the gel that does not include any portion of the infusion site. The software will output a mean pixel density with standard deviation. Find the value that corresponds to three standard deviations from the mean. This value is used as the threshold for determining when contrast is present with a confidence of 99.7%.\nUsing the \"ROI - circle\" tool, encircle the infusion site with a large enough circle and give this a unique name.\nSelect the circle and using the \"ROI - set pixel values to\" tool, input threshold value found in step 4.3 into \"if current value is larger than:\" box and checkmark this line only. Then in \"to this new value:\" box, enter a large value (25,000). Reset the pixel density to select the area encompassed by the threshold previously defined.\nNext, using the \"ROI - grow region (2D/3D segmentation)\" tool, select 2D growing region, confidence algorithm with initial radius parameter = 2, and brush ROI. Click inside of the infusion site for the software to compute the total area of this region.\nAssuming a spherical infusion cloud, calculate the volume of diffusion from the area via the following equation: V= 4/3π(√(Area/π))3\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}