{
  "id": 4593,
  "origin_website": "Bio",
  "title": "Loading of Cells with Fluorescent Probe to Study Intracellular Acid-base Homeostasis in Lactic Acid Bacteria",
  "procedures": [
    "Growth conditions   Enterococcus faecalis cultures were grown at 37 °C without agitation in 100 ml stoppered bottles that contained 20 to 50 ml of LB medium (LB), initial pH 7.0 (pH adjusted by adding 5 M HCl or 5 M NaOH as correspond employing a pH meter) supplemented with organic acid (citrate, malate or pyruvate) and/or different carbon source.    Lactococcus lactis cultures were routinely grown at 30 °C without shaking in 100 ml sealed bottles containing 20 ml of lactose free M17 medium, supplemented with 25 mM glucose (M17G). Overnight cultures prepared in this way were used to inoculate fresh M17 adjusted to different initial pH values as indicated. The medium was supplemented with organic acid and/or different carbon source.   Lactobacillus casei was grown overnight at 37 °C in modified MRS broth adjusted to pH 6.0. Cells were grown in screw-capped tubes of 50 ml without shaking at 37 °C for about 15 hours inoculated with 15 μl of a preculture in stationary phase mMRS supplemented with 25 mM glucose (mMRSG) stored at -80 °C.    Growth of the microbial cultures was followed by measurement of the optical density at a wavelength of 660 nm (OD660).    Cells were harvested in mid-exponential growth phase when the optical density was 0.6-0.8, centrifugate for 10 min at 1,600 x g at 4 °C.    The cells were washed twice with 50 mM potassium phosphate (KPi) (pH 5.5) at 4 °C, and finally resuspended in 1 ml the same buffer. For each wash, we used the same volume of solution that the initial culture volume. The same KPi buffer condition (50 mM KPi, pH 5.5, kept at 4 °C) is used in the rest of steps in loading of cells with the BCECF probe.",
    "Loading of cells with the BCECF probe   The different OD-cultures were matched in such way to start with the loading-probe protocol with the same amount of cells.    Thus, the cells were centrifugated at maximum speed 24,900 x g for 1 min at room temperature.    Finally the cells were resuspended in 20 µl of KPi solution. To be loaded with BCECF, 1 μl of 10 mM BCECF was added to said resuspension cells. Then 2.5 µl of 0.5 M HCl was added and incubated for 10 min in the dark at room temperature.    It was then neutralized with the addition of 1 ml of KPi ice solutions and washed twice with 1 ml of KPi. The centrifugation between wash steps was at maximum speed 24,900 x g for 1 min at room temperature.   Centrifugated between each wash step at 24,900 x g for 1 min. Finally the cells were resuspended in 100-150 μl of KPi solutions and stored on ice until use.      Fluorescent determination   For each experiment, 10 µl of charged BCECF cells were resuspended in 3 ml of 50 mM KPi solution at indicated pH in a 5 ml quartz cuvette (optical path 1 cm) and equilibrated at 37 °C for 2 min.    The sample was stirred with a suitable magnetic strip and the fluorescence signal was monitored every 1 sec in a fluorometer.    Fluorescence emissions were recorded at 525 nm with excitation wavelength at 503 nm (slit widths were 16 and 4 nm, respectively). The opening of the sample chamber causes data loss during the first 6-7-8 sec after addition of each substrate to be tested that was made in the cuvette.      Conversion of the fluorescence signal in pH   The conversion of the fluorescence signal to cytoplasm pH was performed by titration curves as shown in the Note 1.",
    "This procedure was performed for each batch of cells loaded. The loaded cells were resuspended in buffer 50 mM KPi at pH 3.0.    In the same way, the determinations were performed with addition of 2% (v/v) Triton X-100, 75 μM valinomycin and nigericin for permeabilizing the membranes to reach the ionic balance between the intracellular and the external solution. This cell mixture was incubated for 2 min, at 37 °C (work temperature) with agitation until the fluorescent signal was stabilized. Thus, the measurement of fluorescence and pH (with a pH microelectrode) is performed per each addition of 5 of 0.1 N NaOH solutions. To each pH value we get a fluorescent signal value, measured in separate steps. Each determination is a point of the titration curves and covers the pH range from 3.0 to 11.0.  Figure 1 shows titration curves for fluorometric probe BCECF in L. lactis and E. faecalis. The cells loaded were titrated prior permeabilization of the cells with 2% (v/v) Triton X-100, 75 mM valinomycin and 75 mM nigericin. The pKa, Ifmín and Ifmax parameters were determined from nonlinear fit of experimental data.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150119/20150119180459_2169.jpg Figure 1. Fluorometric titration curves of the BCECF probe, fluorescence intensity as a function of external pH of 50 mM KPi buffer where the cells were resuspended. Wavelength excitation: 503 nm, wavelength emission: 525 nm. The pKa of BCECF was determined in cells of wild type L. lactis IL1403 (- ▲ -), L. lactis ILGR1 (IL1403 isogenic derivative  als -α acetolactate sinthase- mutant) (- ● -) and E. faecalis JH2-2 (- ■ -), properly loaded with BCECF.    This permeabilization allowed the electrochemical decoupling of the cell so that the pHint and pHext are equilibrated.",
    "Table 1 shows the four parameters of the non-linear fit curve (If vs pH) obtained for BCECF in each microorganism.   Parameters a, d (Ifmin and Ifmax) and c (pKa) were then used in the transformation of the of fluorescence intensity to pH values.  Table 1. Parameter values of nonlinear adjustment from titration curves of BCECF probe table:",
    "﻿0,1,2,3\n,L. lactis  IL1403,L. lactis  ILGR1,E. faecalis  JH2-2\na (Ifmax) (AUifa),277 ± 4,181 ± 4,213 ± 10\nb (if.pH-1),0.46 ± 0.02,0.48 ± 0.03,0.51 ± 0.08\nc (pKa),7.20 ± 0.02,7.24 ± 0.04,7.00 ± 0.08\nd (Ifmin) (AUifa),48 ± 2,43 ± 2,17 ± 7",
    "aAUif: Arbitrary units of fluorescence intensity      Intracellular pH measurement The following are examples of using BCECF for determination of intracellular pH in LAB as result the metabolism of organic acids and/or sugars. Figure 2 shows the intracellular pH variation during the metabolism of different carbon sources in E. faecalis JH2-2 (Espariz et al., 2011; Repizo et al., 2013).   imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150119/20150119180522_3829.jpg Figure 2. Effect of citrate and malate metabolism on the intracellular pH of E. faecalis JH2-2. A and B, cells were grown in LB supplemented with: 28 mM malate (- ♦ -); 28 mM malate and 10 mM arginine (- ● -); 28 mM glucose (- ▼ -); and 28 mM glucose and malate (- ■ -). C, cells were grown in LB: basal (- ■ -); and supplemented with 30 mM citrate (- ● -). Arrows indicated the substrates additions: 10 mM malate (Mal); 10 mM glucose (Glc) or 10 mM citrate (Cit) in loaded cell with BCECF and resuspended in 50 mM KPi solution (pH 6.5).   Figure 3 shows the intracellular pH variation during the metabolism of different carbon sources in L. casei ATCC 334 (Mortera et al., 2013).   imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150119/20150119180546_1729.jpg Figure 3. Energetics of carbohydrate and Ca2+-citrate metabolism in Lb. casei. Lb. casei ATCC 334 was grown in mMRSGlc A, mMRSGal B and mMRSCitCa C. The cells were harvested at an OD660 of 0.6 and loaded with BCECF for intracellular pH (pHin) measurements (A, B, and C). For intracellular pH measurements, 5 mM glucose (solid line), 5 mM galactose (dashed line), or 2 mM citrate and then 2 mM Ca2+ (dotted line) was added at the time point indicated by the arrow.   Figure 4 shows the intracellular pH variation in L. lactis IL1403 and the mutant ILGR1 product the metabolism of different carbon source (Zuljan et al., 2014).   imgsrc:https://en-cdn.",
    "bio-protocol.org/attached/image/20150119/20150119180605_6886.jpg Figure 4. L. lactis intracellular pH variations in response to pyruvate. L. lactis IL1403 (dotted line, wt) and L. lactis ILGR1 (continuous line) strains were grown in M17G up to exponential phase. Then, cells were loaded with the BCECF fluorescent probe and resuspended in phosphate buffer at 4.5. Pulses of 50 mM pyruvate (Pyr), 3 mM glucose (Glu) or 0.1 N NaOH (*) were added at the times indicated by the arrows (gray line)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}