{
  "id": 17056,
  "origin_website": "Jove",
  "title": "Indwelling Needle Puncture and Irrigation in the Conservative Treatment of Breast Abscess During Non-Lactation Period",
  "procedures": [
    "The study was approved by the Ethical Committee of Army Medical University (reference number: 2018-106). The patients included were fully informed and joined the study voluntarily and willingly.\n1. Patients\nNOTE: Non-lactating patients with breast abscesses were from the breast surgery clinic of Daping Hospital, and all patients had detailed medical histories before the surgical intervention.\nInclusion criteria and exclusion criteria:\n\t\nInclude patients diagnosed with non-lactation mastitis by outpatient physicians. Include patients with obvious inflammatory mass and abscess formation found by the B-mode ultrasound scan, with the average diameter of the abscess ≥1.0 cm.\nInclude patients who agreed to join the project when informed.\nDo not include patients with serious malignant diseases or mental disorders and patients whose abscess broke through the skin and pus leaked.\nDivide the patients into the Incisive drainage group and the Indwelling needle group according to the time of treatment.\n\tNOTE: There was no significant difference in age, duration of illness, diameter of abscess cavity, and location of abscess cavity between the two groups (P > 0.05), which was comparable (Table 1).\n\t\nTreat the patients in the Incisive drainage group with conventional incision and drainage procedures. Patients (n = 21) who received treatments from March 2017 to March 2018 were included in the Incisive drainage group.\nTreat the patients in the Indwelling needle group with procedures of puncture and irrigation using 20 G indwelling needles. Patients (n = 20) who received treatments from February 2019 to February 2020 were included in the Indwelling needle group.\n2. Implementation\nAnti-infection therapy\n\t\nTest the drug sensitivity of the bacteria in the pus of patients, and choose antibiotics according to the results and the indications, allergies, liver, and kidney functions, metabolic status, and pharmacological/pharmacokinetic characteristics of patients.",
    "NOTE: Anti-infection treatments lasted 8.6 (7-14) days on average, and a general blood examination was conducted. Check the antibiotic treatment termination index to ensure that the values of white blood cells and C-reactive protein returned to the normal range and symptoms such as local redness, swelling, heat, and pain in the breast disappeared.\nTreat the incisive drainage group with conventional incision and drainage.\n\t\nLay the patient supine and prepare for the operation. Use Lidocaine (5%) for skin surface and subcutaneous anesthesia.\nDetermine the size and depth of the breast abscess by the report of a B-mode ultrasound scan. Select the lowest point of the abscess cavity as an incision site, then use hemostatic forceps and gauze strips to make a blunt separation to the abscess cavity.\nEnsure the pus cavity is completely opened. Open the abscess partition and collect some pus for bacterial culture. Use 1-2 medical sterile cotton swabs to collect pus, and put the cotton swab into the specimen bottle for culture. Use 1-2 cotton swabs to gently wipe the periphery and bottom of the pus cavity, then remove all the pus using gauze.\nClean the pus cavity repeatedly with hydrogen peroxide, iodophor solution, and normal saline. Place vaseline gauze into the cavity to stop bleeding and drain.\nAfter the operation, change the wound dressing regularly or if the dressing is wet. Before the drainage opening is healed, change the drainage gauze every day if wet and every 2-3 days if dry.\nEvaluate the patient's vital signs, pain response, and psychological response during dressing change to adjust the treatment plan for patients according to the change in illness6.\nTreat the Indwelling needle group with puncture and irrigation using 20 G indwelling needles.",
    "Let the patients lie in a supine position. Perform routine skin disinfection with iodophor, and ensure the disinfection range is over 5 cm radius. After disinfection, lay the surgical drape.\nPrepare the common items for treatment, including 0.9% normal saline, indwelling needle, sterile gauzes, therapeutic bowl, curved plate, medical adhesive tape, 10 mL/20 mL syringe, bacterial culture bottle, and sterile scissors.\nAccording to the report of B-ultrasound examination, determine the puncture site (generally choose the lowest point of abscess as the puncture point, but away from the nipple and areola area).\nAttach a 20 G indwelling needle (the diameter of the 20 G indwelling needle used in this study is 1.1 mm, and the length is 3 mm) to a 10 mL syringe.\nPuncture the pus cavity, draw the needle back, and drain the pus out (Figure 1).\nAdjust the catheter to a proper depth, exit the guide core, and collect some pus for bacterial culture.\nUse a syringe to aspirate pus until no pus can be extracted, and then inject the same amount of 0.9% normal saline to flush the pus cavity. Flush repeatedly with 0.9% normal saline until the liquid becomes clear.\nAdjust the angle of the indwelling needle to the appropriate position, inquire about feelings about the patient, and prepare to fix the indwelling needle so as not to cause discomfort to the patient.\nWash and flush the abscess cavity with normal saline through the indwelling catheter until the pus is no longer produced (Figure 2).\nInject 1 mL of 0.9% normal saline into the indwelling pipe. Close the switch of the indwelling tube, and clamp the pipe. Lay gauze under the tube to prevent the tube from folding.",
    "After drying, clean the skin around the puncture site and fix the indwelling tube with a transparent adhesive film.\nGive health guidance to the patient.\n\t\t\nFirst, fix the indwelling hose on the breast surface, and advise the patient to wear soft innerwear to support the breast to prevent the hose from falling off and shifting. Advise the patient to wear loose and comfortable clothes; avoid tight clothes.\nSecond, during the treatment, advise the patient not to perform strenuous activities or sleep in a prone position.\nAdvise the patient to take a fresh, elegant diet and avoid greasy or strongly flavored diets.\nLast, to achieve a good therapeutic effect, advise the patients with breast abscess to go to the hospital for irrigation treatment on time every day until no new pus is produced. Advise the patient to go to the hospital if he/she feels any discomfort about the indwelling pipe and not to pull the tube to prevent damage.\nDuring the second irrigation treatment, visually inspect the indwelling pipeline for detachment, folding, and other conditions, and inspect the puncture point for bleeding, redness, swelling, and other infections.\n\t\t\nIf any of the above conditions occur, remove the catheter. If the situation is normal, gently remove the gauze and film that fix the retention pipeline, open the switch of the indwelling tube, and connect a syringe to aspirate pus.\nAspirate pus until no pus can be extracted, and inject the same amount of 0.9% normal saline to flush the pus cavity. Flush repeatedly with 0.9% normal saline until the liquid becomes clear.\nRepeat steps 2.3.8-2.3.11.\nPerform the third and subsequent treatments in the same manner as the second treatment, and stop the irrigation treatment until it meets the standard of extubation.",
    "Evaluate the abscess and pull out the drainage tube when it meets the indication of extubation (normal body temperature, breast redness subsided obviously, no obvious abscess fluctuation, no purulent drainage, drainage volume <2 mL, no obvious liquid echo in the residual cavity under B-model ultrasound scan).\n\t\tNOTE: The standard indications of cure are: (1) The symptoms of redness, swelling, and heat pain in the breast disappear, and the body temperature return normal. (2) No lump and no abscess under B-mode ultrasound scan. The wound heals over.\nObservation indicators\n\t\nTotal pain VAS score10: Record the average pain score of two groups of patients during, after surgery, and during dressing change. no pain = 0, unbearable pain = 10.\nRecord the healing time (day): Time from operation to cure.\nCure rate: Record the proportion of cases cured in all patients.\nObserve the surgical site for complications (poor drainage, bleeding, drainage tube detachment, and secondary infection). Under these complications, remove the indwelling catheter, and carry out the treatment only after re-evaluating the patient's condition.\n3. Statistical analysis\nPresent the counting data as a percentage and the measurement data as means ± SD. Analyze the counting data by chi-square test and measurement data by t-test using SPSS. P < 0.05 (two-tailed) was considered significant.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}