{
  "id": 3859,
  "origin_website": "Cell",
  "title": "Manipulating and tracking single hepatocyte behavior during mouse liver regeneration by performing hydrodynamic tail vein injection",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThe steps in this protocol can be carried out in immediate succession over the course of 4 weeks or there can be a stopping point after the cloning step or after the tissue harvest step.\nCloning gene of interest into delivery vector\nTiming: ∼ 4 days\nGenes to be overexpressed in hepatocytes in vivo are cloned into the carrier plasmid in this step.\nPrepare agarose gel.\nA 1% agarose gel is prepared by dissolving 1.2 g of agarose in 120 mL of TAE buffer (40 mM tris base, 20 mM acetic acid, 1 mM of EDTA, pH 8) using microwave at median power for 1–2 min.\nWait ∼ 10 min for the gel to cool down a bit before adding 12 μL (1 : 10,000) of SYBR® Safe DNA Stain.\nGently swirl to mix and try to avoid bubbles.\nPour gently into gel casters with combs.\nNote: make sure no bubbles are trapped under the combs. If bubbles are suspected, lift combs quickly, pop bubbles with pipette tip, and re-insert combs. This can only be done right after the gel is poured and before it begins to solidify.\nOnce poured, the gel will rapidly solidify at 20°C–24°C (∼20 min).\nNote: Can prepare several days in advance and store at 4°C wrapped in plastic.\nPCR amplify gene of interest (in this case E2F1) from parent plasmid (pCMVHA-E2F1, Addgene) using Infusion cloning primers.\nAdd 12.5 μL of Hifi PCR Premix.\nAdd 2.5 μL of Infusion primer 1.\nAdd 2.5 μL of infusion primer 2.\nAdd 0.1–100 ng of DNA (see Note below).\nAdd DNase/RNase-free water to 25 μL of total volume.\nRun PCR using conditions in table 1[href=https://www.wicell.org#undtbl2] on the thermocycler.",
    "Note: Although the E2F1 transgene is overexpressed in hepatocytes in this protocol, it can be replaced with any other gene of the interest. In theory even multiple genes can be cloned into the same plasmid using the In-Fusion cloning kit and delivered to hepatocytes. It is recommended that for testing any new primer/plasmid pair the experimenter set up a few different reactions in parallel using different amounts of template DNA (e.g., 0.1 ng, 1 ng, 10 ng, 100 ng) as the amount of input can impact the amount of product obtained as well as the presence of nonspecific PCR products.\nAlternatives: Even though the Hifi PCR reagents are included with the Infusion cloning kit, any high-fidelity DNA polymerase can be used at this stage to amplify the gene of interest. The sequence of the cloned gene will be verified via Sanger sequencing in step 7.\nGel purify PCR fragment.\nCarry out electrophoresis of PCR products on a 1% agarose gel to purify the amplicon.\nLoad 10 μL of a 1 kb ladder in the first lane to accurately assess the size of the PCR products.\nVisualize DNA bands using a UV box and use a scalpel to cut the PCR band at 1383 bp containing E2F1 gene flanked by carrier-overlapping sequences.\nColumn purify the PCR fragment from the gel slice using the QIAquick Gel Extraction Kit:\nAdd 5 volumes of Buffer PB to 1 volume of the gel containing the PCR band.\nApply mix to QIAquick spin column in collection tube.\nCentrifuge and discard flow through.\nWash column by adding 0.75 mL of Buffer PE to the top of the column, repeat centrifugation, and discard flow through.\nCentrifuge empty column in a new collection tube to remove excess buffer.\nPlace the column into a new 1.5 mL Eppendorf tube.",
    "Elute the DNA by pipetting 50 μL of buffer EB to the top of the column and centrifuge.\nNote: Centrifugation steps are carried out by standard tabletop centrifuge at 10,000 × g for 1 min at 20°C–24°C unless otherwise stated.\nDouble digest carrier plasmid (pT3-EF1-Nras-IRES-GFP) with restriction enzymes XhoI and EcoRI.\nGrow bacteria from glycerol stock to amplify the plasmid so it can be isolated for further manipulation.\nPre-warm LB agar plate with appropriate antibiotic (in this case ampicillin) to 37°C.\nScratch surface of glycerol stock with a sterile pipette tip and return glycerol stock to −80°C.\nNote: To prevent the glycerol stock from thawing, bring agar plate to the −80°C freezer for this step.\nGently streak the LB agar plate with appropriate antibiotic to select for plasmid used.\nIncubate the plate up-side-down at 37°C for 16 h.\nNext day pick 4 colonies from plate and grow up each in 5 mL of LB media with appropriate antibiotic (in this case ampicillin), incubate for 8 h (day culture) in 37°C incubator shaking at 225 rpm.\nAdd 100 μL of the day culture to 30 mL of LB with appropriate antibiotic and incubate for 16 h in 37°C incubator shaking at 225 rpm.\nNext day, isolate plasmid DNA using Qiagen Midiprep EndoFree kit:\nHarvest bacterial culture by centrifuging at 6000 × g for 15 min\nNote: ultracentrifuge and special ultracentrifuge-friendly tubes need to be used here.\nNote: 4 cultures are prepared to ensure that at least one will yield the plasmid with no mutations.\nResuspend bacterial pellet in 2 mL of Buffer P1.\nAdd 2 mL of Buffer P2, invert several times to mix, and incubate at 20°C–24°C for 3 min\nAdd 2 mL of Buffer S3 to mix and invert several times to mix.",
    "Load mix into QIAfilter Cartridge in tube and incubate at 20°C–24°C for 10 min\nGently insert the plunger into the QIAfilter Cartridge and filter the cell lysate into tube.\nAdd 2 mL of Buffer BB to filtered lysate and invert several times to mix.\nTransfer lysate to spin column on QIAvac 24 plus.\nApply vacuum until liquid has drawn through all columns.\nAdd 0.7 mL Buffer ETR to wash columns and apply vacuum until liquid has drawn through all columns.\nAdd 0.7 mL of Buffer PE and apply vacuum until liquid has drawn through all columns.\nCentrifuge the columns at 10000 × g for 1 min in tabletop microcentrifuge to remove residual wash buffer.\nPlace columns into clean 1.5 mL tube, add 200 μL Buffer EB, and incubate for 3 min at 20°C–24°C to elute DNA.\nDetermine DNA concentration using the BioTek TAKE3 spectrophotometer.\nNote: Any generic spectrophotometer that can measure absorbance at 260 nm can be used.\nDNA can be stored at −20°C until use.\nPremix 400 ng of carrier plasmid (in 10 μL) + 25 pmol of each sequencing primer (in 5 μL) to Genewiz (or any other commercial sequencing service provider) for Sanger sequencing to verify sequence. For universal sequencing primers that are available with vendor, it is possible to submit carrier plasmid only and instruct the vendor to add the specified sequencing primer.\nAdd 5 μg of plasmid DNA in 16 μL or less.\nAdd 1 μL (20 units) of XhoI.\nAdd 1 μL (20 units) of EcoRI.\nAdd 2 μL of CutSmart buffer.\nBring volume of reaction to 20 μL with DNase/RNase-free water.\nIncubate at 37°C for 4 h.\nStop reaction by heat inactivation at 65°C for 20 min.",
    "Dephosphorylate DNA by adding 1 μL of alkaline phosphatase and incubate at 37°C for 1 h in heat block.\nCarry out electrophoresis on the digested plasmid on 1% agarose gel with 1 kb ladders and cut out the DNA band at 6683 bp that represent the linearized carrier plasmid; column purify the linearized plasmid using QIAquick Gel Extraction Kit as in step 3d.\nNote: Different heat blocks maintained at these temperatures (37°C and 65°C) are useful for these experiments but an incubator, PCR machine, or water bath can be used as alternatives.\nInsert PCR fragment or control insert (provided by the In-Fusion HD Cloning Plus Kit) into carrier plasmid via InFusion cloning:\nAdd 100 ng of gel purified PCR fragment\nAdd 50 ng of gel purified linearized vector.\nAdd 2 μL of 5× InFusion Premix\nTop to 10 μL total volume with DNase/RNase-free water.\nIncubate the reaction for 15 min at 50°C in the thermocycler, stop reaction by putting on ice.\nNote: Amount of PCR fragment and linearized vector to add per reaction depends on the length of these vectors. According to manufacturer’s instructions for PCR fragment: < 0.5 kb use 10–50 ng; 0.5 to 10 kb use 50–100 ng; > 10 kb use 50–200 ng; for linearized vector < 10 kb use 50–100 ng; > 10 kb use 50–200 ng.\nCritical: It is important to include both negative control (no PCR fragment) and positive control (2 μL of the control insert and 1 μL of the control vector included in the InFusion kit) at this step.\nPause Point: DNA at the end of each step can be stored at −20°C indefinitely.\nPropagate the plasmid along with controls by transforming into Stellar competent bacteria:\nWarm SOC medium to 37°C.",
    "Thaw Stellar Competent cells in an ice bath (wet ice to ensure even cooling) just before use.\nAfter thawing, mix gently to ensure even distribution.\nTransfer 50 μL of competent cells into a 14 mL round-bottom tube (falcon tube). Do not vortex.\nAdd 2.5 μL of the In-Fusion cloning reaction from step 5.\nFor negative control: add 2.5 μL of the In-Fusion cloning negative control reaction from step 5.\nFor positive control: add 2.5 μL of the In-Fusion cloning positive control reaction from step 5.\nPlace tubes on ice for 30 min\nHeat shock the cells for exactly 45 s at 42°C in a water bath.\nPlace tubes on ice for 1–2 min\nAdd pre-warmed SOC medium to bring the final volume to 500 μL.\nIncubate by shaking (160–225 rpm) for 1 h at 37°C.\nMake 1/100 dilution and 1/5 dilution (into 100 μL of pre-warmed SOC).\nConcentrate the remaining bacteria by centrifuging at 2000 × g for 5 min and resuspend in 100 μL of pre-warmed SOC media.\nPlate bacteria in SOC media onto LB agar plates.\nIncubate plates upside down at 37°C in an incubator 16 h.\nNote: Use the agar plate with the appropriate antibiotic resistance: for the pT3-EF1A-HA-E2F1-IRES-GFP plasmid the correct antibiotic is ampicillin.\nNote: Normally we do observe some colonies even on the negative control plate. Cloning may be successful as long as the number of colonies in experimental plate is greater than the number of colonies in negative control plate, which will be verified in step 7.\nNext day, pick 4 colonies from each experimental plate and grow up each in 5 mL of LB media with appropriate antibiotic (in this case ampicillin), and incubate for 16 h in 37°C incubator shaking at 225 rpm.",
    "Critical: It is important to remember to store glycerol stocks for the transformed bacteria before validation of plasmid is done, otherwise one will need to restart the entire protocol from InFusion cloning (step 5).\nIn the morning, after bacterial growth has reached saturation, retain 800 μL of transformed bacteria to prepare as glycerol stock: 800 μL bacteria + 200 μL glycerol, mix by vortexing and directly store at −80°C.\nIsolate plasmid DNA from E. coli culture using Miniprep Kit:\nCentrifuge LB media at 2000 × g for 10 min at 4°C to pellet bacteria.\nResuspend bacteria pellet in 250 μL of buffer P1.\nAdd 250 μL of buffer P2, mix.\nAdd 350 μL of buffer N3, mix.\nCentrifuge for 10 min at 20°C–24°C.\nAdd 800 μL of supernatant to QIAprep spin column.\nCentrifuge and discard flow through.\nWash column with 0.5 mL of buffer PB, discard flow through.\nWash column with 0.75 mL of buffer PE, discard flow through.\nElute DNA with 50 μL of buffer EB.\nNote: Centrifugation is performed at 10000 × g unless otherwise specified.\nVerify cloned plasmid by restriction digest and Sanger sequencing\nMix 400 ng of plasmid DNA (in 10 μL) + 25 pmol of each sequencing primer (in 5 μL) to Genewiz (or any other commercial sequencing service provider) for Sanger sequencing as described in step 4d.\nFor restriction digest:\nAdd 1 μg of plasmid DNA.\nAdd 1 μL of XhoI.\nAdd 1 μL of BstXI.\nAdd 1 μL of EcoRV.\nAdd 10 μL of NEB 3 buffer.\nAdd DNase/RNase-free water to 100 μL.\nIncubate at 37°C for 1 h, stop reaction by placing reaction on ice.\nRun reaction on 1% agarose gel along with 1 kb DNA ladder.",
    "Check for expected digest pattern (For the pT3-EF1A-HA-E2F1-IRES-GFP plasmid, expect 3 bands at 5348, 1891, and 797 bp).\nCritical: It is important to verify by both restriction digest, to confirm the preparation contains only the expected plasmid, and Sanger sequencing, to verify no mutations were introduced during cloning. It is not sufficient to only carry out Sanger sequencing at this verification step as Sanger sequencing will only pick up the most abundant sequence, therefore masking other potentially contaminating plasmids. If undesirable cloning products are observed in the restriction digest (i.e., bands are detected at unexpected locations in the agarose gel), then the cloning reaction will need to be repeated from step 5 with a few different PCR fragment to linearized vector ratios.\nHydrodynamic tail vein delivery of plasmids\nTiming: ∼ 4 days\nHydrodynamic delivery of plasmids into mice will result in the expression of plasmid-encoded transgene in hepatocytes (Liu et al., 1999[href=https://www.wicell.org#bib4], Carlson et al., 2005[href=https://www.wicell.org#bib1]). This protocol involves injecting a large volume of liquid containing the plasmid of interest into the mouse tail vein; the high colloidal pressure results in the transfer of the plasmid from the serum into the intracellular space of the liver through the fenestrated endothelium of the hepatic capillary bed (Chen and Calvisi, 2014[href=https://www.wicell.org#bib2]).\nPrepare plasmid for injections\nPre-warm an LB agar plate with appropriate antibiotic to 37°C to select for plasmid used.\nScratch surface of glycerol stock stored in step 6r or glycerol stock for pCMV-SB13 quickly with a sterile pipette tip and return glycerol stock to −80°C.\nNote: Never allow the glycerol stock to thaw, bring agar plate to the −80°C freezer.\nSurface with the pipette tip without puncturing the agar with ampicillin.\nIncubate the plates up-side-down at 37°C for 16 h.",
    "Next day pick 4 colonies from plate and grow up each in 5 mL of LB media with appropriate antibiotic (in this case ampicillin), incubate for 8 h (day culture) in 37°C incubator shaking at 225 rpm.\nAdd 100 μL of the day culture to 30 mL of LB with appropriate antibiotic and incubate for 16 h in 37°C incubator shaking at 225 rpm.\nNext day, isolate plasmid DNA using Qiagen Midiprep EndoFree kit as described previously in step 4c and determine the concentration of the plasmid DNA using BioTek TAKE3 spectrophotometer.\nNote: If the yield of the Midiprep is very low (e.g., less than 100 μg total yield), retransforming the final vector into One Shot™ Stbl3™ Chemically Competent E. coli (Thermo Fisher Cat#C7373-03) can help improve efficiency.\nHydrodynamic delivery of plasmids into mice.\nThaw plasmids to be injected (e.g., pT3-EF1A-HA-E2F1-IRES-GFP and pCMV-SB13) on ice.\nFor 1 mL of the injection mix, combine 15 μg of pT3-EF1A-HA-E2F1-IRES-GFP, 3.75 μg of pCMV-SB13, and sterile saline.\nFilter the injection mix through an 0.22 μm filter into a brand new 50 mL Falcon tube to ensure sterility.\nMouse tail vein hydrodynamic injection (in the biosafety hood of the mouse facility):\nWeigh the mouse and calculate the amount of plasmid solution to administer (10% v/w, i.e., 2 mL plasmid solution per 20 g mouse). Always prepare some extra plasmid solution (∼ 10% extra) to account for some volume wasted in the syringe.\nDraw up the desired amount of plasmid solution into a 3 mL syringe with a 26 gauge 5/8 inch needle.\nPlace the entire mouse body inside of the restrainer with its tail sticking out.\nWarm the bottom of the mouse tail under heat lamp for 10 s.",
    "Rapidly inject mouse via the tail vein (within ∼ 5 to 7 s) with syringe held at a 10 degree angle to the vein.\nTake mouse out of strainer and check for vitality signs (normal heartbeat and breathing).\nMice can be placed back into the original cage immediately after injection.\nCritical: It is important to use sterile techniques for sample preparation and injection (i.e., use of sterile single-use syringes, needles, Falcon tubes etc. and sterile solutions) to prevent unwanted immune reactions to the procedure.\nNote: The efficiency of plasmid delivery to hepatocytes will likely vary for different vectors in mice with different conditions (e.g., male/female, young/old, healthy/fat etc.) in different laboratory settings. Thus, it is advised to try 2–3 different concentrations ranging from 5 μg to 30 μg/mL of the target vector to achieve ideal delivery efficiency (i.e., how many hepatocytes get transfected). This can be assessed in a first round optimization experiment whereby the investigator checks the injected mice after 1 week to count the number of GFP positive cells on a tissue section. Then, a second round can be carried out using only the optimized concentration.\nNote: Typically, after a successful injection, mice will appear “drowsy” for a few minutes up to an hour and return to full alertness/complete normalcy. If the mouse remains drowsy for longer than 1 h, this indicates improper injection technique and fatal injury, in which case the mouse needs to be euthanized immediately. Mice that do recover rapidly need to be monitored at 2, 12, and 24 h post-injection. Any signs of distress requiring euthanasia are to be attended to immediately.\nIsolation of transfected hepatocytes and quantification of gene expression changes\nTiming: 4 days",
    "GFP expressing hepatocytes can be isolated from the livers of hydrodynamically injected mice by in situ perfusion of the liver followed by fluorescence activated cell sorting (FACS). RNA is subsequently extracted from the isolated hepatocytes to quantify the amount of the transgene and any gene expression changes of interest using real-time polymerase chain reaction (real-time PCR).\nCollagenase-based liver perfusion technique is used to isolate hepatocytes from mouse livers as described in detail by Li et al. (Li et al., 2010[href=https://www.wicell.org#bib3]) with the following modifications:\nPerfusion medium I is replaced with Liver Perfusion Medium.\nPerfusion medium II is replaced with Hepatocyte Wash Medium containing 0.05% w/v Collagenase.\nInstead of culturing the isolated hepatocytes, resuspend the final hepatocyte pellet in PBS + 1% BSA + 0.1 μg/mL of DAPI on ice and FACS immediately.\nNote: The quality of Collagenase can be extremely variable; therefore, it is worthwhile purchasing small tester samples from different lots when optimizing hepatocyte isolation. Once a good lot of collagenase is identified, bulk order collagenase with the same lot number and store in frozen aliquots.\nEvaluate hepatocyte cell viability using a light microscope\nMix 10 μL of cell suspension with 10 μL of Trypan Blue solution\nLoad 10 μL of the mixture onto a hemocytometer onto a light microscope\nCount the total number of live cells (not stained blue, see Figure 1[href=https://www.wicell.org#fig1]) from two random square grids out of the 9 square grids\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/581-Fig1.jpg\nFigure 1. Hepatocyte preparations that contain mostly live (left) vs. dead (right) hepatocytes as viewed on light microscope following Trypan blue staining\nWhite arrows point to individual hepatocytes viewed at 200× total magnification.\nConcentration of live hepatocytes is determined as follows: total # cells from two square grids × 104/mL",
    "Note: A good hepatocyte isolation preparation yields > 80% viable hepatocytes using Trypan Blue staining, in our hands. We found that even dead hepatocytes isolated by this method are not completely blue when stained with trypan blue dye, instead they appear to have some light-colored regions (Figure 1[href=https://www.wicell.org#fig1]).\nFACS isolation of transfected hepatocytes by GFP fluorescence on BD FACSAriaTM II\nElectronically gate hepatocytes based on their forward and side scatter parameters.\nSingle cells are selected based on forward scatter-area and forward scatter-height.\nDAPI positive cells are excluded as dead cells.\nThe rest of cells are sorted into GFP positive and GFP negative fractions into 1 mL of TRIzol®.\nPause Point: Cells can be vortexed then stored in TRIzol® at −80°C indefinitely.\nCritical: Hepatocytes are very large cells; thus, necessary precautions need to be taken including filtering cells into FACS tubes immediately before loading into FACS machine and using a large size nozzle (100 μm used here).\nAlternatives: Any FACS machine that can resolve GFP and DAPI positive cells can be used here instead of the BD FACSAriaTM II.\nExtract RNA from samples stored in TRIzol®.\nThaw sample in TRIzol®.\nAdd 0.2 mL of chloroform, vortex to mix.\nIncubate for 3 min at RT.\nCentrifuge samples at 12000 × g for 15 min at 4°C.\nCarefully transfer the top aqueous phase to new tube.\nAdd 0.5 mL of 2-propanol, incubate for 10 min at 4°C.\nCentrifuge samples at 12000 × g for 10 min at 4°C.\nDiscard supernatant.\nResuspend the RNA pellet in 75% ethanol.\nNote: The pellet is very loose at this stage and may be dislodged easily. Be very gentle when removing supernatant.\nCentrifuge samples at 7500 × g for 5 min at 4°C.\nDiscard supernatant.\nAirdry the RNA pellet for 10 min at RT.",
    "Resuspend RNA pellet in DNase/RNase-free water, pipette up and down to mix.\nIncubate RNA at 55°C–60°C for 15 min.\nPause Point: RNA can be stored at −80°C until RT-PCR.\nAlternatives: RNA isolated here can also be used for RNA sequencing to profile global transcriptomic changes in transfected hepatocytes. It might be necessary to re-purify the TRIzol® isolated RNA through a silicone column (such as the Qiagen RNeasy kit) before samples can be used for library preparations.\nReverse-transcribe RNA into cDNA.\nDetermine RNA concentration using the BioTek TAKE3 spectrophotometer.\nAdd 1 μg RNA in 20 μL DNase/RNase-free water to cDNA EcoDry Premix, pipette up and down for up to 10 s to mix.\nIncubate at 42°C for 60 min and stop reaction by incubating at 70°C for 10 min in PCR machine.\nPause Point: cDNA can be stored at −20°C or −80°C until real-time PCR.\nReal-time PCR to determine gene expression in transfected hepatocytes.\nMix forward and reverse primers for each primer pair to make primer stock that contain 25 μM of each primer in DNase/RNase-free water (e.g., for 100 μL of primer stock: mix 25 μL of 100 μM forward primer solution, 25 μL of 100 μM reverse primer solution, with 50 μL DNase/RNase-free water).\nDilute cDNA to 5 ng/μL with DNase/RNase-free water.\nFor each reaction add 0.4 μL of 25 μM primer stock, 4.6 μL of DNase/RNase-free water, and 5 μL of iQ SYBR Green Supermix.\nNote: To minimize pipetting errors, make master mix for each primer stock with SYBR Green (e.g., total number of samples = number of cDNA samples × triplicates). We normally prepare a few extra reactions to adjust for pipetting errors especially using automatic pipettors as well as for the negative control condition.",
    "Load samples into Axygen 384 Well PCR Microplate (pipette 5 μL of the appropriate cDNA or DNase/RNase-free water (negative control) into each well, then add 5 μL of the appropriate primer master mix).\nSeal the plate with Axygen 384 Well PCR Microplate Seals.\nLoad plate into the Roche LightCycler® 480, real-time PCR program is shown in Table 2[href=https://www.wicell.org#undtbl3].\nCalculate Ct values using the “Abs Quant/2nd Derivative Max” option in the LightCycler® 480 software.\nAlternatives: Any real-time PCR machine and compatible SYBR reagents can be used.\nDelta Ct values are first generated by normalizing average Ct values (over triplicates) to the endogenous control (e.g., Gapdh):\ndCt_sample = 2 ˆ (Ct_endo – Ct_sample)\nRelative gene expression in the transfected hepatocytes is generated by normalizing to a reference sample (i.e., untransfected hepatocytes):\nddCt = dCt_sample/dCt_ref\nTracking transfected hepatocytes through liver regeneration\nTiming: 1 week\nHydrodynamically injected mice undergo PH and are sacrificed for liver immunohistochemistry/immunofluorescence to determine the effect of transgene overexpression on hepatocyte behavior during liver regeneration. It is recommended that a separate cohort of mice is used here as it is unclear how PH affects liver perfusion, which in turn represents a terminal procedure.\nRemoving 2/3 of liver mass by PH is carried out at 7 days after hydrodynamic vein injection as described in detail by Mitchell et al. (Mitchell and Willenbring, 2008[href=https://www.wicell.org#bib5]) with the only modification being instead of sutures, wound clips are used to close the outer skin to increase speed and efficiency of surgery.\nNote: It is highly recommended that experimenters practice with dead mice until they are capable of performing the surgical and suturing procedures before proceeding to using live mice.",
    "To determine the effects on gene expression prior to cell division, mice are sacrificed at 30 h post-surgery. Intact liver lobes were fixed in 10% formalin (16 h, followed by switch to 70% ethanol until paraffin embedding and sectioning) or fixed in 10% formalin (16 h, followed by 10% sucrose/PBS, 20% sucrose/PBS, 30% sucrose/PBS over the next days, embed in OCT compound on dry ice then transferred to storage at −80°C until sectioning on the cryostat in step 19).\nNote: It is important to only use the untampered/non-resected lobes for subsequent studies as the lobes that have been resected may contain necrotic tissue.\nSurgery and mouse sacrifice/tissue collection should be staggered at 30 min intervals to make sure the same 30-h recovery timepoint is measured for each mouse.\nImmunofluorescence from cryosections:\nOCT embedded tissues are mounted onto a cryostat and sectioned to 10 μm thickness and placed on positively charged slides.\nAntigen retrieval is carried out by incubating in Acetone for 10 min at −20°C.\nRehydrate in PBS for 5 min, then block in 3% BSA in PBS for 10 min at RT.\nApply primary antibody (GFP and Ki67 antibodies 1 : 400 diluted in blocking solution) and incubate for 16 h at 4°C.\nWash 3× with PBS, 5 min each at RT.\nApply secondary antibody (1:400 dilution of anti-Chicken Alexa Fluor™ 488 antibody and anti-Rabbit Alexa Fluor™ 647 antibody) in block and incubate for 30 min at RT.\nWash 3× with PBS, 5 min each at RT.\nAdd a drop of DAPI Fluoromount-G\nSlowly place a coverslip on top to avoid trapping bubbles and seal with nail polish.\nPause Point: Mounted sections can be stored for a few months at 4°C until imaging.\nImage on a fluorescence microscope.\n10 images are taken with the 10× objective (100× total magnification).",
    "The number of GFP and Ki67 double positive cells are counted and normalized to the number of GFP positive cells to obtain the fraction of transfected hepatocytes initiating cell proliferation at 30 h post-PH.\nNote: The primary antibodies should be raised in different species to avoid cross-reactivity with the secondary antibodies."
  ],
  "subjectAreas": [
    "Metabolism",
    "Microscopy",
    "Flow Cytometry",
    "Cell Biology",
    "Molecular Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}