{
  "id": 8351,
  "origin_website": "Jove",
  "title": "Extraction and Dissection of the Domesticated Pig Brain",
  "procedures": [
    "Procedures involving animal subjects have been approved by the Institutional Animal Care and Use Committee (IACUC) at the University of Illinois at Urbana-Champaign\nNOTE: Prior to euthanasia, the pig was anesthetized via intramuscular injection with a combination of telazol:ketamine:xylazine (50.0 mg of tiletamine HCl plus 50.0 mg of zolazepam HCl reconstituted with 2.50 mL of ketamine HCl (100 g/L) and 2.50 mL of xylazine (100 g/L) and administered at 0.06 mg/kg BW). Once anesthetized, the pig was euthanized via intracardiac administration of sodium pentobarbital (390 mg/mL administered at 1 mL/5 kg BW). For brain dissection, it is recommended that the method of euthanasia be chosen based on the desired analytical procedure of the tissue. The method of euthanasia should cause as little damage to the brain as possible.\n1. Extraction of the pig brain\nFollowing humane euthanasia, decapitate the pig by cutting above the nape of the neck, between the first and second vertebra (atlas and axis, respectively).\nSecure the head in an immobilized bench vise modified to include spikes. Ensure that the head is completely immobilized before proceeding.\n\t\nUsing a scalpel, make a sagittal cut along the midline of the skull that continues to the posterior of the head.\nMake a second (transverse) cut on the posterior of the head.\nMake a third (transverse) cut on the posterior end of the snout and in-line with the eyes. Cut the skin as far away from the skull as possible to ensure easy access to the skull.\nUsing a bone saw, make two anterior-to-posterior cuts lateral to the midline, extending from the eyes to the apex of the skull curvature. Bevel the saw towards the midline and cut just deep enough to penetrate the skull.\n\t\nRepeat the above process on the perpendicular sides, creating a rectangular \"window\" in the skull.",
    "Using a meat hook, pry the rectangular section of the skull off. Begin by placing the hook into one of the corners of the section and apply upward pressure to loosen the skull piece. Take care to place the meat hook only at the level of the skull to prevent inadvertently penetrating the brain tissue.\nIf any meningeal layers remain on the brain, use forceps and blunt scissors (or alternatively, a scalpel) to gently remove the layers without cutting into the brain.\nUse a scalpel to cut away muscle and fat at the posterior portion of the head, exposing the posterior portion of the skull.\n\t\nMake two transverse cuts along the posterior of the skull. Be sure not to cut into brain tissue.\nSecure the head by placing a firm hand on the snout and apply a backwards pressure to pull the posterior portion of the skull off, exposing the cerebellum.\nRemove the head from the bench vice and place on a surgical mat.\nUse a long slender tool, such as the blunt end of a scalpel, to remove the brain. Invert the head and use a gentle scooping motion to coax the brain out of the skull cavity without damaging the surface of the brain.\n\t​NOTE: It will be necessary to sever cranial nerves to remove the brain. Do so gently and do not attempt to forcefully pull the brain out. The brain will fall out on its own when it is properly and completely detached from the skull and spine.\n2. Dissection of the pig brain",
    "NOTE: It may be helpful to use a brain atlas or fiber dissection guide14 as a visual representation during dissection procedures. Make sure dissected tissue samples are stored properly according to project-specific needs upon removal of each sample (described in more detail below). Additionally, please note that for the purposes of this video, all brain regions shown were dissected from the right hemisphere, but this may differ per laboratory based on experimental objectives.\nTo remove the brainstem (predominantly the medulla), make a coronal cut caudal to the cerebellum.\nTo remove the cerebellum, make a coronal cut posterior to the cortex. Isolate desired regions (e.g., vermis, flocculus, etc.) of the cerebellum from this sample. Be sure not to include any portions of the brain stem in this sample.\nSeparate the two hemispheres of the brain by making a mid-sagittal cut along the longitudinal fissure. Make this cut as a continuous motion to prevent causing damage to the cortex.\nTo remove the midbrain, dissect a desired amount of tissue just ventral to the superior and inferior colliculi.\nTo remove the hippocampus, place the blunt end of a scalpel in the posterior portion of the corpus callosum and gently roll the hippocampus out, using a \"J\" motion starting from the posterior portion of the corpus callosum; an entire hippocampal horn is 'bean-shaped'.\nThe striatum (caudate nucleus is primarily shown) is a grey and white matter-striped region just below the corpus callosum and anterior to the hippocampus. Bevel the scalpel and remove this region, revealing striated tissue upon removal.\nTo remove the medial prefrontal cortex, dissect tissue from the frontal gyrus to the corpus callosum, removing the most medial portion of that section. The right cortex should remain after removal of the medial prefrontal cortex.",
    "To remove the thalamus, remove the bulb-like structure at the center of the midsagittal surface of the brain and rostral to the midbrain. The thalamus has a spherical shape and will look slightly darker than the surrounding tissue.\n3. Post-dissection\nUpon completion of the dissection, preserve tissue samples properly for subsequent analyses. Omission of this step will result in significant autolysis and degradation within as little as 20 minutes.\nLeave each brain region intact at the time of dissection if structural analyses will be performed, or mince the tissues to create a homogenous tissue sample prior to preservation. Common sample preservation methods for brain tissues include cryopreservation and chemical fixation using crosslinking agents15.\nFor standard lab assays (e.g., gene or protein expression), immerse in liquid nitrogen or solutions that stabilize genetic material prior to long-term storage at -80 °C to provide convenient and cost-effective preservation methods.\nIf maintaining tissue structure is a priority, preserve brain tissues through traditional fixation methods (e.g., using aldehyde-based fixatives to crosslink proteins), either without or with perfusion of the animal or organ of interest prior to tissue dissection.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}