{
  "id": 10593,
  "origin_website": "Jove",
  "title": "Longitudinal Two-Photon Imaging of Dorsal Hippocampal CA1 in Live Mice",
  "procedures": [
    "All of the methods described have been approved by the Government of Upper Bavaria (licence 2016_ROB-55.2Vet-2532.Vet_02-16-48) and by the Stanford and Max Planck Florida Institute for Neuroscience Administrative Panels on Laboratory Animal Care.\n1. Preparation of the imaging cannula\nHold a precision drill on a drill stand supplied with a movable ruler table.\nClamp a 3.0 mm diameter stainless steel tube onto the movable ruler table.\nCut the tube to a 1.6 mm-long metal ring. If the edges of the ring are not blunt after cutting, file out the irregularities.\nRinse the metal ring and a circular 4 mm-diameter glass coverslip in 100% acetone and leave to dry for ≈5 min.\nPlace the metal ring and the glass coverslip onto a smooth, even and clean work place, under a stereoscope.\nPlace a drop of UV-curing optical adhesive on a smooth surface, such as a Petri dish. Use a needle or a spatula to spread out the adhesive to form a thin (<0.5 mm) layer.\nUse forceps to dip one side of the metal ring into the adhesive. Pay particular attention not to seal the inside of the ring. If this happens, use a needle to break the optical adhesive in the ring.\nUsing the stereoscope, position the metal ring at the center of the glass coverslip with the side of the ring covered by adhesive touching the coverslip. A thin ring of adhesive should form at the interface between the metal ring and the coverslip. Avoid any adhesive spreading to the center of the coverslip.\nTurn on the UV-curing LED driver unit and shine light (365 nm) for 1 min.\n\tCAUTION: UV light provokes skin burns and is a mutagenic agent. Wear UV-protecting glasses and cover hands and arms with gloves and a lab-coat to avoid skin exposure.",
    "To cure the adhesive evenly, make sure all sides of the ring are equally illuminated by changing the direction of the light source.\nLet the adhesive harden for at least 2 h, preferably, overnight.\nFirmly hold the cannula from the open end of the metal ring by means of a hemostat. Using a dental drill fitted with a rotating file and working under the stereoscope, file off the excess glass coverslip until flush with the sides of the ring (Figure 1A).\n2. Implantation of the imaging cannula over the dorsal hippocampus\nPreparation of equipment and setup\nMake sure all surgical instruments are clean and sterile. If using a glass bead sterilizer for sterilization, clean the instruments and place them in the sterilizer (set to 250 ˚C) for 10 min, prior to use. Alternatively, autoclave the instruments before use.\nPrepare all materials required for the surgery, as well as surgical instruments, so that they can be reached readily.\nMake sure there is enough freshly prepared medications such as pain killers or anti-inflammatory drugs.\nMake sure there is enough isoflurane for the whole duration of the surgery (approximately 1 h per surgery).\nTurn on the heating carpet and set it to 37 ˚C to keep animal temperature stable while under anesthesia.\nMake sure the scavenging system for isoflurane is functioning.\nOpen the valve of oxygen flow.\nAnesthesia induction, and animal fixation\nPlace the mouse in the anesthesia induction chamber at 3% isoflurane in 1 L/min O2 and wait until it loses consciousness. Assess anesthesia using the toe pinch reflex test.\nWeigh the animal.\nApply anti-inflammatory (Meloxicam, 1mg/Kg) and pain killer (Vetalgin, 200mg/kg) drugs subcutaneously.\nPosition the mouse on the heating carpet. Make sure that the animal is not in direct contact with the heating carpet to avoid thermal burns.",
    "Secure the head to the stereotactic apparatus and position the nose cone to cover the snout. To maintain anesthesia, decrease isoflurane to 1.5-2%. Throughout the surgery, monitor mouse state by visually monitoring breathing and by testing toe pinch reflex. Regulate isoflurane percentage if necessary.\nApply ophthalmic ointment to the eyes to prevent dehydration and potential blindness.\n\t\tNOTE: For anesthesia and animal medication, alternative methods and drugs are possible. Please, refer to your animal license and the relative literature.\nOptic cannula implantation\nTurn on fiber optic light source.\nRemove the hair and disinfect the skin over the mouse head.\nUsing scissors and forceps, remove the mouse scalp. Start by making a small cut in the scalp in a position close to lambda. Continue by opening the scalp on the two sides. First move laterally in the direction of ears, then rostrally, in the direction of eye orbits, to form a triangle on the sagittal axis, approximately 4 mm rostral to bregma. Pay attention not to cut too close to ears and eyes, but expose bregma and lambda, as well as parietal bones and the posterior half of frontal bones.\nApply one drop (≈10 mg) of lidocaine (28.9% v/v in alcohol) to the skull.\nClear the periosteum and dry the skull using a cotton swab.\nPosition the ear bars, to fix the mouse head.\nMake a small craniotomy, using a micro-drill with a 0.5 mm width burr. Position the hole into the frontal bone opposite to the imaged hippocampus, approximately 1.5 mm from the sagittal suture and 2 mm distant from the coronal suture.\nScrew a 0.86 mm-width stainless steel bone screw into the skull hole.\nIf necessary, clean the debris and dry the skull.\nPreparation of a mixture of quick adhesive cement",
    "Using a small spoon (≈ 4.5 mm diameter), dispense 1-1.5 level scoops of L-powder into a mixing well.\nDispense 3-4 drops of Quick Base into the well.\nDispense 1 drop of Universal Catalyst into the well.\nStir the mix for 5-10 s using a precision applicator.\n\t\t\tNOTE: Alternative cements are available. Please refer to their manufacturer’s instructions.\nUse precision applicators to apply quick adhesive cement over the skull, screw and surrounding skin. Let it dry for 30 s to 1 min.\nUse a 3.0 mm diameter trephine drill to make a craniotomy in the parietal bone. Position the hole approximately 1.5 mm distant from the sagittal suture and 2 mm distant from the lambdoid suture.\nCarefully remove the bone flap.\nCheck the size of the craniotomy using the cannula to make sure that it fits. Use a 0.5 mm or 0.9 mm width micro-drill to enlarge the craniotomy if necessary.\nRemove the meninges using Dumont forceps.\nAblate cortical matter, to reach the external capsule. Use a 0.9 mm diameter (19 gauge) blunt needle connected to a vacuum pump. Irrigate with saline to avoid dehydration of the exposed tissue and to wash away residual blood after bleeding is resolved. Suck cortical tissue slowly, ≈50-100 µm at a time, until cortex detaches from the capsule, exposing the fibers of the cingulum or the corpus callosum. Change the needle frequently, to prevent clogging.\nFibers extend mainly in three directions (Figure 1B). Carefully peel the dorsal fibers until the deepest fibers (alveus of the hippocampus) are exposed.\nRinse the tissue with saline. Use thin forceps to dip the bottom cannula into saline and position it over the skull hole. Cannula and tissue have to be sealed by saline to avoid trapping air bubbles between the cannula and the tissue.",
    "Push the cannula into the skull (Figure 1C) until the glass coverslip is in contact with the fibers.\nDry the skull well using absorption triangles, cotton swabs and/or the vacuum pump.\nPreparation of a mixture of quick adhesive cement (refer to step 2.3.10).\nUse precision applicators to apply quick adhesive cement over the skull. Apply adhesive also on the rim of the cannula. Be careful not to let the adhesive run into the cannula. Let it dry for 30 s to 1 min.\nUse a stereotaxic arm to position a head holder plate over the cannula, in contact with the skull.\nPreparation of a mixture of dental acrylic\nUsing a spoon (≈9 mm diameter), dispense 1 level scoop (1 part) of powder into a mixing well.\nDispense 2-3 parts of liquid in the same well. Cover the whole powder with the liquid.\nStir for ≈1 min using a spatula.\n\t\t\tNOTE: Alternative acrylics are available. Please refer to their manufacturer’s instructions.\nUse a spatula or a precision applicator to apply acrylic across the cranium. Cover the entire exposed skull, the screw and the open skin with dental acrylic. This makes the preparation stable. Do not let acrylic run down the neck, ears and eyes.\nLet the acrylic dry and harden for about 15 min.\nApply a removable adhesive film onto the head holder plate, to prevent debris from entering the cannula. It is recommended that the film size matches that of the plate.\nTurn off isoflurane flow, remove the animal from stereotactic apparatus and position it on a heating plate to maintain physiological body temperature while it wakes up from anesthesia.\nMonitor the animal until it has regained sufficient consciousness to maintain sternal recumbency.\nReturn the animal which has undergone surgery to the company of other animals only when fully recovered.",
    "3. Postoperative care\nCheck the status of the mouse for 2 days following surgery, by monitoring the weight and general behavior.\nApply anti-inflammatory (Meloxicam, 1mg/Kg) and pain killer (Vetalgin, 200mg/kg) drugs subcutaneously for 2 days following surgery\n\tNOTE: Alternative monitoring procedures, drugs and dosages are possible for postoperative care. Please, refer to your animal license and the relative literature.\n4. Preparation of the imaging session\nTurn on the imaging setup in advance and let the laser to warm up and stabilize, if necessary.\nAnesthetize the mouse (refer to step 2.2.1).\nUse forceps to carefully remove the adhesive film from the head holder plate. Hold the mouse in a hand and the head holder plate with the fingers. Remove the film gently, to avoid damaging the preparation.\nPosition the mouse under the microscope, over the heating carpet and secure the head plate to the holder (Figure 1D).\nPosition the nose cone to cover the snout and decrease isoflurane to 1.5-2%.\nApply ophthalmic ointment to the mouse eyes.\nClean the imaging cannula by rinsing with deionized water. Use a syringe and a thin needle to drop water into the cannula and a vacuum pump to remove it.\n5. Imaging session\nUse low magnification, long working distance objectives to visually check the cannula for residual water, dirt, integrity and the presence of fluorescence.\nAlign the cannula to the optic axis by adjusting the angles of the head holder arms.\nSwitch to the 25X 1.0 NA, 4 mm WD or the 40X 0.8 NA, 3 mm WD, water immersion objectives. Add enough deionized water to fill the cannula and maintain excess water on top of the cannula. Avoid the formation of air bubbles.\nUse 2P excitation and image fluorescent signals.",
    "NOTE: The imaging protocol is highly dependent on the time and spatial scales to be imaged. Please refer to the sections representative results and discussion for details about the imaging settings we have used to produce the images shown in this article."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}