{
  "id": 18421,
  "origin_website": "Jove",
  "title": "Autoradiographic Measurements of [14C]-Iodoantipyrine in Rat Brain Following Central Post-Stroke Pain",
  "procedures": [
    "The protocol in the present study received approval from the Academia Sinica Institutional Animal Care and Utilization Committee in Taiwan.\n1. Animal Preparations\nObtain male Sprague-Dawley rats (approximately 300 - 400 g). Maintain the rats in an air-conditioned room (21 - 22 °C, 50% humidity) under a 12 hr/12 hr light/dark cycle (lights on at 8:00 AM) with free access to food and water.\n2. Experimental Procedure\nAllow all of the rats to adapt to the environment in their home cages for 1 week before the experiments. During adaptation, perform the von Frey and plantar tests to establish baselines.\nvon Frey Test\nPlace the rat in an acrylic enclosure (30 cm × 30 cm × 80 cm) for 30 min for habitation.\nObtain von Frey filaments (filament no. 11 - 20) that have the same length but varying diameters to provide a range of forces of 2 - 100 g.\nTo assess the paw withdrawal threshold in the rat's hindpaw, use von Frey filaments to stimulate the center of the hindpaws through a net-like port on the acrylic plate at 5 min intertrial intervals. To record the maximum applied pressure, use the filaments in ascending order, from low to high, until the maximum applied pressure is recorded.10\nWhen rats exhibit a paw withdrawal response to the stimulation, record the filament number. Determine the withdrawal response in this trial according to the lowest stimulus.\nRepeat the same procedure immediately, for a total of three times in succession on the same rat. Convert the filament number into the corresponding force (in grams) and average the values.\nPlantar Test\nPlace the rat in a transparent Plexiglas box (divided into four frames, 80 cm × 30 cm × 15 cm) for 30 min for habitation.",
    "Use an infrared beam to stimulate the center of the hindpaw through a glass plate. Adjust the infrared light intensity to obtain an average paw withdrawal response latency of approximately 10 sec. Conduct a trial by depressing a key that turns on the infrared light source and starts a digital solid-state timer. Manipulate the duration of the infrared light beam.\nRecord the duration of the infrared light when the rats exhibit a paw withdrawal response. The longest duration should not exceed 20 sec in each trial to avoid tissue damage. Use an intertrial interval of at least 5 min to avoid successive stimulation.\nRepeat the test with three trials for the left and right hindpaws, and calculate the average for each hindpaw for each rat.\nCollagenase Lesion Surgery\nAnesthetize the rat with 4% isoflurane until loss of the toe-pinch response and somatic responses to surgical stimuli occur. Maintain anesthesia with 1.5 - 2% isoflurane for the duration of surgery.\nPlace the rat in a stereotaxic device with a simple heating pad to maintain body temperature at 36.5 - 37.5 °C. Apply eye cream on the eyes to prevent dryness while under anesthesia.\nShave the fur with sterilized electric clippers, and make a smooth incision (approximately 2-2.5 cm) with a scalpel along the midline of the scalp. Clean the skin and skull with alternating providence iodine and 75% alcohol solution for disinfection. During the surgical phase, use 75% alcohol to sterilize all devices, tools, and the workbench to maintain sterile conditions. Before that, all surgical materials must be sterilized in a steam autoclave.",
    "Use the sterile gloves and instruments, and drill a small hole (3 mm diameter) in the skull with an electric drill over the VB (including ventral posteromedial thalamic nucleus [VPM] and ventral posterolateral thalamic nucleus [VPL]) of the thalamus (3.0-3.5 mm posterior, 3.0-3.5 mm lateral to bregma, and 5.5-5.8 mm depth from skull surface).\nMicroinject 0.5 μl of normal saline or 0.125 U of type 4 collagenase solution in the control and experimental groups, respectively.\nKeep the injection needle in place for an additional 5 min to allow for drug diffusion.\nUse dental cement to fill the hole in the skull, and suture the incision. After suture the incision, apply the local analgesic anesthetics (lidocaine ointment) to the wound, and return them to their home cages.\nAfter surgery, singly house the rats in plastic cages until they maintain sternal recumbency, and keeps warm until recovered from anesthesia.\nBehavioral Tests after Surgical Recovery\nAfter 7 days of recovery from surgery, repeat the procedures in sections 2.2 and 2.3 for the test phase. Perform the behavioral tests over 4 weeks while monitoring the health and developmental status of the animals.\nMonitor the animals' health conditions (e.g., body weight, feeding amount, and free movement) between the control and experimental groups for the post-surgery phase.\nPerform Cannula Implantation with PE-50 Tubing\nAnesthetize the rat with 4% isoflurane, and maintain body temperature at 36.5 - 37.5 °C with a simple heating pad.\nWith a scalpel, cut two holes (2 cm diameter each) in the midline of the dorsal part of the forelimbs and intersection of the ventral part of the left shoulder and thoracic cavity, respectively.\nDissociate the skin and muscle with a pair of scissors between the two holes.",
    "Connect one end of PE- 50 tubing (20 cm length) to the external jugular vein through the ventral hole. Connect the terminal end of the same PE- 50 tubing to the dorsal hole, and affix to the skin.\nUse a syringe to inject saline into the jugular vein to verify that the PE- 50 tubing is not obstructed.\nSuture the incision, and inject the rats with 6 mg/kg gentamycin (intraperitoneally).\nFlush the tubing every other day after surgery with 0.3 ml of 0.9% saline, followed by 0.1 ml of saline with 20 U/ml heparin.\nFinal Behavioral Test\nOne week after step 2.6, repeat steps 2.2-2.3 to confirm that behavior is stable compared with step 2.5 after surgical recovery.\nRadiotracer Injection\nPlace the rat in a resting cage for 5 - 10 min for adaptation.\nUsing a splitter, connect PE- 50 tubing to two 1 ml syringes. Fill one syringe with normal saline and fill the other with [14C]-IAP solution (125 µCi/kg in a volume of 0.3 - 0.5 ml).\nInject the radiotracer into the external jugular vein, and replace the syringe with another syringe filled with 3 M potassium chloride.\nTen seconds after the radiotracer injection, inject 3 M potassium chloride under an overdose of isoflurane, and sacrifice the animals according to standard euthanasia methods (i.e., isoflurane from a vaporizer for 50 min) based on the guidelines of the Academia Sinica Institutional Animal Care and Utilization Committee in Taiwan.\nAfter 1 min, expose the skull, and trim off the remaining muscle. Using rongeurs, peel away the dorsal surface of the skull from the brain. Trim away the sides of the skull using rongeurs. Next, using a spatula, cut the olfactory bulbs and nerve connections along the ventral surface of the brain, and remove the brain.",
    "Use optimal cutting temperature (OCT) compound to freeze the brain in dry ice and methylbutane (approximately -55 °C). Store the brain tissue in a freezer.11, 12\nBrain Slicing\nOrient the tissue in a microtome, with the hindbrain facing down. Use a cryostat to slice the brain into 20 µm-thick sections.\nPlace the brain slices on microscope slides in a cryostat at -20 °C, with a 240 µm interval between each slice.\nPlace the microscope slides and five standard filter papers with graded radioactivity into exposure cassettes for 3 days at -20 °C. According to the sequence of the brain slices, arrange the microscope slides from top to bottom. Finally, place the filter papers in the bottom of the cassettes.12\nRemove the phosphor screen from the exposure cassettes, and use a variable-mode imager to read the phosphor screen and generate images to show [14C]-IAP uptake for the brain slices.\n3. Data Analysis\nAfter step 2.9.4, adjust the images using Statistical Parametric Mapping (SPM) and ImageJ software. Reconstruct all of the images using serial coronal sections. Smooth and normalize the images according to a reference rat brain model.12, 13\nFor quantitative assessments, measure the region-of-interest (ROI) of the brain images using ImageJ software to determine the pixel signal intensity, and use statistical software for the analysis.12, 13\nTo investigate the connections between different brain nuclei, use MATLAB correlation analysis software to display radioactivity ratio in an interregional correlation matrix, and visualize the matrices as color maps. Finally, use Pajek software for network analysis.12, 13",
    "Use 2 × 5 two-way mixed analysis of variance (ANOVA), with group and weeks as factors, to compare the duration of heat tolerance in the plantar test and mechanical force in the von Frey test in the sham and CPSP groups at baseline and weeks 1 - 5. Use a 2 × 31 two-way ANOVA to measure the radioactivity ratio according to group and brain area. When appropriate, conduct Tukey's Honestly Significant Difference (HSD) post hoc tests. Calculate Pearson correlation coefficients to assess correlations among all of the selected brain areas in the sham and CPSP groups.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}