{
  "id": 7130,
  "origin_website": "Bio",
  "title": "Tracing Nitrogen Metabolism in Mouse Tissues with Gas Chromatography-Mass Spectrometry ",
  "procedures": [
    "Figure 1 is an overview of the procedures in this protocol.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3925/bioprotoc-11-04-3925-g001.jpgFigure 1. The flow chart for this protocol. Animals are injected with the 15N tracer, and metabolites are extracted to analyze for 15N-labeled metabolites using GC MS.Tracer InjectionFreshly prepare 15NH4Cl in PBS (see Recipe 1).Weigh mice and calculate the volume for the injection.Intraperitoneal injection (IP) of 15NH4Cl at 167 mg/kg or the same volume of PBS.Tissue collectionMice were quickly sacrificed with cervical dislocation at different time points after injection. For example, 0 min, 5 min, 15 min, 30 min and 60 min.Note: Different metabolites can reach their peak enrichment at different time points depending on the tissue. Enucleate mouse eyes and isolate neural retina and the eyecups under dissecting microscope in cold HBSS. Store the neural retina in a pre-weighed 1.5 ml microtube and the eyecup in a pre-weighted 2 ml microtube. Weigh the tissues and snap-freeze in liquid nitrogen.Perform cardiac puncture to withdraw 100-300 µl blood using a syringe with a 26G needle. Gently dispense the blood to EDTA-containing tubes. Place the blood samples on ice. Centrifuge the blood at 1,008 × g for 10 min at 4 °C, transfer the supernatant into a new 1.5 ml tube, and store supernatant in -20 °C refrigerator.Quickly remove brain and liver tissue, store them in a pre-weighed 2 ml microtube and snap-freeze them in liquid nitrogen.Note: Take out the whole brain to avoid heterogeneity from different regions. Cut a small piece of liver tissue (~40 mg) from the same lobe with scissors. Metabolite ExtractionTissue metabolite extraction (Figure 2)imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3925/bioprotoc-11-04-3925-g002.jpgFigure 2. A schematic for metabolite extraction and derivatization. A. The brain, liver and eyecups were homogenized with an Omni THb Homogenizer, while the retina was homogenized with a pestle motor mixer.",
    "The homogenates were left on dry ice for 30 min and then centrifuged at 25,200 × g at 4 °C for 15 min. The supernatant was transferred to a glass insert containing 5 µl internal standard and dried with a speed vacuum. B. Add 10 µl of freshly prepared methoxyamine (20 mg/ml) into the dried samples in the insert and incubate for 90 min at 37 °C in a thermomixer, followed by a 30 min incubation at 70 °C after the addition of 30 µl of TBDMS. Transfer each insert into vials for GC MS analysis.Pre-chill extraction buffer (Recipe 2) on dry ice for 10 min.Transfer pre-chilled extraction buffer into tubes with tissues. Homogenize neural retina with a handheld pestle motor mixer in 140 µl extraction buffer for 15-20 s; Homogenize eyecup with an Omni THb Homogenizer in 200 µl extraction buffer for 15-20 s; Homogenize brain or liver tissues with the Omni THb Homogenizer for 20-30 s in extraction buffer (add 200 µl extraction buffer for every 5 mg tissues).Note: Change the disposable pestle for each sample. Clean the probe of Omni Thb homogenizer at least twice with clean water and wipes between samples to avoid cross-contamination. Leave the samples on dry ice for 30 min. Centrifuge the samples at 25,200 × g at 4 °C for 15 min.Filter the supernatants with a 0.2 µm syringe filter.Add 5 µl internal standard (Recipe 3) to each glass insert in 1.5 ml tube.Transfer the supernatant to each glass insert, open the tube lid to dry in a Speed vac in the cold room.Note: To ensure high sensitivity without overloading, transfer all the supernatant from retina or eyecup samples to dry and transfer 50 µl of brain or liver tissues to dry. Make sure the samples were fully dried.",
    "The moisture can affect the efficiency in derivatization and ionization. Plasma metabolite extractionMix 10 µl plasma sample with 40 µl pre-chilled extraction buffer.Leave the mixture on ice for 15 min.Centrifuge the samples and transfer 10 µl into inserts with internal standard as described in tissue metabolite extraction.Sample preparation (Figure2)Freshly prepare methoxyamine mix (Recipe 4) and add 10 µl to each insert with the dried sample inside a 1.5 ml microtube. Mix and close the lid, then incubate the tube at 37 °C and 300 RPM for 90 min in a thermomixer.Note: Gently tap the tubes with inserts inside 3-5 times to mix, spin the samples down and close the lid tightly. After incubation, quickly spin the tubes and add 30 µl TBDMS to each sample. Incubate at 70 °C for 30 min.Spin down the tubes and transfer each insert into GC MS glass vials.GC-MS AnalysisPre-run preparationInstall GC MS with DB-5 MS column and syringe needle.Set up a flow rate of helium gas at 1 ml/min.Fill the needle washing solvent vials A and B with hexane and methylene chloride respectively.Set up the GC oven temperature gradient as Table 1. The total run for each sample takes 31.5 min.Table 1. The parameters for GC oven temperatureimgsrc:https://en-cdn.bio-protocol.org/attached/image/20210218/20210218193420_2269.jpg Set up the parameters for GC MS scan range, speed, frequency, cycle time and step size as Table 2. Choose the solvent delay for 5.4 min.Table 2. The parameters for GC MS scan range and speeder parameters on GC-MS imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210218/20210218193439_1857.jpgSet up parameters for selection monitoring (SIM) mode as Table 3 for the ions of each metabolite that will be monitored.Table 3. List of ions for metabolites that are monitored under SIM mode imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210218/20210218193456_6462.jpgNote: Isotopologuesare named as M0, M1, M2.",
    "M0 is the mass without labeling, and 1 to 2 represents the mass shift from the isotope labeling. Set up injection volume as 1 µl of the sample in split-less mode.Save these parameters as “GC MS nitrogen method”.Tune GC MS with autotune to check mass accuracy and ensure no leakage in the system.Note: Air leakage and dirty source in the system can significantly decrease the sensitivity. It is critical to tune the system weekly with regular replacement of the air trap and source maintenance. Run samplePlace samples in the auto-sampler.Fill the sequence table for sample names and vial names. Select GC MS nitrogen method.Run samples with GC MS.Note: Check the instrument that it runs properly, especially for the long run. The typical instrument running failure includes an improperly filled sequence table, defective syringe needle and malfunctional filament. GC MS data processingSet up a quantitation method using Agilent MS Quantitation software based on Table 3.Click “File” in the software to set up a new batch.Select the quantitation method and extract the peak area for each selected ion.Export the peak area into an excel file.Nature abundance correctionNature abundance correctionInstall IsoCor for natural abundance correction softwareDownload IsoCor software at http://metasys.insa-toulouse.fr/software/isocor[href=http://metasys.insa-toulouse.fr/software/isocor]; Download Python 2.6+ (http://www.pythonxy.com[href=http://www.pythonxy.com]) and install modules: wxPython (v 2.8.11.0), NumPy( v1.6.0.2), SciPy( v0.9.0.1).Set up parameters for IsoCor softwareEdit “Metabolites. dat” file. Open the “Metabolites.dat” file under the IsoCor folder with Notepad and input metabolites and their elemental formula in Table 4. Save the file in the same folder.Table 4. List of metabolites and their elemental formula for natural abundance correction imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210218/20210218193524_6523.jpgEdit “Derivatives. dat” file. Using Notepad to edit this file and input the chemical derivatives with their elemental formulas as Table 5.",
    "Set up the input data file as Table 6 and copy the GC MS peak area (ion intensity) into this table. Save the file in the same folder.Table 5. List of chemical derivatives with their elemental formula imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210218/20210218193542_8083.jpgTBDMS1, 2 or 3 represents the number of TBDMS in the derivative metabolite.Data correctionSave the Excel Input data file (Table 6) as “xxx. txt.”Open IsoCor software and select Isotopic tracer as “N”.Select the purity of the tracer as (0.02; 0.98).Note: The purity is dependent on the tracer you are using. For example, the purity of 15NH4Cl is 98%. It is represented as (0.02; 0.98). Load the input data file using the “Load multiple means” button.Click on the “Process” button.Open a new Excel file and load Input data file_res.txt.Note: The output of the calculations is automatically saved in a .txt file as (Input File_res.txt) and (Input File_log.txt). Save them in the same folder.Table 7 is a representative output file after natural abundance correction. Table 6. Template of Input data file for IsoCorimgsrc:https://en-cdn.bio-protocol.org/attached/image/20210218/20210218193601_8731.jpg The intensity is representative data from the extracted peak area for specifically monitored ion."
  ],
  "subjectAreas": [
    "Biochemistry",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}