{
  "id": 1910,
  "origin_website": "Cell",
  "title": "Functional genetic dropout screens and in vivo validation of candidate therapeutic targets using mouse mammary tumoroids",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTransduction and selection of mouse mammary tumoroids\nTiming: 4 days\nIn this step viral transduction of tumoroids is carried out by spinoculation as previously described (Koo et al., 2012[href=https://www.wicell.org#bib6]). The same step should be followed for the screen library transduction (graphical abstract step 1A, required for carrying out functional genetic dropout screens and target identification) as well as for transduction of single constructs (graphical abstract step 1B, required for single gene modification and target validation in vivo).\nDissociate tumoroids into single cells as described in preparation steps 10 and 11 and count.\nNote: We advise to transduce between 0.25 million to 1 million cells per well. We advise using a multiplicity of transduction (MOI) of 0.3–1 for library transduction (A) and a MOI of 50–100 for single constructs (B). Troubleshooting 3[href=https://www.wicell.org#troubleshooting]. For screens, the number of cells to be transduced should be at least three times the coverage to compensate for possible cell death with antibiotic selection. Example of library transduction: for one screen using a library with a complexity of 2,000 sgRNA/shRNAs and carried out with a coverage of 1,000×, 6 million cells should be transduced per replicate.\nPellet the required number of cells by centrifuging at 1,000 × g for 5 min, discard supernatant and resuspend in virus suspension (concentrated virus in PBS plus ADDF6+ medium, supplemented with 8 μg/mL polybrene). The total volume of virus suspension should be between 250 and 1000 μL; the volume of concentrated virus should not be more than the volume of ADDF6+ medium.\nCritical: Spinoculation is carried out in 24-well suspension plates.\nTransfer cell suspensions to the 24-well suspension plate and centrifuge at 600 × g for 60 min at 25°C.",
    "After centrifugation, single cells should be at the bottom of the well. Incubate the plate at 37°C for 4–6 h.\nResuspend single cells in the supernatant and transfer cell suspensions into tubes. Centrifuge at 1,000 × g for 5 min.\nDiscard the supernatant, resuspend pellet in BME-ADDF6+ mix and seed as described in preparation steps 6 to 8 (Figure 1[href=https://www.wicell.org#fig1]B). Single cells transduced in one well can be seeded in one to three wells.\n24 h post transduction, add selection reagent (e.g., puromycin). Expand tumoroids without dissociation for the following step. For in vivo target validation (graphical abstract step 1B), target modification must be confirmed prior to experiment (e.g., western blot, PCR and/or sanger sequencing)\nNote: After transduction, dissociation of tumoroids using TrypLE should be avoided for the following few days (approx. 5 days) as tumoroids do not respond well to additional stress post transduction.\nSeeding of tumoroids for functional genetic dropout screen\nTiming: 15–21 days\nThis step follows screen library transduction as defined in transduction and selection of mouse mammary tumoroids[href=https://www.wicell.org#sec3.1] (graphical abstract step 1A) and describes how to seed tumoroids for a functional genetic dropout screen and how to keep them in culture throughout the assay. Screens using tumoroids should be carried out for 2–3 weeks, depending on the cycling time of the tumoroid line and drug used (for screens in the absence of drug treatment to study direct lethality, 2 weeks should suffice; in the presence of olaparib, three weeks is advised). For functional genetic dropout screens using drug treatment as negative selection, we suggest a coverage of 500× to 1,000× due to increased variability across replicates.",
    "Here, we use the PARPi olaparib as treatment. Olaparib concentration should be titrated in order to find a drug concentration where resistant cells remain alive (IC50–IC100) while responsive cells do not survive (IC0–IC20). Competition assays where both resistant and responsive lines are cultured together under drug selection conditions can help identify optimal drug concentration in a screen setting. The effect of frequent dissociation on tumoroid proliferation and drug sensitivity should be accounted for.\nAfter transduction of tumoroids with the screen library, make sure there are enough cells for the different conditions and replicates. Expansion of tumoroids for 1 to 3 passages is usually required.\nNote: Example of number of cells required before seeding the screen: for one screen using a library with a complexity of 2,000 sgRNA/shRNAs, carried out with a coverage of 1,000× and with two different treatment conditions (untreated and treated), one should make sure to have at least 6 million cells per replicate (2 million for untreated condition, 2 million for treated condition and 2 million for Day 0 control (T0)).\nDissociate tumoroids into single cells as described in preparation steps 10 and 11 and count cells.\nCollect cells equivalent to coverage for a Day 0 control (T0) and freeze pellet.\nSeed tumoroids for screen.\nPellet cells by spinning down at 1,000 × g for 5 min.\nSeed and culture tumoroids as described in preparation steps 6 to 8. The same number of single cells should be present in each 40 μL BME-ADDF6+ droplets. Untreated and olaparib treated tumoroids should be seeded at equal densities.\nAdd olaparib to the medium on the same day of seeding.",
    "Optional: Olaparib treatment can start at later time points if required (e.g., to look for effects in formed tumoroids, treatment combinations), however this can increase the drug concentration required to sensitize tumoroids.\nEvery 5 days, dissociate tumoroids into single cells and re-seed as in step 11. Olaparib treatment should be maintained across the entirety of the screen.\nAt the end of the screen, collect all tumoroids, dissociate into single cells, count (maintain screen coverage) and pellet. Take along T0 pellets collected in step 10 and proceed to genomic extraction (step 25). Optionally, screen pellets can also be frozen before proceeding to step 14.\nCritical: Dissociation of tumoroids before genomic extraction (as well as for RNA and protein extraction) is critical for optimal lysis.\nNote: The number of cells per matrix droplet depends on the tumoroid line. The number of cells seeded should allow tumoroids to grow for 5 days without getting overconfluent. We suggest between 50,000 and 200,000 cells per well. Example of seeding conditions: for one screen using a library with a complexity of 2,000 sgRNA/shRNAs and carried out with a coverage of 1,000×, 2 million cells should be seeded per replicate per condition (50,000 cells/well results into forty wells and corresponds to two 24-well plates), 2 million cells should be collected at T0 and 2 million cells should be collected at the end of the screen per replicate per condition.\nSequencing and analysis of screen\nTiming: 3–4 weeks\nIn this step, genomic DNA extraction, library preparation (two-step PCR (Xu et al., 2015[href=https://www.wicell.org#bib11])) and sequencing, and screen analysis are outlined.",
    "Proceed to genomic extraction of all samples, including the T0 controls, using the Gentra Puregene Cell Kit according to the manufacturer’s protocol: https://www.qiagen.com/us/products/discovery-and-translational-research/dna-rna-purification/dna-purification/genomic-dna/gentra-puregene-kits/[href=https://www.qiagen.com/us/products/discovery-and-translational-research/dna-rna-purification/dna-purification/genomic-dna/gentra-puregene-kits/]. The protocol is optimized for genomic extraction of 1–2 million or 10–20 million cells. Depending on the size of the screen, different approaches may be followed.\nCritical: Resuspend/vortex cell pellet in the leftover medium supernatant before proceeding to cell lysis. If cell clumps are present after adding cell lysis solution (occurs when pellet was not well resuspended prior to addition of cell lysis buffer), samples can be incubated for 6–16 h at 37°C. Pre-cooling of precipitation buffer to 4°C can improve precipitation. Incubation at 65°C with hydration solution is critical when pellets are very big.\nAfter genomic extraction, prepare the library for next generation sequencing (NGS). The steps below were designed for NGS using the Illumina HiSeq 2500. Primers that amplify the sgRNA/shRNA target region with Illumina adaptor sequences for NGS are listed in the key resources table[href=https://www.wicell.org#key-resources-table].\nNote: Other NGS machines can be used, however the library preparation protocol may differ.\nPCR1 reaction mix should be prepared as described in the Phusion™ High-Fidelity DNA Polymerase (2 U/μL) manufacturer's protocol https://www.thermofisher.com/order/catalog/product/F530L#/F530L[href=https://www.thermofisher.com/order/catalog/product/F530L#/F530L], and the table below. Different barcodes can be used for PCR1 forward primers in order to label different samples. The PCR1 reverse primer sequence varies depending on the library backbone. The amount of PCR1 reactions should be according to the coverage of the screen and assumes that 1 million cells is equivalent to 6 μg of genomic DNA.",
    "Note: Example of the amount of PCR1 reactions required to maintain a coverage of 1,000× in a screen using a library with a complexity of 2,000 sg/shRNAs: DNA corresponding to 2 million cells should be used for PCR1 reaction (2 million cells correspond to 12 μg of genomic DNA; for PCR1 one reaction should contain 1 μg of DNA template which results in 12 reactions per sample).\ntable:files/protocols_protocol_1390_3.csv\ntable:files/protocols_protocol_1390_4.csv\nAfter PCR1 is complete, pool all the products from one barcode. Check PCR1 product by running 10 μL on agarose gel. A smeared band should appear around the expected PCR product size (approx. 300 bp).\nPrepare PCR2 reaction as described in step a. Add 2.5 μL of the pooled PCR1 per PCR2 reaction. Carry out 1 to 2 reactions of PCR2 per barcode. Different barcodes can also be used in PCR2 reverse primer to increase complexity of labeled samples.\nNote: Barcodes represent a sequence of six-nucleotide barcodes (e.g. CGTGAT, ACATCG, etc). PCR1 barcode is read as the forward read while PCR2 barcode reads as the illumina indexing read.\nPool PCR2 products of one barcode. Check 10 μL of PCR2 by agarose gel electrophoresis. A clear band should appear at the expected PCR product size (approx. 300 bp).\nPurify PCR2 products using MiniElute PCR Cleanup according to the manufacturer’s protocol https://www.qiagen.com/us/products/discovery-and-translational-research/dna-rna-purification/dna-purification/dna-clean-up/minelute-pcr-purification-kit/[href=https://www.qiagen.com/us/products/discovery-and-translational-research/dna-rna-purification/dna-purification/dna-clean-up/minelute-pcr-purification-kit/], with one exception - do not add pH indicator to buffer PB, it may affect sequencing. Purify products with the same barcodes separately and elute each in 10 μL molecular grade nuclease-free water.\nPool all samples before deep sequencing at the equivalent molarity. Molarity can be checked using the Agilent DNA 7500 Kit in Bioanalyzer 2100. This procedure allows to measure molarity corresponding to PCR products of the right size.\nDeep sequence with Illumina HiSeq 2500.",
    "Analyze screen using MAGeCK (Li et al., 2014[href=https://www.wicell.org#bib7]).\nFor hit selection one should filter using the following thresholds:\nFalse discovery rate (FDR ≤ 0.1; FDR ≤ 0.25).\nAggregated fold change (median/mean log2Fc ≤ −1).\nIn vivo validation of target\nTiming: 4 days\nThis step follows target modification as defined in transduction and selection of mouse mammary tumoroids[href=https://www.wicell.org#sec3.1] (graphical abstract step 1B) and describes preparation of tumoroid samples for orthotopic transplantation and in vivo treatment. Note, all animal experiments need to be performed in accordance with a protocol approved by the Institutional Animal Care and Use Committee.\nAfter target modification and validation, dissociate tumoroids into single cells as described in preparation steps 10 and 11 and count the cells. Troubleshooting 4[href=https://www.wicell.org#troubleshooting].\nPellet the required cell number by centrifuging at 1,000 × g for 5 min, discard supernatant and resuspend in 1:1 BME/ADDF6+ (40–50 μL per mammary gland/sample). Per gland, the number of tumoroid cells can vary between 20,000 and 500,000 depending on the tumoroid line (e.g., for tumor latencies of 2–3 weeks: ORG-KB1P4N.1, 40,000 cells; ORG-KB1P4R.1, 10,000 cells; ORG-KPM1, 500,000 cells).\nProceed to orthotopic transplantations (Figure 2[href=https://www.wicell.org#fig2]).\nMake a small incision (approx. 0.5 cm) just below the nipple using iris scissors.\nInject cells into the mammary gland fat pad. Avoid the lymph node while injecting.\nSuture the skin, place the mouse back in its cage, and monitor recovery until it is completely awake.\nOptional: Different protocols for intramammary injections can be followed. With our protocol, we use isoflurane (3% (start) → 2%) as anesthesia and rimadyl (0.26 mL in 200 mL of drinking water) for analgesia.",
    "Critical: Tumoroid lines derived from KB1P(M) and KP(M) mice can be transplanted into isogenic FVB mice, while tumoroids derived from KB2P mice should be transplanted into (FVB/N X 129/Ola)F1 mice (Duarte et al., 2018[href=https://www.wicell.org#bib4]). All tumoroids lines can be transplanted into immunodeficient mice. Transplantation of tumoroids modified with Cas9 should be carried out in immunodeficient or Cas9-tolerant mice to avoid immunogenic rejection of the graft.\nInitiate treatment upon tumor outgrowth (75 mm3). Troubleshooting 5[href=https://www.wicell.org#troubleshooting].\nMammary tumor size can be determined by caliper measurements, and tumor volume can be calculated by the following formula: 0.5 × length × width2.\nVehicle (20% (2-Hydroxypropyl)-β-cyclodextrin) and olaparib (100 mg/kg) treatment is carried out for 28 consecutive days. This is done via intraperitoneal injection (5 mg/mL stock solution → 20 μL/g injected; max. 1 mL/mouse).\nPre-heat the treatment substances to body temperature before injecting.\nInject gradually on the left side of the median, towards the groin area and between the fourth and third nipple.\nInsert the needle maximally 0.5 cm, with a 45° angle and the bevel of the needle facing up.\nRemove the needle gradually and put the mouse back in the cage.\nNote: The site of injection can be alternated to avoid irritation from consecutive injections in the same site. Macroscopically, we do not observe irritation or swelling, although microscopic examination occasionally reveals skin irritation.\nNote: While a cycle of 28 days is standard for olaparib treatment, 56 days can also be used in order to observe a better window between the different lines. For hypersensitization experiments (increase response in already responsive lines/combination experiments), 50 mg/kg olaparib may be ideal (Paes Dias et al., 2021b[href=https://www.wicell.org#bib10]).\nSacrifice animals with CO2 when the tumor volume reaches 1500 mm3.",
    "Optional: Sterile collection and cryopreservation of multiple tumor pieces can be carried out for future engrafting experiments. Fresh tumor samples can be preserved by snap-freezing them in tubes on dry ice (possibly mixed with methanol) for DNA, RNA or protein extraction, by freezing them in OCT for the generation of cryosections, or by fixing them for 24 h in 4% formaldehyde solution in PBS (wt/vol) for the generation of formalin-fixed paraffin-embedded biobanking and (immuno-)histochemical stainings."
  ],
  "subjectAreas": [
    "Organoids",
    "Cancer",
    "Cell Biology",
    "Molecular Biology",
    "Sequencing",
    "Model Organisms",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}