{
  "id": 6436,
  "origin_website": "Bio",
  "title": "Delivering \"Chromatic Bacteria\" Fluorescent Protein Tags to Proteobacteria Using Conjugation",
  "procedures": [
    "An overview of the workflow is shown in Figure 1. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190327/20190327210020_8809.jpgFigure 1. Flowsheet of protocolPrepare or have ready media and stock solutions for the conjugation Prepare 2 lysogeny broth (LB) agar plates without antibiotics.Prepare 1 LB plate containing kanamycin when working with a pMRE1XX plasmid or 1 LB plate containing ampicillin and chloramphenicol when working with transposon bearing plasmids (Ampicillin will select for the plasmid and chloramphenicol for the transposon).Prepare 3 ml and 50 ml LB broth without antibiotics.Prepare 3 ml and 50 ml LB broth containing kanamycin when working with a pMRE1XX plasmid or 3 ml and 50 ml LB broth containing ampicillin and chloramphenicol when working with transposon bearing plasmids. Prepare ~10 minimal media plates containing succinate as the sole carbon source and antibiotics selecting for the plasmids or transposons as explained in Table 1. In case you are selecting for transposon insertions, do not include ampicillin, since it selects for the plasmid, not the transposon. Store at 4 °C and in the dark if the light-sensitive tetracycline is used in the plates.Note: Select a carbon source for minimal media plates that can be metabolized/utilized by the recipient strain. Prepare 100 ml sterile 1x PBS.Day 1 Streak donor strain E. coli S17-1 containing pMRE1XX, pMRE-Tn5-1XX, or pMRE-Tn7-1XX on LB agar plates containing appropriate antibiotics from a glycerol stock using a disposable loop and incubate overnight at 37 °C or 30 °C when working with pMRE-Tn7-1XX plasmids. Note: pMRE-Tn7-1XX plasmids do not replicate above 32 °C. Thus, to maintain it in the bacterial culture, it must be grown at lower temperatures. Streak recipient strain P. eucalypti 299R on an LB agar plate from a glycerol stock using a disposable loop and incubate overnight at 30 °C.",
    "Day 2 Inoculate 3 ml LB broth containing the same antibiotics as before with an individual colony of donor E. coli S17-1 containing pMRE1XX, pMRE-Tn5-1XX, or pMRE-Tn7-1XX using a sterile toothpick and ethanol flamed forceps. Incubate overnight at 200 rounds per minute (rpm) and 37 °C or 30 °C when working with pMRE-Tn7-1XX plasmids.Inoculate 3 ml LB broth without antibiotics with an individual colony of P. eucalypti 299R using a sterile toothpick and ethanol flamed forceps. Incubate overnight at 30 °C and 200 rpm.Day 3 Inoculate 50 ml LB broth in a 125 ml Erlenmeyer flask containing the same antibiotics as before with 500 µl overnight culture E. coli S17-1 containing pMRE1XX, pMRE-Tn5-1XX, or pMRE-Tn7-1XX using a sterile pipette tip and a P1000 pipette. Incubate at 200 rpm and 37 °C or 30 °C when working with pMRE-Tn7-1XX plasmids. Grow to an optical density at 600 nm (OD600nm) of ~0.5, which will take between 1.5 h and 3 h depending on the incubation temperature. Note: Measure OD600nm regularly using disposable cuvettes and a spectrophotometer and note down the final OD600nm. Inoculate 50 ml LB broth in a 125 ml Erlenmeyer flask containing no antibiotics with 500 µl overnight culture P. eucalypti 299R using a sterile pipette tip and a P1000 pipette. Incubate at 200 rpm and 30 °C. Grow until P. eucalypti 299R has reached late exponential/early stationary phase, which will take ~3-4 h (OD600nm of 0.7 or above). Measure OD600nm using disposable cuvettes and a spectrophotometer. Alternatively, recipient strain P. eucalypti 299R can be scraped off directly from the plate using a sterile disposable loop and resuspended in a 1.5 ml microcentrifuge tube containing 1 ml sterile 1x PBS by gentle vortexing. Note: P. eucalypti 299R is a fast growing strain with a similar growth rate to E.",
    "coli S17-1. For others, such as slow-growing strains, the inoculation volume or time of inoculation may vary accordingly. For other strains, growth rate, exponential growth phase and early/late stationary phase will have to be determined. Harvest 10 ml of both cultures by centrifugation at 2,000 x g for 5 min in a centrifuge. Discard the supernatants, resuspend each culture in 5 ml sterile 1x PBS by gentle vortexing and measure OD600nm.Note: Vortex gently for less than 5 s to avoid shearing of the donor which could impact conjugation efficiency. Mixing by inversion is also recommended. Mix the cultures to reach similar amounts of donor and recipient cells.Example: If the 10 ml E. coli S17-1 culture had an OD600nm of 0.5, it should be concentrated to OD600nm of 1. If the 10 ml P. eucalypti 299R culture had an OD600nm of 0.4, it should be concentrated to OD600nm of 0.8. The P. eucalypti 299R culture, therefore, contains only 80% of the cells that the E. coli S17-1 culture contains. Therefore, mix the 5 ml P. eucalypti 299R culture with 4 ml (80% of 5 ml) E. coli S17-1 culture. Note: For other strains, the number of CFU per OD600nm will have to be determined beforehand. Harvest the combined cultures by centrifugation at 2,000 x g for 5 min in a centrifuge, discard the supernatant and resuspend in 100 µl sterile 1x PBS using a vortex. Note: Vortex gently for less than 5 s to avoid shearing of donor pili which could impact conjugation efficiency. Mixing by inversion is also recommended. Dry an LB agar plate containing no antibiotics in a sterile bench for 15 min. In the sterile bench, dropspot the resuspended culture mix onto the agar using a sterile pipette tip and a 200 µl pipette.",
    "Keep the plate open and wait until all the liquid evaporates. Afterwards, close the plate and incubate overnight at 30 °C.Day 4 Harvest the culture drop using a wire loop and transfer to a 1.5 ml microcentrifuge tube containing 1 ml sterile 1x PBS. Resuspend the bacteria using a vortex. Plate 10 µl, 100 µl and the rest of the bacterial suspensions on the minimal media plates containing antibiotics selecting for the used plasmid or transposon using a disposable or flame-sterilized spreader. Minimal media will select against the auxotrophic E. coli donor.Incubate at 30 °C until visible colonies appear on the plates.Days 5-8 Note: Slow growing strains may appear weeks after the conjugation.Check morphology and fluorescence emission in emerging colonies. Fluorescence can often be seen using a transilluminator (e.g., UV or Blue light) that is also used for agarose gel electrophoresis (e.g., for most green, yellow, orange, and red emitting proteins see Figure 2). Otherwise, and additionally, it is useful to investigate emerging colonies with a fluorescent microscope equipped with a very low magnification and long working distance objectives. Use filters that have appropriate excitation and emission filters. Often colonies are made up of both, the donor and the recipient strain, for an example see Figure 3A. Select colonies that appear homogeneously fluorescent under the fluorescent microscope and streak them on minimal medium (as above) to individual colonies (Figure 3B). Note: A fun and beautiful example of a forced consortium. The recipient strain provides nutrients for the otherwise auxotroph E. coli and E. coli is providing antibiotic resistance to the recipient strain. Restreak the colonies at least three times using a disposable loop in the subsequent days on minimal media plates.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190327/20190327210159_2991.jpgFigure 2. Bacterial colonies expressing fluorescent proteins. A and B. Bacteria were streaked as crude streaks on agar plates.",
    "Expressed fluorescent proteins were visualized on a blue light gel reader. Green, yellow, orange, red and far-red fluorescent colonies were easily detectable on gel readers, blue and cyan fluorescent colonies were difficult to distinguish from non-fluorescent wild type colonies. C. Expressed fluorescent proteins were visualized using a UV light tray with attached gel documentation system. Fluorescent protein expressing colonies appear brighter than the wild type.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190327/20190327210243_9844.jpgFigure 3. Overlay of fluorescent and brightfield microscope channels. A. Example of unsuccessful conjugation that yielded colonies. The colonies are mixes of a Sphingomonas species and red fluorescent protein expressing E. coli S17-1. B. Clonal colony of P. eucalypti 299R::MRE-Tn7-145. Scale bars = 500 µm.Day 9, or after subsequent subcultivationsAt this stage, you will have to follow different procedures, depending on the delivery systems you choose:pMRE1XX plasmids As final check, perform PCRs to test for E. coli contamination. For that, perform a crude DNA extraction from a freshly grown individual colony by picking a part of the colony with an autoclaved toothpick and dislodging the cells in a 0.2 ml PCR tube filled with 100 µl 0.05 M NaOH. Boil the sample for 15 min at 95 °C in a PCR machine. Use 1 µl of crude DNA extract as template for a PCR using Phusion polymerase and primers FWD_uidA and REV_uidA following the recommendations of the manufacturer (for an example refer to Figure 4).Note: Presence of E. coli will yield a ~500 bp PCR product. To check for the presence of uidA in a bacterial strain, the sequence of the E. coli gene (https://www.ncbi.nlm.nih.gov/gene/946149[href=https://www.ncbi.nlm.nih.gov/gene/946149]) can be blasted against the genome of the target strain.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190327/20190327210405_1053.jpgFigure 4. Colony PCR of uidA for detection of Escherichia coli. uidA is an E. coli and Shigella sp.",
    "specific gene, thereby amplification of this gene fragment indicates mixed colony or false positive colony after restreak and colony isolation. Primers used were FWD_uidA and REV_uidA (Table 3) and yield a 500 bp product. Lane M: Molecular marker (HyperLadderTM, Bioline); Sample 1: P. eucalypti 299R::MRE-Tn5-145; Sample 2: E. coli (pMRE-Tn5-145); Sample 3: P. eucalypti 299R::MRE-Tn7-145; Sample 4: E. coli (pMRE-Tn7-145); C-: water control. In this example, samples #1 and #3 showed no detection of E. coli, while sample #2 and #4 showed presence of uidA.pMRE-Tn5-1XX–Tn5 transposon delivery plasmids Perform the E. coli contamination check as described above for pMRE1XX plasmids.Additionally, use primers FWD_Tn5_gt, REV_Tn5_gt, FWD_Tn5/7_gt, and REV_Tn5/7_gt in a multiplex PCR. The primer combination tests of the presence of the delivery plasmid and for the presence of the fluorescent protein coding sequence in the sample (for an example refer to Figure 5). Samples containing the plasmid will yield two bands (~700 bp and ~400 bp), which suggests E. coli contamination. Samples containing only the fluorescent protein coding sequence yield only the larger band (~700 bp).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190327/20190327210457_3139.jpgFigure 5. Colony PCR to confirm Tn5 insertions. Multiplex PCR result using primers FWD_Tn5_gt, REV_Tn5_gt, FWD_Tn5/7_gt, and REV_Tn5/7_gt. M: Molecular marker (HyperLadder, Bioline); Sample 1: P. eucalypti 299R::MRE-Tn5-145; Sample 2: E. coli (pMRE-Tn5-145); Sample 3: pMRE-Tn5-145; C-: water control.pMRE-Tn7-1XX–Tn7 transposon delivery plasmids Curing of plasmid (depending on the recipient strain)pMRE-Tn7-1XX plasmid series are conditional suicide plasmids in many, but not all, Enterobacteriaceae. P. eucalypti belongs to the Enterobacteriaceae, i.e., the plasmid is able to replicate in P. eucalypti since the plasmids origin of replication pSC101 is functional in the strain. pSC101 is however heat instable and does not replicate at temperatures above 32 °C (McKenzie and Craig, 2006). Therefore, to cure the strain from the plasmid, it has to be grown at high temperatures.",
    "Inoculate a 5 ml LB broth culture using an individual fluorescent colony and grow it overnight at 37 °C. Streak out the culture on an LB agar plate using an inoculation loop and incubate overnight at 37 °C. Select 10 individual colonies and streak them each onto a new LB agar plate containing Amp and on an LB agar plate containing no antibiotic. Colonies that still contain the plasmid will be able to grow on ampicillin, while colonies where the transposition occurred will only grow on the LB agar plate without antibiotics.Perform the E. coli contamination check as described above for pMRE1XX plasmids.Additionally, perform a PCR to identify the presence of Tn7 insertion and/or Tn7-derived plasmid. Use FWD_Tn5/7_gt and REV_Tn5/7_g for the presence of the fluorescent protein coding sequence in the sample (~700 bp) and primers Tn7_gt1, Tn7_gt2, and Tn7_gt3 for the presence of the delivery plasmid (~1,000 bp). Tn7_gt1, Tn7_gt2, and Tn7_gt3 are needed because pMRE-Tn7-1XX plasmids were constructed by blunt-end cloning, so the insert orientation may vary between plasmids (Tn7_gt2, and Tn7_gt3 anneal to a flanking sequence of the insert in the plasmid backbone). For an example refer to Figure 6.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190403/20190403195736_2722.jpgFigure 6. Colony PCRs to confirm Tn7 insertions. PCR result using primers FWD_Tn5/7_gt and REV_Tn5/7_gt for the amplification of Tn7-delivered insert (MRE-Tn7 insert), and PCR result using primers Tn7_gt1, Tn7_gt2, and Tn7_gt3 for amplification of a fragment of plasmid pMRE-Tn7 backbone (MRE-Tn7 backbone). M: Molecular marker. Sample 1: P. eucalypti 299R::MRE-Tn7-145; Lane 2: E. coli (pMRE-Tn7-145); Lane 3: pMRE-Tn7-145; C-: water control."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}