{
  "id": 10782,
  "origin_website": "Jove",
  "title": "Dissociation of the Confounding Influences of Expectancy and Integrative Difficulty Residing in Anomalous Sentences in Event-related Potential Studies",
  "procedures": [
    "The present protocol was approved by the Institutional Review Board of Tsinghua University.\n1. Stimuli construction\nConstruct critical anomalous sentences for the repetition and non-repetition groups\nPrepare an adequate number of correct sentences for the construction of anomalous sentences (no less than 40). For example, “These two components were separated by a centrifugal device.” Try to use only emotion-free sentences as much as possible.\nConstruct anomalous sentences based on the correct sentences and then allocate half to the repetition group and half to the non-repetition group.\n\t\t\nFor example, allocate the sentence “These two components were participled by a centrifugal device” to the repetition group and “These two components were semicoloned by a centrifugal device” to the non-repetition group. Ensure that the two groups of anomalous sentences are highly comparable in elements such as plausibility, violation type and length.\nMix all anomalous sentences with a group of normal sentences (i.e., sentences without integration difficulty) in a random manner to form a list of normal and anomalous sentences.\nInvite a group of native speakers (no less than 30 persons) to score the acceptability of the anomalous sentences using a 1–7-point scale, with a high value representing high acceptability.\nSelect enough pairs of appropriate anomalous sentences (no less than 35) for use as stimuli based on the acceptability scores. Anomalous sentences should be as low as possible in acceptability (e.g., with scores lower than 2). Ensure that the two anomalous sentence groups are not significantly different in the acceptability score (repeated measures analysis of variance is recommended).\nPrepare corresponding stimuli for these critical anomalous sentences for repetitions\nFor the repetition group, extract the core anomalous elements from the complete anomalous sentence to form a core structure for repetition (e.g., for studying the N400 effect, extract the core elements causing semantic incongruity).",
    "Ensure that only the most simplified core anomalous elements are kept (i.e., remove any information that is unrelated to elicitation of the effect to be studied). For example, extract only the semantically anomalous core structure “components were participled…” from the complete anomalous sentence “These two components were participled by a centrifugal device.”\nFor the non-repetition group, change the core structure so that it is different from the one extracted from the complete anomalous sentence, to prevent repetition of the anomalous core structure contained in the complete anomalous sentence (i.e., to prepare a different core structure for the use of repetition).\n\t\t\nFor example, after extracting the core structure “components were semicoloned…”from the critical anomalous sentence “These two components were semicoloned by a centrifugal device” in the non-repetition group, replace the keyword “semicoloned” in the extracted core structure with another word such as “differenced” (i.e., use “components were differenced…” instead of “components were semicoloned…” for repetition with the non-repetition group).\n(Optional minor modifications) Make minor modifications to the extracted core structure (e.g., tense or singular/plural forms), but ensure that the new one can still elicit the same effect as the corresponding complete anomalous sentence.\n\t\t\nFor example, the past tense and the plural form in the anomalous core structure can be further changed to the present tense and the singular form: “component is participled…” instead of “components were participled.”",
    "NOTE: The minor modification step is optional. It is highly recommended that the extracted anomalous core structure to be used for repetition have the same form and order as the core structure in the anomalous complete sentence. The purpose of the minor modification is to prevent the participant from memorizing the core structure as an entire unit, so that the follow-up presentation of the anomalous complete sentence can better reinitiate the semantic integration. This protocol chooses to apply minor modification.\nConstruct a filler short expression for each of the extracted (and modified) core structures in both the repetition and non-repetition groups. For example, coin and introduce a correct but similar filler expression “component is mixed…” for the anomalous core structure “component is participled…” in the repetition group.\nSimilarly, coin and introduce another correct but similar filler expression “component is discovered…” for the anomalous core structure “component is differenced…” in the non-repetition group.\n\t\tNOTE: The filler short expressions are introduced for two purposes: (i) to balance the correctness of the anomalous core structures, and (ii) to serve as the baseline for observing possible elicited effects at different repetition stages (e.g., N400 effect at the first-time, the fifth-time or the tenth-time of repetition), because even the correct stimuli may be influenced by multiple repetitions.\ntable:\n﻿0,1,2\n(a) Example of semantically enriched complete anomalous sentences and their preceding core structures,(a) Example of semantically enriched complete anomalous sentences and their preceding core structures,(a) Example of semantically enriched complete anomalous sentences and their preceding core structures\n,Repeated Core Structure,Semantically Enriched Complete Sentence\nControl,,These two components were separated by a centrifugal device.\nRepetition Group,* Component is participled…,* These two components were participled by a centrifugal device.\nNon-repetition Group,* Component is differenced…,* These two components were semicoloned by a centrifugal device.",
    "(b) Example of the simplified core structures in the repetition part,(b) Example of the simplified core structures in the repetition part,(b) Example of the simplified core structures in the repetition part\n,Implausible Expressions,Plausible Expressions\nFor Repetition Group,* Component is participled…,Component is mixed…\nFor Non-repetition Group,* Component is differenced…,Component is discovered…\nTable 1: Examples of stimuli: Complete sentences and simplified core structures. The upper half of the table displays examples of complete sentences (in the control group, the repeated anomalous sentence group,and the unrepeated anomalous sentence group, respectively) in the complete sentence part and their corresponding anomalous core structures to be used in the repetition part; the lower half of the table displays the anomalous core structures and their plausible filler short expressions in the repetition part.\nConstruct filler sentences\nPrepare enough filler sentences to enrich the sentence type and to make sure that the normal and anomalous sentences are well-balanced in number.\nSelect a number of correct filler sentences from the filler sentences (based on the number of all critical anomalous sentences in the repetition group), and create a repetition part for each of the selected filler sentences in the same way as creating the repetition parts for the critical anomalous sentences: extract the core structure from each correct filler sentence and coin a corresponding short filler expression for this core structure.\n\t\tNOTE: A repetition part is introduced before each correct filler sentence to avoid exposure of the critical anomalous sentences (which also have a repetition part prior to them). After this step, there are two types of complete sentences: sentences with a preceding repetition part (including all critical sentences and the selected filler sentences preceded by a repetition part) and sentences without a preceding repetition part.\n2. Stimuli presentation\nPresentation of the repetition part",
    "Present the extracted core structure and its correct filler expression (see Table 1b) together for a specific number of times (e.g., seven times) in a random manner (see the repetition part in Figure 1).\nPresentation of the semantic reinitiating complete sentence\n\t\nPresent the complete anomalous sentence right after its corresponding repetition part (see Figure 1).\n\t\tNOTE: Different colors for the repetition part and the complete sentence (e.g., dark blue versus dark green) prove helpful for the participants to distinguish these two parts.\n(Optional modifications) If the researcher is concerned only about results of the complete sentence part, then the short expressions can be presented as an entire unit to save time.\nimgsrc://cloudfront.jove.com/files/ftp_upload/59436/59436fig1.jpg\nFigure 1: Schematic illustration of the stimulus presentation. The upper half of the figure displays the flowchart of presenting the repetition part and its corresponding follow-up complete anomalous sentence, the left side of the lower half displays the detailed manner of presenting each short expression, and the right side of the lower half displays the detailed manner of presenting each complete sentence. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/59436/59436fig1large.jpg]\nTask setting for the repetition part and the complete sentence part\n\t\nGive a task for each core structure in the repetition part to keep participants focused, for example, a plausibility judging task (or a similar task which requires the participants to respond differently to different core structures, e.g., judging whether an expression has previously been given).\nChoose task for the complete sentence part that are widely used in previous related studies (e.g., plausibility judging) so that the results can be compared with results of previous studies.\nOverall stimuli organization",
    "Present each repetition part (along with its corresponding subsequent complete sentence) only after an anomalous sentence, and present after a normal sentence another complete sentence (whether it is normal or anomalous) (see Figure 2).\n\t\tNOTE: This is useful in two ways: (i) providing the participant a reasonable explanation about why some sentences are preceded by a repetition part but others are not (e.g., a researcher may explain that only an incorrect sentence will be followed by a repetition part while a correct sentence will have the power to bypass the repetition part and jump directly to another complete sentence); (ii) making the experiment more interesting by avoiding monotony and thus helping the participant remain focused.\nimgsrc://cloudfront.jove.com/files/ftp_upload/59436/59436fig2.jpg\nFigure 2: The organization of stimuli in each block. This figure displays the overall flowchart of programming for all anomalous complete sentences (with their corresponding repetition parts) and the correct, complete filler sentences (without any preceding repetition part) in each block. This figure is adopted from Huang et al.14 with permission. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/59436/59436fig2large.jpg]\n3. Experiment preparation and electrophysiological recording\nRecruit native speakers with normal or corrected-to-normal vision and with the same handedness (the Edinburgh handedness test can be used to select the participants13). The participants should be free of neurological or psychiatric disorders, and should not be taking any medications affecting the central nervous system.\nEnsure that participants have no perm or hair dyeing history within two months before the test. Ensure a balanced number of male and female participants in the required age range.\nInform participants to have enough sleep and rest before the experiment. Ensure they are in a healthy state (with no cough, fever, headache, etc.) while participating in the experiment.",
    "After a participant arrives at the lab, introduce to the participant the equipment and materials that will be used in the experiment, the procedure of the experiment, the tasks and time cost of the experiment, and also the requirements (such as movement and eye blink restriction), in order to help the participant to have basic knowledge about the overall procedure and to eliminate unnecessary concerns.\nAsk the participant to fill in the Edinburgh Handedness Query Form if the participant has no further questions or worries about the experiment and agrees to participate in the experiment. Confirm that all participants have the same handedness.\nGive the informed consent form to the participant and ask the participant to read it carefully. Provide necessary explanations if the participant has questions about the content. After the participant understands and agrees to all the contents, ask the participant to sign the form at the designated place, and proceed to the next step.\nInstruct the participant to clean their head and dry hair properly in the laboratory. While waiting for the participant, keep all the experimental materials ready.\n\tNOTE: Preparation of experimental materials depends on requirements of the specific recording system.\nInvite the participant to sit comfortably in the chair of the chamber where the experiment will be conducted.\nClean the participant’s skin for corresponding electrode(s) on the forehead (e.g., for the electrodes Fpz, Fp1, Fp2, Af7, Af8), under the left eye (e.g., for the vertical electrooculography [VEOG] electrode), near the outer canthus of the right eye (e.g., for the horizontal electrooculography [HEOG] electrode), and around the left and right mastoid bone (e.g., for the electrodes of Tp9 and Tp10, which will be used as new references offline) with facial scrub and cotton swab.",
    "Scrub the skin gently and do not make the participant feel uncomfortable, but also ensure that the dead skin cells and other substances such as cosmetics are removed.\n\t\tNOTE: The distribution of the electrodes might be different depending on the caps used. Please follow the distribution of the electrodes on the cap in use or the guidance of the international 10-20 system of electrode placement to find corresponding locations in the abovementioned areas for skin cleaning.\nPlace the elastic cap with electrodes on the participant's head. Ensure that the electrode Cz on the cap is located at the vertex of the head and the cap has a left-right symmetry, with midline electrodes placed over the midline of the head.\n\tNOTE: If the electrodes are not fixed on a cap, follow the international 10-20 system of electrode placement on the scalp of the participant\nHave the electrode(s) recording eye movements placed well and fixed. Fill the two separate HEOG and VEOG electrodes with conductive gel, place them at the outer canthus of the right eye and below the left eye, respectively and fix using adhesive tape.\n\tNOTE: If the system does not require conductive gel, skip the gel-filling step.\nFasten the strap under the chin to prevent the adjacent electrodes from moving during the experiment. The strap should not be too tight or too loose. Connect the cap/electrodes to the recording system.\nReduce the impedance of all electrodes to a level below the widely applied impedance threshold for ERP studies (typically below 5 kΩ or 10 kΩ). This can be done as follows.\n\t\nSwitch the recording software to the impedance monitoring interface.\nStart with the Ground (GND) and Reference (Ref) electrodes.",
    "Pass the blunt tip needle of the syringe containing conductive gel through the eyelets of the electrodes and hairs until it reaches the skin of the scalp, push the syringe plunger to inject a small dose of the conducting gel onto the skin until the gel connects the metal circle on the electrode and the skin.\n\t\tNOTE: Be careful not to inject too much gel in case that superfluous gel connects adjacent electrodes); if the system does not require conductive gel, skip this step, but act according to the requirements of the system.\nCheck the real-time impedance level displayed in different colors on the monitor until the impedance decreases to below the threshold value.\n\t\tNOTE: If the impedance decreases very slowly, the process can be sped up by gently pressing the gel with a cotton swab (or the blunt needle tip) so that the gel can have better contact with the skin or by making circles with the cotton swab (or the syringe) without moving its tip on the scalp.\nAfter the Ground and Reference electrodes are prepared, treat the other electrodes with the same method.\n\t\tNOTE: Keep in mind that the impedance reduction process should never make the participant feel uncomfortable. It is helpful to start and maintain a conversation with the participant while preparing the electrodes.\nAsk the participant to get ready for the experiment. Tell the participant to relax but also try to avoid excessive eye blinks and body movements during the experiment.",
    "Inform the participant about the tasks in the repetition part (i.e., to judge the plausibility of the core structure upon seeing the cue “..” following each core structure) and tasks in the main sentence part (i.e., to judge the plausibility of the complete anomalous sentence upon seeing the cue “? ?” following each sentence), and ask the participant to respond accordingly in the experiment.\nBefore the experiment starts, inform the participant explicitly that an incorrect sentence will be followed by a repetition part and a correct sentence by another complete sentence (which may be correct or incorrect).\n\tNOTE: This helps to direct participants’ attention to the relationship between the repetition part and the sentence before it rather than the subsequent complete sentence.\nStart the stimuli presentation program and let the participant practice with the practicing section.\n\tNOTE: Ensure that all types of stimuli included in the experiment appear in this practice session.\nStart the formal experiment session and record the electrophysiological signals. Divide all the stimuli into different blocks so that the participant can take a break for about 10 min between each block.\nMonitor the recording system during recording. If any problem arises, pause the experiment and recording until the problem is solved properly.\nSave the recorded electrophysiological data and help the participant take off the cap. Instruct the participant to wash away the conductive gel on the skin and hair.\nProvide the participant with the reward and thank the participant for their participation.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}