{
  "id": 9297,
  "origin_website": "Jove",
  "title": "Isolation of CA1 Nuclear Enriched Fractions from Hippocampal Slices to Study Activity-dependent Nuclear Import of Synapto-nuclear Messenger Proteins",
  "procedures": [
    "1. Preparation of Acute Hippocampal Slices from Adult Rat Brain\nAnesthetize rats with isoflurane. CAUTION: Perform the procedure using a closed exicator, do not inhale isoflurane. Make sure that the animal is completely anesthetized.\nDecapitate the rat, quickly isolate the brain, and immerse it in precarbonated (95% O2 / 5% CO2 gas mixture) ice-cold Gey’s solution (composition in mM: 130 NaCl, 4.9 KCl, 1.5 CaCl2·2H2O, 0.3 MgSO4·2H2O, 11 MgCl2·6H2O, 0.23 KH2PO4, 0.8 Na2HPO4·7H2O, 5 Glucose·H2O, 25 HEPES, 22 NaHCO3, pH 7.32) for 30 min1,2,10,16.\nRemove the cerebellum and part of the entorhinal cortex. Separate the cortical hemispheres with a mid-sagittal cut, then place each hemisphere down on its medial surface. Thereafter make a 50-70° cut (50-70° transverse) along the dorsal edge of each hemisphere13,14.\nGlue each hemisphere with the freshly cut surface on the slicing platform of the sectioning system. The platform should be covered by precarbogenated ice-cold Gey’s solution.\nCut 350 μm 50-70° transverse slices from anterior to posterior side using a vibratome adjusted to minimize z-axis oscillation. The hippocampal formation, subicular and entorhinal cortices, as well as the cortices that are located dorsolateral to the hippocampus will be part of the slices used for experiments13,14.\nTransfer hippocampal slices to a U-shape and submerged type incubator and incubate for at least 2 hr at 32 °C with carbogenated artificial cerebrospinal fluid (ACSF containing in mM: 110 NaCl, 2.5 KCl, 2.5 CaCl2·2H2O, 1.5 MgSO4·2H2O, 1.24 KH2PO4, 10 Glucose·H2O, 27.4 NaHCO3, pH 7.3)1,2,10,16.\n2. Positioning of Electrodes, Baseline Recording, and Induction of LTP\nTransfer the hippocampal slice to a submerged type recording chamber mounted under a microscope. Perfuse (6-7 ml/min) with carbogenated ACSF for at least 30 min at 32 °C.\nPrepare glass capillary microelectrodes filled with ACSF (tip resistance is 3-5 MΩ).",
    "Place a glass microelectrodes filled with ACSF in the CA1 Schaffer-collateral fibers for stimulation and in the CA1 stratum radiatum for fEPSP recording1,2,10 (Figure 2). The distance between the electrodes should be about 300 μm.\nEvoke field Excitatory Postsynaptic Potentials (fEPSPs) by stimulation of Schaffer-collateral fibers with biphasic rectangular current pulses (200 msec/polarity) in a range of 3-4 V.\nPerform the maximum stimulation test by measuring the input-output relationship and define the stimulation strength as 40% of maximum fEPSP-slope values obtained and keep it constant throughout the experiment.\nBegin the baseline recording for at least 15 min after the maximum stimulation test. Measure the responses to test stimuli every minute throughout the experiment. Perform baseline recordings with low-frequency stimulation.\nRecord the baseline for at least 30 min.\nFor Late-LTP induction apply high-frequency 100 Hz tetanization consisting of three 1 sec stimulus trains at 100 Hz with a 5 min intertrain interval. To increase the field of stimulation within CA1 region 5 μM bicuculline can be washed in 2 min before tetanization and should be washed out immediately after last tetanization.\n3. Collection of Slices after Induction of LTP and Snap Freezing\nStop LTP recording 2 min or 30 min after three trains of tetanic stimulation inducing Late-LTP.\nRemove the electrodes and quickly transfer the slice onto a precold metal platform placed on dry ice. Repeat the procedure for a control slice kept in U-shaped incubator. CAUTION: Use gloves while working with dry ice.\nCollect each slice in a 1.5 ml tube and store at -80 °C.\n4. Isolation of Nuclear Enriched Fractions from the CA1 Region of the Hippocampus\nTake 1.5 ml Eppendorf tubes with the frozen slices from -80 °C and keep them on ice.",
    "Add 0.5 ml of fresh cold TBS buffer containing protease (PI) and phosphatase (PS) inhibitors, into the tube. Incubate for 2-3 min and transfer to a stereomicroscope. CAUTION: Use protective gloves and a lab coat while working with PI and PS.\nDissect the CA1 stratum pyramidale region of the hippocampus using two needles. Use one needle for holding the slice under the stereomicroscope and the second needle for cutting the CA1 area.\nCollect the dissected CA1 regions from 5 slices (for each group) into a new 1.5 ml tube containing 50 μl lysis buffer (1x hypotonic lysis buffer containing in mM: 10 HEPES, 1.5 MgCl2, 10 KCl, pH 7.9, with PI and PS). Note that this amount of material will be sufficient to run 2-3 immunoblots.\nHomogenize collected tissue by careful pipetting up and down. Use a 200 μl pipette. Incubate the lysate on ice for 5-7 min to allow the cells to swell.\nTake 2 μl of the lysate, drop on a microscopic slide, and visualize the swelling of the cells under a bright field microscope. With proper swelling of the cells the nuclei appear as round intact structures.\nCollect 20 μl of sample into a fresh 1.5 ml tube as ‘homogenate fraction’. Add 8 μl of denaturing 4x SDS sample buffer.\nCentrifuge the remaining lysates at 11,000 rpm for 1 min.\nCarefully collect the supernatant from the top (‘cytosolic fraction’), transfer into a new tube and add 20 μl of 4x sample buffer.\nResuspend the pellet in 60 μl of hypotonic buffer and add 20 μl of 4x sample buffer. This fraction is referred to as a ‘nuclear enriched fraction’.\nHomogenate, cytosolic, and nuclear enriched fractions can be stored at -20 °C or -80 °C for later immunoblotting.\n5. Semiquantitative Immunoblotting for Synapto-nuclear Proteins",
    "Defreeze the samples and boil them for 5 min at 95 °C.\nTake 5 µl from each fraction and determine the protein concentration by amido black test or BCA test.\nLoad equal amount of protein samples from homogenate, cytoplasmic and nuclear enriched fractions on SDS-PAGE. Samples from control and LTP slices should be placed on the same gel for direct comparison.\nPerform a standard western-blotting procedure (wet transfer is recommended).\nProbe the membranes with the antibody of choice. Subsequently the same blots (or same samples run in parallel) can be probed with a cytoplasmic marker - neuron specific enolase2 (NSE2) and nuclear marker - NeuN and a -actin antibody as a loading control.\n6. Data Analysis\nEfficiency of LTP induction can be analyzed by Clampfit software. The average slope of baseline recordings was compared with the slopes after tetanization using two-way ANOVA, p <0.05 was considered significantly different. The fEPSP slope values were depicted in diagrams as the mean ± S.E.M.\nFor quantification of immunoblots, scan either the autoradiographic film and analyze the integrated density of protein bands by ImageJ or fluorescence bands with a Licor system. Values of immunoreactive bands should be normalized for the loading and blotting control. For comparison of the control and LTP groups a nonparametrical Mann-Whitney U-Test might be used.\ntable:\n﻿0,1,2,3,4\nName of the buffer,Reagent,Concentration (mM),Amount,Comments/Description\nGey’s solution (pH: 7.3~7.4),NaCl,130,7.6 g,sterile filtration\n\"1,000 ml\",KCl,4.9,0.37 g,\n,CaCl2·2H2O,1.5,0.22 g,\n,MgSO4·2H2O,0.3,0.0739 g,\n,MgCl2·6H2O,11,2.24 g,\n,KH2PO4,0.23,0.0313 g,\n,Na2HPO4·7H2O,0.8,0.2145 g,\n,Glucose·H2O,5,0.9909 g,\n,HEPES,25,5.96 g,\n,NaHCO3,22,1.85 g,\nACSF (pH: 7.3~7.4),NaCl,110,6.428 g,sterile filtration\n\"1,000 ml\",KCl,2.5,0.1865 g,\n,CaCl2·2H2O,2.5,0.368 g,\n,MgSO4·2H2O,1.5,0.370 g,\n,KH2PO4,1.24,0.169 g,\n,Glucose·H2O,10,1.9817 g,\n,NaHCO3,27.4,2.3 g,\n1x Hypotonic buffer (pH: 7.9),HEPES,10,0.23 g,\n100 ml,MgCl2·6H2O,1.5,0.0304 g,\n,KCl,10,0.07455 g,\nTable 1. Buffers.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}