{
  "id": 6527,
  "origin_website": "Bio",
  "title": "Dynamic and Sequential Protein Reconstitution on Negatively Curved Membranes by Giant Vesicles Fusion",
  "procedures": [
    "Preparation of GUVs by PVA-assisted swelling, washing and nanorods incubationClean 18 x 18 mm glass slides by rinsing twice with ethanol and water. Dry them with Kimtech tissue. A separate slide is needed for each GUV population.Optional: Plasma-clean the glass slides for 5 min using air as plasma source. This facilitates PVA spreading and attachment. Warm up the PVA solution to ~55 °C and spread 120 µl of it on the glass slides. Drain the excess of PVA by leaning the side of the slide on Kimtech tissue. PVA can also be spin-coated on the slide at 90 x g. Incubate the slides at 60 °C for 50 min in oven. Cool down to room temperature before use.Prepare lipid mixes P and E (Recipes 1 and 2) in chloroform to a total final concentration of 1 mg/ml. For multiple fusion events with different proteins or lipids, prepare additional mixes.Clean the Hamilton syringe with chloroform thoroughly and spread 15 μl of each lipid mix on each corresponding slide using the side of the needle until the chloroform has completely evaporated and the slide appears dry.Position each slide into a separate 3.5 mm culture dish and remove the residual organic solvent using a vacuum pump.Note: For sensitive lipids such as PI(4,5)P2, 20 min in vacuum are sufficient to remove the residual organic detergent without compromising the integrity of the lipids. Dilute the protein(s) of interest in Buffer E (Recipe 4).Note: Take into account the potential effect of the storage buffer on the final osmolarity and salt concentration of Buffer E. Deposit 360 μl of Buffers P and E (Recipes 3 and 4) on the corresponding slides. Avoid overflowing of the buffer out of the slide.Incubate the slides for 30-60 min at the desired temperature to allow swelling.",
    "GUV growth can be easily visualized with a phase-contrast microscope.Collect 200 μl of GUVs form each slide, by tilting the dish and gently rinsing the slide by gentle pipetting. Transfer each GUVs preparation to a separate 1.5 ml centrifuge tube. Note: GUVs are very fragile. Pipetting should be as gentle as possible. Add 1.2 ml of Outer buffer (Recipe 5) to each tube; gently mix by inverting the tube several times.Centrifuge for 10 min at 100 x g. The GUVs will sink to the bottom. Transfer 20 μl of GUV from the bottom of the tube to a new 0.5 ml tube. Add 80 μl of Outer buffer and 0.8 μl of streptavidin-coated gold nanorods to the GUVs from the previous step. Mix gently by pipetting until the nanorods are uniformly suspended. Incubate for 20 min at room temperature. Note: The dilutions in Steps A11 and A13 lower the concentration of the protein present in Buffer E outside the GUVs and helps in removing lipid aggregates and small vesicles.Preparation of the experimental chamberPrepare the experimental chamber and micropipettes as previously described, also step-by-step by a movie (Prévost et al., 2017). At least three micropipettes are necessary to perform the experiment (Figure 3). While a precise pressure control is needed for R- and L-pipettes since each aspirates a GUV by connecting them to water reservoirs of controlled height (Kwok and Evans, 1981), the pressure of the T-pipette used to hold the microbead can be adjusted manually using a syringe. The tip diameter of the R- and L-pipette should be in the range 5-10 μm, while the T-pipette should have an opening < 3 μm. Position the tip of all three micropipettes at the center of the stage, within the field of view, ~100 μm above the bottom of the chamber.",
    "Passivate the chamber and pipettes by incubating with β-casein solution (Recipe 7) for 20 min. The volume of the chamber is ~200 μl. Remove the β-casein from the chamber, and rinse with Outer buffer. Fill the chamber with 170 μl of the buffer.Note: About 1 ml of β-casein solution is needed to fill both the chamber and the micropipettes. Carefully aspirate15 μl of each population of GUVs from the bottom of the Eppendorf tube and add them slowly to the chamber. Place the two populations on separate regions of the chamber (Figure 3).Add 2 μl of streptavidin-coated polystyrene beads (diameter ~3 μm) to the chamber to a final concentration of 0.1 x 10-3% (w/v). Place the beads in a separate region of the chamber, to avoid mixing with the GUVs (Figure 3).Keep the GUVs in the chamber for 20-30 min. During this time, the GUVs and the beads settle to the bottom of the chamber. Moreover, evaporation from buffer creates an osmotic gradient, which renders the GUVs “floppy” and allows their aspiration by the micropipettes.In order to prevent further evaporation during the experiment, seal the chamber with mineral oil.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190630/20190630204831_1050.jpgFigure 3. Schematic representing the arrangement of the experimental chamber including pipettes, GUVs and microbeads. L (left) and R (right) micropipettes hold both GUVs before fusion, whereas the T-pipette is used to firmly hold a micro-bead and pull the nanotube.GUVs fusion experiment (for movies depicting the fusion event, please see Supplementary data from De Franceschi et al., 2018):Lower the tip of the T-pipette to the bottom of the chamber. By moving the microscope stage, find a microbead and aspirate it strongly with the T-pipette. Lock the pressure by closing the valve on the tubing between pipette and syringe. Raise the tip of the T-pipette 100 μm from the bottom of the chamber.",
    "Set the R- and L-pipette aspiration pressure to zero. By moving the microscope stage, find a PI(4,5)P2-containing GUV and aspirate it with the R-pipette. Raise the GUV 100 μm above the bottom of the chamber.By moving the microscope stage, find a protein-containing GUV. Lower the L-pipette and aspirate the GUV. Raise this pipette 100 μm from the bottom of the chamber.Adjust the focus on the microbead held by the T-pipette. Release the pressure of the R-pipette to almost zero and bring it in contact with the bead. By moving the R-pipette with the micromanipulator away from the bead, pull a nanotube from the PI(4,5)P2-containing GUV. Adjust the height of the R-pipette so that both the microbeads and the nanotube are in focus.By using the micromanipulators, position laterally and vertically the R- and L-pipettes so that the infra-red laser is focused at the interface between both GUVs. Release the aspiration pressure of both R- and L-pipettes to nearly zero.Important: This is the most critical step, since fusion will occur only if the GUVs are placed correctly and if the aspiration pressure of both the R- and L-pipettes is nearly zero. Observing the GUVs by DIC rather than fluorescence, both during positioning and during fusion, greatly simplify this procedure (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190630/20190630221632_7480.jpgFigure 4. Positioning and fusion of GUVs. A. Fluorescent image of GUVs before and immediately after fusion. Lipid mixing is still not completed. The contrast in the image after fusion has been enhanced to show that fusion occurs without protein leaking outside the GUVs. Scale bar = 10 µm. B. DIC imaging of GUVs optimal position before fusion. The red dot indicates the position of the optical tweezers. Scale bar = 10 µm.Trigger fusion by turning on the infra-red laser. If the GUVs are aligned correctly, fusion is instantaneous.",
    "If fusion does not occur, switch off the laser and fine-tune the position of the GUVs by using the micromanipulators. Then repeat the process.Note: It is also possible to leave the laser on while adjusting the position of the pipettes. However, this occasionally induces strong adhesion between the two GUVs, which can inhibit fusion. Moreover, prolonged irradiation can cause membrane heating (due to nanorods absorption) and thus degradation of sensitive lipids such as PI(4,5)P2. After fusion, content mixing is almost instantaneous, while lipid mixing might require tens of seconds to be completed (Figure 4). This may cause fluctuations in membrane tension independently from the aspiration pressure of the pipettes. Wait 2-3 min until the tension stabilizes before performing any measurement. The focus may have to be readjusted in order to visualize the nanotube. There is no release of GUV content during or after fusion.Once membrane tension is stable, tube radius can be changed to study recruitment of proteins as a function of tube radius, as usually done with nanotube assays (Prévost et al., 2017)."
  ],
  "subjectAreas": [
    "Biophysics",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}