{
  "id": 7557,
  "origin_website": "Bio",
  "title": "Novel Protein Production Method Combining Native Expression in Human Cells with an Intein-based Affinity Purification and Self-cleavable Tag",
  "procedures": [
    "Preparation of plasmid DNADesign PCR primers to amplify the target gene for insertion into the multicloning site (MCS) of plasmid pJCX4 (Figure 1A). Include a 5’ overhang on each primer according to the design guide (Figure 1B).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4363/bioprotoc-12-06-4363-g001.jpgFigure 1. Instructions for cloning a target gene into vector pJCX4. (A) Schematic representation of the expression cassette of vector pJCX4 for mammalian cell expression, including a restriction enzyme map of the multicloning site for the insertion of a target gene. The recognition site of each restriction enzyme is highlighted in grey, and the digestion site is indicated by magenta lines. (B) Two examples of forward (5’) and reverse (3’) primer designs to amplify a target gene for insertion into vector pJCX4. The underlined sequence is the recognition site of the restriction enzyme. Note that the three bases preceding the recognition site are included to ensure efficient enzyme cleavage. In both 5’ primers, the Kozak consensus sequence GCCACC follows the restriction enzyme site. NNN NNN indicates the nucleotide sequence of the target gene. In the 3’ primers, the bases following the restriction enzyme site are required to ensure precise ligation with the intein. Do not include a stop codon in the annealing region of the 3’ primer.Mix the following components for the PCR reaction.50 μL of PCR reaction volume:25 μL of NEBNext 2× PCR master mix1 μL of target gene template DNA (1–10 ng DNA)2.5 μL of forward primer at 10 μM (final concentration = 0.5 μM)2.5 μL of reverse primer at 10 μM (final concentration = 0.5 μM)19 μL of ddH2OCarry out the PCR reaction in a thermocyclerInitial denaturation (30 s, 98°C)Denaturation (10 s, 98°C)Annealing (30 s, 52–65°C)Extension (25 s/kb, 72°C)Repeat steps b–d for 30 cycles.",
    "Final extension (2 min, 72°C)Run the PCR product on a 1% agarose gel with SYBR Safe, in a horizontal electrophoresis system at 80 V for 20 min.Extract the PCR product band from the gel and recover the DNA following the manufacturer’s protocol, using the NucleoSpin Gel and PCR cleanup kit. Elute the recovered PCR product in a volume of 25 μL.Digest the recovered PCR product with restriction enzymes corresponding to those included in the PCR primer overhang.30 μL of reaction volume:25 μL of recovered PCR product, about 1 μg of DNA1 μL of High-Fidelity enzyme 1 (incorporated on 5’ overhang of forward primer)1 μL of High-Fidelity enzyme 2 (incorporated on 5’ overhang of reverse primer)3 μL of 10× buffer (CutSmart buffer if using NEB High-Fidelity enzymes)Incubate in a water bath at 37°C for 1 h.Digest the plasmid pJCX4 with the same restriction enzymes incorporated on the primer overhangs of the PCR product.30 μL of reaction volume:variable volume of plasmid pJCX4 (1 μg of DNA)1 μL of High-Fidelity enzyme 11 μL of High-Fidelity enzyme 23 μL of 10× buffer (CutSmart buffer if using NEB High-Fidelity enzymes)ddH2O up to a total volume of 30 μLIncubate in a water bath at 37°C for 1 h.Run the digested plasmid on a 1% agarose gel with SYBR Safe at 80 V for 20 min. Extract the plasmid band from the gel and recover the DNA following the manufacturer’s protocol, using the NucleoSpin Gel and PCR cleanup kit. Elute the digested plasmid DNA in volume of 20 μL.Recover the digested PCR product following the manufacturer’s protocol, using the NucleoSpin Gel and PCR cleanup kit. Elute the digested plasmid DNA in a volume of 20 μL.Mix the following components for a ligation reaction, using a plasmid to insert ratio of 2:8.",
    "20 μL of reaction volume:10 μL of Quick Ligase 2× buffer8 μL of digested PCR product2 μL of digested plasmid1 μL of Quick Ligase enzymeIncubate in a water bath at 25°C for 10 min.Transform 5 μL of ligation mixture into XL-10 Gold competent cells, following the manufacturer’s protocol. Plate 200 μL of the transformation on an LB agar plate containing 50 µg/mL kanamycin and grow in an incubator at 37°C for 12–18 h.Scrape half of a single colony to inoculate a 5 mL culture of LB containing 50 µg/mL kanamycin and grow in an incubator with agitation (220 rpm) at 37°C for 12–18 h. Indicate on the plate the culture used for inoculation, and store the LB agar plate at 4°C.Isolate plasmid DNA from the culture using the NucleoSpin Plasmid miniprep kit, following the manufacturer’s protocol.Confirm the presence and location of the target gene in the plasmid by Sanger sequencing with CMV-for (forward) and Mxe-rev (reverse) sequencing primers. See Table 1 for primer sequences.Table 1. Primers used to verify the insertion of the target gene into the MCS of pJCX4 table:",
    "﻿0,1\nPrimer name,Primer sequence\nCMV-for,5’- CGCAAATGGGCGGTAGGCGTG\nMxe-rev,5’- GATTGCCATGCCGGTCAAGG",
    "From the LB agar plate, use the same colony that was sequence-verified to contain the target gene to inoculate a 100 mL culture of LB containing 50 µg/mL kanamycin.Isolate plasmid DNA from the culture using the PureLink HiPure Plasmid Filter Maxiprep Kit and a QIArack following the manufacturer’s protocol.Note: The miniprep and maxiprep kits are both used to isolate plasmid DNA from bacterial cultures. The maxiprep is used once the plasmid is sequence-verified, to produce large amounts of DNA needed for transfection of Expi293F cells. Expression in Expi293F CellsFollow the manufacturer’s protocol for the Expi293F Expression System Kit to thaw, establish, and culture cells. Grow the cells in Expi293F media and sterile vent-cap Erlenmeyer shaker flasks, on an orbital shaker (125 rpm) at 37°C using an incubator with a humidified atmosphere of 8% CO2. No antibiotic is required for selection.Prepare cultures for transfection at a density of 2.5 × 106 cells/mL in sterile vent-cap Erlenmeyer shaker flasks. We typically transfect a 250 mL-culture. Keep the cultures inside the incubator at 37°C with 8% CO2 to maximize their health.Aliquot 5 mL of Opti-MEM at 25°C into each of two 15-mL conical tubes under a sterile cabinet.Into one conical tube of Opti-MEM, add 1 µg of pure plasmid DNA from the maxiprep for each 1 mL of Expi293F culture to transfect.Into the other conical tube of Opti-MEM, add 3 µL of 1 mg/mL polyethylenimine (PEI) for each 1 mL of Expi293F culture to transfect.Incubate the DNA and PEI mixtures separately for 5 min at 25°C under the sterile cabinet, then combine both mixtures into one 15-mL conical tube and incubate for another 25 min.",
    "Briefly transfer the Expi293F culture under the cabinet to add the DNA and PEI mixture, then return it to the incubator to grow for 48 to 72 h, as was optimized for each protein. To optimize the growth time, perform small-scale purifications or Western blot to verify protein expression levels at various times post-transfection (Figute 2).Harvest the cells by centrifugation at 4,000 × g and 4°C for 10 min. To wash residual media, resuspend the cell pellet in 10 mL of PBS at 4°C using a serological pipette, transfer to a 50-mL conical tube, then pellet the cells again by centrifugation. Store at -80°C until purification.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4363/bioprotoc-12-06-4363-g002.jpgFigure 2. Schematic of Expi293F transfection. Pure plasmid DNA and polyethylenimine (PEI) are incubated separately in Opti-MEM media for 5 min, then combined and incubated an additional 25 min. The DNA and PEI mixture is poured into an Expi293F culture at a density of 2.5 × 106 cells/mL and the culture is grown for 48 to 72 h after transfection.Purification of the intein-tagged proteinPrepare fresh lysis buffer (see Recipes) the day of purification and store at 4°C.Prepare a Flex-Column with chitin affinity resin, by pipetting ~15 mL of the manufacturer’s resin mixture into the column, then packing the resin at the bottom by allowing the storage solution to drain through. The packed resin volume should be 7–10 mL.Equilibrate the chitin affinity column by flowing 10 column volumes of lysis buffer through. For this and all subsequent steps, either flow by gravity or by peristaltic pump at a rate of 1 mL/min.Thaw the conical tube containing the pellet of transfected Expi293F cells in a water bath at 25°C.Resuspend the cells in a volume of lysis buffer equal to two times the volume of the cell pellet, by pipetting up and down using a serological pipette.",
    "Lyse the cells with 20 strokes of a Dounce glass piston homogenizer, using a tight-fitting piston. Avoid introducing bubbles while using the homogenizer to lyse the cells.Transfer the lysate to centrifuge tubes, and clarify by centrifugation at 20,000 × g and 4°C for 20 min.Load the clarified lysate onto the equilibrated chitin affinity column.Wash the column with 20 column volumes of lysis buffer.Wash the column with 10 column volumes of ATP wash buffer (see Recipes). ATP helps to remove unwanted chaperone proteins bound to the target protein.Remove excess buffer from the resin, then add an amount of intein cleavage buffer (see Recipes) equal to two times the volume of the resin. Gently stir the resin to evenly distribute the cleavage buffer.Incubate the resin in intein cleavage buffer at 25°C for 24 h.Elute the cleaved target protein by draining the liquid from the chitin column. Protein storage will depend on the stability of each protein. Generally, proteins can be stored for several days on ice or long-term in a -80°C freezer.ExampleThe procedure described here has been used for the expression-purification of several proteins in our laboratory. One example is tropomyosin (Tpm), a parallel coiled-coil protein that binds symmetrically on each side of the actin filament, forming a long rope-like polymer of head-to-tail interacting Tpm molecules. The head-to-tail interaction of Tpm depends on the integrity of both its N- and C-terminal ends, as well as native N-terminal acetylation (Heald and Hitchcock-DeGregori, 1988;        Maytum et al., 2000;        Palm et al., 2003), and it is also affected by other forms of PTMs, such as phosphorylation (Rao et al., 2009;        Lehman et al., 2015;        Palani et al., 2019;        Rajan et al., 2019).",
    "Numerous biochemical studies on Tpm had relied on proteins expressed in bacteria that used N-terminal acetylation mimics which, as we have shown (Carman et al., 2021), do not accurately account for the native PTMs of some Tpm isoforms. The expression system described here allowed us to obtain fully native Tpm proteins for the first time, free of extra amino acids from tags, and featuring native PTMs, such as N-terminal acetylation (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4363/bioprotoc-12-06-4363-g003.jpgFigure 3. SDS-PAGE analysis Tpm3.1 obtained using the method described here. ConsiderationsIf the target protein cannot tolerate incubation at 25°C, intein self-cleavage may be performed at 4°C; however, to achieve full cleavage, the incubation time will likely be longer (48 to 72 h). While we have had success using this method to obtain proteins featuring disulfide bonds, such as nanobodies, the reducing agent needed to trigger intein cleavage may make this method unsuitable for some disulfide bond-containing proteins."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}