{
  "id": 18292,
  "origin_website": "Jove",
  "title": "Laparoscopic Technique for Serial Collection of Liver and Mesenteric Lymph Nodes in Macaques",
  "procedures": [
    "Animals were housed and cared for in Association for the Assessment and Accreditation of Laboratory Animal Care international (AAALACi) accredited facilities, and all animal procedures were performed according to protocols approved by the Institutional Animal Care and Use Committee (IACUC) of University of Washington and Washington National Primate Research Center.\n1. Surgical Preparation, Anesthesia, and Analgesia\nSedation and Induction\n\t\nSedate the macaque with an intramuscular injection of 10 mg/kg ketamine and 0.015 mg/kg dexmedetomidine (combined in one syringe). Ensure absence of withdrawal reflexes prior to removal from the cage.\nIntubate the animal, and maintain the animal in a plane of general anesthesia using isoflurane (1.0 - 2.5%) and 100% oxygen. See references for further information regarding intubation and general anesthesia in macaques17,18,19.\nAnesthesia Support and Monitoring\n\t\nInsert a peripheral venous catheter and provide intravenous isotonic fluids (such as Lactated Ringers Solution) at a rate of 5 mL/kg/h throughout anesthesia and surgery. Apply sterile eye lubricant to prevent corneal dryness.\nProvide analgesia, such as a sustained release formulation of buprenorphine (0.2 mg/kg, subcutaneously).\n\t\tNOTE: An NSAID (such as meloxicam or ketoprofen) may also be provided during anesthetic recovery, provided that the experimental protocol permits NSAID administration and that animal is normotensive and well-hydrated during anesthesia.\nMonitor anesthetic depth (e.g. jaw tone), heart rate, respiration rate, EKG, blood pressure, pulse oxygenation, end tidal CO2, and body temperature throughout anesthesia and surgery.\n\t\tNOTE: When the abdomen is insufflated, the animal may hypoventilate. Provide mechanical ventilation if respiration rate decreases, or the end tidal CO2 levels is above 45 mmHg.\nFollowing surgery, administer atipamezole (0.15 mg/kg, intramuscularly) for dexmedetomidine reversal.\nSurgical Preparation\n\t\nPerform multiple warm water enemas to reduce the volume of feces in the colon to aid visualization and intestinal manipulation during the procedure20.",
    "Use clippers with a number 40 blade to remove hair from the surgical field. Shave from the costal ridge to the pubis and from the left to right flank.\nAseptically prepare the surgical field using appropriate antiseptics, such as alternating chlorhexidine-alcohol or povidone-iodine-alcohol scrubs.\nPosition the animal on the operating table on its dorsum, at an angle halfway between dorsal and right lateral recumbency. Tie the arms and legs with rope in an extended position. Provide a final chlorhexidine and alcohol prep once the animal moves to the operating room and is positioned for surgery.\n2. Surgery\nNote: For further information of laparoscopy in small animals, see reference21.\nLaparoscopic Instrument Preparation\n\t\nDrape the animal with a sterile fenestrated drape.\nWith the help of a non-sterile assistant, wrap the digital camera with the sterile camera drape and attach the cable to the tower. Attach the rigid scope to the camera head.\nAttach the sterile light cable to the rigid scope and connect the cable to the light source. White balance the camera according to the manufacturer's instructions.\nAttach the sterile insufflator tubing to the insufflator.\nLaparoscopic Entry\n\t\nUsing a #15 scalpel, make a ~ 5 mm stab incision through the skin to the depth of the abdominal musculature, approximately 1 - 2 cm to the left of the umbilicus.\nUsing the non-dominant hand, lift up the abdominal wall cranial to the site of the stab incision. With the dominant hand, place the tip of the Veress needle through the incision and angle the tip cranially.",
    "NOTE: The penetration angle of the Veress needle will vary based on the body condition of the animal. For instance, in a fat animal, the Veress needle will need to be inserted nearly perpendicular to the abdominal wall. In a thin animal, the Veress needle should be angled cranially to reduce risk of contacting the viscera.\n\t\t\nHolding the shaft (not the hub) of the Veress needle, firmly push the needle to penetrate the abdominal wall into the abdominal cavity. A distinct \"click\" and decrease in resistance will be felt as the sharp tip penetrates the peritoneum and the blunt tip of the Veress needle springs forward into the abdominal cavity.\n\t\t\tNOTE: If the needle passes appropriately into the abdominal cavity, there will be little resistance when it is advanced and withdrawn 1 - 2 cm.\nConnect the CO2 insufflator tubing to the needle and open the stopcock. Pressurize the abdomen to no more than 10-12 mmHg to create a pneumoperitoneum.\n\t\tNOTE: The abdomen has achieved ideal insufflation when it has expanded symmetrically and there is a loss of the normal sharp contour of the costal margins. The pressure should provide adequate space for insertion of the cannula/trocar without risk of contacting the viscera.\nCannula Placement\n\t\nOnce the abdomen is fully insufflated, make a ~ 5 - 7 mm incision with a #15 scalpel blade through the skin of the left cranial abdomen to the abdominal musculature ~ 2 - 4 cm caudal to the last rib.",
    "Place a 5 mm trocar-cannula assembly through the skin incision and angle it ~ 45 - 60 degrees caudomedially. Penetrate the abdominal cavity to a depth of 1-2 cm. Screw the threaded cannula into the abdomen by rotating the cannula (~ 0.5 - 1 cm further) to a depth of 1.5 - 3 cm, and remove the trocar.\nRemove the insufflator tubing from the Veress needle, turn off the stopcock, and remove the needle. Connect the insufflator tubing to the cannula and open the stopcock to maintain a pneumoperitoneum at no more than 10 - 12 mmHg.\nInsert the rigid scope through the cannula and into the abdominal cavity.\nUnder camera visualization, continue to make a small incision with a #15 scalpel blade through the abdominal musculature and peritoneum at the previous skin incision used for Veress needle insertion. The camera is used to visualize the abdominal side of the incision to avoid vessels and minimize bleeding.\n\t\tNOTE: Ensure the incision through the muscle and peritoneum is large enough to facilitate entry of the probe and exteriorization of the mesentery (~ 0.5 cm). A larger incision may be required to exteriorize mesentery in animals with excessive mesenteric fat.\nPlace the animal in the Trendelenburg position21 with the feet elevated at approximately 15 - 30 degrees above the head. This is optional but may allow easier access to mesenteric lymph nodes of the colon, as the small intestinal tract will move to a more cranial position.\nMesenteric Lymph Node Biopsy\n\t\nUnder camera visualization, insert a solid probe through the abdominal incision made in step 2.3.5.",
    "Place the probe between the omentum and bowel and use a sweeping motion to gently sweep the omentum off the bowel to allow visualization of the underlying mesentery. Continuing to use the sweeping motion from the caudal to cranial abdomen. The omentum can be placed in the right cranial abdomen so it is out of the operative field.\nUse the probe to move the descending colon towards the left or right abdominal wall. This will allow better visualization of the mesentery to aid in the search for mesenteric lymph nodes.\nUse the probe to sweep through the mesentery to locate the mesenteric lymph nodes along the colon and mesenteric vessels.\n\t\tNOTE: Colonic nodes run along the mesenteric border of the colon, left colic nodes can be found near the branch points of the vessels, and the inferior mesenteric nodes can be found along the inferior mesenteric vessels. Mesenteric lymph nodes are easily visible in lean animals. When buried in mesenteric fat they will often lend a slightly raised, glistening appearance to the overlying mesentery and may be more a more grayish tan color then surrounding mesenteric fat. Additionally, mesenteric lymph nodes tend to lie along lymphatics and mesenteric vasculature.\nOnce a lymph node is identified, remove the probe and insert the Maryland ratcheted forceps into the abdominal cavity. Use the forceps to grasp the mesentery adjacent the target node. Pull the mesentery towards the incision, and remove the scope from the cannula.\nTurn off the insufflator and leave the cannula stopcock open to depressurize the abdomen to facilitate exteriorization of the mesentery. Pull the mesentery outside of the body through the incision. Once exteriorized, grasp the mesentery with curved mosquito hemostats or thumb forceps to ensure access through the incision.",
    "Identify the lymph node(s) within the exteriorized mesentery by palpating for the firmer lymph node and/or direct visualization of the grayer color or nodular appearance of the lymph node.\n\t\t\nOnce identified, make a small opening (~ 3 - 5 mm) in the mesentery near the node using curved hemostats. Free attachments to the mesentery using blunt dissection with the curved hemostats. Ligate the vasculature with 4-0 non-absorbable monofilament suture as necessary. Use sharp dissection with a scalpel to remove the lymph node. Place the nodes in Roswell Park Memorial Institute (RPMI) 1640 medium on ice.\nExamine the exteriorized mesentery for bleeding. If bleeding is noted, provide appropriate hemostasis by occluding the vessels with hemostats or ligatures (4-0 non-absorbable monofilament suture), or by use of cautery. Release the mesentery and insufflate the abdomen back to 10 - 12 mmHg to allow the mesentery to return to the abdominal cavity.\nRepeat steps 2.4.1 through 2.4.8 to obtain additional lymph node biopsies.\nLiver Biopsy\n\t\nReturn the table to a horizontal position.\nPlace a threaded cannula into the abdomen through the incision previously used for lymph node biopsy collection (incision made in step 2.3.5). Ensure the incision is large enough (~ 5 - 7 mm) to allow for cannula placement without trocar insertion. Insert the rigid scope through this cannula toward the cranial abdominal cavity and visualize the cranial abdomen and liver.\nUnder camera visualization, insert the biopsy forceps through the cannula previously placed in the left cranial abdomen (incision made in step 2.3.1).",
    "To obtain liver biopsies, place the biopsy forceps beneath the selected liver lobe margin with the movable part of the jaw facing the liver, open the forceps, and allow the margin to fall into the open jaws. Ensure that no omentum is between the liver and biopsy forceps. Adjust the position of the forceps and close the instrument over the desired sample region.\n\t\t\nMaintain pressure for approximately 20 - 30 s to ensure hemostasis. With the forceps closed, remove the sample by gently pulling the forceps up through the cannula. This will gently tear the biopsy from the liver. Place liver biopsies in RPMI 1640 medium on ice.\n\t\t\tNOTE: The liver biopsy size is approximately 5 mm x 2 mm x 2 mm using 5 mm biopsy forceps.\nExamine the biopsy site for hemorrhage using camera visualization. If hemorrhage is observed, place a saline moistened sterile cotton swab through the cannula and apply pressure to the biopsy site. Alternatively, pack the biopsy sites with sterile gel foam to aid hemostasis.\nRepeat steps 2.5.3 through 2.5.5 to obtain additional liver biopsies.\n\t\tNOTE: Here, 3 biopsies per animal per procedure were collected, which is sufficient for all downstream analyses.\nSurgical Closure\n\t\nExamine the abdominal cavity for bleeding.\n\t\tNOTE: This has not occurred to date. However, if excessive bleeding is noted, determine the site of hemorrhage and provide appropriate hemostasis via pressure with sterile cotton swabs or the use of gel foam.\nTurn off the insufflator and open the cannula stopcocks. Apply gentle manual pressure to the abdomen to fully depressurize the peritoneal cavity. Remove the cannulas.\nClose each of the abdominal wall incisions with 1 to 2 simple interrupted sutures per site. 4-0 absorbable suture is recommended.",
    "Perform a splash block by placing 0.1-0.3 cc bupivacaine in each incision for local analgesia prior to skin closure.\nClose the skin with 1 - 2 buried interrupted sutures (4-0 absorbable suture is recommended) per site. Tissue glue may be applied.\n3. Liver Biopsy Processing and Lymphocyte Analysis\nStore several pieces of liver tissue (approximately 0.5 mm x 0.5 mm x 0.5 mm in size) in cryopreservation tubes, in a preferred RNA storage solution, and 10% formalin for future molecular and histological analyses.\n\t\nPlace the remaining liver biopsies in 50 mL of RPMI 1640 medium supplemented with 1x penicillin/streptomycin, 40 µg/mL of a commercially available collagenase solution, and 4 µg/mL DNAse in a sterile 250 mL plastic cup with a lid. Stir vigorously using a magnetic stir bar and a stir plate for 1 h at 37 °C.\nEvenly distribute by pouring the digested tissue. Grind the digested tissue (from step 3.1.1) over two 70 µm filters fit into two 50 mL conical tubes into a single cell suspension using the end of a sterile 5 mL syringe. Bring the volume of both tubes to 50 mL in RPMI 1640 medium supplemented with 10% fetal bovine serum and 1x penicillin/streptomycin (R10).\nCentrifuge the cells at 840 x g for 6 min at 4 °C. Decant the supernatant. Concentrate the cells into a single 50 mL conical tube by suspending cells from both tubes in 5 mL R10 and combining into one 50 mL conical tube. Bring volume to 50 mL using R10. Count cells using a hemocytometer to determine cellular yield.",
    "Centrifuge the cells at 840 x g for 6 min at 4 °C. Resuspend the cells in 1 mL R10, distribute evenly into two 5 mL round-bottom polystyrene tubes and bring the volume of each tube to 4 mL with R10, targeting for >500,000 cells in each tube.\nCentrifuge the cells at 840 x g for 6 min at 4 °C. Decant the supernatant and resuspend the cell pellet in 4 mL phosphate buffered saline (PBS). Centrifuge at 840 x g for 6 min at 4 °C.\nDecant the supernatant and resuspend the cells in 100 µL of PBS by vortexing gently. Add 1.5 µL of a fixable dead cell stain. Incubate at room temperature for 5 min.\nAdd the following undiluted surface staining antibodies in titers recommended by the manufacturer: CD45-PerCP (clone D058-1283), CD3-PE-CF594 (clone SP34-2), CD20-PE-Cyanin5 (clone 2H7), CD4-BV605 (clone OKT4), CD8-BV570 (clone RPA-T8), and CD14-BV785 (clone M5E2). Incubate at 4 °C for 20 min.\nAdd 4 mL PBS and centrifuge at 840 x g for 6 min at 4 °C. Decant the supernatant and resuspend the cells in 250 µL of 1% paraformaldehyde in PBS.\n\tCaution: Paraformaldehyde is toxic. Wear appropriate personal protective equipment.\nAnalyze the cell populations using a flow cytometer as described in reference22."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}