{
  "id": 10012,
  "origin_website": "Jove",
  "title": "Electromyometrial Imaging of Uterine Contractions in Pregnant Women",
  "procedures": [
    "All methods described here have been approved by the Washington University Institutional Review Board.\n1. MRI-safe marker patches, electrode patches, and rulers (Figure 1)\nPrint the MRI and electrode patch templates (Figure 1A) on paper.\nCut clear vinyl and silicone rubber sheets (Table of Materials) into 22 (vinyl) and 44 (rubber) rectangular (120 mm x 60 mm), and 4 (vinyl) and 8 (silicone rubber) square (60 mm x 60 mm) patches.\nMake MRI-safe marker patches: Overlay a template with a clear vinyl patch and glue MRI-safe markers (vitamin D liquid softgels) to the vinyl patch at the centers of the circles, which represent the electrode holder cavities on the template (Figure 1B).\nMake electrode patches: Label the circle locations on the silicone rubber patches and punch holes at those locations using a punch set with a diameter of 8 mm.\nAttach electrode holders over each hole with double-sided adhesive collars (Table of Materials). Align the circumference of the electrode holder cavity with the circumference of the hole punched on the silicone sheet.\nInstall the X-ring into the cavity on top of the electrode holder, cover the holder with the color-coded silicone sheet, and insert the pin-type active electrode through the X-ring into the holder. The electrode is centered in the cavity of the electrode holder. The electrode cables should go between the two layers of silicone sheets and in the middle of the two rows of holders along the long edge. Adjust the length of the electrode cable by twining it around the electrode holder if needed.The assembly of an electrode patch is concluded (Figure 1C).\nApply three strips of medical-grade double-sided tape to the electrode patch between the rows of electrodes along the long edge of the patch.",
    "Cut six measuring tapes at their 30 cm marks. Retain the top section from 0 cm to 30 cm. To make a horizontal ruler, glue the edges at 0 cm of two measuring tapes to a long piece of vinyl strip with a gap in the width of the tape. Apply double-sided adhesive tape to each ruler.\nStore the patches and rulers in a closed-lid storage box.\n2. MRI scan\nNOTE: The MRI scan is scheduled at a gestational age (GA) of 36-40 weeks, prior to the mother's expected delivery date, determined based on the subject's schedule and her nurse's recommendation. The estimated time duration for this step is 2 h.\nAfter the subject signs the consent form, ask the subject to change out of her street clothing into the MR-safe pants and gown provided by the MRI technician. Place MR-safe marker patches (Figure 1B) on the body surface in the exam room.\n\t\nPlace patches on the back surface.\n\t\t\nInstruct the subject to sit on a medical exam bed. Peel the liner off the double-sided tape and apply a vertical ruler along the subject's spine, with the end of the ruler at the buttock cleavage.\nPlace a horizontal ruler at the level of the iliac crest, with the center crossing over the vertical ruler. Peel the liner off the double-sided tape on the patches.\nApply two rectangular patches on the back, so that the long edges of the patches are next to the vertical ruler and the corners of the patches are at the intersection of the rulers.\nPlace additional patches to the left and right of the first two patches so that the patches are bilaterally symmetric. For average-sized subjects, apply four rectangular patches at each side (Figure 1E).\nPlace patches on the abdominal surface.",
    "Raise the head of the exam bed to around 40° and guide the subject to lie down in Fowler's position. Place a vertical ruler along the midline of the abdomen, with the 3 cm mark near the fundus region determined by manual palpation.\nApply a horizontal ruler so that its center is at the 6 cm mark of the vertical ruler and extends to the left and right lateral along the natural curvature of the abdomen.\nPlace the first rectangular patch above the horizontal ruler and to the left of the vertical ruler, so that its long edge is parallel to the horizontal ruler and one corner of the patch is at the intersection of the two rulers.\nPlace the second rectangular patch to the left of the first patch, with its long edge along the horizontal ruler. Place the third and fourth patches directly below the horizontal ruler and vertically aligned with the first and second patches.\nPlace the fifth rectangular patch below the third patch, with its short edge along the vertical ruler. Place the sixth rectangular patch next to the fifth on the left side. Place the seventh patch below the fifth patch, with the short edge along the vertical ruler. Leave gaps of 2-3 cm between patches 3, 5, and 7 for the curvature of the abdomen.\nPlace the two square patches (s1 and s2) below the sixth patch and seventh patch, vertically aligned with the sixth and seventh patch, respectively. Place patches on the right abdominal surface so they are bilaterally symmetric with those on the left (Figure 1F).\nTake photos and notes of the patch layout to record the positions of the rulers relative to each other and the subject's umbilicus.",
    "Have an MR technician screen the subject according to MRI safety rules and regulations at Zone II of the MRI facility. Then, guide the subject through Zone III to Zone IV, where a 3 T MR scanner resides.\n\t\nGuide the patient to lie down on the MRI bed in a supine position and provide her with an MR-safe microphone, a headphone set, and a signaling squeeze ball. Cover the subject's lower abdomen with a 32-array MRI coil (Figure 2A). Start the MR scanning.\n\t\tNOTE: A radial volume interpolated breath-hold examination fast T1-weighted sequence was used to perform MRI on the entire abdomen using either a 3 T Siemens Prisma or Vida scanner. The resulting MR images had a resolution of 1.56 mm x 1.56 mm and a slice thickness of 4 mm.\nUse the localizer to adjust the field of view to cover the entire uterus and cervix. Then, perform an MRI scan with a T1-weighted sequence with the volume-interpolated breath-hold examination (repetition time [TR] = 4.07 ms, echo time [TE] = 1.78 ms, flip angle = 10°) and multiplanar reconstruction of the data set (field of view [FOV] = 500 mm x 500 mm, matrix = 320 x 320, voxel size = 1.56 x 1.56 x 4 mm3).\nStore the data in digital imaging and communications in medicine (DICOM) format.\nRemove the MRI patches and rulers from the subject and clean the abdomen and back with baby wipes.\nRemove the double-sided tape from the patches, disinfect the patches with germicidal disposable wipes, and apply new double-sided tape for the next experiment.\n3. Bioelectricity mapping and 3D optical scan",
    "NOTE: Conduct bioelectricity mapping after the subject has been admitted to the labor and delivery unit, and her cervix has dilated to around 4 cm. The estimated time duration for this step is 2 h.\nPrepare the electrode patches: Fill conductive gel into a curved tip irrigation syringe. Add the gel into the electrode holder cavities on each electrode patch using the syringe. Remove the liners of the double-sided tapes.\nApply the electrode patches according to the same procedures as described in step 2.1, following the placement layout described in the photos and notes taken in step 2.2.\nConnect the power and data cords of the 3D optical scanner. Open the 3D scanning software (Table of Materials). Hold the handheld optical scanner (Table of Materials) upright, with the flashing cameras facing the subject.\n\t\nPress the Start button on the scanner to start the scanning, and press the Start button again to record the scanning. Move the scanner around the subject to take 3D optical scans to capture the electrode locations.\n\t\tNOTE: Optical scans of the lower back surface are taken after placing electrode patches on the back surface. Optical scans of the abdominal surface are taken after placing electrode patches on the abdominal surface.\nPress the Stop button on the scanner to finish the 3D scanning.\nTake photos and notes of the patch layout. Note the positions of the rulers relative to each other and the subject's navel.\nPlace four grounding electrodes, with the \"LL\" electrode on the lower left abdomen, the \"LA\" electrode on the left upper chest, the \"RA\" electrode on the right upper chest, and the \"DRL\" electrode on the abdominal surface near the umbilicus or the lower right abdomen.",
    "Connect the components of the bioelectricity mapping hardware, including the laptop, analog to digital (AD) box, battery box, electrode patch, grounding electrode cables, optical fiber, and USB2 receiver (Figure 1D).\nOpen the software Active View on the laptop and turn on the AD box.\n\tNOTE: If the status light is yellow on the AD box, the grounding electrodes have poor contact with the skin. In this case, remove the grounding electrodes, add more gel, and place them back in their locations. Repeat until the status light turns blue.\nCheck the Electrode offset module in Active View. If any electrodes have a large offset (over a quarter of the largest offset), improve their contact with the skin by securing them using medical paper tapes or by reinstalling (removing them, adding more gel, and placing them back in their locations).\nClick Start file > Paused to save the bioelectricity signal data streams in real time. After a 900 s recording, click Pause Save > Stop to finish the recording and store the multi-electrode measurement in a binary data file (BDF) file.\nRepeat step 3.9 four times after the research assistant has checked to ensure the subject is comfortable and willing to continue.\nAfter the last recording (usually four recordings in total), turn off the AD box and disconnect the electrode patches, grounding electrodes, optical fiber, and USB cable.\nRemove the electrode patches and grounding electrodes from the subject.\nClean the subject's abdomen and lower back with a towel or baby wipes.\nPack up all the equipment and store the electrode patches and grounding electrodes for cleaning.\nClean the electrode patches and grounding electrodes in lukewarm water with dish soap in the cleaning room. Disinfect them with germicidal wipes.",
    "Air-dry the patches and apply double-sided mounting tape to the patches and rulers for the next experiment.\n4. Generation of the body-uterus geometry\nPerform segmentation of the MRI data using a data analysis software application.\n\tNOTE: Here, Amira software was used\n\t\nLaunch the data analysis software and load the MRI DICOM data. Go to the Segmentation module and click New to create a new label. Click Edit > Adjust the range to > Data histogram to change the image contrast.\nIn Sagittal View, choose the Brush tool, label the uterus boundaries of the MR images, fill in the regions, and add to the label file. Repeat this step every three to five slices.\nSelect the segmented regions and click Selection > Interpolate > + to interpolate the segmentation of all the slices. This completes the segmentation of the uterine surface.\nClick New to create a new label file. Choose the Magic wand tool, place the masking threshold at the initial local minimum of the data histogram, and adjust it gradually until the entire body is highlighted in blue.\nChoose All slices, click on any blue region, and then click + to add the segmentation into the label file. Click Segmentation > Fill holes > All slices > + to fix the holes.\nGo to the Segmentation module and click New to create a new label for the uterus. Manually segment the uterus on the MR images. Use Interpolate if needed.\nIn the Project module, generate the surface data from the label files of the uterus and body surface.",
    "Choose a surface file, reduce the number of faces in Simplification Editor > Simplify by 50%, and click Simplify now. Choose the simplified surface file and right-click Smooth Surface (iteration = 20, lambda = 0.6) > Apply. Then, choose the smoothed surface file and right-click Remesh Surface (% 100) > Apply to re-mesh to each surface.\nContinue to perform step 4.1.7 until the body surface comprises approximately 18,000 faces and the uterine surface comprises roughly 640 faces.\nClick File > Export Data As > STL ascii to save the two surfaces in stereolithography (STL) format.\nPerform post-processing of the optical 3D scan data.\n\t\nLoad the optical 3D scanning file of the abdominal surface into Artec studio 12 professional.\nSelect the target optical scan and duplicate the scan.\nClick Autopilot to start processing the selected scan.\nIn the Model creation module, choose the scan quality (geometry, texture), object size, hole-filling method (watertight), etc., and click Next.\nIn the Editor module, choose Lasso selection and erase the redundant regions.\nClick Next to create an automatic refinement of the scan.\nClick Editor > Lasso selection to remove unnecessary regions.\nClick File > Export Meshes > STL File Format to save the surface in STL format.\nAlign the optical 3D scan data to the MRI body surface and generate the body-uterus geometry with the tool command language (TCL) scripts in the data analysis software.\n\t\nLoad the STL format surfaces generated from steps 4.1 and 4.2 with pre-programmed data analysis software project.\nRun the prompt TCL command line to prepare data analysis software objects for rigid alignment for the abdominal surface.\nClick Two Viewers (horizontal) and display the optical scan torso surface in the left viewer and the MRI body surface in the right viewer.",
    "Place five or six landmarks on both surfaces and run the prompt TCL command line to apply the rigid alignment.\nRepeat steps 4.3.2-4.3.4 for the back surface.\nClick Single Viewer and display the rigid-aligned optical-scanned body surface in the viewer.\nRun the prompt TCL command line to prepare data analysis software objects for non-rigid alignment.\nClick Project > Create Object > Landmarks and add landmarks at the electrode locations on the optical scanned body surface.\nClick File > Export Data As > LandmarkSet Ascii to export the landmark files for non-rigid alignment.\nRun the Geometry module in the EMMI data processing pipeline to perform a non-rigid alignment.\nExecute the TCL command line prompt to import the automatically aligned electrode landmarks and improve the precision of the electrode landmarks in reference to the notes and photos described in steps 2.3 and 3.3.\nClick File > Export Data As > LandmarkSet Ascii to export landmark files for the electrode locations.\nRun the EMMI data processing pipeline-geometry module to load the STL files and LandmarkSet files, and generate the body-uterus geometry in MAT format.\n5. Electrical signal preprocessing\nRun the EMMI data processing pipeline-EMG preprocessing module to load the BDF file and process the raw electrical signal with a Butterworth filter with the frequency band 0.34-1 Hz.\nRun the EMMI data processing pipeline- artifacts detection module to automatically detect the local and global artifacts in the filtered signal.\n6. Uterine electrical signal reconstruction and characterization\nRun the EMMI data processing pipeline-reconstruction module to load the body-uterus geometry and preprocessed electrical signal data and compute the electrical signals on the uterine surface.\nRun the EMMI data processing pipeline-EMG signal analysis module to automatically detect the onsets and offsets of each EMG burst on the uterine surface.",
    "Choose the observation window on the cluster figure overlay to compute the activation time at each uterine location for every observation window and create an isochrone for each observation window.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}