{
  "id": 6803,
  "origin_website": "Bio",
  "title": "<em>In vivo</em> Tumor Growth and Spontaneous Metastasis Assays Using A549 Lung Cancer Cells",
  "procedures": [
    "Prepare cellsSeed cells into 10 cm dishes (0.5 x 106 cells/dish) three days before implantation.Change media (DMEM/F12 + 10% FBS + 1% Pen/Strep/Glutamine) the day before implantation.Harvest cells by trypsinization, rinse with PBS three times, count and resuspend cells in PBS at 2 x 107/ml.Note: Total volume of cells prepared will depend on the number of mice needed. Prepare 1.5 ml Eppendorf tube per mouse and mix 60 µl cell suspension in PBS with 60 µl Matrigel (the ratio of cells:Matrigel is 1:1).Note: Since matrigel forms a gel above 10 °C, matrigel solution should be thawed overnight at 4 °C and kept on ice throughout the preparation. Tubes and tips for transferring Matrigel solution should also be chilled prior to implantation. Implant cells and Matrigel mixture into NOD.CB17-Prkdcscid/J (#00 1303  ; The Jackson Laboratory)Shave hair from the lateral body wall area.Administer analgesic (Buprenorphine HCl, diluted in sterile saline, 0.1 mg/kg SQ) 20-30 min before mouse surgery.Note: Buprenorphin HCl is a controlled substance and should be stored in a double locked cabinet. Anesthetize mouse by isoflurane inhalation until the mouse is unresponsive to toe pinch. Keep mouse warm and monitor breathing during procedure.Note: You should follow the IACUC protocol to administer the right dose of isoflurane. Disinfect surgical site with providone-iodine alternating with 70% ethanol for 3 times.Note: See Video 1 for Steps B5-B9.Lift the skin with sterilized dissecting forceps and make ~5 mm incision with operating scissors in the lateral body wall just posterior to the axillary area.Make a subcutaneous pouch by blunt dissection.(Optional) Transfer 100 µl of cells mixed with Matrigel (1 x 106 cells) into the pouch using pipette with 200 µl wide bore Pipet tip to minimize the shearing of the cells.Place ear tag on mice.",
    "Close incision using clip applier with 9 mm surgical clips and place mouse in recovery cage. Mouse should recover from anesthesia within 1-2 min.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Subcutaneous implantation of cells and Matrigel mixture into mouse. (Animal study was performed according to the procedure approved by the University of Kentucky Institutional Animal Care and Use Committee (IACUC).)Monitor tumor growthCheck clips and mouse health daily until clips are removed using clip remover from mouse; wound clips should be removed 7-10 days after surgery.Measure tumor size using a caliper 3 times/week and weigh mouse until tumor size reaches around 1,000-1,500 mm3 (Note: endpoint will depend on the goal of the experiments). Three parameters of the tumor: the length (the longest diameter), the width (the diameter perpendicular to the length), and the height were recorded.Harvest primary tumor tissues and organsPerform CO2 euthanasia and maintain CO2 flow for a minimum of 1 min after respiration ceases; then perform cervical dislocation.Note: You should follow your IACUC protocol to sacrifice mouse. Clean tumor area with 70% ethanol.Cut skin and remove tumor carefully and place tumor in a sterile tube containing DMEM/F12 media and keep it on ice.Perform necropsy to remove lungs or other organs such as liver, spleen, kidney or brain, and put them in tube containing DMEM/F12 media and keep the tube on ice.Rinse tissues with PBS.Fix tissues in 10% neutral buffered formalin overnight at 4 °C and replace solution with 70% ethanol before processing for paraffin embedding.Note: Histopathology Facility may be required to process the samples for this step. Stain tissues with hematoxylin and eosin (H&E).Examine H&E slides to identify foci of adenocarcinoma (for A549 cells) (Figure 1). These can be identified by recognizing characteristic architectural and cytologic features (e.g.",
    ", glandular tumor formations, papillary growth, or lepidic tumor spread; loss of nuclear polarity, nuclei with fine chromatin and prominent nucleoli, anisonucleosis).Measure the diameter of each tumor foci in millimeters using a digital micrometer.Note: We used the Olympus cellSens Standard 1.17 image analysis software.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200326/20200326070257_7208.jpgFigure 1. H&E staining of lung section. Magnification = 40x for image in (A) and 200x for image in (B). Scales bar = 1 mm in (A) and 100 µm in (B). Arrows indicate tumor foci. Representative images are shown."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}