{
  "id": 10691,
  "origin_website": "Jove",
  "title": "Construction and Setup of a Bench-scale Algal Photosynthetic Bioreactor with Temperature, Light, and pH Monitoring for Kinetic Growth Tests",
  "procedures": [
    "1. Construct the Bench-scale PBR Body and Lid\nNOTE: For illustration purposes, Dunaliella sp., a ~10 µm halotolerant microalgae lacking a cell wall, was used as the model organism for the construction of this PBR.\nDetermine the PBR volume required for the research needs.\nDetermine the experimental objectives for this PBR.\nDecide which algal measurement assays, M, are necessary to characterize the growth of the algal species of interest, including the volume required per assay, v; the number of technical replicates, n; the sampling frequency, f; and the duration of experiments, t.\n\t\tNOTE: Project-specific research questions, algal species, and available equipment dictate the algal properties measured, the methods used for these measurements, and how frequently these measurements are taken. Biomass; cell counts; and total chlorophyll pigment, protein, lipid, carbohydrate, and external nitrate concentration measurements are common ways of assessing growth, and daily sampling over 5 - 14 days is a common approach for growth tests9,10.\nCalculate the total culture volume, Vs, required for sampling throughout one experiment using Equation 6.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55545/55545eq9.jpg\nUse Equation 7 to estimate a target PBR volume, Vp, using Vs from step 1.1.3 and a maximum volume removal fraction, F.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55545/55545eq10.jpg\n\t\tNOTE: Removing less than a pre-specified fraction of the total culture volume (e.g., ~20%) can help to ensure that the conditions within the PBR i.e., (mixing power, light distribution, etc.) do not drastically vary over the course of the experiment as the culture volume is removed.\n\t\t\nAssuming a 10-day experiment where biomass; cell counts; and total chlorophyll, protein, lipid, carbohydrate, and nitrate concentrations are measured daily in triplicate, use a total sampling volume of ~600 mL. If aiming to remove no more than 18.75% of the total culture volume, use a total working reactor volume of at least 3.2 L.",
    "Select sensors and accessories for the PBR experiments.\nSelect pH, light, and temperature probes to use for continuous monitoring.\n\t\tNOTE: Sensors should be compatible with the data acquisition unit and should withstand internal culture conditions (i.e., pH range, light, heat, algal debris, salt, etc.). Stainless steel and salt-tolerant probes were selected here since Dunaliella sp. are marine microalgae.\nSelect an impeller design and motor to satisfy the experimental mixing requirements.\n\t\tNOTE: For example, a low-shear, axial impeller is a good choice for Dunaliella algae, as they lack a cell wall and can easily shear11. These algae have flagellar locomotion and do not need intense mixing11. Low mixing speeds can be attained using a 12 V mini-gear motor. The impeller and shaft can be 3D-printed (3D printing information can be found in the materials list).\nAssemble the PBR body and lid.\nDetermine the dimensions of the reactor, based on the volume calculations in step 1.1, keeping in mind the experimental objectives and potential constraints (e.g., space).\n\t\tNOTE: A PBR design with a lower surface-to-volume ratio is preferred, as this shape minimizes light attenuation throughout the PBR, providing a more consistent light distribution throughout the experiment.\nCut five pieces of optically clear cast acrylic sheets (~0.25-0.5 in thick) using a table saw, according to the PBR design and size established in step 1.3.1.\nMake sure that the joint edges are smoothed, but not rounded, using 200 to 400 grit sandpaper.\nSecure the edges of the acrylic pieces together with tape and/or clamps.\n\t\tNOTE: Acrylic cement is not a glue. If the acrylic bonding surfaces are rough or the acrylic pieces are not evenly aligned, this bonding cement will not be effective.",
    "In a well-ventilated area, apply acrylic cement along the joints using a needle dispenser. The plastic surfaces will immediately adhere together. Allow the pieces to sit for 24 h.\n\t\tWARNING: A mask and gloves should be worn to avoid inhalation and skin exposure when using acrylic cement.\nApply viscous acrylic cement to the joints to ensure that the PBR is watertight. Leave the cement to dry for 24-48 h, according to the cement instructions; drying times may vary.\nFill the reactor with water to check for visible leaks. If no leaks are apparent, place the reactor on paper towels and recheck for signs of leakage after 24-36 h.\n\t\tNOTE: Acrylic sheets no less than ~0.5 in thick should be used to assemble PBRs holding more than ~2 L; thinner sheets may bow under water pressure and cause leaks. Gaskets and re-enforcing screws can be used as a more robust alternative to acrylic cement ( Figure 1). This type of assembly requires precision machinery and must be done extremely carefully, as acrylic can easily crack.\nUse a machine shop to design the PBR lid, with ports to accommodate sensors and other PBR accessories and needs (i.e., impeller, gas lines, sampling ports, etc.). Make sure that the internal components do not interfere with each other.\n\t\tNOTE: The PBR and PBR lid configuration/design will depend upon reactor accessories and experimental objectives. See Figure 1 for an example of a PBR reactor and lid design (further details can be found in the materials section). This PBR design will be referenced for the remainder of the protocol.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55545/55545fig1.jpg",
    "Figure 1: Image of the Customized Bench-scale PBR Setup with Sensors and a Mixer. This setup shows a mixer, an electrode secured to the lid through a threaded port in the lid, and a light sensor attached to a specially designed lid. This lid design also includes the attachment of a 12 V DC mini-gear motor. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/55545/55545fig1large.jpg]\n2. Set up and Configure Sensors with the Data Acquisition and Control Unit\nNOTE: Sensors translate changes in the physical world into a measurable analog signal, often voltage. Data acquisition units serve as an interface between the digital and physical world and can be used to read these analog signals and convert them into discrete values, as instructed by a computer. The data-acquiring unit described herein has an analog input resolution of 16 bits, can read up to 14 analog signals (±10 V), and can supply the power required by some sensors (up to 5 V). These instructions provide an overview on how to set up this data acquisition and control unit to convert an analog signal into more meaningful values for light, pH, and temperature within a PBR. These instructions do not detail important concepts (i.e., quantization, precision, response time, etc.) needed to fully interpret these measured values and to quantify uncertainty.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55545/55545fig2.jpg\nFigure 2: Sensor-to-data Acquisition and Control Unit Connection Diagram. This diagram shows how to set up pH, light, and temperature sensors to the data acquisition and control unit used for this protocol. Signal processing components for the pH and light sensor are shown. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/55545/55545fig2large.jpg]\nSet up and configure the light sensor with the data acquisition and control unit using a low-pass filter.",
    "NOTE: Please refer to Figure 2 for general reference diagrams. Manufacturer sensor specifications indicate the difference between the signal, power, and ground wires based on color. A low pass-filter is a simple circuit that uses a resistor and capacitor to filter out unwanted noise from electrical signals. This type of filter attenuates electrical signals with frequencies higher than the cutoff frequency as determined by the resistance and capacitance. This filter helps to remove or smooth electrical noise from the sensor signal.\n\t\nUsing wire strippers, cut a ~2 inch piece of green connector wire; strip 0.25 in of insulation off one end and ~0.5 in from the other end of both pieces.\nIdentify the analog signal output wire on the light sensor. Ensure that at least ~0.25-0.50 inches of metal wire are exposed past the wire insulation.\nCarefully wrap one leg of the 1,000 Ω resistor around the ~0.5 inch stripped end of the connector wire. Wrap the other leg of the resistor around the exposed section of the light sensor analog signal wire.\nUse a soldering iron and lead-free solder to solder the resistor legs to the wire. Allow the solder to cool for 2-5 min.\n\t\tWARNING: The solder and soldering irons get extremely hot and can be very dangerous if users are not properly trained. Instructional videos can be found online. Safety glasses and other precautions are extremely important. Wires should not be connected to a power supply or other devices during this process.\nSlip a ~1.5 inch piece of heat-shrink tubing over one end of the connector wire and slide the piece until it covers the soldered wire and resistor. Make sure that all metal pieces are fully covered.",
    "Heat-shrink using a heat gun. Make sure the tubing wraps tightly around resistor and wires; no bare wire should be exposed.\nAttach the ground wire of the light sensor to a free ground (GND) terminal on the data acquisition and control unit using a screwdriver.\nSecure the free end of the signal connector wire to a free analog input (AIN) terminal using a screwdriver.\nSecure the positive lead of the 1,000 µF capacitor (i.e., the longer leg) to the same AIN terminal as in step 2.1.8 and the negative lead (i.e., the shorter leg) to the same GND terminal as in step 2.1.7. Make sure that both the capacitor leg and the wire are firmly connected to the terminal.\nIdentify the power input wire for the light sensor and secure this wire to a voltage supply (VS) terminal on the data acquisition and control unit.\nSet up and configure the pH electrode with the data acquisition unit using a unity-gain amplifier and a low-pass filter. \n\tNOTE: Due to the nature of pH measurements (i.e., high impedance and low voltage), a unity-gain amplifying buffer is often required between the pH probe and the data acquiring device. A low-pass filter is also beneficial for measuring pH, to protect the signal from ambient electrical noise.\n\t\nConnect the unity-gain amplifier to the pH probe using the transmitter wire.\nConnect the co-axial adapter, with positive and negative port terminals, to the other end of the unity-gain amplifier.\nCut two 6-in pieces of green and one ~12 inch piece of black connector wire using wire strippers. Strip ~0.25 inch of insulation off both ends of the black connector wire.\nStrip ~0.25 inch and ~0.5 inch of insulation off the ends of the green connector wires using wire strippers.",
    "Carefully wrap one leg of the 1,000 Ω resistor around the ~0.5 inch stripped section of one green connector wire. Wrap the other resistor leg around the ~0.5 inch stripped section of the other green connector wire.\nUse a soldering iron and lead-free solder to solder the resistor legs to the wire. Allow the solder to cool for 2-5 min.\nSlip a ~1.5 inch piece of heat-shrink tubing over one end of the connector wire and slide the piece until it covers the soldered wire and resistor. Make sure that all metal pieces are fully covered.\nHeat-shrink using a heat gun. Make sure that the plastic wraps tightly around the resistor and wires; no bare wire should be exposed.\nSecure one end of the black connector wire to the negative (black) terminal post on the co-axial adapter. Insert the other end of this wire into a GND terminal of the data acquisition and control unit and secure using a screwdriver.\nSecure one end of the green connector wire (with the resistor in series) to the positive (red) terminal post on the co-axial adapter. Insert the other end of this connector wire into a free AIN terminal on the data acquisition and control unit.\nIdentify the positive lead of the 1,000 µF capacitor (i.e., the longer leg) and secure this lead to the same AIN terminal as in step 2.2.9; make sure both the capacitor leg and the signal wire are firmly connected to the terminal.\nSecure the negative lead of the 1,000 µF capacitor (i.e., the shorter leg) to the same GND terminal as in step 2.2.8.\nConnect the temperature sensor to the data acquisition and control unit by connecting the signal, ground, and power wires of the probe to free AIN, GND, and VS terminals.",
    "3. Set up the Live Data Acquisition and Experimental File\nNOTE: The data acquisition and control software described here communicate with the data acquisition and control unit to monitor and log sensor data at user-specified time intervals. The instructions below explain how to set up a control file in this software to monitor and record pH, temperature, and light. These instructions are specific to the software and data acquisition and control unit listed in the materials section. Further instructions can be found in product user manuals.\nConnect the data acquisition and control unit to a computer near the experimental setup using a USB cable and download all required drivers.\nDownload and open the data acquisition and control software.\nSet up 'Conversions' for each sensor in the software.\n\tNOTE: To convert the physical voltage signal into a meaningful value, some conversion factor, established by calibration, must be applied. Many sensors come with factory calibration factors found within product-specific specification sheets. Conversion equations are specific to the setup and the sensors. Many conversion equation parameters, especially those for electrodes, must be updated regularly via calibration. The lifetime of a sensor and calibration frequency will depend upon product-specific specifications and the working environment.\n\tNOTE: Users should read and understand these specifications in full. Table 1 shows conversions for sensors found in the materials list. An example conversion for the temperature probe is shown below.\n\t\nNavigate to \"Conversions\" in the software workspace, on the right side of the main homepage.\nAdd a conversion name, such as, \"volts_to_celsius\" and type in the conversion equation: (55.56 x value) + 255.37 - 273.15.\ntable:\n﻿0,1,2,3\nChannel Name,Conversion Name,Equation,Notes\nTemperature,volts_to_celsius,(55.56 x value) + 255.37 - 273.15,Manufacturer conversion equation to convert volts to celsius.",
    "Light,volts_to_PPFD,value x 500,\"Manufacturer conversion factor to convert volts to photosynthetic photon flux density (µmol m-2s-1), manufacturer LED-correction not applied.\"\npH,volts_to_pH,(-17.05 x value) + 6.93,Calibration-dependent conversion equation (Figure 4b) to convert pH electrode voltage readings into pH values. Only apply conversion to pH channel after calibration.\nTable 1: Channel Conversion Table for the Data Acquisition File. Examples of how to input channel and conversion information for the sensors into the data acquisition software.\nSet up appropriate Channels for each sensor within the software to acquire sensor data.\n\tNOTE: Each sensor needs its own analog-to-digital channel in the software and a designated analog input terminal within the data acquisition and control unit. \n\t\nNavigate to the \"Channel\" page within the software.\nAdd a sensor channel name. No space characters are allowed.\nSelect the appropriate device to collect data for the corresponding channel; this device will correspond to the data-acquiring device.\nInput the device number used to reference the data acquisition and control unit or other data-acquiring device; if only one unit is being used, the default number is often zero.\nSelect analog-to-digital, “A to D,” for the input-output type (“I/O Type”) and input the channel number that corresponds to the AIN terminal number on the data acquisition and control unit\nInput the desired sampling “Timing” (s); this value indicates how often the sensor signal will be read. Input 1.0 to acquire a reading every 1 s. To average data over 1-min intervals prior to logging, check the “Avg” box and specify 60 for the averaging length.\nSelect the appropriate conversion from the dropdown menu, if applicable (see step 3.3 to generate conversions); otherwise, all channel data will be displayed/recorded as a voltage.\nSet up the \"Logging Set\" to log the experimental data.",
    "Navigate to the “Logging Panel” within the software workspace, add a new logging set, and name the set accordingly. Select the output file type and location; the ASCII file type will provide a comma-separated value file if the extension ‘.csv’ is specified in output file name.\nAdd all desired channels to log to this set.\nStart and stop logging as desired by right-clicking on the logging sequence in the workspace and selecting the appropriate option.\n\t\tNOTE: Do not attempt to access the file when actively logging data. This action can disrupt the logging process. The file location for continuously logged files should not be saved/written within a cloud directory.\nSet up the \"Page\" to display the data and graphs.\nNavigate to the \"Pages\" display within the software workspace. Click on one of the default blank pages.\nTo display a sensor output reading numerically on page, add a \"Variable Value\" display to the page.\n\t\t\nRight-click anywhere within blank page, select \"Displays,\" and click the \"Variable Value\" option; a small box will appear on the screen.\nRight-click on this newly-created box and select \"Properties.\" Type in the display caption (e.g., \"Temperature in Reactor\"), the channel reference (e.g., \"Temperature[0]\"), and the associated units (e.g., \"Celsius\"). Click \"OK\" and return to the display page.\nTo display the sensor data graphically and in real time, add a 2D graph to the display page.\n\t\t\nRight-click anywhere within blank page and select \"Graphs\" and then \"2-D graphs;\" a small plot will appear on the screen.\nRight-click the newly-created graph and select \"Properties.\" Within the \"Traces\" tab, type in the desired sensor channel name (e.g., \"Temperature\") in the box for \"Y Expression:\" and make sure that \"Time\" is written in the box for \"X Expression:.\" Click \"OK\" and return to the display page.\n4. Calibrate the pH Probe",
    "NOTE: pH calibration should be done before every experiment, at the intended temperature of experiment, and the pH channel conversions should be updated accordingly. pH electrode readings can drift during experiments; to determine the extent of this drift, repeat the calibration process after running the experimental setup and compare the readings. pH electrodes should be properly stored in the appropriate storage solution before and after experimentation, as directed by the manufacturer.\nConnect the pH and temperature sensors, as described in step 2.\nInsert both the pH electrode and the temperature probe into pH calibration buffer 7.\nCheck the graphical display to ensure the temperature reading of the probe is at the desired temperature for running experiments (step 3.6.2.2).\nAllow the pH electrode voltage output to stabilize (i.e., the voltage readings no longer change in one direction). Use a graphical display to confirm stabilization.\nLog both the temperature and pH electrical data to a file (step 3.5) for 30-60 s. During this process, the pH channel should not have any conversions applied or include any averaging.\n\tNote: Since pH electrodes are sensitive to electrical noise, a lower acquisition timing (i.e. faster sampling) for the pH channel might be preferable (e.g. ‘Timing’ = 0.1 s).  Keep in mind, a lower timing will require more computational resources.\nRepeat the calibration for buffers 4 and 10. Confirm that the response of the sensor is between -57 and -59 mV/pH (Figure 3a).\nGenerate a conversion equation by plotting the pH buffer value versus voltage and fitting a line (Figure 3b). Update the conversion equation as described in step 3.3 .\nApply this conversion to the pH channel and update channel settings to include averaging as desired for logging.\n5. Set up the PBR for the Algal Experiment",
    "NOTE: The steps below are specific to Dunaliella and the custom-made PBR shown in Figure 1. Moreover, these setup instructions are not in accordance with sterile protocols, as this system was not designed in such a way.\nPrepare the algae inoculum and growth medium, as needed for the experiment and experimental objectives.\nConnect the pH and temperature wires to the data acquisition and control unit, as described in steps 2.2-2.3.\nCalibrate and update the conversion equation for the pH channel, as described in steps 3.3 and 4.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55545/55545fig4.jpg\nFigure 4: Wiring Diagram for the Mixer. This diagram shows how to set up a mixing device for a PBR using a mini-gear motor, a power supply, and a 3D-printed impeller and shaft. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/55545/55545fig4large.jpg]\nSet up the PBR inside a temperature-controlled incubator with accessories and sensors. Refer to Figure 4 for visualization.\nSet up the light sensor within the PBR by threading the light sensor wire through the lid port and then mounting the sensor head onto the lid extension mount using the provided screw. Use a rubber stopper or grommet to keep this port closed to the atmosphere.\nAttach and secure the mixer impeller onto the PBR lid by placing the impeller shaft over the DC mini-gear motor shaft inside the PBR lid; secure the shaft with a set screw and an Allen wrench.\nAdd algae-specific growth medium, place the lid, and secure the lid with screws. Place the PBR inside the incubator (set at 25 °C or the desired temperature).\nInsert the temperature probe into its designated port and secure it into the port using a rubber stopper.\nSecure the pH probe into the reactor lid port using a PG-13.5 threaded mount.",
    "Connect the light sensor wires to the data acquisition unit , as described in step 2.1.\nPower the mixer impeller to the desired speed.\nSet up the variable DC power supply adjacent to the setup. Turn on the power supply and adjust the voltage knob until the voltage value reads 0 volts. Turn off the power supply.\nConnect the impeller motor power lines to the positive and negative output terminals of the variable power supply (Figure 5).\n\t\tWARNING: Never connect or touch live wires or circuits. Make sure that all power supplies are turned off before connecting any wires. Always read manufacturer instructions/specifications to ensure compatibility between the motor, power supply, and wires.\nTurn on the power supply and slowly increase the voltage by turning the voltage knob until the desired mixing speed is reached; calculate the mixing speed by measuring the rotations per min.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55545/55545fig5.jpg\nFigure 5: Reactor Experimental Setup Diagram. Visualization of a PBR experimental setup within a temperature-controlled incubator. This setup includes a grow lamp and a PBR, with sensors and a mixer secured within the PBR lid. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/55545/55545fig5large.jpg]\nSet up the grow lamp to illuminate the PBR.\n\tNOTE: A high-powered, LED grow lamp that emits in the blue and red spectrum was chosen to achieve the photosynthetic light intensity levels required for this Dunaliella-specific research. The size and shape of the light fixture should be selected such that the light evenly illuminates the incident surface of the PBR. Verify that the incubator can handle an internal heat source. Not doing so could shorten the incubator lifetime and/or could cause damage or excessive heating within the incubator.",
    "Center the grow lamp along the front face of the PBR. Make sure that the light path is directly oriented towards the light sensor mounted on the back of the reactor.\nTurn on the light and adjust the light intensity as needed by moving the grow lamp directly toward or away from the reactor. Check the sensor variable display for light readings.\nMonitor and log the sensor data for 6 - 24 h to ensure that the light, temperature, and pH readings within the PBR are stable and within the desired range. Adjust as needed.\n\tNOTE: Electrical noise can often be observed by bouncing, unsteady readings, and/or abrupt shifts in values, without apparent changes in the PBR environment.\nRemove the rubber stopper on the sampling port to add algae inoculum via transfer pipette.\nRemove the samples and monitor the conditions to ensure that they stay within the range desired for the experiment.\nRemove the cultures for analysis as needed from the sampling port using a pipette.\n\t\tNOTE: The sample volume, frequency, and duration of experiment will depend upon step 1.1.2.\nMonitor the water temperature within the PBR by checking the data display in the software and manually adjusting the incubator air temperature set point to keep the water temperature constant.\n\t\tNOTE: This adjustment will depend upon the incubator manufacturer instructions.\nMonitor and adjust the pH within the PBR, as desired, to ensure that the pH stays within the expected range for the experiments.",
    "NOTE: Here, the pH was controlled with a 12 V solenoid valve (normally-closed) in line with a compressed CO2 tank (99.99%). The valve was opened as required using the control functionality of the data acquisition and control unit and software. This setup required an accessory relay board and DC modules and was implemented using custom computer programming tailored to specific research goals."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}