{
  "id": 10626,
  "origin_website": "Jove",
  "title": "Automated Robotic Liquid Handling Assembly of Modular DNA Devices",
  "procedures": [
    "1. Specify Parts to be Used in DNA Device Library and Generate User/Liquid Handler Instructions [15 min]\nUsing any web browser, navigate to mocloassembly.com and upload Genbank files for all DNA parts that will be included in the combinatorial DNA device design.\nOnce all files have been uploaded, select desired DNA parts and drag them onto the blank canvas, placing part types in the intended final order of DNA parts.\n\tNOTE: Collections of parts, as well as individual parts, can be selected and placed on the canvas. Also, order DNA parts such that the 5' and 3' overhangs for each part match.\nClick 'Assemble' on the bottom right of the page.\n\tNOTE: The tool will only generate valid, buildable assemblies based on the four base pair overhangs that flank each part upon digestion with the BsaI enzyme. If no buildable DNA devices exist based on the parts uploaded by the scientist, the tool will indicate that no assemblies were found.\nNavigate to the 'Plans' tab and download files generated by the tool. These files will include:\nHuman-readable plate maps for the scientist to prepare DNA samples, as well as reagents necessary for the reactions\nA 'picklist' for the liquid handler\nFully annotated Genbank files for all DNA devices to be assembled\n\t\tNOTE: Liquid handling arm positioning when accessing any new labware must be tested. Consult the manufacturer's manual for detailed instructions on how to adjust the pipetting arm positioning in the X, Y, and Z axes as necessary.\n2. Prepare Plasmid DNA and Reagents for Assembly [3 days]",
    "[Day 1] Using a sterile inoculation loop and working near an open flame or in a laminar flow hood, streak out bacterial glycerol stocks onto LB-agar plates supplemented with the appropriate antibiotic. Do this for all necessary DNA parts, making sure to sterilize the loop between every sample. Incubate plates at 37 °C overnight.\n\tNOTE: Frozen bacterial glycerol stocks should be kept on ice as much as possible. Repeated freeze-thaw cycles lower the viability of the stock and should be avoided.\n[Day 2] Using a sterile pipette tip, toothpick, or inoculation loop, and working near an open flame or in a laminar flow hood, inoculate 3 mL of LB broth (supplemented with appropriate antibiotic) with a single colony from the LB-agar plates prepared in 2.1. Incubate cultures overnight at 37 °C while shaking at 300 RPM.\n[Day 3] Purify plasmid DNA from the bacterial cultures using any commercially available mini-prep plasmid purification kit.\nUsing the MoClo_Setup.xlsx file provided, dilute each sample of plasmid DNA to a concentration of 20 fmol/µL in water or TE buffer.\nFollowing the plate map of the PDF file generated by the assembly tool, place the indicated volume of each diluted DNA part into the appropriate well on a full-skirted 96-well PCR plate. Hold this SetupPlate on ice until needed, or seal with a foil adhesive seal and store at -20 °C.\nOn ice, prepare the reaction mastermix with the following components: for each 20 µL of reaction add 2 µL of 10x T4 DNA ligase buffer, 0.5 µL of T4 DNA Ligase (HC), and 1 µL of BsaI enzyme. A calculator sheet is included in the MoClo_Setup.xlsx file to assist with this.",
    "Distribute the enzyme mastermix into the appropriate wells of a new full-skirted 96-well PCR plate, following the plate map for the ReagentPlate in the generated PDF. Keep this ReagentPlate on ice or on a 96-well cold-block.\n\t\tNOTE: The ReagentPlate should only be prepared when ready to run the assembly on the liquid handler.\n3. Execute Assembly Script on the Liquid Handler [Variable]\nPlace the SetupPlate(s), the ReagentPlate(s) (on a 96-well cold-block), and the necessary number of empty full-skirted 96-well PCR plates on the deck of the liquid handler. The empty plate(s) will be the OutputPlate(s) where the reactions are assembled.\nPrepare the liquid handler control software by creating instances of each sample and reagent plate prepared, making sure to name them exactly as they appear on the plate maps generated by mocloassembly.com, including a trough of clean, deionized water labeled ‘Reservoir’.\nUsing the ‘Worklist’ command in the control software, load the .gwl file generated by our software tool, followed by another ‘Worklist’ command which will execute the .gwl file loaded in the first command.\nExecute the script using the controller software's 'Run' command.\n\tNOTE: Always allow the robotic liquid handler to complete the execution of a script before trying to access the deck space.\nRemove all plates from the liquid handler deck. Remaining DNA may be saved by sealing the SetupPlate(s) with aluminum sealing film and storing at -20 °C. Seal the OutputPlate(s) with adhesive film, place in a thermocycler or heat-block and run with the following cycle parameters:\n\t37 °C for 2 h, 50 °C for 5 min, 80 °C for 10 min, hold at 4 °C\n\tNOTE: Once the reaction thermocycling is complete, OutputPlate(s) can be stored at -20 °C until they are ready to be transformed.\n4. Transform the Reactions [1 day]",
    "Thaw the requisite number of competent E. coli cell aliquots needed (10 µL/reaction) on ice.\n\tNOTE: To maintain sterility, the following steps should be performed near an open flame, or within a laminar flow hood.\n\t\nWhile cells are thawing, prepare LB-agar plates (containing appropriate antibiotic) by pipetting 50 µL of 0.1 M IPTG and 50 µL of 20 mg/mL X-GAL onto the surface. Make a master mix if plating a large number of reactions. Coat the plates evenly using a sterile glass rod or glass beads and allow the plates to rest at 37 °C for at least 15 min before plating bacteria.\n\t\tNOTE: Alternatively, add IPTG and X-Gal to liquid agar before plates are poured, at 2 mM IPTG and 40 µg/mL X-Gal final concentration. Store these plates out of direct light as X-Gal is light-sensitive.\nOn ice, aliquot 10 µL of competent cells for each reaction into a new 96-well PCR plate. This will be the Transformation Plate.\nAdd 1-3 µL of each reaction from the OutputPlate(s) to the corresponding well in the Transformation Plate and incubate on ice for 5 min.\nSeal the Transformation Plate with adhesive film and heat shock in a thermocycler at 42 °C for 30 s. Then, immediately place the plate on ice for 2 min.\nTo the same wells of the Transformation Plate, add 150 µL of SOC media, seal with an aluminum adhesive seal, and incubate at 37 °C while shaking at 900 RPM for 1 hr.\nPlate the full contents of each well of the Transformation Plate on the LB-agar plates prepared in 4.1.1 using a sterile glass rod or glass beads to evenly coat the surface of the plate. Incubate plates at 37 °C overnight.\n5. Clone Verification [2 days]",
    "Prepare one or several 96-well deep-well culture blocks with 1.5 mL of LB broth (containing appropriate antibiotic).\nSimilar to step 2.2, inoculate the deep-well culture block(s) with single white colonies from each LB-agar plate of transformed reactions.\nSeal the culture block(s) with a gas-permeable seal and incubate overnight at 37 °C while shaking at 900 RPM.\n\t\tNOTE: The modular cloning technique utilizes blue-white screening, so positive CFUs will appear white on the LB-agar plate, while empty destination vectors will appear blue.\nIsolate plasmid DNA from bacterial cultures (as in 2.3) and submit for Sanger sequencing to verify clones."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}