{
  "id": 19655,
  "origin_website": "Jove",
  "title": "Measuring Glucose Uptake in Drosophila Models of TDP-43 Proteinopathy",
  "procedures": [
    "The UAS FLII12Pglu-700µδ6 transgenic flies were reported in Volkenhoff et al.10 and kindly provided by Dr. S. Schirmeier. The UAS TDP-43G298S transgenic lines were kindly provided by Dr. T. Iwatsubo13. Recombinant Drosophila lines harboring both UAS FLII12Pglu-700µδ6 and UAS TDP-43 transgenes were generated in the Zarnescu laboratory using standard genetic approaches and reported in Manzo et al.9. D42 GAL4 was used to drive the expression of the glucose sensor alone or together with TDP-43G298S in motor neurons. All fly lines are maintained on molasses cornmeal media, at 25 °C in 12 h dark:light cycle.\n1. Drosophila Ventral Nerve Cord (VNC) dissections\nMake silicone elastomer dissection dishes.\n\t\nPour silicone elastomer components into a 50 mL tube as indicated in the manufacturer's protocol and stir well.\nFill 35 mm tissue culture dishes with approximately 2 mL of the elastomer mixture. Use a syringe to remove any bubbles. Cover the dishes and place them on a level surface in a 60 °C oven overnight to cure.\nDissect Drosophila larvae to expose the VNC while maintaining tissue viability.\n\t\nCollect a wandering third instar larva, rinse with ddH2O, and then place it in a drop of HL3-buffer (70 mM NaCl, 5 mM KCl, 20 mM MgCl2, 10 mM NaHCO3, 115 mM sucrose, 5 mM trehalose, 5 mM HEPES; pH 7.1) on an elastomer lined dish.\nUsing a pair of forceps (#5 or 55 forceps) under a dissecting microscope, pin the anterior and posterior ends of the larva dorsal side up, carefully stretching the larva lengthwise with insect pins (Minutein Pins).\nMake an incision just above the posterior pin using a pair of angled iris scissors. Make a vertical cut starting from the incision toward the anterior end of the larva.",
    "Add a few drops of HL-3 buffer if needed. Remove the trachea and the rest of the floating organs without disturbing the CNS. Pin the flaps stretching the body wall to expose the CNS while keeping the neuromuscular system (VNCs, axons, and neuromuscular junctions) intact.\n2. Image acquisition\nOptimize the imaging parameters.\n\t\nTurn on the microscope and lasers before starting dissections. Images must be acquired using an upright confocal microscope with a 40x water immersion lens. Use a 405 nm laser to excite CFP and acquire the images in both the CFP (465-499 nm) and the FRET (535-695 nm) detection channels.\nOptimize acquisition parameters such as scan speed (6), average (2), objective (40x), zoom (1x), pinhole size (1 AU), and spatial resolution (512 x 512). Adjust the gain such that the signal is in the optimal dynamic range. The same parameters must be used for all genotypes.\nImage motor neurons within the VNC.\n\t\nPlace the silicone dish with the dissected sample under the lens. Lower the lens so that it comes in contact with trehalose-sucrose HL3 buffer (see 1.2.1). It is critical to ensure that the lens is completely submerged in the buffer. Add more buffer if required.\nUse the CFP and FRET channels to manually select an optical section that consists of at least 6 motor neurons in focus, located along the VNC midline. The motor neurons are identified based on the expression of the glucose sensor and position along the anterior-posterior axis.\nAcquire images every 10 s for 10 min. These images represent the baseline.\nStimulate with glucose supplemented HL-3.",
    "Remove the trehalose-sucrose containing HL3-buffer using a Pasteur pipette and replace it with 5 mM glucose supplemented HL-3 (70 mM NaCl, 5 mM KCl, 20 mM MgCl2, 10 mM NaHCO3, 115 mM sucrose, 5 mM glucose, 5 mM HEPES, pH 7.1). This step needs to be performed with great care, to avoid the movement of the VNC as much as possible.\nAcquire images every 10 s for another 10 min. These images represent the stimulation phase.\nSave the images as .czi files or any file type supported by the imaging software with a file name including date, genetic background, experimental condition (baseline or stimulation), and channels used.\nReuse the parameters to image all the genotypes (Figure 2A).\n3. Image processing and ROI selection\nOpen the czi files in Fiji/ImageJ and set Color Mode: Grayscale, choose View Stack with: Hyperstack, and select Split Channels into Separate Windows.\nProcess images using the drift correction plugins: turboreg and stackreg. Each channel is corrected separately by selecting Stackreg under Plugins, and then choose Transformation: Translation.\nManually select the Regions of interest (ROIs) to extract the mean gray value of each channel.\n\t\nChoose the ROIs by tracing all motor neurons that remain in focus over the entire time series. Use the ROI manager to save each motor neuron outline.\nUse the Multi-measure function to measure the mean gray value in each ROI at each time point. Copy the ROIs traced from the first channel to the second channel for the pre-stimulation image.\nRepeat this process for the post-stimulation images in each channel using the same cells/ROIs selected for the pre-stimulation image.\n4. Data analysis\nCalculate the FRET/CFP ratio, using the mean gray values for the FRET and CFP channels. Changes in the FRET/CFP ratios reflect alterations in the intracellular glucose concentration.",
    "Plot FRET/CFP ratios for each ROI and time point versus time. Within every VNC some of the ROIs will exhibit a drop in FRET/CFP ratios following stimulation.\n\t\tNOTE: This is interpreted as an inability of some neurons to uptake glucose, possibly due to stress caused by dissections and are therefore eliminated from the analysis. The remaining FRET/CFP ratios for each ROI and time point are averaged to generate a single FRET/CFP ratio per time point per genotype (glucose sensor alone and glucose sensor with TDP-43G298S). These single FRET/CFP ratios are used for all subsequent normalizations. 31 ROIs were analyzed for Glucose Sensor controls and 24 ROIs were analyzed for TDP-43G298S.\nBaseline normalization: Calculate the average of FRET/CFP ratios for the first 10 min (baseline), and then normalize individual FRET/CFP ratios for each time point of the entire experiment to the 10 min baseline average (see Figure 2B).\nTimepoint normalization: Normalize TDP-43G298S FRET/CFP ratios to FRET/CFP ratios from glucose sensor alone at each time point (see Figure 3A).\nBar graphs: For baseline versus stimulation comparisons in the form of bar graphs, use FRET/CFP ratios from 5-10 min (baseline) and 15-20 min (stimulation) for each genotype. Normalize stimulation ratio to the baseline ratio (see Figure 3B).\n5. Statistical analyses\nEvaluate the normalized data sets using Mann-Whitney correction (for baseline and timepoint normalizations) or Kruskall-Walis test (for bar graph representation of stimulation versus baseline FRET/CFP ratios).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}