{
  "id": 8468,
  "origin_website": "Jove",
  "title": "Neuronal Differentiation from Mouse Embryonic Stem Cells In vitro",
  "procedures": [
    "1. Mouse embryonic stem cell culture\nPrepare 0.1% gelatin coated cell culture dishes or plates.\n\t\nAdd 2 mL of sterilized 0.1% gelatin (0.1% w/v in water) to 60 mm cell culture dishes. Rock gently to ensure even coating of the cell culture dishes.\nPut the dishes into a 5% CO2 incubator at 37 °C and allow coating for 1 h.\nRemove the 0.1% gelatin solution before seeding the cells.\n\t\tNOTE: After removing the gelatin, there is no need to dry or wash the coated dishes.\nMouse embryonic stem cells (A2lox and 129) culture\n\t\nIncubate mESCs (A2lox and 129) cells in the 0.1% gelatin coated 60 mm cell culture dishes in mESC growth medium at 37 °C in a 5% CO2 incubator, respectively. The mESC growth medium consists of 85% knock-out DMEM/F12, 15% Knock-out serum replacement (KSR), 0.1 mM β-mercaptoethanol (2ME), 2 mM GlutaMAX, 1% non-essential amino acid (NEAA), 1% penicillin/streptomycin (P/S), 1000 U/mL leukemia inhibitory factor (LIF), 10 nM CHIR-99021 (GSK-3 inhibitor) and 0.33 nM PD0325901 (MEK inhibitor).\n\t\tCAUTION: β-mercaptoethanol is flammable and has inhalation toxicity. Keep away from fire sources and wear a mask to avoid inhalation when use.\nChange the mESC growth medium daily for better growth of A2lox and 129.\nWhen the cells reach 80% confluence, remove the medium and add 1 mL of 0.1% trypsin to the dish. Gently rock for 30 s to ensure even cover of trypsin on all cells.\nLeave the cells for about 1 min to trypsinize and then remove the trypsin using 1 mL pipette.\nAdd 2 mL of mESC growth medium to the dish, pipette up and down several times to make a single cell suspension.\nCount the density of the cells in the suspension as accurately as possible using hemocytometer.",
    "Divide the cells into 7 groups and induce differentiation using different protocols shown in Table 1.\n2. Differentiation from mESCs to NPCs (Phase I)\nPrepare 0.1% gelatin coated cell culture plates or coverslips.\n\t\nBefore use, prepare 0.1% gelatin coated 6-well plates or coverslips as in step 1.1.\nPhase I differentiation using protocol 1 (Table 1)\n\t\nSeed about 2 x 104 mESCs in 2 mL of basal differentiation medium I per well in the 0.1% gelatin-coated 6-well plates. Check the cell density under a microscope.\nIncubate the cells at 37 °C in a 5% CO2 incubator for 6 h to allow for attachment.\nAfter attachment, take out of the cells from incubator, and wash the cells twice with 2 mL of PBS.\nAdd 2 mL of basal differentiation medium I (Table 1) to each well and put the cells back into the incubator.\nLeave the cells for differentiation for 8 days. Replace the basal differentiation medium I every 2 days.\nPhase I differentiation using protocol 2 (Table 1)\n\t\nAdd 1.5 x 106 mESCs into a nonadhesive bacterial dish in 10 mL of basal differentiation medium I to allow for embryoid body formation at 37 °C in a 5% CO2 incubator.\nAfter 2 days, transfer cell aggregates into 15 mL centrifuge tubes and let them settle by gravity.\nRemove the supernatant and add 10 mL of fresh basal differentiation medium I to resuspend the embryoid bodies. Replant them into a new nonadhesive bacterial dish and allow differentiation for another 2 days.\nCheck the formation of embryoid bodies under the microscope (Figure 2A).\nCollect embryoid bodies as described in steps 2.3.2-2.3.3. Seed about 50 embryoid bodies in 2 mL of basal differentiation medium I per well onto 0.1% gelatin-coated 6-well plates.",
    "Prepare 1 mM all-trans RA stock (in DMSO) and store away from light in a -80 °C freezer after sub-packaging.\n\t\tNOTE: RA is unstable, and attention should be paid to keeping it away from light and reducing air contact during preparation of RA stock.\nFor RA induction, add 2 µL of RA stock into each well to make a final concentration of 1 µM.\nPlace the plate into the 5% CO2 incubator at 37 °C and differentiate for another 4 days.\nChange the entire 2 mL of basal differentiation medium I (with 1 µM RA) every 2 days.\nPhase I differentiation using protocol 3 (Table 1)\n\t\nPlant 1.5 x 106 mESCs into a nonadhesive bacterial dish in 10 mL of basal differentiation medium I. Leave for 2 days for embryoid body formation at 37 °C in a 5% CO2 incubator.\nCheck the formation of embryoid bodies under a microscope (Figure 2B).\nTransfer cell aggregates into 15 mL centrifuge tubes and let them settle by gravity.\nRemove the supernatant carefully and add 10 mL of fresh basal differentiation medium I to resuspend them.\nSeed about 50 embryoid bodies into 2 mL of basal differentiation medium I per well onto 0.1% gelatin-coated 6-well plates.\nFor RA induction, add 2 µL of RA stock into each well to make a final concentration of 1 µM.\nPlace the plate into the 5% CO2 incubator at 37 °C and differentiate for another 6 days. Change the entire basal differentiation medium I (with 1 µM RA) every 2 days.\nPhase I differentiation using protocol 4 (Table 1)",
    "Seed about 2 x 104 mESCs within 2 mL of basal differentiation medium I per well onto the 0.1% gelatin-coated 6-well plates. Place the plate into the 5% CO2 incubator at 37 °C to allow for attachment for 6 h.\nAfter attachment, wash the cells twice with 2 mL of PBS. Add 2 mL of basal differentiation medium I to each well and allow for differentiation for 4 days in the 5% CO2 incubator at 37 °C.\nFor RA induction, add 2 µL of all-trans RA stock into each well (the working concentration is 1 µM) to induce differentiation for another 4 days.\nIn the whole process, replace the entire medium every 2 days.\nPhase I differentiation using protocol 5 (Table 1)\n\t\nSeed about 2 x 104 mESCs within 2 mL of basal differentiation medium I per well onto the 0.1% gelatin-coated 6-well plates. Place the plate into the 5% CO2 incubator at 37 °C to allow for attachment for 6 h.\nWash the cells twice with 2 mL of PBS. Add 2 mL of basal differentiation medium I to each well and allow for differentiation for 2 days in the 5% CO2 incubator at 37 °C.\nFor the subsequent RA induction, add 2 µL of RA stock into each well to make a final concentration of 1 µM. Place the plate into the 5% CO2 incubator at 37 °C to induce differentiation for another 6 days.\nIn the whole process, replace the entire medium every 2 days.\nPhase I differentiation using protocol 6 (Table 1)\n\t\nPlant 1.5 x 106 mESCs into a nonadhesive bacterial dish in 10 mL of N2B27 medium II (Table 1) to allow for embryoid bodies formation.",
    "On the 2nd day, collect the cell aggregates as described in steps 2.3.2-2.3.3 and resuspend the embryoid bodies using 10 mL of fresh N2B27 medium II.\nReplant them into a new nonadhesive bacterial dish and allow differentiation for another 2 days in the 5% CO2 incubator at 37 °C. Check the formation of embryoid bodies under microscope.\nOn the 4th day, collect embryoid bodies. Seed about 50 embryoid bodies per well onto 0.1% gelatin-coated 6-well plates with 2 mL of N2B27 medium II.\nAdd 2 µL of all-trans RA stock into each well and induce differentiation for another 4 days. Replace the entire medium (N2B27 medium II with 1 µM RA) every two days.\nPhase I differentiation using protocol 7 (Table 1)\n\t\nSeed about 2 x 104 mESCs within 2 mL of basal differentiation medium I per well onto the 0.1% gelatin-coated 6-well plates. Place the plate into the 5% CO2 incubator at 37 °C to allow for attachment for 6 h.\nWash the cells twice with PBS. Then, add 2 mL of N2B27 medium II to each well and allow for differentiation for 8 days at 37 °C in a 5% CO2 incubator.\nChange the entire N2B27 medium II every 2 days.\n3. Cell morphology observation\nCheck the differentiation status of the above-mentioned 7 groups daily under an inverted phase contrast light microscope.\nRandomly select at least 12 fields and take photos to record the morphological changes of each group on D8.\n4. Immunofluorescence staining\nSample preparation: Seed mESCs on 0.1% gelatin-coated coverslips and allow for differentiation for 8 days using the protocols mentioned in step 2.\nRinse: On the 8th day, take the samples out from the incubator and remove the differentiation medium by aspiration. Gently rinse the cells once with 1 mL of PBS for 5 min.",
    "Fixation: Add 1 mL of 4% paraformaldehyde to each sample and fix the cells for 20 min at room temperature (RT).\nRinse: After fixation, gently rinse the cells with 1 mL of PBS 3 times, for 5 min each.\nPermeabilization: Add 1 mL of 0.2% TritonX-100 in PBS to each sample and leave for 8 min at RT.\nRinse: After permeabilization, gently rinse the cells with 1 mL of PBS 3 times, for 5 min each.\nBlocking: Add 1 mL of 10% goat serum in PBS to each sample and incubate at RT for 1 h to block any non-specific interactions.\nIncubation with primary antibody\n\t\nDilute the anti-Nestin antibody at a ratio of 1:100 using 5% goat serum in PBS.\nApply 500 µL of diluted antibody to different samples and incubate overnight at 4 °C.\nRinse: Remove the antibody and rinse the samples gently with 1 mL of PBS 3 times for 8 min each.\nIncubation with secondary antibody\n\t\nDilute the Alexa Fluor 488-labeled goat anti-mouse IgG at a ratio of 1:500 using 5% goat serum in PBS.\nApply 500 µL of diluted antibody to different samples and incubate in dark for 2 h at RT.\n\t\tNOTE: After applying fluorescent secondary antibody, perform all the subsequent steps in the dark to prevent fluorescence quenching.\nRinse: Remove the secondary antibody and rinse the samples gently with 1 mL of PBS 3 times for 8 min each.\nNuclear staining and mounting\n\t\nPlace one drop of DAPI mounting medium onto the clean microslide.\nCarefully take out of the samples from the plates and place the sample on top of the DAPI mounting medium with the cell face down. Leave in the dark for 5 min at RT.\nRemove excess DAPI mounting medium with absorbent paper.\nFluorescence microscopy observation",
    "Place the specimens under the fluorescence microscopy and detect the signal for DAPI and Alexa Fluor 488 using proper filters.\nEvenly and randomly pick 10-15 different visual fields for each sample and record the images with a CCD camera.\n5. Differentiation from NPCs to neurons (Phase II)\nPrepare mESC derivatives under Phase I differentiation using protocol 3 (8 days, Table 1) as detailed in step 2.4, which has the highest differentiation efficiency (See Figure 3).\n\tNOTE: After phase I differentiation, quality control should be carried out using cell morphology observation and immunofluorescence assay mentioned above, to ensure a healthy and high-yield NPCs.\nSeed about 5 x 105 mESC derivatives within 2 mL of basal differentiation medium I per well onto the 0.1% gelatin-coated 6-well plates. Randomly divide the mESC derivatives into 3 groups, as Phase II protocol 1, protocol 2, and protocol 3, respectively.\nPlace the plate into the 5% CO2 incubator at 37 °C to allow for attachment for 6 h. Wash them twice with 2 mL of PBS.\nAdd 2 mL of basal differentiation medium I, N2B27 medium I and N2B27 medium II (Table 2), respectively, to each well of the above groups.\nPlace the plates into the incubator and allow to differentiate for another 10 days. Change the corresponding medium every 2 days.\nCheck the differentiation status and record the morphological changes as mentioned in step 3.\nOn Day 18, evaluate the generation of neurons (β-Tubulin III positive) and determine the differentiation efficiency of the 3 protocols using in step 4.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}