{
  "id": 19990,
  "origin_website": "Wiley",
  "title": "Transcriptional Profiling of Skeletal Muscle Stem Cells After In Vivo Engraftment into a Heterologous Niche Environment",
  "procedures": [
    "The MuSC niche environment is an important player in the regulation of MuSC function. However, it can be challenging to determine the effect the niche has on the cells outside of the intrinsic changes that may be occurring due to age or a disease state. The method of allogeneic stem cell transplantation relies on a reporter mouse, where the donor cells are labeled with a fluorescent protein such as GFP. These cells will be isolated from the donor mouse using FACS and then injected into a host mouse, where they will be exposed to the new niche for a defined period. Afterward, the donor cells will be reisolated, with the fluorescent protein allowing for the donor cells to be distinguished from the host cells, and RNA-Seq libraries will be generated using SMART-Seq.\nNOTE: All protocols involving animals must be reviewed and approved by the appropriate Animal Care and Use Committee and must follow regulations for the care and use of laboratory animals. Appropriate informed consent is necessary for obtaining and use of human study material.\nMaterials\nHost mice: NOD-Prkdcem26Cd52Il2rgem26Cd22/NjuCrl (NCG) (Charles River)\nRodent anesthesia cocktail (see recipe)\nNormal saline, 0.9% NaCl\nDonor mice: Tg(Pax7-EGFP)#Tajb (Pax7-nGFP) (Sambasivan et al., 2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.877#cpz1877-bib-0041])\n1× PBS\nFACS Digestion Buffer (see recipe)\nHam's F10 medium (Gibco, 11550043)\nFBS\n0.5 M EDTA\nDAPI\nCollagenase D (Sigma Aldrich, 11088882001)\nDispase II (Roche, 4942078001)\nSMART-Seq HT kit (Takara bio, 634456)\nSMART-Seq Reaction buffer (see recipe)\nNextera XT DNA library preparation kit (Illumina, FC-131-1096)\n               \nTD buffer\nNT buffer\nNPM buffer\nATM buffer\nAmpure XP beads (Beckman Coulter, A63880)\nQuant-iT PicoGreen dsDNA Assay kit (Invitrogen, P11496)\nNextera XT Index Kit v2 Set A (96 indexes, 384 samples) (Illumina, FC-131-2001)\nGelGreen dye (41005, Biotium)\nMultiRad225 Irradiation machine (Faxitron)\n6-cm plates\n15-ml polypropylene round-bottom Falcon tubes\nMiniature Tilt Platform (Thermo Fisher, T400110)",
    "40-µm cell strainers (Falcon, C352340)\nFACSAria Fusion cytometer (BD Biosciences)\n0.2-ml PCR tubes 10-μl syringe (Hamilton, 80030)\nC1000 Touch Thermal Cycler (Bio-Rad)\nNext Generation Sequencing Platform (Genome Analyzer)\nIrradiation of host mice\n1. Anesthetize host mice with rodent cocktail (see recipe) by intraperitoneal (IP) injection.\nNOTE: All protocols involving animals must be reviewed and approved by the appropriate Animal Care and Use Committee and must follow regulations for the care and use of laboratory animals.\n2. Once unconscious, place mice into MultiRad 225 irradiation machine such that their hindlimb is within the X-ray field on the turntable. Make sure that the rest of the body is outside the X-ray field, and secure the leg in place with adhesive tape.\n3. On the Multirad225 irradiation machine, set the filter to Cu 0.50 mm, and set the dose to 18 Gy. Press “begin” to administer 18 Gy irradiation to the hindlimb of the host mice.\n4. When irradiation is complete, remove the mice from the machine and perform a subcutaneous injection of 1 ml of saline per mouse for hydration. Keep mice in a 37°C incubator until they regain consciousness post-anesthesia. This procedure should take between 15 and 45 min.\nIsolation of donor cells by fluorescence-activated cell sorting (FACS)\n5. 16-20 hr after the irradiation of host mice, sacrifice donor reporter mice (ex: Pax7-nGFP) by CO2 inhalation in preparation for FACS (Fluorescence-Activated cell sorting).\n6. Dissect the hindlimb muscles of the upper and lower leg, and place in a 6-cm plate containing cold PBS until the dissection is complete. The plate can be kept at room temperature until the next step.\n7. Using forceps, remove visible pieces of fat, tendons, and hair from dissected muscle pieces.",
    "8. Remove PBS and replace with 1 ml fresh PBS. Use scissors to mince the muscle into a slurry.\n9. Transfer muscle slurry to a 15-ml falcon tube and add 6 ml of FACS digestion buffer.\nWhenever transferring cell lysate using a pipette, aspirate some F10 or FBS in and out of the pipette beforehand to coat the pipette and prevent cells from sticking to the pipette walls.\n10. Place tube of muscle slurry in a 37°C/5% CO2 incubator on a miniature rocking platform at 20 rpm for 30 min.\n11. After 30 min, spin down muscle slurry at 600 × g for 30 s to pellet undigested tissue. Released mononuclear cells will remain in the supernatant.\n12. Transfer supernatant to a tube containing 9 ml FBS and keep on ice, then add 4 ml of digestion buffer to remaining undigested tissue.\n13. Perform a second digestion (steps 9-10) for 25 min in a 37°C/5% CO2 incubator.\n14. Combine both digestions and filter through a 40-µm filter into a new tube.\nRinse the cell strainer with F10 medium before and after filtering the digested muscle tissue to prevent cells from remaining stuck to the membrane.\n15. Spin down the samples in a centrifuge for 18 min at 600 × g and 4°C and remove supernatant\n16. Resuspend sample in 1 ml of 2%FBS in PBS (v:v) with 0.5 mM EDTA and 1 µl of 5 mg/ml DAPI\n17. Proceed with flow cytometry, and gate for the GFP+/DAPI- MuSC population (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.877#cpz1877-fig-0003]). For troubleshooting see Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.877#cpz1877-tbl-0002].\nTable 2.\n                Troubleshooting Guide for MuSC Transplantation and SMART-seq\ntable:\n﻿Problem,Possible reason,Solution\nLow number of donor cells isolated,Insufficient digestion,Increase muscle mincing time by 5 min to ensure complete mincing. Increase digestion time by 5-10 min to ensure no visible chunks remain.",
    "FACS machine clogging/sorting slowly,Final cell suspension too thick,\"Ensure that the original dissection and cleaning steps are done properly i.e., remove as much blood, fat, and tendon as possible. Increase the cell resuspension volume and filter an additional time with a 40 µm cell strainer. Do not over-digest the sample (over 1.5 hr) which can lead to excess debris. Increase the concentration of EDTA in the 2% FBP/PBS (v:v) FACS buffer from 0.5 mM to 1 mM.\"\nInsufficient/No engraftment,Missed injection,Alter the angle of injection. Make sure to inject into at least 2 different injection sites within the TA muscle in case one fails. Ensure the needle is not being pushed too deep or too far towards the extremities of the TA muscle.\n,Low cell viability,Make sure to inject isolated MuSCs into host mice immediately after sorting with as little waiting time as possible to prevent MuSC activation and cell death.\nDeath of NCG host mice after transplantation,Injection site infection,Make sure to use sterile tools when handling NCG mice. Treat injection site with antibiotic cream after injection.\n,Mice were not positioned properly in the irradiation machine,\"Make sure to position only one lower hindlimb of the mice within the field of irradiation, with the contralateral leg, tail, head, and body outside the field of irradiation.\"\nLow cDNA yield after SMART-Seq reverse transcription,Cells were not sorted into 0.2-ml tube,\"Make sure flow cytometry machine is calibrated to sort directly into a 0.2-ml tube. If necessary, perform a test whereby sheath liquid is sorted onto the closed cap of the 0.2-ml tube to visualize sorting accuracy\"\n,Insufficient number of PCR cycles,\"Different numbers of T21 cells will require differing amounts of PCR cycles. Perform a troubleshooting experiment by varying PCR cycles for a known number of cells, followed by quantification, if necessary.\"",
    ",Insufficient elution from Ampure XP Beads,\"Do not over-dry Ampure beads after washing, since this renders elution more difficult. If Ampure beads clump after the addition of elution buffer instead of becoming a homogenous solution, this is a sign of over-dried beads. If beads are suspected of being overdried, apply the elution buffer and place tubes at 42°C for 20 min with intermittent shaking to promote better elution.\"\n,Lengthy processing time,Process the MuSC RNA into cDNA immediately after the FACS sort. Reducing the wait time as much as possible prevents mRNA degradation.\nLow library yield after Nextera XT,Inaccurate timing for the incubation with Tn5 transposase,Do not leave samples incubating with Tn5 transposase for longer than 5 min due to the possibility of over-digesting the cDNA. Make sure to add the neutralizing NT buffer as quickly as possible after the tagmentation step is complete.\n,Insufficient elution from Ampure XP Beads,\"Do not over-dry Ampure beads after washing, since this renders elution more difficult. If Ampure beads clump after the addition of elution buffer instead of becoming a homogenous solution, this is a sign of over-dried beads. If beads are suspected of being overdried, apply the elution buffer and place tubes at 42°C for 20 min with intermittent shaking to promote better elution.\"\nInjection of donor MuSCs into the host mice\n18. Sort at least 10,000 cells per mouse into a 1.5-ml tube containing 200 µl of 2% FBS/PBS (v:v).\n19. Spin down cells for 10 min at 600 × g and 4°C and resuspend in the appropriate volume (20 µl per mouse) of 2% FBS/PBS (v:v) for injections\n20. Retrieve irradiated recipient mice from steps 1-4 and anesthetize them with isoflurane by placing them in an isoflurane induction chamber.",
    "21. Clean the irradiated hindlimb with ethanol and use a Hamilton syringe to inject the donor MuSCs into the tibialis anterior (TA) muscle of the recipient mouse. Transplantation can be done with two injections of 10 µl each.\nInject at a 45° angle aiming towards the center, or the thickest part of the TA. Use a straight motion to inject, to avoid injuring the TA muscle.\n22. After injection, cover the site with a dollop of antibiotic cream. For troubleshooting see Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.877#cpz1877-tbl-0002].\nRNA-Seq library preparation from low cell numbers using SMART-Seq\n23. This step should be done in tandem with the FACS in step 18. Sort MuSCs (1000 at T0 or between 30 and 1000 engrafted cells at T21) into a 0.2-ml PCR tube containing 1× SMART-Seq buffer\nClean workspace and pipettes with an RNase decontamination solution before processing the cell lysate into cDNA.\nTo avoid discrepancies between samples sorted at different times, we recommend sorting 1000 cells of each sample first and then proceed with the remaining sort for the transplantation.\n24. Proceed immediately with primer annealing and cDNA synthesis as described in the SMART-Seq HT user manual.\n25. Amplify the cDNA with the appropriate number of PCR cycles.\nWe recommend 11 cycles for 1000 MuSCs.\nPAUSE POINT: Once converted into cDNA, samples can be left at 4°C overnight and purified the following day.\n26. Purify cDNA libraries using Ampure XP at a 1:1 ratio as described in the SMART-Seq HT Kit user manual.\nPAUSE POINT: Purified cDNA can be stored at 4°C for up to 3 days, or at −20°C for longer periods until ready for Nextera library preparation.\nNextera library preparation\n27. Quantify cDNA using the Quant-iT PicoGreen dsDNA Assay Kit following the manufacturer's instructions.",
    "28. Transfer 0.15 ng cDNA to a new tube for processing with Nextera XT.\n29. Fill tube to 1.25 µl with nuclease-free water.\n30. Add 2.5 µl TD buffer and 1.25 µl ATM to each sample.\n31. Incubate in thermocycler for 5 min at 56°C to perform tagmentation.\n32. Add 1.25 µl NT buffer and incubate for 5 min at room temperature to neutralize the tagmentation reaction.\nAdd NT buffer immediately after the tagmentation reaction is completed. Any delay in halting the ATM reaction can lead to over-tagmentation and a reduction in library size.\n33. Add 1.25 µl of each Nextera adapter (i5 and i7) and 3.25 µl NPM buffer, and proceed with 12 rounds of PCR as described in the Nextera XT DNA Library Prep Kit user guide.\nConsult the Illumina Index Adapters Pooling Guide (https://support.illumina.com/downloads/index-adapters-pooling-guide-1000000041074.html[href=https://support.illumina.com/downloads/index-adapters-pooling-guide-1000000041074.html]) to select appropriate adapters such that color balance is maintained when sequencing.\nPAUSE POINT: After PCR, samples can remain at 4°C for up to 2 days, or at −20°C for a longer period until purification.\n34. Purify sequencing-ready libraries with Ampure XP beads at a 1:0.85 (sample v: bead v) ratio.\n35. Before sending samples out for Bioanalyzer analysis and sequencing, we recommend quantifying libraries in-house with Quant-iT PicoGreen and running 8-10 ng of sequencing-ready libraries on a 1.25% agarose gel prepared with the GelGreen highly sensitive DNA staining solution, as a quality control step for library size. Libraries should be between 200 and 600 bp, concentrated around 450 bp. For troubleshooting see Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.877#cpz1877-tbl-0002].\nRe-isolation of engrafted cells from the host mice (21 days post-transplantation)",
    "36. Repeat steps 6-17 to isolate donor cells from the host mice. However, dissect only the tibialis anterior (TA) and nearby lower hindlimb muscles surrounding the injection site because the injection was made directly into the TA muscle. Given that MuSCs do not migrate far from the injection site, there are unlikely to be any GFP+ cells in more distal muscles.\nUse the previous T0 FACS gating template to visualize where donor GFP+ cells should appear. Use the contralateral un-irradiated host hindlimb as a negative control for background signal during FACS.\n37. Sort GFP+ re-isolated donor cells into a 0.2-ml tube containing 1× SMART-Seq reaction buffer\n38. Immediately process lysed cells into cDNA using SMART-Seq and Nextera XT as described in step 23 onward. Use the following as a guide for the quantity of SMART-Seq PCR cycles required depending on the number of cells isolated:\n         \n1000 cells: 11 cycles\n500-1000 cells: 12 cycles\n150-500 cells: 14 cycles\n100-150 cells: 15 cycles\n50-100 cells: 16 cycles\n30-50 cells: 17 cycles"
  ],
  "subjectAreas": [
    "Stem Cell Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}