{
  "id": 15799,
  "origin_website": "Jove",
  "title": "A Mass Spectrometry-Based Approach to Identify Phosphoprotein Phosphatases and their Interactors",
  "procedures": [
    "NOTE: The generation of PIBs is done as described by Moorhead et al., where 1 mg of microcystin and about 6 mL of sepharose are coupled to generate PIBs with a binding capacity of up to 5 mg/mL17.\n1. Sample preparation\nNOTE: A typical starting amount for PIB-MS is 1 mg of total protein per condition. For this experiment, approximately 2.5 x 106 HeLa cells were used to extract 1 mg of protein. This calculation should be performed for each cell line or tissue being used in an experiment18. If the sample is limited and 1 mg cannot be obtained, the amount of input can be reduced with a minor loss of PPP subunit detection. Alternatively, TMT labeling can be employed to allow the mixing of all conditions in one sample, increasing the sensitivity of detection as shown in Step 9.\nCollect tissue samples or cell pellets. For cell pellets, collect cells by centrifugation at 277 x g for 2 min at room temperature (RT), remove media, and wash the cells with 5 mL of phosphate-buffered saline (PBS). Cell pellets may be stored at -80 °C for several months.\nPrepare lysis buffer (500 mM NaCl, 50 mM Tris-HCl pH 7.5, 0.5% Triton X-100 (vol/vol), 5 mM beta-glycerophosphoric acid disodium salt pentahydrate, 1:500 (vol/vol) protease inhibitor cocktail III) and keep on ice. Make enough to lyse and wash all the samples. If starting with 1 mg of protein per condition, make about 3 mL of buffer per sample for lysis and washes.",
    "NOTE: The lysis buffer noted in this step is a mild detergent solution, which may not be sufficient to solubilize insoluble membrane or cytoskeletal-associated proteins. Other detergents could be explored to improve solubilization. A range of NaCl and Triton-X-100 concentrations were tested, and the above concentrations were found to be optimal for low background and high phosphatase subunit binding.\nAdd chilled lysis buffer to the samples. For lysis of 1 mg of protein, use 1 mL of buffer. If the sample is frozen, add lysis buffer and let the sample thaw on ice in the buffer.\n\t\nFor cells, homogenize the samples via sonification, keeping the cells on ice between pulses. Sonicate the samples at 15% amplitude with three 15 s pulses. This may vary based on the sonicator used (see Table of Materials).\nFor tissues, homogenize the samples first using a Dounce tissue grinder to grind the tissue until liquified before sonicating as described in Step 1.3.1.\nClarify the homogenized sample of insoluble debris by centrifugation at 21,130 x g for 15 min at 4 °C. Then, without disturbing the formed pellets or lipids that have collected on the side of the tubes, transfer the lysates to new tubes. Remove 100 µL of the pre-enrichment sample of the clarified lysate if desired and store at -20 °C. Be sure to keep the lysates on ice.\nDetermine the total protein content in each sample by performing a protein quantification assay, such as a bicinchoninic acid assay (BCA), on a small aliquot of each sample, according to the manufacturer's instructions. Ensure the lysates are kept on ice during the BCA assay.",
    "After performing the BCA assay, transfer an equivalent amount of protein to new tubes and dilute with lysis buffer to ensure each tube has the same concentration of protein (e.g., 1 mg/mL). If the experiment requires a PPP inhibitor control, prepare two aliquots of each sample that have the same protein content and proceed to Step 1.7. If PPP inhibitor controls are not needed, skip to Step 2. Ensure samples are kept on ice.\n\tNOTE: It is critical that equal protein concentrations are used per condition in a PIB-MS analysis. PPP inhibitor controls are used to distinguish specific binders to PIBs from the non-specific background.\nFor the PPP inhibitor control, treat one sample with free MCLR (1 µM) and the other one with an equal volume of DMSO as a control. Vortex the samples gently and incubate them on ice for 15 min.\n\t​NOTE: MCLR treatment of the lysates blocks the binding of PPP catalytic subunits but not proteins that bind non-specifically to PIBs in the samples. Be cautious when handling MCLR as it is toxic. Refer to handling precautions in the Table of Materials.\n2. Preparation of PIBs\nDetermine the amount of PIBs needed for the experiment. For 1 mg of protein, 1-3 µg of PPPs and interacting proteins can be obtained; use at least 10 µL of solid PIBs resin per sample to minimize bead loss. The binding capacity of PIBs is 3-5 mg/mL14,17.\nTransfer the appropriate amount of PIBs to a 1.5 mL tube and wash them 3x with 0.5 mL of lysis buffer by gently vortexing and then centrifuging at 376 x g for 30 s at RT in between washes. Avoid pipetting up the beads when removing lysis buffer between washes.",
    "Make a 50% PIB/buffer solution (vol/vol) by adding an appropriate amount of lysis buffer to the washed PIBs. Gently pipet up and down and swirl the pipet tip in the slurry to resuspend the PIBs.\nTransfer 20 µL of the slurry to a new 1.5 mL tube already containing 0.5 mL of lysis buffer. The lysis buffer in the tube helps in expelling the beads from the pipet tip. Do this until there are enough tubes containing an equal amount of PIBs for each sample.\nSpin the tubes at 376 x g for 30 s at RT. Make sure all tubes contain an equal amount of bead resin. Discard any supernatant, only leaving solid resin and a maximum of 50 µL of lysis buffer in each tube.\n3. Incubation of PIBs with lysates\nTransfer the lysates from Step 1.6. or Step 1.7. to the appropriately labeled tube containing PIBs from Step 2. Rotate the lysate at 8 rpm with the PIBs for 1 h at 4 °C.\n4. Washing of PIBs\nCentrifuge the PIBs at 376 x g for 30 s at 4 °C to collect the beads. Remove and discard the supernatant, saving a 100 µL aliquot for post-enrichment analysis, if desired.\nWash the PIBs 3x by adding 0.5 mL of lysis buffer to the beads, inverting the tubes (vortexing not recommended), collecting the beads by centrifugation at 376 x g for 30 s at 4 °C, and removing the lysis buffer from the settled beads, being careful not to disrupt the bead pellet.\n5. Elution of PPPs from the PIBs",
    "After the final wash, remove as much of the lysis buffer as possible without pipetting up any of the PIBs. Make elution buffer containing 2% SDS (vol/vol) and elute the PPPs from the PIBs by adding enough volume of elution buffer to be 4x-5x the volume of PIBs. For example, if 10 µL of PIBs are used, use 50 µL of elution buffer. Incubate the PIBs with the elution buffer at 65 °C for 1 h to elute the PPPs from the PIBs.\nAfter elution, collect the eluate by centrifuging the tubes at 376 x g for 30 s at RT and pipetting the eluate into a separate tube, being careful not to transfer any PIBs. Use the eluate for western blot analysis or for mass spectrometry analyses. Eluates can be stored at -20 °C for up to several months.\nTo regenerate the PIBs for further use, incubate the beads in 2% SDS (vol/vol), rotating at 8 rpm at RT for 1 h. Wash them 3x-5x in 25 mM Tris-HCl (pH 7.5) with rotation for 30 min per wash. After all washes, store PIBs in 25 mM Tris-HCl (pH 7.5) storage buffer with sodium azide (0.05% wt/vol).\nAnalyze the eluates by western blotting or mass spectrometry. The mass spectrometry analysis of PIB eluates is described below.\n6. Removal of detergents\nNOTE: Various approaches can be used to remove detergent from eluate samples for MS analysis. We found that single-pot, solid-phase-enhanced sample-preparation (SP3), described by Hughes et al., works well19.\nAdd 0.5 µL of SP3 beads to 50 µL of eluate from Step 5.2 above. Use SP3 beads at a ratio of 10:1 (µg:µg) or at least 0.5 µg/µL (stock solution is 50 µg/µL). Gently vortex the beads and eluate.",
    "Add one elution volume of 100% ethanol to the bead-eluate mixture (e.g., if 50 µL of the eluate was used, use 50 µL of 100% ethanol). Incubate the samples for 5 min in a thermomixer set to shake at 1000 rpm at 24 °C.\nTo collect all the beads, place them in a magnetic tube rack. Once the beads collect, discard the supernatant and wash the beads with 0.5 mL of 80% ethanol (vol/vol) 3x. For washing, resuspend the beads by vortexing, collect the beads by placing them in the magnetic tube rack, and discard the supernatant between washes.\nWash the beads one more time with 0.5 mL of 100% acetonitrile (ACN) to remove all traces of ethanol, removing as much ACN as possible. \n7. Digestion of proteins\nMake a 1:100 dilution of trypsin (final concentration of 0.004 µg/µL) in 166 mM HEPES (pH 8.5) and add 30 µL of this trypsin solution to each tube with the beads, resuspending by vortexing.\nIncubate the SP3-trypsin bead mixture in the thermomixer at 1000 rpm at 37 °C for 5 h or overnight at 30 °C. Place the tubes in the magnetic rack to collect the beads and remove the digests to new tubes.\nFor label-free analysis, quench the reaction by adding 20% trifluoroacetic acid (TFA) (vol/vol) to a final concentration of 0.2% TFA (vol/vol). Check that the pH of each sample is between 2-3 with a pH paper. If not, add small additional aliquots of 20% TFA until this is achieved. The samples must be appropriately acidified prior to desalting. Continue to Step 8.\nFor TMT labeling of the samples, do not acidify and continue to Step 9.\n8. Desalting the digest",
    "Prepare a stage tip for each sample by packing a 200 µL of MS solvent compatible tip with C18 resin as described by Rappsilber et al.20. Use a blunt-ended needle to press two C18 material disks, ensuring that the disks remain in the needle. Transfer the disks into the MS solvent compatible tip using a thin wire plunger to expel the discs from the needle.\n\tNOTE: It is critical to use MS solvent compatible tips from this point in the protocol since other pipet tips may leach chemicals into the samples that can be detected via mass spectrometry.\nEquilibrate each stage tip with 30 µL of 100% MeOH, then with 30 µL of 60% MeOH (vol/vol), followed by 30 µL of 0.1% TFA (vol/vol). Push each solution through the stage tip with a syringe. Attach a pipet tip to the end of a syringe with a transparent film to increase contact between the syringe and stage tip if needed. Be sure to never let the C18 material inside the stage tip to go dry.\nAdd acidified peptide digest from step 7.3 to the labeled stage tip and push through the stage tip with a syringe, again being careful not to let the stage tip go completely dry.\nWash each sample 2x with 30 µL of 0.1% TFA (vol/vol). Elute the peptides from each stage tip by adding 30 µL of 60% MeOH (vol/vol) to each stage tip and expelling it all from the tip with syringe pressure into a new, labeled tube. This is the only step where the C18 material is completely dried.",
    "Dry each sample by vacuum centrifugation. Dried peptides can be stored at -20°C for several months. The samples are now ready for label-free mass spectrometry analysis. Use only half of the sample for analysis on the mass spectrometer and the other half for reinjection if needed. Ensure the use of an appropriate mass spectrometer method for analysis.\n9. TMT labeling\nNOTE: Tandem-mass tag labeling is used to multiplex samples for quantitative analysis. A 0.8 mg vial of TMT reagent is sufficient for labeling up to 0.8 mg of protein21. In a PIB pulldown experiment starting with 1 mg of protein, 1-3 µg of phosphoprotein subunits are obtained. The protocol below is optimal for up to 10 µg of protein.\nReconstitute one 0.8 mg vial of TMT reagent in 80 µL of anhydrous ACN.\nLabel each sample from Step 7.4 with a different TMT label for up to 18 channels. Be sure to note which TMT label is added to each sample. Add 2 µL of the TMT reagent and 2 µL of ACN to the peptide digest, vortex gently to mix, centrifuge at 376 x g for 30 s at RT to collect the sample, and incubate at RT for 1 h to label the sample.\nTo test the TMT labeling efficiency, make a label check sample by combining 1 µL of each labeling reaction in a 0.5 mL tube containing 9 µL of LC-MS grade water and 1 µL of 10% hydroxylamine (vol/vol) to quench the reaction. Place the remaining unquenched labeled samples in a -80 °C freezer. Samples can be stored for several days while the labeling efficiency is evaluated.",
    "Acidify the TMT label check sample by adding 30 µL of 0.1% TFA (vol/vol). Check that the pH is between 2-3. If not, add 20% TFA (vol/vol) until this pH is achieved. Desalt the label check sample via stage tipping, as described in Steps 8.1.-8.5.\nAnalyze the TMT label check sample on the mass spectrometer to evaluate labeling efficiency. Filter the search results to a 1% false discovery rate (FDR) on the peptide level and determine the labeling efficiency21,22.\nFully TMT-labeled peptides have TMT reagent at the N-terminus and at all lysines. Quantify the TMT reporter ion intensities and compare their total sum across all channels. The sample is sufficiently labeled when >95% of all peptides are labeled and the TMT reporter ion sum intensities are comparable\n\tNOTE: Besides incomplete labeling, differences in summed TMT reporter ion intensities could be the result of inaccurate pipetting of the 1 µL test sample. It could also reflect a true biological observation, in which case all replicates should display the same behavior.\nRemove the unquenched samples from -80 °C storage and thaw them. If they are not fully labeled, add 1 µL of the appropriate TMT reagent to the sample as noted above, incubate for 1 h, and repeat the TMT label check. If the samples are fully labeled, continue to Step 9.8.\nWhen fully labeled, add 2 µL of 10% hydroxylamine (vol/vol) to the TMT reactions to quench the labeling. Incubate the samples at RT for 15 min. Once quenched, the samples can be stored at -80 °C for several months.",
    "Combine all quenched TMT channels and add 2 µL of 20% TFA (vol/vol) to acidify the reaction. Check the pH of the combined reaction, ensuring it is between pH 2-3. If not, add small aliquots of 20% TFA until the desired pH is reached. This is critical for proper desalting.\nRemove ACN by vacuum centrifugation for 30 min and desalt the sample as described below.\n10. Desalting the TMT-labeled combined sample\nUse an SPE C18 desalting plate with the appropriate protein capacity (2 mg sorbent is usually sufficient for this application) to desalt the combined TMT reagent. Equilibrate the well with 200 µL of 60% MeOH (vol/vol) and 200 µL of 10% MeOH/0.1% TFA (vol/vol).\nLoad the acidified TMT-labeled peptides from Step 9.10. onto the desalting plate. Wash the sample wells 2x with 200 µL of 10% MeOH/0.1% TFA (vol/vol).\nElute the peptides with 100 µL of 60% MeOH (vol/vol). Dry the samples by vacuum centrifugation. The dried, TMT-labeled sample can be stored at -80 °C for several months.\nFor mass spectrometry analysis of the TMT labeled sample, inject half of the sample and save the other half if reinjection is required.\n\t​NOTE: Injection amounts on the mass spectrometry will vary depending on the specific column, instrument setup, and sample type.\n11. Data analysis\nNOTE: Methods of data filtering and analysis vary and are beyond the scope of this protocol, but the following notes on analysis are included to provide guidance specific to the type of data resulting from this protocol.\nSearch raw mass spectrometry data against a species-specific proteome database based on the origin of the sample cells or tissue used. Here, Comet was used as a search algorithm23.",
    "Filter the search results with a 1% FDR by adjusting the search algorithm-specific parameters22. For label-free quantification, use MS1 peak area measurements to quantify the data. For TMT-labeled samples, use MSn-derived reporter ion intensities for quantification. For statistical significance, analyze the samples in biological triplicates.\nTo de novo identify PPP subunits and their interactors, ensure that triplicate biological samples of MCLR-inhibited and DMSO-treated samples are compared. To compare the PPPome under different conditions or upon drug treatment, ensure that biological triplicates of each condition or drug treatment were generated.\nFilter the data so that only proteins with a total peptide count >1 in at least two of three DMSO control-treated samples are present. MCLR competition does not always compete off all catalytic subunit binding. Also, some PPP catalytic subunits might non-specifically stick to the sepharose resin. To account for either possibility while filtering out proteins that non-specifically bind to the resin, remove proteins with a total peptide count in the MCLR-treated condition higher than that for any PPP catalytic subunit.\nExclude common contaminants, such as keratin, collagen, 40S and 60S ribosomal proteins, and heterogeneous nuclear ribonucleoproteins that are not PPP subunits, from the analysis14.\nImport filtered data into Perseus by clicking Generic Matrix Upload in the Load section24,25. Log2 transform the data by going to Basic > Transform, selecting the data, and specifying the transformation function, in this case log2(x).\nImpute missing values from a normal distribution by going to Imputation > Replace Missing Values from Normal Distribution, selecting the data, and specifying the width (default 0.3) and the down shift (default 1.8) for the calculation. Perform quantile normalization by going to Normalize > Quantile Normalization.",
    "Calculate log2 ratios and Student's T-test p-values for the respective conditions. First, annotate the data by going to Annot. Rows > Categorical Annotation Rows. Perform the T-test by going to Tests > Two-sample Tests, and selecting the groups to compare, the test to perform, and the method for multiple hypothesis testing correction as used for truncation.\n\tNOTE: For de novo identification, a protein is considered a PPP-interacting protein if its abundance is statistically significant in the MCLR-treated versus DMSO condition, with a log2-fold change greater than the minimum fold change of any specifically-bound known PPP subunit.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}