{
  "id": 6399,
  "origin_website": "Bio",
  "title": "Cell Microencapsulation and Cryopreservation with Low Molecular Weight Hyaluronan and Dimethyl Sulfoxide",
  "procedures": [
    "Thawing and cell culture conditionsWhen required, recover the D1 mesenchymal stem cells (D1MSC) and murine myoblast cells (C2C12) by rapidly thawing cryovials in a 37 °C water bath until no ice is observed (4-5 min). Next, take cryovials into a laminar flow hood, transfer each cell suspension into a 50 ml conical centrifuge tube and dilute samples with 10 ml of complete culture medium.Spin the cell suspensions, remove the supernatant and resuspend each cell pellet with 20 ml of culture medium.Then, place each cell suspension separately into T-175 flasks and incubate them at 37 °C in a humidified 5% CO2/95% air atmosphere.Cultivate the cells in as many T-175 flasks as needed depending on the cell density that will be used for encapsulation, and the final volume of the batch that will be fabricated. Cells should be passaged when cell confluency is around 70% (every 2-3 days if 1 x 106 cells are seeded in a T-175 flask).Preparation of different cell suspension in alginate for microencapsulationRemove culture medium from the T-175 flasks, add 5 ml of PBS and remove again to take away remains of culture medium. Add 5 ml of 0.25% trypsin and keep the flasks in the incubator at 37 °C for 2-5 min, after which, gently tap the side of the flask to dislodge the cells. Remove cell suspension from the cell culture flask and transfer into a 50 ml conical flask.Filter the cell suspension through a 40 µm filter to remove cell aggregations and count the cells with an automatic cell counter or alternatively with a Neubauer Chamber.Collect the volume of cell suspension to get the final cell amount required for cell encapsulation.Spin the collected cell suspension (100 x g for 5 min) and discard the supernatant carefully.Resuspend cells by adding the needed volume of 1.",
    "5% alginate LVG solution (see Recipes) carefully to get 5 x 106 cells per ml of alginate density (for a 4 ml batch, 2 x 107 cells are needed). Revolve cell suspension softly using a sterile spatula to homogenize it.Note: Each cell type is microencapsulated separately in this protocol. Cells microencapsulationTransfer the alginate cell suspension into a 10 ml sterile syringe avoiding the formation of bubbles. Place the syringe into a peristaltic pump (Figure 1A) (Video 1). <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Electrostatic droplet generator assembly Note: All the microencapsulation procedure is performed in a biosafety cabinet. Connect the syringe to the stainless steel needle tip (inner diameter 0.17 mm) with a silicone tube of 40 cm (Figure 1B).Fill the sterile beaker (80 mm diameter, 40 mm height and 80 ml volume) containing a small magnetic stirrer with 80 ml of the sterile calcium chloride gelling solution and place it under the needle (see Recipes). Set up magnetic stirring to 200 rpm (this would keep the microcapsules separated during the gelling procedure).For a 380 µm diameter microcapsules, place the needle holder at 7 cm of height (Figure 1C), and be sure that the distance between the needle tip and the calcium chloride solution is of 2 cm. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190214/20190214193529_9518.jpgFigure 1. Cell microencapsulation in detail. A. Peristaltic pump set at 5.9 ml/h. B. Complete set-up of the Nisco® microcapsules generator. C. Detail of the set-up of the needle and its holder.Place the stainless steel stick inside the gelling bath and connect the electrode of the microcapsules generator.For 380 ± 10 µm diameter alginate microcapsules, set up the conditions of voltage (7 kV) and flow rate in the peristaltic pump (5.9 ml/h). Note: With the described conditions we obtain 380 ± 10 µm diameter alginate microcapsules that will slightly increase in diameter after coating.",
    "The bead diameter will decrease with smaller needle diameter and increasing voltage. Close the electrical safety cage (otherwise the system will not work). Push the syringe manually until the alginate suspension reaches the tip of the nozzle (to take out the air from the silicone tube) and start the peristaltic pump at 5.9 ml/h speed. Let the alginate solution to be pushed out into the beaker through the nozzle.When the syringe is empty, stop the flow of the pump and let the alginate microcapsules mixing with a magnetic stir at 200 rpm in the calcium chloride solution for at least 10 min for complete gelation. Collect microcapsules from calcium chloride solution by filtering the solution through a 100 µm strainer.Invert the 100 µm strainer and place it on the top of a conical tube.Next, collect microcapsules adding 10 ml of complete culture solution to the bottom of the strainer which is upside down. Transfer the microcapsules into a T-75 flask with a pipette and add another 10 ml of complete medium.To confirm microcapsules integrity, shape, and homogeneity, observe them under an inverted microscope by phase contrast. Keep the flask in an incubator at 37 °C in a humidified 5% CO2/95% air atmosphere for further studies (Figure 2).Note: These microencapsulated cell types can be maintained in culture for at least 2 months. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190214/20190214193553_8695.jpgFigure 2. (A) C2C12 and (B) D1MSC cells in alginate microcapsules. Scale bar: 200 µm.Preparation and conditions for the cryopreservation processPrecool the different CPA solutions to 4 °C (see Recipes). Precool the CoolCell® container to 4 °C keeping in a fridge for more than 30 min. Label 2 ml cryovials and let them on ice at 4 °C.Cryopreservation processCollect microcapsules from the T-75 flask and place them into a 1.5 ml Eppendorf tube.",
    "Let them sediment by gravity, and repeat this process until 200 µl of microcapsules are obtained. Next, remove the medium with a pipette (Figure 3). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190214/20190214193617_3029.jpgFigure 3. Sedimentation of microcapsules by gravityAdd 1 ml of precooled CPA solution to the Eppendorf tubes (see Recipes).Note: CPA solutions can be prepared fresh, or they can be stored at most for 1 week at 4 °C. Transfer the microcapsules suspension to the 2 ml cryovials and keep them on ice 20 min (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190214/20190214193633_2999.jpgFigure 4. Chilling samples before cryopreservationTransfer the cryovials to the chilled Coolcell® containers.Introduce the containers in a -80 °C freezer for the slow controlled cooling of the samples, and keep them overnight.Next day, take out the Coolcell® container from the -80 °C freezer and transfer the cryovials to a liquid nitrogen tank for long-term storage.Microencapsulated cells recoveryCarefully take out the cryovials from the liquid nitrogen tank. Transfer them as quick as possible to a 37 °C water bath for fast thawing.Move them softly in the water bath (3-5 min) trying to avoid the contact of the water with the cryovial lids to avoid contamination risk. On this regard, hold the cryovials from the tips or place them with a polyester holder that avoids tip contact with water.Transfer microcapsules from cryovials into 15 ml conical tubes, and dilute them adding 10 ml of culture medium at room temperature to the 15 ml tube drop by drop. Let the microcapsules to sediment by gravity and then remove the medium. Repeat the process at least twice.Add culture medium at 37 °C and incubate the microcapsules in a T-75 flask at 37 °C in a humidified 5% CO2/95% air atmosphere.Viability assessment of encapsulated cells under fluorescent microscopyCollect 20 µl of microcapsules from the T-75 flask and place it into a 1.",
    "5 ml Eppendorf tube. Let sediment by gravity and remove the medium. Rinse the microcapsules three times (letting microcapsules settle by gravity) each with 1 ml of DPBS containing Ca2+ and Mg2+.Dilute rinsed microcapsules with 300 µl of calcein/ethidium staining solution for microscopy (see Recipes).Dispense this staining solution containing microcapsules into 3 wells of a 96-well plate (approximately 100 µl solution/well).Incubate at room temperature for 45 min protected from light. Assess under a fluorescent microscope the viability of encapsulated cells (Figure 5). Calcein (excitation 495 nm, emission 515 nm for viable cells) and ethidium (excitation 495 nm, emission 635 nm). The fluorescence from these dyes may be observed separately; calcein with a standard fluorescein bandpass filter and ethidium with filters for propidium iodide or Texas Red® dye.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190214/20190214193654_6935.jpgFigure 5. Micrographs of calcein/ethidium stained cryopreserved microencapsulated cells 7 days in culture after thawing. Scale bars: 200 µm.Determination of the metabolic activity of microencapsulated cellsCollect 50 µl of microcapsules from the T-75 flask and place it into a 1.5 ml Eppendorf tube and let it sediment by gravity, and next remove the medium. Resuspend the encapsulated cells in 700 µl of complete culture medium.Dispense this solution containing the microcapsules into 7 wells of a 96-well plate (100 µl solution/well). Also, dispense 100 µl of just complete culture medium into 2 wells (negative control).Add 10 µl of solution for viability quantification (CCK-8) into each well.Incubate the 96 well-plate inside a wet chamber on an incubator for 4 h at 37 °C.After 4 h, transfer the supernatants into another 96-well plate.Measure the absorbance at 450 nm with reference wavelength at 650 nm using Infinite® M200 microplate reader or another microplate reader (Figure 6). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190214/20190214193710_1480.jpgFigure 6.",
    "Metabolic activity of cryopreserved microencapsulated (A) C2C12 and (B) D1MSC cells on Days 1 and 7 after thawing Viability quantification of microencapsulated cells by flow cytometryCollect 100 µl of microcapsule, corresponding to 5 x 105 cells, from the T-75 flask and place it into a 1.5 ml Eppendorf tube and let it sediment by gravity, remove next to the medium.Rinse twice the microcapsules with DPBS.Remove the supernatant and add 100 µl of 1% sodium citrate (see Recipes). Pipette up and down until microcapsules are dissolved.Filter the sample through a 40 µm cell strainer into different 15 ml conical tubes. Centrifuge the tubes at 100 x g for 10 min and discard the supernatant to remove the rests of alginate. Add the staining solution (1 ml for each sample) and incubate them for 20 min protected from light (see Recipes). Control samples are needed for cytometer calibrating (one without dyes, other with calcein and another one with ethidium). Transfer samples to 5 ml round bottom tubes to quantify cell viability in the FACS Calibur flow cytometerTM (Figure 7).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190214/20190214193728_8717.jpgFigure 7. Quantification of dead cells in cryopreserved microencapsulated (A) C2C12 and (B) D1MSC cells on Days 1 and 7 after thawing. Values represent mean ± SD. **: P ˂ 0.01 and ***: P ˂ 0.001 compared to HA 5%."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}