{
  "id": 5431,
  "origin_website": "Bio",
  "title": "Rubisco Extraction and Purification from Diatoms",
  "procedures": [
    "Total soluble cellular (crude) protein extraction – suitable for measurement of the Michaelis constant for CO2 (KC), catalytic turnover rate (kcatc) and the first step for CO2/O2 specificity assays (SC/O).Diatoms are grown in 2 L batch cultures at 20 °C under continuous light (c. 150 μmol photons m-2 sec-1) in sterile seawater to which 0.2 μM filtered nutrients, vitamins and trace metals were added to give the final concentrations as defined in the Aquil medium. For a full recipe and guidelines for making Aquil recipe, see Sunda et al., 2005. Growth rates are monitored by cell counting using a Coulter Counter. During exponential growth, cells are concentrated to a pellet via gentle centrifugation (2,000 x g for 10 min) at 15 °C and the supernatant discarded. Approximately 1 g of a cell pellet is required to purify Rubisco for measuring SC/O. To limit storage space, collect cells into 1.5 ml microcentrifuge tubes and then snap freeze in liquid nitrogen and store at -80 °C until further analysis.The cell pellets are re-suspended in a total of 5 ml ice cold extraction buffer in a 15 ml polypropylene tube. The cells are ruptured using a pre-chilled French press at 140 MPa (see Figure 1 for photo and Video 1 of French press) and the cell lysate collected into the same tube.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170315/20170315043031_5816.jpgFigure 1. Cell lysis using a French press. Photo of a French Pressure Cell that can efficiently lyse microalgae cells, including diatoms. Algae cell extracts in ice cold buffer are placed in the ice-cold stainless steel French Pressure Cell and hydraulic pressure applied. Once at 140 MPa the outlet to the Cell is slowly opened. The cells lyse as they emerge from high to ambient pressure and the cell extract is collected into a 15 ml or 50 ml polypropylene tubes.",
    "A slow flow rate of sample out of the Cell (~1 to 2 drops sec-1) is maintained to ensure the pressure is maintained (see Video 1, acknowledgement Bratati Mukherjee). <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Use of French press to lyse cells To the cell lysate, add polyvinylpolypyrrolidone (1%, w/v) to bind secondary metabolites, which are then removed by centrifugation (17,600 x g, 4 °C, 5 min). After centrifugation Rubisco remains fully intact as confirmed by native PAGE (see Data analysis, Figure 2) and fully soluble, remaining in the cell lysis supernatant as confirmed by SDS-PAGE (see Data analysis, Figure 3). Rubisco kcatc (and KC) is quantified by 14CO2 fixation assays (see Data analysis).Rubisco in the soluble protein extract is activated for 10 to 15 min with 15 mM NaH14CO3 and 15 mM MgCl2. In 7 ml septum capped glass scintillation vials 20 μl of the extract is assayed for 60 sec in 0.5 ml of 50 mM EPPS-NaOH pH 8.2, 10 mM MgCl2, 0.6 mM RuBP, 10 μg ml-1 carbonic anhydrase and varying NaH14CO3 concentrations (1.2 to 12 mM which equates to ~15 to 150 μM 14CO2 at pH 8.0 at 25 °C) (Sharwood et al., 2016). The buffer and vials are equilibrated with the appropriate O2/N2 gas mixture prior to adding the NaH14CO3 and sample.The reaction is stopped with 0.2 ml 0.5 N formic acid and non-fixed 14CO2 is vented by heating the vials at 85 °C in the fume hood. The dried residue is dissolved in 0.5 ml double distilled H2O and vortexed with 1 ml Scintillant (Packard, Ultima Gold XR) before the labelled 3-phosphoglycerate (14C) is measured in a scintillation counter.",
    "This crude extraction is suitable for measurements of Rubisco maximum carboxylation rate (Vmax) and Rubisco Michaelis constant for CO2 under N2 (KC) and 21:79% O2:N2 (Kcair) (Sharwood et al., 2008; Sharwood et al., 2016). To quantify kcatc the Vmax value is divided by the Rubisco content in the assay. Measuring Rubisco content is achieved using the 14C-CABP binding method or by immunoblot analysis. The accuracy and experimental limitations of both approaches are detailed in Whitney and Sharwood, 2014. Purification of Rubisco is necessary for measuring SC/O (see next step).Rubisco purification for measuring SC/OThe soluble cellular protein needs to be further purified before quantifying SC/O (CO2/O2 specificity).Soluble cellular protein from step A3 above is manually passed by syringe through a 1 ml Bio-Scale mini Macro-Prep high Q ion exchange (IEX) column equilibrated with column buffer. All steps are performed at 4 °C. The method involves: Pre-washing the IEX column is with 2 ml of column buffer. Soluble cellular protein is passed through the column by syringe (flowrate at ~3 to 5 ml min-1) and then the column is washed with 8 ml of column buffer. Bound Rubisco is eluted in 1.5 ml column elution buffer, collecting in three 500 μl elution fractions. The last two fractions contain > 90% of the Rubisco activity and are therefore pooled before concentrating to ~0.4 ml by centrifugation (4,000 x g, 10 min, 4 °C) using an Amicon Ultra-100 centrifugal filter (i.e., a 100 kDa MW cut-off filter).The concentrated Rubisco is injected into the 200 μl sample loop of the Äkta purification system onto a Superdex 200 column pre-equilibrated with SC/O buffer at 4 °C. The sample is loaded onto the column using the flow rate of 0.5 ml/min (max delta column pressure alarm set to 1.5 MPA) and fractions (0.",
    "5 ml) collected after the void volume (8 ml). Absorbance at 280 nm and conductance are continuously monitored. RuBP dependent 14CO2-fixation activity in the fractions is assayed and those with peak Rubisco activity (typically fractions 5 to 7) are pooled and concentrated to ~0.1 ml by centrifugation (4,000 x g, 20 min, 4 °C) using an Amicon Ultra-100 centrifugal filter. The concentrated and purified Rubisco is now ready for the SC/O assay. Alternatively, glycerol can be added to 20% (v/v) final concentration and the enzyme then frozen in liquid nitrogen and stored at -80 °C. Optional: the SC/O assay (not part of this protocol on Rubisco extraction) SC/O assays are carried out at 25 °C (or other temperature) according to the method of (Kane et al., 1994). The purified Rubisco (10-50 μl) is injected into 20 ml glass, septum sealed glass vials containing 1 ml assay buffer (see Recipes) that has been equilibrated for 0.5 to 1 h with 500 ppm CO2 mixed with O2 using Wostoff gas-mixing pumps. After 15 min, further equilibration the reactions are initiated with the injection of 1 nmol of 2-3H-RuBP. Alkaline phosphatase is injected after 30 min to convert the 3-3H-phosphoglycerate (carboxylation product) and 2-3H-phosphoglycolate (oxygenation product) into 3H-3-glycerate and 3H-2-glycolate. The reactions are passed through a 0.4 ml AGI-X8 (10% formate) anion-exchange column and then the bound 3H-3-glycerate and 3H-2-glycolate eluted in 0.5 ml 20% (v/v) H2SO4 before separating them by HPLC using an isocratic gradient of 0.012 M H2SO4 through a Aminex HPX-87H column at 65 °C at a flow rate of 0.4 ml min-1. The SC/O at 25 °C is then calculated from the radioactivity in the 3H-3-glycerate and 3H-2-glycolate using equation:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171025/20171025225301_5327.jpgWhere,imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171025/20171025225310_1152.jpg represents the molar ratio of O2 and CO2 (99.95% and 0.05% [v/v] respectively),0.",
    "037 is the proportion of the CO2 solubility relative to O2 in H2O at 25 °C (Kane et al., 1994)."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}