{
  "id": 5681,
  "origin_website": "Bio",
  "title": "Overrepresentation Analyses of Differentially Expressed Genes in the Smut Fungus  <em>Ustilago bromivora</em> during Saprophytic and <em>in planta</em> Growth",
  "procedures": [
    "Obtain samples of saprophytically grown U. bromivora To obtain samples of saprophytically grown U. bromivora, PD medium (see Recipes) was inoculated from a mating type 1 strain (UB1) glycerol stock kept at -80 °C. The glycerol stock was produced by mixing 1 ml UB1 overnight culture with 1 ml 50% glycerol. For the original isolation of U. bromivora spore lines please refer to (Bosch and Djamei, 2017). Cell are grown at 21 °C and 200 rpm to an OD600 nm = ~0.8 in three independent biological replicates. Fungal material is sampled by centrifugation in 50 ml vials at 1,200 x g for 5 min. The supernatant is carefully poured off and the pellet is shock frozen in liquid nitrogen. If other species are grown, it can be the case that the pellet is less stable and the supernatant should be pipetted off.Obtain samples of the fungus growing in planta To obtain samples of the fungus growing in planta, caryopses of Brachypodium hybridum Bd28 are gas sterilized by putting them into a closed exicator together with two 50 ml tubes each with 25 ml 5% sodium hypochlorite solution + 0.75 ml 37% HCl for 2 h. After gas sterilization, seeds are left in a 50 ml tube in a fume hood without cover for 1 h, so that any residual chlorine gas can evaporate. The seeds are then soaked in sterile filtered tap water for 1-2 h, and germinated for 2-3 weeks at 4 °C in the dark. The seedlings are subsequently infected with U. bromivora spore solution. The spore solution is obtained by grinding spore sori filled spikelets of infected plants in a small amount (e.g., 1 ml) of filtered tap water with a micro homogenizer in a disposable vial with a V-shaped bottom (e.g., 1.",
    "5 ml micro centrifuge tube). The seedlings are kept moistened (but not submerged) with spore solution at 4 °C for one week and are then planted in soil (see soil mix in the recipes section). 12 days after planting, plant stems are harvested and shock frozen in liquid nitrogen.RNA extractiona.RNA is extracted using TRIzol (Chomczynski and Sacchi, 2006) according to the manufacturer’s protocol. b.Residual DNA is removed with the TURBO DNA-free Kit according to the manufacturer’s instructions.Determination of RNA quality and quantityRNA quality should be verified: To determine RNA concentration and purity, the RNA should be measured with a NanoDrop spectrophotometer. A 260:280 ratio close to 2 and a 260:230 ratio of approximately 2-2.2 is desirable. A minimal amount of 100-200 ng RNA is required for subsequent library preparation. To determine that the isolated RNA is not significantly degraded, a Bioanalyzer or Fragment Analyzer with appropriate kits can be used (see Equipment). Measurements are conducted according to the manufacturer’s instructions. The RNA integrity number (RIN) provided by the Bioanalyzer software is not applicable to the in planta samples, since they contain plant and fungal rRNAs (example: see Figure 1). However, the Bioanalyzer or Fragment Analyzer plots should be manually evaluated for the following criteria: All rRNA peaks should be narrow and near symmetrically shaped and the baseline between peaks should be flat and close to 0.Alternatively, an RNA gel (1% agarose gel in TBE) can be used to assess RNA integrity, even though this method is less precise than using the Bioanalyzer/Fragment Analyzer. For high quality RNA samples from saprophytic growth two clear bands (rRNAs) and for in planta samples four bands should be seen, with almost no additional smear.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170727/20170727234057_3161.jpgFigure 1. Bioanalyzer plot for a high quality RNA sample extracted from U.",
    "bromivora infected Brachypodium tissueLibrary constructionBefore library preparation ribosomal RNA is removed from the samples using Ribo-Zero rRNA Removal Kit following manufacturer instructions. The libraries are prepared using the NEB Next Ultra RNA Library Prep Kit. Size selection is performed using Ampure XP beads. The Bioanalyzer/Fragment Analyzer is used to test the size distribution of the libraries, followed by qPCR to determine the correct concentration needed for cluster generation.The libraries are sequenced in paired end mode (PE125), using an Illumina HiSeq2500 instrument.Notes: An important consideration, when deciding on the sequencing depth, is sufficient coverage of pathogen transcripts in libraries derived from infected host tissue (see Notes).We sequenced the in planta samples to an average depth of 130,000,000 raw reads and the axenic culture samples to an average depth of 23,000,000 raw reads.The quality of the resulting reads is assessed using FastQC: Properties examined are the per-base quality to exclude sequencing problems like quality drop-off towards the end or failed cycles, kmer-distribution and overrepresented sequences to identify adapter dimers and short inserts and duplication rate to exclude overamplification or other library problems. Except for low amounts of reads showing Illumina adapter sequences on the 3’ end we did not experience any obvious problems. The adapter sequences are removed from the reads using cutadapt v1.4.2."
  ],
  "subjectAreas": [
    "Plant Science",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}