{
  "id": 8930,
  "origin_website": "Jove",
  "title": "Development of a Refined Protocol for Trans-scleral Subretinal Transplantation of Human Retinal Pigment Epithelial Cells into Rat Eyes",
  "procedures": [
    "All procedures involving animals have been approved by the Institutional Animal Care and Use Committee (IACUC) at the State University of New York at Albany.\n1. Pre-injection Preparation\nPreparation of a hRPESC-RPE cell suspension\n\tNOTE: All the following steps are performed in sterile tissue culture hood and familiarity with basic sterile technique is required.\n\t\nIsolate primary hRPE cells from human donor eyes aged 50-90 years and culture cells in 24-well plates12. Cryopreserve the cells at passage 1, thaw as needed and culture passage 2 (P2) cells for 4-5 weeks (Figure 1A) for injection.\nRemove the culture medium12 and gently rinse wells twice with 500 µL pre-warmed 1X Dulbecco's Phosphate Buffered Saline without Calcium & Magnesium (1x DPBS-CMF) by adding 1X DPBS-CMF into wells using a 1,000 µL pipette and removing it using a vacuum.\nAdd 300 µL trypsin/DNAse to each well. Incubate hRPESC-RPE cells in trypsin/DNAse (4 kU DNase per 1 mL of 0.25% trypsin-EDTA) for 4 min at 37 °C to dissociate the cells.\nCheck the cells under the microscope to see if they have rounded up. Continue to incubate the cells in trypsin/DNase for an additional 2 min if they have not rounded up yet.\nOnce the cells are rounded up, use a 1,000 µL pipette to triturate the detached cells from the well and transfer the trypsin/DNase containing detached cells into a 15-mL conical tube with equal volume of pre-warmed culture medium, to inactivate the trypsin/DNase.\nRinse wells with pre-warmed 1X DPBS-CMF by gently pipetting up and down, especially around the edges of the well; then add these cells to the previous conical tube.\nCentrifuge the conical tube at 286 x g for 5 min at 4 °C to pellet the cells.\nRemove the supernatant and resuspend the cells with 1 mL culture medium.",
    "Count the cells using a hemocytometer.\nCentrifuge at 286 x g for 5 min at 4 °C to pellet the cells.\nRemove the supernatant and resuspend cells in sterile Balanced Salt Solution (BSS) at 50,000 cells/µL (to deliver 50,000 cells in 1 µL volume during subretinal injection).\nTransfer the final cell suspension (CS) into a 1.7-mL microcentrifuge tube and keep in an ice-water mixture until injection use.\nPreparation of cell injector\nInsert a sterile 33-gauge beveled needle into the injection syringe and screw tightly to assemble the injector.\nFlush the injector with 100% ethanol 5-6 times.\nFlush the injector with 70% ethanol 5-6 times.\nFlush the injector with BSS 5-6 times.\nMark the injector needle with a sterile black marker pen at a position of 600 µm away from the tip of the needle under the dissecting microscope (Figure 1B).\nPlace the injector on a micromanipulator for injection.\n2. Subretinal Injection\nSurgical area and animal preparation\nWeigh a 4-5 week old RCS rat (60-100 g) and anesthetize it using the isoflurane vapor delivery system.\nNOTE: To induce anesthesia keep the isoflurane flow rate at 5%. Confirm the depth of anesthesia by pressing the paws, and then reduce the flow rate to 2-3% for anesthesia maintenance during surgery.\nPlace a sterile surgery drape, with a heating pad underneath, on the stage of the dissecting microscope to set up a sterile surgical area.\nTransfer the rat to the surgical area and place the rat in a nose cone connected to the isoflurane system to maintain anesthesia.\nCover the rat's body with gauze. Pinch the rat's toe to confirm full anesthesia.\nTrans-scleral subretinal injection under the microscope\nApply a drop of eye lubricant on the rat's unoperated eye.",
    "Position the rat onto its right side with its left eye facing the ceiling for injection, its head towards the surgeon's right hand and its back towards the surgeon.\nTrim any whiskers that cover the eye with small scissors.\nDrip a small amount of eye wash from the temporal side of the left eye and collect the excess at the nasal side with a cotton applicator to rinse the eye.\nDilate the pupil with 1% tropicamide and 2.5% phenylephrine (freshly made from 10% phenylephrine by diluting it in sterile 0.9% saline on the day of surgery) for a post-injection OCT exam by applying one drop of each.\nGently pull the skin surrounding the eye 4-6 times to open the eyelid so that the eye is slightly proptosed for easier access to regions posterior to the limbus.\nApply a drop of eye wash and keep the eye moist.\nGently triturate the CS (prepared in step 1.1.12) and load the injector with 1.2 µL CS. The extra 0.2 µL is used to compensate for injection backflow.\nNOTE: Based on our measurements, about 5,000-8,000 cells are lost in the backflow with an injection of 50,000 cells/µL that equals to about 10-16% of cell loss and an extra of 0.2 µL CS was injected to compensate this cell loss.\nPlace the injector filled with CS on a micromanipulator (or have an assistant hold it) vertically as RPE cells tend to sink easily in suspension.\nApply a drop of 0.5% proparacaine (local topical anesthetic) on the eye and remove the excess with a cotton applicator.\nNOTE: This step should suppress the corneal reflex and prevent the eye from blinking during subsequent steps.\nUse forceps to grip the conjunctiva posterior to the limbus, rotate the eye nasally, and lift the conjunctiva to make a \"tent\".",
    "Use scissors to cut the top of the \"tent\" off to make a small opening in the conjunctiva and expose the underlying sclera.\nUse forceps to grip the edge of the remaining conjunctiva margin next to the limbus and rotate the eye nasally so that the pupillary axis is at an angle of about 30 degree relative to the table top (Figure 1C). Continued gripping of the conjunctiva margin is needed to provide a counter-force during needle insertions and to maintain the eye at an optimal angle.\nTo make a pilot hole for cell injection, position the end of a sterile beveled 31-gauge insulin needle at 1,200-1,500 µm posterior to the limbus with the opening of the tip facing up.\nAdjust the angle of the insulin needle so that it is 10-15 degrees above the sclera (tangential to an imaginary plane at the intended injection site). Slowly penetrate the sclera-choroid complex to a needle depth of about 500 µm. In the pigmented rat, the needle end will 'disappear' beneath the pigmented choroid. For the brand of insulin needle used here, the distance from the needle tip to the bevel is 500 µm.\nCarefully withdraw the insulin needle (a very small effusion of blood may be seen).\nIf excessive bleeding is noted, an eye spear can be applied to clear the hole, if necessary. Continued bleeding after the spear application indicates a vessel may have been damaged.\nGuide the RPE cell-loaded injector needle into the pilot hole, with the opening facing down, and at an angle of about 10-15 degrees relative to the local surface of the sclera.",
    "Gently insert the injector needle into the pilot hole to a depth of about 500 µm to access the subretinal space. There should be about a 100 µm margin between the edge of the black pen mark and the point where the needle is covered by the pigmented choroid (Figure 1C and 1D).\nAsk the assistant to gently depress the plunger of the injector syringe to inject the appropriate volume of cells (about 1.2 µL). Be ready to provide some counter-force as the assistant presses on the plunger.\nNote: Prior mock practice with the assistant can provide both the surgeon and assistant with the necessary experience with this step.\nWhile visually focusing on the pen mark edge, hold the injector in place for 25-30 s and then slowly retract the injector. A small amount of backflow is commonly observed.\nNote: If no backflow is observed, there may have been an intravitreal injection. If you see backflow through the seal or cells filling beneath the sclera, the injection was too shallow.\nRinse the cell efflux from the injection site with the sterile eye wash 3 times and collect the excess with a cotton applicator.\nApply a drop of eye lubricant on the operated eye and transfer the rat to the OCT station to examine the location of transplanted cells and the size of the subretinal bleb.\n3. Post-injection Treatment\nAnti-inflammatory and pain reliever treatment\nInject buprenorphine at 0.1 mg/kg body weight in saline subcutaneously to decrease pain.\nInject dexamethasone at 1.6 mg/kg body weight in saline by intraperitoneal injection (I.P.) for inflammation control.\nAnimal recovery\nReturn the rat to the recovery cage under a heat lamp to maintain body temperature.\nObserve the operated eye for signs of hemorrhage.\nObserve the rat to ensure it comes out of anesthesia.",
    "Return the recovered animal to a fresh cage and flag the cage with a surgery card, and monitor daily for any signs of distress, ocular hemorrhage, or corneal opacities. Notify the veterinarian immediately if there are concerns.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}