{
  "id": 17635,
  "origin_website": "Jove",
  "title": "Testing Acetylcholine Followed by Adenosine for Invasive Diagnosis of Coronary Vasomotor Disorders",
  "procedures": [
    "Intracoronary ACh testing has been approved by the local ethics committee and the protocol follows the guidelines of our institution for human research. A previous JoVE article covered a protocol showing preparation of the ACh solutions as well as preparation of the syringes for intracoronary injection of ACh15.\n1. Preparation of the ACh solutions and preparation of the syringes for intracoronary injection of ACh\nPlease refer to a previously published JoVE article15.\n2. Preparation of adenosine solution for intracoronary injection\nTake 1 ampoule of 6 mg adenosine (with 2 mL solvent) into a syringe (this corresponds to a dose of 3 mg/mL).\nAdd the 6 mg of adenosine to 100 mL of 0.9% sodium chloride solution and mix gently.\nFill a 10 mL syringe with 3.5 mL of the adenosine solution (approximately 200 µg of adenosine).\nPerform the last step 3 times for preparation of 3 injections.\n3. Diagnostic coronary angiography\nDepending on arterial access route, inject local anaesthesia either in proximity to the right femoral artery (usually 15 mL of mepivacaine) or in proximity to the right radial artery (usually 2 mL of mepivacaine).\nTo confirm the success of local anaesthesia, prick the anesthetized-skin with the needle and ask the patient if pain is still present.\nPuncture the artery according to the Seldinger technique and insert the sheath (usually 5F). If possible, omit radial spasm prophylaxis in patients undergoing planned IDP. Perform coronary angiography under sterile conditions.\nIntroduce the diagnostic catheter over a J-tipped wire through the radial artery sheath to the ascending aorta and advance it to the aortic root.\nGive 5000 IU of heparin.\nEngage the diagnostic catheter into the ostium of the right (RCA) and subsequently of the left coronary artery (LCA). Inject 2 mL of contrast to confirm correct positioning of the catheter.",
    "Perform coronary angiography in different views using manual injections of approximately 10 mL of contrast agent under fluoroscopy to visualize the coronary arteries.\n\t​NOTE: Usually LAO 40° and RAO 35° are used for the RCA and LAO 45°/ CRAN 25°, RAO 30°/ CRAN 30° and RAO 20°/ CAUD 30° are used for the LCA.\n4. Preparations for the IDP\nAs a prerequisite for the IDP, exclude any epicardial stenosis of >50% on visual assessment.\n\tNOTE: The default artery for the IDP is the LCA as it allows the examination of the two vessels (left anterior descending artery (LAD) and left circumflex artery (LCX)) at the same time.\nPlace a guiding catheter suitable for the LCA into the left main (this can be 5F or 6F, choice of the catheter depends on the patient's anatomy).\nGive another 5000 IU of heparin.\nAdvance the Doppler flow-/pressure-wire carefully through the guiding catheter into the left main artery.\nAfter flushing to avoid any contrast in the catheter, calibrate the Doppler flow-/pressure-wire with the fractional flow reserve (FFR) sensor (localized either tip-adjacent or 1.5 cm offset depending on the wire type) in the left main (press Norm on the software of the computer system).\nPlace the tip of the wire in the proximal-mid portion of the vessel (usually LAD). Perform fluoroscopy to record wire position.\nAssess and optimize the Doppler and ECG signal quality, if needed.\n\tNOTE: This can be done by turning or pulling the wire in order to optimize the wire position. There is also the possibility for fine tuning of the Doppler-signal within the system settings (e.g., optimal tracing and scaling of ECG- and Doppler-signals, wall filter adjustment, etc.).\nOnce a good signal is obtained, press Record to record the signals on the system. The patient is now ready for the IDP.",
    "5. Carrying out the IDP\nInject 6 mL of the lowest ACh concentration (0.36 µg/mL) into the LCA (~ 2 µg of ACh) within 20 s. Flush with 3-4 mL of saline. Perform continuous 12-lead ECG monitoring and ask the patient for recognizable anginal symptoms (e.g., chest pain, dyspnoea). Observe the Doppler-signal curves and record the average peak velocity (APV) during ACh injection.\nPerform coronary angiography of the LCA after ACh injection by manual injection of approximately 10 mL of contrast agent through the catheter. After every ACh dose, record and print the 12-lead ECG. Ask the patient for recognizable anginal symptoms. Give a 1 min pause between every dose.\n\tNOTE: Usually a RAO 20°/ CAUD 30° projection is the best projection for ACh testing.\nInject 6 mL of the medium ACh concentration (3.6 µg/mL) into the LCA (~ 20 µg of ACh). Inject within 20 s with continuous monitoring of the 12-lead ECG and the patient's symptoms. Flush with 3-4 mL of saline. Observe the Doppler-signal curves and record the APV during ACh injection. Perform coronary angiography of the LCA after the 6 mL injection of ACh as mentioned above.\nInject 5.5 mL of the high ACh concentration (18 µg/mL) into the LCA (~ 100 µg of ACh). Inject within 20 s with continuous monitoring of the ECG and the patient's symptoms. Flush with 3-4 mL of saline. Observe the Doppler-signal curves and record the APV during ACh injection. Repeat coronary angiography of the LCA as described above.",
    "NOTE: In most patients with coronary spasm, symptom reproduction, ECG changes or epicardial vasoconstriction develop at this dose. If bradycardia occurs during ACh injection, this can be resolved by slowing down the speed of the manual ACh injection. A slower injection over a period of 3 min compared to the 20 s injection is also feasible.\nIf no epicardial spasm (i.e., > 90% vasoconstriction) occurs at the 100 µg dose continue with the 200 µg of ACh dose (11 mL of the high ACh concentration (18 µg/mL). Inject within 20 s with continuous monitoring of the ECG and the patient's symptoms. Flush with 3-4 mL of saline. Observe the Doppler-signal curves and record the APV during ACh injection. Repeat coronary angiography of the LCA.\n\tNOTE: Slow down the speed of the manual ACh injection if bradycardia occurs as mentioned above.\nInject 200 µg of nitroglycerine into the LCA at the end of the ACh test or when severe symptoms (i.e., severe angina or dyspnoea), ischemic ECG shifts or epicardial spasm occurs. Perform coronary angiography of the LCA after approximately one minute to document reversion of spasm.\nAfter the APV returns to the baseline and ECG as well as patient's symptoms have normalized, perform the next step (i.e., CFR, HMR assessment).\nPress Base to capture baseline values of APV as well as distal (Pd) and aortic (Pa) pressure.\nQuickly inject a bolus of 3.5 mL of the adenosine solution into the LCA (~ 200 µg of adenosine) followed by a brief saline flush (10 mL). Press the Peak search button 3 heart beats after the injection to initiate peak search (maximal APV and minimal Pd) in order to avoid influences of flushing. The system calculates and displays the values for FFR, CFR and HMR.",
    "NOTE: The intracoronary injection of adenosine is well tolerated by the patients with only few side effects such as palpitations.\nRepeat the previous steps (5.8 & 5.9) until 2 concurring measurements have been successfully done. Calculate the mean FFR/CFR/HMR from the values of the measurements.\nPull back the Doppler flow-/pressure-wire into the left main to check for pressure drift. In case of a significant pressure drift, recalibrate the pressure sensor of the wire (step 4.5) and repeat the CFR/HMR measurement.\nPull out the Doppler flow-/pressure-wire and take a final image of the LCA to document that no vessel injury has occurred.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}