{
  "id": 10831,
  "origin_website": "Jove",
  "title": "Using Adhesive Patterning to Construct 3D Paper Microfluidic Devices",
  "procedures": [
    "1. Planar 4-layer Device (Stacked Layers) Construction\nPrint arrays of each layer of the device9 onto each piece of filter paper using a solid ink printer.11,12 Place each filter paper on a hotplate at 170 °C for 2 min. This will melt the wax-based ink and allow it to fully penetrate the thickness of the paper, forming hydrophobic barriers.\n\tNOTE: The exact designs used are available as supplemental files.\nRemove filter paper from hotplate and allow it to cool to RT.\nDeposit 4 µl of 5 mM dye (red: Allura Red; yellow: tartrazine; blue: erioglaucine disodium salt; green: 10:1 mix of tartrazine:erioglaucine disodium salt) in each branch (one color per branch) of layer 3 (third layer from the top of the completed device) using a micropipette.\nBegin with the bottom-most layer. Clamp the filter paper between the stencil and a stiff backing, such as a piece of plate glass, using binder clips, or another similar temporary method. Ensure that the stencil is flat against the paper. This will minimize any spray shadows cast by the stencil onto the paper.\nApply adhesive (see list of materials and equipment) with an approximately 1.33 sec (a four-count at 180 bpm) spray from about 24 cm.9,10 During this time, move the can of adhesive across the stencil at a medium pace. Too slow of travel across the stencil will cause adhesive to accumulate on the stencil itself, clogging it. Too rapid of travel will fail to deposit sufficient adhesive on the paper. Four passes during this time (up-down-up-down) are sufficient in preventing spray shadows.\nRemove stencil and place the next layer of the device (numbered layers are available as supplemental files) atop the freshly sprayed layer, aligning the edges of the paper. Firmly press the two layers together.",
    "Replace stencil and repeat the spraying process for each layer of the device. Remove the stack of devices and place packing tape across the bottom layer. This prevents any fluid leakage from the device. Cut individual devices from the sheet using scissors, following the edge of the printed region.\n2. Planar 4-layer Device (Origami Folded Layers) Construction\nPrint sheets containing all layers of the device onto filter paper using a solid ink printer. Place filter paper on a hotplate at 170 °C for 2 min. Remove filter paper from hotplate and allow it to cool to RT.\n\tNOTE: The exact designs used are available as supplemental files.\nDeposit 4 µl of 5 mM dye (red: Allura Red; yellow: tartrazine; blue: erioglaucine disodium salt; green: 10:1 mix of tartrazine:erioglaucine disodium salt) in each branch (one color per branch) of layer 3 (third layer from the top of the completed device) via micropipette.\nClamp the sheet of devices between the stencil and a stiff backing, such as a piece of plate glass, using binderclips, or another similar temporary method. Ensure that the stencil is flat against the paper.\nApply adhesive (see list of materials and equipment) with an approximately 1.33 sec (a four-count at 180 bpm) spray from about 24 cm. Four passes during this time (up-down-up-down) are sufficient in preventing spray shadows.\nRemove stencil and turn the sheet over. Replace stencil and spray back side of the paper. Remove the sheet of devices and begin folding in an accordion pleat, as depicted in Figure 1. Cut each device out from sheet using scissors, following the edge of the printed region. Place packing tape across the bottom layer.\n3. Nonplanar (Origami) Device Construction",
    "Print device (Figure 2A) onto filter paper using a solid ink printer and place the filter paper on a hot plate at 170 °C for 2 min. Remove device from hotplate and allow it to cool to RT.\n\tNOTE: The exact designs used are available as supplemental files.\nPrint crease pattern (Figure 2C) onto printer paper using a solid ink printer and cut to the size of the filter paper. Place crease pattern on a hotplate at 170 °C for 2 min, to melt the wax, causing the pattern to be visible from both sides of the paper. Remove crease pattern from hotplate and allow it to cool to RT.\nAlign the edges of the crease pattern to the edges of the paper containing the channel patterns and attach the two pieces of paper using binder clips, or another similar temporary method.\nTrace the crease pattern with a blunt stylus, applying enough force that marks appear on the device sheet, but not so hard that the crease pattern paper rips. If that occurs, the device risks being damaged. Precreasing causes the paper to fold much more easily and allows for greater accuracy and precision in folding.\nBegin folding the device with mountain and valley folds according to the crease pattern. Once the adhesive has been applied, the entire device must be assembled very quickly, so folding the device as much as possible before adhesive application is very helpful.\nOnce the device is folded, unfold the device to expose the portions of the device that require adhesive. Cut out masks (Figure 2D) that limit where on the device adhesive may be applied, using a razor blade.",
    "Clamp the device between the stencil and mask and a stiff backing, such as a piece of plate glass. Ensure that the stencil is flat against the device. Apply adhesive (see list materials and equipment) with an approximately 1.33 sec (a four-count at 180 bpm) spray from about 24 cm. Four passes during this time (up-down-up-down) are sufficient in preventing spray shadows. Remove stencil and turn the sheet over. Replace stencil and mask and spray back side of the paper.\nImmediately remove device from stencil and begin folding the device. Once the device is completely folded, apply pressure to the adhesive containing portion until the adhesive has dried.\n\tNOTE: The drying time of the adhesive is very sensitive to ambient humidity, so in locations with low humidity, folding in a humidity controlled chamber allows more time to fold the device.\n4. Wicking Test for 4-layer Devices\nRandomly select 20 devices, previously assembled according to the above protocols. Place devices in a location shielded from any wind or breezes to minimize evaporation. Deposit 40 µl water at the inlet of each device. Record the time it takes for each device to have all of its outlets completely filled with dye.\n5. Origami Wicking Comparison\nConstruct two origami peacocks — one according to the above protocol (Section 3), and the other without the use of a stencil during adhesive application.\nInsert one end of a small paper lead (approximately 5 mm wide by 5 cm long) into the body of each peacock.\nPlace both peacocks in a chamber kept at a high relative humidity (>90%) to minimize evaporation. Place each leg and lead of each peacock into a container filled with 5 mM dye (red: Allura Red, yellow: tartrazine, blue: erioglaucine disodium salt). Record wicking process with a digital camera.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}