{
  "id": 19935,
  "origin_website": "Wiley",
  "title": "Models of Depression: Unpredictable Chronic Mild Stress in Mice",
  "procedures": [
    "Mice are subjected to a schedule of mild psychosocial stressors for 9 weeks (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.208#cpz1208-fig-0001]) to induce physical, behavioral, biochemical, and physiological phenotypes. Once these are established, their reversal following the chronic administration of test agents can be used to predict potential antidepressant activity. Physical changes are quantified by measuring the coat state and body weight of the animal. Stressed animals display a worsening of the coat state compared to control, non-stressed animals. This change in coat state is reversed by chronic administration of antidepressants.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/b16f5e22-621c-41cc-b973-e8bd3a4a1ce1/cpz1208-fig-0001-m.jpg</p>\nFigure 1\nExperimental design. Animals (n = 64) were randomly assigned to four groups (n = 16 mice per group) based on the environment (non-UCMS/UCMS) and the treatment (vehicle/fluoxetine). The UCMS regimen lasted 9 weeks. The coat state and the body weight were assessed weekly by two experimenters blinded to the treatment. Intraperitoneal administration of fluoxetine (20 mg/kg/day) or vehicle (NaCl, 9 g/L) began after 2 weeks of UCMS and continued until the end of the experiment. On the seventh week, behavioral tests (reward-driven exploratory test, nest building test and grooming test) were performed.\nMaterials\nMale BALB/c mice (n = 64), aged 8 weeks at the beginning of the experiment (e.g., Charles River)\nFood pellets and water ad libitum\nStressors (see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.208#cpz1208-tbl-0001]) including:\n               \nSoiled sawdust of rats from the same or previous day (with feces and urine)\nTimer for changing the light/dark cycle for the stressed animals with a minimum accuracy of 30 min\nSpruce sawdust\nTable 1.\n                Experimental Stressors\ntable:\n﻿Stressor,Description\nSocial stress,Each mouse is placed in an empty cage previously occupied by another individual.\nCage change,\"Each mouse is placed in the empty cage of another individual, and then returned to its original cage.\"",
    "Sawdust change,\"At the beginning of the UCMS protocol, the sawdust is changed 2-3 times per 24 hr, and up to 6 times per 24 hr at the end of the UCMS regimen. It is also possible to replace clean sawdust by soiled sawdust coming from control mice.\"\nWithout sawdust,The sawdust is removed during 1 to 6 hr.\nDamp sawdust,125 ml water is placed in each cage (depending on the quantity of sawdust). The period during which damp sawdust is provided can range from 1 to 6 hr.\nWater stress,The sawdust in each cage is removed and replaced with ∼125 ml water at 20°C (∼1 cm of water) for 15-30 min.\nCage tilting,The cages are tilted backwards (45 degrees) for 1-4 hr.\nRat feces,About 60 ml of rat sawdust is deposited in each cage for a period of 1-2 hr.\nRestraint stress,The mice are kept in closed and ventilated tubes (6.5-cm length × 3.7-cm i.d.) for 15-30 min (mice have the possibility to turn themselves back into the tube).\nCycle disturbances,\"Change in the light/dark cycle (e.g., complete reversal of the light/dark cycle, division of the light/dark cycle into four periods of 6 hr, or addition of one to several illumination periods of 30 min to 2 hr during the dark phase and vice versa).\"\nFluoxetine (e.g., Abcam, cat. no. ab120077) or imipramine (e.g., Abcam, cat. no. ab141046) diluted in saline solution (NaCl, 9 g/L)\nAt least two different sound-proof rooms in animal facilities with a stable environment (inverted 12 hr light/dark cycle, temperature 22°C ± 1°C, humidity 55 ± 10%); one room is used to house stressed mice and one room for non-stressed, control mice\nBehavioral testing room\n32 individual cages for the stressed mice",
    "Six to eight cages for the non-stressed mice (four or five mice per cage) with two shelters and one small tube (10-cm length × 6.5-cm i.d.) in each cage\nPlastic restraint tubes closed at each end but enabling air circulation via small holes (6.5-cm length × 3.7-cm i.d.; see Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.208#cpz1208-fig-0002])\nEnvironmental enrichment (shelters and tubes)\nPrecision balance, 0.1 mg\n1-ml syringes with 26-G, 1/2-in. needles for intraperitoneal (i.p.) injections\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/69ad0bf6-dac0-492c-9f52-2dfae599591b/cpz1208-fig-0002-m.jpg</p>\nFigure 2\nExample of a plastic restraint tube designed, built, and used in our laboratory. This restraint tube (6.5-cm length × 3.7-cm i.d.) is closed at one end by a plastic wall pierced with a hole, allowing the animal to put its snout outside. The other end is closed by a rotating lid pivoting around a screw. Small holes on the tube enable air circulation.\nAcclimatize the animal\n1. At least 1 week before initiating the protocol, place the animals in groups of four or five per cage.\n2. Individually mark the animals and separate them into two experimental groups: 32 mice will be exposed to the UCMS paradigm, while 32 mice will remain unstressed and serve as controls. House the stressed and control groups in different rooms but under the same time and temperature conditions, as noted above. Whereas the UCMS mice are housed individually in their home cage, the control mice are group-housed (four or five per cage) with environmental enrichment (shelters and tubes).\nIndividual housing is part of the UCMS protocol and is a stressor in itself. If experimentally required, control animals can also be singly housed.\nApply stressors and assess physical condition",
    "3. Subject the UCMS mice to stressors detailed in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.208#cpz1208-tbl-0001]. Expose the animals to the stressors throughout the entire circadian period (i.e., during the dark and the light periods) and randomly (applying the different stressors in an unpredictable manner). To increase stress intensity and unpredictability, after the first week of the UCMS regimen, stressors can be combined (e.g., rat sawdust and restraint at the same time; Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.208#cpz1208-tbl-0002]).\nBecause it is important to avoid any habituation of the animals to the stressors, the unpredictability is an essential aspect of the stress protocol. Therefore, the order of stressors must vary weekly during the stress exposure period.\nTable 2.\n                Stressors Schedulea[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.208#cpz1208-tbl2-note-0001_22]\ntable:\n﻿Time,Condition\nMonday morning,Social stress (9:00) + cage tilting (10:00-12:00)\nMonday afternoon,Restraint stress (14:00-14:30) + Water stress (16:30-17:00)\nTuesday morning,\"Weight + coat state + sawdust change (10:00, 10:30, 11:00)\"\nTuesday afternoon,Rat sawdust (14:00-16:00) + social stress (15:00-17:00)\nWednesday morning,Damp sawdust (9:30-11:30)\nWednesday afternoon,Light (12:00-14:00) + dark (14:00-16:00) + light (16:00-18:00)\nThursday morning,\"Restraint stress (9:00-9:30) + sawdust change (10:30, 11:00)\"\nThursday afternoon,Water stress (14:00-14:30) + social stress (17:00)\nFriday morning,Without sawdust (9:30-11:30) + cage tilting (10:00-11:30)\nFriday afternoon,Cage tilting (13:00-15:00) + social stress (17:00-19:00)\nSaturday (day),Light (9:00-11:00) + dark (11:00-13:00) + light (13:00-15:00) + dark (15:00-19:00)\nSaturday (night),Light (19:00-21:00) + dark (21:00-1:00) + light (1:00-3:00) + dark (3:00-9:00)\nSunday (day),Light (9:00-11:00) + dark (11:00-13:00) + light (13:00-15:00) + dark (15:00-19:00)\nSunday (night),Light (19:00-21:00) + dark (21:00-1:00) + light (1:00-3:00) + dark (3:00-9:00)\na Example of stressors schedule during the third week with light ON at 19:00 and light ON at 07:00. To avoid sleep cycle disturbance, light change can be replaced by other stressors (Nollet et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.208#cpz1208-bib-0026]).",
    "4. Assess the body weight and coat state of mice weekly. Because the coat state is a function of the frequency and extent of grooming behavior, it is a measure of the animal's motivation toward self-centered activities. The coat state will vary from smooth and clear in control animals to bristling with spikes in UCMS-subjected mice that are most affected by the stressors. Assess the coat on the following seven body areas: head, neck, back, abdomen, tail, forepaws, and hindpaws (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.208#cpz1208-fig-0003]). Score the coat state for each area as follows: 0 (good) for smooth and shiny fur, with no tousled, spiky patches; 0.5 (moderate) for slightly fluffy fur with some spiky patches; 1 (bad) for unkempt fluffy fur with slight staining. Sum the scores for all seven body parts to obtain an overall score, with a maximum possible score of 7. Weigh the animals and monitor their overall physical condition.\nBecause some stressors, such as damp sawdust or restraint stress, may induce a deterioration of the coat state, whereas water stress can temporarily enhance the coat state, it is important not to use these types of stressor within 24 hr before these measurements.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/4593b0dc-1047-451b-947b-cbabf7c0d456/cpz1208-fig-0003-m.jpg</p>\nFigure 3",
    "Assessment of the coat state for (A) non-UCMS control mouse and (B) UCMS-subjected mouse. The coat state score results from a qualitative scoring of different parts of the body: the head, the neck, the forepaws, the back, the abdomen, the hindpaws, and the tail. Each zone is scored 0 if in a good state (the fur is smooth and shiny, with no tousled, spiky patches), 0.5 if in moderately bad state (the fur is slightly fluffy with some spiky patches), and 1 if in bad state (the fur is dirty, unkempt, and fluffy on most of the body with slight staining). In the figure, the non-UCMS control mouse would be scored 0.5 given the presence of a slight degradation of the coat on the neck. The UCMS mouse would be scored 1 on the head, 1 on the neck, 1 on the back, and 0.5 on the abdomen (not visible in the picture), and thus obtain a global score of 3.5. Mice were marked with picric acid in these pictures.\nAdminister the test compound\n5. Further divide the 32 non-UCMS and 32 UCMS mice into two subgroups: control animals receiving vehicle (9 g/L NaCl, i.p.) and treated animals injected with antidepressant (fluoxetine, 15 mg/kg/day, i.p., or imipramine, 20 mg/kg/day, i.p.) at a volume of 10 ml/kg (16 mice per group). Administer vehicle and antidepressant to both non-UCMS and UCMS mice at a fixed time of the day (e.g., at the beginning of the dark period) for 2-4 weeks to assess the pharmacodynamic response.",
    "Ideally, compounds should be administered during the active phase of the mouse circadian cycle, i.e., the dark period, but this ultimately depends on the compound pharmacokinetic/pharmacodynamic profile, which should be determined before the experiment, especially for novel compounds. It is also recommended that animals not receive pharmacological treatment just before behavioral testing (Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.208#cpz1208-prot-0002]) to avoid any acute effects of drug administration.",
    "The UCMS should induce a depressive-like state. In humans, this is characterized by symptoms of apathy and anhedonia. In rodents, responses to stress and antidepressant effects can be assessed by measuring spontaneous grooming behavior (grooming test), spontaneous motivation (nest building test), and appetence for pleasurable food (cookie consumption in the reward-driven exploratory test). Unlike the weekly assessments of physical condition described in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.208#cpz1208-prot-0001], these tests are conducted during the final weeks of the UCMS procedure, at least 2 or 3 weeks after the beginning of the pharmacological treatments, to allow the compounds to induce their therapeutic effects (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.208#cpz1208-fig-0001]).\nNOTE: The behavioral testing should be performed during the dark period and follow the order presented here, beginning with the test that requires a period of habituation (reward-driven exploratory test). Furthermore, behavioral tests can be stressful and can be considered as a stressor per se, hence the importance of including a non-stressed control group.\nMaterials\nFour experimental groups of mice from the previous subdivisions in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.208#cpz1208-prot-0001] (non-UCMS/vehicle, non-UCMS/antidepressant, UCMS/vehicle, and UCMS/antidepressant; 16 mice per group)\nCookies (e.g., McVitie's Chocolate Digestives or Oreo cookies; the cookie must be appetent for mice in being somewhat crispy and sweet)\n70% (v/v) alcohol\n10% (w/v) sucrose solution (made with white sugar sold in conventional retail stores)\nApparatus containing three aligned chambers (20-cm length × 20-cm width × 20-cm height) differing only in the colors of the walls and floors (respectively, white, gray, and black for the first, second, and third chambers) and linked by two gates with a door controlled by the experimenter (Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.208#cpz1208-fig-0004])\nLight dimmer and luxmeter\nStopwatches\n32 individual cages for non-UCMS mice (for the nest building test and the grooming test)\nCotton nestlets (5 × 5 cm, 2-3 g; e.g., SERLAB, D0009, or LBS Biotech Nestlets)",
    "One “spray” cage for the grooming test\n1-L sprayer (e.g., garden hand sprayer) for the splash test\nLamp with red bulb\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/d646fb55-4cd7-4b1e-aa3d-a954c29971ed/cpz1208-fig-0004-m.jpg</p>\nFigure 4\nExample of the apparatus designed, built, and used in our laboratory. It consists of three aligned chambers (20-cm length × 20-cm width × 20-cm height) communicating by two gates (doors are controlled by the experimenters). Only the colors of the walls and the floor differ between the chambers: white for the first one where the mouse is placed, gray for the second, and black for the third chamber where the food is displayed.\nThe reward-driven exploratory test\n1a. Divide each experimental group (non-UCMS/vehicle, non-UCMS/antidepressant, UCMS/vehicle, and UCMS/antidepressant; sixteen mice per group) into two subgroups: mice receiving cookies and mice receiving regular food pellets (eight mice per group).\nThe subgroup sizes should not be smaller than eight mice.\n2a. Four and a half weeks before the start of the assessments, place a piece of cookie (∼2 g) in the cage of each mouse of the “cookie subgroup” every 2 days for 2.5 consecutive weeks to familiarize the animals with the palatable stimulus.\nThe last 2 weeks before the test are cookie-free.\n3a. One hour before the beginning of the test, retrieve all food from cages.\nThe food is removed to avoid inter-individual differences in the drive for feeding (hunger). If this is not done, some mice are less inclined to feed, which could bias the results. Despite being detrimental to mouse health, the sugar contained in the pieces of cookie that are consumed during this test is very unlikely to induce any deleterious effect considering the amount and frequency of consumption (Ruff et al., 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.208#cpz1208-bib-0034]).",
    "4a. Place a piece of cookie (∼2 cm × 2 cm) or a regular food pellet in the center of the black chamber and place the mouse at the other end of the apparatus in the white chamber (head facing opposite to the opening).\nThe observations are made under low-intensity white light (∼200 lux).\n5a. During the 5-min test session, measure the time it takes (latency) for the mouse to pass through the first and the second gate (when its four legs have crossed the door) to smell the food and to chew it, and the number of times the mouse smells and chews the food.\nAfter the mouse has passed through the first gate, close the door. If the mouse has not entered the gray room after 2 min, gently poke it into this second chamber and close the door. Do not close the second door.\n6a. After the end of this first session, replace the mouse in its home cage.\nClean the apparatus with 70% alcohol between each mouse.\n7a. Perform this test every 3 days for each animal (i.e., four sessions of testing over 9 days).\nThe nest building test\n1b. Because the stressed mice are already individually housed, isolate non-UCMS mice in clean individual cages for 24 hr before the test (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.208#cpz1208-fig-0001]).\nUnlike for the reward-driven exploratory test, it is not necessary to subdivide the animals into groups of eight. The nest building test is performed on four experimental groups (non-UCMS/vehicle, non-UCMS/antidepressant, UCMS/vehicle, and UCMS/antidepressant; sixteen mice per group).\n2b. One hour before the beginning of the dark phase (active period), place a cotton nestlet in each cage.\nTo avoid disrupting the mouse and its nesting behavior, drugs or test agents should not be administered during the 24-hr testing period.",
    "3b. At two time points (5 and 23 hr after the beginning of the light phase), evaluate the nest quality (Deacon, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.208#cpz1208-bib-0005]; Fig. 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.208#cpz1208-fig-0005]) using the following criteria:\n         \nScore 1: The cotton square is intact.\nScore 2: The cotton square is partially used.\nScore 3: The cotton is scattered but there is no form of nest.\nScore 4: The cotton is gathered but there is no nest (“flat nest”).\nScore 5: The cotton is gathered into a “ball” with a small passage for entry of the animal (as in an igloo; with or without roof).\nThe second evaluation of nest quality is performed 1 hr before the onset of the dark phase to avoid the destruction of the nest during the awakening of the mouse.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/6d49f6e6-04d4-4d8b-9f75-f9a8b37f2dbc/cpz1208-fig-0005-m.jpg</p>\nFigure 5\nExample of nests in the nest building test. (A) Score 1: The mouse did not use the cotton nestlet, which is intact. (B) Score 2: The mouse partially used the cotton nestlet. (C) Score 3: The mouse scattered the cotton, but there is no nest. (D) Score 4: The mouse gathered the cotton to form a flat nest. (E) Score 5: the mouse gathered the cotton to form a “comfortable” nest with walls and a small entrance. It is possible to assign an intermediate score for nests that do not fully satisfy the scoring criteria. Mice were marked with picric acid in these pictures.\nThe grooming test\n1c. Place a mouse in the “spray” cage.\nEvery animal is individually housed at this step, because non-UCMS mice have already been isolated for at least 24 hr before the nest building test. The grooming test is performed on the four experimental groups (non-UCMS/vehicle, non-UCMS/antidepressant, UCMS/vehicle, and UCMS/antidepressant; sixteen mice per group).",
    "2c. Spray the back of the mouse with a high-viscosity 10% sucrose solution to stimulate grooming behavior, and quickly place the mouse back into its home cage.\nThe sprayer allows delivery of a fixed volume (∼0.7 ml) of sucrose solution. Each mouse should receive two sprays.\n3c. Measure the latency to initiate the first grooming behavior, as well as the frequency and duration of grooming over a 5-min period. Start the stopwatch when the mouse is returned to its home cage, immediately after applying the sucrose solution.\nThe assessment is performed under red light and in the original rack of the individual home cage."
  ],
  "subjectAreas": [
    "Pharmacology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}