{
  "id": 10187,
  "origin_website": "Jove",
  "title": "Autofluorescence Imaging to Evaluate Cellular Metabolism",
  "procedures": [
    "1. Cell plating for imaging\nAspirate the medium from an 80-90% confluent T-75 flask of MCF-7 cells, rinse the cells with 10 mL of sterile phosphate-buffered saline (PBS), and add 2 mL of 0.25% trypsin (1x) to detach the cells from the flask bottom.\nIncubate the flask at 37 °C for ~4 min. Check the cells under the microscope to confirm detachment.\nImmediately add 8 mL of culture medium to de-activate the trypsin.\nCollect the cells in a conical tube (15 mL or 50 mL). Count the cells using a hemocytometer.\nCentrifuge the cells 200 × g for 5 min.\nOnce centrifuged, aspirate the supernatant. Resuspend the pellet of cells in 1 mL of culture medium, and seed 4 × 105 cells onto a 35 mm glass-bottom imaging dish (or the appropriate sample holder for the microscope being used).\nAdd 2 mL of culture medium to the imaging dish to maintain cell metabolism.\nIncubate the cells at 37 °C with 5% CO2 for 24-48 h prior to imaging for the cells to adhere and reach the logarithmic growth phase.\n\t​NOTE: The growth phase was determined by prior experience with these cells and confirmed with the cell datasheet.\n2. Multiphoton FLIM imaging of NAD(P)H and FAD\nTurn on all components of the multiphoton fluorescence lifetime microscope, including the microscope, the laser source, and the detectors being used.\nSample placement\n\t\nTurn on the brightfield lamp. Ensure that light is going into the eyepiece. Choose an objective, usually 20x, 40x, or 100x for cell imaging. Apply 1 drop of the appropriate immersion medium on top of the objective [skip if using an air objective].",
    "Move the objective down to properly place the sample without touching the objective. Place the glass-bottom dish onto the sample holder on the microscope stage. Ensure that the specimen is secure and will not move during imaging.\nCenter the specimen with the objective using the X-Y stage control. Once this is done, look into the eyepiece and move the objective up to focus on the cells.\nIf the microscope is within an enclosure, close the lightbox door. Open the image acquisition software, click on the Multiphoton Imaging tab, and set the following multiphoton imaging parameters: image size = 256 x 256 pixels; pixel dwell time = 4-25 µs; total image acquisition time = ~60 s; optimized detector gain for single-photon counting = 85% (specific to the system being used).\nImaging of Instrument Response Function (IRF) and Fluorescent Lifetime Standard\n\t\nPlace urea crystals on a glass-bottom dish and secure the dish lid with tape or parafilm.\n\t\tNOTE: Urea crystals remain stable at room temperature for months.\nImage the urea crystals.\n\t\t\nPlace the urea dish on the microscope stage and focus on a urea crystal.\nSet the wavelength of the excitation laser to 900 nm.\nUse an emission filter that captures 450 nm wavelengths.\nObtain a fluorescence lifetime image of the urea crystal with laser power at the sample <1 mW and use the recommended imaging parameters mentioned in step 2.2.4.\nImage the Yellow-green (YG) beads as a fluorescence lifetime standard.\n\t\t\nCreate a YG bead slide by diluting the YG bead solution 1:1,000 in sterile water. Place a small volume (~30 µL) onto a slide or glass-bottom dish. Cover with a coverslip and seal the edges of the coverslip with clear nail polish.\nPlace the YG bead slide on the microscope stage with the coverslip side of the slide towards the objective.",
    "Set the wavelength of the excitation laser to 890 nm\nUse an emission filter that captures ~500-600 nm wavelengths.\nObtain a fluorescence lifetime image of the YG bead using a laser power at the sample <1 mW and the recommended image parameters [step 2.2.4].\nCheck the lifetime of the bead using the IRF of the urea. If the lifetime is not ~2.1 ns, check whether the bead is in contact with another bead contributing to fluorescence quenching, the bead solution has dried, the bead is out of focus, IRF is not accurate, or the shift between IRF and fluorescence decay is not optimized [see step 4.2.4].\n\t\t\tNOTE: The lifetime of ~2.1 ns is stable over time.\nNAD(P)H imaging\n\t\nPlace the glass-bottom dish with the cells on the microscope stage and focus on the cells.\n\t\tNOTE: It is recommended that the cells be placed in an environmental chamber to maintain heat, humidity, and CO2 levels during image acquisition, as these parameters can influence cellular metabolism.\nAdjust the gain of the detector to the optimal value for FLIM. Additionally, change to the desired dwell time-a parameter indicating the time the laser spends at each pixel of the specimen.\n\t\tNOTE: These parameters should stay the SAME throughout the remainder of the procedure. This is to ensure consistency in laser illumination and detector settings to ensure the validity of the intensity-based measurements, which are dependent on laser power, scan parameters, and detector gain. There is an optimized detector gain for operating detectors in single-photon counting mode; the value is 85% for the system referenced.\nSet the multiphoton laser to 750 nm. Ensure that the power control for the laser is set at zero initially so that the cells are not damaged upon opening the shutter on the laser.",
    "NOTE: Excitation at 750 nm is recommended for NAD(P)H, although it has broad absorption at 700-750 nm. Excitation at 890 nm is recommended for FAD, although it has broad absorption at 700-900 nm.\nSet or select an emission filter to collect emission wavelengths at ~400-500 nm.\nBegin imaging in a focusing or live-view manner to optimize the image settings.\n\t\tNOTE: The laser is now operating. Do not open the microscope enclosure at this point. Wear appropriate personal protective equipment.\nSlowly increase the laser power to ~ 3-8 mW at the sample while also ensuring the cells are in focus. Once adjusted, record the maximum power used. Use this power setting for the imaging on other segments of the Petri dish for NAD(P)H imaging.\n\t\tNOTE: It is important to measure the laser power at the sample or a pick-off window and not rely on the pockels cell voltage as the pockels cells are not stable. Often laser power is monitored during imaging with a pick-off window instead of at the sample. Using a second power meter at the objective, the relationship between the power at the pick-off window and the power at the sample can be used to estimate the approximate power at the sample from the pick-off window measurements.\nCollect an NAD(P)H FLIM image with an image integration time of 60 s.\nCheck that the image has sufficient photons (peak of ~100 photons for a cytoplasm pixel) within the fluorescence lifetime decay curve. If the number of photons is too low, increase the laser power or duration of image acquisition.\n\t\tNOTE: The minimum peak number of photons within the fluorescence exponential decay is dependent on system parameters, including temporal resolution, IRF, and background noise.\nFAD imaging",
    "Set the multiphoton laser to 890 nm and wait for it to mode-lock at the new wavelength. Ensure that the power control for the laser is set at zero initially so that the cells are not damaged upon opening the shutter on the laser.\n\t\tNOTE: Do not move the stage or objective focus when conducting this step. The FAD field of view (FOV) should directly match NAD(P)H FOV for this image.\nSet or select an emission filter to collect emission wavelengths at ~500-600 nm.\nBegin imaging in a focusing or live-view manner to optimize the image settings.\n\t\tNOTE: The laser is now operating. Do not open the microscope enclosure at this point.\nSlowly increase the laser power to ~5-10 mW at the sample and record the maximum power used. Use this as the power setting for the imaging on other segments of the Petri dish for FAD imaging.\nCollect an FAD FLIM image with an image integration time of 60 s.\nCheck that the image has sufficient photons (peak of ~100 photons for a cytoplasm pixel) within the fluorescence lifetime decay curve. If the number of photons is too low, increase the laser power or duration of image acquisition.\n\t\tNOTE: The minimum peak number of photons within the fluorescence exponential decay is dependent on system parameters, including temporal resolution, IRF, and background noise.\nRepeat steps 2.4-2.5 at an additional four to five FOVs. Ensure that each image is spaced at least 2 FOVs away from the imaged locations.\n3. Cyanide experiment preparation\nDissolve 130.24 mg of sodium cyanide in 25 mL of PBS to make an 80 mM (20x) sodium cyanide solution.\n\tNOTE: Cyanide is toxic. Wear appropriate personal protective equipment.",
    "Aspirate 100 µL of culture medium from the dish. Replace this with 100 µL of sodium cyanide solution to obtain a 4 mM concentration of cyanide in the dish.\nPut the cells in an incubator for 5 min to allow the cells to react with the cyanide solution.\nRepeat steps 2.4-2.6 to acquire NAD(P)H and FAD images of the cells after cyanide exposure.\n\tNOTE: Prolonged exposure to cyanide will kill the cells. Postcyanide images are acquired within 30 min of the cyanide addition.\n4. FLIM image analysis\nOpen the FLIM lifetime analysis software.\n\t\nOpen the urea image to acquire the measured IRF.\nImport the urea image. Select a point on the image of the urea crystal to be used for image analysis. Increase the spatial bin value to integrate FLIM data from multiple pixels to 1 or higher for a decay peak > 100 photons by changing the Bin variable located on the main software interface.\nSave the data as an IRF.\n\t\t\nIn the referenced software, click the dropdown menu titled IRF, select Copy from Decay Data. After this, click Copy to Clipboard to be utilized in the image analysis of the image taken during the experiment.\nImage analysis of NAD(P)H and FAD lifetime images\n\t\nImport the image file into fluorescence lifetime analysis software.\nImprove image visualization to see the cells and subcellular compartments by changing the intensity and contrast if needed.\n\t\t\nClick the Options dropdown menu and select Intensity. Here, change the intensity and contrast as desired and click Ok.\nImport the IRF from the urea image.\n\t\t\nClick the IRF dropdown menu and select Paste from Clipboard.\nSet Multiexponential Decay parameters50.\n\t\t\nSet a threshold value to evaluate decays for cytoplasm pixels.",
    "NOTE: Here, a value of 50 was used. The value was selected by comparing the fluorescence peak values of several representative background and nucleus pixels with the peak value of several cytoplasm pixels. A value between the nucleus pixels and cytoplasm pixels was selected for the threshold.\nCheck that the Shift value aligns the IRF relative to the rising edge of the fluorescence. Adjust the shift if needed to a value that minimizes the Chi-squared value.\nIncrease the spatial bin so that cytoplasm pixels have fluorescence peak values at or above 100.\n\t\tNOTE: Increasing the spatial bin will lead to decreased spatial resolution.\nCompute fluorescence lifetimes for all pixels in the image.\n\t\t\nIn the referenced program, click the Calculate dropdown menu | Decay Matrix.\n\t\t\tNOTE: Success is indicated with an image false-colored to the amplitude-weighted fluorescence lifetime.\nSave the fluorescence lifetime data.\n\t\t\nClick the File dropdown menu | Export. Choose the desired parameters for analysis and click Ok. Save the image.\nSelect the Color button from the Options dropdown menu to adjust the fluorescence lifetime metric displayed, the color configuration to B-G-R, and set the specific color bar minimum and maximum values to adjust the color scale of the fluorescence lifetime image.\nimgsrc://cloudfront.jove.com/files/ftp_upload/63282/63282fig02.jpg\nFigure 2: Measured IRF of urea crystal. (A) Intensity image obtained from the urea. A representative pixel was chosen to create the IRF decay curve (B) for subsequent analysis of fluorescence lifetime images of cells. Abbreviation: IRF = instrument response function. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63282/63282fig02large.jpg]\nCell segmentation\n\tNOTE: The protocol described here uses an image analysis software51. Representative MCF-7 images and data analysis code are provided52.\n\t\nDownload the MCF7_Segmentation_Final.cpproj file52.\nImport the MCF7_Segmentation Pipeline by clicking on File | Import | Pipeline from file, select the file MCF7_Segmentation_Final.cpproj.",
    "Click the Images module and add the NAD(P)H intensity images to be segmented.\n\t\tNOTE: Images must be in.tif, .png, or .jpg format.\nPress Analyze Images button on the bottom left.\n\t\tNOTE: Pipeline may need optimization for images acquired on different systems. For troubleshooting, try the following substeps\n\t\t\nUse the Test Mode for testing different parameters: Click Start Test Mode and run each module by clicking the play button next to the module name.\nClick the first IdentifyPrimaryObjects module and adjust the Typical diameter of objects, in pixel units (Min, Max) to match the diameter of the cells.\n\t\t\tNOTE: For MCF-7 cells, 10 and 40 pixels were used for the minimum and maximum, respectively.\nClick the EnhanceOrSuppressFeatures module and adjust the Feature size to improve identification of the selected Feature type.\n\t\t\tNOTE: A feature size of 10 pixels was used for MCF-7 cells.\nClick the second EnhanceOrSuppressFeatures module and adjust the Range of hole sizes to optimize the enhancement of the nuclear regions.\n\t\t\tNOTE: A range of 5-20 was used for MCF-7 cells.\nClick the second IdentifyPrimaryObjects module and adjust the parameters (Threshold strategy, Thresholding method, Threshold smoothing scale, and Threshold correction factor) to optimize the identification of nuclei. Click on the ? by each parameter to identify optimal settings and apply to the IdentifySecondaryObjects module.\nClick on the FilterObjects module and adjust the area shape. Select a minimum and maximum pixel of the area shape to be identified.\n\t\t\t​NOTE: For the MCF-7 cells, 100 and 500 were used for the maximum and minimum, respectively. The process of cell segmentation by identifying the nucleus and propagation to the cell boundaries is explained in detail by Walsh and Skala47.\nUsing the cell cytoplasm masks, average the fluorescence lifetime output variables for each cell within the image.\nimgsrc://cloudfront.jove.com/files/ftp_upload/63282/63282fig03.jpg",
    "Figure 3: Identification and segmentation of individual cells. The NAD(P)H intensity image of MCF7 cells (A) obtained by integrating a fluorescence lifetime image. Cells were imaged using 750 nm excitation at 5 mW for 60 s. The x and y axes represent the pixel location of the image. (A) Individual cells were identified. The cells were masked (B) to eliminate any background noise from the data set. The nucleus was then identified (C) and projected onto the cell mask (D). The cells were then filtered (E) to remove masked areas that do not fit the size of typical cells. Scale bar = 50 µm. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63282/63282fig03large.jpg]\n5. Alternative method: Fluorescence intensity imaging\nTurn on the equipment that will be used during the experiment.\n\tNOTE: Fluorescence intensity images can be acquired with wide-field fluorescence microscopes, confocal fluorescence microscopes, or multiphoton microscopes.\n\t\nEnsure that the microscope to be used has an appropriate excitation source for NAD(P)H (single-photon wavelength ~370-405 nm: two-photon wavelength ~700-750 nm) and FAD (single-photon wavelength ~488 nm, two-photon wavelength ~890 nm).\nEnsure that the microscope has a filter for the isolation of NAD(P)H emission (~400-500 nm).\n\t\tNOTE: 4',6-Diamidino-2-phenylindole (DAPI) settings often work for NAD(P)H.\nEnsure that the microscope has a filter for isolation of FAD emission (~500-600 nm).\n\t\tNOTE: Green fluorescent protein (GFP) settings often work for FAD.\nPrepare the microscope.\n\t\nTurn on the brightfield lamp. Ensure that light is going into the eyepiece. Apply 1 drop of the appropriate immersion medium on top of the corresponding objective if needed.\nMove the objective down to properly place the samples without any interference. Place the Petri dish onto the stage properly. Ensure that the specimen is secure and will not move during imaging.",
    "NOTE: It is recommended that the cells be placed in an environmental chamber to maintain heat, humidity, and CO2 levels during image acquisition, as these parameters can influence cellular metabolism.\nCenter the specimen with the objective. Once this is done, look into the eyepiece and move the objective until the cells appear to be in focus.\nBegin intensity imaging.\n\t\nOpen up the imaging software and set the excitation and emission configuration to capture NAD(P)H by clicking the Capture tab in the image acquisition software and positioning the NAD(P)H excitation and emission filter in the microscope turret.\n\t\tNOTE: A 357/44 excitation filter, 409 longpass dichroic, and 447/60 emission filter were used for NAD(P)H imaging.\nOptimize the excitation illumination and detector parameters. If bleaching is an issue, reduce the illumination intensity and increase the image integration time.\n\t\tNOTE: NAD(P)H is a weak signal; be aware of bleaching if too much power is used.\nAcquire an NAD(P)H image of the desired image size. Ensure that the image is saved.\nSet the excitation and emission configuration to capture FAD. Optimize the excitation illumination and detector parameters.\n\t\tNOTE: A 458/64 excitation filter, 495 longpass dichroic, and 550/88 emission filter were used for FAD imaging.\nAcquire an FAD image. Ensure that the image is saved.\n\t\tNOTE: NAD(P)H and FAD image acquisition parameters (illumination intensity, image size, detector gain) should stay the same throughout the imaging experiment.\nRepeat the process at an additional five locations, spaced at least 2 FOVs away from the imaged locations.\nImage-level redox ratio data analysis\n\t\nOpen the NAD(P)H and FAD intensity images in an image processing program.\nSet a threshold on the NAD(P)H to retain cytoplasm pixels and set background and nucleus pixels to 0.",
    "Calculate the redox ratio image by evaluating the equation FAD/(NAD(P)H+FAD) at each pixel using the thresholded NAD(P)H image.\nCalculate the mean value of the non-0 pixels.\n\t\tNOTE: These steps can be performed in image analysis software or coded directly with scripts.\nCell-level redox ratio analysis\n\t\nFollow steps 4.3.1-4.3.5 to obtain a mask image of the cells within each NAD(P)H image.\nCalculate the redox ratio image by evaluating the equation FAD/(NAD(P)H+FAD) at each pixel.\nUsing the cell cytoplasm mask, average the redox ratio for all pixels for each cell within the image.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}