{
  "id": 12227,
  "origin_website": "Jove",
  "title": "Flow Cytometry-based Drug Screening System for the Identification of Small Molecules That Promote Cellular Differentiation of Glioblastoma Stem Cells",
  "procedures": [
    "NOTE: Astroglial and neuronal lentivirus reporter systems were purchased as pre-packaged, concentrated lentiviral preparations. Basic knowledge of flow cytometry technique is required. Also, for a full use of this protocol the user will need access to a flow cytometer with high throughput capacity (accepts 96-well plates as sample source).\n1. Lentiviral Transcriptional Reporter System\nNOTE: In all flow cytometric analyses, use parental, non-transduced, cells or vector-transduced (non-fluorescent) cells for establishing baseline fluorescence. Also, note that in all steps where mechanical trituration is called for, be gentle. Harsh trituration can kill a significant number of the fragile GSCs and influence flow cytometry results.\nPlate 1x106 cells in 2 mL of complete neural stem cell growth medium in a 6-multiwell plate.\nTransduce cells by adding lentivirus reporter at a multiplicity of infection (moi) equal to 5.\nAdd 2 µL of polybrene for a final concentration of 8 µg/mL.\nIncubate the cells at 37 °C and 5% CO2 overnight.\nThe next day, replace growth medium to remove unbound virus. Place the plate back in the incubator at 37 °C and 5% CO2 and incubate for 24 h.\nHarvest 0.5 mL of the total volume; spin down cells at 360 x g for 5 min at room temperature in a 15- mL conical tube and remove supernatant by aspiration. Add 0.5 mL of fresh neural stem cell growth medium to the remaining cells and return the plate to the incubator for continued expansion.\nAdd 200 µL of dissociation reagent and incubate for 5 min at 37 °C.\nDissociate cells by gently pipetting up and down.\n\tNOTE: Harsh trituration may result in significant killing of GSCs, complete dissociation is usually achieved after 20 - 30 times.",
    "To minimize cell attachment or aggregation, add 800 µL of Hank's Balanced Salt Solution (HBSS) for a final volume of 1 mL.\nTransfer 200 µL of each cell suspension to a well of a 96-multiwell plate.\nFor this procedure, use a benchtop flow cytometer with 96-well plate capability equipped with a blue laser for excitation and with the capability of detecting green fluorescent protein. Perform flow cytometric analysis with at least 10,000 viable cells for each acquisition.\nDetermine the percentage of GFP-positive cells by flow cytometry.\n2. Subclone Selection, Expansion, and Validation\nPlate cells in 100 µL of neural stem cell medium at a density of 0.7 cells per well of a 96-multiwell plate.\nCulture clones for 11 days at 37 °C and 5% CO2. This step is highly cell type dependent and will likely require an adjustment based on the cell line used. As a general rule, a sphere diameter ≥ 100 µm is a good indication of the presence of clonogenic GSCs in the neurospheres.\nUsing a fluorescent microscope equipped with a FITC filter, mark the wells that contain a single neurosphere where ~1-5% of the cells are GFP-positive.\n\tNOTE: Determining the exact percentage of GFP-positive cells is not too critical at this point. Each of the subclones will later be evaluated by flow cytometry. This step is performed to reduce the total number of clones to be analyzed with emphasis on neurospheres that originate by undifferentiated, GFAP-negative, GSC.\nExpand selected reporter clones until there are a sufficient number of cells for analysis by flow cytometry. A sub-confluent well of a 6-multiwell plate containing ≤ 1.5x105 cells/mL should provide a sufficient number of cells.\n\tNOTE: A detailed procedure for the isolation and expansion of GSCs is available 17.\n3. Determination of GFAP:GFP Expression by Flow Cytometry",
    "Harvest an aliquot of cells (0.5 mL) from each reporter clone and non-transduced controls to determine the exact percentage of GFP-positive cells. Considering reporter clones that contain ~1 - 5% GFP-positive cells.\nSpin cells at 360 x g for 5 min at room temperature and remove supernatant by aspiration.\nTo each pellet, add 200 µL of cell dissociation reagent and incubate the tubes in a water bath set to 37 °C.\nTriturate cells gently to achieve a single cell suspension (usually between 20 to 30 times).\nTo minimize cell attachment or aggregation, add 800 µL HBSS to a final volume of 1 mL.\nTransfer 200 µL per well of a 96-multiwell plate from each cell suspension.\nFor this procedure, use a benchtop flow cytometer with 96-well plate capability. Perform flow cytometric analysis with at least 10,000 viable cells for each acquisition.\n4. ELDA Self-Renewal Assay to Assess Clonogenic Capacity\nNOTE: For controls, both parental, non-transduced, as well as GFP-expressing lentivirus-transduced cells, should be used to determine the relative clonogenic potential of the GSC differentiation reporter lines to the original GSC cultures from which they were derived.\nDissociate differentiation-reporter subclones into single-cell suspensions as described above.\nPlate cells in 96-multiwell plates in 100 µL of complete neural stem cell growth media at cell densities ranging between 5 and 500 cells per well.\nIncubate cells for 9 to 11 days at 37 °C and 5% CO2.\nScore positive wells by direct visualization of neurospheres under a light microscope. A well should be considered \"positive\" if it contains at least a single large neurosphere.\nPlug the data: total wells analyzed and the number of positive wells using the ELDA online interface available at http://bioinf.wehi.edu.au/software/elda/index.html.\n5. Drug Library Dilution Preparation",
    "Remove library plates from storage at -80 °C, cover with aluminum foil (protect light-sensitive compounds). Thaw for approximately 30 min to an hour at room temperature.\nUse a 12-channel multichannel pipettor to dilute the library compounds to 0.2 mM in complete neural stem cell medium. Dilute DMSO to 10% in growth medium\n\tNOTE: The final concentration of DMSO should be 0.1% when added to cells. A higher concentration of DMSO in the culture may result in toxicity. For this reason, it is recommended to test sensitivity to DMSO in the cell line used, before treatment.\nUse DMSO as vehicle control to treat cells found in the left and right columns of each plate (Columns 1 and 12; Wells A through H).\nCover the diluted library plates with aluminum foil and return the original library plates to the -80 °C freezer for long-term storage.\n6. Drug Screen\nNOTE: DMSO-treated cells should be used to set the baseline fluorescence and adjust gating.\nPlate 5x103 cells in a 96-multiwell plate in 99 µL of complete neural stem cell growth medium.\nUsing a 12-channel multichannel pipettor, treat cells with diluted library compounds at a final concentration of 2 µM (1 µL of 0.2 mM drug into 99 µL of cell suspension) or with DMSO (control). Incubate the plates for 72 h at 37 °C and 5% CO2.\nUsing a 12-channel multichannel pipettor add 150 µL of cell dissociation reagent to each well and incubate for 20 min at 37 °C.",
    "Dissociate cells by gently triturating with a 12-channel multichannel pipettor until single cell suspension is achieved (usually between 20 to 30 times). The amount of time that is required to dissociate neurospheres completely will vary between GSC lines. While the recommended cell dissociation reagent (see materials) is safe and incubation for up to 45 minutes had no effect on viability in multiple GSC lines tested, verify for each GSC line to be used in screening.\n\tNOTE: The final volume in each well should be roughly 250 µL (100 µL of cell suspension + 150 µL of cell dissociation reagent).\nDetermine the percentage of cells expressing the GFAP:GFP reporter by flow cytometry. Use standard gating strategy. First, plot forward and side scatters to get a general sense of cell size and viability. Then place a gate on the viable single-cell population. This is the population for which green fluorescence (eGFP) will be determined. Any compound that results in an increase in the percentage of GFP-positive cells by over three standard deviations over control (DMSO-treated) is considered as a positive \"hit.\" This threshold should be adjusted according to the specific application and the desired stringency.\n\tNOTE: For the high throughput screen is recommended using a single GSC reporter subclone. Following hit identification, each hit should be validated against additional reporter subclones from the same GSC line. To increase the confidence for true hits is also recommend testing compounds against reporter subclones isolated from different GSC neurospheres lines.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}