{
  "id": 19777,
  "origin_website": "Wiley",
  "title": "Using the PhenX Toolkit to Select Standard Measurement Protocols for Your Research Study",
  "procedures": [
    "The PhenX Toolkit is a web-based resource that makes it easy for researchers to identify standard data collection measurement protocols to include in their studies. The value of standard measures is widely recognized (Bennett et al., 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.149#cpz1149-bib-0001]) because they facilitate cross-study analysis, allow studies to be combined to increase statistical power, and allow comparisons between studies to facilitate validation of results. Without standard protocols, investigators must harmonize data collected using different but conceptually related methodologies, which can be a time-consuming and difficult process.\nMaterials\nAn up-to-date Web browser, such as Google Chrome, Microsoft Edge, Safari, and Firefox, is required for this protocol\nExample scenario\nAn investigator with expertise in diabetes is designing a new research study. She has several diabetes protocols in her study design and would like to consider expanding the scope of her study to include protocols related to cardiovascular health, environmental health, and SDoH. She is unsure of the recommended standard data to collect and collection methods to follow for a few of these measures and visits the PhenX Toolkit to identify recommended protocols for phenotypes and exposures that could be included in her new study. She navigates the Toolkit to consider protocols that extend beyond her area of expertise to add to the study design. Additionally, the investigator knows that data collected using PhenX protocols can be readily compared with or combined with data from other studies that have also used the same PhenX protocols.\nThe investigator follows these steps to explore and identify protocols in the PhenX Toolkit:\n1. Navigate to the PhenX Toolkit website at https://www.phenxtoolkit.org/[href=https://www.phenxtoolkit.org/].\n         \nThe investigator notes several ways to access information from the home page, including a search bar and buttons such as “Research Domains” and “Browse Protocol Tree” (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.149#cpz1149-fig-0003]).",
    "To start, the investigator decides to use the search bar on the home page.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/026efb0a-2ce1-4a61-b6af-f7bfd5cc0a3d/cpz1149-fig-0003-m.jpg</p>\nFigure 3\nThe PhenX Toolkit home page: https://www.phenxtoolkit.org/[href=https://www.phenxtoolkit.org/].\n2. Search the Toolkit for “diabetes” using the search bar.\n         \nThe search bar allows users to type in words, phrases, or topics of interest. For this study, the investigator is going to search the term “diabetes.”\nThis search returns 27 protocols. (Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.149#cpz1149-fig-0004] displays the search results.)\nThe investigator already plans to include a few bioassays in her study and is curious to see what bioassays are included in the Toolkit. Using the filters on the left under “Refine by:”, she selects “Bioassay” under “Data Collection Mode” (Fig. 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.149#cpz1149-fig-0005]).\nThe investigator sees “Oral Glucose Tolerance Test” listed among the search results. She has already included this test in her study design. Clicking that link displays a description of the protocol, details of specimen collection, specific instructions for administration, and related protocols. Essential Protocols collect information necessary for data interpretation, and are suggested in the left-hand panel. Related Protocols are other protocols in the Toolkit that may be of interest. Related Protocols are suggestions only and are not required for interpretation of a protocol. Tabs on this page can be accessed to obtain additional material, including information on administration, details, source, variables, and measure. After reviewing this information, the investigator notes that this protocol is the same one she has already included in her new study design.",
    "Upon further review of each tab, the investigator sees on the “Details” tab (Fig. 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.149#cpz1149-fig-0006]) that links are provided to other research standards such as caDSR Common Data Elements (CDE), Logical Observation Identifiers Names and Codes (LOINC), and Human Phenotype Ontology. These additional resources and links to other research standards will be nice to review because she regularly uses the Oral Glucose Tolerance Test protocol. She also notes the quick access to directly download a Data Collection Worksheet (DCW) or Data Dictionary (DD), which are available through the “Download” drop-down menu above the “Protocol” panel (Fig. 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.149#cpz1149-fig-0007]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/16cb7552-fceb-4089-ab77-8fa680d2fe1d/cpz1149-fig-0004-m.jpg</p>\nFigure 4\nSearch bar results for diabetes protocols in the PhenX Toolkit.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/6a15e395-0165-44af-923b-041549546e63/cpz1149-fig-0005-m.jpg</p>\nFigure 5\nFiltered search results enable quick discovery of relevant protocols.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/f30f84a0-d671-408e-8f3e-ad18a6d9f97d/cpz1149-fig-0006-m.jpg</p>\nFigure 6\nThe “Details” panel on the “Protocol” page.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/238013d0-7e6d-4b8e-b91d-7330b0a81708/cpz1149-fig-0007-m.jpg</p>\nFigure 7\nProtocol resources can be downloaded from the “Protocol” panel.\n3. Select protocols via “Add to My Toolkit.”\n         \nBecause the investigator already uses the Oral Glucose Tolerance Test, she decides to add the protocol to My Toolkit, so she can review additional resources displayed in the “Details” panel (Fig. 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.149#cpz1149-fig-0006]). After she adds the protocol to My Toolkit, she can save it to access and download later (Fig. 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.149#cpz1149-fig-0007]). She will also have quick access to directly download a Data Collection Worksheet (DCW) or Data Dictionary (DD), which are available at the top of the “Details” panel.\nMore information and guidance on My Toolkit can be found at https://www.youtube.com/watch?v=Gz_4LLaQmr0[href=https://www.youtube.com/watch?v=Gz_4LLaQmr0].\n4. Use My Toolkit and review Essential Protocols.",
    "In My Toolkit, the investigator may see that there are some Essential Protocols associated with the protocols in My Toolkit. An alert indicates that Essential Protocols are needed to interpret the data. In My Toolkit, each of the Essential Protocols can be reviewed and added to My Toolkit. For example, the Current Age protocol is essential to interpreting the Oral Glucose Tolerance Test protocol (Fig. 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.149#cpz1149-fig-0008]).\nAlternatively, users can quickly add Essential Protocols by selecting “Add all Essential Protocols to your Toolkit” (Fig. 9[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.149#cpz1149-fig-0009]).\nClicking the Essential Protocol name will bring the user to the “Details” panel for that protocol. After adding the suggested Essential Protocols to My Toolkit, the investigator logs off to resume later. The protocols she has selected are saved in My Toolkit.\nSatisfied with identifying the Oral Glucose Tolerance Test, the investigator goes back to the PhenX Toolkit home page and this time decides to click “Research Domains” (Fig. 10[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.149#cpz1149-fig-0010]). She notices the Cardiovascular Domain (Fig. 11[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.149#cpz1149-fig-0011]) and wonders if the PhenX Toolkit includes cardiovascular protocols that might be appropriate to consider for her new study. When she clicks “Cardiovascular,” the investigator now sees the 14 protocols that make up the Cardiovascular domain (Fig. 12[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.149#cpz1149-fig-0012]).\nAfter scanning the 14 protocols in the Cardiovascular domain, she notices protocols that she would like to review further and clicks the protocol names to view additional details for each. She adds “Blood Pressure (Adult/Primary)” and “Family History of Heart Attack” to My Toolkit (Fig. 13[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.149#cpz1149-fig-0013]).",
    "How to become a TK Registered User: To access the ability to save protocols and return to them at a later date, the user can register and create a profile. First, click the “Add to My Toolkit” button to save one or more protocols for convenience. (Fig. 14[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.149#cpz1149-fig-0014]). After registering, users can access features such as the ability to name and save multiple Toolkits and share them with collaborators. Registered users can also opt to receive the PhenX Toolkit Newsletter to learn about new content releases and access the Link Your Study feature.\nExploring the Toolkit, the investigator finds additional standard protocols relevant to her study design. The following steps detail how to use Smart Search, Advanced Search, and the Protocol Tree Browser.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/5b41f6f8-9fcb-4371-9e3f-aa3bfbebd62d/cpz1149-fig-0008-m.jpg</p>\nFigure 8\nThe Current Age protocol is essential to interpreting the Oral Glucose Tolerance Test protocol.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/a2532278-6072-4d52-8d6f-c180deb8d23f/cpz1149-fig-0009-m.jpg</p>\nFigure 9\nThe My Toolkit page allows the investigator to save protocols of interest to download or browse later. Essential Protocols can be added individually or together by selecting the active link next to the alert at the bottom of My Toolkit.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/1dcd051c-2c96-4c81-ae6d-a778d5f891ec/cpz1149-fig-0010-m.jpg</p>\nFigure 10\nBrowsing research domains from the home page.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/843aa0c6-7161-4402-884e-d4c569ba7d8b/cpz1149-fig-0011-m.jpg</p>\nFigure 11\nBrowsing the research domains page.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/2eb0a251-dbfc-449c-a86e-8dbc69e0de21/cpz1149-fig-0012-m.jpg</p>\nFigure 12\nBrowsing protocols in the Cardiovascular Domain.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/91aaf7f3-8d8b-4e29-836c-8f5db46805a2/cpz1149-fig-0013-m.jpg</p>\nFigure 13\nAdding Cardiovascular Domain protocols to My Toolkit.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/639b1a4c-a56c-44d4-a5f9-6afdd1435935/cpz1149-fig-0014-m.jpg</p>\nFigure 14\nRegistered users can save protocol selections, share with collaborators and access studies linking PhenX protocols.\n5. Use Smart Search to find all protocols from a specific source (e.g., National Health Interview Survey [NHIS]).\n         \nThe Smart Search query bar at the top of the page allows a user to search all protocols in the Toolkit for those with matching metadata, including protocol source, specific instructions for protocol administration, and descriptions.",
    "Because the investigator is interested in identifying protocols assessing social determinants of health and nutrition, she decides to search the Toolkit for a large national study, which she thinks might contain these types of protocols. She chooses NHIS. The investigator types the search term “NHIS” into the Smart Search bar at the top of the PhenX Toolkit webpage. The search returns 50 relevant results (Fig. 15[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.149#cpz1149-fig-0015]).\nThe investigator selects the “Sugar Intake (Added)” protocol, which looks like a good match to include in her new diabetes study. She adds this protocol to My Toolkit (Fig. 16[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.149#cpz1149-fig-0016]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/d703cd0f-56f2-4089-831f-d72d950519d5/cpz1149-fig-0015-m.jpg</p>\nFigure 15\nUsing the Smart Search query for National Health Interview Survey (NHIS) protocols.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/b2d0c5e5-7832-42ea-958a-9dae93e52aca/cpz1149-fig-0016-m.jpg</p>\nFigure 16\nAdding an NHIS protocol (Sugar Intake) to My Toolkit.",
    "6. Advanced Search under the “Search” drop-down menu on the PhenX Toolkit home page is where search operations can be fine-tuned (Fig. 17[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.149#cpz1149-fig-0017]). The investigator decides to search here for a protocol that measures healthcare access, and has a couple of options. Smart Search combs through protocol metadata and key fields, so it has high specificity in its function. Smart Search is also the default operation of the search bar at the top of each page. Another search option is Text Search only, found on the Advanced Search page. The advanced Text Search looks for word matches in the entire protocol text rather than just key metadata fields. A full Text Search of any relevant search term can be used to review more broadly relevant results and any Supplemental Information, which are listed at the end of the results. The investigator types “healthcare access” into Advanced Search and clicks the Text Search button (Fig. 18[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.149#cpz1149-fig-0018]). The results are displayed, and she sees “Access to Healthcare Services.” After reviewing the protocol, she decides to add it to My Toolkit.\nMore information and guidance on searching the Toolkit can be found at https://www.youtube.com/watch?v=yAycTLYdFAM[href=https://www.youtube.com/watch?v=yAycTLYdFAM].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/037ac197-12e1-475b-9b53-3552628fb5ef/cpz1149-fig-0017-m.jpg</p>\nFigure 17\nNavigating to Advanced Search.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/e3d76976-aaf5-454e-88c6-791bd87eed7c/cpz1149-fig-0018-m.jpg</p>\nFigure 18\nExecuting a full Text Search.\n7. One protocol the investigator would still like to identify is a measure related to Environmental Health, which might affect diabetes. She goes back to the PhenX Toolkit home page and clicks the “Tree” button (Fig. 19[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.149#cpz1149-fig-0019]). The PhenX Toolkit Protocol Tree Browser groups all protocols in the Toolkit by MeSH (Medical Subject Headings) terms (National Library of Medicine [NLM]; see Internet Resources). It is used for indexing, cataloging, and searching of biomedical and health-related information. MeSH includes the subject headings appearing in MEDLINE/PubMed, the NLM Catalog, and other NLM databases.",
    "The user visits the Cross-Domain Concept Tree Browser main page (Fig. 20[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.149#cpz1149-fig-0020]).\nShe clicks to open the ”Environmental Health” branch, followed by “Air Pollution,” then clicks the Air Quality Index protocol. Information about the protocol is then displayed, so she can easily review the protocol there or go to the protocol page (Fig. 20[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.149#cpz1149-fig-0020]). She decides to add the Air Quality Index protocol to My Toolkit using the button on the top right of the screen.\nMore information and guidance on using the Browse Protocol Tree can be found at https://www.youtube.com/watch?v=JSL7nqEF6AY[href=https://www.youtube.com/watch?v=JSL7nqEF6AY].\nFollowing these steps, the investigator identified several standard protocols for inclusion in her study design. The investigator can download protocol documents in real time or save them in My Toolkit, where she can download them individually or as a set. If the investigator is logged in as a registered user, her selections are saved, and she can return later to review and download the protocol documents and even share the protocols with collaborators directly from within the Toolkit.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/42f3af2f-b921-47b8-9025-2bf0f76a13d2/cpz1149-fig-0019-m.jpg</p>\nFigure 19\nThe Protocol Tree Browser.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/13a069d7-a51a-4b64-bd0d-8a61db343751/cpz1149-fig-0020-m.jpg</p>\nFigure 20\nThe protocol preview from the Protocol Tree Browser page."
  ],
  "subjectAreas": [
    "Human Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}