{
  "id": 18897,
  "origin_website": "Jove",
  "title": "Dual-phase Cone-beam Computed Tomography to See, Reach, and Treat Hepatocellular Carcinoma during Drug-eluting Beads Transarterial Chemo-embolization",
  "procedures": [
    "1. Patient Selection\nSelect patient eligible for drug eluding beads loaded with Adriamycin (DEB-TACE) with primary hepatic tumors such as HCC at a multidisciplinary gastro-intestinal oncology team conference and with primary teams (i.e. surgical oncology, radiology, interventional radiology, medical oncology).\nPlace the patient into the supine position on the angiography table and sedate him.\nPremedicate the patient to reduce systemic effects of inflammatory response and nausea (Diphenhydramine intravenous (IV), Dexamethasone IV and Ondansetron IV).\nPrepare patient's right groin and drape in the usual sterile fashion.\n2. \"See\" the Tumor\nCatheterization of the common hepatic artery\n\t\nAccess the right common femoral artery with a micro-puncture needle using Seldinger's technique, insert a sheath and attach to saline flush.\nCatheterize sequentially the superior mesenteric artery (SMA) and the celiac axis with an angiographic catheter.\nPerform an angiogram of the SMA to ensure standard anatomy, lack of replaced hepatic arterial supply and to confirm portal vein patency.\nPerform a celiac artery angiogram to determine anatomy and hepatic arterial blood supply.\nAdvance coaxially a microcatheter through the catheter into the right or left hepatic artery depending on tumor location.\nPerform a repeat right or left superselective hepatic arteriogram to confirm the location of the tumor(s).\nCorrelate tumor(s) seen on the intraprocedural imaging to preprocedural cross sectional imaging findings (MRI or MDCT).\nIntraprocedural pretreatment Dual Phase cone-beam computed tomography\n\t\nInstruct the sedated patient to be at end-expiration apnea during each of the CBCT scans with free breathing between the early arterial and delayed venous phase scans. If necessary, administer oxygen to the patients during the CBCT acquisition to minimize the discomfort of breath holding.\nCoordinate with anesthesiologist for timing and to minimize overlying artifact-inducing equipment.",
    "Place for each CBCT scan the area of interest (liver) roughly in the system isocenter. Trigger the first scan three seconds after power contrast injection (amount, 18 ml; rate 2 ml/sec; 300 mg/ml) through the catheter in the common hepatic.\nPerform a DP-CBCT: two 5 sec CBCT scans (early arterial and late venous phases) were acquired during a single contrast media injection with a 3 sec delay before the first scan. At the conclusion of the 1st scan, the patient is instructed to breathe 1-2x and then continue to hold breath at end-expiration apnea during the second scan starts.\n3. Intervention Planning: Tumor Detection, Tumor Segmentation, 3D Roadmap\nAnalyze the two scans (early arterial and late venous phases) automatically codisplayed in the workstation.\nControl the automatic registration and overlay of the two scans and if necessary adjust manually, and validate the two CBCT acquisitions to make them match to each other in all three planes (axial, coronal, and sagittal planes)\nCorrelate the targeted tumor(s) defined by CBCT with other preprocedural imaging. Select the prototype software to plan access to the targeted lesions and generate a 3D roadmap to guide device navigation.\nSegment the targeted tumor(s) from where best visualized; often the delayed venous phase scan unless better visualization is achieved on arterial phase. Atypical HCC (hypo-vascular) can also be easily segmented. A few seconds after the DP CBCT is completed, the reconstruction is ready (this rapid reconstruction is enabled by a fiber optic link between the image acquisition and the reconstruction computers).\nVerify the vessel path on CBCT images automatically detected from the early arterial phase CBCT and extracted by the software in sagittal, coronal and axial planes to ensure that the vessel chosen and path mapped do supply the desired tumor(s).",
    "Overlay and confirm segmented tumor(s) and tumor(s) feeding arteries, and the 3D roadmap on fluoroscopy.\n4. Reach the Tumor\nPlan the intervention to target the tumor(s), like internet-based highway maps.\nUse the 3D overlayed roadmap synchronized on live fluoroscopy to C-arm and table movement to catheterize targeted tumor(s) feeding arteries.\nChoose the best C-arm/table position, angle, and magnification that best facilitates catheterization to minimize vessel overlap and foreshortening to easily target tumor(s).\nIf needed, adjust the 3D roadmap to better match on the fluoroscopy in case of patient movement to mitigate the need for creating a new roadmap and minimize the need for additional contrast injection and X-ray exposure.\nReach each tumor(s) feeding artery using the 3D navigation guidance, to minimizing delivery of chemo-embolizing material to healthy tissue and maximizing the selective drug dose to the tumor(s).\n5. Treat the Tumor - Measurement of Treatment Success\nEmbolize the targeted tumor(s) with drug eluding beads thought the microcatheter to the contrast stasis into the tumor before detection of any backflow.\nPerform a post-TACE DP-CBCT (as described above) to assess the treatment success.\nAssess a defect of contrast enhancement in the target tumor(s) (due to blood vessel embolization) after a DEB-TACE\nIn case of minimal decrease of tumor enhancement and/or there is not enhancement defect, look for aberrant vessels feeding the tumor, complete embolization with additional drug eluding beads agent volume or treat extra-hepatic vessels in the same or future TACE session. Perform additional selective CBCT during selective hepatic arteriography within collateralized or parasitized vasculature to define alternate tumor supplies if necessary.\nAt the end of the procedure, remove the microcatheter, the catheter, and the sheath and make homeostasis."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}