{
  "id": 7603,
  "origin_website": "Bio",
  "title": "Vestibular Organ Dissection and Whole-Mount Immunolabeling in Mouse",
  "procedures": [
    "Transcardiac perfusionPerform transcardiac perfusion with heparinized saline warmed to 37°C (see Recipe 1) until the fluid coming out of the heart runs almost clear, ~6 min.Perfuse with 4% paraformaldehyde (PFA) in 0.1 M phosphate buffer (PB) cooled to 4°C (on ice; see Recipe 2). Perfuse ~30 mL through heart.Note: In this protocol, this perfusion is the only fixation of the vestibular organs, so it must be done successfully. We have not found post-fixation to be necessary and were concerned that it may reduce the antigenicity of proteins during immunohistochemistry. Brain and temporal bone extractionDecapitate the mouse with large sharp scissors.Using small spring scissors and forceps, carefully remove the top of the skull to expose the brain (Figure 1A–B).Tip the brain forward and use small spring scissors to cut the vestibulocochlear nerves close to where they enter the brain (Figure 1C–D). The vestibular ganglion lies in the temporal bone at the base of the nerve, so take care not to damage it.Note: Put the brain in 4% PFA in PBS, if retaining for histology. The temporal bones (bulla) lie along the base of the skull on each side. Use scissors to cut them out of the base of the skull and place them PBS (Figure 1E–F).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4416/bioprotoc-12-10-4416-g001.jpgFigure 1. Brain and temporal bone extraction. A) Cuts are made along the skull sutures. B) Skull plates above the brain are removed. C) The vestibulocochlear nerve can be visualized when the skull below the brain is peeled downward. D) The vestibulocochlear nerve is cut where it enters the inner ear. CN- Cochlear Nucleus. PF- Paraflocculus. E) The temporal bones are revealed (outlined) when the brain is tipped forward and the trigeminal nerves are cut. F) Extracted temporal bones. * indicate the vestibulocochlear nerves.",
    "Vestibular organ dissectionPlace the bulla in a Sylgard 184-coated culture dish filled with PBS.Lighting the preparation with a fiber light at various oblique angles can improve the contrast of the tissue in the dish by creating shadows.Use large forceps to grip the entire bulla and hold it in place against the soft Sylgard on the bottom of the dish (Figure 2A).The Sylgard prevents the bulla from sliding. Optional: A permanent marker (sharpie) can be used to darken the outside of the dish to contrast it with the light-colored end organs and bone, or an inert dye, such as India ink, can be added to the Sylgard during preparation of the dishes.With your other hand, use fine forceps or a needle to remove the vestibular ganglion in one piece where it sits between the cochlea and labyrinths (Figure 1F). It may be difficult to tell where the vestibular ganglion is on the nerve, so it is advantageous to take out the whole nerve. Place the vestibular ganglion in a labeled 48-well plate, using a BSA-coated 200 µL pipette:The nerve may separate into two parts, presumably the auditory and vestibular divisions. Care must be taken when removing the nerve and vestibular ganglion to avoid damaging the utricle, which is attached to the base of the nerve. Do not insert the forceps too deep into where the nerve comes through the bone, as they might damage the utricle.Use of BSA-coated 200 µL pipette: Withdraw ~100 µL of PBS with the nerve into the pipette tip. It is optimal to keep the nerve (or end organ) suspended in solution in the pipette. It is more likely to stick to the inside of the pipette tip if it is floating at the top of the column of fluid in the tip.",
    "Prepare 10% BSA in PBS, cut the ends off the tips to make the opening large enough to accommodate the vestibular organs (~2 mm), pipette the 10% BSA into the pipette and out several times, and then eject and let dry. Store in a petri dish to prevent dust accumulation.Pigmented melanocytes that overlie the utricle can be visualized through the bone, which can help identify its position. Use laminectomy forceps or other stout forceps to break off small pieces of this bone, which will reveal the three vestibular end organs that are joined together- the utricle, horizontal canal crista and anterior canal crista. These may be removed together in one piece (Figure 2B–C).On the other side of the area from which the vestibular ganglion was removed, the vertical canal end organ can be removed in a similar manner, by carefully removing the overlying bone with laminectomy forceps and then sliding fine forceps underneath it to sever the nerve and detach it from the bone (Figure 2D).The sacculus is on the other side of the temporal bone near the cochlea and has no melanocytes, so it is difficult to see (Figure 2E). It needs to be scraped from the bone more than the other end organs, which makes the sacculus the most difficult to remove without damage.Put all the end organs in PBS as they are removed.It may be useful to have a picture of the vestibular system available to clarify the locations of the end organs. Keep in mind that the structures of the left and right ears are mirror images.Practice is required to reach the skill level required to dissect all five vestibular organs without damage or loss.",
    "After becoming skilled at this procedure, time and patience remain necessary, as a careful dissection of each ear may require 30–60 min.Best results are obtained when the dissection is followed by immunohistochemical processing on the same day.In addition, the cochlea can be similarly removed in a few sections and processed following these guidelines.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4416/bioprotoc-12-10-4416-g002.jpgFigure 2. Vestibular organ dissection. A) The temporal bone grasped with forceps. Acronyms for the five vestibular end-organs are positioned over their locations. UT- Utricle. SA- Sacculus. AC- Anterior Canal. HC- Horizontal Canal. VC- Vertical Canal. B) After removal of some of the overlying bone, four of the vestibular end organs are revealed. C) Utricle and attached anterior canal and horizontal canal cristae. D) Dissected vertical canal crista. E) Dissected sacculus. F) Applying a coverslip to the vestibular organs positioned within the spacer.Immunohistochemistry of vestibular end organsTo transfer the end organs during rinses, etc., use a BSA-coated 200 µL pipette tip, as described above. Transfer the end organs to a different well in the 48-well plate containing the new solution (at least 200 µL in a 48-well plate).Moving all of the end organs down one row may help keep them organized.The previous solution that is transferred with the end organ in the pipette should be as small in volume as possible. A gentle flick may be necessary to cause the end organ to fall to the bottom of the column of solution that is suspended in the pipette tip and can then be ejected with minimal fluid.Permeabilize and block in 2% Triton X-100, 5% NDS 1 h room temperature on an orbital shaker.This high concentration of detergent may be necessary for optimal staining of this preparation.Remove the end organs from the permeabilization and blocking buffer and place in primary antibody diluted in 5% NDS.",
    "Incubate in primary antibody overnight on an orbital shaker at 4 °C (Table 1). Incubation for up to 3 days may enhance antibody penetration.We avoid rinsing between these steps as each transfer of the end organs represents a risk of damage or loss.Table 1. Primary antibodies table:",
    "﻿Antibody,Source,Concentration\nRabbit polyclonal anti-calretinin,\"Swant, 7697\",1:500\nChicken polyclonal anti-GFP,\"Aves Labs, GFP-1020\",1:500\nGoat polyclonal anti-mCherry,\"Sicgen, AB0040-200\",1:500\nRinse 3 × 10 min in PBS by removing end organs from primary and placing into a different well in the 48-well plate containing fresh PBS.Transfer end organs into secondary antibodies diluted in 5% NDS and incubate overnight 4°C on orbital shaker (Table 2).Table 2. Secondary antibodies table:\n﻿Antibody,Source,Concentration\nDonkey polyclonal anti-rabbit Cy3,\"Jackson ImmunoResearch Labs, 711-165-152\",1:500\nDonkey polyclonal anti-chicken Alexa Fluor 488,\"Jackson ImmunoResearch Labs, 703-545-155\",1:500\nDonkey polyclonal anti-goat Cy3,\"Jackson ImmunoResearch Labs, 705-165-147\",1:500",
    "Rinse 3 × 10 min in PBS by removing end organs from primary and placing into a different well in the 48-well plate containing fresh PBS.Mounting and coverslippingPlace an 8-well 120 µm thick spacer onto a microscope slide (SecureSeal): First remove the plastic side and put the spacer on the slide. Flatten it down by running a flat object along it, taking care to not contaminate the glass of the microscope slide. Then, remove the paper side. It will be sticky from now until the coverslip is placed over it, so be extremely careful to avoid accidentally touching it. In our experience, this is preferred over trying to remove the paper and expose the adhesive after laying out all the end organs as their positioning is easily disrupted. Alternatively, each end organ can be placed on a separate slide with a single well spacer.Place one end organ on the slide within the spacer in a pool of PBS. Using fine forceps, remove the melanocytes or any membranes that would be between the coverslip and the face of the end organ. The canal cristae typically lie on their side, which is optimal for imaging. The utricle and sacculus can be laid such that the nerve is against the microscope slide with the hair cell side pointing upward toward the coverslip. This step is critical for good imaging. Apply more PBS so that it does not dry out while mounting the others, but not so much that it is free to float away from the microscope slide. Repeat for each end organ and the vestibular ganglion or nerve in separate wells of the spacer.Ensure that all the end organs are oriented properly, and then remove excess PBS with a normal 200 µL pipette tip (unmodified).",
    "Let it dry slightly so that they stick to the positively charged Superfrost Plus microscope slides.Apply a generous amount of CFM-3 mounting media to each well. Apply coverslip to the adhesive SecureSeal spacer (Figure 2F).Notes:  It is far better for excess media to flow out when applying the coverslip than for air bubbles to be trapped in the wells; apply ample mountant. Note that repositioning of the coverslip is nearly impossible due to the adhesive face of the SecureSeal spacer, so apply it carefully. Confocal imagingThis preparation can be imaged with typical confocal imaging described elsewhere. Long-working distance objectives may be necessary to image through the entire end organ and underlying nerve. We used a Zeiss 25× 0.8 NA oil immersion objective on a Zeiss LSM 880 for full end organ imaging (Figure 3). For imaging of smaller areas, we used a Zeiss 63× 1.4 NA oil immersion objective (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4416/bioprotoc-12-10-4416-g003.jpgFigure 3. Vestibular end organ whole mounts imaged with 25× objective. A) The utricular macula, anterior canal crista, and horizontal canal crista can be dissected out of the temporal bone in one piece. Calretinin (magenta) is expressed in Type I hair cells. Single nerve fibers are labeled with green fluorescent protein (GFP) that has been amplified with Alexa Fluor 488. B-C) The vertical canal (B) and sacculus (C) are separated during the dissection and are therefore processed and mounted separately.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4416/bioprotoc-12-10-4416-g004.jpgFigure 4. Vestibular hair cells and peripheral vestibular afferents imaged with 63× objective. A) Single optical plane showing Myo7A (cyan), present in all hair cells; calretinin (magenta), present in Type I hair cells; GFP (green), expressed by an retrograde-AAV injected into the cerebellum and amplified with an anti-GFP antibody; and merged image showing that the retrolabeled peripheral afferent is a flask shape and surrounds a calretinin expressing hair cell.",
    "B) Maximum intensity projection of 24 µm thick image stack showing calretinin (magenta) and GFP (green)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}