{
  "id": 16964,
  "origin_website": "Jove",
  "title": "Real-Time Detection of Ferulic Acid Effects on Rat Left Ventricle Using Pressure-Volume Conductivity Catheter",
  "procedures": [
    "The animal protocol was reviewed and approved by the Management Committee from Chengdu University of Traditional Chinese Medicine (Record No. 2023-04). Male Sprague Dawley (SD) rats (280 ± 20 g, 8-10 weeks old) were used for the present study. The rats were kept in an animal chamber and were free to drink and eat.\n1. Solution preparation\nPrepare 0.9% NaCl solution to be used to keep the work area adequately moist.\nTo prepare 20% hypertonic NaCl solution, dissolve 2 g of NaCl in 10 mL of double distilled water (ddH2O). In order to determine the parallel conductivity of the myocardium, it is necessary to alter the conductivity of the intraventricular liquid.\nPrepare 1% enzyme-active powdered detergent solution. Use this at the completion of the experiment, to immerse the pressure-volume electrical catheter in the solution for 1-2 h.\nPrepare FA solution by dissolving 10 mg of ferulic acid in 20 mL of ddH2O. Filter the solution through a 0.22 µm membrane. Inject the rat with 1 mL/kg ferulic acid solution.\n2. Preparation of the sensor\nImmerse the pressure-volume sensor in 0.9% NaCl solution at 37 °C for about 30-60 min before the start of the experiment, which facilitates the stability of the experimental data.\nConnect the experimental apparatus. The system for measuring pressure-volume loops consists of a pressure-volume catheter, two control units, a recording unit, and computer running software. The pressure-volume loop module in the software will provide a reference experimental procedure.\nPress the Start button and the software will automatically record the monitoring data from the pressure-volume sensor.\nUse the Miro-Tip Pressure Volume (MPVS) software to calibrate the pressure and conductivity.\n3. Pre-experimental rat preparation\nAdminister ketamine (50 mg/kg) and fentanyl (0.25 mg/kg) to the rats via intramuscular injection.",
    "Press the toes of the rats to determine if they are fully sedated. Emotion affects the physiology state of rats and pain causes alterations in cardiac function16. Use small animal shavers and depilatory creams to remove hair on surgical sites. Use iodophor and 75% alcohol to wipe the skin to maintain sterility.\nImmobilize fully anesthetized rats on an isothermal heating plate with the back in contact with the heating plate.\nInsert a temperature probe coated with petroleum jelly into the rectum of the rat. Maintain the rat body temperature at 37 °C ± 0.5 by adjusting the heating plate.\n\tNOTE: It is necessary to keep the airway unobstructed during the experiment.\n4. Catheter insertion into the right carotid artery\nCut the skin on the right side of the median line of the neck of rats, longitudinally. Make a 4 cm incision and separate muscle and connective tissue by forceps. The carotid artery situated on the right side of the trachea is visible. The right carotid artery of the rat is dark red, strongly pulsating, and has a white vagus nerve parallel to it.\nSeparate the carotid artery from other tissues and nerves using forceps. Place three 5-0 surgical lines below the clean carotid artery. Drip sterile 0.9% sodium chloride solution onto the surgical area to maintain the moistening of the carotid artery.\nCut the skin above the left clavicle and peel off the tissue around the jugular vein. Then, cross the left jugular vein using a 5-0 surgical line.",
    "Use arterial clips to suspend blood flow proximally, using micro scissors to cut a section in the vessel where blood flow has stopped. It is normal for a small amount of blood to appear in the wound cross-section. If blood continues to pour out in jets, lift the proximal surgical line and apply the arterial clamp again.\nInsert the catheter from the cross-section along the carotid artery deep into the left ventricle. Ensure the lowest systolic pressure value after entering the left ventricle is close to 0 mmHg.\nTo obtain a reasonable pressure-volume relationship, slightly adjust the pressure-volume catheter in the ventricular chamber. To prevent massive blood loss and the catheter from changing position due to heartbeat, ligate the proximal end of the surgical line.\n\tNOTE: The body temperature, anesthesia level, pressure signal, and conductance signal of the rat should remain stable during this process. The respiratory tract of the rat should be kept open.\n5. Drug injection and conductivity calibration\nMaintain the position of the pressure volume catheter in the ventricular chamber, after the data stabilizes, ligate the surgical line distal to the jugular vein ligated and slowly inject upto 1 mL/kg of ferulic acid solution. Observe for 5-10 min.\nInject 50 µL of 20% NaCl solution from the left jugular vein to remove the parallel conductance generated by the myocardium. The volume range of the parallel conductance was approximately 130-280 µL5. Repeat this 3x at an interval of 2 min.\nAfter ventricular pressure and volume testing in rats, take blood from the rat's abdominal aorta using a blood collection needle. Place the collected blood in a sodium heparin collection tube and invert up and down 2x to prevent blood clotting. Inject experimental rats with a sufficient amount of anesthesia to kill them.",
    "Perform conversion of measured conductance to actual blood volume using rat volume calibration tubes. Place blood mixed with sodium heparin, sequentially, into the orifices of the calibration tube, and the catheter detects the conductance values of the blood in the different orifices and records them in the pressure-volume monitoring module.\n6. Data analysis\nBy adding the measured conductivity value of a known volume of blood to the specified location, the software automatically plots the curve and extrapolates the conductivity of the blood. Use at least three sets of blood conductivity values to deduce the blood conductivity of the rat under test. The blood conductivity is individualized. For each rat under the test, perform this procedure individually.\nHypertonic calibration: By adding the data obtained from three injections of hypertonic saline to a specified location, the software calculates parallel conductance averages and automatically calibrates the experimental data.\nUtilize regions with stable blood pressure and conductance values to analyze the left ventricular function of rats.\nClick on Analyze and the software will automatically calculate a variety of parameters based on the selected area, including EF (left ventricular ejection fractions) SW (stroke work), and CO (cardiac output), etc.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}