{
  "id": 9985,
  "origin_website": "Jove",
  "title": "Amplitude-Modulated Electrodeformation to Evaluate Mechanical Fatigue of Biological Cells",
  "procedures": [
    "Deidentified human whole blood was commercially obtained. Work involving the blood samples was performed in a biosafety level 2 laboratory utilizing protocols approved by the Institutional Biosafety Committee at Florida Atlantic University.\n1. Microfluidic device preparation\nTape down the SU-8 master silicon wafer for the microfluidic channel design on the inside of a plastic 14 cm Petri dish and clean it with N2 gas.\nWeigh 60 g of polydimethylsiloxane (PDMS) base and 6 g of PDMS curing agent in a paper cup. Mix the two parts using a wooden spatula until the mixture is a cloudy white color.\nPour the PDMS mixture into the plastic Petri dish containing the silicon wafer. Place the Petri dish into a vacuum desiccator with a 3-way stopcock. Turn the valve of the stopcock to connect the vacuum to the desiccator chamber to remove air bubbles from the PDMS.\nReintroduce air into the desiccator chamber by adjusting the stopcock valve to connect the desiccator chamber to the ambient in approximately 5 min cycles. Repeat until all air bubbles are removed from the features of the channels.\nPlace the Petri dish inside an oven at 70 ˚C for 4 h. Once time has elapsed, remove the Petri dish, allow it to cool down to room temperature, and place it on a cutting mat.\nUsing a scalpel, cut out the portion of the PDMS above the silicon wafer. Place the cutout PDMS in between the two sheets of lab-wrapping film. The gap formed between the indent of the microchannel and the semi-transparent film facilitates the identification of the location of the microfluidic channel as well as its respective inlet and outlet.",
    "Using a razor blade, cut out an individual channel from the large PDMS. Punch a 3 mm inlet hole and 1.5 mm outlet hole using biopsy punches respective to the two sizes (Figure 1A).\nPlace the hole-punched channel, with the channel side facing up, onto a clean glass slide. Place a 20 mm x 15 mm glass substrate containing thin-film Indium Tin Oxide (ITO) interdigitated electrodes on the same glass slide with electrodes facing up.\nGently place the glass slide with PDMS and substrate into a plasma cleaner. Close the gas valve, turn ON the pump switch, and wait 2 min to obtain a sensor reading of 600 - 800 mTorr.\nTurn ON the power switch and wait for 30 s. Turn the RF power knob from low to high and wait for 1 min.\nThen, reverse the sequence by turning the RF knob to the low, power switch to OFF, pump switch to OFF, and opening the gas valve.\nImmediately after opening the chamber of the plasma cleaner, lift and rotate the PDMS so that the channel side is facing down (180˚). Place the channel on the top of the ITO substrate. The bonding process has begun.\nUsing tweezers, gently press down on the corners of the PDMS for about 3 s. Avoid pressing onto the channel itself.\n\tNOTE: The bonding process happens spontaneously upon physical contact between the two treated surfaces.\nLoad the priming medium into a 1 mL syringe with a 23 G needle. Carefully wet the channel by inserting the needle straight into the inlet well and then releasing the medium. Operate slowly. Do not introduce air bubbles. Incubate for at least 3 min.",
    "Remove the prime medium using a 10 µL pipette tip. Wash the channel with DEP medium 3 times by inserting the DEP medium into the channel. Keep the channel wet at all times.\n2. Test fixture\nNOTE: The test fixture is designed using 3D CAD software and includes a base housing unit and a top unit (Figure 1B). Then, it is manufactured using a 3-axis CNC milling machine with a standard tolerance limit of around ± 0.005-inch dimension of the test fixture is checked using an electronic caliper (not shown). Sterility of the fixture is not required for the in vitro biomechanical testing.\nPre-solder wires into the solder cup ends of two sets of spring piston connectors.\nInsert the spring piston connectors into the top unit and create a permanent bonding by adding a drop of epoxy glue.\n3. Preparation of electrodeformation working buffer\nTo prepare the DEP medium, weigh 12.75 g of sucrose and 0.45 g of dextrose using a scale.\nDissolve both powders into a single container with 150 mL of deionized (DI) water and 3.5 mL of phosphate-buffered saline (PBS).\nUsing a low-range conductivity tester, measure the conductivity and ensure it is 0.04 S/m (Figure 2).\n\tNOTE: A different conductivity value can be used, which could change the sign and magnitude of the resultant DEP force11. Electrodeformation, however, requires a positive DEP force.\nUsing an osmometer, confirm the osmolarity to be within the normal range of the blood plasma, 275 to 295 mOsm/kg of water (Figure 3). Store at 4 ˚C. The DEP medium is now prepared.\nIn a 15 mL tube, dissolve 0.5 g of bovine serum albumin (BSA) in 10 mL of the DEP medium. Mix thoroughly. The device's prime medium is now prepared.\n4. Preparation of cell suspension",
    "Wash 20 µL of the whole blood by centrifuging the blood with 1 mL of PBS at 268 x g for 3 min. Discard the supernatant.\nResuspend the RBCs in 1 mL of PBS. Gently pipette to mix. Wash the RBCs for 3 min at 268 x g and discard the supernatant.\nExtract 5 µL of RBC pellet using a 10 µL micropipette tip and fully dispense into 1 mL of the DEP medium. Wash the cells by centrifuging at 268 x g for 3 min.\nDiscard the supernatant and resuspend the RBCs in 1 mL of DEP medium. Gently pipette to mix.\nWash the RBCs for 3 min at 268 x g and discard the supernatant. Pipette 2 µL of RBC pellet into 500 µL of DEP medium. The cell suspension is now prepared with a concentration within a range of 1 - 6.2 x 104 cells/µL12, which can be confirmed using a standard cell counting slide.\n5. Electrodeformation setup and fatigue testing\nPlace the microfluidic device into the bottom part of the test fixture. Align the top part of the fixture to the device and assemble the two parts using two sets of nylon screws and nuts (Figure 4).\nPlace the test fixture on the microscope stage. Locate one desired set of electrodes under the microscope.\nConnect the corresponding pair of electrode wires that match the located electrode set to the output terminal of the function generator (Figure 4).\nRemove 5 µL of the DEP medium from the 3 mm inlet of the microfluidic channel. Slowly load 5 µL of the cell suspension into the inlet using a 10 µL pipette tip.\nAllow cells to settle down for 1 min. If necessary, add an additional DEP medium to the inlet to push cells into the channel.",
    "Observe the channel under 20x magnification. Use a 414/46 nm bandpass filter to enhance the contrast of the imaging.\nPress the Sine button and define a sine wave with a 2 VRMS amplitude at 3 MHz frequency. Press the Mod button to enable modulation. Change the wave mode into ASK by pressing the Type option.\nSet the modulation frequency to 250 mHz, which corresponds to a 4 s loading-unloading period (Figure 5A). Turn ON the output of the function generator.\nRecord a 1 min video every 10 min at 30 frames per s (fps).\n6. Characterization of RBC deformation\nUsing a video editing application, open .avi files recorded in the previous step by pressing Ctrl+O. Use the timeline to choose a frame of interest and set the selection start and end frames to be identical by pressing the Home key and then the End key on the keyboard.\nExport the image frame. Select the output format to be JPEG and press OK.\nOpen the ImageJ application and load the images saved in the previous step. Begin by setting the needed measurements by pressing Analyze > Set Measurements and ensuring the check boxes for Area, Perimeter, and Fit Ellipse are checked. Press OK.\nNext, convert the image to grayscale by choosing Image > Type > 8-bit.\nThen convert the image to binary using Image > Adjust > Thresholding. In the Threshold dialog box, adjust the two sliders as needed. Press Apply and then close the Threshold dialog box.\nChoose Analyze > Tools > ROI Manager. In the ROI Manager, press the checkbox labeled Show All. Do not close this box.",
    "Select the Wand (tracing) Tool, select an applicable cell in the image, and press T on the keyboard. The selected cell will be numbered. A new cell can be selected again. Select all applicable cells to be measured. The applicable cells are identified as those that are isolated from other cells. The number of these cells could range from 50 to 200 in a single field of view.\nReturn to the ROI Manager box and press Measure. This opens the Results box. Columns labeled Major and Minor are the lengths of the fitted ellipse major and minor axes (in pixels), respectively. Choose File > Save As to export the measurements as a CSV formatted file.\nUsing any appropriate computational analysis software, calculate the quotient of Major and Minor.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}