{
  "id": 17523,
  "origin_website": "Jove",
  "title": "Establishing a Multidisciplinary Cavernous Carotid Injury Simulation to Train Neurosurgical, Otolaryngology, and Anesthesia Residents",
  "procedures": [
    "Cadaveric heads used in this protocol were acquired from the Oregon Health & Science University Body Donation Program. All methods described have been approved by the Oregon Health & Science University Institutional Review Board (IRB).\n1. Head Preparation\nSecure the fresh cadaveric head in the sink with the neck facing upwards.\nUsing a 1:100 anti-coagulant citrate dextrose solution, rinse out the jugular veins, vertebral, and carotid arteries bilaterally. Start by inserting a 5mm diameter cannula into the right jugular vein and secure the vessel around the cannula with a 5-inch hemostat clamp. Run the perfusion pump for 15 min. Rotate the tube to the left jugular vein and then carotid arteries and repeat the washout for 15 min at each vessel. Use a 3 mm diameter cannula for the vertebral arteries. The fluid should be clear, not bloody, at the end of the washout.\nLet the heads dry overnight with the face upwards and the neck positioned at a 45° angle with a block positioned beneath it. Store in a cold room at 5 °C.\nThe following day, embed the head in 2 L of embalming solution and store it in a bucket with formalin fixative.\n\tCaution: embalming solution and formalin fixative are corrosive. Please wear protective equipment.\n2. Tissue Dissection\nSupport the head with a block and position it in the neutral orientation avoiding over flexion or extension.\nUse a zero degree endoscope of 4 mm diameter and 18 cm length.\nLateralize the middle turbinates and perform a bilateral sphenoidotomy. Make the incision at the articulation of the rostrum and vomer.\nClear the mucoperiosteum with a cottle elevator and remove the rostral bone bilaterally with a rongeur.",
    "Drill flush to the floor of the sphenoid sinus and laterally to the medial orbital walls bilaterally with a high-speed drill and matchstick type drill head.\n3. Preparing Cavernous Carotid Injury\nVisualize the regions of the sella, clival structures, and cavernous carotid arteries. Remove the bone overlying the sella and cavernous carotid artery on the right with a rongeur.\n\tNOTE: Multiple options can be utilized for the carotid injury. Option 1: use an 11-blade knife to make a 3-mm laceration in the right internal carotid artery at the level of the genu. Option 2: puncture directly into the vessel with a nerve hook to produce a tear. Option 3: take a small piece of the vessel wall with a rongeur.\n4. Perfusion Set-up\nInsert a 5mm diameter cannula into the common carotid artery and secure with a 5-inch hemostat clamp.\nConnect the cannula to a pressurized perfusion pump.\nPrepare artificial blood consisting of red food coloring, water, and commercially purchased vampire blood [see Table of Materials]. Make artificial blood of the same relative density of real blood by using a 3:1 ratio of water to vampire blood. Add 2 drops of red food coloring for each 250 mL of water added.\n\tNOTE: Artificial blood may be reused for multiple simulations. 3 liters of blood should be prepared for each cadaveric head prior to the start of simulation. It can be stored at room temperature, but should be shaken and mixed prior to use.\n5. Establish Realistic Bleeding\nSet up an arterial line via the cannulated carotid artery.\nStart the perfusion pump and measure actual mean arterial pressure (MAP) delivered to the cadaver head via an arterial line transducer and vital signs monitor. Visualize the realism of the carotid injury via endoscopic examination.",
    "NOTE: MAPs of 65-110 mm Hg should be used to produce realistic bleeding parameters depending on the clinical simulation scenario. Flow rate can be adjusted on the perfusion pump in order to reach physiologic MAPs.\n6. Training Resident Learners\nPair one neurosurgery or ENT resident with one anesthesia resident for each of the simulation scenarios.\n\t\nGive resident teams approximately 10 min to complete each scenario, with a 10 min debrief (5 min specialty specific, 5 min interprofessional) after each scenario.\nProvide a specialty-specific debrief for 5 mins.\nDeliver interprofessional debrief to residents from both specialties for 5 mins.\nSurgery residents\n\tNOTE: The following steps are to be carried out as instructed by the supervising faculty.\n\t\nProvide each learner with the same bony exposure, location, and size of cavernous carotid injury.\nHold the endoscope and provide instructions to the surgery resident for how to manage vascular control. The residents work with the supervising faculty to manage the vascular injury using the 4-handed approach.\nManage the scenario by 1) giving instructions to anesthesia residents to decrease blood pressure 2) asking for proximal vascular control, 3) using suction to guide the bleeding away from the endoscope, and 4) using a pituitary instrument to place a half cottonoid patty over the bleeding site and apply pressure. The bleeding must be adequately controlled with suction to visualize where to place the cottonoid patty.\nExchange the cottonoid patty for a free muscle graft harvested from the temporalis muscle. Place the muscle directly over the right cavernous carotid artery injury with a good seal over the incision site. Blood should not be flowing into the cavernous cavity when the muscle patch is in place.\nAnesthesia residents",
    "Connect the anesthesia station to a simulated mannequin that is connected to a laptop, patient monitor, anesthesia cart with drug tray, anesthesia machine, anesthesia monitor, IV poles, IV bag, and two functional IV units.\nSetup arterial line with pressure monitor.\nProvide anesthesia residents with instructions on use of provided materials, computer, and monitor before starting the simulation.\nTask anesthesia residents with medical management and working as a team with the surgical resident during the simulation scenarios.\n7. Enhancing realism\nGive learners different clinical scenarios for patients with varying comorbidities. The comorbid factors will cause changes in bleeding rate and pressure, which should be manually controlled by the faculty by adjusting the perfusion pump settings.\nTask learners with technical and medical management challenges of catastrophic bleeding, and have learners appreciate the medical ramifications that develop.\nIncorporate a simulated mannequin with the cadaveric head model to provide realistic feedback about changes in vital signs and patient stability.\n8. Crisis management\nProvide learners with cases of increasing complexity and have them manage multiple changes in vital signs while successfully maintaining vascular control.\n\tNOTE: Learners should effectively communicate so that team members address worsening patient status in a quick and effective manner.\n9. Charting Outcomes\nProvide learners with post-simulation surveys to assess the value of the simulation.\nFacilitators should provide focused sessions with the individual learner to discuss ways to improve on communication and technique.\nProvide pre- and post-simulation anatomy exams to assess knowledge gain.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}