{
  "id": 18671,
  "origin_website": "Jove",
  "title": "Techniques for Processing Eyes Implanted with a Retinal Prosthesis for Localized Histopathological Analysis: Part 2 Epiretinal Implants with Retinal Tacks",
  "procedures": [
    "NOTE: All procedures were approved by The Royal Victorian Eye and Ear Hospital’s Animal Research & Ethics Committee (RVEEH AEC; #10-199AB). The subjects were treated according to the National Health and Medical Research Council’s “Australian Code of Practice for the Care and Use of Animals for Scientific Purposes” (2013) and the “Prevention of Cruelty to Animals Act” (1986; and amendments). All surgical, clinical assessment and electrophysiological procedures were carried out under anaesthesia and all efforts were made to minimize suffering.\n1. Enucleation and Fixation\nNOTE: Follow the enucleation and fixation procedure described in detail in the companion manuscript16, taking extra care around device cables or vitrectomy ports, if present. Briefly, this involves:\nTranscardially perfuse the subject with warm saline followed by cold neutral buffered formalin.\nTie sutures to the eyeball to serve as landmarks.\nEnucleate the eye16, maintaining the device cables and any attachment patches/tabs.\nPost-fix the eye in Davidson’s solution for 18 - 36 hr.\nTransfer to 50% ethanol for 6 - 8 hr.\nTransfer to 70% ethanol and refrigerate (4 °C) until dissection.\n2. Electrode Removal and Dissection.\nNOTE: Not all epiretinal implants will have the same form factor, but in general there will be an electrode array and some form of flexible and conformable carrier material. Devices that are tacked to the retina feature a tack hole where the metal tack penetrates the array and the back of the eye, keeping these together.\nVisualise the implant and the point where it is secured to the retina.\n\t\nUsing a 15 degree blade make a circumferential trans-corneal incision and remove the corneal cap to expose the underlying iris and lens.",
    "Using a 15 degree blade, disinsert the zonular fibres of the lens and remove the lens in toto, exposing the posterior chamber with the epiretinal implant and the metal tack in situ.\nDepending on the implant and the study being performed, remove extraneous components before further dissection.\n\tNOTE: In the present example, the epiretinal array being evaluated consisted of a prototype hermetic diamond electrode and electronics package housed within a conformal silicone carrier (produced in house; refer to 20).\n\t\nHere, carefully extract the diamond electrode package by fine dissection with a scalpel. Leave the silicone body of the implant along with the retinal tack and the remnants of the platinum wiring (Figure 2). If an embedded array/housing is not part of the device design under investigation, then omit this step (2.2).\nCarefully dissect a sample that includes the tack and surrounding tissue in the desired orientation. Use fine dissection scissors to cut full thickness strips from the back of the eye, including sclera, choroid and retina. Take a sample, which gives a longitudinal cross section of the tack, showing all the retinal layers adjacent to the tack (Figure 2)\n\tNOTE: The desired orientation for the sample may differ depending on the particular result desired. For example, if one wishes to examine the proximity of the tack damage to the optic disk then the optic disk should be included within the sample.\n3. Dehydration, Embedding, Mounting, Grinding, Staining, and Imaging\nDehydrate the sample over three days in progressive ethanol stages:\n\t\nDehydrate the sample in 70% ethanol for 2 hr twice.\nDehydrate the sample in 80% ethanol for 2 hr twice and then O/N.\nDehydrate the sample in 90% ethanol for 2 hr twice.\nDehydrate the sample in 100% ethanol for 2 hr twice and then O/N.",
    "Dehydrate the sample in 100% acetone for 2 hr twice.\n\t\nRemove the sample from the acetone and observe it under a light microscope as it air-dries at RT. Transfer the sample to epoxy (refer to step 3.4) just before it starts to curl/collapse.\n\t\tNOTE: Removing liquid from the soft tissues results in collapsed cells and shrinkage. An appreciation of when the tissue curling/collapse occurs is developed with experience.\nPrepare medical grade epoxy resin according to manufacturer’s directions. To cure the resin, use either 55 °C for 1 hr or 24 hr at RT. Place in a vacuum chamber for ~ 5 min at ~ 50 mbar for removal of air bubbles. Regulate the vacuum manually as an excessive vacuum will cause the epoxy mixture to boil and degassing will not occur effectively\n\tNOTE: Perform step 3.3 concurrently with step 3.2.\nEmbed the sample in clear epoxy resin. Immerse the eye tissue in degassed epoxy in an appropriate sealable container and leave O/N at RT to cure.\nTake care to embed the sample in the desired orientation (Figure 2) by resizing and re-embedding the cured epoxy block. Re-embed the resized block containing the eye tissue such that the long axis of the tack is oriented parallel to the bottom of the mould (yellow cup - Figure 3A).\nMount the resin in a grinding specimen holder and grind the sample (230 - 250 rpm with water on, manual grinding) using silicon carbide paper (starting with 800 grid; Figures 3C and 3E).\nFor staining, dip the ground surface in toluidine blue stain for 3 - 5 min, or until stain develops (Figure 3F).\nRinse with tap water (Figure 3G).",
    "Image the ground surface of the specimen with a high power dissection scope to visualize the cellular layers of the retina (Figure 3H). Apply a drop of distilled water on the top surface of the epoxy above the specimen to smooth the diffraction at the air-epoxy interface. Use an optical fibre ‘gooseneck’ light source to illuminate the sample.\nRepeat steps 3.6 – 3.9, each time grinding away a pre-set thickness of sample (minimum precise and reproducible grinding increment of specimen holder is 20 μm)."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}