{
  "id": 9529,
  "origin_website": "Jove",
  "title": "A Low Cost Setup for Behavioral Audiometry in Rodents",
  "procedures": [
    "1. Setup Assembling and Software Programming\nInstall a D/A card in a Personal Computer (e.g.: NI PCI 6229, National Instruments) and connect it to a breakout-box (e.g.: BNC-2110, National Instruments), both should support at least one input and one output channel with a sampling rate of at least 44.1 kHz each.\nConnect the output of the breakout-box via BNC cable to a sound amplifier (e.g: AMP75 wideband power amplifier, Thomas Wulf).\nInstall an infrared webcam (e.g.: Grand IP Camera Pro, GrandTec Electronics) for animal surveillance in darkness.\nInstall an Integrated Development Environment (e.g.: Matlab) to implement a program as defined by the flowchart given in Figure 1. A version running on Matlab 2007b may be obtained free of charge from the corresponding author.\nWithin a soundproof chamber install a loudspeaker on a table. Connect the speaker to the sound amplifier.\nInstall a piezo sensor (e.g. force sensor FSG15N1A, Honeywell) on top of an insulating board, support it with power and connect it via BNC cable to the input of the breakout-box; ground the sensor signal.\nBuild a measuring chamber from an acrylic glass tube adjusted to the size of the rodent to measure (for gerbils e.g.: length 15 cm, inner diameter 4.3 cm, outer diameter 4.8 cm). Fix a grate with a mesh width of 0.5 mm to the front of the tube and a cushioned door with a lock mechanism (e.g., a hook) to the rear. The fixation can be done with hot glue, for the door only the hinge and the bail for the hook is fixed to the tube.",
    "Attach foam plastic feet that fit the measuring tube dimensions on the insulating sensor board. Feet should support the tube under the front and rear end and lift the tube to the sensor level. Make sure that there is light contact between the piezo sensor and the measuring chamber.\nFix the sensor board with the measuring chamber centered in front of the speaker and put a microphone for sound control next to it (e.g. B&K Type 2669 / B&K Type 4190 connected to measuring amplifier B&K Type 2610, all: Bruel and Kjaer) at the level of the animals head so that it is not interfering with the tube.\nNote that the quality of your audiometric data will depend on the quality of your sound system. In any case, use the microphone and measuring amplifier to determine the frequency transfer function of your system prior to your first experiments and include a routine in your software to correct for this frequency transfer function to make the spectral output of your speaker flat.\nAlign the webcam with the setup so that one can monitor animal behavior.\n2. Behavioral Determination of Hearing Thresholds (Audiograms)\nTake the animal from its home cage and put it head first in the tube; close the door.",
    "Put the tube on the foam feet and the sensor. Switch off any light and close the door to the chamber. The chamber itself is not air conditioned but has the temperature, humidity and other environmental variables of the surrounding laboratory. Air change by ventilators is not advisable due to the induced noise but the volume of the chamber is supporting oxygen for the animal for many hours. Wait 15 min to allow the animal to get accustomed to the setup. The acclimatization time is beneficial for the animal as it can calm down at its own pace and get used to the tube. On the other hand, one does not see any differences in behavior during the acclimatization time over several session, which indicates that an extra session for familiarizing the animal with the tube and the chamber prior to the experiment is not needed.",
    "Start the program and define the parameters for stimulation (cf. also ref. 5): Stimuli consist of pure tones with different frequencies. The startle stimulus must be presented with a sound pressure level high enough to reproducibly elicit a startle response. In our lab we use intensities of 105 dB SPL (stimulus duration 6 ms including 2 ms cosine-squared rise and fall ramps) to elicit startle responses in Mongolian gerbils. The test stimuli preceding the startle stimuli are presented at varying frequencies and intensities in the range to be tested, usually from below hearing threshold to levels well above threshold and with frequencies covering the whole audible range of the species. Frequency and duration of the startle and the test stimulus are matched in each trial, the interstimulus interval between startle and test stimulus is set to 100 ms. Use at least 15 repetitions with randomized interstimulus intervals of 10 ± 2.5 sec for each frequency and intensity combination of the test stimuli (cf. Figure 2A, left). Subsequent test stimuli can be presented in either randomized or non-randomized order. If you are using a non-randomized approach (e.g., one test stimulus level fixed for all tested frequencies) allow 5 min of recovery between different stimulus sets. Note that the determined absolute threshold will depend on the randomization of the stimuli, but possible relative shifts of threshold will not (e.g. after acoustic trauma, cf. ref. 5).\nBefore analyzing the data, remove invalid trials from dataset (e.g., trials where the animal moved before the startle stimulus; cf. Figure 2B).\nWithin a time window of the first 50 ms after the startle stimulus, calculate the response amplitude (peak to peak between the first maximum to the first minimum of the response) and response latency (time from stimulus start to response onset) of each single trial.",
    "Fit a Boltzmann-function to the complete response amplitude data set of one frequency sorted for prestimulus intensity for all valid single trials. The 50% point of the Boltzmann-function 7 indicates the hearing threshold for this stimulation frequency.\n3. Acoustic Trauma and Quantification of Hearing Impairment\nPrepare ketamine-xylazine-anesthesia with a mixture of ketamine hydrochloride: 96 mg/kg (Ketamin-ratiopharm, Ratiopharm); xylazine hydrochloride: 4 mg/kg (Rompun 2%, Bayer); atropine sulfate: 1 mg/kg (Atropinsulfat, B. Braun Melsungen AG) and physiological NaCl-solution (Berlin-Chemie AG, Berlin) with a ratio of 9:1:2:8.\nInject the animal with 3 ml/kg of anesthesia subcutaneous. Wait until the animal is deeply anesthetized (ca. 5 min, check reflexes, e.g., use the pedal withdrawal reflex). To maintain anesthesia during measurements, continuously inject the anesthetic solution at a rate of 3 ml/kg/hr using a syringe pump. Control vital signs with appropriate equipment (e.g., breathing via camera) and keep the animal warm by placing it on a warming pad.\nInduce an acoustic trauma, e.g. using a loud pure tone: e.g. 2 kHz at 115dB SPL for 75 min.\nAfter the end of trauma stop the syringe pump and let the animal awake in a wake-up cage on a warming pad at a quiet place. Check regularly during the awakening phase if the vital signs are stable. Put the animal in its home cage only when it is completely awake. Let the animal recover from the anesthesia (at least 2 days) and rest in its home cage.\nPerform 2.1 to 2.6 again. Compare the hearing thresholds before and after the acoustic trauma by calculating the percentage of hearing loss for each frequency. After the end of all experiments painlessly euthanize the animal.\n4. Test for Acoustic Phantom Perception (Subjective tinnitus)\nPerform these measurements before and after the acoustic trauma.",
    "Follow 2.1 to 2.2 if the animal is not already in the setup.\nA number of stimulation paradigms can be used to test rodents for subjective tinnitus. The ratio in all these approaches is to test for the salience of a silent gap within a background noise. If the gap is perceived by the animals, it can be used as a test stimulus to reduce a startle response analogously to the procedure described in 2. If the animal suffers from tinnitus (that is likely to develop after acoustic trauma), this tinnitus will be perceived within the silent gap and therefore makes the gap less salient. The effect of the gap on the startle response consequently will be weaker in tinnitus animals compared to healthy controls (reduced PPI, cf. 8). This percept is tested with two slightly different protocols.\nIn the first subjective tinnitus paradigm presented here (Figure 2A, center, cf. 9) use the following parameters for stimulation: startle sound intensity 105 dB SPL with frequencies from 1 to 16 kHz in 1 octave steps, stimulus length 6 ms including 2 ms cosine-squared rise and fall ramps. Present a white noise background of 50 dB SPL during the experiment, either with or without a 15 ms gap that precedes the startle stimulus by 100 ms; present at least 15 trials for each frequency and gap-condition. If using a non-randomized approach, allow 5 min recovery between the different stimulus sets. Use of different startle stimulus frequencies will give a rough estimate of the perceived tinnitus frequency.",
    "As a second subjective tinnitus paradigm (Figure 2A, right) you may use the following stimulation parameters: startle sound intensity 105 dB SPL, double click stimulus with 0.1 ms duration per click and 0.1 ms between the clicks, the second click having the inverted direction compared to the first. Present a bandpass filtered noise background of 50 dB SPL with a gaussian filter width of 0.5 octaves and center frequencies ranging from 1 to 16 kHz in octave steps. Present this noise either with or without a 15 ms gap that precedes the startle stimulus by 100 ms; present at least 15 trials for each frequency and gap-condition. If using a non-randomized approach, allow 5 min recovery between the different stimulus sets. Use of different center frequencies of the bandpass background noise will give a rough estimate of the perceived tinnitus frequency.\nFollow 2.4 to 2.5; normalize all acquired data with a reference data set for each tested frequency and each trauma condition, i.e., before and after an acoustic trauma. This reference is the response amplitude to the pure tone startle stimulus without any prestimulus (cf. 2.3). The frequency is determined either by the pure tone or the center frequency of the bandpass filtered noise. Calculate the mean response of each reference and normalize each calculated response amplitude by dividing it through its reference.\nCalculate PPI by dividing the normalized response amplitudes of the gap condition through the mean of the normalized no-gap condition of each tested frequency.\nCalculate the PPI change after the trauma in percent for each tested frequency.",
    "The startle responses of animals are easy to generate and to analyze. Figure 2B gives an overview of a typical result of one animal stimulated with a pure tone of 105 dB SPL without any prestimulus for 15 times. The majority of the trials are valid and invalid trials are easy to recognize (trials marked by red square). The response amplitudes and latencies are calculated only from valid trials.\nA typical behavioral threshold change is given in Figure 3A. The audiogram of an exemplary animal acquired with the method described in 2 is given before (blue) and after (red) an acoustic trauma at 2 kHz (yellow area). A clear hearing loss is shown specifically at 2 kHz. The responses related to a subjective tinnitus percept can be seen in Figure 3B, the normalized response amplitudes of the same animal as above are shown exemplarily for stimulations one octave below and above the trauma as described in 4.5. The comparison of the responses to stimuli with and without gap before (blue) and after the trauma (red) allows an interpretation of a possible tinnitus percept. Below the trauma frequency no change of response pattern can be found while above the trauma the effect of the gap vanished after the trauma, indicating a mispercept at this frequency.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4433/4433fig1.jpg\nFigure 1. Flow diagram of the program used to acquire the behavioral thresholds and subjective tinnitus data. Note that this is only a simplified version of the program code. Abbreviations: GUI - graphical user interface; ISI - inter stimulus interval.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4433/4433fig2.jpg",
    "Figure 2. Auditory startle response (ASR) stimuli. A Schemes of the three different stimulation protocols used. Left panel: pre-pulse inhibition (PPI) of the ASR measured without any pure tone test stimulus before (green) the startle tone (red); the response period is depicted in blue. Center panel: gap / noise paradigm with pure tone startle stimulus presentation of different frequencies on a white noise background. Right panel: gap / noise paradigm with click startle stimulus presentation on bandpass filtered background of different center frequencies. B Exemplary auditory startle responses of 15 trials recorded with the threshold paradigm without any prestimulus at 1 kHz stimulation frequency. Three trials are counted invalid (red squares) as the animal moved already before the stimulation onset.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4433/4433fig3.jpg\nFigure 3. Exemplary results of ASR in one animal. A Behavioral threshold before (blue) and after (red) the acoustic trauma at 2 kHz (yellow area). The thresholds are calculated from the responses to the PPI modulated ASR protocol using the Boltzmann-function turning point as threshold value. Note that the hearing loss at 2 kHz amounts to more than 66%, while farer away from the trauma frequency one often can see even improvement of hearing thresholds. B Normalized response amplitudes (open circles: single trials, filled circles: means, whiskers: standard deviation) during stimulation with the gap / noise click ASR protocol (4.5) for 1 and 4 kHz center frequencies. Responses are sorted for trials without and with gap in the noise before and after the trauma at 2 kHz. Only at 4 kHz the effect of the gap vanishes after the trauma which indicates a subjective tinnitus percept around this frequency.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}