{
  "id": 1583,
  "origin_website": "Cell",
  "title": "Isolation, expansion, differentiation, and histological processing of human nasal epithelial cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIsolation and expansion of human nasal epithelial cells (HNECs) from nasal turbinates\nTiming: 8 days\nIn this step a donor will swab their own inferior nasal turbinate with an interdental brush and the tissue on the brush will be removed, digested with a protease solution and plated for incubation, this process will take around 30 min. The cells will then be expanded in culture over an 8-day period. Our protocol is a streamlined adaptation from previously established protocols (Hussain et al., 2014[href=https://www.wicell.org#bib1]) (Yang et al., 2016[href=https://www.wicell.org#bib2]).\nHave donor blow nose to remove any excess mucous from the nasal cavity.\nThe donor should slowly insert the interdental brush into the nasal cavity, following the nostril to the inferior turbinate and gently spin the brush for 10 s.\nRemove the brush from the handle using wire cutters and place the brush into a 5 mL Eppendorf tube containing 1 mL of ACF dissociation solution at 22°C–25°C (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1021-Fig1.jpg\nFigure 1. Interdental brush before and after nasal brushing\nLeft-to-right; Interdental brush intact, handle with brush removed, Eppendorf tube with brush submerged in ACF dissociation solution\nRepeat steps 1–3, having the donor brush the opposite nostril, place the second brush into the same 5 mL Eppendorf tube containing the first brush.",
    "Use a P1000 micropipette tip to remove the cellular material from the brush by trimming 2–3 mm from the pipette tip and inserting the cut wire end of the brush into the cut end of the pipette tip. Gently push the pipette down so the entire brush enters the pipette tip, you should see cellular material and mucous accumulate at the end of the pipette tip. Press and spin the tip against the side of the Eppendorf tube until the cellular material and mucous are suspended in ACF solution. Discard the pipette tip and brush (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1021-Fig2.jpg\nFigure 2. Removal of tissue from interdental brush\nLeft-to-right; Removal of tissue from brush using a 1000uL pipette tip; tissue and mucosubstance (yellow arrow) in ACF dissociation solution after removal from brush.\nIncubate the Eppendorf at 37°C for 15 min, gently flicking the tube halfway through and at the end of incubation.\nCritical: To avoid cell death do not vortex samples.\nAdd 1 mL of ACF inhibition solution, mix by gently inverting Eppendorf multiple times.\nCentrifuge at 22°C–25°C for 5 min at 200 × g.\nCarefully remove and discard supernatant.\nUsing a P1000 pipette, resuspend pellet in 1 mL PneumaCult-Ex Plus media.\nCritical: Slowly pipette pellet to avoid cell death.\nPlate cells into one well of a 6-well culture plate containing 1 mL pre-warmed complete Expansion Plus media for a total of 2 mL media.\nIncubate at 37°C, 5% CO2. Colonies will be visible by day 2–4; if no colonies are visible by day 4 then it was likely an unsuccessful isolation (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1021-Fig3.jpg\nFigure 3. Phase contrast image of HNEC colony formed after 3 days of culture\nScale bar, 120 μm.\nMedia should be refreshed when colonies are first observed (day 2–4), and again every two days.",
    "On day 5–6 of culture the colonies must be dissociated and passaged for maximal expansion. To do so, remove media from wells and wash cells briefly with warmed PBS.\nApply 1 mL of ACF Dissociation Solution and incubate plates at 37°C for 6–8 min. Gently tap on plates to fully dissociate cells.\nApply 1 mL of ACF Inhibition solution to cells and gently swirl the plate to mix.\nTransfer the cells to a 15 mL conical tube or 5 mL Eppendorf tube and centrifuge for 5 min at 200 × g.\nCritical: Be very gentle when transferring the cell solution and use a 1–2 mL serological pipette or slowly transfer with a P1000 micropipette.\nCarefully remove and discard supernatant.\nResuspend pellet in 1 mL complete Expansion Plus media using a P1000 micropipette.\nCritical: Slowly pipette pellet to avoid cell death.\nTransfer the cell solution to a T25 flask containing 2 mL of complete expansion-plus media for a total of 3 mL media. Incubate at 37°C, 5% CO2.\nCells should be transferred to transwell inserts after 8 days of culture to ensure maximal differentiation, collect cells by repeating steps 14–19.\nDifferentiation at the ALI\nTiming: 22–30 days\nIn these steps the HNECs will be seeded onto 12 mm polyester transwell inserts and cultured to 100% confluence before initiating the ALI to trigger HNEC differentiation. After 20–25 days of ALI culture the HNECs will have differentiated and formed complete airway mucociliary tissue. Our protocol for ALI differentiation is adapted from published protocols which recommend coating transwell inserts with type I collagen (Lam et al., 2011[href=https://www.wicell.org#bib3]) (You et al., 2002[href=https://www.wicell.org#bib4]). We find that ALI cultures achieve robust differentiation without the addition of collagen coating and therefore have removed this step from our protocols.",
    "Apply 1 mL of complete expansion plus media to each well containing a transwell insert.\nSeed the apical chamber of each transwell insert with 2×10ˆ5 HNECs in 0.5 mL of complete expansion plus media. Incubate cultures at 37°C, 5% CO2.\nConfluent monolayers should be established within 24–48 h after seeding chambers. Visually confirm monolayer formation via phase contrast microscopy.\nInitiate the ALI by removing the media in the apical and basal chambers and replenishing only the basal chamber with 1 mL of ALI media, incubate cultures at 37°C, 5% CO2.\nReplenish the 1 mL of ALI media in basal chamber every 48 h. When media is being replaced also wash the apical chamber with 0.5 mL PBS to remove cell debris and prevent over-accumulation of muco-substances which negatively impact multiciliated cell differentiation.\nFormation of mucociliary epithelium will be observable by day 20–25 and can be confirmed via phase contrast microscopy.\nNote: ALI tissue can be maintained in culture for prolonged experiments (40+ days) by continuing to replenish ALI media and washing the apical surface with PBS every 48 hrs. Long-term ALI cultures are at an increased risk for contamination by bacterial and fungal sources, therefore special consideration should be given to these types of experiments and sterile procedures utilized while handling cultures.\nFixation, paraffin-embedding and sectioning of ALI tissue\nTiming: 2 days\nALI tissue will be fixed in formalin, removed from the plastic transwell inserts, dehydrated via graded alcohol washes, and embedded into paraffin wax. Histological sections will then be obtained from the paraffin blocks for downstream analysis of ALI tissue.\nRinse apical and basal chambers with PBS.\nApply 1 mL of 10% buffered formalin to the basal chamber and 0.5 mL to the apical chamber.\nWrap plate in parafilm.\nPlace at 4°C for 12–16 h.\nRinse inserts with PBS.",
    "Remove the polyester membrane from the transwell inserts using a #11 scalpel blade.\nNote: Cut the membrane into 2 equal halves by inserting the scalpel blade from the underside of the membrane ~3–4mm deep and cutting a vertical line down the center of the insert. Next, using the transwell insert as a guide, cut in a circular motion to remove the two halves of the membrane (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1021-Fig4.jpg\nFigure 4. Steps for removing the membrane from the transwell insert prior to embedding and sectioning\n1. Make a linear cut down the center of the insert (red line). 2. Cut in a circular motion using the plastic insert as a guide (red line). 3. Final product is membrane cut into two mirrored halves.\nNote: Use fine forceps to move ALI tissue by gripping the membrane at the circular edges as opposed to the center cut.\nCritical: Insert the scalpel blade from the underside of the membrane otherwise ALI tissue will be damaged during cutting. (Figure 5[href=https://www.wicell.org#fig5])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1021-Fig5.jpg\nFigure 5. The direction to insert scalpel blade into ALI tissue when cutting tissue in half\nDepiction of correct (Green circle) and incorrect (Red circle) ways to perform scalpel cuts on intact ALI tissue.\nPlace membrane into 70% ETOH and wash on slow rocker for 15 min at 22°C–25°C.\nNote: Washes should be performed with volumes sufficient to completely submerge membranes.\nWash membrane in 80% ETOH on slow rocker for 15 min at 22°C–25°C.\nWash membrane in 95% ETOH on slow rocker for 15 min at 22°C–25°C.\nWash membrane in 100% ETOH on slow rocker for 15 min at 22°C–25°C.\nWash membrane in Xylene on slow rocker for 15 min at 22°C–25°C.\nPlace inserts into 55oC molten paraffin wax for 25 min.",
    "Critical: Prolonging the paraffin infiltration step beyond 30 min can result in irreversibly damaged ALI tissue.\nNote: Polyester membranes will roll up on themselves when in molten paraffin. Therefore, they must be manually molded into flat shapes as they cool.\nUsing forceps, remove the ALI tissue from molten wax and gently press tissue in-between thumb and forefinger (wearing latex or nitrile gloves) to cool the wax/membrane into a flat shape to create a wax ‘chip’.\nUsing forceps to grip the wax chip from the edge, briefly dip in and out of molten paraffin to add a layer of wax. Keep using thumb and forefinger to cool/maintain flat shape of chip after dipping into molten wax.\nCritical: Be sure to track which side of the wax chip is the flat edge of the polyester membrane half and which is the rounded edge (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1021-Fig6.jpg\nFigure 6. ALI membrane halves embedded in paraffin wax\nWax chips containing each half of an ALI membrane (dotted line), formed by briefly dipping the membrane in wax 4–6 times.\nRepeat step 41 at least 5 times to increase the thickness of the wax chips to between 2–4 mm.\nCritical: The membrane needs to be coated in a sufficient amount of wax to ensure that it remains flat when the wax chip is embedded into the mold.\nFill an embedding mold with molten wax and place mold onto cryo plate or ice pack.\nWhen the molten wax in the mold has turned opaque and is partially cooled, insert the wax chip into the mold with the flat side of the membrane facing down.",
    "Critical: If the wax in the mold is too hot when the chip is inserted then it will re-melt the wax chip before the block solidifies, if this happens the membrane will begin to curl and will no longer maintain a flattened orientation.\nCritical: The orientation of the membrane when inserted into the mold should be so that it is perpendicular to the cutting blade, not parallel (Figure 7[href=https://www.wicell.org#fig7]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1021-Fig7.jpg\nFigure 7. The proper direction to embed ALI tissue in wax block\nDepiction of the correct (green circle) and incorrect (red circle) orientation of the membrane halves (blue lines) within the wax block regarding the cutting blade and direction of sectioning.\nAfter inserting the wax chip into the mold, let the mold cool on a cryo plate or ice pack until solidified.\nPause point: Wax block can be removed from the mold and stored at room temperature until future sectioning.\nUse microtome to collect 10 uM sections.\nNote: Wax block should be at room temperature before sectioning to reduc cracking of wax during sectioning.\nNote: Each cross section will likely curl up on itself as it is generated. Use a small paintbrush to prevent the section from curling.\nTransfer each section to a 55°C water bath using fine forceps.\nPick up floating section using a charged slide.\nCritical: Paraffin sections must be mounted on charged slides otherwise tissue sections will fall off slides during the antigen retrieval process.\nDry at room temperature for a minimum of 12 h before staining.\nPause point: Dried sections can be stored at room temperature for future analysis.\nRehydration of ALI tissue\nTiming: 30 min\nSections of ALI tissue will be de-paraffinized with xylene and rehydrated via graded alcohol washes. After rehydration sections are ready for immunohistochemistry or special stains.",
    "Place slides on a 55°C heat block for 10 min.\nSubmerge slide in xylene for 5 min at 22°C–25°C.\nSubmerge slide in a second container of Xylene for 5 min at 22°C–25°C.\nNote: The two xylene washes are performed in separate containers.\nSubmerge slide in 100% ETOH for 5 min at 22°C–25°C.\nSubmerge slide in 95% ETOH for 5 min at 22°C–25°C.\nSubmerge slide in 80% ETOH for 5 min at 22°C–25°C.\nSubmerge slide in 70% ETOH for 5 min at 22°C–25°C.\nAntigen retrieval and fluorescent immunohistochemistry of ALI tissue sections\nTiming: ~4.5 h\nBefore immunohistochemistry, antigen retrieval is performed to unmask antigenic sites within the ALI tissue. Our protocol utilizes a commercial electronic pressure cooking to perform heat induced antigen retrieval. The slide will be submerged in a container of antigen retrieval buffer that sits within the pressure cooker chamber. The pressure cooker chamber will contain distilled water which will be boiled to produce the heat and pressure (Figure 8[href=https://www.wicell.org#fig8]). After antigen retrieval the sections will be processed for fluorescent immunohistochemistry using protocols modified from standard formalin fixed paraffin embedded methods (Im et al., 2019[href=https://www.wicell.org#bib5]). There are alternate antigen retrieval methods and buffers that we do not cover in this protocol (Shi et al., 2010[href=https://www.wicell.org#bib6]). For example, a microwave may be used as an alternative method of heat induced antigen retrieval, although laboratories should perform optimization experiments with timing and power level parameters for adequate antigen retrieval. We find the advantages of using an electronic pressure cooker to be the consistency of results within large batches of slides in addition to the reproducibility between multiple pressure cookers in the laboratory.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1021-Fig8.jpg",
    "Figure 8. Antigen retrieval setup using an electronic pressure cooker and pipette tip box. Photo of pressure cooker setup for antigen retrieval. Left: Outside of pressure cooker with lid removed. Right: Inside of pressure cooker is a secondary container (we use a micropipette tip box) containing the slide submerged in antigen retrieval buffer. The secondary container is placed on the steam rack to keep it stable during antigen retrieval. The inner chamber is filled with distilled H2O until it touches the bottom of the secondary container.\nSubmerge slide in distilled H2O for 5 min at 22°C–25°C.\nPlace slide into a pressure-cooker safe container, fill container with enough antigen retrieval buffer to completely submerge slide.\nPlace antigen retrieval container containing the slide inside the pressure cooker chamber.\nFill pressure cooker with distilled water. Follow the pressure cookers’ manual for the minimum volume of water required for safe operation.\nSet pressure cooker to 15 min on High setting.\nCritical: This antigen retrieval protocol is optimized for the ‘Instant Pot DUO Mini’ commercial pressure cooker, changing the pressure cooker used for this step may alter results.\nCarefully vent pressure cooker and remove slide from antigen retrieval buffer.\nSubmerge slide in distilled H2O for 5 min at 22°C–25°C.\nSubmerge slide in TBST for 5 min at 22°C–25°C.\nCarefully dry the slide using a Kimwipe, being sure not to touch the section of ALI tissue.\nUse a hydrophobic pen to draw a barrier around the section of ALI tissue with 5 mm margins.\nPipette 50–100 μL of Blocking Solution directly onto the section of ALI tissue and incubate for 60 min at 22°C–25°C in a humidified chamber.\nNote: Humidified chamber is to protect against evaporation of blocking/antibody solutions. We recommend creating a humidification chamber using a resealable plastic container and a wet sponge (Figure 9[href=https://www.wicell.org#fig9]).",
    "imgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1021-Fig9.jpg\nFigure 9. Humidification chamber used for blocking, primary antibody, and secondary antibody incubations\nTop: Humidification chamber with lid off, containing a secondary container filled with distilled water and a sponge completely soaked in distilled water, placed next to two slides. Bottom: Sealed humidification chamber.\nRemove blocking solution from sections by gently tapping the side of the slide on a paper towel and use a Kimwipe to remove any remaining solution, being sure not to touch ALI tissue.\nCritical: Do not use a vacuum manifold to suction solutions off sections, this can move and/or damage ALI tissue.\nDilute primary Ab to desired concentration in 1% BSA-TBST solution. Apply 50–100 μL of primary antibody solution directly onto the section of ALI tissue and incubate for 60 min at 22°C–25°C in a humidified chamber.\nRemove primary antibody solution from sections by gently tapping the side of the slide on a paper towel and use a Kimwipe to remove any remaining solution.\nSubmerge slide in TBST for 5 min at 22°C–25°C.\nCarefully dry the slide using a Kimwipe, being sure not to touch the section of ALI tissue.\nDilute fluorescent secondary antibodies to desired concentration in 1% BSA –TBST solution. Apply 50–100 μL of secondary antibody solution directly onto the section of ALI tissue and incubate for 60 min at 22°C–25°C in a darkened humidified chamber.\nNote: We recommend molding aluminum foil over the humidified chamber to block light from reaching the samples, this protects against photobleaching of fluorophores.\nRemove secondary antibody solution from sections by gently tapping the side of the slide on a paper towel and use a Kimwipe to remove any remaining solution.\nSubmerge slide in TBST for 5 min at 22°C–25°C.\nCarefully dry the slide using a Kimwipe, being sure not to touch the section of ALI tissue.",
    "Place one small drop of ProLong Gold antifade with DAPI directly onto the ALI tissue section.\nGently apply glass coverslip over the sample and let it settle naturally over the section of ALI tissue.\nCritical: Pressing down on the coverslip during this process can cause the ALI tissue section to move on the slide, possibly detaching from the membrane and/or folding on itself in a ‘ribbon-like’ fashion. If this happens it will become difficult to locate continuous sections of ALI tissue for imaging.\nSeal the coverslip by applying clear nail polish around the edges.\nVisualize with a fluorescent microscope, store slides away from light at 4°C.\nHematoxylin and eosin staining of ALI tissue sections\nTiming: ~20 min\nSections of rehydrated ALI tissue (Step 56) will be stained with hematoxylin and eosin to visualize tissue structure and gross cell morphology.\nSubmerge slide in hematoxylin for 1 min.\nGently rinse slide with tap-water for 5–7 s.\nCritical: Do not use distilled water for step 82, this will affect hematoxylin color.\nNote: The length of time for rinsing will determine the intensity of the hematoxylin stain, the slide can be briefly examined under a light microscope after the water rinse to determine if tissue is too dark and requires more rinsing. We recommend starting with 5 sec of water and examining slide to determine if further rinsing is necessary.\nSubmerge slide in 80% ETOH for 5 min at 22°C–25°C.\nSubmerge slide in 95% ETOH for 5 min at 22°C–25°C.\nSubmerge slide in 100% ETOH for 5 min at 22°C–25°C.\nSubmerge slide in eosin for 30 s.\nGently rinse slide with 95% ETOH.\nSubmerge slide in 95% ETOH for 30 s.\nSubmerge slide in 100% ETOH for 30 s.\nApply mounting media and cover slip.\nVisualize tissue with a light microscope."
  ],
  "subjectAreas": [
    "Stem Cells",
    "Cell Isolation",
    "Microscopy",
    "Cell Culture",
    "Tissue Engineering",
    "Cell Differentiation"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}