{
  "id": 17877,
  "origin_website": "Jove",
  "title": "Pre-clinical Model of Cardiac Donation after Circulatory Death",
  "procedures": [
    "All animal care and experimental protocols conformed to the Guide for the Care and Use of Laboratory Animals and were approved by the institutional animal care and use committee of the Centre Hospitalier de l’Université de Montréal Research Center.\n1. Preliminary Preparations\nTurn on the water bath to heat the cardioplegia delivery system (Figure 1A) and the Langendorff ex vivo perfusion system (Figure 1B). Set the water temperature to 38.5 °C for a solution temperature of 37 °C. Setup photographs can be seen in Supplementary Figure 1A,B.\nPrepare 1 L of cardioplegic solution. Add 1 mL of 2% lidocaine hydrochloride and 10 mL of 2 mM KCl (final concentration 20 mM) to 1 L of Plasma-Lyte A (140 mM Na, 5 mM K, 1.5 mM Mg, 98 mM Cl, 27 mM acetate, 23 mM gluconate). Correct pH to 7.4 using 6 N HCl.\nCAUTION: This model is highly sensitive to pH. A wrong pH correction (outside the 7.3-7.4 physiological range) or pH unstable solutions may compromise the experiment or provide unreliable data.\nPrepare 4 L of Krebs solution (113 mM NaCl, 4.5 mM KCl, 1.6 mM NaH2PO4, 1.25 mM CaCl2, 1 mM MgCl2∙6H2O, 5.5 mM D-Glucose, 25 mM NaHCO3). Substrate masses per 1 L of solution should be as follows: 6.1 g of NaCl, 0.3355 g of KCl, 0.2035 g of MgCl2∙6H2O, 0.192 g of NaH2PO4, 0.1387 g of CaCl2, 0.99 g of D-Glucose, 2.1 g of NaHCO3, final volume of 1 L in ultrapure deionized water. Add the NaHCO3 last to avoid precipitation. Filter the solution using a 0.22 µm filter and store overnight. Correct the pH to 7.4 when the solution is at 37 °C and bubble with 5% CO2/95% O2.",
    "Fill the Langendorff circuit with Krebs solution and start the system pump. Make sure that no bubbles are left inside the tubing. Adjust the peristaltic pump speed to 80 rpm (equivalent to 1 L/min). Using the two way stop cock, adjust the flow to maintain a slow drip through the aortic cannula until the heart is attached (Figure 1B). Keep a sample of Krebs solution (15 mL) in a 50 mL conic tube on ice for heart transportation.\nFill the cardioplegia delivery system with the cardioplegic solution. Once the bubbles are removed, switch the circuit to saline using a 3 way stop cock (Figure 1A). Adjust the drip rate. Saline must be slowly dripping from the tip of the catheter to assure that no cardioplegic solution is injected before the animal’s death.\n2. Animal Preparation\nUsing an inhalation chamber, induce anesthesia with 3% isoflurane. Once the animal is unresponsive, perform an intraperitoneal injection of ketamine (75 mg/kg) and xylazine (5 mg/kg) or similarly suitable anesthetic, following local regulations, to maintain anesthesia for the rest of the procedure. Ensure the depth of anesthesia by no reaction to toe pinch and palpebral reflex.\nIntubate the animal using a 14 G, 2-inch I.V. catheter. Start ventilation at 50 breaths per min, with airway pressure limited to 20 cmH2O.\nPlace the animal on a heating pad set to “medium” and cover with an absorbent pad to maintain body temperature. Insert a rectal temperature probe and attach a transdermal pulse oximeter sensor to one of the feet. Maintain rectal temperature at 37 °C throughout the procedure.\nVascular access",
    "Make a 3 to 4 cm midline skin incision in the neck using scissors. Using blunt tip curved scissors, blunt dissect the subcutaneous tissue and expose the right sternohyoid muscle. Using non traumatic forceps, move the muscle laterally until the right carotid artery (pulsating), jugular vein (non-pulsating) and the vagus nerve (white) are visually identified (Supplementary Figure 2A). Carefully separate the vagus nerve from the carotid artery using blunt tip curved scissors.\nInject heparin (2,000 IU/kg) via the right jugular vein. Apply pressure to the injection site after needle retraction to avoid blood leakage.\nUsing curved forceps, pass two 5-0 silk sutures around the carotid artery. Firmly attach a distal suture to occlude the carotid artery at the superior aspect of the exposed artery. Keep the proximal suture untied. Pulling of the proximal suture will be used for bleeding control in the next step (Supplementary Figure 2B). The distance between sutures should be approximately 2 cm.\nUsing a stereomicroscope for better visualization, carefully make a 1 mm incision with microsurgery scissors over the anterior wall of the carotid artery. Insert a 22 G, 1-inch closed I.V. catheter towards the aortic arch. The catheter is connected to a 2 way stop cock, allowing for connection to a pressure transducer for constant monitoring, with the possibility of injecting saline or cardioplegia via the cardioplegia delivery system (Figure 1A).\n3. Initiation of Cardiac Donation After Circulatory Death (DCD) Protocol\nNOTE: A complete protocol timeline can be seen in Figure 2.\nRe-asses the anesthetic depth by performing a toe pinch and evaluating palpebral reflex. If reaction is observed, perform an intraperitoneal injection of Ketamine (37.5 mg/Kg) and xylazine (2.5 mg/Kg). Re-evaluate after 5 minutes. If no response is observed continue the procedure. Tracheal clamp should only be performed in adequately anesthetized animals.",
    "Turn off the ventilator and extubate the animal. Using mosquito forceps, clamp the trachea. This moment is considered as the start of the agonal phase. Start counting the functional warm ischemic time (WIT) when the peak systolic blood pressure drops below 30 mmHg, or if asystole or ventricular fibrillation appears, whatever comes first (Figure 3).\nNOTE: Damage extent should be proportional to WIT. Experiments are needed to optimize WIT time according to anesthetic used, animal strain, sex and weight chosen. In control animals, immediately after carotid vascular access is secured, cardioplegia is injected and the heart is procured as described in the next step (Figure 2). The start of perfusion with cardioplegia is considered as the end of WIT.\nAt the end of WIT, perform a medial sternotomy. Keep the thorax open by using an Alm retractor. Using scissors, open the inferior vena cava and both atria to avoid myocardial distension or cardioplegia recirculation (Supplementary figure 3). Clamp the aorta above the diaphragm. Through the previously catheterized carotid artery, infuse the cardioplegic solution at a constant pressure of 60 mmHg for 5 min using the cardioplegia delivery system. Infusion pressure can be modified by altering the height of the water column.\nAt the end of cardioplegic infusion, dissect the ascending proximal aorta from the pulmonary artery using curved forceps (Supplementary Figure 4A). Cut the aorta distal to the left subclavian artery. Ensure an aortic length of at least 0.5 cm for cannulation for the Langendorff apparatus.\nHolding the heart from the aorta, complete the cardiectomy by separating the heart from the pulmonary veins and other thoracic structures (Supplementary Figure 4B). Rapidly, submerge the heart in to ice-cold Krebs solution for rapid transportation to the ex vivo system. Keep the dissection and transport times as short as possible (5 min).",
    "4. Ex Vivo Heart Perfusion System (EVHP) and Cardiac Functional Assessment\nOpen the aortic lumen using forceps. Deair the aorta by filling the lumen with the dripping Krebs solution to avoid forcing bubbles in to the coronary vessels. Lower the cannula into the aorta, taking care not to pass the aortic root or damage the aortic valve leaflets. Fix the setup with a small clamp.\nUsing the 2 way stopcock, increase the flow to search for possible leaks in the aorta. If none are detected, tightly fix the aorta to the cannula using a 2-0 silk suture. Fully open the flow to the cannula. Maintain aortic pressure at a physiological pressure of 60-70 mmHg (adjusted by changing the height of the system). At this moment the initial reperfusion and stabilization time is initiated. Aortic pressure can be modified according to the investigator’s experimental plan.\nRotate the heart so the base of the heart (atria) is facing the pressure sensor. Widen the left ventricular atrial opening by dissecting the pulmonary veins. Insert the latex balloon connected to a pressure sensor. Make sure that the balloon is fully positioned inside the ventricle by visual inspection. Slowly fill the balloon with saline until end diastolic pressure (EDP) is set to 15 mmHg. Adjust as needed to keep EDP constant (pre-determined physiological EDP). The EDP can be adjusted according to the experimental objectives of each investigator.\nInsert the pacing electrode in the anterior face of the heart (right ventricular outflow tract). Avoid puncturing the coronary vessels. Once spontaneous beating is observed, initiate pacing at 300 beats per min. Required voltage may vary between experiments and rat strains.",
    "After 10 min of stabilization, initiate continuous intraventricular pressure measurement recording. This moment is considered the beginning of the reconditioning and assessment phase (time 0) that will last for 1 h (Figure 2). Reconditioning may be prolonged, but a time-dependent decrease in contractility is expected in all hearts.\nAt the start of reconditioning, collect cardiac effluent dropping from the cardiac veins for 5 min for baseline coronary flow assessment and biochemical analyses. For troponin T repeat every 15 min (times 0, 15, 30, 45 and 60 min). For other analyses individualization of collection times is needed (Figure 2).\n5. End of Experience\nRemove the heart from the Langendorff apparatus.\nUsing a straight high carbon steel blade (microtome blade or similar), remove the base of the heart (including aorta and pulmonary artery).\nWith the right ventricle facing down, cut transverse ventricular slides of 1-2 mm thickness. In one representative section (normally the third) excise the right ventricle and snap freeze the left ventricle. This sample can be used for biochemical analyses.\nSubmerge the remaining sections in to freshly prepared 5% 2,3,5-triphenyl-tetrazolium chloride in commercial phosphate buffer saline pH 7.4 for 10 min at 37 °C. Viable tissues are colored red brick.\nWash twice with phosphate buffer saline pH 7.4 and fix with 10% formalin at 4 °C overnight. Wash twice with phosphate buffered saline pH 7.4 and keep each slice submerged.\nWithdraw excess liquid and weight each slide. Take digital color images of both sides. Use planimetric analyses to calculate percent infarct size and correct for slice and total ventricular weight. Coloration fades with time. Photos must be taken as soon as possible.\n6. Data analyses\nSave all pressure data in a new file per animal.",
    "For pressure analyses, select at least 200 pressure cycles per time points. Analyses can be performed off-line (after completion of the experiment) using dedicated software (i.e., LabChart). Common cardiovascular parameters available include: Maximal generated pressure, end diastolic pressure, +dP/dt (steepest slope during the upstroke of the pressure curve, an indicator of ventricular contractile ability), -dP/dt (steepest slope during the downstroke of the pressure curve, an indicator of ventricular relaxation capacity) among others.\n\tNOTE: For troponin analyses, an increase in troponin release at reperfusion is expected. After 1 h of reperfusion in the EVHP system, troponin levels may decrease to baseline, stressing the need for careful timing in the collection and handling of these samples.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}