{
  "id": 13539,
  "origin_website": "Jove",
  "title": "Isolation of Type I and Type II Pericytes from Mouse Skeletal Muscles",
  "procedures": [
    "Wildtype and Nestin-GFP transgenic mice were housed in the animal facility at the University of Minnesota. All experimental procedures were approved by the Institutional Animal Care and Use Committee at the University of Minnesota and were in accordance with the NIH Guide for the Care and Use of Laboratory Animals.\n1. Muscle Dissection and Single-cell Isolation\nEuthanize adult mice (6-10 weeks, both male and female) with tribromoethanol (250 mg/kg, i.p.) and sterilize their abdomen skin with 70% ethanol.\n\tNOTE: Tribromoethanol was used here instead of ketamine for anesthesia/euthanasia, as ketamine is known to interact with the NMDA receptors, which could potentially have an impact on the study.\nPlace the mice in the supine position and use a scalpel to make a horizontal incision on the abdominal skin. Peel off the skin by hand, pulling in opposite directions to expose the hindlimb muscles.\nCollect the muscles from both hindlimbs using forceps and scissors. Store them in sterile phosphate-buffered saline (PBS) supplemented with 1% penicillin-streptomycin (P/S) on ice.\nWash the dissected hindlimb muscles in ice-cold PBS supplemented with 1% P/S two times and transfer them to a sterile 10 cm plate.\nCarefully dissect out nerves, blood vessels, and connective tissue from the muscles using forceps and scissors under a dissection microscope at 2X magnification.\nFinely chop and mince the muscles into small pieces (1-2 mm3) using sterile scissors and blades. If necessary, add a small amount of Dulbecco's Modified Eagle Medium (DMEM) to ensure that the muscles are not dried out.\nMechanically break down the tissue by pipetting up and down through a 10 mL serological pipette 10 times.\nAdd freshly made digestion solution (DMEM supplemented with 0.2% Type 2 collagenase) to the mixture. Incubate at 37 °C for 2 h with gentle agitation at 35 revolutions/min.",
    "Triturate using an 18 G needle to homogenize the mixture. Then, centrifuge at 500 x g for 5 min. Discard the supernatant and then resuspend the pellet in 0.25% trypsin/EDTA. Incubate at 37 °C for 10 min. Repeat the centrifugation step two more times.\nAdd 10 mL of DMEM supplemented with 20% fetal bovine serum (FBS) to the solution and centrifuge at 500 x g for 5 min. Discard the supernatant and resuspend the pellet in red blood cell lysis buffer (155 mM NH4Cl, 10 mM KHCO3, and 0.1 mM EDTA).\nCentrifuge at 500 x g for 5 min. Discard the supernatant and resuspend the pellet in sorting buffer (20 mM HEPES, pH 7.0; 1 mM EDTA; and 1% BSA in Ca/Mg2+-free PBS, pH 7.0). Filter the mixture through a 40 µm cell strainer to obtain a single-cell suspension.\nCentrifuge at 500 x g for 5 min. Discard the supernatant and resuspend the pellet in 1 mL of sorting buffer.\nCount the cell number with a hemocytometer and dilute the single-cell suspension to 5 x 106/mL in sorting buffer.\n2. Cell Staining and Sorting\nPrepare controls and the sample as described in Table 1. Stain the single-cell suspension with the respective antibodies on ice for 30 min, as described in Table 1.\nCentrifuge at 500 x g for 5 min and wash the pellets twice with sorting buffer.\nAdd DAPI to the single-cell solutions, as indicated in Table 1. Use 5 µg/mL DAPI (final concentration) for the DAPI single-color control and 1 µg/mL DAPI for the PDGFRβ-PE-FMO control and the sample. Keep all tubes on ice throughout the experiment.\nTurn on the sorter and the software. Scan and insert a 100 µm sorting chip when prompted.",
    "Perform the automatic setup (i.e., chip alignment, droplet calibration, side stream calibration, and sort delay calibration) by loading the automatic setup beads when prompted.\nWhen automatic setup is complete, go to the \"Experiment\" tab, click on \"New,\" and select the \"Blank Template\" from \"Public Templates.\"\nUnder “Measurement Settings,” enter “DAPI” for “FL1,” “Nestin-GFP” for “FL2,” and “PDGFRβ” for “FL3.” Uncheck the boxes for “FL4”-“FL6”.\nCheck the boxes to activate the 405, 488, and 561 lasers and click on \"Create New Experiment.\"\nSelect the \"Start Compensation Wizard\" option and follow the \"Compensation Wizard\" software prompts to set up the compensation.\nLoad the unstained control and click \"Start.\" Click \"Detector & Threshold Settings\" and adjust the sensor gain of the FSC and BSC detectors to place the population on the scale.\nAdjust the gain levels of the FL1-FL3 fluorescence channels to place the negative populations on the left side of the histograms. Click the \"Record\" button to record the data.\nLoad single-color controls one by one when prompted. Click \"Start and Record\" to record the data. Adjust the gates for the positive populations on the histograms. Click \"Next.\"\nGo to \"Calculate Matrix\" on the \"Compensation\" tab and click \"Calculate\" in the \"Calculate Compensation Settings\" panel to perform the compensation. Click \"Finish\" to exit the \"Compensation Wizard.\"\nLoad the PDGFRβ-PE-FMO control and click \"Start.\" Draw a polygon gate (Gate A) around the cells of interest under the \"All Events\" plot.\nDouble-click inside Gate A to create a child plot. Change the Y-axis to DAPI and draw a polygon gate (Gate B) around live (DAPIlow) cells. Double-click inside Gate B to create a child plot. Change the X-axis to FSC-H and the Y-axis to FSC-W and draw a polygon gate (Gate C) around the singlets to eliminate doublets.",
    "Double-click inside Gate C to create a child plot. Change the X-axis to Nestin-GFP and the Y-axis to PDGFRβ-PE. Click the “Record” button to record the data.\nLoad the sample and repeat steps 2.11-2.12. After recording, click on \"Pause\" to preserve the sample.\nDefine the gating boundaries for PDGFRβ+ and Nestin-GFP+ cells based on the PDGFRβ-PE-FMO control. Draw gates for the PDGFRβ+Nestin-GFP- and PDGFRβ+Nestin-GFP+ populations.\nUnder “Sorting Method,” select “2-way Tubes” and assign “PDGFRβ+Nestin-GFP-” and “PDGFRβ+Nestin-GFP+” cells to the left and right collecting tubes, respectively. Mount the sorting buffer-filled 15 mL collecting tubes on the collection stage and click the “Load Collection” button\".\nClick the \"Resume\" button to keep the sample running. Click \"Start Sort\" to collect PDGFRβ+Nestin-GFP- (type I pericytes) and PDGFRβ+Nestin-GFP+ (type II pericytes) cells.\n3. Post-sorting Analyses\nCentrifuge the sorted cells at 500 x g for 5 min, resuspend the pellet in 1 mL of pericyte medium (see Materials Table), and count the cell density using a hemocytometer.\nSeed type I and type II pericytes on poly-D-lysine (PDL)-coated coverslips at ~1 x 104 cells/cm2. Grow in pericyte medium for 3 days at 37 °C with 5% CO2.\nOn day 3, examine the pericyte morphology (under phase contrast) and endogenous Nestin-GFP expression using a fluorescent microscope (excitation laser: 488 nm, excitation filter: 470/40 nm, and emission filter: 515/30 nm). Take images under a 20X objective (0.45 NA).\nReplace the pericyte medium with adipogenic (mouse MSC basal medium + adipogenic stimulatory supplement) and myogenic (DMEM + 2% horse serum) medium to initiate adipogenic and myogenic differentiation, respectively, as described previously20. Change the medium every 2-3 days.\nFix the cells on day 17 (14 days after adipogenic/myogenic differentiation) in 4% paraformaldehyde (PFA) for 20 min at room temperature.\n\tNOTE: Caution, PFA is a carcinogen.",
    "Perform immunocytochemistry against perilipin (adipocyte marker) and S-myosin (mature myotube/myofiber marker), as described in previous publications19,20.\nWash the fixed cells 3 times in PBS for 10 min at room temperature.\nAdd blocking buffer (PBS supplemented with 5% donkey serum, 3% BSA, and 0.3% Triton X-100) and incubate at room temperature for 1 h.\nIncubate the cells with anti-perilipin (2 µg/mL) and/or anti-S-myosin (2 µg/mL) antibodies at 4 °C overnight.\nWash the cells 3 times in PBS for 10 min at room temperature.\nIncubate the cells with Alexa 555 donkey anti-rabbit (4 µg/mL) and/or Alexa555 donkey anti-mouse (4 µg/mL) antibodies at room temperature for 1 h.\nWash the cells 3 times in PBS for 10 min at room temperature.\nMount the immunostained cells with mounting medium containing DAPI (see the table of materials). Examine perilipin and S-myosin expression using a fluorescent microscope (excitation laser: 543 nm; 540/45 nm excitation and 600/50 nm emission) and take images under a 40X objective (0.60 NA).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}