{
  "id": 13086,
  "origin_website": "Jove",
  "title": "A Guide to Examining Intramuscular Fat Formation and its Cellular Origin in Skeletal Muscle",
  "procedures": [
    "All animal protocols were approved by the Institutional Animal Care and Use Committee (IACUC) of the University of Florida.\n1. Genetic lineage tracing of FAPs\nNOTE: If genetic lineage tracing of FAPs is not desired, step 1 can be skipped.\nTo perform lineage tracing of FAPs, obtain the necessary mouse alleles.\n\tNOTE: Several tamoxifen-inducible Cre lines, under the control of the Pdgfrα promotor, have been generated to successfully target FAPs, including from the Hogan29, Rando27, and Bergles32 laboratories. As a genetic reporter of Cre activity, numerous Rosa26 reporter alleles are available such as Rosa26EYFP33. While it is suggested for each laboratory to determine which Cre-Reporter combination is most effective, by crossing PdgfrαCreERT2 mice (29 and Jax# 032770) to the Rosa26EYFP (33 and Jax# 006148) reporter, the resulting PdgfrαCreERT2; Rosa26EYFPmice can be used to efficiently and specifically mark FAPs20. To trace the fate of mature FAPs, it is recommended to wait until mice have reached at least ~10 weeks of age before administering tamoxifen. Lineage tracing experiments can be performed on both males and females.\nTamoxifen administration through oral gavaging\n\t\nPrepare 40 mg/mL tamoxifen in corn oil and vortex well to mix 1 day prior to gavaging. Incubate O/N at 37 °C in a rotating hybridization oven.\n\t\tCAUTION: Tamoxifen is a carcinogen and should be handled carefully. Always wear gloves when handling and wear a mask when weighing it as a powder, as there is a danger of inhalation.\nClean the area according to protocol and attach a gavaging needle to a 1 mL syringe. Draw 200 µL of tamoxifen into the syringe.",
    "Scruff PdgfrαCreERT2 ; Rosa26EYFP mice (10 weeks old; both sexes used) by placing them on a flat surface and firmly gripping the base of the tail. Use a free hand to grasp the middle of the mouse with the thumb and index finger, then gently and with slight pressure slide the grip until just past the shoulders.\nPinch the skin back with the thumb and index finger, pick up the mouse and flip the hand so that the mouse is facing the user, and tuck the tail between the pinky and ring finger of the hand holding the mouse.\nAt this point, ensure that the mouse is well immobilized and unable to move its head or arms. Insert the gavaging needle into the mouth and use it to slightly tilt the head of the mouse back; this allows the esophagus to be better accessible.\nCarefully and slowly insert the needle into the esophagus. Do not force the needle if any resistance is met; the needle should slide down easily. Slowly inject the tamoxifen. Monitor the mice for 15-20 min to ensure no problems occur while gavaging.\n\t\tNOTE: Administration of tamoxifen on 2 consecutive days typically results in ~75%-85% recombination efficiency of FAPs without causing any adverse effects. It is recommended that the user waits for 1-2 weeks before inducing injury, which will allow the remaining tamoxifen to be removed from the system and any remaining protein to be turned over.\n2. Injury of tibialis anterior (TA) muscle\nNOTE: To study intramuscular fat, it is recommended to use a glycerol-based injury model (50% glycerol in sterile saline), which results in massive intramuscular fat formation34,35,36,37.",
    "Prepare the anesthetic machine by adding isoflurane and ensuring the tubes to both the mouse chamber and nose cone are open. Clean the chamber and work area with either 70% ethanol or peroxide solution (depending on protocols).\nSet the oxygen flow rate to 2.5 L/min and the isoflurane concentration to 2.5%. Place a mouse into the anesthesia chamber and wait ~5 min for it to be anesthetized.\nPlace the mouse down supine on a clean heating pad and insert the nose into the nose cone. Gently apply vet ophthalmic ointment to the eyes with a cotton-tipped applicator to prevent dryness while under anesthesia. Continuously monitor anesthesia and perform a toe pinch on the mouse prior to the injury to ensure the mouse is fully anesthetized.\nClean the leg to be injected with a fresh alcohol wipe to disinfect.\nDraw up 30-50 µL of 50% glycerol (depending on the size of the mice) into the insulin syringe. Gently brush up the hair on the shin to expose the location of the TA.\n\tNOTE: It is easier to move the hair and achieve better visualization when it is still wet from the alcohol wipe.\nAfter locating the TA (just lateral to the tibia, it slightly protrudes through the skin and can be felt with gentle palpation), insert the needle into the TA distally, near the ankle. Fully insert the needle into the muscle and slowly inject glycerol while gradually withdrawing the needle, which helps to injure most of the muscle.\n\tNOTE: It is best to insert the needle parallel to the leg, with just a slightly elevated angle. A good injury typically causes dorsiflexion as the TA contracts after withdrawing the needle. If the mouse's toes spread out, it is likely that the extensor digitorum longus (EDL) muscle was injected.",
    "Place the mouse back in the cage and monitor for about 15-20 min to ensure anesthesia recovery.\nDiscard the needle in a sharps container. Never recap a needle.\n\tNOTE: Analgesia post glycerol injection should be provided as approved by the Institutional Animal Care and Use Committee. Adipocytes can be observed as soon as 5 days post-injury (dpi). By 7 dpi, all adipocytes have formed, and by 21 dpi, they have fully matured. \n3. Tissue harvest\nPrepare 4% PFA in 1x PBS and place on ice prior to starting harvesting.\nPlace any plates (12- or 24-well) being used for muscle fixation on ice and add 4% PFA to each well, making sure that each well has 10-20 times more volume of PFA than the tissue being fixed.\nBetween 7 and 21 days post glycerol injury, euthanize the mouse according to Institutional guidelines (i.e., isoflurane overdose followed by cervical dislocation).\nBegin harvesting any tissues to be used for histology or RNA isolation.\n\tNOTE: Tissues should be snap-frozen or placed in PFA within 10-15 min of sacrificing (Figure 2).\nLiberally spray any areas of the mouse to be cut into with 70% ethanol to help keep hair off dissecting area and instruments.\nUse scissors to cut the skin around the top of the leg, near the pelvis (Figure 3A).\nGently pull the skin of the leg from the top down to the ankle (Figure 3B).\n\tNOTE: The TA is a teardrop-shaped muscle with a clearly defined distal tendon attaching to the medial cuneiform and first metatarsal bone. It is lateral to the tibia and extends up to the lower knee.\nFirst, remove the outer connective tissue layer (epimysium) using sharp-tipped tweezers prior to harvesting the TA (Figure 3C). Use a dissecting microscope to visualize the epimysium better.",
    "Slide the tweezers underneath the TA from the bottom of the muscle, starting at the distal tendon, and gently pull upward toward the knee (Figure 3D). Stop at the end of the muscle; do not push past the resistance felt at the lower knee.\nIf there is significant resistance prior to reaching the lower knee, stop and continue removing leftover layers of connective tissue.\n\tNOTE: There is another distal tendon just lateral to the TA tendon that attaches to the EDL, which is a slender muscle lateral to the TA. Being careful to only slide the tweezers under the TA tendon prevents accidental harvesting of the EDL, but it can also be easily removed after fixation.\nOnce the TA has been partially lifted from the leg with the tweezers, use the same motion with a scalpel to sever the connection of the TA to the lower knee (Figure 3E). Cut the tendon at the ankle with scissors to fully remove the TA. Only handle the muscle at the tendon to avoid damaging the fibers.\nCut 1/3 of the TA at the end opposite the tendon (Figure 3F), put it in a microcentrifuge tube, and snap-freeze by dropping it into liquid nitrogen (Figure 3H).\nSubmerge the other 2/3 of the tissue in a labeled well with 4% PFA for histology (Figure 3I). Be sure to keep track of when the first and last tissue was placed in fixative. Place on a shaker for 2-2.5 h at 4 °C.\nThe duration of fixation is dependent on the tissue and its size. Determine the duration required for fixing the tissues. Fixing TAs for 2-2.5 h at 4 °C typically preserves adipocyte morphology well without causing over-fixation of the tissue.",
    "NOTE: If planning to use TA for whole-mount immunofluorescent staining, skip the rest of this protocol until reaching Section 7: \"Whole Mount Immunofluorescent Staining\".\nAfter fixation, remove PFA from the wells, rinse the tissues with cold 1x PBS 2-3 times, and then wash 2-3 times with cold 1x PBS for 5 min per wash.\nRemove the PBS from the wells and add enough 30% sucrose in 1x PBS to allow the tissue to float. Place on the shaker at 4 °C overnight.\nimgsrc://cloudfront.jove.com/files/ftp_upload/63996/63996fig3v2.jpg\nFigure 3: Tissue harvest summary. (A) The skin is cut at the base of the leg and (B) the hind limb muscles are exposed. (C) Once the epimysium is removed from the TA, (D) forceps are used to partially separate the muscle and ensure the epimysium has been removed completely. (E) The TA is cut from the leg with a scalpel and removed after cutting the tendon. (G) After cutting the TA into a one-third and a two-thirds piece, (H) one-third is snap-frozen in liquid nitrogen for RT-qPCR analysis and (I) the other two-third is fixed in 4% PFA for histology. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63996/63996fig3v2large.jpg]\n4. Embedding\nPrepare the specimen molds to be used for embedding by labeling and filling with enough embedding medium to fully submerge the tissues.\nRemove tissues from the wells, dry off excess sucrose on a paper towel, and move to the freezing medium-filled specimen molds.",
    "NOTE: It is helpful to know in what orientation the mold with be sectioned on the cryostat. This way, the user can orient the tissues in the mold in a way that allows the area of interest to be easily accessible. For the TA, this would be achieved by putting the thickest end (opposite from the tendon side) facing the surface that will be sectioned. This allows the TA to be easily sectioned at its thickest part (belly) and allows cross-sectional cutting of the muscle fibers.\nPrepare an isopentane slurry by partially submerging a container holding isopentane into liquid nitrogen. Ensure there is enough liquid isopentane in the container to submerge about half of the specimen mold to be used to embed the tissues.\nBegin freezing the molds by carefully putting them in the isopentane slurry and making sure that about half of the mold is submerged. Also, make sure that the mold is freezing equally from all four sides.\nTake the mold out of the isopentane just before the entire mold is visibly frozen over from the top. The amount of time this takes depends on the molds being used.\nKeep the frozen molds in a container with dry ice while freezing the rest of the blocks, then store them at -80 °C.\n\tNOTE: Isopentane for freezing can be reused. Put into a glass bottle but do not tighten the lid until isopentane reaches room temperature (RT). Otherwise, the change in pressure could shatter the bottle.\n5. Sectioning\nSet the cryostat to -22 to -24 °C, add molds containing TAs into the cryostat, and wait for a minimum of 30 min for temperature acclimatization. In the meantime, label a series of positively charged microscope slides.",
    "Insert an anti-roll plate and align to the cryostat such that there are minimal nicks in the plate where it makes contact with the specimen block. Secure in place.\nInsert a fresh cryostat blade into the blade holder and secure it in place.\n\tCAUTION: The blade is sharp. Cover the blade when manipulating other parts of the cryostat or frozen molds.\nRemove the frozen block from the mold. Add a uniform layer of embedding medium to the cryostat chuck and position the block in the medium. Let it sit for 1-3 min until the embedding medium is completely frozen (opaque white).\n\tNOTE: For TAs, the thickest area (belly) should be visible when on the chuck.\nPlace the cryostat chuck with the tissue block into the cryostat. Uncover the blade and advance the cryostat forward until just coming into contact with the blade. Section through the block at 25 µm sections until the tissue is no longer obscured by the embedding medium.\n\tNOTE: While sectioning, adjust the angle of the cryostat and/or position of the stage such that the sections are of uniform thickness. It may be helpful to collect a few sections to ensure uniformity in section thickness. It is recommended that the user finds the proper anti-roll plate position prior to sectioning through to the region of interest within the TA (belly), as this allows the user to try several positions of the anti-roll plate until the sections are coming off straight without wasting tissue.\nChange section thickness to 10-12 µm and collect the sections on labeled microscope slides. Serial sectioning is recommended by collecting adjacent sections on 6-10 slides (labeled 1-x), which allows for staining for multiple markers. If needed, use a thin brush to uncurl sections before collecting them on the slide.",
    "NOTE: If sections are curling, check that the temperature is holding steady within the -22 to -24 °C range. If there are vertical striations in sections, this could be due to a nick in the anti-roll plate or the blade; this can be fixed by adjusting the position of the anti-roll plate and/or switching to a new blade.\nAfter collecting adjacent sections of the same sectioning plane onto each slide, adjust the thickness back to 25 µm to advance 150-200 µm through the block, then adjust the thickness back to 10-12 µm and begin sectioning again.\n\tNOTE: This serial sectioning allows the user to visualize, image, and quantify at different depths through the TA; three to four serial sections per slide is sufficient.\nStore the slides and tissue blocks at -80 °C.\n6. Immunofluorescent (IF) staining of tissue sections\nNOTE: As antibody concentrations can vary between lots and manufacturers, optimization is recommended by evaluating several different concentrations of the antibodies on test slides prior to staining the slides of interest.\nThaw/dry slides either at RT or on a warm plate at 37 °C for 10-20 min.\nUse a hydrophobic pen to draw a line at the edge of the slide's paper surface, where it meets the glass.\nPut the slides in a Coplin jar and wash with 1x PBS + 0.1% Tween20 (PBST) 3-5x on a shaker for at least 5 min per wash to rehydrate the tissue sections.\n\tNOTE: At this point, it is important to not let the slides sit without being submerged in PBST (up to the hydrophobic line), or the tissue sections will dry out.",
    "Place the slides on the rack of a humidifying chamber and overlay the slides with 310-350 µL of blocking solution (5% donkey serum and 0.3% Triton X-100 in 1x PBS) for 1-2 h at RT.\n\tNOTE: No extra permeabilization step is needed, as the blocking solution contains 0.3% Triton X-100 allowing for sufficient permeabilization of the tissue sections. When using primary antibodies derived from mice (i.e., PAX7 and MYOD1 listed below), it is recommended to include a mouse-on-mouse blocking step using Fab fragments (1:50) in the blocking solution for the blocking step. This will help reduce background due to nonspecific binding of the mouse secondary antibody to antibodies other than the primary.\nDilute the primary antibodies to be used in the blocking solution shortly before proceeding to the next step as follows:\n\t\nPrimary antibodies for adipocyte staining and whole section imaging: Dilute rabbit anti-Perilipin at a dilution ratio of 1:1000.\nPrimary antibodies for lineage tracing of adipocytes: Dilute chicken anti-GFP at a ratio of 1:1000 and rabbit anti-Perilipin at 1:1000.\nPrimary antibodies for lineage tracing of FAPs: Dilute chicken anti-GFP at a ratio of 1:1000 and goat anti-PDGFRα at 1:250.\nPrimary antibodies for myogenic markers: Dilute mouse anti-PAX7 at a ratio of 1:25 or mouse anti-MYOD1 at 1:250, and rabbit anti-LAMININ at 1:1000.",
    "NOTE: While the antibodies listed above have been successfully assessed with this protocol, it is likely that other markers and antibodies to label FAPs, adipocytes and/or other cell types are also compatible with this protocol. It is strongly recommended when using primary antibodies for the first time that the user include a negative control slide, in which primary antibodies are omitted. This will control for the specificity of the antibodies. All other steps in the protocol are followed, including the addition of secondary antibodies, but the blocking solution is used alone in the next step instead of the primary antibody in the blocking solution.\nDump the blocking solution off the slides and overlay with 310-350 µL of blocking solution with primary antibodies and incubate overnight at 4 °C in the humidifying chamber.\nThe next day, dump the blocking solution/primary antibodies off the slides and place them in a Coplin jar. Rinse the slides 2-3 times with PBST and wash 3-5x with PBST on a shaker for at least 5 min per wash.\nDuring the last wash, prepare the secondary antibodies or any direct conjugates to be used in the blocking solution. Minimize the amount of time these antibodies spend in the light to avoid photobleaching.\n\t\nDilute secondary antibodies/direct conjugates: 488 nm donkey anti-chicken (1:1000) or anti-rabbit (1:1000) or anti-mouse (1:1000), 568 nm donkey anti-goat (1:1000) or anti-rabbit (1:1000) or Phalloidin (myofibers; 1:100), DAPI stain (nuclei; 1:500).\nOverlay the slides with 310-350 µL of the blocking solution with secondary antibodies and/or direct conjugates in the humidifying chamber. Incubate at RT for 1-2 h. Protect samples from light from now on.",
    "Dump the blocking solution/secondary antibodies and place them in a Coplin jar. Rinse with PBST once and wash 3-5x with PBST on a shaker for at least 5 min per wash. Keep the Coplin jar covered to prevent light exposure.\nDry the slides as well as possible by tapping the edges and wiping the back against a paper towel, but do not let the tissue sections dry out.\nAdd three or four drops of aqueous mounting medium to the top horizontal edge of the slide and gently add a coverslip. Do not press down or move if air bubbles form under the coverslip; any pressure or movement can distort the fragile cellular architecture of adipocytes.\nAllow mounting medium to set in the dark overnight before imaging.\n7. Whole-mount immunofluorescent staining\nAfter ~1 h of fixation (see step 3.14), use sharp-tipped tweezers to peel away myofibers from the fixed TA.\nPlace the separated fibers into a 24-well plate and wash 3x for 3 min each with PBST. For all subsequent incubations, ensure to add the lid to prevent evaporation.\nIncubate for 1 h in 1% Triton X-100 in 1x PBS at RT (200-300 µL) on a shaker to allow better penetration of antibodies.\nAfter rinsing a few times with PBST, overlay with blocking solution (200-300 µL) and block on a nutator or shaker overnight at 4 °C.\nDilute the primary antibodies at the desired concentration (doubling the concentration tends to be a good starting point) in the blocking solution. Incubate the samples (200-300 µL) on a nutator or shaker overnight at 4 °C.\nWash the samples rigorously with PBST throughout the day with frequent changes at RT on the shaker, about 4-6x for 30-60 min each wash.",
    "Dilute the secondary antibodies in the blocking solution at the desired concentration (1:500 tends to work well) plus nuclear staining and incubate the samples (200-300 µL) on a nutator or shaker overnight at 4 °C.\nWash samples rigorously with PBST throughout the day with frequent changes at RT on the shaker, about 4-6x times for 30-60 min each wash or wash overnight at 4 °C.\nTo mount, gently dry off excess PBST and then place the fibers in one or two drops of mounting medium on a glass slide (Figure 4A). To raise the coverslip (18 mm x 18 mm), add little clay feet; this will prevent the fibers from being squashed and secure the coverslip to the slide. Modeling compounds work well for this. Once the coverslip is secured, add more medium to the edge until the area under the coverslip is full.\n\tNOTE: Instead of using a mounting medium containing anti-fading agents, the tissue can also be moved through an ascending series of glycerol (30% to 80% glycerol in PBS).\nWait for 1-2 days before imaging to allow curing of mounting medium.\n8. Imaging of intramuscular fat\nTurn on the microscope and launch the imaging software. Secure the slide on the stage.\n\tNOTE: For imaging adipocytes in muscle sections, a 5x or 10x objective combined with widefield microscopy is often sufficient. For visualizing WM-IF, a confocal microscope is required.\nUse any channel to identify the area to be imaged.\nIn the imaging software, adjust the gain and exposure time for each channel.\nTake images of the whole tissue in each channel (automatic or manual according to microscope and software used) and merge individual tiles to make a composite of the full TA cross-section.",
    "NOTE: It is recommended to take images of two or three different sections of the same TA at different depths. By quantifying the adipocytes in each section and then reporting the average, localized differences in the amount of intramuscular fat due to, for example, injection errors will be avoided.\n9. Quantifying adipocytes\nIf not previously installed, add the Cell Counter plug-in to ImageJ (https://imagej.nih.gov/ij/plugins/cell-counter.html). \nImport the images into ImageJ as TIF files or original microscope files. View each channel in ImageJ as a separate TIF file.\n\tNOTE: If using LIF or similar microscope file types, under Bio-Formats Import options, choose Hyperstack for View Stack With and check the box for Split Channels. Click OK to open the file. Also, ensure that the Autoscale box is unchecked.\nEnsure that images for each channel are in 8-bit format (and gray): Image > Type > 8-bit.\nMerge DAPI (blue), GFP (green), PERILIPIN (red), and PHALLOIDIN (gray) images: Image > Color > Merge Channels.\nCheck that scale (Analyze > Set Scale) is in microns. Using the freehand selection tool, outline the injured and uninjured portion of each cross-section, then measure (Analyze > Measure) and record the injured vs. uninjured area in a spreadsheet.\n\tNOTE: Injured muscle can be identified as areas devoid of myofibers or areas populated by myofibers that contain centrally-located nuclei.\nLaunch Cell Counter: Plugins > CellCounter > Initialize.\nSelect a counter type, then count each adipocyte. Record the total number of adipocytes in a spreadsheet, then calculate the number of adipocytes per 1 mm2 of the injured area.\n10. Adipogenic gene expression analysis using RT-qPCR\nRNA Isolation\n\t\nBefore beginning, preheat RNase-free water to 45 °C and prepare fresh 70% EtOH (350 µL per sample).",
    "Add 1,000 µL of guanidium thiocyanate to each tube containing the sample (see step 3.12.). It is important that bead beater-approved tubes are being used.\n\t\tCAUTION: Guanidium thiocyanate is toxic. Wear appropriate personal protective equipment and handle in a fume hood.\nAdd three medium beads or one large and one small bead to each tube.\nHomogenize the tissue at 50 Hz for 2-4 min using a bead beater. Depending on tissue type and sample size, it may take up to 10 min.\nAdd 200 µL of chloroform.\n\t\tCAUTION: Chloroform is toxic. Wear personal protective equipment and handle in a fume hood.\nShake the samples for 15 s. Incubate for 2-3 min at RT.\nCentrifuge for 15 min at 12,000 x g. Pipette out 350 µL of the clear supernatant (upper layer containing the RNA) and add to a new microcentrifuge tube containing 350 µL of 70% ethanol. Be careful not to aspirate the lower protein and/or DNA layers\nTransfer up to 700 µL of the mixture to a mini spin column placed in a 2 mL collection tube. Continue with RNA isolation following the manufacturer's instructions.\nElute with 30-50 µL of RNase-free water, depending on expected yield. Keep RNA on ice and measure the yield using a spectrophotometer. Keep the RNA stored at -80 °C\n\t\tNOTE: It is possible to omit the DNase treatment step, as carefully taking off just the upper 350 µL of the RNA layer is sufficient in preventing DNA contamination. In addition to RT-qPCR analysis, the isolated RNA can also be used for RNA-sequencing, in which case a DNase treatment step is highly recommended.\ncDNA synthesis\n\t\nUse up to 1 µg of RNA to synthesize cDNA with a cDNA synthesis kit, following the manufacturer's instructions.",
    "After the run is complete, add 80 µL of RNase-free water. Store the samples at -20 °C.\nRT-qPCR of adipocyte-selective genes.\n\t\nUsing a 384-well format, add 1 µL of primer (~1 µM final concentration) to the bottom of each well. Pre-drying primers results in tighter technical replicates. Leave covered until primers have evaporated completely (the plate can be placed on a heating block set to 37 °C to speed up evaporation).\nSet up sample reactions with four to eight technical replicates as follows: 2.5 µL of dye-based RT-PCR master mix, 2.1 µL of RNase-free water, and 0.4 µL of cDNA (~1 ng) with 5 µL total volume per well. The following thermal cycling conditions were used: denature at 95 °C for 15 s and anneal/extend at 60 °C for 25 s for 40 cycles.\nNormalize raw CT (cycle threshold) values to housekeeping genes (i.e., Hprt and Pde12) levels by calculating ΔΔCT as described here38. See20 for primer sequences.\n\t\tNOTE: Standard practice for RT-qPCR analysis should be followed, such as the use of a minus Reverse Transcription (-RT) control, PCR reaction, and primer validation."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}