{
  "id": 2414,
  "origin_website": "Cell",
  "title": "Protocol for Evaluating Neuronal Polarity in Murine Models",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nPolarity Acquisition In Vitro: Primary Culture of Hippocampal Neurons\nTiming: 6 h–14 days\nThe embryonic hippocampus is enriched in pyramidal neurons, a homogeneous population of neural cells exhibiting the cell body (soma), several dendrites and one single axon. In this regard, the culture of hippocampal neurons, isolated from embryonic rat brains, is a well-characterized cellular model widely used to study neurons at the single-cell level, in physiological or pathological contexts.\nCulturing hippocampal neurons involves 4 main steps: embryo isolation, hippocampal dissection, digestion, and plating. The yield by E18.5 brain is approx. 300,000 neurons per hippocampus (600,000 hippocampal neurons by brain). In case of needing larger amounts of neurons, especially for biochemical studies, neurons isolated from the brain cortex can be used, which is also enriched in pyramidal neurons. Nevertheless, additional neural types may also be found. In any case, both hippocampal and cortical neuronal polarization are almost (if not completely) identical.\nNote: Major steps 1–2 do not need sterile conditions.\nIsolation of E18.5 rat embryos.\nTiming: 15–20 min\nPlace E18.5 pregnant rat inside the CO2 euthanasia chamber for rodents. Open the CO2 flux until notice a reduction on breath frequency and the rat is completely asleep (usually 8–10 s in a chamber for rats). Once vital signs are no longer detectable, proceed with cervical dislocation.\nCritical: Overdose of CO2 may affect the dissection, reducing the yield and viability of neurons. Therefore, be cautious with CO2 over-exposure to avoid unnecessary carbonation of brain tissue. In any case, euthanasia must be adjusted to local and international guidelines for animal care and use.\nSterilize the belly zone with 70% v/v ethanol.\nMake an incision in the middle zone of the belly to expose embryos (Figure 1[href=https://www.wicell.org#fig1]; second step).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/190-Fig1.jpg",
    "Figure 1. Dissection of Hippocampus of Embryonic (E18.5) Rat Neurons\nThe scheme summarizes main steps involved on culturing hippocampal (or cortical) primary neurons, including embryo isolation, hippocampal and cortical dissection, enzymatic/mechanical digestion and plating of neurons. Immediately after, neurons will undergo polarization, evidenced by neurite growth and axo-dendritic specification.\nTransfer embryos to a 100 mm petri dish, partially filled with pre-chilled PBS (4°C).\nCritical: Check the pregnancy (E18.5) and size of embryos (total length should be close to 1.5–1.8 cm).\nHippocampal and cortical dissection.\nTiming: 0.5–2 h\nOpen embryo sacs with a small scissor and transfer each embryo to a new 100 mm petri dish, partially filled with pre-chilled PBS (4°C).\nIsolate heads by doing an incision at the neck using a small scissor (Figure 1[href=https://www.wicell.org#fig1]; third step).\nOpen the skull using a micro-scissor, cutting the dorsal line of the head from the neck to the front. To hold heads, introduce a fine tweezer (No.5 Dumont or equivalent) through the eye sockets (Figure 1[href=https://www.wicell.org#fig1]; third step).\nTransfer the embryonic brains to a 60 mm petri dish (or equivalent), previously filled with 3–4 mL HBSS supplemented with 0.35 g/L NaHCO3.\nNote: You will need a stereo-microscope to continue with the dissection.\nUnder scope, split hemispheres with a tweezer.\nUsing a fine tweezer (No.5), remove and discard meninges from each hemisphere.\nIsolate the hippocampus using a micro-scissor and transfer to a new 60 mm petri dish (pre-filled with 4.5 mL HBSS) (Figure 1[href=https://www.wicell.org#fig1]; fourth step).\nIf needed, transfer cerebral cortices to a petri dish pre-filled with 4.0 mL HBSS.\nDigestion\nTiming: 20–40 min\nHippocampal neurons\nAdd 0.5 mL of 10× trypsin to the petri dish containing hippocampi (pre-filled with 4.5 mL HBSS). Incubate 20 min at 37°C.\nTransfer digested hippocampi to a 15 mL centrifuge tube.",
    "Make 3 quick washes with 2 mL HBSS.\nDiscard HBSS and add 2–3 mL of 10% HS MEM, pre-warmed at 37°C.\nResuspend hippocampi with a glass Pasteur pipette, repeating several up-and-down (using a pipette filler, bulb or Finnpipette) movements until obtaining a homogenous suspension. The classical pipette rubber bulb may confer more sensitivity.\nRepeat the procedure with a “half-diameter tip” pipette.\nFinally, repeat “up-and-down” movements using a “quarter-diameter tip” pipette, until homogenate. Avoid making foam.\nAlternatives: Tissue homogenization can be done using micropipettes (200–1,000 μL). Repeat “up-and-down” movements until obtain a homogenous suspension, following the rule of using, first, a large tip (1,000 μL) and then a small one (200 μL). The goal is to isolate neurons gradually, avoiding cell clumps, without - or the less possible - mechanical stress.\nCount cells using a Neubauer chamber and estimate the yield [cells / (μL or mL)] If needed, dilute cells 1/10. Of note, if hippocampi are resuspended in 2–3 mL 10% HS MEM (step v), the yield should be close to 1–2 × 106 neurons/mL (considering 10–12 brains; 20–24 hippocampi).\nCortical neurons\nAdd 0.5 mL of 10× trypsin + 0.5 mL of 10× DNase to the petri dish containing cortices (pre-filled with 4.0 mL HBSS). Incubate 25 min at 37°C.\nTransfer cortices to a 15 mL centrifuge tube.\nMake 3 quick washes with 4–5 mL of HBSS.\nDiscard HBSS and replace by 5 mL of 10% HS MEM (or suitable volume), pre-warmed at 37°C.\nRepeat several “up and down” movements using a 1,000 μL micropipette until obtain a homogeneous suspension of cells. Avoid making foam.",
    "Count cells using a Neubauer chamber and estimate the yield [cells / (μL or mL)]. For counting, dilute cells 1/100. Of note, if cortices are resuspended in 5 mL 10% HS MEM (step iv), the yield should be close to 107 neurons/mL (considering 10–12 brains; 20–24 cortices)\nCritical: In both cases (hippocampal and cortical neurons), should get isolated cells after digestion. The presence of clumps reflects inefficient enzymatic/mechanical digestion. If needed, repeat mechanical digestion until obtain isolated cells or check trypsin.\nPlating neurons\nTiming: 1–4 h\nEstimate the volume needed to plate neurons at the required density:\ntable:files/protocols_protocol_190_2.csv\nPlate hippocampal or cortical neurons in pre-coated PLL culture dishes, using 10% HS MEM.\nOnce neurons are attached (1–2 h after plating), replace 10% HS MEM by Neurobasal medium supplemented with B27, Glutamax and Pen/Strep.\nCritical: If needed, change the culture medium every 3–4 days, but always preserving 1/3 of the volume. Neurons will enrich the medium by secreting growth factors.\nMonitoring polarity acquisition in vitro\nTiming: 6 h–14 DIV\nNote: After plating, hippocampal and cortical neurons will transform from symmetric cells (stages 1–2; 0.5–1 DIV) to neurons with well-defined axonal and dendritic compartments (stages 3–5; 3–14 DIV (Dotti et al., 1988[href=https://www.wicell.org#bib17]; Kaech and Banker, 2006[href=https://www.wicell.org#bib28]; Cáceres et al., 2012[href=https://www.wicell.org#bib13]). Of note, culture times indicated below are applicable to middle-low cell culture densities. It is important to highlight that timing suggested below may vary depending on neuronal confluency after plating, culture media composition and coating (for extended comments, please see problem 3 in troubleshooting). In addition, later stages (3–5) could be sub-divided (e.g., early and late-stage 3; 2 and 4 DIV, respectively).\nPrepare a fresh solution of 4% w/v paraformaldehyde (PFA) and 4% w/v sucrose, dissolved in PBS. Adjust pH to 7.4.",
    "Fix neurons with 4% PFA/sucrose solution for 20 min at RT (20°C–25°C). Then, wash with PBS for immunofluorescence (IF) staining.\nStage 1 (6 h after plating). Stain with tubulin (ß3-tubulin or Tyr-tubulin) antibody and phalloidin to visualize neurons and their actin organization by IF (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/190-Fig2.jpg\nFigure 2. Morphological Stages and Molecular Markers Visualized during the Establishment of Hippocampal Neurons in Culture\n(A) Representative images showing cultured hippocampal neurons in stage 1 (6 h after plating), stage 2 (18 h after plating), stage 3 (2–3 DIV after plating), stage 4 (4–5 DIV) and stage 5 (14 DIV). Stage 1 and stage 1–2 scale bar, 10 μm; stages 2-5 scale bar, 20 μm.\n(B) Representative images showing the GC of axon-like process and minor neurites in stage 2 neurons. Scale bar, 10 μm.\n(C) Representative image showing stage 3 neurons stained by immunofluorescence (IF) with MAP2 and Tau-1 antibodies. The Tau-1 epitope is enriched in the distal part of the axon, whilst MAP2 is mostly segregated in the soma and minor neurites. Scale bar, 50 μm.\n(D) Representative 10 DIV neuron (stage 5), stained by IF to detect the dendritic marker MAP2, and the clustering of Ankyrin G (AnkG) in the axon initial segment (AIS). Neurons were transfected with a GFP-encoding plasmid to be able to visualize single neurons at this stage. Scale bar, 20 μm.\nStage 2 (18 h after plating). Stain with tubulin (ß3-tubulin or Tyr-tubulin) antibody and phalloidin to visualize neurons, neurites, and growth cones by IF (Figure 2[href=https://www.wicell.org#fig2]A, B).\nStage 3 (2–5 DIV after plating). Stain neurons with tubulin (ß3-tubulin or Tyr-tubulin) antibody and phalloidin to visualize minor neurites and axons by IF (Figure 2[href=https://www.wicell.org#fig2]A). In addition, stain with MAP2 and Tau-1 antibodies to identify somatodendritic and axonal compartments, respectively (Figure 2[href=https://www.wicell.org#fig2]C).",
    "Stage 4 (5–7 DIV after plating). Stain neurons with synapsin and MAP2 antibodies to visualize dendrites and branching at this stage IF (Figure 2[href=https://www.wicell.org#fig2]A).\nStage 5 (7–14 DIV (and beyond) after plating). Stain neurons with PSD-95 and synaptophysin to visualize post and pre-synaptic terminals, respectively (Figure 2[href=https://www.wicell.org#fig2]A). Alternatively, stain with MAP2 and AnkG antibodies, to detect dendrites and the assembly of the axon initial segment (AIS) of mature axons, respectively (Figure 2[href=https://www.wicell.org#fig2]D).\nNote: Currently, several molecules have been identified as markers, enriched in either the axonal or dendritic domain. Accordingly, Table 1[href=https://www.wicell.org#tbl1] summarizes a battery of markers to identify these compartments during the acquisition of neuronal polarity.\ntable:files/protocols_protocol_190_3.csv\nTiam1: T-cell lymphoma invasion and metastasis-inducing protein 1 (Rac1 guanine exchange factor); GAP-43: growth associated protein 43; p75 NTR: p75 neurotrophin receptor; Tau-1: dephosphorylated epitope of Tau protein; SM-31: phosphorylated MAP1B; SMI-312: neurofilament protein; MAP2: microtubule associated protein 2; MAP1A: microtubule associated protein 1A; Tfr: transferrin receptor; GOPS: Golgi outposts; AnkG: ankyrin G; PSD-95: post-synaptic density 95; NR2B: NMDA-receptor subunit 2B.\ntable:files/protocols_protocol_190_4.csv\nThe list contains critical cell biology parameters defining axonal formation and dendritic growth at early stages of neuronal polarization (stage 1 – stage 3).\nPolarity Acquisition In Situ: In Utero Electroporation of E15.5 Mouse Brains\nTiming: 2–3 days\nThe development of the brain cortex starts early during embryonic life. Firstly, neurogenesis begins at E11.5-E13.5 in the ventricular zone (VZ), a cortical layer highly enriched in neural precursors (Kriegstein and Noctor, 2004[href=https://www.wicell.org#bib30]). During this time, precursors experience their last mitotic division to then differentiate into post-mitotic neurons. After that, neurons undergo polarization and migration; both phenomena occur simultaneously and represent the best-characterized parameters to evaluate embryonic neuronal development in situ. Of note, embryonic cortical neurons exhibit (mostly) a pyramidal phenotype, although additional types of neurons can be found.",
    "The analysis of polarity acquisition in situ involves 4 main steps: anesthesia of the animal, in utero electroporation (IUE), post-electroporation procedures, and imaging. The expression of plasmids encoding fluorescent proteins, such as GFP, allows monitoring the migration and polarization of cortical neurons during embryonic corticogenesis (as well as in post-natal stages). In this protocol, we focus on E15.5-E17.5 days, because within this time-frame neurons undergo morphological transformations that resemble the first stages of polarity acquisition in culture (Kriegstein and Noctor, 2004[href=https://www.wicell.org#bib30]; Barnes and Polleux, 2009[href=https://www.wicell.org#bib48]; Takano et al., 2019[href=https://www.wicell.org#bib49]).\nAnesthesia and sterilization of the animal\nPlace the pregnant mouse inside the chamber containing the isoflurane + oxygen mix for anesthesia. The anesthesia procedure consists of two phases:\nInduction: 4% isoflurane flow is needed to achieve full anesthesia in short time (visible by a reduction on the breath frequency).\nMaintenance: Place the animal in the warming system at 37°C. Make sure to introduce the mouth into the anesthesia device and set isoflurane flow to 2%–2.5% for the surgery. To confirm full anesthesia, pinch the toes with a tweezer and confirm the lack of response.\nMake a subcutaneous injection of 1 mg/kg tramadol (or equivalent).\nSterilize the animal:\nShave the abdomen using a razor blade or an electric razor.\nDisinfect the zone with iodine solution and 70% v/v ethanol.\nEmbryo exposure\nMake and incision with fine scissors in the abdomen, along the alba line, of both skin and muscle layers. An incision of 5 mm length is enough to expose embryos (Figure 3[href=https://www.wicell.org#fig3]; first step).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/190-Fig3.jpg\nFigure 3. DNA Injection and IUE of Mouse Brains (E15.5)",
    "In utero electroporation (IUE) of E15.5 mouse brains involves several steps, including anesthesia with isoflurane, embryo exposure, DNA injection & electroporation, recovery after surgery, histology, and imaging of GFP-positive brains. The scheme summarizes the main steps of this procedure.\nPull out the uterine horns carefully (Figure 3[href=https://www.wicell.org#fig3]; second step). Expose embryos one by one and avoid twisting the uterus.\nMake sure to expose all embryos.\nKeep the uterus moist with warm PBS (37°C) during the whole surgery.\nDraw a map of the exposed uterus, reproducing embryos in the left and right horns. This will be critical to determine possible embryo resorption after surgery.\nInjection & Electroporation\nInjection of the DNA mix solution.\nCarefully, insert the glass capillary into the lateral ventricle of each brain (Figure 3[href=https://www.wicell.org#fig3]; third step).\nInject approx. 1–2 μL of DNA mix solution. A successful injection will be evident if a small and well-defined spot of the dye appears in the brain (Figure 3[href=https://www.wicell.org#fig3]; third step).\nRecord the embryos injected in the map drawn in the step 7e.\nCritical: Do not inject the same embryo more than once.\nIn Utero Electroporation (IUE) of the embryos\nImmerse electrodes in saline solution (PBS) to improve conductivity.\nOne at time, hold the head of each embryo with a fine tweezer to position the electrodes on each side of the ventricles.\nMatch the positive (+) pole of the electrode with the side of the injection (Figure 3[href=https://www.wicell.org#fig3]; third step).\nRun the electroporation. We recommend starting with the following setting: ΔV = 39 V Pulse time: 50 ms No. of pulses: 5 Resting time between pulses: 950 ms Polarity: Unipolar\nRepeat the procedure with the remaining embryos.\nPost-electroporation procedures\nUsing tweezers, return embryos to the abdominal cavity. Avoid twist the horns.\nClean the area with 500 μL PBS (pre-warmed at 37°C).",
    "Suture the inner and outer layer (muscular and skin layers, respectively) with surgical suture.\nPlace the animal in a quiet place to allow the recovery from anesthesia.\nMonitor mouse recovery after surgery.\nCritical: The surgery time should not exceed 30 min per mouse.\nTwo days after (at E17.5), sacrifice the mouse using a CO2 chamber, followed by cervical dislocation.\nOptional: If needed, extend experimental IUE times above E17.5 depending on your experimental conditions.\nExpose embryos (steps 7.a-c), compare with the map (step 7.e) and check (if any) resorptions.\nRemove and sacrifice embryos by decapitation.\nIsolate brains and transfer to a petri dish containing pre-chilled PBS.\nCheck GFP-positive brains using a fluorescent/stereo microscope (10×–20× magnification).\nTissue processing and imaging of polarity acquisition in situ\nTransfer GFP-brains to a 15 mL centrifuge tube and fix them in 4% v/v PFA overnight (ON; 16–18 h) at 4°C, with gentle agitation. For a proper fixation, the volume of PFA must be at least 10 times the volume of the brain.\nCritical: Over-fixation will damage the brain, affecting tissue staining (if applicable) and imaging (see an example of over-fixed tissue in Figure 4[href=https://www.wicell.org#fig4]D).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/190-Fig4.jpg\nFigure 4. Migration and Cortical Neurons and Polarization In Situ by IUE Mouse Brains\n(A and B) Representative images showing E17.5 and E18.5 brain cortices in utero electroporated (IUE) at E15.5. Scale bar, 200 μm.\n(C) Magnification of insets 1–4, showing bipolar and multipolar neurons at E17.5 and E18.5. Scale bar, 20 μm.\n(D) Representative image showing an over-fixed cortical slice. The presence of “holes” in the tissue (arrows) reveals either over-fixation or inefficient post-fixation procedures. Scale bar, 200 μm.\nNext day, place the fixed brains in a 1.5 mL centrifuge tube (Eppendorf or equivalent) with 30% v/v sucrose solution and incubate at 4°C for 18–24 h.",
    "Optional: Brains can be store for longer periods of time once in sucrose solution. In any case, avoid long-term storage to avoid contamination.\nRemove from sucrose and immerse brains in criopreservant solution (Crioplast Biopack or equivalent) at −20°C. Brains will be ready once look like a solid white block.\nUsing a cryostat (Leica CM 1850), slice cerebral cortex into 40 μm coronal sections.\nTransfer brain into gelatin pre-coated glass slides.\nPermeabilize cortical slices with 0.3% v/v Triton X-100-PBS solution for 15 min at RT.\nIncubate DAPI for 15 min at RT (20°C–25°C). Make 3 washes of 5 min with PBS at RT.\nSeal samples using Mowiol (or equivalent).\nImage cortices using a confocal microscope.\nAlternatives: A properly set wide-field microscope may also work.\nPerform z-stack imaging of GFP-positive cortices at the magnification needed.\nIf needed, take several fields to reconstruct the whole cortex during post-imaging\nUsing Fiji, go to z-project and project the maximal intensity of the fluorescence.\nIf needed, stitch images to reconstruct the whole cortex using the Fiji’s plug-in “stitching”.\nDivide the cortex in 4 layers (from the bottom to the top): ventricular zone (VZ), subventricular zone (SVZ), intermediate zone (IZ), cortical plate (CP) (Figures 4[href=https://www.wicell.org#fig4]A and 4B).\nUse the Fiji’s plug-in “cell counter” to quantify the number of GFP-positive cells in each layer.\nEstimate, by visual inspection and cell counting, the number of rounds, multipolar and bipolar cells in each layer (Figure 4[href=https://www.wicell.org#fig4]C).",
    "Note: Neuronal polarization in situ occurs in the IZ of the cortex (Namba et al., 2014[href=https://www.wicell.org#bib37]; Xu et al., 2015[href=https://www.wicell.org#bib45]). In this zone, multipolar neurons acquire a bipolar morphology, developing the leading neurite (apical dendrite) and a trailing neurite (axon). Therefore, morphological parameters are commonly used to discriminate between polarized (bipolar) and unpolarized neurons (multipolar or round cells). Nevertheless, molecular markers available to identify axonal and dendritic compartments in situ are less abundant than in vitro markers. In any case, we have summarized several markers currently used to identify each phenotype during polarization of neurons in situ (Table 3[href=https://www.wicell.org#tbl3]).\ntable:files/protocols_protocol_190_5.csv\nMolecular markers currently used to identify the main cellular morphologies detected in cortical layers of the mouse brain cortex after IUE procedures. LKB1: serine/threonine kinase; TAG-1: transient axonal glycoprotein 1; Trb1: telomerase repeat binding factor 1; Tbr2: T-box brain protein 2; MAP2: microtubule associated protein 2; SMI-312: neurofilament marker."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience",
    "Microscopy"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}