{
  "id": 1977,
  "origin_website": "Cell",
  "title": "In silico and in vitro protocols for quantifying gene expression noise modulated by microRNAs",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDownload codes\nTiming: 10 min\nThe MATLAB codes for simulating gene expression noise and the R codes for analyzing flow cytometry data are available at https://github.com/XWangLabTHU/microRNA_noise[href=https://github.com/XWangLabTHU/microRNA_noise]. Please notice that all MATLAB codes should be downloaded into one same folder as the execution of solve_noise.m relies on the function steady_state.m. See troubleshooting 1[href=https://www.wicell.org#sec5.1] for details.\nSimulating gene expression noise modulated by miRNA\nTiming: 20 min\nIn this section, we will describe how to set up a mathematical model to simulate the influence of miRNA properties on gene expression noise in MATLAB, using the code we provided.\nThe parameters of the mathematical model can be modified to fit the purpose of simulation. There are four main types of parameters that should be set before simulation: the kind of model, the fixed parameters, the altered parameters, and the simulation step size and range. After, the model could be simulated and visualized.\nSet parameters for simulation.\nOpen MATLAB. Open the folder where the MATLAB codes are deposited.\nOpen the code file solve_noise.m. Please notice that in MATLAB, lines beginning with “%” denote comment lines in the code that will not be read as code in the software.\nSet the type of model on Line 7. There are three types of preset miRNA regulation models:\nfor competing RNAs:\n> type = 1;\nfor repetitive targets of same miRNAs:\n> type = 2;\nfor multiple targets of different miRNAs:\n> type = 3;",
    "Set the fixed and altered parameters. These parameters describe the production and degradation rates of all components in the biochemical reactions, which are shown in Figure 2[href=https://www.wicell.org#fig2]. All parameters involved in the model should be set before simulation in the “set fixed parameters” section. All parameters that should be altered for simulating different conditions should be set in the “set altered parameters” section. We provide samples of altered parameters for all three model types, of which parameters for type 2 and 3 are commented on by default. If users are interested in type 2 or 3, they should uncomment (remove the \"%\" from the beginning of the line) the corresponding codes of the type they are interested and comment (add a \"%\" to the beginning of the line) the unrelated codes of other types. We provided default parameter settings in the code according to previous studies that describes perfect complementary miRNA target sites (Wei et al., 2019[href=https://www.wicell.org#bib10], 2021[href=https://www.wicell.org#bib11]; Yuan et al., 2015[href=https://www.wicell.org#bib12]). Users can modify these parameters by comparing their interested miRNA targets and the perfect complementary miRNA targets in this study.\nThe simulation step size and range should be assigned in the “set simulation parameters” section. The simulation range determines the range that the gene expression is simulated in by setting the production rate of the target gene’s mRNA (kT). We recommend users to set a wide range with a large step size to quickly determine the lower and upper limit of the range, and then narrow the step size to gain a refined simulation result.",
    "Run solve_noise.m to simulate the model with the set parameters by clicking Run in the Contextual Tab Editor. The results will be written into the file exp_mean.mat and exp_CV.mat. exp_mean.mat is a matrix that stored the expression level of the target gene with different kT under different parameter settings that are set in step 2d. exp_CV.mat is a three-dimensional array that stored the expression noise (CV) of the target gene with different kT under different parameter settings contributed by different reactions. The first component of the third dimension of the array represents the total noise contributed by all reactions. All the other components of the third dimension of the array represent the noise contributed by a single reaction, following the order shown in Figure 2[href=https://www.wicell.org#fig2].\nOpen and run plot_noise.m to visualize the results stored in the file exp_mean.mat and exp_CV.mat.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1459-Fig2.jpg\nFigure 2. The definition of parameters for simulation\nThe number represent the order of reactions for calculating their contributions in step 3. Reactions employed in each miRNA regulation model are shown. Types of all components and reactions are shown with different colors, shapes and line types.\nTransient transfection of HeLa cells\nTiming: 2 days\nHere we will introduce how to transfect Hela cells with three plasmids. The first plasmid can express two fluorescent proteins, mKate2 and EYFP, driven by a bidirectional promoter, which can be activated by binding of reverse tetracycline-controlled transactivator (rtTA) in the existence of doxycycline (Figure 1[href=https://www.wicell.org#fig1]). The second plasmid can express rtTA constantly. The third plasmid does not encode any proteins and is used as a blank plasmid to increase transfection efficiency and reduce variation of plasmid transfection. miRNAs that can bind to 3′UTR of EYFP are endogenous.",
    "Plasmids should be transfected into cells for further noise observation and quantification. Here we transfect HeLa cells via Lipofectamine LTX with PLUS Reagent according to the manufacturer’s manual protocol[href=https://assets.thermofisher.com/TFS-Assets/LSG/manuals/LipofectamineLTX_PLUS_Reag_protocol.pdf] with the cell density, amount of DNA and the reagents specified specifically for Hela cells transfected in 12-well plates compared to the manual (see next steps for details).\nCulture the cell lines into 12-well plates that you are interested in on the day before transfection with a proper density. The density of HeLa cells should be around 1.6 × 105 cells/mL. The culture medium of HeLa cells is Dulbecco's Modified Eagle Medium (DMEM) with 10% Fetal Bovine Serum (FBS), 1% MEM Non-Essential Amino Acids Solution (NEAA) and 1% Penicillin-Streptomycin. The total volume of the medium per well is 1 mL.\nAbout 24 h later, make sure that the density of cells is around 70%.\nFor each well, Dilute 2 μL Lipofectamine® LTX Reagent in 50 μL serum-free DMEM.\nFor each well, add 40 ng of the plasmids carrying the dual-fluorescent reporter, 40 ng of the plasmids carrying the rtTA gene and 420 ng of blank plasmids with no protein-coding sequences (for example, pDT7004 from (Li et al., 2015[href=https://www.wicell.org#bib4])) into 50 μL serum-free DMEM, and then add 1 μL PLUSTM Reagent.\nMixed the reagents prepared in step 7 and 8.\nIncubate for 5 min at 20°C–25°C.\nChanged the medium of cells in the 12-well plates with 900 μL media, and then add 100 μL mixture prepared in step 9 to cells.\nAdd doxycycline to the medium with a final concentration of 1 μg/mL after adding the mixed reagents immediately.\nChange the medium one day after transfection. Do not forget to add doxycycline into the medium again with the same concentration described in step 12.",
    "Note: Make sure that the order of adding the reagents is strictly the same as the manufacturer’s manual, which means that do not add the PLUSTM Reagent first to the medium and then add plasmids sequentially, because adding the PLUSTM Reagent first will decrease the co-transfection efficiency of the plasmids.\nNote: It is important to add the blank plasmid with no protein-coding sequence. This procedure could supplement the total amount of the plasmid to enhance the transfection efficiency and reduce the variation of transfection. The amount of the plasmids could be adjusted to ensure a high transfection efficiency. For example, when the transfection efficiency is low, try to improve the relatively amount of the plasmids that express the reporter and rtTA in the total 500 ng plasmids (e.g., 80 ng of the plasmid that express the reporter + 80 ng of the plasmid that express rtTA + 340 ng of the blank plasmid per well).\nFlow cytometry\nTiming: 4 h\nThe fluorescent intensity of cells can be observed by flow cytometry two days after transfection.\nDigest cells from the 12-well plates using trypsin-EDTA (200 μL for each well, 3 min), and then stop the reaction using 300 μL culture medium described in step 5.\nCentrifuge cells at 300 g for 5 min, wash cells using 500 μL phosphate buffered saline (PBS).\nRepeat step 15.\nResuspend cells with PBS and transfer the cells into separate FACS tubes.\nDetect fluorescent intensities of cells using flow cytometry machines and record no fewer than 105 singlets.\nExport all records with the fcs format.",
    "Note: The type of flow cytometer is flexible and the settings may need to be altered according to the equipment. We do not recommend using the high-throughput screening (HTS) way of flow cytometry to perform these procedures. When using HTS, the cells can hardly be mixed well and may cause poor data quality or damage the flow cytometry machine.\nNote: Make sure cells have been washed twice before running in the flow cytometry machine. If the medium is not washed thoroughly, cells may clump together such that the machine may be blocked by the clumped cells and bubbles can be generated, making the measurement of fluorescent intensity unreliable.\nNote: Vortex cells to avoid clumped cells right before running samples in the flow cytometry machine.\nNote: If the recording speed showing in the flow cytometry machine is too high (> 3,000 total events per second), dilute cells properly to make sure around 2,000 total events are recorded per second at the high-speed mode of the machine. Otherwise, too many cells might block the machine and generate bubbles in the machine.\nData analysis of flow cytometry\nTiming: 1 h\nGate living cells according to the forward scatter (FSC) and side scatter (SSC) value from the flow cytometry data via data analysis software. Save the fluorescent intensity values of these cells in a csv file. For instance, when analyzing the data by Floreada.io, press File/Open File(s) to import fcs files, gate living cells with FSC-A/SSC-A, FSC-H/FSC-W, SSC-H/SSC-W sequentially, and then store the data by pressing File/Save CSV Event File. Arrange all csv files into a folder named data in the same folder with analysis.r.",
    "Run analysis.r to analyze all files in the folder data. For instance, when using Terminal, first direct the working directory to the working folder where the file analysis.r and the folder data are, and then execute\n> Rscript analysis.r\nWhen using RStudio, set the working folder as the working path and then execute analysis.r. The results will be stored in a folder named result."
  ],
  "subjectAreas": [
    "Bioinformatics",
    "Systems Biology",
    "Computer Sciences",
    "Flow Cytometry",
    "Molecular Biology",
    "Gene Expression"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology"
  ]
}