{
  "id": 19635,
  "origin_website": "Jove",
  "title": "How to Calculate and Validate Inter-brain Synchronization in a fNIRS Hyperscanning Study",
  "procedures": [
    "The protocol presented here was approved by the University Committee on Human Research Protection of East China Normal University.\n1. Preparation for the experiment\nParticipants\n\t\nRecruit a group of undergraduate and graduate students with monetary compensation by the campus advertising.\nEnsure that the participants are right-handed and have normal or corrected-to-normal vision and hearing. Ensure that they have not studied music or have studied it for fewer than 3 years before.\nRandomly match the students in dyads. To control the potential effect of partner familiarity on social coordination18, ensure that the members of each dyad have not seen or known each other before.\nExperimental stimulus\n\t\nCreate the auditory stimuli (440 Hz, 660 ms pure tones) by any free music composition and notation software.\nRepeat the tones with an interval of 500-1000 ms and combine them into a tone sequence. Each tone sequence is 12 s longer and composed of 12 tones.\nFor one tone sequence, accent every first tone (+6 dB) to create the pattern of downbeats and upbeats, defined as the meter stimulus (Supplementary Audio 1). In the second tone sequence, unaccent the tones with equal intensity (40 dB above individual sensation threshold, collected before the experiment task), which corresponded to the non-meter stimulus (Supplementary Audio 2).\nExperimental task\n\t\nProgram the experimental task by using a psychological software tool.\nArrange two stages for the experimental task (Figure 1A) as described in steps 1.3.3-1.3.6.\nsecond resting state: Ask participants to remain as motionless as possible with their minds relaxed and eyes closed.\nFinger tapping task: Request the participants to complete two parts: a coordination part and an independence part.",
    "During the coordination part, provide auditory feedback (i.e., a drip sound corresponding to one tap) to each participant only for the response generated by the other member of the dyad. Ask the participants to try their best to respond synchronously with the other member.\nFor the independence part, ensure both participants received the auditory feedback (i.e., a drip sound corresponding to one tap) of their own responses and ask them to respond synchronously with the auditory stimulus as precisely as possible.\n\t\tNOTE: Combined with the meter and non-meter stimuli, participants found themselves in one of four different conditions: (i) meter coordination - both participants heard meters, and the responses from each other; (ii) non-meter coordination - both participants heard non-meters and the responses from each other; (iii) meter independence - both participants heard meters and the responses from themselves; (iv) non-meter independence - both participants heard non-meters and the responses from themselves.\nFor each trial, let the participants first hear a piece of the auditory stimulus (12 s) followed by a sound (262 Hz, 1000 ms) that serves as a cue to start to tap the finger.\nAsk the participants to reproduce the stimulus they heard before by tapping their right index finger on the keyboard (participant #1: \"f\"; participant #2: \"j\"). Participants must tap 12 times while keeping the same time interval between tones as the previously presented stimulus.\n\t\tNOTE: There were 60 trials assigned equally in 4 blocks corresponding to the 4 experimental conditions, namely 15 trials in one block. The order of the blocks was counterbalanced. The total duration of the tapping task was about 26 min.\nBetween blocks, let the participants rest for 30 s.",
    "During the whole experiment, do not allow the participants to communicate through any language or movement. Separate the participants with the computer monitor to block any visual information that might deliver messages between them.\nHomemade fNIRS caps: Buy two elastic swimming caps of normal size. To cover the brain region of interest, mend the swimming caps as described in the following steps:\n\t\nPut one swimming cap on a headform, and then put a standard 10-20 EEG cap on the swimming cap.\nMark the location of FCz on the swimming cap with a red magic marker.\nTake off the EEG cap from the headform.\nPut one optode probe patch (3 x 5 setup) on the swimming cap, aligning the middle one of the second probe row of the patch with the marked location of FCz.\n\t\tNOTE: The optode probe patch included 15 locations of optode probes (i.e., 8 emitters and 7 detectors), forming 22 measurement channels with 3 cm optode separation (Figure 1B).\nMark the locations of the 15 probes of the patch on the swimming cap.\nTake off the patch and the swimming cap from the headform.\nCut 15 small holes on the marked locations of the 15 probes with a pair of scissors.\nMount the patch to the modified swimming cap by embedding the locations of 15 probes into the appropriate 15 holes.\nMend the other swimming cap according to the above process.\n\t\tNOTE: The Homemade fNIRS cap, in which the locations of optodes are as per the standard EEG locations, were employed as there were no applicable standard EEG caps for the fNIRS system used in this study. There is no need to make an fNIRS cap if there are suitable standard EEG caps with the fNIRS system.\n2. Before participants arrive",
    "NOTE: Ensure to follow steps 2.1-2.5 before participants arrive at the laboratory.\nRemind the two participants of one dyad to come to the laboratory per the agreed time schedule.\nStart the fNIRS system at least 30 min in advance, leaving the laser turned off.\nInsert the optode probes from the fNIRS system into the optode probe patches.\nExamine the parameters of fNIRS measurement (i.e., subject ID, the event-related mode, the optode probe arrangement).\nSet the experimental apparatus with one table, two chairs, two 19-in computer monitors, and two pairs of headphones (Figure 1C).\n3. Participant arrival in the laboratory\nNOTE: Sincerely appreciate the two participants of one dyad when they arrive at the fNIRS lab. Request them to put their phone on silent mode and temporarily leave their personal belongings in the cabinet. Then conduct the following processes in sequence:\nBefore the participants sit down, reconfirm that the two participants have not seen each other before. Ensure that they did not communicate with each other through any language or movement while in the lab.\nProvide the participants with informed consent forms approved by the University Committee on Human Research.\nInstruct the participants on the details of the experimental task. Ask them to wear headphones and give them several practicing trials.\nIn the practice trials, allow the two participants of each dyad to practice together.",
    "NOTE: Before wearing the fNIRS cap, it is worthwhile to measure and determine the head size for each participant by using a flexible rule. Then select the right size cap for the participant according to his/her head size. In this study, such a step was missed as one-size swimming caps were used. It is better to conduct this step on the day before the experiment because the relative operations (i.e., measuring head size, selecting the right size swimming cap, mounting the optode probe patches to the swimming cap, and inserting the optode probes into the probe patches) are time-consuming (about 20-30 min).\nPut the fNIRS cap on the head of participants with the center of the cap pointing at the location of CZ, and place the middle optode probe of the second probe row of the patch at FCz.\nOperate the fNIRS system to perform the signal calibration with the laser turned on.\nIf there is an insufficient signal at some channel, adjust the signal intensity with a fiber stick to gently put the hair underneath the surrounding probe tip aside.\nIf necessary, press the probes gently but ensure not to hurt the participants.\nRepeat steps 3.5-3.8 until the quality of the signal is accessible. Make sure that participants feel comfortable during the whole process of signal calibration.\nHelp the participants to find a comfortable posture for themselves (e.g., comfortable body positions). Remind the participants to keep their heads as motionless as possible during the whole experimental task (i.e., about 26 min).\nExamine the quality of NIRS signals again. If there are sufficient signals in all channels, run the experiment procedure on the desktop computer.",
    "Help the participants take off the headphones and fNIRS cap on completion of the experimental procedure. Return their personal belongings and thank them with monetary compensation.\nOperate the fNIRS system to save data. Use a disc to export raw fNIRS data (.csv) and use a USB to copy the behavioral data from the computer.\nClose the fNIRS system and the computer if no more experimental arrangement.\nKeep the lab notebook ready to note down any events, especially abnormalities during the whole experiment.\n4. Data analysis\nNOTE: Perform all data analysis by using MATLAB software, with the following toolboxes: HOMER219, Hitachi2nirs20, xjView21, Cross Wavelet and Wavelet Coherence toolbox22, and Groppe's scripts in MathWork23.\nData preprocessing\n\t\nTo check the data quality, follow steps 4.1.2-4.1.3\nRead the data files (.csv) for each participant with the readHitachData function of xjView.\n\t\tNOTE: In this way, the Hitachi measurement data (csv format) is converted into oxyHb/deoxyHb/marker data with the information saved in the measurement (i.e., wavelength, timedata, and channel list).\nVisually check the quality in oxyHb and deoxyHb values by plotting all channels' time series in one figure, with the function plotTraces of xjView.\n\t\tNOTE: It is easy to identify abnormalities in the data. The channel that has much noise can be excluded in subsequent analysis.\nConvert Hitachi files (.csv) to .nirs files format with the csv2nirs function of Hitachi2nirs, which supports further data preprocessing with Homer2.\nTransform the raw data to optical density with the function hmrIntensity2OD of Homer2.\nUse principal component analyses (PCA)24 to remove the fNIRS global physiological noise by using the function enPCAFilter (nSV = 0.8, that is 80% of the covariance of the data was removed) of Homer2.\nUse correlation-based signal improvement method (CBSI)25 to remove head motion artifacts using the function hmrMotionCorrect_Cbsi of Homer2.",
    "Use modified Beer-Lembert law to transform the processed optical density into oxyHb and deoxyHb values with the hmrOD2Conc function of Homer2.\nCalculating IBS\n\tNOTE: For the preprocessed oxyHb values, use WTC to calculate the coherence values for the channel pair that are from the same location of the dyad, including the following pipeline:\n\t\nAdopt the wtc function of Cross Wavelet and Wavelet Coherence toolbox with default parameters to compute the coherence values at each time and frequency point to obtain a two-axis matrix of coherence values.\nFor the default parameters, use morlet mother wavelet, to transform each time series into the time and frequency domain by the continuous wavelet transformation.\nSelect MonteCarloCount to represent the number of surrogate data sets in the significance calculation, and select Auto AR1 to calculate the autocorrelation coefficients of the time series.\nChoose frequency band of interest (FOI) as mentioned in steps 4.2.5-4.2.8.\nSelect and average the coherence values of the frequency band between 0.5-1 Hz (respectively corresponding to period 2 s and 1 s), according to the frequency band used in the finger-motion task of a previous fNIRS hyperscanning study9. Such FOI also corresponded to the period of one tap in the experimental task. Thus, obtain one column of coherence values for each pair.\n\t\tNOTE: To further statistically confirm FOI, calculate the coherence values for each dyad across the full frequency range (i.e., 0.008-10 Hz for the data), rather than just confining the selected frequency band (i.e., 0.5-1 Hz).\nAverage the coherence values of the targeted time windows (same as 4.2.3) for each frequency point.\nNext, analyze the average coherence values following the pipeline described in steps 4.2.9-4.2.11 and subsequent statistics (i.e., 4.3.1 - 4.3.2) for each frequency point.\nLast, visually inspect FOI by plotting the statistical z values of each channel across frequency.",
    "Select and average the coherence values of the time window during the resting state (time window for 20 s-resting-state) and each experimental condition (i.e., meter coordination, non-meter coordination, meter independence, and non-meter independence), respectively, using the information of mark. Thus, obtain five coherence values for each dyad.\nFor the task session, only select the duration during which participants tapped to reproduce the auditory stimulus, about 12 s for each trial, thus total 180 s (i.e., 12 s x 15 trials) for each experimental condition.\n\t\tNOTE: IBS was calculated as coherence increase (the larger subtracted coherence values than zero), namely the larger coherence values in the task session compared to those in the resting-state session.\nSubtract the resting coherence value from the task-related coherence value, respectively, in which the coherence value during the resting-state was used as a baseline in this experiment.\n\t\tNOTE: By repeating the above steps (4.2.1-4.2.11) across channels (i.e., 22 channels) and dyads (i.e., 16 dyads), the subtracted coherence values for each dyad at each channel were obtained finally.\nStatistics\n\t\nCompare the subtracted coherence values with zero at each channel for each experimental condition, using the paired samples permutation t-test with the mult_comp_perm_t1 function of Groppe's work (5000 permutations to estimate the distribution of the null hypothesis; desired family-wise alpha level- 0.05; two-tailed test, which means the alternative hypothesis is that the mean of the data is different from 0) as abnormal data distribution and limited sample size in the current experiment26.",
    "NOTE: The paired samples permutation t-test here is similar to paired t-test, but the latter assumes that the data is normally distributed, whereas the former does not. Such test begins the same way as paired t-test, that is, by computing a t score (i.e., real t score) for the coherence values in different groups (one is the subtracted coherence values in the task condition, the other is zeros). Then, a permutation is generated by exchanging the coherence values of different groups, and a new t score is calculated for the subtracted coherence values and zeros following this permutation. Such permutation is conducted 5000 times. Thus, 5000 t scores are obtained. In the distribution of the 5000 t scores, the relative location of the real t score generates the p-value for the subtracted coherence values.\nCorrect the p values (i.e., due to the multiple comparison problem, and generate from the comparisons across 22 channels in one patch) by False Discovery Rate method (p < 0.05)27. Perform this correction via the mafdr function of MATLAB toolbox.\n\t\tNOTE: If the p-value at any channel was significant (i.e., p < 0.05) after FDR correction, there is IBS at that channel.\nCompare the coherence values between different task conditions at the channel where IBS existed, using the paired samples permutation t-test with the mult_comp_perm_t1 function of Groppe's work (same parameters as mentioned in step 4.3.1).\n\t\tNOTE: To intuitively examine the IBS during interpersonal coordination regarding meter vs. non-meter stimuli, compare the coherence values of different conditions directly (i.e., meter coordination vs. non-meter coordination; meter coordination vs. meter independence).\nCalculate the behavioral performance by the absolute difference between the partners' response time divided by the sum of both partners' responses56.",
    "Evaluate the relationship between the IBS and behavioral performance through the permutation test based on Pearson linear correlation analysis (i.e., the mult_comp_perm_corr function of Groppe's work).\nValidating IBS\n\tNOTE: To exclude the explanations that similar stimuli, motions, or conditions induced the demonstrated IBS, use a permutation test as a validation approach, with three permutations (i.e., within the dyad, between dyad, and between condition permutations), included the followings:\n\t\nRandomize the label of trials in the meter coordination condition (i.e., within dyad permutation, such as trial #1 and trial #13 in dyad #1) for one dyad at each channel via the randperm function of MATLAB.\nFollow the above pipeline of calculating IBS and statistics (i.e., sections 4.2 and 4.3, but excluding the sensitivity analysis for FOI) for the randomized trial label.\n\t\tNOTE: Calculate coherence values of the fake pair for each condition separately, and compute coherence increase for the fake pair (i.e., subtract the resting coherence value from the task-related coherence value for the fake pair).\nConduct the permutation 1000 times, followed by the pipeline of calculating IBS and statistics (sections 4.2 and 4.3).\nPlot the distribution of statistical z values generated within dyad permutation.\nConduct steps 4.4.2-4.4.4 by randomizing pairing of the participants of the same trial in the meter coordination condition (i.e., between dyad permutation, such as participant #1 in dyad #1 and participant #1 in dyad #3).\nConduct steps 4.4.2-4.4.4 by randomizing the label of conditions for the same members of one dyad in the same trial (i.e., between condition permutation, such as participant #1 in the meter coordination condition and participant #2 in the meter independence condition).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}