{
  "id": 10328,
  "origin_website": "Jove",
  "title": "Preparation of Mesh-Shaped Engineered Cardiac Tissues Derived from Human iPS Cells for In Vivo Myocardial Repair",
  "procedures": [
    "1. Maintenance of hiPSCs and cardiovascular differentiation\nExpand and maintain hiPSCs on thin-coat basement membrane matrix (growth factor reduced, 1:60 dilution) in conditioned medium extracted from mouse embryonic fibroblasts (MEF-CM) with human basic fibroblast growth factor (hbFGF)4.\n\tNOTE: We used a hiPSCs (4-factor (Oct3/4, Sox2, Klf4 and c-Myc) line: 201B6). Add hbFGF at the appropriate concentration for each cell line. Laminin-511 fragment can also be used for the coating of culture dish instead of basement membrane matrix. Commercially available medium designed for feeder-free culture of hiPSCs can be used as a substitute for MEF-CM.\nUse Versene (0.48 mM ethylenediaminetetraacetic acid (EDTA) solution) to detach and dissociate cells when cell confluency reaches 90‒100%.\n\tNOTE: Other commercially available products for cell dissociation can also be used.\nPlate cells at a density of 10,000 cells/mm2 on matrix-coated cell culture plates in MEF-CM with hbFGF and culture for two to three days.\nWhen the culture becomes fully confluent, cover the cells with matrix (1:60 dilution with MEF-CM) for one day.\nReplace the MEF-CM with RPMI 1640 + B27 medium. Add 100 ng/mL of Activin A and 100 ng/mL of Wnt3A to the medium for one day.\n\tNOTE: This is day 0 of differentiation. To upregulate canonical Wnt signaling, GSK3β inhibitors can also be used instead of Wnt3A.\nOn day 1 of differentiation, change the medium to new RPMI 1640 + B27 with 10 ng/mL of BMP4 and 10 ng/mL of hbFGF. Culture cells for two (MC protocol) or four (CM+EC protocol) days without medium change5.\n\tNOTE: CM+EC protocol is optimized to simultaneously induce cardiomyocytes (CMs) and vascular endothelial cells (ECs). MC protocol is optimized to preferentially induce vascular mural cells (MCs).\nCM+EC protocol for the induction of CMs and ECs (Figure 1A).",
    "Replace the medium on day 5 of differentiation with RPMI 1640 + B27 supplemented with 50 ng/mL of VEGF165.\nChange the culture medium every 48 h until day 13‒15 of differentiation.\nMC protocol for the induction of vascular mural cells (Figure 1B)\n\t\nReplace the medium with RPMI1640 + 10% fetal bovine serum (FBS) at day 3 of differentiation.\nChange the culture medium every 48 h until day 13‒15 of differentiation.\n2. Cell harvest and lineage analysis on differentiation day 13‒15\nWash the cells with Ca2+ and Mg2+ free phosphate-buffered saline (PBS).\nAdd cell dissociation solution (containing proteases, collagenases and DNAses) in the cell culture dish to cover the plate. Incubate the plate for 5 min at 37 °C.\nCollect and dissociate the cells with culture medium using a pipette after incubation.\nAllocate 1 x 106 cells for lineage analysis with flow cytometry. To eliminate dead cells, stain the cells with fixable viability dye.\nStain the cells with membrane surface markers in PBS with 5% FBS. Use the following dilutions of antibody in fluorescence activated cell sorting (FACS) staining buffer: anti-PDGFRβ (1:100), anti-VE cadherin (1:100), anti-TRA-1-60 (1:20).\nFor intracellular proteins, resuspend and fix the cells with 4% paraformaldehyde (PFA) in PBS.\nStain the cells with anti-cardiac isoform of Troponin T (cTnT) in PBS with 5% FBS and 0.75% Saponin, then label the cTnT antibody with 488 mouse IgG1 (dilution 1:50).\nResuspend the stained cells in PBS with 5% FBS and put them in FACS tubes with cell strainer.\nAnalyze the cell composition of the stained cells from each differentiation protocol with flow cytometry to facilitate the generation of cell suspensions with defined lineage distributions.\n\tNOTE: While performing this procedure, the remaining cell suspension for ECTs is preserved in a 4 °C refrigerator.\n3. Fabrication of PDMS tissue mold",
    "Cast a 0.5 mm thick and over 30 mm x 30 mm layer of polydimethylsiloxane (PDMS) by mixing the prepolymer and cross-linking solution at a ratio of 10:1 and then cure at 80 °C for 3 h.\nCut the PDMS sheet and bond it with silicone adhesive to fabricate a 21 mm x 20.5 mm rectangular tray with 7 mm long, 0.5 mm wide, and 2.5 mm high rectangular posts at a staggered position. Horizontal post spacing between two lines of posts is 2.5 mm (Figure 2B).\nAutoclave the tray at 120 °C for 20 min.\nCoat the tray with 1% poloxamer 407 in PBS for 1 h. Rinse the poloxamer 407 and rinse the mold with PBS sufficiently prior to use.\n4. ECT construction\nAfter the cell lineage analysis, combine the cells from CM+EC and MC protocols so that the final concentration of MCs is 10 to 20% in a total cell number of six million cells per construct5.\nSuspend mixed six million cells in ECT culture medium (alpha minimum essential medium supplemented with 10% FBS, 50 µM 2-mercaptoethanol and 100 U/mL Penicillin-Streptomycin).\nPreparation of matrix solution\n\t\nMix 133 µL of acid-soluble rat tail collagen type I solution (2 mg/mL, pH 3) with 17 µL of 10x minimum essential medium (MEM). Then mix the solution with 17 µL of alkali buffer (0.2 M NaHCO3, 0.2 M HEPES, and 0.1 M NaOH).\n\t\tNOTE: Collagen must be kept on ice (4 °C). Check buffer color and if the medium does not become pinkish when all solutions are mixed, add additional alkali buffer to the medium. The mixing steps must be mix collagen I + 10x MEM, and then add alkali buffer. DO NOT change this order. Do NOT generate bubbles in the mix.",
    "Add 67 µL of basement membrane matrix to the neutralized collagen solution.\n\t\tNOTE: The mixed solution must be kept on ice (4 °C).\nCentrifuge the prepared cell suspension containing six million cells at 1,100 rpm (240 x g) for 5 min and resuspend the cells with 167 µL of high-glucose DMEM + 20% FBS + 1% penicillin-streptomycin (100x).\nMix the cell suspension and the matrix solution. The total volume of cell/matrix mixture for one construct is 400 μL.\n\tNOTE: The cell/matrix mixture should be non-viscous and a pinkish color at this step. Keep it on ice as the gel will solidify at room temperature. The final concentration of collagen type I is 0.67 mg/mL.\nPour the cell/matrix mixture evenly over the poloxamer 407 coated PDMS tissue mold, which is placed in a six-well culture plate12.\n\tNOTE: Pour the mixture carefully to avoid generating bubbles in order to prevent filling defects in the poured gel.\nIncubate the cell/matrix mixture in a standard CO2 incubator (37C, 5 % CO2) for 60 min.\nAfter the tissue is formed, soak the tissue mold with 4 mL of ECT culture medium.\n\tNOTE: Although the cell/matrix is crosslinked in 60 min, the construct is still very fragile. Add medium gently to avoid damaging it.\nCulture the tissue for 14 days with medium change every day.\nPrior to ECT implantation, remove the ECT from the loading posts gently using sterilized fine forceps.",
    "NOTE: The final ECT dimensions after removal from the mold are less than the original mold. A 2.1 cm x 2.05 cm mold generates a released ECT of approximately 1.5 cm x 1.5 cm. A larger 3.9 cm x 4.05 cm mold generates an ECT of approximately 3 cm x 3 cm. Unloaded ECT shows intrinsic spontaneous beating in warm culture medium. Although it initially maintains a mesh structure, an unloaded ECT shrinks and condenses over time. It is possible to hold the tissue softly with fine forceps and then use 7-0 silk suture to attach the ECT to the epicardium.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}