{
  "id": 18239,
  "origin_website": "Jove",
  "title": "Generation of a Chronic Obstructive Pulmonary Disease Model in Mice by Repeated Ozone Exposure",
  "procedures": [
    "NOTE: The OE model has been generated and used in previously reported research30,31,32. All animal experiments were approved by the Institutional Animal Care and Use Committee (IACUC) of Shanghai Jiaotong University.\n1. Mice\nHouse pathogen-free, 7- to 9-week-old female BALB/c mice in individual ventilated cages in an animal facility under controlled temperature (20 °C) and humidity (40 - 60%). Provide a 12 h light and 12 h dark cycle in the facility. Provide food and water ad libitum.\n2. Ozone or Air Exposure\nGenerate ozone with an electric generator in a sealing acrylic (e.g. Perspex) box. Blow the air out of the box using a small air blower through an air vent pipe that is connected on the inside and outside of the box. Monitor the concentration of ozone in the box using an ozone probe. Wait until the concentration of ozone in the box reaches 2.5 parts per million (ppm).\n\tNOTE: The ozone probe can automatically switch the ozone generator on or off and can maintain the ozone level in the box at 2.5 ppm.\nPlace the mice into the box when the level of ozone reaches 2.5 ppm. Keep the mice in the box for 3 h each time to expose them to ozone.\n\tNOTE: The box can maintain an ozone level of 2.5 ppm during the 3 h by automatically switching the ozone generator on or off and blowing the CO2 that is produced by the mice out of the box.\nGive two ozone exposures (each exposure lasting 3 h) per week (once every 3 days) for 7 weeks; expose the control mice to air at the same time and for the same period.\n3. Micro-computed Tomography",
    "At the end of week 7, anesthetize the mice with an intraperitoneal injection of pelltobarbitalum natricum (1%, 0.6 - 0.8 ml/100 g) adjust the dose according to individual situations to see that the mouse does not respond to a toe pinch. Monitor and keep the mouse at a steady breathing frequency; and make sure no voluntary motions exist during the procedures.\nPlace the anesthetized mice in the chamber of a micro-computed tomography (µCT).\nCalibrate the µCT using the standard protocol and the manufacturer's instructions. Set the X-ray tube at 50 kV and the current at 450 µA.\n\tNOTE: Both the X-ray and the detector rotate around the mice.\nPerform the µCT analysis by acquiring 515 projections with an effective pixel size of 0.092 mm, an exposure time of 300 ms for one slice, and a slice thickness of 0.093 mm.\nReconstruct the lung with the acquired images using a software. Adjust the grayscale image brightness by setting the minimum and maximum of the grayscale at -750 and -550 Hounsfield units, respectively.\n\tNOTE: The software will automatically calculate the volumes of the lung parenchyma and the low-attenuation area (LAA)34,35.\nCalculate the percentage of LAA (LAA%) by dividing the LAA volume by the total lung volume.\n4. Treadmill Test\nGive the mice an adaptation test at a speed of 10 m/min for 10 min on a running treadmill machine.  Note: The electricity is always off when the procedure is being conducted. \nAdminister a fatigue test to the mice.\n\t\nWarm up the mice at a speed of 10 m/min for 5 min.\nIncrease the speed to 15 m/min for 10 min.\nIncrease the exercise intensity: increasing the speed by 5 m/min, starting at 20 m/min, every 30 min until mice cannot continue to run36.",
    "Record the total running distance and running time as fatigue distance and fatigue time, respectively.\n5. Pulmonary Function Measurements\nAnesthetize the mice with an intraperitoneal injection of pelltobarbitalum natricum (1%, 0.6 - 0.8 ml/100 g) adjust the dose according to individual situations to see that the mouse does not respond to a toe pinch and wait until the mice have maintained spontaneous breathing. Monitor and keep the mouse at a steady breathing frequency; and make sure no voluntary motions exist during the procedures.\nCarefully tracheostomize the mice and place them in a body plethysmograph that is connected to a computer-controlled ventilator.\n\tNOTE: Ventilation is controlled via a valve located proximally to the endotracheal tube. The setup provides different semi-automatic maneuvers, including the maneuver of the quasi-static pressure volume and the maneuver of the fast flow volume.\nImpose an average breathing frequency of 150 breaths/min to the anesthetized mouse via pressure-controlled ventilation until a regular breathing pattern and complete expiration at each breathing cycle is obtained.\nPerform the quasi-static pressure-volume maneuver with the device by using the negative pressures generated in the plethysmograph.\nPerform the fast flow volume maneuver within the quasi-static pressure-volume loops to record the FVC and the FEV. Inflate the lung to +30 cm H2O and immediately afterwards connect it to a highly negative pressure to enforce expiration until the residual volume is at -30 cm H2O. Record the FEV in the first 25, 50, and 75 ms of exhalation (FEV25, FEV50, and FEV75, respectively). Reject the suboptimal maneuvers. For each test with every single mouse, conduct a minimum of three acceptable maneuvers to obtain a reliable mean for all numerical parameters.\n6. BALF Collection",
    "Following terminal anesthesia with pelltobarbitalum natricum ((1%, 1.8-2.4 ml/100 g) adjust the dose according to individual situations to see that the mouse does not respond to a toe pinch and lose breath), lavage the mice with 2 mL of PBS via a 1 mm-diameter endotracheal tube and then retrieve the BALF10.\nPool the retrieved lavage aliquots and centrifuge them at 4 °C and 250 x g for 10 min.\nCollect the supernatant for immediate use and store the remainder at -80 °C or liquid nitrogen.\nCount the total number of cells using a hemocytometer.\nResuspend the cell pellet in PBS and then spin (1,400 x g, 6 min) 250 µL of resuspended cells onto slides using a slide spinner centrifuge.\nApply Wright staining to cells on the slides according to the manufacturer's protocol.\nCount 200 cells per mouse; identify the cells as macrophages or neutrophils, according to standard morphology, under 400X magnification; and count their numbers.\n7. Cardiac Blood Sampling\nCollect blood via cardiac puncture, load it into 1.5-mL tubes, and keep it on ice for 30 min.\nCentrifuge the blood samples for 5 min at 2,000 x g and 4 °C.\nTransfer the supernatant (serum) to a new tube and store it at -80 °C or liquid nitrogen.\nPrepare the serum for IL-1β, IL-10, and TNF-α detection tests using the respective ELISA kits.\n8. Lung Morphometric Analysis\nDissect the lungs and tracheas from the mice.\n\t\nPosition each euthanized mouse onto a surgical board immediately after sacrifice.\nDissect away the platysma and anterior tracheal muscles to visualize and access the tracheal rings.\nOpen up the thoracic cavity. Dissect the lungs and the trachea, but do not separate the heart from the lungs.\nConnect the endotracheal catheter to a syringe containing 4% paraformaldehyde through a PE90 polyethylene tube.",
    "Caution: Paraformaldehyde is toxic. Wear gloves and safety glasses and use the solution inside a fume hood.\nInflate the lung completely using 4% paraformaldehyde (10 drops, ~200 µL) through the endotracheal catheter. Remove the heart after the completion of inflation.\nMaintain the lung in a 15 mL tube containing 10 mL of 4% paraformaldehyde for at least 4 h.\nEmbed the lung in paraffin. Obtain 5-µm sections by paraffin block sectioning with a rotary microtome. During the sectioning, expose the maximum surface area of lung tissue within the bronchial tree area.\nFor morphometric analysis, perform hematoxylin and eosin (H&E) staining on the sections.\nImage the sections with a bright-field upright microscope (objective lens, 20X; exposure time, 1.667 ms).\nHave two investigators blinded to the treatment protocol independently count the histological sections. Use the mean linear intercept (Lm) as a parameter for measuring the distance of the inter-alveolar septal wall. Determine the Lm using the following steps:\n\t\nOpen the images of the sections in Photoshop and draw a reticule-grid on the image with five 550 µm long lines.\nCount the number of alveoli across the grid line.\nCalculate the Lm by dividing the length of the grid line by the number of alveoli. For quantification, image five sections per mouse. Acquire ten images of each section (one image per field) and assess randomly. During field selection, avoid fields of airways and vessels by moving one field ahead or in another direction.\n\t\tNote: The data are presented as the mean ± S.E.M. An un-paired t-test was carried out for comparison between air-exposed mice and ozone-exposed mice. Three animals of each group were used to calculate the significant difference. A p-value of <0.05 was considered significant.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}