{
  "id": 9640,
  "origin_website": "Jove",
  "title": "DiI-Labeling of DRG Neurons to Study Axonal Branching in a Whole Mount Preparation of Mouse Embryonic Spinal Cord",
  "procedures": [
    "1. Dissection procedure\nNote: Experimental use of mice should follow officially approved guidelines for the care and use of laboratory animals.\nBefore preparation, set up your dissecting microscope and lay out the surgical instruments needed for dissection including large and small scissors, large toothed forceps, curved forceps and four sets of Dumont No.5 dissecting forceps (two of which have inside-polished tips) (for details see the table of specific reagents and equipment). Place a sheet of filter paper in a 100-mm Sylgard-coated Petri dish. Pour cold PBS in the wells of a 12-well plate, a 100-mm petri dish and a 12-ml tube and leave on ice. Pipette 2ml of fixation buffer (4% paraformaldehyde in PBS, pH 7.4) in each well of a second 12-well plate and place on ice.\nAfter anesthetization, sacrifice the timed pregnant dam at E12.5 (detection of vaginal plug was designated as E0.5), place the mouse with its ventral side up on three sheets of paper towels and soak the abdominal area with 70% ethanol.\nOpen the abdominopelvic cavity, isolate the bilateral uterine horns and transfer them into one of the 100-mm dishes with ice-cold PBS.\nUnder microscopic control, make a longitudinal incision of the uterine wall with small, straight scissors and cut away each amniotic sac from the placenta.\nPeel away the amniotic sac from each embryo and cut the umbilical cord.\nUsing small scissors, decapitate the embryos and put the heads or a part of them aside for the isolation of genomic DNA if genotyping should be required. Subsequently, transfer the torsi to the respective wells of the 12-well plate with cold PBS.",
    "Wet the filter paper in the Sylgard dish with a few drops of PBS and position an embryonic torso with its dorsal side up on the paper. For better stability, straighten its tail and extremities away from the body.\nWorking under a dissecting microscope with a magnification of approximately 16x, carefully pinch the skin of the embryo above the spinal cord with two pairs of fine tipped forceps and gently tear it apart. Beginning in the middle, proceed first towards the tail and then resuming from the middle towards the anterior side.\nWet the embryo from time to time with two or three drops of PBS to prevent it from drying.\nTo prevent that DRG are teared off from the spinal cord when it is removed from the embryo detach the DRG and the spinal cord from the surrounding cartilaginous vertebral column by horizontal sliding movements with the blade of a fine forceps with inside-polished tips. Starting in the middle of the embryo's right side, work your way towards the tail and then to the anterior end. Afterwards, repeat the procedure on the other side. Be careful not to rip off the associated DRG.\nTo detach completely the loosened spinal cord from the embryo, pick up its cervical part with fine forceps and pull it out in one piece towards its caudal end.\nSubmerge the isolated spinal cord with attached DRG in a well of the 12-well plate filled with fixation buffer and proceed with the preparation of spinal cords from the remaining embryos.\nFix spinal cords at least two hours on ice.\n2. DiI-labeling of DRG neurons",
    "For each spinal cord to be labeled, prepare two glass needles with a micropipette puller. We use a Sutter model P-97 electrode puller (programme setting: 1. HEAT=625, VEL= 35, TIME=175; 2. HEAT=600, VEL= 25, TIME=175; 3. HEAT=630, VEL= 30, TIME=150).\nUnder microscopic control dip the tip of each glass needle three to five times in a 5 % (w/v) solution of DiI in ethanol. Evaporation of the ethanol creates a thin layer of DiI crystals on the needle.\nWorking under a dissecting microscope with a magnification of approximately 40x, place a spinal cord with its ventral side up on a slide. Using spring scissors, open the cord on the ventral side at its whole length by cutting through the floorplate to allow the later mounting of the preparation in an inverted open-book mode (see section C).\nPosition the spinal cord with the dorsal side up on a slide. Then manually approach the cord with the DiI-covered tip of the glass needle under microscopic visualization and carefully pierce every second DRG on one side of the spinal cord. Almost no traces of DiI should be visible in the pierced DRG to ensure the labeling of only a small number of neurons. Take a second needle for the other side of the cord. Aiming only every second DRG avoids an overlap of labeled axonal projections from neighboring DRG which might complicate the differentiation of individual axons.\nReturn the spinal cord to the fixation buffer and incubate in the dark for at least six hours at ambient temperature or overnight at 4 °C to give time for the dye to diffuse along the axon within the plasma membrane. Allow for a longer incubation period (up to two days at 4 °C) if the analysis of collateral growth into the spinal cord is desired.",
    "3. Mounting and microscopic analysis\nFollowing dye diffusion, position a single spinal cord with its dorsal side down on a coverslip in a drop of PBS. Take care that the attached DRG are correctly oriented laterally and do not intermingle. Aspirate excess fluid and flatten out the cord in an inverted open-book mode using forceps.\nMount the preparation on a microscope slide using PBS.\nTo prevent the increase of unwanted background staining fluorescence microscopic analysis of labeled axonal projections should be carried out the day of mounting. Until then keep the slides in the dark at 4 °C.\n4. Representative Results:\nThe spinal cord of the mouse receives afferent projections from 8 pairs of cervical, 13 pairs of thoracic, 5 pairs of lumbar and 4 pairs of sacral DRG totaling to 60 spinal ganglia. After some training a spinal cord with most DRG still attached can be isolated from an embryo in under five minutes. This procedure is suited for the isolation of spinal cords with attached DRG from E11.5 to E13.5 mouse embryos. However, best results are achieved from E12.5. Exemplary outcomes of the labeling procedure described here are shown in Figure 3. The labeling of DRG over the entire length of the spinal cord may then be used to quantify axonal branching behaviour at different vertebral levels (Fig. 4).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3667/3667fig1.jpg\nFigure 1. Scheme depicting the two principal modes of axonal branching. (A) Branching by the activities of the growth cone that could lead to a bifurcation - as indicated here - as well as complex terminal arbors or (B) collateral formation at the axon shaft (interstitial branching). The latter mode is the dominating branching type of projecting cortical and thalamocortical axons6,7.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3667/3667fig2.jpg",
    "Figure 2. Afferent projections of DRG neurons into the embryonic spinal cord display both types of axonal branching: axons first branch at the DREZ by bifurcation (1) and from the resulting daughter branches collaterals form after a waiting period by interstitial branching (2).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3667/3667fig3.jpg\nFigure 3. Visualization of single axonal trajectories of embryonic mouse DRG neurons. (A) Spinal cord with attached DRG prepared from an E12.5 mouse embryo. (Scale bar, 1 mm.) (B-D) Dorsal views of DiI-labeled DRG of wild-type mice at increasing magnification are shown. In B every second DRG is labeled by DiI. Fluorescence images are inverted, caudal is at the left and in C and D, lateral is at the bottom. In C a small number of axons is labeled and at higher magnification the presence of T-like branches can be identified in the DREZ of the spinal cord. (Scale bars, 250 μm (B), 100 μm (C) and 50 μm (D).)\nimgsrc://cloudfront.jove.com/files/ftp_upload/3667/3667fig4.jpg\nFigure 4. Quantification of T-shaped branches, single rostral or caudal turns in wild-type and C-type natriuretic peptide (CNP)-deficient mice at E13.5. The numbers of single axons counted are given in brackets for different trunk levels for each genotype. C- or R-turns - growth only in caudal or rostral direction, respectively.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3667/3667fig5.jpg\nFigure 5. A cGMP signaling pathway triggers sensory axon bifurcation at the DREZ of the spinal cord. (A) Scheme of the cGMP signaling pathway composed of the ligand CNP, the receptor guanylyl cyclase Npr2 and the serine/threonine kinase cGKIα in embryonic DRG neurons. Npr2 generates cGMP from GTP upon stimulation by CNP. (B) DiI tracing of single axons of DRG neurons in wild-type and CNP-deficient mice. (Scale bar, 25 μm.)Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}