{
  "id": 17898,
  "origin_website": "Jove",
  "title": "Quantitative Mapping of Specific Ventilation in the Human Lung using Proton Magnetic Resonance Imaging and Oxygen as a Contrast Agent",
  "procedures": [
    "The University of California, San Diego Human Research Protection Program has approved this protocol.\n1. Subject Safety and Training\nObtain written, informed consent from the subject. Describe the potential risks presented by exposure to rapidly changing magnetic fields, and the potential discomfort of using facial mask and breathing dry gas.\nEnsure that the subject can safely undergo MR scanning, utilizing the locally approved MRI safety screening questionnaire.\nIf the subject is a female of childbearing age, and uncertain of her pregnancy status, ask her to self-administer an over-the-counter pregnancy test. If the subject is pregnant, exclude the subject from the remainder of the study.\nMeasure the subject’s weight. Scanner safety parameters that limit the amount of radio frequency (RF) energy delivered to the subject require input of this characteristic. Verify that the subject’s weight is below the maximal weight limit of the MRI table (in this case, 136 kg).\nTrain the subject to breathe in time with the MR scan sequence. Preferably, play an audio recording of a previous scan and instruct the subject to breathe normally and complete a breath every 5 s, using the audio cues from the scanner as guide; breathe along with the subject for the purpose of training.\nDetermine the size of the face mask (sizes range from petite to extra-large [XL]) that best fits the subject by measuring the subject’s nose-to-chin dimensions. An appropriately-sized mask will fit comfortably yet will prevent air from leaking in between the mask and the subject’s skin at any point. Try on other sizes if necessary.\nVerify that the subject’s pockets and clothing are free from magnetic-based credit cards and iron-containing metal pieces. If required, have the subject change into the medical gown provided by the MRI facility.",
    "NOTE: Metal can be hazardous in the MRI environment, and metallic objects such as clips (typically in bras), metal rings (bras and hoodies), metal button or zippers (shirts, sweaters), hair extension and wigs have the potential to create imaging artifacts.\n2. Preparation of the MRI Environment\nOnly allow personnel trained in MRI safety to the standards of the imaging facility to enter the scanner room or assist in performing this experiment.\nConfigure the MR scanner for use with a torso coil by connecting the coil to the appropriate connector in the scanner table.\nPrepare the scanner table with sheets, pads, and pillows so that the subject will be comfortable for at least 30 min during imaging.\nAssemble the oxygen delivery system.\n\tNOTE: A schematic diagram of the tubing is presented in Figure 2.\n\t\nPlace a two/three-way switching valve within reach of the scanner operator or person performing the SVI experiment.\nConnect either the tank of medical oxygen (outside the scanner room) or the oxygen wall supply (if available) to one inlet of the switching valve using ¼-inch plastic tubing.\nConnect the outlet of the switch valve located in the control room to the 8 m (sufficient length for the scanner) ¼-inch plastic tubing. Feed the tubing through the pass-through, from the control room to the scanner room, and ensure that it will reach the middle of the scanner bore.\nNOTE: The plastic tubing connecting the switching valve outlet to the flow-bypass mask included a step up in diameter in the last 2 m, from ¼ inch to 3/8 inch to ½ inch, in order to decrease the noise produced by air flowing into the flow bypass system.\nConnect the ½ inch end of the tubing to the flow-bypass mask attachment.",
    "Secure the flow-bypass attachment to the face mask that fits the subject.\nSet the pressure on the gas tank or wall outlet regulator to a value that produces a flow of oxygen greater than the expected peak inspiratory flow. The pressure needed depends on the nature of the study (rest, exercise, etc.) and the overall resistance of the gas delivery system (typically ~70 psi for the delivery system described in step 2.4.3 for studies at rest).\nTest the switch valve by activating the flow of oxygen, making sure adequate flow is present at the outlet of the flow-bypass attachment and that no leaks are present in the plastic tubing.\n3. Instrumenting and Preparing the Subject for Imaging\nHave the subject lie on the MRI table. Make sure the top of the lower-coil element provides adequate coverage of the lung apices, by making sure the top of the lower-coil element is higher than the subject’s shoulders.\nHave the subject insert earplugs and verify that sound is being blocked.\nTape the squeeze ball (or an alternate safety mechanism) to the subject’s wrist so that it can be easily accessed.\nAttach the mask and flow-bypass system to the subject’s face. Briefly occlude the expiratory side of the flow-bypass attachment and ask the subject to attempt a normal inspiration and expiration to check for leaks.\nPlace the subject into the scanner, using the light centering tool to make sure that the torso coil occupies the center of the bore.\nConnect the flow bypass line to the 3D printed flow-bypass mask attachment using the tight-fitting brass nut to the inlet.\n4. MRI Imaging\nSelect the anatomical location for imaging slices.\nAcquire a localizer sequence to obtain an anatomical map that will be used to prescribe the rest of the exam.",
    "Select up to 4 sagittal lung slices to be studied by clicking and dragging the imaging slice to the desired location using the scanner graphical user interface. Typically, the field of view is set to 40 x 40 cm and slice thickness to 1.5 cm. Select slices centered in the lung field targeting the region of interest for the study, typically minimizing the intrusion of large pulmonary vessels medially and chest wall laterally to maximize the sampled lung volume.\nNOTE: Slice selection can be done in any plane; up to 4 slices can be selected. For the purpose of demonstration, one slice will be acquired.\nMake a note of the location of the imaging slices with respect to the location of the spinal column so that the same volume can be reimaged for longitudinal studies.\nSpecific ventilation imaging\n\tNOTE: A list of typical MRI parameters is presented in Table 1.\n\t\nSet the inversion time in the MR computer for the most medial slice to 1,100 ms to maximize air-oxygen contrast17.\nSet the acquisition parameters (Table 1) for imaging acquisition. For multi slice acquisition, each additional slice is acquired after the first, at intervals of 235 ms (1,335 ms, 1,570 ms, 1,805 ms).\nNOTE: Following the inversion recovery pulse and a time interval (described by the inversion time), each slice image is acquired using a half-Fourier single-shot turbo spin-echo (HASTE), at 128 x 128 resolution (70-lines of k-space sampled); images are reconstructed to 256 x 256 resolution.\nSet the number of repetitions to 220 and the repetition time (TR) to 5 s. This will result in repeating 4.2.1 and 4.2.2 for a total of 220 consecutive breaths, 5 s apart. Ask the subject to voluntarily gate his or her breathing in time with the image acquisition.",
    "NOTE: Images are acquired at the end of a normal expiration in a short voluntary breathing interruption at functional residual capacity (FRC). It is important that a similar lung volume is reached consistently during each of these consecutive acquisitions.\nMonitor the consistency of the subject’s lung volume (end expiration) during subsequent acquisitions and provide feedback to improve quality if necessary. Increase TR (the time interval between successive acquisitions) if the subject finds it difficult to reach a consistent lung volume every 5 s.\nSwitch the subject’s inspired gas mixture every 20 breaths (during the acquisition breath hold for the subject’s comfort), alternating between room air and medical oxygen. Make note of when the switches occurred, and the intervals during which the subject was breathing each gas. Allow the subject to breath 100% oxygen for 40 consecutive breaths at some point in the experiment (typically breaths 20-60 or 180-220) to increase sensitivity to low ventilation lung regions.\nRegularly verify heart rate (40−80 for normal subjects at rest) and oxygen saturation (typically 98−100%) by looking at the pulse oximeter (Figure 2); deviations from the norm can signal distress or anxiety.\nTalk to the subject frequently by pressing the scanner keyboard push-to-talk button, giving regular updates of time remaining.\nAfter breath 220, imaging is complete. Return the subject to room air and remove him or her from the scanner.\n5. Creating a Specific Ventilation Map from a Time Series of Images\nVerify that a stack of 220 consecutive MR images for each lung slice were acquired.\nImport the images for registration into the image analysis software (e.g., MATLAB).",
    "Of the 220 images, choose, by visual inspection of the entire image stack, for each slice one that best represents functional residual capacity. Functional residual capacity is identified as the “mode” of lung volumes in the stack.\nUsing the “mode” image as reference, use projective or affine registration to register all images to the functional residual capacity reference.\nNOTE: Registration is typically performed using an algorithm developed in house18 or a publicly-available generalized-dual bootstrap iterative closest point algorithm (GDB-ICP19).\nUse the output of the registration algorithm to compute the area change of each image. Discard images whose registration step required >10% area change from the image stack, and treat them as missing data20.\nQuantify specific ventilation in the lung from the registered stack using an algorithm developed in house1,7. Perform quantification by comparing the time response of each voxel to the consecutive oxygen washin and washout series, to a library of 50 simulated, noise free, responses, corresponding to specific ventilations ranging from 0.01 to 10, in 15% increments. Each voxel is assigned a value of specific ventilation corresponding to the specific ventilation of the simulated ideal presenting maximal correlation with each voxel’s time series, as originally presented in1.\nThe output of the previous step is a map of specific ventilation. Create a histogram of the distribution, and compute the width of the specific ventilation distribution, a measure of the specific ventilation heterogeneity, independent of tidal volume.\n6. Combining Specific Ventilation and Density Maps to Compute Regional Alveolar Ventilation",
    "In addition to SVI, acquire lung proton density images21, as described in a previous study22 (sections 4.4 and 5.1 in reference22). Obtain the proton density images in the same lung slice(s), at the same lung volume (FRC, end of a normal expiration); set the resolution to 64 x 64, corresponding to a voxel size of ~6.3 mm x 6.3 mm x 15 mm (~0.6 cm3).\nAlign specific ventilation and proton density images.\nSmooth both the specific ventilation and proton density images using a gaussian filter with a kernel size of ~1 cm3.\nPerform rigid registration (translation and rotation) between the map of specific ventilation and the map of density using a mutual information-based algorithm.\nCompute alveolar ventilation from co-registered specific ventilation and proton density data.\nCompute a map of (1-Density), which is the fraction of air in the sampled volume at the end of a normal expiration, assuming that the lung is composed of air and tissue and that tissue density is ~1 g/cm3.\nCompute a regional ventilation map as the product (1-Density) x SV (natural units). Multiply this product by the volume of a voxel (or other region of interest) and the breathing frequency (imposed, typically 12 breaths/min), to obtain a map of ventilation in the more familiar units of ml/min.\nNOTE: For each lung region, SV = ΔV/V0 and (1 – Density) ≈ V0. Thus, the product (1-Density) x SV = regional ventilation, expressed in natural units.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}