{
  "id": 19310,
  "origin_website": "Jove",
  "title": "Measurement of Poly A Tail Length from Drosophila Larva Brain and Cell Line",
  "procedures": [
    "1. Rearing and selecting Drosophila larvae\nMaintain/culture the fly strain (w1118, wildtype) on standard fly food medium at 25 ˚C in a humidified incubator.\nSelect 10 wandering 3rd instar larvae 72 h after egg laying.\nPlace the larvae in a 35 mm empty Petri dish and gently wash them by transferring the larvae to the new dish containing tap water using forceps. Do this 2x to remove any remaining food.\n2. Brain isolation from Drosophila larvae (Figure 1)\nimgsrc://cloudfront.jove.com/files/ftp_upload/66116/66116fig01.jpg\nFigure 1: Dissection of Drosophila larval brain from 3rd instar wandering stage. (A) Schematic drawings of Drosophila larva. (B-G) Larva dissection. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/66116/66116fig01large.jpg]\nPlace 10 larvae on a dissection dish containing ice-cold PBS.\nPlace the larva dorsal side up (identified by tracheal tubes running along its length) and pin each end to the bottom of the dish followed by making a small incision on the body wall at the posterior end.\nCut the body wall along the dorsal midline towards the anterior end using microdissection scissors.\nBriefly flush the interior of the larva using a Pasteur pipette 3x with PBS in the dish to expose the brain.\nLocate and lift the brain using the forceps and carefully isolate it using microdissection scissors.\nTransfer the dissected brains to a 1.5 mL microcentrifuge tube filled with ice-cold PBS on ice; collect all larva brains. Proceed with RNA extraction using an RNA microprep kit as described in section 4.\n\tNOTE: Do a dissection of 10 larvae within 15 min to prevent tissue damage and RNA degradation.\n3. Drosophila S2 Schneider cells",
    "Grow Drosophila S2 cells in Drosophila Schneider's medium supplemented with 10% fetal bovine serum (FBS) at 25 °C in a humidified incubator to a density of 8 × 106 to 10 × 106 cells/mL with minimum 90% viability.\nIn a 50 mL sterile conical tube, dilute cells to 2.5 × 106 cells/mL with Schneider's Drosophila medium supplemented with 10% FBS that has been prewarmed to 25 °C.\nTransfer 8 mL of the cell suspension (20 × 106 cells) into a 100 mm culture plate and add 4 mL of medium to make it to 12 mL (day 1).\nIncubate the cultured cells at 25 °C in a humidified incubator.\n\tNOTE: Cells loosely adhere to the plate after 12-16 h (day 2).\nTransfect the cells with appropriate DNA plasmids24.\nIncubate for 48 h in a humidified incubator.\nAfter incubation, collect cells by adding 5 mL of ice-cold PBS by gentle pipetting (day 4).\nTransfer the cells to a 15 mL tube.\nPellet the cells by centrifuging at 1,000 × g for 5 min at 4 °C.\nRinse the cells 2x with ice-cold PBS by gentle pipetting and collect the cells by centrifuging them at 1,000 × g for 5 min at 4 °C.\nPerform RNA extraction using an RNA miniprep kit.\n\tNOTE: Perform the following steps inside a sterile laminar flow hood.\n4. Total RNA extraction from Drosophila larvae brain and S2 cells\nLarval brain: Remove PBS by brief centrifugation (8 s short spin at 5,000 × g).\nAdd 600 µL of RNA lysis buffer and homogenize 10x with a plastic pestle. Visually inspect the tube under a stereo microscope to ensure complete lysis.\nCentrifuge at 1,000 × g for 5 min at 4 °C to remove tissue debris. Transfer the cleared supernatant into a nuclease-free microcentrifuge tube.",
    "Isolate RNA using an RNA microprep kit according to the manufacturer's instructions.\n\tNOTE: The use of an RNA microprep kit is essential for the larval brain samples because of the small amount of RNA present in the samples.\nS2 cells: Remove PBS and isolate RNA according to the manufacturer's instructions.\nMeasure RNA yield and quality by spectrophotometry and agarose gel electrophoresis.\n\t\nDetermine the purity and quantity of extracted RNA by measuring the optical density of the extracted RNA at A260 nm and A280 nm, respectively. Make sure the A260 nm/A280 nm ratio is ≥2.0 and the RNA concentration is >350 ng/µL for downstream applications.\n\t\tNOTE: A typical RNA yield from 10 Drosophila larva brains is ~500-800 ng/µL or 2.5-4 µg in 5 µL. For S2 cells, the yield is ~2-3 µg/µL (15-30 µg in 15 µL). Isolated RNA can be stored at -80 °C for long-term storage.\n5. Preparation of RNA gel and electrophoresis\n1.5% Denaturing RNA gel (100 mL)\n\tNOTE: Formaldehyde is toxic through skin contact and inhalation of vapors; handle it in a chemical fume hood.\n\t\nDissolve three agarose tablets (1.5 g) in 82 mL of MOPS buffer (Supplemental File 1) until tablets completely break up to form fine particles.\nHeat the agarose slurry in a microwave until the solution is clear and all particles are completely dissolved.\nCool the solution to ~60 °C.\nAdd 18 mL of 37% formaldehyde, then mix by gentle swirling. Pour the solution into the casting tray and let it solidify in a fume hood.\nRNA sample preparation and electrophoresis\n\t\nDilute the RNA sample to 200 ng (in 5 µL) and add 5 µL of 2x RNA loading dye.\nHeat the samples at 70 ˚C for 5 min in a dry bath.",
    "Load 2 µL of RNA ladder in the first lane and 10 µL of samples in the adjacent lanes.\nPerform electrophoresis in MOPS buffer at 100 V for 60 min for a 5 x 6 cm gel.\n\t\tNOTE: Adjust the electrophoresis conditions depending on the amplicon sizes.\nVisualize the gel on a UV transilluminator.\n\t\tNOTE: The presence of a single band ~600 nucleotide size indicates intact RNA preparation (see Figure 2A).\n6. Poly(A) tail length measurement\nimgsrc://cloudfront.jove.com/files/ftp_upload/66116/66116fig02v2.jpg\nFigure 2: RNA sample preparation and the poly(A)-tail assay. (A) The RNA gel images show total RNA from the Drosophila larva brain (left) and S2 cells (right) on a 1.5% formaldehyde agarose gel. Single-stranded RNA ladder sizes are shown in nucleotides on lane M. Note a major RNA banding at ~600 nt, which is from rRNA. (B) Schematics of poly(A)-tail assay. Abbreviation: G/I = guanosine/inosine. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/66116/66116fig02largev2.jpg]\nGI tailing (Figure 2B)\n\t\nKeeping the reagents on ice, prepare the following mixture (20 µL): up to 14 µL of total RNA sample (1 µg), 4 µL of 5x Tail buffer mix, and 2 µL of 10x Tail enzyme mix.\nIncubate at 37 °C for 60 min in a thermocycler.\nAdd 1.5 µL of the tail stop solution; keep on ice for 2 min.\n\t\tNOTE: Proceed to reverse transcription or store the GI-tailed RNA samples at -80 °C until ready to proceed to reverse transcription.\nReverse transcription and PCR amplification\n\t\nSynthesize cDNA by preparing the mix and incubating it under the conditions described in Supplemental File 1.\nDilute the cDNA samples and perform PCR to amplify DNA as indicated in Supplemental File 1.\n7. PCR product analysis by agarose gel electrophoresis",
    "Analyze a small portion (2-5 µL) of the PCR products from step 6.2.2 on a 2.5% agarose gel by electrophoresis at 100 V for 45 min for quality control.\nVerify the specificity of PCR for gene-specific and tail-specific reactions by sequencing the gel-extracted PCR bands.\n8. Capillary electrophoresis\nPerform high-resolution gel electrophoresis on 1 µL of PCR products (0.5-5 ng/µL) from gene-specific and poly(A)-specific PCR using the bioanalyzer with a high-sensitivity DNA kit. Look for well-resolved peaks indicating a successful run.\n9. Data analysis: poly(A) tail length measurement (Figure 3)\nimgsrc://cloudfront.jove.com/files/ftp_upload/66116/66116fig03v2.jpg\nFigure 3: Poly(A) tail length and peak value measurement. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/66116/66116fig03largev2.jpg]\nAccessing data\n\t\nTo access the data, open the xad file in the software.\nSelect the sample name or the ladder in the tree view panel.\n\t\tNOTE: This will show the result as electropherograms or gel-like images for the selected samples. The lower marker 35 base pair (bp) and upper marker 10,380 bp are the internal standards used to align the ladder data (50-7,000 bp) with data from the sample wells.\nZoom in and out of the electropherograms and gel-like images to display the details.\nPerforming peak and smear analysis\n\t\nTo obtain the peak sizes, open the electropherogram of a selected sample.\nRight-click on the electropherogram and select manual integration to manually select peaks by dragging the horizontal line.\nObserve the peak values in the Peak table. Identify the peak with the largest Peak Height. This is a peak of poly(A) tail length for an individual sample. In the example shown, it is 346 bp.\nEnable the Show/Hide Setpoints icon on the top menu and wait for a new panel to pop up on the right side.",
    "Select Advanced, scroll down to find Perform Smear Analysis, and select the check box. This will add the Region table to the electropherogram tab.\nSelect an electropherogram from a sample and go to the Region table, which shows the From [bp] and To [bp] menu. To set the starting and ending [bp], right-click on the electropherogram and select Region to add Add Region.\nRight-click on any cells in the Region table and select Modify Regions to make a small new window pop up where custom regions can be set.\n\t\tNOTE: For example, we used a region of 300 bp to 550 bp for GAPDH. The gene-specific GAPDH PCR yielded a peak at 265 bp. The universal primer (Table 1) extends the length of poly(A) PCR by 35 bp via annealing to G/I-tailed RNAs. Thus, the first adenine nucleotide on GAPDH RNA starts at 300 bp (265 + 35). We arbitrarily limited the maximum poly(A) tail length to 250 (300 + 250 = 550). From the region table, the program returns the average size within the region as 387 bp.\nUse equation (1) to calculate the poly(A) tail length on the mRNA of interest:\n\t\tPoly(A) tail length = (A - B - 35) (1)\n\t\tWhere A is the average bp of poly(A)-specific PCR product from electropherogram (i.e., 387 bp for GAPDH), B is the peak bp of gene-specific PCR product from electropherogram (i.e., 265 bp for GAPDH), and \"35\" is the length of universal reverse primer tag.\n\t\tNOTE: From the calculation above, the average poly(A) tail length of GAPDH is 387 - 265 - 35= 87 bp.\n10. Visualizing poly(A) tail length distribution\nExport data as a csv file under File | Export | Sample Data to retrieve sample data.",
    "NOTE: The exported csv file displays run time rather than bp on the X-axis.\nGo to an electropherogram of a sample and check on Show Sizes on the Electropherogram tab to automatically convert the region table on Region Table from bp to run time. In the example, 70.39 s to 86.28 s correspond to 300 bp to 550 bp.\nOpen the csv file and select the values from 70.39 s to 86.28 s of run time to generate a graph. To visualize bp sizes to the X-axis on the graph, export the electropherogram with bp sizes as an image file and overlay it on the graph generated in the spreadsheet. This will appropriately match the bp sizes on poly(A) tail distribution.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}