{
  "id": 19441,
  "origin_website": "Jove",
  "title": "Microdissection and Whole Mount Scanning Electron Microscopy Visualization of Mouse Choroid Plexus",
  "procedures": [
    "All animal experiments described in this study were conducted according to the national (Belgian Law 14/08/1986 and 22/12/2003, Belgian Royal Decree 06/04/2010) and European legislation (EU Directives 2010/63/EU, 86/609/EEC). All experiments on mice and animal protocols were approved by the ethics committee of Ghent University (permit numbers LA1400091 and EC 2017-026).\n1. Preparation\nAnesthetics: Prepare a terminal anesthetic. For instance, a sodium pentobarbital (≥100 mg/kg) solution in phosphate-buffered saline (PBS) can be prepared.\nTranscardial perfusion solution: Prepare 10 mL (per mouse) of PBS/heparin (containing 0.2% heparin) solution supplemented with 0.5% bromophenol blue.\n\t​NOTE: If the downstream processing steps allow (e.g., in the case of RNA and protein analysis), the choroid plexus (CP) can be visualized via transcardial perfusion with bromophenol blue. If bromophenol blue is not compatible with the further processing steps (e.g., for imaging), use PBS/heparin to perfuse.\nPrepare the solutions required for SEM analysis.\n\t\nPrepare 0.1 M Na-cacodylate buffer (pH 7.4). Prepare a solution of 2% paraformaldehyde and 2.5% glutaraldehyde in 0.1 M Na-cacodylate buffer. Make 20 mL of this solution per sample.\nPrepare 2% osmium tetroxide in 0.1 M Na-cacodylate buffer (5 mL per sample).\nPrepare 50%, 70%, 85%, and 100% EtOH solutions. Prepare 5 mL of each EtOH solution per sample.\n2. Microdissection of the choroid plexus out of the lateral and fourth ventricle\nNOTE: Female, 9-week-old C57BL/6 mice were used in this study. However, the described isolation technique is independent of the strain, sex, and age of the adult mouse.\nIsolate the mouse brain.\n\t\nIntraperitoneally inject a lethal dose of a short-acting barbiturate (>100 mg/kg, prepared in step 1.1) using a 26G needle to terminally anesthetize the mouse. Check the foot reflex of the mouse by pinching its rear paw with forceps.",
    "When there is no foot reflex, place the terminally anesthetized animal in the dorsal decubitus position and fix the mouse by pinning the limbs on a plate.\n\t\tNOTE: If transcardial perfusion of the mice is not needed, depending on the downstream analysis method (e.g., for SEM imaging), proceed to step 2.1.7. However, if perfusion is needed to remove blood cells or other components in the blood, the CP can be visualized as a blue structure floating in the brain ventricles via perfusion with bromophenol blue.\nDisinfect the chest by spraying 70% ethanol. Place a sterile drape around the surgical area. Make an incision of ~4 cm just under the diaphragm using a carbon steel surgical blade (see Table of Materials).\nOpen the skin and expose the chest using surgical scissors. Cut the diaphragm completely open.\nSeparate the thorax to expose the lungs and the beating heart.\nTranscardially perfuse the mice with 10 mL of the perfusion solution at a rate of 4.5 mL/min, using a perfusion pump (see Table of Materials). The perfusion will take ~2 min. Insert a 26G needle in the left ventricle to pump the solution into the systemic circuit. In addition, make a cut with surgical scissors in the right atrium so that blood can go out of the circulation.",
    "NOTE: A perfusion pump is preferred over manual administration of the fluid, as it will deliver the fluids at a precisely programmed rate and ensure that the shearing forces caused by the perfusion are not too strong. Excessive shearing forces will compromise the viability and structure of cells within the CP. Additionally, the perfusion flow rate recommended here is optimal to perfuse adult mice from 7 weeks onward. If younger mice are used, a lower flow rate should be used. It is also important to dab away the blood that comes out of the right atrium in order to preserve a clean surgical site.\nDecapitate the mouse.\n\t\tNOTE: Pay caution to cut off the head as low as possible to the shoulder to preserve the brain structure. If the cut is too high, the cerebellum can be damaged.\nAfter decapitation, cut open the scalp by a making an incision from between the ears to superior to the eyes. Pull the skin laterally to expose the skull. Then, cut open the skull by following the squamosal sutures, toward the nasal part.\n\t\tNOTE: It is important to gently remove the skull to maintain the brain integrity.\nPlace the brain in an ice-cold Petri dish and add 1 mL of ice-cold 1x PBS on the brain tissue.\n\t\tNOTE:Coating of the dish is not needed.\nIsolate the CP floating in the fourth ventricle.\n\t\nGently cut off the cerebellum from the cerebrum with a scalpel. The cerebrum is the largest part of the brain, while the cerebellum is a much smaller part at the back of the brain. If necessary, remove remaining brain stem tissue parts from the cerebellum.",
    "Rotate the brain so that the cutting line is facing upward. Ensure that the fourth ventricle cavity is now visible in the middle of the section, with the CP floating at the dorsal site. If necessary, open up the ventricle a bit by pulling open the connective tissue with sharp forceps. In this way, the CP will be more visible and easier to reach.\nGently tear the CP out of the ventricle wall using tiny sharp forceps.\n\t\tNOTE It is important to only touch and take out the CP in this step in order to not contaminate the sample with the surrounding tissue. Opening up the ventricles as described in step 2.2.2 will facilitate step 2.2.3.\nIsolate the CP protruding out of the lateral ventricle.\n\t\nUse tiny sharp forceps to sagittally cut the brain into two hemispheres.\nRotate the brain so that the cutting line is facing upward. To reveal the lateral ventricle, gently pull away the cortex from the thalamus.\nRetract the hippocampus to the midsagittal cutting line. The lateral ventricle is now visible with the CP lying at the bottom of the ventricle. If necessary, open up the ventricle a bit by pulling open the connective tissue with sharp forceps. In this way, the CP will be more visible and easier to reach.\nUse tiny sharp forceps to gently tear the CP out of the ventricle wall.\n\t\t​NOTE: It is important to only touch and take out the CP in this step in order to not contaminate the sample with the surrounding tissue. Opening up the ventricles as described in step 2.3.4 will facilitate step 2.3.5. Use necessary caution in this step to preserve the structure of the CP as much as possible. It is easiest to start pulling the CP in the rostral to caudal direction.",
    "3. Morphological analysis of CP tissue using scanning electron microscopy (SEM)\nCAUTION: Toxic solutions are used in the following processing steps. It is recommended to perform the sample preparation in a fume hood.\nPerform sample preparation for SEM as described below.\n\t\nTransfer the fresh isolated CP into freshly made fixation solution containing 2% paraformaldehyde and 2.5% glutaraldehyde in 0.1 M Na-cacodylate buffer (pH 7.4). Incubate overnight at 4 °C.\n\t\tNOTE: As the CP tissue is very fragile and thin, the tissue should be put in small specimen baskets (see Table of Materials) to transfer it between buffers. In this way, the structure of the tissue will be better preserved. A cacodylate-based fixative is used over a PBS-based one, as the strong cacodylate buffer can counter the low pH of glutaraldehyde in the EM fixative.\nWash the sample 3x for 5 min each with 3-5 mL of 0.1 M Na-cacodylate buffer (pH 7.4).\nPost-fix the samples in 3-5 mL of 2% osmium tetroxide in 0.1 M Na-cacodylate buffer for 30 min. Wash the samples 3x for 5 min each with 3-5 mL of ultrapure water.\nDehydrate the samples in a series of ice-cold solutions of increasing EtOH concentrations (50%, 70%, 85%, 100%), for 15 min per EtOH solution. Use a critical point dryer to properly point dry the sample.\n\t\tNOTE Changing from liquid to gas phase affects the surface tension, causing damage to the surface structure. The critical point drying step allows for the preservation of the surface structure.\nPosition the sample carefully on a specimen mount provided with a carbon sticker (see Table of Materials).",
    "Coat the samples with a thin layer (2-5 nm) of platinum. To do so, mount a platinum source in a vacuum system between two high-current electrical terminals and heat the platinum to its evaporation temperature. A fine stream of platinum is deposited on the sample.\n\t\tNOTE: A more detailed protocol for this step is provided in reference30. Besides platinum, gold or gold/palladium can also be used.\nVisualize the CP samples with SEM (see Table of Materials). The visualization procedure of CP tissue via SEM is similar to that of other types of tissues and depends on the used software and instruments. A step by step SEM protocol with an accompanying video is available in reference31 or reference30.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}