{
  "id": 19410,
  "origin_website": "Jove",
  "title": "Open-Source Real-Time Closed-Loop Electrical Threshold Tracking for Translational Pain Research",
  "procedures": [
    "The human microneurography experiments were approved by the Faculty of Life Sciences Research Ethics Committee at the University of Bristol (reference number: 51882). All the study participants gave written informed consent. The animal experiments were performed at the University of Bristol in accordance with the UK Animals (Scientific Procedures) Act 1986 after approval by the University of Bristol Animal Welfare and ethical review board and were covered by a Project License.\n1. Installing the Open Ephys GUI and APTrack\nCheck the software documentation to find the most recent version of the Open Ephys graphical user interface (GUI) that is supported (https://github.com/Microneurography/APTrack#readme), and then download and install the GUI.\nInstall a compatible version of the GUI from the following URL: https://github.com/open-ephys/plugin-GUI/releases.\nDownload the latest version from GitHub: https://github.com/Microneurography/APTrack/releases. For a Windows computer, copy the .dll file into the plugins folder, which is usually found at C:\\Program Files\\Open Ephys\\plugins. For a MacOS computer, copy the .bundle file into the Contents/PlugIns folder of the package.\n2. Assembly of the recording and stimulating apparatus\nConnect the acquisition board to the computer using the manufacturer-supplied cable, and power it on.\n\tNOTE: For human microneurography, a USB 3.0 isolator was used to electrically isolate the participant from the computer, and the acquisition board was powered by a portable battery as opposed to the mains voltage power supply used for rodent studies. All the USB connections, excluding the stepper motor control board, were passed through the USB isolator during the human studies.\nConnect the I/O board to the analog in port on the acquisition board. Connect an Intan RHD recording headstage to the acquisition board using a serial-peripheral interface (SPI) cable.\n\tNOTE: The Intan 16-channel bipolar headstage was used here, but other monopolar RHD2000 series headstages may be used.",
    "Connect the PulsePal to the computer22. For assembly with an analog voltage-controlled stimulator (e.g., a DS4) using a PulsePal, as with the mouse teased-fiber recordings, follow steps 2.5.1-2.5.3; for assembly with a rotary encoder-based stimulator (e.g., a DS7) using a stepper motor, as with the human microneurography recordings, follow steps 2.6.1-2.6.8 (Figure 1).\nBuild the signal chain in the GUI as described below.\n\t\nInsert the Rhythm FPGA plugin into the signal chain by left-clicking and dragging it into the signal chain; this connects the GUI to the acquisition board. Ensure the ADC button has been clicked on to initiate the recording of the ADC channels from the I/O board. The ADC button will light up orange when it is on.\n\t\tNOTE: If you wish to play back previously recorded experimental data, the File Reader plugin can be used at the start instead of Rhythm FPGA. Using this in combination with APTrack will allow for the visualization and latency tracking of the action potentials in previous experiments.\nInsert a bandpass filter into the signal chain; the default settings of 300-6,000 Hz are suitable for both human and mouse recordings. Additionally, insert a splitter after it.\nInsert the APTrack plugin into the signal chain on one side of the splitter and LFP Viewer on the other side. LFP Viewer provides a traditional oscilloscope-like voltage trace view, which is useful during experiments.\nInsert a record node after the plugin. In the drop-down menu, change the data save format from binary to Open Ephys. This completes a simple signal chain that works well (Figure 2); however, additional components can be added as determined by experimental requirements.\n\t\tNOTE: If the record node is placed before the plugin in the signal chain, the action potential tracking information will not be saved.",
    "At the top right of the GUI, click on the play button to begin transmitting data from the acquisition board and visualizing it. To begin recording, click on the circular record button next to the play button.\n\t\tNOTE: It is easy to forget to click on record; we record data from the moment we begin acquiring to prevent this from happening.\nFor assembly with an analog voltage-controlled stimulator, follow the steps as described below.\n\t\nPower on a constant current stimulator that has its stimulation amplitude controlled by an analog voltage input. A DS4 was used in this case (Figure 1).\nThe PulsePal output channel 1 is for the analog voltage command. Split this signal using a BNC T-splitter, and then connect it to the constant current stimulator input and the I/O board so that the command voltage is recorded.\nThe PulsePal output channel 2 is for the electrical stimulation TTL event marker. Connect this to the I/O board so that the stimulation TTL event markers are recorded for the plugin to use and for the post hoc analysis.\nFor assembly with an analog voltage-controlled stimulator, follow the steps as described below.\n\t\nPower on a constant current stimulator that has its stimulation amplitude controlled by a rotary encoding dial. A DS7 was used in this case (Figure 1).\nConnect the stepper motor control board to the stepper motor using the manufacturer-supplied cable and magnetic mount.\nConnect the control board to the computer directly using any standard USB A to USB micro-B cable. Do not connect the control board on the participant side of the USB isolator as this is also connected to a 12 V mains power supply.",
    "If it is the first time using the control board, upload the stepper motor script from GitHub to the control board; this only needs to be done once, or if any software updates for the stepper motor script are released.\nSet the stimulation amplitude dial on the constant current stimulator to 0 mA. Use a custom mounting bracket to interface the stepper motor and the stimulation amplitude dial. These can be 3D-printed, which enables cheap, quick, and customizable mounting solutions. Consult GitHub to see if a mount has already been designed for the stimulator of choice.\nUse a custom barrel adapter to connect the stepper motor barrel to the stimulation amplitude control dial. These adapters should be constructed from metal for strength and durability reasons; however, 3D-printed parts would also be suitable, although they may need to be replaced regularly. Consult GitHub to see if a barrel adapter has already been designed for the stimulator of choice.\nLoosely attach the control board/stepper motor apparatus to the stimulator control dial using a custom mount and barrel adapter.\n\t\tNOTE: The mount and barrel adapter will be tightened later once the software has been launched and the stepper motor, automatically, sets to position zero.\nConnect the PulsePal as described in protocol steps 2.5.2-2.5.3 (minus connecting output channel 1 to a stimulator), as generating TTL event markers is still required for analysis and for the plugin to function. Additionally, connect output channel 2 to the DS7 stimulator to trigger it.\nPrepare the mouse skin-nerve preparation as described below.\n\t\nProvide C57BL/6J mice (Charles River Laboratories, UK, in this study) of 2-4 months of age and of both sexes with food and water ad libitum.",
    "After culling by anesthetic overdose through an intraperitoneal injection of sodium pentobarbital (≥200 mg/kg) and confirming the cessation of circulation, dissect the skin from the dorsal aspect of the mouse hind paw and the saphenous nerve, which innervates this area, using the methods described by Zimmermann et al.23.\nMaintain the skin-nerve preparation in carbogenated synthetic interstitial fluid (Table 1) at 30-32 °C in one-half of a custom-made dual-chamber acrylic bath (15 mL/min perfusion rate, 30 mL volume). Thread the nerve through a small hole into the mineral oil-filled chamber, and seal with petroleum jelly. The oil provides an insulated recording environment.\nTease away two fine filaments from the trunk of the nerve using super fine forceps and hang one on each side of a bipolar silver/silver chloride recording electrode.\nDigitize and amplify the neural signal using an RHD2216 16-channel bipolar headstage, and process it using the acquisition board. Sample the signal at 30 kHz, with a bandpass filter of 300-6,000 Hz, and visualize it using the GUI.\nUsing a blunt glass rod, stroke the skin of the preparation. Use the low-amplitude mass activity to confirm that the preparation is alive.\nPerform human C-fiber microneurography as described below.\n\t\nConduct microneurography with participants who have provided written informed consent, as previously described24.\nWith the participant seated reclined comfortably on a bed and supported with pillows, identify the superficial peroneal nerve using an ultrasound scanner, and mark a target area approximately 5-10 cm proximal to the lateral malleolus, around the mid-shin level.\nSterilize the skin around the target area using a 2% chlorhexidine in 70% alcohol wipe and insert a sterile reference electrode subcutaneously near the intended recording site at the mid-shin level.\nInsert a sterile recording electrode into the superficial peroneal nerve under ultrasound guidance within the target area.",
    "Digitize and amplify the neural signal using an RHD2216 16-channel bipolar headstage, and process it using the acquisition board. Sample the signal at 30 kHz, with a bandpass filter of 300-6,000 Hz, and visualize it using the GUI.\n\t\tNOTE: The acquisition equipment was electrically isolated from the laptop by a USB 3.0 isolator with 5 kV RMS isolation and powered via a custom-made 12 V battery power supply.\nConfirm successful intraneural positioning by gently stroking the skin to reveal mechanically evoked mass activity. Additionally, participants usually report paresthesia in the dorsolateral aspect of the foot upon successful intraneural positioning.\n3. Software setup and identification and phenotyping of peripheral neurons\nSet up the software as described below.\n\t\nOpen the GUI (Figure 3). If the stepper motor control board is connected to your PC, it will be detected and set itself to position zero. Tighten the custom mount and barrel adapter described in steps 2.6.5-2.6.7, as the stimulator's stimulation amplitude dial and stepper motor are both set to zero.\n\t\tNOTE: If the stepper motor and stimulation amplitude dial are not both \"zeroed\", this can result in the stepper motor trying to turn the control dial out of its range, which may cause damage.\nIn the options menu, select the Trigger Channel. Choose the ADC channel containing the electrical stimulation TTL marker from the PulsePal output channel 2.\nIn the options menu, select the Data Channel, and choose the channel containing the electrophysiological data.\nIn the stimulation control panel, define the initial, minimum, and maximum stimulation amplitudes using the slider. Ensure the current stimulation is set above 0 so that TTL markers are generated.",
    "NOTE: Some stimulators have an input-to-output scaling ratio that is not 1:1; consider this when selecting an appropriate stimulation amplitude. For example, a 1:10 output ratio can be selected on some stimulation systems to achieve a higher output from the constant current stimulator.\nIn the stimulation control panel, click on F to load a file containing the stimulation instructions. Electrical stimulation protocols are stored as comma-separated value (CSV) files composed of the desired stimulation frequencies and duration, which allows users to create complex stimulation paradigms for their experiments. An example template is available here: https://github.com/Microneurography/APTrack/blob/main/example_playlist.csv\nIn the stimulation control panel, click on > to begin the loaded stimulation paradigm. By default, APTrack requests the PulsePal to generate 0.5 ms duration positive square wave pulses of varying amplitudes to control the constant current stimulator's stimulation amplitude.\nThe temporal raster plot will begin updating with the response to electrical stimulation, with each new stimulation response being displayed as a new column on the right.\nVisualize and identify single-neuron action potentials.\n\t\nFor the successful detection of single-neuron action potentials, it is important to have suitable image thresholds set. In the temporal raster plot panel, adjust the low, detection, and high image threshold values.\n\t\t\nSelect a color scheme in the options menu. In WHOT (White Hot) mode (default), voltages below the low image threshold are encoded in black. Voltages between the low image and detection thresholds are encoded in greyscale. Voltages above the detection threshold are encoded in green, and voltages above the high image threshold are encoded in red.",
    "Peripheral neurons exhibit constant latency responses at low stimulation frequencies (<0.25 Hz), and these responses are determined by their conduction velocity and the distance between the stimulation and recording sites. With suitable image thresholds set, the threshold crossing events detected by the algorithms will be encoded in green (Figure 4).\nSystematically move the stimulating electrode around the skin area innervated by the nerve that is being recorded, allowing for a minimum of three stimulation events at each site. Monitor the temporal raster plot for threshold crossing events (marked in green) occurring at the same time point after each electrical stimulation event.\n\t\tNOTE: In mice, a search stimulus of 5 mA was used. In humans, the amplitude of the transcutaneous electrical search stimulus was titrated to a verbal pain rating such that it never exceeded 7/10.\nCheck for three threshold crossing events (green bars) that appear in a row at the same latency and in the same stimulation position; this indicates the identification of a peripheral neuron action potential.\nOptimize the stimulating electrode position by identifying the most electrically sensitive point of the target neuron's receptive field, and then fix the electrode in position. At this point in human microneurography, switch to using intradermal electroacupuncture needles (0.2 mm diameter) for bipolar electrical stimulation, in mice, a custom transcutaneous stimulating probe is used so that the stimulation position is constant.\nPerform classification and sensory phenotyping of the peripheral neurons.\n\t\nEstimate the electrical threshold of the target action potential by adjusting the simulation amplitude manually or by using APTrack if desired (described in steps 4.1-4.2).\nStimulate the receptive field at 2x the estimated electrical threshold at a frequency of 0.25 Hz throughout the sensory phenotyping protocol.",
    "Calculate the conduction velocity of the neuron by dividing the conduction distance by the conduction latency. C-fibers can be identified by a conduction velocity of ≤2 m/s.\nMechanically stimulate the receptive field using von Frey filaments to determine the mechanical threshold for activation. Mechanosensation can be identified by evoked action potentials visible on the voltage trace and an increase in the latency of the neuron, if it is a C-fiber, upon sufficient force.\nHeat the receptive field of the neuron, again watching for action potentials visible on the voltage trace and an increase in the latency of the neuron, if it is a C-fiber, upon sufficient heat application. Heat-insensitive neurons will exhibit a decrease in latency due to the thermodynamic effect on axonal propagation.\n\t\tNOTE: In human microneurography, use a TSC-II for rapid and accurate thermal control. In the mouse preparation, add warmed or cooled synthetic interstitial fluid to an aluminum isolation chamber placed over the receptive field to allow access to the neuron terminals while restricting rapid heat dissipation into the surrounding fluid. Record the temperature using a thermocouple.\nCool the receptive field, again watching for action potentials visible on the voltage trace and a marked increase in the latency of the neuron, if it is a C-fiber, upon sufficient cold application. All neurons will exhibit an increase in latency due to the thermodynamic effect on axonal propagation, so exercise caution in labeling neurons as cold-sensitive based on a latency increase alone.\n4. Latency and electrical threshold tracking\nPerform latency tracking as described below.\n\t\nFollowing the identification of single-neuron action potential(s) on the temporal raster plot, move the gray linear slider on the right side of the temporal raster plot to adjust the position of the search box.",
    "Below the temporal raster plot, adjust the search box width rotary slider to an appropriate width. Make the search box width narrow to reduce the chance of transient noise spikes, spontaneously firing action potentials, or other nearby constant latency action potentials being misidentified as the action potential of interest.\nTo begin tracking the targeted action potential, click on the + below the multi-unit tracking table. A new row will be added to the table containing details of the target action potential, including the latency location, the percentage firing over 2-10 stimuli (adjusted in the options menu), and the peak amplitude detected.\nOnce an action potential is added to the multi-unit tracking table, the latency tracking algorithm (Figure 5) will automatically be executed on it upon every subsequent electrical stimulation.\nIf there are multiple discrete action potentials visible on the temporal raster plot, add them to the multi-unit tracking table as described above. The theoretical maximum number of action potentials that can be added to the table for simultaneous latency tracking is the maximum 32 bit integer value.\nCheck the Track Spike box in the multi-unit tracking table to move the search box to the appropriate position for that particular action potential, as determined by the latency tracking algorithm. This will allow for monitoring the latency tracking in real time and ensure that the tracking is following the action potential as expected. The latency tracking of other spikes will continue as normal in the background.\nRemove tracked action potentials from the multi-unit tracking table using the delete button at the end of each row.\nPerform electrical threshold tracking as described below.",
    "Adjust the increment and decrement rates in the stimulation control panel between 0.1 V and 0.5 V. Keep these values equal, and do not adjust them during the experiment unless this is part of the experimental paradigm.\nEnsure the stimulation frequency is set to an appropriate rate, typically 0.25-0.5 Hz, unless modulation of stimulation frequency is part of the experimental paradigm. Increasing nociceptor firing rates may alter the electrical threshold of nociceptor.\nOnce an action potential is being successfully tracked, check the Track Threshold box in the multi-unit tracking table, which will initiate the electrical threshold tracking algorithm (Figure 6).\n\t\tNOTE: Electrical threshold tracking is only run on the targeted action potential; indeed, the firing rates of other action potentials in the multi-unit tracking table will be updated accordingly as the stimulation amplitude changes.\nAdjust the stimulation amplitude manually to the estimate of the electrical threshold; this will reduce the waiting time to determine the electrical threshold. The time taken to establish a reliable electrical threshold is dependent on the stimulation frequency, the increment and decrement rates, and the difference in stimulation amplitude from the initial stimulation to the electrical threshold of the neuron.\nThe software uses an up-down method for the estimation of the electrical threshold of the neurons. In the multi-unit tracking table, the firing rate is determined over 2-10 previous stimulations (selected in the options menu). Select the number of stimulation events to be considered; a higher number will increase the reliability of the threshold estimate but will take longer to achieve.",
    "During human microneurography, it is important to monitor the painfulness of electrical stimuli to prevent excessive participant discomfort; some discomfort is unavoidable during the study of nociceptors, particularly of silent/sleeping C-fibers. Regularly ask for pain ratings while the stimulation amplitude increases during the electrical threshold tracking and remain nearby the constant current stimulator to disengage it upon the participant's request.\n\t\tNOTE: Alternatively, the electrical stimulation can be disengaged through the user interface by clicking on the [ ] button in the stimulation control panel.\nA firing rate of 50% indicates the approximate electrical threshold has been determined.\nWhile electrical threshold tracking, apply an experimental manipulation to the receptive field, such as temperature or drug manipulations. The effects of these manipulations on the electrical threshold of the nociceptor will be tracked.\n\t\tNOTE: Allow sufficient time to identify a new nociceptor threshold following the experimental manipulation."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}