{
  "id": 17690,
  "origin_website": "Jove",
  "title": "Setup and Execution of the Rapid Cycle Deliberate Practice Death Notification Curriculum",
  "procedures": [
    "All methods described here were found to be exempt from review by the Indiana University Institutional Review Board.\n1. Preparation\nE-mail the GRIEV_ING pocket card (Figure 1) to all faculty one week prior to the scheduled simulation session.\nE-mail the death notification simulation scenarios (Supplement 1[href=https://www.jove.com/files/ftp_upload/61646/JoVE RCDP Standardized Patient Case Materials.docx]), that include patient role and background history, to the standardized patients one week prior to the scheduled simulation session.\nPrepare the simulation examination rooms prior to beginning the death notification simulation exercise.\n\t\nPlace a chair for the standardized patient and a stool for the learner in each examination room.\nPrint patient scenario information (Supplement 2[href=https://www.jove.com/files/ftp_upload/61646/JoVE RCDP Patient Scenario Information door note.docx]), which includes name, age, gender, background, present condition and survivor present, and post outside each exam room for learners. Have faculty read death notification scenarios prior to the start of the session.\n2. Rapid Cycle Deliberate Practice GRIEV_ING Simulation Exercise Pre-brief\nGather all faculty and learners in one room. Review the simulation session goals and objectives.\nReview logistic details about RCDP and the simulation environment.\nForm a fiction contract with the learners and pledge to respect the learners. \n\tNOTE: A fiction contract is an agreement between the educators and learners. This creates the expectation that educators attempt to create as realistic of simulation environment as possible while the learners pretend that things are real and actively participate in the educational experience14.\nDivide the learners into groups of no more than 4-5 learners.\nAssign each learner group an examination room with a faculty member and standardized patient.\nGive each learner a GRIEV_ING pocket card to reference during the simulation (Figure 1).\n3. Rapid Cycle Deliberate Practice GRIEV_ING Simulation Exercise\nSelect one learner from each group to perform the initial death notification scenario.",
    "Position the standardized patient in the exam room. Have the learners to review the simulation scenario case details posted outside the exam room.\nStart the initial death notification scenario. Run the scenario from start to finish without interruption. Identify specific areas that necessitate feedback.\nPerform a micro-debriefing at the conclusion of first scenario. Give succinct feedback to learners on initial performance in less than 5 minutes.\nReset the scenario and place the learners outside the room. Perform the same simulation scenario from the beginning. Begin with the same learner as the leader for the second round of the scenario.\nApply the RCDP technique during the scenario. Pause the scenario, provide directed feedback and then rewind the scenario 30-60 seconds. Have the standardized patient to restart the scenario.\n\tNOTE: In order to allow multiple students to participate in a single scenario, faculty can switch out the participating learner by “tagging in” observing students to continue the scenario. For example, if John started the scenario, faculty can stop, give feedback and rewind the scenario. Faculty then “tags in” Sam to resume the scenario as the new active participant from where John left off. Faculty should make sure all learners have an opportunity to be in the “hot seat” throughout the allotted training time.\nPerform a micro-debriefing at the conclusion of the scenario training period. Provide constructive feedback to the learners.\nRepeat the scenario again from the start and continue with the RCDP approach.\n\tNOTE: The goal is to need less interruptions each time the scenario is performed. The RCDP simulation exercise requires 45-50 minutes.\n4. Rapid Cycle Deliberate Practice GRIEV_ING Wrap Up",
    "Gather all faculty and learners in one room for a group wrap-up at the conclusion of the simulation training. Focus on key take-home points from the training and allow for learner feedback during the 15 minute wrap-up.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}