{
  "id": 12577,
  "origin_website": "Jove",
  "title": "The Deese-Roediger-McDermott (DRM) Task: A Simple Cognitive Paradigm to Investigate False Memories in the Laboratory",
  "procedures": [
    "The Institutional Review Board of the University of Notre Dame approved all of the procedures, including use of human subjects, discussed here. The preparation and the administration of the DRM task materials described below were used in a published study28, in which the effects of psychosocial stress following DRM word list encoding were assessed 24 h later.\n1. Preparation of DRM Task\nUse the word lists from Stadler, Roediger, and McDermott47, presented in the Appendix, to select the appropriate number of word lists for the experiment. From Tables 1 and 2, select the word lists with the highest probability of false recall and recognition. The more word lists used in the experiment, the greater the number of false words participants will have a chance to remember.\n\tNOTE: Tables 1 and 2 show the probability of false free recall and recognition memory, respectively, of the top 18 word lists used by Stadler et al.47. The Appendix presents the complete word lists. See also Gallo and Roediger48 for additional normed word lists.\nPrepare the encoding task\nChoose modality of presentation of word lists. See Discussion for issues regarding the selection of presentation modality.\n\t\tNOTE: Presentation modality can be either visual or auditory.\nIf auditory presentation is chosen, digitally record all the words in each list. Use professional-grade equipment (e.g., Rode NT1-A microphone), preferably an unfamiliar voice and a soundproof or sound-resistant room.\nRecord the word lists in descending strength of association, as they are presented in the Appendix, at a rate of one word every two seconds.\nAt the end of each list, include a reasonably long delay (e.g., 12 s) of silence, followed by a 1 s tone, 2 s of silence and then the start of the next list. This helps participants parse the individual lists.",
    "Use a audio-editing software (e.g., Audacity) to apply these standards.\n\t\t\nDrag and drop the audio file into the audio-editing software.\nUse the mouse cursor to select the portion of audio to which silence will be applied.\nOn the top, select Edit>Remove Audio>Silence Audio.\nTo apply the 1-s tone at the start of each list, use the copy and paste options in the audio-editing software.\nTo save the recording, press STOP, select File>Export, and choose file format and destination of the audio file.\nPrepare the testing task\nChoose a retention interval between encoding and testing that is appropriate for the experiment. If addressing the effects of stress on memory performance, choose at least 24 h.\nFor the free recall task, have a blank piece of paper or a blank document in a word-processing application (e.g., MS Word) ready.\nFor the recognition task, select words to include in recognition task.\n\t\t\nInclude study words (i.e. words presented at encoding) from positions 1, 8, and 10 from each list included in the encoding task2. See Appendix for complete word lists.\nInclude all critical lure words (i.e. false words not presented at encoding that represent the gist of the word list) from each list included in the encoding task. See Appendix for complete word lists and their appropriate critical lure.\nInclude the same number of additional, non-presented words (i.e. foil words that are unrelated to any of the studied DRM lists), from other, non-studied DRM word lists, from the same positions (1, 8, and 10) and their corresponding critical lures.",
    "NOTE: For example, if 15 DRM word lists are presented during encoding, for the recognition test, present 120 words: 45 study words, 15 critical lure words, 45 nonpresented list items from other non-studied DRM word lists, and 15 critical words from those nonstudied DRM word lists.\nUse experiment creation software (e.g., E-Prime) to create self-paced presentation of the words and to achieve data collection.\n\t\t\nUse black font with a white background, and reasonable font size, depending on screen size/resolution.\nIn a standard old/new recognition test, use separate keys to assign responses; such as the 'Z' key for old and the 'M' key for new. If possible, add this legend in with the presentation of each word on the screen. Software such as E-Prime will automatically collect reaction times and key responses.\n2. Administration of DRM Task\nAdministration of encoding task\nAsk subject to sit in front of device containing the recording of the word lists. Ensure subject is comfortable.\nRead the following instructions to the subjects: \"For this cognitive task you will be listening to lists of words. At the final word of each list, there will be a 12 s break, followed by a 1 s tone, followed by 2 s of silence, and then the start of the next list. Please pay close attention to the words because you will be tested on them at the next session.\"\nAsk subject to put on headphones. To ensure participants have no distractions, turn off the computer monitor. Press play.\nInform participant that this session has ended and provide them with instructions for the next (testing) session.\nAdministration of testing task\nFree recall test",
    "Ask subject to sit down in front of a table or desk (if using pen and paper) or in front of the computer (if using a word processing blank document).\nRead the following instructions to the subject: \"This part of the task involves a simple memory test. Please write down all the words you can remember from the lists you heard in the last session. You have 10 min to recall all the words you can. When there are 2 min left, I will let you know. Any questions?\"\nAnswer any questions the subject may have.\nStart the timer and inform subject of the two-minute warning mark.\nStop subject after time is up.\nRecognition test in the computer\nOpen recognition test with the experiment creation software.\nAsk subject to sit in front of computer.\nRead the following instructions to the subject: \"This is a simple recognition task. You will see a word on the screen. Use the keyboard to answer whether each word is old (that is, on one of the lists you heard/saw previously) or new. You will use the 'Z' key if you think the word is old and the 'M' key if you think the word is new. This is self-paced, but we are also measuring your reaction time, so answer as quickly but accurately as you can. Let me know you are done. Any questions? \".\nAnswer any questions the subject may have.\nStart the recognition test and wait for the subject to finish.\nDebrief the subject and thank them for their participation in the study.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}