{
  "id": 9504,
  "origin_website": "Jove",
  "title": "An In Vitro Preparation for Eliciting and Recording Feeding Motor Programs with Physiological Movements in Aplysia californica",
  "procedures": [
    "1. Preparation of Solutions\nTo prepare magnesium chloride solution that is isotonic to the seawater in which the animals are kept (~ 1,000 millosmolar), mark a large jug at the level of the desired volume. Fill the jug with distilled water to approximately 80% of this level, and weigh out the appropriate amount of magnesium chloride hexahydrate to create a 333 mM solution in the final volume. Add the magnesium chloride to the jug, close the lid and shake vigorously until the magnesium chloride is fully dissolved, and then add distilled water until the final volume is reached.\nTo prepare Aplysia saline, again mark a large jug at the level of the desired volume, and fill with distilled water to approximately 80% of this level. Place the jug on a stir plate, place a stir bar in the jug, and turn on the stir plate.\nOne by one, weigh out and add to the jug the appropriate amounts of the following substances to create these concentrations in the final volume: 460 mM sodium chloride, 10 mM potassium chloride, 22 mM magnesium chloride hexahydrate, 33 mM magnesium sulfate heptahydrate, 10 mM calcium chloride dihydrate, 10 mM glucose, 10 mM MOPS.\nOnce the solutes are fully dissolved, use a pH meter to measure the pH of the solution. Slowly add 1 M sodium hydroxide to raise the pH to a final value of 7.5. If you accidentally add too much sodium hydroxide, you can add 1 M hydrochloric acid to lower the pH.\nAdd distilled water until the final volume is reached.\nTo slow bacterial growth, store solutions in the refrigerator until needed for an experiment. Note that temperature can affect Aplysia motor programs. We do not carefully monitor temperature, but after setup is complete, preparations are typically near room temperature.",
    "2. Preparation of Recording Dish\nDuring the experiment, the buccal mass will be suspended in solution in a round 100 mm (diameter) x 50 mm (height) Pyrex dish. This dish should have a front chamber for the buccal mass, a narrow, elevated middle platform where the buccal ganglia are pinned on Sylgard, and a separate, elevated back chamber where the cerebral ganglion is isolated. A notch in the Sylgard should connect the buccal ganglia platform to the cerebral ganglion chamber. See Figure 1, referring to the specified key dimensions when constructing the dish.\nTo create this dish, begin with a round 100 x 50 mm Pyrex dish. Prepare Sylgard following the instructions provided with the product. Construction of the dish will require several pours of Sylgard, between which the Sylgard must be allowed to set.\nThe first pour is to create the highest level of Sylgard in the dish, the wall in between the buccal and cerebral chambers (refer to Figure 1). Block off this portion of the dish from the other sections. Modeling clay can be used to build walls for blocking off sections. For a flat wall, a piece of cardboard can be used, with a modeling clay backing. For a curved wall (which reduces the size of the chamber containing the cerebral ganglion), use modeling clay alone as the basis for the wall. Coat all the walls with plastic wrap where they will contact the Sylgard for easier removal.",
    "Once the space for the wall between the buccal and cerebral chambers has been blocked off as described in 2.3, ensuring tight seals at the edges to minimize leakage, pour Sylgard into this space nearly up to the top of the dish. Let the Sylgard set overnight, and make sure that it is fully set before continuing. Putting the dish in a warm place will induce faster setting.\nNext, the buccal ganglia platform and cerebral ganglion chamber should be poured (again, refer to Figure 1, which shows the locations of these ganglia in the completed dish). Remove the previous blocking walls, and create a new wall a distance 0.5 cm from the flat Sylgard wall of the middle section to block off the buccal ganglia platform. No walls are necessary to create the back chamber which will hold the cerebral ganglion. Pour Sylgard in both sections up to a height of about 3 mm below the top level. The cerebral chamber should be just slightly lower than the buccal ganglia platform. Again, let the Sylgard set overnight.\nLastly, pour the front chamber (i.e., the chamber in which the buccal mass will be suspended). No walls are necessary. Pour to the appropriate height as specified in Figure 1.\nThe final step is to cut a notch connecting the buccal ganglia platform and the cerebral chamber. The depth of the notch should be the same as the level of the buccal ganglia platform. A scalpel blade can be used to cut the notch. Figure 1 illustrates the completed dish.\n3. Electrode Preparation",
    "Pull extracellular electrodes from single-barreled capillary glass using a Flaming-Brown micropipette puller. The electrodes' inner diameters should be about 40 μm and their resistances should be about 0.1 MΩ. With the FT345B filament in the puller, our typical puller program settings are Heat 480, Pull 50, Vel 13, and Time 20, but note that settings will be different for different filaments. This program creates the electrodes in a single pull with no fire-polishing stage. Before beginning an experiment, backfill the extracellular electrodes with Aplysia saline.\nCreate hook electrodes for nerve and muscle recording2 following a similar protocol to that described by Cullins and Chiel4, except that individual electrodes do not have to be wrapped around each other. The steps to create these electrodes follow in 3.3-3.13.\nCut a piece of enamel-coated, 0.001 inch diameter stainless steel wire to a length of about 60 cm. Attach a ball of modeling clay to each end of the wire, hold the wire up in the air at its middle point, and spin the two balls of clay around each other to wrap the wires around one another (this reduces capacitative transients).\nHold the two ends of the wire together by joining the two balls of clay into one ball, and tape the other end of the wire to suspend the wire.\nCoat the entire length of wire in household silicone glue by placing a glob of glue on your thumb, touching your thumb and index finger together on the wire, and running them over the wire. Let the glue dry overnight.\nAfter the glue dries, place the wire on a flat surface under a binocular dissecting microscope. Cut the end of the wire that was previously the middle, resulting in two separate wires twisted together. This is a differential electrode.",
    "Use tape to hold one of the ends of the electrode in place. Using forceps to strip off glue and enamel, prepare both wires at one end to have approximately 2 cm of free wire with about 1 cm of the wire stripped of enamel. Solder a gold connector pin to each of the wires, and place lab tape around the pins to keep them separated.\nAt the other end of the electrode, prepare the wires to have about 3 mm of free wire. Remove the enamel from the last approximately 1 mm of one wire, and bend this wire back and out of the way. This is the reference wire. It is critical that the two wires do not have bare wire touching each other.\nRemove the enamel from the other wire all the way to the silicone glue. Twist this wire into a hook and cut it to a length of about 1 mm. This hook will attach to the nerve or muscle. Using a short hook provides greater stability when the nerve is being attached to the electrode.\nUse a multimeter to verify that the electrode is properly constructed and intact. One gold connector should have a resistance reading of roughly 200-500 ohms with respect to the tip of one wire, and the other gold connector should have a similar reading relative to the other wire.\nIf there is not an intact connection on one wire, it may be possible to re-strip the end of the wire and to re-solder one or both gold connectors to create these connections. If both gold connectors have connections with both wires, the electrode may have two bare wires making contact. It may be possible to fix the other end to eliminate this problem; otherwise, the electrode should be discarded.",
    "Repeat this procedure for as many electrodes as are needed for the experiment. Hook electrodes can be re-used from experiment to experiment by cutting off the end that attached to the nerve and creating new hooks, until the wire becomes too short after many uses. Each time this is done, use the multimeter to verify that the electrode is intact.\nTo keep track of the different electrodes during experiments, label electrodes and their cables. Using different colors of lab tape is helpful.\n4. Animal Dissection and Buccal Mass Preparation\nChoose a healthy animal of about 200-300 g weight. When presented with seaweed, the animal should produce bites with strong protractions at regular intervals of 3-5 sec.\nPlace the animal in a dissecting tray and anesthetize by injecting about 50% body weight isotonic magnesium chloride solution. Make the first injection with the syringe at about a 15 to 30 degree angle, near the middle and pointing toward the tail of the animal. After injection, gently massage the surface of the animal to spread out the magnesium chloride. Make additional injections as needed with the syringe pointing toward the head of the animal.\nAfter the animal stops responding to gentle tactile stimuli, pin the animal to the tray, dorsal side up, with one pin in the tail and one pin in each anterior tentacle.\nUse forceps to pinch and lift the animal's skin in the middle of the head, behind the rhinophores. Make a coronal incision across the animal's head, just behind the point being held. Then make a midsagittal incision going forward in between the rhinophores toward the mouth, exposing the buccal mass.",
    "Use forceps to pull the flap of skin closer to you away from the buccal mass, and cut through the nerves and connective tissue that attach to the body wall to fully separate this flap of skin from the buccal mass. Be sure not to cut any nerves or tissue intrinsic to the buccal mass.\nUse forceps to grab and hold the esophagus. Cut through the esophagus posterior to the point being held. Pull up on the esophagus to lift the buccal mass as the following cuts are made.\nBehind the buccal mass, the cerebral, pleural, and pedal ganglia form a ring, with the cerebral ganglion attached to the buccal ganglia by the cerebral-buccal connectives (CBCs). Leave these ring ganglia attached to the buccal mass, and cut all nerves projecting from these ganglia to other parts of the body.\nCut through the connective tissue all around the buccal mass, continuing to lift the buccal mass up as it becomes less connected to the body. Once the buccal mass is only attached at the mouth, the esophagus and buccal mass should be held straight up.\nMake a final cut just anterior to the jaws to free the buccal mass from the body. Place the buccal mass in a solution of 50% isotonic magnesium chloride solution and 50% Aplysia saline in order to maintain partial anesthetization while electrodes are attached.",
    "Place the buccal mass, with solution, in a Petri dish with Sylgard bottom. Remove the pleural and pedal ganglia by cutting their connections to the cerebral ganglion. Leave the cerebral ganglion attached to the buccal ganglia and the buccal mass via the cerebral-buccal connectives (CBCs); sever the other connections between the cerebral ganglion and buccal mass. Trim the esophagus and salivary glands to short lengths so they do not get in the way.\n5. Hook Electrode Attachment\nFor recording and stimulation, hook electrodes can be attached to a number of different nerves and muscles, as appropriate for the experiment (Figure 2).\nTo characterize patterns as demonstrated in vivo by Cullins and Chiel4, attach electrodes to the radular nerve, the I2 muscle, and buccal nerves 2 and 3. Together, these recordings show the activity of motor neurons for the major muscles intrinsic to the buccal mass3,7,8, and allow identification of the protraction phase from the I2 recording3, the retraction phase from the buccal nerves 2 and 3 recordings2,5,8, and timing of closure of the food grasper from the radular nerve recording2. Attach an additional hook electrode to branch a of buccal nerve 2 for pattern stimulation. Attachment of electrodes follows a procedure similar to that demonstrated by Cullins and Chiel4, and is described in the following steps.\nFor each electrode attachment, place the electrode on a coarse manipulator. To the manipulator, tape a wooden stick with an alligator clip on its end and use the clip to hold the end of the electrode. The clip should attach to the silicone-coated section of the electrode, about 1 cm before the end of the silicone coating. Use the manipulator to position the hook electrode near the buccal mass.",
    "With the buccal mass on its side and placed against the side of the dish for stability, begin with the radular nerve, which presents the most difficult electrode attachment. There are two options for accessing this nerve.\nThe radular nerve projects from underneath the buccal ganglion and goes under the I2 muscle in two branches. First, see whether the radular nerve can be accessed without cutting the muscle. Gently push aside the white sheath attaching the buccal ganglia to the I2 muscle; do not cut this sheath. If the nerve is accessible, use forceps with the tip bent into a hook to lift one branch of the nerve.\nIf the radular nerve is not accessible in this way, a second option is to locate the nerve beneath the thin I2 muscle, and make a small incision in I2 to expose the nerve. This incision should go through two layers of muscle. Use the hooked forceps to pull a branch of the radular nerve out from beneath the muscle.\nUse the manipulator to position the electrode's hook next to the nerve. To place the nerve into the hook, it is helpful to hold the nerve in the hooked forceps while simultaneously using another pair of forceps to create separation between the two halves of the nerve being held.\nAfter the nerve is securely in the hook, use the manipulator to lift the nerve away from the buccal mass until it is taut, but do not overstretch.\nTake a Kimwipe and tightly twist one corner to form a small wick. Use this wick to dry the end of the electrode and the section of nerve that is hooked.",
    "Use another set of curved-tip forceps to apply a glob of Quick Gel super glue to the hooked nerve. Begin the application at the point of contact between wire and nerve. Make sure that the hook is completely covered with glue, and that the tip of the reference wire is not covered with glue (Figure 3).\nUse a syringe with a polyethylene tubing attachment to apply solution from the dish onto the glue, which will induce the surface of the glue to set. Be sure to thoroughly bathe the glue with solution to ensure that the glue sets properly.\nUse the manipulator to release the tension on the nerve, and then release the electrode from the clip. This completes the procedure of attaching one hook electrode.\nThe I2 muscle electrode should be attached next. We record EMG activity from the I2 muscle rather than ENG activity from its innervating nerve because the I2 nerve is very small and difficult to access in an intact buccal mass. Near buccal nerve 2, use the hooked forceps to lift one or two bands of the I2 muscle, and use another pair of forceps to help separate them from the rest of the muscle. The portion of I2 separated should be similar in thickness to buccal nerve 2 or 3. Be careful not to over-separate (which may denervate the muscle). Attach a hook electrode with the same procedure used for the radular nerve.",
    "The next electrode to attach is that for branch a of buccal nerve 2. This branch can be electrically stimulated to induce motor programs9. Before buccal nerve 2 goes underneath the I1 muscle at the lateral groove, the nerve trifurcates; branch a is the first branch to split off. The branches are quite small, so the electrode attachment should be done with care. Follow the same procedure to attach the electrode.\nBuccal nerves 2 and 3 are easily accessed. Follow the same procedure, attaching the electrodes roughly halfway between the buccal ganglion and lateral groove.\nTo help distinguish neurons with unilateral vs. bilateral projections, it is also useful to attach electrodes to buccal nerves 2 and 3 on the other side of the buccal mass, as well as buccal nerve 2 branch a, because some neurons respond differently to ipsilateral vs. contralateral BN2-a stimulation.\n6. Positioning the Ganglion and Thinning the Sheath\nThe buccal mass will be moved to the round 100 x 50 mm Pyrex dish described in section 2. See Figure 1.\nApply a thin layer of vacuum grease to the notch between the cerebral and buccal chambers, using a pipet tip to pick up a glob of vacuum grease and spread it over the notch. We have found that vacuum grease minimizes leakage better than Vaseline. Fill the front chamber with Aplysia saline. Carefully move the buccal mass from the Petri dish to the front chamber of this larger dish, making sure that none of the electrodes are pulled tightly, which could break the nerves.",
    "If the dish must be transferred to another binocular dissecting microscope for thinning the sheath, be very careful with the hook electrodes. Group the electrodes on one side of the buccal mass together, and also group the electrodes on the other side of the buccal mass together. Carefully hold the electrodes by grasping the lab tape that covers the connector pins, again making sure that none of the electrodes are pulled tightly.\nWhen the dish is positioned under the microscope, the electrodes should be draped gently over the sides of the dish and rest on the platform next to the dish.\nDuring breaks and between stages of the experiment, aerate the saline in the buccal mass chamber using an aquarium airstone.\nPin the cerebral ganglion in the back with the cerebral-buccal connectives (CBCs) running through the notch. Apply more vacuum grease over the CBCs, then add more Aplysia saline to both parts of the dish, so the ganglia are completely submerged. Ensure that the amount of vacuum grease added is higher than the level of saline in either the cerebral or buccal chambers so no leakage occurs between the chambers. At this stage, the buccal mass should rest on the bottom of the front chamber so as not to pull too forcefully on the nerves and ganglia.\nPin the buccal ganglia on the middle platform. To avoid damaging the nerves that are still attached to the buccal mass, only place pins on the sheath between two nerves. Add two more pins on the side of the CBCs to stretch and anchor them.",
    "Keep the buccal ganglia flat or rotated based on the location of the neurons of interest. To rotate the buccal ganglion, use fine forceps to grab some excess sheath of the CBC and pin it down between buccal nerves 2 and 3. Then most of the cell bodies that are proximate to the back chamber and cannot be easily accessed from the top of the buccal ganglion can be seen. Lastly, add two pins on the sheath of the buccal ganglion proximate to the buccal mass side to minimize the movement of the buccal ganglion. See Figure 4.\nUse fine forceps to grab the sheath of the buccal ganglion proximate to the back chamber, and then cut away the excess sheath with fine scissors without exposing the cell bodies. In order to minimize damage, only remove the amount of sheath necessary to see the cell bodies.\n7. Stimulation and Recording\nAfter thinning of the sheath is completed, attach all electrode pins to their sockets on the cables that connect to the amplifiers. Again, make sure that the electrodes are not pulled tightly while doing this. Make sure that the electrodes are correctly attached to their appropriate cables and that the polarities are correct.\nTo wash out any remaining magnesium chloride, replace the Aplysia saline in the buccal mass chamber with fresh Aplysia saline.\nThread a silk suture through the soft tissue at the front of the buccal mass, anterodorsal to the jaw cartilage, and use two pieces of modeling clay to attach the suture to the edge of the dish, thus suspending the buccal mass from its anterior end. Note that the posterior end is suspended by the buccal nerves attached to the buccal ganglia.",
    "Position a manipulator holding a glass extracellular electrode so that the electrode tip is near the buccal ganglion.\nTo locate and identify a neuron, use the manipulator to gently press the tip of the extracellular electrode down onto the sheath over the neuron soma (Figure 5). Apply a stimulating current, and then switch the channel that is being used to excite the soma to recording mode in order to record the activity on the extracellular electrode and corresponding activity on the nerves (Figure 6). Refer to published ganglion maps and neuron descriptions, including nerve projections and muscle innervations, (e.g. 7,8) for help in identification of neurons.\nFor video recording of feeding programs, position a mirror at the side of the dish so that front and side views of the buccal mass can be seen simultaneously (location of the mirror is shown schematically in Figure 1). Position a video camera with both front and side views in its field of view.\nVideo and electrophysiological recordings can be synchronized by sending a TTL pulse both to an electronic timer in the camera's view and to a channel in AxoGraph, the computer program used to record and analyze electrophysiological data. This pulse provides a time point that is exactly the same in the AxoGraph and video recordings, based on which the files can be synchronized.\nAfter a neuron is located, its activity can be recorded in different feeding-like behaviors, which can be elicited as described below.\nTo induce rejection-like motor programs, stimulate BN2-a with a long train of 2 Hz, 1 msec pulses9 (our experience is that this stimulation reliably generates egestive patterns in this setting). Patterns continue for the duration of the stimulation and may continue until shortly after the stimulation ends.",
    "To induce biting-like motor programs12, place a few crystals of solid carbachol directly on the cerebral ganglion. Alternatively, if a controlled level of carbachol exposure is necessary, use a solution of between 1 and 10 mM carbachol in Aplysia saline. Higher concentrations are more likely to yield responses. Repetitive patterns generally begin within 5 min, and last for roughly 10 to 15 min before beginning to run down.\nTo induce swallowing-like motor programs13, apply carbachol, and wait until the buccal mass generates strong bites. Then, during a bite, place a strip of seaweed (dried laver) in the animal's mouth so that the radula grasps the seaweed (Figure 7). Strips are usually 0.5 cm wide by 5 cm in length.\nAfter the first series of carbachol-induced patterns, it is often possible to obtain additional carbachol responses. Thoroughly wash out the Aplysia saline in the cerebral ganglion chamber, removing and replacing the saline at least three times. Wait at least 20 min before applying carbachol again. Waiting up to 40 min may yield more reliable results.\nAt this time in the United States, invertebrate animals do not require formal approval by an institutional animal use and care committee. However, we have ensured that all treatments of Aplysia minimize harm and suffering to the animal, and that all dissections are done while the animal is fully anesthetized.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}