{
  "id": 2503,
  "origin_website": "Cell",
  "title": "Protocol to drive human monocyte-to-macrophage polarization in vitro using tumor conditioned media",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPart 1 - Macrophage differentiation using tumor-derived conditioned media\nTiming: 6 days\nThis step utilizes tumor cell-derived conditioned media (CM) to induce in vitro macrophage differentiation and polarization. Published work has shown that manipulation of tumor cell intrinsic traits, such as blocking/knocking down myosin II activity, perturbs their ability to polarize macrophages to a pro-tumoral state via changes in secreted factors (Georgouli et al., 2019[href=https://www.wicell.org#bib2]).\nDay 0\nSeed 1 × 106 CD14+ monocytes in 1 mL of RPMI complete (10% FBS, 1% Penicillin-Streptomycin, 2 mM L-glutamine) in a 24-well plate and incubate at 37°C, 5% CO2.\nIf you need a large cell number for functional assays downstream of monocyte-macrophage differentiation, you can scale up to these culture conditions:\n2 × 106 in a T12 well (2 mL culture media).\n4–5 × 106 in a T6 well (4 mL culture media).\nNote: Primary cells are sensitive, so reduce cell plate handling outside of the cell incubator for too long.\nTo prepare tumor conditioned media, harvest melanoma cells from the cell culture flask. Aspirate culture media, wash with PBS (−/− CaCl2/MgCl2) and incubate with trypsin (Gibco) for 1–2 min at 37°C, 5% CO2.\nResuspend detached cells in DMEM complete (10% FBS, 1% Penicillin-Streptomycin), centrifuge at 300 × g for 5 min and resuspend in fresh DMEM complete.\nSeed 2.5 × 105 melanoma cells in 2 mL/T6 well of DMEM complete overnight. Plate replicate wells or adjust to your needs based on final protein yield required.\nIf you need a large volume of conditioned media, you can scale up to these culture conditions:\n1.5 × 106 tumor cells in a 10 cm dish (10 mL culture media).\nDay 1\nDiscard culture media from melanoma cell cultures. Wash tumor cells twice with PBS (+/+ CaCl2/MgCl2; Gibco).",
    "Note: The presence of Ca2+/Mg2+ promotes adhesion and helps prevent cells detaching during the wash steps.\nAdd 1 mL of serum-free DMEM (1% Penicillin-Streptomycin) per T6 well.\nIf scaled up to a 10 cm dish, add 6 mL serum-free DMEM.\nIncubate cells at 37°C, 10% CO2 for 48 h for media conditioning.\nDay 3\nFor processing of conditioned media, harvest media from cell culture wells and centrifuge at 500 × g for 5 min to discard dead cells and debris.\nCritical: Make sure the conditioned media is kept on ice after harvest to maintain intact protein composition.\nTransfer the supernatant into Amicon-Ultra 3 kDa filter-pore falcons (Millipore) and centrifuge at 4,000 rpm in a swinging bucket rotor for 45 min at 4°C.\nProtein solutions should reduce to volumes of 200–400 μL when concentrating 4 mL conditioned media, but will vary depending on starting volume.\nQuantify conditioned media samples via BCA assay (Pierce) to calculate protein concentration levels as per manufacturer’s instructions (https://www.thermofisher.com/order/catalog/product/23227[href=https://www.thermofisher.com/order/catalog/product/23227]).\nAlways titrate conditioned media with several dilutions to find an optimal concentration to analyze from the BCA standard curve (1:2-1:5 in PBS works well).\nNote: Run serum-free DMEM as your blank (same dilution factor to match your samples).\nNormalize protein from each condition by resuspending desired conditioned media volumes into RPMI complete media at a concentration of 70 μg/mL (2×).\nCarefully take out 50% media from macrophage T24-wells (500 μL) and add 500 μL of 2× protein solution, so you have a final solution of 35 μg/mL (1×).\nNote: Be careful to pipette slowly at this stage, to the side of the well, not to disrupt the monocytes. Replenishing media this way helps to reduce metabolic waste and increase viability.",
    "For treatment, include a negative control of monocytes alone (RPMI media only). IL-4 (20 ng/mL), IL-10 (20 ng/mL), and M-CSF (50 ng/mL) can be used as positive controls for inducing alternatively-activated macrophages. IFN-γ (20 ng/mL) plus LPS (100 ng/mL) can be used to induce classically-activated macrophages.\nNote: IL-10 induces mainly CD163 expression and IL-4 induces mainly CD206 expression.\nDay 6\nAcquire bright-field images of macrophages at 10–20× magnification in order to analyze cell morphological differences by ImageJ software (see part 2 – Morphological assessment of macrophages[href=https://www.wicell.org#sec3.2]).\nCollect macrophage supernatants from all the conditions and transfer them into separate Eppendorfs.\nAdd 1 mL pre-cooled PBS (−/− CaCl2/MgCl2) to each well and place plates on ice for 30 min where cells will start to round up and detach.\nOptional: PBS can be supplemented with 2 mM EDTA to promote cell detachment.\nIn the meantime, spin down cell supernatants at 300 × g for 5 min to collect any floating cells, and resuspend in 100 μL FACS buffer (PBS−/−, 1% BSA, 2 mM EDTA, 0.1% NaN3).\nNote: Perform all centrifugation steps at 4°C. Floating cells will likely be monocytic or apoptotic.\nAfter cells start to detach, gently scrape off the cells with the flat end of a P1000 tip, then with a new tip, pipette up and down before transferring cells into a fresh Eppendorf tube.\nCombine cells with the supernatant fractions, centrifuge tubes at 300 × g for 5 min and perform a second wash with 1 mL FACS buffer.\nCentrifuge at 300 × g for 5 min at 4°C, resuspend in 100 μL FACS buffer and human TruStain FcX blocking solution (1:20; BioLegend) and incubate for 10 min at room temperature. Vortex gently.",
    "Note: Before the next step, either take a small proportion from each individual condition (creating a pool sample), or already have allocated a condition for your unstained and DAPI single stain control. Transfer into a new Eppendorf tube.\nSpin down samples at 300 × g for 5 min 4°C, and resuspend in FACS buffer containing a mixture of a 4-color antibody panel, with a staining volume total of 100 μL:\ntable:files/protocols_protocol_2010_5.csv\nVortex samples gently and incubate for 30 min at 4°C in the dark.\nWash twice with FACS buffer and finally resuspend in DAPI solution (5 μg/mL) for live/dead cell separation and acquire live samples on a flow cytometer (BD FACS CANTO II).\nOptional: It is also possible to fix cells in 1% formaldehyde (10 min room temperature incubation), centrifuge and resuspend in FACS buffer kept at 4°C if you wish to analyze later or the following day.\nIn parallel, prepare compensation beads to correct for fluorescence spill over from the fluorochrome-conjugated antibodies (single stain controls).\nAdd one drop each of both MACS Comp Beads (anti-mouse Igκ; Miltenyi Biotec) and one drop of MACS Comp Beads (blank) to 100 μL FACS buffer.\nFor each single stained control, the same antibody dilution is added.\nFor example, for the CD86-PE/Cyanine7 compensation tube, 4 μL are to be added to compensation beads.\nNote: In all FACS experiments, unstained controls shall be used to identify forward/side scatter parameters of the cell population and to determine background fluorescence. Single stains were used to determine the laser voltage and to correct spectral overlap. Fluorescence minus one (FMOs), single stained controls and isotype controls can also be used to aid in gating strategies.\nPart 2 – Morphological assessment of macrophages\nTiming: ½ day",
    "Morphological assessment of differentiated macrophages can be analyzed from brightfield microscopy images taken at day 6.\nAcquire at least one 10× image and three 20× images at different parts of the well.\nImport images into ImageJ software.\nAutomatic cell shape descriptor measurements (such as roundness, circularity and area) can be generating by using the ‘freehand selection’ tool to manually draw around the outline of cells.\nCells can also be manually categorized into distinct subsets such as elongated/spindle or spread/fried egg.\nThese shape descriptors allow distinction of different morphological states and the level of spreading or differentiation on the plate (see expected outcomes[href=https://www.wicell.org#expected-outcomes]).\nNote: 20× images are required to have better resolution of cell morphological protrusions and outlines.\nPart 3 – Macrophage tumor cell killing assay in vitro\nTiming: 3 days\nNote: This step investigates the functional behaviour of macrophages with regards to their ability to elicit tumor-cell killing. The assay was adapted from Bracher et al. (2007)[href=https://www.wicell.org#bib1] and was optimized according to experimental needs.\nTrypsinize and count melanoma target cells (A375M2, WM88), and label with CFSE (BioLegend) using the CFSE cell division tracker following manufacturer’s instructions (https://www.biolegend.com/de-de/products/cfse-cell-division-tracker-kit-9396[href=https://www.biolegend.com/de-de/products/cfse-cell-division-tracker-kit-9396]).\nCentrifuge tumor cells at 300 × g for 5 min and resuspend at 10–100 × 106 cells/mL in 5 μM CFSE working solution.\nIncubate cells for 20 min at room temperature or 37°C protected from light.\nQuench the staining by adding 5 times the original staining volume of cell culture media (RPMI) containing 10% FBS.\nWash CFSE-labeled melanoma cells and macrophages in complete RPMI before the co-culture.\nAdd targets (104 melanoma cells) to macrophages (105 macrophages) at a ratio of 1:10 (targets: effectors) in complete RPMI and incubate for 48 h in 48-well plates in duplicates.",
    "Upon cell harvesting with trypsin, wash the cells with FACS buffer and resuspend in DAPI solution (5 μg/mL) for viability staining and immediately acquire on a flow cytometer (BD FACS CANTO II).\nDiscrimination of two cell populations could be obtained by flow cytometry analysis:\nCFSE+DAPI+ (dead tumor cells).\nCFSE+DAPI- (live tumor cells).\nNote: This cytotoxicity assay detects tumor cell killing broadly without specifying if it is from phagocytosis. For a more specific assay for macrophage phagocytosis, please refer to the zymosan phagocytosis assay in Georgouli et al. (2019)[href=https://www.wicell.org#bib2]."
  ],
  "subjectAreas": [
    "Immunology",
    "Health Sciences",
    "Cell Isolation",
    "Cancer",
    "Cell Culture",
    "Cell-Based Assays",
    "Cell Differentiation"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}