{
  "id": 4487,
  "origin_website": "Bio",
  "title": "Extraction of Chloroplast Proteins from Transiently Transformed <em>Nicotiana benthamiana</em> Leaves",
  "procedures": [
    "Transient transformation of N. benthamiana Agrobacterium tumefaciens GV3101 strain harboring 19 K and Agrobacterium tumefaciens GV3101 strain carrying the recombinant binary plasmid for the transient expression of the gene of interest (with epitope tag) were streaked from glycerol stocks on YEP Agar plates (containing the appropriate antibiotics), respectively. Plates were incubated at 28 °C for 48 h to obtain single colonies.Single colonies from plates not older than 1 week were inoculated into 15 ml YEP medium (containing the appropriate antibiotics) in 50 ml tubes and incubated at 28 °C overnight at 180 rpm in an shaker.The next day the overnight cultures (OD600 between 1.0 and 1.5) were centrifuged at 2,500 x g for 10 min at room temperature. The supernatant was discarded.Each pellet was re-suspended in 5 ml of agromix buffer.The Agromix was incubated for 2 h in the dark at 120 rpm on a rotary shaker at room temperature.Both bacterial suspensions (19 K, gene of interest) were combined such that the final suspension with an OD600 between 0.5 and 1.0 consisted of 20% agrobacteria with 19 K and of 80% agrobacteria carrying the recombinant binary plasmid for the transient expression of the gene of interest in total.Note: This ratio for 19K in the infiltration mixture has been proven to be effective to enhance the transient expression of several proteins due to the suppression of gene silencing by 19K. However, the optimum ratio might be different for other proteins. An OD600 higher than 1.0 in the infiltration mixture could lead to effects of toxicity in tobacco.This mix was infiltrated by pressing the tip of a syringe without needle onto the lower leaf surface of 3-4 weeks old, well watered, Nicotiana benthamiana. The third, fourth and fifth youngest leaf were used for agroinfiltration (Figure 1A).",
    "Every leaf half was once injected with 100-150 µl of the mix (see Video 1). The infiltrated area on the leaves were marked using a marker pen (Figure 1B).Note: It is important to water the plants in the morning of the day on which the agroinfiltration takes place. Otherwise, it is difficult to infiltrate the leaf tissue successfully without damaging too much the tissue. <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Agroinfiltration procedure Chloroplast isolation of transiently transformed N. benthamiana Preliminary remark: For optimal yield of intact chloroplasts the plant material should be harvested from tobacco plants at the end of the dark cycle and kept in the dark to avoid excess levels of starch accumulation that can rupture the chloroplast envelope during centrifugation. In addition, all protocol steps are carried out at 4 °C.100 mg of plant material of transiently transformed N. benthamiana leaves, 2-3 days after agro-infiltration, were homogenized in 400 μl of ice-cold isolation buffer using a precooled glass homogenizer.The homogenate was filtered through a 47 μm nylon mesh and kept on ice and in the dark.Preparation of 40% Percoll layer: 132 µl of Percoll were mixed thoroughly with 198 µl of isolation buffer and the layer of 40% Percoll was deposited in the bottom of a 1.5 ml reaction tube.400 µl of the filtered chloroplast containing homogenate was placed carefully on top of the 40% Percoll layer and centrifuged at 7,000 x g at 4 °C for 1 min. The intact chloroplasts will sediment as a green pellet, whereas the broken chloroplasts remain on the top of the Percoll layer (Figure 2).Notes: Alternatively, the centrifugation of intact chloroplasts can also be performed more gently at 1,700 x g for 6 min at 4 °C.",
    "The supernatant was discarded and the chloroplasts were re-suspended gently in a small volume (20-30 µl) of isolation buffer. The chloroplast enriched suspension was kept on ice.The quality of the pelleted chloroplasts was confirmed by applying phase contrast microscopy. Intact chloroplasts appear opaque with a halo surrounding them (Figure 3A). Broken chloroplasts exhibit a dark green, granular, and non-refractive appearance (Figure 3B). Subsequently, the chloroplasts were centrifuged at 1,000 x g at 4 °C for 5 min to pellet the chloroplasts and the supernatant was removed and discarded.Chloroplasts were shock frozen in liquid nitrogen.The freeze-fractured chloroplasts were re-suspended in 50µl of ice-cold protein extraction buffer and centrifuged at 15,000 x g at 4 °C for 10 min.The supernatant (with soluble chloroplastidic proteins) was transferred to a new tube.The pellet, enriched with non-soluble chloroplastidic proteins, was re-suspended in 50 µl of ice-cold protein extraction buffer.Samples could either be stored at -70 °C or directly be used for western blot analyis to compare the protein expression in the chloroplast fraction versus total crude extract from transiently transformed tobacco leaves.Note: The protein yield for isolation of chloroplastidic proteins from 100 mg leaf material is in the range of 10 and 20 µg in total. 5-10 µg can be used for the western blot analysis."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}