{
  "id": 18303,
  "origin_website": "Jove",
  "title": "Turbidimetry on Human Washed Platelets: The Effect of the Pannexin1-inhibitor Brilliant Blue FCF on Collagen-induced Aggregation",
  "procedures": [
    "Five unrelated healthy volunteers were recruited for blood sampling for platelet isolation and aggregation tests. Written informed consent was obtained and the protocol was approved by the Central Ethics Committee of the Geneva University Hospitals. All volunteers certified to be healthy and to have not taken any platelet-interfering drugs during at least the 10 days preceding the experiments.\n1. Buffer Preparation for Human Blood Collection and Washed Platelet Isolation\nPrepare a 100 mL aqueous solution of acid-citrate-dextrose (ACD) by dissolving 1.4 g citric acid monohydrate (C6H8O7•H2O, 66.6 mM), 2.5 g trisodium citrate dihydrate (Na3C6H5O7•2 H2O, 85 mM) and 2 g of anhydrous D(+)-glucose. The pH of the solution is about 4.5.\nPrepare stock solutions for Tyrode's buffer as follows\nPrepare stock solution 1 by dissolving 80 g NaCl, 2 g KCl, 10 g NaHCO3 and 0.58 g NaH2PO4*H2O in 500 mL of distilled H2O. The respective final concentrations are 2.73 M, 53.6 mM, 238 mM and 8.4 mM. Keep the solution at 4 °C.\nPrepare stock solution 2 by dissolving 10.15 g MgCl2*6 H2O (100 mM) in 500 mL distilled H2O. Keep solution at 4 °C.\nPrepare stock solution 3 by dissolving 10.95 g (100 mM) CaCl2*6 H2O in 500 mL distilled H2O. Keep solution at 4 °C.\nPrepare Tyrode's buffer by diluting 2.5 mL of stock solution 1 in a final volume of 50 mL with distilled H2O. This corresponds to final concentrations of 136.5 mM NaCl, 2.68 mM KCl, 11.9 mM NaHCO3 and 0.42 mM NaH2PO4*H2O. Adjust the pH to 7.35 and sterilize by filtering with 0.22-μm filters.",
    "Prepare Tyrode's albumin 0.35% buffer (TA buffer7) by diluting 5 mL of stock solution 1, 1 mL of stock solution 2, 2 mL of stock solution 3, 0.5 mL 1M HEPES, 1.8 mL of 200 g/L human serum albumin and 0.1 g of anhydrous D(+)-glucose in a final volume of 100 mL distilled H2O.\nAdjust the pH to 7.35 with 1N HCl and set the osmolarity to 295 mOsm/L by adding distilled H2O (10% of total volume). Final concentrations in this solution are: 124 mM NaCl, 2.44 mM KCl, 10.82 mM NaHCO3, 0.38 mM NaH2PO4*H2O, 0.91 mM MgCl2*6 H2O, 1.82 mM CaCl2*6 H2O. Keep TA buffer at 37 °C during the whole experiment.\n2. Blood Collection\nCollect 45-50 mL of venous blood, from the antecubital vein using a 19 G needle and no or low tourniquet, into 50 mL tubes containing ACD anticoagulant (1 volume ACD for 6 volumes of blood). Discard the first 1-2 mL of blood to avoid the presence of thrombin and tissue factor.\nAfter collection, mix the blood with the ACD by gently inverting the tube. Incubate the sample for 10 min at 37 °C.\n3. Preparation of Human Washed Platelets\nPre-heat the centrifuge to 37 °C. All centrifugation steps below are performed at this temperature.\nDispatch the collected blood into 15 mL tubes (5 mL per tube) and centrifuge at 250 x g for 13 min to obtain PRP.\n\tNOTE: This centrifugation step results in the production of three layers in the sample: 1) The upper layer, composed of plasma, platelets, and a small fraction of white blood cells. 2) The intermediate layer, a portion rich in white blood cells. 3) The bottom layer, which is essentially composed of red blood cells.",
    "Collect the PRP by pipetting the upper layer carefully into a new 15 mL tube to maximally prevent contamination with red and white blood cells, and incubate for 10 min at 37 °C.\nCentrifuge the PRP at 2,200 x g for 12 min (for 5 mL PRP).\n\tNOTE: This centrifugation step should be performed with low brake or without brake.\nRemove the supernatant (platelet-poor plasma), and carefully resuspend the pellet with 10 mL of TA buffer containing 2 µL/mL of heparin (5,000 U/mL) and 2.5 µL/mL of 25 μM PGI2 using a plastic Pasteur pipet. Incubate for 10 min at 37 °C.\nAdd 2.5 µL/mL of 25 μM PGI2 and centrifuge for 8 min at 1,900 x g (with low brake or without brake).\nRemove the supernatant and resuspend the pellet with 5 mL TA buffer containing 2.5 µL/mL of 25 μM PGI2 using a plastic Pasteur pipet. Incubate for 10 min at 37 °C.\nDuring the incubation period, pipet 150 µL of the platelet suspension into a 1.5 mL tube and count platelets, using an automatized cell counter (that detects the size of blood cells by measuring the changes in direct-current resistance).\nAfter the 10 min incubation, add 2.5 µL/mL of 25 μM PGI2 to the platelet suspension and immediately centrifuge at 1,900 x g for 8 min.\nRemove the supernatant and resuspend the pellet to a concentration of 250,000 platelets/µL with an adequate volume of TA buffer (i.e. if the cell count is 500,000 per µL, resuspend in 10 mL TA buffer) containing 32 µL/mL of apyrase at 0.01 U/mL (final concentration 0.32 U/mL).",
    "NOTE: High concentration of apyrase is used to avoid the desensitization of P2X1 receptors induced by spontaneous secretion of ATP10,11 in absence of agonists. This is important because collagen-induced responses are induced by fast paracrine/autocrine activation of P2X1 by ATP released from activated platelets. If the platelet signaling pathway does not critically require preservation of P2X1 function, use 0.02 U/mL apyrase. Several studies (reviewed in Mahaut-Smith et al.10) demonstrated that 0.02 U/mL apyrase avoids ADP receptor P2Y1 desensitization with negligible P2X1 responses.\nIncubate the cell suspension for at least 30 min at 37 °C before performing the aggregometric measurements. The preparation is stable for 5 to 8 h.\n4. Aggregometry\nPrepare fibrinogen (56 mg/mL) in Tyrode's buffer.\nPipet 260 µL of platelet suspension into glass cuvettes (Figure 1A; left cuvette) containing 10 µL of fibrinogen (56 mg/mL) and a magnetic stirring rod, then incubate the suspension for 2 - 3 min at 37 °C in incubation wells present in the aggregometer (Figure 1B and 1C).\nPre-incubate with the Panx1 inhibitor Brilliant Blue FCF by adding 10 µL of a 2.8 mM or 28 mM stock solution (final concentration 100 μM and 1 mM, respectively) for 7 min at 37 °C.\nCalibrate the aggregometer to an assumptive 100% aggregation value by measuring the OD of a cuvette containing 10 µL fibrinogen (56 mg/mL), 10 µL Brilliant Blue FCF (2.8 mM or 28 mM) and TA buffer without platelets.\nPlace the cuvette in an aggregation well under automatic stirring and press the corresponding button on the keyboard of the computer linked to the aggregometer (i.e. press F1 if aggregation well 1 is used).\n\t\tNOTE: This experiment described below includes Brilliant Blue FCF. The compound used for calibration has to be adjusted to the experimental condition.",
    "Calibrate the aggregometer to an assumptive 0% aggregation value by using the same platelet sample that will be used for the experiment under automatic stirring.\nPlace the cuvette in the aggregation well and press the corresponding button on the keyboard of the computer linked to the aggregometer. Wait for about 20-30 s before proceeding. This delay serves to assure that no aggregation happens before adding the agonists.\n\t\tNOTE: As any difference in platelet number may have an effect on the measured OD, the 0% calibration step needs to be repeated for each individual measurement.\nAdd 20 µL of desired agonist, such as 15 µg/mL collagen (1 µg/mL final) or 1.125 mM arachidonic acid (75 µM final), into the cuvette. Immediately start the recording under continuous automatic stirring by pressing the corresponding button on the keyboard of the computer linked to the aggregometer.\n\tNOTE: The addition of the agonist induces platelet activation. Platelet aggregates can clearly be distinguished in the glass cuvette at the end of the experiment (Figure 1A; right cuvette).\nThe recording automatically stops after 6 min. At this point, save the data by clicking on the save icon of the computer.\n\tNOTE: The calculation of the rate of aggregation is performed by the computer, which expresses the end results of the aggregation process as a percentage.\nAnalyze the data.\nFor additional extensive information on protocols for the preparation of washed platelets suspensions and turbidimetric measurement of platelet aggregation, refer to other papers authored by experts in the field12,13.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}