{
  "id": 10859,
  "origin_website": "Jove",
  "title": "Double Emulsion Generation Using a Polydimethylsiloxane (PDMS) Co-axial Flow Focus Device",
  "procedures": [
    "1. SU8 Master Fabrication\nDesign the microfluidic structures for two layer fabrication using AutoCAD software and have the designs printed by a vendor on circuit board film with 10 µm resolution. The details of device design are given in an attached reference11 and the channel geometries are shown in Figure 1. The layers should include alignment marks to help collocate features from each fabrication layer12.\nPlace a pre-cleaned 3 inch diameter silicon wafer on a spin coater and turn on the vacuum to affix it to the chuck. Apply 1 ml of SU8-3035 in the center of the wafer and spin for 20 sec at 500 rpm, then 30 sec at 2,000 rpm, providing a layer thickness of 50 µm.\nRemove the wafer and bake on a 135 °C hotplate for 30 min. Allow the wafer to cool to RT before moving on to the next step.\nExpose the coated wafer to the 1st layer mask (Figure 2A) under a collimated 190 mW, 365 nm LED for 90 sec. After exposure, place the wafer on a 135 °C hotplate for 1 min, then cool to RT before proceeding to the next step.\nPlace the wafer on the spin coater and turn on the vacuum to affix it to the chuck. Apply 1 ml of SU8-2050 in the center of the wafer and spin for 20 sec at 500 rpm, then 30 sec at 1,375 rpm, resulting in a layer that provides an additional thickness of 135 µm.\nRemove the wafer and bake on a 135 °C hotplate for 30 min, then cool to RT before moving to the next step.",
    "Align the 2nd layer mask (Figure 2B) onto the geometry patterned in 1.3 and expose the coated wafer to a collimated 190 mW, 365 nm LED for 3 min. After exposure, place on a 135 °C hotplate for 1 min, then cool to RT before proceeding to the next step.\nDevelop the masks by immersing in a stirred bath of propylene glycol monomethyl ether acetate for 30 min. Wash the wafer in isopropanol and bake on a 135 °C hotplate for 1 min. Place the developed master in a 100 mm Petri dish for PDMS molding.\n2. PDMS Device Fabrication\nPrepare 10:1 PDMS by combining 50 g of silicone base with 5 g of curing agent in a plastic cup. Mix the contents with a rotary tool fitted with a stir stick. Degas the mixture inside a desiccator for 30 min, or until all air bubbles are removed.\nPour the PDMS to give a thickness of 3 mm over the master and place back into the desiccator for further degassing. Once all bubbles are removed, bake the device at 60 °C for 2 hr.\nCut the device from the mold using a scalpel and place on a clean surface with the patterned side up. Cut the PDMS mold in half with a razor blade to separate Master 1 from Master 2 (Figure 3a). On the piece containing the 50 µm fluid handling geometry imprinted by Master 1, punch the fluidic inlets and outlets with a 0.75 mm biopsy punch.",
    "Plasma treat the devices at 1 mbar O2 plasma for 60 sec in a 300 W plasma cleaner. Wet the surface of the unpunched piece of PDMS with a drop of DI water to temporarily retard PdMS-PDMS bonding and serve as a lubricant. While viewing through a stereo microscope, place Master 1 on Master 2 surface and slide the surfaces relatively until a mechanical lock is achieved when the recessed frames and protruding frames in Figure 3A mate.\nPlace the device in a 60 °C oven and bake the assembled device (Figure 3B) for two days at 60 °C to evaporate the water and complete bonding.\n3. Preparation of Reagents\nFill 1 ml syringe with distilled water for the inner phase.\nFill 1 ml syringe with HFE 7500 fluorinated oil with 1 wt. % biocompatible surfactant surfactant13 for the middle phase.\nFill 10 ml syringe with 10 wt. % polyethylene glycol (PEG) in water solution containing 1 wt. % Tween 20 and 1 wt. % sodium dodecyl sulfate for the continuous phase.\n4. System Preparation\nPlace the microfluidic chip on the stage of an inverted microscope coupled with a digital camera capable of < 100 µsec shutter speeds.\nMount all syringes on syringe pumps and attach 27 G needles. Attach ~ 30 cm lengths of PE-2 tubing on the needles and insert the loose ends into the appropriate punched holes in the device.\nInsert a 10 cm length of PE-2 into the exit port of the device and place the other end in a waste collection container.\nPrime the device by running the syringe pumps at high rates of speeds (2,000 µl/min) until fluid in the tubing segments reaches the inlet ports of the device.\n5. Emulsion Generation",
    "Focus the microscope on a region that contains the 50 µm x 50 µm orifice and the downstream exit channel.\nSet the syringe pumps to deliver fluid to the double emulsion generator at flow rates of 250 µl/hr for the inner phase, 100 µl/hr for the middle phase, and 700 µl/hr for the continuous phase and wait 10 min for equilibration.\nMaintain the flow rates of the inner and middle phases at 250 µl/hr and 100 µl/hr, respectively. Set the flow rate of the outer phase at 1,050 µl/hr. Wait 3-5 min for the double emulsions generation to stabilize under this set of flow conditions.\nAcquire 5 sec of video images at 30 Hz for offline processing via manual image analysis.\nRepeat 5.3 and 5.4 with the flow rates given in Table 1. The inner and middle phase flow rates are held constant and the carrier phase flow rate is varied by adjusting the setting of the syringe pump.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}