{
  "id": 18379,
  "origin_website": "Jove",
  "title": "Fabrication of Small Caliber Stent-grafts Using Electrospinning and Balloon Expandable Bare Metal Stents",
  "procedures": [
    "1. Electrospinning of Polyurethane on Mandrel Collector\nPrepare mandrel for electrospinning\nMelt approximately 8 ml of biocompatible, food-grade, water soluble support material in a graduated cylinder (approximately 9 mm diameter and 110 mm deep) at 155 °C using an oven.\nDip a 3 mm diameter and 100 mm long stainless steel mandrel to obtain a coating of support material on the surface of the mandrel. Prior to dipping, place the mandrels in the oven at 155 °C for approximately 15 min to raise the temperature of the mandrel surface which helps in wetting the surface with the molten support material.\nLet the dipped mandrel cool to approximately 140 °C while the molten support material solidifies forming a uniform thin coating on the mandrel surface. During the cooling process, hang the mandrel vertically so that gravity causes excess support material to drip off. This coating enables easy removal of the finished stent-graft from the mandrel.\nSetup of the mandrel collector of the electrospinning system (as shown in Figure 1)\nAlign the laboratory mixer horizontally and connect a plastic rod which will hold the stainless steel mandrel at the opposite end inside the fume hood.\nDissolve the support material from the tip of the mandrel by submerging only the tip of the mandrel in water to accommodate the plastic support rod at the end of the mandrel. Support the plastic support rod at the free end of the mandrel to assist in uniform rotation of the mandrel collector.\nUse set screws in the plastic support rods to secure the stainless steel mandrel and avoid slipping during electrospinning.\nGround the mandrel collector by attaching a U-shaped ground wire to the stainless steel mandrel. Use rubber O-rings to hold the ground wire to the sides of the mandrel.",
    "Setting up liquid polyurethane extrusion system of the electrospinning system\nMix dimethylacetamide (DMA) with 25% (m/v) polyurethane (PU) stock solution to obtain 15% (m/v) PU in DMA solution (e.g., add 6 ml of DMA to 9 ml of 25% PU solution).\n\t\tCAUTION! Work inside a fume hood with proper personal protective equipment.\nFill a 5 ml glass syringe with blunt end stainless steel needle (spinneret) with 15% PU solution.\nProgram the syringe pump to extrude at 0.01 ml/min based on the inner diameter of the syringe.\nMount the syringe with spinneret on the syringe pump horizontally with the needle tip approximately 20 cm from the mandrel collector. Insulate the syringe from the conductive parts of the syringe pump using rubber sheets to avoid electrical arcing.\nConnect the high voltage generator to the spinneret of the syringe using an alligator clip.\nRun the syringe pump at 0.01 ml/min and rotate the mandrel with the laboratory mixer running at slow speed (e.g., 50 rpm).\nApply a voltage differential of 20 kV across the spinneret and the collector mandrel. PU nanofibers will start depositing on the rotating mandrel and a thin layer will be visible within several minutes. Ensure the fume hood is turned off and exhaust is closed to avoid loss of electrospun nanofibers.\n2. Electrospinning a Stent-graft\nElectrospin PU nanofibers on a rotating mandrel for 2 hr to create a uniform tube (as explained in step 1).\nRemove the mandrel from the plastic rod connected to the laboratory mixer to install the bare metal stent. Turn on fume hood and open exhaust prior to removing the mandrel to ensure that remnant solvent fumes are removed.",
    "Slide the balloon expandable stainless steel stent26 onto the electrospun tube to a desired location. It may be necessary to slightly expand the stent so it slips on without damaging the electrospun tube.\nCrimp the stent to make sure that the stent is tightly set on the tube material on the mandrel and not loose enough to slide. This will also help to prevent delamination of the inner and outer layers.\nLoad the mandrel with tube and stent again on the plastic rod of the laboratory mixer for electrospinning the outer layer of the stent-graft.\nElectrospin nanofibers for 3 hr as explained in step 1 to fabricate the outer layer of the stent-graft.\nAfter electrospinning the outer later, circumferentially cut the PU material approximately 1 mm from the ends of the stent using a scalpel.\nSoak the mandrel with stent-graft in deionized water to dissolve the support material from the mandrel which will release the stent-graft from mandrel. Replace with fresh water as needed to dissolve the support material completely.\nOnce the support material is dissolved, gently remove the stent-graft from the mandrel and allow to dry. Consider soaking the removed stent-graft in deionized water to dissolve any remaining support material before allowing to air dry.\n3. Testing of Manufactured Stent-grafts\nSlide the stent-graft on a 3 mm trifold balloon.\nCrimp the stent-graft onto the balloon using a hand held crimping tool.\nInspect the crimped stent-graft using a microscope for uniform crimping and any other signs of failure like delamination or puncture of the cover material due to stent deformation.\nExpand the stent-graft to the designed diameter of 3 mm by pressurizing the trifold balloon with an inflation device and water. Again, examine the expanded stent-graft for uniform expansion and signs of failure.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}