{
  "id": 19523,
  "origin_website": "Jove",
  "title": "Demonstrating Hairy and Glabrous Skin Innervation in a 3D Pattern Using Multiple Fluorescent Staining and Tissue Clearing Approaches",
  "procedures": [
    "The present study was approved by the Ethics Committee of the Institute of Acupuncture and Moxibustion, China Academy of Chinese Medical Sciences (reference number D2018-04-13-1). All procedures were conducted following the National Institutes of Health Guide for the Care and Use of Laboratory Animals (National Academy Press, Washington, D.C., 1996). Three adult male rats (Sprague-Dawley, weight 230 ± 15 g) were used in this study. All animals were housed in a 12 h light/dark cycle with controlled temperature and humidity and allowed free access to food and water.\n1. Perfusion and sample preparation\nInject 250 mg/kg of tribromoethanol solution (see Table of Materials) intraperitoneally into the rat to induce euthanasia.\nOnce breathing stops, use stainless steel surgical scissors to open the thoracic cavity of the rat. Use 20 G needles to perfuse via the left cardiac ventricle13 at a rate of 3 mL/min with 100 mL of 0.9% normal saline followed by 250-300 mL of 4% paraformaldehyde in 0.1 M phosphate buffer (PB, pH 7.4) (Figure 1A,B).\nAfter perfusion, use a scalpel to remove the skin of the dorsum and sole from the hind paw.\n\t\nFor the samples requiring frozen section, post-fix the tissues in 4% paraformaldehyde in 0.1 M PB for 2 h; then cryoprotect the tissues in 25% sucrose in 0.1 M PB for more than 24 h at 4 °C\nFor the samples with the thick section that requires tissue clearing, post-fix the tissues in 4% paraformaldehyde in 1x phosphate-buffered saline (1x PBS) for 2 h; then cryoprotect the tissues in 1x PBS at 4 °C (Figure 1C–E).\n2. Triple fluorescent staining with CGRP, phalloidin, and LYVE1 followed by tissue clearing treatment",
    "NOTE: Triple fluorescent staining with CGRP, phalloidin and LYVE1 was applied to reveal the nerve fibers, blood vessels, and lymphatic vessels in hairy and glabrous skin on tissue sections with a thickness of 300 µm following tissue clearing treatment.\nPrepare 2% agarose in 1x PBS by heating in a micro-oven for 2 min until the agarose dissolves (see Table of Materials).\nAfter washing, embed the skin tissues into 2% agarose at 37 °C, and place them inside the icebox for cooling (Figure 1F,G).\nFix the mounted tissue on the vibratory microtome with the ice water and slice them at a thickness of 500 µm in the transversal direction. Use the following parameters to set the vibration slicer and finish slicing: speed, 0.50 mm/s, and amplitude, 1.5 mm (Figure 1H-K).\nAfter slicing, remove the agarose from the sections, and store them in a six-well plate with 1x PBS (pH 7.4) (Figure 1L).\nIncubate the tissue sections in a solution of 2% Triton X-100 in 1x PBS (TriX-PB) overnight at 4 °C. See Figure 2 for the following procedure.\nPlace the tissue sections into the blocking buffer and rotate at 72 rpm on the shaker overnight at 4 °C.\n\tNOTE: The blocking buffer composition is 10% normal donkey serum, 1% Triton-X 100, and 0.2% sodium azide in 1x PBS (see Table of Materials).\nTransfer the tissue sections into the solution containing the primary antibodies of mouse monoclonal anti-CGRP (1:500) and sheep polyclonal anti-LYVE1 antibody (1:500) in dilution buffer in the microcentrifuge tube (see Table of Materials), and rotate on the shaker for 2 days at 4 °C.\n\tNOTE: The dilution buffer composition is 1% normal donkey serum, 0.2% Triton-X 100, and 0.2% sodium azide in 1x PBS.",
    "Wash the tissue sections twice with washing buffer at room temperature, then keep them on the shaker overnight at 4 °C in washing buffer.\n\tNOTE: The washing buffer composition is 0.2% Triton-X 100 in 0.1 M PB (pH 7.4).\nThe next day, transfer the tissue sections into the mixed solution containing the secondary antibodies of donkey anti-mouse IgG H&L Alexa-Flour488 (1:500) and donkey anti-sheep IgG H&L Alexa-Flour405 (1:500), as well as Alexa-Flour594 phalloidin (1:1000) (see Table of Materials) in a microcentrifuge tube and rotate at 72 rpm on the shaker for 5 h at 4 °C.\nWash the tissue sections in a six-well plate with washing buffer for 1 h, twice, at room temperature. Keep the tissue sections in washing buffer on the shaker overnight at 4 °C.\nTransfer the tissue sections into the tissue clearing reagent (see Table of Materials, its volume was five times more than the sample volume) and rotate at 60 rpm on the shaker gently for 1 h at room temperature.\n\tNOTE: After this treatment, the tissue sections become clear (Figure 2B).\nMount the cleared tissues on the slide, circle the tissues with a spacer, and stick the gap with fresh tissue clearing reagent and coverslip.\n3. Triple fluorescent staining with CGRP, phalloidin, and LYVE1 following the conventional approach\nNOTE: As a comparison, the same staining was performed on tissue sections at a thickness of 30 µm following conventional techniques.\nSlice the tissue sections at 30 µm on a microtome in the transversal direction and mount them on the slide.\nAdd blocking solution with 3% normal donkey serum and 0.3% Triton X-100 in 0.1 M PB and incubate the sections for 30 min at room temperature.",
    "Remove the blocking solution and incubate the sections with the solution containing the primary antibodies of mouse monoclonal anti-CGRP (1:500) and sheep polyclonal anti-LYVE1 antibody (1:500) in dilution buffer overnight at 4 °C.\nThe next day, wash the tissue sections with 0.1 M PB (pH 7.4) three times, add the mixed solution containing the secondary antibodies of donkey anti-mouse IgG H&L Alexa-Flour488 (1:500) and donkey anti-sheep IgG H&L Alexa-Flour405 (1:500), as well as Alexa-Flour594 phalloidin (1:1000) on the sections and incubate for 1 h at room temperature.\nBefore microscopic observation, wash the sections in 0.1 M PB (pH 7.4) three times, then cover them with coverslips in 50% glycerin.\n4. Imaging and analyses\nObserve the stained samples under a fluorescent microscope, and then take the images using a confocal microscope.\nCapture 30 images (Z-stacks), each in 10 µm frames, from each 300 µm thick section and integrate a single in-focus image using an image processor of the confocal microscopy system (see Table of Materials).\n\t\nPerform the following steps in the image processing software of the confocal setup for three-dimensional (3D) analysis: Set Start Focal Plane | Set End focal plane | Set step size | Choose Depth Pattern | Image Capture | Z series.\n\t\tNOTE: The excitation and emission wavelengths of blue fluorescence signals were 401 nm and 421 nm, respectively. Excitation and emission wavelengths of green fluorescence signals were 499 nm and 519 nm, respectively. Excitation and emission wavelengths of red fluorescence signals were 591 nm and 618 nm, respectively. 152 µm is the diameter of the confocal pinhole (10x objective lens, NA: 0.4). The image capture resolution was 1024 × 1024 pixels.",
    "For the conventional samples (step 3), capture 30 images (Z-stacks) in 1 µm frames from each 30 µm thick section and further treat these images as mentioned above (steps 4.1-4.2).\nDemonstrate the images in the pattern of 3D reconstruction with the image processing system.\nPerform 3D reconstructions by importing Z-stack confocal images into Imaris 9.0 (cell imaging software, see Table of Materials) and create surface renderings based on stain intensities: Add new surfaces | Choose Source Channel | Determine the parameters in the smooth option of Surfaces Detail | Determine the parameters in the threshold option of Absolute Intensity | Classify Surfaces | Finish.\nAcquire data in the surface area of positive nerve fibers with the cell imaging software. Select the rendered image | Statistics | Detailed | Specific Values | Volume.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}