{
  "id": 17479,
  "origin_website": "Jove",
  "title": "Isolation of Adipose Derived Regenerative Cells for the Treatment of Erectile Dysfunction Following Radical Prostatectomy",
  "procedures": [
    "All methods described in the protocol were approved by the Danish National Ethics Committee (No. 37054), The Danish Health and Medicines Authority (EUDRA-CT number 2013-004220-11) and the Danish Data Protection Agency (2008-58-0035). The study was registered at ClinicalTrials.gov (NCT02240823). The study was performed in accordance with the Declaration of Helsinki monitored by the Good Clinical Practice (GCP) unit at Odense University Hospital. ADRC preparation was carried out in an authorized tissue establishment for the handling of human tissues and cells at Odense University Hospital (Danish Health and Medicines Authority, Authorization no. 29035).\n1. Recruitment of patient/participants\nTo participate in the trial recruit patients who fulfil the following criteria of inclusion.\n\t\nRecruit patients that are over 18 years of age, sexually active before RP and not infected with the sexually transmitted diseases e.g., human immunodeficiency virus infection, syphilis, or hepatitis.\nEnsure that they suffer from erectile dysfunction after a RP which was performed due to prostate cancer.\n\t\tNOTE: In this study, the patients were enrolled into the study 5-18 months after the RP and were included regardless of the surgery method: open/robotic assisted or nervesparing/non-nervesparing.\nEnsure that the value of prostate-specific antigen (PSA) had to be undetectable at the clinical follow up after the RP.\nEnsure that patients were sexually active before the RP, and still expressing a wish to remain sexually active after the RP. Ensure that pharmacological intervention with a phosphodiesterase type 5 inhibitor (PDE5 inhibitor) or a synthetic analog of prostaglandin E1 (PGE1) have been tried before participating and deemed insufficient.\nFurthermore, ensure that the patients have enough subcutaneous fat on the abdomen or thigh.\nExclude patients from the trial, if there were severe events under the anesthesia during the RP or if they were treated with anticoagulants.\n2. Liposuction",
    "NOTE: Liposuction is an operation that removes fat or lipocytes from the subcutaneous area. This part of the protocol is performed as a standard liposuction and the procedure is performed under sterile conditions in an operating theater. All instruments used under the procedure must be sterile and the surgeon must wear scrubs, sterile surgical gown, sterile gloves, surgical mask and hat.\nAnesthetize the patient.\n\t\nEnsure that the patient is under general anesthesia during the procedure, and this part is performed by an anesthesiologist.\nDisinfect the skin of the abdomen and scrotum with chlorhexidine 0.5% (clorhexidine spirit, 96% ethanol medicated chlorhexidine digluconate 77% W/W = 83% v/v). Use a surgical marker to draw up the areas on the abdomen were the liposuction is going to be performed. The area will usually be the area between the symphysis and the umbilicus.\nMake two 6 mm wide incisions in the skin of the abdomen with a scalpel (number 11). Place the incisions symmetrically and laterally from the updrawn area of liposuction.\n\t\nPut a bit of lubricant such petroleum jelly on the incisions, to make sure that the infiltration cannula slides in and out of the incisions easily during the liposuction.\nIntroduce a size 14 G infiltration cannula through the incisions in the skin. Inject modified Kleins solution subcutaneously in the marked areas parallel to the skin surface. Inject so much of the solution that the targeted tissue becomes swollen and firm, or tumescent.\n\tNOTE: The modified Kleins solution consists of a solution of 1,000 mL Ringers lactate and 1 mg adrenalin (epinephrine (1:1,000,000)). Do not ass local anesthesia to the solution, as it may have a negative impact on the ADRCs.\n\t\nInject a volume of modified Kleins solution that corresponds to the ratio 1:1 to adipose tissue.",
    "Wait for 10 min to maximize the effect of adrenalin and reduce the amount of blood in harvested adipose tissue.\nPerform a standard liposuction using a jet infusion liposuction to harvest 200-300 mL of adipose tissue. Use blunt cannulas that are hollow, to which an infusion tube and a nozzle are integrated. Attach the cannula to a suction device for liposuction.\n\tNOTE: A continuous fan-shaped water infusion loosens the fat tissue into fragments that can be easily be suctioned out through the opening in the cannula.\n\t\nIntroduce a 3 mm syringe with a blunt tip through the incisions on the abdomen\nCollect the adipose tissue in a lipo-collector to preserve the lipoaspirate in a sterile environment. The lipoaspirate will start to separate from the water phase.\nUse 50 mL sterile syringes to suck up the lipoaspirate from the lipo-collector.\n\t\nMinimize the volume of water sucked up in the syringes and screw on a plug on the tip of the syringes to keep the adipose tissue sterile.\nPlace syringes with tip downwards in a sterile plastic bag to start the separation of lipoaspirate from the water phase. Place bag in sterile container still with the tips facing downwards to continue separation.\n\t\nCover the container with sterile drape to secure the sterile environment during transportation.\n\t\tNOTE: According to the user manual of the machine used for the isolation, the lipoaspirate can be stored for up to a maximum of 4 h before isolation of the ADRCs however, we always process it immediately.\nClose the skin incisions with the surgeons preferred suture material. Place a compression garment, an abdominal binder, around the abdomen to reduce the postoperative edema.\nMake a penile block by injecting 20 mL bupivacaine 5 mg/mL containing 5 µg of adrenaline.",
    "Use a 20 mL syringe and apply with a 23 G needle, 1 ¼ inches long.\nApply 5 mL of bupivacaine in each quadrant in the subcutis.\nInject the bupivacaine at two sites, one placed ventrally the other dorsally. Introduce the needle in the whole of its length in the subcutaneous tissue pointing the needle laterally to the right and inject the anesthesia as the needle is retracted. Repeat the injection pointing the needle to the left.\n\t\tNOTE: The patient can now be awakened from the general anesthesia by the anesthesiologist.\n3. Isolation of ADRCs\nNOTE: The isolation process of ADRCs is performed as described in detail in the user manual following the device (see Table of Materials). It is important that the procedure is performed under sterile conditions to ensure that the lipoaspirate is not exposed to any contaminants during the purification of the ADRCs. The time taken for the isolation of ADRCs depends of the volume of lipoaspirate, but the whole procedure will approximately take 2.5 h using the semi-automatic device as described here.\nPlace all consumables and enzymes aseptically on a table covered by a sterile disposable surgical towel.\n\tNOTE: A procedure kit contains all necessary consumables and enzymes needed for the isolation of ADRCs from one patient. Besides this, three 37-39 ˚C, one-liter infusion bags of Lactated Ringers must be available along with sterile clothing, gloves and towels and ethanol for disinfection. Note down all lot numbers of consumables and enzymes and also the temperature of the Lactated Ringers, when connected to the system.\n\t\nWipe down the device with ethanol and following the manufacturer’s instructions\nLoad the consumable set onto the device and connect a bag of Lactated Ringers to the system.",
    "Perform the series of semi-automatic tests (system check and leak test) before adding the lipoaspirate.\nLet the lipoaspirate stand in 50 mL tubes while the steps in 3.1 are performed. This will allow the fat to separate from the liquid phase. Note down the total amount (in mL) of fat tissue and use this to ensure that the amount of loaded fat will be in the range of the device capacity.\nLoad the tissue when prompted to by the device. The machine will now drain off excess fluid and weigh the amount of fat tissue loaded before it is washed with Lactated Ringers.\n\t\nWhen the tissue has been washed and drained again, connect a new infusion bag with 37-39 ˚C Lactated Ringers when requested by the machine.\nReconstitute the commercially available enzyme containing collagenase and protease blend in 5 mL Lactated Ringers (one vial of enzyme is enough for fat amounts up to 270 mL).\nEnsure that the device displays the amount of enzyme (based on the tissue weight) to inject into the canister with the fat tissue. Once injected, the enzymatic digestion that is carried out under agitation will last around 20 min.\nAfter tissue digestion, let the agitator stop and check that the content is separated into two phases: an upper lipid-containing, yellow phase and a lower pink layer that contains the ADRCs. Let the latter layer drained into the cell processing chamber (that goes into the device built-in centrifuge) of the consumable set, while leaving the lipid layer behind.\nLet ADRCs concentrate in the cell processing chamber during multiple rounds of centrifugation. Now add 10 mL of Intravase (contains DNase, that helps to avoid clumping in the final ADRC suspension) reconstituted in Lactated Ringers. The enzymatic reaction lasts for 10 min after which the ADRCs are washed.",
    "NOTE: This step is fully automatic, and the machine will inform when the process is done.\nWhen the isolation of ADRCs is completed, resuspend the cells in 5 mL of Ringer Lactate. Aspirate the solution into a 5 mL syringe.\nMount a 3-way stopcock female Luer-lock on the 5 mL syringe containing the ADRCs, and aspirate 4 mL of ADRCs into another 5 mL sterile syringe.\nTransfer the last 1 mL into a 1 mL syringe. Use this 1 mL for ADRC characterization e.g., cell count, cell viability, analysis of surface markers by flow cytometry and ADRC differentiation ability.\nPut on a 25 G needle on the 5 mL syringe containing the 4 mL of ADRC’s before it is packed in a sterile drape. Use the ADRCs for injection into the recipient. In this case, the solution of ADRCs will on average contain 8.4-32.7 million cells.\n4. Implantation of the ADRCs into corpora cavernosum\nNOTE: This is a sterile procedure. All instruments must be sterile, and the person injecting the solution containing the stem cells into the corpora cavernosum must wear sterile gloves. The patient is awake during this procedure and will receive his own stem cells. The ADRCs are injected without counting the cells prior to injection.\nKeep the solution of ADRCs homogeneous by tilting the syringe gently until it is injected into the corpora cavernosum.\nPlace an aperture drape over the penis. Place a tourniquet at the root of the penis by using a silicone vessel loop. Tighten the loop and secure it with forceps curved pean. Make the tourniquet tight enough to stop the blood flow from the penis.",
    "Use two antiseptic swaps to disinfect the penile skin at injection site (lateral site of corpora cavernosum). Inject 1 mL of the solution containing ADRCs, in a direct angle into the corpora cavernosum on the right side at two different places, repeat this step afterwards in the left corpora cavernosum. Total volume of injected ADRCs is 4 mL.\nWait for 30 min and then remove the tourniquet.\nDischarge the patient after 2 h of observation after the injection of ADRCs, to secure that the patient is well recovered following the anesthesia.\n5. Postoperative care\nRecommend the patient to not do any physical performance that can raise the blood pressure within the first week, to prevent development of hematomas.\nRecommend the patient to wear the abdominal binder for 24 h the first 14 days after the surgery and hereafter for 14 days during the daytime.\nTreat postsurgical pain with oral acetaminophen (e.g., paracetamol; 1,000 mg, 4 times a day) and oral anti-inflammatory (e.g., ibuprofen; 400 mg 3 times a day)."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}