{
  "id": 10379,
  "origin_website": "Jove",
  "title": "A Macrophage Reporter Cell Assay to Examine Toll-Like Receptor-Mediated NF-kB/AP-1 Signaling on Adsorbed Protein Layers on Polymeric Surfaces",
  "procedures": [
    "1. Media and Reagent Preparation\nPrepare fibroblast media. Combine 450 mL of Dulbecco's modified Eagle medium (DMEM), 50 mL of fetal bovine serum (FBS), and 5 mL of penicillin/streptomycin. Store at 4 °C for up to 3 months.\nPrepare reporter macrophage growth media in 50 mL aliquots. Combine 45 mL of DMEM, 5 mL of FBS, 5 μg/mL mycoplasma elimination reagent (Table of Materials), and 200 μg/mL phleomycin D1 (Table of Materials). Store at 4 °C for up to 3 months.\nPrepare reporter macrophage assay media in 50 mL aliquots. Combine 45 mL of DMEM, 5 mL of heat inactivated FBS (HI-FBS), 5 μg/mL mycoplasma elimination reagent, and 200 μg/mL phleomycin D1. Store at 4 °C for up to 3 months.\n2. Coating Cell Culture Surfaces with Poly(methyl methacrylate)\nDissolve poly(methyl methacrylate) (PMMA) in chloroform at 20 mg/mL (e.g., 100 mg of PMMA in 5 mL of chloroform) in a 20 mL glass scintillation vial. Place a magnetic stir bar in the vial and allow to stir for at least 2 h, until all solids are dissolved.\nCAUTION: Chloroform is harmful if inhaled. Ensure to use solvent in a fume hood while wearing PVA gloves.\nPipette 400 µL of PMMA solution onto the center of a borosilicate glass microscope slide in a spin coater, and spin at 3000 rpm for 2 min. Prepare the number of slides required for the assay, as well as 3−5 extra for water contact angle measurement. Store slides in a clean box (sprayed and wiped with 70% ethanol) for future use.\nNOTE: Spin coating is often used to deposit a thin, uniform coating on a flat surface. A spin coater rotates a substrate at high speeds, using centrifugal force to spread the coating solution over the surface.",
    "Measure water contact angle at two random positions on the surface of extra coated slides (i.e., not the slides being used for cell culture) with a goniometer to ensure glass surface was completely coated with the polymer.\nNOTE: Only water of the highest purity (e.g., glass triple distilled) should be used for water contact angle measurements.\nIn a biological safety cabinet (BSC) attach 8-chamber sticky wells to PMMA coated-slides using sterile forceps and following aseptic technique. Press firmly on the top of the sticky wells to make sure they are strongly attached. Incubate the slides with attached sticky-wells at 37 °C overnight to secure the seal.\n\t\nTest the seal of the sticky wells by adding 200 µL of cell culture grade (endotoxin-free) water to each well. Incubate at room temperature (RT) for 60 min and ensure no leakage before proceeding. Aspirate the water, being careful not to disturb the PMMA coating.\nPerform endotoxin-free water washes by adding 300 µL of endotoxin-free water to each well and incubating for 1 h (three times), 12 h, and 24 h prior to use to remove any remaining solvent.\nTest endotoxin concentration of the slides to be used for cell culture. Incubate 200 µL of endotoxin-free reagent water (Table of Materials) in one well of each slide for 1 h. Measure endotoxin concentration in the extract using an endpoint chromogenic endotoxin assay (Table of Materials).\nNOTE: The following protocol is specific to the endotoxin assay kit listed in the Table of Materials.",
    "Use only water and consumables (i.e., pipette tips, microcentrifuge tubes and well plates) that are certified pyrogen-free (i.e., endotoxin-free) for this work. Also, any glassware used in the preparation of the polymer-coated surfaces should be depyrogenated using dry heat sterilization (250 °C for 30 min) prior to use10. Measuring endotoxin in the extract solution, as described here, can result in an underestimation of endotoxin on the material surface11,12. Consequently, it is recommended that when developing a polymer coating protocol, perform the endotoxin assay reaction (i.e., steps 2.5.4−2.5.6 for test samples [reagent water] or spike controls) directly within wells containing the coated sample to ensure no sources of endotoxin are inadvertently introduced into the system during the coating process.\n\t\nBring all test samples (i.e., extracts) and endotoxin assay reagents to RT. Reconstitute chromogenic reagent in assay buffer and endotoxin standard in reagent water, allow to dissolve for 5 min and gently swirl before using. Cover all bottles with paraffin film when not in use.\nCreate a 5−8 point standard dilution curve of endotoxin standard ranging from the lower to the upper limit of the assay by performing a serial dilution of the endotoxin standard in reagent water.\nTo control for enhancement or inhibition of the endotoxin assay in test samples, prepare a positive control (also called a spike control or spiked sample) by diluting a known amount of endotoxin in unused test sample solution.",
    "NOTE: The concentration of the positive control should be the same concentration as a standard in the middle of the standard curve. If the recovered amount of the endotoxin spike (i.e., concentration of the positive control minus the concentration of the unspiked test sample) is within 50−200% of the nominal concentration of the endotoxin spike, the extraction solution can be considered to not significantly interfere with the assay.\nAdd 50 µL of standards, samples, or spike controls to each well of a 96-well plate in duplicate or triplicate. Use reagent water as a negative control.\nAdd 50 µL of chromogenic reagent to every well. Add reagent quickly to all wells. Use a timer to record the amount of time it takes to add reagent to all wells. Cover the plate with an adhesive seal and incubate at 37 °C (incubation time is lot-dependent and stated on Certificate of Analysis included in the chromogenic reagent kit). Alternatively, check on the plate every 15 min during incubation until color change is observed in all standard wells.\nAfter incubation, add 25 µL of 50% acetic acid to each well (final concentration of 10% acetic acid per well) to stop the reaction. Add acetic acid in the same order as the chromogenic reagent was added. Read absorbance of the plate using a plate reader at 405 nm. Aspirate liquid and discard plate.\nNOTE: Acetic acid addition should take the same length of time to add to each well as the chromogenic reagent took (± 30 s).\nUltraviolet (UV) sterilize the slides for 30 min prior to cell culture experiments.\n3. Coating Cell Culture Surfaces with Polydimethylsiloxane",
    "Mix polydimethylsiloxane (PDMS) elastomer in a 10:1 weight ratio (base:curing agent). In a biological safety cabinet, pipette approximately 10 mL of polydimethylsiloxane base into a sterile tube. Weigh the tube and slowly add curing agent until 10% has been added.\nCAUTION: Use PDMS reagents in a well-ventilated area and avoid eye contact by wearing safety glasses.\nThoroughly mix the elastomer by stirring with a sterile serological pipette tip and by pipetting up and down. Add approximately 200 μL of the solution to each well of a 48-well plate. Tilt the well plate slowly to ensure complete coverage of wells with elastomer solution.\nPlace the well plate with elastomer into a vacuum oven set at 50 cmHg, 40 °C. Remove the lid and cover with a single-ply wipe to prevent other debris from falling into the wells. Allow to incubate for at least 48 h.\n\t\nConfirm the wells are completely coated via visual inspection. Ensure the elastomer is fully cured by gently prodding with a sterile pipette tip before removing.\nAdd 300 µL of 70% ethanol (made with absolute ethanol and endotoxin-free water) and incubate at RT for 1 h. Remove the ethanol and perform endotoxin-free water washes by adding 300 µL of endotoxin-free water to each well and incubating for 1 h (three times), 12 h, and 24 h prior to use to remove any remaining solvent.\n\t\nIncubate 200 µL of endotoxin-free water in three wells of each plate for 1 h. Measure endotoxin concentration of the water extracts using an endpoint chromogenic endotoxin assay (steps 2.5.1−2.5.6).\n4. Coating Cell Culture Surfaces with Fluorinated Poly(tetrafluoroethylene)",
    "Make a 1 mg/mL solution of fluorinated poly(tetrafluoroethylene) (fPTFE) (e.g., add 10 mg of fPTFE to 10 mL of fluorinated solvent [Table of Materials]) in a 20 mL glass scintillation vial. Place a magnetic stir bar in the vial and allow to stir for at least 24 h, until all solids are dissolved.\nAdd approximately 150 μL of the polymer solution to each well of a polystyrene 48-well plate (i.e., not tissue culture treated). Tilt the well plate slowly to ensure complete coverage of all wells with polymer solution. Replace lid.\n\t\nTo ensure effective fPTFE-coating of wells, glass coverslips should be coated in fPTFE and used for water contact angle measurement (step 4.3.1). Place coverslips inside the wells of a 24-well plate. Add approximately 400 μL of the polymer solution to each well containing a coverslip. Push the coverslips down using sterile forceps, ensuring they are completely covered in polymer solution, and cover the well plate with a lid.\nPlace the well plate with polymer solution and/or coverslips into a vacuum oven set at 50 cmHg, 40 °C. Remove the lid and cover with a single-ply wipe to prevent other debris from falling into the wells. Allow to incubate for at least 48 h.\n\t\nMeasure water contact angle of fPTFE-coated coverslips with a goniometer to ensure effective coating.\nNOTE: Only water of the highest purity (e.g., glass triple distilled) should be used for water contact angle measurements.\nAdd 300 µL of 70% ethanol (made with absolute ethanol and endotoxin-free water) and incubate at RT for 1 h. Remove the ethanol and perform endotoxin-free water washes by adding 300 µL of endotoxin-free water to each well and incubating for 1 h (three times), 12 h, and 24 h prior to use to remove any remaining solvent.",
    "Incubate 200 µL of endotoxin-free water in three wells of each plate for 1 h. Measure endotoxin concentration of water extracts using an endpoint chromogenic endotoxin assay (steps 2.5.1−2.5.6).\nUV sterilize the well plates for 30 min prior to cell culture experiments.\n5. Making Lysate from 3T3 Cells\nGrow 3T3 cells in multiple T150 flasks to 70% confluence. To detach cells, aspirate media, wash surface with 5 mL of PBS, and aspirate PBS. Add 5 mL of animal origin-free, recombinant cell dissociation enzyme (Table of Materials) and incubate at 37 °C for 3−5 min.\nDetach cells by gently tilting the flask back and forth. Add 5 mL of PBS to neutralize the recombinant enzyme used for cell dissociation. Transfer the detached cells from the flasks into a centrifuge tube and mix via pipetting. Perform a live cell count using a hemocytometer and cell viability dye.\nNOTE: A cell dissociation enzyme that can be neutralized through dilution in PBS was selected to avoid the introduction of serum-based proteins in the lysate preparation. If trypsin is used to dissociate cells, it should be neutralized with a serum-containing solution, and an additional PBS wash should be performed to reduce the amount of serum proteins carried over into the lysate preparation.\nCentrifuge the cells at 200 x g for 5 min. Aspirate the supernatant and resuspend cells in original volume (i.e., 10 mL x number of flasks) of PBS to wash off any remaining media. Repeat.\nCentrifuge the cells again at 200 x g for 5 min and aspirate the supernatant. Add the volume of PBS required to achieve a final cell concentration of 1 x 106 cells/mL. Place the cell solution into a -80 °C freezer until sample is fully frozen (at least 2 h).",
    "Thaw cell solution in a 37 °C water bath. Once completely thawed, place the solution back into the -80 °C freezer until totally frozen. Repeat for a total of 3 freeze-thaw cycles.\nPerform a micro bicinchoninic acid (BCA) assay on the cell lysate at a variety of dilutions (e.g., 1/100, 1/200, 1/500, 1/1000) to determine the protein concentration. Dilute the cell lysate to a protein concentration of 468.75 µg/mL, aliquot, and store at -80 °C for future use.\nNOTE: Final protein concentration in a 48-well plate is 125 µg/cm2 (based on the surface area of one well, 0.75 cm2).\nPerform a Western blot to assess presence of DAMPs in lysate (e.g., heat shock protein 60 [HSP60], high mobility group box 1 [HMGB1]) by loading 40−60 µg of lysate protein in loading buffer onto a 1.5 mm thick 10% polyacrylamide gel and follow standard Western blot procedures.\n6. Assessing Effect of Adsorbed Protein Layers and Toll-like Receptors on NF-κB Activity of Macrophages\nNOTE: For a schematic of the experimental workflow and plate layout, refer to Figure 1A and Supplemental Figure 1, respectively.\nGrow reporter macrophages in an appropriately sized flask to 70% confluence. Aspirate media, wash surface with PBS, and aspirate PBS. Add the recombinant cell dissociation enzyme and incubate at 37 °C for 8 min.\nDetach cells by firmly tapping the sides of the flask. Inactivate the recombinant cell dissociation enzyme by adding an equal volume of growth media (containing 10% FBS). Perform a live cell count using a hemocytometer and cell viability dye.\nNOTE: Expected viability for the reporter macrophages following an 8 min incubation in the cell dissociation enzyme is 90%.",
    "Centrifuge cells at 200 x g for 5 min. Aspirate supernatant and resuspend in original volume of PBS to wash cells. Centrifuge again and resuspend cells at 7.3 x 105 cells/mL in assay media (containing heat inactivated FBS).\nSeparate cell suspension into 3 different tubes: TLR4 inhibitor, anti-TLR2, and untreated. Incubate cells with 1 µg/mL TLR4 inhibitor for 60 min at RT or with 50 µg/mL anti-TLR2 for 30 min at RT.\nAdd 200 µL of lysate, 10% FBS, 10% commercial mouse plasma (Table of Materials), or a mixture of the protein solutions to a 48-well plate (or equivalent) and allow protein to adsorb at 37 °C for the desired amount of time (i.e., 30 min, 60 min, or 24 h). Aspirate protein solutions from wells, using a fresh Pasteur pipette for each protein solution, and wash surfaces with 250 µL of PBS for 5 min. Aspirate PBS. Repeat for a total of 3 washes.\nNOTE: This step may need to be started earlier in the protocol depending on desired adsorption time. Adjust protocol accordingly.\nAfter incubation period with the TLR4 inhibitor or anti-TLR2, pipette cells to resuspend. Add 200 µL of cell solution to each well.\nFor TLR2 positive control condition, add Pam3CSK4 to a final concentration of 150 ng/mL. For TLR4 positive control condition, add lipopolysaccharide (LPS) to a final concentration of 1.5 µg/mL. Incubate cells at 37 °C for 20 h.\nSample 20 µL of supernatant from each well and plate in duplicate into a 96-well plate. Include three wells of 20 µL assay media as a background control. Add 200 µL of SEAP reporter assay reagent to each well. Cover the plate with an adhesive seal and incubate for 2.5 h at 37 °C.",
    "NOTE: The incubation time may vary depending on experimental conditions, and should be optimized for a strong difference in absorbance between positive and negative control wells.\n\t\nTransfer the remainder of the supernatant to a 1.5 mL tube (per well). Centrifuge at 1,000 x g for 10 min to pellet any debris. Transfer supernatant to a new 1.5 mL tube and store at -80 °C. Analyze supernatant for the presence of proinflammatory cytokines (e.g., TNF-α, interleukin 6) via enzyme-linked immunosorbent assay (ELISA).\nRemove adhesive plate seal. Read absorbance of the plate using a plate reader at 635 nm. Aspirate liquid and discard plate.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}