{
  "id": 5295,
  "origin_website": "Bio",
  "title": "Affinity Pulldown of Biotinylated RNA for Detection of Protein-RNA Complexes",
  "procedures": [
    "Primer design and template generation for in vitro transcriptionThe forward and reverse primers with a length of 20-25 nt and melting temperature of ~60 °C are designed using Primer 3 online tool (http://bioinfo.ut.ee/primer3-0.4.0/[href=http://bioinfo.ut.ee/primer3-0.4.0/]) (Untergasser et al., 2012) (Note 1).As shown in Figure 1, add the T7 RNA polymerase promoter sequence (T7) [5’AGTAATACGACTCACTATAGGG] (red lines) upstream of the actual forward primer sequence (Figure 1).Dissolve the primers in nuclease-free water to a final concentration of 100 µM, then prepare a primer mix of forward and reverse primers at a final concentration of 1 µM each in nuclease-free water (e.g., 10 µl of each primer from the 100 µM stock into 980 µl of nuclease-free water and mix well).For one PCR reaction of 40 µl in a 0.2-ml PCR tube, add 4 µl of 10x DreamTaq DNA polymerase buffer, 10 µl of 1 µM primer mix, 1 µl DreamTaq DNA polymerase, 1 µl of 10 mM dNTP mix, 0.2 µl (~2 ng) cDNA, and water to make the final volume 40 µl. (The cDNA was prepared from total RNA as described previously [Panda et al., 2016].)Mix the reaction by vortexing for 5 sec and centrifuge the PCR tube strip for 30 sec using minicentrifuge to settle the reactions at the bottom of the wells.Set up the Veriti® 96-Well Thermal Cycler program as follows: 5 min at 95 °C and 40 cycles of 5 sec at 95 °C and 60 sec at 60 °C. Resolve the PCR products on an ethidium bromide stained 2% agarose gel for 1 h at 100 volts and visualize with an ultraviolet transilluminator. Cut the desired bands from the gel. Purify the PCR products corresponding to each fragment using the QIAquick Gel Extraction Kit and dissolve in elution buffer provided with the kit.",
    "Measure the concentration of the PCR products/templates with a NanoDrop spectrophotometer.The PCR product (T7 DNA template) can be stored at -20 °C or -80 °C, or used immediately for in vitro transcription.In vitro transcription of biotinylated RNA fragmentsThe biotinylated RNA can be prepared using the MEGAshortscriptTM T7 Kit following the manufacturer’s protocol.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161215/20161215021645_4469.jpgFigure 1. Schematic of biotinylated RNA pulldown assayIn vitro transcription reaction for each DNA template can be prepared in a 1.7-ml PCR tube containing 2 µl of 10x MEGAshortscriptTM T7 buffer, 2 µl of MEGAshortscriptTM T7 enzyme mix, 1 µl of RiboLock, 1 µl of 75 mM rATP, 1 µl of 75 mM rUTP, 1 µl of 75 mM rGTP, 0.8 µl of 75 mM rCTP, 1.5 µl of 10 mM Biotin-14-CTP, 100 ng of T7 DNA template and water to make the final volume 20 µl. (For longer RNA fragments [> 500 nt] the user should employ the MEGAscriptTM T7 Kit for in vitro RNA preparation) (Notes 5 and 6)Mix and centrifuge for ~5 sec at 500 x g to settle the reaction mixture at the bottom of the tube.Incubate the reaction at 37 °C for 4 h in a Thermomixer (Note 2).Add 1 µl of DNase provided in the kit and mix well followed by incubation for 15 min at 37 °C.Store the samples at -20 °C or -80 °C or proceed immediately to RNA purification. Purification and quality check of in vitro-transcribed biotinylated RNA fragmentsDilute the entire 20 µl in vitro transcribed RNA by adding 50 µl of nuclease-free water and keep on ice.Use one column (NucAway Spin Columns Kit) for each RNA fragment.Tap the powders to the bottom of columns and add 650 µl of nuclease-free water followed by vortexing at the highest speed for 10 sec.",
    "Incubate the column for 15 min at room temperature followed by centrifugation for 2 min at 750 x g.Pipet the in vitro-transcribed RNA onto the top of the column and put the column in a fresh 1.5-ml tube.Centrifuge the column for 2 min at 750 x g to collect the flow-through containing biotinylated RNA.The RNA concentration can be determined using the NanoDrop spectrophotometer.Store the purified samples at -20 °C or -80 °C until the quality of RNA is checked.To check the quality of the RNA, transfer 1 µg of transcribed RNA to a fresh tube and denature for 5 min at 70 °C with RNA sample preparation buffer provided in the MEGAshortscript kit.Resolve on a 6% TBE-Urea gel with 1x TBE buffer and visualize the RNAs on an ultraviolet transilluminator after staining with ethidium bromide. All RNA fragments should show single bands of the expected size.Store the RNA samples at -20 °C or -80 °C or use in the pulldown reaction.Preparation of cell lysateWash two 10-cm dishes of ~70% confluent cells of interest three times with PBS and collect them using a cell scraper. As the protein yield varies with the cell line, the user should adjust the number of cells needed to extract at least 500 µg protein for each pulldown assay. Pellet the cells in a 1.7-ml tube by centrifuging for 5 min at 500 x g.Disrupt the cell pellet by pipetting 10-20 times with 500 µl of polysome extraction buffer (PEB) containing protease and RNase inhibitors. Incubate for 10 min on ice.Collect the supernatant after centrifugation at 15,000 x g for 10 min at 4 °C using a refrigerated centrifuge. Determine protein concentrations by the Bradford protein assay following the manufacturer’s instructions using disposable cuvettes and a spectrophotometer at 595 nm wavelength.",
    "Store protein samples at -20 °C or -80 °C or use directly in pulldown reaction. Pulldown of interacting RNA-binding proteinPrepare the pulldown reaction in 1.5-ml tube containing 500 µg of cell lysate, 1 µg of purified biotinylated RNA, 1x protease inhibitor (add fresh), 5 µl of RiboLock, 250 µl of 2x TENT buffer (Tris, EDTA, NaCl, Triton; see Recipes) and PEB in 500 µl final volume.Mix the reaction by pipetting and incubate at room temperature for 30 min.In the meantime, wash 50 µl streptavidin-coupled Dynabeads for each reaction three times with 1x TENT buffer using the MagneSphere stand.Add 50 µl washed beads to the RNA-protein mixture prepared in step E1 (Note 7).Mix the beads by pipetting up and down.Incubate the reaction at room temperature for another 30 min with intermittent mixing by tapping the tube every ~5 min.Incubate the tube on the magnetic stand for 1 min to allow the magnetic beads to settle to one side of the tube.Discard the supernatant and mix the magnetic beads with 1 ml of ice-cold 1x TENT buffer.Repeat steps E7 and E8 3 more times.Add 40 µl of 1x Laemmli sample buffer supplemented with β-mercaptoethanol to the magnetic beads.Heat the samples for 5 min at 95 °C and proceed to Western blotting.Detection of interacting RNA-binding proteins (RBPs)Use Western blotting techniques to detect the RBP interest in the pulldown. Briefly, load at least three lanes on a 4-20% SDS-PAGE gel: (1) 10 µg (or 2% of the protein used for pulldown) of cell lysate as input, (2) the entire sample from the pulldown assay, and (3) a pre-stained protein ladder. Resolve these samples by electrophoresis following the manufacturer’s protocol.Transfer the protein to a nitrocellulose membrane using a Trans-Blot transfer system following the manufacturer’s instructions.",
    "Use standard Western blotting techniques to detect the RBP of interest using primary antibodies recognizing that RBP (Mahmood and Yang, 2012).Incubate with the appropriate secondary antibody to recognize the primary antibody and detect the signals using Enhanced Chemiluminescence (ECL)."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}