{
  "id": 8768,
  "origin_website": "Jove",
  "title": "Pentylenetetrazole-Induced Kindling Mouse Model",
  "procedures": [
    "All experimental procedures were approved by the Animal Care and Use Committee of the Tokyo Metropolitan Institute of Medical Science. Postnatal 8 - 16-week-old mice are recommended. Any inbred strain is acceptable for the experiment. C57BL/6 mice are more resistant to PTZ, whereas BALB/c and Swiss albino mice are more sensitive to PTZ. C57BL/6 were used in this study. Vulnerability to PTZ also depends on the age of the mouse. Compared to younger mice, older mice are more refractory to PTZ35. The number of animals used for this method can vary, but at least 6 - 10 animals are required for each condition.\n1. Preparation of PTZ\nDissolve 2 mg/mL PTZ in sterile 0.9% (w/v) NaCl. Prepare PTZ on the day of use.\n2. Injection of PTZ\nPerform all experiments between 9:00 a.m. and 12:00 p.m. (noon).\nMeasure the animal's body weight.\nPlace the animal in an observation chamber for habituation.\nDuring the habituation period (3 min), calculate the volume of PTZ solution for the injection based on the body weight of the animal and the previously determined injection dose.\n\tNOTE: For example, when 35 mg/kg PTZ is used, 0.875 mg of PTZ is required for a mouse weighing 25 g (35 mg/kg x 0.025 kg = 0.875 mg). Therefore, 437.5 μL of a 2 mg/mL PTZ solution should be injected (0.875 mg / 2 mg/mL = 0.4375 mL). The injection dose of PTZ depends on the mouse genotype and strain. For wild-type C57BL/6 mice, a dose of 30-35 mg PTZ/kg body weight is recommended for the first trial. Sensitivity to PTZ depends on the mouse strain used36,37. The injection dose varies according to the purpose of the experiment.",
    "Inject PTZ intraperitoneally with a 1-mL syringe attached to a 27-gauge needle into the left or right quadrant of the abdomen of the animal. Avoid injecting at the midline.\n\t\nAvoid repeated injections at the same position.\nObserve animal behaviors for 30 min after PTZ administration (Figure 1A), and classify and score the abnormal behavior as shown below. If possible, keep the animals under observation for 24 h, or at least an additional 6-10 h post-injection, especially once the seizure severity score reaches 3 or above.\n\t\nNote any mild seizures or behavioral changes in the animals beyond the 30-min observation period. This prolonged observation period may address a particularly important and complete effect of a subconvulsive dose of PTZ in the generation of chronic unprovoked seizures in epilepsy.\nIn addition, measure the seizure duration of each observed seizure as changes in seizure duration relate to the seizure severity. Moreover, the latency to the first seizure after the PTZ injection is another important measure to collect. Monitoring the seizure frequency, duration, and latency is critical for any post-seizure molecular studies.\nInject PTZ every other day (Figure 1A). The number of injections depends on the objective of the experiment. Representative examples are as follows.\n\t\nTo generate completely kindled animals, once an animal experiences a seizure with a score of 5 (tonic-clonic seizure), finish the injection within additional three administrations. In this case, increase the injection dose if the seizure score does not increase for three consecutive administrations. Each animal can receive a different number and dose of PTZ injections.",
    "Fix the number and dose of PTZ injection in every condition to evaluate the vulnerability to PTZ, including in assessments of anti-epilepsy drugs and studies of the phenotype of genetically modified mice. Give all animals the same number of PTZ injections; a total of 8 to 12 injections is recommended. If an animal dies, the seizure score should be denoted as 6.\nDetermine the injection dose necessary to maintain a high seizure score (4 or 5) for 10 or more injections to study the histopathological changes that occur epileptic seizures. In this case, the total injection number should range from 25 to 30. Decrease the injection dose if the seizure score reaches 5. If the seizure score decreases to 3 or lower, increase the injection dose.\n3. Seizure Score\nObserve the animal behaviors and record the scores.\n\t\nClassify and score the epileptic behaviors as follows38,39 (Figure 1B):\n\t\t0: normal behavior, no abnormality.\n\t\t1: immobilization, lying on belly.\n\t\t2: head nodding, facial, forelimb, or hindlimb myoclonus.\n\t\t3: continuous whole-body myoclonus, myoclonic jerks, tail held up stiffly.\n\t\t4: rearing, tonic seizure, falling down on its side.\n\t\t5: tonic-clonic seizure, falling down on its back, wild rushing and jumping.\n\t\t6: death.\nChange the behavioral criteria based on the Racine score40, depending on the experimental conditions.\n4. Post-Seizure Analysis\nImmunohistopathological analysis\n\t\nPerfusion fixation\n\t\t\nPreparation\n\t\t\t\nDissolve 4% (w/v) paraformaldehyde (PFA) in 0.1 M phosphate buffer (pH 7.4). Heat the solution to approximately 70 °C with the addition of a drop of 1 M NaOH (approximately 1 µL of 1 M NaOH for 50 mL PFA solution).\nPrepare ice-cold 4% PFA and phosphate-buffered saline (PBS).",
    "Set up a peristaltic pump, with a tube and needle. Run approximately 20 mL of water through the tube to clear out residue. Then, place the open end of the tube in ice-cold PBS.\nTranscardial perfusion and preparation of the fixed brain\n\t\t\t\nDeeply anesthetize the mouse with 50% isoflurane/50% ethanol in a small jar.\nKeep the mouse in a supine position by pinning the tips of their forelimbs and hindlimbs.\nCut the ventral midline of the abdomen and expose the diaphragm.\nCut the diaphragm along the costal margin. Then, cut both lateral sides of the ribs and body. Pinch the xiphoid process by the locking forceps and evert the rib cage. Maintain the position of the xiphoid process by pinning it with a needle or pinching it with forceps. Expose the heart.\nInsert the needle into the left ventricle and make a cut in the right atrium using scissors. Be aware not to push the needle too far into the heart, as it can pierce an interior wall.\nBegin a steady flow of ice-cold PBS through the needle to wash out the blood (approximately 15 - 20 mL/min).\nWhen the blood has been cleared from the body, move the tube to a 4% paraformaldehyde solution (approximately 60 mL) without the addition of bubbles. Then, stop the perfusion.\nCut the rear neck and spine and peel off the head skin and the dorsal part of the skull with dissecting scissors.\nCut the premaxillary bone between the eye orbits and completely remove the dorsal portion of the skull.",
    "Create a gap between the brain and jugal bone from the posterior side and cut the trigeminal nerves and optic chiasm underneath the brain. Carefully remove the brain and place it in a vial containing 4% PFA. Post-fix the brain at 4°C for 12-16 h.\nBrain slice preparation\n\t\t\nTransfer the fixed brain to 20% sucrose/PBS until the brain sinks into the solution to allow for cryoprotection.\nCut the fixed brain based on the required slice orientation and required part of the brain.\nSet the cryomicrotome. Set the blade in position and maintain the microtome stage at a temperature under -20 °C.\nPlace the pre-cut brain on the stage and coat the brain with 20% sucrose/PBS. The sucrose/PBS solution will gradually freeze, covering the brain on the stage, until the brain is completely embedded in frozen 20% sucrose/PBS.\nSlice the brain (30 µm thickness) by sliding the blade through the tissue. Transfer the slices into PBS and keep them at 4 °C.\nFluorescent immunohistochemistry\n\t\t\nWash the necessary slices in 0.1% Triton X-100/PBS (PBST) for 10 min, 3 times at room temperature (RT).\nBlock the slices by incubating them in PBST with 2% goat serum or 5% bovine serum albumin (BSA) for 1 - 2 h at RT.\nIncubate the slices in an antibody solution with the suitable concentration of primary antibody in PBST with 2% goat serum or 5% BSA for 1 to 7 overnights at 4 °C.\nWash the slices in PBST for 10 min, 3 times at RT.\nIncubate the slices in a secondary antibody solution with the suitable concentration of secondary antibody in PBST for 1 - 2 h at RT, light-protected.\nMount the slices onto glass slides and cover with mounting medium and cover glass.\nObserve the slices with fluorescence microscopy.\nThree-chamber test\n\t\nPreparation",
    "Prepare at least 2 2 - 6-month-old 129/Sv mice of the same sex as the subject mice to be the \"Stranger mouse.\" Habituate all mice in the cage before the analysis. For each training session, place the mouse in the cage and leave the mouse for 15 min.\nBefore each habituation phase with the subject mouse, clean the entire apparatus and both cages by wiping the surface with 70% ethanol.\nPlace the empty cages in the two side chambers of the 3-chamber apparatus and open the doors between the chambers.\nTo habituate the subject mouse, place a subject mouse in the center chamber and allow the mouse to freely move throughout the apparatus until the mouse has investigated both cages, plus an additional 5 min. Subject animals that may be fearful of the cage do not investigate the cage for 20 min and should not be used for this analysis. Such animals avoid the cage and rarely come close to the cage.\nAfter the animal moves into the center chamber, close the doors and let the mouse move freely in the center chamber for 5 min. During this period, put one of the 129/Sv mice in a cage to habituate to the cage.\nSociality analysis\n\t\t\nCarry out this analysis immediately after the habituation period of the subject mouse.\nPlace the cage containing a 129/Sv mouse, termed the \"Stranger 1 cage\", in one of the side chambers and place the empty cage, termed the \"Object cage\", in the other side chamber.\nOpen the door and monitor the behavior of the subject mouse.",
    "Allow the subject mouse to move freely for 10 min and record the following behavioral parameters. If the subject mouse is afraid of the mouse in the Stranger 1 cage, as indicated by the mouse avoiding the Stranger 1 cage and remaining in the corner of one of the chambers, the animal should not be used for the analysis.\n\t\t\ta) Time spent in each chamber, the Stranger 1 chamber, the Object chamber, and center chamber.\n\t\t\tb) Time spent investigating each cage, the Stranger 1 cage and the Object cage. (The mouse is classified as investigating the cage if the mouse is sniffing or toughing the mouse or cage)\n\t\t\tc) The number of entrances into each chamber (optional)\n\t\t\td) Total distance travelled (optional)\nAfter the mouse moves into the center chamber, close the doors.\nSocial novelty analysis\n\t\t\nCarry out this analysis immediately after the sociality analysis.\nWipe both cages with 70% ethanol.\nPlace another 129/Sv mouse in one of the cages, termed the \"Stranger 2 cage\" and place the Stranger 2 cage in one of the chambers. Place the Stranger 1 mouse in the other cage, termed the \"Stranger 1 cage\", and place the Stranger 1 cage in the other chamber.\nOpen the door and monitor the behavior of the subject mouse.\nAllow the subject mouse to move freely for 10 min, and measure the same behavioral parameters described for the sociality analysis.\n\t\t\tNOTE: The Stranger 1 and Stranger 2 mouse should be chosen randomly. The Stranger 1 chamber and Object chamber as well as the Stranger 1 chamber and Stranger 2 chamber should be randomly determined.\nContextual fear discrimination\n\t\nConditioning\n\t\t\nBefore each conditioning trial, clean the experimental apparatus by wiping the surface with 70% ethanol.",
    "Place a mouse in a conditioning apparatus with specific conditions (apparatus shape, wall color, floor material, odor, lighting, and background noise volume should be pre-determined). For example, the conditioning apparatus used here was a square apparatus with clear plexiglass walls, a metal grid floor, an ethanol odor, 100 lux brightness, and 65-dB background white noise.\nCondition the mouse by foot-shock with pseudo-random timing of 0.1-mA electrical shocks for 2 s x 3 times over the course of 5 min.\nReturn the mouse to the home cage after conditioning.\nMemory assessment\n\t\t\nBefore each assessment, clean the experimental apparatus by wiping the surface with 70% ethanol.\nThe next day following conditioning, place the mouse into the same apparatus as shock condition and measure the freezing time over the course of 5 min.\nLater the same day, place the mouse in a novel apparatus and measure the freezing time during a 5-min assessment. A triangular apparatus with white plexiglass walls, plate floor, no odor, 30 lux brightness, and 70-dB white noise was used here.\nCompare the freezing time between the same condition and novel condition. The mice with a normal memory ability will freeze more in the same condition than in the novel condition. Freezing is defined immobility of the animal for more than 2 s.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}