{
  "id": 8098,
  "origin_website": "Bio",
  "title": "Electroolfactogram (EOG) Recording in the Mouse Main Olfactory Epithelium",
  "procedures": [
    "A.   Preparation of electrodes    Glass capillary electrodes were pulled using a micropipette puller, then filled with Ringer’s solution and connected to the head stage of amplifier.    Silver wire of reference grounding electrode, which was an agar- and Ringer’s solution-filled, was connected to the head stage.     B. MOE dissection    Mice were sacrificed by decapitation. Skin overlying skull and lower jaw were removed with a small scissor.    The rostral part of head was separated from the caudal part with a scissor and was bisected sagittally among midline with a sharp razor blade.    Under a stereomicroscope, the septal cartilage and septum was carefully removed to expose the MOE, one of which was then put on the recording specimen stage. The other side was kept under moist condition for subsequent use.     C. Configuration of EOG recording    A filter paper immersed in Ringer’s solution was used to hold the sample on a plastic specimen stage during recording.    The filter paper was connected to Ringer’s bath solution and also served to connect the recording circuit as the reference electrode was immersed in Ringer’s bath solution.   Humidified nitrogen puff (nitrogen passing over dsH2O in a horizontal glass cylinder) was used because olfactory tissue remained viable for a longer period of time with humidified air. The air-puff was driven by a pressure tank containing compressed ultra-pure nitrogen gas.   Air-puffs were applied to the exposed MOE using an automated four-way slider valve that was controlled by a computer via a S48 stimulator. The duration of air puff was usually 100-200 ms. The tip of the puff application tube was directly pointed to the recording site on the MOE. The distance from tip of the air-puff application tube to surface of the recording turbinate was 1.5-2.0 centimeter.",
    "A flow meter was installed in line to regulate and measure the flow rate of air-puffs.    An oscilloscope was required to calibrate the scale of EOG amplitude. EOG recordings could be performed using various application flow rates (0.03-2.4 L/min), but low flow rate (0.03-0.5 L/min) was physiological relevant in mouse EOG recording.   If studying odorant-stimulated EOG response in the MOE, odorized air was generated by blowing nitrogen air through a horizontal glass cylinder that was half-filled with an odorant, i.e. 3-heptanone at variable concentrations.     D. EOG measurement    The EOG field potential was detected with a Ringer’s solution-filled glass microelectrode in contact with the apical surface of the olfactory epithelia in an open circuit configuration.   Electrophysiological EOG signals were amplified (normally 100x) with a CyberAmp 320 and digitized at 10 kHz or 1 kHz by means of a Digidata 1332A processor or simultaneously through a MiniDigi 1A processor; the signals were acquired online with software pClamp 10.3 and simultaneously with Axoscope 10.     E. Exclusion of artifacts from EOG recording of pressure-sensitive response   Occasionally, artifacts were seen in the EOG recordings due to damaged tissue preparations or other unpredicted reasons. Artifacts could be excluded from pressure-sensitive EOG recording on the basis of following criteria.    Artifacts usually had symmetric rising and decay phases while pressure-sensitive signals had a fast rising phase (about 100 msec) with a relative slow decay phase. The decay phase of pressure-stimulated EOG signals were readily fitted with a mono-exponential function, giving a deactivation time constant of 1,400 msec. Artifacts usually lacked the mono-exponential deactivation phase.   The half-width of maximum response of symmetric artifacts was about 200 msec, which is much shorter than the airflow-sensitive signal (about 600 msec).   Artifacts did not demonstrate amplitude adaptation upon repetitive stimulation, while the air pressure-sensitive response showed adaptation upon rapid repetitive stimulations.",
    "The amplitude of pressure-sensitive responses was much larger than that of artifacts. Pressure-sensitive responses were sensitive to odorants, forskolin/IBMX (that elevate cellular cAMP level), or SCH202676 (a general inhibitor of GPCRs) while artifacts were insensitive to these chemical treatments. Artifacts were more easily to be excluded from odorant-sensitive EOG recording because odorant-sensitive EOG recording was about several folds larger than pressure-sensitive EOG measurement.     F. Data analysis    Data were analyzed with Clampfit 10, and GraphPad Prism 5. The latency and rise time of EOG response could be analyzed with Clampfit 10. The desensitization and deactivation phases of the EOG field potential were fitted with a mono-exponential function f(t)= A0 x exp(-t/τ) + a, where τ is the time constant; A0 is the maximal response, a is residual response. Depending on stimulation protocols (i.e. inter-stimulation interval), olfaction adaption or recovery could be assayed using EOG amplitudes of repetitive odorant/air-pressure stimulation.    The kinetic and amplitude of EOG recording can provide some useful information about how olfactory signals are processed in olfactory sensory neurons.     G.Comparison of pressure-sensitive EOG response with odorant-stimulated EOG response    EOG measurement can be used to study both odorant- and air pressure-stimulated responses in the MOE.    Procedurally the major difference between pressure-sensitive EOG response and odorant-stimulated response was whether to use pure air puff or to use odorized air puff.   Two measurements also have several functional distinctions:   Most of odorant-stimulated EOG measurement more or less contained some portion of pressure-sensitive response because air-phase odorants need an air puff (which exert an air pressure) to be blown onto the surface of MOE.   Odorant-stimulated EOG response is generally higher than pressure-sensitive response although it may depend on dosage of stimulation (i.e. odorant concentration vs. flow rate of air puff).   Pressure-sensitive EOG response was positively correlated with odorant-stimulated EOG response.",
    "Most of EOG field potential amplitude varies from 0.5-50 mV depending the odorant concentration, application flow rate and tissue quality.   At high odorant dosage, decay phase of odorant-stimulated EOG response is much slower than that of the pressure-sensitive response.   Pressure-sensitive response and odor-evoked response in the MOE share a common signal pathway, both of which may function synergistically to promote olfaction."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}