{
  "id": 5839,
  "origin_website": "Bio",
  "title": "Rapid IFM Dissection for Visualizing Fluorescently Tagged Sarcomeric Proteins",
  "procedures": [
    "Prepare flies to dissectAnesthetize flies using standard CO2 pads. Use 5-10 days old flies.Transfer flies to a custom-made agar plate using a fine brush. Concentrate all flies in the center of the plate.Add 100 µl of Relaxing-Glycerol solution (see Recipes) to the flies using a previously cut pipette tip.Cut half-thoracesThe main goal of this step is to split the thorax into two symmetric halves (Figure 1 and Video 1). This step is relatively easy, however take note not to crush the muscles. If the blade is dull, replace it with a new blade.Use two fine forceps to remove the abdomen. Leave only the thorax and the head.Place and align the thorax with the dorsal side facing your eyes.Using a scalpel blade knife and a fast slicing movement cut the thorax in two symmetrical halves. Cut the head out if still attached to the thorax.At this point the IFM should be visible under the dissection microscope.Take the half-thoraxes with forceps and place them in a 1.5 ml microcentrifuge tube.Add 100 µl of Relaxing-Glycerol buffer. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171114/20171114010733_6701.jpgFigure 1. Dissection of the thorax into two halves. A-D. Snapshots from Video 1 showing critical dissection steps. A. Place the thorax with the dorsal side up; B. Gently touch the thorax to make sure the blade is positioned exactly at the middle and that the thorax will not move. C. Aim the tip of the blade at the head/thorax attachment site (arrowhead); D. With a sharp push cut the thorax; E. Representative thorax divided in two. Muscle fibers can be observed at this stage (red asterisks). Scale bars = 200 µm.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Dissection of the thorax into two halves. Dissection process recorded directly from the stereomicroscope. Snapshots of this video are presented in Figure 1.",
    "Remove mitochondriaThe mitochondria can be completely removed from the sample by an overnight incubation in Relaxing-Glycerol buffer at -20 °C without agitation (Figure 2). Removal of mitochondria makes imaging and staining easier. If mitochondria must be preserved, skip this section.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171114/20171114010824_4828.jpgFigure 2. Effect of glycerol extraction on mitochondria. A and B. Representative IFM expressing a mitochondrial:GFP protein and a mCherry-tagged Zasp52. A. In non-glycerinated IFM mitochondria can be detected; B. Mitochondria cannot be detected in glycerinated IFM. Scale bars = 10 µm.Paraformaldehyde fixationAdd 150 µl of 8% paraformaldehyde (see Recipes) to the tube that contains the thoraces in relaxing buffer. The final paraformaldehyde concentration should be around 4%. A 4% formaldehyde fixation solution can also be used. Incubate at room temperature for 45 min with slow agitation (~50 rpm).Wash by replacing fixing solution with PBST (see Recipes). Incubate in PBST for 15 min under slow agitation (~50 rpm). Repeat this step three times. Thoraces quickly sink to the bottom of a microcentrifuge tube.Dissection of muscle fibersThe main goal of this step is to separate the DLM fibers from the carcass without damaging them (Figure 3 and Video 2). Video 2 shows a detailed real-time dissection, see it before attempting to dissect the muscle fibers to get an idea of the overall process.Transfer the thoraces to a glass Petri dish using a previously cut pipette tip.Add enough PBST to just cover the tissue (excess liquid will make dissection challenging).Connect the needles to the syringes to make two dissection needles.Use two dissection needles to dissect the muscle fibers from the carcass (for details see Figure 4 and Video 2).Separate the fibers as much as possible without tearing the fibers apart.Transfer the fibers using a previously cut pipette tip back to a 1.5 ml microcentrifuge tube with PBST.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171114/20171114011043_7588.jpgFigure 3. General description of the IFM.",
    "A. Schematic view of a longitudinal section of a thorax, showing the position of the IFM. Two types of muscles compose the IFM, the dorsal longitudinal muscles (DLM, orange) and the dorsal ventral muscles (DVM, green). The goal of this protocol is to dissect the DLM. B. Representative isolated DLM, orange asterisks indicate individual DLM fibers (see also Video 2). Scale bar = 200 µm.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171114/20171114011120_3476.jpgFigure 4. Step-by-step guide to dissect DLM fibers. A-F. Snapshots from Video 2. A. Locate and hold the half-thorax using the left needle. Place the needle just below the DLM and above the legs. B. Make a small incision at the DLM posterior attachment site. C. Make a long cut above the DLM to completely separate the muscle fibers from the dorsal cuticle. D. Move the right needle to the ventral DLM (near the left needle). E. With the right needle push the DLM fibers out of the thorax. F. Isolated DLM can be further separated into individual fibers. G. Cartoon illustrating the dissection process. Dotted red lines mark the dissection needles. Note the small amount of liquid (~100 µl) in the dissection plate to prevent floating of half-thoraces. Scale bars = 200 µm.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Dissection of the DLM fibers. Stereomicroscope-recorded video showing the steps required for the correct dissection of the DLM fibers. Snapshots of this video are also presented in Figure 4.Phalloidin staining and mountingReplace the PBST solution with detergent-free PBS. Be careful not to aspirate the fibers.Add FITC- or TRITC-phalloidin (1:1,250) in triton-free PBS.Incubate at room temperature for 1-2 h with slow agitation (~50 rpm).Wash three times with PBST under slow agitation (~50 rpm).Transfer the muscle fibers to a glass slide.Dry the samples using a Kimwipe.Add a drop of mounting media, compatible with fluorescent labelling. Cover with coverslip compatible with confocal microscopy.",
    "Store at 4 °C.Confocal microscopyLocate the muscle fibers under brightfield at 20x magnification.Change the objective to 63x/1.4 NA and adjust the focus using brightfield to protect the sample.Scan the muscle fiber using the confocal software, align the fiber and take a full resolution scanning image at 9x magnification 1,024 x 1,024 pixels.Take several 9x images at different locations within the muscle fiber to get an accurate representation of the phenotype, especially when dealing with tissue from a mutant."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}