{
  "id": 7299,
  "origin_website": "Bio",
  "title": "Isolation and <em>in vitro</em> Culture of Mouse Oocytes",
  "procedures": [
    "Hormonal stimulation of micePrepare 20 IU/ml PMSG in saline and aliquot 1-ml volumes into 1.6-ml microcentrifuge tubes. Store at -80°C until required (stored aliquots are stable up to 12 months).Inject female mice intraperitoneally at the lower left-hand side of the abdomen with approximately 300 µl PMSG to a final dosage of 5-7 IU.House mice in sterile filter-top cages at 25°C for 46-48 h and feed a standard diet and water.Preparation of the mouth aspiration unitLight the alcohol burner containing absolute ethanol.Take a glass Pasteur pipette with the ends held between the thumb and forefinger of each hand and hold the narrow end over the flame so that it begins to soften.Remove the pipette from the flame and rapidly pull each end apart so that the softened glass can be stretched with the goal of achieving an internal diameter similar to that of an oocyte (approximately 80 µm). This may require numerous attempts to achieve the correct diameter, which can be ascertained by comparing the size of the pulled tip to that of oocytes after isolation.Cut or break the narrow length of the pipette to an appropriate length for handling.To assemble the mouth aspiration unit, attach the Pasteur pipette to a 1,000-µl volume pipette tip, then place the tip into a mouth aspiration tube as pictured in Figure 1Aii.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4104/bioprotoc-11-15-4104-g001.jpgFigure 1. Workflow for ovary collection and oocyte isolation. (A) Preparation of the dissection station. The insets depict dishes for isolating, denuding, and serial washing of oocytes (i) and the mouth aspiration unit assembly (ii). (B) Enlarged brightfield images of a mouse ovary with attached oviduct and uterine horns. (C) The ovary is dissected at the boundary between the ovary and the oviduct (cut site). Shown is an enlarged image of an ovary enclosed in fat.",
    "(D) Example of an ovary (fat removed) being disaggregated to release cumulus-oocyte complexes (COCs). (E) Isolated COCs. (F) Denuded oocytes following removal of cumulus cells. Scale bar: 50 μm.Preparation of the handling and culture mediaOn the day before ovary collection, filter 5 ml M16 culture medium through a 0.22-µm syringe-driven filter into a 15-ml centrifuge tube and place the tube with its lid loosened in an incubator set to 5% CO2 and 37°C to allow for CO2 equilibration (see Note 1).On the day of ovary collection (46-48 h following PMSG injection), prepare 3-4 100-µl droplets of CO2-equilibrated M16 in a 35-mm culture dish and overlay with mineral oil to prevent evaporation. This dish will be used for overnight culture of oocytes post-collection.Decant 5 ml handling medium into a 15-ml centrifuge tube and add 0.3% BSA w/v (5 ml medium requires 15 mg BSA).Place the handling medium on a tube roller mixer with the tube lid tightly closed to allow the BSA to dissolve (approximately 15 min).Filter the handling medium through a 0.22-µm syringe-driven filter, add IBMX to a final concentration of 100 µM (see Note 2), and pre-warm to 37°C by placing on a dry heating block.Prepare the workstation with the equipment pictured in Figure 1A.Prepare droplets of IBMX-treated handling medium in a 35-mm culture dish overlaid with mineral oil, as pictured in Figure 1A inset.Prepare 1 ml IBMX-treated handling medium in a 1.6-ml microcentrifuge tube and pre-warm to 37°C on a dry heating block.Ovary collectionSacrifice the mouse by cervical dislocation and place in the supine position. Spray the abdomen with 70% ethanol to wet the fur and prevent it from entering the abdominal cavity.",
    "Make a small incision in the skin on the lower abdomen with fine dissecting scissors and use gloved hands to gently pull the abdominal skin open to expose the peritoneal membrane.Clean any fur from the scissors with a paper towel, then cut the peritoneal membrane to expose the abdominal cavity.Using fine forceps, locate the uterine horn. Gently pull on the uterine horn, follow it cephalad to its extremity, and locate the ovary just inferior to the lower pole of the kidney.Use fine dissecting scissors to transect a portion of the uterine horn adjacent to the ovary and dissect the para-ovarian fat from surrounding tissues, as pictured in Figure 1B and C.Place the ovaries in the tube containing 1 ml pre-warmed IBMX-treated handling medium prepared in Part C and transfer to the lab.Oocyte isolationIn the lab, transfer ovaries into a 35-mm culture dish.Under a stereomicroscope, use fine forceps and the tip of a 27 G needle attached to a 1-ml syringe to carefully remove the surrounding oviduct, uterine horn, and fat from the ovaries, ensuring that the ovary is not damaged, as shown in Figure 1C and Video 1. The ovary appears light-pink in colour, while fat and the oviduct are white in colour.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Isolation of oocytes from a mouse ovary Once the ovaries are free of fat and other tissue, transfer them into another 35-mm culture dish containing 2 ml handling medium. Do not overlay this medium with mineral oil.Puncture the ovaries repeatedly with the needle to release cumulus-oocyte complexes (COCs), as pictured in Figure 1D and Video 1.Using the pulled glass Pasteur pipette prepared in Part B, select COCs (Figure 1E) from the dish and move to a second 35-mm culture dish with IBMX-treated handling medium droplets overlaid with mineral oil (Figure 1Ai).",
    "Denude oocytes of surrounding cumulus cells using the mouth-controlled aspiration unit to repeatedly aspirate and expel COCs through the tip of the glass pipette to produce cumulus- free oocytes, as pictured in Figure 1F and Video 1 (see Note 3).Wash the denuded oocytes with sequential droplets of IBMX-treated handling medium to remove any residual cumulus cells.Oocyte cultureTo induce resumption of meiosis, wash denuded oocytes with 5-6 100-µl droplets of IBMX-free M16 in a 60-mm culture dish (no mineral oil overlay).Place oocytes in the culture dish prepared in Part C (Figure 2A) and place in an incubator at 37°C and 5% CO2 for overnight culture.For analysing the rates of GV breakdown (GVBD), remove oocytes from the incubator 2 h following washout from IBMX and score for GVBD under a light microscope by checking for the disappearance of the GV (as pictured in Figure 2B).Rates of polar body extrusion (PBE) can be scored approximately 8-10 h following release from IBMX by checking for the presence of a PB under a light microscope, as pictured in Figure 2C. For time-series data, as shown in Figure 2D and E, score for GVBD and PBE at 30-min intervals (see Notes 4 and 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4104/bioprotoc-11-15-4104-g002.jpgFigure 2. Workflow for the in vitro maturation (IVM) of oocytes. (A) A culture dish containing drops of M16 medium under mineral oil overlay in the incubator used for IVM. (B) Brightfield image of oocytes cultured in IBMX-free M16 medium. Note that after 2 h, most oocytes have undergone GVBD. (C) Following overnight culture in IBMX-free M16 medium, a small PB has been extruded by the majority of oocytes. (D, E) GVBD and PBE rates in relation to time post-release from IBMX and post-GVBD, respectively. Error bars represent the mean of three biological replicates ± standard error of the mean (SEM).",
    "Scale bar: 50 μm."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}